{
  "content": [
    {
      "type": "text",
      "text": "# Howard H. Shore\n\nHoward H. Shore is a Superior Court Judge of San Diego County, California for Department SD-15. Shore's remarks were widely covered by the media after he announced that the First Amendment of the U.S. Constitution did not apply to chalk on the sidewalk, and he prohibited the defendant from mentioning terms like \"First Amendment\" or \"free speech\" during the trial.\nNotable Cases\nSidewalk chalk case\nIn October 2011, former U.S. Senator staffer Jeff Olson started protesting outside branches of Bank of America in San Diego. In response, bank official and former police officer Darell Freeman informed Olson that his credit union account at California Coast would be canceled if he continued to demonstrate, though Olson followed up with his bank and learned that wasn't true.\nOlson continued to protest, and in February 2012 he started writing anti-bank messages in chalk on the sidewalk in front of Bank of America branches. For the next six months, he visited a bank a few times a week to write slogans on the sidewalk such as \"Stop big banks,\" \"No thanks, big banks,\" and \"Matthew 21:12\" (a Bible verse where Jesus drove out bankers from the temple). In another case, Olson drew an octopus with bundles of cash held in its tentacles.\nOn August 28, 2012, Olson was contacted by Officer Bill Miles on behalf of the San Diego Gang Unit and he stopped protesting soon after. It was reported that Olson had completely stopped protesting by the time Bob Filner was elected San Diego Mayor in November 2012.\nOn January 7, 2013, the bank official (Freeman) requested that Officer Miles and then City Attorney Jan Goldsmith take action on Olson's case, even though he had stopped protesting.\n13 counts of vandalism filed\nOn April 16, 2012, the city filed 13 counts of vandalism against Olson based on previous incidents reported by Freeman. Judge Shore was assigned to the case. Each count of vandalism on the document had a suggested sentence range of \"1 Yr/$1,000,\" indicating that Olson was facing a possible 13 years in prison plus a fine of $13,000 for the 13 chalk offenses.  Although that was the theoretical maximum, local prosecutors and defense attorneys familiar with such cases were aware that the actual sentence, if convicted, would probably include a fine and some community service.\nMayor Filner at the time said the case was a \"waste of taxpayer money.\"\nFirst plea bargain\nOn May 16, Olson was offered a plea bargain to reduce his crimes to infractions, which would have given him a punishment of 32 hours of community service, a mandatory eight-hour seminar on behavior, a requirement to pay Bank of America $6,299 in restitution, a requirement to waive his Fourth Amendment rights regarding search and seizures, and a loss of his driver's licence for 3 years. Olson turned down the plea bargain.\nProhibition on mentioning first amendment rights during trial\nOn June 5, 2013, Judge Shore granted a motion by Deputy City Attorney Paige Hazard, which prohibited Olson's attorney Tom Tosdal from using any of the following terms during the trial: \"First Amendment,\" \"free speech,\" \"political speech,\" \"public forum,\" \"free expression,\" or \"expressive conduct.\" Media reports decried that Olson would not be allowed to claim his first amendment rights. However, Judge Shore stated that he was bound by precedent—specifically the published decision of the California Court of Appeal in Huntingdon Life Sciences, Inc. v Stop Huntingdon Animal Cruelty USA, Inc.(2005)129 Cal.App.4th 1228, a case involving California's anti-SLAPP statute (strategic lawsuit against public participation).  In a complex, lengthy decision, the Court of Appeal found certain activities of the employee to be constitutionally protected, but held, as to the vandalism, \"Vandalism, of course, is not a legitimate exercise of free speech rights, and if the complaint arose only from such conduct it would not be subject to an anti-SLAPP motion.\" 129 Cal.App.4th at p.&nbsp;1245.\nSecond plea bargain\nOlson was offered another plea bargain a week and a half later, on June 18, where pleading guilty to a single count of vandalism would reduce his sentence to three years probation, require him to pay restitution (undetermined amount), require he clean graffiti for 24 hours, and lose his driver's license for two years. Again, Olson turned down the plea bargain.\nProhibition on contact with the media\nOlson's trial began on June 26, 2013. Soon after, several media reports decried the suggested sentences as excessive, including in The LA Times, the San Diego Reader, NPR, Gawker, New York Daily News and The Huffington Post.\nShore objected to the reports that defense counsel and defendant were making statements to the media while the trial was ongoing, and issued a gag order that prohibited Olson or any witnesses involved with the case from having any contact with the media. He stated his concern that the case was being tried in the media, and that the comments could reach the jurors, who were bound by their oath to decide the case based only on the evidence presented at trial.  He remarked to the defense that they probably wouldn't appreciate the prosecutor making statements to the media about why the defendant should be found guilty.\nWithin a few days, approximately 30,000 people had signed a petition to stop the prosecution, and NPR showed that 95% of 15,000 people polled believed the charges were not justified.\nFinal ruling\nAfter the jury deliberated for two hours, Olson was found not guilty of all 13 charges.\nThe lead prosecutor, Paige Hazard, blamed Olson for turning down the plea offers and wasting taxpayer resources. An official statement from the City Attorney's Office criticized Olson for forcing the city to take the case to trial.\nMedical marijuana dispensary owner case\nProhibition on mentioning state laws\nIn 2010, Judge Shore ruled that a dispensary operator named Jovan Jackson was prohibited from using California's state medical marijuana law as part of his defense in a case for three charges of possession and sale of cannabis. Shore was required to interpret the meaning of the language in MMPA (Medical Marijuana Program Act (California Health and Safety Code 11362.7 et. seq.) that allowed a defense for patients \"who associate for the purpose of collectively cultivating medical marijuana.\"  Judge Shore conducted a pre-trial hearing, and heard testimony that the collective to which Jackson belonged had 1674 members, only a few of whom were involved in cultivation.  Shore held that the association was not formed for the purpose of cultivation, but for distribution. Jackson was convicted of a felony, and Judge Shore ordered him to pay a $5,000 fine, serve 6 months in jail, and serve 3 years of probation. In October 2012, the Court of Appeal reviewed Judge Shore's decision not to allow the collective cultivation defense, and Jackson's felony conviction was reversed. People v. Jackson (2012) 210 Cal.App.4th 525. The Court did not expressly disagree with Judge Shore's analysis, but held that, because there was no established definition of the language Judge Shore was called upon to interpret, the issue should have gone to the jury. Jackson was retried before another judge, and was allowed to use the defense, but was nonetheless convicted of all charges by the jury.\nReferences"
    }
  ]
}