{
  "content": [
    {
      "type": "text",
      "text": "# Howard Bison\n\nThe Howard Bison and Lady Bison are the intercollegiate athletic teams that represent Howard University, located in Washington, D.C. The Bison compete in Division I of the National Collegiate Athletic Association (NCAA)'s and Division I Football Championship Subdivision (FCS) and are members of the Mid-Eastern Athletic Conference for most sports. On July 16, 2015, the Athletics Department unveiled new logos, replacing the previous logo that was nearly identical to that used by the National Football League's Buffalo Bills.\nSponsored sports\n{| class=\"wikitable\" style= \" \"\n|-\n|-\n| Basketball || Basketball\n|-\n| Cross country || Bowling\n|-\n| Football || Cross country\n|-\n| Golf || Golf\n|-\n| Soccer || Lacrosse\n|-\n| Swimming and diving || Soccer\n|-\n| Tennis || Softball\n|-\n| Track and field† || Swimming and diving\n|-\n| || Tennis\n|-\n| || Track and field†\n|-\n| || Volleyball\n|-\n| colspan=\"2\" style=\"\" |\n|}\nA member of the Mid-Eastern Athletic Conference (MEAC), Howard University currently sponsors teams in nine men's and 12 women's NCAA sanctioned sports. Men's and women's golf became the newest varsity sports in the 2020–21 school year, with six years of program funding guaranteed by NBA superstar Stephen Curry.\nHoward University announced in July 2020 that it would join the Northeast Conference (NEC) as an associate member in six sports. Men's and women's swimming joined in 2020–21, with men's and women's soccer, women's lacrosse and women's golf following in 2021–22. Howard added men's golf to its NEC membership in 2022–23 after the MEAC and NEC entered into a partnership in baseball and golf that provided NEC associate membership to all MEAC members with teams in those sports.\nIn 2022, Howard University signed a 20-year partnership with Nike's Michael Jordan Brand.  The partnership aims to elevate Howard's athletic department.  Howard is the second HBCU to partner with the Jordan Brand.\nAs of 2023, Howard is the only HBCU that houses competitive swimming and dive teams.\nSoccer\nAs the only team in the MEAC playing men's soccer, the Bison's men's soccer team competed as an independent for many years, but the Bison became an affiliate member of the Sun Belt Conference when the conference resumed men's soccer after a 20-year absence in 2014. Over the years, Howard has had an up and down history, with NCAA championship seasons and other years seeing little success; the 2013 team had only one win in eighteen games.\nBison teams qualified for the NCAA tournament in 1962, 1963, 1970†, 1971†, 1972, 1974, 1975, 1976, 1980, 1988, 1989, and 1997. In six College Cup appearances, they were NCAA Champions in 1974, runners-up in 1988, third in 1972, and fourth in 1975; additional first (1971) and third (1970) place finishes were vacated by the NCAA; their vacation of the 1971 title was the first vacated Division I title in the history of the NCAA.\nAs of the 2021–2022 season, the men's and women's soccer teams are no longer affiliate members of the Sun Belt Conference, and are now affiliate members of the Northeast Conference.\nAthletic facilities\nWilliam H. Greene Stadium is a 7,086-seat multi-purpose stadium in Washington, D.C., in the United States, which opened in 1926.  It is home to the Howard University Bison football, soccer, track & field, and Women's lacrosse teams. Originally called Howard Stadium, it was renamed William H. Greene Stadium in 1986 in honor of William H. Greene, M.D., a Washington, D.C., physician.\nMarching band\nHoward's marching band is known as the \"Showtime\" Marching Band and it also features auxiliaries, the \"Ooh La La!\" dance team and the \"Flashy Flags\" color guard. The band has performed at several NFL games, the Macy's Thanksgiving Day Parade, the Honda Battle of the Bands, and the 56th Inaugural Parade for former U.S. President Barack Obama. The marching band's mission is to serve as a Howard ambassador and Bison athletics supporter.\nHonors\nDivision I National Championships\nMen's Soccer – 1971 (Vacated)\nMen's Soccer – 1974\n*Note: Howard initially won the 1971 NCAA Men's Soccer Championship. The Championship was later vacated by the NCAA on the grounds that two Howard players had played amateur soccer in Trinidad, exhausting their eligibility, and that two others had not taken entrance exams, required by the NCAA, to predict a grade point average of at least 1.6. Howard University argued that the eligibility rules were vague and discriminated against foreigners, and that the players had all maintained grade-point averages of 3.0 or higher in college, but the NCAA did not reverse the ruling. Although the NCAA stripped Howard of their first title, the university still respects and honors the accomplishments of their 1971 National Championship title team.\nRivals\nHoward's top rival is Hampton University. The two schools call their intense rivalry Battle of \"The Real HU\".\nHoward also has a strong rivalry with Morgan State University.\nAnother of Howard's historic rivals is Morehouse College, more popularly known as the Howard/ \"Spel-House\" rivalry due to Morehouse's close association with the all-women's  HBCU Spelman College.  This rivalry is not often played because Morehouse is an NCAA Division II athletic program, while Howard is NCAA Division I.\nReferences\nExternal links\n*\n|list =\n}}"
    }
  ]
}