{
  "content": [
    {
      "type": "text",
      "text": "# Howard M. Bahr\n\nHoward M. Bahr has been a professor of Sociology at Brigham Young University (BYU) since 1973 and was director of field research for the Middletown IV study in 1999.\nBahr received his bachelor's degree in Sociology with a minor in Psychology from BYU in 1962.  He then went to study at the University of Texas at Austin where he received an M.A. in 1964 and a Ph.D. in 1965.  Both of these were in Sociology with minors in Geography.\nHe then took a job as a researcher with Columbia University's Bureau of Applied Sociology.  He remained in this position until 1968 when he joined the faculty of Washington State University where he also worked as the university's Rural Sociologist.  During this time Bahr wrote his book Skid Row: An Introduction to Disaffiliation which has been widely cited.\nIn 1973 Bahr joined the faculty of BYU.  He had the previous year been the lead author of a book that rejected Malthusianism and its views on population growth and limits.  He would explore this theme in later writings as well.\nFrom 1977-1983 Bahr was the director of the BYU Family and Demographic Research Institute.  Also in 1976-1980 and in 1983-1985 Bahr was a visiting professor at the University of Virginia.  During this time he did a sociological study in Grenada jointly funded by BYU and the University of Virginia.\nBahr's wife Kathleen Slaugh Bahr is also a professor at BYU.  She earned a Ph.D. from Michigan State University.  They are the parents of four sons and have at least one book and multiple articles together.\nWorks\n;Books\n*Toward More Family-Centered Family Sciences: Love, Sacrifice and Transcendence (with Kathleen S. Bahr) Lanham, Maryland and London: Lexington Books, 2009.\n*The Navajo as Seen by the Franciscans (editor) Scarecrow Press: 2004.\n*Diné Bibliography to the 1990s: A Companion to the Navajo Bibliography to 1969 Lanham and London: Scarecrow Press, 1999.\n*Recent Social Trends in the United States: 1960-1990 (with Theodore Caplow and John Modell)\n*Middletown Families: Fifty Years of Continuity and Change (with Theodore Caplow)\n*''All Faithful People: Change and Continuity in Middletown's Region (with Theodore Caplow and Bruce A. Chadwick) University of Minnesota Press, 1983.\n*Divorce and Remarriage: Problems, Adaptations and Adjustments (With Kristen L. Goodman and Stan L. Albrecht) Westport, Connecticut: Greenwood Press, 1983.\n*Skid Row: An Introduction to Disaffiliation New York: Oxford University Press, 1973 (345 pages).\n*Old Men Drunk and Sober with Theodore Caplow.\n*Population Resources and the Future: Non-Malthusian Perspective'' (with Bruce A. Chadwick and Darwin L. Thomas) Provo: BYU Press, 1972.\n;Articles\n*\"Finding Oneself Among the Saints: Thomas F. O'Dea, Mormon Intellectuals and the Future of Mormon Orthodoxy\" in Journal for the Scientific Study of Religion Vol. 47, no 3 (Sep. 2008)\n*\"Families and Self-Sacrifice: Alternative Models and Meanings for Family Theory\" (with Kathleen S. Bahr) in Social Forces Vol. 75, no. 4, June 2001.\n*\"Toward a Social Science of Contemporary Mormonism\" (with Renata Tonks Forste) BYU Studies Vol 26 (Winter 1986) No. 1, p.&nbsp;92.\n*\"Evaluation of An Indian Student Placement Program\" in Social Casework Vol. 67 (Nov. 1986) p.&nbsp;515-524.\nReferences\n*[https://www.pbs.org/fmc/interviews/bahr.htm PBS interview with Bahr]\n*[https://web.archive.org/web/20100621145904/https://facultyprofile.byu.edu/PublicFacultyProfile/vita/vita_hmb.doc Bahr's vita]\n*[https://web.archive.org/web/20120708183851/http://www.worldcongress.org/WCF/wcf_spkrs_bio.htm#B#B Presentation bio on Kathleen Bahr]\nExternal links\n*[http://www.ncjrs.gov/App/publications/Abstract.aspx?id=26948 NCJRS abstracts for Skid Row]\n*[https://scholar.google.com/scholar?q=%22Howard+M.+Bahr%22&hl=en&btnG=Search&as_sdt=80000001&as_sdtp=on google scholar search results for Bahr, most useful to show that Skid Row is his most cited book]\n*[http://www.goodreads.com/author/show/639984.Howard_M_Bahr Good Reads listing for Bahr]"
    }
  ]
}