{
  "content": [
    {
      "type": "text",
      "text": "# Howard Menger\n\n| birth_place =  Brooklyn, New York\n| death_date  =\n| death_place =\n| occupation     =\n| spouse         = Connie Menger (nee; Weber)\n| parents        =\n| children       = Eric Menger (son) Heidi Menger (daughter)\n}}\nHoward Menger (February 17, 1922 – February 25, 2009) was an American contactee who claimed to have met extraterrestrials throughout the course of his life, meetings which were the subject of books he wrote, such as From Outer Space To You and The High Bridge Incident. Menger, who rose to prominence as a charismatic contactee detailing his chats with friendly Adamski-style Venusian \"space brothers\" in the late 1950s, was accepted by some UFO believers.\nLater in his life Menger stated in several documentaries that he believed he had misunderstood the space aliens and where they came from. He stated the space aliens did not live on Venus but they had bases on Venus or were passing by or exploring the planet. Menger also wrote about this newer position about where he  believed the space people come from in one of his later books.\nMenger states:\n\"'Years ago, on a T.V. program, when I first voiced my opinion that the people I met and talked with from the craft might not be extraterrestrial, it was thought that I had recanted. However, they (the aliens) said they had just come from the planet we call Venus (or Mars). It is my opinion that these space travelers may have by-passed or visited other planets (as we are planning) but were not native to those planets any more than our astronauts are native to the moon.'\"\nThere are also some who claim the memories of Howard Menger, George Adamski, Buck Nelson and other contactees were manipulated by evil ET's (known as the Omegans) in order to trick them into believing in life on Venus in order to discredit the message of the positive ET's.\nMenger had religious revelations to impart after his \"experiences,\" and also came back from his contacts with practical messages.\nWhen he was still young he moved with his parents to the rolling hills of Hunterdon County, New Jersey. His first alleged contact with a person from another planet was at the age of ten, in the woods near his hometown of High Bridge, New Jersey.\nReferences\nSources\n*Lewis, James R., editor. UFOs and Popular Culture Santa Barbara, CA. ABC-CLIO, Inc., 2000. .\nExternal links\n*  howardmenger.com used to be Howard Menger's website. It has either been hacked or lost, but can be found at the Internet Archive."
    }
  ]
}