{
  "content": [
    {
      "type": "text",
      "text": "# Howard Hughes (radio presenter)\n\nHoward Hughes (died November 2024) was a British podcaster, and journalist working in radio. Hughes presented news bulletins on many UK radio stations. He also presented The Unexplained, a radio show and podcast which was about unexplained and unexplainable events.\nEducation\nHughes attended a secondary school in Crosby, Merseyside. His journalistic training took place at Cardiff University.\nCareer\nVery early in his career, Hughes worked at a pirate radio station, Radio Nova, in the Republic of Ireland. He then worked at Radio Wyvern, a radio station in Worcester, England; his activities in his time at the station included newsreading and newsgathering, presenting the breakfast show and presenting the afternoon show. In 1988, he left the station and began working at County Sound in Guildford.\nHughes moved to presenting the news for Independent Radio News in the early 1990s, and following this he worked at BBC Radio Berkshire, a station which he would return to many years later. After this, he worked at Capital Radio in London on the station's breakfast show, which was presented by Chris Tarrant. He presented the show's news bulletins, which included presenting the news on location when the show travelled to other countries.\nIn the early half of the 2000s, Hughes provided voiceovers for TV shows in the UK, including ''Cilla's Moment of Truth and Simply The Best. In around 2000, Hughes started being the voiceover for the British Comedy Awards; he held this role for at least five years.\nHughes then worked at LBC, talkSPORT and Smooth Radio; whilst at talkSPORT, he presented a show about unexplained events called The Unexplained''. The show continued as a podcast after it was dropped by talkSPORT, and a separate radio version of the show was broadcast on talkRADIO on Sunday late evenings and Monday early mornings from early 2016 until 2023 or 2024.\nIn 2014, Hughes started presenting a show on BBC Radio Berkshire which was broadcast between 6am and 8am on Saturdays. This show ended in 2019. Hughes also read the news on the station's weekday breakfast show, which was hosted by Andrew Peach.\nDeath\nIn November 2024, it was announced that Hughes had died earlier in the month. Tributes were paid by many former colleagues.\nReferences"
    }
  ]
}