{
  "content": [
    {
      "type": "text",
      "text": "# Howard Association\n\n}}\nHoward Association, a benevolent organization, was formed in Norfolk, Virginia during the 1855 Yellow Fever Epidemic which killed 1 in 3 residents of Norfolk and sister city Portsmouth in Hampton Roads. Contributions were used to set up a hospital and an orphanage, to feed the hungry and to bury the dead. It was named after a British philanthropist and prison reformer, John Howard.\nIt has long been known that the 1855 Yellow Fever epidemic had begun when infected persons arrived aboard a ship. Hampton Roads' plight drew assistance in the form of funds, supplies, and medical personnel from many other cities and communities, especially those located along the Atlantic and Gulf Coast areas of the United States.\nMoney remaining in the Howard Association's coffers has continued to be used for medical relief in the 150 years since, primarily in southeastern Virginia. The Howard Association resources were merged with those of the Norfolk Foundation, another longstanding benevolent group, in 1986.\n2005 news\nAmong significant sources of contributions and volunteers for Norfolk in 1855 were the gulf coast areas of Alabama, Mississippi, and Louisiana. An 1856 Howard Association report read, in part:\nNor can we find words to express our thanks to the city of New Orleans, for the noble and generous manner in which she responded to our call for help. No sooner had our appeal gone forth, than skillful physicians and experienced nurses rushed to our aid. Being the first to volunteer assistance, they were among the last to leave.\nOn September 14, 2005, even as Hurricane Ophelia was approaching and threatened Hampton Roads, the Norfolk Foundation sent a check for $50,000 to the Greater Baton Rouge Area Foundation in Louisiana to help with disaster relief efforts in the Hurricane Katrina recovery. A Virginian-Pilot newspaper story noted that this was, in a symbolic (and practical sense), a partial repayment of a 150-year-old act of kindness from the Gulf States.\nSources\n*[https://web.archive.org/web/20051215091630/http://home.hamptonroads.com/stories/story.cfm?story=88346&ran=240842 Interactive Internet article on the 1855 Yellow Fever Epidemic from Pilot Online, Hampton Roads]\n*[http://home.hamptonroads.com/stories/story.cfm?story=92288&ran=99140 News story from Virginian-Pilot newspaper]"
    }
  ]
}