{
  "content": [
    {
      "type": "text",
      "text": "# Howard Garrett\n\n|birth_place       = Pittsburg, TX\n|death_date        =\n|nationality       =\n|footnotes         =\n|signature         =\n}}\nHoward Garrett, known as \"the Dirt Doctor\" (born in Pittsburg, Texas, 1947) is a radio talk show host and a leader of the Organic movement.  He is a health activist, arborist, newspaper columnist and organic activist living in Dallas, Texas. He received his Bachelor of Science degree in Park Administration and Landscape Architecture from Texas Tech University in 1969. After serving in the U.S. Marine Corps Reserve, Garrett worked at Club Corporation of America, where he was a laborer and assistant golf course superintendent.\nGarrett promotes natural organic programs and products. He opposes the use of synthetic fertilizers and toxic chemical pest control products, as well as criticizing some organic products that he believes do not work. He thinks that homeowners, nurseries and landscape companies underestimate the dangers of non-organic solutions, and consults with commercial properties wanting to convert to organic techniques. His philosophy is that the natural organic program works better - in every way. It, for example, save 40 -50% on irrigation.\nHe has written about the plant-derived insecticide Pyrethrum, which is made from the painted daisy (Chrysanthemum cinerariaefolium or Chrysanthemum coccineum that contain pyrethrin organic compounds which are potent natural insecticides.)  One of the common extra ingredients is PBO, which is a synthetic synergist that gives the basic insecticide more killing power.  Garrett agrees with the viewpoint of the Journal of Pesticide Reform, which says that in laboratory tests, insecticides made from pyrethrum have: caused tumors in animals; increased the risk of leukemia; disrupted the normal function of sex steroids; and triggered allergic reactions including heart attack and asthma.\nGarrett has been the topic in numerous magazines and articles. He is the author of 15 books that range from organic gardening manuals and more technical guides for landscape professionals to texts about insect identification and selecting good quality trees and plants for specific regions in Texas. His design work appears around Texas and he has had a weekly radio show. Samples of his books can be found online in Google Scholar.\nGarrett runs a website giving information about his approach, and the Dirt Doctor sends out a weekly newsletter. Subscription is free.\nBio\nHoward Garrett\n*Past member American Society of Landscape Architects&nbsp;– ASLA\n*Arborist - International Society of Arboriculture&nbsp;– ISA.\n*Nationally syndicated radio talk show host&nbsp;— Salem Radio Network,\n*Columnist for the Dallas Morning News - Organic Answers,\n*Author of 15 books\n*Chairman of Texas Organic Research Center (TORC) a 501(c)3 corporation,\n*Past member of the Organic Advisory Board Texas Department of Agriculture\n*Presenter of the Natural Organic Certification on-line TORC Course\nBooks by Howard Garrett\n* Organic Manual (Multiple revisions 2002 - 2016)\n* Texas Gardening the Natural Way: The Complete Handbook (Revised February 2016)\n* Organic Lawn Care (June 2014)\n* Organic Management for the Professional (2012)\n* Plants for Houston and the Gulf Coast (March 2008)\n* Texas Tree Book October (2002)\n* Texas Herb Book (January 2001)\n* Texas Bug Book (March 1999)\n* Howard Garrett’s Texas Organic Gardening (June 1998)\n* Organic Vegetable & Edible Landscaping (October 1998)\n* The Dirt Doctor’s Guide to Organic Gardening (1995)\n* Texas Organic Gardening Book (1993)\n* ''J. Howard Garrett's Plants of Texas I.D. Swatcher (1990)\n* Landscape Design - Texas Style (October 1986)\n* Plants of the Metroplex''(Revised multiple times 1974 - 1998)\nReferences\nExternal links\n* [http://www.dirtdoctor.com Official website]"
    }
  ]
}