{
  "content": [
    {
      "type": "text",
      "text": "# Howard Bentham\n\nHoward Bentham (born 1965 in Bedford) is a graduate of Birmingham University. He has worked as a radio presenter since 1997 and a stadium announcer since 1999.\nRadio career\nBentham began his radio career as a volunteer at Dudley Hospital Radio in the West Midlands. His first professional broadcasting role was presenting Weekend Overnights at Wolverhampton's Classic Gold WABC. He then worked at Stratford-upon-Avon's The Bear 102. He began presenting the Weekday Breakfast Show in January 2001 and was their flagship presenter until March 2005.\nBentham was recruited as Weekday Breakfast Presenter for BBC Hereford and Worcester in April 2005 and presented the show until October 2014 making him, at the time, the longest serving Weekday Breakfast Presenter in the station's history. In addition he regularly covered Worcestershire County Cricket Club games as part of the station's ball-by-ball commentary team. Bentham joined BBC Radio Oxford in November 2014 initially hosting their Mid-Morning Show before a two-year stint hosting the BBC Radio Oxford Breakfast Show. He then presented their Hometime Show until 2019.\nBentham was the main freelance presenter for BBC Radio 5 Sports Extra covering Champions League, Premiership Football, Rugby League, Rugby Union, Wimbledon Tennis and Test Match Cricket until 2009.\nAwards\nBentham was the main presenter when BBC Hereford & Worcester won three Sony Radio Academy Gold Awards. He also won the Frank Gillard BBC Local Radio Silver Award with fellow BBC Hereford and Worcester presenter Toni McDonald.\nCharity Work & Challenges\nBentham took part in a challenge to offset his carbon footprint which involved planting over a thousand new trees.\nHe raised £9000 in 2010 for the bereavement counselling charity 'Noah's Ark Trust' by cycling around Herefordshire and Worcestershire for five days.\nSports Presentation & Stadium Announcer\nBentham is a world-class stadium announcer and was the voice of the Hockey Competitions at the 2012, 2016, 2020 & 2024 Olympic Games in London, Rio de Janeiro, Tokyo and Paris. He was the announcer for five matches at the 2015 Rugby Union World Cup including the two record breaking attendances at Wembley Stadium in that competition. He was the voice of the European Rugby Champions and Challenge Cup Finals in Bilbao in 2018. He has also hosted Paralympic Games Wheelchair Rugby,  7-a-side Football and Para-Badminton; he is the leading badminton announcer in the English speaking world and was the host of the BWF Badminton World Championships in 2011 & 2017, and has worked for the England & Wales Cricket Board and British Rowing and many other National Governing Bodies.\nHe was the stadium announcer for Bath Rugby from 2017 to 2022, a role he previously performed for the Worcester Warriors. He was also the announcer for the 2023 Pan American Games in Santiago, Chile and voiced the 2002 Hockey Competition at the Commonwealth Games in Manchester.\nPersonal life\nBentham was born in Bedford in 1965. In 1984, he studied geography and sociology at Birmingham University and later returned to the university to complete a Post-Graduate Certificate in Primary Education. He currently lives in Worcestershire.\n6-a-Side World Cup\nIn 2019 Howard was announced as the Stadium Announcer for 6 a side World Cup Cup in Crete run by the Socca Federation, with the assistance of UK 6 a side football giants Leisure Leagues he was the lead announcer throughout the World Cup, which was won by Russia, beating Poland in the final.\nReferences\nExternal links\n*[http://www.howardbentham.com Broadcaster] [http://www.howardbentham.com www.howardbentham.com]"
    }
  ]
}