{
  "content": [
    {
      "type": "text",
      "text": "# Howard P. Savage\n\n| birth_place = Boone, Iowa, U.S.\n| death_date =\n| death_place = Chicago, Illinois, U.S.\n| education =\n| occupation = Businessman\n| title = National Commander of\n| term = 1926–1927\n| predecessor = John R. McQuigg\n| successor = Edward E. Spafford\n| module             =\n| unit = 55th Engineer Regiment\n| battles = World War I\n*Defensive Sector\n| battles_label = Battles\n}}\n}}\nHoward Paul Savage  (January 3, 1884 – May 7, 1944) was an American businessman who served as the National Commander of The American Legion from 1926 to 1927.\nEarly life and education\nHoward Paul Savage was born in Boone, Iowa. He attended the Lewis Institute of Technology, University of Wisconsin, and De Paul University. Bradbury Robinson, who threw the first legal forward pass in college football, cited Savage as his inspiration. Both were players at the University of Wisconsin in the preseason of 1904 when, according to Robinson's memoirs:\n... there came to the Wisconsin U squad a tall young Irishman from Chicago.  His name was H.P. Savage, the same who later… became the National Commander of the American Legion and was known as \"High Power\" Savage. They were trying to develop me into a kicker at Wisconsin and H.P. generally teamed up with me to catch my punts.  I noticed that he could throw my punts back almost as far as I could kick them.  Here was the trick I must learn.  I got H.P. to show me how he did it.\nTwenty-five years later, Robinson told St. Louis Star-Times sports editor Sid Keener (1888–1981) that Savage threw \"the pigskin to his players with the ball revolving as it sailed through the air.\"\n\"From then on,\" Robinson wrote in his memoirs, \"my football hobby became forward passing or anyway passing the ball.\"\nRobinson would transfer to St. Louis University for the 1904 season, where he would throw the first legal pass in September 1906.\nIn 1910, he became an engineer for the Chicago Elevated Train, eventually working his way up to general manager of the Metropolitan Motor Coach Company.\nWorld War I\nSavage was commissioned a first lieutenant on June 7, 1918, and assigned to the United States Army's 55th Engineer Regiment, serving on railway construction in France until July 1, 1919.\nThe American Legion\nSavage became active in The American Legion after the war and served at post, county, department and national levels. As department commander, he focused on improving medical care and rehabilitation for veterans. An additional issue he strongly advocated for while department commander was to grant more independence to the Cook County branch of the Legion. He felt it important to combat the Communist Party in the U.S., believing the Communist party to have more members than the Legion. He became National commander in 1926 being elected on the 21st ballot. He was the first commander from Illinois.\nIn 1927, Savage led 20,000 members of The American legion on a goodwill tour of post war Europe. He conducted this tour with John Pershing, Supreme American Commander during the First World War. He was a significant proponent of allowing reserve officer training in High Schools and Colleges stating, \"Those who attack the military training in high schools and college as UnAmerican [sic], militaristic, and likely to breed war are cracked idealists who do not know what is it to face a blood-lusting enemy without training\".  He directed the National Employment Commission for The American Legion. In this role, he cooperated with the government's employment service, appointed state employment officers and planned for post-level activities aimed at easing the problem of unemployment in the towns of cities of the nation.\nLater life\nSavage held many business and organizational titles during his lifetime. His first elected office was president of the North Shore Park District in Chicago. He was also a president of the Lewis Institute Alumni Association. In 1928, he served as a Republican Delegate to the national convention from Illinois. In the 1930s, he used his Legion connections to become business manager of Chicago Board of Education. He died on May 7, 1944, in Chicago, Illinois.\nLegacy\nSavage was on the cover of the September 27, 1927, edition of Time magazine. In addition, the Howard. P Savage Trophy is awarded to the winner of The American Legion World Series each year.\nReferences\n|years=1926–1927}}"
    }
  ]
}