{
  "content": [
    {
      "type": "text",
      "text": "# Howard shadow cabinet__disambig_1\n\n|border=darkgray}} Conservative Party}}\n|legislature_status = Official Opposition  |background-color=|border border-color=darkgray|width=|per=1}} (2003) |background-color=|border border-color=darkgray|width=|per=1}} (2005)\n|opposition_cabinet =\n|opposition_party =\n|opposition_leader =\n|election = 2003 Conservative leadership election\n|last_election = 2005 general election\n|legislature_term = 53rd UK Parliament54th UK Parliament\n|budget =\n|incoming_formation =\n|outgoing_formation =\n|previous = Duncan Smith shadow cabinet\n|successor= Cameron shadow cabinet}}\nThe Shadow Cabinets appointed by Michael Howard, a Conservative, are listed below.\nShadow Cabinet (11 November 2003 – 15 March 2004)\n*Rt. Hon. Michael Howard QC MP – Leader of Her Majesty's Loyal Opposition and Leader of the Conservative Party\n*Rt. Hon. Michael Ancram QC MP – Deputy Leader of the Conservative Party, Shadow Foreign Secretary and Shadow Secretary of State for International Affairs\n*Rt. Hon. Oliver Letwin MP – Shadow Chancellor of the Exchequer and Shadow Secretary of State for Economic Affairs\n*Rt. Hon. David Davis MP – Shadow Home Secretary and Shadow Secretary of State for Home, Constitutional and Legal Affairs\n*Dr. Liam Fox MP and Rt. Hon. Maurice Saatchi, Lord Saatchi – Chairman of the Conservative Party\n*Tim Yeo MP – Shadow Secretary of State for Public Services, Education and Health\n*Rt. Hon. Theresa May MP – Shadow Secretary of State for Environment and Transport\n*Rt. Hon. Thomas Galbraith, Lord Strathclyde PC – Shadow Leader of the House of Lords\n*Rt. Hon. David Curry MP – Shadow Secretary of State for Local and Devolved Government Affairs\n*David Willetts MP – Head of policy co-ordination and Shadow Secretary of State for Work and Pensions, Economic Affairs\n*Rt. Hon. David Maclean MP – Opposition Chief Whip\nJunior Shadow Ministers\n*Hon. Nicholas Soames MP – Shadow Secretary of State for Defence, International Affairs\n*John Bercow MP – Shadow Secretary of State for International Development, International Affairs\n*Rt. Hon. James Arbuthnot MP – Shadow Secretary of State for Business and Industrial Strategy, Economic Affairs\n*Howard Flight MP – Shadow Chief Secretary to the Treasury, Economic Affairs\n*Stephen O'Brien MP – Shadow Secretary of State for Industry, Economic Affairs\n*Dominic Grieve MP – Attorney General, Home, Constitutional and Legal Affairs\n*Tim Collins CBE MP – Shadow Secretary of State for Education and Skills, Public Services, Education and Health\n*Eric Pickles MP – Shadow Secretary of State for Local Government, Local and Devolved Government Affairs\n*Alan Duncan MP – Shadow Secretary of State for Constitutional Affairs, Home, Constitutional and Legal Affairs\n*Julie Kirkbride MP – Secretary of State for Culture, Media and Sport, Home, Constitutional and Legal Affairs\n*Andrew Lansley MP – Shadow Secretary of State for Health, Public Services, Education and Health\n*Caroline Spelman MP – Shadow Secretary of State for the Environment and Shadow Minister for Women, Environment and Transport\n*Damian Green MP – Shadow Secretary of State for Transport, Environment and Transport\n*John Whittingdale MP – Shadow Secretary of State for Agriculture, Fisheries and Food, Environment and Transport\n*Oliver Heald MP – Shadow Leader of the House of Commons\n*Hon. Bernard Jenkin MP – Shadow Secretary of State for the Regions, Local and Devolved Government Affairs\n*David Lidington MP – Shadow Secretary of State for Northern Ireland, Local and Devolved Government Affairs\n*Bill Wiggin MP – Shadow Secretary of State for Wales, Local and Devolved Government Affairs\n*Peter Duncan MP – Shadow Secretary of State for Scotland, Local and Devolved Government Affairs\n*Christopher Prout, Lord Kingsland QC – Shadow Lord Chancellor, Home, Constitutional and Legal Affairs\n*Andrew Tyrie MP – Shadow Financial Secretary to the Treasury\nMichael Howard Shadow Cabinet reshuffle, 15 March 2004\nThere was a minor reshuffle of the Shadow Cabinet due to the stepping down of Rt. Hon. David Curry MP as Shadow Secretary of State for Local and Devolved Government Affairs\nShadow Cabinet (15 March 2004 – 14 June 2004)\n*Rt. Hon. Michael Howard QC MP – Leader of Her Majesty's Loyal Opposition and Leader of the Conservative Party\n*Rt. Hon. Michael Ancram QC MP – Deputy Leader of the Conservative Party and Shadow Foreign Secretary\n*Rt. Hon. Oliver Letwin MP – Shadow Chancellor of the Exchequer\n*Rt. Hon. David Davis MP – Shadow Home Secretary\n*Dr. Liam Fox MP and Rt. Hon. Maurice Saatchi, Lord Saatchi – Chairman of the Conservative Party\n*Tim Yeo MP – Shadow Secretary of State for Public Services, Education and Health\n*Rt. Hon. Theresa May MP – Shadow Secretary of State for Environment and Transport\n*Rt. Hon. Thomas Galbraith, Lord Strathclyde PC – Shadow Leader of the House of Lords\n*Caroline Spelman MP  – Shadow Secretary of State for Local and Devolved Government Affairs\n*David Willetts MP – Head of policy co-ordination and Shadow Secretary of State for Work and Pensions\n*Rt. Hon. David Maclean MP – Opposition Chief Whip\nJunior Shadow Ministers\n*Hon. Nicholas Soames MP – Shadow Secretary of State for Defence\n*John Bercow MP – Shadow Secretary of State for International Development\n*Rt. Hon. James Arbuthnot MP – Shadow Secretary of State for Trade\n*Howard Flight MP – Shadow Chief Secretary to the Treasury\n*Stephen O'Brien MP – Shadow Secretary of State for Industry\n*Dominic Grieve MP – Attorney General\n*Tim Collins CBE MP – Shadow Secretary of State for Education and Skills\n*Eric Pickles MP – Shadow Secretary of State for Local Government\n*Alan Duncan MP – Shadow Secretary of State for Constitutional Affairs\n*Julie Kirkbride MP – Secretary of State for Culture, Media and Sport\n*Andrew Lansley MP – Shadow Secretary of State for Health\n*Richard Ottaway MP – Shadow Secretary of State for the Environment\n*Andrew Tyrie MP – Shadow Paymaster General\n*Eleanor Laing MP – Shadow Minister for Women\n*Damian Green MP – Shadow Secretary of State for Transport\n*John Whittingdale MP – Shadow Secretary of State for Agriculture, Fisheries and Food\n*Oliver Heald MP – Shadow Leader of the House of Commons\n*Hon. Bernard Jenkin MP – Shadow Secretary of State for the Regions\n*David Lidington MP – Shadow Secretary of State for Northern Ireland\n*Bill Wiggin MP – Shadow Secretary of State for Wales\n*Peter Duncan MP – Shadow Secretary of State for Scotland\n*Christopher Prout, Lord Kingsland QC – Shadow Lord Chancellor\nShadow Cabinet (14 June 2004 – 6 May 2005)\n*Rt. Hon. Michael Howard QC MP – Leader of Her Majesty's Loyal Opposition and Leader of the Conservative Party\n*Rt. Hon. Michael Ancram QC MP – Deputy Leader of the Conservative Party and Shadow Foreign Secretary\n*Rt. Hon. Oliver Letwin MP – Shadow Chancellor of the Exchequer\n*Rt. Hon. David Davis MP – Shadow Home Secretary\n*Dr. Liam Fox MP and Rt. Hon. Maurice Saatchi, Lord Saatchi – Chairman of the Conservative Party\n*Tim Yeo MP – Shadow Secretary of State for Environment and Transport\n*Rt. Hon. Theresa May MP – Shadow Secretary of State for the Family\n*Rt. Hon. Thomas Galbraith, Lord Strathclyde PC – Shadow Leader of the House of Lords\n*Caroline Spelman MP – Shadow Secretary of State for Local and Devolved Government Affairs\n*David Willetts MP – Shadow Secretary of State for Work and Pensions and Welfare Reform\n*Rt. Hon. John Redwood MP – Shadow Secretary of State for Deregulation\n*Andrew Lansley MP – Shadow Secretary of State for Health\n*Tim Collins CBE MP – Shadow Secretary of State for Education and Skills\n*Rt. Hon. David Maclean MP – Opposition Chief Whip\nJunior Shadow Ministers\n*Hon. Nicholas Soames MP – Shadow Secretary of State for Defence\n*Rt. Hon. James Arbuthnot MP – Shadow Secretary of State for Trade\n*George Osborne MP – Shadow Chief Secretary to the Treasury\n*Stephen O'Brien MP – Shadow Secretary of State for Industry\n*Dominic Grieve MP – Shadow Attorney General\n*Eric Pickles MP – Shadow Secretary of State for Local Government\n*Alan Duncan MP – Shadow Secretary of State for International Development\n*Andrew Tyrie MP – Shadow Paymaster General\n*Eleanor Laing MP – Shadow Minister for Women\n*James Paice – Shadow Secretary of State for Agriculture, Fisheries and Food\n*John Whittingdale MP – Shadow Secretary of State for Culture, Media and Sport\n*Oliver Heald MP – Shadow Leader of the House of Commons and Shadow Secretary of State for Constitutional Affairs\n*Hon. Bernard Jenkin MP – Shadow Secretary of State for the Regions\n*David Lidington MP – Shadow Secretary of State for Northern Ireland\n*Bill Wiggin MP – Shadow Secretary of State for Wales\n*Peter Duncan MP – Shadow Secretary of State for Scotland\n*David Cameron MP – Head of policy co-ordination\n*Christopher Prout, Lord Kingsland QC – Shadow Lord Chancellor\nShadow Cabinet (6 May 2005 – 5 December 2005)\n{| class=wikitable\n! Portfolio\n! Shadow Minister\n|-\n| Leader of the Conservative PartyLeader of Her Majesty's Most Loyal Opposition\n| The Rt Hon Michael Howard QC MP\n|-\n| Deputy Leader of the OppositionShadow Secretary of State for Defence\n| The Rt Hon Michael Ancram QC MP\n|-\n| Shadow Chancellor of the Exchequer\n| George Osborne MP\n|-\n| Shadow Foreign Secretary\n| Dr Liam Fox MP\n|-\n| Shadow Home Secretary\n| The Rt Hon David Davis MP\n|-\n| Shadow Secretary of State for Constitutional Affairs\n| Oliver Heald MP\n|-\n| Shadow Leader of the House of Commons\n| Chris Grayling MP\n|-\n| Leader of the Opposition in the House of Lords\n| The Rt Hon Thomas Galbraith, Lord Strathclyde PC\n|-\n| Shadow Secretary of State for Trade and Industry\n| David Willetts MP\n|-\n| Shadow Secretary of State for Education and Skills\n| David Cameron MP\n|-\n| Shadow Secretary of State for Transport\n| Alan Duncan MP\n|-\n| Shadow Secretary of State for Health\n| Andrew Lansley CBE MP\n|-\n| Shadow Secretary of State for Environment, Food and Rural Affairs\n| The Rt Hon Oliver Letwin MP\n|-\n| Shadow Secretary of State for the FamilyShadow Secretary of State for Culture, Media and Sport\n| The Rt Hon Theresa May MP\n|-\n| Shadow Secretary of State for International Development\n| Andrew Mitchell MP\n|-\n| Shadow Secretary of State for Deregulation\n| The Rt Hon John Redwood MP\n|-\n| Shadow Secretary of State for Work and Pensions\n| The Rt Hon Sir Malcolm Rifkind KCMG QC MP\n|-\n| Shadow Secretary of State for Local Government Affairs and Communities\n| Caroline Spelman MP\n|-\n| Shadow Secretary of State for Northern Ireland\n| David Lidington MP\n|-\n| Shadow Chief Secretary to the Treasury\n| Philip Hammond MP\n|-\n| Opposition Chief Whip\n| The Rt Hon David Maclean MP\n|-\n| Chairman of the Conservative Party\n| The Rt Hon Francis Maude MP\n|-\n! colspan=2 | Other posts on the opposition frontbench\n|-\n| Shadow Secretary of State for ScotlandShadow Minister for Women and Equality\n| Eleanor Laing\n|-\n| Shadow Secretary of State for Wales\n| Bill Wiggin\n|-\n| Deputy Chief Whip\n| Patrick McLoughlin\n|-\n| Shadow Attorney General for England and Wales\n| Dominic Grieve\n|-\n| Shadow Minister for Local Government\n| Eric Pickles\n|-\n| Shadow Minister for London\n| Mark Field\n|-\n| Shadow Minister for Energy\n| Bernard Jenkin\n|-\n| Shadow Minister for Business & Consumer Affairs\n| Charles Hendry\n|-\n| Shadow Minister for Homeland Security\n| Patrick Mercer OBE\n|-\n! colspan=2 | Other posts at Conservative Headquarters\n|-\n| Deputy chairman\n| Raymond Monbiot CBE\n|-\n| Deputy chairman (Candidates)\n| Andrew MacKay\n|-\n| Vice-Chairmen (Campaigning)\n| Andrew Turner, Andrew Rosindell\n|-\n| Vice-Chairmen (Business)\n| Kay Coleman\n|-\n| Vice-Chairmen (Conservatives Direct)\n| Jennie Elias\n|-\n| Vice-Chairmen (Conservatives Abroad)\n| Nigel Evans\n|-\n| Vice-Chairmen (Candidates)\n| Patricia Morris, Baroness Morris of Bolton OBE\n|}\nExternal links\n*[https://web.archive.org/web/20080317063029/http://www.conservatives.com/tile.do?def=people.shadow.cabinet.page Conservative Party – Shadow Cabinet]\n*[https://news.bbc.co.uk/1/shared/spl/hi/uk_politics/03/shadow_cabinet/html/default.stm Conservative front bench] BBC News"
    }
  ]
}