{
  "content": [
    {
      "type": "text",
      "text": "# Howard F. Chang\n\n-->\n| birth_place        =\n| death_date         =\n| death_place        =\n| death_cause        =\n| region             =\n| nationality        =\n| citizenship        =\n| residence          =\n| other_names        =\n| occupation         =\n| period             =\n| known_for          =\n| home_town          =\n| title              = Earle Hepburn Professor of Law\n| boards             =\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| relatives          =\n| awards             =\n| website            =\n| education          =\n| alma_mater         =\n| thesis_title       =\n| thesis_url         =\n| thesis_year        =\n| school_tradition   =\n| doctoral_advisor   =\n| academic_advisors  =\n| influences         =\n| era                =\n| discipline         =\n| sub_discipline     =\n| workplaces         = University of Pennsylvania Law School\n| doctoral_students  =\n| notable_students   =\n| main_interests     =\n| notable_works      =\n| notable_ideas      =\n| influenced         =\n| signature          =\n| signature_alt      =\n| signature_size     =\n| footnotes          =\n}}\nHoward Fenghau Chang (born 1960) is an American legal academic and the Earle Hepburn Professor of Law at the University of Pennsylvania Law School.\nEducation\nHoward F. Chang graduated cum laude from Harvard College in 1982 with an AB degree in government. In 1985, he received a Master of Public Affairs degree from the Woodrow Wilson School of Public and International Affairs at Princeton University, where he studied economics and public policy. He graduated magna cum laude from Harvard Law School with a JD degree in 1987. He was the supervising editor of the Harvard Law Review from 1986 to 1987. He received a PhD in economics from the Massachusetts Institute of Technology in 1992.\nProfessional career\nChang was a law clerk for Judge Ruth Bader Ginsburg on the United States Court of Appeals for the District of Columbia Circuit from 1988 to 1989.\nPrior to joining the faculty at the University of Pennsylvania Law School, Chang was a professor at the University of Southern California Law School.  He has also taught law as a visiting professor at Georgetown University, Stanford University, Harvard University, New York University, the University of Michigan, and the University of Chicago.\nChang writes on a wide variety of subjects, including immigration law, international trade regulation, and environmental law.  His work includes publications in the Yale Law Journal, the Journal of Political Economy, the RAND Journal of Economics, the University of Pennsylvania Law Review, the Southern California Law Review, the Georgetown Law Journal, the Journal of Legal Studies, and the International Review of Law and Economics.\nChang served on the board of directors of the American Civil Liberties Union of Southern California from 1995 to 1998 and on the board of directors of the American Law and Economics Association from 2004 to 2007.\nExternal links\n* [http://www.law.upenn.edu/cf/faculty/hchang/ Faculty Profile at Penn Law]\n* [http://www.law.upenn.edu/cf/faculty/hchang/cv.pdf CV at Penn Law]\n* [https://papers.ssrn.com/sol3/cf_dev/AbsByAuth.cfm?per_id=17330 SSRN Page]"
    }
  ]
}