{
  "content": [
    {
      "type": "text",
      "text": "# Howard R. Barr\n\n}}\nHoward R. Barr (1910–2002) was a prominent twentieth-century architect in Austin, Texas. He received his degree from the University of Texas School of Architecture in 1934. Upon graduation, he worked in the University architect's office, where his first project was the design of housing units for the new U.T. observatory in West Texas.\nIn 1939 he began the private practice of architecture but, with the U.S. entry into the World War, he became associated with Brown Shipbuilding Co. in the design of the shipyard and the construction of ships in Houston. Commissioned in the U.S. Naval Reserve in November 1942, he served in active duty for three years and later took inactive duty retirement with the rank of Lt. Commander.\nUpon his return to civilian life he re-opened his architectural office but shortly joined the firm of Giesecke, Kuehne and Brooks, Max Brooks being his former classmate and close friend. After Mr. Giesecke's death in 1950, the firm of Kuehne, Brooks and Barr was formed and it—and its successor firms of Brooks and Barr and Brooks, Barr, Graeber & White (BBGW)—became one of Austin's largest and best-known firms of its time. In addition to serving for five years as consulting architects for the University of Texas System, the firm—either singly or in joint venture with other firms—designed such buildings as the Lyndon Baines Johnson Library and Museum in Austin, the U.S. Embassy office building in Mexico City, the United States Department of Labor headquarters in Washington, D.C., the U.S. Federal Office and Post Office Building in Austin, the University of Texas Medical School in Houston and in San Antonio, the Alan Shivers State Office Building in Austin, and research and medical facilities throughout the U.S. and in Panama and Puerto Rico. (Some of the architectural drawings for Brooks, Barr, Graeber, and White's buildings are archived in the Austin History Center, Austin, Texas.)\nOne of the firm's projects was to design the original complex of buildings at the Lyndon Baines Johnson Space Center for the National Aeronautics and Space Administration (NASA) when even the scientists who were to develop the moon shots did not know what type of building they would need.\nIn 1972, BBGW merged with Houston architects and engineers to form Diversified Design Disciplines, or 3D/International, and began a period of major planning of buildings and towns in Saudi Arabia and the Arab Emirates. Its most challenging project was the design of a summer palace for the King of Saudi Arabia.\nIn 1978 he retired from 3D/I and began a private consulting practice. Later he joined his son Alan Barr's architectural firm, White, Dolce and Barr, as a resident consultant, where he maintained his office until his death. Most of his consulting was pro bono work for his church, charitable organizations, and friends.\nHoward was always active in professional and community affairs. While at the university, he was elected to Tau Sigma Delta, the national honorary architectural fraternity. He was a member and president of both the Austin Chapter of the American Institute of Architects (AIA) and the Texas Society of Architects (TSA); served on the national Board of the AIA, received the TSA Medal for Lifetime Achievement, and was elected to Fellowship in the AIA. He served as architect member of the Texas State Board of Plumbing Examiners, member of the City of Austin Parks and Recreation Board, the Board of the Austin Chamber of Commerce, and the Austin Cerebral Palsy Center. He was a long-time member of the Austin Kiwanis Club and served as its president. In 1980 he became a member of the Advisory Council of the Lifetime Learning Institute of Austin and served as its director for four years. He was always an active member of the University United Methodist Church and served on many of its boards and committees.\nReferences"
    }
  ]
}