{
  "content": [
    {
      "type": "text",
      "text": "# Howard Pyle Studios\n\n| locmapin     = Delaware#USA\n| built        = 1883\n| architecture = Tudor Revival\n| added        = March 8, 1978\n| area         =\n| refnum       = 78000911\n}}\nThe Howard Pyle Studios are two historic buildings used for painting and teaching by illustrator Howard Pyle. The studios are located in a densely populated neighborhood near Brandywine Park and the Delaware Avenue Historic District.  The building used by Pyle as his own studio was built in 1883, mainly in brick with a Tudor Revival half timbered gable.  The smaller studio, that Pyle used for teaching, was built in a similar style in 1900.  After Pyle's death in 1911, the buildings were owned by Stanley Arthurs, until 1950, and then by Ellen duPont Wheelwright until 1964.  The Studio Group acquired the studios in 1964 and continues to use them as art studios. In 1978, the property was listed on the National Register of Historic Places.\nHistory\nPyle's interest in English history was reflected in the 1883 studio, which was built in a style variously described as Tudor Revival, Queen Anne style, or\n\"Shavian Manorial\",  because of its similarity to works by English architect Richard Norman Shaw.\nThe original studio was set back eighty feet from the street and has a steeply pitched roof.  One gable forms the main facade of the studio framing the entry porch and a triple casement window.\nThe brick studio school was built in 1900 in a similar style.  It fronts on the street and occupies the south side of the property.  Pyle's students attended at no charge.  A total of 75 students attended between 1900 and 1911, including N.C. Wyeth,  Frank Schoonover,  Harvey Dunn,  Stanley Arthurs, and George Harding.\nSee also\n*Delaware Art Museum\n*Frank E. Schoonover Studios\nReferences\nExternal links\n*[http://www.howardpylestudio.org/History.html Howard Pyle Studio History], the Studio Group\n*[http://www.delart.org/collections/HFS_library/finding_aids/Studio_Group_archive.htm Studio Group Archive], Delaware Art Museum\n*[http://www.newsworks.org/index.php/delaware/item/25926-a-brush-with-the-past A brush with the past] , Newsworks, WHYY-TV, video, 4:23, September 1, 2011.\n*[https://www.youtube.com/watch?v=QlfqNHwYf8Y Where In Wilmington - August 2011 - Howard Pyle Studio], YouTube video. 9:27, August 2011."
    }
  ]
}