{
  "content": [
    {
      "type": "text",
      "text": "# Howard Sounes\n\n}}\n| occupation =\n}}\nHoward Sounes (born 1965) is a British author, journalist and biographer.\nBiography\nBorn in Welling, South East London,  Sounes began his journalistic career as a staff reporter for the Sunday Mirror. He broke major stories, including one of the most notorious murder cases in British criminal history: that of Fred and Rosemary West. Sounes reported that the house at 25 Cromwell Street in Gloucester was the grave site of nine young women, with more victims buried nearby. He went on to report the case for the Sunday and Daily Mirror, and upon conclusion of the trial he published his book Fred & Rose.\nSounes wrote a biography of American poet, novelist and short-story writer Charles Bukowski, becoming so engrossed in the subject that he resigned from his newspaper job to devote himself to the project. Charles Bukowski: Locked in the Arms of a Crazy Life was published in 1998 by Grove Press in the US and Canongate in the UK. Sounes also wrote a companion book in 2000 called Bukowski in Pictures. He was able to publish the first known photo of Bukowski's lover and muse, Jane Cooney Baker.\nSince his teenage years Sounes had been a fan of singer/songwriter Bob Dylan, and in early 1990 he began research for a major biography of the musician. Sounes interviewed over 250 people including members of the Dylan, Zimmerman, Lownds and Rutman families, as well as ex-girlfriends including Suze Rotolo, her elder sister Carla, their mother Mary Pezzati Rotolo, friends and other musicians. His extensive and painstaking research of unseen evidence concerning Dylan's life included birth, death and marriage certificates, court papers, property and tax records which enabled him to pin down precise details of Dylan's life where in the past only erroneous speculation had existed.\nMembers of the Dylan family, with the exception of Jakob Dylan, were interviewed by Sounes on the understanding that they would not be named and merely identified as \"a member of the Dylan family.\" The biography, entitled Down the Highway: The Life of Bob Dylan, was published in 2001 (the year Dylan turned 60). It contained the revelation that unknown to fans and media alike, Dylan had married one of his backing singers, Carolyn Dennis.\nSounes has worked as a full-time author since publishing his Dylan biography. His later works have included a scathing investigation of professional golf, The Wicked Game, and a cultural history of the 1970s, entitled Seventies. In the mid-2000s it was reported that he was working on a book called Heist, an account of the world's biggest cash robbery. His biography of Sir Paul McCartney, FAB: An Intimate Life of Paul McCartney, was published in August 2010. Sounes subsequently admitted that his work represented too many of his personal opinions about McCartney's music.\nSounes' latest book, Amy, 27: Amy Winehouse and the 27 Club, was published in July 2013 by Hodder & Stoughton. The book is a study of British singer Amy Winehouse's life in the context of the 27 Club, the group of iconic music stars who died at the same young age, including Brian Jones of the Rolling Stones whose death in 1969 was followed by Jimi Hendrix and Janis Joplin in 1970, Jim Morrison in 1971, and Kurt Cobain in 1994.\nReferences\nPartial bibliography\n* Fred & Rose (London, Warner Books, 1995)\n*Charles Bukowski: Locked in the Arms of a Crazy Life (New York, Grove, 1998)\n*Bukowski in Pictures (Edinburgh, Canongate, 2000)\n*Down the Highway: The Life of Bob Dylan (New York, Grove, 2001)\n*The Wicked Game (New York, William Morrow, 2004)\n*Seventies (London, Simon & Schuster, 2005)\n*Amy, 27: Amy Winehouse and the 27 Club (London, Hodder & Stoughton, 2013)\n*The Life of Lou Reed: Notes from the Velvet Underground (London, Black Swan, 2019)\nExternal links\n* [http://www.howardsounes.com Howard Sounes official website]"
    }
  ]
}