{
  "content": [
    {
      "type": "text",
      "text": "# Howard Jerome Keisler\n\n| birth_place = Seattle, United States\n| death_date =\n| death_place =\n| fields = Mathematics\n| workplaces = University of Wisconsin-Madison\n| alma_mater =\n| doctoral_advisor = Alfred Tarski\n| doctoral_students = Frederick Rowbottom\n| known_for = Non-standard analysis\n| influences =\n| influenced =\n| awards =\n| signature =\n| signature_alt =\n| footnotes =\n}}\nHoward Jerome Keisler (born 3 December 1936) is an American mathematician, currently professor emeritus at University of Wisconsin–Madison. His research has included model theory and non-standard analysis.\nHis Ph.D. advisor was Alfred Tarski at Berkeley; his dissertation is Ultraproducts and Elementary Classes (1961).\nFollowing Abraham Robinson's work resolving what had long been thought to be inherent logical contradictions in the literal interpretation of Leibniz's notation that Leibniz himself had proposed, that is, interpreting \"dx\" as literally representing an infinitesimally small quantity, Keisler published Elementary Calculus: An Infinitesimal Approach, a first-year calculus textbook conceptually centered on the use of infinitesimals, rather than the epsilon, delta approach, for developing the calculus.\nHe is also known for extending the Henkin construction (of Leon Henkin) to what are now called Henkin–Keisler models. He is also known for the Rudin–Keisler ordering along with Mary Ellen Rudin.\nHe held the named chair of Vilas Professor of Mathematics at Wisconsin.\nAmong Keisler's graduate students, several have made notable mathematical contributions, including Frederick Rowbottom who discovered Rowbottom cardinals.  Several others have gone on to careers in computer science research and product development, including: Michael Benedikt, a professor of computer science at the University of Oxford, Kevin J. Compton, a professor of computer science at the University of Michigan, Curtis Tuckey, a developer of software-based collaboration environments; Joseph Sgro, a neurologist and developer of vision processor hardware and software, and Edward L. Wimmers, a database researcher at IBM Almaden Research Center.\nIn 2012 he became a fellow of the American Mathematical Society.\nHis son Jeffrey Keisler is a Fulbright Distinguished Chair at the University of Massachusetts, Boston, College of Management.\nPublications\n*Chang, C. C.; Keisler, H. J. [https://books.google.com/books/about/Continuous_Model_Theory.html?id=uTGdPSI5rI4C Continuous Model Theory]. Annals of Mathematical Studies, 58, Princeton University Press, 1966. xii+165 pp.\n*Model Theory for Infinitary Logic, North-Holland, 1971\n*Chang, C. C.; Keisler, H. J. [https://books.google.com/books/about/Model_Theory.html?id=uiHq0EmaFp0C Model theory. Third edition]. Studies in Logic and the Foundations of Mathematics, 73. North-Holland Publishing Co., Amsterdam, 1990. xvi+650 pp. ; 1st edition 1973; 2nd edition 1977\n*Elementary Calculus: An Infinitesimal Approach. Prindle, Weber & Schmidt, 1976/1986. Available online at [http://www.math.wisc.edu/~keisler/calc.html].\n*An Infinitesimal Approach to Stochastic Analysis, American Mathematical Society Memoirs, 1984\n*Keisler, H. J.; Robbin, Joel. Mathematical Logic and Computability, McGraw-Hill, 1996\n*Fajardo, Sergio; Keisler, H. J. Model Theory of Stochastic Processes, Lecture Notes in Logic, Association for Symbolic Logic. 2002\nSee also\n* Criticism of non-standard analysis\n* Non-standard calculus\n* Elementary Calculus: An Infinitesimal Approach\n* Influence of non-standard analysis\nReferences\nExternal links\n*\n*[http://www.math.wisc.edu/~keisler/ Keisler's home page]"
    }
  ]
}