{
  "content": [
    {
      "type": "text",
      "text": "# Howard Dee\n\nHoward Q. Dee (November 23, 1930 – August 21, 2024) was a Filipino businessman, philanthropist, and diplomat.\nEarly life and education\nDee was born on November 23, 1930, to a middle-class Chinese Filipino family who owned a lumberyard and was raised in Tondo, Manila. His paternal ancestor Dy Phi-Phay first immigrated from China to Manila in the late 18th century and he was the nephew of Dee C. Chuan that founded Chinabank. Howard Dee’s father was Dee Hong Lue, a lumber tycoon and younger brother of Dee C. Chuan. Another uncle was Dee K. Chiong, former Chairman of Chinabank and grandfather of Miss Universe finalist Michelle Dee. He graduated from San Beda High School in 1946 and received a bachelor's degree in business administration from the Philippine College of Commerce and Business Administration, now the University of the East, in 1951. He also took up a master of arts in economics from the same university but left in 1953 to join the pharmaceutical firm Unilab.\nCareer\nDee served as vice president and general manager of Unilab from 1953 to 1965, when he became president. He oversaw the company's rise to become the leading pharmaceutical firm in the Philippines. He retired from the company in 1975.\nDee was appointed by President Corazon Aquino as the Philippine ambassador to the Holy See and Malta from 1986 to 1990.\nDee was also involved in efforts to end political conflict in the Philippines, having led the National Peace Conference from 1990 to 1992 and the government's peace panel in negotiations with the CPP-NPA-NDF during the presidency of Fidel Ramos from 1993 to 1994. He also served in Ramos's Social Reform Council from 1993 to 1995 and was President Gloria Macapagal-Arroyo's adviser on indigenous people’s affairs with the rank of cabinet secretary in 2002. He also led the Bangsamoro Basic Law Peace Council during the presidency of Benigno Aquino III in 2015.\nPhilanthropy\nDee was a founding trustee of Philippine Business for Social Progress in 1970. He also established the Assisi Development Foundation in 1975. and was the founding chair of the Philippine Development Assistance Program in 1984 and ASA Philippines in 2004. He also led several other NGOs such as Tabang Mindanaw, Caritas Manila and Pondo ng Pinoy.\nA devout Catholic, he was involved in religious organizations such as Bahay Maria and the Family Rosary Crusade, serving as the latter's vice president from 1997 to 2015. He was also chief editor of Ave Maria magazine.\nIn 2018, Dee received the Ramon Magsaysay Award for his efforts in \"championing the human face of peace, justice, and economic growth\".\nPersonal life and death\nDee was married to Betty Marie and had four children. His son, Richard, married Viel Aquino, the daughter of former Senator Ninoy Aquino and former President Corazon Aquino, which prompted Dee to resign as ambassador in 1990 during her presidency.\nDee died on August 21, 2024, after suffering a stroke shortly after delivering a speech for his receiving the Ramon V. del Rosario (RVR) Nation Building and Siklab Awards in Makati the previous day. He was 93. He was buried at Heritage Memorial Park in Taguig.\nAwards\n*Order of St. Sylvester, 1985\n*Ozanam Award, Ateneo de Manila, 1986\n*Pius X Equestrial Order of the Grand Cross, First Class, 1988\n*St. Benedict Award, San Beda College, 1989\n*Gawad Mabini, 1999\n*Dr. Jose Rizal Lifetime Achievement Award, 2003\n*Aurora Aragon Quezon Peace Award, 2006\n* San Vicente Liem dela Paz Award, Colegio de San Juan de Letran, 2006\n*Ramon Magsaysay Award, 2018\n*Ramon V. del Rosario Nation Building and Siklab Awards, 2024\nPublications\n*God’s Greatest Gift to Mankind (1981)\n*Mankind’s Final Destiny (1992)\n*Living the Beatitudes with St. Joseph (2004)\nReferences"
    }
  ]
}