{
  "content": [
    {
      "type": "text",
      "text": "# Howard Greenley\n\nto house at-risk and homeless persons.]]\nHoward Greenley (1874–1963) was an architect who worked during the late 19th and 20th centuries and known mainly for his work in New York City, Long Island, and Newport, Rhode Island. Greenley was a prominent figure in the architectural world in his time, He graduated from Trinity College in Hartford, Connecticut in 1894, having trained initially in the office of Carrere and Hastings and then at the École des Beaux-Arts in Paris. Greenley served as the president of the Architectural League of New York for a quarter of a century, and was one of the featured architects in the book Long Island Country Houses and Their Architects 1860 to 1940 by Robert Mackay and Brendan Gill.\nBuildings\nPrince George Hotel\nAt 14 stories tall, the Prince George Hotel at 14 East 28th Street, was one of New York's largest early 20th century hotels. It was constructed in two phases, with the main building going up in 1904 and a northern wing added in 1912. The exterior of the hotel has a Beaux-Arts character, with a rusticated limestone base, red brick and white terra-cotta trim above, and three-dimensional sculptural ornaments. Its ground floor included the Lady's Tearoom, the English Tap Room, and the Hunt Room. One of the centerpieces of the original building is The Ladies’ Tea Room, with its trellised piers and arches, Rook wood faience fountain, lighting set within opalescent glass cartouches, and murals by George Inness, Jr.\nThe Ballroom at the Prince George is part of the Madison Square North Historic District and listed on the National Register of Historic Places. Designed by Greenley, the ornate ballroom featured Renaissance-inspired murals and reproductions of famous paintings, along with intricate woodwork, marble mosaic floors, ceiling murals, and elaborate carvings. It features neo-Renaissance details, including plasterwork garlands, cherubs, and acanthus leaves. Column details include cherubim, fruit garlands and faces with leafy walrus mustaches. The room also has herringbone oak floors, and a marble mantelpiece. Eighteen-foot coffered ceilings are heavily ornamented.\nThe hotel continued to function, though in decline, through the 1980s, when, suffering from a decline in tourism and an increase in homelessness in the area, it began to contract with the city to house homeless families, with the ballroom serving as a multi-function space: dining room, offices, and basketball court.  As it continued to decline, writer Jonathan Kozol called it \"one of the grimmest places I've ever been.\"  The city shut down the hotel in 1989, and it was purchased by Common Ground, a social services organization, in 1996.\nIn 1998, renovation of the building began, funded by Federal and state funds and private grants, under the control of Beyer Blinder Belle, who had also overseen the renovation of Grand Central Terminal.  The building reopened in 1999.  The Ballroom was renovated later, in 2004.\nSeaview Terrace\nThe American League of Architects awarded Greenley their President's Medal in 1928 for the design of SeaView Terrace, Mr. and Mrs. Edson Bradley's sprawling French Renaissance manor house, one of the last of the immense Gilded Age Newport summer palaces to be built.  The house was conceived in 1922 and built between 1923 and 1925, incorporating an existing Elizabethan residence known as Seaview (1885) formerly owned by James Kernochan. In keeping with its seaside location, the 65-room manor house features turrets, stained-glass windows, high, arching doorways and shell motifs that adorn the facade. Rooms imported intact from France were moved from the Bradley home in Washington, D.C. to Newport, and reassembled with the chateau constructed around them.\nThe house was used as an all-girls summer boarding school, \"Burnham-by-the-Sea\", beginning in 1950. From 1966 to 1971, the television show Dark Shadows used the exterior as the outdoor set for the fictional Collinwood Mansion. Salve Regina University leased the house from 1975-2009 for their Music Department, dormitory and conferences. The house is privately owned and has been returned to private use. It remains known as 'Seaview Terrace'\nCorning Free Academy\nCorning Free Academy, in Corning, New York, was built as a high school in 1922 in the classical Romanesque Revival style, replacing an older, smaller, and simpler building. It features elaborate terra cotta, which was produced locally by the Corning Brick and Terra Cotta and Tile Company. A sculptured relief above the main entrance was designed by the New York sculptor Leo Lentelli. Decorative Aurene glass shades were produced by Corning Glass Works under the direction of Frederick Carder, a prominent glass designer, member of the community, and president of the Board of Education. The clocks on the central bell tower have been put back in working order recently and the 1873 bell, manufactured in West Troy, New York, continues to ring. Stone and iron work from the Amory A. Houghton house one block away were incorporated into the construction of the school. Until the opening of Corning Northside High School about 1950, it was Corning's only high school.\nThe high school later became a middle school, and closed in 2014 as part of a school district facility consolidation. It was renovated and in 2015 opened as a luxury apartment complex.\nReferences"
    }
  ]
}