{
  "content": [
    {
      "type": "text",
      "text": "# Howard D. Becker\n\n| birth_place      = Albany, New York\n| death_date       =\n| death_place      =\n| nationality      = American\n| known_for        = painting, watercolor\n| training         = Pratt Institute,\n| movement         =\n| notable_works    =\n| patrons          =\n| awards           =\n| module           =\n| branch              =\n| serviceyears        = 1941–1945\n| rank                = Corporal\n| unit                = 6th Port Headquarters, Transportation Corps\n| battles             = World War II:European theatre of World War II\n| awards              = European-African-Middle Eastern Campaign MedalMeritorious Service Medal\n}}\n| residence        =\n}}\nHoward Daniel Becker (1914 in Albany, New York, United States – 1995 in Pennsylvania, US) was an American painter and watercolorist.  He served in World War II in 6th Port Headquarters as documentary artist, assigned by Col. R. Hunter Clarkson, painting and sketching the history of the occupation and reconstruction of the Port of Marseille.  His watercolor painting \"Assembly Plant\", Cazes, Morocco, 1946, appears in \"Soldiers Serving the Nation,\" a book of the works of artists in the field during World War II, drawn from The US Army Art Collection edited by General Gordon R. Sullivan, U.S. Army Chief of Staff.  Several of Becker's pieces were retained by the Historical Properties Section in Washington, D.C..\nEarly life and education\nHoward D. Becker was born in Albany, New York in 1914.  He graduated from the Pratt Institute of Art in Brooklyn, New York in 1935.\nWorld War II\nBecker was drafted April 26, 1941. He reported to Camp Blanding, Florida with the 57th Quartermaster Regiment.  While at Camp Blanding, Beckers watercolor \"Convoy In Dixie\" was exhibited as part of a soldiers' art show in the Society of Four Arts library, and purchased by Frederick Gunster, president of the Four Arts, and his wife.\nIn April 1943, Becker left for North Africa with the 6th Port Headquarters, with the rank of corporal, technician 5th grade.\nCommander R. Hunter Clarkson assigned Becker to the unit as an artist, commissioning him to paint port activities and scenes of Army life.  May 3, 1944, he arrived in Naples, Italy followed by the south of France on September 4, where he continued painting the restoration of the port of Marseille and Army scenes.  In May 1945, he visited an American camp where he created an exhibition of German art from selected artists from the German prisoners.\nExhibitions of Becker's work included an exhibition at Oran, Cpl Becker's watercolors on Oran and its environs, the property of the U.S. Army, were displayed for the civilian population of Oran as a gesture of goodwill.\nBecker was discharged October 7, 1945, at Fort Dix, New Jersey.\nCareer\nReturning from the war, Becker lived at the Taos art colony and travelled through the Southwest where he painted and held art exhibitions. Becker set up residence in Honesdale, Pennsylvania, where he painted historical scenes, old farms, covered bridges, and country churches. Becker's work has been shown in exhibitions, including The Wayne County Historical Society.\nRecognition\nThe 6th Port was Awarded the Meritorious Service Plaque for Superior Performance in Control and Execution of its Port Missions, 1945.\nAlliance of UDH rewarded Becker posthumously in 1997 his outstanding contributions to the preservation and appreciation of the Heritage of the Upper Delaware Valley.\nHonesdale Historical Society Museum opened with a retrospective exhibition of 40 selected works.\nThree of Becker's oil paintings were exhibited at the prestigious, totally dedicated to \"Architecture in the State Landscape\" exhibition, and presented by Governor and Mrs. Edward G. Rendell in their Governor's Residence, Harrisburg, Pennsylvania.\nExhibitions\nThe World War II Art of Howard D. Becker, Torrey Building, Pennsylvania, 1995\nThe Artistic Vision of Howard D. Becker, Wayne County Historical Society, Honesdale\nPersonal life\nBecker was married to Elsa Garratt Becker, an artist who illustrated for Highlights for Children Magazine.  They had one son, Peter.\nReferences"
    }
  ]
}