{
  "content": [
    {
      "type": "text",
      "text": "# Howard Marsh (surgeon)\n\n| birth_place = Homersfield, Suffolk, England\n| death_date  =\n| death_place = Cambridge, England\n| party         =\n| occupation = SurgeonProfessor of surgery Master of Downing College, Cambridge\n| parents = Edward Brunning Marsh (1809-1876)Maria Haward\n| spouse =   1. Jane Perceval (1870)2. Violet Susan Hay (1899)\n| children = Edward Marsh(1872–1953) Margaret Helen Marsh/Maurice (1875-1942)\n| website  =\n}}\nFrederick Howard Marsh (7 March 1839 – 24 June 1915) was a surgeon and academic. From 1907 until his death he was Master of Downing College, Cambridge.\nLife\nMarsh was born in 1839 in a small village in eastern England, near Bungay, on the Suffolk / Norfolk border.   His father, Edward Brunning Marsh, is described as a \"gentleman farmer\", of Homersfield, on the Waveney, Suffolk. His mother Maria, née Haward, daughter of Charles and Maria, came from Brook, near Norwich. The Marsh family was 'old-established East Anglian farming stock', originally from Eye.\nHe studied at St Bartholomew's Hospital (\"Bart's\") in London, where he signed on in December 1858, becoming a Member of the Royal College of Surgeons in June 1861.   He was appointed house surgeon at the hospital in 1862, working under Frederic Skey.   He obtained his  F.R.C.S. diploma in 1866 and in 1868 was appointed Administrator of Chloroform.   He held a succession of progressively more senior appointments as assistant surgeon before eventually becoming a full surgeon in 1891.   By this time he had already, since 1868, worked as a surgeon at the Hospital for Sick Children in Great Ormond Street (as it was then known) where he became full surgeon in 1879 and consulting surgeon in 1888.   Also in the late 1860s Marsh became surgeon to the Queen Square House of Relief for Children with Chronic Disease of the Joints, an establishment founded \"in great part through the exertions of Miss Perceval\".   Howard Marsh married Jane Perceval, daughter of Spencer Perceval, and the grand daughter of an assassinated British prime minister, in 1870.\nIn 1903 Marsh was appointed Professor of Surgery at Cambridge University in belated succession to Sir George Murray Humphry (who had died in 1896).   Marsh resigned from his post at Bart's and relocated to Cambridge, becoming a fellow of King's College.   Four years later he relocated again, half a mile to the south, becoming Master of Downing College, Cambridge.\nAs Master of Downing College Marsh resisted government pressure to restrict access for students from India, then an important British Colony.   Approximately one third of all Indian students attending Cambridge University during the early years of the twentieth century chose Downing College:  Marsh attributed this to the college's reputation for excellent teaching of law, a subject favoured by India's burgeoning mercantile classes.   Government pressure was part of a wider political strategy to limit anti-colonial activism in British universities.   After consulting with fellow members of the college governing body Marsh politely rejected the British minister's request to restrict admissions in a way which would have been \"a rebuff to Indian students\".\nFamily\nMarsh was father to the polymath Edward Marsh and father-in-law of the controversial general and writer, Frederick Barton Maurice.   A grand daughter was the economist Joan Robinson.\nReferences"
    }
  ]
}