{
  "content": [
    {
      "type": "text",
      "text": "# Howard Herr\n\nSouth Africa\n| birth_date =\n| birth_place = Durban, South Africa\n| death_date =\n| death_place =\n| height = 5 ft 7 in\n| plays = Right-handed, Double Handed Backhand\n| college = Auburn University, USA\n| careerprizemoney = $19,629\n| singlesrecord = 2–5 (At ATP Level, Grand Slam level & USA Davis Cup)\n| singlestitles =\n| highestsinglesranking = No. 299 (28 Dec 1987)\n| Wimbledonresult = Q2 (1986)\n| USOpenresult = Q3 (1988, 1989)\n| doublesrecord = 0–1 (At ATP Level, Grand Slam level & USA Davis Cup)\n| doublestitles =\n| highestdoublesranking = No. 425 (29 Sep 1986)\n}}\nHoward Herr (born 16 August 1962) is a South African former professional tennis player.\nHerr, who grew up in Natal, played collegiate tennis in the United States for Auburn University and graduated in accounting. He led Auburn to 2 SEC Championship Team Titles, 1983 and 1984 (The only two in Auburns’ tennis history) and 3 individual SEC titles SEC Men’s Tennis Record Book - ESPN and was selected for All-SEC honors in 1983 and 1984.\nHe has also competed in German Bundesliga tennis for TK Kurhaus Aachen.\nHerr received his first ATP points in 1982.  After reaching the finals of the South African Closed Championships, he received a wild card in the Johannesburg Challenger Event and beat Mike Freer in the 1st Round before losing to Tim Wilkison.\nIn the 1986 Livingstone Open, Herr made his ATP Tour Main Draw debut winning his 1st Round match against Vincent Van Patten before losing in the round of 16 to Greg Holmes in 3 sets.  He also made his ATP doubles Main Draw debut at Livingston NJ where he partnered with H.Nunez and lost to McEnroe & Jensen.\nHe qualified for the Miami Open in 1987 and lost in the 1st round to Tarik Benhabiles of France in 3 sets.[Tennis Results:1.8 million Lipton International Players Championship].\nIn 1987, Herr qualified for the Cincinnati Open and beat Ken Flach in straight sets before losing to Wally Masur.\nDuring his career he made qualifying draw appearances at Wimbledon and the US Open.\nIn 1994, Herr played his final ATP Tour Main Draw Tournament at the Atlanta Open where he lost to World #9 and recent Australian Open finalist Todd Martin.\nIn 1998, Herr partnered with Ned Caswell to be the only 2nd qualifying team to make the Finals of an ATP Seniors Tour Event. They beat A.Gomez & T.Wilkinson and G.Mayer & M.Bahrami before losing to J.Kriek & M.Purcell in the Finals.\nReferences\nExternal links\n*\n*"
    }
  ]
}