{
  "content": [
    {
      "type": "text",
      "text": "# Howard Hille Johnson\n\n| birth_place               = Friend's Run near Franklin, Virginia (now West Virginia), U.S.\n| death_date                =\n| death_place       = Romney, West Virginia, U.S.\n| death_cause               =\n| body_discovered           =\n| resting_place             = Indian Mound Cemetery, Romney, West Virginia, U.S.\n| resting_place_coordinates =\n| monuments                 =\n| nationality               =\n| other_names               =\n| citizenship               =\n| education                 = Virginia School for the Deaf and the BlindNew Market Polytechnic Institute\n| alma_mater                =\n| occupation                =\n| years_active              =\n| employer                  = West Virginia Schools for the Deaf and Blind\n| organization              =\n| known_for                 = Founding the West Virginia Schools for the Deaf and Blind\n| notable_works             =\n| style                     =\n| height                    =\n| television                =\n| title                     =\n| term                      =\n| predecessor               =\n| party                     =\n| movement                  =\n| opponents                 =\n| boards                    =\n| criminal_charge           =\n| criminal_penalty          =\n| criminal_status           =\n| spouse                    =\n| partner                   =\n| children                  = Leila B. JohnsonWilliam T. JohnsonH. Guy JohnsonGeorge N. JohnsonLucy N. Johnson\n| parents                   = Jacob F. Johnson (father)\n| relatives                 = James Johnson (grandfather)James Johnson (brother)\n| callsign                  =\n| awards                    =\n| signature                 =\n| signature_alt             =\n| signature_size            =\n| module                    =\n| module2                   =\n| module3                   =\n| module4                   =\n| module5                   =\n| module6                   =\n| website                   =\n| footnotes                 =\n}}\nHoward Hille Johnson (February 19, 1846&nbsp;– February 8, 1913) was a blind American educator and writer in the states of Virginia and West Virginia. Johnson was instrumental in the establishment of the West Virginia Schools for the Deaf and Blind in 1870, after which he taught blind students at the institution's School for the Blind for 43 years.\nJohnson was born in 1846 near Franklin in Pendleton County, Virginia (now West Virginia) to the affluent and prominent Johnson family. His father, Colonel Jacob F. Johnson, represented Pendleton County in the West Virginia Legislature and his grandfather, James Johnson, represented the county in the Virginia General Assembly. Like his elder brother James, Johnson was born with severe visual impairment which became total blindness a few years after his birth. He and his brother received their early education at home from a governess. Johnson furthered his education at the Virginia School for the Deaf and the Blind, a common school in Franklin during the American Civil War, and at a classical school in New Market. During his studies at New Market, Johnson made considerable progress in mathematics, literature, science and foreign languages.\nIn 1865 he returned to Franklin, where he and his brother conducted a private classical school. Johnson undertook advanced studies at the Virginia School for the Deaf and the Blind for his profession as a teacher from 1866 to 1867. He returned to Franklin, establishing a public school under the free education system, and in 1868 accepted a teaching position at a Moorefield public school.\nIn early 1869, Johnson identified the need for a school for the blind in the new state of West Virginia; with statehood, deaf and blind West Virginia children attended schools for the deaf and blind in neighboring states (with West Virginia paying their tuition). Johnson began corresponding with West Virginia Governor William E. Stevenson, canvassing across the state to arouse public sentiment in support of a school for the blind. Despite rebukes from prominent West Virginian politicians, Johnson became the leading advocate for a state institution for the blind. He and other educated blind people staged an exhibition in the legislative chamber of the West Virginia House of Delegates, which was praised by the legislators.\nThe bill establishing the school was presented to the West Virginia House of Delegates for a vote, and before it became state law the words \"deaf and dumb\" were inserted before \"blind\" throughout its text. The final version of the bill establishing the West Virginia Institution for the Deaf, Dumb and Blind became state law on March 3, 1870. At the time of the institution's establishment Johnson was only 24 years old, and is credited by West Virginia historians as the founder of the West Virginia Schools for the Deaf and Blind. Serving on the school's inaugural Board of Regents, he was later selected as its principal teacher. The school began its first academic session on September 29, 1870. Johnson taught in its blind department continuously for 43 years, until his death in 1913. In addition to his educational work, Johnson wrote prose and poetry and was a member of the Romney Literary Society.\nEarly life and family\nJohnson was born on February 19, 1846, at his family's home on Friend's Run, near Franklin in Pendleton County, Virginia (now West Virginia). His father, Colonel Jacob F. Johnson, was a prominent citizen of the county and served in the West Virginia Legislature from 1872 to 1873. Johnson's grandfather, James Johnson, represented Pendleton County in the Virginia General Assembly and was a member of the 1829 Virginia Constitutional Convention. Like his elder brother James, Johnson was born with severe visual impairment which became total blindness several years after his birth. His affluent parents were determined to prepare Johnson and his brother for the challenges of life by providing them with the opportunities afforded to sighted children, arranging for their sons to receive a good education and \"proper instruction\" and teaching them self-sufficiency. Johnson's father employed a governess to instruct him and his brother at home, and James was taught to read from books using braille.\nEducation\nJames (Howard's brother) enrolled at the Virginia School for the Deaf and the Blind in Staunton in 1848 at age ten, completing his coursework there in 1855. After his graduation Johnson's father urged James to become a teacher, and at age 17 he taught a summer school on the South Fork South Branch Potomac River. James was also Howard's primary instructor, preparing him for higher education. Johnson followed in his brother's footsteps two years later, enrolling at the Virginia School for the Deaf and the Blind at age eleven. Although he studied there for four years, the school closed after the 1861 outbreak of the American Civil War and he was unable to complete his education there. At Staunton, teachers and acquaintances acknowledged Johnson's \"remarkably rapid\" progress in his studies. His studies were otherwise uninterrupted during the war; he attended a common school in Franklin, and was taught by James with sighted children. Johnson could not read text, and his lessons were read to him by his classmates.\nIn 1863 James encouraged him to further his education at a classical school in New Market, since Johnson had completed the coursework at the Franklin common school. The New Market school was taught by Joseph Salyards (or Saliards), a professor and writer described as one of \"the most learned men of the age\" and \"a most remarkable scholar in many respects.\" Johnson was accompanied to New Market by a young man with the surname of Clark, who read him his lessons; he tutored Clark in several subjects, including French. At New Market, Johnson made so much progress in mathematics, literature, science and foreign languages with his sighted classmates that he returned to Franklin after two years. In 1866 the Virginia School for the Deaf and the Blind in Staunton offered him the opportunity to advance his professional studies in education, and he completed one term in 1867.\nAfter Johnson's departure the New Market school became known as the New Market Polytechnic Institute, with Salyards remaining on its faculty. The institute, through Salyards' efforts, conferred on him a \"most gratefully appreciated\" Master of Arts degree in 1877.\nEarly teaching career\nWhen Johnson returned to Franklin from New Market he was reunited with James, and they founded a private classical school where he taught during the winter of 1865–66. The Johnsons' school offered an opportunity for young men in Franklin whose studies were interrupted by the war to complete their education.\nAfter Johnson finished his term at the Virginia School for the Deaf and the Blind, he returned to Franklin and founded a public school in September 1867 operating under the free education system recently authorized in Pendleton County. The following year he accepted a teaching position in Moorefield, teaching with \"great acceptance\" for three successive terms at a public school.\nCampaign for a West Virginia school for the blind\nSearch for public support\nbuilding (built 1858) in Wheeling, the West Virginia capitol building when Johnson's bill establishing the West Virginia Schools for the Deaf and Blind was passed on March 3, 1870]]\nWhile Johnson was teaching at Moorefield in early 1869, he decided to establish a state school for the education of the blind; no provision for such a school had been made in the new state's public-school system since its creation six years earlier. Before West Virginia statehood, deaf and blind youth in western Virginia attended the Virginia School for the Deaf and the Blind in Staunton (as Johnson had). After statehood, deaf and blind West Virginia children attended schools for the deaf and blind in neighboring states; West Virginia paid their tuition. Hoping to expedite the foundation of a state school for the blind, Johnson began a correspondence with newly-inaugurated Governor William E. Stevenson (who assured Johnson of his \"sympathy and support\" for the school). In addition to lobbying the governor, Johnson began canvassing the state to arouse public support for the proposed school.\nSearch for legislative support\nDue to Johnson's campaign, which gained wide public support for the school, the West Virginia Legislature convened a session in Wheeling (then the state's capital) on January 18, 1870, and proposed legislation  establishing a school for the blind that year. After drafting the bill, Johnson traveled to Wheeling; en route, at Fairmont, he met former Union Governor of Virginia Francis Harrison Pierpont. Although Johnson tried to enlist Pierpont's support in formally presenting the proposed legislation to the legislature, Pierpont said that he \"could not afford to connect his name with an enterprise so sure to fail\". Pierpont was not the only state legislator to decline Johnson's request; Joseph S. Wheat, member of the West Virginia House of Delegates representing Morgan County, believed that the proposed bill would fail because he felt that the state could not establish any more public institutions.\nUndaunted by these rebukes from prominent West Virginian politicians, Johnson remained the leading advocate for a state institution for the blind. With help from friends and other educated blind people, he was granted the use of the legislative chamber of the West Virginia House of Delegates to present an exhibition of \"music, [scholarly] recitation, and class drill\" with a delegation including his brother James and blind educator Susan Ridenour. Johnson's exhibition attracted a large audience, and after the performance he delivered an impassioned plea to West Virginia lawmakers to establish a state school for West Virginia's blind youth. The exhibition and Johnson's speech were praised by the legislators, most notably Joseph Wheat (who had previously rebuffed his proposal). The day before Johnson's presentation, Wheat declared his opposition to the bill and advocated its defeat; after Johnson's speech he \"pressed up to [Johnson] and grasping his hand, said earnestly, 'Johnson, I'll vote for your bill if it costs a hundred thousand dollars.\nadministration building in an 1880 engraving; the administration building (1846) and its grounds were the campus for the Romney Classical Institute before the American Civil War.]]\nThe bill for the school was presented to the House of Delegates by John James Davis, representing Harrison County. When it was introduced it outlined the establishment of a school only for the blind, not the deaf. The approved bill progressed through the necessary steps, and shortly before it became state law it was amended by House Delegate James Monroe Jackson of Wood County; Johnson advocated the insertion of \"deaf and dumb\" before \"blind\" in every instance in its text as a \"humane and economic\" measure. Jackson's amendment was accepted, and the bill establishing the West Virginia Institution for the Deaf, Dumb and Blind became state law on March 3, 1870. Although Johnson had campaigned for a state school for the blind, it was common practice during the 19th century to combine schools for the deaf and blind as one institution. At the time of the institution's founding he was 24 years old, and is credited by West Virginia historians as the founder of the West Virginia Schools for the Deaf and Blind. In Johnson's bill, the legislature agreed that \"all deaf and dumb and blind youth, residents of the state of West Virginia, between the ages of six and twenty-five years, shall be admitted to pupilage in the institution on application to the principal until the institution is filled.\"\nInstitution site selection\nAfter the bill's passage Johnson was appointed by Governor Stevenson to the institution's inaugural Board of Regents, which convened in Wheeling on April 20, 1870. Johnson and his fellow board members began a competition among West Virginia municipalities for the location of the new institution for the deaf and blind; the three finalists were Wheeling, Parkersburg and Romney. The board selected Wheeling, which offered its Female College campus. However, after the board's adjournment Female College supporters, unwilling to see the school closed, pressured city authorities to rescind their offer. At the board's June 23, 1870 meeting, Johnson and his colleagues unanimously selected Romney's proposal offering the Romney Classical Institute campus and an adjoining  of property on behalf of the Romney Literary Society. When the institution's site was finalized, the board reconvened on July 20, 1870, in Romney at the old Romney Classical Institute campus and selected its academic faculty and personnel. H. H. Hollister of the Ohio Institution for the Deaf and Blind was chosen as the school's first principal, and Johnson was appointed principal teacher of its School for the Blind.\nCareer at the school\nin 1884. Standing (l–r): Mr. Shaeffer, Principal John Collins Covell, Abraham D. Hays and math professor E. L. Chapin. Seated (l–r): school founder Howard Hille Johnson, J. B. McGann, Lulie Kern, Martha Clelland, Sarah Caruthers and deaf school principal H. H. Chidester.]]\nThe West Virginia Schools for the Deaf and Blind began their first academic session on September 29, 1870, with an enrollment of thirty students: twenty-five were deaf and five blind. After the school's first academic year, Board of Regents secretary Robert White wrote in his report to Governor Stevenson: \"Professor Johnson, in the instruction of the blind, has displayed a marked ability which is showing, and will show, good results in the department.\" Johnson represented the new school in 1871 at the inaugural convention of the American Association for Instructors of the Blind, and in 1876 he provided large maps used to teach his blind students as part of West Virginia's exhibit at the Centennial Exposition in Philadelphia. The exposition was the first world's fair hosted in the United States, and the first since West Virginia became a state in 1863.\nDuring Johnson's twenty-seventh year of teaching at the West Virginia Schools for the Deaf and Blind, he framed a bill for the West Virginia Legislature which would separate the institution into two schools: one for the deaf and one for the blind. It read in part: \"Be it enacted, That the West Virginia schools for the deaf and the blind, located at Romney, in the county of Hampshire, shall, after the expiration of the present term, that is to say after the 15th day June, 1897, cease to be a school for the education of deaf and blind youth, and shall thereafter be a school for the education of deaf youth only\", and would provide a separate school for the blind. Despite Johnson's active support for the bill, it failed to pass. In 1892 he wrote an article which was published in the Perkins Institute for the Blind publication The Mentor, \"Keep the Schools Out of Politics\", decrying the appointment of school administrators, educators and trustees on the institute's Board of Regents based on affiliation with the West Virginia Democratic Party instead of qualifications.\nJohnson taught in the school's blind department continuously for 43 years, until his death in 1913. He was the subject of an April 1899 article in The West Virginia School Journal, where he was described as \"still in sound health and vigor\" and \"cheerful and patient\" after 29 years of teaching. Despite his efforts to establish the West Virginia Schools for the Deaf and Blind and his long tenure, Johnson earned a minimal salary which enabled him to \"eke out a bare living.\" During his career, he acquired a \"working knowledge of several languages, a wide range of scientific knowledge, and of mathematics.\" In the 1897 History of Hampshire County, West Virginia: From Its Earliest Settlement to the Present, Hu Maxwell and Howard Llewellyn Swisher wrote about Johnson:\nWriting\nIn addition to his career as an academic and educator, Johnson was a prolific writer of prose and verse. He was elected to the Romney Literary Society, which donated its buildings and the grounds of the Romney Classical Institute to the West Virginia Schools for the Deaf and Blind after its establishment in 1870.\n]]\nHis poems include:\n* \"A Question\"\n* \"Blindness\"\n* \"Intuitive Love\"\n* \"Hymn to Spring\"\nPersonal life\nIn 1868 Johnson married Ms. Barbee of Virginia, and they had three children: Leila B. Johnson, William T. Johnson and H. Guy (or Howard H.) Johnson. His wife died in 1880, and his children from his first marriage were raised by their grandparents in Bridgewater, Virginia. In 1882 Johnson married Elizabeth Neale, the daughter of Hamlet V. Neale of Keyser. He and Elizabeth had two children: George N. Johnson and Lucy N. Johnson. Johnson died as a result of paralysis on February 8, 1913, in Romney, and is buried in its Indian Mound Cemetery.\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}