{
  "content": [
    {
      "type": "text",
      "text": "# Howard Wright 1910 Biplane__disambig_1\n\nThe Howard Wright 1910 Biplane was an early British aircraft built by Howard T. Wright to a design by W.O. Manning. One was used by Thomas Sopwith for his early record-breaking flights. Another made the first powered flight in New Zealand.\nDesign and development\nThe Howard Wright 1910 airplane was of a configuration then referred to as the \"Farman type\":\nA two-bay pusher biplane with two pairs of booms in front of the wings bearing a single elevator, and four wire-braced wooden booms behind the wings carrying a single rudder half above and half below a fixed horizontal surface bearing a second elevator. The wings had a mahogany main spar braced with piano-wire and a series of short sheet-metal king posts. Removable extensions could be fitted to the upper wing, each of these being braced from by a pair of additional king posts. The undercarriage consisted of a pair of skids each bearing a pair of wheels attached by shock cords.\nOriginally powered by a 50&nbsp;hp Gnome air-cooled radial engine, the Howard Wright prototype was later fitted with a 60&nbsp;hp E.N.V. water-cooled engine in order to qualify for the £4,000 Baron de Forest prize for the longest all-British flight to a destination on the Continent made before the end of 1910.\nOperational history\nat the controls of his Howard Wright biplane]]\nThe first 1910 Biplane first flew at Larkhill on Salisbury plain in August 1910 piloted by E. M. Maitland; following a crash and a repair it was lent to Lieutenant L. E. Watkins who later entered it for the de Forest prize.  The biplane was fitted with wireless equipment so it could be tracked as it crossed the English Channel. The aircraft crashed in Kent before it could compete for the prize and was later sold to the War Office for £625: it would be used by the Air Battalion of the Royal Engineers at Larkhill.\nThe third ENV-engined aircraft was bought by Thomas Sopwith, who after brief ground trials of his new machine on 21 November gained his Aero Club flying certificate (No 31) the same day.  On 26 November he flew  in 3 hours, 12 minutes setting a new British endurance and distance record, and on 18 December, he made a flight of  from the Royal Aero Club's Eastchurch flying field to Beaumont in Belgium.  This was not bettered before the end of the year, so Sopwith won the Baron de Forest prize. This feat was considered remarkable enough for Sopwith to be invited to meet the King, and he flew to Windsor Castle to do so on 1 February 1911. He then took the machine to America, where he made a number of exhibition flights, eventually damaging it beyond repair.\nThe fourth ENV-powered biplane was shipped to New Zealand in 1910 for the Walsh brothers (Leo and Vivian Walsh) who assembled the aircraft and Vivian Walsh taught himself to fly it. The biplane was then flown by Vivian Walsh in the first public powered flight in New Zealand on 5 February 1911 at Papakura near Auckland.\nA Gnome-powered example was used by the Graham White flying school at Hendon, being used there in 1912.  Another Gnome-powered example was entered by Lewis Turner in the 1912 Aerial Derby, but only took part in the speed trials.\nAn aircraft powered by a 40&nbsp;hp (30&nbsp;kW) Green was used by the Graham White school in 1911.  This was bought by W. C. England, who exported it to Rangoon, where he flew it in 1912.\nSpecifications\nSee also\nReferences\n;Notes\n;Bibliography\n* Lewis, P. British Aircraft 1809–1914. London: Putnam and Co., 1962.\n* Penrose, Harald. British Aviation: The Pioneer Years 1903–1914. London: Putnam and Co., 1967."
    }
  ]
}