{
  "content": [
    {
      "type": "text",
      "text": "# Howard S. Irwin\n\n| birth_place               = Louisville, Kentucky, U.S.\n| death_date                =\n| death_place               = Truro, Massachusetts\n| death_cause               =\n| resting_place             =\n| resting_place_coordinates =\n| other_names               =\n| residence                 =\n| citizenship               =\n| nationality               = American\n| fields                    = Botany\n| workplaces                =\n| patrons                   =\n| education                 =\n| alma_mater                =\n| thesis_title              = Monographic studies in Cassia. I. Section Xerocalyx. 1960\n| thesis_url                =\n| thesis_year               =\n| doctoral_advisor          =\n| academic_advisors         =\n| doctoral_students         =\n| notable_students          =\n| known_for                 =\n| awards                    =\n| author_abbrev_bot         = H.S.Irwin\n| author_abbrev_zoo         =\n| spouse                    = Marian Campbell Sterne IrwinAnne Lieb Wolff Irwin\n| partner                   =\n| children                  =\n| signature                 =\n| signature_alt             =\n| website                   =\n| footnotes                 =\n}}\nHoward Samuel Irwin Jr. (March 28, 1928 – January 23, 2019) was an American botanist and taxonomist who specialized in the genus Cassia and worked as an administrator at the New York Botanical Garden, Long Island University, and the Brooklyn Botanic Garden.\nEarly life and education\nIrwin was born in Louisville, Kentucky, in 1928. He began his education at Mount Hermon School in Massachusetts, after which point he entered Hofstra College to pursue a career in music. He then transferred to the College of Puget Sound where he earned an undergraduate degree in biology with minors in music and history in 1950, and a subsequent degree in education. Irwin was then a Fulbright teacher of botany and zoology at Queen's College in British Guiana from 1952 until 1956. During that time he was a correspondent for Time magazine. In 1956 he began work on his PhD in taxonomic botany at the University of Texas, earning his degree in 1960.\nThe New York Botanical Garden\nIrwin first began his association with the New York Botanical Garden while a graduate student at the University of Texas, Austin. During his time as a PhD student, Irwin traveled to Brazil and collected botanical specimens on behalf of NYBG, with the bulk of his collecting as a student taking place in 1958. Irwin's field notebooks from his time in Brazil (in total eight expeditions between the 1950s and the 1970s) are held by the Archives of the New York Botanical Garden, along with earlier notebooks documenting his time in Guyana and notebooks for an expedition to Suriname between 1960 and 1972. Irwin's vouchers were also deposited at NYBG and many can be viewed through the C. V. Starr Virtual Herbarium.\nIrwin was hired as a research associate at NYBG in 1960, promoted to associate curator in 1963, curator and administrator of the herbarium in 1966, head curator in 1968, executive director in 1971, and president in 1973, a position that he held until 1979 to embark on a sabbatical to pursue scientific research and writing projects. The tenure of his administration is remembered as the most difficult financial period for NYBG, and Irwin is credited with leading the organization during a very challenging time.\nDonald J. Bruckmann, chairman of the board of managers of the New York Botanical Garden, wrote of Irwin upon his departure: \"Under his stewardship he brought the Garden to new eminence in the world of horticulture and plant science, and made it a great cultural institution in the city with the highest standards in the world. During his tenure the Enid A. Haupt Conservatory was restored and The Cary Arboretum in Millbrook, NY was established.\"\nIn addition to his administrative work, Irwin is credited with initiating the Planalto do Brasil Program for the botanical study of the Brazilian Highlands region.\nAdditional employment\nIrwin was appointed vice chancellor of Long Island University from 1980 until 1983 and director of Clark Botanic Garden of the Brooklyn Botanic Garden from 1983 until 1991. He is trustee emeritus of the Truro Conservation Trust in Truro, Massachusetts, elected in 2008 after serving on the trust board from 2003 until 2008.\nHonors and associations\n* Former adjunct professor of botany at Lehman College\n* Contributing editor to Encyclopedia Americana\n* Fellow of the New York Academy of Sciences\nPersonal life\nIrwin and Marian Campbell Sterne married in the early 1950s and had two daughters.\nIrwin and Anne Lieb Wolff (now Anne Lieb Irwin) married on April 22, 1979, at the New York Botanical Garden's Enid A. Haupt Conservatory in the Bronx, NY. Wolff graduated from Oberlin College in 1946 and earned a master's degree from the Columbia University School of Social Work. At the time of their marriage, she was a potter and craft instructor at the Hebrew Home for the Aged in Riverdale, a neighborhood in the Bronx.\nThe Irwins showed a strong commitment to conservation, placing a conservation restriction on their property within the Cape Cod National Seashore which was purchased by Anne Lieb Irwin's grandparents in 1920.\nSelect publications\n* Goodland, Robert JA, and Howard S. Irwin. \"Amazon jungle: green hell to red desert?\". Developments in Landscape Management and Urban Planning (Netherlands) eng no. 1 (1975).\n* Irwin, Howard S., and Rupert C. Barneby. [http://mertzdigital.nybg.org/u?/p9016coll16,3899 \"The American cassiinaea synoptical revision of leguminosae tribe cassieae subtribe cassiinae in the New World\"]. No. 580.744747 M4/v. 35/2. 1982.\n* Irwin, Howard S., and Rupert C. Barneby. [https://www.biodiversitylibrary.org/page/44064329 \"Monographic Studies in Cassia (Leguminosae Caesalpinioideae), III, Sections Absus and Grimaldia\"]. New York Botanical Garden, 1978.\n* Wills, Mary Motz, and Howard S. Irwin. \"Roadside flowers of Texas\". (1961).\n* Irwin, Howard S. \"Monographic studies in Cassia (Leguminosae-Caesalpinioideae). I. Section Xerocalyx\". Mem. NY Bot. Gdn 12.1 (1964): 1–114.\n* Goodland, R., Howard S. Irwin, and Gus Tillman. \"Ecological development for Amazonia\". Ciência e Cultura. (1978).\nReferences"
    }
  ]
}