{
  "content": [
    {
      "type": "text",
      "text": "# Howard Willoughby\n\nHoward Willoughby (19 June 1839 – 19 March 1908) was an Australian journalist. Notably, he was the first Australian war correspondent, he wrote against penal transportation to Australia and in favour of the federation of Australia.\nWilloughby was born at Birmingham, England. He was educated at primary schools at Birmingham and London and came to Melbourne in 1857. He continued his education there, and in 1861 joined the staff of The Age newspaper as a junior reporter. About a year later he transferred to The Argus. In the 1860s he became the first Australian war correspondent, and accompanied the troops under General Cameron in the New Zealand Wars in New Zealand.\nReturning to Melbourne he was sent to Western Australia to report on the convict system. A series of letters from Willoughby appeared in the Argus and were published in a pamphlet of 64 pages in 1865, Transportation: The British Convict in Western Australia. His conclusions were that the sending of further convicts would be bad for Australia and should be resisted and that from the British point of view it was comparatively useless and wastefully expensive. From 1866 to 1869, Willoughby was a member of the first Victorian Hansard staff, and in the latter year was appointed the editor of the Melbourne Daily Telegraph. He married in 1870, Emily Frances Jones, they had a son and two daughters. He wrote for the Telegraph until 1877, when he joined the Argus staff again as chief of the news department and leader writer.\nHe fought valiantly for the constitutional party in opposition to Victorian Premier Graham Berry, and his column every week, \"Above the Speaker\" by \"Timotheous\", was a piece of journalism which never failed to be interesting. He was made chief political leader writer in 1882 and conducted a campaign in favour of federation. A selection of his writings in the Argus on this subject was published with additions in 1891 under the title Australian Federation its Aims and its Possibilities. Willoughby was frequently consulted when the drafting of federal bills was in progress.\nIn 1898 he was appointed editor of the Argus but an illness in January 1903 compelled his resignation. He continued, however, to make occasional contributions to the paper until shortly before his death in the Melbourne suburb of St Kilda. In addition to the works already mentioned he was the author of The Critic in Church, published anonymously in 1872, and Australian Pictures, published in 1886.\nWilloughby Crescent, in the Canberra suburb of Gilmore, is named in his honour.\nReferences\nExternal links\n*\n*"
    }
  ]
}