{
  "content": [
    {
      "type": "text",
      "text": "# Howard Smith (diplomat)\n\n| name = Howard Smith\n| nickname =\n| image =\n| caption =\n| allegiance = United Kingdom\n| service = MI5\n| serviceyears = 1979–1981\n| rank = Director General of MI5\n| operation =\n| birth_date = 15 October 1919\n| birth_place =\n| death_date =\n| death_place =\n| nationality = British\n| occupation =Intelligence officer, Diplomat\n| alma_mater =Sidney Sussex College, Cambridge\n}}\nSir Howard Frank Trayton Smith  (15 October 1919 &ndash; 7 May 1996) was a British diplomat who served as Director General of MI5 from 1978 to 1981.\nCareer\nSmith was born and raised in Wembley. He was educated at Regent Street Polytechnic and Sidney Sussex College, Cambridge, where he won an exhibition to read mathematics and was a contemporary of Asa Briggs, with whom he played chess. At the outset of the Second World War he was drafted to work at Bletchley Park as a codebreaker, recommending his friend Briggs to fellow Cambridge mathematician Gordon Welchman for service in Hut 6.\nFrom 1946 to 1950, Smith served in the Foreign Service in Oslo and Washington. In 1953, he was Consul in Caracas; between 1961 and 1963, he was Counsellor of State in Moscow. Returning to London, he was the Head of the Department at the Foreign Office dealing with the Soviet Union and Eastern Europe for the next five years. He then served as Ambassador to Czechoslovakia from 1968 to 1971 and later served as Ambassador to the Soviet Union in Moscow from 1976 to 1978.\nIn 1978 Smith was unexpectedly appointed Director General (DG) of MI5, the United Kingdom's internal security service, by Prime Minister James Callaghan, serving until March 1981. He was the first DG from a background in the diplomatic service. Callaghan later explained that he wanted 'to bring someone into the office from a different culture'.\nHonours\n* Companion of the Order of St Michael and St George, 1966\n* Knight Commander of the Order of St Michael and St George, 1976\n* Knight Grand Cross of the Order of St Michael and St George, 1981\nReferences"
    }
  ]
}