{
  "content": [
    {
      "type": "text",
      "text": "# Howard Wolf\n\nHoward R. Wolf (November 5, 1936, in New York City – October 7, 2023, in Buffalo, NY)) was an American author, educator and lecturer.\nLife and work\nWolf attended the Horace Mann School in New York City before attending Amherst College, where he earned a B.A. in 1959. He earned an M.A. from Columbia University in 1960 and a Ph.D from the University of Michigan in 1967. He was a full-time professor at the University at Buffalo's English department for 40 years, from 1967 to 2007, then an adjunct professor there until 2010. Wolf continues to teach a course on travel writing as a part of University at Buffalo's Discovery Seminars Program.\nWolf is the author of ten books and more than three hundred publications. His work spans literary and social criticism, fiction, memoir, education theory and practice, travel and creative nonfiction. Amherst College's Archives and Special Collections has been collecting Wolf's work since 1971. The collection includes thousands of submissions, including \"literary manuscripts, correspondence, news clippings, ephemera and other materials documenting the professional and personal life of writer, critic and educator Howard R. Wolf.\"\nWolf's books have received critical acclaim. His book, The Education of a Teacher, was included in the publication of record, The Call to Reform Liberal Education: Great Books of 1987. And his short story, \"Gardens,\" was mentioned as a favorite submission in the Spring 2010 issue of Poetica Magazine.\nWolf is a two-time Fulbright lecturer in Turkey (1983) and South Africa (1998) and lectured for three years at the University of Hong Kong.\nAwards\n* 1967 Hopwood Award for Fiction\n* 1983-1984 Fulbright Scholarship, Ankara University, Turkey\n* 1998 Fulbright Scholarship, University of the Free State, South Africa\n* 2007 Emeritus Professor and Senior Fellow, Department of English (UNY-Buffalo)\n* 2007 Senior Academic Visitor (SAV), Wolfson College, Cambridge University, Spring, 2007.\n* 2016 MacDowell Colony Fellow\nBooks\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://asteria.fivecolleges.edu/findaids/amherst/ma188.html Amherst College Howard R. Wolf Collection]\nReferences"
    }
  ]
}