{
  "content": [
    {
      "type": "text",
      "text": "# Howard Belton\n\n| death_place = Salem, Oregon, U.S.\n| office = Oregon State Treasurer\n| term_start = January 4, 1960\n| term_end = January 4, 1965\n| governor = Mark Hatfield\n| predecessor = Sig Unander\n| successor = Robert W. Straub\n| constituency =\n| office2 = President of the Oregon State Senate\n| term2 = 1945&ndash;1946\n| preceded2 = William Hoover Steiwer\n| succeeded2 = Marshall E. Cornett\n| constituency2 =\n| office3 = Member of the Oregon State Senate\n| term_start3 =1938\n| term_end3 =1959\n| predecessor3 =\n| successor3 =\n| constituency3 = Clackamas County\n| office4=Member of the Oregon House of Representatives\n| term_start4=1932\n| term_end4=1934\n| predecessor4 =\n| successor4 =\n| constituency4 =\n| party = Republican\n| occupation = Farmer\n| majority =\n| relations =\n| spouse = Mae Brown Belton\n| children = 4\n| website =\n| footnotes =\n}}\nHoward C. Belton (January 2, 1893 – November 21, 1988) was an American farmer from the state of Oregon. A native of Algona, Iowa, he served as the nineteenth Treasurer of the State of Oregon after appointment by Oregon Governor Mark O. Hatfield. A Republican, he had previously served one term in the Oregon House of Representatives and five terms in the Oregon State Senate.\nEarly life\nBelton was born in Algona, Iowa, on January 2, 1893. At seventeen he moved to Los Angeles, California. In 1915 he enrolled at the Oregon Agricultural College (now Oregon State University) to study animal husbandry. He operated a farm in Canby, Oregon, from 1917 to 1960.\nBelton was an active member of the Canby community. He served on the Canby Union School Board, was a president of both the Canby Kiwanis Club and Canby Chamber of Commerce, and also a founding board member of the Canby Union Bank.\nPolitical career\nBelton was elected to the Oregon House of Representatives in 1932, the same year that Governor Franklin D. Roosevelt beat President Herbert Hoover in Oregon by twenty-one points.\nIn 1938 he won a seat in the Oregon State Senate. Belton sat on the Ways and Means Committee.  He served as President of the Oregon State Senate for the 1945&ndash;1947 biennium. During the 1945 session Governor Earl Snell called for legislation to create a Tax Study Committee, with the original purpose of,\nengaging the services of a nationally recognized firm of tax experts for the purpose of a complete survey, examination and analysis of all phases of our tax structure and report to the Legislature with recommendations as to the most attractive, advantageous and equitable tax system consistently possible for Oregon to devise.\nState Senator Belton was a member of the Tax Study Committee and their finished report was ready for review by the 1947 legislature.\nIn 1948 Belton sought the Republican nomination for State Treasurer and won. He would lose the general election narrowly to Democrat Walter J. Pearson (49.6%&ndash;50.3%). He would continue to serve in the Oregon State Senate until his retirement in 1959.\nAt the request of Governor Mark Hatfield, Belton came out of his short retirement and was appointed to fill the vacancy created after State Treasurer Sig Unander resigned from office. In the fall of 1960, he won his own term beating Democratic State Senator Ward H. Cook. He would only serve one term as Treasurer before retiring from politics again, serving from January 4, 1960, to January 4, 1965.\nBelton was a delegate to the Republican conventions of 1944, 1952 and 1956.\nLater years\nIn his later years Belton was very productive in his community. He was member of the First Presbyterian Church in Salem and a member of the board of trustees of Lewis & Clark College for 15 years.\nBelton was also a member of the Salvation Army advisory board in Salem from 1963 to 1972 and served as chairman in 1968.\nHis wife Mae died in 1982. Belton died on November 21, 1988, at the age of 95 due to pneumonia. He is interred at Belcrest Memorial Park in Salem.\nReferences\nFurther reading\n*Belton, Howard (1977). Under Eleven Governors. Binford & Mort. ."
    }
  ]
}