{
  "content": [
    {
      "type": "text",
      "text": "# Howard Russell Butler\n\n| death_place = Princeton, New Jersey, U.S.\n| death_cause =\n| other_names =\n| known_for   = Painter and founder of the American Fine Arts Society\n| education   =\n| employer    =\n| occupation  = Patent lawyer, artist, organiser\n| successor   =\n| party       =\n| boards      =\n| spouse      = Virginia Hays\n| partner     =\n| children    =\n| parents     =\n| relatives   =\n| signature   =\n}}\nHoward Russell Butler (March 3, 1856 – May 20, 1934) was an American painter and founder of the American Fine Arts Society. Butler persuaded Andrew Carnegie to fund the construction of Carnegie Lake near Princeton University, supervised the construction of the Carnegie Mansion, designed an astronomy hall, and painted a solar eclipse for the U.S. Naval Observatory.\nBiography\nScience, law and art\nButler was born in New York City. He was the son of William Allen Butler, a lawyer and satirist. His early artistic training with William Shannon was complemented by visits to the National Academy of Design, where his parents were both fellows, and the studio of his uncle, William Stanley Haseltine.\nButler attended Princeton University and obtained a degree in Science in 1876 and he was invited to stay on for a year as an assistant professor of physics. From 1878 to 1879 he was doing technical illustrations in New York where he knew Thomas Edison. In 1881 he graduated from Columbia University where he had studied law. Whilst he was at Princeton he was an active member of the rowing team despite there being poor facilities. Butler practiced patent law until 1884 when he decided to concentrate entirely on painting.\nArt and leadership\nButler reapplied himself studying under Frederic Edwin Church, who was wintering in Mexico for his health, in January 1884 before returning to study with J. Carroll Beckwith and George de Forest Brush at the Art Students League in New York. In 1885, he went to France for two years and lived in Paris, a member of the artistic American colony in Paris, and Concarneau.\nIn 1889 Butler was able to find the capital to build the Fine Arts building at 215 West 57th Avenue. This building was to be the home of the Art Students League, the Society of American Artists, the Architectural League of New York and the newly formed American Fine Arts Society which Butler led for its first 17 years. Whilst raising these funds he first met Andrew Carnegie who employed him for ten years as president of the Carnegie Music Hall Company allowing him time off each day to paint. Butler married his wife Virginia Hays in 1890.\nBy 1899 he was a National Academician of the National Academy of Design and a member of the Architectural League and the Society of American Artists.\n]]\nArt and Carnegie Lake\nIn 1902 he was invited to join the Society of Artists and he was asked to make another portrait of the philanthropist Andrew Carnegie. Whilst Carnegie was sitting for the portrait, the problem of finding places to row at Princeton was discussed. Carnegie noted that Scottish lochs were created by just constraining the flow of water. Butler and the rowing team had just such a scheme in mind to create an artificial lake. With Carnegie's permission, Butler contacted a building firm in his home town and obtained an estimate of US$118,000 to construct a lake. Lake Carnegie and the purchase of hundreds of acres of land resulted from this meeting.\nIt was while employed by Carnegie that Butler supervised the construction of Carnegie's mansion on Fifth Avenue, which was designed by Babb, Cook, & Willard and is now the Cooper-Hewitt Museum, but he and Carnegie differed and Butler left his employ in 1905.\nFrom 1905 until 1907 he was in California and again in the early 1920s when he was living at Pasadena and Santa Barbara. He may therefore have missed the opening of the lake in 1906 that was three and a half miles long and eight hundred feet wide. It was reported that President Wilson tried to later persuade Carnegie to give funds to Princeton but he was told that he had already given a lake. Wilson is reputed to have said, \"We needed bread and you gave us cake.\"\nSolar eclipse and art\nIn 1918, Butler's association with Carnegie led to him being invited to witness and record the 1918 Solar eclipse that was observed from Baker City in Oregon. The expedition was organized by the U.S. Naval Observatory and included Samuel Alfred Mitchell as its expert on eclipses. Butler noted later that he used a system of taking notes of the colors using skills he had learned for transient effects. Usually a sitting for a portrait took two hours but an eclipse would take just over 112 seconds. It has been noted that he had painted Carnegie thirteen times and like the eclipse he could never keep still to allow Butler to make considered notes. His revived interest in physics led to his 1923 book Painter and Space which coincided with his second visit to a solar eclipse. He also created pictures of planets that were as seen from one of their moons. His last known eclipse visit was in 1932.\nButler is known particularly for paintings of seascapes and for his views of the eclipse of the sun, but he also painted people and landscapes. Butler also designed an Astronomy Hall for the American Museum of Natural History. Butler's paintings of solar eclipses were on display for many years at the Hayden Planetarium at that museum.\nLandscapes for the National Park Service\nIn 1926, the Union Pacific Railroad commissioned Butler to paint a series of landscapes for promotion of the Colorado Plateau and its scenic marvels as a part of the Union Pacific Railroad “Grand Circle Tour”. He completed seven large paintings of Zion National Park and one of Grand Canyon National Park. These paintings were used in a traveling exhibit by the Union Pacific to promote tourism in the region. They represent the early history of the establishment of Zion and Grand Canyon as well as early tourism promotion in Utah. The paintings were also on exhibit at the American Museum of Natural History. By 1929 they reached the Museum of Science in Buffalo, NY for display. Eventually, the canvases were relocated to storage. In 1998/99, their registrar discovered the paintings and donated them to Zion National Park and Grand Canyon National Park. The paintings are nationally significant as they represent the early period of National Park Service development of visitor recreation and transportation.\nButler died in Princeton, New Jersey, in 1934 near the lake that he had organized for their rowing team. His work can be seen at the Metropolitan Museum of Art, the Smithsonian American Art Museum, American Museum of Natural History and of course Carnegie Lake.\nFile:Howard Russell Butler Les ramasseurs de varech.jpg|Howard Russell Butler : Les Ramasseurs de varech (1886) (near Concarneau)\nReferences\nExternal links\n*[http://www.aaa.si.edu/collections/howard-russell-butler-papers-8987 Butler's papers] at the Archives of American Art.\n*[http://artmuseum.princeton.edu/transient-effects Butler online exhibition]\n*[http://cplorg.cdmhost.com/cdm/singleitem/collection/p4014coll10/id/10/rec/17 \"Andrew Carnegie as Lord Rector\"] at the Cleveland Public Library\n*[https://www.bedfordfineartgallery.com/howard_russell_butler_artist.html Artwork by Howard Russell Butler]"
    }
  ]
}