{
  "content": [
    {
      "type": "text",
      "text": "# Howard Smit\n\nHoward J. Smit (April 19, 1911 &ndash; August 1, 2009) was a pioneering American film make-up artist known for his work on films including The Birds and The Wizard of Oz. Smit also spearheaded the movement to establish the Academy Award for Best Makeup to recognize the profession within the film industry. He also successfully pushed studios to credit film make-up artists in a movie's screen credits.\nSmit became a founding member of the IATSE local 706, Make-up and Hairstylists Guild chapter, in 1937.\nEarly life\nHoward Smit was born in Chicago, Illinois, on April 19, 1911. He moved with his parents to Los Angeles, where he eventually enrolled in law school.\nCareer\nSmit began working as a make-up artist at RKO Studios in order to pay for law school. He soon dropped out of law school and became a film studio make-up apprentice. He freelanced for several studios and businesses, including MGM Studios, Republic Studios and Max Factor.\nSmit's earliest work film work included in the make-up departments of The Wizard of Oz and Gunga Din. Throughout the 1940s and 1950s, Smit worked on a number of feature films, especially Westerns. He worked with some of Hollywood's best known actors of the time, including Myrna Loy, Joan Crawford, Ethel Barrymore, Roy Rogers, Barbara Stanwyck, Dale Evans, Lionel Barrymore, and Robert Mitchum.\nSmit worked on two of Alfred Hitchcock's films in the 1960s, Marnie and The Birds.\nHe switched to television and later worked on the Mod Squad and The Streets of San Francisco.\nIndustry work\nThe International Alliance of Theatrical Stage Employees offered the Hollywood Motion Picture Make-up Artists Association a union charter in 1937. The charter led to the foundation of the IATSE local 706, Make-up and Hairstylists Guild chapter, in 1937, of which Smit was a founding member. Smit remained active with the Make-up and Hairstylists Guild and other related unions and organizations for more than 60 years, until his retirement in 1994.\nSmit served as the president of the IATSE local 706, Make-up and Hairstylists Guild for two terms. Smit was first elected president in 1953 and re-elected to a second term in 1955. He later became a member of Make-up and Hairstylists Guild executive board of directors. Smit served as the union's business representative from 1974 until 1994, and remained business representative emeritus following his retirement.\nBeginning in the 1950s, Smit pushed for pension, health and welfare benefits for Hollywood's make-up artists and hairstylists. Smit's efforts were successful and these benefits are now part of the industry's Basic Agreement contract.\nSmit and John Inzerella successfully spearheaded efforts to require film studios to include a mandatory contractual clause that credited make-up artists and hairstylists in a movie's screen credits. The compulsory screen credits for a film's make-up artists were adopted in the 1980s. Smit also negotiated a five-day work week for film make-up artists.\nSmit and Inzerella also led the campaign to establish the Academy Award for Best Makeup as a recognition of make-up artists by the Academy of Motion Picture Arts and Sciences. Smit's efforts were rewarded in 1981 when the academy created the first Oscar category for \"achievement in make-up.\" The inaugural Academy Award for film make-up was awarded in 1982 to make-up artist Rick Baker for his work on An American Werewolf in London. The Make-up and Hairstylists Guild honored Smit for his efforts in establishing the Academy Award for achievement in make-up by creating the Smitty Award in his honor.\nSmit established the Deb Star Ball in 1953, an industry event which was held annually for 15 years. The proceeds from the ball were used to fund the IATSE Local 706 welfare committee. Those honored at the Deb Star Ball included Jill St. John, Mary Ann Mobley, Kim Novak and Tuesday Weld.\nSmit served as both a Governor and a board member of the Academy of Television Arts & Sciences. He also worked as a director for the Motion Picture Industry Health and Pension Fund.\nSmit was shot and wounded by another make-up artist Donl Morse in 1986, as he was exiting a board meeting of the Make-up and Hairstylists Guild. Smit's assailant later shot and killed two Los Angeles police officers at the perpetrator's home. Smit recovered from the shooting. He continued to serve on the Make-up Guild for eight more years until his retirement in 1994.\nHe also developed a line of moisturizing cream which was sold in stores under the name, Stage Ten Cosmetics.\nDeath\nHoward Smit died at the Providence Tarzana Medical Center on August 1, 2009, in Tarzana, California, at the age of 98. His first wife, Edith Smit, whom he had been married to for more than 40 years, was a body make-up artist. Smit's second wife, Isabelle, died on June 26, 2009.\nFuneral services were held at the Mount Sinai Memorial Park Cemetery in Los Angeles.\nReferences\nExternal links\n*"
    }
  ]
}