{
  "content": [
    {
      "type": "text",
      "text": "# Howard Brandt\n\n| death_place       =\n| citizenship       =\n| nationality       = American\n| ethnicity         =\n| fields            = Physicist\n| workplaces        = University of MarylandArmy Research Laboratory\n| alma_mater        = MITUniversity of Washington\n| doctoral_advisor  = Marshall Baker\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         = maximal proper acceleration and Turbutron and quantum cryptographic entangling probe\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| influences        =\n| influenced        =\n| awards            =\n| religion          =\n| signature         =\n| footnotes         =\n}}\nHoward Edward Brandt (January 2, 1939, in Emerado, North Dakota – April 13, 2014) was a physicist with the United States Army Research Laboratory in Maryland, and was notable for his work in general relativity and quantum field theory and quantum information. He was the inventor of the turbutron.\nEducation\nIn 1958, he graduated from Queen Anne High School, Seattle, Washington. He received his BS in physics from MIT as a National Sloan Scholar, 1962. He received his MS in physics from the University of Washington, 1963. He obtained his PhD at the University of Washington with a thesis entitled Sixth Order Charge Renormalization Constant, under Marshall Baker, 1970, calculating the divergent part of the inverse charge renormalization constant in quantum electrodynamics to sixth order in perturbation theory in Feynman gauge to verify the gauge invariance of the calculation.\nCareer\nIn 1972, he was a postdoc in the area of general relativity at the University of Maryland. In 1976, he joined the United States Army Research Laboratory (then called the Harry Diamond Laboratory). From 1986 to 1995, he technically directed three major programs for the Office of Innovative Science and Technology of the Strategic Defense Initiative Organization, involving nationwide research on high-power microwave source development, sensors for interactive discrimination, and electromagnetic missiles and directed energy concepts. Since 1995, he has been performing research on quantum computing and quantum cryptography.\nHe was the Editor-in-Chief of the journal Quantum Information Processing.\nHonors\nBrandt has received a number of honors including the Siple Medal, Hinman Award, and Ulrich Award. He is an elected Fellow of the US Army Research Laboratory and is also a SPIE Fellow. He received a major achievement award from the US Army Research Laboratory for his publications and research on quantum information processing. He also received the ARL 2004 Science Award.\nAchievements\nHe is inventor of the turbutron, a high power millimeter-wave source (US Patent 4,553,068), and co-inventor of a quantum key receiver based on a positive operator valued measure (US Patent 5,999,285). His broad research interests include quantum field theory, quantum computation, quantum cryptography, quantum optics, general relativity, and non-neutral plasma physics.\nSee also\n* Quantum Aspects of Life\nReferences\nExternal links\n* [https://web.archive.org/web/20080930232926/http://www.icpress.co.uk/physics/p581.html Quantum Aspects of Life]\n*\n* [http://en.scientificcommons.org/howard_e_brandt Brandt at Scientificcommons]\n* [https://www.springer.com/physics/journal/11128?detailsPage=editorialBoard Brandt on editorial board]"
    }
  ]
}