{
  "content": [
    {
      "type": "text",
      "text": "# Howardian Hills__disambig_2\n\n| embedded        =\n}}\nThe Howardian Hills are a range of hills in England located between the Yorkshire Wolds, the North York Moors, and the Vale of York. They are named after the Howard family, who still own land locally, and have been designated a National Landscape.\nTopography\nThe Howardian Hills form 79 square miles of well-wooded undulating countryside between the flat agricultural Vales of Pickering and York. The irregular  high ridges of the Howardian Hills are a southern extension of the rocks of the Hambleton Hills in the North York Moors. Jurassic limestone, pastures, and extensive woodland overlook the agricultural plains below. On the eastern edge, the River Derwent cuts through the Hills in the Kirkham Gorge, a deep winding valley formed as an overflow channel from glacial Lake Pickering.\nSettlement\nAlthough there are no towns within the AONB, the market towns of Helmsley and Malton lie just beyond the boundary. From Malton to Hovingham is a line of spring line villages. The majority of older buildings are made of locally quarried limestone with red pantile roofs and those which developed as part of the grand country house estates have largely retained a coherent identity. The village of Ampleforth and its Abbey and College lie within the area.\nLand use\nNew stone walling conservation work in the Howardian Hills AONB\nHigh grade arable land, pasture, and managed woodland makes this rich farming country whose diversity contributes to its attractive rural character.\nFlora and fauna\nThe Howardian Hills AONB is a key area for several nationally important Biodiversity Action Plan (BAP) Priority habitats including lowland broadleaved woodland, wood pasture, veteran trees, limestone, and neutral grasslands and fen meadows. Characteristic species include brown hare, lapwing, tree sparrow, and barn owl as well as several local rarities such as knapweed broomrape and baneberry.\nHowardian Hills Area of Outstanding Natural Beauty\nDesignated Area of Outstanding Natural Beauty (AONB); one of 46 areas in England, Wales, and Northern Ireland designated for conservation due to significant landscape value, along with National Parks and Heritage Coasts.\nThe Howardian Hills are designated an AONB because of the following Special Qualities:\n* Unusual landform: The Howardian Hills are the only area of Jurassic limestone in Northern England with AONB designation. Kirkham Gorge on the River Derwent, Yorkshire is a unique glacial overflow channel of great scientific importance.\n* A richly varied landscape: The landscape comprises a complex system of hills and valleys of woodland, arable fields, pasture, fens, hedgerows, stone walls, designed parklands, and scattered settlements.\n* Landscape of high visual quality: Diverse landform and land use with contrasting scale, colour, texture and form alongside historic houses, extensive woodland, sweeping views, farming landscapes, and traditional building styles provide great aesthetic appeal.\n* Remarkable heritage: A concentration of archaeological and historic features including Iron Age earthworks, medieval castles and monasteries, grand houses, and designed landscapes including Castle Howard, Newburgh Priory, Hovingham Hall, Gilling Castle, and Nunnington Hall contribute to the dramatic landscape.\n* An important wildlife resource: The area boasts outstanding wild plants and animals within the unique River Derwent and has nationally important fens as well as relatively extensive remnants of Ancient Semi-Natural Woodland.\nEach of these attributes is important in its own right, but it is their combination in a relatively small area that has produced a landscape of national significance.\nReferences\nExternal links\n*[http://ads.ahds.ac.uk/catalogue/library/greylit/details.cfm?id=3100 Bateman, J. (2006) 'Howardian Hills Field Collection Survey' John Bateman: York] Archaeological Survey Report.\n*[https://ampleforth.ryedaleconnect.org.uk/parish-council/your-council/  Ampleforth Parish Council] Village partly in the Howardian Hills AONB\n*[http://www.howardianhills.org.uk/ Howardian Hills AONB]"
    }
  ]
}