{
  "content": [
    {
      "type": "text",
      "text": "# Howard Backen\n\n| birth_place = Montana, U.S.\n| death_date =\n| death_place = Napa Valley, California, U.S.\n| alma_mater = University of Oregon\n| spouse =\n*\n}}\n| children = Annie Backen, Steve Backen, Eric Backen\n| parents =\n| awards =\n| practice = Backen & Gillam Architects\n| significant_buildings = *Aspen Institute\n*Sundance Institute\n*Disney's Sound Studios\n*Delancey Street Foundation\n| significant_projects = *Teacher’s Training Institute, Tehran, Iran\n*Stars Restaurant, Singapore\n| signature =\n| website =\n| image =\n}}\nHoward Backen (June 8, 1936 – 22 July 2024) was an American architect. He co-founded Backen, Arrigoni & Ross, now BAR Architects, following college and later founded Backen & Gillam Architects in Napa, California. At the latter firm, he primarily focuses on residential and winery projects. Eschewing narcissistic styles as fads, Backen opts for architectural design that mesh with the landscape and its occupants. He is credited for being a large influence on the architectural aesthetic of the Napa Valley.\nEarly life and education\nBacken was born in Montana, on June 8, 1936. His interest in architecture began when he was just five years old. He moved to rural Roseburg, Oregon at a young age. His family sometimes visited his uncle, who was an architect, in Montana, and Backen recalls sifting through his uncle's drawings and sketches while his siblings and cousins played.\nBacken attended the University of Oregon, where he graduated in 1962 with a B.Arch degree. It was in college that he learned of the design process and how designs should be derived from the environment and not from an arbitrary preconceived style.\nCareer\nKnowing he did not want to practice architecture in rural Oregon, Backen moved to San Francisco, partly attracted by the 1960s culture. He landed a job at the prestigious firm Wurster, Bernardi & Emmons. William Wurster's practicality and attention to detail resounded with Backen, and he took much of it to heart, instilling much of it into his own design vocabulary. Following his time there, he worked briefly for Warren Callister and Romaldo Giurgola before starting his own practice.\nBAR Architects\nIn 1966, Backen, along with two of his colleagues from the University of Oregon, Robert Arrigoni and Bruce Ross, founded Backen, Arrigoni and Ross, now known as BAR Architects. Their venture proved successful and the firm grew to over 100 employees. During his time there, he played a major role in several distinctive projects in the film industry such as the Sundance Institute, Skywalker Ranch, and the Disney Burbank Sound Studios. Despite these high-profile projects, he says one of his most rewarding projects while at BAR was the Delancey Street Foundation in San Francisco. A foundation that focuses on assisting society's less fortunate to help themselves out of their situation, Delancey Street approached Backen to design a building that would house many of the foundation's residents. The process was unique in that the residents themselves were intimately involved with the building, including the actual construction of the building.\nBacken found himself spending more time managing a large firm than doing design work. He also grew weary of designing for management firms at BAR and desired more interaction with individuals with the eventual occupants of the architecture he was designing.\nBacken & Gillam Architects\nHe established a friendship with Bill Harlan while at BAR, designing his private residence. In 1994, when Harlan asked Backen to design a winery he was opening up, Backen took the opportunity to move to Napa. Since then, Harlan has met with Backen weekly and have continuously worked closely on projects together.\nShortly after moving to Napa, Backen opened Backen & Gillam Architects with James Gillam in 1996.\nIn 2013, From The Land was published by Rizzoli. The monograph is the first volume showcasing 38 of the firm's projects from the last 22 years.\nPersonal life and death\nAside from his professional reasons, Backen cited the clear warm weather of Napa juxtaposed against the cold foggy days of San Francisco as a personal reason to move to Napa. He and his former wife, Lori, purchased a five-acre property with an existing house at the bottom of a hill in 1996. They lived there three years before Backen designed a new house at the top of the hill with an expansive view of the Napa Valley, a view the previous owners were not aware of.\nHoward and his wife, Ann Ernish Backen, also own a restaurant called Archetype, formerly called French Blue, in a spot attached to the office of Backen & Gillam Architects.\nBacken died on July 22, 2024, at the age of 88.\nReferences"
    }
  ]
}