{
  "content": [
    {
      "type": "text",
      "text": "# Howard Engel\n\n| birth_place   = St. Catharines, Ontario, Canada\n| death_date    =\n| death_place   =\n| resting_place =\n| occupation    = Writer, producer\n| years_active  =\n| genre         = Mystery and non-fiction\n| notableworks  = Benny Cooperman series\n| spouse        = |Janet Hamilton}}\n| children      = 3\n}}\nHoward Engel CM (April 2, 1931 – July 16, 2019) was a Canadian mystery author and CBC producer who resided in Toronto, Ontario. He was famous for his Benny Cooperman detective series, set in the Niagara Region in and around the city of Grantham, Ontario, mirroring St. Catharines, Ontario, where he was born. He was one of the founding authors of Crime Writers of Canada in 1982.\nPersonal life\nFrom 1962 to 1978 he was married to Marian Engel, a noted Canadian author of literary fiction, who died in 1985. They had two children, twins Charlotte and William, born in 1965. Charlotte currently is an independent television producer. Engel married Canadian novelist Janet Hamilton. The couple have one son, Jacob Engel, born in 1989.\nIn 2001, he unknowingly suffered a stroke that left him with alexia sine agraphia, a condition that prevented him from understanding written words without a major effort without affecting his ability to write. He was later able to write a new novel, Memory Book (2005), in which his character Benny Cooperman suffers a blow to the head and is similarly affected.  He later published The Man Who Forgot How To Read (2007), a memoir of the time he spent recovering from the stroke, with an afterword by Oliver Sacks (who wrote about Engel's reading problems in the book ''The Mind's Eye), and another novel, East of Suez, in 2008.\nIn February 2007, Engel was appointed a Member of the Order of Canada, receiving it at the 100th investiture. In 2013, Engel received a Queen Elizabeth II Diamond Jubilee medal. He died in Toronto on July 16, 2019, of pneumonia that arose from a stroke, at the age of 88.\nBibliography\nBenny Cooperman novels\n*The Suicide Murders (1980),  (Adapted as an CBC TV movie starring Saul Rubinek)\n*The Ransom Game (1981),\n*Murder On Location (1982),\n*Murder Sees The Light (1984),  (Adapted as a CBC TV movie starring Saul Rubinek)\n*A City Called July (1986),\n*A Victim Must Be Found (1988),\n*Dead And Buried (1990)\n*The Whole Megillah (1991)\n*There Was An Old Woman (1993),\n*Getting Away With Murder (1995),\n*My Brother's Keeper (2001),  (with Eric Wright)\n*The Cooperman Variations (2001),\n*Memory Book (2005),\n*East Of Suez (2008),\n*Over the River (2018),\nOther Novels\n*Murder In Space (1985),   (FX Woolf was a pen-name for Howard Engels and Janet Hamilton).\n*Murder In Montparnasse (1992),\n*Mr. Doyle And Dr. Bell (1997),\n*A Child's Christmas In Scarborough (1997),  »City of Fallen Angels » (2014)\nNon-fiction\n*Lord High Executioner: An Unashamed Look At Hangmen, Headsmen, And Their Kind (1996),\n*Crimes Of Passion: An Unblinking Look At Murderous Love (2001),\n*The Man Who Forgot How To Read (2007),\nAnthologies\n*Criminal Shorts: Mysteries By Canadian Crime Writers'' (1992),  (ed. with Eric Wright)\nReferences\nExternal links\n*"
    }
  ]
}