{
  "content": [
    {
      "type": "text",
      "text": "# Howard DeVore__disambig_1\n\n| birth_place = Palestine, Illinois, U.S.\n| death_date =\n| death_place =\n| occupation = Writer, archivist, collector, dealer, pulp magazine authority\n| known_for = Activities in fandom\n| awards = Detroit Science Fiction Hall of FameFirst Fandom Hall of Fame award\n| nickname = \"Big Hearted\" Howard DeVore\n| death_cause =\n| spouse = Sybil\n| children = 3 daughters\n}}\nHoward DeVore (May 26, 1925 – December 31, 2005) was an American archivist, science fiction collector, dealer, expert on pulp magazines, APA and fanzine writer, convention organizer, and active volunteer in science fiction fandom.\nBiography\nDeVore was born in Palestine, Illinois, on May 26, 1925. His family moved to Detroit, Michigan, when DeVore was six months old. They moved back to Illinois in 1930 because of the Great Depression. He lived on a series of farms, attending a one-room schoolhouse. DeVore's father made a living by \"whatever means was necessary, including making moonshine and stealing coal.\" The family moved back to Detroit in 1934, and DeVore quit school at the age of 16 to start working. He was employed in \"various construction trades, auto factories,\" and ended up working for the United States Postal Service for 22 years.\nStarting in about 1938, DeVore accumulated an extensive collection of fannish culture and science fiction-related artifacts and publications.\nDuring World War II, Young \"Howie\", as his flight jacket proclaims, was a ball turret gunner on a B-17 Flying Fortress, flying bomb runs over France with the Eighth Air Force.\nIn his later years, as his health was in decline, DeVore donated original and electronic copies of much of his collection to various science fiction-themed archives.\nRole in fandom\nDeVore was an active member of the National Fantasy Fan Federation and First Fandom.\n* 1948-1980 Member of Michigan Science-Fantasy Society (MSFS), The Misfits\n* 1950-2005 Attended every single Midwestcon (Cincinnati, Ohio, area) since its inception.\n* 1952-2005 Active member and sometime official editor (OE) of the Spectator Amateur Press Society (SAPS), an amateur press association. Also an active member of the Fantasy Amateur Press Association (FAPA) and the Pulp Era Amateur Press Society (PEAPS).\n* 1959 Worldcon, Detention (Detroit). Concom, head of publicity. \"There will be a Worldcon in Detroit over my dead body.\"\n* 1965 Detroit Triple Fan Fair (Detroit), board member of the first official DTFF\n* 1966 Worldcon, Tricon, a joint bid by Cleveland (where it was held), Detroit, and Cincinnati.  DeVore was associate chairman for Detroit.\n* 1966-1968 Marcon (Columbus, Ohio) — co-founder of the convention\n* 1999 ConFusion (Michigan), Toastmaster\n* 2000-2005 Director at Large, Science Fiction Oral History Association\nPersonal life and death\nDeVore and his wife Sybil had three daughters: Cheryl (b. 1944), Karol (b. 1952), and Suzanne (b. 1954).\nHe had five grandchildren: Julie (b. 1966), Ian (b. 1982), Jesse (b. 1985), Sarah (b. 1986), and Jillian (b. 1986), as well as two great-grandchildren: Casey and James.\nDeVore died on December 31, 2005, at the age of 80. Reflecting his devotion to Midwestcon and other fan conventions, his wake was held at the ConFusion convention in 2006. Later that year, DeVore was posthumously made Fan Guest of Honor at 64th World Science Fiction Convention, held in Los Angeles. His memory was honored at the convention. Several members of his family attended the convention in his honor, and they were recognized during the events.\nBibliography\n*\n*\nAwards and recognition\nDeVore's directory, Hugo, Nebula & World Fantasy Awards, was a 1999 nominee for the Hugo Award for Best Related Work.\nIn 2004, he was inducted into the Detroit Science Fiction Hall of Fame at ConFusion. In 2005, he was given the First Fandom Hall of Fame award.\nConvention Fan Guest of Honor\n* 1971 Lunacon (New York State)\n* 1974 ConFusion (a.k.a. A2 Relax-I-Con, the zeroth and/or 1st iteration of the con) (Michigan)\n* 1975 Marcon (Columbus, Ohio)\n* 1991 Windycon (Oak Brook, Illinois)\n* 1996 Kubla Khan (Nashville)\n* 2005 Marcon 40 (Columbus)\n* 2006 (posthumous) Worldcon (Los Angeles)\nNotes\nReferences\nCitations\nSources\n*\nExternal links\n*\n*"
    }
  ]
}