{
  "content": [
    {
      "type": "text",
      "text": "# Howard Turner Barnes\n\nHoward Turner Barnes (21 July 1873, in Woburn, Massachusetts – 4 October 1950, in Burlington, Vermont) was an American-Canadian physicist who specialized in calorimetry, electrolytes, ice formation and ice engineering.\nEducation and career\nIn 1879, Howard T. Barnes moved with his family from Massachusetts to Montreal. where his father was appointed minister of Montreal's Unitarian church. After attending secondary school in Montreal, he entered in 1889 McGill University, where he received in 1893 his bachelor's degree in physics and, after working there as a demonstrator in chemistry, an M.S. in Applied Science in 1896. He became at McGill a demonstrator in physics and worked under Hugh L. Callendar. In 1898, Ernest Rutherford succeeded to Callendar's professorial chair and supervised Barnes, among others. In 1899 Barnes went to the U.K. on a scholarship from the Royal Society; he returned to McGill in 1900 as a lecturer in physics. In 1900 he received a D.Sc. from McGill, where he became an assistant professor in 1901 and associate professor in 1906. In 1907 he succeeded Ernest Rutherford as Macdonald Professor of Physician, but resigned his chair in 1919. In the early 1920s he again became a professor at McGill, where he remained until his retirement as professor emeritus in 1933.\nBarnes worked with Callendar on extremely precise measurements in constant-flow calorimetry, in which a given amount of electrical energy is added to a given mass of flowing liquid whose consequent increase in temperature is precisely measured. Barnes pioneered the constant-flow calorimeter which is used by contemporary physical chemists. He also studied turbulence, electrolytes, and the heat effects of radium. In the 1920s, he became a world-class expert on anchor ice, frazil ice, and ice engineering.\nAwards and honours\nBarnes was elected a Fellow of the Royal Society of Canada in 1908 and a Fellow of the Royal Society of London in 1911. He was honoured as the Tyndall Lecturer for 1912 at the Royal Institution in London.\nArticles\n* with H. L. Callendar:\n*\n*\n* with Ernest Rutherford:\nBooks\n*\n*\nPatents\n* [http://www.freepatentsonline.com/1022526.html Method of and apparatus for recording marine conditions. U.S. Patent 1,022,526], 1911\n* [https://patents.google.com/patent/US1562137 Method of loosening ice accumulations. U.S. Patent 1,562,137], 1925\nExternal links\n* [https://archivalcollections.library.mcgill.ca/index.php/howard-turner-barnes-fonds Howard Turner Barnes fonds, MG1016.] McGill University Archives, McGill University. Fonds consists of Barnes's records (originals, printed materials, photographs and motion pictures) of a professional and research nature, covering Barnes’s general scientific and university work during World War I, a number of special research problems, and his involvement in scientific and social organizations.\nReferences"
    }
  ]
}