{
  "content": [
    {
      "type": "text",
      "text": "# Howard Baker Sr.\n\n| death_date          =\n| birth_place         = Somerset, Kentucky, U.S.\n| death_place         = Knoxville, Tennessee, U.S.\n| spouse              = Dora Ann Ladd Baker Edith Irene Bailey Baker\n| children            = Howard Baker Jr.\n| profession          = Attorney, politician, newspaper publisher\n| party               = Republican\n| alma_mater          = University of Tennessee\n| nickname            =\n| allegiance          =\n| branch              =\n| service_years       =\n| rank                =\n| unit                =\n| commands            =\n| battles             =\n| awards              =\n}}\nHoward Henry Baker Sr. (January 12, 1902 – January 7, 1964) was an American lawyer and politician who was elected to seven consecutive terms as a United States Representative from Tennessee from 1951 to 1964.\nHe was the father of future U.S. Senate majority leader and White House chief of staff Howard Baker Jr.\nBiography\nBaker was born in Somerset, Kentucky, in 1902 to James F. Baker, an attorney and newspaper publisher in Huntsville, Tennessee, and Kentucky native Helen Keen Baker. The family moved to Huntsville, Tennessee, in 1909, and Baker spent most of his childhood in Scott County. The family moved to Knoxville in 1918, the same year that Baker entered the university there. He graduated from the University of Tennessee in 1922 and its law school in 1924; he was admitted to the Tennessee bar in 1923. Baker is an alumnus of the Epsilon Eta chapter of Sigma Nu Fraternity. After law school, Baker married Dora Ladd and returned to Huntsville to become a partner in his father's practice. Their son, Howard Baker Jr., was born in Huntsville in 1925. Dora died when Howard Jr. was a child. On September 15, 1935, he married Edith Irene Bailey.\nCareer\nFor a period, Baker served as publisher of a weekly newspaper in Huntsville, Tennessee, the county seat of Scott County. In 1928, he was elected to a term in the Tennessee House of Representatives, and served on the Scott County Board of Education from 1931 to 1932. In 1934, he became district attorney general of the former 19th Judicial Circuit, serving until 1938 in that capacity.\nIn 1938, Baker made an unsuccessful bid for governor of Tennessee, losing in the general election to Democrat Prentice Cooper. In 1940, he ran unsuccessfully for the United States Senate, losing to Democrat Kenneth McKellar. He was a delegate to the Republican National Convention in 1940, 1948, 1952, and 1956. He was vice president and general counsel to the former Oneida and Western Railroad in 1945, and was also on the board of directors of the First National Bank of Oneida.\nBaker was elected to the 82nd and to the six succeeding Congresses and served from January 3, 1951, until his death from a heart attack in Knoxville, Tennessee on January 7, 1964. He was succeeded in office by his widow Irene, who completed his final term as a caretaker and sought no further election.\nBaker was one of the few Southern Congressmen not to sign the 1956 Southern Manifesto that opposed the desegregation of public schools ordered by the Supreme Court in Brown v. Board of Education, and voted in favor of the Civil Rights Act of 1960 and the 24th Amendment to the U.S. Constitution, but did not vote on the Civil Rights Act of 1957.\nDeath\nBaker died, following a heart attack, at Fort Sanders Presbyterian Hospital, Knoxville, Knox County, Tennessee, January 7, 1964, five days before his 62nd birthday. He is interred at Sherwood Memorial Gardens, Alcoa, Tennessee. Tennessee State Route 63 is named Congressman Howard H. Baker Highway in his honor.\nBaker is probably best remembered as the father of Howard H. Baker Jr., a three-term U.S. senator from Tennessee and United States Senate Majority Leader who later served as White House Chief of Staff under Ronald Reagan and was the former United States Ambassador to Japan.\nSee also\n* List of members of the United States Congress who died in office (1950–1999)\nReferences\nExternal links\n*\n* [http://dlc.lib.utk.edu/spc/view?docId=ead/0012_003339_000000_0000/0012_003339_000000_0000.xml Howard and Irene Baker Papers], University of Tennessee Knoxville Libraries"
    }
  ]
}