{
  "content": [
    {
      "type": "text",
      "text": "# Howard M. Ervin\n\n|birth_place=Saint Nicholas, Pennsylvania, U.S.\n|death_date=\n|death_place=Tulsa, Oklahoma, U.S.\n|resting_place=Memorial Park CemeteryTulsa, Oklahoma, U.S.\n|occupation=Academic\n}}\nHoward M. Ervin (September 21, 1915 – August 12, 2009) was an American scholar and pastor. He was a professor at Oral Roberts University until December 2006. He served on the faculty for 40 years and has been involved with the university from its inauguration in 1963. Only Robert G. Voight has served, as of May 7, 2009, longer than Ervin at the faculty of Oral Roberts University.\nErvin was born on September 21, 1915, in Saint Nicholas, Pennsylvania.\nErvin earned a Th.D. from Princeton University. Ervin earned a BA and ThB from Easter Baptist Theological Seminary. He also earned a MA from the Asia Institute and a BD from New Brunswick Seminary.\nErvin was a pastor of an American Baptist congregation (Emmanuel Baptist Church, Atlantic Highlands, NJ) might sound odd when one observes his seminal works on manifestations of the Holy Spirit, which are still among the finest works on this topic today. His work in the field of the manifestations of the Spirit were honored in a special collection of essays.\nThought\nErvin was one of the first to argue for a unique Lukan pneumatology. Ervin's thesis was ground breaking work for the area of New Testament studies that would lead to a whole field of New Testament studies in the area of Luke-Acts.   Pentecostals have benefited greatly from these insights.  As scholars like Roger Stronstad and James Shelton have added to this discussion, these men have also stood on Ervin's shoulders.  Issues of subsequence, evidence and empowerment all find their particular support in the view of a unique Lukan pneumatology.   This is the core of Ervin's arguments against the evangelical views of conversion-initiation and Pauline theology.\nPentecostal-Roman Catholic Dialogues\nErvin was able to bring the Pentecostal message to believers from all traditions. Through his friendship with David du Plessis, Ervin was invited to participate in the Pentecostal-Roman Catholic Dialogues. Du Plessis ask Ervin to participate because he knew that Ervin could articulate the Pentecostal position theologically. During the years of 1979 to 1987, Ervin participated in the dialogues as a representative of the Pentecostal point of view. Ervin was not only a participant but he also was a presenter for the Pentecostal position in the dialogue in 1979 and 1987 on the subjects of hermeneutics and koinonia. This was historic considering that the steering committee voted in 1976 to only have Pentecostals serve as in the Pentecostal participants. Ervin's Pentecostal theology, his scholarly and formal communication style, and ecumenical beliefs made him the exception to the rule.\nRecognition\nErvin's main contribution in scholarship has been to the area of Pneumatology. However, as already noted above, his ecumenical work should also not be neglected.\n:Catholics particularly respond to his {Ervin's] quite and effective ministry. Yet he is a Catholic in the larger sense: his concern for the whole church in his genuine grief at her disunity, and in his efforts to reconcile the three great branches of Christendom. He feels called by God to promote the unity if the broken and fragmented body of Christ and thus has actwed as a reconciling agent for the universal church. He is also Catholic in that the altar has become meaningful to his spirituality. Although he is preacher, and a good one, his own inner life is often fed by sacramental as well as pulpit insights.\n:Overall his colleagues see a probing and questioning scholar with an affinity for the richness of the Orthodox tradition. Incarnational theology and the mystery of God before man and man before God have obviously had a profound influence on his thought and life. He is perhaps more at home with the Nicene and Byzantine fathers than Augustine, perhaps more compatible with Chrysostom than Calvin. Howard's theological mood always leaves room for mystery and reverence. There is a possibility factor in his thinking that always leaves room for new truth. Slow to change a considered opinion, he is nonetheless open to new ideas, particularly when they reflect a matured spirituality on the part of those proffering them.\nErvin was honored with a Festschrift.\nDeath\nErvin died on August 12, 2009, in Tulsa, Oklahoma, at aged 93.\nBibliography\n* \"Is There Any Sick Among You,\" View, No.1 (1964): 13–14.\n* \"For Such a Time as This,\" Outreach (Winter 1965): 24–26.\n* \"Now Concerning Spiritual Gifts,\" View, No.2 (1965): 18–19.\n* \"View and Review,\" View, No.1 (1966): 20.\n* \"Steps to the Upper Room - Part I,\" Full Gospel Business Men's Voice 14 (November 1966): 20-2l.\n* \"Steps to the Upper Room - Part II,\" Full Gospel Business Men's Voice 15 (March 1967): 25.\n* \"Review of J. H. E. Hull, The Holy Spirit in the Acts of the Apostles\"; CT 12 (June 21, 1968): 35, 36.\n* These Are Not Drunken as Ye Suppose (Plainfield, NJ: Logos\\International, 1968).\n* And Forbid Not to Speak with Tongues, (Pamphlet), 1969\n* \"As the Spirit Gives Utterance,\" CT 13 (April 11, 1969): 7, 8, 10.\n* \"Let All Things Be Done Unto Edifying (1 Cor 14:26),\" The Empire State Beacon: The Official Organ of the New York District of the Assemblies of God 18 (March 1971): 1; and 18 (April 1971): l.\n* Forbid Not to Speak with Tongues, revised edition (Plainfield, NJ: Logos International, 1971).\n* ''The Layman's Commentary on the Holy Spirit, edited by John Rea and contributing co-editors R. Corvin, H. Ervin, D. du Plessis, J. Orsini, E. Prange and J. R. Williams (Plainfield, NJ: Logos International, 1972).\n* This Which Ye See and Hear (Plainfield, NJ: Logos International, 1972).\n* \"Scripture and the Current World View,\" New Covenant 5 (August 1975): 13–14.\n* \"Healing in the Kingdom of God,\" The Golden News (Summer 1978): 5.\n* \"Scripture Search-Shalom,\" Logos Journal (September / October 1978): 72.\n* \"Scripture Search-Shelamin,\" Logos Journal (January/ February 1979): 72.\n* \"Scripture Search-Exodus,\" Logos Journal (May / June 1979) 72.\n* \"Scripture Search-The First, Eighth Day,\" Logos Journal (September/October 1979): 44.\n* Conversion-Initiation and the Baptism in the Holy Spirit, (Hendrickson Pub.) 1985,\n* Spirit Baptism: A Biblical Investigation, (Hendrickson Pub.) 1995,\n* Healing: Sign of the Kingdom'', (Peabody, MA: Hendrickson Publishers) 2003,\n\"A number of Dr. Ervin's teaching addresses are preserved on reel tapes which are on file in The Holy Spirit Research Center at Oral Roberts University. These include titles such as \"The Patriarchal Age\" (1966), \"The Nature and Significance of Higher Criticism\" (1967), \"The Holy Spirit in Relation to Unregenerate Mankind\" (1968), \"The Image of God\" (1969), and \"The Fruits and Gifts of the Holy Spirit\" (1970). Also catalogued in the Holy Spirit Research Center are three cassette teaching albums, issued under the auspices of Ervin Publications, Tulsa, Oklahoma: Crucifixion and Life (1977), Blessed Are They . . . (1978), and The Kingdom Series (1979). As far as publications forthcoming are concerned we would like to mention the following. Dr. Ervin's participation in the Roman Catholic -Pentecostal Dialogue in Venice in October, 1980, included the reading of the paper \"The Ties that Divide.\" This is to be included in the publication of papers from the present five-year cycle of the Dialogue. Two book manuscripts are in process at this time, tentatively entitled An Exposition of First Corinthians 12:1-11 and A Critique of J. D. G. Dunn's Theology of the Holy Spirit. Some of the main points from this latter work will be discussed in \"Observations on J. D. G. Dunn's Model of Baptism in the Spirit,\" Faces of Renewal: Studies in Honor of Stanley M. Horton presented on his 70th Birthday, edited by Paul Elbert.\"\nReferences"
    }
  ]
}