{
  "content": [
    {
      "type": "text",
      "text": "# Howard P. Vincent\n\nHoward Paton Vincent (1904–1985) was an American scholar of American literature who taught at Kent State University from 1961 until his retirement in 1975. He is best known for his scholarship on Herman Melville and activity in the Melville revival of the 1940s and 1950s. He was also an authority on Honoré Daumier.\nIn 1975, colleagues published a festschrift, Artful Thunder: Versions of the Romantic Tradition in American Literature in Honor of Howard P. Vincent  In it, Harvard University professor Henry A. Murray wrote that \"without your plenitude of heart and intellect, sparkling, bubbling, and overflowing generously and delectably for more than three decades, the Melvillians of our land would be less plentiful than they patently are today, less zealous, less knowledgeable, and less prolific.\" His 1949 study, The Trying-Out of Moby Dick was called \"the most useful of the critical studies\" of the post-war years.\nVincent was three-time Fulbright lecturer in Europe, and served as director of library services for the United States Information Service in France.\nLife and education\nHoward P. Vincent was born in Galesburg, Illinois on October 4, 1904. He earned a bachelor of arts degree from Oberlin College, followed by a master of arts and a doctoral degree from Harvard University. Vincent taught English at West Virginia University. He taught at Hillsdale College, where he was chair of the English Department (1935-1942), and received an honorary doctorate there in 1958. In 1946 he joined Illinois Institute of Technology, where eventually also became chair, and moved to Kent State University in 1961, where he taught for fourteen years. He was awarded the rank of University Professor in 1968 and received the President's Medal for extraordinary service to the university.\nScholarly contributions\nMelville scholarship\nFollowing World War II, Vincent was asked by Hendricks House, an independent publisher, to become general editor of  The Complete Works of Herman Melville, whose volumes were to have substantial introductions and extensive annotations. The  first volume was Vincent's edition of Melville's poems, published in 1947. Vincent and Luther Mansfield edited the Moby-Dick volume, whose notes and introduction he later adapted for use in the Northwestern-Newberry edition of Melville's works. While a number of volumes followed, the series was never finished.\nThe Blackwell Companion to Melville Studies called The Trying-Out of Moby Dick (1949) \"the most useful of the critical studies\" of the post-war years. It was a \"thorough investigation of Melville's whaling references\" that was as \"engaging as it is informative\" as Vincent \"conjoined his scrutiny of whaling sources with an account of the novel's composition....\"  Willard Thorpe's review said the work was a \"fascinating guided tour\" and \"source-hunting at its best, for the quarry is nothing less than half the humor, sublimity, poetry, and metaphysics of Moby-Dick.\" Henry Murray said Vincent's book was not \"a mausoleum of academic diligence,\" but a \"banquet for gourmets as well as gourmands, a veritable cornucopia of Melville lore,\" in short, a \"well-written, firmly-founded, and henceforth indispensable addition to our knowledge of great literature in the making.\"\nEarly biographers of Melville accepted White-Jacket, his 1850 description of life at sea, as reliably autobiographical, but a series of studies showed that much in the book was taken from  almost forgotten sea books. Vincent's The Tailoring of White Jacket, says reviewer William Braswell, reexamines the sources already discovered, adds findings of his own, and goes on to analyze the book at length, showing how Melville transformed what he appropriated. Of particular interest, says Braswell, is the discussion of artistic strategies in White Jacket that led to triumph in Moby-Dick and themes such as the ship as microcosm.\nFurther works\nWith fellow Melville scholar Harrison Hayford he edited a freshman English anthology, Reader and Writer,  which became one of the bestselling English composition texts of its time. The two editors selected essays, short fiction, and poems ranging from the early English poet Bernard Mosher to contemporary writers.\nVincent's Daumier and His World (1968), the first English-language biography of the French artist Honoré Daumier, set out to \"show the development of Daumier as a man and as an artist.\" Kenneth Marantz of the University of Chicago wrote that Vincent fulfilled that promise, though noting its \"hero worship\". Vincent's writing reflected his \"knowledge of letters, money accounts, contemporary commentaries, and a firm grasp of the French political history of the nineteenth century.\"\nSelected works\n* Keller, \"A Checklist of the Writings of Howard P. Vincent,\" in Demott and Marovitz, Artful Thunder (1975), pp.&nbsp;303– 308.\n* [https://archive.org/search.php?query=creator%3A%22Vincent%2C+Howard+P.+%28Howard+Paton%29%2C+1904-1985%22  Works on Internet Archive ]\nBooks\n* -- The Trying Out of Moby-Dick (Boston: Houghton Mifflin, 1949; reprinted Carbondale, IL: Southern Illinois University Press, 1965) [https://archive.org/details/tryingoutofmobyd0000vinc_b4g5 Internet Archive].\n* ''[https://archive.org/details/tailoringofmelvi0000vinc/page/n7/mode/2up  The Tailoring of Melville's White-Jacket] {Evanston: Northwestern University Press, 1970)\n* [https://archive.org/details/twentiethcentury0000unse_q3v6 Twentieth Century Interpretations of Billy Budd: A Collection of Critical Essays]\n*  Daumier and His World (Evanston, IL: Northwestern University Press, 1968. doi 9780810100190. Internet Archive free online [https://archive.org/details/bwb_w7-crz-548 HERE]\nEdited volumes\n* with Harrison Hayford, Reader and Writer (Boston: Houghton Mifflin, 1952; 2nd Ed. 1954, etc) Internet Archive free online [https://archive.org/details/readerwriter0000harr HERE]\nEdited texts\n* Melville Herman.  Luther Stearns Mansfield, and Howard P Vincent, editors. Moby-Dick: Or the Whale''. (New York N.Y: Hendricks House, 1952). Edited, with notes and Introduction.\nReferences and further reading\n*\n*  Online at Internet Archive [https://archive.org/details/artfulthunderver00tate HERE].\n*\nNotes\nExternal links\n*\n* [http://rave.ohiolink.edu/archives/ead/OhKeUSC0090 Finding aid]\n*"
    }
  ]
}