{
  "content": [
    {
      "type": "text",
      "text": "# Howard Engle\n\nHoward Aaron Engle (September 11, 1919 &ndash; July 22, 2009) was an American pediatrician and lifelong smoker who was one of the plaintiffs in a class action lawsuit filed against the tobacco industry, in which Engle claimed that he smoked multiple packs of cigarettes daily since he was in college and was unable to quit despite multiple attempts even after contracting emphysema, continuing to smoke until his death.\nEarly life and education\nEngle was born on September 11, 1919, in the Milwaukee suburb of Pewaukee, Wisconsin, where his parents ran a farm, and he was part of the area's only Jewish family. He earned his undergraduate degree at the University of Wisconsin–Madison and received his medical training at the University of Wisconsin School of Medicine and Public Health. He served in a public health role in Allied-occupied Germany while serving in the United States Army in the aftermath of World War II.\nHe moved to Miami Beach, Florida after completing his military service and established a medical practice specializing in pediatric neurology. Using his own experiences as a cautionary tale, he would emphasize the risks of smoking to his patients. Engle opened an office in the Liberty City neighborhood of Miami and ran an integrated office in the pre-Civil Rights Movement era. In the 1960s, he was chief of pediatrics at Mount Sinai Medical Center in Miami Beach.\nSmoking class action suit\nA class action suit claiming that the members of the class had been injured by their cigarette usage was filed in May 1994, representing an estimated 100,000 smokers who were said to have been turned into nicotine addicts by a tobacco industry that did not warn them of the risks of the habit. The class was certified in October 1994 in Dade County Circuit Court in Miami, Florida,\nand an appeals court decided in January 1996 that the class action could go forward, though only Florida smokers could be included. The case was filed by the husband-and-wife legal team of Stanley and Susan Rosenblatt on behalf of seven Florida smokers, with Engle as lead plaintiff, and went to trial in 1998. The Rosenblatts had earlier won a settlement of $300 million on behalf of a group of 60,000 flight attendants who alleged that they had been injured by secondhand smoke and their approach in the Engle case was a focus on how cigarette makers used \"diversionary tactics to keep alive a nonexistent scientific controversy about smoking and health\". Engle had been the physician for eight of the Rosenblatt's nine children and they had discussed the flight attendant's case. The Rosenblatts wanted a physician to be part of the class action suit and Engle volunteered to participate in the hope that people would be warned against becoming addicted to smoking.\nA jury verdict in July 2000 granted the plaintiffs $145 billion, though a Florida Circuit Court judge ruled in May 2001 that the tobacco companies could post a bond of $2 billion while the case was appealed, of which $709 million was guaranteed to the plaintiffs regardless of the outcome of the appeal process. The punitive damage award was the second largest by a jury in U.S. history.\nThe Florida Third District Court of Appeal overturned the verdict in May 2003, citing the fact that the group was too disparate to have been certified as a class as its members had started and continued to smoke for disparate reasons, that the punitive damage award was excessive and that the plaintiff's attorneys had used arguments that were \"racially charged\" — likening the actions of the tobacco industry to slavery and genocide — to prejudice the six-member jury, four of whom were African American. The Florida Supreme Court decertified the group but allowed each of the class's members, known as the \"Engle progeny\", to file lawsuits of their own on an individual basis. Engle received an undisclosed settlement in the hundreds of thousands of dollars from the $700 million fund posted by the cigarette manufacturers during the appeals process.\nPersonal\nEngle had started smoking while in college and continued until shortly before his death while he was in hospice care.\nA resident of Miami Beach, Florida, he died there at age 89 on July 22, 2009, due to chronic obstructive pulmonary disease and lymphoma. He was survived by his wife and a son, as well as a stepdaughter and stepson.\nSee also\n*Tobacco Institute\n*Tobacco Master Settlement Agreement\nReferences"
    }
  ]
}