{
  "content": [
    {
      "type": "text",
      "text": "# Howard Jenkins Jr.\n\n| birth_place         = Denver, Colorado, U.S.\n| death_date          =\n| alma_mater          = University of DenverUniversity of Colorado Boulder\n| spouse              =\n| children            = 3\n| president           = John F. Kennedy\n| term_start          = August 28, 1963\n| term_end            = August 27, 1983\n| image               = 2019-hall-of-honor-jenkins.png\n| party               = Republican\n}}\nHoward Jenkins Jr. (June 16, 1915 – June 3, 2003) was an American lawyer, professor of law, and civil servant. Appointed by President John F. Kennedy, he  was the first African American to serve on the National Labor Relations Board where he served for 20 years under six presidents. Following the passage of the Landrum-Griffin Act, Jenkins served as the Assistant Commissioner of the Bureau of Labor Management Reports where he was the highest-ranking African American lawyer working in the federal government.\nEarly life and education\nHoward Jenkins Jr. was born in Denver, Colorado, the third child of Howard and Nellie Poage Jenkins. Both of his parents were from Missouri. His father was a mail carrier and graduate of Lincoln University in Missouri. His mother graduated from college in Illinois.\nWhen Jenkins started at the University of Denver in 1932 he was the only male African American in the freshman class. He spent his sophomore year at the University of Colorado in Boulder. He graduated from the University of Denver in 1936 and from the University's College of Law in 1941. Although he was not the first African American to practice law in Colorado, he was the first African American to pass the Colorado Bar Examination.\nCareer in law\nHoward Jenkins became interested in law when he accompanied his best friend to watch his friend's father, Sam Cary, try court cases. Sam Cary was one of the first African American lawyers in Denver. Jenkins practiced law in Denver until 1946, first in private practice, then in the Denver Office of Price Administration with Edward E. Pringle and Max Melville, then at the Denver War Production Board with James C. Flanigan and Edward Scheunemann. In 1943 Jenkins was appointed Regional Attorney for the National War Labor Board, and in 1945 its Chief Regional Enforcement Officer.\nHoward University\nGeorge Johnson, the dean of Howard University Law School, asked Jenkins to join the faculty. Jenkins taught labor law and administrative law at the law school and medical jurisprudence to medical students, from 1946 until 1956.\nCareer in government service\nJenkins then went to work in Washington, D.C. for William Willard Wirtz on the National Wage Stabilization Board, and joined the faculty at Howard University School of Law. As a law professor he helped prepare briefs for the U.S. Supreme Court to desegregate the railroads and the public schools, including the landmark case of Brown v. Board of Education. In 1956, Jenkins became the special assistant to the Solicitor of Labor. While special assistant, he was intimately involved in drafting and passing the Landrum-Griffin Labor Reform Act, known as the ''Employees' Bill of Rights.\nIn 1959, Jenkins was named Director of the Office of Regulations at the Bureau of Labor-Management Reports. In 1962, he was named Assistant Commissioner of the Bureau and became the highest-ranking African American attorney in the federal government. In 1963, Jenkins became the first African American to be appointed to the U.S. National Labor Relations Board (NLRB) when nominated by President John F. Kennedy. Jenkins was reappointed by three subsequent presidents and served on the NLRB for 20 years.\nJenkins was a Republican who was known to be supportive of labor unions.\nImpact\nHoward Jenkins Jr. had a substantial impact on labor law during his years of service. His mission was to help them discover blacks in the industrial work force, and to get it firmly fixed in our national labor policy that discrimination on the basis of race or sex is an unfair labor practice.'' He wrote the majority opinion in the 1964 watershed case Hughes Tool Co. II, which created unions' duty of fair representation. He also wrote a dissent, affirmed by the courts, holding that it was illegal sex discrimination for unions to have a waiters' union and a separate waitresses' union.\nPersonal life\nJenkins met Alice Elaine Brown in 1935, the daughter of a prominent African American minister, when she was a freshman. After she graduated from the University of Denver in 1937 she became the first African American teacher in the Denver Public School system. In 1940 the couple married.\nDeath\nHoward Jenkins Jr. died on June 3, 2003 and was survived by one of his sons.\nReferences"
    }
  ]
}