{
  "content": [
    {
      "type": "text",
      "text": "# Howard Hibbett\n\nHoward Hibbett (July 27, 1920 – March 13, 2019) was a translator and professor of Japanese literature at Harvard University. He held the Victor S. Thomas Professorship in Japanese Literature.\nEarly life\nHibbett was born in Akron, Ohio, on July 27, 1920.  He began his studies of Japanese language and literature as a sophomore at Harvard College in 1942 before working as a language specialist for the U.S. Army in 1942-46. After graduating from Harvard College in 1947, he went on to receive his Ph.D., also from Harvard, in 1950. He taught at UCLA before returning to Harvard as a professor in 1958. He was  Director of the Edwin O. Reischauer Institute of Japanese Studies from 1985 through 1988.\nSeven Japanese Tales, published in 1963, helped introduce the English-speaking world to Jun'ichirō Tanizaki and Japanese literature.\nHis publications include studies and translations of Edo literature and modern Japanese literature. He is particularly known for his translations of Tanizaki and works on Japanese language teaching. On March 16, 2018, he was awarded the Lindsley and Masao Miyoshi Translation Prize \"for lifetime achievement as a translator of Edo period and modern Japanese literature\" by the Donald Keene Center of Japanese Culture at Columbia University, New York. He died in March 2019 at the age of 98.\nSelected works\nIn a statistical overview derived from writings by and about Howard Hibbett, OCLC/WorldCat encompasses roughly 90+ works in 200+ publications in 5 languages and 4,000+ library holdings.\n* The Floating World in Japanese Fiction, Oxford University Press, New York 1959\n* Modern Japanese; a Basic Reader, Harvard University Press, Cambridge (Mass.) 1965\n* Contemporary Japanese Literature: an Anthology of Fiction, Film, and Other Writing since 1945, Alfred A. Knopf, New York 1977\n* The Chrysanthemum and the Fish: Japanese Humor Since the Age of the Shoguns, Kodansha International, Tōkyō New York 2002\n* [http://highmoonoon.com/books-1/episodic-festschrift-for-howard-hibbet-episodes-1-26 Episodic Festschrift for Howard Hibbett (Episodes 1-26)], highmoonoon, Los Angeles 2000-2010.\nTranslations\n* The Key by Jun'ichirō Tanizaki, Alfred A. Knopf, New York 1961\n* Seven Japanese Tales by Jun'ichirō Tanizaki, Alfred A. Knopf, New York 1963\n* Diary of a Mad Old Man by Jun'ichirō Tanizaki, Alfred A. Knopf, New York 1965 [https://www.nytimes.com/books/98/10/25/specials/mishima-grace.html Review]\n* Harp of Burma by Michio Takeyama, Charles E. Tuttle Co., Rutland (Vt.) 1966\n* Beauty and sadness by Yasunari Kawabata, Alfred A. Knopf, New York 1975\n* Quicksand by Jun'ichirō Tanizaki, Alfred A. Knopf, New York 1994 [https://www.nytimes.com/1994/02/13/books/fatal-attractions.html?pagewanted=all Review]\n* A portrait of Shunkin by Jun'ichirō Tanizaki, Limited Editions Club, New York 2000\nNotes\nReferences\n*http://www.fas.harvard.edu/~rijs/people/faculty/h_hibbett.html\n*http://www.thecrimson.com/article.aspx?ref=271454\n*http://www.thecrimson.com/article.aspx?ref=476034\n*http://www.thecrimson.com/article.aspx?ref=156189"
    }
  ]
}