{
  "content": [
    {
      "type": "text",
      "text": "# Howard Bachrach\n\n| birth_place = Faribault, Minnesota\n| death_date  =\n| death_place = Atlantis, Florida\n| death_cause =\n| resting_place =\n| resting_place_coordinates =\n| other_names =\n| residence   =\n| citizenship =\n| nationality =\n| fields      = Virology\n| workplaces  = United States Department of Agriculture\n| patrons     =\n| education   =\n| alma_mater  = University of Minnesota\n| thesis_title =\n| thesis_url  =\n| thesis_year =\n| doctoral_advisor =\n| academic_advisors =\n| doctoral_students =\n| notable_students =\n| known_for   = First vaccine created through genetic engineering\n| influences  =\n| influenced  =\n| awards      = National Medal of Science\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| website     =\n| footnotes   =\n}}\nHoward Lloyd Bachrach (May 21, 1920 – June 26, 2008) was an American scientist who made research contributions to the understanding of viruses such as foot-and-mouth disease and polio. Bachrach's work led to the first vaccination developed through genetic engineering techniques. He worked for the United States Department of Agriculture and was chief scientist at the Plum Island Animal Disease Center. Bachrach was a recipient of the National Medal of Science and was a member of the National Academy of Sciences.\nEarly life\nBorn in Faribault, Minnesota to a Jewish family, Bachrach had two brothers. His family owned a men's clothing store that remained in Faribault until 2006. Bachrach graduated from Faribault High School in 1938. He attended the University of Minnesota, where he completed a chemistry degree. During World War II, Bachrach was affiliated with the Carnegie Institute of Technology in Pittsburgh, where he studied chemical explosives as part of the Manhattan Project.\nBachrach later researched measures to prevent bread from becoming stale, then returned to Minnesota and studied classical swine fever (also known as hog cholera). Bachrach found that the disease could be transmitted by a protein produced by the virus, even in the absence of the virus itself. After Bachrach earned a Ph.D. in biochemistry, the United States Department of Agriculture sent him to Europe to study foot-and-mouth disease. The disease, previously thought to be under control, had reemerged in Mexico and the U.S. government felt that it posed a significant threat to U.S. cattle. Bachrach was able to purify the virus responsible for foot-and-mouth disease.\nCareer\nBerkeley\nIn 1950, having spent a year in Europe, Bachrach secured a position in the laboratory of Wendell Meredith Stanley at the University of California, Berkeley. Working with biochemist Carleton Schwerdt, and using the principles he learned from foot-and-mouth disease, Bachrach purified laboratory samples of type II (Lansing type) poliovirus. Bachrach was able to produce lab specimens which contained 10% virus. The other 90% of the specimen was \"gunk\" from the cells involved in the process of growing the virus, but no previous researcher had been able to produce a sample purified beyond one percent. The purification techniques of Bachrach and Schwerdt made it feasible to develop and test polio vaccines.\nAgricultural Research Service\nBeginning in 1953, Bachrach was associated with the Agricultural Research Service (ARS) at the Plum Island Animal Disease Center. He was named chief scientist at the center in 1961. At Plum Island, Bachrach and associates spliced a foot-and-mouth disease protein, VP3, into a bacterium. In turn, the bacterium produced a large amount of VP3, and the Bachrach team felt that this could lead to a vaccine against the disease. In 1979, the Recombinant DNA Advisory Committee issued a recommendation to the National Institutes of Health that the team be allowed to work with Genentech on the production of a foot-and-mouth disease vaccine that would not contain the actual virus.\nThe development of the foot-and-mouth disease vaccine, which was only effective against a single strain of the illness, taught scientists that immunological principles might not hold true from one subtype of the disease to the next. This vaccine was the first one developed using genetic engineering.\nLater life\nBachrach retired in 1981. In 1982, he was elected to membership in the National Academy of Sciences and he received the Kenneth A. Spencer Award from the American Chemical Society. He received the National Medal of Science the next year. He died of heart disease in 2008 at JFK Medical Center in Atlantis, Florida. When he died, he had been married to the former Shirley Lichterman for 65 years. They had two children and one grandchild.\nSee also\n*List of National Medal of Science laureates\nReferences\nExternal links\n* [http://www.nasonline.org/publications/biographical-memoirs/memoir-pdfs/bachrach_howard.pdf George F. Vande Woude, \"Howard L. Bachrach\", Biographical Memoirs of the National Academy of Sciences (2015)]"
    }
  ]
}