{
  "content": [
    {
      "type": "text",
      "text": "# Howard Pearce\n\n| birth_place = Twickenham, United Kingdom\n| death_date =\n| death_place =\n| spouse = Caroline Thomée\n| website = [http://www.falklands.gov.fk//Government.html Official website]\n}}\nHoward John Stredder Pearce, CVO (born 13 April 1949, in Twickenham) is an English diplomat who served as the Governor of the Falkland Islands and Civil Commissioner of South Georgia and the South Sandwich Islands (SGSSI) until July 2006. He assumed both positions on 3 December 2002. Before his appointment, Pearce was High Commissioner to Malta from 1999 to 2002. He joined the Foreign and Commonwealth Office (FCO) in 1972.\nPearce attended the City of London School. He married Caroline Thomée, a Dutch architect and photographer in October 2004. He is the first Governor to marry in the Falkland Islands; on the day of the wedding, local schoolchildren were given the day off. A bell was also rung at a church in Grytviken on South Georgia.\nAt the end of July 2006, Pearce left the Falklands and was succeeded as Falkland Islands Governor and Commissioner for SGSSI by Alan Huckle, previously governor of Anguilla, another British overseas territory in the Caribbean. Upon leaving the Falklands, he semi-retired and moved to Dundee, Scotland.\nExternal links and sources\n* [http://www.sartma.com/artd_1176_10_2004_9.html SARTMA: Breezy Wedding for Falklands Governor]\n* [http://www.sgisland.org/pages/main/news15.htm South Georgia Newsletter, October 2004]\n*[https://web.archive.org/web/20050228191947/http://www.falklands.gov.fk/media/governor-to-wed.htm First Governor to wed in the Falkland Islands]\n*[http://www.fco.gov.uk/servlet/Front?pagename=OpenMarket/Xcelerate/ShowPage&c=Page&cid=1007029391638&a=KArticle&aid=1122471297789 FCO: Change of Governor of the Falkland Islands and Commissioner for South Georgia and the South Sandwich Islands]\n*[https://www.cia.gov/the-world-factbook/countries/falkland-islands-islas-malvinas/ The World Factbook – Falkland Islands (Islas Malvinas)]"
    }
  ]
}