{
  "content": [
    {
      "type": "text",
      "text": "# Howard F. Sachs\n\n| birth_place   = Kansas City, Missouri, U.S.\n| death_date    =\n| death_place   =\n| death_cause   =\n| resting_place =\n| resting_place_coordinates =\n| citizenship   =\n| nationality   =\n| party         =\n| otherparty    =\n| height        =\n| spouse        =\n| partner       =\n| relations     =\n| children      =\n| parents       =\n| mother        =\n| father        =\n| relatives     =\n| residence     =\n| education     = Williams College (AB)Harvard Law School (JD)\n| alma_mater    =\n| occupation    =\n| profession    =\n| known_for     =\n| salary        =\n| net_worth     =\n| cabinet       =\n| committees    =\n| portfolio     =\n| religion      =\n| awards        =\n| signature     =\n| signature_alt =\n| website       =\n| footnotes     =\n}}\nHoward Frederic Sachs (born September 13, 1925) is a senior United States district judge of the United States District Court for the Western District of Missouri. He also is a former federal judicial nominee to the United States Court of Appeals for the Eighth Circuit.\nEducation and career\nBorn in Kansas City, Missouri, Sachs earned an Artium Baccalaureus degree from Williams College in 1947 and a Juris Doctor from Harvard Law School in 1950. Sachs worked as a United States Navy Electrical Technician's Mate from 1944 until 1946 and as a law clerk for Judge Albert Alphonso Ridge of the United States District Court for the Western District of Missouri from 1950 until 1951. Sachs then entered private legal practice in Kansas City, where he worked as a lawyer from 1951 until 1979.\nFederal judicial service\nSachs was nominated by President Jimmy Carter on May 17, 1979, to the United States District Court for the Western District of Missouri, to a new seat authorized by 92 Stat. 1629. He was confirmed by the United States Senate on September 25, 1979, and received his commission on September 26, 1979. He served as Chief Judge from 1990 to 1992. He assumed senior status on October 31, 1992. On August 27, 2019, Sachs blocked Missouri's abortion restriction that would ban abortion after eight weeks of pregnancy.\nUnsuccessful Eighth Circuit nomination\nOn July 29, 1980, Carter nominated Sachs to be a judge on the United States Court of Appeals for the Eighth Circuit to fill a seat vacated when Judge Floyd Robert Gibson assumed senior status. Given that the nomination occurred after the unofficial Thurmond Rule governing judicial nominations during presidential election years, however, the Senate never took up Sachs' nomination. President Ronald Reagan initially brought forth the name of Hallmark Cards associate general counsel Judith Whittaker as a nominee to replace Gibson. After it emerged that Whittaker had supported the Equal Rights Amendment, however, conservatives opposing her nomination launched a letter-writing campaign objecting to her nomination and Whittaker eventually withdrew her name from consideration. Reagan ultimately wound up nominating United States District Judge John R. Gibson to the seat in February 1982. Gibson was confirmed on March 4, 1982.\nSee also\n* Jimmy Carter judicial appointment controversies\n* List of United States federal judges by longevity of service\nReferences\nBibliography\n*\n|years=1979–1992}}\n|years=1990–1992}}"
    }
  ]
}