{
  "content": [
    {
      "type": "text",
      "text": "# Howard Tate (album)\n\nHoward Tate is an album by the American musician Howard Tate, released in 1972. The first single was \"Keep Cool (Don't Be a Fool)\". The album was a commercial failure, due to the mediocrity of some of the songs, as well as Jerry Wexler's departure from Atlantic Records.\nIt was Tate's last album until 2003; his close friends and associates were often unsure of his whereabouts during the intervening decades.\nProduction\nThe album was produced by Jerry Ragovoy, who also wrote or cowrote the majority of the songs. The producer later regretted the song selection, conceding that some were too pop. \"Jemima Surrender\" is a cover of the song by the Band.\nCritical reception\n|rev2 = The Buffalo Evening News\n|rev2score = C+\n|rev3 = Robert Christgau\n|rev3score = A−\n|rev4 = The Encyclopedia of Popular Music\n|rev4score =\n}}\nRobert Christgau praised \"Tate's amazing vocal and emotional range—as cocksure as Wilson Pickett one moment, as sweet and hurting as B.B. King the next, and as corny as Joe Tex to top it off.\" The Buffalo Evening News noted \"Tate's mellow elastic voice and some neatly turned tunes.\" The Courier News opined that \"the soulful Ragovoy pieces are made to order for the warm, understanding feeling that Tate unleashes.\" The Boston Globe considered Howard Tate to be one of the best R&B albums of 1972.\nAllMusic wrote that \"the arrangements are staid period soul, and while the musicians back Tate with confidence and energy, it's difficult for them to open up within such constrained charts.\" In 2018, The Independent listed \"Girl of the North Country\" as the sixth best Bob Dylan cover song, writing that, \"given the full Atlantic Records treatment with booming horns and Tate's soaring voice, it shouldn't really work but the resulting celebratory air is a perfect counterpoint to the sombre and regretful mood of the original.\"\nTrack listing\nReferences"
    }
  ]
}