{
  "content": [
    {
      "type": "text",
      "text": "# Howard Darwin\n\nHoward Joseph Darwin (September 10, 1931 &ndash; October 22, 2009) was a Canadian businessman and sports team owner. Among his businesses, he owned the Ottawa 67's, London Knights and Ottawa Lynx sports franchises.\nPersonal life\nHe was born and grew up in Ottawa. He was one of five children growing up on Nicholas Street. His mother died of cancer when he was six. Howard and his little brother, Rupert, ended up raising themselves somewhat. Their father was a security guard on shift work who was rarely home. Their older sister worked as a live-in maid. And Howard's older brothers, Jack and Percy, left to join in World War II. Jack died in battle just months before the war ended. By then, Howard was already selling newspapers on Ottawa streets and delivering newspapers to Ottawa military bases. In 1954, Darwin married Connie Goudie. They raised four children together: Kim, Nancy, Jack and Jeff. Darwin died at the Ottawa Civic Hospital at the age of 78 from complications following heart surgery.\nBusiness career\nDarwin dropped out of high school at age fourteen and sold newspapers for a number of years. He then apprenticed as a jeweller and opened a watch repair shop on Nicholas Street. In 1955, he moved his store to Wellington Avenue, west of Holland Avenue, where it operated until 1991. In the 1960s, besides being involved in sports promotion, he started investing in real estate. He and Gordon Henderson established Ottawa Cablevision in 1965 (purchased by Maclean-Hunter in 1989, which after was purchased by Rogers Cable in 1994), the first cable television provider in Ottawa.\nSports career\nAs a youth, Darwin boxed as an amateur. He started refereeing fights and started promoting boxing in the capital. He branched out into promoting wrestling and closed-circuit TV boxing. The closed-circuit TV business led him into the early years of cable television in Ottawa.\nIn 1967, with four partners, Darwin purchased the franchise for the Ottawa 67s hockey team. The club was part of the impetus to build the Ottawa Civic Centre. Darwin managed the team and hired Brian Kilrea in 1974. In 1984, the 67's won the Memorial Cup junior championship. He sold his share of the 67's in 1998 to the current owner Jeff Hunt for $2.5 million.\nHe bought the London Nationals in 1968, renaming them to the London Knights, also buying the London Gardens arena at the same time. He sold his share of the London Knights in 1987 to local businessmen.\nIn 1993, Darwin brought a triple-A baseball team, the Ottawa Lynx, to Ottawa after having lobbied for the construction of the Lynx Stadium. The club won the International League championship in 1995. Darwin sold the club in 2000 for $7 million to Ray Pecor. He had purchased it in 1993 for $5 million. The team eventually moved to Allentown, Pennsylvania in 2008.\nThe Merivale Centennial Arena in Ottawa was renamed the Howard Darwin Centennial Arena three years after his death.\nReferences"
    }
  ]
}