{
  "content": [
    {
      "type": "text",
      "text": "# Howard Jacobson\n\n| birth_place = Manchester, England\n| death_date  =\n| death_place =\n| occupation  =\n| period      = 1983–present\n| genre       = Biographical\n| subject     = Jewishness, humour\n| movement    =\n| spouse      =\n| awards      = Man Booker Prize (2010)\n| alma_mater  = Downing College, Cambridge\n| signature   =\n| website     =\n| imagesize   =\n}}\nHoward Eric Jacobson (born 25 August 1942) is a British novelist and journalist. He writes  comic novels that often revolve around the dilemmas of British Jewish characters. He is a Man Booker Prize winner.\nEarly life\nJacobson was born in Manchester to parents of Russian-Jewish heritage (his father's parents came from Kamianets-Podilskyi in what is now Ukraine, and his mother's family from Lithuania). He has a brother. He was brought up in Prestwich, and educated at Stand Grammar School in Whitefield, Greater Manchester before going on to study English at Downing College, Cambridge, under F. R. Leavis. He graduated with a 2:2.\nHe lectured for three years at the University of Sydney before returning to Britain to teach at Selwyn College, Cambridge. He also taught at Wolverhampton Polytechnic from 1974 to 1980.\nCareer\nWriting\nJacobson's time at Wolverhampton was to form the basis of his first novel, Coming from Behind, a campus comedy about a failing polytechnic that plans to merge facilities with a local football club. The episode of teaching in a football stadium in the novel is, according to Jacobson in a 1985 BBC interview, the only portion of the novel based on a true incident. He also wrote a travel book in 1987, titled In the Land of Oz, which was researched during his time as a visiting academic in Sydney.\nHis 1999 novel The Mighty Walzer, about a teenage table tennis champion, won the Bollinger Everyman Wodehouse Prize for comic writing. It is set in the Manchester of the 1950s and Jacobson, himself a table tennis fan in his teenage years, admits that there is more than an element of autobiography in it. His 2002 novel ''Who's Sorry Now? – the central character of which is a Jewish luggage baron of South London – and his 2006 novel Kalooki Nights were longlisted for the Man Booker Prize. Jacobson described Kalooki Nights as \"the most Jewish novel that has ever been written by anybody, anywhere\". It won the 2007 JQ Wingate Prize.\nAs well as writing fiction, he also contributes a weekly column for The Independent newspaper as an op-ed writer.\nIn October 2010 Jacobson won the Man Booker Prize for his novel The Finkler Question'', which was the first comic novel to win the prize since Kingsley Amis's The Old Devils in 1986. The book, published by Bloomsbury, explores what it means to be Jewish today and is also about \"love, loss and male friendship\". Andrew Motion, the chair of the judges, said: \"The Finkler Question is a marvellous book: very funny, of course, but also very clever, very sad and very subtle. It is all that it seems to be and much more than it seems to be. A completely worthy winner of this great prize.\" His novel Zoo Time won the Bollinger Everyman Wodehouse Prize (2013), Jacobson's second time winning the prize (the first in 1999 for The Mighty Walzer).\nHe was elected a Fellow of the Royal Society of Literature in 2012.\nIn September 2014, Jacobson's novel J was shortlisted for the 2014 Man Booker Prize.\nBroadcasting\nJacobson has scripted television programmes including Channel 4's Howard Jacobson Takes on the Turner, in 2000, and The South Bank Show in 2002, which featured an edition entitled \"Why the Novel Matters\". An earlier profile went out in the series in 1999 and a television documentary entitled \"My Son the Novelist\" preceded it as part of the Arena series in 1985. His two non-fiction books – Roots Schmoots: Journeys Among Jews (1993) and Seriously Funny: From the Ridiculous to the Sublime (1997) – were turned into television series.\nJacobson presented \"Jesus The Jew\", episode one of Christianity, A History, on the UK's Channel 4 in January 2009 and in 2010 he presented \"Creation\", the first part of the Channel 4 series The Bible: A History.\nOn 3 November 2010, Jacobson appeared in an Intelligence Squared debate (stop bashing Christians, Britain is becoming an anti-Christian country) in favour of the motion.\nIn February 2011 Jacobson appeared on BBC Radio 4's Desert Island Discs. His musical choices included works by J. S. Bach, Wolfgang Amadeus Mozart and Louis Armstrong as well as the rare 1964 single \"Look at Me\" by the Whirlwinds. His favourite was \"You’re a Sweetheart\" by Al Bowlly with Lew Stone and His Band.\nHe wrote and presented the Australian biographical series Brilliant Creatures (2014) on four famous expatriate iconoclasts.\nStyle and themes\nAlthough Jacobson has described himself as \"a Jewish Jane Austen\" (in response to being described as \"the English Philip Roth\"), he also states, \"I'm not by any means conventionally Jewish. I don't go to shul. What I feel is that I have a Jewish mind, I have a Jewish intelligence. I feel linked to previous Jewish minds of the past. I don't know what kind of trouble this gets somebody into, a disputatious mind. What a Jew is has been made by the experience of 5,000 years, that's what shapes the Jewish sense of humour, that's what shaped Jewish pugnacity or tenaciousness.\" He maintains that \"comedy is a very important part of what I do.\"\nJacobson's fiction, particularly in the six novels he has published since 1998, is characterised chiefly by a discursive and humorous style. Recurring subjects in his work include male–female relations and the Jewish experience in Britain in the mid- to late-20th century. He has been compared to prominent Jewish-American novelists such as Philip Roth, in particular for his habit of creating doppelgängers of himself in his fiction.\nPersonal life\nJacobson has been married three times. Engaged at 21 while a student at Cambridge, he married his first wife Barbara in 1964 after graduating, when he was 22. They have a son, Conrad Jacobson, born in December 1968. During his time at Cambridge, Barbara attended some of Leavis' seminars with Jacobson. Before leaving Cambridge they attended a party where among the guests were the playwright Simon Gray, and Germaine Greer, whose job Jacobson was filling in Sydney.\nIn late 1964 Howard and Barbara emigrated to Australia, taking a six-week voyage on P&O's SS Oriana. On arrival, Jacobson took up a lectureship at Sydney University. They returned to Manchester in 1967, living there briefly before moving to London, where Conrad was born. This was followed by Howard teaching at Selwyn College, Cambridge, and running the family business on Cambridge Market selling handbags and leather goods. Jacobson returned to Australia when Conrad was 3 years old. He remained without a teaching post. Jacobson eventually returned to the UK after several years. Barbara divorced him in his absence. They share a granddaughter Ziva, born in 2008.\nHe married his second wife, Rosalin Sadler, in 1978; they divorced in 2004. In 2005, Jacobson was married for the third time, to radio and TV documentary maker Jenny De Yong. He stated, \"My last wife. I'm home, it's right\".\nPolitical views and opinions\nIn August 2014, Jacobson was one of 200 public figures who signed a letter to The Guardian urging Scots to vote against independence in the run-up to the Scottish independence referendum.\nIsrael\nIn recent times, Jacobson has, on several occasions, attacked anti-Israel boycotts, and for this reason has been labelled a \"liberal Zionist\". He has argued that an education in science and technology is more conducive to terrorism than an education in the arts and social sciences.\nDuring the Gaza war, he spoke out in favour of the Israeli military's campaign in Gaza, and wrote in October 2024 that media coverage of the effects of the war on children in Gaza was a new blood libel. In an interview with Isaac Chotiner of The New Yorker, Jacobson argued that, after 7 October, it wasn’t possible to “measure life for life”. It wasn’t a case of just avenging the deaths in Israel. Instead, he insisted: \"in the attempt to make sure that this never happened again, the numbers were going to inevitably have to be high\".\nAntisemitism in the Labour Party\nIn November 2017, Jacobson joined Simon Sebag Montefiore and Simon Schama in writing a letter to The Times about their concern over antisemitism in the Labour Party under Jeremy Corbyn's leadership, with particular reference to a growth in Anti-Zionism and its \"antisemitic characteristics\". Schama and Sebag Montefiore have both written historical works about Israel, while Jacobson has written regularly about Israel and the UK Jewish community in his newspaper columns. In September 2018, Jacobson argued in favour of the motion \"Jeremy Corbyn is Unfit to be Prime Minister\" in a debate hosted by Intelligence Squared.\nJacobson made a further criticism of the party in July 2019, when he joined other leading Jewish figures in saying, in a letter to The Guardian, that the investigation by the Equality and Human Rights Commission into the party in relation to antisemitism allegations was \"a taint of international and historic shame\" and that trust between the party and most British Jews was \"fractured beyond repair\".\nBibliography\nFiction\n*\n* Peeping Tom, Chatto & Windus, 1984\n* Redback, Bantam, 1986\n* The Very Model of a Man, Viking, 1992\n* No More Mister Nice Guy, Cape, 1998\n* The Mighty Walzer, Cape, 1999\n* ''Who's Sorry Now?, Cape, 2002\n* The Making of Henry, Cape, 2004\n* Kalooki Nights, Cape, 2006\n* The Act of Love, Cape, 2008\n* The Finkler Question, Bloomsbury, 2010 (Winner of the 2010 Man Booker Prize)\n* Zoo Time, Bloomsbury, 2012\n* J, Bloomsbury, 2014 (shortlisted for the 2014 Man Booker Prize)\n* Shylock is My Name, Hogarth, 2016 (inspired by The Merchant of Venice)\n* Pussy, Cape, 2017\n* Live a Little, Cape, 2019\n* What Will Survive of Us, Jonathan Cape, 2024\nNon-fiction\n* ''Shakespeare's Magnanimity: Four Tragic Heroes, Their Friends and Families (co-author with Wilbur Sanders), Chatto & Windus, 1978\n* In the Land of Oz, Hamish Hamilton, 1987\n* Roots Schmoots: Journeys Among Jews, Viking, 1993\n* Seriously Funny: From the Ridiculous to the Sublime, Viking, 1997\n*\n* Whatever It Is, I Don't Like It, Bloomsbury, 2011\n* The Dog's Last Walk: (and Other Pieces), Bloomsbury, 2017\n* Mother's Boy: A Writer's Beginnings, Jonathan Cape, 2022\nReferences\nExternal links\n* [http://www.open.edu/openlearn/history-the-arts/culture/literature-and-creative-writing/creative-writing/howard-jacobson-on-creating-characters Audio: Writing Lab interview with Howard Jacobson] from OpenLearn\n* [https://www.bbc.co.uk/worldservice/specials/1246_the_forum/page29.shtml Audio: Howard Jacobson in conversation] on the BBC World Service discussion show The Forum\n* [https://www.nytimes.com/2017/10/06/opinion/labour-jeremy-corbym-anti-semitism.html \"The Phony Peace Between the Labour Party and Jews\"] from The New York Times''.\n*"
    }
  ]
}