{
  "content": [
    {
      "type": "text",
      "text": "# Howard Garfinkel\n\n| birth_place   = New York City, U.S.\n| death_date    =\n| death_place   = New York City, U.S.\n| other_names   =\n| occupation    = Basketball scout\n| years_active  =\n| known_for     = Five-Star Basketball Camp\n| notable_works =\n}}\nHoward Morris Garfinkel (August 1, 1929 – May 7, 2016) was an American high school basketball scout who ran the well-known Five-Star Basketball Camp from 1966 to 2008.\nCareer\nGarfinkel played high school basketball at Barnard High School in The Bronx. In 1965, he started High School Basketball Illustrated, a scouting service that was based on New York area players. This was a major recruiting tool for 20 years, for college coaches nationwide looking for players in the city known for its basketball talent. His Five-Star Basketball Camp ran from 1966 until 2008, when the NCAA ended such camps.\nBy 1980, Garfinkel's camp was considered to be the mecca of summer basketball. His camps produced over 600 NBA players and 10,000 NCAA Division I players, operating in the Pocono Mountains in Northeastern Pennsylvania, Pittsburgh, and Virginia. The camps were attended by players such as Michael Jordan, Patrick Ewing, LeBron James, Moses Malone, Vince Carter, Isiah Thomas, and Alonzo Mourning. Garfinkel worked with various legendary coaches such as Chuck Daly, Bobby Knight, Rick Pitino, and John Calipari.\nGarfinkel was the founder of the New York City Basketball Hall of Fame. He was inducted in 2014 into the National Collegiate Basketball Hall of Fame. Garfinkel died in May 2016, reportedly as the result of lung cancer. He was posthumously inducted into the Naismith Basketball Hall of Fame in 2021.\nSee also\n*Sonny Vaccaro\nReferences\nExternal links\n* [http://www.nybasketballhalloffame.com/howard-garfinkel Howard Garfinkel at the New York City Basketball Hall of Fame]\n* [http://collegebasketballexperience.com/members/howard-garfinkel/?v=7516fd43adaa Howard Garfinkel at the National Collegiate Basketball Hall of Fame]"
    }
  ]
}