{
  "content": [
    {
      "type": "text",
      "text": "# Howard Robertson (architect)\n\n|birth_place          = Salt Lake City, Utah, United States\n|death_date           =\n|death_place          = London, United Kingdom\n|significant_buildings= Shell Centre, London\n|alma_mater           = Architectural Association School of Architecture, École des Beaux-Arts\n|spouse               = Doris Adeney Lewis\n}}\nSir Howard Morley Robertson MC RA (16 August 1888 – 5 May 1963) was an American-born British architect, President of the Royal Institute of British Architects from 1952 to 1954 and a Royal Academician. In 1949, he was the winner of the Royal Gold Medal for architecture.\nEarly life\nBorn on 16 August 1888 in Salt Lake City, Utah, United States, Robertson was the younger son of Casper Ludovic van Uytrecht Robertson, originally from Liverpool, by his marriage to Ellen Duncan, of Ohio. He spent his early childhood in the United States and was sent to England in the 1890s to be educated at Eastfield House, Ditchling, Sussex, and at Malvern College. Robertson then trained at the Architectural Association School of Architecture in London, from which he graduated in 1907, and also in France. In 1913, he received a diploma in architecture from the École des Beaux-Arts in Paris. Between 1913 and 1914, he gained experience in the offices of architects in London, Boston, and New York City, and worked on a project at Le Touquet in northern France.\nMilitary career\nRobertson joined the British Army during the First World War and served in France from 1915 to 1919, rising to the rank of colonel. He was awarded the British Military Cross, the French Légion d'honneur and Black Star, and the American Certificate of Merit Medal.\nCareer as architect\nOn his return to civilian life in 1919, Robertson formed the firm of Easton & Robertson with John Murray Easton (1889–1975). Their offices were at 168 Regent Street, London, and they continued the partnership until 1931. In 1920 he began to teach at the AA School of Architecture in London, where he became a friend of the School's secretary, F. R. Yerbury. They later travelled together in Europe. Robertson was appointed as Principal of the School in 1926 and from 1929 to 1935 was its Director of Education. He became a member of the ''Congrès International d'Architecture Moderne, but left it when he began to find it too narrowly focussed.\n]]\nWith Le Corbusier, Oscar Niemeyer, Sven Markelius, and others, Robertson was a member of the Board of Design Consultants which assisted Wallace Harrison with the design of the United Nations Headquarters in New York City, built between 1947 and 1952 in reinforced concrete and aluminium, with glass curtain walls.\nRobertson was elected a Fellow of the Royal Institute of British Architects in 1925 and an Associate of the Royal Academy on 22 April 1949 and a Royal Academician on 24 April 1958. He was President of the Royal Institute of British Architects from 1952 to 1954. In that role, his portrait was painted by Rodrigo Moynihan.\nIn 1927, Robertson married Doris Adeney Lewis, who was also an architect and had been one of his architectural students, the daughter of J. R. Lewis of Melbourne, Australia. They had no children. Robertson was knighted in 1954 and died on 5 May 1963, while his widow survived him until 1981.\nRobertson published books within his profession, including The Principles of Architectural Composition (1924), and Architecture Arising (1948). As \"H. Rob.\" he contributed articles to the 14th edition of Encyclopædia Britannica''.\nWork\n, 1961]]\nRobertson designed the British Pavilion for the 1925 International Exposition of Modern Industrial and Decorative Arts in Paris, the event which created the term Art Deco. His Permanent Exhibition Hall for the Royal Horticultural Society was awarded the RIBA Bronze Medal in 1928. His Schloss Freudenberg, at Rotkreuz in Switzerland, is a country house built for Erwin Hürlimann, chairman of Swiss Reinsurance, between 1929 and 1933.\nHis other notable buildings include the Metropolitan Water Board Laboratories, London (1938), in which he paid tribute to the work of Erich Mendelsohn, the Bank of England Printing Works at Loughton in Essex (1956), and the Faculty of Letters building at the University of Reading (1956). His twenty-six-storey Shell Centre (also called the Upstream Building, 1961), in York Road, Waterloo, London, was so high that it caused planning arguments, while its Art Deco style was unwelcome to other architects, who considered it out of keeping with the Modernism of other large new buildings in the neighbourhood.\n'Sentosa', Esher, another domestic building designed by Robertson, built for the Erhardt family in 1934, was made a listed building in 1985.\nPublications\n*Howard Robertson, Modern Dutch Architecture (1922)\n*Howard Robertson, Architecture Explained, with an introductory note by J. C. Squire (London: E. Benn Ltd, 1926; New York: George H. Doran Co.)\n*Howard Robertson, The Principles of Architectural Composition (London: The Architectural Press, 1924; with foreword by Robert Atkinson)\n**Los Principios de la Composición Arquitectónica (Spanish translation)\n*Howard Robertson, Some Recent French Developments in Domestic Architecture (1927)\n*Howard Robertson, Francis Rowland Yerbury, Examples of Modern French Architecture (London: Ernest Benn, 1928)\n*Howard Robertson, The Four Inns of Court (Ludowici-Celadon Co., 1930)\n*As \"H. Rob.\", articles on architectural subjects contributed to Encyclopædia Britannica, revised 14th edition (1933–1973)\n*Howard Robertson, Modern Architectural Design (London: The Architectural Press, 1932; new edition 1952)\n*Howard Robertson, Französiche Baukunst der Gegenwart (Berlin: E. Wasmuth, 1933)\n*Howard Robertson, Reconstruction and the Home (1947)\n*Howard Robertson, Architecture Arising (London: Faber and Faber, 1948)\n*Howard Robertson & Francis Rowland Yerbury, Travels in Modern Architecture 1925–1930 (London: The Architectural Association, 1989) (posthumously)\nNotes\nExternal links\n*[http://www.racollection.org.uk/ixbin/indexplus?session=CmjnHgtt2Ee&_IXSR_=&_IXSP_=0&_MREF_=50943&_IXACTION_=display&_IXSPFX_=templates/full/&_IXTRAIL_=Academicians&_IXlink=y RAA/LIB/2/137 Sir Howard Robertson, member's file 1949] at racollection.org.uk"
    }
  ]
}