{
  "content": [
    {
      "type": "text",
      "text": "# Howard Kirschenbaum\n\n| birth_place        =\n| nationality        = American\n| occupation         = Educator, author and researcher\n| title              =\n| awards             = Humanistic Impact Award, American Counseling Association\n| website            = www.howardkirschenbaum.com\n| education          = B.A., LiteratureM.A., TeachingEd.D., Educational Psychology\n| alma_mater         = The New School for Social ResearchTemple University\n| thesis_title       =\n| thesis_url         =\n| thesis_year        =\n| workplaces         = University of Rochester\n}}\nHoward Kirschenbaum is an American educator, author, researcher, and historic preservationist. He is a Professor Emeritus and former Chair of the Department of Counseling and Human Development at University of Rochester’s Margaret Warner Graduate School of Education and Human Development.\nKirschenbaum has authored 25 volumes on various subjects including education, psychology and history. He has conducted research in the fields of values and character education, humanistic education, and Carl Rogers and the person-centered approach to counseling and psychotherapy. Kirschenbaum's books include The Life and Work of Carl Rogers, One Hundred Ways to Enhance Values and Morality in Schools and Youth Settings, Wad-Ja-Get? The Grading Game in American Education, and Coming of Age in the Baby Boom: A Memoir of Personal Development, Social Action, Education Reform and Adirondack Preservation. He is the writer, narrator and producer of Carl Rogers and the Person-Centered Approach DVD released in 2003.\nKirschenbaum is the former executive director of the National Humanistic Education Center and the National Coalition for Democracy in Education. Kirschenbaum has contributed to historic preservation and conservation in the Adirondack Park, owning, restoring, managing, or advocating for many historic properties, including several National Historic Landmarks. He is a former board member and officer of the Adirondack Nature Conservancy chapter and Adirondack Land Trust. He has also authored books on Adirondack history and architecture.\nEducation\nKirschenbaum received his B.A. degree in literature from The New School for Social Research in 1966. He then studied at Temple University and received his M.A. degree in Teaching and doctoral degree in Educational Psychology in 1968 and 1975, respectively.\nCareer\nAfter teaching as an adjunct faculty at State University of New York, Kirschenbaum joined Warner Graduate School of Education and Human Development at University of Rochester in 1997 as Frontier Professor of School, Family and Community Relations, then as Professor and Chair of the Department of Counseling and Human Development from 2000 until 2006 when he became Professor Emeritus.\nKirschenbaum held several administrative positions throughout his career. He served as executive director of Adirondack Mountain Humanistic Education Center and its successors National Humanistic Education Center and Sagamore Institute from 1971 to 1989.\nResearch and work\nKirschenbaum's research specializations include values clarification, values and character education, and humanistic education. He has worked on developing and promulgating models and methods that promote progressive, constructivist approaches to counseling, education and the helping professions.\nRogers and the person-centered approach\nKirschenbaum has conducted extensive research on the work of Carl Rogers and the person-centered/client centered approach. Kirschenbaum published the first thorough book in English on Rogers’ life and work, titled, On Becoming Carl Rogers in 1979, followed by the biography, The Life and Work of Carl Rogers in 2007.\nIn the mid-2000s, he authored a paper to measure the prevalence of Rogers' work and to study the status of person-centered approach. Rogers' core conditions for effective psychotherapy were validated by the later research. His paper summarized Rogers' work and highlighted his development of the person centered approach to counseling.\nValues and character education\nIn the late 1960s until early 1980s, Kirschenbaum focused extensively on the values clarification approach in education and the helping professions. He co-authored the book Values Clarification: A Handbook of Practical Strategies for Teachers and Students, published in 1972.\nKirschenbaum addressed the criticism to values clarification and presented the theoretical and research base to the concept. In the late 1980s and 1990s, he incorporated the concepts of moral education and character education in his research and worked on a more comprehensive approach to values and character education. Kirschenbaum developed new models for thinking about values education and explored the boundaries of values clarification along with its relationship to other fields. His work also emphasized the importance of changing the school climate and culture to embody the target values, rather than working only on the level of individual change.\nKirschenbaum has written or co-authored several books on value clarification and values and character education, including One Hundred Ways to Enhance Values and Morality in Schools and Youth Settings, Values Clarification in Counseling and Psychotherapy: Practical Strategies for Individual and Group Settings, Advanced Values Clarification, and Readings in Values Clarification.\nGrading and evaluation reform\nKirschenbaum has conducted significant research regarding grading and evaluation. He co-authored the book, Wad-ja-get? The Grading Game in American Education, published in 1971.\nKirschenbaum and Bellanca conducted a survey of 1900 colleges which indicated that students from schools with alternative grading systems would not suffer a disadvantage in college admissions. The results from the survey were published in the book, The College Guide for Experimenting High Schools, which was published in 1973.\nHumanistic education\nKirschenbaum founded and directed The National Humanistic Education Center in the 1970s-80s, coordinated a Humanistic Education Network, and published The Catalog for Humanizing Education in 1975. In one often-reprinted article he discussed teaching methods directed towards making students sensitive to life outside of their typical experience. His and Barbara Glaser's Skills for Living course used in high schools in the 1980s incorporated a  humanistic education curriculum.\nAwards and honors\n*1983 – Les Carlin Award, American Counseling Association\n*1974 – Values Clarification selected as “one of the outstanding books in education for 1972–73\" in a survey published in National Education Association's Today's Education\n*2011 – Lifetime achievement Award for Individual Excellence in Historic Preservation, Preservation League of New York State\n*2014 – Humanistic Impact Award for significant impact on the counseling profession and humanistic values, American Counseling Association\n*2014 – Featured as a \"Living Legend\" in the counseling field, American Counseling Association annual conference\nBibliography\nSelected books\n*Clarifying Values Through Subject Matter: Applications for the Classroom (1973)\n*Developing Support Groups: A Manual for Facilitators and Participants (1978)\n*The life and work of Carl Rogers (2007)\n*The Carl Rogers reader (1989)\n*Values clarification in counseling and psychotherapy: Practical strategies for individual and group settings (2013)\n*Wad-Ja-Get? The grading game in American Education: 50th anniversary edition (2020)\nSelected articles\n*Kirschenbaum, H., & Jourdan, A. (2005). \"The current status of Carl Rogers and the person-centered approach\". Psychotherapy: Theory, Research, Practice, Training, 42(1), 37.\n*Kirschenbaum, H. (2000). \"From values clarification to character education: A personal journey\". The Journal of Humanistic Counseling, Education and Development, 39(1), 4–20.\n*Kirschenbaum, H. (1992). \"A comprehensive model for values education and moral education\". The Phi Delta Kappan, 73(10), 771–776.\n*Kirschenbaum, H. (2004). \"Carl Rogers's life and work: An assessment on the 100th anniversary of his birth\". Journal of Counseling & Development, 82(1), 116–124.\n*Kirschenbaum, H., & Reagan, C. (2001). \"University and urban school partnerships: An analysis of 57 collaborations between a university and a city school district\". Urban Education, 36(4), 479–504.\nReferences"
    }
  ]
}