{
  "content": [
    {
      "type": "text",
      "text": "# Howard Clewes\n\n| birth_place  = York, England\n| death_date   =\n| death_place  =\n| occupation   = Screenwriter, Novelist\n| yearsactive  = 1938–1979\n}}\nHoward Clewes (27 October 1912 &ndash; 29 January 1988) was an English screenwriter and novelist. He wrote for eight films between 1951 and 1974. He also wrote twenty action novels from 1938 to 1979. He was nominated for a BAFTA for Best Screenplay in 1960 for The Day They Robbed the Bank of England.\nHe was born in York, England. In 1946, he married Renata Faccincani della Torre, a wartime resistance fighter. She was an active (uncredited) editor in his literary and screenwriting projects.\nFilmography\n* Green Grow the Rushes (1951), based on his 1949 novel of the same name\n* The Long Memory (1953), based on his 1951 novel of the same name\n* The Steel Bayonet (1957)\n* The One That Got Away (1957)\n* The Day They Robbed the Bank of England (1960)\n* Up from the Beach (1965)\n* That Man in Istanbul (1965)\n* The Three Musketeers (1974)\nNovels\n* Sailor Comes Home (1938)\n* Dead Ground (1946)\n* The Unforgiven (1947)\n* Quay South (1947)\n*  Thus am I Slayn (1948)\n* The Mask Of Wisdom (1949)\n* Green Grow the Rushes (1949)\n* The Long Memory (1951)\n* An Epitaph For Love (1953)\n* The Way The Wind Blows (1954)\n* Man On A Horse (1964)\n* The Libertines (1966)\n* I, The King (1979)\nPlay\nImage in the sun (1955)\nTelevision adaptations\nClewes 1947 novel Quay South was later adapted to television as an episode of the TV series ITV Television Playhouse. The play started Peter Barkworth as Lt. Shirley, Michael Bates as Captain Alan Gerard as Newton Blick as Fisherman, Allan Cuthbertson as Billy, Miriam Karlin as Hilda Thwaite, Roger Livesey as Captain Daniel Thwaite, Doria Noar as Agnes, Richard Pearson as Frederick Elwes, Frederick Piper as Spanish, Philip Ray as Uncle O'Hara, Peter Sallis as Corporal Foster Robert Sansom as Commanding Officer and Peter Wigzell as Sentry.\nReferences\nExternal links\n*"
    }
  ]
}