{
  "content": [
    {
      "type": "text",
      "text": "# Howard I. Chapelle\n\n| death_place               = Lewes, Delaware, U.S.\n| death_cause               =\n| monuments                 =\n| nationality               =\n| other_names               =\n| citizenship               =\n| education                 =\n| alma_mater                =\n| occupation                = Naval architect, historian, author\n| employer                  =\n| organization              = Smithsonian Institution\n}}\nHoward Irving Chapelle (February 1, 1901 – June 30, 1975) was an American naval architect, and curator of maritime history at the Smithsonian Institution, Washington, D.C. In addition, he authored many books and articles on maritime history and marine architecture.\nBiography\nChapelle was born on February 1, 1901. From 1919, he worked as a marine apprentice and designer for a number of shipbuilders. After 1936, he went into business for himself, and later served as head of the New England section of the Historic American Merchant Marine Survey, a New Deal project designed to research American naval history and staffed by unemployed marine architects.\nDuring World War II, Chapelle served in the United States Army Transportation Corps ship and boatbuilding program, rising to lieutenant colonel. In 1950, he ventured to England, where he researched colonial ship design on a Guggenheim fellowship. In 1956/57, he served the United Nations Food and Agricultural Organization as a consultant on fishing boat construction to the government of Turkey. Upon returning to America, he was appointed Division of Transportation curator of the National Museum of History and Technology. Ten years later, in 1967, he stepped down as curator to assume the role of senior historian. He retired in 1971, accepting the title of historian emeritus.\nChapelle died in Lewes, Delaware, on June 30, 1975.\nWorks\nChapelle was a small-boat enthusiast and sailor. He felt that inexpensive yachts based on traditional workboats were the most practical way to go sailing and designed a number of small boats. His article on a  Chesapeake sharpie skiff is typical of many of his articles.\nHis book American Small Sailing Craft (1951) is considered a classic among small-boat builders and historians. In it he documented many fast-vanishing American working boats.\nHis other books include:\n* American Sailing Craft (1936)\n* Yacht Designing and Planning (1936) W. W. Norton & Company,\n* Boatbuilding: A Complete Handbook of Wooden Boat Construction (1941) W.W. Norton & Company Inc.\n* The History of American Sailing Ships (1935) W. W. Norton & Company\n* The History of the American Sailing Navy: The Ships and Their Development, W. W. Norton & Company, Inc. (1949), .\n* American Small Sailing Craft (1951) W. W. Norton & Company\n* The Search for Speed Under Sail: 1700-1855 (1967) W. W. Norton & Company, Inc.\n* The Baltimore Clipper\n* The American Fishing Schooners 1825-1935 (1973) W. W. Norton & Company Inc.,\n* The Bark Canoes and Skin Boats of North America (1964) Smithsonian Institution Press, , cowritten by Howard I. Chapelle and Edwin Tappan Adney.\nReferences\nExternal links\n*"
    }
  ]
}