{
  "content": [
    {
      "type": "text",
      "text": "# Howard Carter (Australian preacher)\n\nHoward Julian Carter (10 September 1936 – 28 July 1992) was a Pentecostal Christian religious leader, known for his creation of Logos Foundation in 1969, which in turn established the Covenant Evangelical Church in the mid-1980s.\nBiography\nCarter was born to Claude and Enid Carter in Auckland, New Zealand. He earned a Diploma of Teaching at the Auckland Teachers College in 1956. After gaining his teaching qualification he worked as a teacher at District High School, Reporoa, New Zealand, in 1960 and 1961. In 1962, he gained a Licentiate of Theology (LTh) from Whitley College, Melbourne, and, in 1965, a Diploma of Ministry from the Baptist Theological College, Auckland. He was a minister at the Manurewa Baptist Church in New Zealand from 1962 to 1968.  He awarded himself a Master of Arts degree (Pacific College Theological) in 1987.\n1968–1979\nIn the late 1960s and 1970s, Carter was influential in the charismatic movement's growth in mainstream churches in Australia and New Zealand, regularly organising 'Holy Spirit Teaching Seminars' in Sydney. His teaching was centred on themes of Christ's authority, victorious living and charismatic gifts. The majority of his teachings were distributed through Logos Foundation's \"Restore\" magazine and short books. Carter was a charismatic leader who became involved with a number of fundamentalist authoritarian Protestant religious groups and churches in Australia and the South Pacific.\nCarter moved his family from New Zealand to Australia in 1969. In the mid-1970s he was instrumental in introducing to Oceania the Shepherding Movement and associated discipleship from the now infamous \"Fort Lauderdale Five\" from Christian Growth Ministries (CGM) in the U.S.A. The movement promoted a pyramid-like authoritarian hierarchy, in which each disciple was accountable to a personal pastor (usually the leader of the 'Household' – the name used for cell groups) for whole-of-life direction and personal decisions, and written covenants were encouraged. All these aspects theologically distanced the Logos movement from the majority of mainstream Protestant Christians.\nDoctrines of submission to God's delegated authorities in order to provide promised 'covering' and complete spiritual protection were regularly promoted and were narrowly applied to wives obeying husbands, children obeying parents and disciples obeying leaders. The concept gained momentum over time and was eventually exercised in an almost cult-like manner. Leaders in the movement were required to be addressed by titles 'brother' and 'sister', which had a side effect of distancing them socially even further from the ordinary members in the movement. 'Brother Howard' announced with certainty that he was in \"a submitted relationship\" to the CGM apostolic group (the Fort Lauderdale Five) of Bob Mumford, Ern Baxter, Charles Simpson, Derek Prince and Don Basham. While these teachings appeared to be biblical and aimed to promote disciplined living, the result for non-leaders was a disempowering of their abilities and a neglect of their individual gifts and insights.\n1980–1992\nIn 1980, the Logos-related churches became the Australian Fellowship of Covenant Communities and in the mid-1980s were renamed the Covenant Evangelical Church. In the early 1980s, Carter led the Logos movement through a shift in eschatology from pre-millenarianism (described as a theology of defeat) to post-millenarianism (described as a theology of victory) of the specific stream of Dominionist, Reconstructionist Theology. Carter's interpretations and teaching became more extreme, and his style more cultish and authoritarian, causing some of his leadership team, including Pastor David Jackson of Christian Faith Centre, Sydney, to leave the movement.\nA key member at that time, Colin Shaw, believed that Carter was an anointed man of God and Shaw later became Carter's key agent for outreach and missionary works in Quezon City, Philippines. Logos used a Filipino church, the Christian Renewal Center (a moderate Pentecostal/Charismatic church), as their base to advance and promote their brand of teachings emanating from the Shepherding Movement. With local assistance in the Philippines, Shaw coordinated and sponsored conferences featuring Carter as the lead speaker, under the Christian Renewal Center's name. Filipino Christians with little means and who lived in poverty were encouraged to give from their limited funds into the Logos movement.  However, soon after the revelation of Carter's secret lifestyle was revealed, the Filipino wing of Logos dissolved and dispersed back into established local churches.\nDuring this period, Carter lived an extravagant lifestyle which frequently involved first-class air travel to North American and other international locations, staying at five-star hotels, and indulging in many other luxuries that were beyond the means of his loyal supporters. He drove a Mercedes Benz and lived in a large mansion with magnificent views from the Toowoomba escarpment. The Logos Foundation even owned and operated a motel in Canada with Australian staff. The financial affairs of Logos Foundation were shrouded in secrecy from most followers with little or no accountability regarding the vast sums of money that had been accumulated.\nIn the 1989 Queensland State election, Carter advanced the position that adherence to fundamentalist Christian doctrine was a more important consideration than opposition to the widespread corruption in the conservative Queensland government that had been exposed by the Fitzgerald Inquiry. Carter's campaign was vehemently anti-homosexual and, at times, the death penalty for homosexuals was advocated in accordance with Old Testament Law. An article in The Sydney Morning Herald noted: \"Homosexuality and censorship should determine your vote, the electorate was told; corruption was not the major concern\". The same article quoted from a letter Carter had written to supporters at the time: \"The greenies, the gays and the greedy are marching. Now the Christians, the conservatives and the concerned must march also\".  An earlier article published in the Herald quoted a Logos spokesman, in reference to the call for the death penalty for homosexuals in order to rid Queensland of them, who stated \"the fact a law is on the statutes is the best safeguard for society\".\nAt the peak of his power towards the end of that period, Carter used alleged 'personal revelations from God' to exert enormous influence over the lives of his followers and the direction of the organization. His \"revelations\" were put on a par with scripture by his followers, and at times were in practice treated as being over and above scripture. That development effectively marked a shift for Logos from being purely a fundamentalist religion, into the overt traits of a cult.\nThe Sydney Morning Herald article in October 1990 quoted disillusioned followers as saying: \"...we felt we had lost control over our lives.  It was all dictated to us from above and that was very oppressive.  Everything centered around Howard Carter; he had all the power\".\nBy the late 1980s, what remained of the Shepherding Movement worldwide had descended into manipulative relationships, abuse of power and dubious financial arrangements. Carter played these factors skilfully to entrench his own position and ensure the continuation of Logos Foundation.  In his 2010 thesis, Hey (2010) identified, \"Suggested reasons for Carter's failure have included insecurity, an inability to open up to others, arrogance and over confidence in his own ability\".\n1990–1991\nIn 1990, Carter lost control of Logos Foundation as a result of an adultery scandal. Carter's alleged submission and accountability to the Fort Lauderdale Five, who were purported to provide a fail-safe discipleship that would in part protect him from personal failures, was a farce. When Carter was exposed, it became known that he had engaged in \"sexual affairs that dated back many years\"\nDeath and legacy\nCarter died from eye cancer in 1992 in Toowoomba, Queensland.\nReferences"
    }
  ]
}