{
  "content": [
    {
      "type": "text",
      "text": "# Howard Angus Kennedy\n\n| birth_place = Stepney, England\n| death_date  =\n| death_place = Montreal, Quebec\n| occupation  = Journalist, historian\n| nationality = Canadian\n| period      = 20th century\n| genre       = History, fiction\n| spouse      =\n| children    = 2\n| subject     =\n| movement    =\n| influences  =\n| influenced  =\n| signature   =\n| website     =\n}}\nHoward Angus Kennedy, (December 27, 1861 – February 15, 1938) was a British born Canadian journalist and historian.\nBiography\nKennedy was born in Stepney, in London, England in 1861. His parents were John Kennedy, an Anglican priest and Helen Stodart Blackie. He was educated at the City of London School until 1877 when he joined a shipping firm. Four years later he journeyed to Canada with the intention of learning to farm but became a journalist instead. He became a correspondent for the Montreal Witness as well as the New York Herald. His most notable assignment was to cover the Riel Rebellion in 1885. He was present during the relief of Battleford, the Battle of Cut Knife and the pursuit of Big Bear. Afterwards he became city editor for the Witness, a position which he held for five years. In 1890 he returned to England to become editor of The Times Weekly. During his employment with The Times, he travelled back to Canada where he toured the country and wrote informational booklets for the Canadian government on the many regions.\nHe returned to Canada in 1912 and bought a large farm in Alberta with his son. His intention of settling down as a farmer was interrupted by the outbreak of war and he was invited by the government to help with the war effort. He went to Ottawa where he worked as a writer and editor for several government agencies until 1918. After the war he devoted his time to writing and eventually produced 17 books as well as numerous articles and pamphlets. From 1918 onward he also worked as a freelance journalist.\nKennedy was a charter member of the Canadian Authors Association which was established in 1921 and in 1929 he was elected as national secretary, a position he held until his death. He married Louise Chapman in 1886 with whom he had two children. His son, Roderick Stuart Kennedy was also a journalist and a writer. He died in Montreal in 1938 after a short illness. He is buried in Mount Royal Cemetery, in Outremont.\nWorks\n* The Sunday afternoon song-book, (1892)\n* Professor Blackie, His Sayings And Doings, (1895)\n* The Story of Canada, (1895) (part of Story of the Empire series which he planned and edited)\n* Medicine-man rule in Canada: story of a national scandal, a suppressed exposure and a drastic prescription, told in letters to the Prime Minister, with a sequel, (1900)\n* Old Highland Days, (1901) (Biography of his father)\n* The New World Fairy Book, (1904)\n* The Heart of Canada: Orchard and Dairy Region of Lake Ontario, (1905)\n* New Canada And The New Canadians, (1907)\n* Nova Scotia, New Brunswick, Prince Edward Island, (1908)\n* The Heart of Canada, (1909)\n* ''Canada's farthest south: Niagara and Lake Erie fruit district, a trip through the famous peach orchards and vineyards of southwestern Ontario, (1912)\n* Robert Burns in the twentieth century, (1923)\n* The Book of the West, (1925)\n* Father Lacombe, (1928)\n* The Northwest Rebellion, (1928)\n* Origin of the Canadian Pacific Railway, (1928)\n* Lord Strathcona, (1928)\n* Unsought Adventure, (1929)\n* Our travel ways, (1930)\n* The Red Man's Wonder Book'', (1931)\nSources:\nReferences\nExternal links\n*\n*"
    }
  ]
}