{
  "content": [
    {
      "type": "text",
      "text": "# Howard Morphy\n\nHoward Morphy (born 13 June 1947) is a British anthropologist who has conducted extensive fieldwork in northern Australia, mainly among the Yolngu people. He was founding director of the Research School of Humanities and the Arts at the Australian National University and is currently a distinguished professor of anthropology.\nMorphy is an anthropologist of art and film. He is co-editor of The Anthropology of Art: a Reader (2006, Blackwell's, with Morgan Perkins) and Rethinking Visual Anthropology (1997, Yale University Press, with Marcus Banks), two keys texts in these fields. He has also published in the area of Australian Aboriginal art, especially Ancestral Connections (Chicago 1991), and a general survey book Aboriginal Art (Phaidon, 1998) as well as Becoming Art: Exploring Cross-Cultural Categories (Berg, 2007), described by one reviewer as demonstrating his 'encyclopaedic knowledge of the history of Yolngu art production', whilst also noting it was 'no easy read'. He has also produced a multimedia biography The Art of Narritjin Maymuru with Pip Deveson and Katie Hayne (ANU epress 2005). Morphy has also worked closely filmmakers and curated exhibitions including Yingapungapu at the National Museum of Australia.\nAcademic career\nAfter completing BSc and MPhil degrees at University College London, Morphy worked briefly in the Ethnography department of the British Museum before responding to an advertisement for PhD funding at the Australian National University, to work with the Yolngu people of northeast Arnhem Land (Yirrkala), which he began in 1974. After a period teaching at ANU he was appointed lecturer in anthropology and curator at the Pitt Rivers Museum, University of Oxford, in 1986.\nDuring his period in Oxford, Morphy served as Junior Proctor in 1990–91, Senior Tutor of Linacre College, and, with Sir Barry Cunliffe, helped develop the new Archaeology and Anthropology undergraduate degree. In 1996 Morphy moved to University College London as professor of anthropology and the following year returned to Australian National University as a senior research fellow. At ANU Morphy was appointed director for the Centre for Cross Cultural Research, and then director of the Research School of Humanities and the Arts, with a responsibility for undergraduate and postgraduate education as well as research. He stood down from that position in September 2013.\nMorphy is a past president of the Council for Museum Anthropology of the American Anthropological Association. In 2013 he was awarded the Huxley Memorial Medal by the Royal Anthropological Institute of Great Britain and Ireland (RAI).\nA special seminar 'Fostering the Anthropological Imagination: The work of Frances and Howard Morphy' was convened by the American Ethnological Society in 2018, celebrating their important contribution to Australian anthropology.\nPersonal life\nMorphy is married to the anthropologist Frances Morphy, an honorary associate professor at Australian National University, with whom he has collaborated extensively over the years. The couple met at University College London and moved to Australia together to do fieldwork in Arnhem Land. Frances Morphy has said that 'that field experience with the Yolngu gave us the solid foundation for our long-term partnership and our lifelong, shared interests.'\nSelected publications\nMorphy, Howard. 'The anthropology of art', in Companion encyclopedia of anthropology, pp.&nbsp;682–719. Routledge, 2002.\nBanks, Marcus, and Howard Morphy, eds. Rethinking visual anthropology. Yale University Press, 1997.\nMorphy, Howard. 'Landscape and the reproduction of the ancestral past', In The anthropology of landscape: perspectives on place and space, edited by Eric Hirsch and Michael O'Hanlon. Oxford: Clarendon Press (1995), 184–209.\nMorphy, Howard. \"The interpretation of ritual: reflections from film on anthropological practice.\" Man (1994): 117–146.\nMorphy, Howard. Ancestral connections: art and an Aboriginal system of knowledge. University of Chicago Press, 1991.\nMorphy, Howard. \"From dull to brilliant: the aesthetics of spiritual power among the Yolngu.\" Man (1989): 21–40.\nReferences"
    }
  ]
}