{
  "content": [
    {
      "type": "text",
      "text": "# Howard Lew Lewis\n\n| birth_place             = London, England, UK\n| death_date              =\n| death_place             = Edinburgh, UK\n| occupation              = comedianactor\n| years_active            =\n| spouse                  = Anna Goodall\n| children                = 1\n}}\nHoward Lew Lewis (21 August 1941&nbsp;– 20 January 2018) (born Howard R. Lewis) was an English comedian and actor, best known for his roles in comedy series including Maid Marian and Her Merry Men, Brush Strokes and Chelmsford 123.\nBiography\nLewis was born in London, England. His parents were both born in southern Wales (Tenby and Bridgend). As a young man, Lewis flat-shared with Ken Morley (Reg Holdsworth of Coronation Street) and Andy Carr, actor and screenwriter. His first job was with the Royal Air Force, where he was a computer operator. He worked for several years in computing and telecommunications, but when promoted to manager-level he decided instead to pursue acting as a career after being asked to fire a colleague whom he believed to be a good worker. He was married twice. His first marriage lasted just over a year. His second marriage was to Anna Goodall. They married in 1990 with Ken Morley as best man.\nTelevision\nOne of his more notable roles was as Rabies, one of the Merry Men in the BBC children's television comedy series Maid Marian and Her Merry Men where he appeared in all 26 episodes. He also had a prominent part as the dim barman Elmo Putney in the BBC sitcom Brush Strokes between 1986-91.\nLewis also featured in \"Now You See Them\", a 1988 episode of the ITV anthology drama series Dramarama.\nHe appeared in two other prominent historical comedy series - as Blag in the Channel 4 sitcom Chelmsford 123 (1988) set during the Roman occupation of Britain in AD 123, and as assorted medieval peasants, (including Piers and Mr Applebottom) in The Black Adder (1983) and he had minor parts in two Ronnie Barker sitcoms - The Magnificent Evans (1984) and Open All Hours (1985) - and the ITV comedy-drama Minder (1984).\n{| class=\"wikitable\"\n|+\n!Year\n!Title\n!Role\n!Notes\n|-\n|1978\n|Pennies From Heaven\n|Policeman\n|1 episode\n|-\n| rowspan=\"3\" |1983\n|Reilly, Ace of Spies\n|Rowhedge\n|1 episode\n|-\n|The Black Adder\n|Mr. Applebottom, Piers\n|2 episodes\n|-\n|Widows\n|Binman (uncredited)\n|1 episode\n|-\n| rowspan=\"2\" |1984\n|Minder\n|Ronnie\n|1 episode\n|-\n|The Magnificant Evans\n|Bridgegroom\n|1 episode\n|-\n| rowspan=\"2\" |1985\n|C.A.T.S. Eyes\n|Stallholder\n|1 episode\n|-\n|Open All Hours\n|Byron\n|1 episode\n|-\n| rowspan=\"3\" |1986\n|Prospects\n|Barman\n|1 episode\n|-\n|Mr Pye\n|Mr. Rice\n|4 episodes\n|-\n|The Bill\n|George Harris\n|1 episode\n|-\n|1986-91\n|Brush Strokes\n|Elmo Putney\n|38 episodes\n|-\n| rowspan=\"3\" |1987\n|Pulaski\n|Props Man\n|1 episode\n|-\n|The Charmer\n|Gardener\n|1 episode\n|-\n|The Corner House\n|Mr. Cobham\n|1 episode\n|-\n|1988\n|Dramarama\n|Man in Audience\n|1 episode\n|-\n|1988-90\n|Chelmsford 123\n|Blag\n|13 episodes\n|-\n|1989-94\n|Maid Marian and Her Merry Men\n|Rabies\n|26 episodes\n|-\n|1996\n|''Harry's Mad\n|Gaston\n|4 episodes\n|-\n| rowspan=\"2\" |2000\n|The Bill\n|Landlord\n|1 episode\n|-\n|The Queen's Nose\n|Cafe Owner\n|1 episode\n|-\n| rowspan=\"2\" |2003\n|Casualty\n|Lee Stanton\n|1 episode\n|-\n|Keen Eddie\n|Uncle Leon\n|1 episode\n|-\n| rowspan=\"2\" |2007\n|Coming Up\n|Tom\n|1 episode\n|-\n|My Family''\n|Uncle Idris\n|1 episode\n|}\nFilms\nLewis appeared in several films, again mostly in minor roles. Notable film appearances included Terry Gilliam's 1985 film Brazil, where he played one of the Black Maria guards, and as one of Robin Hood's followers in the 1991 film Robin Hood: Prince of Thieves, playing a character named Hal.\nHe also appeared in the 1992 Oscar-nominated semi-biographical film Chaplin, and  was the English language voice of Obelix in the 1994 film of Asterix in America to Craig Charles' Asterix. In 2005, he played the part of Lillas Pastia, the innkeeper, in Bizet's Carmen at the Royal Albert Hall, London, and in 2007, played alongside Warwick Davis in the film Small Town Folk.\n{| class=\"wikitable\"\n|-\n! Year\n! Title\n! Role\n! Notes\n|-\n|1980|| The Mouse and the Woman || Doctor ||\n|-\n|1983|| Fords on Water || Man in Toilets ||\n|-\n|1985|| Brazil || Second Black Maria Guard ||\n|-\n|1991|| Robin Hood: Prince of Thieves || Hal ||\n|-\n|1992|| Chaplin || Workhouse Official #1 ||\n|-\n|1993|| Shadowlands || Tea Room Waiter ||\n|-\n|1994|| Asterix Conquers America || Obelix || English version, Voice\n|-\n|1998|| The Tichborne Claimant || The Hotel Manager ||\n|-\n|2000|| Quills || First Vendor ||\n|-\n|2001|| Girl from Rio || Taxi Driver 2 ||\n|-\n|2003|| Chaos and Cadavers || Cabbie ||\n|-\n|2004|| The Baby Juice Express || Kent ||\n|-\n|2007|| Small Town Folk || Knackerman #1 ||\n|}\nDeath\nIn an interview with the Scottish Mail on Sunday in late 2017, Lewis confirmed he had been diagnosed with dementia. His fellow actor and friend Tony Robinson announced on Twitter on 22 January 2018 that Lewis had died on 20 January 2018.\nOn 28 January 2018, it was reported that police in Edinburgh were investigating the circumstances surrounding the actor's death after his step-daughter Debora Milazzo claimed he had been placed on a regime of high-dose sedatives and maximum-strength opiate painkillers, and had been needlessly placed on the kind of treatment plan that would be prescribed for the terminal phase of a malignant disease, explaining that her stepfather had not received a terminal diagnosis. Police Scotland confirmed it was investigating the complaint.\nReferences"
    }
  ]
}