{
  "content": [
    {
      "type": "text",
      "text": "# Hsu Pan Htwar\n\n| birth_place        = Myanaung, Burma\n| death_date         =\n| death_place        =\n| restingplace       =\n| restingplacecoordinates =\n| othername          = Pan Pan\n| occupation         =\n| yearsactive        = 1999–present\n| spouse             = Okkar Kyaw\n| partner            =\n| children           = 1\n| alma_mater         = Dagon UniversityWest Yangon Technological University\n| parents            = Ye Myint AungCho Zin Thein\n| website            =\n| awards             =\n| module             =\n}}\nSu Pan Htwar (), born Ye Nanda Thu () on 10 June 1978, is a Burmese actress and singer. She is considered one of the most successful actresses in Burmese cinema, achieving fame as a singer as well. Throughout her career, she has acted in over 700 films and released two music albums. Su Pan Htwar was nominated as Best Actress at the 2002 Myanmar Academy Awards for her performance in the film Dat Khe.\nEarly life and education\nSu Pan Htwar was born on 10 June 1978 in Myanaung, Myanmar, to her father Ye Myint Aung, a government official who served as the director general of Electric Power Corporation (EPC), and her mother Cho Zin Thein. She is the third daughter among five siblings. She attended high school at Basic Education High School No. 6 Alone. She graduated from Dagon University with a degree in zoology and a part-time evening diploma in EP from West Yangon Technological University.\nCareer\n1999–2000: Acting debut and recognition\nShe began her career in 1999 as a singer and competed in local music contests and won a prize at the Mild Seven, a singing competition. Shortly after, she was first contacted to release an album by Zaw Win Htut, a rock singer. However she turned to films industry and became an actress. She made her first appearance in the 1999 film Kyan Taw Naint Chit Thaw Main Ka Lay Myar, directed by Maung Thi. After a short time she made her leading role debut in film Tain Tway Ngo Loh Moe Phit Tar, alongside Nay Htet Lin and Min Oak Soe, directed by Mg Myo Min in 2000. She then starred in the film Thin Ka Chit Ywei Thin Ko Chit Thaw where she played the leading role for a first time with Dwe.  The film was both a domestic hit, and led to increased recognition for Su Pan Htwar.\n2001–2010: Breaking into the big screen and success\nSu Pan Htwar took on her first big-screen leading role in the film Bar Ayay Gyi Sone Lae, alongside Kyaw Thu, Lu Min and Zarganar, which screened in Myanmar cinemas in 2001. She then starred in the film Dat Khe, where she played the leading role with Byight and Okkar, which screened in Myanmar cinemas in 2002. Her portrayal of the character Hla Hton earned praised by fans for her acting performance and character interpretation, and also earned her a nomination for the 2002 Myanmar Academy Award  for Best Actress. Ever since then she had starred in over 700 videos/films and countless more advertisements, music videos and so on.\n2011–present: Back to music scene and breakthrough\nSu Pan Htwar released her debut solo album \"Ma Tae Ah Tuu Nay\" on 3 December 2011, which was officially distributed to all parts of Myanmar. In 2014, she starred in the Myanmar's first TV series about justice and rule of law issues called The Sun, The Moon and The Truth where she played the main role with Bhone Thike, Nay Yan, Moe Yan Zune and Khin Zarchi Kyaw, aired on MRTV-4 on 13 February 2015 and received positive reviews for her portrayal of a lawyer Mya Hnin Si.\nIn 2015, Forever Group surveyed and decided to continue The Sun, The Moon and The Truth as season 2, according to the audiences' wants after they made surveying. So she continued shooting season 2 and aired in 2018 on MRTV-4. In 2016, she released her second solo album \"Thay Laut Aung Chit Tal\" (I Love You to Death). The follow-up video album on 18 May 2019 was a commercial success. In 2018, she starred in the hit thriller series It was on Yesterday 2, playing the role of Daw Thida, aired on MRTV-4 in September 2018.\nIn 2020, she takes part as a judge in the Shwe Kyo selection contest for Myanmar Academy Awards.\nBrand Ambassadorships\nSu Pan Htwar has been appointed brand ambassador for Mi Seoul, Grand Esta Yangon Clinic and JW Plastic Surgery Korea in 2017.\nSelected filmography\nFilm\nOver 700 films, including\n*Kyan Taw Naint Chit Thaw Main Ka Lay Myar (ကျွန်တော်ချစ်သော မိန်းကလေးများ) (1999)\n*Tain Tway Ngo Loh Moe Phit Tar (တိမ်တွေငိုလို့မိုးဖြစ်တာ) (2000)\n*Thin Ka Chit Ywei Thin Ko Chit Thaw (သင်ကချစ်၍ သင့်ကိုချစ်သော) (2000)\n*Ma Gyi San and Her Lovers (မကြီးစန်းနှင့် သူ၏ချစ်သူများ) (2016)\nFilm (Cinema)\n*Bar Ayay Gyi Sone Lae (ဘာအရေးကြီးဆုံးလဲ) (2001)\n*Dat Khe (ဓာတ်ခဲ) (2002)\n*Khoe Khoe Khit Khit (ခိုးခိုးခစ်ခစ်) (2014)\n*Shin Upa Goat Ta Ma Htai Myat Kyi (ရှင်ဥပဂုတ္တ ရဟန္တာမထေရ်မြတ်ကြီး) (2019)\nTelevision series\n{| class=\"wikitable\"\n! width=10|Year\n! English title\n! Myanmar title\n! Role\n! Network\n! Notes\n|-\n| 2015\n| The Sun, The Moon and The Truth\n| နေရယ် လရယ် အမှန်တရားရယ်\n| Mya Hin Si\n| MRTV\n|\n|-\n| rowspan=\"2\" | 2018\n| The Sun, The Moon and The Truth: Season 2\n| နေရယ် လရယ် အမှန်တရားရယ် ၂\n| Mya Hin Si\n| MRTV\n|\n|-\n| It was on Yesterday 2\n| မနေ့ကဖြစ်သည် ၂\n| Daw Thida\n| MRTV-4\n|\n|}\nDiscography\nSolo album\n*Ma Tae Ah Tuu Nay (မတည့်အတူနေ) (2011)\n*Thay Laut Aung Chit Tal (သေလောက်အောင်ချစ်တယ်) (2016)\nAwards and nominations\n{| class=\"wikitable\" style=\"font-size: 95%\"\n|-\n! Year\n! Award\n! Category\n! Nominated work\n! Result\n|-\n| 2002\n| Myanmar Academy Award\n| Best Actress\n| Dat Khe\n|\n|-\n|}\nPersonal life\nSu Pan Htwar married to Oakar Kyaw, a businessman and they celebrated their wedding reception in Santa Monica State Beach on Valentine's Day 14 February 2015. They also held a wedding reception in Myanmar in March 2016 at the Novotel Hotel in Yangon. She gave birth to their first son named Roar Roar Kyaw on 15 September 2016.\nReferences\nExternal links\n*"
    }
  ]
}