{
  "content": [
    {
      "type": "text",
      "text": "# Huan Wen's Northern Expeditions\n\n'''Huan Wen's Northern Expeditions''' were a series of expeditions launched by the Eastern Jin general Huan Wen and aimed at attempting to reclaim Jin's territory north of the Huai River. Due to the lack of support from the Jin court, the expeditions were unsuccessful.\nBackground\nDuring the first half of the 4th century, the Jin dynasty gradually lost control over its northern territories to the so-called 'Five Barbarians' in a period that would come to know as the Sixteen Kingdoms period. Jin moved its capital south to Jiankang in 318, and by 330, northern China was effectively unified by Shi Le's Later Zhao.\nBefore 330, Jin in the south was held back by numerous threatening rebellions which they ultimately put down. After 330, the aftermath of said rebellions and Zhao's supremacy over the north dissuaded many from supporting further military conflicts and instead settle for a north and south divide for the time being. Nonetheless, expeditions to the north were attempted before and after Zhao's unification, namely by Zu Ti (313-321), Yu Liang (339) and Yu Yi (343-344), but these had little support and failed in the end.\nGenuine interest in recapturing the north sparked in 349 when Later Zhao finally fell into civil war among its princes after the death of its third monarch, Shi Hu. That year, the Jin general, Chu Pou, was first to take advantage of the situation, beginning a series of northern expeditions that continued into the late 350s. However, Chu Pou was badly defeated at Dai Slope (代陂, east of present-day Tengzhou, Shandong), and soon died in shame.\nHuan Wen was a subordinate and friend of the general, Yu Yi. Following the death of Yu Yi in 345, Huan Wen took over Yi's military command over Jingzhou with the help of the key minister, He Chong. Between 346 and 347, Huan Wen conquered the state of Cheng-Han and helped Jin recover the lost territories of Yizhou and Liangzhou. The defeat of Cheng-Han elevated Huan Wen to high prestige and influence, but it also made the court secretly fearful of him due to his power and ambition. To counter Huan's influence, the court propped up another general named Yin Hao.\nAfter Chu Pou's death, Yin Hao was given the responsibility to carry out the northern expeditions. Between 352 and 353, Yin Hao led two northern expeditions, both of which failed. In the second campaign in 353, Yin Hao's hostility towards his contemporary, Yao Xiang, led to Yao breaking away from Jin, killing more than 10,000 Jin soldiers and seizing much of Jin's supplies in the process. This embarrassing loss allowed Huan Wen to persuade the court into dismissing Yin Hao, leaving Huan Wen the sole power over the Jin military. With the expeditions under his control, Huan Wen sought to conquer the north and at the same time use them as a means to realize his political ambitions.\nExpeditions\n1st expedition\nDuring the first expedition (354), Jin forces moved up the river to engage the army of Former Qin. Jin forces won a decisive victory at Lantian and defeated a Qin army of over 50,000 soldiers, reaching Chang'an. However, due to lack of food, the Jin army was forced to retreat, leaving the area under enemy control. Over 10,000 Jin soldiers died in the retreat.\n2nd expedition\nHuan Wen headed north again in 356 with the hopes of capturing Luoyang. At the time, Luoyang was held by a Jin general turned rebel named Zhou Cheng (周成). Coincidentally, Zhou Cheng was attacked by Yao Xiang, who was leading a roving army under the vassalage of Former Yan. When Huan Wen reached Luoyang, he battled Yao Xiang along the Yi River and was victorious. Yao Xiang fled with his army while Zhou Cheng surrendered Luoyang and himself to Huan Wen.\n3rd expedition\nJin launched a major campaign against Former Yan in 369. The Jin forces defeated Yan forces and reached Fangtou, causing panic in the Yan court. However, the Former Yan general Murong Chui led 50,000 troops and stopped the Jin advance at the Yellow River. Meanwhile, Xianbei cavalry cut off the Jin supply lines and forced them to retreat. During the retreat, Murong Chui led an army to pursue the Jin forces and over 30,000 Jin soldiers were killed in the resulting battle.\nAftermath\nHuan Wen left the north humiliated by his greatest defeat at Fangtou. Dissatisfied, Huan Wen made one last attempt at seizing power by forcing Emperor Fei to abdicate through slander in 371. He was successful at first, replacing the emperor with Sima Yu (Emperor Jianwen of Jin) but the efforts of Xie An and Wang Tanzhi stopped him from furthering his ambitions. Huan Wen died in 373, never becoming emperor.\nHuan Wen was succeeded by his brother Huan Chong, and his family would remain influential up until the fall of their short-lived state of Huan Chu in 404. Due to the failure of Jin to reclaim the Northern heartlands, Jin forces were soon faced with the gigantic threat of Qin. Jin's conquest of Yan proved beneficial for Qin, as in its weaken state, Qin quickly annexed them in 370. With Jin not capable of carrying out another expedition, the 370s was a period which saw rapid progress in Qin's conquest, a growth that was only stopped in 383 at the Battle of Fei River.\nReferences\nSources\n*Book of Jin\n*Li, Bo; Zheng Yin (Chinese) (2001) 5000 years of Chinese history, Inner Mongolian People's publishing corp, ,\nExternal links"
    }
  ]
}