{
  "content": [
    {
      "type": "text",
      "text": "# Hugo Award for Best Game or Interactive Work\n\n}}\nThe Hugo Award for Best Game or Interactive Work is one of the Hugo Awards given each year for science fiction or fantasy works released in the previous calendar year. The game award is given out to video games, tabletop games, and other interactive works; non-interactive audiovisual works receive awards in the dramatic presentation category. The Hugo Awards have been described as \"a fine showcase for speculative fiction\", and \"the best known literary award for science fiction writing\".\nThe Hugo Award for Best Game or Interactive Work was started as an annual category by the World Science Fiction Society in 2024. Prior to then, when the category was first successfully proposed in 2021, an example one-off version of the category was awarded as Best Video Game, under rules which allow individual one-off categories to be awarded in any given year. An earlier attempt at a one-off game category, entitled Best Interactive Video Game, had been made in 2006 but did not receive enough nominations to form a final ballot.\nHugo Award nominees and winners are chosen by supporting or attending members of the annual World Science Fiction Convention, or Worldcon, and the presentation evening constitutes its central event. The final selection process is defined in the World Science Fiction Society Constitution as instant-runoff voting with six finalists, except in the case of a tie. The works on the ballot are the six most-nominated by members that year. Initial nominations are made by members from January through March, while voting on the ballot of six finalists is performed roughly from April through July, subject to change depending on when that year's Worldcon is held. Worldcons are generally held in August or early September, and are held in a different city around the world each year.\nDuring the three years the category has been active, 18 video games by 17 developers have been finalists. Hades by Supergiant Games won under the Best Video Game title, ''Baldur's Gate 3 by Larian Studios won the formal inaugural year, and Caves of Qud by Freehold Games won in 2025.\nWinners and finalists\nIn the following table, the years correspond to the date of the ceremony, rather than when the work was first published. Entries with a yellow background have won the award; those with a gray background are the finalists on the short-list.\n&nbsp;&nbsp;*&nbsp;&nbsp;&nbsp;Winners and joint winners\n{| class=\"sortable wikitable\" width=\"85%\" cellpadding=\"5\" style=\"margin: 1em auto 1em auto\"\n|+\n|-\n! width=\"10%\" scope=\"col\"|Year\n! width=\"45%\" scope=\"col\"|Game\n! width=\"20%\" scope=\"col\"|Developer\n! width=\"20%\" scope=\"col\"|Publisher\n! width=\"5%\" scope=\"col\" class=\"unsortable\"|Ref.\n|- style=\"background:lightyellow;\"\n!scope=\"rowgroup\" align=\"center\" rowspan=\"6\" style=\"font-weight:normal;\"| 2021\n| Hades* || Supergiant Games || Supergiant Games\n|align=\"center\"|\n|-\n| Animal Crossing: New Horizons || Nintendo || Nintendo\n|align=\"center\"|\n|-\n| Blaseball ||  ||\n|align=\"center\"|\n|-\n| Final Fantasy VII Remake || Square Enix || Square Enix\n|align=\"center\"|\n|-\n| The Last of Us Part II || Naughty Dog || Sony Interactive Entertainment\n|align=\"center\"|\n|-\n| Spiritfarer || Thunder Lotus Games || Thunder Lotus Games\n|align=\"center\"|\n|- style=\"background:lightyellow;\"\n!scope=\"rowgroup\" align=\"center\" rowspan=\"6\" style=\"font-weight:normal;\"| 2024\n| Baldur's Gate 3* || Larian Studios || Larian Studios\n|align=\"center\"|\n|-\n| Alan Wake 2 || Remedy Entertainment || Epic Games\n|align=\"center\"|\n|-\n| Chants of Sennaar || Rundisc || Focus Entertainment\n|align=\"center\"|\n|-\n| Dredge || Black Salt Games || Team17\n|align=\"center\"|\n|-\n| The Legend of Zelda: Tears of the Kingdom || Nintendo || Nintendo\n|align=\"center\"|\n|-\n| Star Wars Jedi: Survivor || Respawn Entertainment || Electronic Arts\n|align=\"center\"|\n|- style=\"background:lightyellow;\"\n!scope=\"rowgroup\" align=\"center\" rowspan=\"6\" style=\"font-weight:normal;\"| 2025\n| Caves of Qud* || Freehold Games || Kitfox Games\n|align=\"center\"|\n|-\n| Dragon Age: The Veilguard || BioWare || Electronic Arts\n|align=\"center\"|\n|-\n|  || Nintendo, Grezzo || Nintendo\n|align=\"center\"|\n|-\n| Lorelei and the Laser Eyes || Simogo || Annapurna Interactive\n|align=\"center\"|\n|-\n| Tactical Breach Wizards || Suspicious Developments || Suspicious Developments\n|align=\"center\"|\n|-\n| 1000xResist'' || Sunset Visitor || Fellow Traveller Games\n|align=\"center\"|\n}}\nExternal links\n* [http://www.thehugoawards.org/ Hugo Award official site]"
    }
  ]
}