{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Albania\n\nAlbania ratified the  2000 UN TIP Protocol in August 2002.\nAlbania is a source country for men, women, and children subjected to trafficking in persons, specifically forced prostitution and forced labor, including the forced begging of children. Albanian victims are subjected to conditions of forced labor and sex trafficking within Albania and  Italy, North Macedonia, Kosovo, and Western Europe. Approximately half of the victims referred for care within the country in 2009 were Albanian; these were primarily women and girls subjected to conditions of forced prostitution in hotels and private residences in Tirana, Durrës, Elbasan, and Vlorë. Children were primarily exploited for begging and other forms of forced labor. There is evidence that Albanian men have been subjected to conditions of forced labor in the agricultural sector of Greece and other neighboring countries.\nThe Government of Albania is making significant efforts to combat trafficking. It has improved its capacity to identify, protect, and reintegrate trafficking victims. It has also successfully prosecuted some sex trafficking offenders, imposing significant penalties. In March 2009, the government approved an amendment to the Social Assistance law which will provide victims of trafficking with the same social benefits accorded to other at-risk groups in Albania and provide government funding for shelters. The government continues to track and analyze trafficking trends through a nationwide database. Government officials have increased public attention to trafficking in Albania. There are serious concerns, however, about protection for victims who testified against their traffickers. The government has not vigorously prosecuted labor trafficking offenders. Because of lack of political will and corruption in some key government agencies, the government has sometimes been less than vigorous in its prosecution of human trafficking. In 2013 Albania introduced harsher penalties for human trafficking, but there were very few arrests. In 2013, only three people were convicted for human trafficking, and in 2014, according to the US State Department, only nine were convicted. In 2015, the National Coalition of Anti-Trafficking Shelters (NCATS) reported 85 cases of human trafficking. However, they estimate that the number is much higher. Impoverished girls and women who are manipulated through sham marriages and false employment opportunities are named as particularly at risk. The other group of victims includes children, poor and socially excluded people, economic migrants, refugees and victims of domestic violence and other forms of abuse.\nThe U.S. State Department's Office to Monitor and Combat Trafficking in Persons placed the country in \"Tier 2\" in 2017. Statistics from the British National Crime Agency showed that in 2017 the majority of victims of human trafficking are Albanians who are exploited as cheap labor or in the sex industry. The country remained at Tier 2 in 2023.\nIn 2023, the Organised Crime Index gave the country a score of 5 out of 10 for human trafficking, noting improved support for victims.\nProsecution\nAlbania criminally prohibits sex and labor trafficking through its penal code, which prescribes penalties of 5 to 15 years' imprisonment. Since the fall of communism in Albania in the early 1990s, the trade in young Albanian women has expanded into Western Europe, as well as the trade in women from Eastern Europe for sexual enslavement.\nThese penalties exceed those prescribed for other serious crimes, such as rape. The State Police division reported investigating a combined 35 suspected traffickers in 2009. The government prosecuted 31 suspected trafficking offenders in 2009, convicting 11 of them; this contrasts with 26 trafficking offenders convicted in 2008 and seven in 2007. All of the prosecutions and convictions involved sex trafficking of women or children. In 2009, sentences imposed on convicted trafficking offenders ranged from 5 to 16 years' imprisonment. Pervasive corruption in all levels and sectors of Albanian society seriously hampered the government's ability to address its human trafficking problem, according to local observers. The Supreme Court overturned convictions of traffickers in two cases in 2009. In January 2009, the government reported it doubled the number of police investigators to investigate trafficking. The Serious Crimes Court seized and confiscated $268,115 in traffickers' assets and property in 2009.\nIn 2019, the government doubled the budget for the Office of the National Anti-Trafficking Coordinator (ONAC), but nevertheless, the government does not meet all of the minimum standards. Because the government investigated fewer cases, 2019 saw the lowest level of reported prosecutions in four years. However, as it is making significant efforts to meet the minimum standards according to the US State Department's 2020 report on trafficking in human beings, Albania remains at Tier 2.\nProtection\nThe Government of Albania has taken some steps to improve its efforts to identify and protect victims of trafficking. The government has implemented a National Referral Mechanism and conducted meetings with relevant stakeholders to improve its functioning. It identified 94 victims of trafficking in 2009, compared with 108 in 2008. The government's one shelter assisted 24 victims and NGOs assisted 70 during 2009. In 2009, the government provided free professional training to 38 victims, provided 11 with micro-credit loans to start private businesses, and integrated five victims into schools. In January 2010, it approved a draft law to provide social assistance to trafficking victims bridging the time from when they leave the shelters until they find employment. NGO-managed shelters continued to rely primarily on international donor funds in order to provide comprehensive services to trafficking victims. The government funds and operates a reception center that houses both victims of trafficking and irregular foreign migrants identified within Albanian territory; however, victims' freedom of movement is often restricted in this high-security center. The government does not penalize victims for unlawful acts committed in connection with their being trafficked and, under law, it offers legal alternatives to the removal of foreign victims to countries where they may face hardship or retribution.\nThe government encourages victims to participate in investigations and prosecutions of trafficking offenders; however, victims often refuse to testify, or they change their testimony as a result of intimidation or a fear of intimidation from traffickers. In some cases in 2009, the police offered no protections to trafficking victims when testifying against their traffickers, forcing victims to rely exclusively on NGOs for protection. In 2009, one victim witness received asylum in another country due to ongoing threats from the trafficker to her and her family and concerns that the government could not adequately protect her. The General Prosecutor's office did not request witness protection for victims of trafficking in 2009.\nPrevention\nIn 2010 the Government of Albania partnered with international organizations and experts such as Dr. Gilly McKenzie of the United Nations and Interpol, in order to implement anti-trafficking prevention activities aimed at informing the public and vulnerable groups about trafficking. The National Coordinator's office manages regional anti-trafficking working groups composed of relevant stakeholders. These working groups, however, reportedly do not always include civil society actors and do not efficiently address trafficking cases brought to their attention. The government funds a national toll-free, 24-hour hotline for victims and potential victims of trafficking. In November 2009, the government passed legislation to improve the registration process for new births and individuals in the Roma community; previous cumbersome procedures rendered unregistered Albanians and ethnic Roma highly vulnerable to trafficking.\nSee also\n*Human trafficking in Europe\nReferences"
    }
  ]
}