{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Libya\n\nLibya is a transit and destination country for men and women from sub-Saharan Africa and Asia trafficked for the purposes of forced labor and commercial sexual exploitation. While most foreigners in Libya are economic migrants, in some cases large smuggling debts of $500–$2,000 and illegal status leave them vulnerable to various forms of coercion, resulting in cases of forced prostitution and forced labor.\nAs of 2018 more governments as well as the UN began acknowledging the continuous violations of human rights as well as the chronic failures by the Libyan authorities to address the issue.\nProofs\nand as in previous years, there had been isolated reports that women from sub-Saharan Africa were trafficked to Libya for the purposes of commercial sexual exploitation. Although precise figures were unavailable, foreign observers estimated in 2008 that about one to two percent of Libya's 1.5 to 2 million foreigners may be victims of trafficking. , the Government of Libya did not fully comply with the minimum standards for the elimination of trafficking, but was making significant efforts to do so. The U.S. Department of State placed Libya on Tier 2 Watch List for its failure to provide evidence of increasing efforts to address trafficking in persons, particularly in the area of investigating and prosecuting human trafficking offenses. During 2007, Libya provided in-kind assistance to training programs designed to educate law enforcement and civil society groups about trafficking. The government appointed a national anti-trafficking coordinator responsible for protecting trafficking victims and punishing trafficking offenders. As in previous years, however, Libya did not publicly release any data on investigations or punishment of any trafficking offenses.\nHowever, since 2009 the secret Bani Walid detention camp had been in operation. Here, \"migrants were stored like cargo in compounds, starved, sometimes tortured to death\".\nIn 2011, migrants trying to reach Europe changed from Sinai to Libya: Egyptian security forces pushed traffickers out of Sinai and after the end of the First Libyan Civil War in 2011, which overthrew Muammar Gaddafi, Libya became their new destination.\nIn 2016, the photojournalist Narciso Contreras, with the help of the Carmignac Photojournalism Award, brought back pictures of migrants in detention centres in Libya. The same year, journalists Meron Estefanos and Mirjam Van Reisen conducted interviews with Eritrean refugees who were smuggled to Libya through Sudan. The interviews revealed that many traffickers abducted and tortured some refugees. Furthermore, they revealed that Libyan ISIS cells participated in smuggling and abduction of refugees.\nIn 2017, Fatou Bensouda, chief prosecutor at the International Criminal Court, called Libya \"a marketplace\" for human trafficking, but merely considered, whether to investigate migrant-related crimes in Libya.\nIn 2022, scholars showed that contemporary trafficking from sub-Saharan Africa to Libya could lead to different forms of captivity, such as debt bondage, prison labor, and hostage taking for ransom. While such forms of exploitation have a long history in the region, they were linked with repressive migration policies and state and non-state systems of political control.\n2022 - present\nSince 2022, reports say Libya has a steady, country wide risk of human trafficking, made worse by mass migration from countries like Sudan. This is also due to and its divided government. The US Trafficking in Persons reports for 2024 and 2025 have Libya still labeled as a “Special Case”, because traffickers are rarely punished, migrants are treated as criminals, and there are no effective protections or services for victims. IOM estimates that 800,000 to 900,000 migrants were in Libya in 2024–2025. Many of them were stopped and sent to detention centers. UN and US monitors report that in those centers migrants suffer torture, extortion, sexual violence, and forced labor. Reports record deadly incidents as authorities and IOM reported in March 2024 of mass graves of at least 65 people near Al-Shuwayrif and in February 2025, nearly 50 in Kufra, as well as reports repeated shipwrecks on the eastern coast. In January 2025,Human rights and aid groups condemned the expulsion of at least 613 Nigerian migrants from Libya in convoys to Dirkou, saying that such acts are a wider abuse against migrants and people who survived trafficking.\nProsecution\n, the Government of Libya provided no public information on its law enforcement efforts to punish trafficking in persons, as Libya's laws did not prohibit trafficking for commercial sexual exploitation or forced labor. The government failed to provide data on any criminal investigations, prosecutions, convictions or sentences for trafficking offenses this year, although senior officials noted during the year that Libya prosecuted individuals for confiscating foreign workers' passports until the workers had repaid an alleged and sizeable smuggling 'debt.' Widespread corruption in the country may facilitate trafficking, but the government did not report prosecuting, convicting, or sentencing any official for complicity. In addition, Libya provided in-kind assistance for IOM training of law enforcement officials, including border security and customs, on trafficking.\nIn early 2020, Kidane Zekarias Habtemariam was arrested in Ethiopia, and in February 2021 he managed to escape after months of attempts of bribing.\nProtection\nLibya had taken minimal steps to improve protection of victims of trafficking. The government did not provide protection services such as psychological or legal assistance to victims of trafficking. Libya provided in-kind support to a program that trained over 80 law enforcement officers and civil society activists to medically assist trafficking victims. Recognizing that many government officials still fail to distinguish between trafficking victims in need of protective services and other migrants, the government permitted international organizations access to vulnerable Eritreans, Ethiopians, Somalis, Sudanese, and Iraqis to screen for evidence of trafficking. While trafficking victims remained susceptible to punishment for unlawful acts, such as immigration violations and prostitution, committed as a result of being trafficked, during the reporting period, there were no reports that trafficking victims were deported. The Libyan government does not actively encourage victims to participate in investigations and prosecutions against their traffickers.\nPrevention\n, Libya took no discernible action to prevent trafficking in persons. The government did not conduct any public awareness campaigns to highlight the issue of trafficking in persons. Libya also did not take any measures to reduce the demand for commercial sex acts. Similarly, Libya did not undertake any public awareness campaigns targeting citizens traveling to known child sex tourism destinations abroad.\nSee also\n* Slavery in Libya\nReferences"
    }
  ]
}