{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Mexico\n\nHuman trafficking is the trade of humans, most commonly for the purpose of forced labour, sexual slavery, or commercial sexual exploitation for the trafficker or others. Mexico is a large source, transit, and destination country for victims of human trafficking.\nGovernment and NGO statistics indicate that the magnitude of forced labor surpasses that of forced prostitution in Mexico. Groups considered most vulnerable to human trafficking in Mexico include women, children, indigenous persons, and undocumented migrants. Mexican women, girls, and boys are subjected to sexual servitude within the United States and Mexico, lured by false job offers from poor rural regions to urban, border, and tourist areas. Mexican trafficking victims were also subjected to conditions of forced labor in domestic servitude, street begging, and construction in both the United States and Mexico. U.S. State Department's Office to Monitor and Combat Trafficking in Persons placed the country in \"Tier 2\"  in 2017.\nTypes\nHuman trafficking in Mexico takes many forms, including sex trafficking and labor trafficking. Often, migrants being willingly smuggled are entrapped in one or more of these types of trafficking.\nSex trafficking\nWhile sex work is largely Illegal in Mexico, most cities do have Zonas de Tolerancia, areas where prostitution is allowed. This has made Mexico a destination for sex tourism and one of the world's largest hubs for sex trafficking; It is the largest destination for sex tourism from the United States. Sex work's profitability in Mexico has driven the forced exploitation of many girls as sex workers. Mexico is on the Tier 2 Watch List of the U.S. State Department's 2017 Trafficking in Persons Report, a designation given to countries that do not meet the minimum standards of the Trafficking Victims Protection Reauthorization Act of 2003 (TVPRA), but which are still making efforts to comply with these guidelines, in large part because of its booming child sex trafficking industry; an estimated 16,000 to 20,000 Mexican and Central American children are thought to be victims of sex trafficking in the country Mexico is rated as the second worst country in terms of child prostitution globally as of 2010. Governmental ineffectiveness and rampant corruption have corroded trust in the Mexican government, which is evident in the declining rate of crime reporting in border regions of Mexico.\nLabor trafficking\nMexico is also host to large numbers of persons trafficked for labor purposes, though reliable statistics on their numbers do not exist. Victims are often migrants who engage smugglers voluntarily and are then forced into labor arrangements against their will. Additionally, many of these arrangements take place within the United States rather than within Mexico itself and are thus not necessarily included in Mexican trafficking statistics. Despite this, substantial amounts of trafficked labor, particularly in the form of domestic servitude, are known to be employed within Mexico itself.\nPrevalence\nMexico is one of the global centers of the child prostitution trade and a source and transit country for large numbers of migrants moving northward from Central America. There are an estimated 16,000 to 20,000 Mexican and Central American children who are trafficked for sex in Mexico. However, data on the number of victims of labor trafficking are not available. Additionally, the number of people trafficking into the United States from Mexico is known to vary widely, as do estimates of how many trafficking victims make such crossings.\nThe vast majority of foreign victims in forced labor and sexual servitude in Mexico are from Central America, particularly Guatemala, Honduras, and El Salvador; many transit Mexico en route to the United States and, to a lesser extent, Canada and Western Europe. However, trafficking victims from South America, the Caribbean, Eastern Europe, Asia, and Africa are also found in Mexico, and some transit the country en route to the United States. Unaccompanied Central American minors, traveling through Mexico to meet family members in the United States, fall victim to human traffickers, particularly near the Guatemalan border. Mexican men and boys from Southern Mexico are found in conditions of forced labor in Northern Mexico, and Central Americans, especially Guatemalans, are subjected to forced labor in southern Mexico, particularly in agriculture. Child sex tourism continues to grow in Mexico, especially in tourist areas such as Acapulco and Cancún, and northern border cities like Tijuana and Ciudad Juárez.\nBetween 2000 and 2002, approximately 135,000 children in Mexico were kidnapped, presumably for exploitation in prostitution, pornography, or illegal adoption trafficking. It is estimated that there are around 16,000 children engaged in prostitution in Mexico as of 2004.\nStructural causes\nPoverty\nMexico is characterized by persistent and extreme income inequality and high rates of poverty. These inequalities, and poverty in particular, can increase trafficking in several ways. Poverty often drives families to make decisions out of desperation and lack of education. For example, in the case of Mexico parents are especially likely to leave their families to go work in the United States and may become victims of traffickers. Furthermore, many victims of trafficking, especially in the case of sex trafficking, are not fluent in the language of their destination country and are limited in their ability to escape their situation. In addition, victims often accept their positions because they feel that this is the only way that they may send some remittances to their family and their present situations may in some cases still be better than their original impoverished and desperate state. In this manner, poverty can both drive trafficking and prevent its victims from escaping it once they have been trafficked.\nGlobalization\nThe rate of human trafficking has directly increased in correlation with globalization. Globalization has increased cross-border trade and the demand for cheap labor; however, migration policies of the U.S. and other countries have not changed with the level of demand for cheap labor, thus forcing people illegally to immigrate. Illegal immigration then creates ideal conditions for organized criminal operations to form trafficking circles. With increased trade of foreign goods to rural areas, import competition in the rural markets has also forced people in poor areas to migrate to industrialized economies for better livelihoods. Their desperate positions often make them subject to exploitation and trafficking into different forms of forced labor to support that economy. Lastly, the technological advances that go hand in hand with globalization have facilitated the ease with which organized crime circles may conduct trafficking operations.\nSexual assault\nDuring the Central American civil wars throughout the 1980s, widespread sexual assaults of indigenous women were carried out, contributing greatly to the creation of the Mexican sex trafficking industry. Both police and army personnel raped and assaulted several thousand poor, generally rural women during the El Salvadorean and Nicaraguan civil wars. Many of these women were shamed by their communities and families and chose to migrate to Mexico, leading to a boom in sex trafficking. As of 2014, this pattern of marginalization through sexual assault was still widespread.\nThe effect of conflict and ensuing assault on the development of the sex trade is domestic to Mexico as well as foreign. Internal conflict between organized crime and police forces and the military has historically led to unusually high levels of instability in some areas of Mexico, most notably in the case of the Chiapas Conflict. Similarly to the Central American civil wars, the sexual violence that accompanied this conflict drove many shunned women to turn to sex work and helped jump-start the sex trade in those regions of Mexico.\nAnti-trafficking laws and policies\nMexico ratified the United Nations Convention Against Transnational Organized Crime (or Palermo Convention) on April 11, 2003. The Convention includes a \"Protocol Against the Smuggling of Migrants by Land, Sea, and Air\" and a \"Protocol to Suppress, Prevent, and Punish Trafficking in Persons, Especially Women and Children\". The Congress of Mexico passed a law on human trafficking in 2007 after which the Federal District and all of the states passed anti-trafficking measures themselves. In an attempt to harmonize the varied penal codes on the subject of human trafficking, the government passed a new anti-trafficking law in 2012 that criminalized all participants in the act of trafficking (including consumers) and unified local laws. The law was further reformed in 2014. To address the demand for forced labor, the Secretary of Labor and Social Welfare developed a series of workshops and training in 2010 to prevent child labor and trafficking for forced labor. It included media materials that explain how labor recruiting agents can deceive individuals to recruit them for forced labor. However, while Mexican officials recognize human trafficking as a serious problem, NGOs and government representatives report that some local officials tolerate and are sometimes complicit in trafficking, impeding the implementation of anti-trafficking statutes. Mexico has publicly endorsed the United Nations Office on Drugs and Crime's Blue Heart Campaign against Human Trafficking, becoming the first country in Latin America to do so.\nTrafficking across the border with the United States\nA third of the people annually trafficked into the United States are from Latin America, and the vast majority of these people enter the US through the Mexico–United States border. This extremely porous border has historically been the site of one of the most protracted labor migrations in the world and is North America's largest transit site for young children exploited in labor and sex trafficking as of 2011. Texas is a particularly important transit site for domestic trafficking; around twenty percent of domestic trafficking victims pass through the state at some point on their journeys.\n\"Coyote\" is the colloquial term used to refer to migrant smugglers along the Mexico–United States border. In the past, the coyote-migrant relationship ended once the smuggler delivered the migrant to the U.S. However, it has become increasingly commonplace for coyotes to coerce migrants into exploitative labor arrangements upon reaching their destination in the U.S (frequently a different one from that which they paid to be smuggled to). These labor agreements frequently involve forced agricultural labor and/or sex work, conditions that migrants would never have consented to had they been previously aware of them. Coyotes use unpaid debt as a threat to force migrants into such arrangements. The rising costs of smuggling, as a result of increased border security and enforcement, have made it far more common for migrants to become heavily indebted to smugglers. Additionally, the expansion of the coyote's role to include transporting migrants to a final destination within the U.S., rather than simply transporting them across the border, incurs additional expenses that the migrant must pay, and so increases the likelihood of their being exploited and trafficked by the coyotes as forced laborers or sex workers.\nSmugglers sometimes pretend to offer reduced fees to women and child migrants and then sexually assault or rape them as a form of substitute \"payment\". Human traffickers masquerading as coyotes often use false promises of guaranteed jobs to lure migrants, and will sometimes kidnap women and children along the journey, either for ransom from their families or to be sold in the US into servitude or prostitution. Many unaccompanied children also make the crossing from Mexico to the U.S. Unaccompanied minors are sometimes sold into prostitution by the trafficker, and their families are falsely led to believe that they died during transit.\nWithin the United States, the Victims of Trafficking and Violence Protection Act of 2000 serves as a legal framework within which many perpetrators of trafficking are tried, but victims of trafficking are generally punished on equal footing with perpetrators if intercepted during the process of entering the country.\nSee also\n* Human rights in Mexico\n* International child abduction in Mexico\nReferences"
    }
  ]
}