{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Namibia\n\nThe following describes the state and history of human trafficking in Namibia.\nOverview\nIn 2009, Namibia was identified as a country of origin, transit, and destination for human trafficking. Both Namibian and foreign women and children—possibly men as well—were subjected to forced labor and forced prostitution. Traffickers exploited Namibian children and children from neighboring Angola and Zambia in various forms of forced labor, including agriculture, cattle herding, involuntary domestic servitude, charcoal production, and commercial sexual exploitation. Some Namibian parents unwittingly sold their children to traffickers, while truck drivers were reported to recruit Namibian children for forced prostitution in Angola and South Africa. There was also evidence that traffickers moved Namibian women to South Africa and brought South African women to Namibia for forced prostitution. The most vulnerable populations included Namibian women and children from rural areas, particularly orphans, who were lured to urban centers and commercial farms with false promises of legitimate employment and fair wages that they never received. Victims often faced long working hours, hazardous tasks, and physical abuse, including beatings and sexual violence. Some small business owners and farmers were also implicated in trafficking crimes.\nGovernment Response and Legal Framework\nThe Government of Namibia did not fully comply with the minimum standards for eliminating trafficking in 2009 but made significant efforts to address the issue. Actions taken included:\n* Creating a national database on gender-based violence, which included statistics on trafficking and child labor victims.\n* Cooperating in a baseline study to assess the scope of human trafficking in Namibia.\n* Investigating child labor cases and rescuing child victims.\n* Renovating buildings for use as shelters for trafficking victims.\nHowever, no suspected traffickers were prosecuted, and those involved in forced child labor received insufficient punishments.\nNamibia ratified the 2000 UN TIP Protocol in August 2002. The U.S. State Department placed Namibia in \"Tier 2\" in its annual Trafficking in Persons Report in both 2017 and 2023. Additionally, the Organized Crime Index scored Namibia 3.5 out of 10 in 2023 for human trafficking, with the crime concentrated in Windhoek and Walvis Bay.\nLaw Enforcement Efforts\nIn 2009, the Namibian government enacted the Prevention of Organized Crime Act (POCA) of 2004, which criminalized all forms of trafficking. Under POCA:\n* Traffickers and those who aid them could face fines up to $133,000 and imprisonment of up to 50 years.\n* The law did not distinguish between trafficking for sexual and non-sexual purposes.\nAdditional legal provisions included:\n* The Labor Act of 2007, which prohibited forced labor and exploitative child labor, with penalties of up to four years’ imprisonment or fines up to $2,700.\n* The draft Child Care and Protection Bill, expected to address child trafficking.\n* Efforts with the Southern African Development Community (SADC) to develop regional anti-trafficking legislation.\nDespite these legal frameworks, the government did not open any criminal investigations or prosecute traffickers in 2009. Instead, child labor cases were addressed through compliance orders rather than arrests. The Ministry of Labor removed 17 children working in hazardous conditions on farms in Kavango and returned them to their parents. A toll-free hotline was also operated for trafficking-related tips.\nVictim Protection and Support Services\nThe government increased efforts to protect trafficking victims in 2009 but lacked the financial resources and infrastructure for direct victim care. Key efforts included:\n* Identifying and rescuing 17 children from illegal charcoal work, 88 children from hazardous labor, and 57 children from forced labor.\n* Handling three trafficking cases involving:\n** Zambian boys trafficked by a Zambian trafficker.\n** A girl from Walvis Bay forced into prostitution by her mother.\n** Namibian girls from Kavango and possibly the Caprivi region trafficked to wine farms for forced labor.\nChallenges in victim support included:\n* Lack of formal referral procedures for trafficking victims.\n* Limited shelter facilities, with renovations underway for 13 government-owned buildings for gender-based violence and trafficking victims. However, these shelters were unlikely to accommodate male victims.\n* The Woman and Child Protection Unit (WACPU) provided trauma treatment in hospitals and worked with NGOs to offer counseling and legal services.\n* The Namibian legal system offered protection for victims willing to testify, as well as alternatives to deportation for foreign victims.\nDespite these efforts, law enforcement and government officials lacked a clear understanding of human trafficking, leading to possible misidentification of victims as criminals, particularly in cases related to immigration and prostitution.\nAwareness\nDuring 2009, Namibia increased public awareness of human trafficking through a media campaign against gender-based violence and trafficking, encouraging people to report suspected offenders and assist investigations. However:\n* Fewer WACPU and MGECW officials received training in identifying trafficking victims compared to previous years.\n* Diplomats did not receive specific training on assisting Namibian trafficking victims abroad but were encouraged to maintain ties with NGOs monitoring trafficking issues.\n* The Ministry of Home Affairs, in partnership with UNICEF, opened offices at hospitals and deployed mobile units to provide birth certificates for newborns and identity documents for orphans and vulnerable children.\n* No substantial efforts were made to reduce demand for commercial sex acts.\nReferences"
    }
  ]
}