{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Ukraine\n\n}}\nIn 2008, Ukraine was a source, transit, and destination country for men, women, and children trafficked transnationally for the purposes of commercial sexual exploitation and forced labor.\nUkrainian women were trafficked to Russia, Poland, the Czech Republic, Turkey, Austria, Germany, United Kingdom, the United States, Italy, Denmark, the United Arab Emirates, Kazakhstan, Greece, Sweden, Spain, Croatia, Hungary, Slovak Republic, Cyprus, Netherlands, Belarus, Japan, Norway, South Korea, and Bahrain. The majority of Ukrainian labor trafficking victims were men exploited in Russia, the Czech Republic and Poland, primarily forced to work as construction laborers, sailors, and factory and agriculture workers.\nThere were indications Ukraine is a destination for people from neighboring countries trafficked for forced labor and sexual exploitation. In addition, trafficking occurred within Ukraine; men and women were trafficked within the country for the purposes of labor exploitation in the agriculture and service sectors, commercial sexual exploitation, and forced begging. Ukrainian children were trafficked both internally and transnationally for commercial sexual exploitation, forced begging, and involuntary servitude in the agriculture industry. An IOM survey released in December 2006 concluded that since 1991, approximately 117,000 Ukrainians had been forced into exploitative situations in Europe, the Middle East, and Russia.\nIn 2008 the Government of Ukraine did not fully comply with the minimum standards for the elimination of trafficking; however, it was making significant efforts to do so. While there was little evidence of efforts to curb trafficking complicity of government officials and of concrete steps to protect and assist trafficking victims at the national level, local governments made some progress on victim assistance. The government also made modest, but tangible, progress in improving the punishment of convicted traffickers, prosecuting labor trafficking, training the judiciary, and carrying out prevention activities.\nThe U.S. State Department's Office to Monitor and Combat Trafficking in Persons placed the country in \"Tier 2\"  in 2017 and 2023.\nIn 2023, the Organised Crime Index gave the country a score of 7.5 out of 10 for human trafficking.\nProsecution (2008)\nIn 2006, Ukraine made progress in prosecuting and punishing trafficking offenses. The government prohibits all forms of trafficking through Article 149 of its Criminal Code, which prescribes penalties that are sufficiently stringent and commensurate with those prescribed for other grave crimes, such as rape. This year, the government completed 82 criminal investigations and arrested 56 people on trafficking charges. The Interior Ministry reported that the number of prosecutions for labor trafficking increased from 3 in 2006 to 23 in 2007.\nOverall, the government prosecuted 95 cases resulting in 83 convictions of trafficking offenders under Article 149. Of the total number of persons convicted, 59 were placed on probation and not subjected to imprisonment. In June 2007, the Prosecutor General ordered prosecutors to take a more aggressive posture with regard to sentencing convicted trafficking offenders and to appeal every case in which a judge ordered probation rather than jail time. As a result, during the second half of 2007, the share of convicted trafficking offenders receiving jail time rose to 44 percent, up from 36 percent during the first half of the year.\nDespite widespread reports of trafficking-related corruption, Ukraine failed to demonstrate any efforts to vigorously investigate, prosecute, convict, or sentence government officials complicit in trafficking this year. The government financed regular, formal training seminars for Interior Ministry anti-trafficking officers throughout Ukraine. The Ukrainian Academy of Judges and the Academy of Prosecutors, with sponsorship from the Organization for Security and Co-operation in Europe (OSCE), participated in eight seminars for 203 judges and prosecutors from around the country on victim related issues and sensitivity training for trafficking-related cases. The government cooperates with other governments on anti-trafficking law enforcement efforts but acknowledged the need to simplify procedures for mutual legal assistance between Ukraine and trafficking destination countries.\nProtection (2008)\nUkraine's prevention efforts remained heavily reliant on international donor funding. Law enforcement agencies referred 456 victims to NGOs for assistance. Through donor-sponsored programs and some government services, foreign and domestic victims of trafficking in Ukraine receive shelter, medical, psychological, legal, and job placement assistance. The national government did not increase funding for victims, and there has been uneven support offered by local governments. The Kherson regional government allocated $20,170 to anti-trafficking activities including support of a reintegration center; however, the trafficking victim shelter in Lutsk is on the verge of being closed due to lack of government support.\nUkraine does not punish  victims for unlawful acts committed as a direct result of being trafficked, but sex trafficking victims' rights are incorrectly characterized as \"willing prostitutes\" and denied confidentiality. Although more victims are reportedly willing to participate in investigations against their traffickers, a weak witness protection system and a bias against sex trafficking victims still discourage many from testifying in court. Courts in the Ivano-Frankivsk region are implementing a pilot program to develop a modern witness protection program. The government does not provide foreign victims with legal alternatives to removal to countries in which they may face hardship or retribution.\nPrevention (2008)\nThe government made progress in preventing trafficking in persons during the reporting period. In 2007, the government broadcast a public service announcement on television entitled “Do not look at employment abroad through rose-colored glasses” throughout Ukraine and ran a parallel billboard campaign. The national government spent approximately $53,465 for printing and distributing materials for raising awareness, and local governments made additional contributions to prevention activities. The government did not undertake any prevention efforts directed at reducing demand for commercial sex acts.\nFor the past three years, Ukraine's National Academy of Defense has conducted, jointly with the International Organization for Migration (IOM), anti-trafficking classes for Ukrainian troops being deployed for international peacekeeping duties. During the reporting period, the Ministry of Interior worked with Interpol to prevent known child sex tourism offenders from entering Ukraine.\nSupport providers\nNASHI, a Saskatoon, Saskatchewan, Canada-based organisation that opposes human trafficking by raising awareness through education, established a vocational school in Lviv, Ukraine to teach girls and women carpentry, sewing, information processing, and cooking so they won't become trapped in Ukraine's human trafficking network. NASHI also founded the Maple Leaf Centre, a resource centre and shelter in Ukraine for young people who are at risk of being trafficked.\nSocial Services departments of many Ukrainian oblasts have begun to cooperate with families and non-profit organizations to create \"Family Type Homes\" or \"DBST\"s in Ukrainian. Understanding that a family dynamic creates much more stability and opportunity for at-risk children, a shift toward family institutions is in progress.  Organizations like [http://www.o-dim.com/en/ \"Father's House\"] and [http://www.mannafreedom.com/ \"MANNA Worldwide\"] are working vigorously to provide loving family environments for these vulnerable kids.\nRussian invasion of Ukraine\nDuring the 2022 refugee crisis stemming from the Russian invasion, numerous cases of human traffickers targeting women and children were reported. The UN Refugee Agency has recognized many refugees fleeing to borders find themselves in a state of extreme danger, vulnerable and exposed to predators whose main purpose is exploitation. Gillian Triggs, UNHCR’s Assistant High Commissioner for Protection acknowledges that \"National authorities are actively leading the response to counter human trafficking, but more needs to be done to tackle this problem and mitigate risks.\" Since women are at the highest risk and the most susceptible the UNHCR is \"on high alert and warning refugees on the risks of predators and criminal networks who may attempt to exploit their vulnerability or lure them with promises of free transport, accommodation, employment or other forms of assistance.\"\nIn 2022 there are reports of Ukrainian women and children being trafficked to the UAE.\nSee also\n*Human rights in Ukraine\n*Human trafficking in Europe\n*Sex tourism in Ukraine\n*Violence against women in Ukraine\nReferences"
    }
  ]
}