{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Houston, Texas__disambig_1\n\nThe prevalence of Human trafficking in Houston, Texas is the worst of any U.S. city. Between 2007 and 2016 the city ranked first for reported trafficking cases, while in 2019 the number of cases nearly doubled compared to the previous three years, despite Mayoral initiatives, due to the highly organized nature of this criminal business.\nStatistics\nMany studies have been conducted to gather data about human trafficking in Houston. In 2006, 25% of trafficking victims rescued in Texas came from Houston. In 2010, individuals were asked to estimate how informed they think Houston's general public is about human trafficking in the city, with 33.3% of responders saying people have no knowledge about the subject, 54.8% having little to no knowledge, and 11.9% saying people have some knowledge. A measure of data used to understand the human trafficking industry is the cost of risk to traffickers. The higher the cost of risk for traffickers and consumers means the less likely a trafficking ring will successfully operate in that region. Houston has a $66.85 cost of risk for traffickers, which is 6 times lower than the neighboring county McLennan's cost of risk for traffickers, $441.05. In 2019, data only from online advertisements was used to estimate 14,539 trafficked individuals in Houston.\nTypes of trafficking\nThe industries in Texas that are most involved in trafficking are \"hotels, restaurants, factories, farms, child care, massage parlors, health care, and sexually oriented businesses\". These industries are connected to two popular forms of human trafficking in Houston, labor trafficking and sex trafficking.\nSex trafficking\nThe governmental Office of Justice programs defines sex trafficking as \"a form of human trafficking for the purpose of sexual exploitation\". Scholars and activists have recognized Illicit Massage Businesses (IMBs) as cover ups for sex trafficking. In Houston, 292 IMBs have all together had an average of 2,869 customers daily between noon and 2:00pm The Offshore Technology Conference is an annual event where more than 31,000 people meet in Houston's NRG Park. This convention brings a spike to sex trafficking every year because of the increase in demand for sexual services, and has led to police making \"hundreds of arrests\" relating to trafficking in 2017 and 2018. Another area with a reputation for prostitution and human trafficking is \"The Track\" or Bissonnet. In 2021, investigative reporter Robert Arnold reported that this 1.5-mile stretch is shown in YouTube videos as well as being mentioned in the Wikipedia article \"List of red-light districts\" because of prostitution activity. Bissonnet Track even held the title of being the top prostitution spot in 2017. The Sweet 16 Agreement was made in 2013, where the 16 strip clubs in on the settlement would donate one million dollars annually to Human Trafficking Houston Police Department Vice Squads in exchange for disregarding the 3-foot rule, distance between schools, and topless regulations for dancers at these clubs. According to data from a Houston based study, 77% of those who left working at strip clubs through the help of Rescue America (non-profit organization) 77% were underage, and 85% were working at these clubs because they were working under a trafficker or pimp. Occurrences of sex trafficking in Houston strip clubs has continued to be evident, with 3 men sentenced after smuggling women from Cuba and forcing them to work at clubs in the Houston area.\nLabor trafficking\nLabor trafficking, although may overlap with sex trafficking in terms of forced labor, has its own circle of issues. Labor trafficking is defined in short as \"exploitation of an individual for financial gain\" by the governmental Office of Justice programs. According to a spokesperson from United Against Human Trafficking, a Houston-based organization, the number of labor trafficking victims is much greater than the number of sex trafficking victims, however is not talked about as much and is not identified as easily as sex trafficking is. Labor trafficking in Houston will involve the exploited labor of undocumented immigrants, and according to the Houston Police Department, this usually take place at sweatshops, massage parlors, agriculture, restaurants, hotels, and domestic service. Interviews of immigrant day laborers were conducted in 2016 to Houston's \"labor-related exploitation\", concluding in 64% of interviewees reporting being trafficked. In 2014, two businesses in Houston's Chinatown were suspected of transporting hundreds of immigrants from Central America to Chinese restaurants, resulting in charging 32 suspects and arresting 44 individuals. A couple in Houston was arrested in 2016 for forcing a woman they lured from Nigeria to work 20+ hours a day as their nanny while holding onto her passport.\nCauses\nHouston's close-proximity to the Mexico–United States border, land and water ports, major highways, and diverse population and economy plays a role in the human trafficking issue due to the high demand for inexpensive labor and sex-related services.\nLocation\nThe I-10 highway connects Houston to other major cities, making it an \"internal circuit\" where traffickers move victims throughout countries, making it the United States' main human trafficking route. Major highways used to smuggle women, men, and children from the border have often lead to \"stash houses\" in Houston. Interstate highways and a close proximity to the border makes it easier for traffickers to access different markets and avoid legal investigations. The short distance from the US-Mexico border to Houston makes legal and illegal immigrants a big target for human trafficking because of their need for employment opportunities or passage to the United States, making Houston a \"popular entry point\".Ngwe, J. E., & Elechi, O. O. (2012). HUMAN TRAFFICKING: THE MODERN DAY SLAVERY OF THE 21st CENTURY. African Journal of Criminology and Justice Studies, 6(1–2), 103+.  Houston's Gulf Coast port makes up 73% of the national's Gulf Coast traffic, due to the 200 facilities in Houston's ship channels. It has been known that there is a chance of ships traveling through international waters carrying or transporting victims of human trafficking, so with Houston's active seaports in mind, this information supports the idea of ports playing a role in Houston's title as a major \"human trafficking hub\".\nPopulation factors\nResearch has indicated that individuals with a \"lack in opportunities\" make them vulnerable to trafficking. Homelessness, from voluntary or forced actions, is a risk factor that makes an individual susceptible to trafficking,Houston-Kolnik, J. D., Soibatian, C., & Shattell, M. M. (2020). Advocates’ Experiences With Media and the Impact of Media on Human Trafficking Advocacy. Journal of Interpersonal Violence, 35(5-6), 1108-1132.  and according to a YMCA report, about 6,000 people runaway from their home yearly in Houston. The Polaris Project conducted a survey to figure out what kept victims from leaving their \"trafficking situation\", and had 64% of their responders answer with their \"lack in affordable housing\". This explains traffickers tactics of luring victims by providing housing in apartment complexes across Houston and why the homeless population of about 3,223 in Houston is a group most at risk of trafficking. Another contributor to high trafficking activity in Houston is the amount of undocumented immigrants,Farrell, A., McDevitt, J. and Fahy, S. (2010), Where are all the victims?. Criminology & Public Policy, 9: 211.  since traffickers use their illegal passage as leverage to exploit them. About 100,000 undocumented immigrants reside in Houston, making another portion of Houston's population at risk of trafficking.Rodriguez, N. P. (1987). Undocumented Central Americans in Houston: Diverse Populations. International Migration Review, 21(1), 4-26.  Houston has a very diverse population, ranking 4th out of all cities in the U.S. in 2023. This contributes to high trafficking risks because victims are able to blend and be hidden more easily in a more diverse population, especially when the population of 6 million people is constantly growing.\nCountermeasures\nLegislation\nHouston applies the Texas Penal Code § 20A, or the Trafficking of Person's law, allows police to make an arrest if they suspect any involvement human trafficking related activities, and was amended in both the 86th Texas Legislature (2019) and 88th Texas Legislature (2023). This law addresses adult sex and labor, and child sex and labor trafficking, and results in 2–20 years in prison if the victim is or over 18, and 5–99 years if the victim is under 18. Healthcare workers or people who interact with patients in Houston must take a mandatory \"prevention course on human trafficking\" because of the Texas House Bill 2059.Ladd M, Jones EB. Texas Human Trafficking. [Updated 2022 Nov 26]. In: StatPearls [Internet]. Treasure Island (FL): StatPearls Publishing; 2023 Jan-. Available from:  The Texas House Bill 1121 is responsible for creating the Texas Human Trafficking Prevention Task Force who implemented required trafficking trainings for educators in cities throughout Texas. The White House awarded Houston the Presidential Award in 2018 for being a \"national model for building anti-trafficking infrastructure at the municipal level\". An example of municipal effort to combat trafficking is Houston's \"Ten Municipal Fellowship\", a two-day program where solutions to trafficking were tracked in the 18 cities that participated. Houston is a part of CEASE, a collaborative initiative of cities committed to reduce sex trafficking by comparing how the same issue is addressed in cities with high sex trafficking activity.Benton, Francis, et al. \"Don't Mess With Texas: Responses Towards Human Trafficking in the Lone Star State.\" In Handbook of Research on Present and Future Paradigms in Human Trafficking, edited by Essien D. Essien, 43-63. Hershey, PA: IGI Global, 2022.  Houston was also the first of the major U.S. cities to implement anti-trafficking pieces of legislation. This includes that hotels in the Houston area will need to conduct anti-trafficking trainings for employees. Although the Houston Police Department covers most human trafficking cases in Houston, other agencies such as the Harris County Sheriff’s Office, Houston Independent School District Police Department (and the police departments at other Houston school districts), and Harris County Constable’s Office are also allowed to intervene in cases around the Houston Area.\nOrganizations\nOrganizations have been making efforts to end the issue of trafficking in the Houston area by reaching out to communities. This includes the work of non-profits and/or Government funded groups.\n* Baylor College of Medicine Program: A \"hospital-based program\" created by city officials to better care for trafficking victims and provide the necessary resources which will help others to leave the life forced upon them.\n* Houston Rescue and Restore Coalition: Organization of 30 local non-profits and individuals who are bringing awareness to human trafficking in Houston since 2005.\n* Human Trafficking Rescue Alliance Task Force (HTRA): Initiative that involves both social workers and law enforcement who have rescued 200 victims of trafficking in nine out of the ten counties in the Houston Area since its founding in 2005.\n* Children at Risk: Leads an educational approach to human trafficking awareness in Houston, such as presentations and bus tours.\n* Tahirih Justice Center: A national organization, with an office in Houston, that uses federal and local advocacy to support trafficking victims in and out of the justice system.\n* United Against Human Trafficking: A networking organization that brings other anti-human trafficking organizations in Houston together to empower victims and inform the community to prevent further exploitation.\n* Free The Captives Houston: Christian-based non-profit that provides resources and assistance for victims, while cooperating with law enforcement to rescue those trafficked.\nReferences"
    }
  ]
}