{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Niger\n\nIn 2009, Niger was a source, transit, and destination country for children and women subjected to trafficking in persons, specifically forced labor and forced prostitution. Caste-based slavery practices, rooted in ancestral master-slave relationships, continued primarily in the northern part of the country. Children are trafficked within Niger for forced begging by religious instructors known as marabouts; forced labor in gold mines, agriculture, and stone quarries; as well as for involuntary domestic servitude and forced prostitution. The ILO estimates at least 10,000 children work in gold mines in Niger, many of whom may have been forced to work. Nigerien children, primarily girls, were also subjected to commercial sexual exploitation along the border with Nigeria, particularly in the towns of Birni N'Konni and Zinder along the main highway, and boys are trafficked to Nigeria and Mali for forced begging and manual labor. There were reports Nigerien girls entered into \"false marriages\" with citizens of Nigeria, Saudi Arabia, and the United Arab Emirates: upon arrival in these countries, the girls are often forced into involuntary domestic servitude. Child marriage was a problem, especially in rural areas, and may have contributed to conditions of human trafficking. Niger is a transit country for women and children from Benin, Burkina Faso, Gabon, Ghana, Mali, Nigeria, and Togo en route to Northern Africa and Western Europe; some may be subjected to forced labor in Niger as domestic servants, forced laborers in mines and on farms, and as mechanics and welders. To a lesser extent, Nigerien women and children were sometimes trafficked from Niger to North Africa (even if \"very few people are involved in human trafficking through the Sahara,) the Middle East, and Europe for involuntary domestic servitude and forced commercial sexual exploitation.\"\nIn 2009, the Government of Niger did not fully comply with the minimum standards for the elimination of trafficking; however, it is making significant efforts to do so. Despite these efforts, including two convictions for traditional slavery offenses, the Nigerien government lagged in enforcing sentences and in providing victim assistance, particularly to victims of traditional slavery, during 2009.\nThe country ratified the 2000 UN TIP Protocol in September 2004.\nThe U.S. State Department's Office to Monitor and Combat Trafficking in Persons placed the country in \"Tier 2 Watchlist\"  in 2017. By 2023 it had moved to Tier 2.\nIn 2023, the Organised Crime Index gave Niger a score of 7.5 out of 10 for human trafficking.\nProsecution (2009)\nThe Government of Niger demonstrated improved but limited law enforcement efforts to address child trafficking and traditional slavery. Niger prohibits slavery through a 2003 amendment to Article 270 of its penal code, and prohibits forced and compulsory labor through Article 4 of its labor code. Penal code Articles 292 and 293 prohibit procurement of a child for prostitution, and Article 181 prohibits encouraging child begging or profiting from child begging. Niger does not, however, prohibit other forms of trafficking, such as forced prostitution of adults. The prescribed penalty of 10 to 30 years' imprisonment for slavery offenses is sufficiently stringent. The penalty prescribed for forced labor, a fine ranging from $48 to $598 and from six days to one month's imprisonment, is not. The lack of clear anti-trafficking legislation impeded law enforcement efforts: a draft law prohibiting human trafficking written in 2007 remained pending.\nIn the last year, law enforcement authorities arrested several individuals suspected of trafficking children: two suspects were released without being charged, and others were charged with the abduction of minors. In one case, police and prosecutors rescued 78 trafficked children, but made no arrests because the children had been sent by their families to look for work. Marabouts arrested for exploiting children for economic purposes were released after their pretrial custody. Two alleged trafficking offenders arrested for recruiting six girls and two boys for a prostitution ring in Nigeria were released after serving two months in jail; it is unclear whether this was imprisonment imposed post-conviction or was pretrial detention. In November 2009, the Tribunal of N'Guigmi sentenced a man to five years' imprisonment in addition to a fine of $20,000 in damages to the victim and $2,000 both to the government and an anti-slavery NGO. The defendant was found guilty of maintaining the victim as a slave in his village: at the year's end, the defendant had not appealed the sentence and had not paid the amounts ordered by the court.\nThere were further developments in the slavery case of Hadidjtou Mani Koraou vs. Souleymane Naroua. In October 2008, the ECOWAS Court of Justice ruled the Government of Niger had failed to protect the victim, a former slave, and ordered damages in the amount of $20,000. In July 2009, a local Nigerien court convicted and sentenced the defendant to a two-year suspended prison term, and ordered him to pay $2,000 in damages to the woman he had enslaved and $1,000 to the Government of Niger. The defendant complained the sentence was excessive and filed an appeal before the Court of Appeals of Niamey: the same day, a human rights NGO also appealed before the same court, claiming the sentence against the trafficking offender was not sufficiently stringent. No date has been set for hearings, and the status of seven other women - who reportedly remained enslaved by the trafficking offender after the complaining victim's escape - is unknown. The whereabouts of the victim's two children, who were also enslaved by the trafficking offender, is also unknown. There were no reported developments in the 2006 slavery case Midi Ajinalher vs. Hamad Alamine.\nNigerien authorities collaborated with Malian, Togolese, and Nigerian officials in human trafficking investigations, and transferred one suspected trafficker to the custody of Interpol. A local NGO trained 30 law enforcement officers in identifying and assisting trafficking victims. There is no evidence Nigerien officials were complicit in human trafficking crimes.\nProtection (2009)\nThe Government of Niger demonstrated limited efforts to provide care to child trafficking victims and victims of traditional slavery practices. Authorities identified child trafficking victims in partnership with NGOs and international organizations, but did not report efforts to proactively identify victims of traditional slavery practices. The Ministry of the Interior continued to operate a program to welcome and provide temporary shelter - for about one week - to repatriated Nigeriens, some of whom may be trafficking victims. While ministry officials interviewed these citizens to assist with their reintegration, they did not attempt to identify trafficking victims among them. Due to lack of resources, the government did not operate its own victim shelter, but refers child trafficking victims to NGO's for assistance. While the government lacked a formal system for identification and referral of trafficking victims, authorities referred trafficking victims to NGOs for care on an ad hoc basis. In Agadez, local authorities partnered with UNICEF and a local NGO to rescue and assist 78 exploited children. In partnership with another local NGO working in Makalondi and Niamey and international organizations, authorities rescued, rehabilitated, and returned to their families 141 exploited children. Out of these 219 children assisted by these two NGOs in 2009, 138 were Nigerien, and the remaining 77 children were from neighboring countries. During the previous year, authorities and NGOs reported assisting 81 child trafficking victims.\nDuring the year, government officials reported no efforts to assist individuals subjected to traditional slavery practices, compared with providing assistance to 40 such victims during the previous reporting period. The government provided some basic health care to child trafficking victims and assisted in returning them to their home villages. Authorities encouraged trafficking victims to participate in investigations and prosecutions, and NGOs assisted victims in filing lawsuits and seeking legal action. The government did not provide legal alternatives to the removal of foreign victims to countries where they face hardship or retribution. Identified victims were not inappropriately incarcerated or fined for unlawful acts committed as a direct result of being trafficked.\nPrevention (2009)\nThe Government of Niger made limited efforts to prevent human trafficking through campaigns to educate the public about child trafficking during the reporting period. The government forged partnerships with NGOs and international organizations, and officials attended workshops and training sessions organized by these entities. During the reporting period, authorities supported a group of local NGOs and associations in organizing a conference on trafficking and exploitation. A multi-agency anti-trafficking commission and a national commission against forced labor and discrimination existed on paper, but were not fully operational. In 2008, the government partnered with UNICEF to establish regional committees to prevent child trafficking, although the outcome and actions of these committees remained unclear. A 2006 draft anti-trafficking agreement between Niger and Nigeria remained unsigned. The Nigerien government did not take measures to reduce demand for commercial sex acts during the year. Authorities did not report providing Nigerien troops deployed abroad as part of international peacekeeping missions with human trafficking awareness training prior to deployment.\nSee also\n*Human rights in Niger\n*Slavery in Niger\nReferences"
    }
  ]
}