{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Qatar\n\nIn 2009 Qatar was a transit and destination country for men and women subjected to trafficking in persons, specifically forced labor and, to a much lesser extent, forced prostitution. Men and women from Nepal, India, Pakistan, Bangladesh, the Philippines, Indonesia, Vietnam, Sri Lanka, Ethiopia, Sudan, Thailand, Egypt, Syria, Jordan, and China voluntarily traveled to Qatar as laborers and domestic servants, but some subsequently faced conditions indicative of involuntary servitude. These conditions included threats of serious physical or financial harm; job switching; the withholding of pay; charging workers for benefits for which the employer is responsible; restrictions on freedom of movement, including the confiscation of passports and travel documents and the withholding of exit permits; arbitrary detention; threats of legal action and deportation; false charges; and physical, mental, and sexual abuse. In some cases, arriving migrant workers found that the terms of employment in Qatar were wholly different from those they agreed to in their home countries. Individuals employed as domestic servants were particularly vulnerable to trafficking since they are not covered under the provisions of the labor law. A small number of foreign workers transited Qatar and were forced to work on farms in Saudi Arabia. Qatar was also a destination for women who migrated and became involved in prostitution, but the extent to which these women were subjected to forced prostitution is unknown. Children have been used in Qatar and other Gulf countries as camel jockies. Most children are trafficked from Africa and South Asia. This practice has ceased in most areas though. Workers have been forced to work in bad conditions; their salaries are sometimes withheld.\nThe Government of Qatar does not fully comply with the minimum standards for the elimination of trafficking; however, it is making significant efforts to do so. The government took steps to implement its sponsorship law, including through the granting of an exit permit to one migrant laborer without permission from his sponsor. Although the government has not yet enacted necessary anti-trafficking legislation, during the reporting period it reaffirmed its commitment to this goal over the next year. Despite these efforts, the government did not show evidence of overall progress in prosecuting and punishing trafficking offenders and identifying victims of trafficking.\nThe U.S. State Department's Office to Monitor and Combat Trafficking in Persons placed the country in \"Tier 2\"  in 2017 and in 2023.\nIn 2023 the Organized Crime Index gave Qatar a score of 8 out of 10 for human trafficking, noting the country’s high reliance on foreign workers and a low level of co-operation between the government and NGOs.\nIn 2024, the U.S. Trafficking in Persons Report kept Qatar on Tier 2, noting that authorities convicted six individuals in a labor-trafficking case and shut down the company involved. The International Labour Organization and Qatar extended their technical cooperation programme in 2024 (Phase 3, 2024–2028). ILO materials report progress on reforms with persistent enforcement gaps identified in annual progress reporting. Nevertheless, independent reporting in 2024 describes continued wage theft and barriers to redress for some migrant workers, including domestic workers, despite reforms.\nProsecution (2009)\nThe Government of Qatar made minimal efforts to investigate and prosecute trafficking offenses during the reporting period. Qatar does not prohibit all acts of trafficking, but it criminalizes slavery under Section 321 and forced labor under Section 322 of its criminal law. # Article 297 prohibits forced or coerced prostitution, and the prostitution of a child below age 15, even if there was no compulsion or redress; the prescribed penalty is up to 15 years’ imprisonment, which is commensurate with penalties prescribed for other serious crimes, such as rape. The government has yet to enact a comprehensive trafficking law as anticipated during the last year, though it has reaffirmed its commitment to do so over the coming year, a commitment underscored by its ratification of the 2000 UN TIP Protocol in April 2009. The government reported the prosecution of sex trafficking offenders, but did not provide additional details. An unconfirmed report indicated four traffickers were charged with fraudulently issuing visas to workers whom they then exploited. Two were reportedly deported, and two were reportedly convicted. The government neither confirmed nor denied the existence of this case. The government-established but independent Qatar Foundation for Combating Human Trafficking (QFCHT) and the Human Rights Office of the Ministry of Interior conducted a workshop on the legal, social, and security dimensions of trafficking. Participants included police officers, Internal Security Force staff, and others. The police academy trained police officers on the identification of trafficking victims and procedures to refer victims to Qatar's trafficking shelter. QFCHT also provided training for prosecutors and judges on how to manage trafficking cases.\nProsecution (2024–2025)\nThe latest reporting period indicates a significant escalation in the government's efforts to investigate and prosecute trafficking crimes, despite a marginal decrease in total convictions.\nIncreased Prosecutions: The government reported initiating prosecutions against 967 alleged traffickers in 784 cases, a notable increase compared to 589 alleged traffickers in 494 cases in 2023. These charges included 602 for sex trafficking, 212 for labor trafficking, and 153 for other unspecified forms of trafficking.\nConvictions: Courts convicted 101 traffickers under the 2009 anti-trafficking law in 2024, down from 130 convictions in the previous year.\nProtection (2009)\nQatar made minimal progress in protecting victims of trafficking during the reporting period. Although health care facilities reportedly refer suspected abuse cases to the government's anti-trafficking shelter for investigation, the government lacked a systematic procedure for law enforcement to identify victims of trafficking among vulnerable populations, such as foreign workers awaiting deportation and women arrested for prostitution; as a result, victims may be punished and automatically deported without being identified as victims or offered protection. The government reported the MOI has a process by which it refers victims to the trafficking shelter; however, this process was underutilized in practice. The trafficking shelter assisted 24 individuals during the reporting period and provided them with a wide range of services, including full medical treatment and legal and job assistance. While this was an increase in the number of individuals served over the past year, it was not confirmed that all were trafficking victims. It was unknown how many of those cases were the result of law enforcement referrals. During the reporting period, the shelter assisted five victims in filing civil charges against their employers. The shelter also assisted one victim in filing criminal charges against her sponsor for sexual abuse under Articles 296 and 297. A criminal court convicted the sponsor and sentenced him to five years imprisonment. Qatar commonly fined and detained potential trafficking victims for unlawful acts committed as a direct result of being trafficked, such as immigration violations and running away from their sponsors, without determining whether the individuals were victims of trafficking. Most potential victims remain in deportation centers for weeks or months pending resolution of their cases, but some remain in centers for up to one year. This prolonged period often depends on when an employer will approve an exit visa, but it also depends on pending resolution of their cases or retaliation for seeking to recover unpaid wages or request a new sponsor. Some employers and sponsors threatened victims in an attempt to keep them from seeking legal redress. Domestic workers are not permitted to file civil suits against their employers under the labor law since they are not covered by it. Civil suits can only be filed for failure to meet the financial obligations of the sponsor toward domestic help; in practice, civil suits are rare.\nQatar sometimes offered temporary relief from deportation to enable victims to testify as witnesses against their employers. However, victims were generally not permitted to leave the country if there was a pending case. The government did not routinely encourage victims to assist in trafficking investigations or consistently offer victims alternatives to removal to countries where they may face retribution or hardship.\nProtection (2024–2025)\nProtection services for trafficking victims continued through a dual system, with state-provided services seeing a quantitative reduction, while NGOs played a major role in identification.\nVictim Identification and Services: NGOs and international organizations reported identifying an additional 474 victims and providing services (including medical care, counseling, and legal support) to 3,888 victims (including those identified in prior years).\nGovernment-Provided Services: The government, in collaboration with civil society, provided a range of protection services, such as shelter and medical care, to 47 victims (a decrease from 442 in 2023).\nSupport Centers: A new support center for migrant workers was opened by the government in partnership with an international organization. This center focuses on providing pre-departure training to reduce workers' vulnerability to trafficking.\nPrevention (2009)\nQatar made modest progress in preventing trafficking in persons during the reporting period. The QFCHT continued to produce and distribute informational anti-trafficking brochures and posters in several targeted languages, gave radio and television interviews, produced commercials in regional media outlets, and launched a media campaign entitled “No to Trafficking.” The QFCHT distributed a circular to all applicable departments in the Ministry of Interior and other applicable ministries in an effort to raise government awareness about the trafficking victim status of workers who willingly migrate to Qatar and are subsequently subject to forced labor. In March, Qatar hosted a two-day regional workshop meant to establish a dialogue between scholars, government officials, and stakeholders to discuss regional and international efforts to combat trafficking in persons and how to help victims.\nWhile the government made no apparent effort to amend provisions of Qatar's sponsorship law - enacted in March 2009 - to help prevent the forced labor of migrant workers, the government did start to enforce other parts of the law to the benefit of migrant workers. One provision in the sponsorship law continues to require foreign workers to request exit permits from their sponsors in order to leave Qatar. Although this may increase migrant workers’ vulnerability to forced labor, the law created a new process through which a laborer who was not granted an exit permit due to a sponsor's refusal or other circumstances could seek an exit permit by other means. While this process is burdensome, the government reported the Ministry of Interior granted two workers - one of whom was a laborer - exit permits without permission of their employers since the passage of this law. Furthermore, four individuals temporarily transferred their sponsorship without approval from their previous employer; it was unclear whether they were white-collar workers or blue-collar laborers - a group vulnerable to trafficking. While the sponsorship law criminalizes the withholding of passports, passport confiscation was still a common practice; employers often made their employees sign waivers allowing them to hold passports. Although the sponsorship law requires an employer to secure a residence card for laborers within seven days, reports indicated that this often does not happen. Migrant workers need residence cards to get access to low cost health care, to lodge complaints at the labor department, and for increased protection from abuse of the legal process by their employers.\nThe government worked with labor attachés from South Asian countries to resolve cases of labor disputes via conflict mediation. However, Qatar restricted foreign government access to its nationals after labor concerns were raised. Qatar has a national plan of action to address trafficking in persons, but did not publicly disseminate the plan or take steps to implement it during the reporting period. The government did not undertake any public awareness campaigns aimed at reducing the demand for commercial sex acts in Qatar, but the government did utilize public awareness campaigns, involving radio, television, newspapers, and sermons at mosques, targeting citizens traveling to known child sex tourism destinations abroad. The Qatari government ratified the 2000 UN TIP Protocol in April 2009.\nPrevention (2024–2025)\nQatar focused its prevention efforts on drafting long-term strategies and enhancing international cooperation to address the root causes of forced labor.\nNational Action Plan: The government reported drafting a new anti-trafficking National Action Plan, structured around the four 'P' pillars: Prevention, Protection, Prosecution, and Partnership (Cooperation).\nAddressing Debt Bondage: Efforts were maintained to ensure migrant workers do not incur exploitative recruitment debts prior to arrival, recognizing this as a critical vulnerability leading to forced labor.\nInternational Cooperation: The government enhanced technical cooperation with international bodies, such as the International Labour Organization (ILO), focusing on strengthening enforcement mechanisms against labor law violations.\nKafala sponsorship and work contracts\nOn December 12, 2016, International Labour Organization (ILO), Qatar officially announced the abolition of the sponsorship system (Kafala), but the law was implemented in 2018. The decision to replace Kafala system was to improve the living conditions and protect the rights of the expatriate workers. To better the living conditions and safeguard the rights of the expatriate workers, it was decided to replace the Kafala system with an employment contract. The abolition of sponsorship system was one of the several reforms implemented to strengthen the labor market in Qatar. According to the law a migrant worker is free to exit and enter Qatar without obtaining prior permission from the employer and workers are also allowed to change their jobs without the objection certificate from their employer. Qatari government also introduced minimum wage system and wage protection system which assures the basic minimum wage to the workers regardless of their nationality.\nIn 2019, According to an Amnesty International report, With less than four years to the 2022 World Cup, Qatar’s treatment of migrant workers remains under scrutiny. Despite some reforms, such as the introduction of a minimum wage and partial changes to the Kafala system, widespread labor abuse continues. Migrant workers, making up 95% of Qatar’s workforce, still face exploitation, including forced labor, unpaid wages, and restrictions on movement.  Domestic workers remain especially vulnerable, with limited legal protections. The slow reform process and poor enforcement of labor laws mean that significant abuses persist, keeping workers trapped in an exploitative system despite Qatar’s promises of improvement. In 2020, Qatar fully eliminated exit permits for nearly all migrant workers and allowed workers to change jobs without employer approval, reforms documented by the International Labour Organization and widely reported as major changes to the former Kafala structure.\nSee also\n* Human rights in Qatar\n* Slavery in Qatar\nReferences"
    }
  ]
}