{
  "content": [
    {
      "type": "text",
      "text": "# Human Trafficking Prevention Act\n\n,\n| agenciesaffected = United States Department of State\n| authorizationsofappropriations =\n| appropriations =\n| leghisturl =\n| introducedin = House\n| introducedbill =\n| introducedby = Rep. Sean Patrick Maloney (D, NY-18)\n| introduceddate = April 10, 2014\n| committees = United States House Committee on Foreign Affairs\n| passedbody1 = House\n| passeddate1 = July 23, 2014\n| passedvote1 = voice vote\n| passedbody2 =\n| passedas2 =\n| passeddate2 =\n| passedvote2 =\n| conferencedate =\n| passedbody3 =\n| passeddate3 =\n| passedvote3 =\n| agreedbody3 =\n| agreeddate3 =\n| agreedvote3 =\n| agreedbody4 =\n| agreeddate4 =\n| agreedvote4 =\n| passedbody4 =\n| passeddate4 =\n| passedvote4 =\n| signedpresident =\n| signeddate =\n| unsignedpresident =\n| unsigneddate =\n| vetoedpresident =\n| vetoeddate =\n| overriddenbody1 =\n| overriddendate1 =\n| overriddenvote1 =\n| overriddenbody2 =\n| overriddendate2 =\n| overriddenvote2 =\n| amendments =\n| SCOTUS cases =\n}}\nThe Human Trafficking Prevention Act () is a bill that would require regular training and briefings for some federal government personnel to raise awareness of human trafficking and help employees spot cases of it.\nThe bill was introduced in the United States House of Representatives during the 113th United States Congress.\nBackground\nHuman trafficking is the modern form of slavery, with illegal smuggling and trading of people, for forced labour or sexual exploitation. Trafficking is officially defined as the recruitment, transportation, transfer, harboring, or receipt of persons by means of coercion, abduction, fraud, deception, or abuse of power of a position of vulnerability for the purpose of exploitation. Human trafficking is not synonymous with forced migration or smuggling. In the U.S., human trafficking tends to occur around international travel-hubs with large immigrant populations, notably California and Texas. The U.S. Justice Department estimates that 17,500 people are trafficked into the country every year, but the true figure could be higher, because of the large numbers of undocumented immigrants. The United States Department of State has also estimated that between 14,000-17,500 people annually are trafficked for sex, labor, or other types of exploitation into the United States. Those being trafficked include young children, teenagers, men and women and can be domestic citizens or foreign nationals.\nOther experts say that there are as many as 300,000 cases of sex trafficking in the United States a year, with potentially 25 percent of them having a connection to Texas in some manner.\nProvisions of the bill\nThis summary is based largely on the summary provided by the Congressional Research Service, a public domain source.\nThe Human Trafficking Prevention Act would amend the Trafficking Victims Protection Act of 2000 to require training for federal government personnel related to trafficking in persons to include at a minimum: (1) a distance learning course on trafficking-in-persons issues and the Department of State's obligations under the Act, targeted for embassy reporting officers, regional bureaus' trafficking-in-persons coordinators, and their superiors; (2) specific trafficking-in-persons briefings for all ambassadors and deputy chiefs of mission before they depart for their posts; and (3) at least annual reminders to all such personnel and other federal personnel at each diplomatic or consular post of the Department of State located outside the United States of key problems, threats, methods, and warning signs of trafficking in persons specific to the country or jurisdiction in which each such post is located, and appropriate procedures to report information acquired about possible trafficking cases.\nCongressional Budget Office report\nThis summary is based largely on the summary provided by the Congressional Budget Office, as ordered reported by the House Committee on Foreign Affairs on May 29, 2014. This is a public domain source.\nH.R. 4449 would expand training for federal employees on methods of identifying and protecting victims of human trafficking. The primary federal agencies affected—the Departments of State, Homeland Security, Health and Human Services, Labor, and Justice, as well as the Equal Employment Opportunity Commission—have existing programs to train employees. The Congressional Budget Office (CBO) estimates that the additional personnel who might require training and the new training required under the bill would not impose significant costs on those agencies. CBO estimates that implementing the bill would cost less than $500,000 over the 2015-2019 period; those costs would be subject to the availability of appropriated funds. Enacting the bill would not affect direct spending or revenues; therefore, pay-as-you-go procedures do not apply.\nProcedural history\nThe Human Trafficking Prevention Act was introduced into the United States House of Representatives on April 10, 2014 by Rep. Sean Patrick Maloney (D, NY-18). It was referred to the United States House Committee on Foreign Affairs. On July 23, 2014 the House voted to pass the bill with a voice vote.\nDebate and discussion\nRep. Eliot Engel (D-NY) supported the bill, saying that \"One of the best ways to stop this crime is to ensure that people know if when they see it.\" This is because \"people, not policies, are often the first line of defense against modern slavery.\"\nRep. Ed Royce (R-CA) said that \"this bill ensures that US personnel overseas are properly equipped to perceive and combat the scourge of human trafficking. Though current law requires State Department personnel be trained to identify trafficking victims, it does not define minimum training requirements. This bill does that.\"\nState legislation with the same name\nLegislation with the same name aimed at blocking internet pornography has been introduced in South Carolina and has received critical reviews.\nSee also\n*List of bills in the 113th United States Congress\n*Human trafficking in the United States\nReferences\nExternal links\n* [https://www.govinfo.gov/link/plaw/117/public/301?link-type=uslm Human Trafficking Prevention Act of 2022] as enacted ([https://www.govinfo.gov/link/plaw/117/public/301?link-type=pdf PDF]/[https://www.govinfo.gov/link/plaw/117/public/301?link-type=details details]) in the US Statutes at Large\n*[http://hdl.loc.gov/loc.uscongress/legislation.113hr4449 Library of Congress - Thomas H.R. 4449]\n*[https://beta.congress.gov/bill/113th-congress/house-bill/4449 beta.congress.gov H.R. 4449]\n*[https://www.govtrack.us/congress/bills/113/hr4449 GovTrack.us H.R. 4449]\n*[http://www.opencongress.org/bill/hr4449-113/show OpenCongress.org H.R. 4449]\n*[http://www.washingtonwatch.com/bills/show/113_HR_4449.html WashingtonWatch.com H.R. 4449]\n*[http://www.cbo.gov/publication/45503 Congressional Budget Office's report on H.R. 4449]"
    }
  ]
}