{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Azerbaijan\n\nHuman trafficking has become a problem in Azerbaijan. Youth is the main place among people exploitation by human traffickers. There is a struggle in human trafficking for many years.\nThere are some aid center for victims in human trafficking as the Main Department on struggle against Human traffic and the Aid Center to the victims of Human trafficking  in Azerbaijan.\nU.S. State Department's Office to Monitor and Combat Trafficking in Persons placed the country in \"Tier 2\"  in 2017.\nMain Department on struggle against human trafficking\nMain Department on Combating Trafficking in Human Beings was established in order  to effectively execute the tasks identified in the National Action Plan, ensure of security  of the victims of trafficking in persons, provide them with professional aid, protection of information collected in unique center in combat with  human trafficking. In fight against human trafficking  trained and  professional police members work in this department.\nAid Center to the victims of human trafficking\nThe Aid Center to the Victims of Human Trafficking operates as nonprofit institutions. The aim of the center to the victims of human trafficking are protection the rights and interests of the victims of slave trafficking, medical, psychological aid, social rehabilitation of themde, their reintegration into society, to help return to normal life.\nCentre makes plan of social rehabilitation of victims of human trafficking for responding each of the individual human and civil rights, help legally for the recovery of the rights of victims, ensure them employment and training, providing with residential area  for the  victims of trafficking. If the victims are children, this center report immediately information about them to commission of protection their rights and the Commission on guardianship and custody.\nAid center of victims of human trafficking provided  with different types of assistance to 93 people ( 63 of them were real victims, the others were potential victims) in 2016.\nMeasures and efforts\nPartnership is very important in this area. Usually the representatives of US and Azerbaijan criticise each other within the OSCE Human Dimension Implementation Meetings. US is the biggest partner of Azerbaijan in the fight against human trafficking.\nIn March 2016, the US embassy and the Main Department for Combating Human Trafficking in Azerbaijan, organised an international conference.\nDuring the conference, carried out the coordination of joint activities of law enforcement agencies. One of the programs carried out by the United States in Azerbaijan aimed at combating human trafficking.\nWith the support of the United States, steps were taken to create of shelters for victims of human trafficking and to increase the capacity of the labor of the people there.\nThe United States  joins forces with Azerbaijan in the fight against human trafficking in harmony with the priorities identified in the Concept of \"Azerbaijan 2020: vision to future\". USAID is executing joint projects with the fitting bodies of Azerbaijan.\nSee also\n*Human rights in Azerbaijan\n*Human trafficking\nReferences"
    }
  ]
}