{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Eritrea\n\nIn 2017, the U.S. State Department's Office to Monitor and Combat Trafficking in Persons classified Eritrea as a  \"Tier 3\"  country under the Trafficking in Persons Report tier system. Tier 3 countries are defined as those whose governments do not fully adhere to the minimum standards established by the Trafficking Victims Protection Act and are not making substantial efforts to comply. In 2010 the U.S. Department of State reported:\nEritrea is a source country for trafficking, with men, women, and children subjected to forced labor and, to a lesser extent, forced prostitution. The country's national service program requires men aged 18–54 and women aged 18–47 to serve for 18 months in military and non-military public works and services. Many are forced to work indefinitely, with some serving over 10 years under threats of punishment. Reports indicate conscripts are used for private construction, state-owned farms, and projects benefiting military officers and the ruling party, with no pay increases, promotions, or freedom to leave. Thousands of Eritreans illegally flee to Sudan, Ethiopia, and Kenya annually, where their status makes them vulnerable to trafficking. Children in Eritrea also face exploitation in domestic work, agriculture, and prostitution. Despite these issues, the Eritrean government fails to meet the minimum standards for combating human trafficking and provides no data or evidence of efforts to address the problem.\nIn late 2013, the BBC reported on a study conducted by activist Meron Estefanos and Dutch researchers from Tilburg University. The study concluded that since 2007, up to 30,000 Eritreans—primarily refugees fleeing the country—had been abducted and taken to Sinai, Egypt, where at least $600 million (£366 million) in ransom payments had been extorted. Nesru Jamal of ERTA stated that the report, titled The Human Trafficking Cycle: Sinai and Beyond, was presented to EU Home Affairs Commissioner Cecilia Malmström in the European Parliament on December 4, 2013. Jamal also noted that the report accused Eritrea's Border Surveillance Unit, commanded by General Tekle Kiflay, of playing a central role in the trafficking.\nFor years, many abductions attributed to the Rashaida Bedouin occurred along the Sudan border. Physicians from the group Human Rights-Israel estimate that between 2008 and 2012, as many as 4,000 refugees lost their lives.\nBackground\nThe human rights record of Eritrea is considered poor. Since Eritrea's conflict with Ethiopia in 1998–2001, Eritrea's human rights record has worsened.  Several human rights violations are committed by the government or on behalf of the government. Freedom of speech, press, assembly, and association are limited. Those that practice \"unregistered\" religions, try to flee the nation, or escape military duty are arrested and put into prison.  Domestic and international human rights organizations are not allowed to function in Eritrea. In 2009 Human Rights Watch said that the government was turning the country into a 'giant prison'.\nAll denominations of Christianity enjoyed freedom of worship until 2002, when the government outlawed worship and assembly outside the 'registered' denominations. All groups who worship secretly in a house or any other unregistered place of assembly are arrested and imprisoned without charge or trial. Religious prisoners are often tortured in Eritrea. Freedom of worship is one of the top reasons thousands of Eritreans flee the country. There are thousands of Eritrean refugees in Ethiopia and Sudan seeking asylum in Europe or another region of the West. Eritrea is a one-party state in which national legislative elections have been repeatedly postponed.\nProsecution\nU.S. Department of State, 2010:\nArticle 605 of the Eritrean Transitional Criminal Code prohibits trafficking in women and young persons for sexual exploitation, which is punishable by up to five years imprisonment, or from three to 10 years imprisonment if aggravating circumstances are present; these penalties are not commensurate with punishments prescribed for other serious crimes, such as rape. Article 565 prohibits enslavement and prescribes punishment of five to 20 years' imprisonment, penalties which are sufficiently stringent. Forced labor and slavery are prohibited, except where authorized by law under Article 16 of the ratified, but suspended, Eritrean Constitution. Proclamation 11/199 prohibits the recruitment of children under 18 years of age into the armed forces. Nevertheless, the government has never used these statutes to prosecute cases of human trafficking.\nProtection\nU.S. Department of State, 2010:\nThe government did not appear to provide any significant assistance to victims of trafficking during the reporting period. During the reporting period, the government reportedly operated a program to identify children involved in commercial sexual exploitation and reintegrate them with their families. The government did not make available information on the program's accomplishments in 2009. The Ministry of Labor and Human Welfare oversees the government's trafficking portfolio, but individual cases of transnational human trafficking are reportedly handled by the Eritrean embassy in the country of destination; information regarding embassy efforts to assist trafficking victims was not provided. The government has no known facilities dedicated to trafficking victims and does not provide funding or other forms of support to NGOs for services to trafficking victims.\nPrevention\nU.S. Department of State, 2010:\nThe government made no known efforts to prevent future incidents of trafficking during the reporting period. Eritrean media, all state-owned, made neither public announcements, nor media presentations regarding human trafficking during the reporting period. There were no anti-trafficking education campaigns. The government reportedly warned students at Sawa military school and Mai Nefi, a local college, of the dangers of leaving the country, including the prospects of being sold into slave labor or sexual servitude. Although the government does not publicly acknowledge human trafficking as a problem, an office exists within the Ministry of Labor to handle labor cases, including human trafficking; the accomplishments of this office during 2009 are unknown.\nSee also\n*Refugee kidnappings in Sinai\nReferences"
    }
  ]
}