{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Malawi\n\n}}\nMalawi ratified the  2000 UN TIP Protocol in September 2005.\nIn 2010 Malawi was primarily a source country for men, women, and children subjected to trafficking in persons, specifically conditions of forced labor and forced prostitution within the country and abroad. Most Malawian trafficking victims were exploited internally, though Malawian victims of sex and labor trafficking have also been identified in South Africa, Zambia, Mozambique, Tanzania, and parts of Europe. To a lesser extent, Malawi was a transit point for foreign victims and a destination country for men, women, and children from Zambia, Mozambique, Tanzania, and Zimbabwe subjected to conditions of forced labor or commercial sexual exploitation. Within the country, some children were forced into domestic servitude, cattle herding, agricultural labor, and menial work in various small businesses. Exploited girls and women become \"bar girls\" at local bars and rest houses where they are coerced to have sex with customers in exchange for room and board. Forced labor in agriculture is often found on tobacco plantations. Labor traffickers were often villagers who have moved to urban areas and subsequently recruit children from their original villages through offers of good jobs. Brothel owners or other prostitution facilitators lured girls with promises of nice clothing and lodging. Upon arrival, they charged the girl high rental fees for these items and instructed her how to engage in prostitution to pay off the debt. South African and Tanzanian long-distance truck drivers and mini-bus operators moved victims across porous borders by avoiding immigration checkpoints. Some local businesswomen who also travelled regularly to neighboring countries to buy clothing for import have been identified as traffickers. Reports of European tourists paying for sex with teenage boys and girls continued.\nIn 2010 the Government of Malawi did not fully comply with the minimum standards for the elimination of trafficking; however, it made significant efforts to do so. While the government maintained its efforts to ensure victims' access to protective services and prevent trafficking, adults trafficked for sex or labor exploitation and children exploited in domestic servitude and prostitution still did not receive the same amount of care as children exploited in forced labor.\nThe U.S. State Department's Office to Monitor and Combat Trafficking in Persons placed the country in \"Tier 2\"  in 2017 and in 2023.\nProsecution (2010)\nThe Government of Malawi maintained its progress in its anti-trafficking law enforcement efforts during the last year. Malawi prohibits all forms of trafficking through various laws, including the Employment Act and Articles 135 through 147 and 257 through 269 of the Penal Code, though the country lacks specific anti-trafficking laws. The penalties prescribed under these statutes range from small fines to 10 years' imprisonment; these penalties are sufficiently stringent and commensurate with punishments prescribed for other serious crimes. For a second year, the draft Child Care, Protection and Justice Bill, which defines child trafficking and imposes a penalty of life imprisonment for convicted traffickers, remained in the government's Cabinet and was not passed by Parliament. Also for a second year, the Malawi Law Commission did not complete drafting comprehensive anti-trafficking legislation specifically outlawing all forms of human trafficking. Local law enforcement agencies in Malawi only keep written record of their activities, which are not consolidated at any central record facility. Data on nationwide statistics was not available, though some individual districts provided data on their specific activities. In 2009, the Magistrate's Court in the district of Mchinji on the Zambian border prosecuted five trafficking offenders on criminal charges and convicted four. In one case involving 14 child victims of labor trafficking, three offenders were sentenced to seven years of hard labor, one was fined $33, and one was acquitted. The Mchinji court convicted a trafficker caught while transporting 59 children to Zambia to be exploited in forced labor, and sentenced him to five years in prison. The government also prosecuted and convicted 34 trafficking offenders for exploiting children in forced farm labor. Each was fined $131, which is approximately one-third of the average annual income in Malawi. Police, child protection, social welfare, and other officials received training in how to recognize, investigate, and prosecute instances of trafficking either directly from the government or in partnership with NGOs. The Ministry of Labor incorporated a child protection curriculum into labor inspector training. Requests to work with other governments are handled on an ad hoc, informal basis, especially between district officials in Mchinji and officials across the Zambian border. The Anti-Corruption Bureau's investigation, begun in 2007, into two complaints of government corruption relating to trafficking was ongoing at the end of the reporting period.\nProtection (2010)\nThe Malawi government maintained its efforts to ensure that victims were provided access to appropriate services, and provided in-kind support to NGO service providers. Malawi continued to depend heavily on foreign donors and NGOs to fund and operate most of the country's anti-trafficking programs. This past year, it provided technical and coordination assistance to NGOs and helped set project guidelines. In Dedza district, police rescued 14 Malawian and 10 Mozambican child victims of labor trafficking. The government provided law enforcement, immigration, and social services personnel with basic training in identifying victims of trafficking, though it has not yet established systematic procedures for proactively identifying victims of trafficking among vulnerable populations, especially persons in the commercial sex trade. Government personnel sustained partnerships with NGOs to connect their local programs with government labor inspectors, child protection officers, district social welfare officers, the police, and district child protection committees. The government funded one rehabilitation drop-in center in Lilongwe for victims of trafficking and gender-based violence. The center did not keep specific records of trafficking victims that it may have assisted. Over 100 police stations throughout the country housed victim support units to respond to gender-based violence and trafficking crimes. These units provided limited counseling and, in some places, temporary shelter, though the capacity to identify and assist victims varied greatly among stations. Inter-ministerial child protection committees monitored their districts for suspicious behavior which might indicate trafficking activity. Overall, the government encouraged victims' participation in the investigation and prosecution of trafficking crimes and did not inappropriately incarcerate, fine, or otherwise penalize victims for unlawful acts committed as a direct result of being trafficked.\nPrevention (2010)\nThe government sustained its efforts to prevent human trafficking and raise public awareness of the crime in 2009. An inter-ministerial task force on human trafficking, led by the Ministry of Gender, Child Development and Community Development, forged a partnership with international organizations and NGOs and began drafting a national plan of action which is not yet complete. Addressing child trafficking is also the responsibility of both the National Steering Committee on Orphans and Vulnerable Children and the National Steering Committee on Child Labor. Uneven levels of expertise and inadequate inter-agency coordination at national and district levels interfered with the effectiveness of these committees in preventing child trafficking. Through the National Aids Commission's Action Framework on HIV/AIDS Prevention, the government sensitized communities to the dangers of commercial sexual exploitation and attempted to reduce the demand for commercial sex acts. The Malawi Defense Force provided training on human rights, child protection, and the elimination of sexual exploitation to its nationals deployed abroad as part of peacekeeping missions.\nSee also\n*Human rights in Malawi\nReferences"
    }
  ]
}