{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Poland\n\n}}\nThe U.S. State Department Office to Monitor and Combat Trafficking in Persons placed Poland in Tier 1 in 2024. Below is the full copy of a webpage section relating to Poland in a report published by the Bureau of Public Affairs of the United States Department of State, entitled \"Country Narratives: Countries N Through Z: Trafficking in Persons Report 2024\",which is in the public domain.\n}}\nThe government of Poland fully complies with the minimum standards for eliminating trafficking and in 2024 was upgraded to Tier 1. These accomplishments include increasing prosecutions and convictions of traffickers, increasing funding for victim services, and boosting funding for the National Action Plan (NAP) implementation for the first time since 2018.  The government also intensified efforts to investigate and identify labor trafficking, with 79 percent of ongoing prosecutions related to labor trafficking, and the majority of identified victims being labor trafficking victims. The government funded two NGOs that assisted more potential trafficking victims. Courts awarded restitution to trafficking victims in four cases, marking the first time since 2020. In September 2023, the government formed an Inter-Ministerial Team for Counteracting Human Trafficking, which replaced the Ministry of Interior (MOI) advisory board that had been in operation since 2019.\nIn 2022 the government implemented comprehensive measures to combat the trafficking of individuals escaping the Russian invasion of Ukraine. These measures included raising public awareness, establishing a dedicated hotline, formulating and applying standard operating procedures (SOPs) for unaccompanied children from other countries arriving at the Poland-Ukraine border, and engaging in proactive collaboration with international bodies and non-governmental organizations. Efforts included investigating and prosecuting more suspected traffickers, adopting a new national action plan (NAP), and implementing a procurement strategy to prevent forced labor in government contracts.\nIn 2023 the Organised Crime Index gave Poland a score of 5.5 out of 10 for human trafficking noting that most victims are women from Eastern Europe and Russia.\nProsecution\nThe government of Poland demonstrated progress in its overall anti-human trafficking law enforcement efforts during the reporting period. Poland prohibits all forms of trafficking through Article 253, Article 204 Sections 3 and 4, and Article 203 of the criminal code. Article 253 and organized crime statutes are used to prosecute labor trafficking cases, though there are no provisions that specifically define and address trafficking for forced labor. Penalties prescribed under Article 253 range from three to 15 years’ imprisonment, and Articles 203 and 204 prescribe from one to 10 years’ imprisonment; these punishments are sufficiently stringent and commensurate with those prescribed for other serious crimes, such as rape. Law enforcement officials and NGOs continued to report that the lack of a clear legal definition of trafficking in Poland's criminal code limits effective prosecutions. Prosecutors rely on trafficking definitions in the 2000 UN TIP Protocol when pursuing prosecutions against traffickers.\nIn 2022 law enforcement authorities conducted 23 investigations under Article 189a, which was a decrease compared to the 32 investigations in 2021. These investigations focused on various forms of trafficking:\n* Seven cases were related to sex trafficking.\n* Twelve cases involved forced labor (including five for forced begging).\n* Four cases pertained to unspecified forms of trafficking.\nProsecutors also initiated 26 investigations based on referrals from police and border guards, a decrease from the 57 investigations in 2021. They prosecuted 17 defendants under Article 189a, down from 25 in 2021. Additionally the police initiated 12 case investigations under Article 203 and four cases under Article 204.3. Prosecutors indicted 11 defendants under Article 203.\nIn 2021 police investigated 16 cases related to Article 203 and/or Article 204.3. Prosecutors indicted 16 defendants under the same articles.\nThe National Prosecutor's Office (NPO) reported that courts convicted four traffickers under Article 189a in 2022, a significant decrease compared to the 25 traffickers convicted in 2021. The sentences included:\n* One trafficker received five years’ imprisonment.\n* Another received four years.\n* A third received three years.\n* The fourth received two years.\nFurthermore: Three persons were convicted under Article 203 in 2022, compared to none in 2021. The Border Guard launched two investigations into forced labor, involving victims from Guatemala, Colombia, Venezuela, and Mexico. These victims were exploited through local recruitment agencies and fraudulent internet platforms.\nSince the start of Russia's full-scale invasion of Ukraine, the National Police initiated five investigations into possible trafficking of Ukrainian refugees. Among these cases, one was confirmed as human trafficking and involved two child victims of sex trafficking.\nThe government provided training on trafficking awareness and victim identification to officers in the national police, Border Guard, and the Internal Security Agency. In March 2009, the National School for Judges and Prosecutors provided trafficking-specific training for 60 prosecutors. Additional anti-trafficking training and victim identification and treatment training was provided to at least 614 police officers, border guard officials, and social workers. In partnership with a local NGO, the Ministry of Labor and Social Policy focused significant training for law enforcement and social workers on child trafficking issues, including identification and the special needs of children exploited in the sex trade.\nThe National Police took part in three major international operations launched by EUROPOL within the framework of the European Multidisciplinary Platform Against Criminal Threats. These operations targeted child trafficking, forced labor, and the fight against human trafficking related to sexual abuse, begging, or criminal activities.\nProtection\nDuring 2009 the government continued to improve efforts to assist trafficking victims; they identified at least 206 victims of trafficking - including 123 children in prostitution - compared with 315 victims identified by NGOs and government authorities in 2008. In total, 193 victims received some government-funded assistance. The government referred 22 victims for assistance in 2009. In April 2009, the government established the National Intervention Consultation Center, which expanded the ability of authorities to assist victims. The NGO-operated center established a 24-hour hotline, provided direct assistance to victims of trafficking, and served as a consultation point for law enforcement working with victims of trafficking. The national center enhanced victim protection available to foreign victims of trafficking. Previously, only foreign victims who agreed to cooperate with law enforcement were eligible for government-funded emergency assistance. With the establishment of the national center, both Polish and foreign victims were no longer required to be identified by or cooperate with local law enforcement to receive government-funded emergency assistance through Poland's victim assistance program.\nIn 2009 the government allocated approximately $298,000 for victim assistance, including $59,000 for a shelter for use by adult female victims of trafficking. In response to criticism that there were no shelters dedicated to assisting male victims of trafficking, the government housed seven male trafficking victims in a government-run crisis center in January 2010 and enrolled them in the Victim/Witness protection Program, ensuring they had access to necessary care. Under Polish law, all foreign victims are permitted to stay in Poland during a three-month reflection period, during which time they are eligible to access victim services while they decide whether or not to cooperate with law enforcement. In 2009, no victims took advantage of the 90-day reflection period. Those foreign victims who choose to cooperate are permitted to stay in Poland during the investigation and prosecution process. In 2009, two foreign victims were granted temporary residency permits to remain in Poland pending completion of the prosecution process. However, some trafficking experts expressed concern that some victims who chose not to cooperate with law enforcement may not have been given victim status and therefore may not have received emergency victim assistance. Police encouraged victims to cooperate with law enforcement. In 2009, 22 victims assisted law enforcement, compared with 21 victims in 2008. There were no reports that identified victims were penalized for unlawful acts committed as a direct result of being trafficked.\nIn 2022, the Polish government provided 1.1 million zloty (around $251,140) to two non-governmental organizations dedicated to assisting trafficking victims. This level of funding has been maintained since 2015.\nNational Action Plan (NAP) against Trafficking in Human Beings\nNational Action Plan (NAP) against Trafficking in Human Beings for 2022–2024 in Poland is a comprehensive document that outlines the country's strategy to combat human trafficking.\nThe NAP defines human trafficking as a crime involving the recruitment, transportation, harboring, or receipt of a person through various means such as force, fraud, or coercion for the purpose of exploitation, including forced labor, prostitution, and other forms of exploitation. The NAP aims to intensify preventive measures, training, and strengthen the role of Voivodeship Teams for Counteracting Trafficking in Human Beings. It also focuses on introducing remedial actions to ensure all components of the anti-trafficking system are complementary.\nThe plan emphasizes the need to intensify prevention, information, and education activities at all levels, aiming to reach the widest possible groups of people. This is particularly important considering the increasing number of individuals seeking employment in Poland, who may be at risk of falling victim to human trafficking crimes.\nSee also\n*Human rights in Poland\n*Human trafficking in Europe\n*Slavery in Poland\nReferences"
    }
  ]
}