{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Guyana\n\nIn 2009, Guyana was a source country for men, women, and children subjected to trafficking in persons, specifically conditions of forced prostitution and forced labor. Guyanese trafficking victim cases were identified in the country, as well as in other countries in the region. Identified foreign victims came from Venezuela and Brazil. Forced prostitution occurred in brothels on the coast and around mining camps, as well as in rum shops and Chinese restaurants. The common Guyanese practice of poor, rural families sending children to live with higher income family members or acquaintances in more populated areas had the potential to evolve into forced domestic servitude. Trafficking victims in Guyana may not self-identify to authorities due to fear of retribution from trafficking offenders, fear of resettlement to abusive home situations, and lack of awareness that human trafficking is a crime. Groups particularly vulnerable to human trafficking in Guyana included Amerindian females, foreign women (such as Brazilians) in prostitution, and children. During 2009, the U.S. Department of Labor reported results of a project that withdrew 984 children from exploitive child labor in logging and saw-milling, fishing, hazardous farming, factory work, mining, and freight handling from 2005 to 2009.\nIn 2009 the Government of Guyana did not fully comply with the minimum standards for the elimination of trafficking; however, it is making significant efforts to do so. Despite these efforts, the government did not initiate any new prosecutions of trafficking offenses during 2009, and has yet to convict or punish any trafficking offenders under its five-year-old anti-human trafficking law. Therefore, Guyana was placed on Tier 2 Watch List for the fourth consecutive year in 2010. During 2009, the government and NGOs identified four victims of trafficking, two of whom prison officials proactively identified. The government provided some resources toward victim protection and local anti-trafficking groups. No suspected traffickers were charged, limiting the level of safety and protection that could be provided to victims. While the government took some tangible steps to raise awareness of human trafficking, including the establishment of focal point groups and an anti-trafficking task force, some local observers felt that the government discouraged discussions on developing effective strategies for combating this phenomenon of modern-day slavery.\nThe country ratified the 2000 UN TIP Protocol in September 2004.\nThe U.S. State Department's Office to Monitor and Combat Trafficking in Persons placed the country in \"Tier 1\"  in 2017 and 2023.\nIn 2023, the Organised Crime Index gave Guyana a score of 5.5 out of 10 for human trafficking, noting that most victims came from Venezuela.\nProsecution (2009)\nThe government made no discernible progress in prosecuting, convicting, and sentencing human trafficking offenders in Guyana during the reporting period. The Combating Trafficking of Persons Act of 2005 prohibits all forms of trafficking and prescribes sufficiently stringent penalties, ranging from three years to life imprisonment, and which are commensurate with those for rape. The government reported four new trafficking investigations during the reporting period, none of which led to prosecutions. The government’s four prosecutions from previous reporting periods remained ongoing, with no significant progress. To date, the government has not convicted any trafficking offenders. Progress on the prosecution of criminal cases is perpetually delayed by judicial backlogs, incorrectly filed paperwork, or the failure of key parties to appear at hearings. NGO's and one government official expressed concern that trafficking-related official complicity was a problem. It is reportedly common for defendants to bribe court officials for favorable rulings. The Ministry of Home Affairs conducted two anti-trafficking training programs, one in partnership with IOM, for 120 police, prosecutors, and investigators during the reporting period.\nProtection (2009)\nThe government made some efforts to protect victims during the reporting period, but the number of identified victims was low, and the fact that the government charged no trafficking offenders and has yet to convict a trafficking offender undermined the effectiveness of those protections. The government, in partnership with IOM, developed a series of anti-trafficking focal point community groups around the country to help identify and refer possible trafficking victims to assistance organizations. While NGOs reported overall good working-level relations with anti-trafficking officials, some local observers expressed concern that pressure from senior officials may have prompted some lower-level officials to suppress information in order to avoid drawing attention to trafficking in Guyana. The Ministry tried to encourage identified victims to participate in prosecutions of traffickers by paying for travel costs associated with their testifying in court. In one instance, the Ministry hired a private lawyer for a victim. Nevertheless, none of the four victims identified during the reporting period elected to participate in prosecutions. In a positive step during the reporting period, Guyanese prison officials identified two foreign victims of trafficking in detention and referred them to the Human Services Ministry for assistance. The government later dropped pending charges against the two victims. The government did not provide legal alternatives to the removal of foreign victims to their home countries where they may face hardship or retribution.\nPrevention (2009)\nThe government made limited progress in the prevention of trafficking during the reporting period. The focal point groups conducted some public outreach activities in rural communities, including trafficking awareness programs targeting parents in Mahdia and Moruka, and distributing leaflets in Letherm to 440 local community leaders. The Ministry of Human Services continued to distribute IOM-funded posters, leaflets, and bumper stickers nationwide at large public gatherings throughout the year. The Ministry of Amerindian Affairs began a campaign for the issuance of birth certificates, which may have a positive effect on preventing trafficking in Guyana, though one senior official indicated that Amerindians were not as vulnerable to trafficking as other government sources have indicated. There were no campaigns directly aimed at reducing the demand for commercial sex acts during the reporting period.\n'Distress Signal' campaign\ndemonstrating the human trafficking distress gesture]]\nIn 2022, the Ministry of Human Services and Social Security announced a distress hand signal of clasping the fingers into the palm and releasing them, in a repeated motion three times, to be used as a signal to others that the person performing the gesture was a victim of human trafficking and required help.\nReferences"
    }
  ]
}