{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in the Central African Republic\n\n}}\nHuman trafficking in the Central African Republic (CAR) is a significant issue where the country is subjected to various forms of forced labor and sexual exploitation, with children being the primary victims.\nThe Central African Republic (CAR) ratified the 2000 UN TIP Protocol in October 2006.\nBackground in 2010\nIn 2010 CAR was a source and destination country for children subjected to trafficking in persons, specifically various forms of forced labor and forced prostitution. Most child victims were trafficked within the country, but a smaller number moved back and forth from Cameroon, Chad, Nigeria, Republic of the Congo, Democratic Republic of the Congo, and Sudan. Trafficking offenders, including members of expatriate communities from Nigeria, Sudan, and Chad, as well as transient merchants and herders, subjected children to involuntary domestic servitude, commercial sexual exploitation, or forced labor in agriculture, diamond mines, and street vending. The groups most at risk for trafficking were children for forced labor, Ba’aka (Pygmy) minorities for forced agricultural work, and girls for the sex trade in urban centers. The Lord’s Resistance Army continued to abduct and harbor enslaved Sudanese, Congolese, Central African, and Ugandan children in the CAR for use as cooks, porters, and combatants; some of these children were also taken back and forth across borders into Sudan or the Democratic Republic of the Congo.\nHuman rights observers reported that opposition militia groups in the north of the country continued to unlawfully conscript children as young as 12 years old in armed service. Two of the main rebel groups, however, the Union of Democratic Forces for Unity (UFDR) and the Army for the Restitution of Democracy (APRD), ceased all recruitment of children during the reporting period as a result of disarmament, demobilization, and reinsertion activities. UNICEF reported that the APRD released 711 child soldiers in 2009; approximately 30 percent were between 10 and 14 years old, and of those, 70 percent had served in armed combat. The UFDR demobilized 180 child soldiers during the year. Though the UFDR and APRD deny the presence of additional children in their ranks, some observers believe they still harbor children between the ages of 15 and 17 years old. Village self-defense units, some of which are government-supported, used children as combatants, lookouts, and porters during the year; UNICEF estimates that children comprise one-third of the self-defense units.\nIn 2010 the Government of the Central African Republic did not fully comply with the minimum standards for the elimination of human trafficking; however, it made significant efforts to do so, despite limited resources, cross-border incursions from three neighboring countries, and chronic political instability. In 2010, the government enacted an amendment to its penal code prohibiting and prescribing punishments for human trafficking offenses. The Minister of Justice, however, suspended the activities of the Inter-ministerial Committee to Fight Child Exploitation, pending a review of the draft Family Code to ensure that the legislation authorizes such a committee to exist and act effectively; this new code will determine the legal framework of the inter-ministerial committee’s work. The government did not take law enforcement action against traffickers, identify or provide protective services to child trafficking victims, or adequately raise public awareness of the phenomenon during the reporting period.\nInternational response\nThe U.S. State Department's Office to Monitor and Combat Trafficking in Persons placed the country in \"Tier 3\"  in 2017. The country was placed at Tier 2 in 2023.\nIn 2023, the Organised Crime Index gave the country a score of 8 out of 10 for human trafficking, noting that state officials has a substantial involvement in carrying out this crime.\nProsecution (2010)\nWhile the government failed to investigate, prosecute, or convict trafficking offenses during the reporting period, it made efforts to strengthen its anti-trafficking legal statutes. In September 2009, the Parliament passed a revised Penal Code containing anti-trafficking provisions; the Code was officially enacted in January 2010. Under Article 151 of the new provisions, the prescribed penalty for human trafficking ranges from five to 10 years’ imprisonment; however, when a child is the victim of sex trafficking or forced labor similar to slavery, the penalty is life imprisonment with hard labor. These penalties are sufficiently stringent and commensurate with penalties prescribed for other serious offenses, such as rape. Articles 7 and 8 of the January 2009 Labor Code prohibit forced and bonded labor and prescribe penalties of five to 10 years’ imprisonment. These provisions, however, are rarely enforced and no cases of suspected human trafficking offenses were investigated or prosecuted during the reporting period.\nProtection (2010)\nThe government provided minimal protective assistance to trafficking victims during the reporting period. An extreme shortage of resources leaves responsible Central African officials unable to implement many basic victim protection services. While the Ministry of Family and Social Affairs continued operation of a shelter (the Center for Mothers and Children) in Bangui for children in distress, some of whom may have been trafficking victims, the shelter often did not have space available to take on additional clients. The government did not establish a system for identifying victims of trafficking among vulnerable populations, and they lacked capacity to provide funding or in-kind support to local or foreign partners for services provided to victims. The government sustained its partnership with UNICEF and UNICEF's two program implementers for the latter’s protection of demobilized child soldiers, some of whom had likely been subjected to unlawful conscription. For example, during the reporting period, the Sous Prefets of Paoua and Bocaranga facilitated communication between two international NGOs and the APRD, which enabled the effective demobilization of 623 child soldiers from the rebel group. The Ministry of Education’s local representative in Bocaranga welcomed the demobilized children into the school, despite local suspicions. In September 2009, the Minister of Interior traveled to Paoua, in partnership with police, and convinced local citizens to peaceably allow the continuation of one NGO’s program to demobilize and rehabilitate child soldiers, including those unlawfully conscripted, from the APRD. In January 2010, the Deputy Minister of Defense tasked a senior gendarmerie official with investigating the situation of the recruitment and use of child soldiers in government-supported self-defense militias, with an eye to ending the practice immediately; the outcome of this investigation is unknown.\nThe Ministry of Justice ensured that identified victims were not penalized for unlawful acts committed as a direct result of being trafficked. It claimed to encourage victims to assist in the investigation and prosecution of traffickers, and to file suits against them for damages; these options do not appear to have been used during the reporting period. The government does not provide legal alternatives to the removal of foreign victims to countries where they face hardship or retribution, and does not offer assistance to its own nationals who are repatriated as victims of trafficking.\nPrevention (2010)\nThe government acknowledged that human trafficking is a problem in the country, and undertook few anti-trafficking prevention efforts during the reporting period. Most visibly, officials launched a human trafficking awareness campaign in June 2009 to coincide with the annual Day of the African Child, though there was limited follow-up on the themes presented after the day of the event. In January 2010, the Minister of Interior spoke on national radio about the overall poor law and order situation in the country, referencing in particular problems of child trafficking. The Inter-Ministerial Committee to Fight Child Exploitation, which was suspended by the Minister of Justice in early 2008 pending a review of the draft Family Code to ensure the legislation authorized the existence of such a committee, was not reinstituted in 2009. The government did not take any measures to reduce the demand for forced labor or commercial sex acts during the year.\nSee also\n*Human rights in the Central African Republic\nReferences"
    }
  ]
}