{
  "content": [
    {
      "type": "text",
      "text": "# Human trafficking in Ireland\n\nIn 2008, Ireland was one of many destination countries for women, men, and children trafficked for the purposes of commercial sexual exploitation and forced labor.\nIreland ratified the  2000 UN TIP Protocol in June 2010. The Irish government has launched the ‘Blue Blindfold’ campaign to tackle this crime.\nAn Irish report noted that between 2014 and 2019, there were 346 victims officially identified in the country, with a suspected 132 more to be confirmed.\nIn its 2018 and 2019 Trafficking in Persons Report, the United States Department of State's Office to Monitor and Combat Trafficking in Persons noted that Ireland had been downgraded from a Tier 1 to a Tier 2 country, meaning it was no longer meeting \"the minimum standards for the elimination of trafficking but [..] making significant efforts to do so\". The 2018 report highlighted \"only three prosecutions\" and \"deficiencies in victim identification and referral\" as reasons for the downgrading. The country was placed at Tier 2 in 2023.\nInternational response\nThe 2022 GRETA report noted that the total number of presumed trafficking victims had more than halved since 2017; it also noted that there had been less investigations and no legal convictions since 2017.\nIn 2023, the Organised Crime Index gave the country a score of 5 out of 10 for human trafficking, noting that this was mostly carried out by international groups who were also involved in the illegal cannabis market.\nIn 2023, the International Organization for Migration published a report on human trafficking between the Republic of Ireland and Northern Ireland; it noted that increasing numbers of east Africans were entering the Republic and using the Common Travel Area to travel to Northern Ireland and enter the UK, and recommended all-island training and closer information systems between the two countries.\nLegislation\nIn Ireland, human trafficking offences are governed by the Criminal Law (Human Trafficking) Act 2008 and the Criminal Law (Human Trafficking) (Amendment) Act 2013. The 2008 act states that:\nThis article contains quotations from this source, which is released under the [http://www.oireachtas.ie/parliament/media/about/Oireachtas_PSI_-Licence_Open_Data.pdf Oireachtas Open Data PSI Licence], which applies the [https://creativecommons.org/licenses/by/4.0/legalcode Creative Commons Attribution 4.0 International License].}}\nIn 2017 there were reportedly three prosecutions under this legislation.\nUS State Department reports\nThe US Trafficking Victims Protection Act (TVPA), as amended, requires the US Secretary of State to submit an Annual Report to the US Congress assessing the actions of various countries across the world in the fight against trafficking in persons.\nThe US State Department on Thursday released a report showing a 73 per cent increase in the number of detected cases of human trafficking in Ireland since 2014. Ireland still retained Tier 1 Status in the US State Department Annual Human Trafficking Report of 2015. Ireland's Tier 1 status means the country's controls met the minimum standard for the elimination of severe forms of trafficking.\nAs the Republic of Ireland had been assessed by the State Department as meeting the minimum standard for the elimination of severe forms of trafficking as set out in the US Trafficking Victims Protection Act (TVPA), (as amended) it retained its top Tier 1 rating in 2015. Ireland had been classified as Tier 1 for the previous six years.\nAs is the norm for all countries, including Tier 1 countries, previous reports on Ireland have contained a number of recommendations for possible implementation. These recommendations are addressed within the context of the development of the Second National Action Plan to Prevent and Tackle Human Trafficking across the world.\nU.S. State Department's Office to Monitor and Combat Trafficking in Persons placed the country in \"Tier 1\" in 2017. However, in 2018 and 2019 the country was placed in \"Tier 2\". Other countries downgraded from Tier 1 to Tier 2, as of the 2019 report, included Germany and Denmark.\nThe country was placed at Tier 2 in 2023.\nReferences"
    }
  ]
}