{
  "content": [
    {
      "type": "text",
      "text": "# Hume and Hovell expedition__disambig_1\n\n}}\nThe Hume and Hovell expedition was a journey of exploration undertaken in eastern Australia. In 1824 the Governor of New South Wales, Sir Thomas Brisbane, commissioned Hamilton Hume and former Royal Navy Captain William Hovell to lead an expedition to find new grazing land in the south of the colony, and also to find an answer to the mystery of where New South Wales's western rivers flowed.\nSurveyor General John Oxley asserted that no river could fall into the sea between Cape Otway and Spencer Gulf, and that the country south of parallel of 34 degrees was ' uninhabitable and useless for all purposes of civilised men,' and for the time exploration in this direction was greatly discouraged. In 1824, newly appointed Sir Thomas Brisbane, who disbelieved this statement, offered to land a party of prisoners near Wilson's Promontory and grant them a free pardon, as well as a grant of land, to those who found their way overland to Sydney.\nAlexander Berry recommended the Governor to secure the services of Hume to lead the exploring party. Hume declined to undertake that task but instead offered, if supplied with men and horses, to go from Lake George to Bass Straits. This was not carried out. But shortly afterwards  Hume and W. H. Hovell, of Minto, agreed together to undertake an expedition in that direction. They found men and horses and bullocks; the Government furnished them with pack saddles, tarpaulins, tent, arms, ammunition, and skeleton charts.\nDeparture\nOn 2 October 1824, Hovell and Hume met at Hume's house in Appin, and started upon their expedition. The party, when complete, consisted of eight people, Hume and his three men, Claude Bossowa, Henry Angel, and James Fitzpatrick. As well as Hovell and his three men, Thomas Boyd, William Bollard, and Thomas Smith.\nThey reached Hume's station near 'Lake George' on the 13th. In those times, 'Lake George' also referred to the district, and Hume's station, Wooloobidallah—later called Collingwood Station—was closer to modern-day Gunning than to the lake. However, some of the party did make an excursion to the lake. On the 14th, \"''Hume and Hovell, with two of the men, proceed to Lake George, in order to ascertain the bearings and distance of the Lake from Hume's station''\". They returned to Hume's station at dusk. They started their journey on the 17th. On the 18th, they camped near the site of Hume's later residence, Cooma Cottage. On the 19th they passed Yarrh – or as they are now called Yass Plains.\nTheir first great difficulty was in crossing the Murrumbidgee which was in full flood at the time. The timber growing on the banks of this river was too heavy to float, so Hume resolved to make a raft of the body of one of their carts. Hume and Hovell's man Boyd, swam across the river first, with a small rope between their teeth, to which was attached a line long enough to reach across the river. It was a work of peril, as the current was strong. But they succeeded, and then, with much labour, got the whole party, with baggage and cattle, safely over.\nOn 24 October they came up to what seemed an impenetrable mountain barrier. There was an argument between the leaders concerning the best route to take which resulted in the party splitting up. The equipment was divided, and they prepared to cut their one tent in halves. Hume and Hovell fought bitterly over the frying-pan, which broke in their hands. One of them taking the handle, the other the pan itself. Later, however, Hovell rejoined Hume when he found he had made a mistake.\nHume, with two men, following a chain of ponds, came to a chasm through which the whole party afterwards descended. On the 31st they found themselves on the western edge of the tableland. The descent was not accomplished without much difficulty. On 6 November, they came in sight of the snow-covered Australian Alps. They came after this upon a very rich country, abounding in kangaroos and other animals, with frequent tracks of aborigines; and on Tuesday, 16 November, they arrived suddenly on the banks of a \"fine river\".\nHume was the first to see the river, near the site of Albury and named it the \"Hume\", (now the Murray River) after his father. This river, where they first came upon it, is about 50m in breadth, and of considerable depth. The current was about three miles an hour, and the water clear.\nThey improvised a tarpaulin covered wicker boat and they were able to eventually cross and continue into what is now known as Victoria.\nThey proceeded south crossing the Ovens River and Goulburn River by a route further to the east of the Hume Highway and closer to the foothills of Mount Buffalo.\nCrossing the Great Divide\nFour days after crossing the Goulburn River, impassable country was reached. The party spent three days attempting to cross the Great Dividing Range at Mt Disappointment but were thwarted. Hume shifted direction to the west and, on the 12 December, reached less hilly country at the future township of Broadford, where they camped.\nHume headed towards similarly low ranges to the south and found a pass in that direction next day. He led the party across the Dividing Range at Hume’s Pass, Wandong, and, on 16 December 1824, reached Corio Bay, an arm of Port Phillip Bay, at Bird Rock, Point Lillias, north of the future site of  Geelong.\nHovell left incontrovertible surveying proof of the Geelong location when he took a bearing of N10W (350 degrees) from there to Mt Flinders (Mt Wollstonecraft, You Yangs), at a distance of 8 miles, and wrote it in his diary that still exists.\nHovell claimed that he had measured their longitude on the same day but, in reality, he had read it off the sketch map that they had drafted themselves during the trip. In 1867, Hovell admitted that he did not take any longitude measurements and blamed Hume for it.\nPrior to that admission, Dr William Bland, who wrote the first book on the journey in 1831, invented the myth that Hovell made an error of one degree in longitude in order to protect the explorer. It was not the only myth emanating from the pen of Bland. From 1825, Hume wrote on four occasions that he had reached Western Port, his original destination. That was repeated in nine newspaper articles by Bland. It was not until 1827, when it was demonstrated by Hovell that the journey had ended near Geelong, that the pair changed their stories to identify that location.\nOn 18 December, the party turned back towards New South Wales. Hume chose to travel more to the west to avoid the mountainous country and save considerable time. It was a sound decision because, on 16 January 1825, just as their flour ran out, they reached the carts they had left behind. Two days later, they arrived at Hume's station at Gunning.\nOn 18 November 1826, based on the discoveries of Hume and Hovell, Colonel Stewart, Captain S. Wright, and Lieutenant Burchell were sent in  (Captain Wetherall), with the brigs Dragon and Amity, under orders to proceed to Western Port and establish a colony there. They took a number of convicts and a small force of troops from the 3rd and 93rd regiments. Hovell was sent with the party as guide. While exploring Western Port, it became apparent to Hovell that he had not reached it on his earlier trip.\nBoth Hovell and Hume were publicly rebuked for their error in incorrectly identifying Western Port. They had become implicated by association with the wasted expense of setting up a new settlement there, based upon their fulsome recommendations of the value of the region.\nReturn to Sydney\nRelations between the \"currency lad\" (first-generation Australian) Hume and the aloof Englishman Hovell had deteriorated, and they raced each other back to Sydney to claim credit for their discoveries. They arrived in January, 1825, and were both rewarded with large land grants by Governor Brisbane. They later published conflicting accounts of the journey, each claiming leadership.\nThe Hume and Hovell expedition disproved the widely held view that the interior of Australia was an uninhabitable wilderness. They found abundant well-watered grazing land between the Murrumbidgee and the Murray, on the huge fertile coastal plains around Port Phillip, and then on the plains across North Eastern Victoria all the way to the Murray River during their return journey. It took another thirteen years for settlers from New South Wales to follow their route in 1837, and only after the richness of the territory was confirmed by Sir Thomas Mitchell in 1836. Some parts of their route formed the Hume Highway from Sydney to Melbourne via Albury.\nThe route\nImage:Hume&hovellmap1.gif|Route of Hume & Hovell expedition, 5 to 12 November 1824\nImage:Hume&hovellMap2a.gif|Route of Hume & Hovell expedition 12 to 21 November 1824\nImage:Hume&HovellMap3.gif|Route of Hume & Hovell expedition 22 to 30 November 1824\nImage:Hume&hovellMap4.jpg|Route of Hume & Hovell expedition 1 to 14 December 1824\nImage:Hume&hovellMap5.gif|Route of Hume & Hovell expedition 15 to 19 December 1824\nMonuments\nWithin the Greater Melbourne area, monuments commemorating the route of the Hume and Hovell expedition can be found at Beveridge, Greenvale, St. Albans, Werribee and Lara. There are also monuments in other locations in north-eastern Victoria and southern New South Wales.\nAppin, New South Wales\nMyrtleford\nBeveridge, Victoria\nThis Beveridge Monument and interpretive panel was built in 1999, at the foot of Mount Fraser, to mark the location from which Hume & Hovell first sighted the sea.\nThe original monument, erected in 1924, is on private land nearby.\nImage:Beveridge Victoria Hume and Hovell Monument.jpg|The Monument\nImage:Beveridge Victoria Hume and Hovell Monument Rock.jpg|The Plaque\nImage:Beveridge Victoria Hume and Hovell Monument Sign.jpg|The Sign\nEbden, Victoria\nEbden, Victoria\nImage:EbdenHume&HovellMemorial.JPG|Ebden Hume & Hovell Memorial\nEuroa, Victoria\nMonument at Euroa.\nImage:Hume & Hovell Monument Euroa.jpg|Euroa Hume and Hovell Monument\nGunning, NSW\nImage:Hume and Hovell Monument, Gunning.jpg|Hume and Hovell Monument, Gunning\nImage:Gunning Barbour Park Hume and Hovell Memorial C.JPG|Gunning Barbour Park Hume and Hovell Memorial\nLara, Victoria\nMonument at Lara.\nImage:Hume-and-hovell-memorial-lara.jpg|The Monument\nMurmungee, Victoria\nMonument at Murmungee, VIC\nImage:Murmungee Hume and Hovell Monument 002.JPG|Murmungee Hume and Hovell Monument\nNotes\nReferences\n* Hume and Hovell, 1824. Edited by Alan E. I. Andrews: Blubber Head Press, Hobart, 1981.\n*"
    }
  ]
}