{
  "content": [
    {
      "type": "text",
      "text": "# Hun subculture\n\nHun culture (also hon culture) is a British subculture that is popular with women and gay men. It often revolves around the \"stanning\" of usually British female celebrities who are often pop singers, reality television stars and soap opera actresses and characters who are considered gay icons. It often relies on \"camp\" and niche humour.\nOrigin\nare popular with the huns.]]\n\"Hun culture\" (hun or hon), originating from the term of endearment honey, celebrates \"naff\" and deifies soap actors, reality TV icons and female pop stars. The culture mixes nostalgia, camp humour and irony-laced national pride. The Guardian wrote: \"If American social media influencers are preened, puckered and always on sponsored holidays, huns are sloppy, sarcastic and off on their \"holibobs\".\" The culture has encouraged the creation of social media accounts such as Loveofhuns, Huns and Giggles, and Hunsnet (a word play of Mumsnet), celebrating \"huns\". Comedian Jack Rooke made references to several \"huns\" in his Channel 4 sitcom Big Boys, including television presenter Alison Hammond, Big Brother 6 housemate Makosi Musambasi, and The X Factor contestant Gamu. Rooke said: \"I support hun culture because it's like, no, we’re going to celebrate these women that 15 years ago would just be constantly slagged off in the press.\"\nTelevision presenter and actress Denise Welch, who has been referred to as a hun, said \"I think if you're older and a survivor and still remaining relevant in whatever way, that makes you a hun.\" The Hundamental Guide to Life: Learn to Live, Love & Laugh Like a True Hun, a book based on hun culture written by Gareth Howells, was released in August 2022. Media personality and businesswoman Gemma Collins, who rose to fame on The Only Way Is Essex in 2011 and has subsequently maintained a media career, is considered a staple of \"hun culture\" and has been idolised for her popular catchphrases, diva behaviour and non conforming attitude. As a result, Collins became the subject of numerous internet memes and was branded a \"queen\". Steps singer Lisa Scott-Lee is often referenced in hun culture, most frequently for a moment in her television series Totally Scott Lee where she discovered her single, \"Get It On\" had peaked at number 23 in the UK Singles Charts, with Scott-Lee saying she was \"B List at Capital\" (referring to the station's playlist). The X Factor \"rejects\", applicants who failed to pass the first audition, such as Rachel Lester, Holly Jervis, Kelly Peakman, Dawn the Racing Jockey, Debbie Stevens, and girl group Ablisa are regularly referenced in \"hun culture\".\nAnother example popular within the culture is Nadine Coyle lying about her age on the Irish version of Popstars, and then misplacing her passport when confronted. \"Hun culture\" is often referenced on the BBC Three series ''RuPaul's Drag Race UK, an example being In the second series of the show, where during the episode \"The RuRuvision Song Contest\", the song which the contestants had to create a verse for was titled \"UK Hun?\".\nExamples\nThe following is a list of celebrities, animals, and fictional characters who have been referred to as a \"hun\".\n* Alan Carr, comedian\n* Alexandra Burke, singer and actress\n* Alison Hammond, television presenter\n* Amanda Holden, actress and television personality\n* Anthea Turner, television presenter\n* Britney Spears, American singer\n* Chanel, a parrot who went missing in April 2020 whose owner Sandra Hannah went viral for shouting her name on Facebook Live\n* Chantelle Houghton, winner of Celebrity Big Brother 4\n* Charley Uchea, housemate on Big Brother 8\n* Charlotte Church, singer and actress\n* Cheryl, singer\n* Claudia Winkleman, television presenter\n* Dani Harmer, actress best known for her role as Tracy Beaker\n* David Potts, reality television personality known for winning Celebrity Big Brother 23\n* Deirdre Barlow, fictional character played by Anne Kirkbride in the ITV soap opera Coronation Street\n* Denise Welch, actress and television presenter\n* Diane Abbott, Labour Party politician\n* Diane Carson, contestant on the second series of the BBC One game show The Traitors\n* Diane Parish, actress best known for playing Denise Fox in the BBC One soap opera EastEnders''\n* Ellie from Superdrug, Superdrug employee who appeared in a viral video about buying gifts for Father's Day\n* Gail Platt, fictional character played by Helen Worth in the ITV soap opera Coronation Street\n* Gemma Collins, media personality and businesswoman\n* Holly Jervis, contestant on The X Factor in 2008\n* Georgina Hill-Brown, better known as The Honest Vocal Coach, who posts singing reviews on YouTube\n* Jane Boulton, television personality known for appearing on Airline\n* Jade Thirlwall, singer and member of the girl group Little Mix\n* Jane McDonald, singer and presenter\n* Jo Frost, television personality known for Supernanny\n* Judi Love, comedian and presenter\n* Kat Slater, fictional character played by Jessie Wallace in the BBC One soap opera EastEnders\n* Kelly Peakman, contestant on The X Factor known for calling Simon Cowell \"very very [h]arsh\"\n* Kerry Katona, singer and media personality\n* Kim Woodburn, cleaner and television personality\n* Katie Price, media personality\n* Leanne Cheung, television personality known for appearing on Airline\n* Linda Rands, contestant on the third series of the BBC One game show The Traitors\n* Lindsay Lohan, American actress\n* Lisa Maffia, rapper known for being the Queen of UK Garage music and lead singer of So Solid Crew\n* Lisa Scott-Lee, singer known for being a member of the pop group Steps\n* Meena Jutla, fictional character played by Paige Sandhu in the ITV soap opera Emmerdale\n* Michelle McManus, singer, radio broadcaster and columnist\n* Nadine Coyle, singer\n* Naomi Campbell, supermodel\n* Natalie Cassidy, actress best known for playing Sonia Fowler in the BBC One soap opera EastEnders\n* Nigella Lawson, chef and presenter\n* Nikki Grahame, television personality who was known for appearing on Big Brother 7\n* Pam Shipman, fictional character played by Alison Steadman in the BBC sitcom Gavin & Stacey\n* Pat Butcher, fictional character played by Pam St Clement in the BBC One soap opera EastEnders\n* Peggy Mitchell, fictional character played by Barbara Windsor in the BBC One soap opera EastEnders\n* Rebecca More, pornographic actress, formerly known as one half of the \"Cock Destroyers\"\n* Ruth Langsford, television presenter\n* Sharon Osbourne, television personality and music producer\n* Sharon Watts, fictional character played by Letitia Dean in the BBC One soap opera EastEnders\n* Shobna Gulati, actor best known for playing Sunita Alahan in the ITV soap opera Coronation Street\n* Sophie Anderson, pornographic actress, formerly known as one half of the \"Cock Destroyers\"\n* Sue Tuke, better known as \"Charity Shop Sue\", a fictional comedy character played by Selina Mosinski in the mockumentary-style web series Charity Shop Sue\n* Tiffany Pollard, American television personality\n* Tina Malone, actress\n* Vanessa Feltz, broadcaster and presenter\n* Vanessa Gold, fictional character played by Zöe Lucker in the BBC One soap opera EastEnders\n* Victoria Beckham, singer and businesswoman\n* Wendy Williams, American former talk show host\nReferences"
    }
  ]
}