{
  "content": [
    {
      "type": "text",
      "text": "# Huna Tlingit Traditional Gull Egg Use Act\n\n| cite statutes at large =\n| acts affected = Alaska National Interest Lands Conservation Act\n| acts repealed   =\n| title affected   =\n| sections created =\n| sections affected = ,\n| agenciesaffected = United States Department of the Interior\n| authorizationsofappropriations =\n| appropriations =\n| leghisturl      =\n| introducedin    = House\n| introducedbill  =\n| introducedby    = Rep. Don Young (R, AK-0)\n| introduceddate  = September 17, 2013\n| committees      = United States House Committee on Natural Resources, United States House Natural Resources Subcommittee on Indian and Alaska Native Affairs, United States House Natural Resources Subcommittee on Public Lands and Environmental Regulation\n| passedbody1     = House\n| passeddate1     = April 28, 2014\n| passedvote1     = voice vote\n| passedbody2     = Senate\n| passedas2       =\n| passeddate2     = July 9, 2014\n| passedvote2     = unanimous consent\n| conferencedate  =\n| passedbody3     =\n| passeddate3     =\n| passedvote3     =\n| agreedbody3     =\n| agreeddate3     =\n| agreedvote3     =\n| agreedbody4     =\n| agreeddate4     =\n| agreedvote4     =\n| passedbody4     =\n| passeddate4     =\n| passedvote4     =\n| signedpresident = Barack Obama\n| signeddate      = July 25, 2014\n| unsignedpresident =\n| unsigneddate    =\n| vetoedpresident =\n| vetoeddate      =\n| overriddenbody1 =\n| overriddendate1 =\n| overriddenvote1 =\n| overriddenbody2 =\n| overriddendate2 =\n| overriddenvote2 =\n| amendments      =\n| SCOTUS cases    =\n}}\nThe Huna Tlingit Traditional Gull Egg Use Act (; ) is a U.S. public law that authorizes the Hoonah Indian Association to harvest glaucous-winged gull eggs from Glacier Bay National Park in Alaska twice a year from up to five locations.\nThe bill was introduced into the United States House of Representatives during the 113th United States Congress.\nBackground\nThe Glacier Bay National Park Resources Management Act of 2000 () ordered the Department of the Interior to study this situation to decide if the Huna Tlingit could begin gull egg collection again \"without impairing the biological sustainability of the gull population in the park.\" Their recommendations were completed and announced in August 2010. The Huna Tlingit had been prohibited by the federal government from collecting the eggs for nearly 50 years. The collection of the eggs is part of a long cultural heritage.\nProvisions of the bill\nThis summary is based largely on the summary provided by the Congressional Research Service, a public domain source.\nThe Huna Tlingit Traditional Gull Egg Use Act would authorize the Secretary of the Interior to allow members of the Hoonah Indian Association to collect the eggs of glaucous-winged gulls up to two times a year at up to five locations within Alaska's Glacier Bay National Park.\nThe bill would consider the collection of those eggs within the Park by the Association to be a use specifically permitted by the Alaska National Interest Lands Conservation Act.\nThe bill would require collection schedules and locations to be based on an annual plan prepared by the Secretary and the Association.\nCongressional Budget office report\nThis summary is based largely on the summary provided by the Congressional Budget Office, as ordered reported by the House Committee on Natural Resources on February 27, 2014. This is a public domain source.\nH.R. 3110 would authorize the Hoonah Indian Association to harvest glaucous-winged gull eggs from Glacier Bay National Park in Alaska. Under the legislation, the Association would be permitted to harvest eggs not more than twice a year from up to five locations within the park. The bill would also direct the United States Department of the Interior to develop an annual harvest plan with the Association.\nBased on information provided by the United States National Park Service, the Congressional Budget Office (CBO) estimates that implementing H.R. 3110 would have no significant impact on the federal budget. Enacting H.R. 3110 would not affect direct spending or revenues; therefore, pay-as-you-go procedures do not apply.\nH.R. 3110 contains no intergovernmental or private-sector mandates as defined in the Unfunded Mandates Reform Act and would impose no costs on state, local, or tribal governments.\nOn May 29, 2013, CBO transmitted a cost estimate for S. 156, the Huna Tlingit Traditional Gull Egg Use Act, as ordered reported by the Senate Committee on Energy and Natural Resources on May 16, 2013. The two bills are similar, and the CBO cost estimates are the same.\nProcedural history\nThe Huna Tlingit Traditional Gull Egg Use Act was introduced into the United States House of Representatives on September 17, 2013 by Rep. Don Young (R, AK-0). It was referred to the United States House Committee on Natural Resources, the United States House Natural Resources Subcommittee on Indian and Alaska Native Affairs, and the United States House Natural Resources Subcommittee on Public Lands and Environmental Regulation. The bill was reported (amended) by the committee on April 1, 2014 alongside [http://beta.congress.gov/113/crpt/hrpt393/CRPT-113hrpt393.pdf House Report 113-393]. On April 28, 2014, the bill passed the House in a voice vote. The bill then passed the Senate by unanimous consent on July 9, 2014. President Barack Obama signed it into law on July 25, 2014.\nDebate and discussion\nHerbert Frost, the Associate Director of National Resource Stewardship and Science for the National Park Service, testified before the House Natural Resources Subcommittee on Indian and Alaska Native Affairs on February 5, 2014. Frost said that the Department of the Interior was in favor of the bill because it \"provides for the restoration of an important cultural connection to Glacier Bay by the Huna Tlingit, and provides for the environmentally preferred action identified in our studies.\"\nRep. Don Young (R-AK) said that \"passage of this legislation is an important step for upholding the traditional way of life for Alaska's First People.\" Young also said that \"it’s a shame that even after Congress amended the Migratory Bird Act in 1995 to allow for customary and traditional use of migratory birds by indigenous inhabitants of Alaska, gull egg harvests remained prohibited under National Park Service regulation.\"\nRobert Starbard, the Hoonah Indian Association's Tribal Administrator, said that \"eggs are a healthy springtime food and egg harvesting activities provide opportunities for family bonding, inter-generational learning, and connection to homeland.\"\nSee also\n*List of bills in the 113th United States Congress\nReferences\nExternal links\n*[http://hdl.loc.gov/loc.uscongress/legislation.113hr3110 Library of Congress - Thomas H.R. 3110]\n*[http://beta.congress.gov/bill/113th-congress/house-bill/3110 beta.congress.gov H.R. 3110]\n*[https://www.govtrack.us/congress/bills/113/hr3110 GovTrack.us H.R. 3110]\n*[http://www.opencongress.org/bill/hr3110-113/show OpenCongress.org H.R. 3110]\n*[http://www.washingtonwatch.com/bills/show/113_HR_3110.html WashingtonWatch.com H.R. 3110]\n*[http://www.cbo.gov/publication/45171 Congressional Budget Office's report on H.R. 3110]\n*[http://beta.congress.gov/113/crpt/hrpt393/CRPT-113hrpt393.pdf House Report 113-393 on H.R. 3110]."
    }
  ]
}