{
  "content": [
    {
      "type": "text",
      "text": "# Hundred Years' War, 1345–1347\n\n| commander2 = King Philip VIJohn, Duke of Normandy\n| casualties1 = Unknown, light\n| casualties2 = Unknown, heavy\n}}\nEnglish offensives in 1345–1347, during the Hundred Years' War, resulted in repeated defeats of the French, the loss or devastation of much French territory and the capture by the English of the port of Calais. The war had broken out in 1337 and flared up in 1340 when the king of England, Edward III, laid claim to the French crown and campaigned in northern France. There was then a lull in the major hostilities, although much small-scale fighting continued.\nEdward determined early in 1345 to renew full-scale war and personally led the main English army to northern France. Edward delayed its disembarkation, and his fleet was scattered by a storm, ruining this offensive. He also despatched a small force to Gascony in south-west France under Henry, Earl of Derby, which was spectacularly successful. The following spring a large French army, led by the heir to the French throne, John, Duke of Normandy, counter-attacked Derby's forces.\nEdward responded by landing an army of 10,000 men in northern Normandy. The English devastated much of Normandy and stormed and sacked Caen, slaughtering the population. They cut a swath along the left bank of the Seine to within  of Paris. The English army then turned north and inflicted a heavy defeat on a French army led by their king, Philip VI, at the Battle of Crécy on 26 August 1346. They promptly exploited this by laying siege to Calais. The period from Derby's victory outside Bergerac in late August 1345 to the start of the siege of Calais on 4 September 1346 became known as Edward III's  (year of marvels).\nAfter an eleven-month siege, which stretched both countries' financial and military resources to the limit, the town fell. Shortly afterwards, the Truce of Calais was agreed; it ran for nine months to 7July 1348, but was extended repeatedly until it was formally set aside in 1355. The war eventually ended in 1453 with the English expelled from all French territory except Calais, which served as an English entrepôt into northern France until 1558.\nBackground\n| image2 = Philippe VI de Valois (cropped).jpg\n| alt2 = A Medieval image of Philip VI seated, wearing a blue robe\n| caption2 =\n| footer =\n}}\nSince the Norman Conquest of 1066, English monarchs had held titles and lands within France by inheritance. Their possession made them vassals of the kings of France. The status of the English king's French fiefs was a major source of conflict between the two monarchies throughout the Middle Ages. French monarchs systematically sought to check the growth of English power, stripping away lands as the opportunity arose. Over the centuries, English holdings in France had varied in size, but by 1337 only Gascony in south western France and Ponthieu in northern France were left. The Gascons preferred their relationship with a distant English king who left them alone to one with a French king who would interfere in their affairs. Following a series of disagreements between Philip VI of France () and Edward III of England (), on 24 May 1337 Philip's Great Council in Paris agreed that Gascony and Ponthieu should be taken back into Philip's hands on the grounds that Edward was in breach of his obligations as a vassal. This marked the start of the Hundred Years' War, which was to last 116 years.\nAlthough Gascony was the cause of the war, Edward was able to spare few resources for it, and whenever an English army campaigned on the continent during the first eight years of the war it operated in northern France. In 1340, Edward laid formal claim to the Kingdom of France, as the closest male relative of Philip's predecessor, Charles&nbsp;IV. He then led an inconclusive and vastly expensive campaign against Tournai, after which there was a relative lull in the fighting, formalised in the Truce of Espléchin the same year.\nPlans\nEdward determined early in 1345 to renew full-scale war and to attack France on three fronts: William, Earl of Northampton, would lead a small force to Brittany, a slightly larger force would proceed to Gascony under the command of Henry, Earl of Derby, and the main force would accompany Edward to either northern France or Flanders. The previous Seneschal of Gascony, Nicholas de la Beche, was replaced by the more senior Ralph, Earl of Stafford, who sailed for Gascony in February with an advance force.\nFrench intelligence had uncovered the English plan for offensives in the three theatres, but France did not have the money to raise a major army in each. The French anticipated, correctly, that the English planned to make their main effort in northern France. Thus they directed what resources they had there, planning to assemble their main army at Arras on 22July. South-western France was encouraged to rely on its own resources, but as the Truce of Malestroit, signed in early 1343, was still in effect, the local lords were reluctant to spend money and little was done.\n1345\nEdward's main army sailed on 29 June. They anchored off Sluys in Flanders until 22July, while Edward attended to diplomatic affairs. When they subsequently sailed, probably intending to land in Normandy, they were scattered by a storm and found their way to English ports over the following week. After more than five weeks on board ship, the men and horses had to be disembarked. There was a further week's delay while the King and his council debated what to do, by which time it proved impossible to take any action with this force before winter. Aware of this, Philip despatched reinforcements to Brittany and Gascony. Peter, Duke of Bourbon was appointed commander-in-chief of the south-west front on 8August.\nGascon campaign\nDerby's force embarked at Southampton at the end of May 1345. Bad weather forced his fleet of 151 ships to shelter in Falmouth for several weeks en route, finally departing on 23July. The Gascons, primed by Stafford to expect Derby's arrival in late May and sensing the French weakness, took the field without him. The Gascons captured the large, weakly garrisoned castles of Montravel and Monbreton on the Dordogne in early June; both were taken by surprise and their seizure broke the tenuous Truce of Malestroit. Stafford carried out a short march north to besiege Blaye. He left the Gascons to prosecute this and proceeded to Langon, south of Bordeaux, to set up a second siege. The French issued an urgent call to arms.\nMeanwhile, small independent parties of Gascons raided across the region. Local French groups joined them, and several minor nobles threw in their lot with the Anglo-Gascons. They had some successes, but their main effect was to tie down most of the French garrisons in the region and to cause them to call for reinforcements – to no avail. The few French troops not garrisoning fortifications immobilised themselves with sieges of English-controlled fortifications: Casseneuil in the Agenais; Monchamp near Condom; and Montcuq, a strong but strategically insignificant castle south of Bergerac. Large areas were left effectively undefended.\nOn 9August Derby arrived in Bordeaux with 500 men-at-arms, 1,500 English and Welsh archers, 500 of them mounted on ponies to increase their mobility, and ancillary and support troops, such as a team of 24 miners. The majority were veterans of earlier campaigns. After two weeks of further recruiting and consolidation of his forces Derby decided on a change of strategy. Rather than continue a war of sieges he determined to strike directly at the French before they could concentrate their forces. The French in the region were under the command of Bertrand de l'Isle-Jourdain, who was assembling his forces at the communications centre and strategically important town of Bergerac. This was  east of Bordeaux and controlled an important bridge over the Dordogne River.\nDerby's offensive\nDerby moved rapidly and took the French army by surprise in late August 1345, ambushing its cavalry component outside Bergerac and then driving its panicking infantry back to the town. French casualties were heavy, with many killed and a large number captured, including their commander. The surviving French rallied around John, Count of Armagnac, and retreated north to Périgueux, the provincial capital. Within days of the battle, Bergerac fell to an Anglo-Gascon assault and was subsequently sacked. After consolidating and reorganising for two weeks Derby left a large garrison in the town and moved north to Périgueux, taking several strong points on the way.\nDuring September, John, Duke of Normandy, the son and heir of Philip VI, gathered an army reportedly numbering more than 20,000 men and manoeuvred in the area. In early October a very large detachment drove off Derby's force, which withdrew towards Bordeaux. Further reinforced, the French started besieging the English-held strong points. A French force of 7,000, commanded by Louis of Poitiers, besieged the castle of Auberoche,  east of Périgueux. After a night march Derby attacked the French camp on 21October while they were at dinner, taking them by surprise and causing heavy initial casualties. The French rallied and there was a protracted hand-to-hand struggle, which ended when the commander of the small English garrison in the castle sortied and fell upon the rear of the French. They broke and fled. French casualties are described by modern historians as \"appalling\", \"extremely high\", \"staggering\", and \"heavy\". Many French nobles were taken prisoner; lower ranking men were, as was customary, killed on the spot. The French commander, Louis of Poitiers, died of his wounds. Surviving prisoners included l'Isle-Jourdain, the second in command, two counts, seven viscounts, three barons, the seneschals of Clermont and Toulouse, a nephew of the Pope and so many knights that they were not counted.\nThe four-month campaign has been described as \"the first successful land campaign of... the Hundred Years' War\", which had commenced more than eight years earlier. Modern historians have praised the generalship demonstrated by Derby in this campaign: \"superb and innovative tactician\"; \"ris[ing] to the level of genius\"; \"brilliant in the extreme\"; \"stunning\"; \"brilliant\". A chronicler writing fifty years after the event described him as \"one of the best warriors in the world\".\n1346\nSiege of Aiguillon\nFor the 1346 campaigning season Duke John was again placed in charge of all French forces in south-west France. In March a French army of between 15,000 and 20,000, enormously superior to any force the Anglo-Gascons could field, marched on the Anglo-Gascon-held town of Aiguillon and besieged it on 1April. On 2April an arrière-ban, a formal call to arms for all able-bodied males, was announced for southern France. French national financial, logistical and manpower efforts were focused on this offensive.\nCrécy campaign\nDuring the first six months of 1346 Edward again gathered a large army in England. The French were aware of this, but given the extreme difficulty of disembarking an army other than at a port, the English no longer having access to a port in Flanders, but with friendly ports in Brittany and Gascony, they assumed Edward would sail for one of the latter; probably Gascony, in order to relieve Aiguillon. To guard against any possibility of an English landing in northern France, Philip VI relied on his powerful navy. This reliance was misplaced as his navy was late assembling and in any event would have been unable to effectively patrol the whole Channel. Edward's army embarked in the largest fleet ever assembled by the English to that date, 747 ships. The French were unable to prevent Edward successfully crossing the Channel and landing at St. Vaast la Hogue on 12 July,  from Cherbourg in northern Normandy. The English army was approximately 10,000 strong and it achieved complete strategic surprise. Philip recalled his main army, under Duke John, from Gascony. After a furious argument with his advisers, and according to some accounts his father's messenger, John refused to move until his honour was satisfied by the fall of the Aiguillon.\nEdward's aim was to conduct a chevauchée, a large-scale raid, across French territory to reduce his opponent's morale and wealth by razing his towns and stealing the populace's portable wealth. His army marched south through the Cotentin peninsula, cutting a wide swath of destruction through some of the richest lands in France and burning every town they passed. The English fleet paralleled the army's route and landing parties devastated the country for up to  inland, taking vast amounts of loot; after their crews filled their holds, many ships deserted. The fleet also captured or burnt more than 100 French ships; 61 of these had been converted into military vessels. Caen, the cultural, political, religious and financial centre of north-west Normandy, was stormed on 26 July. Much of the population was massacred, there was an orgy of drunken rape and the city was sacked for five days.\nOn 29 July Philip called an arrière-ban for northern France at Rouen. The English army marched out of Caen towards the River Seine on 1 August, arriving on the 7th. Philip again sent orders to John insisting he abandon the siege of Aiguillon and march his army north. Meanwhile the English devastated the country to the suburbs of Rouen before leaving a swath of destruction, rapine and slaughter along the left bank of the Seine to Poissy,  from Paris, which they reached on 12 August. On 14 August John attempted to arrange a local truce at Aiguillon. Lancaster, as Derby was now known,|group=note}} well aware of the situation in the north and in the French camps around Aiguillon, refused. On 20 August, after five months of siege, the French abandoned the operation and marched away in considerable haste and disorder. On 16 August the English army outside Paris had turned north, they then became trapped in territory which the French had denuded of food. They escaped by fighting their way across the Somme against a French blocking force in the Battle of Blanchetaque on 24 August.\nBattle of Crécy\nTwo days later, on 26 August 1346, fighting on ground of their own choosing, the English offered battle to the French at the Battle of Crécy. The French army was very large for the period, several times larger than the English force. The French unfurled their sacred battle banner, the , indicating that no prisoners would be taken. There was an initial archery exchange, which the English won, routing the Italian crossbowmen opposing them.\nThe French then launched cavalry charges by their mounted knights at the English men-at-arms, who had dismounted for the battle. These charges were disordered because of their impromptu nature, by having to force their way through the fleeing Italians, by the muddy ground, by having to charge uphill, and by pits dug by the English. The attacks were further broken up by fire from the English archers, which caused heavy casualties. By the time the French charges reached the English infantry they had lost much of their impetus. A contemporary described the hand-to-hand combat which ensued as \"murderous, without pity, cruel, and very horrible\". The French charges continued into the night, all with the same result: fierce fighting followed by a French repulse. Philip himself was caught up in the fighting, had two horses killed from underneath him, and received an arrow in the jaw. The  was captured after its bearer was killed. The French broke and fled; the English, exhausted, slept where they had fought.\nThe French losses were very heavy and were recorded at the time as 1,200 knights and over 15,000 others killed. The highest contemporary estimate of English fatalities was 300. The scale of the English victory is described by the modern historian Andrew Ayton as \"unprecedented\" and \"a devastating military humiliation\" for the French. The modern historian Jonathan Sumption considers it \"a political catastrophe for the French Crown\". The battle was reported to the English Parliament on 13 September in glowing terms as a sign of divine favour and as a justification for the huge cost of the war to date.\nSiege of Calais\nAfter resting for two days and burying the dead, the English marched north. They continued to devastate the land, and set several towns on fire, including Wissant, the normal port of disembarkation for English shipping to northern France. Outside the burning town Edward held a council, which decided to capture Calais. This was an ideal entrepôt from an English point of view, possessing a secure harbour and established port facilities, and being in the part of France closest to the ports of south-east England. It was also close to the border of Flanders, which was nominally part of France, but in rebellion, allied to the English and willing to send troops to assist Edward. The English arrived outside the town on 4September and besieged it.\nCalais was strongly fortified, surrounded by extensive marshes, adequately garrisoned and provisioned, and could be reinforced and supplied by sea. The day after the siege commenced, English ships arrived off-shore and resupplied, re-equipped and reinforced the English army. Over time a major victualling operation drew on sources throughout England and Wales to supply the besiegers, as well as overland from nearby Flanders. Parliament grudgingly agreed to fund the siege. Edward declared it a matter of honour and avowed his intent to remain until the town fell. The period from Derby's victory outside Bergerac in late August 1345 and the start of the siege of Calais on 4 September became known as Edward III's  (year of marvels).\nFrench operations\nPhilip vacillated: on the day the siege of Calais began he disbanded most of his army, to save money and convinced Edward had finished his chevauchée and would proceed to Flanders and ship his army home. On or shortly after 7September, Duke John made contact with Philip, having just disbanded his own army. On 9September Philip announced the army would reassemble at Compiègne on 1October, an impossibly short interval, and then march to the relief of Calais.\nAmong other consequences, this equivocation allowed Lancaster in the south west to launch offensives into Quercy and the Bazadais; and himself lead a chevauchée  north through Saintonge, Aunis and Poitou, capturing numerous towns, castles and smaller fortified places and storming the rich city of Poitiers. These offensives completely disrupted the French defences and shifted the focus of the fighting from the heart of Gascony to  or more beyond its borders. Few French troops had arrived at Compiègne by 1October and as Philip and his court waited for the numbers to swell, news of Lancaster's conquests came in. Believing Lancaster was heading for Paris, the French changed the assembly point for any men not already committed to Compiègne to Orléans, and reinforced them with some of those already mustered, to block this. After Lancaster turned south to head back to Gascony, those Frenchmen already at or heading towards Orléans were redirected to Compiègne; French planning collapsed into chaos.\nEven though only 3,000 men-at-arms had assembled at Compiègne, the French treasurer was unable to pay them. Philip cancelled all offensive arrangements on 27 October and dispersed his army. Recriminations were rife: officials at all levels of the Chambre des Comptes (the French treasury) were dismissed and all financial affairs were put into the hands of a committee of three senior abbots. The King's council bent their efforts to blaming each other for the kingdom's misfortunes. Duke John fell out with his father and refused to attend court for several months.\nBattle of Neville's Cross\nPhilip had been calling on the Scots to fulfil their obligation under the terms of the Auld Alliance and invade England since June 1346. The Scottish King, David II, convinced that English force was focused entirely on France, obliged on 7October. He was taken by surprise by the appearance of a smaller English force raised exclusively from the northern English counties. A battle was fought at Neville's Cross outside Durham on 17 October. It ended with the rout of the Scots, the capture of their King and the death or capture of most of their leadership. Strategically the battle freed English forces for the war against France, and the English border counties were able to guard against the remaining Scottish threat from their own resources.\n1347\nFall of Calais\nDuring the winter the French made great efforts to strengthen their naval resources. These included French and mercenary Italian galleys and French merchant ships, many adapted for military use. During March and April 1347, more than  of supplies were run into Calais without opposition. Philip attempted to take the field in late April, but the French ability to assemble their army in a timely fashion had not improved since the autumn and by July it had still not fully mustered. In April and May the French tried and failed to cut the English supply route to Flanders while the English tried and failed to capture Saint-Omer and Lille.\nIn late April the English established a fortification which enabled them to command the entrance to the harbour. In May, June and July the French attempted to force convoys through, unsuccessfully. On 25 June the commander of the Calais garrison wrote to Philip saying their food was exhausted and suggesting they may have to resort to cannibalism. Despite increasing financial difficulties, the English steadily reinforced their army through 1347, reaching a peak strength of 32,000.|group=note}} A force of 20,000 Flemish allies gathered less than a day's march from Calais. These forces were supported by 24,000 sailors, in a total of 853 ships.|group=note}} On 17 July Philip led the French army north to within view of the town,  away. Their army was between 15,000 and 20,000 strong. The English position clearly being unassailable, Philip hesitated. On the night of 1August the  French withdrew. On 3 August 1347 Calais surrendered and the entire French population was expelled. A vast amount of booty was found within the town. Edward repopulated Calais with English, and a few Flemings. Calais was vital to England's effort against the French for the rest of the war and served as an English entrepôt into northern France for more than two hundred years. It allowed the accumulation of supplies and materiel prior to a campaign. A ring of substantial fortifications defending the approaches to Calais were rapidly constructed, marking the boundary of an area known as the Pale of Calais.\nTruce\nAs soon as Calais capitulated, Edward paid off much of his army and released his Flemish allies. Philip in turn stood down the French army. Edward promptly launched strong raids up to  into French territory. Philip attempted to recall his army but experienced serious difficulties. His treasury was exhausted and taxes for the war had to be collected in many places at sword point. Despite these exigencies, ready cash was not forthcoming. The French army had little stomach for further conflict, and Philip was reduced to threatening to confiscate the estates of nobles who refused to muster. He set back the date for his army to assemble by a month. Edward also had difficulties in raising money, partly because he had not anticipated a return to large-scale conflict and so had an empty treasury; he employed draconian measures to raise money, which were extremely unpopular. The English also suffered two military setbacks: a large raid was routed by the French garrison of Saint-Omer; and a supply convoy en route to Calais was captured by French raiders from Boulogne.\nTwo cardinals acting as papal emissaries found the two kings to be willing to listen to their proposals. On 28 September 1347 a truce, known as the Truce of Calais, was formally agreed. The truce is considered to have most favoured the English. For its duration the English were confirmed in possession of their extensive territorial conquests in France and Scotland; the Flemish were confirmed in their de facto independence; and Philip was prevented from punishing those French nobles who had conspired, or even fought, against him. It ran for nine months to 7 July 1348, but was extended repeatedly over the years.\nAftermath\nIn 1355 the truce was formally set aside and full-scale war resumed. In 1360 the Edwardian phase of the war ended with the Treaty of Brétigny. By this treaty vast areas of France were ceded to England, including the Pale of Calais. In 1369 large-scale fighting broke out again and the Hundred Years' War did not end until 1453, by which time England had lost all its territory in France other than Calais. Calais was finally lost following the 1558 siege of the town.\nNotes, citations and sources\nNotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}