{
  "content": [
    {
      "type": "text",
      "text": "# Hùng King Temple (Saigon Botanical Garden)\n\n| architectural_style = Vietnamese architecture\n| address             = 2 Nguyễn Bỉnh Khiêm, District 1, Ho Chi Minh City, Vietnam\n| years_built         = 1927–1929\n| groundbreaking_date =\n| start_date          =\n| stop_date           =\n| topped_out_date     =\n| completion_date     =\n| opened_date         =\n| inauguration_date   =\n| relocated_date      =\n| renovation_date     =\n| closing_date        =\n| demolition_date     =\n| cost                =\n| owner               =\n| height              =\n| material            =\n| size                =\n| floor_count         =\n| floor_area          =\n| architect           = Auguste Delaval\n| architecture_firm   =\n| parking             =\n| public_transit      =\n| website             =\n| references          =\n| footnotes           =\n}}\nThe Hùng King Temple is a temple dedicated to the Hùng kings, the Vietnamese rulers of the Hồng Bàng dynasty. The temple is located in the Saigon Zoo and Botanical Gardens, next to the Ho Chi Minh City Museum of History.\nIt was designed by French architect Auguste Delaval and was inaugurated on 1 January 1929.\nHistory\nThe Temple of Hùng King was originally built between 1927 and 1929, under the name Temple du Souvenir Annamite, to honour the Vietnamese soldiers who died while fighting for the French in World War I. The temple was inaugurated at the same as time as the Musée Blanchard de la Brosse (now known as the Ho Chi Minh City Museum of History) on 1 January 1929.\nIn 1955, the temple was rededicated to the rulers of the founding Hồng Bàng dynasty, however the original memorial stele remained nearby. In 1975, following the reunification of Vietnam, the memorial stele was removed by the communist government and the temple was dedicated exclusively to the Hùng kings.\nEach year, on the 10th day of the third lunar month, the temple hosts the Hùng Kings' Festival, which has been a public holiday in Vietnam since 2007.\nArchitecture\nThe Temple of Hùng King was designed in a similar style to Nguyễn dynasty mausoleums. Vietnamese dragons flank the steps leading up to the temple while the curved roof is decorated with Vietnamese dragons and phoenixes.\nThe interior is decorated with sculptural motifs including animals symbolic to Vietnam such as cranes and turtles. The Hùng King shrine stands at the center of the temple guarded by a set of bronze-tipped weapons, a gong and a drum. Inside the temple are two replica Đông Sơn drums and a model of the Hùng Kings Temple Complex in the northern province of Phú Thọ.\nIn the front yard of the Temple of Hùng King is a three-ton bronze elephant statue standing on a rectangular concrete pedestal. It was presented as a gift from King Rama VII during his visit to French Indochina on 14 April 1930.\nReferences"
    }
  ]
}