{
  "content": [
    {
      "type": "text",
      "text": "# Husiatyn (Hasidic dynasty)\n\nHome of the Rebbe in Husiatyn, Second Polish Republic\nHusiatyn  is the name of a Hasidic dynasty, whose founder was a scion of the Ruzhiner dynasty. Husiatyn is located in present-day Ukraine.\nHistory\nIt started with the Rebbe Rabbi Mordechai Shraga Feivish Friedman, the youngest son of Rabbi Israel Friedmann of Rizhin. Reb Mordechai Shraga Feivish was only 16 when his father died and when he turned 30 in 1865, he moved to Husiatyn where he established a large Hasidic court. He died during the spring of 1894 and was succeeded by his son Reb Yisroel who took over the position of rebbe in Husiatyn until 1912. At the outbreak of World War I, he together with other Rebbes of Rizhin moved to Vienna, subsequently settling there. From time to time he made trips to visit his chassidim that remained in Galicia.\nThe Admorim of Rizhin were known for their love of the Land of Israel, and Reb Yisroel's feelings were especially deep. The Husiatyn Rebbe was very pro yishuv ha'aretz, settling the land with frum Jews, in order to have influence over secular Jews settling the land. He wanted to exert a more Torah and Jewish influence to a very secular Zionism.\nWhen one of the rebbes of Rizhin died, plans were made to establish a Rizhin section in the Jewish cemetery in Vienna. The rebbe of Husiatyn stated that there would be no need to take him into account as he proposed to emigrate to Eretz Israel. And so it was, during the 1930s, Reb Yisroel made plans to make aliyah. He traveled around Europe to bid farewell to his followers and warn them of the impending danger. He urged them to make aliyah and leave Europe.\nAs a result of the increased anti-Semitism he had witnessed, himself being a victim of stone throwers in a Viennese street, he had visions of what was to befall the Jewish people in the years to come. In Kraków he was reported to have instructed: \"Whoever has some sense should flee while he can - even in his slippers!\" To the Jews who came to the train station in Lwów to greet him he said: \"Whoever can sell his property should do so, and those who are unable to sell should leave everything and flee from here, even if only with a sack on his back!\"\nIn 1937 the rebbe docked at Haifa and settled in Tel Aviv. Aged 80 and the only surviving grandson of the Rizhiner Rebbe, he was considered the \"elder\" of the rebbes of Rizhin. During the summer months he would reside in Jerusalem until the 3rd of cheshvan, the yartzeit of his grandfather. On that day he would visit the Western Wall and go to pray at the grave of the holy Ohr Hachaim on the Mount of Olives.\nHe led his Hasidim for over 50 years until he died in Tel Aviv aged 92. In his will he requested to be buried on the Mount of Olives and if that was not possible, in Safad or Tiberias. When he died on the fifth day of Hanukkah 1949, the Mount of Olives in Jerusalem was inaccessible being under Jordanian control. As he died on a Friday there was also not enough time to organise a plot in the ancient Jewish cemetery in Safed. He was therefore buried in Tiberias amongst the students of the Baal Shem Tov.\nHis son-in-law, Rabbi Yaakov Freidman, a son of the Bohusher Rebbe, Rabbi Yitzchok Friedman, was appointed as the new leader. He continued the dynasty until his death in 1957 when his son Reb Yitzchok took over. When Reb Yitzchok died in 1968, the Husiatyn dynasty ended. Today the Husiatyn Beth midrash on Bialik Street, Tel Aviv, continues to be used for prayer and study.\nLineage of the Husiatyn dynasty\n{|align=center\n|\n|}\nExternal links\n*[http://www.yeshiva.org.il/midrash/shiur.asp?id=3068 The Rebbe of Husiatyn: Elder of the House of Rizhin]\n*[https://web.archive.org/web/20070314080007/http://www.hazofe.co.il/web/katava6.asp?Modul=24&id=26140&Word=&gilayon=2110&mador= The synagogue of the Admor of Husiatyn in Tel Aviv]\nSee also\n*History of the Jews in Poland\n*History of the Jews in Galicia (Central Europe)\n*History of the Jews in Ukraine\nReferences"
    }
  ]
}