{
  "content": [
    {
      "type": "text",
      "text": "# Hustle King Memorial Six Man Tag Team Tournament\n\nThe Hustle King (Shinya Hashimoto) Memorial Six Man Tag Team Tournament was a professional wrestling memorial event produced by the HUSTLE () promotion, which took place from July 9 to July 11, 2006 at the Pacifico Yokohama Kokuritsu Hall in Kanagawa (July 9) and Korakuen Hall in Tokyo, Japan (July 11). The first show, featuring the opening rounds and semi-final bouts, was attended by an estimated 4,420 fans and was aired on pay per view as part of \"Hustle Vol. 18 – Hustle King Forever\". It was held in memory of Shinya Hashimoto, who competed as Hustle King. Hashimoto died after suffering a brain aneurysm in Tokyo, Japan on July 11, 2005. It was the first Hashimoto memorial show held in Japan followed by the Shinya Hashimoto Legacy Memorial Cup Tournament in 2009. Ten professional wrestling matches were featured on the event's card, five of which were tournament matches.\nTeam Hustle King (Shinjiro Ohtani, Masato Tanaka and Tadao Yasuda) won the tournament by winning three matches during the two-day tournament. Over the course of the event, they defeated KARI Family 3 Strongest (Katakari King, Katakari Max and Katakari 300%) in the opening round, the Hardcore Brothers (Kintaro Kanemura, Tetsuhiro Kuroda and Tomoaki Honma) in the semi-finals and Sakata Corps (Wataru Sakata, Genichiro Tenryu and Ryoji Sai) in the final match. In addition to the tournament, several other matches were held at the event. The first night's main event match was a tag team match between Naoya Ogawa and TAJIRI versus The M-Peranza and Toshiaki Kawada, which Ogawa and TAJIRI won.; the following night's main event saw Monster C and Toshiaki Kawada defeat Kintaro Kanemura and TAJIRI. The undercard also featured an Intergender Six-Person Tag Team match between Erica, Margaret and Tetsuhiro Kuroda against Giant Vabo, Gomora and Kohei Sato.\nResults\nHustle King Memorial Six Man Tag Team Tournament (Day 1)\nJuly 9, 2006 in Kanagawa, Japan (Pacifico Yokohama Kokuritsu Hall)\n{| style=\"font-size: 85%\" class=\"wikitable sortable\"\n!#\n!Results\n!Stipulations\n!Times\n|-\n|1\n|Hustle Kamen Blue, Hustle Kamen Red and Hustle Kamen Yellow defeated Blue Devil Spider, Red Devil Spider and Yellow Devil Spider\n|Six-Man Tag Team match\n|7:11\n|-\n|2\n|Team 6m (Kohei Sato, Giant Vabo and Gomora) defeated Team Hustle Tomorrow (Ikuto Hidaka, Hiro Yokoi and Dokkoi Namiguchi)\n|rowspan=\"2\"| First Round Tournament match\n|4:44\n|-\n|3\n|Team Hustle King (Shinjiro Ohtani, Masato Tanaka and Tadao Yasuda) defeated KARI Family 3 Strongest (Katakari King, Katakari Max and Katakari 300%)\n|9:49\n|-\n|4\n|Team Hustle King (Shinjiro Ohtani, Masato Tanaka and Tadao Yasuda) defeated Hardcore Brothers (Kintaro Kanemura, Tetsuhiro Kuroda and Tomoaki Honma)\n|rowspan=\"2\"| Semi Final Tournament match\n|12:19\n|-\n|5\n|Sakata Corps (Wataru Sakata, Genichiro Tenryu and Ryoji Sai) defeated Team 6m (Kohei Sato, Giant Vabo and Gomora)\n|7:11\n|-\n|6\n|Naoya Ogawa and TAJIRI defeated The M-Peranza and Toshiaki Kawada\n|Tag Team match\n|11:00\n|-\n|}\nHustle King Memorial Six Man Tag Team Tournament (Day 2)\nJuly 11, 2006 in Tokyo, Japan (Korakuen Hall)\n{| style=\"font-size: 85%\" class=\"wikitable sortable\"\n!#\n!Results\n!Stipulations\n!Times\n|-\n|1\n|Hustle Kamen Blue, Hustle Kamen Red and Hustle Kamen Yellow defeated Fear Psychic Medium, Red Devil Spider and Yellow Devil Spider\n|Six-Man Tag Team match\n|7:11\n|-\n|2\n|Erica, Margaret and Tetsuhiro Kuroda defeated Team 6m (Kohei Sato, Giant Vabo and Gomora)\n|Intergender Six-Person Tag Team match\n|10:35\n|-\n|3\n|Team Hustle King (Shinjiro Ohtani, Masato Tanaka and Tadao Yasuda) defeated Sakata Corps (Wataru Sakata, Genichiro Tenryu and Ryoji Sai)\n|Tournament Finals match\n|14:05\n|-\n|4\n|Monster C and Toshiaki Kawada defeated Kintaro Kanemura and TAJIRI\n|Tag Team match\n|12:12\n|-\n|}\nTournament brackets\nThe tournament took place between July 9 and July 11, 2006. The tournament brackets were:\n*Team 6m (Kohei Sato, Giant Vabo and Gomora)\n*Team Hustle Tomorrow (Ikuto Hidaka, Hiro Yokoi and Dokkoi Namiguchi)\n*Team Hustle King (Shinjiro Ohtani, Masato Tanaka and Tadao Yasuda)\n*KARI Family 3 Strongest (Katakari King, Katakari Max and Katakari 300%)\n*Hardcore Brothers (Kintaro Kanemura, Tetsuhiro Kuroda and Tomoaki Honma)\n*Sakata Corps (Wataru Sakata, Genichiro Tenryu and Ryoji Sai)\nSee also\n*Shinya Hashimoto Memorial Legacy Cup Tournament\nReferences"
    }
  ]
}