{
  "content": [
    {
      "type": "text",
      "text": "# Hutsul Republic\n\nThe Hutsul Republic () was a short-lived state formed in the aftermath of World War I. Inhabited by Hutsuls, the republic was declared on 8 January 1919, when original plans to unite this area with the West Ukrainian People's Republic failed and the territory was occupied by Hungarian police.\nbetween 1928 and 1938, with Subcarpathian Ruthenia shown in blue.]]\nThe legislature of the Hutsul Republic was the \"Ukrainian People's Council\" with 42 members, and its executive power (government) was the \"Council\" with 12 members.\nCreation\nHutsul Republic\n|combatant2=\n|commander1= Stepan Klochurak\n|commander2= Mihály Károlyi\n|strength1=109\n|strength2=620\n|casualties1=None\n|casualties2=500 captured}}\nOn 20–22 December 1918 Hungarian troops returned to the territory of the Hutsul Republic. A state of emergency was proclaimed, the Hutsul militia units disarmed, the Ukrainian People's Council was liquidated, the Hungarian language was restored in school and in government communication, and former Hungarian officials were appointed to all posts of the local government.\nOn the night of 7–8 January 1919 the local population of Rahó (Rakhiv) rose against the Hungarian gendarme battalion, taking into custody some 500 Hungarian policemen. General Stepan Klochurak was elected prime minister of the republic. He was also active in organizing the armed forces of the republic, which consisted of nearly 1,000 soldiers. On 17 January 1919 the army waged a brief confrontation against the occupying Romanian troops in Máramarossziget (Sighetu Marmației), in the adjacent lands of Máramaros County. This unequal battle resulted in the Hutsul Republic suffering, according to various data, 18 to 41 people killed, 39 to 150 people wounded, and 400 people taken prisoner including 20 officers.\nAnother group of Ukrainian troops also advanced by train to Munkács (now Mukachevo), Bátyú (now Batiovo), and Csap (now Chop) on 16 January, but receiving news of the defeat at Máramarossziget and weary of a restive occupied population, they withdrew back across the Carpathian to Lavochne on 19 January.\nThe day after the \"Unification Act\" was signed on 23 January 1919 by the Ukrainian People's Republic and the West Ukrainian People's Republic Stepan Klochurak and Julian Braschaiko joined the \"Labor Congress\" of this new entity as representatives of the Hutsul Republic.\nBy the end of April 1919, the eastern part of Transcarpathia was occupied by Romanian troops, the central part was under the control of the Hungarians, while Czechoslovak troops occupied its western part.\nIn April 1919 most of Carpathian Ruthenia joined Czechoslovakia granted as an autonomous territory, while its easternmost territory (Hutsul Republic) was de facto a breakaway state.\nThe state finally fell when its claimed territory was occupied by Romanian troops on 11 June 1919. The territory claimed by this state accepted the admission into the First Czechoslovak Republic in September 1919, where it remained during the interwar period. On 15 March 1939, just for a day, after its proclamation the Ukrainian state named Carpatho-Ukraine claimed its independence but was soon occupied by Hungarian troops and was annexed by Hungary until the end of World War II. After the war, the region became the Carpathian Oblast of the Ukrainian Soviet Socialist Republic, as part of the Soviet Union.\nReferences"
    }
  ]
}