{
  "content": [
    {
      "type": "text",
      "text": "# Huw Warren\n\n}}\nHuw Warren is a Welsh jazz pianist and composer whose work crosses several genres. He is known as co-leader and founder of the jazz quartet Perfect Houseplants.\nCareer\nHuw Warren was the co-leader and founder of the jazz quartet Perfect Houseplants with Mark Lockheart, Dudley Phillips, and Martin France. Perfect Houseplants recorded five albums for various labels (including the Scottish label Linn) and produced collaborative projects with early music artists such as Andrew Manze, Pamela Thorby, and the Orlando Consort. Warren has had a long collaboration with English singer June Tabor as her arranger and musical director. They have toured worldwide and produced large-scale projects with the Creative Jazz Orchestra and the LPO Renga ensemble. Warren and Tabor were featured in Phillip King's Freedom Highway film and the Daughters of Albion project recorded in 2009 by BBC Four.\nBetween 1997 and 2005, Warren worked closely with UK jazz label Babel, which released five albums of his music.\nWarren arranged and produced a Welsh Hymn album in 2004, Duw a Wyr (God Only Knows) with singer Lleuwen Steffan. I received media exposure on radio and TV in Wales, including a S4C documentary about the making of the album. He has worked extensively with partner Maria Lamburn, producing three albums with her and setting up Maizeh Music.\nAs the trio Quercus (with June Tabor and Iain Ballamy) Warren recorded albums for ECM and produced with Manfred Eicher. The album Quercus was released in 2013 and won the German Critics' Album of the Year award.\nNightfall was released in 2017.\nHe has collaborated with Mark Feldman, Maria Pia De Vito, Peter Herbert, Joanna MacGregor, Theo Bleckmann, Pamela Thorby, and Erik Truffaz. His band Dialektos with Italian singer Maria Pia De Vito resulted in two recordings (Dialektos and O Pata Pata) and performances with musicians such as Gabriele Mirabassi, Ralph Towner, and RA Ramamani.\nIn 2019, Warren released albums for the Italian label CAM Jazz, including a trio album Everything in Between with Dudley Phillips and Zoot Warren, and a live duo album New Day with saxophonist Mark Lockheart\nWarren has performed and recorded with Kenny Wheeler, Loose Tubes, Steve Arguelles, Julian Arguelles, Billy Jenkins, John Parricelli, John Etheridge, Christine Tobin, Tim Garland, Scott Stroman, Antonio Forcione, and Brian Abrahams' District Six. Warren has also worked with Billy Bragg, Elvis Costello, Eddi Reader, Echobelly, Christine Collister, and the Audio Bullys. Warren has also recorded film scores for Colin Towns, Stephen Warbeck and Mike Gibbs.\nWarren has worked with artists from a number of different fields including:\n* Brace (2009), with choreographer Chloe Loftus\n* Coloured Gloves (2009), with artist Catrin Williams\n* ACES Residency, Aberdeen (2011), with sculptor Helen Dennerly, writer Esther Woolfson, and artists Dalziel and Scullion\n* Closure (2012), documenting a rural Welsh community with photographer David Woodfall and video artist Greg Byatt\nEducation\nWarren has worked as a piano and composition teacher in the Jazz departments at Royal Academy of Music, Guildhall School of Music and Drama, London, and led many workshops and specialist music education programs. He is currently visiting professor of Jazz Piano at the Royal Welsh College of Music & Drama in Cardiff, Head of Jazz Ensembles at Cardiff University. Piano tutor at the Guildhall School of Music and Drama summer school, and faculty member at JIMS in Salzburg. He has also written and arranged the ABRSM jazz syllabus.\nCommissions\n* 1997: Swing Fun/Yokate commissioned by the ABRSM for their Jazz Piano exam syllabus. (solo piano)\n* 1997: Caterpillar commissioned by Curiad, for the school's songbook Cantabile – contemporary songs by living Welsh composers. (voice and piano)\n* 1998: Riot commissioned by Piano Circus with funds from the Arts Council of England. (6 pianos)\n* 1998: A Quiet Eye new arrangements and compositions for June Tabor and a large ensemble commissioned by the Creative Jazz Orchestra with funds from the National Lottery. (voice, piano, viola, 5 brass, 3 reeds)\n* 1998, Nov: Steamboat Bill Jnr new score for classic Buster Keaton movie commissioned by Birmingham Jazz for performance at Birmingham International Film and TV Festival (guitar, piano, saxophone, bass, percussion)\n* 1999, Mar: Take the Fire score for new adaptation of Jean Cocteau monologues at the Lyric Theatre, Hammersmith. Performed by actress Amanda Harris and commissioned by TOYE productions. (solo piano)\n* 1999, Nov: New Folk Songs suite of pieces for contemporary Jazz ensemble, based on traditional music from East Anglia, commissioned by Andrew Milne award/Eastern Arts for performances by Perfect Houseplants.\n* 1999: Left a Bit new music for piano and two percussionists/electronics commissioned by Eccentric Management with funds from the Arts Council of England for performance in Berlin and England.\n* 2000: Lullaby, Exit, Bear for 13-piece ensemble commissioned by RSC millennium project.\n* 2001: Shout/Greens commissioned by the ABRSM for the Jazz Horns syllabus\n* 2001: Still Hearing You arrangement for the Palladium ensemble as an encore piece (recorder, violin, viola da gamba, and theorbo)2002: I am the Song commissioned by Tauntons Sixth form college choir (Southampton), and performed at the National Festival of Music for Youth at the Royal Festival Hall.\n* 2003: Railway Mania commissioned by the Scottish Chamber Orchestra, for performance in October 2004. (children's choir and mixed ensemble)\n* 2004: Tangled. New piece for Tango Siempre, commissioned by Corsham Music Festival, Wiltshire. (violin, accordion, double bass, piano)\n* 2005: Soldier, Shepherd, Sailor. June Tabor and The LPO Renga Ensemble.\n* 2005: New Welsh Stories. Big Band suite, commissioned by Cerdd William Mathias, with funds made available from the PRS Foundation.\n* 2006: This is Now!. Multi-media work for Orchestra Helclecs, featuring John Parricelli, Lleuwen Steffan and Nobsta Nuts. Funded by the Arts Council of Wales 'Creative Wales' Award.\n* 2006: Strung Out. Double violin concerto, Welsh Chamber Orchestra and Beaumaris Festival/PRSF.\n* 2006: In the Beginning/Slippery. Welsh Jazz Composers Orchestra/ACW.\n* 2006: Gower Boy (film with Gee Vaucher)\nVortex Jazz/Babel label\n* 2007: Solo piano pieces\nKPM/Galapogos\n* 2007: Open. Piano piece for Elena Riu and Boosey & Hawkes. This piece was included in the 2013/2014 ABRSM Grade 6 syllabus.\n* 2008: Brace. Dance collaboration with Choreographer Chloe Loftus (prsf new steps in music)\n* 2009: Hermeto... Jazz/Art Project. Collaboration with artist Catrin Williams at Galeri Caernarfon.\n* 2010: The Brecon Project. Collaboration with Erik Truffaz, Sura Susso, Paula Gardiner. and Simon Thorne. Performed at Brecon Jazz, 2010.\n* 2010: Tilt. Commissioned by classical jazz mixed ensemble \"New Perspectives\". First performance at Leasowes Bank Arts Festival, July 2011\n* 2011: Gladrags. Big band/large jazz ensemble, commissioned by Farnham Festival 2011.\nRadio\nWarren did live broadcasts for Radio 3, including duos with Peter Herbert and John Parricelli. Warren performed in another live special, Late Junction, with June Tabor, as well as the Radio 3 60th anniversary concert with Perfect Houseplants. Other live performances include: The Radio Wales Arts Show special interview with Nichola Heywood Thomas, Late Junction 10th anniversary live special (2010), and Hermeto+ live for Jazz on 3 (2010) with Dudley Phillips, Iain Ballamy, Maria Pia De Vito, and Martin France.\nTV\nWarren appeared in the BBC4 Sessions with June Tabor, and later with Jools Holland in the S4C Documentary (Sioe Celf) about the making of Duw y Wyr with Lleuwen Steffan. Warren also appeared in the Brecon Jazz Festival (2006), a BBC4 documentary \"Jazz Pianists\", as well as a S4C 25th anniversary program about Brecon Jazz in 2007.\nDiscography\n* A Barrel Organ Far from Home (Babel, 1997)\n* Hundreds of Things a Boy Can Make (Babel, 1997)\n* Infinite Riches in a Little Room (Babel, 2001)\n* Duw a Wyr (Sain, 2005)\n* Everything We Love and More (Babel, 2005)\n* Dialektos (Parco Della Musica, 2008)\n* Hermeto+ (Basho, 2009)\n* O Pata Pata (Parco Della Musica, 2011)\n* Quercus (ECM, 2013)\n* Nightfall (ECM, 2017)\n* Nocturnes and Visions (Maizeh, 2018)\n* New Day (CAM Jazz, 2019)\nReferences\nExternal links\n* [https://huwwarren.wordpress.com/ Official site]\n* [https://www.bbc.co.uk/wales/music/sites/huw-warren/ Biography from BBC Wales]"
    }
  ]
}