{
  "content": [
    {
      "type": "text",
      "text": "# Huwara rampage\n\n| time             =\n| timezone         = UTC+02:00\n| type             = Rioting, street violence, vandalism, arson\n| fatalities       = 1\n| injuries         = 100+\n| perpetrator      = Israeli settlers\n| weapons          =\n| motive           =\n| inquiry          =\n| coroner          =\n| accused          =\n| convicted        =\n| verdict          =\n| convictions      =\n| charges          =\n| litigation       =\n}}\nOn 26 February 2023, hundreds of Israeli settlers went on a violent late-night rampage in Huwara and other Palestinian villages in the Israeli-occupied West Bank, leaving one civilian dead and 100 other Palestinians injured, four critically, and the town ablaze. It was the worst attack stemming from Israeli settler violence in the northern West Bank in decades. The rampage followed the deadly attack in which two Israelis were murdered the same day by an unidentified attacker in the area.\nIsraeli soldiers were in the area while the rampage by the settlers unfolded and did not intervene. The rampage was called a pogrom by an Israeli commander in charge of the area. The same day, Israeli and Palestinian officials issued a joint declaration in Aqaba, Jordan to counter the recent round of Israeli–Palestinian violence.\nIn the rampage's aftermath, Israeli Finance Minister Bezalel Smotrich, a settler leader in charge of the administration of the West Bank, called for Huwara to be \"wiped out\" by the Israeli army. Condemnations from the United States, European Union, and Arab countries led to Smotrich retracting his comments and claiming they were said in the heat of the moment.\nBackground\nThe rampage in Huwara followed shortly after the deadly shooting by a Palestinian gunman of two Israeli settlers from Har Brakha, an Israeli settlement near Huwara, earlier the same day. The attack came juxtaposed against a joint declaration earlier that day in Aqaba, Jordan, by Israeli and Palestinian officials expressing a desire to work towards calming the latest round of violence.\nSome 700,000 Israeli settlers now live in the West Bank and East Jerusalem, in settlements viewed as illegal by the international community. Hardline settlers in the West Bank more generally frequently commit violence against Palestinians and vandalize Palestinian land and property, but rarely on the scale of the rampage in Huwara.\nSettler violence has generally been steadily on the rise in the West Bank in recent months, with Huwara previously having been subjected to an October blockade imposed by settlers and backed by Israeli soldiers.\nIn the first two months of 2023, intercommunal violence led to the killings of 62 Palestinians and 14 Israelis. The year of 2022 was the deadliest for Palestinians living in the West Bank and East Jerusalem since 2004, according to B’Tselem, with nearly 150 Palestinians and 30 Israelis killed.\nRampage\nOn the night of 26 February 2023, hundreds of Israeli settlers attacked Huwara and three nearby villages, torching hundreds of Palestinian homes (some with people in them), businesses, a school, and numerous vehicles. One Palestinian man was shot dead.\nAlthough the violence had been anticipated, and the Israeli military had cordoned off the area, the soldiers remained on the sidelines during the siege, rather than intervene. Israel's West Bank army commander defended the inaction saying that they had not anticipated the ferocity of the attack, and were not prepared to deal with it. He described the event as \"a pogrom done by outlaws\"—a term commonly applied to eastern European mob attacks upon Jews during the 1800s and early 1900s.\nThe Palestinian health ministry said a 37-year-old man was shot to death by the settlers, while the Palestinian Red Crescent medical service said another two people were wounded by gunfire, a third was stabbed and a fourth beaten with an iron bar. Ninety-five others were said to be suffering from teargas inhalation.\nAlongside the physical violence against local residents, the settlers set fire to approximately 30 homes and cars, according to one source. Other sources say 200 buildings were set ablaze in four Palestinian villages. Social media showed large blazes burning across the town and the violence reportedly lasted throughout the night and continued on into Monday morning.\nAftermath\nThe day after the rampage, the rampagers were still in control of the area and groups of masked Jews checked vehicles looking for Palestinians. Israeli soldiers nearby did not intervene. \"Reports of a large Israeli army presence in the town existed only on paper\". Settler attacks on Palestinian communities continued through 28 February.\nAs of 28 February, of only eight suspects detained in connection with the rampage, all had been released, three to house arrest. On 1 March, eight further suspects believed to have taken part in the assault were arrested, one of whom was released the same day. The IDF commander responsible for the area, Major-General Yehuda Fox, described the event as a \"pogrom carried out by outlaws.\" On 2 March, the Israeli Defense Ministry placed two of the individuals, one a minor, in administrative detention after a Jerusalem court ordered the police to release the remaining seven detained suspects.\nReactions\nIsraeli\nIsraeli Prime Minister Benjamin Netanyahu appealed for calm on Sunday evening as footage of the violence emerged and spoke out against vigilantism. Israeli President Isaac Herzog condemned the rampage, stating, \"This is not our way. It is criminal violence against innocents.\"\nIsraeli Finance Minister Bezalel Smotrich, a settler leader now largely in charge of the administration of the West Bank, who had earlier called for \"striking the cities of terror and its instigators without mercy, with tanks and helicopters\", appealed to the settlers not to take the law into their own hands, and to let the army and government do their jobs.\nHowever, Smotrich later called on Twitter for Huwara to be \"wiped out\" by the Israeli government. Smotrich's remark drew international condemnation, including from the U.N. Secretary General, Jordan, the United Arab Emirates, and others. The United States State Department demanded Netanyahu reject the remark. Smotrich's remark came just ahead of a major fundraising event for Israel in the U.S., where Smotrich was to appear. The White House indicated U.S. officials would not meet with him, and various Jewish rights organizations called for the State Department to deny him entry.\nOther members of Israel's ruling coalition offered other sentiments. Zvika Fogel, of the ultra-nationalist Otzma Yehudit, said he saw the violence \"in a very good light\" in response to a question on Army Radio in which the interviewer referred to the rampage as a 'pogrom'.\nInvestigation\nOn 1 March, Israeli Attorney General Gali Baharav-Miara opened an investigation into lawmaker Zvika Fogel of the far-right Otzma Yehudit party and a member of the Israeli government coalition on \"suspicion of incitement to terrorism\"; Fogel had publicly supported the rampage. 22 Israeli legal experts wrote to the attorney general to investigate pro-settler government MKs, including far-right minister Bezalel Smotrich, for \"inducing war crimes\" by their public support for the riots. Going further, Smotrich, when asked why he liked a tweet by Samaria Regional Council deputy mayor Davidi Ben Zion calling \"to wipe out the village of Huwara today\", said \"Because I think the village of Huwara needs to be wiped out. I think the State of Israel should do it.\"\nPalestinian\nPalestinian President Mahmoud Abbas criticized events as \"the terrorist acts carried out by settlers under the protection of the occupation forces tonight,\" and blamed the Israeli government.\nInternational\nThe European Union noted its alarm at the violence called on authorities on both sides \"stop this endless cycle of violence.\" The UK ambassador to Israel called on Israel to address the settler violence and bring those responsible to justice.\nUS State Department spokesman Ned Price said violence underscored \"the imperative to immediately de-escalate tensions in words and deeds.\"\nCNN published an investigation on June 15 finding that Israeli forces both failed to stop the riots nor protect residents against settler violence. A soldier told the network that soldiers and border police did nothing, \"We just let them continue to advance\".\nSee also\n*Timeline of the Israeli–Palestinian conflict in 2023\n*Israeli settler violence\nReferences"
    }
  ]
}