{
  "content": [
    {
      "type": "text",
      "text": "# Hyborian War\n\n| illustrator =\n| publisher = Reality Simulations, Inc.\n| years = 1985–present\n| genre = Fantasy, sword and sorcery\n| language = English\n| system =\n| players = 36\n| setup_time =\n| playing_time = Months to years\n| random_chance =\n| materials = Set-up kit, game map, order sheets, turn results, paper, pencil\n| media_type = Play-by-mail or email with computer-adjudicated turns\n| website =\n| footnotes =\n}}\nHyborian War is a play-by-mail game published by Reality Simulations, Inc. It takes place during the Hyborian Age in the world of Conan the Barbarian created by Robert E. Howard. The game has been continuously available for worldwide play since its inception in 1985 and has changed little in its overall format. It uses a computer program to adjudicate player orders. Although it relies on postal mail or email and has turnaround times which are relatively long for the digital age of video games, Hyborian War has remained active into the 21st century.\nThe game is set within the heroic fantasy genre, also known as sword and sorcery. The central figure is Conan of Cimmeria, appearing in the game as a wandering hero whom players can employ until fortune takes him elsewhere. Game designer Edward Schoonover wove multiple aspects of Howard's stories into Hyborian War including diverse landscapes and cultures, grand armies, large-scale battles, wizards tipping the scales of power, and stories of courageous and heroic deeds.\nGameplay is multifaceted: play-by-mail commentator Mike Scheid described it as \"marvelously complex\". There are 36 kingdoms available to players in small, medium, and large sizes, each with different victory conditions. A central focus of the game is conquest and expansion through military action and diplomacy. Intrigue, magic and other tools of statecraft in a fantasy setting are available to players. They can also collaborate to progress their game goals. A number of fan-based websites support the game with reference material and provide forums for player communication. The game has had an active player base since 1985. Its nadir for ratings and customer service was in the late 1980s and the 1990s, while its high points were in its early years and in the 21st century—periods during which it won multiple awards.\nPlay-by-mail genre\n]]\nPlay-by-mail (PBM) games feature a number of differences from tabletop games. The typical PBM game involves many more players than an average tabletop game can support. PBM game lengths are usually longer, depending on a number of factors. Turnaround time is how long a player has to prepare and submit \"orders\" (moves and changes to make in the game) and the company has to process them and send back turn results. The average turnaround time in the 1980s was two weeks, but some modern PBM games are play-by-email (PBEM) with shorter turnaround times of twice per week or faster. Open ended games allow players to strengthen their positions without end, with players continually entering and leaving the game. Examples include Heroic Fantasy and Monster Island. Conversely, closed end games typically have all players starting on equal terms, with rapid, intense, player vs. player gameplay that ends when a player or group achieves some victory condition or is unopposed. Examples include Hyborian War and ''It's a Crime. The complexity of PBM games can range from the relatively simple to the PBM game Empyrean Challenge'', once described as \"the most complex game system on Earth\".\nOnce a player has chosen a game and receives an initial game setup, gameplay begins. This generally involves players filling out order sheets for a game (see example image) and sending them to the gaming company. The company processes the turns and returns the results to the player, who completes a subsequent order sheet. Diplomacy is also frequently an important—sometimes indispensable—part of gameplay. The initial choice of a PBM game requires consideration as there is a wide array of possible roles to play, from pirates to space characters to \"previously unknown creatures\". Close identification with a role typically increases a player's game satisfaction.\nHistory\nSome games have long been played by mail, such as chess and Go, and more recently Diplomacy. The professional PBM industry began in 1970 when Flying Buffalo Inc. launched its first multi-player PBM game, Nuclear Destruction, in the United States. Flying Buffalo dominated the industry from 1970 to 1975, with Schubel & Son and Superior Simulations introducing games later in the decade. By 1980, the PBM field was growing but still nascent; there were only two sizable commercial PBM companies, and a few small ones.\nIn the 1980s, the PBM industry grew rapidly. Many small PBM companies opened as there were few barriers to entry, although most of these companies failed. Three independent PBM gaming magazines also began in the early 1980s: Gaming Universal, Paper Mayhem, and the UK-based Flagship. It was in this environment that Reality Simulations, Inc. (RSI) offered Hyborian War for play in 1985. The game has garnered numerous articles in the specialist PBM and gaming press since its release. In periodic PBM Game Ratings votes in Paper Mayhem, Hyborian War invariably attracted a relatively large number of votes, regardless of its final standing.49 it was first from 79 entries with 170 responses, and in issue No.69 it was again fourth of 72 entries with 83 responses.}}\nThe 1990s brought additional changes to the PBM world. In the early 1990s, email became an option to transmit turn orders and results. In 1994, David Webber, ''Paper Mayhem's editor in chief expressed concern about disappointing growth in the PBM community and a reduction in play by established gamers. By the end of the 1990s, the number of PBM publications had also declined. Gaming Universal's final publication run ended in 1988. Paper Mayhem'' ceased publication unexpectedly in early 1998 after Webber's death. Flagship also later ceased publication. In the 21st century, a single PBM magazine exists—Suspense and Decision—which began publication in November 2013. This online magazine is supported by a smaller PBM community than in previous decades.\nSetting\nRobert E. Howard created Conan, among other characters, while writing articles for the pulp magazine Weird Tales in the 1920s and 1930s. While doing so, he created what would become the sword and sorcery genre. It was not until after Howard's death in 1936 that Conan's star would reach its greatest heights. Conan has been published globally and featured in media including cartoons, comic books, role-playing games, toys, and motion pictures. Universal Pictures released the film Conan the Barbarian in 1982 and its sequel Conan the Destroyer in 1984, the latter a year before RSI offered Hyborian War for play.\nHyborian War takes place during the fictional Hyborian Age created by Howard who described it as occurring after the sinking of Atlantis, in \"an Age undreamed of\". Aspects of this setting that influenced Hyborian War game designer, Edward Schoonover, included its vast, diverse landscapes and its \"splendid cultures\". Another notable feature of Howard's stories that finds echoes in the game are the large-scale battles, with grand armies clashing in massive engagements and the fate of empires hanging in the balance. Howard also narrowed his storytelling focus to battlefield leaders to highlight individual feats of military skill, personal courage, and inspiration; providing a balance between grand, sweeping conflicts and personal battlefield deeds. Magic is also part of the Hyborian Age, with wizards wielding great, but not overwhelming, power.\nThe central figure of the Hyborian Age is Conan of Cimmeria, one of the northern, barbarian countries. Schoonover described Conan as Howard's \"grim, brooding, bloodthirsty, and riveting hero\". Conan fights in his first battle at age 15, already strong in stature. Soon after, he began his travels through the Hyborian Age nations as a mercenary, a pirate, \"a kozak, a penniless vagabond, [and] a general\". His adventures involved romances with women such as the pirate queen Bêlit and the mercenary Valeria; as well as fights with evil magicians such as Thoth-Amon. Later in life, he seized the throne of the mightiest kingdom of the age, Aquilonia, and ruled as its king.\nGameplay\nin the province of Xachotl. Players use these orders to choose battle tactics.]]\nAccording to RSI, players in each game of Hyborian War are able to create an \"alternate history\" of the Hyborian Age. As in Howard's tales, Conan adventures through the lands of the Hyborian Age, but the events that surround him depend on the decisions of the players. To begin, players request a setup package and express kingdom preferences. There are numerous non-player kingdoms (those run by computer) within the game and 36&nbsp;playable kingdoms available in three sizes—small, medium, and large—each with varying costs per turn.per turn, respectively. Up to four friends can play in the same game, with some geographic limitations at the start. RSI's computer will play non-player kingdoms at the start of the game as well as player kingdoms if players drop from play. Multiple regular and slow speed games are run simultaneously.}} The setup kit includes a game map by Liz Danforth and a set of detailed game rules,1 (November 2013), \"Reading through the rules of Hyborian War is a mind-blowing experience.\"}} while initial kingdom reports come in varying lengths. Orders are submitted by mail or email for simultaneous processing every 16 or 28&nbsp;days for regular or slow games, respectively—the latter noted as suitable for international players or those needing more time for turns, as all turn results are sent back by postal mail. Turn results run to dozens of pages, providing detailed descriptions of kingdom facts and events in a narrative fashion.\nGameplay is multifaceted: PBM commentator Mike Scheid described it as \"marvelously complex\". Players must account for multiple interrelated factors, including balancing the ambition to expand with the management of their royal courts, diplomacy, economics, and the loyalty of subjects while conscripting troops. The game begins when Conan is sixteen years old and spans a period of about two hundred years. Conan appears in the game as a wandering hero whom players can use, when available before fortune takes him elsewhere. Players take an indirect role—that of power behind the throne of one of the playable kingdoms. The primary elements of gameplay include troops, provinces, and characters; the latter are able to conduct tasks such as adventuring, assassinating or kidnapping characters from other kingdoms, commanding large armies or navies, using magic, spying, and negotiating treaties.\nConquest and expansion to gain provinces and sea zones through military operations and diplomatic activities play a central role in Hyborian War. Military activities such as raids and invasions figure prominently, and there are hundreds of troop types and naval units: from standard infantry, cavalry and archer units, to more unusual unit types such as mammoths, undead, infantry, and mounted flying reptiles. Players can also augment their armies with magic. Invasions result in either open field battles, with large swirling masses of unorganized troops, or in set-piece battles with more options to arrange forces. In set-piece battles, different troop types are optimal for the center, the left and right lines, and the flanks. Terrain types also drive allowable battle configurations. The order for a set-piece battle pictured here shows eight units in columns and represents a battle occurring in the province of Xachotl in open, tundra, or oasis terrain. Only the victor of an invasion battle controls the province or sea zone.\nPlayers may interact, both before and during games, to further their goals. RSI designed the game so players could conduct all necessary diplomacy within the game. This includes activities via the player command sheet such as negotiating peace treaties, disrupting external alliances and avoiding the influence of other kingdoms to prevent unwanted peace negotiations. Players not electing a privacy option can request the mailing address for the players of two other kingdoms per turn. Players can then use mail or online forums to conduct diplomatic activities outside the structure of the game.\nGames usually last at least thirty turns but can continue for up to fifty. The game can end in two ways: one is by the map being dominated by a few players; the other is by an ice age beginning. At the start of an ice age, the four northern, \"barbarian\" countries of Asgard, Pictland, Vanaheim, and Conan's homeland of Cimmeria, are forced south and are each given a large kingdom to migrate to as well as the ability to freely move within the borders of any kingdom—friendly or enemy. This more unconstrained gameplay continues until the glacier encroachment of the ice age reaches an advanced stage.\nEach kingdom has unique victory conditions, with some relying on wealth, some on mere survival, some requiring minimal expansion, and others requiring domination of half of the map. An initial goal a player can pursue is achieving imperial status, which provides a player with ten new military units. Pursuing this intermediate goal typically places players in competition for the same resources, whereas winning the game does not require achieving the status of empire. The player with the highest rating at the game conclusion is the winner; but, ratings are based on optimal performance from available starting resources, not on having the largest kingdom. For example, in Game No.38—played in the late 1980s—gamer Mark Sheron noted that the small kingdom of Khoraja placed first over the large kingdom of Vendhya as Khoraja's relative improvement was superior, even though Vendhya's final territory size was more than twice that of Khoraja. This type of result is not unusual, and victory is not dependent on how large a kingdom becomes, but on how skillfully a kingdom has been played, among other factors.\nGame analysis\nAnalysis of game results has provided insights on victory trends and kingdom choices. For example—from a 1994 look at the first 200 Hyborian War games, of which 175 had listed winners—an assumption in the early years of play that large kingdoms were easier to win with was proven false, and a belief that some countries were easier to play and win with was proven true. Out of the 8large, 8small, and 20 medium playable kingdoms, the large countries were the most challenging to win with—the kingdom of Turan ended up as the most winning \"large\" choice, while the large kingdom of Nemedia scored the worst of all countries, regardless of size, with a single win out of 175. For medium kingdoms, Uttara Kuru was the easiest to win with, while the countries of Asgard, Cimmeria, and Zembabwei provided decent showings. Brythunia, Kosala, and Zamora were extremely challenging medium kingdoms to take first place with. The small kingdoms had the largest playability spread with Amazonia on the most playable end with 17 victories and Kusan and Punt with one victory each. Rick Cote suggests that this type of analysis allows players to play the odds on easier countries or to \"champion a dark horse\" for a more challenging game.\nA more comprehensive 21st century listing with more than 400 Hyborian War victory listings appears to validate these trends. In this listing, Uttara Kuru (medium kingdom) remains the top winning kingdom with 34 wins, followed by Amazonia (small) with 32, Turan (large) with 25, Asgard (medium) with 23, and Cimmeria (medium) with 22. Rounding out the bottom of this list is Nemedia (large) with one win, Hyperborea (large) with two wins, Pictland (medium) and Khauran (medium) tied with three wins each, and Ophir (medium), Juma's Kingdom (small) Punt (small), and Zamora (medium) tied with four wins each.\nDevelopment\nGame designer Edward Schoonover created Hyborian War for gameplay within the world of Conan, as an homage to both the character and his creator, Robert E. Howard. A year of research reportedly went into game development. Schoonover designed the game with \"sweeping history, great battles\", and other aspects such as kingdoms, grand armies, and diverse leaders reflecting elements of Howard's Hyborian Age. In the Conan stories magic plays an important, but not decisive, role—a factor which Schoonover replicated in the game design.\nIn 1985, RSI opened the game for play. Over time, RSI moved the game to a new mini-computer system—later named ICARUS—and processed the game there as of March 30, 1986. Program modifications continued in the early years after release in order to further improve gameplay. After the game's first four years, Schoonover said Hyborian War was a \"very good game\" but would continue to receive programming improvement, not because it wasn't commercially successful, but because the game deserved high standards as a tribute to Conan and Howard.\nThe basic tenets of the game remain largely similar to their original form. However, over the years players have recommended additional changes, and RSI has made game improvements. Charles Mosteller, in the September 2017 issue of Suspense and Decision, an online play-by-mail magazine, noted that in his communications with RSI leadership that the company appeared to be receptive to future game adjustments.\nNew possibilities emerged for players with the advent of the internet. While the play-by-mail format remained, RSI added an option to submit turns orders by email. Multiple online fan sites also emerged, providing collections of reference material and commentaries about the game as well as forums for players to collaborate. These websites allow the organization of specifically-formatted games (such as no contact between players) and to practice interpersonal game statecraft—in some cases before a game begins.\nReception and legacy\nHyborian War opened in 1985 to a generally positive reception. It was reviewed in 1987 in Space Gamer/Fantasy Gamer, with the comment that minor improvements were still needed but RSI deserved credit for delivering the game at the promised level of quality. Reviewer Bud Link said in the August/September 1987 issue of Gaming Universal it was \"perhaps one of the finest demonstrations of creative writing in the rulebook and turn reports, upon a continuing basis\". In the same year, Link also published \"The Hyborian Chronicles\", one of several fiction articles to be written about the game in the 1980s and 1990s. The game tied for the No.1 spot for Best Play By Mail Game of 1987 in Paper Mayhem, a magazine for play-by-mail games. The following year, it had slipped to the No.2 spot for Best PBM Game of 1988. In 1989, it was tied for No.5, and in 1990 tied for No.8.\nIn 1988, Vickie Lloyd's review in Paper Mayhem noted that the game had several positive aspects with some challenges in gameplay remaining. Other observers noted significant issues with RSI's customer service during this period. In reviews of play-by-mail games in the late 1980s and early 1990s, Paper Mayhem readers ranked Hyborian War consistently in the bottom 25percent of games based on playability, design, and product understanding.games. In the Jan/Feb 1990 issue of Paper Mayhem, readers rated Hyborian War 42nd of 53games.}} In 1991, reviewer Rick Cote noted this trend, while also identifying that RSI had made improvements to the game over the previous years.\nIn the digital age, Hyborian War has secured a largely positive reputation. In 2008, the game won the Origins Award for Best Play By Mail Game. In January 2014, reviewer J.D. gave the game a 7out of 10 in the online magazine Suspense and Decision, noting drawbacks such as \"forced peace treaties\", troop type issues, and character skill gaps in certain kingdoms—balanced by the game accounting for the factors of actual warfare along with diplomacy, intrigue, and other positives which retain players. In March 2014, reviewer Robert Paquin identified the diversity of the 36playable kingdoms as a \"major drawing point\", noting that he had \"yet to encounter such a gaming experience quite like this one anywhere else\". Though most play-by-mail companies have fallen by the wayside, RSI's Hyborian War continues to remain active into the 21stcentury.\nSee also\n* List of play-by-mail games\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* Howard, Robert E., \"The Phoenix on the Sword\" in\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* Louinet, Patrice, \"Foreword\" in\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* Schultz, Mark in \"Foreword\" in\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\nExternal links\n*\n*"
    }
  ]
}