{
  "content": [
    {
      "type": "text",
      "text": "# Hyde Park, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 1374\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4812\n| area                = 1.1\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 4.1\n| dir1                = SW\n| location1           = Townsville CBD\n| dist2               = 1356\n| dir2                = NNW\n| location2           = Brisbane\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Townsville\n| stategov            = Townsville\n| fedgov              = Herbert\n| near-nw             = West End\n| near-n              = West End\n| near-ne             = Townsville City\n| near-w              = Pimlico\n| near-e              = Hermit Park\n| near-sw             = Pimlico\n| near-s              = Mysterton\n| near-se             = Hermit Park\n}}\nHyde Park is a suburb in the City of Townsville, Queensland, Australia. In the , Hyde Park had a population of 1,374 people.\nGeography\nHyde Park is north of Mysterton, west of Hermit Park, east of Pimlico, and south of West End, and its postcode is 4812.\nNorth Townsville Road (Woolcock Street) runs along the northern boundary, and Townsville Connection Road (Charters Towers Road) runs along the eastern boundary.\nHistory\nIt is believed to be named after Hyde Park in London. Most of the street names come from London streets and suburbs - for example, named after Oxford Street, Bayswater Road and Park Lane.\nAs part of the development of Townsville, sugar plantations were established at Hyde Park in 1866.\nIn 1918, Hyde Park was transferred from the Thuringowa Shire to the City of Townsville by a government decree.\nHermit Park State School opened on 16 June 1924. Hermit Park Infants State School was separated from it on 1 February 1955, but closed on 17 December 1993 and became part of the State School again.\nSt Margaret Mary’s Catholic Primary School was established in 1936 by the Sisters of the Good Samaritan. Bishop Terrence McGuire had purchased the Woodlands estate from the Cummins family to use as a convent for the sisters, which was called Saint Philomena’s. The need for secondary education for girls in the area led to the sisters establishing St Margaret Mary’s College, which was officially opened by Bishop Hugh Ryan on 22 February 1963 with an initial enrolment of 50 girls. The primary school closed on 11 December 1987, but the secondary college continues to operate.\nDemographics\nIn the , Hyde Park had a population of 1,387 people.\nIn the , Hyde Park had a population of 1,374 people.\nFacilities\nHyde Park contains two shopping centres, Castletown Shoppingworld and the Hyde Park Centre located on Woolcock Street.\nHyde Park is also home to the Mater Women's and Children's Hospital, formerly known as the Wesley Park Haven Hospital and before that as the Park Haven Private Hospital (est. 1937). In January 1999 the hospital was acquired by The Wesley Hospital, Brisbane on behalf of the Uniting Church in Queensland. In 2007, it was acquired by the Townsville Sisters of Mercy, and is run under the Mater Health Services North Queensland umbrella organisation.\nEducation\nHermit Park State School is a government primary (Prep-6) school for boys and girls on the corner of Surrey and Sussex Streets (). In 2018, the school had an enrolment of 666 students with 45 teachers (42 full-time equivalent) and 28 non-teaching staff (17 full-time equivalent).\nSt Margaret Mary's College is a Catholic secondary (7-12) school for girls at 1-9 Crowle Street (). In 2018, the school had an enrolment of 711 students with 63 teachers (58 full-time equivalent) and 28 non-teaching staff (24 full-time equivalent).\nThere are no government secondary schools in Hyde Park; the nearest government secondary schools are Townsville State High School in Railway Estate to the north-east and Pimlico State High School in Gulliver to the south-west.\nReferences\nExternal links\n*"
    }
  ]
}