{
  "content": [
    {
      "type": "text",
      "text": "# Hyder–Stewart Border Crossing\n\n*US Port: None\n*Canadian Port: Highway 37A International Border, Stewart, BC V0T 1W0\n}}\n|coordinates=\n|opened=1910\n|website= [https://www.cbsa-asfc.gc.ca/do-rb/offices-bureaux/515-eng.html Canadian]\n}}\nThe Hyder–Stewart Border Crossing connects the communities of Hyder, Alaska, and Stewart, British Columbia, on the Canada–United States border. International Street on the American side joins British Columbia Highway 37A on the Canadian side.\nCanadian side\nW. Millar was the inaugural customs officer 1910–1912. The Port of Prince Rupert provided administrative oversight. In 1919, the province extended the  approach to complete a  road from Stewart to the border at Hyder. Although contemplated in 1925, it is unclear if the relocation of the customs office from Stewart to the border occurred at that time. In 1928, the road was widened.\nIn 1985, the border station closed. Over subsequent years, cocaine and firearms smuggling created challenges for the local RCMP detachment. By the early 2000s, the station had reopened.\nIn April 2015, the Canada Border Services Agency (CBSA) closed the border station between midnight and 8am Pacific. A steel gate blocked the only road across to Hyder. To address protests from Hyder residents, who rely upon Stewart for medical care and mainland road access, crossings for emergency services were permitted. The change also inconvenienced people wishing to cross the border early, such as mine workers and tourists. Following discussions between US and Canadian officials, the road reopened for 24-hour access that June, with a requirement that crossings be reported to CBSA at a video telephone installation.\nIn 2020, the former border hours of 8am–midnight reduced, becoming 8am–4:30pm.\nUS side\nIn 1920, although George Woodruff was expected to be the inaugural customs officer, E.R. Silvers in fact assumed the role. In 1923, the office was upgraded to a port of entry.\nIn the late 1970s, the US closed its border station, which was located in the same building as the Boundary Gift Shop. This is the only land border crossing where a person may legally enter the US without reporting to US border inspection. As a result, all flights leaving the Hyder Seaplane Base to other cities in Alaska are treated as international arrivals, and any passenger (including Hyder residents) may be inspected by U.S. Customs and Border Protection. Hyder is the easternmost community in Alaska.\nSee also\n* List of Canada–United States border crossings\n* Stewart Aerodrome and Water Aerodrome\nReferences"
    }
  ]
}