{
  "content": [
    {
      "type": "text",
      "text": "# I. King Jordan\n\n| birth_place = Glen Riddle, Pennsylvania, U.S.\n| birth_name = Irving King Jordan\n| spouse =\n}}\nIrving King Jordan (born June 16, 1943) is an American educator who became the first deaf president of Gallaudet University in 1988 after the Deaf President Now protest. Gallaudet is the world's only university with all programs and services designed specifically for deaf and hard-of-hearing students.\nAfter the week-long protest known as Deaf President Now, the Board reversed its decision and named Jordan, one of three finalists for the position, the eighth president of Gallaudet, the first deaf president since the institution was established in 1864.\nHe appears in both the 2011 disability rights documentary Lives Worth Living, and the 2025 documentary Deaf President Now.\nBackground\nJordan is a native of Glen Riddle, Pennsylvania, a small town near Philadelphia. Jordan was born hearing to hearing parents, who had no other instances of deafness in their families. After graduating from Penncrest High School in 1962, he enlisted in the US Navy and served four years. Jordan became deaf at the age of 21, when, after driving a motorcycle without a helmet, he was flung into the windshield of a car and suffered two skull fractures, a fractured jaw, and a concussion. His injuries severed the nerves in one ear completely and damaged the nerves in the other.\nJordan earned his master's degree and his doctorate in psychology at the University of Tennessee. He was serving as the dean of the College of Arts and Sciences at Gallaudet University when he was chosen as a candidate for the university presidency.\nAs a professor, department chair, dean, and president, Jordan made numerous scholarly contributions to his field. He was a research fellow at Donaldson's School for the Deaf in Edinburgh, Scotland, an exchange scholar at Jagiellonian University in Kraków, Poland, and a visiting scholar and lecturer at schools in the French cities of Paris, Toulouse, and Marseille.\nJordan and his wife, Linda, live in West River, Maryland. They have two grown children and two grandchildren. Jordan loves running daily. , he continues to run the Marine Corps Marathon each year. He was a co-founder of the American Association of People with Disabilities (AAPD). He is also a member of the Association of Late-Deafened Adults, which presents a yearly award to distinguished achievers in his name.\nPresident\nJordan became president of the university on March 13, 1988, after the Deaf President Now protest. He holds twelve honorary degrees and is the recipient of numerous awards, among them: the Presidential Citizen's Medal, the Washingtonian of the Year Award, the James L. Fisher Award from the Council for Advancement and Support of Education (CASE), the Larry Stewart Award from the American Psychological Association, and the Distinguished Leadership Award from the National Association for Community Leadership. In 1990, President Bush appointed Jordan Vice-chair of the President's Committee on Employment of People with Disabilities. He was reappointed to this position in 1993. In 2006, Jordan received the Award for Greatest Public Service Benefiting the Disadvantaged, an award given out annually by the Jefferson Awards.\nOn-campus, he was widely applauded for his successful efforts to increase funding, including funds for expanding and constructing two new large-scale centers for education research and support.\nOn September 1, 2005, Jordan announced his intentions to retire from the presidency effective December 31, 2006. Jordan became the subject of controversy when he supported the controversial decision made on May 1, 2006, by the board of trustees to appoint Jane Fernandes as president-designate. The announcement of her selection set off a campus-wide protest.\nCritics claimed that Fernandes was not highly regarded by both the faculty and students.  Jordan, taking a line from page 10 of the 1995 book Deaf President Now (by Christiansen and Barnartt), publicly accused some critics of rejecting Fernandes because she was not \"Deaf enough.\" The protestors claimed that Jordan was accepted as president, even though he did not become deaf until he was 21. They insisted that they protested for other reasons, such as their perception that Fernandes lacked charisma.\nJordan resigned from the Gallaudet presidency in December 2006 and retired from the Gallaudet faculty in December 2008. On April 6, 2010, it was announced that Jordan had been appointed by President Barack Obama to serve on the Commission on Presidential Scholars.\nReferences\nExternal links\n*"
    }
  ]
}