{
  "content": [
    {
      "type": "text",
      "text": "# I Didn't Know I Was Looking for Love__disambig_1\n\nLooking for Love}}\n| recorded   =\n| studio     =\n| venue      =\n| genre      =\n| length     = 3:51\n| label      = Blanco y Negro\n| writer     =\n* Ben Watt\n* Tracey Thorn\n| producer   = Phil Ramone\n| prev_title = The Only Living Boy in New York\n| prev_year  = 1993\n| next_title = Rollercoaster\n| next_year  = 1994\n}}\n\"'''I Didn't Know I Was Looking for Love'\" is a song written by Ben Watt and Tracey Thorn of Everything but the Girl. The band originally released the song in June 1993 as a track on their extended play (EP) of the same name, which reached number 72 on the UK Singles Chart. It was covered by English singer Karen Ramirez in 1998, whose version became a chart hit in several countries.\nKaren Ramirez version\n| recorded   =\n| studio     =\n| venue      =\n| genre      =\n* R&B\n* dance\n* house\n| length     = 3:56\n| label      = Manifesto\n| writer     =\n* Ben Watt\n* Tracey Thorn\n| producer   = Souled Out\n| prev_title = Troubled Girl\n| prev_year  = 1998\n| next_title = If We Try\n| next_year  = 1999\n}}\nThe song was covered by British singer Karen Ramirez and released as her second single from her album Distant Dreams'' in 1998, with the shorter title of \"Looking for Love\". This version peaked at number eight on the UK Singles Chart in June 1998 and topped the US Dance Club Play chart in 2001. It additionally peaked at number five in Hungary and number 10 in Italy. On the Eurochart Hot 100, \"Looking for Love\" reached number 45 in August 1998. Ramirez's version of the song was well received and garnered mainly positive reviews from critics.\nCritical reception\nDaily Record called \"Looking for Love\" a \"strong R&B hit\". Richard Wallace from Daily Mirror stated that \"the hypnotic cover\" of Everything But The Girl's \"I Didn't Know I Was Looking for Love\" \"was a beguiling introduction to the talents of Ms Ramirez\". Music & Media wrote that \"this English soul singer first really made her mark as a lead vocalist for Italian dance production team Souled Out. After the project was finished, all involved concluded that the collaboration had been successful to such an extent that it deserved some kind of follow up. Work on Ramirez' debut album Distant Dreams accordingly began soon after. The first single Troubled Girl was reasonably successful and expectations for this underrated gem written by Everything but the Girl are justifiably high.\" Smash Hits said that this remix could do for Karen Ramirez what Fatboy Slim's mix of \"Brimful Of Asha\" did for Cornershop. They added, \"These housey beats increase the funk factor ten-fold without losing the delicious vocals or hummable tune. A rare dance choon that sounds just as good off the dancefloor as on it. Bangin'!\"\nMusic video\nIn addition to extensive dance club and radio airplay, the music video for the song (which featured Ramirez walking around a house on a continuous loop, each time seeing previous versions of herself walking around the house) experienced heavy rotation on both MTV and VH-1 throughout the summer of 1998.\nCharts\nWeekly charts\n{|class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n!Chart (1998)\n!Peakposition\n|-\n|-\n|-\n|-\n!scope=\"row\"|Europe (Eurochart Hot 100)\n|45\n|-\n|-\n|-\n!scope=\"row\"|Hungary (Mahasz)\n|5\n|-\n!scope=\"row\"|Iceland (Íslenski Listinn Topp 40)\n|21\n|-\n|-\n!scope=\"row\"|Italy (Musica e dischi)\n|10\n|-\n!scope=\"row\"|Italy Airplay (Music & Media)\n| 1\n|-\n!scope=\"row\"|Netherlands (Dutch Top 40 Tipparade)\n|6\n|-\n|-\n|-\n|-\n|}\n{|class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n!Chart (2001)\n!Peakposition\n|-\n!scope=\"row\"|US Dance Club Play (Billboard)\n|1\n|}\nYear-end charts\n{|class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n!Chart (1998)\n!Position\n|-\n!scope=\"row\"|UK Singles (OCC)\n|84\n|}\n{|class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n!Chart (2001)\n!Position\n|-\n!scope=\"row\"|US Dance Club Play (Billboard)\n|31\n|}\nCertifications\nReferences"
    }
  ]
}