{
  "content": [
    {
      "type": "text",
      "text": "# I'm Fine (Thanks for Asking)__disambig_2\n\n| producer       =\n| screenplay     =\n| based_on       =\n| starring       =\n| music          = Erick Del Águila\n| cinematography = Becky Baihui Chen\n| editing        =\n| studio         = Kaliwood\n| distributor    =\n| released       =\n| runtime        = 92 minutes\n| country        = United States\n| language       = English\n| budget         =\n}}\n'I'm Fine (Thanks for Asking)' is a 2021 American indie film co-written and directed by Kelley Kali and Angelique Molina, marking their feature length debut. The film had its world premiere on March 17, 2021, at the SXSW Festival, where it won the special jury prize.\nSynopsis\nSet during the COVID-19 pandemic, the recently widowed Danny (Kali) is fighting to find $200 by the end of the day to secure housing in California for her eight-year-old her and her daughter Wes (Wesley Moss), whom she has told have been camping in a tent “for adventure”.\nCast\n* Kelley Kali as Danny\n* Wesley Miss as Wes\n* Dominique Molina as Mrs Cynthia\n* Lucas Byrd as Lucas\n* Jackie Holmes as Nyla\n* Xing-Mai Deng as Mr Yu\n* Julia Kennedy as Charlotte\n* Angelique Molina as Christina\n* Lamar Usher as Lamar\n* Ira Scipio as Bobby\n* Roma Kong as Rebecca\n* Andrew Galvan as Jacob\n* BK Marie as Brooklynn\n* Deon Cole as Chad\nProduction\nThe film was made on a “micro budget” including coronavirus stimulus checks, among other limited funds. Filming took place in Pacoima, Los Angeles. The film was shot in ten days and to help overcome problems with the COVID-19 pandemic and the constraints of the budget, the directors Kelley Kalli and Angelique Molina who also co-wrote the script with Roma Kong, included themselves and members of the crew in the cast, and called in favours from performer friends. Deon Cole acted as producer and executive producer. Cinematography was completed by Becky Baihui Chen.\nRelease\nThe film was shown at the SXSW Festival where it had its world premiere on March 17, 2021.\nReception\nOn the review aggregator website Rotten Tomatoes, I’m Fine (Thanks for Asking) holds an approval rating of 90% based on 31 reviews.\nCritical response\nWendy Ide in The Guardian described it as “rough around the edges” but “spirited and authentic”. David Jenkins in Little White Lies described it as “well-intentioned if slight and derivative” with “cold digital photography instantly creating a visual shorthand for that period of post-pandemic malaise”. Tara Brady in The Irish Times praised cinematographer Becky Baihui Chen for creating a “pleasing tableaux from the constant movement”, which included “a bravura set piece with a puddle.”\nAccolades\nThe film won the special jury prize at the South by Southwest Film Festival in March 2021.\nReferences\nExternal links\n*"
    }
  ]
}