{
  "content": [
    {
      "type": "text",
      "text": "# I've Never Seen Star Wars (radio series)\n\n| last_aired         =\n| num_series         = 6\n| num_episodes       = 36\n| audio_format       =\n| opentheme          = \"Enjoy Yourself (It's Later than You Think)\" by The Specials\n| endtheme           =\n| website            = [https://www.bbc.co.uk/programmes/b00hcr67 Official website]\n| podcast            =\n}}\n'I've Never Seen Star Wars' is a comedy talk show broadcast on BBC Radio 4. Hosted by comedian Marcus Brigstocke, each episode features a celebrity guest trying out experiences that are new to them, but common to many others. The title comes from the show's producer and creator, Bill Dare, having never seen the Star Wars films. The series has been the subject of controversy due to the questionable taste of some of the experiences.\nThe show has been adapted for television and was first broadcast on BBC Four in early 2009.\nFormat\nEach episode features a guest presenting a list of things to Brigstocke that, until coming on the show, they had never done before but many others have. Generally the show is structured around one each of certain types of experiences; reading a new book, listening to some new music, watching a new film or television programme (for all of these, the guest is often given an example of a genre they've never sampled before), eating a new food and taking part in a new leisure activity. Examples of the latter include comedian Phill Jupitus having his first colonic irrigation, magician Paul Daniels learning how to swim and Goodies star Tim Brooke-Taylor buying his first pornographic magazine.\nReception\nThe series has a mixed reception. Critics have praised the format. Chris Campling said ''I've Never Seen Star Wars is, \"one of the most invigorating new comedy series of the 21st century.\"\nElisabeth Mahoney in The Guardian'' wrote about Jupitus' appearance saying: \"He also tried colonic irrigation, and the recording of that was one of the funniest bits of radio this year. The therapist explained the process in a deadpan manner that was quite majestic, especially when she let her \"tubing clamps\" make their worrying sound effect. Jupitus fretted that she'd find \"some hidden G-spot of delight\" and that he'd become \"sexually addicted to having my arse pumped out\". Rather worryingly, then, he has already booked his next appointment.\"\nHowever, the series has been attacked because of some of the experiences which have appeared. Jupitus' colonic irrigation and eating foie gras, and Brooke-Taylor buying pornography are amongst the moments which have been cause for complaint. Dare appeared on BBC Radio 4's listener complaints show Feedback to defend ''I've Never Seen Star Wars''. Dare stated the choices were all made by the guests and were not designed to offend listeners. During the interview with host Roger Bolton, Dare was asked, \"if he could reassure listeners that there'd be no heavy breathing in future.\" Dare mocked  both Feedback and Bolton saying: \"Only if we get an asthmatic on, I suppose. But now asthmatics are going to ring up and say, how dare you make fun of our condition?\"\nEpisodes\nSix series of ''I've Never Seen Star Wars have been broadcast.\nSeries 1\n{| class=\"wikitable plainrowheaders\" style=\"width:98%;\"\n|-\n! style=\"background-color: #bfe0bf;\"| #\n! style=\"background-color: #bfe0bf;\"| Guest\n! style=\"background-color: #bfe0bf;\"|Original airdate\n|ShortSummary=Comedian Phill Jupitus tries eating foie gras with a Findus Crispy Pancake, has colonic irrigation, attempts to be a hairdresser, reads Jane Austen and drinks absinthe.\n|LineColor=bfe0bf\n}}\n|ShortSummary=Magician Paul Daniels cooks a meal, learns how to swim, experiences the film The Great Escape and reads some feminist literature.\n|LineColor=bfe0bf\n}}\n|ShortSummary=Comedian Mark Steel takes tea at the Ritz Hotel, attempts to assemble a flat-pack stool, goes to watch Hamlet and has a shave at a barbershop.\n|LineColor=bfe0bf\n}}\n|ShortSummary=Journalist Eve Pollard watches The Rumble in the Jungle, learns how to play poker, reads Do Androids Dream of Electric Sheep?'' and drinks a cocktail.\n|LineColor=bfe0bf\n}}\n|ShortSummary=Comedian Tim Brooke-Taylor makes a phone call, tries some unusual seafood, listens to a hip hop record and buys a pornographic magazine.\n|LineColor=bfe0bf\n}}\n|ShortSummary=Broadcaster Esther Rantzen joins Facebook, attempts to iron a man's shirt, listens to The Dark Side of the Moon, tries reflexology and reads Scoop.\n|LineColor=bfe0bf\n}}\n|}\nSeries 2\n{| class=\"wikitable plainrowheaders\" style=\"width:98%;\"\n|-\n! style=\"background-color: #b0c4de;\"| #\n! style=\"background-color: #b0c4de;\"| Guest\n! style=\"background-color: #b0c4de;\"|Original airdate\n|ShortSummary=Comedian Barry Cryer watches Friends, eats vegetarian and vegan food, reads The Catcher in the Rye, listens to Back in Black, attempts to change a baby's nappy and sings karaoke.\n|LineColor=b0c4de\n}}\n|ShortSummary=Comedian Arthur Smith watches Top Gear, learns how to play the piano, reads a Mills and Boon book, eats a Pop-Tart and watches Les Misérables.\n|LineColor=b0c4de\n}}\n|ShortSummary=Journalist Joan Bakewell places her first horse racing bet, listens to Arctic Monkeys, reads The Rules, watches Mamma Mia! and has a beat boxing lesson.\n|LineColor=b0c4de\n}}\n|ShortSummary=Impressionist Jan Ravens learns to box, reads Bravo Two Zero, builds a brick wall and has her eyebrows threaded.\n|LineColor=b0c4de\n}}\n|ShortSummary=Singer Suggs changes the oil in a car, listens to Take That and Vivaldi, reads A Brief History of Time, watches Titanic and learns to tap dance.\n|LineColor=b0c4de\n}}\n|ShortSummary=Comedian Sandi Toksvig wears high heels, eats a Pot Noodle, watches a football match, listens to Purple Rain and walks on stilts.\n|LineColor=b0c4de\n}}\n|}\nSeries 3\n{| class=\"wikitable plainrowheaders\" style=\"width:98%;\"\n|-\n! style=\"background-color: #AD8FFF;\"| #\n! style=\"background-color: #AD8FFF;\"| Guest\n! style=\"background-color: #AD8FFF;\"|Original airdate\n|ShortSummary=Comedian Sanjeev Bhaskar views the Crown Jewels, watches Sex and the City, plays Subbuteo, reads P. G. Wodehouse and goes to a Pentecostal service.\n|LineColor=AD8FFF\n}}\n|ShortSummary=Impressionist Jon Culshaw has a salad, goes to a casino, watches Turandot, listens to ''Woman's Hour and watches The Bridge on the River Kwai.\n|LineColor=AD8FFF\n}}\n|ShortSummary=Comedian Jenny Eclair reads Feel the Fear and Do It Anyway, eats eels, listens to Charlie Parker, has a bikini wax and watches Apocalypse Now''.\n|LineColor=AD8FFF\n}}\n|ShortSummary=Comedian Ardal O'Hanlon takes some herbal remedies, attempts bell ringing, reads Sir Terry Pratchett, joins Twitter and tries Spinning.\n|LineColor=AD8FFF\n}}\n|ShortSummary=Writer John Lloyd attempts to milk a goat, does some stand-up comedy, watches The Wire and revisits his old school.\n|LineColor=AD8FFF\n}}\n|ShortSummary=Reporter Kate Adie has porridge, watches The Sopranos, goes to a bingo hall, reads Swallows and Amazons and tries Yoga.\n|LineColor=AD8FFF\n}}\n|}\nSeries 4\n{| class=\"wikitable plainrowheaders\" style=\"width:98%;\"\n|-\n! style=\"background-color: #E77471;\"| #\n! style=\"background-color: #E77471;\"| Guest\n! style=\"background-color: #E77471;\"|Original airdate\n|ShortSummary=Satirist Ian Hislop buys a pair of jeans, plays Grand Theft Auto, tries Buddhist meditation and bakes a cake.\n|LineColor=E77471\n}}\n|ShortSummary=Comedian Frank Skinner has a spray tan, eats Jugged Hare, watches Inspector Morse and changes a car tyre.\n|LineColor=E77471\n}}\n|ShortSummary=Comedian Alan Davies has a pedicure, sings in public, reads The Adventures of Huckleberry Finn and watches The Jeremy Kyle Show.\n|LineColor=E77471\n}}\n|ShortSummary=Writer Giles Coren goes vegan, dances in public, reads some Harry Potter and listens to the charts as an adult.\n|LineColor=E77471\n}}\n|ShortSummary=Actress Kathy Burke tries seafood, does life drawing, proves the first guest to match the programme's title and visits Harrods.\n|LineColor=E77471\n}}\n|ShortSummary=Comedian Sarah Millican eats with chopsticks, reads The Joy of Sex, visits the Natural History Museum, watches the 1959 film Some Like It Hot and punches Marcus Brigstocke.\n|LineColor=E77471\n}}\n|}\nSeries 5\n{| class=\"wikitable plainrowheaders\" style=\"width:98%;\"\n|-\n! style=\"background-color: #FFE87C;\"| #\n! style=\"background-color: #FFE87C;\"| Guest\n! style=\"background-color: #FFE87C;\"|Original airdate\n|ShortSummary=Actor/writer Meera Syal eats snails, reads the Bhagavad Gita, watches Last Tango in Paris and attends a football match.\n|LineColor=FFE87C\n}}\n|ShortSummary= Comedian Dave Gorman enjoys a \"water cooler moment\", rides a horse, reads A Tale of Two Cities and visits a strip club.\n|LineColor=FFE87C\n}}\n|ShortSummary= Writer Benjamin Zephaniah drinks coffee and tea, reads The House at Pooh Corner, plays with a Scalextric and listens to Take Me Home.\n|LineColor=FFE87C\n}}\n|ShortSummary=  Les Dennis eats cheese, listens to a Rolling Stones album, reads The Lion, the Witch and the Wardrobe and watches The Inbetweeners.\n|LineColor=FFE87C\n}}\n|ShortSummary= Jenni Murray has a lesson in dog training, watches Reservoir Dogs, cooks a healthy meal of tofu, lentils and brown rice and watches a Frankie Boyle DVD.\n|LineColor=FFE87C\n}}\n|ShortSummary= Percussionist Evelyn Glennie watches herself performing in the Olympic opening ceremony, drives a Go-Kart, watches Downton Abbey and throws a pot.\n|LineColor=FFE87C\n}}\n|}\nSeries 6\n{| class=\"wikitable plainrowheaders\" style=\"width:98%;\"\n|-\n! style=\"background-color: #FFE87C;\"| #\n! style=\"background-color: #FFE87C;\"| Guest\n! style=\"background-color: #FFE87C;\"|Original airdate\n|ShortSummary=Politician Ann Widdecombe tries camping, watches the political drama The Thick of It, has a lesson in magic and tries a Jägerbomb.\n|LineColor=FFE87C\n}}\n|ShortSummary= Comedian Roy Walker tries bantering with the audience, watches his first Shakespeare play and has his first acting lesson.\n|LineColor=FFE87C\n}}\n|ShortSummary= Comedy actress Rebecca Front rides a motorbike, reads her first book about science, attends her first cricket match and watches ''Mrs. Brown's Boys.\n|LineColor=FFE87C\n}}\n|ShortSummary=  Gyles Brandreth spends a day doing nothing at all, watches Breaking Bad'' and writes a pop song (performed by Jess Robinson as Miley Cyrus).\n|LineColor=FFE87C\n}}\n|ShortSummary= Actor Reece Shearsmith eats frogs legs, has a driving lesson and tries wallpapering.\n|LineColor=FFE87C\n}}\n|ShortSummary= Athlete Dame Kelly Holmes makes a chocolate fondue, eats a deep-fried Mars bar and a chocolate-covered scorpion, attends hypnotherapy for a fear of drowning and tries reflexology.\n|LineColor=FFE87C\n}}\n|}\nReferences\nExternal links\n*\n*"
    }
  ]
}