{
  "content": [
    {
      "type": "text",
      "text": "# I Was A King\n\nI Was A King is a Norwegian rock band based in Egersund and Oslo, Norway. The band is led by vocalist, guitarist, and songwriter Frode Strømstad, who is the only member who has been with the band since their formation. The other members include Anne Lise Frøkedal, originally of the band Harrys Gym, Ole Reidar Gudmestad, and Arne Kjelsrud Mathisen. The band sings lyrics primarily in English.\nHistory\n2000s\nI Was A King was originally formed in Egersund in 2005, with their first concert in late 2006. The band released their first material in 2007 with the EP Losing Something Good For Something Better. In January 2009, the band's debut album I Was A King was released, which led to the band's breakthrough. The single \"Norman Bleik\" was b-listed on NRK P3 and the album was well received by critics. A reviewer from Pitchfork rated the album a 6.4/10, saying \"Imagine Matthew Sweet's \"Girlfriend\", only with Kevin Shields and J Mascis subbed in for Robert Quine and Richard Lloyd, and you get an idea of I Was a King's cumulative, generation-spanning appeal, at least theoretically.\" Among other things, a reviewer for Vårt Land wrote : \"If 2008 was the year of Snåsamannen, 2009 will be I Was A King's year\". The album was recorded in New York City with, among others, Sufjan Stevens as a guest musician.\n2010s\nThey released their second album, Old Friends, on August 16, 2010, and were nominated for the 2010 Spellemannprisen in the pop group category. The album was praised for its originality, as well as the added orchestration and clever, catchy songwriting. The band was also one of ten bands nominated for the a grant by the energy company Statoil in 2011, which is now known as Equinor. In 2012 they released the album You Love It Here on October 5th. Later that year, they were nominated for the 2012 Spellemannprisen in the pop category.\nOn March 21, 2014 the band released their fourth studio album, Isle of Yours. The design of the album cover, which is meant to signify the vulnerability and loneliness felt in the lyrics, received recognition both at the Visuelt Awards and the European Design Awards. Five years later, the band released their fifth album Slow Century on March 8, 2019. This was their first record under Coastal Town Recordings. The album received acclaim, and was praised by a reviewer at PunkRockTheory for its \"indie meets power pop tunes that manage to be simultaneously dreamy, melodic and downright beautiful\".\n2020s\nOn October 8, 2021, I Was A King released their sixth album, Grand Hotel, to mostly positive reviews. On October 28, 2022, the band released their seventh album, Follow Me Home. The album's lead single \"Growing Wild\" was praised for its rawness, strong melody, and internal rhythm.\nOn March 7, 2025 the band released a compilation album called Best Wishes - A Shortcut To I Was A King. It is named after their 2007 song \"Best Wishes\". It includes some of the band's most popular songs from their career, plus a few new singles such as \"Lo Pressure\" and \"Favourite Colours\". On August 15, 2025 the band released another single, \"Dust Bunnies\".\nDiscography\nStudio albums\n* I Was A King (2009)\n* Old Friends (2010)\n* You Love It Here (2012)\n* Isle of Yours (2014)\n* Slow Century (2019)\n* Grand Hotel (2021)\n* Follow Me Home (2022)\nExtended plays\n* Losing Something Good For Something Better (2007)\n* Twilight Anniversaries (2011)\n* Blood Brothers (2011)\nCompilation albums\n* Best Wishes - A Shortcut To I Was A King (2025)\nMembers\nThe line-up has varied throughout the band's existence, and several permanent and temporary members and studio musicians have been involved in the band.\nCurrent members\n* Anne Lise Frøkedal : guitar, vocals (from Harrys Gym)\n* Frode Strømstad : vocals , guitar\n* Ole Reidar Gudmestad : bass\n* Arne Kjelsrud Mathisen : drums\nFormer members\n* Astrid Våge : trombone, keyboards\n* Ben Crum : guitar (from Great Lakes)\n* Bjarne Stensli : drums (from Harrys Gym)\n* Emil Nikolaisen : drums (from Serena-Maneesh)\n* Erlend Ringseth : keyboards (from Harrys Gym)\n* Erlend Aasland : guitar, trombone , keyboards (from Tønes)\n* Gary Olson : trumpet (from The Ladybug Transistor)\n* Håvard Krogedal : bass\n* Jørgen Aasland : guitar, saxophone\n* Kevin Shea : drums (from Storm & Stress and Talibam!)\n* Kjetil Ovesen : keyboards (from 120 Days)\n* Kristoffer Solvang : drums\n* Kyle Forrester : bass (from Crystal Stilts)\n* Marlon McNeill : bass and guitar\n* Ole Johannes Åleskjær : bass (from The Loch Ness Mouse)\n* Petter Folkedal : guitar (from Sergeant Petter)\n* San Fadyl : drums (from The Ladybug Transistor)\n* Sufjan Stevens : keyboards\n* Pål Hausken : drums\nReferences\nExternal links\n* [https://www.discogs.com/artist/1230144-I-Was-A-King?redirected=true I Was A King] at Discogs\n* [https://musicbrainz.org/artist/109e07ec-fd3f-4a04-8649-08e61954dca2 I Was A King] at MusicBrainz"
    }
  ]
}