{
  "content": [
    {
      "type": "text",
      "text": "# Iain Stewart (politician)\n\n| birth_place = Scotland\n| death_date =\n| death_place =\n| nationality = British\n| spouse =\n| party = Conservative\n| relations =\n| children =\n| residence = Tattenhoe\n| alma_mater = Exeter University\n| occupation =\n| profession =\n| religion =\n| signature =\n| signature_alt =\n| website =\n| footnotes =\n| caption = Official portrait, 2020\n}}\nIain Aitken Stewart  (born 18 September 1972) is a British Conservative Party politician and former accountant. He served as the Member of Parliament (MP) for Milton Keynes South from 2010 until the seat's abolition in 2024.\nStewart served as Under-Secretary of State for Scotland from June 2020 to September 2022, sharing the role with David Duguid until September 2021, then with Malcolm Offord.\nEarly life\nStewart was born on 18 September 1972 in Scotland and grew up in Hamilton. He was educated at the state sector Chatelherault Primary School in Hamilton and then privately educated at Hutchesons' Grammar School and studied politics at the University of Exeter before training as an accountant with Coopers & Lybrand in Milton Keynes between 1993 and 1994.\nStewart then worked for the Scottish Conservative Party between 1994 and 1998 as Head of Research, before moving to work for a research unit (the Parliamentary Resources Unit) in Westminster, firstly as Deputy Director and finally as Director between 1998 and 2006. He then worked as an associate for executive recruitment company Odgers Berndtson until his election in 2010.\nPolitical career\nStewart stood unsuccessfully as the Conservative Party candidate in the 1999 Scottish Parliament election, for the Glasgow Rutherglen constituency, finishing fourth. Returning to Milton Keynes, he was selected to fight Milton Keynes South West at the 2001 general election, losing to incumbent Phyllis Starkey by 6,978 votes. Running again at the 2005 election, he lost to Starkey by 4,010 votes.\nHe successfully stood against Starkey for the redrawn Milton Keynes South constituency in the 2010 general election, winning by 5,201 votes. In the 2015 general election, he was re-elected with an increased vote of 27,601 and majority of 8,672. Whilst his majority has fluctuated, Stewart has been returned with a higher share of the vote with each election since 2010, in 2019 obtaining a 50% majority vote share. Stewart was a member of Shenley Brook End parish council between 2005 and 2011.\nTransport (especially rail transport), constitutional affairs and education are listed amongst his main political interests. He was a member of the Transport Select Committee of the House of Commons from 2010 to 2013, and was the longest-serving Conservative Member of that Committee. In 2011 he travelled, with various members of the transport committee, around Europe studying various rail links and rail systems. In the October 2013 Ministerial reshuffle, he was appointed as Parliamentary Private Secretary (PPS) to Rt Hon Patrick McLoughlin MP, Secretary of State for Transport.\nFollowing the 2015 election, he moved to become PPS to David Mundell, Secretary of State for Scotland, to assist with the Scotland Bill. He was also re-elected to the Transport Select Committee.\nIn July 2016 he was appointed as Parliamentary Private Secretary to Liam Fox, Secretary of State for the Department for International Trade. He held this post until the 2017 general election.\nIn June 2017, Stewart was returned as the MP for Milton Keynes South with a majority of 1,725 over Labour candidate Hannah O'Neill. He retained his place on the Transport Committee in September 2017.\nIn December 2017, following the publication of the National Infrastructure Commission's report on the Oxford-Milton Keynes-Cambridge corridor, he was appointed as the Government's official champion for the project.\nIn July 2018, he was asked by the Prime Minister to join the Government and he became an Assistant Whip in the Government Whips Office.\nIn June 2020, he was appointed Parliamentary Under Secretary of State for Scotland. He served in this role until September 2022.\nStewart contested the new Buckingham and Bletchley seat at the 2024 general election. when he was defeated by Callum Anderson (Labour).\nPersonal life\nStewart is openly gay and was formerly Deputy chairman (Political) of LGBTory, the Conservative LGBTQ Group. He is now a Patron of the group. In his maiden speech to the house, on 25 June 2010, he paid tribute to Alan Turing, and Gordon Brown's official apology for the state's persecution of Turing. He has spoken about how he was bullied at school for being gay and on the impact of homophobic bullying in schools. He was shortlisted for the Stonewall 'Politician of the Year' 2012.\nReferences\nExternal links\n*[http://www.iainstewartmp.co.uk Campaign website]\n*"
    }
  ]
}