{
  "content": [
    {
      "type": "text",
      "text": "# Ian Edward Stewart\n\nIan Edward Stewart (December 1908&nbsp;– 30th July 1989) was an English danceband leader and pianist who was musical director at the Savoy Hotel from 1955 until 1978.\nEarly career and wartime\nStewart was born in Seaton, Devon. He was a chorister at Salisbury Cathedral, attended St Edwards School in Oxford and took lessons from Herbert Howells. At the age of 18 he was appointed organist at Chalfont, near Taunton in Somerset. In Seaton he set up his own band, the Geisha Dance Band.\nStewart developed his career as a seaside pianist, as the musical director of touring shows, and in music publishing. In 1930 he moved to America, where he became a frequent broadcaster on NBC. By 1935 he was back in London, where he joined the Savoy Hotel Orpheans under Carroll Gibbons as deputy leader and second pianist. During the war Stewart distinguished himself in Burma in the Cameron Highlanders, rising to the rank of Brigade Major with the 17th Indian Division. In 1945 he was awarded an MBE.\nSavoy Hotel\nIn 1946 he became bandleader for the Berkeley Hotel in London, and began regular broadcasting for the BBC the following year. When Gibbons died in 1954 Stewart took over as leader of the Savoy Hotel Orpheans. He also continued with broadcasting work under the name Ian Stewart and his Quintet (or Quartet), regularly appearing on Music While You Work. For broadcasts as a solo pianist he composed his own signature tune, 'Story of a Song'. Stewart also recorded for the Decca, Parlophone and Fontana labels, including the Hits For Six series, which each included six arrangements of contemporary hits.\nLater life\nStewart retired from the Savoy in 1978, ending with a live television performance from the hotel. During his later career he played for Winston Churchill, Harold Macmillan (at 10 Downing Street) and Princess Margaret. He died, aged 80, after a long illness.\nReferences\nExternal links\n* [https://www.youtube.com/watch?v=FyppIWbVHes Ian Stewart And His Piano – Music At Midnight] (1963)"
    }
  ]
}