{
  "content": [
    {
      "type": "text",
      "text": "# Ian Sommerville (software engineer)\n\n| birth_place      = Glasgow, Scotland\n| nationality      = British\n| field            = Computer scienceSystems engineering\n| work_institution =\n| alma_mater       =\n| known_for        = Software engineering textbook\n| website          =\n}}\nIan F. Sommerville (born 23 February 1951), is  a British academic. He is the author of a popular student textbook on software engineering, as well as a number of other books and papers. He worked as a professor of software engineering at the University of St Andrews in Scotland until 2014 and is a prominent researcher in the field of systems engineering, system dependability and social informatics, being an early advocate of an interdisciplinary approach to system dependability.\nEducation and personal life\nIan Sommerville was born in Glasgow, Scotland in 1951.\nHe studied Physics at Strathclyde University and Computer Science at the University of St Andrews. He is married and has two daughters. As an amateur gourmet, he has written a number of restaurant reviews.\nAcademic career\nIan Sommerville was a lecturer in Computer Science at Heriot-Watt University in Edinburgh, Scotland from 1975 to 1978 and at Strathclyde University, Glasgow from 1978 to 1986.\nFrom 1986 to 2006, he was Professor of Software Engineering in the Computing Department at the University of Lancaster, and in April 2006 he joined the School of Computer Science at St Andrews University, where he taught courses in advanced software engineering and critical systems engineering. He retired in January 2014 and since continues to do software-related things that he finds interesting.\nIan Sommerville's research work, partly funded by the EPSRC has included systems requirements engineering and system evolution. He defined the process of Construction by configuration (CbC). A major focus has been system dependability, including the use of social analysis techniques such as ethnography to better understand how people and computers deliver dependability. He was a partner in the DIRC (Interdisciplinary Research Collaboration in Dependability) consortium, which focused on dependable systems design and is now (2006) working on the related INDEED (Interdisciplinary Design and Evaluation of Dependability) project. He has also been a member of the board of advisors to the IEEE SWEBOK project. He has worked on a number of European projects involving collaboration between academia and commercial enterprises, such as the ESPRIT project REAIMS (Requirements Engineering adaptation and improvement for safety and dependability).\nPublic activities\nIn 2006, Ian Sommerville was one of 23 academics in the computer field who wrote open letters calling for an independent audit of the British National Health Service's proposed Programme for IT (NPfIT) and expressing concern about the £12.4 billion programme.\nPublications\nMost widely read of Sommerville's publications is probably his student text book Software Engineering, currently in its 10th edition along with other textbooks Sommerville has also authored or co-authored numerous peer reviewed articles, papers.\nReferences"
    }
  ]
}