{
  "content": [
    {
      "type": "text",
      "text": "# Ian King (Australian cricketer)\n\nIan Harold King (born 1 June 1943) is a former Australian first-class cricketer, one of only a handful of Indigenous Australians to have played first-class cricket and convicted paedophile.\nBorn one of ten children in Brisbane, Queensland, King was a successful junior basketballer and professional welterweight boxer who won 28 of 32 fights under the name \"Young Rainbow\" (derived from his preference for brightly coloured clothes) before turning to cricket.\nA right-arm fast bowler and right-handed batsman, King started playing for Sydney club Bankstown before returning to Queensland where he continued to impress with his express pace bowling in grade cricket, leading to his first-class debut for Queensland, against Western Australia at the Brisbane Cricket Ground on 31 October 1969. The first Aboriginal to play for Queensland since Eddie Gilbert in 1936, King opened the bowling, taking 1/27 and 2/59.\nOn 7 December 1969, King became the first Indigenous Australian to play List A cricket, taking 5/33 against New South Wales. It was to be King's only List A match, leaving him with the impressive List A bowling average of 6.60. Two of the wickets were hit wicket; still the List A record for the number of hit wickets by a bowler in an innings.\nConsidered to be the fastest bowler to represent Queensland since Wes Hall, King (who gained the nickname \"Sammy\" due to his similarity to Sammy Davis Jr) was a popular figure with young fans and would spend lunch breaks after a session in the field signing autographs rather than resting.\nKing \"gave glimpses of rare talent, exceptional pace and splendid fielding ability.\" during the 1969/70 season, including his best figures of 6/70, against South Australia and a bright future seemed assured but following problems with the law in the 1970 off-season, King moved to Perth, where he seemed content to play club cricket before then moving to the Australian Capital Territory where he was involved in coaching. King was chosen as coach of the 1988 Aboriginal cricket team to England.\nIn April 2009, King faced child sex charges in Canberra. Claiming he abused the boys to make them better athletes and to help prepare them for manhood, King was found guilty and sentenced to 12 years imprisonment. On 28 January 2013 it was reported that King, while serving his prison sentence in Canberra, was punched in the eye by another prisoner and rushed to hospital amid concerns he would lose an eye.\nReferences\nSources\n* Higgs, J. \"Hit Wicket - Records, Lists & Curiosities\", The Cricket Statistician, No. 180, Winter 2017, The Association of Cricket Statisticians and Historians, Cardiff."
    }
  ]
}