{
  "content": [
    {
      "type": "text",
      "text": "# Ian Knight (historian)\n\nIan Knight (born 1956) is a British historian and writer, specialising in Anglo-Zulu and Boer wars.\nBiography\nIan Knight was born in Shoreham-by-Sea, Sussex, UK. He first studied Afro-Caribbean history at the University of Kent in the United Kingdom, then he majored in the military history of southern Africa and the history of the Zulu nation and the Anglo-Zulu war of 1879 in particular. He published many books on the subject (nearly thirty) and took part in the first archaeological excavations of the battlefield of Isandhlwana in 2000. His best known book is the in-depth study of the Isandlwana and Rorke's Drift campaigns, Zulu Rising. He has occasionally written about other British colonial campaigns, including the New Zealand and Sudan wars.  He has advised on museum exhibitions in both the UK and South Africa, and has consulted for British and American television channels, including the BBC, in the production of documentaries. He has catalogued sales of Zulu artefacts for auction houses. In 2019 he narrated a re-enactment of the battle of Isandlwana on the battlefield as part of the 140th anniversary commemoration, in the presence of His Majesty King Goodwill Zwelithini and Prince Mangosuthu Buthelezi, or for commemorative events.\nBibliography\n* Great Zulu battles, 1838-1906, Castle Books, 1988,\n* ''Queen Victoria's Enemies (2): Northern Africa, Bloomsbury USA, 1989\n* By Orders of the Great White Queen: Campaigning in Zululand Through the Eyes of the British Soldier, 1879 (editor), Greenhill Books, 1992,\n* Zulu 1816–1906, Bloomsbury USA, 1995\n* The Anatomy of the Zulu Army, from Shaka to Cetshwayo 1818-1879, Greenhill Books, Londres, 1999,\n* with Ian Castle, Zulu War, 1879, Osprey campaign, 2001,\n* With his face to the foe : the life and death of Louis Napoléon, the prince imperial, Zululand, 1879, Staplehurst (GB), 2001\n* Isandlwana 1879, Osprey campaign, 2002,\n* The National Army Museum book of the Zulu war, Pan Books, 2003,\n* Boer Commando 1876 - 1902, Osprey publishing, 2004\n* British fortifications in Zululand, 1879, Osprey publishing, 2005\n* Brave Men's Blood - the Anglo-Zulu war of 1879, Pen & Sword Military Classics, 2005,\n* A Companion to the Anglo-Zulu War, Pen & Sword Military Classics, 2008\n* Maori Fortifications, Bloomsbury USA, 2009\n* Zulu Rising: The Epic Story of Isandlwana and Rorke's Drift, Macmillan, 2010\n* The New Zealand Wars 1820–72, Bloomsbury Publishing, 2013\n* Boer Guerrilla vs British Mounted Soldiers: South Africa 1880-1902'', Osprey publishing, 2017\nHonours and awards\n* Royal United Services Institute's Prize for Best Military History in 2003.\n* Awarded the Anglo-Zulu Historical Society's Prince Mangosuthu Buthelezi Award for lifetime's achievement in the field of Zulu history.\nFurther reading\n* Adrian Greaves, The Tribe That Washed Its Spears: The Zulus at War, Pen & Sword Military, 2013\n* Desmond Bowen, Heroic Option: The Irish in the British Army, Pen & Sword Military, 2005\n* John Laband, Kingdom in Crisis: The Zulu Response to the British Invasion of 1879, Manchester University Press, 1992\n* John Laband, Historical Dictionary of the Zulu Wars, The Scarecrow press, 2009\nReferences\nExternal links\n*[https://ospreypublishing.com/ian-knight Osprey Publishing]"
    }
  ]
}