{
  "content": [
    {
      "type": "text",
      "text": "# Ian Stewart (police commissioner)\n\n|image            = Queensland Police Commissioner, Ian Stewart, 2017.jpg\n|imagesize        =\n|smallimage       =\n|caption          =\n|order            =\n|office           = Commissioner of the Queensland Police Service\n|term_start       =\n|term_end         =\n|predecessor      = Bob Atkinson\n|successor        = Katarina Carroll\n|deputy           =\n|office1          = State Recovery Coordinator\n|term_start1      =\n|term_end1        =\n|predecessor1     = Major General Stuart Smith\n|successor1       =\n|birth_date       =\n|birth_place      =\n|death_date       =\n|death_place      =\n|restingplace     =\n|profession       = Police officer\n|spouse           =\n|alma_mater       = University of Southern Queensland\n|religion         =\n}}\nIan Duncan Hunter Stewart  is a retired police officer who served as the Commissioner of the Queensland Police Service from 2012 until 2019. In 2019 Stewart was appointed the Queensland State Recovery Coordinator.\nCareer\nStewart was inducted as a constable to the Queensland Police Force with registered number 8661 on 14 December 1973, after growing up in Toowoomba. Six of his first seven years was spent policing in Townsville. He completed a Master of Public Policy and Administration and a Bachelor of Business qualifications.\nFrom Deputy Commissioner (Regional Operations) he was announced as Commissioner of the Queensland Police Service on 3 September 2012, commencing 1 November 2012.\nOn 1 January 2013 Stewart announced the commencement of the Queensland Police Service Renewal Program, which included organisational restructure. The review proposed a new vision for the Service with key objectives being to stop crime, make the community safer and build relationships across the community, aimed at delivering improved frontline policing and community services.\nHis contract was extended for three more years, from 1 November 2017. Stewart however prior to contract expiry announced his retirement on 25 February 2019 to take effect in July 2019.\nOn 18 October 2019 Stewart was named the new State Recovery Coordinator by Premier Annastacia Palaszczuk.\nHonours and awards\n{| class=\"wikitable\"\n|-\n!colspan=2|Honours and awards !! Date awarded !! Citation\n|-\n| ||  ||  ||distinguished service to law enforcement as Commissioner of Police in Queensland, and to the community.\n|-\n|  || Australian Police Medal (APM) || 26 January 2005 ||\n|-\n|  || National Emergency Medal ||  ||\n|-\n|  || National Police Service Medal ||  ||\n|-\n|  || National Medal ||  ||\n|-\n|  || Queen Elizabeth II Diamond Jubilee Medal || 1 July 2020 || Papua New Guinean ribbon of the medal.\n|-\n|  || Commissioner's Award for Meritorious Service ||  ||\n|-\n|  || Queensland Police Service Medal (with relevant years of service clasp)  ||  ||\n|-\n|  || 2010-2011 Queensland Flood and Cyclone Citation ||  ||\n|-\n|  || QPS 150 Years Citation ||  ||\n|}\nReferences\nExternal links\n* [http://www.police.qld.gov.au/aboutUs/ QPS Welcome Message from the Commissioner]"
    }
  ]
}