{
  "content": [
    {
      "type": "text",
      "text": "# Iberian War\n\n* Treaty of Eternal Peace\n* Sasanians retained Iberia\n* Byzantines retained Lazica\n| combatant1        = Byzantine Empire\n* Iberia\n* Ghassanids\n* Huns\n* Heruli\n* Aksumites\n* Kinda\n| combatant2        = Sasanian Empire\n* Lakhmids\n* Sabirs\n| commander1        = Justin IJustinian IBelisariusSittasGregoryHermogenesPharasJohn of LydiaSunicasTzath I of LazicaJabalah IV ibn al-HarithAl-Harith ibn JabalahDorotheusDomnentiolus Al-Harith of KindaAïganSimmasAscan\n| commander2        = Kavadh IPerozesXerxesAzarethesBawiMihr-MihroeChanarangesBaresmanasPityaxesAl-Mundhir III ibn al-Nu'manAratius Khosrow I\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n}}\nThe Iberian War was fought from 526 to 532 between the Byzantine Empire and the Sasanian Empire over the eastern Georgian kingdom of Iberia—a Sasanian client state that defected to the Byzantines. Conflict erupted among tensions over tribute and the spice trade.\nThe Sasanians maintained the upper hand until 530 but the Byzantines recovered their position in battles at Dara and Satala while their Ghassanid allies defeated the Sasanian-aligned Lakhmids. A Sasanian victory at\nCallinicum in 531 continued the war for another year until the empires signed the \"Perpetual Peace\".\nOrigin\nAfter the Anastasian War, a seven-year truce was agreed on, yet it lasted for nearly twenty years. Even during the war in 505, Emperor Anastasius I had already started fortifying Dara as a counter to the Persian fortress city of Nisibis for a looming conflict. During the reign of Justin I, investment in  fortification efforts were increased in Dara.\nFearing the security of his succession, the elderly Kavadh I (r. 488–531) proposed the adoption of his favoured son Khosrow I by the Emperor Justin I. Whilst initially optimistic of the proposal, Procopius writes that Justin's quaestor Proklos advised against an adoption out of a fear that Khosrow could use it as pretext to claim the Roman Empire. Justin would instead request a barbarian adoption, by an attire of arms, which would offend Khosrow.\nTensions in the region were compounded by religious affiliations. Lazica, a Christian Kingdom typically allied with the Persians, converted to Christianity and shifted allegiances to the Romans. Their king symbolically adopted Emperor Justin as his godfather. This shift motivated other Christian kingdoms in the Caucasus, such as Iberia, to defect from Persia.\nAccording to Procopius, Kavadh I tried to force the Christian Iberians to become Zoroastrians, and in 523, under the leadership of Gourgen, they rose in revolt against Persia, following the example of the neighboring Christian kingdom of Lazica. Gourgen received pledges by Justin I that he would defend Iberia. Procopius consistently uses religious motifs, contrasting the Zoroastrian Persian's barbarism with the Christian Roman's civility.\nAs part of his strategic consolidation of power in the East, Justinian further solidified border defences, incorporating Armenian provinces into the empire and stationing Roman garrisons in the area. Additionally, he aligned pro-Roman Arab clans under the Christian Jafnid Clan, whose leader was appointed king, providing a buffer zone between Rome and Persia.\nWar\nViolence escalated at various points where the power of the two empires met: in 525 a Roman fleet transported an Aksumite army to conquer Himyarite Yemen and in 525–526, Persia's Arab allies, the Lakhmids, raided Roman territories on the edge of the desert. The Romans were interested in gaining influence in Yemen to protect Christian interests there (see Christian community of Najran) as well as to dominate the spice and silk trade routes to India which were under Persian control.\nBy 526–527, overt fighting between the two empires had broken out in the Transcaucasus region and upper Mesopotamia. Following the emperor Justin I's death in 527, Justinian I acceded to the imperial throne. The early years of war favored the Persians, by 527 the Iberian revolt had been crushed, a Roman offensive against Nisibis and Thebetha in that year failed and forces attempting to fortify Thannuris and Melabasa were prevented from doing so by Persian attacks.\nIn 528, the Persians pressed on from Iberia to capture forts in eastern Lazica. Attempting to remedy the deficiencies revealed by these Persian successes, Justinian reorganised the eastern armies by dividing the command of the magister militum of the East in two and appointing a separate magister militum of Armenia over the northern portion. Belisarius's forces were defeated by Xerxes during the battle of Thannuris and he had to retreat to Dara.\nIn response to damaging raids on Syria by the Lakhmids from 528 to 529, Justinian reorganised the loose network of Arab rulers employed by the Romans under the sole leadership of Ghassanid leader Al-Harith ibn Jabalah, who was raised to the rank of Vir gloriosus. Such reform mirrored the more centralised approach of Persia, whose own Arabic clients had been organised under Lakhmid leader Al-Mundhir III ibn al-Nu'man.\nIn 530, Belisarius led the Romans to victory over a much larger Persian force under Perozes at the Battle of Dara, while Sittas and Dorotheus defeated a Persian army under Mihr-Mihroe at the Battle of Satala. In 531, Belisarius was defeated by Persian and Lakhmid forces at the Battle of Callinicum but during the summer, the Romans captured some forts in Armenia and repulsed a Persian offensive. The Roman failure at Callinicum was followed by a commission of inquiry; Belisarius was dismissed from his post. Azarethes, the Persians' commander at Callinicum, was also stripped of his ranks due to his failure to capture any significant fortification.\nTruce\nJustinian's envoy, Hermogenes, visited Kavadh to re-open negotiations but without success. Justinian tried to form an alliance with the Axumites of Ethiopia and the Himyarites of Yemen against the Persians but his alliance proposal failed. The Persians conducted the Siege of Martyropolis but abandoned it as Kavadh died shortly afterwards.\nIn spring 532 negotiations progressed after the succession of King Khosrow I, who needed to devote attention to domestic threats. Justinian too favoured an early end to the war, potentially viewing dynastic instability in Vandalic Africa and Ostrogothic Italy as encouragement to reallocate Roman forces in the east towards the western Mediterranean. Negotiations concluded with the agreement of Eternal Peace, whereby all territories seized during the war by either side were returned and the Dux of eastern forces moved from Dara to Constantia. However, the Byzantines paid a tribute of 11,000 lbs (5000 kg) gold to the Sasanian Empire.\nSee also\n* Aksumite–Persian wars\n* Lazic War\nReferences\nSources\n*\n*\n*\n*\n*\n*"
    }
  ]
}