{
  "content": [
    {
      "type": "text",
      "text": "# Ibrahim of the Ottoman Empire\n\n| coronation   =\n| cor-type     =\n| predecessor  = Murad IV\n| regent       = Kösem Sultan (1640-1648)\n| reg-type     =\n| successor    = Mehmed IV\n| succession1  = Ottoman caliph (''Amir al-Mu'minin'')\n| predecessor1 = Murad IV\n| successor1   = Mehmed IV\n| consort      =\n| spouse       = Turhan SultanSaliha Dilaşub SultanMuazzez SultanAyşe Sultan Mâhenver SultanSaçbağı SultanŞivekar SultanHümaşah SultanOthers\n| spouse-type  = Consorts\n| issue        =\n| issue-link   = #Sons\n| issue-pipe   = Among others\n| full name    = Ibrahim bin Ahmed\n| house        = Ottoman\n| house-type   = Dynasty\n| father       = Ahmed I\n| mother       = Kösem Sultan\n| birth_date   = 13 October 1617\n| birth_place  = Topkapı Palace, Constantinople, Ottoman Empire\n| death_date   =\n| death_place  = Constantinople, Ottoman Empire\n| burial_date  =\n| burial_place = Hagia Sophia, Istanbul, Turkey\n| signature_type = Tughra\n| religion     = Sunni Islam\n| signature    = Tughra_of_Ibrahim.svg\n}}\nIbrahim (; ; ; 13 October 1617 – 18 August 1648) was the sultan of the Ottoman Empire from 1640 until 1648.\nHe was born in Constantinople as the last son of sultan Ahmed I (1590–1617) and Kösem Sultan (1589–1651), also known as Mahpeyker Sultan, an ethnically Greek woman claimed to originally be named Anastasia.\nHe was called Ibrahim the Mad () due to his mental condition and behavior. However, historian Scott Rank notes that his opponents spread rumors of the sultan's insanity, and some historians suggest that he was more incompetent than mad.\nEarly life\nIbrahim was born on 13 October 1617 as the last son of Sultan Ahmed I and his Haseki Sultan, Kösem Sultan and when he was merely a month old, his father suddenly died and Ibrahim's uncle Mustafa I became the new sultan. Kösem Sultan and her children, including an infant Ibrahim, were sent to the Old Palace. After his brother Murad IV inherited the throne from his uncle Mustafa I, Ibrahim was confined in the Kafes, which affected his health. Murad had Ibrahim's two surviving half-brothers Şehzade Bayezid, Şehzade Süleyman and a few years later, one full-brother Şehzade Kasım executed and Ibrahim feared that he would be next, but after his older brother Murad's death, Ibrahim became Sultan.\nReign\nAccession\nOne of the most notorious Ottoman Sultans, Ibrahim spent all of his early life in the close confinement of the Kafes before succeeding his brother Murad IV (1623–40) in 1640. Three of their brothers had been executed by Murad, and Ibrahim lived in terror of being the next to die. His life was saved only by the intercession of Kösem Sultan, mother of Ibrahim and Murad.\nMurad's death left Ibrahim as the sole surviving prince of the dynasty. Upon being asked by Grand Vizier Kemankeş Kara Mustafa Pasha to assume the Sultanate, Ibrahim suspected that Murad was still alive and plotting to trap him. It took the combined persuasion of Kösem and the Grand Vizier, and personal examination of his brother's dead body, to make Ibrahim accept the throne.\nEarly reign\nDuring the early years of Ibrahim's reign, he retreated from politics and turned increasingly to his harem for comfort and pleasure. During his sultanate, the harem achieved new levels of luxury in perfumes, textiles and jewellery. His love of women and furs led him to have a room entirely lined with lynx and sable. Because of his infatuation with furs, the French dubbed him \"Le Fou de Fourrures\". Kösem Sultan kept her son in check by supplying him with virgins that she personally purchased from the slave market, as well as overweight women, whom he craved.\nAn account of his reign is given by Demetrius Cantemir. He wrote of Ibrahim:\n}}\nKara Mustafa Pasha remained as Grand Vizier during the first four years of Ibrahim's reign, keeping the Empire stable. With the Treaty of Sèvres (15 March 1642), he renewed peace with Austria and in the same year recovered Azov from the Cossacks. Kara Mustafa also stabilized the currency with coinage reform, sought to stabilize the economy with a new land-survey, reduced the number of janissaries, removed non-contributing members from the state payrolls, and curbed the power of disobedient provincial governors. During these years, Ibrahim showed concern with properly ruling the empire, as shown in his handwritten communications with the Grand Vizier. Kara Mustafa in turn wrote a memo on public affairs to coach his inexperienced master. Ibrahim's replies to Kara Mustafa's reports show that he had actually received a good education. Ibrahim often traveled in disguise, inspecting the markets of Istanbul and ordering the Grand Vizier to correct any problems that he observed.\nDecadence and crisis\nIbrahim was often distracted by recurring headaches and attacks of physical weakness, perhaps caused by the trauma of his early years. Since he was the only surviving male member of the Ottoman dynasty, Ibrahim was encouraged by his mother Kösem Sultan to distract himself with harem girls and soon fathered three future sultans: Mehmed IV, Suleiman II and Ahmed II. The distractions of the harem allowed Kösem Sultan to gain power and rule in his name, yet even she fell victim to the Sultan's disfavor and left the Imperial Palace.\nIbrahim came under the influence of various unsuitable people, such as mistress of the imperial harem Şekerpare Hatun and the charlatan Cinci Hoca, who pretended to cure the Sultan's physical ailments. The latter, along with his allies Silahdar Yusuf Agha and Sultanzade Mehmed Pasha, enriched themselves with bribes and eventually usurped enough power to secure the execution of Grand Vizier Ḳara Muṣṭafā. Cinci Hoca became Kadiasker (High Judge) of Anatolia. Yusuf Agha became Kapudan Pasha (Grand Admiral) and Sultanzade Mehmed, Grand Vizier.\nIn 1644, the Knights of Malta seized a ship carrying high-status pilgrims to Mecca. Since the Knights had docked in Crete, Kapudan Yusuf Pasha encouraged Ibrahim to invade the island. This began 24 years of war with Venice. Crete did not completely fall under Ottoman domination until 1669. In spite of the decline of La Serenissima, Venetian ships won victories throughout the Aegean, capturing Tenedos (1646) and blockading the Dardanelles. Kapudan Yusuf enjoyed temporary success in conquering Canea, starting a jealous rivalry with Nevesinli Salih Pasha, the recently installed grand vizier. The rivalry led to Yusuf's execution (January 1646) and the Grand Vizier's deposition (December 1645).\nWith his cronies in power, Ibrahim's extravagant tendencies went unchecked. He raised eight concubines to the favored position of haseki (royal consort), granting each riches and land. After legally marrying the concubine Telli Haseki, he ordered the palace of Ibrahim Pasha to be carpeted in sable furs and given to her.\nDeposition and execution\nMass discontent was caused by the Venetian blockade of the Dardanelles—which created scarcities in the capital—and the imposition of heavy taxes during a war economy to pay for Ibrahim's whims. In 1647 the Grand Vizier Nevesinli Salih Pasha, Kösem Sultan, and the şeyhülislam Abdürrahim Efendi unsuccessfully plotted to depose the sultan and replace him with one of his sons. Salih Pasha was executed, and Kösem Sultan was exiled from the harem.\nThe next year, the Janissaries and members of the ulema revolted. On 8 August 1648, corrupt Grand Vizier Ahmed Pasha was strangled and torn to shreds by an angry mob, gaining the posthumous nickname \"Hezarpare\" (\"thousand pieces\"). On the same day, Ibrahim was seized and imprisoned in Topkapı Palace. Kösem gave consent to her son's fall, saying \"In the end, he will leave neither you nor me alive. We will lose control of the government. The whole society is in ruins. Have him removed from the throne immediately.\"\nIbrahim's six-year-old son Meḥmed was made sultan. The new grand vizier, Sofu Mehmed Pasha, petitioned the sheikh ul-Islam for a fatwā sanctioning Ibrahim's execution. It was granted, with the message \"if there are two caliphs, kill one of them.\" Kösem also gave her consent. Two executioners were sent for; one being the chief executioner who had served under Ibrahim. As the executioners drew closer, it was reported that Ibrahim's last words were: \"Is there no one among those who have eaten my bread who will take pity on me and protect me? These cruel men have come to kill me. Mercy! Mercy!\" As his mother, Kösem Sultan, and officials watched from a palace window, Ibrahim was strangled on 18 August 1648. His death was the second regicide in the history of the Ottoman Empire.\nFamily\nIn addition to his eight Haseki Sultans (the first and only certain case of the coexistence of several Haseki at the same time and a symptom of the loss of prestige and exclusivity of the title which began under Murad IV) he had a large number of concubines, of which only some are known. However, only Şivekar Sultan and Hümaşah Sultan, who also became his legal wife, had any real political power or influence over the sultan. Ibrahim was particularly famous for his brief but intense love obsessions, often with women who were not part of his harem and that he had his agents commandeer around the city.\nOther anecdotes related to his harem are Ibrahim's supposed passion for obese women, which would have led Şivekar, called \"the fattest woman at Constantinople\", to become his favorite, and the story that he drowned 280 concubines in his harem because of a rumor that one of them had had a forbidden relationship with a man, an anecdote however rejected by several historians as invented or exaggerated.\nConsorts\nIbrahim I had seven or eight Haseki Sultans (seven according to Evliya Çelebi, eight according to Ahmed Refik, the archival research confirming Evliya's information), the last of whom was also his legal wife, plus a number of known and unknown minor concubines:\nHasekis\nAll of Ibrahim's Hasekis received 1,000 aspers a day except for Saliha Dilaşub Sultan who received 1,300 aspers a day. Ibrahim gifted the incomes of Bolu, Hamid, Nicopolis Sanjaks, and Syria Eyalet to Saliha Dilaşub, Mahienver, Saçbağlı, and Şivekar Sultans respectively. He also lavished the treasury of Egypt upon Saçbağlı Sultan and Hümaşah Sultan, and presented the Ibrahim Pasha Palace to Hümaşah. His known consorts were:\n* Turhan Sultan. She was the BaşHaseki (First Haseki) and mother, Valide Sultan and Official regent of the Ottoman Empire during the reign of her son Mehmed IV. She was either of Russian or Ukrainian origin. After her son's accession to the throne, and after the assassination of Kosem Sultan, she undertook the complete control over the Ottoman Empire as Official Regent from the assasination of Kosem in 1651 to until her resignation in 1656, acting as the De facto ruler of the Empire, similar to a Sultan. Under her regency, Ottoman Empire saw campaigns like Crete campaign, and she acted the patrone of arts and as an effective ruler. She along with Kosem are the only women who ever ruled the Ottoman Empire with Supreme authority, similar to that of an Ottoman Sultan. She protected Ibrahim's remaining children from execution, resulting in the definitive abandonment of the Law of Fratricide. She also was the longest reigning Valide Sultan in the Ottoman history, who remained as Valide Sultan for over 35 years.\n* Saliha Dilaşub Sultan, also called Aşub or Aşube Sultan. She was the second Haseki and mother and Valide Sultan of Suleiman II; she was Ibrahim's first concubine and was of Serbian origin. She and her son were planned to replace Turhan Sultan and her son Mehmed IV as Valide Sultan and as the reigning Sultan, upon project of Kösem Sultan to eliminate Turhan and her allies and thereby, Kosem can effectively rule the empire as regent unopposed, but her assassination prevented it. Dilasub was exiled to Old Palace by Turhan after she undertook regency of the Empire while keeping her son in the Topkapi Palace and also protecting him from execution attempts. Anyways when Mehmed IV was deposed in 1687, Suleiman II finally became Sultan and Saliha, now the Valide Sultan, lived as such only for 2 years until her death.\n* Muazzez Sultan. She was the third Haseki and mother of Ahmed II. She, along with Dilaşub Sultan and other Hasekis, was exiled to the Old Palace when Mehmed IV ascended the throne. Muazzez died in a fire at the Old Palace which took place during Suleiman II's reign; so, she did not see her son's installation and wasn't named as Valide Sultan.\n* Ayşe Sultan (died 1675). She was the fourth Haseki, titled as such in January 1645. She was of Tatar origins.\n*Mâhenver Sultan. She was the fifth Haseki and appeared as the Sultan's consort firstly in 1645; and is mentioned then on 2 May 1646. She was of Circassian origin.\n*Saçbağı Sultan. She was the sixth Haseki, of Circassian origin. Little is known about her, but she was an influential, authoritarian and extravagant wife. She was gifted with the income of the Sanjak of Nicopolis and part of the so-called \"treasury of Egypt\". She and the Sultan had at least two children.\n* Şivekar Sultan. originally known as Maria, She was the seventh Haseki Sultan of the Ottoman Empire and she was of Armenian descendant, daughter of a rich Armenian merchant and was known as \"the fattest woman in the capital\"; she was also one of the only two politically active consorts of Ibrahim. She was granted lands in Damascus by the Sultan and acted as advisor to him during his reign. She and the Sultan had one son. She was banished from Topkapi to the Old Palace after the execution of Ibrahim. She died in 1693, making her the longest lived consort of Ibrahim, outliving Turhan, Dilasub, Muazzez and even Turhan's son Mehmed IV and Dilasub's son Suleiman II.\n* Hümaşah Sultan. She was the eighth and last Haseki and was Ibrahim's only legal wife. After the wedding, she was nicknamed as \"Telli Haseki\". Upon her marriage, The Sultan handed her the treasury of Egypt as a dowry and gifted her Ibhrahim Pasha's former palace. He also banished his sisters Ayşe, Fatma and his niece Kaya accusing them of having insulted his new wife and of not having served her in a suitable way. They had a son who died in 1650. Moreover, she was one of the only two politically active consorts of Ibrahim and after his death, along with the other Hasekis, was banished to the Old Palace. In 1672, she remarried the Kaymakam of Constantinople, Ibrahim Pasha.\nConcubines\n* Zafire Hatun, called also Zarife. Georgian concubine. While he was still a prince, she became pregnant in violation of the rules of the harem. Kösem Sultan, Ibrahim's mother, handed her over to the kızları agasi Sümbül Ağa and ordered for her to be drowned, but the man hid her in his house, where she gave birth to her son Osman. Having discovered this, Kösem exiled them to Egypt, but their ship was attacked by the Knights Hospitaller and Zafire and Osman were taken to Malta, where Zafire died shortly afterwards.\n* Hubyar Hatun. One of the concubines Ibrahim became infatuated with for a while. She was then released and given in marriage to Ibrahim Ağa.\n* Şekerpare Hatun. Before one of Ibrahim’s concubines, she then became musahibe (companion), treasurer and hostess of the harem.\n* Sakizula Hatun.\n* Şekerbanu Hatun.\n* Hatice Hatun.\n* The wife of the Grand Vizier Hezarpare Ahmed Paşah. After having fallen in love with her, Ibrahim forced her to divorce her husband. In return, both Ahmed Pasha and his son received a daughter of Ibrahim as a wife, respectively the little Beyhan Sultan, at the time one year (according to some sources she was later raised by his ex-wife), and Safiye Sultan, the eldest.\n* The daughter of Şeyhülislam Muid Ahmed Efendi. According to A.L. Castellan, Ibrahim asked her for his harem, but her father objected, so the sultan had her kidnapped from the baths, and then sent her home after some time.\nSons\nIbrahim I had at least ten sons:\n* Osman / Şehzade Fulan (before 1640 or 2 January 1642, Constantinople – 25 October 1676, Malta) – with Zafire Hatun. Conceived while Ibrahim was still Şehzade in violation of the rules of the harem. Kösem Sultan, mother of Ibrahim, ordered that the pregnant mother be drowned. She was saved from the kızları agasi and gave birth to a son, who became known as \"the bastard of the black eunuch\". Having discovered this, Kösem exiled the three to Egypt, but the ship was attacked. The child was taken to Malta, where he later converted to Christianity and changed his name to Domenico di San Tommaso and came to be known as Domenico Ottomano or Padre Ottomano. It has been disputed whether Osman was fathered by Ibrahim or by someone else.\n* Mehmed IV (2 January 1642, Constantinople – 6 January 1693, Edirne) – with Turhan Sultan. 19th Sultan of the Ottoman Empire. For the first 3 years of his reign, Ottoman Empire was ruled by his grandmother Kösem Sultan and the next 5 years by his mother Turhan Sultan. He was the second longest reigning sultan in Ottoman history after Suleiman the Magnificent and it was under his reign, Ottomans saw the greatest expansion in europe which ultimately led to the Battle of Vienna which the Ottomans lost and thereby starting the Great Turkish War ending the Ottoman hegemony in Europe.\n* Suleiman II (15 April 1642, Constantinople – 22 June 1691, Edirne) – with Saliha Dilaşub Sultan. 20th Sultan of the Ottoman Empire. His reign oversaw the continuation of Great Turkish war.\n* Ahmed II (25 February 1643, Constantinople – 6 February 1695, Edirne) – with Muazzez Sultan. 21st Sultan of the Ottoman Empire. His reign also oversaw the final phase of the Great Turkish war. Under his successor Mustafa II, the Great Turkish War finally ended.\n* Şehzade Murad (April 1643, Constantinople – 16 January 1644, Constantinople).\n* Şehzade Selim (19 March 1644, Constantinople – September 1669, Constantinople or Edirne). He lived and died in the Kafes.\n* Şehzade Osman (August 1644, Constantinople – 1646, Constantinople).\n* Şehzade Bayezid (1 May 1646, Constantinople – August 1647, Constantinople).\n* Şehzade Cihangir (14 December 1646, Constantinople – 1 December 1648, Constantinople) – with Şivekar Sultan;\n* Şehzade Orhan (October 1648, Constantinople – January 1650, Constantinople) – with Hümaşah Sultan.\nAt one point, Ibrahim took a great liking to the infant son of a slave woman (sometimes claimed to be the same person as Osman / Padre Ottomano), to the extent of preferring the unrelated child to his son Mehmed. Turhan, Mehmed's mother, grew extremely jealous and vented her anger to Ibrahim, who flew into a rage and grabbed Mehmed from Turhan's arms and threw him into a pool. Mehmed would have drowned if a servant had not rescued him. He was left with a permanent scar on his forehead.\nDaughters\nIbrahim I had at least three daughters: Fatma, Geverhan and Beyhan:\n*Fatma Sultan (between September and December 1642, Constantinople –1657) – perhaps with Muazzez Sultan. In 1645 she married Musahip Silahdar Yusuf Paşah, who was executed on 22 January 1646. A month later, her father married her to Musahib Fazlı Paşa, who Ibrahim exiled a couple of months after while causing to divorce them. She was buried in the Yeni Valide mosque. Turhan Sultan took care of her grave.\n* Gevherhan Sultan (1642, Constantinople – 27 October 1694, Edirne) – perhaps with Muazzez Sultan. She was married three times: to Cafer Pasha on 23 November 1646, to Admiral of the Fleet and vizier Çavușzade Mehmed Pasha (died 1681), and to Helvacı Yusuf Pasha (died 1714) on 13 January 1692.\n* Beyhan Sultan (1645, Constantinople – 15 September 1700, buried in Süleyman I Mausoleum, Süleymaniye Mosque) – perhaps with Turhan Sultan. She was married four times: to Kücük Hasan Pasha in 1646, to Grand Vizier Hezarpare Ahmed Pasha (murdered 1648) in 1647, to Uzun Ibrahim Pasha (executed 1683), and to Bıyıklı Mustafa Pasha (died 1699) in 1689. By her fourth marriage she had a son, Sultanzade Hüseyin Bey (1690 - 1754).\nOthers\nAccording to unspecified sources:\n* Safiye Sultan (1640, Constantinople – ?) – with Turhan Sultan. She married Baki Bey, son of the Grand Vizier Hezarpare Ahmed Paşah by his first wife. Buried in Ahmed I's mausoleum, Sultan Ahmed Mosque.\n* Ayşe Sultan (1646, Constantinople – 1675, Cairo). She married two times. She married Defterdar Ibrahim Paşah, governator of Cairo, and was widowed in 1664. She finally married her cousin, the governor of Buda and Cairo Sultanzade Canbuladzade Hüseyn Pasha, son of Fatma Sultan.\n* Atike Sultan (?, Constantinople – ) – perhaps with Turhan Sultan. She was married three times: to Sarı Kenan Pasha (executed 1659) in 1648, to Boşnak İsmail Pasha (killed 1664) in 1659, and to Gürcü Mehmed Pasha in 1665.\n* Kaya Sultan (?, Constantinople – ?). She married Haydarağazade Mehmed Paşa in 1649, who was executed in 1661.\n* Ümmügülsüm Sultan (?, Constantinople – 1654), with Turhanshe was called also Ümmi Sultan. She was married in 1653 to Abaza Ahmed Pasha (died 1656). She died soon after the wedding.\n* Hatice Sultan (?, Constantinople – ?, Constantinople). Died in infancy.\n* Bican Sultan (/1649, Constantinople – ?). She was born posthumously as Ibrahim's last child. She was proposed in marriage to Kuloğlu Musahip Mustafa Paşah, but he refused her (he would later marry Mehmed IV's daughter, Hatice Sultan, in 1675). She was then married to Cerrah Kasım Paşah, in January 1666.\nIn popular culture\nThe tragic play Ibrahim, the Thirteenth Emperor of the Turks, written by Mary Pix and first performed in 1699, purported to describe incidents in Ibrahim's life. The numbering is correct only if Mehmed the Conqueror is regarded as the First Emperor, and the disputed reign of his son Cem is counted as well.\nIn the Turkish series Muhteşem Yüzyıl: Kösem he is portrayed by actor Ridvan Aybars Duzey as a prince and by Tugay Mercan as a Sultan.\nIn the film Three Thousand Years of Longing (2022), Ibrahim is portrayed by Jack Braddy, with Hugo Vella as him as a child.\nReferences\nFurther reading\n* Rank, Scott. ''History's 9 Most Insane Rulers'' (2020) ch 4.\nExternal links\n*"
    }
  ]
}