{
  "content": [
    {
      "type": "text",
      "text": "# Icelandic independence movement__disambig_1\n\nThe Icelandic independence movement  (Icelandic: Sjálfstæðisbarátta Íslendinga) was the collective effort made by Icelanders to achieve self-determination and independence from the Kingdom of Denmark throughout the 19th and early 20th century.\nIceland received a constitution and limited home rule in 1874. A minister for Icelandic affairs was appointed to the Danish cabinet in 1904. Full independence was granted in 1918 through the Danish-Icelandic Act of Union.  This was followed by the severance of all ties to Denmark with the declaration of the republic in 1944.\nBackground\nThrough the signing of the Old Covenant in 1262, following the civil strife of the Age of the Sturlungs, Icelanders had relinquished sovereignty to Haakon IV,  King of Norway.  Iceland remained under Norwegian kingship until 1380, when the death of Olav IV of Norway extinguished the Norwegian male royal line. Norway (and thus Iceland) then became part of the Kalmar Union with Sweden and Denmark, in which Denmark was the dominant power.\nWhile attempts have been made to find evidence of pre-19th century nationalist sentiments, not much comprehensive evidence has been found of nationalism as it is understood today.\nPortrait of Jónas Hallgrímsson, contributor to Fjölnir.\nNationalist movement\nAround the middle of the 19th century a new national consciousness was revived in Iceland, led by Danish-educated Icelandic intellectuals who had been inspired by romantic and nationalist ideas from continental Europe. The most notable of these were the so-called Fjölnismenn—poets and writers for the journal Fjölnir—  Brynjólfur Pétursson, Jónas Hallgrímsson, Konráð Gíslason and Tómas Sæmundsson. According to historian Guðmundur Hálfdanarson, the first calls for autonomy in Iceland were in the early 1830s. The demand for autonomy become dominant in Icelandic domestic discourse by the middle of the 19th century.\nMeanwhile, an independence movement developed under Jón Sigurðsson. In 1843, a royal decree re-established a national parliament, the Althing, as a consultative assembly. It claimed continuity with the Althing of the Icelandic Commonwealth, which had remained for centuries as a judicial body and had been abolished in 1800. The advocates of Icelandic independence pursued their aims peacefully, soliciting Danish officials via legal means.\nThe struggle for independence reached its height in 1851 when the Danes tried to pass new legislation which ignored the comments and requests made by the Icelanders. The Icelandic delegates, under the leadership of Jón Sigurðsson, passed their own proposal, much to the displeasure of the King's agent, who dissolved the meeting.  This caused Sigurðsson to rise up with his fellow delegates and utter the phrase Vér mótmælum allir (\"We all protest\").\nHistorian Guðmundur Hálfdanarson theorizes that Icelandic farmers allied with Icelandic liberal academics, such as Jón Sigurðsson, in the cause for national freedom because they wanted to decrease the influence of Danish liberalism on their own privileged position in Icelandic society. Icelandic farmers worried that various social restrictions in Icelandic society (for instance, on free labour and free migration) would be abolished. Historian Gunnar Karlsson expresses some support for this theory but notes that \"there is hardly sufficient evidence to conclude that social conservatism was the major force behind the nationalism of Icelandic farmers\". The failure of liberal nationalist parties (the Icelandic National Front), which stood for liberal, democratic and social-radical (not socialist) positions, similar to those of leftist parties in Norway and Denmark to take root and lead the Icelandic independence movement can be seen as evidence of this theory.\nThe historian Guðmundur Hálfdanarson ties Icelandic nationalism to the state of Danish politics in the first half of the 19th century. Hálfdanarson writes, \"the Danish composite or conglomerate monarchy – den danske helstat – lost its legitimacy not only among Icelandic intellectuals in the first half of the 19th century, but also among their Danish colleagues. Both groups considered the nation-state, unified on the basis of common culture and language, as the state form of the future while complex monarchies, mixing people of various cultural backgrounds under one government, were linked to absolutism and the reactionary politics of the past.\" However, many Danes were skeptical of Icelandic independence in the late 19th and early 20th centuries, characterizing the nation as too small to govern itself, too dependent on financial aid from Denmark, and worried that a successful Icelandic independence would give credence to German nationalist claims in Schleswig-Holstein.\nThe Icelandic independence movement was peaceful from its start in the post-Napoleonic period to the accomplishment of independence in 1944. Common explanations for the peaceful nature of Iceland's independence struggle include:\n* Iceland's distance to Copenhagen.\n* Iceland's homogeneous population.\n* The accommodating responses of Denmark to Icelandic demands.\n* The unwillingness of Denmark to respond violently, in part due to a respect for Icelandic culture but also an unwillingness to shoulder the costs of quelling the Icelandic independence movement.\n* The peaceful trends in the Nordic region after the Napoleonic Wars.\nHome rule and independence\nIn 1874, a thousand years after the first acknowledged settlement, Denmark granted Iceland home rule. By the end of the 19th century, the various efforts made on behalf of Iceland had their desired result. The constitution, written in 1874, was revised in 1903, and a minister for Icelandic affairs, residing in Reykjavík, was made responsible to the Althing. Hannes Hafstein served as the first minister of Iceland from 31 January 1904 until 31 March 1909.\nThe Act of Union, signed on 1 December 1918 by Icelandic and Danish authorities, recognized Iceland as a fully sovereign state (the Kingdom of Iceland), joined with Denmark in a personal union with the Danish king. Iceland established its own flag and asked Denmark to represent its foreign affairs and defense interests. The Act would be up for revision in 1940 and could be revoked three years later if agreement was not reached. The Act was approved by 92.6% of Icelandic voters (turnout at 43.8%) in a referendum on 19 October 1918. Historian Guðmundur Hálfdanarson interprets this low turnout as a sign that Icelandic voters did not consider the referendum of importance.\nConsistent with the transfer of sovereignty in 1918, the Supreme Court of Iceland was established in 1920, which meant that Icelanders were in charge of all three branches of the Icelandic government.\nUnion through the Danish king was finally abolished altogether in 1944 during the occupation of Denmark by Nazi Germany, when the Alþing declared the founding of the Republic of Iceland. A referendum on 20–23 May 1944 to abolish the union with Denmark was approved by 99.5% of voters in a 98.4% turnout.\nSee also\n* Kingdom of Iceland\n* Danish Realm\n* Constitution of Denmark\n* Greenlandic independence\n* Faroese independence\n* Norwegian independence movement\n* Icelandic sovereignty referendum, 1918\n* Icelandic constitutional referendum, 1944\n* Kitchenware Revolution in Iceland\nReferences"
    }
  ]
}