{
  "content": [
    {
      "type": "text",
      "text": "# Identity and Democracy\n\n| formalname  = Identity and Democracy Group\n| ideology    =\n| Right-wing populismEuroscepticism\n| Faction:\n| Identitarianism\n}}\n| position    =\n|\n|\n|\n|\n|}}}}}}\n| chairs      = Marco Zanni\n| website     = [https://web.archive.org/web/20240826130909/https://www.idgroup.eu/ www.idgroup.eu] (archive)\n}}\nIdentity and Democracy (ID; ) was a political group of the European Parliament during the Ninth European Parliament term, launched on 13 June 2019. It comprised far-right, right-wing populist, Eurosceptic and nationalist national parties from six European states. It was the successor to the Europe of Nations and Freedom group formed during the eighth term and almost all of its members merged into the Patriots for Europe group formed during the tenth term.\nHistory\n2019 European Parliament elections\nIn April 2019, the Danish People's Party and the Finns Party (at the time members of the European Conservatives and Reformists) announced their intention to form a new grouping with Alternative for Germany, formerly of the ECR, ENF and EFDD groups, and Italy's League following the 2019 elections. AfD spokesman Jörg Meuthen appeared alongside Northern League leader Matteo Salvini to formally announce the formation of the new European political alliance with the Finns Party and Danish People's Party which was provisionally named European Alliance for People and Nations.\nOn 12 June 2019, it was announced that the group would be named \"Identity and Democracy\" (ID), include Italy's League (LSP), the French National Rally (RN) and Alternative for Germany as member parties, and be a successor to the Europe of Nations and Freedom (ENF). The Finns Party also joined the group. Lega MEP Marco Zanni was announced as the new group's chairman. The group, composed at that time of 73 MEPs, was launched in Brussels by RN leader Marine Le Pen on 13 June 2019. It was expanded to include former ENF members Vlaams Belang and the Freedom Party of Austria, as well the new Freedom and Direct Democracy (SPD) party from the Czech Republic and the Conservative People's Party of Estonia (EKRE). Ahead of the 2019 European Parliament elections, the group held joint rallies in different European cities and developed coordinated campaign materials, including joint election videos and shared social media platforms.\nThe Dutch Party for Freedom (PVV) failed to secure any seats at the election; however, it gained one in the post-Brexit apportionment of seats. Before Brexit occurred, Party leader Geert Wilders stated his intention to align the PVV with ID, provided that the post-Brexit apportionment was confirmed by the European Council. PVV MEP Marcel de Graaff subsequently took the seat, but in 2022 defected to the Forum for Democracy, citing his support for the FvD's policies against the COVID-19 vaccine. The FvD accordingly changed its affiliation from the ECR group to Identity and Democracy.\nIn 2023, the FvD was suspended from the group after de Graaf shared messages on Twitter supportive of Putin following the Russian invasion of Ukraine and later quit the group citing difference in views on the matter.\nThe group's political platform is defined by Euroscepticism, nativism, and opposition to globalization. Its primary objective is to resist uncontrolled migration to the European Union and to dismantle the EU’s supranational framework, advocating instead for its transformation into an intergovernmental organization composed of sovereign nation-states.\nAlthough political commentators have noted the group contains members who have called for Europe to open up relations with Putin's government, the group has taken a pro-Ukraine stance and voted in support of a motion in the European Parliament to condemn \"Russian aggression against Ukraine\" following the Russian invasion of the country.\nIn April 2023, the Finns Party changed membership to the European Conservatives and Reformists group citing their change in policy to support NATO membership as the reason for the move.\n2024 European Parliament elections\nAhead of the 2024 European Parliament election, AfD lead candidate Maximilian Krah made controversial statements on the Waffen-SS in an interview which was met with anger within the group. In response, National Rally spokespeople Jordan Bardella and Caroline Parmentier announced they would part ways with Alternative for Germany after the election and not include the AfD in the group due to Krah's remarks and allegations of Chinese espionage influence on the party. The League's leader Matteo Salvini and the Czech Freedom and Direct Democracy subsequently backed the position taken by the National Rally, with both parties saying they would terminate collaboration with the AfD after the election. Vlaams Belang criticized Krah's statements with VB MEP Gerolf Annemans calling Krah \"increasingly problematic\" but declined to immediately expel and cut cooperation with AfD, instead arguing that they would wait until after the election before making a decision. The Danish People's Party issued an ultimatum that the AfD could only remain in the ID group on the condition of Krah's expulsion with MEP Anders Vistisen stating that the AfD should purge extremist elements if the two parties were to keep working together. The Portuguese Chega, a member of the ID Party, described the RN’s decision as a “game changer” and suggested it would now consider joining the European Conservatives and Reformists group or a new merged European Parliament group. The Estonian EKRE and the Austrian FPÖ supported removing Krah but opposed the expulsion of the entire AfD faction. After an internal meeting and vote, the Identity and Democracy board subsequently voted in favour of ejecting the AfD, with group leader Marco Zanni citing Krah's interview, as well as reports of Chinese and Russian influence on the AfD. The AfD consequently moved to non-inscrits. Following the decision, the AfD said that Krah would not be permitted to sit with the AfD faction in the European Parliament after the election and that they would negotiate to rejoin Identity and Democracy. However, AfD failed in a bid to rejoin, with ID leaders making the decision not to re-admit the party.\nOn 28 June, Freedom and Direct Democracy announced it would leave the group to form a new group called \"Europe of Sovereign Nations\", citing disagreements with other ID members on the European Green Deal, immigration, censorship and Ukraine. This new group is described as being led by the AfD.\nOn 30 June, the Freedom Party of Austria also announced it would leave ID to form a new group called \"Patriots for Europe\", alongside Fidesz and ANO 2011. Shortly after, Chega, a member of the ID Party, also announced it would join \"Patriots for Europe\" instead of the ID group. The Dutch Party for Freedom's leader, Geert Wilders, also announced his party would join the new group, followed by the Danish People's Party and Vlaams Belang, which both said they would also join. The League stated that it was strongly considering joining, while the National Rally entered \"advanced talks\" to discuss joining.\nOn 8 July 2024, the League and the National Rally also left the group to join Patriots for Europe.\n2025 EPPO probe\nIn July 2025 a leaked internal parlamentary audit suggested far-right parties may have spent millions in EU funds improperly. An investigation into alleged misuse of funds by – meanwhile defunct – Identity and Democracy was launched by the European Public Prosecutor’s Office.\nIdeology\nThe group lists its core priorities as protecting European cultural heritage and the sovereignty of European nations, creating jobs and growth, increasing security, stopping illegal immigration, regulating legal immigration, fighting EU bureaucracy and preventing what it describes as the potential Islamisation of Europe. Identity and Democracy also opposes the possible accession of Turkey to the European Union. The group calls for a Europe based on cooperation and further reforms of the EU through \"more transparency and accountability\" at Brussels, but rejects any further evolution towards a European Superstate. Political commentators have variously described Identity and Democracy as nationalist, right-wing populist, anti-immigrant, and Eurosceptic, although the group emphasises itself as sovereigntist as opposed to \"anti-European\".\nMEPs\n9th European Parliament\n{| class=\"wikitable sortable\" style=\"font-size:90%\"\n! State\n! National party\n! colspan=2 |\n! MEPs\n|-\n|\n| Freedom Party of Austria (FPÖ)\n|\n| ID Party\n| }}\n|-\n|\n| Flemish Interest (VB)\n|\n| ID Party\n| }}\n|-\n|\n| Freedom and Direct Democracy (SPD)\n|\n| ID Party\n| }}\n|-\n|\n| Danish People's Party (DF)\n|\n| None\n| }}\n|-\n|\n| Conservative People's Party of Estonia (EKRE)\n|\n| ID Party\n| }}\n|-\n|\n| National Rally (RN)\n|\n| ID Party\n| }}\n|-\n|\n| League\n|\n| ID Party\n| }}\n|-\n!\n! colspan=3 style=\"text-align:right\" | Total\n! }}\n|}\nFormer members\n{| class=\"wikitable sortable\" style=\"font-size:90%\"\n! State\n! National party\n! colspan=2 |\n! colspan=2 | New group\n! MEPs\n|-\n|\n| Finns Party\n|\n| None\n|\n| ECR\n| }}\n|-\n|\n| Alternative for Germany (AfD)\n|\n| ID Party\n|\n| NI\n| }}\n|-\n|\n| Forum for DemocracyForum voor Democratie (FvD)\n|\n| None\n|\n| NI\n| }}\n|}\nOrganization\nPresident\n{|class=\"wikitable\" style=\"text-align:center\"\n!colspan=2|President\n!Took office\n!Left office\n!Country(Constituency)\n!Party\n|-\n|Marco Zanni\n|\n|2 July2019\n|8 July2024\n|(North-West)\n|Lega\n|}\nBureau\nGroup bureau during the 9th European Parliament.\n{| class=\"wikitable\"\n|-\n! style=\"width:150px;\"| Position\n! style=\"width:150px;\"| Name\n! style=\"width:150px;\"| Country\n! style=\"width:150px;\"| Party\n|-\n! President\n| Marco Zanni\n| Italy\n| Lega\n|-\n! Vice-President\n| Jordan Bardella\n| France\n| National Rally\n|}\nReferences\nExternal links\n*"
    }
  ]
}