{
  "content": [
    {
      "type": "text",
      "text": "# IEEE Donald G. Fink Prize Paper Award\n\n}}\nThe IEEE Donald G. Fink Prize Paper Award was established in 1979 by the board of directors of the Institute of Electrical and Electronics Engineers (IEEE) in honor of Donald G. Fink. He was a past president of the Institute of Radio Engineers (IRE), and the first general manager and executive director of the IEEE. Recipients of this award received a certificate and an honorarium. The award was presented annually since 1981 and discontinued in 2016.\nPurpose\nThis award was given for \"the most outstanding survey, review, or tutorial paper published in the IEEE Transactions, Journals, Magazines, or in the Proceedings of the IEEE between 1 January and 31 December of the preceding year\". The award recipient was selected from the nominees by IEEE's Prize Papers/Scholarship Awards Committee and Awards Board.\nRecipients\nThe following people received the IEEE Donald G. Fink Prize Paper Award:\n* 2011: Andreas F. Molisch, Larry J. Greenstein and Mansoor Shafi\n* 2010: John W. Arthur\n* 2009: Daniel J. Costello  and G. David Forney, Jr.\n* 2008: Yann Frauel, Thomas J. Naughton, Osamu Matoba, Enrique Tajahuerce and Bahram Javidi\n* 2007: Michael Shur and Arturas Zukauskas\n* 2006: Suhas N. Diggavi, Naofal Al-Dhahir, A. Stamoulis and A. R. Calderbank\n* 2005: Oliver Brand, Christoph Hagleitner, Andreas Hierlemann and Henry Baltes\n* 2004: Alan S. Willsky\n* 2003: Sunil R. Das, C. V. Ramamoorthy, Mansour H. Assaf, Emil M. Petriu and Wen-Ben Jone\n* 2002: Ted Painter and  Andreas S. Spanias\n* 2001: Xin Yao\n* 2000: Ezio Biglieri, John Proakis and Shlomo Shamai\n* 1999: Richard P. Wildes\n* 1998: Francis T. S. Yu and Don A. Gregory\n* 1997: Asad A. Abidi\n* 1996: Ali H. Sayed and Thomas Kailath\n* 1995: Nikil Jayant, James D. Johnston and Robert J. Safranek\n* 1994: Andrew P. Sage\n* 1993: Pravas R. Mahapatra and Dusan S. Zrni\n* 1992: Anthony Ephremides and Sergio Verdú\n* 1991: Tadao Murata\n* 1990: G. David Forney, Jr.\n* 1989: Karl Johan Åström\n* 1988: Raymond L. Murray\n* 1987: Shahid U. H. Qureshi\n* 1986: Thomas H. Johnson\n* 1985: Arnold Reisman\n* 1984: Enders A. Robinson; Robert A. Scholtz (each for their own paper)\n* 1983: Anil K. Jain\n* 1982: Arun N. Netravali and John O. Limb\n* 1981: Whitfield Diffie and Martin E. Hellman\n}}\nReferences"
    }
  ]
}