{
  "content": [
    {
      "type": "text",
      "text": "# Illinois People Over Parking Act\n\nThe Illinois People Over Parking Act is a proposed 2025 Illinois bill which would prohibit local governments from enforcing parking minimums on any development project within one-half mile of a public transportation hub or one-eighth mile of a public transportation corridor. It was passed as part of Illinois Senate Bill 2111 (SB 2111), which made the following other changes:\n* renamed the Regional Transportation Authority as the Northern Illinois Transportation Authority\n* creates the Interagency Coordinating Committee on Transit Innovation, Integration, and Reform Act\n* secured funding to cover funding gaps for the RTA, Chicago Transit Agency, Metra commuter rail and Pace Suburban Bus revenue sources that currently feed the state's Road Fund ($200 million) and an increased sales tax targeted to the Chicago area ($860 million)\n* raising the existing Regional Transportation Authority sales tax by 0.25 percentage points, to 1% in Lake, McHenry, Kane, DuPage and Will counties and 1.25% in Cook County\n* increases tolls by 45 cents on toll roads in northern Illinois (increasing by inflation annually) to create a new capital program for tollway projects\nEarlier text which would have legalized the Idaho stop was removed. House proposals to create other taxes on entertainment and billionaires’ investments in order to fund mass transit were opposed by Governor JB Pritzker. The bill was passed in October 2025 due to the failure to pass a transportation funding bill earlier in the 2025 session.\nThe House passed SB 2111 72-33 on October 31, 2025, followed in the same day by a 36-21 concurrence in the Senate. If signed by Pritzker, Illinois would become the fourth U.S. state to enact state preemptions against parking minimum mandates, following Oregon (by administrative rule), California (first by statute) and Colorado.\nReferences\nExternal links\n* [https://www.ilga.gov/legislation/BillStatus?GAID=18&DocNum=2111&DocTypeID=SB&LegId=161644&SessionID=114 Text of the bill]"
    }
  ]
}