{
  "content": [
    {
      "type": "text",
      "text": "# Illtyd (electoral ward)\n\nIlltyd is an electoral ward in Barry, Vale of Glamorgan, Wales. It is represented by councillors on Barry Town Council and the Vale of Glamorgan Council.\nDescription\nThe Illtyd ward covers a residential part of Barry to the west of the town. Barry College campus is in the ward as well as several schools, including the Welsh-medium Ysgol Gymraeg Bro Morgannwg. The Barry ward of Baruc lies to the south, Dyfan lies to the northeast. The Vale ward of Rhoose lies to the west.\nAccording to the 2011 census the population of the ward was 8,201, with 6,433 of voting age.\nTown Council elections\nThe Court ward elects three councillors to Barry Town Council.\nCounty Council 1995-date\nSince 1995 Illtyd has been a county ward, electing three county councillors to Vale of Glamorgan Council unitary authority. At the 1995 and 2012 elections all three seats were won by the Labour Party, while in 1999, 2004 and 2008 all three seats were won by the Conservative Party.\nOn 4 May 2017 the Illtyd ward was regained by the Conservatives, as part of a wider success across Barry and the Vale. The three seats were won by Janice Charles, Tony Hampton and Marguerita Wright.\nIn December 2018 one of the Conservative councillors, a former cabinet member of the council, was suspended by the Conservative Party after being charged with 10 historical sexual offences.\nA by-election took place on 11 September 2025, following the death of long-standing Labour councillor, Howard Hamilton. The election was won by Reform UK candidate, Brandon Dodd, the first Reform councillor on Vale of Glamorgan Council. The ward was subsequently represented by Dodd for Reform, Naomi Marshallsea for Labour and Janice Charles for the Conservatives.\nBorough Council 1973-1996\nIlltyd was also an electoral ward to the Vale of Glamorgan Borough Council between 1973 and 1996, electing three councillors. In 1973 it elected two Labour and one Independent councillor, but subsequently elected a mix of Labour and Conservative representatives.\nSee also\n* Cadoc (electoral ward)\n* Castleland\nReferences"
    }
  ]
}