{
  "content": [
    {
      "type": "text",
      "text": "# Illuminati in popular culture\n\n, founder of the Order of the Illuminati.]]\nThe Illuminati is a secret society founded by Adam Weishaupt in Bavaria in 1776. They have been referred to in popular culture, in books and comics, television and films, and games. A number of novelists, playwrights and composers are alleged to have been Illuminati members and to have reflected this in their work. Early conspiracy theories surrounding the Illuminati have inspired various creative works, and continue to do so.\nBooks and comics\n* Gothic literature had a no particular interest in the theme of the Illuminati. The Cambridge Companion to Gothic Fiction states that readers had a \"scandalous vogue for German tales of the Illuminati.\" The Illuminati have a role in Horrid Mysteries, as in Montague Summers' introduction to a later reprint of it. The Illuminati also turn up in two spoofs of the gothic genre, which both also reference Horrid Mysteries, Northanger Abbey by Jane Austen and Nightmare Abbey by Thomas Love Peacock.\n* A number of writers have pointed out Mary Shelley's familiarity with the early anti-Illuminati text, Memoirs Illustrating the History of Jacobinism (1797–98), due to Percy Bysshe Shelley's enthusiasm for it. They describe the Memoirs influence in Frankenstein, and point to Frankenstein's monster as an amalgam of Shelley's Illuminati-influenced ideas as well as of the Illuminati itself, with the monster being created in Ingolstadt, where the Illuminati had been formed.\n* The Illuminatus! Trilogy by Robert Shea and Robert Anton Wilson is a three-book science fiction series published in the 1970s, which is regarded as a cult classic. An incomplete comic book version of the Illuminatus! was produced and published by Eye-n-Apple Productions and Rip Off Press between 1987 and 1991. A nine-hour theatrical adaptation was produced by Ken Campbell.\n* Robert Anton Wilson also published Cosmic Trigger I: The Final Secret of the Illuminati in 1977, The Illuminati Papers in 1980, Masks of the Illuminati in 1981, and The Historical Illuminatus Chronicles'' in the 1980s and 1991.\n* Umberto Eco's ''Foucault's Pendulum'' is a labyrinthine 1988 novel about all sorts of secret societies, including the Illuminati and the Rosicrucians.\n* Fallen Angels (1984) by Bernard Cornwell (under the pseudonym Susannah Kells) is a love story set in the shadow of the Paris revolutionary guillotine and the grounds of Lazender Castle in England. The Illuminati plot to bring revolution to England is a central thread.\n* Angels & Demons (German title: Illuminati), Dan Brown's 2000 precursor to 2003's The Da Vinci Code, is about an apparent Illuminati order plot to destroy its enemy the Catholic Church by using antimatter to blow up the Vatican while Papal elections are being held. In this novel the Illuminati movement was founded by Galileo Galilei, and others, as an enlightened reaction to persecution by the Catholic Church. They were initially based in Italy, but fled after four key members were executed by the Vatican. Apparently there are four churches to them in Rome, each representing one of the four elements. In fact, the Illuminati are indeed defunct and the events of the book are orchestrated as part of an elaborate scheme by its central antagonist. This is also the plot of the film of the same name. Simon Cox, writer of Cracking the Davinci Code, also wrote the book Illuminating Angels and Demons, in which he explains the facts behind the pagan signs and secret societies in Angels & Demons.\n* In Michael Romkey's vampire novels, the Illuminati are an order of benevolent vampires, consisting of many famous figures throughout history (Beethoven, Mozart, etc.). The main character, David Parker, joins the order, but later leaves.\n* In Larry Burkett's book The Illuminati, \"The Society\" seeks world power.\n* In War and Peace by Leo Tolstoy, Count Pierre Bezukhov, a Freemason, is accused of attempting to introduce the ideals of Illuminism to his lodge.\n*In Kazue Kato's manga Blue Exorcist, the Illuminati are a secret organization that oppose the True Cross Order (an organization of exorcists that specializes in killing demons) and, by extension, the Vatican itself, which controls the Order. Their goal is to merge the world of humans and world of demons so that Satan, the king of all demons, can rule over the new world order.\n*The Illuminati are a fictional group of superheroes appearing in American comic books published by Marvel Comics. The characters joined forces and secretly work behind the scenes. The Illuminati was established to exist (via story retcon) in their first published appearance in New Avengers #7 (July 2005), written by Brian Michael Bendis. Their history was discussed in the special New Avengers: Illuminati (May 2006). The group was revealed to have been formed very shortly after the Kree-Skrull War.\n*Philip José Farmer, in his books  Tarzan Alive (1972), Doc Savage: His Apocalyptic Life (1973) and The Other Log of Phileas Fogg (1973), linked the fictional characters to various Illuminati, plots and conspiracy theories.\nTelevision and film\n*In the cartoon Gargoyles, the Illuminati was founded by followers of King Arthur and has 666 seats ranked 1 through 36; the founders and senior members have rejuvenation drugs so they can join Arthur in bringing about a new kingdom. Detective Bluestone believed they are behind most governments and is inducted into the organization for his impressive willpower. David Xanatos, Thailog and John Castaway are Rank 36.\n*In Simon West's 2001 film Lara Croft: Tomb Raider, a group of high-society villains call themselves Illuminati, developing a plan to rule the world. Along with Lara Croft's father, they claim that the Illuminati have existed for four millennia for this purpose.\n*The 2009 film adaptation of Angels & Demons initially presents the Illuminati as the antagonists; conspiracy theorists led by Mark Dice announced plans to protest the movie for portraying the secret society as fictional.\n*In Prithviraj Sukumaran's 2019 Malayalam film Lucifer, Mohanlal's character Stephen Nedumpally / Khureshi-Ab'raam is said to be a member of the Illuminati. Many signs and symbols of the Illuminati are used throughout the film. Following the blockbuster success of the movie, director Prithviraj Sukumaran announced that he would be doing a sequel for the movie, which is titled L2: Empuraan and stars Mohanlal, reprising his role from the original.\n*In the 2021 Netflix animated series Inside Job, the Illuminati leadership is shown to consist mostly of figures from the world of media and entertainment, namely Lin-Manuel Miranda, Beyoncé, Oprah Winfrey and Jay-Z.\nGames\n* Several games from Steve Jackson Games are based on the Mythos: the card game Illuminati and its trading card game reincarnation Illuminati: New World Order, and the role-playing game GURPS Illuminati.\n* In the MMORPG The Secret World, the Illuminati is one of the three playable factions.\n*In the Street Fighter video game series, the Illuminati (also called the Secret Society) is a shady organisation led by Gill, who wishes to find a utopia for all humans. They are most prominent in the Street Fighter III games as a crime organisation similar to Shadaloo.\n*The Illuminati frequently appears in the cyberpunk Role-playing video game Deus Ex game series as a major faction.\n**In the first Deus Ex, the Illuminati was almost destroyed in an inside coup by their own research division Majestic 12. The events of the game are part of a power struggle between the Illuminati, Majestic-12 and other factions attempting to secretly take over the world.\n**In Deus Ex: Invisible War, the Illuminati was successfully revived after \"the Collapse\", an event which saw the destruction of the world telecommunication infrastructures. The Illuminati created and secretly controls two competing factions that rose in the post-collapse world: the hyper-capitalist World Trade Organization and a transdenominational church called \"The Order Church\", in order to better control society through social division.\n**In Deus Ex: Human Revolution, the protagonist Adam Jensen discovers the Illuminati were behind many of the game's events, attempting to control the spread of \"augmentations\", advanced artificial organs capable of greatly improving and enhancing the human body's performance.\nMusic\nMany fans of modern African-American music, especially hip hop music, believe that an Illuminati conspiracy is active in its production and marketing. The methods and motives of the conspiracy, and its relation to the Bavarian order, are matters of speculation that change with each telling. Some artists, such as Jay-Z, Katy Perry, Beyoncé, Rihanna, and Kanye West, are believed to be agents of the conspiracy who leave hints to their listeners through lyrics, Eye of Providence handsigns or other signals. Conspiracy literature involving the Illuminati has been cited in the lyrics of several hip hop artists. Milton William Cooper's Behold a Pale Horse is one such work that both Nas and Public Enemy have made reference to. Other such conspiracy books circulate in African-American communities, where both artists and listeners encounter them. Aside from this, the \"Illuminati\" are invoked to explain why some artists become rich and famous, some die suddenly, and others go unnoticed.\nSee also\n* Conspiracy theories\nReferences"
    }
  ]
}