{
  "content": [
    {
      "type": "text",
      "text": "# Impact Wrestling Rebellion (2022)\n\nThe 2022 Rebellion was a professional wrestling pay-per-view (PPV) event produced by Impact Wrestling. It took place on April 23, 2022, at the Majed J. Nesheiwat Convention Center in Poughkeepsie, New York. It was the fourth event under the Rebellion chronology.\n10 matches were contested at the event, including two on the pre-show and one taped as a digital exclusive. In the main event, Josh Alexander defeated Moose to win the Impact World Championship. In other prominent matches, Tomohiro Ishii defeated Jonah, Ace Austin defeated Mike Bailey and defending champion Trey Miguel in a three-way match to win the Impact X Division Championship, and Taya Valkyrie defeated Deonna Purrazzo to win the AAA Reina de Reinas Championship.\nProduction\nBackground\nin Poughkeepsie, New York.]]\nRebellion is a professional wrestling event produced by Impact Wrestling. It is annually held during the month of April, and the event was first held in 2019. At Hard To Kill, Impact Wrestling announced Rebellion would take place in on April 23, 2022, at the Majed J. Nesheiwat Convention Center in Poughkeepsie, New York.\nStorylines\nThe event featured several professional wrestling matches that involved different wrestlers from pre-existing scripted feuds, plots, and storylines. Wrestlers portrayed heroes, villains, or less distinguishable characters in scripted events that build tension and culminate in a wrestling match or series of matches. Storylines were produced on Impact's weekly television program.\nAt Bound for Glory, in October 2021, Josh Alexander defeated Christian Cage to win the Impact World Championship. While Alexander was celebrating with his family, Moose, who earlier won the Call Your Shot Gauntlet match, ambushed him and invoked his opportunity, immediately capturing the title. In the following months, Alexander wanted revenge on Moose, but was repeatedly denied by Impact Executive Vice President, Scott D'Amore.\nOn the February 10, 2022 episode of Impact!, Alexander continued to attack Big Kon after defeating him. Security would try to intervene, but Alexander would push them away, and he even pushed D'Amore. As a result, D'Amore would send Alexander home, as a kayfabe explanation for Alexander's contract and work visa expiring. At Sacrifice, after Moose retained the Impact World Championship against Heath, Alexander returned to attack Moose, and announced that he had signed both a new multi-year Impact Wrestling contract, and a contract to face Moose for his World title in the main event of Rebellion.\nOn March 8, Impact Wrestling announced that Trey Miguel will defend the Impact X Division Championship in a three-way match at Rebellion, with two other three-way matches to take place on following episodes of Impact! to determine his challengers. Ace Austin and Mike Bailey qualified for the three-way match by defeating Crazzy Steve and John Skyler, and Laredo Kid and Willie Mack, respectively.\nOn the February 10, 2022 episode of Impact!, after Josh Alexander was sent home by Scott D'Amore, Team Impact (Chris Sabin, Eddie Edwards, Rich Swann, and Rhino) elected ROH World Champion Jonathan Gresham to replace Alexander in their match against Honor No More (Matt Taven, Mike Bennett, Kenny King, PCO, and Vincent) at No Surrender. At No Surrender, Edwards would ultimately betray Team Impact and allow Honor No More to win; he was later revealed as the faction's leader on the following episode of Impact!. On March 25, it was announced that Gresham will face off with Edwards at Rebellion. On April 23, it was announced that Gresham was removed from the match due to an injury and was replaced by Chris Bey.\nAt Sacrifice, Violent By Design (Eric Young and Joe Doering) defeated The Good Brothers (Doc Gallows and Karl Anderson) to win the Impact World Tag Team Championship. On the March 17 episode of Impact!, The Good Brothers confronted Scott D'Amore about a rematch, which they received in the form of a lumberjack match for the following week. In addition, D'Amore announced that whoever would be champion after that match would defend against their opponents, as well as six other teams, in an Eight-Team Elimination Challenge at Rebellion. VBD would retain the titles due to interference by Honor No More.\nOn the March 31 episode of Impact!, Rosemary won a battle royal to become the number one contender to the Impact Knockouts World Championship, and will face champion Tasha Steelz at Rebellion.\nAt Multiverse of Matches, Deonna Purrazzo successfully defended the AAA Reina de Reinas Championship against Faby Apache—the woman she beat for the title—in her latest \"Champ-Champ Open Challenge\". However, Purrazzo's victory would be interrupted by Taya Valkyrie, making her return to Impact after over a year and challenging Purrazzo for the title at Rebellion.\nAfter Honor No More defeated Team Impact at No Surrender, Steve Maclin began to target members of the Impact roster who may have doubted his loyalty to the company. After defeating Eddie Edwards by disqualification, Maclin picked up wins over Rhino and Heath before being beaten by Alex Shelley, after help from Shelley's tag team partner Chris Sabin. At Multiverse of Matches, Maclin attacked Sabin after the latter had beaten Jay White, but would soon fall victim to a low blow by White. On April 7, Impact announced a three-way match between Maclin, Sabin, and White for Rebellion.\nEvent\n{| align=\"right\" class=\"wikitable\" style=\"border:1px; font-size:90%; margin-left:1em;\"\n! width=\"250\" colspan=\"2\" |Other on-screen personnel\n|-\n| rowspan=\"2\" |Commentators\n|Tom Hannifan\n|-\n|Matthew Rehwoldt\n|-\n| rowspan=\"1\" |Ring announcer\n|David Penzer\n|-\n| rowspan=\"3\" |Referees\n|Brian Hebner\n|-\n|Brandon Tolle\n|-\n|Daniel Spencer\n|-\n|rowspan=\"1\" |Interviewer\n|Gia Miller\n|}\nCountdown to Rebellion\nBefore the event went live on pay-per-view, Kenny King defeated Crazzy Steve which was aired as an Impact Digital Exclusive on April 26.\nDuring the Rebellion pre-show, Eddie Edwards faced Chris Bey. In the end, Edwards performed a fisherman driver on Bey to win the match.\nAlso on the pre-show, The Influence (Madison Rayne and Tenille Dashwood) successfully defended the Knockouts World Tag Team Championship against The IInspiration (Cassie Lee and Jessie McKay), after performing a double front facelock drop on McKay.\nPreliminary matches\nThe actual pay-per-view started with three-way match Chris Sabin, Jay White, and Steve Maclin. After Sabin performed a Cradle Shock on White, Maclin rolled Sabin into a pinfall to steal the victory.\nNext, Deonna Purrazzo defended the AAA Reina de Reinas Championship against Taya Valkyrie. In the end, Valkyrie performed the Road to Valhalla to win the title for the fourth time in her career.\nAfter that, Trey Miguel defended the X Division Championship against Ace Austin and Mike Bailey in a three-way match. During the match, Miguel performed a diving meteora into a pinfall, however, Austin pulled the referee before he could count to three. In the end, Austin performed The Fold on Miguel to pin him and win the title for the sixth time in his career.\nAftermath\nOn April 27, The IInspiration announced that they are indefinitely stepping away from in-ring action in order to pursue other opportunities, thus leaving Impact.\nResults\n|results=\n|match1 = Kenny King defeated Crazzy Steve by pinfall\n|stip1  = Singles match\n|time1  = 4:22\n|note1  = dark\n|match2 = Eddie Edwards defeated Chris Bey by pinfall\n|stip2  = Singles match\n|time2  = 9:20\n|note2  = pre\n|match3 = The Influence (Madison Rayne and Tenille Dashwood) (c) defeated The IInspiration (Cassie Lee and Jessie McKay) by pinfall\n|stip3  = Tag team match for the Impact Knockouts World Tag Team Championship\n|time3  = 6:35\n|note3  = pre\n|match4 = Steve Maclin defeated Chris Sabin and Jay White by pinfall\n|stip4  = Three-way match\n|time4  = 11:50\n|match5 = Taya Valkyrie defeated Deonna Purrazzo (c) by pinfall\n|stip5  = Singles match for the AAA Reina de Reinas Championship\n|time5  = 9:00\n|match6 = Ace Austin defeated Trey Miguel (c) and Mike Bailey by pinfall\n|stip6  = Three-way match for the Impact X Division Championship\n|time6  = 10:20\n|match7 = Tomohiro Ishii defeated Jonah by pinfall\n|stip7  = Singles match\n|time7  = 14:35\n|match8 = Violent By Design (Eric Young and Joe Doering) (with Deaner) (c) won by last eliminating Heath and Rhino\n|stip8  = Eight-Team Elimination Challenge for the Impact World Tag Team Championship\n|time8  = 32:50\n|match9 = Tasha Steelz (c) (with Savannah Evans) defeated Rosemary (with Havok) by pinfall\n|stip9  = Singles match for the Impact Knockouts World Championship\n|time9  = 12:00\n|match10 = Josh Alexander defeated Moose (c) by pinfall\n|stip10  = Singles match for the Impact World Championship\n|time10  = 23:55\n}}\nTag Team Elimination Challenge\n{| class=\"wikitable sortable\"\n!Eliminated\n!Team\n!Entered\n!Eliminated by\n!Method\n!Time\n|-\n|\n|Jordynne Grace and W. Morrissey\n|2\n|The Major Players\n|Pinfall\n| –\n|-\n|\n|The Major Players (Brian Myers and Matt Cardona)\n|1\n|The Good Brothers\n|Pinfall\n| –\n|-\n|\n|Johnny Swinger and Zicky Dice\n|4\n|The Good Brothers\n|Pinfall\n| –\n|-\n|\n|Rich Swann and Willie Mack\n|5\n|The Good Brothers\n|Pinfall\n| –\n|-\n|\n|The Good Brothers (Doc Gallows and Karl Anderson)\n|3\n|Honor No More\n|Pinfall\n| –\n|-\n|\n|Honor No More (Matt Taven and Mike Bennett)\n|6\n|Heath and Rhino\n|Pinfall\n| –\n|-\n|\n|Heath and Rhino\n|7\n|Violent By Design\n|Pinfall\n|rowspan=2|32:50\n|-\n|\n|Violent By Design (Eric Young and Joe Doering) (c)\n|8\n| colspan=\"2\"\n|}\nNotes\nReferences\nExternal links\n*"
    }
  ]
}