{
  "content": [
    {
      "type": "text",
      "text": "# Imperial Army of the Holy Roman Emperor\n\nin the War of the Polish Succession before Philippsburg in 1734 (The Young Savoys – contemporary Gudenus manuscript)]]\nImperial Army (Latin: Exercitus Imperatoris, ) or Imperial troops (Kaiserliche Truppen or Kaiserliche) was a name used for several centuries, especially to describe soldiers recruited for, and under the command of the Holy Roman Emperor themself, during the early modern period. The Imperial Army of the Emperor should not be confused with the Army of the Holy Roman Empire (Exercitus Imperii (Romani), Reichsarmee, Armée du Saint-Empire), which could only be deployed with the consent of the Imperial Diet. Imperial units effectively became a standing army of troops under the Habsburg Emperors from the House of Austria, which is why they were also increasingly described in the 18th century as \"Austrians\", although its troops were recruited not just from the Archduchy of Austria but from all over the Holy Roman Empire.\nThe Empire and the Habsburg monarchy\nThe Habsburg monarchy supplied almost all the Holy Roman Emperors during the Early Modern Period. Their title of Emperor was one that was bound not so much to a territory, but to a person.\nAccordingly, the Imperial Army was a force established by the Emperor, with privileges in the whole of the Holy Roman Empire. The Emperor was not permitted to raise troops in the electoral states, but had inter alia the right to recruit soldiers in the imperial cities and in all other territories.\nIndependent of the Emperor's ability to raise his own army, the Imperial Diet could establish the Army of the Holy Roman Empire, the \"troops of the empire\" in the event of a Reichskrieg.\nBavarian period and \"Austrianisation\"\n. Musée de l'Armée, Paris, taken in 2010]]\nDuring the Imperial interregnum of 17401742, Habsburg troops no longer formed the army for the Emperor, but that of the Queen of Hungary. During the War of the Austrian Succession, Queen Maria Theresa and the Austrian House of Habsburg, fought for their survival within the European system of power. She initially lost her battle for the Imperial crown for her husband, Francis Stephen of Lorraine. With the acquisition of the crown by Charles VII of the Bavarian House of Wittelsbach, units from the Electorate of Bavaria formed the Imperial Army for a short time, from 1742 to 1745. A year after the loss of the imperial crown, the Archduchess of Austria and Queen of Hungary directed her troops to wear green instead of gold for officers' sashes and for the regimental flags. Gold has always been considered an imperial attribute.\nAfter the 1745 imperial election of Maria Theresa's husband, Francis I, the Habsburg troops were given back their Imperial status. Although Maria Theresa took the title of empress, she put no value on her coronation as empress. This was reflected in the title of her army, which was now called \"Roman Imperial-Royal\" (römisch kaiserlich-königlich). The colloquial, shorter term, \"Austrian\", established itself during the Seven Years' War (17561763) and subsequent conflicts in the War of Bavarian Succession (1778/1779), the Russo-Austrian war against the Turks (17871792) and the Napoleonic Wars.\nPrussian and Protestant journalists increasingly lost interest in a universal Reich concept, which, for a long time, had earned the imperial troops their special position. Even Maria Theresa's son, Emperor Joseph II, with his centralizing reforms that promoted an Austrian territorial state, encouraged Imperial politics less and less. In 1804, the Austrian imperial crown was created. Only two years later, Francis II, Holy Roman Emperor dissolved the increasingly defunct Holy Roman Empire.\nOperations of the Habsburg Imperial Army\nDuring the Early Modern Period, the Imperial Army fought in all the wars affecting the Empire, usually allied with the Army of the Holy Roman Empire and other territorial forces. These include:\n* Italian Wars (14941559)\n* Long Turkish War (1593–1606)\n* Thirty Years' War (1618–1648)\n* Second Northern War (1655–1660)\n* Austro-Turkish War (1663–1664)\n* Scanian War (1674–1679)\n* Nine Years' War (1688–1697)\n* Great Turkish War (1683–1699)\n* War of the Spanish Succession (1701–1714)\n* Austro-Turkish War (1714–1718)\n* War of the Polish Succession (1732–1738)\n* Austro-Russian–Turkish War (1736–1739)\nGrowth of the Habsburg Imperial Army\nThe Thirty Years' War led to an unusually strong arming of the Emperor. In 1635, the Imperial Army reached a peak of 65 regiments of foot, with a nominal strength of 3,000 men each. During the course of the war, 532 regiments were formed and disbanded. In 1648 only 9 regiments of foot, 9 regiments of horse and a regiment of dragoons remained. The Army's paper strength in 1625 was 61,900 (16,600 cavalry), rising to 111,100 in 1626 (25,000 cavalry), 112,700 in 1627 (29,600 cavalry), 130,200 in 1628 (27,300 cavalry), 128,900 in 1629 (17,900 cavalry), and 150,900 in 1630 (21,000 cavalry). Due to disease and desertion, the amount of effectives available at any given time often deviated from paper strength; depending on the year, anywhere from 60 to 85 percent of paper strength was actually usable. The Imperial states opposing the Emperor fielded broadly similarly-sized forces, while other Imperial states were neutral. By the end of the war, the Imperial Army's effective strength had been reduced to 42,300. The Imperial Army figures do not include soldiers on the side of the Emperor who marched to war under their own princes; for example, at the end of the war, the 42,300 soldiers of the Imperial Army were supported by 35,500 soldiers from the Westphalian and Bavarian circles.\nGradually, a standing imperial army evolved as a result of the many wars. Of the 49 regiments raised for the Second Northern War, 23 remained in 1660. The 1760s saw 28 new regiments being formed, and the following decade saw a further 27.\nThe annual average strengths of the Emperor's military forces throughout mid 17th to early 18th century are as follows:\n* Austro-Turkish War, 1662–1664: 82,700 (51,000 Kaiserliche Armee, 31,700 Reichsarmee)\n* Franco-Dutch War, 1672–1679: 132,350 (65,840 Kaiserliche Armee, 66,510 Reichsarmee)\n* Great Turkish War, 1683–1689: 88,100 (70,000 Kaiserliche Armee, 18,100 Reichsarmee)\n* Nine Years War, 1688–1697: 127,410 (70,000 Kaiserliche Armee, 57,410 Reichsarmee)\n* War of the Spanish Succession, 1701–1714: 260,090 (126,000 Kaiserliche Armee, 134,090 Reichsarmee)\nThe Habsburgs were infrequently successful at convincing the rest of the Empire to shoulder the burden of the army. Their greatest success in this respect was during the War of the Spanish Succession. Total expenditure was 650 million florins across 1701–14, including the cost of the official contingents and additional auxiliaries provided by the imperial states, as well as their other directly incurred war expenditures. About 90 million of this (14% of the total) was covered by subsidies from the Empire's British and Dutch allies. The remainder was divided roughly one-third for the Habsburgs (187 million, 29% of the total) and two-thirds for the remaining imperial estates (373 million, 57% of the total). The Empire's overall effort exceeded Britain's military and naval expenditure by 237 million florins.\nUnits and formation\n* Grenz infantry\n* Pandur\n** Trenck's Pandurs\n* Seressaner\n* Serbian military\n** Serbian Militia (1686–1704)\n** Serbian Militia (1718–46)\n** Serbian Free Corps\nSee also\n* Kaiserlich (concept explanation)\n* Army of the Holy Roman Empire\n* Austrian Army during the French Revolutionary and Napoleonic Wars\n* Imperial Austrian Army (1806-1867)\nFor the period after 1867:\n* Armed Forces of Austria-Hungary\n* Austro-Hungarian Army\n* Common Army\nNotes\nReferences\nSources\n* War Archive (ed.): Österreichischer Erbfolgekrieg, 1740–1748. Nach den Feld-Acten und anderen authentischen Quellen bearbeitet in der kriegsgeschichtlichen Abteilung des K. und K. Kriegs-Archivs. Vol. 1. Seidel, Vienna, 1896.\n* Heeresgeschichtliches Museum Wien (ed.): Von Söldnerheeren zu UN-Truppen. Heerwesen und Kriege in Österreich und Polen vom 17. bis zum 20. Jahrhundert (= Acta Austro-Polonica. Bd. 3). Heeresgeschichtliches Museum, Vienna, 2011, .\n* Johann Christoph Allmayer-Beck, Erich Lessing: Die kaiserlichen Kriegsvölker. Von Maximilian I. bis Prinz Eugen. 1479–1718. Bertelsmann, Munich, 1978, .\n* Johann Christoph Allmayer-Beck: Das Heer unter dem Doppeladler. Habsburgs Armeen 1718–1848. Bertelsmann, Munich, 1981, .\n* .\n*\n*"
    }
  ]
}