{
  "content": [
    {
      "type": "text",
      "text": "# Imperial Commemorative Medal in Memory of the 100th Anniversary of the Great War, 1914–1918\n\nThe Imperial Commemorative Medal \"In Memory of the 100th Anniversary of the Great War, 1914–1918\" (Russian: Императорская медаль «В память 100-летия Великой войны 1914-1918 гг»), is a dynastic award instituted in 2015 by Grand Duchess Maria Vladimirovna of Russia, Head of the former Russian Imperial House.\nThe award is determined for those who have made a significant contribution to the preservation of the memory of the heroic feats performed by the peoples of Russia and of allied soldiers during the World War I of 1914–1918. Medals were issued in the number of 400 pieces. The medal may exceptionally be awarded in a silver class.\nDescription\n# Obverse: the Imperial Medal are depicted three soldiers setting off for battle under a banner bearing the image of Christ. On this side are also inscribed the words \"God is with us\" and on either side are inscribed dates \"1914\",” on the left, and “1918,” on the right side.\n# Reverse: the personal monogram of the Head of the Russian Imperial House, H.I.H. The Grand Duchess Maria of Russia with words \"Loyalty, Honor, and Self-Sacrifice are Immortal\" which are surrounded by a laurel wreath. The diameter of the medal is 32 millimeters. The ribbon for the medal combines the colors of the Imperial House of Romanoff and the colors of the Order of St. George.\nList of laureates\n(de jure)\n* Ekaterina Altabaeva (2016).\n* A.G. Sizenko, Tsaritsyno Genealogical Society (2015).\n* H. E. Nikolai Vasilievich Kutovoy, Metropolitan Panteleimon, Krasnoyarsk Eparchy (2017).\n* Tatyana Vokueva, Saint Petersburg (2019).\n* Dmitrij Borisov (2019).\n* Andrei Matveev (2019).\n* Valerij Kandalincov (2019).\n* Lilia Ramileva, Alfred Khasanovich Khalikov's Institute of Archeology of the Academy of Sciences of the Republic of Tatarstan (2019).\n* Abdullin Halim Minnullov, Alfred Khasanovich Khalikov's Institute of Archeology of the Academy of Sciences of the Republic of Tatarstan (2019).\n* H. E. Sergei Ivanovich Ivannikov, Metropolitan Sergius, Barnaul Eparchy. Special class in silver (2020).\n* Konstantin Vasilievich Yaroslavtsev, Biysk Museum of Local history (2020).\nReferences"
    }
  ]
}