{
  "content": [
    {
      "type": "text",
      "text": "# Implied warranty\n\nIn common law jurisdictions, an implied warranty is a contract law term for certain assurances that are presumed to be made in the sale of products or real property, due to the circumstances of the sale. These assurances are characterized as warranties regardless of whether the seller has expressly promised them orally or in writing. They include an implied warranty of fitness for a particular purpose, an implied warranty of merchantability for products, implied warranty of workmanlike quality for services, and an implied warranty of habitability for a home.\nThe warranty of merchantability is implied, unless expressly disclaimed by name, or the sale is identified with the phrase \"as is\" or \"with all faults\". To be \"merchantable\", the goods must reasonably conform to an ordinary buyer's expectations, i.e., they are what they say they are. For example, a fruit that looks and smells good but has hidden defects would violate the implied warranty of merchantability if its quality does not meet the standards for such fruit \"as passes ordinarily in the trade\". In Massachusetts consumer protection law, it is illegal to disclaim this warranty on household goods sold to consumers.\nThe warranty of fitness for a particular purpose is implied when a buyer relies upon the seller to select the goods to fit a specific request. For example, this warranty is violated when a buyer asks a mechanic to provide snow tires and receives tires that are unsafe to use in snow. This implied warranty can also be expressly disclaimed by name, thereby shifting the risk of unfitness back to the buyer.\nAnother implied warranty is the warranty of title, which implies that the seller of goods has the right to sell them (e.g., they are not stolen, or patent infringements, or already sold to someone else). Theoretically, this saves a buyer from having to \"pay twice\" for a product, if it is confiscated by the rightful owner, but only if the seller can be found and makes restitution.\nFitness for a particular purpose\nAn implied warranty of fitness for a particular purpose occurs if a seller knows or has reason to know of a particular purpose for which some item is being purchased by the buyer. The seller then guarantees that the item is fit for that particular purpose.\nInternational sales law\nIn international sales law, the obligation is found in Article 35(2)(b) of the United Nations Convention on Contracts for the International Sale of Goods.\nAustralia\nIn Australia, the obligation is in section 55 of Schedule 2 (\"The Australian Consumer Law\") of the Competition and Consumer Act 2010 (Cth) for consumers. The Sale of Goods Acts in each state also implies the warranty and is not limited to consumer contracts.\nUnited States\nIn the United States, the requirement for an implied warranty of fitness for a particular purpose (sometimes shortened to warranty of fitness) is found in . Absent an exclusion or modification pursuant to , the warranty applies to transactions for goods where the buyer is relying on the seller's guidance or expertise to select \"suitable goods\" that meet that buyer's particular purpose or requirements.\nMerchantability\nAn implied warranty of merchantability is a warranty implied by law that goods are reasonably fit for the general purpose for which they are sold.\nInternational sales law\nIn international sales law, merchantability forms part of the ordinary purpose of the goods. According to Article 35(2)(a) of the United Nations Convention on Contracts for the International Sale of Goods, a seller must provide goods fit for their ordinary purpose.\nAustralia\nIn Australia, the obligation is in section 54 of Schedule 2 (\"The Australian Consumer Law\") of the Competition and Consumer Act 2010 (Cth). Each State and Territory now applies the Australian Consumer Law (ACL) as the law of the state. That has created a uniform consumer protection law across the entire country.\nUnited Kingdom\nThe Sale of Goods Act 1979 states that in a contract for the sale of goods it is an implied condition that the goods supplied are of merchantable quality. The implied condition is excluded if any defects are drawn to the buyer's attention before the contract is concluded or if the buyer examines the goods before the contract is concluded and finds, or ought to have found, a defect.\nUnited States\nIn the United States, the requirement for an implied warranty of merchantability is found in . The warranty applies to merchants, as defined by , as opposed to casual sellers.\nAs prescribed by , goods are merchantable if they meet the following conditions:\nIf the merchandise is sold with an express \"guarantee,\" the terms of the implied warranty of merchantability fills the gaps left by that guarantee. If the terms of the express guarantee are not specified, they will be considered to be the terms of the implied warranty of merchantability. The UCC allows sellers to disclaim the implied warranty of merchantability, provided the disclaimer is made conspicuously and the disclaimer explicitly uses the term \"merchantability\" in the disclaimer.  Some states, however, have implemented the UCC so that it cannot be disclaimed.\nHabitability\nAn implied warranty of habitability, generally, is a warranty implied by law (in some states) that by leasing or buying a residential property, the lessor or seller is promising that the property is suitable to be lived in. The doctrine is intended as a protection for tenants in a less advantageous bargaining position than the landlord.  The warranty of habitability can be breached if there is no heat, hot water, or other essential services. Safety issues like no smoke alarm or other fire code issues can also be considered to make a dwelling uninhabitable. In some cases, courts have ruled that the warranty also covers cracked walls, peeling paint, and leaks. If the municipality in which the property is located prohibits habitation without a certificate of occupancy, but has not issued such a certificate with respect to the property, the unlawfulness of that habitation renders the property uninhabitable as a matter of law. The breach of the implied warranty of habitability can be used to legally break a lease. If the factors have been created or are controllable by the landlord and he or she has not fixed them despite ample written notification, this situation can also be considered constructive eviction, which allows the tenant to break the lease, and may also allow the tenant to sue for damages in some jurisdictions.\nDisclaimer\nIn some jurisdictions, an implied warranty in a sales contract can be expressly disclaimed by the use of specific language such as the words \"as is\" or \"with all faults\".\nUnited States\nIn the United States, a disclaimer must be conspicuous in the contract, such as in a different kind of print or font that makes it stand out. On the other hand, express warranty, or any affirmation of fact or promise to the buyer or description of the good, oral or written, can be negated or limited only if such disclaimers are reasonable.\nSome jurisdictions, however, limit the ability of sellers or manufacturers to disclaim the implied warranty of merchantability or fitness, such as Massachusetts. (Massachusetts General Laws, Chapter 106: Section 2-316A). Furthermore, the warranty of habitability generally cannot be disclaimed.\nContractual language can also limit the remedies available for breach of an implied warranty such as by capping recoverable damages or limiting the legal remedy to a replacement of a defective item. However, such a term can be found to be unconscionable. For example, if a defective product causes a personal injury, a contractual provision limiting recovery in such a case will be deemed prima facie unconscionable.\n}}\nExternal links\n* [https://www.gnu.org/licenses/gpl.html The GNU Project's General Public License], a prominent free software license, includes the disclaimer: \"Except when otherwise stated in writing the copyright holders and/or other parties provide the program 'as is' without warranty of any kind, expressed or implied, including, but not limited to, the implied warranties of merchantability and fitness for a particular purpose.\""
    }
  ]
}