{
  "content": [
    {
      "type": "text",
      "text": "# In Love and War (1996 film)\n\n| based_on       =\n| starring       =\n| music          = George Fenton\n| cinematography = Roger Pratt\n| editing        = Lesley Walker\n| distributor    = New Line Cinema\n| released       =\n| runtime        = 113 minutes\n| country        = United States\n| language       = EnglishItalian\n| budget         =\n| gross          = $25,372,294\n}}\nIn Love and War is a 1996 romantic drama film based on the book, Hemingway in Love and War by Henry S. Villard and James Nagel.  The film stars Sandra Bullock, Chris O'Donnell, Mackenzie Astin, and Margot Steinberg. Its action takes place during the First World War and is based on the wartime experiences of the writer Ernest Hemingway. It was directed by Richard Attenborough. The film was entered into the 47th Berlin International Film Festival.\nThis film is largely based on Hemingway's real-life experiences in the First World War as a young ambulance-driver in Italy. He was wounded and sent to a military hospital, where he shared a room with Villard (who later wrote the book the movie is based on) and they were nursed by Agnes von Kurowsky. Hemingway and Kurowsky fell strongly in love, but somehow the relationship didn't work out.\nThe film—apparently in a deliberate attempt to capture what the director called Hemingway's \"emotional intensity\"—takes liberties with the facts. In real life, unlike the movie, the relationship was probably never consummated, and the couple did not meet again after Hemingway left Italy.\nHemingway, deeply affected by his romantic relationship with Kurowsky, later wrote several stories about it, including his 1929 novel A Farewell to Arms.\nPlot\nIn Italy during World War I, the US president has sent teams of Red Cross doctors and nurses to boost Italian morale and help with the wounded. Volunteers drive ambulances and work in the front line canteens. 19-year-old Ernest Hemingway becomes an ambulance driver in Italy, although he wishes to become a reporter and writer. Wanting to fight against the enemy, he ends up with a shot leg, trying to save a companion from the field.\nHe is taken into a hospital, where an American nurse, Agnes von Kurowsky, takes care of him. During the first night at the hospital, Ernest tells Agnes \"I love you. Let's get married.\" while in a state of delirium. Ernest's health becomes worse and Agnes tries everything to save his leg from what she believes is gangrene. A successful operation puts Ernest on the path to recovery. As time passes, they become attached, even though Agnes has reservations because of their age difference.\nEventually, Agnes and some other nurses need to be moved closer to the front. As she can't find Ernest to tell him the bad news in person, she asks their friend to give him a letter. Ernest is shocked at finding out that she has left. While working on the front, Agnes receives a letter from Ernest telling her how much he misses her. After a few days, Ernest finally visits, telling her that he has received orders to return to the United States. He declares his love for Agnes, asking her to meet him at a nearby hotel to spend their remaining time together and to promise each other daily letters, until they are able to get married.\nAfter some time spent on the front, Agnes is asked by one of the nurses, a good friend, to spend the weekend at Dr. Domenico Caracciolo's, who has feelings for Agnes. The three of them spend time together, seeing the surroundings of Venice. The letters from Agnes soon become less and less frequent, causing Ernest great concern. While showing her an unfinished hospital, Dr. Domenico proposes. She hesitates, still thinking of Ernest. She decides to write him a letter, telling him their relationship must end, partly because of their age gap. Ernest is devastated.\nEight months later, in New York, Agnes meets an old friend and ex-patient, Harry. She confesses that she did not marry the doctor and finds out that Ernest is still angry. She decides to go to Ernest's family cabin, on Walloon Lake. Still angry and proud, Ernest doesn't accept her love. The film ends with Agnes telling him \"I love you\" as she leaves the cabin, never to see him again.\nCast\nReception\nBox office\nIn Love and War was released theatrically on December 18, 1996, and was a moderate box-office success. For Super Bowl weekend of January 1997, the film was close to a three-way tie for the number one spot at the box office with Jerry Maguire and Beverly Hills Ninja; it ultimately placed at number two. The film ultimately grossed $25,372,294 worldwide.\nCritical response\nOn Rotten Tomatoes, the film has an approval rating of 11%, based on reviews from 28 critics. The website's consensus reads, \"Formulaic and trite, In Love and War unconvincingly recreates Ernest Hemingway's early life with all the stuffy tropes that the author would have excised in a second draft.\"\nRoger Ebert of the Chicago Sun-Times gave the film 2 out of 4 and wrote: \"In Love and War is not much interested in Ernest Hemingway's subsequent life and career, and even in its treatment of this early period, it doesn't deal with themes such as his macho posturing, his need to prove himself, his grandiosity.\"\nIn The New York Times, Stephen Holden called the film \"a generic historical romance and older woman-younger man fable of sexual initiation too muted for either character to come to life\".\nReferences\nExternal links\n*\n* [https://www.allmovie.com/movie/in-love-and-war-am23798 In Love and War at AllMovie]\n*\n*\n*\n* [https://web.archive.org/web/20050827095548/http://www.ernest.hemingway.com/agnes.htm Agnes Von Kurowsky @ http://www.ernest.hemingway.com/]\n* [http://rjgeib.com/thoughts/hemingway/agnes-von-kurowsky.html Agnes's breakup letter to Hemingway]"
    }
  ]
}