{
  "content": [
    {
      "type": "text",
      "text": "# In Love (Wynn Stewart song)\n\n| recorded   = August 28, 1967\n| studio     = Capitol (Hollywood)\n| genre      = }}\n| length     =\n| label      = Capitol\n| writer     = Bobby George\n| producer   = Ken Nelson\n| chronology = Wynn Stewart\n| prev_title = Something Pretty\n| prev_year  = 1968\n| next_title = Strings\n| next_year  = 1968\n}}\n\"In Love\" is a song written by Bobby George. It was recorded by American country artist Wynn Stewart. It was released as a single in 1968 and became a major hit that same year.\nBackground and release\n\"In Love\" was recorded one year prior to its release on August 28, 1967 at the Capitol Recording Studio, located in Hollywood, California. The session was produced by Ken Nelson, Stewart's producer at Capitol Records. Three additional tracks were recorded in the same session, including a re-recording of his single \"Above and Beyond (The Call of Love).\" Stewart had been on the Capitol label for nearly four years at the time of this single release and had several major hits up to this point. This included the number one single \"It's Such a Pretty World Today.\"\n\"In Love\" was released as a single on Capitol Records in July 1968. It was his sixth single release with the label. His backing band, \"The Tourists,\" were given equal billing on the single release by Capitol Records. The single spent 11 weeks on the Billboard Hot Country Singles chart before becoming a major hit, peaking at number 11 in October 1968. \"In Love\" was Stewart's eighth major hit as a music artist in his career on the Billboard charts. In Canada, the song became his second charting song. It peaked at number 14 on the RPM Country Songs chart that same year.\nTrack listings\n;7\" vinyl single\n* \"In Love\" – 2:10\n* \"In My Own Little World\" – 2:35\nChart performance\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (1968)\n! scope=\"col\"| Peak position\n|-\n! scope=\"row\"| Canada Country Songs (RPM)\n| 14\n|-\n|-\n|}\nReferences"
    }
  ]
}