{
  "content": [
    {
      "type": "text",
      "text": "# Independence Day (Botswana)\n\nThe Independence Day of Botswana, commonly called Boipuso in Setswana, is a national holiday observed in Botswana on September 30 of every year. The date celebrates Botswana's Declaration of Independence from the United Kingdom on September 30, 1966.\nIndependence Day is commonly associated with fireworks, parades, fairs, picnics, concerts, family reunions, and political speeches and ceremonies, in addition to various other public and private events celebrating the history, government, and traditions of Botswana. Independence Day is the National Day of Botswana.\nBackground\n, 1953]]\nThe most powerful ruler was King Khama III, who had strong support from the British government, and was especially popular among evangelicals in Britain. He collaborated closely with the British military, and kept his vast, but underpopulated lands independent from intruders from South Africa.\nKhama's eldest son was Sekgoma II, who became chief of the Bamangwato upon Khama's death in 1923. Sekgoma II's eldest son was named Seretse. Throughout his life Khama took several wives (each after the death of the former one). One of his wives, Semane, birthed a son named Tshekedi.\nSekgoma II's reign lasted only a year or so, leaving his son Seretse, who at the time was an infant, as the rightful heir to the chieftainship (Tshekedi was not in line to be chief since he did not descend from Khama’s oldest son Sekgoma II). So in keeping with tradition, Tshekedi acted as regent of the tribe until Seretse was old enough to assume the chieftainship. The transfer of responsibility from Tshekedi to Seretse was planned to occur after Seretse had returned from his law studies overseas in Britain.\nTshekedi Khama's regency as acting chief of the Bamangwato is best remembered for his expansion of the mephato regiments for the building of primary schools, grain silos, and water reticulation systems; for his frequent confrontations with the British colonial authorities over the administration of justice in Ngwato country; and for his efforts to deal with a major split in the tribe after Seretse married a white woman, Ruth Williams, while studying law in Britain.\nTshekedi opposed the marriage on the grounds that under Tswana custom a chief could not marry simply as he pleased. He was a servant of the people; the chieftaincy itself was at stake. Seretse would not budge in his desire to marry Ruth (which he did while exiled in Britain in 1948), and tribal opinion about the marriage basically split evenly along demographic lines - older people went with Tshekedi, the younger with Seretse. In the end, British authorities exiled both men (Tshekedi from the Bamangwato territory, Seretse from the Protectorate altogether). Rioting broke out and a number of people were killed.\nSeretse and Ruth were allowed to return to the Protectorate and Seretse and Tshekedi were able to patch things up a bit between themselves. By now though, Seretse Khama saw his destiny not as chief of the Bamangwato tribe, but rather as leader of the Botswana Democratic Party and as President of the soon-to-be independent nation of Botswana in 1966. He would remain Botswana's President until his death from pancreatic cancer in 1980.\nCustoms\nIndependence Day is a national holiday marked by patriotic displays. Similar to other  events, Independence Day celebrations often take place outdoors. Independence Day is a federal holiday, so all non-essential federal institutions (such as the postal service and federal courts) are closed on that day. Many politicians make it a point on this day to appear at a public event to praise the nation's heritage, laws, history, society, and people.\nFamilies often celebrate Independence Day by hosting or attending a picnic or barbecue; many take advantage of the day off and, in some years, a long weekend to gather with relatives or friends. Decorations (e.g., balloons, and clothing) are generally colored blue, white, and black, the colors of Botswana flag. Parades are often held in the morning, before family get-togethers, while fireworks displays occur in the evening after dark at the national stadium.\nSee also\n* Bechuanaland Protectorate\n* History of Botswana\nNotes\nFurther reading\n* Fawcus, Peter and Alan Tilbury. Botswana: The Road to Independence (Pula Press, 2000)\n* Morton, Fred, and Jeff Ramsay (eds), The birth of Botswana: a history of the Bechuanaland Protectorate from 1910 to 1966. (1987)\n* Parsons, Neil. New History of Southern Africa\n* Parsons, Neil. King Khama, Emperor Joe and the Great White Queen (University of Chicago Press, 1998)\n* Thomas Tlou & Alec Campbell, History of Botswana (Gaborone: Macmillan, 2nd edn. 1997)"
    }
  ]
}