{
  "content": [
    {
      "type": "text",
      "text": "# Independent reviews in the United Kingdom\n\nIndependent reviews in the United Kingdom are non-statutory, flexible, arm's-length investigations into matters of concern. They are often commissioned by ministers and departments of the UK Government to examine policy or public interests outside formal, statutory public inquiry frameworks. Unlike statutory public inquiries, they lack powers to compel evidence and use flexible evidence-gathering methods such as focus groups, confidential interviews, and calls for evidence.\nIndependent reviews vary in duration from rapid assessments to multi-year probes with interim and final reports. Processes adapt to context, preserving agility but requiring bespoke setup. Final reports deliver findings and actionable recommendations, which governments may adopt or respond to formally. Independent reviews thus complement public inquiries by offering policy-focused scrutiny with procedural flexibility.\nDefinition\nIn the United Kingdom, independent reviews are formal investigations to examine specific topics of interest outside legislative frameworks such as the Inquiries Act 2005. They are often used by the government to investigate policy or matters of public concern. When commissioned by a government department to examine its affairs, they will function outside of them to make them independent.\nIndependent reviews are distinct from public inquiries. While public inquiries are usually established to investigate past failures, independent reviews usually examine broad government policy. Furthermore, as with non-statutory inquiries, they differ from statutory public inquiries by lacking powers to compel evidence or witnesses and by being more flexible.\nSeveral independent reviews include the phrase \"independent review\" in their title, for example the Independent Review of the Fire Service and the Independent Review of Prison Capacity. From time to time, politicians have announced independent reviews to examine areas of public concern. They are often used to examine topics relating to healthcare.\nProcess\n| bar_width  = 35\n| data_max   = 15\n| label_type = Duration (months)\n| data_type  = Number of independent reviews\n| label1     = 0–3\n| data1      = 5\n| label2     = 3–6\n| data2      = 7\n| label3     = 6–9\n| data3      = 13\n| label4     = 9–12\n| data4      = 13\n| label5     = 12–15\n| data5      = 9\n| label6     = 15–18\n| data6      = 4\n| label7     = 18–21\n| data7      = 2\n| label8     = 21–24\n| data8      = 3\n| label9     = 24–27\n| data9      = 4\n| label10    = 27–30\n| data10     = 0\n| label11    = 30–33\n| data11     = 1\n| label12    = 33–36\n| data12     = 3\n| label13    = 36+\n| data13     = 2\n}}\nIndependent reviews follow no set model. They are usually established by government ministers and led by external experts appointed to investigate complex or contentious policy areas within pre-set terms of reference and timeframes. They use evidence-gathering methods such as public calls for evidence, stakeholder consultations, focus groups, drop-in sessions, and confidential interviews. Their final reports set out findings and actionable recommendations, which governments may adopt or respond to formally, enhancing policy credibility while preserving ministerial discretion.\nMinisters may appoint a single reviewer or commission a panel, and reviewers may be voluntary or remunerated based on context. The durations of independent reviews vary widely, from rapid investigations of a few months to multi-year enquiries with interim and final reports. The absence of a standardised methodology can increase setup overhead but preserves flexibility, enabling independent reviews to adapt methods to subject-matter needs.\nNotable examples\nLammy Review\nThe Lammy Review, an independent review that examined racism within the policing and criminal justice systems in the UK, was commissioned in January 2016 by Prime Minister David Cameron and led by MP David Lammy. It found stark racial disparities in arrests, sentencing, and custody, identifying opaque sentencing, over‑representation in remand, and lack of trust as key factors. The review made 35 recommendations, including public sentencing explanations, deferred prosecutions, and record sealing, most of which the government adopted by creating a Race and Ethnicity Board and embedding changes in policy. While praised for its rigour and data transparency, campaigners note persistent disparities, and call for full implementation.\nOckenden Review\nThe Ockenden Review, commissioned in 2017 by Health Secretary, Jeremy Hunt, and led by Donna Ockenden, investigated maternity care at Shrewsbury and Telford Hospital NHS Trust following concerns from bereaved families. The review examined over 1,400 cases, identifying systemic failures such as staffing shortages, inadequate training, poor governance, and a culture that failed to listen to women. It issued 15 national recommendations and over 60 trust-specific recommendations aimed at improving maternity safety.\nBrowne Review\nThe Browne review was commissioned in November 2009 by Business Secretary, Peter Mandelson, and chaired by Lord Browne to examine university fees and student finance amid concerns over sustainability and access. The review recommended removing the £3,290 fee cap in favour of a variable‑fee model tied to graduate earnings, raising the repayment threshold to £21,000, and establishing an independent higher education council.\nReferences\nWorks cited\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* }}\n*"
    }
  ]
}