{
  "content": [
    {
      "type": "text",
      "text": "# Independence of Finland\n\nof 1917, Prime Minister P. E. Svinhufvud in the head of the table. Note the portrait of Alexander I of Russia in the background]]\nFinland declared its independence on 6 December 1917. The formal Declaration of Independence was only part of the long process leading to the independence of Finland.\nHistory\nProclamation of Empress Elizabeth (1742)\nThe idea of an independent Finland was first raised in the 18th century, when the region was still part of Sweden. On 18 March 1742, during the Russo-Swedish War (1741–1743), Empress Elizabeth of Russia issued a proclamation addressed to the Finnish population. The proclamation promised that Russia would grant Finland independence \"as a free country, under the dominion of no power\", provided that the Finns ceased their resistance against the Russian forces. Although the proclamation can be regarded as wartime propaganda, the establishment of a Finnish buffer state, as well as the possible incorporation of Finland into the Russian Empire, was seriously discussed in Saint Petersburg.\nAfter the Swedish forces capitulated in August 1742 and Finland came under Russian occupation, a Finnish delegation sought to petition Elizabeth to appoint her nephew Duke Charles Peter Ulrich of Holstein-Gottorp (later Tsar Peter III of Russia) as Grand Duke of Finland, hoping to avoid total annexation by Russia. However, the delegation was not permitted to travel to Saint Petersburg, and most of Finland was returned to Sweden under the Treaty of Åbo (Turku). Nevertheless, the idea of a Finnish buffer state lingered and resurfaced in Russian discussions in 1769.\nAnjala conspiracy (1788)\nThe Anjala conspiracy was a scheme in 1788&ndash;1790 as a response to end Gustav III's Russian War, and it included the independence of Finland to some degree. Several people involved were linked to Walhalla-orden. Russian occupations and plundering of 1713&ndash;21 (the \"Greater Wrath\") () and 1741&ndash;43 (the \"Lesser Wrath\") () were still in vivid memory when Finns waged partisan warfare against the Russians.\nGeorg Magnus Sprengtporten, who took no direct part in the conspiracy, had written  in 1786. Sprengtporten later had a role in forming the autonomous Grand Duchy of Finland within the Russian Empire, as he became the first Governor-General of Finland after Sweden ceded the rest of Finland to Russia in 1809 at the conclusion of the Finnish War.\nRise of national identity\n, 1905, was a symbol of Russification, with the Maiden of Finland defending the law against the Russian eagle.]]\nAccording to professor Martti Häikiö, before a nation declares independence, it must develop a national identity and certain institutions. Governing bodies for Finland were developed after 1809, when it was \"elevated as a nation among nations\" (as declared by Tsar Alexander I) by becoming an autonomous Grand Duchy under the Russian tsar. The Diet of Finland met regularly from 1863.\nNational identity grew simultaneously with Pan-European nationalism. Johan Ludvig Runeberg and Elias Lönnrot created an idealized image of Finnish people and Finnish nature in the 1830s and 1840s. Also J. V. Snellman was a central person in national romanticism and the modern nationality debate. He encouraged the use of the Finnish language (instead of Swedish) among the educated classes during Finland's language strife. The Finnish markka was introduced as currency in 1860 by the Bank of Finland, which Snellman pegged to silver instead of the ruble. During the famine of 1866–1868, Snellman worked to obtain aid and distribute it in a country with low resources and undeveloped communications.}}\nThe first period of Russification of Finland () began in 1899 with the February Manifesto, a legislative act given by Nicholas II, when Nikolay Bobrikov was Governor-General of Finland. As a response, the cultural address Pro Finlandia was gathered with 523,000 names, and a delegation of 500 people was sent to Saint Petersburg to deliver it. The Kagal resistance movement formed at this time. In 1901 Russia tried to alter the nature of the Finnish army with a new conscription law, which demanded that Finns not only defend Finland, but also fight for Russia on any front. Finnish resistance grew into a mass movement, and only half of the eligible men reported for duty. Bobrikov was shot in 1904 by Eugen Schauman, who shot himself afterwards. The Finnish newspaper , which had been censored before, was closed permanently as a result of an editorial written about the assassination. Jean Sibelius composed In Memoriam in memory of Schauman. The steamship  unsuccessfully attempted to smuggle large quantities of arms for the Finnish resistance during the Russo-Japanese War (1904–1905). The Finnish general strike of 1905 temporarily halted russification.\nby Eugen Schauman]]\nDuring 1905&ndash;1908 Leo Mechelin formed a government and created a liberal democracy with the universal right to vote and be elected. In 1906, the unicameral Parliament of Finland was created, with universal and equal suffrage. However, the power of the parliament was limited by the tsar from 1908 to 1916.\nThe second period of Russification of Finland () in 1908 and World War I led activist groups to unite. Under Franz Albert Seyn, Bobrikov's successor as Governor-General, all legislation was moved to the Russian State Duma, which then pushed for laws restricting Finnish autonomy. Russia demanded higher payments and the Senate of Finland was replaced with the admiral-senate or saber-senate. Nicholas II pushed for complete russification and the end of Finnish autonomy in 1914, but this was halted by the beginning of the First World War. The Jäger Movement was formed and sent first 200, and later 1900, Finnish volunteers to Germany to be trained as Jägers (elite light infantry) for armed resistance. The Finnish Jägers formed the 27th Jäger Battalion and were eventually sent to Libau to fight against the Russian Empire. Sibelius composed the Jäger March on lyrics written by Heikki Nurmio, who served in the 27th Battalion.\nDiscussions in 1917\nRevolution in Russia\nThe February and October Revolutions in 1917 ignited hope in the Grand Duchy of Finland. After the abdication of Tsar Nicholas II on 2 March (15 March N.S.) 1917, the personal union between Russia and Finland lost its legal base – at least according to the view in Helsinki – as he was the Grand Duke of Finland. Negotiations began between the Russian Provisional Government and Finnish authorities.\nPower act\nThe resulting proposal, approved by the Russian Provisional Government, was heavily rewritten in the Finnish Parliament and transformed into the so-called Power Act (, ), whereby the Parliament declared itself to now hold all powers of legislation, except with respect to foreign policy and military issues, and also declared that it could be dissolved only by itself. At the time of the vote it was believed that the Provisional Government would be quickly defeated by the rebellion in Saint Petersburg. The Provisional Government survived, however, and disapproved of the Power Act and dissolved the Finnish Parliament.\nAfter new elections and the ultimate defeat of the Provisional Government in the October Revolution, the Finnish Parliament decided to create a three-man regency council, based on Finland's Constitution, and more precisely on [http://sv.wikisource.org/wiki/Regeringsform_1772#%C2%A7_38. §38] of the old Instrument of Government of 1772, which had been enacted by the Estates after Gustav&nbsp;III's bloodless coup. This paragraph provided for the election of a new monarch in case of the extinction of the royal line and was interpreted in Finland as vesting sovereignty in the Estates, later the Parliament, during such an interregnum. The regency council was never elected, however, because of the strong opposition of Finnish socialists and their general strike of 1917 which demanded more radical action.\nOn 2 November (15 November N.S.) 1917, the Bolsheviks declared a general right of self-determination, including the right of complete secession, \"for the Peoples of Russia\". On the same day, the Finnish Parliament issued a declaration by which it assumed, pro tempore, all the powers of the Sovereign in Finland.\nThe old Instrument of Government was, however, no longer deemed suitable. Leading circles had long held that monarchism and hereditary nobility were antiquated, and advocated a republican constitution for Finland.\nThe Declaration and 15 November\nPehr Evind Svinhufvud formed a Senate which started on 27 November 1917. Its goal was to execute independence as soon as possible. The Senate returned to the Parliament with a Declaration of Independence and proposal for a new republican Instrument of Government on 4 December. The Declaration of Independence was technically given the form of a preamble of the proposition, and was intended to be agreed upon by the Parliament. Parliament adopted the Declaration on 6 December with 100 votes against 88.\nWith reference to the declaration of 15 November, the new declaration says:\nInternational recognition\nSvinhufvud immediately asked Sweden, Norway, Denmark, Germany, and France to recognize Finland's independence. The West, however, said they would wait until the former ruler, Russia, recognized the declaration. They told Svinhufvud to talk to Lenin's Bolshevik Government. Svinhufvud was hesitant to do this, as he did not want to recognize the Bolsheviks as the legal rulers of Russia. Besides, he thought that the Bolshevik government would probably fall soon. So the parliament decided to ask for recognition from the Russian Constituent Assembly. Germany, which was in middle of peace negotiations with Soviet Russia, pressured Finns to talk to Lenin and the Council of People's Commissars. Svinhufvud followed their advice, as Finland wanted Germany's recognition as soon as possible.\nOn 18 December (31 December N.S.), the Soviet Russian government issued a decree recognizing Finland's independence, and on 22 December (4 January 1918 N.S.) it was approved by the highest Soviet executive body, the All-Russian Central Executive Committee (VTsIK). This is how the meeting is told in Svinhufvud's biography,  written by Erkki Räikkönen:\nThe independence of Finland was recognized after that by Germany, Sweden, and France on 4 January 1918, by Norway and Denmark on 10 January, and by Austria-Hungary on 13 January.\nOrganizing a new country\nHardship burdened the common people, resulting in polarization, and soon ignited the Civil War. The declaration actually addresses this problem:\nMany of the necessary ministries and authorities had been founded during years of autonomy, and they continued their activities perhaps after a change of name. The Bank of Finland had the same position as before. As pilotage has military significance, the National pilot office had been subjected to russification. The National Board of Navigation, later called the Finnish Maritime Administration, was founded 15 December 1917, and piloting became its responsibility.\nThe attempt to establish a monarchy in Finland failed and in 1919 Kaarlo Juho Ståhlberg became the first president. The first parliamentary elections were held in March 1919.\nList of recognition\n, Leon Trotsky, Grigory Petrovsky, Joseph Stalin, Isaac Steinberg, Vladimir Karelin, and Alexander Schlichter]]\n{| class=\"wikitable\"\n|-\n! State\n! Date\n|-\n| data-sort-value=\"Venäjä\"|\n| align=right data-sort-value=\"19180104\"| 4 January 1918\n|-\n|\n| align=right data-sort-value=\"19180104\"| 4 January 1918\n|-\n|\n| align=right data-sort-value=\"19180104\"| 4 January 1918\n|-\n|\n| align=right data-sort-value=\"19180104\"| 4 January 1918\n|-\n|\n| align=right data-sort-value=\"19180105\"| 5 January 1918\n|-\n|\n| align=right data-sort-value=\"19180110\"| 10 January 1918\n|-\n|\n| align=right data-sort-value=\"19180110\"| 10 January 1918\n|-\n|\n| align=right data-sort-value=\"19180111\"| 11 January 1918\n|-\n|\n| align=right data-sort-value=\"19180113\"| 13 January 1918\n|-\n|\n| align=right data-sort-value=\"19180128\"| 28 January 1918\n|-\n|\n| align=right data-sort-value=\"19180221\"| 21 February 1918\n|-\n|\n| align=right data-sort-value=\"19180221\"| 21 February 1918\n|-\n|\n| align=right data-sort-value=\"19180227\"| 21 February 1918\n|-\n|\n| align=right | 2 March 1918\n|-\n|\n| align=right data-sort-value=\"19180511\"| 11 May 1918\n|-\n|\n| align=right data-sort-value=\"19180723\"| 23 July 1918\n|-\n|\n| align=right data-sort-value=\"19181009\"| 9  October 1919\n|-\n|\n| align=right data-sort-value=\"19190308\"| 8  March 1919\n|-\n|\n| align=right data-sort-value=\"19190506\"| 6 May 1919\n|-\n|\n| align=right data-sort-value=\"19190507\"| 7 May 1919\n|-\n|\n| align=right data-sort-value=\"19190523\"| 23 May 1919\n|-\n|\n| align=right data-sort-value=\"19190610\"| 10 June 1919\n|-\n|\n| align=right data-sort-value=\"19190617\"| 17 June 1919\n|-\n|\n| align=right data-sort-value=\"19190623\"| 23 June 1919\n|-\n|\n| align=right data-sort-value=\"19190627\"| 27 June 1919\n|-\n|\n| align=right data-sort-value=\"19190818\"| 18 August 1919\n|-\n|\n| align=right data-sort-value=\"19191027\"| 27  October 1919\n|-\n|\n| align=right data-sort-value=\"19191219\"| 19 December 1919\n|-\n|\n| align=right data-sort-value=\"19191226\"| 26 December 1919\n|-\n|\n| align=right data-sort-value=\"19191231\"| 31 December 1919\n|-\n|\n|align=right data-sort-value=\"19191219\"| 8 April 1920\n|-\n|\n|align=right data-sort-value=\"19191219\"|18 April 1920\n|-\n|\n|align=right data-sort-value=\"19191219\"|17 May 1920\n|-\n|\n|align=right data-sort-value=\"19191219\"|25 June 1920\n|-\n|\n|align=right data-sort-value=\"19191219\"|13 July 1920\n|-\n|\n|align=right data-sort-value=\"19191219\"|23 August 1920\n|-\n|\n|align=right data-sort-value=\"19191219\"|3 June 1921\n|-\n|\n|align=right data-sort-value=\"19191219\"|25  October 1921\n|-\n|\n|align=right data-sort-value=\"19191219\"|27 July 1922\n|-\n|\n|align=right data-sort-value=\"19191219\"|17 July 1928\n|-\n|\n|align=right data-sort-value=\"19191219\"|1 December 1928\n|-\n|\n|align=right data-sort-value=\"19191219\"|20 February 1931\n|}\nNational symbols\nFrom several suggestions, the parliament selected a blue and white flag, which was flown over the house of parliament on 28 May 1918. The coat of arms of Finland, with a crowned lion on a red field had existed since Swedish rule.\nSelection of the national anthem divided social classes. The conservatives preferred  by Runeberg and Pacius, while the working class was singing  and \"The Internationale\". After the Whites won the Finnish Civil War,  was chosen.\nFinland's Independence Day was declared to be 6 December and a national holiday. The bill to make Finland a republic was passed by the Diet in 1919.\nCommemoration\nThe 90th anniversary of Finland's Declaration of Independence was selected as the main motif for the €5 90th Anniversary of Finland's Declaration of Independence commemorative coin, minted in 2007. The reverse shows petroglyph aesthetics, while the obverse has a nine-oar boat with rowers as a symbol of collaboration. Musical symbols and Finnish kantele strings are also included in the coin's design.\nSee also\n* Timeline of Independence of Finland (1917–1920)\n* History of Finland\n* Politics of Finland\n* Finland under Swedish rule\n* Heimosodat\n* Trust (1976 film)\nReferences\nExternal links\n* [https://web.archive.org/web/20171107005319/http://itsenaisyys100.fi/english/2017/09/11/finland-as-a-state-in-1917/  Finland as a state in 1917] - Itsenäisyys100"
    }
  ]
}