{
  "content": [
    {
      "type": "text",
      "text": "# Independent International Commission of Inquiry on the Syrian Arab Republic\n\nThe Independent International Commission of Inquiry on the Syrian Arab Republic was established by the United Nations Human Rights Council (UNHRC) on 22 August 2011 to investigate violations of international human rights committed since March 2011 in the Syrian Arab Republic.\n, Karen Abuzayd, Carla Del Ponte, and Paulo Sérgio Pinheiro (Chair), presenting their report at the Human Rights Council on September 16 2013 ]]\nThe Commission produced more than 30 reports between 2011 and 2025, documenting various violations including war crimes and crimes against humanity. As of 2024, the Commission had interviewed more than 11,000 victims and witnesses, leading to 50 convictions. Its latest report found the coastal violence between January and March 2025 to be widespread and systematic: calling on the parties to take steps to prevent future violations and restore public confidence.\nIn December 2024, the Commission of Inquiry was granted access to the Syrian Arab Republic for the first time since it began its work in September 2011.\nMandate\nThe mandate for the Commission was established on 22 August 2011 by the UN Human Rights Council through resolution S-17/1. The mandate is to investigate all alleged violations of international human rights law since March 2011 in the Syrian Arab Republic. The Commission is tasked to establish the facts and circumstances of violations and crimes and, where possible, to identify those responsible so that they can be held accountable.\nComposition\nAs of October 2023, the current commissioners are Paulo Sérgio Pinheiro (Brazil), Hanny Megally (Egypt) and Lynn Welchmann (UK). The former commissioners include Carla Del Ponte (Switzerland), Karen Koning AbuZayd (US), Vitit Muntarbhorn (Thailand) and Yakin Ertürk (Turkey).\nShortly after the commission was established, Paulo Sérgio Pinheiro, Karen Koning AbuZayd and Yakin Erturk were appointed by the President of the UNHRC to serve as the Commissioners. In March 2012, Erturk stepped down from the position. Two new commissioners, Carla Del Ponte and Vitit Muntarbhorn, were appointed after the extension of the commission's mandate in September 2012. In 2016, Muntarbhorn stepped down when the UNHRC designated him the first United Nations Independent Expert on violence and discrimination based on sexual orientation and gender identity. In August 2017, Del Ponte resigned. Hanny Megally was appointed by the President of the UNHRC to serve as the third Commissioner in October 2017.\nFindings\nHoula massacre\nThe inquiry's investigations have included the May 2012 Houla massacre. Its preliminary report was published in June 2012. The report noted that the commission's investigation was significantly hindered because they had not been allowed access to Syria. Based on the available evidence, the commission did not rule out any of three possible perpetrators but said it was unlikely that anti-government fighters were responsible. In an August 2012 report, following continued investigations focusing on identifying the perpetrators, the commission concluded there was a reasonable basis to believe the perpetrators were aligned to the Syrian government. The report said a \"lack of credible information supporting other possibilities\" bolstered this conclusion.\nUrum al-Kubra aid convoy attack\nA March 2017 report included the commission's investigation of the September 2016 Urum al-Kubra aid convoy attack. The report said satellite imagery and forensic evidence implicated Syria's air force, and no Russian or coalition aircraft were in the area during the time of the attack. According to the report, the Syrian Air Force dropped barrel bombs from helicopters on a United Nations humanitarian aid convoy, then fired rockets from jets, and then strafed survivors with machine guns. 14 aid workers were killed, 17 trucks carrying aid supplies were destroyed, and the attack led to the suspension of all humanitarian aid in the country. The attack was described as \"meticulously planned\" and \"ruthlessly carried out\". Due to the intentional targeting of aid workers and civilians, as well as the denial of humanitarian aid, the report described the attack as a war crime.\nAl-Jinah airstrike\nA September 2017 report investigated the al-Jinah airstrike which occurred on March 16, 2017. According to the report, United States forces hit a building, described as a mosque complex in the report, with ten bombs and an additional two missiles were fired at the people fleeing. The airstrikes killed 38 people, including five children, and another 26 were injured. The commission's findings did not corroborate an allegation from the United States that an al-Qaeda meeting occurred and, according to the commission, no evidence was released by the United States to support this claim. The report said that the United States team did not sufficiently verify the target before the strike. The commission concluded that the forces of the United States had violated international humanitarian law.\nMa'arrat al-Nu'man and Hass attacks\nIn March 2020, a report from the commission investigated two incidents involving the bombing of civilian areas. The first was the Ma'arrat al-Numan market bombing on 22 July 2019. At least two Russian planes had circled the area after leaving Hmeimim Air Base. A series of airstrikes on the market killed 43 civilians, including four children, and wounded at least 109 others. Two residential buildings and 25 shops were also destroyed. When aid workers arrived there was another wave of bombing, described in the report as a \"double tap\" airstrike. The second attack was the Hass refugee camp bombing on 16 August 2019, which killed 20 people and injured 40 others. Of the 20 people killed, 14 were women and children. Based on the available evidence, the commission had reasonable grounds to believe Russian aircraft participated in both incidents and, according to the report, both attacks were war crimes by the Russian Air Force.\nChemical weapons use in Syria\nOn 5 May 2013 Carla del Ponte accused the Syrian rebels of using chemical weapons, a view of Syrian opposition chemical weapons capability diametrically opposed by the majority of Western government officials. She stated, \"We still have to deepen our investigation, verify and confirm (the findings) through new witness testimony, but according to what we have established so far, it is at the moment opponents of the regime who are using sarin gas.\" On 6 May 2013, in an apparent reaction to Del Ponte’ comments the Commission issued a press release clarifying that it “has not reached conclusive findings as to the use of chemical weapons in Syria by any parties in the conflict”.\nIn June 2013, the Commission reported that there was reason to believe that \"limited quantities of toxic chemicals\" had been used in the Khan al-Assal attack, but that it was not then in a position \"to determine the precise chemical agents used, their delivery systems or the perpetrator\".\nOn 5 March 2014, the \"Independent International Commission of Inquiry on the Syrian Arab Republic\" (dated 12 February) published a report that stated that the chemical agents used in Khan-al-Assal bore \"the same unique hallmarks as those used in Al-Ghouta\" in the August 2013 chemical attack. The report also indicated, based on \"evidence available concerning the nature, quality and quantity of the agents used\" that the perpetrators of the Al-Ghouta attack \"likely had access to the chemical weapons stockpile of the Syrian military\". In none of the incidents, however, was the commission’s \"evidentiary threshold\" met in regards to identifying the perpetrators of the chemical attacks.\nIn March 2017, the Commission documented violations including chemical attacks and civilian executions perpetrated between 21 July and 22 December 22, during the final period of the Battle of Aleppo (2012–2016).\nAccording to a report in September 2017, 25 chemical attacks had been documented by the commission from the period of March 2013 to March 2017. The commission attributed 20 of these attacks to forces of the Syrian government, and said civilians were the main targets. By September 2018, the commission had documented 39 attacks involving chemical weapons since 2013. Government forces were identified as having carried out 33 of these attacks. The commission had not attributed responsibility for the remaining six attacks.\nKhan Shaykhun chemical attack\nThe Khan Shaykhun chemical attack, which occurred on 4 April 2017, was investigated in a September 2017 report. According to the report, the attack was carried out by the Syrian Air Force with a Sukhoi 22 aircraft. The report says the aircraft conducted four airstrikes at 6:45am. One bomb carried a nerve agent and impacted a road. According to the report, 83 people were killed in the attack, mostly women and children, and almost 300 were injured. The report said the use of sarin constituted war crimes by Syrian forces.\nDel Ponte resignation\nIn August 2017, Del Ponte resigned from the Commission, due to frustration at the lack of support from the international community: \"We could not obtain from the international community and the Security Council a resolution putting in place a tribunal, an ad hoc tribunal for all the crimes that are committed in Syria... Seven years of crime in Syria and total impunity. That is not acceptable.\" She blamed Russia for vetoing action: \"Now a prosecutor should continue our work and bring the war criminals before a special court. But that is exactly what Russia is blocking with its veto in the U.N. Security Council\". She said Assad's government used chemical weapons the during the April 2017 Khan Shaykhun chemical attack, and that the Commission has gathered enough evidence for President al-Assad to be convicted of war crimes.\n2025 Report\nIn its latest report, A/HRC/58/66 , the Commission concluded that war crimes were likely committed by both interim government forces and loyalists to Syria's former regime during the March 2025 coastal violence.\nSee also\n* United Nations Mission to Investigate Alleged Uses of Chemical Weapons in the Syrian Arab Republic\n* Use of chemical weapons in the Syrian civil war\nReferences\nExternal links\n* [http://www.ohchr.org/EN/HRBodies/HRC/IICISyria/Pages/IndependentInternationalCommission.aspx Independent International Commission of Inquiry on the Syrian Arab Republic website ]\n* [https://twitter.com/uncoisyria Independent International Commission of Inquiry on the Syrian Arab Republic on Twitter]"
    }
  ]
}