{
  "content": [
    {
      "type": "text",
      "text": "# Independence Blue Cross\n\n}}\nIndependence Blue Cross (also known by the initialism IBX) is a health insurer based in Philadelphia, Pennsylvania, United States.  Independence is the largest health insurer in the Philadelphia area, serving people in the region and seven million nationwide.\nEmploying more than 10,000 people, the company offers a wide variety of health plans, including managed care, and traditional indemnity insurance. Its network of health care providers includes nearly 180 area hospitals and more than 60,000 physicians and other health care professionals.\nIndependence is an independent licensee of the Blue Cross and Blue Shield Association.\nCompany history\nIndependence Blue Cross began in 1938 as the Associated Hospital Service of Philadelphia and offered the first prepaid hospitalization plan in the region. Philadelphia Mayor S. Davis Wilson enrolled as the first member, and Independence Hall became the first employer group to purchase coverage.\nBy the end of its first year, the company had more than 160,000 members. By 1958, it employed 600 people and contracted with 94 hospitals. In 1964, the company changed its name to Blue Cross of Greater Philadelphia and in 1988, began doing business as Independence Blue Cross.\nIn October 2011, Independence launched a private, charitable foundation — the Independence Blue Cross Foundation, with a mission to transform health care through innovation in the communities it serves. The IBC Foundation partners with many local organizations to teach children how to live a healthier life. By the end of 2024, the IBX Foundation will have awarded grants totaling more than $85 million to support nonprofits and research improving the health and well-being of communities in southeastern Pennsylvania.\nSubsidiaries and affiliates\nIn addition to health care benefits, Independence Blue Cross offers specialized services and managed care through its affiliates and subsidiaries.\n* QCC Insurance Company\n* Keystone Health Plan East\n* Independence Administrators\n* AmeriHealth\n**AmeriHealth Administrators\n* AmeriHealth Casualty\n* AmeriHealth Caritas\n**AmeriHealth Caritas Delaware\n**AmeriHealth Caritas Florida\n**AmeriHealth Caritas Louisiana\n**Blue Cross Complete of Michigan (joint venture with Blue Cross Blue Shield of Michigan)\n**AmeriHealth Caritas New Hampshire\n**PerformCare (New Jersey)\n**AmeriHealth Caritas North Carolina\n**AmeriHealth Caritas Ohio\n**AmeriHealth Caritas Pennsylvania\n**Keystone First (Pennsylvania)\n**First Choice by Select Health of South Carolina\n**AmeriHealth Caritas District of Columbia\n*Tandigm Health\nExternal links\n*\nReferences"
    }
  ]
}