{
  "content": [
    {
      "type": "text",
      "text": "# Independence Day (Young Justice)\n\n| production = 101\n| writer = Greg Weisman\n| director = Jay Oliva\n| guests =\n| episode_list = List of Young Justice episodes\n| prev =\n| next = Fireworks\n}}\n\"Independence Day\" is the first episode of the animated television series Young Justice, which first aired on November 26, 2010 alongside the episode \"Fireworks\" as part of an hour-long special. The episode features Young Justice team members Robin, Aqualad, Superboy, and Kid Flash, while Miss Martian and Artemis joined later in the series. References to the animated series Super Friends, Justice League and Teen Titans appear in the episode. \"Independence Day\" won an Emmy Award for Individual Achievement in Animation.\nPlot\nOn the Fourth of July, Batman, the Flash, Aquaman, and Green Arrow, along with their respective proteges Robin, Kid Flash, Aqualad, and Speedy, each defeat a villain with ice powers, the latter in each duo telling the former how important the day is to them. Later, they all go to the Hall of Justice in Washington, D.C. so that the proteges can be granted complete access to the Hall and officially inducted into the Justice League by Martian Manhunter and Red Tornado. The mentors prepare to step out for a discussion of the day's events, but Speedy furiously decides he has had enough with the League and media disregarding the proteges as \"sidekicks\", revealing to the other young heroes that the Hall of Justice is a front for the League's real headquarters that is in space before leaving. The young heroes are put into disbelief about the mentors keeping such things from them, and Superman contacts the mentors about a fire at Project Cadmus. Batman mentions how he always had suspicions about Cadmus, but as he considers using the opportunity to investigate it, Zatara subsequently contacts the League for their full support to help him stop Wotan from blotting out the sun. The mentors decide to let the fire department handle the fire and focus on stopping Wotan. As the mentors leave, they order the young heroes to stay put, but Robin suggests they investigate Cadmus and solve the case before the League does. They all agree and the trio sets off.\nThe three arrive at Cadmus Labs, saving the scientists from the fire and subsequently discovering an army of genetically engineered creatures used as weapons by Cadmus. They encounter Cadmus head of security Guardian, who is being mind-controlled by Cadmus' \"genomorphs\". Following a narrow escape, the three discover Project Kr, a teenage clone of Superman engineered by Cadmus and fed info by genomorphs. They are captured by Dr. Mark Desmond.\nAfterwards, Desmond contacts the Cadmus board of directors to ask what to do with the young heroes. They order him to clone them and kill the originals. Meanwhile, the young heroes are awoken by a disembodied voice to find themselves strapped in pods and the clone in a trance. The clone suddenly regains consciousness from the G-Gnomes' mind control. He explains that he is Superboy, a clone of Superman, created to either replace him if he were killed, or to kill him if he went rogue. Upon hearing this, they offer him a chance of freedom from Cadmus and to meet Superman himself. Before he could make his decision, he is mind controlled again into going back into his pod while the young heroes are subjected to the painful cloning process. Superboy overhears Aqualad telling him that he has the right to make his own choices and asks him: \"What would Superman do?\". Superboy decides to rescue them. As they make their escape, they encounter Dubbilex, who reveals he started the fire to attract the heroes and free him and the other genomorphs as well. After the G-Gnomes free Guardian of their telepathy, Desmond arrives to stop the heroes, drinking a serum known as project: Blockbuster, turning him into a powerful beast. After he knocks out Guardian, the ensuring fight between blockbuster and the young heroes reaches the surface, where they finally defeat him by causing the entire building to collapse on top of him.\nThe Justice League then arrives and meet Superboy. Superman feels uneasy around his clone, much to Superboy's disappointment, but assures him that the League will help him as they take Blockbuster to Belle Reve. Though they now have enough evidence to put Cadmus under full investigation, the mentors reprehend the young heroes for disobeying their orders, but they respond by asserting what they have done was important and convince the League to let them form a team. Three days later, with Cadmus as proof of how more organized villains are getting, Batman decides to have them work as a covert ops team with Mount Justice as their headquarters. Batman will assign them on missions, Red Tornado will be their supervisor, and Black Canary will train them. Miss Martian, Martian Manhunter's niece, also joins the group. Meanwhile, as Guardian is appointed as the new head of Cadmus, the Cadmus board of directors, known as The Light, contemplates on the young heroes destroying Cadmus and freeing Superboy.\nDevelopment\nYoung Justice is not based on the comic book series of the same name created by Todd Dezago and Todd Nauck and differs from it in some key ways. Wally West is featured as Kid Flash, rather than Bart Allen as Impulse. Dick Grayson, not Tim Drake, is also featured as Robin. The series features new versions of Aqualad and Superboy. The episode was the start of a new \"young universe\", in which Superman has only been around for about 10 years, the Justice League has existed for only 3–4 years, and Robin has been a sidekick the longest of the Young Justice team members. Executive producers Greg Weisman and Brandon Vietti said that their aim was to keep the show \"young\", \"fresh\", \"contemporary\", and \"from scratch\" from the first episode. Like other series, the first episode does not show the character's origin story, which Brett Singer of The A.V. Club said was alright except in cases that involve updated versions of characters.\nReception\nMatt of Comics Online said that the episode \"easily lives up to the high expectations and standards that we would hope to see with any DC animated project\". An IGN review gave the episode 7 out of 10 stars while complimenting the fights, visuals, and character interaction. R. J. Carter of The Trades said that the episode \"sets a lot up in terms of character relationships that will provide a ton of fodder to explore in the upcoming series\".  Chris Sims of ComicsAlliance delivered a mixed verdict that highlighted large amounts of exposition and unoriginal characters as a drawback to the fledgling series, stating that \"there was nothing in here that (isn't) done better elsewhere\".\nFor his work on the episode, character designer Phil Bourassa won an Emmy Award for Outstanding Individual Achievement in Animation in 2011.\nReferences"
    }
  ]
}