{
  "content": [
    {
      "type": "text",
      "text": "# Independence Movement (Lebanon)__disambig_1\n\n| name             = Independence Movement\n| native_name      = حركة الإستقلال\n| logo             = Independence Movement Lebanon logo.png\n| foundation       =\n| ideology         = }}\n| leader           = Michel Moawad\n| position         = Centre-right\n| national         = March 14 Alliance\n| headquarters     = Slayib, Zgharta\n| blank1_title     = Parliamentary bloc\n| blank1           = Renewal Bloc\n| seats1_title     = Parliament of Lebanon\n| seats1           = }}\n| seats2_title     = Cabinet of Lebanon\n| seats2           = }}\n| website          = [https://www.michelmoawad.com www.michelmoawad.com]\n}}\nThe Independence Movement (; Harakat Al-Istiklal or Al Haraka)  is a sovereigntist, reformist and secular centre-right political party based in Zgharta, Lebanon, founded in 2006 by Michel René Moawad, son of the assassinated Lebanese President President René Moawad and first lady Nayla Moawad; a former Member of the Lebanese Parliament.\nOrigin\nThe Independence Movement began as a grassroots initiative as part of the Cedar Revolution, before it evolved into a structured political organization that aims to defend Lebanese sovereignty, independence, democracy, state institutions, and liberties. The movement equally advocates human and economic sustainable development, reforms and modernization of state institutions, reinforcement of governmental transparency and accountability, as well as civic engagement and participation in public life.\nChronology of Main Events\nThe movement is part of the anti-Syrian Qornet Shehwan Gathering and the March 14 Alliance. In the 2005-2009 Parliamentary Elections, it had 3 Maronite MPs for the Zgharta District in the Lebanese Parliament, Nayla Moawad, Jawad Simon Boulos and Samir Frangieh. Since 2009, the movement has been led by Michel Moawad, Jawad Simon Boulos and Youssef Bahaa El Douaihy. They lost the 2009 Parliamentary Elections against Suleiman Frangieh, Jr., Minister Salim Bey Karam and Estephan El Douaihy. However, following the 2018 Lebanese Parliamentary Elections, the Independence Movement gained a seat in Parliament with the arrival of its leader Michel René Moawad; representing Zgharta District in the North III electoral sector.\nIn 2022, the Independence Movement allied with the Kataeb Party and other Anti-Hezbollah independents to form a list called 'Shamal Al Mouwajaha' to bring down Gebran Bassil's presence in the North III electoral districts.\nPresident of the Movement\nSince 2009, the movement has been led by Michel Moawad (). He is a resigned Member of the Lebanese Parliament (Parliament of Lebanon); resigned in protest following the August 4th Beirut Explosion. In May 2018, he was elected for the first time to the Lebanese Parliament representing the Zgharta District in the North-3 electoral sector. Moawad was an active member of the parliamentary budget committee and played a pivotal role in fighting corruption and exposed the illegal partisan employment in the public sector. He is the son of the former Lebanese President President René Moawad, assassinated on the 22 of November 1989.\nReferences\nExternal links\n*[https://www.michelmoawad.com Independence Movement \"Harakat Al Istiklal\" Official website]"
    }
  ]
}