{
  "content": [
    {
      "type": "text",
      "text": "# Independence Day (Mexico)\n\nIndependence Day of Mexico (Spanish: Día de la Independencia de México) is celebrated on September 16, although the main celebrations, such as Cry of Dolores (\"El Grito de Dolores\") take place on the evening of September 15. This date marks the beginning of the Mexican War of Independence in 1810, when Miguel Hidalgo y Costilla called for rebellion against the Spanish Empire. The holiday is celebrated throughout the country with patriotic celebrations, music, food, and the traditional Grito at the National Palace.\nBackground\nOn September 27, 1821, the Army of the Three Guarantees, led by Agustín de Iturbide, entered Mexico City, thus concluding the Mexican War of Independence. On September 28, Iturbide installed the Supreme Provisional Government Junta, composed of 38 people and presided over by Antonio Pérez Martínez y Robles, Bishop of Puebla de los Ángeles, and Juan José Espinosa de los Monteros and José Rafael Suárez Pereda as secretaries. The junta immediately proceeded to elect the five members of the Regency of the Empire. The Regency was composed of Iturbide, who would preside, Juan O'Donoju, Manuel de la Bárcena, José Isidro Yáñez, and Manuel Velázquez de León.\nOn October 13 of the same year, the first Political Leader of Mexico City, Ramón Gutiérrez del Mazo, ordered the publication of the proclamation with the Act of Independence for the first time so that the entire population would be aware of the great event, especially the Courts, Chiefs, Governors and other civil and military authorities, so that they in turn would have them published and circulated throughout the nation.\nContent\nOn the afternoon of September 28, the members of the Junta met at the National Palace to draft the Declaration of Independence of the newly independent nation.\nSpanish:\nTranslate English:\nNational festivities\n16 September was first celebrated in 1812 in Huichapan, Hidalgo. It was given the status of a national holiday in the Constitution of Apatzingán, ratified by the conventions of 1822 and 1824, and first celebrated nationally in 1825.\nThe Cry of Dolores has assumed an almost mythical status. Since the late 20th century, the event has come to symbolize Mexican independence and to initiate Independence Day ceremonies the following day (16 September). Independence Day in Mexico is a patriotic holiday marked by parades, concerts, patriotic programs, drum and bugle and marching band competitions, and special programs on national and local media outlets.\nPresidential celebration at Mexico City\nat the National Palace balcony during the Grito in Mexico City, 15 September 2025]]\nEvery 15 September at around 11&nbsp;p.m., the president of Mexico stands on the balcony of the National Palace in Mexico City and rings the same bell Hidalgo rang in 1810, which was moved to the National Palace. The president then recites a shout of patriotism (a Grito Mexicano) based upon the \"Grito de Dolores\", with the names of the important heroes of the Mexican War of Independence who were there on that historic day. The Grito ends with the threefold shout of ¡Viva México!\nThe Grito often differs slightly from year to year to reflect recent sentiments or a preference by the president for a shorter or longer shout. This is the version usually recited by the president of Mexico:\n;Spanish\n: ¡Mexicanos!\n: ¡Vivan los héroes que nos dieron patria!\n: ¡Viva Hidalgo!\n: ¡Viva Morelos!\n: ¡Viva Josefa Ortiz de Domínguez!\n: ¡Viva Allende!\n: ¡Vivan Aldama y Matamoros!\n: ¡Viva la independencia nacional!\n: ¡Viva México! ¡Viva México! ¡Viva México!\n; English\n: Mexicans!\n: Long live the heroes who gave us our homeland!\n: Long live Hidalgo!\n: Long live Morelos!\n: Long live Josefa Ortiz de Domínguez!\n: Long live Allende!\n: Long live Aldama and Matamoros!\n: Long live the nation's independence!\n: Long live Mexico! Long live Mexico! Long live Mexico!\nBeneath the balcony of the National Palace, there is a large crowd in the Plaza de la Constitución (also called the Zócalo) to hear the recitation. The event draws up to half a million spectators from all over Mexico and tourists worldwide. After the president recites each line beginning with \"¡Viva(n)!\", the crowd responds by repeating, \"¡Viva(n)!\"\nAfter the recitation, the president rings the bell and waves the flag of Mexico to the crowd's applause.\nThis is followed by the playing of the Mexican national anthem by a military band from the Mexican Armed Forces, with the crowd singing along. The ceremonies conclude with a spectacular fireworks display at the Zócalo grounds which are fired along traditional mexican music. In more recent years, projection mapping has also been used over the National Palace as well as over the facade of the Cathedral.\nOn the morning of 16 September, or Independence Day, the national military parade in honor of the holiday starts in the Zócalo and its outskirts, passes the Hidalgo Memorial, and ends on the Paseo de la Reforma, Mexico City's main boulevard, passing the \"Ángel de la Independencia\" memorial column and other places along the way.\nRecent exceptions\nThe Grito is not always re-enacted at the National Palace; some years, it is performed in Dolores Hidalgo, Guanajuato, where it originally happened. This is especially common in the final year of a president's term.\nPresident Felipe Calderón made an exception by re-enacting the Grito in Dolores Hidalgo as part of the bicentennial celebrations on 16 September 2010, even though he had already done so the night before from the National Palace balcony to launch the celebrations. As a result, in 2012, Calderón's final year as president, he did not go to Dolores Hidalgo but gave the Grito from the National Palace balcony instead. President Enrique Peña Nieto did not perform the Grito in Dolores Hidalgo in his six years as president, becoming the fourth president to break the tradition.\nMany presidents add their \"personal touch\" to the Grito, and this can be controversial. President Vicente Fox frequently took liberties with it, adding and removing items, addressing Mexicans of both genders, and wishing long life to \"our agreements\" in 2001. Peña Nieto gave \"vivas\" to victims of recent earthquakes in 2017.\nDuring Peña Nieto's presidency, the Grito became an occasion for political protest against him and his Institutional Revolutionary Party (PRI). On 15 September 2016, thousands of citizens marched, yelled, and carried signs. They tried to enter the Zócalo during the Grito but were blocked by a wall of soldiers. News outlets within Mexico failed to acknowledge the protest. The event was well-attended, but opponents charged that the PRI brought acarreados (poor people or hand-picked party members) as a fake show of support.\nThe Grito was also disrupted in 2006 by a demonstration called the plantón. Crowds loyal to losing candidate Andrés Manuel López Obrador protested alleged irregularities in the just-concluded general election, and the Grito could not be delivered at the Zócalo but was spoken at the National Palace. López Obrador won the presidency in 2018.\nIn 2020, the COVID-19 pandemic caused the Grito to be done remotely.\nCelebrations by governors and municipal presidents\n\" of \"¡Viva México!\" at the commencement of Independence Day festivities at 11 p.m. on 16 September 2008 in Ixmiquilpan, Hidalgo]]\nSimilar celebrations to the presidential one occur in cities and towns throughout Mexico, as well as Mexican embassies and consulates worldwide on 15 or 16 September. The chief executive, ambassador, or consul rings a bell and recites the traditional words, including the names of independence heroes and local patriots, and ends with the threefold shout of ¡Viva México! The bell rings again, the Mexican flag is waved, and everyone sings the National Anthem, followed by fireworks. There are also celebrations in schools throughout Mexico, and in these cases, whenever the bell ringing is reenacted, the school or university head utters the traditional words. Celebrations also take place outside of Mexico, such as in U.S. states that have a large concentration of people of Mexican heritage who celebrate the holiday.\nU.S. observances\n, California.]]\nAs Mexico has historically been one of the largest sources of tourism to the region, the U.S. city of Las Vegas is known for hosting cultural events—including concerts and sporting events—that appeal to Mexicans and Hispanic Americans on and around 16 September. In the United States, National Hispanic Heritage Month also begins on 15 September; the date was chosen due to its proximity to the independence day of Mexico and other Latin American countries.\nSince the early 1990s, boxing cards with main events involving top Mexican fighters have been a fixture of Independence Day weekend in Las Vegas. While U.S.-hosted fights on the weekend date back as far as the 1970s, the tradition of hosting these fights in Las Vegas was first established by Julio César Chávez and his manager Don King, who fought annually during Independence Day week from 1991 to 1995. All but one of these bouts were held in Las Vegas, with his 1993 fight against Pernell Whitaker occurring at San Antonio's Alamodome instead. The tradition was later taken up by other boxers of Mexican descent, such as Oscar De La Hoya and Canelo Álvarez. The tradition has also been extended to mixed martial arts, with UFC beginning to host a Las Vegas event on the weekend promoted as Noche UFC beginning with 2023's UFC Fight Night: Grasso vs. Shevchenko 2 (with a main event featuring the promotion's first Mexican women's champion, Alexa Grasso), and UFC 306 in 2024 (where all but one of the matches featured at least one fighter of Mexican or Mexican-American descent).\nReferences"
    }
  ]
}