{
  "content": [
    {
      "type": "text",
      "text": "# Independence Daysaster\n\n| director           = W.D. Hogan\n| starring           =\n| music              = Michael Neilson\n| country            = Canada\n| language           = English\n| executive_producer =\n| producer           = John Prince\n| editor             = Christopher A. Smith\n| cinematography     = Michael C. Blundell\n| runtime            = 90 minutes\n| company            =\n| network            = Syfy\n| released           =\n}}\nIndependence Daysaster is a 2013 Canadian science fiction action television film directed by W. D. Hogan and stars Ryan Merriman and Tom Everett Scott. The film premiered on June 27, 2013, on Syfy and was released on DVD on May 27, 2014. The film is a mockbuster of the 1996 film Independence Day.\nPlot\nIn Moose Ridge, Oregon, Andrew Garsette, his two friends, Nick and Eliza, and his uncle Pete, a local firefighter, prepare to meet Andrew's father and Pete's brother, U.S. President Sam Garsette, who is coming home for the Fourth of July celebrations. Sam approaches on Marine One, but it is unexpectedly rerouted to nearby Dixon Airbase. Meanwhile, SETI scientist Celia Layman is informed of a mysterious signal heading somewhere and being sent back.\nSuddenly, alien machines begin drilling through the surface from underground, and more alien machines shoot from the sky; both types of machine appear in various locations around the world. Pete convinces Secret Service agents to take the children away while he attempts to help the townspeople. He finds Celia broken down on the side of the road and reluctantly agrees to take her into the town, but finds it destroyed and proposes heading to Dixon. Sam orders Vice President Dennis Brubaker and General Moore not to engage the ships without intel. However, Marine One is hit and crashes, leading Brubaker to presume Sam dead as he and Moore escape Washington, D.C. before it is destroyed.\nBrubaker and Moore arrive at Dixon Airbase, where Brubaker is forced to take over the presidency. With the reluctant approval of base officer Spears, Brubaker authorizes an Air Force counterattack. Meanwhile, the Secret Service convoy is hit; the agents are killed and Nick is injured. Andrew, Eliza and Nick reunite with Pete and Celia; they witness a dogfight between aliens and fighter jets. The jets are easily decimated, whereas Pete manages to down one drone with Celia's phonon-emitting device. They reach Dixon and attempt to get help, but when a large ship emerges, Nick is abducted and presumably killed. Pete and Celia discover that the device disables the aliens by disabling their connection with the alien mothership. They collect an alien battery, and witness more drones bringing wreckages back to the mothership. When another wave of aliens attacks them, the device, given more power by the battery, downs all of them with one pulse.\nHaving survived his crash, Sam encounters Todd, a computer genius, who manages to contact Dixon with the help of his friend Leni, confirming Sam's survival to Brubaker, who reveals that the base's scientists have discovered the alien mothership near the Moon. Sam again refuses to order an attack on it; the connection is disabled, and Brubaker authorizes a nuclear missile strike on the ship. However, the drones surrounding the ship intercept all the missiles. Moore realises that the drilling machines are emitting a gas that is fundamentally changing Earth's atmosphere; Earth will become uninhabitable to human life in days.\nSam is found by Pete's group, and they devise a plan to defeat the aliens by letting a drone take the device up to the mothership and activate it with a satellite signal, disabling all the drones' connections. Sam then contacts Spears, as Dixon is attacked, ordering another missile strike, but Spears tells Sam that missiles can now only be launched from the silos directly, before she, Moore and Brubaker are killed.  En route to a nearby satellite base, they are attacked again. Celia sacrifices herself, allowing the drone to take the device to the ship. Sam contacts a team of Army Rangers and orders them to launch the missiles. As the missiles are launched, Andrew, Eliza, Todd and Leni attempt to send the signal, but it is cut by another alien ambush. Pete manages to destroy it by igniting his truck's fuel with a Roman candle and repair the lines, allowing the kids to resend the signal. When the missiles approach the ship, most of them are again intercepted by drones, but the remaining ones are disabled when the signal successfully activates the device, allowing one missile to reach and destroy the ship. The ship's destruction resembles a giant firework explosion.\nThe film ends with a larger alien fleet approaching Earth.\nCast\n* Ryan Merriman as Pete Garsette\n* Andrea Brooks as Eliza\n* Emily Holmes as Celia Leyman\n* Keenan Tracey as Andrew Garsette\n* Garwin Sanford as Dennis Brubaker\n* Michael Kopsa as General Moore\n* Jill Teed as Spears\n* Tom Everett Scott as Sam Garsette\nReferences\nExternal links\n*\n*"
    }
  ]
}