{
  "content": [
    {
      "type": "text",
      "text": "# Independence of Trujillo\n\n–\n|location          = Intendancy of Trujillo\n|participants      =\n}}\nThe Independence of Trujillo refers to the historical events of 1820 and 1821 that led to the independence of the Intendancy of Trujillo, located in the northern coast of what was then the Viceroyalty of Peru, from the Spanish Empire during the Peruvian War of Independence.\nHistory\nCommunication with San Martin\nAfter General Jose de San Martin landed in Paracas Bay in September 1820, the Mayor José Bernardo de Tagle received a letter from San Martin dated November 20, 1820, inviting them to join the independence movement. Tagle agreed to join, knowing the people of Trujillo wanted to be independent.\nTrujillo was the first city in Peru to gain independence from Spain. The events which led to independence took place between 24 December 1820 and 6 January 1821.\nOn December 24, 1820, at a town meeting, those present unanimously agreed to declare the city's independence within days. They then made the flag of Peru that was veiled with a guard of honor on the night of 28 December 1820.\nTrujillo: First Independent City of Peru\n; it currently houses cultural exhibitions and a museum.]]\nTrujillo is considered the \"First City Independent of Peru\" because its inhabitants were the first to proclaim their intentions for independence, holding a ceremony on December 24, 1820 at the historical \"Casa de la Emancipación\", and they were also the first to sign the declaration of independence that took place in the chapel of the college \"Seminario de San Carlos y San Marcelo\" and they proclaimed independence to an open council meeting in the \"Plaza de Armas\" (main square) located in the Historic Centre of Trujillo, on December 29, 1820.  According to the  \"Libro rojo\" of the Trujillo council, containing the records between 1820 and 1823, on January 6, 1821, they signed the declaration and proclaimed the city independent. Trujillo, which included what is now Tumbes, Piura, Lambayeque, La Libertad, Cajamarca, San Martín and Amazonas - almost all of northern Peru, was henceforth released from Spanish rule.\nAccording to the Trujillan Historian, Alberto Pinillos Rodríguez, Don José Bernardo de Tagle proclaimed independence to his people, with the following speech: \"My people. ...From this moment on, by a unanimous decision, Trujillo is Free. I put our fate and that of people under the protection of Heaven Long live the homeland! Long live independence!  of Historic Centre, on December 29, 1820, the independence of Trujillo was proclaimed by the Marquis of Torre Tagle. In honour of the city, the Freedom Monument was made by sculptor Edmund Moeller]]\nIndependence day\nThe Independence Day of Trujillo is celebrated every year on December 29, in the city is commemorated as a civic date. The day is declared a holiday for the whole province and the festivities take place including numerous cultural events and ceremonies.\nSee also\n*Trujillo\n*Historic Centre of Trujillo\n*Plaza de Armas of Trujillo\nReferences\nExternal links\n*[https://archive.today/20130113154711/http://www.perubicentenario.pe/noticias/diciembre2011/29dic_Trujillo_celebra_191_Aniversario_del_primer_grito_de_libertad.html Trujillo celebrates first shout of Freedom]"
    }
  ]
}