{
  "content": [
    {
      "type": "text",
      "text": "# Independence, Virginia\n\n|area_magnitude           =\n|area_total_sq_mi         = 2.35\n|area_land_sq_mi          = 2.34\n|area_water_sq_mi         = 0.00\n|population_as_of         = 2020\n|population_footnotes     =\n|population_total         = 1001\n|population_density_sq_mi = 380.71\n|timezone                 = Eastern (EST)\n|utc_offset               = -5\n|timezone_DST             = EDT\n|utc_offset_DST           = -4\n|elevation_footnotes      =\n|elevation_ft             = 2680\n|coordinates              =\n|postal_code_type         = ZIP code\n|postal_code              = 24348\n|area_code                = 276\n|blank_name               = FIPS code\n|blank_info               = 51-39528\n|blank1_name              = GNIS feature ID\n|blank1_info              = 1498495\n|website                  =\n|footnotes                =\n|pop_est_as_of = 2021\n|pop_est_footnotes =\n|population_est = 1002\n|area_total_km2 = 6.08\n|area_land_km2 = 6.07\n|area_water_km2 = 0.01\n|population_density_km2 = 147.00\n}}\nIndependence is a town located in, and the county seat of, Grayson County, Virginia, United States. At the 2020 U.S. census, it had a population of 1,001. It is situated on Virginia's Crooked Road, a heritage trail celebrating the musical heritage of Southwest Virginia.\nThe town and county are noted for the original red brick 1908 Courthouse at the corner of Main Street (Virginia Route 58) and Independence Avenue (US 21), site of the annual July 4th Celebration and autumn Mountain Foliage Festival.\nIn 2021, the town created its first public park in its 115-year history, Town Park, on vacant property opposite the original Courthouse.\nTown park is home to the Independence Farmers Market, which opens weekly from May–October and online year-round. The market uses a timber-frame, white oak, pavilion completed in 2021 in collaboration with the Timber Framers Guild. Remaining work includes bathrooms, utilities and sitework &mdash; as well as a stage. The stage hosts Farmers Market as well as Crooked Road events and is named the Uncle Wade Old Time Stage, after noted musician and Independence native, Wade Ward.\nHistory\nThe Brookside Farm and Mill and the original Grayson County Courthouse are listed on the National Register of Historic Places.\nThe Courthouse features a Richardsonian style by noted architect Frank Pierce Milburn following his designs Wise County, Virginia, and Forsyth County, North Carolina, and the Southern Railway Station in Knoxville, Tennessee. The design features corbeled brackets and a Flemish gable between octagonal corner towers with roof element. A horizontal course and a cornice wrap the building to a central portico. Some brick from an 1863 courthouse previously occupying the site was re-used as fill inside the walls, with remaining brick arriving from Maysville, Kentucky, rail-shipped to Fries, Virginia, and delivered by ox drawn wagon to Independence. Office furniture was purchased from Richmond. To safely store county documents &mdash;  birth, marriage, property, and death records &mdash; the building included a state-mandated fireproof vault.\nThe county constructed a new courthouse in the 1970s, and the 1908 building was nearly razed after left vacant in 1981, badly in disrepair. Rescued by citizens groups &mdash; Grayson County Historical Society and a grass-roots group, People and the Courthouse (PATCH) &mdash; and restored. A local businessman, Dan Doyle Baldwin (1933–1994, CEO of Nautilus Fitness) purchased and restored the building, in turn donating it on July 4, 1986, to Grayson County and forming the  Historic 1908 Courthouse Foundation. The courthouse now serves as the Grayson County Art & Cultural Center. The Grayson Crossroads Museum is now located on the first floor in what was the Clerk's Vault Room and the building accommodates special events and community activities. Open to the public, the Baldwin Auditorium occupies the former courtroom. The 1908 Courthouse is now featured prominently on the Grayson County logo. A carrara marble Confederate Monument, titled “Parade Rest”, was dedicated in 1911, remaining in place as of 2022.\nFrom the 1970s to the 1990s, Independence was home to the Nautilus Fitness manufacturing plant and warehouse at a 56-acre site 709 Powerhouse Road, reaching a peak of 600 employees in 1984. One of Grayson County's major industries, Nautilus was sold to Bowflex in 1997. The plant remains, currently owned by Medfit Systems.\nGeography\nIndependence is located at  (36.622906, -81.151735).\nAccording to the United States Census Bureau, the town has a total area of 2.3&nbsp;square miles (6.1&nbsp;km2), all land.\nClimate\nThe climate in Independence has mild differences between highs and lows, and there is adequate rainfall year-round. According to the Köppen Climate Classification system, Independence has a marine west coast climate, abbreviated \"Cfb\" on climate maps.\nDemographics\n}}\nAt the 2000 census there were 971 people, 426 households, and 226 families in the town. The population density was 415.1 people per square mile (160.2/km2). There were 497 housing units at an average density of 212.5 per square mile (82.0/km2). The racial makeup of the town was 90.73% White, 6.80% African American, 1.24% from other races, and 1.24% from two or more races. Hispanic or Latino of any race were 2.68%.\nOf the 426 households 19.2% had children under the age of 18 living with them, 39.9% were married couples living together, 8.2% had a female householder with no husband present, and 46.9% were non-families. 44.6% of households were one person and 27.5% were one person aged 65 or older. The average household size was 1.98 and the average family size was 2.73.\nThe age distribution was 14.4% under the age of 18, 7.1% from 18 to 24, 21.1% from 25 to 44, 22.7% from 45 to 64, and 34.7% 65 or older. The median age was 51 years. For every 100 females there were 81.5 males. For every 100 females age 18 and over, there were 82.2 males.\nThe median household income was $18,264 and the median family income  was $30,441. Males had a median income of $21,058 versus $16,705 for females. The per capita income for the town was $16,137. About 10.5% of families and 19.5% of the population were below the poverty line, including 29.7% of those under age 18 and 16.2% of those age 65 or over.\nReferences\nFurther reading\n*\nExternal links\n* [http://www.independenceva.com Town website]"
    }
  ]
}