{
  "content": [
    {
      "type": "text",
      "text": "# Independence Medal (Lithuania)\n\nIn Lithuania, the Independence Medal () is a state medal of Lithuania, awarded for the contributions in the restoration of the independence of the state. The medal had two issues in 1928 and 2000. Both times it was issued to commemorate the 10th anniversary of Lithuania's independence.\n1928 issue\n, by Zikaras, seen on the obverse of the medal]]\nThe medal was issued to commemorate the 10th anniversary of the republic to persons \"for [their] contributions to the re-establishment and strengthening of the independence of Lithuania in 1919–1928\".\nIt was designed by sculptor Juozas Zikaras. The obverse depicts Freedom Monument which was unveiled in 1928 in Kaunas and also designed by Zikaras. It depicts a winged female figure raising a flag in one hand and holding broken chains in another. The medals were manufactured by Huguenin Frères from Le Locle, Switzerland. It is made from bronze and measures  in diameter. The reverse has an inscription in all uppercase Per amžius / budėję-laisvę / laimėjom / per aukas ir / pasišventimą / 1918-1928 (Through the ages on guard, we have won freedom through sacrifices and dedication 1918–1928). The ribbon has three vertical black-yellow-black stripes.\nThe awardee categories included:\n*Lithuanian book smugglers, who smuggled Lithuanian language books during the Lithuanian press ban (1864–1904)\n*participants in the Lithuanian Wars of Independence (1918–1920)\n*participants in the Klaipėda Revolt (1923)\n*riflemen and persons who had joined the public service in the early days of independence (1918–1919)\n*Knights of the Cross of Vytis.\nDuring 1928–1940, more than 44,000 Lithuanian citizens and foreign nationals were awarded the medal.\n2000 issue\nThe medal was awarded to persons \"for distinction in the cause of restoration and consolidation of the Independent State of Lithuania during the period from 1990 to 2000\". The medal is identical to the interwar medal except the dates \"1918–1928\" on the reverse were replaced with \"1990–2000\".\nThe medal was reestablished on July 1, 2000 and awarded to 384 people. The award ceremony was held on July 6, 2000, the Statehood Day of Lithuania. It has not been awarded since.\nThe awardee categories included:\n*participants of armed and unarmed resistance\n*volunteer militia (e.g. members of the Lithuanian National Defence Volunteer Forces)\n*publishers of the Chronicle of the Lithuanian Catholic Church\n*founders of the\n*members of the Lithuanian Helsinki Group\n*members of the national rebirth movement \"Sąjūdis\"\n*members of the Reconstituent Seimas\n*signatories of the Act of the Re-Establishment of the State of Lithuania\nReferences"
    }
  ]
}