{
  "content": [
    {
      "type": "text",
      "text": "# Independence Party of Alberta\n\n| chairman         =\n| chairperson      =\n| spokesperson     =\n| leader1_title    =\n| leader1_name     =\n| founder          = Cory Morgan\n| foundation       =  (first iteration)2017 (second iteration)\n| dissolution      = 2001 (first iteration)\n| registered       = March 20, 2019\n| merger           =\n| split            =\n| predecessor      =\n| merged           =\n| successor        =\n| headquarters     = 4706 51 Street Olds, AB T4H 1E7\n| ideology         =\n| position         =\n| national         =\n| international    =\n| student_wing     =\n| youth_wing       =\n| membership       =\n| membership_year  =\n| colours          =\n| colors           =\n| colorcode        =\n| seats1_title     = Seats in the House of Commons\n| seats1           =\n| seats2_title     = Seats in the Senate\n| seats2           =\n| seats3_title     = Seats in Legislature\n| seats3           = }}\n| website          = https://tipalberta.com/\n| country          = Canada\n| state            = Alberta\n| parties_dab1     = List of political parties in Alberta\n| elections_dab1   = List of Alberta general elections\n| footnotes        =\n}}\nThe Independence Party (TIP), also known as the Alberta Independence Party from 2001 to 2019 and the Independence Party of Alberta after 2019, is an Albertan provincial political party.\nHistory\nPrevious Party\nDuring the 1989 Alberta general election, the \"Alberta Independence Party\" was a registered political party with Elections Alberta, however, they did not run any candidates.\nFirst Iteration\nThe Alberta Independence Party was founded in 2000 by Cory Morgan, who served as the first leader of the party. The party held its founding convention in January 2001, ahead of the general election.\nThe party was originally dedicated to increasing the autonomy of Alberta within the Canadian confederation, partly as a response to the failure of the Canadian Alliance to gain traction outside Western Canada in the 2000 Canadian election.\nOne of the party's first challenges was to gather enough signatures to qualify as an official party in Alberta, which it failed to do. In light of this development, its fourteen candidates were forced to stand as independents in the 2001 Alberta general election. All of their candidates were unsuccessful.\nIn October 2001, at the party's annual general meeting, members voted to make Albertan separation from Canada a primary goal of the party. Ultimately, the party ended up disbanding before the end of that year.\nSecond Iteration\nThe Alberta Independence Party re-formed in late 2017 after Dave Bjorkman contacted the original party founder, Cory Morgan, seeking permission to use the party name. Bjorkman became interim party leader in early 2018. Bjorkman opposed Alberta's Bill 24 in November 2017, citing fears that the law would encourage keeping secrets from parents and saying that he supports the LGBT+ community and parental involvement in the Alberta school system.\nThe AIP officially registered with Elections Alberta as a political party on March 20, 2019. They fielded 63 candidates in the 2019 Alberta general election, winning no seats. After the election, Bjorkman resigned as party leader in July 2019.\nOn October 29, 2019, the party changed its name to the Independence Party of Alberta.\nDave Campbell was elected party leader in the spring of 2020.\nOn September 12, 2021, Vicky Bayford was voted in as the new leader.\nOn September 10, 2022, street preacher Artur Pawlowski became the leader of the party, winning a leadership contest. He was removed as leader six months later and the party leadership was vacant during the 2023 election.\nOn October 3, 2023, lawyer Katherine Kowalchuk was named the interim leader. She was briefly nominated as the Liberal Party of Canada candidate for Calgary Signal Hill in 2015 before withdrawing as the candidate three months before the election. In the 2023 election, she was the best-performing candidate for the party, receiving 4.71% of the vote in Olds-Didsbury-Three Hills. On January 31, 2024, Kowalchuk resigned as interim leader.\nIn May 2025, the Independence Party and the Republican Party of Alberta signed a memorandum of understanding, which sought to advance and unify the independence movement in Alberta. The parties worked together to select candidates who ran under the Republican banner in the 2025 Alberta provincial by-elections.\nOn July 31, 2025, party president Ron Robertson was appointed as the interim leader.\nLeaders\n{| class=\"wikitable\"\n|+\n!Leader\n! colspan=\"2\" |Term of office\n!Notes\n|-\n|Cory Morgan\n|2000\n|2001\n|\n|-\n|Dave Bjorkman\n|2018\n|July 2019\n|Interim\n|-\n|Dave Campbell\n|2020\n|2021\n|\n|-\n|Vicky Bayford\n|September 12, 2021\n|September 10, 2022\n|\n|-\n|Artur Pawlowski\n|September 10, 2022\n|March 28, 2023\n|\n|-\n|Katherine Kowalchuk\n|October 3, 2023\n|January 31, 2024\n|Interim\n|-\n|Ron Robertson\n|July 31, 2025\n|present\n|Interim\n|}\nElection results\nIn the 2001 election, the party was not registered. Candidates for the party ran as independents. Affiliated independent candidates received a total of 7,521 votes in the 2001 election:\n#Bradley R. Lang (Calgary-Egmont) 399 (2.90 percent)\n#Tom Humble (Airdrie-Rocky View) 683 (4.10 percent)\n#Cory Morgan (Banff-Cochrane) 538 (four percent)\n#Darren Popik (Calgary Shaw) 151 (0.60 percent)\n#Douglas R. Chitwood (Lacombe-Stettler) 554 (4.70 percent)\n#Eileen Walker (Drumheller-Chinook) 819 (8.90 percent)\n#Ron (Earl) Miller (Dunvegan) 248 (2.8 percent)\n#Dennis Young (Grande Prairie-Smoky) 380 (4.1 percent)\n#Jon Koch (Little Bow) 885 (8.3 percent)\n#Charles Park (Ponoka-Rimbey) 764 (8.1 percent)\n#Ryan Lamarche (Red Deer-South) 203 (1.6 percent)\n#Christopher Sutherland (Strathmore-Brooks) 511 (4.5 percent)\n#Jeff Newland (Wainwright) 868 (eight percent)\n#Ben Lussier (Wetaskiwin-Camrose) 382 (three percent)\nLussier began his candidacy with an AIP endorsement, which was withdrawn during the campaign.\n{| class=\"wikitable\" style=\"text-align: left;\"\n|-\n!Election\n!Leader\n!Candidates\n!Votes\n!%\n!Seats\n!+/-\n!Place\n!Position\n|-\n!2019\n|Dave Bjorkman\n|}}\n| 13,481\n| 0.72%\n|}}\n|\n|5th\n|\n|-\n!2023\n|Vacant\n|}}\n| 5,045\n| 0.29%\n|}}\n| 0\n| 5th\n|\n|}\nBy-elections\n{|class=\"wikitable\"\n|-\n!By-election\n!Date\n!Candidate\n!Votes\n!%\n!Place\n|-\n|Fort McMurray-Lac La Biche\n|March 15, 2022\n|Steven Mellott\n| style=\"text-align:center;\"|24\n| style=\"text-align:center;\"|0.41%\n| style=\"text-align:center;\"|8/8\n|-\n|Brooks-Medicine Hat\n|November 8, 2022\n|Bob Blayone\n| style=\"text-align:center;\"|225\n| style=\"text-align:center;\"|1.77%\n| style=\"text-align:center;\"|4/5\n|}\nSee also\n* Alberta separatism\n* Movements for the annexation of Canada to the United States\n* List of political parties in Alberta\n* Politics of Alberta\n* Secessionist movements of Canada\n* Western alienation\n* Western Canada Concept\nReferences"
    }
  ]
}