{
  "content": [
    {
      "type": "text",
      "text": "# Indiana State Awards\n\nThe Governor of the U.S. state of Indiana can bestow five types of awards: the Sagamore of the Wabash, the Circle of Corydon, the Distinguished Hoosier, the Honorary Hoosier, and the Sachem Award. Given at the Governor's discretion, these awards celebrate individuals who have significantly impacted their communities or the state at large. The Sachem Award stands as the state's highest honor and is granted only once a year. An additional award that has been given in the past was the Governor's Heroism Award.\nSagamore of the Wabash\nThe Sagamore of the Wabash is an award of the U.S. state of Indiana created in the 1940s by Governor Ralph F. Gates when the Governor of Kentucky bestowed on him the Kentucky Colonel award and Governor Gates decided that the Hoosier State should have a similar recognition. The term \"sagamore\" was used by the Algonquian-speaking American Indian to describe a lower chief or a leader among the tribe to whom the true chief would look for advice and wisdom. The Wabash is the \"State River\" of Indiana and major tributary of the Ohio River.\nThe Sagamore is the highest honor the Governor regularly bestows on individuals, and each Governor issues the award in his own way. The Governor reserves the Sagamore for those who have gone \"above and beyond\" and contributed to their communities or to the State in an extraordinary manner. Anyone may make a nomination for the Sagamore, but the Governor issues only a very limited number each year, in their judgment and discretion.\nAmong those who have received Sagamores have been astronauts, presidents, ambassadors, artists, musicians, politicians and citizens who have contributed greatly to Hoosier heritage. There is no official record of the total number presented, as each governor has kept his own roll, just as each has reserved the right to personally select the recipients. Some individuals have received the award more than once; for example, current Indiana Governor Eric Holcomb has received the award twice and Indiana University chancellor Herman B Wells was honored six times.\nRecipients of the Sagamore of the Wabash Award\nThe Sagamore of the Wabash Award does not have an official list of the number of Sagamore of the Wabash awards presented, but several notable individuals have received the award:\n*Ryan White, 1987 by Gov. Robert Orr; American teenager from Kokomo, Indiana, who became a national poster child for HIV/AIDS in the United States\n*John Gregg, 1989, 1996, 2002 and 2003 Democratic Speaker of the Indiana House from 1996 to 2003\n*Tommy John, 1989 by Gov. Evan Bayh, 288-game winner in Major League Baseball and first pitcher to have Tommy John surgery\n*John Morton-Finney, 1990 by Gov. Evan Bayh\n*Bob Kevoian and Tom Griswold, 1994 and 2008\n*Patricia Roy, 1994 by Governor Evan Bayh; Indiana High School Athletics Association, Assistant Commissioner.\n*Arie Luyendyk, 1999 by Gov. Frank O’Bannon; 1990 and 1997 Indianapolis 500 winner\n*Bob Chase, 2001 by Gov. Frank O'Bannon; Fort Wayne Komets play-by-play broadcaster.\n*Mir Masoom Ali, 2002 by Gov. Frank O'Bannon; Ball State University George and Frances Ball Distinguished Professor Emeritus of Statistics\n*Dorothy Runk Mennen, 2003; author and academic.\n*Thomas McDermott Jr., 2005; Democratic Mayor of Hammond, Indiana (2004–Present)\n*Mike Delph, January 2005; Indiana State Senator (December 2005 – 2018)\n*Martin C. Jischke, 2007 by Governor Mitch Daniels; 10th president of Purdue University (2000–2007)\n*David Letterman, 2007 by Gov. Mitch Daniels; comedian and television host\n*Jeff Gordon, 2015 by Governor Mike Pence, 1994, 1998, 2001, 2004, 2014 Brickyard 400 Winner\n*Donald Davidson, 2016 by Governor Mike Pence, chief historian of the Indianapolis Motor Speedway and host of The talk of Gasoline Alley.\n*Seema Verma, 2016 by Governor Mike Pence\n*Adam Vinatieri, 2017 by Governor Eric Holcomb; placekicker for the Indianapolis Colts (2006–2019)\n*John Stehr, 2018 by Governor Eric Holcomb; retired television journalist, anchor for WTHR in Indianapolis (1995–2019)\n*Robin Miller, 2021 by Governor Eric Holcomb; motorsports journalist.\nContents of the award\nWhen a Sagamore of the Wabash is given to a recipient it is accompanied by other artifacts. It's uncertain if the contents of the award vary by year or by recipient. The gallery below shows the contents of a specific award given on January 9, 2005.\nFile:Sagamore of the Wabash - Folder.jpg|Folder\nFile:Sagamore of the Wabash - Definition Letter.jpg|Definition Letter\nFile:Sagamore of the Wabash - Certificate Letter.jpg|Certificate Letter\nFile:Sagamore of the Wabash - Lapel Pin.jpg|Lapel Pin\nCircle of Corydon\nThe Circle of Corydon was created by Governor Holcomb to honor Hoosiers together with the recipient's State Representative or Senator. The Circle is the only award issued and signed jointly by members of both the Executive and\nLegislative branches. The award's name pays tribute to the Town of Corydon, which played a pivotal role in Indiana's history as the first State Capital where state founders drafted Indiana's first Constitution.\nThe Circle is meant for those who, like the State's founders, have made remarkable contributions that have bettered Indiana, and who have demonstrated the qualities exemplified by the state's greatest citizens. Only members of the General Assembly may make a nomination for the Circle. Annually, each Representative and Senator may nominate two constituents, and the Speaker of the House, President Pro Tempore, and Minority Leaders may each nominate five individuals statewide.\nDistinguished Hoosier\nThe Distinguished Hoosier has been awarded by Governors for more than fifty years to recognize outstanding Indiana residents. The Distinguished Hoosier is meant for those who distinguish themselves by significant contributions to their communities, and whose qualities and actions endear them in the hearts and minds of Hoosiers. Anyone may make a nomination for the Distinguished Hoosier, and members of the General Assembly may make five nominations each year. The Governor issues the award in his judgment and discretion.\nHonorary Hoosier\nThe Honorary Hoosier is similar to the Distinguished Hoosier, though it is meant for those not from Indiana who have made outstanding contributions to our State. Anyone may make a nomination for the Honorary Hoosier, and the Governor\nissues the award in his judgment and discretion.\nSachem Award\nIn 2005, Governor Mitch Daniels designated another state honor, named the Sachem Award.  He determined it would be awarded to only one person each year. It is Indiana's highest honor, and a plaque listing recipients is posted on the first floor of the Indiana Statehouse.\n* 2005: John Wooden, former Purdue University basketball player and college coach\n* 2006: Theodore Hesburgh, former president of the University of Notre Dame\n* 2007: Jane Blaffer Owen, in recognition of her philanthropic efforts in historic preservation and the arts\n* 2008: Bill Gaither and Gloria Gaither, musicians\n* 2009: Donald C. Danielson, New Castle business and civic leader\n* 2010: Carl Erskine, former Brooklyn and Los Angeles Dodgers baseball player\n* 2011: William A. Cook, entrepreneur, philanthropist and historic preservationist, co-founded the medical equipment manufacturer Cook Group\n* 2012: Ian M. Rolland, former chairman and CEO of Lincoln National Corp.\n* 2013: Don Wolf, former president and CEO of Do It Best Corporation based in Fort Wayne, Indiana\n* 2014: P. E. McAllister, President of MacAllister Machinery and former chairman of the Indianapolis Capital Improvements Board\n* 2015: Amos Brown, a radio broadcaster who was a fierce defender and leader in the African-American community of Indianapolis\n* 2016: No recipient chosen.\n* 2017: Eva Mozes Kor, Holocaust survivor and founder of CANDLES Holocaust Museum and Education Center\n* 2018: Sammy L. Davis, Vietnam veteran and recipient of the Medal of Honor\n* 2019: George Rapp, orthopedic surgeon and pioneering inventor of hip prostheses\n* 2020: Reginald O. Jones Sr., Hoosier businessman, community leader and mentor\n* 2021: James T. Morris, civic leader, global ambassador, and advocate for youth\n* 2022: Patricia Ann Koch, former co-operator of Holiday World and founder of the Santa Claus Museum\n* 2023: Albert Chen, founder and executive chairman of the board of Telamon Corp.\nGovernor's Heroism Award\nIn 2008, Governor Mitch Daniels designated another state honor, named the Governor's Heroism Award.  He determined it would be awarded to only those persons that had shown exceptional heroic conduct especially as exhibited in fulfilling a high purpose or attaining a noble end.\nRecipients of the award;\n*2008 - Curtis M. Jones (Mike) - Chief Deputy of the Swayzee Police Department for saving three children from a fully engulfed house fire.\n*2009 - Mike Hubert - Maintenance at Branchville Correctional Facility for injuries sustained in a prison escape.\n*2009 - Robert Skaggs and Lonnie Hood for rescuing a semi truck driver from a burning propane tanker before it exploded.\n*2010 - Nolan Sturch and Michael Brooks for pulling a driver from a burning vehicle.\nSee also\n*Great Floridians\n*Kentucky Colonel\n*Nebraska Admiral\n*Rhode Island Commodore\n*Order of the Long Leaf Pine\n*Order of the Palmetto\n*Arkansas Traveler (honorary title)\nReferences"
    }
  ]
}