{
  "content": [
    {
      "type": "text",
      "text": "# Indian Battle Park\n\n| area             =\n| elevation        =\n| authorized       =\n| created          =\n| established      =\n| opened           = 1960\n| founder          =\n| designer         =\n| etymology        = Named after Battle of the Belly River\n| owner            = City of Lethbridge\n| administrator    =\n| manager          =\n| operator         =\n| open             =\n| status           =\n| awards           =\n| camp_sites       =\n| hiking_trails    =\n| paths            =\n| terrain          =\n| designation      =\n| facilities       =\n| website          =\n}}\nIndian Battle Park is a park located in the Oldman River valley urban park system of Lethbridge, Alberta. The park is home to Fort Whoop-Up, Helen Schuler Nature Centre and the High Level Bridge.\nDescription\nThe  park is located on the east bank of the Oldman River just below Downtown Lethbridge. It is bordered by Whoop-Up Drive to the south and Highway 3 to the north.\nActivities\nActivities in the park include hiking, dog walking, biking, fishing, canoeing, picnicking. Amenities at the park include public washrooms, paved trails, picnic tables, and a playground.\nHistory\nThe area that would later become the park was known as Company Bottom, due to its proximity to the former hamlet of Coalbanks, which was a company town that featured a brewery, cemetery, a company store, cabins, and a well. The park is named after the Battle of the Belly River which happened on 24 October 1870 between the Blackfoot and the Cree at a site on the Oldman River southwest of Lethbridge. A formal peace treaty between the two nations was reached in 1871. Due to repeated floods throughout the 20th century (14 in total), people stopped living in the river valley and moved to the area above the valley, where most of Lethbridge is located today. The park was created in the 1960s, a decade after the last houses were moved from the river valley.  In 1966, the Kinsmen Club built a replica of Fort Whoop-Up in Indian Battle Park, the original fort was actually located at the confluence of Oldman and St Mary Rivers south of the city. The Helen Schuler Nature Centre was opened in 1982. In 2005, a city council bid to rename the park Valley Of Peace (to remove negative references to First Nations) was rejected.\nFauna and Flora\nCommon birds in the park include Ring-necked pheasant, Great horned owl, Cooper's hawk, Black-capped chickadee, Grey catbird, White-breasted nuthatch, Common merganser, and Mallard. Mammals in the park include Mountain cottontail, North American porcupine, White-tailed deer, Long-tailed weasel, and Common raccoon. The trees in the park are mainly Eastern cottonwood, with some Manitoba maple. Fishing is a popular activity in the park, with fish found in its section of the Oldman river including Rainbow trout, Mooneye, Goldeye, Burbot, and Shorthead redhorse.\nExternal links\n*[https://www.lethbridge.ca/Things-To-Do/Parks/Pages/Indian-Battle-Park.aspx Indian Battle Park]  at City of Lethbridge\nReferences"
    }
  ]
}