{
  "content": [
    {
      "type": "text",
      "text": "# Indira Priyadarshini Vrikshamitra Awards\n\nIndira Priyadarshini Vriksha Mitra Awards or IPVM Awards are given by Ministry of Environment and Forests of Government of India to individuals and institutions who have done pioneering and exemplary work in the field of afforestation and wasteland development. A cash award of Rupees Two lakh fifty thousand is presented to individuals/institutions in seven categories. It was instituted in 1986 and were given annually. Initially, IPVM awards were given in twelve categories till 2006. But as per 2012 notification of Ministry of Environment and Forests Seven Categories are approved for IPVM Awards.\nCriteria\nAs per the Press Information Bureau of Government of India the activities deciding the awards are\nestablishing decentralized nurseries; tree planting on wastelands/farm land; awareness- raising, motivations and extension work; involving the rural poor/ tribal / cooperatives in Afforestation and tree planting; setting up grass-roots level institutions like the Tree Growers’ Cooperative; and social fencing of community woodlots and pasture lands.\nCategories\n# Individual-Forest Officers\n# Individual-Other than Forest Officers\n# Institutions/Organisations under Government\n# Joint Forest Management Committees ( six awards region-wise)\n# Non-profit making Voluntary Organisations (NGOs)\n# Corporate Sector (Private/Public Sector Agencies)\n# Eco-Clubs at School Level (covered under National Green Corps Programme of the Ministry of Environment and Forests)\nRecipients\nGAURA DEVI (1925 - 1991) is the first recipient of Indira Priyadarshini Vriksha Mitra (IPVM) Award in 1986.\n{| class=\"wikitable sortable\"\n|-\n! Year !! Name of Institution or Individual !! Category!! State\n|-\n|1986\n|Gaura Devi\n|Activist\n|Uttar Pradesh\n|-\n|1987\n|Shri Rakesh Kala\n|Individual including government servant\n|Uttar Pradesh\n|-\n| 1991 || Shri Om Prakash Agrawal ||Individual || Chhattisgarh\n|-\n| 2000 || Shri Rongura Hrahsel ||Individual Forest Officer || Mizoram\n|-\n| 2003 || Smt Kollakal Devakiyamma ||Individual including Government Servant || Keralam\n|-\n| 2006 || Shri U. Veerakumar ||Individual including government servant || Tamil Nadu\n|-\n| 2006||Social Forestry Division, Junagarh||Institutions / Organization under Government||Odisha\n|-\n| 2006|| woman self-help groups within Binodpur Baikunthapur forests protection committee under Raidighi range of 24-Parganas(south ) Division||Joint Forest Management Committee || West Bengal\n|-\n|2006||The Jalgrahan Institution, Sattu, located in village panchayat Bhojato ka Oda, Dungarpur||Non Government Institution/ Organisation||Rajasthan\n|-\n|2007||B.B Limbasiya ||Individual including Government Servant|| Gujarat\n|-\n|2007||Department of Forests and Department of Education, Government of Kerala||Institution / Organization under Government||Kerala\n|-\n|2007||The village Forests Protection and Management Committee, Paliakhera ||Joint Forests Management Committee||Rajasthan\n|-\n|2007||Nisarg Seva Samiti, Wardha||Non Government Institution /Organization ||Rajasthan\n|-\n|2008||P. Sivakumar||Individual including Government Servant||Assam\n|-\n|2008||Range Forests Office, Taluka Sewa Sadan, Khambat||Institution / Organization under Government||Gujarat\n|-\n|2008||The van Suraksha Evam Prabandh Samiti, Gram Karel, The Jadol, Udaipur||Joint Forests Management Committee|| Rajasthan\n|-\n|2008|| Women’s Mandua, Women’s organisation for Socio-cultural Awareness(WOSCA), Keonjhar||Non Government organization||Odisha\n|}\nSee also\n* Indian Council of Forestry Research and Education\n* Van Vigyan Kendra (VVK) Forest Science Centres\n* List of environmental awards\nReferences"
    }
  ]
}