{
  "content": [
    {
      "type": "text",
      "text": "# Indian Queens\n\n|official_name=            Indian Queens\n|cornish_name=             Myghternes Eyndek\n|static_image_name =Indian queen porch.jpg\n|static_image_caption =Stone porch from the original pub bearing the name The Indian Queen\n|population=               500-600\n|population_ref=\n|civil_parish=             St Enoder\n|unitary_england=          Cornwall\n|lieutenancy_england =     Cornwall\n|region=                   South West England\n|constituency_westminster= North Cornwall\n|post_town=                ST. COLUMB\n|postcode_district =       TR9\n|postcode_area=            TR\n|dial_code=                01726\n|os_grid_reference=        SW917588}}\nIndian Queens () is a village in Cornwall, England, United Kingdom. The village, which is on the A30 trunk road, is in the civil parish of St Enoder. It is situated west of Goss Moor and north of Fraddon, approximately  west-southwest of Bodmin. Black Cross is a nearby hamlet.\nThe village name is derived from an eponymously named coaching inn. The village is the site of a Victorian era preaching pit constructed out of a disused quarry: the pit comprises large stepped rings and a preaching area the size and shape of half a bandstand.\nToponym and history\nThere are a number of stories regarding the origin of the village's name. Each version agrees that the name comes from the name of a coach/post house or inn. The name cannot be traced earlier than the 19th century. The inn was built on a plot of land known as White Splat in the late 18th century. The Indian Queen Inn stood beside the road leading from Goss Moor to Fraddon, just below the top of the hill. The pub had a small porch and displayed as a sign the portrait of an Indian queen. An inscription on the porch told the story of a Portuguese princess who landed at Falmouth in packet days, and slept one night at this inn on her way to London. Her swarthy appearance gave onlookers the impression that she was an Indian.\nIt has also been suggested that the royal lady was Pocahontas (1595–1617), an Indigenous American (called an Indian at the time) who was the younger daughter of Powhatan, paramount chief of Indigenous nations who lived along the Virginia coast, and also was the inspiration for the popular 1995 film of the same name. There is very little evidence to support this story; nevertheless, it is still commonly given as the origin of the name. Pocahontas's name has been given to a modern street in Indian Queens known as Pocahontas Crescent.\nUp to April 1780, the inn had the name \"The Queen's Head\". Sometime thereafter, and definitely by 1787, it had become \"The Indian Queen\". It seems that the name became \"The Indian Queens\" around the end of the 18th century. The signboard displayed an American Indian on one side and Victoria as Queen of India on the other. (Queen Victoria reigned 1837–1901; from 1877 she was Empress of India.) On the Ordnance Survey map of Cornwall, 1868–1896, the village is marked as \"Indian Queen\" and the inn is the \"Indian Queen Hotel\".  The pub was demolished in the 1960s and its old signboard resides in the Truro Museum. In 2009 the old stone lintel from the pub reappeared on a house in Indian Queens not far from the site of the original pub. It bears the inscription:\n\"THE INDIAN QUEEN  LICENSED BREWER AND RETAILER OF BEER, CYDER, WINE, AND TOBACCO. LICENSED to the POST HORSES\"\nAmenities\nThe village has excellent facilities including a coop, social club, victory hall with post office. There is a primary school, a recreational park and a garage which sells everything from stockings to bags of cement. Also Kingsley Village is a 10minute drive, where you can find Next, TK Maxx, Boots, M&S, McDonald's to name a few.\nTransport\nWith the advent of the UK's growing tourism industry in post-war Britain, Indian Queens became synonymous as a notorious traffic bottleneck during the summer holiday season because the  A30 trunk road ran directly through the village. With narrow roads, urban speed limits and a junction to the popular Cornish resort of Newquay, motorists could expect mile-long queues in both directions at peak times. An A30 bypass was finally proposed in 1987 but due to delays it was not opened until 2005, finally bringing an end to the village's traffic problem.\nCornish wrestling\nCornish wrestling tournaments for prizes have been held in Indian Queens.\nSee also Cornish wrestling in Blue Anchor.\nIn popular culture\nOn his 2001 CD The Convincer, Nick Lowe wrote and sang a song called \"Indian Queens\", about a drifter who yearns to return there after a lifetime of travelling.\nGallery\nFile:Black Cross - geograph.org.uk - 221858.jpg|Black Cross\nFile:MemorialStoneIndianQueens.jpg|An early Christian memorial stone in St Francis churchyard; the church is a chapel-of-ease in the parish of St Enoder of the Diocese of Truro\nFile:Industrial Workshops - geograph.org.uk - 226830.jpg|The industrial workshops (formerly a school)\nReferences\nSources\n* Noall, Cyril (1966) A History of Cornish Mail- and Stage-Coaches. Truro: D. Bradford Barton\n* Douch, H. L. (1966) Old Cornish Inns and their place in the social history of the County. Truro: D. Bradford Barton\n* Vigurs, C. C. (article in) Devon and Cornwall Notes and Queries; No. 416\nExternal links\n*[http://www.indianqueensband.co.uk Indian Queens Brass Band]"
    }
  ]
}