{
  "content": [
    {
      "type": "text",
      "text": "# Indo-Soviet Treaty of Friendship and Cooperation\n\nThe Indo–Soviet Treaty of Peace, Friendship and Cooperation was a treaty signed between India and the Soviet Union in August 1971 that specified mutual strategic cooperation. This was a significant deviation from India's previous position of non-alignment during the Cold War and was a factor in the 1971 Indo-Pakistani war.\nThe treaty was caused by increasing Pakistani ties with China and the United States and played an important role in the 1971 Bangladesh Liberation War. The duration of the treaty was of 20 years and it was renewed for another 20 years on 8 August 1991. Following the dissolution of the Soviet Union it ended such long term of friendship and cooperation.\nIndo-Soviet relations\nEarly relations\nIndia's initial relations with the Soviet Union after the former's independence were ambivalent and were guided by Nehru's decision to remain non-aligned and his government's active part in the Commonwealth of Nations. However, in February 1954, the administration of US President Dwight Eisenhower announced the decision to provide arms to Pakistan, which was followed a month later by Pakistan joining SEATO and later CENTO. Both agreements gave Pakistan sophisticated military hardware and economic aid.\nThe developing situation alarmed India, which had uncomfortable relations with Pakistan. Since Pakistan also was near the Soviet Union, it also provided Moscow with the necessity and the opportunity to develop its relations with India, whose status as a leader of the Non-Aligned Movement would also allow the Soviets to bolster their policy in the Third World.\nIndia and the Soviet Union, therefore, pursued similar policies based on common security threat born from the American interests in Pakistan. It was in that context that India and Soviet Union exchanged military attachés.\nAlthough Indo-Soviet co-operation occurred, Soviet military aid to India was greatly increased during the context of deteriorating Sino-Soviet and Sino-Indian relations. The 1962 Sino-Indian War caused the Sino-Pakistani axis to be another impetus for the growing co-operation between India and the Soviet Union.\nIn 1965, Indo-Soviet relations had entered a very important phase that lasted until 1977. According to Rejaul Karim Laskar, a scholar of Indian foreign policy, 1965 to 1977 was the \"golden age\" of Indo-Soviet relations.\n1971\nIn the results of the general elections in Pakistan in 1970, President Yahya Khan was dissatisfied with the victory of the Awami League, the Bengali party that had its power base in East Pakistan (now Bangladesh). Disagreement broke out between the Awami League leadership and Peoples Party leadership, which was the second largest party in the elections after the Awami League. The Pakistani military, under the orders of general Tikka Khan, used gunfire for almost a week to gain control of East Pakistan's capital and largest city Dhaka. Tikka Khan also targeted the Hindu population in East Pakistan. This led to a mass exodus of mostly Hindu Bengalis, who fled to India.\nThe Indian government, under the leadership of Indira Gandhi, saw itself confronted with a major humanitarian catastrophe, as eight to ten million Bengalis fled from East Pakistan to overcrowded and underfunded refugee camps in India. Indira Gandhi decided in April that a war was needed to stop the exodus and enable Bengali refugees to return to their homes.\nHowever, the Pakistani leadership was very well connected, as Yahya Khan had a close personal friendship with American President Richard Nixon and harboured excellent diplomatic relations with Mao's China.\nThe Soviets had proposed a treaty with India in February 1969. Gandhi had held off signing, but in 1971 agreed, in order to neutralize the United States and China. Neither would be likely to aid Pakistan militarily against India for fear of the conflict drawing in the Soviet Union and spreading. The ensuing Treaty of Friendship and Cooperation, signed in August 1971, was very loose, but sent a strong signal to Washington and Beijing.\nEventually, since Nixon needed Brezhnev to end the Vietnam War, frictions between both superpowers were streamlined, which paved the way for the immensely important summit that was convened in Moscow in May 1972. The Soviet Union, now an Indian ally, also intervened in the civil war in Pakistan on behalf of India.\nAfter Cold War\nReferences\nBibliography\n*\n* .\n* .\n*\n* .\n* Menon, Rajan. \"India and Russia.\" in David Malone et al. eds. The Oxford Handbook of Indian Foreign Policy (2015) pp 509–521.\nExternal links"
    }
  ]
}