{
  "content": [
    {
      "type": "text",
      "text": "# Infinite Undiscovery\n\n| publisher = Square Enix\n| designer = Hiroshi Ogawa\n| writer = Ryo MizunoShoji Gatoh\n| artist = Yukihiro Kajimoto\n| programmer = Yoshiharu Gotanda\n| producer = Hajime Kojima\n| composer = Motoi Sakuraba\n| engine = ASKA\n| released = }}\n| genre = Action role-playing\n| modes = Single-player\n| platforms = Xbox 360\n}}\nis a 2008 action role-playing game developed by tri-Ace and Microsoft Game Studios Japan and published by Square Enix for the Xbox 360. It tells the story of the main character Capell and his journey to sever the chains that are holding the moon, with the help of the Liberation Force. The game received mixed to positive reviews from critics.\nGameplay\nInfinite Undiscovery is based on the player making real-time decisions that can affect the outcome of the story. These decisions can occur at any time, even while the player is going through inventory in the menu.\nThe player controls the main character, Capell, from a third-person perspective while three other characters are controlled by AI. The player fights battles with this team of four, or sometimes with multiple teams formed from a possible 18 characters. In battle, Capell has the ability to use connect actions, which give him access to other team members' skills.\nThe game was originally meant to transition between day and night every 10 minutes, giving the player different opportunities; for instance, stealth would be easier at night. However, this system was later removed. Director Hiroshi Ogawa explained that other forms of stealth remained in the game: “As an example, when you’re running away from a hunting dog, you can distract him by dropping apples from the trees. However, the guards may catch you when they hear the thud of the apples.”\nPlot\nInfinite Undiscovery takes place in a world where the Dreadknight Leonid and his Order of Chains bound the world to the Moon from all regions. The Main Chain is attached to the castle in the fallen Kingdom of Cassandra (formerly the kingdom of King Volsung) - wherein Leonid's headquarters lies. Any region bound with a Chain suffers blight consequences: crops wither and animals die. Thus, Sigmund the Liberator goes forth, alongside his Liberation Force, to unchain the world. An unwitting young man, Capell, is fatefully thrown into this conflict, of which he wants no involvement. Inevitably, these chain of events will change his life and those around him, forever...\nDevelopment\nInfinite Undiscovery was announced in September 2006 by Famitsu. Initially it was believed that Microsoft would publish the game, but at TGS 2007, Hajime Kojima and Hiroshi Ogawa stated that Square Enix would take over publishing duties because they have more \"know-how\" with RPGs. However, since Microsoft was the original publisher, it holds the trademark for the game and shares the copyright with Square Enix.\nAccording to tri-Ace co-founder and R&D programmer Yoshiharu Gotanda, the game is set to contain 10 years' worth of ideas that can finally be realized with the Xbox 360, and with it, role-playing video games \"will undergo a true evolution.\" tri-Ace wished to achieve this by putting the player through \"situational battles\" that would lead to \"unknown discoveries\" and cause permanent changes to the world.\nThe game was directed by Hiroshi Ogawa and produced by Hajime Kojima, both of whom are also credited in the tri-Ace titles Star Ocean: Till the End of Time and Valkyrie Profile: Lenneth. tri-Ace president Yoshiharu Gotanda signed on as the game's lead programmer. Scenario was handled by ORG Ltd., including Ryo Mizuno and Shoji Gatoh. The game's characters were designed by Yukihiro Kajimoto.\nThe English dub was the first title released from New Generation Pictures's Shanghai Studios. As such it features voice actors from Texas and Los Angeles, as well as a large helping of new talent from Shanghai.\nReception\n| Destruct = 3.5/10\n| Edge = 6/10\n| EuroG = 5/10\n| Fam = 32/40\n| GI = 8/10\n| GamePro =\n| GameRev = D+\n| GSpot = 6.5/10\n| GSpy =\n| GT = 7.8/10\n| GameZone = 7.2/10\n| IGN = 7.1/10\n| OXM = 8/10\n| rev1 = 411Mania\n| rev1Score = 8/10\n}}\nBy September 30, 2008, Infinite Undiscovery had shipped 120,000 copies in Japan, 200,000 copies in North America, and 90,000 copies in Europe. The game also sold 96,000 copies by its third week. Famitsu gave it a total score of 32 out of 40 from four reviewers (9, 8, 8, 7).\nInternationally, the game received \"average\" reviews according to the review aggregation website Metacritic. IGN said, \"This isn't a game marred with horrendous bugs or unplayable combat. And it's not boring. It's just misguided. The story is intriguing enough that RPG fanatics should at least give this a rental.\" 1UP.com said, \"Undiscovery is absolutely worth playing through at least once, with the regrettable caveat that it really could've been so much more.\" GamePro said, \"In the end, Undiscovery isn't a bad game but it is seriously flawed. I'd recommend renting it before you invest your hard earned cash on a purchase, especially if you're new to the RPG genre.\" GameSpot felt that the game was too flawed to reach its potential.\nReferences\nExternal links\n*[http://www.infiniteundiscoverygame.co.uk/home/ Official website] (UK)\n*\n*[http://blog.square-enix.com/undiscovery/ Official blog]"
    }
  ]
}