{
  "content": [
    {
      "type": "text",
      "text": "# Infowars__disambig_1\n\nInfo Wars (film)}}\nclass=skin-invert\n| logo_size = 125px\n| screenshot = InfoWars.com homepage.png\n| caption =\n| type =\n| url = infowars.com\n| commercial = Yes\n| registration = None\n| language = English\n| owner = Free Speech Systems, LLC\n| current_status = Active\n| launched =\n}}\nInfowars is an American far-right}} conspiracy theory}} and fake news website}} created by Alex Jones. It was founded in 1999, and operated under Free Speech Systems LLC.\nTalk shows and other content for the site have been created primarily in studios at an undisclosed location in an industrial area in the outskirts of Austin, Texas. Reports in 2017 stated that the Infowars website received approximately 10&nbsp;million monthly visits, making its reach greater than some mainstream news websites such as The Economist and Newsweek at the time. The site has regularly published fake stories that have led to harassment of crime victims. In February 2018, Jones, the publisher, director and owner of Infowars, was accused of discrimination and sexual harassment of employees. Infowars, and in particular Jones, has advocated numerous conspiracy theories, particularly around purported domestic false flag operations by the U.S. government (which they allege include the 9/11 attack and Sandy Hook shooting). Infowars has issued retractions various times as a result of legal challenges. Jones has had contentious material removed, and has also been suspended and banned from many platforms for violating their terms of service, including Facebook, Twitter, YouTube, iTunes, and Roku.\nInfowars has earned most of its revenue from direct sales of products pitched by Jones, which initially consisted of videos and later included survivalist products and branded merchandise, but shifted primarily to dietary supplements by the late 2010s. Jones has also staged direct-donation telethons called \"money bombs\" although Infowars was never a nonprofit organization.\nOn July 30, 2022, amidst a $150 million lawsuit brought against Jones and Infowars by Sandy Hook families, Infowars faced bankruptcy proceedings from 2022 to 2025, but a federal bankruptcy judge ultimately ruled that only Alex Jones's ownership stake could be sold, as its parent company was no longer in bankruptcy. The families took the case to state court, and in August 2025, a Texas judge ordered InfoWars to be liquidated to pay the families.\nHistory\nwith Paul Joseph Watson in 2013]]\nInfowars was created in 1999 by American conspiracy theorist Alex Jones. Founded by Jones with his then-wife Kelly, it was originally a mail-order outlet for the conspiracy-oriented videos produced by the Joneses. Infowars features The Alex Jones Show on their broadcasts and was established as a public-access television program aired in Austin, Texas, in 1999.\nDuring the 2016 presidential election, the website was promoted by bots connected to the Russian government. A 2017 study by the Berkman Klein Center for Internet & Society at Harvard University found that Infowars was the 13th most shared source by supporters of Donald Trump on Twitter during the election.\nIn 2016, Paul Joseph Watson was hired as editor-at-large. In February 2017, political commentator Jerome Corsi was hired as Washington bureau chief, after Infowars was granted a White House day pass. In June 2018, Corsi's connection to Infowars ended; he received six months of severance payments.\nIn May 2017, Mike Cernovich joined the Infowars team as a scheduled guest host for The Alex Jones Show, with CNN reporting the \"elevation to Infowars host represents the meteoric rise in his profile\". On July 6, 2017, alongside Paul Joseph Watson, Jones began hosting a contest to create the best \"CNN Meme\", for which the winner would receive $20,000. They were responding to CNN reporting on a Reddit user who had created a pro-Trump, anti-CNN meme.\nIn June 2017, it was announced that Roger Stone, a former campaign advisor for Donald Trump, would be hosting his own Infowars show \"five nights a week\", with an extra studio being built to accommodate his show.\nIn March 2018, a number of major brands in the U.S. suspended their ads from Infowarss YouTube channels, after CNN notified them that their ads were running adjacent to Infowars content.\nIn July 2018, YouTube removed four of Infowarss uploaded videos that violated its policy against hate speech and suspended posts for 90 days. Facebook also banned Jones after it determined four videos on his pages violated its community standards in July 2018. In August 2018, YouTube, Apple and Facebook removed content from Jones and Infowars, citing their policies against hate speech and harassment.\nIn an October 2018 Simmons Research survey of 38 news organizations, Infowars was ranked the second least trusted news organization by Americans, with The Daily Caller being lower-ranked.\nOn March 12, 2020, Attorney General of New York Letitia James issued a cease and desist letter to Jones concerning Infowarss sale of unapproved products that the website falsely asserted to be government-approved treatments for coronavirus disease 2019 (COVID-19). On April 9, the FDA ordered Infowars to discontinue the sale of a number of products marketed as remedies for COVID-19 in violation of the Federal Food, Drug, and Cosmetic Act, including toothpaste, liquids, and gels containing colloidal silver.\nClaims of sexual harassment and antisemitism\nIn 2017, Haaretz reported that Infowars had accused Israel of involvement in the 9/11 attacks, accused the Rothschilds of promoting \"endless war, debt slavery and a Luciferian agenda\", and claimed that U.S. healthcare was under the control of a \"Jewish mafia\".\nIn February 2018, Jones was accused by two former employees of antisemitism, anti-black racism and sexual harassment of both male and female staff members. He denied the allegations.\nTwo former employees filed complaints against Jones with the Equal Employment Opportunity Commission.\nRemovals from other websites\nOn July 27, 2018, Facebook suspended Alex Jones's official page for thirty days, claiming Jones had participated in hate speech against Robert Mueller. This was swiftly followed by action from other bodies—on August 6, Facebook, Apple, YouTube and Spotify all removed content by Alex Jones and Infowars from their platforms for violating their policies. YouTube removed channels associated with Infowars, including The Alex Jones Channel, which had gained 2.4 million subscriptions prior to its removal. On Facebook, four pages associated with Infowars and Alex Jones were removed due to repeated violations of the website's policies. Apple removed all podcasts associated with Jones from its iTunes platform and its podcast app. On August 13, Vimeo removed all Jones's videos because they \"violated our terms of service prohibitions on discriminatory and hateful content\". By February 2019, a total of 89 pages associated with Infowars or Alex Jones had been removed from Facebook due to its recidivism policy, which is designed to prevent circumventing a ban. In May 2019, President Donald Trump tweeted or retweeted defenses of people associated with Infowars, including editor Paul Joseph Watson and host Alex Jones, after the Facebook ban.\nJones's accounts have also been removed from Pinterest, Mailchimp, LinkedIn, and Instagram. The Wikipedia community deprecated and blacklisted Infowars as a source by snowball clause consensus in 2018, determining that Infowars is a \"conspiracy theorist and fake news website\".\nBeginning in September 2018, Jones and Infowars were both suspended from Twitter and Periscope, a Twitter subsidiary. This followed Jones tweeting a Periscope video calling on others \"to get their battle rifles ready against antifa, the mainstream media, and Chicom operatives\". In the video he also stated, \"Now is time to act on the enemy before they do a false flag.\" Twitter cited this as the reason to suspend his account for a week on August 14. On September 6, Twitter banned Infowars and Alex Jones for repeated violations of the site's terms and conditions. Twitter cited abusive behavior, namely a video that \"shows Jones shouting at and berating CNN journalist Oliver Darcy for some 10 minutes during congressional hearings about social media.\" On April 16, 2020, Twitter suspended the accounts of Infowars personalties Owen Shroyer and Rob Dew, as well as their streaming site Banned.Video for promoting violence in a Texas rally against the stay-at-home order during the COVID-19 pandemic. The account bans of Jones, Shroyer, Dew, as well as the Infowars and Banned.Video websites from the platform ware overturned by Elon Musk in December 2023, after the latter's acquisition of Twitter.\nOn September 7, 2018, the Infowars app was removed from the Apple App Store. On September 20, 2018, PayPal informed Infowars they would cease processing payments in ten days because \"promotion of hate and discrimination runs counter to our core value of inclusion.\" On May 2, 2019, Facebook and Instagram banned Jones and Infowars as part of a larger ban of far-right extremists. The ban covered videos, audio clips, and articles from Infowars, but excluded criticism of Infowars. Facebook indicated it would take down groups that violated the ban. The Infowars app was pulled from Google Play on March 27, 2020, for violating its policies on spreading \"misleading or harmful disinformation\", after Jones opposed efforts to contain COVID-19 and said \"natural antivirals\" could treat the disease.\nIn March 2023, the Southern Poverty Law Center reported on Jones's leaked texts from his Sandy Hook defamation trial. The texts revealed that Jones and his collaborators had been trying to evade social media bans of Infowars content by setting up alternate websites such as National File to disguise its origin.\nBankruptcy and proposed acquisition\nIn April 2022, it became known the company behind Infowars had filed for Chapter 11 bankruptcy protection, as had Infowars Health (or IWHealth), against further civil litigation lawsuits. The court filings estimated Infowars assets at between $0–$50,000, but its liabilities (including from the damages awarded against Jones in defamation suits) was estimated as being between $1 million to $10 million.\nOn June 23, 2024, Jones's court-appointed bankruptcy trustee Christopher Murray filed an \"emergency\" motion in a Houston court indicating his intention to shut down Infowars. According to the motion, Murray made plans to \"conduct an orderly wind-down\" of the operations of Free Speech Systems, Infowarss parent company, and also \"liquidate its inventory\", but he did not announce a timetable; on his radio show, Jones had said that he expects Infowars to operate for a few more months, or to be sold to another party that may retain him as an employee. Murray also asked the bankruptcy court to put a hold on the Sandy Hook families' attempts to collect their settlements from Jones, saying that their efforts would interfere with the liquidation; much of its proceeds would ultimately go to the families, Murray said. On September 24, bankruptcy judge Christopher Lopez approved the liquidation of Infowarss and Free Speech Systems's assets. Auctions would be held on November 13 and December 10; no limits were to be imposed on who may bid for the company's intellectual property and other assets.\nOn November 14, Global Tetrahedron—publisher of the satirical newspaper The Onion—announced that it had bought Infowarss intellectual property assets in the auction, with the site afterwards shut down, to be relaunched in January 2025 as a satire written by Onion staff. CEO Ben Collins stated that the new site would be \"very funny\" and \"very stupid\", and cited Bluesky users who suggested that it would be funny for The Onion to acquire Infowars. Global Tetrahedron had offered $1.75 million in cash, plus credit from families of the Sandy Hook shootings who had \"agreed to forgo a portion of their recovery to increase the overall value\", which it claimed brought its bid close to $7 million. The gun control advocacy group Everytown for Gun Safety was to have an \"exclusive\" advertising deal upon the relaunch. Jones responded to the sale in a live stream on Twitter, stating that it was \"a distinct honor to be here in defiance of the tyrants\", and that \"I don't know what's going to happen, but I'm going to be here until they come in there and turn the lights off. I'm going to say, 'where's your court order?'\"\nHours after Global Tetrahedron's announcement, Jones's lawyers said that the auction had been conducted improperly, and Judge Lopez put a hold on the sale pending a hearing to be held the following week. Murray also received a $3.5 million cash offer from the Jones-affiliated First United American Companies. Although its cash value was lower, the Global Tetrahedron offer would provide more money for Jones's other creditors because some Sandy Hook families would partially forgo payments; however, this made the offer difficult to precisely value. Full terms of the offer were not publicly disclosed. Jones's lawyers said that Murray acted improperly in accepting the offer, saying that the two offers were difficult to directly compare. Additionally, Lopez indicated that he had expected bidders to be able to counterbid, although his September order gave Murray the authority to conduct a sealed-bid auction at Murray's sole discretion. Jones's lawyers said that Murray had scheduled a public bid period but abruptly canceled it after the initial sealed bids had been submitted.\nThe original website was restored on the morning of November 15 by Jones, who told viewers that Murray had improperly shut it down before the sale was finalized, and posted on Twitter the next day that the sale \"never happened\". On November 18, Jones sued Murray and some Sandy Hook families, accusing them of colluding to arrange the acceptance of a \"flagrantly non-compliant Frankenstein bid\" and asking the judge to halt the sale. Lopez rejected the sale on December 10, ruling that an auction did not result in the best bids possible, but rejecting Jones's claims of \"collusion\" in the auction.\nOn February 5, 2025, Judge Christopher Lopez ruled that Infowars assets could no longer be auctioned off as Infowarss parent company, Free Speech Systems, was no longer in bankruptcy. He allowed only for the sale of Jones's ownership stake in FSS.\nAfter the federal bankruptcy case ended, the Sandy Hook families took their case against InfoWars to state court, and on August 13, 2025, a state judge ordered all of the website's physical and intellectual property to be turned over to a court-appointed receiver for liquidation to pay the families. A lawyer for Jones did not comment when contacted by The New York Times.\nContent\nPromotion of conspiracy theories and fake news\nInfowars disseminated multiple conspiracy theories, including false claims against the HPV vaccine and claims the 2017 Las Vegas shooting was part of a conspiracy. In 2015, skeptic Brian Dunning listed it at #4 on a \"Top 10 Worst Anti-Science Websites\" list.\nInfowars advocated New World Order conspiracy theories, 9/11 conspiracy theories, the chemtrail conspiracy theory, conspiracy theories involving Bill Gates, supposed covert government weather control programs, claims of rampant domestic false flag operations by the US Government (including 9/11), and the unsupported claim that millions voted illegally in the 2016 US presidential election. Jones frequently used Infowars to assert that mass shootings are conspiracies or \"false flag\" operations; these false claims are often subsequently spread by other fake news outlets and on social media. This has been characterized as Second Amendment \"fan fiction\".\nInfowars has published and promoted fake news, and Jones has been accused of knowingly misleading people to make money. In the summer of 2015, video editor Josh Owens and reporter Joe Biggs took a video of workers loading cargo in Texas. They claimed the men were drug smugglers; the Drudge Report picked up their headline, and Donald Trump used it in a campaign speech. Owens admitted years later: \"It's not about truth, it's not about accuracy—it's about what's going to make people click on this video... In essence, we lied.\" (Biggs was later indicted for seditious conspiracy for his role with the Proud Boys in the January 6, 2021 attack on the Capitol.) As part of the probe by the Federal Bureau of Investigation (FBI) into Russian interference in the 2016 United States elections, Infowars was investigated to see if it was complicit in the dissemination of fake news stories distributed by Russian bots.\nFrom May 2014 to November 2017, Infowars republished articles from multiple sources without permission, including over 1,000 from Russian state-sponsored news network RT, as well as stories from news outlets such as CNN, the BBC, and The New York Times which Salon said were \"dwarfed\" by those from RT.\nA 2020 study by researchers from Northeastern, Harvard, Northwestern and Rutgers universities found that Infowars was among the top 5 most shared fake news domains in tweets related to COVID-19, the others being The Gateway Pundit, WorldNetDaily, Judicial Watch, and Natural News.\nClaims of false flag school shootings\nInfowars regularly claimed, without evidence, that mass shootings were staged \"false flag\" operations, and accused survivors of such events of being crisis actors employed by the United States government. Infowars host Alex Jones promoted the Sandy Hook Elementary School shooting conspiracy theories, claiming that the massacre of twenty elementary school students and six staff members was \"completely fake\" and \"manufactured,\" a stance for which Jones was heavily criticized.  In March 2018, six families of victims of the Sandy Hook Elementary School shooting, as well as an FBI agent who responded to the attack, filed a defamation lawsuit against Jones for his role in spreading conspiracy theories about the shooting. In December 2019, Infowars and Jones were ordered to pay $100,000 in legal fees prior to the trial for another defamation lawsuit from a different family whose son was killed in the shooting. In a June 2022 agreement, the families agreed to drop their Texas and Connecticut defamation cases against Infowars, Prison Planet TV and IW Health, and in return, those companies would no longer pursue their Texas case for bankruptcy protection. The agreement did not end the separate defamation cases against Alex Jones and Free Speech Systems.\nJones also accused David Hogg and other survivors of the Stoneman Douglas High School shooting of being crisis actors.\nPizzagate conspiracy theory\nInfowars promoted fabricated Pizzagate claims. The fake claims led to harassment of the owner and employees of Comet Ping Pong, a Washington, D.C. pizzeria targeted by the conspiracy theories, including threatening phone calls, online harassment, and death threats. The owner sent a letter to Jones in February 2017 demanding a retraction or apology. (Such a letter is required before a party may seek punitive damages in an action for libel under Texas law).\nAfter receiving the letter, Jones said, \"I want our viewers and listeners to know that we regret any negative impact our commentaries may have had on Mr. Alefantis, Comet Ping Pong, or its employees. We apologize to the extent our commentaries could be construed as negative statements about Mr. Alefantis or Comet Ping Pong, and we hope that anyone else involved in commenting on Pizzagate will do the same thing.\" Infowars also issued a correction on its website.\nInfowars reporter Owen Shroyer also targeted East Side Pies, a group of pizza restaurants in Austin, Texas, with similar fake \"Pizzagate\" claims. Following the claims, the pizza business was targeted by phone threats, vandalism, and harassment, which the co-owners called \"alarming, disappointing, disconcerting and scary\".\nChobani retraction\nIn 2017, Infowars (along with similar sites) published a fake story about U.S. yogurt manufacturer Chobani, with headlines including \"Idaho yogurt maker caught importing migrant rapists\" and \"allegations that Chobani's practice of hiring refugees brought crime and tuberculosis to Twin Falls\". Chobani ultimately filed a federal lawsuit against Jones, which led to a settlement on confidential terms in May 2017. Jones offered an apology and retraction, admitting he had made \"certain statements\" on Infowars \"that I now understand to be wrong\".\nSeth Rich retraction\nIn 2019, Jerome Corsi and InfoWars apologized and retracted a story promoting conspiracy theories about the murder of Seth Rich. The retraction was published on the front page of InfoWars, where Corsi said that \"his allegations were not based upon any independent factual knowledge.\" Corsi said that he retracted the story because it relied on information that The Washington Times had retracted, but still thought that investigators should look into whether Seth Rich played a role.\nBusinesses\nWhile Jones stated, \"I'm not a business guy, I'm a revolutionary\", he spent much of Infowarss air time pitching dietary supplements and survivalist products to his audience. As a private firm, Infowars and its affiliated limited liability companies were not required to make public financial statements; as a result, observers could only estimate its revenue and profits.\nPrior to 2013, Jones focused on building a \"media empire\". By 2013, Alex Seitz-Wald of Salon estimated that Jones was earning as much as $10 million a year between subscriptions, web and radio advertising, and sales of DVDs, T-shirts, and other merchandise. That year, Jones changed his business model to incorporate selling proprietary dietary supplements, including one that promised to \"supercharge\" cognitive functions.\nUnlike most talk radio shows, Infowars itself did not directly generate income, as it did not receive syndication fees from its syndicator GCN nor a cut of GCN's advertising, and it did not sell its own advertising time. By 2017, the show had ceased promoting its video service (though it still existed), and Infowars did not make any documentary films after 2012; virtually all of its revenue was being generated by selling Jones's dietary supplements to viewers and listeners through the site's online store.\nIn 2017, the supplements sold on the Infowars store were primarily sourced from Dr. Edward F. Group III, a chiropractor who founded the Global Healing Center supplement vendor. A significant portion of Infowarss products contain colloidal silver, which Jones falsely claimed \"kills every virus\", including \"the whole SARS-corona family\"; this claim was disputed by the Food and Drug Administration (FDA).\nA lesser source of revenue for Infowars was its \"money bomb\" telethons, which resembled public radio fundraisers, except Infowars was a for-profit institution. According to former Infowars employees, a money bomb could raise $100,000 in a day.\nIn 2014, Jones claimed that Infowars was accumulating over $20 million in annual revenue. The New York Times attributed most of the revenue to sales of supplements, including \"Super Male Vitality\" and \"Brain Force Plus\", which Infowars purported would increase testosterone and mental agility, respectively. Court documents in 2014 indicate that Infowars was successful enough for Jones and his then-wife to be planning to \"build a swimming pool complex... featuring a waterfall and dining cabana with a stone fireplace\". The documents also listed Jones's possessions, including four Rolex watches, a $40,000 saltwater aquarium, a $70,000 grand piano, $50,000 in weapons, and $70,000 in jewelry.\nAfter Infowars was banned by Facebook, YouTube, Apple, Spotify, and Pinterest, Jones appealed to viewers, \"The enemy wants to cut off our funding to destroy us. If you don't fund us, we'll be shut down.\"\nSee also\n* Fake news websites in the United States\n*\n* List of fake news websites\nReferences\nExternal links\n*"
    }
  ]
}