{
  "content": [
    {
      "type": "text",
      "text": "# Ing Wong-Ward\n\n| birth_place        = Vancouver, British Columbia, Canada\n| death_date         =\n| death_place        = Toronto, Ontario, Canada\n| resting_place      =\n| occupation         = Advocate for the disabled, journalist, public broadcaster, TV and radio producer\n| citizenship        =\n| education          =\n| alma_mater         = Ryerson University, 1993\n| movement           =\n| notable_works      =\n| spouse             = Tim Wong-Ward\n| partner            =\n| children           =\n| relatives          =\n| awards             = City of Toronto Human Rights Access Award, 2004\n| signature          =\n| signature_alt      =\n| website            =\n}}\nIng Min Wong-Ward (June 15, 1973 - July 9, 2019) was a Canadian advocate for the disabled, journalist, and Canadian Broadcasting Corporation (CBC) television and radio producer.\nEarly life and education\nIng Min Wong was born in Vancouver, BC, to parents John and King Wong. Born with spinal muscular atrophy, she used a motorized wheelchair throughout her life.\nShe graduated from the Ryerson School of Journalism in 1993.\nCareer\nWong joined the Canadian Broadcasting Corporation in 1993. In her 23-year long career with the public broadcaster, she held various positions including researcher, producer, and host. In television, she hosted the CBC program The Disability Network, and worked behind the scenes on the programs Newsworld and The National. She also worked for CBC Radio, primarily in Toronto, where she produced Metro Morning, Here & Now and Fresh Air.\nIn 2016, Wong-Ward left CBC to become the assistant director at the Centre for Independent Living in Toronto.\nPersonal life\nWong married her husband, Tim, on August 22, 1998.\nWong-Ward, her husband, and her daughter lived in Toronto.\nIn 2017, Wong-Ward was diagnosed with inoperable colon cancer and opted to enter palliative care.\nAwards\n* Gabriel Award for radio broadcasting.\n* 2004, the [https://www.toronto.ca/city-government/awards-tributes/awards/access-equity-and-human-rights-awards/ City of Toronto Human Rights Access Award].\n* 2019, posthumously, the 2018-2019 Founders Award, Centre for Independent Living.\nReferences"
    }
  ]
}