{
  "content": [
    {
      "type": "text",
      "text": "# Injinoo, Queensland\n\n| pushpin_map_caption      =\n| pushpin_label_position   = left\n| map_alt                  =\n| pop                      = 498\n| pop_year                 =\n| pop_footnotes            =\n| established              =\n| postcode                 = 4876\n| area                     = 181.4\n| timezone                 = AEST\n| utc                      = +10:00\n| dist1                    = 7.5\n| dir1                     = WSW\n| location1                = Bamaga\n| dist2                    = 463\n| dir2                     = NNE\n| location2                = Weipa\n| dist3                    = 822\n| dir3                     = NNW\n| location3                = Cooktown\n| dist4                    = 991\n| dir4                     = NNW\n| location4                = Cairns\n| dist5                    = 2663\n| dir5                     = NNW\n| location5                = Brisbane\n| lga                      = Northern Peninsula Area Region\n| lga2                     = Shire of Torres\n| stategov                 = Cook\n| fedgov                   = Leichhardt\n| near-n                   = Torres Strait\n| near-ne                  = Umagico\n| near-e                   = Jardine River\n| near-se                  = Jardine River\n| near-s                   = Mapoon\n| near-sw                  = Gulf of Carpentaria\n| near-w                   = Gulf of Carpentaria\n| near-nw                  = Torres Strait\n}}\nInjinoo (formerly Cowal Creek) is a coastal town in the Northern Peninsula Area Region and a locality split between Northern Peninsula Area Region and the Shire of Torres in Far North Queensland, Australia. It is on the north-western coast of Cape York Peninsula.  In the , the locality of Injinoo had a population of 498 people with 449 (90.25) identifying as Indigenous Australians.\nHistory\nLuthigh (also known as Lotiga, Tepiti and Uradhi, see also Uradhi related languages) is an Australian Aboriginal language spoken by the Luthigh people. The traditional language area for Luthigh includes landscape within the local government boundaries of the Cook Shire: Eastern Cape York, Ducie River, Northern Peninsula, New Mapoon, Injinoo, and Cowal Creek.\nUradhi (also known as Anggamudi, Ankamuti, Atampaya, Bawtjathi, and Lotiga) is an Australian Aboriginal language of the Western Cape York Peninsula. The traditional language region includes north of Mapoon and Duyfken Point and east of the coast strip to the north of Port Musgrave (Angkamuthi country) incorporating the mouth of the Ducie River, the lower reaches of the Dulhunty River and the upper reaches of the Skardon River in the north. Following the displacement of Indigenous people by British settlement, it was also spoken in the Northern Peninsula Area Region including the communities of New Mapoon, Injinoo and Cowal Creek.\nInjinoo Aboriginal Community was an Aboriginal settlement and later Anglican mission established on Cape York by a community led by a Wuthathi man, Allelic Whitesand.\nAlthough self-sufficient, through fishing and gardening, the Community made requests to the then Church of England to establish a mission and school. Queensland government officials allowed the community to function through an elected Council.\nAfter the Second World War, which saw a considerable military presence in the area, many Torres Strait Islanders began moving into Injinoo. Settlements were subsequently built at Bamaga, New Mapoon and Umagico to relocate evicted people from this and other areas of the Cape. In 1948 a reserve was created, with control of the area having been taken over by the Queensland Department of Native Affairs.\nThe official name of the community was changed from Cowal Creek to Injinoo  on 2 September 1989.\nDemographics\nIn the , the town of Injinoo had a population of 416 people with 398 (95.7%) identifying as Indigenous.\nIn the , the locality of Injinoo had a population of 561 people with 535 (95.9%) identifiying as Indigenous.\nIn the , the locality of Injinoo had a population of 498 people with 449 (90.25) identifying as Indigenous.\nEducation\nThe Injinoo Junior campus of the Northern Peninsula Area College  is a government primary (Early Childhood-6) campus of Northern Peninsula Area State College at Bowie Street (). The college has its headquarters in Bamaga to the north-east.\nThere are no secondary schools in Injinoo. The nearest government secondary school is the Senior Campus of the Northern Peninsula Area College in Bamaga to the north-east.\nFacilities\nIn 2012, the Indigenous Knowledge Centre was opened at Injinoo, operated by the Northern Peninsula Area Regional Council. It has produced a video detailing traditional bush foods as part of a children's language workshop.\nReferences\nExternal links\n* [https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/tqqf2h/alma99184139580202061 Injinoo Indigenous Knowledge Centre re-opening], State Library of Queensland"
    }
  ]
}