{
  "content": [
    {
      "type": "text",
      "text": "# Innisfail Estate, Queensland\n\n| pop                 = 1454\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4860\n| area                = 4.0\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 2.0\n| dir1                = E\n| location1           = Innisfail\n| dist2               = 89.7\n| dir2                = S\n| location2           = Cairns\n| dist3               = 261\n| dir3                = NNW\n| location3           = Townsville\n| dist4               = 1596\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = Cassowary Coast Region\n| stategov            = Hill\n| fedgov              = Kennedy\n| near-n              = Eaton\n| near-ne             = Coconuts\n| near-e              = Coquette Point\n| near-se             = Coquette Point\n| near-s              = Webb\n| near-sw             = Innisfail\n| near-w              = Cullinane\n| near-nw             = Sundown\n}}\nInnisfail Estate is a semi-rural locality in the Cassowary Coast Region, Queensland, Australia. In the , Innisfail Estate had a population of 1,454 people.\nGeography\nInnisfail Estate is bounded by the Johnstone River to the east, south and west. It is flat low-lying land, below  above sea level. It is connected to Innisfail to the west across the river  by the Geraldton Bridge (Geraldton being the former name of Innisfail).\nRocky Point is at the south-east of the locality on the Johnstone River ().\nThe south-western part of the locality near the bridge is suburban. The east of the locality is undeveloped wetlands. The remainder of the locality is used for agriculture, predominantly growing sugarcane.\nHistory\nIn 1879 Thomas Henry Fitzgerald came to North Queensland looking for locations suitable to grow sugarcane. He was impressed by the potential of the Johnstone River district. Returning to Brisbane he established a company Fitzgerald & Co with the assistance of Roman Catholic Bishop of Brisbane James O'Quinn. On 23 April 1880 he returns to the area and establishes the first sugarcane plantation (called Innisfail Estate) with its own sugar mill. The mill closed in 1885 but by then there were a number of other mills in the Johnstone River district.\nBy the 1940s there was a cane tramway through the Innisfail Estate, with a ferry connection for the tramway across the Johnstone River (approx )  to Innisfail and from there to the sugar mill.\nInnisfail State High School opened on 24 January 1955 and operated until the end of 2009 at 2 Stitt Street in Mighell. In 2010,  it was amalgamated with the Innisfail Inclusive Education Centre (a special education facility) and Tropical North Queensland TAFE (Innisfail Campus) to form Innisfail State College using the site of the TAFE campus at Innisfail Estate.\nDemographics\nIn the , Innisfail Estate had a population of 1,338 people.\nIn the , Innisfail Estate had a population of 1,454 people.\nEducation\nInnisfail State College is a government primary and secondary (Early Childhood-12) school for boys and girls at 45 Flying Fish Point Road (). In 2017, the school had an enrolment of 856 students with 85 teachers (81 full-time equivalent) and 57 non-teaching staff (43 full-time equivalent). It includes an early childhood developmental program, a diverse learning centre, and a special education program. The college provides secondary schooling and special education for primary and secondary school children and secondary. However, iit does not offer mainstream primary schooling and there are no mainstream primary schools in Innisfail Estate. The nearest government primary school is Innisfail State School in Innisfail across the river to the west. Catholic primary and secondary schools are also available in Innisfail.\nReferences"
    }
  ]
}