{
  "content": [
    {
      "type": "text",
      "text": "# Inskip, Queensland\n\n| pop                 = 22\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4581\n| elevation           = 6\n| area                = 35.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 13.0\n| dir1                = N\n| location1           = Rainbow Beach\n| dist2               = 51.4\n| dir2                = NE\n| location2           = Tin Can Bay\n| dist3               = 86.6\n| dir3                = NE\n| location3           = Gympie\n| dist4               = 263\n| dir4                = N\n| location4           = Brisbane\n| lga                 = Gympie Region\n| stategov            = Gympie\n| fedgov              = Wide Bay\n| near-n              = Great Sandy Strait\n| near-ne             = Coral Sea\n| near-e              = Coral Sea\n| near-se             = Rainbow Beach\n| near-s              = Cooloola\n| near-sw             = Tin Can Bay\n| near-w              = Tin Can Bay\n| near-nw             = Great Sandy Strait\n}}\nInskip is a coastal locality in the Gympie Region, Queensland, Australia. Inskip Point at the north of the locality is a vehicular gateway to Fraser Island (also known as K'Gari and Gari). In the , Inskip had a population of 22 people.\nGeography\nInskip is a peninsula that separates Wide Bay and Tin Can Inlet from the Coral Sea. Inskip Point is its northernmost point () and is  south from the southern tip of  Fraser Island, making it a major gateway to the island via vehicular barges. There are camping grounds in Inskip and two boat ramps, horse trails and other outdoor recreational facilities.\nRainbow Beach airfield is within the locality ().\nHistory\nInskip Point Provisional School opened circa 1884 and closed circa 1893. It reopened circa 1895, closing permanently circa 1896.\nIn 2011, a large sinkhole consumed much of the beach at Inskip Point, with the hole size estimated at 100 m+ long and 50 m+ deep.\nIn September 2015, a large sinkhole opened up near Rainbow Beach, affecting campers along Inskip Point. Fishermen were the first to notice the shoreline quickly receding into the ocean around 10:30 pm. One witness described the opening of the sinkhole as \"sounded like a thunder noise\" while another said \"it was amazing to see\".  The sinkhole was 150 metres long, 50 metres wide and three metres deep. The sinkhole swallowed up one car, a caravan, a camper trailer and several tents. 140 people were evacuated from the campground, but no injuries were reported.  Most of the campers were able to move their vehicles out of harm's way before their campsites were submerged in water.\nDemographics\nIn the , Inskip had a population of 52 people.\nIn the , Inskip had a population of 22 people.\nEducation\nThere are no schools in Inskip. The nearest government primary school is Rainbow Beach State School  in neighbouring Rainbow Beach to the south-east. The nearest government secondary school is Tin Can Bay State School (to Year 10) in Tin Can Bay to the south-west. For secondary schooling to Year 12, the nearest government secondary school is Gympie State High School in Gympie to the south-west.\nAmenities\nThere is a barge/boat ramp with floating walkway at Bullock Point (). It is managed by the Gympie Regional Council.\nAttractions\nScenic helicopter flights operate from the airfield.\nReferences"
    }
  ]
}