{
  "content": [
    {
      "type": "text",
      "text": "# Institute of International Banking Law & Practice\n\nThe Institute of International Banking Law & Practice is a non-profit American educational and research organization that studies banking law and practice. It was founded in 1987.\nThe institute's efforts to harmonize international law and practice have resulted in the ISP98 (International Standby Practices) and ICLOCA (International Center for Letter of Credit Arbitration). It has also played an important role in reforms such as U.S. Revised UCC Article 5 and the United Nations Convention on Independent Guarantees and Standby Letters of Credit.\nThe institute has also helped combat commercial and financial instrument fraud.\nGeneral\nThe Institute sponsors projects, programs, and publications intended to harmonize letter of credit law and practice.\nThe Institute issued the International Standby Practices (ISP98) (ICC Publication 590). Its principles have also played an important role in the revision of U.S. UCC Article 5, the formation of the United Nations Convention on Independent Guarantees and Standby Letters of Credit, the eUCP, and the International Standard Banking Practice (ISBP).\nThe institute, through its founder and director, has worked with the BAFT-IFSA, the International Chamber of Commerce, the United Nations Commission on International Trade Law (UNCITRAL), and the National Law Center for Inter-American Free Trade.\nIts work involves issues as diverse as rulemaking, amicus curiae briefs, risk management, product management, consultation on litigation issues, standard forms, and reviews of international operational procedures, new products, and systems evaluations.\nThe institute has also been at the forefront in the battle against financial instrument fraud, sponsoring international programs and publications directed at combating these scams.\nHistory\nThe institute was directed by George Mason University School of Law, Professor James E. Byrne, until he died in 2018.\nPrograms\nThe institute hosts The Annual Survey of Letter of Credit Law & Practice and The Guarantee & Standby Forum each year.  . It also holds an annual LC Law Summit for lawyers, and various local and on-site training programs and educational seminars. These events bring participants from banks, law firms, regulatory agencies, importers, exporters, and third party intermediaries\nIn addition, the Institute publishes the monthly journal, Documentary Credit World (DCW), successor to Letter of Credit Update, and a series of books including the Annual Surveys of Letter of Credit Law & Practice (gathering together all LC related articles and abstracting legal opinions in the English language), the 20th Century Survey of LC Law & Practice, The Official Commentary on the International Standby Practices, the Commentary on UCP500, ISP98 & UCP500 Compared, Letter of Credit Rules and Laws: Critical Texts and the Comparison of UCP600 & UCP500.\nAnnual Survey of Letter of Credit Law & Practice\nCovers all reported letter of credit and independent guarantee court decisions from around the world of the past year. This reference tool tracks industry activity impacting ICC rules (UCP600, URDG758, ISP98), and other incidents influencing international banking.\nDocumentary Credit World\nContaining statistics, news items, and expert opinions regarding specific operational and legal issues concerning banking, international trade, and finance, Documentary Credit World is a monthly publication that reports on the development of Letter of Credit Law and Practice and related issues.\nUCP600: An Analytical Commentary\nThe institute's UCP600: An Analytical Commentary provides an  interpretation of the text of the UCP in light of letter of credit practice. This study is approximately 1,500 pages, and is updated annually with Pocket Parts.\nThe Commentary includes:\n* Examination of each article and subarticle of UCP600.\n* Discussion of the prior history of each article tracing its development through prior versions of the UCP.\n* Reference to ICC Banking Commission Opinions and legal cases from around the world relevant to each article.\n* Reference to other rules of practice (ISP98, URDG) and legal systems (US UCC Article 5, UN LC Convention, Chinese LC Rules) relevant to each article.\n* Index and appendices.\n* Pocket parts which are annually updated to reflect developments in law and practice.\nComparison of UCP600 & UCP500\nThis work compares UCP600 and UCP500 by article with analysis and commentary of the evolving rules appearing below the text. Regarded as a practical text indicating what is changed, how it affects bank and business practices, legal implications and how SWIFT has adapted to suit the changes to these rules.\nThe Official Commentary on the International Standby Practices\nThe Official Commentary on the International Standby Practices provides guidance for users, bankers, attorneys, and other specialists in working with ISP98 for standby Letter of Credit practice. Each of the 89 rules is analyzed, including context and implications.\nISP98 & UCP500 Compared\nA companion to the Official Commentary on the ISP. Written an indexed to track the relationship between ISP and the UCP this book is a legal reference to compare the two rules. It is supplemented with a concise reference sheet that notes significant differences between ISP98 and UCP600.\nLetter of Credit Rules and Laws: Critical Texts\nContaining UCP600, ISP98, eUCP 1.1, URDG 758, and the International Standard Banking Practice (ISBP 2007, and ISBP 2013) .\nStandby & Demand Guarantee Practice\nProvides a legal and practical comparison of the three main practice rules encountered in the banking community regarding independent guarantees and standby letters of credit (URDG 758, UCP600, and ISP98).[https://shop.iiblp.org/collections/lc-publications]\nTrade Based Financial Crime Compliance\nThis book focuses on the \"trade\" element of trade based financial crime and compliance, including investigations into terrorism finance, sanctions, commercial fraud, and anti-money laundering issues.[https://shop.iiblp.org/collections/lc-publications]\nReferences"
    }
  ]
}