{
  "content": [
    {
      "type": "text",
      "text": "# Institute for the Study of the Ancient World\n\nThe Institute for the Study of the Ancient World (ISAW) is a center for advanced scholarly research and graduate education at New York University.  ISAW's mission is to cultivate comparative, connective investigations of the ancient world from the western Mediterranean to China. Areas of specialty among ISAW's faculty include the Greco-Roman world, the Ancient Near East, Egypt, Central Asia and the Silk Road, East Asian art and archaeology, Late Antiquity and the early Middle Ages, ancient science, and digital humanities.\nISAW was founded in 2006 with funding from the Leon Levy Foundation, established to continue the philanthropic legacy of Leon Levy, co-founder of the Oppenheimer mutual funds. Long interested in ancient history, Levy in his final years, along with his wife Shelby White, began discussions about the creation of a path-breaking institute where advanced scholars would explore trade and cultural links among ancient civilizations. After Levy's death in 2003, one of the earliest initiatives of the Leon Levy Foundation, was the fulfillment of that plan.  ISAW is a discrete entity within New York University, independent of any other school or department of the university, with its own endowment and its own board of trustees, and is housed in separate facilities in a historic six-story limestone on East 84th Street in Manhattan near the MET.\nGovernance, faculty, and staff\nThe director of ISAW is Alexander Jones (classicist). He succeeded the founding director Roger Bagnall in September, 2016. Jennifer Chi was the founding exhibitions director and chief curator, who guided the visual arts program until 2018.\nAs of September 1, 2021, the following individuals served as ISAW faculty:\n* Lorenzo d'Alfonso\n* Claire Bubb\n* Roderick B. Campbell\n* Sebastian Heath\n* Robert G. Hoyland\n* Alexander Jones\n* Antonis Kotsonas\n* Beate Pongratz-Leisten\n* Daniel T. Potts\n* Sören Stark\n* Lillian Lan-ying Tseng\nAs of September 1, 2021, Senior Staff Members included:\n* Diane Bennett (associate director for administration)\n* Tom Elliott (associate director for digital programs and senior research scholar)\n* Clare Fitzgerald (associate director for exhibitions and gallery curator)\n* Marc LeBlanc (associate director for academic affairs)\n* David M. Ratzan (head, ISAW Library)\nISAW's website describes its governance structure as follows:\nAppointments and academic programs of the Institute for the Study of the Ancient World are under the jurisdiction of its faculty, which achieved independent status in fall, 2010, and which is led by the director. The director reports to the provost and president of New York University. In addition, the institute has its own [http://isaw.nyu.edu/people/directors-council Director's Council]. Its chair is the institute's founder, Shelby White. The council plays a crucial role in ensuring that ISAW fulfills its mission and has the means necessary to do so. It provides essential advice to the director on strategic directions and public programming, and its members are vital ambassadors for ISAW in enlarging the public reached by its work.\nLibrary\nISAW houses a research library of approximately 40,000 non-circulating print volumes. The ISAW Library is a branch library of the NYU Division of Libraries, with facilities located on four floors of ISAW's facilities on East 84th Street. The library is open to members of the ISAW and NYU communities, as well as to scholars from other institutions who can demonstrate a need to access materials in the collection for their research.\nParticular areas of strength in the ISAW Library's print collection include Greek and Roman material culture and history, Papyrology, Egyptology, Mesopotamian Archaeology and Assyriology, Central Asia and Iran, and Early China.\nThe library is engaged in providing access and support for new and emerging forms of digital scholarship, scholarly communication, and pedagogy in ancient studies. The library's digital initiatives include the [https://dlib.nyu.edu/ancientworld/ Ancient World Digital Library] (AWDL) and a joint project with ISAW Digital Programs to help catalog the online and open access resources.\nReferences\nExternal links\n*[http://isaw.nyu.edu/ official website]"
    }
  ]
}