{
  "content": [
    {
      "type": "text",
      "text": "# Insurgent attacks on Warszawa Gdańska railway station\n\n| combatant2        =\n| commander1        = Tadeusz Pełczyński,Karol Ziemski,Mieczysław Niedzielski,Alfons Kotowski\n| commander2        = Willi Schmidt,Capt. Wollenweber\n| strength1         = approx. 1,300 soldiers\n| strength2         = approx. 500 soldiersArmored train No. 75artillery\n| casualties1       = approx. 500–600 killed and wounded\n| casualties2       = unknown (according to Polish sources: 50 killed and 25 wounded)\n| coordinates       =\n| commons           =\n}}\nInsurgent attacks on the Warszawa Gdańska railway station were multiple attempts by soldiers of the Home Army to capture the Warszawa Gdańska railway station in Warsaw during the Warsaw Uprising of 1944.\nThe station, along with a complex of neighboring facilities, formed one of the strongest centers of German resistance in the northern part of Warsaw. Due to the failure of Polish attacks at the \"W\" Hour, the station, along with the bypass railway line, created a barrier that separated the Home Army units in the Old Town from the insurgent Żoliborz. From the first days of the uprising, the Polish command intended to establish a corridor between the two districts, but it only became possible to undertake serious offensive actions after the arrival of nearly 900 Home Army soldiers from the Kampinos Forest to Żoliborz. However, two night assaults, carried out on August 20/21 and August 21/22, ended in complete failure due to the enemy's firepower superiority and mistakes made by the Polish command in planning and organizing the assault. The Home Army units suffered heavy losses, with between 500 and 600 killed and wounded.\nThe assaults on the Warszawa Gdańska railway station were among the bloodiest combat actions of the Warsaw Uprising. According to many historians, their failure contributed to the subsequent fall of the Old Town.\nPolish attack at \"W\" Hour\nWarszawa Gdańska railway station and its garrison\ncirca 1940]]\nin the background]]\nFollowing the onset of the German invasion of the Soviet Union, occupied Warsaw rose to become one of the key communication hubs behind the Eastern Front. Among the crucial facilities on Warsaw's railway mainline at that time was the complex of buildings at Warszawa Gdańska railway station, adjacent to the Orbital Railway. The Germans attached great importance to its proper defense, hence the station, along with the nearby Citadel Rail Bridge (railway and road), formed the core of one of the strongest German defensive centers in northern Warsaw. According to intelligence available to the Polish Home Army in July 1944, the personnel and fortifications of German installations along the Żoliborz section of the orbital railway were as follows:\n* Warszawa Gdańska railway station – the station area was secured by a machine gun nest and six individual firing positions. A detached unit from the 2nd Battalion of Station Guards was stationed in the station buildings, usually accompanied by several officials armed with handguns. From the Feliński Street side, the station was guarded by a fortified guardhouse with a 12-man garrison. Near the station buildings, there was also a transit point for furloughed soldiers, where around 40 soldiers usually stayed. Since July 26, 1944, the nearby road viaduct connecting Żoliborz with Śródmieście was also defended by a Panzer IV tank. The station's garrison, like the posts at the nearby bridges, was connected by field communication wires to the Cytadel fortress.\n* Citadel Rail Bridge – the southern abutment of the bridge complex was guarded by a permanent garrison of around 40 soldiers and an anti-aircraft battery equipped with quadruple 20mm cannons. Approaches to the bridge were intensively patrolled.\n* Warsaw Citadel – the fortress was one of the key German strongholds in this part of the city, but in practice its relatively small garrison could only conduct passive defense. The Citadel secured the approaches to the station and bridges from the north and could provide fire support to its defenders. At the outbreak of the uprising, the fortress was defended by between 300 and 400 soldiers equipped with machine guns and four anti-aircraft guns.\n* Józef Poniatowski High School – located at the corner of Lis Kula and Bitwa pod Rokitną streets, housed a German military hospital during the occupation. It was permanently guarded by six sentries, several armed auxiliary workers, and an average of 100 patients. The high school provided northern flank protection to the station complex.\n* Institute of Industrial Chemistry – located at 8 Łączności Street, provided western flank protection to the station complex. During the occupation, it housed the SS Hauptversorgungslager (Main Supply Camp of the SS), with some rooms allocated as a transit point for soldiers of the 14th Waffen Grenadier Division of the SS. In late July and August 1944, the institute's garrison likely consisted of around 50 German SS men and 500 Ukrainian collaborators, armed with from 2 to 4 anti-aircraft guns and machine guns. Access to the building was defended by a two-meter-high wall with carved firing positions, barbed wire obstacles, and bunkers at entrance gates and corners of the fence.\n* Legion Fort, Traugutt Fort, school at 10 Krajewski Street – these three facilities secured the station and bridges from the south. Shortly before the outbreak of the uprising, the school was evacuated by the Germans. Legion Fort housed three anti-aircraft guns and a searchlight, operated by several dozen soldiers. Traugutt Fort was defended by at least several dozen soldiers armed with machine guns. Nearby, in the Romuald Traugutt Park, the 3 Battery of the 769 Light Anti-Aircraft Artillery Division occupied positions. Approaches to both forts were protected by barbed wire obstacles.\nIn reality, at the outbreak of the uprising, the German forces in the vicinity of the Warszawa Gdańska railway station turned out to be significantly stronger. From mid-July 1944, the section of the orbital railway line from the railway bridge near the Citadel to Warszawa Zachodnia station was secured by an armored train, Panzerzug 75. Additionally, on August 1, elements of the 73 Armored Grenadier Regiment of the 19 Panzer Division (2nd Battalion and a sapper company) were unloaded at Warszawa Gdańska railway station. They were sent later that same day towards Warka, but their soldiers had already supported the station's garrison in combat against the insurgents. Furthermore, following the outbreak of fighting, the station's defense was temporarily reinforced with three self-propelled guns Grille sent from the SS barracks at Rakowiecka Street.\nForces and plans of the Home Army\ncodenamed Żywiciel, commander of the Żoliborz Subdistrict]]\nThe insurgent plans envisaged that Warszawa Gdańska railway station and its neighboring facilities would be seized by soldiers from Region I of the Żoliborz Subdistrict. The assault on the station buildings was to be carried out by platoons No. 201 and 210 (\"railway platoons\"), departing from their base at the municipal concrete plant on Inflancka Street. After capturing the facility, Polish soldiers were to occupy the station equipment, establish communication with the Warszawa Praga railway station, and set in motion captured locomotives, which along with several empty freight cars were then to be made available to units advancing on the Institute of Chemistry and Bema Fort.\nAt the same time, other units of Region I were to capture: the Citadel, positions of the German anti-aircraft artillery in Traugutt Fort and Romuald Traugutt Park, the left-bank abutment of the bridge complex near the Citadel, the high school, and the PAST telephone exchange at 39 Feliński Street. It was also planned to engage the defenders of the Institute of Chemistry, with the capture of the building scheduled after the seizure of Warszawa Gdańska railway station. The assault engineer platoon was tasked, among other things, with blowing up the railway viaduct over Krajewski Street and the road viaduct near Warszawa Gdańska railway station.\nDuring the planning stage of the insurgent operation, some officers of the Żoliborz Subdistrict argued that due to the weak armament of their own units, the number of attack objectives should be reduced, and in the initial phase of combat, they should focus on blocking the strongest points of German resistance. Particularly active in this discussion was Captain Marian Kamiński codenamed Ster, commander of Region I, who advocated for his units to strike with full force at the Citadel during \"W\" Hour, and subsequently concentrate on capturing Warszawa Gdańska railway station. Ster argued that the capture of the relatively lightly defended Citadel would not only increase supplies of weapons and ammunition but also significantly facilitate the capture of the bridge complex near the Citadel and provide access to the Vistula and connection to Śródmieście. However, these proposals were rejected by the command of the Warsaw District, which believed that a swift and simultaneous assault on all German facilities in Warsaw would surprise and incapacitate the enemy garrison. According to the operational order issued by the district command on July 25, 1944, the Żoliborz Subdistrict was to attack 18 \"targets of combat\", with the task of Region I being to capture the Citadel, Warszawa Gdańska railway station, the bridges, the Institute of Chemistry, and the school at Krajewski Street. Additionally, the headquarters of the Żoliborz Subdistrict decided that, in addition to the targets indicated in the district command's order, all those objects that had been considered primary targets in the district's previous tactical plans would also be attacked. In the case of Region I, these were high school and the telephone exchange on Feliński Street. Adopting this tactic led to the dispersal of insurgent forces and largely contributed to the failure of subsequent attacks.\nAttack of Region I\nOn July 27, 1944, in Warsaw, Governor of the Warsaw District, Ludwig Fischer, issued an order requiring 100,000 Polish men and women to report the following day for work on fortifications along the Vistula. Later that same day, Colonel Antoni Chruścielcodenamed Monter, the commander of the Warsaw District of the Home Army, declared an alert for Home Army units in the capital. However, in the afternoon of July 28, the state of alert was rescinded, and Home Army soldiers dispersed to their homes without major incidents. The prolonged waiting period, especially the evident disparity between their own forces and the enemy, negatively affected troop morale. These tendencies did not spare the Żoliborz Subdistrict. In the \"railway platoons\", only 30% of soldiers remained at their assembly points by the early morning hours of July 29, as the rest, who lacked weapons, returned home. In Platoon 208, composed mostly of \"blue policemen\", there was even a mutiny, as most soldiers, including the platoon commander, Lieutenant Jacek, disobeyed orders and left the assembly points on their own initiative.\nIn the morning of August 1, the units of the Żoliborz Subdistrict resumed mobilization efforts. Soon, reports began to arrive at the district headquarters indicating that the Germans were reinforcing their main strongholds. Captain Eugeniusz Muszyńskicodenamed Paweł, who commanded the \"railway platoons\", reported that the enemy had significantly increased the garrison at Warszawa Gdańska railway station, occupying the station and fortifying the tracks, and had deployed a company-sized unit to secure the locomotive depot. In response, during a briefing at 2:00 PM, the district headquarters decided that Paweł would conduct reconnaissance by combat in the station area only, and in case of encountering strong resistance, he would break off the attack and join the main forces of the region. However, this order did not reach the soldiers of the \"railway platoons\". Meanwhile, by around 2:00 PM, regular fighting had erupted in Żoliborz, seriously disrupting preparations for the insurgent action. Surprise was lost, the district's communication system was paralyzed, and the entire district quickly became isolated from the rest of the city. Amidst the ensuing chaos, many soldiers failed to arrive on time at assembly points, and a portion of weapons and ammunition did not reach them either.\nShortly before \"W\" Hour, approximately 50 soldiers (50% of their strength) gathered at the assembly point of the \"railway platoons\" in the municipal concrete plant on Inflancka Street. Their armament was very modest, consisting of only two submachine guns, nine rifles, several pistols, and grenades. A group of unknown insurgents, whose assembly point was the nearby Customs Office building, joined the fight a few minutes before 5:00 PM. The firefight further heightened the vigilance of the Warszawa Gdańska railway station crew, prompting Paweł to order an immediate attack. However, only a dozen armed Home Army soldiers launched the attack. The rest, lacking weapons, refused to participate in combat. Faced with this situation, Paweł abandoned the earlier plan to capture the railroad crossing along Feliński Street and instead directed his meager forces to attack the station buildings. The insurgents came under heavy machine gun fire just meters away from the German fortifications. Two Polish soldiers were killed, and one was wounded. The insurgents managed to capture a German heavy machine gun position briefly, but Paweł soon ordered a retreat.\nThe remaining units of Region I also failed to achieve success. The assault by Platoon 204 on the bridge complex near the Citadel stalled under the fire of German machine guns shortly after departing from their starting positions. Platoon 207 and 209 managed to approach within striking distance of enemy positions in Traugutt Fort and Romuald Traugutt Park and even destroyed one of the machine gun nests. However, the final assault faltered under intense fire, and both platoons suffered heavy casualties, amounting to 59% of their initial strength. Nearly two hours of fighting later, the attack on the Citadel by Platoons 202, 203, and 205 was also repulsed. Platoon 206 and 208, where only 30% of soldiers arrived punctually at assembly points, limited themselves to firing upon the Institute of Chemistry building. The assault by the Military Protection Service on the high school and the telephone exchange did not materialize at all.\nThe consequences of the failure suffered by the soldiers of Region I at \"W\" Hour were very serious. Although the insurgents managed to capture the high school building and the telephone exchange on August 2, Warszawa Gdańska railway station and other strongpoints along the orbital railway line remained in German hands. These now constituted a barrier separating insurgent-held Żoliborz from Home Army units in the Old Town.\nFirst attempts to break through the German barrier\nAugust 5, 1944, saw the start of the German counteroffensive against the insurgent forces in Warsaw. After three days of fierce fighting, a battle group led by SS-Gruppenführer Heinz Reinefarth captured most of Wola and then broke through to the Government District around Józef Piłsudski Avenue. The area controlled by Home Army forces shrank to four isolated districts: Śródmieście with Powiśle, Old Town, Żoliborz, and Mokotów. After the fall of Wola, the main objective of the German offensive became the Old Town of Warsaw. The German command aimed to secure access to the Vistula river from the Cross-City Bridge to the Kierbedź Bridge, thus permanently securing the rear of German forces fighting the Red Army on the river's right bank. According to Adam Borkiewicz, the Old Town became the \"decisive battlefield\" that would determine the fate of the uprising.\nEven before the fall of Wola, Colonel Monter decided to organize an insurgent bastion in the northern part of the city with a command center in Żoliborz. The district commander hoped that this would establish a supply base for the fighting capital and relieve the main Home Army forces fighting in Śródmieście. Monter temporarily lost confidence in the commander of the Żoliborz Subdistrict, Lieutenant Colonel Mieczysław Niedzielski, codenamed Żywiciel,; ).}} so he entrusted command of the Home Army forces in Żoliborz and Kampinos Forest to Colonel Karol Ziemski, codenamed Wachnowski. Early on August 6, Wachnowski attempted to reach Old Town twice from Wola but failed. Meanwhile, on August 6, General Tadeusz Komorowski, codenamed Bór, evacuated from Wola to Old Town. The underground army commander then modified the tasks set by Monter before Wachnowski. The Home Army Headquarters decided to focus on maintaining Old Town and created a new combat group, known as Północ Group. Historians disagree on which Home Army units formally joined the group. According to Grzegorz Jasiński, Wachnowski subordinated all Home Army units north of Wolska – Chłodna – Elektoralna – Senatorska (the so-called Wola artery). However, Piotr Stachiewicz and Antoni Przygoński argued that only Wola and Old Town units were part of Północ Group, while Żoliborz and Kampinos Forest units operated independently.\nThe defense concept for Old Town adopted by the Home Army command from the outset involved the need to secure ground communication with the insurgent Żoliborz. Several arguments supported this solution. Firstly, the German cordon around Warsaw remained weak, making it realistically possible to organize a supply and recruitment base in Kampinos Forest for the Old Town and Żoliborz units. Secondly, if halting the German offensive proved impossible, Północ Group could withdraw to Żoliborz at the right moment, avoiding encirclement and destruction in Old Town. Furthermore, the insurgent command believed it would be easier to secure a corridor to Żoliborz than to establish a connection with Śródmieście, whose defenders in Old Town were separated from the main forces of the German Battle Group Reinefarth.\nIn the first weeks of the uprising, the Germans focused their efforts on unblocking the main Warsaw communication arteries and capturing Old Town, hence they did not undertake serious offensive actions in the Żoliborz direction. Already in the first days of August, they expanded their fortifications around Warszawa Gdańska railway station, the Chemical Institute, and along the outer railway line, also reinforcing their garrisons. They also began clearing the outskirts by destroying residential buildings, accompanied by numerous crimes against the civilian population. On August 6, Polish residents were expelled from houses near Warszawa Gdańska railway station and forced to work dismantling insurgent barricades. When some civilians attempted to flee to the insurgent-controlled area, German soldiers opened fire, killing at least three people and injuring many others on August 7 or 8. German troops burned down the unemployed barracks estate at Feliński Street, not allowing an unspecified number of inhabitants to leave burning buildings. The Germans also pacified the area around Błońska Street, where they shot between 50 and 68 Poles. Poorly armed units commanded by Lieutenant Colonel Żywiciel were unable to take effective countermeasures.\nAccording to Grzegorz Jasiński, on August 7, Colonel Wachnowski decided to launch an attack in cooperation with units from Żoliborz towards the Warszawa Gdańska railway station. This perspective also sheds light on the actions taken between August 7 and 9 by the Radosław Group, usually interpreted by other historians as an attempt to retreat towards Kampinos Forest. Preparations to capture the station were set to begin on August 8. Reconnaissance results from that day indicated that about 40 German soldiers defended the station, supported by an armored train and a railcar-mounted cannon. They could also receive artillery and machine gun fire from the Citadel, Buraków, the Chemical Institute, and Romuald Traugutt Park. Jasiński further states that the command of Północ Group decided to launch an attack with approximately 300 soldiers, including from the Czata 49 and Miotła battalions, plus Lieutenant Olszyna's platoon. The attack planned for the night of August 8/9 did not materialize due to organizational and technical reasons, as officially reported. Jasiński speculates that Colonel Radosław may have independently postponed the attack due to soldier fatigue and logistical issues.\nThe next assault was scheduled for August 9 at 10:00 PM.; ).}} The commander of Północ Group planned for soldiers from the Wola-Old Town units (Czata 49, Leśnik, part of the Chrobry I Battalion) as well as the Żoliborz Żaglowiec Group to participate in the attack. Lieutenant Colonel Żywiciel, who was skeptical about the chances of success, attempted to persuade Colonel Wachnowski to postpone the attack by another day, but without success. Ultimately, for reasons not entirely clear, the Polish offensive actions took a very modest form. From the Powązki and Old Town side, a detached sub-unit from the Czata 49 Battalion, which was advancing towards the station buildings, and part of the Chrobry I Battalion and a 20-man group under Second Lieutenant Jaroń from the Leśnik unit, which attempted to engage German positions in Romuald Traugutt Park, launched the attack. Grzegorz Jasiński claimed that due to heavy mortar and machine-gun fire and the threat posed by an armored train, the Polish soldiers had to withdraw without engaging the enemy directly. In an official report, however, it was stated that the insurgents reached the station buildings but were unable to set them on fire due to poor-quality gasoline. During the fight, the Polish soldiers reportedly captured a prisoner and some weapons at the cost of a few wounded, and killed or wounded several Germans. At the same time, on the other side of the tracks, the Żoliborz 205th Platoon began its action, but on the order of Captain Żaglowiec, its soldiers limited themselves to firing on the enemy positions.\nDespite the previous failures, Wachnowski did not intend to give up on securing a corridor between the Old Town and Żoliborz. However, increasing German pressure on the Old Town prevented the Home Army units there from undertaking significant offensive actions. On the other hand, the Żoliborz units were too few and poorly armed to break through the German barrier on their own. Although on the night of August 12/13, Colonel Monter ordered Północ Group to secure three passages along the bypass railway line the next day, the commander of insurgent Żoliborz questioned this order, pointing to the lack of adequate forces and resources. Żywiciel proposed a joint attack by Żoliborz and Old Town units on the weakest section of the German defense – the Chemical Institute and the German anti-aircraft artillery positions at Buraków. However, this idea was not accepted by the insurgent command. As a result, actions aimed at breaking through the German fortifications along the bypass railway line were postponed until the arrival of reinforcements from the Kampinos Forest.\nRelief from Kampinos Forest\nActions of Kampinos units in early August\nThe Warsaw Uprising also extended into Kampinos Forest, where units from the VIII District Łęgi of the Home Army's Warsaw District, commanded by Captain Józef Krzyczkowski, codenamed Szymon, joined the fight. After mobilization in July 1944, the Łęgi District could field two infantry battalions comprising five frontline companies, with an armed strength not exceeding 440 soldiers. Fortunately for the Polish side, the balance of power in Kampinos Forest shifted dramatically at the end of July 1944, when the Stowbtsy-Naliboki Group arrived from Naliboki forest in Eastern Borderlands, stationed in Dziekanów Polski. It consisted of 861 well-armed soldiers, led by Lieutenant Adolf Pilch, codenamed Góra or Dolina, a seasoned partisan who had been fighting against Germans and Soviet partisans since autumn 1943.\nAccording to the uprising plans, the primary objective of the VIII District was to capture the Bielany airfield. However, two attacks launched on August 1/2 ended in failure and significant losses. Captain Szymon was severely wounded, and several other officers were killed or injured, with most of the ammunition expended. The VIII District units were forced to retreat deeper into Kampinos Forest, specifically around the villages of Wiersze, Truskawka, Janówek, and Krogulec. On August 3, based on the existing units of the VIII District and the Naliboki Group, the Palmiry-Młociny Regiment was formed. On the same day, severely wounded Captain Szymon transferred command to Lieutenant Dolina during combat operations, reserving for himself the task of issuing combat tasks and overall leadership. Throughout early August, individual soldiers and small units began arriving in Kampinos Forest from various districts of Warsaw, as well as neighboring regions. For instance, on August 2, a company from Wiersze under Lieutenant Franciszek Wiszniowski, codenamed Jurek joined the VIII District (formally part of the Western Subdistrict Hajduki). Two days later, Lieutenant Marian Olszewski's unit, codenamed Maryś, from District III Wola arrived in the forest with about 100 soldiers, mostly unarmed. Additionally, around August 4, approximately 160 soldiers from District III Bielany of Żoliborz Subdistrict arrived, led by Captain Władysław Nowakowski, codenamed Serb, who refused to submit to the command of the VIII District. By mid-August, these arriving units formed the partisan group known as the Kampinos Group.\nThe Home Army command held high hopes for this strong partisan group in Kampinos Forest. On August 7, two orders were sent to Captain Szymon signed by the head of the operational department of Home Army Headquarters, Colonel Józef Szostak, codenamed Filip. According to these orders, all Home Army units operating in the forest and neighboring VII District Jelsk were placed under Szymon's command. Simultaneously, Szymon was instructed to urgently form a unit composed of the most experienced soldiers and officers, then send them to the Powązki Cemetery area to establish contact with the Radosław Group.\nHowever, these orders reached Szymon only on the afternoon of August 8, by which time the Palmiry-Młociny Regiment, after attempting to block the road between Leszno and Babice, had retreated to the Wiersze area. Furthermore, the previous evening, Captain Stanisław Nowosad, codenamed Dulka, dissolved the Kampinos infantry battalion without consulting the command, reducing the regiment's strength from 2,000 soldiers to around 1,400. In these circumstances, Szymon believed that immediate execution of Home Army Headquarters' order was impossible due to soldier fatigue, lack of weapons, and ammunition. He postponed sending relief to Warsaw until the receipt of Allied air drops of arms and ammunition, instructing Lieutenant Dolina to conduct thorough reconnaissance around Powązki Cemetery first. The first air drops were received on the nights of August 9/10 and August 10/11, significantly arming the partisan units in the forest. However, the commander of the VIII District still believed that his units were not ready to march to the relief of the capital and considered their deployment premature, potentially serving only as a demonstration rather than real support for the uprising. This belief was reinforced by Szymon's reconnaissance findings, indicating that the Radosław units had already withdrawn from the Powązki Cemetery area. According to General Albin Skroczyński, Szymon missed the only good opportunity during those days to effectively assist the besieged Old Town and create conditions for establishing tactical communication with the rest of the city.\nThe failure of Szymon to execute the order to attack Powązki caused dissatisfaction among the insurgent command. Consequently, they decided to appoint a combative and energetic officer to activate local units of the Home Army in Kampinos Forest (a solution also suggested by Captain Szymon himself).).}} They chose Major Alfons Kotowski, codenamed Okoń, the former commander of Pięść Battalion. In an order dated August 9,).}} Colonel Wachnowski appointed Okoń as the commander of Szymon's unit, instructing him to organize relief for Warsaw in Kampinos Forest and subsequently conduct relieving attacks on Powązki or Koło (through the Powązki cemeteries). Okoń was also tasked with attempting to link up with the Radosław Group fighting in the Okopowa – Stawki area and ''seeking communication with units of the 'Hallerowo' Subdistrict, whose commander had received a similar task. On August 12, Okoń along with ten companions began an expedition to Kampinos Forest. During two attempts to pass through the canals to Żoliborz, his group encountered a series of obstacles and lost three soldiers under various circumstances, eventually surfacing near Warszawa Gdańska railway station. There, the major and his soldiers fell into German hands and only through a stroke of luck managed to avoid execution. Ultimately, the entire group ended up in a transport with Ukrainian refugees, heading to the Dulag 121 camp in Pruszków. During a stop at Warszawa Zachodnia station, Okoń bribed Polish railwaymen, allowing him to escape from the train with two soldiers and a liaison. As a result of these adventures, the major only reached the units of the Kampinos Group during the night of August 15 to 16.\nWhile Okoń was heading to Kampinos Forest, a serious competence dispute erupted among the officers present in the forest. Whereas the eastern part of the forest, territorially belonging to the pre-war Warsaw County, was part of the territory of the Warsaw District of the Home Army, the remaining part of the forest – including its central area where the units of the Kampinos Group were quartered – was located in the pre-war counties of Sochaczew and Błonie, which were part of the Western Subdistrict of the Warsaw District of the Home Army (codenamed Hallerowo or Hajduki). Already around August 6/7, the commander of the Hajduki Subdistrict, Lieutenant Colonel Franciszek Jachieć, codenamed Roman, sent a radio dispatch to the Home Army Headquarters, proposing to transfer under his command four western regions of the Warsaw District, including the VIII Region. Home Army Headquarters responded negatively to this proposal, and in the meantime, the commander of the Warsaw District, General Albin Skroczyński, codenamed Łaszcz, ordered Roman to organize and send at least two infantry battalions (one to Żoliborz, the other to Mokotów) to aid Warsaw based on the structures subordinate to him. Initially, based on the Sochaczew District of the Home Army, only one company under the command of Captain Wilhelm Kosiński, codenamed Mścisław, was organized, which departed for Wiersze on August 10. Accompanying the unit was the Inspector of the Skierniewice Inspectorate of the Home Army, Lieutenant Colonel Ludwik Wiktor Konarski, codenamed Wiktor or Victor, who, on behalf of Lieutenant Colonel Roman, attempted to subordinate all Kampinos units to himself. Victor and Roman primarily referred to pre-uprising guidelines from Home Army Headquarters, which stipulated that all partisan units arriving from foreign territories were obligated to subordinate themselves to the appropriate territorial commander. Szymon and Dolina, referring to orders received from Home Army Headquarters a few days earlier, adamantly refused to subordinate themselves to the Hajduki command. Szymon instead expressed readiness to transfer command to Lieutenant Colonel Ludomir Wysocki, codenamed Mróz – commander of the Northern Subdistrict Tuchola of the Home Army, who with his staff remained cut off from the parent district and was stationed in the Legionowo area.\nOn August 12, Lieutenant Colonel Victor returned to the headquarters of the Hajduki in Milanówek. There, during a subdistrict staff meeting, it was decided to establish a well-armed battalion with a strength of at least 400 soldiers based on the Sochaczew and Błonie districts, under the command of Victor, and then to deploy it to aid Warsaw. critically assessed that it was only wounded pride that finally prompted the command of the Hajduki Subdistrict to execute General Łaszcz's order to deploy a full infantry battalion to Żoliborz.}} It was also decided to make another attempt to subordinate the units of the VIII Region. On August 13, Victor set out again for Wiersze, where he arrived two days later. On August 15, Lieutenant Colonel Roman sent a message to Victor, informing him that he was handing over all armed units from the Błonie and Sochaczew districts to his disposal, while confirming the order to take command of the Kampinos Group. If Dolina did not subordinate himself to Victor, he was to be relieved of command and brought before a military court. However, Lieutenant Colonel Konarski did not manage to receive this order before marching with the relief for the capital.\nFirst relief attempt\nColonel Wachnowski, without communication with Okoń and unaware of the difficulties he encountered in attempting to cross to Żoliborz, decided not to wait for further developments and immediately ordered the Kampinos units to set out to relieve Warsaw. In the afternoon of August 13, he directed four liaison officers under the command of Lieutenant Stanisław Jankowski, codenamed Agaton, to establish contact with Captain Szymon. Around 1:00 AM on August 15, the liaisons reached the School and Educational Centre for Blind Children in Laski, where the wounded commander of the VIII Region had been staying since August 2. Meanwhile, on August 14 in the afternoon, Wachnowski sent a radio message to Szymon, informing him of Major Okoń'''s assumption of command over the forest units and announcing that the Home Army liaison officers would await him at the porter's lodge of the Centre for Blind Children from midnight on August 15. The commander of Północ Group also ordered Captain Szymon to detach all armed soldiers from the Kampinos Group and form a strike force to be moved to the area of the Wola cemeteries, from where the forest fighters would then strike in two directions:\n* from the Powązki Cemetery to Stawki Street, tasked with seizing Muranów and establishing contact with the defending units in that area;\n* from the Jewish and Evangelical cemeteries, tasked with seizing the northern segment of Okopowa Street (from Dzika Street to Dzielna Street).\nOn August 14, the radio station of the Kampinos Group also received a dispatch from General Bór, sent openly to all Home Army units, the content of which was as follows:Fight for Warsaw is dragging on. It is being conducted against a great enemy advantage. The situation demands immediate march to aid the capital. I command to immediately direct all available well-armed units with the task of hitting enemy forces located on the outskirts and suburbs of Warsaw and entering into the fight inside the city.Upon receiving these orders, Szymon immediately began organizing a strike force. Despite clear instructions from Wachnowski, he believed that sending all armed soldiers to Warsaw would be wasteful of strength and resources. In his assessment, it would be better to retain the Naliboki cavalry, which had been effective in skirmishing with enemy forces until now. Moreover, if all armed soldiers were sent away, the Germans could easily destroy the Kampinos Group, thereby eliminating not only a partisan group that tied up significant enemy forces, but also an efficiently functioning supply and reception base. Ultimately, by Szymon's decision, approximately 500 armed soldiers remained in the forest, including all cavalry, the staff of the Palmiry-Młociny Regiment, and the Kampinos Group. Heading to Warsaw were:\n* the group under the command of Captain Władysław Nowakowski, codenamed Serb, consisting of about 160 soldiers from Region III of the Żoliborz Subdistrict;\n* a company under the command of Captain Wilhelm Kosiński, codenamed Mścisław, with between 110 and 150 soldiers from the Hajduki Subdistrict (commonly known as the Sochaczew Company);\n* an infantry battalion under the command of Lieutenant Witold Pełczyński, codenamed Witold, detached from the Palmiry-Młociny Regiment. The unit numbered over 450 soldiers and included:\n** a small escort of the commande;.\n** 1st company under the command of Lieutenant Franciszek Baumgart, codenamed Dan. It consisted of 150 soldiers, mostly from the former Stowbtsy-Naliboki Group, with an exception of about 50 soldiers from Lieutenant Kazimierz Nowak's, codenamed Andrzej, platoon, originating from Region II Marymont of the Żoliborz Subdistrict;\n** 2nd company under the command of Lieutenant Henryk Czerwiec, codenamed Jaskólski. It consisted of 150 soldiers, mostly from the former Stowbtsy-Naliboki Group, with about 30 soldiers from outside the Stowbtsy-Naliboki environment, including members of Corporal Tadeusz Zaleski's, codenamed Wir, youth team. The company's command cadre consisted primarily of officers originating from District III Wola, who arrived in the forest in early August with Lieutenant Maryś' unit;\n** 3rd company under the command of Second Lieutenant Józef Krzywicki, codenamed Prawdzic. It consisted of 150 soldiers, mostly from the former Stowbtsy-Naliboki Group. An exception was the squad of Private Fabian Rafalski, codenamed Fab, which included several Warsaw residents, as well as a few escaped Soviet prisoners and two Dutch deserters from the Wehrmacht.\nIn the ranks of units dispatched to relieve Warsaw, there were at least 720 soldiers. Thanks to Allied airdrops, they were well-armed. In Lieutenant Witold's battalion, each squad had: 1 light machine gun, 1 submachine gun, 8 rifles, 2 pistols, and 10 grenades. Each platoon additionally had 1 PIAT launcher and 2 submachine guns, and each company had 1 heavy machine gun and 1 mortar. There were 1,500 rounds per light machine gun, 700 rounds per submachine gun, 18 rounds for the PIAT launcher, and 30 rounds for the mortar. Riflemen received 200 rounds each. The Sochaczew Company and Captain Serb's group were similarly equipped. Many soldiers carried additional ammunition and grenades for the defenders of the Old Town. Given the prospect of urban combat, the forest companies of Lieutenant Witold's battalion were partially supplemented with \"Warsaw\" command cadre, as well as a certain number of soldiers from the city or its suburbs. Four Home Army Headquarters liaisons under Lieutenant Agaton were to serve as guides.\nAt 1:00 PM on August 15, a meeting began at Laski's Centre for Blind Children, which quickly turned into a long and very unpleasant discussion. Years later, its participants presented divergent versions regarding the causes and course of the conflict. Szymon and Dolina claimed that the key point of contention was the issue of command over the relief units. The former proposed that Lieutenant Witold, as an experienced partisan and commander of the largest unit, should lead the relief to Warsaw, while Lieutenant Colonel Victor insisted that as the highest-ranking officer, he should be in charge of the entire group. On the other hand, Victor maintained that the dispute was not so much about command but about the tasks facing the relief units. During the meeting, he expressed his conviction that attacking Stawki and Wola – in the dark, with divided forces, and without prior reconnaissance of enemy positions – was an ill-conceived and hopeless action, and executing it would be at best an act of desperation and a pre-determined defeat. Regarding the command issue, he only mentioned that the operation should be led by one officer, without specifying who it should be and not putting forward his own candidacy. Szymon, meanwhile, demanded the literal execution of Colonel Wachnowski's order, suggesting that one column under Victor's command should attack Stawki and establish contact with the defenders of Muranów, while another under Witold's command should take control of the northern section of Okopowa Street. Ultimately, it was decided that the relief would set out under the general command of Lieutenant Colonel Victor, but upon reaching the Powązki area, the units would carry out tasks independently. If the column managed to reach Warsaw undetected and establish contact with the Old Town units, the Polish units were to conduct reconnaissance in the Stawki area under favorable conditions.\nThe Polish units set out from Laski on August 15 at 10:00 PM. Their route passed near the villages of Mościska, Gać, and Parysów. Through a liaison, Szymon informed Lieutenant Colonel Żywiciel that the Kampinos units would strike towards the Old Town on the morning of August 16 (this message only reached Colonel Wachnowski on the morning of August 16). Years later, Lieutenant Colonel Victor reported that the Polish units were formed into four columns moving at intervals of between 120 and 150 meters.; ; ). Other sources, however, claim that the Polish group moved in a single long column, with ''Serb's group at the front, Witold's battalion in the middle, and the Sochaczew Company at the rear (; ; ).}} The leftmost column was Captain Serb'''s group, the left middle column was Second Lieutenant Prawdzic's company, the right middle column was Captain Mścisław's Sochaczew Company, accompanied by Victor himself, and the rightmost column was the remaining two companies from Lieutenant Witold's battalion. The front and flanks were covered by patrols. They took a break every hour to maintain contact between all columns. The night was relatively bright, with visibility around 100 meters. No German interference was encountered along the way, but soon confusion spread within the Polish formation. In unclear circumstances, Captain Serb's group separated from the main forces and independently reached the insurgent Żoliborz.; ; ; ). However,  and  suggested that Captain Nowakowski's group only moved to Żoliborz when they lost contact with the other units in the darkness of the night. On the other hand,  claimed that ''Serb's soldiers were subordinate to Lieutenant Colonel Victor only during the march, and it was always intended that they would move to Żoliborz. Captain Nowakowski himself maintained in his post-war memoirs that Lieutenant Colonel Victor poorly organized the march, leading to the units getting lost in the field, which forced the group to move to Żoliborz independently ().}}\n, codenamed Agaton]]\nMeanwhile, around 1:00 AM, the remaining units reached the military cemetery area at Powązki. They learned from a captured German motorcyclist that a German armored pioneer unit was quartered in a building a few hundred meters away. A patrol confirmed that the Germans had barricaded themselves in the building, with between 14 and 20 armored vehicles (with locked hatches) parked nearby. Junior officers urged Lieutenant Colonel Victor to order an attack, believing there was a unique opportunity to destroy the enemy unit and capture several intact armored vehicles. However, Victor'' judged that it would not be possible to break the enemy without fierce fighting, and given the lack of information about other German units' locations, the attack would be an unnecessary risk and fireworks to document audacity.\nThere are divergent accounts regarding the further course of events. Lieutenant Agaton claimed that after Victor abandoned the attack, he ordered the column to bypass the cemetery, but the civilian guide refused to lead the column further. Victor then allegedly ordered a retreat to the Kampinos Forest, which, with dawn approaching, risked exposing the Polish units to German artillery fire from Buraków and Fort Bema. In these circumstances, Agaton reportedly took command on his own initiative and, without opposition from Victor or other officers, led the soldiers to Żoliborz. On the other hand, Lieutenant Colonel Konarski claimed that he decided to turn the units west only to avoid the Germans and bring the soldiers to Warsaw, and that his officers were well informed about this plan. Ultimately, the Polish column, avoiding contact with the enemy, was said to have reached Żoliborz under Victor's leadership. However, in the darkness, some units lost their way and returned to the forest: Second Lieutenant Prawdzic's company (in its entirety), the platoons of Second Lieutenants Mata and Janusz from Lieutenant Jaskólski's company, and part of the Sochaczew Company. Only the following units reached the capital: Captain Serb's group, Second Lieutenant Dan's company (in its entirety), Lieutenant Jaskólski with one platoon of his company, and Captain Mścisław with part claimed that only Captain Mścisław and a retinue of about a dozen people reached Żoliborz, while most of the Sochaczew Company returned to the Kampinos Forest. On the other hand,  states that approximately 90 soldiers from the company reached Żoliborz that night along with Mścisław.}} of the Sochaczew Company (together between 400 and 460 soldiers). Upon arriving at Żoliborz, junior officers accused Victor of incompetence and cowardice, and shortly thereafter, the Chief of Staff of the Home Army Headquarters, General Tadeusz Pełczyński, codenamed Grzegorz, ordered him to return to his original district, without imposing any official sanctions on him. The course of the failed raid, particularly the roles played by Lieutenant Colonel Victor and Lieutenant Agaton, remained controversial among historians and veterans for years.; ; ).  assessed that the course of the night march and the preceding officers' briefing indicated that Lieutenant Colonel Konarski lacked leadership abilities, and the public criticism of higher command orders, which he engaged in during the mentioned briefing, led to the later insubordination of Captain Serb. In contrast,  took a completely different stance, believing that Victor – a professional infantry officer – was right to oppose the risky and ill-considered attack on Stawki. Bonarowski also believed that Lieutenant Agaton played a decidedly negative role in these events, allegedly first trying to provoke a \"night brawl with the Germans\" in Powązki, and later destroying Lieutenant Colonel Konarski's reputation by accusing him of cowardice and incompetence.  also believed that Victor acted rationally by not attacking the German unit in Powązki, and that the chaos accompanying the night march was, in his opinion, the result of the insubordination of junior officers, particularly Captain Serb and Lieutenant Agaton.}}\nMeanwhile, in the early hours of August 16, the Żoliborz and Old Town units were waiting in vain for sounds of fighting from the Stawki direction. Anticipating that further units of the Kampinos Group would soon pass through Żoliborz, Colonel Wachnowski decided to initiate offensive actions on the northern sector of the Old Town defense. According to his plans, the Old Town Paweł Group was to attempt to recapture the warehouses at Stawki during the night of August 16/17, while the Żoliborz units under Colonel Żywiciel were tasked with engaging enemy forces in the Warszawa Gdańska railway station area. Due to the fact that Wachnowski did not have direct communication with Żoliborz (radio contact was maintained via London),; ).}} the coordination of the action failed. In the evening of August 16, unexpectedly, the order from Wachnowski arrived at Colonel Żywiciel's staff, canceling the operation. Meanwhile, at midnight on August 17, the units of the Paweł Group began their attack according to the original plan. On the left wing along Nalewki Street, soldiers of the Maciek and Giewont companies from the Zośka Battalion advanced towards Muranowska and Niska streets. Shortly after leaving their starting points, the Polish attack became bogged down in the ruins of the Warsaw Ghetto under heavy German fire. The Zośka soldiers, losing 10 killed and 12 wounded, were forced to withdraw to their starting positions. Among the fallen was Lieutenant Eugeniusz Stasiecki, codenamed Piotr Pomian, who commanded the attack. The Polish forces fared slightly better on the right wing, where soldiers of the Czata 49 Battalion advanced from their starting points around Żoliborska Street, supported by Colonel Leśnik's unit. At around 12:30 AM, they captured the warehouses at Stawki in a swift assault. The insurgents seized two vehicles, a machine gun, a few grenades, and ammunition. Despite heavy enemy fire, the Czata 49 soldiers held the warehouses for over two hours. With the Żoliborz units remaining passive and dawn approaching, holding onto Stawki became pointless, so the Polish unit withdrew to their starting positions after 3:00 AM. The night battle cost the Czata 49 Battalion 1 killed, 1 missing, and 7 wounded.\nArrival of Okoń's unit\n, codenamed Okoń, among the soldiers of the Kampinos Group]]\nDuring the night of August 15/16, Major Okoń reached Wiersze. He immediately began organizing the second wave of relief for Warsaw. The task was facilitated by the continuous influx of soldiers from the Hajduki Subdistrict and other regions and districts into Kampinos Forest. Additional Allied airdrops also enabled the re-mobilization of reservists from the VIII District, dispersed a week earlier by Captain Dulka. Within a few days, over 360 volunteers joined the insurgent units, of whom approximately 80 had no previous ties to the underground movement. On August 16, Okoń reported to Wachnowski that he intended to resume offensive operations near the Wola cemeteries. On the same day, the command of the Kampinos Group received radio messages from Colonel Monter and General Bór. The first was addressed to Major Okoń, ordering the forest units to advance towards Żoliborz. The second was addressed to Lieutenant Dolina and included the following summons:Warsaw bleeds for 15 days. Your inactivity indicates reluctance to fight. Do not wait for fully armed units. I command you to execute the task with the men already armed. The rest will be armed later. For inaction, I will hold commanders legally responsible [...]On August 18, in a radio message, Okoń informed Wachnowski that he had completed the formation of a strike force and would be ready to depart for Warsaw at 9:00 PM on the same day. He also proposed that on the night of August 19/20, his unit, along with the forest units that arrived in the capital three days earlier, would launch an attack from the Żoliborz direction towards Warszawa Gdańska railway station and the tram depot in Muranów. The objective of the assault was to secure a corridor for the Old Town units to withdraw to Żoliborz. However, this plan conflicted entirely with the plans of the commander of the Północ Group, who had no intention of abandoning the defense of the Old Town. Wachnowski ordered Okoń and his unit to move to Żoliborz and attempt to breach the circumferential railway line with Żoliborz and Old Town units, then seize the warehouses at Stawki along with nearby high-rise buildings. If successful, part of the units were to occupy the captured objects, while the rest would be at the disposal of the Północ Group command. Wachnowski also informed Colonel Żywiciel and Colonel Paweł about the planned assault. The following days revealed that coordinating actions between the Polish groups in the Old Town, Żoliborz, and Kampinos Forest would be extremely difficult, as orders and reports were delayed or not received at all due to the malfunctioning communication.\nThe planned attack for the night of August 19/20 did not materialize, as Okoń and his soldiers only departed from Wiersze in the afternoon of August 19. Grzegorz Jasiński speculated that the delay was due to waiting for the results of negotiations with the command of Hungarian forces stationed in the area separating Warsaw from Kampinos Forest. The following units departed for Warsaw on that day:\n* three infantry companies formed by the Palmiry-Młociny Regiment. Each company consisted of four 40-person platoons:\n** a company commanded by Lieutenant Karol Hartfil, codenamed War;\n** a company commanded by Lieutenant Józef Krzywicki, codenamed Prawdzic;\n** a company commanded by Lieutenant Grot;\n* platoons of Lieutenants Mata and Janusz from Lieutenant Jaskólski's company, who on the night of August 15/16 failed to reach Żoliborz and returned to Kampinos Forest. Their structure and composition remained unchanged – both consisted of 50 soldiers;\n* an infantry company commanded by Lieutenant Józef Jodłowski, codenamed Mazur, composed of soldiers from the Błonie and Sochaczew districts of the Hajduki Subdistrict. Depending on the sources, its strength was estimated at 102 or 160 soldiers;\n* an independent platoon commanded by Lieutenant Tadeusz Gaworski, codenamed Lawa, consisting of approximately 30 to 40 soldiers from the Air Department of the Home Army Headquarters (known as the aviation platoon). This unit arrived in Kampinos Forest on August 18.\nThus, Okoń commanded a battalion totaling up to 780 soldiers. According to Edward Bonarowski, each platoon in Okoń's units consisted of eight squads – with five in each platoon – equipped with 1 light machine gun and 1 submachine gun. Additionally, each platoon had 1 PIAT launcher, and each company was equipped with 1 mortar and 1 heavy machine gun (slightly different data can be found in other sources). reported that the average armament of an eight-person squad in ''Okoń's battalion consisted of: 1 light machine gun, 2 submachine guns, 7 rifles, and 20 grenades. Each platoon was additionally equipped with one PIAT grenade launcher and two submachine guns. Okoń's battalion also had two heavy machine guns with 3,000 rounds and two mortars with 50 shells.}} During the march to Warsaw, five soldiers and three nurses from the Felek Platoon of Battalion Zośka, who had been cut off from their main forces after the withdrawal of the Radosław Group from the area of Wola cemeteries on August 11, joined Okoń'''s battalion after five days in Kampinos Forest.\nThe departure from Wiersze took place at 2:00 PM or 3:00 PM. Once again, Home Army Headquarters liaisons Lieutenant Agaton and Lieutenant Stefan Bałuk, codenamed Kubuś served as guides. The soldiers arrived at Laski by trucks and continued on foot. Near the villages of Gać and Wawrzyszew (according to other sources, in Mościska), Okoń's unit encountered Hungarian posts, but after brief negotiations, the Hungarians agreed to let the Poles pass without a fight. However, that night, order in the column was once again lost. In Słodowiec, soldiers from the Sochaczew Company broke formation to quench their thirst from a fire hydrant. As a result of this unplanned halt, the company (or part of it), as well as the aviation platoon under Lieutenant Lawa, lost contact with the rest of the column. In search of a way to Żoliborz, soldiers from both units reached Powązki, where they encountered German posts. Faced with the threat of discovery by the enemy, Lieutenant Mazur and his soldiers turned back to the forest. Lawa decided to continue the search, but after wandering all night, they found themselves back at Słodowiec at dawn. The platoon found shelter in one of the houses, where the soldiers spent the whole day, barely avoiding detection by the Germans who had begun burning the settlement and displacing its residents that day. Ultimately, the aviation platoon returned to the forest only on August 21. The remaining subunits of Okoń's battalion reached Żoliborz on August 20 at 4:30 AM and settled in Warsaw Cooperative Housing blocks on Suzin Street, where forest fighters had been stationed for four days alongside Colonel Victor's forces.\nThe attempts to organize relief from Kampinos Forest did not go unnoticed by German intelligence. Initially, the Germans speculated that paratroopers dropped over the forest by Allied aircraft were attempting to reach Warsaw. Subsequent reports were more precise. In a report dated August 18, the Sonderkommando Spilker informed that 300 partisans from Kampinos Forest had crossed over to Żoliborz three days earlier. Furthermore, in the diary of operations of the German 9 Army dated August 21, it was noted: From the eastern part of Kampinos Forest, movements of reinforcements for the insurgents in Warsaw were observed. Three days later, army counterintelligence reported: From the wooded area south of Modlin, the enemy is attempting to reinforce the bandits fighting in Warsaw with groups of about 500 soldiers each. The Germans, however, overestimated the strength of the Kampinos Group, estimating it at around 5,000 to even 15,000 partisans.\nNight attack on the night of August 20/21\nPreparations\nOn August 20, there were already 1,800 frontline soldiers armed with rifles in Żoliborz, including from 750 to 940 forest fighters from the Kampinos Group. The plan developed at Colonel Żywiciel's headquarters envisaged that during the night of August 20/21, the forest fighters, covered from both flanks by Żoliborz units, would secure a ground corridor between Żoliborz and the insurgent-held Old Town. Specific tasks were assigned to various groups:\n* six forest companies under Major Okoń were to capture the buildings of the Warszawa Gdańska railway station and the nearby section of the orbital railway, and subsequently take control of the Customs Agency building on Inflancka Street and the tram depot in Muranów. It was assumed that the link with the defenders of the Old Town would occur at Bonifraterska Street. Following the forest fighters were sappers, whose task was to blow up the tracks;\n* Żniwiarz Group supported by a sapper patrol under Lieutenant Antoni Jarosiński, codenamed Student, was to reach the railway tracks near the so-called Żoliborz Viaduct at the junction of Mickiewicz and General Zajączek streets, after which they would blow them up in order to neutralize the enemy's armored train. After completing this task, the soldiers were to withdraw to the starting bases;\n* Żaglowiec Group, with the fire support of two heavy machine guns from the high school building, was to assist the attack of the forest fighters. Additionally, Platoons 202 and 205 were assigned the task of engaging enemy positions in the building at 7 General Zajączek Street and on the ramparts of the Citadel, while Platoon 206 was to secure the flanks of Okoń's soldiers from the direction of the Chemical Institute;\n* Żyrafa Group was to engage enemy units occupying the Chemical Institute and its immediate vicinity. In case the Germans launched a counterattack from around the institute towards the right flank of Okoń's units, the Żyrafa soldiers were to stop them with a left flank attack.\n* Żbik Group was to simulate an attack on the Chemical Institute and German artillery positions on Buraków by deploying machine gun patrols forward. This was aimed at disrupting the German artillery fire towards the outskirts of Warszawa Gdańska railway station;\n* a mortar platoon was tasked with shelling German positions on top of the Żoliborz Viaduct;\n* the assault companies under Okoń were assigned a doctor and five medical patrols (three were to accompany soldiers to the orbital railway line, and the other two were positioned on the opposite side of the tracks). The main medical point was set up in the high school building, with ambulances waiting on Górski Street to transport the wounded to other hospitals and dressing stations in Żoliborz if needed.\nOn August 20 at 8:30 PM, Lieutenant Agaton along with two companions reached the Old Town through the sewers, where he delivered the attack plan proposal to Wachnowski. The commander of the Północ Group made no amendments, and Agaton managed to return to Żoliborz by 11:00 PM. In the meantime, Wachnowski via London sent a radio message to Okoń, informing that upon hearing gunfire from Żoliborz, the Radosław Group soldiers would advance towards the forest companies. He also instructed the forest fighters to take as many grenades as possible for the defenders of the Old Town.\nThe width of the attack zone was only 300 meters, so Okoń's companies had to launch the attack in two waves, with three companies each. During the two officer briefings held on August 20, specific tasks were not assigned to individual subunits, nor was the starting time of the attack specified. It was only mentioned that the soldiers would start from their bases in the area of Wojska Polskiego Avenue. The attack was scheduled for the night to surprise the enemy and break their will to resist, as Major Okoń put it: ''A German at night is a coward – at the cry of 'Hurrah!' he runs. The soldiers were ordered to advance quietly and refrain from firing in response to weak enemy fire as much as possible. The high school building was to support the attack with fire from two heavy machine guns from Platoon 202 of Żaglowiec, and from the area of General Zajączek Street with fire from two heavy machine guns of Major Okoń'''s units. The plan stipulated that upon reaching the railway tracks, the first wave of companies would fire a green flare, which would signal the second wave and the sappers to begin the attack. Meanwhile, the first wave was to secure the area above the tracks and organize their formations, only continuing the attack after the second wave had passed. According to Wachnowski's order, the assault companies were instructed to take additional supplies of weapons, ammunition, and grenades for the defenders of the Old Town. The forest fighters were also provided with wire cutters to cut through barbed wire.\nSoldiers from Kampinos Forest did not know the terrain and lacked experience in urban combat. Despite requests from assault company officers, Colonel Żywiciel refused to assign local guides to the forest units., this factor should not be overestimated, as the forest companies had a sufficient number of Warsaw elements.}} Polish officers and soldiers also had a very vague idea about the number of defenders at Warszawa Gdańska railway station and their positions. Although forest unit officers were led to the front line where they could survey the terrain from the upper floors of the tallest buildings, this reconnaissance yielded little effect.).}} Piotr Stachiewicz stated that before the attack, the commander of the Żbik Group, Captain Witold Plechawski, codenamed Sławomir, informed Lieutenant Witold, who led the first wave, that about 300 soldiers defended the peripheral railway line, with six machine gun nests, six cannons, an artillery battery prepared for close-range firing, a mortar, and a tank. On the other hand, Edward Bonarowski claimed that during briefings preceding the attack, subunit commanders were assured that they could expect, at most, shelling from advanced German machine gun nests in the ruins of barracks for the unemployed on Feliński Street. Commanders and soldiers of the forest units, however, were not warned to expect strong resistance from enemy artillery and the presence of an armored train. As a result, officers left briefings convinced that breaching the railway line would not be too difficult. It is possible that Colonel Żywiciel and his staff, impressed by the armament and numbers of the forest units, believed that breaking through to the Old Town would not be a difficult task.\nIn reality, between Żoliborz and the Old Town, the main forces of the German Strike Group Schmidt operated, whose numbers vary depending on sources, estimated at 1,450 or 2,000 soldiers. The area around Warszawa Gdańska railway station and the Citadel was held by two infantry battalions, with approximately 500 soldiers defending just the peripheral railway line (mainly from the 46th Motorized Pioneer Battalion). Defensive positions along the tracks were covered by obstacles made of barbed wire and reinforced bunkers. The outskirts of Warszawa Gdańska railway station and the nearby section of the peripheral railway were flanked by German artillery and machine gun fire from the Chemical Institute, Buraków, the Citadel, Traugutt Fort and Romuald Traugutt Park, from the west and east. Additionally, Germans could initiate artillery fire within 15 minutes. Support for defenders could also come from Armored Train No. 75 under the command of Captain Edom, running along the peripheral railway line. Moreover, German intelligence was well aware that insurgents intended to break through the peripheral railway line in the area of Warszawa Gdańska railway station and establish a ground connection between Żoliborz and the Old Town. Reports regularly reached the staff of SS-Obergruppenführer Erich von dem Bach-Zelewski regarding the timing and direction of expected attacks. As a result, from August 10 onwards, Germans systematically reinforced garrisons of resistance points and progressively expanded and densified their network of defensive positions. A few days before the insurgent attack, they also undertook limited offensive actions on the Żoliborz front, aiming to extend their holdings in the area around the peripheral railway line. On August 18, they captured the PKO building complex at 7 General Zajączek Street and 9 Dymińska Street, providing them with a convenient vantage point over General Zajączek, Mickiewicz, and Skwarczyński streets. Attempts by Żywiciel's soldiers to recapture this position were unsuccessful.\nIn these circumstances, the task assigned to Major Okoń's units was extremely difficult. They were forced to carry out a frontal assault on heavily fortified enemy positions, under fire from both flanks. Neutralizing German resistance points with firepower was virtually impossible, as Home Army units lacked heavy weaponry. Although the Home Army command repeatedly demanded Allied airstrikes on the peripheral railway line from Warszawa Gdańska railway station to Warszawa Zachodnia station, as well as airstrikes on the Bielany airfield, the Józef Piłsudski University of Physical Education, the Citadel, and Bema Fort, the allies refused, arguing that the destruction caused could be disproportionate to the losses suffered. Essentially, the attackers' only advantage was that German positions lay in a narrow, flat corridor approximately 600 meters wide, so a concentric and simultaneous attack from Żoliborz and the Old Town theoretically could break through. However, exploiting this advantage required excellent coordination, which remained extremely difficult due to poorly functioning communication.\nCourse of the attack\nPublications describing the course of both insurgent assaults on Warszawa Gdańska railway station contain numerous errors and are often contradictory. Most historians, memoirists, and commentators relied heavily on the account in Rapsodia Żoliborska by Stanisław Podlewski, which in hindsight proved to be somewhat inaccurate.\nAccording to the version of events cited in most older publications, the Polish attack began shortly after midnight on August 21. Three companies from Lieutenant Witold Pełczyński's, codenamed Witold, battalion, were supposed to launch the attack from their starting positions in houses on Lis-Kula and Bitwa pod Rokitną streets. They were led by Lieutenant Franciszek Baumgart, codenamed Dan, Lieutenant Henryk Czerwiec, codenamed Jaskólski, and Second Lieutenant Witold Kazimierz Drwota, codenamed Murzyn. Inexperienced in urban combat, the forest soldiers failed to maintain the necessary silence. When the Polish skirmish line was from 100 to 150 meters from the tracks, the Germans illuminated the area with flares and opened intense machine gun fire. Soon after, an armored train and German artillery from the Citadel, Buraków, and Bema Fort joined the fight. The right-wing company under Second Lieutenant Murzyn suffered the worst, subjected to crossfire from the Chemical Institute building. This unit was instructed to advance first and then withdraw to their starting positions. However, the companies of Dan and Jaskólski managed to reach the tracks, destroying several German machine gun nests along the way. Yet, within the three-hundred-meter assault zone, Germans laid down such heavy artillery and machine gun fire that continuing the attack became impossible. Second wave units did not engage, as the soldier from Lieutenant Jaskólski's company, tasked with signaling the agreed-upon green flare upon reaching the tracks, was torn to shreds along with the rocket launcher by an artillery shell. A liaison officer sent by Jaskólski to Major Okoń also perished. Ultimately, the bloodied first wave companies were forced to retreat to their starting positions. Polish casualties in this attack were reported to exceed 100 killed and several dozen wounded. Among the fallen was Sergeant Cadet Antoni Piątkowski. codenamed Korab, commander of one of the platoons in Lieutenant Jaskólski's company, as well as the crews of two heavy machine guns. The company of Lieutenant Dan reportedly suffered the highest losses, amounting to 50% of its personnel.\nA completely different account of events emerges from the 2014 memoirs of Lieutenant Edward Bonarowski, codenamed Ostromir, who served as deputy commander in Second Lieutenant Prawdzic's company during both attacks. He stated that the first wave, led by Lieutenant Witold, included the Naliboki company of Lieutenant Dan, as well as the Kampinos companies of Second Lieutenants Wara and Grot. The second wave, commanded by Captain Mścisław, comprised the Naliboki companies of Lieutenant Jaskólski and Second Lieutenant Prawdzic, along with the Sochaczew Company. First wave units departed from their base positions near high school and the so-called \"City Blocks\" (Dan), and from houses on the even-numbered side of Wojska Polskiego Avenue opposite the allotment gardens (Wara and Grot). Meanwhile, second wave units were deployed as follows: Jaskólski's company at Bitwa pod Rokitną Street, Prawdzic's company at the end of Wieniawski Street, and the Sochaczew Company near Stołeczna Street.\nAccording to Bonarowski, the Polish attack began around 10:00 PM (other sources indicate 1:00 AM). Shortly after leaving their base positions, soldiers from Dan's company came under fire from enemy positions hidden in the ruins of \"burned barracks\". The Naliboki platoons attacked the ruins from two sides, eliminating enemy positions with grenades. However, German artillery soon became active, firing across the entire Polish assault zone. The Wara's and Grot's companies, newly formed with inexperienced reservists from Kampinos villages, could not withstand the barrage and retreated disorderly towards Feliński Street. Lieutenant Witold was injured due to enemy fire. Enemy artillery fire also caused significant losses among the Żoliborz medical patrols. Dan's company managed to breach the enemy's fire line, but its left-wing platoon, 225, suffered heavy losses and had to be withdrawn. The Żniwiarz Group did not engage at all.\nAt that point, Polish command decided to launch three companies from the second wave into the attack. Units from the first wave were to regroup and reorganize while waiting for the second wave to signal with a green flare, indicating that they had breached the tracks. The Sochaczew Company attacking on the right wing was withdrawn shortly after crossing Wojska Polskiego Avenue and essentially did not participate in the attack. Meanwhile, Jaskólski's company and half of Prawdzic's company, supported by machine gun fire from the high school building, attacked from both sides on the \"burned barracks\" and after a brief fight, pushed the Germans beyond the outer railway line. Dispersed platoons of Jaskólski and Prawdzic reached the tracks and lay in their forefront, awaiting the arrival of the first wave companies. During this time, the Germans essentially halted their fire. To the surprise and dismay of Polish soldiers, just before midnight, an order was issued to withdraw all platoons to their starting positions. The reasons for issuing this order are not known.\nAccording to Bonarowski, the first assault on Warszawa Gdańska railway station lasted about an hour and a half. Polish casualties were reported to be about several dozen killed and wounded, significantly fewer than typically stated in the literature. The German artillery fire was responsible for the majority of casualties; the number of soldiers killed and wounded in the fight for the \"burned barracks\" turned out to be minimal. The attack lasted so briefly that initially, the headquarters of Północ Group believed it had not occurred at all. Bonarowski believed that this night saw the squandering of the only real chance to break through the German barrier between the Old Town and Żoliborz. In his opinion, the failure was primarily due to mistakes made by Lieutenant Colonel Żywiciel and his staff. Particularly detrimental was the decision to abolish the earlier organizational division into Witold's (Naliboki) and Mścisław's (Kampinos-Sochaczew) battalions. Instead of integrated battalions, mixed \"waves\" were sent into the attack, over which their formal commanders had limited control in practice. Bonarowski assessed that if three integrated and battle-hardened Naliboki companies had led the first wave attack, success would have been possible.\nFall of Muranów\nOn August 20, the Germans launched continuous attacks throughout the day against Muranów, defended by soldiers from Battalion Czata 49 and the Leśnik unit. In fierce battles, the defenders suffered heavy casualties and depleted most of their ammunition and grenades. By the afternoon, the insurgents held only a complex of buildings in the area around Sierakowska, Muranowska, and Przebieg streets. At 10:00 PM, German infantry supported by tanks resumed their attack, but anticipating the forest units' counterattack, Colonel Paweł, commanding the defense of this sector, ordered the extremely exhausted soldiers to hold their positions at all costs.\nAround midnight, a detached unit from Battalion Czata 49, led by Lieutenant Szczęsny, managed to break through the rubble near Sierakowska Street towards Warszawa Gdańska railway station. The soldiers heard the sounds of heavy gunfire from the direction of the station and saw rocket lights. There are conflicting accounts of what happened next. Some sources state that in the open space between the edge of the Old Town buildings and the railway tracks, the Polish unit came under intense fire from enemy machine guns and artillery, after which they withdrew along Bonifraterska Street. Other authors suggest that sensing the fading of the fight around Warszawa Gdańska railway station, the soldiers under Szczęsny returned to their starting bases to continue repelling German attacks.\nOn August 21, just before dawn, Colonel Paweł's soldiers withdrew from Muranów. The loss of this district had far-reaching consequences, as it pushed the Home Army units defending the Old Town away from Warszawa Gdańska railway station and Stawki. It also expanded the German wedge between Żoliborz and the Old Town. The northern defense sector of the Old Town was shortened, with only two redoubts remaining: the Hospital of St. John of God and the complex of buildings of the Polish Security Printing Works.\nNight attack on August 21/22\nPreparations\nFollowing the fall of Muranów and the failure of the attack on Warszawa Gdańska railway station, the mood in the Północ Group headquarters significantly deteriorated. In a dispatch to Colonel Monter sent on the morning of August 21, Colonel Wachnowski expressed concern for the first time that holding the Old Town might become impossible. Despite the worsening situation in the Old Town, the Home Army command was determined to launch another attack and secure a corridor to Żoliborz. Wachnowski decided to support another attack of the Kampinos-Żoliborz units with a strong attack from the Old Town side. Believing that the failure of the first attack was due to mistakes made by Colonel Żywiec and Major Okoń, he requested that the Home Army High Command appoint a senior officer to lead the next attack from the Żoliborz side. The Home Army High Command responded positively to this request. Initially, it was planned that the attack would be led by the head of Home Army intelligence, Colonel Kazimierz Iranek-Osmecki, codenamed Heller. Eventually, the Chief of Staff of the Home Army High Command, General Tadeusz Pełczyński, codenamed Grzegorz, took on this task. He was also tasked with assessing the feasibility of evacuating the High Command from Warsaw to Kampinos Forest. Around 7:00 AM on August 21, Grzegorz, accompanied by Major Tadeusz Jachimek, codenamed Joker, and Major Jan Kamieński, codenamed Cozas, descended into the sewers and, after nearly three hours, reached Żoliborz. There, after hearing reports from Żywiec and Okoń, he personally surveyed the area ahead of the attack.\nThe attack plan developed by Grzegorz and Żywiec included some changes compared to the previous night's plan. This time, the push of the forest units was to occur between Stołeczna Street and the ruins of the \"burned barracks\", progressing along Feliński Street – Pokorna Street – Nalewki Street – Brodziński Street – Stawki Street – Gęsiówka. The forest units were divided into three waves.; ; ; ).}} The first wave, led by Major Okoń and Lieutenant Witold, consisted of the companies of Lieutenant Jaskólski (left wing) and Lieutenant Prawdzic (right wing). The second wave was to be composed of the companies of Lieutenant Grot (left wing) and Captain Wara (right wing). The third wave included the companies of Lieutenant Dan (left wing) and Captain Mścisław (right wing). The first wave was additionally assigned assault engineers, and General Grzegorz was to accompany them with his small entourage. Due to the failure of signaling with flares the previous night, it was decided that each wave would commence its attack in twenty-minute intervals. Soldiers were instructed to shout the password Radosław! after crossing the tracks, which was the agreed signal for the units advancing from the Old Town side.\nSimilar to the first attack, the Żoliborz units were tasked primarily with covering the forest units' advance. The most challenging task was given to the Żniwiarz Group, which was to carry out a frontal assault on the buildings of Warszawa Gdańska railway station. If successful, sapper units attached to them were to blow up the railway tracks. Meanwhile, the Żaglowiec, Żyrafa, and Żbik groups, along with a mortar detachment, were to engage in feigned attacks and suppressive fire to tie down the garrisons at the Citadel, Chemical Institute, and German artillery positions in Buraków.\nBetween 330 to 350 soldiers were slated to participate in the attack from the Old Town side. The attack was to be led by the Chief of Staff of the Radosław Group, Major Wacław Janaszek, codenamed Bolek, accompanied by Captain Tadeusz Perzyński, codenamed Tomir, from General Grzegorz's staff. The attack of the Old Town units was scheduled to begin at 2:15 AM, fifteen minutes after the start of the Kampinos-Żoliborz units' attack. Major Bolek's units were assigned specific tasks:\n* Right wing: two companies from the Czata 49 and Pięść battalions, under the overall command of Captain Zbigniew Ścibor-Rylski, codenamed Motyl, were to start from their positions at Konwiktorska Street (Pięść) and at the Fiat factories on Sapieżyńska Street (Czata 49). They were to advance through Kazimierz Sosnkowski Stadium and Romuald Traugutt Park to seize Traugutt Fort.\n* Center: the 3 company of the Zośka Battalion led by Lieutenant Władysław Cieplak, codenamed Giewont was to start from the hospital buildings of St. John of God hospital near Konwiktorska Street and move through Kazimierz Sosnkowski Stadium's field towards Traugutt Fort.\n* Left wing: the 1st company of the Zośka Battalion under Henryk Kozłowski, codenamed Kmita, and a combined unit from the People's Army under Captain Henryk Woźniak, codenamed Hiszpan, were to start from the hospital buildings near Bonifraterska Street and through the ruins of the ghetto, advance towards Pokorna and Stawki streets, aiming to make contact with the Kampinos-Żoliborz units.\nIn the late afternoon of August 21, a council was held on Żoliborz led by General Grzegorz. Many junior officers expressed skepticism about repeating the attack plans. There was even a proposal to send the forest units through the sewers to the Old Town. In response, Colonel Żywiec persuaded the unit commanders that the first attack had led the Germans to retreat from advanced positions along the circumferential railway line, making the northern side of the tracks the only significant obstacle due to heavy artillery fire. He also claimed that achieving surprise was still possible. General Grzegorz attempted to boost the morale of the junior officers with the following words:''You will go above ground, not through the sewers. You will reach the Old Town. You will cover yourselves in glory. We will broadcast this through the 'Błyskawica' radio. All of Europe will learn that insurgent Warsaw has established direct contact with the area, and that you have achieved this.Despite doubts among the junior officers, Grzegorz believed that the urban units had low combat value. Initially, he considered replacing the entire command staff of the forest companies. Eventually, however, he ordered Colonel Wachnowski to send 400 soldiers from the urban units through the sewers to Żoliborz. Grzegorz hoped that the presence of battle-hardened defenders from the Old Town would boost morale among the Kampinos-Żoliborz units. The dispatch regarding this matter was sent to the Północ Group headquarters at 1:30 PM, but it was received by the Old Town radio station only five hours later. Colonel Wachnowski immediately began organizing a combined combat group, assigning its command to Captain Eugeniusz Konopacki, codenamed Trzaska. From available reports, this unit consisted of 16 officers and 208 soldiers (some sources mention 260 soldiers), delegated from the Wigry, Gozdawa, and Chrobry I battalions. The soldiers of Trzaska could only descend into the sewers by 11:15 PM and started emerging above ground around 2:00 AM due to exhaustion from the sewer crossing and their late arrival on Żoliborz. Consequently, Colonel Żywiec decided not to utilize the Trzaska unit in the attack on Warszawa Gdańska railway station. Grzegorz Jasiński, analyzing the report from Żywiec to Wachnowski on August 24, speculated that on the night of August 22/23, a 120-person company from the Jerzyki Special Units under Lieutenant Jerzy Strzałkowski, codenamed Jerzy also crossed through the sewers to Żoliborz. However, even if true, this unit did not participate in the attack either.\nDuring the preparation for the second assault, General Grzegorz and Lieutenant Colonel Żywiciel repeated many mistakes made the previous night. Proper reconnaissance was neglected, so the soldiers did not know the strength and deployment of the enemy, nor the terrain of the planned attack. Żywiciel again did not assign Żoliborz guides to the forest companies, probably counting on Trzaska'''s soldiers to replace them. Additionally, once again the soldiers were overly burdened with extra ammunition and grenade allocations\nCourse of the attack from Żoliborz\nthat the forest units attempted to cross on the night of August 21/22. On the left are the buildings on Rydygiera Street, built on the site of the former barracks for the unemployed]]\nThe strike was to begin at 2:00 AM (other sources state: 2:30 AM or 3:00 AM). Contrary to Lieutenant Colonel Żywiciel's optimistic expectations, it quickly became clear that the insurgents had no chance of achieving the element of surprise. After the experiences of the previous night, German soldiers remained vigilant, staying at their posts in combat readiness. Some sources state that around 10:00 PM, German artillery and machine guns shelled the foreground and Polish starting positions, thus hindering the development of Polish units and demoralizing the soldiers. This shelling was said to have ceased after an hour, but the foreground was still illuminated by German flares and spotlights. However, the Polish command was determined to carry out the assault at any cost. It was hoped that starting the attack in the late hours of the night would mean the strike would hit the enemy at a time when they would be least vigilant. Józef Krzyczkowski claimed that due to the failure of the first assault and the reluctance towards Major Okoń among the units, the forest soldiers entered the battle without enthusiasm and with little faith in victory.\nIn older publications, it is usually stated that because General Grzegorz forbade the use of flare signals and ordered the attack to begin at a specific time, it was impossible to properly synchronize the actions, and the Polish units started the battle unevenly. Although the attack was conducted in open terrain, the soldiers' run was hindered by clumps of bushes and weeds, and in the darkness of the night, some squads lost their way and unknowingly changed the direction of the attack. As a result, when some units had already covered 3/4 of the foreground, others were just leaving their starting positions. Near the tracks, one soldier was said to have shouted Hurrah! which was echoed by other insurgents. At that moment, the Germans illuminated the foreground with rockets and began a violent barrage using artillery and machine guns. Soon, a German armored train joined the fight, shelling the foreground and buildings on General Zajączek and Lis-Kula streets with cannon and machine-gun fire. The few Polish mortars and machine guns attempted to engage in a firefight but were successively silenced. Soon, most of the forest units lay down under the enemy fire and then, in disarray and suffering heavy losses, returned to their starting positions. The efforts of Major Okoń to rally the soldiers for another attack were to no avail. From the former Naliboki battalion led by Lieutenant Witold, the farthest advance was made by the company of Lieutenant Dan, whose soldiers reportedly reached the railroad-road crossing connecting Feliński Street with Kłopot Street and destroyed a German bunker there. Soon, however, Dan was killed, and from his company, only a dozen soldiers led by Lieutenant Rawicz managed to break through to the other side of the tracks, where they were all killed. On the right flank, a small group of soldiers led by Captain Mścisław managed to break through to Stawki Street, but there the small detachment was largely wiped out. The wounded Mścisław, along with one surviving soldier, had to take shelter in the ruins of the ghetto, where they waited out the entire day and at night made their way to the Kampinos Forest. One of the platoons from the Sochaczew Company, led by Second Lieutenant Zawieja, in the darkness of the night mistook the main line of the circumferential railway for the branch leading to Palmiry and instead of attacking southward, turned west. This unit then attacked the building of the Chemical Institute, from where it was repelled, even though the soldiers managed to blow up the gate using grenades.\nEdward Bonarowski provided a somewhat more detailed and occasionally different account of the second attack in his memoirs. He claimed that the start of the assault was delayed for unknown reasons, resulting in the first wave leaving their starting positions at Wojska Polskiego Avenue only after 2:00 AM. Both companies advanced in a skirmish line of nearly 300 men. Initially, only the German heavy machine guns stationed behind the railway line fired a few random series of shots. However, when the forest troops approached the embankment overlooking the tracks, the Germans launched dozens of flares that illuminated the entire foreground. Almost simultaneously, German artillery opened fire, and an armored train approached from the east, stopping directly in front of the Polish skirmish line and bombarding it with intense fire from cannons and machine guns. Moments later, German machine gun positions located behind the tracks also joined the fight. The synchronization of the alarm, the arrival of the armored train, and the artillery fire led Bonarowski to suspect that the Germans knew the timing of the Polish attack.\nThe companies of Jaskólski and Prawdzic suffered heavy losses and lay pinned down in a 200-meter section between the allotment gardens and the circumferential railway line. The enemy fire was so intense that any organized command became impossible, and individual platoons and even squads were forced to act independently. The crews of Polish PIATs engaged in an uneven fight with the German train, but their missiles could not inflict significant damage on the machine. Meanwhile, a second-wave company, Wara, appeared in the allotment gardens and fired on the armored train with machine guns. This fire was ineffective and even struck the first wave soldiers from behind. Eventually, the company was ordered to attack, but like the first wave, it quickly became pinned down under heavy enemy fire. Second Lieutenant War attempted to outflank the train from the west with part of his unit. However, the Polish soldiers were unaware that access to the tracks along Stołeczna Street was blocked by a 100-meter-long wire mesh fence. During the attempt to overcome this obstacle, Second Lieutenant War was killed, and his company ultimately lay down on the foreground. The enemy fire also pinned down the Grot's company.\nFour forest companies remained under fire for nearly an hour. It was already clear that the attack had no chance of success. However, the Polish command decided to throw the third wave into battle. The company of Lieutenant Dan reached the foreground of the tracks and attempted to outflank the train from the right side, but more to the west of Stołeczna Street, closer to the Chemical Institute, where the tracks were no longer protected by a wire mesh fence. Dan managed to rally only part of his company – the Naliboki platoon led by Platoon Sergeant Jan Dziemianko, codenamed Błyskawica, and the Marymont platoon 225 led by Second Lieutenant Kruk. A youth squad from Lieutenant Jaskólski's company, led by Corporal Tadeusz Zaleski, codenamed Wir, also joined Dan's company. Nearly one-third of Dan's company, against the commander's orders, remained on the north side of the tracks. Meanwhile, the lieutenant and the remaining soldiers managed to outflank the armored train and began maneuvering towards the Customs Agency building. Soon, however, the entire unit was pinned down under heavy fire from several directions. After losing their commander, Platoon 225 waited under fire for orders from the command for some time, then early in the morning began to retreat. Błyskawica also managed to return to Żoliborz. The forest soldiers and the Żoliborz insurgents saw Lieutenant Dan for the last time. Bonarowski was convinced of his death, and similar information can be found in almost all publications about this battle. Only in the early second decade of the 21st century did Marian Podgóreczny establish that Lieutenant Franciszek Baumgart, codenamed Dan – a participant in the famous escape from the Oflag VI-B camp – not only survived the night battle but also, with a group of his soldiers, broke through to the area controlled by the insurgents and then, under the codename Pomorzak, fought in the Old Town and Śródmieście. Dan survived the uprising and the war, dying in 1979 in Sztum. In the second attack on the Warszawa Gdańska railway station, however, both of his deputies – Sergeant Mikołaj Zienkiewicz, codenamed Kola, and Lieutenant Wacław Czerski, codenamed Rawicz – were killed. Corporal Wir also died.\non a barricade at the entrance of Towiański Street to Wojska Polskiego Avenue. The photo was taken several hours before the second attack]]\nWhile the forest troops were unsuccessfully attacking the circumferential railway line, Żoliborz units launched diversionary actions. Two reinforced platoons from the Żniwiarz Group reached near the tracks and engaged in a firefight with the garrison of the Warszawa Gdańska railway station buildings. In the battle, which lasted nearly an hour, Mieczysław Morawski's, codenamed Szeliga, group lost nine dead and missing and 19 wounded. Two platoons of the Żbik Group under the command of Captain Sławomir began their attack on artillery positions in Buraków at 3:15 AM and soon came under heavy enemy fire. Thanks to skillful command, the Żbik soldiers suffered no casualties. The Żyrafa Group, attempting to engage the Chemical Institute's garrison, lost one soldier killed and four wounded. The attacks by Żbik and Żyrafa managed to partially distract the German artillery, but due to its significant firepower, this only slightly improved the situation of the forest units. The Żaglowiec Group, in a firefight with the garrison of the Citadel and the occupants of the building at 7 General Zajączek Street, suffered two killed and three wounded. Later that night, after repelling the Polish attack, the Citadel garrison launched a counterattack. The Germans captured the house at 18 Mickiewicz Street, but Polish soldiers soon managed to drive them out.\nDawn was approaching when the bloodied and essentially shattered forest companies began to retreat to their starting positions. According to Bonarowski, the soldiers started the retreat on their own initiative, while Grzegorz Jasiński indicated that at 4:14 AM, General Grzegorz ordered the attack to be halted and the battlefield to be cleared. The retreat took place under difficult conditions – the soldiers who managed to escape from the forward positions came under heavy fire from the Chemical Institute building. Nearly 100 severely wounded were left on the battlefield, only some of whom managed to crawl back to the insurgent positions. Many wounded died from their injuries in \"no man's land\", and many others were finished off by German bullets in the daylight. On the morning of August 22, Polish medics attempted to collect the wounded from the battlefield but were prevented by German fire. Many of the girls were killed or wounded at that time. Among the fallen was one of the bravest Kampinos couriers – Krystyna Heczko, codenamed Teresa (posthumously awarded the Cross of Valour). That morning, rifleman Englert from Dan's company returned to Żoliborz and reported that the Germans had released him from captivity to inform the insurgents of his commander's death and the annihilation of the entire company at Stawki. Eighteen other prisoners, including some wounded, were led by the Germans from the Warszawa Gdańska railway station to the railway tracks and there executed in front of the Polish defense lines.; ).}}\nThe results of the second attack proved catastrophic. The forest companies suffered enormous losses, in some cases up to 2/3 of their personnel. The exact number of dead and wounded remains essentially impossible to determine. Adam Borkiewicz estimated that the losses of the forest and Żoliborz units in the second assault on the Warszawa Gdańska railway station exceeded 292 dead and wounded. Jan Gozdawa-Gołębiowski claimed that the total losses suffered that night by the units attacking from Żoliborz amounted to 300 killed and 200 wounded. Józef Krzyczkowski, along with other authors, estimated the losses of the forest units alone at 350 killed and 80 wounded. Piotr Stachiewicz suggested that about 400 soldiers from Żoliborz and the Kampinos Forest were killed or wounded in the second attack. Edward Bonarowski estimated the highest number of Polish losses, claiming that the Kampinos and Żoliborz units lost a total of about 600 dead and wounded, the vast majority of whom perished during the second attack. Several company and platoon commanders were killed: Second Lieutenant Karol Hartfil, codenamed War, Lieutenant Wacław Czerski, codenamed Rawicz, Lieutenant Marian Olszewski, codenamed Maryś, Second Lieutenant Witold Kazimierz Drwota, codenamed Murzyn, and Second Lieutenant Kruk.\nCourse of the attack from the Old Town\ncommemorating the Home Army soldiers who died on August 22, 1944]]\nAround 3:10 AM, insurgent sentries on the northern defense sector of the Old Town reported sounds of battle coming from the Warszawa Gdańska railway station area, while the enemy illuminated the forward positions and the vicinity of the station with flares and searchlights. Ten minutes later, Major Bolek's units were ready for combat. The signal to start the attack was to be three red flares fired from Żoliborz. However, Lieutenant Colonel Żywiciel decided against using them, a decision that was not communicated to the Old Town units. As a result, while the forest companies were bleeding out in front of the railway bypass tracks, Bolek's soldiers were waiting in vain for the agreed signal. Eventually, the attack from the Old Town only began around 4:45 AM – just before dawn, when the Kampinos-Żoliborz units' attack had already been repelled (some publications state that the attack began slightly earlier, between 3:00 and 4:00 AM).\nOn the right wing, soldiers of the Czata 49 Battalion attacking through Traugutt Park managed to reach the barbed wire defenses of Traugutt Fort, but under lateral fire from Legion Fort, they soon had to retreat. Two platoons from the 3 company of the Zośka Battalion, along with two platoons from the Pięść Battalion, penetrated the turf and stands of the Kazimierz Sosnkowski Stadium, where they were pinned down by heavy machine gun fire from Traugutt Fort and positions along the railway bypass line, as well as artillery from the Citadel. The commander of one of the Zośka platoons, Stanisław Kozicki, codenamed Howerla, was killed, and the commander of the second platoon, Officer Cadet Stanisław Kujawski, codenamed Brzoza, was severely wounded. Four other Zośka soldiers also fell at the stadium. The company from the Pięść Battalion suffered such heavy losses that the most depleted second platoon had to be disbanded later. Continuing the attack was impossible, so after some time, the Polish soldiers withdrew to their starting positions. The severely wounded insurgents left at the stadium were finished off by the Germans. Some were crushed under the tracks of tanks that drove onto the field. Rifleman Eugeniusz Boguszewski, codenamed Malarz, from the Zośka Battalion survived the massacre, managing to crawl back to insurgent lines after dark despite his severe injuries. In an old, partially collapsed well, Hieronim Szpalerski, codenamed Karaś, and Zbigniew Siarkiewicz, codenamed Grzmot, from the Pięść Battalion spent the entire day, unable to retreat from the stadium due to German fire.\nThe left-wing units did not set out simultaneously with Major Bolek's other units. Initially, Officer Cadet Kmita was ordered only to send a reconnaissance patrol into the ruins of the ghetto. Near the barricade at the intersection of Bonifraterska, Konwiktorska, and Muranowska streets, the three-man patrol was fired upon and grenaded. The patrol leader, Officer Cadet Stanisław Sadkowski, codenamed Czarny, was killed. Shortly after the patrol's return, the order to attack arrived. Through openings made in the walls of the Jana Bożego hospital, Home Army and People's Army soldiers rushed into the ghetto ruins and, with a swift strike, captured two buildings housing advanced enemy positions. However, the Polish attack soon stalled under heavy mortar and machine gun fire. Facing mounting losses, Major Bolek ordered a retreat. The 1st company of the Zośka Battalion lost 16 killed and many wounded in this battle. A group of several insurgents was cut off in the ghetto ruins and managed to return to their starting positions only in the evening.\nThe attack ended around 7:00 AM. The Old Town units lost about 70 killed and wounded.\nAftermath\nOn August 22 at 5:45 AM, less than an hour and a half after the collapse of the attack, General Grzegorz sent a radio message to the Home Army Headquarters and Colonel Wachnowski, announcing his readiness to renew the attack with a changed composition of the assault units. In the same message, he suggested, however, that a more effective form of assistance to the Old Town would be to send armed soldiers and supplies of weapons and ammunition through the sewers. After consulting with Colonel Wachnowski, the Home Army commander decided to abandon further attempts to establish a ground corridor between the insurgent Żoliborz and the Old Town. Grzegorz returned to the Old Town on the evening of August 22.\nA few hours earlier, an officers' meeting took place in Żoliborz, during which General Grzegorz sharply reprimanded Major Okoń, accusing him of poor organization of the attack and accusing his subordinates of lacking fighting spirit. Grzegorz ordered the major to return to the Kampinos Forest and organize a supply base for Żoliborz and the Old Town. Before returning to the forest, the forest units were to hand over all their weapons and ammunition. The soldiers of the forest units, tired from the two-day battle, disheartened by the defeat and the loss of many comrades, received this order with great bitterness. The harsh enforcement of the order by Okoń caused outrage in the ranks. Witnesses claimed that the major, known for his hot temper and vulgarity, snatched weapons from some soldiers' hands, not sparing curses and insults. From the very beginning, the forest soldiers treated Okoń with distrust and, not entirely fairly, blamed him for the defeat at the Warszawa Gdańska railway station. After disarming the remnants, the major evoked outright hatred among many subordinates.\nOn the night of August 23/24, a nearly 300-man unit marched from Żoliborz under Okoń's command. It included 120 to 150 disarmed forest soldiers, mostly former soldiers of Grot's and War's companies. The other half of the unit consisted of insurgents from various Warsaw units, including about 120 soldiers from the Jerzyki Special Insurgent Units company commanded by Lieutenant Jerzy Strzałkowski, codenamed Jerzy. Along with the soldiers, a certain number of representatives of the civilian insurgent authorities and two members of the Headquarters of the Peasant Battalions, along with a group of printers and messengers, also left for the forest. Okoń's unit, not encountering any enemy along the way, reached Wiersze in the morning of August 24.\nLieutenant Witold decided to stay in Żoliborz, along with over 150 forest soldiers, mostly former soldiers of the Stowbtsy-Naliboki Group. The approximately 40-man 225 Marymont platoon from Lieutenant Dan's company also did not return to the forest. The forest soldiers were organized into three platoons: Platoon 207 under the command of Lieutenant Henryk Czerwiec, codenamed Jaskólski, Platoon 208 under the command of Second Lieutenant Edward Bonarowski, codenamed Ostromir, and Platoon 209 under the command of Second Lieutenant Józef Krzywicki, codenamed Prawdzic. mentioned that the fourth platoon was commanded by Lieutenant Marian Sitek, codenamed Janusz. On the other hand,  claimed that the fourth platoon, also included in the Żaba Group, was commanded by Second Lieutenant Tadeusz Dudziński, codenamed Zawieja.}} These three platoons formed the Żaba Group under Witold's command. The remnants of Platoon 225 were re-integrated into the Żmija Group. On August 26, the command of insurgent Żoliborz decided to dissolve the Żaba Group and incorporate its three platoons into the Żaglowiec and Żyrafa II groups. Lieutenant Witold was assigned to the staff of Lieutenant Colonel Żywiciel.\nOn the afternoon of August 22, Lieutenant Trzaska's unit attempted to return to the Old Town via the sewers. Near the Warszawa Gdańska railway station, the head of the column was fired upon and bombarded with grenades, forcing the unit to return to Żoliborz. In the following days, Trzaska's soldiers crossed to the Old Town in small groups. About 30 soldiers from the Kampinos Group, led by Second Lieutenant Jerzy Rybka, codenamed Kiejster, also crossed to the Old Town via the sewers. They were incorporated into the 2nd Company of the Parasol Battalion and went through the entire combat trail of the Radosław Group with it.\nSummary\nWładysław Bartoszewski described the assaults on the Warszawa Gdańska railway station as one of the bloodiest combat actions of the Warsaw Uprising. The failure resulted in the insurgent forces losing at least 500 soldiers and a significant amount of weapons and ammunition. Additionally, the chance to establish a corridor between the Old Town and Żoliborz was ultimately lost, weakening the defense of the former district. Consequently, the German Strike Group Schmidt gained maneuvering freedom, as it was no longer threatened by an attack from the north. The only tangible effect of the Polish attacks was a five-hour delay in the German assault on the building of the Polish Security Printing Works on August 22. Józef Krzyczkowski estimated that during the repulsion of the two Polish assaults on the Warszawa Gdańska railway station, the enemy suffered losses totaling 50 dead and 25 wounded. However, Edward Bonarowski questioned these figures, considering them suspiciously rounded and unverifiable.\nThe defeat at the Warszawa Gdańska railway station caused a deterioration in the morale of both soldiers and civilians trapped in the Old Town pocket. Colonel Wachnowski assessed that as a result of the collapse of the action towards Żoliborz, our situation became very serious. Upon hearing that the corridor to Żoliborz had not been secured, the Home Army Headquarters, along with the Government Delegate for Poland and members of the Council of National Unity, decided to leave the Old Town and move through the sewers to the city center, which took place on August 26. In the opinion of Władysław Bartoszewski, Adam Borkiewicz, Jan Gozdawa-Gołębiowski, Stanisław Podlewski, as well as Lesław Bartelski and Felicjan Majorkiewicz, the defeat at the Warszawa Gdańska railway station was a turning point, sealing the fate of the subsequent fall of the Old Town.\nThe causes of the Polish defeat were the enemy's firepower, technical and organizational superiority, and numerous mistakes made by the insurgent command in planning and organizing the assault. Grzegorz Jasiński opined:The officers of the Home Army Headquarters and the Północ Group, who were decisive in how the action was carried out, guided by emotions rather than a solid assessment of the battlefield, sought immediate and not fully thought-out tactical solutions to instantly reverse the worsening operational situation of the units fighting for Warsaw.Stanisław Jankowski, codenamed Agaton, wrote in his memoirs:''The task of the units attacking the Warszawa Gdańska railway station, if not hopeless, was very difficult. It required a thorough reconnaissance of the enemy's positions and firepower, precise cooperation of the units attacking from Żoliborz and the Old Town, surprise for the Germans, and excellent command full of initiative. None of these opportunities were given to us.\nCommemoration\n]]\nThe bodies of the Home Army soldiers who fell in the assaults on the Warszawa Gdańska railway station were buried by the Germans near the ruins of the barrack housing estate for the unemployed, near the Chemical Institute, and on Stawki Street. Numerous bodies, however, lay unburied on the forefield until the spring of 1945. After the war, the remains of the fallen were buried in the Żywiciel quarter at the Powązki Military Cemetery.\nOn September 29, 1957, thanks to the efforts of the Żoliborz District National Council, a modest monument in the form of a boulder placed on a pedestal was unveiled at the intersection of Mickiewicz and General Zajączek streets, commemorating the insurgents who fell in the attacks on the Warszawa Gdańska railway station. In 1974, the monument was supplemented with a sculpture by Irena Nadachowska, depicting a woman with a rose in her hand. Since 1994, the commemorative boulder bears the inscription:In tribute to the heroic soldiers of the Home Army, insurgent units from Żoliborz and the Old Town, and partisans from the Kampinos and Nalibocka Forests who fell in the assault on the Warszawa Gdańska railway station on August 20 and 22, 1944.On the pedestal, additional letters form a quote from a poem by Juliusz Słowacki: And when needed – they go to death one by one, like stones thrown by God on the ramparts''.\nOn the wall of St. Mary Magdalene's Church at 64 Wólczyńska Street in Warsaw's Wawrzyszew district, there is a plaque with the inscription:''In eternal memory of the 900 partisans of the Home Army 'Kampinos' Group who fell in the Warsaw Uprising, including 450 who died aiding the Old Town, who perished in the two assaults on the Warszawa Gdańska railway station on August 21 and 22, 1944. This plaque is dedicated by their comrades in arms.In 2000, a plaque was unveiled on the front wall of the main grandstand of the Kazimierz Sosnkowski Stadium, commemorating the Home Army soldiers who fell on the stadium grounds during the second attack on the Warszawa Gdańska railway station. It bears the inscription:In tribute to the insurgents, soldiers of the Home Army Radosław Group, battalions Zośka and Czata 49 defending the Old Town, who fell on August 22, 1944, at the Kazimierz Sosnkowski Stadium during the attack on the Warszawa Gdańska railway station. Soldiers of the Zośka and Czata 49 battalions and the Polonia Sports Club. April 2000.''Inside the St. Stanislaus Kostka Church in Warsaw's Żoliborz district, there is a plaque commemorating the soldiers of the Stowbtsy-Naliboki Group, including their participation in the attacks on the Warszawa Gdańska railway station.\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* }}"
    }
  ]
}