{
  "content": [
    {
      "type": "text",
      "text": "# International reactions to the Egyptian revolution of 2011__disambig_1\n\nInternational reactions to the Egyptian revolution of 2011 refer to external responses to the events that took place in Egypt between 25 January and 10 February 2011, as well as some of the events after the collapse of the government of Egyptian president Hosni Mubarak, such as Mubarak's trial. The reactions have generally been either measured or supportive of the Egyptian people, with most governments and organizations calling for non-violent responses on both sides and peaceful moves towards reform. Whilst the protesters called for Mubarak to step down immediately, most foreign governments stopped short of this demand, at least during the early phases of the protests, due to realpolitik concerns about the consequences of a power vacuum on Egyptian stability in particular and to the wider Middle East as a whole. Some Middle Eastern leaders expressed support for Mubarak. Many governments issued travel advisories and evacuated foreign citizens from the country.\nThe protests captured worldwide attention in part due to the increasing use of Twitter, Facebook, YouTube, and other social-media platforms, which empowered activists and onlookers to communicate, coordinate, and document the events as they occur. Many countries experienced their own solidarity protests in support of the Egyptians. As the levels of meta-publicity increased, the Egyptian government stepped up efforts to limit Internet access, especially to social media. In response there has been hacktivism, with global groups attempting to provide alternative communication methods for the Egyptians.\nSupranational bodies\n*  (AU)&nbsp;— The African Union urged Mubarak to respond to the mass protests with reforms. AU Peace and Security Commissioner Ramtane Lamamra called on Mubarak to bring in reforms in response to the unrest. \"We believe that there are changes that are necessary in order to respond to the wishes of the people, economic reforms, social measures, and probably also issues related to the government that need to be addressed.\"\n* &nbsp;— Amr Moussa, the head of the Arab League, said he wanted to see a multi-party democracy emerge but did not say how soon. Speaking to the BBC's The World This Weekend, the former Egyptian Foreign Minister said that Mubarak needed to respond to the protests with actual reform, rather than just reshuffling ministers. \"This new government should be just the beginning, just a new prime minister and new ministers does not necessarily mean a change, clear lines of policy will have to be declared.\"\n* &nbsp;— The European Union's foreign policy chief Catherine Ashton said Egyptian authorities should listen to their people, deal with their problems, and respect their right to demonstrate. She urged the \"Egyptian authorities to respect and to protect the right of Egyptian citizens to manifest their political aspirations\".\n* &nbsp;— UN Secretary-General Ban Ki-moon said that world leaders should see the Egyptian protests as a chance to address \"legitimate concerns\" of the Egyptian people. He urged local authorities to refrain from violence. The High Commissioner for Human Rights Navi Pillay said that most of the frustration and angst has been caused by the emergency laws and urged the government to allow access to the Internet and mobile services. She said measures should be taken to guarantee rights of peaceful assembly and expression.\nAmericas\n* &nbsp;— On 31 January President Dilma Rousseff said, \"[Brazil] hopes that Egypt becomes a democracy, leading its people to benefit from [Egyptian] development.\"\n*: The Ministry of External Relations issued a statement on 1 February calling for a \"political evolution that meets the expectations of their people in a peaceful environment, bereft of foreign interference, so as to foster the ongoing economic and social development\" and pointed out that \"Egypt is an important Mercosur partner\". The arrest of two Brazilian journalists in Cairo on 2 February prompted the Ministry of External Relations to raise its tone in remarks about the political crisis in Egypt. it \"deplore[d] the violent clashes [and] denounce[d] the arrests of Brazilian journalists Corban Costa, from Rádio Nacional, and Gilvan Rocha, from TV Brasil, and expects that Egyptian authorities take the appropriate measures to uphold the civil liberties and to protect the population at large and the foreigners on the ground from bodily harm.\"\nspeaks on the phone with Mubarak during the protests]]\n}}\n* &nbsp;— Canadian Foreign Affairs Minister Lawrence Cannon said that Egypt remains an important partner for Canada and urged \"the Egyptian government to ensure full freedom of political expression for its citizens.\" He said the Canadian government \"continues to stand by the people of Egypt as they demand democratic reforms and respect for human rights. We urge the Government of Egypt to begin an immediate transition toward serious democratic reform.\"\n* &nbsp;— A press release from the Chilean Ministry of Foreign Affairs declared that it is \"permanently following the evolution of the events\".\n* &nbsp;— Colombian president Juan Manuel Santos asked Mubarak to ensure the situation returns to normal. He said that \"[the Colombian people] moves along with the Egyptian people in search of their welfare, freedom and plain use of their human rights and trusts that Mubarak and his government would promote in a short term the return to calm and the strengthening of the democratic institutions.\" He told their embassy to be prepared to assist Colombian citizens in Egypt.\n* &nbsp;— Minister of Foreign Affairs Bruno Rodríguez Parrilla hoped for a positive outcome to the protests as one that \"meets the interests of the Egyptian people and nation (sic).\"\n* &nbsp;— President Barack Obama, noting that he had spoken with the Egyptian president, stated that his first concern is preventing injury or loss of life. He remarked, \"What's needed right now are concrete steps that advance the rights of the Egyptian people...Ultimately the future of Egypt will be determined by the Egyptian people. The United States will always be a committed partner to that future, with the Egyptian government, and with the Egyptian people.\" He recalled that in his speech in Cairo in June 2009 he had stated, \"All governments must maintain power through consent, not coercion,\" and called upon the Egyptian government to restore its people's access to the internet. He called on all parties to refrain from violence in their efforts to bring about a solution. He said that the Egyptian protesters have \"universal\" rights, including the right to peaceful assembly and association, free speech, and \"the ability to determine their own destiny. [...] These are human rights and the United States will stand up for them everywhere.\" White House spokesman Robert Gibbs expressed anger at the pace of change in Egypt, saying the transition should happen quickly, which he also said would determine US aid to the country. Gibbs posted a statement on Twitter expressing concern \"about violence in Egypt\", adding the \"government must respect the rights of the Egyptian people & turn on social networking and the internet\".\n: Vice President Joe Biden said Hosni Mubarak \"has been an ally of ours in a number of things. And he's been very responsible on, relative to geopolitical interest in the region, the Middle East peace efforts: the actions Egypt has taken relative to normalizing relationship with Israel.\"\n: Secretary of State Hillary Clinton said, \"The Egyptian government has an important opportunity to be responsive to the aspirations of the Egyptian people, and pursue political, economic and social reforms that can improve their lives and help Egypt prosper.\" She told Al Jazeera that Mubarak has been an ally of the US in the past because he has maintained the peace treaty with Israel in maintaining stability. She said the US supports an \"orderly transition.\" On 8 March Clinton said Egypt's transition to democracy would be incomplete if women were not equal partners with men in creating the new society. She criticized the lack of women involved in efforts to draft a new constitution, saying in part, \"The women in Egypt and Tunisia and other nations have just as much right as the men to remake their governments&nbsp;— to make them responsive, accountable, transparent.\"\n*: On 26 January US Ambassador to Egypt Margaret Scobey commented, \"we call on the Egyptian authorities to allow peaceful public demonstrations\".\n*: Frank G. Wisner, a former United States ambassador to Egypt, was appointed a special envoy to Egypt during the protests. On 5 February, he said that it is important for Mubarak stay in power for now in order to ease a transition to democracy. He said the constitution of Egypt calls for an election to be held within two months of Mubarak's resignation, and implied that this would not be sufficient time for pro-democracy forces to make themselves known to the Egyptian people.\n**NASA gave Essam Mohamed Haji, a research scientist at the Jet Propulsion Laboratory, permission to write the name of Sally Zahran, a young woman who was beaten to death at Tahrir Square, on a spacecraft headed to Mars. Essam Mohamed Haji said of the decision: \"This is the least we could do for Egypt's youth and the revolutionaries. This step represents the transfer of the dreams of Egyptian young people from a small stretch of earth to the enormous expanse of space.\"\n* &nbsp;— President Hugo Chávez spoke with his Syrian and Libyan counterparts, Bashar al-Assad and Muammar Gaddafi, about the political crisis. He told them that Venezuela backs a \"peaceful solution.\" He said he \"trust[s] that the situation will find on its own the road to harmony, justice and well-being.\"\nAfrica\n*  Libya &nbsp;— Colonel Muammar al-Gaddafi, during a telephone conversation with Mubarak, expressed confidence in the stability of Egyptian society and preserving the gains Egypt has achieved. He expressed his wishes for the completion of Egypt's march towards the greater good and progress for its people and to continue its central role in the defense of issues of the nation. On 23 July, months after the revolution and amidst a widespread uprising in his own country, Gaddafi criticized the revolutionaries in an audio address: \"After you looted, destroyed and damaged the country, you want a new president?\" He said Mubarak \"should be honored\" and that he should not have been removed from power and suggested the revolution was meaningless.\n* &nbsp;— The National Conscience Party chairman Femi Falana asked Mubarak to resign. \"We welcome the unfolding revolution and the demonstration of peoples' power against bad governance, corruption, poverty, and oppression...We strongly condemn the violence and repression by the Mubarak-led government...Violence against Egyptians should stop. President Mubarak must resign now, and listen to the voices of millions of Egyptians who are demanding a change for a better future. Using excessive force to crack down on peaceful protests and torturing protesters are grave breaches of international human rights law, and the African Union must publicly condemn the practice. The AU must side with the Egyptian people if it is to show that it is completely different from the defunct Organization of African Unity, whose sole purpose was to defend African dictators and not the African peoples.\"\n* &nbsp;— On 4 February, the Mail & Guardian reported that Ayanda Ntsaluba, the director general of international relations and cooperation, had said that the South African government had called for Mubarak to step down.\nAsia\n* &nbsp;— Foreign Ministry spokesman Hong Lei stated \"Egypt is a friendly country towards China. China follows the situation in Egypt and hopes it will maintain social stability and normal order\" at a 27 January press conference. Al Jazeera reported that the Chinese government blocked searches of \"Egypt\" from its most-popular micro-blogging website, and restricted coverage of the Egyptian protests in the state media. Bloggers in China, however, have disproved this.\n* &nbsp;— Joint secretary and spokesperson of the Ministry of External Affairs Vishnu Prakash said, \"We are closely following with concern the developments in Egypt. India has traditionally enjoyed close and friendly relations with Egypt. We hope for an early and peaceful resolution of the situation without further violence and loss of lives.\" On 1 February the Indian Ministry of External Affairs termed the mass protests in Egypt \"an articulation of the aspirations of the Egyptian people for reform\" and hoped for a peaceful resolution of the situation \"in the best interests of the people of Egypt\".\n* &nbsp;— Japanese prime minister Naoto Kan urged Mubarak to start a dialogue with his people. \"I hope the regime of Egypt will restore security and peace.\" Foreign Minister Seiji Maehara urged the Egyptian government to resolve the ongoing political unrest peacefully.\n* &nbsp;— Pakistan's foreign office spokesman Abdul Basit said that Pakistan is watching events in Egypt closely and is taking steps about the safety of 700 families in Egypt.\n* &nbsp;— Philippine Deputy Presidential spokesperson Abigail Valte called for a peaceful end to the strife in Egypt. Valte said the Philippine government was particularly concerned about the safety of the more than 6,500 Filipinos in Egypt. \"We hope for a peaceful and just resolution to the political unrest currently taking place and the swift return to stability. We are monitoring the situation and our embassy in Cairo has contingencies in place and is prepared to relocate our citizens to safer areas. As always, the safety of our citizens is the paramount concern and we are doing what we can to anticipate and address their needs.\"\n* &nbsp;— On 15 February the Sri Lankan Ministry of Foreign Affairs cautiously welcomed the political changes in a statement: \"Sri Lanka and Egypt enjoy warm and close ties. It is in this context that Sri Lanka wishes for the people of Egypt progress and stability within a democratic framework of governance,\" and \"The government of Sri Lanka welcomes the smooth and peaceful transition of power in Egypt\".\n*&nbsp;— the president of the Republic of China Ma Ying-jeou \"hopes to see the rapid establishment of democracy in Egypt in accordance with the people's will\", according to Presidential Office spokesman Lo Chih-chiang. Also, according to the director of Department of African Affairs of the ROC's Ministry of Foreign Affairs Samuel Chen, the Republic of China welcomes the coming of democracy in Egypt and hopes to \"enhance bilateral exchanges.\"\nWestern Asia (Middle East)\n* &nbsp;— Iranian Supreme Leader Ayatollah Sayyed Ali Khamenei, calling himself \"your brother in religion\" on 4 February, said that the unrest in Egypt was an \"explosion of sacred anger\" and an \"Islamic awakening.\" He called Mubarak a \"traitor dictator\" who committed a \"great betrayal\" of his people by cooperating with Israel and the United States. Khamenei told Egyptians, \"Do not believe in the game which is being played by the West and America; don't believe in their role, don't believe in their political manoeuvres which are taking place in the midst of your awakening. Just a few day ago...the Americans were supporting the corrupt regime, and now after they are sick of preserving him, they are speaking about the rights of the people. They are trying to replace one spy with another...Look with doubt&nbsp;— always be suspicious&nbsp;— regarding the American role and American intervention.\" He added that \"America's control over Egypt's leaders has...turned Egypt into the biggest enemy of Palestine and turned it into the greatest refuge for Zionists. This explosion we see among the people of Egypt is the appropriate response to this great betrayal that the traitor dictator committed against his people.\" On 6 February, protesters in Cairo's Tahrir Square accused Iran of interfering in Egyptian affairs.\n*: Iranian Foreign Minister Ali Akbar Salehi hoped that the Egyptians' \"high aims, national demands and resurrection of their glory could be achieved in the very near future.\" Iranian Ministry of Foreign Affairs spokesman Ramin Mehmanparast called on Egypt to \"abide by the rightful demands of the nation.\" There were \"solidarity\" protests outside the Egyptian interests section.\n*: Iranian parliament speaker Ali Larijani said, \"The voice of the brave people of Egypt is the voice of revolution. The start of this revolution has astonished the despotic regimes of the region. The parliament supports the uprising of the Tunisian and Egyptian people.\" He described the protests as \"the revolution of the noble.\" Iran backed the protests. Parliament speaker Ali Larijani called the uprising the \"revolution of the noble\". He compared Western reaction to the protests with their reaction to the 1979 Islamic Revolution.\n** Mir Hossein Mousavi and Mehdi Karroubi, former presidential candidates and the leaders of the Green Movement, released a statement from their virtual house arrest in Tehran, assuring the Egyptians, \"No power can suppress the people's will and demand. Sooner or later, autocratic and tyrant power[s] are sentenced to vanish.\"\n* &nbsp;— Prime Minister Nouri al-Maliki stated, \"The people have the right to express what they want without being persecuted... One of the characteristics of a lack of democracy is when a leader rules for 30 or 40 years. It is a difficult issue for people, it is intolerable and change is necessary.\"\n*: The Iraqi Foreign Ministry wished Egypt and its citizens \"progress and prosperity.\"\n* &nbsp;— President Shimon Peres said Mubarak's \"contribution to peace will never be forgotten. I thank him for saving many people's lives by preventing war. The biggest problem isn't changing the government but changing the face of a country as poor as Egypt.\" He added concerns about the Muslim Brotherhood: \"Elections in Egypt are dangerous. Should the Muslim Brotherhood be elected they will not bring peace. Democracy without peace is not a democracy. We fear there will be a change in government without a change in the circumstances which led to this state.\"\n*: Israeli Prime Minister Benjamin Netanyahu and the Israeli Foreign Ministry announced on 28 January that they are keeping a close track of the situation in neighbouring Egypt, but are refraining from taking a political stance. Ministers were told to refrain from commenting due to the sensitive nature of relations.\n*: Foreign Minister Avigdor Lieberman told European diplomats at the Knesset that the root cause of the unrest was internal problems. \"Whoever thinks that the Palestinian-Israeli conflict is part of the problems in the Middle East is trying to escape reality. [The] big picture of the Middle East shows that major points of contention stem from challenges and confrontations within Islamic society. The Arab world is becoming increasingly weakened. At the end of the day, it is clear to everyone, even to the Palestinian Authority, that the greatest danger they are facing is not Zionism, but rather Hamas and Jihad.\" During the early days of the protests, the Foreign Ministry was receiving updates every few hours and Lieberman was in close contact with the Israeli ambassador to Egypt, Yitzhak Levanon. The Ministry was concerned over \"substantial\" changes in the regime. The Associated Press reported that security officials anonymously expressed concern that the violence could threaten ties with Egypt, and spread to the Palestinian Authority. The government was said to be pressuring the US to postpone a plan for Mubarak's departure so that it could prepare for any likely outcome.\n** Binyamin Ben-Eliezer, a Labor member of the Knesset (MK), said that \"all we can do is express our\" support for Mubarak and hope the riots pass quietly. He said Mubarak \"had very tough things to say about the United States. [Mubarak] gave me a lesson in democracy and said: 'We see the democracy the United States spearheaded in Iran and with Hamas, in Gaza, and that's the fate of the Middle East. They may be talking about democracy but they don't know what they're talking about and the result will be extremism and radical Islam.'\" According to him Mubarak realised \"it was the end of the Mubarak era.\"\n** MK Ibrahim Sarsur, who leads the United Arab List, expressed \"full support for the protesters in Egypt. The Arab police states have given their peoples no other option but to take to the streets for a people's revolution to topple the suppressing regimes and to free themselves from the control of dictators.\"\n** Former ambassador to Egypt Eli Shaked said that \"there can be no doubt that the new regime will seek to deal the peace with Israel a very public blow. The only people in Egypt who are committed to peace are the people in Mubarak's inner circle.\"\n* &nbsp;— Jordan's King Abdullah II \"wished the brotherly country of Egypt security, stability and progress.\"\n* &nbsp;— Kuwait's Emir Sabah Al-Ahmad Al-Jaber Al-Sabah expressed his support to the Egyptian government. In a phone call to Mubarak, he expressed the State of Kuwait's condemnation of all acts of \"riots, looting and sabotage\" that terrified the citizens and undermined the security and stability of Egypt. Sheikh Sabah said he was confident the \"Egyptian brothers\" would overcome this \"critical\" phase to reach security and stability.\n* &nbsp;— Palestinian National Authority President Mahmoud Abbas telephoned Mubarak to express his support.\n** &nbsp;— Hamas said the border with Egypt was calm. The Gaza-Egypt Rafah border crossing was closed during the protests. On 9 February continuing protests in Egypt threatened the supply of petrol into the Gaza Strip.\n** The Popular Front for the Liberation of Palestine (PFLP) declared its solidarity with the protesters and called for social and political revolution in Egypt.\n* &nbsp;— Saudi King Abdullah bin Abdul-Aziz expressed support for Mubarak. \"No Arab or Muslim can tolerate any meddling in the security and stability of Arab and Muslim Egypt by those who infiltrated the people in the name of freedom of expression, exploiting it to inject their destructive hatred. As they condemn this, the Kingdom of Saudi Arabia and its people and government declares it stands with all its resources with the government of Egypt and its people.\" He condemned the \"people who tried to destabilise the security and stability of Egypt.\"\n* &nbsp;— Turkish prime minister Recep Tayyip Erdoğan was the first leader in Europe and the Middle East to call for Mubarak to heed the people's demands and leave his post to pave the way for a more democratic regime, saying the era of governments surviving through repression was over. \"No government can survive against the will of its people\", Erdoğan said in a televised address to members of the ruling Justice and Development Party, which was broadcast live by some Arabic TV channels, including Al Jazeera. \"Listen to [the] people's outcry and humanistic demands. Meet people's demand for change without any hesitation. I would like to make it clear here. You should take the first step for peace, security and stability of Egypt without giving any chance for exploiters, evil circles and those who have dark scenarios on Egypt. You should take steps that could satisfy the people.\" He called for anti-government protesters to refrain from violence and protect the country's cultural heritage. \"Everyone has the right to fight for freedom, but without violence.\" Following the fall of Mubarak, on 15 February Erdoğan called for an international donor conference to help Egypt overcome its economic woes. Erdoğan, who spoke by phone with US president Barack Obama on 12 February, said Obama had embraced the idea.\n*: Foreign Minister Ahmet Davutoğlu said that \"there can be demands of communities and they can be expressed. These demands are justified. Transparency and accountability are accepted values in the international community. If these demands are brought on the agenda, in this context, they should be understood right by those countries and by governments there.\"\nEurope\n* &nbsp;— On 3 February Austrian Foreign Minister Michael Spindelegger condemned the violence. \"It is more necessary than ever for talks to be started without delay between the opposition and the government in order to prevent the situation from getting further out of control. This also entails calling those responsible for acts of violence to account, and swiftly.\"\n* &nbsp;— Belarusian Foreign Ministry Press Secretary Andrei Savinykh declared: \"We are convinced that street clashes and violence is a bad way to solve pressing social and community issues. We urge the parties to solve existing problems peacefully in line with international legal norms [at] a negotiating table.\"\n* &nbsp;— In a statement released on 27 January, Belgian Deputy Prime Minister, Foreign Minister Steven Vanackere and Minister of Civil Service, Public Enterprises and Institutional Reforms deplored the deaths. He hopes that the protest will strengthen the process of democratisation and socio-economic reform in Egypt. He pointed out the importance of freedom of speech and media.\n* &nbsp;— The Foreign Ministry condemned the violent response to the protests, and expressed condolences for the deaths.\n* &nbsp;— Mario Dragun, spokesman of the Croatian Foreign Ministry, said: \"We hope that the violence will cease and democratic dialogue will ensue so that the crisis could be resolved and the political, economic and social reforms carried out with full respect for the basic human.\"\n}}\n* &nbsp;— Prime Minister Lars Løkke Rasmussen called the protesters brave, and urged Mubarak to leave as quickly as possible. Minister for Foreign Affairs Lene Espersen strongly condemned the alleged Egyptian authorities' actions against the protests.\n** Danish-Palestinian politician Naser Khader urged Mubarak to resign.\n* &nbsp;— Minister for Foreign Affairs Urmas Paet said, \"It is vitally important that the Egyptian authorities and protestors avoid the use of violence.\" Estonia urged their citizens in Egypt to leave the country.\n* &nbsp;— Minister for Foreign Affairs Alexander Stubb called his counterpart Foreign Minister of Egypt Ahmed Aboul Gheit to express Finland's strong hopes that the conflict would be resolved peacefully. In a statement on the Finnish foreign ministry's website Stubb said, \"Everyone should now strive to steady the situation quickly so that there would be no further fatalities or injuries. Finland condemns the use of force.\" He expressed concern over the blocking of communications.\n* &nbsp;— Prime Minister Francois Fillon's office said that France would be ceasing arms and tear gas sales to Egypt. Controversy arose over Fillon's links to the Mubarak regime, as he admitted having been a guest of Mubarak over the Christmas holiday at Egypt's expense. President Nicolas Sarkozy responded to the allegations by telling his ministers to take their holidays in France more often, saying \"What was commonplace a few years back can prove shocking nowadays.\"\n* &nbsp;— Foreign Minister Guido Westerwelle said he was \"very concerned\" and called on all involved to show restraint. Later Angela Merkel called upon all involved, and especially the Egyptian government and the president, to allow peaceful demonstrations, to give freedom of opinion a chance. \"We have to come to a peaceful dialogue in Egypt because the stability of the country is of extraordinary importance.\"\n* &nbsp;— The Foreign Ministry said in a statement on 30 January that it plans to evacuate its citizens from Egypt.\n* &nbsp;— Prime Minister Silvio Berlusconi said that he hoped for \"continuity in the government\" as Western leaders wanted a \"more democratic system without ruptures with a president like Mubarak that all the Western hemisphere, including the U.S., had considered the wisest man and a reference point in all of the Middle East.\" He played down the scale of the protests by saying that there were \"really few\" demonstrators out of a population of 80&nbsp;million.\n*: The Foreign Ministry gave a statement where they expressed deep regret over the civilian casualties. They urged the immediate cessation of every kind of violence, and called for respect for civil rights and for freedom of speech and communication, including the right to hold peaceful rallies. They pointed out that Egypt's stability is a priority for their country.\n* &nbsp;— The Foreign Ministry of Affairs was concerned about the situation in Egypt, and advised their citizens not to travel to Egypt.\n* &nbsp;— The Ministry of Foreign Affairs warned their citizens not to travel to Egypt.\n* &nbsp;— The Minister of Foreign Affairs Uri Rosenthal called on \"the Egyptian authorities to stop violence, allow the media for all the people and asks the international community to stay on one line to Egypt.\"\n* &nbsp;— Minister of Foreign Affairs Jonas Gahr Støre called on the Egyptian authorities to refrain from violence, allow peaceful protests, and respect basic political and economical rights. \"I deeply regret that lives have been lost during these demonstrations. The right to free speech and to demonstrate are basic human rights and prerequisites for democratic development. The extensive demonstrations can be viewed as a sign that there are limits to political free speech in Egypt.\"\n* &nbsp;— The Foreign Ministry expressed concern over the many civilian casualties, and called for respect for human rights.\n* &nbsp;— The Foreign Ministry condemned the violence and urged its citizens in Egypt to leave the country.\n* &nbsp;— In a telephone conversation with Mubarak, President Dmitry Medvedev expressed his hope that the situation would be resolved by peaceful and legal means. He expressed the importance of guaranteeing the security of the Embassy of Russia in Cairo and Russian citizens who are still located in the country.\n*: Foreign Minister Sergey Lavrov sent a message to his Egyptian counterpart expressing concerns over the current situation and compassion with the people of Egypt. He expressed hope that the Egyptian government would stabilise the situation, stating that \"the stability of Egypt meets the genuine interests of both the Egyptians and the entire Middle East region.\" He hoped that \"the Egyptian side will take comprehensive measures to ensure the safety of Russian citizens located in Egypt.\"\n, 30 January]]\n* &nbsp;— The Foreign Ministry condemned the violence and use of force against the protests. Slovak Minister of Foreign Affairs said that Egypt has to respect human rights and civic liberties.\n* &nbsp;— Foreign Minister Trinidad Jimenez said that the EU supports the \"people who are in the street\". \"We support the claiming in the street for more reforms and more rights\".\n* &nbsp;— Swedish Prime Minister Fredrik Reinfeldt stated in an interview that he hopes for an eventual democratic Egypt but fears what might happen instead, saying that a reformed Egypt with a harsher attitude towards Israel would be very destabilising for the region.\n*: Foreign Minister Carl Bildt criticised Egypt for blocking the internet, comparing it to Myanmar in 2007. \"In the long run, free access to information is better for confidence and stability than restrictions and prohibitions. Measures such as this that aim at short-term stability may very well lead to more long-term suppression.\"\n* &nbsp;— Swiss Conferation President and Foreign Affairs Minister Micheline Calmy-Rey said she was \"worried about the increasing violence in Egypt\". She called on the Egyptian government to \"respect freedom of speech and of assembly\".\n*: Finance Minister Eveline Widmer-Schlumpf said that the government of Switzerland was examining whether Mubarak had any assets in the country.\n* &nbsp;— On 2 February Prime Minister David Cameron called for an end to the violence, describing the scenes in Cairo as \"despicable\" and said they should not be repeated. He said, \"We have been watching the events in Cairo with grave concern, and completely condemn the violence that is taking place. And if it turns out that the regime, in any way, has been sponsoring or tolerating this violence, that would be completely and utterly unacceptable. These are despicable scenes that we are seeing and they should not be repeated. They underline the need for political reform and, frankly, for that political reform to be accelerated and to happen quickly. We need to see a clear roadmap for that political reform, so that people in Egypt can have confidence that their aspirations for a more democratic, a future with greater rights, is met. And that change needs to start happening now, and the violence needs to stop.\"\n*: Foreign Secretary William Hague called on the authorities and protesters in Egypt to show restraint and avoid violence. He urged the Egyptian authorities to \"listen to the concerns\" of demonstrators.\n**Former prime minister Tony Blair called Mubarak a \"force for good.\"\n* &nbsp;— On 10 February former Prime Minister of Ukraine Yulia Tymoshenko said that Egypt can learn from the Orange Revolution about how to amend the constitution to establish a civil society after a peaceful revolution, and not repeat the mistakes of Ukraine.\n; Joint statements\nA joint statement by British prime minister David Cameron, French president Nicolas Sarkozy and German chancellor Angela Merkel read:\n}}\nOn 3 February the three were joined by Italian prime minister Silvio Berlusconi and Spanish prime minister Jose Luis Zapatero in issuing another statement: \"Only a quick and orderly transition to a broad-based government will make it possible to overcome the challenges Egypt is now facing. That transition process must start now.\"\nOceania\n, Australia]]\n* &nbsp;— On 3 February, Prime Minister Julia Gillard announced \"the time for change has come\" and that \"I absolutely condemn this violence.\"\n* &nbsp;— On 5 February Minister of Foreign Affairs Murray McCully condemned the violence against the protesters and expressed concern over the targeting of foreign journalists. \"Reports that foreign journalists, including New Zealanders, have been targeted is extremely concerning and directly violates fundamental freedoms.\"\nSolidarity protests\n, Australia, 30 January]]\nProtests were held at the Egyptian embassy in Tunis in solidarity and in hope that the two countries' \"revolutions\" would spark a chain of events around the Arab world. Tunisia's Progressive Democratic Party said that Egypt had \"called in the hour of change for an end to injustice and dictatorship. The Egyptian people supported the Tunisian people's revolution. Our heart is with you and our voices never cease to pray for victory.\" There was a demonstration outside the Egyptian embassy in Doha, Qatar. There were protests in Lebanon warning of the spread of the protests. On 25 January a march held in Gaza in solidarity with the protests was suppressed by Hamas. Police officers dressed in civilian clothing arrested six women and detained some 20 others, according to Human Rights Watch.\nIn Syria a peaceful demonstration was held on 29 January in front of the Egyptian embassy in Damascus to protest against the killing of protesters by Egyptian police. Syrian security forces were deployed around the embassy and blocked demonstrators from reaching it. Arab Israelis held rallies in solidarity with the Egyptian protesters.\nOn 28 January between 200 and 400 protesters held demonstrations outside the Fatih Mosque (where political activism has become more common since the 2010 Gaza flotilla raid) after the Friday prayer in Istanbul. A small leftist group gathered outside the Egyptian embassy in Ankara, Turkey. Iranian students gathered in front of the Egypt's Interest Section in Tehran on 30 January to support the uprisings in Egypt. According to IRNA, the students, shouting slogans such as \"Down with US, Down with Israel, Down with UK and down with Hosni Mubarak,\" condemned the Egyptian government's measures to confront protesters. The students demanded that the Iranian government shut down Egypt's Interest Section in Iran.\nOn 28 January Egyptians living in Canada and others gathered at the embassy in Ottawa as well as the consulate in Montreal. The next day, Canadians in Toronto, Montreal, Vancouver, and other cities peacefully demonstrated in support of the uprising, criticising the Canadian government's cautious and generic response. On 29 January in Dearborn, Michigan, 300 people expressed their solidarity for the Egyptian people. Around 150 protesters demonstrated in solidarity with the Egyptian people in Nashville, Tennessee.\n, 29 January]]\nThe Egyptian embassy in Venezuela was temporarily taken over by Venezuelans of Egyptian descent, an action which was condemned by President Hugo Chavez.\nEgyptians in Ireland and members of the Irish Anti-War Movement held a protest outside the embassy in Dublin on 28 January to \"show solidarity for the people in Egypt to say to them that we are behind you and we support you.\"\nIn London, fifty protesters outside the Egyptian embassy called for Mubarak's regime to resign. In Frankfurt, Germany, a small group protested on 29 January in the main pedestrian zone, the Zeil, to show their support for the Egyptian people. In Munich, Germans joined the Egyptians in a demonstration in Odeonsplatz asking Mubarak to leave. In The Hague, Netherlands, 200 people protested in front of the Peace Palace against the regime of Mubarak.\nOn 31 January, students at India's Jawaharlal Nehru University's Egypt Solidarity Forum organised a solidarity march in which about 500 students and faculty members participated. The convener of the forum, Omair Anas, said: \"We believe that Egyptian people are victims of their own rulers as well as their Western masters. Hosni Mubarak has protected interests of capitalists, multinationals and his Western masters, mainly the United States.\" The following day, the forum called for a mass demonstration at the Egyptian embassy where some protesters, including Anas, were detained by the Delhi Police.\nIn South Africa, on 4 February, approximately 300 demonstrators blocked Bourke Street, the location of the Egyptian embassy in Pretoria, in peaceful protests organised by South African trade unions, human rights groups, and Egyptians in South Africa. The demonstrators shouted slogans such as \"out with Mubarak\" in English, Afrikaans, Zulu, and Arabic.\nOn 9 February in Ukraine, FEMEN activists organised a topless protest in front of the Egyptian embassy in Kyiv.\nNon-governmental organizations\n* The AFL-CIO supported the protests, saying that US President Barack Obama was not \"on their side.\"\n* Salil Shetty, head of Amnesty International, believed Hosni Mubarak's decision to fire his cabinet would not stop the anti-government protests.\n* Hacktivist group Anonymous attacked multiple government websites and issued press releases calling for support of the Egyptian people.\n* Mohamed Abdel Dayem of the Committee to Protect Journalists condemned police violence against journalists.\n* Human Rights Watch said Egyptian police had escalated the use of force against largely peaceful demonstrations and called it \"wholly unacceptable and disproportionate\".\n* Hezbollah Secretary-General Hassan Nasrallah expressed support for the protests, saying victory would \"entirely change the face of our region for the interest of its own people, especially in Palestine. The US came to bring down this regime, which was a faithful friend in ensuring US interests. If we listen to the Americans from both parties&nbsp;— Democrats and Republicans&nbsp;— does it make sense that the US would try to bring down [Mubarak] as we saw in the 1979 revolution in Iran? The Americans are riding the wave, trying to contain the uprising while attempting to improve their loathsome image in our world and present themselves as protectors of nations and their freedoms after decades where they got into bed with the worst dictators in the region.\" He stated that the \"overwhelming majority\" rejected US policy towards Israel and that the \"protests will push out [the] regime that has maintained peace with Israel.\" His comments were rebuked by the Egyptian Foreign Ministry, which said that he is \"walking in the footsteps of his mentor\", a reference to Iranian Supreme Leader Ali Khamenei. It accused both leaders of wanting \"to ignite the region.\"\n* al-Qaeda's Egyptian-born deputy head Ayman al-Zawahiri said: \"The constitution of the regime in Egypt claims that it is democratic. But it's truth that it's a suppressive regime that rules the people with suppressive forces and fake elections and corrupt media and unjust law.\"\nEvacuations and travel advisories\n* &nbsp;— From 1 February until 4 February, the Argentine Ministry of Foreign Affairs issued a series of press releases urging Argentine citizens not to visit Egypt \"unless it is absolutely necessary, until the situation returns to normal\".\n*  sent two charter planes and one military plane to evacuate its nationals from Egypt, but many Austrians on holiday in seaside resorts want to stay.\n*  sent a special commercial Azerbaijan Airlines flight on 30 January to bring back its citizens, most of them students and embassy staff. An employee of the Azerbaijani embassy in Egypt was killed in Cairo on the same day as a result of mass public disorder.\n*  — The Prime Minister announced that a chartered jet would be available to evacuate Australian nationals, and that extra consular staff will be provided. Two Qantas 747 flights from Cairo International Airport removed Australian citizens to Frankfurt on 2 and 4 February at government expense. Since many people were unable to reach Cairo quickly, another flight from Luxor was considered.\n*  — The Brazilian embassy discouraged any trips to Egypt until the situation returns to normal and started evacuating Brazilians in the country.\n*  — The government evacuated all of their 97 citizens out of Egypt via Dubai on a specially chartered flight.\n*  launched an evacuation plan to evacuate citizens from Egypt using Air Canada charter flights contracted by the Government of Canada to Frankfurt, London, and Paris. Approximately 6,500 Canadian citizens in Egypt are expected to reimburse the cost of the plane tickets to Europe and self-arrange for an ongoing flight back to Canada. Conflicting reports suggested that the government was willing to subsidise C$400 off ticket prices and organise flights out of the country. However, the government was unsure of how many citizens would take advantage of the offer. \"The government is recommending that Canadians leave Egypt,\" Foreign Affairs Minister Lawrence Cannon announced. \"... The situation is deteriorating, the situation is not under control.\"\n*  was prepared to receive foreign citizens evacuated from Cairo. Cyprus It advised its citizens currently in Egypt to avoid areas where demonstrations were being staged.\n* 's Foreign Ministry warned against all travel to Egypt.\n*  organised a 200-seater Finnair Airbus to evacuate the approximately 150 Finnish citizens living in Egypt. According to Foreign Minister Alexander Stubb, the greatest challenge was to gather all Finns into one place to be evacuated. Finland allowed nationals of other countries to take vacant seats on the evacuation flights.\n* &nbsp;— The Ministry of Foreign Affairs urged its citizens to leave Egypt.\n*  sent a special commercial Air India flight on 30 January to bring back its citizens who wanted to return home. Approximately 3,600 Indians who live in Egypt had expressed an interest in returning.\n*  called for the quick evacuation of all Indonesian citizens in Egypt, most of whom were studying at Al-Azhar University, by charter flights from Garuda Indonesia.\n* &nbsp;— The Department of Foreign Affairs said that as of 3 February it had \"given assistance to approximately 400 Irish citizens [in Egypt].\"\n*  evacuated tourists and people who worked in Egypt with two flights.\n*  offered to transport its citizens in Egypt, many of whom fled as a result of the war, back to Baghdad for free. The Foreign Ministry advised their citizens to stay away from places of tension and offered to evacuate their citizens with three military aircraft.\n*  — As of 3 February, the Irish Department of Foreign Affairs advised Irish citizens to immediately leave Egypt and advised against travel to Egypt.\n*  advised its citizens to refrain from non-essential travel to Egypt. It later called on all its citizens holidaying in the Sinai to return home.\n*  called for its citizens to be evacuated.\n*  — The Emir of Kuwait ordered the embassy to make sure all Kuwaiti citizens were brought back home free of cost and to make sure the embassy provides a hotel if needed. Kuwait Airways received orders from the Emir to send special flights to bring all Kuwaitis in Egypt back home. The Kuwaiti Ambassador to Egypt said that all Kuwaiti citizens are \"safe, and enjoy good health.\"\n*  — On 2 February the Malaysian government announced plan to evacuate its citizens. The plan, code-named \"Operation Pyramid\" (Malay: Operasi Piramid) was supported by three Royal Malaysian Air Force C-130 Hercules planes, a Royal Malaysian Navy auxiliary ship, which was stationed at Gulf of Aden. Malaysian flag carrier Malaysia Airlines and low-cost carrier AirAsia later announced their support of the evacuation mission and sent aircraft to Egypt. The first evacuees were expected to arrive on 4 February.\n*  — On 31 January the New Zealand government warned its citizens to avoid all areas with protests.\n*  — President Goodluck Jonathan recommended that all Nigerians evacuate from Egypt. Nigeria then dispatched a team to assist its citizens in leaving the country.\n* 's government created an emergency team within the Foreign Ministry to form a plan for evacuating 25,000 Russian nationals. It had earlier recommended that tourists stay in their hotels and not leave the guarded resort areas.\n*  — Kosovars were urged to leave Egypt by its Foreign Ministry. In the absence of diplomatic relations between the two states, citizens in distress were instructed to seek help from the Turkish embassy. The chairman of the New Kosovo Alliance Behgjet Pacolli organised flights back to Kosovo for some 160-odd Kosovars at his own expense.\n* &nbsp;— Saudi and Egyptian passengers were stranded at the Cairo, Jeddah and Riyadh airports.\n* &nbsp;— On 3 February a Slovak government aircraft brought 34 Slovaks, eight Czechs, one Hungarian, and two Portuguese citizens, who were living and working in Cairo and Hurghada, to Slovakia.\n* 's flag carrier, Korean Air, suspended flights to Egypt on 30 January. The Foreign Ministry suspended classes at the Korean School, which had an attendance of some forty elementary school students. The South Korean embassy put together an emergency plan to evacuate Korean nationals in the event of a serious crisis.\n*  sent two aircraft to pick up its stranded citizens.\n* &nbsp;— Until 30 January, the British government had advised its citizens to stay put (although advising against non-essential travel). However, the advice was then revised to say \"We recommend that British nationals without a pressing need to be in Cairo, Alexandria or Suez leave by commercial means, where it is safe to do so.\" The Foreign Ministry recommendation that citizens in other parts of the country not affected by widespread protests and violence stay where they are and stay indoors.\n* &nbsp;— The US advised its citizens to take evacuation flights to safe havens in Europe. It later warned its citizens to leave \"as soon as possible\". It offered to send a plane to evacuate embassy personnel to reduce its \"diplomatic footprint\" in the country.\n; Others\nMultinational corporations said they would evacuate their employees. Two Russian oil and gas companies, Lukoil and Novatek, evacuated their staff from Egypt on 30 January.\nMedia and individuals\nMedia\nAustria's Der Standard said that \"the EU has failed to manage its response to the events in Egypt.\"\nNew York Times columnist Nicholas Kristof said that \"it should be increasingly evident that Mr. Mubarak is not the remedy for instability in Egypt; he is its cause. The road to stability in Egypt requires Mr. Mubarak's departure, immediately.\" On 7 February, during the first show after a return from Egypt, CNN reporter Anderson Cooper, who had twice been beaten by pro-Mubarak protesters, criticised the government on his nightly show. He said that Mubarak's regime has \"blood on its hands\" and is lying to the world about its actions. He called Egypt a police state and accused the government of saying \"the direct opposite of what they have been doing.\" He cited the government's claim of reaching out to the opposition even though \"his secret police were still arresting opposition figures.\" He further said that while the government has denied being involved in the violence directed at protesters, the military had been conspicuously slow to react to the targeting of demonstrators by pro-Mubarak forces.\nWriting for the Saturday Mirror on 6 August, former Nigerian head of state Olusegun Obasanjo criticised the handling of the Mubaraks' trial and defended the deposed president. \"I am not saying that Mubarak has not made a mistake in his almost thirty years in running the affairs of Egypt or that he has not committed any misdemeanour or offence, but decency demands that in bringing him to judgment, the good he has done should be brought side by side with the mistakes he has made and if this is done objectively, I am of the mind that the good will outweigh the mistakes,\" Obasanjo wrote.\nIndividuals\nMIT linguistics professor Noam Chomsky said that \"[w]hat's happening is absolutely spectacular. The courage and determination and commitment of the demonstrators is remarkable, and whatever happens these are moments that won't be forgotten and are sure to have long-term consequences.\" He later added in an article in The Guardian that:\nObservers compared it to the toppling of Russian domains in 1989, but there are important differences. Crucially, no Mikhail Gorbachev exists among the great powers that support the Arab dictators. Rather, Washington and its allies keep to the well-established principle that democracy is acceptable only insofar as it conforms to strategic and economic objectives: fine in enemy territory (up to a point), but not in our backyard, please, unless properly tamed. One 1989 comparison has some validity: Romania, where Washington maintained its support for Nicolae Ceaușescu, the most vicious of the east European dictators, until the allegiance became untenable. Then Washington hailed his overthrow while the past was erased. That is a standard pattern: Ferdinand Marcos, Jean-Claude Duvalier, Chun Doo-hwan, Suharto and many other useful gangsters. It may be under way in the case of Hosni Mubarak, along with routine efforts to try to ensure a successor regime will not veer far from the approved path.\nTariq Ali said the protests would be a \"rude awakening for all those who imagined that the despots of the Arab world could be kept in place provided they continued to serve the needs of the West.\" He said that \"while Western establishments lull themselves to sleep with fairy tales, ordinary citizens, who are defeated and demoralised, mull their revenge.\" He added that \"If Tunisia was a tremor, the Egyptian uprising has become an earthquake that is spreading throughout the region. The generals in Cairo are still refusing to disperse the crowds with tanks and bullets. A full-scale Tiananmen Square option, which Mubarak and his friends would have appreciated, becomes difficult in these conditions.\"\nRalph Nader said that Vice-President Omar Suleiman appeared to be making the decisions, if only to give the impression that Mubarak was relenting and would be willing to remain as a figurehead president until his term ends later in the year. He believes that Mubarak was very alert to what would be needed to maintain the loyalties of the police, the intelligence agencies, the security forces and the army and that when is forced out tens of thousands of those on his payroll would lose their patronage. Nader stated that \"the government is striving to wait out the protesters, whose daily supplies and energies are being sapped by the overwhelming force arrayed against them to intimidate, weaken and keep their numbers down not just in [Tahrir] Square but also in other cities like Alexandria and Suez.\"\nReferences\nExternal links\n*[http://www.huffingtonpost.com/2011/01/29/americans-protest-egypt-photos_n_815894.html#s232544&title=Washington_DC Americans Protest in Support of Egypt]&nbsp;— slideshow by The Huffington Post"
    }
  ]
}