{
  "content": [
    {
      "type": "text",
      "text": "# International Day for Mine Awareness and Assistance in Mine Action\n\nThe International Day for Mine Awareness and Assistance in Mine Action is a date designated in 8 December 2005 by the United Nations General Assembly to raise awareness and seek assistance for mine action is observed every year on 4 April. This day was designated to advocate for efforts against the dangers of land mines and explosive remnants of war, as well as to promote efforts to clear contaminated areas and assist victims.\nHistory\nThe United Nations General Assembly proclaimed the day on 8 December 2005. The decision was made to raise public attention towards mine action activities, the threats posed by land mines, and how to work towards their elimination. The day was first observed on 4 April 2006.\nThe day is significant as it marks the establishment of the UN's accountability framework and the introduction to the UN's Theory of Change in mine action program. The day also aids peacekeepers to carry out patrols, help humanitarians, raise awareness against mines among people living in dangerous atmospheres and educate them how to survive fearlessly and not worry about compromising their lives.\nThe International Day for Mine Awareness and Assistance in Mine Action seeks to achieve a world free of land mines and explosive remnants of war. This is to help individuals and communities to survive in a safe environment where the victim's needs are taken care of.\nThe threat of mines\nMines, explosive remnants of war, and improvised explosive devices (IED) continue to cause death and injury, especially in situations of armed conflict. On average, one person is killed or injured every hour. Many children are among the victims. The use of improvised explosive devices has expanded, terrorizing civilians and threatening humanitarian and peacekeeping missions and personnel.\nEvents and activities\nVarious events and activities are organized to mark this day. In 2024, the United Nations Mine Action Service (UNMAS) opened a multi-media exhibition themed “Witnessing a Way Forward: Protecting Lives. Building Peace. The exhibition highlighted the need for the full implementation of Security Council resolution 2475 (2019), which calls on all Member States and Council members to take into account the needs of persons with disabilities in conflict situations.\nThe 2024 commemoration of the International Day for Mine Awareness and Assistance in Mine Action focuses on disabled survivors of explosive hazards, and all people with disabilities living through conflicts. The United Nations has called for a greater responsiveness to the needs and rights of all people with disabilities in conflict and peacebuilding settings.\nThe 2024 campaign will bring attention to the five-year anniversary of Security Council resolution 2475, which calls upon Member States, and specifically Security Council members, to consider and protect persons with disabilities; to ensure they have access to assistance, and to include them in conflict prevention and peacebuilding.\nReferences"
    }
  ]
}