{
  "content": [
    {
      "type": "text",
      "text": "# International Center for Biosaline Agriculture\n\nInternational Center for Biosaline Agriculture (ICBA) is an international, not-for-profit applied agricultural research center with a unique focus on marginal environments. It identifies, tests and introduces resource-efficient, climate-smart crops and technologies that are best suited to different regions affected by salinity, water scarcity and drought. Through its work, ICBA aims to improve food security, nutrition and livelihoods of resource-poor farming communities around the world.\nHeadquartered in Dubai, the United Arab Emirates, ICBA implements research-for-development programs in over 30 countries.\nThe center is a founding member of the Association of International Research and Development Centers for Agriculture (AIRCA). It is also a member of the Middle East and North Africa Network of Water Centers of Excellence and the Asia-Pacific Association of Agricultural Research Institutions (APAARI).\nMission and vision\nICBA’s vision: \"Sustainable livelihoods and food security in marginal environments\".\nThe center’s mission: “To work in partnership to deliver agricultural and water scarcity solutions in marginal environments\".\nThe strategic objectives of ICBA are:\n* Promote sustainable management of natural resources;\n* Provide climate change solutions;\n* Enhance agricultural value chains;\n* Advance sustainable food, feed and biofuel agri-technologies.\nHistory\nIn 1992, the Islamic Development Bank (IsDB) initiated a series of expert consultations which outlined the objectives and activities of a new institution. In November 1992, the IsDB Board of Executive Directors approved financing for the establishment and initial operation of what would become ICBA. Subsequent consultations between the IsDB and the General Secretariat of the Gulf Cooperation Council led to the selection of the United Arab Emirates as the host country for the center.\nIn 1996, the IsDB and the Government of the United Arab Emirates signed an agreement to formally establish ICBA. In 1997, the Municipality of Dubai allocated 100 hectares of land in Academic City, where ICBA's head office is now located. The center became operational in 1999.\nFunding\nICBA’s founding donors include the IsDB, the OPEC Fund for International Development, the Arab Fund for Economic and Social Development, and the Government of the United Arab Emirates (UAE).\nThe IsDB and the Government of the UAE, represented by the Food Security Office and the Environment Agency - Abu Dhabi, remain the core donors of the center.\nICBA also attracts bilateral and multilateral financial support for its programs from development organizations and government agencies such as&nbsp;the Food and Agriculture Organization of the United Nations (FAO), International Fund for Agricultural Development (IFAD), the Arab Bank for Economic Development in Africa (BADEA), International Atomic Energy Agency (IAEA), the United States Agency for International Development (USAID), the World Bank, the International Development Research Centre (IDRC), the OPEC Fund for International Development (OFID), the Swedish International Development Agency (Sida), the Bill & Melinda Gates Foundation, and many others.\nResearch innovation themes\nWhen the center was set up in 1999, its focus was on biosaline agriculture and salinization. As it evolved, ICBA expanded its mandate first to water scarcity and later to a broader set of challenges in marginal environments.\n'''The center's research innovation themes include:'\n* management of natural resources in marginal environments;\n* climate change modeling and adaption;\n* crop improvement and sustainable production;\n* and integrated agri-aquaculture systems.\nICBA conducts applied research on use of fresh and non-fresh water in agriculture (such as saline, treated wastewater, industrial water, agricultural drainage, and seawater), water and land management technologies, crop improvement and diversification, and remote sensing and modeling for climate change adaptation.\nThe center works to identify and introduce varieties of climate-resilient, salt-tolerant, and water-efficient crops in marginal environments. These crops include quinoa, amaranth, sorghum, pearl millet, Salicornia, dates and others.\nSince 2006-2007, ICBA has implemented a global research program on quinoa, resulting in the identification of five quinoa lines. This program has led to the successful adoption of quinoa in countries in the Middle East, North Africa, and Central Asia.\nThe center has also achieved a breakthrough in its research on Salicornia under UAE conditions. Scientists have recorded a bumper seed yield of 3 tonnes per hectare using seawater passing through an aquaculture system.\nICBA established a genebank in 2000 to conserve crop diversity and is officially part of the Multilateral System of Access and Benefit-sharing of the International Treaty on Plant Genetic Resources for Food and Agriculture. ICBA has been collecting and conserving seeds of salt-tolerant plant species for research purpose at ICBA and other institutes with similar research interests. ICBA’s genebank is home to one of the world’s largest collections of plant species and crop varieties that are tolerant of heat, drought and salt. It conserves more than 15,000 accessions of 270 plant species from more than 150 countries and territories. There are also around 250 seed samples of 70 wild plant species from the UAE, the center’s host country. ICBA distributes samples to scientists, farmers and other stakeholders in 57 countries.\nFile:Treated wastewater Jordan.jpg|Using treated wastewater for agriculture in Jordan - part of ICBA’s regional program.\nFile:Salicornia reseach plots at ICBA.JPG|Salicornia research plots at ICBA.\nFile:Salicornia trials at International Center for Biosaline Agriculture.jpg|Salt-tolerant Salicornia'' shows promise for bioenergy.\nFile:Quinoa Chenopodium quinoa.jpg|ICBA has been evaluating quinoa for use in dry and saline environments.\nRefreshed ICBA Strategy 2019-2023\nThe guiding force behind the center’s work since 2012 was ICBA Strategy 2013-2023. Because of significant changes in the global research and development landscape, and new threats and opportunities (like adoption of the UN Sustainable Development Goals, SDGs), ICBA carried out a mid-term review of its strategy.\nThe refreshed strategy for the remaining period of 2019-2023 is mostly aligned with its predecessor but also takes into account emerging fields like genomics and controlled-environment agriculture, including vertical farming, that hold great potential for future food, nutrition and water security in marginal environments. As part of the refreshed strategy, ICBA also mapped out how its work will achieve outcomes, impacts and ultimately contribute to the SDGs.\nPartnerships and strategic alliances\nICBA works closely with national agricultural research systems, regional and international financial, development, research, and academic institutions, including NASA, the University of Oxford, CGIAR, AIRCA, around the world. The center has strategic partnerships with FAO, IFAD, ICRISAT, IWMI, ICARDA, ILRI, and IFPRI.\nReach\nThe geographic scope of ICBA's activities has grown since its establishment. To date, ICBA has implemented research-for-development programs in more than 30 countries, and this number continues to grow. The center focuses on countries in the Middle East and North Africa (MENA), including Gulf Cooperation Council countries (GCC), Central Asia and the Caucasus (CAC), South Asia, and sub-Saharan Africa.\nSee also\n* Biosalinity\n* Halophyte\n*Biosaline Agriculture\n* Quinoa\n* Salicornia\n* Brackish water\nReferences\nExternal links\n*"
    }
  ]
}