{
  "content": [
    {
      "type": "text",
      "text": "# Integrated Public Alert and Warning System\n\nThe Integrated Public Alert and Warning System (IPAWS) is the primary public warning system of the United States, implemented as a platform that unifies the Emergency Alert System, National Warning System, Wireless Emergency Alerts, and NOAA Weather Radio under a single architecture. IPAWS was designed to modernize these systems by enabling alerts to be aggregated over a network and distributed to the appropriate system for public dissemination concurrently. IPAWS uses the Common Alerting Protocol (CAP) for message formatting and distribution.\nHistory\nIn June 2006, following criticism over the government's response to Hurricane Katrina, President George W. Bush signed Executive Order 13407 ordering the Secretary of Homeland Security to establish a new program to integrate and modernize the nation's existing population warning systems.\nThese systems include the:\n*Emergency Alert System (EAS),\n*National Warning System (NAWAS),\n*Wireless Emergency Alerts (WEA, or the Commercial Mobile Alert System (CMAS), and\n*NOAA Weather Radio All Hazards.\nThe new network, subsequently termed the Integrated Public Alert and Warning System (IPAWS) is designed to integrate these various systems into one modern network, and also update them to take into account newer forms of communication such as cellular telephony and Cell Broadcast, satellite and cable television, electronic billboards and the internet.\nOrganization\nThe program is organized and funded by the Federal Emergency Management Agency (FEMA), an agency of the Department of Homeland Security. The system allows for alerts to be originated by Federal, State, local and tribal officials, and subsequently disseminated to the public using a range of national and local alerting systems including EAS, CMAS and NWR. The system uses open standard digital formats such as the EDXL-based Common Alerting Protocol v1.2 for its messages, allowing for interoperable dissemination to a wide range of third party receivers.\nIPAWS-OPEN\nIntegrated Public Alert & Warning System Open Platform for Emergency Networks (IPAWS-OPEN) is an IP based network that has integrated the different emergency alert systems of the United States. Its purpose is to connect alert originators to a server which then aggregates and disseminates alerts to the proper systems. IPAWS-OPEN uses CAP.\nProgress\nIn December 2009, the DHS reached agreement with the Federal Communications Commission (FCC) and the two main telecommunication industry bodies Alliance for Telecommunications Industry Solutions and Telecommunications Industry Association to establish a specification for the interface between CMAS and commercial mobile carriers. Under this agreement, the industry was given a 28-month period to develop, test and deploy a system to allow CMAS alerts to be disseminated to mobile devices. Specifically, the system will allow 90-character SMS to be pushed to all cellphones and pagers in a geographical area, warning of imminent dangers to life or property. The first such gateway was expected to open in early 2011.\nIn January 2010, the first live code testing of the EAS was conducted in Alaska. The first ever nationwide test of the system took place on November 9, 2011.\nIn September 2010, FEMA announced IPAWS would be utilizing Open Platform for Emergency Networks (OPEN) to move standards-based alert and information messages between alert and warning systems.\nStakeholders\n*National Governors Association\n*National Academy of Public Administration\n*International City/County Management Association\n*National League of Cities\n*National Conference of State Legislatures\n*Council of State Governments\n*National Association of Counties\n*International Association of Emergency Managers\n*National Congress of American Indians\n*National Federation of the Blind\n*National Association of the Deaf\nSee also\n*CONELRAD\n*Emergency Broadcast System\n*Emergency Alert System\n*Wireless Emergency Alerts\n*NOAA Weather Radio All Hazards\nReferences"
    }
  ]
}