{
  "content": [
    {
      "type": "text",
      "text": "# Interior Schwarzschild metric\n\nIn Einstein's theory of general relativity, the interior Schwarzschild metric (also interior Schwarzschild solution or Schwarzschild fluid solution) is an exact solution for the gravitational field in the interior of a non-rotating spherical body which consists of an incompressible fluid (implying that density is constant throughout the body) and has zero pressure at the surface. This is a static solution, meaning that it does not change over time. It was discovered by Karl Schwarzschild in 1916, who earlier had found the exterior Schwarzschild metric.\nMathematics\nThe interior Schwarzschild metric is framed in a spherical coordinate system with the body's centre located at the origin, plus the time coordinate. Its line element is\n: \\begin{align}\nc^2\\, d\\tau^2 =&\n-\\frac{1}{4} \\left(3 \\sqrt{1 - \\frac{r_s}{r_g}} - \\sqrt{1 - \\frac{r^2 r_s}{r_g^3}}\\right)^2 c^2 \\,dt^2 \\\\\n&{} + \\left(1 - \\frac{r^2 r_s}{r_g^3}\\right)^{-1} \\,dr^2 + r^2 (d\\theta^2 + \\sin^2\\theta \\,d\\varphi^2),\n\\end{align}\nwhere\n: \\tau is the proper time (time measured by a clock moving along the same world line with the test particle),\n: c is the speed of light,\n: t is the time coordinate (measured by a stationary clock located infinitely far from the spherical body),\n: r is the Schwarzschild radial coordinate; each surface of constant t and r has the geometry of a sphere with measurable (proper) circumference 2\\pi r and area 4\\pi r^2 (as by the usual formulas), but the warping of space means that the proper distance from each shell to the center of the body is greater than r,\n: \\theta is the colatitude (angle from north, in units of radians),\n: \\varphi is the longitude (also in radians),\n: r_s is the Schwarzschild radius of the body, which is related to its mass M by r_s = 2GM/c^2, where G is the gravitational constant (for ordinary stars and planets, this is much less than their proper radius),\n: r_g is the value of the r coordinate at the body's surface; this is less than its proper (measurable interior) radius, although for the Earth the difference is only about 1.4&nbsp;millimetres.\nThis solution is valid for r \\leq r_g. For a complete metric of the sphere's gravitational field, the interior Schwarzschild metric has to be matched with the exterior one,\n:\n-c^2 \\,d\\tau^2 =\n\\left(1 - \\frac{r_s}{r}\\right) c^2 \\,dt^2 - \\left(1 - \\frac{r_s}{r}\\right)^{-1} \\,dr^2\n- r^2 (d\\theta^2 + \\sin^2\\theta \\,d\\varphi^2),\nat the surface. It can easily be seen that the two have the same value at the surface, i.e., at r = r_g.\nOther formulations\nDefining a parameter \\mathcal{R}^2 = r_g^3 / r_s, we get\n: \\begin{align}\n-c^2 d\\tau^2 =& -\\frac{1}{4} \\left(3 \\sqrt{1 - \\frac {r^2_g}{\\mathcal{R}^2}}\n- \\sqrt{1 - \\frac{r^2}{\\mathcal{R}^2}}\\right)^2 c^2 \\,dt^2 \\\\\n&{} + \\left(1 - \\frac{r^2}{\\mathcal{R}^2}\\right)^{-1} \\,dr^2 + r^2 (d\\theta^2 + \\sin^2\\theta \\,d\\varphi^2).\n\\end{align}\nWe can also define an alternative radial coordinate \\eta = \\arcsin \\frac{r}{\\mathcal{R}} and a corresponding parameter \\eta_g = \\arcsin \\frac{r_g}{\\mathcal{R}} = \\arcsin \\sqrt{\\frac{r_s}{r_g}}, yielding\n:\nc^2 d\\tau^2 =\n\\left(\\frac{3 \\cos \\eta_g - \\cos \\eta}{2}\\right)^2 c^2 \\,dt^2\n- \\frac{dr^2}{\\cos^2 \\eta} - r^2 (d\\theta^2 + \\sin^2\\theta \\,d\\varphi^2).\nProperties\nVolume\nWith g_{rr} = (1-r_s r^2/r_g^3)^{-1} and the area A = 4 \\pi r^2, the integral for the proper volume is\n: V = \\int_0^{r_g} A \\sqrt{g_{rr}} \\,dr = 2 \\pi \\left(\\frac{r_g^{9/2} \\arcsin \\sqrt{\\dfrac{r_s}{r_g}}}{r_s^{3/2}} - \\frac{r_g^4 \\sqrt{1 - \\dfrac{r_s}{r_g}}}{r_s}\\right),\nwhich is larger than the volume of a euclidean reference shell.\nDensity\nThe fluid has a constant density by definition. It is given by\n:\\rho = \\frac{M}{\\frac{4\\pi}{3}r_g^3} = \\frac{3}{\\kappa \\mathcal{R}^2},\nwhere \\kappa = 8\\pi G / c^2 is the Einstein gravitational constant. It may be counterintuitive that the density is the mass divided by the volume of a sphere with radius r_g, which seems to disregard that this is less than the proper radius, and that space inside the body is curved so that the volume formula for a \"flat\" sphere shouldn't hold at all. However, M is the mass measured from the outside, for example by observing a test particle orbiting the gravitating body (the \"Kepler mass\"), which in general relativity is not necessarily equal to the proper mass. This mass difference exactly cancels out the difference of the volumes.\nPressure and stability\nThe pressure of the incompressible fluid can be found by calculating the Einstein tensor G_{\\mu\\nu} from the metric. The Einstein tensor is diagonal (i.e., all off-diagonal elements are zero), meaning there are no shear stresses, and has equal values for the three spatial diagonal components, meaning pressure is isotropic. Its value is\n:p=\\rho c^2 \\frac{\\cos\\eta-\\cos\\eta_g}{3\\cos\\eta_g-\\cos\\eta}.\nAs expected, the pressure is zero at the surface of the sphere and increases towards the centre. It becomes infinite at the centre if \\cos \\eta_g = 1/3, which corresponds to r_s = \\frac{8}{9} r_g or \\eta_g \\approx 70.5^\\circ, which is true for a body that is extremely dense or large. Such a body suffers gravitational collapse into a black hole. As this is a time dependent process, the Schwarzschild solution does not hold any longer.\nRedshift\nGravitational redshift for radiation from the sphere's surface (for example, light from a star) is\n:z = \\frac 1 {\\cos \\eta_g} -1.\nFrom the stability condition \\cos \\eta_g > 1/3 follows z .\nVisualization\nof a Schwarzschild metric's slice in three-dimensional Euclidean space. The interior solution is the darker cap at the bottom.This embedding should not be confused with the unrelated concept of a gravity well.]]\nThe spatial curvature of the interior Schwarzschild metric can be visualized by taking a slice (1) with constant time and (2) through the sphere's equator, i.e. t = const., \\theta = \\pi/2. This two-dimensional slice can be embedded in a three-dimensional Euclidean space and then takes the shape of a spherical cap with radius \\mathcal{R} and half opening angle \\eta_g. Its Gaussian curvature K is proportional to the fluid's density and equals \\mathcal{R}^{-2} = r_s / r_g^3 = \\rho \\kappa / 3. As the exterior metric can be embedded in the same way (yielding Flamm's paraboloid), a slice of the complete solution can be drawn like this:\nIn this graphic, the blue circular arc represents the interior metric, and the black parabolic arcs with the equation w = 2 \\sqrt{r_s (r - r_s)} represent the exterior metric, or Flamm's paraboloid. The \\eta-coordinate is the angle measured from the centre of the cap, that is, from \"above\" the slice. The proper radius of the sphere – intuitively, the length of a measuring rod spanning from its centre to a point on its surface – is half the length of the circular arc, or \\eta_g \\mathcal{R}.\nThis is a purely geometric visualization and does not imply a physical \"fourth spatial dimension\" into which space would be curved. (Intrinsic curvature does not imply extrinsic curvature.)\nExamples\nHere are the relevant parameters for some astronomical objects, disregarding rotation and inhomogeneities such as deviation from the spherical shape and variation in density.\n{| class=\"wikitable\"\n|-\n! Object\n! r_g\n! r_s\n! \\mathcal{R}\n! \\eta_g\n! z (redshift)\n|-\n| Earth\n| 6,370&nbsp;km\n| 8.87&nbsp;mm\n| 170,000,000&nbsp;km9.5&nbsp;light-minutes\n| 7.7″\n| 7×10−10\n|-\n| Sun\n| 696,000&nbsp;km\n| 2.95&nbsp;km\n| 338,000,000&nbsp;km19&nbsp;light-minutes\n| 7.0′\n| 2×10−6\n|-\n| White dwarf with 1 solar mass\n| 5000&nbsp;km\n| 2.95&nbsp;km\n| 200,000&nbsp;km\n| 1.4°\n| 3×10−4\n|-\n| Neutron star with 2 solar masses\n| 20&nbsp;km\n| 6&nbsp;km\n| 37&nbsp;km\n| 30°\n| 0.15\n|}\nHistory\nThe interior Schwarzschild solution was the first static spherically symmetric perfect fluid solution that was found. It was published on 24 February 1916, only three months after Einstein's field equations and one month after Schwarzschild's exterior solution.\nReferences\nde:Schwarzschild-Metrik#Innere Lösung"
    }
  ]
}