{
  "content": [
    {
      "type": "text",
      "text": "# International Medieval Combat Federation\n\nThe International Medieval Combat Federation is a global historical full contact sport fighting revival movement, in which combatants use historically accurate reproduction medieval and early modern armour and blunted weapons to engage in competitive fights according to authentic historical tournament rules. Founded in 2013, the organisation now attracts hundreds of fighters from 26 countries at various fighting competitions around the world. Most events are open to the public and major competitions are regularly seen by tens of thousands of spectators. The league holds dozens of smaller events throughout the year as well as a world championship competition in which national teams, selected from local or regional clubs in their respective countries, assemble at a suitably historical venue to compete. These events take the character of a medieval tournament, with historical attractions and exhibits beside the competition, as well as market stalls selling historically-themed foods, goods and souvenirs. Competing teams are billeted in reproduction medieval camps and must wear authentic clothing. Somewhat unlike the medieval competition, fighting is exclusively on foot, and strict rules are enforced to ensure the safety of competitors and fairness in the competition. The fighting can be between individuals or teams of up to 16 fighters per side.\nHistory and background\nThe IMCF was founded in 2013 in response to a dispute between national teams and the organisers of the Battle of the Nations competition, founded three years previously. Dozens of national teams attended the first IMCF world championship competition at the 15th century Belmonte Castle, in Spain. The next world championship competition was held in 2015 at Malbork Castle, Poland. The location for the 2016 IMCF world championship was in Portugal. In 2017 the tournament was held in Spottrup, Denmark.\nRules and objectives\nRules for competitions draw closely on original medieval texts outlining sport (i.e. non-lethal) tournament combat, such as King René's Tournament Book from 1460. Where original information is not available, or would present too great a risk to those fighting, new rules can be devised by an international team of referees, or marshals, to be voted upon by fighters. As a young sport, rules are regularly updated in response to observations during competitions and subsequently rules of fighting may vary somewhat year-by-year.\nArmour\nAll fighters must wear historical steel armour that encloses the torso, limbs, head & neck, & hands, and beneath this a padded layer, known as a gambeson. Helmets must be analogous to the rest of the armour, must cover the face and must be closed with a strap to prevent removal during combat. All armour must be of a style traceable to a historical period and location, no piece may date from more than 50 years of another. Fighters may wear a supplementary third layer of protective equipment beneath their gambeson, provided it is not visible and does not replace any armour above it, such as a Protective Cup or mouthguard.\nWeapons\nAll weapons are reproductions based on historical originals. These originals may be found in museums or drawings traceable to the period. All weapons must be blunt and within a set weight and size category, dependent upon the weapon. Metal maces, axes, swords (including falchions) and polearms are all permitted in group fights, while war hammers and weapons with hammer attachments may not be used in international events.\nShields\nShields are commonly used as weapons as much as swords and other such medieval arms, with fighters choosing to combine strikes from their primary weapon alongside punches with their shield. Subsequently, shields are regulated as weapons. While being historical in design, shields must also meet a minimum weight requirement and not have narrow, sharp or metal edges.\nIMCF World Championship Team Victories\nResults for the IMCF World championships 2014-2016\n{| class=\"wikitable\"\n|-\n! 2014 - Castillo De Belmonte, SP !! Polerams M !! Polearms F !! Longswords M !! Longswords F !! Sword&shield M !! Sword&shield F !! 5v5 !! 3v3 F !! 10v10 !! 16v16\n|-\n| Gold ||  ||  || Poland ||  France|| Poland || France || USA || USA ||  || Poland\n|-\n| Silver ||  ||  ||  ||  Russia|| ||  Austria|| Poland || International: Japan, Portugal, France,\nPoland, Belgium, Luxembourg, Spain\n|  || USA\n|-\n| Bronze ||  ||  ||  ||  USA|| ||  Russia|| Germany ||  ||  || Denmark\n|}\n{| class=\"wikitable\"\n|-\n! 2015 - Malbork Castle, PO !! Polerams M !! Polearms F !! Longswords M !! Longswords F !! Sword&shield M !! Sword&shield F !! 5v5 !! 3v3 F !! 10v10 !! 16v16\n|-\n| Gold || France || || Poland || Quebec || Poland ||  || Poland || Poland || Poland || Poland\n|-\n| Silver || Spain || Poland || France || Poland || England ||  || England || England || England || USA\n|-\n| Bronze || Poland ||  || Lithuania || Japan ||  ||  || USA ||  ||  ||\n|}\n{| class=\"wikitable\"\n|-\n! 2016 - Montemor-O-Velho, PT !! Polerams M !! Polearms F !! Longswords M !! Longswords F !! Sword&shield M !! Sword&shield F !! 5v5 !! 3v3 F !! 10v10 !! 16v16\n|-\n| Gold ||  ||  ||  ||  ||  ||  ||  ||  ||  ||\n|-\n| Silver ||  ||  ||  ||  ||  ||  ||  ||  ||  ||\n|-\n| Bronze ||  ||  ||  ||  ||  ||  ||  ||  ||  ||\n|}\nResults for the IMCF World championships 2017-2019\n{| class=\"wikitable\"\n|-\n! 2017 - Spøttrup, DK !! Polerams M !! Polearms F !! Longswords M !! Longswords F !! Sword&shield M !! Sword&shield F !! 5v5 !! 3v3 F !! 10v10 !! 16v16\n|-\n| Gold || Ukraine || Quebec || Poland || Ireland || Poland || Germany || Ukraine || Quebec || Ukraine || Ukraine\n|-\n| Silver || USA || Ukraine || New Zealand || Germany || Ukraine || New Zealand || Poland || Ukraine || Poland || USA\n|-\n| Bronze || Spain || USA || Ireland || Ukraine || Germany || Quebec || France || Finland || France || Poland\n|}\n{| class=\"wikitable\"\n|-\n! 2018 - Scone Palace, UK !! Polerams M !! Polearms F !! Longswords M !! Longswords F !! Sword&shield M !! Sword&shield F !! 5v5 !! 3v3 F !! 10v10 !! 16v16\n|-\n| Gold || USA || Quebec || Lithuania || France || Ukraine || Quebec || Ukraine || Quebec || France || USA\n|-\n| Silver || Quebec || Poland || France || Sweden || Poland || Ukraine || France || Ukraine || Germany || France\n|-\n| Bronze || France || Denmark || Poland || Quebec || France || Poland || USA || Finland || Australia || England\n|}\n{| class=\"wikitable\"\n|-\n! 2019 - The Kievan Rus Park, UA\n!! Polerams M !! Polearms F !! Longswords M !! Longswords F !! Sword&shield M !! Sword&shield F !! 5v5 !! 3v3 F !! 10v10 !! 16v16\n|-\n| Gold || France || Ireland || Poland || Ireland || Poland || Moldova || Ukraine || Finland || Ukraine || Ukraine\n|-\n| Silver || England || Quebec || Austria || Sweden || Ukraine || Ukraine || Poland || Ukraine || Poland || Poland\n|-\n| Bronze || Luxemburg || Moldova || Spain || France || Austria || England || Finland || England || Austria || Denmark\n|}\nTraining and preparation\nAs with all combat or full-contact sports, preparation and training is a crucial part of a team's approach to competition. Despite the importance of physical training for the sport, no single training regime tailored for the physical demands of fighting in armor survives from the medieval period, and subsequently, competitors often combine occasional sparring with a variety of physical training techniques.\nSee also\n*Historical medieval battles\n*Battle of the Nations (modern tournament)\n*Hastilude\nReferences\nExternal links\n*[https://www.imcfederation.net/ International Medieval Combat Federation]"
    }
  ]
}