{
  "content": [
    {
      "type": "text",
      "text": "# International reactions to the Syrian civil war__disambig_1\n\nInternational reactions to the Syrian civil war ranged from support for the government to calls for the government to dissolve. The Arab League, United Nations and Western governments in 2011 quickly condemned the Syrian government's response to the protests which later evolved into the Syrian civil war as overly heavy-handed and violent. Many Middle Eastern governments initially expressed support for the government and its \"security measures\", but as the death toll mounted, especially in Hama, they switched to a more balanced approach, criticizing violence from both government and protesters. Russia and China vetoed two attempts at United Nations Security Council sanctions against the Syrian government.\nInternational peace plans\nSince late 2011, peace plans or initiatives have been launched by the Arab League, Russia, and the United Nations. A UN-backed international peace conference Geneva II Middle East peace conference was scheduled for 22 January 2014.\nSupranational bodies\nUnited Nations\n2011\n: Statements\nOn 18 March, UN Secretary General Ban Ki-moon described the use of force against protesters by the Syrian authorities as \"unacceptable\".\nOn 22 March, UN Human Rights High Commissioner Navi Pillay urged the Syrian government to investigate the violence.\nOn 3 August, the United Nations Security Council, in a non-binding statement, condemned Syrian authorities for attacking civilians, in its first pronouncement on Syria since March.\nThe statement, which did not threaten economic sanctions and lacked the full stature of a resolution, was disavowed by Security Council member Lebanon.\n: Investigation on human rights violations\nOn 22 August 2011, the 'Independent International Commission of Inquiry on the Syrian Arab Republic' was set up by the United Nations Human Rights Council to investigate human rights violations during the Syrian civil war. In September 2012 the Inquiry's Commissioners became Carla del Ponte and Vitit Muntarbhorn.\n: Security Council resolutions\n4 October 2011, Russia and China vetoed a Europe-drafted UN Security Council (UNSC) resolution condemning Assad's government.\nThe resolution would have threatened the Syrian government with targeted sanctions given continued military actions against protestors.\nIn December 2011, Russia introduced its own draft resolution, assigning blame to both the Syrian government and opposition. US Secretary of State, Hillary Clinton, stated that the US would not support the Russian resolution.\n2012\nOn 31 January 2012, the Security Council discussed a Western-Arab resolution that demanded an immediate halt to military action, supported the latest (December 2011) Arab League peace plan and called on Assad to cede power.\nOn 4 February, Russia and China vetoed this resolution.\nA similar text was advanced in the UN General Assembly, which on 16 February 2012 endorsed this non-binding resolution. Russia, China and ten other nations voted against it.\n2013\nOn 27 September 2013, the UNSC passed United Nations Security Council Resolution 2118, which enshrined Syria's agreement to surrender its chemical weapons.\nArab League\nAugust–September 2011\nArab League Secretary-General Nabil Elaraby called for an end to the violence on 7 August, specifically saying the Syrian government should \"stop all acts of violence\" at once.\nOn 27 August, the Arab League condemned the crackdown and dispatched Elaraby on an \"urgent mission\" to Syria. After meeting with Assad on 10 September, Elaraby told reporters, \"I heard from him an understanding of the situation and he showed me a series of measures taken by the Syrian government that focused on national dialogue.\"\nNovember–December 2011\nIn early November the Arab League announced that the Syrian Government had agreed to end its crackdown, remove troops, release prisoners, begin a dialog with its citizens and allow observers and journalists free movement.\nOn 12 November 2011, the Arab League voted to suspend Syria from the organization if Al-Assad's government failed to stop military action by 16 November and invited Syria's opposition parties to join talks in the League's Cairo headquarters. Syria, Lebanon, Sudan, Mauritania, and Yemen voted against the action, while Iraq abstained. The League warned of possible sanctions against Syria. On 16 November the Arab League suspended Syria's membership.\nOn 18 December the Arab League told Syria that it would convey its draft resolution by five Arab League members asking the UNSC to end the violence if the Syrian government failed to comply within two weeks. Sheikh Hamad bin Jassim al-Thani, the Qatari Prime Minister and head of the Arab League ministerial committee admitted: \"If the Syrian crisis is not solved within two weeks, the matter will be beyond the control of Arab countries.\"\nThe Arab League on 31 August or 1 September 2013 called on the United Nations to intervene in Syria.\nEuropean Union\nOn 22 March 2011, Catherine Ashton, the High Representative of the Union for Foreign Affairs and Security Policy, issued a statement saying that the European Union \"strongly condemns the violent repression, including through the use of live ammunition, of peaceful protests in various locations across Syria\". Ashton reiterated the EU's condemnation on 31 July after military operations in the city of Hama resulted in at least 136 deaths. Ashton said on 18 August, \"The EU notes the complete loss of Bashar al-Assad's legitimacy in the eyes of the Syrian people and the necessity for him to step aside.\"\nGulf Cooperation Council\nIn a 6 August 2011 joint statement of Gulf Cooperation Council (GCC) governments, the Persian Gulf grouping criticized \"mounting violence and the excessive use of force which resulted in killing and wounding large numbers\" and \"express[ed] sorrow for the continuous bloodshed\". The statement also affirmed the GCC's support for Syria's \"security, stability, and unity\", evidently a reference to the government's repeated accusations of outside interference.\nOrganisation of Islamic Cooperation\nThe 57-member Organisation of Islamic Cooperation (OIC) called for an immediate stop to the violent crackdown on 13 August 2011. In August, 2012, at its 4th Extraordinary Session, the OIC voted to suspend Syrian membership.\nBolivarian Alliance for the Americas\nAt a summit on 10 September 2011, the ALBA (Bolivarian Alliance for the Peoples of Our America) regional bloc expressed support for the Syrian government and warned against an international military intervention in Syria.\nG8\nThe G8 leaders, on their summit in Northern Ireland, June 2013, hosted by UK Prime Minister Cameron, stated in their concluding declaration that the G8 countries:\n* endorse the idea of the Geneva II peace conference;\n* promise an additional $1.5 billion for humanitarian aid in and around Syria;\n* call for the destruction and expulsion from Syria of all non-state actors linked to terrorism, as for example those affiliated to Al-Qaeda.\nStates\nPeople's Republic of China\nThe Foreign Ministry Spokesperson Jiang Yu said on 24 May 2011: \"China believes that when it comes to properly handling the current Syrian situation, it is the correct direction and major approach to resolve the internal differences through political dialogue and maintain its national stability as well as the overall stability and security of the Middle East. The future of Syria should be independently decided by the Syrian people themselves free from external interference. We hope the international community continues to play a constructive role in this regard.\" On 4 October 2011, Russia and China vetoed a resolution that would have threatened the Syrian government with targeted sanctions if it continued military actions, claiming they wanted to prevent a \"Libyan intervention scenario\". Later they admonished the Syrian Government, expressing their desire for them to reform and respect the will of the Syrian people.\nChinese media blamed violence in China's Xinjiang province in June 2013 on extremists from Syria. The Global Times reported that members of an East Turkestan faction had traveled from Turkey to Syria. \"This Global Times reporter has recently exclusively learned from the Chinese anti-terrorism authorities that since 2012, some members of the 'East Turkestan' faction have entered Syria from Turkey, participated in extremist, religious and terrorist organisations within the Syrian opposition forces and fought against the Syrian army. At the same time, these elements from 'East Turkestan' have identified candidates to sneak into Chinese territory to plan and execute terrorist attacks.\" It also cited the arrest of 23-year-old Maimaiti Aili, of the East Turkestan Islamic Movement (ETIM), and said that he had fought in the Syrian civil war. Dilxat Raxit, the Sweden-based spokesman for the World Uyghur Congress, denied Uyghur involvement. Foreign Ministry spokeswoman Hua Chunying did not directly respond to the claims, but said that China has \"also noted that in recent years East Turkestan terrorist forces and international terrorist organizations have been uniting, not only threatening China's national security but also the peace and stability of relevant countries and regions.\"\nIran\nIran's Supreme Leader Ali Khamenei spoke in favour of the Syrian government in regard to the uprising – \"In Syria, the hand of America and Israel is evident\" and \"Wherever a movement is Islamic, populist and anti-U.S., we support it\". The Guardian reported that the Iranian government was assisting the Syrian government with riot control equipment, intelligence monitoring techniques, oil supply and snipers. Allegedly Iran sent the Syrian government $9 billion to help it withstand the sanctions.\nThen-President Mahmoud Ahmadinejad said in an interview with the Lebanese television news network Al-Manar on 25 August 2011 that the violence should end and \"the people and government of Syria\" should join in a national dialogue. \"When there is a problem between the people and their leaders, they must sit down together to reach a solution, away from violence\", Ahmadinejad said. However, he told Emir Hamad bin Khalifa Al Thani of Qatar on 26 August that he believed that any \"interference of foreigners and domineering powers in the regional countries' internal affairs would complicate the situation\".\nForeign Minister Ali Akbar Salehi on 27 August 2011, said the Syrian government should respond to the people's \"legitimate demands\". However, Salehi also cautioned that a \"power vacuum\" in Syria could have \"unprecedented repercussions\" for the region.\nOn 15 August, while visiting Cairo, high-ranking Iranian parliamentarian Alaeddin Boroujerdi condemned the actions of Syrian protesters, claiming they were U.S. agents trying to destabilize Syria to benefit Israel. On the same day an alleged defector from the Syrian secret police claimed that Iranian soldiers, including snipers, were working alongside Syrian police, paramilitary, and military units fighting to put down the uprising.\nIn May 2013 Iranian Ambassador to the UN Mohammad Khazaee spoke about the Geneva II Middle East peace conference. He stated:\nWe believe that, apart from the Syrian sides, all relevant regional and international partners that wield some influence over the parties and could help the Syrians move towards peace should participate in the conference and endeavour towards its success. Iran's participation in the conference will depend on the details that we will consider when we receive them.\nIn 29th International Islamic Unity Conference in Tehran on December 27, 2015, Iranian President Hassan Rouhani called on Muslim countries to unite, fighting extremism, and strive to improve Islam's public image. Does the destruction of Syria help strengthen Turkey, Jordan, Saudi Arabia, Qatar, the United Arab Emirates or other countries? Is anyone pleased by Syria's destruction apart from Israel?\", he said.\nIraq\nOn 3 April 2011, Prime Minister Nouri al-Maliki called Assad and voiced Iraq's support of Syria \"in the face of conspiracies targeting Syria's stability\". However, on 9 August 2011 the Council of Representatives of Iraq issued a statement demanding reforms and an immediate halt to violence, which read in part: \"We call to stop all non-peaceful practices, and all actions for suppression of freedoms and bloodshed is condemned and unacceptable.\" Speaker Usama al-Nujayfi condemned the use of violence by the government and said, \"For the sake of the Syrian people, we demand the government, out of its responsibility to safeguard the lives of its people and their property, take the bold and courageous steps to stop the bleeding.\" However, Maliki appeared unswayed in his support for Assad, blaming protesters for trying to \"sabotage\" Syria and saying they should \"use the democratic process, not riots, to voice their displeasure\". Iraqi Ambassador to the United States Samir Sumaida'ie said in an interview with a Foreign Policy blog, on 25 August 2011, that he believed Assad's government was \"steadily losing its friends, its credibility, and its grip\" and would eventually collapse, which would \"alter the balance of power in the region and will eventually weaken Iran and reduce its capacity to project its power through Hezbollah, Hamas, and other instruments\". He said Baghdad is not concerned about any potential instability that may arise from Assad's ouster.\nMuqtada al-Sadr, the cleric that leads the Sadr Movement, expressed support for Assad, saying that \"there is a big difference between what is happening in Syria and the great revolutions in Tunisia, Egypt, Libya, Bahrain and Yemen, one of the reasons behind this difference is that Bashar al-Assad is against the U.S. and Israeli presence and his attitudes are clear, not like those who collapsed before him, or will collapse.\" He also warned that the demonstrations could bring Syria into \"an abyss of terrorism and fragmentation in the event of a vacuum in power. However, on 27 April 2013, Al-Maliki expressed concern, stating that \"a plague of sectarianism\" was sweeping Iraq as it had in Syria. Following the Khan Shaykhun chemical attack on 4 April 2017, Sadr called for Assad to step down.\nIsrael\nIsraeli reactions have been mixed, with some claiming change in Syria would weaken their enemy Iran, and others countering that a change of government might be more dangerous.\nIsraeli government\n24 March 2011, Israeli Minister of Foreign Affairs Avigdor Lieberman said: \"The same principles, activities the Western world [has taken] in Libya ... I hope to see those regarding the Iranian regime and the Syrian regime.\" Israel expressed concern that Assad would try to divert attention from Syria by provoking border incidents with Israel in the Golan Heights, Lebanon or Gaza or even start a war with Israel to unite the Syrian people.\nOn 12 May 2011, Shin Bet said: Syria would be \"soaked in blood\", because Assad's government was \"fighting for its life\".\nOn 4 March 2012, Lieberman called on the international community to intervene.\nOn 10 June 2012, Prime Minister Benjamin Netanyahu said that an \"axis of evil\" was behind the atrocities in Syria. Netanyahu told the Cabinet that Iran and the militant group Hezbollah were assisting the Syrian government in the massacre of civilians. President Shimon Peres, said that the international community was not doing enough to stop the violence and urged the West to intervene.\nLabour party\nLabour MK Binyamin Ben-Eliezer said in May 2013: \"whether Assad remains in power or not, is not in our hands. We keep hearing intelligence assessments that he is about to go down. In my opinion, the current situation is the best one for us. Do the math: the other option is more chaotic, given that those expected to fill the vacuum are al-Qaeda and the Salafist organizations. It is better to face a state, because not having a clear address is much worse for us. There are almost 400 gangs operating in Syria, so with whom do you talk and who do you hold accountable?\" Minister for International Affairs, Strategy and Intelligence Yuval Steinitz said on 10 June 2013 that \"I always thought that it might be the case that at the end of the day Assad, with a very strong Iranian and Hezbollah backing, might gain the upper hand. And I think that this is possible and I thought that this is possible already a long time ago. [The government] might not just survive but even regain territories.\" The statement was met with a cool reception by the foreign and defense ministries.\nOther reactions\nOn January 10, 2012, Benny Gantz, the Israeli military chief of staff, informed members of the Knesset that in the event of the Syrian government's collapse, Israel was prepared to permit fleeing Syrian Alawites settlement in the Golan Heights. Former Mossad chief Efraim Halevy suggested that Israel should exploit the Shia-Sunni conflict. On 2 April 2011, in the village of Buq'ata, in the Golan Heights, 2,000 Druze protested in support of Assad, waving Syrian flags and portraits.\nPakistan\nPakistan adopted a policy of neutrality, calling for a political settlement through an \"inclusive\" dialogue in 2012. Pakistan abstained from the Security Council sanctions vote. Instead, Pakistan together with Britain, submitted a new draft resolution to authorize an extension to the United Nations Supervision Mission in Syria (UNSMIS). Historically, Pakistan has maintained strong political relations with the Assad family, dating back to the 1970s. According to the view of Khurshid Kasuri, Pakistan's silence was a product of \"historical links between the Bhutto and al-Assad families.\" At the conference held by Iran, Pakistan urged the international community to respect Syria's sovereignty, independence and territorial integrity. The Pakistan government emphasized peaceful solutions and opposed military action. In 2013, Pakistan's official policy statement stated, \"Pakistan's stand on Syria is based on principles of international law and UN Charter to respect [t]erritorial integrity of Syria; the policy of non-military or otherwise intervention and interference; settlement of dispute; and transition or transfer of power through peaceful means.\"\nOn 17 February 2014, Islamabad stated its support for \"the formation of a transitional governing body with full executive powers enabling it to take charge of the affairs of the country\". The statement, which followed a Saudi delegation's visit to Pakistan, came despite a Pakistani government official's claim that Pakistan's policy had not changed.\nIn December 2015, Pakistan foreign affairs stated that it is against any attempt to topple the government of Syrian president Bashar al-Assad.\nLebanon\nOn 31 March 2011, Prime Minister-designate Najib Mikati commended the \"ending of the chance to cause strife in Syria\" and hailed the Syrian people's \"support\" for their president. Also, President Michel Suleiman highlighted the importance of stability in Syria, and its positive impact on the security of and economic situation in Lebanon and Syria. On 3 August 2011, Lebanon was the only United Nations Security Council member to disassociate itself from a presidential statement read by the Indian delegate condemning the Syrian government.\nHezbollah announced support Assad, citing their status as a state of \"resistance\". Hezbollah leader Hassan Nasrallah suggested that the downfall of the Syrian government was an interest of the United States and Israel. The Syrian opposition accused Hezbollah of aiding the government. A news report suggested that Hezbollah was planning a military coup in Lebanon should the Assad government fall, with the assistance of the Free Patriotic Movement.\nDruze politician Walid Jumblatt expressed concern during an interview in Beirut about a full-scale civil war in Syria. Jumblatt said Assad was not listening to advice from former allies like Turkish Prime Minister Erdoğan, adding, \"Up 'til now he has refused to listen to the rightful demands of the Syrian people for a new Syria.\" Jumblatt however, retracted his previous statements and admitted that the rebels do not really represent a new Syria, he now agrees with hezbollah stance regarding the conflict.\nOn 27 September 2013, President Michel Sleiman said that \"Withdrawing from Syria should result from the implementation of the Baabda Declaration and those involved in Syria should place Lebanon's interest above others,\" in an implicit reference to Hezbollah, he further added that \"Lebanon's interest lies in maintaining distance and refraining from interference in Syria and I hope that everyone commits to that and the Baabda Declaration by withdrawing from Syria.\"\nRussia\nApril 2011\nIn regards to Russia's role in the Syrian civil war, on 6 April 2011, Russian president Dmitry Medvedev called al-Assad to voice support for the latter's decision to enact reforms.\nOn 28 April 2011, Russian UN Ambassador Alexandor Pankin warned against \"taking sides\", as \"such approaches lead to a never-ending circle of violence\". Russian and other intellectuals affirmed that Russia would not tolerate any interference in Syria. One reasons given for Russian opposition to any action by the UN or other organizations was their fear that the West would intervene on the side of the rebels. Alexander Fionik said that \"Russia has seen what happened in Libya. It would be logical to assume that Russia's stance on Syria would be more clear-cut than that on Libya\". Another reason noted was Russia's close relations with the Syrian government. Syria was one of the few governments to back Russia's 2008 military intervention in Georgia. Alexander Shumlin wrote, \"The fall of the Syrian regime will mean the disappearance of Russia's last partner in conducting Soviet-style policies in the Middle East whose essence in many ways boiled down to countering the United States\".\nMay 2011\nRussia has in early 2011 blocked a first US/European draft resolution in the UN Security Council attempting to condemn Syrian use of force, and has on 12 May 2011 blocked a report on Iranian arm sales to Assad. A council diplomat said, that Russia objected to \"the publication of the report as an official Security Council document\", but another council diplomat stated, \"It's obviously an attempt to protect (Syrian President) Bashar al-Assad\". The vetoed report had apparently contained material incriminating both the leadership of Iran and Syria in the transmission of arms to militant groups. Russia vetoed the first draft of the US/European resolution fearing it could lead to interference in Syrian affairs.\nJune 2011\nOn 2 June 2011, Foreign Minister Sergei Lavrov said: \"It is not in the interests of anyone to send messages to the opposition in Syria or elsewhere that if you reject all reasonable offers we will come and help you as we did in Libya ... It's a very dangerous position.\" He continued that, \"the situation doesn't present a threat to international peace and security ... Syria is a very important country in the Middle East and destabilizing Syria would have repercussions far beyond its borders\" and asserted that Assad had made attempts at major reform.\nOn 10 June, Russia with China used their Security Council veto to block the second draft of the Franco-British sponsored US/European resolution attempting to condemn Syrian use of force, again because they feared it could lead to interference in Syrian affairs. An interview in the Voice of Russia stated, \"What arouses concern is that in this resolution of Britain and France declares illegitimacy of the regime of Bashar al-Assad. That means that the approval of the resolution will make it possible for others countries to doubt the legitimacy of the regime on the base of this document.\"\n11 June, protesters in Homs burned the Russian flag and carried signs with anti-Russian slogans in protest to Russia's supporting Assad.\nOn the other hand, the following Friday 17 June, diaspora Syrians in Lebanon rallied in front of the Russian and Chinese embassies to \"express their gratitude for Russia and China's support for Damascus and [to reject] the conspiracies sought against Syria\".\nA Syrian anti-government delegation on 28 June visited Moscow and met with Russian envoy Mikhail Margelov, who after the meeting noted that \"leaders come and go\" and called for \"an end to any and all forms of violence\", which some interpreted to be a shift away from Assad. Such a change was considered potentially hazardous for the Syrian government, given its reliance on Russia for weapons and diplomatic and economic support.\nJuly–August 2011\nOn 19 July 2011, Medvedev said he was working with German chancellor Merkel on a strategy to persuade the Syrian government to abandon violence and begin a constructive dialogue with protesters. He did not threaten to veto to oppose a Security Council resolution critical of the Syrian government. Medvedev also said it was imperative that Syria not slide into civil war as Libya had.\nAmid 2011 the siege of Hama, the Russian Foreign Ministry issued a statement documenting deaths in Hama as well as condemning the violence, including the alleged killing of eight Syrian policemen. The statement beseeched the pro-Assad forces in addition to the violent protesters to \"exercise maximum restraint\".\nOn August 3, 2011, Russian ambassador Vitaly Churkin stated that Russia would not oppose a UN resolution condemning the violence in Syria as long as it does not include sanctions or other \"pressures\". Al Jazeera reported that Russia had \"softened the blow\" to the Assad government by insisting that the UN make a \"statement\" rather than a \"resolution\".\nOn 23 August 2011, the Russian delegation, along with those of China and Cuba, took to the floor to denounce a UN inquiry on Assad's human rights violations. Churkin stated that \"We hope to see progress, we hope to see dialogue established in Syria...We think we should continue to work within the scope of that unified position.\"\nOn 26 August 2011, according to UN envoys, the US/European effort to impose sanctions was meeting \"fierce resistance\" from Russia and China, with Churkin threatening to use Russia's veto. The arms embargo would prevent Russian firms (Syria's main armoury) from selling to Syria. Russia proposed a \"rival\" resolution for voting, described as \"toothless\" by Western diplomats, that did not include sanctions or other punitive measures, but rather urged Syria to accelerate its reforms.\nOctober–December 2011\nOn October 29, 2011, Chairman of the Foreign Affairs Committee in Russia's Federation Council, Mikhail Margelov said that the position of the Arab League, which called upon Assad to stop killing might lead to the end of bloodshed. Margelov also said that Syrian methods hamper implementation of inevitable reforms.\nOn 1 November 2011, Lavrov said that Russia would oppose the proposal for a no-fly zone in Syria as (in Russia's view) the no-fly zone in Libya had been used to \"support one side in a civil war\". Lavrov nonetheless claimed that \"we are not protecting any regime\".\nIn late November 2011 a naval flotilla led by the aircraft carrier Kuznetsov returned to its naval base in Tartus as a show of support for the al-Assad government. However, in an apparent contradiction, a Russian naval spokesman stated, \"The call of the Russian ships in Tartus should not be seen as a gesture towards what is going on in Syria\", and \"This was planned already in 2010 when there were no such events there. There has been active preparation and there is no need to cancel this\", noting that the Admiral Kuznetsov would also be making port calls in Beirut, Genoa and Cyprus.\nOn 15 December 2011, Russia proposed a Security Council resolution condemning the violence \"by all parties, including disproportionate use of force by Syrian authorities\". The draft resolution also raised concern over \"the illegal supply of weapons to the armed groups in Syria\". Western diplomats initially referred to the proposed resolution as a basis for negotiations. The proposal was an updated version of a Russo-Chinese draft from a few months earlier.\n2012\nRussia continued to ship arms to the government, with one ship loaded with \"dangerous cargo\" notably having to stop in Cyprus on 10 January 2012 due to stormy weather. Russia's current arms contracts with Syria are estimated to be 1.5 billion US dollars, compromising 10% of Russia's global arms sales. Syria also hosts a Russian navy base at Tartus, Russia's last military base outside the borders of the former USSR. Russia's arms sales sparked anger and criticism on the part of certain Western and Arab nations. The Russian government, for its part, defended its sales by pointing out that they did not violate any standing arms embargoes.\nBy the end of January 2012, a resolution proposal, competing with the Russian proposal of December 2011, had been drafted by Western and Arab powers which did not condemn violence by both sides and did not rule out military intervention. Russia indicated that it would not agree to the Western-Arab draft, and that it would continue to promote its own resolution. In early February 2012, Russia (along with China) vetoed the Western-Arab draft.\n2013\nEarly 2013, Rebel Chechen fighters joined the Syrian opposition's fight against the government.\nOn 11 September 2013, a New York Times editorial written by Vladimir Putin appeared regarding international events related to the United States, Russia and Syria.\nTurkey\nTurkish prime minister Recep Tayyip Erdoğan said on 2 April 2011, that he would press Assad on 4 April to remove emergency rule, release political prisoners and adopt a new constitution.\nPresident Abdullah Gül sharply condemned the siege of Hama escalation on 1 August 2011, saying the Syrian government's use of heavy weapons against the general populace \"has given me a deep shock\". Gül said it was \"impossible to remain silent in the face of events visible to everyone ... and accept a bloody atmosphere at the start of Ramadan\". He called upon the Syrian government to stop the violence and institute reforms to restore \"peace and stability\".\nOn 21 March 2011, Foreign Minister Ahmet Davutoğlu said, \"Syria is on an important threshold. We hope problems between the people and the administration [in Syria] can be handled without trouble.\" On 2 May 2011, Erdoğan warned that if the Syrian government replicated an incident like the Hama massacre during this uprising, Turkey would not stand idly by. On 10 June 2011, Erdoğan condemned Assad outright, calling the images of security forces attacking Syrian protesters \"unpalatable\" and criticizing the \"savagery\" of the government's response to the uprising. He said Turkey may back a proposed Security Council resolution condemning the Syrian government.\nAlthough on 5 August 2011, Davutoğlu said his government was not considering expelling the Syrian ambassador to Turkey, he visited Syria on 9 August 2011 to deliver a \"decisive message\". After meeting with Assad and other Syrian officials for over six hours, Davutoğlu said he had outlined \"concrete steps\" that the Syrian government should take, but he did not say how they responded. Reports indicated that he had delivered an ultimatum from Turkey's president to Syria's president. The Turkish government was allegedly concerned about Syrian ties to Iran and the role both have historically played in destabilising Iraq, as well as the possible sectarian dynamic of the conflict. On 15 August 2011, Davutoğlu warned that the violence must stop \"immediately and without conditions or excuses\" or Turkey would take unspecified \"steps\". Gül expressed disappointment in the government on 28 August and said his government had \"lost confidence\" in Assad.\nTurkey stopped at least two shipments of what it said were Iranian weapons en route to Syria, one in March 2011 and one in early August 2011.\nOn 22 November, Erdoğan said that Assad should learn from the fate of Muammar Gaddafi. Erdogan said that \"Assad is showing up and saying he would fight to the death. For God's Sake, against whom will you fight? Fighting against your own people is not heroism, but cowardice. If you want to see someone who has fought until death against his own people, just look at Nazi Germany, just look at Hitler, at Benito Mussolini, at Nicolae Ceausescu in Romania,\" and \"If you cannot draw any lessons from them, then look at the Libyan leader who was killed just 32 days ago in a manner none of us would wish for and who used the same expression you used.\"\nOn 10 April 2012, Erdoğan slammed the Syrian government saying, \"they are even shooting these fleeing people from behind. They are mercilessly shooting them, regardless of whether they are children or women.\" and added \"Indeed, he(Assad) gave his word to Mr. Annan, but despite giving his word he is continuing to kill 60, 70, 80, 100 every day. This is the situation.\" Erdoğan began trying to \"cultivate a favorable relationship with whatever government would take the place of Assad.\"\nOn 7 October 2013, Erdogan called Assad a terrorist, he said \"I don't regard Bashar al-Assad as a politician anymore. He's a terrorist carrying out state terrorism. A person who killed 110,000 of his people is a terrorist. There's state terrorism — I'm speaking frankly.\"\nBy October 2013, more than 500,000 Syrian refugees had fled to Turkey.\nUnited States\n2011\nMarch–April 2011\nPresident Barack Obama's administration on 18 March 2011 condemned the use of violence, stating: \"The United States stands for a set of universal rights, including the freedom of expression and assembly, and believes that governments, including the Syrian government, must address the legitimate aspirations of their people.\" Secretary of State Hillary Clinton stated that it was unlikely the US would intervene in Syria, since the US Congress viewed al-Assad as \"a reformer\". On 9 April, it was reported that Obama had said: \"I strongly condemn the abhorrent violence committed against peaceful protesters by the Syrian government today and over the past few weeks. I also condemn any use of violence by protesters ... I call upon the Syrian authorities to refrain from any further violence against peaceful protesters ... Furthermore, the arbitrary arrests, detention, and torture of prisoners that has been reported must end now, and the free flow of information must be permitted so that there can be independent verification of events on the ground...Violence and detention are not the answer to the grievances of the Syrian people. It is time for the Syrian government to stop repressing its citizens, and to listen to the voices of the Syrian people calling for meaningful political and economic reforms.\"\nMay 2011\nOn 18 May Obama imposed sanctions on Assad and six other senior Syrian officials. Additional sanctions were imposed by the Treasury Department against Syrian and Iranian intelligence services and commanders.\nOn 20 May, the U.S. told Assad to reform or step down.\nJuly 2011\nClinton condemned on 12 July both the attacks and the incumbent government, stating that al-Assad had \"lost legitimacy\", and that \"President Assad is not indispensable and we have absolutely nothing invested in him remaining in power.\" Robert Stephen Ford, the US ambassador to Syria, criticised the government on the embassy's Facebook page, stating: \"On July 9, a 'mnhebak' group threw rocks at our embassy, causing some damage. They resorted to violence, unlike the people in Hama, who have stayed peaceful... and how ironic that the Syrian Government lets an anti-US demonstration proceed freely while their security thugs beat down olive branch-carrying peaceful protesters elsewhere.\"\nOn 31 July responding to a pre-Ramadan crackdown, the bloodiest day of the uprising to date, Obama sharply condemned the violence, warning that Assad was \"on the wrong side of history and his people\", and added, \"Through his own actions, Bashar al-Assad is ensuring that he and his government will be left in the past, and that the courageous Syrian people who have demonstrated in the streets will determine its future. Syria will be a better place when a democratic transition goes forward.\" While he did not explicitly demand that Assad resign, he said the US would step up its efforts on the international stage to \"isolate the Assad government and stand with the Syrian people\".\nAugust 2011\nThe U.S. government slapped a new round of economic sanctions on Syrian telecom companies and banks tied to Damascus on 10 August. The sanctions rendered U.S. citizens unable to do business with the Commercial Bank of Syria, the Syrian Lebanese Commercial Bank, or Syriatel, and froze the U.S.-based assets of those companies.\nUnited Nations Ambassador Susan Rice said that testimonials from Syrian protesters as reported by Ford were shaping Washington's policies on Syria. \"What [Ford] hears every day and what [the protesters] want from the United States is more leadership, political pressure, and sanctions, but very clearly no military intervention\", she said.\nIn a written statement issued on 18 August, Obama said explicitly for the first time that Assad should resign: \"The future of Syria must be determined by its people, but President Bashar al-Assad is standing in their way ... For the sake of the Syrian people, the time has come for President Assad to step aside.\" He again condemned the violent crackdown, but reiterated that the US would not intervene in Syria's affairs beyond placing political and economic pressure on Assad to leave power. Both the E.U. and Canada joined U.S. calls for regime change. He also issued an executive order that \"blocks the property of the Syrian government, bans US persons from new investments in or exporting services to Syria, and bans US imports of, and other transactions or dealings in, Syrian-origin petroleum or petroleum products.\"\nThe same day, Clinton announced a full ban on imports of Syrian oil or petroleum products into the United States.\nOn 23 August U.S. ambassador Robert Ford made a surprise tour of the town of Jassem, which had seen government crackdown after popular protests. The Assad government denounced the visit as \"inciting unrest\" and banned Western diplomats from departing from Damascus; the U.S. embassy was attacked by a pro-Assad mob that broke windows and sprayed graffiti.\nOn 26 August the media reported that then-U.S. Central Intelligence Agency chief Leon Panetta traveled to Turkey in March 2011 to discuss regime change.\nNovember 2011\nOn 23 November the U.S. Embassy in Damascus issued a call for American nationals to leave Syria \"immediately while commercial transportation is available.\"\nOn 24 November the U.S. Navy's Carrier Strike Group Two was operating off the coast of Syria to monitor the uprising. An unnamed Western diplomat in the region noting: \"It is probably routine movement. But it is going to put psychological pressure on the regime, and the Americans don't mind that.\"\n2012\nOn 24 February after a veto by Russia and China of an Arab League-backed initiative, Clinton blasted Russia and China saying, \"It's quite distressing to see two permanent members of the Security Council using their veto while people are being murdered — women, children, brave young men... It is just despicable and I ask whose side are they on? They are clearly not on the side of the Syrian people.\"\nOn 20 August, Obama warned that the use of chemical weapons in Syria by President Bashar al-Assad would be a \"red line\" for America and would change Obama's views on intervening in the conflict. Obama said that the consequences of using these weapons would be enormous, and their deployment would widen the conflict in the region, and would concern America's allies as well.\n2013\nOn 13 June the Obama administration said that it would begin shipping small arms to Syrian rebels to help them topple the government. Administration officials \"cited clear evidence that the Syrian government had at different times used chemical weapons, including the nerve agent sarin, killing as many as 150 people and thus had crossed Obama's 'red line'. Officials confirmed the Central Intelligence Agency would coordinate all direct military assistance to the Syrian rebels.\"\nIn a speech on 31 August, Obama asked the United States Congress to authorize direct American military intervention. The United States Senate Committee on Foreign Relations approved the Authorization for the Use of Military Force Against the Government of Syria to Respond to Use of Chemical Weapons (S.J.Res 21) on 4 September 2013. If passed, the bill would allow the President to take direct action for up to 90 days; it specifically forbids putting \"boots on the ground.\"\nOn 3 November, Secretary of State John Kerry said in Cairo that a handover of power by Syrian President Assad \"can give the people of Syria the opportunity to choose their future\".\n2014\nIn January Obama said that the United States must work with those who have been financing the opposition to make sure no extremist groups emerge from Syria the same way the Taliban came out of Afghanistan.\nOn 2 October American Vice President Joe Biden said that \"[The Turks ... the Saudis, the Emiratis] poured hundreds of millions of dollars and thousands of tons of weapons into anyone who would fight against Assad — except that the people who were being supplied were al-Nusra and al-Qaida and the extremist elements of jihadis coming from other parts of the world\", and also said that Turkish President Erdogan had admitted to him that Turkey had by mistake allowed foreign fighters to cross into Syria. Erdogan denied that, and demanded Biden's apologies, which Biden conceded on 4 October: Biden phoned with Erdogan that day, and a White House spokesman said that Biden hadn't meant to imply that Turkey had intentionally supplied or facilitated ISIL or any extremist group in Syria.\nUnited Kingdom\nOn 24 March 2011, Foreign Secretary William Hague said: \"We call on the government of Syria to respect their people's right to peaceful protest, and to take action about their legitimate grievances.\" On 10 August, after Syrian Ambassador to the United Nations Bashar Jaafari compared the protests in Syria to the actions of rioters in England, British Permanent Representative to the United Nations Mark Lyall Grant ridiculed the comparison, saying, \"In the United Kingdom, you have a situation where the government is taking measured, proportionate, legal, transparent steps to ensure the rule of law for its citizens. In Syria, you have a situation where thousands of unarmed civilians are being attacked and many of them killed.\" Cameron, together with French Sarkozy and Merkel, demanded Assad step down in an 18 August 2011 joint statement, which also condemned the crackdown and called for an end to violence.\nIn a press conference on 18 June 2013, the British Prime Minister Cameron said it would be \"unthinkable\" for Bashar al-Assad to be part of any future government in Syria.\nOn 29 August 2013, the British parliament refused to support the British government's plan to participate in military strikes against the Syrian government in the wake of a chemical-weapons attack at Ghouta.\nIn January 2014, 16 people were arrested in a crackdown on Britons travelling to or from Syria or Middle Eastern training camps for fighters. Police stated \"Our biggest concern is people attending terrorist training camps or fighting in war zones then returning to the UK as terrorists.\"\nA–C\nAbkhazia\nThe government of Abkhazia supports Syria in its \"war on terrorism\". In 2015, the Abkhaz Foreign Minister met Syrian Ambassador to Russia, Riyad Haddad, in Moscow and afterwards said that his government believes Syria will recognize the former Georgian republic of Abkhazia's independence as a sovereign country in the future. In November 2016, President of Abkhazia Raul Khajimba stressed his country's support to Syria in its \"war against international terrorism\". On the same occasion, Khajimba called Syria a \"sisterly country\". Nonetheless, Abkhazia supports the re-migration of Syrian citizens of Abkhaz descent back into Abkhazia. In the first five years of the Civil War, about 500 Syrians remigrated to Abkhazia. In December 2015, the Foreign Minister of Abkhazia met with Ambassador Extraordinary and Plenipotentiary of the Syrian Arab Republic in Russia Riyad Haddad and they discussed the remigration of Syrian citizens of Abkhaz descent. In 2017, Abkhazia send humanitarian aid to Syria. In 2018, Syria recognised the independence of Abkhazia.\nAlbania\nDuring a meeting with the new ambassador of Qatar in Albania, Prime Minister Sali Berisha said: \"The government of Albania is following with concern the events in Syria where the government of Bashar al-Assad is using its power as a permit to kill the innocent civilians and the Syrian people.\" The Ministry of Foreign Affairs on 18 February 2012 strongly condemned the violence. The Ministry of Foreign Affairs supported the conclusions of the 27 February meeting of the European Union, as well as the European Union sanctions. During the meeting on 1 April 2012, Friends of Syria in Istanbul the Minister of foreign Affairs of the Republic of Albania, Edmond Haxhinasto said that the issue of human rights is a responsibility of the international community. He expressed the need to intensify the pressure against the current government of Damascus not just politically, but also through a concentrated action of all international mechanisms. Haxhinasto stressed the position of the Albanian Government to support the efforts of the UN, the EU, the Arab League and other international bodies in putting an end to the violence towards the civilian population from the Damascus government, and establishing the conditions for a democratic process. He praised the Mission of the UN Special Envoy, Mr. Kofi Annan and his plan to stop the bloodshed and violence, achieve national reconciliation and establish a democratic government in Syria. In conclusion, Minister Haxhinasto underlined the support of the Albanian Government for the Syrian democratic opposition represented by the Syrian National Council, as well as its war for freedom, human dignity and progress.\nAlgeria\nOn November 23, 2011, the Algerian Foreign Ministry spokesman Amar Bellani, said his country urged Damascus \"to sign the protocol on sending Arab observers to Syria to avoid the internationalization of the crisis,\" referring to a possible initiative from countries outside the Arab world, in a statement broadcast by the agency APS.\nIn March 2020 Algeria, due to host a summit of the Arab League, stated that the event must herald a return of Syria to the organization, asserting that Syria's expulsion from the League was \"a historical mistake committed in one of the worst stages of the Arab collapse.\"\nArmenia\nEstimations of Armenians living in Syria before the war were up to 100,000, majority of them in Aleppo. In 2014 the Armenian government stated that they would not interfere in the Syrian civil war and maintained a neutral stance. Jihadist groups taking over Syrian locations, through Turkey, with Armenian civilians has concerned the government. Armenia in 2012 and in 2016 sent humanitarian aid for the Syrian government. Armenian government showed support for Russia when attack plane was shot down.\nIn February 2019 Armenia sent a non-combat mission to Syria as part of the Russian mission. It includes 83 mine-clearing sappers, medical personnel, and security officers.\nAustralia\nOn 25 March 2011, Foreign Minister Kevin Rudd said: \"We are deeply skeptical about the official explanations as to what has happened with the various killings which have occurred in Daraa ... and we call directly on the Syrian Government to exercise restraint in their response to peaceful protest seeking democratic change.\" Rudd said on 1 June that Assad and leading members of his government should be referred to the International Criminal Court and tried for \"brutal\" crimes against the Syrian people. The Reserve Bank of Australia strengthened economic sanctions against Syria on 3 August, adding intelligence and security officials to its banned list and freezing the assets of several companies.\nAustria\nAt a meeting of European Union foreign ministers on 18 July, Austrian Foreign Minister Michael Spindelegger recommended that the EU engage the Syrian government \"in a stern tone\" to put pressure on the government. Spindelegger condemned the Syrian government over its crackdown in early August, saying on 9 August that \"violence in Syria must come to an end\" and adding, \"Those responsible for ordering the use of brute force and those who apply it will be called to account for their actions.\" He said Ramadan offered a good opportunity for Syrian authorities to disavow the use of violence and enter into a dialogue, warning that \"dialogue and violence are mutually exclusive\".\nBahrain\nOn 8 August, following Saudi Arabia's decision to recall its ambassador, Bahraini Foreign Minister Khalid bin Ahmed Al Khalifa announced that the Gulf archipelago state would recall its own ambassador. Sunni sheikh Adel al-Hamad said that his son Abdulrahman was killed while fighting in Syria and that he had \"hoped to fall as a martyr.\" He added: \"He visited Syria once, then he returned to Bahrain where he prepared for his fighting gear and returned to Syria.\" In response, Interior Minister Rashid bin Abdullah al-Khalifa said that support should be given from the international community and that individuals should not be indoctrinated and radicalised.\nBelarus\nPresident Alexander Lukashenko has expressed confidence that Syria will eliminate the current crisis and continue under the leadership of President al-Assad \"the fight against terrorism and foreign interference in its internal affairs\". In 2018, Belarus send humanitarian aid to Syria.\nBotswana\nOn 11 May, the Foreign Affairs Ministry issued a statement calling the violence \"appalling\" and stated that the UN should act immediately to halt the government crackdown.\nBrazil\nOn 26 July 2012, Ambassador to the UN Maria Luiza Viotti expressed \"concern\". Viotti expressed Brazil's worries about escalation and chemical weapons. She proposed that Syria pursue a peaceful Government transition via dialogue between Syrian Government officials and the opposition. At last, Viotti said that Brazil was against any kind of external military intervention.\nCanada\nOn 21 March, Foreign Affairs Minister Lawrence Cannon said: \"Canada deplores the multiple deaths and injuries following protests in several Syrian cities over the weekend.\" On 24 April, Foreign Affairs advised Canadians not to travel to Syria, and for those in Syria to consider leaving by commercial means while these were still available. Prime Minister Stephen Harper called for Assad to leave power on 18 August, saying, \"The Assad regime has lost all legitimacy by killing its own people to stay in power.\" On November 28, 2012, Canada imposed further sanctions against Syria under the Special Economic Measures Act. The measures expanded Canada's targeted sanctions against the Syrian government and those that provide it with support.\nCroatia\nOn 23 February 2012, Prime Minister Zoran Milanović called on Croatian companies to withdraw from Syria due to the violence, following the example of INA Industria Nafte d.d., the Croatian state oil company. Deputy Prime Minister Radimir Čačić said INA's decision to halt operations in Syria brought Croatia in line with EU sanctions against doing business in the country. Syrian Oil Minister Sufian al-Alao accused INA for incorrectness towards Syrian people and stated that withdrawal of INA from Syria was a nod to the European Union, since Croatia was not an EU member. Al-Alao also confirmed that INA's return to Syria was impossible. On 1 April 2012 Croatian Foreign Minister Vesna Pusić attended the summit of the \"Friends of Syria\" in Istanbul.\nCzech Republic\nThe Ministry of Foreign Affairs published a statement on 8 August condemning the expulsion of journalists and violation of human rights. The statement began: \"The Czech Republic condemns the brutal attacks of the Syrian regime against demonstrations in Hama that have resulted in numerous casualties among civilians. The Syrian leadership bears a full responsibility for the violence against unarmed civilians.\"\nE–J\nEgypt\nThe government broke its silence on 9 August 2011, when Egyptian Foreign Minister Mohamed Kamel Amr asserted that \"reforms that are soaked in the blood of the martyrs who are dying daily are of no use\" in a criticism of the Syrian government's simultaneous promises of political concessions and use of force to suppress protesters. Amr said he feared the situation in Syria was \"heading to the point of no return\" and demanded an \"immediate end to shootings\". He called upon Syrian authorities and citizens to come together in a national dialogue.\nOn 15 June 2013, President Mohamed Morsi said he had cut all diplomatic ties with Syria and warned Hezbollah to pull back its fighters. \"We stand against Hezbollah in its aggression against the Syrian people. Hezbollah must leave Syria — these are serious words. There is no space or place for Hezbollah in Syria.\"\nAfter the military overthrow of Egyptian president Mohamed Morsi in 2013, the new Egyptian government, led by Abdel Fattah el-Sisi, expressed support for the Syrian government, stating: \"Our priority is to support national armies... with Syria and Iraq\". Foreign Minister Sameh Shoukry said Russian military intervention in Syria will prevent spread of terrorism. Egypt also renewed its diplomatic relations with Syria. This contrast and sudden change in Egyptian position towards the Syrian civil war can be attributed to warming relations between Russia – a Syrian ally – and Egypt. Russian president Vladimir Putin was one of the first world leaders to endorse Sisi's bid for the Egyptian Presidency, at a time when long-time Egyptian ally the United States was condemning the military coup and freezing military aid to Egypt.\nEstonia\nForeign Affairs Minister Urmas Paet said on 18 July that \"Estonia condemns the attacks on embassies in Damascus and will support the expansion of barricading measures if necessary\". Paet iterated Estonia's demands that the Syrian government renounce the use of force and commit to political reforms \"that would take into consideration the demands of the Syrian people for a peaceful, actual, and irreversible transition to a free society\".\nFinland\nOn 18 July, Foreign Minister Erkki Tuomioja said that in order to govern, President Assad \"should have at least a democratic mandate, which he is lacking today\".\nFrance\nThe Foreign Ministry condemned the violence carried out against demonstrators and called for political prisoners to be freed. On 23 March 2011, French foreign ministry spokesman Bernard Valero called on Syria to carry out immediate political reforms. In a joint statement co-signed by British prime minister David Cameron and German chancellor Angela Merkel, President Nicolas Sarkozy called for Assad to step down on 18 August 2011, citing his government's repeated failures to institute reforms or stop the violence. \"We call on him to face the reality of the complete rejection of his regime by the Syrian people and to step aside in the best interests of Syria and the unity of its people\", the statement read in part. François Hollande, elected 24th President of France on 15 May 2012, said on 20 August 2012 that no political solution in Syria was possible unless Assad steps down.\nIn July 2018, France dispatched 50 tons of humanitarian aid aboard a Russian Antonov 124 cargo plane, destined for civilians wounded in the 2018 East Ghouta offensive. It was the first joint Franco-Russian humanitarian effort.\nGabon\nGabon, which held the rotating presidency of the Security Council as of June 2011, said it would support a draft resolution condemning the Syrian government.\nGermany\nOn 24 March 2011, Foreign Minister Guido Westerwelle said: \"The violence must end immediately. The Syrian government must make sure that basic human and civil rights, as well as the rule of law, is observed,\" In early August 2011, after the siege of Hama, the chairman of the German government's committee on foreign relations advocated a global boycott of Syrian gas and oil exports. On the same day a German government spokesman declared that if Assad continued to reject dialogue and resort to violence, the Syrian government would lose its legitimacy. On 15 August 2011, a German Foreign Ministry spokesman said Berlin wanted stronger sanctions against Syria after hearing reports that Syrian gunboats strafed coastal neighborhoods in Latakia. On 18 August 2011, in a joint statement with the leaders of France and the United Kingdom, Merkel called on Assad to surrender power immediately and condemned \"this bloody repression of peaceful and courageous demonstrators and the massive violations of human rights which President Assad and his authorities have been committing for months\".\nOn 7 February 2012, Berlin Police arrested alleged members of Syrian intelligence on suspicion of monitoring Syrian opposition members living in Germany. Foreign Minister Westerwelle insisted that Germany would not tolerate such activities on German soil. Two days later, four members of the Syrian embassy were expelled on grounds of alleged espionage.\nGreece\nOn 24 March 2011, Foreign Minister Dimitrios Droutsas said, \"The use of violence to repress protests that has led to the murder of citizens is absolutely condemned. We call on the government of Syria to guarantee the fundamental rights of its citizens\".\nIn May 2020, the Greek ministry of foreign affairs announced it would appoint a Special Envoy for Syria, viewed as a step towards full normalisation with the Syrian government under Bashar al-Assad.\nHoly See\nPope Benedict XVI called on Syrian authorities on 7 August 2012 to recognise the \"legitimate aspirations\" of the Syrian people. \"I am following with deep concern the dramatic and increasing episodes of violence in Syria that have led to numerous victims and grave suffering.\" On 9 September the Pope called for dialogue and reconciliation to solve crises. The Pope stated that \"the commitment to dialogue and reconciliation must be the priority for all parties involved.\" In his first Urbi et Orbi Christmas message, Pope Francis called for peace in Syria.\nIndia\nDespite pressure from the Syrian government to reject any statement critical of the Syrian government, Indian Permanent UN Representative Hardeep Puri read the 3 August statement agreed to by the Security Council condemning Syrian authorities' use of force and \"widespread violations of human rights\". Moreover, India abstained from voting against the violence committed by the Syrian government.\nIn June 2012, Prime Minister Manmohan Singh, called for immediate ceasefire. India had voted the US-backed resolution at United Nations Human Rights Council condemning the massacre at El-Houla.\nIndonesia\nA Foreign Ministry spokesman said on 1 August, \"The use of force will never solve problems. ... We hope all related parties in Syria will be able to solve their problems by peaceful means to reach the best possible solution for the people of Syria.\"\nItaly\nThe Foreign Ministry recalled its Syrian on 2 August 2011 and urged other EU member states to do likewise. It condemned the Syrian government's \"horrible repression against the civilian population\". In December 2011 Minister Giulio Terzi di Sant'Agata met with Syrian opposition leader Burhan Ghalioun and advocated tougher sanctions against the Assad government.\nJapan\nA statement by Japanese Minister for Foreign Affairs Takeaki Matsumoto published on 24 April 2011 condemned the Syrian government's use of force and noted the rising numbers of casualties and fatalities in Syria. The statement said additional reforms beyond the government's lifting of the emergency law were urgently required and called for a stop to the violence.\nJordan\nThe Foreign Ministry called for dialogue to end the crisis, saying, \"What is happening in Syria now is worrisome, unfortunate and sad. We hope that dialogue is restored and reforms are achieved in order to get Syria out of this impasse. \" However, Jordan also insisted that it would not interfere in Syria's internal affairs. On 13 August 2011, a spokesman for the government said Amman's \"concern was growing\" and added, \"The government has voiced and still voices regret over the increasing number of victims and calls for sparing the lives of the brotherly Syrian people.\" Prime Minister Marouf al-Bakhit said, on 15 August 2011, that the crackdown must end and serious reforms should be implemented soon. On 18 August 2011, Foreign Minister Nasser Judeh said Jordan was \"angered\" and \"extremely worried\" by the situation in Syria and the actions of Assad's security forces. A Jordanian army captain was reported to have deserted and joined the Al-Nusra Front's campaign against the government.\nBy May 2014, Reports had surfaced that Jordanian officials may be co-ordinating with the Syrian government to keep rebel jihadists at bay from its border.\nOn 19 November 2018, a Jordanian parliamentary delegation met President Assad in Damascus. According to Syrian state media, the Jordanians expressed that \"the pulse of the Jordanian street has always been with the Syrian people in the face of the terrorist war,\" and that \"Syria is the first line of defense for the entire Arab region.\"\nOn 7 March 2020 the Jordanian minister of industry and trade, Tariq Al-Hamwi, met his Syrian counterpart, Mohammad Samer Al-Khalil, in Damascus to discuss normalizing trade relations and to resume cooperation in agriculture, transport and water resources.\nK–P\nKazakhstan\nA spokesman for the Ministry of Foreign Affairs of Kazakhstan said on 23 August that it believed the Syrian government and opposition should hold a national dialogue. He offered the government's support for OIC mediation in the dispute.\nKosovo\nThe Ministry of Foreign Affairs of the Republic of Kosovo issued the following statement on 23 August 2011: \"The government and the people of Kosovo support the efforts of the Syrian people as they strive towards freedom and democracy....President Assad has lost the right to govern the country.\"\nKuwait\nA statement on 5 August from the Foreign Ministry called on the Syrian government to institute \"true reforms that meet the legitimate demands of the Syrian people away from the security actions\" and expressed \"extreme pain for the continued bloodshed\". Kuwait's criticism marked the first statement by an Arab government in opposition to the policies of the Assad administration. Kuwait withdrew its ambassador from Syria on 8 August \"for consultations\".\nLibya\nOn 19 October 2011 Libya's interim government, following the Libyan Civil War, the National Transitional Council became the first government to express \"its full recognition of the Syrian National Council as the legitimate ruler of Syria\"\nMaldives\nForeign Minister Ahmed Naseem said on 9 August: \"The indiscriminate killing of innocent Muslim men, women and children by the Syrian state security forces, especially during the holy month of Ramadan, is completely unacceptable to the Maldives.\" Naseem demanded the Syrian government discontinue the use of violence and immediately move toward democracy and comply with international human rights standards. Naseem also expressly voiced support for recent condemnations by the Arab League, the Gulf Cooperation Council, Saudi Arabia and Turkey.\nMalta\nIn the early days of the protests in 2011, the Foreign Affairs Ministry deplored \"widespread violations\" of human rights and that the Syrian government \"must take\" steps to curb the violence. It backed the EU's calls for fundamental freedoms to be granted. Alternattiva Demokratika's spokesman Arnold Cassola, said the world had witnessed in Syria \"brutality for far too long now in perfect impotence.\"\nMauritania\nPrime Minister Moulaye Ould Mohamed Laghdaf visited Damascus in late June bearing a letter of support for al-Assad from his Mauritanian counterpart, President Mohamed Ould Abdel Aziz. The Mauritanian political opposition, the Rally of Democratic Forces, excoriated the government for \"supporting dictatorship, repression and peoples' oppression\" and sharply condemned the visit.\nMexico\nThe Secretariat of Foreign Affairs condemned the violent events and called on Syrian authorities to refrain from the use of force and facilitate political dialogue. Yanerit Morgan, the Representative of Mexico to the United Nations, urged the United Nations to not act \"passively and indifferently\".\nMorocco\nThe Foreign Ministry issued a statement on 10 August noting its traditional tendency not to comment on the \"internal affairs of other countries\" but expressing \"its strong worries and deep concern over the sad events rocking Syria\". The statement called for an \"inclusive\" dialogue to solve the problems the country faces.\nNew Zealand\nThe Parliament on 3 August unanimously passed a resolution sponsored by Green Party MP Keith Locke condemning \"the shooting of peaceful demonstrators in Hama and other Syrian cities\" and urging the Syrian government to begin a national dialogue to take steps toward a democratic transition.\nNetherlands\nIn December 2012, the Dutch government together with Germany, Belgium and Luxembourg acknowledged the Syrian National Coalition as the legitimate representative of the Syrian people. The Dutch Foreign Minister, Timmermans, called the SNC \"a very serious club\" that can turn out to be \"very determining for the future of Syria\".\nNicaragua\nPresident Daniel Ortega said he \"want[ed] to congratulate him on his resounding victory in the 2014 Syrian presidential election on Tuesday June 3. Their victory, brother President Bashar represents a reaffirmation of the commitment to peace and spirit of the Syrian people, has defended you with chivalry.\"\nNorway\nOn 24 March, Minister of Foreign Affairs Jonas Gahr Støre condemned the violence, saying: \"Norway urges the authorities of Syria not to use violence against peaceful protesters, to respect the freedom of speech and assembly, and to enter into a dialogue with the people about their legitimate demands\".\nPalestine\nFatah Foreign Minister Riyad Al-Maliki called military operations in Latakia \"very worrisome\" on 15 August 2011 amid UNRWA reported that thousands of Palestinians had been forced to flee from a major refugee camp on the outskirts of the Syrian city. A spokesman for President Mahmoud Abbas demanded that the Syrian government protect the Palestinians. In 2011, a Hamas spokesman said he was unaware of the reports and denied that the uprising had affected Hamas' position in Syria or elsewhere. Later however, Hamas's Prime minister in Gaza Ismail Haniyeh voiced support for the Syrian opposition, though Salah al-Bardaweel added that this did not mean severance of ties with the government. Bardaweel's claims are at odds with repeated leaks by his group showing that they were prepared to evacuate Syria and had already reduced their presence there. The PFLP (including Leila Khaled) have expressed support for Bashar al-Assad and the Syrian Arab Army in a video by their armed wing, the Abu Ali Mustafa Brigade.\nPanama\nOn 30 May 2012, the Ministry of Foreign Affairs announced the decision to \"suspend temporarily\" the diplomatic relations with Syria.\nPhilippines\nA spokesman for President Benigno Aquino III asked for a \"peaceful resolution of the situation in Syria\" on 15 August 2011.\nPoland\nIn mid-August 2011, the Polish delegation to the United Nations drafted and circulated a proposed resolution calling for a second investigation into the uprising and crackdown focusing on events on and after 15 July.\nOn 28 August 2018, a Polish delegation led by Deputy Foreign Minister Andrzej Papierz visited Damascus to discuss Polish support for Syrian refugee repatriation projects. It was the first high-level Polish delegation to Syria since 2011.\nPortugal\nThe Portuguese UN delegation collaborated with the United States, France, Germany and the United Kingdom to draft a resolution condemning the Syrian government.\nQ–Y\nQatar\nOn 3 April 2011, Emir Sheikh Hamad bin Khalifa Al Thani sent a letter to Syrian President al-Assad voicing Qatar's support for Syria amid \"attempts at destabilisation\". After pro-government protesters incensed over Al-Jazeera's coverage vandalised the Qatari embassy in Damascus, pelting it with eggs, rocks and vegetables, Qatar suspended its diplomatic operations in Syria starting 17 July.\nOn 24 August, Qatar's representative to the United Nations strongly criticised the crackdown, expressing grief at the number of casualties and urging Syrian authorities to protect civilians instead of using violence against them. He also suggested that the Syrian government may have violated international human rights laws. While visiting Iran on 26 August, the emir described the protest movement in Syria as \"a real civil uprising to demand change, justice and freedom\" and suggested the international community should help Syrian authorities to abandon the crackdown and adopt major reforms. He said Arab troops should be sent into Syria \"to stop the killing\", the first world leader to publicly make such a suggestion.\nRomania\nOn 28 February 2012, President Traian Băsescu, remarked that \"when the armed forces of the state fire on their own people, there is no way to maintain the power of the chief of state\", adding that Romania supported the EU position and sanctions. On 22 March, Romania withdrew auxiliary personnel and family members from its embassy in Damascus.\nOn 31 May, Minister of Foreign Affairs Andrei Marga recommended freezing diplomatic relations with Syria and expulsion of the Syrian ambassador in Bucharest as a reaction to the \"intolerable events\" at Houla. However, President Băsescu refrained from acting on the recommendation, and instead approved the ratification of two extradition treaties with the Syrian government which he deemed necessary for bringing convicted businessman Omar Hayssam to Romania. Both Marga and Băsescu noted that breaking off diplomatic relations entails risks for Romanian citizens in Syria, who formed the largest European community in the country.\nSaudi Arabia\nSaudi Arabia's King Abdullah became the first Arab head of state to openly condemn the Syrian government over its response to the uprising on 8 August 2011, saying, \"What is happening in Syria is not acceptable for Saudi Arabia.\" He warned Syria \"will be pulled down into the depths of turmoil and loss\" if it did not immediately move to enact major political reforms and withdrew the country's ambassador to Syria. Despite originally wanting to stay out of Syria's affairs Abdullah later called on the government to stop its \"killing machine\".\nIn March 2014 Saudi Arabia designated the Al-Nusra Front and the Islamic State of Iraq and the Levant as terrorist organisations and gave its citizens fighting in Syria 15 days to return to Saudi Arabia or face imprisonment.\nIn May 2021 General Khalid bin Ali Al Humaidan, head of the Saudi General Intelligence Directorate, travelled to Damascus to meet with his Syrian counterpart General Ali Mamlouk, a move interpreted as a sign of normalization between the two countries.\nSouth Africa\nThough the South African government issued a statement condemning the violence in Syria, South African newspaper Mail & Guardian reported that anonymous sources at the UN had told them that the South African representative on the Security Council had received instructions to attempt to block a possible resolution inveighing against the government's response to the uprising.\nPresident Jacob Zuma congratulated Bashar al-Assad on winning the 2014 Syrian presidential election. He voiced hope that the Syrian people and government will overcome the crisis affecting their country, affirming South Africa's readiness to help in this regard.\\\nSpain\nMinister of Foreign Affairs Trinidad Jiménez expressed \"deep concern\" and her government's \"resounding condemnation of the violence being used by the Syrian regime against its own people\" on 8 August 2011.\nSudan\nOn 6 April 2011, President Omar al-Bashir called al-Assad to voice his support for the government against \"the attempts aimed at destabilising it.\"\nOn 16 December 2018, President al-Bashir paid a bilateral visit to Damascus, the first Arab head of state to do so since the outbreak of the war.\nSweden\nForeign Minister Carl Bildt said that the Syrian government \"has run its course\" and \"has to give way to a new regime\" at a meeting of European Union foreign ministers on 18 July 2011.\nSwitzerland\nOn 18 August 2011, the Federal Department of Foreign Affairs stated, \"The actions of the Syrian security forces are not acceptable.\" The statement also declared that Switzerland was recalling its ambassador.\nTunisia\nOn 11 August 2011, following the Tunisian revolution, state-run media quoted the Ministry of Foreign Affairs as urging the Syrian government to \"immediately cease hostilities and engage in an effective dialogue\". Tunis recalled its ambassador on 17 August, citing the \"dangerous situation\".\nOn 31 July 2017, a delegation of the Tunisian General Labour Union (UGTT) met President Bashar al-Assad with a view to re-establishing relations between the two countries and combating terrorism. UGTT Deputy Secretary-General stated: \"Tunisia will always be by Syria's side to support it in its war against terrorism until it is defeated.\"\nIn January 2019, Tunisia's foreign minister called for Syria's readmission into the Arab League.\nUnited Arab Emirates\nOn 29 March 2011, United Arab Emirates President Sheikh Khalifa bin Zayed Al Nahyan called Syrian president Bashar al-Assad and reaffirmed that the UAE stands by Damascus.\nOn 25 September 2013, Foreign minister Abdullah bin Zayed Al Nahyan said that UAE continued to support the Syrians and their legitimate aspirations for restoring security and stability to the country.\nOn 6 June 2018, Minister of State for Foreign Affairs Anwar Gargash stated that the Syrian civil war had been \"a failure of diplomacy by the international community and the Arab world,\" and that the expulsion of Syria from the Arab League had been \"a mistake.\"\nmeeting the National Coalition for Syrian Revolutionary and Opposition Forces on 5 September 2013]]\nIn December 2018, the UAE re-opened its embassy in Damascus.\nIn November 2021 Emirati foreign minister Abdalla bin Zayed visited his Syrian counterpart in Damascus and discussed bilateral and economic cooperation with President Assad.\nYemen\nYemen distanced itself from the crisis, due to the ongoing uprising inside the country against President Ali Abdullah Saleh. The Yemeni government, in a statement, urged \"all Syrian forces to refrain from actions that provoke further violence and stressed the importance of holding an open dialogue\". Yemen condemned attacks on the embassies of Qatar, Saudi Arabia and the United Arab Emirates in Damascus.\nNon-state organisations\nPolitical\nHouthis\nThe Houthis have urged their supporters in northern Yemen to support the Syrian government. A defecting Syrian air-force brigadier alleged that the Houthis supplied 200 fighters to participate in the Siege of Maarat al-Numaan and the Jisr al-Shughur operation. Many Houthis were reported to be fighting on the side of the government.\nHizb ut-Tahrir\nSunni Islamist group Hizb ut-Tahrir voiced support for the Syrian opposition and jihadist.\nApolitical NGOs\nAvaaz\nAvaaz helped to coordinate the entry of 34 international journalists into Syrian war zones, including photographer Rémi Ochlik and journalist Marie Colvin, who both died during the siege of Homs and reporter Edith Bouvier, who was badly hurt. To help evacuate photographer Paul Conroy from the city of Homs on 28 February, the group co-ordinated an operation by Syrian activists and also evacuated 40 seriously wounded people from Baba Amr and brought in medical supplies. Avaaz set up a network of about 200 activists to provide video footage, which has been used by the international media.\nAmnesty International\nAI condemned the \"violent crackdown\", against \"a peaceful protest\" by people calling for the release of political prisoners. On 6 July 2011, a spokesman for the group claimed it had proof that the Syrian government committed crimes against humanity in the northern town of Tel Kalakh.\nInternational Committee of the Red Cross\nICRC on 21 January 2012, urged Syrian authorities and all others involved in the violence to implement a daily cessation of fighting to allow delivery of humanitarian assistance. ICRC also appealed to all parties to the conflict to distinguish at all times between civilians and those participating in the hostilities and to fully respect international humanitarian law. On 3 September 2012, ICRC president Peter Maurer went to Syria for a three-day mission with the aim of scaling up ICRC and Syrian Arab Red Crescent humanitarian actions.\nHuman Rights Watch\nHRW stated that the Syrian government has shown \"no qualms about shooting dead its own citizens for speaking out.\" They say the government's actions \"could qualify as crimes against humanity\".  Sarah Leah Whitson, director of HRW's Middle East and North Africa division, said that Syria, before the civil war, \"was such a moribund place, we couldn't generate news…The reality is, for us to report we needed to be documenting active measures of repression or active measures of abuse.\"\nFree Syria Community in Romania\nIn July 2011, a non-profit organisation known as the \"Free Syria Community in Romania\" was founded, with the stated aim to preserve the identity, culture and cultural heritage and defend the rights of Syrians residing in Romania. Since the beginning of the uprising, the FSCR permanently organised movements with medical aid and food in refugee camps on the Turkish-Syrian border.\nBusiness\nGulfsands Petroleum\nGulfsands Petroleum, a London-traded energy firm with major oil contracts in Syria, has not commented directly on the uprising but discontinued payments to and suspended the voting rights of major shareholder Rami Makhlouf, a Syrian government official targeted by EU and United States sanctions, effective 24 August 2011. \"Gulfsands is fully compliant with all applicable sanctions and is committed to continuing compliance with any sanctions that may apply from time to time\", a press release on the corporation's website read in part. The statement also denied any wrongdoing and said Gulfsands' relationship with Makhlouf was \"constructive\" and \"conducted with propriety and in accordance with pertinent laws and regulations\". On 26 August 2011, Gulfsands said it intended to continue oil drilling in Syria. On 5 December 2011, following a new round of EU sanctions, Gulfsands announced that it would review its operations in Syria. On 12 December 2011, the company invoked force majeure and announced an immediate suspension of its production in Syria.\nIndustria Nafte\nINA – Industria Nafte, the Croatian national oil company, and a division of the Hungarian Mol Nyrt. Group saw its profits in Syria dry up starting in November 2011 as violence increased, according to CEO Zoltán Áldott. In February 2012, Croatian Deputy Prime Minister Radimir Čačić announced that after consultations with the Milanović government, INA had decided to halt its operations in Syria altogether. Čačić said the move would cost \"hundreds of millions of euros\" in losses to INA.\nKulczyk Oil Ventures\nKulczyk Oil Ventures, a Canadian subsidiary of Luxembourg-based Kulczyk Investments, suspended Syrian drilling operations. In late November 2011, Syrian authorities granted the company an extension of its exploration license despite the suspension.\nRoyal Dutch Shell\nRoyal Dutch Shell, which provides about 17 percent of Syria's petrol, condemned the crackdown in August: \"We continue to monitor the situation in Syria closely. We condemn any violence and the human rights abuses it represents and we have deep concern over the loss of life. We comply with all applicable laws, including international sanctions.\" On 2 December 2011, the company announced it was suspending Syrian operations. A spokesman said, \"We hope the situation improves quickly for all Syrians.\"\nSerena Hotels\nSerena Hotels, a Kenya-based chain of luxury hotels that specialises in Africa and Western Asia, vowed to honour a deal with the Syrian government, inked in 2008, to build properties in Aleppo and Damascus. Renovations and construction in Syria, some of which started after the uprising began, continued.\nSuncor Energy\nSuncor Energy, a Canadian firm with a natural gas operation in Syria worth $1.2 billion as of August 2011, said on 18 August 2011 that it would comply with Canadian and United States economic sanctions. On 11 December 2011, Suncor CEO Rick George declared force majeure and said the company had suspended Syrian operations. \"The current situation in Syria is very concerning\", said George, who said Suncor had determined it fell under European Union sanctions because its subsidiaries working in Syria were based in the Netherlands. According to Canadian Foreign Affairs Minister John Baird, the shutdown of Suncor's Elba natural gas plant in Homs was expected to cut off electricity to \"hundreds of thousands\" of Syrian homes.\nTotal S.A.\nTotal S.A., a French energy company with stakes in Syrian oilfields and gasfields, announced on 6 December 2011, \"We have informed the Syrian authorities of our decision to stop operations with General Petroleum Corporation to conform to the [EU] sanctions.\"\nIndividuals\n, Cairo, Egypt]]\nEgyptian Islamic theologian Yusuf al-Qaradawi declared his support for the uprising against what he called Syria's \"suppressive regime\", saying that it commits \"atrocities\". He called for victory against the ruling Ba'ath Party, and opined that the army would be the major factor in the revolt. Al-Qaradawi said all Arabs should support the uprising, saying \"Today the train of revolution has reached a station that it had to reach: The Syria station\", and \"It is not possible for Syria to be separated from the history of the Arab community\". The Muslim Brotherhood, with which al-Qaradawi has been involved,Dreyfuss, Robert. [https://books.google.com/books?id=hdfLNSnUx-AC&pg=PA166 ''Devil's Game: How the United States Helped Unleash Radical Islam]. Pg. 166Shavit, Uriya. [https://books.google.com/books?id=f1sNM9-1hCIC&pg=PA106 The new imagined community: global media and the construction of national and Muslim identities of migrants''] Pg. 106. assisted in the uprising, with Islamic clergy calling on Sunnis to pour onto the streets throughout Syria and expel the government.\nIn early June 2011, Armenian professor of Arab studies Araks Pashayan expressed concern that Syrian Armenians, who she said generally support the government's secular policies, could face reprisals from anti-government protesters if the crisis continued.\nFormer U.K. Prime Minister Tony Blair said on 9 June 2011 that \"change in Syria is essential\", although he warned of a power vacuum in the event of regime change. \"It is important we get to the point where the Syrian people are able to elect their government\", Blair said. He said he hoped Assad would make the necessary reforms, but acknowledged that the majority opinion among protesters in Syria was that Assad must leave power.\nThe mufti of Mount Lebanon Governorate in Lebanon, Sheikh Mohammad Ali Jouzou on 21 July 2011, said that the Syrian security apparatus was being turned \"against the struggling people\" and criticised government violence. He voiced support for Qatar's role in supporting the Arab Spring, including its withdrawal of its ambassador.\nMohamed Ahmed el-Tayeb, imam of al-Azhar, Cairo's oldest mosque, said the institution \"was patient for a long time and avoided talking about the situation in Syria because of its sensitive nature\", but by 8 August 2011, it had \"exceeded all limits\". He called for an end to the \"tragedy\".\nAfter a bloody crackdown across Syria, former Lebanese prime minister Saad Hariri publicly condemned the Syrian government. \"We in Lebanon cannot, under any circumstances, remain silent regarding the bloody developments taking place in Syria.\" He compared the violence in Hama to the 1982 Hama massacre and said the Arab world must speak out.\nPolitical analyst Karim Sader suggested Qatar's response was part of \"a shrewdly calculated divorce from the Syrian regime\". Qatar News Agency, the emirate's state-owned media outlet, was the first network in the Arab world to broadcast Arab League Secretary-General Naril Elaraby's 7 August statement criticizing the Syrian government over its military actions and calling for an end to the violence.\nIn 2012, tripartite president during the Bosnian War, Ejup Ganić, said that the same mistakes were being made in Syria. \"The world swallowed the pill in Bosnia, where it became normal to hit apartments people live in and to burn cities randomly. The international community allowed a crime against humanity in Bosnia. The same is happening in Syria. [The United States] should react [because it is] a superpower with human rights on the agenda. As this is the year of the United States presidential election, 2012, Unfortunately, there's a lack of leadership in the world when it comes to right versus wrong.\"\nAl Jazeeras Beirut-based reporter Ali Hashem resigned after his e-mails expressing frustration at the outlet's \"unprofessional\" and biased coverage of the Syrian civil war, which relegated the 2011–2012 Bahraini uprising to smaller stories despite more daily events including violence, deaths and judicial motions.\nAmerican politician Dick Black, contrary to his own country's official stance on Syria, sent a letter to Bashar al-Assad praising his conduct in the war, saying that the Syrian army deserved credit for a \"heroic rescue of Christians\", defending Jews in Syria, and \"exhibit[ing] extraordinary gallantry in the war against terrorists\".\nSolidarity protests\nOn 5 August 2012, in Australia, hundreds of demonstrators gathered in Sydney during a pro-government rally, chanting slogans in English and Arabic in support of President Bashar al-Assad and the Syrian Arab Army. The protesters blamed the media for distorting the situation in Syria and bias in favour of the opposition.\nDiplomatic Support and Opposition\nDiplomatic Support\n{| class=\"wikitable sortable\" style=\"width:100%\"\n|-\n! style=\"width:3%;\"|Rank\n! style=\"width:17%;\"|Entity\n! style=\"width:56%;\" class=\"unsortable\"|Notes\n|-\n| 1 ||\n|  Abkhazia is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Aslan Bzhania.\n|-\n| 2 ||\n| Taliban and Syrian officials met for the first time to discuss cooperation in 2023.\n|-\n| 3 ||\n| Algeria is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Abdelmadjid Tebboune.\n|-\n| 4 ||\n| Armenia is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from Prime Minister Nikol Pashinyan and president Vahagn Khachaturyan.\n|-\n| 5 ||\n| Belarus is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Alexander Lukashenko.\n|-\n| 6 ||\n|\n|-\n| 7 ||\n|\n|-\n| 8 ||\n| China is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from General Secretary of the Chinese Communist Party Xi Jinping.\n|-\n| 9 ||\n|\n|-\n| 10 ||\n|\n|-\n| 11 ||\n| Cyprus re-established relations with the Syrian Arab Republic in 2020.\n|-\n| 12 ||\n| Relations with the Czech Republic remain positive and the Czech Republic was the only country in the European Union to keep its embassy open during the Syrian Civil War.\n|-\n| 13 ||\n| The Dominican Republic is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Luis Abinader.\n|-\n| 14 ||\n| Egypt–Syria relations, (Since 2013)\n|-\n| 15 ||\n|\n|-\n| 16 ||\n|\n|-\n| 17 ||\n| On May 8, 2020, the Greek Foreign Ministry Nikos Dendias announced a restoration of relations between Greece and Syria and assigned former ambassador to Syria and Russia, Tasia Athanassiou, as a Special Envoy of Greece's Foreign Ministry for Syria.\n|-\n| 18 ||\n| Hungary appointed ambassador to the Assad government in thawing of ties.\n|-\n| 19 ||\n| Indonesia is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Joko Widodo.\n|-\n| 20 ||\n| Iran has assisted the Assad government in the Syrian Civil War. iran is also considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Ebrahim Raisi.\n|-\n| 21 ||\n| Iraq has assisted the Assad government in the Syrian Civil War.\n|-\n| 22 ||\n| India is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Ram Nath Kovind.\n|-\n| 23 ||\n| Lebanon is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Michel Aoun.\n|-\n| 24 ||\n| Malaysia is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from Sultan Abdullah of Pahang, King of Malaysia.\n|-\n| 25 ||\n|\n|-\n| 26 ||\n| Mauritania is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Mohamed Ould Ghazouani.\n|-\n| 27 ||\n| Myanmar is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from Chairman of the State Administration Council of Myanmar Min Aung Hlaing.\n|-\n| 28 ||\n| Nicaragua is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Daniel Ortega.\n|-\n| 29 ||\n| North Korea is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from General Secretary of the Workers' Party of Korea Kim Jong-un.\n|-\n| 30 ||\n| Oman is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from Sultan Haitham bin Tariq.\n|-\n| 31 ||\n|\n|-\n| 32 ||\n| Palestine is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Mahmoud Abbas.\n|-\n| 33 ||\n| Russia has assisted the Assad government in the Syrian Civil War. russia is also considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Vladimir Putin.\n|-\n| 34 ||\n| Relations normalized in 2023\n|-\n| 35 ||\n| Syria has been a diplomatic ally to Serbia on the Kosovo question. On 13 May 2009, Syria's ambassador to Serbia, Majed Shadoud, reported that Syrian president Bashar al-Assad told Serbian Foreign Minister Vuk Jeremić that his country continues to oppose the recognition of the independence of Kosovo. Syria voted against Kosovo's admission to UNESCO in 2015.\n|-\n|36\n|\n|Somalia is considered to be a friendly country to the Syrian Arab Republic. On 15 June 2014, Somalia sent a congratulatory cable to Assad on winning the 2014 Syrian presidential election\n|-\n| 37 ||\n| South Africa is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from president Cyril Ramaphosa.\n|-\n| 38 ||\n| South Ossetia is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Anatoly Bibilov.\n|-\n| 39 ||\n| Sri Lanka is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Gotabaya Rajapaksa.\n|-\n| 40 ||\n| Tajikistan is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Emomali Rahmon.\n|-\n| 41||\n| Thailand is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from king Maha Vajiralongkorn.\n|-\n| 42||\n| Relations normalized in 2023\n|-\n| 43 ||\n| Turkmenistan is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from President Serdar Berdimuhamedow.\n|-\n| 44 ||\n| Relations restored in 2018.\n|-\n| 45 ||\n|\n|-\n|  46 ||\n| The Vatican City is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from Pope Francis.\n|-\n| 47 ||\n|\n|-\n| 48 ||\n| Vietnam is considered a friendly country to the Syrian Arab Republic. On 76th anniversary of Independence Day of Syria, Assad received a congratulations from president Nguyen Xuan Phuc.\n|-\n|  49 ||\n| Syria recognizes the Sahrawi Arab Democratic Republic.\n|-\n| 50 ||\n|\n|}\nDiplomatic Opposition\nThe following countries oppose the Assad Government diplomatically\n{| class=\"wikitable sortable\" style=\"width:100%\"\n|-\n! style=\"width:3%;\"|Rank\n! style=\"width:17%;\"|Entity\n! style=\"width:56%;\" class=\"unsortable\"|Notes\n|-\n| 1 ||\n|\n|-\n| 2 ||\n|\n|-\n| 3 ||\n|\n|-\n| 4 ||\n|\n|-\n| 5 ||\n|\n|-\n| 6 ||\n|\n|-\n| 7 ||\n|\n|-\n| 8 ||\n|\n|-\n| 9 ||\n|\n|-\n| 10 ||\n|\n|-\n| 11 ||\n|\n|-\n| 12 ||\n|\n|-\n| 13 ||\n|\n|-\n| 14 ||\n|\n|-\n| 15 ||\n|\n|-\n| 16 ||\n|\n|-\n| 17 ||\n|\n|-\n| 18 ||\n|\n|-\n| 19 ||\n| Relations were strong under President Rafael Correa. Relations deteriorated after Correa was ousted.\n|-\n| 20 ||\n|\n|-\n| 21 ||\n|\n|-\n| 22 ||\n|\n|-\n| 23 ||\n|\n|-\n| 24 ||\n|\n|-\n| 25 ||\n| Georgia severed all ties with the Syrian Arab Republic after the latter recognized Abkhazia and South Ossetia.\n|-\n| 26 ||\n|\n|-\n| 27 ||\n|\n|-\n| 28 ||\n|\n|-\n| 29 ||\n|\n|-\n| 30 ||\n|\n|-\n| 31 ||\n|\n|-\n| 32 ||\n|\n|-\n| 33 ||\n|\n|-\n| 34 ||\n| Syria fully supports Serbia's territorial integrity on Kosovo\n|-\n| 35 ||\n|\n|-\n| 36 ||\n| Kuwait opposes the re-admission of Syria into the Arab League.\n|-\n| 37 ||\n|\n|-\n| 38 ||\n|\n|-\n| 39 ||\n|\n|-\n| 40 ||\n|\n|-\n| 41 ||\n|\n|-\n| 42 ||\n|\n|-\n| 43 ||\n|\n|-\n| 44 ||\n|\n|-\n| 45 ||\n|\n|-\n| 46 ||\n|\n|-\n| 47 ||\n|\n|-\n| 48 ||\n|\n|-\n| 49 ||\n| Morocco opposes the re-admission of Syria into the Arab League.\n|-\n| 50 ||\n|\n|-\n| 51 ||\n|\n|-\n| 52 ||\n|\n|-\n| 53 ||\n|\n|-\n| 54 ||\n|\n|-\n| 55 ||\n|\n|-\n| 56 ||\n|\n|-\n| 57 ||\n|\n|-\n| 58 ||\n|\n|-\n| 59 ||\n|\n|-\n| 60 ||\n|\n|-\n| 61 ||\n| Doha remains committed to supporting Syrian rebels against the Assad government and remains one of the few Arab countries to openly oppose the regime.\n|-\n| 62 ||\n|\n|-\n| 63 ||\n|\n|-\n| 64 ||\n|\n|-\n| 65 ||\n|\n|-\n| 66 ||\n|\n|-\n| 67 ||\n|\n|-\n| 68 ||\n|\n|-\n| 69 ||\n|\n|-\n| 70 ||\n|\n|-\n| 71 ||\n|\n|-\n| 72 ||\n| Syria fully supports China's territorial integrity on taiwan\n|-\n| 73 ||\n|\n|-\n| 74 ||\n| Turkey rejects the Assad government.\n|-\n| 75 ||\n| Ukraine severed relations with syria after the latter's recognition of Donetsk People's Republic and Luhansk People's Republic.\n|-\n| 76 ||\n|\n|-\n| 77 ||\n|\n|-\n| 78 ||\n|\n|-\n| 79 ||\n|\n|-\n| 80 ||\n| Yemen opposes the re-admission of Syria into the Arab League.\n}}\nFurther reading\n*"
    }
  ]
}