{
  "content": [
    {
      "type": "text",
      "text": "# International media reaction to the 2008 United States presidential election\n\n, the first African-American U.S. president]]\nFollowing the 2008 United States presidential election, media around the world reacted in a variety of ways. Most expressed positive hopes and expectations for the president-elect, but some tried to prepare their readers for disappointment. Editorials varied from elation to cautious optimism, and a few were outright skeptical. Many celebrated Barack Obama's win as historic and a sign of changing race-relations in the United States. Many commentators said the election results surprised them because there was an international perception that America was too racist to elect a black president. Many also said people in their country were blinded by infatuation with Obama and encouraged them to see him as a normal human being capable of error. Within a week, the excitement and elation subsided somewhat and many newspaper editorials began to caution that Obama had enormous obstacles ahead.\nThe election was closely watched from around the world and domestic media, including CNN and PBS, tracked the international reaction. Newspapers in most continents covered the electoral outcome on their front pages or as the top story. The Associated Press reported that \"Obama-mania was evident not only across Europe but also in much of the Islamic world.\"\nElation\nPre-election polls showed people around the world preferred candidate Obama to his opponent, John McCain, because they expected relations between the U.S. and the rest of the world to improve if Senator Obama won. Obama had become well-known abroad before the election. He travelled to Europe, and spoke to a crowd of 100,000 in Berlin in July 2008, before he had received the Democratic Party nomination. His relatively young age, appearance, intellect, charm, and oratory skills had made an impression on many non-Americans in Africa.\nWhen Obama emerged as the victor, people in many countries were outright ecstatic. An editorial in French daily Libération was headlined \"Hope, at Last! For One Day, Let Us Hope!\" and encouraged readers to abandon their skepticism and allow themselves to feel joy. \"After this already historic November 4th, let us admit that we're caught up, almost all of us, in a sense of joy. For one hour or a day, let us speak with an enthusiasm that is now sweeping the planet. For a few hours, the Americans hope; for a few hours, the whole world feels better.\"\nIn Brazil, Folha columnist Sérgio Malbergier wrote \"it is so epic and multidimensional that it fills us with amazement and exhilaration.\"\nTracee Hutchison, writing for The Age in Australia, said \"It may only be for a moment, but somehow this week's US election result rings like a clarion call for hope and peaceful momentum.\" Kenya's Daily Nation reported that \"excited crowds waved the American flag and carried life-size photos of Mr. Obama.\" In Swiss newspaper 24 heures (Switzerland), chief editor Thierry Meyer applauded America's overcoming of racism and said Obama \"is the embodiment of its lasting dream, its primordial founding virtue: optimism and confidence in its destiny.\" In another Swiss paper, Nachrichten, commentator Patrik Etschmayer said, \"The victory of Barack Obama is historic. Historic, because Obama was an impossible candidate who ran an impossible campaign against all the odds and expectations.\" Christian Merville wrote for ''L'Orient Le Jour'' in Lebanon that Americans had astonished the world: \"The miracle is that this is a country which has reconciled with itself after a very long estrangement has a renewed hope for a better future. This, just when everything seemed grey and the most sacred principles - those of democracy, freedom and free enterprise - had lost all meaning.\"\nEven in Iran, which has a history of tense relations with the US, the reaction was positive. The state-controlled Tehran Times wrote, \"The world has heaved a collective sigh of relief because their candidate has won the US presidential election.\"\nCautious optimism\nAfter Obama's election, commentators were inclined to celebrate, but cautioned readers to not set their expectations too high for the new president-elect. Meidyatama Suryodiningrat, writing for The Jakarta Post said, \"Indonesians are just as enamored as the rest of the world. It is an upsurge fueled by sentimentality over rationality.\" An editorial in Russia's Vedomosti said \"Obama will have to confront so many outstanding challenges that he is not to be envied.\" An editorial by Pierre Haski for Rue 89 in France said Obama \"united an even greater majority of the world's citizens who 'voted' for him in spirit\" but remarked that his expectations and challenges were enormous:\nTo say the least, the new president-elect has inspired enormous expectations. For Americans, the priority is the state of their economy, which was the number one topic of the campaign. But in the rest of the world he is also expected to follow through with his promise to break with the Bush era, which is undoubtedly one of the most disastrous in American history.\nFormer Scottish Minister of State Brian Wilson, writing for Scotland on Sunday said \"Dilemmas are already lining up for the president-elect.... Obama's instinct will be to keep America out of new wars, and that is good news for us, since it will also keep Britain out of them.\"  The media of Algeria was no less introspective. K. Selim wrote for ''Le Quotidien d'Oran, that from the African and Arab perspective, Obama was the \"least bad\" candidate: \"We must wait for the euphoria to pass and the time for action to arrive. All evidence suggests that the lines of force in the American system will impose themselves and the best we can hope for is that Obama will take account of the disastrous failures of his predecessor.\"\nKitabat'', a Sunni-leaning newspaper in Iraq, wrote that Obama's election was a \"chance to offset Iranian influence.\" Akil Al Azrak wrote:\nWith considering how the change in the U.S. after the election victory of Democratic candidate Barack Obama might affect Iraqis, we should remember that the United States is a country of institutions, and the institution of the Presidency only possesses 20 percent of the government's decision-making power. So policy doesn't necessarily change when a new president is elected. But that doesn't imply an absence of change in foreign policy and a new direction in dealing with the problem of Iraq. American history is the best proof of such transformations in foreign policy, as occurred under previous presidents Abraham Lincoln, Franklin Roosevelt and Ronald Reagan.\nMexico City's Excélsior raved that Obama is the \"president the planet requires\" but wondered if he was too much left of center to get much done in the United States.  An editorial in The Australian said Obama's \"victory re-affirms our faith in the US as a nation with an exceptional capacity for self-correction\" but added it was too early to tell if it would make any difference: \"As we sift the clichės and exuberance of the Obama victory, it is clear that November 4, 2008, was a defining day for the US and the world. But it is too early to describe it as transformational.\nSkepticism\nA few newspapers were skeptical about Obama's chances at achieving his agenda, and, while acknowledging his election was historic, decried the hype surrounding him. In Kuwait, the newspaper Awan said Arabs should not be taken in by another change of administration: \"We repeat it with every US election. We Arabs applaud the newcomer to the White House. We often do this as retribution against the one leaving office who, during his presidency, we accepted like bait put on the hook with our own hands. But not long after the new president arrives we discover that we're kings of illusion as well as kings of impotence.\" Matthew Parris, wrote from Australia for The Times, that the world to prepare for disappointment: \"... for an eight-word expression of hope for the president-elect of the United States. Eight words precisely: 'I hope he will let us down gently.'\"  Daniel Flitton, the diplomatic editor of Australia's The Age, wrote that Obama's election has done nothing to change the U.S. record on such issues as climate change, the war in Iraq and the Iranian nuclear predicament and that \"the American presumption to lead does breed resentment.\"\nReflections on race\nMany publications used Obama's election to reflect on their country's own race relations or to comment on America's. An editorial in Russia's Vedomosti business daily did not praise Obama, but focused instead on America's ability to elect a black man in contrast with Russia's inability to elect someone from an ethnic minority.\nWith Obama's victory, the societies of other countries with large racial and ethnic minority populations, in particular France and Britain, will reconsider the possibility of electing non-White leaders. For Russia, home to 130 nationalities and where minorities constitute about 20 percent of the population (in the United States it's 31 percent), this is not an idle question. The majority of ethnic Russian citizens in our country - 64 percent of the population according to the Russian Center for the Study of Public Opinion - are against someone of a different nationality heading the government. Russia has yet to internalize the possibility of the emergence of a \"non-Russian\" and non-Eastern Orthodox president.\nCharles Hawley wrote for Germany's Der Spiegel that \"America, many Europeans were certain, was far too racist a country to elect a black man to occupy the White House.\"  Greg Sheridan, foreign editor at The Australian wrote that \"The left liberal caricature of America was always nonsense. The militarism of American society is vastly overstated, just as its profound willingness to make sacrifice for other people's freedom is under-appreciated.\"  Moises Naim, writing for El Diario de Yaracuy in Venezuela wrote that for a black man to become president of the U.S. was \"simply unimaginable.\"\nThe color of his skin was not the insurmountable obstacle that the entire world thought would destroy Obama's political career. Does this mean that there is no racism in the United States and that the color of Obama's skin played no role whatsoever in the election? Absolutely not. But the fact is that for millions of his US supporters, Obama's race was less important than other factors. This is more surprising to the rest of the world than it is to the people of the United States.\nAn unsigned opinion piece in China's state-controlled Global Geographic Weekly said Obama had staged his own \"color revolution.\"  An editorial in Kenya's Daily Nation said the country is proud of Obama and finds him an inspiration: \"To Africa and the entire black race, Mr. Obama is the vindication of our humanity. He is our evidence that there is nothing really wrong with us, that our lack of success is not because our genes predispose us to be stupid but because we have not dared to dream big enough dreams.\"\nReflections on internal politics\nLaurent Joffrin, writing for Libération, hoped Obama's victory would reinvigorate Europe's left: \"Progressives had the idea of progress stolen from them. Now they have taken it back. What a lesson for the European left, which has been weakened, has no real plans and, above all, lacks a new ideal!\"  Le Monde wrote that the \"Obama phenomenon\" could serve as an example to all French political parties.  At another French paper, Le Figaro, an editorial by Paul-Henri du Limbert said the French could \"learn a lesson\" from Obama's election: \"We reproached \"Sarkozy the American\" for loving the country, its values and its way of life, but today we have realized that this wasn't such a terrible lack of good taste.\" Magdalena Środa, writing for Poland's Gazeta Wyborcza, said she envied Americans their Obama: \"I envy Americans their political engagement, which doesn't exhaust itself with the act of voting or posting election fliers. Americans debate, go door to door and travel to different states in order to convert others to their point of view. This is how a political culture is born and a capital of social trust is established, which, irrespective of who wins the election, remains an important national asset - a thing Poland still painfully lacks.\"  In an online discussion at The Indian Express, an unknown writer and commenters debated whether India could have its own Obama:\nMaybe a presidential system [that] allows a single individual to embody the aspirations of a party in a way that parliamentary structures don't  permit, but what are the chances of a ground-level referendum generating a Dalit or Muslim contender at the helm of affairs of either party, even if s/he was fitted out with all the qualifications of an Obama?\nReflections on Bush\n]]\nPresident George W. Bush had been criticized in America and abroad for his foreign policies, including his decisions to invade Iraq and Afghanistan during his eight years in office. After the 2008 election, many international editorials and commentators expressed hope that the new administration would provide a break from the previous administration's foreign policy choices.\nPeter Hartcher wrote for The Sydney Morning Herald that \"Barack Obama did not materialise from a vacuum. He is America's response to the dramatic failures of George Bush.  It was Bush who created the craving for change.  Obama has now met that need.\"  French historian and conservative Alexandre Adler, writing for Le Figaro, said Obama's victory was a \"miracle\" but \"We shouldn't treat Bush as a pariah.\" Marek Magierowski, writing for Polish newspaper Rzeczpospolita, said Obama's leadership will still be hegemony, just of another kind: \"The problem is that this same America has lost its credibility in recent years. People from Lisbon to Karachi stopped believing in its good intentions and George W. Bush, unfortunately, has a lot to do with that. But Barack Obama now has such a huge capital of trust that he should quickly be able to rebuild its credibility.\" An editorial in the Mexico City daily La Jornada said Obama's election was historic and that \"it would be unfair to ignore the strong and positive political and human differences between the victor in yesterday's election and the man who, for the last eight years, has taken the power of the United States into its worst moral and economic abyss.\"  The Toronto Star quipped that Americans craved change after Bush's \"imperial\" presidency.\nSee also\n* Barack Obama 2009 presidential inauguration\n* History of the United States (1991–present)\n* Newspaper endorsements in the 2008 United States presidential election\n* Presidential transition of Barack Obama\n* Public image of Barack Obama\nReferences\nExternal links\n* [http://obama2008.s3.amazonaws.com/international_headlines.html Images of front pages of international print publications]"
    }
  ]
}