{
  "content": [
    {
      "type": "text",
      "text": "# Intelligence in the Battle of Princeton\n\nTwo missions of military intelligence collection, both of which came to a climax on 30 December 1776, contributed to the Continental Army's victory in the Battle of Princeton.\nJoseph Reed and the Philadelphia Light Horse\nThe \"obscure and doubtful\" intelligence on which General George Washington had to base his next action frustrated him after the American victory at the Battle of Trenton. Washington observed to Adjutant-General Joseph Reed that the strength of the British in the area had greatly discouraged local colonists from becoming American spies; Reed had the same opinion, having himself encountered the \"poor\" and \"terrified\" inhabitants of Bordentown, New Jersey only days before. Red rags hung from almost every house door in expression of Loyalist sympathies; homeowners were hastily tearing them down in accordance with the clear turn of events. Reed considered the residents \"effectually broken and hardly resembling what they had been a few months before.\"\nReed was a New Jersey native and proposed to Washington that he lead a group of cavalrymen of the Philadelphia Light Horse toward Princeton to enlist spies. The Philadelphia Light Horse was a group of twenty-one wealthy young men that volunteered its service to Washington. They paid their own expenses, and, unlike most American soldiers, were gentlemen. The Light Horse wore chocolate brown uniforms, high-topped riding boots, and black hats with silver cords and bucktails. The American historian David Hackett Fischer speculated that ragged Continental infantrymen jeered them as they approached Trenton on matched chestnut horses. Washington approved the mission, and sent Reed with seven cavalrymen. The residents on the road to Princeton, however, were afraid. In Reed's words, the \"arms and ravages of the enemy\" had terrified the population; though they were \"otherwise well disposed,\" no reward could tempt them to go into Princeton as spies. However, Reed and his men were determined to return with valuable information. Expecting that the rear of Princeton would be poorly guarded, they circled the town.\nThey were about a half-mile southeast of Clarksville, almost in view of Princeton itself, when they spotted a British dragoon walking between a barn and a house. Reed assumed he was looting, and sent two cavalrymen to take him prisoner. The Light Horsemen kept the barn between themselves and the house to approach closely without being noticed. A second and third dragoon appeared as they rode, and Reed ordered the rest of his men to charge. Though Reed's men were outnumbered, most of the 12 British dragoons present were busy \"conquering a parcel of mince pies\" as the Light Horse surrounded the house. Seven cavalrymen, six of whom had \"never before seen an enemy\", managed to capture all 12 of the dragoons. Reed and the Light Horse returned to Trenton with their captives mounted behind, probably to a much different reception by Continental infantrymen. The prisoners were separately interrogated, and revealed that General James Grant had reinforced British troops at Princeton, that the force assembled there comprised over 8,000 soldiers, and that the British intended to advance on Trenton. This was critical intelligence; at the time, Washington commanded only 4,700 men, many of whom were new recruits, and all of whom were poorly equipped.\n\"A Very Intelligent Young Gentleman\"\nOn 12 December, Washington had written a letter to Colonel John Cadwalader, the senior officer of a militia called the Philadelphia Associators. This letter emphasized what Washington understood as an imminent necessity for both intelligence and counterintelligence.\nSpare no pains or expense to get intelligence of the enemy's motions and intentions. Any promises made, or sums advanced, shall be fully complied with and discharged... Every piece of intelligence you obtain worthy of notice, send it forward by express... Keep a good lookout for spies, and magnify your numbers as much as possible.\nThree days after receiving these  orders, Cadwalader replied that he had sent \"several persons over for intelligence.\" Two weeks later, on the morning of 31 December, he identified one of his spies, \"a very intelligent young gentleman\" who had just returned from Princeton with details on the British force and its disposition.\n...there were about five thousand men, consisting of Hessians and British troops—about the same number of each... He conversed with some of the officers, and lodged last night with them... No sentries on the back or east end of the town. They parade every morning an hour before day, and some nights lie on their arms. An attack has been expected for several nights past—the men are much fatigued, and until last night [were] in want of provisions, when a very considerable number of wagons arrived with provisions from Brunswick...\nIn accordance with Washington's orders, the spy magnified the Continental Army's numbers, telling them the best accounts reported 16,000 troops. This surprised the British, who had expected no more than five or six thousand. The same young gentleman, by coincidence, was \"near the party of chasseurs\" when they were captured by Reed and the Light Horse, and was with the British officers when they received news of the attack.\nCadwalader included with his letter a \"rough draft of the road from this place,\" meaning from Crosswicks, where Cadwalader was at the time, to Princeton. The map was highly detailed. Cadwalader put numbers next to bridges, for example, to indicate the number of soldiers defending them. A block of text perpendicular to the others ran up and down the right side of the map, highlighting a road: \"This road leads to the back part of Princeton which may be entered anywhere on this side—the country cleared, chiefly, for about 2 miles... few fences.\" The map was particularly helpful in that it displayed not what existed at the time Cadwalader drew it up, but what would exist by the time General Washington could act on the intelligence it provided. In other words, the map was estimative, indicating \"works begun, and those intended this morning.\"\nBefore he heard from Cadwalader, Washington had only three pieces of intelligence, all of which were ascertained through prisoner interrogation: firstly, that General James Grant had reinforced British troops at Princeton; secondly, that the aggregate force there comprised over 8,000 soldiers; and thirdly, that they intended to advance on Trenton. It is likely that Cadwalader's report, obtained from a plainclothes spy who ingratiated himself with British officers, relieved Washington both by suggesting a substantially smaller British force of around 5,000 men and by providing detailed, actionable information on their positions and disposition. Washington immediately sent a large Continental force up the Post Road with orders to delay any British movement toward Trenton. It advanced under the cover of darkness on New Year's Eve, occupying a position six miles from Nassau Hall. The British spotted them at dawn and sent its First Battalion light infantry, along with two Hessian companies to engage the Americans. The British cleared the road, but at a heavy cost.\nSt. Clair's Proposal\nOn 2 January 1777, British troops advanced in force; the Continental Army held its ground at Assunpink Creek in the Second Battle of Trenton. That evening, Washington convened a council of war. His senior officers, including Reed and Cadwalader, were there, along with local citizens whom Washington invited both to attend the meeting and to speak freely.\nWashington's officers considered several alternatives, none of which seemed advantageous. General Arthur St. Clair proposed a surprise attack on the enemy's rear; if Continental troops could reach Quaker Bridge unobserved and unopposed, he argued, they would only have to proceed north about six miles before reaching Princeton. Reed confirmed this estimate and contributed his own knowledge of the terrain. When he led the Light Horse to Princeton, he mentioned, they saw no British on the back roads. One officer later recalled that \"two men from the country, near the route proposed,\" were \"called to the council for their opinions of its practicability.\"\nSt. Clair's idea was bold. Washington might have rejected it outright had it not been for the additional intelligence he was able to solicit from ordinary colonists on the evening of 2 January.\nAftermath\nWhen Washington wrote John Hancock three days later, on 5 January 1777, it was with good news.\nTo John Hancock\nSir\nI have the honor to inform you, that, since the date of my last from Trenton, I have removed with the army under my command to this place. ... Their large pickets advanced towards Trenton, their great preparations, and some intelligence I had received, added to their knowledge, that the 1st of January brought on a dissolution of the best part of our army, gave me the strongest reasons to conclude, that an attack upon us was meditating.\nWashington described the Continental Army's march to Princeton, \"by a roundabout road,\" as its baggage was quietly moved to Burlington. The Battle of Princeton was a victory for Continental troops, who took the British by surprise. This was just the pick-up the Americans needed; The Pennsylvania Journal wrote that if Washington had lived in the days of idolatry, he would have been worshiped as a god. Washington formally discharged the Philadelphia Light Horse three weeks later, saying that \"though composed of gentlemen of fortune,\" they had \"shown a noble example of discipline and subordination,\" and in several actions had \"shown a spirit and bravery which will ever do honor to them, and will ever be gratefully remembered by me.\" In September 1779, the Light Horse reconvened at Washington's own request and served the Continental Army until the siege of Yorktown two years later, in October 1781.\nThe Philadelphia Light Horse enjoyed an honorable legacy after the American Revolution. In his 1816 memoir, General Wilkinson praised the cavalrymen for their 30 December expedition. This \"little act of decisive gallantry\" had \"tended to increase the confidence of the troops, and certainly reflected high honor on the small detachment.\" Eight years later, at a reception held for General Lafayette, John Lardner and William Leiper—the sons of two Light Horse cavalrymen who were part of the reconnaissance mission—wore the gorgets of British officers captured that day.\nPublished in 1875, the Light Horse's narrative of the 30 December expedition cooperates almost perfectly with that of Joseph Reed. The sole discrepancy is the number of men that Reed took with him. The Light Horse maintains that Reed took twelve, not seven, cavalrymen with him on the mission to Princeton, while Reed clearly asserts in his handwritten account that he proceeded on that day \"with seven gentlemen,\" five of whom he names: Messrs. Caldwell, Dunlap, Hunter, Pollard, and Peters. Assuming that the two others are Messrs. Lardner and Leiper, five men of the Light Horse's narrative remain unaccounted for.\nWhether Reed excluded, by accident or by design, the names of men that accompanied him on such a vital mission, or whether members of the Light Horse sought credit, ex post facto, for a mission with which they were not involved, is unclear. History seems to have sided with the Light Horse; most accounts of the expedition mention twelve, not seven cavalrymen. A notable exception is David Hackett Fischer’s ''Washington's Crossing'', which—perhaps nodding to the discrepancy—avoids the mention of a figure. The legacy of the Philadelphia Light Horse stands in stark contrast to that of Cadwalader's anonymous and \"intelligent young gentleman.\" He might have been a student at Princeton, which had closed after the British invasion of New Jersey. It is likely that he had no surviving family; none claimed his story after the war or since.\nSee also\n*Intelligence in the American Revolutionary War\n*Intelligence Operations in the American Revolutionary War\nNotes\nReferences\n* By-laws, Muster-roll, and Papers Selected from the Archives of the First Troop Philadelphia City Cavalry: from November 17, 1774, to March 1, 1856. (1856). James B. Smith.\n* Cadwalader, J. (1776). Plan of Princeton, Dec. 31, 1776. Retrieved January 3, 2011, from http://memory.loc.gov/cgi-bin/query/h?ammem/gmd:@field%28NUMBER+@band%28g3814p+ct000076%29%29\n* Davis, W. (1880). Washington on the West Bank of the Delaware, 1776. The Pennsylvania Magazine of History and Biography, 4 (2), 133–163.\n* Fischer, D. H. (2006). Washington's Crossing. Oxford University Press US.\n* Flexner, J. (1968). George Washington in the American Revolution. Boston: Little and Brown.\n* History of the First Troop Philadelphia City Cavalry: from its Organization, November 17th, 1774 to its Centennial Anniversary, November 17th, 1874. (1875). Philadelphia: Hallowell.\n* Reed, J. (1880). General Joseph Reed's Narrative of the Movements of the American Army in the Neighborhood of Trenton in the Winter of 1776–77. The Pennsylvania Magazine of History and Biography, 8 (1), 391–402.\n* Reed, W. B. (1847). Life and Correspondence of Joseph Reed: Military Secretary of Washington, at Cambridge; Adjutant-General of the Continental Army; Member of the Congress of the United States; and President of the Executive Council of the State of Pennsylvania. Lindsay and Blakiston.\n* Rose, A. (2006). Washington's Spies: The Story of America's First Spy Ring. New York: Bantam Books.\n* Solis, G. D. (2010). The Law of Armed Conflict: International Humanitarian Law in War. Cambridge University Press.\n* Washington, G. (1890). The Writings of George Washington. G. P. Putnam's Sons.\n* Wilkinson, J. (1816). Memoirs of My Own Times. Printed by Abraham Small."
    }
  ]
}