{
  "content": [
    {
      "type": "text",
      "text": "# International Expeditions\n\nInternational Expeditions (IE) was a travel company specializing in small-group adventure travel. The company was founded in 1980 and located in Helena, Alabama. In October 2021, it was rebranded as Exodus Travel, an existing brand owned by parent company Travelopia.\nCompany overview\nInternational Expeditions provides small-group adventure experiences in various exotic countries. These include land-based trips to places like Ecuador, Kenya, Tanzania, and Patagonia, as well as cruise excursions in notable wildlife and natural areas such as the Peruvian Amazon and Galapagos Islands. While it focuses primarily on land-based activities, IE charters a variety of riverboats and yachts for cruise programs in Patagonia, India, Cuba, the Amazon, and Galapagos.\nIE is a subsidiary of Travelopia, a collection of brands formerly part of TUI Group, along with AmeriCan Adventures, Exodus, Grand American Adventures, Headwater, Quark Expeditions, Sawadee, TrekAmerica, World Challenge, and Zegrahm Expeditions.\nLeadership\nInternational Expeditions was co-founded by Dr. Richard Ryel and Steve Cox. Ryel also served as the Chairman of the Board of the International Ecotourism Society. Van Perry was appointed the president of International Expeditions in November 2011. He is also the president of Zegrahm Expeditions, an adventure travel company located in Seattle, Washington.\nControversy\nIn April 2016, a cabin on International Expeditions' \"Estrella Amazonica,\" now known as \"Amazon Star,\" caught fire, killing two American passengers: Drs. Larry and Christy Hammer. According to investigators, the fire was caused by a power strip that was supplied by the boat and lacked surge protection and safety and flammability ratings. The Hammers' room lacked an in-room fire alarm. Surveillance video footage shows that it took the Estrella Amazonica's crew more than 22 minutes to extract Dr. Larry Hammer from the room after the fire was located; and another six minutes to extract Dr. Christy Hammer.\nIn the days following the fire, International Expeditions claimed that the Chief of Fire Department–Loreto Region, a Chief of Fire Prevention and Investigation Unit, a Chief of Instruction and Investigation, the commanding Deputy District Attorney, the Tourism Police Force, and Port Authorities cleared the vessel safe to carry guests. These claims have not been verified.\nPerry and International Expeditions are criticized for declaring the boat \"safe to travel,\" and for the ship to resume sailing within two days of the tragedy given that Perry and International Expeditions did not know at that time what caused the fire, why no alarm sounded anywhere on the boat, and why the crew failed to respond effectively.\nIn September 2016, Perry told People that \"the boat now has enhanced fire fighting equipment and that the crew has been provided with refresher fire training.\" No safety officials or third parties have been able to publicly verify the statement.\nIn April 2017, The Wall Street Journal's Joe Palazzolo shined new light on the Hammer tragedy, citing a newly released Peruvian Navy report on the fire. Palazzolo writes, \"The riverboat’s fire alarm 'did not operate at all,' and its crew, lacking training and equipment, took more than 20 minutes to enter the Hammers’ cabin, Peruvian authorities said in an October report on the fire, citing a litany of violations of the nation’s maritime regulations.\" He also explains the Death on the High Seas Act, which may allow International Expeditions to escape accountability for the Hammers' deaths. Because of the 1920 law, \"the cruise industry enjoys broad immunity from damages in wrongful-death cases involving retirees and other passengers who have no financial dependents. International Expeditions, the Alabama-based company that charters the cruise and helped design the riverboat, has told the daughters through its lawyers that it has no financial obligation to the family under the law.\"\nThe Omaha World-Herald and Cruise Law News also covered the Peruvian Navy report. In the words of Jim Walker, a maritime lawyer and publisher of Cruise Law News, \"The point to come away with after reading about this terrible ordeal is that this is the exactly the result that the cruise lines want after cruise passengers have been killed.\" Walker also calls the Death on the High Seas Act \"one of the cruelest and most unfair, if not completely callous, laws imaginable.\"\nIn July 2017, Good Morning America covered the Hammers' deaths and their family's ongoing legal efforts.\nReferences"
    }
  ]
}