{
  "content": [
    {
      "type": "text",
      "text": "# International Manga Award\n\nTarō Asō, the 92nd Prime Minister of Japan\nis an annual award established to encourage non-Japanese manga artists in 2007. This award was created by Japanese Foreign Minister Tarō Asō, who proposed this award in a policy speech he gave in Tokyo's Akihabara district in 2006.\nThe selection is managed by the Ministry of Foreign Affairs of Japan. Annually, award honorees are recommended by the advisers including Machiko Satonaka and many other manga artists.\nWinners\n2007\n146 entries from 26 countries and regions were received\nInternational Manga Award Winner:\n* ''Sun Zi's Tactics by Lee Chi Ching (Hong Kong)\n\"Shorei\" (Commendation) Award:\n* 1520 by Kai (Hong Kong)\n* Hollow Fields by Madeleine Rosca (Australia)\n* Le Gardenie by Benny Wong (Malaysia)\n2008\n368 entries from 46 countries and regions were received\nInternational Manga Award Winner:\n* Feel 100% by Lau Wan Kit (Hong Kong)\n\"Shorei\" (Commendation) Award:\n* Elapse by Yin Chuan (China)\n* \"Portrait\" by Chezhina Svetlana Igorevna (Russia)\n* Okhéania 1 by  (France)\nBronze Award\n* The strong men game, by Amer Moghrabi (Syria)\n2009\n303 entries from 55 countries and regions were received\n* Gold Award:\n**  by  (Ton Jakraphan) (Thailand)\n* Silver Award:\n** Zaya (Belgium: Huang Jia Wei-Morvan-Dargaud Benelux) by Huang Jia Wei (China) Morvan (France)\n** Natty (Belgium: Melvil-Corveyran-Dargaud Benelux) by  -  (France)\n** Running on empty by Kim Jea-eon (Republic of Korea)\n2010\n189 entries from 39 countries and regions were received\n* Gold Award:\n** Si loin et si proche by Zhang Xiaobai (Belgium)\n* Silver Award:\n** Face cachée by Olivier Martin and  (France)\n** La Isla sin Sonrisa by  (Spain)\n** \"The story begins with ...\" by Veerachai Duangpla (Thailand)\n* Bronze Award:\n** Dolltopia (United States) by Abby Denson\n** Kylooe (Belgium) by Little Thunder (China)\n** The little polar bear (Taiwan) by Chang Fung-Chih\n** Pandora (Thailand) by Akekarat Milintapas\n** The passionate sword (Taiwan) by Yeh Yu Tung, Syu Shu Hao\n** Samurai (France) by  (artist, Belgium),  (author, France)\n2011\n145 entries from 30 countries and regions were received\n* Gold Award:\n** I Kill Giants by Joe Kelly (USA) and JM Ken Niimura (Spain)\n* Silver Award:\n** When You Standing Your Tiptoes by Pan Li-Ping and Zu Le-ya (China)\n** Make a wish! Da Xi by  (Taiwan)\n** The Man Who Follow His Own Voice by Tanis Werasakwong (Thailand)\n* Bronze Award:\n** A Letter To Father (Malaysia) by Chong Chiew Choy\n** Conversations Between Me and You (Thailand) by Tongkarn\n** Dream Land (Taiwan) by We We\n** Ice Cream Baby (Malaysia) by Neko/Chang Lee Ying\n** NNN (Canada) by Dan Kim\n** Pelangi di Naungan Mentari (Rainbow Under the Sun) (Indonesia) by Indra Wisnu Wardhana (artist), Dimas Adi Saputro (author)\n** Summer in Vale・Boll bride (China) by Yang Xiao-ru\n** Tokyoland (France) by Benjamin Reiss\n** Security Gard (China) by Han Zu-zheng\n** X-Venture: Terror Raptor (Malaysia) by Tan Zien Yun (artist), Sherlock (author)\n2012\n245 entries from 38 countries and regions were received\n*Gold Award:\n**  (Thailand) by Kosin Jeenseekong\n*Silver Award:\n** Melon Seed School Vol. 3 (Thailand) by Ittiwat Suriyamart\n** Floating Flower (China) by Yao Wei\n** 5 minutes before airing (Indonesia) by Muhammad Fathanatul Haq, Ockto Baringbing\n*Bronze Award:\n** Once Again (China) by , Feng Xi Shen Lei\n** Charge ~ beyond ~ (China) by Han Zu Zheng\n** Oldman (Taiwan) by\n** Scralls of A Northern City (Taiwan) by\n** From The Netherworld : Tales of Terror! (Malaysia) by Puyuh, Core\n** Dragon Land (Vietnam) by Dimensional Art, Dinh viet Phuong, Do Nhu Trang, Le Lam Vien\n** Once Upon a Time of Love (Thailand) by Amp, Varacha pansang\n** Eros/Psyche (Spain) by Maria Llovet\n** Xiao Ou, volume 2, Un monde en double (China) by Wei Song\n** Otaku Blue (France) by Malo Kerfriden, Richard Marazano\n** The ten rituals of the initiation (Burkina Faso) by Boureima NABALOUM\n2013\nThis year, 256 entries from 53 countries and regions were made. The largest number of application was received from Thailand (47), followed by Taiwan (36), and Indonesia (21).\n*Gold Award: Bokbig (Thailand) by Prema Jatukanyaprateep\n*Silver Award:\n** Paris (USA) by George Alexopoulos\n** Carrier (China) by Naver\n** Les Folies Bergère (Belgium) by Francis Porcel (Spain),  (Belgium)\n*Bronze Award:\n** Pandism (Virus Panda) (Thailand) by Pittaya Werasakwong\n** User, Volume 1 (Malaysia) by Zint\n** Ten Sticks And One Rice (Singapore) by Koh Hong Teng, Oh Yong Hwee\n** City of Darkness (Hong Kong, China) by Andy Seto, Yuyi\n** The director against the whip (Burkina Faso) by Kondi Sambu Cypriano\n** Something Between (China) by Zhi Ying\n** Lead of the soul (China) by , Ke Han, Yi Sha\n** Boonhome (Thailand) by Ruangsak Duangpla\n** D day (Thailand) by Art Jeeno\n** The bear's skin by  (Spain), Zidrou (Belgium)\n** It's your world (Japan) by Junko Kawakami\n2014\nThere were 317 entries from 46 countries and regions.\n*Gold Award:\n** Bumbardai (Mongolia) by Nambaral Erdenebayar\n*Silver Award:\n** Mr. Bear (China) by Luo mu\n** Atan (Malaysia) by Ben Wong\n** Room (Taiwan) by 61Chi\n*Bronze Award:\n** The Moaaga Prince (Burkina-Faso) by Cyprien Kondi Sambu\n** Before the rainy evening (China) by Buddy\n** Beyond the Cloud (China) by Xi jiu\n** Syncopated Dreams by Laurent Bonneau  (Germany), Mathilde Ramadier (France)\n** The director against the whip (Burkina Faso) by Kondi Sambu Cypriano\n** Only Human (Indonesia) by Mukhlis Nur\n** 13:05 (Jordan) by Amani Badran\n** Summer Shroud (Russia) by Ilya Kuvshinov\n** Another World, It Exists. (Saudi Arabia) by SaKooo SHS\n** Pretty Deadly by Emma Ríos (Spain), Kelly Sue DeConnick (USA)\n** The Vice Squad Jordi Lafebre (Spain), Zidrou (Belgium)\n** Juice 1 (Thailand) by Art Jeeno\n2015\nThere were 259 entries from 46 countries and regions.\n*Gold Award:\n** The Divine (Israel) by Asaf Hanuka, Tomer Hanuka & Boaz Lavie\n*Silver Award:\n** Demo#1 vol. 1 (Taiwan) by Rockat\n** Holy Dragon Imperator (Vietnam) by Nguyen Thanh Phong & Nguyen Khanh Duong\n** Ichthyophobia (Taiwan) by Li Lung-chieh\n*Bronze Award:\n** Symbol Sentences (Thai) by Munin\n** Sky whale (Ukraine) by Lisa Cloud, Tori\n** Her Majesty (Taiwan) by Chang, Szu-Ya, Chen Yung Shen\n** Happiness Seasonings (Taiwan) by Ruan, Guang-Min\n** Inspiration (Russia) by Dzi\n** SQ Begin W/Your Name! (Russia) by Tan Jiu\n** Silver Ocean (China) by Starry\n** My Unforgettable Single Life (Thai) by Plariex\n** To The More (China) by Ba Wang\n** Adjame's Thief'' (Côte d'Ivoire) by Tape Zato\n2016\nThere were 296 entries from 55 countries and regions.\n* Gold Award:\n** The Master of Arms (Belgium) by Joël Parnotte & Xavier Dorison\n* Silver Award:\n** Scavengers (China) by HAN Zuzheng\n** The Heart of Darkness (Belgium) by Laura Iorio, Roberto Ricci & Marco Cosimo D'amico\n** Gateway to Underworld (Vietnam) by Can Tieu Hy\n* Bronze Award:\n** King of Vampires (Thailand) by Mangkorn Soraphon, Wipaporn & Rutchote\n** Evil Discus (Thailand) by Wiroj (Beast) Ruengsiri\n** Secrets of the Ninja (United States) by Akiko Shimojima (Japan) & Sean Michael Wilson (United Kingdom)\n** TsangyangGyatso (China) by Zhao Ze & Guo Qiang\n** Raruurien (Indonesia) by Ann Maulina\n** Tebori (France) by Toledano (Spain) & Robledo (Spain)\n** Summer Temple Festival I (Taiwan) by Zuo Hsuan\n** Tussles Against Spectres (Korea) by Youngoh Kim\n** Dream About Japan (Poland) by Patrycja Kicyla\n** Woelan (Indonesia) by Dimaz Sadewa\n2017\nThere were 326 entries from 60 countries and regions.\n* Gold Award:\n** Two Aldos (Colombia) by Pablo Guerra & Henry Díaz\n* Silver Award:\n** Onibi (France) by Atelier Sento\n** Viva Eve! Long Libe Life! (Ukraine) by Rerekina Natalliia & Martynenko Nataliia\n** Left Hand Vol. 1 (Taiwan) by Sally\n* Bronze Award:\n** Mightier (United Arab Emirates) By Ahmed Mohammed Al Ali & Mohammed Yousef Al Meraikhi\n** Secret Weapon (China / Hong Kong) by Dai Hing Yin\n** Mandela (United Kingdom) by Umlando Wezithombe (Republic of South Africa), Santa Buchanan & Nelson Mandela Foundation\n** Clearsky city (China) by BigN\n** Dutchman in Formosa (Taiwan) by Kinono\n** Cat Swordsman (Taiwan) by Yu-Yung Yeh\n** Westward (China) by Guangzhou Baiman Culture Communication Co. Ltd & Eric Cheng\n** The art of Laziness (Thailand) by Patcharakan Pisansupong\n** On This Day (Thailand) by Mork\n** Based on True Stories (Thailand) by Gawin Satawut\n** Gung Ho - 3 (France) by Thomas Von Kummant (Germany) & Benjamin Von Eckartsberg (Germany)\n2018\nWinners from 2019.\n* Gold Award:\n** Yang Hao and his four compositions (China) by Tang Xiao (Dani)\n* Silver Award:\n** Miseyieki (England) by Shangomola Edunjobi\n** The Pork Chops Inferno (Hong Kong) by Lai Tat Tat Wing\n** Planned Obsolescence of our feelings (Belgium) by Aimée de Jongh and Zidrou\n* Bronze Award:\n** Teng snakes (China) by Feng\n** They say the village is haunted (Malaysia) by Yap Zhuo Yu (Malaysia)\n** A Través Del Khamsin (Spain) de Marta Salmons\n** Flick Royale (Indonesia) Beatrice Nauli\n** Romaria (Brazil) by Alexandre Carvalho\n** Desert Wolf (Hongkong) by Jack Fung\n** Ordinary Days in Taipei (Taiwan) by 61Chi\n** Nightlights (Colombia) by Loreana Alvarez Gómez\n** Music Of the Fairy Tales (China) by Chiya and Shi Yuyan\n** Shi (Belgium, France) by Josep Homs and Zidrou\n** 1661 Koxinga Z (Taiwan) by Li Lung-chieh (Taiwan)\n2019\n* Gold Award\n** Piece of Mind (Manga) (Israel) by Guy Lenman and Nimrod Frydman\n* Silver Award\n** My little kitchen in summer season (Thailand) by Pitsinee Tangkittinun\n** Korokke and the girl who said no (Spain) by Jonatan Cantero and Josep Busquet\n** Ye (Brazil) by\n* Bronze Award\n** Detektif Hantu : Kesumat (Malaysia) by Leoz\n** Palma Sola (Dominican Republic) by Gabriel Castillo and Gerardo Castillo\n** Mi Xian Yin: Chinese Folk Tales (China) by 采蘑菇的司马公公(China)\n** Migrant (Republic of Benin) by Gjimm Mokoo\n** Chunxue (China) by 王宇涵\n** Merman in the pool (China) by 李嫣然\n** Rites of Passage (Brazil) by Lucas Marques\n** Erasmus Song (Portugal) by Daniela Viçoso\n** DiKiXi - The Reconciliation (Angola) by Bomcomix e Gildo Pimentel\n** Tao Zero (Hong Kong) by 麥天傑\n** Sometimes in the City (Taiwan) by 61Chi\n2020\n* Gold Award\n** Funeral Director (Taiwan) by 韋蘺若明\n* Silver Award\n** A graphic novel adaptation by Ruan Guang-Min of selected stories from THE ILLUSIONIST ON THE SKYWALK AND OTHER STORIES by Wu Ming-Yi (Taiwan) by 阮光民 and 呉明益\n** THE MUSE (Spain) by ORIOL and ZIDROU\n** NANHAO AND SHANGFENG (China) by 布朗尼\n* Bronze Award\n** INTRANSEXTELLAR (Spain) by Jimi Macías\n** The Umbrella (China) by 魏瑩 and 郑柳沁\n** Fujie and Mikito (Brazil) by Marcelo Costa and Yuri Andrey\n** Nina in the underworld: rat is cat to rat (Brazil) by Pedro Sotto\n** Gatherer of the Birds (Ukraine) by Nataliia Rerekina and Gilbert Brissen\n** MURENA 10 (Italy) by THEO and JEAN DUFAUX\n** EPSILON (Thailand) by YGGO\n** STRANGE TALES OF WALLED CITY (Hong Kong) by REX KOO\n** Falling in Love (China) by 吉川流\n** BLOSSOM (Taiwan) by D.S.\n** JUICE 3 ARRIVALS (Thailand) by Art Jeeno\n2021\n* Gold Award\n** Days of sand by Aimée de Jongh (Netherlands)\n* Silver Award\n** Moonchosen by Nataliia Rerekina (Ukraine) and Gilbert Brissen (Ukraine)\n** Always never by Jordi Lafebre (Spain)\n** CliniClowns: last goodbye by 顆粒 (Taiwan) and 逢時 (Taiwan)\n* Bronze Award\n** Iogi by Václav Šlajch (Czech Republic) and Jean-Gaspard Páleníček (France and Czech Republic)\n** Snow House by 猫僧 (China)\n** Blood Ties by Yitan (Chile)\n** The Chosen One by 墨飛 (China)\n** The Philosophy of Gachapon by Summerluckkim (Thailand)\n** Mortal by 采蘑菇的司马公公 (China)\n** The African child versus covid-19 by Cyprien Kondi Sambu (Burkina Faso)\n** Formosa Oolong Tea Vol.4 by 張季雅 (Taiwan)\n** Mayfly Island by Evergreen Yeh (Taiwan) and SHANG-CHIAO LI (Taiwan)\n** Ama, the breath of women by Cecile Becq (France) and Franck MANGUIN (France)\n2022\n* Gold Award\n** In summer by Seong Ryul (Republic of Korea)\n* Silver Award\n** Lost Letters by Jim Bishop (France)\n** See You In Memories by PEN SO (Hong Kong)\n** Sea You There and Us by Xīngqíyīhuíshōurì Monday Recover (Taiwan) and Chen,Chiao Jung (Taiwan)\n* Bronze Award\n** The Justice by Lai Kai (Taiwan)\n** Swordsman Cat in Edo : The Twelve Lives Oiran by Yeh Yu Tung (Taiwan)\n** Used kimono Store by Angry Albatros (Katarina Kratochvílová), (Czechia)\n** Strong man servant by Mao Seng (China) and Ru Lu Mu Xi (China)\n** Mysterious Antique World by Sengsanlaoyu (China)\n** Selective Yellow by  (Brazil) and Ricardo Tayra (Brazil)\n** Rain In A Moon Night by Hoang Tuong Vy (Viet Nam)\n** Korokke and The spirit beneath the mountain by Jonatan Cantero (Spain) and Josep Busquet (Spain)\n** Records of the Su Mang by Wang Biao (China)\n** Sinawang by Dedy Koerniawan (Indonesia)\n** Reward by Okagawa Kenji (Brazil)\n2023\n* Gold Award\n** Wind Chaser Under the Blue Sky by Chien Jason (Taiwan)\n* Silver Award\n** Chronos Express by Bonnie Pang (Hong Kong)\n** The dancing universe by Nachi (Vietnam)\n** Just Friends by Ana Oncina (Spain）\n* The Special Encouragement\n** Spectrum by Ahlem Khedri (Tunisia) and Samah Kamil (Saudi Arabia)\n* Bronze Award\n** Limbo by Ana C. Sánchez (Spain)\n** 207th bone by Lin I-Chen (Taiwan）\n** Before Becoming the Buddha by ADISAK DAS PONGSAMPAN (Thailand)\n** Girypto Nomad 77: Underground Assaultt by Lam Quek Chung (Malaysia) and Lee Kok Chen (Malaysia）\n** Father of the Nation Bangabandhu by Mahbube Elahi Chowdhury (Bangladesh）\n** Lautaro by Claudio Muñoz (Chile), Francisco Inostroza (Chile) and Felipe Benavides (Chile）\n** As We Get Closer To The Sun by Lu Jingyan (China）\n** ''Go On!! Tan Jiu's Short Manga Stories Collection by Tan Jiu (China）\n** Tomoe's Memories of Koumeya vol.2 by Shimizu (Taiwan) and Sanshokubou Haku (Taiwan)\n** THE END OF THE WORLD by A Dong (China）\n2024\n* Gold Award\n** The Forest Mermaid by （Brazil）\n* Silver Award\n** RISE POLLY by Preecha Jai-ordthon（Thai）\n** The Banana Sprout vol.2 by 左萱 (Zuo Hsuan)（Taiwan）\n** Scars by Brandon Arias（Chile）\n* Bronze Award\n** Chronicles of man - Noãn by Nguyen Thuy Linh（Vietnam）and Nguyen Trung Thach（Vietnam）\n** Whisky San by Alicia Grande（Spain), Fabien Rodhain（France）, Didier Alcante（Belgium）\n** Grey is... by dee Juusan（Jordan）\n** Last Call to Leave Earth by Cassio Ribeiro（Brazil）\n** Degas and Cassatt, The Dance of Solitude,by Efa and Salva Rubio（Spain）\n** The idealist by 水然 (watery)（China）\n** Cats Legend in the Forbidden City by 金涛,北京漫传奇文化传播有限公司，刘玮（China）\n** SIGI - Tome -1- Opération Brünnhilde, by David Morancho（Spain) and （France)\n** Little Feather by Nao and Ivan Navinkin（Russia）\n** Underground, Volume 1: Fight Club by John-Raymond De Bard（USA）\n** Dream and his twin brother Death'' by KoLODa and CoFi-Tan（Ukraine）\nSee also\n* List of manga awards\nReferences\nExternal links\n*\n*[https://web.archive.org/web/20080822112704/http://www.mofa.go.jp/policy/culture/manga/index.html First International Manga Award (Ministry of Foreign Affairs)]"
    }
  ]
}