{
  "content": [
    {
      "type": "text",
      "text": "# Invasion of Isle de France\n\n| result      = British victory\n| territory   = British occupation of Isle de France\n| combatant1  = United Kingdom  East India Company\n| combatant2  = France\n| commander1  = Albemarle Bertie  John Abercromby\n| commander2  = Charles Decaen  Edmé-Martin Vandermaesen  Jean Dornal de Guy\n| strength1   = 6,848 regulars and sailors  1 ship of the line  12 frigates  5 brigs  50 smaller warships/troopships\n| strength2   = 1,300 regulars10,000 militia  6 frigates  3 brigs  1 smaller warship\n| casualties1 = 28 killed  94 wounded  45 missing\n| casualties2 = Entire garrison captured\n| map_type    = Indian Ocean\n| map_relief  = 1\n| campaignbox =\n}}\nThe invasion of Isle de France was a complicated but successful British amphibious operation in the Indian Ocean, launched in November 1810 during the Napoleonic Wars. During the operation, a substantial military force was landed by the Royal Navy at Grand Baie, on the French colony of Isle de France (now Mauritius). Marching inland against weak French opposition, the British force was able to overwhelm the defenders in a series of minor engagements, culminating in the capture of the island's capital Port Napoleon and the surrender of Governor Charles Mathieu Isidore Decaen. The surrender eliminated the last French territory in the Indian Ocean and among the military equipment captured were five French Imperial Navy frigates and 209 heavy cannon. Isle de France was retained by Britain at the end of the war under the name of Mauritius and remained part of the British Empire until 1968.\nThe operation was the culmination of two years of conflict over the island and the neighbouring Isle Bourbon between frigate squadrons commanded by Josias Rowley and Jacques Hamelin. Hamelin repeatedly raided British trade convoys and Rowley responded with amphibious assaults on French harbours, but neither had gained ascendancy by the time Rowley sent most of his force to attack the port of Grand Port on Isle de France in August 1810. At the ensuing battle at Grand Port the British squadron was destroyed and Hamelin began to blockade Rowley on Isle Bourbon. As British reinforcements were urgently dispatched, several actions were fought between recently arrived British ships and the more numerous French forces. At the last of these on 18 September, Hamelin was defeated and captured by Rowley. This allowed Rowley to build his forces over the next two months until they were sufficient for a successful invasion, which was led by the recently arrived Admiral Albemarle Bertie.\nBackground\nThe Indian Ocean had been an important strategic region for British trade since the first East India Company trading posts were established in India. By the Napoleonic Wars, millions of pounds worth of goods crossed the ocean's trade routes every year, mostly in heavily guarded convoys of East Indiamen. The French recognised the economic importance of these convoys but until 1808 failed to provide sufficient forces to disrupt the Indian trade. Late in 1808, it was decided to send a strong frigate squadron to the Ocean under the command of Jacques Hamelin to augment the forces available on the island bases of Isle Bonaparte and Isle de France and raid British shipping in the region. Hamelin was an able commander and between May 1809 and July 1810 his ships captured seven East Indiamen and a large number of small merchant ships and warships.\nThe British response to Hamelin's deployment was provided by Admiral Bertie, who collected a squadron of ships from those available at the Cape of Good Hope and placed them under the command of Commodore Rowley. Bertie gave Rowley instructions to blockade the islands and prepare for invasion attempts once the required forces could be spared. During 1809 and the spring of 1810, Rowley maintained the blockade and launched a series of small raids, the largest being a raid on Saint-Paul in Isle Bonaparte in September 1809. By July 1810, Rowley had developed sufficient forces at his island base on Rodriguez to launch a successful invasion of Isle Bonaparte, which he subsequently restored to its former name of \"Isle Bourbon\". In August, Rowley attempted to extend his blockade of Isle de France by seizing small islands off the main ports that could control the passage of shipping through the coral reefs that surround the island. The first operation was to capture Île de la Passe off Grand Port, which was successfully secured on 13 August. Shortly afterwards a French squadron forced passage into the harbour, and Captain Samuel Pym ordered the four frigates of the blockade squadron to attack the ships anchored in the bay. The ensuing Battle of Grand Port was a disaster for the British, as two frigates were wrecked on the reefs and two others captured with their entire crews: only the very seriously wounded, including Captain Nesbit Willoughby, were repatriated to Isle Bourbon.\nWith his squadron reduced to a single frigate, Rowley sent urgent messages to the British bases at Madras and Cape Town requesting reinforcements. The naval authorities responded by sending the forces they had available to join Rowley at Rodriguez. The first two frigates to arrive, HMS Africaine and HMS Ceylon were both attacked while sailing alone and captured by Hamelin's squadron, which was now blockading Isle Bourbon. Rowley was able to recapture both ships within hours of their loss, and was also able to seize Hamelin and his flagship Vénus at the action of 18 September 1810. The loss of the French naval commander was a serious blow to the squadron on Isle de France, which was also beset by supply problems resulting from a lack of naval stores and food supplies. Unable to make the lengthy cruises needed to disrupt the Indian Ocean trade routes, they were forced to remain in harbour as Rowley was heavily reinforced during September and October 1810, and eventually the senior naval officer, Captain Jean Dornal de Guy, had his four frigates, Manche, Astrée, Bellone and Minerve, moored in Port Louis and their crew disembarked to reinforce the garrison of the town.\nPlanning\nThe invasion of Isle de France, although prompted by the defeat at Grand Port, had been the ultimate intention of Rowley's squadron since its creation in 1809 and had been planned carefully both on a strategic level by Bertie at Cape Town and Lord Minto at Madras and on a tactical level by Rowley and his British Army counterpart Lieutenant-Colonel Henry Sheehy Keating on Rodriguez. The soldiers of the invasion force were to consist of British and Indian troops, and led by General John Abercromby (although they were also accompanied by Rear-Admiral William O'Bryen Drury, whom Bertie ordered to return to Madras before the invasion) while the naval forces to protect and support the invasion force were to be provided by Bertie from the Cape of Good Hope. These forces were to gather at Rodriguez in preparation for the invasion. The landings themselves were planned by Rowley and Keating, who relied on Willoughby's intimate knowledge of the coastline of Isle de France and a series of careful surveys of the reefs that surrounded the island to select a landing site.\nThe chosen point was at Grand Baie, on the northwestern coastline approximately  north of the island's capital Port Napoleon. The intention was to prepare an elite force of 1,555 men formed from the grenadier and light companies of the regiments attached to the invasion. This vanguard would storm ashore and advance rapidly towards the capital closely supported by a naval brigade and Royal Marines units, followed by the main body of the army of 5,293 soldiers. The entire force would have logistical assistance and artillery support from Royal Navy ships that would shadow the advance along the coast. The army's orders were to seize Port Napoleon and capture Governor Charles Mathieu Isidore Decaen, action which, it was hoped, would be sufficient to force the surrender of the entire island. Subsequent landings would be made to the west of the capital if French resistance was stronger than expected.\nOn 15 October, Bertie arrived at Rodriguez with his squadron from Cape Town. On 3 November, the Bombay Army arrived, followed on 6 November by the Madras Army. On Rodriguez the invasion plans were finalised, HMS Staunch sent to reconnoitre the northern coastline of Isle de France to seek a suitable beach. Command of the landing and the naval support role was given to Captain Philip Beaver, who had a reputation as an expert in amphibious operations. Keating was placed in command of the vanguard of the land force, with Captain William Augustus Montagu commanding the naval brigade, and Abercromby in overall charge. Rowley would remain offshore in HMS Boadicea, as would Bertie, who took Africaine as his flagship.\nThe French response to the impending British invasion was to mobilise the island's 10,000-strong militia. Despite their large numbers, this force was untrained and poorly armed and motivated. Decaen himself recognised that they would be unreliable in the face of an attack by British regulars. He also bolstered his forces by attempting to recruit volunteers from among the hundreds of prisoners of war held in the island's prisons (a principal cause of the food shortages on Isle de France). Over 500 volunteers agreed to join his army, the majority of them Irishmen, who were promised French assistance in obtaining Ireland's independence from British rule. Altogether, Decaen could muster 1,300 regulars to defend the capital, which he placed under the command of General Edmé-Martin Vandermaesen.\nInvasion\nOn 22 November 1810, all the British troops and ships were assembled and Bertie ordered the squadron to rendezvous off Grand Baie, which was reached early on 29 November despite adverse winds. The vanguard landed unopposed, their landing craft supported by ship's boats carrying cannon, supplemented by the firepower of the larger ships offshore. Although there was some disruption in the early stages of the attack caused by adverse weather conditions, by 21:00 the entire vanguard and naval brigades were ashore. The landing had been effected with just two casualties, both men who died of natural causes. Keating took command of the vanguard and advanced on Fort Malartic, the garrison retreating before his troops and blowing up the fort as they left.\nDuring the morning of 30 November, Keating pushed southwards to the River Tombeau which overlooked Port Napoleon, his front units skirmishing with French defenders across the river, during which Decaen himself was lightly wounded by a musket ball. The bridge over the river had been held by a force of militia, but they fell back before the British advance and failed to properly demolish the bridge, allowing Keating to rapidly cross and threaten Port Napoleon. At Grand Baie, the remainder of the invasion force were coming ashore, so that the entire army had landed by midday, although Abercromby himself elected to stay with Beaver on HMS Nisus and follow the advance from offshore.\nOn 1 December, Vandermaesen made a stand before Port Napoleon, defending the entrance to the town with his available regular troops and some small cannon. Keating attacked him, engaging the French front while a second attack by Madras sepoys outflanked the French line and disrupted it, allowing a successful frontal assault. With their defences breached the French fell back and on 2 December Decaen proposed a ceasefire, which was accepted. The following day Decaen surrendered, although with guarantees that he and the garrison would be repatriated and allowed to retain their personal arms and standards. Although some in the British force were unhappy with the terms of the surrender, the British commanders were relieved to have the invasion complete before the hurricane season began later in the month. The danger to the 70 ships in the British fleet from such a storm was serious and it was vitally important that they be in a safe harbour when the hurricane season began.\nAftermath\nThe surrender of Isle de France marked the final British operation of the campaign and the capture of the last French territory east of Africa. The island was restored to its pre-1715 name of Mauritius and the towns renamed under Decaen (such as Port Napoleon) were restored to their pre-Revolutionary names. Governor Robert Townsend Farquhar of Isle Bourbon was placed in administrative control of the island, Isle Bourbon taken over by Keating. Although the French garrison was repatriated, the invaders captured six French frigates (Manche, Astrée, Bellone and Minerve, Iphigénie and Néréide) and several smaller warships (the corvette Victor, the brig Entreprenant, the aviso Lutin and schooner-aviso Mouche n°23) in the various harbours of Isle de France, as well as 24 merchant ships. ''Lloyd's List published a list of all the vessels captured, military and civilian, on 15 February 1811. The British also seized 209 heavy cannon.\nThe British recaptured the East Indiamen Ceylon, Charlton and United Kingdom, which the French were using as prison ships. Among the hundreds of prisoners released were the survivors of the Battle of Grand Port and the crews and passengers from the Indiamen captured over the previous year. Among the French prisoners, were discovered 12 deserters from the British Army or Royal Navy (at least 40 successfully passed as Frenchmen and were repatriated to France). These 12 were put on trial on their return to Britain: two were later hanged and five transported. Rewards were forthcoming, particularly for Bertie, who was made a baronet. This created a scandal when Admiral Drury accused Bertie of taking credit for the work of others (principally Drury himself). Mauritius, unlike Isle Bourbon, remained in British hands after the end of the war in 1814 and was retained as part of the British Empire until granted independence in 1968.\nAlthough there were no further British operations in the region, the Mauritius campaign was not quite over. When news of the victory at Grand Port had reached France, there was pressure to resupply and reinforce the victorious squadron under Hamelin and a small squadron commanded by Commodore François Roquebert was ordered to sail for Isle de France. This squadron included three frigates: Renommée, Clorinde and Néréide'' and carried extensive stores to repair and rearm Hamelin's frigates. It was not until February 1811 that Roquebert's squadron departed from Brest for Mauritius, and the journey from France to the Indian Ocean was a long one. Discovering that the island was in British hands, Roquebert attempted to return to France but was chased by the frigates stationed on Mauritius and captured at the action of 20 May 1811. Only Clorinde escaped the British pursuit.\nOrders of battle\n{| class=\"wikitable\" width=100%\n|-valign=\"top\"\n!colspan=\"6\" bgcolor=\"white\"|Admiral Bertie's squadron\n|- valign=\"top\"|- valign=\"top\"\n! width=20%; align= center rowspan=1 |  Ship\n! width=15%; align= center rowspan=1 |  Rate\n! width=5%; align= center rowspan=1 |  Guns\n! width=5%; align= center rowspan=1 |  Navy\n! width=25%; align= center rowspan=1 |  Commander\n! width=29%; align= center rowspan=1 | Notes\n|- valign=\"top\"\n| align= left | HMS Illustrious\n| align= center | Third rate\n| align= center | 74\n| align= center |\n| align= left | Captain William Robert Broughton\n| align= left |\n|- valign=\"top\"\n| align= left |\n| align= center | Fifth rate\n| align= center | 44\n| align= center |\n| align= left | Captain James Caulfield\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Africaine\n| align= center | Fifth rate\n| align= center | 38\n| align= center |\n| align= left |Vice-Admiral Albemarle BertieCaptain Charles Gordon\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Boadicea\n| align= center | Fifth rate\n| align= center | 38\n| align= center |\n| align= left | Captain Josias Rowley\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Nisus\n| align= center | Fifth rate\n| align= center | 38\n| align= center |\n| align= left |Captain Philip Beaver\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Clorinde\n| align= center | Fifth rate\n| align= center | 38\n| align= center |\n| align= left |Captain Thomas Briggs\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Menelaus\n| align= center | Fifth rate\n| align= center | 38\n| align= center |\n| align= left |Captain Peter Parker\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Nereide\n| align= center | Fifth rate\n| align= center | 38\n| align= center |\n| align= left |Captain Robert Henderson\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Phoebe\n| align= center | Fifth rate\n| align= center | 36\n| align= center |\n| align= left |Captain James Hillyar\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Doris\n| align= center | Fifth rate\n| align= center | 36\n| align= center |\n| align= left |Captain William Jones Lye\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Cornelia\n| align= center | Fifth rate\n| align= center | 32\n| align= center |\n| align= left |Captain Henry Folkes Edgell\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Psyche\n| align= center | Fifth rate\n| align= center | 32\n| align= center |\n| align= left |Captain John Edgcumbe\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Ceylon\n| align= center | Fifth rate\n| align= center | 32\n| align= center |\n| align= left |Commander James Tompkinson\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Hesper\n| align= center | Brig\n| align= center | 18\n| align= center |\n| align= left |Commander David Paterson\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Eclipse\n| align= center | Brig\n| align= center | 18\n| align= center |\n| align= left |Lieutenant Henry Lynne\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Hecate\n| align= center | Brig\n| align= center | 18\n| align= center |\n| align= left |Lieutenant George Lucas Rennie\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Acteon\n| align= center | Brig\n| align= center | 16\n| align= center |\n| align= left |Lieutenant Ralph, Viscount Neville\n| align= left |\n|- valign=\"top\"\n| align= left | HMS Staunch\n| align= center | Brig\n| align= center | 14\n| align= center |\n| align= left | Lieutenant Hector Craig (acting)\n| align= left |\n|- valign=\"top\"\n| align= left | Emma\n| align= center | Government armed ship\n| align= center |\n| align= center |\n| align= left | Lieutenant Benjamin Street (acting)\n| align= left |\n|- valign=\"top\"\n| align= left | Egremont\n| align= center | Government sloop\n| align= center |\n| align= center |\n| align= left | Lieutenant Robert Forder\n| align= left |\n|- valign=\"top\"\n| align= left | Farquhar\n| align= center |\n| align= center |\n| align= center |\n| align= left | Midshipman Harvey\n| align= left |\n|- valign=\"top\"\n| align= left | Mouche\n| align= center | Schooner-aviso\n| align= center | 1\n| align= center |\n| align= left |\n| align= left |  had captured Mouche No. 28 on 15 November 1810 near Isle Bonaparte. The British recommissioned her for the attack on Île de France. Hesper captured her as she was carrying dispatches to Isle de France. A boarding party in Hespers cutter suffered three men wounded while boarding Mouche; French casualties were two men killed and five wounded, one of whom was Mouche No.28s commander.}}\n|-\n|- valigh=\"top\"\n|colspan=\"6\" align=\"left\"|Admiral Bertie's naval forces also included five vessels from the Bombay Marine the British East India Company's naval arm.\n|-\n|- valign=\"top\"|- valign=\"top\"\n! width=20%; align= center rowspan=1 |  Ship\n! width=15%; align= center rowspan=1 |  Rate\n! width=5%; align= center rowspan=1 |  Guns\n! width=5%; align= center rowspan=1 |  Navy\n! width=25%; align= center rowspan=1 |  Commander\n! width=29%; align= center rowspan=1 | Notes\n|- valign=\"top\"\n| align= left | Malabar\n| align= center | Ship\n| align= center | 20\n| align= center |\n| align= left |\n| align= left |\n|- valign=\"top\"\n| align= left |\n| align= center | Brig\n| align= center | 14–16\n| align= center |\n| align= left |\n| align= left |\n|- valign=\"top\"\n| align= left |\n| align= center | Brig\n| align= center | 10\n| align= center |\n| align= left |\n| align= left |\n|- valign=\"top\"\n| align= left |\n| align= center | Brig\n| align= center | 10\n| align= center |\n| align= left |\n| align= left |\n|- valign=\"top\"\n| align= left |\n| align= center | Brig\n| align= center | 10\n| align= center |\n| align= left |\n| align= left |\n|- valign=\"top\"\n|colspan=\"6\" align=\"left\"|In addition to the above warships, the invasion fleet included approximately 50 small transport ships initially under the command of Rear-Admiral William O'Bryen Drury, who was sent back to Madras before the invasion.\nThe British Army troops attached to the force included sepoys and garrison artillery from Madras and soldiers from the 12th Foot, 14th Foot, 19th Foot, 22nd Foot, 33rd Foot, 56th Foot, 59th Foot, 69th Foot, 84th Foot, 87th Foot, 89th Foot and one troop of the 25th Light Dragoons, commanded by General John Abercromby and Lieutenant Colonel Henry Keating. Also attached was a naval brigade of volunteer sailors and Royal Marines under Captain William Augustus Montagu.\n|- valign=\"top\"\n|colspan=\"6\" align=\"left\"|Sources:James Vol. 5, p.&nbsp;325, Clowes, p.&nbsp;294, Woodman, p.&nbsp;291–292, ''Lloyd's List, 15 February 1811 [http://www.1812privateers.org/LLOYDS/1811/02-15-1811.jpg] - accessed 23 November 2013\n|-valign=\"top\"\n|-\n|}\n{| class=\"wikitable\" width=100%\n|-valign=\"top\"\n!colspan=\"6\" bgcolor=\"white\"|French squadron\n|- valign=\"top\"|- valign=\"top\"\n! width=20%; align= center rowspan=1 |  Ship\n! width=15%; align= center rowspan=1 |  Rate\n! width=5%; align= center rowspan=1 |  Guns\n! width=5%; align= center rowspan=1 |  Navy\n! width=25%; align= center rowspan=1 |  Commander\n! width=29%; align= center rowspan=1 | Notes\n|- valign=\"top\"\n| align= left | Bellone\n| align= center | Fifth rate\n| align= center | 40\n| align= center |\n| align= left |\n| align= left | Captured. Commissioned into the Royal Navy as HMS Junon\n|- valign=\"top\"\n| align= left | Astrée\n| align= center | Fifth rate\n| align= center | 40\n| align= center |\n| align= left | Captain Pierre Bouvet\n| align= left | Captured. Commissioned into the Royal Navy as HMS Pomone\n|- valign=\"top\"\n| align= left | Minerve\n| align= center | Fifth rate\n| align= center | 48\n| align= center |\n| align= left |\n| align= left | Captured. Broken up as unfit for service.\n|- valign=\"top\"\n| align= left | Manche\n| align= center | Fifth rate\n| align= center | 40\n| align= center |\n| align= left |\n| align= left | Captured. Broken up as unfit for service.\n|- valign=\"top\"\n| align= left | Iphigénie\n| align= center | Fifth rate\n| align= center | 36\n| align= center |\n| align= left |\n| align= left | Captured. Returned to service as HMS Iphigenia.\n|- valign=\"top\"\n| align= left | Néréide\n| align= center | Fifth rate\n| align= center | 36\n| align= center |\n| align= left |\n| align= left | Captured. Laid up as unfit for service and sold for breaking up in 1816.\n|- valign=\"top\"\n| align= left | Revenant\n| align= center | Brig\n| align= center | 18\n| align= center |\n| align= left |\n| align= left | Captured. Broken up as unfit for service.\n|- valign=\"top\"\n| align= left | Entreprenant\n| align= center | Brig\n| align= center | 18\n| align= center |\n| align= left |\n| align= left | Captured. Broken up as unfit for service.\n|- valign=\"top\"\n| align= left | Aurore\n| align= center | Brig\n| align= center | 14\n| align= center |\n| align= left |\n| align= left | HCS Aurora, captured September 1810 by Iphigénie and Astrée; returned to the service of the Bombay Marine\n|- valign=\"top\"\n| align= left | Mouche No.23\n| align= center | Schooner-aviso\n| align= center | 1\n| align= center |\n| align= left |\n| align= left | HMS Nereide had captured her on 2 June 1810, and Astrée had recaptured her on 30 August.\n|-\n|- valign=\"top\"\n|colspan=\"6\" align=\"left\"|Note: At the time of the invasion, only two of the above ships were serviceable and as a result many ships were commanded by temporary officers or none at all. Records on which French officers commanded which ships are incomplete, and so only those that are known are inserted in the above table. In addition to the warships, none of which participated in the campaign, Governor Charles Decaen could muster 1,300 French Army troops, including 500 volunteers from among the British prisoners of war, and 10,000 unreliable local militia.\n|- valign=\"top\"\n|colspan=\"6\" align=\"left\"|Sources: James Vol. 5, p.&nbsp;325, Clowes, p.&nbsp;294, 560, Lloyd's List'', 15 February 1811 [http://www.1812privateers.org/LLOYDS/1811/02-15-1811.jpg] - accessed 23 November 2013\n|-valign=\"top\"\n|-\n|}\nNotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}