{
  "content": [
    {
      "type": "text",
      "text": "# Invasion of Cuba (1741)\n\n| combatant2        =  Spain\n| commander1        =  Edward Vernon\n| commander2        =  Francisco de la Vega\n| strength1         = 4,000 regulars & militia9 ships of the line12 frigates & other ships40 transports & store-ships\n| strength2         = 950 regulars and militiaunknown naval forces\n| casualties1       = 3,445 killed, wounded or missing\n| casualties2       = 400 killed or wounded3 warships captured\n}}\nThe invasion of Cuba took place between 4–5 August and 9 December 1741 during the War of Jenkins' Ear. A combined army and naval force under the command of Admiral Edward Vernon and Major-General Thomas Wentworth arrived off Cuba and fortified positions around their landing site at Cumberland Bay. Despite facing no serious opposition, neither commander felt prepared to advance on the Spanish settlement at Santiago de Cuba. Harassed by Spanish raids and with a mounting sick list, the British finally evacuated the island after several months of inactivity.\nBackground\nVernon had made an unsuccessful attempt to capture Cartagena in 1741, and after his repulse he directed the fragments of his sickly and dispirited followers against the island of Cuba. The south and east of Cuba were so little populated, and so far from the capital, Havana, that they might have made a permanent establishment there.\nVernon's expedition\nThe land forces consisted of the remnants of the troops from Cartagena, some 3,000 British and American troops augmented by 1,000 Jamaican soldiers.\nVernon left Port Royal to capture Santiago de Cuba with the following ships:\n*  80 guns (Flagship)\n*  80 guns\n*  70 guns\n*  70 guns\n*  60 guns\n*  60 guns\n*  60 guns\n*  50 guns\n* HMS Tiger 50 guns\n*  20 guns\n*  20 guns\n*  20 guns\n*  (Bomb vessel)\n*  (Fireship)\n*  (Fireship)\n*  (Fireship)\n*  (Sloop)\n*  (Sloop)\n*  (Hospital ship)\n* HMS Scarborough (Hospital ship)\n* HMS Pompey (Tender)\n* 40 Transports carrying 4,000 troops under Major-General Thomas Wentworth\nBattle\nand the intrenchments made on the adjacent hills, 1741]]\nOn the night of 4–5 August, the British force, bolstered by 1,000 reinforcements from Jamaica landed in three different beaches of the Guantanamo Bay. Without opposition, they marched against the village of La Catalina. However, the British, 105 kilometres (65&nbsp;mi) short of their objective, slowed down three days later because of the growing concerns of their commander, Major-General Thomas Wentworth.\nSantiago's Governor Francisco Caxigal de la Vega, garrison commander Carlos Riva Agüero, and local militia Captain Pedro Guerrero had only 350 regulars and 600 militia to hand and so retreated from the British. Nevertheless, Wentworth's army became paralyzed by fatigue and disease, spending the next four months encamped, being sporadically raided by Spanish forces. Vernon, disgusted at his colleague's inactivity, but unwilling to risk any part of the fleet against the town, sent warships to cruise independently until Wentworth's sick list grew so long—2,260 soldiers being struck with fever by 5 December—that the expedition was re-embarked, setting sail at dawn on 9 December and returning to Port Royal ten days later.\nAftermath\nAdmiral Vernon's enterprise accomplished nothing but the loss of many of his soldiers and his own disgrace. Vernon was forced to return to Britain in 1742.\nReferences\nBibliography\n* Pares, Richard. War and Trade in the West Indies, Oxford university press, 1936\n* Richmond, H.W.. The Navy In the War of 1739-48, Vo; 1. Cambridge University Press, 1920.\n* David E. Marley, Wars of the Americas; A Chronology of Armed Conflict in the New World, 1492 to the Present ABC-Clio Inc, 1998\n* Beatson, Robert. Naval and Military memoirs of Great Britain from 1727 to 1783, London, Vol.I and Vol.III, 1801.\n* Coke, Thomas. A History of the West Indies: Containing the Natural, Civil and Ecclesiastical History of Each Island London, 1810."
    }
  ]
}