{
  "content": [
    {
      "type": "text",
      "text": "# Invasion of Kagera\n\n| date        = 25 October 1978 – January 1979\n| place       = Kagera Salient, Tanzania\n| result      = Tanzanian victory\n| territory   = Status quo ante bellum\n| combatant1  =\nUganda Army deserters\n| combatant2  =\n| commander1  =  Morris Singano Tumainiel Kiwelu James Luhanga Mwita Marwa Silas Mayunga John Butler Walden\n| commander2  =  Yusuf Gowon Marajani Juma Butabika Abdu Kisuule Abdulatif Tiyua\n| units1      = 202nd Brigade206th Brigade207th BrigadeSouthern Brigade\n| units2      = Malire BattalionGonda BattalionSimba Battalion2nd Paratrooper BattalionMarine RegimentKifaru RegimentArtillery & Signals RegimentUganda Army Air Force\n| strength1   = 8,000–10,000 Tanzanian soldiers 800 Mozambican soldiers\n| strength2   = 2,000–3,000 soldiers\n| casualties1 =\n| casualties2 =\n| casualties3 =\n| campaignbox =\n}}\nIn October 1978 Uganda invaded the Kagera Salient in northern Tanzania, initiating the Uganda–Tanzania War. The Ugandans met light resistance and in November President Idi Amin of Uganda announced the annexation of all Tanzanian land north of the Kagera River. The Tanzanians organised a counter-offensive later in November and successfully ejected the Ugandan forces from their country.\nRelations between Tanzania and Uganda had been tense since then-Colonel Amin overthrew Ugandan President Milton Obote in 1971. Tanzanian President Julius Nyerere supported Obote and backed an unsuccessful attempt by him to regain power in 1972. Uganda also disputed its border with Tanzania, claiming that the Kagera Salient—a 1,865 square kilometre (720 sq mi) stretch of land between the official border and the Kagera River  to the south—should be ceded to Uganda. Tensions remained high through 1978, when Amin's regime started rapidly declining due to economic problems and dissent in the armed forces. In early October Ugandan forces began making small incursions into the Kagera region. On 25 October the Uganda Army launched a large attack over the border, but was repulsed by Tanzanian artillery. The Ugandans attacked again on 30 October, quickly overwhelming the small Tanzanian contingent in the region and completely occupying the Kagera Salient. Amin declared that Uganda was annexing the region, and shortly thereafter the Ugandans destroyed the only bridge over the Kagera River, easing their commanders' concerns about a Tanzanian counter-offensive. The Uganda Army pillaged the land, stealing cattle, automobiles, and personal belongings from homes. Approximately 1,500 civilians were shot and killed, and thousands more fled south.\nTanzania was caught unprepared for war but Nyerere—after being assured by his commanders of his country's military capability to react—ordered a mobilisation and instructed the Tanzania People's Defence Force (TPDF) to prepare a counter-offensive. Mozambique sent a battalion to Tanzania as a gesture of support. The Organisation of African Unity attempted to foster a diplomatic solution but Nyerere rejected attempts at mediation. Uganda Army officers concentrated on looting and ignored intelligence reports of Tanzanian plans, and thus were caught unprepared when the TPDF initiated Operation Chakaza. Most Ugandan soldiers fled in the face of artillery bombardment, and Amin soon thereafter declared that he was unconditionally withdrawing the Uganda Army from Kagera, a claim which was bitterly contested by Tanzania. Tanzanian troops used pontoons and a Bailey bridge to move heavy equipment across the river and probed the area. By January 1979 the TPDF had retaken the Kagera Salient. Nyerere did not initially intend on expanding the war beyond expelling the Ugandans from Tanzanian territory. After Amin failed to renounce his claims to Kagera and the OAU failed to condemn the Ugandan invasion, Nyerere ordered the TPDF to attack Uganda, resulting in Amin's overthrow in April. Following the conclusion of the war, the Tanzanian Government undertook efforts to rehabilitate Kagera, but social services and the standard of living for locals remained diminished for many years. The Uganda–Tanzania War is remembered in Tanzania as the Kagera War.\nBackground\n(pictured) became the President of Uganda following a 1971 coup.]]\nIn 1971 Colonel Idi Amin seized power in Uganda following a military coup that overthrew President Milton Obote, precipitating a deterioration of relations with neighbouring Tanzania. Tanzanian President Julius Nyerere had close ties with Obote and had supported his socialist orientation. Amin installed himself as President of Uganda and ruled the country as a repressive dictatorship. Nyerere withheld diplomatic recognition of the new government and offered asylum to Obote and his supporters. Uganda twice launched military attacks against the Tanzanian border that year. With the approval of Nyerere, Ugandan exiles organised a small army of guerrillas, and attempted, unsuccessfully, to invade Uganda and remove Amin in 1972.}} Amin blamed Nyerere for backing and arming his enemies, and retaliated by bombing Tanzanian border towns. Though his commanders urged him to respond in kind, Nyerere agreed to mediation overseen by the President of Somalia, Siad Barre, resulting in the signing of the Mogadishu Agreement, which stipulated that Ugandan and Tanzanian forces had to withdraw to positions at least 10 kilometres (6.2 miles) away from the border and refrain from supporting opposition forces that targeted each other's governments. Nevertheless, relations between the two presidents remained tense; Nyerere frequently denounced Amin's regime, and Amin made repeated threats to invade Tanzania. During the same time, relations between Tanzania and Kenya grew sour, and the East African Community subsequently collapsed. Uganda also disputed its border with Tanzania, claiming that the Kagera Salient—a 1,865 square kilometre (720 sq mi) stretch of land stretch of land between the official border and the Kagera River 29 km (18 mi) to the south—should be ceded to Uganda, maintaining that the river made for a more logical border. The border had originally been negotiated by British and German colonial officials before World War I.\nMeanwhile, in Uganda, Amin announced an \"Economic War\" in which thousands of ethnic Asians were expelled from the country and their businesses placed under the management of Africans. The reform had disastrous consequences for the economy, which were further exacerbated by a United States boycott of Ugandan coffee on account of the government's failure to respect human rights. At the same time, Amin expanded the power of the armed forces in his government, placing many soldiers in his cabinet and providing those loyal to him with patronage. Most of the beneficiaries of his actions were Muslim northerners, particularly those of Nubian and Sudanese extraction, who were increasingly recruited into the army. Amin violently purged members of southern ethnic groups from the armed forces and executed political opponents. In 1977 a split in the Uganda Army developed between supporters of Amin and soldiers loyal to the Vice-President of Uganda, Mustafa Adrisi, who held significant power in the government and wanted to purge foreigners from the military. In April 1978 Adrisi was severely injured in a suspicious car accident. When he was flown out of the country for treatment, Amin stripped him of his ministerial portfolios. He also announced the arrest of multiple police officials, and during the following month he dismissed several ministers and military officers. The shakeup strained Amin's narrow base of power in the military that had been declining in the face of the worsening economic situation, which eliminated patronage opportunities. Fearing for his personal safety and less confident in his charismatic abilities to diffuse the growing tension, Amin began withdrawing from the public sphere and conducting less meetings with his troops. At around the same time he began accusing Tanzania of violating Uganda's border. In May, Amin falsely claimed that Tanzanian troops had attacked the Rakai District. He also appealed to his allies, President Gaafar Nimeiry of Sudan and leader Muammar Gaddafi of Libya to intervene and resolve the \"potentially explosive\" situation, claiming that Tanzanian forces were moving within 4.8 km (3 mi) of Ugandan border towns. In July, Radio Uganda erroneously declared that Obote was planning another Tanzanian-supported overthrow attempt. Nyerere ignored the allegations.\nIn reality, since May, Ugandan troops and military equipment had been shifted towards the border at Amin's direction and in violation of the Mogadishu Agreement. Only one Tanzanian company was near the border region and Obote's irregular troops were in a refugee camp. In July, Brigadier Yusuf Himid of the Tanzania People's Defence Force (TPDF) warned Uganda to cease its \"repeated provocations\" against Tanzania. As tensions with Tanzania increased, a number of Amin's high-ranking military commanders began to advocate war with the neighbouring state. They were opposed by other Ugandan generals who argued that Uganda Army was not ready for an open conflict. Though desiring to annexe part of Tanzania for some time, Amin initially sided with the more cautious commanders. In August Amin dispatched squads of security agents to eliminate a battalion planning to mutiny in favour of Adrisi. The battalion was tipped off to the attack and managed to ambush and kill Amin's forces. By early October, several mutinies had reportedly broken out across Uganda. Parts of the Suicide Battalion }} revolted at Bondo, while other uprisings took place in Tororo, Masaka, Mbarara, Mutukula, and Kampala, where Amin was allegedly ambushed and almost killed by revolting soldiers. The revolts were defeated by troops loyal to Amin, but many mutineers managed to flee, while unrest and confusion spread in the Uganda Army.\nPrelude\n(red) and Tanzania (blue) in Africa ]]\nWar broke out between Uganda and Tanzania in October 1978, with several Ugandan attacks across the border culminating in the invasion of the Kagera Salient. The circumstances surrounding the outbreak of the war are not clear, and numerous differing accounts of the events exist. Obote wrote that the decision to invade Kagera was \"a desperate measure to extricate Amin from the consequences of the failure of his own plots against his own army.\" Ugandan refugees claimed that several dissatisfied Ugandan officers met at Kabamba on 27 October and drafted a 12‐point petition to Amin. The document called for the end of corruption, factionalism, and favouritism towards Nubian troops; the curtailing of powers of the State Research Bureau, Amin's secret police; the reinstatement of Adrisi and former army chief of staff Isaac Lumago; the enforcement of religious tolerance; and an end of the alliance with Arab powers. According to the refugees, the President had invaded Tanzania to distract the military from this petition.\nSeveral Uganda Army soldiers, including Colonel Abdu Kisuule, blamed Lieutenant Colonel Juma Butabika for starting the war. Kisuule accused Butabika of engineering an incident at the border to create a pretext for invading Tanzania. According to Amin's son, Jaffar Remo, rumours of a potential Tanzanian invasion led members of the Ugandan high command to call for a preemptive attack on Tanzania. Several other Uganda Army officers have offered more mundane explanations for the invasion, according to which isolated conflicts along the border resulted in a spiral of violence that culminated in open warfare. Among the incidents identified as possible start points for the war are cases of cattle rustling, tribal tensions, a fight between a Ugandan woman and a Tanzanian woman at a market, and a bar fight between a Ugandan soldier and Tanzanian soldiers or civilians. Several Ugandan soldiers who endorsed the bar fight theory disagreed on the confrontation's exact circumstances, but agreed that the incident occurred on 9 October in a Tanzanian establishment. They also agreed that after Butabika was informed of the altercation, he unilaterally ordered his unit, the Malire Battalion, to attack Tanzania in reprisal. The soldiers stated that Amin was not informed of this decision until later and went along with it to save face. One Ugandan commander, Bernard Rwehururu, stated that Butabika lied to Amin about his reasons for attacking Kagera, claiming that he was repulsing a Tanzanian invasion. According to American journalists Tony Avirgan and Martha Honey, the bar incident occurred on 22 October, when a drunken Ugandan intelligence officer was shot and killed by Tanzanian soldiers after firing on them. That evening Radio Uganda declared that the Tanzanians had abducted a Ugandan soldier, and reported that Amin threatened to do \"something\" if he was not returned.\nAnother theory describes the invasion as the result of Ugandan troops chasing mutineers over the Tanzanian border. There are several different variations of this account, which were mostly circulated by non-Ugandan sources. Ugandan diplomat Paul Eitang and the local managing director for Royal Dutch Shell reported that soldiers of the Simba Battalion had shot new Sudanese recruits and that when other Ugandan forces were sent to contain them, they fled over the border on 30 October. The New York Times reporter John Darnton pieced together several refugee accounts which suggested that Amin had possibly planned an invasion of Tanzania to purge followers of Adrisi from the military. According to this version of events, the invasion was intended as a suicide mission, and any returning troops would be killed upon re-entering Uganda. When Simba Battalion deputy commander Lieutenant Colonel Juma Adek was ordered to prepare for the invasion, he suspected the President's plan and mutinied with some of his troops, attacking Sudanese members of the Simba Battalion.\nOther versions attribute the mutinies to elements of the Chui Battalion or the Suicide Battalion. Soviet ambassador to Uganda E.V. Moussikyo claimed that pro-Amin and pro-Adrisi elements of the Simba Battalion and Chui Battalion had fought each other. Amin sent SRB agents to suppress the unrest among the Chui Battalion, only for them to be murdered, whereupon the President attempted to send the Chui Battalion mutineers to crush the Simba Battalion mutineers. However, the two groups banded together, and then fought against the Malire Regiment. Moussikyo stated that this version of the events was relayed to him by Soviet military advisers in Mbarara. Ugandan historian Phares Mukasa Mutibwa argued that the Simba Battalion initially mutinied under the influence of officers who wanted to restore a civilian government. When Amin sent the Chui Battalion to crush the rebellion, the unit joined the mutineers. He then ordered the Marine Regiment and new recruits to crush the uprising, but they failed. Political scientist Okon Eminue stated that about 200 mutineers \"reportedly\" took refuge in the Kagera Salient. According to this version of events, Amin ordered the Simba Battalion and the Suicide Battalion to pursue the deserters, resulting in the invasion of Tanzania. A Ugandan soldier interviewed by Drum asserted that the initial actions of the invasion were in fact a three-way fight between loyalist Uganda Army soldiers, Ugandan deserters, and Tanzanian border guards, with most of the deserters and a number of Tanzanians being killed. A few surviving mutineers reportedly found shelter in Tanzanian villages. Researchers Andrew Mambo and Julian Schofield discounted this theory, noting that the battalions that are said to have mutinied remained relatively loyal to Amin's cause throughout the war, and instead supported the notion that Butabika escalated a dispute at the border into an invasion.\nThe TPDF had received only very limited intelligence about a possible Ugandan invasion, and was unprepared for this eventuality, as the Tanzanian leadership generally believed that Amin would not consider attacking Tanzania while his own country was affected by political, economic, and military instability. Beyond the demilitarised zone established by the Mogadishu Agreement, there were almost no defences. Tanzania had tense relations with Zaire, Kenya, and Malawi, and the only forces defending the land along the Ugandan border was the 202nd Brigade based in Tabora. It was led by an elderly commander, Brigadier Himid. Near the frontier was the understrength 3rd Battalion, led by Lieutenant Colonel Morris Singano. Its main responsibilities were to conduct reconnaissance and combat smuggling. In early September the Tanzanians reported unusually large numbers of Ugandan patrols near the border—some equipped with armoured personnel carriers—and a high volume of air reconnaissance flights. By the middle of the month the Ugandan aircraft began crossing into Tanzanian airspace. Singano reported the unusual activity to the brigade headquarters in Tabora, and was assured that anti-aircraft guns would be sent to him. These never arrived, and by October Singano's warnings had become increasingly panicked.\nInitial actions\narmoured personnel carriers (example in Ugandan service pictured).]]\nIn the middle of the day on 9 October Ugandan troops made their first incursion into Tanzania when a motorised detachment moved into Kakunyu and set two houses on fire. A Tanzanian observation post witnessed the event and contacted Singano via radio, who subsequently ordered his artillery to open fire on Ugandan positions. A Ugandan armoured personnel carrier and truck were destroyed, and two soldiers were killed. Ugandan artillery returned fire but caused no damage. In the evening Radio Uganda reported that a Tanzanian invasion had been repulsed. The Tanzanian Foreign Ministry denied the allegation on 12 October.\nOn 10 October Ugandan MiG fighters bombed Tanzanian forests. Ugandan artillery continuously bombarded Tanzanian territory, so Singano requested that his 120mm (4.7in) mortars—the largest calibre artillery he had—be moved to the front line. They were brought into action four days later, and the Ugandan guns subsequently stopped firing. Over the next few days both sides exchanged artillery fire, gradually expanding across the whole border. Tanzanian leaders felt that Amin was only making provocations. Singano sent increasingly urgent requests for help, and was eventually told that reinforcements would be sent. Muzamir Mule, a Ugandan Lieutenant and tank commander at the time, would later claim that he had led a detachment of three tanks to attack a Tanzanian border post on Butabika's orders in the night of 10 October.\nOn 18 October Ugandan MiGs bombed Bukoba, the capital of the West Lake Region. Despite only facing ineffectual Tanzanian anti-aircraft fire, the bombings caused little damage, but the explosions shattered windows caused panic. The following day West Lake Regional Commissioner Mohamed Kissoky hosted a meeting with government and Chama Cha Mapinduzi (CCM, the state political party) officials. He told them that the border conflict was the result of a misunderstanding and encouraged them to reiterate that \"we are great friends with Uganda, and Idi Amin has been at that border shaking hands with our people.\" Despite Kissoky's appeal for calm, Bukoba residents continued to panic, their anxieties worsened by exaggerated stories of battles from fleeing villagers from the north. Aside from Kissoky, Tanzanian leaders did not make any public comments about the conflict, and Radio Tanzania did not report on it. In contrast, Radio Uganda reported a Tanzanian invasion of Ugandan territory with accounts of fictional battles, and detailed that Tanzanian troops had advanced 15 km (9.3 mi) into Uganda, killing civilians and destroying property. Amin told residents in Mutukula that in spite of the \"attack\", he still hoped for good relations with Tanzania. At the same time, Radio Uganda's Kinyankole language broadcasts—which were closely monitored and understood by West Lake residents—severely criticised Nyerere and claimed that Tanzanians wished to fall under Ugandan jurisdiction to escape the former's rule. Meanwhile, the Ugandan regime came under increased internal strain. Dozens of soldiers of the Masaka garrison deemed disloyal were executed, rival State Research Bureau agents engaged in a shootout in Kampala, and more agents were killed while attempting to arrest a former finance minister. Amin also visited Egypt and Libya, requesting military assistance from both countries; Egyptian President Anwar Sadat reportedly offered some equipment, whereas Libyan Leader Muammar Gaddafi promised soldiers to support Uganda.\nInvasion\nFirst attack\n, including T-55 tanks (example pictured) ]]\nAt dawn on 25 October Journalist Dominique Lagarde stated that fighting began when the Uganda Army started to shell Bukoba on 27 October. }} Tanzanian observers equipped with a telescope noticed large amounts of Ugandan vehicular activity in Mutukula. Singano received radio reports on the situation at his headquarters in Kyaka, 32 km (20 mi) south of the border and just south of the Kagera River. Several minutes later three other observation posts reported Ugandan manoeuvres on the other side of the border. Singano went to a hill near Kyaka from where he witnessed Ugandan artillery open fire. Fifteen minutes later he received a radio message from an understrength platoon of 20 TPDF soldiers opposite Mutukula, who reported that they were under attack and exchanging heavy fire with the Uganda Army. All other Tanzanian soldiers broke under fire and fled towards the Kagera River. Realising that an invasion was underway, Singano ordered the platoon near Mutukula to retreat to Kyaka. Over 2,000 Ugandan soldiers under the command of Lieutenant Colonel Marajani, Lieutenant Colonel Hussein Marijan was known to have served as Simba Battalion commander along the Uganda-Tanzania border in 1977. }} Butabika, and Kisuule attacked Kagera. The Ugandan forces were equipped with T-55 and M4A1 Sherman tanks, along with OT-64 SKOT APCs, as well as Alvis Saladin armored cars, and advanced in two columns under the direct command of Butabika and Kisuule respectively. According to Kisuule, troops belonging to the Malire Battalion, Simba Battalion, 2nd Paratrooper Battalion, Marine Regiment, and Artillery & Signals Regiment took part in this operation. Despite encountering no or only light resistance, the Ugandan advance was slowed by the terrain, as Butabika's column got stuck in mud near Kabwebwe, and had to wait for hours before being able to get any further.\nSingano began monitoring Ugandan radio frequencies, and was able to overhear transmissions between Marajani and Republic House, the Uganda Army's headquarters in Kampala. Marajani reported heavy resistance despite the fact that all TPDF personnel had withdrawn from the border area. Believing that his enemies were confused about the situation, at mid-morning Singano ordered an artillery unit to the front to put up resistance. It was equipped with  mortars, a  howitzer, and a few  guns.mm and the howitzer 120mm, but sources on Tanzanian artillery show that the TPDF was equipped with 120mm mortars and 122mm howitzers. }} Stationed in the area around Bumazi, the unit set up its artillery 10 km (6.2 mi) from the Ugandans and fired several shells, causing them to retreat across the border. }} Throughout the rest of the day Ugandan MiGs crossed into Tanzanian airspace, where they were harassed by inconsequential anti-aircraft fire. One Tanzanian soldier suffered minor injuries in the clashes.\n(pictured) on 18 and 27 October 1978.]]\nThe sound of gunfire could be heard from Bukoba, and Tanzanian civilians in the West Lake region became increasingly anxious about the situation. Realising the veracity of Singano's warnings in light of the action, Tanzanian commanders dispatched a six-strong anti-aircraft team equipped with SA-7 shoulder-fired heat-seeking missiles from Tabora to the front. The unit arrived in Bukoba on 27 October. Shortly before its arrival, three MiGs attacked the Bukoba area. Most of their bombs landed in Lake Victoria and nearby forests, though one landed 50 metres (164&nbsp;ft) from the hospital, creating a large crater. Aside from some broken windows the raid caused little damage, but the population was frightened and by afternoon the roads leading out of the town were full of people evacuating via vehicle and foot. By the next morning Bukoba was almost completely deserted except for TPDF personnel. The Tanzanian missile team moved to Kyaka, from where they successfully shot down a MiG. The pilot ejected before his jet crashed and managed to safely return to Uganda.\nMeanwhile, in the area surrounding Bukoba, displaced persons from the town and the border region began gathering. Those equipped with vehicles, such as United Nations Development Programme personnel, drove to Mwanza. For the tens of thousands who could not move as far, the situation was deteriorating as conditions grew crowded and food and water became scarce. Some merchants began engaging in price gouging. Local officials attempted to alleviate the problem by bringing in food from government stockpiles. This became unfeasible as Singano commandeered most remaining vehicles to move his troops and artillery. The Tanzanian state-run news media did not report on the conflict, adding to the confusion of the civilians. Most of the Bukoba men resolved to return to their town to resume work while leaving their families in the countryside. Meanwhile, Singano petitioned his superiors in Tabora for reinforcements. They assured him that assistance was on its way, but no troops ever arrived. Over the next few days he busied himself with trying keep his artillery mobile.\nAt the same time, the Ugandans prepared a new attack. Amin ordered the Moroto-based Gonda Battalion to aid the invasion, but its commander, Lieutenant Colonel Yefusa Bananuka, had only been appointed a few days before the war's outbreak. Bananuka consequently did not travel to the front line himself, but still sent troops of the Gonda Battalion under the command of his second-in-command, Abdulatif Tiyua, to the Tanzanian border.\nSecond attack\n, the modern-day Missenyi District (red) ]]\nOn 30 October approximately 3,000 Ugandan troops invaded Tanzania along four routes through Kukunga, Masanya, Mutukula, and Minziro. This attack was code-named the \"Kagera Operation\", and subsequently referred to as \"battle of Kagera\" in Ugandan propaganda. Commanded by Uganda Army Chief of Staff Yusuf Gowon and equipped with tanks and APCs, the Ugandans only faced ineffectual rifle fire from several dozen members of the Tanzania People's Militia. The militiamen were easily overwhelmed and several were killed. Overall, just about 200 Tanzanian soldiers were in the area at the time. Singano could see the invasion from the high ground in Kyaka, but held his artillery fire for fear of harming fleeing civilians. Thousands of them streamed towards the Kagera River in panic. Though they had been warned about minefields laid on the north bank, some civilians and their cattle went through them and were killed after stepping on mines. Despite the minimal resistance from Tanzanian forces, the Ugandan troops advanced with caution. They slowly occupied the Kagera Salient, shooting at soldiers and civilians alike,}} before reaching the river and the Kyaka Bridge in the evening. Hampered by their minimal ammunition reserves, the 3rd Battalion had by then retreated south of the river. The Uganda Army Air Force indiscriminately bombed military and civilian targets during the invasion. Singano was in Kyaka with 19 men, but soon they and all other TPDF forces in the area retreated to Katolo, seven kilometres south of the crossing. Though the land between the river and Bukoba was left virtually undefended by the TPDF's withdrawal, Marajani ordered the Uganda Army to halt its advance at the north end of the bridge.\nThe Kagera Salient thus occupied, undisciplined Ugandan soldiers soon started to loot in the area. Approximately 1,500 civilians were shot and killed,}} while an additional 5,000 went into hiding in the bush. CCM officials were hunted down and decapitated, and many women and girls were raped. About 2,000 civilians were kidnapped and taken to Uganda. Of these, several hundred, particularly young women, were abducted and moved to a forced labour camp in Kalisizo.}} Some of the Tanzanians were forced to work as \"house-servants\", while others were employed at the Kinyala Sugar Works with no pay except housing and food. Many women were probably used by the soldiers as concubines. Personal belongings from homes were taken, especially kitchenware, as were the tin roofs from peasants' houses. Bulldozers and cars were stolen, and those of the latter that would not start were stripped of their parts. The entire Kakira Sugar Works and a sawmill were dismantled and transported into Uganda. Many livestock were taken, including goats, chickens, and sheep, as well as 13,000 cattle from the Kitengule state ranch. The latter were brought to Mbarara, where they were divided up among Ugandan soldiers and their friends. Remaining structures were destroyed by drunk Uganda Army troops with mortars. In total, $108 million worth of economic assets were lost. A Ugandan soldier later stated in an interview that the looting was ordered by Ugandan Government agents who instructed troops to \"give strong resistance and to loot anything we found valuable and hand these to the government\". Gowon later gained notoriety for an incident during the looting spree, when he allegedly demoted a captain for refusing to hand over a stolen tractor to him.\nOn 1 November Radio Uganda announced the \"liberation\" of the Kagera Salient and declared that the Kagera River marked the new border between Uganda and Tanzania. Amin toured the area and posed for photographs with abandoned Tanzanian war materiel. The Ugandan official press declared that the area had been seized in 25 minutes. Amin announced that the region would thereafter be known as the Kagera River District, that in commemoration of the Ugandan victory his youngest son was renamed Kagera, and that a medal was to be minted for veterans of the invasion.\nSingano's unit eventually set up artillery atop the high ground near the southern end of the Kyaka Bridge to cover the crossing. Ugandan commanders feared that the bridge could be used in a counter-offensive and thus resolved for it to be destroyed. On 1 and 2 November Ugandan MiGs conducted sorties in an attempt to destroy the crossing, but each time they were met with heavy Tanzanian anti-aircraft fire and several were destroyed. Wishing to avoid further losses, the Ugandans sought a demolitions expert to detonate the bridge. They approached the British manager of Kilembe Mines, who agreed to allow one of his civilian staff and his explosives to be utilised. Early in the morning on 3 November one Italian and three Ugandan demolition experts snuck into the water under the bridge. With soldiers holding them from the bank of the river by rope so they would not be swept away by the river, they set charges on the crossing. The Tanzanians did not see this activity in the darkness. The Ugandans detonated the charges at dawn, destroying the 75 metre (246&nbsp;ft) centre section of the bridge, but leaving its pillars intact. Avirgan and Honey wrote that \"Tanzanian troops looked on helplessly\" from their position on the high ground south of the bridge as it blew up.}} Several high-ranking Ugandan commanders, including Butabika and Gowon, believed that they had made a Tanzanian counter-attack impossible or at least unlikely by destroying the bridge. Later in the day Tanzanian anti-aircraft units in Musoma accidentally shot down three of their own MiGs that had unexpectedly entered their sector.\nTanzanian reaction\nDue to poor communications, the Tanzanian Government was only informed of the full extent of the invasion after an entire day had passed. After initial reports of the attack reached Dar es Salaam, Nyerere convened a meeting with his advisers and TPDF commanders in his beach residence.}} He was unsure of his force's ability to repel the Ugandan invasion, but TPDF Chief Abdallah Twalipo was confident that the army could eject the Ugandans from Tanzania. Twalipo stated that this would require a large operation which would take time to organise. Nyerere told him to \"get started\" and the meeting ended. On 31 October the Tanzanian Government made its first public acknowledgment of the hostilities with Uganda on Radio Tanzania's regularly scheduled 07:00 news bulletin. The announcer declared that Ugandan troops had occupied territory in the north-west portion of the country and that the army was preparing a counter-offensive. On 2 November Nyerere declared war on Uganda.\nInternational reactions\nSix African leaders condemned the Kagera invasion as Ugandan aggression: Mengistu Haile Mariam of Ethiopia, Didier Ratsiraka of Madagascar, Agostinho Neto of Angola, Seretse Khama of Botswana, Samora Machel of Mozambique, and Kenneth Kaunda of Zambia. The last four were leaders of members of the Frontline States, a coalition of countries committed to ending Apartheid in South Africa and Rhodesia, of which Tanzania was also a member. Though they denounced Uganda's actions, Mengistu and Machel attributed its attack on Tanzania as a Western imperialist machination to disrupt the Frontline States' efforts to stop racism in southern Africa. Several Tanzanian statesmen and journalists also believed that Bob Astles had served as conduit for whatever foreign power had manipulated Amin. }} Danish Prime Minister Anker Jørgensen also condemned the attack as an attempt to distract the Frontline States. Cuban Foreign Minister Isodoro Malmierca called the Ugandan invasion \"deplorable\" and appealed for an end to the conflict. United States Secretary of State Cyrus Vance called upon Uganda to withdraw its forces, and in response Amin accused the United States of \"interfering in an African dispute with the aim of creating a second Vietnam\". The United Kingdom, upset with Amin's hostility to its interests and what it perceived as an attack on a fellow member of the British Commonwealth, condemned the invasion and put pressure on British oil companies to sever trade with Uganda. The British Government also requested that France and Italy halt the trade of oil with Uganda. The governments of Canada, Jamaica, and Guyana also condemned the incursion. The governments of Guinea, Mali, Senegal, and several other African states refrained from condemnation, instead calling for a cessation of hostilities and requesting that both sides respect the charter of the Organisation of African Unity (OAU). The OAU itself remained neutral on the issue.\nOn 5 November, Kenyan President Daniel arap Moi cautiously appealed for Uganda to withdraw its troops \"if\" they had violated Tanzania's border. The following day, representatives of the OAU flew to Kampala to speak with Amin and try and reach a solution. Moi also told Amin that he would be willing to act as a mediator between Uganda and Tanzania. The Ugandan Government offered to accept mediation from Libya, one of its allies, but Tanzanian officials dismissed the proposal. Nyerere was exasperated by the suggestion that he accept mediation, telling OAU diplomats on one occasion, \"How do you mediate between somebody who breaks into your house and the victim of the assault?\" OAU chairman Edem Kodjo privately confided to a British official that Nyerere was determined to fight Uganda and that mediation was useless. The OAU ultimately refrained from condemning the Ugandan invasion. Nyerere appealed to Kenya to halt shipments of fuel to Uganda, but his request went unheeded. Amin's close adviser, Bob Astles, told Indian diplomat Madanjeet Singh that he had visited Moi in Kenya who had given him assurances that \"Kenya shall give Uganda every transit facility that we need, and that he will tell President Nyerere not to interfere in Uganda's internal affairs.\"\nTanzanian counter-offensive\nPlanning\nNyerere ordered full mobilisation for war. At the time, the TPDF consisted of four brigades. Among them, only the Southern Brigade led by Brigadier James Luhanga, which had just performed well in war games, was ready to be moved to the front line. However, it was headquartered in Songea, thus making it farther from Kagera than the other brigades. After a long trek via rail and road, the unit reached the Bukoba-Kyaka area and established camp. Additional soldiers were sent from the 202nd Brigade in Tabora. Prime Minister Edward Sokoine ordered Tanzania's regional commissioners to marshal all military and civilian resources for war. There was not enough motor transportation to efficiently move TPDF personnel to the front, as most military vehicles were in poor condition. The TPDF requisitioned buses and trucks from state and private enterprises to alleviate the problem, promising compensation to business owners if their vehicles were damaged or destroyed under their use. Factories were instructed to increase output and make goods for military use; the civilian population was warned of possible shortages.\nOn 2 November Nyerere flew to Beira, Mozambique, for a previously scheduled meeting with Machel. As active members of the Frontline States, both were concerned about the implications of the Tanzania–Uganda conflict for efforts to end white minority rule in Rhodesia. Nyerere and Machel developed the \"Second Front\" thesis, which reasoned that the Ugandan attack was made in an effort to distract Tanzania from its efforts to support black Rhodesian liberation movements. They agreed to withdraw the Tanzanian battalion stationed at the Mozambique–Rhodesia border, and Machel offered Nyerere the assistance of a Mozambican battalion as a gesture of support. The 800-strong unit was quickly flown to Tanzania and moved to Kagera. The claims about the presence of foreigners probably stemmed from the diverse ethnic and racial composition of the TPDF.}}\nDespite being informed of the Tanzanian preparations for a counter-offensive, the Ugandan military did not set up any proper defences such as trenches. Most of the commanders on the front line and members of the high command ignored the intelligence reports, and instead focused on looting the Kagera Salient. Gowon in particular was later blamed for his handling of the situation. Largely ignorant of military strategy and tactics, he believed that he had secured victory by destroying the Kyaka Bridge, and did not take warnings by his subordinate officers seriously. In contrast, Amin reportedly realised his precarious situation, and attempted to defuse the conflict without losing face. On 5 November Amin, a former boxing champion, publicly suggested that he and Nyerere participate in a boxing match which, in lieu of military action, would determine the outcome of the conflict. The Ugandan President suggested that Muhammad Ali could act as referee.}} Nyerere ignored the message. Three days later Amin pledged to withdraw from Tanzanian territory. Nyerere responded with a pledge to \"kick the aggressor out.\"\nOperation Chakaza\nTanzania initially aimed for its counter-offensive, called Operation Chakaza, to begin on 6 November, but it had to be delayed. By the second week of November, it had assembled 8,000–10,000 troops on the southern bank of the Kagera River. TPDF Chief of Staff Major General Tumainiel Kiwelu took command of the troops, and initiated a heavy artillery bombardment of the northern bank, triggering the flight of many Uganda Army soldiers. A Ugandan military spokesman denounced the bombardment in a radio announcement on 11 November, claiming that \"very few\" Ugandan soldiers belonging to the Kifaru Regiment and Gonda Battalion were holding the frontline. He stated that these troops would soon be reinforced, and that the Tanzanians would face heavy resistance in the coming days. On the night of 14 November a few Tanzanian soldiers crossed the river in boats and, finding no Ugandans, returned without incident. Astles telephoned journalists in Nairobi to erroneously report that a large Tanzanian amphibious operation had been foiled by the Uganda Army, and that 300 Tanzanian soldiers had died when their boats overturned and they were attacked by crocodiles. That day Amin, sensing that other African states did not support his position and irrationally fearing that the Soviet Union was about give Tanzania new weapons, declared the unconditional withdrawal of all Ugandan troops from Kagera and invited OAU observers to witness it. The Tanzanian Government denounced the statement as a \"complete lie\", while foreign observers were unable to reach a consensus on the veracity of the supposed withdrawal. The OAU reacted by declaring that its mediation had succeeded.\n(example in British service pictured) to cross the Kagera River and launch their counter-offensive.]]\nMeanwhile, at the front, Tanzanian commanders decided to transport heavy equipment across the Kagera River via pontoon bridge. At 03:00 on 19 November, Tanzanian Lieutenant Colonel Ben Msuya dispatched a contingent to the northern bank to cover a team which was assembling the pontoons. Within three hours the bridge was completed, and the Tanzanians began clearing mines they had left behind along the northern bank before the Ugandan invasion. One soldier was killed and three wounded when they accidentally detonated a mine, but by 12:00 all of the other mines had been removed. On 20 November Tanzanian patrols began exploring the area along the northern bank of the Kagera River, discovering dead civilians and destroyed property left by the Uganda Army. Two days later patrols reached the Ugandan border, finding no Ugandan troops except for a small contingent in Minziro, which they did not engage. They only fled in disarray when the Tanzanians crossed the Kagera River in large numbers amid a pincer attack. According to the New Vision, this attack was conducted by 9,000 Tanzanian troops on 21 November.}} Ugandan command and control descended into chaos amid the counter-offensive, and only a few officers attempted to organise any resistance. Four Ugandan MiG-21s carried out air raids amid Operation Chakaza, attempting to bomb the Bukoba air strip and the Mwanza airfield. The attack on Bukoba caused minimal damage, while the two planes that targeted Mwanza were hit by anti-aircraft fire. One MiG crashed and its pilot was taken prisoner, while the other, piloted by Ali Kiiza, managed to return to Entebbe. However, according to BBC Monitoring, Kiiza was already lieutenant colonel and head of the MiG-21 squadron since early 1978. Furthermore, Kiiza stated in an interview that he flew no missions during the war with Tanzania. }}\nOn 23 November three TPDF brigades under Brigadiers Luhanga, Mwita Marwa, and Silas Mayunga crossed the pontoon bridge and began occupying the Kagera Salient. Once the Tanzanian soldiers appeared en masse, the Kagera residents who had been in hiding revealed themselves. They were quickly evacuated to areas south of the river. Wounded civilians were taken to Bukoba hospital for treatment. According to Msuya, the TPDF buried the dead civilians. The following day a Bailey bridge, purchased from the United Kingdom, was installed over the broken span of the Kyaka Bridge. On 25 November the Tanzanians began moving tanks and BM-21 rocket launchers across it. Though small groups of Ugandan troops roamed the countryside, Nyerere, to the chagrin of his officers, toured Kagera. A few Tanzanian soldiers died in traffic accidents while deploying. The Ugandan Government announced in late November that it had withdrawn all forces from the Kagera Salient and that all fighting had ceased. It flew 50 foreign diplomats to the border, and they reported that there was little evidence of ongoing conflict. Tanzanian officials denounced the withdrawal statement, asserting that Ugandan troops had to be forcibly removed from Tanzanian territory, and announcing that some remained in the country. Nyerere's government also declared that 193 people in north-western Tanzania were arrested on suspicion of espionage. On 29 November Sudanese diplomat Philip Obang concurred that Ugandan troops had completely withdrawn, though Nyerere subsequently argued that they had been forcibly expelled.\nWhile conducting patrols in the salient, the Tanzanians discovered 120 bodies of Ugandan soldiers on Kakindu Hill. The TPDF had not operated in the area before, and the Tanzanians did not believe their artillery had struck the location. Though the circumstances surrounding the Ugandans' deaths remained unclear, the Tanzanian Government publicly stated that the men had been executed in Uganda and then \"dumped\" in Tanzania. Minor clashes occurred over the following weeks, costing the Ugandans several armoured vehicles. On 4 December the TPDF's 206th and Southern Brigades secured Mutukula on the Tanzanian side of the border without incident, while the 207th under Brigadier John Butler Walden retook Minziro. The Tanzanian soldiers found that most of the village's population had been murdered. On 25 December the TPDF began bombarding Ugandan territory with BM Katyusha \"Saba Saba\" rocket launchers. By early January all Ugandan troops had been ejected from Kagera. Additional Libyan and PLO troops were transported to Uganda in December 1978. }}\nAftermath\nStrategic situation\nThe morale and discipline of the Uganda Army deteriorated as the Tanzanians pushed it out of Kagera and attacked it along the border. After the invasion was repulsed, the Tanzanians feared that the Uganda Army would try again to seize their territory. Tanzanian commanders felt that as long as Ugandan troops controlled the high ground at Mutukula, Uganda along the frontier they posed a threat to the salient. Able to see Ugandan troops encamped on the high ground through binoculars during his tour of Kagera, Nyerere was moved to agree with his officers and ordered them to capture the town. Sporadic clashes occurred along the border over the next two months until the night of 21 January 1979 when the Southern Brigade—renamed the 208th Brigade—crossed over the Ugandan border. It attacked and seized Mutukula the following day. The Tanzanians then destroyed the town and shot civilians to avenge the pillaging in Kagera.\nEffects of the invasion on Tanzania\nRadio Tanzania broadcast stories of the atrocities in Kagera throughout Tanzania using first-hand accounts and interviews. Tales of the pillaging and destruction created public outcry and demands for Amin to be overthrown. Singano's decision to withdraw his forces from the salient during the invasion generated a debate among the TPDF officer corps for several years. His supporters argued that since he had been denied essential reinforcements from his superiors, his choice to observe and report on the Ugandans' progress was the best course of action. His detractors asserted that he was obligated as a soldier to put up as much resistance as possible to the invasion, despite being heavily outnumbered.\nThe invasion came at a time when Tanzania's economy was showing signs of recovery from a severe drought in 1974–1975. All planned government projects were suspended in every ministry except Defence, and the administration was instructed not to fill vacancies. On 15 November Minister of Finance Edwin Mtei declared that the government was raising taxes on numerous commodities to help fund the war effort; a 10 per cent \"temporary war tax\" was raised on soft drinks, beer, clothing, and cigarettes. Nyerere stated in January 1979 that the TPDF operation to expel the Ugandans had necessitated a \"tremendous\" diversion of the country's resources away from development work. Scholars' estimates of the total direct costs of the entire war for the Tanzanians range from $500&nbsp;million to $1&nbsp;billion. Fearing the resumption of hostilities in the Kagera Salient, the region's 40,000 residents were initially resettled south of the river in camps at Nsheshe, Rugaze, Omubweya, Nyankere, Kyamulaile, Katoro, Kashaba, and Burigi. Social services in the displaced persons camps were minimal or non-existent.\nEffects of the invasion on Uganda\nThe invasion of Kagera was largely met by apathy within the Ugandan populace. Many Ugandan civilians who had grown disillusioned with Amin's regime were supportive of the Tanzanians during the invasion. They were \"not happy\" when they saw killed Tanzanians during the invasion's early stages, and \"pleased\" with the Tanzanian victories during the invasion's later stages. Many Ugandans started to hide anti-Amin insurgents, thereby aiding them in sabotaging the Ugandan war effort by destroying railway lines, electricity supply lines, and petrol stations. Confronted with these developments, the Ugandan Government resorted to brutal suppression, such as arresting and killing all without proper documents in order to eliminate suspected dissidents. Unrest also mounted in the military, as many Ugandan soldiers felt that their commanders had handled the invasion incompetently or had even betrayed them to the Tanzanians, resulting in increasing mistrust among the Uganda Army. According to southern Ugandan civilians, hundreds of Ugandan troops deserted from the front at Kagera.\nLegacy\nCourse of the Uganda–Tanzania War\nIn response to the Ugandan invasion, Tanzania began to rapidly expand its army. Over the course of several weeks, the TPDF grew from less than 40,000 troops to over 150,000, including about 40,000 militiamen. Tanzania also mobilised several hundred anti-Amin Ugandan exiles and equipped them to battle the Uganda Army. Nyerere did not initially intend on expanding the war beyond defending Tanzanian territory. After Amin failed to renounce his claims to Kagera and the OAU failed to condemn the Ugandan invasion, he decided that Tanzanian forces should occupy southern Uganda. In February Masaka and Mbarara were seized by Tanzanian and Ugandan rebel forces and destroyed with explosives in revenge for the destruction caused by the Ugandans in Kagera. Nyerere originally planned to halt his forces and allow the Ugandan rebels to attack Kampala and overthrow Amin, as he feared that scenes of Tanzanian troops occupying the city would reflect poorly on his country's image abroad. However, Ugandan rebel forces did not have the strength to defeat the Libyan units coming to Amin's aid, so Nyerere decided to use the TPDF to take Kampala. The city fell on 11 April and Amin was deposed. The British Government supplied Tanzania with several million pounds sterling during the war to ostensibly assist with repairing the damage in Kagera, though likely with the understanding that the money would be used to fund military efforts. West Germany also gave Tanzania money to assist with the refugees from Kagera. As the TPDF secured the rest of the country, they seized the Kilembe Mines. The Tanzanians arrested the manager and three of his employees for destroying the Kyaka Bridge, but they were released several months later. The TPDF withdrew from Uganda in 1981.\nAcademic Benoni Turyahikayo-Rugyema wrote in 1998 that \"Had Amin not invaded the Kagera Salient in Tanzania he probably would still be ruling Uganda.\" The war is remembered in Tanzania as the Kagera War. During the war the original demarcation posts along the Uganda–Tanzania border were removed. The border dispute between the two countries remained after the conflict, but at a low intensity. Negotiations between Uganda and Tanzania on re-establishing a complete, official demarcation of the border began in 1999 and concluded successfully in 2001.\nLong term impact on Kagera\nResettlement of Kagera residents\nUpon the war's end, the Tanzanian Government declared that Kagera residents could go back to their region; by August 1979 most had returned to their homes. However, the government prohibited civilians from going to Mutukula, Kakunyu, Bugango, Bubale, and Byeju for security reasons, and established more permanent accommodations for those affected in Kyamulaile, Nyankere, Nsheshe, and Burigi. Most of them could not return to their homes until the early 1980s. In 2000, members of Parliament from rural Nkenge and Bukoba constituencies complained that some residents had not returned—due to the continuing presence of unidentified corpses in their homes—or had not achieved a standard of living in parity with that of the pre-war era. The Minister for Home Affairs responded by saying the government would not offer financial assistance to Kagera residents affected by the war as the conflict had been taxing for all Tanzanians and they were not entitled to special compensation.\nIn 2020, the Tanzanian government expelled several families from the Kagera area to Uganda, claiming that they descended from settlers who had come to the area around the time of the 1978 invasion. Officials stated that many Ugandans and Rwandans had exploited the chaos surrounding the Kagera invasion and the removal of border markings as well as controls to illegally enter Tanzania. The affected people disputed this claim, with one family stating that their ancestors had already lived in Kagera Salient when it had still been ruled by the British Empire.\nRehabilitation\nThe Tanzanian Government strengthened its presence in Kagera after the war, bolstering its police station in Kyaka and establishing several others in border towns. For security reasons, villagers were prohibited from occupying land within  of the border, though there was little oversight of this restriction over time and it was sometimes ignored by locals. In the immediate aftermath of the war the government shut down cross-border markets, resulting in shortages of goods and spikes in commodity prices. Smuggling became rampant. Normal trade with Uganda did not resume until the 1990s.\nIn July 1979 Nyerere announced a programme to rehabilitate the Kagera border region with a focus on rebuilding lost infrastructure and promotion of the Ujamaa political philosophy. In 1982 the Tanzanian Ministry of Information and Culture published a study on the sociocultural and economic impacts of the invasion on the Kagera Salient. The study concluded that by 1981 three fourths of pre-war infrastructure was restored in all border localities. Residents of the region later testified that while social services returned, their quality was less than that of the pre-war era, and that the rehabilitation programme focused mostly on government institutions, community centers, and major roads, and did little to support individuals. The Tanzanian village of Bunazi was renamed Operation Chakaza in honour of the counter-offensive that expelled Ugandan troops from Kagera. For his role in liberating the salient, Kiwelu was dubbed by some local residents as emanzi, meaning \"hero\" in the Haya language. As of 2002, ruins of the conflict remained in Kagera.\nNotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}