{
  "content": [
    {
      "type": "text",
      "text": "# Invasion: Sicily – Alexander vs Kesselring\n\nInvasion: Sicily – Alexander vs Kesselring is a board wargame published by Rand Game Associates in 1974 that simulates the Allied invasion of Sicily during World War II.\nBackground\nFollowing the Allied victory over Axis forces in North Africa, Allied attention turned to Europe. A decision was made to invade Sicily in July 1943 via amphibious and air assaults using a plan by General Bernard Montgomery. Opposing them were Italian and German forces ostensibly under Italian ''Generale d'Armata Alfredo Guzzoni, but actually commanded by Generalfeldmarschall Albert Kesselring.\nDescription\nThe Invasion of Sicily'' is a two-player board wargame where one player controls Allied invaders, and the other player controls Axis defenders. The game, having only 72 counters and a small 17\" x 16\" hex grid map of Sicily, is not complex. The game comes with three scenarios:\n# Historical: Both players use historical orders of battle, landing sites and defensive placements.\n# Historical with free placement: Players use historical orders of battle, but the Axis player can set up their defenses anywhere on the island, and Allies can attempt landings anywhere.\n# What if?: From a list of \"variable historical occurrences\", one is chosen at random and the historical scenario is played under the resultant conditions. One example is \"Hitler has intuition — 'Sicily is key to Western Civilization.' No Axis units are permitted to evacuate.\" In this case, all Axis units must fight until eliminated rather than evacuating to the mainland.\nIn each scenario, the game can last up to 25 turns.\nGameplay\nThe game uses a system of \"I Go, You Go\" alternating turns, where first the Allies and then the Axis move and fire. When attacking, the player can choose between a limited attack, an all-out attack, and a mobile attack, each of which has an effect on movement as well as the odds of success. Players must also track supply lines as well as other administrative tasks.\nBoth sides gain victory points for key objectives taken by the Allies or held by the Axis. The player amassing the most points is the winner.\nPublication history\nRather than selling individual games in stores or via mail-order, RGA decided to sell a series of wargames via subscription. Players who subscribed to the series titled \"Command Series, Volume I\" received the first game as well as a large box with enough room to store the entire series of games. A \"Universal Command Series Package\" was also included that contained a Universal Turn Recorder (a turn record track for up to 30 turns), TAC Cards (6 white cards and 6 red cards numbered from 1–6), and a six-sided die. Subsequent games then arrived every six weeks. Lee vs. Meade was the first in this subscription series, followed by eight more games, one of them being Invasion: Sicily, a game designed by David Isby.\nJust after the first game in the \"Command Series\" was released, RGA made a deal with Gamut of Games, allowing the second company to sell the individual games in this series as separate boxed sets. Gamut of Games' edition of Invasion: Italy was released in 1975.\nReception\nIn Issue 17 of Moves, game designer Richard Berg called Invasion: Sicily \"a step in the wrong direction. [...] Balance seems to be the main problem, but this is a playability problem arising from the general situation combined with a map area that is, effectively, so small that maneuver is minimal.\" Berg pointed out that \"The German player can rarely, if ever, assume an offensive stance, and his defensive strategy consists of well-planned withdrawals.\" Berg also found issues with \"incredible loopholes in the rules that leave major tactical maneuvers such as paradrops open to questions.\"  He concluded that this game was \"the most disappointing of the Rand products.\"\nIn Issue 37 of Games and Puzzles, Eric Solomon found the game relatively complex and warned players \"Like many in this class of war games, Invasion: Sicily demands great attention to detail, particularly in relation to routes of supply. [...] Certain time-dependent effects are also difficult to operate without religious note-taking.\" Solomon had issues with the lengthy rules, and suggested a lot of information \"could be more readily absorbed and retrieved if the long-winded (inevitably) textual matter were condensed in a tabular form.\" He also found various types of terrain on the map difficult to distinguish. Solomon concluded by giving the game an average rating of 4 out of 6, saying, \"I want to stress that these are relatively minor complaints, and that Invasion: Sicily provides one of the most successful of marketed war games. [...] Did we enjoy the game? Yes — but by George (Patton perhaps), it's hard work!\"\nIn a 1976 poll conducted by Simulations Publications Inc. to determine the most popular board wargames in North America, Invasion: Sicily placed a poor 189th out of 202 games.\nIn his 1977 book The Comprehensive Guide to Board Wargaming, Nick Palmer liked the \"great variety of scenario possibilities\", but found problems with rules ambiguities.\nReferences"
    }
  ]
}