{
  "content": [
    {
      "type": "text",
      "text": "# Invasion genetics\n\nInvasion genetics is the area of study within biology that examines evolutionary processes in the context of biological invasions. Invasion genetics considers how genetic and demographic factors affect the success of a species introduced outside of its native range, and how the mechanisms of evolution, such as natural selection, mutation, and genetic drift, operate in these populations. Researchers exploring these questions draw upon theory and approaches from a range of biological disciplines, including population genetics, evolutionary ecology, population biology, and phylogeography.\nInvasion genetics, due to its focus on the biology of introduced species, is useful for identifying potential invasive species and developing practices for managing biological invasions. It is distinguished from the broader study of invasive species because it is less directly concerned with the impacts of biological invasions, such as environmental or economic harm. In addition to applications for invasive species management, insights gained from invasion genetics also contribute to a broader understanding of evolutionary processes such as genetic drift and adaptive evolution.\nHistory\nDescriptions of invasive species\nCharles Elton formed the basis for examining biological invasions as a unified issue in his 1958 monograph, The Ecology of Invasions by Animals and Plants, drawing together case studies of species introductions. Other important events in the study of invasive species include a series of issues published by the Scientific Committee on Problems of the Environment in the 1980s and the founding of the journal Biological Invasions in 1999. Much of the research motivated by Elton's monograph is generally identified with invasion ecology, and focuses on the ecological causes and impacts of biological invasions.\nThe Genetics of Colonizing Species\nThe evolutionary modern synthesis in the early 20th century brought together Charles Darwin's theory of evolution by natural selection and classical genetics through the development of population genetics, which provided the conceptual basis for studying how evolutionary processes shape variation in populations. This development was crucial to the emergence of invasion genetics, which is concerned with the evolution of populations of introduced species. The beginning of invasion genetics as a distinct study has been identified with a symposium held at Asilomar in 1964 which included a number of major contributors to the modern synthesis, including Theodosius Dobzhansky, Ernst Mayr, and G. Ledyard Stebbins, as well as scientists with experience working in areas of weed and pest control.\nStebbins, working with another botanist, Herbert G. Baker, collected a series of articles which emerged from the Asilomar symposium and published a volume titled The Genetics of Colonizing Species in 1965. This volume introduced many of the questions which continue to motivate research in invasion genetics today, including questions about the characteristics of successful invaders, the importance of a species' mating system in colonization success, the relative importance of genetic variation and phenotypic plasticity in adaptation to new environments, and the effect of population bottlenecks on genetic variation.\nTerminology of invasion genetics\nSince its publication in 1965, The Genetics of Colonizing Species helped to motivate research which would provide a theoretical and empirical foundation for invasion genetics. However, the term invasion genetics only first appeared in the literature in 1998, and the first published definition appeared in 2005. The success of introduced species is quite variable, consequently researchers have sought to develop terminology which allows distinguishing different levels of success. These approaches rely on describing invasion as a biological process.\nProcess of biological invasion\nBackground\nResearchers have proposed a number of different methods for describing biological invasions. In 1992, the ecologists Mark Williamson and Alastair Fitter divided the process of biological invasion into three stages: escaping, establishing, and becoming a pest. Since then, there has been an expanding effort to develop a framework for categorizing biological invasions in terms that are neutral with respect to a species' environmental and economic impacts. This approach has allowed biologists to focus on the processes which facilitate or inhibit the spread of introduced species.\nDavid M. Richardson and colleagues describe how introduced species must pass a series of barriers prior to becoming naturalized or invasive in a new range. Alternatively, the stages of an invasion may be separated by filters, as described by Robert I. Colautti and Hugh MacIsaac, so that invasion success would depend on the rate of introduction (propagule pressure) as well as the traits possessed by the organism.\nDescription\nThe most recent systematic effort to describe the steps of a biological invasion was made by Tim Blackburn and colleagues in 2011, which combined the concepts of barriers and stages. According to this framework, there are four stages of an invasion: transport, introduction, establishment, and spread. Each of these stages is accompanied by one or more barriers.\n{| class=\"wikitable\"\n|+ Stages of an invasion as described in a paper by Tim Blackburn and colleagues.\n|-\n! Stage !! Description\n|-\n| Transport || For a species to become invasive, it must first be transported outside of its native range. As such, the barrier associated with this stage is geographic. Transport of a species outside of its native range is typically human-mediated and may be either deliberate or accidental. Successful passage through this stage may therefore be contingent on whether or not the species has been selected for transport by humans, whether it might be accidentally picked up (e.g. via ballast water), and its ability to survive passage from one region to another.\n|-\n| Introduction || Once a species has been transported into a novel range, it must be introduced into the natural environment in that range. For species introduced in captivity, this may involve minor barriers such as a fence or road.\n|-\n| Establishment || A species introduced into the environment outside of its native range will not successfully establish a population without being able to survive and reproduce in that environment. Blackburn described how a population experiencing a negative growth rate, while consisting of individuals which are able to survive and reproduce, will disappear in the long run. A positive demographic growth rate is therefore an additional condition for establishment.\n|-\n| Spread || The final distinction between introduced or naturalized species and invasive species is whether the species is able to disperse from the first established population and continue to thrive in habitats progressively further from its point of introduction, where it may encounter quite different environmental conditions.\n|}\nApplication of invasion genetics to different stages of invasion\nInvasion genetics can be used to understand the processes involved at each stage of a biological invasion. Many of the foundational questions of invasion genetics focused on processes involved during establishment and spread. As early as 1955, Herbert G. Baker proposed that self-fertilization would be a favourable trait for colonizing species because successful establishment would not require the simultaneous introduction of two individuals of opposite sexes. Baker subsequently elaborated a series of \"ideal weed characteristics\" in an article in The Genetics of Colonizing Species, which included traits such as the ability to tolerate environmental variation, dispersal ability, and the ability to tolerate generalist herbivores and pathogens. While some of the traits, such as ease of germination, may aid a species in transport or introduction, most of the traits Baker identified were primarily conducive to establishment and spread.\nAdvances in the study of molecular evolution may help biologists to understand better the processes of transport and introduction. Genomicist Melania Cristescu and her colleagues examined mitochondrial DNA of the fishhook waterflea introduced into the Great Lakes, tracing the source of the invasive populations to the Baltic Sea. More recently, Cristescu has argued for expanding the use of phylogenetic and phylogenomic approaches, as well as applying metabarcoding and population genomics, to understand how species are introduced and identify \"failed invasions\" where introduction does not lead to establishment.\nFactors influencing invasion success\nPropagule pressure\nPropagule pressure describes the number of individuals introduced into an area in which they are not native, and can strongly affect the ability of species to reach a later stage of invasion. Factors which may influence the rate of transport and introduction into a novel environment include the species' abundance in its native range, as well as its tendency to co-occur with or be deliberately moved by humans.\nThe likelihood of reaching establishment is also highly dependent on the number of individuals introduced. Small populations can be limited by Allee effects, as individuals may have difficulty finding suitable mates and populations are vulnerable to demographic stochasticity. Small populations may also suffer from inbreeding depression. Species that are introduced in larger numbers are more likely to establish in different environments, and high propagule pressure will introduce more genetic diversity into a population. These factors can help a species adapt to different environmental conditions during establishment as well as during subsequent spread in a new range.\nTraits of successful invaders\nHerbert G. Baker's list of 14 \"ideal weed characteristics\", published in the 1965 volume The Genetics of Colonizing Species, has been the basis for investigation into characteristics which could contribute to invasion success of plants. Since Baker first proposed this list, researchers have debated whether or not particular traits could be linked to the \"invasiveness\" of a species. Mark van Kleunen, in revisiting the question, proposed examining the traits of candidate invaders in the context of the process of biological invasion. According to this approach, particular traits might be useful for introduced species because they would allow them to pass through a filter associated with a particular stage of an invasion.\nGenetic variation\nA population of introduced species exhibiting higher genetic variation could be more successful during establishment and spread, due to the higher likelihood of possessing a suitable genotype for the novel environment. However, populations of a species in an introduced range are likely to exhibit lower genetic variation compared to populations in the native range due to population bottlenecks and founder effects experienced during introduction. A classic study on population bottlenecks, conducted by Masatoshi Nei, described a genetic signature of bottlenecks on introduced populations of Drosophila pseudoobscura in Colombia. The ecological success of many invaders despite these apparent genetic limitations suggests a \"genetic paradox of invasion\", for which a number of answers have been proposed.\nOne of the possible resolutions for the genetic paradox of invasion is that most bottlenecks experienced by introduced species are typically not severe enough to have a strong effect on genetic variation. As well, a species may be introduced multiple times from multiple sources, resulting in genetic admixture which could compensate for lost genetic variation. The evolutionary ecologist Katrina Dlugosch has noted that the relationship between genetic variation and capacity for adaptation is nonlinear and may depend on factors such as the effect size of adaptive loci (in quantitative genetics, effect size refers to the magnitude of change in a phenotypic trait value associated with a particular locus) and the presence of cryptic variation.\nPhenotypic plasticity\nPhenotypic plasticity is the expression of different traits (or phenotypes), such as morphology or behaviour, in response to different environments. Plasticity allows organisms to cope with environmental variation without necessitating genetic evolution.\nHerbert G. Baker proposed that the possession of \"general purpose\" genotypes which were tolerant of a range of environments could be advantageous for species introduced into new areas. General purpose genotypes could help introduced species encountering environmental variation during establishment and spread, in part because introduced species should have less genetic variation than native species. However, it remains disputed whether or not invasive species exhibit higher plasticity than native and non-invasive species.\nEvolution during biological invasions\nGenetic consequences of range expansion\nRange expansion is the process by which an organism spreads and establishes new populations across a geographic scale, so it is part of a biological invasion. During a range expansion, there exists an expanding wave front, where rapidly-growing populations are established by a relatively small number of individuals. Under these demographic conditions, the phenomenon of gene surfing can lead to the accumulation of deleterious mutations. This reduces the fitness of individuals at the wave front, and is described as an expansion load (see also: mutation load). These mutations can limit the rate of range expansion and, in the absence of effective recombination and natural selection which would remove such mutations, can have severe and persisting negative effects on populations.\n, an invasive species in North America, is believed to have been facilitated by adaptive evolution.]]\nLocal adaptation\nInvasive species may encounter environments which differ either from those experienced in their natural range or where they are introduced. In these environments natural selection can act on these introduced populations, provided that there is sufficient genetic variation present in the population, which may lead to local adaptation. Such adaptation can facilitate both the establishment and spread of an introduced species.\nLocal adaptation can, however, be inhibited by genetic admixture between populations. Admixture can result in hybrid breakdown by breaking up beneficial gene linkages and introducing maladapted alleles.\nAdmixture can also facilitation species introductions by increasing genetic variation, thereby limiting the cost of inbreeding in small populations. Through heterosis, the increased quality of hybrid offspring, admixture has also been shown to increase the vigour of introduced populations of common yellow monkeyflower.\nHybridization\nHybridization broadly refers to breeding between individuals from genetically isolated populations, and may therefore be within a species (intraspecific) or between species (interspecific). When offspring are distinct from either parent, hybridization can be a source of evolutionary novelty. Hybridization can also lead to gene flow between populations or species through the mechanism of introgression.\nHybridization and its contribution to evolution was a subject of interest for G. Ledyard Stebbins, who noted in a 1959 review that the introduction of European species of the genus Tragopogon to North America had led to hybrid speciation; this example was also discussed by Herbert G. Baker in The Genetics of Colonizing Species. The first systematic review of the role of invasive plant species in interspecific hybridization appeared in 1992, and the phenomenon has also been explored in fish and aquatic invertebrates. Hybridization may increase the invasiveness of introduced species, either by introducing genetic variation, heterosis, or by creating novel genotypes which perform better in a given environment. Gene flow between introduced and native species can also result in the loss of biodiversity through genetic pollution.\nEvolutionary responses of native species to invaders\nBecause biological invasions can have a profound impact on the invaded environment, it is expected that the arrival of invasive species creates new selective pressures on native organisms, typically through competitive or predatory interactions. Through adaptive evolution, species in affected ecological communities could evolve to tolerate invasive species. This means that biological invasions potentially have both ecological and evolutionary consequences for native species. However, many studies have failed to detect an adaptive response of native species to ecological disruptions. The ecologists Jennifer Lau and Casey terHorst have pointed to this absence of an evolutionary response as an important consideration for understanding how invasive species disrupt ecological communities and the multiple challenges faced by native populations.\nSee also\n* Invasive species\n* Introduced species\n* Colonisation (biology)\n* Population genetics\n* Population genomics\n* Glossary of invasion biology terms\n* Invader potential\n* Indigenous (ecology)\n* Conservation genetics\n* Ecological genetics\nReferences\nFurther reading\n* Barrett, Spencer C.H.; Colautti, Robert I.; Dlugosch, Katrina M.; Rieseberg, Loren H., eds. (2016). Invasion genetics: The Baker and Stebbins legacy. Hoboken, NJ: John Wiley & Sons. . [https://www.worldcat.org/oclc/944408795 WorldCat]\nExternal links\n* [https://www.youtube.com/watch?v=GqQsHXBrZOE Spencer Barrett on the Foundation of Invasion Genetics (YouTube link)]"
    }
  ]
}