{
  "content": [
    {
      "type": "text",
      "text": "# Invasion Attack 2016\n\n|venue=Ryōgoku Kokugikan\n|city=Tokyo, Japan\n|attendance=9,078\n|liveevent=\n|lastevent=New Japan Cup\n|nextevent=Global Wars\n|event=Invasion Attack/Sakura Genesis\n|lastevent2=2015\n|nextevent2=2017\n|event3=New Japan Pro-Wrestling events\n|lastevent4 = Lion's Gate Project 1\n|nextevent4 = Wrestling Dontaku 2016\n}}\nInvasion Attack 2016 was a professional wrestling pay-per-view (PPV) event promoted by New Japan Pro-Wrestling (NJPW). The event took place on April 10, 2016, in Tokyo at Ryōgoku Kokugikan, and featured nine matches, six of which were contested for championships. The main event saw the winner of the 2016 New Japan Cup, Tetsuya Naito defeat Kazuchika Okada for the IWGP Heavyweight Championship.\nThe event aired worldwide on NJPW World and featured English commentary, provided by Kevin Kelly and Steve Corino. In addition, the event also aired in Japan as a PPV through SKY PerfecTV!. It was the fourth and last event under the Invasion Attack name; the event was renamed as Sakura Genesis in 2017.\nStorylines\nInvasion Attack 2016 featured nine professional wrestling matches that involved different wrestlers from pre-existing scripted feuds and storylines. Wrestlers portrayed villains, heroes, or less distinguishable characters in the scripted events that built tension and culminated in a wrestling match or series of matches.\nOn February 22, 2016, NJPW announced the 2016 New Japan Cup, stating that the winner of the tournament would get to choose whether to challenge for the IWGP Heavyweight Championship (held by Kazuchika Okada), the IWGP Intercontinental Championship (held by Kenny Omega) or the NEVER Openweight Championship (held by Katsuyori Shibata) at Invasion Attack 2016. On March 12, Tetsuya Naito won the tournament, defeating Hirooki Goto in the finals, and afterwards announced he was challenging Okada for his title. Though he initially stated that he would not cash in his shot at Invasion Attack 2016, Naito changed his mind after a request from Okada. The match was officially confirmed by NJPW two days later. In an interview following his New Japan Cup win, Naito stated that his true opponent at Invasion Attack 2016 was not Okada, but NJPW owner Takaaki Kidani and booker Gedo. This would mark Naito's first shot at the IWGP Heavyweight Championship since Wrestle Kingdom 8 in Tokyo Dome in January 2014, where he unsuccessfully challenged Okada for the title. Prior to Invasion Attack 2016, Okada and Naito had faced off in six singles match with both having won three of them. The match marked Okada's fourth title defense and a chance for Naito to win the IWGP Heavyweight Championship for the first time.\n, who won the 2016 New Japan Cup to earn an IWGP Heavyweight Championship match in the main event of Invasion Attack 2016]]\nOn January 30, 2016, it was reported that British wrestler Will Ospreay had signed with NJPW and would debut at Invasion Attack 2016. On March 3, Ospreay was announced as the newest member of the Chaos stable. Appearing in a video, he proceeded to challenge Kushida to a match for the IWGP Junior Heavyweight Championship, vowing to become the first British holder of the title. The match was officially announced on March 14.\nOn February 14 at The New Beginning in Niigata, G.B.H. (Togi Makabe and Tomoaki Honma) made their first successful defense of the IWGP Tag Team Championship against previous champions, Bullet Club's Doc Gallows and Karl Anderson. After the match, Anderson and Gallows' stablemate Tama Tonga entered the ring and challenged Makabe and Honma, announcing that his partner would be a new member of Bullet Club. The champions accepted the challenge. On March 3, Tonga scored the biggest win of his career by defeating Makabe in the first round of the 2016 New Japan Cup. On March 12, Tonga also pinned Honma in a six-man tag team match and then revealed that his partner would be his real-life brother Tevita Fifita. On March 14, NJPW officially announced the match for the IWGP Tag Team Championship between G.B.H. and the \"Guerrillas of Destiny\" team of Tonga and the newly renamed Tanga Loa. The match would mark the NJPW debut of the brother team, who had previously wrestled together as the \"Sons of Tonga\". Loa made his surprise debut on March 27, attacking Makabe during his match with Tonga, which led to him being added to matches on the last three \"Road to Invasion Attack 2016\" events.\nOn March 14, NJPW announced that at Invasion Attack 2016 Matt Sydal and Ricochet would make their first defense of the IWGP Junior Heavyweight Tag Team Championship against former champions Roppongi Vice (Beretta and Rocky Romero). Prior to the event, it was reported that Ricochet was WWE bound and that behind the scenes NJPW was looking for a new partner for Sydal.\n, who was set to wrestle his first NJPW match since November 2014 at Invasion Attack 2016]]\nThe rest of the matches were announced on March 22. Two title matches were added to the event, contested for the NEVER championships. First, Kenny Omega and The Young Bucks (Matt Jackson and Nick Jackson), representing Bullet Club and its sub-group The Elite, were set to defend the NEVER Openweight 6-Man Tag Team Championship against Hiroshi Tanahashi, Michael Elgin and Yoshitatsu. Tanahashi and Elgin previously challenged The Elite for the title on March 20, teaming with Juice Robinson, but lost when Robinson was pinned. This match would mark Yoshitatsu's first NJPW match since November 2014, when he was sidelined with a broken neck, suffered in a match with then Bullet Club leader A.J. Styles. Yoshitatsu, who had dubbed himself the \"Bullet Club Hunter\" prior to his injury, stated that his goal of taking down Bullet Club had not changed. In the other match, Katsuyori Shibata was set to defend the NEVER Openweight Championship against Hiroyoshi Tenzan. On February 11 at The New Beginning in Osaka, NJPW veterans Tenzan, Manabu Nakanishi, Satoshi Kojima and Yuji Nagata came together and proclaimed their intention of showing that they, the so-called \"third generation\", could still perform at a top level. As part of the new movement, Kojima announced his intention of challenging Katsuyori Shibata for the NEVER Openweight Championship. The match took place on March 19 and saw Shibata retain his title. Afterwards, Tenzan entered the ring and challenged Shibata to a title match, which was made official for Invasion Attack 2016 three days later. The match would mark Tenzan's first shot at a singles NJPW title since October 2006.\nAlso added was a tag team match in the rivalry between the Chaos and Los Ingobernables de Japón (L.I.J.) stables, which would see the former's Hirooki Goto and Tomohiro Ishii take on the latter's Bushi and Evil. On February 11 at The New Beginning in Osaka, Goto unsuccessfully challenged Kazuchika Okada for the IWGP Heavyweight Championship, setting a new NJPW record with his eighth loss in as many shots at the title. After the match Okada praised Goto and offered him a spot in his Chaos stable, essentially as a replacement for former leader Shinsuke Nakamura, who had recently left NJPW. Over the next month, Okada made several invitations to Goto, but was turned down each time with Goto stating that it would not make sense for him to form a partnership with Okada as he would again challenge him for the IWGP Heavyweight Championship if he were able to win the New Japan Cup. After losing to Tetsuya Naito in the tournament's finals on March 12, Goto was attacked by Naito and his L.I.J. stable, which led to Okada running out and chasing them away. Afterwards, Goto finally shook Okada's hand and accepted his invitation, becoming the newest member of Chaos. With Okada and Naito set to main event Invasion Attack 2016, Chaos and L.I.J. continued their rivalry during the Road to Invasion Attack 2016 tour, which also featured Goto's first match as a member of Chaos and Tomohiro Ishii successfully defending the ROH World Television Championship against Evil.\nEvent\n, who made a surprise debut in the main event of Invasion Attack 2016, helping Tetsuya Naito capture the IWGP Heavyweight Championship]]\nIn the first title match of the event, Roppongi Vice defeated Matt Sydal and Ricochet to become the new IWGP Junior Heavyweight Tag Team Champions. The win marked the second title reign for Roppongi Vice and a record-tying sixth reign for Rocky Romero. In the next match, Kushida made his third successful defense of the IWGP Junior Heavyweight Championship against the debuting Will Ospreay. After the match, Kushida accepted a challenge from Jyushin Thunder Liger, who stated his intention of becoming a 12-time IWGP Junior Heavyweight Champion. In the third title match, Hiroshi Tanahashi, Michael Elgin and Yoshitatsu defeated Kenny Omega, Matt Jackson and Nick Jackson, with Elgin pinning Nick, to win the NEVER Openweight 6-Man Tag Team Championship. During the match, Nick Jackson dove from one of the arena's balconies with a swanton bomb onto a group of six wrestlers, which included Cody Hall, who had accompanied his Bullet Club stablemates to the ring. Afterwards, Hall was carried out on a stretcher after suffering what was believed to be a stinger. After the match, Elgin had a confrontation with Omega, seemingly setting up a match for Omega's IWGP Intercontinental Championship between the two. After the other participants had left the ringside area, Tanahashi was attacked by Bullet Club member Bad Luck Fale. In the other NEVER title match, Katsuyori Shibata made his third successful defense of the NEVER Openweight Championship against Hiroyoshi Tenzan. Following the win, Shibata kicked Yuji Nagata, who had accompanied Tenzan to the ring, setting up his next challenger. In the semi-main event, the Guerrillas of Destiny defeated G.B.H. to bring the IWGP Tag Team Championship back to Bullet Club.\nThe main event featured Kazuchika Okada defending the IWGP Heavyweight Championship against Tetsuya Naito. After referee Red Shoes Unno was knocked out of the match, Naito's L.I.J. stablemates Bushi and Evil entered the ring and attacked Okada, but were eventually taken out by the champion. Then a man in a mask entered the ring and attacked Okada, before unmasking himself as Seiya Sanada. Okada managed to avoid Naito's finishing maneuver, the Destino, and looked for his own finishing maneuver, the Rainmaker, but Naito countered that into a Destino to win the match and become the new IWGP Heavyweight Champion. After the match, L.I.J. continued attacking Okada until they were sent out of the ring by Okada's Chaos stablemates Hirooki Goto and Tomohiro Ishii. Before leaving the ring and allowing NJPW to present Naito with his title, Ishii had a staredown with the new champion. After being given the title belt, Naito attacked Red Shoes Unno, thanked the fans in attendance for their support and stated that L.I.J., now made up of himself, Bushi, Evil and Sanada, had taken over NJPW. Naito then threw the belt down and left the ring without it to close the show.\nReception\n, whose debut was praised by critics]]\nIn his review of the event, Dave Meltzer of the Wrestling Observer Newsletter gave the highest rating of four and a half stars out of five to the IWGP Junior Heavyweight Championship match, calling it a \"fantastic debut for Ospreay\", adding that even though the NJPW crowd was not familiar with Ospreay, they \"immediately realized he was something special\". He gave his second highest rating of four and a quarter stars to the IWGP Junior Heavyweight Tag Team Championship and the IWGP Heavyweight Championship matches. Meltzer also noted how the NJPW crowd was firmly behind the heel Naito in the main event, after rejecting him in 2013 when he was a face and was being groomed to main event Wrestle Kingdom 8 in Tokyo Dome. He added that in turning Naito heel by having him copy the successful Los Ingobernables concept from the Mexican CMLL promotion, NJPW had given WWE the \"blueprint\" on its \"Roman Reigns fan reaction issue\". Overall, Meltzer praised the booking of the show, stating that \"every single result made sense\".\nSean Radican of Pro Wrestling Torch gave the show an overall score of 8.5, praising in particular the IWGP Junior Heavyweight Tag Team, IWGP Junior Heavyweight and IWGP Heavyweight Championship matches, giving the latter two his highest match ratings of the show, four and a quarter stars out of five.\nLarry Csonka of 411Mania gave the show an overall score of 9, stating that it was \"a big show that came off as an important show\", calling the IWGP Junior Heavyweight Tag Team and Heavyweight Championship matches \"great\" and the match between Kushida and Ospreay a \"match of the year contender\". He, however, also called the IWGP Tag Team Championship match \"a failure on every level\", stating that Loa \"failed on the big stage, just as he failed on the smaller stage in TNA\", adding that he \"pulled Tonga down to his level\".\nResults\n|times=\n|match1=Bullet Club (Bad Luck Fale and Yujiro Takahashi) defeated Juice Robinson and Ryusuke Taguchi\n|stip1=Tag team match\n|time1=03:45\n|match2=Jyushin Thunder Liger, Satoshi Kojima and Yuji Nagata defeated Chaos (Kazushi Sakuraba, Toru Yano and Yoshi-Hashi)\n|stip2=Six-man tag team match\n|time2=07:06\n|match3=Chaos (Hirooki Goto and Tomohiro Ishii) defeated Los Ingobernables de Japón (Bushi and Evil)\n|stip3=Tag team match\n|time3=10:36\n|match4=Roppongi Vice (Beretta and Rocky Romero) defeated Matt Sydal and Ricochet (c)\n|stip4=Tag team match for the IWGP Junior Heavyweight Tag Team Championship\n|time4=15:48\n|match5=Kushida (c) defeated Will Ospreay\n|stip5=Singles match for the IWGP Junior Heavyweight Championship\n|time5=15:07\n|match6=Hiroshi Tanahashi, Michael Elgin and Yoshitatsu defeated The Elite (Kenny Omega, Matt Jackson and Nick Jackson) (c) (with Cody Hall)\n|stip6=Six-man tag team match for the NEVER Openweight 6-Man Tag Team Championship\n|time6=14:46\n|match7=Katsuyori Shibata (c) defeated Hiroyoshi Tenzan (with Manabu Nakanishi, Satoshi Kojima and Yuji Nagata)\n|stip7=Singles match for the NEVER Openweight Championship\n|time7=10:47\n|match8=Guerrillas of Destiny (Tama Tonga and Tanga Loa) defeated G.B.H. (Togi Makabe and Tomoaki Honma) (c)\n|stip8=Tag team match for the IWGP Tag Team Championship\n|time8=16:54\n|match9=Tetsuya Naito (with Bushi and Evil) defeated Kazuchika Okada (c) (with Gedo)\n|stip9=Singles match for the IWGP Heavyweight Championship\n|time9=28:50\n}}\nReferences\nExternal links\n*[http://www.njpw.co.jp/ The official New Japan Pro-Wrestling website]"
    }
  ]
}