{
  "content": [
    {
      "type": "text",
      "text": "# Invasion of Salamaua–Lae\n\n| combatant2        =\n| commander1        =  Wilson Brown\n| commander2        =  Shigeyoshi Inoue\n| units1            =  Task Force 17\n| units2            =  4th Fleet\n| strength1         = 2 aircraft carriers122 aircraft\n| strength2         = 4 heavy cruiser2 light cruiser8 destroyers1 minesweeper1 minelayer4 transport ships\n| casualties1       = 1 aircraft destroyed11 aircraft damaged 2 killed\n| casualties2       = 3 transport ships sunk1 minesweeper sunk1 light cruiser damaged2 destroyers damaged1 minelayer damaged1 seaplane tender damaged1 transport damaged130 killed (6 Army, 126 Navy)\n250 wounded\n}}\nThe invasion of Salamaua–Lae (8–13 March 1942), called Operation SR by the Japanese, was an operation by Imperial Japanese forces to occupy the Salamaua–Lae area in the Territory of New Guinea during the Pacific campaign of World War II.  The Japanese invaded and occupied the location in order to construct an airfield and establish a base to cover and support the advance of Japanese forces into the eastern New Guinea and Coral Sea areas. As the Japanese arrived, the tiny Australian garrison in the region retreated and did not oppose the invasion.\nIn response to the Japanese landings, a United States Navy aircraft carrier task force including the carriers  and Lexington struck the invading Japanese naval forces with carrier aircraft on 10 March.  Supporting the carrier aircraft were eight B-17 bombers of the 435th Bombardment Squadron of the 19th Bombardment Group from Garbutt Field, Townsville, Australia and eight Royal Australian Air Force Hudson bombers of No. 32 Squadron from Port Moresby, New Guinea. The raid sank three transports and damaged several other ships.\nIn spite of the losses sustained during the air raid, Japanese forces successfully occupied Lae and Salamaua and began the construction of a base and airfield.  Air units based at the airfield later supported an air superiority campaign against Allied forces at Port Moresby.  In July 1942 after the Japanese abandoned plans to invade Port Moresby from the sea, the base at Salamaua–Lae supported the ultimately unsuccessful Japanese land offensive towards Port Moresby along the Kokoda Track.\nLanding\nIn early 1942, the Japanese high command began planning operations in the New Guinea and the Solomon Islands, as part of an overall strategy of establishing bases in the South Pacific from which to interdict Allied lines of communication between the US and Australia. As a part of this strategy, it was determined that there was a need to capture Lae, Salamaua, Tulagi and Port Moresby to establish bases, and to prepare for further operations in the South Pacific in order to push a defensive perimeter further south. For the invasion of Salamaua and Lae, the Japanese 4th Fleet, under the command of Shigeyoshi Inoue, and Tomitarō Horii's South Seas Detachment established a landing force built around the 2nd Battalion, 144th Infantry Regiment, under the command of Major Horie Masao, and a battalion of the Kure Special Naval Landing Force.\nTo support the operation, the Imperial Japanese Navy formed an escort group under the command of Rear Admiral Kajioka Sadamichi. To this group, the Japanese assigned the heavy cruisers Aoba, Kinugasa, Furutaka and Kako, the light cruisers Tenryu, Tatsuta, and , the destroyers Mutsuki, Mochizuki, Yoyoi, Asanagi, Oite, and Yūnagi.\nThe invasion fleet left Rabaul on 5 March 1942, consisting of Sadamichi's group, assorted auxiliary vessels, and the transports.  The troop transports Yokohama Maru and China Maru sailed for Salamaua carrying Horie's troops, while the transports Kongō Maru and Kokai Maru, along with the auxiliary minelayer  were destined for Lae with the naval landing party. Air operations were flown by the 24th Air Flotilla around Port Moresby, Lae and Bulolo in support.\nDeparting Rabaul, the Japanese landed on 8 March 1942 at Lae and Salamaua. The Horie Unit was assigned the task of capturing Salamaua, including the airfield and township, while the naval landing force was given the responsibility for taking Lae. At Lae, the Japanese landed without opposition. A small detachment of the New Guinea Volunteer Rifles and some men from the 2/22nd Infantry Battalion set about the demolition of key infrastructure around Salamaua, and after a minor skirmish which resulted in one Japanese casualty, they destroyed the bridge over the Francisco River and then withdrew into the hills towards Mubo. Initial air interdiction by Hudsons from No. 32 Squadron resulted in three Japanese killed and eight wounded on the Yokohama Maru. Another strike by a Hudson around Lae resulted in light damage to the Asanagi.\nSalamaua–Lae Raid\nIn the early morning of 10 March 1942,  Task Force 17 aircraft carriers Lexington and  launched their aircraft from the Gulf of Papua off the southern shore of New Guinea. The Task Force, under the command of Admiral Wilson Brown,  had avoided detection by the Japanese, and the approach of their aircraft from over the Owen Stanley Range enabled the attackers to appear seemingly out of nowhere. The   distance from which the planes were launched provided security for the task force and helped ensure surprise against the Japanese.\nApproaching the northern landing areas, the attack commenced with the SBD Dauntless dive bombers of Lexingtons Scouting Squadron 2 (VS-2), which struck the Japanese shipping at Lae at 09:22. They were soon followed by Dauntless dive bombers of Bombing Squadron 2 (VB-2) and the Douglas TBD Devastators of Lexingtons Torpedo Squadron 2 (VT-2), which attacked shipping at Salamaua at 09:38 while the Wildcats of Fighter Squadron 2 (VF-2) strafed Lae and Salamaua.  Salamaua was struck again some 30 minutes later by Yorktowns Bombing Squadron 5 (VB-5), Torpedo Squadron 5 (VT-5) and Fighter Squadron 42 (VF-42), while the Dauntless dive bombers of  VS-5 attacked the auxiliary ships along the shore at Lae.\nFollowing the carrier aircraft strike, eight B-17 bombers of the 435th Bombardment Squadron flying from Garbutt Field at Townsville arrived and bombed the target area as well, causing further damage.\nThree transports (Kongō Maru, Tenyō Maru, and Yokohama Maru) were sunk.  In addition, the light cruiser Yubari, two destroyers (Asanagi and Yūnagi),  the transport Kokai Maru, the minelayer , the seaplane tender , and the auxiliary minesweeper Tama Maru No. 2 were damaged.  Tama Maru No. 2 ended up sinking three days later due to damage inflicted by the raid. Two of the transport losses were awarded to the carrier aircraft, while the cargo ship was awarded jointly to the carrier planes and the B-17s. Japanese casualties amounted to 130 killed and 250 wounded.\nOf the 104 aircraft that took part, one SBD-2 Dauntless dive bomber of VS-2 was shot down by Japanese anti-aircraft fire, with the loss of both crew members. A further eleven aircraft were damaged.\nThe raid sank or damaged two thirds of the invasion transports employed.  Higher casualties among the Japanese Army personnel were  only prevented by the fact that most of the transports had been close to shore and could beach themselves. The psychological impact was greater, putting the Japanese on notice that the Americans were willing to place their carriers at risk to oppose their moves in the region. The fear of interdiction by US carrier forces against future operations contributed to the decision by the Japanese to include fleet carriers in their later plan to invade Port Moresby, resulting in the Battle of the Coral Sea.\nAftermath\nFollowing the completion of the operation to capture Lae and Salamua, the Japanese began operations to capture Tulagi, in the Solomon Islands, as the next stage in the establishment of a defensive perimeter in the South Pacific. Meanwhile, beginning 18 March, they began to push inland from Salamaua, while around Lae they were confined mainly to the town for several weeks. While Japanese plans to secure Port Moresby were postponed after the Battle of the Coral Sea, they continued operations in the vicinity, and developed an airfield and large base facilities in the Salamaua–Lae area. These facilities later supported their ground operations during the Kokoda Track campaign. Throughout 1942, the Australians largely withdrew from the area towards Wau, but continued guerilla style operations in the area with the establishment of Kanga Force, which conducted observation and small scale raiding around Salamaua and Lae. The Allies later regained control of the Salamaua–Lae area in September 1943 following the conclusion of the Salamaua–Lae campaign.\nReferences\nNotes\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\nExternal links\n*\n*"
    }
  ]
}