{
  "content": [
    {
      "type": "text",
      "text": "# Invasion U.S.A. (1985 film)\n\n| music          = Jay Chattaway\n| cinematography = João Fernandes\n| editing        = Daniel LoewenthalScott Vickrey\n| distributor    = Cannon Releasing Corporation\n| released       =\n| runtime        = 107 minutes\n| country        = United States\n| language       = English\n| budget         = $12 million\n| gross          = $17.5 million\n& $24 million (overseas)\n}}\nInvasion U.S.A. is a 1985 American action film produced by Cannon Films, and starring Chuck Norris. It was directed by Joseph Zito. It involves the star fighting off a force of Soviet/Cuban-led guerrillas.\nBoth Chuck Norris and his brother, Aaron, were involved in the writing. It was made in the greater Atlanta area of Georgia, and Fort Pierce, Florida. Miami landmarks such as Dadeland Mall and Miracle Mile can also be seen in the film.\nPlot\nA group of Cuban refugees is on a boat sailing for the United States and is at first met by what appears to be a US Coast Guard boat with armed personnel. The captain of the vessel declares that the refugees are welcomed to the United States, but the Guardsmen open fire on them and take several bags of cocaine hidden in the boat. It is revealed that the armed personnel were Latin American guerrillas disguised as Guardsmen on board a hijacked Coast Guard vessel.\nEventually, the real Coast Guard finds the boat with the murdered American Coast Guardsmen off the coast of Florida. The FBI and the Miami Police Department arrive at the docks to investigate the murders. The guerrillas land in Florida and exchange the drugs for weaponry from a drug dealer. They are led by the Soviet operative Mikal Rostov (Richard Lynch), the fake Coast Guard captain who opened fire on the Cuban refugees. Former CIA agent Matt Hunter (Norris) is asked to come out of retirement, but he declines. When Rostov and a team of guerrillas destroy Hunter's residence in the Everglades and kill his friend, John Eagle (Dehl Berti), in a failed assassination attempt, Hunter is convinced to reconsider.\nLater that day, hundreds of additional guerrillas land on the beaches of Southern Florida and move inland using several pre-positioned trucks. The guerrillas begin their assault by destroying suburban homes. Another group of guerrillas impersonating Miami police officers attacks a community center full of Cuban expatriates in Miami. When a squad car with genuine Miami policemen drives by to investigate the gunfire, the survivors angrily start vandalizing their car and leave the police perplexed. The FBI has no idea who is behind the attacks, but Hunter and the CIA believe that Rostov is behind the attacks. As terrorist acts continue in Miami, race riots and general chaos develop within the city, just as the terrorists planned.\nLater that night, the guerrillas start a shootout and bomb threat at a mall at which people are doing their Christmas shopping. During the attack, Hunter, having shaken down an informant, comes into the mall and takes down the guerrillas one by one. US National Guard troops are called up, martial law is declared in the city, and armed civilians organize to protect their communities from further guerrilla attacks. Hunter continues pursuing the terrorists and thwarts their plans to bomb a church. One community evacuates their children by school bus to safer rural areas, unknowingly containing a bomb planted by Nikko Kador, Rostov's right-hand man. Hunter grabs the bomb from the moving bus, then throws it at the vehicle of Nikko, who had been shadowing this, eliminating him. However, after arriving at a carnival bombed by the terrorists, Hunter realizes that they are spread out too far for him to stem the tide of their attacks effectively and so devises an alternative plan.\nAlarmed by the threat, the government establishes a special theater command for the Southeastern United States with the headquarters at the Georgia-Pacific Tower in Atlanta. At the command center, all 50 state governors and military officials meet to stop the terror attacks. The FBI takes Hunter into custody for vigilantism against the terrorists, and he is taken to the command center, where he goads Rostov on national television to come out and kill him. Rostov orders all the guerrillas to assault the center in a mass attack, but they find no one inside. Hunter's arrest was a trap, and the National Guard arrives with tanks and troops, which hems the assailants in. While the battle rages outside, Hunter finally comes face to face with Rostov and kills him with an M72 LAW. The terror crisis ends when the few remaining guerrillas on the street surrender to the National Guard.\nCast\n* Chuck Norris as CIA Agent Matt Hunter\n* Richard Lynch as Mikhail Rostov\n* Melissa Prophet as Dahlia McGuire\n* Alexander Zale as Nikko Kador\n* Alex Colon as Tomas Montoya\n* Eddie Jones as FBI Agent-In-Charge Marvin Cassidy\n* Jon DeVries as FBI Agent Frank Johnston\n* James O'Sullivan as FBI Agent Fred Harper\n* Billy Drago as Mickey Seidman\n* Jaime Sánchez as Luis Castillo\n* Dehl Berti as John Eagle\n* Stephen Markle as Clyde Flynn\n* Shane McCamey as Kurt Schnell\n* Martin Shakar as CIA Agent Peter Adams\n* James Pax as Koyo Gotoda\nProduction\nThe film was the first in a six-film contract Chuck Norris signed with Cannon Films following the success of the Missing in Action films.\nNorris said he got the idea to make the film after reading an article in ''Reader's Digest'' that said hundreds of terrorists were running loose in the United States. \"I thought, 'Boy, that's scary, he said. What if some guy on the order of a Khomeini or a Khadafi mobilized those guys and started sending them out to every major city?'... I know it's going to happen, and even in the movie, the head terrorist says, 'It's so easy because of the freedom of movement in this country.' So we're really accessible to this. The movie is not meant to scare people, but to make us aware of a potential problem.\"\n\"We're trying to make a statement here\", he added. \"This is about the people of the United States.\"\nThe film was given a $12 million budget, twice what Norris films had normally gotten before. There was a sequence in the everglades costing $2 million. Norris' fee was almost $2 million. Shooting took ten weeks.\nNorris says he wanted the role of the female journalist to be played by Whoopi Goldberg who had been an extra in A Force of One. Goldberg was enthusiastic. However, the director, Joseph Zito, overruled Norris. \"Needless to say I have never used that director again\", wrote Norris later.\nAccording to the 2014 documentary Electric Boogaloo: The Wild, Untold Story of Cannon Films, the scene in which terrorists destroy homes in a suburb with rocket launchers featured explosions in actual houses. Hartsfield–Jackson Atlanta International Airport was going to bulldoze an entire suburban neighborhood to extend a runway, so the filmmakers were allowed to destroy the existing homes. Similarly, part of Avondale Mall was being rebuilt, so the filmmakers were allowed to destroy everything in the actual mall.\nNorris said this sequence cost $5 million. \"There are tanks firing, and helicopters flying among the real buildings\", he said. \"It's a battle like in Gone with the Wind, one of the best action battle scenes that's ever been done so far.\"\nReception\nBox office\nThe film debuted at number one at the box office with $6.9 million. The film made $17.5 million at the U.S. Box Office and $24 million at the overseas box office making it a box office hit.\nCritical response\nRoger Ebert gave the film 0.5 stars out of 4 and called it \"a brain-damaged, idiotic thriller, not even bad enough to be laughable.\" Vincent Canby of The New York Times called the film \"a 'Wake Up, America!' movie of a goofiness to make one long for the sanity and conviction of John Milius's Red Dawn,\" adding that though Chuck Norris \"seemed on the verge of becoming a kind of benign Clint Eastwood character, he loses all credibility in this awful film. Even though Mr. Norris collaborated on the screenplay and helped to choose the director (Joseph Zito), the movie treats him as if it wanted to prove that he has absolutely no future on the screen.\" Variety wrote, \"A brainless plot would be almost forgivable were it not for the perverse depiction of innocents butchered in Invasion U.S.A. Star Chuck Norris, who co-wrote the script and has recently chiseled a popular niche with his 'Missing in Action' and 'Code of Silence' pictures, hits his nadir with this vicious-minded commodity from the Cannon Group. The 'Rambo' audience will blink at this one. Yes, it will make some money.\" Gene Siskel of the Chicago Tribune gave the film 1 star out of 4 and wrote that it \"has a terrific premise but no script.\" Michael Wilmington of the Los Angeles Times called it \"a brutal, one-note, sadistic affair (though it has, to its credit, non-stop action, a good score and a chilling performance by Lynch).\" Paul Attanasio of The Washington Post wrote, \"'Invasion USA' might actually be fun in a campy way if it weren't so dourly exploitative\", and called Norris \"an actor whose most evocative facial expression is his beard.\"\nOn Rotten Tomatoes, the film has an approval rating of 18% based on 22 reviews. On Metacritic the film has a weighted average score of 29 out of 100, based on 8 critics, indicating \"generally unfavorable\" reviews. Like many Cannon films, it developed a cult following.\nLegacy\nNorris later said some sequences were \"a little . . . too much. You see, when you're making a movie, it takes over five months. Not until you bring it down to an hour and an half do you see just what you've done. It was . . . too much, unfortunately.\"\nSequel\nThe 1986 film Avenging Force was originally intended as a sequel until Chuck Norris turned it down. It was instead made as a standalone sequel starring Michael Dudikoff, sharing only the protagonist's name.\nOther media\nNovel\nA novelization was released in October 1985 by Pinnacle Books.\nLP record\nJay Chattaway's score was released by Varèse Sarabande on LP in 1985. It was later re-released, remastered with many minutes of new material, on CD in 2008 from Intrada Records. This was a limited edition of 1,000 copies.\nSee also\n* Chuck Norris filmography\n* Red Dawn\n*Invasion, U.S.A. (1952 film)\nReferences\nExternal links\n*\n* [http://www.bad-good.org/invasion.php Review with clip, screenshots and sounds]\n*"
    }
  ]
}