{
  "content": [
    {
      "type": "text",
      "text": "# Invasion of the Sea\n\n| publisher     = Pierre-Jules Hetzel\n| release_date  = 1905\n| english_pub_date  = 2001\n| media_type    = Print (hardback)\n| preceded_by   = Master of the World\n| followed_by   =\n}}\nInvasion of the Sea () is an adventure novel written by Jules Verne. It was published in 1905, the last to be published in the author's lifetime, and describes the exploits of Berber nomads and European travelers in Saharan Africa. The European characters arrive to study the feasibility of flooding a low-lying region of the Sahara desert to create an inland sea and open up the interior of Northern Africa to trade.  In the end, however, the protagonists' pride in humanity's potential to control and reshape the world is humbled by a cataclysmic earthquake which results in the natural formation of just such a sea.\nPlot summary\nInvasion of the Sea takes place in a future 1930s and follows the story of European engineers and their military escort who seek to revive an actual 19th century proposal to flood the Sahara desert with waters from the Mediterranean Sea to create an inland \"Sahara Sea\" for both commercial and military purposes. The French military escort, led by Captain Hardigan, meet with conflict from Tuareg Berber tribes who fear the new sea will threaten their nomadic way of life. The Berber tribes, led by the warlord Hadjar, begin an insurgency campaign against the Europeans in an effort to derail their plans for the inland sea. Captain Hardigan attempts to retaliate against the Berbers and bring Hadjar to justice. Ultimately, however, a disastrous earthquake strikes. This earthquake floods the Sahara to an extent beyond even limits which were proposed by the Europeans, and drowns the insurgent Tuaregs.\nHistorical background\nThe novel Invasion of the Sea, as well the plans of the characters in the novel, are inspired by the real-life exploits of Captain François Élie Roudaire. Roudaire was a French military officer and geographer who surveyed parts of Tunisia in the late 1800s. He discovered that large areas of the Sahara Desert were below sea level and proposed that a canal be dug from the Mediterranean Sea to these Saharan basins, which would allow for the creation of an inland \"Sahara Sea\". Others had made similar proposals at the same time, and canal building generally was a popular geopolitical endeavor of the first decade of the 1900s, when Invasion of the Sea was written.\nSome have noted that the inclusion of the Berber raiders (who are opposed to the efforts of the European engineers and military officers) is a foreshadowing of the growth of Islamic terrorism in the 1900s and 2000s.\nTranslation history\nParts of the novel, under the title Captain Hardizan, were serialized in The American Weekly (the Sunday Supplement to the Boston newspaper) on August 6 and August 13, 1905, by Oswald Mathew. The first complete English translation was published by Wesleyan University Press in 2001 by Edward Baxter. It was slated to be the first in a series of early science fiction reprints from Wesleyan University Press. It contained many illustrations from the original French edition.\nThe history of Invasion of the Sea was unusual in this regard. For years before the Baxter translation, Invasion of the Sea was one of four late Voyages Extraordinaires novels left unpublished in their whole form (the others being The Mighty Orinoco, The Kip Brothers, and Traveling Scholarships). Early translators of Verne for British and American readers in the late 1800s and early 1900s were notorious for making major changes to Verne's novels in the translation and editing process. Translators would, for example, change names and even character motivations at times. Other changes were aimed at removing the anti-imperialist themes which Verne was known to espouse in his work, while others still were made by Verne's son. No contemporary translation was as notorious for its revisionism as the Captain Hardizan edition of Invasion of the Sea, however. Mathew's translation changes were so dramatic that they changed the focus to a young European woman captured by an Arab raiding party. The Arabs themselves were described as being led by a different woman of supernatural abilities.\nContemporary reviews and criticism\nReviews have differed in their opinions between different editions of Invasion of the Sea and its various English translations. While early English translations have been criticized for their unfaithfulness to the original French text, particularly in removing the anti-colonialist themes for British and American audiences, modern translations have been praised for their much greater faithfulness to the source.\nThe 2001 translation by Edward Baxter was viewed in a mostly positive light, and most criticisms were directed towards problems with the original work by Jules Verne. Publishers Weekly criticized the character development (with the exception of that of an affable dog named Ace-of-Hearts), while also describing the plot as both \"disjointed\" and \"predictable\", saying that the book is overwhelmed with a \"deluge of scientific facts\". Brian Taves of the North American Jules Verne Society praised the use of multiple perspectives in the narrative (both French and North African) and the novel's political sophistication. He criticized the novel, however, for a general lack of excitement. On the other hand, ''Harper's Magazine'' described the book as a \"ripping good yarn\". A common theme in reviews was the novel's seeming prescience about the growing significance of Islamic terrorism.\nPublication history\n*Invasion of the Sea, Trans. Edward Baxter, Ed. Arthur Evans.  Middletown, Connecticut: Wesleyan University Press, c2001.\nSee also\n*Qattara Depression Project\n*Chott Melrhir\nReferences"
    }
  ]
}