{
  "content": [
    {
      "type": "text",
      "text": "# Invisible Empires\n\n| recorded   =\n| venue      =\n| studio     =\n| genre      = Contemporary Christian music, acoustic, folk\n| length     =\n| label      = Fair Trade/Columbia\n| producer   =\n* Steve Hindalong\n* Stephen Leiweke\n| prev_title = Fireflies and Songs\n| prev_year  = 2009\n| next_title = Floodplain\n| next_year  = 2015\n}}\nInvisible Empires is the seventh studio album and tenth album overall from Christian singer and songwriter Sara Groves, and it released on October 18, 2011, by Fair Trade and Columbia Records. The producers on the album were Steve Hindalong and Stephen Leiweke. This release became critically acclaimed and commercially successful.\nBackground\nThe album released on October 18, 2011, by Fair Trade and Columbia Records, and it was produced by Steve Hindalong and Stephen Leiweke. This was the seventh studio album and tenth overall from the singer.\nCritical reception\n| rev2 = Allmusic\n| rev2score =\n| rev3 = Alpha Omega News\n| rev3Score = A+\n| rev4 = CCM Magazine\n| rev4score =\n| rev5 = The Christian Manifesto\n| rev5score =\n| rev6 = Christian Music Zine\n| rev6score =\n| rev7 = Christianity Today\n| rev7score =\n| rev8 = Cross Rhythms\n| rev8score =\n| rev9 = Jesus Freak Hideout\n| rev9score =\n| rev10 = Louder Than the Music\n| rev10score =\n| rev11 = New Release Tuesday\n| rev11score =\n| rev12 = The Phantom Tollbooth\n| rev12score =\n}}\nInvisible Empires garnered critical acclaim from music critics. At CCM Magazine, Andrew Greer rated the album four stars, calling this \"another graceful chapter in Groves' remarkable discography.\" James Christopher Monger of Allmusic rated the album four stars, noting \"Groves' penchant for capturing the cathartic weight of intimate moments is on full display here, and her winning melodies and effortless delivery only help to the sweeten the pot.\" At Christianity Today, Andy Whitman rated the album four stars, highlighting the release as \"another musical triumph.\"\nMark Sherwood of Cross Rhythms rated the album eight out of ten squares, writing that \"'Invisible Empires' didn't instantly hit me and took time to grow but the more you listen to these finely crafted songs the better they become.\" At Jesus Freak Hideout, Alex \"Tincan\" Caldwell rated the album four-and-a-half stars, stating that \"Sara Groves has opened up yet another great conversation with the world.\" Kim Jones of About.com rated the album four-and-a-half stars, commenting that \"The beauty of it is that she does it in a such a delicate manner that it takes more than one listen to really understand the true depth of the mine she just dug in your heart.\"\nAt New Release Tuesday, Kevin Davis rated the album five stars, affirming that \"Truly, every song is amazing.\" The Phantom Tollbooth's Bert Saraco rated it four tocks, and felt that \"In a day when every other artist is playing with auto-tuning and sampled sounds Sara Groves has once again delivered an album of music for, and by, human beings.\" Michael Dalton of The Phantom Tollbooth rated it four tocks, noting that the music is \"appealing\" because of the deep spiritual \"depths\" it plunges into, which writing that \"Groves has not labored in vain\", and stating that we should \"Listen and be in awe of what God can do with an open hand and heart.\"\nAt Louder Than the Music, Jono Davies rated the album four-and-a-half stars, alluding to how \"As much as I genuinely love this album and the voice that is Sara Groves, at times if you're not in the mood for this kind of soft melodic music you can see that the album songs can easily flow too easily into one another.\" However, Davies finished by stating that \"It will make you smile, cry, and think, well basically the whole album makes you do that.\" Tom Frigoli of Alpha Omega News graded the album an A+, telling that he \"left refreshed, inspired, and unable to get those catchy songs out of my head\" on yet \"Another excellent album from Sara Groves.\" At The Christian Manifesto, Lydia Akinola rated the album five stars, proclaiming that \"The album is full of fantastic tracks.\"\nCommercial performance\nFor the Billboard charting week of November 5, 2011, Invisible Empires was the No. 96 most sold album in the entirety of the United States via The Billboard 200 placement, and it was the No. 6 most sold album in the Christian music market segment via the Christian Albums position. In addition, the album was the No. 2 folk album sold by the Folk Albums chart, and it was the No. 25 most sold album in the rock albums category via the Top Rock Albums charting. It was the No. 88 Top Current Album, which are just the new albums out minus the catalog titles in The 200.\nTrack listing\nPersonnel\n* Sara Groves – vocals, acoustic piano\n* Ben Shive – keyboards, horn and string arrangements\n* Tyler Burkum – electric guitars\n* Stephen Leiweke – acoustic guitars, electric guitars, loops\n* Marc Byrd – ambient electric guitar (2, 7, 10)\n* Aaron Fabbrini – bass\n* Zach Miller – drums, loops\n* Steve Hindalong – percussion, glockenspiel\n* Jeremy Bose – trumpet, French horn\n* Matt Slocum – cello\n* David Davidson – violin\n* Andy Gullahorn – backing vocals (5, 8)\n* Jill Phillips – backing vocals (5, 8)\n* The New City Kids Church Choir (Jersey City, New Jersey) – choir (7)\nProduction\n* Troy Groves – executive producer\n* Steve Hindalong – producer\n* Stephen Leiweke – co-producer, engineer, mixing\n* Daniel Steele – engineer (7)\n* Jim DeMain – mastering at Yes Master (Nashville, Tennessee)\n* Wayne Brezinka – design, illustration\n* Will Keelor – photography\nCharts\n{| class=\"wikitable sortable\" border=\"1\"\n|-\n! Chart (2011)\n! Peak position\n|-\n|-\n|-\n|-\n|}\nReferences"
    }
  ]
}