{
  "content": [
    {
      "type": "text",
      "text": "# Invisible Empire (song)\n\n|country folk}}\n| length     = 3:52\n| label      = Virgin\n| writer     = KT Tunstall\n| producer   =\n| prev_title = Feel It All\n| prev_year  = 2013\n| next_title = Made of Glass\n| next_year  = 2013\n}}\n\"Invisible Empire\" is a single by Scottish recording artist KT Tunstall. It was released as the third single from her fourth studio album Invisible Empire // Crescent Moon, on 19 August 2013 through iTunes, Amazon and other platforms. The cover for the single depicts Tunstall wearing medieval outfits, holding a rusting crown in front of the sea.\nThe song was first played live in 2012 in a concert with Daryl Hall, and then, it was played a few weeks before the album's release on Later... with Jools Holland and some radio stations. A music video premiered on 30 July 2013 and was acclaimed by critics for its Game of Thrones medieval style.\nComposition\n\"Invisible Empire\" is the very first song Tunstall wrote from Invisible Empire // Crescent Moon, and the opening track of the album. She had played a live version of it in a concert with Daryl Hall in 2012 as a teaser from the new album, but did not say anything about the new album at the time, she simply said \"This is a new track\". She wrote that first song as an anthem to the fall of what she calls her \"empire of thoughts\", referring to her marriage, music, and the baldness of everybody's thoughts : \"Invisible Empire\" sets a scene of uncertainty and fragility for the album. About the song, Tunstall said in an interview with Stereoboard \"It’s about creating a reality that is only based on what you want to see, not what’s real. It’ll either come crashing down, or you’ll want to set it alight yourself to find the truth. It’s about the idea that if you try and control life, you kill it, but if you let it flow in its way, it can flourish\".\nPromotion\nAlong with \"Made of Glass\" and \"Feel It All\", \"Invisible Empire\" is one of the most-played live songs. She first played it on the radio on 29 April 2013, on BBC Radio 2, on the Ken Bruce Show with \"Made of Glass\" and \"Feel It All\". It was played acoustic on her appearance on Later... with Jools Holland, and on some promotional live videos (Yahoo, KFOG...). \"Invisible Empire\" is also a part of the Invisible Empire // Crescent Moon Tour and features the live album Live Islington Assembly Hall CD.\nTrack listing\nRelease history\n{| class=\"wikitable\"\n|-\n! Region\n! Date\n! Label\n! Format\n|-\n| World Wide\n|rowspan=\"1\"|\n|rowspan=\"1\"| Virgin\n|rowspan=\"1\"| digital download\n|-\n|}\nReferences"
    }
  ]
}