{
  "content": [
    {
      "type": "text",
      "text": "# Ipswich ware\n\n]]\nIpswich ware is a type of Anglo-Saxon pottery produced in Britain between the eighth and ninth centuries AD. Manufactured in the Ipswich, Suffolk area, it is considered to be the first wheel-turned and mass-produced pottery in post-Roman Britain. The pottery is a simple, hard grey ware with little or no decoration. Most vessel types include jars, cooking pots and decorated pitchers. Ipswich ware was distributed primarily in eastern Britain, but was also traded in smaller numbers from Kent north to York and west to Oxfordshire.\nDescription\nIpswich ware is a plain, hard, sandy grey ware made in both a smooth and gritty fabric, and is dark grey in colour. Ipswich ware was produced in a small variety of forms, primarily jars with rounded bodies and upright rims, hanging vessels, cooking pots and more infrequently, large bottles and decorated pitchers. The bases of jars were typically very thick and upper jar bodies were often enhanced with grooved bands. The pottery was made on a slow-wheel (turntable) and fired in a kiln. Ipswich ware has similar characteristics to Frisian pottery, which was imported to Britain during the early Anglo-Saxon era. Frisian pottery is grey in colour, also round bodied and thick-walled with upright rims, and made on a turntable.\nHistory\nIpswich ware is the first wheel-turned and mass-produced pottery in post-Roman Britain. Manufactured from the early eighth to the ninth centuries AD, it was distributed widely in East Anglia and eastern Cambridgeshire. It was traded less frequently from Kent, north to York, and  west to Oxfordshire, typically along busy traveling routes. From the sixth to the eighth centuries AD in Britain, non-imported pottery was handmade and fired in bonfires. In Ipswich, at the beginning the eighth century, local craftsmen changed the way they manufactured pottery and started finishing their wares on a slow-wheel and fired the finished products in kilns.\nThree pottery kilns from the Anglo-Saxon era have been discovered and excavated in Ipswich. Two kilns were found in the Cox Lane area and one has been identified in the Buttermarket area. Findings from the kiln excavations suggest that Ipswich ware was first manufactured around 720 AD. It was also determined that Ipswich pottery was made by first coiling the raw material and then finishing objects on a slow-wheel and firing in a kiln. The Buttermilk kiln was in production from 800 to 850 AD. After the introduction of Ipswich ware, hand-made pottery forms were no longer produced in Britain.\nSee also\n*Sandy ware\n*Shelly ware\n*Thetford ware\n*List of English medieval pottery\nReferences\nFurther reading\n*"
    }
  ]
}