{
  "content": [
    {
      "type": "text",
      "text": "# Iran–Israel war ceasefire\n\n*\n}}\n| negotiators =\n| original_signatories =\n| parties =\n| ratifiers =\n| depositor =\n| depositories =\n| citations =\n| language =\n| languages =\n| wikisource =\n| wikisource1 =\n| footnotes =\n}}\nA ceasefire between Iran and Israel took effect on 24 June 2025, ending the Iran–Israel war. It was mediated by the United States and Qatar.\nOn the evening of 23 June, U.S. president Donald Trump stated that a ceasefire agreement between Israel and Iran had been reached and would go into effect the following day. The exchange of fire ended the next morning, marking the beginning of the ceasefire. Despite initial violations by both Iran and Israel in the hours after it began, the ceasefire ultimately held.\nTimeline\nOn 23 June 2025, in response to U.S. strikes on Iranian nuclear facilities, Iran launched 14 missiles at Al Udeid Air Base in Qatar, targeting U.S. forces. The attack, which caused no casualties, was followed by diplomatic outreach involving Qatar and the United States. Following the strikes, Donald Trump expressed openness to a ceasefire, thanking Iran for notifying the U.S. in advance and limiting the scope of its retaliation; he also noted that little impact resulted from the hits, calling them \"a very weak response\".\nHours later, at 6:02&nbsp;p.m. EDT1:02&nbsp;a.m. the next day Tel Aviv time (UTC+3), 1:32&nbsp;a.m. the next day Tehran time (UTC+3.5)Trump declared on Truth Social that Israel and Iran had agreed on a ceasefire proposal jointly advanced by the U.S. and Qatar, labeling the conflict as the \"12 Day War\". Iran's minister of foreign affairs, Abbas Araghchi, contested this declaration, saying that no ceasefire proposal had been agreed to, but he stated that Iran would cease its military action if Israel likewise ceased hostilities \"no later than 4&nbsp;a.m. Tehran time\". At 1:08&nbsp;a.m. EDT8:08&nbsp;a.m. Tel Aviv time, 8:38&nbsp;a.m. Tehran timeTrump stated on Truth Social that the ceasefire was in effect, and he urged all parties to uphold the deal. At around 12:00&nbsp;p.m. Tel Aviv time, Israel Defense Forces (IDF) spokesman Effie Nefrin said that the ceasefire had come into effect that morning. Both parties to the truce claimed that the ceasefire occurred on their own nation's terms.\nThe ceasefire nearly collapsed shortly after it began. Between 4:45&nbsp;a.m. and 7:10&nbsp;a.m. Tel Aviv time, Iranian air defenses responded to continued Israeli strikes in Tehran, and Iran fired three additional salvos of ballistic missiles at Beersheba. Israeli officials accused Iran of having fired the last of these missiles at 7:06&nbsp;a.m., after the ceasefire was supposed to have started. Later that morning, the IDF stated that two more missiles fired by Iran onto Northern Israel at 10:25&nbsp;a.m. had been successfully intercepted. Iran initially denied having launched missiles after the ceasefire began, but it later stated that Israel had continued to conduct strikes until 9&nbsp;a.m. Although the office of Israeli prime minister Benjamin Netanyahu stated that all Iranian missiles launched after the ceasefire began were \"intercepted or landed in open areas without causing injuries or damage\", Israel nonetheless prepared to conduct a significant retaliatory strike. Trump uttered an expletive on live television as he expressed his frustration with both sides for not upholding the ceasefire, claiming that they did not know what they were doing. As Israel's jets were en route to attack targets in Iran, Trump pressured Netanyahu to call off the retaliatory strike. Israel mostly obliged, carrying out a reduced attack. After Iranian media reported sounds of explosions in Tehran and stated that the northern city of Babolsar was under attack, Israel acknowledged attacking a radar installation in the vicinity of Tehran in response to Iran's missile launches; Netanyahu's office stated that it was destroyed.\nDespite its volatile beginnings, the ceasefire ultimately held, partly as a result of Trump's continued intervention with Netanyahu.\nParties' characterization of ceasefire\nIran\nPresident Masoud Pezeshkian gave a televised address lauding what he called a \"great victory\". Iranian media claimed that the truce had been imposed on \"the enemy\" after four waves of attacks on \"Israeli-occupied territories\", and its National Security Council that it had \"shattered the enemy's primary strategic goal\". The government sought to convey its resilience, highlighting societal cohesion and civilian solidarity with its aims. Some reports suggested that moderate clerical and political figures had previously urged a truce on Supreme Leader Ali Khamenei, among them former president Hassan Rouhani, Supreme Leader advisor Ali Larijani, and Expediency Discernment Council chief Sadiq Larijani; a portion of these were rumored to have contemplated sidelining or ousting the Supreme Leader if the latter continued stonewalling negotiators.\nFollowing the ceasefire Iranian dignitaries voiced doubt about future commitment to nonproliferation. Foreign Minister Araghchi and other officials signaled that Iran might cease complying with the Non-Proliferation Treaty, a threat it had made repeatedly but never fulfilled to date; a parliamentary national security committee asserted that a May International Atomic Energy Agency (IAEA) report alleging insufficient Iranian transparency was used by Israel to justify its strikes.\nOn 26 June, Supreme Leader Ayatollah Ali Khamenei resurfaced (in a recorded 10-minute speech) to warn the United States against future attacks; the ceasefire (in which he was not involved) was not mentioned. In light of strategic damage Iran had endured in the war, The Jerusalem Post deemed Khamenei's claim of \"decisive victory\", as well as the speech itself, delusional. Khameni stated that the American strikes \"did nothing significant\", that the U.S. had \"gained nothing\" from the war, and defiantly proclaimed that Iran would \"never surrender\".\nThe Islamic Revolutionary Guard Corps (IRGC) issued a detailed statement saying it operated under the leadership of Khamenei throughout the war, and that the 22nd wave of Operation True Promise III pressured the enemy to call for a ceasefire.\nIsrael\nPrime Minister Netanyahu hailed the ceasefire as corroborating Israeli success, saying that it marked a \"historic victory\" over Iranian nuclear and ballistic missile ambitions \"which would stand for generations\".  On 27 June Defense Minister Israel Katz warned the ceasefire would only last so long as Iran refrained from attempting to reconstitute its ballistic missile or nuclear programs, outlining an \"enforcement plan\" by which Israel would hold Iran to accountnoting that since the 7 October 2023 attacks Iran was no longer immune to Israeli action, as per The Jerusalem Post.\nMediators' characterization of ceasefire\nUnited States\nPresident Trump deemed the ceasefire a \"victory for everybody\", but stressed his willingness to preempt Iranian designs by resuming strikes in the future, adding that American action had lessened the need for a new nuclear deal.\nQatar\nThe Qatar Ministry of Foreign Affairs issued a brief statement welcoming the ceasefire, reaffirming that Iran's violation of its airspace was a part of the dangerous escalation in the region, and thanking \"His Excellency President Trump\" for his efforts.\nGlobal reactions\n|source=Pope Leo XIV's 25 June 2025 general audience in St. Peter's Square|width=25%|align=left|style=padding:8px;}}\nShares of U.S. and European airlines rose Tuesday 24 June. Financial markets priced-in the truce holding and crude oil flows not being disrupted, with oil prices holding and near multi-week lows. Euro area government bond yields were mixed Wednesday 25 June. An index of global stocks hit a record high, and resumed taking on more risk, away from the safe haven of the dollar.\nUN Secretary General  António Guterres urged in a social media post that both sides respect the ceasefire, and expressed his sincere hope that it would be extended in the region. IAEA Director General Rafael Grossi also urged Tehran to resume cooperation, emphasizing diplomacy as the solution. (The Parliament of Iran voted the next day for the Atomic Energy Organization of Iran to end all cooperation.)\nIran's semi-official Mehr News Agency announced that Iranian airspace would reopen 10:30 GMT Wednesday 25 June. Upon the return of Ben-Gurion International Airport to full operations FlyDubai (UAE), Tus Airlines (Cyprus), and Bluebird Airways (Greece) announced they would resume service Thursday; Hainan Airlines (China) is expected to follow suit Sunday.\nAfter a sharp increase on the morning of 23 June following the U.S. strikes on Iran, global oil prices had returned to roughly the same pricing before the Iran-Israel war started, with Brent Crude trading at $67 per barrel on 26 June. The national average price of gasoline in the United States reached a four-year low of around $3.20 by 26 June. Bob McNally, president of Rapidan Energy Group and former energy adviser to President George W. Bush, remarked \"Assuming the cease-fire holds ... gasoline prices should remain where they are\" and \"President Trump desperately wants to avoid an oil price spike and just close down the war\".\nAnalysis\nA report by the Institute for the Study of War (ISW) concluded that Israeli operations forced the Iranian government to accept the truce, allowing Israel to achieve a key objective, despite strikes being limited to imposing costs on resistance rather than reflecting an effort to topple the regime; supporting this, the report observed that Israel did not systematically target domestic security on a nationwide basis, largely focusing on installations in the Iranian capital Tehran. Instead, Israel sought to \"demonstrate a credible threat\" to the regime should it decide to resume or expand its campaign, the report determined. Citing an estimate by the Institute for Science and International Security, the ISW assessed Iranian enrichment abilities as having been severely curtailed by American and Israeli strikes, calculating that \"the loss of so many centrifuges and facilities\" would impede nuclear activities for the foreseeable future. The ISW also reported that Israeli interdictions and attacks on launchers reduced the volume of ballistic missile assaults on Israel, forcing Iran to rely on \"much fewer\" and \"smaller\" barrages; these Israeli efforts further compelled Iran to submit.\nTrita Parsi, an expert on Iran issues and co-founder and executive vice president of the Quincy Institute, believes that despite Israel's insistence on targeting Iranian nuclear facilities, it made a clear effort to weaken and possibly overthrow the Iranian establishment, and Netanyahu is looking for another opportunity to resume this mission. \"The reason the Israelis want to attack again … is because they want to make sure they turn Iran into the next Syria or Lebanon – countries Israel can attack anytime with impunity,\" he said.\nBamo Nouri, a lecturer in international relations, writing for The Conversation asserts that the day after the US attacks, Israeli Prime Minister Benjamin Netanyahu discussed a ceasefire with Donald Trump as he wanted to avoid a long war of attrition that Israel could not afford and was already looking for an exit strategy.\nAccording to some sources, Tehran asked Qatar, Saudi Arabia and Oman to urge U.S. President Donald Trump to press Israel for an immediate ceasefire with Iran, offering flexibility in nuclear negotiations in return. Other sources say that following Iran's retaliatory attacks on a US base in Qatar, US President Donald Trump asked the Emir of Qatar to mediate a ceasefire agreement with Iran. Trump later said, \"Israel & Iran came to me, almost simultaneously, and said, ‘PEACE!’\"\nReferences\nExternal links\n*[https://english.khamenei.ir/news/11751/Statement-Iran-must-surrender-is-too-big-for-the-US-president-s Full text of Khamenei's pre-recorded Bunker speech]\n*[https://www.youtube.com/watch?v=NRkYnnoY-4I Netanyahu's full speech, streamed live] via the Hindustan Times"
    }
  ]
}