{
  "content": [
    {
      "type": "text",
      "text": "# Iraq Medal (United Kingdom)\n\nThe Iraq Medal was authorised on 23 February 2004. It was a campaign medal issued to members of the British Armed Forces and certain attached personnel, who served between 20 January 2003 and 22 May 2011 on, or in support of, Operation Telic - the designation for British operations during the 2003 Invasion of Iraq and its aftermath.\nAppearance\nThe Iraq Medal has the following design:It is made of cupro-nickel and  in diameter.The obverse has the crowned effigy of Queen Elizabeth II facing right, with the inscription ELIZABETH II DEI GRATIA REGINA FID DEF.The reverse shows an image of a Lamassu (an ancient Assyrian statue) above the word IRAQ.The 32 millimetre (1.25&nbsp;in) wide ribbon is sand colour with three narrow central stripes of black, white, red representing the Iraqi flag.\nQualification details\nThe medal was awarded to those meeting the qualifying period of service within the defined operational area.  Eligibility was extensive, and included both Regular and Reserve members of the armed forces, foreign and Commonwealth exchange and attached forces, Ministry of Defence civilians, members of the Royal Fleet Auxiliary and embedded journalists.\nThe operational area was defined as being divided into two zones - Zone 1 (Iraq and Kuwait) and Zone 2 (elsewhere within the Gulf region).  Qualifying periods of service varied depending on the area in which personnel were based.\nWith a clasp\nThe medal was awarded with the clasp \"19 Mar to 28 Apr 2003\" to British service and attached personnel who:\n* served in  Zone 1 (Iraq) between 19 March and 28 April 2003, the period that encompassed the duration of initial combat operations, and who:\n* completed seven days continuous service; or\n* served as aircrew flying into Iraq and who completed two or more operational sorties (no more than one sortie per day could count).\nWithout a clasp\nThose who served before the invasion, or in its aftermath, were recognised by the award of the medal alone. The medal, without a clasp, was awarded to:\n* those based in Zone 1 (Iraq) who did not complete seven days service between 19 March – 28 April 2003 to qualify for the clasp, but who performed thirty days continuous service between either 20 January – 24 March 2003 or from 23 April 2003 to 22 May 2011.\n* those based in Zone 1 (Kuwait) who did not complete seven days service to qualify for the clasp, but who performed thirty days continuous service between either 20 January – 24 March 2003 or 23 April – 10 August 2003.\n* those based in Zone 2 who performed thirty days continuous service between 20 January – 28 April 2003.\n* aircrew based outside Zone 1 (Iraq) but who flew ten sorties into Iraq, at a rate of not more than one sortie per day, from 28 April 2003 to 22 May 2011.\n* aircrew based outside both Zones 1 and 2 but who flew thirty sorties into Zones 1 or 2, at a rate of not more than one sortie per day, from 20 January – 28 April 2003.\n*those serving as part of the UK military contribution to the NATO Training Mission in Iraq could qualify up until 21 December 2011.\nIn most cases, civilian public servants and contractors employed by the British Government  and involved in the reconstruction of Iraq were not eligible for the Iraq Medal, but could receive the Iraq Reconstruction Service Medal.\nSpecial circumstances\nService terminated by death, wounds or disability due to service, or the award of a military decoration (Mention in Dispatches or higher), immediately qualified for the award of the medal, regardless of whether the length of service requirement was met.\nAccumulated Campaign Service Medal\nQualifying service for the Iraq Medal counted towards the period required to receive the Accumulated Campaign Service Medal.\nClasp\n* 19 Mar to 28 Apr 2003. A silver rosette denotes the clasp when worn on the ribbon bar.\nNotes\nThere have been calls for clasps denoting Operation Telic numbers, although none have been authorised to date. This includes a call made by three battle group commanders for a rosette to be issued for Telic 9, (November 2006 – May 2007), the most ferocious deployment to date. It had more ammunition spent than those previous, and had the highest number of British soldiers killed in one month (12 killed during April 2007) since the opening month of the war (27 died in March 2003, only three of which were to enemy action).\nAs of April 2018, the Ministry of Defence Medals Office reported a total of 136,836 Iraq Medals/Iraq Medals with Clasps having been awarded.\nSee also\n* British campaign medals\n* Iraq Reconstruction Service Medal\nReferences\nBibliography\n* Mussel, J (ed) - Medals Yearbook - 2015, (2014), Token Publishing.\n* [https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/557785/JSP761_Part1.pdf JSP 761, Honours and Awards in the Armed Forces. Part 1: Directive (V5.0 Oct 2016) Ministry of Defence]\nExternal links\n* [https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/557785/JSP761_Part1.pdf MoD: JSP 761, Honours and Awards in the Armed Forces. Part 1: Directive]\n* [https://www.gov.uk/medals-campaigns-descriptions-and-eligibility Guidance: Medals: campaigns, descriptions and eligibility, Iraq Medal]\n* [https://web.archive.org/web/20060906210144/http://www.operations.mod.uk/telic/campaign_medal.htm Campaign Medal for Operation Telic]"
    }
  ]
}