{
  "content": [
    {
      "type": "text",
      "text": "# Iraq War documents leak\n\nThe Iraq War documents leak is the disclosure to WikiLeaks of 391,832 United States Army field reports, also called the Iraq War Logs, of the Iraq War from 2004 to 2009 and published on the Internet on  2010. The files record 66,081 civilian deaths out of 109,000 recorded deaths. The leak resulted in the Iraq Body Count (IBC) project adding 15,000 civilian deaths to their count, bringing their total to over 150,000, with roughly 80% of those civilians. It is the biggest leak in the military history of the United States, surpassing the Afghan War documents leak of 25 July 2010.\nContents\nThe logs led to news reports of previously unknown or unconfirmed events that took place during the war.\nCivilian casualties\nThe Iraq Body Count project estimated 15,000 civilian deaths that had not been previously admitted by the US government based on an extrapolation of a sample of the deaths found in about 800 logs. Although American and British officials had denied any official record of civilian deaths, the logs released by WikiLeaks showed 66,081 civilian deaths out of a total of 109,000 fatalities for the period from 1 January 2004 to 31 December 2009. As of 2 January 2013, the IBC has added a total of 3,334 of these previously unrecorded civilian deaths to its database from their ongoing analysis of the war logs.\nSome civilian deaths were classified as enemy casualties, such as the July 12, 2007, Baghdad airstrike by US helicopter gunships which killed two Reuters journalists along with several men thought to be armed and suspected to be insurgents. They, including the journalists, were listed as \"enemy killed in action\".\nAccording to Al Jazeera English, some of the leaked documents describe how almost 700 civilians were killed by US troops for coming too close to checkpoints, including pregnant women and the mentally ill. At least a half-dozen incidents involved Iraqi men transporting pregnant family members to hospitals.\nThe New York Times said the reports contain evidence of many abuses, including civilian deaths committed by contractors. The New York Times points out some specific reports, such as one which says \"after the IED strike a witness reports the Blackwater employees fired indiscriminately at the scene.\" In another event on 14 May 2005, an American unit \"observed a Blackwater PSD shoot up a civ vehicle\" killing a father and wounding his wife and daughter.\nIraqi - Western coalition human rights abuses\nThe logs corroborate previous allegations that the US military handed over many prisoners to the Iraqi Wolf Brigade which was accused of beating prisoners, torturing them with electric drills, and executing suspects. According to The Guardian, the logs also show that \"US authorities failed to investigate hundreds of reports of abuse, torture, rape and even murder by Iraqi police and soldiers.\" The coalition, had \"a formal policy of ignoring such allegations\", unless the allegations involved coalition forces.\nWired Magazine reported that abuse of prisoners or detainees by Iraqi security forces continued even after the Abu Ghraib prisoner abuse incident came to light in 2004. In one recorded case, US troops confiscated a \"hand cranked generator with wire clamps\" from a Baghdad police station, after a detainee claimed to have been brutalised there.\nOne report analysed by the Bureau of Investigative Journalism seemed to show a US military Apache helicopter gunship open fire on Iraqi insurgents who were trying to surrender.\nAccording to Dagbladet Information, Danish soldiers \"passed on responsibility for a much higher number of prisoners to Iraqi police than had previously been made public. The practice continued even though the coalition witnessed, and was repeatedly warned of widespread torture and mistreatment of prisoners in the hands of the Iraqi police.\"\nForeign training and support for insurgents\nAccording to Wired Magazine, \"WikiLeaks may have just bolstered one of the Bush administration's most controversial claims about the Iraq war: that Iran supplied many of the Iraq insurgency's deadliest weapons and worked hand-in-glove with some of its most lethal militias. The documents indicate that Iran was a major combatant in the Iraq war, as its elite Quds Force trained Iraqi Shiite insurgents and imported deadly weapons like the shape-charged explosively formed penetrator bombs into Iraq for use against civilians, Sunni militants and U.S. troops.\"\nIt was reported in the Boston Globe that the documents show Iraqi operatives being trained by Hezbollah in precision military-style kidnappings. Reports also included incidents of US surveillance aircraft lost deep in Iranian territory.\nMiscellaneous\nAccording to The Australian, a document from December 2006 described a plan by a Shia militia commander to kidnap US soldiers in Baghdad in late 2006 or early 2007. The Australian also reported that \"detainee testimony\" and \"a captured militant's diary\" are cited among the documents, in order to demonstrate \"how Iran provided Iraqi militias with weapons such as rockets and lethal roadside bombs.\"\nAccording to The New York Times, the trove of documents released by WikiLeaks in October 2010 \"portrays the long history of tensions between Kurds and Arabs in the north of Iraq and reveals the fears of some American units about what might happen after American troops leave the country by the end of 2011.\"\nAn analysis published by The Jerusalem Post argued the leaked documents indicates a double standard in the international community views of human rights towards Israel's military policy.\nAn editorial in The Washington Post said that the leak \"mainly demonstrates that the truth about Iraq 'already has been told', while it 'has at least temporarily complicated negotiations to form a new government'\".  The editor also charged that \"claims such as those published by the British journal The Lancet that American forces slaughtered hundreds of thousands are the real 'attack on truth.'\"\nAfter criticism over the Afghan War documents leak, WikiLeaks redacted more information from the Iraq War documents. Julian Assange explained that this was to stop people distracting from the message contained in the material.\nResponses\nMedia coverage\nWikiLeaks made the documents available under embargo to a number of media organisations: Der Spiegel, The Guardian, The New York Times, Al Jazeera, Le Monde, the Bureau of Investigative Journalism, and the Iraq Body Count project. In October 2010, it was reported that WikiLeaks was planning to release up to 400,000 documents relating to the Iraq War. Julian Assange initially denied the reports, stating: \"WikiLeaks does not speak about upcoming releases dates, indeed, with very rare exceptions we do not communicate any specific information about upcoming releases, since that simply provides fodder for abusive organizations to get their spin machines ready.\" The Guardian reported on 21 October 2010 that it had received almost 400,000 Iraq war documents from WikiLeaks. On 22 October 2010, Al Jazeera was the first to release analyses of the leak, dubbed The War Logs. WikiLeaks posted a tweet that \"Al Jazeera have broken our embargo by 30 minutes. We release everyone from their Iraq War Logs embargoes.\" This prompted other news organisations to release their articles based on the source material.\nUpon the lifting of the embargo, the media coverage by these groups was followed by further coverage by other media organisations. The Guardian said that \"the New York Times, Washington Post and other papers were accused by web publications and some bloggers of downplaying the extent to which the documents revealed US complicity in torture and provided evidence that politicians in Washington \"lied\" about the failures of the US military mission\". Glenn Greenwald of Salon.com commented that \"media outlets around the world prominently highlighted this revelation, but not The New York Times\", calling their coverage of the document leak \"subservient\" to the Pentagon. UK papers including The Independent and The Daily Telegraph called the War Logs an indictment of the war that \"must be investigated not ignored for the sake of political expediency\".\nSlate wrote the \"bigger finding\" was that \"most Iraqi civilian deaths were caused by other Iraqis\" and that \"while some American guards behaved horrendously toward Iraqi detainees at the Abu Ghraib prison, Iraqi police and soldiers have behaved much worse\". Other writers said the War Logs highlighted the danger of Iran in Iraq and \"may well derail the formation of a government by implicating caretaker prime minister Nuri al-Maliki in running death squads\". Max Boot wrote that the documents \"don't tell us much that we didn't already know in broad outline\".\nInternational organisations\nThe UN's chief investigator on torture, Manfred Nowak, states that \"if the files released through WikiLeaks pointed to clear violations of the United Nations Convention Against Torture the Obama administration had an obligation to investigate them.\" The convention, according to Nowak, forbids the US from turning over detainees to the Iraqi government, if doing so meant they might be subjected to torture. The UN High Commissioner for Human Rights Navanethem Pillay said that \"the US and Iraq should investigate claims of abuse contained in files published on the WikiLeaks website\". In addition, the UN Special Rapporteur on Torture Manfred Nowak called \"for a wider inquiry to include alleged US abuses.\"\nHamit Dardagan, co-founder of the Iraq Body Count project, said that the publication of the Iraq War logs had revealed specific details about 15,000 previously unreported violent deaths of Iraqi civilians. Dardagan said that, for some of the deaths, WikiLeaks provided \"hitherto undisclosed identifying details including their names — no small matter when so many Iraqi families were still desperately searching for their missing loved ones\".\nCountries\nIn preparation for the leak, the Pentagon created an Information Review Task Force to look for names, keywords and other issues that would be particularly sensitive, comprising 120 people led by the Defense Intelligence Agency. A spokesperson for the Pentagon said the reports were considered to be simple observations and reports by military personnel and civilian informants, but nevertheless called their release a \"tragedy\" while the US Department of Defense requested the return of the documents. US Secretary of State Hillary Clinton condemned the leak, saying that it \"puts the lives of United States and its partners' service members and civilians at risk.\"\nThe US military responded to the information in the documents about civilian deaths, saying that \"it did not under-report the number of civilian deaths in the Iraq war or ignore prisoner abuse by Iraqi forces\". Pentagon spokesman Colonel Dave Lapan added that \"the US military never claimed to have an exact count of the number of civilians killed in Iraq.\" He also added that both WikiLeaks and the Pentagon had the same database to collate a civilian death toll and was further sceptical WikiLeaks \"made any new discovery.\" General George Casey, the army chief of staff, said US forces went to morgues to collect data and he did not \"recall downplaying civilian casualties.\"\nIn response to the allegations of torture by Iraqi soldiers under US oversight, US General George Casey, in command of the Iraq War between 2004 and 2007, said that \"[o]ur policy all along was if American soldiers encountered prisoner abuse, to stop it and report it immediately up the US chain of command and up the Iraqi chain of command.\" Deputy Prime Minister of the United Kingdom Nick Clegg also expressed his support for an investigation into the \"allegations of killings, torture and abuse\" in the documents, having stated, \"We can bemoan how these leaks occurred, but I think the nature of the allegations made are extraordinarily serious\".\nPrime Minister of Iraq Nouri al-Maliki dismissed the records as politically timed smear and as a series of \"media games and bubbles\" as a defence against the information contained in the documents, which included \"allegations [his administration] had permitted the abuse of prisoners and other misuses of power.\" This was echoed by Hassan al-Sneid, a \"leader of Maliki's governing State of Law coalition\", who stated, in terms of the images contained in the documents, \"These are all just fakes from the Internet and Photoshop\". The Iraqi Government stated that it planned to investigate the role of private contractors, specifically Blackwater Worldwide, in deaths that occurred during the war and were revealed in the logs.\nThe Iraqi News Network stated that \"The WikiLeaks documents revealed very important secrets, but the most painful among them are not those that focus on the occupier, but those that reveal what the Iraqi forces, Iraqi government and politicians did against their citizens. Those leaders who returned to remove Iraq from oppression toppled the dictator but then carried out acts that were worse than Saddam himself. If these documents make the US apologise to Iraqis, they should compel Mr Maliki to leave the political arena altogether and apologise to everyone.\"\nSpokesman for Iran's Ministry of Foreign Affairs Ramin Mehmanparast was quoted as saying, \"Serious ambiguity and doubt linger regarding the intentions behind the suspicious release of WikiLeaks documents,\" and that Iran will \"confront this mischievous act\".\nDuring an interview with WikiLeaks founder Julian Assange on the radio version of Democracy Now!, host Amy Goodman discussed the response from Danish Prime Minister Lars Rasmussen, who had promised that \"all allegations according to which Danish soldiers may have knowingly handed over detainees in Iraq to mistreatment at the hands of local authorities are regarded as very serious.\" However, he also \"rejected calls by the opposition to establish an independent commission to investigate the claims.\" In response to Rasmussen, an investigation by the Danish military was ordered by the minister of defence, Gitte Lillelund Bech. The military also requested the original unedited documents from WikiLeaks for their investigation.\nNon-government organisations\nAmnesty International said that the actions taken by American and coalition troops in turning over prisoners from American to Iraqi custody when it was known that the prisoners were likely to be tortured may have broken international law. An Amnesty official said that the organisation had \"concern[s] that the U.S. authorities committed a serious breach of international law when they summarily handed over thousands of detainees to Iraqi security forces who they knew were continuing to torture and abuse detainees on a truly shocking scale.\"\nThe Iraq Body Count project, commenting on the projected additional 15,000 civilian casualties revealed by the logs, said that \"[i]t is totally unacceptable that for so many years the US government has withheld from the public these essential details about civilian casualties in Iraq.\"\nOther reactions\nRetired U.S. General Stanley McChrystal was quoted as saying, \"I think it's sad. The decision to leak classified information is something that is illegal, and individuals are making judgments about threats and information they are not qualified to make. There is a level of responsibility toward our people that needs to be balanced with a right or need to know. It's likely that a leak of that information could cause the death of our own people or some of our allies.\"\nAfter the documents were released, US Iraq War resisters seeking refuge in Canada, including Joshua Key and the 17-year veteran Chuck Wiley, said that the October 2010 round of military documents released by WikiLeaks offers further support of their claims. Joshua Key, author, with Lawrence Hill, of ''The Deserter's Tale (a book chronicling his service in Iraq and his subsequent departure from military life), said, \"It’s the truth actually being told. These [WikiLeaks] documents coming out now are right from the level of the soldiers. I guess (the brass) never realized how much the Internet would take a part in the [Iraq] war.\"\nTotal death count\nWhile the U.S. tally of Iraqi and US-led Coalition deaths in the war logs is 109,000, a widely quoted 2006 study published in The Lancet used a cross-sectional cluster sample to estimate about 650,000 deaths were due to the Iraq war increasing mortality. Another study by the World Health Organization called the Iraq Family Health Survey estimated 151,000 deaths due to violence (95% uncertainty range, 104,000 to 223,000) from March 2003 through June 2006. The Iraq Body Count reviewed the war logs data in three reports in October 2010 and concluded that the total recorded death toll, civilian and combatant, would be more than 150,000.\nSee also\n* United States documents leak of the War in Afghanistan\n* Chelsea Manning\n* Niger uranium forgeries\n* Pentagon Papers\nReferences\nExternal links\n* [https://wikileaks.org/irq/ Baghdad War Diary]. WikiLeaks.\n* [https://www.nytimes.com/interactive/world/war-logs.html The War Logs]. The New York Times.\n* [https://www.theguardian.com/world/iraq-war-logs Iraq: The war logs]. The Guardian.\n* [http://www.spiegel.de/international/topic/iraq_war_logs/ Iraq War Logs]. Der Spiegel.\n* [https://web.archive.org/web/20101023051014/http://english.aljazeera.net/secretiraqfiles/ Secret Iraq Files]. Al Jazeera English.\n* [https://web.archive.org/web/20130806131236/http://www.iraqwarlogs.com/ iraqwarlogs.com]. Bureau of Investigative Journalism.\n* [https://web.archive.org/web/20180518095306/http://warlogs.owni.fr/ Warlogs crowdsourcing interface]. OWNI.\n* [http://www.democracynow.org/2010/10/22/wikileaks_prepares_largest_intel_leak_in WikiLeaks Prepares Largest Intel Leak in US History with Release of 400,000 Iraq War Docs] – video report by Democracy Now!, 22 October 2010\n* [http://www.democracynow.org/2010/10/25/wikileaks_iraq_war_logs_expose_us Iraq War Logs Expose US-Backed Torture] - video report by Democracy Now!''"
    }
  ]
}