{
  "content": [
    {
      "type": "text",
      "text": "# Iraqi Kurdish Civil War__disambig_1\n\nKDP PDKISupported by: Iraq (from 1995) (from 1997) (before 1995)\n| combatant2        =  PUK PKK SCIRIKCP Iraqi National CongressSupported by: (from 1995) Syria (1996)\n| commander1        =  Massoud Barzani Roj Shaweis\n| commander2        =  Jalal Talabani Nawshirwan Mustafa Kosrat Rasul Ali Abdullah Öcalan  Ibrahim Parlak Kani Yilmaz  Cemil Bayik\n| strength1         =  KDP: 25,000 active, 30,000 reserves Iraq: 30,000 (1996)\n| strength2         =  PUK: 13,500 active, 6,000 reservesINC: 1,000 (1995) PKK: 5,000–12,000 (1994): 2,000 (1996) SCIRI: 5,000\n| casualties1       =\n| casualties2       =\n| casualties3       = 5,000–8,000 killed\n| combatant3        =\n| commander3        =\n| date              = May 1994–November 1997(3 years and 6 months)\n}}\nThe Iraqi Kurdish Civil War (, 'fratricidal war') was a civil war that took place between rival Kurdish factions in Iraqi Kurdistan during the mid-1990s, mostly between the Patriotic Union of Kurdistan and the Kurdistan Democratic Party. Over the course of the conflict, Kurdish factions from Iran and Turkey, as well as Iranian, Iraqi and Turkish forces, were drawn into the fighting, with additional involvement from American forces. Between 5,000 and 8,000 fighters and civilians were killed.\nBackground\nAutonomy in Iraqi Kurdistan was originally established in 1970 as the Kurdish Autonomous Region following the agreement of an Autonomy Accord between the government of Iraq and leaders of the Iraqi Kurdish community. A Legislative Assembly was established in the city of Erbil with nominal authority over the Kurdish-populated governorates of Erbil, Duhok and Sulaymaniyah. As various battles between separatist Kurds and Iraqi government forces continued until the 1991 uprisings in Iraq, the safety of Kurdish refugees led to the adoption of United Nations Security Council Resolution 688 which was used as a justification to implement Operation Provide Comfort, a US-led multinational military operation that ensured the security of the Iraqi Kurdish region through the use of air power while simultaneously providing humanitarian aid to refugees fleeing persecution. While the no-fly zone covered Dahuk and Erbil, it left out Sulaymaniyah and Kirkuk. This led to a further series of bloody clashes between Iraqi government forces and Kurdish troops. Shortly thereafter, an uneasy balance of power was reached, and Iraq withdrew its military and government officials from the region in October 1991. From that point on, Iraqi Kurdistan had achieved de facto independence under the leadership of the region's two principal Kurdish parties – the Kurdish Democratic Party and the Patriotic Union of Kurdistan – free from the control of Baghdad. The region then adopted its own flag and national anthem.\nIraqi Kurdistan held parliamentary elections in 1992. The KDP gained an absolute majority of the votes in the governorates of Dohuk and Arbil, whereas the PUK garnered the broad support of the Sulaymaniyah governorate as well as the Kurdish portions of Diyala (specifically the Kifri and Khanaqin Districts). As a result of the election, the Kurdish parliament was split between Jalal Talabani's Patriotic Union of Kurdistan and Massoud Barzani's Kurdish Democratic Party.\nAfter withdrawing its forces from Kurdistan in October 1991, the Iraqi government imposed an economic blockade over the region, restricting its oil and food supplies. The United Nations embargo on Iraq also significantly affected the Kurdish economy, preventing trade between the Kurds and other nations. As such, all economic dealings between Iraqi Kurdistan and the outside world were done through the black market.\nIn March 1994 Turkish Armed Forces began Operation Steel, a cross-border military incursion into northern Iraq against the PKK. On May 3 a delegation from the KDP agreed to not allow the PKK to have a base in northern Iraq. On May 4, Turkish Armed Forces left northern Iraq.\n1994 PUK–KDP clashes\nFighting broke out between the two factions in May 1994. The initial clashes left around 300 people dead and over the next year, around 2,000 people were killed on both sides.\nPlanned assassination of Saddam Hussein\nIn January 1995, CIA case officer Robert Baer traveled to northern Iraq with a five-man team to set up a CIA station. He made contact with the Kurdish leadership and managed to negotiate a truce between Barzani and Talabani.\nWithin days, Baer made contact with an Iraqi general who was plotting to assassinate Saddam Hussein. The plan was to use a unit of 100 renegade Iraqi troops to kill Saddam as he passed over a bridge near Tikrit. Baer cabled the plan to Washington but did not hear anything back. After three weeks, the plan was revised, calling for an attack by Kurdish forces in northern Iraq while rebel Iraqi troops leveled one of Saddam's houses with tank fire in order to kill the Iraqi leader. Baer again cabled the plan to Washington and received no response. On 28 February, the Iraqi Army was placed on full alert. In response, the Iranian and Turkish militaries were also placed on high alert. Turkey had been planning to launch on offensive against Kurdish rebels in northern Iraq. Baer received a message directly from National Security Advisor Tony Lake telling him his operation was compromised. This warning was passed on Baer's Kurdish and Iraqi contacts. Upon learning this, Barzani backed out of the planned offensive, leaving Talabani's PUK forces to carry it out alone.\nThe Iraqi Army officers planning to kill Saddam with tank fire were compromised, arrested and executed before they could carry out the operation. The PUK's offensive was still launched as planned, and within days they managed to destroy three Iraqi Army divisions and capture 5,000 prisoners. Despite Baer's pleas for American support of the offensive, none was forthcoming, and the Kurdish troops were forced to withdraw. Baer was immediately recalled from Iraq, briefly investigated for the attempted murder of Saddam Hussein, but exonerated.\nBattle of Erbil (1996)\nAlthough the Kurdish parliament ceased to meet in May 1996, the fragile cease-fire between the PUK and KDP held until the summer of 1996. During this period, the Iraqi government was permitted by the KDP to establish a smuggling route through the Khabur River basin for the transportation of illegal petroleum exports. Barzani and his associates seized the opportunity to impose taxation on this trade, giving them an income of several million dollars per week. This led to a dispute with the PUK over who should benefit from this money. Although the two parties reached an agreement where the Iraqi–Turkish smuggling routes would be divided evenly between them, the KDP continued its attempts to exert greater control over the movement of goods through Iraqi Kurdistan.\nTalabani established an alliance with Iran, permitting it to conduct a military incursion into northern Iraq aimed at the Kurdish Democratic Party of Iran on 28 July. In response, Barzani asked for assistance from the Iraqi government who, seeing an opportunity to retake northern Iraq, accepted. On 31 August, 30,000 Iraqi troops, spearheaded by an armored division of the Iraqi Republican Guard, attacked the PUK-held city of Erbil, which was defended by 3,000 PUK Peshmerga led by Korsat Rasul Ali, in conjunction with KDP forces. Erbil was captured, and Iraqi troops executed 700 PUK and Iraqi National Congress prisoners of war in a field outside the city.\nThis attack stoked Kurdish fears that Saddam intended to launch a genocidal campaign against the Kurds similar to the campaigns of 1988 and 1991. The Clinton administration, unwilling to allow the Iraqi government to regain control of Iraqi Kurdistan, began Operation Desert Strike on 3 September, when American ships and B-52 Stratofortress bombers launched 27 cruise missiles at air defense sites in southern Iraq. The next day, 17 more cruise missiles were launched from American ships against Iraqi air defense sites. The United States also deployed strike aircraft and an aircraft carrier to the Persian Gulf region, and the extent of the southern no-fly zone was moved northwards to the 33rd parallel.\nAfter installing the KDP in control of Erbil, Iraqi Army troops withdrew from the Kurdish region back to their initial positions. The KDP drove the PUK from its other strongholds, and with additional Iraqi Army help, captured Sulaymaniyah on 9 September. Jalal Talabani and the PUK retreated to the Iranian border, and American forces evacuated 700 Iraqi National Congress personnel and 6,000 PUK members out of northern Iraq. On 13 October, Sulaymaniyah was recaptured by the PUK, allegedly with support of Iranian forces.\nTurkish intervention\nFighting continued throughout the winter between the KDP and PUK. Complicating matters, PKK was present in Iraq. PKK was allied with the PUK which later led KDP attack the PKK. According to some sources, the PKK began to fight against all who supported KDP, including some Assyrian and Arab groups. Turkey which saw the Kurdish Civil war as an opportunity, allied with KDP and launched Operation Hammer in May, in a violent attempt to force the PKK to leave Iraqi Kurdistan. This operation caused heavy PKK casualties but was unsuccessful. PKK succeeded to keep their camps in Northern Iraq.\nOn 25 September 1997, Turkish forces re-entered Iraqi Kurdistan and attacked PUK and PKK positions in an attempt to force the PKK to leave Iraqi Kurdistan. However, according to Turkish sources, it was an attempt to bring a cease-fire between the factions. The operation resulted in heavy PKK and PUK casualties. Later a cease-fire was negotiated between the PUK and KDP after the US decision to support a cease-fire.\nDespite the cease-fire, renewed fighting broke out along the armistice line between the KDP and PUK in October and November. In this round of fighting, 1,200 combatants were killed on both sides and 10,000 civilians fled their homes. On 24 November 1997, the KDP declared a unilateral cease-fire. The PUK, although not declaring a cease-fire officially, said their group would respect the truce, despite alleging that the KDP had violated the truce by attacking PUK positions on 25 November.\nIMK - PUK conflict\nKurdistan Islamic Movement (IMK) and Patriotic Union of Kurdistan (PUK) engaged in significant armed clashes throughout the 1990s, particularly following the establishment of a Regional Government after the Gulf War in 1991. The IMK, which had grown in power and influence, sought to impose its vision of Islamic governance, clashing with the PUK's secular agenda.\nTensions escalated in 1993 when armed conflicts erupted between IMK and PUK forces in areas like Sulaimaniya and Kirkuk. The PUK accused the IMK of attempting to undermine its authority, while the IMK sought to challenge the PUK's control and assert its influence among Kurdish populations. The clashes were intense, leading to significant casualties on both sides. It's mentioned that over 2,500 IMK members were killed during this period, by Khider Kosari a notable poet in the IMK, who was also killed shortly after, highlighting the brutal nature of the conflict.\nBy the mid-1990s, the IMK was forced to retreat from areas where it had previously held power Mostly Halabja and Sharazur due to the PUK's military strength and strategic advantages. The PUK's victories effectively weakened the IMK's position in the region, resulting in a reorganization of power dynamics within Iraqi Kurdistan.\nIn 1997, after years of conflict, the IMK made the controversial decision to join the PUK-led secular government. This move sparked further divisions within the IMK, as hardliners opposed cooperation with secular forces. Two prominent figures, Ali Bapir and Mullah Krekar, emerged as key leaders of splinter groups. Ali Bapir went on to found the Kurdistan Islamic Group (Komal), which advocated for political participation but remained deeply Islamist in its ideology. Mullah Krekar, meanwhile, became the leader of the more radical Ansar al-Islam, which rejected any form of collaboration with secular authorities and took control of regions around Halabja and Hawraman.\nIn 2003, the conflict escalated further when the United States launched airstrikes against Ansar al-Islam in northern Iraq, targeting its strongholds in Halabja and surrounding areas. Komal was also targeted due to Ali Bapir's previous involvement in the Islamic Emirate of Byara which drew scrutiny from U.S. forces. These airstrikes were part of broader military efforts aimed at dismantling groups perceived as threats to stability in the region. Regions Bombed Include Halabja, Kalar and Qandil Mountains. The attacks significantly weakened Ansar al-Islam and altered the landscape of Kurdish politics, leading to an ongoing struggle for influence among various factions, including Komal.\nAftermath\nIn September 1998, Barzani and Talabani signed the U.S.-mediated Washington Agreement establishing a formal peace treaty. In the agreement, the parties agreed to share revenue, share power, deny the use of northern Iraq to the PKK, and not allow Iraqi troops into the Kurdish regions. The United States pledged to use military force to protect the Kurds from possible aggression by Saddam Hussein. At the same time, implementation of the U.N. Oil-for-Food Programme brought revenue to northern Iraq, allowing for increased standards of living. Iraqi Kurdistan became a relatively peaceful region, before the small terrorist group Ansar al-Islam entered the Halabja region in December 2001, bringing renewed conflict that would end in 2003 immediately prior to start of Iraq war, which mainly affected non-Kurdish areas of Iraq.\nAround a month later, U.S. President Bill Clinton signed the Iraq Liberation Act into law, providing for military assistance to Iraqi opposition groups, including the PUK and KDP. The KDP estimated that 58,000 of its supporters had been expelled from PUK-controlled regions from October 1996 to October 1997. The PUK says 49,000 of its supporters were expelled from KDP-controlled regions from August 1996 to December 1997.\nThe PUK and KDP later co-operated with American forces during the 2003 invasion of Iraq, routing Iraqi forces with the help of American air power and overrunning much of northern Iraq including the cities of Kirkuk and Mosul. After the invasion, Massoud Barzani was later elected president of Iraqi Kurdistan while Jalal Talabani was elected President of Iraq.\nSee also\n* List of wars involving Iraq\n* List of wars involving Iraqi Kurdistan\n* List of modern conflicts in the Middle East\n*Iraq war\nFurther reading\n* [https://www.jstor.org/stable/pdf/4328927.pdf?seq=1 The KDP-PUK Conflict in Northern Iraq]\nReferences\nBibliography\n*\n*\n*\n*"
    }
  ]
}