{
  "content": [
    {
      "type": "text",
      "text": "# Iraq War Veterans Organization\n\nThe Iraq War Veterans Organization, or IWVO, was founded on April 12, 2003, by Russell K. Terry and William T. Hutchison. The original intent of the organization was to ensure that veterans returning from the war in Iraq, would not be subjected to the same treatment as veterans of the Vietnam War, in which both Terry and Hutchison served.  It has been largely defunct since 2010.\nMission statement\nAs of 2005, the mission statement of the organization included:\n* To promote the social welfare of the community (that is, to promote in some way, the common good and general welfare of the people of the community);\n* To assist disabled and needy war veterans and members of the U.S. Armed Forces and their dependents and the widows and orphans of deceased veterans;\n* To provide entertainment, care, and assistance to hospitalized veterans or members of the U.S. Armed Forces;\n* To carry on programs to perpetuate the memory of deceased veterans and members of the Armed Forces and to comfort their survivors;\n* To conduct programs for religious, charitable, scientific, literary, or educational purposes;\n* To sponsor or participate in activities of a patriotic nature;\n* To provide insurance benefits for its members or dependents of its members or both; or\n* To provide social and recreational activities for its members.\nStructure\nThe IWVO structures itself into two groups. Members are veterans who join the IWVO but do not take any leadership role. Member Representatives are organized by state, and represent the IWVO and its directors in each state. Member Representatives provide support and outreach to their respective states. Most states have multiple representatives. In addition, some Member Representatives are directors for the organization. These include the National Legislative Director, National Media Director, National Membership Director, Chaplain, and other positions that the directors and founder create.\nSince inception, the IWVO has created a structure of a Commander and a series of Vice Commanders, similar to that of other veterans organizations.\nEvents\nIn late 2004, the IWVO began planning with Challenge Aspen, an adaptive sports organization based in Aspen Colorado, for a winter ski clinic to benefit IWVO members who were wounded in the war. IWVO National Legislative Director Daniel Rosenthal organized the trip, and within three weeks of its conception, six soldiers, sailors and marines attended the clinic. Five of the sailors and marines were from Balboa Naval Medical Center in San Diego, CA.  The sixth soldier was from Tallahassee, Florida, and was in the same unit as Rosenthal, who also attended.  In 2005, a summer version of the clinic was founded, with more than 30 veterans attending, and it has since become an twice-annual event.\nPTSD\nAlso see: Benefits for US Veterans with PTSD\nThe IWVO is home to an MSN group that claims to be the largest internet based PTSD support group for veterans and family members of the Iraq War.  At least one and possibly more of the posters are psychologists and several are experienced in the VA system.\nPersonality Disorder Discharges\nPersonality disorder discharges have been a priority for the IWVO since early 2006.\nIn 2007 the IWVO criticized former United States Army Surgeon General Gale Pollock. IWVO co-founder Russell Terry said:\nReferences\nExternal links\n* [https://web.archive.org/web/20051230142132/http://www.iraqwarveterans.org/ Iraq War Veterans Organization website]"
    }
  ]
}