{
  "content": [
    {
      "type": "text",
      "text": "# IRC subculture\n\nIRC subculture refers to the particular set of social features common to interaction on the various Internet Relay Chat (IRC) systems around the world, and the culture associated with them. IRC is particularly popular among programmers, hackers, and computer gamers.\nOverview\nInternet Relay Chat is an Internet-based chat system that has existed in one form or another since 1988. Networks are connected groups of IRC servers which share a common userbase. Channels are the \"chat rooms\" on said networks. IRC channel operators (commonly referred to as @sysop  or admins) are the individuals who run any given channel.\nWhile there are many different IRC networks, and across those networks there are usually large numbers of IRC channels, there are some unifying features common to the social structures of them all. Many of the features of the IRC subculture mesh with other Internet subcultures, such as various forum subcultures. This is especially prevalent in IRC channels or networks that are directly related to other Internet phenomena, such as an IRC channel created by and for the users of a particular Internet forum.\nCommunication on IRC\nIRC has much in common with a regular in-person conversation. It is real-time many-on-many communication that is not logged by the server for posterity (many IRC clients do offer a logging feature, but the logs aren't generally publicly available then).  Some bots may also feature logging facilities.  Users on IRC usually identify users  as ones \"saying\" something (instead of posting it) to reflect the similarity with face-to-face communication.\nBecause IRC is a text-based communication medium, the obvious limitation of this metaphor is that the participants of a conversation on IRC do not actually see or hear each other, so alternative ways must be employed to convey the information that would otherwise be gained from facial expressions, tones of voice, and other audio-visual clues. It is common practice among IRC users to use emoticons, pseudo-XML tags (for example ...) or actions (such as *smile* or *grin*) to achieve this.  Other notations common to text only media are common on IRC, such as using asterisks around *words or phrases to be emphasized*, /using slashes around words or phrases/ to simulate italics, and imparting PARTICULAR EMPHASIS to something by writing it in all capitals.  Some clients also respond to \"percent notations,\" such as pairs of %B around bold text, %I surrounding italicized text, or %C to change the text color.\nDue to the lack of newlines on IRC, some users will use email style quoting, but with an extra character to denote the end of the quote and the beginning of their message.\nOrthographical and grammatical mistakes are generally not frowned upon as much on IRC as they are in other kinds of Internet forums, given the informal and temporary nature of them. If the conversation is going at a decent speed, it may not be practical to correct every typo.  It is similar to many instant messaging networks.\nSocial structure\nOften users will visit the same channel regularly and form strong emotional ties to the other regulars of that channel.\nHaving certain privileges on IRC is often considered a status symbol. The server administrators (those with administrative access to the IRC servers) and the IRC operators appointed by them thus have the highest status. Within the individual channels the channel operators then have a higher status than the regular users. Sometimes it is channel policy to \"voice\" users (add to the user's mode) in order to denote them as helpers or channel regulars, even though the channel is not in moderated mode.\nOn many networks a channel service keeps a record of levels that operators on a given channel have, which imposes an even more differentiated structure.  In certain cases, being given operator status on a channel, or being promoted to a higher level operator, is considered a social reward rather than for intent of functioning as a more privileged user.  Being kicked (forcibly parted)  or even banned from a channel is considered punishment. Kicks are a less serious punishment, and many clients have an auto-rejoin on kick feature.\nVariations\nWhile many aspects of IRC subculture are common across the entire community, many aspects are specific to particular networks, channels, or groups of channels.\nSpecific networks\nSome networks have specific sets of etiquette, guidelines and quirks that vary from those of other networks. For example, atopical channels on general networks like EFnet tend to haze their new users more aggressively than topical channels on other networks.\nSpecific channels\nSome channels have specific sets of etiquette and guidelines that vary from those of other channels.\nExternal links\n*[https://web.archive.org/web/20170313041656/http://cyber.eserver.org/reid.txt Thesis \"Communication and Community on Internet Relay Chat\"]\n*[http://www.efnet.org/ EFnet information]\n*[http://www.bash.org/ bash.org - A collection of IRC quotes]\n*[http://german-bash.org/ german-bash.org - A collection of German IRC quotes]\n*[http://lamer.cz/ lamer.cz - A collection of Czech and Slovak IRC quotes]\n*[https://web.archive.org/web/20090322104553/http://bash.im/ bash.im - A collection of Russian IRC quotes]\n*[http://danstonchat.com/ danstonchat.com - A collection of French IRC quotes]"
    }
  ]
}