{
  "content": [
    {
      "type": "text",
      "text": "# Irepodun, Kwara State\n\n|subdivision_type1      = State\n|subdivision_name1      =Kwara State\n|subdivision_type2      =\n|subdivision_name2      =\n|subdivision_type3      =\n|subdivision_name3      =\n|government_footnotes   =\n|government_type        =\n|leader_title           =Local Government Chairwoman and the Head of the Local Government Council\n|leader_name            =Comrade Jide Oyinloye\n|established_title      =\n|established_date       =\n|area_magnitude         =\n|unit_pref                =Imperial\n|area_footnotes           =\n|area_total_km2           =\n|area_land_km2            =\n|population_as_of               =2006\n|population_footnotes           =\n|population_note                =\n|population_total               =148,610\n|population_density_km2         =\n|timezone               =WAT\n|utc_offset             = +1\n|timezone_DST           =\n|utc_offset_DST         =\n|coordinates            =\n|module=}}\n|elevation_footnotes    =\n|elevation_m            =\n|elevation_ft           =\n|postal_code_type       =\n|postal_code            =\n|area_code              =\n|blank_name             =\n|blank_info             =\n|website                =http://www.kwarastate.gov.ng/irepodun/administration.php\n|footnotes              =\n}}\nIrepodun is a Local Government Area in Kwara State, Nigeria. Its headquarters is in the town of Omu-Aran. The local government is located on 8.5381º N, 5.1431º E.\nIt has an area of 737&nbsp;km and a population of 148,610 at the 2006 census. It has very significant Yoruba cultural and historical significance. And is populated by the Igbomina people. The people of Irepodun are Yorubas and mostly of Igbomina origin with roots in Ife, Oyo and Ketu. Much of the Ifelodun domain was overtaken by the Afonja/Alimi era and annexed to the present Ilorin enclave.  It has an area of 3,435&nbsp;km and includes at least 80 villages and towns including Idofian, Okanle, Jimba Oja, Koko-Araromi, Ilota, Arugbo, Igbo-Owu, and Amodu.\nEsiẹ Museum is a museum in Esiẹ, Irepodun. The museum was the first to be established in Nigeria when it opened in 1945. The museum once housed over one thousand tombstone figures or images representing human beings. It is reputed to have the largest collection of soapstone images in the world. In modern times the Esie museum has been the center of religious activities and hosts a festival in the month of April every year.\nAnother significant town is Oko, which means stone in the Yoruba language. It is a mountainous region with very special and significant rock formations that were thought to have been used by the Yoruba in ancient warfare. Folktales also talk about gods and men with superhuman strength and abilities who fought for the people.\nThe people of Irepodun are known to listen to Dadakuada music, a music which involves the use of eulogy, chants and slow danceable beats.\nAlso close to Esie is Ijan-Otun, a small town within minutes from neighboring Esie and Oro, Ijan-Otun is home to an Anglican church and a Government Day secondary school.\nThe People of Ijan-Otun are part of the igbomina.\nThe postal code of the area is 251.\nNotable people\n*Moji Afolayan (1969-), actress.\n*David Oyedepo - (Born September 27, 1954) - Presiding Bishop Living Faith Church Worldwide (a.k.a. Winners Chapel).\n*Kunle Afolayan - (Born September 30, 1974) - Nigerian Actor, Film Producer and Director\n*Olasubomi Thaddeus Babaoye- (Born February 20, 1973) - Nigerian IT Entrepreneur and Businessman\nReferences"
    }
  ]
}