{
  "content": [
    {
      "type": "text",
      "text": "# Irish Heritage Trust\n\n)\n*Ger Aherne()}}\n| main_organ = Board of trustees\n| num_staff = 51 (2021)\n| num_volunteers =\n| budget =\n| website =\n}}\nThe Irish Heritage Trust (IHT) is an architectural and cultural organisation which aims to preserve, maintain and understand notable Irish buildings for the purposes of education, research and recreation. Founded by the Irish state in 2006 as a national heritage property organisation, it was partly modelled on the National Trust in the U.K.\nOperation and financing\nWhile the foundation of the trust was driven by State authorities, and initiated by Minister for the Environment Dick Roche with Cabinet approval, it is independent in its operation.  The trust was launched with a government grant of 5 million euro, and the majority of its funds come from state and semi-state sources but the organisation, a registered charity, raises funds from other sources also. Provision was made for property donations to the IHT to be tax-efficient but this measure did not support operations at the level expected.  The IHT offers a membership scheme, which entitles members to free access to its three public-access properties.\nHistory\nThe trust took over its first property, Fota House and Gardens, just outside Cork city, in 2007. The house had been managed for the previous 14 years by a trust established by the city and county councils of Cork as well as University College Cork, and the arboretum and gardens were managed by the Office of Public Works; the house was transferred by the end of 2007, while the surrounds were to come under IHT management after five years.  The IHT also acquired an art collection from AIB. Further acquisitions were expected, but none occurred for around eight years, due to State funding limitations, and a lack of expected private donations.  By its fifth anniversary, in 2011, the IHT, with just five full-time staff, was the subject of a review by its sponsoring government department, which commented \"apart from the donation of the Wood collection “no significant private funding has emerged to support the work of the Trust over its first five years”.\"  The trust rationalised staffing at the one property, and cut opening times, although it was noted that since it took Fota over, visitor numbers had doubled.\nThe trust added Strokestown House and Park, and the National Famine Museum there, to its collection in 2015, as well as assuming management, on behalf of Teagasc, of Johnstown Castle and the Agricultural Museum just outside Wexford town.\nIn March 2023, it was announced that the trust would start on a €5.2m conservation-lead refurbishment and restoration of its headquarters at 11 Parnell Square. In July of the same year, the trust announced it would partner with the ESB Group to create a museum at 12 Lower Fitzwilliam Street on the Georgian mile.\nTrust properties\nAs of 2024, the trust has three heritage properties regularly open to the public:\n* Fota House and Gardens\n* Johnstown Castle\n* Strokestown Park\nIn addition, its headquarters building is a heritage property, at number 11 Parnell Square, and it will be working to develop a museum in a Georgian house at 12 Fitzwilliam Street to replace the closed Number Twenty Nine: Georgian House Museum in Dublin's south inner city.\nReaction\nOn the launch of the IHT, the Irish Times editorial commended the volunteer members of the board of the trust but questioned its status, describing its launch as having \"a whiff of a political 'con job'\" and saying that \"the remit of the fine-sounding Irish Heritage Trust is so limited that the institution does not deserve the title\". It also commented that An Taisce had cause for complaint about its exclusion from the IHT board.\nSee also\n* An Taisce\n* Dublin Civic Trust\n* Irish Georgian Society\n* Irish Landmark Trust\n* Limerick Civic Trust\n* The Follies Trust\nReferences"
    }
  ]
}