{
  "content": [
    {
      "type": "text",
      "text": "# Irish National War Memorial Gardens\n\nThe Irish National War Memorial Gardens () is an Irish war memorial in Islandbridge, Dublin, dedicated \"to the memory of the 49,400 Irish soldiers who gave their lives in the Great War, 1914–1918\", out of a total of 206,000 Irishmen who served in the British forces alone during the war.\nThe Memorial Gardens also commemorate all other Irish men and women who at that time served, fought and died in Irish regiments of the Allied armies, the British, Canadian, Australian, New Zealand, South African and United States armies in support of the Triple Entente's war effort against the Central Powers.\nBackground\nIn 1914, Ireland was part of the United Kingdom of Great Britain and Ireland and many Irishmen joined the British armed forces. In particular, the British Army had eight regiments that were raised in Ireland.\nCommissioning\nFollowing a meeting of over 100 representatives from all parts of Ireland on 17 July 1919, a trust fund was created to consider plans and designs for a permanent memorial \"to commemorate all those Irish men and women killed in the First World War\". A general committee was formed in November 1924 to pursue proposals for a site in Dublin. For technical and administrative reasons it was not until its meeting on 28 March 1927 in the Shelbourne Hotel that Merrion Square, alternatively St Stephen's Green, were proposed. A debate in the Free State Senate failed to resolve the impasse. W. T. Cosgrave, president of the Irish Free State Executive Council then appointed Cecil Lavery to set up a \"War Memorial Committee\" to advance the memorial process.\nCosgrave who was very interested in bringing the memorial to fruition met with Andrew Jameson, a senator and member of the committee on 9 December 1930 and suggested the present site. At that time known as the \"Longmeadows Estates\" it is about  in extent stretching parallel along the south bank of the River Liffey from Islandbridge towards Chapelizod. His proposal was adopted by the committee on 16 December 1931. Cosgrave said at the time that \". ... this is a big question of remembrance and honour to the dead and it must always be a matter of interest to the head of the government to see that a project so dear to a big section of the citizens should be a success\".\nGeneral Sir William Hickie said \"the memorial is an all-Ireland one\". A generous gift was sanctioned by the Irish Government in an eleven-paragraph agreement with the committee on 12 December 1933, the Dublin City Council Office of Public Works (OPW) having already commenced work with 164 men during 1932.\nIn the adverse political conditions of the 1930s, Éamon de Valera's government still recognised the motives of the memorial and made valuable state contributions to it. The cabinet approved work to be divided 50% between British and Irish WWI ex-servicemen. Many difficulties arose in 1937 for the committee with regard to plants, trees and the need to obtain a completion certificate from the Office of Public Works, which was finally issued in January 1938. An official opening was agreed for 30 July 1939, but the looming threat of war led to it being postponed. In the end, no official opening ever happened, but the first public event in the gardens took place in 1940 for Armistice Day celebrations.\nDesign\nDesigned by the great memorialist Sir Edwin Lutyens who had already landscaped designed several sites in Ireland and around Europe, it is outstanding among the many war memorials he created throughout the world. He found it a glorious site. The sunken Garden of Remembrance surrounds a Stone of Remembrance of Irish granite symbolising an altar, which weighs seven and a half tons. The dimensions of this are identical to First World War memorials found throughout the world, and is aligned with the Great Cross and Central Avenue. Opposite to the Phoenix Park obelisk, it lies about three kilometres from the centre of Dublin, on grounds which gradually slope upwards towards Kilmainham Hill. Old chronicles describe Kilmainham Hill as the camping place of Brian Boru and his army prior to the last decisive Battle of Clontarf on 23 April 1014. The memorial was amongst the last to be erected to the memory of those who sacrificed their lives in World War I (Canada's National War Memorial was opened in 1939), and is \"the symbol of Remembrance in memory of a Nation's sacrifice\". The elaborate layout includes a central sunken rose garden composed by a committee of eminent horticulturalists, various terraces, pergolas, lawns and avenues lined with impressive parkland trees, and two pairs of book rooms in granite, representing the four provinces of Ireland, and containing illuminated volumes recording the names of all the dead.\nAt the north of the gardens overlooking the River Liffey stands a domed temple. This also marks the beginning of the avenue leading gently upwards to the steps containing the Stone of Remembrance. On the floor of the temple is an extract from the \"War Sonnett II: Safety\" by Rupert Brooke:\n\"We have found safety with all things undying,\nThe winds, and morning, tears of men and mirth,\nThe deep night, and birds singing, and clouds flying,\nAnd sleep, and freedom, and the autumnal earth.\"\nConstruction\nThere was no discord in its building – workers were so drawn from the unemployed that 50 per cent were former World War I ex-British Army and 50 per cent ex-Irish Army men. To provide as much work as possible the use of mechanical equipment was restricted, and even granite blocks of 7 and 8 tonnes from Ballyknockan and Donnelly's quarry in Barnacullia were manhandled into place with primitive tackles of poles and ropes. On completion and intended opening in 1939 (which was postponed) the trustees responsible said: \"It is with a spirit of confidence that we commit this noble memorial of Irish valour to the care and custody of the Government of Ireland\".\nDedication, neglect and renewal\nAlthough commemorations by Irish British Armed Forces veterans and families of those killed in the course of the Great War took place at the site for a few years in the late 1940s and 1950s, with some large attendances, the politico-cultural situation in the state, and its nationally dominant ideologically adverse view of Ireland's role in World War I, and of those who had volunteered to fight in World War II, prevented the garden from being civically opened and dedicated.\nThe garden was subject to two Irish Republican paramilitary attacks. On Christmas night 1956 a bomb was placed at the base of its Stone of Remembrance and memorial cross and detonated, but the County Wicklow quarried granite withstood the blast with little damage. Another attempt was made to bring it down again with a bomb detonation in October 1958, which once more failed, resulting in superficial damage.\nA subsequent lack of financing from the government to provision its up-keep and care allowed the site to fall into dilapidation and vandalism over the following decades, to the point that by the late 1970s it had become a site for caravans and animals of the Irish Traveller community, with the Dublin Corporation's refuse disposal office using it as a rubbish dump for the city's waste. In addition fifty years of storms and the elements had left their mark, with structural damage unrepaired to parts of the garden's ornamentation.\nIn the mid-1980s economic and cultural shifts began to occur in Ireland which facilitated a regeneration of urban decay in Dublin, and the beginning of a change in the public's view of its pre-Irish Revolution national history and identity, which led to a project of restoration work to renew the park and gardens to their former splendour being undertaken by the Office of Public Works, co-funded by the National War Memorial Committee. On 10 September 1988 the fully restored gardens were re-opened to the public, and formally dedicated by representatives of the four main churches of Ireland, half a century after its creation.\nIn November 2018, an architectural competition was launched to design a bridge to be built over the River Liffey providing access to the gardens from Chapelizod Road. This bridge would be in partial fulfilment of Lutyens' original plan which included a bridge over the river. An architectural design was selected in May 2018. In July 2025, a contractor was appointed to carry out the works. Construction works commenced in October 2025.\nOfficial ceremonial events at the garden\n* A state commemoration to mark the 90th anniversary of the Battle of the Somme on 1 July 2006 was attended by the President of Ireland Mary McAleese, the Taoiseach Bertie Ahern, members of the Oireachtas, leading representatives of all political parties in Ireland, the Diplomatic Corps of the Allies of World War I, delegates from Ulster, representatives of the four main churches, and accompanied by a guard of honour of the Irish Army and Army Band.\n* On 18 May 2011 Queen Elizabeth II and the President of Ireland, Mary McAleese, laid wreaths to honour Ireland's dead of World War I and World War II at a ceremony in the garden during the first state visit of a British monarch to the Irish Republic.\n* On 9 July 2016 a state ceremony to mark the centenary of the Battle of the Somme took place within the gardens, with the Taoiseach Enda Kenny in attendance and the President of Ireland, Michael D. Higgins, laying a wreath to the honour of the soldiers of Ireland who lost their lives during its course.\nRoll of Honour\nIn the granite paved pergolas surrounding the garden are the 8 illuminated volumes of ''Ireland's Memorial Records 1914-1918'' which record the names of the dead. Each page is illustrated on four sides with artwork by Harry Clarke. They are displayed in cases designed by Lutyens.\nA wooden cross of oak, the Ginchy Cross, built by the 16th (Irish) Division and originally erected on the Somme to commemorate 4,354 men of the 16th who died in two engagements, is housed in the same building. Three granite replicas of this cross are erected at locations liberated by Irish divisions – Guillemont and Messines-Wytschaete in Belgium, and Thessaloniki in Greece.\nPatronage\nThe Irish National War Memorial Gardens are now managed by the Government's Office of Public Works (OPW) in conjunction with the National War Memorial Committee.\nA further Great War Irish national memorial, taking the form of an all-Ireland journey of conciliation, was jointly opened in 1998 by Mary McAleese, President of Ireland, Queen Elizabeth II and Albert II, King of the Belgians at the Island of Ireland Peace Park, Messines, Flanders, Belgium.\nCreosote stream\nA small stream, commonly known as the Creosote Stream, emerges and flows into the River Liffey at the western edge of the gardens. The stream rises west of Inchicore railway works, some distance away, before flowing underneath the site to emerge close to the Liffey on the grounds of the War Memorial Gardens. The stream got its name from pollutants which used to leach into it from the railway works.\nSee also\n* List of works by Edwin Lutyens\n* Garden of Remembrance, Dublin\n* Peace Park, Dublin\n* Grangegorman Military Cemetery, Dublin\n** Other Great War memorials relating to Ireland:\n** Island of Ireland Peace Park, Messines, Belgium.\n** Menin Gate memorial, Ypres, Belgium.\n** Ulster Tower Memorial, Thiepval, France.\nNotes\nBibliography\n*\n*\nFurther reading\n* Kevin Myers: ''Ireland's Great War, Lilliput Press (2014), .\n* Myles Dungan: They Shall not Grow Old: Irish Soldiers in the Great War, Four Courts Press (1997), .\n* Keith Jeffery: Ireland and the Great War, Press Syndicate of the University of Cambridge (2000), .\n* Bryan Cooper (1918):  The 10th (Irish) Division in Gallipoli, Irish Academic Press (1993), (2003). .\n* Thomas P. Dooley:  Irishmen or English Soldiers? : the Times of a Southern Catholic Irish Man (1876–1916), Liverpool Press (1995), .\n* Terence Denman:  Ireland's unknown Soldiers: the 16th (Irish) Division in the Great War, Irish Academic Press (1992), (2003) .\n* Desmond & Jean Bowen:  Heroic Option: The Irish in the British Army, Pen & Sword Books (2005), .\n* Steven Moore:  The Irish on the Somme (2005), .\n* Thomas Bartlett & Keith Jeffery: A Military History of Ireland, Cambridge University Press (1996) (2006),\n* David Murphy: Irish Regiments in the World Wars, Osprey Publishing (2007),\n* David Murphy:  The Irish Brigades, 1685–2006, A gazetteer of Irish Military Service past and present, Four Courts Press (2007) The Military Heritage of Ireland Trust.\n* Stephen Walker: Forgotten Soldiers; The Irishmen shot at dawn'' Gill & Nacmillan (2007),\nExternal links\n*[http://opwdublincommemorative.ie/war-memorial/ OPW Guide to Irish National War Memorial]\n*[https://web.archive.org/web/20080807010613/http://www.heritageireland.ie/en/Dublin/WarMemorialGardens/ Access and other information] from the Office of Public Works (OPW)\n*[https://repository.dri.ie/catalog/8623xc85j Irish War Memorial Committee archives] – held by Royal Dublin Fusiliers Association, online at Digital Repository of Ireland\n*[https://web.archive.org/web/20130728041814/http://www.taoiseach.gov.ie/eng/Historical_Information/1916_Commemorations/Irish_Soldiers_in_the_First_World_War.html Department of the Taoiseach: Irish Soldiers in the First World War]\n*[http://www.irishsoldiers.com/ The Military Heritage of Ireland Trust]\n*[http://www.irishwarmemorials.ie/ The Irish War Memorials Project – listing of monuments throughout Ireland]\n*[http://homepage.eircom.net/~wlawless/ww1/Dublin.htm Dublin Memorials of the Great War 1914–1918]\n*[http://www.connaughtrangersassoc.com/ Homepage of the Connaught Ranger's Association]\n*[http://www.royaldublinfusiliers.com/ Homepage of the Royal Dublin Fusiliers Association]\n*[http://www.inniskilling.com/ Homepage of the Royal Inniskilling Fusiliers Association]\n*[http://www.rmfa92.org/ Homepage of the Royal Munster Fusilier's Association]\n*[http://www.dungarvanmuseum.org/exhibit/web/Display/article/181/ Homepage of the Waterford Museum: WWI and Ireland]\n*\n*[https://web.archive.org/web/20110726090403/http://www.combined-irish-regiments-oca.org.uk/ Homepage of the Combined Irish Regiments Association]"
    }
  ]
}