{
  "content": [
    {
      "type": "text",
      "text": "# Irish Republic (1798)\n\nThe Irish Republic of 1798, more commonly known as the Republic of Connacht, was a short-lived state proclaimed during the Irish Rebellion of 1798 that resulted from the French Revolutionary Wars. A sister republic of the French Republic, it theoretically covered the whole island of Ireland, but its functional control was limited to only very small parts of the Province of Connacht. Opposing British forces were deployed across most of the country including the main towns such as Dublin, Belfast and Cork.\nProclamation\nAt the time of the Rebellion of 1798 a force of 1,000 French soldiers under General Jean Joseph Amable Humbert landed at Killala in County Mayo. General Humbert proclaimed the Irish Republic in his declaration to the people upon landing in Ireland on 22 August 1798:\nAfter the nascent Republic's victory at the Battle of Castlebar which took place on 27 August 1798, General Humbert, on 31 August 1798, issued the following decree, which inter alia appointed John Moore as the President of the Government of the Province of Connacht:\nThe rebel republic was a client state of the French Republic and was very short lived. Nevertheless, among the things which President Moore did have time to do was to issue \"paper money to a considerable extent...[i]n the name of the French Government\". Despite their general anti-clericalism and hostility to the Bourbon monarchy, the French Directory suggested to the United Irishmen in 1798 restoring the Jacobite Pretender, Henry Benedict Stuart, as Henry IX, King of the Irish. This was on account of General Humbert landing a force in County Mayo for the Irish Rebellion of 1798 and realising the local population were devoutly Catholic (a significant number of Irish priests supported the Rising and had met with Humbert, although Humbert's Army had been veterans of the anti-clerical campaign in Italy). The French Directory hoped this option would allow the creation of a stable French client state in Ireland.  However, Wolfe Tone, the Protestant republican leader, scoffed at the suggestion and it was quashed, with an Irish Republic proclaimed.\nDefeat\nMemorial of a rebel pikeman, erected in Ballinamuck in 1928\nby James Gillray. A French army stamp on the valuables of an Irish Catholic church, and assault a priest. The cross is covered by a Phrygian cap; statues and crucifixes vandalised.]]\nOn 8 September 1798, just weeks after its proclamation, the republic collapsed after the Battle of Ballinamuck. Moore was captured by a detachment of government troops led by Lieutenant Colonel Crawford in Castlebar, dying in custody the following year. Humbert and his men were transported by canal to Dublin and exchanged for British prisoners of war. Government forces subsequently slowly spread out into the republic, engaging in numerous skirmishes with rebel holdouts. These sweeps reached their climax in 23 September when Killala was captured by government forces. During these sweeps, suspected rebels were frequently summarily executed while many houses thought to be housing rebels were burnt. Numerous rebels took to the countryside and continued guerrilla operations, which took government forces some months to suppress.\nReferences\nBibliography\n*\n*"
    }
  ]
}