{
  "content": [
    {
      "type": "text",
      "text": "# Iromie Wijewardena\n\nIromie Wijewardena is a Sri Lankan figurative expressionist artist. She has conducted many Sri Lankan local and international exhibitions since 1973.\nCareer\nShe engaged in her first solo exhibition as a schoolgirl in 1973, which turned out to be a turning point in her life. She graduated from the University of Kelaniya with a Bachelor of Fine Arts degree in painting, textile designing, and printing, and she was part of Kelaniya University's first batch of students who successfully graduated from the university. She enrolled in the Institute of Aesthetic Studies (now called Visual Arts) at the University of Kelaniya. She explored and studied a variety of art forms, which also included temple murals, as part of her higher studies.\nOne of her paintings titled \"The Royal Procession\" was chosen by the Yugoslav government for Yugoslavia's official postage stamp. Iromie eventually became the first Sri Lankan artist to receive the honour and unique distinction of having his or her painting officially depicted on a foreign stamp. Her painting titled \"Musicians\" was selected as one of the frontrunners to be displayed on the back cover of ''Reader's Digest magazine in 1999 and it was finalized by the magazine. She became only the third Sri Lankan artist to have had their paintings gracing the back cover of the Reader's Digest'' magazine after Senaka Senanayake and Raja Segar.\nIn 2006, she was appointed as the chairperson of the jury panel of the Asian Art Biennale in Bangladesh and she was only the second woman to be elected as the chairperson of the jury panel of the Asian Art Biennale. Iromie has served on many distinguished panels such as Ceylon Society of Arts Executive Committee, Painting and Sculpture panel of the Arts Council of Sri Lanka. She was the only Sri Lankan to be invited for the World Art Dubai 2016 event and she displayed one of her paintings in the event. She received the prestigious national honour of Kala Bhushana in 2021 in recognition of her outstanding contributions to the field of arts. In 2016, Sifani Jewellers hosted Iromie along with Raja Segar for a joint exhibition in order to display their distinctly different styles of paintings.\nIn March 2024, she marked her 50 years of painting career by conducting an exhibition titled \"Celebration of women\" at the Harold Peiris Gallery in Colombo and the exhibition portrayed the different phases and trajectory of Iromie in her long journey as an artist. Sri Lankan President Ranil Wickremesinghe also attended her 50 years of painting exhibition.\nReferences"
    }
  ]
}