{
  "content": [
    {
      "type": "text",
      "text": "# Iron Duke-class battleship\n\n{|\noff Jaffa in 1920\n}}\n|Class before=\n|Class after=\n|Subclasses=\n|Cost=\n|Built range=\n|In service range=1914–1946\n|Total ships planned=4\n|Total ships completed=4\n|Total ships scrapped=4\n}}\n*Full load:\n|Ship length=\n|Ship beam=\n|Ship height=\n|Ship draught=\n|Ship power=\n*\n*18 × water-tube boilers\n|Ship propulsion=\n*4 × screw propellers\n*4 × steam turbines\n|Ship speed=\n|Ship range= at\n|Ship complement=\n|Ship crew=\n|Ship armament=\n*10 ×  guns\n*12 ×  guns\n*2 × 3-inch (76&nbsp;mm)  AA guns\n*4 ×  torpedo tubes\n|Ship armour=\n*Belt:\n*Bulkheads:\n*Barbettes:\n*Turrets:\n*Decks:\n|Ship notes=\n}}\n|}\nThe 'Iron Duke class' was a group of four dreadnought battleships built for the British Royal Navy before the First World War. The class comprised four ships: , , , and . Launched from October 1912 to November 1913, this was the third class of Royal Navy super-dreadnoughts.\nThe ships were essentially repeats of the  battleships; they retained the same ten 13.5&nbsp;inch (34.3&nbsp;cm) guns in five twin gun turrets on the centreline. However, the Iron Dukes had improved armour and a more powerful secondary armament of 6-inch weapons instead of the 4-inch mounted on the earlier ships.\nThe four ships were the most advanced battleships in the Royal Navy at the outbreak of the First World War, though they were soon surpassed by the five ships of the . They all saw extensive service during the war with the Grand Fleet, where Iron Duke acted as the flagship for the fleet commander, Admiral John Jellicoe. Three of the ships, Iron Duke, Benbow, and Marlborough, were present at the Battle of Jutland; Emperor of India missed the battle by being in dock for periodic refit. The four Iron Duke-class battleships saw limited active duty following the end of the war; they were all demilitarised under the terms of the London Naval Treaty signed in 1930. Iron Duke was reduced to a training and depot ship and lasted in that role until 1946 when she was scrapped. Benbow was scrapped in 1931 and Marlborough followed in 1932. Emperor of India was sunk as a gunnery target in 1931 though was later re-floated to be scrapped in 1932.\nDesign\nGeneral characteristics\nThe Iron Duke-class ships were 622&nbsp;feet 9&nbsp;inches (189.8&nbsp;metres) long overall, and had a beam of 90&nbsp;ft (27.4&nbsp;m) and a draught of 29&nbsp;ft (8.8&nbsp;m). This was an increase of 25&nbsp;ft (7.7&nbsp;m) in length and 1&nbsp;ft (.3&nbsp;m) in width over the preceding King George V-class ships. The Iron Dukes displaced 25,000&nbsp;long tons (25,400&nbsp;tonnes). This was some 2,000&nbsp;tons (2,032&nbsp;tonnes) heavier than the preceding King George Vs, and was primarily due to the increase in calibre of the secondary battery.\nThe ships were powered by four-shaft Parsons turbines. Steam was provided to the turbines by 18 Babcock & Wilcox or Yarrow boilers. The engines were rated at 29,000&nbsp;shaft horsepower and delivered a top speed of . Iron Duke and her sisters had a fuel storage capacity of  of coal and  of oil. This enabled a maximum range of  at a cruising speed of .\nArmament\nPrimary battery\nThe Iron Duke-class ships mounted a main battery of ten 13.5&nbsp;inch (34.3&nbsp;cm) Mk V(H) guns in five twin gun turrets, all mounted on the centreline. Two turrets were placed in a superfiring pair forward (\"A\" and \"B\" turrets), one turret amidships&mdash;the \"Q\" turret&mdash;directly after the two funnels, and two in a superfiring pair aft of the rear superstructure (\"X\" and \"Y\" turrets). The gun houses used were Mk II turrets that weighed 600&nbsp;tons (610&nbsp;tonnes) and allowed for depression to −5° and elevation to 20°. Despite this, the range dials on the gunsights at the time of construction were graduated to 15 degrees; super-elevating cams and prisms to allow the full elevation of the guns to be used were issued some time after the Battle of Jutland. The forward and aft gun turrets could train 150° in either direction from the centreline, while the \"Q\" had a much more limited range. It could engage targets on an arc from between 30° to 150° from the centerline on either beam of the ship.\nThe guns fired at a rate of 1.5&ndash;2 rounds per minute. The Mk V \"Heavy\" gun fired a variety of shells, including high explosive and armour-piercing rounds; they all weighed 1,400&nbsp;lb (635&nbsp;kg). The guns were loaded with MD45 propellant charges that weighed 297&nbsp;lb (135&nbsp;kg); these were stored in silk bags. This provided a muzzle velocity of 2,491&nbsp;ft/s (759&nbsp;meters per second). At maximum elevation of 20°, the guns had a range of 23,740&nbsp;yards (21,710&nbsp;m), though at the maximum effective elevation of 15°, the range was somewhat shorter, at approximately 20,000&nbsp;yd (18,290&nbsp;m). At a range of 10,000&nbsp;yd (9,144&nbsp;m), the gun could penetrate up to 12.5&nbsp;in (318&nbsp;mm) of Krupp cemented steel armour, the type used on contemporary German dreadnoughts.\nSecondary battery\nThe secondary battery consisted of twelve 6-inch (15.2&nbsp;cm) Mk VII guns mounted in casemates in the hull around the forward superstructure. These guns were chosen because the 4-inch (10.2&nbsp;cm) guns on earlier battleships were deemed to be too weak and have too short a range to effectively combat torpedo boats with newer, more powerful torpedoes. Admiral Jackie Fisher had opposed the idea of increasing the secondary battery, though he retired from the post of First Sea Lord in 1910. As a result, the Iron Dukes, which were designed in 1911, received the larger 6&nbsp;inch gun.\nThese guns fired 100&nbsp;lb (45.4&nbsp;kg) shells at a rate of between 5 and 7 per minute. The shells were fired with a muzzle velocity of 2,775&nbsp;ft/s (846&nbsp;m/s), though the guns were capable of higher velocities. It was reduced in order to standardize the performance of all the 6&nbsp;inch guns in Royal Navy service, which would simplify range calculations for guns of the calibre. The guns could elevate to 20°, which enabled a maximum range of 15,800&nbsp;yd (14,450&nbsp;m).\nThere were some significant problems with the casemate guns early on, however. They were equipped with hinged plates that were designed to close off the casemate opening in heavy seas. The plates were easily washed away, though, and without them, water easily entered the ship and caused significant flooding. This problem was compounded by the fact that they had been mounted too low in the hull, which subjected them to heavier pounding from rough seas. The problem was eventually corrected by the addition of dwarf bulkheads in the gun houses and rubber seals to the hinged plates.\nOther armament\nIron Duke was the first British battleship to be mounted with anti-aircraft weaponry. In 1914, two 3&nbsp;in (7.62&nbsp;cm) QF guns were fitted to the aft superstructure, primarily to defend against German airships. The guns fired between 12 and 14 rounds per minute, and were expected to fire approximately 1,250 shells before replacement or repair was necessary. The shells fired were 12.5&nbsp;lb (5.67&nbsp;kg) with a high-explosive warhead. They were manually operated, and had a maximum effective ceiling of 23,500&nbsp;ft (7,160&nbsp;m).\nAs was customary for capital ships of the period, the Iron Duke-class ships were equipped with submerged torpedo tubes. The ships carried four 21&nbsp;in (53.3&nbsp;cm) tubes, two on each beam. These launched Mk II torpedoes that carried a 515&nbsp;lb (234&nbsp;kg) TNT warhead. They had two speed settings;  and . At 31&nbsp;knots, the range was 10,750&nbsp;yd (9,830&nbsp;m), though at 45&nbsp;kn the range was considerably reduced, to 4,500&nbsp;yd (4,110&nbsp;m).\nArmour\nThe Iron Duke-class battleships had an armour belt that was  thick in the central area of the ship, where the ammunition magazines, machinery spaces, and other vital parts of the ship were located. The belt tapered down to  towards the bow and stern. The barbettes that contained the main gun turrets were  on the sides and  on the rear, where shells were less likely to hit. The turrets themselves were  thick on the sides. The ships' armoured deck was between 25 and 65&nbsp;mm (1&ndash;2.5&nbsp;in) thick. After the battle of Jutland in May 1916, some 820&nbsp;tonnes of armour was added to the ships, primarily to thicken the deck around the main battery turrets, as well as to increase the bulkheads in the ammunition magazines.\nShips\n{|class=\"wikitable plainrowheaders\"\n|+ Construction data\n!scope=\"col\" align = center|Ship\n!scope=\"col\" align = center|Builder\n!scope=\"col\" align = center|Laid down\n!scope=\"col\" align = center|Launched\n!scope=\"col\" align = center|Commissioned\n!scope=\"col\" align = center|Fate\n|-\n|scope=\"row\"|\n|HM Dockyard, Portsmouth\n|12 January 1912\n|12 October 1912\n|10 March 1914\n|Broken up at Glasgow, 1949\n|-\n|scope=\"row\"|\n|HM Dockyard, Devonport\n|25 January 1912\n|24 October 1912\n|2 June 1914\n|Broken up at Rosyth, 1932\n|-\n|scope=\"row\"|\n|William Beardmore, Glasgow\n|30 May 1912\n|12 November 1913\n|7 October 1914\n|Broken up at Rosyth, 1931\n|-\n|scope=\"row\"|\n|Vickers, Barrow-in-Furness\n|31 May 1912\n|27 November 1913\n|10 November 1914\n|Broken up at Rosyth, 1932\n|}\nIron Duke\nflying overhead, in 1914]]\nUpon commissioning,  was assigned to the Home Fleet as the flagship of Admiral George Callaghan. After the outbreak of the First World War, the Royal Navy was reorganized; the Home Fleet and the Atlantic Fleet were combined to form the Grand Fleet; Iron Duke retained her position as fleet flagship, under John Jellicoe. The ship took part in all of the major fleet actions, though only one of them ended in combat&mdash;the sortie on 31 May 1916 that resulted in the Battle of Jutland. At Jutland, Iron Duke was assigned to the 3rd Division of the 4th Battle Squadron, and was stationed in the centre of the British line.\nFollowing the end of the war, Iron Duke was transferred to the Mediterranean Fleet. During 1919&ndash;20, the ship operated in the Black Sea in support of the White Russians during the Russian Civil War. The Washington Naval Treaty of 1922 mandated that Iron Duke be removed from the active roster. However, she remained with the fleet for a short time, having been transferred to the Atlantic Fleet in 1926. This duty assignment lasted 3 years, after which she was removed from active service. She was demilitarised, to be used as a training ship. Two of her gun turrets and a good deal of her armour were removed, and her speed was reduced to  through the removal of some of her boilers. She was later used as a depot ship in Scapa Flow, starting in 1939. After the outbreak of the Second World War that year, her remaining guns were removed to be used in shore defences. Luftwaffe bombers attacked her on 17 October 1939; while they scored no direct hits, several near misses caused significant damage. After repairs were effected, the ship resumed her duties as a depot vessel until the end of the war. She was finally sold for scrapping in 1946.\nMarlborough\nwas the most heavily engaged ship of the class during the battle of Jutland; she fired a total of 162 heavy-calibre shells, out of a total of 292 for the entire class. She was assigned to the 6th Division of the 1st Battle Squadron, towards the rear of the British line. She served as the flagship of Vice Admiral Cecil Burney. During the battle, she was hit by a torpedo amidships; the torpedo tore a hole that was 21&nbsp;m by 6&nbsp;m (70&nbsp;ft by 20&nbsp;ft). Despite the damage, she was able to keep her position in the line, though her speed was reduced to . Marlborough continued to fire her main guns until the list increased to the point that prevented her guns from being effectively employed. The ship eventually withdrew to the Humber, where she undertook 3 months of repairs.\nPost-war, Marlborough joined Iron Duke in the Mediterranean, where she remained until 1926. She was then transferred to the Atlantic Fleet; her tour of duty there lasted until 1929, at which point she was withdrawn from active duty. The ship was sold for scrapping in 1932.\nBenbow\nLike her sisters,  was assigned to the Grand Fleet for the duration of the First World War. She was assigned to the 4th Battle Squadron on 10 December 1914. Benbow was the flagship of Admiral Doveton Sturdee, the commander of the 4th Division of the 4th Battle Squadron, during the battle of Jutland. The 4th Division was directly ahead of the 3rd Division, where Admiral Jellicoe commanded the fleet from Benbows sister Iron Duke. Throughout the battle the ship remained undamaged. Like Iron Duke and Marlborough, Benbow was transferred to the Mediterranean in 1919, and she provided artillery support to White Russian forces in the Black Sea. She followed Marlborough to the Atlantic Fleet in 1926; she too was stricken in 1929 and sold for scrap.\nEmperor of India\nwas also assigned to the 4th Battle Squadron, in December 1914. She missed Jutland because she was in dock for a periodic refit. After the end of the war, she was transferred to the Mediterranean along with the other three ships of the class. Emperor of India returned to England in 1922 for a refit, after which she resumed her duties in the Mediterranean. She likewise joined the Atlantic Fleet in 1926, alongside her sisters, and stricken in 1929. Instead of being scrapped, however, she was used as a gunnery target, and sunk in 1931. She was raised shortly thereafter and sold to ship breakers on 6 February 1932.\nFootnotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://dreadnoughtproject.org/tfs/index.php/Iron_Duke_Class_Battleship_(1912) Dreadnought Project] Technical material on the weaponry and fire control for the ships"
    }
  ]
}