{
  "content": [
    {
      "type": "text",
      "text": "# Isaaq kingdom\n\n| common_name            =\n| image_flag             = Isaaq Flag.svg\n| flag_caption           = A banner used by the Adal Sultanate and later the Isaaq on key religious shrines\n| image_coat             =\n| symbol_type            =\n| other_symbol           =\n| other_symbol_type      =\n| image_map              =\n| map_caption            =\n| capital                =\n| largest_city           =\n| official_languages     = Arabic and Somali\n| demonym                = Isaaq\n| government_type        = Absolute Monarchy\n| leader_title1          = 1300s (first)\n| leader_name1           = King Harun\n| leader_title2          = early 1700s (Last)\n| leader_name2           = King dhuuh baraar\n| legislature            = Guurti convening shirs or elder meetings\n| established_event1     = founded\n| established_date1      = 14th century\n| established_event2     = Overthrown\n| established_date2      = mid-18th century\n| religion               = Sunni Islam\n| area_km2               =\n| population_estimate    =\n| population_estimate_year =\n| currency               =\n| currency_code          =\n| time_zone              =\n| utc_offset             =\n| drives_on              =\n| calling_code           =\n| iso_code               =\n| today                  = Somaliland\n}}\nThe Isaaq Kingdom (, Wadaad: ,  ) was a Muslim Somali-Arabic kingdom that emerged after the fall of the Adal Sultanate between the 14th until it was overthrown by a coalition of Isaaq in the middle of the 18th century.\naccording to oral tradition, the kingdom was led by the Tol Jeclo branch of the Greater Isaaq clan Family, where they ruled for centuries starting from the 13th century.\nIt was the predecessor to the more widely known Isaaq Sultanate which ruled from 1749 to 1884 under the Guled Dynasty.\nHistory\nOrigins\nSomali genealogical tradition places the origin of the Isaaq tribe in the 12th or 13th century with the arrival of Sheikh Ishaaq Bin Ahmed (Sheikh Ishaaq) was one of the scholars who crossed the sea from Arabia to the Horn of Africa. Sheikh Ishaaq  settled in the coastal town of Maydh in modern-day northeastern Somaliland. Hence, Sheikh Ishaaq married two local women in Somaliland that left him eight sons, which would be the forefathers of the 8 Isaaq clans.\nEstablishment\nBy the 1300s the Isaaq clans united to defend their inhabited territories and resources during clan conflicts against migrating clans, and by the 1600s, after the fall of the Adal Sultanate, the Somali lands split into numerous clan states, among them the Isaaq.\nAccording to oral tradition, prior to the House of Guled, the Isaaq clan-family were ruled by a dynasty of the Tolje'lo branch starting from, descendants of Ahmed nicknamed Tol Je'lo, the eldest son of Sheikh Ishaaq. There were eight Tolje'lo rulers in total who ruled for centuries starting from the 13th century.\nReferences"
    }
  ]
}