{
  "content": [
    {
      "type": "text",
      "text": "# Ischia International Journalism Award\n\nThe Ischia International Journalism Award is one of the most important Italian journalism awards. It is organized under the High Patronage of the President of the Italian Republic, the Regione Campania, the Province of Naples, the National Federation of the Italian Press and the Italian Order of Journalists. It takes place in the city of Ischia.\nThe award was founded in 1980 by Giuseppe Valentino (1926–1988).\nHistory\n\"A recognition to those who have sought and told, over an entire career, his own truth through the means of mass communication. A prize for Ischia that has always been a crossroads of different cultures, a bridge between the cultural tradition European and Mediterranean.\" So wrote Joseph Valentino when thirty years ago he gave birth to the first edition of the Ischia. And the event has always remained true to the spirit of that time: in thirty years has followed the unfolding of the chronicles of information growing hand in hand with the development of a society where communication has a growing role. And the evidence of this commitment is represented in the roll of gold which contains the main protagonists of the Italian and international media for the last three decades. It was founded in 1980 by Giuseppe Valentino, Ischia journalist in love with his island. An active love, rich in perspective. If, in fact, from the beginning, the Prize has sought to emphasize the importance of the release of information by giving awards to its best brands, value and professional ethics of journalists chosen, he also wanted to draw attention to the place of the award-stage, Ischia. It stood out in recent years to an intense cultural activity aimed mainly to journalism and the relationship between the world of information and other areas of culture and economy.\nAwarded journalists\n{| class=\"wikitable\"\n!Year\n!Name\n|-\n| 1980\n| Indro Montanelli\n| special awards\n|-\n| 1981\n| Jean Lewis\n|\n|-\n| 1982\n| Maurice Kettneker\n|\n|-\n| 1983\n| Liliane Palette\n|\n|-\n| 1984\n| Giorgio Bocca\n|\n|-\n| 1985\n| Alberto Ronchey\n|\n|-\n| 1986\n| Enzo Biagi\n|\n|-\n| 1987\n| Giulio Andreotti\n|\n|-\n| 1988\n| Joaquin Navarro Valls\n|\n|-\n| 1989\n| Giovanni Spadolini\n|\n|-\n| 1990\n| Harrison Salisbury\n|\n|-\n| 1991\n| Peter Arnett\n|\n|-\n| 1992\n| Demetrio Volcic\n|\n|-\n| 1993\n| Ugo Stille\n|\n|-\n| 1994\n| Ezio Mauro\n|\n|-\n| 1995\n| Walter Cronkite\n|\n|-\n| 1996\n| Eugenio Scalfari\n|\n|-\n| 1997\n| Indro Montanelli\n|\n|-\n| 1998\n| Candido Cannavò\n|\n|-\n| 1999\n| Jean Marie Colombani\n|\n|-\n| 2000\n| Paolo Mieli\n|\n|-\n| 2001\n| Arrigo Levi\n|\n|-\n| 2002\n| Peter Stothard\n|\n|-\n| 2003\n| Ferruccio De Bortoli\n|\n|-\n| 2004\n| Jesús Ceberio\n|\n|-\n| 2005\n| Giovanni di Lorenzo\n|\n|-\n| 2006\n| Jean Daniel\n|\n|-\n| 2007\n| David Grossman\n|\n|-\n| 2008\n| Timothy Garton Ash\n|\n|-\n| 2009\n| Armando Valladares\n|\n|-\n| 2009\n| Armando Valladares\n|\n|-\n| 2010\n| John Simpson\n|\n|-\n| 2011\n|\n|\n|-\n| 2012\n|Martin Wolf\n|\n|-\n| 2013\n|Francesco Guerrera\n|\n|-\n| 2014\n|\n|\n|-\n| 2015\n|Ignazio Escolar\n| penna d'oro Eugenio Scalfari, Ischia Prize Journalist of the Year in print Marco Damilano\nSpecial award – Journalist of the Year TV Nadia Toffa\nIschia Prize Journalist of the Year by the sports information Massimo Corcione\nSpecial Award Domenico Quirico\nCommunicator of the prize – Massimiliano Tarantino\nCommunicator of the International Prize Tian Wei\n|-\n|}\nReferences\nExternal links\n*[http://www.premioischia.it/?lang=en Official website]"
    }
  ]
}