{
  "content": [
    {
      "type": "text",
      "text": "# Ishwar Singh (politician, born 1926)\n\n}}\nChaudhary Ishwar Singh (5 November 1926 – 1998) was a leader of the Congress Party and served as the speaker of Haryana Vidhan Sabha from 1991 to 1996. He was elected as MLA for four times by the electorates of Pundri constituency of Haryana. He is well known for his contribution to uplift the poor and oppressed people in the society and for uplifting girls to get higher education by building 3 degree colleges in the constituency of Pundri.\nBackground\nChaudhary Ishwar Singh  was born on 5 November 1926 in the house of a poor farmer of village Staundi of Karnal District, Haryana. He received early education in his native village and then moved to Panipat from where he came out in his matriculation examination with flying colors. Then he moved to Rohtak and obtained his degree in Bachelors of Arts. to obtain his license of teaching degree he moved to Meerut. During his stay at these centers of learning certain incidents occurred which in a way determined the future course of Chaudhary Ishwar Singh's life. His teachers were very much impressed by his learning habits and took keen interest in grooming him into a great scholar. This quest of his knowledge took him to different places which left indelible imprint on his adolescent and young formative mind. During his student days he went through the teachings and message of Swami Vivekananda which provided Chaudhary Ishwar Singh with a purpose for social action, although he could not have stimulus of a personal contact with the Swami. He decided to mitigate the social evils illiteracy, poverty and hunger which affected the rural people. After he obtained hi L.T Degree, instead of competing for any lucrative government jobs he chose to join the teaching profession which suited his temperament and qualifications as he considered it a noble profession to serve the community. In his very first attempt he was selected by the interview board and the education department issued him appointment letter for the post of social studies teacher and posted him at Government High School, Samalkha (Karnal). Though his academic quest came to an end with his joining first as a teacher and then in active politics yet his quest for learning remained a lifelong passion for him.\nPolitical career\nChaudhary Ishwar Singh  impressed the people of Kaul with his sincerity and desire to work for the betterment of the community. He was also a great orator and words flowed easily from his tongue. He often used to talk about the great ancient history of Kaul. There is a very ancient fort in the village and Chaudhary Ishwar Singh Dhakla often said that this was the place where the wheel of Karna's chariot got stuck during his final fight against Arjun in Mahabharat.\nChaudhary Ishwar Singh  was elected to the Haryana Assembly as an independent candidate for the first time in 1968 and then again in 1972, 1982 and 1991 on Congress party ticket. He was a man of vision and was very instrumental in setting up many educational institutions. He served as the Speaker of the Haryana Vidhan Sabha from 1991 to 1996 under the last Bhajan Lal government of Haryana.\nSocial contribution\nHe wielded tremendous influence due to his closeness to Bhajan Lal, the stalwart Bishnoi leader and Chief Minister of Haryana on several occasions. Apart from that, Ishwar Singh Ji did a lot of social work. He ensured the opening of many educational institutions in his constituency of Pundri. He also had a power station built close to the village of Kaul. He stressed on women education. He always said that \"if a male is educated a family will be educated but if a female will educated the whole society will be educated\". In this context he established three women colleges named as Ch. Ishwar Singh Kanya Mahavidyalaya, Fatehpur-Pundri (Kaithal) www.ciskmv.org in 1984, and Ch. Ishwar Singh Kanya Mahavidyalaya, Dhand-Dadwana (Kaithal), Ch. Ishwar Singh Mahila Shikshan Mahavidyalaya, Fatehpur-Pundri (Kaithal) in 1994. These colleges imparting higher education to the girls of about sixty villages.\nReferences"
    }
  ]
}