{
  "content": [
    {
      "type": "text",
      "text": "# Ishwar Chandra Vidyasagar\n\n| birth_place      = Birsingha,  Bengal Presidency, British India\n| death_date       =\n| death_place      = Calcutta, Bengal Presidency, British India(now West Bengal, India)\n| resting_place    =\n| nationality      = Indian\n| occupation       = Educator, social reformer and author\n| language         = Bengali\n| education        =\n| alma_mater       = Sanskrit College (1828–1839)\n| period           =\n| genre            =\n| subject          =\n| spouse           = Dinamayee Devi\n| children         = 5\n| relatives        =\n| awards           =\n| signature        =\n| signature_alt    =\n| website          =\n| portaldisp       =\n}}\nIshwar Chandra Vidyasagar (26 September 1820 – 29 July 1891), popularly known as ''Ishwar Chandra 'Vidyasagar (), was an Indian educator and social reformer of the nineteenth century. His efforts to simplify and modernise Bengali prose were significant. He also rationalised and simplified the Bengali alphabet and type, which had remained unchanged since Charles Wilkins and Panchanan Karmakar had cut the first (wooden) Bengali type in 1780.\nHe was renowned as one of the main proponents of the Bengal Renaissance. He was the most prominent campaigner for Hindu widow remarriage, petitioning the Legislative Council despite severe opposition, including a counter petition (by Radhakanta Deb and the Dharma Sabha) which had nearly four times as many signatures. Even though widow remarriage was considered a flagrant breach of Hindu customs and was staunchly opposed, Lord Dalhousie personally finalised  the bill and the Hindu Widows' Remarriage Act, 1856 was passed. Against child marriage, efforts of Vidyasagar led to Age of Consent Act, 1891. In which the minimum age of consummation of marriage was 12 years.\nA weekly newspaper, Somprakash Patrika'', was started on 15 November 1858 (1 Agrahayan 1265 BS) by Dwarakanath Vidyabhusan. Dwarakanath (18191886) was a professor of the Sanskrit College in Calcutta, India. The original plan was mooted by Ishwar Chandra Vidyasagar (18201891), who continued to advise Dwarakanath in editorial matters. He was also associated as secretary with Hindu Female School which later came to be known as Bethune Female School.\nHe so excelled in his undergraduate studies of Sanskrit and philosophy that Sanskrit College in Calcutta, where he studied, gave him the honorific title  ('Ocean of Knowledge'; from the Sanskrit  and ).\nBiography\nIshwar Chandra Vidyasagar was born in a Hindu Brahmin family  to Thakurdas Bandyopadhyay and Bhagavati Devi at Birsingha village in Paschim Medinipur District (erstwhile undivided Midnapore District) on 26 September 1820. The family originally hailed from Banamalipur situated in present-day Hooghly district. At the age of 9, he went to Calcutta and started living in Bhagabat Charan's house in Burrabazar, where Thakurdas had already been staying for some years. Ishwar felt at ease amidst Bhagabat's large family and settled down comfortably in no time. Bhagabat's youngest daughter Raimoni's motherly and affectionate feelings towards Ishwar touched him deeply and had a strong influence on his later revolutionary work towards the upliftment of women. He championed the cause of female education.\nHis quest for knowledge was so intense that he used to study under a street light as it was not possible for him to afford a gas lamp at home He cleared all the examinations with excellence and in quick succession. He was rewarded with a number of scholarships for his academic performance. To support himself and the family, Ishwar Chandra also took a part-time job of teaching at Jorashanko. Ishwar Chandra joined the Sanskrit College, Calcutta and studied there for twelve long years and graduated in 1841 qualifying in Sanskrit Grammar, Literature, Dialectics [Alankara Shastra], Vedanta, Smriti and Astronomy As was the custom then Ishwar Chandra married at the age of fourteen. His wife was Dinamayee Devi. Narayan Chandra Bandyopadhyaya was their only son.\nIn the year 1839, Ishwar Chandra Vidyasagar successfully cleared his Sanskrit law examination. In 1841, at the age of twenty-one years, Ishwar Chandra joined Fort William College as head of the Sanskrit department.\nAfter five years, in 1846, Vidyasagar left Fort William College and joined the Sanskrit College as 'Assistant Secretary'. In the first year of service, Ishwar Chandra recommended a number of changes to the existing education system. This report resulted in a serious altercation between Ishwar Chandra and College Secretary Rasomoy Dutta. In 1849, against the advice of Rasomoy Dutta, he resigned from Sanskrit College and rejoined Fort William College as a head clerk.\nWidow Remarriage Act\nVidyasagar championed the upliftment of the status of women in India, particularly in his native Bengal. Unlike some other reformers who sought to set up alternative societies or systems, he sought to transform society from within. Vidyasagar also fought against child marriage and the practice of men marrying many girls (polygamy)\nUnable to tolerate the ill-treatment, many of these girls would run away and turn to prostitution to support themselves. Ironically, the economic prosperity and lavish lifestyles of the city made it possible for many of them to have successful careers once they stepped out of the sanction of society and into the demi-monde. In 1853 it was estimated that Calcutta had a population of 12,700 prostitutes and public women. Many widows had to shave their heads and don white saris, supposedly to discourage attention from men. They led a deplorable life,Vidyasagar thought it  was unfair and sought out the  changes.\nOpposing Spread of Education beyond Higher Classes\nThe Wood's despatch of 1854—considered the Magna Carta of Indian education—adopted a new policy towards 'mass education'. Hitherto the official focus was on the upper classes of the population for education. Dubbed the 'Downward Filtration Theory', this implied that education always filters down from the upper classes of the society to the common masses.\nIn 1859, the government's education policy reiterated \"the spread of vernacular elementary instruction among the lower orders\". Upon this, Vidyasagar addressed a letter, dated 29 September 1859, to John Peter Grant, the Lieutenant Governor of Bengal, underlining his perception:An impression appears to have gained ground, both here and in England, that enough has been done for the education of the higher classes and that attention should now be directed towards the education of the masses... An inquiry into the matter will, however, show a very different state of things. As the best, if not the only practicable means of promoting education in Bengal, the Government should, in my humble opinion, confine itself to the education of the higher classes on a comprehensive scale.The words \"higher classes\" in Bengali parlance do not entail anything but caste which bestows or withdraws the privilege of education on a person by birth. Thus, Vidyasagar explicitly advocated for confining education to \"higher classes\".\nEarlier in 1854, Vidyasagar had scoffed at the admission of a wealthy man from the goldsmith caste of Bengal in the Sanskrit College, Calcutta. His argument was that \"in the scale of castes, the  goldsmith class (Subarnabanik) stands very low\". Notably, Sanjib Chattopadhyay, a biographer of Vidyasagar, revealed that Ishwar Chandra started his primary education in a school established and maintained by Shibcharan Mallick, a rich man of goldsmith caste in Calcutta.\nVidyasagar in Santhal Pargana\nIshwar Chandra Vidyasagar's long association with Karmatar, a sleepy hamlet about 20&nbsp;km from the district headquarters of Jamtara, seems to have been forgotten by the people of the state.\nVidyasagar came to Karmatar in 1873 and spent more than 18 years of his life here. He had set up a girls' school and a night school for adults on the premises of his house, which he called Nandan Kanan. He also opened a free homeopathy clinic to provide some medical care to these unprivileged tribal people.\nAfter his death the Nandan Kanan, the abode of Vidyasagar was sold by his son to Mallick family of Kolkata. Before Nandan Kanan could be dismantled Bengali Association Bihar on 29 March 1974 purchased it by money collected by house to house contribution of one rupee each. The Girls School has been restarted, named after Vidyasagar. The Free Homeopathic Clinic is serving local population. The house of Vidyasagar has been maintained in the original shape. The most prized property is the 141 year old 'Palanquin' used by Vidyasagar himself.\nThe Government of Jharkhand on 26 September 2019 named Jamtara district's Karmatand block as Ishwar Chandra Vidyasagar Block as a mark of respect on the birth anniversary of the great social reformer.\nAn official release quote of Jharkhand's former Chief Minister Raghubar Das:''\"Jamtara's Karmatand prakhand (block) was the 'karma bhumi' (workplace) of social reformer and strong supporter of women's education Ishwar Chandra Vidyasagar. Now the block will be known as Ishwar Chandra Vidyasagar prakhand\"''\nHe was also the secretary of Hindu Female School which later came to be known as Bethune Female School.\nMeeting with Ramakrishna\nVidyasagar was liberal in his outlook even though he was born in an orthodox Hindu Brahmin family. Also, he was highly educated and influenced by Oriental thoughts and ideas. Ramakrishna in contrast, did not have a formal education. Yet they had a nice relation between them. When Ramakrishna met Vidyasagar, he praised Vidyasagar as the sea of wisdom. Vidyasagar joked that Ramkrishna should have collected some amount of salty water of that sea. But, Ramakrishna, with profound humbleness & respect, replied that the water of general sea might be salty, but not the water of the sea of wisdom.\nAccolades\nShortly after Vidyasagar's death, Rabindranath Tagore reverently wrote about him: \"One wonders how God, in the process of producing forty million Bengalis, produced a man!\"\nAfter death, he is remembered in many ways, some of them include:\n# In 2004, Vidyasagar was ranked number 9 in BBC's poll of the Greatest Bengali of all time.———\n# Rectitude and courage were the hallmarks of Vidyasagar's character, and he was certainly ahead of his time.  In recognition of his scholarship and cultural work the government designated Vidyasagar a Companion of the Indian Empire (CIE) in 1877 In the final years of life, he chose to spend his days among the \"Santhals\", an old tribe in India.\n# Indian Post issued stamps featuring Vidyasagar in 1970 and 1998.\n;List of places named after Ishwar Chandra Vidyasagar\nand Kolkata, is named after him.]]\nin Kolkata, named after him.]]\n* Vidyasagar College\n* Vidyasagar Evening College\n* Vidyasagar College for Women\n* Vidyasagar Institute of Health\n* Vidyasagar Mahavidyalaya\n* Vidyasagar School of Social Work\n* Vidyasagar Setu\n* Vidyasagar Shishu Niketan\n* Vidyasagar Teachers' Training College, Kalna\n* Vidyasagar Teachers' Training College, Midnapore\n* Vidyasagar University\n* Vidyasagar Vidyapith\n* Vidyasagar Vidyapith Girls' High School\n* Vidyasagar Railway Station, Karmatanr, Jamtara\n* Ishwar Chandra Vidyasagar Polytechnic\nIn popular culture\nIndian film director Kali Prasad Ghosh made Vidyasagar (1950 film), a Bengali-language biographical film about Ishwar Chandra's life in 1950 which starred Pahadi Sanyal in the titular role.\nReferences\nFurther reading\n* Indramitra, Karunasagar Vidyasagar, Ananda Publishers, Kolkata\n*\n*\n* ed. Dwijendra Bhowmik, \"Janmadwishatabarshe Vidyasagar\", Ananda Publishers,\nExternal links\n*\n* [https://www.britannica.com/biography/Isvar-Chandra-Vidyasagar Isvar Chandra Vidyasagar] at the Encyclopædia Britannica\n*"
    }
  ]
}