{
  "content": [
    {
      "type": "text",
      "text": "# Island Plantation, Queensland\n\n| pop                 = 155\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4650\n| area                = 7.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 6.2\n| dir1                = NW\n| location1           = Maryborough\n| dist2               = 29.1\n| dir2                = SSW\n| location2           = Hervey Bay\n| dist3               = 270\n| dir3                = N\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Fraser Coast Region\n| stategov            = Maryborough\n| fedgov              = Wide Bay\n| elevation           = 10\n| elevation_footnotes =\n| near-n              = St Helens\n| near-ne             = Walkers Point\n| near-e              = Walkers Point\n| near-se             = Walkers Point\n| near-s              = Maryborough\n| near-sw             = Maryborough\n| near-w              = St Helens\n| near-nw             = St Helens\n}}\nIsland Plantation is a rural locality in the Fraser Coast Region, Queensland, Australia. In the , Island Plantation had a population of 155 people.\nGeography\nThe Mary River forms the eastern boundary of the locality.\nThe land is flat and low-lying.\nThe land use is predominantly growing sugarcane with some grazing on native vegetation.\nHistory\nA Baptist Church opened at \"The Island\" on the weekend of 8-9 September 1906. The church was .\nFollowing the closure of the school in neighbouring St Helens in December 1941, in May 1942 the Island Farmer's Association offered their hall to establish a school in Island Plantation for the duration of the war. Gladys Rose Walter was transferred to the school in June 1942 as its teacher. Island Plantation Provisional School opened in 1942 and closed in 1944.\nDemographics\nIn the , Island Plantation had a population of 146 people.\nIn the , Island Plantation had a population of 155 people.\nEducation\nThere are no schools in Island Plantation. The nearest government primary school is St Helens State School in neighbouring St Helens to the west. The nearest government secondary schools are Maryborough State High School and Aldridge State High School, both in Maryborough to south and south-west.\nReferences"
    }
  ]
}