{
  "content": [
    {
      "type": "text",
      "text": "# Islamic monuments in Kosovo\n\nin Prizren]]\nIslamic monuments in Kosovo are commonly related with the Ottoman arrival in 1389, and respectively with their effective establishment in Kosovo in 1459. However, many historical evidences show that the first encounters of Islam with the Balkans happened well before the arrival of the Ottomans and their establishment in the Balkans. Because of its proximity to the centers of Islam, i.e., Middle East, the Byzantine Empire and parts of the Balkans, including the Albanian territories and Kosovo as well, were exposed to Islam as early as in the 8th century.\nMoreover, the geographical position of the Balkans enabled its people to be exposed to different missionary activities, as well as trade and military encounters. Thus, the first contacts of the Albanian territories with Islam date back to the pre-Ottoman medieval period. Nevertheless, the process of Albanian transfer to Islam began and was completed during the Ottoman Era, and thus main Islamic monuments in the country appeared during the Ottoman and after Ottoman period.\nHistory\nThe Balkans were part of the Roman Empire, part of the Bulgarian empire, and the Byzantine Empire until the late Middle Ages, when the Ottoman Turks overruled and gradually took control of almost the entire peninsula. Islam was introduced to Europe mainly through the two major peninsulas, Iberia and the Balkans. With influences from Muslim Spain (Andalusia) from the west, the Mediterranean coast and Sicily from the south, and Muslim Pechenegs of Hungary from the north-east, Islam penetrated easily even to the most inner parts of the Balkans.\nFurthermore, the well known Muslim geographer, historian, and cartographer Muhammad al-Idrisi during the 12th century (1154) provided valuable information on a journey inland from the Albanian port of Durrës towards Constantinople through Thessaloniki, offering some interesting references to the lakes on the Kosovo-Macedonia border as important crossing points, with Ohrid as the most important.\nThese connections though predominantly for trade and commerce also had left other impact on life in the Balkans. Because of Muslim fairness in their dealings and their advanced system and ideas, many individuals chose Islam to be their faith. At the same time, many Muslim merchants found good accommodations in the coastal cities, fertile valleys, crossroad towns or fortifications, and so settled there. Thus, the first small Muslim settlements emerged, which grew and influenced how people dressed, measured time, cooked food.\nAccording to Thomas Walker Arnold, the first introduction of Islam in South-Eastern Europe was the work of a Muslim jurist-consul, who was taken as a prisoner, probably in one of the wars between the Byzantine Empire and its Muslim neighbors, and was taken to the country of the Pechengs at the beginning of the 11th century. The prisoner explained to them the main tenets of Islam, and, therefore many of them embraced Islam. Thus, well before the end of the 11th century, Islam began to spread among them, and almost all Pechengs became Muslim.\nThe migrations of people within the Balkan countries as well as outside arrivals played an important role in the spread of Islam. Some of these migrations had religious and missionary purposes. For instance, the traveling of Sarı Saltık, an ecstatic Sufi devotee mentioned even by the great Ibn Battuta in 1332–1334, was well known among the Balkan people. Specific towns and specific topographical localities are associated with his story. He, furthermore, has various tombs in different countries in the Balkan Peninsula. Thus, as early as the 13th and especially during the 14th century, many mystic and nomad imams groups appeared in the Christian countries, where they propagated their faith and helped people to get more knowledge about Islam.\nIntroduction of Islam\nThe most important migration for the region was that of the Al-Aga family, from Aleppo, Syria. Some members of this family migrated to Kosovo beginning from 1095 while the others came at the end of 1291 and settled in a local village. They had built a mosque there, which exists to the present day, and it is going to further be explored in this article later on.\nFrom the above description, based on mentioned facts, it can be concluded that the first encounters of the Balkan people, including Kosovo, with Islam were much earlier than the arrival of the Ottomans. These first contacts may have taken place as early as the beginning of the 8th century in the Balkans in general, and they became more frequent in the 9th and 10th centuries among the Slavs and Albanians. Afterwards, they increased greatly during the 11th, 12th and 13th centuries.\nIn other words, Kosovos' encounters with other parts of the world, particularly the Muslim world, were not mainly due to and through Ottoman occupation and siege, but there were natural human migrations and cultural fusions intertwined as a result of trade, marriages and other human relations gradually occurring. Islam was not totally enforced in law, as is often claimed, but through more so a long historical process which played out in associated with many benefits, especially for those who sought great careers within the Ottoman Empire.\nDespite claims that might rise about radicalism or radicals movements in Kosovo, however, the presence of many international, mainly European, organizations hold that Kosovo Muslims do not define their national identity through religion, but through language and have a relatively relaxed approach towards the observance of the forms of Islam. And the following available information show that Islamic monuments were present in Kosovo well before the Ottomans.\nMonuments in Kosovo before the Ottoman era\nAs earlier mentioned, Islam was introduced to Kosovo quite long before the Ottomans. However, there is yet research to be done regarding Islamic monuments before the Ottomans in Kosovo.\nNevertheless, Kosovo, as many other countries in the Balkans, were primarily Christian during the pre-Ottoman period. Thus, claims may be raised about Kosovo as the cradle of Christianity, namely orthodox civilization, because of few monuments of the 14th century and few others of the 15th century being found in the country.\nMoreover, Kosovo is often depicted as a flourishing center of Eastern orthodoxy during the late medieval period, yet with the arrival of the Ottomans this flourishing became calamity because the Ottomans either inadvertently destroyed those monuments or turned them into Islamic/Ottoman ones. However, looking into Kosovo today one cannot deny the presence of Christian shrines and monuments, both catholic and orthodox aside, however, recent data show that Kosovo before the Ottomans was not the home of Christians alone but it was also a home of Bogomils, Muslims, Jews etc.\nIn this regard, these data show that migration as a natural process occurred in different periods of history because different people moved here and there seeking better opportunities or better places to live. As in many parts in the world such migrations happened to Kosovo, too. In 1095 a Muslim family from Aleppo city, present day Syria, migrated to Kosovo and settled there. This seems to be a big family and they migrated in different periods from 1095 until 1291, they settled in the southern part of Kosovo in the present-day Dragash municipality.\nSince keeping the prayers (salat) is one of the tenets of Islam, Muslims need to have mosques in order to keep the weekly (Juma) prayer. Obviously, this family after settling in the country and getting together the other members of the family, they seemed to be liking the country and made long terms plan of staying there. As a result, in 1289, they built a small mosque for their household needs and the mosque, most probably, is named after the householder's name Ahmed Al-Aga. This is the first mosque in Kosovo at least 100 years before the Ottoman arrival in Kosovo and the well-known battle of Kosovo in 1389.\nMonuments of the Ottoman era\nOnce conquering the Balkans the Ottomans established their administration and began to shape the conquered territories according to their culture and traditions. Mosques, hamams (public baths) and madrasas (schools) were among the most important sites the Ottoman built.\nin Prishtina, Kosovo]]\nThe first construction of an Ottoman mosque in Kosovo dates back to 1393 and that is the Çarshi Mosque in Pristina. It is believed to having been built by Ottoman Sultan Bajazit to commemorate his late father Sultan Murat I, and the 1389 victory. It lies in, what was known as, the Pristina market and today it symbolizes the old part of the city. Its main characteristic is the minaret made of stone, which is the only one survived since 600 years. Xhamia e Çarshisë is known also as the \"Stone Mosque\", from Turkish word Taş which means stone.\nOther well known Ottoman mosques, just to name few, are: Gazi Ali Beg Mosque built (1410) in Vushtrri, The Mosque in Krajkovo (1480) in Drenas, The Hadum Mosque (1595) in Gjakova, The Mosque in Polac (1635) in Skenderaj and many others.\nMonuments during the Yugoslavian era\nHaving into account that the political mainstream of former Yugoslavia was Marxist-Leninist ideology, religion was seen as merely a social phenomenon that should be separated from state matters. The greatest blow inflicted by the government on religion were the agrarian reforms. Under these reforms, the government, according to existing laws, seized the lands and properties belonging to the religious communities. These reforms hit the Islamic community worst, as all the waqf (endowment) land and property were taken over by the state.\nThe state confiscated also all types of property such as rest-houses, khans (hostels), shops, and mills, which were the main sources of income for the religious institutions. Mosques and Churches, mainly Catholic and sometimes Orthodox, were used as ammunition depots or military hostels. Many mosques were destroyed under the pretext of development, urbanisation, or the building of highways. Today's national theater stands in the place where one mosque was some 60 years ago.\nThe religious communities opposed such reforms, and criticized the government for the confiscation of their property, but the government never listened, maintaining that these acquisitions were necessary in the light of an economic crisis.\nIn fact, after some time the Yugoslav government gave back churches and monasteries acquired from the Orthodox people, because they did not need them anymore, it never returned the mosques, which were demolished. So, in the name of protecting historical, religious and cultural monuments, Yugoslavia protected and invested in the Orthodox monuments only, meanwhile did nothing to protect the Islamic or Catholic monuments. Although Muslims were the largest community, out of 137 historical monuments under the state 'protection', only 26 were Islamic, 2 Catholic, while 110 were Orthodox Christian.\nFrom the above stated it is obvious that there have always been tendencies to make the Muslims in former Yugoslavia seem as anachronistic and to make them join instead the faith of the larger nations of Serbia or Croatia.\nIn the war of 1998–1999, almost half of Kosovo's 218 mosques were burned down or otherwise destroyed. Most of these Mosques dated from the 15th and 16th centuries, and many works of Islamic architecture were razed to the grounds as a result of the systematic policy of culture and urban genocide by the Yugoslav state in Kosovo's culture.\nMonuments today\nThe Islamic community of Kosovo has managed to repair some of the badly damaged mosques, and even to build some new ones in the aftermath, using mainly community funds, voluntary donations by individuals, NGOs and governmental organizations such as the UAE contingent in the KFOR operation.\nThe Mosque of Kastriot city is, as seen in the picture, among the new mosques built after the war. The contributions usually come from businessmen and wealthy people. Sometimes Kosovan Muslims, living in the west, do fundraising among their compatriots and bring the money back to their home country. This is especially related to helping the poor receive donations and rebuild the mosques. The Islamic Community of Kosovo usually organizes and manages these fundraising projects, and recently ICK has announced a project about rebuilding the Great Mosque in Pristina after getting the permission by relevant authorities.\nSome six Islamic monuments in Kosovo, among them Red Mosque in Peja, Hadum Mosque in Gjakova, Deçan Mosque, and Hammam of Ali Bey in Vushtrri,  were selected to be restored by the UNESCO as well. UNESCO also sent two missions, in March 2003 and April 2004, to assess damage to Kosovo's cultural heritage in Kosovo. The findings of these missions resulted with a list of 48 Christian sites, 14 Islamic sites and 13 secular and historic buildings to present to the donors.\nMosques\nMosques are the houses of worship for Muslims. There are roughly about 500 mosques in Kosovo and they are spread all over the country. Most of them can be found in Prizren due to large Ottoman influence in the city and the presence of a small Turkish community there.\n(Ahmed) Al–Aga Mosque (1268)\nAl–Aga Mosque, the oldest mosque in Kosovo was built in 1289. However, the mosque is today a ruin.\nAccording to Islamic community council in Dragash in 1995 they received formal document by the Mufti office of Aleppo city, in Arab Republic of Syria, where it is clearly stated that a family named Al-Aga have been migrated from Aleppo to former Yugoslav territories, particularly in the area known as Mlika. This family, according to this document, began migrating in 1095 and continued until 1291.\nThis mosque lies in the southern part of Kosovo and has been reconstructed several times during its history, thanks to volunteer donations of the community and people of the good will. It is still active and quite a good congregation frequents the mosque especially during Friday (Juma) prayers.\nGazi Ali Beg Mosque (1410)\nGazi Ali Beg Mosque was under state protection being considered as one of the oldest mosques of the Ottoman era in municipality of Vushtrri, Kosovo. The Islamic community in this city has ten mosques, the Gazi Ali Beg the oldest, eight of these mosques were burned down or destroyed.\nThe main three mosques in the city were destroyed as well. Despite being under state protection Gazi Ali Beg Mosque was badly damaged, its minaret was mined and blown up while the roof and the windows were damaged as well due to frequent shelling during the war of 1998–99.\nAfter the war the Mosque was reconstructed.\nThe Mosque in Krajkovë (1480)\nThe Mosque of Krajkovë lies in the central part of the country, respectively municipality of Drenas. This region is among the most affected during the war, three of the seven mosques in this area were burned down, including the Mosque of Krajkovë, two were shelled and demolished and one was completely destroyed.\nBeing built in 1480 the Mosque of Krajkovë is regarded as the oldest in the Drenica region. People, elderly in particular, speak with special nostalgia while explaining the great history of this Mosque and the contribution of the imams offered to this area in different periods of history. After the war this Mosque was newly rebuilt by a donation of foreign (Kuwaiti) NGO operating in Kosovo for a short time.\nThe Hadum Aga's Mosque (1595)\nGjakova is among the largest Islamic community councils. Among 40 religious objects the Hadum Mosque is regarded as the oldest in the city. Gjakova during the Ottoman time was considered as a village which has a local market for the needs of the community at that time. This was the fate not only for Gjakova but for many other Kosovo cities until the late 15th and early 16th centuries.\nBy the end of the 16th century, in 1594–95, Hadum Suleiman Efendi - Hadum Aga, built this mosque which was named after him. According to the popular narrations this mosques was built in the land of Jak Vula, and thus the city was later renamed Yakova.\nThis mosque was demolished as well, however, as it was under state protection the international community has taken it into consideration and it was restored via international funds.\nThe Mosque in Polac (1635)\nIt is little known about who built the Mosque in Polac, which is one of the oldest in the Skenderaj municipality and among the oldest in Drenica region.\nHowever, since the region was vastly involved in the last war out of 9 mosques in Skenderaj 8 were demolished. The Mosque of Polac, however, survived although it was shelled and badly damaged. Its minaret was destroyed and the Imam, Jetullah Xani, was ill-treated while being imprisoned by the Yugoslav forces. Today the Mosque has been restored by volunteer work of the villagers and it is functional.\nTekkes (Teqe)\nTekkes (or Teqe in Albanian) are houses of worship belonging to Muslim Sufi orders. There are few tekkes in Kosovo belong to different orders such as Qadariya, Ruafi'a, Halveti etc. Prizren, Gjakovë and Rahovec are known to have more Sufis and Sufi tekkes.\nThe Great Tekke (16th Century)\nThe oldest and well known Tekke in Kosovo is the 16th century Great Tekke in Gjakovë. The Great Tekke or \"Teqëja e Madhe\" played a huge role in all the matters that concerned Kosovo and people living there during different eras.\nOne of the members of this great family is Musa Shehzade, a well known patriot who was a delegate from Prizren in the declaration of independence of Albania. Also, his activities include serving as commander of forces which took the city of Skopje, Chairman of the second league of Prizren and he was the first Albanian mayor of Prizren.\nCemeteries\nMost of the cemeteries in Kosovo are located alongside the mosques, especially in rural areas. In urban areas such as Pristina cemeteries are outside the city. Muslim cemeteries are separated from other religious communities, and there is a continual need for more cemetery space for the Muslim community. Cemeteries are under control of the municipalities and in municipal property or property given to Islamic community for such purpose.\nSee also\n*Islam in Kosovo\n*List of mosques in Kosovo\nReferences\nExternal links\n* http://www.bislame.net\n* http://www.islamgjakova.net\n* [https://web.archive.org/web/20140302120651/http://www.oxfordislamicstudies.com/article/opr/t125/e1319 Islam in Kosovo]"
    }
  ]
}