{
  "content": [
    {
      "type": "text",
      "text": "# Islamic neo-traditionalism\n\nIslamic neo-traditionalism  is a contemporary strand of Sunni Islam that emphasizes adherence to the four principal Sunni schools of law (Madhahib), belief in one of the Ash'ari, Maturidi and Athari creeds (Aqaid) and the practice of Sufism (Tasawwuf), which Islamic neo-traditionalists consider to be the Sunni tradition.\nTerminology\nFauzi Abdul Hamid of the Middle East Institute wrote that \"contrary in a way to the stereotypical picture of traditionalists, who cling to the closing of the gates of Ijtihad (opining), neo-traditionalists do not deny the need for and wisdom of dispensing with Taqlid (following a school of law) when conditions beckon and are ripe for it. Neo-traditionalists accept the shortcomings of traditionalism that have led to passivity and stagnation, and admit that latter-day Sufis suffer from a perception deficit among the larger Muslim populace as not being down-to-earth enough to problematise the inner malaise of the Ummah.\"\nBeliefs\nIslamic neo-traditionalists believe Islam fundamentally consists of three concepts: Fiqh, Aqidah and Tasawwuf. Fiqh is regarded as being delineated by the Shafiʽi, Hanafi, Maliki and Hanbali schools of law and Aqidah by the Ash'ari, Maturidi, and Athari creeds. The neo-traditionalist understanding of the religion is therefore thought to lie with the scholars of these fields who possess an unbroken scholarly lineage or chain of transmission (Isnad) to their classical authorities, which ultimately end with Muhammad. A scholar's authoritativeness is based on whether or not he has been issued an Ijazah by his teachers, which lists their scholarly chain and grants him a license to teach on its authority.\nNeo-traditionalists argue against the position that following a school of law (Taqlid) is unnecessary, claiming that it implies previous generations of Sunni Muslims were mistaken in their understanding of Islam, that it is impossible to derive correct rulings without relying on a school's legal principles, and that it will lead to laypeople making Ijtihad, thereby irreversibly disrupting Sunni legal unity and introducing new practices to the religion. Islamic neo-traditionalists are open to the revival of Ijtihad to combat new challenges in the contemporary world Muslims now live in. Neo-traditionalism overlaps with modernism in its core emphasis and promotion of modernist view points, Fiqh al-Aqalliyat (minority jurisprudence), and, to a certain degree, non-denominationalism.\nHistory\nIslamic neo-traditionalism emerged in the West during the 1990s following the return of several Muslim scholars who had studied at traditionalist centres of Islamic learning in the Arab world, including Hamza Yusuf, Abdal Hakim Murad and Umar Faruq Abdullah, who intended to disseminate the knowledge they had learned throughout their communities. Younger scholars who are linked to neo-traditionalism include [https://renovatio.zaytuna.edu/authors/hasan-spiker/ Hasan Spiker] and [https://seekersguidance.org/teachers/yahya-rhodus/ Yahya Rhodus]. Critiques of progressivism are made by some members in the movement, which is held responsible for spiritual decay, the decline of Islamic metaphysics and the rise of liberal and progressive Islamic movements. Western neo-traditionalists have established their own religious educational institutes, including Zaytuna College, Cambridge Muslim College and the online Islamic seminary SeekersGuidance.\nPolitics\nFollowing the Arab Spring, some neo-traditionalist scholars adopted a counter-revolutionary politically quietist stance citing the prohibition of resistance against ruling authorities by a number of pre-modern Sunni jurists and concerns that political upheaval would empower Islamic fundamentalist groups such as the Muslim Brotherhood. Their subsequent alliance with the governments of the United Arab Emirates and Egypt, and their silence towards or outright approval of their actions, attracted criticism, particularly the conduct of Ali Gomaa and Hamza Yusuf after the August 2013 Rabaa massacre.  Neo-traditionalist Islamic scholar Ramadan al-Bouti was a supporter of the Assad regime, and criticized anti-government protests and urged demonstrators not to follow \"calls of unknown sources that want to exploit mosques to incite seditions and chaos in Syria.\" However, other neo-traditionalist scholars such as Muhammed al-Yaqoubi advocated for the removal of dictators such as Bashar al-Assad.\nAccording to Mustafa Kabha and Haggai Erlich, the Islamic political organization al-Ahbash adheres to neo-traditionalism in their political-religious methodology, citing their opposition to traditionalist and Salafi thinkers such as Sayyid Qutb, ibn Abdul Wahhab, and Abul A'la Maududi, criticism of extremism and zeal, as well as their ardent focus on good behaviour and Islamic morality, the latter of which is largely absent from the modernist and progressive strands within Islam, and Thomas Pierret also identified the al-Ahbash as adherents of this methodology, although he used the alternate term neo-traditionalist to describe them.\nContemporary neo-traditionalists\n* Abdal Hakim Murad\n* Hamza Yusuf\n* Prince Ghazi bin Muhammad\n* Muhammad Said Ramadan al-Bouti\n* Ali Gomaa\n* Umar bin Hafiz\n* Umar Faruq Abd-Allah\n* Abdallah bin Bayyah\n* Ali al-Jifri\n* Nuh Ha Mim Keller\n* Faraz Rabbani\n* Abdullah al-Harari\n* Shadee Elmasry\nSee also\n* Traditionalism (Islam in Indonesia)\n* Political quietism in Islam\n* American Islam (term)\n*\n*\nReferences"
    }
  ]
}