{
  "content": [
    {
      "type": "text",
      "text": "# Islamic Republic of Iran Navy\n\n2,500 years ago\n* (first modern-day naval forces)\n* (as Imperial Iranian Navy)}}\n| dates                         =\n| country                       = Iran\n| branch                        = Navy\n| type                          =\n| role                          = Naval warfare\n| size                          = 20,000 (2024 estimate)\n| command_structure             = Army (Artesh)\n| garrison                      = Bandar Abbas\n| garrison_label                =\n| nickname                      = , Dəryâdēlân\"Seahearts\"\n| patron                        =\n| motto                         = , Râh-ē mâ, râh-ē hoseyn əst\"''Our Path, Is Hussain's Path''\"\n| colors                        =\n| colors_label                  =\n| equipment                     =\n| equipment_label               = Fleet\n| battles                       =\n| anniversaries                 = 28 November\n| commander1                    = Commodore Shahram Irani\n| commander1_label              = Commander\n| notable_commanders            =\n| identification_symbol         =\n| identification_symbol_label   = Ensign\n| identification_symbol_2       =\n| identification_symbol_2_label = Flag\n| identification_symbol_3       =\n| identification_symbol_3_label = Jack\n| identification_symbol_4       =\n| identification_symbol_4_label = Roundel\n| native_name                   =\n}}\nThe Islamic Republic of Iran Navy (IRIN; ), also referred as the Iranian Navy (abbreviated NEDAJA; ), is the naval warfare service branch of Iran's regular military, the Islamic Republic of Iran Army (Artesh). It is one of Iran's two maritime military branches, alongside the Navy of the Islamic Revolutionary Guard Corps (IRGC).\nNEDAJA is charged with forming Iran's first line of defense in the Gulf of Oman, Persian Gulf and abroad. It is generally considered to be a conventional green-water navy, as it mostly operates regionally, namely in the Red Sea, Mediterranean Sea, and northwest quarter of the Indian Ocean. The Navy aims to develop blue-water capabilities: in July 2016, it announced plans to establish a presence in the Atlantic Ocean, and as of May 2021 had sent ships into the region.\nNEDAJA shares many functions and responsibilities with the IRGC Navy, with distinctions in military strategy and equipment: In contrast to the IRGC Navy, which is equipped with small fast-attack craft, the backbone of the Artesh naval inventory consists of larger surface ships, including frigates and corvettes, and submarines.\nThe Artesh Navy has a large fleet by the standards of the developing world, and was described in 2012 as maintaining \"robust\" capabilities by regional standards. As of 2019, the Navy had several joint exercises with Russia and China called the Marine Security Belt, which it aims to conduct annually.\nHistory and overview\nAn Iranian navy in one form or another has existed since Achaemenid times and the First Persian Empire around 500 BC. The Islamic Republic of Iran Navy came into being when the former Imperial Iranian Navy (IIN) of the Pahlavi Era was renamed following the Iranian Revolution in 1979.\n1939–1979\nThe Iranian navy was rebuilt after being almost completely destroyed during the Anglo-Soviet invasion of Iran in World War II. Following World War II, the fleet began replacing destroyed warships with destroyers, frigates and many smaller vessels, including powerboats and hovercraft, many of which originated from the US and UK, which had played a part in destroying much of the original equipment in World War II.\nMohammad Reza Pahlavi, the last Shah of Iran, ordered four modern general purpose destroyers from the United States and eight modified s from Royal Schelde, but both contracts were canceled after the 1979 Iranian revolution. The destroyers were instead commissioned in the U.S. Navy as the , while construction of the frigates had not yet started.\nFollowing this was the US-led arms embargo on Iran and the Iran–Iraq War, in which the IRIN played a role. The arms embargo restricted Iran's ability to maintain and equip its navy. It had to find new sources of armaments. Equipment and weaponry were imported from the Soviet Union, China, North Korea and later, Russia. Iran also established its own domestic armaments industry. This industry has also supported the navy by providing weaponry, equipment and spare parts.\n2000–present\nIn terms of major surface ships, Iran relies on its Alvand-class frigates, as well as the new Moudge-class frigates, which were indigenously developed in Iran and are reverse-engineered Alvand class with modern electronics, radar and armament. The navy does not include capital ships; its largest ships are four frigates and three corvettes. These ships are supported by three Russian-built SSK  attack submarines and  and  mini submarines.\nIn July 2016, the Navy said that it would establish a presence in the Atlantic Ocean, of unspecified duration.\nIn December 2019, the Iranian Navy's head Rear Admiral Hossein Khanzadi acknowledged in a televised interview that the Navy was now dependent on annual joint exercises with Russia and China, and that efforts by other countries to form alliances against Iran in the Persian Gulf were \"pointless.\"\nFor the first time in its history, the Navy captured two U.S. Navy sea drones in the Red Sea on 6 September 2022.\nIt was reported on 27 February 2023 that Brazil gave permission for IRIS Makran and IRIS Dena to dock at Rio de Janeiro.\nOn 29 April 2023, the Iran Navy seized a Marshall Islands flagged Suezmax tanker, the Advantage Sweet, laden with oil from Kuwait and bound for Houston, off Muscat. The US Navy said it was \"at least the fifth commercial vessel [seized] by Tehran in the last two years\". It appeared that the vessel managers were Turkish and the owner was Chinese.\nThis seizure was in response to the U.S. seizing the Iran-origin cargo on the suezmax Suez Rajan off southeast Malaysia earlier in the month.\nEquipment\nand IRIS Fateh during the Official welcome ceremony of the 86th naval group]]\nhovercraft with pennant number 106]]\nCurrent ships\nAccording to 'The Military Balance 2020' of the International Institute of Strategic Studies (IISS), the inventory includes:\n{| class=\"wikitable\" style=\"text-align: center\"\n! style=\"text-align:center; background:#acc;\"|Type\n! style=\"text-align: center; background:#acc;\"|In service\n! style=\"text-align:l center; background:#acc;\"|Class\n|-\n! style=\"align: center; background: lavender;\" colspan=\"7\"| Sub-surface warfare units (20)\n|-\n| Attack submarine\n| 3\n| Kilo-class\n|-\n| Coastal submarine\n| 1\n| Fateh-class\n|-\n| Midget submarine\n| 15\n----1\n| Ghadir-class\n----Nahang-class\n|-\n! style=\"align: center; background: lavender;\" colspan=\"7\"| Surface warfare units (73)\n|-\n| Corvette (+AShM/SAM)\n| 2\n| Bayandor-class\n|-\n| Corvette\n| 1\n----4\n| Hamzeh-class\n---- Shahid Soleimani-class\n|-\n| Frigate (+AShM)\n| 3\n----4\n|Alvand-class\n----Moudje-class\n|-\n| Reconnaissance vessel\n| 1\n| Moudje-class\n|\n|\n----Moudge-class\n|-\n| Patrol Craft Fast I (+AShM/SAM)\n| 13\n----6\n| Kaman-class\n---- Sina-class\n|-\n| Patrol Boat (+AShM)\n| 3\n----3\n----3\n| Hendijan-class\n----Kaivan-class\n----Parvin-class\n|-\n| Patrol Boat Fast (+Torpedo)\n| 3\n| Kajami-class\n|-\n| Patrol Boat Fast\n| 1\n| MIL55-class\n|-\n| Patrol Boat\n| 9\n----9\n----10\n----6\n| C14-class\n----Hendijan-class\n----MkI-class\n----MkII-class\n|}\n{| class=\"wikitable\" style=\"text-align: center\"\n! style=\"text-align:center; background:#acc;\"|Type\n! style=\"text-align: center; background:#acc;\"|In service\n! style=\"text-align:l center; background:#acc;\"|Class\n|-\n! style=\"align: center; background: lavender;\" colspan=\"7\"| Amphibious warfare units (31)\n|-\n| Landing Ship Medium\n| 3\n| Farsi-class\n|-\n| Landing Ship Tank\n| 3\n| Hengam-class\n|-\n| Landing Ship Logistics\n| 6\n| Fouque-class\n|-\n| Landing Craft Tank\n| 2\n|\n|-\n| Landing Craft Air Cushion\n| 2\n----4\n----3\n| Wellington Mk 4\n----Wellington Mk 5\n----Tondar\n|-\n| Landing Craft Utility\n| 4\n| LIAN 110\n|-\n! style=\"align: center; background: lavender;\" colspan=\"7\"| Logistics units (18)\n|-\n| Ammunition carrier\n| 2\n| Delvar-class\n|-\n| Auxiliary floating drydock\n| 2\n| Dolphin-class\n|-\n| Cargo ship\n| 3\n| Delvar-class\n|-\n| Fleet Replenishment Oiler\n| 2\n----1\n| Bandar Abbas-class\n|-\n| Water tanker\n| 4\n----1\n| Kangan-class\n----Delvar-class\n|-\n| Training craft\n| 2\n| Kiala\n|}\nCurrent aircraft\nBased on reports published by Flightglobal Insight and the IISS, as of 2020, Iranian naval aircraft inventory includes:\n{| class=\"wikitable\"\n! style=\"text-align:center; background:#acc;\"|Aircraft\n! style=\"text-align: center; background:#acc;\"|Origin\n! style=\"text-align:l center; background:#acc;\"|Type\n! style=\"text-align:left; background:#acc;\"|Variant\n! style=\"text-align:center; background:#acc;\"|In service\n! style=\"text-align: center; background:#acc;\"|Notes\n|-\n! style=\"align: center; background: lavender;\" colspan=\"7\"| Fixed-wing aircraft\n|-\n| Dornier 228\n| Germany\n| transport\n|\n| Unknown\n| in total 5 in the inventory\n|-\n| Dassault Falcon 20\n| France\n| transport\n|\n| 1\n| in total 3 in the inventory\n|-\n| Fokker F27\n| Netherlands\n| transport\n|\n| 3\n| in total 4 in the inventory\n|-\n| Turbo Commander 680\n| United States\n| transport\n|\n| Unknown\n| in total 4 in the inventory\n|-\n! style=\"align: center; background: lavender;\" colspan=\"7\"| Helicopters\n|-\n| Bell 212\n| United States\n| transport\n| AB-212\n| 8\n| in total 10 in the inventory\n|-\n| Bell 205\n| United States\n| transport\n| AB-205A\n| Unknown\n| in total 5 in the inventory\n|-\n| Bell 206\n| United States\n| transport\n| AB-206\n| Unknown\n| in total 2 in the inventory\n|-\n| Mil Mi-17\n| Russia\n| transport\n|\n| 5\n|\n|-\n| Sikorsky SH-3\n| United States\n| anti-submarine\n| S-61/ASH-3D\n| 8\n| in total 10 in the inventory\n|-\n| Sikorsky CH-53\n| United States\n| mine countermeasures\n| S-65/RH-53D\n| 6\n|\n|}\nFormer ships\nFuture ships\nOrganization\nAviation\nMarines\nCoastal defence\nFacilities\nIn 1977, the bulk of the fleet was shifted from Khorramshahr to the new headquarters at Bandar-e Abbas. Bushehr was the other main base; smaller facilities were located at Khorramshahr, Khark Island, and Bandar-e Imam Khomeini (formerly known as Bandar-e Shahpur). Bandar-e Anzali (formerly known as Bandar-e Pahlavi) was the major training base and home of the small Caspian Sea fleet, which consisted of a few patrol boats and a minesweeper. The naval base at Bandar Beheshti (formerly known as Chah Bahar) on the Gulf of Oman had been under construction since the late 1970s and in late 1987 still was not completed. Smaller facilities were located near the Strait of Hormuz.\n* Abu Musa – small docking facility on the island's west end; located near Abu Musa Airport\n* Al-Farsiyah\n* Bandar Beheshti (Chah Bahar) – port and base facilities in the Gulf of Oman\n* Bandar-e Abbas – naval HQ and home to naval airbase\n* Bandar-e Anzali – once training base and now home to Caspian Sea Fleet (patrol boats, minesweepers)\n* Bandar-e Khomeini – small sheltered base located near the border with Iraq\n* Bandar-e Mahshahr – small base located near Bandar-e Khomeini\n* Bushehr – repair and storage facility in the Persian Gulf; home to Navy Technical Supply Center and R&D center\n* Halul (an oil platform)\n* Jask – small base located across from Oman and UAE in southeastern Iran at the mouth of the Straits of Hormuz\n* Kharg Island – base on the island and located northwest of Bushehr, home to hovercraft fleet\n* Khorramshahr – former naval HQ; now repair and shipbuilding facilities\n* Larak – small base on the island and near Bandar-e Abbas\n* Kharko – small base on the island, located northwest of Bushehr\n* Noshahr – not a base, but home to Iman Khomeini University for Naval Science (naval staff college)\n* Qeshm – small port facility near Kharg and Bandar-e Abbas\n* Shahid Rajaie\n* Sirri – island port facility located in the Persian Gulf and across from UAE\nPersonnel\nCommanders\nRanks\nCommissioned officer ranks\nThe rank insignia of commissioned officers.\n{| style=\"border:1px solid #8888aa; background-color:#f7f8ff; padding:5px; font-size:95%; margin: 0px 12px 12px 0px;\"\n|}\nOther ranks\nThe rank insignia of non-commissioned officers and enlisted personnel.\n{| style=\"border:1px solid #8888aa; background-color:#f7f8ff; padding:5px; font-size:95%; margin: 0px 12px 12px 0px;\"\n|}\nProcurement and deployment of equipment\n1970s–1990s\nof the IRINA.]]\nSuffering from decaying Western-supplied weapons purchased by the Shah, Tehran has been acquiring new weapons from Russia, China and North Korea. Iran has expanded the capabilities of the naval branch of the IRGC, acquired additional mine warfare capability, and upgraded some of its older surface ships. Iran's exercises have included a growing number of joint and combined arms exercises with the land forces and air force. Iran has also improved its ports and strengthened its air defences, while obtaining some logistic and technical support from states like India and Pakistan.\nAs far as major new equipment is concerned, Iran has been building up its naval strength by acquiring three Kilo-class submarines from Russia, as well as other equipment, including 10 Houdong fast attack craft from China. Russia and India were reported to be assisting Iran with training and operating its Kilo-class submarines. As regards other requirements, in December 1997, Rear Admiral Mohammad Karim Tavakoli, commander of the First Naval Zone, with HQ at the Persian Gulf port of Bandar Abbas, claimed that the Iranian Navy had completed design work on three multirole corvettes and a small submarine, to be built in Iran.\n2000–2010\n. Iran is also producing its own submarines as of 2010.]]\nIn August 2000, Iran announced that it had launched its first domestically produced light submarine or swimmer delivery vehicle, named the Al-Sabiha 15 because of its  length, in an official ceremony at the Bandar Abbas naval base. In May 2005, Iran navy announced that it had launched its first Ghadir-class midget submarine and on 8 March 2006 announced that it had launched another submarine named Nahang (Persian: whale).\nDuring 2000, the Islamic Republic of Iran Navy Aviation significantly improved its capability by taking delivery, from Russia, of a number of Mi-8 AMT (Mi-171) transport/attack helicopters. Under a contract signed in 1999, Russia agreed to supply 21 Mi-171s to Iran. Delivery was completed in 2001; although the exact number destined for the navy was unknown. In summer 2001, there were indications that Iran would order a further 20 Mi-171s, although as of mid-2004, it was not known if this had occurred.\nIn November 2002, sources at both Iran's Aerospace Industries Organisation (AIO) and the China Aerospace Science and Industry Corporation (COSIC) confirmed that the two groups were working on common anti-ship missile production and development. The effort, which Iranian sources call Project Noor, covers the short-range C-701 and the long-range C-802 weapons developed by COSIC's China National Precision Machinery Import and Export Co subsidiary. The possibility that a formal collaborative project was under way was first raised in 1998, when Iran displayed an Anti-Ship missile design similar to the  range C-701 shortly after the Chinese system was unveiled.\nAn AIO spokesperson confirmed that Project Noor involves the C-701. However, officials in the same company describe the weapon as \"a long-range, turbojet-powered, sea-skimming Anti-Ship missile,\" which better fits the  range C-802, and suggests that the co-operation agreement may cover both weapon systems. In early 2004, Iran announced the release of a new cruise missile program named Raad (Thunder). The Raad appears to be a modification of the Chinese HY-2 (CSSC-3) anti-ship missile, one of a series of missiles China developed from the original Soviet-era P21 (SS-N-2C) design.\nOn 29 September 2003, Iran's domestically produced Sina-class (reverse engineered from the Kaman-class) missile boat , equipped with modern anti-ship missiles and modern electronics entered service in the Islamic Republic of Iran Navy. The ship was launched in the Caspian Sea to protect Iran's interests there and was mentioned among the achievements of the Iranian Navy by Rear Admiral Habibollah Sayyari.\nOn 22 September 2006, Iran announced to have commissioned their second self-made Sina-class missile boat, . Built in memory of the original Joshan, lost in the Persian Gulf during Operation Praying Mantis on 18 April 1988. According to Iran's Navy commander Admiral Kouchaki, Joshan has a claimed speed of over [3] and \"enjoys the world's latest technology, especially with regard to its military, electrical and electronic systems, frame and chassis, and it has the capabilities required for launching powerful missiles.\"\nIn 2002, Iran announced it would start the production of its first domestically produced destroyer. By most international standards, the ship, the first of the Moudge class, would be considered a light frigate or a corvette. On 24 November 2007, Iran's rear admiral Habibollah Sayyari announced that Iran would launch its first domestically produced destroyer, , though internationally rated as a frigate, and an Iranian Ghadir-class submarine. It is said to be a sonar evading stealth submarine. Initially known as Moje, then Moje I, finally Jamaran, appears to be a development of the Alvand class. The Moudge or Moje-class guided missile frigate entered service in 2010. Another frigate in the same class, named Damavand, has been commissioned in the port of Bandar Anzali in the Caspian Sea in 2013. This ship, just like Jamaran, has the capability to carry helicopters, anti-ship missiles, surface-to-air missiles, torpedoes, modern guns and air defence guns. The ship is also equipped with electronic warfare devices. The two mentioned frigates have brought Iran's frigate arsenal from three to five, while two others are being built, to be added to Iran's fleet of warships in the Persian Gulf.\nIn March 2006, the navy deployed a submarine named Nahang (Whale), with pictures broadcast by state media at the time showing a minisub.\nOn 22 February 2008, the Iranian Defense Ministry announced that 74 domestically produced \"gunboats\" (small missile boats) had entered service with the Iranian Navy. The Navy has had reported to have the Hoot supercavitating torpedo and the Thaqeb (missile) in trials or service, though reliable information is scarce.\n2010–2020\nmissile system, pictured in the Velayat-90 Naval Exercise in 2012]]\nIran's Deputy Navy Commander Captain Mansour Maqsoudlou announced in February 2010 that Iran has begun planning to design and manufacture domestically built aircraft carriers. The initial designs for building the carriers have been approved as of 2010 and the process of research and the design for the aircraft carrier is currently being looked into by the Iranian government.\nIn 2012, Iran overhauled one of the Kilo-class submarines in its possession, IRS Younis. Iran was able to complete this re-haul at Bandar Abbas naval base. In addition, the Iranian Navy has modernized and re-commissioned the 1,135-ton s; equipped with Noor anti-ship cruise missiles and torpedo launchers. Another modern frigate named Sahand, with 2,000 tons displacement was being fitted up with weapons and equipment in Bandar Abbas naval base; and was planned for launch in 2013.\nIn July 2012, foreign analysts reported that Iran was gaining new deployment capabilities, allegedly to strike at US warships in the Persian Gulf in the case of an armed conflict, amassing an arsenal of anti-ship missiles while expanding its fleet of fast-attack crafts and submarines. Many of the systems were developed with foreign assistance, such as the anti-ship missiles Silkworm, which is Chinese-made, and high-speed torpedoes based on Russian designs. In weeks prior, Iranian leadership had been threatening to shut down shipping in the gulf region as retaliation for any attacks by the United States on its nuclear facilities.\nIn December 2014, Iran conducted joint wargames involving the Iranian Army, Air Force and Navy. Naval phase took part on a wide area, ranging from Persian Gulf to northern Indian Ocean and to Gulf of Aden. New systems were tested, including new anti-ship cruise missiles, electro-magnetic and acoustic naval mine-sweeping system and Fateh submarine.\nOn 17 February 2019, newspapers reported that Iran unveiled a domestically produced submarine capable of firing cruise missiles. On 30 November 2019, Iran's navy announced the mass production of the Jask cruise missile, which is launched from Iranian submarines. It also unveiled a vertical takeoff and landing (VTOL) naval drone named Pelican-2, which had already been deployed on \"naval fleets in international waters.\"\nIran's navy deployed two warships, the destroyer Sahand and the supply ship/replenishment oiler Kharg, to the Gulf of Aden in August 2019 to protect commercial shipping. In September 2019, the head of the Iran navy said it was ready to defend its marine borders, and denied US and Saudi claims that Iran had orchestrated recent attacks on Saudi oil sites. On 20 November 2019, Islamic Republic News Agency reported that Iran's navy had sent a fleet of 64 ships to the Gulf of Aden to \"safeguard Iran's interests\" in an \"insecure seafaring region.\" The month prior, a maritime coalition led by the United States had formally launched operations in the Gulf. The Iran and US navies subsequently encountered each other in the Strait of Hormuz on 23 November 2019, with no conflict.\nOn 4 December 2019, Khanzadi stated that exercises, called Marine Security Belt, with China and Russia would begin on 27 December in the northern Indian Ocean. On 30 December 2019, Rear Admiral Hossein Khanzadi acknowledged during a televised interview with the semi-official Mehr News Agency that the Iranian Navy conducted joint exercises with Russia and China and will continue to do so on an annual basis. However, Khanzadi also stated that the drills were now needed due to a lack of coordination. He also stated that invitations which invited other countries to participate in the drills were unsuccessful.\nSee also\n* List of navies\n* Military history of Iran\n* Armed Forces of the Islamic Republic of Iran\n* List of military equipment manufactured in Iran\n* Defense industry of Iran\n* Iranian anti-access and area denial strategy in the Strait of Hormuz\n* Indian Ocean Naval Symposium\nReferences\nExternal links\n*"
    }
  ]
}