{
  "content": [
    {
      "type": "text",
      "text": "# Islamic views on prisoners of war\n\nIslamic views on prisoners of war encompass teachings from the Qur'an and hadith as well as later regulations developed in Islamic jurisprudence.\nThe historical legal principles governing the treatment of prisoners of war, in shar'iah, Islamic law, (in the traditional madhabs schools of Islamic jurisprudence), was then a significant improvement over the pre-existing norms of Arab society during Muhammad's time (see Early reforms under Islam). Men, women, and children may all be taken as prisoners of war under traditional interpretations of Islamic law. Generally, a prisoner of war could be, at the discretion of the military leader, freed, ransomed, exchanged for Muslim prisoners, or kept in bondage. In earlier times, the ransom sometimes took an educational dimension, where a literate prisoner of war could secure their freedom by teaching ten Muslims to read and write. Some Muslim scholars hold that a prisoner may not be ransomed for gold or silver, but may be exchanged for Muslim prisoners.\nPrimary sources\nQur'an\nThe Qur'an explicitly allows Muslims to take prisoners during war (). There is no verse in the Qur'an permitting enslavement of prisoners (but see section below on Islamic jurisprudence).\nAl-Qardawi, an Egyptian Muslim scholar born in 1926, adds in light of the verses below (), that the Islamic state should go to war to rescue non-Muslim minorities if they require help of the state and if the Islamic state is able to rescue them:Would not you fight in the way of God for al-mustad‛afīn (the oppressed socially weak Muslims) from men, women and children who pray: Our Lord! Take us from this city of the oppressive people and appoint for us from Your side a guardian and appoint for us from Your side a protector. Those who have believed fight in the way of God and those who disbelieve fight in the way of Satan, so fight the allies of Satan; surely the plot of Satan is weak. -\nMuhammad's life\nMany of the Islamic rules regarding prisoners of war (\"POWs\") come in the aftermath of the Battle of Badr, in which Muslims captured 43-70 enemy combatants. At the time, Muslims didn't have rules to deal with POWs. Muhammad ordered the prisoners be accommodated in the Prophet's Mosque or in houses of his companions, as they were the safest places in Medina at the time. Muhammad's famous instruction to his companions, with respect to the Badr POWs, was: \"Observe good treatment towards the prisoners.\"\nOne of the POWs, Abū ‛Azīz ibn ‛Umayr ibn Hāshim, later stated: \"They (Muslim fighters) brought me from Badr, and when they ate their morning and evening meals they gave me the bread and ate the dates themselves in accordance with the orders that the apostle had given about us. If anyone had a morsel of bread he gave it to me. I felt ashamed and returned it to one of them but he returned it to me untouched.\" Other Badr POWs reported being treated similarly. Another POW, Al-Abbas, was undressed when brought into captivity; so Muhammad found a shirt for him to wear. These practices would then set the precedent that POWs should be fed, clothed and sheltered adequately.\nDuring his life, Muhammad made it the responsibility of the Islamic government to provide food and clothing, on a reasonable basis, to captives, regardless of their religion. If the prisoners were in the custody of a person, then the responsibility was on the individual.\nHistorically, Muslims routinely captured large number of prisoners. Aside from those who converted to Islam, most were ransomed or enslaved. Pasquier writes,\nAccording to accounts written by Muhammad's followers, after the Battle of Badr, some prisoners were executed for their earlier crimes in Mecca, but the rest were given options: They could convert to Islam and thus win their freedom; they could pay ransom and win their freedom; they could teach 10 Muslims to read and write and thus win their freedom. William Muir wrote of this period:\n|William Muir, The Life of Mahomet}}\nExecuting prisoners\nDuring the conquest of Mecca, Muhammad ordered \"‘slay no wounded person, pursue no fugitive, execute no prisoners.\" Based on this many of his companions and jurists argued it was impermissible to execute POWs, yet those who disagreed pointed to three POWs Muhammad ordered be executed. After the Battle of Badr, Muhammad sentenced Uqba ibn Abi Mu'ayt to death for his crimes against Muslims in Mecca. Abū ‛Azzah al-Jumaḥi, was also captured at Badr and set free on the condition that he would never fight against Muslims again. When he was captured fighting Muslims at the Battle of Uhud, he was executed. Abdullah ibn Khatal was a Muslim who had killed a slave and then defected to the enemy; when Khatal was captured at the conquest of Mecca, he was executed.\nOther sources\nDuring his rule, Caliph Umar made it illegal to separate related prisoners of war from each other, after a captive complained to him for being separated from her daughter.\nThese principles were also honoured during the Crusades, as exemplified by sultans such as Saladin and al-Kamil. For example, after al-Kamil defeated the Franks during the Crusades, Oliverus Scholasticus praised the Islamic laws of war, commenting on how al-Kamil supplied the defeated Frankish army with food:\n}}\nIslamic jurisprudence\nUpon capture, the prisoners must be guarded and not ill-treated. Islamic law holds that the prisoners must be fed and clothed, either by the Islamic government or by the individual who has custody of the prisoner. This position is supported by the verse  of the Quran. The prisoners must be fed in a dignified manner, and must not be forced to beg for their subsistence. Muhammad's early followers also considered it a principle to not separate prisoners from their relatives.And they give food in spite of love for it to the needy, the orphan, and the captive,\n[Saying], \"We feed you only for the countenance of Allah; no reward do we desire from you, nor thanks.\n- [https://legacy.quran.com/76/8-9 Qur'an 76:8-9]After the fighting is over, prisoners are to be released freely, with some prospect of survival, or exchanged. The prisoners are not to be forced to convert to Islam. The freeing or ransoming of prisoners by Muslims themselves is highly recommended as a charitable act. The Qur'an also urges kindness to captives and recommends, their liberation by purchase or manumission. The freeing of captives is recommended both for the expiation of sins and as an act of simple benevolence. However, the Quran also permits certain forms of punishments against certain captives, such as those who are deemed as waging war against Islam, disbelievers, adulterers and fornicators.\nWomen and children\nAccording to the authentication of Muslim scholars, women and children prisoners of war cannot be killed under any circumstances, regardless of their faith, but that they may be enslaved, freed or ransomed. Women who are neither freed nor ransomed by their people were to be kept in bondage and referred to as ma malakat aymanukum (slaves) to give them their rights to survive peacefully, and they could not be left astray.\nSome modern Islamic extremist groups have taken slaves, including women and children. Abubakar Shekau, the leader of Boko Haram, a Nigerian extremist group, said in an interview, \"I shall capture people and make them slaves\" when claiming responsibility for the 2014 Chibok kidnapping. Shekau has justified his actions by appealing to the Quran saying \"[w]hat we are doing is an order from Allah, and all that we are doing is in the Book of Allah that we follow\". In October 2014, in its digital magazine Dabiq, ISIL explicitly claimed religious justification for enslaving Yazidi women. Specifically, ISIL argued that the Yazidi were idol worshipers and justified the sexual slavery of the captured non-muslim victims as a permissible manner of enjoying the spoils of war. ISIL appealed to apocalyptic beliefs and \"claimed justification by a Hadith that they interpret as portraying the revival of slavery as a precursor to the end of the world.\"\nMen\nOne traditional opinion holds that executing prisoners of war is strictly forbidden; this is the most widely accepted view, and one upheld by the Hanafi madhab.\nHowever, the opinion of the Maliki, Shafi'i, Hanbali and Jafari madhabs is that adult male prisoners of war may be executed. The decision for an execution is to be made by the Muslim leader. This opinion was also held by the Muslim judge, Sa'id bin Jubair (665-714 AD) and Abu Yusuf, a classical jurist from the Hanafi school of jurisprudence. El Fadl argues that Muslim jurists adopted this position largely because it was consistent with the war practices of the Middle Ages. Muhammad Hamidullah, while reminding that execution in such cases was exceptional and depending on many factors, further states that beheading was discouraged: \"unanimity was reached among the Companions of the Prophet not to behead prisoners of war. In short, capital punishment for prisoners of war is only permissible in extreme cases of necessity and in the higher interests of the State.\"\nMost contemporary Muslim scholars prohibit altogether the killing of prisoners and hold that this was the policy practiced by Muhammad. The 20th-century Muslim scholar, Sayyid Abul Ala Maududi states that no prisoner should be \"put to the sword\" in accordance with a saying of Muhammad.\nYusuf Ali, another 20th-century Muslim scholar, while commenting on verse , writes,\nMaududi further states that Islam forbids torturing, especially by fire, and quotes Muhammad as saying, \"Punishment by fire does not behoove anyone except the Master of the Fire [God].\"\nQuoting from the sources, Muhammad Munir, from the Department of Law of the International Islamic University, Pakistan, says that early religious authorities standing against the execution of POWs at all include 'Ali b. Abi Tãlib, Al-Hasan b. al-Hasan al-Basrl (d. 110/728), Hammãd b. Abi Sulaymän (d. 120/737), Muhammad b. Sirin (d. 110/728), Mujãhid b. Jabr (d. 103/721), 'Abd al-Mãlik b. 'Abd al-'Azïz b. Jurayj (d. 150/767), 'Atâ' b. Abi Rabãh (d. 114/732) and Abû 'Ubayd ibn Sallãm, while later scholars favouring the same opinion include Muhammad b. Ahmad al-Qurtubl (d. 671/1272), who cites  in proposing the impossibility of execution if the letter of the Qur'an is followed. Ibn Rushd (d. 594/1198) is also quoted: \"[A] number of jurists did not permit executing the prisoners of war. Al-Hasan b. Muhammad al-Tamïmï (d. 656/1258) stated consensus (ijma) of the Companions on this view.\" He further said that the rare executions were more due to the crimes they committed before the captivity than their status of POW itself. A well known case which is relevant in this regard is that of 'Abd Allah b. Khatal, who was one of the few people who were not granted immunity at the conquest of Mecca. A group of people \"could have been punished by a tribunal should there have been one at the time”. But he was the only one executed for what we would today call high treason (as he collected tax money from Muslims before defecting and fighting them). He also said that \"in the first one hundred years of Islamic military history, that is, from the time of the Prophet (peace be upon him) till the time of Caliph 'Umar b. 'Abdul 'Aziz, there were only six or seven such cases, even if we were to accept the spurious reports of such executions.\"\nProsecuting prisoners\nIn Islamic law, prisoners of war may be tried, convicted and punished for crimes beyond the belligerency itself. However, they may not be punished merely for being belligerents.\nSee also\n*Arab–Byzantine prisoner exchanges\n*Islamic views on slavery\n*Islam and war\n*Islamic military jurisprudence\nReferences\nNotes\n*\n*\n*\n*\n*\nExternal links"
    }
  ]
}