{
  "content": [
    {
      "type": "text",
      "text": "# Islamic Republic of Afghanistan (government in exile)\n\n}}\n|\n|}}\n|}}\n| conventional_long_name = Islamic Republic of Afghanistan\n| common_name            = Afghanistan\n| status                 = Government-in-exile\n| image_flag             = Flag of Afghanistan (2013–2021).svg\n| alt_flag               = Flag of Afghanistan\n| flag_border            =\n| symbol_type            = Emblem\n| image_symbol           = Emblem of Afghanistan (2013–2021) (variant).svg\n| alt_symbol             = Emblem of Afghanistan\n| symbol_width           = 100px\n| motto                  = }}}}\"\" \"There is no god but God; Muhammad is the messenger of God.\" (Shahada)\n| national_anthem        = Surūd-i Millī\n| text_symbol_type       =\n| text_symbol            =\n| loctext                =\n| capital_exile          = Dushanbe\n| membership_type        =\n| membership             =\n| admin_center_type      =\n| admin_center           =\n| languages_type         = Official languages\n| languages              = PashtoDari\n| religion               = Islam\n|leader_title1           = President\n| government_type        = Presidential republic\n| leader_name1           = Amrullah Saleh (acting)\n| leader_title2          =\n| leader_name2           =\n| legislature            =\n| established            =\n| established_date1      =\n| established_event1     =\n| established_date2      =\n| established_event2     =\n| established_event3     =\n| established_date3      =\n| official_website       =\n| area_magnitude         =\n| area_km2               =\n| area_sq_mi             =\n| area_footnote          =\n| percent_water          =\n| area_label             =\n| area_label2            =\n| area_dabodyalign       =\n| population_estimate    =\n| population_estimate_year =\n| population_density_km2 =\n| GDP_PPP                =\n| GDP_PPP_rank           =\n| GDP_PPP_year           =\n| GDP_PPP_per_capita     =\n| GDP_nominal            =\n| GDP_nominal_year       =\n| GDP_nominal_per_capita =\n| Gini                   =\n| Gini_ref               =\n| Gini_year              =\n| HDI                    =\n| HDI_ref                =\n| HDI_year               =\n| time_zone              =\n| utc_offset             =\n| footnotes              =\n| demonym                =\n| area_rank              =\n| today                  =\n}}\nA government in exile for the Islamic Republic of Afghanistan was formed by vice-president Amrullah Saleh in the immediate aftermath of the fall of Kabul to the Taliban on 15 August 2021. It was initially based in Panjshir Province which was at that time not under Taliban control before relocating to Tajikistan when the Taliban took Panjshir three weeks later on 6 September 2021.\nHistory\nSaleh's proclamation\n]]\nOn 17 August 2021, vice-president Amrullah Saleh proclaimed himself the acting president of Afghanistan, in accordance with articles 60 and 67 of the Constitution of Afghanistan which stipulate that the First Vice President assumes the duties of the President in the absence of the President. He also criticized US President Joe Biden and NATO, declaring in a tweet that \"It is futile to argue with @POTUS on Afg now. Let him digest it. We d Afgs must prove tht Afgh isn't Vietnam & the Talibs aren't even remotely like Vietcong. Unlike US/NATO we hvn't lost spirit & see enormous oprtnities ahead. Useless caveats are finished. JOIN THE RESISTANCE.\" In a second tweet he wrote that \"as per d constitution of Afg, in absence, escape, resignation or death of the President the FVP becomes the caretaker President. I am currently inside my country & am the legitimate care taker President. Am reaching out to all leaders to secure their support & consensus.\"\nFall of Panjshir\nOn 6 September, as the Taliban reportedly took full control of the Panjshir Valley, Saleh reportedly fled to Tajikistan. Mohammad Zahir Aghbar, the Islamic Republic of Afghanistan's ambassador to Tajikistan, however denied these reports on 8 September. Saleh's son Ebadullah told Reuters on 10 September that his father's brother Rohullah Azizi had been executed a day earlier in Panjshir by the Taliban.\nAccording to U.S. intelligence, two senior former Afghan government officials, and a Pentagon consultant, Saleh escaped into Tajikistan shortly after the Taliban seized control of the Panjshir Valley on September 6, along with Ahmad Massoud.\nGovernment in exile\nOn September 29, the Afghan Embassy in Switzerland released a statement from the government-in-exile stating that the Islamic Republic of Afghanistan led by Amrullah Saleh is the \"only legitimate\", democratically elected, government of Afghanistan and that no \"external force\" shall be accepted as the Afghan government whose support shall be extended to the National Resistance Front (NRF) led by Ahmad Massoud. It also stated that all the Afghan embassies under the Islamic Republic of Afghanistan shall carry on their regular work and that the activities of legislature and judiciary will be initiated soon with Saleh acting as the president of Afghanistan.\nInternational recognition\nAs of November 2025, only one country, Russia has formally recognised the Taliban as the legitimate government of Afghanistan. However several other countries have handed over Afghan diplomatic missions to representatives of the Taliban.\nThe United Nations list of Heads of State, Heads of Government, and Ministers for Foreign Affairs of all Member States lists the Islamic Republic of Afghanistan as a member state and the flag of the Islamic Republic of Afghanistan continues to be used within the United Nations system.\nDiplomatic missions\nAfter the fall of Kabul in August 2021, several Afghan diplomatic missions claim to continue to represent the Islamic Republic of Afghanistan including the mission to the United Nations in New York City.\nIn the absence of a functional foreign ministry, a Coordination Group was established by the republican ambassadors in order to coordinate efforts via mostly online meetings, and a Council of Ambassadors acts as the embassies' government system.\nInternational sport\nMany international sports governing bodies continue to use the flag of the Islamic Republic of Afghanistan to represent the country.\nSee also\n*Islamic Republic of Afghanistan\n*Republican insurgency in Afghanistan\n*National Resistance Front of Afghanistan\n*Afghanistan Freedom Front\nReferences\nExternal links\n*[https://x.com/AmrullahSaleh2 Amrullah Saleh]\n*[https://www.afghanmission-un.org/ Permeant Mission of the Islamic Republic of Afghanistan to the United Nations]"
    }
  ]
}