{
  "content": [
    {
      "type": "text",
      "text": "# Isle of Wight Walking Festival\n\nThe Isle of Wight Walking Festival is a walking festival which takes place annually on the Isle of Wight, around May spanning two weeks. The event has been running for more than 12 years. The 2009 event featured over 300 walks and over 24,500 people taking part, making it the largest currently to date, and the festival as a whole the largest walking festival in the UK. The event finishes with 'Walk the Wight', the largest walk from Bembridge to The Needles (One side of the island to the other). For the past six years the event has been sponsored by Ordnance Survey as part of a contract which ended with the 2009 event. As it has not been renewed a search for a new sponsor has started.\nWalk the Wight\nWalk the Wight is the largest walk of the festival, and used to be the last to occur. The walk covers ground across the island, from Bembridge in the east, travelling via Carisbrooke to The Needles in the western tip of the island. Walk the Wight has been running for 19 years in aid of the Earl Mountbatten Hospice and is now the biggest sponsored walk in the South of England. The walk is set into three sections with varying distances for walkers to choose from depending on their ability.\n* 26.5 miles – Bembridge to The Needles Park (7–10 hours)\n* 12.5 miles – Bembridge to Carisbrooke (3–5 hours)\n* 14 miles – Carisbrooke to The Needles Park (4–7 hours)\nThe 'Walk the Wight' event was first started in spring 1991, when two members of staff from a company on the island (Morey's which now sponsors the event) called Bill Bradley and Frank Stevens, who enjoyed early morning walks arranged for a few friends and family members to walk from one side of the island to the other. The principal aim of the walk was to encourage other like-minded people to appreciate the scenery of the island. This developed into the idea that walkers could be sponsored to raise money for charity. It started off raising money for the island's own MRI scanner as an appeal had been launched. It then raised money both for a new CTI scanner and the Earl Mountbatten Hospice. Once the scanner appeal was complete and because of the large amount of help and support given by staff and friends, it was decided to support the Earl Mountbatten Hospice which it continues to do today.\nAs the years passed, the numbers of people taking part in the walk increased from about 25 in 1991 to around 12,000 now. As the event grew it became clear the event had to be managed by a larger group, so a committee was formed from within the hospice. Other companies have later come on to support the event such as Red Funnel and Southern Vectis who now provide free travel for walkers.\nIn 2008 a new 'Flat Walk the Wight' was introduced running along the island's cycle network, aimed at those unable to manage the steep hills the traditional walk involves such as those in wheelchairs or with small children. The walk starts from Sandown High School, finishing at Shide.\nNotable walks\n* Walk the Wight\n* Flat Walk the Wight\n* Fire walk\n* Ghost walks\n* Speed dating walks\n* Dinosaur walks\n* \"Round the Island in 24 hours\" non-stop walk\n* The Robert Hooke Trail historical walk\nReferences\nExternal links\n* [http://www.isleofwightwalkingfestival.co.uk/ Isle of Wight Walking Festival Official Website]"
    }
  ]
}