{
  "content": [
    {
      "type": "text",
      "text": "# Ispah rebellion__disambig_1\n\n|commander3=\n|strength1=Yuan army\n|strength2= Muslim rebels\n|strength3=\n|casualties1=\n|casualties2=\n|casualties3=\n}}\nThe Ispah rebellion () was a series of civil wars in the middle of 14th century in Fujian during the Yuan dynasty. The term Ispah might derive from the Persian word \"سپاه\" (sepâh), meaning \"army\" or \"Sepoy\". Thus, the rebellion is also known as the Persian Sepoy rebellion (波斯戍兵之亂; Bōsī Shùbīng zhī Luàn) in Chinese documents.\nUnder Yuan rule, more Semu people (Arab and Persian Muslims) migrated to the Chinese port city of Quanzhou. In 1357, a predominantly Muslim army led by two Quanzhou Persian Shi'a Muslims,  () and  (), revolted against the Yuan. The rebel army seized control of Quanzhou, Putian, and even reached the provincial capital Fuzhou.\nIn 1362, the Ispah army collapsed into internal conflict,  (那兀纳), a Quanzhou Arab Sunni Muslim official, became the new leader of the Ispah army. In 1366, it was eventually crushed by the ethnic Han commander Chen Youding (陈友定) who was loyal to the Yuan dynasty.\nHistorical background\nFrom the 13th century to the early 14th century in the Yuan dynasty, overseas trade was extremely prosperous in Fujian. As the starting point of the Maritime Silk Road, Quanzhou was the largest port in China and possibly the world as well. It was also the largest city in Fujian, with a population exceeding that of Fuzhou, Fujian's administrative center. The Arabs called it \"Tiger's claw\", which has been used by merchants in Europe and elsewhere. At the time, Quanzhou's population exceeded 2 million, with a wall as long as 30 miles. Jinjiang's river and its harbor, with highly developed trade, had 10,000 ships docked. Quanzhou exported luxuries such as silk, ceramics, copper, and iron, as well as satin, while imports include pearls, ivory, rhino horns, frankincense, etc. The most important imports were spices and herbs.\nQuanzhou had mostly foreign residents, such as Arabs, Persians, Europeans, Jews, Tamils, Armenians, etc. Around 100 different languages were used. The Quanzhou officials labeled these foreigners as Fan (番). Due to the massive number of foreigners coming in, authorities initially did not want foreigners to stay and interfere with the locals' lifestyles. Quanzhou had large ethnic enclaves (\"蕃坊\", \"蕃人巷\"), with foreigners and natives often intermarrying and giving birth to mixed children (often labeled Half Southern Domain or \"半南蕃\"). Although foreigners and natives had some cultural intermingling, the foreigners still practiced and spread their own religions, such as Islam, Christianity, Manichaeism, Hinduism, etc. This religious and ethnic diversity made governance a challenging task.\nOrigin of the name \"Ispah\"\nThere are multiple theories about the origin of the word \"Ispah\". Some think that \"Ispah\" originated from the Persian word \"سپاه\"(sepâh), which means militia, cavalry, or some derived version. It could also be the Persian equivalent of \"mercenaries\" or borrowed from the name of a city, Isfahan, given that most of the people came from that city. Others believe that Ispah is used for designating troops, instead of as an actual name.\nSunni-Shiite tension\nIn the early Yuan dynasty, the Mongols gave the Islamic Sunni Semu Pu Shougeng () family public support, since they helped rebel against the Song dynasty and establish the Yuan dynasty. As a result, this family became stronger and had more influence over politics and the economy. Sunni Muslims became more dominant in Quanzhou and excluded the Shiites, causing growing resentment among them. In 1282 (the 19th year of the Yuan dynasty), the Yuan dynasty stationed 3000 Shiite forces in Quanzhou, but even then there were still too few Shiites in Quanzhou.\nNear the end of the Yuan dynasty, the government struggled to deal with various armed rebellions. The Quanzhou Shiite Persians organized the Ispah army to defend their ethnic group, which already had a large Persian population with growing strength. In March 1357, Sayf ad-Din and Amir ad-Din, the commanders of the Ispah army, seized the opportunity to control Quanzhou, and suppressed the formerly dominant Sunni. The Ispah army became one of the strongest forces in Fujian.\nDefeat\nWhen the uprising was crushed, the imperial soldiers killed most of the Semu merchants in Quanzhou, then massacred all of the Persians. Some foreign survivors managed to flee Quanzhou to other ports of southern Fujian like Yuegang and Jinjiang, later assimilating into the Hokkien community and later still becoming overseas Chinese. Mosques and other buildings with foreign architecture were almost all destroyed and the imperial soldiers killed most of the descendants of Pu Shougeng and horrifically mutilated their corpses. The few descendants who escaped changed their surnames to Wu (吳) or Bo (卜).\nEffects\nIn Quanzhou, many groups like Arab, Persian, Semu people intermarried and had mixed children who practiced a diversity of faiths. However, after the rebellion, xenophobia increased, and mixed marriages became taboo in the Yuan dynasty. Some native men were even disowned for marrying foreign women. One such person was Lin Nu, of the Lin family in Quanzhou.\nLin Nu\nLin Nu, son of Lin Lu, traveled to Hormuz in Persia in 1376, married a Persian or an Arab girl, and brought her back to Quanzhou.\nLin Nu and his descendants were erased from the family genealogy. His relatives were angry at him for converting to Islam and marrying a Persian girl. Xenophobia was strong at that time due to Persian Semu atrocities, the Yuan quelling of the Ispah Rebellion, and the massacre of Semu. The Chinese Lin family felt ashamed so they changed their surname from Lin to Li to avoid associating with their relatives, Lin Nu and his Persian wife's mixed descendants who practiced Islam.\nLin Nu was the ancestor of the Ming dynasty reformer Li Chih (Lin changed name to Li), who by that time was not Muslim.\nSee also\n* Semu\n* Islam during the Yuan dynasty\n* Red Turban Rebellion\nReferences\n* Reid, Anthony (2006): Hybrid Identities in the Fifteenth-Century Straits of Malacca"
    }
  ]
}