{
  "content": [
    {
      "type": "text",
      "text": "# Israeli invasion of Syria (2024–present)\n\n*\n*\n}}\n| date              = 8 December 2024 – present()\n| place             = Quneitra and Daraa governorates, Syria\n| combatant1        =\n| combatant2        =  Palestinian militants Assad loyalists\n| commander1        =  Benjamin Netanyahu Israel Katz Eyal Zamir Herzi Halevi (until 2025) Tomer Bar Ori Gordin\n| commander2        =  Ahmed al-Sharaa\n*  Murhaf Abu Qasra\n*  Ali Noureddine al-Naasan}}\n| units1            =\n*\n**\n***&nbsp; 36th Division\n****  7th Brigade\n***&nbsp;&nbsp;98th Division\n****  35th Brigade\n****  Oz Brigade\n***  210th Division\n****  474th Brigade\n****  810th Brigade\n**\n***  7th Wing\n****  Unit 5101\n****  Unit 669\n**\n| units2            =\n*  Syrian transitional government\n** Southern Operations Room\n**  Syrian Armed Forces\n***  Syrian Army\n----\n*  Palestinian Militants\n**  Martyr Muhammad al-Deif Brigades\n**  Hamas\n***  Al-Qassam Brigades\n**  Palestinian Islamic Jihad\n----\n*  Syrian Social Nationalist Party\n**  Eagles of the Whirlwind\n*  Islamic Resistance Front in Syria\n*  Syrian Popular Resistance\n| strength1         =  6,000–10,000+ troops\n| strength2         =  100,000+ soldiers and fighters\n| casualties1       = Per Israel:1 soldier killed3 soldiers injured(non-combat)Per SOHR:7 soldiers injuredPer Syrian Popular Resistance:Multiple wounded1+ vehicles damaged\n| casualties2       = Per SNHR:38 civilians killed6 soldiers killed1 civilian killed on 15 January 20251 civilian killed on 8 February 202510 civilians killed in March 2025\n*3 civilians and 1 soldier killed on 17 March 2025\n*6 (armed) civilians killed on 25 March 2025\n9 (armed) civilians killed on 3 April 20254 civilians killed on 2 May 20251 civilian killed on 30 May 20251 civilian killed on 12 June 20253 civilians killed on 16 July 20255 soldiers killed on 26 August 2025}}26+ arrested/detained4 SARC ambulance crew detained on 15 February 2025\"Repeated arrests of civilians\" between December 2024–25 February 20251 resident arrested on 11 March 20254 young men arrested 21–24 March 20252 civilians detained on 10 May 2025Approximately 13 civilians arrested 9 June–8 July 2025\n* 3 civilians arrested on 9 June 2025\n* 7 civilians arrested on 12 June 2025}}Per SOHR:33–43 civilians killed 30–35 soldiers killed 2 civilians killed on 9 December 2024 1 civilian killed on 11 December 2024 11 people \"believed to be\" killed on 29 December 2024, \"mostly civilians\" 1 civilian and 2 soldiers killed on 15 January 2025 1 civilian killed on 8 February 2025 2 soldiers killed on 25 February 2025 3 civilians and 1 soldier killed on 17 March 2025 1 civilian killed between 23–25 March 2025 7 (armed) civilians killed on 25 March 20254 soldiers killed on 2 April 20259 (armed) civilians killed on 3 April 20251 civilian killed on 3 May 20251 other civilian killed in May 20251 civilian killed on 12 June 202515 soldiers and 3 civilians killed 13–16 July\n* 1 soldier killed on 15 July 2025\n* 12 soldiers and 3 civilians killed on 16 July 2025\n1 civilian and 6 soldiers killed on 26 August 2025}}1 unknown person killed41+ arrested1 young man arrested on 5 January 20251 young man arrested on 24 January 20251 young man arrested on 19 February 20251 young man arrested on 12 March 20254 young men arrested on 22 March 20251 father arrested on 26 April 20252 arrested (a taxi driver and his son) on 10 May 20251 young man arrested on 25 May 2025\"Several\" civilians arrested on 9 June 20253 sanitation workers arrested on 11 June 20257 civilians arrested on 12 June 20252 young men arrested on 14 June 20254 civilians arrested on 16 June 20252 young men arrested on 29 June 20253 Palestinian civilians arrested on 2 July 20252 civilians arrested on 7 July 2025}}Several tanks and drones lostPer BBC:7 journalists detainedMaterial losses: Multiple military sites destroyed as well as ground, air and naval assets.\n| status            = Ongoing\n| territory         = * Israel advanced within and beyond the UNDOF buffer zone, capturing Madinat al-Salam, Khan Arnabah, Ma'ariya, Al-Wehda Dam, and Quneitra, as well as the Syrian-controlled side of Mount Hermon\n* Israeli forces also reached parts of the Qatana District.\n| campaignbox       =\n}}\nFollowing the fall of the Assad regime on 8 December 2024, Israel invaded the buffer zone in southwestern Syria (adjacent to the Israeli-occupied Golan Heights) and has continued to occupy it. Israel also carried out an aerial bombing campaign to cripple the new Syrian Armed Forces, and demanded that it stay out of southern Syria. Israel's government claimed this was to thwart any \"potential threat\" from post-war Syria.\nIsrael took advantage of the power vacuum created by the fall of former Syrian president Bashar al-Assad to increase the amount of territory it controlled by several hundred square miles. Israel declared the 1974 Agreement on Disengagement with Ba'athist Syria to be void. Israel initially said this new invasion would be \"temporary\", but later said it would hold onto the territory for an \"unlimited time\". Israel also launched extensive aerial and naval strikes on Syrian military targets across the country, under an operation codenamed Operation Arrow of Bashan (). Israel's campaign crippled Syria's military capabilities, including its army and its navy, and destroyed its chemical weapons stockpiles.\nIsrael's campaign in Syria was internationally condemned and was accused of violating international law. Syrian President Ahmed al-Sharaa condemned Israel's actions and demanded withdrawal, but also said his country was not in a position to be drawn into another war following the 14-year Syrian civil war.\nOn 25 February 2025, Israel deepened its invasion of southern Syria while conducting a wave of airstrikes there and in Damascus, one day after demanding the Syrian caretaker government demilitarize southern Syria. Since the July 2025 Suwayda clashes, Israel has launched airstrikes against the Syrian military that it says are in defense of the Syrian Druze.\nBackground\nSince the Six-Day War in 1967, Israel has occupied most of the Golan Heights region of Syria. After the Yom Kippur War in 1973, Israel and Syria agreed to a ceasefire which created the UN Disengagement Observer Force (UNDOF), which maintains a small buffer zone between the two countries. In 1981, Israel annexed the region, a move condemned by the United Nations and unrecognized by any country except the United States (recognized 2019). During its occupation, Israel has depopulated Syrian towns and villages and promoted Israeli settlement in the Heights.\nIn November 2024, the United Nations accused Israel of violating the 1974 Agreement on Disengagement in November with engineering work and battle tanks inside the demilitarized zone. UNDOF stated it had \"repeatedly engaged with the IDF to protest the construction.\" Israel responded that it was \"working to establish a barrier on Israeli territory exclusively in order to thwart a possible terrorist invasion and protect the security of Israel's borders,\" and that \"Israeli and IDF officials maintain close contact with UN officials who are familiar with the threats in the region.\"\nIn December 2024, the Syrian opposition launched a major offensive against the Bashar al-Assad led Syrian regime. Following the fall of the Assad regime, Israeli Minister of Diaspora Affairs and Combating Antisemitism Amichai Chikli expressed apprehension at the opposition forces' political upheaval of the Syrian government, claiming that: \"Most of Syria is now under the control of al-Qaeda and Daesh.\" He implored Israel to re-fortify its defensive line at Mount Hermon in Israeli-occupied Golan Heights based on 1974 borders in order to prevent potential attacks by the new regime.\nThe collective of Druze community leaders in Syria condemned the invasion. The newly formed Suwayda Military Council declared its commitment to integrating into the Syrian Army while also supporting the demilitarization of southern Syria. The Sheikh al-Karama Forces, a Druze military organization affiliated with the FSA condemned the invasion as a violation of Syria's sovereignty and stated they would work with opposition forces. Sheikh al-Karama Forces had issued a joint statement with the Al-Jabal Brigade in January 2025 emphasizing that it was prepared to integrate into a united \"military body\" in southern Syria.\nIsraeli objectives\nOn 9 December 2024, Israeli Defense Minister Israel Katz issued orders for military objectives in southern Syria. The IDF received four primary strategic objectives from Katz to conduct \"in the immediate term\":\n# To secure complete control over the buffer zone and other nearby strategic positions in Syria.\n# To establish a security zone extending beyond the buffer zone, focusing on removing all heavy weaponry and terrorist infrastructure that could pose a threat to Israel, while establishing contact with local Druze communities and other regional communities.\n# To immediately prevent the reestablishment of Iranian arms smuggling routes to Lebanon through Syrian territory and border crossings.\n# To continue destroying strategic heavy weapons systems throughout Syria, including air defense networks, missile systems, and coastal defense installations.\nIsrael has also stated its demands for all Syrian territory south of Damascus to be demilitarized, including the governorates of Quneitra, Daraa and Suwayda, and that it would not tolerate threats against the Druze in southern Syria.\nEvents\nGround offensive\nFollowing the advance of the Syrian opposition in the south, Israel reinforced Division 210 and deployed additional troops to the Golan Heights to prevent any possible threats. When Syrian opposition forces first occupied the southern town of Hader, it was reported that the IDF had advanced further into the Golan Heights to repel an attack on a United Nations post in the area. Additionally, the IDF significantly reinforced its presence within the established buffer zone.\n2024\nOn 8 December 2024, Israeli armored units, including main battle tanks, crossed the ceasefire line in the occupied Golan Heights fence and entered the buffer zone during early morning operations. Israeli Army Radio stated that the IDF and Northern Command initiated the operation in order to strengthen its border with Syria and prevent spillover or attacks against Israel.\nThe military advance extended into the Quneitra Governorate, with substantial forces entering the town of Khan Arnabah. Syrian media reported that Israeli forces had advanced into the city center of al-Salam. Following the advance into the Quneitra Governorate and the Syrian-controlled side of Mount Hermon by the Israeli Special Forces Shaldag Unit (Unit 5101), Israeli Prime Minister Benjamin Netanyahu issued a statement saying that the 1974 ceasefire agreement had collapsed when Syrian soldiers abandoned their posts in the Golan Heights, and that the area was to be temporarily occupied to \"ensure that no hostile force embeds itself next to the border of Israel.\" Netanyahu stated Assad's fall \"offers great opportunity\" to occupy more Syrian territory. During the takeover, IDF spokesman Avichay Adraee announced a curfew in five Syrian villages, including Quneitra, ordering locals of the border towns to remain inside \"until further notice.\" On 8 December 2024, Al Arabiya reported that Israel had taken control of Tell al-Hara. On 10 December correspondents for Al Jazeera and Enab Baladi reported Israeli tanks in several Syrian villages such as Beer Ajam. Although Israeli tanks were also reported as far as Qatana,  from Damascus an IDF spokesman insisted that \"IDF forces are not advancing towards Damascus. This is not something we are doing or pursuing in any way\" while acknowledging that, beyond the buffer zone, \"a few additional points\" had been seized. The Israeli Defense Minister also stated that Israel aims to establish a \"sterile defence zone\" in southern Syria to \"prevent the establishment and organisation of terror in Syria\".\nOn 11 December, orthodox Chabad Jews printed the Tanya, a central Chabad religious text, from a light truck on Syrian land, at the base of Mount Hermon, a short distance to the east of the purple line.\nOn 12 December, Syrian residents of Hader, Hamidiya, and Umm Batna in Quneitra Governorate were displaced from their homes after the IDF entered with military vehicles, with Israeli troops subsequently probing Umm Batna in its entirety.\nFrom 12 to 13 December, Syrian sources reported that Israeli forces conducted formal meetings with local community representatives in the Yarmouk Basin area in southwestern Daraa Governorate, reportedly using loudspeakers and a low-flying drone to broadcast messages urging meetings and requirements. The Israeli military reportedly articulated specific security requirements for the local population, including the surrender of all weapons in the village, compliance with home search operations, and the prohibition of armed resistance against any military operations. Syrian sources also claimed that Israeli troops used loudspeakers to warn villagers in the area to evacuate their residences.\nOn 15 December Israel attempted to depopulate several Syrian villages in the newly occupied part of the Golan Heights. After the residents declined, Israel began destroying the electricity and water networks in the villages to attempt to forcibly evict them. The Israeli government also declared that it would expand Israel settlements in the Golan Heights. Netanyahu announced plans to double the Golan Heights' population in a statement on the 15th, saying Israel would continue to hold onto it and that \"Strengthening the Golan is strengthening the State of Israel.\"\nOn 17 December, Netanyahu met with Defense Minister Israel Katz, Chief of the General Staff Herzi Halevi, commander of the Northern Command Ori Gordin, and Shin Bet head Ronen Bar on the Syrian side of Mount Hermon, where they held a security briefing and visited outposts at the summit. During a video statement filmed on the summit, Netanyahu said that the IDF would stay in Syria \"until another solution ensuring Israel's security is found\".\nOn 18 December, it was reported that over 100 Syrian families had been forcibly expelled from the Golan Heights by the Israeli military. Witnesses describe that Israeli soldiers had opened fire on them and on their homes. The United Nations peacekeepers have been removing Israeli flags in the newly occupied area.\nOn 19 December, it was reported that the Israeli military is preventing Syrian farmers in Ma'ariya from accessing their fields.\nOn 20 December, the Israeli military occupied two addition Syrian villages, Jamlah and Maaraba, and then shot bullets at Syrians protesting the Israeli occupation.\nOn 25 December, the Israeli military shot at protesters in the Syrian villages of Suweisa and Diwaya Al-Kabira in the Quneitra Governorate.\nOn 30 December, Israeli forces advanced into Madinat al-Baath and searched the local administrative offices. On the same day, Israeli military lecturer Rami Simani stated that Syria has \"never had a real right to exist\" and that \"Israel can and must cause Syria to disappear\", advocating a partition of Syria.\n2025\nOn 9 January, Israeli officials said that they are going to occupy for \"the long run\" a 15&nbsp;km \"zone of control\" and 60&nbsp;km \"sphere of influence\" deeper into Syria.\nOn 31 January, Israeli troops clashed with five pro-Assad Syrian rebels in Trinjeh. The Jerusalem Post reported that The Islamic Resistance Front in Syria was responsible for the attack, but the Syrian Popular Resistance claimed responsibility, claiming that multiple Israeli soldiers were wounded and vehicles were damaged. The IDF said that it suffered no casualties.\nOn 2 February, the IDF near Jubata al-Khashab and surrounding villages established outposts and military bases with calls for more Israeli settlement into the Golan Heights by Israeli officials.\nOn 11 February, Israeli Army Radio reported that Israel would prolong the occupation of their newly invaded territory in Syria throughout 2025.\nOn 23 February, the IDF confirmed that it had built at least nine army posts in Syria, including two on Mount Hermon and seven on the buffer zone.\nOn 25 February, the IDF completed raids southern Rif Dimashq, in the villages of Al-Kiswa, and Daraa, in the vicinity of the city of Izra and penetrating the outskirts of Al-Bakar village, and penetrated the administrative borders between the governorates of Daraa and Quneitra in southern Syria and the Ain al-Bayda area in the countryside of Quneitra in southern Syria, also taking the villages of Sidon Al-Golan and Sidon Al-Hanout in the countryside of Quneitra. This came after plans to install advanced military technology, border fencing, and checkpoints in the borders of Gaza, Lebanon, and Syria.\nOn 27 February, the Islamic Resistance Front in Syria began forming military cells in Southern Syria, likely with Iranian backing.\nOn 1 March, Netanyahu and Defense Minister Israel Katz ordered the IDF to prepare to defend the Druze community in Jaramana following clashes between Syrian security forces and a local group called the \"Jaramana Shield Brigade\" that left one Syrian soldier dead.\nOn 8 March, the IDF announced that it carried out several raids in southern Syria the week prior, capturing and destroying weapons.\nOn 19 March 2025, Israel launched its largest incursion yet, capturing the village of Al-Adnaniyah in the countryside of Quneitra Governorate.\nOn 25 March, several Syrian gunmen attacked Israeli soldiers in Kuwaya. No Israeli troops were harmed, and five people were killed by retaliatory fire and a drone strike. Also that day, the IDF announced that the Paratroopers Brigade and Yahalom had carried out several raids against weapon storage sites in southern Syria in recent weeks.\nOn 2 April, Israeli forces conducted a deep incursion in Daraa Governorate, advancing towards Nawa. Mosques called upon residents to defend, and some 2,000 men bearing hunting rifles or no arms mobilised to prevent the Israelis from capturing the nearby Jabiliya Dam, whose reservoir supplies water to Nawa and its surrounding settlements. In response, Israeli forces conducted drone strikes that killed nine people, although they later withdrew. Thousands attended the funerals of those killed the following day, including Daraa governor Anwar al-Zoubi.\nOn 4 April, it was reported that the Israeli military and Israeli settler movement began organizing trips for Israeli civilians inside the newly occupied part of Syria.\nOn 10 April, the Israeli newspaper Ynet reported that Israeli soldiers have been shooting at Syrian shepherds and that 100 sheep had been killed. The Israelis have also prevented Syrians from accessing their farmland and have fired towards and threatened Syrian civilians at the Al-Mantra Dam in Quneitra.\nOn the 29 of April, Israeli minister Bezalel Smotrich stated: \"we will end this campaign when Syria is dismantled\".\nOn 1 May, an Israeli soldier from the 890th Battalion was killed and three others suffered minor injuries following a car accident during an operation on Highway 98 in the Golan Heights.\nOn 3 May, the IDF announced that it sent troops to southern Syria who were ready to \"prevent the entry of hostile forces into the area of Druze villages\" amid deadly clashes in the area. It also evacuated 15 Syrian Druze wounded in the clashes to hospitals in Israel throughout the week.\nOn 9 May, seven BBC Arabic journalists, including Feras Kilani, were detained at gunpoint by Israeli soldiers while they were filming in the area of an unguarded checkpoint, around  from Quneitra. The soldiers took them to a room in the crossing point between Quneitra and the Golan Heights, where they were all handcuffed and blindfolded except for Kilani, who was told that he would be treated differently. The team was held for about seven hours, during which they were strip searched, interrogated, and had photos on their phones and laptops deleted.\nOn 3 June, a barrage of Grad rockets was fired at Israel from Tasil, setting off sirens in northern Israel and the Golan Heights. The rockets struck open areas near Ramat Magshimim, and the IDF responded with artillery fire. A second barrage was fired minutes later, but it is unclear if it came from Syria. A group called the \"Martyr Muhammad al-Deif Brigades\" claimed responsibility for the attack.\nOn 12 June, Syrian sources reported that around 100 Israeli soldiers raided Beit Jinn, killing one person and detaining seven others. The IDF said that it arrested several Hamas operatives who were planning attacks on Israel and also uncovered weapons in the area, although villagers denied ties with Hamas.\nOn 19 June, Israeli forces advanced at least 1.5&nbsp;km into several towns in the Quneitra Governorate. According to local sources, Israeli soldiers destroyed at least fifteen homes, agricultural and forest areas.\nOn 13 July, the IDF announced that it seized over three tons of weapons such as bombs, anti-tank mines, and rockets from military facilities in southern Syria that belonged to the Assad government.\nOn 27 August, Israeli helicopters landed on a hilltop near Damascus and dropped off troops near the Jabal Manea airbase, where they conducted a two-hour operation before withdrawing.\nOn 14 September, the IDF carried out a ground operation in Daraa province and carried out searches in the towns of Jamla and Saysoun.\nAirstrikes\n2024\nOn 8 December 2024, the Israeli Air Force conducted targeted operations against weapons storage facilities, which Israel considered strategic threats, across southern Syria to prevent them from falling into the hands of opposition forces. Israeli officials claimed that the targets included small stockpiles of chemical weapons, mainly mustard gas and VX gas, radar-equipped batteries, vehicles of Russian-made air defense missiles, and stockpiles of Scud missiles. The White Helmets reported that: \"there was no evidence of unusual toxic fumes during the extinguishing of the fire, and no cases of suffocation were observed among civilians\" Israel also reportedly launched airstrikes on Syrian intelligence and customs headquarters, with explosions reported at their locations in Damascus. Later, Israel also heavily shelled Mezzeh Air Base.\n]]\nIn the early hours of 9 December 2024, Israel conducted several airstrikes across the Daraa and Suwayda Governorates in southern Syria. Six airstrikes were reported at an airbase north of Suwayda, while multiple others targeted ammo depots in Nawa and the Daraa countryside. By evening, the Israeli Air Force and Navy had struck naval assets in the Port of Latakia, and an alleged chemical weapons production center in Barzeh, and Qamishli Airport in northern Syria. These roughly 200 airstrikes, including strikes on Damascus, Daraa, Latakia, and Hama, destroyed dozens of fighter jets and helicopters in the first phase and the entire Syrian naval fleet in the second. An Israeli senior official said airstrikes \"would persist in the coming days\".\nIn the morning of 10 December, photographs revealed sunken Osa-class missile boats in the Port of Latakia after overnight Israeli strikes. The IDF announced that its air force and navy conducted over 480 strikes in Syria in the span of 48 hours, 350 of which targeted airfields, anti-aircraft batteries, missiles, drones, fighter jets, tanks, and weapon production sites, destroying between 70% and 80% of Syria's strategic weapons. It added that 15 naval vessels were destroyed in strikes on Minet el-Beida and Latakia. Overnight on 16 December, Israel struck radar and air defense systems in Tartous and Damascus, with the strikes on Tartous using notably heavy munitions. In the eight days since the fall of the Assad government, Israel struck Syria around 600 times. Al Jazeera correspondent Resul Serdar said that \"Israel is pursuing a strategy of diminishing this country's air defence capability and also its air forces.\" A senior Israeli security source described it as the \"largest air operation carried out by its air force in its history\". A former rebel commander claimed that they will \"need decades to rebuild a national Syrian army\".\nA Turkish newspaper report alleged that Assad gave information about Syrian military sites to Israel in exchange for safe passage out of the country.\nOn December 18, Netanyahu promised that he would not strike the area near the prison close to Damascus where American journalist Austin Tice might be held. His mother had sent him a letter two days earlier, urging him to halt Israel's airstrikes in Syria to enable the search for him to continue.\nOn 29 December 11 people, mostly civilians, were killed in what is believed to be an Israeli airstrike on a former Syrian Army weapons depot in Adra, near Damascus.\n2025\nOn 15 January, the Israeli Air Force struck a Hay'at Tahrir al-Sham vehicle convoy in Quneitra Governorate, killing two HTS personnel and the mayor of a local village. It was the first time Israel targeted HTS forces since the fall of the Assad regime.\nOn 25 February, Syria condemned Israel's occupation of Syrian lands at its national dialogue and demanded Israel's withdrawal. Hours later, Israel conducted a wave of airstrikes in Damascus and southern Syria, one day after it demanded the Syrian caretaker government demilitarize in Quneitra, Daraa, and Suwayda. At least two people were killed southwest of Damascus.\nOn 10 March, the IDF said that it conducted airstrikes on radar systems, detection equipment, and military sites and headquarters storing weapons and equipment in Daraa Governorate. It deployed 22 fighter jets in the strikes, which dropped over 60 munitions on dozens of sites. Syrian sources reported strikes in Izra and Jabab on military sites that belonged to the 12th Brigade and the 89th Battalion of the Syrian Army under Assad.\nOn 13 March, the IDF struck the home of Palestinian Islamic Jihad leader Ziyad al-Nakhalah in Dummar, which it said served as a PIJ headquarters. Although the home was empty, one person was reportedly killed in the strike.\nOn 17 March, the IDF said that it conducted strikes on command centers and military posts that contained weapons and vehicles belonging to the Assad regime in southern Syria. The Syrian Arab News Agency reported that two people were killed and 19 others were injured in a strike in Daraa.\nOn 21 March, the IDF said that it conducted airstrikes against military targets in Palmyra and the Tiyas Air Base in Homs Governorate. At least two Syrian security personnel were reportedly injured.\nOn 25 March, IDF killed four civilians in Kuya village in Yarmouk Basin in the western countryside of Daraa.\nOn 2 April, Israel carried out 11 airstrikes on Damascus and Hama.\nOn 3 April, Israeli forces launched airstrikes on Daraa, killing at least 11 people and Israeli warplanes dropped leaflets, warning of the presence of \"gunmen\" in the area.\nOn 30 April, the IDF said that it carried out a drone strike on the outskirts of Damascus against an armed group allegedly preparing to attack the Druze community in Suwayda. The Syrian government said that a security officer was killed and several others were injured. This came after Mowafaq Tarif, a Druze leader in Israel, pressed the Israeli government to \"act\" in the interests of the minority religious group.\nOn 2 May, the IDF launched airstrikes near the presidential palace in Damascus, warning the Syrian military to halt its offensive against the Druze. Later that day, SOHR reported at least 20 Israeli strikes on military sites in Syria. According to SANA, the strikes occurred in  Damascus, Latakia, Hama, and Daraa, killing one in Harasta and injuring four others in Hama. Four Druze militants were killed in a drone strike of unclear origin on a farm in Kanaker, but SANA blamed the attack on Israel.\nOn 30 May, the IDF said that it conducted airstrikes on facilities storing anti-ship missiles \"that posed a threat to international and Israeli maritime freedom of navigation\" and surface-to-air missile components in the Latakia area. SOHR reported that military sites on the outskirts of Tartus and Latakia were hit, and SANA reported that a civilian was killed and three others were injured near Zama, Jableh District.\nOn 4 June, the IDF said that it had launched airstrikes on weapons belonging to Syria shortly after two projectiles were launched from Syrian territory into the Golan Heights, which Katz held al-Sharaa responsible for. The Syrian foreign ministry said the attacks caused \"significant human and material losses\" in southern Syria. SOHR reported \"violent explosions\" in southern Syria, especially Quneitra and Daraa. On 8 June, IAF bombed a vehicle in southern Syria claiming to have killed a Hamas member, two others were injured as well.\nOn 16 July, the IDF bombed the entrance to the Syrian military headquarters in Damascus as a warning, citing security concerns over the Syrian army's deployment to Suwayda to restore order amid the July 2025 southern Syrian clashes. Heavier strikes targeted the Syrian military headquarters complex and caused vast damage and destruction to the main building, later strikes targeted the vicinity of the Presidential Palace in Damascus. The Syrian Ministry of Health reported at least three killed and 34 injured as a result of the attacks. Airstrikes were also conducted by Israel on the same day on multiple targets across the Suwayda and Daraa governorates, including the al-Tha'lah Military Airbase and other military targets.\nOn 26 August, Israeli drone strikes in the Damascus suburb of Al-Kiswah killed eight Syrian soldiers, who SANA reported had uncovered surveillance equipment while on patrol. Airstrikes in the area continued for a second day, aiming to prevent soldiers from entering the area, although Syrian troops were able to destroy some of the equipment and recover the bodies.\nExpansion of occupation\nBefore the invasion, the Purple Line formed the mutually recognized and UN approved ceasefire line between the Israeli-occupied and Syrian controlled parts of the Golan. The Quneitra Crossing was the official crossing point, used by UN personnel and Druze residents of the Golan.\nFollowing the invasion and expanded Israeli occupation, a new line demarcating Israeli positions formed to the north. One checkpoint is north-west of Hadar, Syria, while others are at the entrances to other villages. There are also reports of checkpoints between Beqaasem, Rima, and Arnah and overlooking the Jabal Barbar mountain on the heights of Mount Hermon. Beyond checkpoints, the IDF has been constructing a  deep trench.\nPeace efforts\nSince late June 2025, Israel and Syria have been engaged in U.S.-brokered \"advanced talks\" aimed at ceasing hostilities and normalizing relations. The possibility of Syria joining the Abraham Accords has been raised, although Israel has insisted on retaining its control over the Golan Heights. Syrian Foreign Minister Asaad Al-Shaibani stated that Syria aspires to return to the terms of the 1974 Disengagement agreement. Among the key obstacles is Syria's demand that Israel cease operating or striking targets within Syrian territory. Israeli media have reported proposals involving Syria possibly regaining a third of the Golan Heights and annexing Sunni regions in North Lebanon and the Beqaa Valley, including the city of Tripoli, in exchange for peace with Israel.\nOn August 20, 2025, the official Syrian News Agency issued an official statement that Syrian Foreign Minister Asaad al-Shaibani met in Paris with an Israeli delegation \"to discuss a number of issues related to strengthening stability in the region and in southern Syria.\" A few days later, Syrian President Ahmed al-Sharaa claimed that a security agreement with Israel was at an advanced stage, and emphasized that he would not hesitate to publicly reach a peace agreement with Israel if it benefited Syria and the region. During his visit to Washington, D.C. in November 2025, al-Sharaa stated that they are in direct negotiations with Israel, and reiterated that Israel should withdraw to their pre-December 8 borders before a final agreement can be reached.\nReactions\nInvolved parties\n* : In December 2024, Israel's government said it was conducting a temporary military operation, that the United States had been notified prior to going in, and that the State of Israel \"does not interfere in the domestic conflict within Syria\". The IDF later said that they \"may end up staying there for the foreseeable future\". Yair Lapid, the Leader of the Opposition, supported the operation but criticized Netanyahu's management, saying: \"I would not have gone to the border to make provocative statements to the press and put us in conflict with the new Syrian government.\" On 11 February 2025, Israeli Army Radio reported that the IDF's presence in Syria would be prolonged throughout 2025. On 23 February 2025, Israeli Prime Minister Benjamin Netanyahu demanded the complete demilitarization of southern Syria in the provinces of Quneitra, Daraa and Suweyda, and the withdrawal of Syrian forces from Syrian territory south of Damascus. Israeli Defense Minister Israel Katz said that Israeli forces would remain in southern Syria \"for an indefinite period of time to protect our communities and thwart any threat.\"\n*  Syria: Syrian then-de facto leader Ahmed al-Sharaa, who became president in 2025, declared that Syria remains committed to the 1974 agreement and does not seek conflict with Israel or any other country. He also stated that Syria will not allow its territory to be used to attack other countries, including Israel. Syria's UN ambassador, Qusay al-Dahhak, called on the UN Security Council to compel Israel to immediately cease its attacks and withdraw to the Purple Line (ceasefire line). Al-Sharaa criticized Israel's actions, saying they cannot be justified, but also emphasized that Syria is not in a position to be drawn into a new conflict.\nInternational\n* : The Arab League condemned \"attempts to expand occupation in the Golan Heights or to unilaterally nullify the 1974 disengagement agreement, actions that flagrantly violate international law.\"\n* : Egypt condemned Israel for \"exploiting Syria's current instability to expand its occupation and impose a new fait accompli, a clear violation of international law.\"\n* : The Foreign ministry asked Israel \"to withdraw from the zone and to respect Syria's sovereignty and territorial integrity\", describing the military deployment as a violation of the 1974 agreement.\n* : The Foreign Ministry spokesman said that \"This aggression is a flagrant violation of the United Nations Charter,\" and \"We demand an immediate response from the UN Security Council to stop the aggression and hold the occupation regime accountable.\"\n* : The Foreign ministry issued a statement condemning the Israeli attacks on Syria as an \"action [that] is a blatant violation of international law and relevant international resolutions\" and called on the UN Security Council to \"fulfill its responsibilities by condemning this blatant aggression and taking necessary measures to end these violations.\"\n* : Deputy Prime Minister and Foreign Minister Ayman Safadi condemned the move, stating that \"it violates international law\". On 26 February 2025, King Abdullah II of Jordan condemned Israeli attacks on Syria.\n* : The spokesperson for the Foreign office asserted that the move was a serious violation of international law and a dangerous development in an already volatile region. and also expressed full support for Syria's sovereignty and territorial integrity and called for immediate international action to end Israel's violations.\n* : Qatar condemned the Israeli incursion, which it considered \"a dangerous development; a blatant attack on the sovereignty and unity of Syria; and a flagrant violation of international law.\"\n* : The Foreign ministry denounced Israel's activities, stating that it will \"ruin Syria's chance of restoring its security.\"\n* : President Recep Tayyip Erdoğan said that \"I say it clearly that the path the Israeli government insists on and obstinately maintains is, in fact, not a true path. Security cannot be achieved by spilling more blood, by dropping more bombs on innocent civilians. This applies not only to Gaza and Palestine, but also to Syria.\" The foreign ministry strongly condemned Israel's entry into the buffer zone between Israel and Syria and its advance into Syrian territory. The ministry also added that Israel's actions showed an \"occupation mentality\", especially at a critical time when peace and stability in Syria were on the way. Turkey reiterated its support for Syria's sovereignty, political unity and territorial integrity.\n* : Secretary-General Antonio Guterres's spokesman Stephane Dujarric said that Israel expanding its occupation was a violation of the 1974 agreement. On 10 December, Dujarric stated that: \"We're against these types of attacks. I think this is a turning point for Syria. It should not be used by its neighbors to encroach on the territory of Syria.\" On 20 February, UN envoy Geir Pedersen stated that: \"the Israelis need to withdraw\".\n* : The foreign ministry condemned Israel for occupying the buffer zone.\n* : State Department Spokesman Matthew Miller said that \"Every country has the right to take action against terrorist organizations and every country, I think, would be worried about a possible vacuum that could be filled by terrorist organizations on its border,\" stating that the Israeli incursion \"is a temporary action that they have taken in response to actions by the Syrian military to withdraw from that area.\" U.S. Secretary of State Antony Blinken said that \"The stated purpose of those actions by the Israelis is to try to make sure that the military equipment that's been abandoned by the Syrian army doesn't fall into the wrong hands – terrorists, extremists, et cetera. But we'll be talking – we're already talking – to Israel, we're talking to others, about the way ahead\".\nAnalysis\nIn an interview to Al Jazeera, Robert Geist Pinfold – lecturer in International Peace and Security at Durham University – opined, \"The Golan Heights is supposed to be a buffer zone to protect the rest of Israel. So now what Israel is doing is basically arguing that it needs a buffer zone, to protect its buffer zone, that's protecting the rest of Israel, and you have to wonder where does all this end.\" Residents of the region expressed similar comments, saying that they're not sure how long Israel will stay, especially if they plan to keep the borders quiet \"by force.\" Others agreed that the future is uncertain, given that the situation has \"changed completely.\" Former Israeli prime minister Ehud Olmert disagreed, saying that Israel has \"enough problems to deal with\", and questioned the idea of expanding the buffer zone further.\nAccording to Axios, the Trump administration believes that Netanyahu bombed Syria in July 2025 because of domestic pressure from the Israeli Druze minority and other political considerations.\nSee also\n* Quneitra Governorate clashes (2012–2014)\n* August 2024 Nabatieh attack\n* 2024 Masyaf raid\n* Syria missile strikes (September 2018)\n* Syria missile strikes (August 2019)\n* November 2019 Israeli missile strikes in Syria\n* Syria missile strikes (January 2021)\n* Israeli airstrike on the Iranian consulate in Damascus\n* 2023 Israel strikes in Syria\n* 2023 Damascus airstrike\n* 2024 Homs airstrikes\n* Druze–Syria clashes (2025–present)\n* July 2025 Damascus airstrikes\nNotes\nReferences\nExternal links\n*[https://www.hrw.org/news/2025/09/17/syria-israel-forcibly-displaces-villagers-in-occupied-south Syria: Israel Forcibly Displaces Villagers in Occupied South] - Human Rights Watch"
    }
  ]
}