{
  "content": [
    {
      "type": "text",
      "text": "# It's a Battlefield\n\n'It's a Battlefield' is an early novel by Graham Greene, first published in 1934. Graham Greene later described it as his \"first overtly political novel\". Its theme, said Greene, is \"the injustice of man's justice.\" Later in life, Greene classified his major books as \"novels\" and his lighter works as \"entertainments\"; he ranked ''It's a Battlefield as a novel and not a mere entertainment.\nTitle\nThe title It's a Battlefield'' is explained by the epigraph, which Greene took from the account of the battle of Inkerman in Alexander Kinglake's The Invasion of the Crimea. The amount of fog during the battle led to many of the troops on both sides being cut off in terrain reduced to \"small numberless circlets commensurate with such ranges of vision as the mist might allow at each spot.... In such conditions, each separate gathering of English soldiery went on fighting its own little battle in happy and advantageous ignorance of the general state of the action; nay, even very often in ignorance of the fact that any great conflict was raging.\"\nBackground\nThe novel explores the intersecting lives of those close to the bus driver Drover in the days before he is due to hang. His Communist colleagues want him to die because this will gain support for the party; his wife and brother begin an affair. There is no hero. With few exceptions, the characters are deliberately depicted as, in one critic's view, \"mediocre, bleak, uninspiring and at times perverted and stupid\". Some of the characters seem only half complete. The resulting interplay of selfish, driven characters creates what Greene called \"a panoramic novel of London\". In this panorama, the traditional detective story is (sometimes using postmodern techniques) turned on its head.; the hidden villains, according to one critic, are class and capitalism.\nPlot\nThe Assistant Commissioner of the Metropolitan Police, newly appointed after a career in the Far East, is summoned to a meeting with an assistant to the Home Secretary, who has to decide whether to reprieve Drover. During a demonstration, this Communist bus driver knifed a policeman who was about to strike his wife and is sentenced to hang. Drover's fate affects a wide circle of other people. His wife Milly goes to visit the policeman's widow and then seeks comfort with Drover's brother Conrad, who is consumed with guilt over his incest. Milly's sister Kay goes to bed with Surrogate, a rich economist who is a Communist, and then with Jules, who works in the Soho café where the Communist journalist Conder lodges. Both Surrogate and the Assistant Commissioner try to enlist the aid of the society hostess, Caroline Bury. All are unsure how far they should try to save Drover, who faces long imprisonment if he does not hang. Conrad, feeling he ought to act, blackmails a pawnbroker into selling him a revolver and shoots at the Assistant Commissioner. The gun was loaded with blanks however, and Conrad is knocked down by a car as he fires. Unknown to either, the Home Secretary has already reprieved Drover.\nReviews\nThough at first it sold few copies, the novel was praised by Ezra Pound and Ford Madox Ford. (Later the book was to sell 120,000 copies) Writing in the Spectator, V. S. Pritchett found great merit in what he called an adventurous, intelligent, \"genuine modern novel\". The New York Times thought it \"engrossing, alive, and decidedly well worth reading\" That reviewer praised Greene's \"cinematographic\" style, and Greene later said that the novel was \"intentionally based on film technique\" (Surprisingly, and to Greene's lasting amusement, it was one of the few novels he wrote that was never made into a film.) The novel's style is also influenced by Ulysses, The Waste Land, Mrs Dalloway and, as Greene admitted, Joseph Conrad. He alludes to Conrad by naming Drover's brother after him.\nReception\nA few months after publication, a grisly murder occurred in London strikingly similar to a fictional murder described in (but only tangential to the main plot of) the novel, and Greene feared the police would arrest him. Other similarities with real life were less accidental. The somewhat sleazy character named Surrogate was modelled after John Middleton Murry. Lady Caroline Bury was inspired by Lady Ottoline Morrell. And the Assistant Commissioner, perhaps the most vivid and humane character in the book, was in part based on Greene's uncle and perhaps also in part on a friend named Turner. As for settings, Greene visited a matchbook factory and Wandsworth Prison before writing about those locations in his novel. (Factory and prison are deliberately described using similar language.)\nIn 1948, Greene extensively revised the novel for the third edition and his changes were incorporated in future printings. Greene's handwritten revisions were offered for sale in 2010 for $40,000.\nMalian writer Yambo Ouloguem was accused of plagiarism after he included passages from ''It's a Battlefield'' in a 1968 novel.\nNotes"
    }
  ]
}