{
  "content": [
    {
      "type": "text",
      "text": "# Italian Empire__disambig_2\n\n| title_deputy           = President  (after 1946)\n| year_deputy1           = 1946-1948\n| deputy1                = Enrico De Nicola\n| year_deputy2           = 1948-1955\n| deputy2                = Luigi Einaudi\n| year_deputy3           = 1955-1962\n| deputy3                = Giovanni Gronchi\n| event_pre              = Purchase of Assab\n| date_pre               = 1869\n| event_start            = Italian Eritrea\n| year_start             = 1882\n| event1                 = Eritrea War\n| date_event1            = 1887–1889\n| event2                 = Italian Somalia\n| date_event2            = 1889\n| event3                 = Boxer Rebellion\n| date_event3            = 1899–1901\n| event4                 = Italo-Turkish War\n| date_event4            = 1911–1912\n| event6                 = Pacification of Libya\n| date_event6            = 1923–1932\n| event7                 = 2nd Italo-Ethiopian War\n| date_event7            = 1935–1937\n| event8                 = Italian rule over Albania\n| date_event8            = 1939–1943\n| event9                 = East Africa Campaign\n| date_event9            = 1940–1941\n| event10                = North African campaign\n| date_event10           = 1940–1943\n| event_end              =\n| date_end               = 1947\n| event_post             =\n| date_post              = 1950–1960\n| life_span              = 1882–1960\n| image_flag             = Flag of Italy (1861-1946) crowned.svg\n| flag                   = Flag of Italy#Italian unification\n| flag_type              = Flag of Italy\n| flag_caption           = Flag of ItalyTop (until 1946)Bottom (from 1946)\n| image_flag2            = File:Flag of Italy (2003–2006).svg\n| image_coat             =\nLeft (until 1946)Right (from 1946)\n| symbol                 = coat of arms\n| capital                = Rome\n| official_languages     = Italian\n| government_type        = Monarchy (until 1946)Republic (after 1946)\n| area_km2               = 3,775,294\n| common_languages       = Somali, Amharic, Tigrinya, Oromo, Afar, Arabic, Albanian, Greek\n| title_leader           = King (until 1946)\n| leader1                = Umberto I\n| year_leader1           = 1878-1900\n| leader2                = Victor Emanuel III  (Emperor)\n| year_leader2           = 1900-1946\n| leader3                = Umberto II\n| year_leader3           = 1946\n| status                 = Colonial empire\n| motto                  = FERT(Motto for the House of Savoy) (1882–1946)\n| anthem                 = (1946–1960)\"\"\"The Song of the Italians\"(1882–1943; 1944–1946)\"\"(\"Royal March of Ordinance\")\n(1943–1944)\"\"(\"The Legend of Piave\")\n| image_map              = Italian Empire maximum extent 1942-43.png\n| map_caption            = The Italian empire at greatest extent, c. 1942.\n| image_map_size         =\n| s1 = Italy1946:Italian Republic\n| flag_s1 = Flag of Italy (2003–2006).svg\n| s2 = Vatican City1929:Vatican City\n| flag_s2 = Flag of the Vatican City.svg\n| s3 = Ethiopian Empire1936:Ethiopian Empire\n| flag_s3 = Flag of the Ethiopian Empire.svg\n| s4 = Albanian Kingdom (1928–1939)1939:Kingdom of Albania\n| flag_s4 = Flag of Albania (1939–1943).svg\n| s5 = Kingdom of Greece1941:Kingdom of Greece\n| flag_s5 = State Flag of Greece (1863-1924 and 1935-1973).svg\n| s6 = Italian Social Republic1943:Italian Social Republic\n| flag_s6 = Flag of Italy (2003–2006).svg\n| s7 = People's Socialist Republic of Albania1944:Communist Albania\n| flag_s7 = Flag of Albania (1946–1992).svg\n| s8 = Free Territory of Trieste1946:Free Territory of Trieste\n| flag_s8 = Free Territory Trieste Flag.svg\n| s9 = Socialist Federal Republic of Yugoslavia1946:SFR Yugoslavia\n| flag_s9 = Flag of Yugoslavia (1946-1992).svg\n| s10 = French Fourth Republic1946:France\n| flag_s10 = Flag of France.svg\n| s11 = United Kingdom of Libya1951:United Kingdom of Libya\n| flag_s11 = Flag of Libya.svg\n| s12 = Somali Republic1960:Somalia\n| flag_s12 = Flag of Somalia.svg\n| s13 = Kingdom of Yugoslavia1931–1941:Kingdom of Yugoslavia\n| flag_s13 = Flag of Yugoslavia.svg\n| today                  =\n| stat_year1             = 1938\n| ref_area1              =\n| stat_area1             = 3798000\n| stat_year2             = 1941\n| stat_area2             = }}\n| ref_area2              =\n| p1                     = Kingdom of Italy1882:Kingdom of Italy\n| flag_p1                = Flag of Italy (1861-1946) crowned.svg\n| p2                     = Ethiopian Empire1936:Ethiopian Empire\n| flag_p2                = Flag of the Ethiopian Empire.svg\n| p3                     = Albanian Kingdom (1928–1939)1939:Kingdom of Albania\n| flag_p3                = Flag of Albania (1939–1943).svg\n| p4                     = Kingdom of Greece1941:Kingdom of Greece\n| flag_p4                = State Flag of Greece (1863-1924 and 1935-1973).svg\n| p5                     = Kingdom of Yugoslavia\n| flag_p5                = Flag of Yugoslavia.svg\n}}\nThe Italian colonial empire (), sometimes known as the Italian Empire (Impero italiano), was a colonial empire that existed between 1882 and 1960. It comprised the colonies, protectorates, concessions and dependencies of the Kingdom of Italy in the 19th and 20th centuries. At its peak, between 1936 and 1941, the colonial empire in Africa included the territories of present-day Libya, Eritrea, Somalia and Ethiopia (the last three being officially named \"Africa Orientale Italiana\", AOI); outside Africa, Italy possessed the Dodecanese Islands (following the Italo-Turkish War), Albania (initially a protectorate, then in personal union from 1939 to 1943) and also had some concessions in China.\nThe Fascist government that came to power under the leadership of the dictator Benito Mussolini after 1922 sought to increase the size of the Italian empire and it also sought to satisfy the claims of Italian irredentists. Systematic \"demographic colonization\" was encouraged by the government, and by 1939, Italian settlers numbered 120,000–150,000 in Italian Libya and 165,000 in Italian East Africa.\nDuring World War II, Italy allied itself with Nazi Germany in 1940 and it also occupied British Somaliland, western Egypt, much of Yugoslavia, Tunisia, parts of south-eastern France and most of Greece; however, it then lost those conquests and its African colonies to the invading Allied forces by 1943. In 1947, Italy officially relinquished claims on its former colonies. In 1950, former Italian Somaliland, then under British administration, was turned into the Italian Territory of Somaliland until it became independent in 1960.\nHistory\nBackground and pre-unification era\nImperialism in Italy dates back to ancient Rome, and the Latin notion of mare nostrum (\"Our Sea\", referring to the Mediterranean) has historically been the basis for Italian imperialism, especially during the fascist era. During the Middle Ages and the modern period, the Republic of Venice and the Republic of Genoa controlled networks of \"colonies\" in the Mediterranean region known as the Venetian Empire and the Genoese Empire respectively. Between the 15th and 16th centuries, Italian explorers contributed to the colonial enterprises of other European countries in the Americas: Cristopher Columbus from Genoa served Spain, Amerigo Vespucci from Florence served Portugal, the Cabot brothers from Venice served England, and Giovanni da Verrazzano from Florence served France.\nHowever, no Italian power took an active role in the scramble for the Americas, with the notable exception of the Pope who acted as an arbiter between European colonial powers during the Renaissance. The geographical position of Italy, located in the center of an internal sea, without an open free access to the ocean, contributed to this purely Mediterranean policy. There was, nonetheless, some interest in the Americas and colonial trade. The Spanish crown often contracted out the slave trade to the Genoese, who were especially active in the port of Panama. Ferdinand I, Grand Duke of Tuscany, made the only Italian attempt to create a colony in the Americas, in what is now French Guiana, organizing in 1608 an expedition to explore the north of Brazil and the Amazon river in 1608 under the command of the English captain Robert Thornton. However, Thornton, on his return from the preparatory expedition in 1609, found Ferdinand I dead and his successor, Cosimo II, was not interested in the project. In 1651, Giovanni Paolo Lascaris, Italian nobleman and Grand Master of the Knights Hospitaller of Malta (at the time a vassal state of the Kingdom of Sicily), possessed four Caribbean islands: Saint Christopher, Saint Martin, Saint Barthélemy, and Saint Croix, which were colonized from 1651 until 1665. No other colonial attempt in the ocean was made and, by 1797, the Venetian and Genoese possessions in the Mediterranean were lost.\nScramble for an empire\nEast Africa\nEritrea War|First Italo-Ethiopian War|Majeerteen Sultanate|Sultanate of Hobyo|Hiraab Imamate|Geledi Sultanate|Banadir resistance|Slap of Tunis}}\npromoted Italian colonialism in Africa in the late 1800s.]]\nOnce unified as a nation-state in the late 19th century, Italy intended to compete with the other European powers for the new age of European colonial expansion.   It saw its interests in the Mediterranean and in the Horn of Africa, a region yet to be colonized and with access to the ocean. Italy had arrived late to the colonial race and its status as the least of the Great Powers, a position of relative weakness in international affairs, meant that it was dependent on the acquiescence of Britain, France and Germany towards its empire-building.\nItaly had long considered the Ottoman province of Tunisia, where a large community of Tunisian Italians lived, within its economic sphere of influence. It did not consider annexing it until 1879, when it became apparent that Britain and Germany were encouraging France to add it to its colonial holdings in North Africa. A last-minute offer by Italy to share Tunisia between the two countries was refused, and France, confident in German support, ordered its troops in from French Algeria, imposing a protectorate over Tunisia in May 1881 under the Treaty of Bardo. The shock of the \"Slap of Tunis\", as it was referred to in the Italian press, and the sense of Italy's isolation in Europe, led it into signing the Triple Alliance in 1882 with Germany and Austria-Hungary.\n, 1880]]\nWhile attempts were made to buy the Nicobar Islands from Denmark in 1864 and 1865, the genesis of the Italian colonial empire was the purchase in 1869 of Assab Bay on the Red Sea by an Italian navigation company which intended to establish a coaling station at the time the Suez Canal was being opened to navigation. This was taken over by the Italian government in 1882, becoming modern Italy's first overseas territory.\nduring the Mahdist War, 1893]]\nin 1896]]\nItaly's search for colonies continued until February 1885, when, by secret agreement with Britain, it annexed the port of Massawa in Eritrea on the Red Sea from the crumbling Egyptian Empire. Italian annexation of Massawa denied the Ethiopian Empire of Yohannes IV an outlet to the sea. This led Ras Alula to unsuccessfully besiege the Italian possession of Saati. He then ambushed and killed five hundred Italian troops at the Battle of Dogali. This caused the Italian government to send reinforcements, which occupied the Eritrean highlands, including Keren and Asmara in 1889. The Italian Prime Minister Francesco Crispi, who coveted Ethiopia itself, signed the Treaty of Wuchale in 1889 with Menelik II, the new emperor. This treaty ceded Ethiopian territory around Massawa to Italy to form the colony of Italian Eritrea, and – at least, according to the Italian version of the treaty – made Ethiopia an Italian protectorate. Relations between Italy and Menelik deteriorated over the next few years until the First Italo-Ethiopian War broke out in 1895, when Crispi ordered Italian troops into the country. Vastly outnumbered and poorly equipped, the result was a decisive defeat for Italy at the hands of Ethiopian forces at the Battle of Adwa in 1896. On Italy's side, the death toll was 6,889, including 4,133 Italians. The Ethiopians suffered at least 4,000 dead and 10,000 wounded.}}\nAround the same time, Italy occupied territory on the south side of the horn of Africa, forming what would become Italian Somaliland. Italy gradually secured much of this territory in the 1880s through a series of protection treaties over the Sultanate of Hobyo and the Majeerteen Sultanate in the north, and by the Hiraab Imamate and the Geledi Sultanate in the south. Starting in the 1890s, the Bimaal and Wa'dan revolts near Merca marked the beginning of Banadir resistance to Italian expansion, coinciding with the rise of the Dervish movement in the north calling for independence from the British and Italian colonisers and for the defeat of Ethiopian forces.\nItaly fought in the Mahdist War, and since 1890 it defeated Mahdist troops in the Battle of Serobeti and the First Battle of Agordat. In December 1893, Italian colonial troops and Mahdists fought again in the Second Battle of Agordat; Ahmed Ali campaigned against the Italian forces in eastern Sudan and led about 10–12,000 men east from Kassala, encountering 2,400 Italians and their Eritrean Ascaris commanded by Colonel Arimondi. The Italians won again, and the outcome of the battle constituted \"the first decisive victory yet won by Europeans against the Sudanese revolutionaries\". A year later, Italian colonial forces seized Kassala after the successful Battle of Kassala; Italy returned the city to the British at the end of the war three years later.\nForts and concessions in China\nIn 1898, in the wake of the acquisition of leased territories by Germany, Russia, Britain and France in China earlier that year, the Italian government, as a matter of national prestige and to assert Italy's great power status, demanded the cession of Sanmen Bay to serve as a coaling station. Aware that Italy did not have sufficient naval power in Asian waters to back up its demand, the Chinese imperial government rejected the ultimatum and all subsequent requests, arguing that Italy had no real political or economic interests in China. Italy's main newspaper considered this a national humiliation and claimed it made the country appear \"like a third or fourth-rate power\", provoking the fall of the Italian government. This prompted Italy to take part in the international expedition in Beijing at the outbreak of the Boxer Rebellion on 18 October 1899, and resulted in the acquisition of a concession in Tianjin in September 1901, the only example of Italian colonialism in Asia, and other minor concessions, these not administrated by the Italian government. The concession was administered by the Italian consul in Tianjin.\nNorth Africa and Dodecanese\n, 1911]]\nA wave of nationalism that swept Italy at the turn of the 20th century led to the founding of the Italian Nationalist Association, which pressed for the expansion of Italy's empire. Newspapers were filled with talk of revenge for the humiliations suffered in Ethiopia at the end of the previous century, and of nostalgia for the Roman era.\nLibya, it was suggested, as an ex-Roman colony, should be \"taken back\" to provide a solution to the problems of Southern Italy's population growth. Fearful of being excluded altogether from North Africa by Britain and France, and mindful of public opinion, Prime Minister Giovanni Giolitti ordered the declaration of war on the Ottoman Empire, of which Libya was part, in October 1911.\nAs a result of the Italo-Turkish War, Italy gained Libya (then divided in the colonies of Tripolitania and Cyrenaica) the Dodecanese Islands from the Ottoman Empire.\nThe 1912 Libya desert war featured the first use of an armoured  fighting vehicle in military history and marked the first significant employment of air power in warfare.  Furthermore, the Italian dirigibles P2 and P3 discover and make a highly effective bombing attack against Ottoman Army cavalry during a battle at Zanzur in the Italo-Turkish War, making an important contribution to the Italian Army's offense in this battle. History's first war death of a pilot occurred when an aircraft crashed during a recon sortie.}}\nA significant number of Italian settlers moved to Tripolitania and Cyrenaica, and Italian presence was still felt long after the decolonisation process began. Although native resistance to the Italian colonisers was less prevalent in Tripolitania than Cyrenaica (which waged significant guerilla warfare), a resistance group did form the short-lived Tripolitanian Republic in 1918. Although it didn't succeed in setting up a republic, it demonstrated attempts to resist colonial control. The Italian colonisers set up various infrastructure projects, most notably roads and railways. Archeology was another important feature of the Italian presence in Tripolitania, as they focused efforts in excavations in old Roman cities.\nFile:Massaua 1886. Veduta del campo Gherar. Soldati de Genio Ferrovieri fra le rotaie che avrebbero collegato Massaua a Saati (Foto Ledru e Nicorta).jpg|Italian soldiers of the Ferrovieri Engineer Regiment during the construction of the rails to connect Massawa to Saati, Italian Eritrea, 1886.\nFile: The first Locomotive arrived in Tripoli Harbor.jpg|Arrival of the first Italian locomotive in the harbor of Tripoli, Italian Tripolitania, 1912\nFile:Zaptié, Arabien.jpg|An Italian Carabiniere and a Libyan Zaptié patrolling in Tripoli, 1914\nFile:Derna - Bar e Ristorante Cirenaica - Trenio Materiale (stamped on 29 Dec 1916).jpg|Restaurant and goods train in Derna, Italian Cyrenaica, 1916\nFile:Municipi di Bengasi.jpg|The Italian Benghazi Municipio (City Hall), Italian Cyrenaica, 1920s\nFile:Albergo1938villaggioducaabruzzi.png|Hotel Albergo Villaggio Duca degli Abruzzi in the Villabruzzi village, Italian Somalia, founded in 1920\nFile:Mogadishu, Bank of Italy.jpg|Bank of Italy in Mogadishu\nFile:Offices of the Prefecture of the Dodecanese 02.jpg|Palazzo Governale (today the offices of the Prefecture of the Dodecanese) in Rhodes, built during the Italian period\nWorld War I and aftermath\nIn 1914 Italy remained neutral and did not join its ally Germany in World War I. The Allies made promises and in 1915 Italy joined them. It was promised territorial spoils mainly from Austria and Turkey.\nPrior to direct intervention in World War I, in December 1914, Italy occupied the Albanian port of Vlorë and the Sazan Island in front of it. From 1916 to 1918, Italians conducted a campaign in Albania against Austrian forces (who had occupied Northern and Central Albania in pursuing the forces of Serbia and Montenegro). In the fall of 1916, Italy started to occupy southern Albania. In 1916, Italian forces recruited Albanian irregulars to serve alongside them. Italy, with permission of the Allied command, occupied Northern Epirus on 23 August 1916, forcing the neutralist Greek Army to withdraw its occupation forces from there. In June 1917, general Giacinto Ferrero proclaimed the Italian-controlled territory in Albania to be independent under Italian protection. By 31 October 1918, French and Italian forces expelled the Austro-Hungarian Army from Albania. However, in 1920, an Albanian rebellion led the Italians to agree to return the occupied bay of Vlorë to Albania, while they annexed Sazan Island to the Italian kingdom.\nin Vlorë, Albania during World War I]]\nof 1919. The light green marked area is the territory from Anatolia allocated to an Italian sphere of influence. Sèvres was overturned by the Treaty of Lausanne of 1923 where Turkey was restored to all of Anatolia.]]\nDalmatia was a strategic region during World War I that both Italy and Serbia intended to seize from Austria-Hungary. The Treaty of London guaranteed Italy the right to annex a large portion of Dalmatia in exchange for Italy's participation on the Allied side. From 5–6 November 1918, Italian forces were reported to have reached Lissa, Lagosta, Sebenico, and other localities on the Dalmatian coast. By the end of hostilities in November 1918, the Italian military had seized control of the entire portion of Dalmatia that had been guaranteed to Italy by the Treaty of London and by 17 November had seized Fiume as well. In 1918, Admiral Enrico Millo declared himself Italy's Governor of Dalmatia. Famous Italian nationalist Gabriele D'Annunzio supported the seizure of Dalmatia, and proceeded to Zara (today's Zadar) in an Italian warship in December 1918.\nAt the concluding Treaty of Versailles in 1919, Italy received less in Europe than had been promised and none overseas mandate except for a promise of colonial compensations made on 7 May 1919 during the partition of Germany's colonies between France and Britain. To satisfy this promise, France and Britain directly or indirectly gave Italy, from 1919 to 1935, a number of territories to expand Libya (Cufra, Sarra, Giarabub, the Aouzou strip, other lands in the Sahara), Somalia (Jubaland), the Dodecanese (Kastellorizo), and Eritrea (Raheita, the Hanish islands). In April 1920, it was agreed between the British and Italian foreign ministers that Jubaland would be Italy's first compensation from Britain, but London held back on the deal for several years, aiming to use it as leverage to force Italy to cede the Dodecanese to Greece.\nFascism and the Italian Empire\n, which was a client state, was considered a territory to be annexed.]]\n, to found the New Roman Empire.]]\nIn 1922, the leader of the Italian fascist movement, Benito Mussolini, became Prime Minister and dictator. Mussolini resolved the question of sovereignty over the Dodecanese at the 1923 Treaty of Lausanne, which formalized Italian administration of both Libya and the Dodecanese Islands, in return for a payment to Turkey, the successor state to the Ottoman Empire, though he failed in an attempt to extract a mandate of a portion of Iraq from Britain.\nThe month following the ratification of the Lausanne treaty, Mussolini ordered the invasion of the Greek island of Corfu after the Corfu incident. The Italian press supported the move, noting that Corfu had been a Venetian possession for four hundred years. The matter was taken by Greece to the League of Nations, where Mussolini was convinced by Britain to evacuate Italian troops, in return for reparations from Greece. The confrontation led Britain and Italy to resolve the question of Jubaland in 1924, which was merged into Italian Somaliland.\nDuring the late 1920s, imperial expansion became an increasingly favoured theme in Mussolini's speeches. Amongst Mussolini's aims were that Italy had to become the dominant power in the Mediterranean that would be able to challenge France or Britain, as well as attain access to the Atlantic and Indian Oceans. Mussolini alleged that Italy required uncontested access to the world's oceans and shipping lanes to ensure its national sovereignty.Salerno, Reynolds Mathewson (2002). Vital crossroads: Mediterranean origins of the Second World War, 1935–1940, [https://archive.org/details/vitalcrossroadsm00sale/page/106  pp.&nbsp;105–106]. Cornell University Press This was elaborated on in a document he later drew up in 1939 called \"The March to the Oceans\", and included in the official records of a meeting of the Grand Council of Fascism. This text asserted that maritime position determined a nation's independence: countries with free access to the high seas were independent; while those who lacked this, were not. Italy, which only had access to an inland sea without French and British acquiescence, was only a \"semi-independent nation\", and alleged to be a \"prisoner in the Mediterranean\":\nin Italian Somaliland]]\nand indigenous Libyans in Tripoli, capital of Italian Tripolitania and later of Italian Libya]]\nIn the Balkans, the Fascist regime claimed Dalmatia and held ambitions over Albania, Slovenia, Croatia, Bosnia and Herzegovina, Vardar Macedonia, and Greece based on the precedent of previous Roman dominance in these regions. Dalmatia and Slovenia were to be directly annexed into Italy while the remainder of the Balkans was to be transformed into Italian client states. The regime also sought to establish protective patron-client relationships with Austria, Hungary, Yugoslavia, Romania, and Bulgaria.\nIn both 1932 and 1935, Italy demanded a League of Nations mandate of the former German Cameroon and a free hand in Ethiopia from France in return for Italian support against Germany (see Stresa Front). This was refused by French Prime Minister Édouard Herriot, who was not yet sufficiently worried about the prospect of a German resurgence.\n, 1935]]\nIn its second invasion of Ethiopia in 1935–36, Italy was successful and it merged its new conquest with its older east African colonies to create Italian East Africa (). On 9 May 1936 Mussolini proclaimed the establishment of the Italian Empire in East Africa (\"l'Impero\"), with King Victor Emmanuel III as Emperor of Ethiopia. In 1939, Italy invaded Albania and incorporated it into the Fascist state. During the Second World War (1939–1945), Italy occupied British Somaliland, parts of south-eastern France, western Egypt and most of Greece, but then lost those conquests and its African colonies, including Ethiopia, to the invading allied forces by 1943. It was forced in the peace treaty of 1947 to relinquish sovereignty over all its colonies. It was granted a trust to administer former Italian Somaliland under United Nations supervision in 1950. When Somalia became independent in 1960, Italy's eight-decade experiment with colonialism had ended.\nThe Second Italo-Ethiopian War cost Italy 4,359 killed in action—2,313 Italians, 1,086 Eritreans, 507 Somalis and Libyans, and 453 Italian laborers. Ethiopian military and civilian dead, many of them from Italian bomb and mustard gas attacks, were estimated as high as 275,000.\nIn July 1936, Francisco Franco of the Nationalist faction in the Spanish Civil War requested Italian support against the ruling Republican faction, and guaranteed that, if Italy supported the Nationalists, \"future relations would be more than friendly\" and that Italian support \"would have permitted the influence of Rome to prevail over that of Berlin in the future politics of Spain\". Italy intervened in the civil war with the intention of occupying the Balearic Islands and creating a client state in Spain. Italy sought the control of the Balearic Islands due to its strategic position – Italy could use the islands as a base to disrupt the lines of communication between France and its North African colonies and between British Gibraltar and Malta. After the victory by Franco and the Nationalists in the war, Italy pressured Franco to permit an Italian occupation of the Balearic Islands but he did not do so.\n]]\nAfter the United Kingdom signed the Anglo-Italian Easter Accords in 1938, Mussolini and foreign minister Ciano issued demands for concessions in the Mediterranean by France, particularly regarding Djibouti, Tunisia and the French-run Suez Canal. Three weeks later, Mussolini told Ciano that he intended for Italy to demand an Italian takeover of Albania. Mussolini professed that Italy would only be able to \"breathe easily\" if it had acquired a contiguous colonial domain in Africa from the Atlantic to the Indian Oceans, and when ten million Italians had settled in them. In 1938, Italy demanded a sphere of influence in the Suez Canal in Egypt, specifically demanding that the French-dominated Suez Canal Company accept an Italian representative on its board of directors. Italy opposed the French monopoly over the Suez Canal because, under the French-dominated Suez Canal Company, all Italian merchant traffic to its colony of Italian East Africa was forced to pay tolls on entering the canal.\nIn 1939, Italy invaded and captured Albania and made it a part of the Italian Empire as a separate kingdom in personal union with the Italian crown. The region of modern-day Albania had been an early part of the Roman Empire, which had actually been held before northern parts of Italy had been taken by the Romans, but had long since been populated by Albanians, even though Italy had retained strong links with the Albanian leadership and considered it firmly within its sphere of influence. It is possible that Mussolini simply wanted a spectacular success over a smaller neighbour to match Germany's absorption of Austria and Czechoslovakia. Italian King Victor Emmanuel III took the Albanian crown, and a fascist government under Shefqet Verlaci was established to rule over Albania.\nFile:Mogadishu 1923.jpg|Italian Mogadishu, 1923\nFile:Avenue in Asmara (1930s).jpg|Avenue in Asmara, 1930s\nFile:Cinema Impero in Asmara.jpg|Cinema Impero in Asmara\nFile:Maydan Shajara Piazza Cagni During Italian Rule.jpg|Women in Piazza Cagni in Benghazi, Italian Libya, 1938\nFile:Italo Balbo welcomes Italian Colonists in Libya (1938).jpg|Governor Italo Balbo welcomes arriving Italian colonists in Tripoli, Italian Libya, 1938\nWorld War II\nled Italian forces at the Battle of Amba Alagi.]]\nMussolini entered World War II in June 1940 on the side of Adolf Hitler with plans to enlarge Italy's territorial holdings. He had designs on an area of western Yugoslavia, southern France, Corsica, Malta, Tunisia, part of Algeria, an Atlantic port in Morocco, French Somaliland and British-controlled Egypt and Sudan.\n]]\nOn 10 June 1940, Mussolini declared war on Britain and France; both countries had been at war with Nazi Germany since September of the previous year. In July 1940, Italian foreign minister Count Ciano presented Hitler with a list of Italy's goals that included: the annexation of Corsica, Nice, and Malta; protectorate in Tunisia and a buffer zone in Eastern Algeria; independence with Italian military presence and bases in Lebanon, Palestine, Syria, and Transjordan as well as expropriation of oil companies in those territories; military occupation of Aden, Perim and Sokotra; Cyprus given to Greece in exchange for Ionian islands and Ciamuria given to Italy; Italy is given British Somaliland, Djibuti, French Equatorial Africa up to Ubangi-Shari, as well as Ciano adding at the meeting that Italy wanted Kenya and Uganda as well. Hitler made no promises.\nIn October 1940, Mussolini ordered the invasion of Greece from Albania, but the operation was unsuccessful. In April 1941, Germany launched an invasion of Yugoslavia and then attacked Greece. Italy and other German allies supported both actions. The German and Italian armies overran Yugoslavia in about two weeks and, despite British support in Greece, the Axis troops overran that country by the end of April. The Italians gained control over portions of both occupied Yugoslavia and occupied Greece. A member of the House of Savoy, Prince Aimone, 4th Duke of Aosta, was appointed king of the newly created Independent State of Croatia.\nDuring the height of the Battle of Britain, the Italians launched an invasion of Egypt in the hope of capturing the Suez Canal. By 16 September 1940, the Italians advanced  across the border. However, in December, the British launched Operation Compass and, by February 1941, the British had cut off and captured the Italian 10th Army and had driven deep into Libya. A German intervention prevented the fall of Libya and the combined Axis attacks drove the British back into Egypt until summer 1942, before being stopped at El Alamein. Allied intervention against Vichy French-held Morocco and Algeria created a two-front campaign. German and Italian forces entered Tunisia in late 1942 in response, however, forces in Egypt were soon forced to make a major retreat into Libya. By May 1943, Axis forces in Tunisia were forced to surrender.\nThe East African Campaign started with Italian advances into British-held Kenya, British Somaliland, and Sudan. In the summer of 1940, Italian armed forces successfully invaded all of British Somaliland. But, in the spring of 1941, the British had counter-attacked and pushed deep into Italian East Africa. By 5 May, Haile Selassie I of Ethiopia had returned to Addis Ababa to reclaim his throne. In November, the last organised Italian resistance ended with the fall of Gondar. However, following the surrender of East Africa, some Italians conducted a guerrilla war which lasted for two more years.\nIn November 1942, when the Germans occupied Vichy France during Case Anton, Italian-occupied France was expanded with the occupation of Corsica.\nEnd of the empire\n]]\nand the former FIAT centre in the 1960s]]\nIn November 1941 the Italian Army was expelled by British and Commonwealth forces first from East Africa (East African Campaign), by the autumn of 1943, the Italian Empire and all dreams of an Imperial Italy effectively came to an end. On 7 May, the surrender of Axis forces in Tunisia and other near continuous Italian reversals, led King Victor Emmanuel III to plan the removal of Mussolini. Following the Invasion of Sicily, all support for Mussolini evaporated. A meeting of the Grand Council of Fascism was held on 24 July, which managed to impose a vote of no confidence to Mussolini. The \"Duce\" was subsequently deposed and arrested by the King on the following afternoon. Afterwards, Mussolini remained a prisoner of the King until 12 September, when, on the orders of Hitler, he was rescued by German paratroops and became leader of the newly established Italian Social Republic.\nAfter 25 July, the new Italian government under the King and Field Marshal Pietro Badoglio remained outwardly part of the Axis. But, secretly, it started negotiations with the Allies. On the eve of the Allied landings at Salerno, which started the Allied invasion of Italy, the new Italian government secretly signed an armistice with the Allies. On 8 September, the armistice was made public. In Albania, Yugoslavia, the Dodecanese, and other territories still held by the Italians, German military forces successfully attacked their former Italian allies and ended Italy's rule. During the Dodecanese Campaign, an Allied attempt to take the Dodecanese with the cooperation of the Italian troops ended in total German victory. In China, the Imperial Japanese Army occupied Italy's concession in Tientsin after getting news of the armistice. Later in 1943 the Italian Social Republic formally ceded control of the concession to Japan's puppet regime in China, the Reorganized National Government of China under Wang Jingwei. In the spring of 1943 Italian forces were expulsed from North Africa (North African Campaign).\nItalian troops stationed in Albania, the Dodecanese, and other Greek islands amid violent episodes such as the Massacre of Cephalonia were withdrawn starting in September 1943 after the fall of Mussolini and Italy’s subsequent surrender, which marked the end of the aspiration to make Italy a world power. After the end of the Second World War, Italy was stripped of all its possessions by the Treaty of Paris of 1947.\nAs a result, minor border adjustments were also made with France, and Italy ceded to Yugoslavia the city of Fiume, the territory of Zara, the islands of Lagosta and Pelagosa, the upper valley of the Isonzo River, and most of Istria and the Karst region of Trieste and Gorizia. The treaty led to the loss of all Fascist-era colonies, while the fate of the pre-Fascist colonies was decided by the United Nations, which assigned the Dodecanese to Greece, placed Libya under Anglo-French administration, and handed Eritrea over to Britain. In 1949 the United Nations allowed Italy to exercise a trusteeship over Somalia. Under president Giovanni Gronchi on 1 July 1960 the Italian Empire officially fell  with the independence of the Somali Republic, formed through the union of Italian Somalia with British Somaliland.\nFormer colonies, territories in personal union and occupied areas\n*Italian Eritrea (1882–1947)\n*Italian Somalia (1889–1947)\n**Trans-Juba (1924–1926)\n**Italian Territory of Somalialand (1950–1960)\n*Italian Libya (1911–1947)\n**Italian Tripolitania and Italian Cyrenaica (1911–1934)\n*Italian East Africa (1936–1941)\n**Italian Ethiopia (1936–1941)\n*Italian Tientsin (China)  (1901-1943)\n*Italian Albania (annexed later in the kingdom 1939–1943)\n* Italian Islands of the Aegean (Greek Islands) (1912–1947)\n*Italian occupation of France (1940–1943)\n**Italian occupation of Corsica (1942-1943)\n*Italian State of Croatia (1941–1945)\n*Italian Montenegro (1941–1943)\n*Hellenic State (Greece) (1941–1943)\n*Tunisia (1942–1943)\nNotes\nReferences\nBibliography\n* Andall, Jacqueline and Derek Duncan, eds. (2005). Italian Colonialism: Legacy and Memory.\n* Ben-Ghiat, Ruth and Mia Fuller, eds.  (2005). Italian Colonialism.\n*\n*\n*\n*\n*\n* Finaldi, Giuseppe (2016). A History of Italian Colonialism, 1860–1907: Europe’s Last Empire (Taylor & Francis).\n* Hofmann, Reto (2015). The Fascist Effect: Japan and Italy, 1915–1952 (Cornell UP) [https://www.jstor.org/stable/10.7591/j.ctt20d88b6 online]\n*\n*\n* Kelly, Saul (2000). \"Britain, the United States, and the end of the Italian empire in Africa, 1940–52.\" Journal of Imperial and Commonwealth History 28.3: 51–70.\n* Kelly, Saul (2000). Cold War in the Desert: Britain, the United States & the Italian Colonies, 1945–52.\n*\n*\n* McGuire, Valerie (2020). ''Italy's Sea: Empire and Nation in the Mediterranean, 1895–1945 (Liverpool University Press).\n* Marinelli, Maurizio and Giovanni Andornino (2014). Italy's Encounter with Modern China: Imperial dreams, strategic ambitions, New York: Palgrave Macmillan.\n*\n* Palumbo, Patrizia (2003). Place in the Sun: Africa in Italian Colonial Culture from Post-Unification to the Present, since 1860.\n*\n* Pergher, Roberta (2017). Mussolini's Nation-Empire: Sovereignty and Settlement in Italy's Borderlands, 1922–1943 (Cambridge UP).\n* Poddar, Prem, and Lars Jensen, eds. (2008). A historical companion to postcolonial literatures: Continental Europe and Its Empires'' (Edinburgh UP), \"Italy and its colonies\" pp 262–313. [https://www.amazon.com/Historical-Companion-Postcolonial-Literatures-Continental/dp/0748623949/ excerpt]\n* Renzi, William A.  (1968). \"Italy's neutrality and entrance into the Great War: a re-examination.\" American Historical Review 73.5: 1414–32.  [https://www.jstor.org/stable/1851376 online]\n* Shinn, Christopher A. (2016). \"Inside the Italian Empire: Colonial Africa, Race Wars, and the ‘Southern Question’\", in Shades of Whiteness (Brill), pp. 35–51.\n* Srivastava, Neelam (2018). Italian Colonialism and Resistances to Empire, 1930–1970 (Palgrave Macmillan).\n* Steinmetz, George (2018). \"Ruth Ben-Ghiat’s Italian Fascism’s Empire Cinema.\" American Journal of Cultural Sociology 6.1: 212–22 [https://www.researchgate.net/profile/George_Steinmetz/publication/307867589_Ruth_Ben-Ghiat%27s_Italian_Fascism%27s_Empire_Cinema/links/5ead8ef6299bf18b958f122a/Ruth-Ben-Ghiats-Italian-Fascisms-Empire-Cinema.pdf online].\n* Tripodi, Paolo (1999). Colonial Legacy in Somalia: Rome & Mogadishu from Colonial Administration to Operation Restore Hope, covers 19th century to 1999.\n* Wright, Patricia (1973). \"Italy's African Dream: Part I, The Adowa Nightmare\". History Today (Mar), Vol. 23, Issue 3, pp.&nbsp;153–60, online:\n**\"Italy's African Dream. Part 2: Fatal Victory, 1935–6.\" History Today (April 1973), Vol. 23, Issue 4, pp.&nbsp;256–65.\n** \"Italy's African Dream. Part 3: Nemesis in 1941,\" History Today (May 1973), Vol. 23, Issue 5, pp.&nbsp;336–34.\nExternal links\n*  [http://amshistorica.unibo.it/diglib.php?inv=166 Atlas of Italian colonies], written by Baratta Mario and Visintin Luigi in 1928\n* Simona Berhe: [https://encyclopedia.1914-1918-online.net/article/colonies_italy/ Colonies (Italy)], in: [https://encyclopedia.1914-1918-online.net/home.html/ 1914-1918-online. International Encyclopedia of the First World War]."
    }
  ]
}