{
  "content": [
    {
      "type": "text",
      "text": "# Italian battleship Vittorio Veneto__disambig_1\n\n{|\n|Ship name=Vittorio Veneto\n|Ship namesake=Battle of Vittorio Veneto\n|Ship operator=Regia Marina\n|Ship ordered=10 June 1934\n|Ship builder=Cantieri Riuniti dell'Adriatico (C.R.D.A.), Trieste\n|Ship laid down=28 October 1934\n|Ship launched=25 July 1937\n|Ship sponsor=Signora Maria Bertuzzi\n|Ship commissioned=28 April 1940\n|Ship decommissioned=1 February 1948\n|Ship struck=1 February 1948\n|Ship fate=Scrapped at La Spezia 1951–54\n}}\n|Ship displacement=\n*Standard:\n*Full load:\n|Ship length=\n|Ship beam=\n|Ship draft=\n|Ship propulsion=\n*4 × steam turbines\n*4 × screw propellers\n|Ship power=\n*8 × Yarrow boilers\n*\n|Ship speed=\n|Ship range= at\n|Ship complement=1,830 to 1,950\n|Ship sensors=EC 3 ter 'Gufo' Radar\n|Ship armament=\n* 9 ×  guns\n* 12 ×  guns\n* 4 × /40 guns\n* 12 ×  anti-aircraft guns\n* 20 ×  guns\n* 20 ×  guns\n|Ship armor=*Main belt:\n*Deck:\n*Turrets: 350&nbsp;mm\n*Conning tower:\n|Ship aircraft=3 aircraft (IMAM Ro.43 or Reggiane Re.2000)\n|Ship aircraft facilities=1 stern catapult\n|Ship notes=\n}}\n|}\nVittorio Veneto was the second member of the  that served in the Italian Regia Marina (Royal Navy) during World War II. The ship's keel was laid down in October 1934, launched in July 1937, and readied for service with the Italian fleet by August 1940. She was named after the Italian victory at Vittorio Veneto during World War I, and she had three sister ships: , , and , though only Littorio and Roma were completed during the war. She was armed with a main battery of nine  guns in three triple turrets, and could steam at a speed of .\nVittorio Veneto saw extensive service during the war. The ship escaped undamaged during the British raid on Taranto in November 1940. Early in the war, she participated in the Battle of Cape Spartivento in November 1940 and the Battle of Cape Matapan in March 1941 where she was damaged by a torpedo bomber, and then she was torpedoed by the British submarine  in December 1941. She spent 1941 and early 1942 attempting to attack British convoys to Malta, but crippling fuel shortages in the Italian fleet curtailed activity thereafter. Vittorio Veneto was among the Italian ships that were surrendered to the Allies in September 1943 after Italy withdrew from the war, and Vittorio Veneto with the rest of the Italian fleet was taken into internment, spending the following three years under British control in Egypt. After the war, she was allocated as a war prize to Britain and subsequently broken up for scrap.\nDescription\nVittorio Veneto was  long overall and had a beam of  and a draft of . She was designed with a standard displacement of , a violation of the  restriction of the Washington Naval Treaty; at full combat loading, she displaced . The ship was powered by four Belluzo geared steam turbines rated at . Steam was provided by eight oil-fired Yarrow boilers. The engines provided a top speed of  and a range of  at . Vittorio Veneto had a crew of 1,830 to 1,950 over the course of her career.\nVittorio Venetos main armament consisted of nine  50-caliber Model 1934 guns in three triple turrets; two turrets were placed forward in a superfiring arrangement and the third was located aft. Her secondary anti-surface armament consisted of twelve  /55 Model 1934/35 guns in four triple turrets placed at the corners of the superstructure. These were supplemented by four  /40 Model 1891/92 guns in single mounts; these guns were old weapons and were primarily intended to fire star shells. Vittorio Veneto was equipped with an anti-aircraft battery that comprised twelve  /53 Model 1939 guns in single mounts, twenty  /54 guns in eight twin and four single mounts, and sixteen  /65 guns in eight twin mounts. EC 3 ter Gufo radar, which could detect surface targets at a range of  and aircraft at , was installed in July 1943.\nThe ship was protected by a main armor belt that was  with a second layer of steel that was  thick. The main deck was  thick in the central area of the ship and reduced to  in less critical areas. The main battery turrets were  thick and the lower turret structure was housed in barbettes that were also 350&nbsp;mm thick. The secondary turrets had 280&nbsp;mm thick faces and the conning tower had  thick sides. Vittorio Veneto was fitted with a catapult on her stern and equipped with three IMAM Ro.43 reconnaissance float planes or Reggiane Re.2000 fighters.\nService history\nConstruction\nVittorio Veneto was ordered under the 1934 construction program, and was named for the Battle of Vittorio Veneto, a decisive Italian victory over the Austro-Hungarian Empire in October&ndash;November 1918 during World War I. Her keel was laid down on 28 October 1934 at ''Cantieri Riuniti dell'Adriatico in Trieste, the same day as her sister ship . Vittorio Veneto was launched on 25 July 1937, and major construction was completed by October 1939. The fitting-out process was greatly delayed due to repeated changes to the design and shortages of heavy armor plate. Before she could begin sea trials, Vittorio Veneto was moved to Venice on 4 October to have her bottom cleaned of the fouling that had accumulated during the long fitting-out period, since the Venice Arsenal had the only drydock in Italy long enough to accommodate a ship the size of the Littorio'' class.\nOn 17 October, with the cleaning completed, the dockyard personnel flooded the drydock to conduct stability tests. The new battleship moved to Trieste on 19 October, and her trials began on 23 October. The trials, which also included tests for the ship's weaponry, lasted until March 1940, after which some additional fitting-out work was completed. She was delivered on 28 April, though she was not yet complete. On 1 May, Vittorio Veneto was sent to La Spezia for final fitting-out work, escorted by the destroyers  and . On 6 May, she was loaded with shells for her main battery; the loading work for the main and secondary guns lasted until 20 May. Later that day, she was transferred to Taranto, escorted by the destroyers  and , where she joined the 9th Division of the Italian fleet. The following month, Italy joined the war against Britain and France, though it wasn't until 2 August that Vittorio Veneto and Littorio were formally declared operational.\nWorld War II\nOn 31 August &ndash; 2 September 1940, Vittorio Veneto sortied as part of an Italian force of five battleships, ten cruisers, and thirty-four destroyers to intercept British naval forces taking part in Operation Hats and Convoy MB.3, but contact was not made with either group due to poor aerial reconnaissance and no action occurred. In addition, British aerial reconnaissance detected the oncoming Italian fleet and was able to escape. On 6 September, the fleet sortied again to attack a British force that had been reported leaving Gibraltar, but the British ships instead steamed south into the Atlantic. A similar outcome resulted from the movement against British Operation \"MB.5\" on 29 September - 1 October; Vittorio Veneto, four other battleships, eleven cruisers, and twenty-three destroyers had attempted to intercept the convoy carrying troops to Malta. In this operation, the Italian Regia Aeronautica (Royal Air Force) did locate the convoy, but the British were able to evade the Italian fleet.\nOn the night of 10&ndash;11 November, the British Mediterranean Fleet launched an air raid on the harbor in Taranto. Twenty-one Swordfish torpedo bombers launched from the aircraft carrier  attacked the Italian fleet in two waves. The Italian base was defended by twenty-one 90&nbsp;mm anti-aircraft guns and dozens of smaller 37&nbsp;mm and 20&nbsp;mm guns, along with twenty-seven barrage balloons. The defenders did not possess radar, however, and so were caught by surprise when the Swordfish arrived. The first wave struck at 20:35, followed by the second about an hour later. Vittorio Veneto was undamaged in the attack, but three other battleships were hit, two of which were severely damaged. The morning after the Taranto raid, Vittorio Veneto led the Italian fleet to Naples. There, she took over the role of fleet flagship, under the command of Admiral Inigo Campioni.\nBattle of Cape Spartivento\nOn 17 November, Vittorio Veneto and &mdash;the only operational Italian battleships&mdash;participated in an attempt to intercept the British Operation White convoy to Malta, though the forces made no contact. On 26 November, the Italian fleet made another attempt to attack a British convoy, Operation Collar, which resulted in the Battle of Cape Spartivento (known as the Battle of Cape Teulada to the Italians). Vittorio Veneto, Giulio Cesare, six cruisers, and fourteen destroyers attempted to catch a convoy steaming to Malta. The British escort included the aircraft carrier , the battleship , and the battlecruiser ; Italian aerial reconnaissance detected the escorts but exaggerated their strength and Campioni, under orders to not risk his two operational battleships against equal or stronger opponents, broke off the engagement shortly after it began. Vittorio Veneto briefly engaged several British cruisers at the extreme range 27,000 metres (17 miles). Vittorio Veneto fired 19 rounds in seven salvos from long range and slightly damaged the light cruiser Manchester; that was enough for the now outgunned British cruisers, which turned back at the fourth salvo. During the engagement, Ark Royal launched torpedo bombers against Vittorio Veneto, but the latter successfully evaded the torpedoes.\nRepeated British air attacks on Naples, one of which damaged the cruiser , prompted the high command to move Vittorio Veneto and the rest of the major warships of the fleet to Sardinia on 14 December. They were returned to Naples six days later, however, after the high command concluded that removing the fleet to Sardinia would allow British convoys from Alexandria to reach Malta with relative ease. On the night of 8&ndash;9 January 1941, the British launched an air raid with Vickers Wellington bombers on the Italian fleet in Naples, but the aircraft again failed to hit Vittorio Veneto; Giulio Cesare was slightly damaged by several near misses. Both ships were moved to La Spezia the next day, with Vittorio Veneto providing cover for Giulio Cesare. Vittorio Veneto was now the only operational battleship in the fleet. Giulio Cesare was back in service by early February, as was . The three battleships, along with eight destroyers, attempted to intercept Force H on 8 February, which was en route to bombard Genoa. The two forces did not encounter each other, and the Italian fleet returned to La Spezia.\nBattle of Cape Matapan\nnear the Island of Gavdos]]\nVittorio Veneto returned to Naples on 22 March, and four days later led an attempt to attack British shipping off Greece, in company with eight cruisers and nine destroyers. The fleet would be supported by the Regia Aeronautica and the German Fliegerkorps X (10th Air Corps). This operation resulted in the Battle of Cape Matapan; the engagement began when the Italian 3rd Division&mdash;comprising the two  heavy cruisers and  and commanded by Vice Admiral Luigi Sansonetti&mdash;encountered the British 15th Cruiser Squadron. Iachino attempted to maneuver Vittorio Veneto to the east of the British cruisers while they were distracted with Sansonetti's cruisers, but  spotted the battleship before she could close the trap. Vittorio Veneto immediately opened fire and quickly found the range, but only inflicted splinter damage on Orion, which fled to the south, back toward the main British fleet. Misfires in Vittorio Venetos forward-most turret forced her to cease firing temporarily. The Italian gunners quickly returned the guns to action, however, and resumed their bombardment of the British cruisers. Poor visibility and smokescreens hampered the accuracy of Vittorio Venetos gunners and they scored no hits, though they straddled the cruisers several times. In the course of this phase of the battle, she had fired 92 rounds from her main battery.\nDuring this period of the battle, torpedo bombers from the carrier  arrived on the scene and their attack forced Vittorio Veneto to break off the engagement with the British cruisers to take evasive action. She evaded the torpedoes, but the attack convinced Iachino that the Mediterranean Fleet was at sea, which prompted him to end the operation and return to port. The British launched several air attacks against the Italian fleet in an attempt to slow down Vittorio Veneto, including land-based Blenheim bombers from Greece and Crete. Later in the afternoon Formidable launched a second strike, and at 15:10 one of her Swordfish hit Vittorio Veneto on her port side, aft. The Italian anti-aircraft gunners shot the plane down after it launched its torpedo. The hit sheared off the port side propeller, damaged the shaft, jammed the port rudder, and disabled the aft port pumps. It also caused severe flooding&mdash;some  of water entered the ship&mdash;which gave her a 4&ndash;4.5&nbsp;degree list to port, and forced her to stop for about ten minutes. While she was immobilized, a Blenheim bomber dropped a bomb that landed near her stern; the blast caused further, minor damage to the stern.\nThe damage control parties had great difficulty in controlling and reducing the flooding, as they could use only emergency hand pumps. Some forward and starboard voids were counter-flooded to reduce the list. In the meantime, engine room personnel were able to restart the starboard shafts and steering could be effected with the backup hand-steering gear. After she got back underway, she was able to slowly increase her speed to  using only her starboard shafts. While the Italian fleet was withdrawing, Formidable launched another air strike of nine Swordfish in an attempt to slow Vittorio Veneto down. But instead of hitting the Italian battleship, they struck the cruiser Pola, leaving her dead in the water. Vittorio Veneto returned to port while two cruisers and several destroyers were detached to protect Pola; all three cruisers and two destroyers were sunk in a furious night action at very close range with the battleships , , and . Vittorio Veneto meanwhile reached Taranto on 29 March, where repairs lasted until July. She was not fully operational again until August.\nLater operations\nVittorio Veneto and Littorio participated in an unsuccessful sortie to intercept British forces on 22&ndash;25 August. The British had intended to mine Livorno and launch an air raid on northern Sardinia, but Italian agents in Spain warned the Regia Marina of the British operation when it departed Gibraltar. The Italian fleet positioned itself too far to the south, however, and aerial reconnaissance failed to locate the British. A month later, Vittorio Veneto led the attack on the Allied convoy in Operation Halberd on 27 September 1941, in company with Littorio, five cruisers, and fourteen destroyers. The British had hoped to lure out the Italian fleet and attack it with a powerful convoy escort centered on the battleships , , and . It too ended without contact with the British fleet; neither side located the other, but Italian torpedo bombers hit Nelson. At 14:00, Iachino cancelled the operation and ordered the fleet to return to port.\nOn 13 December, she participated in another operation to escort a convoy to North Africa, but the attempt was broken off after a British radio deception effort convinced the Italians that the British fleet was in the area. While returning to port the following day, Vittorio Veneto was torpedoed by the British submarine  in the Straits of Messina. Urge fired a spread of three torpedoes, but only one hit on her port side. The torpedo tore a hole  long and caused over  of water to flood the ship, though the ship's Pugliese torpedo defense system successfully contained the explosion. Vittorio Veneto took on a 3.5&nbsp;degree list to port and was down by  by the stern. Some counter flooding of a compartment on the starboard side abreast of the forward-most turret reduced the list by a degree, and she was able to steam under her own power back to port. She returned to Taranto for repairs, which lasted until early 1942.\nOn 14 June, Vittorio Veneto participated in the interception of the Operation Vigorous convoy to Malta from Alexandria. Vittorio Veneto, Littorio, four cruisers and twelve destroyers were sent to attack the convoy. The British quickly located the approaching Italian fleet and launched several air strikes early on 15 June with Wellington and Bristol Beaufort bombers in an attempt to prevent them from reaching the convoy. The aircraft scored no hits on the battleships, but they did disable the cruiser , which was later sunk by a British submarine. Later that morning another air attack, this time B-24 Liberators from the USAAF, occurred. The high-level bombers scored one hit on Littorio and several near misses around her and Vittorio Veneto, but neither ship was seriously damaged. Another British strike with Beauforts arrived shortly thereafter, but Italian and German fighters had since arrived and they shot down two Beauforts and damaged five others. By the afternoon, Iachino had concluded that he would not reach the convoy before dark, and so he broke off the operation; by then, however, the threat from the Italian battleships had led to the failure of the British operation, as the convoy had been ordered back to Alexandria, and did not reach Malta. On the return voyage, another British air attack succeeded in torpedoing Littorio.\nFate\nOn 12 November, Vittorio Veneto was moved to Naples from Taranto in response to the Allied invasion of North Africa. While en route, the British submarine  unsuccessfully attacked Vittorio Veneto. An American air raid on the harbor on 4 December prompted the Italians to withdraw the fleet to La Spezia, where it remained for the rest of Italy's active participation in the war. On 5 June 1943, Vittorio Veneto was badly damaged by an American air raid on La Spezia; she was hit by two large bombs toward the bow, though only one detonated. That bomb passed through the ship and exploded under the hull, causing serious structural damage. The damage forced her to be transferred to Genoa for repair work, since the dockyard in La Spezia had also been damaged by the attack. On 3 September, Italy signed an armistice with the Allies, ending her active participation in World War II. Six days later, Vittorio Veneto and the rest of the Italian fleet sailed for Malta, where they would be taken into internment for the remainder of the war. While en route, the German Luftwaffe (Air Force) attacked the Italian fleet using Dornier Do 217s armed with Fritz X radio-controlled bombs. Vittorio Veneto was undamaged but Littorio&mdash;by now renamed Italia&mdash;was hit and damaged and her sister  was sunk in the attack.\nVittorio Veneto remained in Malta until 14 September, when she and Italia were moved to Alexandria, Egypt and then to the Great Bitter Lake in the Suez Canal on 17 October. The two battleships remained there until 6 October 1946, when they were permitted to return to Italy. Vittorio Veneto went to Augusta, Sicily before moving to La Spezia on 14 October. In the Treaty of Peace with Italy, signed on 10 February 1947, Vittorio Veneto was allocated as a war prize to Britain. She was paid off on 3 January 1948, stricken from the naval register on 1 February, and subsequently broken up for scrap.\nVittorio Veneto had been the most active Italian battleship of the war, having participated in eleven offensive operations. Twelve 90&nbsp;mm anti-aircraft guns taken from Vittorio Veneto were reused by the Yugoslav People's Army (JNA) as armament of its Žirje Island coastal artillery battery. The battery surrendered without resistance to the Croatian National Guard on 14 September 1991, during the Croatian War of Independence, and played a pivotal role in 16&ndash;22 September Battle of Šibenik, helping defend the city of Šibenik against the JNA and bottling up in harbor 34 Yugoslav Navy's patrol boats and minesweepers, one-fourth of the Yugoslav fleet, which were eventually seized by Croatian forces.\nFootnotes\nReferences\n*\n| name-list-style = amp\n}}\n*\n}}\n*\n}}\n*\n| name-list-style = amp\n}}\n*\n}}\n*\n*\n}}\n*\n}}\n*\n}}\nExternal links\n* [https://www.marina.difesa.it/noi-siamo-la-marina/mezzi/mezzi-storici/Pagine/TUVZ/veneto_battaglia.aspx Vittorio Veneto battleships] Marina Militare website"
    }
  ]
}