{
  "content": [
    {
      "type": "text",
      "text": "# Italian Somali Wars\n\n| date              = Irregularly between 1900 and 1927\n| place             = Horn of Africa, Italian Somaliland\n| result            = Italian victory\n| combatant1        =\n*\n*\n*\nSupported by:\n* British Empire\n* (Somaliland campaign)\n| combatant2        =  Dervish Movement\n*Majeerteen Sultanate\n*Sultanate of Hobyo\n*Banadir Resistance\n| commander1        =  Maria De Vecchi\n* Hersi Gurey\n* Giacomo De Martino (governor)\n*Gustavo Pesenti\n* Antonino Di Giorgio\n* Colonel Splendorelli\n* Captain Franco Carolei\n* Giacomo Trevis\n* Antonio Cecchi\n| commander2        =  Mohamed Abdullah Hassan\nOsman Mohamoud\n*Ali Yusuf Kenadid\n*Sheikh Hassan Barsane\n* Sheikh Abdi Abikar Gafle\n* Ma’alin Mursal Abdi Yusuf\n* Haji ibrahim Gaashan\n* Omar Samatar\n* Hersi Boqor\n* Abshir Dhoore\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n| image_size        =\n| territory         = *Italy exerts control and occupies most of Italian Somaliland\n*Raids and skirmishes deep into Italian Somaliland conducted by former rebel leaders Hersi Boqor and Omar Samatar from the Ogaden\n*Continued instability in various regions\n}}\nThe Italian Somali Wars were a series of  military conflicts between the Kingdom of Italy and various Somali Sultanates and clans, from 1900 until around 1927. After the end of the Dervish war, the fascist Italian government under Benito Mussolini, ordered the conquest and occupation of the entirety of Somalia by force through the Royal Corps of Colonial Troops. This led to armed resistance and rebellions across the country.\naccepting to become a protectorate of the Kingdom of Italy in 1891]]\nFollowing two treaties in 1889, The Kingdom of Italy established a protectorate over northern Somali territories ruled by the Sultanate of Hobyo and the Majeerteen Sultanate. In the southern regions of Somalia, the Italian company “''Societa' Filonardi”'' created by Vincenzo Filonardi established protectorates in the cities of Adale, Mogadishu, Merca, Barawa, Warsheikh, Giumbo, Luuq, Jazeera, Afgooye, Mareeg, Bariire, Danane and Balcad on the Banaadir coast. The territories between the Shabelle and Jubba rivers in the following years. During this period, the Bimaal and Wa'dan revolts near Merca marked the Somali resistance to Italian expansion, coinciding with the rise of the anti-colonial Dervish movement led by Mohammed Abdullah Hassan'.\nEarly Confrontations\nMassacre of Warsheikh\nOn April 24 1890 An Italian steamboat was ordered to be equipped and sent to the shores of Warsheikh under the command of Lieutenant Zavagli, with instructions to “seek a meeting with the local chief of the area, who's population primarily belonged to the Abgaal subclan of the Hawiya Somalis, to demonstrate the crew's friendly intentions and to offer gifts for the chiefs and the population.” Alongside Zavagli were Coxswain Angelo Bertolucci, Seaman 3rd Class Angelo Bertorello, Engineer 3rd Class Alfredo Simoni, Stoker 2nd Class Giuseppe Gorini, Chief Helmsman 2nd Giovanni Gonnella, and an Arab interpreter Said Achmed.After Zavagli arrived, according to Minister Brin's report to the King; it was a veritable ambush. Launched at a signal from the Somali chief against the Italians who had disembarked.Zavagli was immediately wounded and died on the boat. Bertorello was hit by the Somalis while working on the anchor; he suffered wounds, which caused him to die shortly after. Upon return, their boat was studded in arrows, and Lieutenant Zavagli's body in a pool of blood, his head decapitated.\nSheikh Ahmed Gabyow, also known as Sheekh Gabyow, recited this poem at the end of June 1891 after the battles of Cadale and Warsheikh killing the Lieutenant Carlo Zavagli, along with 60 Italian colonial troops said to have been the first call for Somali nationalism.\nBattle of Lafoole\nWith the growing anti Italian Sentiment and the Italian authority's retribution, continued unabated for many years. It was heightened when, in November 1896, while on a pleasure trip, Consul , the Societá del Benadir administrator and also the de facto governor of Southern Somaliland, and his lieutenants, were ambushed at Lafoole during their expedition, a small village a few kilometres from Afgooye, south of Muqdisho, by Wa'daan and Bimaal fighters, who massacred 14 of the Italians, including Cecchi. Despite this initial attack, it did not definitively halt the progress of the expedition. The following morning, a renewed and more intense assault took place, ultimately resulting in the decisive defeat of the Italian expedition, with only three survivors left to recount the harrowing defeat that they suffered including the death of Cecchi, mourned in Italy. Lee V. Cassanelli states:\nWith the attack at Lafoole (the humiliating defeat of the Italian forces, commonly referred to as the 'Lafoole Massacre', 'Axad Shiikhi' “the Year of Cecchi” in local accounts and \"Adwa Part Two\" in the Italian media), had resulted in the deaths of 14 Italian officials and numerous soldiers, it had managed to garnish strong reactions in Rome.\nSorrentino expedition\nThe Italian government sent captain Giorgio Sorrentino to Mogadishu, giving him the task to conduct a punitive expedition to avenge Lafoole. On February 1, 1897, a garrison led by Sorrentino, protected by artillery and troops desembarked from the Italian ships Elba and Governolo (which had previously bombarded Nimmo), set out to recover the unburied skeletons of the Italians killed at Lafoole. Sorrentino organized a funeral ceremony, with military honors, to bury the fallen in a chapel near the shore. A monument was dedicated to the massacre. Immediately after the ceremony, a group of men went to the coastal dune, about fifty meters high, to choose the site where a fort would later be built. The stronghold was armed with four 75 mm guns and, it was named Fort Cecchi after one of the fallen.After the bodies were recovered, the village of Nimmo was set on fire and 70 Somalis were captured in the village of Gesira. With the reinforcement of 150 Eritrean askaris, who arrived on 12 April 1897 with the ship Volta, Sorrentino destroyed the towns of Gellai, Res, and of Lafoole. Somalis attacked the Italian column, in a battle that lasted several hours, but were defeated. In the engagement, 50 Somalis were killed. On the Italian side, 1 Askari died.\nIn Robert L. Hess own words;\n“The impression made by the punitive expedition after Lafoole could hardly have been called lasting.” Since after this expedition, the Italians primarily retreated to the coast until further campaigns.\nDervish wars\nSomaliland campaign,\nThe first years of the Pacification campaign (1889–1900) were \"fought\" peacefully: using protective treaties, Italy managed to get many protectorates over Somalia. However, after the Italian intervention in the Anglo-Dervish War, between 1903 and 1904, the relationship between Hobyo and Italy worsened. Viewed as too much of a threat by the Italians, Kenadid was exiled first to the British-controlled Aden Protectorate, and then to Italian Eritrea\ncamel troops under Italian Colonel Camillo Bechi's command]]\nBattle of Eyl\nOn 21 April 1904, a Royal Naval detachment, reinforced by three companies of the Royal Hampshire Regiment, stormed and captured the forts at Eyl, supported by the Italians. In this attack, the British lost 3 men killed and 11 wounded, and the Dervishes 58 killed and 14 wounded, while the naval detachment remained ashore for four days, assisted by an Italian naval detachment that arrived on 22 April. Having defeated his forces in the field and forced his retreat, the British \"offered the Mullah safe conduct into permanent exile at Mecca\", but he did not reply.\nBattle of Hiraan\nOn 3 March 1913, the Dervish movement clashed with the Italian colonial army around Beledweyne in the Hiraan region of Italian Somaliland. A Dervish force of approximately 900 men, led by Mohamed Abdullah Hassan and commanders including Isman Boos and Ismail Mire, successfully resisted the Italian offensive.\nThe Italians launched a three and a‑half day siege, deploying artillery and infantry attacks against sturdily built forts around Beledweyne. Despite the sustained bombardment, the Dervish defenders assisted by strong engineering under Cali Jalax prevented major damage to their fortifications, while Ismail Mire later commemorated the resistance in oral poetry.\nThe Italians ultimately abandoned their advance, retreating from the area. This retreat effectively ceded control of Hiraan to the Dervish movement, which later fortified its position by building new forts in the region. Italian forces never launched another southern offensive, enabling the Dervishes to maintain authority over much of southern Somalia during the First World War.\nBattle of Buloburde\nBetween 1915 and 1918  Dervish columns conducted raids into Italian-controlled territories in February 1916, but were stopped by the garrisons of Buloburde and Tiyeglow; on the following 27 March, thanks to the betrayal of some Somali irregulars hired into the service of the Italians,the dervishes took and sacked the fort of Bulo Burti, with Colonel Bessone's Askari  forces rereating.\nBanadir resistance\nThe Banadir resistance was the collective resistance to Italian colonialism in the Banaadir region, anti colonial campaigns led by the Bimaal, Wacdaan, Abgaal, and other southern Somali clans against Italian forces in southern Somalia from the late 1890s to the early 1920s. It officially began after the Battle of Lafoole in which two Italian were ambushed and killed, then the killing of Italian official Antonio Cecchi at Lafoole in 1896, which triggered reprisals and a wider revolt centered around Merca and the Shabelle valley. The rebellion led primarily by the powerful pro-slavery clan of the Bimaal following the contrast made by the Colonial Benadir Company against the slave trade, led to the total failure of the \"pacification\" policy designed in Rome. elders and Sultan discussing matters with Italian figures on board the Italian cruiser Marco Polo. Published on ''L'Illustrazione Italiana'' in May 1907]]\nBanaadir clan leaders mostly from the clans Bimaal, Wa’daan and Geledi, included Sheikh Abdi Abikar Gafle, Ma’alin Mursal, Abdi Yusuf, Haji ibrahim Gaashan, Malaakh Cabdi Juray, and Bilow Ageede. Somalis opposed Italian colonialism in Somalia. Italian garrisons in both Marka and Jazira were under siege and barely survived. Though Italy sent support troops, they suffered considerable losses. In February 1907, at Turunley, also known as Dhanane, north of Marka, some 2,000 Banadiri warriors, led by Sheikh Abdi Abiikar Gaafle, a religious Bimaal leader and imam fought 1,000 Italian troops, assisted by some 1,500 Arab, Eritrean, and Somali mercenaries led by Lieutenant Gustavo Pesenti. The attack started after midnight, February 9, 1907, and lasted to the noon of the 10th. The Somali warriors retreated, leaving behind several hundred dead and as many wounded. Although the Italians had high casualties, they considered Turunley a major military victory, one which Lieutenant Pesenti, the commander of the regiment, celebrated in an eyewitness account, Danane (Dhanane).\nIn July 1908, at Finlow, the Somali coalition avenged their previous loss at Turunley, in which they defeating and killed around 500 Italian troops, which was of high importance.\nHowever, the subsequent 1908 expeditions led by Antonino Di Giorgio and Vincenzo Rossi led to the capitulation of major centres such as Afgooye and surrounding Somali citie. Eventually, Italians ceased the hostilities by the Bimaal and other clans by winning a string of conflicts, such as in Bula-Iach (19 June), Gilib (26 August) and Mellet (14 October). In this period the Sultan of the Geledi Osman Ahmed, agreed to turn his realm into an Italian protectorate, which many young members of the Geledi clan opposed.\nCampaign of the Sultanates\nPrelude to the campaign\nWith the arrival of Governor Cesare Maria De Vecchi on 15 December 1923, things began to change in Somalia, Italy had access to these areas under the successive protection treaties, but not direct rule. The Fascist government had direct rule only over the majority of Benadir territory. Given the defeat of the Dervish movement in the early 1920s, and the rise of fascism in Europe, on 1925, Mussolini gave the green light to De Vecchi to start the takeover of the northern sultanates. Everything was to be changed and the treaties abrogated.\nTo make the enforcement of his plan more viable, he began to reconstitute the old Somali police corps, the Corpo Zaptié, and the new Dubats as a colonial force. Who were mostly led by Capo Hersi Gurey, a major ally of Italy in this conflict.\nIn preparation for the plan of invasion of the sultanates, the Alula Commissioner, E. Coronaro received orders in April 1924 to carry out a reconnaissance on the territories targeted for invasion. In spite of the forty year Italian relationship with the sultanates, Italy did not have adequate knowledge of the geography. During this time, the Stefanini-Puccioni geological survey was scheduled to take place.Such, concluded that the Majeerteen Sultanate depended on sea traffic, therefore, if this were blocked any resistance could be “mounted” As the first stage of the invasion plan, Governor De Vecchi ordered the two Sultanates to disarm. The reaction of both sultanates was to object, as they felt the policy was against the protectorate agreements. The pressure engendered by the new development forced the two northern sultanates, Hobyo and Majeerteenia, to settle their differences, and form a united front against their common enemy.\nOmar Samatar's Rebellion\nItalians swiftly invaded Hobyo, with Ali Yusuf Kenadiids surrender, victorious against the sultan's forces, the populace had yet to accept Italian rule without a fight. Commissioner Trivulzio, assigned with administering Hobyo, reported the movement of armed men towards the borders of the sultanate before and after the annexation. As preparations were underway to continue the Corpo Zaptié's advance into Majeerteen Sultanate, a new threat emerged. One of Sultan Ali Yusuf's commanders, Omar Samatar, attacked and captured Ceel Buur. In which he personally murdered Italian Captain Francesco Carolei, after which he cut off the captains right hand and threw it over the forts wall, to signal to his army that the rebellion was now underway.\nOmar Samatars forces then stormed the fort, and held Ceel Buur on the 9th of November 1925. The local populace sided with Omar, and soon enough the Italians had a full-scale revolution on their hands, after Omar continued his previous success with the capture of El-Dhere in modern-day Galmudug. A third attempt by the Italians was planned, but before it could be executed the commander of the operation, Lieutenant Colonel Splendorelli, was ambushed and killed between the towns of Bud Bud and Bula Barde. Italian morale hit rock bottom, and Hobyo seemed a lost cause as Omar Samatar stood poised to reconquer Hobyo itself. In an attempt to salvage the situation, governor De Vecchi requested two battalions from Eritrea and assumed personal command. The rebellion soon spilled over the borders into the Banaadir and Ogaden, as Omar grew increasingly powerful. The disaster in Hobyo shocked Italian policymakers in Rome. Blame soon fell on Governor De Vecchi, whose perceived incompetence was blamed for Omar's rise. Rome instructed De Vecchi that he was to receive the reinforcement from Eritrea, but that the commander of the Eritrean battalions was to assume the military command and De Vecchi was confined to Mogadishu and limited to an administrative role. The commander was to report directly to Rome, bypassing De Vecchi entirely.\nAs the situation was extremely confused, De Vecchi took former Sultan Ali Yusuf Kenadiid with him to Mogadishu. Mussolini vowed to reconquer all of Hobyo and move on to Majeerteenia by any means necessary. Even reinstating Ali Yusuf was considered. However, the clans had already sided with Omar Samatar, so this was not as viable an option as it would appear. Before the reinforcements arrived, De Vecchi chose the age old tactic of divide and rule, and offered great rewards, money and prestige to any clans who chose to support the Italians, notably the Habar Gidir, who were long enemies of the Hobyo Sultanate. Although many members of the Habar Gidir sided with Omar Samatars popular resistance originally.\nConsidering the eons-old clan rivalries which have been the bane of Somali states from time immemorial, it turned out to be far more successful than the Eritrean regiments in reversing the rebellion, the Habar Gidir were led by commander Hersi Gurey.\nWith the steam taken out of the rebellion, and the military forces heavily reinforced with the battalions from Eritrea, the Italians retook El-Buur on 26 December 1925, and eventually compelled Omar Samatar to retreat into Western Somaliland, although these fumbles against Hobyo, had been disastrous for the Italians, and Mussolini's pride.\nThe Cumar-Samatar Secondary School in central Galkacyo is named after Omar Samatar in remembrance of his struggles and sacrifices.\nItalian invasion of Majeerteenia\nThe new Alula commissioner, presented Boqor Osman with an ultimatum to disarm and surrender. Meanwhile, Italian troops began to pour into the sultanate in anticipation of this operation. While landing at Haafuun and Alula, the sultanate's troops opened fire on them. Fierce fighting ensued and to avoid escalating the conflict and to press the fascist government to revoke their policy, Boqor Osman tried to open a dialogue. However, he failed, and again fighting broke out between the two parties. Following this disturbance, on 7 October the Governor instructed Coronaro to order the Sultan to surrender; to intimidate the people he ordered the seizure of all merchant boats in the Alula area. At Hafun, Arimondi bombarded and destroyed all the boats in the area.\nOn 13 October Coronaro was to meet Boqor Osman at Baargaal to press for his surrender. Under siege already, Boqor Osman was playing for time. However, on 23 October, Boqor Osman sent an angry response to the Governor defying his order. Following this a full-scale naval attack was ordered in November. Baargaal is bombed by the Italian cruiser 'Campania'  for 22 hours after initial Italian efforts to take the town are pushed back and several Italian officers are killed.\n]]\nThe attempt of the colonizers to suppress the region erupted into an explosive confrontation. The Italians were meeting fierce resistance on many fronts. In December 1925, led by the charismatic leader Hersi Boqor, son of Boqor Osman, the sultanate forces drove the Italians out of Hurdia and Haafuun, two strategic coastal towns.\nAnother contingent attacked and destroyed an Italian communications centre at Cape Guardafui, at the tip of the Horn. In retaliation, the Bernica and other warships were called on to bombard all main coastal towns of the Majeerteen. After a violent confrontation Italian forces inevitably captured Eyl, which until then had remained in the hands of Hersi Boqor. In response to the unyielding situation, Italy called for reinforcements from their other colonies, notably Eritrea. With their arrival at the closing of 1926, the Italians began to move into the interior where they had not been able to venture since their first seizure of the coastal towns. Early Italian attempts to capture the Dharoor Valley was resisted by Hersi Boqors men, and ended in failure.\nDue to the immense retaliation of the Majeerteen, Italians were not able to entirely capture Majeerteenia until late 1927, when after the conflict at Iskushkuban Hersi Boqor and his top staff were forced to retreat to Somali Galbeed in order to rebuild the forces. However, they had an epidemic of cholera which frustrated all attempts to recover his force.\nThe nearly 3-year war ended with the complete bombardment of many coastal North Eastern towns, and the deaths of around 550 Italians, and 456 Dubats/Eritrean Askaris, only Two Eritrean battalions remained towards the end of the campaign.\nAftermath\nThe Italian Government eventually merged the Somali territories and the British protectorate of Jubaland to form Italian Somaliland.  Mussolini who first criticised Maria De Vecchi heavy handed tactics which claimed the deaths of a few Somalis, realized that the Pacification of Somalia offered great potential for regional expensive. However, despite these conflicts instability persisted throughout Italian Somaliland for the following years, prior to Somali independence.\nOn July 1st 1960 former British Somaliland united as scheduled with the Trust Territory of Somaliland to establish the Somali Republic.\nReferences"
    }
  ]
}