{
  "content": [
    {
      "type": "text",
      "text": "# Ivan R. King\n\nIvan Robert King (25 June 1927 – 31 August 2021) was an American astronomer. His notable works include work on structures of globular clusters, stellar photometry and the Hubble Space Telescope.\nCareer\nIvan Robert King was born on June 25, 1927, in Queens, New York, the son of Myram King and Anne née Franzblau. He was awarded an academic scholarship to Lawrence Woodmere Academy, where he completed his elementary and secondary schooling. At the age of sixteen he enrolled at Hamilton College, graduating at nineteen with a bachelor's degree in German, Physics and Mathematics. He then entered the Astrophysics graduate program at Harvard University, obtaining a PhD in 1952, at age of 25.\nIn 1952 he served with United States Naval Reserve, for two years before working for the Department of Defense, until 1956, using his expertise in computing and cryptanalysis. He then joined the University of Illinois Urbana-Champaign, before taking up a position at the University of California, Berkeley, in 1964. Between 1967 and 1970 he served as the Chair of the Astronomy Department. He was made an Emeritus Professor in 1993. In 2002 he joined the University of Washington, as a research professor, where he remained scientifically active for the next decade.\nKing co-authored three books and nearly 300 scientific papers.\nStructures of globular clusters\nIn 1966 King published a series of papers on the dynamical models of globular clusters. The models were based on the Fokker-Planck equation and represented the simplest possible static dynamic models of motions. These \"King model\" papers have been cited on over 2,000 papers subsequently.\nPhotometry\nKing's PhD thesis was devoted to developing stellar photometry standards. This formed the basis for the study of globular clusters.\nHubble Space Telescope\nKing played an early role in the conception and build of the Faint Object Camera. He used this camera to study globular clusters, including Andromeda Galaxy.\nPersonal life\nIn 1952 King married Alice Greene, with whom he had four children. He divorced in 1982 and married Judy Schultz in 2002.\nHe died on August 31, 2021, from complications following a surgery, at the age of 94.\nReferences"
    }
  ]
}