{
  "content": [
    {
      "type": "text",
      "text": "# Izaak Zwartjes\n\nIzaak Zwartjes (born 1974 in Leiden) is a Dutch artist. He makes monumental sculptures and installations of found objects.\nBiography\nZwarjes lives and Works in Leiden. He studied at the Royal Academy of Art in The Hague where he graduated in 2008. At his final graduation exhibition, Zwartjes impressed the audience with his installation The Laboratory Of Life about a post-apocalyptic world in which science, religion, and art come together. With the work Zwartjes gained a good reputation. Since 2008 his work has been on show in several exhibitions, including a solo in the Cobra Museum in Amstelveen.\nWork\nZwartjes creates environments, demarcated spaces in which a variety of mythological narratives take place. The installations are made of damaged, half decayed materials and objects that Zwartjes collects during his journeys through the city. Zwartjes sees these carefully assembled attributes, such as a shopping cart, a wooden barrel, old blankets and a gas mask, as the leftover products of a modern society in which people often feel lost. Together with a number of life-size figures, these materials make up the decor for a mythological journey of discovery.\nIn continuation of The laboratory of Life, Zwartjes made Exodus (2009). The installation depicts an apocalyptic tale of a degenerated tribe of cloned beings, which wanders through  a desolate landscape in search of deliverance and rebirth. They are routed and driven away  by  higher  power in the form of an all-powerful computer, which has been given them the order to build a tabernacle according to meticulous guidelines: a sacred domain through which the people can be in touch with a higher power. The task of building a sanctuary is a reference to the Book of Exodus in the Old Testament. In the chapters 25-31, 35-40 of the book, God orders the building of a tabernacle in the desert in order to inhabit it and be in the midst of his chosen community. With the exact materials, their measurements and their order of succession, God has dictated the creation of his sanctuary down to the minutest detail. Zwartjes sets about his work in exactly the same way. Zwartjes selects the specific building blocks for his environments with great care. During his meanderings through the city, the artist seeks suitable waste materials. For every find, Zwartjes weighs whether or not this object meets the criteria he has already formulated for himself.\nExodus is a depiction of a reality in which everyday life, fantasy and current events are all interwoven. On the one hand the installation is a physical place, the manifestations of a mythological journey generated in the mind of Izaak Zwartjes. On the other hand, this collection of objects and materials offers a space in which to reflect on our individual and collective identities, on the state in which  humanity finds itself and the role that we fulfill in this society.\nIn October 2011 Izaak Zwartjes made a pilgrimage from Leiden to Venray on a self-made car with a small engine. In Venray he stayed for a month in the Odapark to build a cathedral with the objects and materials he found on his journey. The result was shown in the exhibition Basic Construction in the Odapark.\nExhibitions\n*Izaak Zwartjes: Basic Construction - Horsepower Opus 18 G Major, Odapark - Venray, 30/10/2011 - 15/2/2012.\n*Inzoomen op Haagweg4, Kunstcentrum Haagweg 4 - Leiden (2011)\n*'t Laatste Oordeel van Leiden, Scheltema voor actuele kunst - Leiden (2011)\n*Izaak Zwartjes, Maartje Korstanje en Rob Voerman, Upstream Gallery - Amsterdam (2011)\n* Art Rotterdam (2011)\n*Brave New Worlds, Horizonverticaal - Haarlem (2011)\n*Izaak Zwartjes: Rudiments of territory, Upstream Gallery - Amsterdam (2010)\n*Izaak Zwartjes: Exodus, Cobra Museum voor Moderne Kunst - Amstelveen (2009)\n*Apocalyptic landscapes, Upstream Gallery - Amsterdam (2008)\nReferences\nExternal links\n* [https://web.archive.org/web/20130921055451/http://www.cobra-museum.nl/content_media/izaak_zwartjes-exodus.pdf Publication by The Cobra Museum]\n* [http://www.kunstbeeld.nl/00/kb/nl/0/nieuws/12921/Exodus_@_Cobra_Museum.html commentary in artjournal Kunstbeeld]\n* [https://www.youtube.com/watch?v=ge_OlLxCinc YouTube video of the exhibition Exodus in the Cobra Museum, Amstelveen]"
    }
  ]
}