{
  "content": [
    {
      "type": "text",
      "text": "# J. Edward Swanstrom\n\nJohn Edward Swanstrom (July 26, 1853 – February 15, 1911) was an American lawyer and politician from New York. He was the father of lyricist, playwright, dancer, and Broadway producer Arthur Swanstrom.\nLife\nSwanstrom was born on July 26, 1853, in Brooklyn, New York, the son of Swedish immigrants John P. and Anna B. Swanstrom. His father John did missionary work among the Swedish people in Brooklyn, and immigrated to America in 1840 with John Ericsson.\nSwanstrom attended studied law at New York University, graduating from there in 1878. He was also a student in the law firm Miller, Peet & Obdyke. The firm later became Bristow, Peet & Opdyke, headed by Secretary of the Treasury Benjamin Bristow. After graduating, he quickly began a general practice. He shared a law office with John E. Miller at 20 Nassau Street and became a prominent Brooklyn lawyer. After becoming Borough President, he took on a partner and formed the law firm Swanstrom & Keyes.\nSwanstrom became a member of the board of education in 1888. He was elected president of the board in 1894, and held that office when the board of education became the School Board for the Borough of Brooklyn. He was also a member of the New York City Board of Education, was elected its vice-president, and briefly served as president of the board in 1899. He left the board in 1900.\nSwanstrom served as Borough president of Brooklyn from 1902 to 1904. He was nominated for the office under a fusion ticket backed by the Brooklyn Citizens Union. As borough president, he secured six million dollars appropriations for street paving, and managed to build the first public baths and comfort stations in the borough.\nAfter his term as borough president expired, Swanstrom became president of the Home Trust Company of Brooklyn. He later resigned from the position to return to practicing law. He was also a director of the Equitable Life Assurance Company after it was reorganized. He served as director of the People's National Fire Insurance Company, the Kentucky River Coal and Timber Company, the People's Surety Company, the Kings County Mortgage Company, the Arkansas Valley Sugar Beet Company, and the Cosmopolitan Land Company. He was also on the board of managers for the Long Island State Hospital and a trustee of Adelphi College and the Swedish Hospital.\nIn 1878, Swanstrom married Frances N. Harris. Their children were Arthur M. and Mrs. Ada Winter. He was a member of the Freemason, the Crescent Athletic Club, the Royal Arcanum, and the Brooklyn Bar Association. His son Arthur Swanstrom was a Broadway musical lyricist and producer.\nSwanstrom died at home from pneumonia on February 15, 1911. He was buried in Green-Wood Cemetery.\nReferences\nExternal links\n* [http://politicalgraveyard.com/bio/swanton-swede.html#426.43.28 The Political Graveyard]"
    }
  ]
}