{
  "content": [
    {
      "type": "text",
      "text": "# J. Fred. Waring\n\n|birth_place      = Savannah, Georgia, U.S.\n|death_date       =\n|death_place      = Whitesville, Georgia, U.S.\n|placeofburial    =\n|placeofburial_coordinates =\n|allegiance       = Confederate States\n|branch           = Confederate States Army\n|branch_label     = Branch\n|serviceyears     = 1861–1865\n|rank             = Colonel\n|commands         = Jeff. Davis Legion\n|battles          =\n* American Civil War\n**Bog Wallow Ambush\n**Battle of Brandy Station\n**Battle of Gettysburg\n**Battle of Trevilian Station\n**Battle of Monroe's Crossroads\n|battles_label    = battles\n|memorials        =\n|alma_mater       = Yale University\n|spouse           =\n|children         =\n|relations        =\n|laterwork        =\n|signature        =\n|signature_size   =\n|signature_alt    =\n}}\nColonel Joseph Frederick Waring (1832–1876) was a senior officer of the Confederate States Army, commanding a cavalry regiment in the American Civil War.\nEarly life and education\nJoseph Frederick Waring was born on February 13, 1832, at Savannah, Georgia, to Dr. William R. and Ann () Waring. He was the great-uncle of scholar Joseph Frederick Waring. He enrolled in Yale University and graduated in the class of 1852. He spent his studies at Philadelphia and spent the next year travelling across Europe. When he finally returned, he became a planter at Savannah as well as a city alderman there. He then married Louise Early.\nAmerican Civil War\nWhen the American Civil War broke out, Waring became a member of the Georgia Hussars and became a colonel within the unit. A few weeks later, he arrived at Virginia with his company and was then originally assigned to the 6th Virginia Infantry Regiment when he arrived at Richmond, Virginia but this didn't last long as shortly after, on December 4, the Bog Wallow Ambush occurred but was wounded in the face during the fighting.\nThree days later after the failed ambush, Waring's company was consolidated with the Jeff. Davis Legion after Col. William F. Martin was promoted to Brigadier General and sent to Western Theater of the American Civil War. The unit served under Wade Hampton III. Waring later led his united through cavalry battles in the Eastern Theater of the American Civil War such as Brandy Station, Gettysburg and Trevilian Station. In July 1864, he was promoted to colonel of the Legion and later assisted with Pierce M. B. Young's brigade.\n}}\nHe participated at the Battle of Monroe's Crossroads but then surrendered at Bennett Place along with Joseph E. Johnston.\nLater years\nWhen the war ended, Waring returned to Savannah and took up a job at the Georgia Central Railway Co. as a forwarding agent. He also became a commanding officer of the Georgia Hussars, a post he would have until his death from a yellow fever epidemic after a visit to the Northern States at Whitesville, Georgia.\nReferences"
    }
  ]
}