{
  "content": [
    {
      "type": "text",
      "text": "# J. Howard Pew\n\n| birth_place        = Bradford, Pennsylvania, U.S.\n| death_date         =\n| death_place        = Ardmore, Pennsylvania, U.S.\n| restingplace       = West Laurel Hill Cemetery\n| education          = Grove City CollegeMassachusetts Institute of Technology\n}}\nJohn Howard Pew (January 27, 1882 – November 27, 1971) was an American philanthropist and president of Sunoco (Sun Oil Company).\nBiography\nJ. Howard Pew was born in Bradford, Pennsylvania in 1882 and raised as a devout Presbyterian. In 1886 Pew's father, Joseph Newton Pew, Sr. (1848–1912) started an oil business in Pennsylvania, expanding to Texas when oil was discovered near Beaumont in 1901. This company became known as the Sun Oil Company. J. Howard Pew attended Shady Side Academy, Grove City College, and Massachusetts Institute of Technology and then worked as a refinery engineer for one of his father's companies. In 1912 with his brother Joseph N. Pew,  Jr., J. Howard Pew took over management of the Sun Oil Company (now known as Sunoco) improving the company's refining, marketing and distribution systems, and buying or developing energy production operations. In 1934, he purchased and reorganized the Chilton Company, a publisher of several national magazines. He was an early sponsor and director of Christianity Today from 1956 until his death. He was a member of the Mont Pelerin Society.\nAthabasca Oil Sands\nIn a 2013 address to the Canadian Association of Lifelong Learners, Peter McKenzie-Brown of the Petroleum History Society listed industrialist J. Howard Pew as one of the six visionaries who built the oil sands, along with chemist Karl Clark; Premier Ernest Manning; US corporate executive Frank Spragins; Premier Peter Lougheed; and Suncor's former chairman and CEO Rick George.\nWith Pew's support, in 1962 Sun Oil's majority-owned subsidiary, Great Canadian Oil Sands (GCOS), filed an application for a commercial oil sands project in Canada – the first ever constructed. In 1967, Pew told his audience at opening ceremonies for the Great Canadian Oil Sands plant that \"No nation can long be secure in this atomic age unless it be amply supplied with petroleum... It is the considered opinion of our group that if the North American continent is to produce the oil to meet its requirements in the years ahead, oil from the Athabasca area must of necessity play an important role.\" Today, GCOS is known as the Suncor oilsands plant.\nHe was awarded the Vermilye Medal in 1950.\nPersonal life\nPew married Helen Jennings Thompson.  She died in 1963.  They had a son, George T. Pew, and two daughters.\nJ. Howard Pew died in Ardmore, Pennsylvania, on November 27, 1971.\nPhilanthropy\nWith his siblings, Pew was a co-founder of The Pew Charitable Trusts. J. Howard Pew also donated the funds for the J. Howard Pew Freedom Trust in 1957. Pew provided early funding to support Gordon-Conwell Theological Seminary in Massachusetts, working closely with Billy Graham and Harold Ockenga. Pew also donated to various other organizations, including the Foundation for Economic Education, American Liberty League, James W. Fifield Jr.'s Spiritual Mobilitzation religious-political organization, and Barry Goldwater presidential campaign, 1964. Pew also made a one-time $1000 gift to the Liberty Lobby.\nAlthough Pew denied being a member of the John Birch Society, he was listed a member of the editorial advisory board of the group's publication, American Opinion, and as a stockholder of Robert Welch, Inc., the group's publishing arm.\nReferences"
    }
  ]
}