{
  "content": [
    {
      "type": "text",
      "text": "# J. Warren Keifer\n\n(1877–1879) (1879–1881) (1881–1885)\n|term_start4  = March 4, 1905\n|term_end4    = March 3, 1911\n|predecessor4 = Thomas B. Kyle\n|successor4   = James D. Post\n|constituency4=\n| restingplace = Ferncliff Cemetery\n|branch       = United States ArmyUnion Army\n|serviceyears = 1861–1865, 1898–1899\n|commands     = 110th Ohio Infantry Regiment2nd Brigade, 3rd Division, VI Corps7th Army Corps (1898–1899)\n|rank         =  Major General\n|unit         = 3rd Ohio Infantry Regiment\n|battles      = American Civil WarSpanish–American War\n}}\nJoseph Warren Keifer (January 30, 1836 – April 22, 1932) was a major general during the Spanish–American War and a prominent U.S. politician during the 1880s. He served in the United States House of Representatives as a Republican from Ohio from 1877 to 1885 and from 1905 to 1911. From 1881 to 1883 he was Speaker of the House.\nEarly life\nKeifer was born in Clark County, Ohio. He attended school at Antioch College then returned to his family's farm. While working as a farmer he devoted his spare time to studying law.  He began his law practice in Springfield, Ohio, on January 12, 1858.\nCivil War\nKeifer enlisted in the 3rd Ohio Infantry, a three-months regiment, being appointed major. He served in western Virginia fighting in the battles of Rich Mountain and Cheat Mountain and afterward was promoted to lieutenant colonel of the regiment. When his term expired, he joined the 110th Ohio Infantry and became its colonel. He served in the Eastern Theater leading his regiment at the second battle of Winchester. While the Union army was soundly defeated and most of it surrendered, Keifer's regiment was able to avoid capture. Following the battle of Gettysburg, Keifer was assigned to brigade command in the III Corps and fought at the battle of Wapping Heights. After Robert E. Lee's army had retreated to safety in Virginia, Keifer and his regiment were dispatched to New York City to help suppress the draft riots.\nKeifer returned to the Army of the Potomac in time for the Overland Campaign. He was wounded in the arm at the battle of the Wilderness, putting him out of action for a time.  When he did return to active duty he was placed in command of the 2nd Brigade in James B. Ricketts's 3rd Division of the VI Corps. He led his brigade at the battles of Winchester and Fisher's Hill.  During the battle of Cedar Creek, VI Corps commander Horatio G. Wright temporarily commanded the Army of the Shenandoah and Ricketts temporarily in command of the corps. This put Keifer in command of the 3rd Division in Ricketts's absence. When Philip H. Sheridan heroically returned to command the army in the midst of the battle, returning Wright to corps command, Ricketts had already been wounded, leaving Keifer in command of the division for the rest of the battle. For his service during the Shenandoah Valley Campaign, on December 12, 1864, President Abraham Lincoln nominated Keifer for appointment to the grade of brevet brigadier general of volunteers, to rank from October 19, 1864, and the United States Senate confirmed the appointment on February 14, 1865.\nWhen the VI Corps returned to the Army of the Potomac General Truman Seymour was placed in command of the 3rd Division and Keifer returned to command the 2nd Brigade, taking part in the breakthrough at Petersburg and the Appomattox Campaign.  Keifer was breveted as a major general, to rank from April 9, 1865, in recognition of his contributions to the campaign.\nPolitical career\nFollowing the Civil War, Keifer returned to Springfield and resumed his law practice. From 1873 until his death, he served as a trustee of Antioch College. In 1876 he was a delegate to the Republican National Convention and the next year went to Congress. From 1881 to 1883 during the 47th United States Congress, Keifer served as the 47th Speaker of the House of Representatives.\nDuring his early House years, Keifer was a member of the congressional \"Stalwart\" faction of the Republican Party led by New York senator Roscoe Conkling.\nIn 1881, Keifer sparred with Maine colleague Thomas Brackett Reed for the position of U.S. House Speaker. He was selected by intraparty colleagues on the 16th ballot, and proclaimed upon mounting the Speaker's rostrum that he would try:\nHe proved a disappointment as Speaker, his deficiencies in knowledge, judgment, and personality prompting The Nation to comment that he was \"more successful than any of his predecessors in displeasing the majority of the House.\"\nSpanish–American War\nDuring the Spanish–American War, President William McKinley appointed Keifer major general of volunteers on June 9, 1898. He commanded the 7th Army Corps and the American forces that marched into Havana after Spanish forces withdrew on Jan. 1, 1899.\nReturn to politics\nAfter returning to private life on May 12, 1899, he published Slavery and Four Years of War, in 1900.  The book was both a commentary on the history of slavery in the United States as well as an autobiography of his experiences during the Civil War. He served as the first commander in chief of the United Spanish War Veterans from 1900 to 1901 and in 1903 and 1904 as the Ohio commander of the Loyal Legion.\nHe again ran and was elected to Congress and served from March 4, 1905 – March 3, 1911.\nLater life\nAfter his political career, Keifer again resumed his law practice and served as the president of the Lagonda National Bank in Springfield, Ohio.\nDeath and burial\nHe died April 22, 1932, at the age of 96 in Springfield, and is buried in Springfield's Ferncliff Cemetery.\nSee also\n* List of American Civil War brevet generals (Union)\n* James M. Moody\nReferences\nFurther reading\n*\n* Pope, Thomas E. The Weary Boys: Colonel J. Warren Keifer and the 110th Ohio Volunteer Infantry. Kent State University Press, 2002. .\n*\nExternal links\n*  Retrieved on 2008-12-15\n* [https://www.loc.gov/rr/mss/text/keifer.html Library of Congress profile]\n*\n*\n*\n}}\n}}"
    }
  ]
}