{
  "content": [
    {
      "type": "text",
      "text": "# J Awards\n\nThe J Awards are an annual series of Australian music awards, established by the Australian Broadcasting Corporation's youth-focused radio station Triple J, and which also extend to sister stations, Triple J Unearthed and Double J. The awards are presented through on-air ceremony held in November each year as part of Triple J's Ausmusic Month.\nBackground and awards\nAs part of Triple J's 30th anniversary celebrations in 2005, the station inaugurated a single \"J Award\" to be given for \"an album of outstanding achievement as an Australian musical work of art &ndash; for its creativity, innovation, musicianship and contribution to Australian music.\"\nAustralian Album of the Year\nAs per the official rules and criteria, the award is open to any album by an Australian artist that is released either independently or through a record company between November of the previous year and October of the current year. Any album sent into Triple J in consideration for airplay is also eligible for the J Award, given its received by Triple J within this period. This award was renamed as the Australian Album of the Year in 2007.\nUnearthed Artist of the Year\nIn 2007, a new award for Unearthed Artist of the Year was introduced. The Triple J judges now looking back over the winners of site competitions over the year and awarding the Triple J Unearthed J Award to the best and most promising artist. The Judging criteria for the Unearthed Artist of the Year is open to any artist who has had a ground breaking and impactful last 12 months. Any Unearthed artist who wins a sponsored competition or is featured on Unearthed is eligible for this award. Any artist registered on the Unearthed site during this period is also eligible in consideration for nomination for this award.\nAustralian Music Video of the Year\nIn 2008, a new award for Australian Music Video of the Year was added. originally with Triple j TV as a co-presenter but that role is now filled by ABC TV program Rage. The music video of the year being determined for its outstanding achievement as an Australian musical video work of art (based on its creativity, originality and technical excellence). The music video is selected from any music video released by an Australian artist (either independently or through a record company) and that is also directed by and Australian director between November and December the preceding year.\nDouble J Australian Artist of the Year\nIn 2014, a new award for Double J Australian Artist of the Year was introduced. It was awarded by Double J, Triple J's sister station, to the artist that the station had seen as the greatest contributor to either recorded music, live performances or Australian music culture, or a combination of the three, during the course of the year.\nThis award celebrates artists who have released or produced an album that has resonated with Double J as an impressive musical work of art; have pulled off significant live performances, events or tours; or made a valued contribution through their music to Australian arts and culture.\nYou Done Good Award\nIn 2019, a fifth award for You Done Good Award was added to the schedule. The award goes to an Australian who has \"made an impact on the industry through outstanding achievement, social change or altruistic endeavours.\"\nAustralian Live Act of the Year\nIn 2023, the Australian Live Act of the Year was introduced.\nThe J Award trophy\nThe current J Award trophy is a 3-D design that features the top third of the J Award logo, the Emu and Kangaroo crossed necks and heads, and is made of glass and has the Categories & Winners inscribed onto them. It has remained largely unchanged since its inception in 2008.\nAwards by year\nTo see the full article for a particular year, please click on the year link.\n{| class=\"wikitable\"\n|-\n! Year\n! Australian Album of the Year\n! Unearthed Artist of the Year\n! Australian Music Video of the Year\n! Double J Australian Artist of the Year\n! Australian Live Act of the Year\n|-\n| 2005\n| Wolfmother by Wolfmother\n| rowspan=\"2\"\n| rowspan=\"3\"\n| rowspan=\"9\"\n| rowspan=\"18\"\n|-\n| 2006\n| The Hard Road by Hilltop Hoods\n|-\n| 2007\n| Cruel Guards by The Panics\n| Young and Restless\n|-\n| 2008\n| Apocalypso by The Presets\n| John Steel Singers\n| Mike Daly for \"2020\" by The Herd\n|-\n| 2009\n| As Day Follows Night by Sarah Blasko\n| The Middle East\n| Alex Roberts for \"Parlez Vous Francais?\" by Art vs. Science\n|-\n| 2010\n| Innerspeaker by Tame Impala\n| Boy & Bear\n| Mairi Cameron and Stephen Lance for \"Sunday Best by Washington\n|-\n| 2011\n| Making Mirrors by Gotye\n| Ball Park Music\n| Emma Tomelty for \"Speak of the Devil\" by Hermitude\n|-\n| 2012\n| Lonerism by Tame Impala\n| The Rubens\n| Kris Moyes for \"Way II War\" by Kirin J. Callinan\n|-\n| 2013\n| Flume by Flume\n| Remi\n| Josh Thomas for \"Everything You Wanted\" by Clubfeet\n|-\n| 2014\n| Built on Glass by Chet Faker\n| Meg Mac\n| Sia Furler and Daniel Askill for \"Chandelier\" by Sia\n| Mia Dyson\n|-\n| 2015\n| Sometimes I Sit and Think, and Sometimes I Just Sit by Courtney Barnett\n| Tired Lion\n| Natalie Erika James for \"Mine\" by Life Is Better Blonde\n| Tim Rogers\n|-\n| 2016\n| Utopia Defeated by D.D Dumbo\n| Tash Sultana\n| Danny Cohen and Jason Galea for \"People-Vultures\" by King Gizzard & the Lizard Wizard\n| King Gizzard & the Lizard Wizard\n|-\n| 2017\n| Reclaim Australia by A.B. Original\n| Stella Donnelly\n| Tim White for \"A Foreign Affair\" by Client Liaison/Tina Arena\n| Jen Cloher\n|-\n| 2018\n| Lost Friends by Middle Kids\n| Kwame\n| Claudia Sangiorgi Dalimore for \"Native Tongue\" by Mojo Juju\n| Geoffrey Gurrumul Yunupingu\n|-\n| 2019\n| Rainbow Valley by Matt Corby\n| Tones and I\n| Sanjay De Silva for \"Final Form\" by Sampa The Great\n| Sampa the Great\n|-\n| 2020\n| 14 Steps to a Better You by Lime Cordiale\n| JK-47\n| Joey Hunter for \"Billy Bad Again\" by Tasman Keith\n| Archie Roach\n|-\n| 2021\n| Smiling with No Teeth by Genesis Owusu\n| King Stingray\n| Riley Blakeway for \"The Other Black Dog\" by Genesis Owusu\n| The Avalanches\n|-\n| 2022\n| Angel in Realtime by Gang of Youths\n| Elsy Wameyo\n| Raghav Rampal for \"Oldboy\" by 1300\n| Midnight Oil\n|-\n| 2023\n| Drummer by G Flip\n| Miss Kaninna\n| Moonboy Studios for \"4K to the Middle East\" by Shaba featuring Uzi\n| Briggs\n|Genesis Owusu\n|-\n| 2024\n| Zorb by Sycco\n| Lithe\n| Claudia Sangiorgi Dalimore for \"Lordy Lordy\" by Emily Wurramara featuring Tasman Keith\n| Missy Higgins\n| Angie McMahon\n|-\n| 2025\n| I Love My Computer by Ninajirachi\n|Folk Bitch Trio\n| Ball Bass John for \"Fuck My Computer\" by Ninajirachi\n| Amyl and the Sniffers\n| Speed\n|}\nMost awards\nThe following artists have won more than one J Award:\n* Three awards\n** Genesis Owusu, Australian Album of the Year and Australian Music Video of the Year in 2021; and Australian Live Act of the Year in 2023.\n* Two awards\n** Tame Impala, Australian Album of the Year in 2010 and 2012.\n** King Gizzard and the Lizard Wizard, Double J Artist of the Year and Australian Music Video of the Year in 2016.\n** Sampa the Great, Double J Artist of the Year and Australian Music Video of the Year in 2019.\n** Ninajirachi, Australian Album of the Year and Australian Music Video of the Year in 2025.\nReferences\nExternal links\n*"
    }
  ]
}