{
  "content": [
    {
      "type": "text",
      "text": "# Jackson–Harmsworth expedition__disambig_1\n\nThe Jackson–Harmsworth expedition of 1894–1897 to Franz Josef Land was led by  British Arctic explorer Frederick George Jackson and financed by newspaper proprietor Alfred Harmsworth. Jackson had been misled by speculative maps into believing that Franz Joseph Land was a land mass that extended to the North Pole. The survey which was the main work of the expedition eventually proved that the land was in fact an archipelago, whose northernmost island did not extend beyond 82°&nbsp;N.\nTeam\nThe expedition party consisted of\n* expedition leader Frederick George Jackson,\n* astronomer and meteorologist Albert Armitage,\n* physician and geologist Reginald Koettlitz,\n* mineralogist J.F. Child,\n* botanist and zoologist Harry Fisher—who in 1896 was replaced by William Speirs Bruce,\n* Blomkvist, originally part of the ship crew,\n* Sidney Burgess who acted as cook,\n* Wm. Hayward who was later in charge of cooking,\n* biologist David Wilton who was responsible for the dogs.\nVoyage\n1894\nThe expedition's supply ship was the Windward, a Peterhead whaler built for ice navigation and equipped with a steam engine. On 12 July 1894, Windward sailed from Greenhithe for Arkhangelsk, where supplies such as Siberian ponies and Samoyed fur outfits were loaded, and further to Khabarovo where among additional supplies, 30 Siberian dogs were taken aboard. After navigating her way through the ice-laden Arctic Ocean, the ship finally reached Franz Josef Land on 7 September.\nHere the expedition made its first discovery, Windward Island. Jackson eventually decided to set up camp at Cape Flora. The expedition constructed two log houses, an observatory, and four store houses. They called their temporary settlement Elmwood in honour of expedition sponsor Harmsworth's residence in Kent. The plan had been for the Windward to return to England for the winter, but the rapidly returning sea ice meant that the ship and her crew had to stay for the winter as well. The men passed the winter with active exercise, such as football and hockey games, and hunting for bears. One of the Windward's crew members died from scurvy during the winter due to his refusal to eat meat.\n1895\nOn 10 March 1985 Jackson, Armitage, and Blomkvist made a journey north to Peter Head with two ponies and four sledges, establishing a series of depôts. On the second journey which started on 16 April, the party was joined by Koettlitz and Heyward, another pony and 2 more sledges. The softened ice floes caused considerable trouble to the ponies who sank and broke through the ice and had to be dragged out on occasion. They traced the previous route to Peter Head and continued to Dundee Point to the northeast, and from there north to the west coast of Jackson Island, setting up further depôts along the way. The land they failed to encounter on their route established that Zichy Land was not a continuous landmass stretching further to the north, but rather a collection of islands.\nOn 11 July, Jackson, Armitage, Fisher, Child, Blomkvist, and Koettlitz set out in the whaleboat Mary Harmsworth to chart the area to the northwest. They reached and climbed Cape Grant, Cape Crowther and Cape Neale, from which they discovered and named Cape Fridtjof Nansen, all along the Western coast of Prince George Land. They rounded Cape Ludlow and Lofley of Alexandra Land where they discovered Cape Mary Harmsworth, its westernmost point. Before they could reach it, the Mary Harmsworth was caught in a snow storm lasting several days and blowing her a considerable distance away from land. As the wind subsequently changed direction, the party was able to sail back to Cape Grant. After repairing the boat and waiting out another six-day storm in a tent, they were able to return to Elmwood, just before a large amount of sea ice would have made boat travel nigh impossible. Mary Harmsworth was the wife of the expedition's sponsor.\n1896\n, 17 June 1896 (a posed photograph taken hours after the initial meeting)]]\nWith one pony and 16 dogs, Jackson, Armitage, and Blomkvist embarked on another sledge journey on 18 March 1896. After being able to add Koettlitz Island to the map, they reached and climbed Cape Richthofen on the west coast of what is now called Luigi Island. From the observations made of the vast Queen Victoria Sea stretching immediately to the north and the dark water-sky, Jackson finally concluded what he had suspected the previous year, that Franz Josef Land didn't extend far northwards and that there was an expanse of open water not traversable by sledges. Having come to the conclusion that further exploration northward was pointless, the party returned via Allen Young Sound, sighting and naming Nansen, Wilton, Bromwhich, Jeaffreson, Royal Society, and Scott-Keltie Island.\nOn 17 June 1896, Jackson was startled by the sudden appearance of \"a tall man, wearing a soft felt hat, loosely made, voluminous clothes, and long shaggy hair and beard\". This proved to be Fridtjof Nansen, who with his sole companion Hjalmar Johansen had been living on the ice since leaving the expedition ship Fram on 14 March 1895. It was the purest chance that had brought Nansen and Johansen to the Jackson–Harmsworth expedition camp.\nOn the basis of Nansen's account of his journey Jackson seriously considered making a bid for the Pole himself, and began to build replicas of Nansen's sledges and kayaks. However, the lack of skiing and ice travel experience within Jackson's party meant that such plans were quickly aborted.\n1897\nIn March 1897 Jackson and Armitage went on a sledge expedition with the remaining one horse and 13 dogs. They followed the British Channel to the northeast edge of Prince George Land where they discovered Arthur Island. They travelled on the northern glacierized shore of Alexandra Land to Cape Mary Harmsworth in the very west, where they headed back to Elmwood. Due to the extremely bad weather throughout the trip, the pony, and all but five of the dogs had perished, so a large share of the equipment and food had to be abandoned. On 5 June they reached Eira Lodge on Bell Island, a store house erected by Benjamin Leigh Smith's expedition in 1881. Here they were joined by Koettlitz, Bruce, and Wilton who had started out to meet them with a sledge of provisions.\nA final attempt of skiing to the area of Brady Island for mapping purposes had to be aborted because their sledge broke through the unstable ice.\nThe Windward arrived in July, taking the expedition members aboard. Before bringing them to London, they rounded Cape Mary Harmsworth, the area beyond which they were able to study.\nResults & Reception\nThe expedition did not succeed in finding a path towards the North Pole. However it carried out substantial surveying work, which helped complete the map of Franz Josef Land. 611 new zoological species were discovered, significantly more than in previous Arctic expeditions. The use of ponies in polar expeditions pioneered and, even though largely unsuccessful, endorsed by Jackson, convinced the later expeditions of Ernest Shackleton and Robert Falcon Scott to bring them to Antarctica. The expedition also demonstrated the importance of fresh meat consumption to prevent scurvy, a matter on which they were advised by Dr. William Neale, the surgeon of the previous Leigh Smith expeditions. The view of the expedition as a well-planned and scientifically organised endeavour has been to some degree overshadowed by the scale of Jackson's hunting being deemed excessive, and by the conflicts resulting from Jackson's poor personal leadership qualities.\nReferences\nSources\n* Fleming, F. (2001). Ninety Degrees North  London: Granta Books. .\n*\n*\n*\n*\n|jstor = 1774430\n|url = https://zenodo.org/record/1449206\n}}\n* Huntford, R. (2001). Nansen  London: Abacus. .\n*\n}}\nExternal links\n* [https://archives-manuscripts.dartmouth.edu/repositories/2/resources/1083 The Logbooks of the Supply Ship Winward] at Dartmouth College Library"
    }
  ]
}