{
  "content": [
    {
      "type": "text",
      "text": "# Jack Butler (Jiwarli)\n\nJack Butler (4 May 1901 – April 1986) was an Indigenous Australian and perhaps the last speaker of the Jiwarli dialect.\nEarly life\nJack Butler was born on 4 May 1901 at Wilukampal (also known as Caraline Creek and Caraline Well), an outcamp near Moroonah Station in northwestern Western Australia. His mother,  called Silver in English, was a Tharrkari woman who worked as a cook at the outcamp. His father was Dick Butler, a white shepherd who moved to Darwin. His stepfather, Jinapuka, also known as Yawartawari, was a Warriyangka man.\nIn 1905 or 1906 Butler and his family moved to Glennflorrie Station, where he helped to look after male elders. In 1923 the family moved to Gifford Creek Station on the West Lyons River. In 1926 Butler moved to Mount Stuart Station and in 1927 he married Molly Ashburton, a Thalanyji woman. They had four children – Paul, Maggie, Sid and Claude – between 1928 and 1938.\nJiwarli language\nWith his younger brother Joe Butler, Jack Butler was one of the last speakers of the Jiwarli dialect and contributed to its study and documentation. Between 1978 and 1986 he collaborated with linguist Peter Austin to document Jiwarli history, language and culture, and to create a Jiwarli dictionary and story collection. Butler and Austin recorded more than 70 texts and a lexicon of around 1500 words, as well as related linguistic recordings. Butler's recordings provide one of the only audio documentations of Jiwarli.\nIn 1985 he recounted two stories from his childhood to Austin in Jiwarli. One story describes an earthquake in about 1906. The other describes the appearance of Halley's Comet in 1910. The stories are culturally, linguistically and historically significant, as they provide evidence that traditional Jiwarli cultural and family life were relatively intact when Butler was a child. According to Austin, although white colonisation of the area began in the 1860s, it was not until the expansion of the Western Australian pearling industry and its forced labour system in the 1920s that traditional Jiwarli life was \"irreparably disrupted\".\nReferences\nExternal links\n*[http://www.linguistics.unimelb.edu.au/research/jiwarli/jack.butler.html Information on the Jiwarli language and culture]\n*[https://jiwarli.com/2015/06/18/what-does-jiwarli-sound-like/ Sound recording of Jack Butler speaking Jiwarli]\n*[https://jiwarli.com/jiwarli-speaker/ Biography of Jack Butler]"
    }
  ]
}