{
  "content": [
    {
      "type": "text",
      "text": "# Jack Kingston\n\n| term_start1 = January 3, 1993\n| term_end1 = January 3, 2015\n| predecessor1 = Lindsay Thomas\n| successor1 = Buddy Carter\n| state_house2 = Georgia\n| district2 = 125th\n| term_start2 = January 7, 1985\n| term_end2 = January 3, 1993\n| predecessor2 = Bobby Phillips\n| successor2 = Eric Johnson\n| birth_name = John Heddens Kingston\n| birth_date =\n| birth_place = Bryan, Texas, U.S.\n| death_date =\n| death_place =\n| party = Republican\n| spouse =\n| children = 4\n| education = University of Georgia (BA)\n}}\nJohn Heddens Kingston (born April 24, 1955) is an American businessman, lobbyist, and politician who served as U.S. representative for  in southeast Georgia, serving from 1993 to 2015. He is a member of the Republican Party and was part of the House leadership (2002–06) when he served as vice-chair of the Republican Conference. In 2014, he ran for the U.S. Senate seat occupied by retiring senator Saxby Chambliss and advanced beyond the May 20 primary to the July 22 runoff, where he was defeated by David Perdue.\nEarly life and education\nKingston was born on April 24, 1955, in Bryan, Texas. He is the son of Martha Ann (née Heddens) and Albert James Kingston Jr., a widely published university professor, who co-founded the National Reading Conference. His father was born in Brooklyn and his mother in Los Angeles. As a child, Kingston lived briefly in Ethiopia. He grew up in Athens, Georgia. Kingston received a Bachelor of Arts in Economics from the University of Georgia in 1978, where he also joined Lambda Chi Alpha and the Demosthenian Literary Society. He is an Episcopalian.\nEarly career\nHe has lived in Savannah since 1977. Before entering politics in 1982, he sold insurance and worked in agribusiness throughout southeastern Georgia. He was vice president of Palmer, Cay and Carswell from 1979 to 1992.\nGeorgia House of Representatives\nElections\nIn 1984, Kingston defeated Democratic candidate Bobby Phillips 62%–38%. He won re-election in 1986, 1988, and 1990 all unopposed.\nCommittee assignments\n* House Committee on Ways and Means\nU.S. House of Representatives (1993–2015)\nElections\nIn 1992, Kingston gave up his seat in the state house to pursue a congressional run in Georgia's 1st congressional district after five-term Democratic incumbent Lindsay Thomas announced his retirement. The district had been one of the first areas of Georgia where the old-line conservative Democratic Party voters had begun splitting their tickets and voting Republican at the national level. While conservative Democrats represented much of this area in the state legislature well into the 1990s, the district has only supported a Democratic nominee for president once since 1960, when Jimmy Carter swept every county in the state during his successful run for the presidency in 1976.\nKingston won the election with 58% of the vote, becoming the first Republican to represent this district since Reconstruction, and the first to win an undisputed election in the district in 118 years. Kingston was helped by the 1990s round of redistricting, which significantly altered the district. The 1st had been based in Savannah for over a century. However, redistricting shifted most of Savannah's African-American residents to the newly created 12th District.\nKingston was reelected 10 times, never dropping below 63% of the vote and even running unopposed in 1998 and 2004. Even when the district included all of Savannah (as was the case from 1996 to 2002 and again after the 2010s round of redistricting), Kingston was reelected without serious difficulty.\nTenure\nFrom 2003 through the end of 2006, Kingston served as vice-chairman of the House Republican Conference, the sixth-ranking post among House Republicans. An early attempt to become chair of the influential House Appropriations Committee in the 112th Congress (2011–2013) was unsuccessful. Kingston was an early supporter of earmark reforms and spending reductions. Throughout his tenure, Kingston has received over 40 awards on a diversity of issues from various interest groups.\nTaxes\nKingston signed the Taxpayer Protection Pledge by the Americans for Tax Reform, and in 2009 he was named a \"Taxpayer Hero\" by the Council for Citizens Against Government Waste for his votes to reduce government spending and taxes.\nIn 2010 Kingston signed a pledge sponsored by Americans for Prosperity promising to vote against any Global Warming legislation that would raise taxes.\nHealthcare\nKingston is a supporter of Medicare prescription drug coverage. He has voted to allow HMOs to be sued, and also to limit damages and shorten time limits for medical lawsuits. In 2010, he voted against the Affordable Care Act, asserting the bill would raise premiums, taxes, and cut Medicare.\nEnergy\nKingston has voted to bar the EPA from regulating greenhouse gases, and voted to add pollutants to the Clean Water Act. He has voted against tax incentives for renewable energy and in favor of opening the Outer Continental Shelf to oil drilling.\nGun control\nKingston voted to loosen restrictions on interstate gun purchases and to allow veterans to register unlicensed guns acquired abroad.\nClinton impeachment\nIn November 1997, Kingston was one of eighteen Republicans in the House to co-sponsor a resolution by Bob Barr that sought to launch an impeachment inquiry against President Bill Clinton. The resolution did not specify any charges or allegations. This was an early effort to impeach Clinton, predating the eruption of the Clinton–Lewinsky scandal. The eruption of that scandal would ultimately lead to a more serious effort to impeach Clinton in 1998. On October 8, 1998, Kingston voted in favor of legislation that was passed to open an impeachment inquiry. On December 19, 1998, Kingston voted in favor of all four proposed articles of impeachment against Clinton (only two of which received the needed majority of votes to be adopted).\nSavannah Harbor Expansion Project\nBeach Renourishment Sand Throwing Ceremony in 2014]]\nKingston sponsored legislation in 1999 to authorize the expansion of the Savannah harbor in order to accommodate larger vessels.\nWashington work week\nRegarding the extension of the House work week from 3 days to 5 in 2006, Kingston commented, \"Keeping us up here eats away at families. Marriages suffer. The Democrats could care less about families – that's what this says.\" He added, \"Time away from Washington is just as important to being an effective member of Congress as time spent in the Capitol. When I'm here, people call me Mr. Congressman. When I'm home, people call me 'Jack, you stupid SOB, why did you vote that way?' It keeps me grounded.\"\nSchool Lunch Program\nIn an address to the Jackson County Republican Party, on December 14, 2013, Kingston, who is on the House Agricultural Committee, which oversees the federal school lunch program for the underprivileged, commented that it may be beneficial for students to \"...sweep the floor in the cafeteria\" to promote a work ethic and \"instill in them that there is, in fact, no such thing as a free lunch.\"\nKingston has said he was not \"allegedly\" advocating that poor children be singled out but rather that all children should perform chores to learn work ethic but emphasised those students specifically that were getting free lunches as the ones that should be working. \"This is not targeted to any one group. It would be very helpful for kids in any socio-economic group to do chores and learn the work ethic. Those kids aren't there because of any fault of their own and I never suggested that they were,\" Kingston said on CNN.\nLegislation\nKingston has sponsored 103 bills and resolutions, including:\n103rd Congress (1993–1994)\n* H.R. 3563, a bill to exempt U.S. ships from the radio and equipment requirements of the Global Maritime Distress and Safety System, introduced November 19, 1993\n* H.R. 4743, a bill to provide that carriage of an item of equipment to be used under a federal contract for cleaning up radioactive waste from the production of nuclear weapons is not coastwise trade, introduced July 13, 1994\n105th Congress (1997–1998)\n* H.R. 2658, a bill to prohibit the Internal Revenue Service (IRS) from using the threat of audit to compel a taxpayer to agree to or sign the Tip Reporting Commitment Agreement or the Tip Rate Determination Agreement, introduced October 9, 1997\n* H.R. 4144, a bill to restore and maintain property on Cumberland Island, introduced June 25, 1998\n106th Congress (1999–2000)\n* H.R. 4793, a bill to waive the requirement that hospitals have an obstetrician in order to be designated as a Disproportionate share hospital for certain critical access hospitals or essential rural health care providers, introduced June 29, 2000, reintroduced in the 107th Congress as H.R. 2553\n107th Congress (2001–2002)\n* H.R. 5176, a bill to permit individuals who are not in the prescription drug business to import drugs if they appear to be approved, non-narcotic, and produced by a registered producer, and to create a program to allow for physicians to import drugs that meet the foregoing requirements if no drugs are otherwise available, excluding controlled substances and biological agents, introduced July 23, 2002\n109th Congress (2005–2006)\n* H.R. 4409, a bill to reduce national oil consumption, to reduce fuel consumed by the United States Postal Service by eliminating Saturday mail delivery, to create a tire efficiency program, to create a tax credit for reducing idling, to create a research and development program for electric cars, to create a loan program for the development of hybrid technology, to create an advanced technology motor vehicles manufacturing credit, to create a qualified flexible fuel hybrid and plug-in hybrid motor vehicle credit, to reduce petroleum consumed by federal vehicles by 20%, to create a fuel efficiency tax credit, to include ethanol as at least 10% of ground transportation fuel, to increase the alternative fuel vehicle refueling property credit, to establish the Alternative Fueling Infrastructure Trust Fund, to promote the development of public transit in urban areas, and to promote the use of biofuels, introduced November 18, 2005. Versions of many of this bill's provisions were later included in the Energy Independence and Security Act of 2007.\n110th Congress (2007–2008)\n* H.R. 6404, a bill to create a 350,000 $1 commemorative coins celebrating 100 years since Girl Scouts of the USA's founding with a $10 surcharge on the purchase of the coins, with purchasing being restricted to 2011, and with all revenue generated to be allocated to Girl Scouts of the USA, introduced June 26, 2008. A modified version of this bill that restricted purchases to 2013 was introduced in the 111th Congress as H.R. 621, and was signed into law October 29, 2009.\n111th Congress (2009–2010)\nin 2010]]\n* H.R. 3226, a bill to prohibit any federal funds from being used to pay salary to or support the activities of czars if they aren't approved by the Senate, if they are excepted from the competitive service by reason of the confidential, policy-determining, policy-making, or policy-advocating character of the position, and perform functions that could be performed by someone approved by the Senate, introduced July 15, 2009\n* H.R. 5958, a bill to allow for members of the armed services above the age of 18 but below 21 to purchase and consume alcoholic beverages on military installations if the beverage is intended to be consumed on-site, introduced July 29, 2010\n112th Congress (2011–2012)\n* H.R. 3444, a bill to require individuals claiming the tax credit to include the names and identification numbers of qualifying children, introduced November 16, 2011, reintroduced in the 113th Congress as H.R. 2778\n* H.R. 3601, a bill to require individuals receiving unemployment compensation to test negative for drug tests prior to receiving such compensation, introduced December 7, 2011, reintroduced in the 113th Congress as H.R. 3454\n113th Congress (2013–2014)\nAssociation of Georgia]]\n* H.R. 2779, a bill to create an Inspector General for the Consumer Financial Protection Bureau, introduced July 22, 2013\n* H.R. 3104, a bill to exclude all federal employees, including members of Congress, the President, and the Vice President, from receiving any federally funded health care premium subsidies under the Patient Protection and Affordable Care Act (PPACA), introduced September 16, 2013. A modified version of this bill that also prohibits federal employees from enrolling in any plans that aren't offered in the PPACA's exchanges was later introduced as H.R. 3164 and reintroduced as H.R. 3562.\n* H.R. 3277, a bill to prohibit the U.S. federal government from making any voluntary contributions to the United Nations and any agencies of the United Nations, introduced October 8, 2013\n* H.R. 3340, a bill to require that profits made by Fannie Mae and Freddie Mac be allocated to reducing the federal government's debt, introduced October 24, 2013\n* H.R. 3339, a bill to prohibit the Department of Education from developing, implementing, or evaluating any multi-state education standards, or from providing financial assistance to any entity that requires or authorizes such activity, and to prohibit the Secretary of Education from requiring states to implement multi-state standards as a condition of being eligible for federal education funds, introduced October 24, 2013\n* H.R. 3420, a bill to require that any information disseminated by the federal government using public funds for the purpose of advertising or educating the public about the PPACA is to be accompanied by a statement that the Congressional Budget Office (CBO) has concluded that the PPACA costs $1.76 trillion over the next decade, introduced October 30, 2013. If signed into law, individuals may be misled about the PPACA, as the $1.76 trillion figure is an estimate of the gross costs of the law's insurance coverage provisions, not the net costs of the entire law. On net, the CBO projects the PPACA to reduce the federal government's budget deficit by more than $100 billion over the next ten years;\n* H.R. 3419, a bill to exempt small businesses with a small business concern, as defined by the Small Business Act, from the PPACA's employer mandate, and to redefine a full-time employee, for the purpose of such mandate, as an individual who works for at least 40 hours a week, introduced October 30, 2013\n* H.R. 3523, a bill to allow for audits of IRS employees to determine compliance with tax laws, and to allow for the termination of any individual's employment at the IRS if he or she is found to be willfully not paying taxes or is found to have willfully understated his or her tax liability, introduced November 18, 2013\n* H.R. 3703, a bill to approve the construction of the Keystone XL Pipeline, introduced December 11, 2013\nCommittee assignments\nKingston's committee assignments in the 113th Congress (2011–2013) were:\n* Committee on Appropriations\n** Subcommittee on Agriculture, Rural Development, Food and Drug Administration and Related Agencies\n** Subcommittee on Defense\n** Subcommittee on Labor, Health and Human Services, Education, and Related Agencies (Chairman)\nCaucus memberships\n* Balanced Budget Amendment Caucus\n* Congressional Caucus on Unfunded Mandates\n* International Conservation Caucus\n* Liberty Caucus\n* Republican Study Committee\n2014 U.S. Senate election\nIn May 2013, Kingston officially announced he would run for the open U.S. senate seat being vacated by Republican U.S. Senator Saxby Chambliss.\nIn the third quarter of 2013, Kingston outpaced his House colleagues in campaign fundraising for the open Senate seat. He was endorsed in the race by Sean Hannity and Neal Boortz, as well as the U.S. Chamber of Commerce.\nAfter advancing past the May 20 primary to the July 22 runoff, Kingston lost to David Perdue with 49% of the vote.\nLater career\nKingston works as a public policy principal at the firm of Squire Patton Boggs in Washington. Since August 2015, he has been chairman of the Georgia Republican Party Foundation, the fundraising arm of the Georgia GOP. In 2016, he endorsed Ted Cruz for president, but later he served as senior advisor and spokesperson for the Donald Trump campaign. In 2017, he became a CNN political commentator. He was dropped from the network in February 2019.\nComments on Stoneman Douglas High School shooting\nOn February 18, 2018, four days after the Stoneman Douglas High School shooting which left 17 people dead, in an interview with CNN, Kingston suggested that the survivors of the massacre, who had organized to oppose gun violence, were being taken advantage of by \"left wing activists\" and funded by George Soros. His comments angered the survivors of the shooting who described them as \"despicable\" and called on Kingston to apologize.\nElectoral history\n{| class=\"wikitable\" style=\"margin:0.5em ; font-size:95%\"\n|+ : Results 1992–2024\n!|Year\n!|Democratic\n!|Votes\n!|Pct\n!|Republican\n!|Votes\n!|Pct\n|-\n|1992\n| |\n| align=\"right\" |75,808\n| |42%\n| |\n| align=\"right\" |103,932\n| |58%\n|-\n|1994\n| |\n| align=\"right\" |27,197\n| |23%\n| |Jack Kingston\n| align=\"right\" |88,788\n| |77%\n|-\n|1996\n| |\n| align=\"right\" |50,622\n| |32%\n| |Jack Kingston\n| align=\"right\" |108,616\n| |68%\n|-\n|1998\n| |(no candidate)\n| align=\"right\" |\n| |\n| |Jack Kingston\n| align=\"right\" |92,229\n| |100%\n|-\n|2000\n| |\n| align=\"right\" |58,776\n| |31%\n| |Jack Kingston\n| align=\"right\" |131,684\n| |69%\n|-\n|2002\n| |Don Smart\n| align=\"right\" |40,026\n| |28%\n| |Jack Kingston\n| align=\"right\" |103,661\n| |72%\n|-\n|2004\n| |(no candidate)\n| align=\"right\" |\n| |\n| |Jack Kingston\n| align=\"right\" |188,347\n| |100%\n|-\n|2006\n| |Jim Nelson\n| align=\"right\" |43,668\n| |31%\n| |Jack Kingston\n| align=\"right\" |94,961\n| |69%\n|-\n|2008\n| |Bill Gillespie\n| align=\"right\" |83,444\n| |34%\n| |Jack Kingston\n| align=\"right\" |165,890\n| |66%\n|-\n|2010\n| |Oscar L. Harris II\n| align=\"right\" |46,449\n| |28%\n| |Jack Kingston\n| align=\"right\" |117,270\n| |72%\n|-\n|2012\n| |Lesli Messinger\n| align=\"right\" |92,399\n| |37%\n| |Jack Kingston\n| align=\"right\" |157,181\n| |63%\n|-\n|2014\n|Brian Reese\n|61,175\n|39%\n|Buddy Carter\n|95,337\n|61%\n|-\n|2016\n|(no candidate)\n|\n|\n|Buddy Carter\n|210,243\n|100%\n|-\n|2018\n|Lisa Ring\n|105,942\n|42%\n|Buddy Carter\n|144,741\n|58%\n|}\nReferences\nExternal links\n*\n*\n|-\n|-\n''|years=}}"
    }
  ]
}