{
  "content": [
    {
      "type": "text",
      "text": "# Jack Buck Award\n\nJack Buck Award is an award named after former St. Louis broadcaster Jack Buck and presented by the Missouri Athletic Club. This award was established in 1987 and is presented to individuals in recognition of enthusiastic and dedicated support of sports in the city of St. Louis, Missouri.\n* 1987 – August A. Busch Jr., former brewer, prominent sportsman, and owner of the St. Louis Cardinals\n* 1988 – Ben Kerner, Bing Devine\n* 1989 – Joe Garagiola and Yogi Berra, national baseball figures and former catchers originally from St. Louis\n* 1990 – Robert Hyland, vice president and general manager of radio station KMOX for four decades\n* 1991 – Mike Shanahan, part-owner of the St. Louis Blues\n* 1992 – Ozzie Smith, St. Louis Cardinal Hall of Famer\n* 1993 – Michael Roarty, Anheuser-Busch marketing executive\n* 1994 – Stan Musial, St. Louis Cardinal Hall of Famer\n* 1995 – Thomas Eagleton, United States Senator from Missouri\n* 1996 – Bill DeWitt, Fred Hanser, Drew Baur, St. Louis Cardinals owners and executives\n* 1997 – Martin L. Mathews, co-founder the Mathews-Dickey Boys' Club\n* 1998 – Red Schoendienst, St. Louis Cardinal Hall of Famer\n* 1999 – Charles Michael Nash, head of the Boys Club of St. Louis\n* 2000 – Mr. and Mrs. Mike Jones, former St. Louis Rams who made the tackle that ended Super Bowl XXXIV\n* 2001 – Flint Fowler, longtime leader of the Boys & Girls Club of Greater St. Louis\n* 2002 – Walt Jocketty, St. Louis Cardinals general manager (1994-2007)\n* 2003 – Jerry Clinton, boxing aficionado who helped St. Louis regain an NFL team\n* 2004 – Tony LaRussa, St. Louis Cardinal Hall of Famer\n* 2005 – Jay Randolph, sportscaster\n* 2006 – St. Louis Cardinals\n* 2007 – John Davidson, St. Louis Blues president of hockey operations and former goaltender\n* 2008 – Kelly Chase, former St. Louis Blues player\n* 2010 – Ernie Hays, former St. Louis Cardinals organist\n* 2012 – Steven Jackson, former St. Louis Rams Pro Bowl running back\n* 2013 – Aeneas Williams, former St. Louis Rams All-Pro cornerback\n* 2015 – Dave Peacock, former president of Anheuser-Busch\n* 2017 - Tom Stillman, chairman of the St. Louis Blues\n* 2018 - Jim Crane, owner and chairman of the Houston Astros\n* 2019 – MLS4THELOU, owners of the St. Louis City SC MLS franchise\n* 2021 - Curtis Francois, World Wide Technology Raceway owner\n* 2022 - Bruce Affleck, executive and former player for the St. Louis Blues\n* 2023 - Brandon Williams, vice president of the St. Louis Battlehawks and former St. Louis Rams wide receiver\n* 2024 - Chris Zimmerman, president and CEO of the St. Louis Blues\nJack Buck Sports Personality of the Year\n* 1970 - Bob Gibson\n* 1971 - Joe Torre\n* 1972 - Al Onofrio\n* 1973 - Lou Brock\n* 1974 - Don Coryell\n* 1975 - Terry Metcalf\n* 1976 - Jim Bakken\n* 1977 - Ted Simmons\n* 1978 - Warren Powers\n* 1979 - Keith Hernandez\n* 1980 - Pat Tilley\n* 1981 - Mike Liut\n* 1982 - Whitey Herzog\n* 1983 - Roy Green\n* 1984 - Ozzie Smith\n* 1985 - Willie McGee\n* 1986 - Todd Worrell\n* 1987 - Rich Grawer\n* 1988 - Jackie Joyner-Kersee\n* 1989 - Pedro Guerrero\n* 1990 - Brett Hull and Hale Irwin\n* 1991 - Jimmy Connors\n* 1992 - Norm Stewart\n* 1993 - Curtis Joseph\n* 1994 - Charlie Spoonhour\n* 1995 - Brendan Shanahan\n* 1996 - Tony La Russa\n* 1997 - Dick Vermeil\n* 1998 - Mark McGwire\n* 1999 - Al MacInnis\n* 2000 - Kurt Warner\n* 2001 - Marshall Faulk\n* 2002 - Albert Pujols\n* 2003 - Isaac Bruce\n* 2004 - Scott Rolen\n* 2005 - Chris Carpenter\n* 2006 - Torry Holt\n* 2007 - Jason Isringhausen\n* 2008 - Gary Pinkel\n* 2009 - Adam Wainwright\n* 2010 - Sam Bradford\n* 2011 - Lance Berkman\n* 2012 - Matt Holliday\n* 2013 - Matt Carpenter\n* 2014 - T. J. Oshie\n* 2015 - Mike Matheny\n* 2016 - Vladimir Tarasenko\n* 2017 - Yadier Molina\n* 2018 - Miles Mikolas\n* 2019 - Craig Berube\n* 2021 - Paul Goldschmidt\n* 2022 - Nolan Arenado\n* 2023 - Bradley Carnell, head coach of Major League Soccer side St. Louis City SC\n* 2024 - Eli Drinkwitz, head coach of the Missouri Tigers\nReferences"
    }
  ]
}