{
  "content": [
    {
      "type": "text",
      "text": "# Jaden Schwartz\n\n| birth_place = Melfort, Saskatchewan, Canada\n| height_ft = 5\n| height_in = 10\n| weight_lb = 190\n| position = Left wing\n| shoots = Left\n| league = NHL\n| team = Seattle Kraken\n| former_teams = St. Louis Blues\n| ntl_team = Canada\n| draft = 14th overall\n| draft_year = 2010\n| draft_team = St. Louis Blues\n| career_start = 2012\n| career_end =\n}}\nJaden Schwartz (born June 25, 1992) is a Canadian professional ice hockey player and alternate captain for the Seattle Kraken of the National Hockey League (NHL). Schwartz was selected 14th overall by the St. Louis Blues in the 2010 NHL entry draft.\nIn 2008, Schwartz started junior ice hockey with the Notre Dame Hounds of the Saskatchewan Junior Hockey League (SJHL). He continued junior hockey with the Tri-City Storm of the United States Hockey League (USHL) the next season. In 2011, Schwartz committed to play at Colorado College, where he spent two seasons.\nIn March 2012, Schwartz signed a contract with the Blues, where he spent most of his professional career. However, for the 2012–13 season, due to the 2012–13 NHL lockout, Schwartz spent time with the Blues' American Hockey League (AHL) affiliate, the Peoria Rivermen. This would be the only time spent in the AHL in his career. Schwartz and the Blues won the Stanley Cup in 2019, and he led the team in scoring during the playoffs. In 2021, Schwartz was signed to a five-year contract by the Seattle Kraken.\nPlaying career\nJunior (2008–2010)\nSchwartz began his hockey career playing junior ice hockey for his hometown's Notre Dame Hounds in the Saskatchewan Junior Hockey League (SJHL). During the 2008–09 season with the Hounds, Schwartz finished fifth in the SJHL scoring rankings with 34 goals and 42 assists in 46 games. At the end of the season, he was named the SJHL's Rookie of the Year. Schwartz transferred to the Tri-City Storm of the United States Hockey League (USHL). Schwartz captured the 2009–10 USHL scoring title with 33 goals and 50 assists through 60 games. Following his USHL play, Schwartz was drafted 14th overall in the 2010 NHL entry draft.\nCollegiate (2010–2012)\nColorado College in March 2011.|200px]]\nOn January 22, 2008, Schwartz, although drafted by an NHL team, committed to play collegiate ice hockey with Colorado College of the Western Collegiate Hockey Association (WCHA) for the 2010–11 season. Schwartz helped Colorado College to an NCAA Tournament appearance, where the team was seeded in the West regional held at the Scottrade Center, in St. Louis. In the first round, he recorded two goals and two assists to help the fourth-seeded Colorado College defeat the reigning NCAA champion and number one-seeded Boston College 8–4. He also assisted on the lone goal, scored by his brother, Rylan, in the second-round game against Michigan. Schwartz finished his freshman season at Colorado College with 17 goals and 30 assists for 47 points through 30 games. His 47 points was the highest on the team. During the season, he would lead all freshmen nationally with 1.57 points per game.\nDuring his sophomore season at Colorado College, Schwartz recorded 15 goals and 26 assists for 41 points in only 30 games, missing six due to the World Junior Tournament. He led the Tigers in points and assists for the season; four of his 15 goals were recorded as game-winning goals, and five of his goals came on power plays. On March 10, 2012, Colorado College lost 4–3 in overtime to Michigan Tech in the first round of the WCHA playoffs.\nProfessional\nSt. Louis Blues (2012–2021)\nStanley Cup parade.]]\nOn March 12, 2012, Schwartz decided to forgo his final two years of NCAA eligibility and signed a three-year, entry-level contract with the St. Louis Blues, which added him to their NHL roster. After travelling and practicing with the team for a week, he was given his first opportunity for NHL play after winger Andy McDonald received a shoulder injury. Schwartz made his NHL debut on March 17, 2012, in Tampa Bay, skating on the second line with Jamie Langenbrunner and Patrik Berglund. During the game, he scored his first NHL goal, a game-winner, from his first NHL shot on the power play at the 19:24 mark of the first period, when he intercepted a rebound in front of the net and beat Tampa Bay goaltender Dwayne Roloson.\nDue to the 2012–13 NHL lockout, Schwartz was one of 25 to be sent down to the Blues' American Hockey League (AHL) affiliate, the Peoria Rivermen, to play the 2012–13 season. In 33 games with the Rivermen, he achieved 9 goals and 19 points, with a plus–minus rating of -14. Schwartz had an excellent 2013–14 season, collecting 25 goals and 56 points in 80 games, placing him fifth in the team's point production rankings. On September 27, 2014, Schwartz agreed to a two-year, $4.7 million contract extension with the Blues after an off-season surrounded with uncertainty about whether he would rejoin the club. Following Vladimir Sobotka's departure for the KHL's Avangard Omsk, Schwartz switched to number 17 beginning in the 2014–15 season, having previously worn number 9 in his Blues career. The change was made as a tribute to his late sister, who wore the number playing hockey at Yale before being diagnosed with leukemia. Schwartz went on to have yet another breakout season, accumulating 28 goals and 63 points.\nOn October 23, 2015, right after the beginning of the 2015–16 season, Schwartz suffered an ankle injury during practice.  On February 10, 2016, Schwartz was activated off of injured reserve after missing 49 games. After playing only 33 games in the season, Schwartz would collect 22 points. On July 15, the Blues signed Schwartz to a five-year contract for $26.75 million, in order to avoid arbitration. Schwartz got injured again, this time to his elbow, during the Blues' training camp on September 29, 2016, prior to the start of the next season. In the first 37 games after recovery, Schwartz scored only two goals. In the last 20, Schwartz picked up the pace and scored 5 goals and got 18 points. During the playoffs, Schwartz collected four goals and nine points in 11 games. On December 9, 2017, in a 6–1 victory over the Detroit Red Wings, Schwartz would suffer another ankle injury. Prior to the injury, Schwartz was ranked first on the team in both goals and points.\nDuring the 2018–19 season, Schwartz managed a decent 11 goals and 36 points through 69 games. During the playoffs, in a first round series against the Winnipeg Jets, Schwartz scored the game-winner in game five. 23 seconds into game six, Schwartz scored again. He then scored two more for a natural hat-trick, ultimately giving the Blues a 4–2 series win. Schwartz and the Blues went on to win the Stanley Cup in that season, St. Louis' first in their 52-year franchise history. Throughout the playoffs, Schwartz amassed two hat-tricks and led the Blues in playoff goals with 12, also collecting 8 assists. A COVID-19-shortened 2019–20 season saw Schwartz collect 22 goals through 71 games.\nIn November, after the beginning of the 2020–21 season, Schwartz's father, Rick, suffered a fatal heart attack at age 59. However, Schwartz made the decision to play that season. In a four-game first round playoff series against the Colorado Avalanche, Schwartz failed to score a single point.\nSeattle Kraken (2021–present)\nFollowing the 2020–21 season, his tenth with the Blues and having concluded his contract, Schwartz embarked upon free agency for the first time in his career. On July 28, 2021, Schwartz was signed by the Seattle Kraken, an expansion team, agreeing to a five-year, $27.5 million contract. In a game on December 29, against the Philadelphia Flyers, Schwartz fell victim to a hand injury. On January 6, 2022, the Kraken announced Schwartz would not be able to play for about a month as the injury would require surgery. Out longer than expected, he was activated from the injured reserve on March 5.\nSchwartz scored the first playoff goal in Seattle in nearly 104 years on April 22, 2023, against the Colorado Avalanche, in game three of the Stanley Cup playoffs.\nInternational play\nCanada}}\nWest}}\nSchwartz represents Canada internationally. His first experience with Hockey Canada came while representing Canada West at the World Junior A Challenge in 2008, capturing a silver medal, after falling to the United States in what would have been Canada's third consecutive gold. He would also play at the World U-17 Hockey Challenge in 2009, with a fourth-place finish. Schwartz helped Canada capture a gold medal at the 2009 Ivan Hlinka Memorial Tournament. Schwartz scored a goal and added an assist in the gold medal game. He was selected to represent Canada at the 2011 World Junior Championships. In his second game of the tournament, against the Czech Republic, Schwartz suffered a fractured ankle and was sidelined for the rest of the tournament. He was selected the next year to Team Canada for the 2012 World Junior Championships in Edmonton and Calgary and named team captain. Playing Russia in the semifinal, Schwartz recorded a goal and five shots to be named Canada's player of the game in a 6–5 losing effort. He finished the tournament with two goals and three assists for five points over six games, as Canada won the bronze medal over Finland.\nOn April 12, 2018, Schwartz was named to Team Canada's senior team for the first time to compete at the 2018 IIHF World Championship. However, on May 18, he was injured and missed the rest of the competition.\nPersonal life\nSchwartz was born in Melfort, Saskatchewan, and grew up in Wilcox, Saskatchewan, to parents Rick and Carol Schwartz. He has an older brother, Rylan, who also played hockey at Colorado College, and as of 2025, plays for the Glasgow Clan of the UK Elite Ice Hockey League, and an older sister, Mandi, who played hockey with the Yale Bulldogs team until she was diagnosed with acute myeloid leukemia in December 2008. Despite trying to find a donor for Mandi and, in the process, raising awareness of bone marrow and stem cell transplants, Mandi would die in April 2011 following a third relapse of the cancer.\nCareer statistics\nRegular season and playoffs\n{| border=\"0\" cellpadding=\"1\" cellspacing=\"0\" style=\"text-align:center; width:60em;\"\n|- style=\"background:#e0e0e0;\"\n! colspan=\"3\" bgcolor=\"#ffffff\" | &nbsp;\n! rowspan=\"99\" bgcolor=\"#ffffff\" | &nbsp;\n! colspan=\"5\" | Regular&nbsp;season\n! rowspan=\"99\" bgcolor=\"#ffffff\" | &nbsp;\n! colspan=\"5\" | Playoffs\n|- style=\"background:#e0e0e0;\"\n! Season\n! Team\n! League\n! GP !! G !! A !! Pts !! PIM\n! GP !! G !! A !! Pts !! PIM\n|-\n| 2008–09\n| Notre Dame Hounds\n| SJHL\n| 46 || 34 || 42 || 76 || 15\n| — || — || — || — || —\n|- style=\"background:#f0f0f0;\"\n| 2009–10\n| Tri-City Storm\n| USHL\n| 60 || 33 || 50 || 83 || 18\n| 3 || 3 || 0 || 3 || 0\n|-\n| 2010–11\n| Colorado College\n| WCHA\n| 30 || 17 || 30 || 47 || 22\n| — || — || — || — || —\n|-style=\"background:#f0f0f0;\"\n| 2011–12\n| Colorado College\n| WCHA\n| 30 || 15 || 26 || 41 || 18\n| — || — || — || — || —\n|-\n| 2011–12\n| St. Louis Blues\n| NHL\n| 7 || 2 || 1 || 3 || 0\n| — || — || — || — || —\n|-style=\"background:#f0f0f0;\"\n| 2012–13\n| Peoria Rivermen\n| AHL\n| 33 || 9 || 10 || 19 || 14\n| — || — || — || — || —\n|-\n| 2012–13\n| St. Louis Blues\n| NHL\n| 45 || 7 || 6 || 13 || 4\n| 6 || 0 || 1 || 1 || 2\n|-style=\"background:#f0f0f0;\"\n| 2013–14\n| St. Louis Blues\n| NHL\n| 80 || 25 || 31 || 56 || 27\n| 6 || 1 || 2 || 3 || 0\n|-\n| 2014–15\n| St. Louis Blues\n| NHL\n| 75 || 28 || 35 || 63 || 16\n| 6 || 1 || 2 || 3 || 0\n|-style=\"background:#f0f0f0;\"\n| 2015–16\n| St. Louis Blues\n| NHL\n| 33 || 8 || 14 || 22 || 8\n| 20 || 4 || 10 || 14 || 6\n|-\n| 2016–17\n| St. Louis Blues\n| NHL\n| 78 || 19 || 36 || 55 || 18\n| 11 || 4 || 5 || 9 || 2\n|-style=\"background:#f0f0f0;\"\n| 2017–18\n| St. Louis Blues\n| NHL\n| 62 || 24 || 35 || 59 || 26\n| — || — || — || — || —\n|-\n| 2018–19\n| St. Louis Blues\n| NHL\n| 69 || 11 || 25 || 36 || 16\n| 26 || 12 || 8 || 20 || 2\n|-style=\"background:#f0f0f0;\"\n| 2019–20\n| St. Louis Blues\n| NHL\n| 71 || 22 || 35 || 57 || 18\n| 9 || 4 || 0 || 4 || 4\n|-\n| 2020–21\n| St. Louis Blues\n| NHL\n| 40 || 8 || 13 || 21 || 20\n| 4 || 0 || 0 || 0 || 0\n|-style=\"background:#f0f0f0;\"\n| 2021–22\n| Seattle Kraken\n| NHL\n| 37 || 8 || 15 || 23 || 14\n| — || — || — || — || —\n|-\n| 2022–23\n| Seattle Kraken\n| NHL\n| 71 || 21 || 19 || 40 || 22\n| 14 || 5 || 5 || 10 || 2\n|-style=\"background:#f0f0f0;\"\n| 2023–24\n| Seattle Kraken\n| NHL\n| 62 || 13 || 17 || 30 || 24\n| — || — || — || — || —\n|-\n| 2024–25\n| Seattle Kraken\n| NHL\n| 81 || 26 || 23 || 49 || 24\n| — || — || — || — || —\n|- bgcolor=\"#e0e0e0\"\n! colspan=\"3\" | NHL totals\n! 811 !! 222 !! 305 !! 527 !! 237\n! 102 !! 31 !! 33 !! 64 !! 18\n|}\nInternational\n{| border=\"0\" cellpadding=\"1\" cellspacing=\"0\" style=\"text-align:center; width:40em\"\n|- ALIGN=\"center\" bgcolor=\"#e0e0e0\"\n! Year\n! Team\n! Event\n! Result\n! rowspan=\"99\" bgcolor=\"#ffffff\" | &nbsp;\n! GP !! G !! A !! Pts !! PIM\n|-\n| 2009\n| Canada Western\n| U17\n|\n| 6 || 2 || 4 || 6 || 2\n|- style=\"background:#f0f0f0;\"\n| 2009\n| Canada\n| IH18\n|\n| 4 || 0 || 4 || 4 || 0\n|-\n| 2011\n| Canada\n| WJC\n|\n| 2 || 1 || 2 || 3 || 0\n|- style=\"background:#f0f0f0;\"\n| 2012\n| Canada\n| WJC\n|\n| 6 || 2 || 3 || 5 || 4\n|-\n| 2018\n| Canada\n| WC\n| 4th\n| 8 || 0 || 4 || 4 || 0\n|- bgcolor=\"#e0e0e0\"\n! colspan=4 | Junior totals\n! 18 !! 7 !! 11 !! 18 !! 6\n|- bgcolor=\"#e0e0e0\"\n! colspan=4 | Senior totals\n! 8 !! 0 !! 4 !! 4 !! 0\n|}\nAwards and honors\n{| class=\"wikitable\"\n! Award\n! Year\n!\n|-\n! colspan=\"3\"|College\n|-\n| All-WCHA Rookie Team\n| 2010–11\n|\n|-\n| All-WCHA Third Team\n| 2010–11\n|\n|-\n| WCHA All-Tournament Team\n| 2011\n|\n|-\n| All-WCHA Second Team\n| 2011–12\n|\n|-\n| AHCA West First-Team All-American\n| 2011–12\n|\n|-\n! colspan=\"3\"|NHL\n|-\n| Stanley Cup champion\n| 2019\n|\n|}\nReferences\nExternal links\n*"
    }
  ]
}