{
  "content": [
    {
      "type": "text",
      "text": "# Jade War\n\nJade War is a 2019 fantasy novel by Fonda Lee published by Orbit and is the sequel to Jade City. It follows the island of Kekon as the jade-controlling clans are embroiled in an international war where jade is the centerpiece. The story takes place over several years. It is the second book in the Green Bone saga, followed by 2021's Jade Legacy, the final novel in the series.\nPlot\nKaul Sen passes away shortly after the events of Jade City. Just before his funeral, thief Bero and his partner Mudt steal jade from Kaul Lan's grave. Hilo struggles to maintain his power as the Pillar of No Peak and enters an uneasy truce with the Mountain. Outside of Kekon, war is waged between Shotar and Ygutan over the disputed Oortoko region of Shotar. Kekon's ally Espenia supports Shotar. Many Kekonese are ambivalent due to Shotar's colonization of Kekon prior to the Many Nation's War.\nAnden, still refusing to wear jade after killing Gont Asch in Jade City, is sent to the Espenian city of Port Massy to study. He initially struggles to fit in within Espenia. He learns that many Kekonese-Espenians have created their own clan under the leadership of Pillar Dauk Losen. He befriends and develops a romance with Dauk Cory, the Pillar's son.\nAt the same time, a jade smuggler named Zapunyo operates from the Uwiwan Islands. Zapunyo is supported in part by barukan, Kekonese-Shotarian jade users. Hilo meets Zapunyo, who offers Hilo an opportunity to profit off his jade smuggling. Hilo refuses, believing Zapunyo to be inconsequential.\nShae locates her predecessor, Doru, but hesitates to deliver clan justice. Doru kills himself instead. Wen, Hilo's wife, secretly continues her duties as a spy. Wen discovers that Lan had a son named Niko with his ex-wife, Eyni. Hilo travels to Stepenland to ask that Eyni let Niko be raised as a Green Bone. After Eyni refuses, Hilo kills her and takes Niko back to Janloon to become his heir.\nThe Mountain and No Peak publicly agree to peace. Street violence ceases, but the clans continue their conflict in a subtler way. The Mountain takes a nationalistic and ethnocentrist stance, while No Peak positions itself as a globalist clan. Ayt Mada leaks information that Shae once worked for the Espenian military. Shae challenges Ayt Mada to a duel; Shae loses and is nearly killed, but regains public respect. Shae maintains a secret relationship with a college professor Maro. She has an abortion after realizing that she cannot place her personal life ahead of clan matters, but does not inform Maro of this choice. Maik Kehn, Horn of No Peak and Wen's brother, is killed by a car bomb. Maro was blackmailed into letting the bombers into the Kaul family estate, as they threatened to kill his nieces if he did not help them. Shae is forced to kill Maro.\nHilo pursues Bero and Mudt, who have become involved in Zapunyo's illegal jade smuggling operation. Mudt betrays and seemingly kills Bero. Hilo kills Mudt, believing that he was Lan's murderer. Bero survives. He bitterly reveals information about the smuggling operation to No Peak, allowing them to cut off supplies of jade illegally leaving the country.\nHilo allies with the Port Massy Kekonese clan, strengthening No Peak's international position. Zapunyo travels to Port Massy for a surgery. Against Hilo's wishes, Shae and Wen conspire to kill him there. Dauk Losen agrees to help with this operation only if Anden will break up with Cory. Anden reluctantly agrees. They kill Zapunyo, but are ambushed by Port Massy gang members. Wen suffers permanent brain damage as a result of the attack, but Anden saves her life by putting on jade once more. Shae reveals to Hilo that she allowed Wen to step into harm's way, fracturing their relationship. Anden returns to Janloon and decides to become a physician.\nThe international war ends with an Ygutanian victory. The Mountain Clan takes in barukan refugees, swelling their numbers. Shae confronts Ayt Mada, and the conflict between the Mountain and No Peak resumes. Bero joins up with resistance fighters within Janloon who plan to overthrow the city's clan system.\nReception\nJason Sheehan of NPR was quick to notice the way \"Lee has created an entire modern world here, complete and round with its own history, customs, traditions, language\", as well as the way Jade War is \"broader and wider\" than the first novel. Sheehan noted the continued The Godfather references, saying that \"If The Godfather never was, Jade War (and Jade City) would be how we define generational organized crime stories today\" to acclaim Lee's work. He concluded that he admired the way Lee \"juggles the personal and the epic with deft, admirable skill...a magical, almost operatic crime and family drama...[with] jade-fueled supermen (and women) come with human hearts that bend and break the same as ours.\" Library Journal gave the novel a starred review, calling it a \"smart and action-filled fantasy\" complete with \"many female characters front and center,\" finding the set-up for Jade Legacy to be particularly well-done. Kirkus Reviews was also lavish in their praise, with their starred review adding that the story was a \"strong, thoughtful, and fast-paced ...that bodes well for future volumes.\" Fantasy Book Review also praised the novel heavily. Jade War earned a starred review and weekly pick status from Publishers Weekly, stating \"Lee’s story is sweeping, leisurely, and epic, and combines political intrigue with sharply choreographed action scenes, but it’s a character-driven family drama at its heart. Conflict ranges from delicate boardroom negotiations to dramatic duels, and from assassinations to all-out war, while the increasingly complex narrative continually ups the stakes.\"\nAwards and nominations\n{| class=\"wikitable sortable\"\n|+\n! Year\n! Award\n! Category\n! Result\n! Ref\n|-\n! rowspan=4 | 2020\n| Aurora Award\n| Novel\n|\n|\n|-\n| Dragon Awards\n| Fantasy Novel\n|\n|\n|-\n| Ignyte Awards\n| Novel – Adult\n|\n|\n|-\n| Locus Award\n| Fantasy Novel\n|\n|\n|}\nAdaptations\nIn 2020, it was announced that a TV series based on the first novel in The Green Bone Saga, Jade City, was being developed at Peacock, with Lee serving as a consulting producer. In July 2022, it was announced that Peacock had canceled the project, but Lee shared on Twitter that the team were seeking another service to take it up.\nReferences\nExternal links\n* [https://www.npr.org/2019/07/28/745438950/jade-war-is-a-magical-operatic-crime-and-family-drama 'Jade War' is a Magical, Operatic Crime and Family Drama], Jason Sheehan, NPR\n* [https://www.publishersweekly.com/9780316440929 Jade War by Fonda Lee], Publishers Weekly\n* [https://www.libraryjournal.com/review/jade-war Jade War by Fonda Lee], Library Journal\n* [https://www.kirkusreviews.com/book-reviews/fonda-lee/jade-war-the-green-bone-saga/ Jade War by Fonda Lee], Kirkus Reviews"
    }
  ]
}