{
  "content": [
    {
      "type": "text",
      "text": "# Jagath Gunawardena\n\nMajor General Jagath Gunawardena,  RSP, VSV, USP was a Sri Lankan senior army officer. He was the Chief of Staff of the Sri Lankan Army, having served as the Commandant of the Volunteer Force, Commander, Security Forces Headquarters – Wanni and Master General of Ordnance. He served as the Colonel Commandant of the Sri Lanka Engineers.\nEarly life and education\nBorn in Colombo on 15 December 1965, Gunawardena was educated at D. S. Senanayake College. He has gained a Bachelor of Science (Honours) degree in War Studies from the University of Baluchistan, a Masters in Defence Studies from the University of Kelaniya, a Post Graduate Diploma with Merit in Conflict Resolution and Peace Preparedness, a Master of Arts with Merit in Conflict Resolution from the University of Bradford, a Master in National Security Administration from the University of Philippines, a Diploma in Senior Level Defence Management from University of Indore and Diploma in Human Rights from Institute of Human Rights, Colombo. His father was a colonel in the Sri Lanka Army\nMilitary career\nEarly career\nGunawardena joined the Regular Force of Sri Lanka Army on 18 January 1985. Following his basic officer training at the Sri Lanka Military Academy in Diyatalawa, he was commissioned as a second lieutenant in the 1 Field Engineer Regiment, Sri Lanka Engineers and attended the Young Officers Course at the College of Military Engineering, Pune. He served as a field engineering officer in several operations as the Sri Lankan Civil War escalated and was wounded in 1991 during Operation Balavegaya. Having completed the Mid Career Course and Bomb Disposal Course at the Military College of Engineering, Risalpur he served as the officer commanding of the Explosive Ordnance Disposal (EOD) Unit of the Sri Lanka Engineers.\nField command and staff appointments\nGunawardena attended the Army Command and Staff College in its second intake and won the ‘Commandant's Golden Pen’ award for best research paper in 1999 and later attended the Command and Staff College, Quetta. He served as GSO III (Operations) in a Divisional HQ and  GSO II at the Colombo Military Hospital. Gunawardena had served as an officer instructor, adjutant and staff officer at the Sri Lanka Military Academy and Directing Staff at the Defence Services Command and Staff College he had served as the head of the training team, army wing.\nHaving been promoted to the rank of lieutenant colonel, he served as the commanding officer of the 8 Field Engineer Regiment and 6 Field Engineer Regiment in 2003. During this time he was the head of the mine action technical committee in Vavuniya. Later he served as the GSO I (Operations) in the Reserve Strike Force (53 Division), GSO I (Training) at Army Headquarters, and Colonel General Staff of the 56 Division. He attended the Senior Command Course at Army War College, Mhow and graduated from the National Defense College of the Philippines.\nHigher command\nHe was the brigade commander, 524 Infantry Brigade and centre commandant, Sri Lanka Engineers. Serving as brigade commander, Engineer Brigade; he established the first CBRN squadron of the army, which later became the 14 CBRN Regiment, Sri Lanka Engineers and took part in the Sri Lanka Army Rescue Operations Contingent sent to aid in the April 2015 Nepal earthquake. He had served as the general officer commanding, 57 Division; principal staff officer to the Commander of the Army; Deputy Military Liaison Officer, Ministry of Defence; Director Plans, Army Headquarters and was Master General of Ordnance in February 2018. Thereafter he was appointed Commander, Security Forces Headquarters – Wanni, serving until his appointment as Commandant of the Volunteer Force. He was appointed Colonel Commandant of the Sri Lanka Engineers on 25 July 2019. He was appointed Chief of Staff of the Sri Lankan Army on 2 May 2020.\nDecorations\nGunawardena has been awarded the Rana Sura Padakkama for gallantry, the Vishista Seva Vibhushanaya and Uttama Seva Padakkama for distinguished service.\nReferences"
    }
  ]
}