{
  "content": [
    {
      "type": "text",
      "text": "# Jagjaguwar\n\n| founder = Darius Van Arman\n| distributor = Secretly Distribution\n| genre = Various\n| country = United States\n| location = Bloomington, Indiana\n| website =\n}}\nJagjaguwar is an American independent record label based in Bloomington, Indiana.\nHistory\nIn 1996, in Charlottesville, Virginia, University of Virginia student Darius Van Arman, later Jagjaguwar's founder, was a music director at UVA's WTJU radio station, a clerk at the Plan 9 Records store, art director at Charlottesville's C-Ville Weekly, an overnight supervisor for an adult-care facility, and booking shows at The Tokyo Rose.\nDuring this time, Adam Busch (who also would put music out on Jagjaguwar as Manishevitz), was part of a band called The Curious Digit. The band needed a label, and Van Arman made The Curious Digit's Bombay Aloo the first release under his new Jagjaguwar label. The name \"Jagjaguwar\" was generated using a Dungeons & Dragons character name-generating computer program. Shortly thereafter, Richmond band Drunk learned about Jagjaguwar and Drunk member Rick Alverson reached out to Van Arman to see if there was room for one more band on the label. He booked them to play at Tokyo Rose and then signed them to the label on the spot.\nIn 1999, Van Arman and Chris Swanson, who was part owner of the record label Secretly Canadian, became friends and soon partners. Fairly early on in those exchanges, Van Arman suggested a partnership in Jagjaguwar.\nVan Arman relocated to Bloomington in 1999, and Jagjaguwar and Secretly Canadian grew closer. Van Arman soon became a partner in Secretly Canadian; further, other Secretly Canadian partners, Ben Swanson and Jonathan Cargill, joined Van Arman and Chris Swanson in a Jagjaguwar partnership.\nIn 2001, a demo from Austin, Texas-based folk band Okkervil River was sent to Chris Swanson. With each Okkervil River release on Jagjaguwar—''Don't Fall in Love with Everyone You See (2002), Down the River of Golden Dreams (2003), Sleep and Wake-Up Songs (2004) and Black Sheep Boy'' (2005), the band's profile grew. Much of Black Sheep Boy was written at Van Arman's house in Bloomington when Will Sheff stayed with him for some months.\nAlongside Okkervil River's releases, Jagjaguwar also released the debut album from Vancouver band Black Mountain. Following Black Mountain's debut, Jagjaguwar signed more artists to the label including Wilderness, The Besnard Lakes, and Sunset Rubdown.\nIn 2007, Jagjaguwar signed Eau Claire, Wisconsin project Bon Iver (led by Justin Vernon), whose self-recorded album For Emma, Forever Ago (2008) had seen a grassroots groundswell based on just a handful of CD-R copies Vernon was selling at shows. The initial pressing of For Emma, Forever Ago sold out within the first few weeks. For Emma, Forever Ago received a sales certification of Gold in 2012, the same week Bon Iver's self-titled follow up album, Bon Iver, went gold.\nSharon Van Etten released her Jagjaguwar debut, Tramp, in 2012, and her second album, Are We There, in 2014. Unknown Mortal Orchestra signed to Jagjaguwar to release their sophomore album II (2013). In spring 2015, they released another album, Multi-Love.\nIn 2007, Jagjaguwar's became part of the Secretly Group.\nIn 2018, Jagjaguwar was listed at number 4 on Paste magazine's top 10 record labels of 2018.\nArtists\nReferences\nExternal links\n*"
    }
  ]
}