{
  "content": [
    {
      "type": "text",
      "text": "# Jagtar Singh Hawara\n\n| birth_place       = Hawara, Fatehgarh Sahib, Punjab, India\n| death_date        =\n| death_place       =\n| death_cause       =\n| spouse            =\n| relations         =\n| alma_mater        =\n| other_names       =\n| citizenship       = Indian\n| education         =\n| years_active      =\n| employer          =\n| organization      = Babbar Khalsa\n| agent             =\n| known_for         = Assassination of Beant Singh, 12th Chief Minister of Punjab2004 Burail jailbreak\nBeing declared Jathedar of the Akal Takht by a Sarbat Khalsa\n| notable_works     =\n| style             =\n| home_town         =\n| height            = 5ft 11in\n| party             =\n| movement          = Khalistan movement  Dharam Yudh Morcha\n| criminal_charge   = Assassination (murder)\n| conviction_penalty = Life imprisonment\n| conviction_status = Imprisoned\n| relatives         =\n| callsign          =\n| awards            =\n| website           =\n| allegiance        =\n| motive            =\n| conviction        = Assassination (2007)\n| capture_status    = Arrested\n| partners          = Balwant Singh Rajoana  Dilawar Singh Babbar\n| wanted_since      =\n| time_at_large     =\n| escaped           = 2004\n| escape_end        = 2005\n| comments          = Recaptured in Delhi\n| victims           = Beant Singh and 16 others\n| date              =\n| time              =\n| beginyear         =\n| endyear           =\n| country           =\n| states            =\n| locations         =\n| targets           =\n| fatalities        =\n| injuries          =\n| weapons           =\n| apprehended       =\n| imprisoned        = Tihar Jail, New Delhi, India\n| title             = Jathedar\n}}\nJagtar Singh Hawara is a high level member of Babbar Khalsa who is currently serving life imprisonment at Tihar Jail. He was convicted as a conspirator in the assassination of 12th Chief Minister of Punjab, Beant Singh.\nHawara was declared as the Jathedar of the Akal Takht by a Sarbat Khalsa organised at village of Chabba on the outskirts of Amritsar, however this declaration is disputed and unrecognised by the Shiromani Gurdwara Parbandhak Committee (SGPC).\nEarly life\nJagtar Singh Hawara was born in Hawara, a small village in Fatehgarh Sahib, Punjab. His mother's name is Narinder Kaur. He is believed to have become an active militant sometime during 1990-1991 and operated primarily in the Ropar area.\nCriminal record\nMurder accusations\nIn 1988 Hawara was accused murdering the granthi of a Gurdwara in Chamkaur Sahib. He would be acquitted on the charge.\nHe also was accused of killing special police officer Sunil Kumar at Shaheedi Jor Mela at Chamkaur Sahib on 21 December 1992. However he was acquitted of the charge in February 2017.\nAssassination of 12th Chief Minister of Punjab\nHawara was charged in the assassination of 12th Chief Minister of Punjab, Beant Singh. On 31 August 1995, Dilawar Singh Babbar, a human bomb assassinated Beant Singh by blowing up his bullet-proof car at the Punjab and Haryana Civil Secretariat, Chandigarh. Seventeen people were killed and fifteen others injured.\nIn 2007, he was convicted was given death penalty after a trial in Chandigarh court. Hawara appealed to the Punjab and Haryana High Court, which in October 2010 converted his death penalty to life imprisonment. Hawara further appealed the case in the Supreme Court of India, where it is currently pending.\n2004 Burail jailbreak\nIn 2004, Hawara came back into the limelight when he escaped from maximum security jail at Burail, along with two other Sikh prisoners by digging a 90 feet tunnel with his bare hands. He was recaptured in 2005 from Delhi. He is imprisoned at Tihar Jail, New Delhi.\nDeclared Jathedar by 2015 Sarbat Khalsa\nOn 10 November 2015, Jagtar Singh Hawara was declared to be replacing Gurbachan Singh as the interim Jathedar of Akal Takht by a Sarbat Khalsa organised at Chabba village on the outskirts of Amritsar, Punjab by Sikh organisations. It also declared Dhian Singh Mand as an interim Jathedar of Akal Takht. It demanded all the current Jathedars including Gurbachan Singh be removed. The SGPC president at that time, Avtar Singh Makkar, however condemned the convening as against the principles of Sikhism and its decisions were null and void. He added that the removal of Jathedar came under Sikh Gurdwaras Act, 1925 and no one could challenge the SGPC's authority.\nPersonal life\nIn 2005, Hawara married Balwinder Kaur, daughter of Dara Singh at a Gurdwara in village Dohla. On 3 March 2006, Balwinder Kaur's petition for annulment of marriage was an adjourned. Kaur claimed to had stayed with Sahib Singh (alias of Hawara) for just 11 days, after which she was dropped off at her parents’ house where Hawara stayed for a day.\nReferences"
    }
  ]
}