{
  "content": [
    {
      "type": "text",
      "text": "# Jajah Koswara\n\nin |native_name= instead.-->\n| honorific_suffix   =\n| image              = Jajah Koswara.jpg\n| image_size         =\n| image_upright      =\n| smallimage         =\n| smallimage_alt     =\n| alt                =\n| caption            =\n| order              =\n| office             = Director of Research and Community Service Development\n| status             =\n| term_start         = 14 March 1989\n| term_end           = 2002\n| predecessor        = Oetit Koswara\n| successor          = Dodi Nandika\n| prior_term         =\n| pronunciation   =\n| birth_name      =\n| birth_date      =\n| birth_place     = Sumedang, West Java, Dutch East Indies\n| death_date      =\n| death_place     = Bogor, West Java, Indonesia\n| death_cause     =\n| resting_place   =\n| resting_place_coordinates =\n| citizenship     =\n| nationality     =\n| party           =\n| otherparty      =\n| height          =\n| spouse          =\n| partner         =\n| relations       =\n| children        =\n| parents         =\n| mother          =\n| father          =\n| relatives       =\n| residence       =\n| education       = IPB University (Ir., Prof.) University of Wisconsin–Madison (M.Sc., Ph.D)\n| module =\n}}\nJajah Koswara (sometimes written as Yayah Koswara, 9 December 194117 March 2011) was an Indonesian academic and education administrator who was known for developing hybrid corn in Indonesia. She served as the Director of Research and Community Service Development at the Directorate General of Higher Education from 1989 until 2002, during which she developed the competitive grant scheme and the voucher system.\nEarly life and education\nJajah was born in Sumedang on 9 December 1941. Both of her parents worked as teachers, while her grandparents worked as a farmer. Jajah described her father as a strict and disciplined person, while her mother taught her basic home skills and opened an embroidery training school to provide additional income for the family.\nAs a teacher, her parents had to move from town to town. After completing 2nd grade, Jajah followed her parents to Bandung and attended an elementary school for a few years there. She completed her elementary school education in the city and continued her studies at a junior high school there. Before completing her junior high school, her parents moved again to Cirebon. She finished her basic education in Cirebon in 1959.\nAfter completing high school, Jajah was accepted to study medicine in the University of Indonesia (UI) as well as the Bandung Teacher's Institute. Despite this, she opted to study agriculture at UI due to her family background as a farmer. Jajah was elected as the chief of the student's dormitory from 1962 to 1963. She completed her studies in 1964, after the agricultural faculty in UI was established into the separate Bogor Agricultural Institute (IPB). She was the fastest student of her cohort to graduate.\nAs part of a cooperation program between IPB and the University of Wisconsin–Madison in 1970, a number of IPB lecturers were sent to the university to develop IPB's postgraduate studies. Jajah and several other IPB lecturers (including future agriculture minister Soleh Solahudin) was sent to study in university. She received her master's degree from the university in 1973 and her doctoral degree in 1975. Her doctoral advisor in the university was John W. Pendleton and her thesis was titled The Effect of Nitrogen and Plant Population on Corn Production: And a Study of Grain Maturation Period of Five Corn Varieties in Indonesia.\nAcademic career\nUpon receiving her bachelor's degree, Jajah went to the United States in 1965 and became an assistant researcher for agronomy at the Iowa State University for two years. She then returned to Indonesia and began teaching agronomy at her almamater in 1967.\nDuring her doctoral studies, Jajah began her research to develop a hybrid corn variety. She also introduced the sweet corn variety in Indonesia in the late 1970s and began developing the baby corn to suit Indonesia's agriculture climate. According to corn researcher M. Syukur, she would bring chops of boiled sweet corn to her class for all of her students to taste.\nHer hybrid corn variety, which was named as IPB-4, was successfully cultivated in 1985. The IPB-4 corn variety was then cultivated in various region, including the Pandeglang Regency in West Java.  Her contribution for agriculture in Pandeglang led her to receive a prize of 3 million rupiahs ($) from the Golkar party in West Java. Two years later, in September 1987 she received an award from the Department of Education and Culture for her IPB-4 corn variety. In 1993, she received the Indonesian Engineers Association Award from the Chairman of the Board of Trustees of the Indonesian Engineers Association, B. J. Habibie (later President of Indonesia) for her invention. The University of Wisconsin–Madison later gave her a honorary doctorate for her invention in 1991.\nDuring her tenure in IPB, Jajah served as second deputy dean of IPB's postgraduate faculty from 1983 until 1989. She, along with IPB rector Andi Hakim Nasution and fellow hybrid corn researcher Freddy Rumawas, was responsible for the development of the credit earning activities between the postgraduate agriculture students of IPB and the Andalas University.\nDirector of Research and Community Service Development (1989–2002)\nOn 14 March 1989, Jajah was installed as the Director of Research and Community Service Development, replacing her husband Oetit Koswara, who retired that year. She would serve as director for thirteen years until 2002, under three different director generals and six different ministers. Jajah was responsible for introducing and developing various research and community service programs, such as the competitive research grant scheme, voucher system, and University of Research for Graduate Education. In 2001, she introduced the government-funded Student Creativity Program, which consists of students’ creativity on research, technology application, entrepreneurship, community service, and scientific writing.\nCompetitive research grant scheme (1989–2002)\nOne of Jajah's main work as director was the development of the competitive research grant scheme, which was introduced in 1988 by her husband. The grant scheme was based on her difficulties in finding a sponsor for her hybrid corn research. Prior to the introduction of the scheme, research in bigger state universities were funded by student tuition and was spread evenly among the academic staff. The Directorate General of Higher Education, which was responsible for the management of state universities, only provided meager and infrequent research funds.\nThe initial funding of the scheme came from the International Bank for Reconstruction and Development (IBRD) Loan for Higher Education Development Project and was designed on an annual basis for three years. The scheme included a strict evaluation and supervision system, as well as an incentive for the research to present their research results on a national seminar. The program was then extended for another three years and another $15 million was added to the funding. The success of the initial scheme led the scheme to be established as the Competitive Grant Multiyear Research Program, with research proposals for the program being reviewed by a University Research Council and the final results of the research being presented in front of the officials of the Ministry of Education and Culture and other top-ranking bureaucrats. The competitive grant program has the largest per annum funds in comparison to other government-sponsored research grants.\nVoucher system (1994–2002)\nThe voucher system was initiated in 1994 by Jajah upon the request of Minister of Education and Culture Wardiman Djojonegoro. Wardiman, who was concerned about the poor quality of Indonesian SMEs and their inability to compete in the global market, aimed to create a system that links SMEs with universities. The voucher system allowed SMEs to request voucher to the Directorate General of Higher Education that can be used to research their products by using the university facilities. The university could then exchange the voucher for a reimbursement of the research funds.\nJajah described the system as a \"rather fundamental change in the history of direct appropriate technology application to small-and medium-enterprises\". Despite the budget ceiling of each voucher was set to 10-15 million rupiahs, the actual reimbursement was much lower, which resulted in complaints from universities. Wardiman stated that the minimum reimbursement was intended \"as an inducement so that other agencies could help the SMEs\".\nUniversity of Research for Graduate Education (1995–2001)\nJajah was the project leader of the University of Research for Graduate Education (URGE) program, which was also funded by IBRD and the Indonesian government. The program aimed to increase the quality of graduate programs in public universities by linking it with the development of research capacity. The program was the first in the Indonesian higher education system to provide funds in the form of block grants.\nThe program consisted of several types of grants: Center Grant, Team Grant Programme for Graduate Research, Young Academic Programme, In-Country Pre-Graduate Training Programme, Sandwich Programme, Scientific Journal Programme, International Research Seminar Programme, International Research Linkage Programme, and the Domestic Collaborative Research Grant Programme. The URGE program was implemented from 1995 to 1999, although it was extended for two years until 2001.\nLater life and death\nAfter serving as director, Jajah returned to taught at the Bogor Agricultural Institute. In 2004, a group of woman activists nominated her as a candidate for Susilo Bambang Yudhoyono's cabinet. She officially retired in 2007. A retirement ceremony, continued by a national seminar, was held in her honor. At the ceremony, she officially published her autobiography, titled ''Never Ending Life Lessons: There's Still a Long Way to Go''.\nJajah died on the dawn of 17 March 2011 at the Karya Bakti Hospital in Bogor. Her body was interred at the Giri Tama cemetery in Parung, Bogor.\nPersonal life\nJajah was married to Oetit Koswara, an IPB professor in soil sciences, in 1964. The couple has two children.\nReferences"
    }
  ]
}