{
  "content": [
    {
      "type": "text",
      "text": "# Jake Wardle\n\n| birth_date    =\n| birth_place   = Halifax, West Yorkshire, England\n| height        =\n| weight        =\n| club1         = Huddersfield Giants\n| year1start    = 2018\n| year1end      = 22\n| appearances1  = 64\n| tries1        = 22\n| goals1        = 10\n| fieldgoals1   = 0\n| points1       = 108\n| club2         =\n| year2start    = 2022\n| year2end      =\n| appearances2  = 11\n| tries2        = 6\n| goals2        = 0\n| fieldgoals2   = 0\n| points2       = 24\n| club3         = Wigan Warriors\n| year3start    = 2023\n| year3end      = present\n| appearances3  = 89\n| tries3        = 44\n| goals3        = 0\n| fieldgoals3   = 0\n| points3       = 176\n| teamA         = England\n| yearAstart    = 2022\n| yearAend      = present\n| appearancesA  = 3\n| triesA        = 1\n| goalsA        = 0\n| fieldgoalsA   = 0\n| pointsA       = 4\n| teamB         = England Knights\n| yearBstart    = 2022\n| yearBend      =\n| appearancesB  = 1\n| triesB        = 0\n| goalsB        = 0\n| fieldgoalsB   = 0\n| pointsB       = 0\n| new           = yes\n| source        =\n| updated       = 2 November 2025\n| module        =\n}}\nJake Wardle (born 18 November 1998) is an English professional rugby league footballer who plays as a , or er, for the Wigan Warriors in the Super League, and England and the England Knights at international level.\nHe previously played for the Huddersfield Giants in the Super League and has spent time on loan from Huddersfield at the Warrington Wolves in the top flight.\nBackground\nWardle was born in Halifax, West Yorkshire, England\nHe is the younger brother of fellow former Giants player Joe Wardle.\nPlaying career\nIllingworth ARLFC\nJake began his Rugby League career at amateur club Illingworth ARLFC, before signing professional forms. During this time he played in the England Youth internationals against France.\nHuddersfield Giants\nWardle is a product of Huddersfield's academy system, and made his first team début in May 2018, scoring two tries against Widnes Vikings.\nIn 2020, Wardle signed a new contract to stay at Huddersfield until the end of the 2023 season.\nWarrington Wolves (loan)\nOn 25 June 2022 it was announced that he would join the Warrington Wolves for the remainder of the 2022 season.\nWigan Warriors\nIn October 2022 it was announced that Wardle had joined Wigan Warriors on a three-year deal.\nIn round 25 of the 2023 Super League season, Wardle scored a hat-trick in Wigan's 50-0 victory over Leeds.\nOn 14 October 2023, Wardle played in Wigan's 2023 Super League Grand Final victory over the Catalans Dragons. Wardle was also awarded the Harry Sunderland Trophy as man of the match.\nOn 24 February 2024, Wardle played in Wigan's 2024 World Club Challenge final victory over Penrith scoring a controversial try in the second half. The try was sent to the video referee who stated that there was insufficient evidence to show whether the ball had crossed the line however on some replays it showed the ball was short of the line.\nOn 27 March 2024, Wardle signed a five-year contract extension with Wigan to remain at the club until the end of 2029.\nOn 8 June, Wardle played in Wigan's 2024 Challenge Cup final victory over Warrington. Wardle retained his place in the Super League Dream Team for the 2024 Super League season.\nOn 12 October 2024, he played in Wigan's 9-2 2024 Super League grand final victory over Hull Kingston Rovers.\nOn 30 March 2025, Wardle scored a hat-trick in Wigan's 54-0 win over strugglers Salford.\nOn 9 October 2025, Wardle played in Wigan's 24-6 2025 Super League Grand Final loss against Hull Kingston Rovers.\nHonours\nWigan Warriors\n*Super League\n**Winners (2): 2023, 2024\n*'''League Leaders' Shield\n**Winners (2): 2023, 2024\n*Challenge Cup\n**Winners (1): 2024\n*World Club Challenge\n**Winners (1): 2024\nIndividual\n*Super League Dream Team\n**Winners (2): 2023, 2024\n*Harry Sunderland Trophy:\n**Winners (1): 2023\n*Wigan Warriors Player of the Year\n**Winners (1): 2024\n*Wigan Warriors Players' Player of the Year\n**Winners (1):''' 2024\nReferences\nExternal links\n*[https://giantsrl.com/locker-room/profile/819/jake-wardle Huddersfield Giants profile]\n*[https://www.superleague.co.uk/player/823/jake-wardle SL profile]"
    }
  ]
}