{
  "content": [
    {
      "type": "text",
      "text": "# Jake Edwards (radio personality)\n\nJake Edwards (born in Moncton, New Brunswick), also known as Bro Jake or Brother Jake, is a Canadian radio personality based in British Columbia.  Edwards has been best known for his fictional comedy character \"The Champ\".  For his skill, Edwards won the 2001 Canadian Music Network Radio Personality of the Year Award.  For the same year, Edwards' show on Rock 101 was among the highest-rated in the BBM Canada ratings. Vancouver's Classic Rock 101 (CFMI) had been the home of Bro Jake for over 17 years. In 2013, Corus Entertainment (Rock 101) declined to renew the contract of its veteran radio personality. All-sports, CKST-AM (TSN Radio 1040), jumped at the chance to pair Bro Jake with veteran sport broadcaster, David Pratt, for a more entertainment oriented morning show. The duo debuted the new morning show to the Vancouver market in September 2013. August 31, 2019 marked his last day on terrestrial radio and TSN 1040. Edwards was inducted into the Canadian Broadcast Industry Hall of Fame in 2019.\nCFRQ (Q-104)\nThe veteran broadcaster was part of the original line-up of the album rock (AOR) format radio station Q-104 in Halifax, Nova Scotia. CFRQ, branded with its original slogan \"The Rock of the Atlantic\", signed on the air in November 1983 with Bro Jake as the premier host of the \"Morning Zoo\", which he hosted from 1983 to 1985. To commemorate Q-104's 20th anniversary, the radio station dedicated a segment of the 2003 anniversary to the broadcaster. It featured memorable stories and milestones from Bro Jakes' early days at Q-104; also, early recorded clips from regional Atlantic Canadian radio stations such as CKCW radio AM 1220 Moncton, Bro Jake's native city where he left his signature and accolades as an up-and-coming radio personality and entertainer from 1976 to 1979.\nBroadcasting career\n:CJCB-AM Sydney NS 1970s\n:CKEC-AM New Glasgow NS 1970s\n:CKBC-AM Bathurst NB 1970s\n:CKCW-AM Moncton NB (1976-1979)\n:CITI-FM Winnipeg MB\n:CFRQ-FM Halifax NS (1983-1985, station's original line-up)\n:CILQ-FM Toronto ON (1985-86)\n:CKIS-FM Winnipeg MB\n:CILQ-FM Toronto ON\n:CFMI-FM (Rock 101) Vancouver BC (1996-2013) his last day being July 19, 2013.\n:CKST-AM (TSN Radio 1040) Vancouver BC\nThe Champ\nThe Champ is a fictional comedy character (created by the famed comedy duo MacLean and MacLean. and licensed to Edwards) who has a penchant for overreacting to events in his life.  The basic premise of The Champ is that he was a boxer, and got into too many fights, and took a few-too-many blows to the head, and as such, he no longer has the normal patience of the average man.  The character's publicized life often involves him overhearing a conversation where he misinterprets some antagonist's statement as a slight against him or his wife, Mrs. Champ.  Reverting to his old boxing ways, he overreacts and \"loses it,\" unleashing a flurry of violence upon the unfortunate antagonist.  Through his overreaction, The Champ remains the champ in his life.\nSyndication\nThe Champ is syndicated on many stations, such as:\n:Q107 Toronto, Ontario\n:Rock 101 Vancouver, BC\n:Z99 Red Deer, Alberta\n:CFNO Marathon, Ontario\n:CKIQ Iqaluit, Nunavut\n:CJSS Cornwall, Ontario\nThe Champ has, in the past, also been featured on many other stations, including:\n:54 Rock Ottawa, Ontario\n:92 Citi FM Winnipeg, Manitoba\n:CFPL-FM London, Ontario\n:CHOM-FM Montreal, Quebec\n:CIFM 98.3 Kamloops, BC\n:CJCB Sydney, Nova Scotia\n:CJMO (Rock 103) Moncton, New Brunswick (Syndicated in 1988-1989)\n:CJNE Nipawin, Saskatchewan\n:CJSD Thunder Bay, Ontario\n:CKCK Regina, Saskatchewan\n:CKNL Fort St John, BC\n:K97 Edmonton, Alberta\n:CFBR 100.3 The Bear Edmonton, Alberta\n:CJAY Calgary, Alberta\n:Q104 Halifax, Nova Scotia\n:Q92 Sudbury, Ontario\n:Rock 102 Saskatoon, Saskatchewan\n:Wolf Radio 101.5 FM Peterborough, Ontario\n:Rock 95 95.7 FM\nBarrie, Ontario\nReferences\nExternal links\n* [http://www.bcradiohistory.com/Biographies/BrotherJake.htm BC Radio Brother Jake Biography Page]\n* [https://www.youtube.com/channel/UCwuXg6K4YHe4S9T7_3Cw7Ag Its MeTheChamp Youtube Channel]"
    }
  ]
}