{
  "content": [
    {
      "type": "text",
      "text": "# Jake Stewart (politician)\n\n| birth_place         = Newcastle, New Brunswick, Canada\n| death_date          =\n| death_place         =\n| party               = Conservative\n| otherparty          = Progressive Conservative\n| riding              = Miramichi—Grand Lake\n| parliament          = Canadian\n| termstart           = September 20, 2021\n| termend             = March 23, 2025\n| assembly2           = New Brunswick Legislative\n| successor2          = Michael Dawson (2022)\n| predecessor2        = Rick Brewer\n| termend2            = August 17, 2021\n| termstart2          = September 27, 2010\n| constituency_AM2    = Southwest Miramichi-Bay du Vin\n| office4             = Blackville City Councillor\n| term_start4         = October 2008\n| term_end4           = October 2010\n| successor           = Michael Dawson\n}}\nJake Daniel Stewart (born March 10, 1978) is a Canadian politician who was elected to the Legislative Assembly of New Brunswick in the 2010 provincial election. He represented the electoral district of Southwest Miramichi as a member of the Progressive Conservatives. He resigned on August 17, 2021 and was elected the Conservative Member of Parliament for the riding of Miramichi—Grand Lake on September 20, 2021 and served for one term, not running for re-election in 2025.\nPolitical career\nProvincial politics\nStewart entered municipal politics in 2008, having run for the office of councillor in his hometown of Blackville. In 2010, he entered provincial politics, and defeated incumbent Liberal MLA Rick Brewer, who at that time was the Minister of Human Resources.\nStewart was a member of the Standing Committees on Education, Private Bills, Procedure, Public Accounts, and Chaired the Standing Committee on Legislative Officers. He has also been appointed by Jody Carr, then current Minister of Education to sit on the Ministerial Advisory Committee on Positive Learning and Working Environment (Anti Bullying).\nRe-elected in 2014, Stewart was the opposition critic for Energy and Mines, and Aboriginal Affairs. He was also a member of the Standing Committee on Economic Policy.\nIn 2016, he entered the Progressive Conservative leadership race. In 2018, he was appointed as minister of Aboriginal Affairs but was dropped after the 2020 election.\nFederal politics\nStewart resigned on August 17, 2021, and was elected the Conservative Member of Parliament for the riding of Miramichi—Grand Lake on September 20, 2021.\nOn February 25, 2025, the Telegraph-Journal reported that the financial agent for the Stewart's riding association had quit his post in January over allegations that he was mistreated by Stewart and his staff. The allegations were based on the fact that financial agent observed that Stewart made unauthorized expenses exceeding $500 limit established for transparency and never disclosed them to the board. Jacques Poitras of CBC News reported that Brennan also named eight other staffers that had left their jobs during Stewart's tenure. On March 3, 2025, Mike Morrison, a former Conservative candidate for Miramichi, confirmed some of the people to Poitras and stated that Stewart's temper played a role in their departures. Morrison added that he felt that many of Stewart's own staff and volunteers had alienated and took issues to Stewart mocking Morrison having a stroke last December. The Toronto Star revealed that Stewart terminated an employee from a two month medical leave without any communication or consideration for their recovery.\nOn March 6, 2025, Stewart announced that he is not running for re-election during the 2025 federal election.\nElectoral record\nFederal\nProvincial\n|}}\n}}\n}}\nMunicipal\n{| class=\"wikitable\"\n|-\n!Candidate\n!Votes\n!Incumbent\n|-\n|Jonathan A. Brennan (X) || 323 ||\n|-\n|Kirby G. Curtis M || 228 || inc./sort.\n|-\n|Ryan L. McLaughlin || 193 ||\n|-\n|Harold W. Moody || 85 ||\n|-\n|Cindy Marie Ross (X) || 316 || inc./sort.\n|-\n|Jake Stewart (X) || 252  ||\n|-\n|Cindy A. Sturgeon (X) || 373 || inc./sort.\n|-\n|Sharon M. Vickers || 251 || inc./sort.\n|}\nReferences\nExternal links\n*"
    }
  ]
}