{
  "content": [
    {
      "type": "text",
      "text": "# James King (musician)\n\n}}\nJames King is an American multi-instrumentalist who is a co-founder for soul band Fitz and the Tantrums. In 2008, he was approached by college friend Michael Fitzpatrick to play saxophone on a few songs that he had written which turned out to be the beginnings of Fitz and the Tantrums.  King recommended Noelle Scaggs and other musicians.  They performed for the first time a week later at Hollywood's Hotel Café.  They released their debut EP Songs for a Breakup, Vol. 1 in August 2009, and the tracks soon received airplay on public radio station KCRW in Los Angeles.\nSix months after their first performance they had slots at Lollapalooza and Telluride Blues & Brews. In late 2009 they toured with Hepcat, Flogging Molly, and opened eight concerts for Maroon 5. The band signed to Dangerbird Records in April 2010,\nTheir first full-length album, ''Pickin' Up the Pieces was released on August 24, 2010. It received critical acclaim and reached No. 1 on the Billboard Heatseekers chart, 140 on the Billboard 200, and 18 on the Independent Albums chart.\nThey were called by Vogue Magazine the \"Hardest Working Band of 2011\". According to Rolling Stone, the band \"throws a sparkling pop gloss on a familiar Motown sound\"\nBackground\nKing was raised by a jazz guitarist father and a classical cellist mother. They introduced him to a wide range of music from an early age. In addition to the jazz training and classical training that he started at age five, he also started learning guitar, violin and piano before settling on the flute when he was nine years old; he added the saxophone when he was 11. King studied music privately and attended Los Angeles County High School for the Arts for his last two years of high school, after which he attended the California Institute of the Arts (1993–1999), where he went to earn his Bachelor of Fine Arts degree in jazz performance. Before, King worked on a wide range of projects in the music industry and taught at the Silverlake Conservatory of Music.\nDiscography\nFitz and the Tantrums\n;Studio albums\n*2009: Songs for a Breakup, Vol. 1\n*2010: Santa Stole My Lady\n*2010: Pickin' Up the Pieces\n*2013: More Than Just a Dream\n*2016: Fitz and the Tantrums\nOther work\n*2000–2010: Domingosiete  (\"saxofonista\")\n*2001–2010: Breakestra\n*2002–2010: Connie Price and the Keystones\n*2004–2005: Orgone\n*2008–2009: Composer, Nic and Tristan Go Mega-Dega\n*2008–2010: The Lions\n*2010: Performed in Burlesque starring Cher and Christina Aguilera\n}}\nExternal links\n*[http://fitzandthetantrums.com/ Fitz and the Tantrums' official website]\n*[https://music.apple.com/us/artist/fitz-and-the-tantrums/321144807 Fitz and the Tantrums] on iTunes\n*[http://www.axs.com/exclusive-fitz-and-the-tantrums-discuss-music-festivals-the-walker-whi-11515/ Music festivals interview, June 2014]"
    }
  ]
}