{
  "content": [
    {
      "type": "text",
      "text": "# James Edward Walsh\n\n| death_place       = Maryknoll, Ossining, New York\n| buried            = Maryknoll, Ossining, New York\n| nationality       = American\n| religion          =\n| parents           =\n| occupation        =\n| profession        =\n| previous_post     =\n| coat_of_arms      = Coat of arms of James Edward Walsh.svg\n| motto             = Primum regnum Dei\n}}\nJames Edward Walsh, MM (April 30, 1891 – July 29, 1981) was an American Catholic prelate who served as Bishop of Kongmoon from 1927 to 1936. He was a member of the Maryknoll order and a missionary in China.\nEarly life\nFather Walsh was born in Cumberland, Maryland on April 30, 1891, to Mary Concannon and William E. Walsh. He was the second child of nine. After graduating at age 19 from Mount St. Mary's College, he worked as a timekeeper in a steel mill for two years until he became aware of Maryknoll, a new American order. In 1915, he became the second priest ordained in this order.\nChina\nHe and three other men were sent on the order's first foreign mission to China in the year 1918. The other three were Father Thomas Frederick Price, one of the founders of Maryknoll and Superior of the group; Father Francis Xavier Ford; and Father Bernard F. Meyer.\nFr. Walsh and Fr. Meyer arrived first, Fr. Price and Fr. Ford some weeks later. Their first point of debarkation in South China was the British colony of Hong Kong on 30 October 1918. While they were in Hong Kong, they stayed briefly with the Paris Foreign Mission Fathers at Battery Path. From Hong Kong, they went to Yeungkong (now known as Yangjiang) and started their missionary work in China there.\nWalsh's early years in China were chaotic, and included being captured by bandits and caught in bloody local conflicts. At the age of thirty-six, on 22 May 1927 he was consecrated Maryknoll's first bishop and served the Diocese of Kongmoon (now known as Jiangmen) in China. The ceremony was held on Sancian Island (now called Shangchuan Island), a lonely spot off the coast of South China where St. Francis Xavier, the Apostle to the Indies, died in 1552.\nIn 1936, Bishop Walsh left China to return to the United States as head of Maryknoll. During his ten-year term he oversaw Maryknoll's first missions to Latin America and Africa. In November to December 1940, he and Father James M. Drought, his assistant went to Japan to take part in the diplomatic negotiation between US and Japan. However, following the Holy See's special request for his service in China, he returned to take charge of the Catholic Central Bureau in Shanghai in 1948 to coordinate mission activities in China.\nWhen the Chinese Communist Party (CCP) seized power in 1949 they began harassing Catholic clergymen. The Catholic Central Bureau was shut down by the government in 1951. When Walsh's superiors in Maryknoll inquired about his safety he responded by saying, \"To put up with a little inconvenience at my age is nothing. Besides, I am sick and tired of being pushed around on account of my religion.\"\nAlthough he anticipated arrest, Walsh chose to stay and tend to his congregation. He was eventually apprehended by CCP authorities in 1958 and sentenced to twenty years in prison. He spent twelve years of his prison sentence in isolation and was suddenly released in 1970. He was deported via a footbridge to freedom in Hong Kong on 10 July 1970. He is believed to be the last of 7,000 foreign missionaries to be expelled from China after the Communist Revolution in 1949.\nWalsh stated he held \"no bitterness toward those who tried and condemned me\", and spoke approvingly of favorable relations between United States and China. His release was an important gesture leading to the thawing of relations with President Nixon's visit to China in 1972.\nDeath\nBishop James E. Walsh returned to the United States and died at the age of ninety on July 29, 1981, in Maryknoll, New York, from a heart ailment.\nin Hong Kong, founded 1963, was named to commemorate his missionary achievements.\nBibliography\nWritten works\n*\n*\n*\n*\n*\n*\n*\nBiographical accounts\n*\n*\n*\n*\nReferences"
    }
  ]
}