{
  "content": [
    {
      "type": "text",
      "text": "# James Allan Stewart Evans\n\n}}\n|birth_place = Cambridge, Ontario, Canada\n|death_date = November 15, 2023 (aged 92)\n|death_place = Victoria, British Columbia, Canada\n|other_names = J.A.S. Evans\n|known_for =\n| education =\n| alma_mater = Victoria College, Toronto, B.A., 1952; Yale University, M.A., 1953, Ph.D., 1957; also attended American School of Classical Studies, Athens, Greece, 1954-55.\n|occupation = historian and academic emeritus\n| notable_works =\n*Economic History of an Egyptian Temple in Greco-Roman Egypt, Yale University Press (New Haven, CT), 1961.\n*Procopius, Twayne (Boston, MA), 1972.\n*Polis and Imperium: Studies in Honour of Edward Togo Salmon, Hakkert (Toronto, Ontario, Canada), 1974.\n*Herodotus, Twayne (Boston, MA), 1982.\n*Herodotus, Explorer of the Past: Three Essays, Princeton University Press (Princeton, NJ), 1991.\n*The Age of Justinian: The Circumstances of Imperial Power, Routledge (New York, NY), 1996.\n*The Empress Theodora: Partner of Justinian, University of Texas Press (Austin, TX), 2002.\n*The Emperor Justinian and the Byzantine Empire, Greenwood Press (Westport, CT), 2005.\n*Daily Life in the Hellenistic Age: From Alexander to Cleopatra, Greenwood Press (Westport, CT), 2008.\n| spouse = Eleanor Lynn Ward, June 16, 1964;\n| children = 3\n| mother = Isabella Jane Evans\n| father = David Arthur, a farmer\n}}\nJames Allan Stewart Evans (March 24, 1931 – November 15, 2023) was a Canadian historian and professor emeritus of classical Near Eastern and religious studies.\nBiography\n*From 1955 to 1960 he was assistant professor of Classics at the University of Western Ontario and Waterloo College, London.\n*From 1960 to 1961 he was Visiting special lecturer in Classics at the University of Toronto.\n*From 1961 to 1962 he was assistant professor of classics at the University of Texas at Austin.\n*From 1962 to 1971 he was professor of history at the McMaster University, Hamilton, Ontario, Canada.\n*From 1972 to 1995 he was professor of classics at the University of British Columbia in Vancouver and became professor emeritus.\n*From 1992 Elected Fellow of the Royal Society of Canada.\n*From 1998 he was visiting faculty, Simon Fraser University, British Columbia\n*From 1997 he was visiting professor of history, University of Washington, Seattle\n*From 1998 to 1999 he was Whitehead Visiting Professor, American School of Classical Studies, Athens\n*Evans died in November 15, 2023, at the age of 92.\n*Blog of published work at [https://jaevansblog.blogspot.com/ Allan Evans at Sidney British Columbia]\nReferences"
    }
  ]
}