{
  "content": [
    {
      "type": "text",
      "text": "# James Edward Tait\n\n|serviceyears = 1916 - 1918\n|rank        = Lieutenant\n|branch      = Canadian Expeditionary Force\n|commands    =\n|unit        = Imperial Yeomanry78th Battalion, CEF\n|battles     = World War I\n* Western Front\n** Hundred Days Offensive\n*** Battle of Amiens\n|awards      =  Victoria CrossMilitary Cross\n|laterwork   =\n}}\nJames Edward Tait  (27 May 1888 &ndash; 11 August 1918), was a Scottish/Canadian recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.\nBackground\nTait was born on 27 May 1888 in Maxwelltown (Dumfries), Scotland to James Bryden Tait and Mary Johnstone. He married Jessie Spiers Aitken from California. He joined the Canadian Expeditionary Force in February 1916.\nWorld War I\nTait was 30 years old, and a lieutenant in the 78th (Winnipeg Grenadiers) Battalion, Canadian Expeditionary Force, during the First World War.\nHe died in action on 11 August 1918 in Amiens, France. He was awarded the VC for his actions that day.\nVC citation\n}}\nLieutenant James Edward Tait was also awarded the Military Cross at the Battle of Vimy Ridge. The citation for this award is as follows:\n\"For conspicuous gallantry and devotion to duty. Early in an assault he was wounded, and all the other officers killed or wounded, but he led his company with great fearlessness and determination through intense fire to the objective, and, although unable to walk, supervised its consolidation, finally crawling back alone, to leave for others the four bearers.\"\nDue to his previous work with the Hudson Bay Railway survey, a siding by Van Hende Lake, Manitoba was named Jetait in his honour in 1953. Lieutenant Tait also has an island named after him in the Winnipeg River, Manitoba between the Pinawa Marina and the Pinawa Sailing Club.\nTait is buried at Fouquescourt British Cemetery which is located 16 miles south of Albert, France (special memorial, grave 8). His Victoria Cross is displayed at the Glenbow Museum in Calgary, Alberta, Canada.\nReferences\nBibliography\n*Scotland's Forgotten Valour (Graham Ross, 1995)\n*\nExternal links\n* [http://www.bac-lac.gc.ca/eng/discover/military-heritage/first-world-war/personnel-records/Pages/item.aspx?IdNumber=266204 James Eward Tait's digitized service file]\n* [http://www.cmp-cpm.forces.gc.ca/dhh-dhp/gal/vcg-gcv/bio/tait-je-eng.asp James Edward Tait]  (service/personal details, photograph, citation, relevant documents, burial information)\n* [https://web.archive.org/web/20070311014925/http://www.legionmagazine.com/features/victoriacross/05-09.asp?id=print Legion Magazine]"
    }
  ]
}