{
  "content": [
    {
      "type": "text",
      "text": "# James Edward Barker\n\n| origin          = United Kingdom\n| instrument      = Guitar, keyboard\n| genre           = Film score\n| occupation      = Film composer, orchestrator, arranger\n| years_active    = 2005–present\n| associated_acts = Tim Despic\n| label           =\n| website         =\n}}\nJames Edward Barker (born 14 February 1980) is a British composer, music producer and film producer. Many of his music works include an ethereal mixture of live sonic experimentation with grandiose classical motifs and alternative percussion.\nBiography\nBarker was classically trained at Newcastle University in the UK, and is a multi-instrumentalist, performing as a guitarist, percussionist, pianist and vocalist.\nHis first feature, Unhitched, a romantic comedy starring Seth Green, Stuart Townsend, and Amy Smart, was directed by Shooting Fish director Stefan Schwartz. Barker co-composed the score with his old school friend Tim Despic, with whom he frequently composes with. Barker and Despic also worked with veteran director Robert Young on Bye, Bye Harry!. Barker followed these films with a number of solo ventures, mostly dark and moody scores including: Psych:9, starring Sara Foster, Cary Elwes and Michael Biehn; Jim Threapleton's Extraordinary Rendition, starring Andy Serkis and Omar Berdouni, and the British indie horror film Reverb, starring Leo Gregory, Margo Stilley and Eva Birthistle.\nIn 2007, Barker and Despic scored the $7m British ITV television production, The History of Mr Polly, starring Lee Evans; and in 2008, he continued his solo career, working with BAFTA-nominated director Martin Radich on the WARP Film and UKFC production Crack Willow, produced by Tristan Goligher.\nBarker scored the follow-up to the cult horror hit The Human Centipede, titled The Human Centipede 2 (Full Sequence).\nOne of Barker's most remarkable working relationships is with the critically acclaimed director Andrew Haigh.  They first met on the film Crack Willow and after Barker was asked to score his short, Five Miles Out and other projects after that. Haigh hired Barker to write the score for his second feature film, Weekend, however the director ended up making a creative choice to not involve any score in the film. Following that, Haigh made 45 Years, again a film with no score, but finally connected on Lean on Pete which features an atmospheric score by Barker. The synergy between score and sound design was largely impacted by a four-week-long mixing session, allowing experimentation to find the right audio and guidance from sound designer Joakim Sundström, who worked on Oscar-nominated Three Billboards Outside Ebbing, Missouri.\nAwards\n* Best Original Score to Lean on Pete at the Les Arcs Film Festival\n* Public Choice Award to Lean on Pete at the World Soundtrack Awards (nomination)\nFilmography\n* The Best Man (2005)\n* Bye Bye Harry! (2006)\n* The History of Mr Polly (2007)\n* Extraordinary Rendition (2007)\n* Reverb (2008)\n* Crack Willow (2008)\n* The Crew (2008)\n* Helen (2009)\n* Greek Pete (2009)\n* Powers of Three (2009)\n* The Tournament (2009)\n* Lives of the Artists (2009)\n* Psych: 9 (2010)\n* ''Devil's Playground (2010)\n* After the Fire (2010)\n* 4.3.2.1 (2010)\n* Weekender (2011)\n* Weekend (2011)\n* The Human Centipede 2 (Full Sequence) (2011)\n* The Holding (2012)\n* The Bachelor King 3D (2012)\n* Harrigan (2013)\n* Base (2015)\n* Heist (2015)\n* Precious Cargo (2016)\n* Don't Knock Twice (2017)\n* London Heist (2017)\n* Rise of the Foot Soldier 3 (2017)\n* Dead on Arrival (2017)\n* Lean on Pete (2017)\n* Mara (2018)\n* Final Score (2018)\n* The Courier'' (2019)\nReferences\nExternal links\n*[http://www.venerationmusic.com/ Official Website]\n*"
    }
  ]
}