{
  "content": [
    {
      "type": "text",
      "text": "# James Aylward (cricketer)\n\n|        birth_place = Warnford, Droxford, Hampshire\n|         death_date = December\n|        death_place = Marylebone, Middlesex\n|            batting = Left-handed\n|               role = Batsman\n|              club1 = Hampshire\n|              year1 =\n|              club2 = Kent\n|              year2 = 1779–1793\n|              type1 = FC\n|         debutdate1 = 28 June\n|         debutyear1 = 1773\n|          debutfor1 = Hampshire XI\n|      debutagainst1 = England XI\n|          lastdate1 = 21 September\n|          lastyear1 = 1797\n|           lastfor1 = England XI\n|       lastagainst1 = MCC\n|     hidedeliveries = true\n|            columns = 1\n|            column1 = First-class\n|           matches1 = 107\n|              runs1 = 3,869\n|           bat avg1 = 19.24\n|          100s/50s1 = 1/14\n|         top score1 = 167\n| catches/stumpings1 = 61/–\n|             source = https://www.espncricinfo.com/player/james-aylward-532852 CricInfo\n|               date = 1 June\n|               year = 2022\n}}\nJames Aylward (1741 – December 1827) was an English cricketer who played during the 18th-century.\nA prominent left-handed batsman, Aylward played in a total of 107 first-class matches between 1773 and 1797. He was born at Warnford, near Droxford in Hampshire and is first recorded as a cricketer in 1773, playing for the Hambledon Club in Hampshire. Aylward was 32 at the time, and Arthur Haygarth suggests that it is likely he played cricket prior to this. He played a total of 33 matches for Hampshire sides that are now considered first class.\nIn 1777 Aylward set a record score of 167 runs whilst playing for a Hampshire XI against an England side at Sevenoaks Vine. This remained the record first-class score until 1820.\nIn 1779 Sir Horatio Mann, a noted Kent cricket patron, employed Aylward as a water bailiff at Bourne Park House in Bishopsbourne near Canterbury, after which he played mainly for Kent sides as \"Kent’s first batsman of true class\". As well as 32 matches for Kent, he played four times for East Kent, once for both the Gentlemen of Kent and a combined Kent and Hampshire side and three times for Mann's XI as well as 22 times for England sides.\nAylward later became the landlord of The White Horse at Bridge close to Bishopsbourne. He lived in London later in his life and died at Edward Street in Marylebone in December 1827 aged 85 or 86. He was buried on 27 December at St John's Wood Churchyard, close to Lord's Cricket Ground.\nNotes\nReferences\nBibliography\n*Birley D (1999) A Social History of English Cricket. London: Aurum Press.\n*Carlaw D (2020) Kent County Cricketers A to Z. Part One: 1806–1914 (revised edition). ([https://archive.acscricket.com/books/Kent_Cricketers_A_to_Z_Part_One_Revised_Expanded.pdf Available online] at the Association of Cricket Statisticians and Historians. Retrieved 2020-12-21.)\n*Lucas EV ed (1907) The Hambledon Men. London: Henry Frowde. ([https://en.wikisource.org/wiki/The_Hambledon_Men Available online] at Wikisource. Retrieved 2022-03-20.) Includes:\n**Nyren J The Cricketers of My Time, pp. 42–93.\n**Haygarth A Memoirs of the Old Players, pp. 185–219.\n*Moore D (1988) The History of Kent County Cricket Club. London: Christopher Helm."
    }
  ]
}