{
  "content": [
    {
      "type": "text",
      "text": "# James Woodward (philosopher)\n\n| birth_place =\n| school_tradition = Analytic philosophy\n| education      = University of Texas, Austin (PhD, 1977)\n| main_interests = Philosophy of science, Philosophy of biology, Philosophy of psychology, Moral Philosophy, Political Philosophy\n| influences =\n| influenced =\n| institutions  = California Institute of Technology (1983-2010), University of Pittsburgh (2010-2022)\n| notable_ideas = Interventionist account of causation\n| thesis_title      =\n| thesis_url        =\n| thesis_year       =\n| doctoral_advisor  =\n}}\nJames Francis Woodward (born 1946) is an American philosopher who works mainly in philosophy of science with particular emphasis on causation and scientific explanation. In addition, Woodward has published in moral and political philosophy as well as philosophy of psychology. Woodward is Professor Emeritus in History and Philosophy of Science at the University of Pittsburgh, and was previously J.O. and Juliette Koepfli Professor of the Humanities at Caltech.\nEducation and career\nWoodward received his B.A. in Mathematics from Carleton College in 1968 and his Ph.D. in philosophy from the University of Texas at Austin in 1977.\nHe taught at Caltech (1992–2010) and the University of Pittsburgh (2010–2022). He became the J. O. and Juliette Koepfli Professor of the Humanities at Caltech in 2001 and a Distinguished Professor at the University of Pittsburgh in 2010.\nHe served as the President of the Philosophy of Science Association from 2010-2012, during which he gave a Presidential Address on the merits of functional accounts of causation, as opposed to metaphysical or intuitive accounts.\nPhilosophical work\nWoodward's main research is on the topics of causation, causal reasoning, and scientific explanation.\nWoodward is best known for providing a novel account of causation and causal explanation, referred to as the interventionist account. In its most basic form, according to interventionism about causation, for variables A and B, A is causally related B only in case that if a change were made to A then there would also be a change in B. The interventionist account is specifically designed to model the use of causal explanations in science and draws upon the manipulation of variables in scientific practice. Thus, rather than providing a metaphysical account of the nature of causation in general, the interventionist account provides a pragmatic conceptualization of how scientists explain particular phenomena. The interventionist account is especially notable for capturing the use of causal explanations in the life and social sciences, whereas other accounts of causation in the sciences tended to emphasize the physical sciences.\nThis account is detailed in many of his publications and in his book Making Things Happen (2003), which won the 2005 Lakatos Award. Philosopher Jenann Ismael states that this book is \"arguably the most important philosophical book about causation to appear in decades\" and psychologist Alison Gopnik states that Woodward's work has \"revolutionized the philosophical discussion of causation\". A more recent book Causation with a Human Face (2021) explores the empirical psychology of human causal cognition.\nAwards and honors\nIn 2005, Woodward’s book Making Things Happen won the Lakatos Award in Philosophy of Science.\nIn 2016 he was elected to the American Academy of Arts and Sciences. Woodward was also elected a fellow of the American Association for the Advancement of Science in 2018 in the Section on History and Philosophy of Science and was a fellow at the Center for Advanced Study in the Social and Behavioral Sciences for 2016–17.\nBibliography\nBooks\nWoodward, James F. 2003 Making things happen. ISBN 978-0195189537\nWoodward, James F. 2021 Causation with a human face. ISBN 978-0197585412\nArticles\n\"Saving the Phenomena,\" The Philosophical Review, (July 1988), 303-352. Co-authored with James Bogen.\n\"Explanation and Invariance in the Special Sciences.\" The British Journal for the Philosophy of Science (2/000), 197-254.\n\"Causation in Biology: Stability, Specificity, and the Choice of Levels of Explanation”. Biology and Philosophy (2010) 25: 287-318.\n\"The Non-Identity Problem,\" Ethics, (July 1986), 804-831.\n\"Moral Intuition: Its Neural Substrates and Normative Significance\" (co-authored with John Allman) Journal of Physiology- Paris 101 (2007), pp. 179–202.\nReferences"
    }
  ]
}