{
  "content": [
    {
      "type": "text",
      "text": "# James King of William\n\nJames King of William (January 28, 1822 – May 20, 1856) was a crusading San Francisco, California, newspaper editor whose assassination by James P. Casey, a member of the San Francisco Board of Supervisors, in 1856 resulted in the establishment of the second San Francisco Vigilance Committee and changed the politics of the city. King was among the first newspapermen to be honored by the California Journalism Hall of Fame.\nFamily and education\nJames King was born January 28, 1822, in the Georgetown district of Washington, D.C., the seventh and youngest son of William King, a native of Ireland. When he was age sixteen, he began to style himself \"James King of William\", to distinguish himself from other James Kings in the area.[http://freepages.genealogy.rootsweb.ancestry.com/~npmelton/sfbking5.htm The Bay of San Francisco] , Lewis Publishing Company, Volume 2, pages 637-38, transcribed by Jeanne Sturgis Taylor.\nIt was said that \"He was an eager student, acquired a fair knowledge of Latin and English literature, and learned to speak French, Spanish and some German.\" He was married in 1843 to Charlotte M. Libbey of Georgetown, and they had six children. In 1848 he departed for the Pacific Coast \"to improve his prospects and establish a new home for his family,\" whom he left behind until 1851, when they joined him in California.\nCareer\nEast Coast\nKing left home at the age of fifteen and worked first as a clerk in Pittsburgh, Pennsylvania, then in St. Joseph, Missouri, whence illness forced him to return to Georgetown in 1838, where he was a post office clerk. Soon he became a political journalist on ''Kendall's Expositor, a Democratic-leaning newspaper issued in Georgetown, and on the Washington Daily Globe,'' where he was also advertising manager. He was later a bookkeeper for the mercantile or financial firm of Corcoran & Riggs, until 1848.\nCalifornia\nPlacer mining\nInfluenced by the letters of a brother, whose name was variously reported as Thomas, who assertedly wrote from Oregon, or as an elder brother, Henry, who wrote from California, King on May 24, 1848, sailed for Cartagena, Colombia, and made his way to the Pacific Ocean at the isthmus of Panama, where he was disappointed to find there was no ship on the west coast to take him north. He journeyed to Callao, Peru, and then Valparaiso, Chile, where, having heard about the gold strike in California, he purchased a stock of goods and hired nine men to sail with him to California aboard the Undine. After arrival on November 10, most of the men deserted him, but with the others he gathered enough gold near Hangtown (now Placerville), to make a \"considerable financial success\" of the placer mining venture. Soon he began trading gold coins or offering bills of trade for the miner's gold dust.\nBanking\nLeaving the California gold country, King joined the mercantile house of Hensley, Reading & Company in Sacramento for a short time, but in July 1849 he went back to Washington and arranged for a loan from the financial firm of Corcoran & Riggs; he returned on December 5, 1849, and opened his own bank on Montgomery Street. It was in this year that he first began issuing private gold ingots.\nAt first the bank was successful, with King being regarded as one of the wealthiest men on the West Coast, but his agent in Sonoma County \"used large sums of money, intended for purchasing gold, to invest in the stock of the bankruptcy-bound Tuolumne Hydraulic Association.\" The financial loss left King penniless by early 1850, and while paying off his debts he worked for Adams & Company. He next became a partner with bankers Samuel J. Hensley and Robert D. Merrill in April 1850 and was their agent for two months. He went back to Washington briefly, then returned to San Francisco in January 1851 on the steamer Tennessee, along with Augustus Humbert, who had been appointed to be U.S. assayer in San Francisco. In that year King established another company, and it was there that his firm struck $20 gold ingots.\nCoin historian Donald H. Kagin has written that in March 1851, \"the most notorious chapter in private gold coinage occurred\", when King sent $180 in face value of coins minted by a number of entrepreneurs to Humbert, who reported after assaying them that the samples were worth 1.8 percent to 3 percent under market value. King sent these results and related correspondence to every major newspaper, and the resulting public outcry impelled the California Legislature to effectively end the use of private coins in an act dated April 15, 1851. Kagin said that King therefore \"may have started\" the California economic recession of 1850–51, \"whose effects he certainly accentuated.\" However, Kagin is incorrect. The Act was passed into law on April 21, 1851.\nKing and a partner, Jacob B. Snyder, together operated a new bank, but in a spring 1854 economic depression, they suffered financial losses and, in the end, King ended up taking over as managing clerk for the firm of Adams & Company of California headed by Isaiah C. Woods as well as other enterprises.\" He also found time to be a member of the 1851 Committee of Vigilance, which \"helped rid the city of some of its more corrupt citizens,\" and in November 1853 he had been foreman of a grand jury that indicted City Treasurer Hamilton Bowie.\nJournalism\nOn October 8, 1855, the first edition of the Daily Evening Bulletin appeared, with King as the editor and C.O. Gelberding as the publisher. At first it was a simple four-page publication, 10x15 inches in size, but it soon increased in size and influence, \"with a large circulation, plenty of advertisements and a power and popularity excelled by no other journal.\" King \"used his paper to crusade fanatically against immorality and corruption\" and \"his reputation of unimpeachable integrity\" as well as his \"blistering\" and \"frequently scurrilous\" editorials \"to turn on unscrupulous characters.\" He often denounced U.S. Senator and private coiner David C. Broderick, who, it was said, was the virtual dictator of San Francisco.Jeremiah Lynch, A Senator of the Fifties, David C. Broderick of California], pp. 68-69\nMedical historian John Long Wilson wrote that King \"dared to expose scoundrels in both public and private domains; and by relentlessly pursuing a campaign against them, he changed the course of history in the beleaguered city.\"John Long Wilson, [http://elane.stanford.edu/wilson/html/chap11/chap11-sect1.html Stanford University School of Medicine and the Predecessor Schools: An Historical Perspective] , Lane Library, Stanford University. The California historian Rockwell Hunt said that King and James P. Casey, the editor of The Sunday Times and a member of the county Board of Supervisors, carried on a feud in their newspapers, resulting in \"much personal enmity\". On May 4, 1856, King's Bulletin reproduced articles from New York newspapers revealing that Casey had served a term in New York State's Sing Sing prison for grand larceny.\nKing had called for the hanging of Charles Cora, a well-known gambler and husband of the madam Belle Cora. Cora was arrested for the shooting of a U.S. Marshal named Richardson. King wrote that if Charles Cora was set free it would represent the vice that corrupts the town, warning about the possibility of the jury getting bribes, or that gamblers or other people of vice had gotten to the sheriff or Bill Muligan, the keeper of the country prison. King's writing rallied the town so much that the San Francisco courts acted faster than ever to bring Cora's case to court, resulting in his case being tried at court within two months of the shooting. Casey, a friend of Cora, wanted a way to get the public's mind off the Charles Cora case, reportedly determined that shooting King would get the public to stop focusing on the case and he would be justified by wiping out the affront King made to his honor.\nAssassination\nShooting\n, July 19, 1856]]\nAt about 5 p.m. on May 14, 1856, Casey accosted King in the middle of Montgomery Street at Washington Street,Lell Hawley Woolley, [http://www.books-about-california.com/Pages/California_1849_1913/California_1849_1913_text.html California 1849–1913 or The Rambling Sketches and Experiences of Sixty-Four Years' Residence in That State]  asking \"Are you armed?\" and then, without waiting for an answer, aiming a \"large Navy revolver\" at the editor, he demanded that King \"Draw and defend yourself.\" At the same time Casey fired one shot,[http://www.sfmuseum.net/hist6/corahang.html Assassination of James King of Wm by James P. Casey, San Francisco, May 14th, 1856''] , Britton & Rey. the bullet striking King in the left chest near the armpit.\nTreatment\nThe badly wounded King was taken into a Pacific Express office on the corner, where \"tens of physicians manually explored the wound and in a cacaphony [sic] of divided opinion\" decided to have a sponge inserted into the wound to stem bleeding. The procedure was opposed by King's good friend, the physician Richard Beverly Cole, but Hugh Hughes Toland, the state's best-known surgeon, favored the procedure, which was adopted. An eminent physician, John Strother Griffin, came from Los Angeles to add his opinion. After examining King on May 18, Griffin advised against the removal, fearing hemorrhage from a severed subclavian artery. Stanford University medical historian John Long Wilson opined that: \"Assuming that it was not already too late to make a difference, we must conclude that it was Griffin's opinion that sealed the fate of James King of William.\"\nKing died on May 20 at the age of thirty-four, and a coroner's jury returned a verdict of \"no medical malpractice,\" stating that King would have died of the wound regardless of the sponge.Ira M. Rutkow, [http://archsurg.jamanetwork.com/article.aspx?articleid=390408 \"A Surgical Sponge and Medical Malpractice in 1856\"] , Archives of Surgery, October 1999.\nSecond Vigilance Committee\nIt was said that James King of William \"was the man who practically alone started the work of honest residents to the struggle of cleaning out the criminal element in power\" in San Francisco at that time. After he was shot, \"over ten thousand people crowded around the Montgomery Block to hear the latest on his condition. The crowd later retired to the Plaza, and soon a buzz went through the crowd that a Committee of Vigilance was forming.\" The citizenry, amounting to thousands of men, gave Casey a hearing, pronounced him guilty, and he was hanged on May 22, 1856, the day of King's funeral, along with at least one other man (Cora). The second vigilance committee acted on the example of the 1851 Committee of Vigilance in San-Francisco.\nLegacy\nPolitical power in San Francisco was thus transferred to a new political party established by the vigilantes, the People's Party, which ruled until 1867.\nFuneral tribute\nAfter a church funeral service on May 22, a throng of mourners formed on Stockton Street to accompany King's remains to the Lone Mountain Cemetery. They formed a cortege a mile long, marching four abreast and \"presenting a spectacle never before witnessed in San Francisco.\" King was survived in San Francisco by his wife and six children, including a son, Charles J. King.\nHonors\nA tree in Mammoth Grove, Calaveras County, was named after James King of William, and in 1950 King was honored along with 42 other journalists by being memorialized in California's newspaper Hall of Fame in a month-long Centennial of California Journalism at Balboa Park, San Diego.\nSee also\n* List of journalists killed in the United States\n* Censorship in the United States\nReferences\nExternal links\n*"
    }
  ]
}