{
  "content": [
    {
      "type": "text",
      "text": "# James Dugan (historian)\n\nJames Dugan (May 7, 1912 – June 3, 1967) was a historian, editor and magazine article writer. Born in Altoona, Pennsylvania, he is best known for his collaborations with Jacques Cousteau.\nBiography\nJames Dugan was born in Altoona, Pennsylvania, on May 7, 1912. His parents were Mary Katherine (Hoffman) Dugan and John Henry. He was the oldest of three sons. Dugan went to Altoona Area High School and graduated in 1929. After high school, he went to Penn State University (1933-37). Jim Dugan, as he was called by his peers, became the editor of the campus literary magazine, Old Main Bell. Later he became the editor of another campus magazine, the Penn State Froth, in about 1936. After graduating, he resided in New York and then traveled to England with the Office of War Information. He was promoted to rank of corporal in medical corps at Fort Hancock, N.J. Dugan supervised French, German, Spanish and Russian classes for soldiers. Dugan also worked as a war correspondent in the European Theater. He served with the Army Air Corps during WWII. On April 19, 1946, he married Ruth Mae Lonergan, whom he met while she was a WAC in London during the war.\nDugan had a long-lasting connection with Jacques Cousteau. Dugan first met Cousteau in 1944 during the liberation of France. At this time he was a Yank magazine correspondent. Much of his writing in the 1950s and 1960s concerns underwater exploration with Captain Jacques Cousteau. Dugan received the Grand Prix, Cannes International Film Festival award for the documentary The Silent World in 1956. He was also part of the team that produced the Academy Award-winning documentaries The Silent World (1956) and World Without Sun (1964). Dugan wrote the narration for both films. Dugan edited Cousteau's books The Silent World (1953) and World Without Sun (1965) and co-authored The Living Sea (1963) with Cousteau.\nJames Dugan died June 3, 1967, in Panama City, FL following a pressurization accident during a deep dive in an experimental submersible.  Lengthy litigation with General Mills, operator of the submersible, eventually led to a settlement with the family.\nA collection of James Dugan's papers are held in the J. Welles Henderson Archives & Library of Independence Seaport Museum in Philadelphia, PA. They date from 1880 to 1993 and are a collection of papers of James and Ruth Dugan on diving, marine science, and other related topics. The collection also includes items related to Auguste and Louis Boutan.\nWorks\nBooks\n* Ploesti: The Great Ground-Air Battle of 1 August, 1943. New York: Random House, 1962.\n* The Living Sea. London: Hamish Hamilton Ltd, 1963 (with Jacques Cousteau)\n* Man under the Sea and His Shipping Empire. London: Harper, 1963.\n* The Great Iron Ship. New York: Harper, 1953.\n* The Great Mutiny. New York: Putnam, 1965.\n* Man under the Sea. New York: Harper, 1956.\n* Man Explores the Sea. London: Hamish Hamilton, 1956.\n* Undersea Explorer: Story of Captain Cousteau. New York: Harper, 1957.\n* World Beneath the Sea. New York: Harper, 1967\nFilms\n* The Silent World (a theatrical release from 1956, Dugan wrote film narration)\n* World Without Sun (a theatrical release from 1964, Dugan wrote film narration)\n* Conshelf Adventure (1966, the first film in the documentary TV series The Undersea World of Jacques Cousteau, Dugan co-wrote film narration, alongside Irwin Rosten)\nExternal links\n*[http://www.pabook.libraries.psu.edu/palitmap/bios/Dugan__James.html James Dugan], a biography by Leigh Haakenson at Penn State University."
    }
  ]
}