{
  "content": [
    {
      "type": "text",
      "text": "# James Morgan (Queensland politician)\n\n|birth_place        = Longford, County Longford, Ireland\n| death_date \t  =\n| death_place \t  = Warwick, Queensland, Australia\n|restingplace       = Warwick General Cemetery\n|birthname          = James Morgan\n|nationality        = Irish Australian\n|party              =\n|otherparty         =\n|spouse             = Catherine Barton (m.1848 d.1907)\n| known_for         =\n| occupation        = Newspaper editor\n| relations         = Arthur Morgan (son), Arthur Morgan (grandson)\n| alma_mater        =\n}}\nJames Morgan (1816–1878) was an Australian politician who was a Member of the Queensland Legislative Assembly.\nEarly life\nJames Morgan was born on 29 September 1816 in Longford, Ireland, the son of Michael, a local farmer. He attended the private school of author Maria Edgeworth in Edgeworthtown. He was a member of the  Church of England. At 19 years of age, he became interested in surveying and spent 3 years attached to a party of surveyors around Snowdon in Caernarvonshire, Wales. In late 1840, he immigrated on the Palestine, arriving in Sydney on 14 March 1841. He spent a few years in the Brisbane Water district in New South Wales before managing the property of W. C. Wentworth on the Namoi River until the end of 1847. In early 1848 he married. He continued to manage pastoral properties until 1868.\nEditorial career\nIn 1868 Morgan purchased the Warwick Argus newspaper. He worked fervently on thenewspaper, often writing columns particularly against the 1868 Land Act.\nPolitical career\nMorgan was elected the member for Warwick from 10 August 1870 until 21 July 1871, when he was defeated by Charles Clark in the 1871 Queensland colonial election. Morgan was again elected in Warwick unopposed on 4 November 1873, holding the seat until his death on 19 November 1878.  He held strongly conservative pursuits on property and agricultural rights.\nLater life and legacy\nIn July 1878, Morgan participated in a parliamentary excursion on the steamer Norseman. Due to rough weather, Morgan sustained a severe blow to his head. Later as the vessel berthed at Brisbane, he fell from the gangway to the wharf, causing a compound fracture of the right leg above the ankle. Although early reports suggested Morgan was recovering well, he remained ill for some months. Despite his illness, he tried to contest the 1878 Queensland colonial election held on 19 November, but was defeated by Jacob Horwitz. Morgan died 10 days later on 29 November 1878 at his home in Victoria Street, Warwick.\nAll business ceased in the town in the afternoon of his funeral on Saturday 31 November 1878. A special train was arranged so his son  The funeral cortege was nearly a mile long, comprising over 110 vehicles and estimated to contain at least 1200 people, including Queensland Premier John Douglas and other parliamentarians. In accordance with Morgan's deathbed wish, he was buried beside his son in the Warwick General Cemetery in a funeral ceremony conducted according to Anglican rites by the priest of St Mark's Anglican Church, Masonic rites and Oddfellow rites.\nHis son, Sir Arthur Morgan, became Premier of Queensland from 1903 to 1906. His grandson Arthur Morgan was a Member of the Australian House of Representatives.\nReferences"
    }
  ]
}