{
  "content": [
    {
      "type": "text",
      "text": "# James Burke (science historian)\n\n| birth_place        = Derry, Northern Ireland\n| death_date         =\n| death_place        =\n| body_discovered    =\n| death_cause        =\n| resting_place      =\n| resting_place_coordinates =\n| nationality        =\n| citizenship        =\n| other_names        =\n| known_for          = ''Tomorrow's WorldConnectionsThe Day the Universe Changed\n| education          =\n| alma_mater         = Jesus College, Oxford\n| employer           =\n| occupation         =\n| years_active       =\n| title              =\n| height             =\n| term               =\n| predecessor        =\n| successor          =\n| party              =\n| opponents          =\n| boards             =\n| spouse             = Madeline Hamilton (died 2009)\n| partner            =\n| children           =\n| parents            =\n| relations          =\n| callsign           =\n| signature          =\n| website            =\n| footnotes          =\n| module             =  }}\n}}\nJames Burke (born 22 December 1936) is a broadcaster, science historian, author, and television producer. He was one of the main presenters of the BBC1 science series Tomorrow's World  from 1965 to 1971 and created and presented the television series Connections (1978), and its more philosophical sequel The Day the Universe Changed (1985), about the history of science and technology. The Washington Post'' has called him \"one of the most intriguing minds in the Western world\".\nEarly life\nBurke was born in Derry, Northern Ireland. During World War II he was evacuated to Downhill, County Londonderry where he lived between the ages of 4 and 9. When his father returned home after the war, the family moved to Kent, England, where James Burke attended Maidstone Grammar School. He then served in the Royal Air Force (RAF) from 1955 to 1957 before being accepted at Jesus College, Oxford, where he studied Middle English, obtaining BA and MA degrees.\nPersonal life\nBurke married Frances Madeline Hamilton, a research assistant. She died in 2009. They had no children.\nCareer\nUpon graduation, he moved to Italy, where at the British School in Bologna, he was lecturer in English and director of studies, 1961–1963.  He also lectured at the University of Urbino.  Thereafter, he was headmaster of the English School in Rome, 1963–1965. He was involved in the creation of an English&ndash;Italian dictionary, and the publication of an art encyclopedia.\nBurke's entry into television was explained by People magazine in 1979: \"Television beckoned by chance one day on a Rome bus. Spotting an ad for a reporter for the local bureau of Britain's Granada Television, he says, 'I decided if the bus stopped at the next corner I would get off and apply for the job.' It did, he did, and the next thing he knew 'we went straight off to Sicily to do a series on the Mafia.'\"\nIn 1966, Burke moved to London and joined the Science and Features Department of the BBC, for which he was host or co-host of several programmes. He also worked as an instructor in English as a foreign language at the Regency Language School in Ramsgate.\nBurke established his reputation as a reporter on the BBC1 science series ''Tomorrow's World, and went on to present The Burke Special''. He was BBC television's science anchorman and chief reporter for the Apollo missions, as the main presenter of the BBC's coverage of the first Moon landing in 1969.\nIn collaboration with Mick Jackson, he produced the 10-part documentary series Connections (1978), which was broadcast on the BBC, and subsequently on PBS in the United States. Connections traced the historical relationships between invention and discovery; each episode chronicled a particular path of technological development. Connections was the most-watched PBS television series up to that time. It was followed by the 20-part Connections2 (1994) and the 10-part Connections3 (1997). Connections: An Alternative View of Change was broadcast in more than 50 countries and the companion book Connections: An Alternative History of Technology (1978) sold well. In 1980, Burke created and Jackson produced the six-part BBC series The Real Thing, about perception.\nIn 1985, Burke, with Richard Reisz and John Lynch, produced the 10-part television series The Day the Universe Changed (revised 1995), focusing on the philosophical aspects of scientific change in Western culture.\nBurke has been a regular writer for Scientific American and Time, and a consultant to the SETI project.\nBurke received the gold and the silver medals of the Royal Television Society. In 1998, he was made an honorary fellow of the Society for Technical Communication.\nBurke has contributed to podcasts, such as in 2008, when he appeared on Hardcore History with Dan Carlin, and in 2016 on Common Sense, again with Carlin, and to newspaper articles including two series for the Mogollon Connection by Jesse Horn, one focusing on the nature of morality, the other on the future of our youth.\nBurke presented a monologue, \"James Burke on the End of Scarcity\", first broadcast on BBC Radio 4 on 26 December 2017, in which he predicted nanotech manufacturing would revolutionize the world economy and society.\nIn a May 2020 interview, Burke said that he was writing a new Connections book. In 2023, his new series Connections with James Burke premiered on Curiosity Stream.\nKnowledge Web\nBurke is the leading figure in the development of the Knowledge Web, the planned digital realization of his books and television programmes, which would allow the user to travel through history and create his or her own connections. Eventually, the project may feature immersive virtual-reality historical recreations of people, places, and events.\nIn 2019, Burke produced a series of five 15-minute programmes for BBC Radio 4 with the title ''James Burke's Web of Knowledge, in each of which he traced the connections between two widely separated people or themes; the first programme connected Mozart to the helicopter.\nPredictions\nIn an article for the Radio Times in 1973, Burke predicted the widespread use of computers for business decisions, the creation of metadata banks of personal information, and changes in human behaviour, such as greater willingness to reveal personal information to strangers. In an interview on the PM programme on BBC Radio 4 on 30 August 2013, Burke discussed his predictions of a post-scarcity economy driven by advances in nanofactories, which he believes may be viable by 2043.\nBurke posed at least one of his predictions as a question. In Connections, he notes that the increase in connections over time causes the rate of innovation to accelerate, and asks what happens when this rate, or more importantly \"change\" itself, becomes too much for the average person to handle. He also questions what this would mean for individual power, liberty, and privacy.\nIn the conclusion of Connections, Burke said that computing and communications might be controlled by a computer science élite. Later, he suggested at the conclusion of The Day the Universe Changed that a worldwide revolution in communications and computer technology would allow people to instantaneously exchange ideas and opinions.\nTelevision credits\nTelevision series and documentaries by Burke:\n* Tomorrow's World (1966–1971)\n* Paid Off, a three-part series about employment (1967)\n* Intimate Relations, a three-part series about doctor-patient relations (1968)\n* The End of the Beginning (1972), about the end of the Project Apollo space programme\n* The Burke Special (1972–1976)\n* Stump the Scientist (1974), featuring an audience of children who questioned a panel of scientists in the hope of presenting a question they could not answer\n* The Inventing of America (1976), NBC–BBC co-production for the U.S. Bicentennial, co-hosted by Burke and Raymond Burr\n* Scenario: The Oil Game (1976), crisis game examining OPEC\n* Scenario: The Peace Game (1977), crisis game examining NATO\n* Connections (1978)\n* The Men Who Walked on the Moon (1979), a 10th anniversary review of the flight of Apollo 11\n* The Other Side of the Moon (1979), a critical examination of the Apollo space programme\n* The Real Thing (1980), about human perception\n* The Neuron Suite'', about the human brain (1982)\n* MacGillivray Freeman's Speed (IMAX) (1984), as the narrator\n* The Day the Universe Changed (1985, 1995)\n* After the Warming (1989), about the greenhouse effect\n* Masters of Illusion (1993), about Renaissance painting\n* Connections2 (1994)\n* Connections3 (1997)\n* ReConnections (2004)\n* Connections with James Burke (2023)\nBooks\n* ''Tomorrow's World I, with Raymond Baxter, (BBC 1970)\n* Tomorrow's World II, with Raymond Baxter, (BBC 1973)\n* Connections: Alternative History of Technology (Time Warner International/Macmillan 1978) ; published in North America as Connections (Little, Brown and Company, 1978)  and pbk: .\n* The Day the Universe Changed (BBC 1985)\n* Chances (Virgin Books 1991)\n* The Axemaker’s Gift, with Robert Ornstein and illustrated by Ted Dewan (Jeremy P Tarcher 1995)\n* The Pinball Effect: How Renaissance Water Gardens Made the Carburetor Possible—and Other Journeys Through Knowledge (Little, Brown & Company 1996)\n* Circles: Fifty Round Trips Through History, Technology, Science, Culture (Simon & Schuster 2000)\n* The Knowledge Web (Simon & Schuster 2001)\n* Twin Tracks (Simon & Schuster 2003)\n* American Connections: The Founding Fathers. Networked.''  (Simon & Schuster 2007)\nReferences\nExternal links\n*\n* [https://www.facebook.com/pages/James-Burkes-Knowledge-Web/1636642569892667 Burke's KnowledgeWeb Project's Facebook page]\n*\n* [http://www.stranova.com/Podcasts/Stranova25.mp3 Stranova Interview with James Burke on \"The Knowledge Web\"] 26 September 2006.\n* [http://archive.dconstruct.org/2012/admiralshovel Admiral Shovel and the toilet roll talk by Burke in the dConstruct Archive]"
    }
  ]
}