{
  "content": [
    {
      "type": "text",
      "text": "# James Edward Jouett\n\n|death_date   =\n|birth_place  = near Lexington, Kentucky\n|death_place  = Sandy Spring, Maryland\n|placeofburial= Arlington National Cemetery\n|placeofburial_label= Place of burial\n|image        = RADM James E. Jouett.JPG\n|image_size   =\n|caption      =\n|nickname     =\n|allegiance   = United States of America\n|serviceyears = 1841–1890\n|rank         =  Rear admiral\n|branch       =\n|unit         = USS MetacometNorth Atlantic Squadron1889 Panama action\n|battles      = Mexican–American WarAmerican Civil War\n* Battle of Mobile Bay\nColombian Civil War\n* Panama Incident\n|awards       =\n}}\nsteamer  in 1886.]]\nRear Admiral James Edward Jouett (7 February 1826 – 30 September 1902), known as \"Fighting Jim Jouett of the American Navy\", was an officer in the United States Navy during the Mexican–American War and the American Civil War. His father was Matthew Harris Jouett, a notable painter, and his grandfather was Revolutionary War hero Jack Jouett.\nBiography\nBorn near Lexington, Kentucky, Jouett was appointed midshipman 10 September 1841. He served on the African coast on the Decatur with Matthew C. Perry and on the John Adams during the Mexican–American War.\nAmerican Civil War\nAt the beginning of the Civil War, Jouett was captured by Confederates at Pensacola, Florida, but was soon paroled. He then joined the blockading forces off Galveston, Texas, distinguishing himself during the night of 7/8 November 1861 in the capture and destruction of Confederate schooner Royal Yacht, while serving on USS Santee. Jouett later commanded the Montgomery and R. R. Cuyler on blockading duty and in September 1863 took command of the Metacomet.\nIn the Battle of Mobile Bay, 5 August 1864, his ship, the Metacomet, was lashed to Admiral David Farragut's flagship Hartford as the ships entered the bay. Monitor Tecumseh was sunk by an underwater \"torpedo\", but the ships steamed on, inspired by Farragut's famous command: \"Damn the torpedoes! Four bells! Captain Drayton go ahead! Jouett full speed!\" Metacomet was sent after two Confederate gunboats, and in a short chase Jouett riddled the Gaines and captured the Selma.\nPost-Civil War and last years\nJouett had various commands ashore and afloat after the Civil War, taking command of the North Atlantic Squadron in 1884. In 1885 he commanded a naval force which forced the opening of the isthmus of Panama, threatened by insurrection.\nShore duty\nAdmiral Jouett was named President of the Board of Inspection and Survey and served from June 1886 to February 1890.\nRetirement\nRear Admiral Jouett retired in 1890. A special act of Congress granted him full pay for the rest of his life as a reward for his brilliant service. He returned to his home \"Stockwood\" in Howard County, Maryland he lived most of his remaining years at \"The Anchorage,\" Sandy Spring, Maryland. He was buried at Arlington National Cemetery section 1, site 85A.\nHonored in ship naming\nThree ships in the United States Navy have been named USS Jouett in his honor.\nReferences\n:"
    }
  ]
}