{
  "content": [
    {
      "type": "text",
      "text": "# James Lydon (historian)\n\n|birth_place   = Galway, Ireland\n|death_date    =\n|death_place   =\n|resting_place =\n| language     = English, Irish\n|citizenship   = Republic of Ireland\n|alma_mater    = Trinity College Dublin\n|subject       =\n}}\nJames Francis Lydon (12 May 1928 – 25 June 2013) was an Irish educator and historian. He served as the Lecky Professor of History at Trinity College, Dublin, from 1980 to 1993, and authored numerous works, particularly on the medieval history of Ireland.\nEarly life and education\nLydon was born to a large Catholic family in Connemara in 1928, the son of a local baker. His mother raised him to be fluent in the Irish language.\nLydon studied both English and History at University College Galway, graduating in 1950. One of his external examiners was J. R. R. Tolkien, who was so impressed with his work that he invited Lydon to tea after the university refused Tolkien permission to invite him for lunch. After completing his B.A., Lydon stayed on at UCG to undertake research for a master's degree. His adviser, history department professor Mary Donovan O'Sullivan, suggested to him that \"Ireland's contribution to the military activities of the English crown in the thirteenth century might be a subject that would repay investigation.\"  Lydon moved to England to attend the University of London and studied under the influential medievalist Sir Maurice Powicke.\nCareer\nIn 1955 he completed his thesis, \"Ireland's participation in the military activities of English kings in the thirteenth and fourteenth centuries.\" Revised for publication, it became the first of many scholarly contributions to the history of the era. Having a full year left on his Travelling Fellowship after his studies were concluded, he was advised by his mentor Powicke to \"use the residue of the funding to travel on the continent...stay clear of archives...read, visit galleries, listen to music, meet people and generally lift his eyes beyond the confines of the [Public] Record Office in Chancery Lane.\" This experience \"gave him an appreciation of European 'culture' in its broadest sense\" and enabled Lydon to \"bring the historiography of late medieval Ireland to maturity.\"  Returning to Galway in 1956 he taught history through the media of Irish and English and, in 1959, moved to Dublin to lecture at Trinity College. He became a full lecturer in 1962, a Fellow in 1965, and an associate professor in 1969.\nHe served as an educator for thirty-three years, and was Lecky Professor of History at Trinity from 1980 until his retirement in 1993.\nHe was elected a Member of the Royal Irish Academy in 1967, and president of the Royal Society of Antiquaries of Ireland from 1981 to 1984.\nWorks\nPrimarily an Irish mediaevalist, Lydon published his first major work, [http://www.worldcat.org/title/lordship-of-ireland-in-the-middle-ages/oclc/402454/editions?editionsView=true&referer=br The lordship of Ireland in the Middle Ages], in 1972. In the 1980s, he served as a contributor to the Cambridge Historical Encyclopedia of Great Britain and Ireland. Lydon's other works include:\n* [http://www.worldcat.org/title/gill-history-of-ireland/oclc/64287393/editions?editionsView=true&referer=br The Gill History of Ireland] (1972)\n* [http://www.worldcat.org/title/ireland-in-the-later-middle-ages/oclc/937819/editions?editionsView=true&referer=br Ireland in the Later Middle Ages] (1973)\n* ‘Ireland and the English Crown, 1171-1541’ in IHS (Irish Historical Studies) xxix:115 (1995) [pp.] 281-94.\n* [http://www.worldcat.org/title/law-and-disorder-in-thirteenth-century-ireland-the-dublin-parliament-of-1297/oclc/38114800/editions?editionsView=true&referer=br Law and disorder in thirteenth-century Ireland: the Dublin Parliament of 1297] (1997)\n* [http://www.worldcat.org/title/making-of-ireland-from-ancient-times-to-the-present/oclc/38527889/editions?editionsView=true&referer=br The Making of Ireland: From Ancient Times to the Present] (1998)\n* 'Richard II’s Expeditions to Ireland', in Government, War and Society in Medieval Ireland: Essays by Edmund Curtis, A.J. Otway-Ruthven and James Lydon, ed. Peter Crooks (Dublin, 2008).\nPersonal life\nLydon was unmarried. He battled depression in later life. He was fond of music, particularly opera.\nReferences\nFurther reading\n* Government, War and Society in Medieval Ireland: Essays by Edmund Curtis, A.J. Otway-Ruthven and James Lydon, edited by Peter Crooks. Four Courts Press, 2008. .\n* Colony & Frontier in Medieval England: Essays presented to J.F. Lydon, edited by T. B. Barry, Frame, Katharine Simms. Hambledon Press, 1995. .\nExternal links\n* [https://www.tcd.ie/history/research/medieval-history-seminars.php The James Lydon Research Seminar in Medieval History] at Trinity College"
    }
  ]
}