{
  "content": [
    {
      "type": "text",
      "text": "# James Edward Ryan\n\n}}\n| birth_place         =\n| death_date          =\n| death_place         =\n| spouse              = Katie Homer\n| education           = Yale University (BA)University of Virginia (JD)\n}}\nJames Edward Ryan (born September 21, 1966) is an American legal scholar. He served as the 9th president of the University of Virginia from August 1, 2018, to July 11, 2025. He served as the 11th dean of the Harvard Graduate School of Education from 2013 to 2018.\nEarly life and education\nRyan was raised in Midland Park, New Jersey, attending local public schools. He graduated from Yale University and the University of Virginia School of Law, where he was a member of Omicron Delta Kappa.\nCareer\nRyan clerked for chief judge of the 9th Circuit J. Clifford Wallace and then Chief Justice William Rehnquist. He served as Matheson and Morgenthau distinguished professor of law and Weber research professor of civil liberties and human rights at the University of Virginia School of Law, before taking the role of dean of the Harvard Graduate School of Education from 2013 to 2018.\nUniversity of Virginia\nOn September 15, 2017, the University of Virginia Board of Visitors  unanimously voted Ryan as the next president of the University of Virginia. On August 1, 2018, he assumed the 9th presidency of the university.\nOn October 19, 2018, Ryan announced full scholarships for in-state undergraduates from families earning under $30,000, and full tuition for those earning under $80,000.\nIn June 2025, The New York Times reported that the United States Department of Justice had pressured Ryan to resign as part of resolving a civil rights probe into UVA's diversity, equity and inclusion initiatives. On June 27, Ryan informed the university's board that he would resign. On July 2, the university announced that Ryan would return as a professor following a sabbatical. His last day as the university president was set as July 11.\nPersonal life\nRyan lives with his family in Charlottesville, Virginia. Prior to accepting the UVA presidency, Ryan lived in Lincoln, Massachusetts, with his wife, four children, and various animals including two cats, two dogs, and nine chickens.\nPublication\nRyan authored the book ''Wait, What?: And Life's Other Essential Questions, as well as the book Five Miles Away, A World Apart: One City, Two Schools, and the Story of Educational Opportunity in Modern America''.\nReferences\nExternal links\n* [https://www.gse.harvard.edu/faculty/james-ryan Harvard Graduate School of Education biography]\n* [https://president.virginia.edu/about-president University of Virginia biography]"
    }
  ]
}