{
  "content": [
    {
      "type": "text",
      "text": "# Jamie Howard\n\n|birth_place=Laurel, Mississippi, U.S.\n|heightft=6\n|heightin=1\n|weight_lb=212\n|highlights=\n|highschool=St. Thomas More (Lafayette, Louisiana)\n|pastschools=\n*LSU (1992–1995)\n}}\nJames Walker Howard III (born December 7, 1973) is an American former college football quarterback who played for the LSU Tigers.\nEarly life\nHoward attended St. Thomas More High School in Lafayette, Louisiana. He lettered in four sports while in high school: football, baseball, track, and basketball. He was drafted in the second round of the 1992 MLB Draft by the Atlanta Braves as a pitcher. Howard, overall pick #59, was selected immediately after the Oakland Athletics selected future MVP and All Star Jason Giambi at #58.\nCollege career\nHoward lettered all four years at LSU and was the first true freshman to start at quarterback for LSU since Steve Ensminger in 1976. He started six games, and played in eight, as a freshman, started ten games as a sophomore, nine his junior year and seven as a senior. Howard remained a member of the Atlanta Braves organization while enrolled at LSU and played in the Braves' minor leagues after his freshman and sophomore seasons. In his first three years at LSU, he struggled with interceptions, throwing 17 his junior year.\nHe returned for his senior season in 1995 as the Tigers' starting quarterback after sitting out the summer from the Atlanta Braves' organization. He injured his shoulder midway through the 1995 season in a game against Florida and missed a month of games.\nHoward finished his career as the third-leading passer in LSU history with 6,158 yards and second in career touchdown passes with 34.\nStatistics\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! colspan=3| !! colspan=6| Passing\n! colspan=3| Rushing\n|-\n! Season || Team || GP || Comp || Att || Pct || Yds || TD || INT || Att || Yds || TD\n|-\n| 1992 || LSU Tigers\n| 8 || 101 || 200 || 50.5 || 1,349 || 5 || 13 || 15 || –2 || 0\n|-\n| 1993 || LSU Tigers\n| 10 || 106 || 248 || 42.7 || 1,319 || 7 || 12 || 45 || 0 || 0\n|-\n| 1994 || LSU Tigers\n| 11 || 140 || 274 || 51.1 || 1,997 || 13 || 17 || 49 || -53 || 1\n|-\n| 1995 || LSU Tigers\n| 7 || 112 || 212 || 52.8 || 1,493 || 9 || 5 || 20 || -93 || 0\n|-\n! colspan=2| Totals\n! 36 || 459 || 934 || 49.1 || 6,158 || 34 || 47 || 129 || –148 || 1\n|}\nPersonal life\nHoward's son, Walker Howard, played quarterback at LSU and for the Ole Miss Rebels he is currently a quarterback for the Louisiana Ragin Cajuns .\nReferences\nExternal links\n* [https://lsusports.net/sports/football/roster/jamie-howard/20583 LSU profile]\n*\n* Football career statistics and player information from [https://www.sports-reference.com/cfb/players/jamie-howard-1.html Sports-Reference(CFB)]"
    }
  ]
}