{
  "content": [
    {
      "type": "text",
      "text": "# Jan Howard (1985 album)\n\nJan Howard is the seventeenth studio album released by American country music singer Jan Howard. The album was released in 1985 in a joint venture with Dot Records and MCA Records. It was produced by Billy Strange. It is Howard's second eponymous studio album issued during her career. The record was also her final studio release. The album includes re-recordings of her previous singles as well as new tracks not previously recorded. It was released in a vinyl and cassette format.\nBackground, content and release\nHoward second self-titled studio album was recorded because of a joint venture between the Dot and MCA record labels. In this label collaboration, a series of studio albums were to be recorded that contained material released by \"veteran\" country artists. Howard was approached to record the project by its producer, Billy Strange. Howard wrote the album's liner notes and called her new record \"a dream come true!\" She also commented about the privilege of being chosen for the project, calling the invitation an honor.\nThe eponymous album was recorded in 1985 at the Chelsea Recording Studio, located in Nashville, Tennessee. All sessions were produced by Billy Strange, whom Howard had not worked with before. The album consisted of ten tracks which featured re-recordings of Howard's early hits and new material as well. Howard's early hits included her 1966 single \"Evil on Your Mind\" and 1969's \"When We Tried\". Remaining tracks were new material Howard had not cut previously. Among the album's newer material was cover version of The Oak Ridge Boys' \"Ozark Mountain Jubilee\", Lee Greenwood's \"Dixie Road\" and the song \"The Wind Beneath My Wings\". Jan Howard was officially released in 1985 via Dot/MCA Records. Upon its original release, the album was issued in both a vinyl record format and a cassette album format. It was among Howard's first cassette album releases. The record did not chart on any major recording magazines, including Billboard. The project did not spawn any known singles either.\nTrack listing\n| length2         = 3:53\n| title3          = There's No Way\n| writer3         =\n| length3         = 4:14\n| title4          = I Don't Think I've Got Another Love Left in Me\n| writer4         =\n| length4         = 3:13\n| title5          = Wind Beneath My Wings\n| writer5         =\n| length5         = 4:27\n}}\n| length1         = 3:03\n| title2          = When I See Love\n| writer2         =\n| length2         = 2:48\n| title3          = Dixie Road\n| writer3         =\n| length3         = 3:17\n| title4          = I Spent All My Love on You\n| writer4         =\n| length4         = 3:03\n| title5          = Money Don't Make a Man a Lover\n| writer5         =\n| length5         = 3:58\n}}\nPersonnel\nAll credits are adapted from the liner notes of Jan Howard.\nMusical personnel\n* Pete Brodonali – guitar\n* Jimmy Capps – guitar, dobro\n* Mary Fielder – background vocals\n* David Humphreys – drums\n* Jan Howard – lead vocals\n* Terry McMillan – harmonica, percussion\n* Tony Migiliore – keyboards, piano\n* Kim Young – background vocals\n* Curtis Young – background vocals\nTechnical personnel\n* Chuck Haines – engineering\n* Glenn Meadows – mastering\n* Billy Strange – producer\n* Kevin Smith – engineering\nRelease history\n{|class=\"wikitable plainrowheaders\"\n|-\n!scope=\"col\"| Region\n!scope=\"col\"| Date\n!scope=\"col\"| Format\n!scope=\"col\"| Label\n!scope=\"col\"| Ref.\n|-\n! scope=\"row\" rowspan=\"2\"| United States\n| rowspan=\"2\"| 1985\n| Vinyl\n| rowspan=\"2\"| Dot Records/MCA Records\n|\n|-\n| Cassette\n|\n|-\n|}\nReferences"
    }
  ]
}