{
  "content": [
    {
      "type": "text",
      "text": "# Jane Stewart (politician)\n\n| birth_place         = Brantford, Ontario, Canada\n| death_date          =\n| death_place         =\n| spouse              =\n| children            = 2\n| party               = Liberal\n| cabinet             =\n| relations           =\n| alma_mater          =\n| occupation          =\n| profession          =\n}}\nJane Stewart,  (born April 25, 1955) is a Canadian politician who was the Minister of Human Resources Development from 1999 to 2003. She joined International Labour Organization in May 2004 and was the Special Representative and Director of the International Labour Organization's office to the United Nations until January 2016.\nLife and career\nBorn in Brantford, on April 25, 1955, Stewart was first elected to Parliament in the 1993 election. She was a friend of Prime Minister Jean Chrétien, and was soon appointed to the important position of Minister of National Revenue and subsequently Minister of Indian Affairs. In 1999, she was moved to the Department of Human Resources Development (HRDC), the government department that had the largest budget.\nStewart was the minister when the opposition alleged a so-called \"billion-dollar boondoggle\", where ineffective accounting practices at HRDC allegedly left millions of dollars unaccounted for. While the problems at HRDC mostly date from the time of her predecessor, Pierre Pettigrew, Stewart took the brunt of the attack but was also the Minister widely viewed to have cleaned up the mess left behind by her predecessor. She did not resign, and Chrétien stood by her throughout the ordeal.\nShe remained minister in charge of HRDC until Paul Martin became Prime Minister on December 12, 2003. She was moved to the backbenches because of her position as a loyalist to the ousted Chrétien. She retired from politics on February 13, 2004, to become an executive director of the International Labour Organization. In July 2005, she left her job with the ILO to return to Canada and marry businessman Henry Stolp. She later returned to ILO as its executive director, residing in New York City.\nWith the announcement that Martin was stepping down as leader of the Liberal Party, a group called \"Liberals for Jane\" had hoped to see Stewart seek the party leadership. This was ruled out when Stewart accepted the position of Chief of Staff to acting Leader of the Opposition, Bill Graham. Only weeks later, Stewart stepped down from the post due to family obligations. She was replaced by former cabinet minister Andy Mitchell.\nFrom 2006 to May 2007, Stewart was chief negotiator for the province of Ontario in the Caledonia land dispute.\nStewart comes from a family of politicians. Her father Robert Nixon was leader of the Ontario Liberal Party, while her grandfather was Ontario premier Harry Nixon.\nElectoral record\nReferences\nExternal links\n*"
    }
  ]
}