{
  "content": [
    {
      "type": "text",
      "text": "# Jane Ewart-Biggs, Baroness Ewart-Biggs\n\n|birth_place      = British India\n|death_date       =\n|death_place      = Fulham, London, England\n|nationality      = British\n|party            = Labour\n|occupation       = Politician\n|spouse           =\n*\n}}\n|children           = 3, including Kate Ewart-Biggs\n}}\nFelicity Jane Ewart-Biggs, Baroness Ewart-Biggs (née Randall; 22 August 1929 – 8 October 1992) was a British politician and wife to the British Ambassador to Ireland, Christopher Ewart-Biggs, who was murdered in office. She was President of the British Committee of UNICEF and became a life peer in 1981, later serving as the Labour Party's spokesperson on home affairs, consumer affairs and overseas development.\nEarly life and marriage\nFelicity Jane Randall was born in India to Indian Army Major Basil FitzHerbert Randall and his wife, Rena. She returned to England with her mother after the death of her father and studied at Downe House School. After attending secretarial college, she worked as a secretary at the Foreign Office and later joined the Savoy Hotel.\nShe married diplomat Christopher Ewart-Biggs on 5 May 1960 and they had three children, Henrietta, Robin and Kate Ewart-Biggs. Christopher became British Ambassador to Ireland, and after 12 days' service was assassinated by the IRA on 21 July 1976. Ewart-Biggs learned of his death over her car radio while driving in London. Subsequently, she joined the peace movement founded by Mairead Corrigan and Betty Williams, and launched a memorial fund in her husband's name to promote peace and reconciliation in Ireland, which founded the Christopher Ewart-Biggs Memorial Prize. She joined the lecture tour and gave regular talks to the Women's Institute throughout the UK.\nPolitics\nHer interest in politics increased following her husband's death and Ewart-Biggs joined the Labour Party. She attempted to become an MEP, given her knowledge of the European Community from her husband's posting in Brussels. The party were wary of her background and lack of constituency experience, which also led to her not being selected as a candidate for the Greater London Council.\nFrom 1984 she was President of the British Committee of the United Nations Children's Fund. After conducting constituency work, she became a life peer as Baroness Ewart-Biggs, of Ellis Green in the county of Essex, on 22 May 1981, making her maiden speech in the House of Lords on Britain in the European Economic Community on 17 June 1981.\nLady Ewart-Biggs spoke on home affairs, Ireland and was on committees dedicated to helping people. In 1983 she was appointed Labour front-bench spokesman on home affairs, and additionally consumer affairs and overseas development in 1987. In 1988 she became an opposition whip. She was a founder member of the Council of Charter 88 and in 1989 wrote a public letter on its behalf to Prime Minister Margaret Thatcher calling for a written constitution. She was described by fellow peer Alma Birk as \"considerate, helpful and with a sense of humour\" and said that \"she was a popular and highly regarded member of the House of Lords (where I first met her) and much loved by the Labour group of peers\".\nHealth problems and death\nIn 1991, she was diagnosed with cancer. She married Kevin Patrick O'Sullivan, a consulting engineer and her partner for 14 years, on 18 September 1992, and three weeks later she died in Charing Cross Hospital.\nFootnotes\nReferences\n*\n*"
    }
  ]
}