{
  "content": [
    {
      "type": "text",
      "text": "# Janisławice culture\n\nThe Janislawice culture, the Janislawice technocomplex, the Vistula cycle is a late Mesolithic culture from Central Poland. It was strongly connected with Eastern European cultures from Dnieper Basin. It derived by Stefan K. Kozłowski in 1964 and it is named after the Janislawice site near Skierniewice.\nChronology, genesis and disappearance.\nThe Janislawice culture existed from the second half of 6th millennium a.C. to as late as 4th millennium a.C. Its origins are studied mainly by its technology of producing flint tools. The best analogical traces lead south to the Pontic area, where technique of crafting tools, characteristic for the Janislawice culture, is known before 6th millennium a.C. Disappearing process of this complex spanned between 4th and 3rd millennium a.C. This process was characterised by the decline of basic elements of this material culture and their replacement with new elements coming from various directions, which was associated with spread of neolithisation process (influenced by the Funnel Beaker culture and the Globular Amphorae culture).\nJanislawice groups and their territorial reach.\nThe Janislawice culture co-existed with adjacent contemporary cultures, e.g. the Chojnice group along the middle Warta river or the Neman culture). In the Janislawice complex S.K. Kozłowski derived groups/cultures located in:\n* The Wistka group – extending into the Warsaw-Berlin Proglacial Stream Valley, the Vistula Basin, the region between Warsaw and Toruń, the part of Niecka Nidziańska region, Sandomierz Basin, the middle part of Narew and Bug rivers.\n* The eastern group – spanning the Niemen Basin, the upper Pripet, the Narew and Bug Basins, Sandomierz Basin, the Niecka Nidziańska region, the Cracow Gate, the upper Warta and the region between Proglacial Stream Valley and the Świętokrzyskie Mountains.\n* The Maksimonys group (now culture) – encompassing mainly the middle Niemen Basin and the Biebrza Basin.\nIn the given area, on the verge of the Wistka and the eastern groups there are sites which have features from both groups.\nCharacteristic features of material culture.\nIn the Janislawice culture technology of producing flint tools is characterised by precision workmanship. From precisely prepared conical and subconical cores regular long blades were produced. The blades were quite large for the Mesolithic standards. The basic tools group contains regular blade cores, scrapers on flakes, truncations, retouched blades, triangles, Janislawice-type points and trapezes formed from partially broken blades. This culture also contained bone products, usually ornamented by notching, used mainly for making knives and blades. From the Janislawice culture also comes a bone and antler tools and necklace made from animal teeth.\nSettlements and economy.\nThe Janislawice culture sites are located mainly on river terraces. The Janislawice people represented typical Mesolithic model of economy – hunting, gathering and fishing. In this culture flint mining was also present. People needed good-quality and large enough flint raw material sufficient for their tools production. The chocolate flint from eastward of the Świętokrzyskie Mountains was frequently used. The mine discovered in Tomaszów, Szydłowiec County and the part of mines in Orońsko are the proof that this kind of flint was mined by people from the Janislawice culture. On the Rydno XII/59 site in Grzybowa Góra, Skarżysko County, which is directly connected with a hematite mine, an oval-shaped semi-dugout dwelling (type of primitive habitation structure) with a fireplace laid out with flat stones was unearthed.\nBurial tradition.\nIn the Janislawice site, a male grave was unearthed. It contained rich burial inventory, the whole set of items associated with the Janislawice culture, including: 21 microliths, cores, blades, an animal teeth necklace, bone and antler tools. Two more graves were discovered in the Giżycko-Perkunowo site in Masuria. Their inventory included animal teeth necklaces, a flint retouched truncation and a trimming blade. All known Janislawice culture burials have ochre in the fill so it was surely part of burial rite of the Janislawice people.\nReferences"
    }
  ]
}