{
  "content": [
    {
      "type": "text",
      "text": "# Japanese-American life before World War II\n\nPeople from Japan began emigrating to the U.S. in significant numbers following the political, cultural, and social changes stemming from the 1868 Meiji Restoration. Japanese immigration to the Americas started with immigration to Hawaii in the first year of the Meiji era in 1868.\nEarly immigration\nFollowing the Chinese Exclusion Act of 1882, Japanese immigrants were increasingly sought by industrialists to replace the Chinese immigrants. However, as the number of Japanese in the United States increased, resentment against their success in the farming industry and fears of a \"yellow peril\" grew into an anti-Japanese movement similar to that faced by earlier Chinese immigrants. Around the turn of the century, around four thousand Japanese immigrants lived in San Francisco, funding their education as domestic workers.\nAnti-Asian litigation\nThe Naturalization Act of 1790 restricted naturalized U.S. citizenship to \"free white persons,\" and an 1870 amendment extended the right to African Americans, but the Issei and other Asian immigrants were excluded from citizenship. As a result, the Issei were unable to vote, and faced additional restrictions such as the inability to own land under many state laws. These laws would remain in effect until 1952, when the Supreme Court ruled alien land laws unconstitutional and the Walter-McCarran Act removed race-based requirements for naturalization.\nIn 1907, the Gentlemen's Agreement between the governments of Japan and the U.S. ended immigration of Japanese laborers (i.e., men), but permitted the immigration of spouses and children of Japanese immigrants already in the U.S. The Immigration Act of 1924 banned the immigration of all but a token few Japanese.\nThe ban on immigration produced unusually well-defined generational groups within the Japanese American community. Initially, there was an immigrant generation, the Issei, and their U.S.-born children, the Nisei Japanese American. The Issei were exclusively those who had immigrated before 1924. Because no new immigrants were permitted, all Japanese Americans born after 1924 were — by definition — born in the U.S. This generation, the Nisei, became a distinct cohort from the Issei generation in terms of age, citizenship, and English language ability, in addition to the usual generational differences. Institutional and interpersonal racism led many of the Nisei to marry other Nisei, resulting in a third distinct generation of Japanese Americans, the Sansei. Significant Japanese immigration did not occur until the Immigration Act of 1965 ended 40 years of bans against immigration from Japan and other countries.\nThe California Alien Land Law of 1913 was specifically created to prevent land ownership among Japanese citizens who were residing in the state of California. This law was strengthened in 1920, and several other western states adopted alien land laws during the 1920s.\nTimeline of life before World War II\n*1815: Japanese castaway Oguri Jukichi was among the first Japanese citizens known to have reached present day California.\n*1834: Three castaways Iwakichi, Kyukichi, and Otokichi, were the sole survivors of a Japanese rice transport ship that had been caught in a typhoon, damaged, and blown far off course before beaching on the northwest corner of the Olympic Peninsula in present-day Washington state, where they were briefly enslaved by the indigenous Makah people.  Upon hearing of the three Asian captives, John McLoughlin, the Chief Factor (agent) for the Columbia District at the Hudson's Bay Company, secured their release and had them delivered to Fort Vancouver.  They stayed there, along the banks of the Columbia River, for several months before eventually heading to London and then back to Asia.\n*1841: June 27 Captain Whitfield, commanding a New England sailing vessel, rescues five shipwrecked Japanese sailors from the uninhabited Japanese island of Torishima. Four disembark at Honolulu, however Manjiro Nakahama stays on board returning with Whitfield to Fairhaven, Massachusetts. After attending school in New England and adopting the name John Manjiro, he later became an interpreter for Commodore Matthew C. Perry.\n*1850: Seventeen survivors of a Japanese shipwreck are saved by the American freighter Auckland off the coast of California. In 1852, the group is sent to Macau to join Commodore Matthew C. Perry as a gesture to help open diplomatic relations with Japan. One of them, Joseph Heco (Hikozo Hamada), goes on to become the first Japanese person to become a naturalized American citizen.\n*1861: The utopian minister Thomas Lake Harris of the Brotherhood of the New Life visits England, where he meets Nagasawa Kanaye, who becomes a convert. Nagasawa returns to the U.S. with Harris and follows him to Fountaingrove in Santa Rosa, California. When Harris leaves the Californian commune, Nagasawa became the leader and remained there until his death in 1932.\n*1866: Japanese students arrive in the United States, supported by the Japan Mission of the Reformed Church in America which had opened in 1859 at Kanagawa.[https://archive.org/details/digconst00refo/page/353  A Digest of Constitutional and Synodical Legislation of the Reformed Church in America], Board of Publication of the Reformed Church in America, 1906\n*1868: 150 Japanese men immigrated to Hawaii to work on the sugar plantations. Of them 43 stayed and many intermarried with native Hawaiian women and others.\n*1869: A group of Japanese people arrive at Gold Hills, California and build the Wakamatsu Tea and Silk Farm Colony. Okei becomes the first recorded Japanese woman to die and be buried in the United States.\n*1882: The Chinese Exclusion Act of 1882. This arguably left room for agricultural labour, encouraging immigration and recruitment of Japanese from both Hawaii and Japan.\n*1884: The Japanese grants passports for contract labour in Hawaii where there was a demand for cheap labour.\n*1885: On February 8, the first official intake of Japanese migrants to a U.S.-controlled entity occurs when 676 men, 159 women, and 108 children arrive in Honolulu on board the Pacific Mail passenger freighter City of Tokio. These immigrants, the first of many Japanese immigrants to Hawaii, have come to work as laborers on the island's sugar plantations via an assisted passage scheme organized by the Hawaiian government.\n*1886: The Japanese government legalizes emigration.\n*1893: The San Francisco Board of Education attempts to introduce segregation for Japanese American children, but withdraws the measure following protests by the Japanese government.\n*1900s: Japanese immigrants begin to lease land and sharecrop.\n*1902: Yone Noguchi publishes The American Diary of a Japanese Girl, the first Japanese American novel.\n*1903: In Yamataya v. Fisher (Japanese Immigrant Case) the Supreme Court held that Japanese Kaoru Yamataya was subject to deportation since her Fifth Amendments due process was not violated in regards to the appeals process of the 1891 Immigration Act. This allowed for individuals to challenge their deportation in the courts by challenging the legitimacy of the procedures.\n*1906: The San Francisco Board of Education orders the segregation of Asian students in public schools.\n*1907: The Gentlemen's Agreement of 1907 between United States and Japan results in Japan ending the issuance passports for new laborers.\n*1913: California passed the Alien Land Law which prohibited \"aliens ineligible to citizenship\" (i.e. all Asian immigrants, including Japanese) from owning land or property, though it permitted three year leases.\n*1920–1925: Several states adopted similar alien land laws to prohibit leasing or selling land to \"aliens ineligible to citizenship\".\n*1924: The federal Immigration Act of 1924 banned immigration from Japan.\n*1927: Kinjiro Matsudaira becomes the first Japanese American to be elected mayor of a U.S. city (town of Edmonston, Maryland).\n*June 1935: Congress passed an act making allowing aliens to become eligible for citizenship eligible if they (a) had served in the U.S. armed forces between April 6, 1917, and November 11, 1918 (during U.S. involvement in World War One); (b) had been honorably discharged, and (c) were permanent residents of the United States. Only a handful of Japanese residents gained American citizenship under this act before the deadline on January 1, 1937.\n*1940: The Alien Registration Act (the Smith Act) was passed by the US Congress that required all aliens to register with the US government and be fingerprinted. President Roosevelt signed the 'Two Ocean Navy Expansion Act'. This act was the first step in preparing America for war against Germany, Japan, or both.\n*1940: The first military draft during peacetime in American history takes place.\n*1940: Roosevelt is elected as President of the United States for a third term with 54 percent of the popular vote.\n*August 18, 1941: Michigan representative John D. Dingell Sr. suggests in a letter to President Roosevelt that 10,000 Hawaiian Japanese Americans should be held as hostages to ensure \"good behavior\" on the part of Japan.\n*December 7, 1941: Attack on Pearl Harbor and entrance of the United States into World War II\nSee also\n*Anti-Japanese sentiment in the United States\n*Gakusei Kai\n*Gentlemen's Agreement of 1907\n*Harada House\n*Japanese language education in the United States\n*Kinmon Gakuen\n*Nihon Go Gakko (Tacoma)\n*North American Post\n*Rafu Shimpo\n*Japanese-American service in World War II\n*Japanese-American life after World War II\nReferences\nFurther reading\n*Arnold, Bruce Makoto. [https://www.academia.edu/5318273/Pacific_Childhood_Dreams_and_Desires_in_the_Rafu_Multiple_Transnational_Modernisms_and_the_Los_Angeles_Nisei_1918-1942 \"Pacific Childhood Dreams and Desires in the Rafu: Multiple Transnational Modernisms and the Los Angeles Nisei, 1918–1942\"].\n*Arnold, Bruce Makoto. [https://www.academia.edu/5462481/The_Japanese_Ethnopole_as_Determinant_The_Effects_of_the_Japantowns_on_Second-Generation_Japanese-Americans \"The Japanese Ethnopole as Determinant: The Effects of the Japantowns on Second-Generation Japanese-Americans\"].\nExternal links\n*http://academic.udayton.edu/race/02rights/intern01.htm\n*[https://archive.today/20070702083225/http://www.asahi-net.or.jp/~VR3K-KKH/japamerican/ja1top/japame1top.htm]\n*https://web.archive.org/web/20070527084939/http://www.asianamericanmedia.org/jainternment/camps/questions.html\n*https://web.archive.org/web/20070429163134/http://www.asianamericanmedia.org/jainternment/postwar/index.html\n*https://web.archive.org/web/20070502144642/http://www.asianamericanmedia.org/jainternment/ww2/prewar.html\n*http://www.asian-nation.org/internment.shtml\n*http://www.cetel.org/1942_9066.html\n*http://www.children-of-the-camps.org/history/timeline.html\n*http://contest.thinkquest.jp/tqj1998/10060/kyoseicamp.html\n*http://www.cr.nps.gov/history/online_books/anthropology74/ce1.htm\n*http://www.densho.org/\n*http://www.ericdigests.org/2001-3/japanese.htm\n*http://historymatters.gmu.edu/d/5154\n*http://www.historyonthenet.com/WW2/japan_internment_camps.htm\n*http://homepage3.nifty.com/ubiquitous/Japanese-Americans/Page08.htm\n*http://www.hyperhistory.com/online_n2/connections_n2/great_depression.html\n*http://caliber.ucpress.net/toc/phr/74/2\n*:ja:日系人の強制収容\n*http://www.janm.org/jpn/nrc_jp/accmass_jp.html\n*https://web.archive.org/web/20070310151129/http://library.thinkquest.org/TQ0312008/Lifebefore.html\n*https://web.archive.org/web/20070619073757/http://www.lib.utah.edu/spc/photo/9066/9066.htm\n*http://likeachild94568.hp.infoseek.co.jp/index.html\n*http://memory.loc.gov/learn/lessons/99/fear/gallery.html\n*http://www.metapress.com/content/407ww2237778\n*http://www.old-picture.com/japanese-internment-world-war-ii-index-001.htm\n*https://web.archive.org/web/20141223220816/http://www.sfmuseum.org/hist8/intern1.html\n*http://teacher.scholastic.com/activities/wwii/ahf/mineta/before_war.htm\n*http://yellowworld.org/activism/141.html\n*https://www.academia.edu/5462481/The_Japanese_Ethnopole_as_Determinant_The_Effects_of_the_Japantowns_on_Second-Generation_Japanese-Americans\n*https://www.academia.edu/5318273/Pacific_Childhood_Dreams_and_Desires_in_the_Rafu_Multiple_Transnational_Modernisms_and_the_Los_Angeles_Nisei_1918-1942"
    }
  ]
}