{
  "content": [
    {
      "type": "text",
      "text": "# Japanese mobile phone culture\n\ndistrict of Tokyo with a phone in 2008]]\nin 2006]]\nIn Japan, mobile phones became ubiquitous years before the phenomenon spread worldwide. In Japanese, mobile phones are called , literally \"portable telephones\", and are often known simply as keitai (携帯).\nA majority of the Japanese population own cellular phones, most of which are equipped with enhancements such as video and camera capabilities. As of 2018, 65% of the population owned such devices. This pervasiveness and the particularities of their usage has led to the development of a mobile phone culture, or \"keitai culture\", which especially in the early stages of mobile phone adoption was distinct from the rest of the world.\nFeatures\nJapan was a leader in mobile phone technology. The first commercial camera phone was the Kyocera Visual Phone VP-210, released in Japan in May 1999. The first mass-market camera phone was the J-SH04, a Sharp J-Phone model sold in Japan in November 2000. It could instantly transmit pictures via cell phone telecommunication. The J-Phone (Stylized as 写メール, which stands for Photo-Mail) model not only included a camera, but also the function to send photographs via messaging or e-mail, which made the phone extremely popular at the time. Technologies like 3G mobile broadband were common in Japan before any other country.\nSome of the main features of a mobile phone in Japan are:\n* E-mail\n* Configurable databases\n* Phone and address books\n* Alarm clocks and stopwatches\n* Live video feed via Piconet\n* Mobile games (e.g. RPGs like Dragon Quest or Final Fantasy series)\n* Timers\n* Camera phone features (e.g. selfie, front-facing camera) with mandatory shutter sound. This is because taking upskirt shots of schoolgirls on subway is a problem in Japan.\n* Image enhancement capabilities, such as the option to add borders, create animations, and more.\n* Instant messengers\n* Emoji\n* Calculator, calendar, schedule notes and memo pad\n* Audio recording\n* Portable music player (MP3 player, etc.)\n* Portable video player (MP4 player, etc.)\n* Online video viewing (Flash, YouTube, Nico Nico Douga etc.)\n* Video calling\n* GPS navigation\n* Television (1seg) and radio (FM/AM) access\n* Video-on-demand (VOD) content\n* Theft prevention buzzer (with automatic reporting system to the police)\n* Pedometer\n* 'Read aloud' system\n* Touch-pad system\n* A fingerprint/face recognition system for the protection of personal data\n* Mobile centrex service with wireless LAN\nIn recent years, some cellular phones have been updated to be used as debit or credit cards and can be swiped through most cash registers to buy products as varied as mascara and jet planes, as more and more companies offer catalogs for cell phones. These functionalities include:\n* E-money service and various certification functions through Untouched IC card (FeliCa etc.)\n* Various services with NTT DoCoMo's ‘Osaifu-Keitai (mobile phone with wallet function)’\n* E-money service e.g. ‘Edy’\n* ‘Mobile Suica,’ allows the phone to be used as a rail ticket\n* Cmode: vending machines which can be used with QR Codes 'Osaifu-Keitai'\n* NTT DoCoMo's service (information about traffic, food, shopping etc.) by GPS\nSome newer models allow the user to watch movies and/or television. Most phones can be connected to the Internet through services such as i-mode. Japan was also the first to launch 3G services on a large scale. Users can browse text-only Internet sites, and many Japanese sites have sub-sites designed especially for cellular phone users. One of the most popular services allows users to check train schedules and plan trips on public transit.\nThe wide variety of features, many original to or limited to Japan, lead to the term \"Galápagos syndrome\", as these resulting phones were dominant in the island nation of Japan, but unsuccessful abroad. This has since led to the term  to refer to Japanese feature phones, by contrast with newer smart phones.\nMarket\n, the Japanese mobile phone market is broadly divided into a high-end, consisting of smartphones (, abbreviated as  or ); mid-range, consisting of feature phones (); and a low-end, consisting of Personal Handy-phone System (PHS,  or , from ). There is some overlap of market segments between low-end smartphones and high-end feature phones, and many shared features. PHS, which was initially developed as a cheaper alternative to 2G networks such as CDMA and GSM, was initially deployed in 1995, but is now only offered by one carrier, Y!Mobile (part of SoftBank). As elsewhere in the world, smartphones have been growing rapidly.\nIn use\nThe use of mobile phones to make calls on public transport is frowned upon, and messages asking passengers not to make calls and to switch their phones to silent mode (\"public mode\" or \"manner mode\" in Japanese) are played frequently. This, combined with the low per-message price and ample allowed length per message (10,000 characters), has increased the use of text messaging as an alternative to calls.\nAbbreviations are also widespread. '\\' may be attached at the end of a sentence to show that they are not happy about the event described. An otherwise neutral message about a school test could, if it ended with '\\', imply that the student did not study enough, or that the test itself invites negative emotion.\nSome of these usages disappeared as suitable emoji were made, but these newly made icons also acquired a usage not originally intended. One example deals with the astrological symbol for Libra (♎). It resembles a cooked and puffed mochi, and is sometimes used in a Happy New Year's message as mochi are often eaten then. The symbol for Aquarius (♒) resembles waves, so this would be used to mean 'sea'. The number of icons gradually increased and they are now coloured on most cell phones, to make them more distinct. ASCII art is also used widely, commonly to illustrate faces with expressions, as in Shift JIS art.\nEmoji\nEmoji, originating on Japanese mobile phones in 1997, became increasingly popular worldwide in the 2010s after being added to several mobile operating systems. They are now considered to be a large part of popular culture in the West.\nThe SkyWalker DP-211SW, a mobile telephone manufactured by J-Phone which supported a set of 90 emoji, was the first phone known to contain a set of emojis as part of its typeface, dating back to 1997. The J-Phone DP-211SW didn't sell well due to its high retail price, and therefore mass-market adoption of emoji didn't take place at the time. J-Phone later became Vodafone Japan and is now SoftBank Mobile; a later, expanded version of the SoftBank emoji set was the basis for the emoji selection available on early iPhones.\nA highly influential early set of 176 cellular emoji was created by Shigetaka Kurita in 1999, and deployed on NTT DoCoMo's i-mode, a Mobile web platform. They were intended to help facilitate electronic communication, and to serve as a distinguishing feature from other services. According to interviews, he took inspiration from Japanese manga where characters are often drawn with symbolic representations called manpu (such as a water drop on a face representing nervousness or confusion), and weather pictograms used to depict the weather conditions at any given time. It included the Face with Tears of Joy emoji, which represents a Japanese visual style commonly found in manga and anime, combined with kaomoji and smiley elements. An additional 76 emoji, besides the 176 basic emoji, were added in phones supporting C-HTML 4.0.\nGyaru-moji\nOne very distinct form of writing is called 'gyaru-moji ('gal characters' named after the fashion style 'gyaru' or 'gal' because the people of this fashion style are the ones who often use this kind of lettering). For example, lt wouldn't correspond to the Latin characters 'L' and 't' but instead it would correspond to the hiragana, け ('ke'). Notice that it looks very similar when written. Many hiragana, katakana and kanji are taken apart and reassembled using different characters including alphabet characters. This can be related to the way the English language hacking culture uses 1337 language to hide the meaning of the words typed. It is also possibly due to different character limits when different languages are used, e.g. 160 Latin characters and 70 Unicode (inc. kanji). By splitting the characters into alpha-numeric characters, it extends the possible over-all length of the message.\nCell phone novels\nA cell phone novel, or |lead=yes}}, is a literary work originally written on a cellular phone via text messaging. This type of literature originated in Japan, where it has become a popular literary genre. However, its popularity has also spread to other countries internationally, especially to China, the United States, Germany, and South Africa. Chapters usually consist of about 70–100 words each due to character limitations on cell phones.\nMobile gaming\nIn the early 2000s, mobile games gained mainstream popularity in Japan, years before the United States and Europe. By 2003, a wide variety of mobile games were available on Japanese phones, ranging from puzzle games and virtual pet titles that utilize camera phone technology to 3D games with PlayStation-quality graphics. Older arcade-style games became particularly popular on mobile phones, which were an ideal platform for arcade-style games designed for shorter play sessions.\nGraphics improved as handsets became more powerful, as demonstrated by the mobile version of Ridge Racer in 2003, though such titles typically cost twice as much as other mobile games. Ridge Racer was published by Namco, one of the most successful mobile game publishers at the time. That same year, Namco also released a fighting game that uses camera phone technology to create a player character based on the player's profile, and interprets the image to determine the character's speed and power; the character can then be sent to a friend's mobile to battle. Namco began attempting to introduce mobile gaming to Europe in 2003.\nOther mobile games released in 2003 included a Tamagotchi-like virtual pet game by Panasonic where the pet can be fed with photos of foods taken with a camera phone. Another virtual pet game utilized a fingerprint scanner built into a handset to interact with a pet. Another mobile game that year was an educational game that utilized a mobile's microphone to help children with their pronunciation skills.\nJapan is the world's largest market for mobile games. The Japanese market today is becoming increasingly dominated by mobile games, which generated $5.1 billion in 2013, more than traditional console games in the country.\nDecoration\nPhone decorations are common, notably mobile phone charms and various stickers. The stickers are often in the maki-e style, and are advertised as such.\nTeenagers and mobile phones\nPaging devices used in the late 1980s to early 1990s predate mobile phones and paved the way for the popularity of the phones among teenagers. Pagers could only display numbers and were intended to alert the owner that they had received a call from a certain phone number, but teens quickly began using numeric messages to communicate many things, including greetings and everyday emotions. Most were based on various ways numbers could be read in Japanese. Examples are\n* 4-6-4-9 – yo-ro-shi-ku (\"hello,\" \"best regards\")\n* 3-3-4-1 – sa-mi-shi-i (\"I feel lonely\")\n* 8-8-9-1-9 – ha-ya-ku-i-ku (\"hurry up, let's go\")\nWith the rapidly falling prices of cell phones in the mid-1990s, young people began experimenting with the short message service that the mobile phone companies started offering. When the i-mode service became available, the mobile phone culture began flourishing earnestly as this service offered an E-mail application. Magazines and television regularly make specials focusing on the current trend of how mobile phones are used by young people.\nForefront of consumer technology\nThere is a popular trend in Japan to use the mobile phone handset to read information from special barcodes. The current technology is based on 'QR codes' which are a form of 2D barcode that is written out in a square shape instead of a bar shape. The phone handset can scan the QR code using its camera or other input, decode the information, and then take actions based on the type of content. The most popular usage of these QR codes is in advertising. All over Japan there are posters with the codes on and they are found extensively in magazines and even on some people's business cards. The QR code usually has links to a web site address or email address that the phone can access, or it might contain address and telephone numbers.\nSony, working with NTT DoCoMo, has been spearheading the mobile phone wallet technology, commonly known as 'FeliCa'. This technology makes use of an RFID chip inside the handset that can communicate with reading devices when the phone is placed near them. Though the technology is relatively new, there are many locations such as convenience stores which allow users to pay for goods using their phones; some vending machines even accept phone payments. Users must 'charge up' their accounts with credits before they can pay using their phones.\nThe Ubiquitous Business Department of NTT DoCoMo is developing the technology for a mobile phone to be the purchase system for virtual shops and smart shops, an authentication system in the medical field, and the purchase point for street poster advertisements.\nGracenote and Media Socket have a service where the user can hold the phone up to a source of music (such as a speaker), and, by dialing a certain phone number, find the song in a database and have it identified. The user receives the song's title, artist, and album within seconds. This information can in turn be used to search the mobile Internet to find that song. Many of these technologies are now common place throughout the world thanks to the rise of smartphones, such as Android and iOS devices.\nSelfie culture\n.]]\nThe modern selfie has origins in Japanese kawaii (cute) culture, which involves an obsession with beautifying self-representation in photographic forms, particularly among females. By the 1990s, self-photography developed into a major preoccupation among Japanese schoolgirls, who took photos with friends and exchanged copies that could be pasted into kawaii albums. The digital selfie originates from purikura (Japanese shorthand for \"print club\"), which are Japanese photo sticker booths. Video game companies Sega and Atlus introduced the first purikura in February 1995, initially at game arcades, before expanding to other popular culture locations such as fast food shops, train stations, karaoke establishments and bowling alleys. Purikura became a popular form of entertainment among youths in Japan, and then across East Asia, in the 1990s.\nTo capitalize on the purikura phenomenon in East Asia, Japanese mobile phones began including a front-facing camera, which facilitated the creation of selfies. The first front-facing camera phone was the Kyocera Visual Phone VP-210, released in Japan in May 1999. It was called a \"mobile videophone\" at the time. It stored up to 20 JPEG images, which could be sent over e-mail, or the phone could send up to two images per second over Japan's Personal Handy-phone System (PHS) wireless cellular network. This led to a transition in Japanese selfie culture from purikura to mobile phones. Photographic features in Japanese purikura and smartphones were later adopted by apps such as Instagram and Snapchat, including scribbling graffiti or typing text over selfies, adding features that beautify the image, and photo editing options such as cat whiskers or bunny ears.\nNegative aspects\nIt is considered a violation of good etiquette to answer a cell phone in certain public places. For example, on trains it is rude to answer or talk on cellphones. Many people keep their phone in 'manner mode' (silent mode) in order to not bother others and to avoid embarrassment on trains. On the other hand, writing emails or playing games with a cell phone while riding the train is completely acceptable.\nElectromagnetic energy is theorized to cause interference with heart pacemakers and other medical devices. Most trains contain signs demanding that mobile phones be turned off when around seats reserved for the elderly and handicapped, but passengers rarely do so. In hospitals, it is expected that one should turn it off entirely.\nBoth talking on the phone or texting/messaging while operating a vehicle or riding a bicycle are prohibited, but nevertheless remain fairly common.\nSee also\n* Camera phone\n* Culture of Japan\n* Emoji\n* Mobile phone industry in Japan\n* Mobile web\n*\nReferences\nFurther reading\n*\n*\n*\n*\n*\nExternal links\n* [http://www.itofisher.com/mito/archives/mobileyouth.pdf \"Mobile Phones, Japanese Youth, and the Re-Placement of Social Contact\"] by Mizuko Ito\n* [https://web.archive.org/web/20071116163708/http://mitpress.mit.edu/catalog/item/default.asp?tid=10610&ttype=2 \"Personal, Portable, Pedestrian: Mobile Phones in Japanese Life\"](2005) edited by Mizuko Ito, Daisuke Okabe and Misa Matsuda. Click [http://www.itofisher.com/mito/archives/pppintro.pdf here] for a pdf of a draft of the introduction.\n*[https://www.viralxd.com/why-do-we-rarely-see-japanese-made-smartphones/ Why Do We Rarely See Japanese-Made Smartphones?]  Article Published in Viralxd.com"
    }
  ]
}