{
  "content": [
    {
      "type": "text",
      "text": "# Japanese invasion of Vigan__disambig_1\n\n|combatant2=\n*\n}}\nThe Japanese Invasion of Vigan (Filipino: Paglusob ng mga Hapones sa Vigan, Ilocano: Panagdarup dagiti Hapones iti Vigan) on 10 December 1941 was one in a series of advance landings made by Imperial Japanese forces as first step in their invasion of the Philippines. The purpose was to obtain control of local air strips, which could be used as forward bases by fighter aircraft for operations further south. The first invasion was of Batan Island on 8 December 1941. This was followed by Vigan, Aparri, Legaspi, Davao and Jolo Island over the next few days.\nDisposition of forces\nVigan is the capital of Ilocos Sur Province, in northwestern Luzon, about 220 miles north of Manila on the coastal Route 3. It is bordered on the east by the Cordillera Mountains which separate it from the Cagayan Valley.  The city is about three miles from the coast, and is served by the port of Pandan on the mouth of the Abra River.\nThe area of Vigan was in theory defended by General Wainwright's North Luzon Force.  However, with only a few men and a large territory to cover, Wainwright could spare only one partially trained and equipped Philippine Army division, the 11th Division, commanded by Col. William E. Brougher, for all of northern Luzon. A reserve division, the 11th had begun to mobilize only in September and was at only two-thirds of its authorized strength of 1500 men per regiment. It also suffered from a serious shortage of equipment, including almost all of its artillery and transports.\nOn the Japanese side, General Homma had organized a detachment from the IJA 48th Division’s 2nd Infantry Regiment under Colonel Kanno. This numbered approximately 2000 men of the 3rd Battalion, and half the 1st Battalion. The invasion force was supported by a flotilla of the Imperial Japanese Navy led by Vice Admiral Shoji Nishimura, consisting of the light cruiser ,  the destroyers , , , , , , , six minesweepers, nine anti-submarine craft and six transports The fleet deployed from Mako in the Pescadores and arrived at Vigan before dawn on 10 December. The landing operation was covered by aircraft of the IJAAF 24th and 50th Fighter Regiments launched from the airfield at Batan Island captured the day before.\nLanding and aftermath\nAt the same time as the landing operation at Aparri, the Kanno Detachment disembarked at Vigan faced no opposition from American forces; however, reports of the landing was conveyed to General MacArthur’s headquarters in Manila by a reconnaissance Curtiss P-40 Warhawk, and the Far East Air Force launched a response consisting of five Boeing B-17 Flying Fortresses and escorting P-40 and Seversky P-35 fighters of the 34th Pursuit Squadron.\nThe initial detachment from the Kanno Detachment quickly secured the city of Vigan by 1030 in the morning; however as at Aparri, the Japanese landing operation was hampered by heavy seas and strong winds. The American aircraft attacked the Japanese fleet with bombs and strafing attacks, and one of the Japanese transports, the Oigawa Maru was forced to beach to prevent sinking. A second transport, the Takao Maru was also beached in a subsequent attack, and one minesweeper,   was sunk. The Japanese also had casualties on the destroyer Murasame and light cruiser Naka (which suffered 3 crewmen killed) and 30 men in the transport Hawaii Maru were wounded, despite air cover by eighteen fighters of the IJAAF 24th Fighter Regiment.\nDue to continuing bad weather, the Vigan Landing Force was shifted four miles to the south, where it was finally able to land the remainder of the Kanno Detachment on 11 December. A small detachment was quickly sent north to capture Laoag, capital of Ilocos Norte Province, fifty miles away, along with its airfield.\nWith the Americans on the run, Homma decided to leave only a small garrison at Vigan, and to move the bulk of his combat forces to south to assist the Japanese landing force at Lingayen Gulf.\nBy 1300 on 20 December the Tanaka Detachment from Aparri and Kanno Detachments had joined together as a single regiment, and marched out of Vigan south along coastal Route 3. Repairing destroyed bridges along the way, the Japanese reached the town of reached Bacnotan by the evening of 21 December. Bacnotan was defended by elements of the Philippine 11th Division, but the Japanese made a flanking movement to the east and forced part of the defenders back, while cutting off reinforcements from the mountains to the east. The Japanese reached San Fernando, La Union, on the morning of the 22 December, only a few hours after the main elements of the IJA 14th Army began the Japanese invasion of Lingayen Gulf, just to the south.\nConsequences\nIn retrospect, the advance landings by the Japanese in northern Luzon, including at Vigan, accomplished little of strategic or tactical value. The air fields seized were small, and with the rapid advance of the Japanese into central Luzon, were soon unnecessary for further operations.\nReferences"
    }
  ]
}