{
  "content": [
    {
      "type": "text",
      "text": "# Japan during World War II\n\n}}\nJapan participated in World War II from 1939 to 1945 as a member of the Axis. World War II and the Second Sino-Japanese War encapsulated a significant period in the history of the Empire of Japan, marked by significant military campaigns and geopolitical maneuvers across the Asia-Pacific region. Spanning from the early 1930s to 1945, Japan employed imperialist policies and aggressive military actions, including the invasion of the Republic of China, and the  Military Occupation of French Indochina.\nIn 1941, Japan attempted to improve relations with the United States in order to reopen trade, especially for oil, but was rebuffed. On 7 December, 1941, Japan attacked multiple American and British positions in the Pacific. The Pacific War, a major theater of World War II, further intensified Japan's engagements, leading to significant confrontations with Allied forces in the Pacific Ocean and Southeast Asia. Although initially successful, Japan took significant losses at the Battle of Midway. In addition, Japan met significant setbacks in China. On 6 and 9 August, 1945, Japan was hit by two atomic bombs, while the Soviet Union declared war and invaded Manchuria on 8 August. These events led to the surrender of Japan on 15 August.\nDuring the war, the Japanese committed war crimes, including attacking neutral countries without a prior declaration of war, massacres and rapes of civilians, especially in the Rape of Nanking, the use of comfort women, and biological and chemical warfare and experimentation. In addition, prisoners of war were mistreated, executed, and experimented on. Modern day Japan continues to deny these atrocities.\nPrelude\nThe Empire of Japan had been expanding its territory since the First Sino-Japanese and the Russo-Japanese War, before World War I through the colonisation of Taiwan and Korea. In 1931, Japan invaded and conquered Manchuria in northeast China. The bordering Chinese territory of Jehol was also taken in 1933, and in 1936, Japan created a similar puppet state in Inner Mongolia.\nJapanese invasion of China\nThe Second Sino-Japanese War (1937–1945) was a military conflict that was primarily waged between the Republic of China and the Empire of Japan. The war made up the Chinese theater of the wider Pacific Theater of the Second World War. The beginning of the war is conventionally dated to the Marco Polo Bridge Incident on 7 July 1937, when a dispute between Japanese and Chinese troops in Beijing escalated into a full-scale invasion. This full-scale war between the Chinese and the Empire of Japan is often regarded as the beginning of World War II in Asia. (However, according to the Chinese Ministry of Education, it marked only a phase in a 14-year war that began with the 1931 invasion of Manchuria.)\nAs part of its operations against China, on 22 September 1940 Japan invaded French Indochina. On 27 September it signed the Tripartite Pact with Germany and Italy. War with the U.S. and other Western allies of World War II began with the attack on Pearl Harbor on 7 December 1941. Over the course of seven hours there were coordinated Japanese attacks on the U.S.-held Philippines, Guam and Wake Island, the Dutch Empire in the Dutch East Indies, Thailand and on the British Empire in Borneo, Malaya and Hong Kong. The strategic goals of the offensive were to destroy the U.S. Pacific fleet, capture oil fields in the Dutch East Indies, and maintain their sphere of influence in East Asia. It was also to expand the outer reaches of the Japanese Empire to create a formidable defensive perimeter around newly acquired territory.\nChina fought Japan with aid from the Soviet Union and the United States. After the Japanese attacks on Malaya and Pearl Harbor in 1941, the war merged with other conflicts which are generally categorized under those conflicts of World War II as a major sector known as the China Burma India Theater. Some scholars consider the European War and the Pacific War to be entirely separate, albeit concurrent wars. Other scholars consider the start of the full-scale Second Sino-Japanese War in 1937 to have been the beginning of World War II. The Second Sino-Japanese War was the largest Asian war in the 20th century. It accounted for the majority of civilian and military casualties in the Pacific War, with between 10 and 25&nbsp;million Chinese civilians and over 4&nbsp;million Chinese and Japanese military personnel missing or dying from war-related violence, famine, and other causes. The war has been called \"the Asian holocaust\".\nDecision process by Japanese leaders\nThe decision by Japan to attack the United States remains controversial. Study groups in Japan had predicted ultimate disaster in a war between Japan and the U.S., and the Japanese economy was already straining to keep up with the demands of the War with China. However, the U.S. had placed an oil embargo on Japan and Japan felt that the United States' demands of unconditional withdrawal from China and non-aggression pacts with other Pacific powers were unacceptable. Facing an oil embargo by the United States as well as dwindling domestic reserves, the Japanese government decided to execute a plan developed by the military branch largely led by Osami Nagano and Isoroku Yamamoto to bomb the United States naval base in Hawaii, thereby bringing the United States to World War II on the side of the Allies. On 4 September 1941, the Japanese Third Konoe Cabinet (Prime Minister Fumimaro Konoe) met to consider the war plans prepared by Imperial General Headquarters, and decided:\nOur Empire, for the purpose of self-defense and self-preservation, will complete preparations for war ... and is ... resolved to go to war with the United States, Great Britain, and the Netherlands if necessary. Our Empire will concurrently take all possible diplomatic measures vis-a-vis the United States and Great Britain, and thereby endeavor to obtain our objectives ... In the event that there is no prospect of our demands being met by the first ten days of October through the diplomatic negotiations mentioned above, we will immediately decide to commence hostilities against the United States, Britain and the Netherlands.\nVice Admiral Isoroku Yamamoto, the chief architect of the attack on Pearl Harbor, had strong misgivings about war with the United States. Yamamoto had spent time in the United States during his youth when he studied as a language student at Harvard University (1919–1921) and later served as assistant naval attaché in Washington, D.C. Understanding the inherent dangers of war with the United States, Yamamoto warned his fellow countrymen: \"We can run wild for six months or maybe a year, but after that, I have utterly no confidence\".\nOrigin of conflict\non the American Pacific Fleet at Pearl Harbor, Sunday 7 December 1941.]]\nSince early 1941 the United States and Japan had been engaged in negotiations in an attempt to improve their strained relations and end the war in China. During these negotiations, Japan advanced a number of proposals which were dismissed by the Americans as inadequate. At the same time the United States, the United Kingdom, and the Netherlands engaged in secret discussions for the joint defense of their territories, in the event of a Japanese attack against any of them. Roosevelt reinforced the Philippines (an American protectorate scheduled for independence in 1946) and warned Japan that the United States would react to Japanese attacks against any \"neighboring countries\".\nFrustrated at the lack of progress and feeling the pinch of the American–British–Dutch sanctions, Japan prepared for war. On 20 November, a new government under Prime Minister Hideki Tojo presented an interim proposal as its final offer. It called for the end of American aid to China and for lifting the embargo on the supply of oil and other resources to Japan. In exchange, Japan promised not to launch any attacks in Southeast Asia and to withdraw its forces from southern Indochina. The American counter-proposal of 26 November required that Japan evacuate all of China without conditions and conclude non-aggression pacts with all Pacific powers. That meant Japan was essentially forced to choose between abandoning its ambitions in China, or seizing the natural resources it needed in the Dutch East Indies by force; the Japanese military did not consider the former an option, and many officers considered the oil embargo an unspoken declaration of war.\nJapan planned to rapidly seize European colonies in Asia to create a large defensive perimeter stretching into the Central Pacific. The Japanese would then be free to exploit the resources of Southeast Asia while exhausting the over-stretched Allies by fighting a defensive war. To prevent American intervention while securing the perimeter, it was further planned to neutralize the United States Pacific Fleet and the American military presence in the Philippines from the outset.\nJapanese offensives (1941–1942)\nOn 7 December 1941 (8 December in Asian time zones), Japan attacked British and American holdings with near-simultaneous offensives against Southeast Asia and the Central Pacific. These included an attack on the American fleets at Pearl Harbor and the Philippines, Guam, Wake Island, landings in Malaya, Thailand, the Shanghai International Settlement and the Battle of Hong Kong.\nThe Imperial Japanese Navy made its surprise attack on Pearl Harbor, Oahu, Hawaii Territory, on Sunday morning, 7 December 1941. The Pacific Fleet of the United States Navy and its defending Army Air Forces and Marine air forces sustained significant losses. The primary objective of the attack was to incapacitate the United States long enough for Japan to establish its long-planned Southeast Asian empire and defensible buffer zones. However, as Admiral Yamamoto feared, the attack produced little lasting damage to the US Navy with priority targets like the Pacific Fleet's three aircraft carriers out at sea and vital shore facilities, whose destruction could have destroyed the fleet on their own, were ignored. Of more serious consequences, the U.S. public saw the attack as a barbaric and treacherous act and rallied against the Empire of Japan.\nThe Japanese invasion of Thailand led to Thailand's decision to ally itself with Japan and the other Japanese attacks led the United States, United Kingdom, China, Australia, and several other states to formally declare war on Japan, whereas the Soviet Union, being heavily involved in large-scale hostilities with European Axis countries, maintained its neutrality agreement with Japan. Germany, followed by the other Axis states, declared war on the United States in solidarity with Japan, citing as justification the American attacks on German war vessels that had been ordered by Roosevelt.\nThe United States entered the European Theater and Pacific Theater in full force. Four days later, Adolf Hitler of Germany, and Benito Mussolini of Italy declared war on the United States, merging the separate conflicts. Following the attack on Pearl Harbor, the Japanese launched offensives against Allied forces in East and Southeast Asia, with simultaneous attacks on British Hong Kong, Thailand, British Malaya, Dutch East Indies, Guam, Wake Island, Gilbert Islands, Borneo and the Philippines.\nBy 1942, the Japanese Empire had launched offensives in Dutch East Indies, New Guinea, Singapore, Burma, Yunnan and India, the Solomons, Timor, Aleutian Islands, Christmas Island and the Andaman Islands.\nBy the time World War II was in full swing, Japan had the most interest in using biological warfare. Japan's Air Force dropped massive amounts of ceramic bombs filled with bubonic plague-infested fleas in Ningbo, China. These attacks would eventually lead to thousands of deaths years after the war would end. In Japan's relentless and indiscriminate research methods on biological warfare, they poisoned more than 1,000 Chinese village wells to study cholera and typhus outbreaks. These diseases are caused by bacteria that with today's technology could potentially be weaponized.\nFile:Central under air raidz.jpg|Battle of Hong Kong, 8 December 1941, Downtown British Hong Kong under Japanese air raid\nFile:A 1942 map of Canterbury, NZ, prepared by the Japanese Military.jpg|A map of Canterbury in New Zealand prepared by the Japanese Military following the attack on Pearl Harbor\nSouth-East Asia\n, Borneo on January 14, 1942.]]\n, February 1942. Victorious Japanese troops march through the city center (photo from Imperial War Museum).]]\nThe South-East Asian campaign was preceded by years of propaganda and espionage activities carried out in the region by the Japanese Empire. The Japanese espoused their vision of a Greater Asian Co-Prosperity Sphere, and an Asia for Asians to the people of Southeast Asia, who had lived under European rule for generations. As a result, many inhabitants in some of the colonies (particularly Indonesia) actually sided with the Japanese invaders for anti-colonial reasons. However, the ethnic Chinese, who had witnessed the effects of Japanese occupation in their homeland, did not side with the Japanese.\nHong Kong surrendered to the Japanese on December 25. In Malaya the Japanese overwhelmed an Allied army composed of British, Indian, Australian and Malay forces. The Japanese were quickly able to advance down the Malay Peninsula, forcing the Allied forces to retreat towards Singapore. The Allies lacked air cover and tanks; the Japanese had air supremacy. The sinking of HMS Prince of Wales and HMS Repulse on December 10, 1941, led to the east coast of Malaya being exposed to Japanese landings and the elimination of British naval power in the area. By the end of January 1942, the last Allied forces crossed the strait of Johore and into Singapore. In the Philippines, the Japanese pushed the combined Filipino-American force towards the Bataan Peninsula and later the island of Corregidor. By January 1942, General Douglas MacArthur and President Manuel L. Quezon were forced to flee in the face of Japanese advance. This marked one of the worst defeats suffered by the Americans, leaving over 70,000 American and Filipino prisoners of war in the custody of the Japanese.\nOn February 15, 1942, Singapore, due to the overwhelming superiority of Japanese forces and encirclement tactics, fell to the Japanese, causing the largest surrender of British-led military personnel in history. An estimated 80,000 Indian, Australian and British troops were taken as prisoners of war, joining 50,000 taken in the Japanese invasion of Malaya (modern day Malaysia). Many were later used as forced labour constructing the Burma Railway, the site of the infamous The Bridge on the River Kwai. Immediately following their invasion of British Malaya, the Japanese military carried out a purge of the Chinese population in Malaya and Singapore.\nThe Japanese then seized the key oil production zones of Borneo, Central Java, Malang, Cepu, Sumatra, and Dutch New Guinea of the late Dutch East Indies, defeating the Dutch forces. However, Allied sabotage had made it difficult for the Japanese to restore oil production to its pre-war peak. The Japanese then consolidated their lines of supply through capturing key islands of the Pacific, including Guadalcanal.\nTide turns (1942–1945)\n. The attack by dive bombers from  and  on the Japanese aircraft carriers Soryu, Akagi and Kaga in the morning of 4 June 1942.]]\nJapanese military strategists were keenly aware of the unfavorable discrepancy between the industrial potential of the Japanese Empire and that of the United States. Because of this they reasoned that Japanese success hinged on their ability to extend the strategic advantage gained at Pearl Harbor with additional rapid strategic victories. The Japanese Command reasoned that only decisive destruction of the United States' Pacific Fleet and conquest of its remote outposts would ensure that the Japanese Empire would not be overwhelmed by America's industrial might.\nIn April 1942, Japan was bombed for the first time in the Doolittle Raid. In May 1942, failure to decisively defeat the Allies at the Battle of the Coral Sea, in spite of Japanese numerical superiority, equated to a strategic defeat for Imperial Japan. This setback was followed in June 1942 by the catastrophic loss of four fleet carriers at the Battle of Midway, the first decisive defeat for the Imperial Japanese Navy. It proved to be the turning point of the war as the Navy lost its offensive strategic capability and never managed to reconstruct the critical mass' of both large numbers of carriers and well-trained air groups\".\nAustralian land forces defeated Japanese Marines in New Guinea at the Battle of Milne Bay in September 1942, which was the first land defeat suffered by the Japanese in the Pacific. Further victories by the Allies at Guadalcanal in September 1942, and New Guinea in 1943 put the Empire of Japan on the defensive for the remainder of the war, with Guadalcanal in particular sapping their already-limited oil supplies.\nDuring 1943 and 1944, Allied forces, backed by the industrial might and vast raw material resources of the United States, advanced steadily towards Japan. The Sixth United States Army, led by General Douglas MacArthur, landed on Leyte on October 20, 1944. In the subsequent months, during the Philippines Campaign (1944–45), the combined United States forces, together with the native guerrilla units, liberated the Philippines.\nBy 1944, the Allies had seized or bypassed and neutralized many of Japan's strategic bases through amphibious landings and bombardment. This, coupled with the losses inflicted by Allied submarines on Japanese shipping routes began to strangle Japan's economy and undermine its ability to supply its army.\nBy early 1945, the U.S. Marines had wrested control of the Ogasawara Islands in several hard-fought battles such as the Battle of Iwo Jima, marking the beginning of the fall of the islands of Japan.\nAir raids on Japan\non August 9, 1945]]\nAfter securing airfields in Saipan and Guam in the summer of 1944, the United States Army Air Forces undertook an intense strategic bombing campaign, using incendiary bombs, burning Japanese cities in an effort to pulverize Japan's industry and shatter its morale. The Operation Meetinghouse raid on Tokyo on the night of 9–10 March 1945, led to the deaths of approximately 100,000 civilians. Approximately 350,000–500,000 civilians died in 66 other Japanese cities as a result of the incendiary bombing campaign on Japan.\nConcurrent to these attacks, Japan's vital coastal shipping operations were severely hampered with extensive aerial mining by the U.S.'s Operation Starvation. Regardless, these efforts did not succeed in persuading the Japanese military to surrender.\nIn mid-August 1945, the United States dropped nuclear weapons on the Japanese cities of Hiroshima and Nagasaki. These atomic bombings were the first and only such weapons used against another nation in warfare. These two bombs killed approximately 120,000 to 140,000 people in a matter of minutes, and as many as a result of nuclear radiation in the following weeks, months and years. The bombs killed as many as 140,000 people in Hiroshima and 80,000 in Nagasaki by the end of 1945.\nRe-entry of the Soviet Union\nIn spite of Soviet–Japanese Neutrality Pact, at the Yalta agreement in February 1945, the U.S. President Franklin D. Roosevelt, the U.K. Prime Minister Winston Churchill, and the U.S.S.R. Premier Joseph Stalin had agreed that the USSR would enter the war on Japan within three months of the defeat of Germany in Europe. This Soviet–Japanese War led to the fall of Japan's Manchurian occupation, Soviet occupation of South Sakhalin island, and a real, imminent threat of Soviet invasion of the home islands of Japan. This was a significant factor for some internal parties in the Japanese decision to surrender to the US and gain some protection, rather than face simultaneous Soviet invasion as well as defeat by the US. Likewise, the superior numbers of the armies of the Soviet Union in Europe was a factor in the US decision to demonstrate the use of atomic weapons to the USSR, just as the Allied victory in Europe was evolving into division of Germany and Berlin, the division of Europe with the Iron Curtain and the subsequent Cold War.\nSurrender and occupation of Japan (1945–1952)\non 1 November 1945, the end of the Second World War. In the foreground there are several Allied soldiers watching the proceedings from the back of the balcony.]]\nHaving ignored (mokusatsu) the Potsdam Declaration under government of Prime Minister Kantarō Suzuki, the Empire of Japan surrendered and ended World War II, after the atomic bombings of Hiroshima and Nagasaki and the declaration of war by the Soviet Union. In a national radio address on August 15, Emperor Hirohito announced the surrender to the Japanese people. The Allies occupied Japan after the war, largely spearheaded by United States General of the Army Douglas MacArthur to revise the Japanese constitution and de-militarize Japan. The Allied occupation, with economic and political assistance, continued well into the 1950s. American lawyers working for the occupation wrote the current Constitution of Japan to replace the Meiji Constitution, providing for, among other things, a parliament-centric political system, a purely symbolic role for the Emperor, renunciation of war, and renaming the Empire of Japan to Japan. The new constitution came into effect on 3 May 1947, and has not been revised since, though proposals have been made, particularly for the revision of Article 9 of the Constitution of Japan, which renounces \"war as a sovereign right of the nation\" and the maintenance of armed forces with \"war potential\".\nDouglas MacArthur later commended the new Japanese government that he helped establish and the new Japanese period when he was about to send the American forces to the Korean War:\nThe Japanese people, since the war, have undergone the greatest reformation recorded in modern history. With a commendable will, eagerness to learn, and marked capacity to understand, they have, from the ashes left in war's wake, erected in Japan an edifice dedicated to the supremacy of individual liberty and personal dignity; and in the ensuing process there has been created a truly representative government committed to the advance of political morality, freedom of economic enterprise, and social justice. Politically, economically, and socially Japan is now abreast of many free nations of the earth and will not again fail the universal trust. ... I sent all four of our occupation divisions to the Korean battlefront without the slightest qualms as to the effect of the resulting power vacuum upon Japan. The results fully justified my faith. I know of no nation more serene, orderly, and industrious, nor in which higher hopes can be entertained for future constructive service in the advance of the human race.\nFor historian John W. Dower:\nIn retrospect, apart from the military officer corps, the purge of alleged militarists and ultranationalists that was conducted under the Occupation had relatively small impact on the long-term composition of men of influence in the public and private sectors. The purge initially brought new blood into the political parties, but this was offset by the return of huge numbers of formerly purged conservative politicians to national as well as local politics in the early 1950s. In the bureaucracy, the purge was negligible from the outset. ... In the economic sector, the purge similarly was only mildly disruptive, affecting less than sixteen hundred individuals spread among some four hundred companies. Everywhere one looks, the corridors of power in postwar Japan are crowded with men whose talents had already been recognized during the war years, and who found the same talents highly prized in the 'new' Japan.\nThe Allied-occupation ended with the entry into force of the Treaty of San Francisco on 28 April 1952. After the occupation, the U.S. military continued to station in Japan based on the U.S.-Japan Security Treaty. The Japan Self-Defense Forces (JSDF) were established on 1 July 1954 as de facto remilitarization of postwar Japan.\nPost-war\nRepatriation of Japanese from overseas\nin Tawau, British North Borneo prior to their embarkation to Jesselton (Kota Kinabalu) after the surrender to Australian forces]]\nThere was a significant level of emigration to the overseas territories of the Japanese Empire during the Japanese colonial period, including Korea, Taiwan, Manchuria, and Karafuto. Unlike emigrants to the Americas, Japanese going to the colonies occupied a higher rather than lower social niche upon their arrival.\nIn 1938, there were 309,000 Japanese in Taiwan. By the end of World War II, there were over 850,000 Japanese in Korea and more than 2 million in China, most of whom were farmers in Manchukuo (the Japanese had a plan to bring in 5 million Japanese settlers into\nManchukuo).\nIn the census of December 1939, the total population of the South Seas Mandate was 129,104, of which 77,257 were Japanese. By December 1941, Saipan had a population of more than 30,000 people, including 25,000 Japanese. There were over 400,000 people living on Karafuto (southern Sakhalin) when the Soviet offensive began in early August 1945. Most were of Japanese or Korean extraction. When Japan lost the Kuril Islands, 17,000 Japanese were expelled, most from the southern islands.\nAfter World War II, most of these overseas Japanese repatriated to Japan. The Allied powers repatriated over six million Japanese nationals from colonies throughout Asia. On the other hand, some remained overseas involuntarily, as in the case of orphans in China or prisoners of war captured by the Red Army and forced to work in Siberia.\nWar crimes\nMany political and military Japanese leaders were convicted for war crimes before the Tokyo tribunal and other Allied tribunals in Asia. However, all members of the imperial family implicated in the war, such as Emperor Shōwa, were excluded from criminal prosecutions by Douglas MacArthur. The Japanese military before and during World War II committed numerous atrocities against civilian and military personnel. Its surprise attack on Pearl Harbor on December 7, 1941, prior to a declaration of war and without warning killed 2,403 neutral military personnel and civilians and wounded 1,247 others. Large scale massacres, rapes, and looting against civilians were committed, most notably the Sook Ching and the Nanjing Massacre, and the use of around 200,000 \"comfort women\", who were forced to serve as prostitutes for the Japanese military.\nThe Imperial Japanese Army also engaged in the execution and harsh treatment of Allied military personnel and POWs. Biological experiments were conducted by Unit 731 on prisoners of war as well as civilians; this included the use of biological and chemical weapons authorized by Emperor Shōwa himself. According to the 2002 International Symposium on the Crimes of Bacteriological Warfare, the number of people killed in Far East Asia by Japanese germ warfare and human experiments was estimated to be around 580,000. The members of Unit 731, including Lieutenant General Shirō Ishii, received immunity from General MacArthur in exchange for germ warfare data based on human experimentation. The deal was concluded in 1948. The Imperial Japanese Army frequently used chemical weapons. Because of fear of retaliation, however, those weapons were never used against Westerners, but against other Asians judged \"inferior\" by imperial propaganda. For example, the Emperor authorized the use of toxic gas on 375 separate occasions during the Battle of Wuhan from August to October 1938.\nSee also\n* Atomic bombings of Hiroshima and Nagasaki\n* Greater East Asia Co-Prosperity Sphere\n* Imperial Japanese Army during the Pacific War\n* Imperial Japanese Navy in World War II\n* Japanese colonial empire\n* List of territories acquired by the Empire of Japan\n* Proposed Japanese invasion of Australia during World War II\nReferences\nCitations\nGeneral and cited sources\n*\n*\n*\n*\n*\n*\n*\n*\n*  Comprehensive overview with emphasis on diplomacy\n*\n*\nFurther reading\n* Cockburn, Andrew, \"Big Six v. Little Boy\" (review of Evan Thomas, Road to Surrender: Three Men and the Countdown to the End of World War Two, Elliot & Thompson, 2023, 296 pp., ), London Review of Books, vol. 45, no. 22 (16 November 2023), pp. 9–12. In 1947 Henry Stimson, in an article written for him by McGeorge Bundy, argued that there had been no alternative to the atom-bombing of Hiroshima and Nagasaki, as an invasion of Japan might have \"cost over a million casualties to... American forces\". However, in 1946 the US Strategic Bombing Survey had concluded that – thanks to the destruction of its economy by conventional bombing and a comprehensive blockade – \"in all probability prior to 1 November 1945, Japan would have surrendered even if the atomic bombs had not been dropped.\" (p. 9.) General Curtis LeMay's B-29s had already laid waste to over 60 Japanese cities. (pp. 9-10.) Writes Cockburn: \"[But t]he folklore endures. Among the exhibits at the US Air Force's... museum in Dayton, Ohio, is Bockscar, the B-29 that dropped the Nagasaki bomb. It is proudly identified as 'the aircraft that ended World War Two'.\" (p. 12.)"
    }
  ]
}