{
  "content": [
    {
      "type": "text",
      "text": "# Japanese battleship Aki\n\n{|\n|Ship name=Aki\n|Ship namesake=Aki Province\n|Ship ordered=1904\n|Ship builder=Kure Naval Arsenal, Japan\n|Ship laid down=15 March 1906\n|Ship launched=14 April 1907\n|Ship commissioned=11 March 1911\n|Ship decommissioned=\n|Ship in service=\n|Ship out of service=\n|Ship struck=1923\n|Ship fate=Sunk as target, 2 September 1924\n|Ship notes=\n}}\nsemi-dreadnought battleship\n|Ship displacement=\n|Ship length=\n|Ship beam=\n|Ship draft=\n|Ship power=*15 Miyabara water-tube boilers\n*\n|Ship propulsion=2 shafts, 2 steam turbine sets\n|Ship speed=\n|Ship range= at\n|Ship complement=931\n|Ship armament=* 2 × twin  guns\n* 6 × twin  guns\n* 8 × single  guns\n* 12 × single 12 pdr () guns\n* 5 ×  torpedo tubes\n|Ship armor=*Waterline belt:\n*Deck:\n*Gun turrets:\n*Conning tower:\n*Casemates:\n|Ship notes=\n}}\n|}\nwas one of two  semi-dreadnought battleship built for the Imperial Japanese Navy (IJN) during the first decade of the 20th century. She was the second battleship built domestically in Japan and the first to use steam turbines for propulsion. The ship was named for Aki Province, now a part of Hiroshima Prefecture. The ship saw no combat during World War I. Aki was disarmed in 1922 and sunk as a target in 1924 in accordance with the terms of the Washington Naval Treaty of 1922.\nBackground\nThe Satsuma class was ordered in late 1904 under the 1904 War Naval Supplementary Program during the Russo-Japanese War. Unlike the previous  pre-dreadnought battleships, they were the first battleships ordered from Japanese shipyards. They were originally designed with a dozen  guns, but had to be redesigned because of a shortage of guns in Japan and to reduce costs.\nDesign and description\nThe ship had an overall length of , a beam of , and a normal draft of . She displaced  at normal load. The crew consisted of 931 officers and enlisted men.\nAki was fitted with a pair of Curtiss steam turbine sets, each driving one shaft using steam from 15 Miyabara water-tube boilers. The turbines were rated at a total of  for a design speed of . The ship reached a top speed of  during her sea trials from . She carried enough coal and oil to give her a range of  at a speed of . Unlike her half-sister, she had three funnels.\nThe ship's main battery consisted of four 45-caliber 12-inch (305&nbsp;mm) 41st Year Type guns in two twin-gun turrets, one each fore and aft of the superstructure. Her intermediate armament consisted of six twin-gun turrets equipped with 45-caliber Type 41 10-inch (254&nbsp;mm) guns, three turrets on each side of the superstructure. Her heavy intermediate armament of guns larger than  is why the ship is considered to be a semi-dreadnought.\nAkis secondary armament consisted of eight 45-caliber 6-inch (152&nbsp;mm) 41st Year Type guns, mounted in casemates in the sides of the hull. The ship was also equipped with eight quick-firing (QF) 40-caliber 12-pounder () 12-cwt guns and four 28-caliber 12-pounder QF guns. In addition, the battleship was fitted with five submerged  torpedo tubes, two on each broadside and one in the stern.\nThe waterline main belt of the Satsuma-class vessels consisted of Krupp cemented armor that had a maximum thickness of nine inches amidships. It tapered to a thickness of  at the ends of the ship. A six-inch strake of armor protected the casemates. The barbettes for the main guns were  thick. The armor of Akis main gun turrets had a maximum thickness of . The deck armor was  thick and the conning tower was protected by six inches of armor.\nConstruction and service\nAki was laid down at Kure Naval Arsenal on 15 March 1906. She was launched on 15 April 1907, but construction was suspended for about five months after the decision was made on 26 November to install steam turbines on Aki and the armored cruiser . Akis turbines were already behind schedule and the suspension allowed the less valuable ship to be completed first, and changes made to its turbines after testing were also incorporated into Akis turbines. Aki was finally completed on 11 March 1911 and her first captain was Tatsuo Matsumura.\nWhen World War I began in August 1914, Aki was refitting at Kure Naval Arsenal. She was assigned to the 1st Battleship Squadron upon the completion of her refit and remained with it until she was transferred to the 2nd Battleship Squadron in 1918, seeing no combat during the war. From December 1915 to December 1916, she was commanded by Captain Kiyokazu Abo. The ship was disarmed at Yokosuka in 1922 to comply with the provisions of the Washington Naval Treaty, stricken from the navy list during 1923 and converted into a target ship. Her guns were turned over to the Imperial Japanese Army for use as coastal artillery. The rest of her guns were placed in reserve and ultimately scrapped in 1943. Two of her 10-inch gun turrets were installed as coastal artillery batteries on Jōgashima island to protect Tokyo Bay. Aki was sunk by the battlecruiser  and the battleship  on 2 September 1924 in Tokyo Bay.\nNotes\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links"
    }
  ]
}