{
  "content": [
    {
      "type": "text",
      "text": "# Japanese official war artists\n\nKita Renzo, 1942]]\nJapanese official war artists were commissioned to create artwork in the context of a specific war.  The artists were creating ,  (\"war campaign documentary painting\") for the government of Japan.\nOfficial war artists have been appointed by governments for information or propaganda purposes and to record events on the battlefield; but there are many other types of artists depicting the subject or events of war.\nBetween 1937 and 1945, Japan’s military leaders commissioned official war artists to create images of the Second Sino-Japanese War and the Pacific War.  Approximately 200 pictures depicting Japan’s military campaigns were created.  These pictures were presented at large-scale exhibitions during the war years.\nSecond Sino-Japanese War\nThe Japanese military supported artists during this conflict.  For example, Tsuguharu Foujita was sent to China as an official war artist by the Imperial Japanese Naval Information office.  In 1938, he traveled to the battlefield front in central China.\n*Tsuguharu Foujita, 1886–1968.\nPacific War\nThe Japanese government and military supported an extensive war art program involving hundreds of artists; however, little is known about it. In part, this is because the U.S. government confiscated the extant artwork.  Many of the records have not been examined for scholarly review.\n*Tsuguharu Foujita, 1886-1968.\n* Tsuruta Gorō, 1890–1969.\n* Ryushi Kawabata, 1855–1966.\n* Ryohei Koiso, 1903–1988.\n* Shin Kurihara, 1894–1966.\n* Saburo Miyamoto, 1905–1974.\n* Kenichi Nakamura, 1895–1967.\n* Kita Renzo, 1876–1949.\n* Konosuke Tamura, 1903–1986.\n* Kenji Yoshioka, 1906–1990.\nSee also\n* War artists\n* Military art\n* War photography\nNotes\nReferences\n* McCloskey, Barbara. (2005).  Artists of World War II. Westport: Greenwood Press. ;\n* Nara, Hiroshi. (2007). ''Inexorable Modernity: Japan's Grappling with Modernity in the Arts.Lanham, Maryland: Lexington Books. ;\n* Tsuruya, Mayu. (2005).  [http://etd.library.pitt.edu/ETD/available/etd-08192005-082911/unrestricted/tsuruya_etd2005rev.pdf  Sensô Sakusen Kirokuga (\"War Campaign Documentary Painting\"): Japan's National Imagery of the 'Holy War', 1937–1945.''] Ph.D. dissertation, University of Pittsburgh."
    }
  ]
}