{
  "content": [
    {
      "type": "text",
      "text": "# Japan Game Awards\n\nThe Japan Game Awards are an awards ceremony held by the Computer Entertainment Supplier's Association (CESA) to recognize outstanding video games released in Japan throughout the previous year. The ceremony is held in Japan, typically during the month of September, to coincide with the Tokyo Game Show convention.\nFirst announced in 1996 as the \"CESA Awards\", the first edition of the event was held on April 4, 1997. Starting from the fourth edition, held in 2000, the name was changed to \"Japan Game Awards\", only to be retitled \"CESA GAME AWARDS\" for its sixth edition in 2002, finally settling on its current title of \"Japan Game Awards\" starting from the tenth edition, held in 2006.\nWhile it represents the Japanese video game industry, the awards are not limited to Japanese video games, but may also include video games developed by international teams or individuals.\nAward Divisions\nGames of the Year\nThe \"Games of the Year Division\" awards games that have been released during the qualifying period for game consoles, PC or mobile devices. Selection of winning titles is performed by a selection committee, with public voting and sales figures also taken into account. Multiple categories are awarded, with the highest distinction being the \"Grand Prize\", equivalent to the \"Game of the Year\" award in other ceremonies and trade publications. While in most categories only one title is awarded, the \"Award for Excellence\" category includes multiple winners, and the \"Grand Prize\" has gone to more than one title on multiple occasions. In the 2010 edition, a \"Game Designers Award\" was introduced, proposed by renowned game developer Masahiro Sakurai after reflecting on the fact that other categories favored games with large sales numbers rather than reflecting the perspective of game creators.\nFuture Division\nThis category was established at the 2001 edition of the event. It awards games that have yet to be released, and that are announced or exhibited during the Tokyo Game Show held during the eligible period, based on a public vote held by attendees, in virtue of the games' promise and the voters' anticipation for their release. Games that are not exhibited at Tokyo Game Show are not eligible for selection.\nMinister of Economy, Trade and Industry Award (METI Award)\nEstablished at the 2008 edition of the Japan Game Awards, this award is given to both video games and people who significantly contribute to the development of the Japanese video game industry \"through creation of excellent products\" or those who \"expanded the scope of the videogame industry using a new expression or technology\". The first recipient of this award was Shigeru Miyamoto.\nDiscontinued divisions\nThe following divisions were introduced throughout the history of the Japan Game Awards, but are no longer awarded.\nAmateur Division\nEstablished in the 2007 edition by merging the pre-existing \"CESA Student Game Awards\" and \"Game Awards Indies\", this division awarded original works that had not been commercially marketed regardless of whether the entrant is a company, a group of people or a single individual. Participants must reside in Japan to be eligible. This division consisted of three categories, awarded by a selection committee: \"Grand Award\" (for one outstanding title), \"Awards for Excellence\" (for multiple titles), and \"Honorable Mentions\". Starting with the 2024 edition, this category is no longer awarded at the Japan Game Awards, and was instead transferred to the \"Kamigame Creator Evolution\" contest sponsored by NHK Enterprises, along with the \"U18 Division\" contest.\nU18 Division\nThis division, established in the 2018 edition, consisted on a contest for game creators under the age of 18. According to the official website of the division, its aim was \"discovering the next generation of game creators\". Participants could be individuals or teams. Starting with the 2024 edition, this category is no longer awarded at the Japan Game Awards, and was instead transferred to the \"Kamigame Creator Evolution\" contest sponsored by NHK Enterprises, along with the \"Amateur Division\" awards.\nHistory\nThe ceremony was first carried out under the name \"CESA Awards\" (CESA大賞, CESA taishō) in 1996, and was renamed to \"Japan Game Awards\" (日本ゲーム大賞, Nihon gēmu taishō) in 1999 for its fourth edition. Starting from the 2003 edition, games considered for awards are usually those released during the previous Japanese fiscal year, between April 1 of the previous year and March 31 of the current year, although earlier editions of the award encompassed the previous calendar year.\nCESA Awards '96 (1997)\nHeld on April 4, 1997. Games eligible were those released during the previous calendar year, between January 1, 1996 and December 31, 1996. The following categories were awarded:\n*'Best Work (作品賞, Sakuhin-shō)  Sakura Wars (Sega Enterprises; Sega Saturn)'\n*Department-specific awards (部門別賞, Bumon-betsu-shō)\n**Best Direction (監督賞, Kantoku-shō)  Sakura Wars (Sega Enterprises; Sega Saturn)\n**Programming (プログラミング, Puroguramingu)  NiGHTS into Dreams (Sega Enterprises; Sega Saturn)\n**Graphics (グラフィック, Gurafikku)  NiGHTS into Dreams (Sega Enterprises; Sega Saturn)\n**Scenario (シナリオ, Shinario)  Resident Evil (Capcom; PlayStation)\n**Sound (サウンド, Saundo)  PaRappa the Rapper (Sony Computer Entertainment; PlayStation)\n**Main Characters (メインキャラクター, Meinkyarakutā)  Sakura Wars (Sega Enterprises; Sega Saturn)\n**Sub-Characters (サブキャラクター, Sabukyarakutā)  Sakura Wars (Sega Enterprises; Sega Saturn)\n*Special Award (特別賞, Tokubetsu-shō)\n**New Concept (ニューコンセプト, Nyūkonseputo)  PaRappa the Rapper (Sony Computer Entertainment; PlayStation)\n**Standard (スタンダード, Sutandādo)  Dragon Quest III (Super Nintendo remake) (Enix; Super Nintendo)\n*Game Genre Awards (ゲームジャンル別賞, Gēmujanru-betsu-shō)\n**Action (アクション, Akushon)  Super Mario 64 (Nintendo; Nintendo 64)\n**Sports (スポーツ, Supōtsu)  DecAthlete (Sega Enterprises; Sega Saturn)\n**Fighting (格闘, Kakutō)  Tekken 2 (Namco; PlayStation)\n**RPG  Dragon Quest III (Super Nintendo remake) (Enix; Super Nintendo)\n**Simulation (シミュレーション, Shimyurēshon)  ''Derby Stallion '96 (ASCII Corporation; Super Nintendo)\n**Puzzle (パズル, Pazuru)  Puyo Puyo 2 Definitive Edition (Compile; PlayStation)\n**Adventure (アドベンチャー, Adobenchā)  Resident Evil (Capcom; PlayStation)\n**Driving / Racing (ドライビング・レース, Doraibingu·rēsu)  Mario Kart 64 (Nintendo; Nintendo 64)\n**Shooting (シューティング, Shūtingu)  Virtua Cop 2 (Sega Enterprises; Sega Saturn)\n**Table (テーブル, Tēburu)  Momotaru Densetsu HAPPY (Hudson; Super Nintendo)\n**Education (エデュケーション, Ede~yukēshon)  Lifescape: A 4 Billion Year Journey (Media Quest; PlayStation)\n**Variety (バラエティ, Baraeti)  Namco Museum'' Series (Namco; PlayStation)\nCESA Awards '97 (1998)\nHeld on April 3, 1998 at Velfarre. Games eligible were those released during the previous calendar year, between January 1, 1997 and December 31, 1997. The following categories were awarded:\n* 'Grand Prize (大賞, Taishō)  Final Fantasy VII (Square; PlayStation)'\n* Award for Excellence (優秀賞, Yūshū-shō)\n** I.Q.: Intelligent Qube (Sony Computer Entertainment; PlayStation)\n** Gran Turismo (Sony Computer Entertainment; PlayStation)\n** GRANDIA (Game Arts; PlayStation)\n** Densha de Go! (Taito; PlayStation)\n** ''Yoshi's Story (Nintendo; Nintendo 64)\n* Category Awards (部門賞, Bumon-shō)\n** Programming (プログラミング, Puroguramingu)  Gran Turismo (Sony Computer Entertainment; PlayStation)\n** Scenario (シナリオ, Shinario)  Final Fantasy VII (Square; PlayStation)\n** Graphics (グラフィック, Gurafikku)  Gran Turismo (Sony Computer Entertainment; PlayStation)\n** Sound (サウンド, Saundo)  Final Fantasy VII (Square; PlayStation)\n** Characters (キャラクター, Kyarakutā)  Klonoa: Door to Phantomile (Namco; PlayStation)\n* Special Jury Award (審査員特別賞, Shinsa-in tokubetsu-shō)\n** Ultima Online (Electronic Arts, Square; Windows)\n** Derby Stallion (ASCII Corporation; PlayStation)\n** Monster Rancher (Tecmo; PlayStation)\nThe 3rd CESA Awards (1999)\nHeld on April 2, 1999 at Velfarre. Games eligible were those released during the previous calendar year, between January 1, 1998 and December 31, 1998. A total of 130,186 votes were received for different categories. The following categories were awarded:\n*'Grand Prize (大賞, Taishō)  The Legend of Zelda: Ocarina of Time (Nintendo; Nintendo 64)'\n* Award for Excellence (優秀賞, Yūshū-shō)\n** R4: Ridge Racer Type 4 (Namco; PlayStation)\n** Resident Evil 2 (Capcom; PlayStation)\n** Beatmania (Konami; PlayStation)\n** Hey You, Pikachu! (Nintendo; Nintendo 64)\n** Metal Gear Solid (Konami; PlayStation)\n* Category Awards (部門賞, Bumon-shō)\n** Scenario (シナリオ, Shinario)  Machi (Chunsoft; Sega Saturn)\n** Programming (プログラミング, Puroguramingu)  The Legend of Zelda: Ocarina of Time (Nintendo; Nintendo 64)\n** Graphics (グラフィック, Gurafikku)  R4: Ridge Racer Type 4 (Namco; PlayStation)\n** Characters (キャラクター, Kyarakutā)  Hey You, Pikachu! (Nintendo; Nintendo 64)\n** Sound (サウンド, Saundo)  Beatmania (Konami; PlayStation)\n* Special Jury Award (審査員特別賞, Shinsa-in tokubetsu-shō)\n** Crash Bandicoot 3: Warped (Sony Computer Entertainment; PlayStation)\n** Sonic Adventure (Sega Enterprises; Dreamcast)\n** Dragon Warrior Monsters (Enix; Game Boy)\nThe 4th Japan Game Awards (2000)\nHeld on March 30, 2000 at the Tokyo International Forum in Yurakucho, Tokyo. Games eligible were those released during the previous calendar year, between January 1, 1999 and December 31, 1999. The following categories were awarded:\n*'Grand Prize (大賞, Taishō)  Doko Demo Issyo (Sony Computer Entertainment; PlayStation)'\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Doko Demo Issyo (Sony Computer Entertainment; PlayStation)\n** Seaman (Sega Enterprises/Vivarium; Dreamcast)\n** Dance Dance Revolution (Konami; PlayStation)\n** Final Fantasy VIII (Square; PlayStation)\n** Pokémon Gold and Silver (Nintendo; Game Boy)\n* Category Awards (部門賞, Bumon-shō)\n** Game Design (ゲームデザイン, Gēmudezain)  Doko Demo Issyo (Sony Computer Entertainment; PlayStation)\n** Programming (プログラミング, Puroguramingu)  Soul Calibur (Namco; Dreamcast)\n** Graphics (グラフィック, Gurafikku)  Legend of Mana (Square; PlayStation)\n** Movie (ムービー, Mūbī)  Final Fantasy VIII (Square; PlayStation)\n** Character (キャラクター, Kyarakutā)  \"Toro\" from Doko Demo Issyo (Sony Computer Entertainment; PlayStation)\n** Scenario (シナリオ, Shinario)  Valkyrie Profile (Enix; PlayStation)\n** Sound (サウンド, Saundo)  Dance Dance Revolution (Konami; PlayStation)\n* New Wave Award (ニューウェイブ賞, Nyūu~eibu-shō)\n** Best New Wave Award (最優秀ニューウェイブ賞, Saiyūshū nyūu~eibu-shō)  Seaman (Sega Enterprises/Vivarium; Dreamcast)\n** Doko Demo Issyo (Sony Computer Entertainment; PlayStation)\n** Dance Dance Revolution (Konami; PlayStation)\n* Special Award (特別賞, Tokubetsu-shō)\n** Overseas Work (海外作品, Kaigai sakuhin)  Age of Empires II: Age of Kings (Microsoft; Windows)\n** Best Gamer (ベストゲーマー, Besutogēmā)\n*** Hikaru Ijūin\n*** Reika Nakajima\nThe 5th Japan Game Awards (2001)\nHeld on March 29, 2001 at the Tokyo International Forum in Yurakucho, Tokyo. Games eligible were those released during the previous calendar year, between January 1, 2000 and December 31, 2000. Unlike previous years, nominees were announced as wel as the winners. The following categories were awarded:\n*'Grand Prize (大賞, Taishō)  Phantasy Star Online (Sega; Dreamcast)'\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Gunparade March (Sony Computer Entertainment; PlayStation)\n** The Legend of Zelda: Majora's Mask (Nintendo; Nintendo 64)\n** Dragon Quest VII (Enix; PlayStation)\n** Final Fantasy IX (Square; PlayStation)\n** Phantasy Star Online (Sega; Dreamcast)\n* Category Awards (部門賞, Bumon-shō)\n** Outstanding Game Design Award (ゲームデザイン賞, Gēmudezain-shō)  Phantasy Star Online (Sega; Dreamcast)\n*** Other nominees:\n**** The Legend of Zelda: Majora's Mask (Nintendo; Nintendo 64)\n**** Dragon Quest VII (Enix; PlayStation)\n**** Shiren the Wanderer 2: Shiren's Castle and the Oni Invasion (Nintendo; Nintendo 64)\n**** Mr. Driller (Namco; PlayStation, Dreamcast, Game Boy Color)\n** Programming Award (プログラミング賞, Puroguramingu-shō)  Phantasy Star Online (Sega; Dreamcast)\n*** Other nominees:\n**** Dynasty Warriors 2 (Koei; PlayStation 2)\n**** Dead or Alive 2 (Tecmo; Dreamcast, PlayStation 2)\n**** Dragon Quest VII (Enix; PlayStation)\n**** Ridge Racer V (Namco; PlayStation 2)\n** Graphics Award (グラフィック賞, Gurafikku-shō)  Final Fantasy IX (Square; PlayStation)\n*** Other nominees:\n**** Gekikuukan Pro Baseball: The End of the Century 1999 (Square; PlayStation 2)\n**** Jet Set Radio (Sega; Dreamcast)\n**** The Bouncer (Square; PlayStation 2)\n**** Vagrant Story (Square; PlayStation)\n** Sound Award (サウンド賞, Saundo-shō)  Final Fantasy IX (Square; PlayStation)\n*** Other nominees:\n**** Crazy Taxi (Sega; Dreamcast)\n**** Samba de Amigo (Sega; Dreamcast)\n**** Dragon Quest VII (Enix; PlayStation)\n**** Ridge Racer V (Namco; PlayStation 2)\n** Character (キャラクター賞, Kyarakutā-shō)  \"Susumu Hori\" from Mr. Driller (Namco; PlayStation, Dreamcast, Game Boy Color)\n*** Other nominees:\n**** \"Kirby\" from Kirby 64: The Crystal Shards (Nintendo; Nintendo 64)\n**** \"Koneko Toro\" from Koneko mo Issyo (Sony Computer Entertainment; PlayStation)\n**** \"Pikachu\" from Pokémon Crystal (Nintendo; Game Boy Color)\n**** \"Vivi\" from Final Fantasy IX (Square; PlayStation)\n** Scenario (シナリオ賞, Shinario-shō)  Dragon Quest VII (Enix; PlayStation)\n*** Other nominees:\n**** The Legend of Zelda: Majora's Mask (Nintendo; Nintendo 64)\n**** Tales of Eternia (Namco; PlayStation)\n**** Final Fantasy IX (Square; PlayStation)\n**** Vagrant Story (Square; PlayStation)\n** Package Design (パッケージデザイン賞, Pakkējidezain-shō)  Boku no Natsuyasumi (Sony Computer Entertainment; PlayStation)\n*** Other nominees:\n**** Seven: Cavalry Troop of Molmorth (Namco; PlayStation 2)\n**** Jet Set Radio (Sega; Dreamcast)\n**** Final Fantasy IX (Square; PlayStation)\n**** Mr. Driller (Namco; PlayStation, Dreamcast, Game Boy Color)\n* New Wave Award (ニューウェイブ賞, Nyūu~eibu-shō)\n** Best New Wave Award (最優秀ニューウェイブ賞, Saiyūshū nyūu~eibu-shō)  Phantasy Star Online (Sega; Dreamcast)\n** Kirby Tilt 'n' Tumble (Nintendo; Game Boy Color)\n** Boku no Natsuyasumi (Sony Computer Entertainment; PlayStation)\n* Best Overseas Work (海外作品賞, Kaigai sakuhin-shō)  Diablo II (Blizzard Entertainment; PC)\n** Other nominees:\n*** Age of Empires II: The Conquerors Expansion (Microsoft; PC)\n*** Tomb Raider: The Last Revelation (Eidos Interactive / Core Design; PlayStation, Dreamcast)\n* Best Creator Award (ベストクリエイター賞, Besutokurieitā-shō)  Yuji Horii\n* Special Award (特別賞, Tokubetsu-shō)\n** Best Gamer Award (ベストゲーマー賞, Besutogēmā-shō)\n*** Gamon Kaai\n*** Ami Shibata\n** Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Dragon Quest VII (Enix; PlayStation)\n** Popular Award (大衆賞, Taishū-shō)  Dragon Quest VII (Enix; PlayStation)\nThe 6th CESA Game Awards (2002)\nHeld on October 28, 2002 at the Hotel Okura Tokyo. Games eligible were those released between January 1, 2001 and March 31, 2002. The following categories were awarded:\nGame Awards 2001 - 2002\n*'Grand Prize (大賞, Taishō)  Final Fantasy X (Square; PlayStation 2)'\n*Award for Excellence (優秀賞, Yūshū-shō)\n**Onimusha 2 (Capcom; PlayStation 2)\n**Kingdom Hears (Square; PlayStation 2)\n**Dynasty Warriors 3 (Koei; PlayStation 2)\n**Animal Crossing+ (Nintendo; GameCube)\n**Pikmin (Nintendo; GameCube)\n**Metal Gear Solid 2: Sons of Liberty (Konami; PlayStation 2)\n*Special Award (特別賞, Tokubetsu-shō)\n**Ico (Sony Computer Entertainment; PlayStation 2)\n**Phoenix Wright: Ace Attorney (Capcom; Game Boy Advance)\n**Lineage (NC Japan; PC)\nGame Awards Future\n*Award for Excellence (優秀賞, Yūshū-shō)\n**Zone of the Enders: The 2nd Runner (Konami; PlayStation 2)\n**Unlimited Saga (Square; PlayStation 2)\n**SD Gundam G Generation NEO (Bandai; PlayStation 2)\n**Sakura Wars: In Hot Blood (Sega; PlayStation 2)\n**Star Ocean: Till the End of Time (Enix; PlayStation 2)\n**Taiko no Tatsujin: Tatakon de Dodon ga Don (Namco; PlayStation 2)\n**Tales of Destiny 2 (Namco; PlayStation 2)\n**Dead or Alive Xtreme Beach Volleyball (Tecmo; Xbox)\n**Devil May Cry 2 (Capcom; PlayStation 2)\n**Resident Evil Zero (Capcom; GameCube)\n**Final Fantasy Tactics Advance (Square; Game Boy Advance)\n**Phantasy Star Online Episodes 1 & 2 (Sega; Xbox)\n**Metal Gear Solid 2: Substance (Konami; PlayStation 2)\n**Momotarō Dentetsu 11: Black Bombee Shutsugen! No Maki (Hudson; PlayStation 2)\n**Mega Man Battle Network 3 (Capcom; Game Boy Advance)\nThe 7th CESA Game Awards (2003)\nHeld on October 30, 2003 at the ANA Hotel Tokyo in Minato, Tokyo. Games eligible were those released in the Japanese fiscal year 2003 (between April 1, 2002 and March 31, 2003). The following categories were awarded:\nGame Awards 2002 - 2003\n*'Grand Prize (大賞, Taishō)  Taiko no Tatsujin: Tatakon de Dodon ga Don (Namco; PlayStation 2), and Final Fantasy XI (Square; PlayStation 2, PC)' (shared award)\n*Award for Excellence (優秀賞, Yūshū-shō)\n**Dynasty Warriors 4 (Koei; PlayStation 2, Xbox)\n**The Legend of Zelda: Wind Waker (Nintendo; GameCube)\n**Steel Battalion (Capcom; Xbox)\n**.hack// series (Bandai; PlayStation 2)\n**Final Fantasy X-2 (Square Enix; PlayStation 2)\n**Halo: Combat Evolved (Microsoft; Xbox)\n**Pokémon Ruby and Sapphire (The Pokémon Company; Game Boy Advance)\n**WarioWare, Inc.: Mega Microgames! (Nintendo; Game Boy Advance)\n**Pro Evolution Soccer 2 (Konami; PlayStation 2)\n*Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Pokémon Ruby and Sapphire (The Pokémon Company; Game Boy Advance)\n*Global Award (グローバル賞, Gurōbaru-shō)\n**Japanese Works (日本作品, Nihon sakuhin)  Kingdom Hearts (Square Enix; PlayStation 2)\n**Overseas Works (海外作品, Kaigai sakuhin)  Grand Theft Auto: Vice City (Rockstar Games; PlayStation 2)\n*Special Award (特別賞, Tokubetsu-shō)  Zone of the Enders: The 2nd Runner (Konami; PlayStation 2)\nGame Awards Future\n*Award for Excellence (優秀賞, Yūshū-shō)\n**EyeToy: Play (Sony Computer Entertainment; PlayStation 2)\n**Onimusha 3: Demon Siege (Capcom; PlayStation 2)\n**Katamari Damacy (Namco; PlayStation 2)\n**Mobile Suit Gundam Z: AEUG vs. Titans (Bandai; PlayStation 2)\n**Phoenix Wright: Ace Attorney - Trials and Tribulations (Capcom; Game Boy Advance)\n**Gran Turismo 4 (Sony Computer Entertainment; PlayStation 2)\n**Siren (Sony Computer Entertainment; PlayStation 2)\n**True Fantasy Live Online (Microsoft; Xbox)\n**Naruto: Ultimate Ninja (Bandai; PlayStation 2)\n**Half-Life 2 (Valve Corporation; PC)\n**Metal Gear Solid 3: Snake Eater (Konami; PlayStation 2)\n**Monster Hunter (Capcom; PlayStation 2)\nThe 8th CESA Game Awards (2004)\nHeld on October 27, 2004 at the ANA Hotel Tokyo in Minato, Tokyo. Games eligible were those released in the Japanese fiscal year 2004 (between April 1, 2003 and March 31, 2004). The following categories were awarded:\nGame Awards 2003 - 2004\n*'Grand Prize (大賞, Taishō)  Monster Hunter (Capcom; PlayStation 2)'\n*Award for Excellence (優秀賞, Yūshū-shō)\n**Onimusha 3: Demon Siege (Capcom; PlayStation 2)\n**Katamari Damacy (Namco; PlayStation 2)\n**Phoenix Wright: Ace Attorney – Trials and Tribulations (Capcom; Game Boy Advance)\n**Grand Theft Auto III (Capcom; PlayStation 2)\n**Samurai Warriors (Koei; PlayStation 2, Xbox)\n**Tales of Symphonia (Namco; GameCube)\n**Dragon Quest V (Square Enix; PlayStation 2)\n**Pokémon FireRed and LeafGreen (The Pokémon Company; Game Boy Advance)\n**Everybody's Golf 4 (Sony Computer Entertainment; PlayStation 2)\n**Pro Evolution Soccer 3 (Konami; PlayStation 2)\n*Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Pokémon FireRed and LeafGreen (The Pokémon Company; Game Boy Advance)\n*Global Award (グローバル賞, Gurōbaru-shō)\n**Japanese Works (日本作品, Nihon sakuhin)  WWE SmackDown! Here Comes the Pain'' (Yuke's; PlayStation 2)\n**Overseas Works (海外作品, Kaigai sakuhin)  Need for Speed: Underground (Electronic Arts; PlayStation 2, GameCube, Xbox, Game Boy Advance, PC)\n*Special Award (特別賞, Tokubetsu-shō)\n**EyeToy: Play (Sony Computer Entertainment; PlayStation 2)\n**Kenshin Dragon Quest: Yomigaerishi Densetsu no Ken (Square Enix; Television game)\n**Famicom Mini series (Nintendo; Game Boy Advance)\nGame Awards Future\n*Kingdom Hearts II (Square Enix; PlayStation 2)\n*Gran Turismo 4 (Sony Computer Entertainment; PlayStation 2)\n*Tales of Rebirth (Namco; PlayStation 2)\n*Dragon Quest VIII (Square Enix; PlayStation 2)\n*Resident Evil 4 (Capcom; GameCube)\n*Burnout 3: Takedown (Electronic Arts; PlayStation 2)\n*Halo 2 (Microsoft; Xbox)\n*Metal Gear Solid 3: Snake Eater (Konami; PlayStation 2)\n*Radiata Stories (Square Enix; PlayStation 2)\n*Mega Man Battle Network 5: Team ProtoMan and Team Colonel (Capcom; Game Boy Advance)\n*Shadow of the Colossus (Sony Computer Entertainment; PlayStation 2)\nGame Awards Indies\n*Grand Prize (大賞, Taishō)  Burger Maker (Dai Ikushima; PC)\n*Award for Excellence (優秀賞, Yūshū-shō)  MANNEKENPIS (Masatsugu Konuma; PC)\nThe 9th CESA Game Awards (2005)\nHeld on October 27, 2005 at Meguro Gajoen in Meguro, Tokyo. Games eligible were those released in the Japanese fiscal year 2005 (between April 1, 2004 and March 31, 2005). The following categories were awarded:\nGame Awards 2004 - 2005\n*'Grand Prize (大賞, Taishō)  Dragon Quest VIII (Square Enix; PlayStation 2)'\n*Award for Excellence (優秀賞, Yūshū-shō)\n**Gran Turismo 4 (Sony Computer Entertainment; PlayStation 2)\n**WarioWare: Touched! (Nintendo; Nintendo DS)\n**3-nen B-gumi Kinpachi-sensei: Densetsu no Kyōdan ni Tate! (Chunsoft; PlayStation 2)\n**Dynasty Warriors 5 (Koei; PlayStation 2)\n**Daigasso! Band Brothers (Nintendo; Nintendo DS)\n**Dragon Quest VIII (Square Enix; PlayStation 2)\n**Resident Evil 4 (Capcom; GameCube)\n**Harukanaru Toki no Naka de 3 (Koei; PlayStation 2)\n**Pokémon Emerald (The Pokémon Company; Game Boy Advance)\n**''Everybody's Golf Portable (Sony Computer Entertainment; PlayStation Portable)\n**Metal Gear Solid 3: Snake Eater (Konami; PlayStation 2)\n**Meteos (Bandai; Nintendo DS)\n**Pro Evolution Soccer 4 (Konami; PlayStation 2)\n*Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Dragon Quest VIII (Square Enix; PlayStation 2)\n*Global Award (グローバル賞, Gurōbaru-shō)\n**Japanese Works (日本作品, Nihon sakuhin)  Pro Evolution Soccer 4 (Konami; PlayStation 2)\n**Overseas Works (海外作品, Kaigai sakuhin)  Halo 2 (Microsoft; Xbox)\n*Special Award (特別賞, Tokubetsu-shō)  Jissen PachiSlot Hisshōhō! Hokuto no Ken (Sammy / Sega; PlayStation 2)\nGame Awards Future\n*FUTURE Award (FUTURE賞, Fu~yūchā-shō)\n**Ōkami (Capcom; PlayStation 2)\n**Kidou Senshi Gundam Seed: Rengou vs. Z.A.F.T. (Bandai; PlayStation 2)\n**Kingdom Hearts II (Square Enix; PlayStation 2)\n**Tales of the Abyss (Namco; PlayStation 2)\n**Ninety-nine Nights (Microsoft; Xbox 360)\n**Final Fantasy XII (Square Enix; PlayStation 2)\n**Monster Hunter 2 (Capcom; PlayStation 2)\n**Yakuza (Sega; PlayStation 2)\n**Rogue Galaxy (Sony Computer Entertainment; PlayStation 2)\n**LocoRoco (Sony Computer Entertainment; PlayStation Portable)\n**Shadow of the Colossus (Sony Computer Entertainment; PlayStation 2)\nGame Awards Indies\n*Grand Prize (大賞, Taishō)  AMIDA The Soldier on The Bridge (Yoshihiro Daimon, Technical Computer Club, Toyama Prefectural University; PC)\n*Award for Excellence (優秀賞, Yūshū-shō)  Koi no Kaisatsu Kuchi (Konami School TEMP Junya Tanaka / Chiaki Nakayama;Mobile)\nJapan Game Awards 2006\nA ceremony for the \"Games of the Year\" and \"Indies\" divisions was held on September 22, 2006 at the Tokyo Game Show event stage. The \"Future\" division awards were handed out on a separate ceremony on September 24, 2006. Games eligible were those released in the Japanese fiscal year 2006 (between April 1, 2005 and March 31, 2006).\nThe following categories were awarded:\nGames of the Year Division\n*'Grand Prize (大賞, Taishō)  Brain Age: Train Your Brain in Minutes a Day! (Nintendo; Nintendo DS), and Final Fantasy XII (Square Enix; PlayStation 2)' (shared award)\n*Award for Excellence (優秀賞, Yūshū-shō)\n**Animal Crossing: Wild World (Nintendo; Nintendo DS)\n**Kingdom Hearts II (Square Enix; PlayStation 2)\n**Tamagotchi's Bubble-Bubble Omisetchi (Bandai Namco; Nintendo DS)\n**Tales of the Abyss (Namco; PlayStation 2)\n**Nintendogs (Nintendo; Nintendo DS)\n**Mario Kart DS (Nintendo; Nintendo DS)\n**Monster Hunter 2 (Capcom; PlayStation 2)\n**Yakuza (Sega; PlayStation 2)\n**Shadow of the Colossus (Sony Computer Entertainment; PlayStation 2)\n*Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Animal Crossing: Wild World (Nintendo; Nintendo DS)\n*Global Award (グローバル賞, Gurōbaru-shō)\n**Japanese Works (日本作品, Nihon sakuhin)  Nintendogs (Nintendo; Nintendo DS)\n**Overseas Works (海外作品, Kaigai sakuhin)  World of Warcraft (Blizzard Entertainment; PC)\n*Special Award (特別賞, Tokubetsu-shō)\n**Monster Hunter Freedom (Capcom; PlayStation Portable)\n**English Training: Have Fun Improving Your Skills! (Nintendo; Nintendo DS)\nFuture Division\n*Award for Excellence (優秀賞, Yūshū-shō)\n**Elebits (Konami; Wii)\n**Apollo Justice: Ace Attorney (Capcom; Nintendo DS)\n**Gran Turismo HD (Sony Computer Entertainment; PlayStation 3)\n**The Eye of Judgement (Sony Computer Entertainment; PlayStation 3)\n**Dawn of Mana (Square Enix; PlayStation 2)\n**Tales of Destiny (Bandai Namco; PlayStation 2)\n**Blue Dragon (Microsoft; Xbox 360)\n**Heavenly Sword (Sony Computer Entertainment; PlayStation 3)\n**Metal Gear Solid: Portable Ops (Konami; PlayStation Portable)\n**Monster Hunter Freedom 2 (Capcom; PlayStation Portable)\n**Lost Planet: Extreme Condition (Capcom; Xbox 360)\nIndies Division\n*Grand Prize (大賞, Taishō)  5 Seconds of Kappa (Kyushu University Graduate School of Information Science and Electrical Engineering/Jolly9; Mobile)\n*Award for Excellence (優秀賞, Yūshū-shō)\n**Moai's Nest (SKT; PC)\n**Blowwind (Digital Entertainment Academy/Team P; GameCube)\n**Cell_Sparrow (Gen Muto; PC)\nJapan Game Awards 2007\nThe main ceremony was held on September 20, 2007 at the Tokyo Game Show event stage. The \"Games of the Year Division\" awards were announced during that ceremony, while the ceremonies for the \"Amateur Division\" and \"Future Division\" awards were held on September 21 and September 23, 2007 respectively. Games eligible were those released in the Japanese fiscal year 2007 (between April 1, 2006 and March 31, 2007).\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Wii Sports (Nintendo; Wii), and Monster Hunter Freedom 2 (Capcom; PlayStation Portable)' (shared award)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Wii Sports (Nintendo; Wii)\n** Ōkami (Capcom; PlayStation 2)\n** Dynasty Warriors: Gundam (Bandai Namco; PlayStation 3)\n** The Legend of Zelda: Twilight Princess (Nintendo; Wii)\n** Dragon Quest Monsters: Joker (Square Enix; Nintendo DS)\n** New Super Mario Bros. (Nintendo; Nintendo DS)\n** Blue Dragon (Microsoft; Xbox 360)\n** Pokémon Diamond and Pearl (The Pokémon Company; Nintendo DS)\n** Metal Gear Solid: Portable Ops (Konami; PlayStation Portable)\n** Monster Hunter Freedom 2 (Capcom; PlayStation Portable)\n** Yakuza 2 (Sega; PlayStation 2)\n** Professor Layton and the Curious Village (Level-5; Nintendo DS)\n** Lost Planet: Extreme Condition (Capcom; Xbox 360)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Pokémon Diamond and Pearl (The Pokémon Company; Nintendo DS)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Dead Rising (Capcom; Xbox 360)\n** Overseas Works (海外作品, Kaigai sakuhin)  Gears of War (Microsoft; Xbox 360)\n* Special Award (特別賞, Tokubetsu-shō)\n** The Idolmaster (Bandai Namco; Xbox 360)\n** Love and Berry: Dress Up and Dance! DS Collection (Sega; Nintendo DS)\nFuture Division\n* Ace Combat 6: Fires of Liberation (Bandai Namco; Xbox 360)\n* Dynasty Warriors 6 (Koei; PlayStation 3, Xbox 360)\n* Super Robot Wars OG Gaiden (Banpresto; PlayStation 2)\n* The Promise of Haruhi Suzumiya (Bandai Namco; PlayStation Portable)\n* Sengoku Basara 2 Heroes (Capcom; PlayStation 2, Wii)\n* Zacl & Wiki: Quest for Barbaros' Treasure (Capcom; Wii)\n* Devil May Cry 4 (Capcom; PlayStation 3, Xbox 360, PC)\n* Dragon Quest IX (Square Enix; Nintendo DS)\n* Metal Gear Solid 4: Guns of the Patriots (Konami; PlayStation 3)\n* Yakuza Kenzan! (Sega; PlayStation 3)\n* Professor Layton and the Diabolical Box (Level-5; Nintendo DS)\nAmateur Division\n* Grand Prize (大賞, Taishō)  Battle Quest (Kenta Nakamura, HAL College of Computer Technology; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Shimensoka (Ginger & sho, Act; PC)\n** TRUE ENSEMBLE (Denpuchi, Digital Entertainment Academy; PlayStation 2)\n** Punitto Clown (Denpuchi, Digital Entertainment Academy; Nintendo DS)\n** LEAD BALL (Yoshida Chiharu, Digital Entertainment Academy; Mobile)\n* Honorable Mentions (佳作, Kasaku)\n** Phantom Thief HAYABUSA'' (Sukima's, HAL College of Computer Technology; Nintendo DS)\n** SUPER ASHIASHI (TEAM MANIA BLEND, Digital Entertainment Academy; Mobile)\n** Tumiki (Mizudasi koutya, Niigata Computer College; PC)\n** Hinan (Nakamura Yoshikazu, Niigata Computer College; Mobile)\n** Yanemadetonda (Dr. Garugari, Digital Entertainment Academy; PC)\nJapan Game Awards 2008\nThe awards for the \"Games of the Year Division\" were announced on October 9, 2008 at the Tokyo Game Show event stage. On that same day, the first-ever edition of the \"Minister of Economy, Trade and Industry Award\" was handed out. The \"Amateur Division\" winners were announced on October 11, 2008, and the \"Future Division\" ceremony was held on October 12, 2008. Games eligible were those released in the Japanese fiscal year 2008 (between April 1, 2007 and March 31, 2008). This edition saw the introduction of the \"Minister of Economy, Trade and Industry Award\", with Shigeru Miyamoto as its inaugural recipient.\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Wii Fit (Nintendo; Wii), and Monster Hunter Freedom Unite (Capcom; PlayStation Portable)' (shared award)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Wii Fit (Nintendo; Wii)\n** Super Mario Galaxy (Nintendo; Wii)\n** Super Smash Bros. Brawl (Nintendo; Wii)\n** Devil May Cry 4 (Capcom; PlayStation 3, Xbox 360, PC)\n** Dragon Quest IV (Square Enix; Nintendo DS)\n** Pokémon Mystery Dungeon: Explorers of Time and Explorers of Darkness (The Pokémon Company; Nintendo DS)\n** Mario Party DS (Nintendo; Nintendo DS)\n** Monster Hunter Freedom Unite (Capcom; PlayStation Portable)\n** Yakuza Kenzan! (Sega; PlayStation 3)\n** Professor Layton and the Diabolical Box (Level-5; Nintendo DS)\n** Pro Evolution Soccer 2008 (Konami; PlayStation 2, PlayStation 3, Xbox 360)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Wii Fit (Nintendo; Wii)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Wii Play (Nintendo; Wii)\n** Overseas Works (海外作品, Kaigai sakuhin)  Guitar Hero III: Legends of Rock (Activision; PlayStation 2, PlayStation 3, Xbox 360, Wii)\n* Special Award (特別賞, Tokubetsu-shō)  Call of Duty 4: Modern Warfare (Activision; PlayStation 3, Xbox 360, Nintendo DS)\nFuture Division\n* The Idolmaster SP Perfect Sun / Wandering Star / Missing Moon (Bandai Namco; PlayStation Portable)\n* Ace Attorney Investigations: Miles Edgeworth (Capcom; Nintendo DS)\n* White Knight Chronicles (Sony Computer Entertainment; PlayStation 3)\n* Star Ocean: The Last Hope (Square Enix; Xbox 360)\n* Dissidia Final Fantasy (Square Enix; PlayStation Portable)\n* Dragon Quest IX (Square Enix; Nintendo DS)\n* Resident Evil 5 (Capcom; PlayStation 3, Xbox 360)\n* Monster Hunter Tri (Capcom; Wii)\n* 428: Shibuya Scramble (Sega; Wii)\n* LittleBigPlanet (Sony Computer Entertainment; PlayStation 3)\n* Yakuza 3 (Sega; PlayStation 3)\n* ''Let's Tap (Sega; Wii)\nAmateur Division\n* Grand Prize (大賞, Taishō)  Variable Ball Crisis (Niigata Computer College / Team SK-III; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** a void (Niigata Computer College / Seraphim; PC)\n** Variable Ball Crisis (Niigata Computer College / Team SK-III; PC)\n** KAKIWAKE! Pon Pon Sweets (Digital Entertainment Academy / NANANANANA-NANA; Nintendo DS)\n** Clim Load!! (Niigata Computer College / Trigger; PC)\n** Sharp shooting (NAGOYA KOUGAKUIN COLLEGE / Mr. Ken Inagaki; Mobile)\n** POP (Niigata High Technology College / A___; PC)\n* Honorable Mentions (佳作, Kasaku)\n** ETERNAL LOCUS (Digital Entertainment Academy / Moriko; PC)\n** Fate of Midnight Castle (Sendai School of Digital Arts / Mr. Watanobe Takayuki; PC)\n** Catch de Poi (Shizuoka Professional Training College of Industrial Technology / Intentional; PC)\n** PATAPATA PANEL PUZZLE NAMIPANE (HAL Osaka College of Technology & Design / Marudon; Nintendo DS)\nMinister of Economy, Trade and Industry Award\n* Shigeru Miyamoto, General Manager of Nintendo EAD, Senior managing director and Representative director at Nintendo, creator of the Mario, The Legend of Zelda, Donkey Kong, Star Fox and Pikmin franchises.\nJapan Game Awards 2009\nThe main ceremony was held on September 24, 2009 at the Tokyo Game Show event stage, including the handing out of the \"Games of the Year Division\" awards as well as the \"Minister of Economy, Trade and Industry Award\". The \"Amateur Division\" winners were announced on September 26, 2009, and the \"Future Division\" awards ceremony was held on September 27, 2009. Games eligible were those released in the Japanese fiscal year 2009 (between April 1, 2008 and March 31, 2009).\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Mario Kart Wii (Nintendo; Wii), and Metal Gear Solid 4: Guns of the Patriots (Konami; PlayStation 3)' (shared award)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Dissidia Final Fantasy (Square Enix; PlayStation Portable)\n** Demon's Souls (Sony Computer Entertainment; PlayStation 3)\n** Resident Evil 5 (Capcom; PlayStation 3, Xbox 360)\n** Persona 4 (Atlus; PlayStation 2)\n** Pokémon Platinum (The Pokémon Company; Nintendo DS)\n** Mario Kart Wii (Nintendo; Wii)\n** Metal Gear Solid 4: Guns of the Patriots (Konami; PlayStation 3)\n** 428: Shibuya Scramble (Sega; Wii)\n** Rhythm Heaven (Nintendo; Nintendo DS)\n** Yakuza 3 (Sega; PlayStation 3)\n** Professor Layton and the Unwound Future (Level-5; Nintendo DS)\n* Special Award (特別賞, Tokubetsu-shō)\n** Monster Hunter Freedom Unite THE BEST (Capcom; PlayStation Portable)\n** Style Savvy (Nintendo; Nintendo DS)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Pokémon Platinum (The Pokémon Company; Nintendo DS)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Wii Fit (Nintendo; Wii)\n** Overseas Works (海外作品, Kaigai sakuhin)  Grand Theft Auto IV (Rockstar Games; PlayStation 3, Xbox 360)\nFuture Division\n* Assassin's Creed II (Ubisoft; PlayStation 3, Xbox 360)\n* Kingdom Hearts Birth by Sleep (Square Enix; PlayStation Portable)\n* Ghost Trick: Phantom Detective (Capcom; Nintendo DS)\n* Tales of Graces (Bandai Namco; Wii)\n* Dragon Quest VI (Square Enix; Nintendo DS)\n* Ni no Kuni: Dominion of the Dark Djinn (Level-5; Nintendo DS)\n* Final Fantasy XIII (Sega; PlayStation 3)\n* Bayonetta (Sega; PlayStation 3, Xbox 360)\n* Metal Gear Solid: Peace Walker (Konami; PlayStation Portable)\n* Yakuza 4 (Sega; PlayStation 3)\n* Professor Layton and the Last Specter (Level-5; Nintendo DS)\n* Lost Planet 2 (Capcom; PlayStation 3, Xbox 360)\nAmateur Division\n* Grand Prize (大賞, Taishō)  BAMBOONO (Tokyo Polytechnic University / Takenoko; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** I'm Qbe (HAL Osaka College of Technology & Design / Tatsuya Kikkawa; PC)\n** iDEARTh (DEA / Leaning Tower of DEA; PlayStation 3)\n** SHABON DE POM (Nihon Kogakuin College / Minority; Nintendo DS)\n** Magnet of a silence (Niigata Computer college / Ms Doliko; PC)\n** BAMBOONO (Tokyo Polytechnic University / Takenoko; PC)\n* Honorable Mentions (佳作, Kasaku)\n** OH! naradeGO! (DEA / yo! joshi! Project; Wii)\n** GENETOS (Kisarazu National College of Technology / Tatsuya Koyama; PC)\n** Flare in the Incubus (ECC College of Computer & Multimedia / O-Rocks.labo; PC)\n** Painting Wear (Niigata Hight Technology College / Yu Sakai; PC)\n** HOSHIPOCHA (Shobi University / LE KHANH HUY; PC)\nMinister of Economy, Trade and Industry Award\n* The Monster Hunter development team at Capcom Co., Ltd.\nJapan Game Awards 2010\nThe \"Games of the Year Division\" awards and the \"Minister of Economy, Trade and Industry Award\" were handed out during a ceremony on September 16, 2010 at the Tokyo Game Show event stage. Separate ceremonies were held on September 18 and 19, 2010, in which the \"Amateur Division\" and \"Future Division\" awards, respectively, were announced. Games eligible were those released in the Japanese fiscal year 2010 (between April 1, 2009 and March 31, 2010).\nA new \"Game Designers Award\" category was established, decided by a group of judges selected from the industry. The judges for the 2010 edition were Kazutoshi Iida, Jiro Ishii, Fumito Ueda, Hideki Kamiya, Masayoshi Kikuchi, Hifumi Kouno, Masahiro Sakurai, Shu Takumi, Keiichiro Toyama, Jin Fujisawa and Shinji Mikami.\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  New Super Mario Bros. Wii (Nintendo; Wii)'\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  Heavy Rain (Quantic Dream, Sony Computer Entertainment; PlayStation 3)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Inazuma Eleven 2 Firestorm and Blizzard (Level-5; Nintendo DS)\n** Wii Sports Resort (Nintendo; Wii)\n** Tomodachi Collection (Nintendo; Nintendo DS)\n** Dragon Quest IX (Square Enix; Nintendo DS)\n** New Super Mario Bros. Wii (Nintendo; Wii)\n** Final Fantasy XIII (Sega; PlayStation 3)\n** Bayonetta (Sega; PlayStation 3, Xbox 360)\n** Pokémon HeartGold and SoulSilver (The Pokémon Company; Nintendo DS)\n** Monster Hunter Tri (Capcom; Wii)\n** LovePlus (Konami; Nintendo DS)\n** Yakuza 4 (Sega; PlayStation 3)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Dragon Quest IX (Square Enix; Nintendo DS)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Wii Sports Resort (Nintendo; Wii)\n** Overseas Works (海外作品, Kaigai sakuhin)  Call of Duty: Modern Warfare 2 (Activision / Infinity Ward; PlayStation 3, Xbox 360, PC)\nFuture Division\n* The Idolmaster 2 (Bandai Namco; Xbox 360)\n* Vanquish (Sega; PlayStation 3, Xbox 360)\n* El Shaddai: Ascension of the Metatron (Ignition Entertainment; PlayStation 3, Xbox 360)\n* Gran Turismo 5 (Sony Computer Entertainment; PlayStation 3)\n* Dance Masters (Konami; Xbox 360)\n* Dissidia 012 Final Fantasy (Square Enix; PlayStation Portable)\n* Ni no Kuni: Dominion of the Dark Djinn (Level-5; Nintendo DS)\n* Final Fantasy XIV (Square Enix; PlayStation 3, PC)\n* Monster Hunter Portable 3rd (Capcom; PlayStation Portable)\n* Yakuza: Dead Souls (Sega; PlayStation 3)\nAmateur Division\n* Grand Prize (大賞, Taishō)  SAND CRUSH (Tokyo Polytechnic University / UWAY; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** GRAVIS (Nippon Engineering College Hachioji / OMI; PC)\n** SAND CRUSH (Tokyo Polytechnic University / UWAY; PC)\n** Charlotte (Shobi University / TEAM Charlie; PC)\n** Blockle (Tokyo Polytechnic University / Libre Head; PC)\n* Honorable Mentions (佳作, Kasaku)\n** EUROPA (Nagoya Institute of Technology / Team Confidential Documents; PC)\n** rhythmic gymnastics (Japan Electronics College / Rhythmic Gymnastics Management Headquarters; PC)\n** NEON (HAL Osaka / Yoshikuni Jo; Nintendo DS)\n** FINGER BATTLEFIELD! (Japan Electronics College / Tomoki Uzawa; PC)\n** Rem and the Magical Scarf'' (Tokyo Communication Arts College / Okuty's Factory; PC)\nMinister of Economy, Trade and Industry Award\n* Yuji Horii, video game designer, writer and director, creator of the Dragon Quest series.\nJapan Game Awards 2011\nThe \"Games of the Year Division\" awards and the \"Minister of Economy, Trade and Industry Award\" were handed out on September 15, 2011 at the Tokyo Game Show event stage. Separate ceremonies were held on September 17 and 18, 2011, for the \"Amateur Division\" and \"Future Division\" awards respectively. Games eligible were those released in the Japanese fiscal year 2011 (between April 1, 2010 and March 31, 2011).\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Fumito Ueda, Hideki Kamiya, Masayoshi Kikuchi, Hifumi Kouno, Masahiro Sakurai, Ryotaro Takahashi, Shu Takumi, Keiichiro Toyama, Jin Fujisawa and Shinji Mikami.\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Monster Hunter Portable 3rd (Capcom; PlayStation Portable)'\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  Scribblenauts (5th Cell, Konami; Nintendo DS)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Wii Party (Nintendo; Wii)\n** The Legend of Heroes: Trails from Zero (Nihon Falcom; PlayStation Portable)\n** Catherine (Atlus; PlayStation 3, Xbox 360)\n** Gran Turismo 5 (Sony Computer Entertainment; PlayStation 3)\n** Super Mario Galaxy 2 (Nintendo; Wii)\n** Xenoblade Chronicles (Nintendo; Wii)\n** Donkey Kong Country Returns (Nintendo; Wii)\n** Ni no Kuni: Dominion of the Dark Djinn (Level-5; Nintendo DS)\n** Pokémon Black and White (The Pokémon Company; Nintendo DS)\n** Metal Gear Solid: Peace Walker (Konami; PlayStation Portable)\n** Monster Hunter Portable 3rd (Capcom; PlayStation Portable)\n* Special Award (特別賞, Tokubetsu-shō)  Red Dead Redemption (Rockstar Games; PlayStation 3, Xbox 360)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Pokémon Black and White (The Pokémon Company; Nintendo DS)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Pokémon HeartGold and SoulSilver (The Pokémon Company; Nintendo DS)\n** Overseas Works (海外作品, Kaigai sakuhin)  Call of Duty: Black Ops (Activision / Treyarch; PlayStation 3, Xbox 360, PC)\nFuture Division\n* Awards (受賞, Jushō)\n** ''Asura's Wrath (Capcom; PlayStation 3, Xbox 360)\n** The Legend of Heroes: Trails to Azure (Nihon Falcom; PlayStation Portable)\n** Mobile Suit Gundam: Extreme Vs. (Bandai Namco; PlayStation 3)\n** Dragon's Dogma (Capcom; PlayStation 3, Xbox 360)\n** Binary Domain (Sega; PlayStation 3, Xbox 360)\n** Battlefield 3 (Electronic Arts; PlayStation 3, Xbox 360, PC)\n** Final Fantasy XIII-2 (Square Enix; PlayStation 3, Xbox 360)\n** Final Fantasy Type-0 (Square Enix; PlayStation Portable)\n** Phantasy Star Online 2 (Sega; PC)\n** Monster Hunter 3 Ultimate (Capcom; Nintendo 3DS)\n* Special Award (特別賞, Tokubetsu-shō)  Dragon Collection (Konami; Mobile)\nAmateur Division\n* Grand Prize (大賞, Taishō)  CONNECT (Kawaijuku Educational Corporation Trident Computer College / Trident++; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Annihilate 6 (Shobi University / DELTA; PC)\n** CONNECT (Kawaijuku Educational Corporation Trident Computer College / Trident++; PC)\n** Sound and Dark (Sun Techno College / Game Production Research Group; PC)\n** Pantomime (HAL Osaka / Do-Re-Mi-Fabuchi; PC)\n** BUTTON PANIC! (Kobe Electronics College / Jeong Jik; Mobile)\n* Honorable Mentions (佳作, Kasaku)\n** Spinning Frame (Kawaijuku Educational Corporation Trident Computer College / Yuji Ikeda; PC)\n** The hero who was here ran away (Niigata Computer College / Team Triple O; PC)\n** Sonic Liner (Osaka Information and Computer College / Sonic Liner Development Team; PC)\n** Hayabusa Return Project (HAL Tokyo / Fumito Shimizu; PC)\n** Pinch Ball (Kawaijuku Educational Corporation Trident Computer College / Yuhei Tokuda; PC)\n** Revolve'' (Niigata Computer College / NASS; PC)\nMinister of Economy, Trade and Industry Award\n* Tsunekazu Ishihara, video game designer, director and producer, president and CEO of The Pokémon Company.\nJapan Game Awards 2012\nThe main ceremony, in which the \"Games of the Year Division\" and \"Minister of Economy, Trade and Industry\" awards were announced, was held on September 20, 2012 on the Tokyo Game Show event stage, with additional awards on September 22 and 23, 2012. Games eligible were those released in the Japanese fiscal year 2012 (between April 1, 2011 and March 31, 2012).\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Fumito Ueda, Yojiro Ogawa, Hideki Kamiya, Koichi Kawamoto, Masahiro Sakurai, Shu Takumi, Jin Fujisawa and Shinji Mikami.\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Gravity Rush (Sony Computer Entertainment; PlayStation Vita)'\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  Journey (Sony Computer Entertainment; PlayStation 3)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Gravity Rush (Sony Computer Entertainment; PlayStation Vita)\n** The Elder Scrolls V: Skyrim (ZeniMax Asia; PlayStation 3, Xbox 360, PC)\n** Kid Icarus: Uprising (Nintendo; Nintendo 3DS)\n** Super Mario 3D Land (Nintendo; Nintendo 3DS)\n** The Legend of Zelda: Skyward Sword (Nintendo; Wii)\n** Dark Souls (FromSoftware; PlayStation 3)\n** Final Fantasy XIII-2 (Square Enix; PlayStation 3, Xbox 360)\n** Mario Kart 7 (Nintendo; Nintendo 3DS)\n** Monster Hunter 3 Ultimate (Capcom; Nintendo 3DS)\n** One Piece: Pirate Warriors (Bandai Namco; PlayStation 3)\n* Special Award (特別賞, Tokubetsu-shō)  Touch Detective: Funghi Gardening Kit (B-Works; Mobile)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Mario Kart 7 (Nintendo; Nintendo 3DS)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Pokémon Black and White (The Pokémon Company; Nintendo DS)\n** Overseas Works (海外作品, Kaigai sakuhin)  Call of Duty: Modern Warfare 3 (Activision / Infinity Ward / Sledgehammer Games; PlayStation 3, Xbox 360, PC)\nFuture Division\n* Phoenix Wright: Ace Attorney – Dual Destinies (Capcom; Nintendo 3DS)\n* God Eater 2 (Bandai Namco; PlayStation Portable, PlayStation Vita)\n* ''JoJo's Bizarre Adventure: All Star Battle (Bandai Namco; PlayStation 3)\n* Soul Sacrifice (Sony Computer Entertainment; PlayStation Vita)\n* Tales of Xillia 2 (Bandai Namco; PlayStation 3)\n* Resident Evil 6 (Capcom; PlayStation 3, Xbox 360)\n* Fantasy Life (Level-5; Nintendo 3DS)\n* Bravely Default (Square Enix; Nintendo 3DS)\n* Metal Gear Rising: Revengeance (Konami; PlayStation 3)\n* Monster Hunter 4 (Capcom; Nintendo 3DS)\n* Yakuza 5 (Sega; PlayStation 3)\nAmateur Division\n* Grand Prize (大賞, Taishō)  Reco (HAL Nagoya / project Reco; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** ELEDIVE (HAL Osaka / A-Mail PROJECT; PlayStation Vita)\n** Gentlemen's Theatre Close Call (HAL Nagoya / Team Gonjiri; Nintendo DS)\n** Sweep Order (Kawaijuku Trident Computer College / Masaharu Mizuno; PC)\n** Paper World (HAL Nagoya / Project Paper; Mobile)\n** Reco (HAL Nagoya / project Reco; PC)\n* Honorable Mentions (佳作, Kasaku)\n** CUBE (HAL Osaka / CUBE Project; Nintendo DS)\n** CLARTE (HAL Nagoya / Project CLARTE; Nintendo DS)\n** BANG! BANG! BACHI Spirit (Tokyo Polytechnic University / M3; PC)\n** LightJam (HAL Nagoya / LightJam Production Team; Mobile)\n** Libretto (Osaka Information and Computer College / Libretto Production Committee; PC)\n** Liber Liberi'' (HAL Osaka / Libre Libre Development Team; Nintendo DS)\nMinister of Economy, Trade and Industry Award\n* The Nintendo 3DS development team at Nintendo. The award was received by Hideki Konno and Hitoshi Nakai.\nJapan Game Awards 2013\nThe main ceremony, in which the \"Games of the Year Division\" and \"Minister of Economy, Trade and Industry\" awards were announced, was held on September 19, 2013 on the Tokyo Game Show event stage, with additional awards on September 21 and 22, 2013. Games eligible were those released in the Japanese fiscal year 2013 (between April 1, 2012 and March 31, 2013).\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Fumito Ueda, Yojiro Ogawa, Hideki Kamiya, Masahiro Sakurai, Ryutaro Takahashi, Shu Takumi, Jin Fujisawa and Shinji Mikami.\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Animal Crossing: New Leaf (Nintendo; Nintendo 3DS)'\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  The Unfinished Swan (Giant Sparrow, Sony Computer Entertainment; PlayStation 3)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Danganronpa 2: Goodbye Despair (Spike Chunsoft; PlayStation Portable)\n** Soul Sacrifice (Sony Computer Entertainment; PlayStation Vita)\n** Animal Crossing: New Leaf (Nintendo; Nintendo 3DS)\n** Dragon Quest X (Square Enix; Wii, Wii U, PC)\n** New Super Mario Bros. U (Nintendo; Wii U)\n** Resident Evil 6 (Capcom; PlayStation 3, Xbox 360)\n** Phantasy Star Online 2 (Sega; PlayStation Vita, PC)\n** Fantasy Life (Level-5; Nintendo 3DS)\n** Bravely Default (Square Enix; Nintendo 3DS)\n** Pokémon Black 2 and White 2 (The Pokémon Company; Nintendo DS)\n** ''Luigi's Mansion: Dark Moon (Nintendo; Nintendo 3DS)\n* Special Award (特別賞, Tokubetsu-shō)  Puzzle & Dragons (GungHo Online Entertainment; Mobile)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Animal Crossing: New Leaf (Nintendo; Nintendo 3DS)\n* Global Award (グローバル賞, Gurōbaru-shō)  Call of Duty: Black Ops II (Activision / Treyarch; PlayStation 3, Xbox 360, Wii U, PC)\nFuture Division\n* The Legend of Heroes: Trials of Cold Steel (Nihon Falcom; PlayStation 3, PlayStation Vita)\n* Kingdom Hearts III (Square Enix; PlayStation 4, Xbox One)\n* God Eater 2 (Bandai Namco; PlayStation Portable, PlayStation Vita)\n* Sengoku Basara 4 (Capcom; PlayStation 3)\n* Titanfall (Electronic Arts; Xbox One)\n* Deep Down (Capcom; PlayStation 4)\n* Puzzle & Dragons Z (GungHo Online Entertainment; Nintendo 3DS)\n* Battlefield 4 (Electronic Arts; PlayStation 4/PlayStation 3, Xbox One, Xbox 360, PC)\n* Final Fantasy XV (Square Enix; PlayStation 4, Xbox One)\n* Metal Gear Solid V: The Phantom Pain (Konami; PlayStation 4, PlayStation 3, Xbox One, Xbox 360)\n* Like a Dragon: Ishin! (Sega; PlayStation 4, PlayStation 3)\nAmateur Division\n* Grand Prize (大賞, Taishō)  Toy Revo (HAL Osaka / Team Toy Revo; Nintendo DS)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Re (HAL Osaka / PROJECT Re; Nintendo DS)\n** Toy Revo (HAL Osaka / Team Toy Revo; Nintendo DS)\n** THREE (HAL Nagoya / TEAM TANDS; Nintendo DS)\n** TRANSFER (HAL Osaka / Loconiro Project; PC)\n** Monochrome Route Creator (HAL Osaka / Project Monochrome; PC)\n* Honorable Mentions (佳作, Kasaku)\n** Drawing Needle - 0.001 Mile Road (Nagoya Institute of Technology / GPU_RETURNS; Mobile)\n** Create & Climb (HAL Osaka / Ryoma Yamauchi; PC)\n** CHAIN (HAL Osaka / A-Mail PROJECT; PC)\n** Line Slash (HAL Osaka / Heinekuren; Nintendo DS)\n* Special Award (特別賞, Tokubetsu-shō)  Food Practice Shooter (Takayuki Kosaka; PC)\nMinister of Economy, Trade and Industry Award\n* The Puzzle & Dragons'' development team at GungHo Online Entertainment.\nJapan Game Awards 2014\nThe main ceremony, in which the \"Games of the Year Division\" and \"Minister of Economy, Trade and Industry\" awards were announced, was held on September 18, 2014 on the Tokyo Game Show event stage, with additional awards on September 20 and 21, 2014. Games eligible were those released in the Japanese fiscal year 2014 (between April 1, 2013 and March 31, 2014).\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Fumito Ueda, Yojiro Ogawa, Hideki Kamiya, Masahiro Sakurai, Keiichiro Toyama and Hitoshi Fujisawa.\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Monster Hunter 4 (Capcom; Nintendo 3DS), and Yo-kai Watch (Level-5; Nintendo 3DS)' (shared award)\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  Brothers: A Tale of Two Sons (Starbreeze Studios, Spike Chunsoft; PlayStation 3)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Kantai Collection (DMM.com, Kadokawa Games; PC)\n** Grand Theft Auto V (Rockstar Games; PlayStation 3, Xbox 360)\n** Super Mario 3D World (Nintendo; Wii U)\n** Dark Souls II (FromSoftware; PlayStation 3, Xbox 360, PC)\n** Puzzle & Dragons Z (GungHo Online Entertainment; Nintendo 3DS)\n** Final Fantasy XIV: A Realm Reborn (Square Enix; PC, PlayStation 3, PlayStation 4)\n** Pokémon X and Y (The Pokémon Company; Nintendo 3DS)\n** Metal Gear Solid V: Ground Zeroes (Konami; PlayStation 4, PlayStation 3, Xbox 360, Xbox One)\n** Monster Hunter 4 (Capcom; Nintendo 3DS)\n** Yo-kai Watch (Level-5; Nintendo 3DS)\n** The Last of Us (Sony Computer Entertainment; PlayStation 3)\n* Special Award (特別賞, Tokubetsu-shō)  Pocket Card Jockey (Game Freak; Nintendo 3DS)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Pokémon X and Y (The Pokémon Company; Nintendo 3DS)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Pokémon X and Y (The Pokémon Company; Nintendo 3DS)\n** Overseas Works (海外作品, Kaigai sakuhin)  Grand Theft Auto V (Rockstar Games; PlayStation 3, Xbox 360)\nFuture Division\n* The Legend of Heroes: Trails of Cold Steel II (Nihon Falcom; PlayStation 3, PlayStation Vita)\n* The Order: 1886 (Sony Computer Entertainment; PlayStation 4)\n* Kingdom Hearts HD 2.5 Remix (Square Enix; PlayStation 3)\n* God Eater 2: Rage Burst (Bandai Namco; PlayStation 4, PlayStation Vita)\n* The Evil Within (Bethesda Softworks; PlayStation 4, PlayStation 3, Xbox One, Xbox 360)\n* Tales of Zestiria (Bandai Namco; PlayStation 3)\n* Phantasy Star Nova (Sega; PlayStation Vita)\n* Bloodborne (Sony Computer Entertainment; PlayStation 4)\n* Metal Gear Solid V: The Phantom Pain (Konami; PlayStation 4, PlayStation 3, Xbox One, Xbox 360)\n* Monster Hunter 4 Ultimate (Capcom; Nintendo 3DS)\n* Yakuza 0 (Sega; PlayStation 4, PlayStation 3)\n* Oculus Rift (Oculus VR; PC)\nAmateur Division\n* Grand Prize (大賞, Taishō)  FRAMING (HAL Osaka / OneBIT; Nintendo DS)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Moving Sensation (ECC Computer College / Ugokashitai; Mobile)\n** STAPPY (ECC Computer College / Human Complex; PC)\n** Digaris (HAL Osaka / Project Digaris; Nintendo DS)\n** FRAMING (HAL Osaka / OneBIT; Nintendo DS)\n** LIFT (HAL Osaka / BRIGHT CONNECTION; PC)\n* Honorable Mentions (佳作, Kasaku)\n** Gobble (HAL Osaka / Gohorobo Project; Nintendo DS)\n** Math Puzzle (Trident Computer College / Daiki Suzuki; PC)\n** Mathematics and Shooting Stars (Tadanori Okada; Mobile)\n** TON (Tokyo Polytechnic University / team.CHAW; PC)\n** Shy (Nagoya Institute of Technology / Hachinoko Project; Mobile)\n** PluSpear (HAL Osaka / Project PluSpear; Nintendo DS)\n* Individual Award (個人賞, Kojin-shō)  Mathematics and Shooting Stars (Tadanori Okada; Mobile)\nMinister of Economy, Trade and Industry Award\n* Akihiro Hino, video game designer, fonder, president and CEO of Level-5, creator of the Dark Cloud, Professor Layton, Inazuma Eleven, Ni no Kuni, White Knight Chronicles, Little Battlers Experience and Yo-kai Watch franchises.\nJapan Game Awards 2015\nThe main ceremony, in which the \"Games of the Year Division\" and \"Minister of Economy, Trade and Industry\" awards were announced, was held on September 17, 2015 on the Tokyo Game Show event stage, with additional awards on September 19 and 20, 2015. Games eligible were those released in the Japanese fiscal year 2015 (between April 1, 2014 and March 31, 2015).\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Fumito Ueda, Yojiro Ogawa, Hideki Kamiya, Masahiro Sakurai, Shu Takumi, Keiichiro Toyama, Jin Fujisawa and Shinji Mikami.\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Yo-kai Watch 2 (Level-5; Nintendo 3DS)'\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  Ingress (Niantic; Mobile)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Super Smash Bros. for Wii U (Nintendo; Wii U)\n** Super Smash Bros. for Nintendo 3DS (Nintendo; Nintendo 3DS)\n** Destiny (Sony Computer Entertainment; PlayStation 4, PlayStation 3)\n** ''Dragon Quest Heroes: The World Tree's Woe and the Blight Below (Square Enix; PlayStation 4, PlayStation 3)\n** Bloodborne (Sony Computer Entertainment; PlayStation 4)\n** Pokémon Omega Ruby and Alpha Sapphire (The Pokémon Company; Nintendo 3DS)\n** Mario Kart 8 (Nintendo; Wii U)\n** Monster Hunter 4 Ultimate (Capcom; Nintendo 3DS)\n** Yo-kai Watch 2: Bony Spirits and Fleshy Souls (Level-5; Nintendo 3DS)\n** Yo-kai Watch 2: Psychic Specters (Level-5; Nintendo 3DS)\n** Yakuza 0 (Sega; PlayStation 4/PlayStation 3)\n* Special Award (特別賞, Tokubetsu-shō)\n** Minecraft (Microsoft; PlayStation 4, PlayStation 3, PlayStation Vita, Xbox One, Xbox 360, Mobile, PC, Mac)\n** Monster Strike (Mixi; Mobile)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Yo-kai Watch 2: Bony Spirits and Fleshy Souls (Level-5; Nintendo 3DS)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Super Smash Bros. for Nintendo 3DS and Wii U (Nintendo; Nintendo 3DS, Wii U)\n** Overseas Works (海外作品, Kaigai sakuhin)  Call of Duty: Advanced Warfare (Activision / Sledgehammer Games; PlayStation 4, PlayStation 3, Xbox One, Xbox 360, PC)\nFuture Division\n* Phoenix Wright: Ace Attorney – Spirit of Justice (Capcom; Nintendo 3DS)\n* Star Wars Battlefront (Electronic Arts; PlayStation 4, Xbox One, PC)\n* Star Ocean: Integrity and Faithlessness (Square Enix; PlayStation 4, PlayStation 3)\n* Tokyo Xanadu (Nihon Falcom; PlayStation Vita)\n* Dragon Quest Builders (Square Enix; PlayStation 4, PlayStation 3, PlayStation Vita)\n* The Last Guardian (Sony Computer Entertainment; PlayStation 4)\n* Final Fantasy XV (Square Enix; PlayStation 4, Xbox One)\n* Fallout 4 (Bethesda Softworks; PlayStation 4, Xbox One, PC)\n* Persona 5 (Atlus; PlayStation 4, PlayStation 3)\n* Monster Hunter Generations (Capcom; Nintendo 3DS)\nAmateur Division\n* Grand Prize (大賞, Taishō)  10. Motion Theory (Alice and Teles from Tokyo Polytechnic University; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Replacement (HAL Osaka / Team TPD; Wii)\n** Chase the Sun (Nippon Engineering College / Hachioji Photosynthese; PC)\n** Tick Bomb (Trident Computer College / Shohei Ikoma; Mobile)\n** TWINS (Takuyuki Matsumoto, Seifu School of Information Technology; PC)\n** 10. Motion Theory (Alice and Teles from Tokyo Polytechnic University; PC)\n** 4D FOLLOWERS (International College of Information Technology / Project 4D FOLLOWERS; PC)\n* Honorable Mentions (佳作, Kasaku)\n** an After Image (HAL Nagoya / Team.- EDEN -; Mobile)\n** Chrono Bastille (Shinichi Kawazoe, Kobe Electronics College, Computer Science Institute; PC)\n** Time Bomb (ECC Computer College / Quad; Mobile)\n** Hikagemono (Vantan Game Academy / Team Kagetaro; PC)\n* Individual Award (個人賞, Kojin-shō)  TWINS (Takuyuki Matsumoto, Seifu School of Information Technology; PC)\n* Special Technology Award (技術特別賞, Gijutsu tokubetsu-shō)  TWIDIVER (HAL Osaka / RTableProject; PC)\nMinister of Economy, Trade and Industry Award\n* Masahiro Sakurai, video game director and designer, founder of Sora Ltd., creator of the Kirby and Super Smash Bros.'' franchises.\nJapan Game Awards 2016\nThe main ceremony, in which the \"Games of the Year Division\" awards and the \"Minister of Economy, Trade and Industry Award\" were handed out, took place on September 15, 2016 on the Tokyo Game Show event stage, with additional ceremonies on September 17, 2016 for the \"Amateur Division\" awards and September 18, 2016 for the \"Future Division\" awards. Games eligible were those released in the Japanese fiscal year 2016 (between April 1, 2015 and March 31, 2016).\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Fumito Ueda, Yojiro Ogawa, Hideki Kamiya, Kazuyoshi Odaka, Masahiro Sakurai, Shu Takumi, Keiichiro Toyama, Jin Fujisawa and Shinji Mikami.\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Splatoon (Nintendo; Wii U)'\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  Life Is Strange (Dontnod Entertainment; PlayStation 4, PlayStation 3, PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** The Witcher 3: Wild Hunt (Spike Chunsoft; PlayStation 4, Xbox One)\n** Super Mario Maker (Nintendo; Wii U)\n** Splatoon (Nintendo; Wii U)\n** Dark Souls III (FromSoftware; PlayStation 4, Xbox One, PC)\n** Dragon Quest Builders (Square Enix; PlayStation 4, PlayStation 3, PlayStation Vita)\n** Fallout 4 (Bethesda Softworks; PlayStation 4, Xbox One, PC)\n** Minecraft (Microsoft; PlayStation 4, PlayStation 3, PlayStation Vita, Xbox One, Xbox 360, Mobile, PC, Mac)\n** Metal Gear Solid V: The Phantom Pain (Konami; PlayStation 4, PlayStation 3, Xbox One, Xbox 360, PC)\n** Monster Hunter Generations (Capcom; Nintendo 3DS)\n** Yo-kai Watch Blasters Red Cat Corps and White Dog Squad (Level-5; Nintendo 3DS)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Monster Hunter Generations (Capcom; Nintendo 3DS)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Super Smash Bros. for Nintendo 3DS and Wii U (Nintendo; Nintendo 3DS, Wii U)\n** Overseas Works (海外作品, Kaigai sakuhin)  Call of Duty: Black Ops III (Activision / Treyarch; PlayStation 4, PlayStation 3, Xbox One, Xbox 360, PC)\nFuture Division\n* Gravity Rush 2 (Sony Interactive Entertainment; PlayStation 4)\n* Summer Lesson: Miyamoto Hikari Seven Days Room (Bandai Namco; PlayStation 4 with PlayStation VR)\n* Nioh (Koei Tecmo; PlayStation 4)\n* Resident Evil 7: Biohazard (Capcom; PlayStation 4, Xbox One, PC)\n* The Last Guardian (Sony Interactive Entertainment; PlayStation 4)\n* Final Fantasy XV (Square Enix; PlayStation 4, Xbox One)\n* Horizon Zero Dawn (Sony Interactive Entertainment; PlayStation 4)\n* Megami Meguri (Capcom; Nintendo 3DS)\n* Monster Hunter Stories (Capcom; Nintendo 3DS)\n* Yakuza 6: The Song of Life (Sega; PlayStation 4)\nAmateur Division\n* Grand Prize (大賞, Taishō)  Trail (HAL Osaka / Project Trail; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Elec Head (Nippon Engineering College / Paguntalan ichiro dekolongon; PC)\n** Trail (HAL Osaka / Project Trail; PC)\n** FACTORIAN (Nagoya Institute of Technology / Takashi Furukawa; Mobile)\n** FLOLF (HAL Nagoya / Soichiro Nozu; PC)\n** Milky Star Way (HAL Nagoya / Tatsuya Hashimoto; PC)\n* Honorable Mentions (佳作, Kasaku)\n** ELECT COLLECT (HAL Osaka / No Plan; PC)\n** Gossip Quest (Nagoya Information Media College / Team Gossip Quest; PC)\n** Ding Dong War (HAL Osaka / Project DDW; Mobile)\n** FLOWer (ECC Computer College / Hana GAMES; Mobile)\n** Flowing battle (HAL Osaka / Team Continent; Mobile)\n* Individual Award (個人賞, Kojin-shō)  FLOLF (HAL Nagoya / Soichiro Nozu; PC)\nMinister of Economy, Trade and Industry Award\n* The Dragon Quest 30th Anniversary Team, represented by Yuji Horii, Dragon Quest series creator, and Ryutaro Ichimura, \"Dragon Quest 30th Anniversary Project General Producer\" at Square Enix.\nJapan Game Awards 2017\nThe main ceremony was held on September 21, 2017, in which the \"Games of the Year\" and \"Minister of Economy, Trade and Industry\" awards were announced at the Tokyo Game Show venue. On September 23, 2017 the \"Amateur Division\" awards were handed out, and on September 24, 2017 the \"Future Division\" awards were announced. Games eligible were those released in the Japanese fiscal year 2017 (between April 1, 2016 and March 31, 2017).\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Fumito Ueda, Yojiro Ogawa, Hideki Kamiya, Kazutaka Kodaka, Masahiro Sakurai, Shu Takumi, Keiichiro Toyama, Jin Fujisawa, Shinji Mikami and Hidetaka Miyazaki.\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  The Legend of Zelda: Breath of the Wild (Nintendo; Nintendo Switch, Wii U)'\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  INSIDE (Playdead; PlayStation 4, PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Overwatch (Square Enix; PlayStation 4, PC)\n** The Legend of Zelda: Breath of the Wild (Nintendo; Nintendo Switch, Wii U)\n** Nier: Automata (Square Enix; PlayStation 4, PC)\n** Nioh (Koei Tecmo; PlayStation 4)\n** Resident Evil 7: Biohazard (Capcom; PlayStation 4, Xbox One, PC)\n** The Last Guardian (Sony Interactive Entertainment; PlayStation 4)\n** Final Fantasy XV (Square Enix; PlayStation 4, Xbox One)\n** Persona 5 (Atlus; PlayStation 4, PlayStation 3)\n** Horizon Zero Dawn (Sony Interactive Entertainment; PlayStation 4)\n** Pokémon Sun and Moon (The Pokémon Company; Nintendo 3DS)\n** Monster Hunter Generations Ultimate (Capcom; Nintendo 3DS)\n* Special Award (特別賞, Tokubetsu-shō)  PlayStation VR (Sony Interactive Entertainment; PlayStation 4)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Pokémon Sun and Moon (The Pokémon Company; Nintendo 3DS)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Pokémon Sun and Moon (The Pokémon Company; Nintendo 3DS)\n** Overseas Works (海外作品, Kaigai sakuhin)  FIFA 17 (Electronic Arts; PlayStation 4, PlayStation 3, Xbox One, PC)\nFuture Division\n* The Legend of Heroes: Trails of Cold Steel III (Nihon Falcom; PlayStation 4)\n* Kyoei Toshi (Bandai Namco; PlayStation 4)\n* Dynasty Warriors 9 (Koei Tecmo; PlayStation 4)\n* Dissidia Final Fantasy NT (Square Enix; PlayStation 4)\n* Detroit: Become Human (Sony Interactive Entertainment; PlayStation 4)\n* Dragon Ball FighterZ (Bandai Namco; PlayStation 4, Xbox One)\n* Fire Emblem Warriors (Koei Tecmo; Nintendo Switch, New Nintendo 3DS)\n* ''PlayerUnknown's Battlegrounds (DMM Games / PUBG Corporation; PC)\n* Monster Hunter: World (Capcom; PlayStation 4)\n* LovePlus Every (Konami; Mobile)\nAmateur Division\n* Grand Prize (大賞, Taishō)  Trace Paper (ECC Computer College / Trace Paper Mill; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Ultimate Selfie (ECC Computer College / Shunsuke Shibata; PC)\n** DOOR (Vantan Game Academy Tokyo School / Door Construction Company; PC)\n** Trace Paper (ECC Computer College / Trace Paper Mill; PC)\n** Pakuroll (International College of Automotive Technology / Team \"Pakuroll\"; PC)\n** Pixmash (HAL Nagoya / Explon; Mobile)\n* Honorable Mentions (佳作, Kasaku)\n** Scrap Factory (ECC Computer College / Team Scrap Factory; PC)\n** TWIN CANDLES (Nippon Engineering College / Yuta Takagi; PC)\n** Hasame Piyo-chan (ECC Computer College / Piyo-chan Protection Group; PC)\n** Pechantet (HAL Osaka / By yourself!!; Mobile)\n* Individual Award (個人賞, Kojin-shō)  Ultimate Selfie (ECC Computer College / Shunsuke Shibata; PC)\nMinister of Economy, Trade and Industry Award\n* The Pokémon Go'' project team, represented by Setsuto Murai, Japan Country Manager at Niantic Inc., and Tsunekazu Ishihara, president and CEO of The Pokémon Company.\nJapan Game Awards 2018\nThe main ceremony was held on September 20, 2018 at the Tokyo Game Show venue, in which the \"Games of the Year\" and \"Minister of Economy, Trade and Industry\" awards were announced. On September 22, 2018 the \"Amateur Division\" awards were handed out, and on September 23, 2018 the \"Future Division\" awards were announced. Games eligible were those released in the Japanese fiscal year 2018 (between April 1, 2017 and March 31, 2018). A new \"U18 Division\" was introduced in this edition, intended to award game creators under the age of 18.\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Fumito Ueda, Yojiro Ogawa, Hideki Kamiya, Kazuyoshi Odaka, Masahiro Sakurai, Shu Takumi, Keiichiro Toyama and Hidetaka Miyazaki.\nThe following categories were awarded:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Monster Hunter: World (Capcom; PlayStation 4, PC)'\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  Gorogoa (Annapurna Interactive; Nintendo Switch, Xbox One, Mobile, PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Undertale (8-4 Ltd; PlayStation 4, PlayStation Vita, Nintendo Switch, PC)\n** Call of Duty: WWII (Sony Interactive Entertainment; PlayStation 4, Xbox One, PC)\n** Super Mario Odyssey (Nintendo; Nintendo Switch)\n** Splatoon 2 (Nintendo; Nintendo Switch)\n** Xenoblade Chronicles 2 (Nintendo; Nintendo Switch)\n** Dragon Quest XI (Square Enix; PlayStation 4, Nintendo 3DS)\n** Fate/Grand Order (Aniplex Inc; Mobile)\n** Fortnite (Epic Games; PlayStation 4, Nintendo Switch, Xbox One, Mobile, PC, Mac)\n** ''PlayerUnknown's Battlegrounds (PUBG Corporation; PC, Xbox One)\n** Pokémon Ultra Sun and Ultra Moon (The Pokémon Company; Nintendo 3DS)\n** Monster Hunter: World (Capcom; PlayStation 4, PC)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Dragon Quest XI (Square Enix; PlayStation 4, Nintendo 3DS)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  The Legend of Zelda: Breath of the Wild (Nintendo; Nintendo Switch, Wii U)\n** Overseas Works (海外作品, Kaigai sakuhin)  Call of Duty: WWII (Activision / Sledgehammer Games; PlayStation 4, Xbox One, PC)\nFuture Division\n* Ace Combat 7: Skies Unknown (Bandai Namco; PlayStation 4, Xbox One, PC)\n* Kingdom Hearts III (Square Enix; PlayStation 4, Xbox One)\n* Call of Duty: Black Ops 4 (Sony Interactive Entertainment; PlayStation 4)\n* God Eater 3 (Bandai Namco; PlayStation 4, PC)\n* Judgement (Sega; PlayStation 4)\n* Jump Force (Bandai Namco; PlayStation 4, Xbox One)\n* Sekiro: Shadows Die Twice (FromSoftware; PlayStation 4, Xbox One, PC)\n* Devil May Cry 5 (Capcom; PlayStation 4, Xbox One, PC)\n* Dragon Quest Builders 2 (Square Enix; PlayStation 4, Nintendo Switch)\n* Resident Evil 2 (Remake) (Capcom; PlayStation 4, Xbox One, PC)\n* Mega Man 11 (Capcom; PlayStation 4, Nintendo Switch, Xbox One, PC)\nAmateur Division\n* Grand Prize (大賞, Taishō)  Glalear (HAL Osaka / TINY MAD KID; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Glalear (HAL Osaka / TINY MAD KID; PC)\n** Silhouette (HAL Osaka / White Company; PC)\n** Trickle (Japan Electronics College / teamTrickle; PC)\n** Projection (Waseda Literature and Science College / Team Projection; PC)\n** PROJECTION REMAINS (Nippon Engineering College / Tonkotsu ramen; PC)\n** Mass Shift (HAL Osaka / Gorillas and their funny keepers; PC)\n* Honorable Mentions (佳作, Kasaku)\n** Reflection (Nippon Engineering College / Team Nature Lovers; PC)\n** DarkRoad (ECC Computer College / Team DarkRoad; PC)\n** Destruction (Kobe Electronics College / The person who makes the game; PC)\n** Take a photo! (HAL Osaka / Green foxtail; PC)\n** Near or Far (ECC Computer College / Project Near or Far; PC)\n** Pettamp (ECC Computer College / Pettamproject; PC)\nU18 Division\n* Gold Award (金賞, Kinshō)  Mochiage Girl (Watanabe Taisei, Tokushima Municipal High School)\n* Silver Award (銀賞, Ginshō)  Why does this have to happen to me? (Hayato Ikegami, Yokohama Municipal Utsukusigaka Elementary School)\n* Bronze Award (銅賞, Dōshō)  THE REALITY'' (Takeru Furukata, Okinawa National College of Technology)\nMinister of Economy, Trade and Industry Award\n* The Nintendo Switch development team at Nintendo.\nJapan Game Awards 2019\nThe 2019 edition was held on September 12, 14 and 15, 2019, during that year's Tokyo Game Show. Games eligible were those released during the Japanese fiscal year 2019 (between April 1, 2018 and March 31, 2019).\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Yojiro Ogawa, Hideki Kamiya, Kazutaka Kodaka, Masahiro Sakurai, Shu Takumi, Keiichiro Toyama and Hidetaka Miyazaki.\nThe following winners were announced:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Super Smash Bros. Ultimate (Nintendo; Nintendo Switch)'\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  Astro Bot Rescue Mission (Sony Interactive Entertainment; PlayStation 4 with PlayStation VR)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Apex Legends (Electronic Arts; PlayStation 4, Xbox One, PC)\n** Kingdom Hearts III (Square Enix; PlayStation 4, Xbox One)\n** Judgement (Sega; PlayStation 4)\n** Sekiro: Shadows Die Twice (FromSoftware; PlayStation 4, Xbox One, PC)\n** Super Smash Bros. Ultimate (Nintendo; Nintendo Switch)\n** Detroit: Become Human (Sony Interactive Entertainment; PlayStation 4)\n** Devil May Cry 5 (Capcom; PlayStation 4, Xbox One, PC)\n** Dragon Quest Builders 2 (Square Enix; PlayStation 4, Nintendo Switch)\n** Resident Evil 2 (Remake) (Capcom; PlayStation 4, Xbox One, PC)\n** ''Marvel's Spider-Man (Sony Interactive Entertainment; PlayStation 4)\n** Megiddo 72 (DeNA; Mobile)\n* Special Award (特別賞, Tokubetsu-shō)  Nintendo Labo (Nintendo; Nintendo Switch)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Super Smash Bros. Ultimate (Nintendo; Nintendo Switch)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Super Smash Bros. Ultimate (Nintendo; Nintendo Switch)\n** Overseas Works (海外作品, Kaigai sakuhin)  Red Dead Redemption 2 (Rockstar Games; PlayStation 4, Xbox One)\nFuture Division\n* Cyberpunk 2077 (Spike Chunsoft; PlayStation 4, Xbox One, PC)\n* 13 Sentinels: Aegis Rim (Atlus; PlayStation 4)\n* New Sakura Wars (Sega; PlayStation 4)\n* Death Stranding (Sony Interactive Entertainment; PlayStation 4)\n* Dragon Quest XI S (Square Enix; Nintendo Switch)\n* Nioh 2 (Koei Tecmo; PlayStation 4)\n* Final Fantasy VII Remake (Square Enix; PlayStation 4)\n* Resident Evil: Resistance (Capcom; PlayStation 4, Xbox One, PC)\n* Persona 5 Royal (Atlus; PlayStation 4)\n* Atelier Ryza: Ever Darkness & the Secret Hideout (Koei Tecmo; PlayStation 4, Nintendo Switch, PC)\n* Yakuza: Like a Dragon (Sega; PlayStation 4)\nAmateur Division\n* Grand Prize (大賞, Taishō)  ORBITS (HAL Tokyo / OVERWORKS; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Overlay (Nagoya Institute of Technology / TeamKoide; PC)\n** ORBITS (HAL Tokyo / OVERWORKS; PC)\n** GLOBE (HAL Tokyo / POTATO CORN; PC)\n** Steam engine mechanism (HAL Tokyo / MAD SIX; PC)\n** Constellation Drop (HAL Osaka / Anonymous Ifrit; PC)\n* Honorable Mentions (佳作, Kasaku)\n** Asteroad (Waseda University / Asterode; PC)\n** Tsunagu Star Line (ECC Computer College / Power; PC)\n** PlutoMachina (Human Academy Hiroshima School / Clockwork Pluto; PC)\n** Star Pin (Trident Computer College / Capybara Team; PC)\n** ☆Venture (HAL Tokyo / GOD YOUSUKE; PC)\nU18 Division\n* Gold Award (金賞, Kinshō)  Shuriken Jump (Ikegami Hayato, Utsukusigaka Elementary School, Yokohama, Kanagawa Prefecture)\n* Silver Award (銀賞, Ginshō)  Overturn (Matsuda Itsuru, Hakodate La Salle High School)\n* Bronze Award (銅賞, Dōshō)  A Planet That Doesn't Know Morning (Umemura Jikuu, N High School)\nMinister of Economy, Trade and Industry Award\n* The Super Smash Bros.'' Project Team.\nJapan Game Awards 2020\nDue to the COVID-19 pandemic, the 2020 edition of both the Tokyo Game Show and the Japan Game Awards were carried out through online presentations. The award cerenomies were streamed on September 26 and 27, 2020. The \"Future Division\" awards were not presented in this edition due to the online nature of Tokyo Game Show 2020. For awarded categories, games eligible were those released during the Japanese fiscal year 2020 (between April 1, 2019 and March 31, 2020).\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Yojiro Ogawa, Hideki Kamiya, Kazutaka Kodaka, Masahiro Sakurai, Shu Takumi, Keiichiro Toyama, Hidetaka Miyazaki and Yoko Taro.\nThe following winners were announced:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Animal Crossing: New Horizons (Nintendo; Nintendo Switch)'\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  Baba Is You (Hempuli; Nintendo Switch, PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Animal Crossing: New Horizons (Nintendo; Nintendo Switch)\n** 13 Sentinels: Aegis Rim (Atlus; PlayStation 4)\n** Death Stranding (Sony Interactive Entertainment; PlayStation 4, PC)\n** Nioh 2 (Koei Tecmo; Nintendo Switch)\n** Fire Emblem: Three Houses (Nintendo; Nintendo Switch)\n** Persona 5 Royal (Atlus; PlayStation 4)\n** Pokémon Sword and Shield (The Pokémon Company; Nintendo Switch)\n** Monster Hunter World: Iceborne (Capcom; PlayStation 4, Xbox One, PC)\n** Yakuza: Like a Dragon (Sega; PlayStation 4)\n** Ring Fit Adventure (Nintendo; Nintendo Switch)\n* Special Award (特別賞, Tokubetsu-shō)  Dragon Quest Walk (Square Enix; Mobile)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Pokémon Sword and Shield (The Pokémon Company; Nintendo Switch)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Pokémon Sword and Shield (The Pokémon Company; Nintendo Switch)\n** Overseas Works (海外作品, Kaigai sakuhin)  Call of Duty: Modern Warfare (Activision / Infinity Ward; PlayStation 4, Xbox One, PC)\nAmateur Division\n* Grand Prize (大賞, Taishō)  OVEROIL CRABMEAT (ECC Computer College / CRAB; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** OVEROIL CRABMEAT (ECC Computer College / CRAB; PC)\n** ShakaBomb (Trident Computer College / ShakaBombs; PC)\n** bluem (Nagoya University / jack; PC)\n** Path Geyser (HAL Nagoya / ProjectGG; PC)\n** ''Radio's Great Escape (HAL Osaka / Gaba; PC)\n* Honorable Mentions (佳作, Kasaku)\n** Amazulu (Tokyo Design Technology Center College / Amazulu; PC)\n** Water Carry (ECC Computer College / Rain or shine; PC)\n** Cravity (HAL Tokyo / ON PRODUCTION; PC)\n** Spratch (HAL Osaka / sabaEater; PC)\n** Diver (Nippon Engineering College / Tanaka Group; PC)\n** Volcanon (HAL Tokyo / Tokushin Research Institute; PC)\nU18 Division\n* Gold Award (金賞, Kinshō)  Rabi and Navi's Great Adventure (Hidehiko Fujisawa, Shibaura Institute of Technology Senior High School)\n* Silver Award (銀賞, Ginshō)  void (Shun Natsume, Shizuoka Prefectural Iwata Minami High School)\n* Bronze Award (銅賞, Dōshō)  The Tears and End of the Karakuri Girl (Haruya Goda, Kanagawa Prefectural Kanagawa Comprehensive High School) and ROLL THE DICE (Reo Ueda, Suginami Ward Higashihara Junio High School) (shared award)\nMinister of Economy, Trade and Industry Award\n* The Animal Crossing: New Horizons'' development team at Nintendo.\nJapan Game Awards 2021\nDue to the COVID-19 pandemic, the 2021 edition of both the Tokyo Game Show and the Japan Game Awards were carried out through online presentations. The award cerenomies were streamed on October 2 and 3, 2021. The \"Future Division\" awards were again not presented in this edition. Games eligible were those released during the Japanese fiscal year 2021 (between April 1, 2020 and March 31, 2021).\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Yojiro Ogawa, Hideki Kamiya, Kazutaka Kodaka, Masahiro Sakurai, Shu Takumi, Keiichiro Toyama and Yoko Taro.\nThe following winners were announced:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Ghost of Tsushima (Sony Interactive Entertainment; PlayStation 4) and Monster Hunter Rise (Capcom; Nintendo Switch)' (shared award)\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  Mario Kart Live: Home Circuit (Nintendo; Nintendo Switch)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Umamusume: Pretty Derby (Cygames; Mobile, PC)\n** Genshin Impact (MiHoYo; Mobile, PC, PlayStation 5, PlayStation 4)\n** Ghost of Tsushima (Sony Interactive Entertainment; PlayStation 4)\n** Sakuna: Of Rice and Ruin (Marvelous; Nintendo Switch, PlayStation 4, PC)\n** Resident Evil 3 Remake (Capcom; PlayStation 4, Xbox One, PC)\n** Buddy Mission Bond (Nintendo; Nintendo Switch)\n** Final Fantasy VII Remake (Square Enix; PlayStation 4)\n** Momotaro Dentetsu: Showa, Heisei, Reiwa Mo Teiban! (Konami; Nintendo Switch)\n** Monster Hunter Rise (Capcom; Nintendo Switch)\n** The Last of Us Part II (Sony Interactive Entertainment; PlayStation 4)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Momotaro Dentetsu: Showa, Heisei, Reiwa Mo Teiban! (Konami; Nintendo Switch)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Animal Crossing: New Horizons (Nintendo; Nintendo Switch)\n** Overseas Works (海外作品, Kaigai sakuhin)  Call of Duty: Black Ops Cold War (Activision / Treyarch, Raven Software; PlayStation 5, PlayStation 4, Xbox One, S, PC)\nAmateur Division\n* Grand Prize (大賞, Taishō)  Uni Laboratory (HAL Osaka / ※The staff enjoyed the food; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Uni Laboratory (HAL Osaka / ※The staff enjoyed the food; PC)\n** Orihime (HAL Tokyo / Komoheri -Common Heritage-; PC)\n** Shirokuro Connect (HAL Osaka / Listing Jar; PC)\n** Dungeon Inversion (HAL Nagoya / Baby's Monologue; PC)\n** PARADOGS (Waseda Literature and Science College / Kazuhiro Tanoue; PC)\n** LUMINO La ruta naturaL (HAL Nagoya / Table Punch; PC)\n* Honorable Mentions (佳作, Kasaku)\n** Mirror Girl (HAL Osaka / desire for sleep; PC)\n** Confettia (HAL Tokyo / Non and Nobu; PC)\n** Tsukikage (HAL Tokyo / FM Tokushin Research Institute; PC)\n** Reverse Room (Nagoya Institute of Technology / Shunya Suzuki; PC)\nU18 Division\n* Gold Award (金賞, Kinshō)  Balloon Head (Taro Furuichi, Aichi Prefectural Aichi Comprehensive Technical High School)\n* Silver Award (銀賞, Ginshō)  Tuna Planet (Noboru Yamaguchi, Kadokawa Dwango Gakuen N High School)\n* Bronze Award (銅賞, Dōshō)  AGARES (Takahiro Kumbuchi, Yuji Fujiwara and Yuga Kumazawa, Kobe Municipal High School of Science and Technology)\nMinister of Economy, Trade and Industry Award\n* Kou Shibusawa, co-founder of Koei Tecmo.\nJapan Game Awards 2022\nThe 2022 edition was held on September 15, 17 and 18, 2022, during that year's Tokyo Game Show. Games eligible were those released during the Japanese fiscal year 2019 (between April 1, 2018 and March 31, 2019).\nThe judges for this edition's \"Game Designers Awards\" were Kazutoshi Iida, Jiro Ishii, Hideki Kamiya, Kazutaka Kodaka, Masahiro Sakurai, Shu Takumi, Keiichiro Toyama and Yoko Taro.\nThe following winners were announced:\nGames of the Year Division\n* 'Grand Prize (大賞, Taishō)  Elden Ring (FromSoftware; PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, PC)'\n* Game Designers Award (ゲームデザイナーズ大賞, Gēmudezaināzu taishō)  Inscryption (Daniel Mullins Games; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Elden Ring (FromSoftware; PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, PC)\n** Ghostwire: Tokyo (Bethesda Softworks; PlayStation 5, PC)\n** Sky: Children of the Light (Thatgamecompany; Mobile, Nintendo Switch)\n** Tales of Arise (Bandai Namco; PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, PC)\n** Resident Evil Village (Capcom; PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, PC)\n** Final Fantasy XIV: Endwalker (Square Enix; PlayStation 5, PlayStation 4, PC, Mac)\n** Kirby and the Forgotten Land (Nintendo; Nintendo Switch)\n** Pokémon Legends: Arceus (The Pokémon Company; Nintendo Switch)\n** Horizon Forbidden West (Sony Interactive Entertainment; PlayStation 5, PlayStation 4)\n** Lost Judgement (Sega; PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, Amazon Luna)\n* Best Sales Award (ベストセールス賞, Besutosērusu-shō)  Pokémon Brilliant Diamond and Shining Pearl (The Pokémon Company; Nintendo Switch)\n* Global Award (グローバル賞, Gurōbaru-shō)\n** Japanese Works (日本作品, Nihon sakuhin)  Pokémon Brilliant Diamond and Shining Pearl (The Pokémon Company; Nintendo Switch)\n** Overseas Works (海外作品, Kaigai sakuhin)  Call of Duty: Vanguard (Activision / Sledgehammer Games / Treyarch; PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, PC)\nFuture Division\n* A Space for the Unbound (Chorus Worldwide; Nintendo Switch, PlayStation 5, PlayStation 4, Xbox One, PC)\n* Wo Long: Fallen Dynasty (Koei Tecmo; PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, PC)\n* Exoprimal (Capcom; PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, PC)\n* Street Fighter 6 (Capcom; PlayStation 5, PlayStation 4, Xbox Series X|S, PC)\n* Sonic Frontier (Sega; Nintendo Switch, PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, PC)\n* Final Fantasy XVI (Square Enix; PlayStation 5)\n* Forspoken (Square Enix; PlayStation 5, PC)\n* Atelier Ryza 3: Alchemist of the End & the Secret Key (Koei Tecmo; Nintendo Switch, PlayStation 5, PlayStation 4, PC)\n* Like a Dragon: Ishin! (Sega; PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, PC)\n* Mega Man Battle Network Legacy Collection (Capcom; Nintendo Switch, PlayStation 4, PC)\nAmateur Division\n* Grand Prize (大賞, Taishō)  Peeling off (HAL Osaka / Sambal tries his best; PC)\n* Award for Excellence (優秀賞, Yūshū-shō)\n** Gear clunk (HAL Osaka / NEW★GENERATIONS!!; PC)\n** ZiParate (HAL Osaka / O. Depressa; PC)\n** Super Kobu Shidenaguruchan (HAL Nagoya / Rainbow colored spiral dragon; PC)\n** Peeling off (HAL Osaka / Sambal tries his best; PC)\n** Follow You (HAL Tokyo / Svea; PC)\n* Honorable Mentions (佳作, Kasaku)\n** Alice in WindowLand (Nagoya Institute of Technology / Dynamite KOYO's; PC)\n** Thunder Roar (HAL Tokyo / BAMBooooooooooooooooN; PC)\n** DragKnockFight (Nippon Engineering College / DAN5; PC)\n** HOW TO DIE. (ECC Computer College / Well Digging Team; PC)\n** Procyon (HAL Tokyo / Spring and Brightness; PC)\nU18 Division\n* Gold Award (金賞, Kinshō)  Large Warehouse Company (Ken Kitamura, Doshisha High School)\n* Silver Award (銀賞, Ginshō)   (Yusuke Nakata, Tokyo Metropolitan Komatsugawa High School)\n* Bronze Award (銅賞, Dōshō)  Slime (Yoji Shimodaira, Tokyo Metropolitan Komae High School)\n* Collaboration Platform Award (コラボレーションプラットフォーム賞, Koraborēshonpurattofōmu-shō)  Impulse Ball (Yamaki Miryu, Sendai Municipal Nishitaga Junior High School; created on Game Builder Garage on Nintendo Switch)\nMinister of Economy, Trade and Industry Award\n* Hidetaka Miyazaki, video game director, designer, writer, president of FromSoftware, creator of the ''Demon's Souls, Dark Souls, Bloodborne, Sekiro and Elden Ring series.\nJapan Game Awards 2023\nPeriod: April 1, 2022, and March 31, 2023.\n*Grand Prize  Monster Hunter Rise: Sunbreak (Capcom; Nintendo Switch, PS4, PS5, Xbox One, Xbox Series X/S, PC)\n*Game Designer Prize  RPG Time: The Legend of Wright\n*Excellence Awards  Crisis Core: Final Fantasy VII Reunion, God of War Ragnarök, Splatoon 3, Xenoblade Chronicles 3, Sonic Frontiers, Earth Defense Force 6, Resident Evil 4, Paranormasight: The Seven Mysteries of Honjo, Hogwarts Legacy, Pokémon Scarlet and Violet, Monster Hunter Rise: Sunbreak\n*Best Sales Award  Pokémon Scarlet and Violet\n*The Minister of Economy, Trade and Industry Award  Family Computer\nJapan Game Awards 2024\nPeriod: April 1, 2023 - March 31, 2024.\n*Grand Prize  The Legend of Zelda: Tears of the Kingdom (Nintendo; Nintendo Switch)\n*Game Designer Prize  Viewfinder (video game) (Sad Owl Studios; PlayStation 4, PlayStation 5, PC)\n*Award for Excellence  Armored Core VI: Fires of Rubicon, Super Mario Bros. Wonder, Street Fighter 6, The Legend of Zelda: Tears of the Kingdom, Dragon's Dogma 2, Final Fantasy XVI, Final Fantasy VII Rebirth, Persona 3 Reload, Unicorn Overlord, Like a Dragon: Infinite Wealth, Like a Dragon Gaiden: The Man Who Erased His Name\n*Breakthrough Award  The Exit 8 (Kotake Create; PC, Meta Quest, Nintendo Switch, PlayStation 4, PlayStation 5)\n*Movement Award  Suika Game (Aladdin X Inc.; iOS, Android, Nintendo Switch)\n*Special Award  Street Fighter 6 (Capcom; PlayStation 4, PlayStation 5, PC, Xbox Series X/S, Arcade)\n*Best Sales Award  The Legend of Zelda: Tears of the Kingdom (Nintendo; Nintendo Switch)\nJapan Game Awards 2025\nPeriod: April 1, 2024 - May 31, 2025.\n*Grand Prize  Metaphor: ReFantazio (Atlus; Xbox Series X/S, PC, PlayStation 5, PlayStation 4)\n*Game Designer Prize  INDIKA (Odd Meter; PlayStation 5, Xbox Series X/S, PC)\n*Award for Excellence  Elden Ring Nightreign, Tokyo Xtreme Racer, Dynasty Warriors: Origins, Urban Myth Dissolution Center, Dragon Quest III HD-2D Remake, The Hundred Line: Last Defense Academy, Fantasy Life i: The Girl Who Steals Time, Metaphor: ReFantazio, Monster Hunter Wilds, Like a Dragon: Pirate Yakuza in Hawaii, Romancing SaGa 2: Revenge of the Seven\n*Breakthrough Award  Clair Obscur: Expedition 33 (Kepler Interactive; PlayStation 5, Xbox Series X/S, PC)\n*Movement Award  Pokémon Trading Card Game Pocket'' (The Pokémon Company; iOS, Android)\n*Special Award  PlayStation Store (Sony Interactive Entertainment)\n*The Minister of Economy, Trade and Industry Award  Nintendo Switch 2 (Nintendo)\nReferences\nExternal links\n*[http://awards.cesa.or.jp/en/index.html Official website]"
    }
  ]
}