{
  "content": [
    {
      "type": "text",
      "text": "# Jarrahdale to Rockingham railway line\n\n| old_gauge        =\n| electrification =\n| speed_km/h =\n| signalling =\n| trainprotection =\n| map =\n| map_state =\n| embedded =\n|  zoom = 10\n|   float = right\n|    nolabels = 1\n|     width = 340\n|     height = 200\n| title = Jarrahdale to Rockingham railway line\n| caption =\n| shapeD=n-circle\n| shape-colorD=dark blue\n| shape-outlineD=white\n| label-colorD = dark blue\n| label-sizeD = 12\n| label-posD = left\n| label-offset-xD =\n| label-offset-yD =\n| label1 = Jarrahdale\n| mark-coord1 =\n| mark-title1 = Jarrahdale\n| label2 = Mundijong\n| label-pos2 = right\n| mark-coord2 =\n| mark-title2 = Mundijong\n| label3 = Rockingham\n| label-pos3 = right\n| mark-coord3 =\n| mark-title3 = Rockingham\n}}\n}}\nThe Jarrahdale to Rockingham railway line was a private timber railway line connecting the timber mill at Jarrahdale with the port at Rockingham. It was the second railway line to operate in Western Australia, opening in 1872. From 1893, it connected to the South Western Railway at Mundijong. The section from Mundijong to Rockingham was removed in 1950 but the Jarrahdale to Mundijong section remained in operation until 1962.\nHistory\nAs a solution to the financial difficulties the Western Australian timber industry suffered during the 1860s, the state's governor, Frederick Weld, proposed awarding large timber concessions on attractive terms to attract investment from the eastern states of Australia.\nOf the three timber concession made by Weld, the one at Jarrahdale was the largest, at . As part of the concession to a syndicate from Ballarat, Victoria, it was agreed that a mill would be established at Jarrahdale, a port at Mangles Bay and a railway line to connect the two. The mill started operations in May 1872 and the railway line opened in November that year.\nThe Governor Weld became the second steam locomotive to operate in the colony of Western Australia, after the Ballaarat, which had been in use at Wonnerup since 1871, and it became the first locomotive to operate in the Perth metropolitan area. A rubber-tyre steam traction engine, the first used in the colony, hauled the Governor Weld overland to Jarrahdale but the locomotive proved too heavy for the line and caused damage to the rail. Consequently, until a lighter locomotive arrived in 1874, teams of horses were used to haul timber to the coast. The original rails were made from timber and replaced with steel ones in 1878.\nThree jetties for the timber export were constructed in Rockingham, the first deep water one in 1872, a second one in 1882, east of the existing one, and the third one in 1898. By the 1930s, the first two jetties had degraded considerably. Only one of the three jetties was retained and reconstructed in 1950, after the removal of the rails and a shift to tourism in Rockingham. This final jetty was eventually removed in 2009.\nThe railway line made Rockingham Western Australia's main timber port in the 1880s, and its efficiency allowed it to survive a slump in the state's timber industry during the mid-1880s. In its first two decades of operation, the timber operation experienced three changes of ownership and fluctuating profits. In the 1890s, the Jarrahdale operation expanded considerably under manager Alex Munro and the third jetty was built at Rockingham to allow for a large export order of jarrah sleepers to South Africa. Additionally, timber was also exported to cities in Britain, which used it for hardwood paving blocks.\nFierce competition between the eight largest timber operators in the 1890s eventually resulted in the merger of the eight into Millars' Karri and Jarrah Co. in 1902. The opening of the South Western Railway in 1893, connecting Perth to Bunbury, meant the two lines interconnected at Jarrahdale Junction, now Mundijong. This allowed timber to be transported directly to Perth, which now became the main market for the Jarrahdale mill, while exports were now handled by the port at Bunbury and supplied by other operations.\nIn the 1880s and, again, in the 1920s as part of the Peel Estate scheme, it was proposed to build a railway from Fremantle to Rockingham, where it would connect to the existing line to Jarrahdale, a scheme never carried out.\nThis arrangement caused the Rockingham line to decline in importance and the last shipment of timber from there took place in 1908. When the state's timber industry experienced another boom in the 1920s, timber from Jarrahdale was shipped through Bunbury. The line to Rockingham did however remain in use for firewood supplies, allowing Millars to retain the rights to operate the railway. The final firewood train to Rockingham operated in 1940 and the line from Mundijong to the port was removed in 1950. In 1950, the state government purchased the railway line for £A 350, to pull it up and build roads and drainage in its corridor.\nThe Jarrahdale to Mundijong section was retained longer, finally ceasing operations in November 1962, after 90 years. This made it the longest-operating timber railway in Western Australia.\nA new railway line, to transport bauxite from Jarrahdale to Kwinana, was built to replace the timber railway and follows the old line in many places.\nLegacy\nAt the Rockingham end of the former railway, no visible remains are preserved but the pathway of the former line is still visible. At the Rockingham foreshore, the final run up to the jetty was on what is now Railway Terrace. The City of Rockingham's heritage list includes the sites of the three timber jetties and the timber railway site.\nIn the Shire of Serpentine-Jarrahdale, the former line is on the shire's heritage list. East of the South Western Highway, parts of the former line are still visible while others have been taken up by the bauxite railway.\nReferences\nExternal links\n* [https://www.jarrahdale.com/a-history-of-jarrahdale-western-australia/ Jarrahdale Heritage Society: A History of Jarrahdale]"
    }
  ]
}