{
  "content": [
    {
      "type": "text",
      "text": "# Jasper Warner\n\n| birth_place = Assen, Drenthe, Netherlands\n| death_date =\n| death_place = Oldebroek, Gelderland, Netherlands\n| resting_place =\n| citizenship = Spanish\n| known_for = President of the Royal Dutch Football Association\n| occupation =\n}}\n}}\nJasper Warner (5 February 1870 – 27 June 1942) was a Dutch Sports executive and entrepreneur. He is regarded as one of the most important figures in the sporting history of the Netherlands.\nIn his hometown of Zwolle, Warner was co-founder and first chairman of the Zwolsche Athletic Club (ZAC) in 1893. In December of that year, he joined the board of the Dutch football and Athletic Association (NVB), which would later become the Royal Dutch Football Association (KNVB). He then served as KNVB's president for more than 20 years between 1897 and 1919. It was under his administration that the leadership of the Association was centralized and professionalized, resulting in spectacular growth for Dutch football. He played a crucial role in the creation of several sports umbrella organizations such as FIFA in 1904, the Royal Dutch League for Physical Education (NBvLO) in 1908, and the Netherlands Olympic Committee (NOC) in 1912. He even joined the 1928 Committee, which was charged with organizing the Amsterdam Olympic Games. After this event, he distanced himself from the sport and focused on the economic field. He was also co-founder of the Hattemsche Golf & Country Club.\nEarly life\nJasper Warner was born on 5 February 1870 in Assen as the son of Johannes Adrianus Warner, a worked as an iron founder in the Drenthe capital, and Jantien van Opijnen. After his mother's death in 1875, at the age of only 31 years old, the family moved to Zwolle, his father's hometown. Jasper visited the HBS, which introduced him to sports, and he has been passionate about them ever since. In 1881, his father was promoted from an Iron foundry's worker to factory boss at the Zwolle iron foundry Wispelwey, which greatly improved the social position of his father, thus now making it possible for Jasper, who could study well, to go to the HBS in Zwolle. His younger brother Theodorus Leonardus was less fortunate as he died on 1 July 1891, a month before. Jasper's own father died on 20 March 1896, when he was 26.\nSporting career\nLocal sports\nAt the HBS, Warner developed a fascination for sports, hence being an active athlete as a schoolboy. His first passion was rowing, and thus, when he achieved his school certificate and a job at a trade office, the young Warner then bought himself a skiff, with which he could be found on the Zwartewater, weather permitting. He was therefore involved in the foundation of the Zwolsche Zeil, a sailing club, in 1887, being its first chairman. His interest in rowing naturally translated into a renowned interest in sailing. With a so-called sherpie, a flat-bottomed center sword ship, he often participated in competitions on the . From 1904 he made long trips during his vacations on the Wadden, where he also went on hunt seals.\nWarner developed an interest in football almost as soon as it was introduced in Zwolle by Pim Adrian, who had been sent to the capital of Overijssel by his father, a well-known gymnastics teacher in Amsterdam, to quietly retire at the HBS. On 1 October 1893, he was co-founder and first chairman of the . That founding meeting was in the clubhouse of ZRZV. This club fielded several different sports such as hockey and football. Little is known about the first ten years of Zwolle's oldest football club because the archive literally went up in flames in a fire at the house of the club secretary J.H. Deibel. In the club's very first season, Warner played as a 'half-back' in the ZAC team, in a kind of mini competition with PW from Enschede and Celeritas from Kampen. On 26 December 1893, he joined the board of the Dutch Football and Athletic Association (NVB), which would later become the Royal Dutch Football Association (KNVB). He then served as KNVB's president for more than 20 years between 1897 and 1919.\nBut besides playing football and rowing, Warner was also a fanatical skater, being the chairman of the Zwolle IJsclub (Zwolle Ice Club), boxing, and bandy, a kind of hockey on ice. Warner was a fan of bandy, and although he left that association in the late 1880s, he would still come into contact with field hockey again. For instance, he was involved in the foundation of the Dutch Hockey and Bandy Association on 13 October 1898 at the Hotel Krasnapolsky in Amsterdam, and became treasurer of the board. In 1902 Warner, among other people, tried to play hockey with sticks with a very long curl on a meadow behind the house of the Ten Doesschate family at Klein Wezenland. He was involved in the establishment of the Zwolle Mixed Hockey Club (ZMHC) on 10 December 1902, of which he also became the first chairman.\nChairman of KNVB\nOn 15 January 1898, the KNVB board chaired by Warner accepted the offer from Hak Holdert, who donated a cup for the winners of a tournament contested between those affiliated with the union. And thus, the next season in 1898–99 saw the first domestic cup competition takes place.\nIt was under his administration that the leadership of the Association was centralized and professionalized, resulting in spectacular growth for Dutch football. KNVB was one of the founding members of FIFA in 1904, one of the first non-British football associations in Europe.\nOn 26 December 1918, Warner marked exactly 25 years as a member of the board of the Dutch Football Association (NVB).\nHowever, the Dutch newspapers and the sports press, as well as the federation's board, were not informed about the upcoming silver jubilee of the then NVB chairman, and it was therefore forgotten. If they had been informed in time, then on 26 December in Zwolle, Warner would have become the center of a general tribute with speeches and authorities and flowers from unions and clubs, with gifts from friends, and with all sorts of beautiful, ostentatious, dignified gratitude. However, Warner did not like to be the center of attention and always remained modest, and thus, Warner celebrated the occasion by simply sending an invitation to his most intimate football friends to attend a festive dinner on 11 January 1919 in hotel De Oude Doelen in The Hague.\nLater years\nWarner even joined the 1928 Committee, which was charged with organizing the 1928 Olympic Games in Amsterdam. After this event, he distanced himself from the sport and focused on the economic field. He was also co-founder of the Hattemsche Golf & Country Club. Warner was also one of the first residents of Zwolle to receive a telephone connection.\nOther activities\nIn 1898, Warner, together with one of his childhood friends, M. van der Biesen, founded an agency and commission trade, as well as an insurance company in the field of agricultural risks, the Onderlinge Boerenbrandwaarborg Maatschappij. It would be the starting point of a very successful venture. Warner always combined his commercial activities with all kinds of functions in social life. Not only in sports, but especially in the economic field, such as the chairmanship of the Association of Chambers of Commerce in the Netherlands and membership of the Postal Council. During the First World War, when the Netherlands adopted a neutral position and remained outside the battlefield, but had to take into account disastrous scenarios, Warner was assigned a series of tasks by the government. Such as government commissioner for grain distribution in Overijssel and government commissioner for the Department of War to take care of the evacuated population of the coastal areas in the event of coastal evacuation.\nDeath\nWarner died in an institution in Oldebroek, where he had been staying because of his health. In 1957 Warner was the first footballer to have a street in the Netherlands named after him, along with Wim Anderiesen from Ajax and Top Rincker from RAP, after the city council of Amsterdam agreed to it on 20 July 1956, following a proposal to name streets after persons who had rendered service to the sport.\nReferences"
    }
  ]
}