{
  "content": [
    {
      "type": "text",
      "text": "# Jasrat's invasions of Delhi Sultanate\n\n}}\nKhokhars of Punjab\nAllied states: Kashmir Sultanate Sindh Sultanate\n| combatant2        =  Delhi Sultanate Kingdom of Jammu(1422–1423)\n| commander1        = Jasrat Khokhar\n| commander2        = Mubarak Shah IIMuhammad ShahBhim Dev\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n}}\n'''Jasrat's invasions of Delhi Sultanate''' (Punjabi: دلی سلطنت تے جسرت دے حملے , ਜਸਰਾਤ ਦੇ ਦਿੱਲੀ ਸਲਤਨਤ ਉੱਤੇ ਹਮਲੇ ) were a series of invasions led by the Punjabi Muslim warlord, Jasrat Khokhar in the region of Punjab (present-day India and Pakistan).\nPropagated by the anarchy due to the Timurid invasion, the invasions saw the decline and loss of Delhi Sultanate's control over Punjab until the reconquest by Bahlol Khan Lodi of the Lodi dynasty.\nJasrat's invasions resulted in constant chaos in the region of Punjab and instability in the regions of Jammu, Himachal Pradesh and Haryana.\nBackground\nIn 1420, a civil war erupted between Sultan of Kashmir, Ali Shah and the claimant to throne Shahi Khan. Ali Shah defeated Shahi Khan with the help of Bhim Dev, Raja of Jammu and his father-in-law, and expelled him from Kashmir. Shahi Khan went to Sialkot to ask Jasrat for help, who decided to support him. Hearing this, Ali Shah marched with his army to Sialkot. The two sides met at Thanna and in the ensuing battle, Ali Shah's army was routed and he was himself killed by Jasrat. This battle greatly increased the prestige and wealth of Jasrat. When the allied army reached Srinagar, dispute occurred between Shahi Khan and Jasrat as the latter intended to annex Kashmir into his own kingdom. Ultimately, both reached a friendship treaty according to which Shahi Khan would supply money and men to Jasrat for his conquest of Punjab. With the help of Jasrat, Shahi Khan was enthroned as Sultan Zayn al-Abidin.\nFirst invasion of Delhi Sultanate\nIn 1414, the Tughlaq dynasty was replaced by the Sayyid dynasty of Khizr Khan, who was either of Sayyid or Khokhar stock. However, he could not stop the decline of the sultanate. Jasrat envisioned to conquer Delhi, and after the death of Khizr Khan in May 1421, crossed the Ravi. He successively conquered Ludhiana and Jalandhar and proceeded to besiege Sirhind. In October 1421, Sultan Mubarak Shah marched against Jasrat, who after a skirmish at Rupar, retreated to his kingdom. Due to his old enmity with Jasrat, Raja Bhim Dev of Jammu greatly aided Mubarak Shah during his war. Bhim Dev also destroyed Jasrat's stronghold of Tilhar at Rajouri in January 1422. In May 1422, Jasrat again invaded the sultanate and this time besieged Lahore, but was unable to take it by storm. With the help of Raja Bhim, Delhi army invaded his domains and Jasrat again retreated in September 1422.\nInvasion of Jammu (1423)\nDue to the support Bhim Dev had been providing to the Delhi sultanate, Jasrat invaded Jammu in April 1423 and ravaged the region. Bhim Dev was killed in a battle and Jasrat married one of his daughters, as well as captured a large amount of wealth and arms from him. Following the conquest of Jammu, Manik Dev was appointed as new Raja.\nSecond and third invasion of Delhi Sultanate\nAfter the invasion of Jammu, Jasrat raised a contingent of Mongol mercenaries and sacked Dipalpur and plundered suburbs of Lahore, after which he returned with bounty to his domains as usual. In August 1428, Jasrat again marched against the Delhi sultanate. He besieged Kalanor, and completely sacked Jalandhar. However, he was defeated by governor of Lahore Sikander Tohfa at the bank of river Beas near Kangra and retreated to Tilhar, leaving the war spoils back. This failure disappointed Jasrat, who realised that he lacked sufficient power to conquer Delhi. Thus, he started negotiations with Shaikh Ali, the Timurid governor of Kabul. However, when Shaikh Ali ultimately invaded Punjab in 1430, Jasrat did not aid him, although many other Khokhar leaders, including his nephew Khajeka had joined Shaikh Ali.\nAfter Shaikh Ali was defeated by Delhi armies, Jasrat again invaded the sultanate in 1431. He conquered Jalandhar and defeated Sikander Tohfa, taking him away as captive. Sikander was released after paying heavy ransom. Jasrat next besieged Lahore for several months during 1431–32. By this time, the influence of Delhi Sultanate had diminished in Punjab, and the region was in the hands of Jasrat. By February 1432, Mubarak Shah moved with a large army against Jasrat and other rebels. Jasrat raised the siege of Lahore in July and left for Tilhar, although Jalandhar became part of his domains. Later, when the governor of Lahore Allahdad Kaka invaded Jasrat's territories in 1432 to re-gain charge of Jalandhar he was defeated at Bajwara and fled.\nAftermath\nIn 1431, Sikander Tohfa allied with Jasrat against the Afghans who had firmly based themselves at Sirhind. Jasrat and Sikander easily captured Sirhind, but Afghans had already left and moved to the hills. There many of them, including Bahlol Khan Lodi's relatives, were massacred by both and others were made captives. After 1436, Jasrat fought battles against the Lodi chief Bahlol Khan, who had re-established himself at Sirhind by bringing all Afghans under his banner. The alliance of Jasrat and Sikander saw success as Bahlol Khan was compelled to retreat towards the Siwalik foothills. But when Muhammad Shah left Delhi to invade Jasrat's domains in 1441 and appointed Bahlol Khan as governor of Sirhind to combat him, he made peace with Bahlol and advised him to capture the throne of Delhi for himself. Unlike Jasrat, who was viewed as an outsider by Delhi nobles, Bahlol was a part of the nobility and had better prospect of gaining the throne of Delhi. In return of his support, Bahlol ceded the region between Chenab and Jhelum (Chaj Doab) to Jasrat and agreed to not interfere in his territories. Sultan Zain-ul-Abidin acted as witness to the peace treaty between both.\nReferences"
    }
  ]
}