{
  "content": [
    {
      "type": "text",
      "text": "# Jay Wade Edwards\n\n| birth_place        = Lakeland, Florida, U.S.\n| education          = Bachelor's degree, Radio/Television/Film\n| alma_mater         = Auburn University\n| occupation         = Film director, TV producer, editor\n| years_active       = 1991–present\n| website            = https://www.jaywadeedwards.com\n}}\nJay Wade Edwards (born September 12, 1968) is an American film director, television producer and editor.\nJay Edwards started as professional television and film editor in 1991 after receiving a Bachelor's degree from Auburn University. He was a staff editor at Turner Studios before he joined Cartoon Network’s Adult Swim and worked as editor and producer on several series. He edited Space Ghost Coast to Coast, with Ned Hastings using recycled clips from the original series and reorganized them on the Avid non-linear editor, even animated lips, for a \"talk show\" style program. He was the senior editor and producer of the animated series, The Aqua Teen Hunger Force and for the feature Aqua Teen Hunger Force Colon Movie Film for Theaters. He also directed the live-action Assisted Living Dracula clip for Season 1's Bus of the Undead and was an occasional voice actor, using his own name. He also edits Squidbillies and Your Pretty Face Is Going to Hell for Adult Swim. Animation editor Brad Lee Zimmerman said about mentors, \"Jay Edwards, Ned Hastings, Dave Willis, and Matt Maiellaro are production cornerstones at Adult Swim and have been since it began.\"\nEdwards’s television credits include editing work on Disney's Gravity Falls, Wander Over Yonder, and Star vs. the Forces of Evil. He has also worked on documentaries for CNN and TBS, and numerous promotional campaigns.\nEdwards’ filmmaking career began when he wrote, directed, and edited three short science fiction films—Mountain of Terror Day of Dread (1998), Project: Tiki Puka Puka (1999), and Esta Noche We Ride! (2001)—known collectively as The Monster Trilogy. The Monster Trilogy has been shown at film festivals in Liverpool, England; Ontario, Canada; and Austin, Texas. Edwards has overseen promotion for the film, which has received positive reviews.\nEdwards co-produced and edited Y’all Come! The Hell Hole Swamp Festival, a 2002 documentary profiling Jamestown, South Carolina, home of the annual Hell Hole Swamp Festival. The film has screened in ten film festivals, including The Rural Route Film Festival in New York City, The Maryland Film Festival, and Detroit Docs, receiving two Best-of awards.\nThe beach-party rock-'n'-roll monster movie Stomp! Shout! Scream!, Edwards’s first feature film as writer/director, premiered at the Austin Film Festival in October 2005 to more good reviews. The film has gone on to screen at more than twenty film festivals. Awards include Best Feature Film at the Toofy Film Festival and The Magnolia Independent Film Festival, and nominations for Best Cinematography and Best Set Design at the B-Movie Film Festival. The movie has been distributed under the title Monster Beach Party.\nHe was selected as a juror for the 2011 Atlanta Film Festival.\nHis anthology web series, Kino-Edwards Picture Show, won Best Web Content at the 2016 Hollywood Reel Independent Film Festival.\nReferences\nExternal links\n*\n*\n* [https://austinfilmfestival.com/blog/news/gb-making-a-meatball-talk/ AFF Guest Blog: When the Day Job is Making a Meatball Talk] for Austin Film Festival"
    }
  ]
}