{
  "content": [
    {
      "type": "text",
      "text": "# Jayasimha II (Western Chalukya dynasty)\n\nJayasimha II (r. 1015 – 1043), also known as Jagadhekamalla I and Mallikamoda, succeeded his brother Vikramaditya V on the Western Chalukya throne. He had to fight on many fronts, against the Cholas of Tanjore in the south and the Paramara dynasty in the north, to protect his kingdom. His rule however was an important period of development of Kannada literature. The Brahmin Kannada writers Durgasimha (who was also his minister and wrote the Panchatantra, \"The five stratagems\", 1031), Chavundaraya II (encyclopaedia, Lokopakara, c. 1025) and Kavitavilasa were in his patronage. Chandraraja, a Brahmin writer on erotics (Madanatilaka, \"Forehead ornament of passion\", the earliest Kannada work in the genre of erotica, c. 1025) was in the court of Machiraja, a vassal of Jayasimha II. The Jain Sanskrit scholar Vadiraja was in Jayasimha II's court and wrote two epics, on logic, and a commentary on an earlier Jain text. His queen Suggaladevi was a disciple of the Kannada saint-poet Devara Dasimayya (one of the earliest Veerashaiva poets).\nAccording to the historians Chopra et al., this period saw Vengi fall firmly into the hands of the Cholas who would use their marital relations with the Eastern Chalukyas and their over lordship over Vengi to frustrate and threaten the Western Chalukyas from two fronts, from the east and from the South. However the historian Sen asserts that despite this reversal, this period saw the consolidation of the Western Chalukya power in the Deccan that would become a stepping stone towards the growth of the empire under the rule of Someshvara I, the successor of Jayasimha II.\nMalwa invasion\nThe Paramara dynasty King Bhoja of Malwa wanted to avenge the defeat of his predecessor Munja and invaded the Chalukya kingdom from the north and annexed the northern Konkan and Lata (in modern Gujarat) for a few years. Bhillama III, a vassal king of the Seuna (Yadava) dynasty of Devagiri (modern Daulatabad) rebelled against Jayasimha II, perhaps with support from Bhoja. The historian Sen feels this invasion may have been caused by the confederacy of Bhoja, the Kalachuri ruler Gangeyadeva and Rajendra Chola. But Jayasimha II dealt successfully with these invasions and rebellion to recover all his northern territories by c.1024. Bhillama III married a daughter of Jayasimha II as an act of peace.\nWars with Cholas\nDuring this period, Rajendra Chola was not only exerting control over the Vengi kingdom of the Eastern Chalukyas, he was also constantly trying to expand their kingdom northwards into the Western Chalukya territory. For a while the Cholas were preoccupied with their invasion of Ceylon (modern Sri Lanka) and with their territorial issues with the Pandyan Dynasty of Madurai, and the rulers of Kerala. Taking advantage of this confusion and with an intent of reducing Chola power in Vengi, Jayasimha II interfered in Vengi after the death of its incumbent King Vimaladitya and decided to install Vimaladitya's son of his choice, Vijayaditya II on the throne. Jayasimha II conquered Vijayawada Fort after defeating Cholas in the Battle of Vijayawada (1037 AD). He conquered Vengi in 1037 AD and placed Vijayaditya on Vengi throne. Vijayaditya initially did well with this support. This was against the plans of the Rajendra Chola who wanted Rajaraja Narendra, a prince born to Vimaladitya's queen from the Chola clan. To further strengthen himself, Jayasimha II had marched south of the Tungabhadra river and occupied Bellary, the Raichur Doab and perhaps part of Gangavadi (modern south-east Karnataka) as well. Jayasimha  II reconquered Gangawadi and Raichur from Cholas after the Battle of Maski. Rajendra Chola employed a two-pronged attack. One army going into the Vengi kingdom to successfully assist Rajaraja Narendra over his claims over the Vengi throne, and the other into the Western Chalukya kingdom itself. But the Chola army could not proceed any further and the Tungabhadra river remained the tacit border between the two empires. Chola inscriptions which say Jayasimha II was defeated in the battle of Masangi (Maski in modern Raichur district) in c.1021 were identified to be exaggerated. As per Kulenur inscription dated 1028 AD, Kalachuri king Gangadeva, Paramara king Bhoja and Rajendra Chola combined their forces to attack Jayasimha II from all three sides. The battle was fought on the banks of Godavari (Gautama Ganga). Jayasimha II beset and put to flight this confedaracy and with the help of Bachiraja, an officer under him, Jayasimha II defeated the allies.\nBattle of Kalidindi\nJayasimha II won the battle of Kalidindi against Cholas to place Vijayaditya VII on Vengi throne.\nWithout some powerful external help, Vijayaditya could not have overcome his brother and seized Vengi; and the only power which could have helped him in the enterprise was the Western Chalukya monarch of Kalyani. Therefore, the Karnataka or the Western Chalukya invasion of Vengi may be assigned to A.D. 1031, and the battle of Kalidindi where the Chola army encountered the Western Chalukyas to the succeeding year.\nWestern Chalukya general invaded Véngi and captured the city of Bezwada. The Karnataka invasion of Andhra (i.e., Véngi) and the battle described in the present record may have taken place during the same Western Chalukya expedition under Chávanarasa, especially as the distance between Bezwada and Kalidindi is less than 50 miles and victory was not secured by the Chola allies of Rajaraja.\nBattle of Ededore\nIn battle of Ededore, emperor Jayasimha II  defeated the Cholas and won back province from Chola emperor Rajendra Chola I which was lost earlier.\nNotes\nReferences\n*\n*\n*\n*\n*"
    }
  ]
}