{
  "content": [
    {
      "type": "text",
      "text": "# Jayce and the Wheeled Warriors__disambig_1\n\n| last_aired         =\n| num_episodes       = 65\n| num_seasons        = 1\n| executive_producer = Jean Chalopin  John Kemeny\n}}\nJayce and the Wheeled Warriors (French: Jayce et les Conquérants de la Lumière) is an animated show which was first broadcast on TF1 on September 9, 1985, on the block ''Salut les p'tits loups!'', and eventually on September 16 in the United States in syndication. It was produced by DIC Audiovisuel (originally distributed for syndication by SFM Entertainment) and animated by the Japanese animation studios Sunrise, Shaft, Studio Giants, Studio Look and Swan Production. The show, which ran for 65 thirty-minute episodes, was created to support Mattel's Wheeled Warriors toyline. The show had an ongoing plot which was left unresolved, with no series finale.\nThe show featured two duelling forces. The heroes are humans called the Lightning League who drive white and silver vehicles with assorted weaponry led by a teenager named Jayce. The villains are organic plant-based creatures called the Monster Minds who travel via large green organic vines, which can grow in and across interstellar space, and sprout seeds that grow rapidly into further Monster Minds. They are led by the very first of the Monster Minds, Saw Boss.\nBackground\nThe series was created to accompany the pre-existing line of toys. No backstory was given with the toys for the Lightning League and the Monster Minds doing battle, and so distinct characters were created by DIC and Straczynski to allow for a structured story.\nMost of the episodes were written by the French writers Jean Chalopin and Haskell Barkin. Writers at DIC also included Larry DiTillio, Barbara Hambly and J. Michael Straczynski. Straczynski wrote about a quarter of the episodes attempting, in his words, to \"hijack a dopey concept and make it into something more\". Haim Saban and Shuki Levy provided the music for the show. Nearly a decade later, it was rerun on USA Network's USA Cartoon Express block from July 3, 1994 to August 25, 1995.\nIn the United Kingdom, the series was first screened in some regions on the ITV network in a Sunday early morning slot in 1985, but with not all of the regional franchises having a Sunday morning service at that time, it was moved to Channel 4 where it was broadcast nationally for the first time in 1986. The series was subsequently frequently repeated on Sky Channel between 1989 and 1993. It was later repeated intermittently in a Friday and Saturday evening slot on the children's television networks Fox Kids and Jetix, between 2001 and 2009.\nPlot\nThe series follows protagonists Jayce, Flora, Herc Stormsailor, Oon and Gillian in their search for Jayce's father, Audric. Meanwhile, they are opposing the main antagonist Saw Boss and his followers, the Monster Minds. Audric was a botanist who performed experiments with biotechnology, and one experiment created Flora. In another experiment, Audric attempted to create a plant that could prevent starvation. But when he succeeded, a near, by star exploded into a supernova. The radiation from the supernova's explosion changed the plant and four others into the Monster Minds; a race of plant-like monsters, who wish to conquer the universe. Audric created a root that, could destroy the Monster Minds, but was forced to flee, before he could complete the task, after, which the Monster Minds made Audric's laboratory their headquarters. Audric kept half of the root himself and gave the other half to his servant, the Eternal Squire Oon, whom he sent to serve Jayce. Jayce and his friends are thereafter on a quest to find Audric and form the complete root.\nFilm\nDue to less than successful toy sales, the series' 65-episode run was not extended and the series had ended unresolved, but according to Straczynski, a film had also been commissioned along with the series, following in the footsteps of other toy-based animated series such as Transformers and G.I. Joe; if the series had proven successful by increasing toy sales, production would have begun. Straczynski wrote the script, but due to the failure of the toy line, preparation for the film was shelved.\nHad the movie been filmed, it would have provided a finale for the series, with Jayce and his Lightning League meeting the original Lightning League and being trained on the home world of the Guardians. Jayce would be reunited with his father Audric, but Audric would have been killed by Saw Boss as the Monster Minds began a final assault on the galaxy, and in a final battle, Jayce would unite the root and destroy Saw Boss, ending the Monster Mind threat forever.\nList of characters\nLightning League\n*Jayce: The protagonist and the bearer of the Legendary Ring of Light and half of the Magic Root.\n*Audric: Jayce's father and the original master of Oon, he is the creator of the Magic Root (of which he bears the other half), the Monster Minds, Flora, and the early Lightning League vehicles.\n*Gillian: A wizard and mentor to Jayce and Flora, he is Flora's co-creator and the creator of all five Lightning League vehicles. He is implied to be centuries old.\n*Flora: A flower created and developed into a humanoid by Gillian and Audric, she has telepathic powers with which she can sense Monster Minds and can communicate with animals & plants.\n*Oon: An Eternal Squire, created by Squiresmith Wixland, Oon originally served Audric, but has since been appointed to Jayce.\n*Herc Stormsailor: A mercenary who is the proud owner and pilot of the space barge The Pride Of The Skies II, he used to have a close relationship with Pirate Queen Morgana and it is implied he once was a member of the Pirate Guild. He was once an intergalactic commando before he quit. He was largely modeled after Han Solo.\n*Brock is Flora's flying fish mount, which \"speaks\" in chirps and whistles.\n*The Zoggies are a trio of robotic canines. They seem to have a liking for Oon, who is almost always being chased by them.\n*Jal Gorda is anthropomorphic alien spy who acts as a recurring guest character throughout the series. He was rescued by Audric from a Monster Mind invasion of his village and has been loyal to him ever since.\nMonster Minds\n*Saw Boss is the leader of the Monster Minds. He was spawned from the very plant that Audric had intended to end starvation.\n*Gun Grinner: A sub-boss of the Monster Minds, he oversees the Gun Trooper clones.\n*Terror Tank: A sub-boss of the Monster Minds, he oversees the Terror Trooper clones.\n*K.O. Kruiser: A sub-boss of the Monster Minds, he oversees the KO Trooper clones.\n*Beast Walker Commander: A sub-boss of the Monster Minds, he oversees the Beast Walker clones.\n*Saw Trooper Commander is the only one other than Saw Boss that can take a humanoid form. He is smaller in stature than Saw Boss and is notable by the stripes on his chest and the absence of a cape.\n*Dr. Zorg is a scientist working with Saw Boss.\nLightning League vehicles\nEvery Lightning League vehicle can be driven by members of the League. They can also operate on pre-programmed battle plans, without drivers, through commands issued on Jayce's communicator. When he talks to the vehicles, they respond with a single phrase, \"Command Acknowledged\".\n1st Lightning League AI Ground Vehicles created by Gillian;\n*Armed Force is a vehicle with a large golden grappling arm mounted atop it. Gillian had intended it for Audric, but instead he gave it to Jayce, when Audric was unable to join the League. It seats two, unlike its toy counterpart. Armed Force's toy counterpart included a gimmick dubbed \"Stack n' Attack\". Any of the other smaller vehicles could detach their wheeled chassis and attach to the top of Armed Force. A promotional comic in He-Man magazine showed two vehicles stacked atop Armed Force, though this was physically impossible using the toys, as only Armed Force featured two lined up holes suitable for another vehicle's underside to attach into. This never happens in the show; instead, the phrase \"stack n' attack\" refers to the Lightning League vehicles being able to exchange weapons mid-battle. The pilots are Jayce and Oon, although in \"The Vase of Xiang\", Flora and Brock drive it as they  attempt to rescue Jayce.\n*Drill Sergeant is a two-seater vehicle with a drill to dig tunnels. It is also equipped with two pop-out guns in the front of the cab. It is driven in the opening sequence by Flora.\n*Quickdraw is a vehicle with a concealed gun in a shield atop the vehicle, and an extended arm at the front with a spiked wheel for digging. It seats one, Gillian drives it in the opening sequence, but it has no regular driver in the series.\n*Spike Trike is a three-wheeled vehicle built for speed. Similar to a half-tracked dune buggy, it has a pair of crunching spiked wheels at the front that lift on a single arm. Herc drives it in the opening sequence, and it is his vehicle of choice during the series as well, but in the episode \"Deadly Reunion\", it refuses to allow Herc to pilot it, stating that it only responds to Jayce's commands.\n*Trailblazer is a large, robotic, four-legged vehicle with a front-mounted battering ram, capable of carrying the smaller vehicles. It usually seats one, but is occasionally seen with unused seating for four. Trailblazer is stronger and more durable (other than being crushed by the Monster Mind's Battle Base, in the episode \"The Purple Tome\") than the other vehicles, but was used much less often for reasons never disclosed (unlike the expenditure of resources that served as an excuse for the more rarely used larger vehicle troopers of the Monster Minds). Trailblazer is depicted as much larger in scale with the other vehicles than the toy counterparts. While the toy version of Trailblazer could carry a single smaller vehicle on its back, the cartoon counterpart could carry four of the smaller vehicles within its body, via a platform that lowered from its underside, every member of the Lightning League can pilot the Trailblazer.\n*Battle Base is a mobile fortress that houses all the other vehicles, and it is usually attached to the Pride as its bridge. The main weapon is a large elevating gun turret. Battle Base, like Trailblazer, is of a much larger relative scale in the animation than in its toy form. The toy for Battle Base had three garages that could each hold a single smaller vehicle, and its control bridge seated two. In the series, not only could Battle Base contain all of the smaller vehicles, but even Trailblazer was seen to be able to enter it. The bridge was a rather large full room; just like Trailblazer, every member of the Lightning League can also pilot the Battle Base as well too.\n2nd Lightning League AI Ground Vehicles created by Gillian;\n*Flingshot is a vehicle equipped with a catapult, built in \"The Stallions of Sandeen\". A toy was designed, but never produced.\n*Spray Gunner is a vehicle with a cannon that sprays various fluids, that was added later in the series, but has no introductory episode. The toy did not reach the production stage.\n*Motor Module is a low-riding vehicle with a powerful drive system, often used to field repair other vehicles, or to haul loads in an attachable trailer. It was added later in the series, but has no introductory episode. The toy did not reach the production stage, but was designed to be motorized, and could \"Stack n' Attack\" as Armed Force could (the toy version of the gimmick remained unused in the cartoon).\nLightning League AI Air And Space Vehicles;\n*Pride of the Skies II: Also known as \"The Pride\" for short, it is the space barge owned by Herc Stormsailor and home to the Lightning League throughout the series.\n*Space Scooter is a small air-bike.\n*Emergency Cruiser is the Pride's seldom used shuttle craft.\nThe Monster Minds vehicles\nGenerally, Monster Mind battles are carried out by clones of the main Monster Minds that are grown from vines. Saw Boss is able to communicate with these clones telepathically. These clones are referred to as \"troopers\"; Saw Trooper, Terror Trooper, K.O. Trooper, etc. The true Monster Minds change from their humanoid forms into vehicles upon leaving their headquarters, although they are significantly larger and more powerful than their mass-produced clones.\nThe 1st Monster Minds' Ground Legions;\n*Saw Troopers is a vehicle with a large buzzsaw on a rotating stalk.\n*Gun Troopers is a vehicle with a cluster of cannons clenched in its teeth. The main weapon is a multi-headed spiked flail mounted on top of the body.\n*Terror Troopers is a tank-like vehicle with a large, Venus flytrap-like mouth mounted on the body.\n*K.O. Troopers is a truck-like vehicle with a large wrecking ball-like stalk. The front grill and headlights look like an angry face.\n*Beast Walkers is a large, four-legged vehicle with a front-mounted claw weapon that is the powerhouse of a Monster Mind clone army. They were seldom used, due to the greater energy required to spawn. Like Trailblazer, they greatly resemble the AT-AT's from Star Wars.\nThe second Monster Minds' Ground Legions:\n*Flapjacks is a van-like vehicle with a catapult; they were designed, but not produced in the toy line.\n*Lurchers is a vehicle with a front ram; again, not produced in the toy line.\n*Snapdragons is a smaller four-legged walking vehicle with front-mounted \"petals\" that opened like a flower to expose a laser cannon.\n*Battle Stations is the Monster Minds' answer to Battle Base, it was not produced in the toy line. It was used in only one episode as it took enormous amounts of energy to spawn.\nThe Monster Minds' Air and Space Legions;\n*Cruisers is a larger Monster Mind spacecraft.\n*Scouts/Satellites is a smaller Monster Mind spacecraft.\n*Drill Vines is a small rocket craft with a drill nose cone, containing a Monster Mind vine cluster, which was used to penetrate targets and release a growth of vines.\n*Pods is a plant-like insertion craft launched by Cruisers or Scouts, when Drill Vines were not called for.\n*Space Fighters is a small Monster Mind starfighter, used much less commonly than Scouts.\nThe Monster Minds' Network of Legions:\n*Expansion Vines is a large vine growth used to infest a planet and spawn Monster Mind Troopers, also sometimes used to connect planets through open space.\n*Spore Vines is not as large as Expansion Vines, but they are used to deploy biological weapons in the form of gases.\n*Receptacles is a block-like plant that is used to form a teleportation point for Saw Boss's headquarters (originally Audric's lab).\n*Brains is a small plant mass with a single central eye, used for communication by Monster Mind agents of other races.\nEpisodes\n{| class=\"wikitable plainrowheaders\"\n|-\n! scope=\"col\" | #\n! scope=\"col\" | Title\n! scope=\"col\" | US air date\n|-\n| style=\"text-align:center;\"| 1\n! scope=\"row\" | \"Escape from the Garden of Evil\"\n| September 16, 1985\n|-\n| style=\"text-align:center;\"| 2\n! scope=\"row\" | \"The Vase of Xiang\"\n| September 17, 1985\n|-\n| style=\"text-align:center;\"| 3\n! scope=\"row\" | \"Steel Against Shadow\"\n| September 18, 1985\n|-\n| style=\"text-align:center;\"| 4\n! scope=\"row\" | \"Silver Crusaders\"\n| September 19, 1985\n|-\n| style=\"text-align:center;\"| 5\n! scope=\"row\" | \"Ghostship\"\n| September 20, 1985\n|-\n| style=\"text-align:center;\"| 6\n! scope=\"row\" | \"Flora, Fauna and the Monster Minds\"\n| September 23, 1985\n|-\n| style=\"text-align:center;\"| 7\n! scope=\"row\" | \"Fire and Ice\"\n| September 24, 1985\n|-\n| style=\"text-align:center;\"| 8\n! scope=\"row\" | \"Space Outlaws\"\n| September 25, 1985\n|-\n| style=\"text-align:center;\"| 9\n! scope=\"row\" | \"Future of the Future\"\n| September 26, 1985\n|-\n| style=\"text-align:center;\"| 10\n! scope=\"row\" | \"Underwater\"\n| September 27, 1985\n|-\n| style=\"text-align:center;\"| 11\n! scope=\"row\" | \"Frostworld\"\n| September 30, 1985\n|-\n| style=\"text-align:center;\"| 12\n! scope=\"row\" | \"Critical Mass\"\n| October 1, 1985\n|-\n| style=\"text-align:center;\"| 13\n! scope=\"row\" | \"The Purple Tome\"\n| October 2, 1985\n|-\n| style=\"text-align:center;\"| 14\n! scope=\"row\" | \"Hook, Line and Silver\"\n| October 3, 1985\n|-\n| style=\"text-align:center;\"| 15\n! scope=\"row\" | \"Bloodstone\"\n| October 4, 1985\n|-\n| style=\"text-align:center;\"| 16\n! scope=\"row\" | \"The Slaves of Adelbaren\"\n| October 7, 1985\n|-\n| style=\"text-align:center;\"| 17\n! scope=\"row\" | \"The Hunt\"\n| October 8, 1985\n|-\n| style=\"text-align:center;\"| 18\n! scope=\"row\" | \"Blockade Runners\"\n| October 9, 1985\n|-\n| style=\"text-align:center;\"| 19\n! scope=\"row\" | \"The Sleeping Princess\"\n| October 10, 1985\n|-\n| style=\"text-align:center;\"| 20\n! scope=\"row\" | \"Deadly Reunion\"\n| October 11, 1985\n|-\n| style=\"text-align:center;\"| 21\n! scope=\"row\" | \"Sky Kingdom\"\n| October 14, 1985\n|-\n| style=\"text-align:center;\"| 22\n! scope=\"row\" | \"Quest into Shadow\"\n| October 15, 1985\n|-\n| style=\"text-align:center;\"| 23\n! scope=\"row\" | \"Unexpected Trouble\"\n| October 16, 1985\n|-\n| style=\"text-align:center;\"| 24\n! scope=\"row\" | \"Bounty Hunters\"\n| October 17, 1985\n|-\n| style=\"text-align:center;\"| 25\n! scope=\"row\" | \"Double Deception\"\n| October 18, 1985\n|-\n| style=\"text-align:center;\"| 26\n! scope=\"row\" | \"Gate World\"\n| October 21, 1985\n|-\n| style=\"text-align:center;\"| 27\n! scope=\"row\" | \"Space Thief\"\n| October 22, 1985\n|-\n| style=\"text-align:center;\"| 28\n! scope=\"row\" | \"Moon Magic\"\n| October 23, 1985\n|-\n| style=\"text-align:center;\"| 29\n! scope=\"row\" | \"Affair of Honor\"\n| October 24, 1985\n|-\n| style=\"text-align:center;\"| 30\n! scope=\"row\" | \"Doomed Flower\"\n| October 25, 1985\n|-\n| style=\"text-align:center;\"| 31\n! scope=\"row\" | \"The Stallions of Sandeen\"\n| October 28, 1985\n|-\n| style=\"text-align:center;\"| 32\n! scope=\"row\" | \"Brain Trust\"\n| October 29, 1985\n|-\n| style=\"text-align:center;\"| 33\n! scope=\"row\" | \"Lightning Strikes Twice\"\n| October 30, 1985\n|-\n| style=\"text-align:center;\"| 34\n! scope=\"row\" | \"The Liberty Stone\"\n| November 1, 1985\n|-\n| style=\"text-align:center;\"| 35\n! scope=\"row\" | \"The Vines\"\n| November 4, 1985\n|-\n| style=\"text-align:center;\"| 36\n! scope=\"row\" | \"The Space Fighter\"\n| November 5, 1985\n|-\n| style=\"text-align:center;\"| 37\n! scope=\"row\" | \"Heart of Paxtar\"\n| November 6, 1985\n|-\n| style=\"text-align:center;\"| 38\n! scope=\"row\" | \"Appointment at Forever\"\n| November 7, 1985\n|-\n| style=\"text-align:center;\"| 39\n! scope=\"row\" | \"What's Going On?\"\n| November 8, 1985\n|-\n| style=\"text-align:center;\"| 40\n! scope=\"row\" | \"Dark Singer\"\n| November 11, 1985\n|-\n| style=\"text-align:center;\"| 41\n! scope=\"row\" | \"Swamp Witch\"\n| November 12, 1985\n|-\n| style=\"text-align:center;\"| 42\n! scope=\"row\" | \"Deadly Reflections\"\n| November 13, 1985\n|-\n| style=\"text-align:center;\"| 43\n! scope=\"row\" | \"Early Warning\"\n| November 14, 1985\n|-\n| style=\"text-align:center;\"| 44\n! scope=\"row\" | \"A Question of Conscience\"\n| November 15, 1985\n|-\n| style=\"text-align:center;\"| 45\n! scope=\"row\" | \"Life Ship\"\n| November 18, 1985\n|-\n| style=\"text-align:center;\"| 46\n! scope=\"row\" | \"The Mirage Makers\"\n| November 19, 1985\n|-\n| style=\"text-align:center;\"| 47\n! scope=\"row\" | \"Do Not Disturb\"\n| November 20, 1985\n|-\n| style=\"text-align:center;\"| 48\n! scope=\"row\" | \"Dreamworld\"\n| November 21, 1985\n|-\n| style=\"text-align:center;\"| 49\n! scope=\"row\" | \"The Children of Solarus II\"\n| November 22, 1985\n|-\n| style=\"text-align:center;\"| 50\n! scope=\"row\" | \"The Gardener\"\n| November 25, 1985\n|-\n| style=\"text-align:center;\"| 51\n! scope=\"row\" | \"Armada\"\n| November 26, 1985\n|-\n| style=\"text-align:center;\"| 52\n! scope=\"row\" | \"The Chimes of Sharpis\"\n| November 27, 1985\n|-\n| style=\"text-align:center;\"| 53\n! scope=\"row\" | \"Galaxy Gamester\"\n| November 28, 1985\n|-\n| style=\"text-align:center;\"| 54\n! scope=\"row\" | \"Circus Planet\"\n| November 29, 1985\n|-\n| style=\"text-align:center;\"| 55\n! scope=\"row\" | \"Common Bond\"\n| December 2, 1985\n|-\n| style=\"text-align:center;\"| 56\n! scope=\"row\" | \"Mistress of Soul Tree\"\n| December 3, 1985\n|-\n| style=\"text-align:center;\"| 57\n! scope=\"row\" | \"The Life Eater\"\n| December 4, 1985\n|-\n| style=\"text-align:center;\"| 58\n! scope=\"row\" | \"Wasteland\"\n| December 5, 1985\n|-\n| style=\"text-align:center;\"| 59\n! scope=\"row\" | \"The Oracle\"\n| December 6, 1985\n|-\n| style=\"text-align:center;\"| 60\n! scope=\"row\" | \"Short Circuit, Long Wait\"\n| December 9, 1985\n|-\n| style=\"text-align:center;\"| 61\n! scope=\"row\" | \"Time and Time Again\"\n| December 10, 1985\n|-\n| style=\"text-align:center;\"| 62\n! scope=\"row\" | \"The Source\"\n| December 11, 1985\n|-\n| style=\"text-align:center;\"| 63\n! scope=\"row\" | \"The Raid\"\n| December 12, 1985\n|-\n| style=\"text-align:center;\"| 64\n! scope=\"row\" | \"The Squire Smith\"\n| December 13, 1985\n|-\n| style=\"text-align:center;\"| 65\n! scope=\"row\" | \"Final Ride at Journey's End\"\n| December 16, 1985\n|}\nVoice actors\n*Darrin Baker as Jayce\n*Charles Joliffe as Gillian\n*Gilles Tamiz as Oon (uncredited)\n*Luba Goy as Oon (alternate; uncredited)\n*John Stocker as Gun Grinner (uncredited)\n*Dan Hennessey as Audric, K.O. Kruiser, and Saw Trooper\n*Valerie Politis as Flora\n*Giulio Kukurugya as Saw Boss\n*Len Carlson as Herc Stormsailor and Terror Tank\n*Peter Lewis as The opening announcer (uncredited)\n*Ernie Anderson as The main opening announcer (uncredited)\n*Victor Lanoux as The closing announcer (uncredited)\nMattel Wheeled Warriors toys\nOriginally conceived as a line of toy vehicles with \"stack & attack\" as a selling point, the tagline was: \"Monster Minds gone mad! Lightning League to the rescue!\".\nThe vehicles could be mixed and matched across most of the product line to allow children to create their own combinations. Accessory packs were released with extra wheels and weapons to allow for even more options. A mini comic was included with the toys, but no overarching story line was established beyond premise of the Monster Minds versus the Lightning League. Characters included with the toys were blank human drivers as pilots of the Lightning League vehicles and green brains for the Monster Minds.\nMattel ordered an animated series to promote the product, but development on this did not start until after the toys had already been produced and sales of the toys had been disappointing. When the animated series premiered, it had a vastly different story line and, aside from the vehicles and their names, nothing linked the toys to the animated series so the show did little to boost sales.\nDue to the success of the animated series, Mattel developed new drivers for a second series of vehicles that more resembled their animated counterparts, as well as new vehicles, but the toys never made it to the shelves.\n{| class=\"wikitable\"\n|+Series 1 - 1985\n! Name !! Log Line !! Allegiance !! Type !! Item number\n|-\n| Armed Force || Lightning League Leader || The Lightning League || Vehicle || 9001\n|-\n| Drill Sergeant || Lightning League Escape Artist || The Lightning League || Vehicle || 9002\n|-\n| Spike Trike || Lightning League Scout || The Lightning League || Vehicle || 9003\n|-\n| Quick Draw || Lightning League Weapons X-pert || The Lightning League || Vehicle || 9004\n|-\n| Saw Boss || Monster Minds Tyrant || Monster Minds || Vehicle || 9005\n|-\n| K.O. Kruiser || Monster Minds Demolitions X-pert || Monster Minds || Vehicle || 9006\n|-\n| Gun Grinner || Monster Minds Enforcer || Monster Minds || Vehicle || 9007\n|-\n| Terror Tank || Monster Minds Cannibal || Monster Minds || Vehicle || 9008\n|-\n| Trail Blazer || Lightning League Combat Stalker || The Lightning League || Battery powered vehicle || 9407\n|-\n| Beast Walker || Monster Minds Combat Creature || The Lightning League || Battery powered vehicle || 9408\n|-\n| Battle Base || Lightning League Mobile Fighting Fortress || The Lightning League || Vehicle || 9406\n|-\n| Victory Pack || Lightning League X-changeable X-tras || The Lightning League || Accessories || 9403\n|-\n| Attack Pack || Monster Minds X-changeable X-tras || Monster Minds || Accessories || 9403\n|}\n{| class=\"wikitable\"\n|+ Series 2 - 1986 Unreleased/prototypes\n! Name !! Log Line !! Allegiance !! Type !! Item number\n|-\n| Thunderstruction || Environment Set || The Lightning League || Carrying Case || 2697\n|-\n| Thunderstruction Vehicle Set || Environment Set with Armed Force || The Lightning League || Carrying Case || 2696\n|-\n| Fling Shot || Lightning League Long-range Marksman & Herc figure || The Lightning League || Vehicle || 2514\n|-\n| Spray Gunner || Lightning League Marine Machine & Jayce Figure || The Lightning League || Vehicle || 2699\n|-\n| Grim Creeper || Monster Minds Battle Spy || Monster Minds || Vehicle || 2700\n|-\n| Bru-Toss || Monster Minds Hurler || Monster Minds || Vehicle || 2514\n|-\n| Motorvator Set || Lightning League Power Pack & Jayce Figure || The Lightning League || Motorised Expansion pack || 2701\n|-\n| Monstervator Set || Monster Minds Power Pack || Monster Minds || Motorised Expansion pack || 2702\n|-\n| Run-A-Mut || Lightning League Zoggies || The Lightning League || Windup Pet || 2078\n|-\n| Rev-Em-Mut || Lightning League Zoggies || The Lightning League || Windup Pet || 2079\n|-\n| Scraps || Lightning League Zoggies || The Lightning League || Windup Pet || 2800\n|-\n| Adventure Pack || Jayce - Lightning League Leader || The Lightning League || Figure || 2447\n|-\n| Adventure Pack || Flora - Mischievous Tomboy || The Lightning League || Figure || 2447\n|-\n| Adventure Pack || Oon - comical Suit of Armor || The Lightning League || Figure || 2447\n|-\n| Adventure Pack || Gillian - Wise Wizard || The Lightning League || Figure || 2447\n|-\n| Adventure Pack || Herc Stormsailor - Cocky Starpilot || The Lightning League || Figure || 2447\n|-\n| Adventure Pack || Saw Boss - Monster Minds Leader || Monster Minds || Figure || 2447\n|}\nHome video releases\nIn France, the entire series was released on two VHS box sets and later released as two DVD boxed sets by Manga Distribution. In 2014, the entire series was re-released as two DVD box sets by IDP Home Video. In America, several compilations were released on VHS in the 1980s by Magic Window, a sub-division of RCA-Columbia Pictures Home Video.\nIn October 2003, Sterling Entertainment released a single disc release on DVD in Region 1 entitled Escape from the Garden of Evil, which contains four episodes from the series. The DVD was re-issued by NCircle Entertainment in 2007.\nShout! Factory acquired the rights to the series in 2007 and subsequently released Jayce and the Wheeled Warriors - Volume 1, a four-disc set containing the first 33 episodes of the series, on March 25, 2008.\nIn 2011, Mill Creek Entertainment acquired the rights to the series. They subsequently released Jayce and the Wheeled Warriors - Volume 1, containing the first 32 episodes of the series, and a 10 episode \"best of\" collection on DVD in Region 1 on February 21, 2012 both include a bonus episode of C.O.P.S.. Volume 2, featuring the final 33 episodes of the series, was released on February 19, 2013. Mill Creek later released Jayce and the Wheeled Warriors - The Complete Series on DVD in Region 1 in March 2018.\n{| class=\"wikitable\"\n|-\n! DVD name\n! Ep #\n! Release date\n|-\n| Volume 1\n| style=\"text-align:center;\"|32\n| February 21, 2012\n|-\n| Volume 2\n| style=\"text-align:center;\"|33\n| February 19, 2013\n|-\n| Complete Series\n| style=\"text-align:center;\"|65\n| March 14, 2018\n|}\nComic\nAn uncredited, unfinished comic based on the series was published in the French comic magazine Pif Gadget #922. The 13-page adventure ended on a cliffhanger as the next issue did not include the follow-up story and the conclusion to that story was never published in Pif Gadget. It included characters created specifically for the comic, such as a white-haired young sorceress called Algora who was an ally of Saw Boss. The story, entitled \"Le Sortilège d'Algora\" (\"Algora's Spell\") was later re-printed and completed in Poche Junior, a free supplement for younger readers in the French television listing magazine Télé Poche, in several installments: Poche Junior #1 (May 1987), Poche Junior #2 (May 1987), Poche Junior #17 (August 1987), Poche Junior #23 (October 1987), and Poche Junior #25 (October 1987).\nSee also\n*Ginga: Nagareboshi Gin\nReferences\nExternal links\n*"
    }
  ]
}