{
  "content": [
    {
      "type": "text",
      "text": "# Jeebropilly, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 0\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4340\n| area                = 11.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 11.3\n| dir1                = ESE\n| location1           = Rosewood\n| dist2               = 17.6\n| dir2                = SW\n| location2           = Ipswich CBD\n| dist3               = 55.6\n| dir3                = SW\n| location3           = Brisbane CBD\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Ipswich\n| stategov            = Scenic Rim\n| fedgov              = Blair\n| near-n              = Walloon\n| near-ne             = Amberley\n| near-e              = Amberley\n| near-se             = Willowbank\n| near-s              = Ebenezer\n| near-sw             = Ebenezer\n| near-w              = Rosewood\n| near-nw             = Thagoona\n}}\nJeebropilly (formerly known as Stone Quarry) is a rural locality in the City of Ipswich, Queensland, Australia. In the , Jeebropilly had \"no people or a very low population\".\nGeography\nThe locality is bounded to the west and north by the Bremer River.\nThe locality is bounded to the south-west and south by the Yarrowlea–Ebenezer railway line, a branch line of the Main Line railway, which serves the Jeebropilly coal mine that exports coal via the Port of Brisbane. Despite the name, Ebenezer railway station is off Coopers Road in Jeebropilly (), just before the balloon loop at the end of the line.\nHistory\nThe origin of the name is from the Ugarapul  word meaning flying squirrel gully.\nBethlehem Lutheran Church opened on 19 April 1871. A new church was built on 20 April 1898. The church closed circa 1938. It was on a  land parcel (Lot/Plan 307CH31367) now within a mine site (). In 1940, the church building  was relocated to Toogoolawah  to reopen as the Cornerstone Lutheran Church.\nThe Yarrowlea–Ebenezer railway line opened on 1 February 1990.\nDemographics\nIn the , Jeebropilly had a population of 7 people.\nIn the , Jeebropilly had \"no people or a very low population\".\nEconomy\nNew Hope Corporation Ltd has restarted mining coal at its Jeebropilly coal mine, which it had previously closed in 2007.\nEducation\nThere are no schools in Jeebropilly. The nearest government primary schools are Rosewood State School in neighbouring Rosewood to the west, Walloon State School in neighbouring Walloon to the north, and Amberley District State School in Yamanto to the east. The nearest government secondary schools are Rosewood State High School in neighbouring Rosewood to the west and Bremer State High School in Ipswich CBD to the east.\nFacilities\nMcgearys Road Reserve is park ().\nStone Quarry Cemetery (also known as Jeerbropilly General Cemetery) is a cemetery ().\nReferences"
    }
  ]
}