{
  "content": [
    {
      "type": "text",
      "text": "# Jeffrey Kimball (historian)\n\nJeffrey P. Kimball (born 1941) is an American historian and emeritus professor at Miami University. Among the ideas that Kimball developed was the idea of a Vietnam stab-in-the-back myth. He also argued that threats to use nuclear weapons had not been effective at advancing the United States' foreign policy goals either in the Korean War, Vietnam War, or the First Taiwan Strait Crisis. Historian Luke Nichter wrote that Kimball's books \"shaped future works, and these volumes on my shelves stand as a reminder that my own work on the Nixon tapes would not have happened without them\". According to historian Ken Hughes, Kimball is \"the leading scholar of the 'decent interval'\": the idea that Nixon eventually settled for securing a \"decent interval\" before South Vietnamese defeat. Hughes regrets that Kimball's work is \"virtually unknown\" outside academia.\n''Nixon's Vietnam War'' (1998)\nThe book argues that the Vietnam War was not winnable and \"was waged as much against [the South Vietnamese government in] Saigon as it was against the VC/NV enemy\". He also examines Nixon's madman theory of engaging in nuclear brinkmanship, especially between 1969 and 1972. He also argues that, in Lloyd C. Gardner's words, \"the Nixinger case that the war had been won were it not for a last minute failure of will, has been built upon a lengthy series of \"ifs,\" none of which were real alternatives at the time\". Gardner gave the book a positive review, stating that it was \"as exhaustively researched as was possible\", considering that not all evidence had been publicly released.\nThe Vietnam War Files (2004)\nIn this book, Kimball published a collection of primary source documents, mostly from the Nixon Presidential Materials Project, with an introduction written by him. The documents he chooses support the idea that Nixon pursued a \"madman\" course in diplomacy. He also reproduces two documents cited as evidence that Nixon and Kissinger hoped to achieve a \"decent interval\" between American withdrawal and the fall of South Vietnam. In his review of the book, Pierre Asselin stated that the book focused on the American perspective and did not include enough documents from foreign sources. Ken Hughes argues that Asselin's review of the book was \"a particularly  nasty  academic  hatchet  job\", noting that earlier Kimball published a negative review of Asselin's book.\n''Nixon's Nuclear Specter (2015)\nIn this book, Kimball and his co-author, William Burr, focus on the nuclear threats issued by the Nixon Administration towards the end of the Vietnam War. One challenge they faced is the lack of documentation, due to important evidence being redacted or lost. According to a review by Jonathan M. House in Michigan War Studies Review'', Kimball and Burr \"deserve praise for their discerning and cogent reconstruction of the motives and actions of the Nixon Administration in its first year\". House finds that they made a \"powerful argument, thanks to their masterful blending of memoir literature and historical documentation\". Luke A. Nichter disagreed that the \"decent interval\" theory adequately explains Nixon Administration policies, because according to him the president's outlook went rapidly up and down depending on casualty figures and news reports. However, Nichter overall praises the book: \"Well written and thoroughly researched, Nixon’s Nuclear Specter is a rich study for scholars of the era, and essential for those interested in Vietnam, the Nixon era, and the mindset of our 37th president.\"\nWorks\n*\n*\n*\n*\nReferences\nExternal links\n*"
    }
  ]
}