{
  "content": [
    {
      "type": "text",
      "text": "# Jeffrey H. Schwartz\n\nJeffrey Hugh Schwartz (born March 6, 1948) is an American physical anthropologist and professor emeritus of biological anthropology and History and Philosophy of Science at the University of Pittsburgh in Pittsburgh, Pennsylvania, and a fellow and President of the World Academy of Art and Science (WAAS) from 2008 to 2012.\nSchwartz' research involves the methods, theories, and philosophies in evolutionary biology, including the origin and diversification of primates.  He has studied and analyzed human, primate, and fossil skeletal material focusing much of his research on dental and skeletal morphology.  He has done fieldwork and museum research in the collections of various major museums around the globe.\nWork, research, and recognitions\nIn the revised and updated publication of The Red Ape: Orangutans and Human Origins, Schwartz argues there is additional evidence for his contention that orangutans share significantly more morphological similarities to humans than does any other great ape.\nHe has also been a major contributor to the George Washington project, an attempt to create wax figure likenesses of the first U.S. president at the ages of 19, 45, and 57, based upon craniofacial morphology. On public display in a new education center and museum at Mount Vernon, the models also went on a 9-city national tour to promote the museum.\nSince 1998 he has served as a consultant in forensic anthropology to the Allegheny County coroner's office and later the Medical Examiner Office of the same county.\nIn 2007 he was elected President of the World Academy of Art and Science for a five-year term (one year as president-elect).  He was the first person so elected, all previous presidents having been directly appointed by trustees of the organization.\nEducation\nBorn March 6, 1948, in Richmond, Virginia, Schwartz earned his bachelor's degree from Columbia College in 1969 and completed his doctorate from Columbia University in 1974.\nFamily\nSchwartz is the son of Jack Schwartz, a physician who conducted quinine research during World War II,  and Lillian Schwartz, one of the earliest visual artists to utilize computer imaging. He is married to the poet Lynn Emanuel and they reside in Pittsburgh.\nMajor works\n*\n*\n*\n*\n*\n*\n*\nFilm\nJeffrey H. Schwartz made an appearance in the documentary film The Trouble with Atheism. He was also featured on the Daily Show with John Stewart opposite Evolutionary Biologist and noted TV personality Todd Disotell.\nSee also\nBirutė Galdikas\nReferences\nExternal links\n*"
    }
  ]
}