{
  "content": [
    {
      "type": "text",
      "text": "# Jemima Warner\n\nJemima Warner was a camp follower with the Continental Army in the early days of the American Revolutionary War and, according to the Women's Memorial in Washington D.C., she is the first American “military woman killed in action.\"\nBiography\nNothing is known about Jemima's early childhood, but she probably lived in Lancaster County, Pennsylvania before joining the army when she was seventeen. Her husband, James Warner, was a private in Captain Matthew Smith's company of Colonel William Thompson's 1st Pennsylvania Regiment, and she accompanied him on Colonel Benedict Arnold's expedition to Quebec through the Maine wilderness in the fall of 1775.\nOn November 1, 1775, her husband fell ill, and Jemima stayed with him while the rest of the battalion continued without them. After James died, Jemima buried him with leaves and journeyed some 20 miles through the wilderness alone to catch up with the rest of the battalion. Many soldiers were surprised to see her emerge from the wilderness days (or even weeks) later, carrying her husband's rifle.\nDuring the invasion of Quebec, Jemima was commissioned by General Richard Montgomery to deliver a letter containing his conditions of surrender to Governor Guy Carleton, but she was refused admittance into the city. On her second attempt, however, she dressed more formally and was allowed in, but Governor Carleton tore up the letter, imprisoned her, and drummed her out of the city the next day.\nThough two women, Jemima Warner and Susannah Grier (wife of Sergeant Joseph Grier of Captain William Hendrick's company), are mentioned by name in John Joseph Henry's journal of the expedition through the Maine wilderness, neither of them is mentioned by name in soldiers’ journals during the invasion of Quebec. There are reports of four women on the American side killed during the siege, one by grapeshot in December 1775, one by burning in December 1775, one shot accidentally by an American soldier in April 1776, and one by lightning in June 1776. It is often assumed that Jemima Warner was the one killed by grapeshot while standing with the rest of the American soldiers.\nReferences"
    }
  ]
}