{
  "content": [
    {
      "type": "text",
      "text": "# Jenna Edwards\n\n| hair_color=Brown\n}}Jenna Edwards (born July 29, 1981) is an American former beauty queen from Brandon, Mississippi who held the titles Miss Florida and Miss Florida USA. Edwards represented Florida at the Miss America 2005 pageant and the Miss USA 2007 pageant.\nEdwards grew up in Clinton, Mississippi and graduated from Central Hinds Academy in 1999. After spending one year and a study abroad semester at Mississippi College, she transferred to the University of Miami, earning a Bachelor of Science degree in Communication Studies and English Literature.\nPageantry\nIn 1998 and 1999, she competed in the Miss Mississippi Teen USA pageant, and placed first runner-up both years. She won her first major title, Miss Teen All-American, in 1999. Edwards was an official hostess/entertainer for that pageant in 2000 and 2001. In 2000, she won the Miss Oktoberfest pageant, beating future Miss USA titleholder Shandi Finnessey.\nMiss America\nIn September 2002, Edwards won the Miss University of Miami preliminary title, and competed for the Miss Florida title in mid-2003. Edwards placed in the top 15 and won Newcomer of the Year. The pageant was won by Ericka Dunlap. Dunlap would later go on to win the Miss America title. In February of the following year, she won Miss Winter Park, another preliminary title, and competed at the state pageant held in June. In that pageant she won both swimsuit and evening gown preliminaries, and was crowned Miss Florida 2004. Her first runner-up was Shannon Schambeau who would later become Miss District of Columbia 2005.\nEdwards represented Florida in the Miss America 2005 pageant broadcast live from Atlantic City, New Jersey in September 2004. She did not place in the nationally televised pageant, but did win a preliminary swimsuit award.\nMiss USA\nIn April 2006, Edwards returned to the pageant stage, winning the Miss North Miami USA title, a preliminary for Miss Florida USA. Edwards competed for the Miss Florida USA 2007 title on 15 July 2006, winning the title and becoming the third Miss Florida to win the Miss Florida USA crown. She represented Florida at the Miss USA pageant held at the Kodak Theatre in Los Angeles, California on March 23, 2007, but did not place.\nEdwards passed on the Miss Florida USA title to Jessica Rafalowski on 14 July 2007.\nQueen for a Day\nEdwards is well known for starting the charity \"Queen for a Day\", for which she won the Miss America Overall Community Service award. Queen for a Day is a non-profit organization founded in 2000 that is dedicated to helping young cancer sufferers, allowing them to dress up and crowning them \"Queen for a Day\". The organisation aims to encourage local communities to host party days for girls with cancer. It has been featured on The Oprah Winfrey Show and in People Magazine (March 2002) and won the Ford Motor Company's \"Commitment to Kids\" Award in 2001.\nReferences\nExternal links\n*[https://web.archive.org/web/20070314053219/http://missamerica.org/competition-info/state-contestants.asp?state=Florida&year=2004&GO=GO%21   Miss Florida 2004 official profile]\n*"
    }
  ]
}