{
  "content": [
    {
      "type": "text",
      "text": "# Jeremy Edwards\n\n| birth_place        = London, England\n| death_date         =\n| death_place        =\n| occupation         = Actor, presenter, teacher\n| yearsactive        = 1995–present\n| spouse             =\n| children           = 2\n| education          =\n*Manchester Metropolitan University\n}}\n}}\nJeremy Edwards (born 17 February 1971) is an English actor, known for his roles as Kurt Benson in Hollyoaks, Danny Shaughnessy in Holby City and Mike Taylor in Millie Inbetween, as well as being a regular panellist and guest host on The Wright Stuff. In October 2019, he appeared on the ITV series The X Factor: Celebrity, with ballroom dancer Brendan Cole.\nEarly life\nAs a child, Edwards attended Millfield. He has a degree in Politics and Public Administration from Manchester Metropolitan University, and his previous jobs include being a merchant banker.\nCareer\nEdwards played Kurt Benson in the Channel 4 soap opera Hollyoaks, a role he portrayed from 1995 to 1999, before appearing in the BBC medical drama Holby City, in which he played Danny Shaughnessy from 1999 to 2003. In 2001, Edwards appeared on ''Lily Savage's Blankety Blank. In January 2005, Edwards took part in the third series of Celebrity Big Brother, where he finished in fourth place.\nIn January 2007, Jeremy co-presented Coronation Street/Emmerdale Confidential'' on ITV along with Terri Dwyer (who played the wife of Edwards's character in Hollyoaks). On 12 February 2008, he appeared as an armed police inspector named Fraser in the ITV soap opera Emmerdale. In 2009, he was a contestant on the fourth series of Dancing On Ice, partnered with Darya Nucci. They were the third couple to be eliminated and he received the fewest public votes in both weeks he performed.\nIn November 2009 to July 2010, he appeared on the daytime talk show Angela and Friends as one of Angela Griffin's friends. Edwards was also a regular panelist on the Channel 5 morning series The Wright Stuff. In 2013, he returned to Hollyoaks via Hollyoaks Later as a guardian angel figure for Tony Hutchinson (Nick Pickard).\nHe has appeared in several pantomimes, including being in Aladdin at The Hazlitt in Maidstone in 2011. Then he appeared in Dick Whittington at The Harlington, in Fleet, Hampshire in 2013. From 2014 to 2018, he appeared in the CBBC series Millie Inbetween as Mike. He also appeared in the fifth series of Hacker Time. In October 2019, he competed on the ITV series The X Factor: Celebrity as part of a duo with Brendan Cole. They were eliminated in the auditions stage. Edwards returned to Hollyoaks as Kurt during the soap's 25th anniversary celebrations in October 2020. He remained on the soap until December of that year. On being asked to return again, Edwards declined, stating that negative comments made about him on social media influenced his decision, and Edwards had not returned to the show since then.\nIn 2022, it was announced that Edwards would be starring as the role of Peter George in the UK tour of Hilary Bonner's political thriller Dead Lies. The tour ran from March to June 2022.\nHe recently appeared in ‘Beauty & the Beast’ pantomime in Ramsgate (Dec 2023)\nHe also has an elite business training people in presentation skills working mainly in advertising.\nIn January 2024, Edwards joined the team at shopping TV channel Ideal World as a presenter.\nIn May 2025, he is set to return to the stage opposite Kellie Shirley and Naveed Khan in Jez Butterworth's play Parlour Song at Greenwich Theatre.\nPersonal life\nEdwards became engaged to Rachel Stevens in 2002, but the couple broke up in late 2003. Edwards later married Lydia Metz on 2 May 2009. In December 2020, he announced that the pair were expecting a child after undergoing two rounds of IVF. She gave birth to a son on 2 May 2021. He also has a daughter, Scarlett, who was also conceived through IVF and was born in 2017.\nReferences\nExternal links\n*"
    }
  ]
}