{
  "content": [
    {
      "type": "text",
      "text": "# Jerome Warner\n\n| birth_place        = Waverly, Nebraska, U.S.\n| death_date         =\n| death_place        = Lincoln, Nebraska, U.S.\n| residence          =\n}}\nPhillip Jerome Warner (November 23, 1927 &ndash; April 20, 1997) was a farmer and politician in the U.S. state of Nebraska. He served as a state senator from Waverly, Nebraska in the Nebraska Legislature. His father, Charles J. Warner, served in the Nebraska Legislature as well, and also later as Lieutenant Governor of Nebraska.\nPersonal life\nHe was born on November 23, 1927, on his parents' farm in Waverly, Nebraska. He was the son of Nebraska State Senator Charles J. Warner, the first Speaker of the Nebraska Unicameral Legislature. He graduated from Waverly High School and then went on to the University of Nebraska where he received a Bachelor of Science degree in Agriculture after playing for the Nebraska Cornhuskers football team.[http://www.nebraskalegislature.gov/education/warner.php Nebraska Legislature - Warner Institute for Education in Democracy] Warner later married Betty Pearson in 1952, a former newspaper political reporter. He was a lifelong farmer who enjoyed farming and raising Hereford cattle on the family farm outside of Waverly, Nebraska.\nIn 1994, his wife Betty died of cancer. Warner would pass away three years later in 1997 at the age of 69. After his wife's death, the eastern segment of Nebraska Highway 2 from Lincoln to Nebraska City was named the Jerome and Betty Warner Highway.\nState legislature\nHe was elected to the legislature in 1962 to represent the 25th Nebraska legislative district after a failed bid for the office in 1960. He was consistently reelected until his death in 1997. During his 35 years of service to the Nebraska Legislature, Warner  headed committees on Education, Appropriations and Revenue, chaired  the Government and Military Affairs Committee and the Legislature's Executive Board, as well as serving as the Speaker from 1969 to 1970. He was greatly respected by his colleagues and was referred to as the \"Dean of the Legislature.\"\nOver the years, Warner introduced and influenced bills aimed at reducing the state's dependence on property taxes, providing state aid to schools,[https://news.google.com/newspapers?id=7ighAAAAIBAJ&sjid=TH0EAAAAIBAJ&pg=2946,1289560&hl=en Sarasota Herald-Tribune - Google News Archive Search] encouraging school consolidation, creating the Department of Administrative Services, establishing a state highway classification system and formula for disbursement of funds to local governments, changing the state budget cycle from an annual to a biennial system, and making Kearney State College a part of the University of Nebraska system. Warner was a large supporter and friend of the University of Nebraska and passionately defended it against budget cuts.[http://unlcms.unl.edu/journalism2/cojmc/alumni/jnews/archive/97spring/warner.html Senator Jerome Warner | College of Journalism and Mass Communications Archive | Nebraska]\nA biography of Jerome Warner was written by Charlyne Berends called Leaving your mark: The political career of Nebraska State Senator Jerome Warner in 1997.\nSee also\n* Nebraska Legislature\n* List of speakers of the Nebraska Legislature\n* Charles J. Warner\nReferences"
    }
  ]
}