{
  "content": [
    {
      "type": "text",
      "text": "# Jesse Jackson 1988 presidential campaign\n\nThe 1988 Jesse Jackson presidential campaign was Jesse Jackson's second campaign for President of the United States. This time, his successes in the past made him a more credible candidate and he was both better financed and better organized. Although most people did not seem to believe he had a serious chance at winning, Jackson once again exceeded expectations as he more than doubled his previous results, prompting R. W. Apple, Jr. of The New York Times to call 1988 \"the Year of Jackson\".\nThe campaign\nJackson and eventual nominee Michael Dukakis outlasted all other Democratic candidates to the final primaries, including California. Jackson came in second in delegates behind Dukakis. Jackson beat out candidates future Vice President Al Gore, future President Joe Biden, and Dick Gephardt, among others. In early 1988, Jackson organized a rally at the former American Motors assembly plant in Kenosha, Wisconsin, approximately two weeks after new owner Chrysler announced it would close the plant by the end of the year. In his speech, Jackson spoke out against Chrysler's decision, stating \"We have to put the focus on Kenosha, Wisconsin, as the place, here and now, where we draw the line to end economic violence!\" and compared the workers' fight to that of the civil rights movement in Selma, Alabama. As a result, the UAW Local 72 union voted to endorse his candidacy, even against the rules of the UAW. However, Jackson's campaign suffered a significant setback less than two weeks later when he was defeated handily in the Wisconsin primary by Michael Dukakis. Jackson's showing among white voters in Wisconsin was significantly higher than in his 1984 run, but was also noticeably lower than pre-primary polling had indicated it would be. The discrepancy has been cited as an example of the so-called \"Bradley effect\".\nJackson's campaign had also been interrupted by allegations regarding his half-brother Noah Robinson, Jr.'s criminal activity. Jackson had to answer frequent questions about his brother, who was often referred to as \"the Billy Carter of the Jackson campaign\".\nOn the heels of Jackson's narrow loss to Dukakis the day before in Colorado, Dukakis' comfortable win in Wisconsin terminated Jackson's momentum. The victory established Dukakis as the clear Democratic frontrunner, and he went on to claim the party's nomination, but lost the general election in November.\nIn both races, Jackson ran on what many considered to be a very liberal platform. Declaring that he wanted to create a \"Rainbow Coalition\" of various minority groups, including African Americans, Hispanics, Middle Eastern Americans, Asian Americans, Native Americans, family farmers, the poor and working class, and LGBT people, as well as white progressives, Jackson ran on a platform that included:\n*creating a Works Progress Administration-style program to rebuild America's infrastructure and provide jobs to all Americans,\n*reprioritizing the war on drugs to focus less on mandatory minimum sentences for drug users (which he views as racially biased) and more on harsher punishments for money-laundering bankers and others who are part of the \"supply\" end of \"supply and demand\"\n*reversing Reaganomics-inspired tax cuts for the richest ten percent of Americans and using the money to finance social welfare programs\n*cutting the budget of the Department of Defense by as much as fifteen percent over the course of his administration\n*declaring Apartheid-era South Africa to be a rogue nation\n*instituting an immediate nuclear freeze and beginning disarmament negotiations with the Soviet Union\n*giving reparations to descendants of black slaves\n*supporting family farmers by reviving many of Roosevelt's New Deal–era farm programs\n*creating a single-payer system of universal health care\n*ratifying the Equal Rights Amendment\n*increasing federal funding for lower-level public education and providing free community college to all\n*applying stricter enforcement of the Voting Rights Act and\n*supporting the formation of a Palestinian state.\nWith the exception of a resolution to implement sanctions against South Africa for its apartheid policies, none of these positions made it into the party's platform in either 1984 or 1988.\nResults\nJackson captured 6.9 million votes and won 11 contests: seven primaries (Alabama, the District of Columbia, Georgia, Louisiana, Mississippi, Puerto Rico and Virginia) and four caucuses (Delaware, Michigan, South Carolina, [led by state campaign manager activist Kevin Alexander Gray] and Vermont). Jackson also scored March victories in Alaska's caucuses and Texas's local conventions, despite losing the Texas primary. Some news accounts credit him with 13 wins. Briefly, after he won 55% of the vote in the Michigan Democratic caucus, he was considered the frontrunner for the nomination, as he surpassed all the other candidates in total number of pledged delegates. Jackson was the first black candidate to win the nationwide Democratic youth vote among all Democratic primary voters,  a significant national demographic, the voters aged 30 and below, beating Dukakis and the other candidates in this demographic.\nCampaign Chairs included Cong. Maxine Waters and Willie Brown, Speaker of the California Assembly. Staff for Jackson included Frank Watkins, political adviser; campaign manager Gerald Austin; Betty Magness, headquarters operations manager; Minyon Moore, senior political adviser; Frank Clemente, policy director; Eddie Wong, field director; Steve Cobble, delegate coordinator; Rae Lewis, youth director; Pam Watkins, press secretary; and Troy Deckert, deputy youth director.\nHindsight following the 2008 election of Barack Obama\nFollowing the election of Barack Obama in 2008 as the first African-American to become U.S. president, Jackson was asked about his emotion regarding the 20-year wait for an African American man to reach the nation's highest office, and noted that while he had played some role in helping to create the circumstances for the 2008 election, his remark was not to diminish the efforts of the Obama campaign. Jesse Jackson thought that it would be interesting to be the first African- American President, but he felt that losing the election helped him focus more on his non-profit organization (PUSH) and his family.\nEndorsements\nState officials\n*Orval Faubus, segregationist and former governor of Arkansas\nMunicipal officials\n*Bernie Sanders, mayor of Burlington, Vermont\n*Harold Washington, mayor of Chicago\nIndividuals\n*Casey Kasem, disc jockey\n*Paul Wellstone, activist and nominee for Minnesota State Auditor in 1982\nCelebrities\n*Byron Allen, film producer\n*Debbie Allen, actress\n*Susan Anspach, actress\n*Robert Blake, actor\n*Ned Beatty, actor\n*Eileen Brennan, actress\n*Gary Busey, actor\n*Bill Cosby, actor and comedian\n*Robert Foxworth, actor\n*Anthony Franciosa, actor\n*Louis Gossett Jr., actor\n*Valerie Harper, actor\n*John Heard, actor\n*Gregory Hines, actor\n*Margot Kidder, actress\n*Diane Ladd, actress\n*Spike Lee, director\n*Cleavon Little, actor\n*Elizabeth Montgomery, actress\n*Oz Scott, director\n*Martin Sheen, actor\n*Cicely Tyson, actress\n*Dennis Weaver, actor\nMusicians\n*Carl Anderson, singer\n*Jackson Browne, singer\n*Irene Cara, singer\n*Natalie Cole, singer\n*Rita Coolidge, singer\n*David Crosby, singer\n*Sammy Davis Jr., singer\n*Roberta Flack, singer\n*Aretha Franklin, singer\n*Dick Griffey, producer\n*Herbie Hancock, pianist\n*Phyllis Hyman, singer\n*Al Jarreau, singer\n*Quincy Jones, producer\n*Gladys Knight, singer\n*Kris Kristofferson, singer\n*Melba Moore, singer and actress\n*Willie Nelson, singer\n*Bonnie Raitt, singer and guitarist\n*Lou Rawls, singer\n*Helen Reddy, singer\n*Buffy Sainte-Marie, singer\n*Pete Seeger, singer\n*Bob Seger, singer\n*Mary Wilson, singer\n*Stevie Wonder, singer\nNewspapers and publications\n*The Nation\n}}\nReferences"
    }
  ]
}