{
  "content": [
    {
      "type": "text",
      "text": "# Jessie King (childtaker)\n\nJessie King (or Kean)  (27 March 1861 - 11 March 1889) was a Scottish laundress and baby farmer in Edinburgh who was found guilty of murdering three children. She was the last woman to be hanged in Edinburgh.\nIn the years after her death, scholars have debated when King was actually guilty or not.\nBiography\nKing was born in Glasgow. She lived with Thomas Pearson, whom she met when she was pregnant out of wedlock and in poverty. Pearson was of the middle-class, and had left his wife and children. He was an alcoholic. She had her own children, including a son named Thomas, as well as adopted ones.\nIn October 1888, a group of people in Stockbridge found the body of an infant wrapped in oilskin in the street. King and Pearson were suspected by their neighbors, who noted that three of their adopted children had disappeared. When their house was raided, a second dead infant, a baby girl named Violet, was found in the house's coal closet. King claimed she was guilty and that Pearson had not known about either of the children. She was arrested for the murder of three children, all of whom were the children of domestic servants or factory girls who had been adopted by King through newspaper ads. Authorities at the time suspected there may have been more murdered children.\nShortly after her arrest, King recanted her confession, claiming the killings were Pearson's idea, although this was not accepted by the authorities. Her Catholic confessor asked the Secretary of State to reconsider, although again this was not accepted. According to that confession, Pearson had killed one of the children himself, and had directed King to do so in the other two cases.\nKing was kept in Calton Jail while awaiting trial. She made several suicide attempts during this time.\nKing's trial before the High Court in Edinburgh began in February 1889. At her trial, Joseph Bell provided some medical expertise. Pearson was granted immunity under the agreement that he testified against King. King's mental health was assessed several times during the trial, but she ultimately deemed fit to be sentenced. During the trial, the press presented King as a \"fallen woman\" who was irredeemably evil.\nThe jury deliberated for four minutes. King was found guilty and hanged in Edinburgh on 11 March 1889. She was buried near what is now St. Andrew's House. Pearson died in Glasgow in 1890.\nDoubts of guilt\nSome scholars have suggested that Pearson was actually the killer of the children. The second child was found in a spot that King would not have been able to access, while another child was wrapped in Pearson's coat. Pearson's testimony was also vital to King's conviction.\nAdditionally, modern scholars believe King may have suffered from some form of mental illness.\nReferences"
    }
  ]
}