{
  "content": [
    {
      "type": "text",
      "text": "# Jessica King\n\n|birth_place  = Fond du Lac County, Wisconsin, U.S.\n|death_date   =\n|death_place  =\n|education    = University of Wisconsin, Oshkosh (BA)Thomas Jefferson School of Law (JD)\n|website      =\n}}\nJessica Jeane King (born July 21, 1975) is an American lawyer and politician from Wisconsin. She is a former Democratic member of the Wisconsin Senate, representing the 18th district when elected in 2011. She defeated incumbent Republican Senator Randy Hopper in a special recall election on August 9, 2011, and took office August 25, 2011; but lost the seat the following year to another Republican, Rick Gudex, in the November 2012 general election, which reverted that chamber back to Republican control.\nBackground\nKing was born and raised in Fond du Lac County, Wisconsin. Her parents were disabled,  and she became a ward of the state at age 15.\nShe put herself through the University of Wisconsin, Oshkosh, working in a juicebox factory and doing similar work, and went on to earn a J.D. degree from Thomas Jefferson School of Law in California.\nIn 2004, she returned to Wisconsin to care for her aging parents. She opened a small business, and served as an adjunct professor at University of Wisconsin-Oshkosh.\nShe is a former associate attorney who was with Steinhilber, Swanson, Mares, Marone & McDermott.\nKing was elected to the Oshkosh Common Council, eventually becoming deputy mayor, In 2008, she ran against Hopper for the Senate losing by only 163 votes  (41,741 to 41,904).\nWisconsin Senate\nIn the wake of the 2011 Wisconsin protests, King was one of two Wisconsin Democratic challengers successful in unseating Republican incumbent senators who had supported Governor Walker. The 18th district includes Fond du Lac, Oshkosh, and Waupun. She narrowly defeated Hopper by 1254 votes (28,191 votes to 26,937).\nOn November 13, 2012, King conceded to Republican Rick Gudex, then Fond du Lac City Council president. As a result of the race, the Wisconsin Senate reverted to Republican control by a two-vote majority in January 2013.\n2020 congressional election\nShe ran against incumbent Glenn Grothman for Wisconsin's 6th congressional district in 2020. She received 164,239 votes, or 40.72% of the total votes cast, losing the election.\nReferences\nExternal links\n*[https://jessicakingforwisconsin.com/ Jessica King for Wisconsin] campaign website\n*[https://web.archive.org/web/20120502004805/http://legis.wisconsin.gov/W3asp/contact/legislatorpages.aspx?house=Senate&district=18&display=bio Senate profile] (archived)\nfrom the 18th district|years= 2011–2013}}"
    }
  ]
}