{
  "content": [
    {
      "type": "text",
      "text": "# Jewish Historical Museum, Belgrade\n\n| established         =\n| dissolved           =\n| location            = Stari Grad, Belgrade, Serbia\n| type                = Jewish museum\n| accreditation       =\n| key_holdings        =\n| collections         =\n| collection          =\n| visitors            =\n| director            = Vojislava Radovanović\n| president           =\n| curator             =\n| owner               = Federation of Jewish Communities of Serbia\n| publictransit       =\n| car_park            =\n| network             =\n| website             =\n}}\nThe Jewish Historical Museum (, ; abbr. JHM) is a museum located to the southeast of Kalemegdan, Stari Grad, Belgrade. Founded in 1948, it is the only Jewish museum in Serbia. The museum is situated in a building constructed in 1928 for the Sefardic community. The museum's collection is comprehensive and also complex in its content, with exhibits arranged thematically.\nIt focuses on Belgradian Jews from the 2nd century until World War II, encompassing the lives of Jews who lived in Serbia and Yugoslavia. There is a predominance of memorial displays  as well as a large collection of documents and photographs which attest to the Holocaust in which many Jewish families were totally decimated.\nHistory\nThe museum is located in a building designed by Samuel Sumbul in 1928 for the Jewish Sephardic community; an inscription near the top of the building states: \"The Home of the Jewish Religious-School Community\". The Jewish Historical Museum was founded in 1948. The Federation of Jewish Communities had the intention to establish a museum to cover some 2,000 years of history from the earliest history of Belgrade.\nIn 2005, the museum donated a thematic collection to the United States Holocaust Memorial Museum International Archives Project Division. It contained documents regarding \"arrests and persecutions of, and reprisals against, Jews, members of antifascist movements, communists, and the general population\" as well as documents regarding concentration camps in the former Yugoslavia.\nUnlike the Jewish museum in Sarajevo, which is administered by the city, the Belgrade museum falls under the auspices of the Federation of Jewish Communities. Milica Mihajlović, daughter of General Herbert Kraus, Minister of Health, served as curator (1964–90) and director (1990–06) before retiring in 2007. The current director is Vojislava Radovanović.\nFeatures\nA rich collection of items, documents and photographs on the history of the Jews in Yugoslavia is in the possession of the museum.  There are 1,000 ethnological items including books and historical and Holocaust collections, as well as paintings and drawings. The museum has documents related to the Zemun Jews. The archives in the museum also contain several of the annotated documents related to the sufferings of the Jews of Yugoslavia written  by Jasa Almuli, former president of the Belgrade Jewish Community. The museum's embroidery and costume collection was displayed in 1978 in London at the International Centenary Conference of the Folklore Society. In September 2013, a new exhibition opened called \"Synagogical Ritual Items\", containing deported items which were never displayed previously. In addition to the museum, the building houses a children's theater, the Jewish Community Belgrade (second floor), and the Federation of Jewish Communities of Serbia (third floor).\nPublications\nThe Jewish Historical Museum has published numerous books including \"Studije i gradja o Jevrejima Dubrovnika\" which contains studies and documents related to Jews who lived in Dubrovnik. Since the 1960s, the museum has published a historical magazine, Zbornik.\nSee also\n* History of the Jews in Serbia\n* List of museums in Serbia\nReferences\n;Bibliography\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}