{
  "content": [
    {
      "type": "text",
      "text": "# Jim Lane (Irish republican)\n\nJames Anthony Lane (born 1938) is an Irish republican and socialist from Cork. He was a central figure in left-wing politics in Cork city during the 1960s to late 1980s and involved in many campaigns. He was also influential in republican circles nationally and a well known advocate of socialist republicanism of a Marxist-Leninist hue.\nBackground\nLane was born on Devonshire Street North in Cork's north inner city. His father Michael, a former quartermaster sergeant in the Free State army, worked in Ford's motor plant – the family originated in Conna in east County Cork where they had a medium-sized farm. Jim Lane's mother, Mary Ann (née Lane), was in Cumann na gCailíní and Cumann na mBan, the girls' and women's sections respectively of the Republican Movement, from childhood until 1935.\nIn 1954, Jim Lane joined the Irish Republican Army (IRA), Sinn Féin and the Cork Volunteers' Pipe Band. He subsequently actively participated in the IRA's 1956–62 border campaign. He was one of the first group of volunteers sent north for the campaign. However, when the Cork brigade of the IRA disengaged from the armed campaign, he resigned, along with a number of other Cork volunteers, such as his close friends Brendan O'Neill and Charlie Ronayne, and they continued to participate in the border campaign as unaligned volunteers.\nHe was also involved with the Unemployed Protest Movement in the late 1950s and was instrumental in establishing the Cork Vietnamese Freedom Association in the 1960s. An active trade unionist, he was a socialist republican from an early stage and was much influenced by Maoism in the 1960s and early 1970s.\nIrish Revolutionary Forces\nLane was a leading figure in the republican 'splinter group', the Irish Revolutionary Forces throughout the 1960s. This Cork-based group, which comprised a large number of left-wing former IRA members, produced an influential newsletter in the early to mid-1960s called An Phoblacht (The Republic). This paper openly criticised the Republican Movement for its lack of action on the north and for reneging on republican principles. There was considerable tension between the IRF and the IRA, which turned into raids and armed counter-raids. In 1963, for example, a group of eight armed IRF members raided the Cork Sinn Féin headquarters and warned the city's IRA leaders at gunpoint because of the IRA's seizure of the group's newsletter from the printer where it was being produced. The group also seized thousands of copies of the United Irishman, the Sinn Féin paper, as it arrived in the local railway station. Relations between the group and the IRA were strained for much of the 1960s with the IRF regularly criticising the politics of the Republican Movement and arguing for a socialist way forward.\nThe IRF group established Saor Éire in 1968 and produced a paper called People's Voice.\nJim Lane was a leading figure in this group, as was Seán Daly (a former IRA commander) who was later to write books on Irish labour history. Lane and his comrades brought guns and assistance to Derry in 1969 when the Bogside was under siege (see Battle of the Bogside. Despite his membership of Saor Éire, he was briefly the intelligence officer for Dáithí Ó Conaill's command area around County Londonderry/County Donegal at the time of the disturbances.\nSaor Éire was essentially a political group, but the name of the organisation was forever connected with militarism following a number of bank raids in the Dublin area in late 1969 by an unconnected republican splinter group that termed itself the Saor Éire Action Group. Also, the rise of the Provisionals fatally undermined Saor Éire's attempt to build a Marxist socialist-republican alternative to the official Republican Movement. The group disappeared at the beginning of the 1970s. The Cork branch of Saor Éire joined with the Irish Communist Organisation, and ran a bookshop at 9 St Nicholas Church Lane; a second unconnected Maoist bookshop was also opened in the Shandon Street area but this was closed down following attacks by local people. After the Cork branch objected to the ICO's support for the British Army in Northern Ireland and its endorsement of the two nations theory they resigned from the ICO.\nCommunist politician\nLane subsequently joined with others in forming the Cork Communist Organisation, which\nattended the \"Comhairle Na Mumhan\" conference, aimed at supporting the Éire Nua\nplan of Ruairí Ó Brádaigh. The CCO also published a magazine, The Cork Worker, which ran from 1971 to 1973. The CCO later became the Cork Workers' Club. This operated out of the same premises in St Nicholas Church Lane that Saor Éire had used as its headquarters. Over the years, the CWC ran a bookshop selling Marxist and republican literature, and published a series of 'Historical Reprints' of Irish socialist classics by James Connolly, James Larkin and Ralph Fox. Lane also edited the book The Burning of Cork City by British Forces, Dec. 1920 in 1978.\nJim Lane was central to the anti-H-Block movement in the Cork region at the end of the 1970s and became the chairperson of the Cork City and County National H-Block Committee, which organised many large demonstrations in support of the H-Block hunger strikers in 1980-1. He also joined the Irish Republican Socialist Party and became its national chairperson in 1983, a position he held for a number of years. He was influential in steering the Irish Republican Socialist Party/Irish National Liberation Army towards explicitly Marxist politics. He stood unsuccessfully as an IRSP candidate in the 1982 general election, garnering a few hundred votes.\nPersonal life\nLane was chief shop steward in Cash's of Patrick Street, his place of employment for many years, until he retired in the 1990s. Married with four grown-up children, he currently lives near the Lough in Cork city.\nReferences"
    }
  ]
}