{
  "content": [
    {
      "type": "text",
      "text": "# Jim Joe Edwards\n\n|birth_place=Banner, Mississippi, U.S.\n|death_date=\n|death_place=Sarepta, Mississippi, U.S.\n|debutleague = MLB\n|debutdate=May 14\n|debutyear=1922\n|debutteam= Cleveland Indians\n|finalleague = MLB\n|finaldate=July 19\n|finalyear=1928\n|finalteam= Cincinnati Reds\n|statleague = MLB\n|stat1label=Win–loss record\n|stat1value=26–37\n|stat2label=Earned run average\n|stat2value=4.37\n|stat3label=Strikeouts\n|stat3value=211\n|teams=\n* Cleveland Indians (–)\n* Chicago White Sox (–)\n* Cincinnati Reds ()\n}}\nJames Corbette \"Jim Joe\" Edwards (December 14, 1894 – January 19, 1965) was a pitcher in Major League Baseball who played for   different teams between the  and  seasons. Listed at , 185&nbsp;lb., Edwards batted right-handed and threw left-handed. He was inducted into the Mississippi Sports Hall of Fame in 1966.\nA native of Banner, Mississippi, Edwards attended Mississippi College and played college baseball there. After graduating in April 1922, the Cleveland Indians signed him to a contract and immediately placed him on the major league roster. He made his debut on May 14, and in 25 games he had a 3–8 win–loss record and a 4.47 earned run average (ERA). In 1923, he spent some time as a starting pitcher and some as a relief pitcher. In 38 games, 21 of them starts, he had a 10–10 record and a 3.71 ERA in 179.1 innings pitched.\nIn 1924, Edwards pitched in 10 games for the Indians, and had a 4–3 record and a 2.84 ERA. After 13 games and an ERA of 8.25 the following season, he was released and picked up by the Chicago White Sox, pitching in nine games towards the end of the season. Edwards spent the 1926 season with the White Sox, and had a 6–9 record and a 4.18 ERA in 32 games, 16 of them starts. In 1927, he had his first taste of minor league baseball, and spent the year with the Seattle Indians. In 41 games for them, he had a 20–17 record and a 3.36 ERA. The following season he had a 1–8 record and a 3.14 ERA in ten games. The Cincinnati Reds signed him to a contract during part of the 1928 season, and in his last season in the majors, he had a 2–2 record and a 7.59 ERA in 18 appearances. He then spent four more seasons in the minor leagues to end his professional career. In a six-season career, Edwards posted a 26–37 record with 211 strikeouts and a 4.37 ERA in 145 appearances, including 59 starts, 23 complete games, six shutouts, four saves, and  innings of work.\nAfter retiring, Edwards moved to Pontotoc, Mississippi and became a teacher and football coach.\nHe died in Sarepta, Mississippi, at the age of 70, as the result of an automobile accident.\nReferences\nExternal links"
    }
  ]
}