{
  "content": [
    {
      "type": "text",
      "text": "# Jim Webb 2016 presidential campaign\n\n}}\n| fec_date     =\n| slogan       = Leadership You Can Trust\n| themesong    =\n| chant        =\n| website      = [https://web.archive.org/web/20151020015105/https://www.webb2016.com/ www.webb2016.com](archived - October 20, 2015)\n}}\nThe 2016 presidential campaign of Jim Webb, the former United States Senator from Virginia, was officially launched when Webb, who also formerly served as Secretary of the Navy, announced his candidacy for the Democratic Party's nomination for President of the United States in 2016 on July 2, 2015. As the author of ten books, Webb chose to make his announcement through writing an open letter on his campaign website. He withdrew from the Democratic race on October 20, 2015. Following the withdrawal of his candidacy for the Democratic nomination, Webb openly considered running for president as an independent before ruling out such a run on February 11, 2016.\nBackground\nWebb has served as a Marine Corps officer, an assistant and full Congressional council, the first assistant secretary of defense for reserve affairs, the secretary of the Navy under President Ronald Reagan, as well as a member of the United States Senate from Virginia. In 2006, he unseated incumbent Republican George Allen. He served one full term before retiring in 2013 and was succeeded by fellow Democrat and former Virginia Governor, Tim Kaine.  He has also written ten books, and won an Emmy for his work as a journalist.\nWebb's moderate policy stances, including issues such as gun control, foreign policy, and illegal immigration, led to speculation that he was a frontrunner for the vice presidential nomination in 2008, although he ultimately took himself out of the running.\nExploratory committee\nOn November 19, 2014, in a 14-minute video, Webb announced the formation of an exploratory committee in preparation for a possible bid for the 2016 Democratic presidential nomination. He reaffirmed his moderate stances as a strength to a potential candidacy, including some criticisms of the Affordable Care Act despite having voted for it, and emphasized his belief that the Democratic Party had been neglecting the \"white, working-class\" vote in favor of pandering to minorities.\nCampaign\nOn July 2, 2015, in a 2,000-word essay on his campaign website, Webb formally announced his candidacy.\nDuring his campaign, Webb spent significantly less time than other candidates visiting early primary states. Webb spent only four days campaigning in New Hampshire and twenty days campaigning in Iowa.\nIssues\nFiscal policy\nAs U.S. Senator from Virginia, Webb received grades of F from 2007 through 2009, D in 2010, F in 2011, and D in 2012 from the National Taxpayers Union, a conservative taxpayers advocacy organization.\nTrade policy\nThe Cato Institute's Center for Trade Policy Studies identifies Webb, during his U.S. Senate tenure, as having a modestly protectionist and mostly pro-subsidies voting record.\nLGBT rights\nOn June 29, 2015, in a Facebook post, Webb issued a statement in favor of the US Supreme Court ruling in the case of Obergefell v. Hodges:\n}}\nOn April 26, 2012, Webb voted in favor of the Violence Against Women Reauthorization Act of 2012.\nOn December 18, 2010, Webb voted in favor of the Don't Ask, Don't Tell Repeal Act of 2010.\nOn October 22, 2009, Webb voted in favor of the National Defense Authorization Act for Fiscal Year 2010, which included in Division E the Matthew Shepard and James Byrd, Jr. Hate Crimes Prevention Act, which expands the federal hate crime law to include crimes motivated by a victim's actual or perceived gender, sexual orientation, gender identity, or disability.\nDebates\nIn the first Democratic presidential debate on October 13, Webb reaffirmed many of his moderate policy stances: Particular examples included his skepticism of gun control (pointing out that the other candidates, who were for gun control, were guarded by armed bodyguards on a regular basis), as well as his foreign policy credentials in regards to the Middle East. Also, on the topic of the Black Lives Matter movement, when the candidates were asked if all lives matter or black lives matter, Webb was the only one who said \"all lives matter.\" As a result, Webb was the third most-searched of the five candidates on Google during the night, behind the frontrunners Hillary Clinton and Bernie Sanders.\nThe candidates were asked \"which enemy they were the proudest of making.\"  He said \"I would have to say the enemy soldier that threw the grenade that wounded me, but he's not around right now to talk to.\" Criticism included MSNBC identifying it as a \"head-scratching moment\" and noting \"Webb's creepy smirk.\" Webb also gained notoriety for complaining that he did not have enough time.\nWithdrawal\nOn October 20, 2015, Webb formally announced that he was withdrawing from the race for the Democratic nomination. He then confirmed that he was considering the possibility of mounting a bid as an independent candidate.\nOn February 11, 2016, Webb ruled out the prospect of an independent presidential bid, remarking that such a run would be \"enormously costly and time sensitive\" and that he couldn't \"see the fundraising trajectory where we could make a realistic run.\"\nEndorsements\nIndividuals\n* Andrew Bacevich, political scientist\n* Craig Crawford, writer and television political commentator\n* David Saunders, political strategist and author\n*  Michael Savage, Conservative radio talk show host\nSee also\n* 2016 United States presidential election\n* Democratic Party presidential debates, 2016\nReferences\nExternal links\n*"
    }
  ]
}