{
  "content": [
    {
      "type": "text",
      "text": "# Jim Dewar (American football)\n\n| birth_place = Oak Park, Illinois, U.S.\n| death_date  =\n| death_place = Muncie, Indiana, U.S.\n| height_ft   = 6\n| height_in   = 1\n| weight_lb   = 190\n| high_school = Oak Park and River Forest\n| college     = Indiana\n| draftyear   = 1947\n| draftround  = 19\n| draftpick   = 173\n| pastteams   =\n* Cleveland Browns (1947)\n* Brooklyn Dodgers (1948)\n| highlights  =\n* AAFC champion (1947)\n| statleague  = AAFC\n| statlabel1  = Rushing yards\n| statvalue1  = 64\n| statlabel2  = Rushing average\n| statvalue2  = 4.6\n| statlabel3  = Touchdowns\n| statvalue3  = 1\n| pfr         = DewaJi20\n}}\nJames Alexander Dewar Jr. (June 17, 1922 – June 30, 1989) was an American football halfback who played two seasons in the All-America Football Conference (AAFC). Dewar played for the Cleveland Browns in 1947 and the Brooklyn Dodgers in 1948.\nHigh school and college\nDewar attended Indiana University, where he was a standout as a halfback on the school's football team starting as a sophomore in 1942. He ran back a punt 90 yards for a touchdown in a 53–0 victory over Butler University that year. Dewar joined the U.S. Army in 1943 during World War II and played service football at Camp Grant in Rockford, Illinois. He was selected in 1944 to play in the College All-Star Game, a now-defunct matchup between the National Football League champion and a squad composed of the country's best college players. After the war, Dewar returned for a final season at Indiana.\nProfessional career\nDewar was selected with the 173rd pick in the 1947 NFL draft by the Los Angeles Rams. He instead joined the Cleveland Browns of the All-America Football Conference, who had selected him in the 1947 AAFC Draft along with former Indiana teammate Bob Cowan. The Browns finished the 1947 season with a 12–1–1 record and won the AAFC championship against the New York Yankees. After a year with the team, Dewar was sent to the Brooklyn Dodgers. He played one season there before leaving football.\nReferences\nBibliography\n*\nExternal links\n*"
    }
  ]
}