{
  "content": [
    {
      "type": "text",
      "text": "# Jimmy King\n\n| birth_place     = South Bend, Indiana, U.S.\n| high_school     = Plano East (Plano, Texas)\n| college         = Michigan (1991–1995)\n| draft_year      = 1995\n| draft_round     = 2\n| draft_pick      = 35\n| draft_team      = Toronto Raptors\n| career_start    = 1995\n| career_end      = 2005\n| career_position = Shooting guard\n| career_number   = 24, 13\n| years1          =\n| team1           = Toronto Raptors\n| years2          = 1996–1997\n| team2           = Quad City Thunder\n| years3          =\n| team3           = Denver Nuggets\n| years4          = 1997–1999\n| team4           = Quad City Thunder\n| years5          = 1999–2000\n| team5           = La Crosse Bobcats\n| years6          = 2000\n| team6           = Sioux Falls Skyforce\n| years7          = 2000\n| team7           = Quad City Thunder\n| years8          = 2000–2001\n| team8           = Gary Steelheads\n| years9          = 2001\n| team9           = Trotamundos de Carabobo\n| years10         = 2001–2002\n| team10          = Asheville Altitude\n| years11         = 2002–2003\n| team11          = Spójnia Stargard Szczeciński\n| years12         = 2003–2004\n| team12          = Great Lakes Storm\n| years13         = 2004–2005\n| team13          = Texas Tycoons\n| years14         = 2005\n| team14          = Guaiqueríes de Margarita\n| highlights      =\n* CBA champion (1998)\n* CBA Most Valuable Player (1998)\n* All-CBA First Team (1998)\n* CBA All-Defensive Team (1998)\n* Second-team Parade All-American (1991)\n* McDonald's All-American (1991)\n* Texas Mr. Basketball (1991)\n| stats_league    = NBA\n| stat1label      = Points\n| stat1value      = 285 (4.5 ppg)\n| stat2label      = Rebounds\n| stat2value      = 112 (1.8 rpg)\n| stat3label      = Assists\n| stat3value      = 90 (1.4 apg)\n| medal_templates =\n}}\n}}\nJimmy Hal King (born August 9, 1973) is an American former professional basketball player. King played in the NBA and other leagues. He is most famous for his time spent on the famed University of Michigan Wolverines Fab Five along with Ray Jackson, Juwan Howard, Chris Webber, and Jalen Rose, who reached the 1992 and 1993 NCAA Men's Division I Basketball Championship games as freshmen and sophomores. He played all four years at Michigan and averaged 15 points per game as a senior in 1995.\nCollege career\nHe was part of the University of Michigan Wolverines Fab Five, along with Ray Jackson and future NBA players Juwan Howard, Chris Webber and Jalen Rose, that reached the 1992 and 1993 NCAA Men's Division I Basketball Championship games as freshmen and sophomores.  He was a starter for teams that reached the tournament four times. Before this, he was a high school All-American basketball player at Plano East Senior High School in Plano, a city north of Dallas, Texas.  Although the Fab Five final four appearances have been forfeited, he was not among the players called before the grand jury (Robert Traylor, Webber, Rose, Maurice Taylor, and Louis Bullock) in the University of Michigan basketball scandal and was not found to have received large amounts of money.\nProfessional career\nKing was selected by the Toronto Raptors in the second round (35th overall) of the 1995 NBA draft and played 62 games for them during the 1995–96 season, averaging 4.5 points, 1.8 rebounds and 1.4 assists per game. On July 24, 1996, before the start of the 1996–97 season, he was traded to the Dallas Mavericks in exchange for Ronald \"Popeye\" Jones, but King was eventually waived. After playing most of the 1996–97 season with the Quad City Thunder of the CBA, he signed with the Denver Nuggets on a 10-day contract, but participated in only two games for them, tallying six points, two rebounds, two assists and three steals.\nKing also played a few seasons in Europe and with the Continental Basketball Association (CBA) where he was the 1998 league MVP with the Quad City Thunder.  He played for the US national team in the 1998 FIBA World Championship, winning the bronze medal. He also played for the Asheville Altitude in the NBDL.\nKing's last chance to return to the NBA came before the 2000–01 NBA season where King was the final player cut on the defending Eastern Conference champion Indiana Pacers.\nIn a phone interview on the Jim Rome Show on November 30, 2006, King stated he was working as a financial advisor for Merrill Lynch on Wall Street.  During the 2008–09 Michigan Wolverines season King served as a radio color commentator.\nCurrently, King is the Vice President at [https://www.truchampions.com/team TruChampions], a high school sports recruiting solution that helps parents take their student-athletes from 0 to 5+ offers by the end of their high school career.\nThe March 13, 2011 airing of the ESPN films 30 for 30 documentary The Fab Five sparked national outrage that led to a series of media exchanges between members of the press, Michigan Wolverines men's basketball players, including King, and Duke Blue Devils men's basketball players in forums such as The New York Times, The Wall Street Journal and The Washington Post.\nIn August 2011, King was detained by police for failure to pay $17,000 in back child support for his 17-year-old son. He was incarcerated at Michigan's Oakland County Jail along with Jalen Rose, who was serving time for a DUI arrest. On January 27, 2012, the case against King was dismissed after he paid the $17,000 in full.\nIn 2016, King began his coaching career as he became the head coach of the Ecorse Community High School men's basketball team in Ecorse, Michigan.\nReferences\nExternal links\n*[https://web.archive.org/web/20080220013720/http://www.nba.com/playerfile/jimmy_king/ Jimmy King player profile] at NBA.com (includes career highs)\n*[https://web.archive.org/web/19970415225722/http://www.nba.com/playerfile/jimmy_king.html 1997 player profile by Denver Nuggets]\n*[https://web.archive.org/web/20010124144000/http://www.nba.com/playerfile/bio/jimmy_king.html Biography] of Jimmy King at NBA.com\n*\n*[https://web.archive.org/web/20100418044313/http://stats.ath.umich.edu/basketball/basketstart.php University of Michigan Basketball Statistical Archive]"
    }
  ]
}