{
  "content": [
    {
      "type": "text",
      "text": "# Jimmie E. Howard\n\n|death_date=\n|birth_place= Burlington, Iowa, United States\n|death_place= San Diego, California, United States\n|placeofburial= Fort Rosecrans National Cemetery, San Diego, California(Plot: Section O, Grave 3759)\n|placeofburial_label= Place of burial\n|image= Howard JE.jpg\n|medal= Moh right.gif\n|medal_alt=A light blue neck ribbon with a gold star shaped medallion hanging from it. The ribbon is similar in shape to a bowtie with 13 white stars in the center of the ribbon.\n|caption= Jimmie E. Howard, Medal of Honor recipient\n|nickname=\n|allegiance=United States of America\n|branch=\n|serviceyears= 1950–1977\n|rank= First Sergeant\n|commands=\n|unit= 1st Recon Battalion\n|battles= Korean WarVietnam War\n|awards= Medal of HonorSilver StarPurple Heart (3)\n|laterwork= Veterans Administration\n}}\nJimmie Earl Howard (July 27, 1929 – November 12, 1993) was a Marine Corps staff sergeant when he led an eighteen-man reconnaissance patrol in a fierce battle against a battalion of Viet Cong in June 1966. As a result of his heroic actions, Howard became the sixth U.S. Marine to be awarded the nation's highest honor for heroism in combat in Vietnam. The Medal of Honor was presented by President Lyndon B. Johnson in White House ceremonies on August 21, 1967.\nBiography\nJimmie Earl Howard was born July 27, 1929, in Burlington, Iowa, and graduated from high school there in 1949. He attended the University of Iowa for one year prior to enlisting in the United States Marine Corps on July 12, 1950.\nHe went through recruit training with the 1st Recruit Training Battalion, Marine Corps Recruit Depot, San Diego, California, and was promoted to Private First Class upon graduation from recruit training in January 1951, remaining at the Recruit Depot as a drill instructor until December 1951.\nIn his book Hill 488, Ray Hildreth – who served alongside Howard in Vietnam – remembered: \"Howard was a John Wayne type of guy. A hard slab of a man with a poker face … he walked into an area and you could almost hear the theme song from The Sands Of Iwo Jima.\"\nKorean War\nAfter completing advanced infantry training in February 1952, he was ordered to Korea, where he was assigned duty as a forward observer with the 4.2\" Mortar Company, 1st Marines, 1st Marine Division. For his service in Korea, he was awarded the Silver Star, the Purple Heart with Gold Star in lieu of a second Purple Heart, and the Navy Unit Commendation. He was a promoted to corporal in March 1952.\nInter-war service\nUpon his return to the United States in April 1953, Corporal Howard served as Tactics Instructor, Headquarters and Service Company, 2nd Infantry Training Regiment, Marine Corps Base Camp Pendleton, California. While stationed at Camp Pendleton, he was promoted to sergeant in June 1953.\nIn March 1954, Sergeant Howard joined the Marine Detachment on board the , as a squad leader. The following January, he returned to Camp Pendleton and served as a squad leader, 1st Amphibious Reconnaissance Company. The 1st Amphibious Reconnaissance Company was redesignated as the 1st Force Reconnaissance Company, and Sgt Howard remained with this unit until September 1957. He was promoted to staff sergeant in May 1956.\nFrom September 1957 until April 1960, he served as Special Services Chief and a military policeman with Headquarters Battalion, 1st Marine Division, Camp Pendleton.\nTransferred to San Francisco, California, Staff Sergeant Howard was assigned to the 3rd Marine Division. He served as Special Services Noncommissioned Officer, Headquarters and Service Company, 2nd Battalion, 9th Marines and later, as a platoon guide and platoon sergeant with Company H, 2nd Battalion, 9th Marines.\nReassigned to the Recruit Depot, San Diego, in August 1961, he joined Guard Company, Headquarters and Service Battalion and served as Guard Noncommissioned Officer, Company First Sergeant and administrative man, respectively. He later became Depot Special Service Assistant, Headquarters Company, Headquarters and Service Battalion there, and served in the latter capacity until October 1964.\nThe following month, he returned to Camp Pendleton, and was assigned to the 1st Marine Division. He saw duty as Regimental Special Services Noncommissioned Officer with Headquarters Battery, 11th Marine Regiment and in January 1965, became an instructor, Counterguerrilla Warfare Course, Division Schools Center, Subunit #1, with Headquarters Battalion until March 1966.\nFrom April until June 1966, Howard served as a platoon leader, with Company C, 1st Reconnaissance Battalion, 1st Marine Division.\nVietnam War; Medal of Honor action\nOn the evening of June 13, 1966, Howard and his platoon of 15 Marines along with two Navy corpsmen were dropped behind enemy lines atop Hill 488. The mission of this reconnaissance unit was to observe enemy troop movements in the valley and call in air and artillery strikes. Within days, the enemy descended on them in force; on the night of June 15, 1966, a full battalion of Viet Cong (over 300 men) engaged the squad of 18. After receiving severe wounds from an enemy grenade, Howard distributed ammunition to his men and directed air strikes on the enemy. By dawn, his beleaguered platoon still held their position. During the 12 hours of combat, 200 enemy troops were killed as against the loss of six American lives.\nIn addition to receiving the Medal of Honor for his actions on Hill 488, Howard received a gold star in lieu of a third Purple Heart for wounds received on June 16, 1966. Members of Howard's platoon were decorated for their actions in this fight with four Navy Crosses and thirteen Silver Stars.\nPost-Vietnam War and retirement\nUpon his return to the United States, he was assigned duty as Battalion Training Non-commissioned Officer, Service Company, Headquarters and Service Battalion, Marine Corps Recruit Depot, San Diego, California.\nHoward retired from the Marine Corps on March 31, 1977, with the rank of first sergeant.\nFollowing his retirement, Howard lived in San Diego, California and worked for the local Veterans Affairs office. Howard became involved in coaching/volunteering for Point Loma High School. He was a coach for the Point Loma High School football team which went undefeated in 1987 and won the San Diego Section CIF championship. He was also a coach for the Point Loma High School football team which won the CIF championship again in 1991. When asked why he liked coaching, Coach Howard stated the men he lost in combat were relatively the same age as the high school football players and it reminded him of them.\nJimmie E. Howard died on November 12, 1993, at his home in San Diego, California. He was buried in the Fort Rosecrans National Cemetery in San Diego.\nMilitary honors\nA list of his medals and decorations includes: the Medal of Honor, the Silver Star Medal, the Purple Heart with two Gold Stars in lieu of second and third awards, the Navy Unit Commendation, the Good Conduct Medal with three bronze stars, the National Defense Service Medal with one bronze star, the Korean Service Medal with four bronze stars, the Vietnam Service Medal with one bronze star, the United Nations Service Medal, the Korean Presidential Unit Citation, and the Republic of Vietnam Campaign Medal.\n{| style=\"margin:1em auto; text-align:center;\"\n|colspan=\"4\"|\n|-\n|colspan=\"4\"|&nbsp;&nbsp;\n|-\n|\n|\n|\n|\n|-\n|\n|\n|\n|\n|-\n|}\n{| class=\"wikitable\" style=\"margin:1em auto; text-align:center;\"\n|-\n|colspan=\"10\"|Navy and Marine Corps Parachutist Insignia\n|-\n|colspan=\"4\"|Medal of Honor\n|colspan=\"4\"|Silver Star\n|colspan=\"4\"|Purple Heart with two gold stars\n|-\n|colspan=\"3\"|Navy Unit Commendation\n|colspan=\"3\"|Marine Corps Good Conduct Medal with three bronze stars\n|colspan=\"3\"|National Defense Service Medal with one bronze star\n|colspan=\"3\"|Korean Service Medal with four bronze stars\n|-\n|colspan=\"3\"|Vietnam Service Medal with one bronze star\n|colspan=\"3\"|Republic of Korea Presidential Unit Citation\n|colspan=\"3\"|United Nations Korea Medal\n|colspan=\"3\"|Republic of Vietnam Campaign Medal\n|-\n|}\nMedal of Honor citation\nThe President of the United States in the name of The Congress takes pleasure in presenting the MEDAL OF HONOR to\nfor service as set forth in the following CITATION:\n:For conspicuous gallantry and intrepidity at the risk of his life above and beyond the call of duty as a Platoon Leader, Company \"C\", First Reconnaissance Battalion, First Marine Division (Reinforced), Fleet Marine Force, Pacific, in action against communist insurgent forces in Quang Tin Province, Republic of Vietnam, on 16 June 1966. During the night Gunnery Sergeant (then Staff Sergeant) Howard's platoon of eighteen men was assaulted by a numerically superior force consisting of a well-trained North Vietnamese Battalion employing heavy small arms fire, automatic weapons and accurate weapon fire. Without hesitation he immediately organized his platoon to personally supervise the precarious defense of Hill 488. Utterly oblivious to the unrelenting fury of hostile enemy weapons fire and hand grenades he repeatedly exposed himself to enemy fire while directing the operation of his small force. As the enemy attack progressed and the enemy fire increased in volume and accuracy and despite his mounting casualties, Gunnery Sergeant Howard continued to set an example of calmness and courage. Moving from position to position, he inspired his men with dynamic leadership and courageous fighting spirit until he was struck and painfully wounded by fragments from an enemy hand grenade. Unable to move his legs and realizing that the position was becoming untenable, he distributed his ammunition to the remaining members of his platoon and skillfully directed friendly aircraft and artillery strikes with uncanny accuracy upon the enemy. Dawn found the beleaguered force diminished by five killed and all but one wounded. When rescue helicopters proceeded to Gunnery Sergeant Howard's position, he directed them away from his badly mauled force and called additional air strikes and directed devastating small arms fire on the enemy thus making the landing zone secure as possible. His valiant leadership and courageous fighting spirit served to inspire the men of his platoon to heroic endeavor in the face of overwhelming odds, and reflected the highest credit upon Gunnery Sergeant Howard, the Marine Corps and the United States Naval Service.\n/S/ LYNDON B. JOHNSON\nSilver Star citation\nCitation:\nThe President of the United States of America takes pleasure in presenting the Silver Star to Corporal Jimmie Earl Howard (MCSN: 1130610), United States Marine Corps, for conspicuous gallantry and intrepidity while attached to the 4.2\" Mortar Company, First Marines, FIRST Marine Division (Reinforced), and serving as a Forward Observer of a rifle company in action against enemy aggressor forces in Korea from 12 to 15 August 1952. During the defense of an important hill position, Corporal Howard called in and directed effective fire for friendly mortar and artillery positions, materially strengthening the defense of the position. Although occupied with the duties of forward observer, he participated in deadly hand to hand combat with the enemy to maintain his forward observation post and, although subsequently relieved for rest, sided in evacuating the wounded and in carrying vitally needed supplies to his comrades. Later, although knocked unconscious by the concussion from an enemy mortar shell, he recovered sufficiently to continue to perform his duties and, after being felled again by another mortar shell was evacuated on account of the severity of his condition. By his outstanding courage, initiative and unyielding devotion to duty, Corporal Howard served to inspire all who observed him and upheld the highest traditions of the United States Naval Service.\nNamesake\nThe  guide missile destroyer , named in honor of Jimmie E. Howard, was christened on November 20, 1999, by 1stSgt Howard's widow, Theresa M. Howard.\nSee also\n*List of Medal of Honor recipients\n*List of Medal of Honor recipients for the Vietnam War\nReferences\n:\n*\n*\n*\n*\n*\n*\nFurther reading\n*Hildreth, Ray and Charles W. Sasser. Hill 488, New York: Pocket Books, 2003. ()"
    }
  ]
}