{
  "content": [
    {
      "type": "text",
      "text": "# Jingtai Emperor's change of heirs apparent\n\nThe change of heirs apparent of 1452 was a major political event in the Ming dynasty of China. It refers to the attempt by the Jingtai Emperor to depose his nephew, Zhu Jianshen, and install his own son, Zhu Jianji, as heir to the throne. This took place after the Tumu Crisis of 1449, during which the Jingtai Emperor ascended the throne following the capture of his brother, Emperor Yingzong, by the Mongol forces. To achieve his goal, the Emperor resorted to various means, including widespread bribery of high-ranking officials and the use of force against those who opposed him. An emperor using such methods to secure the succession for his son was a rare and notable occurrence in Chinese history.\nIn 1454, Zhu Jianji died, having held the position of heir for only a year. Although some ministers suggested restoring Zhu Jianshen as heir, the Emperor never reinstated him. Three years later, the Jingtai Emperor was overthrown in a palace coup, and Emperor Yingzong regained the throne, with Zhu Jianshen once again designated as heir.\nBackground\nZhu Qiyu, the Jingtai Emperor, was the second son of the Xuande Emperor and the younger brother of Emperor Yingzong. Prior to his accession, he held the title of Prince of Cheng. In August 1449, Emperor Yingzong personally campaigned against the Oirat Mongols, leaving the Prince of Cheng as regent. This campaign led to the Tumu Crisis, during which Emperor Yingzong was captured on 1 September. The Oirats then aggressively advanced, attacking Beijing and causing a tense atmosphere throughout the capital. On 4 September, the Prince of Cheng, with the approval of Empress Dowager Sun, the mother of Emperor Yingzong, assumed control of the government. At the time, Emperor Yingzong's eldest son, Zhu Jianshen, was only two years old; therefore, on 15 September, high-ranking civil and military officials led by Yu Qian persuaded the Empress Dowager to support Zhu Qiyu's enthronement to avoid the instability of a child ruler. On 22 September 1449, the Prince of Cheng was enthroned as the Jingtai Emperor. Emperor Yingzong was granted the title of Taishang Huang (). However, Empress Dowager Sun stipulated that the Ming dynasty still belonged to Emperor Yingzong and that the Jingtai Emperor would merely act as a regent. She also officially appointed Zhu Jianshen heir to the throne.\nThe Jingtai Emperor worked to strengthen the country, successfully repelling the invasion of the Oirat Mongols and restoring stability to the nation. Additionally, he implemented reforms and adjustments across the political, economic, and military spheres, which contributed to a gradual revival of Ming society. In 1450, after Emperor Yingzong was released and returned to Beijing, the Jingtai Emperor placed him under house arrest in the Southern Palace. As he gradually solidified his hold on the throne, the Jingtai Emperor sought to secure his lineage by making his son, Zhu Jianji, the legitimate heir. To this end, he began a series of political maneuvers, including orchestrating a plan to bribe court officials to gain their support for replacing Zhu Jianshen.\nCourse\nEmpress Dowager Sun's appointment of Zhu Jianshen as heir to the throne placed the Jingtai Emperor in a difficult position, necessitating a cautious approach. He first tested the experienced eunuch Jin Ying, saying \"Early the seventh month, on the second day, it will be the heir apparent's birthday\". Jin immediately replied, \"The heir apparent's birthday is on the second  of the eleventh month\". This was the birthday of Zhu Jianshen, while the date mentioned by the Jingtai Emperor was that of his son, Zhu Jianji (). Displeased with Jin's reply, the Emperor ended the conversation in frustration. Jin's bold reply was later seen as revealing his political leanings, which deepened the Emperor's mistrust. He was soon drawn into accusations of smuggling, misconduct, and later bribery. Although he initially avoided punishment, a renewed investigation eventually led to his dismissal in 1450, ending his influential role as director of ceremonial.\nIn his persistent efforts to change the succession, the Jingtai Emperor followed a suggestion from the eunuch Xing An to bribe court officials to gain their support. Soon after, the Emperor summoned the members of the Grand Secretariat, including Senior Grand Secretary Chen Xun () and Secondary Grand Secretary Gao Gu (), along with four others. After a brief and seemingly unimportant discussion, the meeting was abruptly adjourned. Subsequently, eunuchs sent by Xing An separately approached the officials and presented them with a sum of silver. Chen Xun and Gao Gu received 100 liang each, while the other four members each received 50 liang. Understanding the Emperor's intentions, all six officials accepted the bribes and remained silent on the matter afterward.\nFollowing his successful efforts to gain support from the Grand Secretariat, the Emperor secured the backing of other ministers. Despite the relatively small sums of silver involved, the officials understood the political implications of the gesture and unanimously agreed to the proposal to change the heir. The Emperor's wife, Empress Wang, strongly opposed the Emperor's decision because it threatened her own position. According to the established rules in the Ancestral Instructions, the imperial succession was considered more legitimate if the heir apparent were the son of the empress. Empress Wang had two daughters but no son, while Lady Hang was the mother of Zhu Jianji. She therefore feared that replacing Zhu Jianshen with Lady Hang's son would ultimately lead to her own removal as empress. Despite her opposition, her husband ultimately deposed her. On 20 May 1452, the Jingtai Emperor, citing the principle that \"when a father holds the empire, he must bequeath it to his son\", demoted his nephew Zhu Jianshen to the Prince of Yi. He then appointed his own son, Zhu Jianji, as the new heir, and made Lady Hang empress due to her son's status. Zhu Jianji died in 1454, leaving the Jingtai Emperor without any other heirs. According to the Ming law, Zhu Jianshen was the Emperor's closest blood relative, and officials urged for his reinstatement. Despite repeated pleas from court officials, the Jingtai Emperor refused to reinstate Zhu Jianshen as heir to the throne, fearing future repercussions. In response, some ministers who advocated for the prince's restoration were imprisoned and subjected to brutal treatment, with several being flogged to death. Among these was Zhong Tong (), an Investigating Censor of Guizhou Circuit, who openly criticized the Emperor, stating, \"The death of the heir apparent is enough to show that the Mandate of Heaven is still present\". He also pointed out numerous flaws in the Emperor's policies. The Jingtai Emperor, upon hearing this, became furious and had Zhong imprisoned and beaten to death.\nAftermath\nIn early 1457, the Jingtai Emperor suddenly fell gravely ill, which sparked a discussion among officials about the succession of the throne. On 10 February, news from the inner court indicated that the Emperor had recovered, prompting the ministers to plan a discussion on the new heir during the next day's court session. This plan was disrupted by a palace coup orchestrated by supporters of Emperor Yingzong that same night. During the coup, Emperor Yingzong was restored to the throne, while the Jingtai Emperor was deposed and died a month later.\nReferences\nCitations\nWorks cited\n*\n*\n*\n*\n*\n*\n*  |orig-year=1739}}"
    }
  ]
}