{
  "content": [
    {
      "type": "text",
      "text": "# Jiro (software)\n\nJiro is the registered name used by Sun Microsystems for an extension to Java and Jini.\nJiro as an industry initiative, along with an EMC initiative called \"Wide Sky\" were catalysts in the late nineties for a common interface to storage devices, leading to the Bluefin specification, subsequently donated to the SNIA for the foundation of the SMI-S industry standard.\nJiro was established by Sun in 1998 subsequent to acquiring a small company called Redcape Policy Software. Initially known by the moniker \"StoreX,\" this technology was targeted at storage management.  Jiro in many ways was a management oriented extension to Jini, leveraging many of Jini's ideas and capabilities for automatic detection of elements to be managed. Jiro was a Management Framework infrastructure based on a distributed runtime environment. It was standardized as [http://jcp.org/en/jsr/detail?id=9 JSR 9] by the Java Community Process.\nJiro never gained the broad industry support necessary for success, because every device had to have a custom adapter (or Management Facade), and it was withdrawn from the market in 2001.  Though never gaining commercial or industry acceptance, Jiro was one of the precursors to the development of the Storage Networking Industry Association's (SNIA) Storage Management Initiative (SMI) [http://www.snia.org/smi/home SNIA SMI Home Page], which has been seen as successful in promoting the use of open standards for storage management.  Mark Carlson (one of the first employees at Redcape) led this effort based on his experience at Sun Microsystems as a Jiro developer and evangelist. By 2005, most large storage systems providers had announced adoption of SNIA's SMI specifications within their storage management products.  The SNIA has now embarked on a project to standardize Management Frameworks along the lines of the earlier Jiro project using web services to communicate between standard service components.\nOverview\nJiro Implements an infrastructure for creating integrated and automated management software in a distributed, cross-platform environment. Jiro makes use of Jini technology for allowing services come and go in network.\nJiro introduces a middle tier of management between the client/GUI and other Java-based agent technologies such as JMX and JDMK. This middle tier is where the automation of management take place.\nJiro divides a management environment into domains. Each domain only a shared management server (a Java Virtual Machine running Jiro services) that represents the domain as a whole. Other private management server can host management services that are specific to their host.\nReferences"
    }
  ]
}