{
  "content": [
    {
      "type": "text",
      "text": "# Jizhong discovery\n\nThe Jizhong discovery () was the accidental rediscovery in 279 AD of a corpus of bamboo and wooden slips, as attested in the Book of Jin. The slips were found by a grave robber named Biao Zhun (). The entry of the Song-era Tongzhi encyclopedia on \"clans\" cites the robber as an example under its listing for  surnames and gives the pronunciation : 「不氏：甫鸠切。晋时有汲郡人不凖．」}} who had broken into the tomb of King Xiang of Wei (318–296&nbsp;BC). The rediscovered texts enabled philological study among scholars that had been impossible since the editorial work of Han-era scholars Liu Xiang and Liu Xin. The importance of the discovery has been compared to that of the Guodian Chu Slips for modern scholarship.\nProvenance\nThe initial editorial work on the slips was done by Xun Xu (d. 289), who was the director of the Jin imperial library, though its quality was questioned by his successors. Among his editions, only two have survived; the large number of quotations shows the extent of Xun Xu work's influence.\nAmong the works retrieved, collectively known as Jizhongshu (), the most important were the Bamboo Annals, but other works of interest include manuscripts of the Guoyu, the I Ching, the Tale of King Mu, the Suoyu ( 'Minor Sayings'), an anthology of zhiguai, and several Warring States-era glossaries.\nThough the majority of the collection have subsequently been lost, the restoration work, which involved identifying a great number of variant scripts as well as collating fragmented bamboo strips and finding parallels in the received literature of the time, sparked renewed interest in ancient texts and epigraphy among Xun Xu's contemporaries, such as Lü Chen (), who wrote his Zilin dictionary by extending the Shuowen Jiezi; Guo Pu, who annotated the Erya, Sancang, Fangyan, the Classic of Mountains and Seas, and the Tale of King Mu; and Zhang Hua, who wrote the encyclopedic Bowuzhi.\nSince the Book of Sui, the Jizhong cache is broadly referred as the source of the Yi Zhou Shu. However, this statement should be accepted with caution. Its source, the Book of Jin, indeed lists it among the titles of the Jizhong finds. However, some of the chapters presently contained in this compendium evidently postdate King Xiang’s era.\nNotes\nReferences\nCitations\nWorks cited\n*\n*\n*"
    }
  ]
}