{
  "content": [
    {
      "type": "text",
      "text": "# Joe Murphy (Irish republican)__disambig_1\n\n|birth_place  = Lynn, Massachusetts, United States\n|death_date   =\n|death_place  = Cork Gaol, County Cork, Ireland\n|restingplace = Saint Finbarr's Cemetery, Cork, Ireland\n|known_for    = Irish Republican Army prisoner who died on hunger strike\n|nationality = Irish\n}}\nJoseph Patrick Murphy (; 10 May 1895&nbsp;– 25 October 1920) was an Irish militant and Republican activist who was one of 22 Irish Republicans who died on hunger strike in the 20th century.  He was an officer in the Irish Republican Army who died as a result of his participation in the 1920 Cork hunger strike at Cork Gaol.\nBackground\nJoe Murphy was born in Lynn, Massachusetts in the United States of America on 10 May 1895 the son of Irish parents, Timothy Murphy and Nora O'Brien, who subsequently returned home to their native Cork City when Joe was a young child. He was educated at Togher National School and on leaving school was employed by Cork County Council.\nHe had an interest in the Gaelic sports of hurling, Gaelic football and road bowling.\nIrish Republican actions, hunger strike and death\nMurphy joined the Irish Volunteers in 1917 and became a volunteer in C Company, Second Battalion, Cork No.1 Brigade, eventually becoming commandant of H Company. He was involved in a number of attacks on British police and military posts including a well publicised attack on Farran police barracks a few miles west of Cork city.\nMurphy was arrested by British forces on 15 July 1920 for being in possession of a dud bomb used for throwing practice and was imprisoned in Cork County Gaol. Murphy faced a Military Tribunal but was not convicted or sentenced for any crime but was returned to Cork Gaol. On 11 August 1920, Murphy joined a large group of prisoners at the gaol on a hunger strike in conjunction with the Lord Mayor of Cork Terence McSwiney. Another Cork hunger striker, Michael Fitzgerald, died eight days before Murphy - 17 October 1920. Murphy and Fitzgerald's deaths occurred before the largest hunger strike in Irish history the 1923 Irish Hunger Strikes. The 1923 hunger strikes were protests carried out by republicans against the continuation of their internment without trial by the Irish Free State government.\nJoe Murphy died after seventy-six days without food on 25 October 1920 and was buried in the republican plot at St. Finbarr's Cemetery, Cork with full military honors.  His funeral cortege was led by volunteers carrying wreaths and the American flag. Joe Murphy is buried next to fellow hunger striker Terence MacSwiney (who also died on 25 October 1920) and the assassinated Lord Mayor of Cork Tomás Mac Curtain. A military court of inquiry was held and found that Murphy: \"...persistently refused to take food; that [the] said deceased was of sound mind, and deliberately caused his own existence to end and did feloniously kill himself.\"\nNine men continued the 1920 Cork hunger strike until it was called off by Arthur Griffith on 8 November 1920. The largest hunger strike in Irish history, the 1923 Irish Hunger Strikes, took place over the same issues that caused the 1920 hunger strike - use of military tribunals and the demand of release or political prisoner status.\nHonors and awards\nIn the late 1940s, Cork City Council built a large new housing estate at Ballyphehane. Many of the roads in the new estate were named after prominent figures in the Irish War of Independence including local figures and one of these thoroughfares was named Joe Murphy Road in his honour as it was quite close to his home at Lower Pouladuff Road.\nHe was posthumously awarded the Service (1917-1921) Medal with Bar by the Lord Mayor of Cork in respect of his service during the War of Independence, some 99 years after his death. The ceremony, held in Cork's City Hall on 9 May 2019, was attended by members of the Defence Forces and his family.\nFurther reading\n* Cork Jail Memorial Souvenir (pamphlet), 1948, Cló na Laoí (The Lee Press), Cork.\nReferences"
    }
  ]
}