{
  "content": [
    {
      "type": "text",
      "text": "# Joe Warham\n\n| birth_place     = Warrington, England\n| death_date      =\n| death_place     =\n| height          =\n| weight          =\n| first           = RU\n| position        =\n| club1           = Swinton\n| year1start      = 1946\n| year1end        = 48\n| appearances1    = 57\n| tries1          = 11\n| goals1          = 0\n| fieldgoals1     = 0\n| points1         = 33\n| club2           = Oldham RLFC\n| year2start      = 1948\n| year2end        = 54\n| appearances2    = 124\n| tries2          = 69\n| goals2          = 0\n| fieldgoals2     = 0\n| points2         = 207\n| ru_club1           = Royal Navy\n| ru_year1start      = 194?\n| ru_year1end        = 46\n| ru_appearances1    =\n| ru_tries1          =\n| ru_goals1          =\n| ru_fieldgoals1     =\n| ru_points1         =\n| coachteam1         = Rochdale Hornets\n| coachyear1start    =\n| coachyear1end      =\n| coachgames1        = 0\n| coachwins1         = 0\n| coachdraws1        = 0\n| coachlosses1       = 0\n| coachteam2         = Leeds\n| coachyear2start    = 1958\n| coachyear2end      = 62\n| coachgames2        = 0\n| coachwins2         = 0\n| coachdraws2        = 0\n| coachlosses2       = 0\n| coachteam3         = Leeds\n| coachyear3start    = 1969\n| coachyear3end      = 70\n| coachgames3        = 0\n| coachwins3         = 0\n| coachdraws3        = 0\n| coachlosses3       = 0\n| source             =\n| retired            = yes\n}}\nJoe Warham (1920 – 4 September 2013, Leeds, Yorkshire) was a rugby league footballer, coach and administrator, having been associated with Leeds Rugby League Football Club (now Leeds Rhinos) for more than fifty years.\nWarham was born in Warrington, Lancashire, England. Following a playing career as a  with Oldham and Swinton, and a spell coaching Rochdale Hornets, Joe went to Headingley as coach in 1958. Under his stewardship, and assisted by Dai Prosser, in 1960/61 Leeds won their first-ever championship, beating Warrington 25–10 in the final at Odsal Stadium.\nJoe later moved to head up Leeds' scouting and recruiting efforts, signing many of the players who formed the backbone of Leeds' very successful late 1960s, and 1970s side. As Roy Francis, coach in the mid-sixties, said later, with players that talented he had no need to coach or drill them – he sent them on to the pitch to play their natural game.\nIn 1969 Joe stepped up to coach Leeds again on an interim basis following Roy Francis' departure, and once again brought success, the club winning the championship for a second time.\nIn the seventies Joe served the club in a number of capacities, including scouting, organising players' testimonials and representing the club on various RL committees, before being made General Manager of the Company in 1980. His period of tenure saw a number of significant ground improvements at Headingley – including, on the Test cricket ground, the UK's first electronic cricket scoreboard. After leaving the board he served as president of Leeds' Taverners' Club and as President of Leeds' ex-players' association.\nCoaching career\nJoe Warham was the coach in Leeds' 25–10 victory over Warrington in the Championship Final during the 1960–61 season at Odsal Stadium, Bradford on Saturday 20 May 1961, in front of a crowd of 52,177.\nReferences\nExternal links\n* [http://www.eraofthebiff.com Era of the Biff]\n* Hodgson, Phil; Headingley Heroes\n* Leeds RL supporters' handbooks\n* press reports\n* [http://www.therhinos.co.uk/news/21364.php#.UloT_NKsiSo Notice of death]\n*[http://www.thisischeshire.co.uk/sport/8356272.CUP_FINAL__Legend_tells_of_split_loyalties/ CUP FINAL: Legend tells of split loyalties]\n}}"
    }
  ]
}