{
  "content": [
    {
      "type": "text",
      "text": "# Joella (drag queen)\n\n| birth_date         =\n| birth_place        =\n| nationality        =\n| other_names        = Joella Perry\n| siglum             =\n| citizenship        =\n| education          =\n| alma_mater         =\n| occupation         =\n| years_active       =\n| era                =\n| employer           =\n| organization       =\n| agent              =\n| known_for          =\n| notable_works      =\n| style              =\n| height             =\n| television         = ''RuPaul's Drag Race'' (season 17)\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| mother             =\n| father             =\n| relatives          =\n| family             =\n| callsign           =\n| awards             =\n| website            =\n| signature          =\n| signature_type     =\n| signature_size     =\n| signature_alt      =\n| footnotes          =\n}}\nJoella is the stage name of Joey (born November 16, 1999), an American drag performer who competed on the seventeenth season of ''RuPaul's Drag Race''. She finished in thirteenth place.\nBiography\nJoella was raised in Corona, California.\nCareer\nJoella is a drag performer also known as Joella Perry. The first drag performance she saw was Frank Marino's celebrity impersonation show in Las Vegas, Nevada. She decided to start performing after being shown clips of Alyssa Edwards, Tatianna, and Sasha Velour competing on Drag Race by her friend. She began performing at 340 Nightclub in Pomona where she met her \"drag mother\", Reina. In 2021, she performed alongside Katy Perry for the opening night of her Play concert residency at Resorts World Theatre in Las Vegas. In 2023, Joella appeared in the music video for Baby Tate's song \"Wig\". The first name of Joella's drag persona came from a friend from high school.\nOn the seventeenth season of ''RuPaul's Drag Race'', Joella was eliminated on the fourth episode (\"Bitch, I'm a Drag Queen!\") after placing in the bottom two and losing a lip-sync contest against Kori King. Joella placed 13th overall.\nJoella was labelled a \"breakout star\" of the season for her \"mixture of confidence, emotional outbursts, and quotable commentary\". Her titling herself \"the Slaysian diva of Los Angeles\" sparked numerous commentaries and parodies. The runway outfit she wore during her elimination, resembling a \"mattress... with a  face-hole cut out of it and a giant print of RuPaul's Born Naked album cover photo\", became beloved among the show's fans for its \"absurd\" and \"camp\" qualities. Her Instagram following grew by 346 percent while the show aired.\nPersonal life\nJoella is based in Koreatown, Los Angeles. She is gender-fluid and of Chinese descent.\nDiscography\nSingles\n*\"Don't Forget The 'Ella\" (2025)\nFilmography\nTelevision\n* ''RuPaul's Drag Race (season 17, 2025)\n* RuPaul's Drag Race: Untucked (2025)\nWeb series\n{| class=\"wikitable plainrowheaders sortable\"\n|-\n! scope=\"col\" | Year\n! scope=\"col\" | Title\n! scope=\"col\" | Role\n! scope=\"col\" | Notes\n! style=\"text-align: center;\" class=\"unsortable\"|\n|-\n|rowspan=\"2\" |2025\n|Hello Hello Hello\n|Herself\n|Guest\n|\n|-\n|Binge Queens: Drag Race Philippines: Slaysian Royale''\n|Herself\n|Host\n|\n|}\nReferences"
    }
  ]
}