{
  "content": [
    {
      "type": "text",
      "text": "# Joel Hayward\n\n| birth_place      = Christchurch, New Zealand\n| death_date       =\n| death_place      =\n| nationality = New Zealand and United Kingdom\n| discipline =\n| era              =\n| workplaces  =\n| alma_mater = University of Canterbury\n| main_interests   = War and strategy; airpower, joint warfare, Quranic (Islamic) concepts of war, Islamic history.\n| notable_ideas    =\n| major_works      =\n| influences       =\n| influenced       =\n| website            =\n}}\nJoel Hayward (born 1964)  is a New Zealand-born British scholar, academic and writer. He has been listed in the 2023, 2024, 2025 and 2026 editions of ''The World's 500 Most Influential Muslims. He has been the Dean of the Royal Air Force College Cranwell, the Chair of the Department of Humanities and Social Sciences as well as Director of the Institute for International and Civil Security at Khalifa University, and the Chief Executive of the Cambridge Muslim College in the United Kingdom. He is now the Dean of the Sycamore Leadership Academy, based in Istanbul. He is also a member of the management board of the Association of British Muslims, which he serves as Director of Leadership and Academic Affairs. He was tutor to Prince William of Wales, the heir apparent to the British throne.\nHe is best known for his published books and articles on strategic and security matters, including the use of air power, his work on leadership, his 2003 biography of Horatio Lord Nelson, his writing and teaching on the Islamic concepts of war, strategy and conflict, his Sirah works on Muhammad, and his works of fiction and poetry. He is a Fellow of the Royal Historical Society and a Fellow of the Royal Society of Arts. One of his most recent books, The Leadership of Muhammad: A Historical Reconstruction, was chosen as the Best International Non-Fiction Book at the 2021 Sharjah International Book Awards. For his book The Warrior Prophet: Muhammad and War'', Hayward won an International Author Excellence Award 2025 from the International Authors' Association.\nEarly life and education\nJoel Hayward was born on 27 May 1964 in Christchurch, New Zealand.\nIn 1988 Hayward enrolled with the University of Canterbury in Christchurch to pursue a Bachelor of Arts degree in Classics and History, which he received on 8 May 1991. Following this, he commenced a Master's Degree program in 1991. For his thesis, Hayward analyzed the historiography of Holocaust denial.\nHayward went on to pursue a PhD degree, also at University of Canterbury, again under the supervision of Vincent Orange. His topic was an analysis of German air operations during the eastern campaigns of World War II, based on unpublished German archival sources. In 1994, the U.S. Air Force Historical Research Agency, located within the Air University at Maxwell Air Force Base, Alabama, awarded him a research fellowship to conduct research for his dissertation in its archives. He subsequently received a research fellowship from the Federal Government of Germany which enabled him to conduct primary research in the German Military Archives in Freiburg, Germany. Hayward was awarded his PhD in 1996. His dissertation, ''Seeking the Philosopher's Stone: Luftwaffe Operations during Hitler's Drive to the East, 1942–1943 became the basis of his first book, Stopped at Stalingrad: The Luftwaffe and Hitler's Defeat in the East 1942-1943.\nAcademic and professional career\nMassey University\nIn June 1996 Hayward joined the History Department of Massey University (Palmerston North Campus) as a lecturer in defence and strategic studies, receiving promotion to Senior Lecturer in August 1999. He specialized in the theoretical and conceptual aspects of modern warfare, airpower, joint doctrines, and manoeuvre warfare. He continued in that position until June 2002. He was made Head of the Defence and Strategic Studies program.\nFrom 1997 to 2004 he was also a lecturer at the Officer Cadet School of the New Zealand Army, where he taught military history from Alexander the Great to the Balkan Wars, and at the Command and Staff College of the Royal New Zealand Air Force, where he taught airpower history and doctrine and supervised advanced research in military history. During the same period he also taught strategic thought at the Royal New Zealand Naval College. He also wrote academic articles for defence and strategic studies publications.\nWork in the United Kingdom\nHayward lived and worked in the United Kingdom from 2004 to 2012 first teaching strategy and operational art at the Joint Services Command and Staff College. In November 2005 he became the head of the newly created Air Power Studies Division, a specialist unit of Defence Studies academics established by the Royal Air Force and King's College London at the Royal Air Force College, Cranwell. Hayward was appointed Dean of the RAF College, Cranwell in April 2007. He was a Director of the Royal Air Force Centre for Air Power Studies, the Air Force's national thinktank. He was also a member of the CAS Air Power Workshop, a small select working group of scholars and other theorists convened by the Chief of Air Staff (the head of the Royal Air Force.)\nHe is a member of the editorial advisory boards of the academic journals, Air Power Review and Global War Studies. He taught on air power concepts at various staff colleges and universities throughout Europe and in 2007 taught a course on \"Air Power and Ethics\" in Trondheim, Norway, to the Norwegian Air Force\nWork in the United Arab Emirates\nIn November 2012, Hayward became full Professor of International and Civil Security in Khalifa University's Institute for International and Civil Security and in 2013 he became Chair of the Department of Humanities and Social Sciences at Khalifa. He also serves there as the Director of the Institute of International and Civil Security. In 2014 he also joined the editorial board of the Islamic Studies journal, Islamic Rethink. In 2016, he was named as the “Best Professor of Humanities and Social Sciences” at the Middle East Education Leadership Awards.\nHayward and Islam\nHayward converted to Islam in 2005 and has lectured at anti-extremism workshops. He supports Muslims serving in the British armed forces and is a member of the UK Armed Forces Muslim Association. Hayward describes himself as \"a moderate and politically liberal revert who chose to embrace the faith of Islam because of its powerful spiritual truths, its emphasis on peace and justice, its racial and ethnic inclusiveness and its charitable spirit towards the poor and needy.\"\nHe worked with an international Muslim human rights and welfare group called Minhaj-ul-Quran and was appointed as strategic advisor to Tahir ul-Qadri and contributed to several of the group's anti-radicalisation workshops. He has earned ijazat (teaching authorizations) in several Islamic sciences.\nHe is considered to be one of \"the world's five hundred most influential Muslims,\" with his listing in the 2023, 2024, 2025 and 2026 editions of The Muslim 500 stating that \"he weaves together classical Islamic knowledge and methodologies and the source-critical Western historical method to make innovative yet carefully reasoned sense of complex historical issues that are still important in today's world.\".\n1991 Master's thesis\nHayward's 1991 M.A. thesis was judged the best history thesis of his year and it won him the Sir James Hight Memorial Prize for \"excellence\" and the honour of wearing the Philip Ross May Gown at the graduation ceremony. The thesis was submitted in 1993 yet was unavailable for public study until 1999. When it became available, Hayward was accused of advancing arguments which gave credence to Holocaust deniers. In 2000, at the request of the New Zealand Jewish Council, the University of Canterbury convened a \"Working Party\" which issued a report admonishing the university for inadequately supervising Hayward's work. The report found that Hayward's thesis showed significant industry and no evidence of dishonesty but was \"seriously flawed\". Subsequent to the issuance of the Working Party's report, the university apologized to the New Zealand Jewish community. Hayward admitted inexperience and regret over his thesis.\nThe thesis was embargoed for an unusually long period, and he requested its removal from the university library, which was denied.\nAcademics, politicians, and community leaders, including Act MP Rodney Hide and Roger Kerr, petitioned to clear Hayward's name and decry University of Canterbury's handling of the thesis issue.\nDespite what transpired, Hayward clearly upholds the sound and accepted scholarly assessment of the Holocaust. In 2010 he described it as \"one of history’s vilest crimes … involving the organised murder of millions of Jews\" and in 2011 he similarly wrote: \"The Holocaust of the Jews in the Second World War, one of history’s vilest crimes, involved the organised murder of six million Jews by Germans and others who considered themselves Christians or at least members of the Christian value system.\" Likewise, in his 2012 book, Warfare in the Quran, he criticised \"the undoubted evils of Nazism\". In a 2018 interview, he said: \"I can’t help but conclude that humans are, by and large, rather unkind to each other and sometimes utterly hateful. … How else can we explain ordinary German soldiers and paramilitary people murdering six million Jewish civilians in history’s greatest atrocity?”\nLibel suit\nIn October 2013, Hayward prevailed in a libel case against The Mail on Sunday and The Daily Mail, which had wrongly alleged that Hayward had unfairly favoured Muslim students at the RAF College, and he was awarded a retraction, an apology, and damages described as \"substantial.\"\nWriting\nHayward is the author or editor of eighteen non-fiction books, including ''Stopped at Stalingrad: The Luftwaffe and Hitler's Defeat in the East 1942-1943 (1998 and subsequent editions), an assessment of aerial warfare at the Battle of Stalingrad, and various books on the Prophet Muhammad and the Islamic ethics of war.\nSelected works\nNon-fiction\n* (1998). Stopped at Stalingrad: The Luftwaffe and Hitler's Defeat in the East 1942-1943. Modern War Studies series. Lawrence, KS: University Press of Kansas. .\n— Softcover edition (2000). .\n* (2000). (edited). A Joint Future? The Move to Jointness and its Implications for the New Zealand Defence Force. Massey University, Centre for Defence Studies.\n* (2000). [http://www.joelhayward.org/adolfhitlerandjointw.htm Adolf Hitler and Joint Warfare.]  Military Studies Institute Working Papers Series No. 2/2000. Military Studies Institute, New Zealand Defence Force.\n* (2003). For God and Glory: Lord Nelson and His Way of War. Annapolis, MD: U.S. Naval Institute Press. .\n— Softcover edition (2019) .\n* (2003). (with Glyn Harper). Born to Lead? Portraits of New Zealand Commanders. Auckland: Exisle Publishing. .\n* (2006). Stalingrad. Pen & Sword Battleground series. London: Millennium. .\n* (2009). (edited). Air Power, Insurgency and the \"War on Terror\". Royal Air Force Centre for Air Power Studies. .\n* (2012). Warfare in the Qur'an English Monograph Series – Book No. 14. Royal Islamic Strategic Studies Centre, Amman, Jordan. .\n* (2013). (edited). Airpower and the Environment: the Ecological Implications of Modern Air Warfare Air University Press. . ([https://web.archive.org/web/20171201035158/https://media.defense.gov/2017/Mar/31/2001725157/-1/-1/0/B_0131_HAYWARD_AIRPOWER_ENVIRONMENT.PDF online]).\n* (2015). Zatrzymani pod Stalingradem: Klęska Luftwaffe i Hitlera na wschodzie 1942-1943. Warsaw: 2015. .\n* (2017). [http://rissc.jo/war-is-deceit-by-professor-joel-hayward/ \"War is Deceit\": An Analysis of a Contentious Hadith on the Morality of Military Deception.]   English Monograph Series – Book No. 24. Royal Islamic Strategic Studies Centre, Amman, Jordan. .\n* (2018). [http://rissc.jo/civilian-immunity-by-professor-joel-hayward/ Civilian Immunity in Foundational Islamic Strategic Thought: A Historical Enquiry.]   English Monograph Series – Book No. 25. Royal Islamic Strategic Studies Centre, Amman, Jordan. .\n* (2018). [http://rissc.jo/%d8%a7%d9%84%d8%ad%d8%b5%d8%a7%d9%86%d8%a9-%d8%a7%d9%84%d9%85%d8%af%d9%86%d9%8a%d8%a9/ الحصانة المدنية في الفكر الاستراتيجي الإسلامي التأسيسي : تحقيقٌ تاريخي .]   Arabic Monograph Series. Royal Islamic Strategic Studies Centre, Amman, Jordan. .\n* (2020). [https://rissc.jo/islamic-principles-of-war/ Islamic Principles of War for the 21st Century]. English Monograph Series – Book No. 26. Royal Islamic Strategic Studies Centre, Amman, Jordan. .\n* (2021). [https://kotobshop.com/Details?id=133669  لله وللمجد: اللورد نيلسون وأسلوبه في الحرب]. Amman: Dar Osama (2021). .\n* (2021). [https://muhammad-leader.com The Leadership of Muhammad: A Historical Reconstruction]. Swansea, UK: Claritas Books. .\n* (2021). Muhammed kao lider: historijska rekonstrukcija. Tuzla: Dialogos, 2022. .\n* (2021). Etika rata u islamu. Tuzla: Dialogos, 2022. .\n* (2022). The Warrior Prophet: Muhammad and War. Swansea, UK: Claritas Books. .\n* (2023). [https://shorok.com/%D9%82%D9%8A%D8%A7%D8%AF%D8%A9-%D9%85%D8%AD%D9%85%D8%AF-%D8%A7%D8%B9%D8%A7%D8%AF%D8%A9-%D8%A8%D9%86%D8%A7%D8%A1-%D8%AA%D8%A7%D8%B1%D9%8A%D8%AE%D9%8A قيادة محمد ﷺ اعادة بناء تاريخي]. (Amman: Dar Al-Shorouk, 2023). .\n* (2024). Hz. Muhammed'in Liderliği: Peygamberimizin Siyasi, Askerî ve Sosyal Hayatta Yol Göstericiliği. Ankara, Turkey: Pelikan Kitabevi. .\n* (2025). The Leadership of Muhammad: Kepemimpinan Muhammad dalam Rekonstruksi Sejarah. Jakarta, Indonesia: Quanta. .\nFiction and poetry\n* (2003). Jenny Green Teeth and other Short Stories. Palmerston North, New Zealand: Totem Press. .\n* (2003). Lifeblood: A Book of Poems. Palmerston North, New Zealand: Totem Press. .\n* (2012). Splitting the Moon: A Collection of Islamic Poetry. Leicester: Kube Publishing. .\n* (2012). No Lamp in the Cave: Three Islamic Short Stories. CreateSpace. .\n* (2017). Poems from the Straight Path: A Book of Islamic Verse. Ashland, Oregon: White Cloud Press. .\n* (2018). Pain and Passing: Islamic Poems of Grief & Healing (Swansea: Claritas Books).\n* (2018). جني ذات الأسنان الخضراء وقصص قصيرة أُخرى. (Amman: Dar Al-Shorouk, 2018). .\n* (2018). وحشيّ وغيرها من القصص الإسلامية القصيرة (Amman: Dar Al-Shorouk, 2018). .\n* (2018). The Savage and other Short Islamic Stories'' (Swansea: Claritas Books).\nReferences"
    }
  ]
}