{
  "content": [
    {
      "type": "text",
      "text": "# Joel Edwards (rugby league)\n\n|birth_place    = Cessnock, New South Wales, Australia\n|height         =\n|weight         =\n|position       =\n|club1          = Newcastle Knights\n|year1start     = 2010\n|year1end       = 12\n|appearances1   = 45\n|tries1         = 0\n|goals1         = 0\n|fieldgoals1    = 0\n|points1        = 0\n|club2          = Canberra Raiders\n|year2start     = 2013\n|year2end       = 15\n|appearances2   = 43\n|tries2         = 3\n|goals2         = 0\n|fieldgoals2    = 0\n|points2        = 12\n|club3          = Wests Tigers\n|year3start     = 2016\n|year3end       = 17\n|appearances3   = 20\n|tries3         = 1\n|goals3         = 0\n|fieldgoals3    = 0\n|points3        = 4\n|club4          = Limoux Grizzlies\n|year4start     = 2018\n|year4end       =\n|appearances4   = 12\n|tries4         = 2\n|goals4         = 0\n|fieldgoals4    = 0\n|points4        = 8\n|club5          = York City Knights\n|year5start     = 2018\n|year5end       =\n|appearances5   = 7\n|tries5         = 2\n|goals5         = 0\n|fieldgoals5    = 0\n|points5        = 8\n|club6          = Newcastle Thunder\n|year6start     = 2019\n|year6end       = present\n|appearances6   = 16\n|tries6         = 5\n|goals6         = 0\n|fieldgoals6    = 0\n|points6        = 20\n|retired        =\n|source         =\n|updated        = 17 May 2019\n}}\nJoel Edwards (born 17 July 1988) is an Australian professional rugby league footballer for the Newcastle Thunder in League 1. He plays as a  and . He previously played for the Wests Tigers, Newcastle Knights and the Canberra Raiders in the NRL, the Limoux Grizzlies in the Elite One Championship and York City Knights in the RFL Championship.\nBackground\nBorn in Cessnock, New South Wales, Edwards played his junior rugby league for the Cessnock Goannas in the Newcastle Rugby League, before being signed by the Newcastle Knights.\nPlaying career\nEarly career\nIn 2008, Edwards played for the Newcastle Knights' NYC team. In 2009, he spent a year back with the Cessnock Goannas before moving on to the Knights' New South Wales Cup team, Central Coast Centurions in 2010.\n2010\nIn Round 15 of the 2010 NRL season, Edwards made his NRL debut for the Knights against the Parramatta Eels. On 9 September 2010, he was named on the interchange bench in the 2010 New South Wales Cup Team of the Year.\n2011\nAfter playing 4 games in 2010, Edwards was recalled to the team in Round 4 of the 2011 NRL season and didn't miss a game for the rest of the year. On 13 September, he won the Once-A-Knight Old Boys Gladiator Award at the Knights' end of season awards night.\n]]\n2012\nOn 2 August, it was confirmed by Knights CEO Matthew Gidley, that Edwards would quit the club at the end of the season after knocking back 3 separate offers. On 6 August, he signed a 3-year contract with the Canberra Raiders starting in 2013.\n2013\nIn Round 1 of the 2013 NRL season, Edwards made his Raiders debut against the Penrith Panthers. On 12 September, he won the Raiders' Coach's Award alongside Brett White at the club's end of season awards night.\n2014\nOn 16 April, Edwards re-signed with the Raiders on a 3-year contract.\n2015\nOn 28 September, Edwards signed a 2-year contract with the Wests Tigers starting in 2016, after being released from the final 2 years of his Raiders contract.\n2017\nEdwards was named in the Tigers squad for the 2017 NRL Auckland Nines. On 6 September 2017, Edwards was one of the nine players that were released by The Wests Tigers at the end of the season following a poor year on the field for the club. He joined Limoux for their 2017–18 season.\nReferences\nExternal links\n*[http://www.weststigers.com.au/team/profiles/joel_edwards.html Wests Tigers profile]\n*[https://web.archive.org/web/20150204164844/http://www.raiders.com.au/team/profiles/joel-edwards.html 2015 Canberra Raiders profile]"
    }
  ]
}