{
  "content": [
    {
      "type": "text",
      "text": "# Johannesburg Heritage Foundation\n\nThe Johannesburg Heritage Foundation  (JHF) is an activist, conservation and education organization that aims to conserve the built heritage of Johannesburg, South Africa, while informing residents about the city's \"precious, non-renewable, finite and irreplaceable\"  heritage resources.\nSince the discovery of gold, in 1886, and the establishment of the first hotel at Ferreirasdorp, the city's infrastructure has benefited from investments associated with the mining industry. Under apartheid, aided by cheap labour, Johannesburg became the city of gold, a regional powerhouse and experienced enormous economic and spatial growth. Post-democracy corruption has meant that many parts of the greater metropolis have been neglected and lost their shine. Foundation members are committed to the whole city, providing a balanced representation of the city's heritage, raising awareness of architecture and buildings and commemorating a diverse culture with blue plaques. The foundation has had a significant impact, and has earned its reputation as a defender to the city's diverse heritage and cultural public infrastructure, such as the Johannesburg City Library.\nHistory\nThe foundation offers access to many heritage resources, through tours, research and education. Its focus is on retaining Johannesburg's existing cultural heritage for generations to come. It grew from the Parktown & Westcliff Heritage Trust, an organization that wished to support the heritage of Parktown Mansions and other suburbs. The foundation recognized that heritage extended beyond the Randlords mansions could be found across the greater metropolis.\nBlue plaques\nThe City of Johannesburg, Department of Arts, Culture and Joburg Heritage Foundation collaborate on placing a round plaques in publicly visible locations. These blue plaques might commemorate a famous person or event, while raising public awareness about heritage, foster citizen pride. The plaques are installed in publicly visible locations and are intended to protect and preserve historical landmarks.\nBook collection drives\nJHF's Book collection drives are run to raise funds for the Johannesburg Heritage Foundation. The JHF Heritage Weekend Map and Book Sale is often held at grand houses or heritage buildings. The sale is an important fundraiser for the JHF. The 2025 Sale will be held at the Sisonke Hall at Holy Family College on the 13 and 14 September.\nReferences"
    }
  ]
}