{
  "content": [
    {
      "type": "text",
      "text": "# John Edward Courtenay Bodley\n\nJohn Edward Courtenay Bodley (6 June 1853 – 28 May 1925) was an English civil servant, known for his writings on France.\nLife\nHe was the son of the pottery owner Edward Fisher Bodley (1815–1881), and his wife Mary Ridgway Bodley, and brother of the pottery owner Edwin James Drew Bodley.-  He was educated at Mill Hill School and studied at Balliol College, Oxford, from 1873 to 1876. An active Freemason, he approached Oscar Wilde, then also an undergraduate, and introduced him to a Masonic Lodge in Oxford.[http://www.freemasons-freemasonry.com/beresiner8.html OSCAR WILDE Freemasons]- Jonathan Fryer, Wilde (2004), p. 16. Richard Ellmann attributes to Bodley a long, spiteful New York Times article that appeared on Wilde, on 21 January 1882. \"Bodelino\" was a member of James McNeill Whistler's circle in Paris.\nHe was secretary to Charles Dilke, from 1880. Initially Dilke thought him frivolous, but he came to play a major part in Dilke's official work and private life. He was a witness in the divorce case that broke Dilke's career. He subsequently believed that Dilke's downfall was caused by Joseph Chamberlain.\nA personal friend of Cardinal Manning (\"almost certainly his most intimate non-Catholic friend\", and Manning's preferred choice as biographer), he was his biographer only in a short work.\nPolitical writing\nBodley's political writings are in the general tradition of Hippolyte Taine, whom Bodley knew. When Émile Boutmy, a follower of Taine, had his work on England in the same vein translated into English, Bodley wrote an introduction.\nShane Leslie, a friend, described him as \"one of the last cultured Europeans\". A 1928 work by Charles Maurras about him was entitled ''L'anglais qui a connu la France; Maurras had already studied Bodley in 1902, in Deux témoins de la France.\nWorks\n*[https://catalog.hathitrust.org/Record/000417210 France] (1898, two volumes)\n* L'Anglomanie et les Traditions Françaises (1899)\n*The Coronation of Edward the Seventh: A Chapter of European and Imperial History (1903). The official account.\n*The Church In France (1906)\n*Cardinal Manning; The decay of idealism in France; The Institute of France (1912)\n*L'Age Mécanique et le Déclin de l'idéalisme en France (1913)\n*The Romance of the Battle-Line in France (1920)\nFamily\nHe was a descendant of Sir Thomas Bodley, founder of the Bodleian Library. He married Evelyn Frances Bell but they divorced in 1908. His sons were Ronald Victor Courtenay Bodley and the artist Josselin Reginald Courtenay Bodley (1893-1974), who were also the joint dedicatees of France. His daughter Ava married Ralph Wigram in 1925, and John Anderson, 1st Viscount Waverley, in 1941.\nReferences\n*Shane Leslie (1930), Memoir of John Edward Courtenay Bodley''\nNotes\nExternal links\n*[http://archives.balliol.ox.ac.uk/images/Portraits/026.jpg Portrait by Gilbert Baldry, Balliol Archives]"
    }
  ]
}