{
  "content": [
    {
      "type": "text",
      "text": "# John Golding (art historian)\n\n| image            = John Golding art historian.webp\n| alt              = Face of Golding: an older man, balding, wearing a tweed jacket and a black turtleneck sweater\n| caption          =\n| other_names      =\n| education        =\n| occupation       = Artist and art historian\n| partner          =\n| birth_date       =\n| death_date       =\n| birth_place      = St Leonards-on-Sea, East Sussex, England\n| death_place      = Charing Cross Hospital, London\n| module           =\n| notable_students =\n| alma_mater = Courtauld Institute of Art\n| thesis_title = Cubism: A History and an Analysis, 1907–1914\n| thesis_year = 1957\n| academic_advisors =\n}}\n| birth_name       = Harold John Golding\n}}\nHarold John Golding  (10 September 1929 – 9 April 2012) was a British artist, art scholar, and curator. Born in East Sussex, Golding spent most of his childhood in Mexico, where both his parents were settled. There, he met several artistic and cultural figures, including Leonora Carrington, Diego Rivera, Juan O'Gorman and José Orozco, who became influential upon his later artistic practice. He was sent to board at Ridley College in St. Catharines, Canada, and&nbsp;– despite wishing to train as an artist&nbsp;– subsequently read art and archaeology at the University of Toronto. While at Toronto he made frequent visits to the Museum of Modern Art in New York City, and on the encouragement of his professor, Peter H. Brieger, he moved in 1951 to the Courtauld Institute of Art in London.\nGolding became interested in Cubism after attending an exhibition on it in 1953, and wrote his doctoral thesis on the early history of the movement. This was completed in 1957, and developed into a book, Cubism: A History and an Analysis, 1907–1914, first published in 1959. Golding's work argued that Cubism should be understood as a realist movement, and that Georges Braque should be considered its co-founder alongside Pablo Picasso. He taught at the Courtauld between 1959 and 1981, when he moved to the Royal College of Art. He remained there until 1986, when he resigned to focus on his artistic work.\nGolding's paintings included Torso (), Light from Troy (1986), Pulse (1991–1992), and Arco&nbsp;Iris (1992). His early works often depicted human torsos in dark colours and bold brushstrokes. After the early 1960s, he transitioned towards large-scale, abstract works in landscape orientation, and an emphasis on colour and light. He was inspired by Renaissance painting, by the works of J. M. W. Turner and Paul Cézanne, and by modernist artists such as Wassily Kandinsky and Mark Rothko. He was also a curator, who organised several exhibitions at the Tate in London, often in collaboration with his former students. He was made a CBE in 1992 and a Fellow of the British Academy in 1994.\nGolding suffered from depression throughout his life, and believed that it may have influenced the dark colouration of some of his early paintings. He was the life partner of the historian James Joll, and persuaded Joll to shelter Anthony Blunt, who had taught Golding at the Courtauld, in their home when it was revealed in 1979 that Blunt had been spying for the Soviet Union. Joll died in 1994, and Golding's physical and mental health deteriorated. He made his last paintings around 2000, grew increasingly deaf and reclusive, and died of ischaemic colitis in 2012.\nBiography\nHarold John Golding, known as John, was born on 10 September 1929 in the English town of St Leonards-on-Sea, near Hastings, East Sussex. He was the younger of two children; his father, Harold Samuel Golding, was an insurance broker, and his mother, Dorothy (), was a piano teacher. Harold and Dorothy Golding, both English, had met in Mexico City, where Dorothy's family had lived since the early nineteenth century and to where Harold had moved in 1919.\nThe younger Golding was raised for most of his childhood in Mexico, where he learned English and Spanish. He attended Ridley College in St. Catharines, Canada, as a boarder from the age of thirteen. As a teenager, he fell into the coterie of Leonora Carrington, an expatriate English surrealist artist. Through Carrington he met the artists Diego Rivera, Juan O'Gorman and José Orozco, who became major influences on his own artistic practice, and other cultural figures, often living in exile due to the Second World War, such as the filmmaker Luis Buñuel and the poets Octavio Paz and Benjamin Péret. in 1907]]After the war, Golding had wished to train as an artist, but was persuaded by his parents to study art and archaeology at the University of Toronto in Canada, which he attended on a scholarship. While studying in Toronto, he worked as a set designer for theatre, and frequently visited the Museum of Modern Art in New York City, where he was particularly inspired by the displays curated by Alfred Barr. On the encouragement of Peter H. Brieger, Toronto's professor of art history, he moved in 1951 to the Courtauld Institute of Art in London to study for an MA. He became interested in the Cubist movement after attending a 1953 exhibition on it at the Musée d'Art Moderne in Paris. During this period he interviewed the surrealist artist Marcel Duchamp and met the aesthetic philosopher Richard Wollheim. He also corresponded with the Hungarian–Mexican painter Gunther Gerzso, to whom he confided his worries that the dark colouration of his own paintings reflected his depressed mental state.\nFollowing his encounter with Cubism, and after a year spent teaching in the American University of Mexico City between 1953 and 1954, Golding undertook a programme of doctoral study at the Courtauld. He wrote his thesis on the history of the Cubist movement between 1907 (the year of Picasso's ) and 1914. His first supervisor was Douglas Cooper. Cooper's support introduced Golding to figures in the field in Europe and the United States, and to the historian James Joll, who became his long-term life partner from the mid-1950s. Cooper attempted, unsuccessfully, to have Golding's thesis disqualified for plagiarism: Elizabeth Cowling, later Golding's student and biographer, attributed Cooper's actions to jealously, and the relationship between the two men was permanently soured. Cooper's colleague Anthony Blunt took over the supervision of Golding's thesis, which was submitted in 1957. Golding's book Cubism: A History and an Analysis, 1907–1914 was developed from it, and first published in 1959.\nGolding spent a year living and painting on Italy's Amalfi Coast, then, at Blunt's suggestion, took a lecturership teaching \"Art of the Modern Period\" at the Courtauld Institute of Art in 1959. He took the position on the condition that the work would leave him sufficient time for his own painting. Among his doctoral students there were Christopher Green, who wrote his thesis on the French painter Fernand Léger in 1973,}} and David Anfam, who wrote his on the American painter Clyfford Still. He also taught the art historians Dawn Ades,  T. J. Clark and John Elderfield; the dealer Nigel Greenwood; and the writer and journalist Gillian Darley. His students in Mexico included the American painter Allan D'Arcangelo.\nIn 1975, Golding and Joll were the subject of From London, a portrait by their friend R. B. Kitaj. It became public in November 1979 that Blunt had been a Soviet spy since the 1930s: Golding persuaded Joll to shelter Blunt (then Golding's colleague at the Courtauld) in their Chiswick home. The press generally believed Blunt to have fled to continental Europe, and widely criticised Joll when his actions were discovered. At one point, Blunt gave Golding custody of the typescript of his memoirs.\nIn 1981, Golding moved to the Royal College of Art, where he was made senior tutor in the school of painting. He resigned from the college in 1986 to focus on his painting, which was increasingly commercially successful. He was appointed a CBE in the 1992 New Year Honours, and was elected a Fellow of the British Academy in 1994, the first historian of modern art to do so. Joll died in the same year. In later life, Golding moved to Shepherd's Bush in West London. He was in poor physical and mental health, reclusive, and increasingly affected by deafness and alcoholism. He stopped painting, but continued to write reviews in the New York Review of Books. His last, in December 2011, was on the Rococo painter Antoine Watteau. He died of ischaemic colitis at Charing Cross Hospital, London, on 9 April 2012.\nWork\nAcademic\nin 1910]]\nIn an obituary in The New York Times, Margalit Fox wrote that Golding was considered one of the foremost British art historians of his generation. In a 1958 article on , he argued for the importance of African art as an inspiration upon the painting. His 1959 book Cubism: A History and an Analysis, 1907–1914 was one of the earliest major studies of the movement. Golding challenged the then-prevalent view that Cubism represented a divergence from the pursuit of realism in art: in contrast, he considered it a return to realist principles and better contrasted with Impressionism. The book also established the importance of Georges Braque, alongside Pablo Picasso, as a founder of Cubism, and was the first to suggest that Braque may have been a Cubist before Picasso was.\nGolding argued for the role of content and meaning in abstract art, previously considered by some critics to lack either quality. He avoided the use of critical theory, and considered that art history should be taught through aesthetic connoisseurship and with reference to a canon of great artists, rather than as a reflection of political or societal developments. In 19761977 he was made the annual Slade Professor of Fine Art at the University of Cambridge. He delivered the A. W. Mellon Lectures in the Fine Arts at the National Gallery of Art in Washington, D.C., in 2000. His last book, Paths to the Absolute, based on those lectures, was awarded the 2002 Mitchell Prize for the History of Art.\nArtistic\nGolding began to paint while studying at the Courtauld, and worked intensely in the field from the late 1950s. His works in the late 1950s and early 1960s, such as Torso (), generally depicted human bodies, often headless or with their faces covered, rendered in dark colours with bold brush-strokes. The figures were often of ambiguous gender: Ades later wrote that they mostly appeared to be male, though Golding stated that an increasing number were intended to be female or indeterminate as his work progressed. His Amalfi Coast paintings were expressionistic and figurative, echoing the works of Orozco, who corresponded with him urging him to \"be as black and violent\" as he could, as a means of gaining insight into his own emotions.\nFrom the middle of the 1960s, Golding shifted to painting pieces in the style of abstract expressionism, focused on ideas of light and space. His characteristic style was described by Cowling as \"hard-edged, 'colour-field'–style abstraction\". Golding credited his change of style to his experience of contemporary American art, and his disagreement with the idea of art as a therapeutic or introspective tool. His paintings from his abstract period included Light from Troy (1986), Pulse (1991–1992), and Arco&nbsp;Iris (1992). These works are generally large in scale, in landscape orientation, with large patches of colour. They were frequently compared with landscapes, though Golding asserted that they should be understood as organic bodies. He made use of bold vertical lines but avoided horizontal elements, on the grounds that these were likely to be interpreted as horizon lines and so to imply that the painting represented a physical landscape. His work was praised by his fellow painter Kenneth Noland, though critics often dismissed it as an imitation of American artists like Still and Barnett Newman.\nGolding was inspired by Renaissance painting, and often included vertical streaks of colour aiming to evoke streaks of light.  From the late 1970s, according to Cowling, his work became more \"sensual, luminous, and atmospheric\", inspired by J. M. W. Turner, Wassily Kandinsky and Mark Rothko, while in the 1980s she judges that it became more dynamic and less inhibited. Towards the end of the 20th century, his works began to be structured in the manner of aerial photographs, with features he identified as roads, bridges and canals. Cowling explains the dense colours and intricate brushwork of his work from this period as an engagement with that of Paul Cézanne.\nGolding's work was exhibited in Mexico City in 1958 and 1961, and was part of an exhibition in Lima, Peru, around 1960, which also included pieces by Carrington and her fellow surrealist Remedios Varo. His first solo exhibition was at Gallery One in London in 1962, where he exhibited the paintings from his time on the Amalfi Coast; another exhibition, the first in his abstract phase, followed in 1966 at the Axiom Gallery in Melbourne. His work was then included in the 1974 annual exhibition of British painting at the Hayward Gallery in London, curated by the painter Andrew Forge. He was subsequently given several solo exhibitions at major galleries in Britain and abroad, including the Yale Center for British Art in the United States (where Forge wrote the show's catalogue), Juda Rowan in London, the Oxford Museum of Modern Art, and galleries in Tokyo and Sydney. He made his last large-scale works around the year 2000.\nAs a curator, Golding co-organised the 1970 exhibition Leger and Purist Paris at the Tate in London, with his former student Green, a curator at the gallery. He was an artistic trustee of the gallery between 1984 and 1991, and organised two further exhibitions there in 1994 and in 2002–2003. These were co-curated with another former student, the Picasso scholar Elizabeth Cowling. The second, which combined Picasso with Matisse, was also exhibited at the Grand Palais in Paris and the Museum of Modern Art in New York. He also curated (with Roland Penrose) the 1981 exhibition ''Picasso's Picassos'' at the Musée Picasso in Paris, and 1990's Braque: Still Lifes and Interiors at the Southbank Centre in London.\nPublished works\nAs sole author\n*\n*\n*\n*\n*\n*\n*\nAs co-author or editor\n*\n*\n*\n*\n*\nReferences\nFurther reading\n*\nExternal links\n*"
    }
  ]
}