{
  "content": [
    {
      "type": "text",
      "text": "# John Herbert King\n\nJohn Herbert King, alias 'MAG', was a British Foreign Office cypher clerk who provided Foreign Office communications to the Soviet Union between 1935 and 1937. He was sentenced to 10 years in prison as a spy in October 1939.\nKing was recruited by the Foreign Office as a temporary clerk in 1934 and sent to the British Delegation at the League of Nations in Geneva. There his financial problems made him vulnerable to an approach by Henri Pieck, a Dutch citizen who was working for Soviet intelligence. Pieck recruited him as a spy, pretending the information he gave was only to be used for commercial advantage by a Dutch bank. King returned to London in early 1935. Pieck continued to run the case by visits to London until 1936, when the job of running King was transferred to Theodore Maly. King continued to pass copies of Foreign Office telegraphic traffic to Maly through a courier, Brian Goold-Verschoyle, until June 1937, when Maly was recalled to Moscow. In September 1939 the Soviet defector Walter Krivitsky exposed King's name as a spy for the Soviet Union to the British Embassy in Washington. Coincidentally a business associate of Pieck's in London reported suspicious activities by him and described a man like King who had given information to Pieck. King was subsequently interrogated, resulting in a confession.\nAlthough the official British archives only implicate King with passing information to the Soviets from 1935 to 1937, information passed on by King is elsewhere credited with giving Joseph Stalin valuable insight into British diplomatic activities aimed at containing Adolf Hitler as late as 1939.  At times this information was passed on by the Soviets to the German Embassy in London, with the aim of increasing the tension between Britain and Germany.  Sometimes as little as 5 hours elapsed between a telegram being received at the Foreign Office and a summary of its contents being transmitted to Berlin.\nReferences"
    }
  ]
}