{
  "content": [
    {
      "type": "text",
      "text": "# John MacLean (historian)__disambig_1\n\n| birth_place        = Blisland, Cornwall, England\n| death_date         =\n| death_place        = Clifton, Bristol, England\n| other_names        =\n| occupation         = civil servant, genealogist, author\n| years_active       =\n| known_for          = historical and genealogical works\n| notable_works      =\n| spouse             =\n| relatives          = Scottish Clan Maclean\n}}\nSir John Maclean KB, FSA (17 September 1811 – 5 March 1895) was a British civil servant, genealogist and author.\nLife\nMaclean was born John Lean, a son of Robert Lean, of Trehudreth in the parish of Blisland in Cornwall, where he was born in 1811. His mother was Elizabeth Every, a daughter of Thomas Every, of Bodmin, Cornwall. After genealogical research his ancestors were connected to the Scottish Clan Maclean, and in 1845, with his brothers, he added to his surname the prefix \"Mac\".\nIn 1837, he entered the Ordnance Department of the War Office, and became deputy auditor in April, 1865. He resigned this post on a pension, and received a knighthood in January, 1871. Sir John Maclean died at his residence, Glasbury House, Richmond Hill, Clifton, Bristol, of influenza. on Tuesday 5 March 1895.\nFamily\nIn 1835, at Helland in Cornwall, he married Mary Billing, eldest sister and co-heiress of Thomas Billing, of Lanke, Cornwall.\nWritings\nSir John's Parochial History of the Deanery of Trigg Minor (1872–1879) in 3 volumes is the most detailed work of parochial history which deals with Cornwall (the deanery of Trigg Minor consisted of 20 parishes at the time he wrote). It was published in parts intended for binding as three volumes: there was also a separate edition of the part on Blisland. He was the author of several other historical works, including Life and Times of Sir Peter Carew, Letters of Sir Robert Cecil to Sir George Carew, and Memoir of the Family of Poyntz, (of Iron Acton, Gloucestershire).\nList of works\n*[https://archive.org/details/historicalgeneal01macl Historical and genealogical memoir of the family of Poyntz : or, eight centuries of an English house (Volume pt.1)]\n*[https://archive.org/details/historicalgeneal02macl Historical and genealogical memoir of the family of Poyntz : or, eight centuries of an English house (Volume pt.2)]\n*[https://archive.org/details/historyofstbruer00macl Parochial History of the Deanery of Trigg Minor, 1874]\n*[https://archive.org/details/cu31924081264826 Parochial History of the Deanery of Trigg Minor, Vol.2, 1876]\n*Sir John Maclean [http://www.mocavo.com/Parochial-and-Family-History-of-the-Parish-of-St-Menefreda-Alias-St-Minfre-Alias-St-Minver-in-the-County-of-Cornwall/103865/14? Parochial and Family History of the Parish of St Menefreda alias St Minfre alias St Minver in the County of Cornwall]; 1876\n*Heraldic Visitation of Gloucestershire:\nReferences"
    }
  ]
}