{
  "content": [
    {
      "type": "text",
      "text": "# John Duncan King\n\n| death_place      =\n| resting_place    =\n| resting_place_coordinates =\n| nationality      =\n| education        =\n| alma_mater       =\n| known_for        = Landscape painting\n| notable_works    =\n| style            =\n| movement         =\n| spouse           =\n| partner          =\n| children         =\n| parents          =\n| father           =\n| mother           =\n| relatives        =\n| family           =\n| awards           =\n| elected          =\n| patrons          =\n| memorials        =\n| website          =\n| module           =\n}}\nCaptain John Duncan King (1789 – 1863) was an Irish army officer and landscape-painter.\nLife\nKing was born in 1789, entered the British Army in August 1806, and became lieutenant in February 1808. He served in the Walcheren expedition and in the Peninsular War, and was present at the battles of Busaco, Vitoria, and the Pyrenees, being wounded severely on 28 July 1813. He was present at the occupation of Paris by the Allies in 1815. On 16 March 1830 he was promoted to be captain, and on 28 December 1830 was placed on half-pay.\nKing had a talent for painting, and in 1824 exhibited at the Royal Academy a view in Spain, from a drawing by Lieutenant-general Hawker. In 1836 he sent a view in Portugal, and subsequently was an occasional honorary exhibitor of views near Killarney, Boulogne, and other places. In 1843 he exhibited a picture called A Pilgrim. He also exhibited thirty-nine landscapes at the British Institution; the last was sent in 1858. About 1852 King was made a Military Knight of Windsor, and resided in Windsor Castle until his death on 21 August 1863.\nReferences\nCitations\nBibliography\n*\n* Spencer-Smith, Jenny (2004). [https://www.oxforddnb.com/view/10.1093/ref:odnb/9780198614128.001.0001/odnb-9780198614128-e-15577?rskey=nAQ8PB&result=5 \"King, John Duncan\"]. In Oxford Dictionary of National Biography. Oxford: Oxford University Press."
    }
  ]
}