{
  "content": [
    {
      "type": "text",
      "text": "# John Stewart, Earl of Carrick\n\n, built by the Earl of Carrick.]]\nJohn Stewart, Earl of Carrick, Lord Kinclaven (died c. 1645) was a Scottish nobleman, the third son of Robert, Earl of Orkney, a bastard son of King James V.\nStewart was soon linked with the widow \"Mistress Southwell\". In November 1604 he fought Thomas Somerset, a son of the Earl of Worcester in the Balloon Court at Whitehall Palace. He was confined to his chamber and Somerset was sent to the Fleet Prison.\nFamily at feud\nHis father Robert had been born in 1533 as the illegitimate child of the King and his mistress Euphemia Elphinstone. Robert acquired the temporalities of the See of Orkney in 1569, and in 1581 was made Earl of Orkney and Lord of Zetland by his half-nephew King James VI. He married Lady Jean Kennedy, eldest daughter of the Earl of Cassilis, and by her had five sons and four daughters, in addition to the ten bastards he fathered. His eldest son Henry had died before 1590, meaning on his death in 1592 he was succeeded as Earl of Orkney by his second son Patrick, a man infamous for his godless and tyrannical nature.\nIn 1593 John with his brothers James and William were accused of conspiring with the \"sorceress\" Margaret Balfour to poison Earl Patrick. Margaret was executed along with John's servitor Thomas Papla, but both left depositions renouncing their testimonies on the account that they had been extracted by torture, meaning the prosecution of the brothers failed and they were acquitted. Earl Patrick was forfeited and executed for treason in 1615, and his lands in Orkney passed to John.\nsurmounted by a ribbon, a symbol of bastardy, quartered with the earldom of Orkney (although his family no longer held that earldom).]]\nJohn was known as the \"Master of Orkney\". On 6 August 1600 he rode with James Sandilands to Dirleton Castle to arrest William and Patrick Ruthven, brothers of the Earl of Gowrie but they had fled, being forewarned by a man called Kennedy.\nUnion of the Crowns\nHe came to London in 1603 with King James. Lady Anne Clifford wrote that in July 1603, \"Now was the Master of Orkney and the Lord Tullibardine much in love in Mrs Cary and came thither (to Norbury, where they were isolated because of suspected plague) to see us with George Murray in their company who was one of the King's bedchamber.\" The Master of Gray wrote in August 1605 his son, who had been in France, would come to court with his uncle, the Master of Orkney.\nStewart was soon linked with the widow \"Mistress Southwell\". After she married him, in a letter of 1605 to the Earl of Salisbury she identifies her husband as the brother of the \"Master of Orkney\". In November 1604 he fought Thomas Somerset, a son of the Earl of Worcester in the Balloon Court at Whitehall Palace. He was confined to his chamber and Somerset was sent to the Fleet Prison. Their argument followed on an incident when Somerset accompanied the Duke of Holstein and the Master of Orkney to the Queen's apartments, and as the gentlemen were at the door of her Privy Chamber, accused each other of pushing and shoving.\nKing James ennobled him as Lord Kincleven on 10 August 1607. King James granted him a pension of £3,600 Scots in 1621, but the Privy Council pointed out that Orkney and Shetland crown income could sustain such a sum. King James urged the Earl of Mar, treasurer of Scotland, to pay the pension in July 1622, \"as he can hardly live without it\".\nIn 1623 he quarrelled with George Hay, later Earl of Kinnoull, over their business ventures in Orkney. In 1628 James's successor Charles granted him the ancient and prestigious title Earl of Carrick. The validity of the latter title was questioned, as it conflicted with the earldom of Carrick held by the heir to the throne. This difficulty was resolved when it was pointed out that the titles referred to different places: the royal earldom to Carrick in Ayrshire, and Kinclaven's earldom to the lands of Carrick on Eday in Orkney.\nJohn Stewart, Earl of Carrick, is sometimes regarded merely as a royal pensioner and dependent. He was a great entrepreneur, establishing businesses such as salt works and breweries on Eday. In 1619 he had received a licence to make and sell new kinds of earthenware vessels and tobacco pipes, and in 1630 he was appointed a Commissioner of Fisheries. He was present at the funeral of James VI in London, from whom he had received a pension of three thousand pounds Scots 'for services done'. The Earl died sometime between 1639, when he is recorded as having subscribed to the Covenant, and 1649, when a charter issued by his brother refers to him as deceased.\nFamily\nHe was betrothed or married to Margaret Stewart, a daughter of James Stewart, 1st Lord Doune, but she died soon after. He married at Chelsea in 1604 Lady Elizabeth Howard (d. 1646), daughter of Charles, Earl of Nottingham and widow of Sir Robert Southwell of Woodrising. They had one child, Lady Margaret Stewart, who married Sir John Mennes and became the ancestress of the Lords Willoughby de Broke.\nCarrick also had two natural children: a son, Henry Stewart, who received a grant from his father of certain lands on Eday, and a daughter (name unknown), who married William Craigie of Gairsay. As he had no legitimate son, the earldom of Carrick and lordship of Kinclaven became extinct on his death, though they could conceivably have been claimed by one of his brothers or nephews.\nAncestry\nReferences\n*Paul, Sir James Balfour, 'Stewart, Earl of Orkney', in [https://archive.org/stream/scotspeeragefoun06paul#page/572/mode/2up The Scots Peerage], Volume VI, (Edinburgh: David Douglas, 1909).\n*Steuart, Archibald Francis, 'Stewart, Earl of Carrick', in [https://archive.org/stream/scotspeeragefoun02paul#page/440/mode/2up The Scots Peerage], Volume II, (Edinburgh: David Douglas, 1907).\n*[http://www.visiteday.com/images/files/The_Heritage_of_Eday.pdf The Heritage of Eday] . Visit Eday."
    }
  ]
}