{
  "content": [
    {
      "type": "text",
      "text": "# John Delaware Lewis\n\nJohn Delaware Lewis (1828 – 31 July 1884) was an English Liberal Party politician who sat in the House of Commons from 1868 to 1874.\nLewis was born in Saint Petersburg, Russia, the only son of an American merchant, John D. Lewis (1774-1841), and his wife Eliza Emma Clewlow (c1797-1829). She was daughter of James Hamilton Clewlow R.N, who was a purser and later secretary to Sir Samuel Hood. Lewis's father was one of the most successful merchants in St Petersburg, where he was based for about 30 years, trading in sugar, coffee, rice, cigars, duck, hemp, quills, oil and bale rope. He made various trips to Britain and died at his residence in Cornwall Terrace, Regent's Park, on the 17 May 1841.\nLewis lost his mother in the year following his birth in 1829; she died after giving birth to a daughter, Amy Eliza. His father died when he was twelve, and  being so young there was no opportunity for him to become involved with the family mercantile business, which was taken over by the company secretary, Abraham van Sassen.\nLewis was educated at Eton College and at Trinity College, Cambridge graduating BA in 1850 and MA in 1853, was called to the bar at Lincoln's Inn in 1858 and went on the south-eastern circuit. He was a J.P. for Devon and Hampshire, and an officer in the Royal Pembroke Artillery Militia. He spent much time at Arcachon in France and was author of Sketches of Cantabs,  Across the Atlantic, Causes Célèbres, and various other works in English and French.\nAt the 1868 general election Lewis was elected as a Member of Parliament (MP) for Devonport. He held the seat until his defeat at the 1874 general election, and unsuccessfully contested the seat again in 1880.\nHe married in 1868, Teresa Jervoise, daughter of Sir Jervoise Clarke-Jervoise, 2nd Baronet  MP for South Hampshire,  and died at Westbury House, Petersfield, Hampshire, at the age of 56. He was childless and left his estate to his wife (in her lifetime) and to his nephew, Herbert Leroy, who later changed his name to Herbert Leroy-Lewis. Leroy was the grandson of William D. Lewis, who was Lewis's uncle and had worked for his father in their Russian mercantile business.\nLewis's ancestors settled in the State of Delaware in the 17th century, his grandfather being Joel Lewis (1750-1820) of Christiana, New Castle County, Delaware.  During the American War of Independence Joel Lewis raised a company at his own expense.  However, he was also a Quaker and this action was in conflict with core beliefs of the Society.  See article Quakers in the American Revolution.\nFrom about 1860 until 1876 Lewis owned Membland Hall and estate, a distance of about 12 miles from his parliamentary constituency of Devonport.  He eventually sold the property to Edward Baring, 1st Baron Revelstoke. Lewis was also the owner of the Lansdowne portrait of George Washington, now in the National Portrait Gallery (United States).  The work was originally purchased by his father in 1827 and passed to Lewis's heir, Herman Leroy-Lewis.\nReferences\nExternal links\n*"
    }
  ]
}