{
  "content": [
    {
      "type": "text",
      "text": "# John Howard Cook\n\nJohn Howard Cook, M.S., F.R.C.S. (30 May 1872 – 19 September 1946) was a British physician, missionary, lecturer, and disease consultant. With his brother he is known for the formation of the Mengo Hospital in Kampala, Uganda. Working alongside his brother, he carried his family's tradition of medical work overseas to Uganda where he focused on the surgical aspect of medical treatment. He spent 20 years spreading European medicine in Uganda and continued medical missionary service well beyond his years abroad.\nEarly life\nJohn Howard Cook was born on 30 May 1872 in Hampstead, England. He was born to William Henry Cook, a medical officer in the Hampstead parish, and Mrs. Harriet Cook. John Howard Cook came from a large family and had 13 siblings during his childhood. Unfortunately, he was one of only 5 of the children who survived beyond their father's lifetime. Many of Cook's siblings died during childhood as a result of diseases like diphtheria, pneumonia, and typhoid fever. John Howard Cook's younger brother, Sir Albert Cook, went on to become a prominent medical missionary in his own regard.\nEducation\nCook's early schooling took place at the St. Paul's School, where he won several merits and scholarships, before he went on to study medicine at University College Hospital. In 1895 Cook was accepted into the M.R.C.S. and L.R.C.P, and that same year earned a Bachelor of Medicine (M.B) degree at University College London. Only two years later he earned a Master of Surgery (M.S.) degree and became a member of the Fellowship of the Royal College of Surgeons of England (F.R.C.S.Eng).\nIn addition to his many degrees prior to starting his missionary work, John Howard Cook earned a diploma in Tropical Medicine and Hygiene from Cambridge after working for several years in Uganda.\nEarly adulthood\nJohn Howard Cook was married to Ethel Maddox in 1898 and had three sons including Norman Cook (doctor). In the early years of his medical career he served as an ophthalmic assistant at University College Hospital. In addition, he spent time as an assistant to the throat and ear department of the College and as a demonstrator of anatomy.\nMissionary work\nJohn Howard Cook pursued medical mission work through the Church Missionary Society, an Anglican mission group which had a base in London. Cook's younger brother Albert was also a medical missionary through the CMS. Albert Cook arrived in Uganda shortly before the Ugandan Mutiny (1897–98), during which he played a large role in providing medical treatment to injured Ugandans in a time of heavy casualties and violence. Following in his older brother's footsteps, John Howard Cook arrived in Uganda in 1899, shortly after the Ugandan Mutiny.\nMengo Hospital\n:The majority of Cook’s medical missionary work was centered in Kampala, Uganda because it was the location of the Mengo Hospital, which his brother Albert constructed in 1897. Unfortunately, the original Mengo Hospital burnt down in 1902 as a result of a lightning fire, but an even bigger hospital was built almost immediately after the first. The newly constructed Mengo Hospital was twice as large and had nearly double the capacity.\n:During his time at the Mengo Hospital, John Howard Cook’s medical emphasis was primarily carrying out surgeries. He also took quite an interest in researching and treating the widespread illness commonly referred to as sleeping sickness.\n:Working side-by-side with his brother Albert, John Howard Cook brought about significant growth and expansion during his time at the Mengo Hospital. Reports directly from the hospital during this time period describe a shift in the atmosphere of Kampala, Uganda that had distinct effects on the hospital. The region's build-up and expansion had led to an increase in wages, as well as an influx of European patients.  The hospital expanded significantly and in the year of 1912-13 alone, Mengo Hospital saw to the treatment of 1,880 inpatients, 227 maternity cases, and oversaw the outpatient treatment (via several dispensaries) of over 34,000 patients. However, along with such expansion and growth came an increase in venereal diseases and infant mortality. In a report written in 1912, to which John Howard Cook contributed, the term “diseases of immorality” was used to express the increasing presence of venereal diseases, which gives insight into the underlying religious influence in the medical work he carried out.\nEvangelical emphasis\n::Outside of his medical work, John Howard Cook was heavily involved in the evangelical aspect of the Church Missionary Society. In addition to holding religious lectures at the Mengo Hospital, Cook also traveled as an itinerant lecturer. In 1909, Cook spent a year traveling in the Nassa region and even spoke at an 8-day religious event held by the Baganda that was attended by nearly 50,000 people. Letters written home to contacts in England reveal that Cook had very strong religious ties and much of his motivation for going to Uganda, aside from the medical work, was to play a role in the evangelization of the people he worked with. This influence was also present in his work at Toro Hospital.\nToro Hospital\n:In 1912, John Howard Cook worked single-handedly for several months at Toro Hospital. As the sole doctor on staff his time at Toro Hospital further clarifies a strong linkage between Cook’s medical work and evangelism. During his time there, the fledgling hospital had an evangelist on staff, a native Ugandan who lived with the young men hired to work as ward assistants. Cook made itinerant visits to neighboring villages and gave lectures to his staff members on health and morality.\n:The Toro Hospital itself had come about largely due to such evangelical influences and was founded by John Edward Church and his son Robin Church. The hospital expanded from occasional medical visits to the Toro region to mud hospitals which then developed into a brick hospital in 1912. The brick hospital’s construction was supervised by Reverend H.E. Maddox and the young native men and women, who were trained to work in the hospital as assistants, had to be either Protestant or in the process of becoming Protestant.\nCareer post-missionary work\nChurch Missionary Society in London\n:After returning from Uganda, John Howard Cook continued to work for the Church Missionary Society in London. For twenty years, Cook served as a consulting physician and secretary to the Mission's medical committee. Additionally, he was appointed honorary consulting ophthalmic surgeon.\nOther positions\n:After parting from the Church Missionary Society, Cook served as medical superintendent to the London Medical Mission in Covent Garden for 5 years. He also worked as a tropical disease consultant to the Ministry of Pensions and was a frequent lecturer at Harford on ophthalmology.\nDeath and legacy\nJohn Howard Cook died in Kilburn, England on 19 September 1946 at the age of 75. As a doctor, Cook left behind a legacy as a skilled surgeon and ophthalmologist. John Howard and his brother Albert also earned a reputation as some of the first doctors to focus on sleeping sickness and were highly respected by their peers.\nThe Mengo Hospital remains a thriving hospital in Uganda with different wings of the building named after the several Cook family members who contributed to the hospital's success. The Mengo Hospital cites perseverance of the Cook brothers in the face of great difficulty as an essential component in hospital's formation.\nJohn Howard Cook is often overshadowed by his brother Sir Albert Cook, who was knighted for his work in Uganda, and his brother Professor Arthur Cook, an esteemed archaeology professor at Cambridge. Despite this, John Howard Cook left behind a legacy of medical missionary work that attests to his ability to serve the communities in which he worked, whether in Uganda or England.\nReferences"
    }
  ]
}