{
  "content": [
    {
      "type": "text",
      "text": "# John Fleming (art historian)\n\nJohn Fleming (12 June 1919 – 29 May 2001) was a British art historian, known for his writing partnership with Hugh Honour. Their A World History of Art (aka, The Visual Arts: A History), first published in 1982, is now in its seventh edition. Fleming's Robert Adam and His Circle in Edinburgh and Rome (1961) won the Bannister Fletcher Prize and the Alice Davis Hitchcock Medal.\nBiography\nFleming was born in Berwick-upon-Tweed, the son of a local Solicitor. He was educated at Rugby School and read English at Trinity College, Cambridge where he met Hugh Honour, who would become Fleming's life partner. He travelled to Italy and during World War II was briefly a conscientious objector before entering the British Army Intelligence Corps in Cairo. There he began to write about art with the encouragement of Nikolaus Pevsner.\nLiving in Asolo near Venice, Honour and Fleming began a productive writing partnership. They were commissioned by publisher Allen Lane to edit the Style and Civilisation series (begun 1967); the Architect and Society series (begun 1966); and the Art in Context series (begun 1972).\nIn 1962, Honour and Fleming moved to Villa Marchiò near Lucca where they remained for the rest of their lives. In 1966, they collaborated with Nikolaus Pevsner to produce The Penguin Dictionary of Architecture (2nd edition 1972), and in 1977 they wrote The Penguin Dictionary of Decorative Arts. A World History of Art (aka, The Visual Arts: A History) followed in 1982 and the Venetian Hours of Henry James, Whistler and Sargent in 1991.\nFleming died in Tofori, near Lucca.\nSelected publications\n* Robert Adam and His Circle in Edinburgh and Rome. 1961.\n* Penguin Dictionary of Architecture. 1966. (With Nikolaus Pevsner and Hugh Honour), 3rd edition, 1980.\n* The Penguin Dictionary of Decorative Arts. London: Allen Lane, 1977. (With Hugh Honour)\n* A World History of Art. 1982. (With Hugh Honour), later called The Visual Arts: a history. 1995\n* The Venetian Hours of Henry James, Whistler, and Sargent. 1991. (With Hugh Honour)\nReferences and sources"
    }
  ]
}