{
  "content": [
    {
      "type": "text",
      "text": "# John King (ukulelist)\n\nJohn King}}\nJohn Robert King (John) (October 13, 1953 &ndash; April 3, 2009) was a ukulele player known for his interpretation of classical music.\nEarly life and education\nThe son of a navy pilot, King was born in San Diego. His father's position took the young King to Hawaii for a few years in his childhood, where he was introduced to the ukulele by his mother. Despite his early start in the ukulele, he initially showed no aptitude for the instrument, but quickly became a proficient guitar player, studying at one point with both Pepe Romero and his father Celedonio.\nKing attended Old Dominion University and later took a post as a guitar teacher at Eckerd College&mdash;where he taught for 30 years&mdash;in St. Petersburg, a city that became his home for life.\nUkulele revolution\nUpon learning that the ancestor of the modern guitar was tuned similarly to the ukulele, he reacquainted himself with the instrument, commissioning an Italian luthier to make a classical ukulele for him. With it, he revived a guitar-playing technique from the Baroque era: succeeding notes are played on different strings, allowing the previous note to continue ringing. Known as campanella style, which means 'little bells' in Latin. His influential book The Classical Ukulele is part of Jim Beloff's Jumpin’ Jim's Ukulele Masters series.\nKing's repertoire ranged widely, but he is particularly noted for his interpretation of Johann Sebastian Bach. In 2008, the Journal of the Society for American Music called King \"perhaps the world's only true classical 'ukulele virtuoso'\".\nLuthier Joel Eckhaus made King's \"Strad Uke\" modeled after one of the five Stradivari guitars.\nKing is featured in a short segment in the extras on the DVD release of Mighty Uke: The Amazing Comeback of a Musical Underdog, a 2010 documentary on the ukulele.\nAccording to The Journal of the Society for American Music, John King is \"the worlds only truly classical ukulele virtuoso\".\nWorks\nKing recorded two records and wrote several books of ukulele arrangements. He did extensive research into the history of classical guitar and the ukulele, writing numerous essays. He wrote an encyclopedia of Hawaiian luthiers. He was working on a history of the ukulele with Jim Tranquada at the time of his death which was published in 2012, The Ukulele: A History, published by the University of Hawaii Press.\nDeath\nKing died of a heart attack at his home at the age of 55.\nReferences\nWorks and external links\n*\n*\n*\n*\n* }}"
    }
  ]
}