{
  "content": [
    {
      "type": "text",
      "text": "# John Edward (civil servant)\n\n| birth_place = Edinburgh, Scotland\n| death_date =\n| death_place =\n| birthname =\n| spouse = Alexandra Angulo\n| relations = Elizabeth and David Edward.\n| children = One son One daughter\n| residence = Scotland\n| alma_mater = The Edinburgh Academy\nUniversity of St AndrewsUniversity of GlasgowUniversità per Stranieri di Siena\n| occupation =\n| profession = public policy, public servant, international affairs\n| religion =\n| signature =\n| website =\n| footnotes =\n| blank1 =\n| data1 =\n}}\nJohn Edward (born 22 September 1968) is Head of Operations of the Scottish Council on Global Affairs Scotland's first international relations institute, previously a charity CEO, an EU and Scottish civil servant and campaigner.\nEducation\nJohn Edward was educated at the Edinburgh Academy, University of St Andrews (Scottish History), the University of Glasgow and the Università per Stranieri di Siena.\nCareer\nAfter working as a stagiaire (intern) in ECHO (European Commission) in Brussels, John Edward worked for the European Policy Centre as personal assistant to Max Kohnstamm.\nHe was employed for 5 years as the EU Policy Manager by [https://www.scotlandeuropa.com/ Scotland Europa].\nJohn Edward was then Parliamentary Manager for Scottish Enterprise then served as Head of the [http://www.europarl.europa.eu/unitedkingdom/en/edinburgh-office.html Office in Scotland] of the European Parliament from 2003 to 2009.\nFrom 2010 to 2023, John Edward was Director of the Scottish Council of Independent Schools.\nEuropean campaigning\nJohn Edward was Chief Campaign Spokesman for [https://www.strongerin.co.uk/scotland_news Scotland Stronger in Europe], the discrete Scottish campaign to Remain in the European Union during the 2016 United Kingdom European Union membership referendum.\nFrom 2016 to 2018, John Edward represented Scotland for Open Britain.   In 2018-19 he chaired media events for the Scotland  element of the People's Vote campaign.\nHe contributed a chapter on \"Soft power in hard times\" to the 2017 IPPR publication, \"[https://www.ippr.org/research/publications/scotland-the-uk-and-brexit-a-guide-to-the-future Scotland, the UK and Brexit: A guide to the future]\".  In 2023, he wrote for Encompass Europe on the [https://encompass-europe.com/comment/to-see-ourselves 25th anniversary of devolution and the European Union].\nHe was a Liberal Democrat candidate in the 2019 European Parliament election in the United Kingdom, for the Scotland region.\nOther activities\nJohn Edward served on the Presiding Officer of the Scottish Parliament's Commission on Parliamentary Reform which produced a [https://parliamentaryreform.scot/ Report] on how the Scottish Parliament can engage better with the people of Scotland and how its work can be improved to deliver better scrutiny in 2017.\nHe was a member of the Steel Commission on “[https://web.archive.org/web/20131113121108/http://www.scotlibdems.org.uk/files/steelcommission.pdf Moving Towards Federalism]” from 2003 to 2006, and a member of the Campbell Commission on “[http://worldofstuart.excellentcontent.com/repository/FederalismBestFuture.pdf Home and Community Rule]” from 2011 to 2012.\nJohn Edward is a trustee of the [http://www.seet.org.uk/ Scottish European Educational Trust], a non-political charity which promotes unbiased education about Europe and the wider world and encourages language learning amongst young people throughout Scotland.  He is a board member of the Association of Governing Boards of Independent Schools, and member of the Scottish Commission on School Reform, hosted by Reform Scotland.  Colleges Scotland published an article in 2023 on the [https://www.collegesscotland.ac.uk/news/latest/512-summer-series-blog-john-edward International potential of Scotland's Colleges].\nReferences"
    }
  ]
}