{
  "content": [
    {
      "type": "text",
      "text": "# John Dewar (RAF officer)\n\n|branch=\n|serviceyears=1926–1941\n|rank=Wing Commander\n|servicenumber=\n|unit=\n|commands=No. 87 Squadron RAF, Exeter Wing\n|battles=World War II\n*Battle of France\n*Battle of Britain\n|battles_label=\n|awards=Distinguished Service OrderDistinguished Flying Cross\n|relations=\n|laterwork=Rolls-Royce\n}}\nWing Commander John Scatliff Dewar, DSO, DFC (1907 – 1940) was a World War II Royal Air Force fighter pilot, who was killed in action during the Battle of Britain.\nEarly life\nDewar was born in Lahore, British India, the second son of Douglas Dewar who was working for the Indian Civil Service at the time but originally came from Camberley in Surrey. John was named for his great uncle, John Milton Elborough Scatliff. He was educated at The King's School, Canterbury where he was a School Monitor and played in the Cricket XI and the Rugby XV. Dewar was a member of the school Officer Training Corps, attaining the rank of Sergeant. He was also Editor of the school magazine, The Cantuarian.\nRoyal Air Force\nDewar attended the Royal Air Force College Cranwell from 1926 and 1927 and on graduation was commissioned as a Pilot Officer. His first posting was to No. 13 Army Co-operation Squadron at Andover. Dewar was promoted to Flying Officer on 17 June 1929. He became a Qualified Flying Instructor at the School of Naval Cooperation. In 1933 he was posted to No. 822 Fleet Spotter/Reconnaissance (an attached RAF flight that later became part of the Fleet Air Arm) and joined HMS Furious. He served as part of the Home Fleet and in the Mediterranean. On one occasion he was washed overboard in the Bay of Biscay but was rescued.\nHe was promoted to the rank of Flight Lieutenant on 1 February 1934 while at sea in the Caribbean. In 1934 he was transferred to No. 801 Fleet Fighter Squadron. From 1936 to 1938 Dewar served in the Armament Testing Section at the Aeroplane and Armament Experimental Establishment (A&AEE) at RAF Martlesham Heath, and participated in the early development of both the Hurricane and Spitfire prototypes. He was promoted to Squadron Leader on 1 February 1938 and posted to Thorney Island as Senior Operations Officer.\nOn 10 November 1939, he was posted to RAF's No. 11 Group pilot pool for reassignment to a fighter squadron. He was by that time one of the most senior active duty pilots in the RAF.\nFamily life\nOn 10 July 1937, he married Kathleen \"Kay\" Bowyer, daughter of Southampton politician P. V. Bowyer.\nWorld War II\nduring the King's visit to 87 Squadron at its base near Lille, France, December 1939]]\nDewar was given command of No. 87 Squadron RAF on 29 November 1939 and led the Squadron during operations during the Battle of France, distinguishing himself by his superb piloting and leadership skills. On 7 May 1940, returning from a sortie in bad weather and low on fuel, Dewar had to force land his Hurricane at an unserviceable airfield at Villefranche. As he touched down his wheels dug into the mud and the aircraft overturned, severely injuring his right shoulder.\nIn spite of his injury, he refused to ground himself and continued to fly. He claimed a Dornier Do 17 shared and two Junker Ju 87s of I./StG 2 on 11 May, and another Ju 87 the next day. For this and his leadership of 87 Squadron he was awarded the Distinguished Service Order (DSO). On 20 May 1940, in the face of the advancing German Army, Dewar ordered his squadron to return to England .\nHe was awarded the Distinguished Flying Cross which appeared in the London Gazette of 31 May 1940. The citation reads:\nAir Ministry, 31 May 1940.\nROYAL AIR FORCE.\nThe KING has been graciously pleased to approve the undermentioned awards, in recognition of gallantry displayed in flying operations against the enemy:—\nAwarded the Distinguished Flying Cross.\n[...]\nSquadron Leader John Scatliff DEWAR (26029)\nThis officer has shot down five enemy aircraft and led many patrols with courage and skill.\nIn the same edition of the Gazette he was awarded the Distinguished Service Order with the following citation:\nAir Ministry, 31 May 1940.\nROYAL AIR FORCE.\nThe KING has been graciously pleased to approve the undermentioned appointments and awards in recognition of gallantry displayed in flying operations against the enemy:—\nAppointed Companions of the Distinguished Service Order.\nSquadron Leader John Scatliff DEWAR, D.F.C. (26029)\nBefore intensive operations started this officer injured his right shoulder in a severe flying accident. Despite this, he flew regularly and led his squadron with skill and dash, more than 60 enemy aircraft being destroyed by them. He remained in command of the squadron throughout the operations, in spite of the injured shoulder, trained his new pilots well and continued throughout to be a very efficient commander, inculcating an excellent spirit in his squadron.\nHe continued to fly operationally from RAF Exeter with No. 87 Squadron during the Battle of Britain, claiming two Bf 110 fighters on 11 July, a share in a Ju 88 on 13 August, and a Ju 88 destroyed on 25 August.\nOn 1 September 1940, he was promoted to the rank of Wing Commander and became the Officer Commanding RAF Exeter.\nOn 11 September 1940 Dewar took off on a routine flight from RAF Exeter for RAF Tangmere in Hurricane V7306 of 213 Squadron to attend a conference the following day and pay a surprise visit to his wife, but he failed to arrive. Dewar was the highest RAF ranking officer to be lost during the battle. 87 Squadron ORB stated on 12 September: \"Wing Commander Dewar set out from Exeter for a visit to Tangmere and was not heard of again. He had been informed of enemy activity on the route over which he was to pass, and no doubt must have run into more trouble than he could cope with by himself. A very set loss to 87 Squadron.\" On that day he was listed with 213 Squadron, not 87 Squadron. 213 Squadron made combat claim both on 11 September and 12 September at 11.10. He took off during late afternoon.\nW/C Dewar's flight plan was direct to Winchester, avoiding Southampton's balloon barrage, and thence to Tangmere. He would have just passed Southampton shortly after 16:00. That is the precise time that a raid on Southampton's Cunliffe-Owen Works by Me109s of Erprobungsgruppe 210 was intercepted near Selsey Bill by Hurricanes of 213 Squadron scrambled from Tangmere. As he was flying a 213 Squadron aircraft with the R/T (radio) tuned to 213's combat frequency, he certainly would have heard the combat chatter, and given his love of action most likely decided to join the combat. That dogfight probably lasted from approximately 16:15 to 16:30, the time interval that Dewar was likely shot down.\nHis body was washed ashore on 30 September 1940 at Kingston Gorse in Sussex. There is some mystery surrounding his death as some reports suggest that he had taken to his parachute and that his body \"was riddled with bullets\" when it was found, implying that he had been shot and killed during his parachute descent. In reality there was no evidence at all. He could be hit in the cockpit, of course. From S/Ldr Randolph Stuart Mills letter we know: \"a body clothed in a shirt was washed up on the beach at Kingston Gorse, Sussex, and subsequently identified as Wing Commander J. S. Dewar by means of laundry marks... a tunic was also found nearby the body, market ʽJSDʼ and had the ribbons of DSO and DFC. It was established that this officer was killed by machine-gun fire, there being bullet wounds in the back of the head, and the left leg was practically shot off.\" It looks like he was surprised and killed from behind at very close range both by machine-gun bullets in the head and cannon shell in leg. This suit to a sudden and deadly attack without knowing anything about the possible danger.\nJohn Scatliff Dewar is buried at St John the Baptist church in North Baddesley, Hampshire. He and his wife Kay had no children. Kay died on 16 September 2001 at Blatchington Court, Seaford.\nReferences\nExternal links\n*"
    }
  ]
}