{
  "content": [
    {
      "type": "text",
      "text": "# John Ingram (revolutionary)__disambig_1\n\n}}\nJohn Ingram (sometimes spelled Isgrum, ) was a settler in colonial Virginia who lived in the settlement of Jamestown and became a member of Nathaniel Bacon's Rebellion. He took the lead of the rebellion after Sir Nathaniel Bacon died from dysentery. The members of the rebellion consisted of 300-500 mostly indentured servants, but included a number of Black slaves. They had been upset at the treaty of 1646, which ended the Third Anglo-Powhatan War. The rebellion occurred throughout 1676, and resulted in Bacon's forces burning much of Jamestown to the ground.\nEarly life\nJohn Ingram Jr. was born sometime before 1644 in Northumberland County, Virginia. His father was John Ingram Sr. and his mother was Jane Ingram. His siblings were Elizabeth Ingram, Thomas Ingram, and Jane Ingram.\nBacon's Rebellion\nBackground\nThe first of the Anglo-Powhatan Wars occurred from 1610 to 1614, starting after a raid from the Virginian settlers killed dozens of Powhatan. In 1622, the second Anglo-Powhatan War broke out when the Powhatan attacked Jamestown and killed 347 settlers, roughly 30% of the settlement's population at the time. In 1644, the Powhatan attacked Jamestown in the same method as the 1622 attack. They killed 400 settlers, about 10% of Jamestown's population at the time, which started the third Anglo-Powhatan War.\nIn 1646, Governor William Berkeley signed a peace treaty with the Powhatan. Indentured servants had been promised that after years of hard work, they would be given 100 acres of land. John Ingram himself was an indentured servant. However, this land would be Powhatan territory. The Peace Treaty of 1646 ended these promises towards the indentured servants in order to avoid conflicts with the Powhatan, whose lands they would have occupied.\nBacon's Rebellion\nIn 1676, John Ingram joined 300–500 men under the leadership of Sir Nathaniel Bacon in a rebellion against the local government. In \"The Declaration of the People\", Bacon accused Governor Berkeley of being nepotistic and demanded a military commission to fight native tribes. Despite a peace treaty, the rebels attacked Native American villages.\nOn September 19th, members of the rebellion burned Jamestown to the ground, but Governor Berkeley was able to flee. Bacon caught dysentery and died from it on October 26, 1676. As second in command, John Ingram took over leadership of the rebellion, but it soon collapsed, as a Royal Navy squadron arrived to Jamestown and restored order.\nAftermath\nBerkeley returned to Jamestown soon after. He ordered the hanging of 23 leading members of the rebellion. It is not known when Ingram died, but most likely, he was one of the men who was hanged.\nReferences"
    }
  ]
}