{
  "content": [
    {
      "type": "text",
      "text": "# John Beardsley (art historian)\n\n}}\nJohn Beardsley is an art historian, curator, writer, and educator specializing in the fields of contemporary art and landscape architecture. His career has included exhibitions, publications, and teaching roles. that have emphasized diversity.\nCareer\nExhibitions\nIn 1982, Beardsley co-curated the exhibition Black Folk Art in America, 1930–1980 at the Corcoran Gallery of Art in Washington, D.C.,\nalongside Jane Livingston. The exhibition showcased the  creativity of self-taught African American artists who persevered despite social, political, and economic barriers during the Jim Crow era.\nIn 1987, he co-curated the exhibition Hispanic Art in the United States: Thirty Contemporary Painters and Sculptors at the Museum of Fine Arts, Houston (MFAH), co-curated with Livingston.  The exhibition featured a group of Latino artists, both trained and self-taught, representing a range of backgrounds, including Mexican-American, Cuban-American, Puerto Rican, and Latin American immigrant communities.\nIn 2002, he collaborated with Livingston and Alvia Wardlaw to curate The Quilts of Gee’s Bend at MFAH. This exhibition highlighted the abstract, improvisational quilt designs created by women from the predominantly Black community of Gee’s Bend, Alabama.\nEnvironmental art, outsider art, and landscape architecture\nIn 1977, he organized an exhibition of land art at the Hirshhorn Museum and Sculpture Garden in Washington, D.C. This led to the publication of his book Earthworks and Beyond: Contemporary Art in the Landscape (1984), which has since gone through four editions, the latest in 2006.\nIn 1997, he curated Human/Nature: Art and Landscape in Charleston and the Low Country for the Spoleto Festival USA, featuring site-specific installations by artists and landscape architects. His interests in landscape and outsider art converged in the publication of Gardens of Revelation: Environments by Visionary Artists (1995). His most recent book, James Castle: Memory Palace (2021), continues his exploration of self-taught art.\nBeardsley has contributed essays to Landscape Architecture Magazine. Later, he wrote extensively on contemporary design for Harvard Design Magazine and for anthologies and monographs on individual designers and design firms.\nAcademic contributions\nBeardsley has held teaching positions in the departments of landscape architecture at several institutions, including the University of Virginia, the University of Pennsylvania, and Harvard University. He was an adjunct professor at Harvard’s Graduate School of Design from 1998 to 2013.\nFrom 2008 to 2019, he served as the director of Garden and Landscape Studies at Dumbarton Oaks, Harvard’s research institute for the humanities in Washington, D.C. He continues to act as a consulting curator for visual arts at Dumbarton Oaks and served as the inaugural curator of the Cornelia Hahn Oberlander International Landscape Architecture Prize for the Cultural Landscape Foundation, Washington, D.C., from 2019-24.\nRecognition\nJohn Simon Guggenheim Memorial Foundation Fellowship, 1996-97. Graham Foundation for Advanced Study in the Fine Arts, fellowship, 1992. Art Critic's Fellowship, National Endowment for the Arts, 1984-85; 1979-80.\nEducation and personal life\nBeardsley earned an A.B. from Harvard and a Ph.D. from the University of Virginia. John Beardsley is married to Stephanie Beardsley. They reside in Virginia.\nOther activities\nLectures at museums, universities, and art schools in the United States, Great Britain, Canada, and Japan.\nReferences\nExternal links\n[http://www.johnbeardsley.com Personal website]"
    }
  ]
}