{
  "content": [
    {
      "type": "text",
      "text": "# John Kenrick (historian)\n\n| birth_place        = Exeter, England\n| death_date         =\n| death_place        = York, England\n| death_cause        =\n| occupation         = Historian\n| period             =\n| partner            = Laetitia Wellbeloved\n| relatives          = Charles Wellbeloved (father-in-law)\n| education          = Glasgow University\n| alma_mater         =\n| thesis_title       =\n| thesis_url         =\n| thesis_year        =\n| doctoral_advisor   =\n| academic_advisors  =\n| influences         =\n| discipline         =\n| sub_discipline     =\n| workplaces         =\n| notable_students   = John James Tayler, James Martineau\n}}\nReverend John Kenrick  (4 February 1788 – 7 May 1877) was an English classical historian.\nLife\nHe was born on 4 February 1788 at Exeter, the eldest son of Timothy Kenrick, Unitarian minister, and his first wife, Mary, daughter of John Waymouth of Exeter. He was educated at the local grammar school run by the Rev. Charles Lloyd and later at the nonconformist academy conducted by his father and the Rev. Joseph Bretland.\nIn 1807, Kenrick matriculated at Glasgow University. He was the first prizeman in his class for three successive years, won the Gartmore gold medal for an essay on the English constitution in the Tudor period, and a silver medal for an essay on the aberration of light. He graduated MA in 1810. Later that year, Kenrick became classics tutor at Manchester College, York. In 1819, he was given leave of absence to spend a sabbatical year in Germany, reading history at Göttingen. He returned to York in 1820 and began translating German classical works, including August Wilhelm Zumpt's Latin Grammar, Rost and Wusteman's Introduction to Greek Prose Composition and Matthiae's Greek Grammar.\nIn 1840, when the college returned to Manchester, Kenrick became professor of history, a post he held until his retirement in 1850. He continued to live in York, and travelled to Manchester to deliver lectures. Several of his pupils became celebrated for their writing, most notably John James Tayler (1797–1869), James Martineau (1805–1900), and George Vance Smith (1816–1902).\nKenrick joined the Yorkshire Philosophical Society on its foundation in 1823 and subsequently served on its Council and as a Vice-President. He was appointed the honorary curator of antiquities at the Yorkshire Museum in 1858, succeeding his father-in-law Charles Wellbeloved in the post. As part of a memorial to Wellebeloved, he donated his copies of Francis Drake's Eboracum and John Horseley's Britannia Romana to the museum.\nA portrait of Kenrick by the artist George Patten was hung on the staircase in the Yorkshire Museum after his death. It was placed alongside one of Charles Wellbeloved.\nKenrick died on 7 May 1877 and was buried in York Cemetery.\nFamily\nKenrick married, on 13 August 1821, Laetitia Wellbeloved (1795-1879), daughter of the principal of Manchester College, York, Charles Wellbeloved. They had no children.\nPublications\n*1841. The Egypt of Herodotus.\n*1850. Ancient Egypt under the Pharaohs.\n*1855. Phoenicia.\n*1858. Roman Sepulchral Inscriptions: their relation to archaeology, language, and religion.\nReferences\n*\nExternal links\n*"
    }
  ]
}