{
  "content": [
    {
      "type": "text",
      "text": "# John Edwards (American Civil War sailor)\n\n|birth_place   = Providence, Rhode Island\n|death_place   =\n|placeofburial = Cranston, Rhode Island\n|placeofburial_label = Place of burial\n|placeofburial_coordinates =\n|allegiance    =  United States of AmericaUnion\n|branch        =  United States Navy\n|serviceyears  =\n|rank          = Captain of the Top\n|unit          =\n|battles       = American Civil War Battle of Mobile Bay\n|awards        = Medal of Honor\n}}\nJohn Edwards (c. 1831 – December 27, 1902) was a Union Navy sailor in the American Civil War and a recipient of the U.S. military's highest decoration, the Medal of Honor, for his actions at the Battle of Mobile Bay.\nBiography\nBorn in about 1831 in Providence, Rhode Island, Edwards was still living in that city when he joined the Navy. He served during the Civil War as a captain of the top on the . At the Battle of Mobile Bay on August 5, 1864, Lackawanna engaged the  at close range and Edwards, acting as second captain of an artillery gun, was severely wounded in the face and arm by flying debris. Refusing to leave his post, he instead took over for the first captain and continued to man the gun for the remainder of the battle. For this action, he was awarded the Medal of Honor four months later, on December 31, 1864.\nEdwards's official Medal of Honor citation reads:\nAs second captain of a gun on board the U.S.S. Lackawanna during successful attacks against Fort Morgan, rebel gunboats and the ram Tennessee in Mobile Bay, on 5 August 1864. Wounded when an enemy shell struck, Edwards refused to go below for aid and, as heavy return fire continued to strike his vessel, took the place of the first captain and carried out his duties during the prolonged action which resulted in the capture of the prize ram Tennessee and in the damaging and destruction of batteries at Fort Morgan.\nEdwards died on December 27, 1902, at age 70 or 71 and was buried in Cranston, Rhode Island.\n}}\nExternal links\n*"
    }
  ]
}