{
  "content": [
    {
      "type": "text",
      "text": "# John S. Conway (historian)\n\nJohn Conway}}\n| birth_place        = London, England\n| death_date         =\n| death_place        = Vancouver, Canada\n| nationality        = British\n| citizenship        = Canadian\n| education          = MA (Cantab) and PhD, history, St John's College, Cambridge\n| occupation         = Professor of History, University of British Columbia\n| known_for          = Holocaust research\n| notable_works      = The Nazi Persecution of the Churches 1933–1945 (1968)\n| spouse             = Ann Conway\n| children           = Three\n| relatives          =\n}}\nJohn Seymour Conway (December 31, 1929 – June 23, 2017) was Professor Emeritus of History at the University of British Columbia, where he taught for almost 40 years. His work focused on the role of the Vatican and German churches during the Holocaust; on 20th-century Christian–Jewish relations; and on the Holocaust in Hungary and Slovakia.\nAuthor of the landmark study The Nazi Persecution of the Churches 1933–1945 (1968), Conway was one of the founding contributors, in 1970, to the Scholars' Conference on the Church Struggles and the Holocaust. He was awarded the Queen's Silver Jubilee Medal in 1977.\nEarly life and education\nConway was born, one of three boys, in London, England, to Elsie Conway, a marine biologist, and Geoffrey Seymour Conway. He came from a family that prized education. His mother was a graduate of Glasgow University; his father had graduated from Cambridge. Conway's paternal grandfather was the classicist Robert Seymour Conway. Katharine Glasier, the teacher and Independent Labour Party politician, was his great-aunt.\nAfter attending Sedbergh School, an independent school in Cumbria, Conway joined the British Army in 1948 as a conscript, working in intelligence in Austria. After being allowed to leave the army six months early to pursue his studies, he began reading English literature at St John's College, Cambridge, before switching to history. He completed both his BA and PhD at St John's.\nCareer\nIn 1955 Conway moved to Canada and taught international relations at the University of Manitoba. He had to return to England to defend his thesis and met his wife, Ann, on the boat on the way back to Canada. In 1957 Conway joined the history department at the University of British Columbia (UBC) in 1957, teaching modern European history and international relations. His 474-page study, The Nazi Persecution of the Churches 1933–1945, was published in 1968 in London by Weidenfeld & Nicolson. The book examined the position of several Christian churches during the Third Reich, including the Catholics, Methodists, Baptists and Jehovah's Witnesses. Conway also wrote papers on the role of the government and Jewish organizations during the Holocaust in Hungary and Slovakia, and about Rudolf Vrba, the Auschwitz escapee.}}\nConway spent nearly 40 years at UBC; he was appointed professor emeritus when he retired in 1995. In 1998 he became the Smallman Distinguished Visiting Professor in the Department of History at the University of Western Ontario. He sat on the editorial boards of Kirchliche Zeitgeschichte and the Journal of Holocaust and Genocide Studies; from 1995 he was also director of the Association of Contemporary Church Historians and editor of their newsletter. He delivered a lecture at Yad Vashem in Jerusalem in 1993.\nConway was a member of the Anglican Diocese of New Westminster's Refugee Liaison Committee. On the UBC campus, he had been long associated with the Student Christian Movement, and the World University Service of Canada (WUSC), for which he acted for many years as faculty advisor. He was a member of St James' Anglican Church in Vancouver.\nSelected works\n*(1965). Conway, John S. \"The Silence of Pope Pius XII\". The Review of Politics. 27(1):105–131.\n*(1968). Conway, John S. The Nazi persecution of the Churches 1933–1945. London: Weidenfeld & Nicolson. . Reissued in 1997 and 2001 by Regent College Publishing, Vancouver.\n**(1969). Conway, John S. La Persécution Nazie des Églises, 1933–1945. Paris: Éditions France-Empire.\n**(1969). Conway, John S. Die Nationalsozialistische Kirchenpolitik 1933–1945: Ihre Ziele, Widersprüche und Fehlschläge. Munich: Kaiser.\n*(1973). Conway, John S. \"The Vatican, Great Britain, and Relations with Germany, 1938–1940\". The Historical Journal. 16(1): 147–167.\n*(1973). Conway, John S. \"Between Apprehension and Indifference: Allied Attitudes to the Destruction of Hungarian Jewry\". Wiener Library Bulletin. 1973/4: 37–48.\n*(1974). Conway, John S. \"The Churches, the Slovak State and the Jews 1939–1945. The Slavonic and East European Review. 52(126): 85–112.\n*(1977). Conway, John S. Visit to the Tibetan settlements in northern India, 1977. New Westminster, B.C.: Institute of Environmental Studies, Douglas College.\n*(1978). Conway, John S. Bourgeois German Pacifism during the First World War. Papers of the Canadian Historical Association.\n*(1979).\n*(1980). Conway, John S. \"The Holocaust and the Historians\". The Annals of the American Academy of Political and Social Science. 450(1): 153–164.\n*(1980). Conway, John S. \"The Churches\", in Henry Friedlander and Sybil Milton (eds.). The Holocaust: Ideology, Bureaucracy, and Genocide. Millwood, New York: Kraus International Publications.\n*(1984).\n*(1984). Conway, John S. [https://web.archive.org/web/20160624002330/http://motlc.wiesenthal.com/site/pp.asp?c=gvKVLcMVIuG&b=394983 \"The First Report about Auschwitz\"]. Simon Wiesenthal Center Annual, 1: 133–151.\n*(1984). Conway, John S. \"Christians and Jews After the Holocaust: New Views in German Theology\". Shofar. 2(3): 21–22.\n*(1986). Conway, John S. \"The Holocaust in Hungary: Recent Controversies and Reconsiderations\", in Randolph L. Braham (ed.). The Tragedy of Hungarian Jewry: Essays, Documents, Depositions. New York: Institute of Holocaust Studies, City University of New York.\n*(1986). Conway, John S. \"Protestant Missions to the Jews 1810–1980: Ecclesiastical Imperialism or Theological Aberration?\". Holocaust and Genocide Studies 1(1):127–146.\n*(1987). Conway, John S. \"Catholicism and the Jews during the Nazi Period and After\", in Otto Dov Kulka and Paul R. Mendes-Flohr (eds.). Judaism and Christianity under the Impact of National Socialism. Jerusalem: Historical Society for Israel, 435–451.\n*(1989). Conway, John S. \"Canada and the Holocaust\", in Yehuda Bauer et al. (eds.). Remembering for the Future: Working Papers and Addenda. Vol. 1: Jews and Christians during and after the Holocaust. Oxford: Pergamon Press, 296–305.\n*(1991). Conway, John S. \"Remembering the Holocaust\". The Sewanee Review. 99(2): 286–295.\n*(1994). Conway, John S. \"The Vatican, Germany and the Holocaust\", in Peter Kent, John Francis Pollard (eds.). Papal Diplomacy in the Modern Age. Praeger.\n*(1994). Conway, John S. [https://heinonline.org/HOL/LandingPage?handle=hein.journals/jchs36&div=50&id=&page= \"The Stasi and the Churches: Between Coercion and Compromise in East German Protestantism, 1949–89\"]. Journal of Church and State.\n*(1995). Conway, John S. \"Christian-Jewish Relations during the Fifties\". Kirchliche Zeitgeschichte. 3(1): 11–27.\n*(2002).\n*(2005).\nReferences\nExternal links\n*\n*[https://collections.vhec.org/Detail/collections/675 \"Correspondence, articles and miscellaneous records\"], created by John Conway, Vancouver Holocaust Education Centre."
    }
  ]
}