{
  "content": [
    {
      "type": "text",
      "text": "# John S. Battle\n\n|birth_place         = New Bern, North Carolina, U.S.\n|death_date          =\n|death_place         = Charlottesville, Virginia, U.S.\n|resting_place= Monticello Memorial Park, Charlottesville, Virginia\n|constituency        =\n|party               = Democratic\n|spouse              = Janie Lipscombe\n|children            = 2\n|profession          = Lawyer, politician\n|alma_mater          =  (LLB)\n|religion            =\n|signature           =\n|footnotes           =\n|allegiance=\n|branch=\n|battles=World War I\n|rank= Private\n}}\nJohn Stewart Battle (July 11, 1890 – April 9, 1972) was an American lawyer and politician who served in both houses of the Virginia General Assembly and as the 56th Governor of Virginia (from 1950 to 1954). Battle was a member of the Byrd Organization.\nEarly and family life\nBattle was born in 1890 in New Bern, Craven County, North Carolina to Rev. Henry Battle and his wife. His paternal grandfather, Alabama lawyer and former Confederate General Cullen Battle, moved to North Carolina when John was a boy and became a newspaper editor as well the mayor of New Bern. He also lectured concerning his wartime experiences and the Lost Cause at various locations in North Carolina and Virginia. General Battle moved in with his son's family after his wife died. Rev. Battle moved his family several times during John's childhood, including to Petersburg, Virginia. After graduating from high school, John Battle traveled to Asheville, North Carolina and earned an associate's degree from Mars Hill College (then a junior college). He then earned a bachelor's degree from Wake Forest University (then a college) and a bachelor of laws (LLB) degree from the University of Virginia School of Law in 1913[https://www.nga.org/governor/john-stewart-battle/#:~:text=He%20attended%20Wake%20Forest%20College%20and%20went%20on,in%20the%20U.S.%20Army%20during%20World%20War%20I.].\nPolitical career\nBattle won election to the Virginia House of Delegates in 1929, and was re-elected twice to the part-time position. A member of the Byrd Organization, Battle began serving in the Virginia State Senate in 1934, and that part-time service continued until 1949, when he resigned upon winning the gubernatorial election.\nWith the assistance of Virginia Beach boss Sidney Kellam, Battle defeated \"anti\" Byrd Organization leader Francis Pickens Miller in the Democratic primary, by depicting him as a liberal and controlled by labor unions, and nearly ignoring his other opponents (Horace Edwards and Petersburg businessman Remmie Arnold). Prominent Republican Henry Wise of the Virginia Eastern Shore even urged his supporters to vote for Battle in the Democratic Party to repel the \"invasion by aliens.\" Battle won 43% of the vote; Miller 35%, Edwards 15% and Arnold 7%\nDuring his gubernatorial term, Virginia's General Assembly approved $45 million for school construction, which barely kept pace with population increases. Per pupil expenditures and teacher salaries remained below national averages, and the state ranked last nationally in percentage of high school age children actually attending high school, and next-to-last in college age children going to college. Virginia also ranked 40th in appropriations to care for the mentally ill.\nBattle was a Delegate to the Democratic National Convention in 1948, 1952, 1956, 1960, and 1968. When the Virginia delegation was threatened with expulsion at the 1952 Democratic Party national convention for refusing to sign a loyalty oath to whomever the party nominated (U.S. Senator Harry F. Byrd often disagreeing with President Harry S Truman), Battle delivered a speech to the convention that forestalled expulsion and helped prevent a split like the Democrats experienced in 1948. In 1956, Battle became the Dixiecrat candidate for the Democratic presidential nomination, eventually losing in floor voting to former Illinois Governor Adlai Stevenson.\nAfter his term ended in 1954, Battle went into semi retirement in Charlottesville, Virginia, although he continued to practice law, including representing the Albemarle County public schools, who faced a desegregation lawsuit by the NAACP.\nBattle's political ambitions continued, despite the national spotlight on Virginia and the Massive Resistance declarations by incumbent Senator Harry F. Byrd Sr. after the U.S. Supreme Court decisions in 1954 and 1955 in Brown v. Board of Education. Battle was prepared to run for the U.S. Senate in 1958 if Senator Byrd chose not to run for reelection. Former Governor (and then Congressman) William Tuck had similar ambitions and even more fiery rhetoric, and Byrd chose to run again to avoid the political infighting that would result from a Battle-Tuck primary fight.\nIn 1959, President Eisenhower called on Battle to serve on the U.S. Commission on Civil Rights, citing his moderate history on racism.\nDeath and legacy\nBattle died in 1972, at the age of 81, and was buried in Monticello Memorial Park in Charlottesville.\nHis two sons became lawyers and continued their father's public involvement: William C. Battle, (1920&ndash;2008) became United States Ambassador to Australia and president of the United States Golf Association, as well as the Democratic candidate for Governor of Virginia in 1969. John S. Battle, Jr. (1919–1997) became a Founding Trustee of the Thomas Jefferson Center for Free Expression, as well as served two terms on the Board of Visitors at the University of Virginia (1982&ndash;1990).\nJohn S. Battle High School in Washington County, Virginia, built in 1959, bears his name. Battle Hall at the Virginia School for the Deaf and the Blind is also named for the former governor.\nElection\n1949; Battle was elected Governor of Virginia with 70.43% of the vote, defeating Republican Walter Johnson and Social Democrat Clark T. Robb.\nReferences\nExternal links\n*"
    }
  ]
}