{
  "content": [
    {
      "type": "text",
      "text": "# John Stewart, 3rd Earl of Lennox\n\n1490\n| birth_place =\n| death_date =\n| death_place = Linlithgow, Scotland\n| issue = Matthew Stewart, 4th Earl of LennoxRobert Stewart, 1st Earl of MarchJohn Stewart, 5th Lord of AubignyHelen Stewart, Countess of ErrollElizabeth Stewart-Ross\n}}\nJohn Stewart, 3rd Earl of Lennox ( 1490 – 4 September 1526) was a prominent Scottish nobleman. He was the son of Matthew Stewart, 2nd Earl of Lennox, and his wife Lady Elizabeth Hamilton, daughter of James Hamilton, 1st Lord Hamilton, and Mary Stewart, Princess of Scotland, daughter of King James II of Scotland.\nThe Earl of Lennox led an army to Linlithgow with the intention of liberating the young King James V of Scotland from the pro-English Douglases. He was defeated by a smaller force led by James Hamilton, 1st Earl of Arran, at the Battle of Linlithgow Bridge. He survived the battle and was taken captive, only to be murdered subsequently by James Hamilton of Finnart.\nHe was succeeded by his eldest son, Matthew Stewart, 4th Earl of Lennox. The latter was the father of Henry Stewart, Lord Darnley, and the grandfather of King James VI of Scotland.\nMarriage and children\nOn 19 January 1511, he married Lady Elizabeth Stewart, daughter of John Stewart, 1st Earl of Atholl, and Lady Eleanor Sinclair, daughter of William Sinclair, 3rd Earl of Orkney.\nTheir children included:\n* Matthew Stewart, 4th Earl of Lennox.\n* Robert Stewart, 1st Earl of March.\n* John Stewart, 5th Lord of Aubigny (died c. 1567), father of Esmé Stewart, 1st Duke of Lennox.\n* Lady Helen (or Eleanor) Stewart, who married: firstly, to William Hay, 6th Earl of Erroll; secondly, to John Gordon, 11th Earl of Sutherland. She died in the 1560s.\n* Lady Elizabeth Stewart, who married Ninian Ross. She was the mistress of King James V, and the mother of Adam Stewart, Prior of Perth Charterhouse.\nIn March 1539, Helen Stewart and Elizabeth Stewart were with the household of Mary of Guise at Linlithgow Palace. The king's tailor Thomas Arthur made gowns and kirtles for them of black velvet, satin, and taffeta, with French hats and riding hoods.\nAncestors\nSources\nG. E. Cokayne et al., eds. The Complete Peerage of England, Scotland, Ireland, Great Britain, and the United Kingdom, Extant, Extinct, or Dormant. Reprint ed. (Gloucester, UK: Alan Sutton Publishing, 2000)."
    }
  ]
}