{
  "content": [
    {
      "type": "text",
      "text": "# John D. Kelly (World War II soldier)\n\n|death_date=\n|birth_place=Venango Township, Pennsylvania, US\n|death_place= near Fort du Roule, Cherbourg, France\n|placeofburial= Epinal American Cemetery and Memorial, Épinal, France\n|placeofburial_label= Place of burial\n|image=\n|caption=\n|nickname=\n|allegiance= United States\n|branch=United States Army\n|servicenumber=33271778\n|serviceyears=1942–1944\n|rank=Technical Sergeant\n|commands=\n|unit=314th Infantry Regiment, 79th Infantry Division\n|battles=World War II\n|awards=Medal of HonorPurple Heart (2)\n|relations=\n|laterwork=\n}}\n]]\nJohn D. Kelly (July 8, 1923 – November 23, 1944) was a United States Army soldier and a recipient of the United States military's highest decoration—the Medal of Honor—for his actions in World War II.\nBiography\nKelly joined the Army from Cambridge Springs, Pennsylvania in June 1942, and by June 25, 1944, was serving as a corporal in Company E, 314th Infantry Regiment, 79th Infantry Division. On that day, at Fort du Roule, Cherbourg, France, Kelly repeatedly exposed himself to hostile fire in order to destroy an enemy emplacement and capture its occupants. He was killed in action five months later after having been promoted to technical sergeant. For his actions at Fort du Roule, he was posthumously awarded the Medal of Honor on January 24, 1945.\nKelly died November 23, 1944, and was buried at the Epinal American Cemetery and Memorial in Épinal, France.\nMedal of Honor citation\nKelly's Medal of Honor citation reads:\nFor conspicuous gallantry and intrepidity at the risk of his life above and beyond the call of duty. On 25 June 1944, in the vicinity of Fort du Roule, Cherbourg, France, when Cpl. Kelly's unit was pinned down by heavy enemy machinegun fire emanating from a deeply entrenched strongpoint on the slope leading up to the fort, Cpl. Kelly volunteered to attempt to neutralize the strongpoint. Arming himself with a pole charge about 10 feet long and with 15 pounds of explosive affixed, he climbed the slope under a withering blast of machinegun fire and placed the charge at the strongpoint's base. The subsequent blast was ineffective, and again, alone and unhesitatingly, he braved the slope to repeat the operation. This second blast blew off the ends of the enemy guns. Cpl. Kelly then climbed the slope a third time to place a pole charge at the strongpoint's rear entrance. When this had been blown open he hurled hand grenades inside the position, forcing survivors of the enemy guncrews to come out and surrender. The gallantry, tenacity of purpose, and utter disregard for personal safety displayed by Cpl. Kelly were an incentive to his comrades and worthy of emulation by all.\nSee also\n* List of Medal of Honor recipients for World War II\nReferences\n:\nExternal links\n*"
    }
  ]
}