{
  "content": [
    {
      "type": "text",
      "text": "# John Warner (writer)\n\nJohn Warner (born 1970) is an American writer, editor, and teacher of writing. He is the editor of ''McSweeney's Internet Tendency, a frequent contributor to The Morning News, and has been anthologized in May Contain Nuts, Stumbling and Raging: More Politically Inspired Fiction, and The Future Dictionary of America.\nCareer\nWarner previously taught at Clemson University in Clemson, South Carolina. His focus was creative writing, and he was the director of a Humor Creative Inquiry. In this inquiry, he was working to teach students what humor is and how to create it. This three course series resulted in a student publication in 2008. Warner teaches creative writing at College of Charleston in Charleston, South Carolina. He was the \"Chief Creative Czar\" of TOW Books, a publishing imprint dedicated to humorous books distributed by F+W Publications. The line was inspired by his book, Fondling Your Muse (2005), which parodies Writer's Digest''.\nWarner frequently collaborates with writer Kevin Guilfoile. Warner's most debut novel was The Funny Man. The book has been reviewed by Publishers Weekly and Kirkus Reviews. His short story collection Tough Day for the Army, edited by Michael Griffith, was published by the LSU Press series, Yellow Shoe Fiction, in 2014.\nWorks\nAs author\n* More Than Words: How to Think About Writing in the Age of AI (2025) ()\n* Sustainable. Resilient. Free.: The Future of Public Higher Education (2020) ()\n* ''The Writer's Practice: Building Confidence in Your Nonfiction Writing (2019) ()\n* Why They Can't Write: Killing the Five-Paragraph Essay and Other Necessities (2018) ()\n* The Funny Man (2011) ()\n* So You Want to Be President? (2008) ()\n* Fondling Your Muse: Infallible Advice from a Published Author to the Writerly Aspirant (2005) ()\n* My First Presidentiary (2001) (with Kevin Guilfoile) ()\nAs editor or co-editor\n* Mountain Man Dance Moves: The McSweeney's Book of Lists (2006) ()\n* Created in Darkness by Troubled Americans: The Best of McSweeney's Humor Category'' (2005) ()\nPersonal life\nWarner's great uncle is the American writer Allan Seager.\nReferences\nExternal links\n* [https://www.insidehighered.com/users/john-warner Just Visiting (Warner's blog at Inside Higher Ed)]"
    }
  ]
}