{
  "content": [
    {
      "type": "text",
      "text": "# John Howard Redfield\n\nJohn Howard Redfield (July 10, 1815 – February 27, 1895) was an American botanist, conchologist, and businessman. He was a founder of the Botany section of the Academy of Natural Sciences of Philadelphia, and his chief botanical works include \"Geographical Distribution of the Ferns of North America\" and Flora of Mount Desert Island, Maine.\nRedfield was born in Middletown, Connecticut, the eldest son of meteorologist William C. Redfield, who served as first president of the American Association for the Advancement of Science, and his first wife Abigail Wilcox.  His mother died in 1819, and the Redfield family moved to New York City in 1827. In 1843 he married Mary Jane Whitney, daughter of manufacturer Asa Whitney, and with her had four children. He worked as an agent of the Swiftsure line of propellers and barges in New York and later with his father-in-law in Philadelphia, retiring from active business in 1885.  He became a member of the New York Lyceum of Natural History in 1836 and befriended Dr. Asa Gray.  At the Lyceum he developed an interest in conchology and published several conchological articles in the Lyceum's Annals, as well as an article on fossil fishes.\nHe became a member of the Academy of Natural Sciences in Philadelphia as early as 1846. He removed to Philadelphia in 1861 and in 1870 was made a member of the Academy's council and conservator of its Botanical Section, where he oversaw the herbaria. He made occasional botanical excursions with Gray and others. In his later years he spent summers in Mount Desert Island, Maine, where he produced with his friend Edward L. Rand a catalogue of plants from it and neighboring islands, published in 1894 as Flora of Mount Desert Island, Maine.\nHe died in Philadelphia in 1895 after several weeks of illness. He produced over 50 scientific works, as well as a genealogy of the Redfield family and an autobiography, posthumously published in 1900. The grass genus Redfieldia was named in his honor, and the fossil fish Redfieldius named after him and his father. Of his children, son Robert Stuart Redfield achieved note as a photographer, becoming president of the Photographic Society of Philadelphia and a founding member of the Photo-Secession movement.\nBooks\n*\n*\n*\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}