{
  "content": [
    {
      "type": "text",
      "text": "# John Carteret Pilkington\n\nJohn Carteret Pilkington (1730–1763) was an Irish singer and writer who left lively memoirs of his early life and collaborated on the memoirs of his mother Laetitia Pilkington.\nOrigins\nKnown as Jack, the younger surviving son of the art historian Matthew Pilkington and the poet Laetitia Pilkington, he was christened by the rites of the Church of Ireland in Dublin on 1 May 1730. His godparents were the Lord Lieutenant of Ireland, Viscount Carteret later 2nd Earl Granville, for whom Dr Patrick Delany was proxy, a churchman, Robert Clayton later Bishop of Killala, and two women writers, Constantia Grierson and Mary Barber.\nLife\nWhen his parents divorced and his mother left for London in 1738, he remained in the care of his father in Dublin. Unhappy there, in about 1740 he ran away to Cork, where his mother's childless uncle Dr George van Lewen gave him a temporary home. Going back alone to Dublin, he met the eccentric Richard Pockrich, inventor of the glass harp.  He was then taken up for a while by the widower Charles O'Neill of Shane's Castle, who enjoyed his company and singing abilities. From there, he joined the composer Thomas Arne's operatic troupe, with whom he made his stage debut in Dublin on 7 May 1743, singing the title role in Tom Thumb. Tensions in the company led him to flee to Scotland in 1744, shortly before the outbreak of the Jacobite rising of 1745, from where he joined the ship's company of a privateer and ended up in London in 1746.  There he found his mother and gained work at the Theatre Royal, Drury Lane.\nWar called him once more, when he enlisted in the force assembled by his relation, Captain John Meade of the Grenadier Guards, that left on 7 September 1746 for the abortive Raid on Lorient. Returning to London, next year he took his mother back to Dublin, where he acted and sang in Dublin shows, some written in part by Laetitia.  After her death in 1750, he was warned by the Irish government that her activities had been tolerated but he was liable to be deported. Finishing Volume III of her Memoirs, he left with his wife in 1754 to get it printed in London. There he tried to live as a writer, becoming friendly with fellow-Irishman Oliver Goldsmith, but suffered three spells of imprisonment for debt in the Marshalsea. He had little further success in the theatrical world, quarrelling with both Samuel Foote and David Garrick. His own memoirs were printed in London in two editions, coming out in 1760 and 1761.\nAged 33, he died in 1763, being buried on 15 May 1763 at Brixham in Devon.\nFamily\nOn 7 July 1753, at St. Peter's Church, Aungier Street, Dublin, he married Ann Smith and they had three children, including Georgiana Caroline Pitt Pilkington (1757–1838), known as Caroline, who was named after her godmother Georgiana Clavering-Cowper, Countess Cowper, the daughter of Earl Granville. Caroline married or lived with several men, including two Americans, the New Jersey loyalist Joseph Smyth and the Massachusetts artist James Earl. With Smyth, she had the scientist Admiral William Henry Smyth, and with Earl she had two artists, Phoebe Earle, who married fellow-painter Denis Dighton, and Augustus Earle.\nWorks\nHis surviving writings are the original and a later expanded version of his picaresque autobiography, which give a vivid picture of his early years and of the varied milieus in which he moved:\n* The Real Story of John Carteret Pilkington, Written by Himself. [London, 1760]\n* The Life of John Carteret Pilkington Vol. II. To which are added, Letters Between Lord K ---gsb-----h (Kingsborough), and Mrs. Laetitla Pilkington, Also Poems, &c. by the Rev. Mr. Matthew Pilkington Revised and Corrected by the late Dean Swift. [London, 1761]\nReferences\nBibliography\nA.C.Elias, Jr.(ed) Memoirs of Laetitia Pilkington [Athens, Georgia: The University of Georgia Press,1997]\nNorma Clarke. Queen of the Wits: A Life of Laetitia Pilkington [London, England: Faber & Faber, 2008]\nExternal links\nAutobiography at https://archive.org/details/realstoryjohnca00unkngoog and at https://books.google.com/books?id=srBYAAAAMAAJ&dq=%22john+carteret+pilkington"
    }
  ]
}