{
  "content": [
    {
      "type": "text",
      "text": "# John Macqueen Cowan\n\nJohn Macqueen Cowan FRSE CBE (1891–1960) was a prominent Scottish botanist in the mid 20th century. He is especially remembered for the recording and classification of trees on the Indian sub-continent. He was also an expert on Spermatophytes.\nLife\nCowan was born in Banchory in northern Scotland in 1891. He was educated at Robert Gordon's College in Aberdeen. He then attended both Edinburgh and Oxford University training as a botanist, specialising in trees, receiving a postgraduate doctorate (DSc) from Edinburgh in 1927. From 1927 to 1929 he worked with the Indian Forest Service and conducted many studies of tree species throughout India.\nIn February 1929 he made a study trip around the Near East with fellow botanist Cyril Darlington.\nHe worked at the Royal Botanic Garden Edinburgh 1930 to 1954 alongside Roland Edgar Cooper (both then under William Wright Smith). In 1954 Cowan took over as Curator of Inverewe Garden on the west coast of Scotland. During the Second World War he provided valuable advice to the Ministry of Supply in relation to the Home-Grown Timber Production Department.\nIn 1931 he was elected a Fellow of the Royal Society of Edinburgh his proposers including Sir William Wright Smith, William Grant Craib and Albert William Borthwick.\nHe served as president of the Botanical Society of Edinburgh for 1951–53. He was awarded the Veitch Memorial Medal in 1951 and the Victoria Medal of Honour in 1958.\nQueen Elizabeth created him a Commander of the Order of the British Empire (CBE) in 1952.\nHe died in 1960.\nPublications\n*The Flora of the Chakaria Sundarbans (1928); [https://lccn.loc.gov/agr28001503 Library of Congress Catalog entry]\n*with Adeline May Cowan: The Trees of Northern Bengal (1929)\n*The Forests of Kalimpong (1929); [https://lccn.loc.gov/agr30000020 Library of Congress Catalog entry]\n*Nature Study Talks on Animals and Plants (1929)\n*[https://archive.org/details/notes-from-royal-botanic-garden-edinburgh-19-091-001-062/page/1/mode/2up The History of the Royal Botanic Garden Edinburgh] (1935)\n*A Guide to the Younger Botanic Garden at Benmore, Argyllshire (1937)\n*The Rhododendron Leaf (1949)\n*The Wildlife of the Sundarbans Chakaria (1952)\nFamily\nCowan married fellow-botanist Adeline May Organe (died 1981). Their second daughter was Pauline Cowan (born 1926) who, as Pauline Harrison, was later given a personal Chair in the Department of Biochemistry at Sheffield University.\nBotanical References\nReferences"
    }
  ]
}