{
  "content": [
    {
      "type": "text",
      "text": "# John Killough Stewart\n\nJohn Killough Stewart was a businessman and philanthropist in Queensland, Australia.\nEarly life\nJohn Klllough Stewart was born on 27 January 1867 in Brisbane, the son of Alexander Stewart, a clothing manufacturer, and his wife Anne (née Killough).\nHis father Alexander Stewart was well known as the owner of the Glen Lyon estate in Ashgrove and was in partnership with William Hemmant in a wholesale clothing manufacture business.\nBusiness life\nIn the 1890s, William Hemmant retired and John Stewart entered into partnership with his father. This business was converted into a limited liability company in 1905.\nJohn Stewart was a member of the council of the Royal National Association between 1897 and 1908, and served a term as vice-president and acting chairman. He also was a member of the National Political Association. In 1916 he joined the board of directors of the Union Trustee Company of Australia Ltd. After four years as vice-chairman he was elected chairman in 1926, and held that position until his death.\nPublic life\nHe was actively associated with the Brisbane Chamber of Commerce between 1898 and 1927. In 1910 he was appointed by the Queensland Government as a member of the University of Queensland Senate, relinquishing the position in 1916.\nJohn Stewart took an active part in the work of the Wickham Terrace Presbyterian Church, and subsequently in that of St Andrew's Presbyterian Church in Creek Street. He was the treasurer of the church for some time, and was elected to the committee of management in 1897. He became an elder of the church in 1907. Mr. Stewart, was a member of the Young Men's Christian Association for about 30 years, and had been elected a life member. He was on the board of directors for about 16 years, and a vice president for eight years. He was a generous supporter of the association, and made it passible to establish a permanent camp at Burleigh Heads.\nHobbies\nJohn Stewart was a life member of the Brisbane Cricket Association, and had been a member of the Brisbane Golf Club and the Toowong Bowling Club. For some years Mr. Stewart lived at Grantuly on the Glen Lyon estate.\nIn 1908, John Stewart and his Humber won the Prize for the Best Turned Out Car at the Motor Gymkhana held by the Queensland Automobile Club at the Brisbane Cricket Ground.\nLater life\nBetween 1927 and 1932 he lived with his two sons, who were farming at Toogoolawah.\nMr. John Killough Stewart died on 20 March 1938 at the age of 71 years in Brisbane. He was survived by his wife, his two sons and two daughters.\nReferences"
    }
  ]
}