{
  "content": [
    {
      "type": "text",
      "text": "# John Ward House (Salem, Massachusetts)\n\n| locmapin              = Massachusetts#USA\n| area                  =\n| built                 = 1684\n| architect             = Ward, John\n| architecture          = First Period\n| added                 = November 24, 1968\n| designated_nrhp_type  = November 24, 1968\n| refnum                = 68000045\n| nrhp_type2            = cp\n| nocat                 = yes\n| designated_nrhp_type2 = June 22, 1972May 12, 1976\n| partof                = Essex Institute Historic District (#72000147)Salem Common Historic District (#76000303)\n}}\nThe John Ward House is a National Historic Landmark at 9 Brown Street in Salem, Massachusetts, United States. With an early construction history between 1684 and 1723, it is an excellent example of First Period architecture, and as the subject of an early 20th-century restoration by antiquarian George Francis Dow, it is an important example of the restoration techniques.  Now owned by the Peabody Essex Museum, it is also one of the first colonial-era houses in the United States to be opened as a museum.  It was designated a National Historic Landmark in 1968.\nHistory\nThe Ward House was built in three distinct phases.  John Ward, a currier by profession, built the first portion of the house in 1684.  This consisted of a two-story structure with one room on each floor, and a large chimney at one end.  This portion was extended by Ward to the right-side of the chimney, giving the house a typical colonial five-bay facade, with center entry and chimney.  The last addition to the house was the lean-to at the rear, which gave the house a saltbox appearance, and was apparently added not long before Ward's death in 1734.  By this time he was apparently sharing the house with his son Benjamin, who inherited the property.  The house remained in the hands of the Ward family until 1816, when it was sold at auction as part of an estate.\nThe buyer at auction was Temple Hardy, who lived in the house for forty years, and operated a bakery on the premises.  The house was then converted to a multi-unit residential tenement, which it remained until 1910.  At some point in the 19th century a wing was added to the east end of the building; this was removed before 1905. Originally located on Prison Lane (now St. Peter Street), the house was moved to its present site in 1910 by splitting it into two and rolling it on ox-drawn logs from its original site three blocks away.  In 1912 the house underwent a careful restoration under the direction of antiquarian George Francis Dow.  Dow's work included decorating the space to meet his conception of the use of the house c. 1700.\nIn 1911, parts of the house were opened to the public, becoming the first outdoor museum of architecture in the country.  The Peabody Essex Museum now offers guided tours of the house.  Rooms on the first floor feature 17th-century furnishings and displays in the lean-to on retail premises of the period.\nIn 1967, a replica of the John Ward House was constructed near mile marker 80 of the Massachusetts Turnpike in Charlton, Massachusetts. The building served as an experimental tourist information center for the Massachusetts Turnpike Authority, and was replete with costumed staff. The reproduction reportedly cost $70,000 to construct, and later served as an RMV for the state. The building is currently not operational.\nDescription\nThe house is a -story wood-frame structure, five bays wide, with a large central chimney and a side-gable roof.  The roof of the main facade has two large cross gable sections, each with a single window; these gables were removed at some time in the history of the house, and rebuilt at the time of its restoration. The windows on the first two floors of the main facade are doubled casement windows with diamond panes (all of the house's windows are diamond-paned), except that above the doorway, which is a single window.  The exterior is finished in clapboards, with very simple cornerboards and trim.  The second floor extends over the first floor by a modest amount.\nThe first floor interior is a somewhat typical center-chimney plan, with chambers on either side, and a narrow stairway rising to the second floor directly inside the front door.  Both the front door and the staircase are restored elements.  The room left of the chimney is the parlor, and is finished in pine.  Traces of whitewash and paint are evident on the main beams, and the summer beam and posts are chamfered.  The floor and some of its joists are partly original, and partly the work of the 1912 restorers.  The only major structural member to have restorative work done was a post supporting the chimney girt.  The right-side room, considered the kitchen, exhibits similar restorative work.\nOn the second floor, the left chamber is the finer of the two, but is framed in oak instead of pine.  The right-side chamber was left unrestored by the 1912 work, and exhibits faded wallpaper and a plastered ceiling, much as it would have at that time.  The roof, although many of its framing elements are numbered in a traditional way, shows evidence of having been extensively reworked during the restoration.\nSee also\n*List of the oldest buildings in the United States\n*List of the oldest buildings in Massachusetts\n*List of National Historic Landmarks in Massachusetts\n*National Register of Historic Places listings in Salem, Massachusetts\n*National Register of Historic Places listings in Essex County, Massachusetts\nReferences\nExternal links\n*[https://web.archive.org/web/20080705121322/http://www.pem.org/visit/house_phillips.php Peabody Essex Museum: Phillips Library Neighborhood] - includes the John Ward House\nEarly photo of the house"
    }
  ]
}