{
  "content": [
    {
      "type": "text",
      "text": "# John Warren Moore\n\nJohn Warren Moore (1826–1879) was a Confederate Officer, Sheriff and farmer from Mobile, Alabama. He served in the Confederate States Army and was present at the Battle of Atlanta. He was a farmer later in life settling in Western Mobile County where he was, among other things, from 1859 until his death the Deputy Sheriff/Sheriff.\nBiography\nMoore was born in April 1826 in Alabama. He is the son of John Moore Sr possibly from Georgia and Nicey Turner of Mobile, Alabama. He married Mahala Ann Roberts (1828–1886), daughter of Richard Roberts and Sarah Baker, on (October 23, 1847). The Roberts Family were pioneers of Jackson County, Mississippi.\nDuring his military career John W. Moore served as Quartermaster for the 9th Mississippi Cavalry Company A. He was also part of the 17th Mississippi Cavalry at the beginning of the Civil War.\nFrom census records and land records we get a good picture of John W. Moore's family. His children are John Percy Moore born April 1849, Eugene Moore born December 1850, Martha Ann Moore July 1853, Mahala Elizabeth Moore June 1855, Joseph \"Jo\" and Mascalia Moore (twins) born June 1858.\nJohn Moore owned land that was located in the western part of Mobile County near the present day Tanner-Williams Rd. His original land claim which was legally purchase was disputed by the railroad and was subsequently part of litigation which saw his living heirs receive payment for the homestead of 1846. His land,  was not \"returned\" to his heirs until 1895.\nAdditional Information:\nWilliam Deakle that J W. Moore mentions in the letters from the battlefield was his neighbor.\nBetty that he mentions in the letters was also his neighbor Betty Shem.\nReferences\nJohn W. Moore and Mahala Roberts marriage record [http://genealogytrails.com/ala/mobile/marr1.html Mobile County Marriages 1847-1848]\nJohn W. Moore deceased, homestead land grant to his heirs, 1895. [http://www.glorecords.blm.gov/PatentSearch/Image.asp?PatentDocClassCode=STA&Accession=AL1410%5F%5F%2E008&Format=PDF&Page=1&Index=2&QryID=44434%2E84 Land Patent John W. Moore's Heirs]"
    }
  ]
}