{
  "content": [
    {
      "type": "text",
      "text": "# John Stewart, 1st Earl of Traquair\n\nJohn Stewart, 1st Earl of Traquair (died 27 March 1659) was a Scottish statesman who was created Baron Stewart of Traquair in 1628 and Earl of Traquair in 1633.\nLife\nHe was the son of John Stewart, the Younger, of Traquair in Peeblesshire, of a branch, originally illegitimate, of the house of Buchan. His mother was Margaret Stewart, a daughter of Andrew, Master of Ochiltree, and Margaret Stewart. She was a lady-in-waiting in the household of Anne of Denmark.\nHe was appointed Treasurer-depute of Scotland and an Extraordinary Lord of Session in 1630. In February 1633 Traquair visited building and repair works at Linlithgow Palace, Dunfermline Palace, and Stirling Castle. In 1633 Charles I was crowned in Edinburgh, and Traquair was involved in repairing the Scottish crown jewels and the royal wardrobe.\nTraquair is said to have given the casting vote against John Elphinstone, 2nd Lord Balmerino at his trial in 1634, but afterwards obtained his pardon. From 1636 to 1641 he held the office of Lord High Treasurer of Scotland, and aided Charles I in introducing the liturgy.\nHe endeavoured to prevent a conflict by impressing on the king the necessity of caution and the danger of extreme measures against the rioters. He was, however, compelled to publish Charles's proclamation enforcing the use of the liturgy and forbidding hostile demonstrations on pain of treason (1638). This was followed by military measures in which Traquair assisted by secretly conveying munitions of war to Dalkeith Palace. He was, however, obliged to surrender the place with the regalia to the Covenanters (March 1639).\nAfter the Treaty of Berwick he was appointed the king's commissioner to the assembly at Edinburgh (August 1639), and he assented in writing to the act abolishing episcopacy, but prevented its ratification by adjourning the opening of parliament.\nHis apparent double-dealing made him suspected by both parties, and in 1641 the Scottish parliament issued a warrant for his arrest. In his absence he was sentenced to death, but, although the king secured the remission of this penalty, he was dismissed from his office of treasurer, and in 1644, for repairing to the court and opposing the covenant, he was declared an enemy to religion and fined 40,000 marks. Stewart was accused of being a freemason.\nHis son, Lord Linton, whom he had sent to Montrose with a troop of horse, withdrew on the eve of the Battle of Philiphaugh (September 1645) and it has been supposed that Traquair betrayed Montrose's plans to David Leslie. He was readmitted to parliament in 1646, raised cavalry for the \"engagement\" between the king and the Covenanters, and was captured at Preston (1648). He was released by Oliver Cromwell in 1654, and died on 27 March 1659. He was succeeded by his only son John (c. 1622–1666), whose descendants held the title until 1861, when on the death of Charles, the 8th earl, it became dormant or extinct.\nFamily\nHe married Lady Catherine Carnegie, daughter of David Carnegie, 1st Earl of Southesk and had three children:\n* John Stewart, 2nd Earl of Traquair (c. 1622–1666).\n* Margaret Stewart, married James Douglas, 2nd Earl of Queensberry. Parents of William Douglas, 1st Duke of Queensberry.\n* Elizabeth Stewart, married Patrick Murray, 2nd Lord Elibank.\nSee also\n*William Armstrong, outlaw employee of the Earl.\nNotes\nReferences\n*  That article references:\n** Spalding, Memorialls (Spalding Club)\n** Sir James Balfour, Annals (ed. Haig, 1824)\n** Dict. Nat. Biog., vol. liv."
    }
  ]
}