{
  "content": [
    {
      "type": "text",
      "text": "# John Beckett (historian)\n\n| image              =\n| alt                =\n| caption            =\n| birth_name         = John Vincent Beckett\n| birth_date         =\n| birth_place        =\n| death_date         =\n| death_place        =\n| nationality        = English\n| residence          =\n| known_for          =\n| home_town          =\n| spouse             =\n| children           =\n| parents            =\n| awards             =\n| website            =\n| alma_mater         = University of Lancaster\n| thesis_title       = Land Ownership in Cumbria, c.&nbsp;1680–c.&nbsp;1750\n| thesis_year        = 1975\n| school_tradition   =\n| doctoral_advisor   =\n| academic_advisors  =\n| influences         =\n| era                =\n| discipline         = History\n| sub_discipline     = English local history\n| workplaces         =\n| doctoral_students  =\n| notable_students   =\n| main_interests     =\n| notable_works      =\n| notable_ideas      =\n| influenced         =\n| signature          =\n| signature_alt      =\n}}\nJohn Vincent Beckett  (born 1950) is an English local historian who has been Professor of English Regional History at the University of Nottingham since 1990.\nCareer and research\nBeckett was born on 12 July 1950 to William Vincent Beckett and his wife, Kathleen Amelia, née Reed. He completed an undergraduate degree at the University of Lancaster in 1971, which awarded him a Doctor of Philosophy degree four years later for his thesis Land Ownership in Cumbria, c. 1680–c. 1750.\nFrom 1974 to 1976, Beckett was the Lord Adams Research Fellow at Newcastle University; he then spent two years lecturing at Fairleigh Dickinson University's Banbury-based Wroxton College, and then lectured at the University of Hull for a short period before taking up a lectureship at the University of Nottingham in 1979. He was promoted to a readership in English regional history in 1987, and three years later promoted to his current professorship. Beckett was also Director of the Victoria County History series from 2005 to 2010, and has served as chairman of a number of editorial boards, including that of the journal Midlands History (since 2001) and the History of Lincolnshire Committee of the Society for Lincolnshire History and Archaeology (since 1988). He has been chairman of the Thoroton Society since 1992 and chaired the British Agricultural History Society for four years from 2001.\nBecket is a historian of England in the eighteenth and nineteenth centuries. He is a local historian, and has studied topics relating to village life, Parliamentary enclosure and local politics, agricultural history, church history, and the history of landed estates and their owners.\nHonours\nBeckett was elected a Fellow of the Society of Antiquaries of London in 1992 and is also a Fellow of the Royal Historical Society as of 2018.\nSelected publications\n* Coal and Tobacco: The Lowthers and the Economic Development of West Cumberland 1660–1760 (Cambridge University Press, 1981).\n* The Aristocracy in England, 1660–1914 (Blackwell, 1986).\n* The East Midlands from AD 1000 (Longman, 1988).\n* A History of Laxton: England’s Last Open-Field Village (Blackwell, 1989).\n* The Agricultural Revolution (Blackwell, 1990).\n* Rise and Fall of the Grenvilles: Dukes of Buckingham and Chandos, 1710 to 1921 (Manchester University Press, 1994).\n* (Co-editor with Michael Turner and Bethanie Afton) Agricultural Rent in England 1690–1914 (Cambridge University Press, 1997).\n* (Editor) A Centenary History of Nottingham (Manchester University Press, 1997).\n* (Co-editor with Michael Turner and Bethanie Afton) Farm Production in England 1700–1914 (Cambridge University Press, 2001).\n* Byron and Newstead: The Aristocrat and the Abbey (University of Delaware Press, 2001).\n* Nottinghamshire Past: Essays in Honour of Adrian Henstock (Merton Priority Press for Nottinghamshire County Council, 2003).\n* City Status in the British Isles, 1830–2002 (Ashgate, 2005).\n* Writing Local History (Manchester University Press, 2007).\n* ''Nottingham: A History of Britain's Global University'' (Boydell Press, 2016).\nReferences\nExternal links\n*"
    }
  ]
}