{
  "content": [
    {
      "type": "text",
      "text": "# John Warwick Montgomery\n\n| birth_place = Warsaw, New York, U.S.\n| death_date =\n| death_place = Bischwiller, France\n| nationality = American\n| citizenship = American, British, French\n| occupation = Lawyer, academic, theologian\n| spouse = Carol Gracina Woolacott Montgomery\n| education =\n| thesis_title = The Libraries of France at the Ascendancy of Mazarin: Louis Jacob's Traicté des plus belles bibliothèques\n| thesis_url = http://pi.lib.uchicago.edu/1001/cat/bib/4135516\n| known_for = Christian apologetics\n| title =\n| website = http://www.jwm.christendom.co.uk\n| thesis_year = 1962\n| thesis1_title = The Libraries of France at the Ascendancy of Mazarin: Louis Jacob's Traicté des plus belles bibliothèques\n| thesis2_title = Johann Valentin Andreae's Chymical Wedding in the original german text (1616) and in the Historic Foxcroft English translation (1690), with biographical-theological introduction, notes, and bibliography, and preceded by an essay on Lutheran astrology and alchemy in the age of the Reformation\n| thesis1_year = 1962\n| thesis1_url = http://pi.lib.uchicago.edu/1001/cat/bib/4135516\n| thesis2_year = 1964\n| thesis2_url = https://bu.unistra.fr/opac/resource/johann-valentin-andreaes-chymical-wedding-in-the-original-german-text-1616-and-in-the-historic-foxcr/BUS2222472\n}}\nJohn Warwick Montgomery (October 18, 1931 – September 25, 2024) was an American-born lawyer, academic, Lutheran theologian, and author. From 2014 to 2017, he was Distinguished Research Professor of Philosophy at Concordia University, Wisconsin. He was Professor-At-Large, 1517: The Legacy Project. He was named  (2023), after 20 years in French legal practice. He continued to work as a barrister specializing in religious freedom cases in international Human Rights law until his death in 2024.\nMontgomery was a writer, lecturer, and public debater in the field of Christian apologetics.\nFrom 1995 to 2007 he was a Professor in Law and Humanities at the University of Bedfordshire, England; and from 2007 to 2014, the Distinguished Research Professor of Philosophy and Christian Thought at Patrick Henry College in Virginia, United States. He later became Emeritus Professor at the University of Bedfordshire. He was also the director of the International Academy of Apologetics, Evangelism & Human Rights in Strasbourg, France, and was the editor of the theological online journal Global Journal of Classical Theology.\nMontgomery was born in Warsaw, New York, United States. He maintained multiple citizenship in the United States, the United Kingdom, and France.\nFamily\nMontgomery's family derived from County Antrim in Ireland. His parents were Maurice Warwick Montgomery (owner of a retail feed company) and Harriet (Smith) Montgomery. His one sibling, a sister, died in 2008. He had three children (two daughters and a son) with his first wife, whom he divorced in 1985. In 1988, he married Lanalee de Kant, a professional harpist, with whom he had an adopted son and two grandchildren; she died in March 2021. Montgomery subsequently married Carol Gracina Maughan in February 2022.\nEducation\nMontgomery was a scholarly maverick who earned eleven degrees in multiple disciplines: philosophy, librarianship, theology, and law. His degrees included: the A.B. with distinction in Philosophy (Cornell University; Phi Beta Kappa), B.L.S. and M.A. (University of California, Berkeley), B.D. and S.T.M. (Wittenberg University, Springfield, Ohio), LL.B. (La Salle Extension University), M. Phil. in Law (University of Essex, England), Ph.D. (University of Chicago), Th.D. Doctorat d'Universite (University of Strasbourg), LLM and LLD in canon law (Cardiff University). He also was awarded an honorary doctorate in 1999 by the Institute for Religion and Law, Moscow.\nCareer\nMontgomery became a Christian in 1949 as an undergraduate student majoring in the classics and philosophy at Cornell University. Upon graduation Montgomery then began studies in librarianship through the University of California, followed by two degrees in theology and ordination as a Lutheran clergyman. His M.A. thesis in library science was published by the University of California as A Seventeenth Century View of European Libraries. In 1959–60 he served on the faculty of theology as principal librarian in the divinity school's library at the University of Chicago, while simultaneously undertaking doctoral studies in bibliographical history.\nHe then served as chairman of the Department of History at Wilfrid Laurier University in Canada, where he began to develop a reputation as a Christian apologist. Some of his earliest apologetic lectures in defending the historical reliability of the gospel records were presented at the University of British Columbia and the lectures were subsequently published in his book History and Christianity.\nOn receiving a Canada Council Senior Research Fellowship, Montgomery commenced doctoral studies in theology at the University of Strasbourg, France. His doctoral dissertation, which was on the life and career of the Lutheran pastor Johannes Valentinus Andreae and his alleged connections with Rosicrucianism, was subsequently published as Cross and Crucible. Montgomery regards this particular text as his most important piece of scholarship.\nAfter completing his Th.D in 1964, Montgomery assumed a post as professor of church history at Trinity Evangelical Divinity School in Deerfield, Illinois (1964–1974). It was during the 1960s that he emerged as a significant spokesman for Protestant Evangelicals, writing as a regular columnist in the flagship periodical Christianity Today (1965–1983).\nHe injected himself into the theological controversies of his denomination, the Lutheran Church – Missouri Synod, concerning Biblical inerrancy and higher criticism. On the wider church scene he wrote against the Death of God theology, and publicly debated one of its proponents, Thomas J. J. Altizer, at the University of Chicago in 1967. He was also critical of Karl Barth, Paul Tillich, and Rudolf Bultmann. He summed up much of his opposition to Liberal Christianity and radical theologies in works such as Crisis in Lutheran Theology, The Suicide of Christian Theology, and God's Inerrant Word''.\nHis role as an apologist for the Christian faith extended to debates with the American atheist Madalyn Murray O'Hair (1967), situation ethicist Joseph Fletcher (1971), Australian atheist Mark Plummer (1986), humanist George A. Wells (1993), and Jesus Seminar scholar Gerd Ludemann.\nFrom 1965 until his death, Montgomery was an ordained minister in the Lutheran Church – Missouri Synod.\nDuring the 1970s, Montgomery began training in the law with the twin aims of reintegrating Christian foundations into jurisprudence, and to integrate insights from legal theory and doctrines of proof relevant to furthering Christian evidentialist apologetics. To that end Montgomery established, in 1980, the Simon Greenleaf School of Law in California, which is now Trinity Law School, the law school of Trinity International University. Montgomery worked as dean and professor from 1980 to 1989. Montgomery was editor of The Simon Greenleaf Law Review, which was published in seven volumes between 1981 and 1987. Montgomery resigned his post as dean and professor in 1989, under mediated resolution. The same year, Montgomery and Michael Richard Smythe founded the Irvine, California-based Institute for Theology and Law which, in 1995, became the current International Academy of Apologetics and Human Rights in Strasbourg, France. In 1991, Montgomery relocated to London, where he became a Barrister-at-Law, wrote widely on apologetics, defended international cases of religious freedom, and taught at the University of Bedfordshire. In 2009, Montgomery passed the French bar examinations and became an ; he was a member of the Paris law firm of Noual Hadjaje Duval.\nMontgomery's apologetic work generally centered on establishing the divinity of Christ by assessing the historical and legal evidences for the resurrection. Much of this work has influenced popular apologists such as Josh McDowell, Don Stewart, Francis J. Beckwith, Ross Clifford, Terry Miethe, Gary Habermas, Craig Parton, Rod Rosenbladt, Loren Wilkinson, Kerry McRoberts, and Elliot Miller. He was an advocate of evidentialist apologetics, offering a distinctly Christian philosophy of history in his books The Shape of the Past and Where Is History Going?\nMontgomery researched the claims of evidence for Noah's Ark for two years. His quest took him through two thousand years of reports, sightings, and claims, and on two ascents of Mount Ararat: in August 1970 on the South Face and in summer 1971 on the North Face. His effort to collect data and sift fact from fiction yielded his work \"The Quest for Noah's Ark\". In the introduction he writes that he merely presents the facts and allows the readers to come to their own conclusions. He was a contributing scholar on two film documentaries on the topic: ''Noah's Ark and the Genesis Flood (1977) and In Search of Noah's Ark'' (1976).\nMontgomery's interest in the occult also yielded his studies on early Rosicrucianism (Cross and Crucible), demonic phenomena (Demon Possession), and analytic considerations of the occult as a spiritual search for truth (Principalities and Powers). In the 1980s, he spent eight years as a Sunday evening radio broadcaster in California, and from 1988 to 1992, as a television presenter of \"Christianity on Trial\".\nMontgomery's legal career included not only teaching law, but also practicing in California, gaining admission to the English bar as a barrister, obtaining a legal license in France, and earning advanced degrees in ecclesiastical law from Cardiff University, and served as Director of Studies for the International Institute of Human Rights, Strasbourg (1979–1981). He wrote on legal-moral problems such as cryonics, stem-cell research, euthanasia, abortion, and divorce, and also argued for a transcendental perspective in international human rights and jurisprudence. He successfully represented clients in religious liberty cases before the Court of Appeals (1986) in Athens, Greece, and the European Court of Human Rights, Strasbourg (1997 and 2001).\nLiterary output\nMontgomery was author of over 235 works, including over one hundred scholarly journal articles and more than fifty books in eight languages. He regarded his Tractatus Logico-Theologicus as the most comprehensive presentation of his theology and apologetic method. Articles and essays have appeared in periodicals such as Bibliotheca Sacra, Christian Century, Concordia Theological Quarterly, Ecclesiastical Law Journal, Eternity, Fides et Historia, Interpretation, Journal of the American Scientific Affiliation, Journal of the Evangelical Theological Society, Law and Justice, Library Quarterly, Modern Reformation, Muslim World, New Oxford Review, Religion in Life, Religious Education, and Simon Greenleaf Law Review.\nDeath\nMontgomery died in Bischwiller, France on September 25, 2024, at the age of 92.\nBibliography\n* John Warwick Montgomery manuscript collection established at Syracuse University Library, 1970, but this archive has now been transferred to Southeastern Baptist Theological Seminary.\n* John Warwick Montgomery, The Altizer-Montgomery Dialogue (Chicago: InterVarsity Press, 1967).\n* John Warwick Montgomery and Craig A. Parton, The Art of Christian Advocacy, Irvine: 1517 Publishing, 2024.\n* Christ as Centre and Circumference: Essays Theological, Cultural and Polemic (Eugene, Oregon: Wipf & Stock, 2012).\n* Christ Our Advocate: Studies in Polemical Theology, Jurisprudence and Canon Law (Bonn, Germany: Verlag für Kultur und Wissenschaft/Culture and Science Publishers, 2002).\n*(ed.) Christianity for the Tough-Minded (Minneapolis: Bethany Fellowship, 1973).\n* and C. E. B. Cranfield & David Kilgour, Christians in the Public Square: Law, Gospel & Public Policy (Edmonton, Alberta: Canadian Institute for Law, Theology and Public Policy, 1996).\n* Chytraeus on Sacrifice: A Reformation Treatise in Biblical Theology (St. Louis: Concordia Publishing House, 1962).\n* Crisis in Lutheran Theology, 2 Vols., 2nd edition (Minneapolis: Bethany Fellowship, 1973).\n* Cross and Crucible: Johann Valentin Andreae (1586–1654) Phoenix of the Theologians (The Hague: Martinus Nijhoff, 1974).\n* Damned Through the Church (Minneapolis: Bethany Fellowship, 1970).\n*(ed.) Demon Possession (Minneapolis: Bethany Fellowship, 1975).\n* Ecumenicity, Evangelicals and Rome (Grand Rapids: Zondervan, 1969).\n*(ed.) Evidence for Faith: Deciding the God Question (Dallas: Probe Ministries, 1991).\n*Faith Founded On Fact: Essays in Evidential Apologetics (Nashville & New York: Thomas Nelson, 1978).\n* Fighting the Good Fight: A Life in Defense of the Faith (Eugene, Oregon: Wipf & Stock, 2016).\n* Giant in Chains: China Today and Tomorrow (Milton Keynes, UK: Word, 1994).\n* (ed). ''God's Inerrant Word (Minneapolis: Bethany Fellowship, 1974).\n* Heraldic Aspects of the German Reformation (Bonn, Germany: Verlag für Kultur und Wissenschaft/Culture and Science Publishers, 2003).\n* History, Law and Christianity (Edmonton, Alberta: Canadian Institute for Law, Theology and Public Policy, 2003). A revised and expanded version of History and Christianity (Downers Grove, Illinois: InterVarsity Press, 1971).\n* How Do We Know There Is A God? (Minneapolis: Bethany Fellowship, 1973).\n* Human Rights and Human Dignity (Grand Rapids: Zondervan, 1986).\n* In Defense of Martin Luther (Milwaukee: Northwestern Publishing, 1970). LCCN 72123731\n* (ed). International Scholars Directory'' (Chicago: Marquis Who's Who, 1975).\n* ''The 'Is God Dead?' Controversy (Grand Rapids: Zondervan, 1966). OCLC Number / Unique Identifier: 1966802\n* (ed). Jurisprudence: A Book of Readings (Strasbourg: International Scholarly Publishers, 1974).\n* The Law Above the Law (Minneapolis: Bethany Fellowship, Minnesota, 1975).\n* Law and Gospel: A Study in Jurisprudence (Oak Park, Illinois: Christian Legal Society, 1978). OCLC Number / Unique Identifier: 981124337\n* \"The Marxist Approach to Human Rights: Analysis and Critique\" in The Simon Greenleaf Law Review 3 (1983–84).\n* (ed.) Myth, Allegory and Gospel (Minneapolis: Bethany Fellowship, 1974).\n* Principalities and Powers (Minneapolis: Bethany Fellowship, 1973).\n* The Quest for Noah's Ark 2nd edition (Minneapolis: Bethany Fellowship, 1974).\n* The Repression of Evangelism in Greece: European Litigation vis-à-vis a Closed Religious Establishment (Lanham, New York & Oxford: University Press of America, 2001).\n* A Seventeenth-Century View of European Libraries: Lomeier's De bibliothecis, Chapter X (Berkeley & Los Angeles: University of California Press, 1962) OCLC Number / Unique Identifier: 735473.\n* The Shape of the Past (Minneapolis: Bethany Fellowship, 1962; rev. ed. 1975).\n* The Shaping of America (Minneapolis: Bethany Fellowship, 1976).\n* The Slaughter of the Innocents (Westchester, Illinois: Crossway Books, 1981).\n* Situation Ethics: True or False (Minneapolis: Bethany Fellowship, 1972).\n* The Suicide of Christian Theology (Minneapolis: Bethany Fellowship, 1970).\n* The Transcendent Holmes (Ashcroft, British Columbia: Calabash Press, 2000).\n* Tractatus Logico-Theologicus (Bonn, Germany: Verlag für Kultur und Wissenschaft/Culture and Science Publishers, 2003).\n* Where Is History Going? (Grand Rapids: Zondervan, 1969). OCLC Number / Unique Identifier: 22592\nReferences\nSources\n* Kenneth D. Boa and Robert M. Bowman, Jr. Faith Has Its Reasons: An Integrative Approach to Defending Christianity'' (NAV Press, Colorado Springs, Colorado, 2001).\n* \"John Warwick Montgomery's Apologetic\" Special Issue of [http://www.phc.edu/gj_toc_v3n1.php Global Journal of Classical Theology Volume 3, number 1 2002]\n* Ross Clifford, [http://www.worldevangelicals.org/resources/rfiles/res3_224_link_1292691756.pdf ''John Warwick Montgomery's Legal Apologetic: An Apologetic for all Seasons] (Verlag für Kultur und Wissenschaft [Culture and Science Publishers], Bonn, Germany, 2004).\n* William Dembski and Thomas Schirrmacher, eds. Tough-Minded Christianity: Honoring the Legacy of John Warwick Montgomery, Nashville, Tennessee: B & H Publishing Group, 2008.\n* David R. Liefeld, \"Lutheran Orthodoxy and Evangelical Ecumenicity in the Writings of John Warwick Montgomery,\" Westminster Theological Journal 50 (1988) pp.&nbsp;103–126.\n* Liviu, Damian, \"John Warwick Montgomery: şi necesitatea istoriei în susţinerea adevărului teologic; Tratat de epistemologie teologică evidenţialistă\" (thesis defended at the Baptist Theological Faculty, University of Bucharest, Romania, June, 2007).\n* James Lutzweiler, \"The Papers, Pulse, Person, Pictures, and Porpoise of John Warwick Montgomery (Special Collections Interest Group),\" American Theological Library Association 2006 Proceedings'', 68-70.\nExternal links\n* [http://www.jwm.christendom.co.uk/ Montgomery's home web page]"
    }
  ]
}