{
  "content": [
    {
      "type": "text",
      "text": "# John K. Davies (historian)\n\n| birth_place        =\n| death_date         =\n| death_place        =\n| death_cause        =\n| other_names        =\n| occupation         =\n| period             =\n| known_for          =\n| title              =\n| boards             =\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| relatives          =\n| awards             =\n| website            =\n| education          =\n| alma_mater         = University of Oxford\n| thesis_title       =\n| thesis_url         =\n| thesis_year        =\n| school_tradition   =\n| doctoral_advisor   =\n| academic_advisors  =\n| influences         =\n| era                =\n| discipline         = Classics\n| sub_discipline     =\n| workplaces         = University of Liverpool\n| doctoral_students  =\n| notable_students   =\n| main_interests     =\n| notable_works      =\n| notable_ideas      =\n| influenced         =\n| signature          =\n| signature_alt      =\n| signature_size     =\n| footnotes          =\n}}\nJohn Kenyon Davies,  (born 19 September 1937) is a British classical historian and retired academic. Between 1977 and 2003, he was Rathbone Professor of Ancient History and Classical Archaeology at the University of Liverpool.\nCareer\nDavies was born in 1937 and brought up in Cardiff. He was educated at Manchester Grammar School, and then went up to Wadham College, Oxford, graduating in 1959. He matriculated at Merton College, Oxford in 1960 as a Harmsworth Senior Scholar. From 1961 to 1962, he studied in the United States, as a Fellow at the Center for Hellenic Studies in Washington, D.C. He completed his DPhil in 1966. He was the Dyson Junior Research Fellow at Balliol College, Oxford, from 1963 to 1965 and then Lecturer in Ancient History at the University of St Andrews until 1968, when he was elected to a fellowship at Oriel College, Oxford. In 1977, he moved to the University of Liverpool to take up the Rathbone Chair of Ancient History and Classical Archaeology. He retired in 2003, having been Pro-Vice-Chancellor between 1986 and 1990 and a Leverhulme Research Professor from 1995 to 2000. Davies was elected a Fellow of the British Academy in 1985 and a Fellow of the Society of Antiquaries of London in 1986.\nPublications\n* Athenian Propertied Families 600–300 BC (Clarendon Press, 1971).\n* Democracy and Classical Greece (Harvester Press, 1978; 2nd ed. Harvard University Press, 1993).\n* Wealth and the Power of Wealth in Classical Athens (Arno Press, 1981).\n* (Edited with Lin Foxhall) The Trojan War: Its Historicity and Context (Bristol Classical Press, 1984).\n* (Edited with D. M. Lewis, John Boardman and M. Ostwald) The Cambridge Ancient History, vol. 5 (2nd ed., Cambridge University Press, 1992).\n* (Edited with Zofia H. Archibald) Hellenistic Economies (Routledge, 2001).\n* (Edited with Zofia H. Archibald and Vincent Gabrielsen) Making, Moving, and Managing: The New World of Ancient Economies, 323–31 BC (Oxbow, 2005).\n* (Edited with Zofia H. Archibald and Vincent Gabrielsen) The Economies of Hellenistic Societies, Third to First Centuries BC (Oxford University Press, 2011).\n* (Edited with John Wilkes) Epigraphy and the Historical Sciences'' (Oxford University Press for the British Academy, 2012).\nPersonal life\nWhile in Washington, D.C., in 1961, he met the Italian philologist Anna Morpurgo, and married her the following year. The marriage was dissolved in 1978.\nReferences"
    }
  ]
}