{
  "content": [
    {
      "type": "text",
      "text": "# John Wood Warter\n\nJohn Wood Warter (1806–1878) was an English cleric and antiquarian. He is known now as an editor of the works of Robert Southey, his friend.\nLife\nHe was born on 21 January 1806, the eldest son of Henry de Grey Warter (1770–1853) of Cruck Meole, Shropshire, and his wife Emma Sarah Moore (died 1863), daughter of William Wood of Marche Hall and Hanwood, Shropshire; the naturalist John Clavering Wood was his uncle. He was educated at Shrewsbury School, under Samuel Butler. He matriculated at Christ Church, Oxford, on 14 October 1824, and graduated B.A. in 1827, M.A. 1834, B.D. 1841.\nFrom 1830 to 1833 Warter was chaplain to the English embassy at Copenhagen. There in 1832 he encountered Charlotte Ellah (1808–1839), who went on to marry the missionary Edward Stallybrass in 1835. The Rev. Nugent Wade had a greater influence on her.\nWarter became an honorary member of the Scandinavian and Icelandic Literary societies. He travelled in Norway and Sweden, knew scholars including Rasmus Rask, and used the royal library of Denmark, becoming familiar with Nordic and German literature of all sorts. In 1834, just before his marriage, he was appointed by the archbishop of Canterbury to the vicarage of West Tarring and Durrington, Sussex, a peculiar of the archbishopric, with the chapelries of Heene and Patching. He remained the vicar of West Tarring for the rest of his life. For some years to 31 December 1851 he was the rural dean. He was an old-fashioned churchman of the high and dry school, constantly at odds with the ecclesiastical commissioners. A window under the tower of West Tarring church was erected by his wife Edith as a memorial to her father, Robert Southey.\nWorks\nWarter published the parish history Appendicia et Pertinentiæ: Parochial Fragments on the parish of West Tarring and the Chapelries of Heene and Durrington, 1853; and two volumes on The Seaboard and the Down; or my parish in the South. By an Old Vicar, 1860, describing the social life of local inhabitants. He published tracts and sermons. Other  works included:\n*The Acharnians, Knights, Wasps, and Birds of Aristophanes translated, by \"a Graduate of Oxford\", 1830.\n*Teaching of the Prayer-book, 1845.\n*The last of the Old Squires: a Sketch by Cedric Oldacre, 1854, essays, first edition pseudonymous; 2nd ed. 1861, under his real names.\n*An Old Shropshire Oak, edited by Richard Garnett (vols. i. ii. 1886, vols. iii. iv. 1891.) Selections from a manuscript left by Warter, with information on Shropshire and on the general history of England.\nWarter edited volumes vi. and vii. of Southey's long novel The Doctor and an edition in one volume of the whole work (London, 1848); A Love Story: History of the Courtship and Marriage of Dr. Dove, a fragment of it, was published by him in 1853, in the ''Traveller's Library''. He also edited the four series of Southey's Commonplace Book, 1849–51, and four volumes of ''Selections from Southey's Letters, 1856. An adverse review of the Selections, by Whitwell Elwin, was in the Quarterly Review, March 1856, perhaps provoked by his statement that he could draw up \"a most remarkable history\" of the periodical.\nEdith Warter began in 1824 a collection of Wise Saws and Modern Instances: Pithy Sentences in many Languages. It was taken up by her husband in 1850; and was published in 1861. Warter also contributed to the English Review.\nLetters from Southey to Warter, beginning on 18 March 1830, are in the sixth volume of Southey's Life and Correspondence''. A letter by him, written at Southey's house on 17 September 1833, is in the life Samuel Butler. He was then studying the literature of Spain and Italy, and treatises of the old English divines.\nFamily\nWarter visited Robert Southey at Greta Hall, before travelling to Scandinavia, and became engaged to his eldest daughter, Edith May Southey (1804–1871). They were married at Keswick on 15 January 1834. Her brother Cuthbert was sent to study with Warter, to prepare him for entry to Oxford. This did not go well. Firstly, Warter had two other pupils, who were found unattractive. And Cuthbert failed to gain a place at Christ Church, Oxford. He was able to enter Queen's College, but it was dominated by students from the north of England, whom Warter considered \"sadly unpolished\".\nThe physician John Southey Warter (1840–1866) was their second son; he was one of those who attempted to rationalise the taking of a case history. He wrote Observation in Medicine (1865). His elder brother, Henry de Grey Warter (born 1837), was a Royal Artillery officer.\nWarter died on 21 February 1878, and was buried with his wife in West Tarring churchyard.\nNotes\nExternal links\n;Attribution"
    }
  ]
}