{
  "content": [
    {
      "type": "text",
      "text": "# Johnny Woodward\n\nJohn Woodward}}\n| birth_place = Islington, England\n| death_date =\n| death_place = Cricklewood, England\n| position = Central defender\n| years1 = 1939–1949\n| years2 = 1949–1951\n| years3 = 1951\n| years5 = 1953\n| clubs1 = Tottenham Hotspur\n| clubs2 = Queens Park Rangers\n| clubs3 = Tonbridge\n| clubs4 = Snowdown Colliery Welfare\n| clubs5 = Walsall\n| clubs6 = Stourbridge\n| clubs7 = Horsham\n| caps1 = 63\n| goals1 = 1\n| caps2 = 57\n| goals2 = 0\n| caps3 = ?\n| goals3 = ?\n| caps4 = ?\n| goals4 = ?\n| caps5 = 5\n| goals5 = 0\n| caps6 = ?\n| goals6 = ?\n| caps7 = ?\n| goals7 = ?\n| manageryears2 = ?–1971\n| managerclubs1 = Horsham\n| managerclubs2 = Willesden & Kingsbury\n}}\nHorace John Woodward (16 January 1924 – 8 August 2002) was an English professional footballer who played for Tottenham Hotspur, Queens Park Rangers, Tonbridge, Snowdown Colliery Welfare, Walsall, Stourbridge and Horsham.\nPlaying career\nWoodward signed as an amateur for Tottenham Hotspur in 1939. In 1941, he made his senior debut in the London Wartime League. During World War II he served as a gunner in the Merchant Navy. On his return from duty Spurs offered him a professional contract in May 1946. The central defender made his Football League debut against Newport County in September 1946 when he replaced the injured Bill Nicholson – Woodward remains the only Lilywhite to make his League debut at Somerton Park. Woodward played a total of 67 matches in all competitions and scored one goal for the Lilies between 1946 and 1949. Queens Park Rangers paid £10,500 for his services in 1949. He went on to feature in a further 57 fixtures. After leaving Loftus Road he joined Tonbridge in 1951 and went on to have brief spells at Snowdown Colliery Welfare, Stourbridge and Walsall where he participated in five matches in 1953.\nManagement career\nWoodward became player/manager at Horsham before taking charge at Willesden & Kingsbury a post he held to 1971. He later went on to occasionally manager the Maccabi club of London. John also managed Barnet reserves when Barry Fry managed the Barnet first team in the late 1970's\nPost–football career\nHe continued to play football throughout the 1960s and regularly turned out for the Ex–Spurs XI while employed by Schweppes and then the British Oxygen Company. Woodward retired in 1988 before settling in Willesden. After a long illness, he died in a Cricklewood nursing home on 8 August 2002.\nReferences\nExternal links\n*[http://www.saddlers.co.uk/page/SaddlersAZ/0,,10428~1307663,00.html The Saddlers players- Horace Woodward]\n*[http://spurscommunity.co.uk/forums/showthread.php?t=34371&page=12 Photograph of Woodward]\n*\n*[http://archive.mehstg.com/fact_woodward_john.htm Woodward profile]"
    }
  ]
}