{
  "content": [
    {
      "type": "text",
      "text": "# John Warner (footballer, born 1961)\n\n|birth_date     =\n| birth_place    = Paddington, London, England\n| height           =\n| position       = Forward\n| youthyears1    =  |youthclubs1 =\n| years1         =  |clubs1  = Burnham Ramblers                 |caps1  =    |goals1  =\n| years2         = 1989 |clubs2  = Colchester United             |caps2  = 15   |goals2  = 3\n| years3         = 1989 |clubs3  = Heybridge Swifts                 |caps3  =    |goals3  =\n| years4         = 1989–1990 |clubs4  = Colchester United |caps4  = 2   |goals4  = 0\n| years5         =  |clubs5  = Dagenham                                               |caps5  =    |goals5  =\n| years6         = 1992–1993  |clubs6  = Dagenham & Redbridge | caps6 = 2 | goals6 =\n| years7         =  |clubs7  = Collier Row                                                   |caps7  =    |goals7  =\n| years8         =  |clubs8  = Bowers & Pitsea                             |caps8  =    |goals8 =\n| totalcaps = 19 | totalgoals = 3\n| manageryears1  =  |managerclubs1 = Bowers & Pitsea\n}}\nJohn Warner (born 20 November 1961) is an English former football player and manager who played as a forward in the Football League for Colchester United. Warner was player-manager at Bowers & Pitsea.\nCareer\nBorn in Paddington, London, Warner was spotted by Colchester United during a friendly against his then-club Burnham Ramblers. He had been working as a security guard for Ford Dagenham when he was taken on trial at Colchester in February 1989, and found himself on the first-team bench for a trip to Scunthorpe United on 18 February, coming on to score the winning goal and secure the club's first win in 19 games. Warner, scored another goal from the bench in a 3–2 home win against Halifax Town on 1 May, helping the U's to league safety for another season.\nStill on non-contract terms, Colchester wanted to sign Warner permanently and on a full-time basis, but could not offer the security or financially compete with the combination of his salary from Ford and payments from semi-professional football. He returned to non-league football with Heybridge Swifts for the 1989–90 season, but returned to Colchester in December 1989 after Steve Foley, who had taken over as caretaker manager, convinced Warner to return. In this time, he made two further appearances for the U's, playing his final game for the club on 5 January 1990 in a 1–0 defeat at Layer Road to Stockport County.\nWith Mick Mills taking the Colchester manager role, Warner was told that he could leave, as he subsequently joined Dagenham. During the 1992–93 season he made two appearances for Dagenham & Redbridge in the Football Conference. He later played for Collier Row and was player-manager at Bowers & Pitsea. Warner made 17 Football League appearances and scored a total of three goals in the professional leagues.\nReferences"
    }
  ]
}