{
  "content": [
    {
      "type": "text",
      "text": "# John Edwards (Unitarian minister)\n\nJohn Edwards (1768–1808) was an English nonconformist minister and political radical. He is best known as the successor of Joseph Priestley at the New Meeting House, Birmingham.\nEarly life\nEdwards was born in Ipswich on 1 January 1768. He studied for the ministry at the Coward Trust's dissenting academy in Hoxton Square, from 1786, and at Daventry Academy. He went to Gateacre Unitarian chapel in 1787, staying until 1791. He joined the London Corresponding Society at some point during the 1780s.\nBirmingham\nEdwards was appointed as minister to the New Meeting House, Birmingham, in the second half of 1791. From 1792 to 1795 he had as colleague there David Jones. He immediately involved himself in controversial pamphleteering. Some pseudonymous opponents, John Not and Job Nott, used dialect and purported to be artisans. Nott is now thought to have been John Morfitt (died 1809), a local barrister. Edwards suffered, after Priestley, from some mockery for a lack of postnominals.\nAfter the 1791 destruction of the Priestley riots, the New Meeting and the Old Meeting congregations were homeless. Refused accommodation by the Wesleyan Methodists, they were able for three months to use an Independent chapel, in Carr's Lane. Then, obtaining a lease, they met to 1802 in an amphitheatre that became the Livery Street Chapel. William Russell, Priestley's patron and the lay leader of the New Meeting, had been burnt out of his home; he moved to Gloucester, and then in 1793 to the United States, with his brother George left in charge in Birmingham.\nThe reform and Unitarian tradition of Priestley was carried on through institutions such as the Birmingham Book Club, and the Sunday Society (later Brotherly Society) group of teachers. Edward Corn, warden of the New Meeting, was linked to political radicals. In 1792, Edwards was on a distribution list for a work of Tom Paine, A Letter to Mr. Henry Dundas. At this time, however, the West Midlands did not have the reform politics associations that had arisen in other industrial areas of England. Local nonconformist ministers linked to the Society for Constitutional Information played a significant role. The Birmingham Society for Constitutional Information was formed in 1792.\nEdwards brought Coleridge, on an English tour in early 1796, to Birmingham, as a lecturer. Coleridge decided he should tone down the radical edge of what he said, so as not to have an adverse impact on Edwards's reputation. When John Binns and John Gale Jones were arrested that year in Birmingham, Coleridge requested an article from Edwards, and published it in The Watchman.\nColeridge closed down The Watchman in July 1796. William Roscoe then wrote to Edwards, offering help to bring Coleridge to Liverpool, to work as a political journalist. Nothing came of that, since by August Coleridge had another opportunity in Derby, where Peter Crompton wanted him to start a school. Roscoe in a further letter to Edwards concluded that Coleridge would be better suited in Derby than Liverpool, \"this mercantile slave-dealing place.\"\nEdwards resigned as minister of the New Meeting in 1802, and was replaced by John Kentish.\nLater life\nThe remaining positions Edwards held were in London. He died by drowning in 1808, while swimming at Wareham, Dorset. John Kentish preached a funeral sermon for him, at the New Meeting House, Birmingham.\nWorks\n*Letters to the Rev. Mr. Medley, occasioned by his late behaviour while engaged in the performance of divine service (1790). Addressed to Samuel Medley.\n* Letters to the British Nation: And to the Inhabitants of Every Other Country who May Have Heard of the Late Shameful Outrages Committed in this Part of the Kingdom (1791) first part of a series in the aftermath of the Priestley riots of 1791. Subtitled ''Occasioned by the Appearance of a Pamphlet, Intitled \"A Reply to the Rev. Dr. Priestley's Appeal to the Public, on the Subject of the Riots in Birmingham.\" Being the Joint Production of the Principal Clergy of that Place and of Its Vicinity, it replied to a pamphlet published under the name of Edward Burn.\n*A sermon [on Dan. xii. 3] occasioned by the death of Dr. Joseph Priestley (1804)\n*A Sermon Preached to the Society who Support the Sunday Evening Lecture in the Old Jewry, on the Evening of Dec. 5, 1805 (1805). A sermon at the Old Jewry Meeting-house on the sea and empire, preached after the battle of Trafalgar, referencing Horatio Nelson.\nEdwards provided text in English to Views of the Ruins'' (1792). This work was a set of eight engravings by William Ellis, after drawings by Philip Henry Witton, a clerk and draughtsman who went on to be a canal engineer. It followed the trail of destruction wrought in Birmingham by the organised group of rioters in 1791. It was published by Joseph Johnson, and contains also text in French (with a view to readers in revolutionary France). The English account goes into details of the rioting, beginning with the attacks on the New Meeting House, and Joseph Priestley's house at Fair Hill.\nNotes"
    }
  ]
}