{
  "content": [
    {
      "type": "text",
      "text": "# John Warden\n\n|death_date          =\n|image         =\n|birth_place  = Cook County, Illinois, US\n|death_place  = Washington, US\n|placeofburial = Orting Town Cemetery, Orting, Washington\n|placeofburial_label = Place of burial\n|allegiance    = United StatesUnion\n|branch        =United States ArmyUnion Army\n|rank          = First Lieutenant\n|serviceyears  = 1861 - 1865\n|unit          = Company E, 55th Illinois Volunteer Infantry Regiment\n|battles       = American Civil War Siege of Vicksburg\n|awards        = Medal of Honor\n}}\nJohn Warden (June 11, 1841 &ndash; July 2, 1906) was a Union Army soldier during the American Civil War. He received the Medal of Honor for conspicuous gallantry during the May 22, 1863 Siege of Vicksburg.\nWarden joined the 55th Illinois Infantry in September 1861, and was mustered out in August 1865.\nUnion assault\nOn May 22, 1863, General Ulysses S. Grant ordered an assault on the Confederate heights at Vicksburg, Mississippi. The plan called for a storming party of volunteers to build a bridge across a moat and plant scaling ladders against the enemy embankment in advance of the main attack.\nThe volunteers knew the odds were against survival and the mission was called, in nineteenth century vernacular, a \"forlorn hope\". Only single men were accepted as volunteers and even then, twice as many men as needed came forward and were turned away. The assault began in the early morning following a naval bombardment.\nThe Union soldiers came under enemy fire immediately and were pinned down in the ditch they were to cross. Despite repeated attacks by the main Union body, the men of the forlorn hope were unable to retreat until nightfall. Of the 150 men in the storming party, nearly half were killed.  Seventy-nine of the survivors were awarded the Medal of Honor.\nMedal of Honor citation\nFor conspicuous gallantry in action at Vicksburg, Miss., May 22, 1863.\nSee also\n*List of Medal of Honor recipients\n*List of American Civil War Medal of Honor recipients: T–Z\nReferences\nNotes\n*\n*\n*"
    }
  ]
}