{
  "content": [
    {
      "type": "text",
      "text": "# John Howard Harris\n\n| birth_place = Indiana County, Pennsylvania\n| death_date  =\n| death_place = Scranton, Pennsylvania\n| education   = University at Lewisburg\n| profession  =\n| spouse      =\n| children    =\n| signature   = Signature of John Howard Harris (1847–1925).png\n| footnotes   =\n}}\nJohn Howard Harris (April 24, 1847 – April 4, 1925) was president of Bucknell University from 1889 to 1919.\nFormative years\nJohn Howard Harris was born in Indiana County, Pennsylvania, on April 24, 1847.\nHarris began teaching when he was 15 years old; however, he soon left to serve in the American Civil War as a member of Company F of the 2nd Pennsylvania Infantry Regiment. His regiment was sent to guard the B. and O. Railroad in West Virginia, which had been partly destroyed by the Confederates at the time of Lee’s invasion of the North, and was an important artery of traffic. When his term of service ended, he returned to teaching, but because of an urgent appeal for more troops by President Lincoln in August 1864, he returned to the service and became a sergeant in Company H, 206th Pennsylvania Infantry Regiment, which was sent to Richmond, Virginia to hold the Confederates, while Grant worked along the left flank and cut off the city.\nFollowing the war, he obtained a Bachelor of Arts degree from the University at Lewisburg in 1869. While at Bucknell, he was a member of the Theta Alpha honor society and the Sigma Chi fraternity. He received the degree Master of Arts from Bucknell in 1872, and in later years Lafayette College awarded him a Doctor of Philosophy degree. Dickinson and Colgate then each conferred upon him the degree of LL.D., while Bucknell made him a Doctor of Civil Law in 1924.\nAcademic career\nIn 1889, Harris was inaugurated as president of Bucknell University, a post he held for thirty years, the longest tenure in the school's history. His presidency saw a large growth in enrollment and expansion of academic buildings and departments.\nDeath and legacy\nHarris died at his home in Scranton, Pennsylvania, on April 4, 1925.\nHarris Hall, a dormitory on Bucknell's campus, was named in his honor two years after his death.\nReferences\nExternal links\n*[https://books.google.com/books?id=mJdIGwAACAAJ&dq=bucknell+%22John+Howard+Harris+%22&lr=lang_en&num=100 Harris, John Howard, Inaugural address as president of Bucknell University, Lewisburg, Pa: June 27, 1889: with salutary address by C.B. Ripley (1889)]\n*[https://books.google.com/books?id=_kMXAAAAIAAJ&q=bucknell+%22John+Howard+Harris+%22&dq=bucknell+%22John+Howard+Harris+%22&lr=lang_en&num=100 Harris, John Howard, and Harris, Mary Belle, Thirty years as president of Bucknell: with baccalaureate and other addresses,  Press of W. F. Roberts Company (1926)]"
    }
  ]
}