{
  "content": [
    {
      "type": "text",
      "text": "# John D'Alton (historian)\n\n'''John D'Alton''' (1792–1867) was an Irish lawyer, historian, biographer and genealogist.\nLife\nD'Alton was born at his father's ancestral mansion, Bessville, County Westmeath, on 20 June 1792; his mother was Elizabeth Leyne. He was sent to the school of the Rev. Joseph Hutton, Summer Hill, Dublin, and passed the entrance examination of Trinity College Dublin, in his fourteenth year, 1806. He became a student in 1808, joined the College Historical Society, and gained the prize for poetry. Having graduated, he was in 1811 admitted a law student of the Middle Temple, London, and the King's Inns. He was called to the Irish Bar in 1813.\nD'Alton mainly confined himself to chamber practice, and attended the Connaught circuit, having married a lady of that province, Miss Phillips. He received many fees in the important Irish family causes of Malone v. O'Connor, Leamy v. Smith, Jago v. Hungerford, and others. With the exception of an appointment as commissioner of the Loan Fund Board, he held no official position, but a civil list pension of £50, granted while Lord John Russell was prime minister, was some recognition.\nIn his last years, D'Alton's health confined him to his house, but he received guests and worked on an autobiography. He died 20 January 1867.\nWorks\nD'Alton's first publication was a metrical poem, Dermid, or the Days of Brian Boru, in twelve cantos. In 1827 the Royal Irish Academy offered a prize of £80 and the Cunningham gold medal for an essay on the Irish people to the twelfth century; D'Alton obtained the top prize and medal, and his essay, which was read 24 November 1828, occupied the first part of vol. xvi. of the Transactions of the Royal Irish Academy. In 1831 he also gained the prize offered by the Royal Irish Academy for an account of the reign of Henry II of England in Ireland.\nFor illustrations of Irish topography contributed to the Irish Penny Journal, started in January 1833, D'Alton collected information on druidical stones, the raths and fortresses of the early colonists, especially of the Anglo-Normans, the castles of the Plantagenets, Elizabethan mansions, Cromwellian keeps, and the ruins of abbeys. Drawings were supplied by Samuel Lover. In 1838 D'Alton published Memoirs of the Archbishops of Dublin, and in the same year History of the County of Dublin. His next work was an illustrated book The History of Drogheda and its Environs, containing a memoir of the Dublin and Drogheda Railway. There followed the Annals of Boyle, to which Robert King, 1st Viscount Lorton, the proprietor, contributed £300 towards the publication.\nD'Alton published in 1855 ''King James II's Irish Army List, 1689, which contained the names of most of the prominent Irish families, with historical and genealogical illustrations, and subsequently enlarged in separate volumes, for cavalry and infantry. They bring the history of most families to the date of publication. Another work was legal, a treatise on the Law of Tithes''. At the end of his life, in 1864, D'Alton was asked to write a History of Dundalk that was completed by James Roderick O'Flanagan.\nNotes\nExternal links\nAttribution\n* [https://www.lib.uchicago.edu/e/scrc/findingaids/view.php?eadid=ICU.SPCL.DALTONJ Guide to the John D'Alton Collection ca. 17th-19th centuries ] at the [https://www.lib.uchicago.edu/scrc/ University of Chicago Special Collections Research Center]"
    }
  ]
}