{
  "content": [
    {
      "type": "text",
      "text": "# John Clapham (historian and poet)\n\nJohn Clapham (1566–1619) was an English historian and poet.\nLife\nJohn Clapham was born in London and began his professional life as clerk to the lord treasurer, William Cecil, Lord Burghley from around 1590. During this period he performed various roles, acting as burgess for Sudbury, dealing with the repair of English coastal defences, tending to wardship affairs, and becoming closely acquainted with the state of Burghley's health. He was present at Burghley's deathbed in 1598.\nIn 1602 he was admitted to Gray's Inn, serving as one of the Six Clerks in Chancery until 1618.\nIn 1608 Clapham built Christ's Hospital in his father's home parish of Firby (Bedale), which he continued to support until his death in 1619. He was survived by his wife, Ann, daughter of Edmund Kidderminster, and one son. He is believed to be buried at St. Dunstan-in-the-West on Fleet Street.\nWorks\nClapham was the author of Narcissus (1591), a poem written in Latin hexameters treating the youth as a warning against the dangers of philautia (self-admiration). It is based on Ovid's account of Echo and Narcissus in the Metamorphoses (III.339–510) and contains echoes of Virgil, especially Book VI of the Aeneid. According to Katherine Duncan-Jones' summary, \"it locates the Narcissus myth in England, the 'Fortunate Island', presided over by a Virgin Queen. In a palace in a wood Love proffers Ovidian advice to Narcissus about how to win over the woman he loves, however moody she may be. But Narcissus is carried off on a galloping horse called 'blind Lust', falls in love with the nymph Echo, and after a frustrating dialogue with her is soon drowned in the river of Self-Love and metamorphosed into the yellow flower that still bears his name.\" Most academic interest in the work derives from its being the first poem dedicated to Burghley's ward, the 17-year-old Earl of Southampton, the next being Shakespeare's erotic narrative Venus and Adonis (1593), The Rape of Lucrece (1594) and, according to some, Shakespeare's Sonnets, which also address the \"Sin of self-love\". Although it is thought likely that Burghley prompted Clapham to write Narcissus for Southampton because of his reluctance to marry, commentators are not agreed about whether the poem itself argues in favour of marriage; likewise, some read the presentation of Narcissus (like Shakespeare's Adonis) as a \"compliment\" to its dedicatee, others as a \"rebuke\" and a \"taunt\".\nClapham also wrote verses upon the death of Thomas Bodley in 1613, and other original works and translations.\nHistorie of Great Britannie, his most substantial history, was published initially in 1602, covering the period of the Roman occupation of Britain from the invasion of Julius Caesar in 55 BC. In 1606 he published a longer edition, ending his account in the ninth century with the Anglo-Saxon King Egbert.\nClapham began writing his other history in 1603. Certain Observations Concerning the Life and Reign of Queen Elizabeth contains a substantial biography of Burghley, among other eminent figures, based partly on his own recollections and information provided by Robert Cecil, Burghley's younger son.\nNotes\nSources\n*D. R. Woolf, [https://dx.doi.org/10.1093/ref:odnb/47285 \"Clapham, John (1566–1619)\"] in [http://www.oxforddnb.com/ The Oxford Dictionary of National Biography]. Retrieved 2015-03-12.\n*A.G.R.S., [http://www.historyofparliamentonline.org/volume/1558-1603/member/clapham-john-1566-1618 \"CLAPHAM, John (1566–1618), of London\"] in The History of Parliament: the House of Commons 1558–1603, ed. P.W. Hasler (1981). Retrieved 2015-03-12.\nExternal links\n* Latin text of [http://quod.lib.umich.edu/e/eebo/A18930.0001.001/1:3?rgn=div1;view=fulltext  Narcissus] (1591)."
    }
  ]
}