{
  "content": [
    {
      "type": "text",
      "text": "# John C. Calhoun Monument\n\n| module =\n| website =\n| image_upright =\n| image = Charleston marion square3.jpg\n| medium =\n| movement =\n| italic title =\n}}\nThe John C. Calhoun Monument was a monumental statue in Charleston, South Carolina, United States. The monument was 115 feet tall, and stood at the center of Marion Square in Downtown Charleston. It depicted John C. Calhoun, a prominent American statesman and politician from Abbeville, South Carolina who served as Vice President of the United States  from 1825 to 1832 and who was an adamant supporter of American slavery.\nThe monument had long been surrounded by controversy, and was ultimately removed in June 2020.\nHistory\nSoon after John C. Calhoun's death in 1850, the Ladies' Calhoun Monument Association (LCMA) was formed \"to aid in the erection, in or near the City of Charleston, of a monument sacred to the memory of John C. Calhoun.\" However, the campaign initially struggled with fundraising, facing issues including embezzlement and lack of preparedness. The association held several donor meetings and depended heavily on wealthy Charlestonian philanthropists to reach the appropriate amount.\nThe monument was finally built 27 years later, in April 1887. Parades and celebrations were hosted across the city, and the LCMA helped unveil the statue to those in attendance. The LCMA described the unveiling ceremony's attendance as \"crowded to [Marion Square's] boarders with such an assemblage as is rarely seen anywhere.\"  Soon after the unveiling, prayers and joys were shouted for protection over the newly erected monument.\nMany historians have argued that the purpose of the statue was to venerate slavery and the Antebellum South, and to intimidate and marginalize black Charlestonians. According to Mamie Garvin Fields, born in 1888, she later stated, \"I believe white people were talking to us about Jim Crow through that statue.\" Several other black Charlestonians felt that the statue was a threatening message to them: that even though Calhoun was dead, his spirit still lingered in the streets Charleston, South Carolina. Freedmen and women of Charleston began to damage the statue in protest; soon the statue barely resembled Calhoun.\nThis led the LCMA to pursue the installation of a new, taller version of the monument to protect it from further vandalism. The new version of the statue was dedicated by the LCMA on June 27, 1896 with little fanfare. According the LCMA, the statue cost nearly $20,000 (roughly $500,000 in 2020 dollars). The individual who completed the 1896 monument was an Irish-born contractor, Daniel A. J. Sullivan, who is listed as a carpenter by trade and eventually became a prominent builder in Charleston after the American Civil War. Sullivan was noticeably active in the local Democratic Party and later served in the state legislature.\nControversy and Removal\nOver time, the statue became controversial due to Calhoun's staunchly pro-slavery views, especially in the aftermath of the shooting at the nearby Emanuel African Methodist Episcopal Church in 2015.\nIn 2017, a committee was formed to consider how citizens could interpret the statue. The committee was tasked to create a plaque putting the state in greater historical context. The verbiage of the plaque was never agreed upon, and the committee was disbanded.\nIn the wake of the murder of George Floyd in 2020, there were calls across the United States to remove monuments and statues connected with the lost cause myth or individuals who supported slavery. Many such statues were defaced or protested, including the Calhoun monument. On June 23, 2020, the statue was taken down after a unanimous vote by the Charleston City Council. The current location of the John C. Calhoun bust is undisclosed. Some groups have called for the statue to be placed inside a museum. However, the Charleston Museum declined the city's request. As of October 2020, the statue has still not been claimed by any museum or historical society.\nSee also\n* List of monuments and memorials removed during the George Floyd protests\nReferences"
    }
  ]
}