{
  "content": [
    {
      "type": "text",
      "text": "# John Warner (college president)\n\n| birth_place        = Goshen, Indiana, United States\n| death_date         =\n| death_place        = Upper St. Clair Township, Pennsylvania, United States\n| death_cause        =\n| nationality        =\n| citizenship        =\n| other_names        =\n| occupation         = Chemist, educator, and university administrator\n| period             =\n| known_for          = World War II-era plutonium research leadership, Manhattan Project\n| title              = President, Carnegie Mellon University\n| boards             =\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| relatives          =\n| awards             =\n| website            =\n| education          =\n| alma_mater         = Indiana University Bloomington\n| thesis_title       =\n| thesis_url         =\n| thesis_year        =\n| school_tradition   =\n| doctoral_advisor   =\n| academic_advisors  =\n| influences         =\n| era                =\n| discipline         =\n| sub_discipline     =\n| workplaces         =\n| doctoral_students  =\n| notable_students   =\n| main_interests     =\n| notable_works      =\n| notable_ideas      =\n| influenced         =\n| signature          =\n| signature_alt      =\n| signature_size     =\n| footnotes          =\n}}\nJohn Christian Warner (May 28, 1897 – April 12, 1989), known best as Jake Warner, was an American chemist who served as the fourth President of Carnegie Mellon University in Pittsburgh, Pennsylvania, United States.\nEarly life\nBorn in Goshen, Indiana to a farming family on May 28, 1897, John C. Warner was a son of a German immigrant. Just eight years old when his father died, he went on to complete his education, earning his Bachelor of Arts degree in 1919, his Master of Arts in 1920, and his Doctor of Philosophy degree in 1923. Having completed each of his three degrees at the Indiana University Bloomington, he then worked as a research chemist for three Indiana companies. In 1926, he took a teaching position at the Carnegie Institute of Technology (known today as Carnegie Mellon).\nCarnegie Tech years\nWarner became department chair in 1938 and dean of graduate studies in 1945. In 1950, he became the university's fourth president. During his tenure, the graduate business school, named the Graduate School of Industrial Administration, was established in 1949. The first computer on campus—an IBM 650 digital type machine—was housed there in 1956. Also Hunt Library, including the Hunt Institute for Botanical Documentation, opened and the Scaife Hall of Engineering was completed. Warner acquired funding to support the development of Tech's Computation Center, the beginnings of Carnegie Mellon's leadership in the field of computer science.\nThroughout his administrative career he remained active in his academic field. He authored more than eighty published works on scientific subjects as well as on secondary and higher education. During World War II, he headed government research on plutonium for the Manhattan Project.\nDeath and legacy\nWarner died at the age of ninety-one at the Friendship Village retirement home in Upper St. Clair Township, Pennsylvania on April 12, 1989. A memorial service was held in his honor at the Skibo ballroom at Carnegie Mellon on June 2, 1989. Warner Hall, the main administrative building at Carnegie Mellon, was named after John Warner.\nReferences"
    }
  ]
}