{
  "content": [
    {
      "type": "text",
      "text": "# John Harris (Warden)\n\nJohn Harris (Harrys) ( 1588–1658) was an English academic and clergyman. He was Regius Professor of Greek at Oxford, long-time Warden of Winchester College, and a member of the Westminster Assembly.\nLife\nHe was born at Hardwicke, Buckinghamshire, about 1588, the son of Richard Harris, rector of Hardwicke. After being educated at Winchester College, where he entered as a scholar in 1599, he was Fellow (1606–1622) of New College, Oxford, and proceeded M.A. on 23 January 1611. He gained a high reputation as a Greek scholar and preacher, particularly with Henry Savile who compared him only with John Chrysostom.\nIn 1617 he was elected one of the university proctors and in 1619, being then B.D., was appointed regius professor of Greek. He resigned his professorship in June 1622, receiving various prebends. In May 1628, being then D.D., he obtained the rectory of Meon-Stoke, Hampshire. In September 1630 he was elected Warden of Winchester College, where he built Sickhouse, founded in 1640 on the site of the old Carmelite friary, built by 1656.\nDuring the First English Civil War he sided with the presbyterians, and was chosen one of the assembly of divines. He took the covenant and other oaths, and so kept his wardenship; it helped that he was on good terms with Nathaniel Fiennes. Winchester had a parliamentary visitation in 1649, a powerful group headed by three regicides in Henry Mildmay, John Lisle, and Nicholas Love, with the lawyer Robert Reynolds; but Harris gave an adequate account of the College and its functions, and no changes of personnel or statutes ensued. He died at Winchester on 11 August 1658, aged 70, and was buried in the college chapel.\nWorks\nHe wrote a biography of Arthur Lake,  prefixed to Lake's Sermons (1639). Letters to William Twisse, with Twisse's answers, were published by Henry Jeanes (1653).\nNotes\nReferences\n*Thomas Frederick Kirby (1892), Annals of Winchester College: from its foundation in the year 1382 to the present time\n*"
    }
  ]
}