{
  "content": [
    {
      "type": "text",
      "text": "# John West, 1st Earl De La Warr\n\n|predecessor4 = Field Marshal Sir John Ligonier\n|successor4 = Lt. Gen. Sir Richard Lyttelton\n|birth_name = The Honourable John West\n|birth_date =\n|birth_place = England\n|death_date =\n|death_place =\n|restingplace =\n|party =\n|spouse = Lady Charlotte MacCarthy Anne Walker\n|children = 4\n|parents = John West, 6th Baron De La Warr Margaret Freeman\n|residence =\n|alma mater =\n|profession = Military officer, governor\n|religion =\n}}\nLieutenant-General John West, 1st Earl De La Warr  (4 April 169316 March 1766), styled The Honourable John West until 1723 and known as The Lord De La Warr between 1723 and 1761, was a British Army officer, courtier and politician who sat in the House of Commons of Great Britain from 1715 to 1722.\nBackground\nWest was the son of John West, 6th Baron De La Warr, by Margaret, daughter and heiress of John Freeman, a London merchant.\nMilitary and political career\nAfter travelling in Europe West was appointed Clerk-Extraordinary of the Privy Council in 1712. In 1715 he was returned to parliament as one of two representatives for Grampound, a seat he held until 1722. In 1715 he also became a guidon and 1st major of the 1st Troop of Horse Guards and was promoted to lieutenant-colonel in 1717. In 1723 he succeeded his father in the barony of De La Warr and entered the House of Lords. He was appointed a Lord of the Bedchamber to George I and made a Knight of the Order of the Bath in 1725. In 1728 he was admitted a Fellow of the Royal Society. He was ejected from the society in June 1757 for non-payment of arrears.\nIn 1731 Lord De La Warr was sworn of the Privy Council and appointed Treasurer of the Household, a position he held until 1737. In 1732 he was appointed speaker of the House of Lords in the absence of Lord King, the Lord Chancellor. He was a supporter of tough sanctions against the city of Edinburgh after the Porteous Riots of 1736. The latter year he was sent on a special mission to Germany to escort Princess Augusta of Saxe-Gotha to Britain, where she was to become the wife of Frederick, Prince of Wales. Lord Hervey, who described De La Warr as a \"long, lank, awkward person\", thought that \"no fitter selection could have been made to disarm the jealousy of the prince, and that a more unpolished ambassador for such an occasion could not have been found in any of the Goth or Vandal courts of Germany.\" De La Warr and the future Princess of Wales landed at Greenwich in April 1736.\nIn 1737 De La Warr was appointed Governor of New York and New Jersey. However, he never travelled to America. He continued his military career while being active in the House of Lords and fought at the Battle of Dettingen in 1743 during the War of the Austrian Succession. On 30 August 1737, he was commissioned colonel of the 1st Troop of Horse Guards, an appointment he held until his death. He became a Brigadier-General in 1743, a Major-General in 1745, a Lieutenant-General in 1747 and a General of the Horse in 1765. In 1752 he was appointed Governor of Guernsey, a post he held until his death. In 1761 George III created him Viscount Cantalupe and Earl De La Warr.\nFamily\nLord De La Warr was twice married. He married firstly Lady Charlotte, daughter of Donough MacCarthy, 4th Earl of Clancarty and Lady Elizabeth Spencer, on 25 May 1721. They had two sons and two daughters, including Lady Diana, wife of Sir John Clavering. After his first wife's death in February 1735 he married secondly Anne, daughter of Nehemiah Walker and widow of George Nevill, 13th Baron Bergavenny, in 1742. There were no children from this marriage. Anne died in June 1748. Lord De La Warr remained a widower until his death in March 1766, aged 72. He was succeeded by his eldest son, John, Viscount Cantelupe.\nReferences\nExternal links"
    }
  ]
}