{
  "content": [
    {
      "type": "text",
      "text": "# Joint locking (medicine)\n\nIn medicine, joint locking is a symptom of pathology in a joint. It is a complaint by a person when they are unable to fully flex or fully extend a joint.\nThis term is also used to describe the normal mechanism of lower limb joints held in full extension without much muscular effort when a person is standing.\n__TOC__\nClinical symptom\nComplaints of locking sensation in the knee joint can be divided into true locking and pseudo locking.\n* True locking happens when the intra-articular structure (e.g. ligaments) is damaged, a loose body is present inside the joint, or there is a meniscal tear. The knee can be unlocked by rotating the leg and full movement can be restored. A person may feel the presence of a loose body in the suprapatellar region or lateral and medial gutter. Once the loose body is felt, it may slide and move to another area. Thus, it is also called a \"joint mouse\".\n* Pseudolocking usually happens when a person feels pain when trying to flex or extend a knee joint while there are no structural causes of the locking. The locking is usually relieved after a massage or taking painkillers.\nJoint locking is a common symptom of:\n*Osteoarthritis\n*Osteochondritis dissecans\n*Synovial osteochondromatosis\n*Tear of meniscus of the knee\n*Anterior cruciate ligament injury of the knee\nLocking mechanism\nNormal locking of the knee happens during the last stages of extension when a person is standing up. Medial rotation of femur occurs as the space available at the lateral condyle of the tibia is being used up by the lateral condyle of the femur during extension. Therefore, lateral femoral condyle acts as an axis for medial femoral condyle to rotate backwards. This movement is aided by the oblique pull of the ligaments of the knee joint and contraction of the quadriceps muscles. The ligaments are pulled taut when the knee joint is locked in place during standing. When the knee is flexed, it is unlocked by the popliteus muscle through the lateral rotation of femur.\nThe locking mechanisms of hip joint and midtarsal joint are also being investigated in cadavers.\nReferences"
    }
  ]
}