{
  "content": [
    {
      "type": "text",
      "text": "# Joint Meritorious Unit Award\n\n|type=Ribbon\n|eligibility=Military units\n|awarded_for=Awarded to joint units or units tasked to perform a joint mission.\n|status=Currently awarded\n|established=\n|firstawarded= (retroactive to January 1979)\n|lastawarded=Ongoing\n|total_awarded=\n|total_awarded_posthumously=\n|total_recipients=\n|higher=Presidential Unit Citation\n|lower=Army: Valorous Unit Award Naval Service: Navy Unit Commendation  Air and Space Forces: Gallant Unit Citation  Coast Guard: Department of Transportation Outstanding Unit Award\n|image2=Streamer\n|caption2=award streamer\n}}\nThe Joint Meritorious Unit Award (JMUA) is a US military award that was established on June 4, 1981, by Secretary of Defense Caspar Weinberger and was implemented by Department of Defense Directive 1348.27 dated July 22, 1982. The Joint Meritorious Unit Award was made retroactive to January 23, 1979.\nHistory\nAuthorized by the Secretary of Defense on June 10, 1981, this award was originally called the Department of Defense Meritorious Unit Award. It is awarded in the name of the Secretary of Defense to joint activities for meritorious achievement or service, superior to that which is normally expected, for actions in the following situations; combat with an armed enemy of the United States, a declared national emergency, or under extraordinary circumstances that involve national interests.\nThe first organization to receive the Joint Meritorious Unit Award was the \"Electronic Warfare During Close Air Support Joint Test Force\" which was awarded the decoration on September 30, 1982. The JMUA was also awarded to U.S. Marines and the U.S. Navy who served in Somalia in the early 1990s.\nIt was awarded for Operation Praying Mantis in 1988.  Returning Navy units were to receive a Presidential Unit Citation, but it was downgraded after Iran Air Flight 655 was shot down by .\nOn September 22, 2005, Secretary of Defense Donald Rumsfeld awarded the Joint Meritorious Unit Award to the Department of Army's Project and Contracting Office (PCO) for \"exceptionally meritorious achievements from 1 January 2004 to 30 June 2005\" that occurred during Operation Iraqi Freedom.[https://www.instagram.com/p/DKlLMNIsdBA/]\nThe Joint Meritorious Unit Award is a ribbon, enclosed in a gold frame. Navy, Marine Corps, Air Force, Space Force, and Coast Guard recipients wear a different, smaller frame than do U.S. Army, as the latters' unit awards are displayed at a different location on the uniform. The ribbon is very similar to the Defense Superior Service Medal, indicative of it signifying that the unit must have performed service of a character comparable to it, which, if performed by an individual, would warrant the award of the medal.\nSubsequent decorations of the Joint Meritorious Unit Award are annotated with oak leaf clusters.\nReferences\nExternal links\n*"
    }
  ]
}