{
  "content": [
    {
      "type": "text",
      "text": "# Joint Special Operations Command Task Force in the Iraq War\n\n/JSOC conducting operations in Iraq, April 2007.]]\nThe Joint Special Operations Command Task Force in the Iraq War was a joint U.S. and British special operations temporary grouping assembled from different units. It has been described as a \"hunter-killer team\" with its core made up of the United States Army's 1st Special Forces Operational Detachment-Delta (Delta Force or Delta) and the 75th Ranger Regiment, as well as the United States Naval Special Warfare Development Group (DEVGRU or SEAL Team Six) and members of the United States Air Force's 24th Special Tactics Squadron (24 STS), all under Joint Special Operations Command (JSOC) and elements from the United Kingdom Special Forces, including the Special Air Service (22 SAS or SAS), Special Boat Service (SBS), Special Reconnaissance Regiment (SRR), 18 (UKSF) Signal Regiment (18 SR), and the Special Forces Support Group (SFSG). The task force was reported to be responsible for the cross border raid into Syria from Iraq in October 2008 that resulted in eight deaths including Abu Ghadiya, along with several US operations in the Horn of Africa targeting al-Qaeda.\nSuccessive Task Force designations\nSince the invasion of Iraq, the unit went through a number of changes of designation. Task Force 20 was amalgamated with Task Force 5 (formerly Task Force 11/Task Force Sword) in Afghanistan in July 2003, and became Task Force 21. It was then redesignated Task Force 121, and later as Task Force 6–26, Task Force 145, and Task Force 88. Neville notes that he omitted the \"current\" (c. 2008, time of writing) designation of the unit. However, he did say that it was also known obliquely as Other Coalition Forces – Iraq (OCF-I), \"a wry reference to the CIA unit of the moniker OGA\". By the time General Stanley McChrystal took command, the force was known as Task Force 714.\nPost-invasion organization\n* Task Force 77 (formerly Task Force 145) – LSA Anaconda, Balad\n** TF Black/Knight – Elements, UK's SAS, SBS, SRR, 18 SR and the SFSG until 2006 – Based in headquarters known as MSS Fernandez a.k.a. 'the Station', in Baghdad\n** TF North/Red rotating battalion, 75th Ranger Regiment and a small element of Delta Force operators – Tikrit\n** TF West/Blue rotating squadron, DEVGRU, supported by units from the 75th Rangers – Al Asad Airbase(company sized sub-unit)\n** TF Center/Green rotating squadron, Delta Force, supported by an element of the 75th Rangers – LSA Anaconda and MSS Fernandez\n** TF Orange – detachments of various intelligence agencies including the U.S. Intelligence Support Activity (ISA)\nOrganization as of October 2006\nTF 145, or TF 88 as it became known, was commanded by a colonel (the commanding officer of Delta Force) and was based at five locations across Iraq. Its drew on every unit of JSOC as well as on the Central Intelligence Agency's Special Activities Division Special Operations Group (SAD/SOG) and British special forces.\nThe headquarters element, which included the majority of the task force's many aviation and intelligence assets, was based at Balad Air Base between Samarra and Baghdad; the four elements that it controlled, each commanded by a lieutenant colonel or equivalent, were spread across the country.\nTask Force Center is said to be co-located with TF 145's headquarters element at Balad, but it could also be based at Camp Liberty, since it is responsible for the Baghdad region. TF Center is based around a direct-action squadron; the three Delta Force squadrons and SEAL Team Six appeared to rotate through this position. It is also supported by a rotating company-sized element of the 75th Ranger Regiment and elements of the 160th Special Operations Aviation Regiment (160 SOAR).\nTask Force West is structured similarly to TF Center in that it has a company-sized force protection element from the 75th Rangers and is based around a battalion-sized direct action unit that could have been at any given time a Delta Force squadron or SEAL Team Six. It seems that these units rotated every three to four months. It is likely that TF West is based either at Camp Asad or Camp Taqaddum.\nTask Force North is organized differently: it is based around a full battalion of the 75th Rangers (the position rotates among the three battalions), with a company-sized element from Delta Force acting in support. TF North was based at FOB Marez in Mosul.\nHistory as Task Force 20\nInvasion of Iraq\nIn preparation for the 2003 invasion of Iraq, Task Force 20 was formed based on Task Force 11/Sword during the 2001 invasion of Afghanistan and were assigned to western Iraq, the Task Force (TF) was led by Major General Dell L. Dailey. TF 20 was composed of mainly Special forces units from JSOC: B squadron, Delta Force and all three battalions of the 75th Ranger Regiment; a battalion strength element of the 82nd Airborne Division, serving as a Quick reaction force and reinforcements; and a M142 HIMARS. Later in the invasion M1A1 Abrams tanks from C Company, 2nd Battalion 70th Armor were attached to TF 20.\nTF 20 was based at Ar'Ar Air Base in Saudi Arabia. The commander of the Delta Force squadron Lieutenant Colonel Pete Blaber wanted to deploy his operators out into western Iraq and conduct strikes against enemy concentrations, tying up enemy forces that could otherwise be sent to reinforce against the Army and Marine advance from the south, such operation would also effectively deceive the Iraqis as to the true intentions of the coalition forces and precisely where the main effort would be concentrated. However, Daily wanted the Delta squadron to stay at Ar'Ar Air Base and only launch against suspected Weapon of mass destruction sites and/or High-value targets. The disagreement was decided by General Tommy Franks who went with Blaber's plan. TF 20 was tasked with seizing airfields deep in Iraq and capturing HVTs along with providing long-range Special Reconnaissance. One of its primary pre-invasion targets was the planned seizure of Saddam International Airport in Baghdad, two full-scale rehearsals were carried out but the operation was never carried out and the airport was eventually captured by conventional units.\nIn the evening of 19 March 2003, Task Force 20, led by B squadron, Delta Force (accompanied by several Air Force Special Tactics teams, a Delta intelligence and targeting cell, several military working dog teams and two Iraqi—American interpreters), was the first US SOF unit to enter western Iraq as part of the initial infiltration before the main invasion. They later assisted coalition SOF in the capture H-3 Air Base, Rangers were later flown in to garrison the base; unofficially, Task Force 20 had been in Iraq, along with British SOF Task Force 7 and 14, and the Australian SOF Task Force 64. Delta Force then proceeded to the Haditha Dam complex; it also conducted numerous deception operations to confuse the Iraqis as to the disposition of Coalition forces in the west.\nOn 24 March 2003, Delta Force recce operators drove through Iraqi lines around the Haditha Dam, marking targets for Coalition airstrikes, the subsequent bombings resulted in the destruction of a large number of Iraqi armoured vehicles and antiaircraft systems. Also that day, 3rd Battalion 75th Ranger Regiment conducted a combat drop onto H-1 Air Base, securing the site as a staging area for operations in western Iraq. Delta's reconnaissance of the dam indicated that a much larger force was needed to capture it, so C squadron Delta squadron was dispatched from Fort Bragg, with a further Ranger battalion, along with M1A1 Abrams tanks from C Company, 2nd Battalion 70th Armor (known as 'Team Tank'). C-17s flew the company from Tallil to H-1 Air Base and then to MSS (Mission Support Site) Grizzly—a desert strip established by Delta Force which was located between Haditha and Tikrit; C Squadron, Delta Force was flown directly to MSS Grizzly.\nOn 26 March 2003, the DEVGRU component in TF 20 supported by B company 2nd Battalion 75th Ranger Regiment conducted the raid Objective Beaver—a suspected chemical and biological weapons site at the al Qadisiyah reservoir, north of Haditha, they engaged numerous gunmen but there was no chemical or biological weapons at the site.\nOn 1 April 2003, DEVGRU along with Para Rescue Jumpers and Combat Controllers from the 24th Special Tactics Squadron and Rangers from 1st and 2nd Battalions, 75th Ranger Regiment and other forces took part in the rescue of PFC Jessica Lynch. Also that day C Squadron, Delta Force and 3rd Battalion, 75th Ranger Regiment captured the Haditha Dam and held it for a further 5 days.\nDelta units headed north from Haditha to conduct ambushes along the highway above Tikrit, tying up Iraqi forces in the region and attempting to capture fleeing high-value targets trying to escape to Syria. Team Tank reportedly convinced Iraqi senior officers that the coalition main effort might be coming from the west. On 2 April 2003, they were engaged by half a dozen armed technicals from the same anti-special forces Fedayeen that had previously fought Task Force 7. Two Delta operators were wounded and the squadron requested aero medical evacuation and close-air support as a company of truck-borne Iraqi reinforcements arrived to bolster the Fedayeen assault. Two MH-60K Blackhawks carrying a para jumper medical team and two MH-60L Black Hawk Direct Action Penetrator (DAP) attack helicopters of the 160 SOAR responded and engaged the Iraqis, which allowed the Delta operators to move their casualties to an emergency HLZ, after which they were medevaced to H-1 Air Base, escorted by a pair of A-10As. However, Master sergeant George Fernandez died of his wounds. The DAPs stayed on station and continued to engage the Iraqis, destroying a truck carrying a mortar and several infantry squads, whilst Delta snipers killed Iraqi infantryman firing on the DAPs. A pair of A-10As arrived and dropped 500&nbsp;lb airburst bombs within 20m of Delta positions and killed a large number of Iraqi infantry who had been gathering in a wadi. The DAPs spotted several Iraqi units and engaged them until they were dangerously low on fuel.\nOn 9 April 2003, the combined team seized an airfield near Tikrit during a night attack, one tank drove into a 40&nbsp;ft deep hole and flipped, injuring one of the crew and disabling the tank, which was later destroyed by another tank to deny it to the enemy. By mid-April, Delta had advanced into Baghdad and 'Team Tank' returned to its parent unit.\nThroughout April, TF 20 continued to raid suspected WMD sites, sometimes only hours ahead of the official Army WMD Sensitive Site Exploitation (SSE) team. As major combat operations were winding down TF 20 transitioned to hunting HVT former Ba'athists. On 19 April 2003, the TF captured HVT Mohammed Abbas, the leader of the PLF terrorist group. On 25 April, captured the Iraqi deputy Prime Minister Tariq Aziz. TF 20 also recovered a Mil Mi-17 \"Hip\" helicopter for later use in covert operations.\nPost invasion\nIn May 2003, 80% of SOF assets were withdrawn from the Iraq theatre at the conclusion of major combat operations. Elements of Task Force 20 remained and continued to hunting HVT former Ba'athists under direct JSOC command and had several successes in its early operations.\nOn 16 June 2003, operators from G Squadron, SAS (part of Task Force 14) and B squadron, Delta Force, captured Lieutenant-General Abid Hamid Mahmud al-Tikriti, who had been Saddam Husseins' personal secretary and had been ranked the fourth most important HVT. He was captured in a joint helicopter and ground assault on a safehouse in Tikrit without resistance or casualties, in what was considered a highly successful operation.\nOn 18 June 2003, near the Syrian border, AC-130 Spectre gunships guided in by TF 20 operators destroyed a convoy of Ba'ath Party members escaping to Syria, intelligence indicated that the convoy may included Saddam Hussein and/or his sons, other reports claim the convoy was composed of oil smugglers. Once the convoy was destroyed by the AC-130s, TF 20 conducted a heliborne assault into a nearby compound that proved to be a Ba'athist safehouse for ferrying FREs (Former Regime Elements) across the border. The task force then came under fire from Syrian border guards leading to a firefight that left several of the border guards dead with 17 more captured who were immediately released.\nsoldiers during the mission to capture/kill Uday and Qusay Hussein in Mosul, 22 July 2003.]]\nOn 22 July 2003, a former Ba'athist regime member used an informer to pass intelligence onto the 101st Airborne Division that Uday and Qusay Hussein (whom had $15 million bounty), along with Qusays' son and a bodyguard, were hiding in the informers home in Mosul; the 101st passed this information to their divisional special forces liaison, whom passed it onto TF 20. Platoons from the 101st Airborne set up an outer cordon around the target house, a Delta assault team prepared to breach and clear the building from the entrance, whilst a Delta interpreter called upon the occupants to surrender. The informer and his two sons left the building as previously agreed. Delta operators breached and entered, upon which they were immediately engaged by small arms fire, which wounded one Delta operator. As they withdrew from the house, the occupants threw grenades from the second floor on them, and several Delta operators were lightly wounded by the grenade fragments; the stairs had also been blocked to impede any rapid assault. Another group of assaulters fast roped from a MH-6 Little Bird onto the roof of the building to examine the possibility of entering the building through the roof, but this wasn't possible. The decision was taken to soften up the target with heavy weapons before another entry. After soldiers of the 101st Airborne engaged the building with .50cal HMGs and M136 anti tank rockets, a third entry attempt was made, but was again driven back by intense gunfire. The 101st fired 10 TOW II antitank guided missiles from HMMWVs into the house, followed by repeated gun runs from OH-58 Kiowas firing 2.75 rockets and .50cal machine guns. Delta subsequently made a successful entry and moved up onto the second floor, finding Qusay and the bodyguard dead. Qusay's son was hiding under a bed and opened fired on the operators, leaving them no choice but to kill him. Uday was discovered wounded and armed, and a Delta soldier shot and killed him.\nHistory as Task Force 121\nIn July 2003, Task Force 5 (formerly Task Force 11) in Afghanistan and Task Force 20 were amalgamated to form Task Force 21, which was later renamed as Task Force 121—the command was set up in such a way that TF 121's Delta Force and other elements of JSOC could be switched between Afghanistan and Iraq as required. The task force continued to successfully target former regime members.\nBetween July and December 2003, TF 121 carried out twelve unsuccessful raids to find Saddam Hussein, together with 600 other operations against targets, including 300 interrogations. On 12 December 2003, a raid on a house in Baghdad, that was being used as an insurgent headquarters, captured Muhammed Ibrahim Omar al-Musslit, who was Saddam's right-hand man, known to TF 121 as \"the source\" or \"the fatman\". Early the next morning he revealed where Saddam may be found. This intelligence and other intelligence from detained former members of the Ba'ath Party, supported by signals intelligence from the ISA, finally pinpointed Hussein at a remote farm compound south of Tikrit. Operation Red Dawn was launched on two likely locations of Saddam's whereabouts (code-named Wolverine 1 and Wolverine 2) near the town of ad-Dawr. C squadron, Delta Force, ISA operators under TF 121 and the First Brigade Combat team of the 4th Infantry Division, conducted the operation, Delta operators eventually found and arrested Saddam Hussein.\nIn the final weeks of 2003, Colonel Stuart Herrington had been on an inspection of Camp Nama—the special ops facility at Baghdad Airport (at the time it was TF 121 main operations centre in Iraq prior to moving to Balad Air Base). In particular Herrington inspected the detention and interrogation facilities, where individuals captured by JSOC and SAS were taken to. As a result, he reported to the chief army intelligence officer in Baghdad that Iraqis who had been captured by TF 121 had shown signs of mistreatment. In the following months there was a series of investigations and a total of 29 complaints were investigated in relation to Camp Nama, five were upheld resulting in disciplinary action against 34 soldiers.\nBy early 2004 many of the leading 'deck of cards' figures had been accounted for. By the Spring of 2004, Major General Stanley McChrystal, the commander of JSOC, began dealing with the level of abuse of detainees at Camp Nama, McChrystal—believing that 'you need to build a network to defeat one'—shut down Camp Nama and established a new base at Balad Air Base, there he created a state-of-the-art JOC (Joint Operations Centre) where JSOCs war in Iraq would be run day to day by the commander of Delta Force, the base was up and running by July 2004.\nHistory of Task Force 6-26\nThe Guardian reported that a few days after the US media published a series of photographs showing abuse of detainees at Abu Gharib prison Task Force 121 was renamed Task Force 6-26.\nTF 6-26 conducted missions in Fallujah before and during the First Battle of Fallujah.\nOn 19 August 2004, TF 6-26 operators and an Iraqi special forces unit, supported by U.S. Marines from Detachment One as part of Task Unit Raider carried out a raid on \"Objective Resistor\", the target being a former regime official running a large anti-coalition cell connected to JTJ, Detachment One would raid the official's house while TF 6-26 operators and an Iraqi special forces unit killed/captured two of his financiers. However, the mission was a \"dry hole\".\nHistory as Task Force 145\nIt was a combined U.S. and British military special forces provisional grouping specifically charged with hunting down high-value al-Qaeda and Iraqi leadership including Osama bin Laden and, prior to his death on 7 June 2006, Al-Qaeda in Iraq leader Abu Musab al-Zarqawi. It is believed that the Task Force played a role in the medium-altitude strike mission that killed al-Zarqawi just outside Baqubah. The Task Force was charged with disrupting al-Qaeda operations in Iraq and, to a lesser extent, Afghanistan.\nThe action arm of the task force was made up of operators from Delta Force, DEVGRU, SAS, SBS and the 75th Ranger Regiment. Members of the CIA's elite (SAD/SOG) paramilitary unit were also believed to be an important part of the group. Support elements include the 160 SOAR (Night Stalkers), the USAF 24 STS, and British paratroopers from the SFSG.\nThe unit was operating up until at least January 2007; it is not clear whether it is still operational with the U.S. drawdown from Iraq. In January 2007 Task Force 88 established a subsidiary task force, Task Force 17 (US Army ODA/Special Forces), in addition to an existing task force for which it supported, Task Force 16 (US/UK Tier 1 SOF). Task Force 17 was established to 'counter Iranian influence.' Task Force 17 was to be made Initially Operationally Capable as of 'NLT 15 January 2007 and Full Operational Capability (FOC) will be in place NLT 15 February 2007.'\nOperations\nThe task force is known to operate very autonomously. In their only publicly known operation they reportedly conducted several raids without requiring approval from nearby conventional command structures and only requiring it from USSOCOM. The task force was also responsible for the tracking and eventual elimination (by F-16 launched ordnance) of Abu Musab al-Zarqawi.\nOver 18 months beginning in early 2007, the task force reportedly arrested 3,500 terrorists in Baghdad and killed several hundred others. Thus, al Qaeda bomb attacks went down from an average of 150 per month (killing monthly 3,000 people) to about two. During the campaign, six SAS troops were killed and 30 injured. Delta Force suffered an overall 20 percent casualty rate (killed, injured, sick). Overall, by the cessation of operations, TF 145 suffered 18 killed in action.\nDuring operations in Al-Anbar province, TF88 operatives entered the insurgent-controlled city of Haditha, several times finding Zarqawi's hideouts. Their raids found eggs still cooking, just missing the terrorist leader. Based on this current and actionable intelligence, they asked the commander of II MEF(FWD) to have the city of Haditha assaulted in order to flush Zarqawi out. The general chose the 3rd Battalion 1st Marines, experienced in heavy fighting from Operation Phantom Fury, to assault the city.\nOriginally, it was not clear what the reduced U.S. military role following the U.S.–Iraq Status of Forces Agreement and associated drawdown to purely advisory operations has had on the task force's operations.\nOther temporarily formed Task Forces are composed primarily of US and UK Special Operations units (and depending on operational needs, usually involving other SOF units such as Australia's Special Air Service Regiment and 2nd Commando Regiment as well as Canada's JTF2 and Germany's Kommando Spezialkräfte (KSK).) They mostly are put together for specific taskings, such as hunting ISIL leadership (such as unconfirmed reports of a reformation of \"TF Black\") or the hunt of the Somali Al-Shabaab alongside CJSOTF-Africa.\nTask Force Black/Knight\nBased in the Baghdad area at MSS Fernandez, TF Black (which was supported by Parachute Regiment members of the SFSG) is based around a squadron of the SAS, with integrated units from the SBS, SRR, 18 SR and Delta Force and DEVGRU.. In the early months of 2004, the SAS used their capabilities in reconnaissance and surveillance to watch suspects and develop/gather intelligence for the coalition intelligence services. The SAS operational process in Baghdad was known as find-fix-finish. Working backwards with the 'finish' part being a raid to take down a suspect, 'fix' involved pinpointing a time and place which a target can be taken; 'find' would be finding the insurgent/terrorist. In this period, they almost captured/killed Abu Musab al-Zarqawi when they assaulted a house in Baghdad. After forcing entry, they withdrew when they discovered a booby trap. They still managed to overwhelm the occupants of the building; captured intelligence revealed Zarqawi had left a short time before.\nDue to mistreatment of detainees and the conditions at Camp Nama and JSOC's TSF (Temporary Screening Facility) at Balad and the deportation of detainees to Bagram Airbase, US-UK relations were strained when they refused to turn over detainees to US custody. McChrystal kept Task Force Black out of JSOC, but this would change in 2006. In the meantime, Task Force Black targets were former Ba'athist party regime elements. On 11 April 2005, Task Force Black's G squadron, SAS, captured Fadhil Ibrahim al-Mashhadani, one of Saddam Hussein's former apparatchik after assaulting his house. At about the same time, in an attempt to find the kidnappers of a foreigner, the SAS also captured a former senior Ba'athist party official and another man. They didn't find the hostage but the men were definitely connected to the kidnappers; they were later released, however, when US intelligence revealed that they were CIA assets.\nIn Spring 2005, the Director Special Forces (DSF) rebalanced British special forces deployments so that Afghanistan would be the responsibility of the SBS and Iraq would be that of the SAS. Following the Basra prison incident in September 2005, in which the name of the unit 'Task force Black' was leaked to the press; the unit was renamed 'Task force Knight'\nAfter a change of DSF and improvement of the JSOCs TSF, in late 2005 Task Force Black began to integrate more closely with JSOC. In mid-January 2006, the British SAS began Operation Traction: which was its secret upgrade/integration into JSOC, they deployed TGHG (Task Group Headquarters Group): this included senior officers and other senior members of SAS - to JSOCs base at Balad. This upgrade now meant that the SAS were \"joined at the hip\" with JSOC and it gave the SAS a pivotal role against Sunni militant groups, particularly AQI\nIn early 2006, Task Force Black was involved in the release of three hostages working for Christian Peacemaker Teams as part of Operation Lightwater. With the aim of finding the hostages, the operation involved raiding houses and arresting suspects almost every day and night until sufficient intelligence was gathered on the whereabouts of the hostages. The total number of building raids amounted to 50, 44 of them being by British special forces including a total detained 47 people. In April 2006, B squadron SAS launched Operation Larchwood 4 the results of which gave the coalition intelligence on Zarqawi which led to his death.\nAccording to journalist Sean Rayment for the Telegraph, TF Black removed or killed 3,500 terrorists in Baghdad prior to 2008. Rayment wrote that these killings \"reduced bombings in Baghdad from about 150 a month to just two.\"\nIn October 2004, all SAS personnel in Iraq including Task Force Black were banned from handing over suspects to the US forces if the suspects were going to be taken to a US interrogation center, because of the bad reputation of the centers. Another setback for the task force was during the Second Battle of Fallujah when the SAS was banned from going into the city alongside its American counterpart because of the pressure that the government was feeling from the unpopularity of the war.\nIn 2007, when JSOC began conducting CII (Counter Iranian Influence) missions, the UK government ordered that Iranian nationals should not be taken by Task Force Knight and they excluded them from certain intelligence-gathering missions measures being taken to prepare for possible strikes against Iran.\nFollowing a SAS takedown operation of Qais Khazali - a senior Shia militant and Iranian proxy in Basra and his brother: Laith al-Khazali and his Ali Mussa Daqduq a Hezbollah advisor, turned out to be the Task Force most significant action of Operation Crichton. They also found critical documents: one was a report on the Karbala raid which identified Azhar al-Dulaimi as being responsible for it, he was eventually killed by US forces; the Karbala memo also indicated that Iran's Quds Force approved the attack. There were memos about attacks on British forces in Basra and large financial payments based on performance against the coalition. Daqduq revealed that he had been brought into Iraq by Quds Force leadership to be a sort-of insurgent management consultant. He also revealed that the Shia Special Groups gave reports of IED attacks and indirect fire to the Iranians as well as said Iraqi's for training in Iran.\nThe mission made a strategic impact, Task Force 17 (a unit consisting of US Army Special Forces and elite Iraqi units conducting Counter Iranian Influence missions) stepped up its raids against Iranian targets. Operators from Task Force knight responded to 2007 Iranian seizure of Royal Navy personnel, but the incident was eventually resolved. The CII missions successfully caused the leader of the Mahdi Army, Muqtada al-Sadr, to flee to Iran, where in August he declared a ceasefire with the coalition.\nDuring the Spring and summer of 2007, the British SAS as part of Task Force Knight suffered several men seriously wounded as it extended its operations into Sadr City; in April, Task Force Knight focused its efforts against Arab Jabour which HUMINT intelligence revealed that it was an al-Qaeda's \"bastion\".\nFollowing the disbandment of Task Force Spartan in southern Iraq following the British withdrawal, Task Force Knight focused its efforts on al-Qaeda VBIED network in Iraq, mainly in Dora, Salman Pak and Arab Jabour, killing dozens in the summer months of 2007.\nBy March 2008, the Sunni insurgency was waning rapidly, the need for aggressive special operations raids became few, B squadron SAS extended its operations into Tikrit and Anbar province, going after low-level targets that the Iraqi military could deal with. UKSF left Iraq in May 2009.\nTask Force Black/Knight provided the United Kingdom with one clear success of the nations controversial involvement in the Iraq War. In an interview with The Times newspaper in August 2008, General David Petraeus said the SAS \"have helped immensely in the Baghdad area, in particular to take down the al-Qaeda car bomb networks and other al-Qaeda operations in Iraq's capital city\". Lieutenant-General Rob Fry described the role of British special forces in defeating al-Qaeda as being of \"an absolutely historic scale\".\nThe SAS campaign against the Shia Special Groups was successful. Iraq's population, however, is made up of a Shia majority whose insurgents were supported covertly by Iran. The task force and JSOC, therefore, could only contain the threat rather than destroy it. Many members of the Special Groups have since been released by the Iraqi government.\nCurrently, rumors of a \"reformation of a similar Task Force going by the cover name of TF Black\" have emerged. Most former Special Mission Unit members and insiders believe, however, that because the concept of a \"Task Force is temporary, hence the term 'Task' Force...as in being tasked with a particular objective\", this would be unlikely, regardless of the reports of mainstream media to the contrary. Most of the time, Task Forces such as the original TF Black, cannot technically \"be reformed\" to hunt ISIL when the creation of a more current and lesser-known joint Task Force would make more sense to those inside the Joint Special Operations Command.\nHistory as Task Force 88\nThe Long War Journal reported that Task Force 88 operators with Iraqi forces carried out a raid in north of Baquba, Diyala province on 22 January 2008 as part of Operation Raider Harvest-an operation focusing on al Qaeda in Iraq/ISI's network in the Miqdadiyah region of Diyala province. The raid targeted \"an improvised explosive device specialist involved in coordinating IED and suicide-vest attacks in the region-with ties to several al Qaeda in Iraq senior leaders.\" They killed the high-value target and one other operative during the raid and found IEDs and grenades at the scene. The following day, TF 88 returned to the region in search of a second ISI (Islamic State of Iraq) leader. Ten ISI fighters were killed in airstrikes and another three were killed by ground fire as they moved to attack the operators. As they secured the building used by the terrorists, Coalition forces found \"machine guns, military-style assault vests, rocket-propelled grenade propellant, and various ammunition,\" Multinational Forces Iraq reported. \"Nearby, the ground force discovered additional weapons caches to include rocket-propelled grenades, artillery, and mortar rounds, improvised IEDs, and suicide-vest materials.\"\nThe Long War Journal reported that on 24 June 2008, a team of TF 88 operators killed ISI emir in a raid on a terrorist safe house in Mosul.\nReferences\n*\nFurther reading\n* Smith, Michael, ''Killer Elite: The Inside Story of America's Most Secret Special Operations Team, 2008\n* Urban, Mark, Task Force Black, 2010\n*\n* Shultz, Richard (2018).[https://www.tandfonline.com/doi/full/10.1080/1057610X.2016.1239990?scroll=top&needAccess=true \"U.S. Counterterrorism Operations during the Iraq War: A Case Study of Task Force 714\"]. Intelligence and National Security'' 33:7, pp.&nbsp;974–998.\nExternal links\n*Cuomo, C, McNiff, E, & ABC News Law and Justice Unit, . 9 June 2006. [https://abcnews.go.com/US/Terrorism/Story?id=2056386&page=1 The men in the shadows—hunting al-zarqawi]\n*GlobalSecurity.org, [http://www.globalsecurity.org/military/agency/dod/tf-145.htm http://www.globalsecurity.org/military/agency/dod/tf-145.htm Task Force 145]\n*Hala Jaber, Sarah Baxter and Michael Smith, [https://web.archive.org/web/20080724150007/http://www.timesonline.co.uk/tol/news/world/article673601.ece How Iraq's Ghost of Death was Cornered], The Times, 11 June 2006\n*Brian Ross, [https://web.archive.org/web/20090921025711/http://blogs.abcnews.com/theblotter/2006/06/secret_us_task_.html Secret U.S. task force changes its name, again], The Blotter, ABC News, 12 June 2006\n*Mark Bowden, [https://www.theatlantic.com/doc/200705/tracking-zarqawi The Ploy], Atlantic Monthly, May 2007\n*Bill Roggio, [http://www.weeklystandard.com/weblogs/TWSFP/2008/11/secret_order_to_target_al_qaed.asp Secret order to target Al-Qaeda] , November 2008\n*Bill Roggio, [http://www.longwarjournal.org/archives/2006/09/the_black_guards.php The Black Guards], Long War Journal, September 2006"
    }
  ]
}