{
  "content": [
    {
      "type": "text",
      "text": "# JoJo's Bizarre Adventure: Stardust Crusaders__disambig_1\n\n| last_aired    =\n| prev_season   = Season 1: Phantom Blood & Battle Tendency\n| next_season   = Season 3: Diamond Is Unbreakable\n| episode_list  = List of JoJo's Bizarre Adventure episodes\n}}\nis the second  season of the ''JoJo's Bizarre Adventure anime by David Production, based on the JoJo's Bizarre Adventure'' manga series by Hirohiko Araki. It is the 3rd animated adaptation of the manga's third part, Stardust Crusaders, following an original video animation series by A.P.P.P. that was released first in 1993 and continued later in 2000.\nThe series aired for 48 episodes, split into two parts consisting of 24 episodes each. The first part aired on Tokyo MX between April 5, and September 13, 2014, also syndicated on MBS, Animax, and other channels. The second part, subtitled , aired between January 10, and June 20, 2015. The series was simulcast outside of Asia on Crunchyroll's streaming services. A preview of the English language dub of the first three episodes was streamed on Crunchyroll on July 5, 2014, tying in with its premiere at Anime Expo 2014. The English dub began airing in North America on Adult Swim's Toonami programming block from July 30, 2017. Viz Media released a Blu-ray set of the first 24 episodes, that includes English and Japanese audio with subtitles for the Japanese, in North America on July 3, 2018, with the remaining 24 episodes being released in a subsequent set on January 22, 2019.\nPlot\nIn 1983 Dio, the vampiric enemy of Jonathan Joestar, emerges from the bottom of the Atlantic Ocean after stealing Jonathan's body. Dio develops a manifestation of life energy known as a Stand, causing Jonathan's descendants Joseph Joestar, Holy Kujo, and Jotaro Kujo to also gain Stands in 1987. Holly, lacking the strength to control her Stand, falls ill and is estimated to have fifty days left to live. Jotaro, Joseph, and fellow Stand users Muhammad Avdol and Noriyaki Kakyoin travel from Japan to Egypt to find and kill Dio, which will free Holy from her Stand-induced illness. The group is later joined by Jean Pierre Polnareff, a former assassin of Dio's who seeks revenge on his sister's killer, and a Stand user dog named Iggy. Aided by Kakyoin, who reveals the nature of Dio's time-stopping Stand The World in his last moments, Jotaro kills Dio in Egypt, allowing Holy to recover.\nVoice cast\n{| class=\"wikitable\"\n! Character\n! Japanese\n! English\n|-\n|Jotaro Kujo\n|Daisuke Ono\n|Matthew Mercer\n|-\n|Joseph Joestar\n|Unshō Ishizuka\n|Richard Epcar\n|-\n|Mohammed Avdol\n|Kenta Miyake\n|Chris Tergliafera\n|-\n|Noriaki Kakyoin\n|Daisuke Hirakawa\n|Kyle Hebert\n|-\n|Jean Pierre Polnareff\n|Fuminori Komatsu\n|Doug Erholtz\n|-\n|Iggy\n|Misato Fukuen\n|Derek Stephen Prince\n|-\n|Dio\n|Takehito Koyasu\n|Patrick Seitz\n|-\n|Enya the Hag\n|Reiko Suzuki\n|Barbara Goodson\n|-\n|Vanilla Ice\n|Shō Hayami\n|Jalen K. Cassell\n|-\n|Gray Fly\n|Mitsuaki Madono\n|Jay Preston\n|-\n|Impostor Captain Tennille\n|Tesshō Genda\n|Michael McConnohie\n|-\n|Forever\n|Kappei Yamaguchi\n|Uncredited\n|-\n|Devo the Cursed\n|Shouto Kashii\n|Edward Bosco\n|-\n|Rubber Soul\n|Shinji Kawada\n|Ray Chase\n|-\n|Hol Horse\n|Hidenobu Kiuchi\n|Imari Williams\n|-\n|J. Geil\n|Takuya Kirimoto\n|Tom Fahn\n|-\n|Nena\n|Satsuki Yukino\n|Dorothy Elias-Fahn\n|-\n|ZZ\n|Iwasaki Masami\n|David Vincent\n|-\n|Steely Dan\n|Daisuke Kishio\n|Grant George\n|-\n|Arabia Fats\n|Manabu Sakamaki\n| Uncredited\n|-\n|Mannish Boy\n|Ikue Ohtani\n|Tara Sands\n|-\n|Cameo\n|Kinryu Arimoto\n|Stephen Mann\n|-\n|Midler\n|Aya Hisakawa\n|Karen Strassman\n|-\n|N'Doul\n|Kentarō Itō\n|Greg Chun\n|-\n|Oingo\n|Makoto Yasumura\n|Joe Zieja\n|-\n|Boingo\n|Motoko Kumai\n|Jessica Gee\n|-\n|Anubis\n|Yasunori Matsumoto\n|Brad Venable\n|-\n|Chaka\n|Anri Katsu\n|Khoi Dao\n|-\n|Khan\n|Hidenari Ugaki\n|Joshua Tomar\n|-\n|Mariah\n|Ayahi Takagaki\n|Lauren Landa\n|-\n|Alessi\n|Masaya Onosaka\n|Jon Allen\n|-\n|Daniel J. D'Arby\n|Banjō Ginga\n|Cam Clarke\n|-\n|Pet Shop\n|colspan=\"2\" style=\"text-align:center;\" |N/A\n|-\n|Terence T. D'Arby\n|Junichi Suwabe\n|Xander Mobus\n|-\n|Kenny G.\n|Junichi Yanagita\n|Uncredited\n|-\n|Nukesaku\n|Tōru Nara\n|Arnie Pantoja\n|-\n|Holly Kujo\n|Reiko Takagi\n|Julie Ann Taylor\n|-\n|Merlai Anne\n|Rie Kugimiya\n|Ryan Bartley\n|-\n|Suzi Q\n|Sachiko Kojima\n|Stephanie Sheh\n|-\n|Roses\n|Motomu Kiyokawa\n|Kevin Brief\n|-\n|Narrator\n|Toru Okawa\n|David Vincent\n|}\nProduction\nAlthough teased at in the post-credit scenes of the first season's finale, the second season of the JoJo anime was officially announced in October 2013 in the November 2013 issue of Ultra Jump and the fifth tankōbon volume of JoJolion. David Production revealed that as with the different art styles they used for the first season, which covered the Phantom Blood and Battle Tendency arcs, they would be attempting a new art style with the Stardust Crusaders season. Takehito Koyasu reprises his role as Dio from the previous season and Daisuke Ono reprises his role as Jotaro Kujo from the ''JoJo's Bizarre Adventure: All Star Battle'' video game, but all other characters were given new voice actors.\nMusic\nThe opening theme for the first half of the season is \"Stand Proud\", performed by Jin Hashimoto, while the ending theme is American female pop rock band The Bangles' 1986 single \"Walk Like an Egyptian\". The \"Battle in Egypt\" half of the season has new theme music, with the opening theme changed to , performed by the band \"JO☆STARS ~TOMMY,Coda,JIN~\" consisting of Hiroaki \"Tommy\" Tominaga, Coda, and Jin Hashimoto, each of whom had performed one of the series' previous openings, while the ending theme was changed to American jazz fusion band Pat Metheny Group's \"Last Train Home\" from their 1987 album Still Life (Talking). However, episode 27 featured the unique ending theme song and animation sequence for , performed by Makoto Yasumura and Motoko Kumai as their characters Oingo and Boingo; a digital single was released shortly after broadcast. This song was used again in episodes 36 and 37, this time performed by Hidenobu Kiuchi with Motoko Kumai, as the characters Hol Horse and Boingo; a digital single was released for this version of the song as well. The original score for the series is composed by Yugo Kanno. The first soundtrack album Departure was released on July 30, 2014, and a second soundtrack album Journey was included with the second volume of the Blu-ray releases, released on August 27, 2014. A third soundtrack album titled World was included with the first volume of the \"Battle in Egypt\" Blu-ray releases, released on April 22, 2015. A fourth album titled Destination was then released as an individual CD on May 27, 2015, and included a full-length version of \"Aku-yaku Kyōsōkyoku\".\nEpisode list\n| season =\n| seasonR =\n| title =\n| titleR =\n| aux1 = 10\n| aux1T = Storyboarded by\n| director = 10\n| writer = 10\n| airdate = 12\n| airdateR =\n| altdate = 12\n| altdateT = English air date\n| altdateR =\n| episodes =\n| Aux1                = Naokatsu Tsuda\n| DirectedBy          = Naokatsu Tsuda\n| WrittenBy           = Yasuko Kobayashi\n| OriginalAirDate     =\n| AltDate             = July 30, 2017\n| ShortSummary        = In the 1880s, the vampire Dio, the enemy of the Joestar family, possesses the body of the deceased Jonathan Joestar and survives by hiding in a coffin for a hundred years. In 1983, the coffin holding Dio is salvaged from the depths of the Atlantic Ocean. Over 1986 and 1987, manifestations of life energy known as Stands emerge from Jonathan's grandson Joseph Joestar and teenage great-great grandson Jotaro Kujo. In Japan in 1987, Jotaro has willingly turned himself into jail, refusing to leave as he believes his Stand Star Platinum, which possesses superhuman speed, strength and precision, is an evil spirit that is possessing him. Joseph flies in from New York with his friend, the Egyptian Stand user Mohammed Avdol, to coax Jotaro out of his cell. Avdol's fire-manipulating Stand Magician's Red challenges Jotaro which causes Star Platinum to appear. When Jotaro leaves his cell, Joseph tells Jotaro about Dio and Stands and how Dio is the likely cause of their Stands emerging. Elsewhere, Dio senses the presence of the Joestars and resolves to kill them.\n| LineColor           = 339AFF\n}}\n| Aux1                = Naokatsu Tsuda\n| DirectedBy          = Yūta Takamura\n| WrittenBy           = Yasuko Kobayashi\n| OriginalAirDate     =\n| AltDate             = August 6, 2017\n| ShortSummary        = Dio orders Noriaki Kakyoin, a recent transfer to Jotaro's school, to kill Jotaro. As Jotaro walks to school, Kakyoin's Stand Hierophant Green causes a deep cut to suddenly appear on Jotaro's leg. Jotaro falls down a flight of stairs, but he uses Star Platinum to divert his fall. Later, as Jotaro heads to the infirmary to have his wound treated, Hierophant Green possesses the nurse's body. The nurse stabs one of the other students with a pen before going after Jotaro with inhuman strength. Jotaro uses Star Platinum to pull Hierophant Green out of the nurse's body, leaving the nurse with harsh internal injuries. Star Platinum shrugs off Hierophant Green's Emerald Splash attack, and pummels Hierophant Green until Kakyoin falls unconscious. After leaving the injured nurse to the school faculty, Jotaro takes Kakyoin back home to Joseph and Avdol. Joseph explains that Kakyoin is Dio's pawn and will likely die in a few days, caused by something implanted in Kakyoin's forehead.\n| LineColor           = 339AFF\n}}\n| Aux1                = Toshiyuki Katō\n| DirectedBy          = Toshiyuki Katō\n| WrittenBy           = Yasuko Kobayashi\n| OriginalAirDate     =\n| AltDate             = August 13, 2017\n| ShortSummary        = Joseph reveals that the object on Kakyoin's forehead is a \"flesh bud\" that has a tendril going straight into his brain, making him swear loyalty to Dio. Determined to save Kakyoin, Jotaro uses Star Platinum to remove the bud from Kakyoin's brain, while Joseph destroys it. The next day, a Stand emerges from Jotaro's mother Holly but she does not have enough power to control it. Avdol estimates she only has fifty days to live. As killing Dio is the only way to save Holly, Jotaro uses Star Platinum's precision to analyze \"spirit photos\" of Dio taken by Joseph's Stand Hermit Purple. Based on the faint image of a particular fly Star Platinum spotted, Avdol deduces that Dio is in the Aswan region of Egypt. Kakyoin decides to join the group because of a fondness he feels for women like Holly. As the group takes off on a flight towards Egypt, Dio, using a Stand power, takes a spirit photo showing him they are on their way to Egypt. Joseph and Jotaro sense Dio's presence, suspecting that there may be a Stand user on board.\n| LineColor           = 339AFF\n}}\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Taizō Yoshida\n| DirectedBy          = Jirō Fujimoto\n| WrittenBy           = Shōgo Yasukawa\n| OriginalAirDate     =\n| AltDate             = August 20, 2017\n| ShortSummary        = A tiny and quick stag beetle-shaped Stand named Tower of Gray, which is responsible for causing mass murders that look like tragic accidents, suddenly kills a row of passengers, using their bloody tongues to spell out the word \"Massacre!\". Before an elderly passenger raises the alarm, Kakyoin knocks him out. Kakyoin uses Hierophant Green's Emerald Splash attack to impale Tower of Gray using spikes from under the seating. When Hierophant Green rips Tower of Gray apart, its user Gray Fly, the elderly man from before, is fatally wounded. Before dying, Gray Fly warns the Joestar group that Dio has dispatched more Stand-using assassins after them and that Dio's Stand is the strongest of them all. Joseph discovers that the pilots have been killed, but he safely lands the plane off the coast of Hong Kong. The group realizes that they must find an alternate way of reaching Egypt that does not put innocent lives at risk and decide to travel by sea. As the group eats in a Hong Kong restaurant they are joined by the French tourist Jean Pierre Polnareff who soon reveals himself to be the user of the sword-wielding Stand Silver Chariot and one of Dio's assassins.\n| LineColor           = 339AFF\n}}\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Ken'ichi Suzuki\n| DirectedBy          = Ken'ichi Suzuki\n| WrittenBy           = Yasuko Kobayashi\n| OriginalAirDate     =\n| AltDate             = August 27, 2017\n| ShortSummary        = Silver Chariot fights Magician's Red in Tiger Balm Garden. Both Polnareff and Silver Chariot are engulfed in flames. Before the group can celebrate victory, Polnareff has Silver Chariot shed its protective armor, allowing it to move even faster and produce shadow images and attack from multiple angles. Avdol overcomes the clones using Magician's Red's Crossfire Hurricane Special with multiple flames to distract the decoys, before attacking Polnareff directly from underground with a larger flame. Polnareff admits defeat and resigns himself to be killed by the flames. Realizing his chivalry, Avdol releases Polnareff from the flames. Jotaro uses Star Platinum to extract the flesh bud controlling Polnareff. As the group heads for the boat they chartered from the Speedwagon Foundation, Polnareff appears and reveals that his true goal is to find and kill a Stand user with two right hands, who raped and murdered his younger sister, Cherie. He was swayed by Dio when he promised to help him find the culprit. Learning that the culprit is likely someone in Dio's employ, Polnareff decides to join the Joestar group on their journey to Egypt.\n| LineColor           = 339AFF\n}}\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Hirofumi Ogura\n| DirectedBy          = Hirofumi Ogura\n| WrittenBy           = Shin'ichi Inotsume\n| OriginalAirDate     =\n| AltDate             = September 10, 2017\n| ShortSummary        = The Joestar group begin their three day journey towards Singapore, but discover a young stowaway named Anne on board. Anne jumps overboard and is threatened by a shark but is rescued by Jotaro. A seafaring stand approaches the boat. The Joestar group suspects Anne is a Stand user working for Dio, but Jotaro exposes the ship's captain as an impostor. The fake Captain Tennille has his Stand Dark Blue Moon take Anne hostage, challenging Jotaro to fight against him in the ocean, where he would have the advantage. Star Platinum beats Dark Blue Moon before it reaches the ocean, knocking its user into the sea. However, acorn barnacles appear on Star Platinum and spread over him, draining its strength and causing Jotaro to fall into the ocean, where Dark Blue Moon creates a deadly whirlpool. Jotaro keeps himself limp, allowing Star Platinum to concentrate its strength and counterattack with its Star Finger technique, defeating Dark Blue Moon and killing its user. Suddenly, several planted bombs explode on board, forcing the group and crew-mates to escape on emergency lifeboats. After signaling for help, a large freighter approaches the boats.\n| LineColor           = 339AFF\n}}\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Mitsuhiro Yoneda\n| DirectedBy          = Mitsuhiro Yoneda\n| WrittenBy           = Kazuyuki Fudeyasu\n| OriginalAirDate     =\n| AltDate             = September 17, 2017\n| ShortSummary        = On board the freighter, the only life form is a Stand-using orangutan called Forever, whose Stand Strength is the freighter itself. Forever kills the sailors and corners Anne in the shower. Jotaro saves Anne and fights Forever, but finds himself attacked by various parts of the ship. Forever then traps the Joestar party within the parts of the ship, but Jotaro taunts him then Star Platinum launches Jotaro's jacket button into Forever's skull with a Star Finger, then kills Forever. Strength loses its form, forcing Jotaro and the others to escape to the lifeboats as the ship reverts to its original form of a tiny boat. Upon hearing of Forever's defeat, Dio's adviser Enya the hag, who has two right hands, assures Dio that there are still six other Stand users including her son left to face the Joestars. In Singapore, the Joestar group decide to stay in a hotel to plan the next leg of their trip.\n| LineColor           = 339AFF\n}}\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Yasufumi Soejima\n| DirectedBy          = Yasufumi Soejima\n| WrittenBy           = Shin'ichi Inotsume\n| OriginalAirDate     =\n| AltDate             = September 24, 2017\n| ShortSummary        = The Joestar group check into a hotel with Anne, but when Polnareff enters his room, he realizes that one of Dio's assassins, Devo the Cursed, is hiding in his refrigerator. Polnareff easily defeats Devo who throws himself off the hotel balcony and disappears. Polnareff informs Avdol and Joseph of the situation and arranges to regroup with them later. In his room, Polnareff suddenly receives a cut on his leg, and is strapped to the underside of his bed. The culprit is revealed to be a doll that Devo possessed using his Stand Ebony Devil. Polnareff struggles to fight against the doll as Silver Chariot cannot accurately attack in areas that Polnareff cannot see. Polnareff attacks the doll precisely by using the reflections of pieces of a mirror he shattered earlier. Unable to learn anything from his opponent, Polnareff cuts the doll to pieces, which in turn kills Devo, who had been controlling his Stand from within the hotel. As Polnareff deals with authorities, Joseph uses Hermit Purple on his room's television, rapidly changing channels to reveal a hidden message warning them that Kakyoin is Dio's servant.\n| LineColor           = 339AFF\n}}\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Masashi Abe\n| DirectedBy          = Jirō Fujimoto,Hitomi Ezoe\n| WrittenBy           = Kazuyuki Fudeyasu\n| OriginalAirDate     =\n| AltDate             = October 1, 2017\n| ShortSummary        = Rubber Soul, one of Dio's assassins, uses his blob-like Stand Yellow Temperance to disguise himself as Kakyoin. As the two take their fight onto the cable cars, Yellow Temperance begins to consume Jotaro's body. Jotaro defeats Rubber Soul by dragging him down into the sea below, forcing Rubber Soul to lower Yellow Temperance's guard to breathe and leaving him open to a direct physical attack. Rubber Soul then reveals the Stands of Dio's next assassins are Death, the Empress, the Emperor, and the Hanged Man; the last of which is used by J. Geil, the man with two right hands. Rubber Soul makes a last ditch attack on Jotaro by using Yellow Temperance to pull Jotaro into the drain but Star Platinum punches the drain, raising water pressure to make the manhole hit Rubber Soul. Jotaro rejoins the group as they continue their journey to India. Unbeknownst to the Joestar group, Anne is following them in the next train car.\n| LineColor           = 339AFF\n}}\nと その1\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Toshiyuki Katō\n| DirectedBy          = Toshiyuki Katō\n| WrittenBy           = Yasuko Kobayashi\n| OriginalAirDate     =\n| AltDate             = October 8, 2017\n| ShortSummary        = The Joestar group arrives in Calcutta, which presents a considerable culture shock. Polnareff sees J. Geil's Stand the Hanged Man in the mirror of a restaurant's toilet. He smashes the mirror before the Stand gets too close. Afterwards, he decides he should hunt down J. Geil on his own, despite Avdol's warnings that they should remain together. Elsewhere, Hol Horse, another of Dio's assassins, teams up with J. Geil to kill Polnareff. The next day, Polnareff finds J. Geil with Hol Horse, but J. Geil disappears as the rainy sky clears. Hol Horse uses his Stand the Emperor, which takes the form of a gun, to fire a bullet at Polnareff, but the bullet is a part of the Emperor and dodges Silver Chariot. Just as the bullet is about to hit Polnareff, Avdol arrives and pushes him to the ground. Avdol attempts to melt the bullet with Magician's Red. The Hanged Man emerges from the reflection of a puddle and stabs Avdol in the back, allowing the bullet to strike his forehead. Kakyoin and Polnareff mourn Avdol's death.\n| LineColor           = 339AFF\n}}\nと その2\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Toshiyuki Katō\n| DirectedBy          = Shunsuke Machitani,Toshiyuki Katō\n| WrittenBy           = Yasuko Kobayashi\n| OriginalAirDate     =\n| AltDate             = October 15, 2017\n| ShortSummary        = J. Geil provokes Polnareff into attacking his Hanged Man within a glass window, using the broken shards of glass to pin him down, but Kakyoin convinces Polnareff to escape in a car. After realizing that the Hanged Man is in the car, they crash the vehicle. They realize that the Hanged Man is actually a Stand of light that jumps between reflective surfaces. The Hanged Man jumps into the reflection of the eyes of a young boy and then nearby beggars, trapping Polnareff and Kakyoin within the group of beggars. Kakyoin flips a shiny gold coin in the air, bringing everyone's gaze, along with the Hanged Man, towards it, allowing Silver Chariot to defeat the Hanged Man and kill J. Geil. When Hol Horse realizes that J. Geil is dead, he tries to flee, but is caught by Jotaro and Joseph, whom Joseph says  have just buried Avdol. Polnareff prepares to kill Hol Horse but is stopped by Hol Horse's lover Nena, allowing Hol Horse to escape. After treating Nena's wounds, Joseph urges the group to continue their journey towards Egypt, unaware that a drop of Nena's blood has caused a mysterious growth to appear on his arm.\n| LineColor           = 339AFF\n}}\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Satoshi Ōsedo\n| DirectedBy          = Satoshi Ōsedo\n| WrittenBy           = Shōgo Yasukawa\n| OriginalAirDate     =\n| AltDate             = October 22, 2017\n| ShortSummary        = The Joestar group, joined by Nena, travel by bus to Varanasi. When the doctor at the clinic attempts to cut Joseph's growth off, the growth grows a face and kills the doctor with his scalpel, revealing itself to be the Empress Stand. The Empress alerts the police, implicating Joseph for the doctor's murder. Joseph tries to fight off the Empress, but it is unaffected by his Hamon techniques. The Empress stops him moving, but Joseph uses Hermit Purple to break free and searches for its user as the growth grows larger and stronger. Joseph plunges his arm into a barrel containing coal tar. Although the Stand cannot be suffocated, the coal tar solidifies around it and Joseph uses Hermit Purple to rip the immobilized Empress to shreds. Nearby, the Empress's user Nena is also torn to shreds.\n| LineColor           = 339AFF\n}}\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Rei Nakahara\n| DirectedBy          = Jin Tamamura\n| WrittenBy           = Shōgo Yasukawa\n| OriginalAirDate     =\n| AltDate             = November 5, 2017\n| ShortSummary        = Driving to Pakistan, the group encounter Anne hitchhiking and they reluctantly take her with them. Continuing their journey, a red car plays a deadly game of tag with them and eventually pushes them over a cliff. Kakyoin uses Hierophant Green to hook a cable to the other car. Jotaro uses Star Platinum to pull them to safety, knocking the other car down the cliff in the process. Just then, a voice comes from their own car's radio, revealing the red car to be the Wheel of Fortune Stand, which emerges from the ground, destroying the Joestar group's car. It transforms, chasing them and soaking them with projectiles of gasoline. Wheel of Fortune's user, ZZ, uses the sparks on his car to try to set Jotaro ablaze. However, Jotaro avoids the flames by using Star Platinum to dig underground, destroy Wheel of Fortune and send ZZ flying out into the open. After chaining ZZ to a rock, the group take his car, which had reverted to its original dilapidated form, and continue their journey. Enya decides to confront the group personally with her Justice Stand.\n| LineColor           = 339AFF\n}}\nその1\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Hirofumi Ogura\n| DirectedBy          = Hirokazu Yamada\n| WrittenBy           = Shin'ichi Inotsume\n| OriginalAirDate     =\n| AltDate             = November 12, 2017\n| ShortSummary        = Joseph convinces Anne to return to her home in Hong Kong. The Joestar group stops in a nearby town enshrouded in fog. When the group comes across a body lying on the street riddled with bloodless holes they suspect a Stand user is involved. Feeling they should leave the town, Joseph jumps towards what he believes to be their car, only to narrowly avoid being impaled by a spiked gate. Enya, claiming to be an innocent old woman, leads them to a nearby hotel. Hol Horse shows up at the hotel, having tracked the Joestar group. However, Enya takes revenge on him for abandoning J. Geil and attacks his wrist with scissors before using her Stand Justice, which takes the form of the fog itself, to make a hole from his wound. Justice then enters the wound to make Hol Horse shoot the Emperor at himself. Enya then sets her sights on her next target, Polnareff who has become separated from the others.\n| LineColor           = 339AFF\n}}\nその2\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Hirofumi Ogura\n| DirectedBy          = Hirofumi Ogura\n| WrittenBy           = Shin'ichi Inotsume\n| OriginalAirDate     =\n| AltDate             = November 19, 2017\n| ShortSummary        = Enya tries to hide Hol Horse's body from Polnareff. Hol Horse, who is still alive, alerts Polnareff that Enya is about to attack him. Enya uses her fog to control the dead civilians of the village like zombies and chase Polnareff who retreats to a bathroom. Polnareff is hit by a surprise attack through the bathroom door's keyhole, allowing Justice to take control of his tongue and force him to lick the toilet in humiliation. Enya is interrupted by Jotaro, who suspected something was amiss when she refers to him by his real name as they all used fake names when signing the hotel ledger. Enya inflicts a wound on Jotaro's leg, but Star Platinum inhales Justice's fog-like form, suffocating Enya until she passes out. Leaving the hotel, the village is revealed to be a cemetery and Jotaro suggests that they take Enya with them to learn more about Dio. Hol Horse hijacks the car, advising the group to kill Enya while they still can.\n| LineColor           = 339AFF\n}}\nその1\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Taizō Yoshida\n| DirectedBy          = Shunsuke Machitani,Hitomi Ezoe\n| WrittenBy           = Kazuyuki Fudeyasu\n| OriginalAirDate     =\n| AltDate             = December 3, 2017\n| ShortSummary        = Now traveling by horse and carriage, the Joestar group stop by a kebab shop in Karachi. The store owner Steely Dan implants Dio's flesh bud in Enya's body with his microscopic Stand The Lovers to keep her from revealing the truth about Dio's Stand, killing Enya. The Lovers then enters Joseph's brain, where it causes any pain inflicted on Steely Dan to be amplified and sent to Joseph. It also begins implanting a flesh bud which will kill Joseph in ten minutes. Though angry, Jotaro restrains himself as he caters to Steely Dan's whims to prevent Joseph from being hurt. Joseph uses Hermit Purple to make a spirit photo showing the inside of his brain, allowing Kakyoin and Polnareff to shrink down their Stands to enter his body and locate The Lovers to save his life.\n| LineColor           = 339AFF\n}}\nその2\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Jirō Fujimoto\n| DirectedBy          = Jirō Fujimoto\n| WrittenBy           = Kazuyuki Fudeyasu\n| OriginalAirDate     =\n| AltDate             = December 10, 2017\n| ShortSummary        = In Joseph's brain, The Lovers uses Joseph's brain cells to disguise himself as Hierophant Green and then makes several clones of itself, leaving Kakyoin and Polnareff unable to determine which one is the real Stand. Meanwhile, Jotaro is humiliated, beaten and forced to steal from a jewelry store by Steely Dan, all while making notes so he can make Steely Dan pay later. In Joseph's brain, Hierophant Green finds and attacks the real Lovers with its tentacles and forces The Lovers out of Joseph's body with an Emerald Splash, giving Joseph the opportunity to destroy the flesh bud in his brain with Hamon. Realizing he has been defeated, Steely Dan tries to divert Jotaro's attention so The Lovers can enter him instead, but The Lovers is quickly spotted and caught by Star Platinum. In desperation, Steely Dan tries to have The Lovers enter a young girl's ear, but it is stopped by Hierophant Green's tentacle, which was attached to The Lovers' leg before it escaped Joseph's brain. This stops Steely Dan's movements completely, allowing Star Platinum to brutally pummel Steely Dan as revenge for everything he put Jotaro through.\n| LineColor           = 339AFF\n}}\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Naokatsu Tsuda\n| DirectedBy          = Yasufumi Soejima\n| WrittenBy           = Naokatsu Tsuda\n| OriginalAirDate     =\n| AltDate             = December 17, 2017\n| ShortSummary        = The Joestar group ride through the Arabian Desert on camels. A long while later, they realize that the sun is still in the sky at 8 o'clock in the evening. With the temperature rapidly increasing, the group realizes what they thought was the sun is actually the Stand called The Sun. Kakyoin attempts to judge the distance of The Sun with Hierophant Green, but comes under attack, which also ruins their water supply. Star Platinum digs a hole in the ground to give them shade. Kakyoin finds a rock in the middle of the desert which is a mirror image of another. When Jotaro throws a rock in its direction, a crack seemingly appears in the sky, and The Sun is defeated, restoring the night sky. The group walk over to the crack to find The Sun's user, Arabia Fats, knocked out cold in a mirrored blind where he had been hiding.\n| LineColor           = 339AFF\n}}\nその1\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Toshiyuki Katō\n| DirectedBy          = Toshiyuki Katō\n| WrittenBy           = Shōgo Yasukawa\n| OriginalAirDate     =\n| AltDate             = January 7, 2018\n| ShortSummary        = Kakyoin dreams that he is in a deserted amusement park with a dog which is killed when the Stand Death 13 attacks. After Polnareff wakes him up, Kakyoin has no recollection over the cut on his hand. Kakyoin gets a sense of familiarity when he sees the dog he saw in his dreams killed in the same manner. Later, Joseph reluctantly agrees to fly a sick baby called Mannish Boy to the hospital in the light plane he purchased. While in flight, both Kakyoin and Polnareff fall asleep and find themselves at the same amusement park dream. They are both attacked by Death 13, but find that they cannot summon their Stands to fight back. Before Death 13 lands a mortal blow on Polnareff, Joseph wakes him, leaving Kakyoin in the dream. Meanwhile, Kakyoin thrashes about in his sleep and causes Joseph to crash the plane. As the team sets up camp, Kakyoin sees that he has cut the words \"Baby Stand\" into his arm during the dream, realizing that the baby is the Stand user, but is unsuccessful in convincing the others.\n| LineColor           = 339AFF\n}}\nその2\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Toshiyuki Katō\n| DirectedBy          = Naokatsu Tsuda,Shigatsu Yoshikawa\n| WrittenBy           = Shōgo Yasukawa\n| OriginalAirDate     =\n| AltDate             = January 14, 2018\n| ShortSummary        = Kakyoin's suspicions that Mannish Boy is a Stand user are confirmed after he witnesses Mannish Boy skillfully killing a scorpion while hiding the evidence. After failing to convince everyone, Kakyoin attempts to attack Mannish Boy with Hierophant Green, but he is knocked out by Polnareff. When they fall asleep, Jotaro, Joseph, and Polnareff appear in the dream amusement park where they are all subjected to the whims of Death 13. As Kakyoin summoned Hierophant Green before he was knocked out, he brings Hierophant Green into the dream world to fight Death 13. Mannish Boy attempts to use the dream world to his advantage and slice Hierophant Green in half, but Kakyoin instead sends his Stand into Death 13's ears, forcing Mannish Boy to heal Kakyoin's wounds and accept defeat. The next morning, no-one recalls what happened in the dream except Kakyoin who retained his memories as a result of his Stand being inside the dream and he decides to leave Mannish Boy at the nearest town. Kakyoin mixes Mannish Boy's feces into the food that Joseph later feeds him. As the group crosses the Red Sea, Joseph makes a detour towards an island to meet someone important.\n| LineColor           = 339AFF\n}}\nその1\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Taizō Yoshida\n| DirectedBy          = Yūta Takamura\n| WrittenBy           = Yasuko Kobayashi\n| OriginalAirDate     =\n| AltDate             = January 21, 2018\n| ShortSummary        = The Joestar group arrive on an island by the Red Sea said to be inhabited  by Avdol's father. Alone on the island shore, Polnareff discovers an aged lamp. After he rubs it, a genie named Cameo appears and grants Polnareff three wishes. Polnareff is skeptical until his wish for money causes a treasure chest full of gold coins to appear nearby. Wondering if his wishes can bring people back from the dead, Polnareff wishes that his sister Cherie and Avdol can be brought back to life. Cherie seems to be resurrected, but is revived as a ravenous predator who viciously attacks Polnareff to consume his flesh. Cameo explains that he is actually the Stand Judgement, who can create zombie-like creatures from the earth based on the wisher's desires. The terrified Polnareff tries to use his final wish to wish Cherie away. However, Cameo gloatingly tells Polnareff that he has already used his third wish to revive Avdol.\n| LineColor           = 339AFF\n}}\nその2\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Yasufumi Soejima\n| DirectedBy          = Hitomi Ezoe,Ken'ichi Suzuki\n| WrittenBy           = Yasuko Kobayashi\n| OriginalAirDate     =\n| AltDate             = January 28, 2018\n| ShortSummary        = In accordance with Polnareff's third wish, Cameo makes a figure of Avdol that joins Cherie in attacking Polnareff, biting off pieces of his flesh as he is unable to use Silver Chariot due to Cameo's interference. The real Avdol, who had survived his encounter with Hol Horse because the seemingly fatal bullet had only grazed his skull, saves Polnareff from the clay doll versions of Avdol and Cherie. Cameo is initially too strong for Polnareff and Avdol's Stands, but Avdol then brings out the full strength of Magician's Red against Cameo, effectively dissipating the Stand. Polnareff and Avdol find a piece of bamboo sticking out of the ground, the breathing tube of the Cameo user. Polnareff drops mud, spiders, ants and a flame down the tube to block his breathing, and both of them urinate into the bamboo, forcing the user to the surface. After reuniting with the group, Joseph reveals he did not bury Avdol but tended to his wounds. Kakyoin explains he kept Avdol being alive a secret from Polnareff to prevent Dio from finding out. Avdol further reveals he had disguised himself as his father to purchase a submarine for the group.\n| LineColor           = 339AFF\n}}\nその1\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Satoshi Ōsedo\n| DirectedBy          = Satoshi Ōsedo\n| WrittenBy           = Shin'ichi Inotsume\n| OriginalAirDate     =\n| AltDate             = February 4, 2018\n| ShortSummary        = The Joestar group begin their journey beneath the Red Sea via submarine. Along the way, Joseph makes a call to his wife Suzi Q, who is unaware of his circumstances, making sure she does not travel to Japan to check on Holly, whose condition continues to worsen. Just as they approach the Egyptian shore, Joseph is suddenly attacked by the High Priestess Stand, which has the ability to transform into any mineral substance. As the submarine descends into chaos from the Stand's attacks, it begins to leak and sink. Jotaro answers another call from Suzi Q, who becomes concerned about what she hears. With the submarine at the bottom of the ocean and running low on oxygen, Jotaro attempts to crush High Priestess with Star Platinum, but it escapes by transforming into a razor. Unable to directly attack High Priestess, the group attempts to escape to the surface while Suzi Q and her butler Roses prepare to fly to Japan.\n| LineColor           = 339AFF\n}}\nその2\n| NativeTitleLangCode = ja\n| RTitle              =\n| Aux1                = Naokatsu Tsuda\n| DirectedBy          = Shunsuke Machitani,Naokatsu Tsuda\n| WrittenBy           = Shin'ichi Inotsume\n| OriginalAirDate     =\n| AltDate             = February 11, 2018\n| ShortSummary        = After finding some scuba equipment, Joseph gives everyone a quick lesson before the group prepares to flee the submarine. As they exit the submarine, they discover High Priestess has disguised itself as Polnareff's regulator and attacks him. However, Joseph and Kakyoin save Polnareff using their Stands. They all leave safely and while swimming across some rocks, they find High Priestess has disguised itself as the sea bed, sucking them inside its mouth. As the Stand's user, Midler, gloats from the surface, the group flatters her, trying to appeal to her vanity, but this only serves to anger her further. She tries to crush Jotaro between High Priestess's teeth. Jotaro breaks the teeth with Star Platinum. The group escape from High Priestess's mouth, reaching the surface, where they find Midler incapacitated (and disfigured) as a result of Jotaro's attack. Thirty days after leaving Japan and defeating many of Dio's assassins, the Joestar group finally arrive in Egypt. Jotaro and Joseph assure Suzi Q of their safety before continuing their pursuit of Dio. Meanwhile, Dio has summoned nine more Stand users.\n| LineColor           = 339AFF\n}}\n」のイギーと「ゲブ神」のンドゥール その1\n| NativeTitleLangCode = ja\n| RTitle          =\n| Aux1            = Ken'ichi Suzuki\n| DirectedBy      = Ken'ichi Suzuki\n| WrittenBy       = Yasuko Kobayashi\n| OriginalAirDate =\n| AltDate         = February 18, 2018\n| ShortSummary    = Two representatives from the Speedwagon Foundation bring a Stand user dog named Iggy to Jotaro's group, whose Stand The Fool controls sand. Joseph is also informed of Holly's situation, learning that she has two weeks left. A water-based Stand named Geb emerges from the canteen used by the Speedwagon Foundation representatives, and kills the two representatives. Jotaro's group attempts to hide from Geb, only for it to travel through the sand and surprise them, injuring Kakyoin's eyes. The group hide in their car when they realize N'Doul, the Stand user they cannot see, is using sound to find them. Geb pulls the car into the sand to kill the group, but Iggy, sensing the attack and N'Doul's position four kilometers away, flees the car.\n| LineColor       = FF6347\n}}\n」のイギーと「ゲブ神」のンドゥール その2\n| NativeTitleLangCode = ja\n| RTitle          =\n| Aux1            = Toshiyuki Katō\n| DirectedBy      = Taisuke Mamori,Toshiyuki Katō\n| WrittenBy       = Yasuko Kobayashi\n| OriginalAirDate =\n| AltDate         = February 25, 2018\n| ShortSummary    = Avdol attempts to set up a trap for Geb, but N'Doul figures it out at the last second. Geb avoids an attack from Magician's Red and injures Avdol. Realizing Iggy can detect N'Doul's attack, Jotaro coerces him into summoning The Fool, which can glide. Jotaro hitches a ride against Iggy's wishes so they can head towards N'Doul to stop him from attacking. As they get closer, both Iggy's stubbornness and N'Doul's cunning puts Jotaro at risk. Star Platinum grabs Iggy and throws him in N'Doul's direction, forcing Iggy to protect himself with The Fool while also creating a distraction long enough for Star Platinum to injure N'Doul. N'Doul commits suicide through the use of Geb so he cannot be interrogated over Dio's plans. Elsewhere, a traveling manga artist asks to see Boingo's comic book titled Oingo Boingo Brothers Adventure and discovers its odd contents, but is scared off by Boingo's older brother Oingo. The brothers prepare to head off to Aswan to confront Jotaro's group, but decide to wait for the next bus, as it is soon revealed that Boingo's comic book had predicted the artist's death.\n| LineColor       = FF6347\n}}\n| Aux1            = Naokatsu Tsuda\n| DirectedBy      = Hitomi Ezoe\n| WrittenBy       = Kazuyuki Fudeyasu\n| OriginalAirDate =\n| AltDate         = March 4, 2018\n| ShortSummary    = As the Joestar group arrive in Aswan to get Kakyoin and Avdol into the hospital, they are targeted by Dio's assassins Oingo, whose Stand Khnum changes his face, and Boingo, whose Stand Thoth is a comic book that predicts the near future. Thoth predicts that Jotaro, Joseph, and Polnareff will drink poisoned tea. Oingo poisons the group's tea, but as they drink it the group spits it out when Iggy causes a commotion. Thoth predicts that Oingo will rob a man and that Jotaro's head will be split in two by a bomb Oingo planted that looks like an orange when he heads to the hospital. Oingo robs the man, and plants the bomb in the group's car, but is forced to disguise himself as Jotaro when caught off guard by the return of Joseph and Polnareff, Jotaro having headed to the hospital before them. Oingo rides in the car with Joseph and Polnareff. He soon realizes that while disguised as Jotaro, he would be the bomb's victim. Oingo escapes the car to change back. Polnareff discards the bomb and Oingo steps on it, wounding him. Boingo is hospitalized by some thugs hired by the man Oingo robbed earlier.\n| LineColor       = FF6347\n}}\n| Aux1            = Jirō Fujimoto\n| DirectedBy      = Jirō Fujimoto\n| WrittenBy       = Shin'ichi Inotsume\n| OriginalAirDate =\n| AltDate         = March 11, 2018\n| ShortSummary    = With Kakyoin needing to spend a few more days in hospital to heal his eyes, the others continue across the Nile river by boat to Kom Ombo. Meanwhile, a young man named Chaka discovers the sword-shaped Stand Anubis. When Chaka draws Anubis out of its sheath, Anubis then suddenly moves on its own, killing Chaka's family. It declares Chaka as its master and sends him to pursue Jotaro's group. Chaka and Anubis face off against Polnareff, with Polnareff struggling against Anubis's ability to pass through anything to reach its target. When Chaka attempts a surprise attack, Polnareff uses a secret technique to deflect a piece of Silver Chariot's sword into Chaka's neck, knocking him unconscious. When Polnareff inspects the sword for himself, he comes close to being swayed by its influence before Jotaro and the others arrive. As Jotaro and Polnareff stop by a barber shop on their way to take the sword to a police station, Anubis possesses the shop's barber, Khan, who prepares to kill Polnareff.\n| LineColor       = FF6347\n}}\n| Aux1            = Toshiyuki Katō\n| DirectedBy      = Toshiyuki Katō\n| WrittenBy       = Shin'ichi Inotsume\n| OriginalAirDate =\n| AltDate         = March 18, 2018\n| ShortSummary    = Polnareff struggles to defend himself against Khan, after Anubis has memorized all of Silver Chariot's moves from before. Star Platinum snaps Anubis in half, freeing Khan from its control. But as Jotaro and Polnareff plan to throw the sword into the Nile, a police officer interferes. Polnareff inadvertently draws Anubis, and becomes possessed. Jotaro struggles to fight against Anubis, who possesses not only Polnareff's speed and Stand abilities, but also knowledge of every move Star Platinum uses against him. Anubis stabs Jotaro's stomach and proceeds to push it in further, but Jotaro uses this opportunity to pin it in place while Star Platinum smashes it to pieces. Anubis possesses a young boy with the remaining half of the blade and attempts to make the boy throw it at Polnareff. Iggy trips the boy up, resulting in Anubis ending up at the bottom of the Nile.\n| LineColor       = FF6347\n}}\n| Aux1            = Shin'ya Kawatsura\n| DirectedBy      = Shigatsu Yoshikawa\n| WrittenBy       = Shōgo Yasukawa\n| OriginalAirDate =\n| AltDate         = March 25, 2018\n| ShortSummary    = Kakyoin is informed that the Speedwagon Foundation is taking over his medical treatment, allowing his eyes to heal faster. Meanwhile, as Jotaro's group arrive in Luxor, Joseph gets shocked by Bastet, a Stand disguised as an electrical socket. Joseph decides to have the group stay in Luxor for the night. The next morning, Joseph quickly realizes he has become a human magnet as a result of the shock, causing anything metallic to become a potentially lethal weapon for him. Joseph is trapped on an escalator by Bastet's user Mariah, resulting in his hands nearly being chopped off on the landing platform. Avdol rescues him but comes under Bastet's influence as well. As Joseph and Avdol pursue Mariah, they become stuck together by their magnetism.\n| LineColor       = FF6347\n}}\n| Aux1            = Taizō Yoshida\n| DirectedBy      = Yūta Takamura\n| WrittenBy       = Shōgo Yasukawa\n| OriginalAirDate =\n| AltDate         = April 8, 2018\n| ShortSummary    = Joseph and Avdol try to get themselves detached from each other, facing all kinds of embarrassment in the process, only to wind up stuck on a railroad track as a train approaches. Magician's Red burns a hole underneath the tracks before they are run over, allowing Avdol and Joseph to escape. Despite being weighed down by an increasing array of metallic objects, Joseph and Avdol confront Mariah in a pincer attack, but are caught in a trap as she sets off several loose power cables that are drawn to their magnetism. However, the duo utilize their magnetism to their own advantage, crushing all of Mariah's bones with their combined weight until she passes out and relinquishes her power. Meanwhile, another Stand user, Alessi, sets his sights on Jotaro, Polnareff, and Iggy.\n| LineColor       = FF6347\n}}\n| Aux1            = Taizō Yoshida\n| DirectedBy      = Kentarō Fujita\n| WrittenBy       = Kazuyuki Fudeyasu\n| OriginalAirDate =\n| AltDate         = April 15, 2018\n| ShortSummary    = While Jotaro, Polnareff, and Iggy go off in search of Joseph and Avdol, who are busy with their battle with Mariah, they are followed by Alessi, who uses the power of the Stand Set which resides in his shadow to turn Polnareff into a child. Along with his smaller stature, Polnareff's mind also starts reverting as he gradually loses his adult memories. Unable to ask Jotaro for help, Polnareff is only able to defend himself from Alessi using Silver Chariot, who is also affected by Set's power. Barely managing to escape Alessi after Silver Chariot's blade hits his neck by chance, Polnareff is picked up by a young woman who takes him to her home to treat his injuries. Alessi attacks Polnareff as he takes a bath.\n| LineColor       = FF6347\n}}\n| Aux1            = Yasufumi Soejima\n| DirectedBy      = Yasufumi Soejima\n| WrittenBy       = Kazuyuki Fudeyasu\n| OriginalAirDate =\n| AltDate         = April 22, 2018\n| ShortSummary    = Alessi attempts to drown Polnareff in the bath, only for his bodily instincts to save him at the last second. Discovering that Alessi had used his power to turn the woman into a fetus that will die in a short amount of time, Polnareff attempts to escape with her, turning even younger every time he touches Set's shadow. Driven into a bedroom, Polnareff uses a fish tank, a ball, and a mirror to hide himself and get the drop on Alessi, who soon winds up in front of Jotaro. Alessi hit Jotaro with Set's shadow, only to find that Jotaro was still powerful and ruthless as a kid. Jotaro knocks Alessi out to cancel the age curse before he and Polnareff enact revenge. Relieved to find the woman restored with her memories of the event a haze, Polnareff decides to keep his identity a secret from her before he and Jotaro reunite with the rest of the group. Creating another spirit photo with Hermit Purple, Joseph determines Dio's hideout is in Cairo.\n| LineColor       = FF6347\n}}\n| Aux1            = Naokatsu Tsuda\n| DirectedBy      = Yūta Takamura\n| WrittenBy       = Shōgo Yasukawa\n| OriginalAirDate =\n| AltDate         = April 29, 2018\n| ShortSummary    = Upon arriving in Cairo, the Joestar group heads to a café where one of Dio's assassins, a gambling man named Daniel J. D'Arby claims to know where Dio's mansion is and suggests a friendly wager for his intel with their souls on the line. Polnareff goes first and the two bet on which of two pieces of fish a cat would go for first. Polnareff loses, and D'Arby's Stand Osiris steals Polnareff's soul and implants it in a poker chip, with the cat revealed to be D'Arby's pet. Joseph offers his soul in a wager against D'Arby. They bet to see who will cause a glass full to the brim to overflow by dropping coins into it. On his turn, Joseph tries to cheat by dropping more liquid into the glass, knowing that it will overflow on D'Arby's turn, but D'Arby easily puts his coin in. Joseph subconsciously admits defeat, leaving D'Arby to steal his soul. Jotaro discovers D'Arby had used a small piece of chocolate to change the way the glass appeared to be full and let it melt. Jotaro decides to face D'Arby next and beat him at poker.\n| LineColor       = FF6347\n}}\n| Aux1            = Naokatsu Tsuda,Hitomi Ezoe\n| DirectedBy      = Hitomi Ezoe\n| WrittenBy       = Shōgo Yasukawa\n| OriginalAirDate =\n| AltDate         = May 6, 2018\n| ShortSummary    = D'Arby prepares his and Jotaro's game of poker by splitting up Polnareff and Joseph's souls into six poker chips each he will use to bet with, and giving Jotaro six chips to represent his own soul. Jotaro picks a boy near the café to deal for them, not knowing everyone in and near the café is in D'Arby's employ. Jotaro loses three chips in his first hand against D'Arby, and in the second hand D'Arby is dealt four kings. Jotaro, not looking at his cards, raises all of his soul and Avdol's soul on his bet. D'Arby sees Jotaro's bet and raises it, betting the rest of Jotaro's soul and all of Joseph and Polnareff's souls. Jotaro sees his bet with Kakyoin's soul and then raises it with the soul of his mother Holly for knowledge of Dio's Stand. D'Arby, unsure if Jotaro is cheating and unable to call, mentally folds as he goes catatonic, making him unable to provide information on Dio. All of the souls he won in bets are released. Avdol realizes that Jotaro had been dealt a bad hand.\n| LineColor       = FF6347\n}}\n| Aux1            = Masayoshi Nishida\n| DirectedBy      = Shunsuke Machitani\n| WrittenBy       = Yasuko Kobayashi\n| OriginalAirDate =\n| AltDate         = May 13, 2018\n| ShortSummary    = Days before the Joestar group reach Cairo, Hol Horse witnesses Dio's power firsthand while given a final chance to redeem himself. Hol Horse partners with Boingo, whom he kidnapped from Aswan, convincing Boingo to take out the Joestar group with him. Meanwhile, as Jotaro's group try to find information about Dio's hideout, Joseph learns that Holly's condition has worsened and has only a few more days to live. Thoth gives Hol Horse an absurd prediction that he will have a chance to kill the group by sticking his fingers up Polnareff's nose. Polnareff gets the jump on Hol Horse, forcing Hol Horse to go through with the prediction. But as the others approach, Hol Horse is uncertain how the rest of the prophecy is supposed to be fulfilled.\n| LineColor       = FF6347\n}}\n| Aux1            = Taizō Yoshida\n| DirectedBy      = Taisuke Mamori\n| WrittenBy       = Yasuko Kobayashi\n| OriginalAirDate =\n| AltDate         = May 20, 2018\n| ShortSummary    = Hol Horse holds Polnareff at gunpoint in order to hide from Jotaro and the others, but Polnareff gets out of the situation by sneezing. Upon being exposed, Hol Horse spills some olive oil which causes a truck to skid out of control and hit Jotaro's group. Hiding from Jotaro, the only one not left unconscious by the crash, Hol Horse and Boingo follow Thoth's next prediction, which states Hol Horse's bullets will go through Jotaro's forehead after being fired through the pipe system at noon. However, they fire at the wrong time, and Polnareff's sneeze causes Jotaro to move out of the bullets' path. The bullets then redirect themselves through Thoth's comic page depicting Jotaro's face, hospitalizing Hol Horse. Boingo also gets hospitalized when he inadvertently angers Iggy.\n| LineColor       = FF6347\n}}\n| Aux1            = Ken'ichi Suzuki\n| DirectedBy      = Shigatsu Yoshikawa\n| WrittenBy       = Ken'ichi Suzuki\n| OriginalAirDate =\n| AltDate         = June 3, 2018\n| ShortSummary    = Iggy comes across Dio's hideout and finds it is guarded by a sadistic falcon named Pet Shop who killed two large dogs. While Iggy feigned being a dumb dog to not get involved, he reluctantly ends up saving the young owner of the dogs from Pet Shop with the boy running off. Forced to go on the run from Pet Shop and the ice attacks from his Stand Horus, Iggy escapes into the sewers, using The Fool to counterattack Horus. Undeterred, Pet Shop fully manifests Horus and freezes his wounds while preventing Iggy from escaping.\n| LineColor       = FF6347\n}}\n| Aux1            = Ken'ichi Suzuki\n| DirectedBy      = Jirō Fujimoto\n| WrittenBy       = Ken'ichi Suzuki\n| OriginalAirDate =\n| AltDate         = June 10, 2018\n| ShortSummary    = Having been caught by Pet Shop's ice attacks, Iggy is forced to gnaw off his front left paw and escape the sewers via its water supply, using The Fool to hide at the bottom of the river. Pet Shop dives into the river after Iggy and uses his ice in an attempt to crush Iggy's dome. Digging downwards only to find Pet Shop waiting for him, Iggy uses the pressure from the collapsing dome behind him to rush forward and clamp Pet Shop's beak shut just as he prepares an ice missile, causing Pet Shop to destroy himself. Exhausted from blood loss and nearly drowning, Iggy is rescued by the boy he protected earlier. A recovered Kakyoin reunites with the group after having a Speedwagon Foundation doctor treat Iggy's injuries. Iggy then leads the group to Dio's hideout.\n| LineColor       = FF6347\n}}\n| Aux1            = Yasufumi Soejima\n| DirectedBy      = Yasufumi Soejima\n| WrittenBy       = Kazuyuki Fudeyasu\n| OriginalAirDate =\n| AltDate         = June 17, 2018\n| ShortSummary    = Daniel J. D'Arby's younger brother Terence T. D'Arby brings out his Stand Atum, who drags Jotaro, Kakyoin, and Joseph into an illusory world created by another user's Stand. There, D'Arby reveals himself to collect the souls of his defeated opponent like his brother, placing them in his doll collection. With Atum attaching a piece of itself to Jotaro's soul earlier, D'Arby challenges the trio to a series of video games with their souls on the line in order to have him relinquish Jotaro. D'Arby first challenges Kakyoin in a racing video game, with both players using their Stands to perform advanced techniques. With the race neck-and-neck throughout most of the course, the pair soon enter a dark tunnel, with D'Arby gaining a slight lead.\n| LineColor       = FF6347\n}}\n| Aux1            = Jin Tamamura\n| DirectedBy      = Taisuke Mamori\n| WrittenBy       = Kazuyuki Fudeyasu\n| OriginalAirDate =\n| AltDate         = June 24, 2018\n| ShortSummary    = Kakyoin uses his higher power level to knock D'Arby off the course, only to realize he unknowingly helped him win with his soul transferred into one of D'Arby's dolls. Jotaro steps up to face D'Arby in a baseball video game and wagers his soul against Kakyoin's. Although Jotaro, who never played a video game before, gets two of his batters knocked out at the start, he soon figures out the controls by his third batter and scores four home runs, though D'Arby uses a change of pitcher to catch Jotaro's third batter out. As D'Arby goes on the offensive, predicting Jotaro's moves after declaring his bats and scoring three home runs, Joseph assumes that D'Arby has the power to read people's minds. Jotaro himself declares his next pitch.\n| LineColor       = FF6347\n}}\n| Aux1            = Shunsuke Machitani\n| DirectedBy      = Shunsuke Machitani,Eri Nagata\n| WrittenBy       = Shin'ichi Inotsume\n| OriginalAirDate =\n| AltDate         = July 1, 2018\n| ShortSummary    = D'Arby uses Atum to read if Jotaro is telling the truth in the form of yes or no questions. Despite Jotaro's soul not lying about his pitch, his pitches turn out to be different from expected. This leads D'Arby to suspect that Jotaro is somehow cheating. Unknown to D'Arby, Joseph was using Hermit Purple on the game controller. D'Arby subconsciously admits defeat and releases Kakyoin's soul. Jotaro pummels D'Arby, opening up a way out of the game room. Meanwhile, Dio's right-hand man Vanilla Ice cuts off his own head so Dio can use his blood to complete his assimilation of Jonathan's body. Dio uses his own blood to bring Vanilla Ice back to life, stating he will get blood from someone else and sends him to attack the intruders. Meanwhile, Polnareff, Avdol, and Iggy venture inside the mansion. Iggy uses The Fool to take down a Stand user named Kenny G to stop the illusions that made the mansion into a labyrinth. Avdol is killed when he pushes Polnareff and Iggy away from Cream, Vanilla Ice's Stand which disintegrates anything that enters the void inside its mouth besides Vanilla Ice.\n| LineColor       = FF6347\n}}\n| Aux1            = Toshiyuki Katō\n| DirectedBy      = Yūta Takamura\n| WrittenBy       = Shin'ichi Inotsume\n| OriginalAirDate =\n| AltDate         = July 8, 2018\n| ShortSummary    = Vanilla Ice uses Cream to prevent Polnareff and Iggy from reaching Dio while blindly destroying most of the mansion. Cream limits Polnareff's movement by erasing part of his foot. Hiding in the confusion, Iggy uses a sand replica of Dio to lure Vanilla Ice into a false sense of security to attack, but he sees through the deception and proceeds to attack Iggy in a fit of rage. Polnareff uses Iggy's leftover sand to determine Vanilla Ice's location and stab him in his mouth. Vanilla Ice retaliates by having Cream erase part of Polnareff's left hand, leg, and cheek while breaking his right arm. Vanilla Ice then decides to finish off Polnareff, who is left to accept his impending death.\n| LineColor       = FF6347\n}}\n| Aux1            = Taizō Yoshida\n| DirectedBy      = Hitomi Ezoe\n| WrittenBy       = Shin'ichi Inotsume\n| OriginalAirDate =\n| AltDate         = July 15, 2018\n| ShortSummary    = Iggy uses The Fool to pull Polnareff out of Cream's reach before he dies from his injuries. Angered at having lost another comrade, Polnareff skewers Vanilla Ice through the head and snaps his neck. While Vanilla Ice is revealed to have unknowingly become a vampire when Dio revived him, Polnareff exploits Vanilla Ice's inexperience by destroying him with sunlight. Meanwhile, Suzi pays a visit to Japan to visit Holly, fully understanding that Holly's life is in danger while deeming that keeping Jotaro and Joseph is the best way she can help. Back at Dio's mansion, Jotaro, Joseph, and Kakyoin come across the vampire \"Loser\", who is forced to lead the three to Dio after his attempt to disguise himself as an innocent woman failed. Meanwhile, Polnareff, having patched up his injuries, comes face to face with Dio.\n| LineColor       = FF6347\n}}\n| Aux1            = Masayoshi Nishida\n| DirectedBy      = Shigatsu Yoshikawa\n| WrittenBy       = Shōgo Yasukawa\n| OriginalAirDate =\n| AltDate         = July 22, 2018\n| ShortSummary    = Polnareff makes repeated attempts to climb up the stairs and finds himself back where he started, realizing it is the power of Dio's Stand, The World. Dio is forced back upstairs when Jotaro and the others arrive. The group reach Dio's coffin and force Loser to open it up. Loser suddenly finds himself inside the coffin. Sensing murderous intent from behind them, the Joestar group escape out the window. After sunset, with Jotaro sticking with Polnareff, Dio hijacks the limousine of Wilson Phillips, a visiting senator, and forces Phillips to pursue Joseph and Kakyoin in the limousine. Dio has The World block Hierophant Green's attacks. Determining that The World is a close-range Stand like Star Platinum, Kakyoin comes up with a plan to expose its secrets.\n| LineColor       = FF6347\n}}\n| Aux1            = Toshiyuki Katō\n| DirectedBy      = Toshiyuki Katō\n| WrittenBy       = Shōgo Yasukawa\n| OriginalAirDate =\n| AltDate         = July 29, 2018\n| ShortSummary    = Kakyoin uses Hierophant Green to surround Dio with wires that automatically attack him with Emerald Splash once touched. A second after, Hierophant Green's barrier is torn down while Dio fatally wounds Kakyoin. Kakyoin deduces the nature of The World's ability in his final moments, using the last of his strength to use an Emerald Splash to smash a clock face as a clue for Joseph. Using this clue, Joseph figures out that Dio has the power to stop time. Realizing there are some limits to Dio's power, Joseph conducts his Hamon through Hermit Purple to keep Dio at a distance, and rushes to warn Jotaro about The World. Dio catches up to Joseph and freezes time long enough to stab him in the neck with a throwing knife. Furious, Jotaro ignores Joseph's warning to keep his distance and instead confronts Dio in a close-range Stand battle.\n| LineColor       = FF6347\n}}\n| Aux1            = Naokatsu Tsuda\n| DirectedBy      = Taisuke Mamori,Yūta Takamura,Yasufumi Soejima\n| WrittenBy       = Yasuko Kobayashi\n| OriginalAirDate =\n| AltDate         = August 5, 2018\n| ShortSummary    = Dio stops time to try and finish Jotaro, but due to Star Platinum being the same type of Stand as The World, Jotaro appears to be able to both perceive him and move himself slightly, while time is stopped. Dio initially assumes this to be a trick Jotaro pulled by planting a magnet on Dio to move Jotaro's fingers, but this turns out to be a trick itself to make Dio think that Jotaro truly cannot move. Jotaro uses Star Platinum to counterattack during stopped time. Realizing that Jotaro can only move for a brief moment while time is stopped, Dio stays out of his attack range and attacks using time-stopped knives, landing some hits on Jotaro, who survives by hiding magazines under his clothes. While Jotaro plays dead, Polnareff launches a surprise attack and nearly destroys Dio's brain, only for Dio to stop time and turn his attention to Polnareff. Drawing Dio's attention away from Polnareff, Jotaro uses Star Platinum to stop his own heart, until Dio gets close to him, allowing him to bash Dio's skull. Dio tricks Jotaro into knocking him near where Joseph is. He then drains Joseph's blood and completely assimilates Jonathan's body.\n| LineColor       = FF6347\n}}\n| Aux1            = Ken'ichi Suzuki,Toshiyuki Katō\n| DirectedBy      = Shigatsu Yoshikawa,Shunsuke Machitani,Toshiyuki Katō\n| WrittenBy       = Yasuko Kobayashi\n| OriginalAirDate =\n| AltDate         = August 12, 2018\n| ShortSummary    = The duration of The World's ability has increased as a result of Dio draining Joseph's blood. Dio stops time and brings down a road roller on top of Jotaro. Jotaro stops time at the last second, and uses Star Platinum to break Dio's leg. Star Platinum smashes The World in the same spot as Dio's broken leg, destroying it and Dio in the process. Following the battle, Jotaro works with the Speedwagon Foundation to revive Joseph by transfusing the blood that remained in Jonathan's body, which they later expose to sunlight to ensure Dio is completely destroyed. With their journey finally over, Polnareff returns to France while Jotaro and Joseph return home to Holly, who is making a complete recovery.\n| LineColor       = FF6347\n}}\n}}\nSee also\n*''JoJo's Bizarre Adventure – an original video animation adaptation of Part 3: Stardust Crusaders'' by Studio APPP\nNotes\nReferences\nExternal links\n* [http://jojo-animation.com/sc/ Official website]\n*"
    }
  ]
}