{
  "content": [
    {
      "type": "text",
      "text": "# Jonathan Edwards (Washington & Jefferson College)\n\nJonathan Edwards}}\n| death_place         = Peoria, Illinois\n| alma_mater          = Hanover College\n| profession          =\n| spouse              =\n| children            =\n| website             =\n| signature           = Signature of Jonathan Edwards (1817–1891).png\n| footnotes           =\n| office              = President of Washington & Jefferson College\n}}\nJonathan Edwards (1817–1891) was the sixth president of Hanover College and the first president of Washington & Jefferson College following the union of Washington College and Jefferson College.\nBiography\nEdwards was born in Cincinnati, Ohio on July 19, 1817. He graduated from Hanover College in 1835 and was awarded an A.M. from Hanover in 1839. Edwards taught in Kentucky from 1838 to 1842 before being ordained in the Presbyterian Church in 1844. He served as pastor at various churches in Ohio, Maryland, Indiana, Illinois, Kentucky, New Jersey, and Pennsylvania.\nEdwards served as the sixth president of Hanover College from 1855 through 1857.  Hanover historian Frank S. Baker describes his presidency as \"marked by several difficulties,\" including conflict over fraternities, money problems, and segregation.  Students secretly chartered two fraternities (including Beta Theta Pi), leading to conflict with existing literary societies and with the Board of Trustees.  When construction costs of a new campus building were higher than expected, the Board of Trustees borrowed from the endowment; as a result, \"less than half of professorial salaries were paid when due.\" Near the end of Edwards' presidency, the faculty and trustees rejected an African-American applicant on the basis of race, thus committing the College to a whites-only policy despite earlier support for admitting African Americans.\nOn April 4, 1866, Edwards was elected as the first president of the newly unified Washington & Jefferson College. By the end of his presidency, the college was considering consolidating the two campuses, a direction Edwards supported. Edwards resigned the presidency of W&J on April 20, 1869 to accept a pastoral charge in Baltimore. He died in Peoria, Illinois on July 13, 1891.\nReferences"
    }
  ]
}