{
  "content": [
    {
      "type": "text",
      "text": "# Jordan Waring\n\nJordan Waring (born 1964, New York) is an American composer.\nBiography\nJordan Waring was born on Long Island, New York, and was raised in a musical family. His grandfather, Fred Waring, was a much recorded choral conductor and music publisher.  His father is musician Fred Waring Jr., and his mother is Rachelle Waring, both of whom were professional musicians.\nAs a child, Waring studied trumpet, piano, and percussion and began composing when he was 15 years old. His parents, however, persuaded him to pursue a nonmusical career. He attended Penn State University, then began a career in banking.\nCompositions\nStarting in 1992, Waring began to compose a number of orchestral works. His first symphony was completed in 1993. His Second Symphony (1994) was premiered by the Allentown Symphony Orchestra in Pennsylvania received a good notice. His Bosnian Overture, begun in 1994 and completed in the spring of ´95, written in reaction to the Balkan conflict, was performed by members of the Florida Philharmonic and others at a special concert in aid of civilian victims of the war in Bosnia His first Piano Concerto was completed in the spring of 1995, followed by the tone poem The Mountains of Tolima, a commission from the Conservatory of Tolima, in Ibague, Colombia.\nCritical response\nThe Harbinger of Mobile, Alabama wrote of Waring's music:\n:Waring shows in all these works his willingness simply to write beautiful music. Though they vary in inspiration, form, mood, voices, and other ways, the three pieces are first of all the work of a composer who likes and respects traditional mainstream western notions of what music is supposed to be....\nKurt Loft, a music critic from the Tampa Tribune wrote about Waring,\n:Born in New York in 1964, this young composer-stockbroker shows tremendous promise as a member of the so-called neo-Romantic school of tonality and a solid grasp of large-scale structure... \"Tears of Sarajevo\" is plaintive, introspective and a candidate for live performance in concert halls.\nReferences\nExternal links\n*\n*[https://www.amazon.com/dp/B000004AGT/ Reviews of album on Amazon.com website]"
    }
  ]
}