{
  "content": [
    {
      "type": "text",
      "text": "# Jordan Battle\n\n| birth_place  = Fort Lauderdale, Florida, U.S.\n| height_ft    = 6\n| height_in    = 1\n| weight_lb    = 215\n| high_school  = St. Thomas Aquinas\n| college      = Alabama (2019–2022)\n| draftyear    = 2023\n| draftround   = 3\n| draftpick    = 95\n| pastteams    =\n* Cincinnati Bengals (–present)\n| status       = Active\n| highlights   =\n* PFWA All-Rookie Team (2023)\n* CFP national champion (2020)\n* 2× Third-team All-American (2021, 2022)\n* 2× First-team All-SEC (2021, 2022)\n| statweek     =\n| statseason   = 2024\n| statlabel1   = Total tackles\n| statvalue1   = 129\n| statlabel2   = Sacks\n| statvalue2   = 2.0\n| statlabel3   = Pass deflections\n| statvalue3   = 8\n| statlabel4   = Interceptions\n| statvalue4   = 2\n| statlabel5   = Fumble recoveries\n| statvalue5   = 1\n| pfr          = BattJo00\n}}\nJordan Battle (born December 14, 2000) is an American professional football safety for the Cincinnati Bengals of the National Football League (NFL). He played college football for the Alabama Crimson Tide.\nEarly life\nBattle attended St. Thomas Aquinas High School in Fort Lauderdale, Florida. As a senior he had 27 tackles, three interceptions and a sack. He played in the 2019 Under Armour All-America Game. He originally committed to play college football at Ohio State University but changed his commitment to the University of Alabama.\nCollege career\nBattle played in 13 games and made four starts as a freshman in 2019. He had 30 tackles, one interception and one sack. Battle returned his sophomore year in 2020 as a starter. Battle was ejected from the 2021 College Football Playoff National Championship game for targeting.\nProfessional career\n}}\nBattle was selected by the Cincinnati Bengals in the third round with the 95th overall pick of the 2023 NFL draft.\nHe started the 2023 season as the second strong safety on the depth chart behind Nick Scott. Prior to the Bengals Week 12 matchup against the Pittsburgh Steelers, Bengals' defensive coordinator Lou Anarumo declared Battle the starting strong safety over Scott for the remainder of the season due to his stronger tackling abilities. He finished his first start with eight tackles. The following week against the Jacksonville Jaguars, Battle recorded his first career sack. During the Bengals' final game of the season in Week 18 against the Cleveland Browns, Battle recorded his first career interception as well as his second career sack. Battle completed his first season with 71 total tackles and five pass deflections, and was named to the PFF and PPWA All-Rookie teams.\nIn 2024, during Week 15's road victory against the Tennessee Titans, Battle recorded his first career fumble recovery, and returned the football 60 yards for what initially looked like his first touchdown. However, Battle inadvertently dropped the ball inches before crossing the goal line, sending the ball flying out the end zone for what was ultimately ruled a touchback.\nReferences\nExternal links\n*[https://www.bengals.com/team/players-roster/jordan-battle/ Cincinnati Bengals bio]\n*[https://rolltide.com/sports/football/roster/jordan-battle/7223 Alabama Crimson Tide bio]"
    }
  ]
}