{
  "content": [
    {
      "type": "text",
      "text": "# Joseph E. Howard\n\n| birth_place     =  New York City, New York, United States\n| death_date      =\n| death_place     = Chicago, Illinois, United States\n| origin          =\n| instrument      =\n| genre           = Musical theatre\n| occupation      = Composer, Lyricist, Librettist\n| years_active    =\n| label           =\n| associated_acts =\n| website         =\n}}\nJoseph Edgar Howard (February 12, 1870May 19, 1961) was an American Broadway composer, lyricist, librettist, and performer. A famed member of Tin Pan Alley along with wife and composer Ida Emerson as part of the song-writing team of Howard and Emerson, his hits included \"Hello! Ma Baby\" and Broadway musicals like \"I Wonder Who's Kissing Her Now?\".\nEarly years\nJoseph Howard was born on February 12, 1870 (or 1871), in New York City. He grew up in a gang-terrorized part of the city and was frequently beaten by his father. His mother died when he was 8 years old, and he ran away to a Catholic orphanage, serving as an altar boy and singing in the choir. Avoiding his father, who had discovered the boy's place of refuge, he rode a freight train to Kansas City, Missouri. There he sang in a saloon and sold newspapers. It was in Kansas City that he was discovered by George Walker of Williams and Walker who arranged for Howard to receive voice training. From Kansas City, he went to St. Louis, Missouri, where he had his first taste of the theater.\nCareer\nHoward toured in a stock company production of \"Little Eva,\"  then performed in vaudeville as a boy soprano at the age of 11.  He was married to singer actress Mabel Barrison from 1906 until her death in 1912.\nAt 17, he met a young singer named Ida Emerson who would become his second wife. They played the Midwestern vaudeville circuit, drawing notice enough in Chicago to obtain an engagement in New York at Tony Pastor's Music Hall on 14th Street, where they were a big hit in 1898. Their fortunes improved in 1899 when they wrote the song \"Hello! Ma Baby,\" which became one of the most popular songs of its day, selling over a million copies of the sheet music, the predominant way of making money from music prior to recordings, in just a few months. They found themselves space at the famed Tin Pan Alley where they continued to write songs for vaudeville. They penned another hit, \"Goodbye, My Lady Love,\" in 1904. They moved back to Chicago, where Howard performed and composed his tunes, and produced some of the biggest Chicago musical hit shows from 1905 to 1915.\nHoward produced a string of pop jazz hits, including \"What's the Use of Dreaming?,\" \"I Don't Like Your Family,\"  and \"A Boy's Best Friend Is His Mother\". The tunes that he is most often associated with in modern times are \"Hello! Ma Baby\" and  \"I Wonder Who's Kissing Her Now\".  The latter was a jilted man's waltz that made its debut in the 1909 musical The Prince of To-Night and became the subject of controversy many years later when one of Howard's employees, Harold Orlob, a composer, sued and won the right to remove Howard's name from the piece as its primary composer.\nHoward performed in nightclubs, theaters, radio and television throughout his career. His writing slacked off between 1915 and 1939, then picked up again.\nIn 1939, Howard collaborated with Beatrice Kay, a husky-voiced showgirl, on a radio program called The Gay Nineties Revue, which revisited his hits from the turn of the century and the teens, which by then had become nostalgic American entertainment for listeners during the Big Band Era.\nHe made recordings for the Decca and Vocalion labels in the late 1940s.\nIn 1947, a motion picture was produced based on Howard's biography called ''I Wonder Who's Kissing Her Now'', starring Mark Stevens, with Buddy Clark taking on the singing chores. The film generated legal controversy when Harold Orlob, a former employee sued, proved his authorship of the composition, and won the right to remove Howard's name from the song.\nHoward hosted the early live television series The Gay Nineties Revue (ABC, 1948–1949).\nIn the late 1950s, he published an autobiography entitled Gay Nineties Troubadour.\nHoward died on stage in Chicago while singing \"Let Me Call You Sweetheart\" during a curtain call on May 19, 1961.\nLegal controversy\nAfter the release of the movie ''I Wonder Who's Kissing Her Now, Harold Orlob sued Howard, claiming that he had penned the tune when he worked for Howard in Chicago as a writer of additional songs for the musical The Prince of To-Night'' (1909). Orlob won his suit, which sought no compensation but asked to have Howard's name removed as the primary composer and his put on to the credits for the song as the lead composer.\nAwards and accolades\nIn 1970, Howard was inducted into the Songwriters Hall of Fame by the ASCAP Hall of Fame Committee.\nSongs\nCollaborating with songwriters such as wife Ida Emerson, Frank R. Adams, Will Hough and Harold Orlob, Howard produced such hits as:\n* \"Peerless March\" - 1916\n* \"When Our Boys Come Marching Home\" - 1917\n* \"It Won't Be Long Before We're Home\" - 1918. L: Paul Cunningham\n* \"Hello! Ma Baby\"\n* \"A Boy's Best Friend is His Mother\"\n* \"Goodbye, My Lady Love\"\n* \"There's Nothing Like a Good Old Song\"\n* \"Somewhere In France Is the Lily\" - 1917. m: Philander Chase Johnson\n* \"On a Saturday Night\"\n* \"Can't Get You Out of My Mind\"\n* \"Love Me Little, Love Me Long\"\n* \"Montana\"\n* \"Silver in Your Hair\"\n* \"Whistle a Song\"\n* \"On the Boulevard\"\n* \"San Francisco Frizz\"\n* \"An Echo of Her Smile\"\n* \"I Don't Like Your Family\"\n* \"Blow the Smoke Away\"\n* \"What's the Use of Dreaming?\"\n* \"When You First Kiss the Last Girl You Love\"\n* \"Honeymoon\"\n* \"Be Sweet to Me, Kid\"\n* \"Tonight Will Never Come Again\"\n* “Cross Your Heart\"\n* \"I Wonder Who's Kissing Her Now\"\nHoward also wrote the stage scores for:\n* The Land of Nod\n* The Time, the Place and the Girl\n* The Girl Question\n* A Stubborn Cinderella\n* The Goddess of Liberty\n* The Prince of Tonight\n* Maurice Chevalier in an Evening of Songs and Impressions\n* Tintypes\nHoward also wrote the music and lyrics for \"Goodbye, My Lady Love\", featured in the original production of Show Boat (1927).\nHoward also composed \"It Won't Be Long Before We're Home\".\nReferences\nFurther reading\n*Howard, Joseph E. ''Gay Nineties Troubador: Autobiography of Joe Howard, American Composer of I Wonder Who's Kissing Her Now?'' Miami Beach, FL: Joe Howard Music House, 1956.\nExternal links\n*\n*\n*\n*[https://www.loc.gov/jukebox/artists/detail/id/1616/ Joseph E. Howard] at the National Jukebox\n*Joseph Edgar Howard at FindAGrave:  *[https://www.findagrave.com/memorial/125101553/joseph-edgar-howard]"
    }
  ]
}