{
  "content": [
    {
      "type": "text",
      "text": "# Joseph Smith 1844 presidential campaign\n\nThe campaign of Latter Day Saint movement founder Joseph Smith and his vice presidential running mate, Church of Jesus Christ of Latter Day Saints First Presidency first counselor Sidney Rigdon, took place in 1844. The United States presidential election of that year was scheduled for November 1 to December 4, but Smith was killed in Carthage, Illinois, on June 27. Smith was the first Latter Day Saint to seek the presidency, and the first American presidential candidate to be assassinated.\nIn 1844, Smith was the mayor of Nauvoo, Illinois, which was then the second most populous city in Illinois with 12,000 residents. Latter Day Saint leaders requested that adherents vote in a bloc behind candidates endorsed by church leaders. As a result, the city's Latter Day Saint residents held the balance of power between the Democrats and Whigs in state elections. Smith also commanded a quasi-public military force, the Nauvoo Legion, that with 2,500 men was almost one-third the size of the U.S. Army. Wicks and Foister argue in Junius and Joseph that political operatives with ties to Smith's Whig opponent Henry Clay were present at events surrounding the raid on the jail where Smith was awaiting trial for treason, among other charges.\nIn his campaign platform, Smith proposed to gradually end slavery, to reduce the size of Congress, to re-establish a national bank, to annex Texas, California, and Oregon, to reform prisons, and to authorize the federal government to protect the liberties of Latter Day Saints and other minorities.\nMotivations, prospects, and effects\nMotivations that have been cited for Smith's candidacy include wanting to give the Saints a candidate they could support in good conscience; avoiding a political party fiasco between the Whigs and Democrats in Illinois; publicizing the Latter Day Saint cause to help obtain redress for Church members' lost property in Missouri; and bringing the tenets of the church and the political ideas of its prophet to the attention of the nation. Another effect of the campaign was to protect the Twelve Apostles, including Brigham Young, from mob violence, since in the faraway places such as Boston where they were traveling, they were out of reach of the Carthage mob. John Taylor and Willard Richards were the only two apostles left behind in Nauvoo. On the other hand, George R. Gayler notes that the absence of Mormon leaders such as Young, Heber C. Kimball, Orson and Parley P. Pratt, Orson Hyde, and John D. Lee, was a great disadvantage to Smith when he was arrested and imprisoned at Carthage, and that these missing apostles were then hurriedly recalled, but arrived at Nauvoo too late. He also notes that Mormon political conventions in Boston and Dresden, Tennessee, ended in riots, and that judging \"from the troubles in Illinois, Massachusetts and Tennessee due largely to the announcement of his candidacy, the United States may have been saved from the bloodiest election in its history by the death of the Prophet.\"\nScholars have debated what Smith thought his chances of winning were. At the same time that Smith was running for president, he was also making plans to move the Saints from Nauvoo to Texas or Oregon, for the safety of them and their property. Historian Richard Bushman argues that Smith started out as a protest candidate but then began to suspect that victory might be attainable. Smith wrote in his journal, \"There is oratory enough in the church to carry me into the presidential chair on the first slide\" and \"When I look into the Eastern papers and see how popular I am, I am afraid I shall be president.\"\nEvents\nIllinois, where the Latter Day Saint population was in a position to play a pivotal role in presidential politics, had been a battleground state in the 1840 United States presidential election, and Latter Day Saints anticipated it might be again in 1844.\nIn 1843, Smith sent letters to John C. Calhoun, Lewis Cass, Richard Mentor Johnson, Henry Clay, and Martin Van Buren, the five leading contenders for the presidency, inquiring about their plans for ending the persecution that the Mormons were suffering in Missouri. Only Calhoun, Cass, and Clay responded to Joseph Smith's letters, and they did not commit to helping the Latter Day Saints. Smith wrote scathing replies to these letters, denouncing the subterfuges of politicians.\nOn January 29, 1844, Smith held a meeting in the mayor's office at Nauvoo with the Quorum of the Twelve Apostles and others. It was unanimously decided that Smith would run for president on an independent platform. Smith remarked, \"I would not have suffered my name to have been used by my friends on any wise as President of the United States, or candidate for that office, if I and my friends could have had the privilege of enjoying our religious and civil rights as American citizens, even those rights which the Constitution guarantees unto all her citizens alike.\" On March 11, 1844, Smith organized the Council of Fifty, a deliberative political body to promote Smith's candidacy.\nDue to the requirement in the Twelfth Amendment to the United States Constitution that each elector cast at least one of his votes (for president and vice president) for a candidate who is not an inhabitant of the same state as himself, Smith wanted to choose a running mate who was not a resident of Illinois. New York educator James Arlington Bennet was invited to be Smith's running mate, but the invitation was withdrawn due to a misunderstanding regarding Bennet's supposed birth in Ireland, which would have made him ineligible for the presidency under the Constitution's natural-born-citizen clause. Colonel Solomon Copeland, a state legislator and wealthy and prominent resident of Paris, Tennessee, was then offered the position, but he declined. Rigdon, a Pennsylvanian, then became Smith's running mate.\nAt the April 9, 1844 church general conference, a call was made for volunteers to electioneer for Joseph Smith to be the next president. Hundreds of elders volunteered, and the Quorum of the Twelve scheduled public political conferences in each state. Electioneers included Wilford Woodruff, Franklin D. Richards, Heber C. Kimball, Moses Tracy and his wife Nancy, John D. Lee, Ezra T. Benson, Norton Jacob, James Burgess, Edson Barney, George Miller, Joseph Holbrook, and David Pettegrew, among others. Smith enlisted the entire manpower of the church in the campaign. Smith presidential electors were appointed and D. S. Hollister was sent to Baltimore to observe and possibly lobby for the Smith candidacy at the Whig and Democratic national conventions.\nThe Latter Day Saints formed a new political party, the Reform Party, that held a nomination convention on 17 May which was attended by delegates from all 26 states and ten Illinois counties. The nomination of Smith and Rigdon was uncontested, and a platform was adopted stating that the party would support Smith for the presidency, \"the better to carry out the principles of liberty and equal rights, Jeffersonian democracy, free trade, and sailors' rights, and the protection of person and property.\" Arrangements were entered into to hold a national convention in New York on 13 July.\nMany of the electioneers used the campaign as a proselytizing opportunity as well as a political mission, and therefore continued on their mission of preaching, baptizing, visiting church branches, and curbing apostasies after Smith's death ended the campaign. They began referring to Smith as a martyr.\nPlatform\nplatform was the result of a collaboration between Smith, W.W. Phelps (pictured), and possibly John M. Bernhisel.]]\nSmith's platform was published in the pamphlet \"Views of the Powers and Policy of the Government of the United States\", which his electioneers distributed and presented in public and private meetings, and read to congregations of the church and the general public.\nIn a change from the strongly anti-abolitionist stance that he had previously adopted, Smith proposed the abolition of slavery by the year 1850 through compensated emancipation funded with revenue from the sale of public lands, and with the savings from cutting the salaries of members of the United States Congress from $8/day to $2/day. Smith explained, \"The Southern people are hospitable and noble. They will help to rid so free a country of every vestige of slavery, whenever they are assured of an equivalent for their property.\" Smith's compensated emancipation proposal was reportedly well received in Kentucky.\nAlthough Smith warned, \"Speculators will urge a national bank as a savior of credit and comfort,\" he also put forward his own proposal for a national bank, which would operate on a principle of full-reserve banking. The mother bank's capital stock would be owned by the federal government, and the bank's branches would be owned by their respective states. The officers and directors would be elected annually by the people. Smith proposed the adoption of a \"judicious tariff\" to protect agriculture, manufactures, navigation, and commerce.\nSmith also called for a reduction in the size of the United States House of Representatives to two members per million of population, believing that a smaller body would \"do more business than the army that now occupy the halls of the national legislature.\" More generally, he warned, \"No honest man can doubt for a moment but the glory of American liberty is on the wane\" and exhorted the people, \"Curtail the officers of government in pay, number, and power\". He argued, \"More economy in the national and state governments would make less taxes among the people\". Praising the vision of the \"respected and venerable Thomas Jefferson\", he remarked, \"what a beautiful prospect an innocent, virtuous nation presents to the sage's eye where there is space for enterprise, hands for industry, heads for heroes, and hearts for moral greatness.\"\nSmith advocated reforming the penal system by mostly abolishing prisons, including debtor's prisons, and using the buildings for \"seminaries of learning\" so that intelligence would banish barbarism. Smith suggested reforming criminals through \"reason and friendship\" and wrote, \"Petition your State legislatures to pardon every convict in their several penitentiaries, blessing them as they go, and saying to them, in the name of the Lord, Go thy way, and sin no more. Advise your legislators, when they make laws for larceny, burglary, or any felony, to make the penalty applicable to work upon roads, public works, or any place where the culprit can be taught more wisdom and more virtue, and become more enlightened.\" Smith advocated elimination of courts martial, proposing that deserters instead be given their pay and dishonorably discharged, never again to merit the nation's trust.\nSmith called for a day when \"the neighbor from any State or from any country, of whatever color, clime, or tongue, could rejoice when he put his foot on the sacred soil of freedom, and exclaim, The very name of American is fraught with friendship!\" With regard to territories that opted to remain outside the federal union, Smith opined that \"wisdom would direct no tangling alliance\". Smith suggested as an alternative accepting into the union Texas, California, and Oregon, as well as other countries, with the consent of the peoples concerned, including any Indians inhabiting the land. He remarked:\nSmith advocated granting of power to the president to suppress mobs without waiting for a request from state governors (as required by Article Four of the Constitution), on the principle that \"The governor himself may be a mobber; and instead of being punished, as he should be, for murder or treason, he may destroy the very lives, rights, and property he should protect.\" Smith favored a constitutional amendment providing for capital punishment of public officials who refused to assist those denied their constitutional rights. He wrote, \"The state rights doctrines are what feed mobs.\"\nSee also\n*1844 United States presidential election\nFurther reading\n*McBride, Spencer W. (2020). \"'Many Think This Is a Hoax': The Newspaper Response to Joseph Smith's 1844 Presidential Campaign\", in Spencer W. McBride, Brent M. Rogers, and Keith A. Erekson, Contingent Citizens: Shifting Perceptions of Latter-day Saints in American Political Culture. Cornell University Press. .\n*\n*Sainsbury, Derek R. (2020). ''Storming the Nation: The Unknown Contributions of Joseph Smith's Political Missionaries.'' BYU Religious Studies Center and Deseret Book. ISBN 978-1944394929.\nReferences\nExternal links\n*[https://www.gutenberg.org/files/50302/50302-h/50302-h.htm#APPENDIXIII Views of the Powers and Policy of the Government of the United States]"
    }
  ]
}