{
  "content": [
    {
      "type": "text",
      "text": "# Jose Maria Panganiban Monument\n\n| restore       =\n| dismantled    =\n| dedicated_to  = Jose Maria Panganiban\n| coordinates =\n| website       =\n| extra_label   =\n| extra         =\n}}\nThe monument to Jose Maria Panganiban is in front of the Gabaldon building at the Naga Central School 1, Naga, Camarines Sur, Philippines, and was erected in 1930 by the school's Parents-Teachers Association, 30 years after his death. It is said to be the oldest existing monument of the Bicolano hero. It has been neglected for years and was scheduled for demolition had it not been for the timely intervention of a Naga City councilor during an inspection of the heritage building.\nMonument history\nIn 1930, the Parents-Teachers Association of the Naga Central School decided to build the monument of Jose Maria Panganiban 30 years after his death to perpetuate his heroism among the youth and students. The Association was led by Mr. Casimiro Perfecto who also spearheaded the construction of the monument. This is evident in the September 27, 1930, issue of local newspaper \"Sanghiran nin Bikol\", where the minutes of the meeting were written about the inauguration of the monument. A program on the inauguration was preserved and is now in the Holy Rosary Minor Seminary museum.\nIn late 2013, an unmarked monument was discovered by city councilor Nathan Sergio to be that of Jose Maria Panganiban in front of the Gabaldon building inside the Naga Central School. It is said to be the oldest monument of Panganiban built by the Parent-Teachers Association in 1930. (A confirmation by the National Historical Commission of the Philippines is being awaited and the local government petitioned the NHCP to make it a National Historical Landmark)  The Naga City government lost no time in restoring the place and on January 23, 2014, commemorated the hero’s 150th birth anniversary with parade, wreath-laying, exhibit and lectures on the life and times of the Bicolano hero.\nDescription\nThe monument was cast in concrete with the bust of Jose Maria Panganiban on top dressed in western style coat. Below him are two figures of school boy and girl dressed in their uniform looking up on him as gesture of being their model of virtue and patriotic idealism. The two kids stand on a concrete pedestal. Between them is the dedication marker of the PTA members to JoMaPa. Below their feet are rose ornamentation design around the pedestal. The monument stand on tiered steps and on the base is a descriptive plaque of the names of the PTA officers circa 1930.\nReferences"
    }
  ]
}