{
  "content": [
    {
      "type": "text",
      "text": "# Joseph Ward (Marlborough politician)\n\n|death_place         = Blythefield, Blenheim, New Zealand\n| spouse             = Martha Redwood\n| relations          = Henry Redwood (brother-in-law)Francis Redwood (brother-in-law)\n| children           =\n|party               = Independent\n}}\nJoseph Ward (1817 – 12 November 1892) was a 19th-century Member of Parliament from Marlborough, New Zealand.\nEarly life\nWard was born at Tixall in Staffordshire, England. He was baptised at Tixall on 21 August 1817. He emigrated to Nelson in 1842 on the George Fyfe. He travelled with his wife, Martha, and her family; Henry Redwood and Francis Redwood were her brothers. He was a devout Catholic. Since 1854, he had lived in Brookby, a locality some  south of Renwick.\nWard was a surveyor by trade, and he surveyed parts of the Wairau Valley, and the town and district of Kaikōura. He became a significant runholder who at one point had 46,000 sheep.\nPolitical career\n|end        =\n|term       = 5th\n|electorate =\n|party      = Independent politician\n}}\nWard was elected to the first Nelson Provincial Council for the Wairau electorate; he and Charles Elliott were declared elected unopposed. Ward represented the Wairau electorate for five years. When the Marlborough Province split off from Nelson, Ward was elected onto the Marlborough Provincial Council and had continuous representation until the abolition of the provincial system in 1876. Ward's first attempt of getting elected to the general assembly was in the 1872 Wairau by-election, but he was beaten by Arthur Seymour. When Seymour resigned in 1875 prior to a trip to England, Ward won the resulting  and represented the electorate from 21 June to 6 December, when he was defeated for Cheviot.\nDeath and commemoration\nWard had been ill for a few months prior to his death, and for the last few days was unconscious. He died on 12 November 1892 at his home. He was buried in the catholic section of the Omaka Cemetery with his son Joseph and daughter Francis. He was survived by his wife, six sons, and two daughters.\nWards Pass, an alpine pass that lies between the valleys of the upper Acheron and Awatere Rivers, was discovered by Ward and his brother-in-law, Cyrus Goulter, in March 1847, and is named after him.\nNotes\nReferences\n*\n*\n*"
    }
  ]
}