{
  "content": [
    {
      "type": "text",
      "text": "# Joseph Ewart\n\nJoseph Ewart FRSE (30 April 1759 – 27 January 1792) was a Scottish diplomat, mainly based in Berlin in Prussia (now Germany) .\nEarly life\nEwart was born on 30 April 1759, the eldest son of Mary (née Corrie) and Rev. John Ewart, the minister of Troqueer in Kirkcudbrightshire. He was educated at Dumfries Parish School then went to the University of Edinburgh, and then acted as travelling tutor to Macdonald of Clan Ronald.\nAdult life\nWhile abroad, Ewart made the acquaintance of Sir John Stepney, British minister at Dresden, and after that diplomat was transferred to Berlin, Ewart became his private secretary and then secretary of legation. After acting as chargé d'affaires from 1787 to 1788, he was appointed envoy extraordinary and minister plenipotentiary to the King of Prussia on 5 August 1788.\nService in Prussia\nPitt's design, assisted by Lord Malmesbury, was to induce Frederick William of Prussia to intervene in the affairs of Holland; to put down the revolutionary party there; and to re-establish the Prince of Orange as a stadt-holder. This design was carried out, and Ewart obtained much credit for his share in the transactions. Of his subsequent conduct at the court of Berlin there are contradictory reports, for the French revolution commenced in 1789, and partisans and opponents of the English foreign policy of that period represent the minister's behaviour in different lights. Ewart was accused of adopting too peremptory an attitude towards the King of Prussia and his ministers, thus alienating them from England. He succeeded in concluding the marriage treaty between the Duke of York and the eldest daughter of the King of Prussia, and received warm acknowledgments from the king. His health breaking down, he resigned on a pension of 1,000l. a year and a promise of the Order of the Bath. He left Berlin on 3 November 1791. He died at his brother's house in Bladud's Buildings, Bath, on 27 January 1792, and was buried in Bath Abbey, where a tablet is erected to his memory. A statement that he died out of his mind, and another (by Wraxell) that his death was due to foul play of the Empress Catherine, are entirely disproved by facts preserved in the family papers.\nPersonal life\nIn 1785 he married the Countess Wartensleben, with whom he had two daughters, and a one son (later Lieutenant General) John Frederick Ewart. John Frederick married Lavinia Brisbane, daughter of Charles Brisbane and their children included the military leaders John Alexander Ewart and Charles Brisbane Ewart.\nIn 1790 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were John Robison, John Playfair and Robert Kerr.\nHe died at Bladud's Buildings in Bath and is buried in Bath Abbey.\nReferences"
    }
  ]
}