{
  "content": [
    {
      "type": "text",
      "text": "# Joseph Palmer (American Revolutionary War general)\n\n|birth_place      =Shaugh Prior, Devonshire, England\n|death_date       =\n|death_place      =Dorchester, Massachusetts, U.S.\n|placeofburial    =\n|placeofburial_label =\n|placeofburial_coordinates =\n|allegiance       =\n|branch           =\n|branch_label     =\n|serviceyears     =\n|serviceyears_label =\n|rank             =\n|rank_label       =\n|servicenumber    =\n|unit             =\n|commands         =\n|known_for        =\n|battles          =\n* American Revolutionary War:\n** Siege of Boston\n** Battle of Lexington\n** Battle of Bunker Hill\n|battles_label    =\n|awards           =\n|memorials        =\n|alma_mater       =\n|spouse           =\n|children         = Elizabeth, Mary, and Joseph Pearse Palmer\n|relations        = Nathaniel Peabody (son-in-law), Elizabeth Palmer Peabody, Mary Tyler Peabody Mann, and Sophia Amelia Peabody Hawthorne (granddaughters)\n|module           =\n}}\nJoseph Palmer (March 31, 1716 – December 25, 1788) was an English-American general during the American Revolutionary War, beginning with the Siege of Boston and the Battle of Lexington. A Cambridge Committee of Safety member, he issued the Lexington Alarm dispatch for Israel Bissell to ride to warn that the war with Britain had begun. Palmer went on intelligence-gathering missions in Vermont and Rhode Island. George Washington issued letters of commendation to Palmer for his service.\nPalmer made a fortune before the war, and lost it after the war. Due to the kindness of Abigail Adams, his wife Elizabeth and their daughters lived at her Old House (in Quincy, Massachusetts) after Palmer's death. Elizabeth died two years later. His son Joseph Pearse Palmer attended Harvard College, participated in the Boston Tea Party, and fought with his father during the war. Joseph Pearse Palmer and Elizabeth Hunt Palmer were the parents of Elizabeth Palmer Peabody, Mary Tyler Peabody Mann, and Sophia Amelia Peabody Hawthorne.\nEarly life and marriage\n, Devonshire, England, birthplace of Joseph Palmer]]\nPalmer was born at Shaugh Prior, Devonshire, England, on March 31, 1716, a son of John and Joan Palmer, née Pearse. He married Mary Cranch in 1746 and emigrated to Massachusetts later that year with his brother-in-law Richard Cranch.\nPalmer and Mary had two daughters, Mary (Polly) and Elizabeth. Their son Joseph Pearse Palmer attended Harvard College. He participated in the Boston Tea Party (December 16, 1773). Joseph tutored Elizabeth Hunt in history, geography, and arithmetic, meeting secretly. He courted her, and the couple eloped in 1772. They first lived in Watertown and then Germantown. The Palmers had nine children, one of whom was Elizabeth Palmer, wife of Nathaniel Peabody and mother of Elizabeth Palmer Peabody, Mary Tyler Peabody Mann, and Sophia Amelia Peabody Hawthorne. Elizabeth taught her daughters the three Rs when they were young and read William Shakespeare to them. Son Joseph was good friends with Royall Tyler, who lived with the Palmers in their Boston boardinghouse.\nMassachusetts Bay Colony\nIn 1752, Palmer and his brother-in-law built a glassworks in Germantown, now a part of Quincy, Massachusetts. Later, they built a chocolate mill and spermaceti and salt factories. Palmer bought his brother-in-law's interests in the businesses by 1760.\n, Official Presidential portrait of John Adams, circa 1792, Blue Room, White House. Adams was a neighbor and a friend. After Palmer died, Adam's wife Abigail let Elizabeth Palmer and her daughters live in their \"Old House\".]]\nBy the 1770s, Palmer had become a supporter of American independence, and he was friends with his neighbor John Adams. Palmer served in the Massachusetts Provincial Congress and on the Cambridge Committee of Safety.\nRevolutionary War\nPalmer served as an officer of the American patriot militia when the Revolutionary War broke out with the Siege of Boston on April 19, 1775. Issuing the Lexington Alarm, Palmer sent Israel Bissell on his ride to warn and rally colonists that the war with Britain had begun.\nTo all the friends of American liberty be it known that this morning before break of day, a brigade, consisting of about 1,000 to 1,200 men landed at Phip's Farm, at Cambridge, and marched to Lexington, where they found a company of our colony militia in arms, upon whom they fired without any provocation, killed six men and wounded four others. — By an express from Boston, we find another brigade are now upon their march from Boston, supposed to be about 1,000. The Bearer, Israel Bissell, is charged to alarm the country quite to Connecticut, and all persons are desired to furnish him with fresh horses, as they may be needed. — I have spoken with several persons who have seen the dead and wounded; pray let the delegates from this colony to Connecticut see this, they know Col. Foster of Brookfield one of the delegates.|J. Palmer, one of the Committee of S.}}\n, The Battle of Lexington (April 19, 1775), oil on canvas, 1910, National Army Museum]]\nOn the same day, Palmer fought at the Battle of Lexington and later fought against the British as they retreated from Concord. He first served as captain of the 2nd Massachusetts Regiment and as the war progressed, he was promoted to lieutenant colonel and then colonel in the Massachusetts militia on February 2, 1776. His son John fought with him in 1775.\nOn July 17, 1775, Palmer fought during the Battle of Bunker Hill. He continued to fight during the Siege of Boston until the British withdrew on March 17, 1776. At that time, he was a colonel of the militia from Suffolk County, Massachusetts. Palmer was commissioned as brigadier-general of the Massachusetts militia on May 9, 1776, and went on intelligence-gathering missions in Vermont and Rhode Island. George Washington issued letters of commendation to Palmer for his service. In February 1777, he led a successful raid on Newport, Rhode Island that the British held. In October, he led a failed amphibious offensive attack on Newport.\nLater years\nAfter the war, he \"suddenly lost his fortune\". Heavy debt forced him to leave Germantown, and he started a salt factory on the Boston Neck in 1784, which was a success. But he was not able to pay off all of his debts by the time that he died. Palmer died four years later at his home in Dorchester, Massachusetts, on December 25, 1788.\n\" of John and Abigail Adams, Quincy, Massachusetts, Adams National Historical Park operated by the National Park Service]]\nFollowing his death, Mary moved into Abigail Adams's house, called the Old House (in Quincy, Massachusetts), with her daughters Elizabeth and Polly. In a letter to Abigail Adams, Mary Smith Cranch wrote, \"I have been there but a few moments since. They appear to be much gratified with their situation.\" Mary died in February 1790.\nReferences"
    }
  ]
}