{
  "content": [
    {
      "type": "text",
      "text": "# Journal of Historical Review\n\nThe Journal of Historical Review was a non-peer reviewed, pseudoacademic, neo-Nazi periodical focused on promoting Holocaust denial. It was published by the Institute for Historical Review (IHR), based in Torrance, California. It ran quarterly from 1980 until 1992, and then bimonthly from 1993 until publication ceased in 2002. A supplement, IHR Newsletter (), was published alongside the journal.\nHistory\nThe journal was founded in 1978 by the far-right political activist Willis Carto. Its subject was primarily Holocaust denial. Writer Spencer Sunshine described it as the \"premier Holocaust denial publication in the United States\". Its editor from February 1983 to February 1985 was Keith Stimely, until he quit the IHR. The impetus for this was his claim that Carto had, without consulting him, removed part of an article by Robert Faurisson that was critical of David Irving (both Holocaust deniers) from the Journal of Historical Review. In 1985, Mark Weber joined the institute's editorial advisory committee and, between 1992 and 2000, he was editor of the Journal.\nThe journal became a platform for neo-Nazis around the world, with the editorial board composed of Holocaust deniers, including Germans Udo Walendy, Wilhelm Stäglich, and Georg Franz-Willing); French Robert Faurisson and Henri Roques; Argentinian W. Beweraggi-Allende, Australian John Tuson Bennett; Spanish Enrique Aynat); Italian Carlo Mattogno; and American M. A. R. Barker.\nThe journal commenced publication in the spring of 1980 as a quarterly periodical. No issues were published between April 1996 and May 1997; it thereafter continued until 2002.  After publication of the journal ceased, the IHR publishes its Bulletin only in an online format, although back issues are still made available on the Institute website.\nReception\nThe Journal's critics have included the Anti-Defamation League, the Danish Center for Holocaust and Genocide Studies, and scholars including Robert Hanyok, a National Security Agency historian, and many others who have described the journal as pseudo-scientific.\nJonathan Petropoulos wrote in The History Teacher that the \"[journal] is shockingly racist and antisemitic: articles on 'America's Failed Racial Policy' and anti-Israel pieces accompany those about gas chambers... They clearly have no business claiming to be a continuation of the revisionist tradition, and should be referred to as 'Holocaust Deniers'.\"\nRussian historians Igor Ryzhov and Maria Borodina commented that the fact that the Institute for Historical Review published its own historical journal \"helped not only to unite the deniers into a single movement, but also to give their activities a form of pseudo-scientificness.\"\nThe Organization of American Historians commissioned a study of the journal in which a panel had found that it was \"nothing but a masquerade of scholarship\".\nReferences\nWorks cited\n*\n*\nExternal links\n*"
    }
  ]
}