{
  "content": [
    {
      "type": "text",
      "text": "# Joyce Howard\n\n| birth_place  = London, England\n| death_date   =\n| death_place  = Santa Monica, California\n| occupation   = Actress, writer, story analyst\n| spouse       = Basil Sydney( 1946;  1958)Joel Shor( 1961;  19??)\n| children     = 3; Rowena and two others from her first marriage\n}}\nJoyce Howard (28 February 1922 – 23 November 2010) was an English actress, writer, and film executive.\nActing career\nAfter studying at RADA, she was spotted by film director Anthony Asquith in a play at London's Embassy Theatre. He cast the 19-year-old in Freedom Radio (1941), and starring roles in films followed, including opposite James Mason in The Night Has Eyes and They Met in the Dark, the former winning her rave reviews.\nShe was also active in theatre, including Romeo and Juliet at the Old Vic and in A Streetcar Named Desire. She performed in London throughout World War II, even as Nazis were bombing the city.\nWriting career and personal life\nIn 1950, after 13 films, she more or less retired from acting to raise her three children by actor Basil Sydney. Howard also began a second career as a writer. She wrote three well-received novels, Two Persons Singular (1960), A Private View (1961) and Going On (2000). She also wrote plays, including Broken Silence, which was produced by the BBC. After her divorce from Sydney, Howard married American psychoanalyst Joel Shor, and moved to California in 1964.\nAlthough the couple eventually separated, Howard remained in California. To support her family as a single mother, she embarked on a third career as a story analyst for network television. She was promoted to executive and story editor at Paramount Pictures and Paramount TV, eventually becoming responsible for property acquisition and development.\nShe also continued to write for television and wrote original treatments for the miniseries The Whiteoaks and ''Picasso's Painted Ladies''. At the request of Henry Miller's widow, Howard collated, edited and wrote the introduction to Letters by Henry Miller to Hoki Tokuda Miller (1986).\nFilmography\n{| class=\"wikitable\"\n|-\n! Year\n! Title\n! Role\n! Notes\n|-\n|1941|| Freedom Radio || Elly ||\n|-\n|1941|| Love on the Dole || Helen Hawkins ||\n|-\n|1941|| The Common Touch || Mary ||\n|-\n|1942|| Back-Room Boy || Betty ||\n|-\n|1942|| The Night Has Eyes || Marian Ives ||\n|-\n|1942|| Talk About Jacqueline || June Marlow ||\n|-\n|1943|| The Gentle Sex || Anne Lawrence ||\n|-\n|1943|| They Met in the Dark || Laura Verity ||\n|-\n|1946|| They Knew Mr. Knight || Freda Blake ||\n|-\n|1946|| Appointment with Crime || Carol Dane ||\n|-\n|1947|| Woman to Woman || Nicolette Bonnet ||\n|-\n|1947|| Mrs. Fitzherbert || Maria Fitzherbert ||\n|-\n|1950|| Shadow of the Past || Lady in Black ||\n|}\nReferences\nExternal links\n*\n* [https://www.telegraph.co.uk/news/obituaries/culture-obituaries/film-obituaries/8197814/Joyce-Howard.html Obituary in The Telegraph]\n* [https://www.theguardian.com/film/2010/dec/29/joyce-howard-obituary Obituary in The Guardian]"
    }
  ]
}