{
  "content": [
    {
      "type": "text",
      "text": "# Joymoti Konwari__disambig_1\n\nJoymoti}}\n-->\n| birth_place =  Madurigaon, Sivasagar, Assam\n| death_date  =\n| death_place = Jerenga Pathar, Sivasagar\n| nationality =\n| other_names =\n| known_for   =\n| occupation  =\n| spouse      = Gadadhar Singha\n| children    = Lai Lechai\n| parents     = Laithepena Borgohain and Chandradaru\n}}\nJoymoti Konwari was the wife of Ahom prince Gadapani (later Supatphaa).  She died at the hands of the royalists under Sulikphaa Loraa Roja without disclosing her exiled husband Gadapani's whereabouts in the Naga Hills, thereby enabling her husband to rise in revolt and assume kingship.\nBiography\nJoymoti was born in the middle of the 17th-century in Maduri to Laithepena Borgohain and Chandradaru.  She was married to Langi Gadapani Konwar, later an Ahom king, Supatphaa, who established the Tungkhungia line of kings.\nA few buranjis mention her but not as Joymati but only as a nameless Gadapani’s wife. Most of what is known about her life is obtained from the ballads and folklore popular among the people of Upper Assam and not on actual evidence.\nLegacy\nSince the early 20th-century literary figures such as Padmanath Gohain Baruah and Lakshminath Bezbaruah transformed  the \"ordinary story\" of Joymati into a \"fictional tale\" of a female hero's moral victory against the male military might and as a representation of the Ahom glory.\nThe story of Joymati attained a  new fame when it was filmed in 1935 by Jyotiprasad Agarwala.\nBy 1918, Joymoti  came to be seen as a virtuous Hindu women with Kumudeswar Barthakur first bestowing the title of Sati\nupon Jaymati and publishing Jaymati Kahini (1918) in which she was represented as the embodiment of Hindu female chastity, devoted to her husband and dharma. This depiction of her by Barthakur was an effort to \"Indianise\" her character away from her Tai roots.\nMemorials and monuments\nJoysagar Tank\nJoymoti and Gadadhar Singha's eldest son Rudra Singha (Sukhrungphaa, 1696–1714) succeeded his father. In honour of the memory of his mother Joymoti, Rudra Singha built the Joysagar Tank in 1697 at Sibsagar. It is believed to be the biggest man-made lake in India, comprising an area covering  of land, including its four banks, out of which  is filled with fresh water. A 2&nbsp;km-long earthen water pipeline once ran from the tank to the Rangpur Palace (Kareng Ghar), supplying water to the royal palace.\nFakuwa Dol\nRudra Singha also built the Fakuwa Dol in 1703–04, a pyramid-shaped temple constructed before the Rangnath (Shiva) Temple on the banks of the Joysagar Tank. It is said that Rudra Singha, once again to perpetuate the memory of his mother Soti Joymoti, constructed the temple and placed a golden idol of her within it. The circumference of the Dol was about , and its height from base to top was . There were eight brick pillars around the temple.\nJoymoti Day\nSati Joymoti Divas, commemoration day of Joymoti, is held annually in Assam on 27 March.\nSati Joymoti Award\nThe State Government of Assam has instituted an annual award in the name of Joymoti, presented to women in recognition of excellence in their chosen fields of work.\nFilm and theatre\nas Joymoti)]]\nJoymoti (1935 film) was the first Assamese language film, directed and produced by Jyoti Prasad Agarwala. In 2006, Manju Borah released another film by the same name. The 19th-century Assamese writer Lakshminath Bezbaruah depicted her life in the drama Joymoti Kuwori.\nSee also\n* Sati Sadhani\n* Ahom Dynasty\nNotes\nReferences\n*\n*\n*\nExternal links\n* [https://archive.today/20130628171257/http://www.assamtribune.com/scripts/details.asp?id=mar3109/edit3 Joymoti Konwari: an epitome of ideal womanhood] – Dr Kathita Hatibaruah"
    }
  ]
}