{
  "content": [
    {
      "type": "text",
      "text": "# Józef Lewartowski\n\nJózef Lewartowski (, birth name: Aron Finkelstein ; May 1895 Bielsk Podlaski - 25 August 1942 Warsaw) was a Polish communist politician of Jewish origin, revolutionary, member of the KPP and PPR one of the first organizers of the Jewish resistance in Nazi occupied Poland, co-founder of the Anti-Fascist Bloc.\nBiography\nJózef Lewartowski was born in 1895 into a family of poor Torah-observant Jews. His parents were Moishe and Chava Lewartowski.  He joined the Poale Zion in 1918. In 1920 Lewartowski was member of the Provisional Polish Revolutionary Committee. He was co-founder of Communist Party of Poland and member of the Central Jewish Bureau. On 9 April 1926 he was arrested and sentenced by the Polish court to 3 years in prison. Lewartowski was member and leader of ''Prison's Commune'' - organization of left-wing political prisoners in Second Polish Republic. He escaped from prison in December 1926 and fled to Moscow. In 1932 Lewartowski returned to Poland. In 1933 he was one of the organizers of labor strike in Łódź and Białystok. In 1934 he was re-arrested and sentenced to 12 years of prison. In prison he met Alfred Lampe, Paweł Finder and Bolesław Bierut. Lewartowski was released from the prison on 1 September 1939 and took part in Defense of Warsaw during the September Campaign. Since 1941 he lived in Warsaw Ghetto. He joined the Polish Workers' Party and  in March 1942 he founded of the Anti-Fascist Bloc. Józef Lewartowski died 25 August 1942, shot by Gestapo. He has been awarded the Order of the Cross of Grunwald.\nEnglish translations of two biographies written in Yiddish for the Bielsk Podlaski yizkor book Bielsk-Podliask – Book in the Holy Memory of the Bielsk Podliask Jews Whose Lives Were Taken During the Holocaust Between 1939 and 1944 are available online. There is a detailed eight-page biography, and a brief biography.\nSee also\n* Polish resistance movement in World War II\n* Jewish resistance under Nazi rule\nReferences"
    }
  ]
}