{
  "content": [
    {
      "type": "text",
      "text": "# Juana Ross Edwards\n\nJuana Ross Edwards (August 2, 1830 – June 25, 1913) was a Chilean philanthropist. She built and maintained three hospitals, six nursing homes, a hospice, an orphanage, and countless schools.\nEarly life\nJuana Ross Edwards was born in La Serena, Chile, August 2, 1830.\nShe was the daughter of Scottish Consul David Ross Gillespie and Carmen Edwards Ossandón. Raised within the Edwards family, she spent her childhood with her nine siblings, among whom was Agustín Ross Edwards, politician and diplomat, who would be her executor.\nMarriage and children\nOn April 6, 1851 he married Agustín Edwards Ossandón, her uncle and founder of the Banco Edwards Citi, with whom she had seven children: Juan, Juana, Adela, Arturo, Gustavo, Agustín, Ricardo and Arturo Maximiano, all of whom died before her. Ross Edwards and her husband believed  saving was a virtue. Being the richest man in Chile, Edwards Ossandón was the only one of the Chilean millionaires of the time who did not build a palace in Santiago, nor acquire a great hacienda, or take a pleasure trip to Europe.\nCharity\nRoss Edwards was a benefactor of countless charities, including the founding of hospitals, nursing homes, orphanages, schools and churches, dedicating her entire life to this work.\nThe Encyclical Rerum novarum of Pope Leo XIII, published in 1891, had a profound effect on Ross Edwards, and prompted her to create works for the benefit of the working world. For example, in Valparaíso, she created the Unión Social de Orden y Trabajo (Social Union of Order and Work), and in 1898, she built a complex of 56 apartments for workers, which included an interior bathroom and additional rooms.\nIn 1886, she bought the land in Valparaíso where the Hospital San Agustín would be built, later renamed Hospital Enrique Deformes. In this hospital, she established the first pediatric service of Valparaíso, on April 12, 1894; later, its work was continued at the Hospital Carlos van Buren. It also contributed large sums of money for its reconstruction, after the 1906 earthquake.\nIn La Serena, her hometown, she contributed funds for the construction of the cloister and chapel of Divina Providencia, and she also donated the organ that is still preserved in the cathedral. She died in Valparaíso, on June 25, 1913. She bequeathed the sum of ten million pesos to the Roman Catholic Archdiocese of Santiago de Chile for the construction and repair of churches.\nReferences"
    }
  ]
}