{
  "content": [
    {
      "type": "text",
      "text": "# Juan Battle\n\n(death date then birth date) -->\n| death_place        =\n| death_cause        =\n| region             =\n| nationality        =\n| period             =\n| occupation         =Presidential Professor at the CUNY Graduate Center\n| title              =\n| boards             =\n| known_for          =Principal Investigator for the Social Justice Sexuality Project\n| spouse             =\n| children           =\n| signature          =\n| signature_alt      =\n| signature_size     =\n| era                =\n| language           =\n| discipline         = Sociology\n| sub_discipline     = Public Health, Urban Education\n| movement           =\n| religion           =\n| denomination       =\n| education          = Ph.D. in Sociology\n| alma_mater         = University of Michigan\n| thesis_title       = A nationwide comparison of African American and white eighth graders' academic achievement, educational aspirations, and current attitudes toward education\n| thesis_url         =\n| thesis_year        = 1994\n| school_tradition   =\n| doctoral_advisor   = Donald R. Deskins, Jr.\n| doctoral_students  =\n| notable_students   =\n| main_interests     =Education, quantitative methods, race, sexuality, ethnicity, public health and social justice\n| workplaces         = The Graduate Center, CUNY\n| notable_works      =\n| notable_ideas      =\n| influences         =\n| influenced         =\n| awards             =\n| website            = http://www.juanbattle.com/\n| footnotes          =\n}}\nJuan Jose Battle is an academic, author, activist, and feminist. He is currently Presidential Professor of sociology, public health, and urban education at The Graduate Center of the City University of New York. He also serves as the Coordinator of the Africana Studies Certificate Program. Battle's research focuses on race, sexuality, and social justice. He was a former president of The Association of Black Sociologists (ABS) and an active member of the American Sociological Association (ASA). He has delivered keynote lectures at a multitude of academic institutions, community based organizations, and funding agencies throughout the world and his scholarship has included work on five continents including North America, South America, Africa, Asia, and Europe.\nHis research has been funded by a variety of sources, including the National Institute of Mental Health, National Science Foundation, Ford Foundation, National Institute of General Medical Sciences, Arcus Foundation, and the New York City Department of Health and Mental Hygiene.\nHe is the Principal Investigator (PI), in collaboration with Co-Investigator Antonio (Jay) Pastrana, Jr., of the Social Justice Sexuality Project (SJS), a project that explores the lived experiences of Black, Latina/o/x, and Asian lesbian, gay, bisexual, and transgender people in the United States and Puerto Rico. He is also the PI along with Cathy J. Cohen, Dorian Warren, Gerard Fergerson, and Suzette Audam of the BLACK PRIDE SURVEY, a report on celebrations of gay, lesbian, and transgender culture and pride in the Black community (the term Black is used to refer to people of African Diaspora, and to such populations that reside within the United States). Published by The Policy Institute of the National Gay and Lesbian Task Force, the report is a survey of participants attending Philadelphia Black Pride, Houston Splash, DC Black Pride, Oakland Black Pride, Windy City Black Pride, At the Beach in Los Angeles, Hotter than July in Detroit, New York Black Pride, and In the Life in Atlanta in 2002.\nAdditionally, he is a leading researcher and thought partner for the Global Education Movement project housed at Southern New Hampshire University.  Working with partners globally, this project works to provide postsecondary education to refugees working in Rwanda, Malawi, Kenya, South Africa, and Lebanon.\nRecognized as a leading scholar in the study of sexualities, Battle also specializes in education, quantitative methods, race, ethnicity, and public health. He is a Fulbright Senior Specialist; he was a Fulbright Distinguished Chair of Gender Studies at the University of Klagenfurt in Austria and an Affiliate Faculty of the Institute for Gender and Development Studies (IGDS) at The University of the West Indies, St. Augustine, Trinidad and Tobago.\nAdditionally, he is a leading researcher and thought partner for the Global Education Movement project housed at Southern New Hampshire University.  Working with partners globally, this project works to provide postsecondary education to refugees in Rwanda, Malawi, Kenya, South Africa, and Lebanon.\nThe 2009 book Black Sexualities: Probing Powers, Passions, Practices, and Policies, which Battle co-edited with Sandra L. Barnes, traces the historical context of black sexualities, the contemporary challenges facing black sexualities, and offers a critique of previous scholarship. The book is divided into five parts: Part One: identity theories and new frameworks; Part Two: descriptions, depictions, and responses to black sexualities; Part Three: citizenship, activism, and legal dynamics; Part Four: Negotiating Systemic and Personal Stressors; and Part Five: The Life Course.  Among the multiple and dynamic contributors brought into the project by Battle and Barnes, author Marla Stewart discusses the nonconforming and transgressive gender expression of singer Sylvester reflective of Battle's feminist scholarship as one example of the important contributions of this book.\nComplementing his academic work, he served as an executive producer of the 2012 film The Skinny about black gay life directed by Patrik-Ian Polk and served/serves on the board of several organizations including the YMCA and GRIOT Circle.\nBattle received his A.S. and B.S. from York College of Pennsylvania. &nbsp;His M.A. and PhD were both received from the University of Michigan.\nReferences"
    }
  ]
}