{
  "content": [
    {
      "type": "text",
      "text": "# Judith Howard\n\n| birth_date        =\n| birth_place       = Cleethorpes, Lincolnshire, England, United Kingdom\n| nationality       = British\n| workplaces        = Durham UniversityUniversity of Oxford\n| alma_mater        = University of Bristol (BSc)University of Oxford (DPhil)\n| doctoral_advisor  = Dorothy Hodgkin\n| thesis_title      = The study of some organic crystal structures by neutron diffraction\n| thesis_url        = https://ethos.bl.uk/OrderDetails.do?uin=uk.bl.ethos.459789\n| doctoral_students = Jacqui Cole\n| fields            = ChemistryCrystallography\n| awards            = Royal Society of Chemistry Prize for Structural Chemistry (1999)\n| spouse            = John Wright\n| website           =\n| module            = }}\n}}\nJudith Ann Kathleen Howard  (née Duckworth; 21 October 1945 in Cleethorpes, Lincolnshire) is a British chemist, crystallographer and Professor of Chemistry at Durham University.\nEarly life and education\nJudith Howard attended Salisbury Grammar School for girls, and later attended University of Bristol in 1963 to study chemistry.\nAs a final year undergraduate, Howard worked on the structure of the compound, tin tetra-iron-tetra carbonyl, which was the basis of her very first published work.\nShe graduated from University of Bristol with a Bachelor of Science degree and was awarded a Doctor of Philosophy degree from the University of Oxford where she was a student at Somerville College, Oxford and studied the structure of insulin supervised by Dorothy Hodgkin.\nCareer and research\nIn 1991, Howard moved to become Professor of Crystallography at Durham University. She has co-authored over 1,500 scientific publications, resulting in a H-index of 82.\nHoward's research is in X-ray crystallography. Her interests include in-situ crystallisation of liquids, ultra-low temperature crystallography, high pressure crystallography, experimental charge density analysis, solid-state reactions the study of non-linear optical materials and magnetically interesting materials.\nHoward has created instruments that allow scientists to help advance and prove theories in the field of X-ray crystallography. She is the chairperson of the [http://www.olexsys.org/Contact Olexsys] software for refinement of crystallographic data.\nProlific in her contributions to science, with over 1,500 publications to her name, Judith actively participates in committees and conferences worldwide. She was the first woman to head a five-star chemistry department (at the University of Durham). She was one of the founder members of the British Crystallographic Association where she served as Secretary from 1985-1987 and President from 1992-1996.\nAwards and honours\nShe was awarded an Honorary Doctor of Science degree at the University of Bristol in 1986.\nIn 2005, she received an Honorary Degree from the University of Bath. In 2016 she received an Honorary Doctor of Science Degree from the University of East Anglia. Other awards include:\n* 1996 Appointed Commander of the Order of the British Empire (CBE)\n* 1999 Royal Society of Chemistry (RSC) Prize for Structural Chemistry\n* 2002 elected a Fellow of the Royal Society (FRS)\nReferences"
    }
  ]
}