{
  "content": [
    {
      "type": "text",
      "text": "# Juliana Republic\n\n(Portuguese for \"Liberty, Equality, Humanity.\")\n| capital                = Laguna\n| coordinates            =\n| common_languages       = Portuguese\n| government_type        = Presidential republic\n| title_leader           = President\n| leader1                = David Canabarro\n| year_leader1           = 29 July–7 August\n| leader2                =\n| year_leader2           = 7 August–15 November\n| today                  = Brazil\n}}\nThe Juliana Republic () or the Catarinense Republic (República Catarinense), fully and officially the Free and Independent Catarinense Republic (República Catarinense Livre e Independente), was a revolutionary state that existed between 29 July and 15 November 1839, in the province of Santa Catarina of the Empire of Brazil. The Republic was proclaimed in an extension of the Ragamuffin War started in the neighboring province of Rio Grande do Sul, where the Rio-Grandense Republic had already been created.\nForces of the revolutionary Riograndense Republic, led by General David Canabarro and Italian revolutionary Giuseppe Garibaldi, with help from the local population, conquered the harbor city of Laguna on 22 July 1839, in a battle known as the . The Catarinense Republic was then proclaimed on 29 July, at the city's municipal chamber. Canabarro assumed temporarily the office of president until an electoral college was assembled and elections were held on 7 August. For president and vice president were elected, respectively, , a Lieutenant-colonel of the National Guard of São José, and his uncle, the priest , who assumed the presidential office due to a blockade by the Imperial Army that prevented Joaquim Xavier Neves from reaching Laguna.\nThe rebels could not conquer the provincial capital of Nossa Senhora do Desterro (present-day Florianópolis) because their naval forces were found and destroyed by the Imperial Brazilian Navy at Massiambu River (on the continent, south of Santa Catarina Island) while the rebels were preparing to attack Nossa Senhora do Desterro. Largely due to this, the Juliana Republic lasted for only four months. In November, imperial forces took the Julian capital of Laguna.\nReferences"
    }
  ]
}