{
  "content": [
    {
      "type": "text",
      "text": "# Julien Edwards\n\n| birth_place = Toronto, Ontario, Canada\n| height      =\n| position    = Defender\n| currentclub =\n| collegeyears1 = 2006–2009\n| college1    = Drake Bulldogs\n| years1      = 2008\n| clubs1      = Ottawa Fury\n| caps1       = 10\n| goals1      = 0\n| years2      = 2009\n| clubs2      = Des Moines Menace\n| caps2       = 11\n| goals2      = 1\n| years3      = 2011\n| clubs3      = Capital City\n| caps3       = 23\n| goals3      = 1\n| years4      = 2011–2012\n| clubs4      = Alpha United FC\n| caps4       =\n| goals4      =\n| years5      = 2012\n| clubs5      = Kingston FC\n| caps5       =\n| goals5      =\n| years6      = 2013–2016\n| clubs6      = FC Gatineau\n| caps6       = 51\n| goals6      = 0\n| years7      = 2017\n| clubs7      = Toronto Skillz FC\n| caps7       = 5\n| goals7      = 0\n| nationalyears1 = 2012\n| nationalteam1  = Guyana\n| nationalcaps1  = 6\n| nationalgoals1 = 0\n}}\nJulien Edwards (born July 30, 1988) is a former footballer. Born in Canada, he represented the Guyana national team.\nPlaying career\nEdwards began playing at the college level with Drake Bulldogs in 2006, where he appeared in a total of 50 matches, and earned All-Missouri Valley Conference first team and was selected for the NSCAA All-Region team in 2009. During the college off season he played in the USL Premier Development League originally with  Ottawa Fury, and later with Des Moines Menace.\nIn 2011, he signed his first professional contract with expansion franchise Capital City F.C. in the Canadian Soccer League. During his tenure with Ottawa he reached the CSL Championship against Toronto Croatia, where the match concluded in a 1-0 victory for Croatia. He later played in the GFF Elite League with Alpha United FC. Throughout his tenure with Alpha he featured in the 2011 CFU Club Championship. In 2012, he returned to the Canadian Soccer League to play with Kingston FC.\nIn 2013, he played in the Première Ligue de soccer du Québec with FC Gatineau. In 2017, he played in League1 Ontario with Toronto Skillz FC.\nInternational career\nIn 2010, he was called to a Canada men's national under-23 soccer team camp organized by head coach Tony Fonseca. Edwards instead made his debut for the Guyana national football team on March 31, 2012 in a friendly match against French Guiana. He featured in the 2012 Caribbean Cup qualification match against Saint Vincent and the Grenadines. In total he has earned six caps for Guyana.\nHonors\nAlpha United FC\n* GFF National Super League: 2012\nReferences"
    }
  ]
}