{
  "content": [
    {
      "type": "text",
      "text": "# July for Kings__disambig_1\n\n| occupation          =\n| years_active        = 1997&ndash;2005, 2007&ndash;present\n| label               = MCA Records\n| associated_acts     = Joe Hedges\n| website             = http://julyforkings.com/\n| current_members     = Joe HedgesJohn McGuireDan McQuinnBrian Ives\n| past_members        =\n}}\nJuly For Kings, or \"JFK\", is an American, Cincinnati, Ohio-based alternative rock band, founded by Joe Hedges (vocals, guitar), Sam Dobrozsi (drums), Travis Delaney (guitar), Jason Morgan (bass), and T Miller (cello, guitar).   The band was founded Middletown, Ohio, in 1997.  After several line-up changes that included the departure of two founding members, frontman Joe Hedges dropped the July For Kings name in April 2006, choosing to release the next album, Curvature, using his own moniker. In October 2007, Joe Hedges announced that July For Kings had reunited and that they were working on a new album.  On June 23, 2009, July For Kings released the studio album entitled Monochrome. and on July 14, 2015, July For Kings released the album Middletown.\n1997-2000: early career\nJuly For Kings's first public performances were at Caffiena's coffee house in 1997.  Then known as Vice, friends Hedges, Dobrozsi, and Delaney, were students at Bishop Fenwick High School in Middletown, Ohio. Their first recording was a 7-song cassette tape entitled Deeper, and included bassist Dave Murphy.  This was followed by another demo release Gods, their first full-length recording. Gods featured re-workings of several tracks on Deeper, both recorded locally and selling only a few hundred copies. During the recording of Gods, T Miller and Jason Morgan began appearing with Vice at weekly Caffiena's performances, eventually becoming permanent members.\nIn 1998,  record producer/engineer Ken Lewis took notice of the band and began working with them regularly.  The band began performing more regularly in the Cincinnati and Dayton areas. The band changed their name from Vice to Swim.  Swim's first full-length album Safe Unless was recorded in studios in New York. This was the first appearance of T Miller's cello playing, which would become a signature of the July For Kings's sound and live shows.\nUnder Lewis's direction, the band was recording off and on for a period of several years. By 2000, they selected seven songs for The Laughter and the Noise EP.  This album found the band drawing large crowds at clubs all over the tristate.  Sold out shows quickly attracted attention from major labels; the band quit their day jobs and moved into a house in Ft. Mitchell, Kentucky to focus solely on music. The band secured a deal with MCA Records through A&R Joel Mark in 2001.  That year also brought the band two Cammy's (Cincinnati music awards) including Favorite Band and Best Rock Instrumentalist for Sam Dobrozsi.  Once with MCA, to avoid trademark problems the band changed their name July for Kings.\nThe Swim Album Era (2001-2003)\nIn 2001, the band signed on with Media Five Entertainment, a management company based in Bethlehem, Pennsylvania, which was responsible for building the careers of Live and Fuel. With new management and a recording contract July For Kings began recording at Longview Farms Studios in Massachusetts.  Much of the overdubs were recorded at the band's house in Ft. Mitchell Kentucky.  Growing impatient with the pace of the recording sessions, MCA removed Hedges' long-time producer Ken Lewis from the project, opting to finish the album in Los Angeles with producers Blumpy, and Ben Grosse at Grosse's Mix Room Studios.  After nearly a year of studios and producers, July For Kings released their national debut album SWIM (in honor of their former band name) on November 5, 2002.\nSwim's eleven tracks range from acoustic ballads to near-metal rock.  \"What sets JFK apart are the simple, solid lyrics of Hedges, who is not afraid to wear his emotions on his sleeve. There's a refreshing honesty in his lyrics\" The album is a mix of every day imagery of \"crisp, forthright\" songs like \"Normal Life\" (\"I'll make the bed, you feed the cat\") and spiritual iconography of songs like \"Believe\", which Hedges has attributed to his Midwestern lifestyle and Catholic upbringing. July For Kings received airplay with their first single \"Normal Life\", including No.&nbsp;1 most requested on Las Vegas station KMXB.  The band participated in college tours and club tours, performing with bands like Collective Soul, The Counting Crows, and Kill Hannah.\nIn 2003, the Hedges-penned July for Kings song \"Girlfriend\" reached radio stations being performed by Wind-Up Records recording artist and former bachelor from The Bachelor Bob Guiney.  Guiney changed several lines and delivered the song in a more pop fashion.\nMCA folded in 2003, moving some of its artists to Geffen Records and dropping the rest, including July for Kings.  Music industry woes eventually caused July For Kings to lose two founding members drummer Sam Dobrozsi and bassist Jason Morgan.  Jason was replaced for the summer 2004 touring schedule by Cincinnati bassist Amos Heller (formerly of local rock act Oval Opus; later touring with Taylor Swift).\n2004-2006: Nostalgia\nIn 2004 after picking up new drummer Dan McQuinn and bassist Drew Phillips (from Pay the Girl) July For Kings began recording their second album, Nostalgia. Joe Hedges produced the seven-song Nostalgia with Eric Stewart; it was mastered in New York City at Sony studios.  Nostalgia was recorded over a period of six months in studios and apartments in southwestern Ohio.  The album was released independently in early 2005 and made it to CD Baby's No.&nbsp;1 seller spot within the third week of availability.  July for Kings signed a distribution deal with Handleman Company, which delivered the disc to traditional retailers like Wal-mart.  Over the next couple years July For Kings played shows in the eastern U.S. promoting Nostalgia and using the internet to expand their fan base.\nName change\nDuring the recording of Nostalgia, Joe Hedges reconnected with producer Blumpy who worked on the SWIM album for MCA. Blumpy mixed two songs for Nostalgia, and they began discussing the possibility of doing a full-length album together. Hedges began writing, and in the winter of 2006 he and Blumpy moved into a cabin in the woods on Elk Lake in Michigan and started recording. The album, entitled Curvature, departed from the July for Kings sound  and instead became Joe Hedges' solo debut. Curvature was released April 17th 2007 and features two other former July for Kings members Dan McQuinn on drums, T Miller on cello and guitar and new bassist Brian Ives.\nJuly For Kings reformed\nIn of October 2007, the band reformed under the old name July for Kings, and began working on new material in 2008. In May 2008 they recorded a first song off the new album known as \"Say it Now\" and saw the departure of T Miller (guitar, cello, vocals).  Hedges began differentiating between his darker solo pursuits and his more straightforward writing for July For Kings.\nMonochrome\nJuly for Kings third album, Monochrome, was released on June 23, 2009, with new guitarist John McGuire.  McGuire, a recent graduate of the Cincinnati Conservatory of Music, is credited with mixing ten of the album's eleven tracks.  Monochrome is a shift away from post-grunge alternative into a more modern pop/rock sound, using occasional piano and synthesizers to create lusher, more dynamic sonic atmospheres. Cincinnati's Citybeat Magazine described it as combining elements of July For Kings signature sound with some sonic ideas from Hedges solo album to create a record that is \"more daring than JFK’s previous work.\"\nMiddletown\nOn July 14, 2015, July For Kings released their fourth full-length studio album entitled Middletown.\nMembers past and present\n*Joe Hedges (vocals, guitar) (current)\n*Brian Ives (bass) (current)\n*John McGuire (guitar) (current)\n*Dan McQuinn (drums) (current)\n*Sam Dobrozsi (drums)\n*Travis Delaney (guitar)\n*Jason Morgan (bass)\n*T Miller (cello, guitar)\n*Drew Phillips (bass)\n*Amos J. Heller (bass)\nDiscography\nAs Vice\n*Deeper (Self-released, 1997)\n*Gods (Self-released, 1998)\nAs Swim\n*Safe Unless (Self-released, 1999)\n*The Laughter and the Noise EP (Self-released, 2000)\nAs July for Kings\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n! scope=\"col\" rowspan=\"1\" style=\"width:10em;\" | Title\n! scope=\"col\" rowspan=\"1\" style=\"width:20em;\" | Album details\n|-\n! scope=\"row\" | Swim\n|\n*Released: October 29, 2002\n*Genres: Alternative rock, Pop rock, Post-grunge\n*Length: 47:08\n*Labels: MCA Records, Geffen\n*Producers: Blumpy, Ben Grosse, Ken Lewis\n|-\n! scope=\"row\" | Nostalgia\n|\n*Released: December 26, 2004\n*Genres: Alternative rock, Pop rock\n*Length: 30:09\n*Labels: Machines & Dreams\n*Producers: Joe Hedges, Eric Stewart\n|-\n! scope=\"row\" | Monochrome\n|\n*Released: June 28, 2009\n*Genres: Alternative rock, Pop rock\n*Length: 42:49\n*Labels: July for Kings\n*Producers: July for Kings, Andy Ellis\n|-\n! scope=\"row\" | Middletown\n|\n*Released: July 14, 2015\n*Genres: Alternative rock, Pop rock, Post-grunge\n*Length: 43:56\n*Labels: July for Kings\n*Producers: July for Kings, Eric Stewart, John McGuire\n|-\n|}\nJoe Hedges solo\n*Curvature (Self-released, 2007)\n*Lexington Demos (Self-released, 2008)\n*Alchemy (Self-released, 2010)\nReferences"
    }
  ]
}