{
  "content": [
    {
      "type": "text",
      "text": "# Jun Ishiwara\n\n| birth_place             = Tokyo, Japan\n| death_date              =\n| death_place             = Chiba Prefecture, Japan\n| residence               =\n| citizenship             =\n| nationality             =\n| ethnicity               =\n| field                   = theoretical physics\n| work_institution        = Tohoku University\n| alma_mater              = University of Tokyo\n| doctoral_advisor        = Hantaro Nagaoka\n| doctoral_students       =\n| known_for               =\n| author_abbreviation_bot =\n| author_abbreviation_zoo =\n| prizes                  =\n| religion                =\n| footnotes               =\n}}\nJun Ishiwara or Atsushi Ishihara (石原 純; January 15, 1881 – January 19, 1947) was a Japanese theoretical physicist, known for his works on the electronic theory of metals, the theory of relativity and quantum theory. Being the only Japanese scientist who made an original contribution to the old quantum theory, in 1915, independently of other scientists, he formulated quantization rules for systems with several degrees of freedom.\nBiography\nJun Ishiwara was born in the family of Christian priest Ryo Ishiwara and Chise Ishiwara. In 1906, he completed his studies at the Department of Theoretical Physics at the University of Tokyo, where he was a student of Hantaro Nagaoka. Since 1908, Ishiwara taught at the Army School of Artillery and Engineers, and in 1911 received the position of Assistant Professor at the College of Science of Tohoku University. From April 1912 to May 1914 he trained in Europe – at the University of Munich, ETH Zurich and Leiden University, where he worked with Arnold Sommerfeld and Albert Einstein. After returning to his homeland, Ishiwara received a post of professor at Tohoku University, and in 1919 for his scientific work was awarded the Imperial Prize of the Japan Academy.\nSince 1918, Ishiwara's scientific activity began to decline. In 1921, because of a love affair, he was forced to take leave at the university, and two years later finally retired. After retirement, he devoted himself mainly to writing and scientific journalism (in this area he was one of the pioneers in Japan), he authored many popular books and articles on the latest achievements of science. At the end of 1922, Ishiwara hosted Einstein during his visit to Japan; he recorded and published a number of speeches by Einstein, including his Kyoto address, in which Einstein, for the first time, detailed his path to the creation of the theory of relativity. The two-volume monograph of Ishiwara, titled \"Fundamental Problems of Physics\", was very popular among young scientists and specialists; he also edited the first complete collection of Einstein's works, published in a Japanese translation in 1922-1924. In addition, Ishiwara was known as a poet who wrote poems in the genre of tanka. Shortly before the outbreak of World War II, he criticized the government control over science.\nScientific achievements\nTheory of relativity\nIshiwara was one of the first Japanese scholars to turn to the theory of relativity; he wrote the first scientific article in Japan on this subject. In 1909-1911, he studied within the framework of this theory a number of specific problems related to the dynamics of electrons, the propagation of light in moving objects and the calculation of the energy-momentum tensor of the electromagnetic field. In 1913, on the basis of the principle of least action, he derived an expression for this tensor, previously obtained by Hermann Minkowski. Ishiwara took part in the discussions of the first half of the 1910s (the decade from 1910 to 1919) which preceded the creation of the general theory of relativity. Starting from the scalar theory of gravitation proposed by Max Abraham and using the then popular idea of the electromagnetic origin of matter, the Japanese physicist developed his own theory, in which he attempted to unify the electromagnetic and gravitational fields, or, more precisely, to deduce the latter from the former. Assuming that the speed of light is variable and rewriting Maxwell's equations accordingly, he showed that such a representation leads to the appearance of additional terms in the energy-momentum conservation law that can be treated as a gravitational contribution. The result was in agreement with Abraham's theory, but subsequently Ishiwara developed his theory in another direction trying to harmonize it with the theory of relativity. The scientist also made attempts to build a five-dimensional theory for unification of the gravitational and electromagnetic fields.\nQuantum physics\nIn the first paper devoted to the problems of quantum physics (1911), Ishiwara derived Planck's law and tried to substantiate the wave properties of radiation on the basis of the assumption that it consists of light quanta. Thus, he anticipated certain ideas of Louis de Broglie and Satyendra Nath Bose. In the same year, he supported the hypothesis of light quanta as a possible explanation of the nature of X-rays and gamma rays.\nIn 1915, Ishiwara became the first non-Western scientist who referred to the Bohr atom theory in a published work. On April 4, 1915, he presented to the Tokyo Mathematico-Physical Society the article \"The universal meaning of the quantum of action\" (\"Universelle Bedeutung des Wirkungsquantums\"), in which he attempted to unite the ideas of Max Planck on elementary cells in phase space, the idea of quantizing the angular momentum in the Bohr model atom and the hypothesis of Arnold Sommerfeld about the change of the action integral in quantum processes. Ishiwara suggested that the motion of a quantum system having j degrees of freedom should satisfy the following average relationship between the values of the coordinates (q_i) and the corresponding momenta (p_i): \\frac{1}{j} \\sum_{i=1}^j \\int{p_i dq_i}=h, where h is the Planck constant. Ishiwara showed that this new hypothesis can be used to reproduce some quantum effects known at that time. Thus, he succeeded in obtaining an expression for the quantization of the angular momentum in the Bohr atom, taking into account also the ellipticity of electron orbits, although it followed from his theory the need to take the charge of the nucleus of the hydrogen atom equal to two elementary charges. As a second application of the proposed hypothesis, Ishiwara considered the problem of the photoelectric effect, obtaining a linear relationship between the electron energy and the radiation frequency in accordance with the Einstein formula. Later in the same year Ishiwara put forward another hypothesis, according to which the product of the energy of the atom and the period of electron motion in the stationary state should be equal to the integer number of Planck constants. In 1918, he linked the postulate proposed three years earlier to the theory of adiabatic invariants.\nAround the same time, analogous rules for quantizing systems of many degrees of freedom were independently obtained by William Wilson and Sommerfeld and are usually called the Sommerfeld quantum conditions. The reason for the error of Ishiwara, which was manifested in the calculation of the hydrogen atom, apparently was a superfluous averaging over the number of degrees of freedom (dividing by j before the sum). At the same time, his quantum condition, which differed from Sommerfeld's one in the presence of summation, allowed to obtain correct results regardless of the choice of coordinates. This was pointed out in 1917 by Einstein, who, not knowing about the work of Ishiwara, derived the same relation and showed that in the case of separable coordinates it gives the conditions of Wilson and Sommerfeld.\nSelect publications\n*\n*\n*\n*\n*\n*\n*\n*\n*\n** Commented English translation:\n*\n*\n*\n*\nReferences\nSources\n*\n*\n*\n*\n*"
    }
  ]
}