{
  "content": [
    {
      "type": "text",
      "text": "# June King McFee\n\nJune King McFee (died January 14, 2008) made many contributions to the world of art education, with her research and publications.\nProfessor Emeritus June King McFee was Professor and Head of the Department of Art Education at the University of Oregon from 1965-1983.  She started an internationally recognized doctoral program at the university.\nShe is best known for advancing cultural understanding through the arts.  In her book, Preparation for Art, McFee\n\"portrays graphically the range of individual differences in children's reactions to visual phenomena and visual arts.\"\nMcFee believed in teaching art according to a child's needs.  She created the \"perception delineation theory\" based on sociology, anthropology, psychology, and the needs of urban children.  According to her theory, learning is a behavioral adjustment, and the education that society needed was guided change in behavior.\nUniversity of Oregon\nAt the University of Oregon, June King King McFee, along with colleague and faculty member Vincent Lanier, developed strong focuses on community arts and cultural services within the Department of Art Education (ARE). McFee's work was rooted in cultural pluralism, the role of art in society, and the influence people have in their communities related to the arts.\nAfter her tenure as faculty, her influence continued to develop the ARE curriculum. Rogena Degge, a close colleague in the department, went on to develop classes in Cultural policy based on the work of McFee. She later developed an Art and Society class still taught at the University, at the graduate level.\nPublications\nAccording to WorldCat Identities, June King McFee has 17 works in 54 publications in 2 languages and 1,751 library holdings. Prominent publications books:\n* Preparation for Art\n* Art, Culture, and Environment: A Catalyst for Teaching\n* Cultural Diversity and the Structure and Practice of Art Education\n* Creative Problem Solving Abilities in Art of Academically Superior Adolescents\n* Visual Arts: Psychological Implications of Individual Differences in the \"Perception-delineation\" Process\n* Oregon Communities: Visual Quality & Economic Growth\nReferences\n* McFee, J. (1970). Preparation for Art. Wadsworth Publishing Company, Inc., Belmont, California.\n* McFee, J. (1984). Studies in Art Education, Vol. 25, No. 3: Reflections. National Art Education Association.  Retrieved April 20, 2008.\nExternal links\n* [http://www.naea-reston.org/ National Art Education Association]\n* [http://video.google.com/videoplay?docid=-5096963008057394994 Video: \"A Conversation with June King McFee\"]\n* [http://pages.uoregon.edu/culturwk/culturework32.html]"
    }
  ]
}