{
  "content": [
    {
      "type": "text",
      "text": "# Jurahareswarar temple, Kanchipuram\n\n| designation1_free2name = Region\n| designation1_free2value =\n| location = Kanchipuram, Tamil Nadu, India\n| elevation =\n| built = 700-728 CE\n| architect = Narasimhavarman II\n| architecture = Dravidian architecture (Pallava)\n| coordinates =\n| locmapin = India Tamil Nadu\n| map_caption = Location in Tamil Nadu, India\n| visitation_num =\n| visitation_year =\n}}\nThe Jurahareswarar temple (also called Jvarahareswara temple or  Suragareswarar Temple) is located in the temple town of Kanchipuram in Tamil Nadu, India. Constructed in the Dravidian style of architecture, the temple is  dedicated to Shiva, who is worshipped as Jurahareswarar.\nThe temple is believed to have been built by Pallava King Narasimhavarman II (Rajasimhan) (r. 690–725 CE) in the early 8th century CE, with later contributions from Medieval Cholas. Another view states that the temple was built during the reign of Chola king Kulottunga III (1178–1218 CE). The temple is open from 6 am to 12 pm and 3pm to 8:30 pm. In modern times, the temple is maintained and administered by the Archaeological Survey of India.\nLegend\nAs per Hindu legend, the austerities performed by a human in his previous births govern his current well being. Jurahareswarar is derived from Sanskrit words Jvara (fever), Hara (destroy), and Ishvarar (Shiva), implying the nature of Shiva to heal diseases. The devas, the celestial deities were troubled by Asura named Sura. The devas wanted to seek the help of Shiva who was doing penance at that time. Considering the anger of Shiva, the devas were sceptic to approach Shiva directly. They approached Brahma, through whom Shiva opened his third eye and provided fire. The heat of the fire resulted in jvara (fever) to the devas. They started praying to Shiva. Pleased by their devotion, Shiva appeared as Jurahareswarar at this place. The devas worshipped Shiva at this place and were purified by the waters of Jurahara Theertham. With the help of Shiva, they were able to win over the demon king.\nHistory and architecture\nAs per one view, the temple was built by Pallava King Narasimhavarman II (Rajasimhan) (r. 690–725 CE). As per another view, the temple was built during the reign of Chola king Kulottunga III (1178–1218 CE) as made out from the lower stone part of the structure. The three-tiered gopuram is believed to be of a later addition. The temple has a semicircular sanctum, which is unique in the region. The temple has a rectangular plan and has a single shrine for Jurahaneswarar in the form of Lingam (an iconic form of Shiva). The shrine is built on an elevated plane. The sanctum is fronted by a covered rectangular ardhamandapa (prayer hall) and a  mukhamandapa (entrance porch), which has eight carved pillars in the Pallava style. The lower plane has a small shrine for Nandi axial to the sanctum. There is a bali pitham, the offering plane, which is located behind the Nandi and axial to the sanctum. The shrine is enclosed in a granite pillar. The temple has sculptural representation indicating the various legends from Hindu scriptures. The temple is maintained and administered by the Archaeological Survey of India.\nReligious importance and practices\nThe temple is classified as one of the minor shrines of Kanchipuram. The temple tank is called Jurahara theertham and the water from the tank is believed to be a curative for diseases. Similar to Srirangam Ranganathaswamy temple, the temple vimana has openings in all four directions for ventilation, which is also believed to have curative effects. The temple priests perform the pooja (rituals) during festivals and on a daily basis. The temple is open from 6.00 a.m. to 11.00 a.m. and from 4.00 p.m. to 8.00 p.m. Like other Shiva temples of Tamil Nadu, the priests belong to the Shaivaite community. The temple rituals are performed four times a day; Ushathkalam at 6:00&nbsp;a.m., Kalasanthi at 9:00&nbsp;a.m., Uchikalam at 1:00&nbsp;p.m., Sayarakshai at 5:00&nbsp;p.m., and Ardha Jamam at 8:30&nbsp;p.m. Each ritual comprises four steps: abhisheka (sacred bath), alangaram (decoration), neivethanam (food offering) and deepa aradanai (waving of lamps) for both Jurahreswarar. The worship is held amidst religious instructions in the Vedas (sacred text) read by priests and prostration by worshippers in front of the temple mast. There are weekly rituals like ' and ', fortnightly rituals like pradosham and monthly festivals like amavasai (new moon day), kiruthigai, pournami (full moon day) and sathurthi. .\nReferences\nExternal links"
    }
  ]
}