{
  "content": [
    {
      "type": "text",
      "text": "# Justin McCarthy (American historian)\n\n|birth_place = Chicago, Illinois, U.S.\n|residence   =\n|death_date  =\n|death_place =\n|sub_discipline = Histories of the Ottoman Empire and the Balkans\n|work_institutions = University of Louisville\n|alma_mater  = University of California at Los Angeles\n|known_for   =\n|awards      = Order of Merit of Turkey (1998)\n}}\nJustin A. McCarthy (born October 19, 1945) is an American demographer, former professor of history at the University of Louisville, in Louisville, Kentucky. He holds an honorary doctorate from Boğaziçi University in Istanbul, Turkey, was awarded\nthe Order of Merit of Turkey (in 1998), and is a board member of the Institute of Turkish Studies and the Center for Eurasian Studies (AVIM). His area of expertise is the history of the late Ottoman Empire.\nMcCarthy's work has faced harsh criticism by many scholars who have characterized McCarthy's views defending Turkish atrocities against Armenians as genocide denial.\nBackground\nMcCarthy served in the Peace Corps in Turkey, from 1967 to 1969, where he taught at Middle East Technical University and Ankara University. He earned his Ph.D. at University of California, Los Angeles in 1978. He later received an honorary doctorate from Boğaziçi University. McCarthy is also a board member of the Institute of Turkish Studies.\nStudies\nOn Ottoman Empire\nMcCarthy's studies concentrate on the period in which the Ottoman Empire crumbled and eventually fell apart. He holds that orthodox  Western histories of the declining Ottoman Empire are biased as they are based on the testimonies of biased observers: Christian missionaries, and officials of (Christian) nations who were at war with the Ottomans during World War I.\nAble to read Ottoman Turkish, McCarthy has focused on changes in the ethnic composition of local populations. Thus, he has written about the ethnic cleansing of Muslims from the Balkans and the Caucasus, as well as the Armenian massacres in Anatolia.\nSome scholarly critics of McCarthy acknowledge his research on Muslim civilian casualties and refugee numbers (19th and early 20th centuries) brought forth a valuable perspective, previously neglected in the Christian West: that millions of Muslims also suffered and died during these years. Donald W. Bleacher, although acknowledging that McCarthy is pro-Turkish, nonetheless called Death and Exile \"a necessary corrective\" to the model often posited in Western historiography, where all the victims were Christians and all the perpetrators were Muslims. However, others have accused McCarthy of exaggerating the number of Muslim victims in the Balkans.\nMcCarthy's current concentration is on the factors that caused the Ottoman loss in the East in World War I. According to him, the milestone events are the Battle of Sarikamish and what he terms the \"Armenian Revolt\" at Van. Norman Stone, who denies the Armenian genocide, praised Justin McCarthy's The Ottoman Turks: \"a brave scholarly attempt, not shrinking from the economic side.\" Similarly, The Ottoman Peoples and the End of Empire was recommended by The History Teacher.\nMcCarthy also worked, especially in The Creation of Enduring Prejudice, with a focus on anti-Turkish prejudices disseminated between the beginning of the 19th century through 1922.\nArmenian genocide\nMcCarthy agrees that a large number of Armenians were killed or died of unnatural causes during the massacres of 1915–1923, but he argues that millions of Muslims in the region were also massacred in this period and many at the \"hands of Armenian insurgents and militia.\" He has claimed that all of those deaths during World War I were the product of intercommunal warfare between Turks, Kurds and Armenians, famine and disease, and did not involve an intent or a policy to commit genocide by the Ottoman Empire. McCarthy has been active in publishing the results of his work and analysis, that Ottomans never had an official state sanctioned policy of genocide, through books, articles, conferences, and interviews. This has made him a target of much criticism from historians and organizations.  He was one of four scholars who participated in a controversial debate hosted by PBS about the Armenian genocide in 2006. Aviel Roshwald describes McCarthy's \"version of these events\" as \"defensively pro-Turkish.\"\nMichael M. Gunter congratulated Justin McCarthy for Muslim and Minorities: \"His work is clearly the best available on the subject and merits the close attention of any serious, disinterested scholar\"; and \"his figure\" of the Armenian losses (600,000) \"is probably the most accurate we have.\" Justin McCarthy's work on the demography of Anatolian populations, especially the Armenians, was also recommended by , professor of Ottoman history at the Collège de France. Both Gunter and Veinstein have engaged in the Armenian genocide denial.\nEvaluations\nMuslim demographics\nHistorian Dennis P. Hupchick writing in the American Historical Review states of Death and Exile: The Ethnic Cleansing of Ottoman Muslims, 1821–1922 (1996):\nOne may pick arguments with specific interpretations of events depicted in the work, but the statistical data appear generally valid. McCarthy succeeds in providing factual material for bringing the European historiography of the later Ottoman Empire into more objective balance.\nHistorian Robert Olson writing in the International Journal of Middle East Studies says of the same book:\nLike all of the author's other works, this one offers positions that become pivots for rebuttals, disagreements, counter-arguments, different interpretations, and probably some recriminations. Nonetheless, Justin McCarthy's solid demographic work contributes to achieving a better balance and understanding that he so ardently desires for the history of these regions and peoples.\nHistorian and Ottoman specialist Michael Robert Hickock writing in the Review of Middle East Studies and reviewing the same book, noted its \"excellent service\" to scholars and general readers as a work documenting human suffering, but accused McCarthy of selectively using sources and said:\nAlthough he succeeds in recounting the plight of Muslim communities, he is less successful in demonstrating state policy or proving intent. Moreover, McCarthy is inconsistent in assigning blame. When the Ottoman state failed to control the depredation of Armenians at the hands of Kurds and Circassians, it was due to lack of resources and authority; when Russian, Bulgarian and Greek soldiers declined to stop similar events against Muslim peasants, it was done deliberately. The question of intent underlies the book's greatest flaw.\nHistorian Dimitris Livanios notes that the title of the book clearly refers to \"Muslims\", a religious identity that was shared by many Turkish, Tartar, Albanian, Bosnian and Greek ethnic groups in the Balkans and the Black Sea, however, it insists in using the term \"ethnic\" to describe their destruction, although the ethnicity of these groups played little role in their expulsion or their identity.\nAccording to historian Hakem Al-Rustom, who is critical of the book:\nJustin McCarthy is an apologist for the Turkish state and supports the official version of history, which denies the Armenian genocide. He thus might have exaggerated the number of Muslim victims in the Balkans in order to underplay the number of Armenian victims in Anatolia.\nAccording to Michael Mann McCarthy is often viewed as a scholar on the Turkish side of the debate over Balkan Muslim death figures. Mann however states that even if those figures were reduced \"by as much as 50 percent, they still would horrify.\"\nDonald Bloxham, a University of Edinburgh historian specializing in genocide studies, states that \"McCarthy's work has something to offer in drawing attention to the oft-unheeded history of Muslim suffering and embattlement... It also shows that vicious nationalism was by no means the sole preserve of the CUP and its successors\", but notes that:\nArmenian genocide\nMcCarthy's work has been the subject of criticism from book reviewers and a number of genocide scholars. According to Israeli historian Yair Auron, McCarthy, \"with Heath Lowry, Lewis' successor in Princeton, leads the list of deniers of the Armenian genocide.\" The Encyclopedia of Genocide writes that Stanford Shaw and McCarthy have published shoddy and desperate books claiming there was no genocide and that \"the Turkish government really treated the Armenians nicely while they were deporting and killing them\", and particularly, \"McCarthy revises demography to suggest that there really weren't many Armenians in historic Armenia.\" Among other criticisms, he has been accused by Colin Imber of following a Turkish nationalistic agenda. According to the Encyclopedia of Human Rights, in their efforts to negate the genocidal nature of the event, Lewis, Shaw, McCarthy and Lewy, most notably, \"have ignored the evidence and conclusions of the massive record of documents and decades of scholarship\" as well as the 1948 UN Genocide Convention's definition, and these \"denialist scholars have engaged in what is called unethical practice.\" The historian Mark Mazower considers McCarthy's sources and, in particular, his statistics to be \"less balanced\" than those of other historians working in this area. McCarthy is a member of, and has received grants from, the Institute of Turkish Studies. According to historian Richard G. Hovannisian, Stanford Shaw, Heath Lowry and Justin McCarthy all use arguments similar to those found in Holocaust denial.\nFlavia Lattanzi, former ICTY judge, says that \"In the propagandist conferences and in other symposiums of prof. McCarthy I did not hear any reference to elders, women, children. It seems that the Armenian community was only composed of combatants killing Turkish combatants and civilians.\" She also states that he relies on a \"completely wrong definition of genocide.\"\nBloxham identifies McCarthy's work as part of a wider project of undermining scholarship affirming the Armenian genocide by reducing it to something analogous to a population exchange. Bloxham writes that McCarthy's work \"[serves] to muddy the waters for external observers, conflating war and one-sided murder with various discrete episodes of ethnic conflict... [A] series of easy get-out clauses for Western politicians and non-specialist historians keen not to offend Turkish opinion.\"  Samuel Totten and Steven L. Jacobs write that Shaw's and his adherents' (especially Lowry and McCarthy) publications have \"striking similarities to the arguments used in the denial of the Holocaust: labeling the alleged genocide as a myth created for wartime propaganda, portraying the presumed victims as having been real security threats[...] discounting eye-witness accounts and survivor testimony, asserting that whatever deaths occurred were from the same causes that carried away all peoples living in the region, minimizing the number of victims,\" and so on. Likewise, Ronald Grigor Suny maintains that the number of Armenian genocide deniers is small (the most prominent being Shaw, McCarthy, Lowry and Lewis) but \"their influence is great by virtue of pernicious alliance with the official campaign of falsification by the government of Turkey.\"\nReactions\nMcCarthy lent support to the Assembly of Turkish American Associations, which led an effort to defeat recognition of the Armenian genocide by the U.S. House of Representatives in 1985.\nIn November 2013, McCarthy's three planned meetings at the Australian Federal Parliament, University of Melbourne and Art Gallery of New South Wales were canceled on the grounds of his denialist views on the Armenian genocide. On 20 November 2013 the Executive Council of Australian Jewry has released a statement raising questions about the quality of McCarthy's analysis and expressing their deep concerns of McCarthy's upcoming address in Australian Parliament. They noted that \"whilst freedom of expression and academic freedom require that Professor McCarthy must be at liberty to put forward his theories, the manner in which he does so must not lapse into racial vilification.\" Member of Australia's Parliament, Greens spokesman on multiculturalism Richard Di Natale told the Sydney Morning Herald that \"Justin McCarthy is a rallying point for those who deny the Armenian genocide.\" According to Liberal member John Alexander, \"revisionist Justin McCarthy has used parliamentary facilities to promote his well-documented views questioning the systematic slaughter of Armenians, Assyrians and Pontian Greeks from 1915 to 1923.\"\nHans-Lukas Kieser considers that McCarthy has \"an indefensible bias toward the Turkish official position.\"\nWorks\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nAwards\n* Şükrü Elekdağ Award of the Assembly of Turkish American Associations\n* Chairman's Education Award of the Turkish American Friendship Council\n* Order of Merit of Turkey (1998)\nReferences\nFurther reading\n*\nExternal links\n*[http://homepages.cae.wisc.edu/~dwilson/Armenia/justin.html Armenian-Turkish Conflict] (2005), by Justin McCarthy\n* [https://www.amazon.com/Great-Game-Genocide-Imperialism-Nationalism/dp/0199226881 Bloxham, The Great Game of Genocide]"
    }
  ]
}