{
  "content": [
    {
      "type": "text",
      "text": "# Justus Forward\n\nJustus Forward (May 11, 1730 – March 8, 1814) was an American Congregationalist minister and theologian. Known as \"Esquire,\" he was pastor of the Belchertown Congregational Church, in Western Massachusetts, for nearly six decades. His sermons were described as \"clear and simple,\" his theology of the \"strict orthodox New England type.\"\nEarly life and career\nHe was born in Suffield, then in the state of Massachusetts, and graduated from Yale College in 1754. He taught at Hatfield Academy, Hatfield, Massachusetts, until 1756, the year he was ordained as the second minister at Cold Spring (renamed Belcher's Town in 1761, later becoming Belchertown, Massachusetts).\nThe Town dismissed its first minister, Harvard-educated Rev. Edward Billings (1707-1760), a conservative Congregationalist who supported the renowned theologian Jonathan Edwards in nearby Northampton. Edwards argued against the Half-Way Covenant, which was considered a loosening of the then-strict Church membership requirements. The Covenant allowed baptized but \"unconverted\" adults to have their children baptized to address the decline in church membership.\nFamily\nThe same year of his appointment as minister at Cold Spring, Rev. Forward married there, a Ms. Violet Dickinson (1738-1834), of Hatfield. They were the parents of three sons and nine daughters, most of whom died young. Their first son, Joshua, drowned in 1765, aged seven years, and lies in the Hill Cemetery in Hatfield. Another child of the same name, aged four years, died in 1776 and lies in Belchertown's South Cemetery.\nMinistry\nRev. Forward was granted 100 acres of land at Cold Spring and parishioners erected a house and barn for his use. His starting salary was 46 pounds, 13 shillings, 4 pence. He was said to have \"carried on quite a farm and cleared a good deal of land - not an easy task\" to supplement his salary. His journal entries include mention of planting rye, buckwheat, plum, cherry, and apple trees and harvesting hay.  He kept livestock, including sheep, cattle, and swine. He helped many boys fit for college, often with no compensation.\nOne of his parishioners, Hon. Mark Doolittle, wrote that there was no practicing physician in Town so Rev. Forward became \"useful to his people in sickness; by reading and practicing he obtained considerable knowledge of medicine.\" At the same time, he \"gained a knowledge of their spiritual wants, and was always ready to meet them.\" He opposed \"British aggressions on American rights\" and wrote for \"the periodical press in those times and his labors were well received.\" Rev. Forward was, \"a correct classical scholar,\" had \"a well-balanced mind,\" and \"was strongly marked by the stern, faithful, unassuming, considerate traits, showing his Puritanic lineage.\"\nIn late 1766, the Reverend donated land to the Town, \"for a Possession of a Buriing Place [sic],\" which is the oldest in Town (founded in about 1742), where his body rests with those of his family.\nHe died in 1814 at age 83. Rev. Forward's wife and two children—out of eleven—outlived him.\nVampire panic\nOne of the early cases in the New England vampire panic, in the late 18th century, was that of Rev. Justus Forward.\nConsumption, or tuberculosis, was thought to be caused by the deceased consuming the life of their surviving relatives. Bodies were exhumed and internal organs ritually burned, or, as in Rev. Forward's case, placed in the earth above the coffin. This was believed to stop the deceased \"vampire\" from attacking the local population and to prevent the spread of the disease and the deaths of loved ones.\nBy July 1788, the Reverend and his wife had lost three daughters to consumption. This included Martha, who had married a son of Capt. Nathaniel Dwight, who was among the first to settle Belchertown. She had died in 1782 at age 23. Two more were ill, including their daughter Mercy, who had begun hemorrhaging, so Justus, “consulted many about opening the graves of some of the deceased, to see whether there were any signs of the dead preying on the living.” He wrote in a letter: this morning [July 21] opened the grave of my daughter [Martha]... who had died—the last of my three daughters—almost six years ago ... On opening the body, the lungs were not dissolved, but had blood in them, though not fresh, but clotted. The lungs did not appear as we would suppose they would in a body just dead, but far nearer a state of soundness than could be expected. The liver, I am told, was as sound as the lungs. We put the lungs and liver in a separate box, and buried it in the same grave, ten inches or a foot, above the coffin.Their daughter Mercy died in January 1789 though other children survived their illness.\nLegacy\n, a descendant of the original Congregational Church.]]\nRev. Justus Forward served as minister in Belchertown for an unusually long period of time, from 1755 until his death in 1814, in an age when most clergymen had multiple appointments over their lifetimes.\nRev. Forward was called \"pre-eminently a matter-of-fact man\" and known as an evangelical and a Whig.\nHe published various sermons and theological works, was an \"avid student of foreign affairs\" and oftentimes took to making—like many theologians of the era—\"pronouncements of the legislature and the Continental Congress.\"\nRev. Forward meticulously documented births, deaths and marriages among his parishioners, records that are still kept by the Town of Belchertown, some of which are available in public databases. The Stone House Museum, Belchertown Historical Association, has a collection of his papers and ephemera in its [http://stonehousemuseum.org/wp-content/uploads/2025/01/Archival-Holdings-List.pdf inventory].\nRev. Forward's papers at Yale University contain correspondence, diaries, account books, over one thousand sermons, church papers, Yale papers (as student), one hardback book, fragments of two Congressional bills, and miscellaneous materials. The period covered is from 1752 to 1814.\nReferences"
    }
  ]
}