{
  "content": [
    {
      "type": "text",
      "text": "# Justin Edwards (actor)\n\n| death_date         =\n| death_place        =\n| occupation         = Actor, comedian, writer\n| nationality        = British\n| years_active       = 1998–present\n| spouse             = Lucy Porter (m. 2009)\n| children           = 2\n}}\nJustin Matthew Edwards (born 21 July 1972) is an English actor, comedian and writer.\nScreen career\nHis television work includes roles in Avenue 5, The Franchise , Endeavour,The Thick Of It,Death In Paradise, The Suspicions of Mr Whicher, The Old Guys, Skins, Secret Diary of a Call Girl, Fast and Loose, The Trip, Veep, ''Stewart Lee's Comedy Vehicle, and Black Mirror amongst many others. He won an RTS Award in 2014 for Best Male Actor for his performance in Father Brown (\"The Daughters of Jerusalem\").\nHe has played Jeremy Clarkson three times for television, twice for Harry & Paul, and once for Murder in Successville. In 2016 he played Mr Rumbold in the BBC remake of Are You Being Served?''\nHis film work includes the role of Charles Vernon in Whit Stillman's Love & Friendship,  Spartak Sokolov in The Death of Stalin, John Forster in The Man Who Invented Christmas, Captain Ivins in  1917 Policemen in both Paddington and Thor 2, a fop in The Duchess, Leo in Yesterday, and as Giant Haystacks and Gan in Tim Plester's short films World of Wrestling and Blakes Junction Seven.\nRadio\nEdwards is a regular voice on BBC Radio 4, having appeared on The News Quiz, ''Armando Iannucci's Charm Offensive, Cabin Pressure, The Odd Half Hour,  Kevin Eldon Will See You Now, Double Science, Mr Blue Sky and Listen Against amongst many others. He hosted five series of Newsjack'', the topical sketch show on Radio 4 Extra and wrote and performed in Miles Jupp's radio sitcom In and Out of the Kitchen. In 2016 he played Anthony Trollope in Trollope And The Labours of Hercules. In 2017, he headed up the cast of Rum Bunch, with Mel Giedroyc and Dave Mounfield, and starred alongside Meera Syal in Mrs Sidhu Investigates.\nStage\nHis theatre work includes Twitstorm at the Park Theatre, The Rivals at the Arcola Theatre, The Opinion Makers at the Colchester Mercury, Art at the Holders Festival in Barbados, and the role of Rasputin in I Killed Rasputin at the Assembly Theatre in Edinburgh. In January 2018 he joined the cast of The Ferryman as Tom Kettle and reprised the role for the Broadway production which opened in October 2018. In 2020 he joined the RSC to play Antipholus of Ephesus in The Comedy of Errors. In 2022 he played Alfred Pendlebury in a UK tour of “The Lavender Hill Mob” and in 2025 played the role of Frank Bryant in “Educating Rita” at the Barn Theatre, Cirencester.\nLive comedy\nEdwards won the Perrier Award (Best Newcomer) at the 2002 Edinburgh Festival Fringe as a member of the sketch trio The Consultants, alongside Neil Edmond and James Rawlings. They went on to write and record four series for BBC Radio 4. As booze-sodden children's entertainer Jeremy Lion he performed four acclaimed live shows at the Edinburgh Festival and Melbourne Comedy Festival, and was nominated four years running for the Chortle Awards as best character act, winning in 2006 and 2004. He was nominated for the Perrier Award in 2005 and 2006 he had a successful run at the Edinburgh Festival with his one-man musical show Unaccompanied As I Am.\nWriting\nHe was one of the main writers and performers on the BAFTA-nominated children's show ''Sorry, I've Got No Head as well as co-devising and writing the CBBC sitcom Pixelface and writing for Horrible Histories. He wrote and starred in the sitcoms Double Science (with Ben Willbond) and Buy Me Up TV for Radio Four, and one of his episodes of In and Out of the Kitchen'' won the BBC Audio drama Award for Best Scripted Comedy Drama in 2015.\nPersonal life\nBorn in Southampton, Hampshire, Edwards studied Drama at the University of Manchester before training at Mountview Academy of Theatre Arts. He is married to Lucy Porter and they have two children.\nReferences\nExternal links\n*"
    }
  ]
}