{
  "content": [
    {
      "type": "text",
      "text": "# Justice for Victims of Trafficking Act of 2014\n\n, , , , , and others.\n| agenciesaffected = United States Department of Justice Office of the Inspector General, United States Department of Justice, Administration for Children and Families, U.S. Immigration and Customs Enforcement, United States Department of Labor, United States Department of State, Department of Health and Human Services, Department of Homeland Security\n| authorizationsofappropriations = $7,000,000 for each of fiscal years 2015, 2016, 2017, 2018 and 2019, for a total of $35,000,000\n| appropriations =\n| leghisturl      =\n| introducedin    = House\n| introducedbill  =\n| introducedby    = Rep. Ted Poe (R, TX-2)\n| introduceddate  = November 19, 2013\n| committees      = United States House Committee on the Judiciary, United States House Judiciary Subcommittee on Crime, Terrorism, Homeland Security and Investigations\n| passedbody1     =\n| passeddate1     =\n| passedvote1     =\n| passedbody2     =\n| passedas2       =\n| passeddate2     =\n| passedvote2     =\n| conferencedate  =\n| passedbody3     =\n| passeddate3     =\n| passedvote3     =\n| agreedbody3     =\n| agreeddate3     =\n| agreedvote3     =\n| agreedbody4     =\n| agreeddate4     =\n| agreedvote4     =\n| passedbody4     =\n| passeddate4     =\n| passedvote4     =\n| signedpresident =\n| signeddate      =\n| unsignedpresident =\n| unsigneddate    =\n| vetoedpresident =\n| vetoeddate      =\n| overriddenbody1 =\n| overriddendate1 =\n| overriddenvote1 =\n| overriddenbody2 =\n| overriddendate2 =\n| overriddenvote2 =\n| amendments      =\n| SCOTUS cases    =\n}}\nThe Justice for Victims of Trafficking Act of 2014 () is a bill that would authorize the appropriation of $25 million annually over the 2015-2019 period for the United States Department of Justice (DOJ) to provide grants to states and other recipients aimed at improving the enforcement of laws against human trafficking and to assist victims of such crimes. According to newspaper The Hill, the bill would \"impose an additional fine of $5,000 on any person convicted of crimes related to sex trafficking, sexual abuse, sexual exploitation of children or human smuggling.\"\nThe bill was introduced into the United States House of Representatives during the 113th United States Congress.\nBackground\nThe United States Department of State has estimated that between 14,000-175,000 people annually are trafficked for sex, labor, or other types of exploitation into the United States.\nOther experts say that there are as many as 300,000 cases of sex trafficking in the United States a year, with potentially 25 percent of them having a connection to Texas in some manner. Rep. Poe, who introduced this bill, represents Texas.\nProvisions of the bill\nThis summary is based largely on the summary provided by the Congressional Research Service, a public domain source.\nThe Justice for Victims of Trafficking Act of 2014 would amend the federal criminal code to impose an additional penalty of $5,000 (~$}} in ) on any person or entity convicted of crimes relating to: (1) peonage, slavery, and trafficking in persons; (2) sexual abuse; (3) sexual exploitation and other abuse of children; (4) transportation for illegal sexual activity; or (5) human smuggling in violation of the Immigration and Nationality Act. Establishes in the Treasury the Domestic Trafficking Victims' Fund into which such penalties shall be deposited and which shall be used in FY2015-FY2019 to award grants or enhance victims' programming under the Trafficking Victims Protection Act of 2000, the Trafficking Victims Protection Reauthorization Act of 2005, and the Victims of Child Abuse Act of 1990. Allots funds to provide services for child pornography victims.\nThe bill would amend the Trafficking Victims Protection Act of 2000 to direct the United States Secretary of Health and Human Services (HHS) to make a determination, based on credible evidence, that a covered individual (i.e., a U.S. citizen or a permanent resident) has been a victim of a severe form of trafficking.\nThe bill would amend the Trafficking Victims Protection Reauthorization Act of 2005 to authorize the United States Attorney General to award block grants to develop, improve, or expand comprehensive domestic child trafficking deterrence programs to rescue and restore the lives of trafficking victims, while investigating and prosecuting offenses involving child trafficking.\nThe bill would amend the Victims of Child Abuse Act of 1990 to include human trafficking and the production of child pornography within the definition of child abuse for purposes of such Act.\nThe bill would amend the federal criminal code to: (1) increase restitution for victims of human trafficking; (2) set forth provisions for combating aggravated human trafficking racketeering; (3) allow state and local prosecutors to obtain wiretap warrants in state courts for investigations into human trafficking, child sexual exploitation, and child pornography production; (4) increase penalties for offenses involving enticement into slavery, sex trafficking of children, child exploitation, and repeat sex offenders; and (5) revise the definition of the crime of travel with intent to engage in illicit sexual conduct to facilitate prosecutions of such crime.\nThe bill would direct the Attorney General to ensure that all task forces and working groups within the Innocence Lost National Initiative engage in activities, programs, or operations to increase the investigative capabilities of law enforcement personnel in the detection, investigation, and prosecution of persons who patronize or solicit children for sex.\nThe bill would require the Attorney General to audit grants awarded under the Trafficking Victims Protection Reauthorization Act of 2005. Imposes limits on the use of Department of Justice (DOJ) funds for DOJ conferences involving more than $20,000.\nCongressional Budget Office report\nThis summary is based largely on the summary provided by the Congressional Budget Office, as ordered reported by the House Committee on the Judiciary on April 30, 2014. This is a public domain source.\nH.R. 3530 would authorize the appropriation of $25 million annually over the 2015-2019 period for the United States Department of Justice (DOJ) to provide grants to states and other recipients aimed at improving the enforcement of laws against human trafficking and to assist victims of such crimes. The bill also would establish levels of funding for 2016 through 2020 for DOJ's Crime Victims Fund.\nAssuming appropriation of the authorized amounts, the Congressional Budget Office (CBO) estimates that implementing H.R. 3530 would cost $125 million (~$}} in ) over the 2015-2024 period. We estimate that enacting the bill would not change total direct spending over the 2015-2024 period; it would reduce such spending during the 2016-2021 period and increase it over the subsequent years. We also estimate that bill would have an insignificant effect on revenues. Pay-as-you-go procedures apply because enacting the legislation would affect direct spending and revenues.\nH.R. 3530 contains no intergovernmental or private-sector mandates as defined in the Unfunded Mandates Reform Act.\nProcedural history\nThe Justice for Victims of Trafficking Act of 2014 was introduced into the United States House of Representatives on November 19, 2013 by Rep. Ted Poe (R, TX-2). The bill was referred to the United States House Committee on the Judiciary and the United States House Judiciary Subcommittee on Crime, Terrorism, Homeland Security and Investigations. On May 15, 2014, it was reported (amended) by the committee alongside [http://beta.congress.gov/113/crpt/hrpt450/CRPT-113hrpt450.pdf House Report 113-450]. It passed the House on May 20, 2014 under a suspension of the rules.\nDebate and discussion\nThe organization Shared Hope International supported the bill, referring to it as \"crucial legislation\" in a letter they wrote for citizens to send to their representatives. In the letter, they argued that the bill \"clarifies current law and codifies court decisions that the conduct of buyers who \"solicit\" and \"patronize\" commercial sex with a child are committing the crime of sex trafficking. Buyers of sex acts with children fuel the sex trafficking markets; without demand, traffickers will lose their profits and countless children will be spared the horrors of sexual exploitation.\" The organization also supported the bill for enabling state and local law enforcement to get wiretaps in state court for cases related to sex trafficking and improved on reporting systems.\nSee also\n*List of bills in the 113th United States Congress\n*Commercial sexual exploitation of children\n*Human trafficking in the United States\nReferences\nExternal links\n*[http://hdl.loc.gov/loc.uscongress/legislation.113hr3530 Library of Congress - Thomas H.R. 3530]\n*[http://beta.congress.gov/bill/113th-congress/house-bill/3530 beta.congress.gov H.R. 3530]\n*[https://www.govtrack.us/congress/bills/113/hr3530 GovTrack.us H.R. 3530]\n*[http://www.opencongress.org/bill/hr3530-113/show OpenCongress.org H.R. 3530]\n*[http://www.washingtonwatch.com/bills/show/113_HR_3530.html WashingtonWatch.com H.R. 3530]\n*[http://www.cbo.gov/publication/45349 Congressional Budget Office's report on H.R. 3530]\n*[http://beta.congress.gov/113/crpt/hrpt450/CRPT-113hrpt450.pdf House Report 113-450 on H.R. 3530]"
    }
  ]
}