{
  "content": [
    {
      "type": "text",
      "text": "# Kabwe Warriors F.C.\n\n| league = Zambian Premier League|\n| season = 2024–25\n| position = 5th\n| pattern_la1 =\n| pattern_b1 =\n| pattern_ra1 = |\n| leftarm1 = 0000ff\n| body1 = 0000ff\n| rightarm1 = 0000ff\n| shorts1 = 0000ff\n| socks1 = 0000ff|\n| pattern_la2 =\n| pattern_b2 =\n| pattern_ra2 =\n| leftarm2 = FFFFFF\n| body2 = FFFFFF\n| rightarm2 = FFFFFF\n| shorts2 = FFFFFF\n| socks2 = FFFFFF\n}}\nKabwe Warriors is a Zambian football club based in Kabwe that plays in the Zambian Premier League. They play their home games at Railway Stadium in Kabwe.\nThey were once the second most successful club in Zambia in terms of trophies won, behind Mufulira Wanderers, but have not won the league title since 1987.\nThe club is owned and sponsored by Zambia Railways, while 1xbet are the shirt sponsors and main partner of the club.\nHistory\nThe club was founded as Broken Hill United but changed their name to Kabwe Warriors in 1966.\nWarriors won their first league title in 1968 on goal difference after Ndola United, who was leading the table entering the final round, lost 2–1 on the last day of the season.\nIn 1971 Kabwe Warriors became the first Zambian side to play in now CAF Champions League, but the team performed badly. In 1972, however, the warriors represented Zambia in continental football competition and reached the quarter finals.\nWarriors lost in the quarter finals to Ghana's Accra Hearts of Oak via a 3-9 goal aggregate.\nZambian football great Godfrey Chitalu who is the club's all-time leading scorer is regarded as the club's greatest player. He played for the club between 1971 and 1982. In 1972 he scored 107 goals in all competitions for club and country; more than Lionel Messi's widely recognized record set in 2012.\nIn the 2013/14 season, Kabwe Warriors was relegated, but the club returned to the top flight after a one-year absence, winning promotion with five games left to play in the Division One North.\nIn January 2024, Lusaka international betting company 1xBet signed a sponsorship agreement with Kabwe Warriors.\nAchievements\n*Zambian Premier League: 5\n::1968, 1971, 1972, 1973, 1987\n*Zambian Cup: 5\n::1967, 1969, 1972, 1984, 1987\n*Zambian Challenge Cup: 8\n::1970, 1972, 1989, 1991, 2002, 2003, 2005, 2007\n*Zambian Coca-Cola Cup: 1\n::2006\nPerformance in CAF competitions\n* African Cup of Champions Clubs: 3 appearances\n::1972: Quarter-Finals\n::1973: Quarter-Finals\n::1988: Second Round\n::1991: Second Round\n*CAF Cup: 3 appearances\n::1996&nbsp;– First Round\n::1997&nbsp;– Second Round\n::2002&nbsp;– First Round\n*'''CAF Cup Winners' Cup: 3 appearances'''\n::1992&nbsp;– Second Round\n::1993&nbsp;– First Round\n::1995&nbsp;– Second Round\nReferences"
    }
  ]
}