{
  "content": [
    {
      "type": "text",
      "text": "# Kachin Independence Army\n\n}}\n– present\n| ideology         = Kachin nationalismFederalism\n| leaders          = Gen. N'Ban LaLt. Gen. Gam Shawng\nBrig. Gen. Gun Maw\n| headquarters     = Laiza (since 2005)Pajau (formerly)\n| area             = Kachin State, Mandalay Region, Sagaing Region, Shan State, MyanmarYunnan, ChinaNortheast IndiaChina-Myanmar borderIndia-Myanmar border\n| size             = 15,000+\n| partof           = Kachin Independence Organisation\n| allies           = Northern Alliance\n*  Arakan Army\n*  Myanmar National Democratic Alliance Army\n*  Ta’ang National Liberation Army\nOther allies\n* All Burma Students' Democratic Front\n* Chin National Army\n* Communist Party of Burma\n** People's Liberation Army\n* Karen National Liberation Army\n* Kuki National Army\n* National Liberation Army\n*  National Socialist Council of Nagaland\n*  People's Defence Force\n| opponents        = State opponents\n*\n**\nNon-state opponents\n* New Democratic Army - Kachin\n*  Shanni Nationalities Army\n| battles          = Internal conflict in Myanmar\n* Kachin conflict\n* Myanmar civil war (2021–present)\n** Operation 1027\n** Operation 0307\n*** Battle of Bhamo (2024)\n}}\nThe Kachin Independence Army (KIA; Kachin: Wunpawng Mungdan Shanglawt Hpyen Dap; ) is a non-state armed group and the military wing of the Kachin Independence Organization (KIO), a political group of ethnic Kachins in Northern Myanmar (formerly Burma). The Kachins are a coalition of six tribes whose homeland encompasses territory in China's Yunnan, Northeast India and Kachin State in Myanmar.\nThe Kachin Independence Army is funded by the KIO, which raises money through regional taxes and trade in jade, timber and gold. It is armed with a combination of AK-47s, locally made rifles (such as KA-09) and some artillery. The KIA also makes their own self-neutralizing landmines with roughly a 3-year lifespan.\nKachin Independence Army headquarters are in Laiza, in southern Kachin State near the Chinese border.\nIn 2009, before the cease-fire was broken, Thomas Fuller of the New York Times estimated the number of active KIA soldiers at about 4,000.  The Myanmar Peace Monitor currently estimates over 12,000 active troops. They are divided into eight brigades and one mobile brigade. Most are stationed in bases near the Chinese border, in KIO-held strips of territory. In October 2010, KIA commanders said that they had \"16,000 regular troops and 10,000 reservists\". In May 2012, the group had about 8,000 troops. The Kachin Independence Army members are mostly militants.\nHistory\nOrigins: 1948–1959\nIn 1949 Naw Seng, a Kachin, was a captain in Kachin Battalion 1. He went underground during the Kayin-Bama riot and joined the Karen National Defence Organization (KNDO). He was active in northern Shan State as a KNDO agent in 1950. At that time, Zau Seng was attending the government high school in Lashio. He contacted Naw Seng, and followed him underground. Naw Seng took refuge in China in 1951, and Zau Seng remained in the KNDO in Than-daung and Baw-ga-li.\nIn 1959 Gyi Loveland (Kachin name Zau Bawk), assigned as a counselor, was sent to organize residents to carry out underground operations in northern Shan State. Zau Seng and Gyi Loveland took shelter in Nam Um village, Hu Gawng district (where Gyi Loveland's mother was a teacher) and began their mission. Zau Tu (Zau Seng's younger brother, a university student) left school and joined Zau Seng underground.\nLance Corporal Lamung Tu Jai, who was studying in Theinni after he was dismissed from Kachin Battalion 4, and Lama La Ring (who returned to Kutkai after leaving university) contacted Zau Seng and formed the Kachin Independence Organization in 1960.\nZau Seng became the head of the unit; Zau Tu was its deputy head, and Lama La Ring the secretary. They provided the KIO with ammunition to form a private army with 27 members.\nInsurgency: 1960–1962\nThe KIO raided a bank on 5 February 1960. When armed attacks began, Kachin youths (organized by Zau Seng and Zau Tu) went underground. With a force of 100, the KIA and the Kachin Independence Council (KIC) were formed in Loi Tauk, Sin Li (Theinni) on 5 February 1961. Zau Seng became commander-in-chief, and Capt. Zau Bawk (Loveland) became a major. Base Camp 1 was built about  east of the village of Sin Li, near Kutkai in northern Shan State, and a basic military course was taught on 16 March 1961.\nBattalion 1 was established in Nbapa, Mammaw; Battalion 2 was established in Man Si and Mon Htan by Lama La Ring with a force of 300. Villager defense forces, equipped with percussion lock firearms, were ordered to disrupt Tatmadaw forces.\nBuddhism became the state religion on 26 August 1961, with the right to practice other religions protected by Act 17, 1962, (Law of Constitution, third amendment), but non-Buddhists believed that they had lost this right and protested. The KIO expanded beyond its original 27 members. Demonstrations protested the announcement of the inclusion of the Phimaw, Gawlan and Kanphan regions into China in the Burma–China border treaty. These changes and the federal policy of the Shan Monarchy gave the KIO an opportunity to attack, declaring their aim to establish an independent Kachin republic.\nPeace talks: 1963\nLocal peace talks were held in Rangoon (present-day Yangon) and the regions, with a meeting with the Rakhine Kway Zan Shwee's communist party held in Ngapali. Almost 300 troops were in the Lashio-Kutkai region and about 380 in Mamaw-Myitkyina in 1962. By early 1963 the KIA had one brigade, six battalions and its numbers had increased to over 1,000. The army grew after it occupied the Mamaw-Sein Lung and Mamaw-Man Wing roads, advancing to the west bank of the Irrawaddy and the northeastern Myitkyina and the Hukawng Valley.\nWhen the revolutionary council announced a local peace offer on 11 June 1963, the KIA was invited to Mamaw. Delegate Zau Dan went from Mamaw to Mandalay on 31 August. Divisional authorities met with him again on behalf of the revolutionary council on 1 September, after tentative talks with the Brigade 7 officer.\nZau Dan demanded:\n* autonomy for ethnic groups\n* self-determination, the revolution's primary aim\n* a treaty after secession, based on:\n** a mutual agreement to restore territory and sovereignty\n** peace\n** non-intervention in local affairs\n** reciprocity\n** co-existence\nThe demands for independence were denied. KIA leader Zau Tu occupied nearly all the villages in Kamaing and Bamaw during the talks. After the talks failed, the KIA amassed insurgents, weapons and ammunition; it may have numbered 20,000 by the end of 1963.\nEvolution: 1964–1965\nThe KIA could have formed one brigade and six battalions with 1,000 insurgents before the peace talks. During the talks, Zau Dan's group gathered supporters and extorted money. Zau Tu crossed the Ayeyarwady River and invaded Kamaing, a gemstone-mining region. Most villages in Kamaing were controlled by the KIA, which grew by the end of 1963.\nIn 1964, KIA formed Brigade 2. Zau Seng commanded Brigade 1, which consisted of Battalions 1, 2 and 5. Brigade 1 was based in the village of Nbapa in Mansi township. Brigade 2, commanded by Zau Tu, was based in Magibon. Battalion 7, also commanded by Zau Tu, had 800 insurgents.\nZau Tu increased the Brigade 2 strength to 1,400, and it operated in Putao, Chihpwi, Lawk Hkawng, Myitkyina, Mamaw and Kokant. Leaders Zau Seng, Zau Dan and Zaw Tu were known as \"The Three Zaus\".\nThe Tatmadaw carried out successful operations against the KIA from December 1964 to September 1965 in Gan Gaw, Aung Myay, Kaung Ya Bwam and Kha Yang as the KIA weakened in Kachin State and northern Shan State. KIA losses were 696 wounded, 377 killed, 2,223 surrendered and 1,064 arrested by the Tatmadaw.\nZau Seng went to Thailand for help, establishing a base for trading drugs and jade in the border area of Htam Ngawp. Gyi Zau Bawk, his advisor, sought assistance from SEATO in Chiang Mai, Bangkok and Farthermost in December 1965.\nDefeat: 1965–1970\nForeign Minister Maran Brang Seng went to the Chaw Kan valley to discuss the KIA's need for assistance in 1966, but the army received none. Early in the year, the Tatmadaw pulled some of its forces from Kachin State to establish the 77 Brigade and attack the Communist Party of Burma (CPB); this gave the KIA an opportunity to regroup.\nIn July 1967, Brigade 2 commander Maran Brang Seng and his comrades took military and political courses and looked for weapons. They acquired 42 rifles, 36 bombs and two boxes of bullets, returning in September. Brigade 2 commander Zau Tu left Burma (Myanmar) in October 1967, accompanied by secretary Pung Shwi Zau Seng, Maran Brang Seng and 425 men, to seek weapons and political and military training.\nZau Tu and the CPB agreed to fight the government. Zau Tu and his party acquired 800 rifles, 170,000 bullets and other equipment. In January 1968, he and his group returned and supplied weapons to Mai Ron Con Jar and Con Sar Bout Naws’ fighters. Zau Tu tried to organise the local people by preaching the Communist doctrine of Mao Zedong, but they and the KIA resisted Mao's ideology. The Maru, Lisu and Lachid minorities did not accept the policy of appointing only Jinghpaw people as leaders, and were dissatisfied with the governance of Zau Seng, Zau Dan and Zau Tu.\nIn March 1968, Ze Lum (Maru) and Zahkung Ting Ying (Lachid) seceded from the KIA. Their group of about 120 co-operated with the CPB, which settled in Kachin State, Chihpwi, Law Hkaung and Sawle in 1968.\nThe KIA clashed with the CPB; in 1969 Zau Dan and his partisans fought the Kachin, and the KIA in northern Shan State negotiated with CPB Regiments 202 and 303. In 1970, KIA Brigade 2, Regiments 5 and 6 were controlled by Zaw Tu. They smuggled jade to Thailand from Kar Mine and Pha Kant to purchase weapons. China also provided weapons and trained the Phiso Naga in India. Zau Dan provided weapons and trained the Rakhine insurgents, negotiated with Thailand and opened a headquarters in Thanwoo.\nConflict with the CPB: 1971–1972\nIn 1972, the KIA fielded 2,950 insurgents and the army in Thanwoo was led by Zaw Seng. Brigade 1, led by Zau Dan, was in Kutkai, Lashio District and Mamaw. Brigade 2, led by Zau Tu, was in Hpakant and Myitkyina. They tried to increase the trade of jade.\nIn Brigade 1, Lum Dau led Battalion 2, Zau Bawm led Battalion 8 and Dau Hkawng led Battalion 9; they were responsible for Lashio district. Dwa Yaung led Battalion 1 and Gawruledwa led Battalion 5; they were responsible for Mamaw district.\nIn Brigade 2, Zau Tu led 1,469 insurgents. Zau Bawk led Battalion 3, Zuk Dai led Battalion 4, Lama La Ring led Battalion 6, Zau Bawk led Battalion 5, Mading Kyang Yaw led Battalion 10 and Kadaw Zau Seng led Battalion 11. They were responsible for Myitkyina district and western Ayeyarwady.\nCommunism and foreign aid\nIn 1950, CPB members began to go abroad for political and military training. In July 1967, party leader Maran Brang Seng and 34 others went abroad.\nThe KIA accepted communism, and other countries agreed to provide political and military aid. From 4 November 1967 to 27 January 1968, 425 KIA insurgents led by Zau Tu, Zau Dan, Lamung Tu Jai, Maran Brang Seng and Pung Shwi Zau Seng held talks abroad with Ba Thein Tin and Naw Seng. The KIA received political and military assistance from abroad , and conducted more military operations.\nAt the end of 1976, the KIA had nine regiments with 1,750 troops in Kachin State, 500 in northern Shan State and received ammunition from Zau Seng in Thanwoo. In 1968 they fought in the Myitkyina area, occupied camps at Kowapan, Duyitgar and Tingarukaung and established Regiment 10, led by Zaw Dan\nAlthough Zau Tu accepted communism, his subordinates and the public did not; the KIA was based on racial and religious beliefs, rather than ideology. In March 1968 Regiment 4 Group 1 leader Maru Ze Lum, Group 5 leader Zahkung Ting Ying and 120 followers left the KIA and the country. The Ze Lum and Zahkung Ting Ying groups became CPB Regiment 10, upsetting the army.\nThe CPB asked Kachin Captain Naw Seng to lead KIA and Kachin natives. An April 1968 meeting at KIA Brigade 2 headquarters designated Naw Seng's forces as the chief enemy, and the army began fighting them in June. Zau Tu rejected communism and the KIA, fighting the CPB, accepted outside aid. In 1969, they sent Indian Fiso Narga insurgents abroad for training. They obtained ammunition through Narga from overseas and forcibly conscripted 13-year-old boys and girls.\nBattalions 1, 2, 5, 8 and 9 made up KIA Brigade 1, and Battalions 3, 4, 6 and 7 were Brigade 2. The KIA contacted the Tatmadaw and tried to forge a relationship against the CPB.\nZe Lum and Zahkung Ting Ying left the KIA after their return from foreign training and formed Bakapa Battalion 101. Ze Lum and 200 insurgents entered the Khantan valley road on 19 May 1969 and Kanpaitee the following day. On 27 May, Zahkung Ting Ying and 200 insurgents attacked the Tanlon police station. They fought the KIA in Chiphwe, Lawkhaung and the Sawlaw region in eastern Maykha. Zaw Dan made an agreement with the Tatmadaw in the Kutkai region. In February 1969, they ambushed a Brigade 4 convoy. They agreed to a ceasefire with CPB Brigades 202 and 303.\nA July 1969 KIO committee meeting created a master plan for an independent Wunpawng group. The plan covered political beliefs and objectives, defined the enemy and described the basics of Wunpawng development and foreign relations.\nZau Tu's group recruited personnel, training them as village defense forces (VDF), local guerrilla forces (LGF) or commando forces and forcing village leaders to attend the training courses. In 1970, they agreed to accept 220 KIA and 150 Bakapa from the Kathar district for training.\nIn May 1970, the KIA provided weapons and ammunition to Rakhaine youth led by Tun Shwe Maung, attempted to enlist the co-operation of Kachin, Naga, Mizo and Rakhine insurgents to co-operate and requested military assistance from East Pakistan. The CPB and KIA then agreed on a ceasefire. The CPB entered Mungbaw secretly, setting off renewed fighting. The failure of the ceasefire led the KIA to attempt an agreement with the Tatmadaw. The army recognized the government as a common enemy, and Lamung Tu Jai and CPB leaders reached an agreement in Mungbaw. The KIA could not refuse foreign support or accept the CPB, forcing them to alternate between the Tatmataw and the CPB as allies and opponents.\nIn December 1971, the KIA grouped Battalion 11 into four columns and tried to fight the Tatmadaw. Battalions 5, 6 and 12, led by Zaw Tu, became the \"leopard column\" in the western Ayeyarwady area. Battalions 1, 2, 8 and 9 were the \"elephant column\", led by Zau Dan in Kwutkhaing. In the eastern Ayeyarwady area, the \"lion column\" (Battalions 3 and 10) was led by Khanhtwe. In the Putao region, the \"rhinoceros column\" (Battalions 4 and 7) was led by Zawein. Although the CPB and KIA reached an agreement, they fought again in 1972. When the CPB penetrated KIA-held regions, the army sent a delegation to the Tatmadaw. They stopped fighting and conferred in northern Shan State, communicating with the Tatmadaw to receive through Thailand. Working with the Tatmadaw provided a temporary respite from confrontation with the CPB.\nTo fight with the Tatmadaw, the KIA requested arms, ammunition and medical supplies. On 10 June 1972, the KIA stopped fighting to organize youth and collect unpaid revenue. Under the pretext of stopping the CPB, they resumed military operations and attempted to recruit Palaung Battalion 2 under Zau Dan.\nA KIA central-committee meeting was held in Samarbon, and on 29 August 1972 another central-committee meeting was held in the Hukawng Valley. The Tatmadaw rejected an agreement on 3 October 1972; on 27 October, the central committee decided to have four brigades instead of the original two.\nBrigade 1 was commanded by Too Jaing in northern Kachin State. Brigade 2 was commanded by Zau Tu in the western part of the state; Brigade 3 was commanded by Zau Mai in the east, and Brigade 4 was commanded by Zau Dan in the south.\nZau Seng was commander-in-chief, and Zau Tu vice-commander-in-chief. They formed the Kachin Freedom Council (KIC), which was the central committee.\n{|class=\"wikitable\"\n|+Central Committee\n! Rank !! Name !! Position\n|-\n|Brigadier || Zau Tu || Chairman\n|-\n|Salang Kaba || Pung Shwi Zau Seng || Secretary\n|-\n|Colonel || Lamung Tu Jai || Co-secretary\n|-\n|Colonel || Zau Dan || Member\n|-\n|Salang Kkaba || Maran Brang Seng || Member\n|-\n|Lieutenant-colonel || Lama La Ring || Member\n|-\n|Salang Kaba || Zau Aung || Member\n|-\n|Lieutenant-colonel || Zau Mai || Member\n|-\n|Major || Maran Brang Tawng || Member\n|-\n|Major || Hkun Cho || Member\n|-\n|Major || Zaw || Treasurer\n|-\n|Major || Zaw Hpan ||\n|}\n{|class=\"wikitable\"\n|+Kachin Freedom Council staff\n! Rank!! Name !! Title\n|-\n|Major General|| Zau Seng|| Chairman\n|-\n|Brigadier|| Zau Tu|| Vice-chairman (Brigade 2)\n|-\n|Colonel|| Tu Jai|| Secretary (Brigade 1)\n|-\n|Colonel|| Zau Dan || Member (Brigade 4)\n|-\n|Lieutenant-Colonel|| Lama La Ring || Associate-Secretary Colonel\n|-\n|Lieutenant-Colonel|| Zau Mai|| Member (Brigade 3)\n|-\n|Major || Brang Tawng|| Member\n|}\nThe KIA was organized into sections, platoons, companies, battalions and brigades. Battalions 4, 7 and 10 were in Brigade 1, Battalions 5, 6 and 11 in Brigade 2, Battalions 1 and 3 in Brigade 3 and Battalions 2, 8 and 9 in Brigade 4. Brigade commanders headed the division administration, battalion commanders the district administration, group leaders the township administration and small-group leaders administrative units.\n{|class=\"wikitable\"\n|+ KIO leadership\n! Rank !! Name !! Title\n|-\n|Brigadier||Zau Tu||Chairman (Brigade 2)\n|-\n|Colonel||Tu Jai||Vice-chairman (Brigade 1)\n|-\n|Salang Kaba||Pungshwi Zau Seng|| Secretary\n|-\n|Colonel||Zau Dan||Associate Secretary\n|-\n|Lieutenant-Colonel||Lama La Ring||Member\n|-\n|Lieutenant-Colonel||Zau Mai||Member\n|-\n|Colonel||Maran Brang Tawng||Member\n|-\n|Salang Kaba||Maran Brang Seng||Member\n|}\nKachin insurgents were organised as fighting and administrative forces. Leadership remained influenced by the Zau brothers (Seng, Tu and Dan). Zau Seng was the first Kachin insurgent leader to live in Thailand. The front-line military headquarters (FGHQ) was in the village of  Kaut Lun in the Maji Bum region. All Kachin insurgents were generally called \"KIA\".\nThe CPB, appointing Naw Seng as military leader, intended to co-opt insurgents into their party after exploiting the KIA as a subordinate organization. However, they were dissatisfied with  Naw Seng's position (favoring fighting the KIA). They secretly arrested and killed Naw Sengi and a Wa national leader on 8 March 1972, claiming that  Naw Seng died by falling into a gully. When the KIA learned how Naw Seng was killed, violence ensued.\nThe KIA communicated with neighboring countries and their insurgent groups, and tried to organize small insurgent groups. They acted as a buffer between Phizo's Naga Army, Mizo insurgents and foreign countries, and sent Phizo Naga to foreign countries via Myanmar in return for arms and ammunition.\nThey sent a Mizo insurgent group abroad in March 1973, and signed a contract with local Naga insurgents on 2 June establishing terms for supplying military training and arms. The KIA trained 100 Naga insurgents at the India-Myanmar border, south-west of Khar Shay. Its headquarters were managed by Zau Seng in Thanwoo, Thailand.\nIn Shan State, insurgent groups included Pa Laung and Pao. The Pa Laung National League, led by Kham Taung, organized Shwe Pa Laung and Ngwe Pa Laung nationals in the Mone Wee, Nant San and Mong Ngue regions. Pa Laung insurgents came under the leadership of Zau Dan in 1972. The KIA cooperated with Pa Laung nationals to face the CPB.\nThe Shan State Army (SSA) settled in Thailand and developed a movement in Lwe Khay in northern Shan State. SSA headquarters was run by Chairman Khun Kyar Nu and secretary Set Say Wai. In the Lwe Khay region, it was led by Vice-chairman Ohn Paung Pon Taing and Chief-of-Staff Sai Hla Aung. In March 1973, they removed Maha Daewi Nann Hein Kham as president. On 24 May 1973, the SSA joined the Koe Kant insurgent groups Law Sit Han, Maha Sann (from Bain Nginn) and Lai U (from Man Man Sai) in the Man Pa Laung Lwe Khay region.\nThe Shan State Progress Party planned to co-operate with the CBP, and chose a representative to follow Sa Kaw Lae Taw. Joint Secretary Say Htin, 200 members and three representatives arrived in Pan Sann in October 1973. On 18 November, they agreed on military co-operation. They took arms and ammunition and left Pan Sann on 27 November 1973, arriving in the Mong Bon region on 17 April 1974.\nThe agreement led the KIA to fight the SSA in 1974 in the Kyauk Mae, Nan Ma Tu region. In April, they reached an agreement. After the Thai government broke up the Koe Kant insurgent group, a remnant of 20 took refuge at the Thai border and joined the KIA. Kyan Suu Shin led 300 insurgents from the Lwe Maw group (Khun Sar group) to work with KIA Battalion 8. The KIA and the Loi Maw group agreed to assist each other.\nChinese Military Divisions 3 and 5 settled in northern Thailand, and often operated in Burma. They were fought by the KIA and the CBP. To operate in the Lwe Say, Man Palaung, Man Kyaung, Sut Yet and Wun Sinn regions, the KIA cooperated with the Kuomintang.\nThey cooperated with Moe Hein, Koe Kant insurgents (Law Sit Han), Lwe Maw insurgents (Khun Sar) and Pa Laung without the co-operation of the SSA, who supported the CBP. In the west, the KIA supported local, Naga and Rakhine insurgents.\nNaga National Council (NNC)\nTo avoid arrest, Phizo Naga took refuge in the Naga mountain region in Khann Tee Division in 1963. The KIA helped him flee through Kachin territory.\nThe Naga insurgency began with the founding of the Naga Club in Kohima in 1918. They submitted a memorandum to the Simon Commission to exclude the Nagas from any constitutional framework of India. With the coming of Angami Zapu Phizo (popularly called Phizo), the Naga movement gained momentum during the late 1940s.\nUnder Phizo's leadership, the NNC declared the independence of Nagaland on 14 August 1947. However, Phizo was arrested in 1948 by the Indian government for rebellion. When he was released, he became the NNC President in 1950.\nIn 1953, a meeting was organised between Indian Prime Minister Jawaharlal Nehru and Burmese Prime Minister U Nu to establish formal borders between India and Burma. Separatist leaders described the meeting as a division of Naga territory between the two countries. Nehru and U Nu visited Naga areas in both countries. When they visited Kohima on 30 March 1953, the district deputy commissioner prevented the NNC delegation from meeting Nehru (apparently without Nehru's knowledge) and the NNC boycotted Nehru's public meeting. The Nagas inhabit the states of Nagaland, Manipur, Assam and Arunachal Pradesh in northeastern India and Burma's Sagaing Division and Kachin State.\nAssassination of KIA leaders\nAfter unsuccessful discussions with the Tatmadaw in October 1972, fighting continued. Zau Tu went to Thailand in December 1973, and was replaced by Lamung Tu Jai. The KIA was defeated by the CPB and the Tatmadaw in 1973 and 1974.\nCPB Regiment 101 penetrated Sa-Done in eastern May-Kha. On 1 March 1975, at a battle between KIA and CPB, Zau Dan was killed in action. CPB Regiment 202 attacked KIA Combat Team 4's area, and CPB Regiment 2 penetrated KIA Regiment 2's area in East Kutkai via Man-Yon-Maw. Zau Mai succeeded Zau Dan, and stopped the CPB in Nant-Hai and Nant-Saung-Kye while Zau Seng and Zau Tu were in Thailand. On 2 February 1975, KIA leader Pungshwi Zau Seng and his team left for Thailand. Zau Seng, Zau Tu and Pungshi Zau Seng misused funds from the trade in opium and jade.\nZau Seng's power disappeared when he was out of direct contact with the KIA for about 10 years. Zau Tu was disliked by his subordinates; after he forbade marriage for his troops, he married Law Woi Lu Awn in 1966 and Labya Seng Tawng in 1973. The leaders' personal lives cost them the respect of their subordinates.\nFormer KIA Regiment 11 commanding officer Seng Tu executed Zau Seng, Zau Tu and Pungshwi Zau Seng in Htan-Ngop, at the Thai Border Camp, on 10 August 1975. KIA headquarters explained to the district and division committees that the leaders were executed because they manipulated the organisation. Gawlu La Doi and other leaders claimed that Seng Tu was a spy, and he silenced the leaders. Thai police arrested Seng Tu on 29 September. Zau Mai sent Regiment 8 commanding officer Khun Cho to Thailand to investigate.\nZau Mai commanded the Kyaung-Nat operation, focused on CPB Regiment 202, on 26 March 1975. He led combat team 4 against the CPB ten times beginning on 1 November 1975, with heavy losses on both sides. Combat team 1 chief Lamung Tu Jai became the KIA commander-in-chief and chief of combat team 4, and Zau Mai became deputy commander-in-chief.\nMaran Brang Seng's leftist group strengthened after the executions, creating an opportunity to co-operate with the CPB. In 1976, Maran Brang Seng became the KIA leader and decided to ally with the CPB.\nNew Democratic Army - Kachin (NDA-K) is a group which split from the KIA. Led by Zahkung Ting Ying, it affiliated with the CPB in 1968 and became the NDA-K in December 1989.\nCeasefire era : 1994–2011\nThe KIA neither disarmed nor surrendered, continuing to recruit, train and mobilise soldiers. Before the ceasefire the KIA was primarily a guerrilla force, but peace provided an opportunity to establish a military academy and design officer-training programs. By working with the KIA, the Tatmadaw capitalized on the resource-rich lands under KIO control providing limited recognition in exchange for access to and security of resources like jade, teak and rubber.\nThe KIO's Buga company built 2 hydro-electric dams to power the KIO control areas and sells power to civilians outside of its areas as well as the Burmese army. The Burmese government built 2 hydroelectric dams in the same era,  but they both broke and provide no electricity.\nAlthough the ceasefire was still in place, in 2009 many Kachins expected a renewed outbreak in conjunction with the elections scheduled for 2010. The military junta demanded that all ethnic armies disarm, because the constitution requires only one army in Myanmar. According to KIA chief of staff Gen. Gam Shawng Gunhtang, the demand to disarm was \"not acceptable\". In February 2010, Gam Shawng said: \"I can't say if there will be war for sure, but the government wants us to become a border guard force for them by the end of the month ... We will not do that, or disarm, until they have given us a place in a federal union and ethnic rights as was agreed in Panglong Agreement in 1947\".\nThe Education and Economic Development for Youth (EEDY) program started by then Maj. Sumlut Gun Maw trains Kachin youth for a multi-month Kachin political history, cultural traditions & Jinghpaw language.  Many EEDY graduates joined the KIA/KIO sometime after completing EEDY, bringing in a new generation of leaders to the KIO's ranks.\nStarting in 2008 tensions began to rise between the KIO & the Tatmadaw over the Chinese Myitsone dam at the confluence of the Irrawaddy (Mali Hka) river and the demand that the KIA transform into a Border Guard Force.  The Burmese army ordered its helicopters to hover over KIA posts to solicit an attack for months in early 2011. Both of these issues continued to heat up leading to the breaking of the cease-fire on June 9, 2011.\n2011–2021\nIn 2011, General Sumlut Gun Maw confirmed that fighting had resumed. One reason for breaking the ceasefire was the creation of the Myitsone Dam, which required the inundation of dozens of villages in Kachin State.  The other main reason being the demand from the Tatmadaw for the KIA to transform into a Border Guard Force (BGF).  As a BGF, the KIA would need to include Burmese troops and officers in their ranks.\nDuring this period, despite the ongoing conflict, the KIO continued to develop and expand social services such as opening the Federal Law Academy & the Mai Jai Yang College.  Since the resumption of the conflict in June 2011 the Laiza municipal hospital operates mostly free of charge.\nThe KIO/KIA moved its HQ from its pentagon on A len Bum mountain to the Laiza Hotel, renting every room on the Laiza Hotel for several years.\nFighting continued throughout this period with little real change of borders.\nThe Kachin conflict displaced approximately 150,000 people since cease fire was broken and killed hundreds.\nThousands of protesters gathered in Myitkyina on 20 December 2013 to protest the forcible recruitment of ethnic Shan people for the KIA, which reportedly recruited about 100 Taileng insurgents from Mansi Township in late 2013. DVB Multimedia Group |access-date=29 December 2013 |archive-date=27 November 2013 |archive-url=https://web.archive.org/web/20131127100222/http://www.dvb.no/news/shan-civilians-accuse-kachin-rebels-of-human-rights-abuses/34002 |url-status=live }}[http://www.irrawaddy.org/burma/red-shan-protest-forced- recruitment-kia.html Kachin Rebels Accused of Forced Recruitment in Myanmar | The Irrawaddy Magazine]\nIn June 2019, a large demonstration in Myitkyina, Kachin State, led by the Lisu National Development Party (LNDP), protested alleged killings and abuses of Lisu civilians by the KIA. The protest was sparked by the deaths of three Lisu men in Hpakant Township in March, reportedly detained and killed by KIA soldiers after entering restricted forest areas used for hunting and foraging. The LNDP demanded that the KIO take responsibility, stop violence and forced recruitment of Lisu civilians, and provide compensation to victims’ families. The demonstration attracted thousands, included Lisu and some Shan-ni participants, and caused concern over escalating ethnic tensions between Lisu and Jinghpaw (the dominant Kachin subgroup). The event exposed deeper fractures within the multi-ethnic Kachin society, as some Lisu accused the KIA/KIO of marginalization and violence.\n2021–present\nAfter 2021 Myanmar coup d'état has Kachin Independence Army increased its activity and has seized 10 Myanmar military bases.   The KIA took over Kachin Special Region 1 from the New Democratic Army-Kachin (NDA-K) and regained control of 100's of Rare Earth Elements.  The New Democratic Army-Kachin was allied with the government military.\nFrom 2025 China has  been pushing the KIA to end the fighting and stop training / arming other Ethnic Armed Organizations (EAOs). China has stopped cross-border trade rising fuel prices many times. So far the KIA has not stopped fighting or supporting other EAOs.\nThe KIA has also retaken control of most of the jade mines in Hpakant, which they lost when they signed the ceasefire in 1994. The jade mines generate US$31 billion per year.\nIn December 2024 the KIA, All Burma Students Democratic Front (ABSDF) and others EAOs, launched an operation to capture Bhamo. The fighting continues with daily battles.  The outcome of the battle of Bhamo is closely watched and is widely believed to be a decisive battle, with the winner taking the clear strategic upper hand.\nNotes\nReferences\n*\n*\n*\n*  \"This article was amended on Monday 31 August 2009 to remove references to the alleged age of SSA soldier\"\n*\n*\nFurther reading\n*\n*"
    }
  ]
}