{
  "content": [
    {
      "type": "text",
      "text": "# Kachchaleswarar Temple\n\n|coordinates_footnotes=\n|map_caption          = Location in Chennai\n|sanskrit_translit    =\n|country              = India\n|state       = Tamil Nadu\n|district             = Chennai\n|locale               = 77 Armenian Street\n|elevation_m          =\n|elevation_footnotes  =\n|deity        = Kachchaleswarar (Lord Shiva)\n|festivals  =\n|architecture = Hindu temple architecture\n|temple_quantity    = 1\n|monument_quantity  =\n|inscriptions         =\n|established     =\n|year_completed           = 1725\n|creator              = Kalavai Chetty\n|temple_board         =\n|website              =\n}}\nKachchaleswarar Temple, also known as the Great Kachali Pagoda, is a Hindu temple located in Armenian Street, in the neighbourhood of Parry's corner (Old: George Town) in Chennai city, Tamil Nadu, India. Constructed on land belonging to dubash Kalavai Chetty in 1725, the temple belonged to the left-hand castes and was the site of the first major conflict between left and right-handed castes in the then Madras city.\nThe temple is modelled on the Kachaaleshwarar temple at Kancheepuram. Kachaaleshwarar (Shiva) is the main deity and Soundaraambika (Parvathi), the consort deity.\nHistory\nThe temple was built in 1725 by Kalavai Chetty, a 'dubash' working for the British East India Company, on a land belonging to him. Chetty was a devotee of Lord Shiva at the namesake temple at Kanchipuram, who used to visit it regularly. When torrential rains prevented him from commuting between Kanchipuram and Chennai, he and his wife Sundariammal decided to build a new temple to the same deity at Chennai and constructed the temple and consecrated within a period of three years by 1728. The street on which the temple stands was originally came to be known as \"Katchala Pagoda Street\", after the \"Great Kachali Pagoda\" as the temple was known then. A huge retinue of dancing girls were attached to the temple in the earlier days. These dancing girls resided in a quarter adjoining the temple since about 1700.\nThe temple happened to be the cause of one of \"Black Town's\" first caste disputes as it belonged to the Left-Hand Caste. With the government's intervention, a new approach to the temple was built without encroaching on Right-Hand Caste property.\nA plaque in the temple records the year of the first kumbhaabishekam (consecration) as 1728. Post-Independence, a mahaa-kumbhaabishekam (great consecration) was held on 8 July 1962. A major renovation of the temple began on 20 February 1984 and another great consecration was held on 9 July 1989.\nThe temple\nThe main deity of the temple is Lord Kachchaleswarar (Shiva) and his consort goddess Soundharambika (Parvathi). A five-faced Ganesh and Subramanya abut the main sanctum. The main idol is a 5-tier Shiva Ling, a structure known as the panchasanam, adored with tortoise, serpent, simhasanam (lion-throne), yugasanam, kamalam (lotus) and vimalam. A Shiva–Parvathi idol is present behind the main Shiva Ling. The inner corridor has several idols including the Shivite saints such as Sambandar, Appar, Sundarar, and Manikkavacakar; Kachchappa Shivacchariyar; and Haradhatta; among others.\nOther shrines in the temple include Navagraha, Dattatreya, 63 Nayanmars, and Ayyappa.\nSee also\n* Religion in Chennai\n* Heritage structures in Chennai\nReferences\nFurther reading\n*"
    }
  ]
}