{
  "content": [
    {
      "type": "text",
      "text": "# Kadeem Edwards\n\n| birth_place = Sanford, Florida, U.S.\n| death_date  =\n| death_place =\n| height_ft   = 6\n| height_in   = 4\n| weight_lbs  = 313\n| high_school = Seminole (Sanford, Florida)\n| college     = Tennessee State\n| draftyear   = 2014\n| draftround  = 5\n| draftpick   = 143\n| pastteams   =\n* Tampa Bay Buccaneers ()\n* Jacksonville Jaguars ()*\n* Dallas Cowboys (–)\n| status      =\n| highlights  =\n* Second-team FCS All-American (2013)\n* 2× All-OVC (2012, 2013)\n* Second-team All-OVC (2011)\n| pfr         = EdwaKa00\n}}\nKadeem Edwards (born January 24, 1991) is an American former professional football offensive guard in the National Football League (NFL) for the Tampa Bay Buccaneers, Jacksonville Jaguars, and Dallas Cowboys. He was selected by the Buccaneers in the fifth round of the 2014 NFL draft. He played college football at Tennessee State University.\nEarly life\nEdwards attended Seminole High School. As a senior in 2009, he helped the team win the State Championship title, coming back from a 21-point deficit. He received third-team 6A All-State honors.\nCollege career\nEdwards accepted a college football scholarship from Tennessee State University. As a redshirt freshman, he started 9 out of 10 games, while sharing duties at left guard. As a sophomore, he started the first 10 games of the season.\nAs a junior, he started all 11 games. As a senior, he was the team's top lineman, starting 13 games at left guard, while helping the school achieve a 10–4 overall record and second place in the Ohio Valley Conference. He finished his college career with 41 starts out of 45 games.\nProfessional career\nTampa Bay Buccaneers\nEdwards was selected by the Tampa Bay Buccaneers in the fifth round (143rd overall pick) of the 2014 NFL draft. He signed his four-year rookie deal on May 16. He was declared inactive for the first 9 games. On November 11, he was placed on the injured reserve list with a foot injury.\nHe was waived on September 6, 2015. On September 7, he was placed on the injured reserve list with a foot injury. On September 14, he was released from injured reserve.\nJacksonville Jaguars\nOn November 9, 2015, Edwards was signed to the practice squad of the Jacksonville Jaguars. On September 3, 2016, he was released by the Jaguars.\nDallas Cowboys\nOn November 8, 2016, Edwards was signed to the Dallas Cowboys practice squad. He signed a reserve/future contract with the Cowboys on January 16, 2017.\nOn September 2, 2017, Edwards was waived by the Cowboys and was signed to the practice squad the next day. On December 29, 2017, he was promoted to the active roster after left tackle Tyron Smith was placed on the injured reserve list.\nOn September 11, 2018, Edwards was released, after the Cowboys claimed center Adam Redmond off waivers.\nReferences\nExternal links\n* [https://www.tsutigers.com/football/roster/2011-12/4296/kadeem-edwards/ Tennessee State Tigers bio]"
    }
  ]
}