{
  "content": [
    {
      "type": "text",
      "text": "# Kadero (archaeological site)\n\n|map_caption=Location of Kadero in Sudan|length=|map_size=|altitude_m=|altitude_ref=|relief=yes|location=Sudan|region=|type=|part_of=|notes=}}\n|zoom=10\n|width=300\n|height=200\n|caption=Interactive map showing location of Kadero\n|label=Site at Kadero\n|mark-coord=\n|label-pos=\n|mark-title=\n|mark-image=\n|mark-description=Prehistorical archaeological site containing two middens and a burial site.\n}}\nKadero is an African archaeological site located in Central Sudan, northeast of Khartoum, Sudan and east of the Nile River. The site consists of burial grounds and two sand mounds around 1.5 meters in elevation, altogether encompassing around three hectares. Excavations at the site were led by Lech Krzyżaniak at the University of Warsaw. Kadero was occupied during the Neolithic period, dating to the years 5960 through 5030 B.P specifically, by pastoralists. The inhabitants of Kadero left behind evidence of intensive pastoralism, which is the earliest evidence of such phenomena in the area. Analysis of ceramics and stone artifacts have led archaeologists to consider the site as comparable to other early Neolithic sites in central Sudan, such as Ghaba and R12, placing the site in the early Khartoum culture.\nContext\nKadero is one of thousands of Neolithic sites in Sudan, which are mostly concentrated near the Nile River. The economy of the people at Kadero was likely one of pastoralism, more specifically cattle husbandry, and gathering. Kadero may have served as a home base for peoples that inhabited a larger area, moving to nearby sites during dry seasons. The peoples at Kadero are believed to have been part of the early Khartoum culture, living similar lifestyles to those in the area. Human settlement at Kadero was at its highest during the early Neolithic Period, but the area was used as a burial site and a seasonal settlement up to the Late Neolithic. The decrease over time in settlement of Kadero is likely explained by a transition to a more nomadic lifestyle in the Late Neolithic.\nArchaeological findings\nHistory of archaeological work\nH.N. Chittick was the first archaeologist to document the site in 1955, but work was only done at the surface level. Excavations at Kadero were conducted from 1972 to 2003 by teams led by Lech Krzyżaniak. These excavations were done with support from the Polish Center of Mediterranean Archaeology at the University of Warsaw and the Poznań Archaeological Museum throughout the project; on-site training was done with students from Khartoum University as well as students from other countries. Excavations of the site stopped after the death of Krzyzaniak.\nDescription of site\nThe two sand mounds, referred to as the northern and southern middens, contain much of Kadero's artifacts. The northern midden is estimated to have originally had an area of around 600 square meters, and the southern midden around 250. Both of these mounds contain artifacts from the same period and are considered to be part of the same site. These middens were used as a waste collection area for the inhabitants of the area. Erosion in the area has made the material culture and burials within the site close to the surface of the ground or only slightly underground, which has negatively affected the quality of preservation of these objects.\nHuman remains\n248 graves have been found at Kadero, 218 of them dating to the Neolithic period and the rest dating to the Meriotic and Post-Meriotic. Out of the 218 Neolithic graves, only 2 date to the Late Neolithic. Bodies within these graves were buried on their sides, with their hands placed close to the face and their feet close to the head. This constricted, tight positioning was most drastic in Neolithic skeletons but was present throughout the site. It is possible that bodies were buried in tight containers or bound in order to maintain this positioning. In the Post-Meriotic or Christian graves, bodies were positioned on their right sides or on their backs.\nArtifacts\nThe burial sites in Kadero are a rich source of artifacts, as many bodies were buried with goods. These include grinding stones, flaked stones, necklaces, and beads made from bone. Most of the human remains were accompanied by pottery and jewelry, such as carnelian bead bracelets or necklaces, deep bowls, and marine shell necklaces. Similarly to the cemeteries at Ghaba, Amazonite beads were present but rare. The graves with the highest amounts of goods were located in the center of the cemetery; these graves were from both the Early and Late Neolithic.\nStone tools were especially numerous at the site, most of which were made from quartz. As was typical of Neolithic stone tools, the tools found at Kadero were created with flake production techniques. The most prevalent types of stone tools were gouges, axes, and hammers, but grindstones and hoe blades have also been found.\nPottery found at Kadero has been studied extensively. Over 200,000 samples of pottery and 100 complete vessels have been found at the site. Types of vessels include bowls, jars, and pots, which came in different shapes, rim shapes, and decoration styles. Artwork on pottery was typically characterized by geometric patterns, such as wavy lines. Pottery was typically made from quartz sand, silt, and other minerals found in the area.\nAnimal and plant remains\nAround 36,000 animal bones have been collected by archaeologists at Kadero. These remains have been divided into four groups: animals that were used for food, shells originating from the Red Sea or Indian Ocean, and early or late intrusive species. Most of the animal remains found at the site were that of animals that had been eaten. These animals were mainly fish, birds, and mammalian game; the main mammalian food source was antelope. Discarded shells from species such as Limicolaria flammata, Pila ovata, Nile mussels, and river oysters have been found at the site. Remains of domesticated animals have been found at the site, including cattle, sheep, goats, and dogs.\nCereal remains have not been found at Kadero, however, evidence for intensive usage of plants has been found using plant impressions in pottery. Wild grasses, including sorghum, were identified in these impressions. The only plant remains that have been found are pieces of charcoal and charred pieces of Zizyphus and hackberry fruit stones, which have been found both in graves and in the middens. This lack of preservation of plant remains can be explained by wind erosion and subsequent exposure to the elements.\nInterpretations\nPastoralism\nThis site is regarded as prominent because it has provided archaeologists with the first evidence of intensive pastoralism in its area. The inhabitants of Kadero collected resources from a variety of animals, but the archaeological record shows a preference for cattle. The large numbers of cattle bones found at Kadero is unusual for sites inhabited by pastoralists. It is possible that the site was more of a ritualistic center than other areas the pastoralists inhabited, which could explain the prevalence of cattle bones. Kadero is one of many sites that shows domestication of animals such as cattle and goats occurring at the same time as the adoption of dairying; however, this is not a universal experience across Neolithic Africa.\nIt is possible that early farmers at the site planted wild cereals, including sorghum, as impressions of wild cereals have been identified in pottery. Many of the stone tools found at the site then can be explained as tools for preparing these plants, but data is limited. Evidence of the usage of wild sorghum as a food source is prevalent throughout Neolithic eastern Africa, and it has been argued that the Central Sudanese during the time period could have harvested wild cereals but did not necessarily domesticate the plant.\nThe adoption of intensive pastoralism at the site has been theorized to have come from the immigration of pastoralists to Kadero or the introduction of the livestock that pastoralism requires into the region. Pastoralism would have been a way to maximize the available resources in the area, in response to a Mid-Holocene drying of the Nile Valley or the availability of land on which livestock could graze. Although the explanations as to how and why the people at Kadero began to adopt pastoralism vary, the seasonal patterns of food collection are much more clear. In the dry seasons, collection of freshwater snails and fishing in flood plains was likely the main foodway for inhabitants at Kadero, while fishing and grazing livestock further from the Nile were conducted during the wet season.\nSocioeconomic conditions at Kadero\nArchaeologists believe that the artifacts at Kadero are representative of a culture with a social structure and funerary practices. Kadero is considered to be a unique site because of the presence of both a settlement and a burial ground, which has allowed for a more complete understanding of the lives of the people who inhabited Kadero than is possible at many sites. The cemetery shows evidence of social stratification, as some graves are much more heavily stocked with goods than others, which is considered to be atypical within Neolithic pastoralist cemeteries. Contemporaneous sites to Kadero include Zakiab, Um Dereiwa, Ghaba, and R12, and archaeologists believe that Zakiab and Um Dereiwa were inhabited by the same peoples as Kadero. The lack of cemeteries at Zakiab and Um Dereiwa supports the archaeological belief that these three sites were interconnected.\nSkeletal analysis suggests that the Neolithic peoples at Kadero may have lived a more economically comfortable life than their counterparts in Europe. Skeletons found in this area were older than those found in burial sites in Neolithic Europe, which is likely explained by the higher availability of food and less harsh climate in the Nile valley of Sudan as compared to burials examined in Europe. However, sample sizes have been comparatively small and skeletons were poorly preserved, which limits the ability of archaeologists to definitively interpret the data left behind by these skeletons.\nThe vast amount of objects found at Kadero has allowed archaeologists to glean details on the lives of those at Kadero, as well as draw comparisons to those in other Neolithic communities in the area. Material analysis of pottery found at Kadero and other sites has led researchers to conclude that Nile mud was a primary resource for the creation of ceramic throughout Neolithic Central Sudanese communities. The artistic decorations found on the pottery are also considered to be similar to other Central Sudanese Neolithic sites such as Esh Shaheinab, suggesting that these communities were in contact.\nReferences"
    }
  ]
}