{
  "content": [
    {
      "type": "text",
      "text": "# Kameshwar Baitha\n\n|birth_place        = Dhanchabar, Palamu, (Jharkhand).\n|death_date         =\n|death_place        =\n|restingplace       =\n|restingplacecoordinates =\n|birthname          =\n|citizenship        =\n|party              = Trinamool Congress\n|otherparty         = Jharkhand Mukti Morcha (until 2014)\n|spouse             = Deomunia Devi\n|partner            =\n|relations          =\n|children           = 03 sons and 01 daughter.\n|residence          = Palamu and New Delhi.\n|alma_mater         =\n|occupation         =\n|profession         = Social Worker and Politician.\n|cabinet            =\n|committees         = Committee on Railways (Member).\n|portfolio          =\n|religion           =\n|signature          =\n|signature_alt      =\n|website            =\n|footnotes          =\n}}\nKameshwar Baitha is a member of the 15th Lok Sabha of India. He represented the Palamu constituency of Jharkhand. He is now the state President of All India Trinamool Congress Jharkhand Unit. He was originally a member of the Jharkhand Mukti Morcha political party, but joined the Bharatiya Janata Party in 2014. He left the BJP for the Trinamool Congress after failing to get a ticket for the general Elections of 2014.\nEducation and background\nKameshwar Baitha was born in a village in the Bishrampur block of the Palamu district (then part of Bihar). The highest educational qualification attained by Baitha is matriculation. During the 1970s, the rampant feudalism and the resulting marginalisation of the landless lower castes led to social unrest in Palamu and other parts of Bihar. Several low-caste people joined the Naxalite–Maoist insurgent groups. Baitha joined Party Unity in the late 1980s, after the Arwal massacre in which 21 supporters of the left-wing group Mazdoor Kisan Sangharsh Samiti (MKSS) were killed in police firing. As a Naxal insurgent, he commandeered the Koel-Sankh zone of the CPI (Maoist).\nAs a result of his Naxalite past, he is facing as many as 53 criminal cases in various courts that includes killing of 17 PAC jawans and divisional forest officer Sanjay Singh at Rehal village on Kaimur hills in Rohtas. He was the only jail inmate when selected as MP in 2009. Baitha denied his involvement in any violence, stating that he had never touched a weapon in his life during his \"27 years of struggle for the people's cause.\"\nPolitical career\nIn 2009, Kameshwar Baitha won the Lok Sabha elections from Palamu, which is reserved for Scheduled Caste candidates. He had contested the elections on a JMM ticket, while lodged in a Bihar jail. He defeated Rashtriya Janata Dal's sitting MP Ghuran Ram. After winning the elections, he spent two years and 7 months in jail, getting bail in late 2011.\nBaitha left JMM in 2014. He declared that he had joined the Bharatiya Janata Party (BJP), but BJP declined this and did not approve his membership. He then joined TMC, and was given a ticket for the 2014 Lok Sabha elections.\nPosts held\n{| class=\"wikitable sortable\"\n|-\n! # !! From !! To !! Position\n|-\n| 01 || 2009 || - || Elected to 15th Lok Sabha\n|-\n| 02 || 2009 || - || Member, Committee on Railways\n|-\n|}\nSee also\n*List of members of the 15th Lok Sabha of India\n*Politics of India\n*Parliament of India\n*Government of India\nReferences"
    }
  ]
}