{
  "content": [
    {
      "type": "text",
      "text": "# Kamen Rider × Kamen Rider W & Decade: Movie War 2010\n\n}}\n| image = W-dcd.jpg\n| director = Ryuta Tasaki\n| writer =\n| producer =\n| starring =\n| music =\n| cinematography = Koji Kurata\n| editing = Hiroshi Sunaga\n| distributor = Toei Co. Ltd\n| released =\n| runtime =\n| language = Japanese\n| italic_title = force\n| gross = $16 million\n}}\nis the commercial promotion for theatrical releases of the Kamen Rider Decade epilogue film, the Kamen Rider W flashback film, and a third film that serves as a crossover between the two and finale to Decade (all directed by Ryuta Tasaki). Unlike subsequent Movie War films, this film focuses more on Decade than W. The films were released on December 12, 2009.\nMovie War 2010 is split into three parts. The Kamen Rider Decade segment, written by Shōji Yonemura and titled , follows the series' cliffhanger, \"Destroyer of Worlds\", is billed as the , and was originally subtitled . The Kamen Rider W segment, written by Riku Sanjo and titled , takes place between episodes 14 and 15 of the series and investigates the origins of the titular characters. Additionally, this film is described as the  and was originally subtitled . The final segment, , is a crossover of the two films that brings the casts and characters of Decade and W together to finish the fight with Super Shocker together.\nPlot\nDecade: The Last Story\nAccepting his fate as the destroyer of worlds, Tsukasa Kadoya fights and traps Riders from across the multiverse in cards. He receives help from Yuriko Misaki before they encounter Natsumi Hikari and Yusuke Onodera, who intend to stop Kadoya through different means. She attempts to make Kadoya remember who he was, but he rebuffs her and leaves with Misaki to fight Onodera. Natsumi becomes crestfallen until Kiva-la reminds her that only the former can stop Kadoya and the latter can give her the power to do so.\nMeanwhile, Natsumi's grandfather Enjiro Hikari meets with his friend Ryu, who secretly gives him the Doctor Death Gaia Memory and transforms him into Super Doctor Death. Joined by the mysterious Narutaki as Colonel Zol and Bee Woman, they form Super Shocker to take advantage of Kadoya's work via the Neo Organism.\nDaiki Kaito confronts Kadoya, revealing Misaki was killed by Bee Woman years ago despite Misaki's attempts to deny it. After Kadoya defeats Onodera and the multiverse's remaining Riders, Natsumi uses Kiva-la to transform into Kamen Rider Kiva-la and fight him. Kadoya allows her to kill him before giving her his cards, asking her to remember them before he dies. Kaito joins her as they are teleported to Wataru Kurenai, who reveals Kadoya's actions restored the multiverse because he created memories that allowed their stories to continue. When Natsumi asks about Kadoya, Kurenai says the latter had no story and that he fulfilled his purpose. After being returned to her reality, Natsumi and Kaito attempt to revive Kadoya via his camera, but are attacked by Super Shocker. Kaito, Misaki, and a revived Onodera hold them off while Natsumi finds Kadoya's camera. After Misaki sacrifices herself to wound her, Bee Woman returns to Super Shocker's Super Crisis Fortress to release the Neo Organism, who absorbs her and transforms into Doras.\nNatsumi tries to develop Kadoya's photographs, but his face does not appear in any of them. She passes the camera to Kaito and Onodera, who refuse to forget him. With the Nine Worlds' Riders' memories of Kadoya, their memories successfully revive him. As the Super Crisis Fortress takes off, Kadoya, Kaito, Natsumi, Onodera, and the Nine Worlds' Riders join forces to defeat Zol and Doras. The Neo Organism reverts to its original form and deploys a mammoth robot to attack the Riders.\nW: Begins Night\nIn flashbacks, Detective Sokichi Narumi and his protégé Shotaro Hidari infiltrate a secret installation in search of the \"chosen child\", whose powers are being used for evil. As the alarm sounds, Sokichi fights the guards while Hidari follows a mysterious young man, who reveals he can create Gaia Memories. However, Hidari inadvertently gets the young man captured. Sokichi rejoins Hidari and berates him before they locate the young man again. Sokichi offers him freedom and names him Philip after his favorite fictional character, Philip Marlowe. Sokichi rescues Philip, but is killed by the guards. With his last breath, he asks Hidari to finish the case and take care of Philip before the pair transform into Kamen Rider W to defeat the guards and escape the collapsing building.\nIn the present, Hidari recalls his first Christmas with Sokichi until the latter's daughter, Akiko Narumi, interrupts him to help her and the Fuuto Irregulars decorate their office. Pop star Asami Mutsuki arrives to seek their help after being apparently haunted by her sister and former partner's ghost, Erika. Hidari and Philip take the case, much to the Irregulars' dismay. While investigating, Hidari and Akiko visit Erika's grave and speak with the cemetery's caretaker, Father Roberto Shijima, who Hidari finds suspicious because of Shijima's views on resurrection.\nHidari and Akiko learn Asami canceled the case. The pair chase her but are attacked by the Death Dopant. Hidari joins Philip to transform and fight the Dopant, but they are confronted by Sokichi. Caught off-guard, Hidari struggles to fight back while Philip tries to remind him that Sokichi is dead within earshot of Akiko despite Hidari's protests before Sokichi defeats them and warns them not to interfere. While recovering, a shaken Hidari attempts to quit, but Akiko persuades him otherwise. The next day, Hidari and Philip return to the installation to recall the night their journey together began. The pair resume their investigation and conclude Shijima is the culprit.\nAkiko follows Asami and learns the latter canceled the case in exchange for Shijima reuniting her with Erika. Realizing they know his true identity, he attempts to trap the women only for Hidari and Philip to save them. Shijima transforms into the Death Dopant before disappearing to seemingly summon Sokichi. Realizing his mentor was not a heartless man, a resolute Hidari and Philip defeat Sokichi, who reverts to Shijima's true Dopant form, the shapeshifting Dummy Dopant. Before Hidari and Philip can destroy his Gaia Memory, the Sonozaki family distract them while Shijima escapes, though Hidari and Philip pursue him.\nMovie War 2010\nWhile escaping from the Neo Organism's Mammoth Mecha and the Super Crisis Fortress, Kadoya encounters Hidari and Philip while they are chasing Shijima. The three Riders stop briefly and recognize each other from their last encounter before joining forces with Kaito, Natsumi, Onodera, and the Nine Worlds' Riders to destroy the Super Crisis Fortress. While attempting to escape, the fortress' destruction causes the Doctor Death Memory to eject itself and revert Enjiro before Natsumi rescues him.\nWhile the Neo Organism absorbs Shijima and transforms into Ultimate D, Kadoya, Hidari, and Philip successfully destroy it. As the Riders return to their respective realities, Kadoya uses his interdimensional powers to briefly summon an alternate reality version of Sokichi to give Hidari closure. Kadoya is joined by Kaito, Onodera, and the Hikaris on his continuing journey through the multiverse while Hidari, Philip, and their allies resume their party. Meanwhile, a man in red attire proclaims W is not the only Kamen Rider in Fuuto anymore.\nCast\n; Decade cast\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* : :\n* :\n* , :\n* , :\n* :\n* :\n* :\n* :\n* , :\n* DecaDriver Voice, DienDriver Voice, K-Touch Voice:\n* Narration:\n; W cast\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* Gaia Memory distributor:\n* Mysterious man:\n* Gaia Memory Voice:\nTheme song\n* \"Stay the Ride Alive\"\n** Lyrics: Shoko Fujibayashi\n** Composition: Ryo (of defspiral)\n** Arrangement: Kōtarō Nakagawa, Ryo\n** Artist: Gackt\nReception\nKamen Rider × Kamen Rider W & Decade: Movie War 2010 earned $16 million at the Japanese box office.\nNotes\nReferences\nExternal links\n*"
    }
  ]
}