{
  "content": [
    {
      "type": "text",
      "text": "# Kamen Rider × Kamen Rider Gaim & Wizard: The Fateful Sengoku Movie Battle\n\n| image          = Gaim & Wizard the movie.jpg\n| alt            =\n| caption        = Theatrical poster\n| director       = Ryuta Tasaki\n| producer       =\n| writer         =\n| narrator       =\n| starring       =\n| music          =\n| cinematography = Koji Kurata\n| editing        = Naoki Osada\n| studio         = Toei\n| distributor    = Toei Co. Ltd\n| released       =\n| runtime        = 92 minutes\n| country        = Japan\n| language       = Japanese\n| budget         =\n| gross          = $9,446,183\n}}\nis a team up film featuring the main characters of Kamen Rider Gaim and Kamen Rider Wizard as the part of the annual winter \"Movie War\" franchise, as well as to celebrate the fifteenth anniversary of the Heisei era Kamen Rider Series and the fifth anniversary of the \"Movie War\" franchise itself. It was released in Japan on December 14, 2013. Unlike previous Movie War films which would feature the new series' secondary Kamen Rider, the film teases the upcoming \"Yggdrasill Saga\" arc of Kamen Rider Gaim, introducing the Genesis Driver belt and Ryoma Sengoku's bodyguard Yoko Minato.\nPlot\nUnlike previous Movie War films, this one is only divided in two stories:  and .\nKamen Rider Wizard: The Promised Place\nWhile Haruto is traveling abroad to look for a place to hide the Hope Ring, Kizaki, Rinko, and Nito break into a laboratory where artificial copies of the Phantom Carbuncle are being created. They are attacked by the Phantom Ogre who devours the copies and easily defeats the three Kamen Rider Mages, Mayu, Yuzuru, and Yamamoto before leaving. Ogre then goes after Haruto at a beach near Fortaleza, Brazil, in an attempt to force him into despair and bring forth his Phantom Wizardragon. After failing, the monster steals the Hope Ring from Haruto instead and flees.\nAfter returning to Japan and reuniting with his friends, Haruto is attacked by Ogre once more, bringing with them a copy of Koyomi he created with the Hope Ring that is able to transform into the White Wizard in order to have Haruto choose between killing Koyomi or having her go in a rampage, possibly falling into despair. To prevent that, Nito knocks down Haruto and despite being warned about the consequences, wears a restored Beast Driver and renews his pact with Chimera, transforming into Kamen Rider Beast once again but he fails to defeat them as well. Back at the Antique Shop Omokagedō, Haruto regrets the fact that he did not dispose of the Hope Ring thanks to his attachment to Koyomi and is given a brand new Magic Ring crafted by Shunpei. Back at the fight, Kamen Rider Beast faces against Ogre while Kamen Rider Wizard confronts the White Wizard and, after Shunpei's ring fails to work, Wizard succeeds in dissuading Koyomi and returns the Hope Ring to normal. Ogre then forces himself into Haruto's Underworld in order to capture Wizardragon there and the Hope Ring reacts with Shunpei's ring, allowing Kamen Rider Wizard to enter his own Underworld, while Kamen Rider Beast confronts a trio of Carbuncle copies. Kamen Rider Beast defeats the copies while Haruto finishes Ogre and meets an image of Koyomi inside his Underworld, whom he entrusts with the Hope Ring before returning to the real world. Haruto and Nito celebrate their victory with their friends when a Crack appears and the Pitcher Plant Inhumanoid jumps from it, absorbing Nito before jumping back into the Crack, beside a red-colored Armored Rider resembling Gaim.\nKamen Rider Gaim: Sengoku Battle Royale!\nA competition is being held in Zawame City between Armored Riders Gaim, Ryugen, Baron, Kurokage, and Gridon with a batch of Lockseeds from DJ Sagara as a prize when a Crack opens amid the battle and the Pitcher Plant Inhumanoid appears from it, attacking Mai. Gaim, Ryugen, and Baron protect Mai and pursue the monster as it retreats through the Crack. The Riders arrive in an alternative reality where the inhabitants run away in fear from Gaim, mistaking him for someone else. Looking for answers, they join a battle with a Kamen Rider resembling OOO, while Takatora learns of the situation and follows after the other Armored Riders. Kaito breaks into a burning castle and meets Nobunaga, who entrusts him with a Core Medal before dying amid the flames, but he manages to save Ranmaru from the fire. Outside, the red Kamen Rider Gaim appears and defeats Kamen Rider OOO, before having him absorbed by the Pitcher Plant Inhumanoid. Kota and Mitsuzane flee the scene just to be later captured by an alternative Iyeasu Tokugawa, who reveals that in that reality each of the Heisei Riders are Bujin Riders serving a feudal warlord and fighting to unify the country but most of them have been defeated, including his own Bujin Wizard, by the red-colored Kamen Rider Bujin Gaim, who serves no one except for himself.\nAs Mai enters a Crack in search for her friends, Kaito saves Ranmaru from some bandits, earning her gratitude and loyalty. Bujin Gaim then fights one of the last Bujin, Bujin Double and Armored Rider Zangetsu intervenes, but unintentionally assist Bujin Gaim as he realized that Bujin Gaim is not the Gaim from his dimension, leading to Double's defeat, leaving behind Kamen Rider Double's Joker Gaia Memory which Zangetsu retrieves and escape from Bujin Gaim's attacks. After Kota agrees to work with Ieyasu only until Bujin Gaim is defeated, Kota and Mitsuzane join the battle between Bujin Gaim and Bujin Fourze but fail to protect Fourze from Bujin Gaim, with both Fourze and Ryugen being absorbed by the Pitcher Plant Inhumanoid. After the battle, Takatora appears and retrieves one of Fourze's Astroswitches. Back in Ieyasu's castle, Kota learns that Kaito is rallying the armies from the now defeated warlords and intends to conquer the entire land. Mai arrives in the alternative realm and meets Kaito, who refuses to give up on his plans, claiming that he prefers staying there than returning home. When she parts ways from him, Mai is attacked by the Pitcher Plant Inhumanoid again just to be rescued by the real Kamen Rider Wizard, who has her reunite with Kota while trying to save Nito.\nKota and Haruto prepare to face an assault from Kaito's forces, while Bujin Gaim uses the power of the other Bujin Kamen Riders to take control of the sacred tree. He returns to Ieyasu's castle to kidnap Mai, who he claims is the \"Priestess of Fate\". As the three forces clash, Baron joins forces with Wizard, Gaim, and Zangetsu to defeat the Pitcher Plant Inhumanoid and free Mitsuzane and Nito. The six Kamen Riders then confront Bujin Gaim, with Ieyasu entrusting Kamen Rider Wizard with Bujin Wizard's Infinity Ring and Kota carrying the Flame Ring. The mysterious girl appears before the Armored Riders and creates some Helheim Fruits from which they create Lockseeds from the relics of the fallen Bujin Kamen Riders to attain the powers of Wizard, OOO, Fourze, and Double. Infused with the sacred tree, Bujin Gaim absorbs Kamen Rider Wizard and Gaim, who receive the powers of the other fallen Bujin Kamen Riders to escape and destroy Bujin Gaim with their combined powers. After the battle, Nito discovers that he can feed Chimera with Helheim Fruits in order to avoid being consumed by it and the Kamen Riders bid farewell to each other as they return home. Elsewhere, Takatora is given a new transformation belt by his scientist Ryoma Sengoku. Kota, Kaito, and Mitsuzane still manage to return to Zawame to face Jonouchi and Hase in their battle royal.\nProduction\nThe films' guest stars include popular models turned tarento JOY and Atsushi. JOY portrays an alternative interpretation of Tokugawa Ieyasu in the Sengoku Movie Battle portion of the film, while Atsushi will portray the Phantom known as Ogre, otherwise known as Osuga, in the Kamen Rider Wizard portion. JOY stated that he was happy to be working on such a popular film, and studied Ieyasu to prepare for the role, hoping that his performance will also teach children history. Atsushi, on the other hand, was thrilled that he will be playing the villain, and mentioned how he enjoyed how he looked in make up and as his costumed alter ego. Rounding out the cast are guest appearances from Kamen Rider alumni Hiroaki Iwanaga (Akira Date/Kamen Rider Birth in Kamen Rider OOO) as an alternative interpretation of Oda Nobunaga, Minehiro Kinomoto (Ryu Terui/Kamen Rider Accel in Kamen Rider W) as an alternative interpretation of Toyotomi Hideyoshi, and Hikaru Yamamoto (Akiko Narumi in Kamen Rider W) as an alternative interpretation of Yodo-dono also known as Chacha; Keisuke Kato (Keisuke Nago/Kamen Rider Ixa in Kamen Rider Kiva) and Ryuki Takahashi (Kengo Utahoshi in Kamen Rider Fourze) also appear, but their parts are original characters in the film rather than interpretations of other Sengoku period historical figures. Additionally, model and actress Mao Ueda will portray an alternative interpretation of Mori Ranmaru. The film script was written by Nobuhiro Mouri (working on the Gaim and team up parts) and Junko Kōmura (working solely on the Wizard part) with Ryuta Tasaki as director.\nCast\n;Wizard cast\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* Manager of donut shop:\n* Worker at donut shop:\n* :\n* :\n* :\n* :\n;Gaim cast\n* :\n* :\n* :\n* , :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* : Kamen Rider Girls\n* :\n* : JOY\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* :\n* : ,\n* Gaia Memory Voice:\n* Sengoku Driver Equipment Voice:\n* Narration:\nTheme song\n* \"TEPPEN STAR\"\n** Lyrics: Shoko Fujibayashi\n** Composition: JIN, junchi, Shuhei Naruse\n** Arrangement: JIN\n** Artist: hitomi\nReception\nKamen Rider × Kamen Rider Gaim & Wizard: The Fateful Sengoku Movie Battle grossed $9,446,183 at the box office.\nNotes\nReferences\nExternal links\n*\n*"
    }
  ]
}