{
  "content": [
    {
      "type": "text",
      "text": "# Kamerlingh Onnes Award\n\n}}\nThe Kamerlingh Onnes Award is in recognition of special merits of scientists active in the field of refrigeration technology, cryogenics and more generally low-temperature science and technology. It was founded in 1948 by the Royal Dutch Association of Refrigeration (Koninklijke Nederlandse Vereniging voor Koude, KNVvK) The name of the award is intended to keep the memory of Heike Kamerlingh Onnes alive. The award is assigned typically every four years and the winners get a golden medal and a certificate.\nList of recipients\n*1950 Prof. F. Simon, Oxford, England, Very low temperatures, liquid hydrogen and helium\n*1955 Prof. , Karlsruhe, Germany, Refrigeration technology in a broad sense\n*1958 Prof. S.C. Collins, M.I.T., USA, Low temperatures, especially with regard to equipment for the production of liquid helium\n*1958 Philips Natuurkundig Laboratorium, Eindhoven, Netherlands, Development of cryogenerator\n*1963 Dr. F. Kidd and Dr. C. West, Cambridge, England, Research storage conditions of fruit\n*1968 Prof. P.L. Kapitza, Moscov, Russia, Low temperatures; scientifically and technologically\n*1973 Ms. Dr. Audrey Smith, Stanmore, England, Introduction of cryoprotectants; cryobiology\n*1979 Dr. J.E. Kunzler, Bell Labs., USA, Superconductivity\n*1983 Prof. L. Váhl, Delft, The Netherlands, Refrigeration technology in the broad sense\n*1988 Ir. T.A. van Hiele, Wageningen, Netherlands, Application of refrigeration technology on agricultural and horticultural products\n*1989 Dr. H.T. Meryman, American Red Cross, USA, Preservation of blood, tissues and organs\n*1995 Prof. R. Cohen, Purdue University, USA, Compressor technology and international knowledge transfer\n*1995 Refrigerator Research group at the Massey University, New Zealand, under Prof. A.C. Cleland, Food refrigeration processes and knowledge transfer\n*2000 Prof. G. Frossati, Kamerlingh Onnes Lab., Netherlands, Development of cryogenic equipment, in particular as regards dilution refrigerators\n*2008 Prof. H.C. Kruse, Hannover, Germany, Contributed to technological progress, education and knowledge transfer and did meritorious work for cold and heat pump associations\n*2008 Prof. A.T.A.M. de Waele, Eindhoven, Netherlands,  Optimization of pulse tube refrigerators for temperatures below 4 K\n*2012 Dr. P. Lebrun, CERN, Switzerland, For his groundbreaking contributions to the field of cryogenic science and technology, especially making the Large Hadron Collider possible\n*2022 Pengcheng Dai\nSee also\n* List of engineering awards\nReferences"
    }
  ]
}