{
  "content": [
    {
      "type": "text",
      "text": "# Kamen Rider × Kamen Rider Drive & Gaim: Movie War Full Throttle\n\n| image          = Movie War Full Throttle.jpg\n| alt            =\n| caption        = Theatrical poster\n| director       = Takayuki Shibasaki\n| producer       =\n| writer         =\n| narrator       =\n| starring       =\n| music          =\n| cinematography = Wataru Miyamoto\n| editing        = Naoki Osada\n| studio         = TV AsahiToeiIshimori ProductionsAsatsu-DK\n| distributor    = Toei\n| released       =\n| runtime        = 92 minutes\n| country        = Japan\n| language       = Japanese\n| budget         =\n| gross          =\n}}\nis a 2014 Japanese film in the Kamen Rider Series. It serves as a crossover between the Kamen Rider Drive and Kamen Rider Gaim television series in the vein of previous \"Movie War\" films. The two series' casts will reprise their roles, while guest starring Yūji Ayabe of the owarai duo as the film's antagonist, and briefly introducing the secondary rider of Kamen Rider Drive, Kamen Rider Mach. Movie War Full Throttle was released nationwide in Japan on December 13, 2014.\nStory\nLike most films of the Movie War series, the film is divided into three parts: ,  and\nKamen Rider Gaim: Advance to the Last Stage\nHaving made a new life on Planet Helheim, Kota Kazuraba and Mai Takatsukasa find their world\nattacked by a mechanical being called Megahex who abducts Mai. During the epic battle that ensues, assimilating Gaim's memories to learn his language and home world, Megahex opens a portal to the planet. In Zawame City, the Beat Riders are living carefree when they witness Kamen Rider Gaim being overpowered and destroyed by Megahex who takes the Kiwami Seed to incorporate into his system before proceeding to slowly assimilate the city and all who live in it. Mitsuzane Kureshima, the only one to possess the Sengoku Driver, confronts\nMegahex as he creates Kurokages to deal with Kamen Rider Ryugen. But Megahex uses Kota's memories to create a cyborg replica of Ryoma Sengoku to deal with the youth as Kamen Rider Duke Dragonfruit Energy Arms. Retaining his sense of self, Duke has no qualms of being an extension of Megahex as he overpowers Ryugen who is forced to flee with one of the Kurokage Sengoku Drivers. As Mitsuzane is treated by the other Beat Riders who ponder how to deal with this turn of events, he is contacted by Mai in his dreams that she is being held in Megahex's ship. Upon waking up, finding a Helheim vine, Mitsuzane gives his brother Takatora the Sengoku Driver he took while Takatora takes a Melon Lockseed from the vine.\nThe next day, the Kureshima brothers make their way to Megahex's ship to save Mai when Ryoma blocks their way. Kamen Rider Zangestu proceeds to battle Duke while Ryugen runs towards Megahex's ship while dealing with replica Roidmudes on the way. As Taketora destroys Ryoma and takes his Genesis Driver, Mitsuzane saves Mai before they find his brother attacked by Megahex after he assimilated the Kiwami Lockseed. Using the Melon Energy Lockseed his brother provides, Takatora becomes Zangetsu Melon Energy Arms to fight Megahex with his brother supporting him. Despite reclaiming the Lockseed in a risky gambit, Kureshima brothers only infuriated Megahex as he was about to obliterate them and Mai. But Kota's essence emerges from the Kiwami Lockseed, protecting his friends from the attack before restoring his physical form. Kota and the Kureshima brothers proceed to destroy Megahex, only to learn that he is a drone body when a dozen more Megahexes appear. Explaining that his ship is actual a portal to Planet Megahex, which is the source of the hive mind, Megahex's drone bodies proceed to scatter and commence the global assimilation.\nKamen Rider Drive: The Challenge From Lupin\nTwo days prior to Megahex's arrival to Earth, Shinnosuke Tomari and his partner Kiriko Shijima are on the case involving a copycat criminal posing as \"Phantom Thief Ultimate Lupin\". They confront the thief and confirm him to a Roidmude with Mr. Belt feeling he knows its model. Shinnosuke confronts the figure as Kamen Rider Drive, but fails to capture Lupin as he takes his leave via chopper while vowing to steal the Kamen Rider from him. The next day, as the group muse over old files of the previous Ultimate Lupin Zoruku Tojo, Shinnosuke learns that the Special Investigations Division received a letter of challenge from Lupin, claiming that he will steal a precious artifact under police escort. Though joining the escort, chasing after Ultimate Lupin when he stop the convoy truck, Drive fails to capture Lupin as the android uses his gravity manipulation to escape.\nThe event only convinces Mr. Belt to take control of Tridoron as he takes Shinnosuke to Krim Steinbelt's abandoned mansion, the AI revealing that Steinbelt created a pseudo-Roidmude body called Cyberzoid ZZZ which he hid away prior to his death since his mind was not strong enough for transference. But the body was found by Zoruku Tojo when he stumbled upon it by chance and transferred his mind into it. Lupin expresses his intention to use his body continue his criminal career forever as he proceeds to man handle Shintaro before Chase appears with a few Roidmudes to deal with Lupin for being an unworthy Roidmude. But Lupin reveals his Lupin Gunner as he transforms into Kamen Rider Lupin. Lupin proceeds to destroy the Roidmudes and easily defeats Mashin Chaser and then Drive after provoking him and Mr. Belt, with the belt taking a fatal blow intended for Shinnosuke before shutting down. While being consoled by the Shift Cars after coming to by reminding him of who he is, Shinnosuke leaves in a rush as he has a realization. Some time later, a white-colored Kamen Rider appears at the Drive Pit in the middle of the night.\nThe next day, receiving what appeared to be another letter from Lupin, the Special Investigations Division arrives to the church where Shinnosuke waits for them. Knowing the real Kiriko would never be nice to him, Shinnosuke reveals that he figured out that Lupin abducted Kiriko and assumed her form to infiltrate the Special Investigations Division. Lupin ditches the guise and escapes on a hot air balloon, telling Shinnosuke that he can chase after him or save Kiriko before falls to her death. But Shinnosuke proceeds to go after Lupin, refusing to left him tarnish the Kamen Rider name before he is knocked off from several feet in the air. But Mr. Belt reactivates in time, allowing Shinnosuke to become Drive again while the Tridoron saves Kiriko. Getting unexpected help from Chaser before Kiriko and the Tridoron arrive, Drive manages to defeat Lupin as the criminal's mind gets ejected from his Cyberoid vessel. But as Chaser leaves while followed by the white Kamen Rider, one of the Megahex drones appears from Zawame City and assimilates the Cyberoid body to become ZZZ Megahex before flying back to Zawame City to distribute the Cyberoid data to Planet Megahex.\nMovie War Full Throttle\nBack in Zawame City, as the Megahex drones scatter, Gaim, Ryugen, and Zangetsu Shin confront an army of artificially created Inves and Roidmudes when Drive arrives to assist them. ZZZ Megahex then arrives with Drive in pursuit, he and Gaim having an awkward first meeting before dealing with ZZZ Megahex as he uses Kota's memories to create a copy of Kaito Kumon to fight for him. But Megahex did not count that the copy would be convincing enough to turn on him as the replicate attacks the drone upon transforming into Kamen Rider Baron. Megahex proceeds to battle Drive and Gaim as the Kureshima Brothers are joined  by Heart and Brain alongside Chaser, the Roidmudes refusing to allow their technology to be stolen. When Drive and Gaim find out that ZZZ Megahex has a rapid healing factor, Mai convinces the two Kamen Rider combine their powers, receiving the Shift Fruits Car and the Drive Lockseed to become Drive Type Fruits and Gaim Drive Arms. The two proceed to destroy Megahex with the Cyberdroid data being transferred to Planet Megahex.\nAfter being informed that destroying Megahex's core is the only way to stop him, with Baron holding off the platoon of ZZZ Megahexes, Drive and Gaim take the Tridoron to attack the planet head on. After dealing with one of Megahex's larger drone bodies while fighting the planet's defenses, the Kamen Riders reach Megahex's core and destroy it. With Megahex destroyed, all his creations deactivate as the two Kamen Riders return to their world in time. After parting ways with Shinnosuke, Kota was about to return to Helheim with Mai when their friends arrive to give them a proper farewell. Meanwhile, Shinnosuke learns that Zoruku's conscious bounded with a Bat Viral Core as the thief reveals he stole an image of Kiriko's smile that Shinnosuke cherishes and vows to steal the Kamen Rider title another day. Shinnosuke's words about not caring about Kiriko's smile were heard as he ends up running from his upset partner.\nCast\n;Gaim cast\n*:\n*:\n*:\n*:\n*:\n*:\n*:\n*:\n*:\n*:\n*Sengoku Driver Equipment Voice:\n;Drive cast\n*:\n*:\n*:\n*:\n*:\n*:\n*, :\n*:\n*:\n*:\n*:\n;Movie War Full Throttle cast\n*/:\n*/, Genesis Driver Equipment Voice:\nTheme song\n*\n**Lyrics: Mitsuru Matsuoka\n**Composition: Mitsuru Matsuoka, tatsuo (of everset)\n**Arrangement: tatsuo\n**Artist: Mitsuru Matsuoka EARNEST DRIVE with TEAM  and  (Gaku Sano, Yutaka Kobayashi, Yuumi Shida, Ryoma Takeuchi, Rio Uchida, Taiko Katono, Tomoya Warabino, and Shota Matsushima)\nMitsuru Matsuoka, lead vocalist of Sophia, performs the film's theme song with the special band or the series　Mitsuru Matsuoka EARNEST DRIVE. The song was included as the B-side to the Kamen Rider Drive television series theme song single \"Surprise-Drive\".\nType Zero\nThe first million ticket buyers will also receive a special DVD featuring a prequel episode to the Kamen Rider Drive series, titled .\nReception\nThe film earned  at the Japanese box office on its first weekend.\nReferences\nExternal links\n*"
    }
  ]
}