{
  "content": [
    {
      "type": "text",
      "text": "# Kanawha County Textbook War\n\nThe Kanawha County Textbook War, also known as the Kanawha County Textbook Controversy, was a violent school control struggle in the 20th century United States. It led to the largest protests ever in the history of Kanawha County, West Virginia, the shooting of one bystander, and extended school closings. The controversy erupted in 1974 when new, multicultural textbooks were introduced that some parents considered blasphemous.\n1974 school board ruling\nIn 1970, West Virginia's Superintendent of Schools signed a proposal for funding to ensure the training of teachers to \"induce change\" so that children in the state's educational system could elevate and expand above their own cultural surroundings that the state viewed as limited. On 12 March 1974, the English Language Arts Textbook Committee of Kanawha County, West Virginia recommended 325 books and textbooks to the school board for use in Kanawha schools ranging from kindergarten to 12th grade. The books were selected by the Committee based on state guidelines that had been set, including that books should be \"multicultural in content and authorship\". An English teacher on the committee stated that although she held strong conservative values, she felt that removing books that showed opposing opinions would be equivalent to \"telling lies by omitting ideas I know exist\". Among these were titles such as America Reads and Language of Man. These textbooks were part of a new state curriculum that included for the first time the concepts of multiculturalism and egalitarianism in textbook writing. Most school board members saw no reason to question the state's decision.\nAlice Moore\nAlice Moore had previously campaigned against sex education being taught in the county and was elected as the only member of the Kanawha County School Board who did not have a college degree. Moore also had four children attending county schools. Moore was concerned by the term dialectology, which implied the teaching of Appalachian English and African American Vernacular English as \"equally correct\" dialects. Historian Carol Mason writes that Moore did not want White children to learn language used by African Americans, with the belief that it would cause the White children \"to speak in ghetto dialect.\"\nThe school board moved to review the books before sending them to schools. Upon receiving the review copies, Moore was offended by a quote from the Autobiography of Malcolm X in which he referred to Christians as \"brainwashed\"; she requested and received all 300 textbooks, and claimed that she found unsettling quotations from Allen Ginsberg, Sigmund Freud's writings on the Oedipus complex, and convicted Black Panthers such as Eldridge Cleaver's Soul on Ice and by George Jackson.\nMoore then telephoned Mel Gabler, a textbook evaluator who ran Educational Research Analysts, a conservative Christian non-profit organization in Texas.  Gabler in return sent pamphlets and outlines of some of the ways in which the content of the books allegedly conflicted with Christian values, moral uprightness, and patriotism. Moore, the wife of a fundamentalist minister, reported her concerns to the board and local newspapers. On 23 May, Moore came to the school board meeting and charged that the textbooks were \"filthy, disgusting trash, unpatriotic and unduly favoring blacks\". She argued that the textbooks taught children to disrespect the beliefs of their parents and taught a brand of relativism that did not belong in West Virginia. She generated much publicity for her cause and won the support of the local Parent–Teacher Association and the Magic Valley Mother's Club. However, the West Virginia Council of Churches supported the books.\nOn 27 June the school board, including Moore met again, with over 1,000 local residents observing, and voted to approve the books after a three-hour debate over the merits of teaching a liberal curriculum. This was met with much consternation from conservative groups. Reverend Marvin Horan called for a boycott of all public schools. Flyers were distributed around the county which purported to demonstrate the lewdness of the books, but were actually quotations from completely different books like Sexual Politics that were not part of the curriculum. When parents could not find these passages in their children's own textbooks, they accused the teachers of hiding the real books from them.\nIn 2011, Moore received the Dr. Robert Dreyfus Courageous Christian Leadership Award, from a South Carolina based ministry that promotes Christian based schools to parents. Announced in The Washington Times, a conservative news publication. The article states that she is a \"culture war heroine\" who fought against anti-Christian education and liberal indoctrination. The publication went further to state that her leadership in the \"uprising\" was a precursor to the Tea Party Movement.\nBoycott and violence\nThe boycott escalated quickly. Nine thousand out of 45,000 elementary school students in the county were kept home from school. Thousands of miners, bus drivers, and trucking workers joined in the boycott. The Department of Education called for a compromise, but Reverend Horan denounced them, demanding that the boycott continue until the books were permanently removed and the supporting members of the school board fired. Bombs were planted at an elementary school and a school board building; another elementary school was dynamited, school buses were attacked with shotguns, and rocks were thrown at the homes of children who continued to attend school during the boycott. Alice Moore herself fled town during this time.\nReverend Charles Quigley asked Christians to \"pray that God will kill the giants who have mocked and made fun of dumb fundamentalists\", leading one student to point out, \"They're shooting people because they don't want to see violence in books.\" Kanawha's sheriff asked for state troopers to be sent in, but West Virginia Governor Arch A. Moore, Jr. denied the request. Schools were closed several times to avoid further violence.\nBetween 1974 and 1975, several people, including Marvin Horan, were prosecuted and imprisoned on charges related to the bombings, effectively ending the demonstration. In the fall of 1975, the school board restored the full line of books that they had approved before to all county schools.\nLegacy\nJoe L. Kincheloe in Understanding the New Right and its Impact on Education (1983) made the argument that the actions of Kanawha County School Board Member Alice Moore and her fundamentalist Christian allies in the 1974 controversy represented a defining moment in not only educational politics but American political history as well. Arguing that the Kanawha County textbook controversy was the first major victory for conservative evangelical Christians in the politically polarizing cultural debates that emerged from the 1960s social unrest, Kincheloe wrote in the early 1980s and in subsequent work that the victory was a key moment in what he and Aaron Gresson (2004) have labeled the right-wing recovery movement. This movement has profoundly shaped subsequent American education and electoral politics, as proponents have attempted to regain the power they perceived themselves to have lost in the 1960s cultural movements. In the case of the Kanawha County controversy, Moore and her supporters perceived that progressive secularists were undermining Christian values in their embrace of moral relativism, atheism and sexual experimentation (amongst other things) in educational textbooks a la 1960s liberationism.\nAfter the textbook controversy, a network of private Christian schools was founded across the state, teaching Christian principles in place of the concepts at the center of the controversy.\nSee also\n* Connaught Marshner\nReferences\n* Foerstel, Herbert N. Banned in the U.S.A. Greenwood Press, 1994. p.&nbsp;1-7\n* Kincheloe, Joe L. Understanding the New Right and its Impact on Education, 1983. Bloomington, Indiana: Phi Delta Kappa.\n* Kincheloe, Joe L. Getting Beyond the Facts: Teaching Social Studies and Social Sciences in the Twenty-First Century, 2001. NY: Peter Lang.\n*Priest, Karl Protester Voices—The 1974 Textbook Tea Party, 2010, Poca, WV:  Praying Mantis Press\nExternal links\n* News stories from the Charleston Gazette: [https://web.archive.org/web/20210527132515/https://wvculture.org/HiStory/education/textbook01.html school closings], [https://web.archive.org/web/20210527132518/https://wvculture.org/HISTORY/education/textbook02.html shooting], [https://web.archive.org/web/20210410163151/https://wvculture.org/HiStory/education/textbookletter.html letter].\n* [http://americanradioworks.publicradio.org/features/textbooks American RadioWorks documentary]\n* [http://www.wvencyclopedia.org/exhibits/13 West Virginia Encyclopedia exhibit]"
    }
  ]
}