{
  "content": [
    {
      "type": "text",
      "text": "# Kanang Anak Langkau: The Iban Warrior__disambig_1\n\n| runtime        = 106 minutes\n| country        = Malaysia\n| language       = Malay  Iban\n| budget         = MYR 6 million\n| gross          =\n}}\nKanang anak Langkau: The Iban Warrior is a 2017 Malaysian Malay-language biographical historical drama film directed by Bade Hj. Azmi with the script co-written by Zainal Fikri and Asmira Suhadis, detailing the life and career of a soldier, Kanang anak Langkau. The film starring Kanang's son, Langgi anak Kanang, who played the character of his father, along with Adi Putra, Johan As'ari, Livonia Ricky Guing, Jimmy Leong, Adam Shah, Aidil Aziz, Ruzana Ibrahim and Zachery Francis. The movie aired on 16 March 2017.\nPlot\nThe film covers the life of Kanang, who is an Iban, an ethnic warrior tribe living in the interior of Sarawak, Borneo Island. Ibans believe was that their children grew up to be warriors, Kanang was taught by his grandfather about the ins and outs of the jungle. Kanang became a great hunter and tracker, until he could read the direction of wind, hearing the tiger and lion's breath, and hearing the heartbeat of a tree.\nIn 1965, it was the culmination of communist uprisings in Malaysia and Sarawak also exposed to the threat of communist brutality. The British Army knew about Kanang's expertise and power in the jungle and tried to persuade him to serve and help against communist militants.\nKanang's career in the military began when he joined the Sarawak Rangers Regiment as an Iban Tracker, until he became a Sergeant Major in the 8th Ranger Regiment in the Malaysian Armed Forces. Kanang and his platoon had fought to eliminate communist militants throughout the country from 1948 to 1983. The fierce battle between communist terrorists and security forces continued to reach the Korbu Forest and Tanah Hitam in Perak. During a battle at Tanah Hitam, Kanang was shot until he was seriously injured, but he continued to fight hard to defeat the communist terrorists.\nCast\n* Langgi anak Kanang as Sergeant Kanang anak Langkau\n* Adi Putra as Corporal Omar bin Awang Tengah\n* Aidil Aziz as Corporal Mohd Nasir bin Mohd Nordin\n* Zachery Francis as Corporal Michael Riman Bugat\n* Johan As'ari as Lance Corporal Wan Shaipuddin Abu Kassim\n* Sofian Bujang as Ranger Baharuddin Bin Yahya\n* Jay Iswazir as Ranger Abdullah bin Chik\n* Taufiq Hanafi as Ranger Mohammad bin Tisman (Signals)\n* Lieutenant Hotin anak Lukong as Second Lieutenant Johnsin anak Meling\n* Shanningavelu Vellayah as Second Lieutenant Mohana Kumaran Ragupatty\n* Saiful Zelwany as Sergeant Ramli bin Othman\n* Rosley Rusdi as Lance Corporal Abang Salleh bin Abang Morshidi\n* Ramachandran Sundaram as Lance Corporal Raja Gopal Supramaniam\n* Adam Shah as Ranger Mustafa Kamal bin Majid\n* Amai Kamarudin as Ranger Kotap bin Buang\n* Sanpagan Sannasi as Ranger Muniandy Givindaraja\n* Ali Arami Adzahar as Ranger Ali bin Amit\n* Muhammad Faiz as Ranger Zakaria bin Akop\n* Bonyca anak Chadat as Ranger Azman (Signals)\n* Rahimizam bin Abdul Rahim as Ranger Abdullah bin Harun\n* Ahmad Rizal bin Mohd Fazil as Ranger Rosli bin Md Isa\n* Selvakumar Monogran as Ranger Kanangasan\n* Faiz as Ranger Zakaria\n* Mimpi anak Limbi as young Kanang anak Langkau\n* Livonia Ricky Guing as Helan Latai Intie\n* Cleopatra Bibi Limah Minggu as young Helan Latai Intie\n* Barba Estreina Beja as Kanang's daughter\n* Ummi Aisyah as Josephine\n* Jimmy Leong Siew Chye as Nam Yat communist leader\n* Jerrica Lai as Chin Hua\n* Ruzana Ibrahim as Senah\n* Jeseph Joe as Samy\n* Don Puena as Colonel C. A. Loone\n* Ignas Versinkas as Captain Mike Ayota\n* Ted Moxham as commanding officer\n* Malcom as British officer\n* Haris Hadra as warrior\n* Philippe Michel Vidneron as command member\n* Geoff Andre Feyaerts as helicopter pilot\n* Robert Christoper Armstrong as radioman\n* Stefan Andreas Kunath as helicopter assistant pilot\n* Tom Hermanson Snickars as flight engineer\n* Mario Tschunke as command member\nProduction\nThis film is produced by Tangan Seni Sdn. Bhd. with Empire Film Solutions, acting as distributor. Langgi, Kanang's son, played the character of his own father. According to Langgi, he accidentally met with the director, Bade Hj. Azmi, was at the Kuching International Airport in 2014, took him to the acting world. The production cost was estimated at RM6 million and filming was carried out around the Alagar farms in Taiping, Perak and Sarawak Cultural Village in Santubong, Sarawak. This film also get help from the 9th RRD Battalion in Taiping and the 10th RRD Battalion at the Muara Tuang Camp, Samarahan, Sarawak. The producer, Zainal Fitri said this film took 7 years to complete.\nRelease and reception\nThis film was scheduled to be aired on 25 August 2016, but it was postponed due to some improvements. The official release date of the film was on 16 March 2017.\nThe film received positive reviews and mixed reviews from film critics. Angelin Yeoh from Star2 said \"you would have to read about Kanang or have some knowledge of his actions before watching this film. Otherwise, the story will be lost to you as the movie does not do enough justice to his legacy as one of the most decorated soldiers in the history of Malaysia.\" Shazryn Mohd Faizal from mStar Online praised the works of this film, saying \"this Kanang's film has a pretty good premise in lifting the true story of a soldier from the Iban tribe who has sacrificed to fight the communists to ensure safety of a country.\"\nMusic\nThe theme song of this film is \"Agi Idup Agi Ngelaban\" (\"as long as you still alive, you are willing to fight and sacrifice\"). The theme song was created by Anuar Ab Razak and lyrics was written by Nor Azlan Rosle. Hazama was chosen to sing the theme song.\nAwards\n{|class=\"wikitable\"\n|-\n!Year\n!Awards\n!Category\n!Results\n|-\n|2017\n|ASEAN International Film Awards and Festival 2017\n|ASEAN Spirit Award\n|\n|-\n|}\nReferences\nExternal links\n*\n* [https://youtube/67rybT8qDyE Theme song]"
    }
  ]
}