{
  "content": [
    {
      "type": "text",
      "text": "# Kansas City Wholesale Grocery Co. v. Weber Packing Corp.\n\n|citations          = [https://www.courtlistener.com/opinion/4213862/kansas-city-wholesale-groc-co-v-weber-packing-corp/ 93 Utah 414]; 73 P.2d 1272\n|ECLI               =\n|transcripts        =\n|judges             = William H. Folland, Ephraim Hanson, James H. Wolfe, Martin M. Larson, David W. Moffat\n|number of judges   = 5\n|decision by        = Folland\n|concurring         =\n|dissenting         = Moffat\n|concur/dissent     =\n|prior actions      = Appeal from District Court, Second District, Weber County\n|appealed from      =\n|appealed to        =\n|subsequent actions =\n|related actions    =\n|opinions           =\n|keywords           =\n|italic title       =\n}}\nKansas City Wholesale Grocery Co. v. Weber Packing Corp., 93 Utah 414 (1937), was a case decided by the Supreme Court of Utah where the court modified a contract to avoid an unconscionable result.\nFacts\nOn August 4, 1930, and in March, 1931 the Weber Packing Corporation delivered 303 cases of catsup to Kansas City Wholesale Grocery Co at North Ogden, Utah. In September 1931, an inspector from the Federal Food & Drug Administration examined 271, and from 18 cans determined that there was mold filament in 67 per cent, condemning it unfit for consumption. A libel case was prosecuted by the US government against Kansas City Wholesale Grocery in Kansas City leading to the 271 cases of catsup being destroyed by the United States marshal and a fine.\nThe plaintiff filed a lawsuit against the packing company to recover the amount paid by it for the destroyed catsup, together with interest. The court issued a judgment on a directed verdict for the defendant. Plaintiff challenged the judgement from the district court in Weber County for the defendant to recover the purchase price of catsup for breach of an implied warranty of fitness under the sales contract.\nDefendant argues several points:\n# That plaintiff is not entitled to maintain the action in the state court because they are a Missouri corporation and never qualified in compliance with Utah law to do business in the state.\n# The contract was void since it constituted doing business within the state by a nonconforming foreign corporation.\n# That the transaction did not constitute a shipment in interstate commerce, therefore the operation does not fall within the Federal Food and Drug Act\n# The delivery was made on March 1, 1931, and no claims were made until  September 30, 1931, despite the contract containing a clause that all claims must be made within 10 days of receiving the goods\n# The condemnation of the catsup by the government is not binding on defendant because there was no notice of libel, no proof there is a purity standard for catsup from the Department of Agriculture, and no proof of any violation\nPlaintiff argues:\n# They were not doing business in Utah, the contract of purchase was made and performed in Utah. But the order of goods and the contract of sale was signed in Kansas City, where it became a binding obligation on both parties\n# Federal law prohibits shipment in interstate commerce of any article or food which is adulterated Food and Drug Act, ยง 2, Title 21, ยง 2, U.S.C.\n# The packing corporation knew the catsup was intended for shipment in interstate commerce,  placed the goods in the channels of such commerce which falls into the operation of the Federal Food and Drug Act\n# There is an implied warranty on the part of the seller that the food product would be fit for the purpose for which it was sold.\n# The limits for the time for making a claim applies to defects are patent, but not defects that are latent\nDecision\nThe court held that a provision limiting time for complaints could not be applied to defects in a shipment of ketchup that could only be discerned through microscopic analysis.  This case was cited in the Uniform Commercial Code as an example of the application of the principle of unconscionability.  The transaction was shipped in interstate commerce, therefore was subject to Food and Drug Act.\nReferences\nExternal links\n*"
    }
  ]
}