{
  "content": [
    {
      "type": "text",
      "text": "# Kanyarwanda War\n\nThe Kanyarwanda War (French: Guerre de Kanyarwanda) was a conflict in the northeastern region of Congo-Léopoldville, specifically the newly-established province of North Kivu, between the Banyarwanda and indigenous groups within North Kivu including the Hunde and Nande groups that lasted from 1963 to 1966. It was sparked by years of ethnic tensions between the Banyarwandan people (Hutu and Tutsi people who emigrated to Congo-Léopoldville from Rwanda), who had significant influence and power in North Kivu and surrounding provinces, and native groups such as the Hunde and Nande groups.\nBackground\nIn the 1930s the Belgian colonial administration in the Belgian Congo and Ruanda established a system of encouraging Ruandan immigration to the eastern Congo to mitigate population density in Ruanda and provide agricultural labour in the Congo. Over 25,000 Ruandans moved to the Masisi Territory between 1937 and 1945, later joined by about 60,000 immigrants between 1949 and 1955. Most of the immigrants were ethnically Hutu, but the number included Tutsi pastoralists; collectively, they were known as Banyarwanda. The classification also included some Tutsi herders who had lived in the region before the colonial period. The land they occupied in the Congo had historically been home to the Hunde people, but the Banyarwanda insisted on living within a polity of their own. In response, the Belgians created the Gishari chiefdom subject to the authority of a Tutsi chief.  Conflict arose when the Banyarwanda attempted to expand the jurisdiction of the chiefdom, and in 1957 the Belgians dissolved Gishari, leaving the immigrants under the authority of a Hunde mwami. They paid Hunde chiefs redevances for access to land and this relationship generated resentment, as the Banyarwanda felt it unfair that they should pay for the land they worked, while the Hunde believed that the Banyarwanda were seeking to avoid legitimate financial obligations. Tensions were particularly acute throughout the northern area of Kivu Province, which was densely populated and thus had the least available land. By 1959, The Banyarwandan vastly outnumbered the Hunde in Masisi and the Rutshuru Territory.\nDuring the three year period of the Rwandan Revolution from 1959 to 1962, as many as 60,000 Rwandan Tutsi refugees fled to Kivu, increasing land pressure. More well-endowed with wealth and education than their Hutu-majority predecessors, the new wave of \"fifty-niners\" was able to obtain more land through bribery. At the time of the independence of the Republic of the Congo in 1960, the legal status of the Banyarwanda was considered controversial and thus the Loi Fondamentale—the national constitution—did not address it. Most Banyarwanda were thus considered citizens but non-indigenous. Many were elected to government offices. After independence Banyarwanda elites attempt to cement their dominance over northern Kivu by encouraging illegal immigration and forcing indigenous chiefs out of Rutshuru. The indigenous people responded with similar actions in the Masisi Territory. Hunde administrators began to replace Hutu ones appointed by the Belgians, and violent land disputes resulted in Banyarwanda becoming dispossessed throughout the region. In 1963 the Congolese government began restructuring the provinces into smaller \"provincettes\". In Kivu, pushes for division were promoted by indigenous communities, particularly the Hunde and the Nande people, fearful of Banyarwanda domination. The Banyarwanda mostly favored unity of the province, as they represented a large proportion of the population of the city of Goma but also retained interest in Bukavu. Ultimately three new provinces were created, including North Kivu.\nConflict\nIn late 1963, tensions in northern Kivu led to full conflict between the Banyarwanda and indigenous peoples. According to René Lemarchand, the war started when the Hunde and Nande, spurred by the creation of North Kivu, revolted against the Banywarwanda in Masisi. According to Thomas Turner, the Banywarwanda started the conflict by waging a campaign to regain their lost property. The Bashi were generally sympathetic to the Banyarwanda. Early on in the conflict, Hunde militants burned the provincial administrative archives in attempt to destroy local records of the Banyarwanda, thus reducing them to foreign status. Both belligerents employed murder, torture, and forced displacement as tactics. The violence increased dramatically in 1965. The indigenous militants inflicted massacres upon Hutus and Tutsis, and some territorial authorities arrested Banyarwanda leaders for \"disobedience during an electoral period\" (in light of the national elections scheduled for 1965). Army personnel massacred approximately 300 Banyarwanda near Burungu. In October 1965 the North Kivu Provincial Assembly passed a resolution demanding the expulsion of Banyarwanda from the province, citing their \"collusion with rebels\". This order was abrogated by the Congolese central government. The conflict ended in 1966, when the Hunde successfully convinced the Armée Nationale Congolaise to intervene and crush Banyarwanda resistance.\nAftermath\nJoseph-Désiré Mobutu seized power and became President of the Congo in 1965. He subsequently re-unified most of the former provinces, including Kivu. In the late 1960s, the Banyarwanda garnered his sympathies, as Mobutu sought the support of ethnic minorities to boost his regime, as they could do little to threaten his power. The \"Bakajika Law\" of 1966 nationalised all land in the country, and thus the government was able to redistribute it as it wished. This resulted in property in northern Kivu becoming concentrated in the hands of wealthy Tutsis. The Banyarwanda were also formally assured of citizenship by law in 1972. In 1981 the Legislative Council repealed the law and replaced it with an ordinance guaranteeing citizenship only to those individuals whose ancestors belonged to tribes which has resided in the Congo before 1908. While the measure was never implemented, it facilitated increasing discrimination against the Banyarwanda. Low-level violence resulted in Kivu and persisted throughout the 1980s.\nReferences\nWorks cited\n*\n*\n*\n*\n*\n*"
    }
  ]
}