{
  "content": [
    {
      "type": "text",
      "text": "# Kanya King__disambig_1\n\n| image              = Kanya King at the Asian Awards.jpg\n| alt                =\n| caption            = King at the Asian Awards in 2014\n| birth_name         =\n| birth_date         =\n| birth_place        = Kilburn, London, England\n| death_date         =\n| death_place        =\n| nationality        = British\n| other_names        =\n| occupation         = Entrepreneur\n| parents            =\n| years_active       =\n| known_for          = Founder of the MOBO Awards\n| notable_works      =\n}}\nKanya King,  (born 12 February 1969 at Kilburn, London), is a British entrepreneur who founded the MOBO Awards.\nBiography\nKing was born in 1969 at Kilburn, London, to an Irish mother and a Ghanaian father, being the youngest of their nine children. Her father, Christian Ocloo, died when she was 13 years old. Aged 16, she gave birth to her son, after which she dropped out of school.\nIn December 2024, King announced that she had been diagnosed with stage four bowel cancer.\nAchievements\nThe first MOBO Awards took place in 1996 at London's Connaught Rooms, broadcast on Carlton Television.\nAppointed a Member of the Order of the British Empire (MBE) in 1999, King was promoted CBE in the 2018 Birthday Honours List.\nHaving graduated as a BA (Hons) from Goldsmiths' College, King was later awarded an honorary fellowship of Goldsmiths, University of London (2004), an honorary doctorate of Business Administration at London Metropolitan University (2006) as well as an honorary doctorate of Music from Leeds Metropolitan University (2008).\nIn 2011, King was named one of London's Most Influential People by the London Evening Standard, one of Britain's Most Entrepreneurial Women (Real Business) and has been regularly listed in the Powerlist as one of Britain's Most Influential Black People. She was recognised by the music industry in 2016, with the \"Media Pioneer Award\" at the Music Week Women In Music Awards.\nIn 2017, Kanya King spoke to the Evening Standard about building the MOBO Awards brand from being a single mother at the age of 16. King also spoke to the NME about diversity and inclusion in creative industry, as well as Music Week about the 22nd MOBO Awards being the strongest yet.\nKing appeared alongside four multi-millionaire panel members in the ITV series Fortune - Million Pound Giveaway (2007), where members of the panel decide which \"contestants\" to award no-string grants, based on the merits of their pitch.\nIn February 2013, King was rated as one of the 100 most powerful women in the United Kingdom by ''Woman's Hour on BBC Radio 4, and also featured on the BBC's 100 Women.\nOn 29 October 2015, King was listed by UK-based company Richtopia at number 60 in the list of 100 Most Influential British Entrepreneurs.\nHonours and awards\ninsignia]]\n*CBE (2018)\n*Honorary Fellow of Goldsmiths, University of London\n*Honorary Doctorate of Business Administration, London Metropolitan University\n*Honoured Patron of Music at the City of Westminster College\n*\"Contribution to Music Award\" granted by the Ghana Black Star Network\n*Presented with the Ambassador Award at the 12th annual NatWest Everywoman Awards\n*Honorary PhD, University of the Arts, recognising her commitment and success within the creative industries\n*Honorary Doctorate of Laws, University of Exeter, for outstanding achievements in the field of entrepreneurship\n*Lifetime Achievement Award from the Institute of Enterprise and Entrepreneurship (IOEE)\n*Honorary Doctorate of Music, Leeds Metropolitan University and SOAS University of London.\nReferences\nExternal links\n* [http://www.kanyaking.com/ Kanya King - Official website]\n* [https://www.gov.uk/guidance/honours-committees#arts-and-media www.gov.uk]"
    }
  ]
}