{
  "content": [
    {
      "type": "text",
      "text": "# Karposh's rebellion__disambig_1\n\n'''Karposh's rebellion or Karposh's uprising' (, Karpošovo vostanie; , Karposhovo vastanie) was a Christian anti-Ottoman uprising in the Central Balkans that took place in October 1689 during the Great Turkish War of 1683–1699. Karposh - the nickname probably derives from the Paleo-Balkan term karpa'' 'tuff (rock), limestone'. The leader of the rebellion, was born in the Sanjak of Üsküp in the then Rumelia Eyalet of the Ottoman Empire, probably in the village of Vojnik (near Kumanovo, present-day North Macedonia), and named Petar (, ). At a very young age, he escaped to Wallachia (present-day Romania), where he worked as a miner. Later, Karposh moved to the Rhodope Mountains, where he settled in the Dospat valley (near today's Greek-Bulgarian border), becoming a notorious hajduk. After the army of the Holy Roman Empire advanced into the Ottoman Balkans, Karposh moved to the area of Znepole (near Tran, on today's Serbo-Bulgarian border), and began to organise anti-Ottoman resistance-detachments there.\nPrelude\nIn 1683, the Holy League of Austria, Poland, Venice, and (later) Russia was formed to oppose the Ottoman Empire. The Ottoman Empire suffered defeat at the Battle of Vienna in 1683 and was forced to withdraw rapidly from Central Europe.  The defeat and the chaotic situation within the Ottoman Empire created widespread social disruption in the Central Balkans, particularly in the regions of Üsküp (Skopje) and Niş (Niš), where Karposh's rebellion originated. On 25 October 1689, the Austrian branch of the Holy League, led by General Piccolomini, reached the Plain of Üsküp and were met with rejoicing by the inhabitants of the villages there. The same day, Piccolomini began a withdrawal of his forces, and on 26 October, set fire to the city. Skopje burned for two whole days, through 26 and 27 October. Most of the city of Skopje was destroyed in the fire. Some accounts of these events state that Piccolomini razed Skopje due to an inability of his forces to occupy and govern a city so far from his headquarters, while other accounts state that it was perpetrated to prevent the spread of infectious disease.\nThe uprising\nIn October 1689, an uprising broke out in the region between Köstendil (Kyustendil), Şehirköy (Pirot), and Üsküp (Skopje). According to the Turkish historian Silahdar Findikli Mehmed Aga, its leader Karposh was initially a voivoda or haiduk in the vicinity of Dospat, in present-day Bulgaria. In the summer of 1689 hoping for help from the Austrian troops, haiduks, and voynuks led by Strahil vojvoda, rose in arms in the area of Northern Thrace between Filibe (Plovdiv) and Pazarcık (Pazardzhik), the Turks named him chief of Christian Auxiliary forces in the area between Sofya (Sofia), Köprülü (Veles), Doyran (Dojran), Köstendil (Kjustendil) and Nevrokop to resist against Strahil's rebels. However, he switched sides and attacked and captured Eğri Palanka (Kriva Palanka), an Ottoman stronghold, which he made the centre of his resistance. After securing Eğri Palanka, the rebels built and secured a new stronghold near Kumanova (Kumanovo). It is unclear whether the Austrians assisted the rebels. According to contemporary Ottoman chronicles and local legends, Karposh was known as the \"King of Kumanovo\", a title conferred upon him by Emperor Leopold I who sent him a beautiful busby as a gift and a sign of recognition.\nSuppression\nThe situation for the rebels did not turn out well due to military and political reversals which played a decisive role in the fate of the uprising. The first step taken by the Turkish Ottoman authorities in the region was to put down the rebellion and drive the Austrian army out of Ottoman territory. To do that the Ottomans employed the services of the Crimean Khan Selim I Giray.\nThe council of war which met in Sofia on 14 November 1689 decided to attack the rebels through Kyustendil. But before they could do that they had to secure Kriva Palanka. Upon finding that they were about to be attacked, the rebels set fire to Kriva Palanka and concentrated their forces in the new fortress of Kumanovo. They just managed to make some preparations when the Ottoman and Tatar detachments arrived. The rebels were quickly overwhelmed by the numerically superior Ottoman force. A large number of rebels, including Karposh, were captured at the outset. This became known as the Second Battle of Kumanovo.\nWhen the battle was over, all rebels who resisted were slaughtered. Karposh and the others were taken prisoner. After subduing Kumanovo, the Ottomans left for Skopje where they executed Karposh and the others. It is believed that Karposh died on the historic Stone bridge in Skopje Ottoman Macedonia.\nAftermath\nFor the rebels who survived the battles there was no salvation from the Ottoman backlash except to leave the Balkans. Many fled north beyond the Sava and Danube Rivers.\nLegacy\nKarpoš Municipality, one of the 10 municipalities that make up the city of Skopje, the capital of North Macedonia, is named after Karposh.\nHristijan Todorovski Karpoš, a Yugoslav Communist and Macedonian Partisan during World War II, took his pseudonym after Karposh.\nKarposh Square, a square across the Stone Bridge on the other side of Macedonia Square in Skopje is named after Karposh, where the leader of the uprising was executed by the Ottomans. A monument and a plaque commemorate the execution site near the bridge.\nKarposh Point on Snow Island in the South Shetland Islands, Antarctica is named after Karposh.\nGallery\nNaredba za ubistvo na Karpos.jpg|Order for the killing of Karpoš\nKarposh memory table Skopje.JPG|Memorial Plaque on the Stone Bridge where Karposh was executed.\nSpomenik na Karpoš vo Skopje.JPG|Monument of Karpoš in Skopje.\nSources"
    }
  ]
}