{
  "content": [
    {
      "type": "text",
      "text": "# Karusha kingdom__disambig_1\n\nThe Karusha kingdom is one of the Yadava kingdoms of the Mahabharata epic. It is placed to the south of Chedi. Karusha king Dantavakra supported Chedi king Shishupala and was killed by Vasudeva Krishna. Karusha Kingdom is identified as modern Datia district of Madhya Pradesh.\nReferences in Mahabharata\nKarusha was mentioned as a kingdom of ancient India (Bharata Varsha) along with the Kuntalas, the Kasi-kosalas, the Chedis, the Bhojas. (6,9)\nAlliance with Yadavas, Chedis and Magadhas\nAlliance with the Yadavas\n*Karusha king is mentioned as attending the self-choice of Draupadi along with Bala Rama and Vasudeva Krishna, the great Yadava heroes.(1,188)\nAlliance with the Chedis\n*Karusha king came to Yudhishthira's new palace at Indraprastha along with his friend Shishupala, the king of Chedi kingdom and with the Vrishi Yadava heroes(2,4)\nAlliance with the Magadhas\n*The mighty Vaka, the king of the Karushas, capable of fighting by putting forth his powers of illusion, waiteth, upon Jarasandha, as his disciple. The Karusha king Dantavakra also wait upon Jarasandha the king of Magadha. (2,14)\nDispute with Chedi king Shishupala\n*Chedi king Shishupala, disguising himself in the attire of the king of Karusha, ravished the innocent Bhadra, the princess of Visala, the intended bride of king Karusha (this Karusha is certainly not Dantavakra, Shishupala's friend). (2,44)\nKarusha region on the sea coast\nKarusha was also a type of tree (3,111). Karusha region was probably the regions where these trees grew in abundance\nKiratas (hunter-gatherers) armed with cruel weapons and ever engaged in cruel deeds, eating of fruits and roots and attired in skins and living on the northern slopes of the Himavat and on the eastern mountains and in the region of Karusha on the sea-coast (possibly in the sea coast of Bangladesh) and on both sides of the Lohitya mountains (Lohit, Arunachal Pradesh. They brought tribute to Pandava king Yudhishthira.(2,51)\nKarushas in Kurukshetra War\nThe assembled kings of the Chedi and the Karusha tribes joined the Pandavas with all their resources. (5,22). Karusha army was placed under the general Dhristaketu who was the king of Chedi Kingdom (5,199). The Chedis, Karushas and Kasis were placed under him.\nOther armies allied with the Pandavas who fought along with the Karushas were the Matsyas, Panchalas, Srinjayas, Somakas, Prabhadrakas, some Surasenas, Suras, some Kekayas, Pandyas, Kanchis, Keralas, Cholas, Dravidas, Andharas, some Kosalas, some Magadhas and the Yadavas under Satyaki and Chekitana. (6-47,54,98,107) (7-9,11,21,153), (8-12,30,47,49,54,56,73,78\nOther References\n*A virtuous and truthful king of Kasi and Karusha was called a mad dog for having renounced his territories and riches! (3,25)\n*At (1,67) Karushaka tribe was linkied with the Asura clan called Krodhaveshas\n*One of the sons of Manu was named Karusha. (1.75)\n*There was a sage named Karusha who dwelled in the western kingdoms. (12,207)\nReferences\n*Kisari Mohan Ganguli, The Mahabharata of Krishna-Dwaipayana Vyasa Translated into English Prose, 1883-1896."
    }
  ]
}