{
  "content": [
    {
      "type": "text",
      "text": "# Kasha-Katuwe Tent Rocks National Monument\n\n| area_acre = 5402\n| area_ref =\n| established = January 17, 2001\n| visitation_num =\n| visitation_year =\n| governing_body = U.S. Bureau of Land Management\n| image =\n| website = [https://www.blm.gov/visit/kktr Kasha-Katuwe Tent Rocks National Monument]\n| embedded1 =\n}}\nKasha-Katuwe Tent Rocks National Monument is a U.S. National Monument located approximately  southwest of Santa Fe, New Mexico, near Cochiti Pueblo. Managed by the Bureau of Land Management (BLM) and the Cochiti Pueblo tribe, it was established as a national monument by President Bill Clinton in January 2001. Kasha-Katuwe means \"white cliffs\" in the Pueblo language Keresan. The monument is a unit of the BLM's National Conservation Lands.\nKasha-Katuwe Tent Rocks National Monument, a popular recreation area between Santa Fe and Albuquerque, was closed in March 2020 due to the COVID-19 pandemic and remained closed until November 2024. To prevent crowding the BLM introduced a reservation system, which will allow about 75,000 visitors annually, a reduction from a peak of 130,000.\nGeology\nKasha-Katuwe is located on the Pajarito Plateau between 5700 and 6400 feet (1737–1951 m) above sea level. The area owes its remarkable geology to layers of volcanic rock and ash deposited by pyroclastic flow from eruptions within the volcanic field of the Jemez Mountains that occurred 6 to 7 million years ago. These rock layers are assigned to the Peralta Tuff. Many of the layers are light in color, which is the origin of the monument's Keresan name. Over time, weathering and erosion of these layers has created slot canyons and tent rocks. The tent rocks are composed of soft pumice and tuff. Most of the tent rocks have a distinctly conical shape and some retain their caprocks of harder stone. The tent rocks vary in height from a few feet to .\nRecreational activities\nThe BLM maintains hiking trails as well as parking and restrooms at the site. The Slot Canyon trail is a one-way trail covering  through a slot canyon and up a climb of  to a lookout point where the tent rocks may be viewed from above. The Cave Loop trail is approximately  and leads past the base of the cliffs, near some of the tent rocks and a small cavate similar to those found at the nearby Bandelier National Monument. The Veterans' Memorial Scenic Overlook, dedicated in 2004, includes a  loop trail and views of Peralta Canyon and the Jemez Mountains. The overlook is located at the end of a gravel road approximately  west of the tent rocks and may not be accessible depending on road and weather conditions.\nThe monument is open for day use only and may be closed by order of the Cochiti Pueblo Tribal Governor. Considerations for hiking include the possibility of flash flooding in the slot canyons and the high altitude of the monument. The monument is closed to dogs.\nIn popular culture\nThe science fiction television series Earth 2 filmed scenes at the monument.\nTemporary Closure\nThe BLM closed the monument in 2020 due to the COVID-19 pandemic. BLM planned to update facilities and restore trails, and increased entry fees more in line with the costs to maintain the delicate area. As of 21 November 2024, the monument has reopened.\nGallery\nImage:Tent Rocks National Monument, New Mexico.jpg|Closeup of several of the largest hoodoos in the formation.\nImage:kasha katuwe canyon1.jpg|Evidence of erosion in the slot canyon\nImage:kasha katuwe canyon2.jpg|A narrow section of the slot canyon\nImage:Kasha katuwe vista.jpg|Tent rocks, with Cochiti Pueblo lands and the Rio Grande in the distance\nImage:kasha katuwe cave.jpg|Ruins of a Native American cliff dwelling\nSee also\n* List of national monuments of the United States\n* Ah-Shi-Sle-Pah Wilderness Study Area\n* Bisti/De-Na-Zin Wilderness\n* Bryce Canyon National Park\n* Đavolja Varoš\n* Demoiselles Coiffées de Pontis\n* Hoodoo (geology)\n* List of rock formations\n* Wilderness Act\nReferences\nExternal links\n* [https://web.archive.org/web/20081007023018/http://www.nm.blm.gov/recreation/albuquerque/kasha_katuwe.htm U.S. Bureau of Land Management webpage for Kasha-Katuwe Tent Rocks National Monument]\n* [https://archive.today/20071124110806/http://www.conservationsystem.org/conservationsystem The Conservation System Alliance]\n* [http://geoinfo.nmt.edu/tour/federal/monuments/tentrocks/home.html Geologic Tour for Kasha-Katuwe Tent Rocks National Monument, New Mexico Bureau of Geology & Mineral Resources]\n* [http://www.explorenm.com/hikes/TentRocks/ More Hiking Information for Kasha-Katuwe Tent Rocks National Monument]\n* [http://www.americansouthwest.net/new_mexico/kasha-katuwe-tent-rocks/national-monument.html History and Driving Suggestions for Kasha-Katuwe Tent Rocks National Monument]\n* [http://www.tripadvisor.com/Attraction_Review-g46992-d268906-Reviews-Kasha_Katuwe_Tent_Rocks_National_Monument-Cochiti_Pueblo_New_Mexico.html Kasha-Katuwe Tent Rocks National Monument on TripAdvisor]"
    }
  ]
}