{
  "content": [
    {
      "type": "text",
      "text": "# Kasinathuni Nageswara Rao\n\n| birth_place        = Pesaramilli, Krishna District, Madras Presidency (present-day Andhra Pradesh, India)\n| death_date         =\n| death_place        = Madras, Madras Presidency (now Chennai)\n| death_cause        =\n| resting_place      =\n| resting_place_coordinates =\n| nationality        = Indian\n| other_names        = Nageswara Rao Pantulu Garu\n| known_for          =\n| education          =\n| employer           =\n| occupation         = Entrepreneur, Journalist, Publisher, Politician, Nationalist, Theologian, Social Reformer\n| title              = Desoddhaaraka, Desabandhu, Viswadatha, Kalaprapoorna\n| height             =\n| term               =\n| predecessor        =\n| successor          =\n| party              =\n| boards             =\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| relatives          =\n| signature          =\n| website            =\n| footnotes          =\n}}\nKasinadhuni Nageswararao, better known as Nageswara Rao Pantulu, (1 May 1867 – 11 April 1938) was an Indian journalist, nationalist, politician, businessman, and a staunch supporter of Khaddar movement. He participated in the Indian independence movement and in the Indian National Congress party, including Mahatma Gandhi’s civil disobedience movement through salt satyagraha. He was conferred with the title Desabandhu (Friend of the masses) by the people of Andhra Pradesh. He was a major financier of Congress activities in Andhra and Chennai and is also known for patenting Amrutanjan. He was conferred with the title Desoddhaaraka (Uplifter of the masses) by the Andhra Mahasabha. In 1935, the Andhra University honoured him with Kalaprapoorna, an honorary doctorate of Literature.\nEarly life\nKasinadhuni Nageswararao, popularly known as Nageswararao Pantulu garu, was born on 1 May 1867 in Pesaramilli village, Pamarru mandal in Krishna district of Andhra to a Brahmin couple, Bucchaiah and Syamalamba. He hailed from the prosperous Challapalli Samasthanam with his Srouta Shaivam father being the guru of the Rajas of Challapalli.\nHe received his early education in his native place and later at Machilipatnam. He graduated from Madras Christian College in 1891. While studying in Chennai, Nageswararao married the daughter of a wealth Telugu Brahmin merchant. Kandukuri Veeresalingam’s articles in Vivekavardhini journal influenced him. He showed little interest in politics in his early life but he began to identify with Gandhism as his upbringing had convinced him that Hinduism needed social and religious reform.\nBusiness\nAfter a brief stint in business in Madras, he went to Calcutta to work in an apothecary business for some time.  Later, he went to Bombay to work in an office. But, he was restless and interested in starting his own business. He founded Amrutanjan Limited in 1893 and invented Amrutanjan pain balm, which soon became a very popular medicine and made him a millionaire.\nEntry into journalism\nHe approached Telugu people in Bombay, associated with them and worked for the welfare of Telugu people.  He attended the National Congress meeting in Surat in 1907 and joined the freedom movement. He recognized the need for a Telugu language journal to campaign effectively for the freedom struggle and founded a weekly, Andhra Patrika, in 1909 in Bombay. Andhra Patrika became the principle Telugu newspaper. In 1914, he moved the journal to Madras and reformatted it as a daily newspaper. Later, in 1969, Andhra Patrika established an office in New Delhi under the leadership of T. V. Krishna. In January 1924, Rao launched a Telugu journal, Bharati.\nDesoddhaaraka\nHe was one of the founders of Andhra movement for a separate Andhra state from the Madras Presidency.  He wrote and published several articles on the need for a separate Andhra state.  He was the author of many of these articles.\nAndhra Grandha Mala\nBesides being a journalist, Nageswara Rao was also a publisher of Telugu literature. In 1926, he launched a publishing house known as the Andhra Grandha Mala. This institution published as many as 20 books besides reproducing many Telugu classics as well as modern writings. Its output was low-priced in order to bring it within reach of the common man.\nBecause of his exertions during the first two decades of the century, as many as 120 libraries came into being in Andhra districts.\nAndhra Vignana Sarvasvam\nKomarraju Venkata Lakshmana Rao, a prolific scholar and writer, conceived Andhra Vignana Sarvasvam in 1912 as an encyclopedia intended to provide comprehensive knowledge across various subjects to the Telugu-speaking community. Following Lakshmana Rao's death in 1923, the project came to a standstill. Later, Kasinathuni Nageswara Rao revived the work and published revised and enlarged editions of the first three volumes. These were consolidated into two neatly bound volumes, each comprising 600 pages, in 1932 and 1934 respectively, with contributions from various scholars. However, Nageswara Rao passed away while the third volume was still in the press.\nPolitics\nNageswara Rao was president of the Andhra State Congress Committee for four terms between 1924 and 1934.\nHe was involved in the salt satyagraha of the 1930s, led by Gandhi, and spent six months in prison for this. While in prison, Rao he wrote an exposition on the Bhagavad-Gita, a sacred text of India. He argued in this that the Bhagavad-Gita did not belong to a particular religion but rather to the entire humanity as a scripture of yoga for the spiritual enlightenment and prosperity of the entire world.\nRecognition\nA postage stamp has been issued to commemorate him.\nDesodharaka Nageswara Rao Park is a four-acre urban park in Mylapore, Chennai, India.\nSri Bagh Residence\nThe Kasinadhuni family Residence was a beautiful and famous building  situated at 103, Luz Church Road, Madras. The stately garden house was originally built by Justice PR Sundar Iyer. The house became a centre of patriotic activity with the visit of Mahatma Gandhi on 23 and 24 December 1932. This area in Madras surrounding Sri Bagh residence came to be known as Nageswarapuram in his honor.\nSribagh Pact\nSri Bagh Agreement as it is known is an agreement signed at the Sri Bagh Residence on 16 November 1937 and signatories to the agreement were K. Koti Reddy, Kalluri Subba Rao, L.Subbarami Reddy, Bhogaraju Pattabhi Seetharamayya, Konda Venkatappyya, Pappuri Ramacharyulu, R.Venkatappa Naidu, H.Seetharama Reddy. This was an agreement for development of Rayalaseema Region at par with coastal areas and part of the effort to bring in consensus among all the regions before formation of Andhra Pradesh carving out Telugu speaking areas from Composite State of Madras and unifying the areas of Nizam rule post independence of India. The agreement can be changed by mutual agreement.\nDeath\nNageswararao Kasinadhuni died on 11 April 1938, after which his son-in law and nephew S. Sambhu Prasad (Sivalenka SambhuPrasad) took over the reins of Andhra Patrika group of publications and Amrutanjan company.\nReferences"
    }
  ]
}