{
  "content": [
    {
      "type": "text",
      "text": "# Katherine Stewart Forbes (1818 ship)\n\n{|\n| Ship name=Katherine Stewart Forbes\n| Ship owner=A. Chapman & Co.\n| Ship operator=\n| Ship ordered=\n| Ship builder=William & Henry Pitcher, Northfleet\n| Ship original cost=\n| Ship laid down=\n| Ship launched=5 November 1818\n| Ship acquired=\n| Ship commissioned=\n| Ship decommissioned=\n| Ship in service=\n| Ship out of service=\n| Ship renamed=\n| Ship struck=\n| Ship reinstated=\n| Ship honours=\n| Ship honors=\n| Ship captured=\n| Ship fate=Last listed 1860\n| Ship notes=\n}}\n| Ship type=Cargo-passenger\n| Ship class=\n| Ship tons burthen=457, or 457}} (bm)\n| Ship length=\n| Ship beam=\n| Ship draught= not recorded\n| Ship draft=\n| Ship hold depth=\n| Ship propulsion=\n| Ship sail plan=Ship rig, later a barque\n| Ship complement=\n| Ship armament=\n| Ship notes=\n}}\n|}\nKatherine Stewart Forbes was a full-rigged ship built by William & Henry Pitcher at Northfleet dockyard in Kent, England in 1818. She was classified as \"A1\", a first class vessel made from first quality materials. The ship was launched for A. Chapman and Company and named by Katherine Stewart, the daughter of Charles Forbes MP in 1818, on 31 October or 5 November.  She was re-rigged as a barque about 1836.\nShe initially sailed between Britain and India under a license from the British East India Company (EIC). She next transported convicts to Australia in 1830 and 1832. She also carried early settlers to South Australia in 1837, and New Zealand in 1841 and 1851, and mapped part of the coast of Borneo.\nShe made several trips from England to Australia and between Australian settlements. She also was variously employed in the seagoing transport trade.\nEarly career\nIn 1813 the EIC lost its monopoly on the trade between India and Britain. British ships were then free to sail to India or the Indian Ocean under a license from the EIC.\nKatherine Stewart Forbes first appeared in ''Lloyd's Register (LR) in 1819 with J.Lamb, master, Chapman, owner, and trade London–Bombay. Lamb sailed from London on 3 January 1819 for Bombay. She then proceeded to sail between England and India for a number of years.\n{| class=\"sortable wikitable\"\n|-\n! Year\n! Master\n! Owner\n! Trade\n! Source\n|-\n| 1820\n| J.Lamb\n| Chapman\n| Plymouth–Bombay\n| Register of Shipping (RS)\n|-\n| 1825\n| Chapman\n| Chapman\n| London–Bombay\n| RS\n|-\n| 1829\n| ChapmanCannay\n| A. Chapman\n| London–Bombay\n| RS''\n|}\n1829: Transporting convicts to Port Jackson\nCaptain Thomas Canney sailed from Plymouth on 18 October 1829 and arrived at Port Jackson on 18 February 1830. She embarked 200 male convicts and landed 199, having suffered one convict death en route.\n1832: Transporting convicts to Van Diemen's Land\nThe voyage began with a cholera outbreak on board the day she sailed from Woolwich. She anchored in Plymouth Sound but was ordered to put to sea again after receiving medical supplies and the services of an assistant surgeon from the Royal Navy. She returned to the Thames Estuary and was laid up in Stangate Creek until the end of March before being allowed to resume her voyage.\nOf the 222 convicts aboard, 30 men developed cholera and 13 died before Captain John Anderson finally set sail from Plymouth on 23 March 1832 bound for Van Dieman's Land, where she arrived on 16 July. She suffered no deaths among her convicts after she left Plymouth.\n1836: Transport\nOn 31 May 1836 Katherine Stewart Forbes arrived at Portsmouth from Jersey. She carried the depot of the 1st Battalion, the Rifle Brigade, numbering 13 officers and 218 other ranks. She then went into dock for refitting.\n1837: Gravesend to Adelaide\nShe sailed from Gravesend on 27 July 1837 under the command of Captain Alfred Fell and arrived at Holdfast Bay, South Australia, on 17 October 1837. She carried 177 passengers, who came from England and Ireland. There were six aged over thirty, of whom five paid their own way. There were 129 aged between fifteen and thirty, of whom only four were required to pay, and there were forty-two aged under fifteen, all of whom were granted free passage.\nThe voyage left England one month after King William IV died and Princess Victoria was ascended to the throne. On Katherine Stewart Forbess arrival at Adelaide a public proclamation was made regarding the death of King William IV and the accession of Queen Victoria.\n1838: Launceston to Port Adelaide\nKatherine Stewart Forbes departed Launceston, and arrived Port Adelaide on 17 June 1838. The only recorded passenger was Mr John Brown.\n1839: London to Adelaide\nShe departed London on 20 October 1838 and after a stop at the Cape of Good Hope, she arrived in Adelaide on 21 March 1839.\n1840: Adelaide to London\nKatherine Stewart Forbes departed Port Adelaide on 11 April 1840, carrying with her the former Governor of South Australia, George Gawler, his aide-de-camp, James Collins Hawker and his gardener and Derbyshire botanist, Joseph Whittaker. The vessel was delayed for five days at Kingscote on Kangaroo Island in order to fill with wood and water for the journey. She then called in at Mauritius and St Helena and then stopped at Corvo in the Azores for just two hours to obtain provisions. The vessel reached England on 23 September 1840. The journey back to England was described in some detail in Hawker's 1899 book, Early Experiences in South Australia. Pressed plant specimens collected by Joseph Whittaker from the island  stops that Katherine Steward Forbes made en route were subsequently supplied to Kew Gardens.\n1841: London to Wellington\nUnder Captain John Hobbs, Katherine Stewart Forbes left Gravesend on 5 February 1841 and arrived at Port Nicholson on 24 June with 176 emigrants.\n1842?: Sarawak\nBetween 1841 and 1843, J.S.Hobbs, hydrographer, of Katharine Stewart Forbes, master John Hobbs, made a 'Sketch of part of the N.W.Coast of Borneo showing the approaches to and entrances of the Sarawak River'. This map was then drawn up in London and sent by Henry Wise to the Admiralty in November 1843. The map notes two anchorages, at one of which 'Katharine S.Forbes anchored and loaded Cargo'.\nIn 1846 she underwent a large repair.\n1850: Adelaide to Port Jackson\nUnder Captain William Wright, she made a coastal voyage with passengers.\n1851: London to Auckland\nUnder Captain William Wright, Katharine Stewart Forbes left St Katherine's Dock on 22 October 1851 and arrived at Auckland on 9 March with 65 emigrants.\nFate\nKatherine Stewart Forbes was last listed in ''Lloyd's Register in 1860 with Dougal, master, and Chapman, owner, but without a home port or trade.\nCitations\nReferences\n*\n*\n*"
    }
  ]
}