{
  "content": [
    {
      "type": "text",
      "text": "# Kawartha Lakes Railway\n\nThe Kawartha Lakes Railway is a Canadian rail line. It was created in  to assume the operations of the Havelock and Nephton Subdivisions of the Canadian Pacific Railway which serve the Peterborough, Ontario area.\nThe line originally had 19 employees and it is now a Canadian Pacific internal shortline railway, with a unique collective agreement and employee-managed operation.\nRoute\nOriginally built by the Ontario and Quebec Railway, which was leased by the CPR for 99 years, the Havelock Subdivision originally began at Glen Tay. In fact, the mile posts on this route are still measured in miles from Glen Tay. The section between Glen Tay and Havelock was abandoned in stages until the present mileage remains: Mile 90.8 near Havelock westward to Mile 182.4 which is the junction with the CP Belleville Sub at Kennedy in Toronto. The Nephton Subdivision extends from Mile 94.4 west of Havelock to Blue Mountain, a distance of twenty track miles. Crews are based at Havelock and Peterborough. Havelock crews run trains to Toronto Agincourt Yard and return (formally Train 90/91 and later T07/08 now known as H07/08) as well as to Blue Mountain via Nephton and back. The railway primarily serves the nepheline syenite mines owned by Unimin Canada at Blue Mountain and Nephton. This line also served the former 3M plant east of Havelock. Other customers are served by Peterborough-based crews including Quaker Oats, Canadian General Electric, and formerly United Canadian Malt, Kingdon Lumber/TIM-BR MART, and Poly Tubes receives plastic pellets by rail within the City of Peterborough. Waste product from Quaker Oats is also offloaded at Harper road and elevated into trucks for use in wood stove pellet production. As well, Cavan Agri Products receives carloads of grain, feed, and potash at Cavan.\nThe method of control is Rule 105 from the end of track east of Havelock to the begin/end main track sign just west of Havelock, Occupancy Control System (OCS) from the begin/end main track sign to Mile 178 just outside Toronto Yard. Beyond Toronto Yard, the Havelock Sub is CTC to the junction with the CP Belleville Sub. The entire Nephton Sub is under OCS. In the 1980s CN abandoned its operations in the area, and KLR has assumed their customers and two sections of remaining CN trackage, including a swing bridge, within the city of Peterborough. In September 2012, Canadian Pacific announced that it were considering closing the former Grand Junction Railway of Canada/CN spur because of deteriorating condition of the track and swing bridge. The line is currently locked off by Engineering services due to bridge condition, which would leave the businesses in the south end Industrial section such as Poly Tubes without rail service. The former CN spur that also serves United Canada Malt was locked off and closed in October 2014. The City of Peterborough is buying the former CN lines, as well as the section crew office on Rink St., for use as recreational trails once the abandonment process is finalized.\nDuring the 1990s, GE Capital ran a rail car repair centre on the south side of the Havelock rail yard at the old CP roundhouse location. CP crews brought cars in from Toronto for repairs and shipped them out when they were finished. The location is now the current office for local section and rail crews since GE closed the shop, and the train station was sold off.\nThe former Canadian Pacific station, next to the Havelock rail yard, has been restored and operated as a restaurant since 2004.\nThe train hijacking scene in the 1984 film ''Martin's Day'' was filmed at mile marker 10/Peterborough County Rd. #44 crossing of the Nepthon Subdivision north of Havelock, Ontario.\nTraffic\nWith the elimination of passenger service on January 14, 1990, the typical weekly traffic now consists of freights with 3 units consisting of either GP20C-ECOs and or GP38-2s. H08 runs Sun, Tues, Thurs. H07 runs Mon, Wed, Fri. No trains run on Saturday\nPossibility of passenger rail\nIn 2008, the federal government announced plans to restart passenger rail service to Peterborough from Toronto. The service would be operated by Via Rail, but it has been estimated that it would carry fewer than 100 passengers per day. Via Rail cited the high cost per passenger that resulted in cancellation of the service in 1990; however, the government of the day had actually decided that Via Rail should serve intercity passengers only and felt that the Havelock traffic clearly belonged to the commuter market serviced by GO Transit. GO Transit has a contingency plan for establishing rail service to Peterborough but also has studies and plans that cover a range of eventualities including electrifying the entire Lakeshore route and service to Collingwood, Ontario.\nIn 2011, a group named the Shining Waters Railway was established with the goals of inheriting the Kawartha Lakes Railway's two subdivisions, the Havelock and Nephton from CP Rail to continue freight service and even resume passenger rail service from Toronto to Peterborough and beyond (in a partnership with GO Train, VIA Rail, or another partner).\nIn 2025, the Alto high-speed rail project was announced by the Canadian government. It will provide passenger service connecting Peterborough with Toronto and Ottawa.\nNotes\nExternal links\n* [http://www8.cpr.ca/cms/English/default.htm?1 - Canadian Pacific Railway]"
    }
  ]
}