{
  "content": [
    {
      "type": "text",
      "text": "# Kearsarge-class battleship\n\n{|\n| Class before          =\n| Class after           =\n| Built range           = 1896–1900\n| In commission range   = 1900–1920\n| Total ships completed = 2\n| Total ships retired   = 2\n}}\n*Full load:\n| Ship length =\n| Ship beam =\n| Ship height =\n| Ship draft =\n| Ship power =\n*5 × Scotch marine boilers\n*\n| Ship propulsion =\n*2 × triple-expansion steam engines\n*2 × screw propellers\n| Ship speed =\n| Ship range =  at\n| Ship complement =\n*38 officers\n*548 or 549 enlisted men\n| Ship armament =\n*  4 × /35 caliber guns\n*  4 × /35 caliber guns\n* 14 × /40 caliber guns\n* 20 × 6-pounders ()\n*  8 × 1-pounders ()\n*  4 ×  torpedo tubes\n| Ship armor =\n* Belt:\n* Turrets (primary):\n* Turrets (secondary):\n* Conning Tower:\n* Deck:\n| Ship notes =\n}}\n|}\nThe 'Kearsarge-class' was a group of two pre-dreadnought battleships built for the United States Navy in the 1890s. The two ships— and —represented a compromise between two preceding battleship designs, the low-freeboard  and the high-freeboard , though their design also incorporated several improvements. Their primary advances over earlier designs consisted of new quick-firing guns and improved armor protection, but their most novel feature was their two-story gun turrets that consisted of a secondary  gun turret fixed to the top of their primary  turrets. The ships suffered from a number of problems, however, including a tertiary battery mounted too low in the hull and poorly-designed turrets, though the latter were attempted again with the  in the early 1900s, also with negative results.\nKearsarge served as the flagship of the North Atlantic Squadron after entering service, while Kentucky was initially sent to East Asia. In 1904, Kearsarge was temporarily transferred to the European Squadron, also serving as its flagship. Both vessels returned to the North Atlantic Squadron in 1905, and in 1906, Kentucky carried marines to Cuba during unrest in the country. Both ships participated in the cruise of the Great White Fleet around the world between late 1907 and early 1908, and after their return, they were modernized between 1909 and 1911, thereafter being placed in reserve. The two ships were reactivated in mid-1915 and Kearsarge was used as a training ship, while Kentucky was sent to participate in the United States occupation of Veracruz.\nAfter the United States entered World War I in April 1917, both ships were used as training vessels for the rapidly-expanding fleet before being decommissioned in 1920. Kentucky was quickly discarded, being struck from the Naval Vessel Register in 1922 and sold for scrap the following year, but Kearsarge was converted into a crane ship. She was used in this capacity for the next twenty years, being involved in the recovery of the submarine  and numerous warship construction, repair, and modernization projects. She was ultimately struck in 1955 and sold to ship breakers later that year.\nDesign\nFollowing the authorization of the battleship  in 1892, the United States Navy failed to order new vessels in 1893 and 1894; this was in part the result of an economic depression in 1893 that reduced naval budgets, and also the views of the new Secretary of the Navy Hilary A. Herbert, who had opposed fleets of expensive battleships earlier in the decade. Nevertheless, the Bureau of Construction and Repair (C&R) continued to work on new designs, and by 1893, Herbert had been convinced by Alfred Thayer Mahan's seminal work The Influence of Sea Power upon History. In his requested budget for 1893, Herbert requested Congress appropriate funds for at least one new battleship. Congress delayed until 1895, when it authorized funding for two ships that were to become the Kearsarge class by the Act of 2 March 1895.\nWork on the new design began immediately, and by late March, four proposals had been prepared. All four marked a compromise between the high-freeboard Iowa and the coastal battleships of the ; they had greater freeboard than the Indianas, but lacked the raised forecastle that had rendered Iowa an excellent sea boat. Coal storage, again, represented a compromise between the two. Armor protection was increased compared to the earlier vessels, which included an improved arrangement of the armor deck so that it protected a greater volume of the hull. The main battery was to repeat the  guns used in Iowa, since they fired significantly faster than the 13-inch guns the Indianas carried.\nThe designs varied considerably with regard to their armament. By this time, a new  quick-firing gun had been developed, which significantly increased the offensive power of the tertiary battery. The designers initially considered adopting gun turrets for these weapons, but decided against it owing to the increased weight of such an arrangement, along with problems with ammunition magazines and fire control. All four designs arranged these in a central battery amidships, which forced the secondary battery of 8-inch guns to be pushed toward the ends of the ship. The four variants adopted different arrangements for these guns: \"A\" called for eight guns, two in centerline positions superfiring over the main battery and two wing turrets amidships. \"B\" discarded the forward turret and placed two wing turrets further forward and one superfiring aft; \"C\" retained the centerline turrets and discarded the wing mounts, and \"D\" opted for the reverse of \"C\".\nC&R preferred the \"A\" design, since it maximized firepower, while the Bureau of Ordnance (BuOrd) believed that none of the proposals was worth pursuing. An ensign in BuOrd, Joseph Strauss, developed a two-story turret that solved the problem; it would carry the 8-inch guns in a separate turret mounted directly atop (and fixed to) the main battery turret. Strauss accordingly proposed a fifth version, \"E\", that incorporated his turret. Some officers questioned whether it was advisable that the 8-inch guns could not be directed against targets other than what the 12-inch guns were engaging, but Strauss pointed out that at long range, ships were relatively small targets, and at close range, the much greater reloading time of the large guns would permit the 8-inch guns to direct the rotation of the turret while the gun crews prepared the main guns. By this time, American naval engineers had made improvements to their gun turret designs and significant weight savings were achieved. In addition, the two-story, four-gun turret adopted for the Kearsarge class was lighter than the two-gun turrets used in the Indianas of just five years earlier.\nAt the same time, BuOrd registered its opposition to what it viewed as a regression to 12-inch guns; while the 13-inch weapons were slower to fire, BuOrd estimated that they were 30&nbsp;percent more powerful. Experiments with  armor plate demonstrated that 12-inch guns could not penetrate that thickness even at the relatively close range of , while the 13-inch shells were capable of defeating the armor plate. C&R refused to accept BuOrd's objections, but further tests with a mock up of Iowas belt demonstrated that the 13-inch shells could easily defeat the armor, while the 12-inch shells were kept out. The Navy decided to adopt \"E\", with 13-inch guns in place of the 12-inch weapons originally proposed.\nThe Navy repeated the two-story turret arrangement with the s designed in the early 1900s, with much the same reasoning, namely the goal of weight reduction and the belief that the faster-firing 8-inch guns could be operated without disrupting the 12-inch guns adopted for the Virginias. A new, sloped turret design remedied the problem with the overly-large gun ports of the Kearsarge turrets, but the advent of large-caliber, quick-firing guns rendered the concept a failure, since the 12-inch guns fired nearly as quickly as the 8-inch weapons, and the latter could not be fired without severe blast effects disrupting the crew of the former.\nGeneral characteristics and machinery\nThe two Kearsarge-class ships were  long at the waterline and  long overall, with a beam of  and a draft of . They displaced  normally, which increased to  at full load. Like the Indiana class, the Kearsarge class also had a very low freeboard, amounting to  forward under normal conditions, which resulted in her guns becoming unusable in bad weather. The ships' hulls incorporated a prominent ram bow, a common feature for battleships of the period.\nSteering was controlled with a single rudder; while steaming at a speed of , it took Kearsarge  to complete a turn to port and  to turn to starboard. As completed, both ships carried two heavy military masts that carried some of the vessels' light guns, along with spotting tops to help direct the aim of their guns. Kearsarge was manned by 38 officers and 548 enlisted men, while Kentucky carried 38 officers and 549 enlisted men. Their complement was later adjusted to 40&nbsp;officers and 513&nbsp;enlisted men.\nThe battleships had two 3-cylinder vertical triple-expansion steam engines that each drove a single screw propeller. Steam for the engines was provided by five coal-fired Scotch marine boilers, which were ducted into a pair of funnels. The ships' engines were designed to produce a total of  for a top speed of . During sea trials, the indicated horsepower and speed exceeded the design, with Kearsarges engines producing a total of  for  and Kentuckys propulsion system reaching  for . Coal storage amounted to  normally and up to  at full load. At a cruising speed of , the ships could steam for .\nArmament\nThe Kearsarge-class battleships had two double turrets, with two /35 caliber guns and two /35 caliber guns each, stacked in two levels. The guns and turret armor were designed by BuOrd, while the turret itself was designed by C&R. Since the turrets retained the vertical walls of the type used in the first generation of American battleships, the ports had to be very large to allow for sufficient elevation. Then-Lieutenant William Sims noted that the floors of the turrets could be easily seen through the ports, and claimed that as a result, a shell fired into the port could reach the magazines below, disabling the guns.\nThe 13-inch weapons were built-up guns of the Mark II type, mounted in Mark III turrets that were electrically trained. They were originally supplied with brown powder propellant charges that weighed nearly , later being replaced by  smokeless charges. The shells had a muzzle velocity of , and at the muzzle, could penetrate up to  of standard steel, and at a range of , could pierce  of steel. The turrets allowed depression to −5&nbsp;degrees and elevation to 15&nbsp;degrees, which provided a maximum range of , though this was significantly in excess of what could be achieved with the rudimentary gunnery direction equipment at the time; BuOrd recommended that crews open fire at , and even this was optimistic. The rate of fire was one shot every 320&nbsp;seconds, and the guns had to be returned to 2&nbsp;degrees elevation to be reloaded.\nThe 8-inch guns were the Mark IV version, which had a muzzle velocity of . Also originally brown-powder guns, they, too, received updated smokeless charges in the early 1900s. The change improved the rate of fire from one shot per minute to one shot every forty seconds. Reloading was also fixed at 0&nbsp;degrees. They were mounted in Mark IX turrets that were fixed atop the main battery turrets. The arrangement was adopted because the significantly higher rate of fire of the 8-inch guns was thought to reduce interference between the guns, but with the adoption of smokeless propellant and rapid fire for the main battery in the early 1900s proved this to be an incorrect assumption.\nThe turret guns were supported by a battery of fourteen 5&nbsp;in/40 caliber guns mounted individually in casemates in the upper deck, seven on each broadside. Once the ships entered service, it was discovered that the central battery had been placed too close to the waterline, and the casemates were frequently washed out, rendering them unusable in all but calm seas. For defense against torpedo boats, they also carried twenty 6-pounder () Hotchkiss guns and eight 1-pounder () guns. These were also in individual open mounts distributed around the decks and fighting tops of the masts; eight of the 57&nbsp;mm guns were placed in a broadside battery one deck above the 5-inch guns, four on either side. Four more were placed in casemates in the bow, and another four were similarly arranged toward the stern. The ships also carried a pair of M1895 Colt–Browning machine gun chambered in  Lee Navy.\nAs was customary for battleships of the period, the Kearsarge-class carried four  torpedo tubes. These were placed in above-water mounts in the hull; two were placed abreast of the forward main battery turret and the other two were placed on either side of the aft superstructure. The tubes were supplied with a total of six torpedoes. They were initially equipped with the Mark II Whitehead design, which carried a  warhead and had a range of  at a speed of .\nArmor\n, showing the arrangement of the guns and armor]]\nThe ships were protected with face-hardened Harvey armor, an improvement over earlier compound plates. The main strake of the belt armor extended from the forward boiler room\nto the aft main battery barbette, and covered a section of the hull from  above the waterline and  below the line. It was  thick at the top, gradually tapering to  at the waterline, and reducing further to  at the bottom edge of the belt. Forward of the boiler rooms, the belt was reduced to a maximum thickness of , and from the forward barbette, slimmed further to . Transverse bulkheads that were  forward and  aft connected the belt on both sides of the ships. Above the main strake was a second one that was 5&nbsp;in thick, extending from the forward to aft barbette.\nThe belt structure was reinforced by a curved armor deck that was curved at the sides and connected to the bottom edge of the belt. The flat portion of the deck was level with the upper edge of the belt, and it was  thick. Forward, where the belt was significantly reduced in thickness, the deck was increased slightly to ; aft, where there was no side protection, the deck was more significantly strengthened, being 5&nbsp;in thick. The conning tower had 10&nbsp;in thick sides and a  roof.\nArmor protection for the 13-inch turrets amounted to  on the sides and  on the rear to balance the turrets, while the 8-inch turrets received  on the sides and  on the rears. Their roofs were  and 2&nbsp;inches thick for the 13-inch and 8-inch turrets, respectively. The turrets rested in armored barbettes that were  thick. The 5-inch gun battery, which was placed directly above the upper belt, received 6&nbsp;in of armor plating. The casemate battery lacked splinter screens between each gun, a significant shortcoming since a single hit could disable numerous guns.\nModifications\nAfter the US Navy introduced rapid-firing for main guns in 1903, Kearsarge and Kentucky had automatic shutters installed in the ammunition hoists to prevent an explosion in the turret from traveling down to the magazines. After a propellant charge was accidentally detonated by an electrical short aboard Kentucky in April 1906, most electrical equipment was removed from the ships' turrets and additional precautions were installed, including bulkheads between the guns in each turret and gas evacuators in the breeches of the guns to prevent propellant gasses from blowing back into the turrets.\nBetween 1909 and 1911, most of the 57&nbsp;mm guns were removed and four more 5-inch guns were installed. The original military masts were replaced with lattice masts, and the torpedo tubes were also removed. The ships also had their original boilers replaced with eight Mosher boilers. The ships underwent another refit by 1919 that included the removal of all but eight of the 5-inch guns. The guns that were removed were used to arm merchant ships to defend themselves against German U-boat attacks. A pair of  anti-aircraft guns were installed aboard each vessel. At some point in the ships' careers, splinter bulkheads were added to the 5-inch battery to improve survivability.\nShips in class\n{| class=\"wikitable plainrowheaders\" style=\"margin-right: 0;\"\n|+ Construction data\n! scope=\"col\" | Name\n! scope=\"col\" style=\"width: 4em;\" | Hull\n! scope=\"col\" style=\"width: 11em;\" | Builder\n! scope=\"col\" | Laid down\n! scope=\"col\" | Launched\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|-\n! scope=\"row\" | USS Kearsarge\n| BB-5\n| rowspan=\"2\"| Newport News Shipbuilding\n| rowspan=\"2\"| 30 June 1896\n| rowspan=\"2\"| 24 March 1898\n| 20 February 1900\n| Converted to a crane ship in 1920, sold for scrap on 9 August 1955\n|-\n! scope=\"row\" | USS Kentucky\n| BB-6\n| 15 May 1900\n| Sold for scrap, 24 March 1923\n|}\nService histories\nUSS Kearsarge (BB-5)\nKearsarge was laid down on 30 June 1896. She was launched on 24 March 1898 and was commissioned on 20 February 1900. From 1900 to 1905, Kearsarge served as flagship of the North Atlantic Squadron, except for a short period in 1904 when she was reassigned as flagship of the European Squadron. In 1905, the battleship  replaced Kearsarge as flagship of the North Atlantic Fleet, although she remained with the fleet. In April, the ship suffered an explosion in her forward 13-inch turret that killed ten of its crew; Isadore Nordstrom and George Breeman both received the Medal of Honor, the former for rescuing several badly wounded men and the latter for preventing the fire from reaching the propellant magazines.\n]]\nIn 1907, the Great White Fleet was ordered by U.S. President Theodore Roosevelt to circle the world as a demonstration of the might of the United States Navy. Kearsarge was attached to the Fourth Division of the Second Squadron. The fleet left from Hampton Roads on 16 December 1907, circled South America, passed through San Francisco, and arrived at Hawaii. From there they sailed to New Zealand and Australia, visited the Philippine Islands, Japan, China, and Ceylon before transiting the Suez Canal. The fleet split at Port Said to visit various ports, with Kearsarge leaving for Malta and Algiers, before reforming with the rest of the fleet at Gibraltar. The ships arrived back in Hampton Roads on 22 February 1908.\nBetween 1909 and 1911, Kearsarge was modernized at the Philadelphia Naval Shipyard, and thereafter was placed in reserve. She was recommissioned on 23 June 1915 and operated along the Atlantic coast for the next two years as a training ship for naval militia from Massachusetts and Maine. After the United States entered World War I in April 1917, she was used to train armed guard crews and naval engineers during cruises along the Atlantic seaboard. Following the end of the war, she continued training duties until being decommissioned at the Philadelphia Navy Yard on either 10 May or 18 May 1920.\nKearsarge was converted into a crane ship, and was given hull classification symbol IX-16 on 17 July 1920, but it was changed to AB-1 on 5 August. Her turrets, superstructure, and armor were removed, and were replaced by a large revolving crane with a lifting capacity of , as well as  blisters, which improved her stability. The crane ship was used often over the next 20&nbsp;years, including the raising of  in 1939. On 6 November 1941, Kearsarge was renamed Crane Ship No. 1, allowing her name to be given to the aircraft carrier that was eventually renamed , and later to the carrier . She continued her service, however, handling guns, turrets, armor, and other heavy lifts for vessels such as the battleships , , and   and the cruisers  and . She was transferred to the San Francisco Naval Shipyard in 1945, where she participated in the construction of Hornet, the carrier , and the re-construction of the carrier . In 1948, she left the West Coast for the Boston Naval Shipyard. On 22 June 1955, her name was struck from the Naval Vessel Register, and she was sold for scrap on 9 August.\nUSS Kentucky (BB-6)\nKentucky laid down on the same day as her sister ship, and was launched the same day as well. She was commissioned on 15 May 1900. Later that year, she left for China to join the Eight Nation Alliance then in the process of suppressing the Boxer Rebellion. Kentucky arrived in East Asia in early 1901 and she saw no action during the final stage of the uprising. The ship operated in the region until early 1904. After returning to the United States, she joined the North Atlantic Squadron in 1905. During the 1906 Cuban Insurrection, she carried Marines to the island, embarking them in Provincetown and landing them at Havana, Cuba for the Second Occupation of Cuba.\nIn 1907, Kentucky participated in the Great White Fleet, as part of the Fourth Division with her sister. The fleet left from Hampton Roads on 16 December 1907, circled South America, passed through San Francisco, and arrived at Hawaii. From there, they sailed to New Zealand and Australia, visited the Philippine Islands, Japan, China, and Ceylon before transiting the Suez Canal. The fleet split at Port Said, with Kentucky visiting Tripoli and Algiers, before reforming with the fleet at Gibraltar. She returned to Hampton Roads on 22 February.\nFrom 1909–1911, Kentucky was modernized at the Philadelphia Naval Shipyard. She was thereafter placed in reserve, where she remained until she was recommissioned at Philadelphia on 23 June 1915. Following the United States occupation of Veracruz, she sailed to Mexico, patrolling the coast off Veracruz until 1916. She then returned to New York, where she laid until the United States entered World War I. During the war, she operated as a training ship as part of the mobilization effort, training several thousand men along the Atlantic coast.\nIn late 1918 and early 1919, Kentucky was overhauled at the Boston Navy Yard. She then left for exercises in Guantanamo Bay, Norfolk, and along the New England coast, and later trained United States Naval Academy midshipmen. Kentucky was decommissioned on 29 March 1920; the Navy briefly considered rebuilding her into a crane ship as well, but ultimately decided against it. Her name was struck from the Naval Vessel Register on 27 May 1922 and she was sold for scrap to Dravo Corporation on 24 March 1923.\nFootnotes\nReferences\n*\n}}\n*\n}}\n*\n| url-access = registration\n| url = https://archive.org/details/conwaysallworlds0000unse_l2e2\n| name-list-style=amp\n}}\n*\n| work = Naval Vessel Register\n| publisher = United States Navy\n| access-date = 11 January 2013\n| ref =\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\nFurther reading\n*\n*"
    }
  ]
}