{
  "content": [
    {
      "type": "text",
      "text": "# Kedareshwara Temple, Halebidu__disambig_1\n\n| subdivision_type1       = State\n| subdivision_name1       = Karnataka\n| subdivision_type2       = District\n| subdivision_name2       = Hassan District\n| established_title       =\n| established_date        =\n| founder                 =\n| named_for               =\n| government_type         =\n| governing_body          =\n| unit_pref               = Metric\n| area_footnotes          =\n| area_rank               =\n| area_total_km2          =\n| elevation_footnotes     =\n| elevation_m             =\n| population_total        =\n| population_as_of        =\n| population_rank         =\n| population_density_km2  = auto\n| population_demonym      =\n| population_footnotes    =\n| demographics_type1      = Languages\n| demographics1_title1    = Official\n| demographics1_info1     = Kannada\n| timezone1               = IST\n| utc_offset1             = +5:30\n| postal_code_type        = PIN\n| postal_code             = 573121\n| registration_plate      =\n| website                 =\n| iso_code                = IN-KA\n| footnotes               =\n}}\nKedareshwara Temple (also spelt \"Kedaresvara\" or \"Kedareshvara\") is a Hoysala era construction in the historically important town of Halebidu, in the Hassan district of Karnataka state, India. It is located a short distance away from the famous Hoysaleswara Temple. The temple was constructed by Hoysala King Veera Ballala II (r. 1173–1220 CE) and his Queen Ketaladevi, and the main deity is Ishwara (another name for the Hindu god Shiva). The temple is protected as a monument of national importance by the Archaeological Survey of India.\nTemple plan\nAccording to art historian Adam Hardy, the temple was constructed before 1219 CE and is constructed with Soap stone. The usage of Soap stone was first popularised by the Western Chalukyas before it became standard with the Hoysala architects of the 12th and 13th centuries. The temple stands on the platform called jagati which is typically five to six feet in height and which can be reached by a flight of steps. According to historian Kamath, this is a Hoysala innovation. Hoysala temples normally don't provide a path for circumambulation (pradakshinapatha) around the inner sanctum (garbhagriha). However, the platform provides this convenience in addition to giving the onlooker a good view of the wall relief and sculptures. The outlay of the main shrine (Vimana) is star-shaped (stellate) with two smaller shrines that have perforated windows (called Jali, literally, \"sieve\") on the sides. According to the art historian Gerard Foekema, star-shaped or \"staggered square\" (or cross in square) temple plans are quite common among Hoysala constructions creating multiple projections and recesses in the outer walls. In these projections, the Hoysala architects created repetitive decorative sculptures and reliefs called \"architectural articulation\".\nSince the temple has three shrines, it qualifies as a trikuta, a three shrined structure. Often in trikutas, only the central shrine has a tower while the lateral shrines are virtually hidden behind the thick outer walls and appear to be a part of the hall itself. Despite being a Shaiva temple (related to god Shiva) it is well known for its friezes and panel relief that bare depictions from both the Shaiva and Vaishnava (related to the god Vishnu) legend. The three sanctums are connected to a \"staggered square\" (indented) central hall (mahamantapa) by individual vestibules called sukanasi. A porch connects the central hall to the platform. The base of the temple wall (adhisthana) around the common hall and the two lateral shrines consist of mouldings, each of which is treated with friezes in relief that depict animals and episodes from the Hindu lore (purana). Historian Kamath calls this \"horizontal treatment\". The image of the deity of worship is missing in all three sanctums and the superstructure over all three shrines are lost. Some noteworthy pieces of sculpture worthy of mention are the dancing Bhairava (a form of Shiva), Govardhana (the god Krishna lifting a mountain), the god Vishnu as Varadaraja, and a huntress.\nGallery\nFile:A view of Kedareshwara Temple in Halebidu.jpg|Another view of Kedareshwara temple at Halebidu\nFile:Profile of Kedareshwara Temple in Halebidu2.jpg|Another profile view of the Kedareshawara temple at Halebidu\nFile:View of entrance into a sanctum in the Kedareshwara temple at Halebidu.JPG|Ornate doorjamb and lintel over entrance into a sanctum in the Kedareshwara temple at Halebidu\nFile:Profile of square mantapa and stellate shrine on Jagati in the mantapa of Kedareshwara temple at Halebidu.JPG|Profile of square mantapa and stellate shrine in the Kedareshwara temple at Halebidu\nFile:Ornate aedicula in the mantapa of the Kedareshwara temple at Halebidu.JPG|Ornate aedicula inside mantapa in the Kedareshwara temple at Halebidu\nFile:Molding frieze and outer wall decoration relief in Kedareshwara temple at Halebidu.JPG|Molding frieze and outer wall decoration in the Kedareshwara temple at Halebidu\nFile:Molding frieze and wall relief sculpture follow the stellate plan of the shrine in the Kedareshwara temple at Halebidu.JPG|Close up of stellate points showing moulding and wall relief sculpture of Hindu deities in the Kedareshwara temple at Halebidu\nFile:Lathe turned pillars support bay ceiling in the mantapa of Kedareshwara temple at Halebidu.JPG|Lathe turned pillars support bay ceiling in the Kedareshwara temple at Halebidu\nFile:Hindu deities and aedicules in relief in the Kedareshwara temple at Halebidu.JPG|Relief of Hindu deities below lower eve and miniature decorative towers above it (below upper eve) in the Kedareshwara temple at Halebidu\nFile:Hindu deity sculpture in the mantapa of Kedareshwara temple at Halebidu.JPG|Sculpture of a Hindu deity in the Kedareshwara temple at Halebidu\nFile:Decorative domical ceiling in mantapa of Kedareshwara temple at Halebidu.JPG|Bay ceiling in the Kedareshwara temple at Halebidu\nFile:Decorative ceiling in mantapa of the Kedareshwara temple at Halebidu 1.JPG|Bay ceiling in the Kedareshwara temple at Halebidu\nNotes\nReferences\n*Gerard Foekema, A Complete Guide to Hoysala Temples, Abhinav, 1996\n*\n*Adam Hardy, Indian Temple Architecture: Form and Transformation : the Karṇāṭa Drāviḍa Tradition, 7th to 13th Centuries, Abhinav, 1995 .\n*\n*"
    }
  ]
}