{
  "content": [
    {
      "type": "text",
      "text": "# Keith Thomas (historian)\n\n| image             =\n| image_size        =\n| smallimage        =\n| alt               =\n| caption           =\n| order             =\n| office            = President of Corpus Christi College, Oxford\n| term_start        = 1986\n| term_end          = 2000\n| predecessor       = Sir Kenneth Dover\n| successor         = Sir Tim Lankester\n| birth_name        = Keith Vivian Thomas\n| birth_date        =\n| birth_place       = Wick, Glamorgan, Wales\n| death_date        =\n| death_place       =\n| citizenship       =\n| nationality       = British\n| spouse            = Valerie Thomas\n| children          = 2\n| module            =  }}\nSir Keith Vivian Thomas  (born 2 January 1933) is a Welsh historian of the early modern world based at Oxford University. He is best known as the author of Religion and the Decline of Magic and Man and the Natural World. From 1986 to 2000, he was president of Corpus Christi College, Oxford.\nEarly life and education\nThomas was born on 2 January 1933 in Wick, Glamorgan, Wales. He was educated at Barry County Grammar School, a state grammar school in Barry, Vale of Glamorgan. Having been awarded the Brackenbury Scholarship, he studied modern history at Balliol College, Oxford. He graduated from the University of Oxford with a first class Bachelor of Arts (BA) degree in 1955; as per tradition, his BA was later promoted to a Master of Arts (MA Oxon).\nAcademic career\nHe was a prize Fellow of All Souls College, Oxford, from 1955 until 1957, when he was elected Fellow of St John's College. He was reader in modern history in the University of Oxford from 1978 to 1985, and professor of modern history in 1986, in which year he became president of Corpus Christi College. He retired in 2000, at the statutory age of 67, and the following year he was once more elected fellow of All Souls College. He served for some time as pro-vice-chancellor of the University and a delegate to the University Press. He was a consultant editor to the Oxford Dictionary of National Biography and an editor, with J. S. Weiner, of the Oxford Paperback University Series (OPUS) published by the Oxford University Press.\nHe was a member of the Economic and Social Research Council 1985–90, and of the Reviewing Committee on Exports of Works of Art 1990–93, and, since 1992, of the Royal Commission on Historical Manuscripts. From 1991 to 1998, he was a trustee of the National Gallery and since 1997 he has been chairman of the British Library Advisory Committee for Arts, Humanities, and Social Sciences.\nPersonal life\nHe is married to Valerie, Lady Thomas, a graduate of Somerville College, and has two children.\nHe is a supporter of Humanists UK, an organisation promoting secular humanism.\nIn May 2016, Thomas was one of 300 prominent historians, including Simon Schama and Niall Ferguson, who were signatories to a letter to The Guardian, telling voters that if they chose to leave the European Union on 23 June, they would be condemning Britain to irrelevance.\nHonours\nHe was elected a Fellow of the Royal Historical Society in 1970 (Vice-President 1980–84) and a Fellow of the British Academy in 1979 (President 1993–97). In 1983, he was elected a Foreign Honorary Member of the American Academy of Arts and Sciences and in 1993, he was elected to the Academia Europaea. He is also a Founding Fellow of the Learned Society of Wales.\nHe is an Honorary Fellow of Balliol (1984) and St John's (1986), and Corpus Christi Colleges, Oxford, and of Cardiff University (1995). He has been awarded honorary doctorates by University of Kent (DLitt 1983), University of Wales (DLitt 1987), Williams College (LLD 1988), University of Sheffield (LittD 1992), University of Cambridge (LittD 1995), University of Hull (DLitt 1995), University of Leicester (DLitt 1996), University of Sussex (DLitt 1996), Oglethorpe University (LLD 1996), and University of Warwick (DLitt 1998).\nIn the 1988 Queen's Birthday Honours, he was appointed a Knight Bachelor and in 1991, he was honoured with the Order of Merit of the Italian Republic.\nIn the 2020 New Year Honours, he was appointed Member of the Order of the Companions of Honour (CH) for services to the study of history.\nPortraits of Sir Keith Thomas hang at Corpus Christi College, Oxford, and the British Academy and National Portrait Gallery, London.\nPublications\nWorks authored\n*\"The Social Origins of Hobbes's Thought\", Hobbes Studies, ed. K.C. Brown (Oxford : Basil Blackwell, 1965), 185–236\n*'History and Anthropology', Past & Present 24 (1963), 3–24\n*Religion and the Decline of Magic: Studies in Popular Beliefs in Sixteenth- and Seventeenth-Century England (London: Weidenfeld and Nicolson, 1971; New York, Scribner 1971; Harmondsworth; London: Penguin, 1973; Harmondsworth: Penguin, 1978; London: Weidenfeld & Nicolson, 1997)\n*Rule and Misrule in the Schools of Early Modern England (Reading: University of Reading, 1976)\n*Age and Authority in Early Modern England (London: British Academy, 1976)\n*The Perception of the Past in Early Modern England: The Creighton Trust Lecture 1983, Delivered before the University of London on Monday 21 November 1983 (London: University of London, 1983)\n*Man and the Natural World: Changing Attitudes in England, 1500–1800 (London: Allen Lane, 1983; Harmondsworth: Penguin, 1984) (first American edition published as Man and the Natural World: A History of the Modern Sensibility (New York: Pantheon, 1983).\n*History and Literature: the Ernest Hughes Memorial Lecture Delivered at the College on 7 March 1988 (Swansea: University College of Swansea, 1988)\n*\"Ways of Doing Cultural History\", in Rik Sanders (ed.), Balans en perspectief van de Nederlandse cultuurgeschiedenis (Amsterdam: Rodopi, 1991)\n*Changing Conceptions of National Biography: The Oxford DNB in Historical Perspective (Cambridge: Cambridge University Press, 2005)\n*The Ends of Life: Roads to Fulfilment in Early Modern England (Oxford: Oxford University Press, 2009) ;\n* \"The Great Fight Over the Enlightenment,\" [http://www.nybooks.com/articles/archives/2014/apr/03/great-fight-over-enlightenment/ The New York Review 3 April 2014]\n* In Pursuit of Civility: Manners and Civilization in Early Modern England (London: Yale University Press, 2018)\nWorks edited\n*Great Political Thinkers (Oxford: Oxford University Press, 1992)\n*The Oxford Book of Work (Oxford: Oxford University Press, 1999)\nWorks jointly edited\n*(ed. with Donald Pennington) Puritans and Revolutionaries: Essays in Seventeenth-Century History Presented to Christopher Hill (Oxford: Clarendon Press, 1978)\n*(ed. with Andrew Adonis) Roy Jenkins: A Retrospective (Oxford: Oxford University Press, 2004)\nReferences\nFurther reading\n* Barry, Jonathan. \"Introduction: Keith Thomas and the problem of witchcraft\" in  Jonathan Barry et al. eds., Witchcraft in early modern Europe: Studies in Culture and Belief (1996)  pp.&nbsp;1–46.\nExternal links\n*[http://www.lrb.co.uk/v32/n11/keith-thomas/diary \"Diary – LRB\" ]\n*[http://www.alanmacfarlane.com/TEXTS/KeithThomas.pdf Alan Macfarlane, People who have influenced me most: Keith Thomas]\n* [https://www.sms.cam.ac.uk/media/1132829 Interviewed by Alan Macfarlane 5 September 2009 (video)]\n*[https://web.archive.org/web/20110927003508/http://www.britac.ac.uk/fellowship/directory/archive.asp?fellowsID=515 British Academy Fellowship]\n*''Debrett's People of Today'' (12th edn, London: Debrett's Peerage, 1999), p.&nbsp;1933"
    }
  ]
}