{
  "content": [
    {
      "type": "text",
      "text": "# Keith Hancock (historian)\n\n| image = K Hancock, pipe.tif\n| image_size =\n| caption =\n| birth_name = William Keith Hancock\n| birth_date =\n| birth_place = Fitzroy, Melbourne, Colony of Victoria\n| death_date =\n| death_place = Canberra, Australian Capital Territory, Australia\n| death_cause =\n| citizenship =\n| other_names = W. K. Hancock\n| occupation =\n| period =\n| known_for =\n| title =\n| boards =\n| spouse =\n*\n}}\n| children =\n| parents = William Hancock (father)\n| relatives =\n| awards =\n| education = Melbourne Grammar School\n| alma_mater =\n* Balliol College, Oxford\n* Trinity College, Melbourne\n}}\n| thesis_title =\n| thesis_url =\n| thesis_year =\n| school_tradition =\n| doctoral_advisor =\n| academic_advisors =\n| influences =\n| era =\n| discipline =\n| sub_discipline =\n| workplaces =\n| doctoral_students =\n| notable_students =\n| main_interests = Modern history (British history, Australian history), economic history, anglicanism\n| notable_works =\n| notable_ideas =\n| influenced =\n| signature =\n| signature_alt =\n| signature_size =\n| footnotes =\n}}\nSir William Keith Hancock (26 June 1898 – 13 August 1988), also known as W. K. Hancock, was a prominent Australian historian and academic. Hancock was an Anglican and keen admirer of the British Empire.\nEarly life and education\nHe was born on 26 June 1898, in Melbourne, Colony of Victoria, the son of Archdeacon William Hancock. At age nine, he won the Royal Humane Society's medal for rescuing another child from drowning in the Mitchell River. He was educated at Melbourne Grammar School and later the University of Melbourne where he was resident at Trinity College from 1917, winning the Perry Scholarship, Trinity's most prestigious award. Too young to see service in World War I without permission from his parents, it was said that he always felt shame about the fact he could not fight.\nAs the Australia-at-large Rhodes Scholar for 1921, Hancock went to Balliol College, Oxford in 1922. He graduated in 1924 with a Bachelor of Arts with first class honours in Modern History. He was the first Australian to gain a Fellowship of All Souls College, Oxford in 1923.\nAcademic career\nHe was Professor of Modern History at the University of Adelaide between 1924 and 1933. On his appointment he was aged only 25, the youngest professor in the British Commonwealth, and one who had held no previous teaching post. In 1930 he published Australia, a book which was well received and notable for its ironic tone, particularly in criticism of Australian institutions such as tariff protection, was highly influential, and is still frequently quoted today.\nFrom 1934 to 1944 Hancock was the Professor of History at University of Birmingham and during this war period was also appointed to the War Cabinet Offices. His Survey of British Commonwealth Affairs was published in three volumes in 1937–42. In 1941 he was appointed Supervisor of the United Kingdom Civil Series of the History of the Second World War and was thereafter editor of the series. In 1943, he published Argument of Empire, he defended the British Empire.\nIn 1949, with Margaret Gowing, he wrote The British War Economy, the introductory volume to that series. Between 1944 and 1949, he returned to Oxford, becoming Chichele Professor of Economic History. During the War he also played a role in Civil Defence, serving as a firewatcher. He was knighted in 1953, partially for his services in writing and editing the histories.\nIn 1949 he left Oxford, taking up an appointment as the Director of the Institute of Commonwealth Studies. He served as the Professor of British Commonwealth Affairs at the University of London until 1956. During this period he was sent as a government expert to examine constitutional questions in Uganda in 1954, at the height of the Kabaka crisis. At this time he began work on his authoritative biography of the South African Prime Minister Jan Smuts, which appeared in two volumes in 1962 and 1968, and editing for publication, with Jean van der Poel, the first four volumes of the Smuts papers.\nHancock returned to Australia in 1957 to take up an appointment as Director of the Research School of Social Sciences at the Australian National University, a position he held until 1961. He was Professor of History at the Institute of Advanced Studies, ANU until his retirement in 1965. On his retirement he was made Emeritus Professor (1968) and created the first University Fellow of the ANU. Other positions he held were Chairman of the Editorial Board of the Australian Dictionary of Biography from 1958 to 1965 and inaugural President of the Australian Academy of the Humanities from 1969 to 1971.\nIn 1961, Hancock was appointed to the Order of Merit of the Italian Republic. In his honour, a library of science resources at the ANU was named after him.\nHancock retired in 1965, having been appointed Knight Commander of the Order of the British Empire (KBE) in the 1965 New Year's Honours. In his later years, he moved south of Canberra, becoming a firm supporter of environmental politics. He disliked American bases on Australian soil, and he was a very prominent but ultimately unsuccessful opponent of the construction of Black Mountain Tower in Canberra. He died on 13 August 1988, aged 90, in Canberra.\nReferences\n* Low, DA (ed.) – Keith Hancock; the Legacies of a Historian, Melbourne University Press (2001)\n* Davidson, Jim. A Three-cornered Life: The Historian W.K.Hancock, University of New South Wales Press, 2010,\n* Donald Markwell, \"Instincts to lead\": on leadership, peace, and education (2013)\n* Oxford Dictionary of National Biography\n* Proceedings of the Australian Academy of the Humanities"
    }
  ]
}