{
  "content": [
    {
      "type": "text",
      "text": "# Keitai–Kinmei Civil War\n\n}}\nThe  is a hypothetical civil war in Japanese history. It is based on the assumption that the death of Emperor Keitai in the first half of the 6th century resulted in a struggle over the succession to the throne, but remains speculative as there are unnatural points in the documents recording the history of the time. The assumed year of the outbreak is sometimes specifically set as 531 CE, the year of Emperor Keitai's death according to the Chronicles of Japan. It is therefore also known as the Shingai no Hen (辛亥の変), from the sexagenary cycle year (Metal Pig).\nOutline\nAccording to the Nihon Shoki, the year of Emperor Keitai's death  was the year of the Metal Pig (531), based on the theory of the |百済本記}}. Another theory places the death in the year of the Tiger (534). This is considered to be the year of the accession of the next emperor, Ankan, which is usually interpreted as a two-year vacancy after the death of Emperor Keitai.\nHowever, several questions emerge here.\n* The article on the year of the Metal Pig in the Kudara Honki states, \"The Japanese emperor, his son, and his son-in-law all collapsed.\n* In the Jōgū Shōtoku Hōō Teisetsu and the Genkōji Garan Engi, the year of Emperor Kinmei's accession is set to the year 531, as if he had been the next emperor after Emperor Keitai.\n* In the Kojiki, Emperor Keitai is said to have died in the year 527.\nThe interpretation of these discrepancies has been the subject of debate since the theory gained attention in the Meiji period.\nThe first theory to emerge was that Emperor Keitai died in 527 and Emperor Kinmei ascended to the throne in 531, with the reigns of Emperor Ankan and Emperor Senka assumed in the intervening four years. This theory is inconsistent with the fact that both the Kojiki and Nihon Shoki record the death of Emperor Ankan in the year 535.\nIn the Shōwa era, Kida Sadakichi proposed a hypothesis that a serious political crisis occurred in the year 531, and as a result, after the death of Emperor Keitai, the imperial house split into two lines. These would be the Ankan-Senka line, whose mother was Menokohime from a local powerful family, and Emperor Kinmei, whose mother was Princess Tashiraka, the daughter of Emperor Ninken. This idea was taken one step further by Hayashiya Tatsusaburo after World War II, who proposed that confusion over conflicts over the Korean Peninsula situation (such as the Iwai Rebellion) occurred at the end of the reign of Emperor Keitai, and that after his death, \"two parallel dynasties\" and the resulting nationwide civil war occurred. In order to conceal this fact, the Nihon Shoki is said to have been written as if half-brothers had ascended to the throne in the order of their ages.\nHowever, the Kudara Honki is not extant, and it is difficult to verify its statements. Furthermore, since the Kudara Honki is a history of Baekje, some have questioned the reliability of the articles related to Waekoku (Japan). Even if it is true that an emperor died in the year 531, it is not clear to whom this refers. Therefore, there could have been no \"juxtaposition of two dynasties\" or civil war, and some scholars believe that the succession to the imperial throne during this period should be based on the account in the Nihon Shoki that states that, after the demise of the successor to the throne, his successors (Ankan and Senka) died within a short period (several years), resulting in the succession from Keitai to Ankan, then to Senka, then to Kinmei. Furthermore, even among scholars who support the \"two dynasties in parallel,\" Hayashiya's theory is not always fully supported. For example, Hayashiya interprets that behind Emperor Kinmei was the Soga clan, which was married to the emperor, and behind Emperors Ankan and Senka was the Ōtomo clan, which declined during this period. However, there are also theories that see the background as opposing, such as the conflict between the local powerful tribes that supported Emperor Keitai and his successor and the Yamato powerful tribes that sought to regain power by supporting Emperor Kinmei, who was descended from the previous imperial lineage. The other theory is that it was a conflict between two powerful tribes with the surnames  and .\nThe period from Emperor Keitai's reign to Emperor Kinmei's is said to have been marked by a series of significant events that would later shape the history of Japan, including the official transmission of Buddhism, the establishment of tun storehouses, the compilation of the Teiki and Kyūji, the introduction of Japanese epithets, and the . It is believed that the existence or non-existence of \"two parallel dynasties\" and the occurrence of civil wars had no small influence on the interpretation of these events.\nNotes\nBibliography\n* 直木孝次郎「継体・欽明朝の内乱」『国史大辞典 5』（吉川弘文館 1985年） ISBN 978-4-642-00505-0\n* 川口勝康「継体・欽明朝の内乱」『日本史大事典 2』（平凡社 1993年） ISBN 978-4-582-13102-4\n* 大平聡「継体・欽明朝の内乱」『日本歴史大事典 1』（小学館 2000年） ISBN 978-4-09-523001-6"
    }
  ]
}