{
  "content": [
    {
      "type": "text",
      "text": "# Kelly Hecking\n\n| birth_place    =\n| death_date     =\n| death_place    =\n| height         =\n| weight         =\n| spouse         =\n| website        =\n| strokes        = Backstroke, freestyle\n| classification =\n| club           =\n| collegeteam    = University of Notre Dame\n| coach          = Bailey Weathers\n| module         =\n| show-medals    =\n| medaltemplates =\n| module2        =\n}}\nKelly Hecking (born March 1980) is an American former backstroke and freestyle competition swimmer. She is the most successful Notre Dame Fighting Irish athlete in any sport at the Big East Conference Championships with 19 event conference championships (seven individual and twelve relay) and four team conference championships. Hecking set the Big East record for most career swimming conference championships. She was the only Notre Dame swimmer to win an individual event four times (1999&ndash;2002) at the Big East Championship. Hecking was an eight-time NCAA All-American honorable mention (twice in the 200-yard backstroke as well as various relays). She was a two-time high school All-American and two-time New Jersey State Interscholastic Athletic Association (NJSIAA) 100-yard backstroke champion (1997 and 1998). She is also a 3-time YMCA Nationals backstroke champion (all in 1996) and 9-time YMCA Nationals backstroke medalist.\nEarly life\nHecking's mother is named Diana. Hecking grew up with a pool in her backyard, and her mother signed her up for swim lessons as a precaution. Hecking was a standout swimmer by the age of six. At age 10, she joined the Montclair, NJ YMCA swim team and remained a member through high school. In high school, she also ran track and cross country.\nIn her 1994-95 Freshman season Hecking won the Northern New Jersey Interscholastic Swim League (NNJISL) 200 IM and 100 backstroke. Then at the NJSIAA championship, she finished 2nd to Tashy Bohm in the 100 backstroke by over a second 58.34 vs. 59.36. As a sophomore in 1996, Hecking won the NNJISL 100 freestyle and 100 backstroke and finished second in both at the NJSIAA championships (to Kate Slonaker and Bohm, respectively).\nAs a junior in 1997, she first made her mark in late January when she posted a 1:03.10 three weeks after in-state rival Jennelle Ritchie posted a national record 1:04.86 100 meter backstroke time, but her time was deemed unofficial because it was hand timed. This national public school short course record would later be surpassed by New Jersians Bohm and Lauren English in times slower than Hecking's disputed time. Prior to Ritchie, New Jersian Lisa Iori had held the record since 1980.\nHecking won the 100- and 200-yard freestyle events at the 1997 NNJISL. In the 1997 NJSIAA meet she eclipsed 3-time defending champion Bohm's 56.99 state record with a 55.94 in the prelims and then beat her with a 55.64 in the finals.  Hecking also finished second in the March 1998 NJSIAA Meet of Champions (to Slonaker) in the 50-yard freestyle, and she won the 200 freestyle and 100 butterfly in the 1998 NNJISL league championship meet. Hecking won in the NJSIAA 100 backstroke again as a senior in 1998 without bettering her record time.\nDuring her high school career, she went undefeated in the 100 backstroke for Rutherford High School in NNJISL dual meet or league championship competition. Her 1997 state record time of 55.64 stood until English posted a 55.57 in 2005. She was a two-time high school All-American and two-time New Jersey state champion who chose University of Notre Dame over University of Arizona, Ohio State University and Penn State University because Notre Dame needed a backstroker. She accepted her nearly full scholarship from Notre Dame in March 1998 for the following fall. Hecking also set a NNJISL record in the 200-yard individual medley that was broken in 2000 by Erin Vanderberg.\nBeyond scholastic competition, Hecking swept the 50-, 100- and 200-meter backstrokes at the 1996 National YMCA Long Course Swimming & Diving Championships in Buffalo, New York, but at the YMCA Short Course Nationals she placed without winning in the backstroke events: 1996 2nd 100 & 200, 1997 3rd 100 & 200, and 1998 2nd 100 & 200. Hecking had placed 4th, 12th and 11th, respectively, in the 50-, 100- and 200-meter backstrokes in the 1995 National YMCA Long course championship. Hecking had placed 14th and 19th at the 1995 short course YMCA Nationals. Hecking did not return to the YMCA Long Course Championship in 1997 in backstroke events, and Montclair was represented by Lisa Dolansky in the backstroke events in 1998.\nAs a junior, she was a 1997 All-American selection by the National Interscholastic Swimming Coaches Association (NISCA) in the 100 backstroke. As a senior, she repeated this NISCA All-American recognition with the fastest public high school time in the nation.\nCollege career\nAs a sophomore she went undefeated in the 100 and 200 backstroke in dual meets and swept them at the 2000 Big East championships. Hecking sometimes competed in individual freestyle events.\nShe became the eighth woman in the history of the Big East conference swimming and diving championship to win the same event four years in a row in 2002.  Hecking was the only Notre Dame swimmer to win an individual event four times at the Big East Championship (3-meter diver Jenny Chiang '13 also achieved the feat). She is the most successful Notre Dame Fighting Irish athlete in any sport at the Big East Championships (Notre Dame swimming & diving competed in the original Big East Conference from 1996&ndash;2013 before leaving for the Atlantic Coast Conference). She earned 19 Big East Championships during her career (1999&ndash;2002): seven individual championships (4x-100 backstroke and 3x-200 backstroke) as well as a dozen relay championships (3x-200 free, 1x-400 free, 4x-200 medley, 4x-400 medley) as a member of 4 Big East Championship teams. She became the winningest swimmer in Big East Conference history after accumulating 14 career Big East Championships during her junior year. Hecking's 2001 100-yard backstroke time of 54.98 established a Big East Championships record.\nBohm's second 200-yard backstroke NCAA All-American honorable mention overlapped with Hecking's first, as Bohm finished 12th and Hecking 13th at the 2001 NCAA Championships. Hecking posted her career best time of 1:57.45 in the 200-yard backstroke at the 2002 National Collegiate Championships earning her a 12th-place finish and her second individual All-American honorable mention. It stood as a Notre Dame 200-yard record until 2010 it was surpassed by Kim Holden in the 2010 Big East Championships. She also held the 100-yard Notre Dame record from 2001 until 2003  when Danielle Hulick surpassed it in the 2003 Big East Championships also breaking Hecking's Big East Championship record in the process. She qualified for the National Collegiate Athletic Association championships in both the 100- and 200-yard backstroke as well as several relays all four years of eligibility and was an 8-time NCAA All-American honorable mention: twice as an individual (200 backstroke&mdash;2001 & 2002) and six times as a relay participant (1x-400 free, 2x-200 medley, 3x-400 medley). She was named a Big East Academic All-star in both 2001 and 2002.\nNotes"
    }
  ]
}