{
  "content": [
    {
      "type": "text",
      "text": "# Ken Battle\n\n| image              = Ken Battle Portrait.jpeg\n| birth_date         =\n| birth_place        = Calgary, Alberta, Canada\n| death_date         =\n| death_place        = Ottawa, Ontario, Canada\n| alma_mater         = Queen's University at Kingston, University of Oxford\n| known_for          = Work on Canadian welfare programs, social security reform and poverty alleviation; development of the  Canadian Child Benefit Program\n}}\nKen Robert Battle,  (July 29, 1947 – November 18, 2024) was a Canadian social policy analyst known for his work on Canadian welfare programs, social security reform and poverty alleviation. He was noted for his contributions to the development of the Canadian Child Benefit Program in the 1990s. He was the founder of the Caledon Institute of Social Policy, an independent Canadian policy think tank focused on social welfare policies.\nBattle was made a member of the Order of Canada in 2000, for his work on Canadian welfare legislation and development of the Canadian National Child Benefit Program. He also received the Saskatchewan Distinguished Service Award in 2004.\nEarly life\nBattle was born on July 29, 1947, in Calgary, Alberta, to Lois (née Morrison) and Robert Battle, the eldest of three children. His family later relocated to Edmonton and later to Ottawa, where his father worked as a senior federal bureaucrat. He obtained a Bachelor of Arts degree from Queen's University in Kingston, Ontario. During his time there, he was a recipient of the Prince of Wales medal. He obtained a master's degree in philosophy studying at the University of Oxford on a Commonwealth Scholarship.\nCareer\nBattle began his career in public policy with the National Council of Welfare, a federal advisory body under the ministry of National Health and Welfare, going on to become a director at the council. In 1986, he led the creation of Canada's first national report on welfare, shedding light on the inadequacies of welfare programs and challenging government secrecy around social assistance programs.\nIn 1992, Battle co-founded the Caledon Institute of Social Policy, an independent organization focused on poverty and public policy, and served as the institute's president. The Institute was one of the voices on Canadian social policy reform, addressing income security, disability supports, child care, taxation, and community development.\nBattle was instrumental in the design and implementation of the Canadian Child Benefit Program in the 1990s. The genesis of the program can be traced back to his report, National Child Benefit: An Idea Whose Time has Come, which found its way to then finance minister Paul Martin's reading list on a Sunday afternoon. Martin, who would later become the prime minister of the country, called Battle on his home telephone later that day with the conversation between the two setting the stage for the Canada Child Benefit. The initiative was introduced by the government in 1998 with less than a quarter of the funding proposed by Battle. Battle accepted the proposal and kept working incrementally for additional changes. Subsequent governments continued to build on the child benefit initiative and at the time of Battle's death in 2024, the program paid up to $7,787 for children under the age of 6 and $6,570 through age 17, for eligible families. The program has been acknowledged to have helped drive Canada's poverty rate down through the years.\nBattle was also an advisor to the federal government on social security reform in the same period, serving as a member of the ministerial task force. His policy contributions extended to areas like re-indexing the income tax system and benefits for Canadians with disabilities. He was also a policy advisor for the ministry of Human Resources Development on child benefits reform between 1996 and 1997.\nBattle was made a Member of the Order of Canada in 2000, for his work on Canadian welfare legislation and development of the Canadian National Child Benefit Program. He received Saskatchewan's Distinguished Service Award in 2004.\nAs an author, Battle wrote extensively on Canadian social welfare-related topics including income equality, poverty, and taxation. Some of his other influential works included Social Policy by Stealth (1990) and Thinking the Unthinkable: A Targeted, not Universal, Old Age Pension (1993). The former was a critique of the social and tax policies under the government of the then prime minister, Brian Mulroney, written under the pseudonym Grattan Gray.\nPersonal life and death\nBattle was married three times: to Ruth Jamieson, Laurie McIntyre, and Melanie Hess. He died in Ottawa on November 18, 2024, at the age of 77, five years after being diagnosed with Lewy body dementia.\nSelect published works\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nReferences"
    }
  ]
}