{
  "content": [
    {
      "type": "text",
      "text": "# Kendriya Vidyalaya, Malleswaram\n\n| affiliation = Central Board of Secondary Education\n| grades = 10+2 (Science, Commerce)\n| principal = Mr. Anil Kumar\n| campus size =\n| country = India\n| coordinates =\n| website =\n}}\nKendriya Vidyalaya Malleswaram is a school in Bangalore, India. It is one of the schools under the group known as the Kendriya Vidyalayas, a system of central government schools under the Ministry of Human Resource Development (India). Kendriya Vidyalaya Malleshwaram is one of fourteen Kendriya Vidyalayas in Bangalore.\nBackground\nIn 1966, the school was established at the temporary accommodation at CET cell. In 1972, the first batch of class X appeared for the board exams. In 1980, the first batch of class XII appeared for the board exams. In 2010, the commerce stream in class XI was started.\nCommitted to quality education, KV Malleswaram has about 1800 students and 60 staff. The Vidyalaya has three sections from class I to XII, offering physics, chemistry, biology/computer science, and maths/Hindi/Sanskrit in one section (science stream) and in another section (commerce stream) offering accountancy, business studies, economics as subjects in senior secondary section.\nThe Vidyalaya works in two shifts. The first shift goes from 7:00am–12:25pm with 3 sections per class and the 2nd shift from 12:30pm–6:00pm with 2 sections per class.\nKV Malleswaram is one of the few chosen Kendriya Vidyalayas to have upgraded to \"e-Classroom\" and e-Learning teaching processes with the implementation of Smart Boards in the classroom. The Vidyalaya has set up \"Atal Tinkering Laboratory\" under the \"Atal Innovation Mission\" by the NITI ayog government of India. The objective of this scheme is to foster curiosity, creativity and imagination in young minds; and inculcate skills such as design mindset, computational thinking, adaptive learning, physical computing etc.\nThe Vidyalaya encourages students to take part in various competitions which are conducted at school as well as on regional and national levels.\nFor CCA activities and house contests, the students are placed into four houses: KALIDAS (Green), VYAS (Yellow), MATANG (Red), BANABHAT (Blue). The houses are named after famous (in Sanskrit literature) Indian poets and authors.\nSee also\n*List of Kendriya Vidyalayas\nReferences"
    }
  ]
}