{
  "content": [
    {
      "type": "text",
      "text": "# Kenny Edwards (rugby league)\n\n|birth_place    = Levin, Manawatu-Wanganui, New Zealand\n|height         =\n|weight         =\n|position       =\n|club1          = Parramatta Eels\n|year1start     = 2013\n|year1end       = 18\n|appearances1   = 70\n|tries1         = 6\n|goals1         = 0\n|fieldgoals1    = 0\n|points1        = 24\n|club2          = Catalans Dragons\n|year2start     = 2018\n|year2end       = 19\n|appearances2   = 37\n|tries2         = 10\n|goals2         = 0\n|fieldgoals2    = 0\n|points2        = 40\n|club3          = Huddersfield Giants\n|year3start     = 2020\n|year3end       = 22\n|appearances3   = 29\n|tries3         = 3\n|goals3         = 0\n|fieldgoals3    = 0\n|points3        = 176\n| club4         =\n| year4start    = 2022\n| year4end      =\n| appearances4  = 25\n| tries4        = 3\n| goals4        = 0\n| fieldgoals4   = 0\n| points4       = 12\n| club5         = Castleford Tigers\n| year5start    = 2023\n| year5end      =\n| appearances5  = 25\n| tries5        = 2\n| goals5        = 0\n| fieldgoals5   = 0\n| points5       = 8\n| teamA        =\n| yearAstart   = 2021\n| yearAend     = present\n| appearancesA = 2\n| triesA       = 0\n| goalsA       = 0\n| fieldgoalsA  = 0\n| pointsA      = 0\n|retired        =\n|source         =\n| updated      = 2 November 2023\n| module =\n}}\nKenny Edwards (born 13 September 1989) is a New Zealand former professional rugby league footballer who played as a .\nHe previously played for the Parramatta Eels in the NRL, and the Catalans Dragons and the Huddersfield Giants in the Super League. Edwards has also spent time on loan at Huddersfield at Castleford.\nEarly life\nEdwards was born in Levin, New Zealand, and is of Māori and Cook Island descent.\nHe played his junior football for the Levin Knights and the Pukekohe Pythons, before being signed by the Manly Warringah Sea Eagles.\nAs a youngster, Edwards played for the Junior Kiwis.\nIn 2007, Edwards played for the Australian Schoolboys.\nClub career\nIn 2008, Edwards played for Manly Warringah Sea Eagles' NYC team, however his contract was terminated at the start of 2009 due to disciplinary reasons.\nHe instead joined the St. George Illawarra Dragons for the 2009 season, again playing in the NYC competition. Later on, he had his contract terminated once again for disciplinary reasons which forced him to sit out the 2011 season.\nIn 2012 Edwards joined the Southport Tigers in the Gold Coast Rugby League competition. After acting as a trainer in one of the Tigers' under-17s matches, Edwards was accused of repeatedly inciting his team to fight their opponents. He was subsequently banned for the rest of the season, but had the charges downgraded on appeal and was allowed to play for Southport in the final series.\nParramatta Eels\nEdwards joined the Parramatta Eels on a one-year contract for the 2013 season. On 25 July 2013, the contract was extended for another two seasons. He then made his NRL debut for the Eels during round 26 of the 2013 NRL season.\nOn 22 September 2013, Edwards was named at second-row in the 2013 New South Wales Cup team of the year.\nIn October 2014, Edwards was named in the New Zealand Māori squad to play the Queensland Murri team.\nOn 5 June 2014, Edwards again extended his contract with the Eels, signing until the end of 2017.\nDuring the 2015 NRL season, Edwards was handed a 9 month playing ban and missed the entire season for taking a urine sample on behalf of fellow Parramatta player Kaysa Pritchard.\nIn 2017, Edwards missed the first 7 rounds of the season after pleading guilty to a domestic violence charge, having poured alcohol over the head of his partner during an argument. In his second game back, Edwards was the first player to be sinbinned after the NRL changed the rules to outlaw players slapping opposition players. Edwards was shown throwing a chair across the change rooms after the incident. Kenny Edwards played his 50th NRL match against the St George Illawarra Dragons in round 15 of the 2017 NRL season.\nOn 28 July 2017, during Parramatta's victory over Brisbane, Edwards delivered a late tackle on Brisbane player Jonus Pearson, who was lying on the ground following a high tackle by Parramatta player Nathan Brown. Edwards was later cited over the incident and faced a $1500 fine if he entered an early guilty plea.\nOn 15 May 2018, Edwards was stood down indefinitely by Parramatta after he allegedly fled from police following a random roadside check in Merrylands, Sydney. Edwards did not face Fairfield Local Court but attended a traffic offenders course, having been accused of abandoning a vehicle he was driving on a suspended licence.  Edwards only raised the matter with the club on  7 May 2018, which was three weeks after allegedly running away from police after being approached by officers.\nOn 19 May 2018, Edwards was released by Parramatta.  In his time at the club, Edwards missed over 35 games for Parramatta due to incidents off the field.\nCatalans Dragons\nOn 25 May 2018, Edwards signed a one-and-a-half-year deal to join Super League side Catalans Dragons.\nIn August 2018, Edwards was part of the Catalans Dragons side which won their first ever trophy, claiming victory in the 2018 Challenge Cup Final victory over the Warrington Wolves at Wembley Stadium.\nOn 29 October 2018, Edwards was suspended from driving for 6 months and fined $600 for the incident which occurred back in May 2018.\nIn the Super League XXIV season during a match between Catalans and Warrington, Edwards was involved in an ugly on-field brawl with opposition players.  The game was ultimately called off.  The fighting on the field also spilled off the field with rivals fans clashing in the stands.  Edwards was later charged by the Rugby Football League with crowd incitement but was then cleared of any wrongdoing.\nHuddersfield Giants\nIn November 2019, it was announced that Edwards had signed a contract to join Huddersfield.\nOn 7 July 2021, Edwards was suspended for ten matches after pleading guilty to a charge of Other Contrary Behaviour.  Edwards was initially placed on report during Huddersfield's game against Catalans Dragons after appearing to stick his finger in Sam Kasiano's buttocks. Edwards was also fined £500.\nCastleford Tigers (loan)\nOn 19 September 2021, it was reported that Edwards had signed for the Castleford Tigers in the Super League on a season-long loan. He made his Tigers debut on 11 February against the Salford Red Devils. He was voted the Fans' Man of the Match for his performance against the Leeds Rhinos in the Challenge Cup, and scored his first try for the club on 14 April against Wakefield Trinity.\nOn 24 June 2022, Edwards signed a three-year deal with Castleford to remain at the club until the end of 2025.\nEdwards played 25 games for Castleford in the Super League XXVIII season as the club finished 11th on the table narrowly avoiding relegation.\nMackay Cutters\nOn 2 November 2023 it was reported that Edwards signed for the Mackay Cutters on a two-year deal.\nOn 17 April 2024 he announced his retirement from playing to continue with his rugby league academy\nRepresentative\nOn 25 June 2021 he played for the Combined Nations All Stars in their 26-24 victory over England, staged at the Halliwell Jones Stadium, Warrington, as part of England’s 2021 Rugby League World Cup preparation.\nStatistics\n{| class=\"wikitable\"\n|+\n!Year\n!Team\n!Games\n!Tries\n!Pts\n|-\n|2013\n| rowspan=\"4\" | Parramatta Eels\n|1\n|\n|\n|-\n|2014\n|18\n|1\n|4\n|-\n|2016\n|24\n|4\n|16\n|-\n|2017\n|19\n|\n|\n|-\n| rowspan=\"2\" |2018\n| Parramatta Eels\n|8\n|1\n|4\n|-\n| Catalans Dragons\n|16\n|8\n|32\n|-\n|2019\n| Catalans Dragons\n|21\n|2\n|8\n|-\n|2020\n| rowspan=\"2\" | Huddersfield Giants\n|17\n|\n|\n|-\n|2021\n|12\n|3\n|12\n|-\n|2022\n| rowspan=\"2\" | Castleford Tigers\n|25\n|3\n|12\n|-\n|2023\n|25\n|2\n|8\n|-\n|\n|Totals\n|187\n|24\n|96\n|}\nsource:\nPersonal life\nEdwards is the cousin of Wests Tigers player James Tamou. He has two children, a daughter named Malia-Rose Edwards and a son named Kymani Edwards.\nReferences\nExternal links\n*[http://www.catalansdragons.com/en/fiche-505-edwards-kenny/ Catalans Dragons profile]\n*[https://www.superleague.co.uk/player/411/kenny%3Cbr-%3Eedwards SL profile]\n*[https://www.parraeels.com.au/teams/telstra-premiership/parramatta-eels/kenny-edwards/ Parramatta Eels profile]\n*[http://www.parraeels.com.au/team/profiles/ken-edwards.html Eels profile]"
    }
  ]
}