{
  "content": [
    {
      "type": "text",
      "text": "# Kensington Treaty__disambig_1\n\nFriedrich Merz| Keir Starmer|Foreign ministers:| Johann Wadephul| David Lammy}}\n| parties =\n| languages =\n}}The Kensington Treaty, officially the Treaty between the United Kingdom of Great Britain and Northern Ireland and the Federal Republic of Germany on Friendship and Bilateral Cooperation, is an agreement signed between the governments of the United Kingdom and Germany. The agreement was officially signed by Prime Minister Keir Starmer and Chancellor Friedrich Merz in London on 17 July 2025.\nThe agreement includes cooperation on defence initiatives, the countries' response to the Russo-Ukrainian War, the use of technology in warfare and domestically. It also focuses on ease of travel between the two countries, with measures including British passport holders being able to use German e-gates, school exchange trips not requiring visas to visit Germany, and a direct rail service between the two countries within ten years.\nThe agreement was the first of its kind between the two countries since the end of the Second World War. Media reaction to the treaty noted its significance, especially as part of the prominence of the E3 alliance (the UK, France, and Germany) in the current global situation. Merz told reporters that his visit to the UK coming straight after one by French President Emmanuel Macron was purposeful, and that the deal was part of the three countries' political positions becoming better aligned.\nHistory\n(left) and Johann Wadephul (right) meet in London on the day of the signing]]\nOn 23 October 2024, the British and German defence ministers, John Healey and Boris Pistorius respectively, signed the Trinity House Agreement in London in order to strengthen the countries' shared defence interests as part of an \"endeavour to enhance the interoperability, interchangeability, and integration of their armed forces\".\nThe Kensington Treaty builds on the agreements of the Trinity House Agreements in regards to the two countries' involvement in the Russo-Ukrainian War. British–German defence collaboration was also expanded upon in May 2025 with the two countries agreeing to develop precision weaponry together.\nOn 17 July 2025, the German Chancellor Friedrich Merz met British Prime Minister Sir Keir Starmer in London to host talks on security. It marked the Chancellor's first official visit to the United Kingdom during his premiership. However, a large amount of the treaty was actually negotiated by the previous German administration of Olaf Scholz.\nThe deal itself was signed at the Victoria and Albert Museum in Kensington, its location being the namesake of the treaty; the location was chosen to reflect the historic link between the two countries (Queen Victoria was British and Prince Albert was German).\nThe deal was also signed by foreign secretaries David Lammy and Johann Wadephul. After the deal was signed, Starmer and Merz travelled to 10 Downing Street for further talks, which took place over a shared lunch. It was there that Merz announced that German defence company STARK would open a factory in Swindon, Wiltshire.\nContent\nThe deal included the creation of a 'working group' to look at the feasibility of a direct rail service between the United Kingdom and Germany, with an aim for services to begin within ten years. According to The Telegraph, likely routes are between London St Pancras and Berlin, Cologne, or Frankfurt. Heidi Alexander, the UK Transport Secretary, cited destinations such as the Berlin Wall, Brandenburg Gate, and Checkpoint Charlie as destinations that Britons would be able to visit \"from the comfort of a train\".\nAs part of the deal, UK passport holders will be allowed to use e-gates in Germany, with the policy coming into effect \"as soon as technically possible\"; this has not been the case since Brexit. Frequent travellers will be the first to be able to use the gates in August 2025, with other travellers able to from October. The policy comes after it was agreed at a UK–EU summit in May 2025 that there was no legal reason preventing UK citizens from doing so.\nThe deal included an agreement that Germany would make it illegal to smuggle migrants into the United Kingdom, which was originally agreed with Merz's predessor Olaf Scholz. It is illegal under EU law to smuggle people between countries within the EU, which has no longer applied to the UK since Brexit. The law, which will be passed by the end of 2025, would allow the German police to crack down on the supply of small boats to gangs for them to cross the English Channel.\nAs part of a wider effort to counter \"mobility issues\" between the two countries, the deal also featured an agreement on school exchange visits, wherein students will not need to have a visa in order to take part in a school trip to either country. The new policy, which will come in to effect by the end of 2025, was cited increasing \"opportunities for linguistic, cultural and academic experiences\".\nPriority projects\nAs part of article 22 of the deal, the countries agreed on seventeen projects that were priorities for cooperation on, to be reviewed by a Joint Cabinet every two years. These priorities were:\n* The recovery and reconstruction of Ukraine following the Russo-Ukrainian War.\n* A bilateral defence partnership based on the Trinity House Agreement.\n* Increasing the countries' cooperation on their defence industries and exports.\n* Sharing a plan to tackle illegal immigration.\n* Beginning a Strategic Science and Technology Partnership between the countries.\n* A project to develop infrastructure in the North Sea\n* The creation of a new rail link between Germany and the UK.\n* Allowing UK passport holders to use German E-gates\n* Increasing citizens' mobility, including allowing school groups to visit without visas.\n* The creation of a Business–Government Forum between the two countries.\n* Collaborating in efforts for world peace and stability.\n* Collaborating on efforts for stability in the Balkans.\n* Cooperating in efforts to increase security and stability of the Indo–Pacific.\n* Increasing security from biological threats.\n* Collaborating on developing the countries' economies sustainably.\n* Cooperating on issues in relation to education, culture and sport.\n* Collaboration between the countries' financial institutions.\nReactions\nStarmer described the treaty as \"historic document which really measures just how close our countries are and our ambition for the future\", while Merz expressed his surprise that it was the first since the end of World War II, as well as calling the treaty a \"historic day for German-British relations\". He also described the signing of such a treaty as \"overdue\". Starmer's official spokesperson described action on smuggling gangs as a \"significant step\", and described it as an \"international issue that requires international solutions\".\nVarious news sources suggested that the deal, especially when combined with French President Emmanuel Macron's state visit to the UK on 8–10 July, cemented the return of the E3 alliance of the UK, France, and Germany. The move was seen as part of an increase in diplomatic ties between the three countries as the security of Europe decreases and the reliability of the US as an ally has become unclear. Merz said that the proximity of his visit to Macron's was \"no coincidence\" and that the countries were \"converging\" on their political positions.\nThe next day, Merz had an interview with the BBC in which he said that Germany is \"not strong enough, [its] army is not strong enough, so that's the reason why [the German government] are spending a lot of money\" and suggested that Europe had been \"free-riders\" on the defence guarantee of the United States. In respect to implementing the agreements set out in the treaty, he claimed that his government would \"do our homework immediately\".\nIn the United Kingdom\nHeidi Alexander, the UK's Secretary of State for Transport, described the creation of a direct UK–Germany service as fostering \"a new era of European rail connectivity\". David Lammy, the UK's Foreign Secretary and a signatory of the deal, posted on X that it was \"historic\" and helping to \"shape Europe's future\". In a post to his X account, Andrew Mitchell, the UK ambassador to Germany, said that the treaty \"opens a new chapter\"; he also appeared in a video alongside the German ambassador to the UK (see below).\nBBC News said that Merz is \"comfortable\" dealing with foreign policy and had been successful in establishing good relations with Donald Trump; however, they noticed his domestic policy was comparably weaker and that tensions within his coalition could lead to questions around the extent of his political authority.\nIn Germany\nIn a video posted on his X account, Miguel Berger, the German ambassador to the UK, said that the deal was \"ground-breaking\" and put the two countries on a \"joint footing\". Andrew Mitchell, the UK ambassador to Germany, said in the same video that the two have a \"sense of optimism about the future\" and called the treaty \"extraordinary\" and \"ground-breaking\".\nDeutsche Welle pointed to opinion polls that a majority of Britons were in support of rejoining the European Union to suggest that closer UK–Germany relations would have broad support from the British public. However, they also noted that the UK re-joining the EU was not under consideration. They also said that the deal was \"highly significant\" and the closest the two countries could get without both being members of the EU.\nSee also\n* EU–UK Trade and Cooperation Agreement\n* Foreign relations of Germany\n* Foreign relations of the United Kingdom\n* Germany–United Kingdom relations\n* Lancaster House Treaties\n* List of treaties\n* Trinity House Agreement\n* United Kingdom–European Union relations\nReferences\nExternal links\n* The [https://www.gov.uk/government/news/treaty-between-the-united-kingdom-of-great-britain-and-northern-ireland-and-the-federal-republic-of-germany-on-friendship-and-bilateral-cooperation full text of the treaty] at gov.uk"
    }
  ]
}