{
  "content": [
    {
      "type": "text",
      "text": "# Kestel (archaeological site)\n\nKestel}}\nKestel is an archaeological site in the Taurus Mountains in Turkey, with important finds related to the study of Tin sources and trade in ancient times.\nArchaeology\nKestel is a probable site of Bronze Age tin mining in the Bolkar range of the Taurus Mountains in Anatolia (near the present village of Celaller, Çamardı District, Niğde Province, Turkey). Tin in the Bronze Age was as scarce and valuable as petroleum is today. It was a vital ingredient of bronze, used with copper to make the alloy.\nK. Aslihan Yener spent years in archaeometallurgy surveys together with the Turkish Geological Survey (MTA) and found cassiterite (tin ore) crystals in a stream in the Taurus foothills. This ore is purple; previous searches had been looking for black ore because most tin ores are black. Near the site was a deserted valley with a hill called Kestel that proved to hold a tin mine. Additionally, fragments of Bronze Age pottery were found in and near the mine. Inside, there were veins of bright purple tin ore.\nThe Kestel mine has two miles (3 km) of tunnels, many of which are only about two feet wide, just large enough to allow children to do the mining work. In one abandoned shaft, a burial of twelve to fifteen children was found, presumably killed while working in the mine.\nIn 1989, on top of a large natural hill called Göltepe located 2 km opposite the Kestel mine (), associates found piles of Bronze Age pottery, close to 50,000 ground stone tools and evidence that this site had been continuously occupied from 3290–1840 BC. The hill measures close to 60 hectares and is fortified at the summit, with cultural deposition throughout the entire extent of its surface. The size of the settlement is estimated to be 8-10 hectares, and combined with the Kestel slope occupation probably totals 60 hectares in a man+mine system. A great deal of the city was semi subterranean.\nThe pottery at Göltepe provided the final proof of the tin industry in the Bronze Age. Many thick crucibles lined with slag were found at the site and tests revealed the slag to have very high concentrations of tin (30% to almost 100%). It is likely that after the ore nuggets were washed, stone tools were used to grind them to a powder, and then the powder was heated to melt out the tin. All of this can be accomplished with Bronze Age tools and methods. The Kestel mine stopped producing at the end of the third millennium BC.\nJ.D. Muhly has criticized the reconstruction proposed by Yener. He noted that no ores with high tin mineral contents were found; that the ores found may be more useful for iron mining; that the radiocarbon dating provided allows for setting the expansion of the mine in a much later time; that no significant bronze artefact are known from southeastern Anatolia in the Early Bronze Age; that tin extraction with the Kestel crucibles would require manipulation of microscopic slag particles; that Middle Bronze Age Assyrian records point to tin trade - sourced in the east - that extended into Anatolia; that no textual evidence of any period refers to tin extraction on Anatolia.\nSee also\n* K. Aslihan Yener\nReferences\n* [https://oi.uchicago.edu/sites/oi.uchicago.edu/files/uploads/shared/docs/ar/91-00/93-94/93-94_Goltepe.pdf THE 1993 EXCAVATION SEASON AT GOLTEPE, TURKEY. K. Ashhan Yener]\n*\n* Yount, Lisa (1996). Twentieth Century Women Scientists. New York: Facts on File. ."
    }
  ]
}