{
  "content": [
    {
      "type": "text",
      "text": "# Kevin Ward (baseball)\n\n|birth_place=Lansdale, Pennsylvania, U.S.\n|death_date=\n|death_place=Coronado, California, U.S.\n|debutleague = MLB\n|debutdate=May 10\n|debutyear=1991\n|debutteam=San Diego Padres\n|finalleague = MLB\n|finaldate=October 4\n|finalyear=1992\n|finalteam=San Diego Padres\n|statleague = MLB\n|stat1label=Batting average\n|stat1value=.217\n|stat2label=Home runs\n|stat2value=5\n|stat3label=Runs batted in\n|stat3value=20\n|teams=\n* San Diego Padres (–)\n}}\nKevin Michael Ward (September 28, 1961 – March 9, 2019) was an American professional baseball outfielder who played in Major League Baseball (MLB) for the San Diego Padres.\nWard was selected by the Philadelphia Phillies in the sixth round of the 1983 Major League Baseball draft. He spent time the Oakland Athletics organization before making his major league debut with the San Diego Padres in 1991. Over two seasons with the team, Ward played in a total of 125 games, and hit for a .217 average, with five career home runs alongside twenty runs batted in.\nAmateur career\nBorn in Lansdale, Pennsylvania, on September 28, 1961, Ward was the youngest of four children to parents Robert and Paula. He was raised in Chalfont and attended Central Bucks High School West in Doylestown, where he was an American football quarterback and baseball pitcher. Ward excelled as a starting quarterback for CB West. Running an option play, Ward ran for 98 yards against Coatsville during a game in the 1977 season. Ward finished his high school career with a 21–1 record as quarterback, going 11-0 during his senior year and was a third team all-state selection at quarterback. Future NFL star Dan Marino was the first team selection. His standout career led to his recruitment at Arizona where he was a two-sport star for the Wildcats.\nWard played football and baseball at the University of Arizona from 1979 to 1983. Ward's first year of college football was played under coach Tony Mason. In his sophomore season, Ward started three games at quarterback for coach Larry Smith before Smith moved Ward to receiver. Ward played collegiate baseball under coach Jerry Kindall between 1981 and 1983. In 1982, Ward hit for a .403 batting average, 46 runs batted in, and fourteen stolen bases. All three were team-leading totals, and Ward was named to the All-Pac-10 South team. After the 1981 and 1982 seasons, he played collegiate summer baseball with the Harwich Mariners of the Cape Cod Baseball League.\nProfessional career\nWard made his professional debut with the Bend Phillies of the Northwest League in 1981. Ward led the team with a .307 batting average, as well as lead the team in hit by pitch with four. The following season was spent in a higher class of A ball, as ward played for the Peninsula Pilots of the Carolina League. While Ward's batting average dipped against a higher level of competition, he did find his power, belting 13 home runs, second on the team to Randy Day. The following season, Ward again moved up the chain, playing double A ball for the Reading Phillies. Appearing in 43 games that season, ward belted 21 home runs and hit over three hundred again, finishing the season with a .303 batting average. He played the following season at Reading as well. His manager that season at Reading was George Culver, a journeyman ex major league pitcher who the previous season had been Ward's teammate. Playing time increased as war played in 119 games that season, but his home run and batting averages dipped. However, the Phillies thought highly enough of Ward that they promoted him to the Maine Guides, their Triple A club in 1988. Ward was part of an outfield that also included two other Phillies prospects, Ron Jones and Jim Orlander. While Ward was steady in the field, he hit 11 home runs and batted .230.\nAt the end of the 1988 season, Ward became a free agent and signed a contract with the Oakland A's, for whom he played two minor league seasons in their farm system, starting at double A- hunstville and finally Triple A Tacoma. He was granted free agency at the end of the 1990 and signed with the San Diego Padres before spring training in 1991. After a long struggle in the minor leagues, Ward finally made his major league debut on May 10, 1991. Ward batted sixth in the line up, right after power hitting Fred McGriff, who batted fifth. In the bottom of the second, facing Expos pitcher Brian Barnes, ward got a hit in his first at bat, a double that drove in McGriff. Ward faced Barry Jones in the seventh when Jones was called for a balk. The bases were loaded, so the balk forced Bip Roberts home and advanced the runners. However, Montreal held on for the 6–4 win. On August 26, 1991, the San Diego Padres were playing the Pittsburgh Pirates. San Diego led off the second inning, and Ward was facing Pirates pitcher Randy Tomlin. Facing a 3-2 count, Ward hit a deep fly to center field that turned into Ward's first home run in the major leagues. Ward's homer made it 2-1 Padres, and they went on to win 7–5. Ward would hit his second homer of the season the very next game, off Pirates pitcher Zane Smith in the seventh inning. The Pirates ended up winning the game 5–2. The home runs against the Pirates were Ward's only long balls of the season. Another highlight of the 1991 season was a series the Padres played in Philadelphia. Not only was it special because it was Philadelphia that he'd been drafted by to start his pro career, but it was also the first time that his parents got to see him play professional baseball.\nWard turned 30 in 1992, and spent the season as a reserve outfielder for San Diego. 1992 was Ward's second and final season in the majors. In 1993, he signed with the expansion Colorado Rockies and played for their Triple A team, the Colorado City Sky Sox. Ward retired from baseball after that season.\nDeath\nWard was diagnosed with brain cancer in December 2018, and died of the disease on March 9, 2019, aged 57. He was married to Christy, with whom he had two children.\nReferences\nExternal links\n*[http://www.baseball-almanac.com/players/player.php?p=wardke01 Baseball Almanac page]"
    }
  ]
}