{
  "content": [
    {
      "type": "text",
      "text": "# Khairlanjichya Mathyawar\n\n| cinematography =\n| editing        =\n| music          = Anand Modak\n| studio         =\n| distributor    =\n| released       =\n| runtime        =\n| country        = India\n| language       = Marathi\n| budget         =\n| gross          =\n}}\nKhairlanjichya Mathyawar is a 2014 Indian Marathi language film directed by Raju Meshram and produced by Padmashree Kalpana Saroj. The film stars Kishori Shahane Vij, Anant Jog and Milind Shinde, and features music by Anand Modak. It was released on 7 February 2014.\nSynopsis\nThe film is based on the Khairlanji massacre that took place in a village in Vidarbha in 2006. It focuses on the wife and children of Dalit farmer Bhayyalal Bhotmange, who were brutally murdered.\nCast\n* Kishori Shahane Vij as Surekha\n* Dipak Balraj Vij\n* Anant Jog\n* Tukaram Bidkar\n* Milind Shinde\n* Vilas Ujawane\n* Pratiksha Mungekar\n* Dr. Sandeep Patil\n* Akash Gharat\n* Geeta Shinde\nSoundtrack\n| recorded   = 2014\n| venue      =\n| studio     =\n| genre      = Feature film soundtrack\n| length     =\n| language   = Marathi\n| label      =\n| producer   =\n| prev_title =\n| prev_year  =\n| next_title =\n| next_year  =\n| misc =\n}}\nCritical response\nKhairlanjichya Mathyawar received mixed reviews from critics. A reviewer in The Indian Express wrote \"While, the story and screenplay is taut and does not slack, Meshram’s attempt to string the various incidents together in a fortright manner, gives one the feel of watching a documentary\". A reviewer in Divya Marathi wrote \"Although the story is strong, the cinematography lacks grandeur due to poor editing\".\nControversy\nA petition seeking to ban the film's release was filed by Bhayyalal Bhotmange himself and Ravi Shende, convener of Akhil Bharatiya Dhammasena. The petition claimed that his personality was wrongly presented in the film, and that some scenes tarnished the reputation of his daughter. As a result, a court cancelled the certificate given by the Censor Board and banned the film. The Nagpur Bench of the Bombay High Court upheld the ban.\nReferences\nExternal links\n*\n*"
    }
  ]
}