{
  "content": [
    {
      "type": "text",
      "text": "# Khaua-Mbandjeru rebellion__disambig_1\n\nGerman Empire\n*  German South West Africa\n|combatant2   = Khaua-Mbandjeru rebels\n}}\nThe Khaua-Mbandjeru rebellion was an uprising of Africans in German South West Africa which took place in 1896. The rebellion preceded the Herero and Nama genocide, which began around 1904.\nIn 1894, Theodor Leutwein was appointed the commissioner of German South West Africa. One of his tasks was to establish German authority throughout the colony. This task interfered with the tribal organization of local peoples. Shortly before this, a German trader was found murdered in the territory of Khauas Nama around Naosanabis (today's Leonardville). When Curt von François, the predecessor of Leutwein, demanded the murderer be handed over to the German authorities, the Khaua chief, Andreas Lambert, refused. Additionally, the Khaua attacked a tribal group in Bechuanaland, which was under German protection. Leutwein decided to make an example of the Khaua.\nIn February 1894, Leutwein led one hundred troops to the Khaua lands, and then started negotiations. In March, captured Andries Lambert accepted the conditions and recognized German authority, as well as agreeing to return cattle to Bechuanaland and to surrender arms. Subsequently, Lambert was released, but, instead of surrendering the arms, tried to escape with the whole tribe.\nLambert was arrested and subsequently executed. This is thought to be the first execution of a Namibian traditional leader by the German colonial forces. Historical records indicate that Leutwein intended to set an example for much stronger tribes not to stand in his way. In the aftermath of this incident, Leutwein met with the remaining members of the tribe to establish the terms of a \"protection\" treaty. With Lambert's brother acting as regent the tribe agreed to Leutwein's terms. The treaty forbade them from waging war or stealing cattle. Their weapons were to be confiscated and held until the tribe displayed \"quiet behaviour\". Their horses were purchased by the Germans with the proceeds to be presented Lambert's successor. The stolen cattle were returned to the Bechuana who would be allowed to stay in the areas which they had previously leased from the Khaua.\nWith no culture of raising cattle and deprived of the possibility of hunting and raiding for them, the Khaua no longer had a means of immediate economic survival. The sudden and drastic changes implemented by Leutwein led to the tribe's eventual demise as a cohesive social unit. Its members \"scattered into prisoner-of-war and forced-labour camps and lost their entire territory.\".\nNative uprisings and their results in the Leutwein era, 1896–1903\n{| class=\"wikitable\"\n|-\n! Year !! Indigenous Group !! Result\n|-\n| 1896 || Mbandjeru and Khaua Mbandjeru || Dispersed; leaders shot dead; 12,000 cattle taken away. Khaua disarmed and interned in forced labour camps; their territory taken.\n|-\n| 1897 || Afrikaners Tribe || Captured; leaders shot.\n|-\n| 1897–98 || Zwartboois Tribe || Disarmed and interned in Windhoek.\n|-\n| 1903 || Bondelswarts Tribe || Disarmed, the run-away leaders banned\n|}\nVarious other uprisings of indigenous peoples took place well before the Herero and Nama rebellions of 1903–08. Examples include the Damara uprising of 1888, Topnaar uprising of 1891, Ovambanderu uprising of 1896, and the Kavango uprising of 1903.\nSee also\n*Herero Wars\n*Research Materials: Max Planck Society Archive\nReferences"
    }
  ]
}