{
  "content": [
    {
      "type": "text",
      "text": "# Khiamian culture\n\n–\n|typesite    = El Khiam\n|majorsites  = Azraq, Abu Madi, Mureybet\n|extra       =\n|precededby  = Natufian, Harifian\n|followedby  = Yarmukian, Lodian, Nizzanim, Mureybetian, Sultanian\n}}\n}}\nThe Khiamian culture is a Neolithic archaeological culture of Southwest Asia, dating to the earliest part of the Pre-Pottery Neolithic A (PPNA), around 9700 to 8600 BC. It is primarily characterised by a distinctive type of stone arrowhead—the \"El Khiam point\"—first found at the type site of El Khiam.\nOverview\nThe Khiamian owes its name to the site of El Khiam, situated on banks of the Dead Sea, where researchers have recovered the oldest chert arrows heads, with lateral notches, the so-called \"El Khiam points\". They have served to identify sites of this period, which are found in Israel, as well as in Jordan (Azraq), Sinai (Abu Madi), and to the north as far as the Middle Euphrates (Mureybet). El Khiam points and other chert stone tools alike are often referred to as projectile points or arrowheads. While it is true that they were used as arrowheads, the given names imply function and are therefore misleading when considering the existence of evidence that suggests that these artefacts were indeed multipurpose tools used for an array of purposes such as knives and drills.\nAside from the appearance of El Khiam arrow heads, the Khiamian is placed in the continuity of the Natufian, without any major technical innovations. However, for the first time houses were built on the ground level itself, and not half below ground as was previously done. Otherwise, the bearers of the El Khiam culture were still hunter-gatherers, and agriculture at that time was then still rather primitive, based on what has been reported on sites of this period. Newer discoveries show that in the Middle East and Anatolia some experiments with agriculture were being made by 10,900 BC. and that there may already have been experimenting with wild grain processing around 21,000 years ago at Ohalo II. The Khiamian material culture was succeeded by the Mureybetian in the middle Euphrates and the upper Levant, while the Sultanian emerged in the southern Levant. The Sultanian material culture can be seen as a development from the Khiamian, with the El Khiam point staying as a part of the assemblage but the microliths disappearing and bifacial core knapped stone tools appearing and the appearance of axes and adzes.\nThe Khiamien also sees a change occur in the symbolic aspects of culture, as evidenced by the appearance of small female statuettes, as well as by the burying of aurochs skulls. According to Jacques Cauvin, it is the beginning of the worship of the Woman and the Bull, as evidenced in the following periods of the Near-Eastern Neolithic.\nThe largest and most embellished/decorated architecture at the end of this period were in the Northern Levant, with the communal gathering building of Jerf el-Ahmar, and the monumental ceremonial complexes of Göbekli Tepe.\nFile:Three El-Khiam points from JQ-101.jpg|Three El-Khiam points\nFile:Göbeklitepe Şanlıurfa.jpg|Göbekli Tepe, in south-eastern Anatolia c. 9000 BC\nFile:Göbeklitepe Building C sept 2019 5373crop.jpg|Animal figures in high relief, Göbekli Tepe\nReferences\n;Sources\n* . 2007. Zivilisationen – wie die Kultur nach Sumer kam. Munich.\n* . 2000. The birth of the gods and the origins of agriculture. Cambridge.\n* . 2008. Sie bauten die ersten Tempel. Das rätselhafte Heiligtum der Steinzeitjäger. Munich. pp.&nbsp;283.\n*  and . 2007. \"Catastrophic early Holocene sea level rise, human migration and the Neolithic transition in Europe.\" Quaternary Science Reviews 26: 2036–2041."
    }
  ]
}