{
  "content": [
    {
      "type": "text",
      "text": "# Khmer traditional wrestling__disambig_1\n\nCambodia\n| creator      =  Brahmin Timu\n| parenthood   =\n| ancestor_arts = Maloyuth\n| descendant_arts =\n| famous_pract =\n| olympic      = No\n}}\nKhmer traditional wrestling ( - Baok Cham Bab) is a folk wrestling style from Cambodia. It has been practiced as far back as the Angkor period and is depicted on the bas-reliefs of certain temples. The earliest form of Khmer traditional wrestling was called Maloyuth. Maloyuth was created in 788 A.D. by Brahmin Timu. It evolved to the current form of wrestling, Cham Bab, in the 8th century. Although predominantly a male sport today, Khmer wrestling was once practiced by both sexes as female wrestlers are also displayed on the Banteay Srei temple.\nIn Khmer wrestling, the dancing is as important as the wrestling. There is a pre-match ritual dancing before the match in which the wrestlers dance and move to the music. Matches consists of three rounds. Victory is obtained by forcing the opponent on their back. The person who is able to win two of the three rounds is the winner of the match. After each round the loser is asked if he wishes to continue with the match. The match is accompanied by the music of two drums (called skor ngey and chhmol which means female drum and male drum). Traditional matches are held during the Khmer New Year and on other Cambodian holidays. This sport used to be a means of choosing tribal and regional leaders. In the olden times, elders taught the young in their village on the full moon night after harvesting. It would take place on a rice paddy outside the village and under the moonlight.\nThe sport is still practiced today in wrestling clubs in Pursat and Kampong Chhnang.\nFile:Angkorian statue of wrestling apes.jpg\nFile:Khmerwrestlingangkorwat.jpg\nFile:Submission technique.jpg\nSee also\n*Malla-yuddha\n*Kyin wrestling\n*Mongolian wrestling\n*Naban\n*Shuai Jiao\nIn-Line Citations\nReferences\n*Vanna, Ly. [http://www.leisurecambodia.com/news/detail.php?id=113 \"Khmer Traditional Wrestling\"], Leisure Cambodia, August 2002, retrieved April 21, 2017.\n*\"Cambodian Bloodsport\". Human Weapon. Bill Duff, Jason Chambers. History Channel.16 November 2007.\n*Taing, Rinith. [https://web.archive.org/web/20171109084101/https://www.phnompenhpost.com/arts-culture/kingdoms-oldest-wrestling-form-grapples-fading-interest \"The Kingdom’s oldest wrestling form grapples with fading interest\"], The Phnom Penh Post, 7 Apr. 2017,  retrieved 21 Apr. 2017.\nExternal links\n*[https://web.archive.org/web/20060525045919/http://www.camnet.com.kh/cambodia.daily/selected_features/holy_game.htm Cambodian Daily]\n*[https://web.archive.org/web/20051231114923/http://www.leisurecambodia.com/Leisure_Cambodia/No.14/wrestling.htm Khmer Wrestling Championship]\n*[https://web.archive.org/web/20080507164736/http://www.usadojo.com/articles/Antonio-Graceffo/khmer-traditional-wrestling.htm USA DOJO]"
    }
  ]
}