{
  "content": [
    {
      "type": "text",
      "text": "# Khujand treaty\n\nKhujand treaty is a border agreement between Tajikistan, Kyrgyzstan, and Uzbekistan in March 2025 aimed at resolving long-standing border disputes and fostering greater regional cooperation in Central Asia. These developments primarily involve a landmark bilateral agreement between Tajikistan and Kyrgyzstan, and a subsequent trilateral treaty involving Uzbekistan.\nBackground\nBorder demarcation in the Fergana Valley region of Central Asia has been a complex and often contentious issue since the collapse of the Soviet Union in 1991. The intricate patchwork of ethnic groups and historical land use patterns has led to numerous disputes and occasional violent clashes, particularly along the borders of Tajikistan and Kyrgyzstan, which share a long and complex frontier. These disputes have hindered regional stability and economic development.\nTajikistan–Kyrgyzstan Border Agreement\nA significant breakthrough occurred in March 2025 when the presidents of Tajikistan, Emomali Rahmon, and presidents of Kyrgyzstan, Sadyr Japarov, met in Kyrgyzstan. On March 13, 2025, they signed a historic agreement on the delimitation of their shared state border. This marked the first official visit of Rahmon to Kyrgyzstan since the deadly border clashes of September 2022.\nThe key aspects of the agreement include:\n* Equivalent Land Exchange: The agreement involves a mutual exchange of land with equal territorial size.\n* Joint Management of Water Resources: Provisions for the joint management and utilization of water resources and infrastructure along the border.\n* Demilitarization: A commitment to refrain from deploying drones or heavy military equipment in the border areas.\n* Dostuk Village: The transfer of the Kyrgyz village of Dostuk to Tajikistan, with residents receiving larger land plots in their new location as compensation.\nThe parliaments of both Tajikistan and Kyrgyzstan have ratified the agreement, leading to the reopening of border crossing points. This agreement is considered a significant step towards lasting peace after decades of border disputes, including the violent conflicts in 2021 and 2022 that resulted in hundreds of casualties and the displacement of tens of thousands.\nHuman Rights Watch has emphasized the importance of ensuring the rights of residents affected by the border demarcation process are protected.\nTrilateral Border Treaty\nBuilding on the momentum of the bilateral agreement, the presidents of Tajikistan, Kyrgyzstan, and Uzbekistan – Emomali Rahmon, Sadyr Japarov, and Shavkat Mirziyoyev respectively – convened in Khujand, Tajikistan, on March 31, 2025. They signed a treaty concerning the junction point of their national borders. This trilateral summit was the first of its kind and signifies a notable improvement in regional relations.\nConcurrently, Kyrgyzstan and Tajikistan also signed the protocol on the exchange of instruments of ratification of their bilateral border agreement.\nUzbekistan's President Mirziyoyev congratulated Kyrgyzstan and Tajikistan on resolving their border issues, hailing it as a factor for regional stability and sustainable development.\nThe leaders also discussed the importance of expanding economic and infrastructural cooperation, proposing initiatives such as a trilateral trade platform and a permanent exhibition of industrial and agricultural products.\nA Friendship Memorial was unveiled at the tri-border area, symbolizing the strengthening of good neighborliness, trust, and strategic partnership among the three nations.\nSignificance\nThese border agreements are considered significant steps towards:\n* Strengthening Regional Stability: Resolving border disputes reduces the potential for conflict and enhances peace and security in Central Asia.\n* Promoting Cooperation: Clearer borders can facilitate greater economic, social, and cultural exchange between the countries.\n* Demonstrating Regional Diplomacy: The agreements highlight the ability of Central Asian nations to address complex issues through dialogue and diplomacy.\nHowever, some concerns remain regarding the potential for local resistance during the implementation process and the need to uphold the human rights of affected populations.\nReferences"
    }
  ]
}