{
  "content": [
    {
      "type": "text",
      "text": "# Khwarazmian army between 1231 and 1246\n\nKhwarazmian}}\nThe Khwarazmian army, also called the Khwarazmiyya, maintained itself as a force of freebooters and mercenaries between 1231 and 1246, following the Mongol conquest of the Khwarazmian Empire (1221) and the death of the last Khwarazmshah, Jalal al-Din (1231). It was active in Upper Mesopotamia, Anatolia, Syria and Palestine and shifted its allegiance several times, often acting autonomously before it was defeated and destroyed by the Ayyubids.\nof Matthew of Paris. The Khwarazmians are the ones on the left, labelled Chorosmini cum babilonicis. The city of Babilonia'' (Cairo) is at the left edge of the image.]]\nIn 1231, the Khwarazmians were briefly in the service of the Ayyubid governors around Lake Van. Between 1231 and 1237, they were in the service of the Seljukid sultanate of Rum and fought against an Ayyubid invasion in 1232–1233. The Khwarazmians were forced back into Upper Mesopotamia in 1237, during a Seljukid succession crisis. They were then hired by the Ayyubid emir of Damascus. Taking part in the Ayyubid civil wars in Syria, they launched invasions against the emir of Aleppo in 1240 and 1241. Defeated in their second invasion, they retreated to central Mesopotamia and took service with the Abbasid caliphate. Later in 1241, the Khwarazmians hired themselves out to the Zengid emir of Mosul before returning to Syrian Ayyubid politics. They were defeated by Aleppo in 1242.\nThe Khwarazmians made an alliance with the Ayyubid sultan of Egypt in 1243. In 1244, they invaded Palestine, sacked Jerusalem and defeated the anti-Egyptian alliance at the Battle of Forbie. Thus they permanently ended Crusader rule in Jerusalem. In 1245, they helped the Egyptians conquer Damascus. Dissatisfied with their rewards, they rebelled in 1246 and besieged Damascus. They suffered a crushing defeat at the hands of an alliance led by Aleppo, and disintegrated as a unified force.\nBackground\nThe Khwarazmian army was routed by the Mongols at the battle of the Indus in 1221. Gathering together the remnants of the army, Jalal al-Din established an empire in Punjab and Sind. He remained there for about three years, after which, leaving behind governors and troops, he set out to re-establish the Khwarazmian Empire in its original territories and further west in late 1223. According to al-Nasawi, he arrived back in Kerman with 4,000 troops. In Iran, he augmented his army with soldiers who had been loyal to his father.\nJalal al-Din spent the next several years terrorizing his Christian and Muslim neighbours rather than fighting the Mongols. He was routed by a Seljukid–Ayyubid alliance at the battle of Yasi-chimen in 1230 or 1231. Before more forces could be raised, the Mongols renewed their invasion. Jalal al-Din fled with his rump army first to the Mughan Steppe and afterwards towards Diyar Bakr. He was defeated by the Mongols and suffered huge losses near Amida. In 1231, he was murdered by a Kurd while seeking refuge with Shahib al-Din Ghazi, emir of Mayyafariqin.\nComposition of the Khwarazmian army\nAbout 12,000–15,000 soldiers of Jalal al-Din's army in Diyar Bakr hired themselves out as mercenaries. Bar Hebraeus puts the figure that entered Seljukid service at 10,000 and scholarly estimates have ranged from 4,000 to 25,000. If the numbers given by the sources refer to fighting strength, then the total complement of Khwarazmians must have been more than 50,000 around a core of 12,000 soldiers.\nKnown by the collective term Khwarazmiyya in the Arabic sources, the Khwarazmians were among the first wafidiyya (or ''musta'minun), groups of refugee soldiers from the east who took up service in Syria and Egypt. In Latin sources, they appear as the chorosmini, choermini, cohersmini, corasmini'', etc. Their collective name refers to their service to the last Khwarazmshah. It ignores distinct tribal origins. They were predominantly Kipchak Turkish and other pastoralist cavalrymen who, in light of the Mongols' destruction of their homeland, had no reason to return home. Besides Kipchaks, there were probably Kangly, Khalaj and Oghuz Turks, the latter being the same people as the Seljukids, whose earlier empire in Iran had been supplanted by that of the Khwarazmshahs. The Khwarazmian soldiers travelled with their families and a staff of katibs (secretaries) and faqihs (jurists), the latter mainly of Iranian origin.\nThe emirs of the army elected Husam al-Din Kirkhan Malik as their leader. The historian al-Nasawi described him as undistinguished and \"negligent\". The other emirs named by Ibn Bibi were Husam al-Din Berke-Khan, Yilan-Bughu, Saru-Khan, Khanberdi, Sayf al-Din Sadiq-Khan, Atlas-Khan and Nasir al-Din Kushlu-Khan.\nSeljukid service\n, three-quarters length robe, and boots, in the preaching scene at Khwarizmian Rayy, Iran. Maqamat of Al-Hariri, 1237.]]\nUnder Kirkhan, the Khwarazmians first entered the service of the Ayyubid rulers Ghazi of Mayyafariqin and al-Ashraf of Akhlat. In 1231 or 1232, they switched allegiance to their other former enemy, the Seljukid sultan Kayqubad I, through the frontier commander, Sinan al-Din Kaymaz. In a ceremony in Tatvan, Kaymaz received the oaths of allegiance of Kirkhan and the other Khwarazmian leaders and distributed to them title deeds to various iqta's (tax revenue districts) in the frontier province of Erzurum, included some 36 castles. Garments of honour were bestowed on 300 Khwarazmian leaders.\nNot long after, a group of 4,000 Khwarazmians trying to return to Khwarazm were surprised near the village of Tugtap (Dogodaph) by 700 Mongol raiders and fled to the Seljukid interior, where they requested safer lands. Kaymaz sent them to Kayseri, where the sultan personally invested them with new iqta''s. Kirkhan received Erzinjan, Husam al-Din Berke-Khan received Amasya and the other leaders received Laranda and Nigde among other places.\nIn 1232, the Ayyubid sultan al-Kamil invaded Seljukid Syria. The Khwarazmians under Kirkhan fought with Kayqubad, on this occasion successfully defending the Taurus passes near Hadath. When the Artukids of Khartpert revolted in support of al-Kamil, the Ayyubid attempted to send them reinforcements. Kayqubad with the Khwarazmians trapped the relieving force in the city, which was forced to surrender. In 1233, al-Kamil retreated to Egypt. In 1234, Kayqubad besieged Amida while his Khwarazmians raided around Nisibis and Sinjar. They even reportedly raided Mardin—although the Artukids of Mardin were allied with the Seljukids—in order to avenge Jalal al-Din.\nWhen Kayqubad died in 1237, his succession was disputed between his eldest son, Ghiyath al-Din Kaykhusrau, and his designated successor, 'Izz al-Din, whose mother was an Ayyubid. Since the Khwarazmians were apparently unsure whom to support, Kaykhusrau's chief minister, Sa'd al-Din Köpek, had their leaders arrested. The Khwarazmians were forced to abandon the Seljukids and retreat across the Euphrates into the Jazira. With the permission of al-Kamil, the Ayyubid emir al-Salih Ayyub enrolled them in his army and gave them iqtas in Diyar Mudar. Köpek accused certain emirs of inciting the Khwarazmians to abandon Kaykhusrau and join the Ayyubids. The atabeg Altunbeh was executed on this accusation. After arranging the assassination of Köpek in 1240, Kaykhusrau tried to recall the Khwarazmians, but they refused to return to him.\nInvasions of Syria, Palestine and Transjordan\n1240 invasion\nIn 1239, al-Salih Ayyub was captured and imprisoned in Kerak by al-Nasir Da'ud, who defended his actions by claiming he was only protecting al-Salih Ayyub from his enemies and was prepared to release him and restore him to power. To this end, he asked the Khwarazmians to attack Homs and Aleppo. Acting for the captive emir, Jamal al-Din ibn Matruh presented al-Nasir Da'ud's letter to Berke-Khan at Harran. The Khwarazmians did not act immediately, but it may have been in fulfilling al-Nasir Da'ud's request when in the autumn of 1240 they crossed the Euphrates and raided northern Syria. No contemporary source, however, gives any reason for the Khwarazmian invasion.\nThe invading Khwarazmian force numbered about 12,000. On 2 November 1240, it routed 1,500 cavalry led by al-Mu'azzam Turanshah from Aleppo and, on 9 November, burned Manbij. Learning of the Aleppan defeat, the Emir al-Mansur Ibrahim of Homs brought his forces to Aleppo, entering the city on 11 November. He had 1,000 cavalry raised from Homs and Damascus, with which he intended to confront the Barons' Crusade. Before the end of the year, the Khwarazmians retreated back across the Euphrates.\n1241 invasion\nAfter the Khwarazmian retreat, Dayfa Khatun sent Kamal al-Din ibn al-'Adim to Damascus to gather reinforcements, which al-Salih Isma'il gave. The Seljukids also sent troops. According to Ibn Bibi, Ghiyath al-Din Kaykhusrau ordered the governor of Malatya to raise 3,000 men from the border fortresses and take them to Aleppo. Al-Mansur Ibrahim was appointed commander of the allied forces.\nIn January 1241, the Khwarazmians returned. They pillaged Sarmin, Kafartab and Shayzar. As they were returning towards the Euphrates, al-Mansur Ibrahim caught them at Raqqa on 19 February. The fighting lasted all day, but the Khwarazmians managed to cross the river. They retreated to Harran, while al-Mansur crossed the river at al-Bira. He drew them into a pitched battle outside Edessa on 5 April. Defeated, they retreated to Harran, gathered their families and proceeded to 'Ana, which belonged to the Abbasid caliph. In the aftermath of the victory at Edessa, the Aleppans seized control of Diyar Mudar.\nInterlude\nIn 'Ana, the Khwarazmians entered the service of the Abbasids. Later in 1241, they attached themselves to Badr al-Din Lu'lu' of Mosul and then al-Muzaffar Ghazi of Mayyafariqin. They exhibited little loyalty to any of these nominal overlords and continued to raid Syria. Aleppo sent a punitive expedition against the Khwarazmians at Safar in July–August 1241. In August 1242, a second expedition to Safar, led by al-Mansur Ibrahim, defeated them.\nIn 1243, according to Ibn Wasil, al-Salih Ayyub, now ruler of Egypt, wrote to the Khwarazmians urging them to invade Syria, in exchange for extensive iqtas in Egypt. This caused the peace recently concluded between the Egyptian and Syrian Ayyubids to collapse. In the late winter or early spring of 1244, the Syrian Ayyubids allied with the Christian kingdom of Jerusalem against the Egyptian–Khwarazmian alliance. The city of Jerusalem, in Muslim hands since 1239, was returned to the Christians.\n1244 invasion\nto Pope Innocent IV (preserved in the Chronicle of Melrose) concerning the Khwarazmians in 1244. The \"sudden and unexpected arrival of the Khwarazmians\" (subito et inopinato Corosminorum adventu) is mentioned at the start of the seventh line.]]\nIn 1244, according to the contemporary historian Muhammad ibn Ibrahim al-Khazraji, al-Salih Ayyub gave the Khwarazmians the entire province of Damascus (except Nablus) as an iqta. At the same time, the Kurdish tribe of the Qaymariyya entered his service. These two contingents were to form the core of al-Salih Ayyub's army in the coming wars for Syria and Palestine.\nThe Khwarazmians crossed the Euphrates early in the summer of 1244. The timing of their movement has been attributed to a thrust into northern Syria by the Mongol noyan Yasa'ur. They numbered 10,000 troops, including the Kurdish contingent. Dividing into two groups, they advanced into Palestine through the Biqa' and the Ghuta. At their approach, the allied forces that had been arrayed against Egypt retreated. Al-Salih Isma'il withdrew from Gaza while al-Nasir Da'ud withdrew to Kerak. The Franks (Crusaders) were left to face them alone.\nAs a result of the moves, the Khwarazmians were relatively unopposed in Palestine, although they mostly avoided major population centres. On 11 July 1244, however, they appeared before Jerusalem. The city was pillaged, but the garrison was besieged in the Tower of David until 23 August, when it surrendered with an ostensible safeconduct. The Christian inhabitants, however, were massacred and all the Christian shrines in the city were destroyed. This was the end of Crusader rule in Jerusalem. Al-Salih Ayyub took control of the city in August. According to Ibn al-Furat, the Khwarazmians were given the area around Jerusalem as an iqta.\nFrom Jerusalem, the Khwarazmians marched to Gaza, whence they informed al-Salih Ayyub of their arrival. As he forbade them to enter Egypt, they awaited the sultan's army. The combined army under Rukn al-Din Baybars al-Salihi roundly defeated the Syro-Frankish forces at the battle of Forbie on 17 October. It was the worst Crusader defeat since the battle of Hattin in 1187. The Khwarazmians were the dominant contingent in the victorious army. They swept through much of the coastal territory of the kingdom of Jerusalem, but did not attack the fortified places and so did not take permanent control.\nAfter Forbie, the Khwarazmians joined the army of the Egyptian vizier Mu'in al-Din ibn al-Shaykh at Gaza. They marched to Baysan before besieging Damascus in 1245. While the Egyptian army bombarded the city with mangonels, the Khwarazmians raided the countryside to prevent food from getting to the defenders. In September 1245, al-Mansur Ibrahim considered surrendering the city to the Khwarazmians. He slipped out of Damascus for a clandestine meeting with the Khwarazmian leader, Berke-Khan. Nothing came of it.\nRebellion, defeat and disintegration\nAfter the fall of Damascus in October 1245, Mu'in al-Din granted the Khwarazmians iqtas in Syria (around al-Sahil) and Palestine, but the mercenaries did not consider these commensurate with the promises made by the sultan. Still encamped about Damascus, the Khwarazmians launched a raid on the village of Darayya. In preparation for a full rebellion, they allied with al-Salih Isma'il, al-Nasir Da'ud and 'Izz al-Din Aybeg al-Mu'azzami. They even wrote to their former commander, Rukn al-Din, who was in command of the troops remaining at Gaza. Rukn al-Din was immediately accused of conspiring with the Khawarazmians, recalled to Egypt and imprisoned.\nIn late March 1246, the Khawarazmians laid siege to Damascus. According to Ibn al-Dawadari, the disloyalty of the Khwarazmians and Qaymariyya led al-Salih Ayyub to purchase \"more Turkish mamlūks [slave soldiers] than all the previous sultans combined\" so that they became a majority of his army.\nWhen the Khawarazmians learned that al-Mansur Ibrahim and al-Nasir Yusuf of Aleppo had allied against them, possibly at the urging of al-Salih Ayyub, they broke off the siege of Damascus and marched north. On 18 May 1246, the two alliances met in battle near al-Qasab on the edge of Lake Homs, where the Khawarazmians and their allies were crushed. Berke-Khan was killed and his head given to Shams al-Din Lu'lu' al-Amini, who hung it from the gate of the citadel of Aleppo.\nThe Khwarazmians were scattered by this defeat. A small contingent remained with al-Salih Isma'il and received asylum from al-Nasir Yusuf in Aleppo. Another group fled to the Balqa' and were hired by al-Nasir Da'ud. The sultan promptly sent an army under Fakhr al-Din ibn al-Shaykh against al-Nasir Da'ud. On 1 September 1246, al-Nasir Da'ud and his Khwarazmians were defeated at al-Salt. The survivors retired to Kerak, where they were besieged. The siege was lifted after al-Nasir agreed to hand over the Khwarazmians to Fakhr al-Din, who enrolled them in his own army. They ended up in Egypt. Still another group of Khwarazmians under Kushlu-Khan joined with the Mongols in Mesopotamia.\nAlthough 1246 marks the effective disappearance of the Khwarazmians from the Arabic sources, they re-appear in the work of the historian Rashid-al-Din over a decade later. He records that some former emirs of Jalal al-Din came to Egypt during the reign of the Mamluk sultan Qutuz (1259–1260), who gave them gifts and plied them for intelligence. When the Mongols demanded tribute from Egypt in 1260, the Khwarazmian emir Nasir al-Din Muhammad Kaymuri advised Qutuz that they would not honour their word. Qutuz chose to fight. A group of Khwarazmians who had fled to Iraq and enlisted in the army of the Ilkhanate participated in the battle of 'Ayn Jalut in 1260. This is their last appearance in the historical record.\nNotes\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* }}\n* }}\n*\n*\n*\n*\n*"
    }
  ]
}