{
  "content": [
    {
      "type": "text",
      "text": "# Khyber Pakhtunkhwa Department of Agriculture\n\n| preceding1      =\n| dissolved       =\n| superseding     =\n| jurisdiction    = Government of Khyber Pakhtunkhwa\n| headquarters    = Peshawar, Khyber Pakhtunkhwa, Pakistan\n| coor_type       =\n| coordinates     =\n| employees       =\n| budget          =\n| chief1_name     = Muhammad Sajjad\n| chief1_position = Minister\n| chief2_name     = Atta Ur Rehman\n| chief2_position = Secretary\n| parent_agency   =\n| website         =\n}}\nThe Khyber Pakhtunkhwa Department of Agriculture (, (Urdu; ) is charged with administering agricultural programs in the Pakistani province of Khyber Pakhtunkhwa, a mountainous region in the northern part of the country. The department is headed by the Minister of Agriculture who is a member of the Chief Minister's Cabinet.\nThe post of Minister of Agriculture is currently held by Muhammad Sajjad, who is part of Chief Minister Ali Amin Gandapur’s cabinet. This position was held by Mr. Ikramullah Gandapur, who was appointed as the first Minister of Agriculture part of PTI by Chief Minister Pervez Khattak on May 7, 2014.[http://www.thenews.com.pk/Todays-News-7-240898-KP-govt-expands-and-reshuffles-cabinet KP govt expands and reshuffles cabinet - thenews.com.pk][http://www.nation.com.pk/national/28-Mar-2014/kp-government-reshuffles-the-provincial-cabinet KP government reshuffles the provincial cabinet] Business Recorder |access-date=2014-10-24 |archive-date=2014-10-19 |archive-url=https://web.archive.org/web/20141019223520/http://www.brecorder.com/general-news/172/1167479/ |url-status=dead }}[http://tribune.com.pk/story/690034/for-the-promised-change-five-new-ministers-sworn-in-to-provincial-cabinet/ For the promised change?: Five new ministers sworn in to provincial cabinet – The Express Tribune][http://tribune.com.pk/story/688576/housekeeping-k-p-cabinet-undergoes-expansion-reshuffling/ Housekeeping: K-P cabinet undergoes expansion, reshuffling – The Express Tribune]\nHistory\nCreated on August 14, 1973, the department's mission is to create jobs, promote agricultural growth, encourage sustainable development and improve living standards for the Khyber Pakhtunkhwa province.\nOrganization\nThe department is under the control and supervision of the Khyber Pakhtunkhwa Minister for Agriculture, a political appointee of the Chief Minister of Khyber Pakhtunkhwa. The Secretary of Agriculture, also appointed by the Chief Minister, assists the Agriculture Minister in managing the department and assumes the duties of the Minister in his absence.\nStructure\nOrganization Chart of the Khyber Pakhtunkhwa Department of Agriculture\n* Minister of Agriculture\n** Secretary of Agriculture\n** Special Secretary of Agriculture\n*** Additional Secretary of Agriculture\n**** Deputy Secretary of Agriculture\n***** SO Accounts & Cooperatives\n***** SO Agriculture\n***** SO Administration\n***** SO Establishment\n***** SO Litigation\n***** SO Livestock & Fisheries\n**** Chief Planning Officer\n***** Deputy Director Planning Agriculture\n***** Deputy Director Monitoring & Planning\n***** Assistant Director Planning\n***** Planning Officer\n***** Assistant Statistical Officer\n***** Agribusiness Officer\nDuties\nMinistry roles include assessing emerging agriculture conditions, and emerging concerns in the Khyber Pakhtunkhwa area. Additional roles include advising the Chief Minister of agriculture-related matters. The Minister of Agriculture applies Department of Agriculture policies to carry out approved programs and generates public awareness of the department's policies.\nSee also\n*Agricultural Training Institute, Peshawar\nReferences"
    }
  ]
}