{
  "content": [
    {
      "type": "text",
      "text": "# Kicking Bishop Brennan Up the Arse__disambig_2\n\n| production   =\n| writer       =\n* Graham Linehan\n* Arthur Mathews\n| director     = Andy DeEmmony\n| guests       =\n* Jim Norton as Bishop Brennan\n* Ian Fitzgibbon as Father Jessup\n| episode_list = List of Father Ted episodes\n| prev         = Escape from Victory\n| next         = Night of the Nearly Dead\n}}\n\"Kicking Bishop Brennan Up the Arse\" is the sixth episode of the third series of the sitcom Father Ted, and the 23rd episode overall. It originally aired on Channel 4 on 17 April 1998; its story continues from the previous episode, \"Escape from Victory\". In the episode, Father Ted Crilly must kick his strict and overbearing superior Bishop Brennan in the buttocks (\"up the arse\") as a forfeit set in the previous episode by Father Dick Byrne for cheating at a football match.\nThe writers of Father Ted, Graham Linehan and Arthur Mathews, named \"Kicking Bishop Brennan Up the Arse\" as their favourite episode in a documentary aired during Channel 4's Father Ted Night; \"Speed 3\" was chosen by a vote on the Channel 4 website.\nPlot\nTed is extremely worried about the forfeit, fearing that Bishop Brennan will send him to a parish even worse than Craggy Island after he carries it out. However, he is unable to back out of it; Father Dick Byrne has not only insisted that Dougal take a picture, but he has called ahead to Bishop Brennan and told him that his likeness has miraculously appeared in the skirting boards in the Craggy Island parochial house to ensure that he will travel to the island to inspect it.\nAfter Ted stays up worrying all night, he and Dougal are surprised by the early arrival of Bishop Brennan and his assistant Father Jessup, \"the most sarcastic priest in Ireland\" – his sarcasm confuses their housekeeper, Mrs Doyle, and tests Father Jack's temper. Bishop Brennan's visit occurs the day before he is due to go to Rome to meet the Pope. Ted takes the Bishop to see the skirting board, and prepares to carry out the forfeit, but after seeing Jessup watching him, he aborts the kick and instead hurls himself out of the window. Brennan and Jessup prepare to leave, but are forced to stay the night when Mrs Doyle informs them that the roads have been \"taken in\".\nDougal suggests that Ted should kick Bishop Brennan and act as if nothing had happened, reasoning that the bishop would never believe Ted, who fears Brennan, capable of such an act. The next day, Father Jack locks Jessup inside his underpants hamper after Jessup tries to prevent him from taking liquor belonging to the bishop. With Jessup out of the way, Ted brings the bishop to see the skirting board again. The bishop notices that the skirting board now has a crude watercolour painting (courtesy of Dougal) on it, depicting a man in a bishop's hat. As the Bishop bends down to examine the painting, Ted  promptly kicks him in the buttocks as hard as possible, while Dougal takes a photograph.\nBishop Brennan is shocked into a catatonic state that lasts well beyond the duration of his visit. As the bishop flies to Rome, Ted and Dougal celebrate with sparkling wine. Ted gets extremely drunk and orders Dougal to have several copies of the photograph made, including a 10x10 version for himself. Brennan snaps out of his stupor just as he is due to greet the Pope in the Vatican. After telling the Pope \"He did kick me up the arse!\", he shoves him to the ground, runs to the exit, picks up his mobile phone and furiously demands to be booked onto the first available flight back to Ireland.\nTed wakes up the next morning with a hangover. As soon as he looks out of the window, he sees a furious Bishop Brennan charging aggressively towards the parochial house, prompting him to try to hide. The bishop kicks down the front door, bursts into the bedroom, and finds Ted hiding under the bed, which he flips over. Despite Brennan's rage, Ted manages to convince him that he did not do it. On his way out, however, Brennan sees an enormous, ten-foot-tall version of the photograph that Dougal had made (thinking that Ted meant feet, when he actually meant inches). After a brief chase, Ted slips on mud and the bishop gets his revenge by booting him across the field.\nAt the end of the episode, Father Jessup is shown to still be locked in Father Jack's underpants hamper, using a lighter as a source of light. After the lighter runs out, he says \"I'm really enjoying this\".\nCultural references\nThe writers of Seinfeld stole the idea for the Seinfeld episode \"The Revenge\", in which the character George regrets quitting his job and Jerry suggests that he return and pretend he had never quit, and a story involving the Belgian painter René Magritte kicking his sister's fiancé to gauge his reaction; other versions of the story involve a friend of his wife's or a Time magazine interviewer.\nIrish author Eugene O'Brien titled his book studying Irish culture based on popular literary and media works after this episode.\nThe episode's cold open recap sequence is a parody of NYPD Blues \"shaky camera\" technique, and its post-credits scene, in which Father Jessup flicks his lighter on and off inside Jack's underpants hamper, is a reference to The Vanishing. The episode also features Brennan comparing Father Jack to the Kraken, a legendary sea monster, and a reference to a previous forfeit of Byrne's involving him saying \"bollocks\" in front of Irish president Mary Robinson.\nReferences\nExternal links\n*[http://www.channel4.com/programmes/father-ted/episode-guide/series-3/episode-6 \"Kicking Bishop Brennan Up the Arse\"] at Channel 4\n*"
    }
  ]
}