{
  "content": [
    {
      "type": "text",
      "text": "# Kidnapping of Amber Swartz-Garcia\n\n| birth_place         =\n| disappeared_date    =\n| disappeared_place   = Pinole, Contra Costa County, California, U.S.\n| disappeared_status  =\n| nationality         = American\n| mother              = Kim Swartz\n| father              = Bernie Swartz\n}}\nThe kidnapping of Amber Swartz-Garcia (born August 19, 1980) occurred on June 3, 1988, in Pinole, California, when she was seven years old. She had been playing jump rope in her front yard when she was abducted. Curtis Dean Anderson, a convicted kidnapper, confessed to kidnapping and killing Swartz-Garcia shortly before his 2007 death, but doubts remain about his involvement.\nDisappearance and possible killer\nAmber was the daughter of Bernie Swartz, a police officer, and Kim Swartz. Her father was shot and killed four months before her birth, and her mother then lived with Al Garcia, and Amber took his last name. Over the years, the police announced that suspects, including a volunteer who helped search for missing children and a defrocked priest had been questioned intensively in the kidnapping.\nIn 2009, Pinole police and the FBI announced that her killer was convicted murderer Curtis Dean Anderson, who died in prison in 2007 one month after confessing to her kidnapping and murder. Anderson had a long criminal record and had been convicted of kidnapping and murdering Xiana Fairchild of Vallejo, California, who was also seven years old, and also of kidnapping and sexually assaulting another girl named Midsi Sanchez, who escaped. He had bragged about kidnapping eleven girls.\nInvestigation and aftermath\nAnderson told FBI agents that he sedated Amber while he drove to Arizona to visit his aunt. He said that he killed Amber in a motel room near Tucson, Arizona, and disposed of her body near Benson, Arizona. No human remains or credible evidence of Amber's death has been found, other than Anderson's confession. As a result of his confession the case was declared closed. Kim Swartz was convinced that Anderson was lying to get attention. In 2013, after a petition campaign, the Pinole police agreed to re-open the case.\nSee also\n* Disappearance of Michaela Garecht\n* Kidnapping of Jaycee Dugard\n* List of kidnappings\n* List of people who disappeared mysteriously: post-1970\nReferences"
    }
  ]
}