{
  "content": [
    {
      "type": "text",
      "text": "# Killing of Nawar al-Awlaki\n\n| death_place        = Al Bayda Governorate, Yemen\n| death_cause        = Homicide (gunshot wound to the neck)\n| other_names        = Nora\n| known_for          = Being killed in a United States military raid ordered by the Trump administration\n| father             = Anwar al-Awlaki\n| relatives          = Nasser al-Awlaki (grandfather)Abdulrahman al-Awlaki (half-brother)\n}}\nNawar \"Nora\" al-Awlaki (; 2008/09 – January 29, 2017), the 8-year-old daughter of Anwar al-Awlaki, was killed on January 29, 2017, during the Raid on Yakla, a commando attack ordered by U.S. President Donald Trump.\nConducted in southern Yemen, the raid was an attempted attack on a branch of the terrorist group Al-Qaeda. The raid in southern Yemen was conducted by the Joint Special Operations Command and was, according to a senior U.S. military official, intended to capture intelligence stored on computers. According to U.S. officials, in addition to the death of Nawar al-Awlaki, a U.S. Navy SEAL and three al-Qaeda leaders were killed.\nNawar al-Awlaki's death gained national coverage and attention in both mainstream and online media sources. Nawar's grandfather, Nasser al-Awlaki, said of her killing, \"She was hit with a bullet in her neck and suffered for two hours. Why kill children? This is the new U.S. administration – it's very sad, a big crime.\" Nawar died with her mother and uncle by her side. Her alleged last words were, \"Don't cry, mama. I'm fine.\"\nNawar was the third member of her immediate family killed during military orders issued with executive powers. Her father, Anwar al-Awlaki, was the first to be killed by the executive branch when on September 30, 2011, CIA orders calling for a precision drone strike targeting him were given presidential approval by President Barack Obama. Anwar al-Awlaki was alleged by the U.S. government to be a leader of al-Qaeda in the Arabian Peninsula that had gone \"operational\", although the US government has refused to declassify much of the evidence that led them to this conclusion. Two weeks after the death of her father, Nawar's sixteen-year-old half-brother, Abdulrahman, was also killed in a U.S. drone strike.\nReferences"
    }
  ]
}