{
  "content": [
    {
      "type": "text",
      "text": "# Kilwinning (ward)\n\n|elects_howmany=4\n|councillor1=Joe Cullinane\n|party1     =Scottish Labour Party\n|councillor2=Scott Davidson\n|party2     =Scottish National Party\n|councillor3=Donald Reid\n|party3     =Scottish Labour Party\n|councillor4=Mary Hume\n|party4     =Scottish Labour Party\n|towns      =Kilwinning\n|scot_parl  =Cunninghame South\n|scot_region=West Scotland\n|westminster=North Ayrshire and Arran\n|westminster2=Central Ayrshire\n}}\nKilwinning is one of the nine wards used to elect members of the North Ayrshire council. Created in 2007, the ward elects four councillors using the single transferable vote electoral system and covers an area with a population of 17,280 people.\nThe ward is a Labour stronghold with the party winning half the seats at every election.\nBoundaries\nThe ward was created following the Fourth Statutory Reviews of Electoral Arrangements ahead of the 2007 Scottish local elections. As a result of the Local Governance (Scotland) Act 2004, local elections in Scotland would use the single transferable vote electoral system from 2007 onwards so Kilwinning was formed from an amalgamation of several previous first-past-the-post wards. It contained all of the former Kilwinning East and Kilwinning South wards, the majority of the former Eglinton and Lawthorn ward, the southern half of the former Kilwinning West ward, the northern half of the former Stevenston North ward, the rural southern part of the former Garnock East ward, part of the former Ardrossan North and a small part of the former Irvine Landward ward. The ward centres on the town of Kilwinning in central North Ayrshire. Its southern boundary is mostly formed by the A78 and it includes a rural area to the north and east of the town up to the border with East Ayrshire. The wards boundaries were unchanged following the Fifth Statutory Reviews of Electoral Arrangements and the 2019 Reviews of Electoral Arrangements.\nCouncillors\n{|class=\"wikitable\" style=\"text-align:center\"\n!Year\n!colspan=8|Councillors\n|-\n!2007\n|rowspan=5; style=\"background-color: \" |\n|rowspan=2|John Ferguson(SNP)\n|rowspan=5; style=\"background-color: \" |\n|rowspan=1|Margaret McDougall(Labour)\n|rowspan=5; style=\"background-color: \" |\n|rowspan=1|Ryan Oldfather(Labour)\n|rowspan=1; style=\"background-color: \" |\n|rowspan=1|Andrew Scott Chamberlain(Liberal Democrats)\n|-\n!2012\n|rowspan=4|Joe Cullinane(Labour)\n|rowspan=4|Donald Reid(Labour)\n|rowspan=1; style=\"background-color: \" |\n|rowspan=1|Robert Steel(Ind.)\n|-\n!2017\n|rowspan=3|Scott Davidson(SNP)\n|rowspan=2; style=\"background-color: \" |\n|rowspan=2|John Glover(Conservative)\n|-\n!2022\n|-\n!2024\n|style=\"background-color: \" |\n|Mary Hume(Labour)\n|}\nElection results\n2024 by-election\nCouncillor John Glover who died in February 2024. Labour candidate Mary Hume gained the seat from the Conservatives.\n2022 election\n2017 election\n2012 election\n2007 election\nReferences"
    }
  ]
}