{
  "content": [
    {
      "type": "text",
      "text": "# Kim Chi (drag queen)\n\n|birth_place  = United States\n|occupation   = Drag queen\n|height       =\n|known_for    = ''RuPaul's Drag Race season 8\n|website      =\n| module =\n}}\nSang-Young Shin (; born August 8, 1987), known professionally as Kim Chi, is an American drag queen, artist, entrepreneur, and television personality best known for competing on the eighth season of RuPaul's Drag Race''. Kim Chi was the first Korean-American contestant on the show as well as the first Korean-American drag queen on American national television. She and she/her pronouns. This article uses she/her for consistency.}} owns the beauty brand Kim Chi Chic Cosmetics.\nEarly life\nSang-Young Shin was born in the United States on August 8, 1987, and lived in South Korea as a child. Her parents, who are divorced, also live in Chicago. As of 2016, Kim Chi lived in the Andersonville neighborhood of Chicago. She attended Okemos High School. As of 2017, her mother did not know she did drag until she reached fame on TV. Shin studied graphic design in college before working as an art director and exploring sculpture, fashion design, and painting.\nCareer\nShin started performing in drag as Kim Chi in Chicago in 2012. Her drag name is a pun on \"Kimchi\", the Korean national dish and is also a valid Korean female name (\"Kim\" is the surname and \"Chi\" is the given name). Describing her drag aesthetic, Shin stated, \"Kim Chi is a live action anime character whose fashion aesthetic could be described as 'bionic doily.' I imagine my aura to be an array of ultra violet colors that spews glitter. I celebrate all things cute, fun, weird, and exotic.\" Prior to joining ''RuPaul's Drag Race, Kim Chi befriended and helped season seven contestant Trixie Mattel get one of her first drag jobs in Chicago, as it was difficult for Mattel to find one in her hometown of Milwaukee.\nKim Chi was one of twelve drag queens accepted for the eighth season of RuPaul's Drag Race'', which started airing March 7, 2016. Upon joining the show, she became \"the first Korean drag queen to be featured on American national television.\" Kim Chi won the first challenge, which came with a small cash prize. Shin sent the money to her mother, telling her she made it through makeup work. Eventually, Kim Chi made it to the top three along with Naomi Smalls, but lost the title to Bob the Drag Queen. During the finale, she lip synced a song specifically made for her called \"Fat, Fem, & Asian\", which was a commentary on negative stereotypes in the gay dating world.\nAfter Drag Race, Kim Chi partnered with Sugarpill Cosmetics to create different makeup items, including the Kim Chi Liquid Lip Color, a donut-scented lipstick described as a \"Matte lavender mauve with a subtle, unique blend of transparent aqua and violet sparkles\". Other items included the Kim Chi Electric Teal Eyeshadow.\nIn November 2016, Kim Chi released a package of Kim Chi emoji called Kimchiji. Emoji included her catchphrases, a burrito bowl, a chicken wing, and a butt being spanked.\nIn March 2017, Kim Chi was invited to the College of Communication and Fine Arts at Loyola Marymount University for an event called \"A Fabulous Evening With Kim Chi: Exploring Gender Identity Through Drag\". She was the first drag queen to come to the college, and did so in full drag makeup. Along with a performance, there was a question and answer section during the event.\nIn April 2017, Kim Chi performed at Arizona State University West campus for their Asian Heritage Week and Pride Week.  Emily Kwon, President of the Asian-Asian Pacific American Students' Coalition, put on the event and invited Kim Chi to perform for the students.\nin 2023]]\nIn May 2017, Kim Chi performed as part of the Werq the World 2017 tour. The tour, hosted by Bianca Del Rio and Michelle Visage, also featured drag queens Alaska Thunderfuck, Alyssa Edwards, Detox, Latrice Royale, and Violet Chachki.\nIn December 2018, Kim Chi appeared in the television special ''RuPaul's Drag Race Holi-slay Spectacular, a one-off festive version of the regular Drag Race series.\nIn June 2019, a panel of judges from New York magazine placed her 17th on their list of \"the most powerful drag queens in America\", a ranking of 100 former Drag Race contestants. In September 2019, Kim Chi announced that she was developing her own cosmetics line in collaboration with Bespoke Beauty Brands launched by Toni Ko, the founder of  NYX Cosmetics, called Kim Chi Chic.\nIn 2025, Kim Chi collaborated with Korean-American streetwear brand Sundae School for cannabis edible products, named \"Kim Chi Over Flowers\".\nShe is one of the most followed queens from Drag Race, and has accumulated over 1.8 million Instagram followers as of June 2023.\nDiscography\nSingles\n{| class=\"wikitable\"\n|+\n!Year\n!Song\n! style=\"text-align: center;\" class=\"unsortable\"|\n|-\n|-\n|2016\n|\"Single\"\n| style=\"text-align: center;\" |\n|}\nFilmography\nMovies\n{| class=\"wikitable plainrowheaders sortable\"\n|-\n! scope=\"col\" | Year\n! scope=\"col\" | Title\n! scope=\"col\" | Role\n! scope=\"col\" | Notes\n! style=\"text-align: center;\" class=\"unsortable\"|\n|-\n|2016\n|Lipstick City\n|Chic\n|Short film by Shea Coulee\n| style=\"text-align: center;\" |\n|}\nTelevision\n{| class=\"wikitable plainrowheaders sortable\"\n|-\n! scope=\"col\" | Year\n! scope=\"col\" | Title\n! scope=\"col\" | Role\n! scope=\"col\" | Notes\n! style=\"text-align: center;\" class=\"unsortable\"|\n|-\n|2016\n|RuPaul's Drag Race (season 8)\n| rowspan=\"8\" |Herself\n|Contestant (Runner-Up)\n| rowspan=\"2\" style=\"text-align: center;\" |\n|-\n|2016\n|RuPaul's Drag Race: Untucked\n|9 episodes\n|-\n|2016\n|Gay for Play Game Show Starring RuPaul\n|1 episode\n|\n|-\n|2018\n|RuPaul's Drag Race (season 10)\n|Guest\n|\n|-\n|2018\n|RuPaul's Drag Race Holi-slay Spectacular\n|Contestant\n|style=\"text-align: center;\" |\n|-\n|2019\n|Glow Up: Britain's Next Make-Up Star\n|Guest Judge\n|style=\"text-align: center;\" |\n|-\n|2020\n|RuPaul's Celebrity Drag Race\n|RuPaul's Drag Race Spin-Off\n|style=\"text-align: center;\" |\n|-\n| 2023\n| Drag Me to Dinner\n| Hulu original\n|\n|}\nMusic videos\n{| class=\"wikitable\"\n!Year\n!Title\n!Artist\n|-\n|2016\n|\"Fantasy\"\n|Acid Betty\n|-\n|2016\n|The Realness\n|RuPaul\n|-\n|2016\n|Straight Outta Oz\n|Todrick Hall\n|-\n|2016\n|Expensive\n|Todrick Hall\n|-\n|2017\n|Me4U\n|Danny L Harle\n|-\n|2018\n|Pose\n|Naomi Smalls\n|}\nWeb series\n{| class=\"wikitable\"\n!Year\n!Title\n!Role\n!Notes\n!\n|-\n|2015\n|Cooking w/ Drag Queens\n|Herself\n|Guest\n| style=\"text-align: center;\" |\n|-\n|2016\n|Vanity Fair: 103 Years of Drag Queen Fashion\n|Herself\n|Vanity Fair video short\n| style=\"text-align: center;\" |\n|-\n|2016\n|Bobbin' Around\n|Herself\n|Guest\n| style=\"text-align: center;\" |\n|-\n|2016\n|Ring My Bell\n|Herself\n|Guest\n| style=\"text-align: center;\" |\n|-\n|2017\n|$tranger$ for Ca$h\n|Herself\n|Guest, with Milk\n| style=\"text-align: center;\" |\n|-\n|2017–2018\n|M.U.G.\n|Herself\n|Co-Host\n| style=\"text-align: center;\" |\n|-\n|2017\n|PMB\n|Herself\n|Guest\n| style=\"text-align: center;\" |\n|-\n|2018\n|Pardon My French Food\n|Herself\n|Recurring\n| style=\"text-align: center;\" |\n|-\n|2019\n|The Pit Stop''\n|Herself\n|Guest\n| style=\"text-align: center;\" |\n|-\n|2019–2020\n|Werq the World\n|Herself\n|World of Wonder exclusive\n| style=\"text-align: center;\" |\n|-\n|2019\n|Gaymer Guys\n|Herself\n|Guest\n| style=\"text-align: center;\" |\n|-\n|2019\n|Runway Rewind\n|Herself\n|Guest\n| style=\"text-align: center;\" |\n|-\n| 2022\n|Binge Queens\n| Herself\n| Guest, Produced by World of Wonder\n|\n|-\n| rowspan=\"4\" |2024\n|''Monét's Slumber Party''\n| Herself\n| Guest\n|style=\"text-align: center;\" |\n|}\nReferences\nExternal links\n* [https://kimchithequeen.com/ Official website]\n*"
    }
  ]
}