{
  "content": [
    {
      "type": "text",
      "text": "# King's Dutch Brigade\n\nThe Dutch Brigade, unofficially known as the '''King's Dutch Brigade', was a formation of the British Army raised on 21 October 1799 for service in the War of the Second Coalition. Drawing its ranks from Dutch States Army veterans and deserters from the army and navy of the Batavian Republic, including those who surrendered to the Royal Navy during the Vlieter incident, the brigade was initially garrisoned in the Isle of Wight and Lymington, Hampshire. It was stationed in Ireland in 1801 before being sent back to England and then to Jersey and Guernsey. The brigade was disbanded on 12 July 1802 under the terms of the Treaty of Amiens.\nBackground\nAfter the end of the Flanders campaign of the War of the First Coalition in 1795 and the collapse of the Allied resistance against French forces in early 1795, while the Batavian Republic replaced the Dutch Republic and stadtholder William V, Prince of Orange fled to England, together with his family and his sons, William, Hereditary Prince and Prince Frederick of Orange-Nassau, who had both commanded Dutch troops during the campaign, remnants of the States Army covered the retreat of the British and Hanoverian troops. These Dutch troops afterwards crossed into neutral Prussian territory, where they were disbanded. Meanwhile, Prince Frederick travelled to Osnabrück, where he attempted to form a force for an invasion of the Batavian Republic from Prussian territory.\nMany former officers and other ranks from the States Army joined him there in the spring of 1795 (though 21 battalions of the former States army, out of 96, were reformed to the nucleus of the new Batavian army). 839 States Army officers went to Osnabrück, though how many non-commissioned officers and other ranks went is unknown. However, Frederick William II of Prussia prohibited further recruitment in the summer of 1795 declaring that the Rassemblement'' was in contravention of the Convention of Basel, which had declared the neutralisation of North Germany. As a consequence, his troops went to Hanover. Many of the troops he had recruited went into British service at that time, as the British had been recruiting troops for service in the West Indies. The British offered half-pay to the former States Army officers who had assembled in Prussia after 12 January 1796.\nIn 1798, Dutch émigrés were formed into the 5th battalion of the British Army's 60th (Royal Americans) Regiment of Foot. This was the signal for the formation of more \"Dutch\" units in preparation for the Anglo-Russian invasion of Holland, which took place in the late summer of 1799. The Prussian king looked the other way while recruitment was going on in his territories. The invasion was ultimately unsuccessful, but the British netted an appreciable number of Batavian deserters, mutineers, and prisoners of war, who were taken along to Great Britain, during the retreat of the Allied troops after the Convention of Alkmaar. At the same time, the troops that had been recruited for British account in Germany to be part of a new Dutch army, were transported also to Great Britain, such as W.P. d’Auzon de Boisminart.\nHistory of the brigade\nThese troops were transported to the Isle of Wight, where the Hereditary Prince started organising a Brigade, consisting of 97 companies total:\n* 4 regiments of infantry, of 18 companies each;\n* 1 regiment of Jägers, also of 18 companies (based in Lymington);\n* a battalion of artillery, of 6 companies;\n* a pioneer company, plus an engineer detachment.\nThis brigade was commissioned on 21 October 1799 in the British army as the Dutch Brigade. The troops took an oath of allegiance, both to the British Crown, and to the stadtholder.  The officers likewise received two letters of commission, one in English signed be the Duke of York and another in Dutch signed by Prince Willem of Orange and Nassau. The former Dutch stadtholder was put in nominal supreme command (as Captain-General of the former States Army), but his son, the Hereditary Prince, was given actual command of the brigade. Former officers of the States Army were put in the staff of the brigade and at the head of the regiments and battalions. Among them were the Major-Generals Frederick Stamford (former tutor of the Hereditary Prince), Carel Bentinck, De Constant Villars, and H.W. van der Duyn, all formerly from the States Army. Below these titular colonels of regiments the actual troop commands were held by Lieutenant-Colonels Von Dopf, Von Schwartz, MacLeod, Von Schinne, Morack, and Sprecher von Bernegg; the Jägers were commanded by the Lieutenant-Colonel Von Heydt, and the artillery by Lieutenant-Colonel W. du Pont. Liaison for the British government was Colonel Sontag. The paymaster, who made all disbursements, was Colonel Van der Maasen. The brigade had a total strength of about 5,000 troops. The Hereditary Prince received an annual amount of £600, and each colonel received £500 annually for his regiment from the British government.\nEarly in 1800 it was decided that the Jäger Regiment would be fully re-equipped with rifles. In the June, an order was placed for 1,012 rifles to be made by the Hessen-Cassel gun maker, Andreas Herman Thornbeck; all deliveries were duly completed by October 1800.\nThe regiments received their Colours on 6 August 1800, after a review by the Hereditary Prince. Each regiment received both the King's Colours, and Regimental Colours after Dutch model (the old Prinsenvlag, emblazoned with the arms of the House of Orange-Nassau). Their uniform was also distinctive: nassau-blue for the infantry, and green, with black piping, for the Jägers.\nOn 15 November 1800 the engineers were absorbed into the artillery when the gunners of the ‘battalion guns’ were detached from the infantry and formed into a separate corps of four companies.\nOn 27 November 1800 there was a reorganisation in which the Flanker (Light Infantry) companies, of which each regiment had two, were reformed into two separate battalions of 4 companies each.\nThere was the possibility that the brigade would be sent to Portugal but on 9 December 1800, the infantry were put aboard transports and shipped to Cove in Ireland (the artillery remained in Lymington). In July and August 1800, the respective legislatures had passed Acts to unite the Kingdom of Ireland and Kingdom of Great Britain into the United Kingdom of Great Britain and Ireland with effect from 1 January 1801. Various regiments were posted to Ireland at this time in the expectation that this could cause some social unrest. However, the situation remained relatively quiet by Irish standards, and on 1 August 1801 the Brigade returned. This time, with a fear of possible French landings, the 1st, 2nd & 3rd Regiments, plus the two Flanker Battalions, were placed in encampments on Jersey and Guernsey in the Channel Islands; the 4th Regiment and the Jäger/Rifle Regiment went into special encampments on the Isle of Wight and were joined from Lymington by the Artillery companies who were in Newport. In the October these units were removed from the Isle of Wight and went back to Lymington.\nIn the Treaty of Amiens in which the British concluded peace with the First French Republic and the Batavian Republic, among others, it was agreed that the brigade would be disbanded. The final parade of the 4th Regiment, the Jägers and the Artillery Regiment was held in Lymington on 28 July, whilst those on the Channel Islands would have been held around the same time.  Within a couple of days the Rifle Regiment was the first to be transported to Texel in four British frigates, which then returned to collect the 4th Regiment and the Artillery. The other corps of the Dutch Brigade, namely, the 1st, 2nd and 3rd Regiments of Infantry and the two Flanker Battalions, which were stationed on the islands of Jersey and Guernsey, were shipped to Hellevoetsluis.\nAftermath\nThe officers who did not wish to take up other service, or return to the Netherlands, like Hendrik Detmers, were put on half-pay by the British. Most officers and men returned to the Batavian Republic, profiting from an amnesty which was agreed in the margin of the peace treaty. However, in some places, the amnesty does not appear to have been honoured and later many were arrested. Many of these troops were hired by the Batavian army for service in the Dutch colonies that had been returned under the provisions of the treaty. A smaller number of brigade troops went to the new Principality of Nassau-Orange-Fulda where they formed a company in the army of the new Prince (the former Hereditary Prince). This army was dissolved by the Capitulation of Erfurt (16 October 1806) the Prince was forced to sign, after he and his Prussian division had been taken prisoner by the French after the Battle of Jena–Auerstedt, whereby the Principality was dissolved, together with its army. The Dutch troops then went to the Kingdom of Holland where they were incorporated in its army.\nMost of the former personnel of the Dutch brigade left England after 1802. When the Dutch Départements of France (annexed since 1810) rose against the First French Empire in the Fall of 1813 and a provisional government was formed in The Hague which invited the former Hereditary Prince (Prince of Orange since the death of his father in 1806) to take charge of the liberated country. The Dutch Levy (also known as the Dutch Light Infantry Battalion) was authorised on 22 December 1813 and formed in Yarmouth, Isle of Wight under the command of Lieut-Col Willem Benjamin van Panhuys, from Dutch former prisoners of war still in England, although other recruits (including one Scotsman) were added as well. The battalion had been commissioned in the new Dutch army on 1 January 1814 as the 10th Line Infantry Battalion. It was meant to ‘palliate the present want of troops to garrison the Fortresses in Holland’. The unit received uniforms, arms and equipment and sailed for Hellevoetsluis shortly afterwards on 7 February; it arrived there on 27 March 1814. The battalion remained undermanned however, and the 181 NCO's and men were incorporated into the 2nd Line Infantry Battalion on 28 November that year.\nHistoriographical note\nHardly anybody remembers this Dutch Brigade nowadays. Its namesake, the Dutch Brigade, formed by the Kingdom of Holland to fight on the French side under general Chassé in the Peninsular War is actually better known. Nevertheless, the Brigade has some historiographical significance, if only in the controverse that has long surrounded the era of the Batavian Republic and the Kingdom of Holland, or what Orangist historians, both 19th century and modern, prefer to call the Franse tijd (\"French Era\") in Dutch history and historiography. Contemporary tempers clearly flared, as De Bas notes, when he writes that the Dutch daily newspaper Haagsche Courant called the troops of the Brigade lichtmissen (rakes), ploerten (cads), and \"...all kinds of deserters, among whom many Germans, but also many Dutchmen ... who emptied many a keg of Porter beer,\" though he adds that the newspaper admitted that they looked fine in their uniforms. Indeed, the Brigade was viewed with some trepidation in the Batavian Republic, because it was suspected that it was primarily intended to serve in a future invasion of the Netherlands, as indeed it was. The fact that \"Dutch soldiers\" in foreign service might again fight against their compatriots on Dutch soil (as in the Helder Expedition) could be expected to generate bad feelings. And such contemporary feelings toward the Brigade and its leadership could easily carry over into historiography.\nThis is something to consider when one reads different historical accounts of the period in question, especially if historical parallels are drawn, as they inevitably are, with other historical events. Captain Ringoir implicitly does this when at the end of his little monograph extensively cited above, he refers to the Dutch Brigade that was organised by the Dutch government-in-exile in British territory during the Second World War. Others make such comparisons explicitly. But this is very dangerous, as the analogies are mostly false: the First French Republic was not Nazi Germany; the Patriots were not the N.S.B; stadtholder William V was not Queen Wilhelmina; and the Hereditary Prince was not Prince Bernhard, the commander of the Dutch armed forces in exile; nor the Dutch Brigade the Princess Irene Brigade. All such easy analogies are false and misleading, as are the opposite comparisons of the Dutch Brigades (both \"French\" and \"British\") with the Dutch volunteers that enlisted in the Waffen-SS on the Eastern Front. One should be very careful to not even hint at such comparisons, as the British historian Simon Schama, an expert on the period of the Batavian Republic/\"French Era\" has pointed out, following the Dutch historian Pieter Geyl, who also warned against this fallacy.\nNotes and references"
    }
  ]
}