{
  "content": [
    {
      "type": "text",
      "text": "# King (automobile)\n\n| founder = Charles Brady King\n| defunct = 1923\n| hq_location_city = Detroit, Michigan\n| hq_location_country = United States\n| area_served =\n| key_people = Charles B. King, Artemus Ward, J. G. Bayerline, Charles A. Finnegan\n| products = Automobiles\n| production = 35,261\n| production_year = 1911-1923\n}}\nThe King was an American automobile built by the King Motor Car Company in Detroit, Michigan from 1911 to 1923, and in Buffalo, New York in 1923.\nHistory\nCharles Brady King built his first car in Detroit in 1896.  The original plan was to enter it in the November 1895 Chicago Times Herald auto race, but it was not completed in time.  King finished it on March 6, 1896, and it became the first gasoline automobile to be successfully driven on the streets of Detroit.  Henry Ford reportedly followed behind on a bicycle on the maiden voyage of the King.  The situation in 1896 Detroit was not nearly as pro-automobile as it would be a decade later. Discouraged, King dismantled his car and sold the chassis to Byron Carter of future Cartercar fame.\nKing worked for various other car companies before creating another car in 1910 and establishing the King Motor Car Company in February of the following year. The new King car incorporated a number of advanced features, such as a Gray Motors engine cast en bloc, cantilever springs, left-hand drive, and a centrally-located gearshift. Possibly its most advanced feature was its lubrication system in which the flywheel served as a form of oil pump.\nThe first factory was rented and located at 1559 West Jefferson, but soon outgrew the space and moved into the former Hupmobile plant at Jefferson and Concord in early 1912. Just a few months later, the firm was in receivership, possibly from over-expansion.  The company was bought by chewing gum magnate Artemas Ward from New York City in 1912 for $40,000.  He put automobile executive J. G. Bayerline in the president position. Two years later there was a disagreement between the two men and Ward replaced Bayerline in the presidency of the company.\nIn December 1914, a V8 engine was introduced in the King, a scant two months after Cadillac announced its own V8-powered car. Starting in 1916, all Kings were 8-cylinder models. Production declined from a peak of 3,000 in 1916 to a company low of 240 in 1923. During the healthier years, the company exported cars to Europe, Australia, South America, South Africa, and Russia.  Early 4-cylinder cars were medium-priced at $1,350 in basic form, and for $1,565 when fully equipped with windshield, hood, and gas lamps. By 1914, even the V8-powered car was only $1,350, and was advertised as the \"World's First Popular-Priced V8\".  By 1923, prices were $1,795–$2,550.\nDecline\nIn the fall of 1920, with the Depression of 1920–1921, Artemas Ward and other company directors petitioned to have the company dissolved, citing not enough working capital and a failure to secure loans from banks. The auto press said it was due to inefficient management. Early the next year, Charles A. Finnegan of Buffalo bought the company for $500,000 and assumed company debts of approximately double that.  The debt was paid off by late 1922 and the receivership was terminated. In October 1923, the firm moved to a much smaller Buffalo factory, but was bankrupt and finished by early 1924. While in bankruptcy hearings, remaining bodies and parts were shipped to England. There, 100 additional Kings were assembled in 1925.\nReferences"
    }
  ]
}