{
  "content": [
    {
      "type": "text",
      "text": "# Kingpin (Matt Murdock)\n\n| image          = File:Matt Murderdock.jpg\n| converted      = y\n| caption        = Textless cover of Spider-Gwen vol. 2 #28 (January 2018). Art by Robbi Rodriguez.\n| publisher      = Marvel Comics\n| debut          = Edge of Spider-Verse #2 (September 2014)\n| creators       =\n| alter_ego      = Matthew Michael Murdock\n| homeworld      = Queens, New York City, Earth-65\n| aliases        = Matt Murderdock, Western Sun of the Hand, Daredevil\n| species        = Human mutate\n| alliances      =\n| partners       =\n| powers         =\n* Superhuman senses\n** Echolocation\n** Radar-sense\n* Skilled acrobat, martial artist, and stick-fighter\n* Concealed cane sword disguised as a walking stick\n* Criminal mastermind/tactician\n* Peak-human strength and durability\n* Use of inter-dimensional travel\n| cat            = super\n| subcat         = Marvel Comics\n| hero           =\n| villain        = y\n| sortkey        = Kingpin\n}}\nThe Kingpin (Matthew Michael Murdock) is a supervillain appearing in American comic books published by Marvel Comics. He was created by Jason Latour and Robbi Rodriguez. The character debuted in Edge of Spider-Verse issue #2 as part of the 2014–15 \"Spider-Verse\" comic book storyline as the archenemy of Gwen Stacy/Spider-Woman, continuing into the ongoing series Spider-Gwen that began in 2015. The \"Kingpin\" name is a reference to the crime lord title in Mafia slang nomenclature.\nMurdock is a variant of Kingpin and an alternate-universe version of Matt Murdock/Daredevil. He lives on Earth-65, where Murdock's origin is the same as his Earth-616 counterpart, being blinded as a child before being trained by the similarly blinded Stick to hone his consequentially acquired physical abilities and superhuman senses following his father Jack's murder, diverging when Stick is also killed by ninjas working for the Hand, whom Murdock then kills. Impressed by his abilities, the Hand recruits Murdock to become an assassin in Japan, where he rises through their ranks before being sent back to New York City, receiving a law degree and rising to become the head of organized crime. After his designated patsy and best friend Wilson Fisk is falsely arrested by George Stacy as the Kingpin, Murdock has a midlife crisis and considers suicide before sensing a kindred spirit in passing superhero (and wanted murderer) Spider-Woman, and electing to attempt to mold her into his apprentice, personal enforcer, and eventual successor. Murdock also becomes romantically involved with S.I.L.K. CEO Cindy Moon, the billionaire responsible for Spider-Woman's powers.\nA young version of the character makes a silent cameo appearance in the 2018 animated feature film Spider-Man: Into the Spider-Verse.\nPublication history\nIn the primary continuity of the comic books constituting the Marvel Universe, blind lawyer Matt Murdock is the superhero Daredevil, whose archenemy is the crime lord Kingpin. This primary version of Matt Murdock was introduced in Daredevil #1 (April 1964). The concept of an alternate-universe, supervillain Matt Murdock-incarnation of Kingpin was first conceptualised by Jason Latour, after he was approached by Spider-Man editor Nick Lowe on request of writer Dan Slott to write a stand-alone issue for the 2014–15 \"Spider-Verse\" event, following a similarly alternate-universe superhero \"spider-powered Gwen Stacy\", conceiving of Murdock as their nemesis, with Robbi Rodriguez approached to design Murdock and the title character. The character debuted in Edge of Spider-Verse #2 on September 17, 2014.\nIn October 2014, Nick Lowe announced at New York Comic Con 2014 that a Spider-Gwen ongoing series would be released, retaining Murdock as its main antagonist. Murdock was then featured as the joint main antagonist (along with billionaire S.I.L.K. CEO Cindy Moon) of the multi-part crossover Spider-Women, commencing with Spider-Women Alpha #1 and ending with Spider-Women Omega #1, with certain issues of Spider-Woman, Silk and Spider-Gwen partially depicting the storyline in between.\nFictional character biography\nEarly life and rise to power\nBorn to workman Jack Murdock and paralegal/actress Maggie Murdock, young Matt Murdock is accompanying his mother home from rehearsals for her new play when the two are involved in a truck accident, leaving Maggie comatose and blinding Matt, who finds that his remaining senses have been enhanced to superhuman levels by the chemicals which blinded him. To pay their medical bills, Jack becomes a professional boxer, working up his way through their ranks until discovering that his fights had been rigged by the crime boss Silvermane. While initially agreeing to lose the championship match in exchange for a payoff, driven by pride and frustration, Jack instead knocks out his opponent, winning. While Jack out celebrating with Matt, Silverman sends his men to kill them in revenge, killing Jack in front of Matt before Matt is saved by the vigilante Stick. Recognizing his abilities, Stick takes Matt under his wing to take on New York's criminal syndicates. After Stick is killed by ninja employed by Silvermane on loan from the Hand, Matt kills those personally responsible before submitting in defeat to their brethren. Impressed by his skill, the Hand decides to recruit Matt, bringing him to Japan to train him as an assassin, where he becomes a citizen.\nAfter many years rising through the ranks of the Hand a feared assassin, dubbed a \"daredevil\" for his red suit and mask, Matt returns to New York on the orders, completing a law degree at Empire State University, before entering the employ of local crime boss Wilson Fisk, killing international burglar Le Chat Noir, who had stolen Fisk's first dollar. Upon graduation from university, Matt becomes Fisk's official chief advisor and personal counsel, forming a successful law firm and simultaneously taking over the criminal underworld as the Kingpin of Crime, with Fisk serving as a puppet ruler on Matt's behalf.\nEdge of Spider-Verse\nAfter Fisk is arrested as the Kingpin by NYPD Captain George Stacy as Matt's designated patsy, Matt continues running the syndicate and his law firm himself. Suffering from a midlife crisis as a result of growing bored with his absolute power and personal moral corruption, Matt decides to commit suicide. However, upon seeing the vigilante Spider-Woman (Gwen Stacy) pass by, Matt senses with his enhanced senses that she is a \"kindred spirit\" to himself, and decides to delay killing himself until he can earn her favor, and mold her into his new apprentice, personal enforcer, and eventual successor as Kingpin. Obligated to avenge Fisk's imprisonment and help out Spider-Woman, Matt decides to order Captain Stacy (who had been hunting Spider-Woman for the murder of Peter Parker) to be assassinated by the Rhino, only to be surprised when she rescues him instead, both unaware that Spider-Woman is Stacy's daughter Gwen, revealing her identity to her father upon rescuing him.\nSpider-Gwen\nSuspecting a connection between Spider-Woman and Captain Stacy due to both of their apparently contradictory actions: Spider-Woman saving Stacy and subsequently reversing his public stance on her actions, eventually leading to his arrest, Matt's orders the Vulture captured after fighting Spider-Woman, before sending him to verify her true identity. After Spider-Woman defeats the Vulture, Matt's law firm represents him to ensure that he does not reveal her identity.\nRecruiting Spider-Woman\nSometime later, Le Chat Noir's daughter and \"Black Cats\" lead singer Felicia Hardy steals Fisk's first dollar from Matt again, luring him into a public confrontation at Madison Square Garden to avenge her father's death, having her men confront Matt's men while she personally fights Matt, almost killing him before an intervening Spider-Woman punches her in the face, saving Matt's life. Impressed, Matt formally introduces himself as the Kingpin and offers Spider-Woman a place in his organization. Rebuking his offer, Spider-Woman flees the scene ahead of the arriving police, as Matt promises to see her again.\nConfronting the recently arrested Captain Stacy with his knowledge of his daughter being Spider-Woman, Matt asks for his blessing to take her in as his new pupil, in exchange both for offering him his law firm's assistance in his defense, and having his NYPD successor Captain Frank Castle assassinated, a rogue police officer on the verge of killing Spider-Woman. After Stacy refuses Matt's deal, Matt flippantly calls off his assassins, who were already attacking Castle, before contacting Spider-Woman directly and offering to work to free her father in exchange for her agreeing to work for him whenever he needs her to, with Spider-Woman taking the deal, offering Matt her services. After Stacy had been arrested for false charges, Murdock approached Gwen and offered her a deal: He would work to free George if she promised that she would work for him. Gwen took the deal, and Murdock offered his service, along with Spider-Woman offering hers to him.\nAfter Spider-Woman subsequently retires from crime-fighting and returned to her civilian identity of Gwen Stacy, purportedly to avoid having to following Matt's commands, but in actuality due to having lost her powers (simulating them with \"power-ups\" and her web-shooters) and not wanting Matt to know about it, Matt breaks into a secret S.H.I.E.L.D. prison to visit his girlfriend Cindy Moon, the billionaire CEO of S.I.L.K. After prompting Gwen to be led into an ambush, injuring her and destroying her power-ups and web-shooters, Matt reveals his presence and his knowledge of her lost powers, having been informed by Cindy, who had designed the spider which had given her superpowers. Offering her a surplus of \"radioactive spider isotopes\" in exchange for her servitude, which would allow Gwen to become Spider-Woman again, Matt convinces her to join him.\nCreating Venom\nTo prove her loyalty to him, Matt orders Spider-Woman to kill rogue S.I.L.K. agent and crime boss Jefferson \"Scorpion\" Davis and bring him his head, an order which she refuses. Disappointed that Spider-Woman had not honored their deal, Matt nonetheless has her come with him to Oscorp to give her an alternate order: capture her former friend and Spider-Woman-hunter Harry Osborn / The Lizard in Madripoor to transform the Lizard formula in his blood into the Venom symbiote using Moon's isotopes, which will only allow Gwen to become Spider-Woman again when combined, which Matt hopes to use to corrupt her to his thinking. After Spider-Woman refuses to hand Harry over to Matt upon finding him, he has the Rhino beat her father to near-death in his prison cell, rending him comatose, before confronting her himself in Madripoor. As the symbiote envelops Gwen, Matt mocks her for not accepting his help, before being left incredulous by her being able to resist its bloodlust, which she explains to be due to her music, Matt having earlier mentioned the symbiote to be weak to sound. As Spider-Woman grabs him by the throat, an impressed Matt reveals he had stolen her portal-watch, allowing him access to the Spider-Verse, which he uses to open a portal to her father's hospital room and reveal him in his comatose state. Explaining his condition as a consequence of her actions, Matt convinces Spider-Woman to let him go, and she flees.\nLater, as the Rhino attempt to blackmail Matt to protect him with threats of revealing he is the real Kingpin of Crime unless he pays him hush money, Matt laughs and tells him that his days are numbered due to his assault of Stacy, and there is nothing even the Kingpin can do to protect him from her wrath, and that his own fall is also imminent. Annoyed by his blackmail attempt, Matt has Rhino's location (in Jack's Pub) leaked to Spider-Woman and the NYPD, buying Rhino and a drunk drinks before leaving via a portal as Spider-Woman enters the scene to enact her revenge.\nTo tie up further loose ends following the Rhino's death, Matt has the police officer who allowed Stacy's beating captured and tortured for his role in allowing the Rhino to attack Captain Stacy. Keeping him pinned to a chair with a katana, slowly dying in his apartment, Matt explains his understanding of \"the burden of knowledge and the inner war between the artiste and the entertainer\", informing him that he will serve as a \"priest\" he must confess to, elaborating upon his personal origins and obsession with Spider-Woman, wishing to teach her the lesson that \"absolute power corrupts absolutely\". Slitting the officer's throat, Matt thanks him for listening before cleaning his blade and turning to look out across the night sky, contemplating his portal-watch. Hearing screams outside, Matt learns that a rogue Frank Castle has been murdering his minions, and readies his ninja for war. Matt decides to face Castle himself, and reveal himself as the Kingpin (against the wishes of Hand representative Otomo) only to be intercepted by Spider-Woman, who tells him she will not allow him an \"easy death\" at Castle's hands, and wants to kill him herself. With a response of \"Attagirl\", Matt draws his katana and cuts through her webs, dropping back down to the roof and informing her that an \"easy death\" is the last thing he wants. As the pair battle, Captain America (Samantha T. Wilson) suddenly shows up and punches (and kicks) Matt in the face, telling Spider-Woman that she is aware of his crimes and will arrest him. However, Spider-Woman instead breaks Captain America's arm and knocks her out, before picking up Matt by the throat and telling him to \"shut up and die.\" Satisfied that he has finally taught her the meaning of \"true power\" and that he can die knowing he is not alone, Spider-Woman decides to keep him alive to spite him, tossing Matt aside. Sometime later, Matt is confronted by Captain America while moving out of his penthouse suite, professing ignorance of his supposed position as Kingpin, and calling her bluff as to S.H.I.E.L.D. having no evidence of his membership with the Hand, before \"pondering\" where Spider-Woman could have gone.\nWar with the Hand\nSometime later, on conference call with the leaders of the Hand, Matt openly defies them after they berate him for putting them at risk of exposure through his public conflicts, before preparing to face the ninja they will send to assassinate him. Sometime later still, Matt, covered in cuts and stabbed in the gut by a katana, slowly bleeding out, cuts down such a squad of ninja sent to assassinate him. As Spider-Woman arrives on the scene, mocking the fall of his criminal empire, both comment on their obsessions with each other. Matt pulls the sword from his abdomen and points out that he could have left at any point in time with the portal-watch, but stayed to teach her how power corrupts. Gwen then mocks Matt for lying to himself and secretly wanting to be stopped, for being so bored and empty that only other people's misery is interesting, and for thinking himself caged when he's the freest person in the world. Enraged, Murdock attacks her, but Gwen activates music loud enough to incapacitate him and remove her symbiote from her body.\nNoting his perceived terror at being so overwhelmed and drowned out, Spider-Woman tells Matt that knowing sound was the symbiote's weakness also displayed it at is own, and that on some level he wanted her to figure that out and stop him. Turning off the music, Gwen states that the world now knows the truth about the both of them, and that her love for her friends was what helped her truly tame the symbiote, transforming it into a replica of her original costume. Asking Matt for a reason not to kill him, brandishing her arm as a claw, Matt informs him that he will never surrender to either her or the Hand, telling her to kill him or he will never stop tormenting her. Unceremoniously taking back her portal-watch, Gwen tells Matt that he has picked his fate before leaving him to wait for ninja to arrive and end his life. Years later, Gwen references Matt having killed all the assassins the Hand had sent, before surrendering himself to S.H.I.E.L.D. custody.\nIn other media\n* A young Matt Murdock makes a non-speaking cameo appearance in Spider-Man: Into the Spider-Verse as the adopted son of Kingpin in Gwen Stacy's home dimension.\nReception\nScreen Rant praised Kingpin Matt Murdock as \"one of the most fascinating\" variants of the character in Marvel Comics, while Escapist Magazine lauded him as \"easily the most unsettling remix of the cast [of Spider-Gwen], standing as the new Kingpin of Crime while displaying an inherent atheistic nihilism to the world that merges with his traditional origins to present a chilling figure brimming with malice\", with Comic Book Resources additionally expressing further interest in the character being included in the upcoming films Spider-Man: Across the Spider-Verse and Part II following the character's cameo appearances in Into the Spider-Verse.\nReferences\nExternal links\n* Kingpin (Matt Murdock) at Marvel Wiki"
    }
  ]
}