{
  "content": [
    {
      "type": "text",
      "text": "# King George V Coronation Medal\n\nThe King George V Coronation Medal was a commemorative medal instituted in 1911 to celebrate the coronation of King George V, that took place on 22 June 1911.\nAward\nIt was the first British Royal commemorative medal to be awarded to people who were not in attendance at the coronation and, as well of those involved in the ceremony, it was given to selected dignitaries, officials and members of the armed forces, both in Britain and across the Empire.\nOn 30 June 1911 a special ceremony was held in the grounds of Buckingham Palace for King George V to present medals to all members of the Colonial and Indian contingents who had represented the overseas troops in the Coronation procession. The ceremony lasted two hours, medals being handed by the King to each of the 300 recipients present.\nFor this and subsequent Coronation and Jubilee medals until 1977, the practice was that the United Kingdom authorities decided on a total number to be produced, then allocated a proportion to each of the colonies, the Crown dependencies and the Commonwealth countries. The award of the medals was then at the discretion of the local government authority, who were free to decide who would be awarded a medal and why.\nA total of 15,901 medals were awarded, including 286 to Australians.\nThe medal was worn on the left breast with other coronation and jubilee medals. These were worn before campaign medals until November 1918, after which the order of wear was changed, with such commemorative medals now worn after campaign medals and before long service awards. Ladies could wear the medal near their left shoulder with the ribbon tied in the form of a bow.\nRecipients who were also eligible for the 1911 Delhi Durbar Medal received the Coronation medal only, and wore a crowned clasp inscribed 'DELHI' on the ribbon.\nIn addition, a Police Coronation Medal, of a different design and ribbon, was awarded to police officers on duty during the official Coronation celebrations.\nDescription\n* The medal was designed by the Australian sculptor Bertram Mackennal.\n* All awards were in silver, the medal being  in diameter.\n* The obverse has a profile of King George V and his wife Queen Mary in coronation robes, facing left.\n* The reverse has the crowned Royal Cypher above the date of the coronation, 22 June 1911.\n* The  wide ribbon is dark blue with two thin red stripes in its centre. Awards to ladies have the ribbon in the form of a bow.\n** The ribbon for the police version of the medal is red with three narrow blue stripes.\n* The medal was awarded unnamed.\nReferences\nExternal links\n*[http://www.medals.org.uk/united-kingdom/united-kingdom-ribbons6.htm ODM of the United Kingdom - ribbon chart]\n*[https://web.archive.org/web/20160314101242/http://stephen-stratford.co.uk/coronation.htm Coronation medals]"
    }
  ]
}