{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom (comics)\n\nKingdom is a science fiction comic series created by Dan Abnett and Richard Elson, published in the British comic anthology 2000 AD starting in 2006.\nThe story revolves around a humanoid genetically modified dog named after Gene Hackman, in the distant future. Earth has been overrun by giant insects, known simply as \"Them\". Most of the human race has been wiped out, and the few thousand survivors are waiting in suspended animation until the world is habitable again. The world is patrolled by dog soldiers called \"auxes,\" such as Gene, who fight Them on humanity's behalf.\nPlot\nFirst series\nAt the beginning of the series, Gene the Hackman is the leader of his pack, patrolling Antarctica (which they call \"Anarchticy\", the name having been corrupted over the centuries). They follow the orders of voices in their heads known as the urgings, which are transmitted to them by their \"Masters\" (who are never seen in the series). On the coast, Gene and his pack encounter a mysterious \"land bridge\" which leads into the sea and beyond the horizon. They conclude that \"Them\" from another continent created the bridge to invade Antarctica. The urgings stop, something which has never happened before, and so the pack debate whether to return home to report their discovery or continue their patrol (which has already lasted for an unprecedented length of time). Some of the pack desert Gene, and those who remain with him are all killed in action. Gene alone survives, with crippling injuries, and finds refuge in a mysterious building.\nThe building turns out to be an ancient outpost, built nearly two thousand years ago by humans. It is run automatically by an advanced computer, and contains a human operative in suspended animation, who is awoken by the computer on Gene's arrival. Gene has never seen a human before – it is revealed that what he thinks are the Masters are not actually humans but merely robots which run everything while the humans sleep – so he is initially sceptical that this human, who he regards as weak and sickly, could be a Master. But when Gene's injuries are rapidly healed with advanced medical technology he hasn't seen before, he accepts the possibility that there might be more to the human than meets the eye.\nThe outpost is attacked by overwhelming numbers of Them, and despite the advanced weaponry available there, Gene is only saved by the timely arrival of another pack. The human does not survive, and the new pack does not believe Gene's story. The story ends as Gene heads alone out of Antarctica over the land bridge.\nSecond series: \"The Promised Land\"\nGene has arrived in Tasmania, and finds it to be overrun with new species of Them he hasn't seen before. They are larger than the ones he was used to fighting at home. But many of them have been incapacitated by parasites, \"ticks\", gruesome bulbous creatures covered with teeth which attach themselves to the giant insects' bodies. Gene himself is attacked by dozens of these ticks in a swamp, and only just manages to fight them off.\nShortly after recovering from this attack, Gene begins to hear the urgings again, for the first time since discovering the land bridge. The urgings lead Gene to discover a small farm run by a community of humans. The farm is surrounded by a fence to keep Them out, but Gene manages to get inside. Once in the farm, Gene befriends a young girl, called Leezee Sower, who introduces him to her father. The adults accept Gene, recognising that his combat abilities will be useful in defending the farm against Them, who have recently been attacking with greater frequency and ferocity than before.\nGene enjoys living on the farm, but becomes suspicious about the fact that he is being fed meat, given that there are no animals on the farm. He is told that the meat is being grown artificially in a large warehouse, but it is out of bounds and he is strictly forbidden to enter it. Defying the rules of the farmers and the admonitions of the urgings, Gene investigates anyway. He is horrified to discover that the warehouse is infested with ticks. The farmers arrive and arrest him for uncovering their secret, and Gene learns that each of the farmers is infected with a tick, even Leezee Sower. Gene insists that the ticks must be destroyed, as their presence on the farm is evidently the reason why Them are attacking it. But the humans refuse. They regard the ticks as normal, even desirable, and they are unconcerned about being infected. Leezee points out to Gene that he is also infected, and Gene realises that he has had a tick attached to him since the attack in the swamp. The voices he has heard in his head since then are not really the urgings of the Masters, but the telepathic thoughts of the tick as it tries to control him. Gene kills his tick, but the experience is so agonisingly painful that he almost does not survive.\nThat night, Them attack and overwhelm the farm, killing everyone. Gene manages to rescue Leezee and they escape into the wilderness, the only survivors. Leezee begs Gene to let her return to the farm, but Gene recognises that this isn't really her own desire but her tick's, as it controls her. He leads her farther away from the farm.\nGene tries to kill Leezee's tick, but the tick tells him that Leezee would not survive the separation. Gene reluctantly abandons the attempt for the time being, intending to search for someone intelligent enough to figure out how to detach or kill the tick without also killing its host.\nThird series: \"Call of the Wild\"\nGene and Leezee reach Sydney, which is in ruins. They discover a new pack of auxes, but these ones are not pure-breeds like Gene. They have been breeding wild for centuries, and so the gene pool has diversified. Most of the pack welcome Gene, and one female pack member in particular, called Clara Bow, is especially fond of him. But there is one male, called Dingo Star, who resents Gene as he sees him as a rival to his own status within the pack.\nThe pack turns out to be just one of many packs, which all belong to a kingdom run by an aux of greater than normal intelligence, called Rex Horizon. Rex has a pet human, who he keeps in a cage, and it transpires that the auxes all think that Leezee is Gene's pet, since they had no prior knowledge of humans. Rex's pet, Paul Numan, tells Gene that three years ago he was in suspended animation on a space station in orbit around the Earth. He was awoken and sent down to Sydney to investigate some unexplained electrical activity, which turned out to be the result of Rex having discovered how to make the old machines work again. He offers to take Leezee to safety up on the station, if Gene will rescue him. But Gene is now loyal to the Wild Kingdom he has just joined, instead of to his old Masters, and he refuses to help.\nThe Wild Kingdom suddenly finds that it is being attacked by Them more frequently than ever before, and by Them of increasing size. Numan realises it is because they can detect the scent of Leezee's tick parasite, which is deadly to Them, and they want to destroy it. Rex orders Dingo to abduct Leezee and chain her up outside where Them will find her, so that Them will leave the Kingdom alone. Rex tells Gene that his pet ran away, but Gene knows this is a lie, since he alone understands that Leezee is not his pet. Gene releases Numan from his cage, and enlists him to help find Leezee and take her to the orbiting station. Dingo interrupts the rescue, and a brutal fight ensues, in which Gene kills Dingo. Gene's pack hunts him down as a wanted murderer.\nGene and Numan find Leezee and save her from Them in the nick of time. Numan summons a ship to collect him and Leezee and take them to the orbiting station. But they are forced to leave Gene behind when he is captured by his pack. Gene only survives because of the intervention of Clara Bow, and the pack allow him to escape, realising that by removing the tick from the Wild Kingdom he may have saved them all from destruction. Gene sets out across Australia on his own.\nFourth series: \"His Master's Voice\"\nClara Bow catches up with Gene and tells him that she would rather stay with him than live in the Wild Kingdom. Together they discover a base run by robots, where an elderly and insane human general has awoken from suspended animation. A series of flashbacks throughout the story show the general as a young captain in New Mexico, six years before the last human survivors entered suspended animation. He was the leader of the project which created the first dog soldiers, the ancestors of Gene Hackman.\nThe general detains them, intending to harvest Gene's body for DNA with which to make a new army of thousands of auxes like him (a process which will be fatal to Gene). Clara Bow is held as a  hostage, along with some other aux captives whose DNA is not pure enough for the general's purposes. Gene resists at first, but surrenders when the general threatens to kill the hostages if he does not submit. Luring the mad general into a false sense of security, Gene kills him, and the robots deactivate. Gene, Clara Bow and the other hostages leave the base together.\nFifth series: \"Aux Drift\"\nGene and his new pack discover Aux Drift, a mining outpost where humans and auxes work together. These humans are not \"Masters,\" and they explain that that term only refers to the elite humans who could afford to enter suspended animation when the world was overrun by Them. The humans who could not afford to hide in suspended animation were simply abandoned to fend for themselves.\nAux Drift is attacked by a swarm of Them which display more intelligence than usual. Gene discovers that they are being controlled by a giant Them, one bigger than any that has ever been seen before. The miners teach him how to use explosives, and he kills the giant insect by blowing it up. Aux Drift is abandoned, and the miners take Gene's pack back home to their city, which they call the Kingdom.\nSixth series: \"Beast of Eden\"\nBy the start of this story, Gene and Clara Bow have produced two sons, and Gene is recognised as the toughest soldier in the Kingdom. The Kingdom is attacked by a larger army of Them than anyone has seen before. This super-swarm is controlled by another king Them, like the one at Aux Drift, and so Gene leads a mission to kill it. He leaves Clara behind to protect their sons.\nDuring Gene's mission, his pack encounters Numan, who has returned to Earth to investigate whether the Masters' new plan to defeat Them is working. After the king has been killed, Numan reveals that the Masters took the tick parasite from Leezee Sower and used it to create a biological weapon to infect and destroy Them. Numan discovers that Them perceive the ticks as a greater threat than the humans or the auxes, but realises that Them are evolving rapidly to counter the ticks, which is the reason that intelligent Them kings now exist. Gene is furious and he attacks Numan, but Numan's bodyguard, an aux called Major Canis, stops him. Numan takes Gene (and the only two surviving members of his pack) back to the Masters' space station in orbit.\nSeventh series: \"As it is in Heaven\"\nIt is six months after Gene arrived on the station. The Kingdom has been destroyed by Them. Gene and his friends have been put into suspended animation to keep him out of the way, because the Masters consider them a liability. The Masters decide that this is no longer a good use of their resources, so they decide to euthanise Gene and his pack in their sleep.\nLeezee Sower, now an adult, decides to save Gene instead. She wakes him and they flee, killing two aux in the process. In a bid to force Gene to surrender, Major Canis wakes Gene's two friends from suspended animation and takes them hostage, threatening to kill them if Gene does not submit. Gene attempts a rescue, but he fails and both his friends are killed. Gene turns against the Masters and vows never to obey or help them again, apart from Sower.\nGene and Sower escape into an abandoned part of the space station, where they encounter Pause, a renegade aux who has turned against the Masters. Pause is able to hack into the station's computer systems without the Masters knowing. He recruits Gene and Sower to help him steal the codes which control the Masters' new weapon, the ticks. The Masters' plan is to use the ticks to destroy Them, and then activate a faulty gene they have bred into the ticks which will kill them all, leaving Earth fit for human habitation again.\nGene steals the codes, but while hiding from Major Canis he discovers the laboratory where the ticks are being bred. There he discovers the real Leezee Sower, who has become a hideously deformed hybrid, part human, part giant tick. The original Sower explains that the other Leezee Sower who Gene has been with on the station is a clone. The scientists had been unable to remove the tick from Sower, so instead they had kept her in the lab, and created the clone through which she could live a normal life, since the original can see what the clone sees and can control her.\nMajor Canis and Numan discover Gene in the lab, and demand that he hand over the codes. The giant tick, controlling Sower's voice, demands the codes so that its species won't be destroyed. Not willing to help either side, Gene instead attacks everybody. He kills the original Leezee Sower and wounds Numan and Canis. He escapes from the station with the Sower clone, Pause and the codes, to return to the Kingdom and his family – not knowing that the Kingdom has been destroyed.\nEighth series: \"Alpha and Omega\"\nGene's shuttle crash lands in Patagonia, pursued by a squad of auxes led by Canis and Numan. They encounter an unprecedented phenomenon: auxes and humans riding Them as steeds. This new force captures Gene, but Pause and Leezee Sower escape.\nGene learns that the Them-riders are infected with ticks; not the weaponised ones genetically engineered by the masters but natural ticks which evolved at an accelerated rate. The influence of these ticks enables the humans and auxes to work together as equals, and they refer to themselves as \"Us.\" Us invite Gene to join them, but he does not trust the ticks, and so he refuses.\nCanis's squad attacks Us, but is repulsed and Numan is captured. Numan is forcibly infected with a tick, making him one of Us. He tells Us about the codes Gene stole from the masters, and they search Gene but fail to find the codes. They threaten Gene, but are suddenly attacked again by Canis.\nMeanwhile, Pause has requested a nuclear strike by imitating Canis's voice in a radio message to the orbiting satellite. During the chaos caused by the blast, Gene escapes from Us, and Canis is killed by Pause and Leezee. Gene discloses that he gave the codes to Leezee, who has had them ever since they landed.\nThe masters in the space station believe Gene and the codes to have been destroyed in the nuclear explosion, and so they begin working to recreate the codes from scratch, a process that will take years.\nMeanwhile Us, now led by Numan, are ambushed by a new humanoid form of Them, which have also evolved at a highly accelerated rate in an arms race with the ticks. This new form of Them tells Numan, in English, that his species is finished, and then kills him.\nCharacters\n* Gene Hackman\n* \"Them,\" as Gene and the others label them, are a highly evolved type of insect that was possibly created sometime in the early 21st century, either purposefully or unintentionally. Quickly overpowering humanity, they established themselves as the dominant life form on Earth. As a result, the few remaining humans left retreated to the Antarctic and built machines to protect themselves.\n* Leezee Sower (from the second series), a human girl who Gene takes under his protection. (In the seventh series she is an adult.)\n* Clara Bow (from the third series), a female aux who becomes Gene's mate.\n* Paul Numan (from the third series), a human scientist from a space station in orbit.\n* Major Canis, an aux soldier from the orbiting station.\nBibliography\nAll of the stories are written by Dan Abnett and illustrated by Richard Elson.\n* \"Kingdom\" (in 2000 AD, Prog 2007 and #1518–1525, 2006–2007)\n* \"The Promised Land\" (in 2000 AD, Prog 2008 and #1567–1576, 2007–2008\n* \"Call of the Wild\" (in 2000 AD #1650–1661, 2009)\n* \"His Master's Voice\" (in 2000 AD Prog 2011 and #1715–1725, 2011)\n* \"Aux Drift\" (in 2000 AD #1900–1909, 2015)\n* \"Beast of Eden\"  (in 2000 AD #1961–1972, 2016)\n* \"As it is in Heaven\" (in 2000 AD #2011–2022, 2017)\n* \"Alpha and Omega\" (in 2000 AD #2100–2110, 2018)\n* \"Shako's Kingdom\" (prequel in 2000 AD Sci-Fi Special, 2020)\nNovel\n* Fiefdom by Dan Abnett and Nik Vincent, 2014\nTrade paperbacks\n* Kingdom: The Promised Land trade paperback, 144 pages, Rebellion Developments, December 2008, , Simon & Schuster, June 2011,  (collects the first two series)\n* Kingdom: Call of the Wild, 144 pages, Rebellion Developments, March 2012,  (collects \"Call of the Wild\" and \"His Master's Voice\")\n* Kingdom: Aux Drift, 144 pages, 2000 AD, March 2017,  (collects \"Aux Drift\" and \"Beast of Eden\")\n* Kingdom: Alpha and Omega, 144 pages, 2000 AD, February 2020,  (collects \"As it is in Heaven\" and \"Alpha and Omega\")\nThe series was collected in three volumes of 2000 AD: The Ultimate Collection in 2017, 2018 and 2023.\nReferences\n*[http://www.2000ad.org/?zone=thrill&page=profiles&choice=KINGDOM Kingdom] at 2000 AD online\n*\nExternal links\n*[https://web.archive.org/web/20081221094319/http://www.brokenfrontier.com/lowdown/details.php?id=1618 Gene The Hackman is Tougher than Tough], Broken Frontier, December 19, 2008"
    }
  ]
}