{
  "content": [
    {
      "type": "text",
      "text": "# Kingfish in Concert: King Biscuit Flower Hour\n\n}}\nKingfish in Concert: King Biscuit Flower Hour is a live album by the rock group Kingfish.  It was recorded at the Beacon Theatre in New York City on April 3, 1976, and released in 1996.  Part of the recording that became the album was originally broadcast on the radio show The King Biscuit Flower Hour.\nThe Beacon Theatre concert\nAt the time of the Beacon Theatre concert, Kingfish had its \"classic\" mid-70s lineup — Bob Weir of the Grateful Dead on guitar and vocals, Matthew Kelly on guitar, harmonica, and vocals, Dave Torbert, formerly of the New Riders of the Purple Sage, on bass and vocals, Robbie Hoddinott on lead guitar, and Chris Herold on drums.\nKingfish in Concert contains the song medley \"Lazy Lightning\" / \"Supplication\", written by Bob Weir and John Perry Barlow.  These songs became part of the Grateful Dead's repertoire two months later when, after a break of a year and a half, they resumed playing live concerts.  The album also features \"One More Saturday Night\", as well as several cover songs that are associated with the Dead — \"C.C. Rider\", \"New Minglewood Blues\", \"Around and Around\", and \"Promised Land\".\nIn an interview quoted in the CD liner notes, Matthew Kelly said, \"The one thing I remember about the Beacon Theatre was how great the audience was and how incredible the acoustics were.  It was a great place to play.  Big enough to make it exciting, but not so big, like the stadiums we played that had no soul.... There was some kind of chemistry with the first Kingfish that was magical.  We were a live band, more so than a studio band.  We worked off the audience.  On a good night, when we played live, we were able to create some kind of special magic.\"\nTrack listing\nDisc One\n# \"Mystery Train\" (Sam Phillips, Junior Parker) / \"Mule Skinner Blues\" (George Vaughn, Jimmie Rodgers)\n# \"Juke\" (Marion Jacobs)\n# \"Jump Back\" (Jacobs)\n# \"The Battle of New Orleans\" (Jimmy Driftwood)\n# \"Goodbye Your Honor\" (Matthew Kelly, Dave Torbert, Hovey)\n# \"Big Iron\" (Marty Robbins)\n# \"I Hear You Knocking\" (Dave Bartholomew, King)\n# \"All I Need is Time\" (Reneau)\n# \"Around and Around\" (Chuck Berry)\nDisc Two\n# \"C.C. Rider\" (traditional)\n# \"Home to Dixie\" (Kelly, Cutler, John Perry Barlow)\n# \"Hidden Charm\" (Willie Dixon)\n# \"Bye and Bye\" (traditional)\n# \"Promised Land\" (Berry)\n# \"Lazy Lightning\" (Bob Weir, Barlow) / \"Supplication\" (Weir, Barlow)\n# \"Jump for Joy\" (Carter, Gilbert)\n# \"Asia Minor\" (Carter, Gilbert)\n# \"New Minglewood Blues\" (traditional)\n# \"One More Saturday Night\" (Weir)\nPersonnel\nKingfish\n* Bob Weir – guitar, vocals\n* Matthew Kelly – guitar, harmonica, vocals\n* Dave Torbert – bass, vocals\n* Robbie Hoddinott – guitar\n* Chris Herold – drums\nProduction\n* Barry Ehrmann, Steve Ship, Evert Wilbrink – executive producers\n* Matthew Kelly, Gary Lyons – remixing\n* Gary Lyons – remastering\n* Steven Jacaruso – CD package design\nReferences\n*[http://www.deaddisc.com/disc/King_Biscuit_Kingfish.htm Kingfish in Concert on DeadDisc.com]\n*[http://www.bay-area-bands.com/bab00069.htm Bay-Area-Bands.com biography of Kingfish]\n* Scott, John W; Dolgushkin, Mike; Nixon, Stu. DeadBase XI: The Complete Guide to Grateful Dead Song Lists, 1999, DeadBase, ."
    }
  ]
}