{
  "content": [
    {
      "type": "text",
      "text": "# Kingisel\n\nKingisel is the name of two non-consecutive Roman Catholic abbots who ruled Glastonbury Abbey in the seventh and eighth centuries respectively.\n*Kingisel I, whose name also appears as Hemgisel, Hengislus, and Hanigestus, became abbot in 678. According to William of Malmesbury it was during his first year of office that King Kentwine granted six hides to the abbey upon condition that the monks should always have the right of freely electing their abbot according to the Rule of Saint Benedict. In 681 King Baldred granted to him and his successors the manor of Pennard near Glastonbury; in this charter, which is given by William Dugdale from the Ashmolean Manuscript, the abbot's name is spelled differently in two sentences, a slip which has led Thomas Tanner (Notitia Monastica) and Charles Eyston (Little Monument) to suppose that two different people were referred to. It was during the reign of this abbot that King Ine began his series of munificent benefactions to the abbey. Kingisel I died in the year 705 and was succeeded by Berwald.\n*Kingisel II, whose name is also found as Cingislus, Cengillus, and Hengissingus, was apparently fourth abbot after his namesake; he succeeded to the position in the year 729 and died in 744. William of Malmesbury states that Ine's successor, king Edelard, made him grants of land, and the Ashmolean manuscript gives a charter of Cudred, or Cuthred, King of the West Saxons, which confirms to the abbey all the previous grants made to it. In this charter the name is spelled Hengisilus. His successor was Cumbertus. Almost the only record of these abbots consists in the various charters in which they are named. The question as to the genuineness of these early charters is a difficult one, but it may be safely said that at the present day the general trend of opinion is more favourable to them than was the case in 1826, at which date, however, Warner, in his \"History of the Abbey of Glaston,\" wrote concerning Ine's charter, \"The reasons for questioning its genuineness do not appear to be serious.\nSources\n*\nExternal links\n* , fl. 729"
    }
  ]
}