{
  "content": [
    {
      "type": "text",
      "text": "# King Arthur: The Role-Playing Wargame__disambig_1\n\nKnights and Vassals & Legendary ArtifactsThe SaxonsThe DruidsFallen Champions}}\n|genre        = Real-time tactics, turn-based strategy, role-playing, Grand strategy, First-person shooter\n|modes        = Single-player, multiplayer\n|platforms    = Microsoft Windows\n}}\nKing Arthur: The Role-Playing Wargame is a real-time tactics and role-playing video game developed by NeocoreGames and published by Paradox Interactive in North America, Ubisoft in Europe, and E-Frontier in Japan. It seeks to blend elements of the real-time tactics, role-playing, and grand strategy genres into one. A sequel titled King Arthur II: The Role-Playing Wargame (not to be confused with the original's Japanese title, which was released in July 2010) was released online in Europe on September 20, 2011, and then worldwide in 2012.\nGameplay\nGame play in King Arthur is a mix of real-time strategy, role-playing, and grand strategy elements. The grand strategy portion of the game is played on a large campaign map of Britannia. When a battle is fought, the action changes to a real-time strategy mode. The position of the battle on the large-scale map has minimal effect on the environment of the battlefield (i.e. there are a set number of maps that the player can choose to fight the battle on).\nWarfare\nDuring the real-time battles, the RPG-style abilities of the heroes come into play. Heroes wield magical and non-magical abilities, such as the power to call down lightning, or the ability to change the conditions of the battlefield. Heroes are devastating in melee combat, able to take on dozens of troops. Heroes also inspire nearby troops and keep up the morale of the army as a whole. If the leader of the army is captured, however, the blow to army morale can be devastating.\nThe battlefield itself also influences gameplay and the outcome of the battle. Most battles begin in sunlight. Units have access to various formations, which increase or decrease their effectiveness against certain types of enemies. The terrain affects the effectiveness of certain units; woodland, for example, hampers cavalry while open fields helps their momentum.\nMorale plays a large role in the real-time mode; a varying number of victory locations, similar to \"control points\" in many first-person shooters, are located on each map. If one side holds more victory locations than the other the morale of the side holding fewer victory locations will decrease steadily. The rate of morale decrease is proportional the difference in number of victory locations controlled. In addition, taking control of a victory locations confers an immediate magical power to the owner. Victory locations tend to be strategically located, such as on hills or nearby buildings (which provide cover); capturing and retaining these points is crucial to victory - the complete loss of morale results in defeat.\nUnits gain experience during combat, and can be leveled up the following winter season.\nRole-playing\nWhen units level up, the player can boost several attributes, for example, attack, defense, or decreasing upkeep costs. When heroes level up, they may gain access to new spells and effects, as well as an increase in their martial skills. Heroes, called \"Knights of the Round-table\", have 20 levels maximum. Both active and passive abilities can be acquired. For example, many passive abilities increase crop and taxes production in the province that the hero is currently in. An active ability is one triggered during combat, such as lightning.\nCampaign\nThe campaign map displays an overview of Roman Britain in a fantasy-oriented style. Laws, research, and production all play a role in building the player's kingdom. Economy is streamlined and fairly automatic; there are only two resources: food and gold, both collected from the player's provinces. Certain hero abilities can increase the output of a province. This large-scale strategy mode also integrates the four seasons into the campaign. Each turn represents a season. During winter, all army movement ceases and taxes roll in to the coffers. Units also level up during the winter months. Quests or events, such as rebellions or volunteers for the player's armies, appear on the map. Similar to the campaign map layout in Empire: Total War, each province has several towns, castles, or other places of conquer. To control the province completely, the player must conquer every one of these. Every one of the player's major actions has an effect upon the morality of the player's faction, measured in two ways: by religion and type of ruler. There are only two forms of religion in King Arthur, Christianity, and the \"Old Faith\". There are several advantages and disadvantages to both, and both unlock advanced and powerful units. The player can also either be a \"tyrant\", or \"rightful king\", which in concert with the player's choice of religion allows the player to unlock specific units.\nThe game is driven forward largely through quests that appear on the campaign map. Only knights can undertake quests. Once a knight has chosen to undertake a quest, a game resembling text adventure begins. The player has a series of options and, depending on the attributes of his knight, can intimidate or talk his way through.\nPlot\nThe plot in King Arthur draws mainly on Arthurian legend, adding and intermixing foreign elements into it. The player takes the role of King Arthur himself, and commands his knights and armies to expand his kingdom. It is explained that Uther Pendragon, Arthur's father, failed to draw the sword Excalibur from the stone. Arthur, years later, pulls the sword from the stone, unleashing ancient forces upon Britannia.\nHistory\nBug fixing patches versioned 1.02, 1.03 and 1.04 were released after publication.\nDownloadable content\nNeocore released two downloadable content items: Knights and Vassals (adding further units and heroes), and Legendary Artifacts (adding additional weapons, relics and other items) on January 19, 2010.\nExpansions were released: in July 2010 King Arthur: The Saxons added an additional campaign set after the Arthurian period, during the Saxon era of Britain; the expansion had a sandbox game style.  Another expansion, released January 2011 - King Arthur: The Druids, set in Wales, also used a 'sandbox' type game format.\nKing Arthur: Fallen Champions\nKing Arthur: Fallen Champions is a stand-alone expansion, released September 2011, with a story-based mission structure. The game was intended to act as a bridge between the stories of the original game and the sequel King Arthur II: The Role-Playing Wargame.\nReception\nKing Arthur: The Role-Playing Wargame\n| EuroG = 7/10\n| GSpot = 7/10\n| GameZone = 7.5/10\n| PCGUS = 86%\n| PCPP = 7/10\n| PCZone = 79%\n}}\nThe game received \"generally favorable reviews\" according to the review aggregation website Metacritic. GameSpot's review praised the game's captivating environment and style, innovations like the victory locations, and detailed graphics. However, criticism was made of a confusing decision making mechanism for strategic play, overpowered archer units, and some difficulty humps in the campaign. A 1.02 patch introduced a 'beginner' difficulty level, and options to reduce archer's effectiveness.\nDLCs and Fallen Champions\n| PCGUK = 81%\n}}\n| Destruct = 4/10\n| GamePro =\n| GSpot = 7.5/10\n| rev1 = The Digital Fix\n| rev1Score = 8/10\n}}\nKing Arthur: The Saxons received \"generally favorable reviews\", while King Arthur: The Druids and the Fallen Champions expansion pack received \"mixed\" reviews according to Metacritic.\nSequel\nA sequel to the game, titled King Arthur II: The Role-Playing Wargame, was released online in Europe on September 20, 2011, and then worldwide in 2012.\nReferences\nExternal links\n*"
    }
  ]
}