{
  "content": [
    {
      "type": "text",
      "text": "# King Lan Chew\n\n| birth_name         =\n| birth_date         = November 4, 1901\n| birth_place        = Berkeley, California, US\n| death_date         = February 2, 1988\n| death_place        = California, US\n| other_names        = Qionglan Chew, Caroline Ruttle\n| occupation         = dancer\n| years_active       = 1925–1940s\n| known_for          =\n| notable_works      =\n| parents            = Ng Poon Chew\n}}\nKing Lan Chew (November 4, 1901 – February 2, 1988), also known as Qionglan Chew or Caroline B. Chew, and later as Caroline Chew Ruttle, was an American dancer. She was billed as \"the only Chinese concert dancer in America\" in the 1930s, when she toured North America on the chautauqua circuit.\nEarly life\nKing Lan Chew was born in Berkeley, California, the daughter of Presbyterian minister, publisher and lecturer Ng Poon Chew and Chun Fah Chew. Both of her parents were born in China. She was raised in Oakland, California, the youngest of five siblings, and studied piano. She graduated from Oakland High School in 1921, and from Mills College in 1925; she completed a master's degree at Mills the following year. She studied dance with Hanya Holm, Harald Kreutzberg, and Michio Itō, among other teachers.\nCareer\nChew worked as a social worker at Oakland's International Institute after college. She danced on Broadway in Continental Varieties (1935) with French singer Lucienne Boyer, and in the film adaptation of Pearl Buck's The Good Earth (1937). She toured on the chautauqua circuit in North America in the 1930s and 1940s, billed as \"the only Chinese concert dancer in America\". Her act involved her interpretations of traditional dances and costumes from China, Java, India, Japan, Turkey, and Burma, and original contemporary dances to works by Gershwin, Scriabin and Debussy.\nShe created all her own costumes for her performances, with zippers for quick changes. She appeared with the Red Gate Players, directed by puppeteer Pauline Benton; she succeeded Soo Yong and the troupe's \"mistress of ceremonies\".\nPersonal life\nCaroline Chew married performer, writer and publicist Lee Ruttle in New York in 1938.  She was widowed in 1985, and she died in California in 1988, aged 86 years. There are items related to Chew in her sister Mansie (Jingping) Chew's scrapbook, archived at the Bancroft Library.\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}