{
  "content": [
    {
      "type": "text",
      "text": "# King and Lionheart\n\n}}\n}}\n\"King and Lionheart\" is a song recorded by Icelandic alternative folk band Of Monsters and Men, written by co-lead vocalist Nanna Bryndís Hilmarsdóttir and produced by the band with Aron Arnarsson and Jacquire King for the band's debut studio album, My Head Is an Animal. The song maintains its position on both issues of the album, appearing as the second track on both the original Icelandic and international versions of the album. After reaching No. 1 on the Icelandic Tónlist singles chart in 2012, the song was released as a radio-only single from My Head Is an Animal in the United States and the United Kingdom in March 2013. The song peaked at No. 17 on the Billboard Alternative Songs chart.\nMusic video\nA music video for \"King and Lionheart\", directed by video production group WeWereMonkeys, was produced and released on 23 January 2013. The video, which mirrors the Nordic art style of the music video for \"Little Talks\", also directed by WeWereMonkeys, blends in the visual art styles of two-dimensional rendered backgrounds with CGI and live action-imposed film sequences.\nSynopsis\nThe video starts with a pair of royal siblings of a sci-fi fantasy kingdom being separated from each other by invading savage warriors, \"Dwellers\". The warriors whisk the sister away to the middle of the bayou where they put her in a pit and leave her to sulk. Suddenly, a rabbit-like spirit guardian appears to the girl and sets her free. She soon is spotted by the warriors and chased by them through the bayou with the spirit leading the way. Meanwhile, the brother is locked in a cage sulking and watching the warriors beat themselves up. Suddenly, a small spirit dolphin appears to the boy and sets him free as well. Meanwhile, the spirit helps the girl safely across a broken bridge. However, the spirit is soon devoured by the warriors' monstrous vehicle. The girl presses on and enters the kingdom where the boy's spirit leads him away from the warriors by leading him into a four-faced rocket ship which he enters, whereupon it immediately blasts off. The girl returns just in time to see the rocket ship blast away, her brother crying on the window. She runs toward it still chased by the warriors. Then the screen blanks out as the video ends in a cliffhanger, their fates unknown.\nLyric video\nA lyric video was released in 2014 in the music videos presence. The lyric video begins with a ruins of a kingdom where the camera moves backward. Towards the main chorus, a violent thunderstorm breaks ahead. Two cloaked figures move toward it as the video ends.\nTrack listing\nPersonnel\nAdapted from My Head Is an Animal liner notes.\n;Of Monsters and Men\n*Arnar Rósenkranz Hilmarsson&nbsp;– drums, percussion, co-producer\n*Árni Guðjónsson&nbsp;– accordion, piano, organ, co-producer\n*Brynjar Leifsson&nbsp;– electric and baritone guitar, co-producer\n*Kristján Páll Kristjánsson&nbsp;– bass, co-producer\n*Nanna Bryndís Hilmarsdóttir&nbsp;– vocals, acoustic guitar, co-producer\n*Ragnar Þórhallsson&nbsp;– vocals, acoustic guitar, co-producer\n;Additional personnel\n*Aron Arnarsson&nbsp;– engineer, producer\n*Jacquire King&nbsp;– producer\n*Craig Silvey&nbsp;– mixing\n*Greg Calbi&nbsp;– mastering\nCharts\nWeekly charts\n{| class=\"wikitable plainrowheaders sortable\"\n!Chart (2013)\n!Peakposition\n|-\n|-\n|}\nYear-end charts\n{| class=\"wikitable plainrowheaders sortable\"\n|-\n! Chart (2013)\n! Position\n|-\n! scope=\"row\"| US Hot Rock Songs (Billboard)\n| style=\"text-align:center;\"| 88\n|-\n|}\nCertifications\nRelease history\n{|class=\"wikitable\"\n! Region\n! Date\n! Format\n! Label\n|-\n| United Kingdom\n| March 3, 2013\n| rowspan=\"2\"| CD-R (Modern Rock / Alternative radio)\n| rowspan=\"2\"| Republic Records\n|-\n| United States\n| March 4, 2013\n|}\nReferences\nExternal links\n* [http://wwm.productions/vid_kingandlionheart.php King and Lionheart] WeWereMonkeys"
    }
  ]
}