{
  "content": [
    {
      "type": "text",
      "text": "# Kingsford Smith Drive, Brisbane\n\nState Route 25\n| direction_a  = Southwest\n| end_a        = Breakfast Creek Road (State Route 25) Albion\n| exits        =  Inner City Bypass\n*  Racecourse Road\n*  Nudgee Road\n*  Southern Cross Way\n*  Links Avenue North\n*  Gateway Motorway (M1)\n}}\n| direction_b  = Northeast\n| end_b        = Eagle Farm Road (State Route 25) Pinkenba\n| est          =\n| through      = Hamilton, Pinkenba\n}}\nKingsford Smith Drive is a major road in Brisbane. The road was named after the aviator Charles Kingsford Smith. It connects the suburb of Pinkenba to the Brisbane central business district at the Breakfast Creek. Kingsford Smith Drive is one of the busiest roads in Brisbane, carrying an average of 61,773 vehicles per day between July and December 2014.\nHistory\nThe first road along the northern bank of the Brisbane River was constructed in 1829/1830. Convict labour was used to connect the main settlement to the women's gaol at Eagle Farm. In 1882, the road was still no better than a rough bush track.\nThe road was then known as Hamilton Road in one part and Eagle Farm Road in another part. In 1938, it was renamed Bailey Memorial Avenue in honour of John Frederick Bailey, Queensland Botanist and curator of the Botanic Gardens. However, this name was not used in practice and, in 1953, the road was again renamed after Charles Kingsford Smith although the idea of renaming it had been proposed back in 1938 when the Bailey Memorial Avenue was proposed.\nThe road was once the major access route to Brisbane's old airport terminals. In 2002 the Inner City Bypass, Brisbane was opened. This bypass allowed traffic joining the Pacific Motorway to avoid the smaller and sometimes congested city streets. In 2016 a major upgrade project was commenced, which completed a year later than scheduled in October 2020.\nRoute\nThe route runs along Hamilton Reach of the Brisbane River from Albion via Hamilton, before passing under the Gateway Motorway at Eagle Farm and continuing to Pinkenba.  At Hamilton the Kingsford Smith Drive meets Racecourse Road at a T-intersection.  During the annual Bridge to Brisbane the road is temporarily closed in one direction.\nCongestion\nIn February 2007 it was announced by the Queensland Government that the road was to receive a major upgrade and that traffic rates were estimated at 67,000 vehicles a day. Traffic volumes on the road are increasing. This has led to a drop in the average speed on the road from  per hour in 2008 to  per hour in 2009. The Airport Link tolled tunnel project is expected to reduce traffic volumes by 12%.\nMajor intersections\nThe entire road is in the Brisbane local government area.\nBreakfast Creek Road (State Route 25) – south – Newstead\n|notes=Western end of Kingsford Smith Drive (State Route 25)\n}}\nGateway Motorway – south – Sir Leo Hielscher Bridges\n|notes=No exit to Gateway Motorway northbound.  No entry from Gateway Motorway southbound.\n}}\nEagle Farm Road (State Route 25) – north–east – Pinkenba\n|notes=Eastern end of Kingsford Smith Drive.  State Route 25 continues north–east as Eagle Farm Road.\n}}\nSee also\n* Gympie Road\n* Sandgate Road\n* Transport in Brisbane\nReferences\nExternal links\n*"
    }
  ]
}