{
  "content": [
    {
      "type": "text",
      "text": "# King (2002 film)\n\n| cinematography = G. Ramesh\n| editing        = Suresh Urs\n| music          = Dhina\n| studio         = Indian Theatre Production\n| released       =\n| runtime        = 163 minutes\n| country        = India\n| language       = Tamil\n}}\nKing is a 2002 Indian Tamil-language film directed by Prabhu Solomon and produced by Krishnakanth. The film stars Vikram and Sneha, while Vadivelu, Nassar, Janagaraj, and Santhana Bharathi play supporting roles. Dhina scored the music, G. Ramesh handled the cinematography and Suresh Urs edited the film. It released on 6 September 2002.\nPlot\nRaja Krishnamoorthy is the only son of Shanmugam, and they live in Hong Kong. One day while travelling, their car meets with an accident, and both get admitted to the hospital. Dr. Cheenu is their family doctor who diagnoses their blood and finds that Shanmugam is infected with multiple sclerosis. Cheenu, being a close friend of Shanmugam, tells Raja that Shanmugam's life is expected to last for 60 days and requests Raja to keep his father happy, to which Raja agrees.\nRaja insists that his father get back to India to meet his family. A small flashback is shown where Shanmugam married a girl by his choice against his family's wishes, which made him leave home with his wife. Shanmugam relocated to Hong Kong and set up a business there. Shanmugam's wife died when Raja was born, and Shanmugam took care of Raja afterward. Raja knows that his father longs to meet his family again, so he decides to get the family united. Raja and Shanmugam leave to India to meet their family members. Everyone in the family is surprised upon seeing Shanmugam. They share some memories with him, except his father, who is still angry at him. Raja, on the other, hand is skilled in magic tricks and mimicry and impresses everyone in the family with his skills.\nTamil is the daughter of Murthy who was a close friend of Shanmugam. Being orphaned, she lives with the family. She is responsible, loved by everyone in the family, and also takes care of everyone with love and affection. Raja decides to love Tamil after knowing that his father likes her. Raja proposes his love to Tamil, but she declines and says she will marry only the man as per their family's wish. Raja creates a scene that Shanmugam's father should talk with Shanmugam, and if not, Raja will commit suicide. Shanmugam also gets united with his father.\nRaja keeps on frequent touch with Cheenu to keep him updated with Shanmugam's condition. One day, Raja gets a headache and becomes colorblind. Shanmugam's mobile gets a call from Cheenu. Raja modulates as Shanmugam on the call and actually understands that the disease is actually for him and not his father. Raja continues speaking like his father to confirm the symptoms related to the disease but tries to behave normally. Raja understands that his father has requested Cheenu to lie to Raja, so that Raja will be happy while also making his father happy. Raja feels sad knowing that he has only a few more days to live but does not disclose this to his father and Cheenu. Cheenu calls Raja and informs about a research going on for multiple sclerosis in Europe and insists him to take Shanmugam there to get treated, which might provide a chance for revival. Raja understands that the therapy is intended for him.\nRaja convinces his father to get back to Hong Kong, for which he agrees. Everyone in the family does not want Shanmugam and Raja to leave and insist them to stay with them. Raja says that there are some pending works and that they need to get back immediately. On the day of leaving, Tamil proposes her love to Raja, for which he does not reply. The movie ends with both Raja and Shanmugam leaving for treatment.\nCast\nProduction\nKing was the first production venture of S. K. Krishnakant, who had earlier worked as the production executive for Lakshmi Movie Makers. The film was written and directed by A. X. Solomon who had directed the Arjun-Sonali Bendre starrer Kannodu Kanbathellam in 1999, under the name Prabhu. However, as that film did not perform to expectations at the box office, the director wanted to be credited as A. X. Solomon for his second Tamil film. He has since gone on to make a career under the name of Prabhu Solomon.\nThe film was initially titled as Vikadan with Suvaluxmi being the first choice of lead actress. During the same period Vikram had accepted another film titled King where he was set to play dual roles, but the film eventually was shelved, hence the title King was chosen to replace Vikadan in this project. Vikram took up magic lessons and learned how to roller-blade for his role in the film.\nSoundtrack\nThe soundtrack was composed by Dhina and all lyrics written by Vairamuthu. The song \"Kadhalagi\" is lifted from \"A Thousand Years\" by British musician Sting from the album Brand New Day.\nReception\nMalathi Rangarajan of The Hindu wrote that \"'Good game... ' Vikram comments at a particular point. Sure it is... because it has been played quite well\". Malini Mannath of Chennai Online wrote that \"Like his earlier film \"Kannodu Kaanbathellam' the director takes a different subject here too, which despite its flaws has turned out to be a fairly engaging, clean family entertainer\". Cinesouth wrote \"There hasn't been a movie in the recent past that so perfectly blended human values with emotions. 'King's screenplay and Vikram's performance filled that gap beautifully\".\nBox office\nThe film did not fare well commercially. Post-release, Solomon revealed that he was unconvinced about Vikram portraying the lead role, feeling that he was too old to play Nassar's son, but the actor insisted that the project go ahead. Delays in the production in the film meant that Vikram's star image had risen and reviewers labelled the film as a disappointment upon release. The director noted that the story was written with the expectation of a small-time actor in the lead role, and hence Vikram's sudden popularity worked against the film. He revealed that his early career in film involved making significant compromises and was strictly against the type of cinema he had actually ventured to make.\nReferences\nExternal links\n*\n*"
    }
  ]
}