{
  "content": [
    {
      "type": "text",
      "text": "# King C. Gillette\n\n| birth_place        = Fond du Lac, Wisconsin, U.S.\n| death_date         =\n| death_place        = Los Angeles, California, U.S.\n| death_cause        =\n| resting_place      = Forest Lawn Memorial Park Cemetery, Glendale, California\n| other_names        =\n| known_for          = Inventing the double-edged safety razor, co-founding The Gillette Company\n| education          =\n| employer           = Crown Cork & Seal CompanyGillette Safety Razor Company\n| occupation         =\n| title              =\n| height             =\n| term               =\n| successor          =\n| predecessor        =\n| party              =\n| boards             =\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| relatives          =\n| signature          = King Camp Gillette signature.svg\n| signature_size     = 200px\n| website            =\n| footnotes          =\n}}\nof the razor]]\nKing Camp Gillette (January 5, 1855 – July 9, 1932) was an American businessman who invented a bestselling safety razor. Gillette's innovation was the thin, inexpensive, disposable blade of stamped steel. Gillette is often erroneously credited with inventing the so-called razor and blades business model in which razors are sold cheaply to increase the market for blades. However, Gillette Safety Razor Company adopted the business model from its competitors.\nBiography\nThe Gillette paternal ancestors were French Huguenots who sought refuge in England in the late 16th century. One or two generations later, in 1630, Nathan Gillette sailed from England to the newly founded Massachusetts Bay Colony in North America.\nKing Camp Gillette was born on January 5, 1855, in Fond du Lac, Wisconsin, and raised in Chicago, Illinois.  His family survived the Great Chicago Fire of 1871.\nGillette had joined the Baltimore Crown Cork and Seal Company in 1891 and developed a close friendship with the founder William Painter, inventor of the disposable metal bottle cap (\"crown cork\"). Painter advised him, \"King, you are always thinking and inventing something. Why don't you try to think of something like the Crown Cork which, when once used, is thrown away, and the customer keeps coming back for more?\" This advice on the value of a disposable product would profoundly influence Gillette's own future success. Men shaved with straight razors that needed sharpening every day using a leather strop. As existing, relatively expensive razor blades dulled quickly and needed continuous sharpening, a razor whose blade could be thrown away when it dulled would meet a real need and likely be profitable.\nSafety razors had been developed in the mid-19th century, but still used a forged blade. In the 1870s, the Kampfe Brothers introduced a type of razor along these lines.  Gillette improved these earlier safety-razor designs and introduced the high-profit-margin stamped razor blade made from carbon steel sheet. Gillette's razor retailed for a substantial $5 (equivalent to $}} in ) – half the average working man's weekly pay&nbsp;– yet sold by the millions.\nThe most difficult part of development was engineering the blades, as thin, cheap steel was difficult to work and sharpen. This accounts for the delay between the initial idea and the product's introduction. Steven Porter, a machinist working with Gillette, used Gillette's drawings to create the first disposable razor blade that worked. William Emery Nickerson, an expert machinist and partner of Gillette, changed the original model, improving the handle and frame so that it could better support the thin steel blade. Nickerson designed the machinery to mass-produce the blades, and he received patents for hardening and sharpening the blades.  (Nickerson was later elected to Gillette's board of directors.)\nTo sell the product, Gillette founded the American Safety Razor Company on September 28, 1901 (changing the company's name to Gillette Safety Razor Company in July 1902).  Gillette obtained a trademark registration (0056921) for his portrait and signature on the packaging.  Production began in 1903, when he sold a total of 51 razors and 168 blades.\nThe second year, he sold 90,884 razors and 123,648 blades, thanks in part to Gillette's low prices, automated manufacturing techniques, and good advertising. Sales and distribution were handled by a separate company, Townsend and Hunt, which was absorbed by the parent company for US$300,000 in 1906. By 1908, the corporation had established manufacturing facilities in the United States, Canada, Britain, France, and Germany.  Razor sales reached 450,000 units and blade sales exceeded 70&nbsp;million units in 1915. In 1917, when the U.S. entered World War I, the company provided all American soldiers with a field razor set, paid for by the government.  Gillette vetoed a plan to sell the patent rights in Europe, believing correctly that Europe would eventually provide a very large market.  Gillette and John Joyce, a fellow director, battled for control of the company.  Gillette eventually sold out to Joyce, but his name remained on the brand.  In the 1920s, as the patent expired, the Gillette Safety Razor Company emphasized research to design ever-improved models, realizing that even a slight improvement would induce men to adopt it.\nHe was almost bankrupt due to spending large amounts of money on property, and to his having lost much of the value of his corporate shares as a result of the Great Depression.\nGillette died on July 9, 1932, in Los Angeles, California.  He was interred in the lower levels of the Begonia Corridor in the Great Mausoleum located at Forest Lawn Memorial Park Cemetery in Glendale, California.\nPersonal life\n[[File:King Camp Gillette 1907.jpg|thumb|upright|King C. Gillette wearing a Panama hat, circa 1908. This is said to be Gillette's favorite picture of himself.]]\nGillette was also a Utopian Socialist. He published a book titled The Human Drift (1894) which advocated that all industry should be taken over by a single corporation owned by the public, and that everyone in the US should live in a giant city called Metropolis powered by Niagara Falls. A later book, World Corporation (1910) was a prospectus for a company set up to create this vision. He offered Theodore Roosevelt the presidency of the company, with a fee of one million dollars. (Roosevelt declined the offer.) Gillette's last book, ''The People's Corporation'' (1924), was written with Upton Sinclair and later inspired Glen H. Taylor.\nGillette was initiated to the York Rite of Freemasonry, till his elevation to the highest degree of Grand Master.\nGillette married Alanta \"Lantie\" Ella Gaines (1868–1951) in 1890. They had one child, King Gaines Gillette (1891–1955).\nIn his later life he traveled extensively and was universally recognized from his picture on the packets of razor blades. People were surprised that he was a real person rather than just a marketing image. A Gillette company history stated that in non-English speaking countries people would often ask for blades of \"the kind with the Man's Face\".\nAround 1922 or 1923, he built a residence at 324 West Overlook Road, in \"The Mesa\" district of Palm Springs, consisting of a  main home and  guest house. The homes, sitting on  of land, are what remain of the original estate.\nLegacy\nThe company continues in the present day as the Gillette brand of Procter & Gamble.\nGillette is widely credited with creating the \"razor-razor blade business model\". Some peers in the marketing industry quote him as one of the innovators who revolutionized the freebie marketing ideas. The Gillette Company continued to thrive and sell products under a variety of brand names including Gillette, Braun, Oral-B, and Duracell. In 2005, the Gillette company was sold to Procter & Gamble for US$57&nbsp;billion.  It is now known as Global Blades & Razors, with the Gillette brand, a business unit of Procter & Gamble.\nKing Gillette Ranch\nKing Gillette purchased property for a large ranch in the Santa Monica Mountains near Calabasas in Southern California in 1926. The master plan and new buildings on the ranch were designed and built for Gillette in the late 1920s by renowned architect Wallace Neff. The architectural style was Spanish Colonial Revival. After his death, his wife sold the home to Clarence Brown, an MGM film director who held A-List Hollywood parties at the ranch. In 1952, Bob Hope bought the property, immediately giving it to the Claretian Order of the Catholic Church, which operated a seminary on the grounds for 25 years. In 1970 Thomas Aquinas College rented the property from the Claretian Order before later moving their campus to Santa Paula in 1977. Elizabeth Clare Prophet, founder of the Church Universal and Triumphant, purchased the property in 1978, and ran her New Age church at the site until 1986 when Soka University of America (SUA) bought the land.\nIn 1990, SUA announced plans to build a future liberal arts college on campus and plans to expand the facility over the next 25 years to an enrollment of as many as 5,000 students. SUA began making plans to expand the campus infrastructure to accommodate living quarters and classrooms for the proposed expansion, but ran into opposition from some local residents, the Santa Monica Mountains Conservancy, environmentalists, and government representatives. Opponents sought to protect the Chumash ancestral site, the natural habitats and ecology, and the expansive open space viewshed within the Santa Monica Mountains National Recreation Area, and to prevent a development of unprecedented urban density adjacent to Malibu Creek State Park.\nIn 1992, the Mountains Recreation and Conservation Authority (MRCA), a joint-powers authority associated with the Santa Monica Mountains Conservancy, resorted to its powers of eminent domain to condemn the core parcel comprising the university and thereby halted SUA's plans for expansion. SUA appealed the eminent domain action. The legal debate continued for the remainder of the decade. Soka University was prevented from developing any expansion plans at the Calabasas property and began looking for alternative sites to build a larger campus.\nAfter the university moved to a purpose-built campus, the King Gillette ranch was collaboratively purchased for $35&nbsp;million by the Mountains Recreation and Conservation Authority, National Park Service, Santa Monica Mountains Conservancy and California State Parks, who then made it available for public use. Those agencies are also funding an $8.4 million visitor's center on the property.\nOn June 30, 2007, the  King Gillette Ranch opened to the public as a park. The ranch is situated adjacent to Malibu Creek State Park in the Santa Monica Mountains, at 26800 West Mulholland Highway in Calabasas, California.\nSince 2008,  the ranch has been used for the NBC reality show The Biggest Loser. The ranch was also featured in the 2019 Ratched Netflix series and in the 2021 The Starling movie with Melissa McCarthy.\nWorks\nBooks\n* [https://archive.org/download/TheHumanDrift/The_Human_Drift.pdf The Human Drift.] New Era Publishing Co. (1894).\n* The Ballot Box. Brookline, Massachusetts: Self-published (1897). .\n* [https://archive.org/download/worldcorporation00gill/worldcorporation00gill.pdf World Corporation.] Boston: New England Newspaper Co. (1910). .\n* [https://books.google.com/books/download/The_People_s_Corporation.pdf?id=Ie4CAAAAMAAJ&hl=en&capid=AFLRE72C1F5WnVGBeheRBeBMnNxfzVXE5FKZluBnfnTUZVWhU0rqiIIjT9v9cYRn5QssnKlE87sc6FWH5dc3B45f52N3oQLpQw&continue=https://books.google.com/books/download/The_People_s_Corporation.pdf%3Fid%3DIe4CAAAAMAAJ%26output%3Dpdf%26hl%3Den ''The People's Corporation], with Upton Beall Sinclair. New York: Boni & Liveright (1924). .\nReferences\nFurther reading\n*\n*\n*  Magill, Frank N. Great Events from History II: Business and Commerce Series, volume 1:1897–1923'' (1994) pp.&nbsp;75–79, historiography\nExternal links\n*  issued November 15, 1904, for Safety Razor\n* [https://web.archive.org/web/20101025083457/http://www.lamountains.com/parks.asp?parkid=670 King Gillette Ranch Park]\n* [http://nla.gov.au/nla.news-article71486508 Australian Patent, no.12813 (week ending 30 September 1903).] [http://nla.gov.au/nla.news-article71477180 trove.nla.gov.au]\n*"
    }
  ]
}