{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of Siau\n\n| religion = Catholicism, later Protestantism\n| demonym =\n| government_type = Kingdom\n| area_km2 =\n| area_rank =\n| GDP_PPP =\n| GDP_PPP_year =\n| HDI =\n| HDI_year =\n| footnotes =\n| year_end = 1956\n| year_start = 1510\n| image_map_alt =\n| image_map_caption =\n| common_languages = Sangir (Siau dialect)\n| title_leader = King\n| year_leader1 = 1510–1549\n| leader1 = Lokongbanua II\n| year_leader2 = 1549–1587\n| leader2 = Pasumah\n| year_leader3 = 1587–1591\n| leader3 = Wuisang\n| year_leader4 = 1591–1639\n| leader4 = Winsulangi\n| year_leader5 = 1639–1678\n| leader5 = Batahi, Laksamana Hengkeng U Naung\n| year_leader6 = 1678–1680\n| leader6 = Monasehiwu\n| year_leader7 = 1680–1716\n| leader7 = Raramenusa, X Nelly, Kansil\n| year_leader8 = 1716–1752\n| leader8 = Lohintundali\n| year_leader9 = 1752–1788\n| leader9 = Ismael Jacobus, X Ester Manggeadi Manoppo (Bolaang Mongondow)\n| year_leader10 = 1788–1790\n| leader10 = Begandelu\n| year_leader11 = 1790–1821\n| leader11 = Umboliwutang\n| event_start = Established by Lokongbanua II\n| event_end = Replaced by Siau Tagulandang Biaro Islands Regency\n| p1 = Kingdom of Mopagu\n| s1 =\n| flag_p2 =\n| p2 =\n| flag_s1 =\n| today =\n}}\nThe Kingdom of Siau was a kingdom located in the Siau Tagulandang Biaro Islands Regency, North Sulawesi, in .\nIt was established in 1510 by Lokombanua II or , who was also its first king. The kingdom lasted until the end of Ch. David's reign in 1956. According to Barta1, Siau was one of the oldest Christian kingdoms in the Indonesian Archipelago (Nusantara).\nHistory\nEstablishment\nLokongbanua II established the Siau Kingdom in 1510 through consensus among the kulano (king), ruling from 1510 to 1545. The kingdom was introduced to Christianity through Catholic missionaries who arrived in North Sulawesi and North Maluku between 1511 and 1522. According to historian , in 1516, a Portuguese Catholic mission stopped by and conducted Easter Mass in the capital, Paseng. King Lokongbanua attended the Mass.\nLokongbanua II was succeeded by his son, Posuma. According to historian Sem Narande in \"Vadu La Paskah,\" King Posuma was baptized into Catholicism in a major river in Manado, along with 1,500 of his subjects and the King of Manado, Kinalang Damopolii.\nFrom the reign of the third King of Siau, Don Geronimo Winsulangi, to the fourth King, Don Fransiscus Xavirius Batahi, Siau encompassed territories in the southern part of Sangihe, Kabaruan Island (Talaud), Tagulandang, islands in , and the northern coastal areas of Sulawesi (now North Minahasa), extending to the Kingdom of Bolangitang or Kaidipang (North Bolaang Mongondow) territory and even to Leok Buol. King Batahi's successor, King Raramenusa, became the first King of Siau to embrace Protestantism.\nThe kingdom was successively ruled by 21 kings and left behind a legacy – the Lokongbanua King's Tomb Complex.\nDownfall\nDuring the national movement era, the King of Siau attempted to remain neutral as the kingdom was closely monitored by the Dutch. The courage of the Siau people to resist the colonizers reignited after the arrival of J.B. Dauhan, who was close to Soekarno. Dauhan was eventually killed by the Dutch after he was discovered holding meetings and trying to inspire the Siau people with the spirit of independence. Following Indonesia's declaration of independence in 1945, the Siau became home to pro-republican supporters. The Siau Kingdom ended in 1956 with its last king, C.H. David.\nReferences\nRelated works\n* D. Brilman, Onze Zendingsvelden De Zending op de Sangi- en Talaud-eilanden, translated by GMIST as \"Our Missionary Fields, Missionary Work in the Sangihe and Talaud Islands.\"\n* Antonio Pigafetta's Primer Viaje en Torno del Mundo (The First Voyage Around the World)\n* Armando Cortesão The Suma Oriental of Tom Pires and the Book of Francisco Rodrigues"
    }
  ]
}