{
  "content": [
    {
      "type": "text",
      "text": "# Kings of Alba Longa\n\nThe kings of Alba Longa, or Alban kings (Latin: reges Albani), were a series of legendary kings of Latium, who ruled from the ancient city of Alba Longa. In the mythic tradition of ancient Rome, they fill the 400-year gap between the settlement of Aeneas in Italy and the founding of the city of Rome by Romulus. It was this line of descent to which the Julii claimed kinship.  The traditional line of the Alban kings ends with Numitor, the grandfather of Romulus and Remus.  One later king, Gaius Cluilius, is mentioned by Roman historians, although his relation to the original line, if any, is unknown; and after his death, a few generations after the time of Romulus, the city was destroyed by Tullus Hostilius, the third King of Rome, and its population transferred to Alba's daughter city.\nBackground\nThe city of Alba Longa, often abbreviated Alba, was a Latin settlement in the montes Albani, or Alban Hills, near the present site of Castel Gandolfo in Latium.  Although the exact location remains difficult to prove, there is archaeological evidence of Iron Age settlements in the area traditionally identified as the site.  In Roman mythology, Alba was founded by Ascanius, the son of Aeneas, as a colony of Lavinium, the original settlement of Trojan refugees and native Latins, which it quickly eclipsed.  There is some uncertainty in the tradition as to Ascanius' mother; in some accounts he was the son of Lavinia, and grandson of Latinus, the native king who welcomed Aeneas and the Trojans; his elder half brother, Iulus, was the son of Creusa, Aeneas' first wife, who died in the sack of Troy.  This was the account favoured by Livy; in other versions, Ascanius was the son of Creusa; Dionysius and Virgil follow this account. However, the two differ where Vergil claims Ascanius and Iulus were the same; Dionysius, on the other hand, makes Iulus the son of Ascanius.  In all accounts, Ascanius was the founder and first king of Alba Longa, while Iulus was claimed as the ancestor of the Julian gens.\nEratosthenes, the most influential of the ancient chronologists, reckoned that the sack of Troy occurred in 1184 BC, more than four centuries before the traditional founding of Rome, in 753.  The history of the Alban kings conveniently filled that gap with a continuous line leading from Aeneas to Romulus, thus serving as a mythical justification for the close ties between Rome and the rest of Latium, and enhancing the status of Roman and Latin families who claimed descent from the original Trojan settlers or their Alban descendants.  Such was the eagerness in the late Republic to claim a Trojan pedigree that fifteen different lists of the Alban kings from Aeneas to Romulus survive.\n.]]\nHistory\nKings of Latium\nAborigines}}\nWhen Aeneas and the Trojan refugees landed on the shores of the Laurentian plain, they encountered the Latins, led by their eponymous king, Latinus.  The Latins were aborigines; that is, the original inhabitants of Latium, a title sometimes used to refer to the Latins before the arrival of Aeneas.  Latinus was the son of Faunus, and grandson of Picus, the first king of Latium, who was in turn the son of Saturn.  This was the most usual account, followed by Virgil in the Aeneid, and by Eusebius, but there were also several other versions.  Picus was also said to be the son of Mars, rather than Saturn.  According to Justin, Faunus was Latinus' maternal grandfather, and was the son of Jupiter, rather than Picus; in this account Saturn was the first king of the Latins.  According to Dionysius of Halicarnassus, Latinus was the son of Hercules, and merely pretended to be the son of Faunus; Aeneas arrived in the thirty-fifth year of his reign over the Aborigines.\nEvander and Janus are also sometimes described as ancient kings of the Aborigines; but Livy describes Evander as a king of the Arcadians, as does Virgil, who makes him an ally of Aeneas in the war against the Rutuli.  In his Saturnalia, Macrobius describes Janus as sharing Latium with another king, known as Camese.\nThe Latins were alarmed by the arrival of the Trojans, and rushed to arms; according to some accounts, a battle was fought, in which Latinus was defeated, and a peace concluded between the two groups, cemented by the marriage of Aeneas and Lavinia, daughter of the Latin king; in other versions battle was narrowly averted when the two leaders chose to parley before hostilities could begin, and Aeneas impressed his host with his noble bearing and woeful story, leading to an alliance.  Aeneas then established the town of Lavinium, named after his young bride, with a mixed population of Trojans and Latins.\nBut the new settlers and their alliance with Latinus soon encountered threats from two neighbouring peoples.  First the Rutuli, whose prince, Turnus, had previously been betrothed to Lavinia, marched against them.  The new allies defeated the Rutuli, but Latinus was slain in the fighting, whereupon Aeneas assumed the leadership of both Trojans and Latins, declaring that henceforth all of his followers should be known as Latins.  Subsequently, Mezentius, king of the Etruscan city of Caere, led an army against the Latins; he too was defeated after fierce fighting, but Aeneas fell in battle, or died soon afterward, and was buried on the banks of the Numicus, where he was later regarded as Jupiter Indiges, the local god.\nBecause Ascanius was still a child, Lavinia acted as regent until he came of age.  Livy describes her as a woman of great character, who was able to maintain the peace between the Latins and their Etruscan neighbours to the north; he also describes the boundary between Latium and Etruria, fixed by treaty after the battle between Aeneas and Mezentius as the river Albula, subsequently known as the Tiber.\nThe Silvian Dynasty\nAbout thirty years after the founding of Lavinium, when the original Trojan settlement was flourishing and populous, Ascanius decided to establish a colony in the Alban Hills, which, as it was initially spread out along a ridge, became known as Alba Longa.  Nothing further is written of Ascanius, who was succeeded by his son, Silvius, according to Livy.  Silvius' name was reportedly derived from his having been born in the woods, and Dionysius records a different tradition, whereby he was not the son of Ascanius, but his half-brother, the son of Aeneas and Lavinia.  In this account, Lavinia feared that Ascanius, already a young man upon the death of his father, would harm her or her child, as threats to his bloodline, and therefore hid in the woods, where she was sheltered by Tyrrhenus, the royal swineherd and a friend of her father, Latinus.  She and her son emerged from hiding when the Latins accused Ascanius of having done away with his stepmother.  Silvius then succeeded Ascanius as king of the Latins, in preference to Ascanius' son, Iulus, whom Dionysius identifies as the ancestor of the Julii.  According to Dionysius, Ascanius died in the thirty-eighth year of his reign, counting from the death of Aeneas, rather than the founding of Alba Longa.\nLivy records that Silvius founded several colonies, later known as the Prisci Latini, or \"Old Latins\".  According to Dionysius, he reigned for twenty-nine years.  He was succeeded by his son, Aeneas Silvius, who assumed his father's name as a cognomen, or surname; henceforth all of his descendants bore the name \"Silvius\" in addition to their personal names.  This was the same process by which the nomen gentilicium later developed throughout Italy.  Aeneas reigned for thirty-one years, and was succeeded by Latinus Silvius, who reigned for fifty-one years.  The next king, Alba, reigned for thirty-nine years; according to Livy, he was succeeded by Atys, who reigned for twenty-six years, followed by Capys, who reigned twenty-eight years, and Capetus, who ruled for thirteen years.\nCapetus' successor, Tiberinus, was drowned crossing the river Albula, which was henceforth known as the Tiber in his memory; Dionysius says that he was slain in battle, and his body carried away by the river, after a reign of eight years.  Tiberinus was followed by Agrippa, who ruled for forty-one years, and was succeeded by his son, Romulus Silvius, whom Dionysius calls Allocius.  Livy states simply that he was struck by lightning, but Dionysius describes him as tyrannical and contemptuous of the gods; he imitated thunder and lightning, so as to appear like a god before the people, whereupon he and his whole household were destroyed by thunder and lightning, and overwhelmed by the waters of the adjoining lake, after a reign of nineteen years.  He bequeathed his throne to Aventinus, who reigned for thirty-seven years, and was buried on the hill that bears his name.  He was followed by Proca, who reigned for twenty-three years.\nProca had two sons, Numitor and Amulius; his will was that he be succeeded by the elder son, Numitor, but Amulius drove out his brother, claiming the throne for himself.  He had his brother's sons put to death, and appointed Numitor's daughter, Rhea Silvia, a Vestal Virgin, supposedly to do her honour, but in fact to ensure her perpetual virginity and prevent any further issue in her father's line.  But Rhea was raped, and gave birth to twin sons, Romulus and Remus; she claimed that their father was Mars himself.  Amulius had her thrown in prison, and ordered the infants thrown into the Tiber.  But as the Tiber was swollen and its banks unreachable, the boys were exposed at the base of a fig tree, where they were suckled by a she-wolf, and then discovered by the shepherd Faustulus, who raised them with the aid of his wife, Acca Larentia.  When they had grown to manhood, Romulus and Remus contrived to assassinate their wicked uncle, and restored their grandfather to the throne.  According to Dionysius, Amulius reigned forty-two years.\nThe following year, which Dionysius makes the four hundred and thirty-second since the fall of Troy (i.e. 751 BC, only two years later than the era of Varro), Romulus and Remus set out to establish an Alban colony, which ultimately became the city of Rome.  As Numitor had no further issue, the Silvian dynasty of Alba Longa ends with him.\nAfter the Silvii\nNothing further is reported of Alba Longa or its kings until the time of Tullus Hostilius, the third King of Rome, who according to tradition reigned from approximately 673 to 642 BC.  During his reign, a series of cattle raids between Roman and Alban territory led to a declaration of war by Hostilius.  At that time, the Alban king was Gaius Cluilius, whose relationship to the Silvii, if any, is entirely unknown.  He set about arming the Alban populace and preparing for war, and constructed a large trench around the perimeter of Rome.  However, he died before the two sides could engage in battle.  It is not known whether he had any sons to succeed him in the kingship; the ancient historians report only that the military command was entrusted to Mettius Fufetius, who negotiated that the war be decided by a contest of champions; victory fell to Rome when the Horatii defeated the Curiatii, and peace was restored.\nLater, Fufetius arranged to join Fidenae in a revolt against Roman authority, aided by the Etruscan city of Veii.  At a crucial point in the battle between the Roman and Fidenate armies, Fufetius, in command of the Alban forces ostensibly allied with Rome, withdrew from the field.  After this betrayal, Hostilius determined to revenge himself upon both Fufetius and Alba Longa.  By a ruse he induced the surrender of the Albans, and had Fufetius torn asunder by horses; he then forcibly relocated the entire Alban populace to Rome, and razed the city of Alba Longa to the ground.\nDevelopment\nThe traditions relating to the origins of Rome and the Latins belong to the realm of Roman mythology.  This is not to say that the persons or events related in such traditions did not exist, or were solely the product of deliberate invention by later generations.  But the earliest surviving records and accounts postdate the period of the Alban kings by several centuries, leaving little basis upon which to evaluate their historicity.  In particular, the tradition connecting the founding of Alba Longa with the flight of Aeneas from Troy was only one of a number of stories about the origins of Rome, and although doubtless ancient, it shows the hallmarks of having developed over a long period.\nThe first literary suggestions that the Romans were descended from survivors of the Trojan War are found among the Greek writers, many of whom considered the Romans descendants of the Achaeans, rather than the Trojans.  At the conclusion of the Theogony, Hesiod mentions Latinus and Agrius as sons of Odysseus and Circe; Agrius ruled over the Tyrrhenians, originally a somewhat vague term for the inhabitants of central Italy, which in later times was applied specifically to the Etruscans.  This passage reveals Hellenic interest in the peoples of Italy dating to at least the eighth century BC.  In this account, the Romans are descended from Odysseus, one of the Achaeans, rather than his contemporary, the Trojan prince Aeneas.  Writing in the fourth century BC, Heraclides Ponticus, a pupil of Plato, referred to Rome as a \"Greek city\".  About the same time, Aristotle related a tradition that Achaean warriors returning home after the Trojan War were driven to Italy by a storm.  Stranded on the Italian shores with a number of captive Trojan women, they built a settlement called \"Latinium\".\nThe Etruscans were particularly interested in the myth of Aeneas and Anchises from at least the late sixth century BC.  Perhaps influenced by Hesiod, they originally considered the Greek Odysseus to be their founder-hero, but later embraced Aeneas as their founder due to their growing rivalry with the Greek city-states of Italy; increasingly they perceived the Greek colonists as their enemies, rather than partners in trade.  Aeneas is depicted on a number of black-figure and red figure vases unearthed in southern Etruria, dating from the end of the sixth century to the middle of the fifth century BC.\nBeginning in the late seventh century BC, Roman culture was heavily influenced by the Etruscans.  Lucius Tarquinius Priscus, the fifth king of Rome, and his grandson, Lucius Tarquinius Superbus, the seventh and last king, were Etruscans, and it may have been during this period that the Etruscan interest in Aeneas was transmitted to Rome.  Writing toward the end of the third century BC, Quintus Fabius Pictor, the father of Roman history, related the story that the Romans were descended from Aeneas, via his son Ascanius, the founder of Alba Longa.  In his account of Roman origins, Pictor described a continuous history of Greek exports to Italy, including the landing of Heracles and the establishment of a colony on the Palatine Hill by the Arcadians under Evander, to whom he attributed the introduction of the alphabet.\nIn the second century BC, Marcus Porcius Cato, better known as Cato the Elder, composed his own history of Roman origins, following the existing traditions relating to Aeneas and his descendants; but to Cato, the Aborigines were themselves Greeks, and Romulus received the Aeolic tongue from Evander.\nLater influence\nIn the Iliad, the god Poseidon prophesied that the descendants of Aeneas (the Aeneadae), would survive the Trojan War and rule their people forever, but also that the rule of the Aeneadae would never happen in Troy. Virgil provided the imperial legacy of the Aeneadae by making Iulus the divine ancestor of Augustus in the Aeneid. From this divine connection the line of Aeneas stretched through Romulus, Augustus, and the Julio-Claudian emperors down to Nero.\nThe Julii\nPlan of the forum of Augustus. In the northwest [[hemicycle, a statue of Aeneas (here labeled \"Statue d'Énée\") is flanked by the kings of Alba Longa to the south and members of the gens Julia to the north.]]\nIt was popular in the late Roman Republic for the more distinguished families to claim divine origin, and it was believed that Iulus (Ascanius) was the mythical ancestor of the gens Julia. A notable member of the family, Julius Caesar, is said to have gone to Mount Alba to preside over the Feriae Latinae, Latin rites originally celebrated by the kings of Alba Longa.  This confused many Romans, who hailed him as king upon his return to Rome.  Mindful of the Republic's ancient traditions, including one by which any person claiming to be King of Rome was to be put to death, he rejected this honour.\nIn the Forum of Augustus, statues of the kings of Alba Longa and members of the Julian family were placed with Aeneas in the northwest hemicycle. In that hemicycle were the statues of Aeneas, the kings of Alba Longa, and M. Claudius Marcellus, C. Julius Caesar Strabo, and Julius Caesar (the adoptive father of Augustus) among others. The northeast hemicycle had summi viri placed with Romulus. Augustus' funerary procession reflects the same kind of propaganda as his \"Hall of Heroes\" and included many of the same statues, with one headed by Aeneas and the other by Romulus. In propagating his apotheosis, Augustus chose to include his adoptive father Julius Caesar who had recently achieved divinity himself, whereas Aeneas and Romulus are included for their divinity was well established.\nRoman mythology\nKings of Alba Longa would have claimed to be descendants of Jupiter as Virgil demonstrates in the Aeneid. He represents the Alban kings as being crowned with a civic oak-leaf crown. The Roman kings then adopted the crown, becoming personifications of Jupiter on earth. Latinus was thought to have become Jupiter Latiaris after \"vanishing\" during a battle with Mezentius (king of Caere). So too, Aeneas disappeared from a battle with Mezentius or with Turnus, and became Jupiter Indiges. Romulus (not unlike his Alban predecessors) became Quirinus, the \"Oak-god\", when he was called up to heaven.\nMedieval Europe\nGeoffrey of Monmouth, a Benedictine monk living in the 12th century AD, wrote a fabricated history of the kings of Britain (Historia Regum Britanniae). In this history Britain is said to receive its name from Brutus, the first of its kings. According to him, Brutus was the son of Silvius and the grandson of Aeneas. While on a hunting trip with his father he accidentally shoots him and so flees Italy. First, Brutus goes to Greece and gathers Trojan companions who join him on his journey to Britain, where he takes the island from a race of giants.\nBenoît de Saint-Maure names Charlemagne as a descendant of the mythical Francus, thus linking the Plantagenet family to Aeneas. Francus, like Aeneas, survived the destruction of Troy and travelled to find a new home. He installed a territory with other Trojans comprising the entire Rhine and the Danube and founded a powerful village named Sicambri.\nHistoricity\nThe ancient historian Dionysius of Halicarnassus is believed to have invented the Alban chronology to fill the gap of centuries between the fall of Troy and the founding of Rome. This could have been achieved by him taking the Roman history as it was, comparing it with the Greek, and inserting Greek Olympiads or Athenian archons. This method would have made the Greek histories seem contemporary with the people and events in the Roman history of his time.\nThe names of the kings are often based on places around Rome, such as Tiberinus, Aventinus, Alba, and Capetus. Others are rationalizations of mythical figures, or pure inventions to provide notable ancestors for status-seeking families. In the Aeneid, Virgil invents characters into living beings not unlike the heroes of Homer. The events described toward the end of the Aeneid were a nationalistic interpretation of perceived historical events in Roman history. However, despite being a later invention, the Silvian house or gens Silvia likely did exist.\nIn literature\n*In Dante's Paradiso, Canto VI, the soul of Eastern Roman Emperor Justinian I describes a brief history of the Romans to Dante. He begins with Aeneas arriving in Italy and avenging the death of Pallas (whom ancient writers credit for settling the Palatine hill of Rome). Justinian claims Alba Longa held the Imperial eagle for three centuries until its defeat by Rome following the duel between the three Horatii and the three Curiatii.\n*In the Nuremberg Chronicle (Hartmann Schedel, 1493), the kings of Alba Longa are listed as according to Livy, Dionysius of Halicarnassus, and Ovid. They are used in comparison to date the time in which various Biblical figures were alive.\n*In Historia regum Britanniae (Geoffrey of Monmouth), the reigns of several kings of Alba Longa are used to provide context for many Biblical events and the lifetimes of historical persons. This links the early kings of Britain to the House of Silvius.\nFamily tree\nSee also\n*Kings of Rome\n*Aborigines\n*Albani people\n*Translatio imperii\nInscriptions\nNotes\nReferences\nSources\n*Dionysius of Halicarnassus; Ernest Cary (Translator); William Thayer (Editor) (1937-1950, 2007). [https://penelope.uchicago.edu/Thayer/E/Roman/Texts/Dionysius_of_Halicarnassus/home.html   Roman Antiquities]. Loeb Classical Library. Cambridge, Chicago: Harvard University, University of Chicago. Retrieved 13 July 2009.\n*Livius, Titus; D. Spillan (Translator) (1853, 2006). [http://www.gutenberg.org/ebooks/19725 The History of Rome, Books 1 to 8.] Project Gutenberg. Retrieved 13 July 2009.\n*Origo Gentis Romanae; Kyle Haniszewski, Lindsay Karas, Kevin Koch, Emily Parobek, Colin Pratt, Brian Serwicki (Translators); Thomas M. Banchich (Supervisor). [http://www.roman-emperors.org/origogentis.pdf The Origin of the Roman Race] Canisius College Translated Texts, Number 3 Canisius College, Buffalo, New York 2004.\n*Barthold Georg Niebuhr; Julius Charles Hare, Connop Thirlwall (Translators).[https://books.google.com/books?id=7D8GAAAAQAAJ&pg=PP1 The History of Rome, Volume 1] Fellows of Trinity College, Cambridge.\nfr:Albe la Longue#Rois d’Albe la Longue"
    }
  ]
}