{
  "content": [
    {
      "type": "text",
      "text": "# Kingfisher Sky\n\nKingfisher Sky is a Dutch progressive metal band from the Netherlands, created and led by drummer Ivar de Graaf.\nHistory\nThe history of Kingfisher Sky started in 2001, after drummer Ivar de Graaf left Within Temptation, to pursue his own musical interests, and founded Jambone, with the idea to cover classic rock bands. The band featured Edo Van Der Kolk on lead guitar and Michiel Parqui on bass guitar. Edo had already known Ivar for fifteen years and the trio had been playing together since high school, experimenting with various styles of music. They found a lead vocalist in the classically trained singer Judith Rijnveld and, when Zelda Weski joined as backing vocalist, the line-up was completed. Too widespread are the musical influences of Ivar and together with Judith as the songwriter they explored a way to combine their compositions into songs that did not bound themselves to a specified genre or were not tied to a particular single style, with the two female voices giving soul and melody to contrast the heavy groove-oriented music.\nThe band released a 5-track demo in January 2002, but Michiel and Zelda left in October 2003 and Edo took a hiatus. One year later, Ivar decided to change the name to Kingfisher Sky and the duo started recording songs in their home studio in 2005. At an early stage, Eric Hoogendoorn was chosen as the permanent bassist and guitarist Daan Janzing, who was introduced by Ruud Jollie, was recruited next. George van Olffen on keyboards followed soon after. This resulted in a demo containing 11 tracks in October 2006 and a record deal with Suburban Records was signed in the same year. Edo appeared on the demo as a guest musician, playing a guitar solo on the demo version of \"Through My Eyes\", before returning full-time in 2007, completing the band for the time being.\nIn June 2007 they recorded their first album, produced by Jochem Jacobs and Bouke Visser, in various studios under the inspiring leadership of the producer duo. Hallway of Dreams was released in October of the same year and received with great reviews and, since then, the band has completed numerous shows as support for related bands such as Delain and Epica with a successful headline tour throughout the Netherlands followed. Within the scope of a special show in their hometown, Kingfisher Sky was joined by classical cellist Maaike Peterse, who played along on \"Big Fish\". As this cooperation proved to be very successful, Maaike soon became the seventh band member. In March 2008, Laser's Edge Records released Hallway of Dreams in the United States. Japan followed in 2008. It was also released on Vinyl by Tonefloat Records. Hallway of Dreams later became available in the United Kingdom, Italy, France and Germany.\nGeorge van Olffen left the band in July 2009 to pursue other musical interests. With René Merkelbach the band found a new keyboardist, until David Gutierrez Rojas joined in November 2010. In April 2010, the band announced that guitarist Daan Janzing was about to leave Kingfisher Sky in order to fully concentrate on his other band My Favorite Scar. Chris Henny later joined as the new guitarist. Kingfisher Sky released their second album Skin of The Earth on 23 September 2010.\nIn May 2014 Eric Hoogendoorn left Kingfisher Sky and he was replaced by Nick Verschoor. After a successful crowdfunding campaign the money was raised to start recording their third album, Arms of Morpheus, which was released in October 2014. The album features Kristoffer Gildenlöw on bass on several tracks. In the beginning of 2016, keyboard player David Guiterrez Rojaz left the band to pursue other interests. He was replaced with Erik van Ittersum. A few months later, guitarist Chris Henny also parted ways with the band.\nStyle\nIvar's progressive rock and traditional folk music influences collided with Judith's classical conservatory background, and also her preference for soul. Combined with their mutual love for bands and artists, like Aretha Franklin, Porcupine Tree, Jethro Tull, Peter Gabriel, Kate Bush, Tori Amos, Cecilia Bartoli, Mother's Finest, King's X, Skunk Anansie, Anouk, Heart, Clannad, Mike Oldfield and Pink Floyd, new songs were written.\nBand members\nCurrent\n* Ivar de Graaf – drums, additional guitars and keyboards (2001–present)\n* Judith Rijnveld – lead vocals (2001–present)\n* Edo Van Der Kolk – lead guitar (2001–2003, 2007–present)\n* Maaike Peterse – cello (2008–present)\n* Nick Verschoor – bass guitar and double bass (2014–present)\n* Erik van Ittersum – keyboards (2016–present)\nFormer\n* Michiel Parqui – bass guitar (2001–2003)\n* Zelda Weski – backing vocals (2001–2003)\n* George van Olffen – keyboards (2006–2009)\n* Daan Janzing – lead and rhythm guitars (2006–2010)\n* Eric Hoogendoorn – bass guitar (2006–2014)\n* René Merkelbach – keyboards (2009–2010)\n* David Gutierrez Rojas – keyboards (2010–2016)\n* Chris Henny – rhythm guitar (2010–2016)\nTimeline\nTimeAxis = orientation:horizontal format:yyyy\nColors =\nid:vocals      value:red          legend:Lead_Vocals\nid:bvocals     value:pink         legend:Backing_Vocals\nid:lead        value:teal         legend:Lead_Guitar\nid:rhythm      value:brightgreen  legend:Rhythm_Guitar\nid:cello       value:drabgreen    legend:Cello\nid:bass        value:blue         legend:Bass_Guitar\nid:upright     value:darkblue     legend:Double_Bass\nid:keys        value:purple       legend:Keyboards\nid:drums       value:orange       legend:Drums\nid:studio      value:black        legend:Studio_Album\nid:other       value:gray(0.6)    legend:Demo,_EP\nid:bars        value:gray(0.95)\nBackgroundColors = bars:bars\nLegend = orientation:vertical position:bottom columns:4\nScaleMajor = increment:1 start:2002\nLineData =\nlayer:back\ncolor:studio\nat:10/21/2007\nat:09/24/2010\nat:10/24/2014\nat:03/23/2018\nat:11/08/2024\nLineData =\nlayer:back\ncolor:other\nat:06/01/2002\nat:06/01/2006\nat:01/27/2017\nat:06/18/2021\nBarData =\nbar:Judith   text:\"Judith Rijnveld\"\nbar:Zelda    text:\"Zelda Weski\"\nbar:Edo      text:\"Edo Van Der Kolk\"\nbar:Daan     text:\"Daan Janzing\"\nbar:Chris    text:\"Chris Henny\"\nbar:Maaike   text:\"Maaike Peterse\"\nbar:Michiel  text:\"Michiel Parqui\"\nbar:Eric     text:\"Eric Hoogendoorn\"\nbar:Nick     text:\"Nick Verschoor\"\nbar:George   text:\"George van Olffen\"\nbar:Rene     text:\"René Merkelbach\"\nbar:David    text:\"David Gutierrez Rojas\"\nbar:Erik     text:\"Erik van Ittersum\"\nbar:Ivar     text:\"Ivar de Graaf\"\nPlotData=\nwidth:11 textcolor:black align:left anchor:from shift:(10,-4)\nbar:Judith   from:07/03/2001 till:end         color:vocals\nbar:Zelda    from:09/05/2001 till:10/01/2003  color:bvocals\nbar:Edo      from:05/01/2001 till:10/01/2003  color:lead\nbar:Edo      from:03/01/2007 till:end         color:lead\nbar:Daan     from:03/01/2007 till:04/01/2010  color:rhythm\nbar:Daan     from:03/01/2006 till:03/01/2007  color:lead\nbar:Daan     from:03/01/2006 till:03/01/2007  color:rhythm  width:3\nbar:Chris    from:04/01/2010 till:06/01/2016  color:rhythm\nbar:Maaike   from:05/01/2008 till:end         color:cello\nbar:Michiel  from:05/01/2001 till:10/01/2003  color:bass\nbar:Eric     from:02/01/2006 till:05/01/2014  color:bass\nbar:Nick     from:05/01/2014 till:end         color:bass\nbar:Nick     from:05/01/2014 till:end         color:upright width:3\nbar:George   from:04/01/2006 till:07/01/2009  color:keys\nbar:Rene     from:07/01/2009 till:11/01/2010  color:keys\nbar:David    from:11/01/2010 till:02/01/2016  color:keys\nbar:Erik     from:02/01/2016 till:end         color:keys\nbar:Ivar     from:05/01/2001 till:end         color:drums\nbar:Ivar     from:05/01/2001 till:end         color:rhythm width:3\nbar:Ivar     from:05/01/2001 till:end         color:keys   width:7\n}}\nDiscography\n;Studio albums\n*2007: Hallway of Dreams\n*2010: Skin of the Earth\n*2014: Arms of Morpheus\n*2018: Technicoloured Eyes\n*2024: Feeding the Wolves\n;Singles and EPs\n*2007: Hallway of Dreams\n*2008: November\n*2014: King of Thieves\n*2017: To Turn the Tables\n*2018: Cornelia\n*2021: Rise\n*2022: Walk the Plank\nReferences\nExternal links\n*[http://www.kingfishersky.com Official website]"
    }
  ]
}