{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of Katsina\n\n}}\n| image_map              =\n| map_caption            =\n| capital                = Durbi Takusheyi(1100-15th century)Katsina(15th century-1904)\n| religion               = Hausa animism,later replaced by Islam\n| demonym                =\n| government_type        = Sarauta\n| area_rank              =\n| status                 = State from 1100-1904Currently a non-sovereign monarchy in Nigeria\n| image_map_caption      =\n| common_languages       =\n| title_leader           = Sarki\n| year_leader1           = ?\n| leader1                = Kumayo (first)\n| year_leader2           = 1445-1495\n| leader2                = Muhammad Korau\n| year_leader3           = 1805/6\n| leader3                = Magajin Halidu\n| year_leader4           = 1887-1904\n| leader4                = Abubakar (last sovereign)\n| year_leader5           = 2008-present\n| leader5                = Abdulmumini Kabir Usman\n| s1                     = Maradi Sultanate\n| s2                     = Katsina Emirate\n| today                  = Nigeria\n}}\nThe Kingdom of Katsina was a Hausa kingdom centred on the city of Katsina in modern-day northern Nigeria that was established some time in the early second millennium CE, and endured until its conquest in 1805/6 during the jihad of Usman dan Fodio. Following this, its dynasty was replaced with a Fulani one subordinate to the Sokoto Caliphate, and the polity continues to exist today as the Katsina Emirate, a non-sovereign monarchy in Nigeria.\nKatsina was one of the Hausa Bakwai states, believed to be founded by Kumayo, a descendant of Bayajidda according to legend. Throughout its history, Katsina has been governed by various dynasties, and was a vassal to neighboring empires such as Songhai and Bornu. At its peak, Katsina's capital was a prominent city in the western Sudan, attracting scholars from the wider region, especially during the decline of Timbuktu in the 17th and 18th centuries.\nEtymology\nIn accordance with oral tradition, the name \"Katsina\" is said to have originated from a princess of Daura who wedded Janzama, the ruler of the Durbawa of Durbi ta Kusheyi.\nAccording to H. R. Palmer, similar to names like \"Masinna\" (Machinna) and \"Teshinna\" (Tachinna), which feature the suffix \"inna,\" derived from the Tamashek word for \"mother,\" the first part of \"Katsina\" may have its roots in words like \"izze\" (Tamashek for \"son\") and \"mazza\" (Hausa for \"men\"). This could imply a meaning along the lines of \"children of\" or \"sons of.\" Alternatively, it could potentially have originated from \"Asheni\" (Tamashek for \"blood\").\nAnother local tradition claims that when Korau usurped the throne in the 13th-century, he named the town of Katsina after his eldest sister.\nHistory\nOrigins\nmarked on a map of Katsina state]]\nAccording to oral tradition, the first dynasty to rule over Katsina was established by Kumayo, a grandson of the legendary Bayajida, and thus the city-state was part of the Hausa Bakwai states. Katsina's regnal list dates this to 1015 CE. Kumayo's reign was centered around Durbi ta Kusheyi (meaning \"tombs of the chief priest\"), a settlement near Mani, approximately 18 miles southeast of the present-day city of Katsina. Today, the district leader of Durbi ta Kusheyi still holds the title of Durbi. The original inhabitants of the town are referred to as the Durbawa. Within the town, there are seven prominent burial mounds believed to contain the remains of early rulers of Katsina, including figures such as Kumayo, Ramba-Ramba, and Sanau.\nJanzama, king of the Durbawa, wedded a princess from Daura and was eventually subdued by Kumayo. A rock near Mani bears his name as a testament to his historical significance. The early monarchs were chosen alternatively from both houses, with the descendants of Janzama being referred to as Larabawa (the Arabs), signifying their connection to Bayajidda. In the 13th and 14th centuries the territory was inhabited by various Hausa-speaking chiefdoms, including Durbi ta Kusheyi.\nKorau's dynasty\nAccording to oral tradition, the final ruler from Kumayo's lineage was Sanau, who was killed in the middle of the 15th-century.}} at the hands of a certain mallam (Islamic scholar) named Muhammad Korau, hailing from Yandoto (in modern-day Chafe). Subsequently, Korau established a new dynasty. He was the polity's first Muslim ruler, and is credited with founding the walled settlement (birane) that would become Katsina, which was advantageously located at a crossroads for trade and was near an iron-mine and an important shrine. (palace of the Sarkin Katsina)]] Korau, whose name may have derived from kora,'' meaning \"to drive out\", had a background in wrestling and was a close companion of Sanau. Although Sanau was also a wrestler, he achieved greater success and local recognition as a champion. Rumors began to circulate that Sanau's wrestling prowess was attributed to a protective charm he wore around his waist during matches. Korau, aware of this advantage, devised a plan to challenge Sanau to a wrestling match, as the sarki (king) was obligated to accept such challenges. His strategy revolved around challenging Sanau during a feast to which Sanau, as sarki, had invited him. However, before attending the event, Korau managed to persuade Sanau's wife to steal her husband's charm.\nThe contest took place near Bawada, a tamarind tree. Today, the tree stands on the site occupied by the Kangiwa (\"elephant's head\"), as the residence of the sarki was called. During the match, Sanau was quickly tackled moments into the fight as he was powerless without his charms. While on the ground, Korau acted swiftly, drawing a sword and fatally stabbing the sarki. Sanau lost his life, and Korau was subsequently crowned as the Sarkin Katsina (\"King of Katsina\").  Even today, the ''sarki's kirari (praise poetry) includes the phrase \"Magajin Korau, Mayen Sauri, Yanka Mashidi Bakon Sanau'',\" which translates to \"successor of Korau, wizard of Sauri, guest of Sanau who killed his host\", commemorating this dramatic and fateful turn of events in Katsina's history.\nKorau's dynasty was known as the Wangarawa, a name likely derived from the Wangara history associated with his hometown of Yandoto. Despite the under-handed methods Korau used to capture the throne of Katsina, the Durbawa, who were on the receiving end of his treachery, managed to maintain an 'amicable' relationship with the Wangarawa. In fact, their relationship appeared to have mended to the extent that the Durbawa were once again considered as candidates for new chiefs during elections. The Durbawa were regarded as the repositories of all knowledge concerning the local deities and spirits, good or evil.\nAccording to the Katsina Chronicle, during Korau's reign spanning from approximately 1445 to 1495, he launched military campaigns against surrounding polities, as well as against the Nupe kingdom and Kwararafa. Chiefs paid him tribute in iron bars, beginning the haraji (poll tax). Importantly, Muhammadu Korau's era witnessed Islamisation within Katsina, partly attributed to the visit of the renowned Maliki scholar from Tuat Muhammad al-Maghili in 1493.  During Korau's reign, the Gobirau mosque was established and it functioned as a university. The kingdom attracted Islamic scholars from North Africa and from older Islamic centres such as Walata and Timbuktu.\nMuhammadu Korau was succeeded by Ibrahim Sura (reigning from 1493-99). He was sad to have captured Kwiambana and Koton Koro, and took steps to further strengthen Islam in Katsina. Notably, Ibrahim Sura issued a decree that required his subjects to choose between prayer or imprisonment. Unlike in Kano, where the aristocracy hesitated, the talakawa (peasants) embraced Islam in Katsina during this period. Ibrahim was succeeded by Ali Murabus who is credited with having constructed the gamuwar Amina, which are the outer walls of Katsina, and was subsequently called murabit (\"man of the ribat\")\nSonghai conquest and rule\n]]\nHausaland became a destination for visiting scholars from the Sankore University of Timbuktu. Katsina, in particular, benefited from the influx of Islamic scholars, including individuals like Makhluf bin Ali and Muhammad bin Ahmed. The latter, Muhammad bin Ahmed, remained in Katsina and was appointed as an Alkali. The spread of Islam in Katsina received further impetus when Haj Muhammad, the first Askia of the Songhai Empire and a devout Muslim, conquered Katsina in 1512. During this period, Katsina essentially became a vassal of Gao, but it eventually regained its independence in 1554 following the battle of Karfata against Askia Daud. The Tarikh al Sudan describes the battle asAskia Daud went to Kukia, whence he sent the Hi-Koi, Ali Dudo, against Katsina at the head of a detachment consisting of 24 horsemen. This detachment encountered, at a place called Karfata, a body of 400 horsemen belonging to the people of Lipti in the country of Katsina. The two forces engaged in a hand-to-hand fight, which was very long and very bloody.\nThe Katsina people killed 15 of their enemy, among whom was the Hi-Koi, mentioned above. They took the remaining nine, all of whom were wounded, prsioner – including among them 'Alouaz-Lil, the son of Faran Umar-Komzagho and father of Qasem, Bokar-Chili-Idji, Muhammad-Della-Idji, etc. The victors took care of the wounded and gave them back to Askia Daud, telling them that 'men of such quality, endowed with such great valour and such courage, did not deserve to die'. The vigour and daring of these warriros so amazed the people of Katsina that ever afterwards they spoke of them as models to be followed.During this period, Katsina experienced considerable growth, expanding to cover a circuit of approximately seven or eight miles. The city became highly diverse with numerous principal quarters and neighborhoods, including the official quarter, old quarter, and distinct areas for residents from Bornu, Gobir, Mali, Songhai, and Agadez. Additionally, there were quarters dedicated to various trades, a students' quarter, a dancing quarter, and a quarter situated at each of the eight city gates.\nConflicts with Kano\nDuring the reign of Rumfa of Kano, an eleven-year war erupted between the two Hausa city-states, but it remained indecisive. It was only during the rule of his son and successor, Abdullahi, that Kano managed to defeat Katsina, bringing an end to the war. However, in the 1570s, Katsina launched an attack, causing significant damage and advancing right up to the gates of Kano. Towards the end of the century, Muhammad Zaki, Sarkin Kano, retaliated by raiding Katsina, taking prisoners and horses on the last day of that year's Ramadan. Katsina attempted a counterattack not long after but failed at Karayi. A century later, during the reign of Uban-Yari (also known as Muhammadu Dan Wari) in Katsina, the city led multiple battles against Kano, resulting in the deaths of several Sarkunan Kano, including figures like Magani Mai Amfani Baki, Kutumbi, and Alhaji. However, the two Muslim states eventually set aside their differences and signed a treaty of alliance against their common enemy, Kwararafa.\nIn 1653, Kwararafa, led by Adashu, launched an attack on Kano, penetrating the city's gates. In 1671, Kwararafa breached Kano once more, resulting in the slaughter of many inhabitants, with the Sarkin Kano fleeing to the neighboring Daura. Around the same time, Kwararafa also invaded Katsina, breaching its city walls and controlling the western section of the city. They threw numerous city inhabitants into a large pit, now known as Giwa-Rano. Curiously, like in Kano, despite the opportunity to do so, Kwararafa did not fully occupy the city. According to oral tradition, it is believed that the Kwararafa general, while mounting his horse, was kicked in the groin and died on the spot due to the prayers of Dan Masani. This incident led to the Kwararafa army's retreat from the city, sparing Katsina from further occupation.\nPivot towards Bornu\nTowards the end of the 16th century, following the decline of the Songhai Empire, Katsina shifted its allegiance to the Bornu Empire. As part of this alliance, each newly enthroned Sarkin Katsina was expected to send a tribute of a hundred slaves to the Mai of Bornu in Ngazargamu. This tribute practice continued until the reign of Agwaragi (1784/5–1801/2). Bornu played a protective role for Katsina and achieved military successes, including capturing a thousand prisoners during a battle under the rule of Mai Haj Ali. Ibn al-Ṣabbāgh (Dan Marina), the renowned poet and saint from Katsina, composed a poem to commemorate Mai Ali of Bornu's victory over Kwararafa and their eventual expulsion from Hausaland.  According to Muhammad Bello of Sokoto in his Infaq al-Maysur, Katsina also paid tribute to Zaria during the reign of Queen Amina (1576–1610).\nDuring this period, Katsina rose to prominence as one of the leading cities in the western Sudan. Its zenith of prosperity and influence was in the early 18th-century. Scholars increasingly visited Katsina, favoring it over Timbuktu. Katsina also produced well respected scholars such as the celebrated Muhammad Al-Fulani Al-Kishwani of the Gobirau University.  Scholars in cities like Yandoto and Zaye (known today as Birnin-Katsina) gained gained fame for their works in the fields of mathematics, occult sciences (magic squares, ulum al awfaq) and letter images (ulum al harif). The leather-working trade from Agadez, introduced by the Songhai, became a significant industry in the kingdom.  The explorer Heinrich Barth, who visited the kingdom a century later, described the period as:[In Katsina] the Háusa language here attained the greatest richness of form and the most refined pronunciation so also the manners of Katséna were distinguished by superior politness from those of the other towns of Háusa.Katsina also evolved into a vital commercial center, attracting numerous caravans from different directions. It assumed the role that Kano had previously held as the epicenter of commerce in Hausaland. Katsina's influence extended to regions such as Maradi in the north, Zamfara in the west, and encompassed territory to the south as far as Birnin Gwari. Barth further describes the period:The town, if only half of its immense area were ever tolerably well inhabited, must certainly have had a population of at least a hundred thousand souls, for its circuit is between thirteen and fourteen English miles. At present, when the inhabited quarter is reduced to the northwestern part, and when even this is mostly deserted, there are scarcely seven or eight thousand people living in it. In former times it was the residence of a prince, who, though he seems never to have attained to any remarkable degree of power, and was, indeed, almost always in some degree dependent on, or a vassal of the King of Bornu, nevertheless was one of the most wealthy and conspicuous rulers of Negroland. Every prince, at his accession to the throne, had to forward a sort of tribute or present to Birni Ghasréggomo, the capital of the Bornu empire, consisting of one hundred slaves, as a token of his obedience; but this being done, it does not appear that his sovereign rights were in any way interfered with. In fact, Katsena, during the seventeenth and eighteenth centuries of our era, seems to have been the chief city of this part of Negroland, as well in commercial and political importance as in other respects.\nFulani conquest\n(1798)]]\nAt the outset of the 19th century, an Islamic revolution swept across Hausaland, inspired by the Fulani scholar Shehu Usman dan Fodio. The Shehu's jihad initially began in the Gobir kingdom but quickly gained momentum across the region and even reached as far as the Bornu and Oyo empires. The primary objective of Usman's jihad was to reform Islam in Hausaland. The Sarakuna (rulers) of the Hausa kingdoms had incorporated elements of Bori (Hausa animism) into their practice of Islam. Furthermore, the influence held by Bori priests over the Sarakuna was deemed unacceptable for Muslim rulers by Usman and his followers. This religious revolution, or jihad, led to the establishment of the Sokoto Caliphate. For the first time in the region's history, it united all of Hausaland under a single ruler, the Sultan of Sokoto.\nThe Katsinawa offered support for the jihad. Much of this support came from the Sullubawa, a Fulani clan. Umaru Dumyawa, the leader ('Ardo') of the Sullubawa, resided near Zandam in Jibiya. When the jihad erupted in Katsina, Umaru Dumyawa, Na Alhaji, and Mallam Umaru from Dallaji near Bindawa went to assist the reformers and the Shehu. Na Alhaji was known as a mallam who had married one of the daughters of the Sarkin Katsina. All three individuals were of the Sullubawa Fulbe clan. (1927)|left]]The Shehu gave each of the three leaders a flag to lead the jihad in Katsina. According to Katsina tradition, Usman had difficulty deciding between them, so he initially gave each a separate flag. He instructed them to go and meet with Muhammad Bello, his son and vizier, for further guidance. Meanwhile, Umaru Dumyawa arrived back in Katsina, entering the Kofar Guga ('Gate of Guga'), and attacked the inhabitants and occupying the house of the Sarkin Sullubawa while Na Alhaji entered through Kofar Yandaka ('Gate of Yandaka') and fought the inhabitants there occupying the house of Yandaka. This is the origin of the 'great Katsina families' of the Sullubawa of Bugaje and the Yandakawa of Dutsinma.\nAnother version of the tradition suggests that after receiving their flags from the Shehu, the three leaders met at Runka and had a dispute. During the argument, Umaru Dallaji allegedly disrespected his superior Na Alhaji, leading to further tensions. Umaru Dallaji then proceeded alone to attack Katsina, while Na Alhaji retreated to Zakka and Umaru Dumyawa returned to Zandam.Note that the acclaimed incident  has been refuted by historical books and reputable historians. Dallaji's military campaign took him from Radda to Banye and eventually to Sabon Birni in Kaura, where he killed Mare Mawa Mahmudu, the Sarkin Katsina at the time. Following this defeat, approximately 30,000 Katsinawa, including members of the nobility, migrated to Dankama. They organized a counter-attack against Umaru Dallaji but were unsuccessful. The shame brought about by this defeat led Sarkin Katsina Halidu to take his own life by throwing himself down a well, effectively ending the Korau dynasty. The remainder of the exiled Katsinawa went further north and founded the city of Maradi (in modern-day Republic of the Niger).\nIn the dry season of 1805–6, Shehu Usman dispatched Umaru Dallaji to coordinate a meeting in Magami, which brought together leaders of the jihad from Kano, Daura, and Zamfara. While en route to launch a military campaign in Yandoto, Muhammad Bello met these jihad leaders in Birnin Gada and conveyed a letter from the Shehu. Due to his old age, Shehu Usman was unable to undertake the journey himself, but he instructed the leaders to formally pledge allegiance (bay'ah) to him as ''Amir al-Mu'minin (the Commander of the Faithful). Each of the leaders complied with this directive and subsequently dispersed to lead the jihad in their respective emirates. (1870)]]Despite Umaru Dallaje being the only recognised Emir of Katsina by the Sarkin Musulmi, Katsina had other lesser flag-bearers who communicated directly with the Sokoto government. These lesser flag-bearers included Umaru Dumyawa (Sarkin Sullubawa) and Muhamman Dikko (son of Na Alhaji) of the Yandakawa. In this context, the Emir of Katsina held a position that could be described as primus inter pares'' ('first among equals').\nAccording to historian Yusufu Bala Usman, the Dallazawa dynasty, to which Umaru Dallaji belonged, traced their ancestry back to an Arab named Muhammadu Goshi, who hailed from Wadai. Muhammadu Goshi settled in Makau, located near Giremawa on the plains east of Birnin Katsina, the capital of Katsina. The Dallazawa dynasty maintained its rule over Katsina until 1904 when Sarkin Katsina Abubakar was deposed by the British colonial administration.\nRoyal insignia\nThe short sword which Korau used to treacherously seize the throne of Katsina is now the insignia of Katsina and is known as Gajere ('the short one'). This blade exhibits influences from the Almohad and Ayyubid eras, and serves as the emblem of Katsina. It is adorned with an Islamic prayer inscription dating to the 13th century that reads, \"Help cometh from Allah and victory is nigh, so announce glad tidings to the faithful, O Muhammad!\". On the reverse side of the blade, another inscription reads, \"There is no sword save Dhu al Faqar and no hero save Ali.\" Usman Nagogo, the 50th Sarkin Katsina, carried Gajere in his hand during the 1959 royal durbar, marking a historic occasion, as it was the first time the sword was permitted to leave Katsina.Among Katsina's historical treasures, the Camel-Drum or Bronze Pot of Korau holds a prominent place. It is famously mentioned in a Hausa song that extols \"Korau Abu hungurum, Korau mai tukunyar karfe\" meaning \"Korau the invincible, Korau the possessor of the brazen pot\". This pot was used to prepare charms for the king's officials and officers before a battle.\nAnother significant relic is the Bebe sword, known as \"the deaf one\", which was once owned by Yakubu, Sarkin Gobir. The sword was taken after his defeat to Agwaragi, Sarkin Katsina, in the middle of the 18th-century.\nThen there is Gwauron Tamberi (\"the bachelor drum\") due to its imposing size, which towers above all other ceremonial drums. The drum was continuously beaten from the top of the Soron Bawada tower during wartime. This two-storied tower stands on the very site where Korau killed Sanau. The Tambura, responsible for playing the drum, observes specific traditions, including beating it three times during the turbanning ceremonies of senior district heads. Furthermore, the drum plays a central role in various festivals such as Eid al-Fitr and Eid al-Kabir.\nSarakunan Katsina\nThe Hausa rulers of Katsina according to historian S J Hogben.\n{| class=\"wikitable\"\n|+Hausa Sarakuna\n!Sarki\n!Reign\n!Notes\n|-\n! colspan=\"3\" |Durbawa and Larabawa (1100–1260)\n|-\n|Kumayo\n|\n|Grandson of Bayajidda and son of Bawo\n|-\n|Ramba-Ramba\n|\n|\n|-\n|Bata tare\n|\n|\n|-\n|Jarnanata\n|\n|\n|-\n|Sanau\n|\n|Killed by Korau\n|-\n! colspan=\"3\" |Wangarawa\n|-\n|Korau\n|1260–?\n|\n|-\n|Ibrahim Yanka Dari\n|?\n|\n|-\n|Jida Yaki\n|?\n|Ruled for 40 years\n|-\n|Muhammadu Korau\n|1492/3–1541/2\n|First Muslim sarki\n|-\n|Ibrahim Sura\n|1541/2–1543/4\n|Likely from Mali\n|-\n|Ali Murabus\n|1543/4–1568/9\n|'The Marabout' or 'holy man'\n|-\n|Muhammadu Toya Rero\n|1568/9–1572/3\n|\n|-\n|Aliyu Karya Giwa\n|1572/3–1585\n|'Karya Giwa' meaning 'Elephant slayer'. An eclipse of the sun in his reign\n|-\n|Usman 'Tsagarana'\n|1585–1589/90\n|'Eclipser of the sun'\n|-\n|Aliyu 'Jan Hazo'\n|1589/90–1595/6\n|'Red like the Harmattan'\n|-\n|Muhammadu 'Mai-sa-maza-gudu'\n|1595/6–1612/3\n|'the putter of men to flight.'\n|-\n|Aliyu 'Jan Hazo' II\n|1612/3–1614/5\n|\n|-\n|Maje Ibrahim\n|1614/5–1631/2\n|\n|-\n|Abdulkarim\n|1631/2–1634/5\n|\n|-\n|Ashafa\n|1634/5\n|\n|-\n|Ibrahim Gamda\n|1634/5–1644/5\n|\n|-\n|Muhammad Wari\n|1644/5–1655/6\n|Son of Abdulkarim\n|-\n|Sulaiman\n|1655/6–1667/8\n|\n|-\n|Usman Na yi Nawa\n|1667/8–1684/5\n|Son of 'Tsagarana'\n|-\n|Muhammadu Toya Rero II\n|1684/5–1701/2\n|\n|-\n|Muhammadu Wari II\n|1701/2–1704/5\n|\n|-\n|Uban Yari\n|1704/5–1706/7\n|Also known to 'some' as Muhammadu dan Wari\n|-\n|Karya Giwa II\n|1706/7–1715/6\n|\n|-\n|Jan Hazo III\n|1715/6–1728/9\n|Son of Muhammadu Wari\n|-\n|Tsagarana Hassan\n|1728/9–1740/1\n|Son of Toya Rero\n|-\n|Muhammadu Kabiya\n|1740/1–1750/1\n|Son of Usman. Also called 'Mai-kere' ('the bearer of the kere')\n|-\n|Tsagarana Yahya\n|1750/1–1751/2\n|\n|-\n|Karya Giwa III\n|1751/2–1758/9\n|Son of Jan Hazo\n|-\n|Muhammadu Wari III\n|1758/9–1767/8\n|\n|-\n|Karya Giwa IV\n|1767/8–1784/5\n|\n|-\n|Agwaragi\n|1784/5–1801/2\n|\n|-\n|Tsagarana Gwozo\n|1801/2\n|Buried at Dokau in Gusau (in modern-day Zamfara)\n|-\n|Bawa dan Gima\n|1801/2–1804/5\n|\n|-\n|Mare Mawa Mahmudu\n|1804/5–1805/6\n|Killed by Umaru Dallaji at Sabon Birni\n|-\n|Magajin Halidu\n|1805/6\n|\n|}\nFulani Emirs of Katsina\nNotes\nReferences\nha:Tarihin Katsina"
    }
  ]
}