{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of Sardinia–United States relations\n\nRelations between the Kingdom of Sardinia and the United States began in 1802 with mutual recognition, but formal relations were not established until 1839. Diplomatic relations ceased in 1861 when Sardinia was incorporated into the Kingdom of Italy.\nHistory\nRecognition between both countries began in 1802 when the Kingdom accepted U.S. Consular Agent François de Navoni in Cagliari. That same year, the United States opened a consulate in Cagliari. Although, the oldest consulate office in the Sardinia of the U.S. was located in Genoa. In 1815, a third consulate office opened in Nice with Victor Adolphus Sasserno as U.S. Consul. Sardinia’s first consul in the United States Gaspare Deabbate was accredited on May 18, 1820, as Consul General in Philadelphia. The Consulate in Philadelphia for the Kingdom was established in 1819. Today, the building is the Italian Consulate General.\nTalks to open full diplomatic relations between the United States and the Kingdom of Piedmont-Sardinia began in 1837. The original motivation was to stimulate trade and commercial ties between the two states. The United States wanted to modify duties imposed upon its tobacco exports to the kingdom. Moreover, it was hoped that by establishing diplomatic relations and developing trade, both countries would benefit. In addition to tobacco, the United States wanted an export market for raw cotton, fish, timber, and other manufactured items, while it sought to import the silk and cotton fabrics manufactured by Piedmont-Sardinia. Another issue at stake in diplomatic relations between the United States and the Kingdom of Piedmont-Sardinia was the U.S. desire for a Mediterranean port at which the U.S. Navy could refuel and restock. In June 1848 the Government of Piedmont-Sardinia granted permission for the United States to establish a naval depot at the port town of Spezia. The United States used Spezia until 1868 when Piedmont-Sardinia re-took Spezia for use for its own naval depot.\nOn November 26, 1838, the United States signed a Treaty of Commerce and Navigation with the King of Sardinia in Genoa. The agreement was signed by U.S. Special Agent to the Kingdom of Sardinia Nathaniel Niles Jr. and Count Clement Solar de la Marguerite, First Secretary of State for Foreign Affairs of the King of Sardinia.\nFormal relations began on February 7, 1839, when the United States accepted the credentials of Count August Avogadro de Collobiano as the first Chargé d’Affaires in Washington, D.C. for the Kingdom. The U.S. established a legation in Turin on September 15, 1840, with the accreditation of U.S. Chargé d’Affaires Hezekiah Gold Rogers.\nRelations ended in 1860 following the Unification of Italy when the kingdom was dissolved and incorporated into a singular Italian state. When the King of Piedmont-Sardinia, Victor Emmanuel II, was proclaimed King of Italy on March 17, 1861, George Perkins Marsh was appointed U.S. Minister to the King of Italy at Turin on April 26, 1861. That year, the Chargé d’Affaires from Piedmont-Sardinia, Joseph Bertinatti, was promoted to Italian minister-resident, later Minister Plenipotentiary of the Kingdom of Italy on April 11, 1861.\nSee also\n* Foreign relations of the United States\n* Italy–United States relations\n* Duchy of Parma–United States relations\n* Grand Duchy of Tuscany–United States relations\n* Kingdom of the Two Sicilies–United States relations\n* Papal States–United States relations\n* Republic of Genoa–United States relations\nReferences"
    }
  ]
}