{
  "content": [
    {
      "type": "text",
      "text": "# King Matt the First\n\nKing Matt the First () is a children's novel published in 1923 by Polish author, pediatrician, and child pedagogue Janusz Korczak. In addition to telling the story of a young king's adventures, it describes many social reforms, particularly targeting children, some of which Korczak enacted in his own orphanage, and is a thinly veiled allegory of contemporary and historical events in Poland. The book has been described as being as popular in Poland as Peter Pan was in the English-speaking world.\nIt was translated to English three times (1986, 1990  2014). It was the first of Korczak's novels to be translated into English – several of his pedagogical works have been translated, and more recently his novel Kaytek the Wizard was also published in English.\nPlot\nMatt is a child prince who is catapulted to the throne by the sudden death of his father.\nAt the beginning of his reign, Matt enacts several bold reforms aimed at improving life for the people of his kingdom, especially the children, but in spite of his best intentions, reality gets in the way producing many unintended consequences from silly to sinister.\nMatt tries to read and answer all his mail by himself and finds that the volume is too much and he needs to rely on secretaries. He is exasperated with his ministers and has them arrested, but soon realizes that he does not know enough to govern by himself, and is forced to release the ministers and institute constitutional monarchy.\nWhen a war breaks out, Matt cannot accept being shut up in his palace, but slips away and joins up, pretending to be a peasant boy - and narrowly avoids becoming a prisoner of war. He takes the offer of a friendly journalist to publish for him a \"royal paper\" -and finds much later that he gets carefully edited news and that the journalist is covering up the gross corruption of the young king's best friend. Matt tries to organize the children of the entire world to hold processions and demand their rights - and ends up antagonizing other kings. He falls in love with a black African princess and outrages racist opinion (by modern standards, however, Korczak's depiction of blacks is itself not completely free of stereotypes which were current at the time of writing). Finally, he is overthrown by the invasion of three foreign armies and exiled to a desert island.\nSequel\nThe story is continued in the sequel, King Matt on a Desert Island (), published in the same year and translated into English in 1990. The sequel tells of Matt's personal development in isolation, followed by his eventual return and reestablishment of democracy in his homeland.\nMajor themes\nKorczak often employed the form of the fairy tale in order to prepare his young readers for the dilemmas and difficulties of adult life, and the need to make responsible decisions.\nHistorical context\nThe novel was written at a time of great turmoil and hardship, and comments on contemporary and historical events. Poland, which had not existed as a sovereign nation during the 19th century (the period 1795–1918 – see History of Poland (1795–1918)) had just reemerged from the ashes of World War I. The Second Polish Republic had been formed in 1921, following the Greater Poland Uprising (1918–1919) against Germany, and success in the Polish–Ukrainian War (1918–19) and Polish–Soviet War (1919–21) – see History of Poland (1918–1939). Unemployment was high, and poverty was widespread.\nThe main Polish political figure of the time was Józef Piłsudski, then the elected leader, who later seized power in a coup in 1926. At the time of the partition of Poland, the last king of Poland was the reformer-king, Stanisław August Poniatowski, who, among other acts, founded Poland's first newspaper, Monitor.\nThe book also makes references to:\n* Partitions of Poland In the book, the three foreign kingdoms are not identified. However, the first kingdom has several harbors and cedes one to Matt, the second is vast and connected with the Orient, and the third is landlocked and friendliest. These accord respectively to Prussia, Russia, and Austria.\n* Sejm\n* Golden Liberty (widest franchise in Europe at the time)\n* Elective monarchy\n* szlachta (Polish nobility)\n* free election (wolna elekcja).\n* Maritime and Colonial League\n* Sarmatism\n* Polish sabre: Szabla\n* Port of Gdynia A significant plot point is the desire for a sea port, which is granted by the first kingdom (i.e. Germany).\n** The above is derived from Woodrow Wilson's Fourteen Points for Peace\n:13. An independent Polish state should be erected which should include the territories inhabited by indisputably Polish populations, which should be assured a free and secure access to the sea, and whose political and economic independence and territorial integrity should be guaranteed by international covenant.\n* Gdańsk\n* Free City of Danzig\n* Polish Corridor\nPersonal context\nThe author's father died in 1896, leaving Korczak, at 18, the head of the family and the sole breadwinner for his mother, sister, and grandmother.\nIn 1911–1912 Korczak became a director of Dom Sierot, an orphanage of his own design for Jewish children in Warsaw, where he formed a kind of a republic for children with its own small parliament, court and newspaper.\nIn 1926 Korczak let the children begin their own newspaper, the Mały Przegląd (Little Review), as a weekly attachment to the daily Polish-Jewish newspaper Nasz Przegląd (Our Review).\nDuring the Russo-Japanese War in 1905–1906 he served as a military doctor.\nIn 1914 Korczak again became a military doctor with the rank of Lieutenant during World War I. During the Polish-Soviet War he served again as a military doctor with the rank of major but was assigned to Warsaw after a brief stint in Łódź.\nLike his hero, Korczak went to death with dignity, refusing sanctuary to accompany his young charges to the Treblinka extermination camp in 1942. On their last march through the city of Warsaw, one of the children carried the green flag of King Matt\nCultural diversity\nMatt's friend and love interest is the African princess Klu Klu, who is depicted as a brilliant student and a fierce fighter, and the young King defies prejudice by openly loving her. However, the book reflects stereotypes common at the time in its general depiction of Africans as savage cannibals.\nPublication history\nKing Matt has been translated into English, Esperanto, German, Hebrew, Italian, Chinese, Japanese, Lithuanian, Latvian, Estonian, Armenian, Georgian, Ukrainian and Russian, and appeared in various editions, including:\n* 1922, Warsaw, Poland, Król Maciuś Pierwszy\n* 1924, Russia (Soviet Union), Ленинград: Сектор «Юный Пролетарий» Рабочего Изд-ва «Прибой», Приключение Короля Матюша, translated by Ю.Н.Райтлер. – 250 с.\n* 1945, New York, USA, \"Matthew the Young King\", Roy, 1945; adapted by Edith and Sidney Sulkin from the Polish tale of Janusz Korczak 256 pp.\n* 1957, Warsaw, Poland, König Hänschen I., translated by Katja Weintraub\n* 1958, Warsaw, Poland, Издательство «Полония», Король Матиуш Первый, translated by Муза Константиновна Павлова\n* 1964, Armenia, Հայպետհրատ, Երևան, \"Մաթիուշ առաջին թագավորը\", թարգմանությունը՝ Պարգև Մարտիրոսյանի, 284 էջ\n* 1968, Ukraine (Soviet Union), Київ: видавництво «Веселка», Мацюсеві пригоди, translated by Богдан Чайковський. – 334 с.\n* 1969, Warsaw, Poland,  Издательство «Полония», Король Матиуш Первый, translated by Муза Константиновна Павлова, 240 pages\n* 1978, Ukraine (Soviet Union), Київ: видавництво «Веселка», Мацюсеві пригоди, translated by Богдан Чайковський. – 334 с.\n* 1982, Estonia, Eesti Raamat, Kuningas Maciuś esimene\n* 1982, Lithuania, Vaga, Karalius Motiejukas Pirmasis\n* 1986, United States, Farrar, Straus and Giroux, , March 1986, hardcover, King Matt the First, translated by Richard Lourie, introduction by Bruno Bettelheim\n* 1988, United States, The Noonday Press, , paperback, January 1988\n* 1988, Israel, Keter Books, hardcover\n* 1989, United States, Random House Value Publishing, , hardback, January 1989\n* 1993, Georgia, „ნაკადული“, translated by Lola Kadagishvili, hardcover, 495 pages, pages 5-298 \"King Matt the First\", pages 301-495 \"Little King Matty and the Desert Island\"\n* 1998, United States, Farrar Straus & Giroux, , paperback, December 1998\n* 2004, United States, Algonquin Books, , King Matt the First, same translation, paperback, xi+330 pages, introduction by Esmé Raji Codell, cover illustration by Brian Selznick\n* 2005, United Kingdom, Vintage, , King Matt the First, UK edition of 2004 US edition, alternative version of cover, 4 Aug 2005, 352 pages\n* 2009, Świdnik, Poland, , Reĝo Maĉjo la Unua, translated from Polish into Esperanto by Tomasz Chmielik, illustrated by Polish school children, 176 pages\n* 2010, Russia, Издательство АСТ, , Король Матиуш Первый, translated by Наталья Яковлевна Подольская, illustrated by Н. Глушкова, 288 pages, offset\n* 2011, Russia, Издательство «АСТ, Астрель», , , Король Матиуш Первый. Антось-волшебник, 825 pages (Король Матиуш Первый pages 5–336, Король Матиуш на необитаемом острове pages 337-578, Антось-волшебник pages 579-825)\n* 2011, Ukraine, видавництво \"А-БА-БА-ГА-ЛА-МА-ГА\", Пригоди короля Мацюся translated by Богдан Чайковський and Богдана Матіяш, 534 pages\n* 2016, Georgia, „ბაკურ სულაკაურის გამომცემლობა“, , Lola Kadagishvili, 352 pages\n* Polish: Król Maciuś Pierwszy\n* English: King Matt the First\n* Esperanto: Reĝo Maĉjo la Unua\n* German: König Hänschen der Erste\n* Japanese: マチウシ一世王\n* Estonian: Kuningas Maciuś Esimene\n* Latvian: Karalis Matiušs Pirmais\n* Lithuanian: Karalius Motiejukas Pirmasis\n* Russian: Король Матиуш Первый\n* Ukraine: Мацюсеві пригоди\n* Georgian: მეფე მათიუშ პირველი\nAdaptations\nKing Matt has been adapted numerous times, for film, TV, animation, and opera.\n* Król Maciuś I – film, Poland, 1958, Wanda Jakubowska\n* Król Maciuś I – TV special, Poland, 1997, Filip Zylber\n* [http://www.macius.tv/ Le Petit Roi Macius]  – a Polish-French-German-Hungarian 2 seasons of 26 episodes (10–15 minutes each; sources differ) serial animation, 2002 (other broadcasts 2003–2005); [http://www.joshzam.com/2006/12/little-king-macius/ dubbed into English] 2006 as \"Little King Macius\"\n* Król Maciuś Pierwszy – animated film, 2007, by the same team as the serial animation\n* \"King Matt\" (Король Матиуш) – opera for children by Lev Konov.  Libretto: Lev Konov (Лев Конов), Olga Zhukova (Ольга Жукова), Ali Ibragimov (Али Ибрагимов). 1988 Moscow, Russian.\nSee also\n* Emperor Tomato Ketchup, 1971 film with similar concept (children ruling the empire)\nReferences\n*\nExternal links\n* [https://archive.org/details/KingMattTheFirst-English-JanuszKorczak/mode/1up King Matt the First, translated by Richard Lourie; introduction by Esme Raji Codell.]\n* [https://www.youtube.com/watch?v=I32S0VCoB18 Lev Konov - opera \"King Matt the First\" for/by children. Audio (1992) Part 1 of 6.]"
    }
  ]
}