{
  "content": [
    {
      "type": "text",
      "text": "# King Kong (Jibbs song)\n\nKing Kong}}\n(United States) (United Kingdom)\n| recorded   = 2006\n| studio     = The ClosetLarrabee Sound StudiosLos Angeles\n| venue      =\n| genre      = Hip hop\n| length     =\n| label      = Geffen Records\n| writer     =\n| producer   = Terry \"T.A.\" Allen/The Beatstaz (Co-produced by Zaytoven)\n| chronology = Jibbs\n| prev_title = Chain Hang Low\n| prev_year  = 2006\n| next_title = Go Too Far\n| next_year  = 2007\n| misc       =\n}}\n}}\n\"King Kong\" is the second single from the album Jibbs Featuring Jibbs by American rapper Jibbs. The song features fellow hip hop artist Chamillionaire. It is written by Javon Campbell, Derryl Howard, Bradford Ray, Orlando Watson, and Maurice Wilson. The song failed to duplicate the success of \"Chain Hang Low\", peaking at number 54 on the Billboard Hot 100 and number 32 on the Hot R&B/Hip-Hop Songs chart.\nSong information\nThe song does not directly involve King Kong, the fictional giant ape. Instead, it is a reference to a loud, powerful speaker system with loud subwoofers, with ultra high sound pressure and is a \"bass shaker\" in the back of a car trunk. Or King Kong's \"roar\" in the trunk. The reference originates from King Kong Electronics, a place in Houston, Texas that sells car audio and peripherals, mainly high-end subwoofers and head units.\nChart performance\n\"King Kong\" debuted on the U.S. Billboard Hot 100 at number 96. It descended two spots to number 98, when \"Chain Hang Low\" was already in the top 40 by the second week. By the third week it had climbed up to number 87. It peaked at number 54 on the chart four weeks later.\nMusic video\nDirected by Jonathan Mannion, the video shows Jibbs celebrating getting his driver's license by driving around town in his car and putting other people down who have other vehicles with his car's speakers in the trunk, all cumulating to Jibbs' car turning into a monster truck (with the song title on both sides) and running over a parked car. Intercut are scenes in which Jibbs, Chamillionaire and their entourage are in a room filled with various dancers and vehicles they interact with. The video shoot took place in Los Angeles on October 25, 2006.\nRemixes and freestyles\nRemixes and freestyles to the song was released with additional rappers:\n*The official remix features Chamillionaire, Lil Wayne, Yo Gotti, and Chingy.\n*Another remix features Chamillionaire, Jibbs's official remix verse and features Young Jeezy.\n*Lil Wayne did a freestyle over the beat on his 2007 mixtape Da Drought 3.\n*Krayzie Bone made a remix of this song on his 2008 mixtape The Fixtape Vol. 1: Smoke on This with Lil Chico.\nTrack listing\n*;US 12-inch single\n**A1 \"King Kong\" (Main) – 4:07\n**A2 \"King Kong\" (Instrumental w/hook) – 4:07\n**B1 \"King Kong\" (Main) – 4:07\n**B2 \"King Kong\" (Instrumental w/hook) – 4:07\n*;US 12-inch single w/ remix\n**A1 \"Smile\" (Main) – 3:32\n**A2 \"Smile\" (Instrumental) – 3:35\n**B1 \"King Kong\" (Remix) – 4:08\n**B2 \"King Kong\" (Remix Instrumental) – 3:56\nCharts\n{| class=\"wikitable\"\n!align=\"left\"|Chart (2007)\n!align=\"left\"|PeakPosition\n|-\n|-\n|-\n|-\n|-\n|}\nReferences"
    }
  ]
}