{
  "content": [
    {
      "type": "text",
      "text": "# Kingsbury railway station\n\n| grid_name           = Grid reference\n| grid_position       =\n| original            = Birmingham and Derby Junction Railway\n| pregroup            = Midland Railway\n| postgroup           = London, Midland and Scottish Railway\n| years               = 12 August 1839\n| events              = Station opened\n| years1              = 4 March 1968\n| events1             = Station closed\n}}\nKingsbury railway station was a railway station which served the village of Kingsbury in Warwickshire, England.\nHistory\nThe station was opened in 1839 with the building of the Birmingham and Derby Junction Railway.\nIn 1887, a passenger, Sarah Jane Coleman was killed at the station whilst crossing the line. At the inquest, the jury identified that the means of exit from the station on the down side of the platform was not sufficiently defined, and District Traffic Inspector Carlyle was instructed to lay the matter before the railway company.\nOn 3 May 1909, the Midland Railway opened a new line of 3¾ miles in length between Water Orton and Kingsbury which enabled express trains to avoid the severe curve on the previous route near Whitacre.\nIn 1911, the station master, James George, was killed by an express train whilst he was crossing the line. His widow received £300 () in compensation from the Midland Railway company. As a result of the accident, the parish council petitioned the railway company to provide a footbridge at the station.\nThe location of the station was not very convenient for the village and the relocation of the station closer to the village was considered by the parish council in 1906 and again in 1914. The village had grown considerably at the top end near the junction, and there was a big population at Piccadilly, Wood End, and the bottom end of Hurley. However, the station remained at its original location.\nBy 1963 the station buildings were very neglected. The station was still lit by oil lamps which required the porter to clamber up a ladder and light them. There was no waiting-room on the up-line platform and the waiting room on the down platform had rotting floorboards and crumbling bricks. Passengers still had to cross the line as no footbridge had ever been provided. The original platform buildings had mostly been demolished around 1960 as British Railways had decided they were unsafe and temporary wooden buildings had been erected for the staff, but these were surrounded by rubble left by the demolition gang.\nBy 1964 the station was little used and threatened with closure. The Transport Users’ Committee stated that in the Kingsbury to Birmingham direction, on average, 18 people joined trains at Kingsbury and 1 alighted. On Saturdays this was 5 people joining the train and 2 alighting. In the reverse direction it was 1 passenger joining and 36 alighting, and on Saturdays 2 joined and 13 alighted. The passenger usage was affected by the introduction by the Midland Red bus of an extra early service on the 116 route which was more convenient than the 1 mile walk to the station. Despite a temporary reprieve in 1965, the station finally shut on 4 March 1968.\nIn 1982 an appeal was launched, supported by the Railway Development Society, to raise funds to build a new station which was estimated to cost around £100,000 ().\nPresent day\nSince closure, the station building has been demolished, but the station master's house can still be seen alongside the site of the station.\nJust to the north of the site, towards the still-operational  station, lies Kingsbury Terminal, a regional road to rail transport hub. The co-located European Metal Recycling facility at Kingsbury has rail access, allowing for the scrapping of railway vehicles. Recent contracts included the recycling of 12 of the original British Rail Class 373 Eurostar trains.\nReferences"
    }
  ]
}