{
  "content": [
    {
      "type": "text",
      "text": "# Kingsley Association\n\nThe Kingsley Association, organized in 1893,  began as a single settlement house located in Pittsburgh, Pennsylvania, named the Kingsley House.  It has since relocated its settlement house to East Liberty (Pittsburgh) where it continues to operate today. It has also expanded to operate the Lillian Taylor Camp, an open air farm in Valencia, Pennsylvania, and the Morgan Memorial House in the Hill District of Pittsburgh. The Kingsley Association seeks to create new and innovative neighborhood-based programs in accordance with the changing needs of residents, with particular attention to young people.\nFounding\nThe Kingsley Association was formed by the Reverend Dr. George Hodges (theologian) from Cambridge, Massachusetts as a Pittsburgh settlement house.  According to an article written in 1894, Hodges had come to Pittsburgh under the auspices of the Church club. In Cambridge he had served as the Dean of the Episcopal Divinity School .  He named the house in honor of Charles Kingsley, a very popular English Christian Socialist and author.\nPurpose\nThe purpose for the creation of the Kingsley House was not much different from that of any other settlement house.  Hodges had simply repeated what Jane Addams had done with Hull House in Chicago and what many other settlement houses across the nation had done to benefit the communities they were located in.  The real purpose of the Kingsley House and these other settlement houses was to provide social and educational opportunities for working class families that otherwise would not be able to afford it.  Hodges himself described the Kingsley House as existing, \"for the purpose of being a friend to everybody in the neighborhood who needs a friend.\"  He was referring to the Kingsley House existing just as a friend does, as a source of enjoyment and support in times of need.  One example was the kindergarten, where young children whose families could probably not afford formal schooling could find a good education for their children.  The school also served as a place for children to meet and socialize with other children of the same age.\nThe purpose of what had become the Kingsley Association was flowing and ever-changing.  When the Lillian Taylor Camp [https://web.archive.org/web/20070928162703/http://www.kingsleyassociation.org/lillian_taylor_camp.html] was created the purpose was to allow inner city children and mothers to spend time away from the congested and noisy city out in the quiet and serene countryside.  It was also used as a summer camp to act as an extension of the Kingsley House while also getting children away from the city and to experience something other than what they had been used to all of their lives.  Another change came with the influx of African Americans in the late 1910s and the creation of the Morgan Memorial House to accommodate this.  While the guests of the Kingsley House had come from industrial backgrounds, many of the guests of Morgan Memorial House were experiencing for the first time the life and ways of a city.  Thus, the Morgan Memorial House tended to concentrate its classes and activities more along the lines of adapting these children to city life.  Lifting and education were more emphasized compared to the other parts of the Kingsley Association.  The purpose of the Kingsley Association cannot be restrained to one definition and as it has increased in size and Pittsburgh's demographics have changed so too has the Association's purpose and contributions to the community.\nMembership\nAt first the Kingsley Association was located at 1707 Penn Avenue, Pittsburgh, Pennsylvania.  It was close to several large iron and steel mills.  It catered to a very diverse population.  The surrounding area consisted mostly of factory workers that was predominantly Irish American, but in time came to include German, Russian, and Austrian Poles.  A little farther were large settlements of Jewish and German immigrants with people of English and Scots-Irish descent present as well.  A major shift from these ethnic groups occurred in 1919.  The businesses in major cities had been experiencing a labor shortage because of World War I and they looked to African Americans to fill the gap.  Most of the African-American population that moved into Pittsburgh settled in the Hill District.  Another settlement house, the Morgan Memorial House, was created by the Kingsley Association to account for this surge in the population, after which the membership of the Association as a whole became a large percentage African-American.\nWithin weeks of the opening of Kingsley House, there were five boys clubs and four girls clubs, ranging from American history to fairy tales.  The sewing class had an average attendance of thirty girls beginning in January.  Other clubs included the \"Kingsley House Literary Society\", a \"City Government Club\", and a \"Reading Club\".  A kindergarten was opened for young children in the area from 9AM to 12AM, Monday through Friday.  Most other clubs met only once or twice a week.  By 1903, over 70 girls were attending the sewing class, prompting the beginning of two other classes in sewing and embroidery.  As the years passed the membership continued to increase.  By 1924, total attendance was 81,375 and by 1933 it was 167,707.  Membership peaked at almost 200,000 in 1940.\nTo create interest in the neighborhood, the Kingsley Association at first relied on word of mouth, but to increase their membership even further they soon moved to  several media outlets, including radio, newspapers, magazines, and brochures.  One such brochure from the early 20th century read:How would you spend four hours every evening, every week with no money?  Read, study, listen to the radio?  Well the radio might have one tube or none at all, and there might be so many noisy younger children in the few rooms you called \"home\" that you couldn't hear you own thoughts... \"What would I do?\" Frank [a teenage Kingsley House member] answers the question which a companion had asked of Kingsley House.  \"You mean if Kingsley House weren’t here to go to?  Just what I did – till I got interested in club and basketball – hang around pool-rooms or 'sneak a movie,' or worse stuff than that.\"As Pittsburgh modernized, so too did the Kingsley Association.  The activities offered by the Association were changed to accommodate the times, some of these new programs included Meet-the-Athlete, SAT Prep, Explorers, and Study Skills.\nAndrew Carnegie\nAndrew Carnegie also had a vested interest.  The Kingsley Association became one of the many charities he contributed to after retiring from the steel business.  On January 15, 1913, in a letter to the Kingsley Association, the steel magnate wrote, \"Dear Friend, I find I have contributed in the naborhood of $20,000 to Kingsley House and am now paying $3,000 a year.  I do not wish to increase this amount of $50,000 I have promist for I feel I have done my part and that liberally.... Please consider this and do not press me further and oblige.  Very Truly Yours, Andrew Carnegie.\"\nLocations through history\nFirst located on Penn Avenue, in 1901 house operations were transferred to a mansion purchased by industrialist Henry Clay Frick.  It was located in the Lower Hill District at Fullerton and Bedford Streets.  A fresh air farm, known as Lillian Home, was opened in 1903 on land bought by industrialist Charles L. Taylor.  The farm remains in operation today.  A rapid growth of the African American population in 1919 led to the opening of the Morgan Memorial House in the Hill District.  That same year, the University of Pittsburgh [http://www.pitt.edu] conducted a survey of the area surrounding the Kingsley Association and recommended that it relocate its settlement house to East Liberty (Pittsburgh) where it continues to operate today.[http://www.kingsleyassociation.org Home]\nReferences\nExternal sources\n[http://digital.library.pitt.edu/cgi-bin/f/findaid/findaid-idx?type=simple;c=ascead;view=text;subview=outline;didno=US-PPiU-AIS197005 Finding Aid to the Kingsley Association Records] at the Archives Service Center, University of Pittsburgh\n[http://digital.library.pitt.edu/images/pittsburgh/kingsley.html Photographs from the Kingsley Association Collection]\n----\nAll the information not cited has been obtained with permission from the University of Pittsburgh Archives Service Center located at:\n7500 Thomas Boulevard\nPittsburgh, PA 15208\n[http://www.library.pitt.edu/libraries/archives/archives.html Archives Service Center home page]"
    }
  ]
}