{
  "content": [
    {
      "type": "text",
      "text": "# King Street (Toronto)\n\n| length_notes            =\n| location                =\n| direction_a             = West\n| terminus_a              = The Queensway / Queen Street (Continues as Roncesvalles Avenue)\n| direction_b             = East\n| terminus_b              = Merges with Queen Street\n| junction                =\n| inauguration_date       = 1790s\n| demolition_date         =\n| browse                  =\n}}\nand UP Express rail traffic above King Street West between Atlantic and Sudbury.]]\nKing Street is a major east–west commercial thoroughfare in Toronto, Ontario, Canada. It was one of the first streets laid out in the 1793 plan of the town of York, which became Toronto in 1834.\nAfter the construction of the Market Square in 1803 at King and Jarvis streets, to house the first St. Lawrence Market farmer's market, the street became the primary commercial street of York and early Toronto. This original core was destroyed in the 1849 Great Fire of Toronto but was subsequently rebuilt. The original street extended from George Street to Berkeley Street and was extended by 1901 to its present terminuses (both with Queen Street) at Roncesvalles Avenue in the west and the Don River in the east.\nDescription\nKing Street's western terminus is at an intersection with The Queensway to the west, Roncesvalles Avenue to the north, and Queen Street West to the east. King runs to the south-east briefly before curving to the east until just west of Parliament Street. There, it curves north-east until terminates at a merge with Queen Street East just west of the Don River and north of the Corktown Common. Prior to a realignment, Eastern Avenue was the East end of King Street and crossed the Don at the King Street Bridge (which has since been abandoned). Yonge Street, the north–south divider of many Toronto east–west streets, divides King Street into King Street East and King Street West.\nCanada's Walk of Fame runs along King Street from John Street to Simcoe Street and south on Simcoe. It is a tribute in granite to Canadians who have gained fame in the fields of music, literature, journalism, dance, sports, acting, entertainment and broadcasting.\nKing Street West is considered Toronto's Fashion District and is known for trendy restaurants, design shops and boutique condo developments. Previously industrial, this neighborhood has undergone considerable urban development since the early 2000s.\nKing Street East is predominantly known as the high-end, luxury furniture district of downtown Toronto, with dozens of stores on King Street and in the surrounding area.\n, King Street is served along its entire length by two overlapping Toronto Transit Commission streetcar routes: the 504A King and the 504B King, which together are the busiest streetcar routes in the fleet, with an average ridership of 65,000 passengers per day. They connect with the Yonge–University subway line (Line 1) at St. Andrew station at University Avenue, and at King station at Yonge Street. They connect with the Bloor–Danforth subway line (Line 2) at Dundas West station and Broadview station. The street was also served by the 508 Lake Shore route until it was discontinued in June 2015. It was subsequently replaced by the 514 Cherry route in June 2016, which was then cancelled in October 2018 and replaced by the two 504 King branches.\nTransit mall\nThe section of King Street between Bathurst Street and Jarvis Street is a transit mall with restrictions on how vehicles can use intersections. In the mall, trucks and cars are unable to continue straight through or turn left at intersections: they must turn right off of King Street. The road also has sidewalk cafes and public art pieces on the road. On April 16, 2019, the transit mall was made permanent.\nHistory\nIn the original 1793 plan of the Town of York, King Street was the original name of the section of today's Front Street from George Street east to Parliament Street. This was changed in 1797, when York was extended to the west. The original King Street became Palace Street, and Duke Street was renamed King Street. The new King Street was extended west to York Street. In 1798, King Street was extended further west, to Peter Street. In the 1837 westerly extension of Toronto, King Street was extended west to Garrison Creek. By this time, King Street was the main commercial east–west street of Toronto, having St. Lawrence Market at the intersection of King and New (or Nelson) (today's Jarvis) streets, and a commercial core extending around the Market. In the 1849 Great Fire, much of the business core at King and Jarvis was destroyed. New commercial buildings were built. By 1901, King Street West was completed to its present-day intersection at Roncesvalles and Queen Streets.\nIn recent years there has been a proliferation of chic restaurants, clubs and galleries in the area as King Street West becomes more oriented to Toronto's nightlife crowd, and is near major attractions such as the Rogers Centre (formerly SkyDome), Scotiabank Arena (formerly Air Canada Centre), the Distillery District, Hockey Hall of Fame, Roy Thomson Hall, Meridian Hall (formerly Sony Centre for the Performing Arts), St. Lawrence Market and the historic Omni King Edward Hotel.\nLandmarks\n;Popular attractions along King Street include:\n* Canada's Walk of Fame\n* Princess of Wales Theatre - owned by theatre giant Ed and David Mirvish\n* Royal Alexandra Theatre - owned by theatre giant Ed and David Mirvish\n* Roy Thomson Hall\n;Office towers on King:\n* Toronto Stock Exchange\n* Toronto-Dominion Centre\n* First Canadian Place\n* Scotia Plaza\n* Commerce Court, including the historic Commerce Court North\n* Corporate offices of Spin Master\n;Other notable buildings on King Street:\n* The Omni King Edward Hotel\n* St. James' Cathedral (Anglican Church)\n* St. Andrew's Presbyterian Church\n* Toronto Sun Building\n;Neighbourhoods\n* Corktown (at Cherry)\n* Entertainment District (at John)\n* Fashion District (at Spadina)\n* Financial District (at Bay)\n* Liberty Village (at Dufferin)\n* Parkdale (at Dunn)\n* Roncesvalles (at Queen)\n* Old Town of York (at Parliament)\n* St. Lawrence (not actually on King but south of King at Jarvis)\n* Trinity Niagara (at Bathurst)\nSee also\n* Royal eponyms in Canada\n* 504 King\n* King Street Transit Priority Corridor\nReferences"
    }
  ]
}