{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of Brazil\n\n| conventional_long_name = Kingdom of Brazil\n| common_name            = Brazil\n| status                 = Constituent kingdom of the United Kingdom of Portugal, Brazil, and the Algarves\n| year_start             = 1815\n| flag_type              = Kingdom flag\n| date_start             = 16 December\n| year_end               = 1822\n| date_end               = 7 September\n| life_span              = 1815–1822\n| p1                     = State of Brazil\n| flag_p1                = Coat of arms of Colonial Brazil.svg\n| border_p1              = no\n| s1                     = Empire of Brazil\n| flag_s1                = Flag Regent Prince of Brazil.svg\n| image_flag             = Flag of the Kingdom of Brazil (1822).svg\n| flag_caption           = Above: Flag of the Kingdom of Brazil. Below: Flag of the Kingdom of Portugal, Brazil and Algarves.\n| image_flag2            = Flag of the United Kingdom of Portugal, Brazil, and the Algarves (1815-1825).svg\n| image_coat             = Coat of arms of the Kingdom of Brazil (1822).svg\n| image_map              = Mapa_do_Brasil_em_1817.png\n| common_languages       = Portuguese\n| capital                = Rio de Janeiro\n| religion               = Roman Catholic\n| government_type        = Absolute monarchy\n| leader1                = Maria I\n| leader2                = João VI\n| year_leader1           = 1815–1816\n| year_leader2           = 1816–1822\n| title_leader           = Monarch\n| deputy1                = John of Braganza\n| year_deputy1           = 1815–1816\n| deputy2                = Pedro of Braganza\n| year_deputy2           = 1821–1822\n| title_deputy           = Prince Regent\n| event_start            = Established\n| event1                 = Pernambucan Revolt\n| date_event1            = 6 March 1817\n| event2                 = Liberal Revolution\n| date_event2            = 24 August 1820\n| event3                 = Return of the Royal Family to Portugal\n| date_event3            = 25 April 1821\n| event_end              = Independence of Brazil|\n| currency               = Real\n| legislature            = Cortes (1820–1822)\n| stat_year1             = 1820\n| stat_pop1              = 4,000,000\n| demonym                = Brazilian\n}}\nThe Kingdom of Brazil () was a constituent kingdom of the United Kingdom of Portugal, Brazil and the Algarves.\nCreation\n, was the first monarch of the Kingdom of Brazil.]]\nThe legal entity of the Kingdom of Brazil was created by a law issued by Prince Regent John of Portugal, Prince of Brazil, Duke of Braganza, on behalf of his mother, Queen Maria I of Portugal, on 16 December 1815, which elevated the State of Brazil to the rank of a Kingdom within the United Kingdom of Portugal, Brazil, and the Algarves.\nBy a decree issued on 22 April 1821 ahead of his departure from Brazil to Portugal, King John VI appointed his firstborn son and heir, Prince Pedro of Braganza, the Prince Royal of the United Kingdom, as Prince Regent of the Kingdom of Brazil, with delegated powers to discharge the \"general government and entire administration of the Kingdom of Brazil\" as the King's placeholder, thus granting the Kingdom of Brazil a devolved administration within the United Kingdom.\nDissolution\n, was the last monarch of the Kingdom of Brazil.]]\nOn 7 September 1822, Prince Pedro, Prince Royal of the United Kingdom of Portugal, Brazil, and the Algarves, Regent of Brazil, declared the Brazilian Independence. On 12 October 1822, Prince Pedro became the first Emperor of the newly independent country, thus founding the Empire of Brazil. Brazil's independence was only recognized with the Treaty of Rio de Janeiro, in 1825, by which the Kingdom of Brazil, within the larger United Kingdom of Portugal, Brazil, and the Algarves, was formally dissolved and Brazil's independence was recognized and granted by the Kingdom of Portugal.\nOn 8 September 1822, in the first day after the Proclamation of Independence, Prince Pedro issued a decree to adopt for the Kingdom of Brazil a new flag and coat of arms, replacing the Portuguese colours, then white and blue, with new colours, green and yellow (green was chosen for its association with the House of Braganza, Pedro's dynasty; yellow was chosen as it was the colour of the House of Habsburg, in which Pedro's wife, Leopoldina, was born; the new national colours therefore honoured the Royal couple that led Brazil at the foundation of its independence); those new symbols would later pass to the Empire of Brazil when it was founded on 12 October 1822. The new, post independence symbols, replaced the original flag of the Kingdom of Brazil (a golden armillary sphere on a blue field) and its original coat of arms (a golden armillary sphere with a blue background in the interior of the sphere), that had been designed in 1815. Of course, after independence, upon the adoption of the new flag and coat of arms on 8 September 1822, the coat of arms of the United Kingdom of Portugal, Brazil, and the Algarves, adopted in 1815 (featuring a juxtaposition of the traditional coat of arms of Portugal and the Algarves with the original coat of arms of the Kingdom of Brazil in the background, surmounted by the royal crown), also ceased to be used.\nAs per one of the clauses of the Treaty of Rio de Janeiro, King John VI of Portugal and the Algarves, formerly King John VI of the United Kingdom of Portugal, Brazil, and the Algarves, was granted the personal title of titular Emperor of Brazil, thus having stayed monarch of Brazil, in title, until his death in 1826.\nSee also\n*United Kingdom of Portugal, Brazil, and the Algarves\n*Kingdom of Portugal\n*Kingdom of the Algarves\nReferences\nExternal links"
    }
  ]
}