{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of the Morea\n\n|\n| today                  =\n| era                    = Early Modern\n| subdivision            = Colony\n| nation                 = the Republic of Venice\n| government_type        = Colony|\n| year_start             = 1688\n| year_end               = 1715|\n| event_pre              = Venetian conquest\n| date_pre               = 1685–1687\n| event_start            =\n| event_end              = Ottoman reconquest\n| event_post             = Treaty of Passarowitz\n| date_post              = 1718|\n| p1                     = Morea Eyalet\n| s1                     = Morea Eyalet|\n| image_map              = Peloponnesus, Presently the Kingdom of Morea, Clearly Divided into All Its Provinces, Both Contemporary and Ancient, and to which is Added the Islands of Cefalonia, Zante, Cerigo, and St. Maura WDL373.png\n| image_map_caption      = Peloponnesus, Presently the Kingdom of the Morea, by Frederik de Wit, 1688|\n| capital                = Nauplia\n| common_languages       = |\n| title_leader           = Provveditore Generale di Morea\n| leader1                = Giacomo Corner\n| year_leader1           = 1688–1690\n| leader2                = Alessandro Bon\n| year_leader2           = 1714–1715\n| flag_p1                = Flag of the Ottoman Empire.svg\n| flag_s1                = Flag of the Ottoman Empire.svg\n}}\nThe Kingdom of the Morea or Realm of the Morea (; ; ) was the official name the Republic of Venice gave to the Peloponnese peninsula in Southern Greece (which was more widely known as the Morea until the 19th century) when it was conquered from the Ottoman Empire during the Morean War in 1684–99. The Venetians tried, with considerable success, to repopulate the country and reinvigorate its agriculture and economy, but were unable to gain the allegiance of the bulk of the population, nor to secure their new possession militarily. As a result, it was lost again to the Ottomans in a brief campaign from June to September in 1715.\nBackground\nVenice had a long history of interaction with the Morea, dating back to the aftermath of the Fourth Crusade (1203–1204), when the Republic acquired control of the coastal fortresses of Modon and Coron, Nauplia and Argos. These they held even after the remainder of the peninsula was conquered by the Ottoman Turks in 1460, but they were lost in the first, second and third Ottoman–Venetian Wars. In successive conflicts, the Ottomans pried away the other remaining Venetian overseas possessions, including Cyprus and Crete, the latter after a prolonged struggle that ended in 1669.\nIn 1684, following the Ottoman defeat at the second Siege of Vienna, Venice joined the Holy League and declared war on the Ottoman Empire. Under the leadership of Francesco Morosini, who had led the defence of Candia, the capital of Crete, the Venetians took advantage of the Ottoman weakness and rapidly took over the island of Lefkada (Santa Maura) in 1684. In the next year, Morosini landed on the Peloponnese, and within two years, aided by the local Greek population, took control of the peninsula and its fortresses. A subsequent Venetian campaign into eastern Continental Greece succeeded in capturing Athens, but failed before the walls of Chalkis (Negroponte). Thereafter the conflict degenerated into a stalemate, with raids and counter-raids on both sides, until the signature of the Treaty of Karlowitz between the Ottomans and the Holy League, which in Greece left the Morea, Leucas and the island of Aegina in Venetian hands.\nOrganization of the new province\nAdministration\nAlready in 1688, with their control of the country practically complete, the Venetians appointed Giacomo Corner as the governor-general (provveditore generale) of the Morea to administer their new territory. The task he faced was daunting, as the population had fled from the coming of war: 656 out of 2,115 villages were deserted, almost all the Muslim population had abandoned the peninsula for lands still in Ottoman hands, while even towns like Patras, which numbered 25,000 inhabitants before the war, now had 1,615 left. Apart from the region of Corinthia and the autonomous Mani Peninsula, the Venetians counted only 86,468 inhabitants in 1688, out of an estimated pre-war population of 200,000. Other sources, however, like the Englishman Bernard Randolph, who lived in Greece in 1671–1679, assessed the population of the Morea at the time at 120,000, of which one quarter Muslim and the rest Christian. This is commensurate with the attested demographic decline across the Ottoman Empire in the 17th century, and the demands made by the Ottoman government on the peninsula's resources during the long Cretan War.\nUnder Corner's oversight, a committee of three senators (Jeronimo Renier, Domenico Gritti, Marino Michiel) was sent to the Morea to reorganize the provincial administration, revive local authorities, compile a cadaster and settle land disputes. The peninsula was divided into four provinces:\nin the 16th century]]\n* Romania, in the northeastern Peloponnese, with capital at Nauplia (Napoli di Romania), and the districts of Argos, Corinth, Tripoli, and Hagios Petros in Tsakonia\n* Laconia, in the southeast, with capital at Monemvasia (Malvasia), and the districts of Mystras, Vordonia, Kelefa, Passavas and Zarnata\n* Messenia, in the southwest, with capital at Navarino, and the districts of Modon, Coron, Androusa, Kalamata, Leontari, Karytaina, Fanari, Kyparissia and Navarino\n* Achaia, in the northwest, with capital at Patras, and the districts of Vostitsa, Kalavryta, Gastouni and Patras\nEach province and district was headed by a provveditore, who combined civil and military authority, and was aided by a rector (rettore) in charge of justice and a chamberlain (camerlingo) in charge of financial affairs. To the \"Kingdom of the Morea\" was also joined the administration of the islands of Kythera (Cerigo) and Antikythera (Cerigotto), off the southeastern coast of the Peloponnese, which had been in Venetian hands since 1204.\nList of the provveditori generali of the Morea\nThe formal title of the Venetian governor-general of the Morea was Provveditore generale delle Armi (\"Superintendent-general of the Arms\"), with his seat in Nauplia. In the first period after the conquest, he was assisted by two provveditori extraordinary. The provveditori generali appointed during the duration of the Kingdom of the Morea are known through their relazioni, the reports they submitted to the Venetian government on their deeds. These were:\n# Giacomo Corner (1688–1690)\n# Tadeo Gradenigo, provveditore estraordinario (1690–1692)\n# Antonio Molin, provveditore estraordinario (1692–1693)\n# Marin Michiel (1694–1695)\n# Agostino Sagredo (1695–1697)\n# Paolo Nani (1697)\n# Francesco Grimani (1698–1701)\n# Giacomo da Mosto (1701–1703)\n# Antonio Nani (1703–1705)\n# Angelo Emo (1705–1708)\n# Marco Loredan (1708–1711)\n# Antonio Loredan (1711–1714)\n# Alessandro Bon (1714–1715)\nEconomic and social development\nTo restore the province, settlers were encouraged to immigrate from the other Greek lands with the lure of considerable land grants, chiefly from Attica but also from other parts of Central Greece, especially the areas that suffered during the war. 2,000 Cretans, and also Catholic Chians, Venetian citizens from the Ionian Islands and even some Bulgarians answered this call. In addition, mention is made of 1,317 Muslim families that remained behind, converted to Christianity and were given lands or enterprises as concessions. As a result of these policies, the population recovered rapidly: apart from Mani, the Venetian registers record 97,118 inhabitants in 1691, 116,000 a year later and 176,844 by 1700. Due to the relative privileges granted the urban population, the period was also marked by an influx of the agrarian population to the cities.\nThe Venetians engaged in a concerted effort to revive and improve the country's agriculture and commerce. Thus the settler families were given 60 stremmata each, while the elders of the local communities were allocated 100; new grape cultures were introduced from France and Italy and import tax was levied on foreign wine, laying the foundations for the revival of viticulture and the raisin trade with Western Europe; measures were taken to develop forestry; and the indigenous silk industry was promoted. Trade links established both with the rest of Ottoman Greece as well as with the North African coast, which exported the Morea's main produce, raisins, cereals, cotton, olive oil, leather, silk and wax. As a result, the annual revenue from the province rose steadily, from 61,681 reales in 1684/85 to 274,207 in 1691 and 500,501 in 1710, of which about three-fifths were spent in the Morea itself. By way of comparison, the total tax revenue due to the Ottoman government from the province before 1684 is estimated at 1,699,000 reales.\nDue to the extensive influx of migrants, the Venetian period was marked by intense social mobility. Although in general both the original inhabitants and the new settlers remained in the social class to which they had belonged originally, the policies of the Venetian authorities with their continual land grants to their supporters—including the hereditary quasi-fiefs known as conteas (\"countships\")—coupled with the economic upturn, brought about the emergence, for the first time after the disbandment of the Christian sipahis of the Peloponnese in the early 1570s, of a new affluent class of merchants and land-holders, many of whom were from Athens, Chios and the Ionian islands. According to the Greek historian Apostolos Vakalopoulos, here lies the origin of the oligarchy of the kodjabashis, who dominated the peninsula's affairs from the late 18th century until the Greek War of Independence. By contrast, for the mass of the peasants, both natives and immigrants, the situation progressively worsened; whether due to debts, transgressions of officials, the exactions of corvée or the increasing scarcity of land, many peasants, especially those who had migrated from Central Greece, chose to flee to the Ottoman-held territories across the Gulf of Corinth. They were welcomed by the Ottoman authorities, while the Venetian authorities were forced to institute military patrols to stop them. This demonstrates a deepening gulf in Moreot society: when the Turks returned in 1715, the bulk of the population remained unaffected, and only the better-off such as the contea possessors actively supported Venice, and in many cases abandoned the peninsula for Italy following the Venetian defeat.\nThe depredations and turmoil of the war and its aftermath also brought about a rise in banditry across the country. To combat it, the Venetian authorities raised a provincial gendarmerie, the meidani, but also armed the villagers and formed local militias, echoing the armatolik system of the Ottomans. Despite their successes in this regard, the Venetians, like the Turks before and after them, were unable to completely eradicate banditry, since the Maniots and other mountain dwellers, secure in their inaccessible strongholds, continued to defy Venetian law and raid the lowlands.\nChurch affairs\nThe Venetians left the local Greek Orthodox Church largely to its own devices to avoid alienating the population, but regarded it with distrust due to its dependency on the Ecumenical Patriarch in Constantinople, under the close supervision of the Sultan. The Venetians tried to limit the Patriarch's influence, reducing the revenue he received from the province and insisting that the Moreot bishops be elected by their dioceses and not appointed by the Patriarch, but they largely failed to sever the ties of the local Orthodox Church (whose de facto leader at the time became the Metropolitan of Patras) with the Patriarchate.\nThe Venetians showed more vigour in their efforts to impose the Catholic Church in the country, with conversions of mosques to Catholic churches as well as the construction of new ones, and the establishment of monks from various religious orders across the peninsula. Among the most notable events was the foundation of a Mechitarist Armenian monastery in Modon in 1708, which after 1715 was transferred to San Lazzaro degli Armeni in Venice. The centre of the Catholic Church in the Morea was the Latin Archbishopric of Corinth.\nSecurity\nand halberds from the time of the \"Kingdom of the Morea\" in the National Historical Museum, Athens.]]\nDespite the Treaty of Karlowitz, the Ottomans were unreconciled to the loss of the Morea, and already in 1702 there were rumours of impending war, with troops and supplies sent to the Ottoman provinces adjoining the Morea. The Republic was well aware of the Ottoman intentions, and from the beginning of its rule in the Morea, its officials toured the fortresses to ascertain their state and their capacity to resist. However, the Venetians' position was hampered by problems of supplies and morale, as well as the extreme lack of troops available: even while the war was ongoing, in 1690, the Venetian forces in southern Greece numbered only 4,683 men, both mercenaries from Western Europe and local Greeks (recruited along the lines of the Venetian cernide system); while in 1702, the garrison at Corinth, which covered the main invasion route from the mainland, numbered only 2,045 infantry and barely a thousand cavalry. Although a detailed survey in 1698 found serious deficiencies in all the fortresses of the Morea, little seems to have been done to address them. Almost the only major work undertaken by the Venetians during their rule in the Morea was the new citadel for Nauplia, on the height of Palamidi overlooking the city, whose construction began under the supervision of Morosini during the Morean War. In the event, however, the defences of the city held out only for a few days against the determined Ottoman attacks in 1715.\nOttoman reconquest\nFollowing their victory in the Russo-Turkish War of 1710–1711, and citing various Venetian transgressions against Ottoman shipping as an excuse, the Ottomans declared war on 9 December 1714. A large army, reportedly 70,000 men under the command of Grand Vizier Silahdar Damat Ali Pasha, left Constantinople for the Morea, which it entered in late June. The Venetian forces, barely 5,000 strong under the provveditore generale Alessandro Bon and the captain-general Geronimo Delphino, were scattered among the various fortresses and unable to impede the Ottoman advance. The Acrocorinth citadel, the key to the peninsula, surrendered after only five days of bombardment, followed by the capitulation of Aegina and Argos. The Ottomans then proceeded to Nauplia, which was captured and ransacked after the fortress of Palamidi was stormed on 20 July. Its fall sealed the fate of the Morea, as the local inhabitants (except the Maniots) swiftly declared their allegiance to the Ottomans. The Venetians abandoned Navarino and Coron, hoping to hold out in Modon, but the rebellion of the Greek and mercenary soldiers allowed the Ottomans to take possession of the fortress with ease. With the capture of the Castle of the Morea on 16 August and the surrender of Monemvasia on 7 September and Kythera, the occupation of the \"Kingdom of the Morea\" was complete.\nKythera returned to Venetian rule in 1718, with the Treaty of Passarowitz, but the Morea remained under Ottoman control for another century, until the outbreak of the Greek War of Independence in 1821.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n* Mario Infelise – Anastasia Stouraiti (a cura di), ''Venezia e la guerra di Morea. Guerra, politica e cultura alla fine del '600'' (Milano: Franco Angeli, 2005)\n*\n*\n*\n*"
    }
  ]
}