{
  "content": [
    {
      "type": "text",
      "text": "# Kings Park, Western Australia\n\n| alt_name         =\n| native_name      =\n| native_name_lang =\n| image = Kings Park War Memorial Sunrise.jpg\n| image_size       =\n| image_alt = A picture of the Eternal flame with the State War Memorial behind it.\n| image_caption = Eternal flame, with State War Memorial (behind)\n| mapframe-custom =\n| map_alt = Extent of Kings Park and its location within Perth.\n| map_width        =\n| map_caption = Kings Park overlooks the Perth central business district as well as Perth Water and Melville Water on the Swan River.\n| relief           =\n| label            =\n| label_position   =\n| mark             =\n| mark_width       =\n| type             =\n| motto            =\n| location = Perth, Western Australia\n| coordinates =  |name= |display=inline,title |format=dms}}\n| coords_ref       =\n| area =\n| elevation        =\n| authorized       =\n| created          =\n| established      =\n| designated       =\n| opened           =\n| opening          =\n| closed           =\n| founder          = James Stirling and John Septimus Roe\n| designer         =\n| etymology        =\n| owner            = Crown (public)\n| administrator    = Botanic Gardens and Parks Authority\n| manager          =\n| operator         =\n| visitation_num   = 5.8 million\n| visitation_year  = 2012\n| visitation_ref   =\n| open             = Always\n| status           = Open\n| awards           =\n| camp_sites       =\n| hiking_trails    =\n| paths            =\n| terrain          =\n| habitat          =\n| water            =\n| plants           =\n| vegetation       =\n| species          =\n| collections      =\n| designation      = A-Class Reserve\n| disturbance      =\n| budget           =\n| parking          =\n| publictransit    =\n| transport        =\n| free_label       =\n| free_data        =\n| other_info       =\n| facilities       =\n| website          =\n| embedded         =\n| child            =\n}}\n]]\nKings Park is a  park overlooking Perth Water and the Perth central business district, Western Australia.\nThe park is a mixture of grassed parkland, botanical gardens and natural bushland on Mount Eliza with two-thirds of the grounds conserved as native bushland. Offering panoramic views of the Swan River and Darling Range, it is home to over 324 native plant varieties, 215 known indigenous fungi species and 80 bird species.\nIt is the most popular visitor destination in Western Australia, being visited by over five million people each year.\nBesides tourist facilities, Kings Park contains the State War Memorial, the Royal King's Park Tennis Club, and the Mount Eliza Reservoir. The streets are tree-lined with individual plaques dedicated by family members to Western Australian service men and women who died in World War I and World War II. The park is also rich in flora (both native and introduced) and during September of each year Kings Park hosts Australia's largest wildflower show and exhibitionthe Kings Park Festival.\nThe park is an unincorporated area outside all local government areas; it is administered by the Botanic Gardens and Parks Authority, which is a state government authority.\nHistory\n, overlooking the Narrows Bridge]]\nSince before European settlement and exploration Mount Eliza has been known as  and , the Aboriginal names given by the Noongar people. The area has been an important ceremonial and cultural place for the Whadjuk Noongar, who had campsites and hunting grounds in the area.\nIn the 1880s Kings Park was used by the Perth section of the Volunteer Rifle Corps (a civilian militia) for shooting.\nAt the base of the southern face is a freshwater spring, known as Kennedy Spring (), which provided year-round water for the Aboriginal inhabitants and the first European visitors to the area, such as Willem de Vlamingh's party on 11 January 1697. The Lieutenant Governor of the Swan River Colony, James Stirling, chose the townsite of Perth for this reasonthe only local spring. He named the area Mount Eliza for Eliza Darling.\nThe Colony's first Surveyor General, John Septimus Roe, recognised the qualities of the area and tried to protect it, by identifying the land to be set aside for public purposes. By 1835 Roe's protection was overturned and the first shipment of  of jarrah was cut on Mount Eliza, becoming the colony's first export. Logging in the area continued until 1871 when Roe's successor Malcolm Fraser persuaded the then Governor Weld to set aside  as public reserve. This was enlarged in 1890 by , and in 1897 the area of the reserve was further increased to  by John Forrest, the first president of the Board appointed under the Parks and Reserves Act 1895. The area of Kings Park today is , |acre|ha|order=flip}} smaller than in 1897.\nOfficially opened on 10 August 1895, the park was originally called Perth Park and was renamed in 1901 to ''King's Park''the apostrophe was later dropped. This was to mark the ascension to the British throne of King Edward VII and the visit to Perth of George, the Duke of Cornwall and Princess Mary. One of the major roads through the park, May Drive, is named in the Princess's honour. Forrest planted the first tree, a Norfolk Island pine (Araucaria heterophylla), and other trees were introduced to the site, Eucalyptus ficifolia and exotic species of Pinus; few of these were successful due to lack of irrigation.\nThe Mount Eliza reservoir provided water to the local area, and still remains, but by arrangement of the lease was partly diverted for use in the park itself. This was largely allocated, after 1919, to the memorial oaks and planes lining May Drive. Their eventual failure led to their substitution with bangalay, Eucalyptus botryoides, and Eucalyptus calophylla var. rosea.\nAttempts to situate an Olympic-size swimming pool on bushland in Kings Park led to the establishment in 1956 of a Citizens' Committee for the Preservation of Kings Park, which successfully campaigned to prevent the proposal from going ahead.\nSince 1999, Kings Park has been administered by the Botanic Gardens and Parks Authority, who also administer Bold Park, and does not come under any local government authority. The park's administration building contains all the administrative offices where visitors may book guided walking tours, get information, or reserve one of the facilities.\nKings Park was featured in 2006 on the American reality TV show The Amazing Race 9 as well as in 2011 on the Australian franchise The Amazing Race Australia 1, where teams collected a clue from in front of the War Memorial.\nIn early 2009, the south western area of the park was severely damaged by a fire, which has been suspected to have been deliberately lit.\nThe Elizabeth Quay redevelopment plans include a cable car to Kings Park, although construction is not in scope for the initial phase.\nPanoramas\n) along Fraser Avenue]]\nMemorials\nWar memorial\nThe State War Memorial Precinct is located on Mount Eliza overlooking Perth Water. It comprises the Cenotaph, Court of Contemplation, Flame of Remembrance and Pool of Reflection. The Anzac Day dawn service is held at 5:30am on 25 April each year and is attended by more than 40,000 people. There is also an official service held at 11am on 11 November for Remembrance Day.\nThe Cenotaph was unveiled in the year of the centenary of Western Australia, on 24 November 1929 by the Governor William Campion, and had as the honorary architect General J. Talbot Hobbs. The court of contemplation is at the western side of the precinct and was unveiled on 6 November 1955 by Charles Gairdner. The flame of remembrance and pool of reflection was inaugurated by Queen Elizabeth II on 1 April 2000.\nUnderneath the Cenotaph is the roll of honour with the names of all servicemen and women who enlisted in Western Australia and died in the Boer War, World War I, World War II, Korean War or Vietnam. In 2012, after some controversy the names of service personnel who died in Iraq and Afghanistan were inscribed on the wall. In addition, below the memorial is one of the entrances to the tunnels that are below Kings Park. These are not accessible to the public.\nDistributed throughout the park are more specific memorials to various battles, military units, prisoners of war and other groups.\nHonour avenues\non Lovekin drive (one of the honour avenues) with plaques in front]]\nThe road verges through King Park have been planted with eucalyptus trees, and in front of each one is a plaque honouring those service men who died during action or as a result of wounds received; there are over 1600 of these plaques. Proposed by Arthur Lovekin, owner of the Daily News, the idea was based on the Avenue of Honour in Ballarat, Victoria. Originally families were required to pay 10 shillings, equivalent to |1920|r=0}}|link=yes}} in , to cover the cost of the plantings; ex-servicemen provided the necessary labour to plant the trees. In 1920, Lovekin and board member William Loton each donated £A500, in total equivalent to |link=no}} in , to clear and plant Forrest Avenue with sugar gums. After Lovekin died the Kings Park board renamed Forrest Avenue to Lovekin Drive. Kings Park now has three tree-lined avenues set aside to honour service personnel who died in the two World Wars and other engagements: May Drive, Lovekin Drive, and (the most recent addition) Marri Walk.\nFraser Avenue\nFraser Avenue was originally planted with red-flowering gums (Corymbia ficifolia) in 1898 to celebrate the Diamond Jubilee of Queen Victoria, and added to in 1929 to celebrate the centenary of Western Australia. The gums were affected by patch canker disease in the 1930s. In 1938 lemon scented gum trees (Corymbia citriodora) were planted to honour the dignitaries and members of the centenary organising committee.\nEdith Dircksey Cowan Memorial\nThe Edith Dircksey Cowan Memorial, formerly known as the Edith Cowan Memorial Clock'', is the clock tower at the main entrance to, but not in, Kings Park. It was built in 1934 as a memorial to Edith Cowan, the first woman elected to any Australian parliament. The committee responsible for the memorial had intended that a memorial be built in the park, but controversially the Kings Park Board at the time declined the request, stating that henceforth only national memorials would be considered for inclusion within the park.\nPioneer Women's Memorial\nThe Pioneer Women's Memorial, a non-national memorial, was unveiled in 1968,  years after Edith Dircksey Cowan Memorial was built, and is located in the Western Australian Botanic Garden within Kings Park. It honours the contributions of pioneering women to the development of the city and state.\nCentenary of Western Australian Women's Suffrage Memorial\nThe Centenary of Western Australian Women's Suffrage Memorial, also a non-national memorial, commemorates the hundredth anniversary of women achieving the right to vote equally with men in Western Australian elections.\nBali Memorial\nThis memorial is dedicated to the 16 Western Australian victims, the injured, and those who helped the survivors of the 2002 Bali bombings.\nWestern Australian Botanic Garden\nThe Western Australian Botanic Garden is an  site within the park. It has a collection of 2000 species of Western Australian flora on display. Western Australian Botanic Garden is part of the worldwide network of botanic gardens committed to plant conservation. The garden was designed by John Oldham, who held the position of Government Landscape Architect at the time. It was established to showcase the flora of Western Australia to those visiting Perth for the 1962 British Empire and Commonwealth Games, although the official opening did not take place until 4 October 1965.\nWestern Australian Botanic Garden is today home to over half of Australia's 25,000 plant species and the following popular landmarks:\n* Conservation Garden\n* Gija Jumulu boab tree\n* Pioneer Women's Memorial fountain and water garden\n* Centenary of Western Australian Women's Suffrage Memorial\n* Lotterywest Federation Walkway\nScience\nThe Science Directorate within the Botanic Gardens and Parks Authority is renowned for its research and scientific works, specialising in conservation and restoration of native species and ecosystems. The directorate is categorised into specific scientific areas including restoration ecology, seed science, conservation genetics, propagation science and orchid science, which are supported by many accredited research scientists and students.\nKings Park Festival\nBeginning in 1965, the Kings Park Festival has grown to a month-long celebration of floral displays, live music, exhibitions, workshops, interpretive artworks, guided walks and family activities throughout September. Held to promote the beauty of Western Australia's native wildflowers, the event now attracts over 500,000 people annually.\nMay Drive Parkland\nThe May Drive (formerly Synergy) Parkland is one of two children's playgrounds in Kings Park, the other being the Ivey Watson Playground. It includes a lake and island, play and climbing equipment for children, and life-sized model dinosaurs. It was formerly sponsored by Western Australian power company Synergy.\nThe Vietnam War memorial and Zamia café are located here.\nLotterywest Family Area\nThis popular playground for young families is specifically targeted for children aged under five to encourage strong early childhood development. It was extensively refurbished in 2006 with funding from Lotterywest.\nAboriginal Art Gallery\nThe Aboriginal Art Gallery is a retail outlet on Fraser Avenue that exhibits the works of Aboriginal artists from Western Australia and the Northern Territory.\nDNA Tower\nBuilt on the highest point of the park in 1966, the DNA Tower is a white  high double helix staircase that has 101 steps and was inspired by a double staircase in the Château de Blois in France. Its design resembles the deoxyribonucleic acid (DNA) molecule. The paving below the DNA Tower is made with stones sent from 11 towns and 80 shires in Western Australia.\nRoyal King's Park Tennis Club\nJacob's Ladder\nJacob's Ladder is a set of stairs located at the top end of Cliff Street, in the close proximity to Kings Park, though it is not part of the park itself. It has 242 steps and leads down to Mounts Bay Road. The stairs are a popular site for Perth residents to exercise, with many people using it in the mornings and on lunch breaks.\nWalks\nLaw Walk\nLaw Walk is Kings Park's premier urban bushland trail. It is a  loop walk that begins at Rotunda Two and continues along the ridge of the limestone escarpment to Dryandra Lookout. A loop in the trail then leads to the Lotterywest Federation Walkway and back to the start of Law Walk, taking visitors approximately 45 minutes to complete.\nThe Kokoda Track\nThe Kokoda Track Memorial Walk is a tribute to the bravery of Australian troops who fought in the Papua New Guinea campaign of . The Kokoda Walk begins at Kennedy Fountain on Mounts Bay Road with a steep climb of 150 steps that ascends a height of .\nGuided walks\nFounded in 1984, the Kings Park Guides are a group of volunteers that lead guided walks all year round and help staff the Visitor Information Centre. Twice daily the guides provide guided walking tours of the monuments and memorials, bushland paths and the Botanic Garden.\nThe guides cover all aspects of the park including the local Noongar names and traditions. Walks are varied according to the Noongar seasons: Djilba-Kambarang (July–October) for the wildflower season, Makuru for May and June, and Birak-Djeran for November–April.\nVolunteers and community involvement\nThe Friends of Kings Park was established in 1993 to promote community involvement and commitment within Kings Park and Botanic Garden.\nThe Kings Park Volunteer Master Gardeners provide a free garden advisory service to the community and offer free advice on anything from propagation and potting to planting out and pests.\nIn 1922, the West Perth subbranch of the Returned Services League became responsible for the maintenance and preservation of the plaques along Kings Park's honour avenues. Today they are known as the Honour Avenues Group.\nSee also\n*Australia's Open Garden Scheme\n*Gardening in Australia\n*Heritage gardens in Australia\nGeneral references\n*only one survives. }}\nReferences\n}}\nExternal links\n*\n*[https://web.archive.org/web/20070208154218/http://www.175anniversary.wa.gov.au/index.cfm?fuseaction=heritage_icons.march Heritage Icons: Kings Park]\n*[http://friendsofkingspark.com.au/ Friends of Kings Park]"
    }
  ]
}