{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of Western Georgia\n\nThe Kingdom of Western Georgia (), also known as the Kingdom of Imereti, was a late medieval de facto independent fragmented part of the Kingdom of Georgia that emerged during the Mongol invasions of the realm, led by King David VI Narin in 1259 and later followed by his successors. During this period, the kingdom was reduced to the eastern part of the country and placed under Mongol control. Over the decades, the monarchy would fall into chaos and transform into a federation of autonomous principalities unruly of the central or regional royal power and authority.\nMost of the occasions, realm would be reannexed into unified fold by the eastern Georgian kings. Nevertheless, the unified Georgian realm would de jure collapse in 1490, and western Georgia would secure an independent future under the name of Kingdom of Imereti, that will exist til 1810.\nName of the realm\nThe question of the contemporaneous name of the realm between 1259 and the early 1400s remains without a concrete answer because from the end of the 15th century, Western Georgia extended from the modern-day city of Sochi in the north to Trebizond in the south and the Likhi Range in the east. The chronology of the adoption of this name for this state is not clear and it is plausible that some monarchs before 1490 fragmentation would style themselves as \"Kings of Imereti\", however, it may well be an anachronism and that an actual change of the title would happen much later.\nIndeed, upon 1259 independence pushed by King David VI Narin, he would continue to be styled as David VI, king of united Georgia. Modern historians, such as the former head of the historical department of the Tbilisi State University, Professor Nodar Asatiani justifies the naming of the realm as the Kingdom of Western Georgia until the 15th century, demonstrating that the rulers of that fragmented state considered themselves a legitimate line of the Georgian kings who protected the Georgian nation during the Muslim invasions and were fiercely fighting for the unity. French historian Marie-Félicité Brosset also attributes the creation of the distinctive kingdom of Imereti under that name to the first coronation of King Bagrat VI in 1463.\nHistory\nRevolt Against the Mongols and Early Developments\n, first king of West Georgia.]]\nSince the 1220s, the Kingdom of Georgia had been confronted with repeated Mongol invasions launched by Genghis Khan and his successors, the Ilkhanids. In 1245, the young David VI was recognized as king of Georgia by the Mongol authorities, who granted the same title to his cousin, David VII, in 1248. This effectively divided the Georgian realm between the two cousins, who ruled jointly for nearly a decade under Mongol domination. Over time, however, the Muslim overlords imposed increasingly heavy taxation on the peoples of the Caucasus, sparking widespread popular uprisings, particularly in Shirvan.\nIn 1259, David VI—known by the Mongol nickname Narin (“the younger”)—rose in rebellion against his suzerain, though David VII did not join the revolt. The Ilkhanid Empire swiftly suppressed the insurrection after several brief but bloody engagements. David VI managed to flee to western Georgia through a secret route that led him across Armenia. Upon arriving in Kutaisi, one of the largest cities of western Georgia, he declared the secession of all lands west of the Likhi Range and was proclaimed King of Western Georgia by the local nobility.\nWestern Georgia thus emerged as an independent kingdom seeking to preserve Georgian culture outside the orbit of Mongol influence. At the time, the Ilkhanate was preoccupied with its military campaign in Syria against the Crusader States and the Mamluk Sultanate. As a result, the Mongols largely limited their reaction to increasing tributes levied upon eastern Georgia to compensate for the loss of revenue from some of the richest Georgian provinces now under David VI’s control.\nThe new kingdom encompassed several powerful duchies that commanded important ports along the Black Sea, including the duchies of Guria, Mingrelia, and Abkhazia, which contained the cities of Batumi, Poti, and Sebastopolis. To the north, it controlled the duchies of Svaneti and Racha, securing the Caucasus Mountains as a defensive frontier against the Golden Horde. This geopolitical position enabled the government in Kutaisi to maintain crucial trade routes with the Western world, particularly through Genoese merchants established in Abkhazia and through the Greek Empire of Trebizond. These connections led to large-scale immigration of nobles and merchants from eastern Georgia.\nDavid VI even provided refuge to his cousin, David VII Ulu, when the latter rebelled against Mongol domination in 1261. Although the two kings briefly shared authority, their cooperation quickly deteriorated, compelling David Ulu to return to Tbilisi as early as 1262.\nWhile eastern Georgia was required to contribute heavily to the Ilkhanids’ military campaigns, the government in Kutaisi enjoyed a period of relative prosperity. This stability allowed David VI to repel the forces of the Mongol rebel Teguder, who sought refuge in western Georgia in 1269 after failing in his revolt against Abaqa Khan. Throughout the 1270s, Western Georgia endured several Mongol invasions, which ceased only after David VI agreed to pay tribute. These conflicts nonetheless strengthened the monarchy’s internal position, allowing the crown to suppress and annex the rebellious duchy of Racha in 1278.\nCivil War and the First Collapse\ncrowned Vakhtang II as King of Eastern Georgia in 1289 in an attempt to annex western Georgia.]]\nThe stability of Western Georgia proved short-lived. By 1285, Kutaisi had lost its influence over the Empire of Trebizond, which aligned its foreign policy with Byzantine Empire despite a failed Georgian attempt to depose Emperor John II. In 1289, the Ilkhanid authorities sought to reunify Georgia to strengthen their control over the region and appointed Vakhtang II, the eldest son and heir of David VI, as king of Eastern Georgia. This plan collapsed with Vakhtang II’s death in 1292. David VI himself died shortly afterward, and in 1293 the throne passed to Constantine I.\nWestern Georgia soon descended into civil war when Prince Michael, the younger brother of Constantine I, launched a revolt and seized control of the eastern regions of the kingdom, including Argveti, Racha, and Lechkhumi. Despite numerous attempts by the feudal lords of Kutaisi to mediate the conflict, the two brothers never reconciled. Michael even had himself crowned as a rival king before eventually inheriting the crown outright following Constantine’s death in 1327.\nThe internal disorder enabled the major nobles of Western Georgia to assert their independence from the monarchy. During the conflict, the dukes of Guria, Mingrelia, and Svaneti raised their own armies, marking the beginning of a prolonged period of regional fragmentation that would persist until the Russian invasion of 1810. King Michael attempted unsuccessfully to reassemble a unified military force. Upon his death in 1329, the throne passed to his only son, Bagrat I.\nBagrat, known by the epithet Mtsire (“the Minor”), was still a minor at the time of his accession, and the absence of a regent allowed political chaos among the western Georgian nobility to worsen. In 1330, King George V of Georgia—then engaged in restoring and reunifying the Georgian realm following the expulsion of the Mongols—took advantage of the turmoil in Kutaisi. With the support of powerful Black Sea nobles, he besieged Kutaisi, captured Bagrat I, and annexed the kingdom. Western Georgia thus ceased to exist 71 years after its creation. Bagrat was granted a small appanage in Shorapani, a frontier region between Imereti and Eastern Georgia.\nFirst War of Independence\nIn 1372, Alexander, son of Bagrat, inherited the Duchy of Shorapani and quickly became one of the most powerful nobles in the region, a status he maintained until the tragic events of the end of the century. In 1386, Timur's troops invaded northern Georgia, ravaging the country, capturing Tbilisi in November and forcing King Bagrat V to convert to Islam, while the royal court went into exile in Imereti. Timur entrusted Bagrat V with a large Timurid army to subjugate the far-flung regions of the country, including the duchy of Shorapani, but had to invade the country again when the Georgian king betrayed his suzerain and massacred the army.\nAlexander of Shorapani took advantage of the chaos in eastern Georgia to proclaim himself king of western Georgia and seceded in 1387, crowning himself Alexander I at the Gelati monastery. This proclamation became widely disputed, and the city of Kutaisi remained in the hands of Bagrat V loyalists, while the duchies of Mingrelia, Svaneti, Abkhazia and Guria refused to recognize the sovereignty of the new monarch. A civil war broke out, forcing Alexander I to take fortresses across Imereti by force, before dying in 1389.\nGeorge I succeeded to his brother's claims and was in turn crowned king, continuing the civil war and conquering several fortresses. In 1390, he succeeded in appointing his protégé Arsène as Catholicos of Abkhazia, the most powerful religious figure in western Georgia, triggering the beginning of a religious schism in the Georgian Orthodox community between East and West.\nHowever, this success was short-lived: in 1392, George I was killed during a military campaign to subdue the Duke of Mingrelia, Vameq I Dadiani. With no designated successor, the crown of western Georgia once again fell into chaos, allowing King George VII of Georgia to unite with the great feudal lords of the West and invade the rebellious territories. After a short existence of five years, the Kingdom of West Georgia was once again annexed by Kingdom of Georgia, while the surviving members of the rebel family took refuge in the Caucasus Mountains.\nSecond War of Independence\ngave Prince Demetrius the Duchy of Samokalako after marrying his sister.|alt=|thumb]]\nFor four years, the Kingdom of Western Georgia returned to the domains of the Kingdom of Georgia crown, leading to a large-scale mobilization of Imereti in the wars of George VII of Georgia against Timur. With the region depopulated, the citadels having lost their military defense and the Duke of Mingrelia perishing in 1396, Constantine took advantage of the situation to organize a new revolt against the central government. Constantine was the younger brother of the pretenders Alexander I and George I, and had been exiled to Alania after the conquest of 1392.\nWithout much resistance, the new rebel captured numerous fortresses and had himself crowned Constantine II, but failed to unite with the region's great feudal lords. After demanding the vassalization of the dukes of Svaneti, Mingrelia and Guria, he went to war against Mamia II of Mingrelia, but perished at the battle of Tchaliani in 1401. His nephew, Demetrius, became heir to the rebel crown, but his young age prevented him from defending himself against George VII of Georgia, who took advantage of a temporary ceasefire with Timur to invade western Georgia and once again put an end to the separatist kingdom.\nIn a bid to unite the eastern and western branches of the royal Bagrationi dynasty, in 1415 Alexander I of Georgia married Demetrius's sister, while Demetrius was offered large estates in western Georgia, which became the duchy of Samokalako. Demetrius, who had previously served as crown prince to the western rebels, became a close ally of the eastern Georgia and gave his daughter in marriage to the Georgian co-king Demetrius, who reigned with his father and brothers from 1433 to 1446. When civil war broke out between George VIII and Demetrius, the latter used his father-in-law's regional power to take control of western Georgia, without seceding from Tbilisi, before dying in 1453.\nGeorgian Civil War and final independence\nIn 1455, Bagrat, maternal grandson of Duke Demetrius of Imereti, inherited the duchy and became a loyal vassal to the Georgian crown. However, in the early 1460s, he allied himself with the Georgian prince Qvarqvare II of Samtskhe, who continued his dynastic struggle against the central Georgian government, and the Sultan of Aq Qoyunlu Uzun Hasan against the Kingdom of Georgia. A major confrontation took place in August 1463 at the Battle of Chikhori, during which the troops loyal to King George VIII of Georgia were defeated by the Samtskhe-Saatabago and Bagrat. Bagrat took advantage of his victory to capture Kutaisi and was crowned king of western Georgia, recreating the kingdom for a fourth time.\nIn exchange for their political support, King Bagrat recognised the sovereigns of Mingrelia, Abkhazia, Svaneti and Guria as princes, raising their status within the Georgian political class. Thanks to this alliance, the new king built up a large army that invaded the eastern province of Kartli and captured Tbilisi in 1465, using his new territory to have himself crowned once again, this time as King of United Georgia under the name of Bagrat VI, by the Catholicos of Georgia, in exchange for certain bribes. The situation descended into chaos when Bagrat's predecessor, George VIII, managed to escape from his prison in Kutaisi and took control of the eastern region of Kakheti, declaring the province's independence, while Constantine, Bagrat's half-brother, rebelled and seized northern Georgia. This triumvirate of Georgian kings caused a civil war that lasted until the end of the century.\nA semblance of peace was established in 1468, when Bagrat VI reached an agreement with Constantine in Kartli. But this peace only led to a more serious division: from the early 1470s, the king recognised Constantine as his successor in Kartli, while he designated his eldest son, Alexander, as crown prince of Imereti. Bagrat also shattered religious unity by appointing a new patriarch for western Georgia, dividing the Catholicossate of Georgia, a fact immediately recognised by the Patriarchate of Antioch.\nImereti suffered numerous Turkoman invasions during the 1470s, but the Turkomans chose to ravage Kartli even more, pillaging Tbilisi on several occasions. Against this backdrop of internal chaos and external isolation, Bagrat VI died in 1478, leaving his western throne to his son, who became Alexander II. However, Alexander II failed to gain recognition as the legitimate ruler of western Georgia and had to contend with the unifying ambitions of his uncle, Constantine II of Georgia. The latter invaded Imereti and captured Kutaisi, forcing Alexander to take refuge in the Letchkhoumi mountains.\nIn 1483, Alexander II took advantage of a war between Constantine and the Principality of Samtskhe to regain possession of Imereti. It was then that he was crowned once again, at the Gelati Monastery, beginning a new royal calendar and abandoning all claims to the united crown of Georgia. Alexander thus became the first king of Imereti, a kingdom that took the place of western Georgia and was finally recognised by Constantine in 1490.\nExternal relations\nRelations with the Muslims\nDespite the long-standing hostility between the Muslim states of the Near East and Georgia, David VI Narin maintained relations with some of his Anatolian neighbours, particularly in order to forge alliances against the Ilkhanate. Western Georgia thus allied itself with the Sultanate of Rum, one of the last Seljuk states in the 13th century. King David, himself the son of a Seljuk prince, offered his sister in marriage to Sultan Kaykhusraw II and then to the regent Mu'in al-Din Parwana after the latter's death. However, the end of the sultanate in 1307 and the resulting chaos in the Seljuk principalities prevented any strong collaboration between the two countries.\nIn 1264, West Georgia sent an embassy to Baybars, the Mamluk sultan of Egypt, who devoted his reign to fighting the Mongols. In 1268, a second embassy was sent to Cairo, but no results of these embassies are known to this day.\nRelations with the Byzantine Empire\nWhen the Kingdom of West Georgia was founded, the Byzantine Empire was emerging from half a century of chaos following the conquest of Constantinople by Crusader forces in 1204. However, having restored Orthodox power to the territories of the Near East, the Byzantine Empire tried to find an ally in the Georgians. When David VI took power, he married a Byzantine princess, a descendant of the House of Palaiologos.\nBut friendly relations between the two states ended there. No matrimonial alliance between western Georgia and Byzantine Empire took place after the death of David VI, while the princes of eastern Georgia continued to ally themselves with Byzantium. It was to the empire of Trebizond that the western Georgia turned. In the 1280s, Emperor John II took advantage of the Georgian division to withdraw from the suzerainty of his northern neighbour and sought direct alliance wire-Byzantine Empire, which he visited in 1282. To re-establish his domination, David VI invaded the empire in April 1282 and captured many provinces before laying siege to the capital itself. The Georgian troops were defeated, but the Georgians succeeded in annexing the eastern part of the empire.\nIn 1284, western Georgia financed and supported a coup d'état by a certain Theodora, daughter of Manuel I of Trebizond and possible niece of David VI. She became empress for a few months, before losing the civil war and going into exile in Georgia. According to historian Michael Kuršankis, the coup was organised to install a pro-Georgian, anti-Mongol government, a movement supported by a certain section of the local nobility. Relations between the two states ended shortly afterwards and Trebizond continued to ally itself with the eastern Georgian kingdom.\nReligion\nGeorgia has been an Orthodox nation since the 4th century, and since the reign of David IV of Georgia (1089–1125), the Catholicosate of Georgia has played a major role in the political development of the kingdom. Understanding the negative relationship between his recognition as a Western ruler and the unity of the Georgian Orthodox Church, David VI managed to create the Catholicate of Abkhazia, based at the Gelati Monastery, with its own patriarch around 1290. Some names of Western patriarchs are preserved, such as Nicholas when the kingdom was first proclaimed, and Arsenius and Daniel during the restoration of Western independence in the 1390s.\nIn the 1460s, Bagrat II succeeded in convincing the Patriarch of Antioch Michael IV to draft a special declaration recognizing the unique identity and origins of Christianity in western Georgia. This document formed a legal foundation for the recreation of the Catholicosate of Abkhazia, which was then recognized throughout the Orthodox world.\nThe constant wars plaguing western Georgia prevented the construction of many new churches. However, certain establishments were founded, notably in the autonomous principalities of the country. Thus, the Shemokmedi Monastery was created between the end of the 13th and the beginning of the 14th century by the princes of Guria; the church of Lykhny Church and the Bedia Cathedral were restored by the Georgian nobles of Abkhazia in the 13th and 14th centuries. It is possible that the Skhalta Cathedral, in Adjara, dates from the time of David VI.\nKing Constantine I built the monastery of Atchi in Guria. He also embarked on a program of religious revival and succeeded in reestablishing his kingdom's control over the Monastery of the Cross, a Georgian establishment in Jerusalem transformed into a mosque by the Muslim occupiers of the region, while he is probably at the origin of the construction of the church of Ienachi in Svanetia. Under his reign, Constantine the Great, a former Roman emperor canonized and honored by Orthodox churches, became a patron saint of western Georgia.\nGeorgian literature entered into decline, after Georgian Golden Age at the beginning of the 13th century. Despite this, Byzantine culture largely influenced the religious writings of independent Western Georgia, a fact widely acknowledged in the Mokvi Gospels, a medieval transcription made in Mokvi Cathedral by Georgian monks writing in Nuskhuri (the medieval Georgian alphabet used in the religious context) and trained in Byzantium. In the 14th century, the Mingrelian authorities sent an embassy to Constantinople to bring back Greek artists to repaint the Tsalenjikha Cathedral.\nReferences\nBibliography\n*  }}\n*\n*\n*\n*  }}\n* de Montpéreux, Frédéric Dubois (1999) Voyage autour du Caucase, chez les Tcherkesses et les Abkhazes, en Colchide, en Géorgie, en Arménie et en Crimée, Volume 1, Soukhoumi:Adegi Graphics,\n*\n*\n*"
    }
  ]
}