{
  "content": [
    {
      "type": "text",
      "text": "# King Cat\n\n|native_name=|s=|p=Qī Xiá Wǔ Yì}}\n|director=Hsu Tseng-hung\n|producer=Run Run Shaw\n|writer=Ting Shan-hsi\n|starring=Pat Ting HungChiao ChuangChang YiChin FengCarrie Ku MeiChing LiLo LiehHuang Chung-hsinPaul Wei Ping-aoChing Miao\n|editing=Chiang Hsing-loong\n|music=Wang Chu-jen\n|cinematography=Wang Yung-loong\n|studio=Shaw Brothers Studio\n|distributor=\n|released=\n|runtime=83 minutes\n|country=Hong Kong\n|language=Mandarin\n}}\nKing Cat is a 1967 Hong Kong martial arts film directed by Hsu Tseng Hung and produced by Shaw Brothers Studio. The story is loosely based on the 19th-century Chinese novel The Seven Heroes and Five Gallants. The title refers to a nickname of the protagonist Zhan Zhao (the nickname can also be translated as \"Imperial Cat\").\nPlot\nDuring the Song dynasty, after the upright prefect Bao Zheng executed Pang Yu for embezzlement, the grand tutor Pang Ji sent assassins to avenge his son's death. A chivalrous man, Zhan Zhao the \"Southern Hero\", saved Bao and was conferred the title \"King Cat\" by the emperor. This title invoked the jealousy and anger of Bai Yutang the \"Brocade-Coated Rat\" — as rats were considered cat food — who went to the capital Kaifeng (also known as Bianjing) to challenge Zhan. He was later joined by his 3 elder sworn brothers — Han Zhang the \"Earth-Piercing Rat\", Xu Qing the \"Mountain-Boring Rat\" and Jiang Ping the \"River-Overturning Rat\", and together they stole a treasure from the imperial palace, knowing that Bao would send Zhan to retrieve it.\nOn their way home, the four brothers were confronted by Bai's girlfriend Ding Yuehua the \"Nine-Tailed Phoenix\", who accused them of raping and killing 3 imperial maids whose corpses were discovered right after their theft. Infuriated by her lack of trust, Bai admitted to the crimes, and Ding broke up with him. The real criminal, however, was Hua Chong the \"Flowery Butterfly\", who had been involved with the treacherous grand tutor and his daughter Consort Pang, as well as a few Taoist priests in a plot to overthrow the dynasty. Hua tried to rape Ding, but fled after Zhan stopped him. Ding informed Zhan of Bai's guilt, so Zhan went to the island occupied by Lu Fang the \"Sky-Penetrating Rat\" and his four sworn brothers to arrest Bai, but was trapped under a fish pond. Ding Yuehua and his two brothers Ding Zhaolan and Ding Zhaohui arrived later looking for Zhan, and Zhan escaped from the trap. Finally Zhan discovered that Bai was not the rapist, and Jiang remembered overhearing a plot by Hua to rape Princess Yong'an during her visit to a monastery.\nThe heroes and gallants arrived in the monastery to rescue the princess, only to discover it was filled with rebellious priests. Helped by an army led by Bao, they eventually subdued the rebels and killed Hua. The \"Five Rats\" returned the treasure, and Zhan became romantically involved with Ding Yuehua.\nCast\n*Chang Yi as Zhan Zhao\n*Chiao Chuang as Bai Yutang\n*Pat Ting Hung as Ding Yuehua\n*Ching Li as Jinhua\n*Ching Miao as Bao Zheng\n*Chin Feng as Emperor Renzong of Song\n*Carrie Ku Mei as Princess Yong'an\n*Ku Wen-chung as Han Zhang\n*Huang Tsung Hsing as Xu Qing\n*Paul Wei Ping-ao as Jiang Ping\n*Yang Chih-ching as Lu Fang\n*Fang Mian as Gongsun Ce\n*Cliff Lok as Bao Xing\n*Lo Lieh as Hua Chong\n*Helen Ma Hoi-lun as Consort Pang\n*Tin Sam as Imperial Tutor Pang\n*Fan Dan as Pang Yu\n*Cheng Lei as Ding Zhaohui\n*Chao Hsiung as Ding Zhaolan\n*Wu Ma as Little Sun\nReferences\n*\nExternal links\n*\n*\n*[https://www.youtube.com/watch?v=TzjSRiUT6Vw Trailer with English Subtitles]"
    }
  ]
}