{
  "content": [
    {
      "type": "text",
      "text": "# Kingswood College (Box Hill)\n\n| type                    = private, co-education\n| denomination            = Association with the Uniting Church\n| established             = 1890\n| principal               = Chrissy Gamble\n| chaplain                = Grant Exon\n| colours                 = Navy, light blue and yellow\n| slogan                  =\n| fees                    =\n| revenue                 =\n| affiliation             = Eastern Independent Schools of Melbourne\n| address                 = 355 Station Street\n| gender                  = Co-educational\n| enrolment               = ~700 (K&ndash;12)\n| num_employ              =\n| years                   = 3 Year Old Kinder to Year 12\n| homepage                = https://www.kingswoodcollege.vic.edu.au/\n}}\nKingswood College is a coeducational K–12 college located in the eastern Melbourne suburb of Box Hill South, Victoria, Australia. It began as New College in 1890, and was known as Box Hill Grammar from 1928 to 1965. Among other associations, it operates in association with the Uniting Church in Australia but is not governed or managed by the Church.\nHistory\nIn 1890, Arthur Stephenson established New College, in Rose Street Box Hill, as a boys' school for day students and boarders. The school was renamed Box Hill Grammar around 1928. The Methodist Church assumed responsibility for the school in 1929 and purchased a property in Station Street, Box Hill, known as Gwynton Park. A new building, the Cato Block, was built there in 1930. The move to the new site generated much optimism, and a master plan of imposing buildings was developed. However, the Great Depression and World War II had a damaging effect on the school and, instead of implementing the master plan, increased numbers of students had to be accommodated at virtually no cost.\nThe school became co-educational in 1933 when girls were introduced to the boarding section of the school. That arrangement was unheard of at that time in mainstream church schools in Victoria, if not Australia. In 1936, there were 14 girls at the school and, in 1937, with 21 girls enrolled, co-educational classes were held. By 1945, there were 83 boys and 52 girls at the school and, by 1955, the numbers of students had increased to 174 boys and 73 girls. However, between 1964 and 1977, the school reverted to only enrolling boys.\nIn 1937, the school granted Wesley College an option to purchase its land and buildings, in return for funds from Wesley to reduce some of the school's debt. In 1946, with Wesley struggling for space to accommodate increasing numbers, it opened negotiations to take over the school, and an agreement was reached in 1947 which, in effect, vested the school in Wesley, but allowed the school to maintain its own council until Wesley was ready to proceed. That proved to be a slow process and, when Box Hill Grammar's own enrolments increased in the early 1950s, the council became less enamoured of the idea. In 1955, it was finally abandoned, with Wesley paying the school £4,500 to recoup losses while Wesley's control had restricted development.\nThe school was renamed Kingswood College in 1965, to reflect both the Methodist tradition and to help create a new image. Between 1963 and 1968, enrolments doubled and a new science block and library were opened. The opening of the Junior School, in 1971, was a significant development, both financially and educationally. A new Senior School centre, named for Charles Fitzroy Walker, a former 36-year principal, was opened in 1975, providing for a balanced academic and social education for Year 11 and 12 students. Co-education was re-introduced in 1977.\nDuring the 1990s, the school tried to build its educational, sporting and artistic programs. A pre-school centre, Speedy House, was opened both 3-year-old and 4-year-old children. Computer, food technology and library facilities were upgraded, and a new technology centre was opened in 1996, which provided a modern environment for students to study graphics and develop skills in the area of production technology.\nA new Middle School centre, opened in 2002, provided a base for Year 7 students and catered for a range of administrative functions. Landscaping was undertaken to complement the building. In 2005, the refurbishment of the Junior School was completed with new Grade 5 and 6 rooms. In 2008, construction began on a new Science Building, named after the then principal Annette Bennet. It was officially opened on the 28 March 2009. The former science block was completely renovated and became the Year 10 Centre. In 2010, Brimacombe Hall was refurbished to provide a larger auditorium and additional performance and rehearsal spaces.\nThe College is now in the first year of the current strategic plan. It has launched into a refurbishment and redevelopment plan with the completion of a Master Plan and overall landscape plan for the campus.\nKingswood College has strong relationships with two sister schools in China: Gaoxin No 1 High School in Xi'an and Jiangsu Xishan Senior High School in Wuxi. Both participate in exchange programs with Kingswood, as well as offering guided visits to China, including a study of its education system. Next door to the school there is a private community named after the school called Kingswood Rise.\nCo-curricular activities\nHouse system\nThe college has four houses, Brunning (red, named after Rupert Brunning, a former headmaster), Gwynton (blue, taking its name from Gwynton Park, the site the college is situated on), New (yellow, with the name taken from the original name of the school, New College), and Walker (green, named after Charles Fitzroy Walker, a long serving headmaster). If a family member goes or went to the school you will be in the same house as your family member.\nSport\nInter-house competitions\nStudents will compete in a carnival for each swimming, athletics and cross country yearly. The swimming and cross country carnivals are held for Years 7–12 exclusively, while the athletics carnival is open to all students Prep to Year 12.\nThe 'House Cup' is awarded to the winning house after each event, as well as an overall award at the end of the year.\nThe 'Spirit Cup' is awarded to the house with the most spirit at each event, and overall throughout the year.\nInterschool competitions\nBetween Years 7 and 12, all students at the college compete in Eastern Independent Schools of Melbourne (EISM) competitions. Each season lasts either one or two terms, and consists of a normal season and finals.\nSwimming and athletic carnivals are also available for the champions of the inter-house tournaments.\nthe junior school has athletics carnivals, swimming carnivals, and winter and summer inter school sports\nEISM premierships\nKingswood has won the following EISM senior premierships.\nCombined:\n* Athletics (5) – 1979, 1980, 1981, 1999, 2000\n* Badminton – 2019\n* Swimming – 1979\nBoys:\n* Athletics (2) – 1999, 2000\n* Basketball (4) – 1996, 1999, 2001, 2005\n* Cricket (5) – 1998, 1999, 2001, 2003, 2019\n* Cross Country – 2005\n* Football (2) – 2001, 2004\n* Football 12's (2) – 2018, 2019\n* Hockey (2) – 2000, 2002\n* Soccer (2) – 1996, 1997\n* Swimming (4) – 1977, 1978, 1980, 1981\n* Table Tennis (4) – 1981, 1997, 2003, 2014\n* Tennis – 2018\nGirls:\n* Athletics – 1999\n* Basketball (4) – 1982, 1998, 2016, 2021\n* Cross Country – 2001\n* Netball (2) – 1998, 2006\n* Soccer (5)  – 1998, 2005, 2007, 2016, 2020\n* Softball (3) – 1998, 2000, 2015\n* Table Tennis (6) – 2000, 2002, 2003, 2004, 2005, 2018\n* Tennis – 1998\n* Volleyball (3) – 1998, 2000, 2001\nPerforming arts\nHouse performing arts, or HPA, takes place in the later half of the year, and is optional for students to take part in. Each house has 15 minutes to present a piece that includes elements of music, drama, and dance. This is then judged out of 500, and the winner is awarded with the House Cup.\nEach house presents their piece twice, once in the early afternoon to the school and a panel of judges, and one in the evening to the general public (hasn't occurred since 2019 due to the Covid-19 Pandemic).\nReferences\nSources\n* Wesley College - The First Hundred Years Geoffrey Blainey, James Morrisey and S.E.K. Hulme (1967) Robertson & Mullens\nExternal links\n*[http://www.kingswoodcollege.vic.edu.au/ Kingswood College]"
    }
  ]
}