{
  "content": [
    {
      "type": "text",
      "text": "# Kingston upon Hull Combined Court Centre\n\n| location = Lowgate, Kingston upon Hull\n| area =\n| built =1991\n| architect =Building Design Partnership\n| architecture =Modernist style\n| website=\n}}\nThe Kingston upon Hull Combined Court Centre is a Crown Court venue, which deals with criminal cases, as well as a County Court, which deals with civil cases, in Lowgate, Kingston upon Hull, England.\nHistory\nUntil the early 1990s, all criminal court hearings were held in the Guildhall. However, as the number of court cases in Kingston upon Hull grew, it became necessary to commission a more modern courthouse. The site selected by the Lord Chancellor's Department, on the east side of Lowgate, had been occupied by a piece of land known in the 19th century as \"George Yard\" which had been occupied by a Wesleyan Chapel before becoming home to the Queen's Hall in 1905.\nThe new building was designed by the Building Design Partnership, built in red brick with stone dressings at a cost of £11.3&nbsp;million, and was officially opened by the Lord Chancellor, Lord Mackay, on 18 October 1991. The design involved an asymmetrical main frontage facing southwest onto a small courtyard just off Lowgate. The central section, of three bays, featured a short flight of steps leading up to a glass doorway with a stone architrave. There was an oriel window surmounted by a stone panel with a carved Royal coat of arms on the first floor and a flagpole framed by a round headed structure at attic level. The outer bays, which were flanked by pilasters, featured lancet windows on the first floor and round headed structures containing louvers at attic level. The wings were fenestrated by casement windows on both floors and the left hand wing featured a tower with a dome at the corner with Alfred Gelder Street. At roof level, there was also a large central dome. Internally, the building was laid out to accommodate 14 courtrooms.\nNotable cases have included the trial and conviction of the footballer, Jonathan Woodgate, in December 2001, for an incident of affray outside the Majestyk nightclub in Leeds, in which a student was left with injuries to his face.\nReferences\nExternal links\n*[https://www.find-court-tribunal.service.gov.uk/courts/kingston-upon-hull-combined-court-centre Court information]"
    }
  ]
}