{
  "content": [
    {
      "type": "text",
      "text": "# King of Falafel & Shawarma\n\nKing of Falafel & Shawarma is a restaurant in Astoria, Queens, New York City, founded by Fares (\"Freddy\") Zeideia. The business started as a street cart in 2002 and opened a storefront on Broadway in January 2016. It has been covered for its Palestinian-style, chickpea-only falafel shaped as oblong patties and for winning the 2010 Vendy Award for Best Street Food. The operation has also run multiple food trucks serving New York City neighborhoods. In 2024, the business expanded to Chicago Ridge, Illinois.\nHistory\nThe business began in 2002, when founder Fares (\"Freddy\") Zeideia launched a falafel cart at Broadway and 30th Street in Astoria, serving dishes based on foods from his Palestinian upbringing. The cart gained wider recognition after becoming a finalist for the 2009 Vendy Awards and winning the 2010 Vendy Award for Best Street Food. He expanded the business with an additional food truck in 2013. After more than a decade vending on the street, he opened a permanent restaurant on 30-15 Broadway in January 2016, near the cart’s longtime corner. In July 2022, he announced plans to sell the restaurant and associated trucks, but later chose to continue running the business following strong community support. By 2024, the business operated four food trucks in addition to the Astoria restaurant. That year, he also opened a new location in Chicago Ridge, Illinois, and expressed interest in further expansion.\nFood\nThe restaurant serves Palestinian dishes such as chickpea-based, oblong falafel, chicken and lamb shawarma, and house-made pita. The falafel is prepared without fava beans and follows a recipe from Zeideia’s mother, using soaked chickpeas ground with parsley and onion and seasoned with spices including coriander, anise, and cayenne before frying. Additional menu items include kebabs, kofta, basmati rice cooked with garlic and onion, and a hybrid “shawafel” that combines falafel and shawarma. The menu also features platters with shawarma, rice, salad, and falafel.\nStyle\nThe restaurant has a bright interior featuring prominent red and green elements, with matching chairs and black tables, a color scheme noted as referencing the Palestinian flag. A model of a lime-green food-truck fender with the license plate “FALAFEL1” is mounted on the restaurant’s exterior. Murals inside the restaurant depict locations such as Jerusalem and Manhattan, and the storefront displays Palestinian flags, political stickers, satirical artwork, and a mural referencing the conflict in Gaza. The restaurant has an open kitchen layout, and strong aromas of garlic, onion, and fried chickpeas are noticeable upon entering.\nRecognition\nKing of Falafel & Shawarma was a Vendy Awards finalist in 2009 and later received the Best Street Food (Vendy Cup) in 2010.\nOperations\nThe business operates a brick-and-mortar restaurant on Broadway in Astoria and has expanded into several mobile units. In addition to the original street cart, a food truck was added in 2013, and by 2024 the business operated four trucks at rotating sites across Manhattan, Queens, and the Bronx. Reported truck locations include East 53rd Street and Park Avenue in Manhattan, Ditmars Boulevard and 31st Street in Queens, Bell Boulevard and 42nd Avenue in Queens, and 5560 Broadway in the Bronx. The Astoria restaurant functions as the company’s central base of operations. In 2024, the business expanded outside New York with a takeout and drive-through location in Chicago Ridge, Illinois, and additional Chicago-area sites were under consideration.\nOwner\nThe business is owned by Fares (\"Freddy\") Zeideia, a Palestinian American who was born in Ramallah and has worked in Astoria for more than two decades. Zeideia is noted for publicly displaying his Palestinian identity at the restaurant, including political imagery, Palestinian flags, and satirical artwork at the entrance and on the storefront walls. In an interview, Zeideia stated that conversations about food often include political topics. In the restaurant, he is often seen wearing a King of Falafel T-shirt, vegetable-patterned pants, and colorful Crocs, which are described in reporting as his usual attire.\nReferences"
    }
  ]
}