{
  "content": [
    {
      "type": "text",
      "text": "# King Tears Bat Trip\n\n| current_members = Luke BergmanThomas CampbellKristian GarrardChris IcasianoBrandon LuciaNeil WelchEvan Woodle\n}}\nKing Tears Bat Trip is an avant-garde and free jazz ensemble formed in Seattle. Led by composer and guitarist Luke Bergman, they are known for their four drummers and unique rhythmic sound centered around percussion and tenor saxophone. They perform live rarely and are known for wearing costumes during their performances, such as banana suits, feathered Mardi Gras veils and even Majora’s Mask from the Legend of Zelda. Its members are active in numerous other bands such as Thousands, Chemical Clock, Heatwarmer and Lonesome Shack, making King Tears Bat Trip more of a side-project.\nHistory\nConceived as a septet, King Tears Bat Trip was conceived in February 2010 when University of Washington jazz professor and guitarist Luke Bergman curated an event called the Racer Sessions in Seattle. At the weekly event a curator debuts a new composition which is then followed by a free improvisation jam. The performers were drummers Thomas Campbell, Kristian Garrard, Chris Icasiano, and Evan Woodle; tenor saxophonist Neil Welch; guitarist Luke Bergman; and Brandon Lucia on electronics. Concerning the origin of the band's name, Luke Bergman recalled in an interview the time when The Improvised Music Project Festival in Seattle were trying to book the then unnamed group: \"Evan Woodle called me when Kristian Garrard and I were in Austin, Texas playing at the South by Southwest festival, and he needed a name right then because they were making a poster for the festival. Kristian and I had just walked past a place called \"King Tears Mortuary\" and we were laughing about the fact that someone had recommended we check out something called the \"Bat Trip.\"\"\nTheir self-titled debut was released on March 24, 2012 and comprised two lengthy compositions that were recorded and unedited in the studio. The album was well received in underground circles and was compared favorable to the music of Albert Ayler. In June 2014, the album was re-issued on vinyl by Debacle Records with remastering done by Scott Colburn, known for his production work for Animal Collective and Sun City Girls.\nDiscography\n;Studio albums\n*King Tears Bat Trip (Table & Chairs, 2012)\nReferences\nExternal links\n*\n*[https://kingtearsbattrip.bandcamp.com/releases King Tears Bat Trip] at Bandcamp\n*\n*"
    }
  ]
}