{
  "content": [
    {
      "type": "text",
      "text": "# Kingweston\n\n|official_name= Kingweston\n| population = 128\n| population_ref = (2011)\n|unitary_england= Somerset Council\n|lieutenancy_england = Somerset\n|region= South West England\n|constituency_westminster= Glastonbury and Somerton\n|post_town= Somerton\n|postcode_district = TA11\n|postcode_area= TA\n|dial_code= 01458\n|os_grid_reference= ST526311\n|static_image_name = The Approach to Kingweston Church - geograph.org.uk - 444041.jpg\n|static_image_alt=Stone building with spire above a square tower.\n|static_image_caption = The Approach to Kingweston Church\n|static_image_2 = Kingweston - geograph.org.uk - 165631.jpg\n|static_image_2_width = 240px\n|static_image_2_caption = Kingweston\n}}\nKingweston is a village and civil parish in Somerset, England, situated on Combe Hill,  north east of Somerton.  The village has a population of 128.\nHistory\nThe village's name was Chinwardestune in the Domesday Book of 1086. There is evidence of Romano-British occupation in Copley Wood.\nAfter the Norman Conquest the manor was given to Eustance, Count of Bologne and held by his family until a descendant gave it to Bermondsey Abbey in 1114, who held the manor until the Dissolution of the monasteries. It then passed to the Smyth family of Long Ashton until it was bought in 1740 by Caleb Dickinson.\nThe parish was part of the hundred of Catsash.\nGovernance\nThe parish council has responsibility for local issues, including setting an annual precept (local rate) to cover the council's operating costs and producing annual accounts for public scrutiny. The parish council evaluates local planning applications and works with the local police, district council officers, and neighbourhood watch groups on matters of crime, security, and traffic. The parish council's role also includes initiating projects for the maintenance and repair of parish facilities, as well as consulting with the district council on the maintenance, repair, and improvement of highways, drainage, footpaths, public transport, and street cleaning. Conservation matters (including trees and listed buildings) and environmental issues are also the responsibility of the council.\nFor local government purposes, since 1 April 2023, the parish comes under the unitary authority of Somerset Council. Prior to this, it was part of the non-metropolitan district of South Somerset (established under the Local Government Act 1972). It was part of Langport Rural District before 1974.\nIt is also part of the Glastonbury and Somerton county constituency represented in the House of Commons of the Parliament of the United Kingdom. It elects one Member of Parliament (MP) by the first past the post system of election.\nGeography\nKingweston Meadows is a biological Site of Special Scientific Interest providing an example of an unimproved herb-rich neutral grassland of a type which is now rare in Britain.\nLandmarks\nKingweston House was built on the site of a previous Tudor House, but the current building was erected by the Dickinson family in the 19th century. Since 1946 it has been part of Millfield School.\nFile:Conference room, Kingweston - geograph.org.uk - 1014378.jpg|Conference room\nFile:Cottage, Kingweston - geograph.org.uk - 1014358.jpg|Cottage\nFile:Football practice in front of Kingweston Church - geograph.org.uk - 668480.jpg|Kingweston House and church\nReligious sites\nThe parish Church of All Saints retains some medieval fragments, but was largely rebuilt by Charles Edmund Giles between 1852 and 1855.\nReferences\nExternal links\n*[http://kingweston.atspace.com Kingweston] Photographs, history and information about Kingweston\n*[http://www.microform.co.uk/guides/R96977.pdf Dickinson papers 1675-1849] Records from the Dickinson papers"
    }
  ]
}