{
  "content": [
    {
      "type": "text",
      "text": "# King Mob (character)\n\nKing Mob is a fictional character, a revolutionary created by Grant Morrison for The Invisibles.\nCharacter development\nThe character's name is directly inspired by the Situationist group King Mob, as well as Morrison themself (as a part of a sigil to improve their life). He is also Gideon Stargrave, one of Morrison's early creations. King Mob is generally considered to be a fictional surrogate of Morrison in the Invisibles comics.\nSome elements of his personality, especially his Gideon persona, are inspired by J. G. Ballard's The Day of Forever and by Michael Moorcock's Jerry Cornelius.\nFictional character biography\nKing Mob is a former horror writer named Gideon Starorzewski whose pen name was \"Kirk Morrison\". He is the leader of the cell of Invisibles at the beginning of the series, and adopted the name from an earlier Invisible active in the 1930s. He has a love-hate relationship with his \"counter culture terrorist\" persona, and is sometimes troubled by his capacity for violence.\nHe recruits a young Liverpudlian \"Jack Frost\" to the cell so they can go back in time and recruit the Marquis de Sade as well. Captured while saving Lord Fanny, King Mob is tortured by Sir Miles Delacourt, during which he has a vision or hallucination of an alien spaceship in Australia. King Mob psychically forces Delacourt to free him.\nWhile sneaking into the Dulce installation, King Mob finds out that the \"Lost Ones\" are using \"living information\" from a parallel universe to sow chaos and discord in King Mob's own. After his friend and lover Ragged Robin leaves his time for the future, King Mob makes some steps towards abandoning violence as a tactic by dropping his gun in a pond on the property of Mason Lang, but he also later blows up Lang's house.\nAfter an extended sabbatical in Ladakh, King Mob returns once more to England, in time to intervene in Miles Delacourt's anointing of the Moonchild and to rescue Jack Frost from operatives of \"Division X\", during which King Mob is gravely wounded, although he is saved by the widow of a man he had killed.\nIn 2012, King Mob runs Technoccult and plans to release an inhaler-game based on his life in the Invisibles. King Mob then kills the King-of-All-Tears as \"The Archon\" emerges from the time disturbance created when Ragged Robin departed for the future. Robin herself then emerges, and she and King Mob are reunited.\nPowers and abilities\nKing Mob is a practiced chaos magician, psychic combatant, gunfighter, martial artist and time traveler.\nNotes\nReferences\n*"
    }
  ]
}