{
  "content": [
    {
      "type": "text",
      "text": "# King in the Wilderness\n\n| writer         =\n| screenplay     =\n| story          =\n| based_on       =\n| starring       =\n| narrator       =\n| music          = Saul Simon MacWilliams\n| cinematography = Clair Popkin\n| editing        =\n| studio         = Kunhardt Films\n| distributor    = HBO\n| released       = |2018|04|02|U.S.}}\n| runtime        =\n| country        = United States\n| language       = English\n}}\nKing in the Wilderness is an American documentary film about Martin Luther King Jr. that premiered on April 2, 2018, on HBO, focusing on the final two years of his life leading up to his assassination on April 4, 1968.\nSummary\nThe film includes some never-before-seen footage of interviews with some of those closest to King interspersed with historical archives during a period of his life. In addition to upsetting both President Lyndon Johnson and the FBI Director J. Edgar Hoover, as well as numerous other opposition groups, and despite King's own self-doubts as he was coming to terms with his possible death, he refused to back away from the civil rights and anti-war challenges of his times.\nThe film focuses on events in King's life and the civil rights movement such as the Chicago Freedom Movement, the James Meredith march, the anti-Vietnam War protests and King's \"Beyond Vietnam: A Time to Break Silence\" speech, the 1967 riots, preparation for the Poor People's Campaign, the Memphis sanitation strike, the \"I've Been to the Mountaintop\" speech, and King's assassination and funeral. Among King's colleagues and friends interviewed in the documentary are Bernard Lafayette, Andrew Young, Diane Nash, Harry Belafonte, John Lewis, Dorothy Cotton, Joan Baez, Xernona Clayton, Jesse Jackson, Mary Lou Finley, Cleveland Sellers, and C. T. Vivian.\nAccolades\nKing in the Wilderness won an Emmy for Outstanding Historical Documentary at the 40th News and Documentary Emmy Awards.\nSee also\n*Civil rights movement in popular culture\n*List of black films of the 2010s\nReferences\nExternal links\n*[https://www.hbo.com/documentaries/king-in-the-wilderness King in the Wilderness] on HBO\n*"
    }
  ]
}