{
  "content": [
    {
      "type": "text",
      "text": "# King Gordy\n\n| alias            =\n| birth_date       =\n| origin           = Detroit, Michigan, U.S.\n| genre            =\n| years_active     = 2000–present\n| label            =\n| current_member_of =\n| past_member_of   =\n| website          = https://www.evenheathens.com/\n}}\nWaverly Walter Alford III (born August 18, 1977), known professionally by his stage name King Gordy, is an American rapper and singer from Detroit, Michigan. He is one-fourth of underground hip hop group the Fat Killahz (with Fatt Father, Marv Won and Bang Belushi), one-third of the horrorcore supergroup How to Gag a Maggot (with Jimmy Donn and GrewSum), and one-half of the hardcore rap duos Last American Rock Stars (with Bizarre of D12) and Even Heathens (with ILLtemper.) He is currently signed to his self-owned record label King of Van Dyke Entertainment, which he unofficially launched during late 2018.\nEarly life\nAlford was raised in Detroit, Michigan. His father worked for Chrysler and his mother worked for the school board. His parents split when he was 13. At the age of sixteen, Alford was arrested for selling drugs, and served nine months in a Wayne County jail. Following his early album releases, Alford settled down in Atlanta and had 2 children with a woman named Raphael Dabrielle, who also was a rapper at the time.\nCareer\nHe has started rapping on Detroit local underground hip hop scene in 2000 as a battle rapper. In 2001, along with Fatt Father, Marv Won and Shim-E-Bango, Gordy joined a four-piece Detroit-based underground hip hop act the Fat Killahz as the only singing emcee of the group. He signed with Bass Brothers' Web Entertainment, an independent label that released Eminem's first full-length album, Infinite, and started work on a record.\nDue to this term, Gordy has appeared in the film 8 Mile, in which he played the fictional rapper, \"Big O\", the character was regularly mentioned by character Wink Harris as \"the fat man flipping burgers at Mickey D's\". He dropped his debut solo album The Entity in 2003, which is notable also by its audio production handled by Eminem among other producers and rappers appeared on the record. In 2005, Gordy and the Fat Killahz released the group's debut ''Guess Who's Coming to Dinner?'' album via No Tyze Entertainment. Same year he made guest appearances on Bizarre's and Proof's debut albums.\nFrom 2006 to 2009, Gordy released another five solo albums via Morbid Music LLC, which featured guest appearances only by the likes of the Fat Killahz and his childhood friend Bizarre of D12, with whom Gordy formed hip hop duo The Davidians in 2008. Gordy's second successful album Xerxes The God-King was released in 2010 and featured his second music video (since \"Nightmares\" from The Entity), \"Sing For The Dead\".\nIn 2011, Gordy released King Gordy Sings the Blues, a new Fat Killahz effort The E.P., and his first extended play ''Jesus Christ's Mistress. The following year he nicknamed himself as Dark Lord Vader and dropped his second solo EP Hail Dark Lord Vader, which marked him his comeback into horrorcore. He has started to aggressively promote his harder image in social media, and Twitter suspended Gordy for various reasons as he mentions on the album.\nAfter recovering from being shot five times during an alleged robbery in Detroit, King Gordy came back with Herojuana, a collaborative six-track EP with his Fat Killahz bandmate Bang Belushi, released in 2016.\nIn 2017, he and Bizarre got signed by Twiztid to Majik Ninja Entertainment as a hip hop duo L.A.R.S. They released their eponymous debut album on February 16, 2018. Also since 2017, Gordy and Minnesota rapper Jimmy Donn teams up for How to Gag a Maggot'' project, which has 1 studio album followed-up 2 EPs as of June 2020. King Gordy released 2 singles in late 2018 titled \"King of Van Dyke N Harper Freestyle\" and \"Anakin Halloween Freestyle\" under his self-owned unofficial record label King of Van Dyke Entertainment.\nConfrontations\nAfter rapper Haystak made a diss track towards Eminem, King Gordy and Bizarre collaborated to respond with diss tracks \"Hey, Haystak\" and \"R.I.P Haystak\". Rapper Brabo Gator, who knew Haystak, then dissed King Gordy, Obie Trice, D12 and Eminem.\nOn June 28, 2013, King Gordy challenged the rapping ability of Lupe Fiasco and other mainstream rappers (such as Mac Miller, Yelawolf, and Tyler the Creator) on Twitter. Lupe Fiasco then continued to fuel the fire by responding to King Gordy, the back and forth continued for over eight hours and both rappers explicitly expressed their respect for each other's craft, but insisted they would beat each other in a rap battle.\nIn late 2014, Gordy released a song titled \"Return Of The King\", which is a diss track towards other rappers such as Lo Key and Tyler the Creator.\nDiscography\nStudio albums\n*2003: The Entity\n*2006: King of Horrorcore\n*2007: Van Dyke and Harper Music\n*2007: ''Cobain's Diary\n*2008: The Great American Weed Smoker\n*2009: King of Horrorcore 2\n*2010: Xerxes The God-King\n*2011: King Gordy Sings the Blues\n*Cancelled: Anakin\nCollaborative albums\n*2005: Guess Who's Coming to Dinner? (with Fat Killahz)\n*2017: How to Gag a Maggot (with How to Gag a Maggot)\n*2018: Last American Rock Stars (with L.A.R.S.)\n*2020: The House LP (with How to Gag a Maggot)\n*2021: II: Goat (with How to Gag a Maggot)\n*2021: Even Heathens (with Even Heathens)\n*2022: Unpleasant Never Dies (with Even Heathens)\n*2022: Odd Gods (with Even Heathens)\n*2023: Odd Gods 2 (with Even Heathens)\n*2024: Odd Gods 3 (with Even Heathens)\n*2025: Handful of Cancel'' (with Even Heathens)\nEP's\n*2011: The E.P. (with Fat Killahz)\n*2011: ''Jesus Christ's Mistress\n*2012: Hail Dark Lord Vader\n*2016: Herojuana (with Bang Belushi)\n*2019: How to Gag a Maggot: Reigning Blood (with How to Gag a Maggot)\n*2019: House of HorrorS (with Murder Rap KingZ)\n*2020: The Purge (with How to Gag a Maggot)\n*2020: The House EP (with How to Gag a Maggot)\n*2021: Foster Kidz (with Trilogy)\n*2021: Ladon (with Tres Aurland)\n*2021: Horrorcore Stories (with Even Heathens)\n*2021: The Infected (with How to Gag a Maggot)\n*2022: Tales from the Darkside (with Psychoetry)\n*2022: Morbid Clique vs. King Gordy (with Morbid Clique)\n*2023: Kody and the King (with Kody Lee)\n*2023: Die Slow (with How to Gag a Maggot)\n*2024: WIC Kids (with WIC Kids)\n*2025: CALMLY manic. - EP (with Paranoah)\nMixtapes\n* 2003: 2 Fat 2 Furious (with Fat Killahz)\n* 2004: WFKR 31.3 FKM – FK Radio The Mixtape: The World’s Largest Mixtape (with Fat Killahz)\n* 2017: Foul World (with L.A.R.S.)\nCompilations\n* 2019: Prime Cuts (with How to Gag a Maggot)\n* 2021: Goat (with How to Gag a Maggot)\nBox sets\n* 2020: All of Our Secrets (with How to Gag a Maggot)\n* 2023: Dead X Dawn (with How to Gag a Maggot)\nFilmography\n*8 Mile'' (2002) – Big O\nAwards and nominations\n{| class=\" wikitable plainrowheaders \" style=\"table-layout: fixed; margin-right: 0; \"\n|+\n! scope=\"col\" |Year\n! scope=\"col\" |Nominee / work\n! scope=\"col\" |Award\n! scope=\"col\" |Result\n!\n|-\n| align=\"center\" |2007\n|Himself\n|Detroit Music Award for Outstanding Hip-Hop MC\n| style=\"background: #99FF99; color: black; vertical-align: middle; text-align: center; \" class=\"yes table-yes2\" |Won\n|\n|}\nReferences"
    }
  ]
}