{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of Khana\n\nThe Kingdom of Ḫana (KUR ḫa-ni-i \"Land of Ḫana\"; Khana) was the Syrian kingdom from Hana Land  in the middle Euphrates region north of Mari, which included the ancient city of Terqa. The kingdom was a successor to the Kingdom of Mari and emerged during the decline of the First Babylonian Dynasty. A newer view is that only the initial six rulers lived during that time and that after an interregnum, Khana re-emerged in the Middle Babylonian period under the last six kings. The Low Chronology dating scheme for Hana has gained much support. The kingdom was located in the middle Euphrates close to the junction of the Khabur River. Its capital was the town of Terqa or possibly Saggarâtum.\nLocation\nThe kingdom of Hana was located on territories formerly ruled by the sovereigns of Mari. The rulers of Mari held the title \"King of Mari, Tuttul and the land of Hana\". Since Mari was abandoned after its destruction by Hammurabi in  (middle chronology) and Tuttul certainly was not part of the territories of the new state, the location of Khana is identified with the territories around Mari. Its capital Terqa was located 45&nbsp;km north of Mari below the junction of Khabur River, roughly at the site of the modern Syrian town of Asharah.\nHistory\nThe Hanaeans\nThe Hanaeans were a nomadic tribal confederacy based around the middle Euphrates on the Syrian-Iraqi border. The Hanaean people led a semi-nomadic life characterized by seasonal movement of the sheep herds, never too far from the rivers and watering places, returning to their settlements for the harvest season. Based on onomastic evidence they were related to the other West Semitic peoples known as the Amorites, such as the Yaminites, Rabbians and Habiru, originally coming from the deserts of Syria. The contact with the settled population leads to gradual transformation of the population into more settled rural communities.\nThe history of the Hanaeans is closely linked to the kingdom of Mari. They were strongly presented in the Euphrates and Khabur valleys. Records indicate that the area around Terqa could muster several thousand in times of need. The Hanaeans were widely used as soldiers by the rulers of Mari after their subduing by king Iakhdunlim. Within the armed forces of Mari they were grouped by clans of which about ten are known.\nMiddle Bronze\nMari period\nAn independent kingdom under the leadership of Mari, the kingdom fell to the Old Babylonian Empire when Hammurabi destroyed Mari.\nUnder Zimri-Lim of Mari (r. 1775–1761 BC), Hana was part of the Kingdom of Mari. In Year 33 of Hammurabi of Babylon (1760 BC BC) he attacked and destroyed Mari. In Year 35 (1758 BC) he returned to destroy the city walls.\nHana Early Kingdom\nFollowing the fall of Mari (c. 1760 BC), the Kingdom of Hana formed establishing its capital at Terqa. Terqa had formerly been a provincial center in the Mari Kingdom. It came to control much of the territory formerly held by Mari, in the Middle Euphrates and Lower Khabur.\n*Iapah-sūmû-abu | c. 1750s BC | may be mentioned as an \"Overseer of the Haneans\" in a tablet at Alalakh during the time of Abban-El I of Yamhad. Was also contemporary with Hammurabi of Babylon (r. 1792–1750 BC).\n*Isi-Sumuabi | c. 1735 BC |\n*Yadih-Abu | c. 1720s BC | Attested as defeated in Year 28 of Samsu-Iluna of Babylon.\nMore obscure kings of Hana\n*Kaštiliašu | His name is Kassite indicating he was not part of the royal succession, perhaps installed by Samsu-Iluna.\n*Šunuhrû-Ammu |\n*Ammī-madar |\nDuring the reign of the Babylonian king Abieshu (c. 1711–1684 BC) Babylonia lost its territories on the middle Euphrates where the kingdom of Hana was formed. No direct evidence is available on the relationship of the new state and its kings with the last Babylonian rulers from the First Dynasty.\nSack of Babylon. Mursili I of the Hittites marched from Hattusa through the Euphrates valley to the Sack of Babylon, in 1595&nbsp;BC (High Middle Chronology) or 1587&nbsp;BC (Low Middle Chronology). The event brought to an end the Old Babylonian period. It implies he had support from the Haneans. In an anecdote, the Kassite ruler Agum II of Babylon brought back from Hana the Statue of Marduk. The statue had been in Hana since Mursili I of the Hittites sacked Babylon.\nLate Bronze\nMitanni period\nHana Middle Kingdom\nThe kingdom was probably conquered around the middle of the 15th century BC by the Hurrian kingdom of Mitanni.\n*Iddin-Kakka\n*Išar-Lim\n*Iggid-Lim\n*Isih-Dagan\n*Ahuni\n*Hammurabi\n*Qiš-Addu | c. 1420 BC | was contemporary with the Mitannian kings Parattarna/Parittarna, Sausadatra, and Saitarna.\n*Pagiru\nThe Kassite domination\nThere is some evidence about a link between the kingdom of Hana and the Kassites who came to dominate Babylonia in the following centuries. From the preserved list of rulers of Khana the name of one king, Khashtiliash, notably suggests a Kassite origin. There is also a Kassite element in the name of a canal dug by one of the other rulers.\nOne dedicatory inscription preserved in later copies records the return of Marduk’s statue from Hana by Agum II (Agum-Kakrime), a later Kassite king, most probably the first to rule over most of Babylonia (c.&nbsp;1570&nbsp;BC). The part of the inscription that mentions Hana reads:\n: I sent to the distant land, to the land of the Haneans and they conducted Marduk and Sarpanitu back to me. I returned Marduk and Sarpanitu, the ones who love my reign, to the Esagil and Babylon. I returned them to the temple that Shamash had confirmed to me in my investigation.\nEven if the text does not convey clearly the relationship between the Kassite Agum II and \"the Haneans\" at that point, it nevertheless links Hana with the sack of Babylonia by the Hittite king Mursili I in c.&nbsp;1595&nbsp;BC and the subsequent takeover by the Kassite dynasty in Babylonia. It is possible that after the initial clashes with Babylon's Samsuiluna, the Kassites, originally coming from the Zagros Mountains, withdrew north occupying and imposing control over middle Euphrates including the lands of Khana. It is also reasonable to assume some sort of cooperation between the Hittite and Khana as the invading armies of Murshilish I must have passed through its territories. Such alliance may have facilitated the seizing of power in Babylon by the Kassites some years after the Hittite retreat.\nThis later Neo-Assyrian inscription copy, which purports to detail the return of cult statues of the city of Babylon, lost in the fall of that city, from Hana is generally considered to be a forgery.\nSee also\n*Chronology of the ancient Near East\n*Cities of the Ancient Near East\n*List of Mesopotamian dynasties\n*List of Mesopotamian deities\n*Qaṭṭunān\nReferences"
    }
  ]
}