{
  "content": [
    {
      "type": "text",
      "text": "# Kingmaker (video game)\n\n|designer = Graham Lilley\n|released = 1993: Amiga, Atari ST1994: MS-DOS\n|genre = Turn-based strategy\n|modes = Single player\n|platforms = Amiga, Atari ST, MS-DOS\n}}\nKingmaker (known as Kingmaker: The Quest for the Crown in Europe) is a turn-based strategy game published by Avalon Hill in 1993. It was developed by American studio TM Games based on the Kingmaker board game.\nGameplay\nKingmaker simulates Wars of the Roses. Kingmaker reproduces the look and play of the board game almost exactly, allowing the player to compete with up to five computer controlled factions.  The major change from the board game is the addition of a battle interface where the player can control his or her army in combat, but it is very simplistic and the option to resolve battles by the original method remains.\nReception\n}}\nIn Computer Gaming World in July 1994, Terry Lee Coleman rated the computer version of Kingmaker 3.5 stars out of five. While criticizing the lack of multiplayer in an adaptation of \"a classic multiplayer boardgame\" the reviewer said that it was \"strangely addictive, and a class act\". Approving of the \"clever and varied AI\", Coleman wrote, \"Challenging and fun, despite its lack of high-tech glitz or multiplayer options, Kingmaker establishes a fine beachhead for AH's return to the computer wargame market.\"\nJames V. Trunzo reviewed Kingmaker in White Wolf #48 (Oct., 1994), rating it a 5 out of 5 and stated that \"Avalon Hill gets good marks for creating a game that runs even on a 286 machine, but it gets a failing grade for its memory demands.\"\nThe editors of PC Gamer US nominated Kingmaker for their 1994 \"Best Historical Simulation\" award, although it lost to Lords of the Realm.\nBy August 1996, Kingmaker had sold over 40,000 copies. In his Computer Gaming World column, Coleman summarized these figures as \"decent for a computer wargame\". However, he noted that it had outsold every Avalon Hill computer game released since, and that Avalon Hill's brand reboot on computers had not gone as hoped.\nReferences\nExternal links\n*[https://archive.org/details/pcgamesmagazine-1994-02/page/n25/mode/2up PC Gamer review] (German)"
    }
  ]
}