{
  "content": [
    {
      "type": "text",
      "text": "# King Lud\n\n| father       = Heli\n| mother       = Anna\n}}\nLud (), according to Geoffrey of Monmouth's pseudohistorical History of the Kings of Britain and related medieval texts, was a king of Britain in pre-Roman times who founded London and was buried at Ludgate. He was the eldest son of Geoffrey's King Heli, and succeeded his father to the throne. He was succeeded, in turn, by his brother Cassibelanus (). Lud may be connected with the Welsh mythological figure Lludd Llaw Eraint, earlier Nudd Llaw Eraint, cognate with the Irish Nuada Airgetlám, a king of the Tuatha Dé Danann, and the Brittonic god Nodens. However, he was a separate figure in Welsh tradition and is usually treated as such.\nIn literature\nLud's reign is notable for the building of cities and the refortification of Trinovantum (London), which he especially loved. Geoffrey explained the name \"London\" as deriving from \"Caer Lud\", or Lud's Fortress. When he died, he was buried at Ludgate. His two sons, Androgeus and Tenvantius, were not yet of age, so he was succeeded by his brother Cassibelanus.\nIn the Welsh versions of Geoffrey's Historia, usually called Brut y Brenhinedd, he is called Lludd fab Beli, establishing the connection to the early mythological Lludd Llaw Eraint. An independent Welsh tale, Cyfranc Lludd a Llefelys (The Tale of Lludd and Llefelys), is appended into some versions of the Brut. It also survives independently, and in this form was included in the collection known as the Mabinogion. According to this tale, Lludd had an additional brother named Llefelys, who became king of France while Lludd ruled in Britain. During Lludd's reign, three great plagues befell Britain, but he was able to overcome them with the advice of his brother.\nKing Lud in the City of London\nLud's name was claimed by Geoffrey of Monmouth to be the origin of Ludgate (named Porth Llydd in the Brut y Brenhinedd), a major gateway into the City of London, as well as of the name of London itself. (The true etymology of Ludgate is from the Old English term \"hlid-geat\", a common Old English compound meaning \"postern\" or \"swing gate\".)\n16th-century statues of King Lud and his two sons, which formerly stood on the gate, now stand in the vestry porch of St Dunstan-in-the-West on Fleet Street, in a state of disrepair. There was a pub at Ludgate Circus called \"King Lud\", now an outlet of the chain restaurant Leon, and medallions of King Lud may be seen up on its roofline and over the doors.\nReferences\nExternal links\n*"
    }
  ]
}