{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom Pro Wrestling\n\nKingdom Pro Wrestling (KPW) is a Bahraini professional wrestling promotion founded on 23 August 2022.\nTraining school\nKingdom Pro Wrestling hosts a professional wrestling school in Manama, Bahrain. It was founded in January 2019. Kingdom Pro Wrestling training school is an official facility that belongs to Kingdom Pro Wrestling promotion, which makes it the first wrestling promotion in the Middle East to have its own developmental school in which all the KPW roster were trained in it. The school currently has signed U.S veteran wrestler Glen Holbrook from The State of Georgia as Head Trainer. During his training career, Glen Holbrook has trained wrestlers like The Enfoncer, Chris Cruz, Kochi Takakura and Steve Lawler who trained Disco Inferno.\nHistory\nBackground and formation (2018–2020)\nOn December, 2018, several social media users in Bahrain indicated the launch of Kingdom Pro Wrestling. However, KPW's first show was in February 2020 at ELMercado Arena.\nCOVID-19 pandemic (2020–2021)\nAs other sports cancellations and postponements were being announced by KPW in March 2020, KPW had canceled all events due to the pandemic and then announced the return of shows to fans on February 2022.\nThe Official start and the return to touring (2022–NOW)\n| caption_align = center\n| footer = As part of the company's new vision, new branding has been announced\n| footer_align = centre\n| alt1 =\n}}\nOn Feb 2022, KPW announced that they would be returning with Four events in one year in Three different towns. beginning with a special event on on Feb 11, 2022 in Janabiya, Bahrain which has been called KPW Redemption in which Eight Man Tag Team Elimination Match took place, in turn becoming the first and only major professional wrestling promotion locally.\nKPW then announced their new partnership with LuLu Group International to sponsor their events in Bahrain. Next event KPW Brawl In The Mall would be KPW's Manama debut, a town primarily known as the capital of Bahrain. Bahrain's populary hip-hop artist Flipperachi made an appearance to perform live rap music, as well as their other Two events held in after that. first one was KPW SuperClash on May, 20th 2022 in which KPW Championship belt has been revealed and KPW Ramli Mall on Nov, 11th 2022 in Which Mixed Martial Artist [https://www.tapology.com/fightcenter/fighters/38023-hamza-kooheji Hamza Kooheji] interfered during the main event to help The Great Zubari as he was beaten by Rudy Ruyal and the lumberjacks. Both events got a lot of buzz and took place in Lulu Group locations which at that time considered by the public as Bahrain's own wrestling locations.\nOn 2023 KPW held their most attended event at that time, with over 2500 spectators in Hidd, Bahrain in which Razor Jaw Shareef became the KPW Champion after beating The Great Zubari in the tournament final. The event featured most of roster including Ahmed Dragon, Ali Ninja, Alkaboos, Ismael The Living Dead, Jabbar, Khalid Kombat, Madrex, Mass Kid Man, Qassimovic, Razor Jaw Shareef, The Great Zubari and Yaqoob.\nOn 2024 KPW Held Three Events, KPW WinterSlam in which Razor Jaw Shareef retained the KPW championship in a Triple Threat Match against Jabbar and The Great Zubari.  And then the first sold out event KPW BattleZone and KPW Comiccon. At KPW Comiccon, Ex-WWE Wrestlers Mansoor and Mason Madden MXM made an appearance in which they teamed up with Razor Jaw Shareef and wrestled in a Six men tag team match against Madrex, Tigre and The Great Zubari after they beat Bahraini famous comedian actor Hasan Makki.\nIn February 2025, KPW held KPW Comfest at Bahrain International Circuit where Aldababa made his KPW Debut. followed by another event on Feb 28, 2025 at Galleria Mall Arena.\nIn May and June 2025, KPW held Four sold out shows in Al-Riffa SC. The Shows made a lot of Buzz among Bahraini people and some wrestling fans in the GCC. KPW Texas Championship title has been revealed.\nEvents\n{| class=\"sortable wikitable succession-box\" style=\"font-size:85%;\"\n|-\n! scope=\"col\" style=\"width:150px;\"| Event\n! scope=\"col\" style=\"width:10px;\"| Date\n! scope=\"col\" style=\"width:150px;\"| Venue\n! scope=\"col\" style=\"width:100px;\"| Location\n! scope=\"col\" style=\"width:490px;\"| Main event\n|-\n|KPW Mercado\n|\n|El Mercado Mall Arena\n|Janabiya\n|Jabbar vs. Rudy Ruyal\n|-\n|KPW Redemption\n|\n|El Mercado Mall Arena\n|Janabiya\n|Eight Man Tag Team Elimination Match\n|-\n|KPW Brawl In The Mall\n|\n|Dana Mall Arena\n|Manama\n|The Great Zubari vs. Razor Jaw Shareef\n|-\n|KPW SuperClash\n|\n|Dana Mall Arena\n|Manama\n|Hamad The Lion vs. VCT in a Chain Match\n|-\n|KPW Ramli Battle\n|\n|Ramli Mall Arena\n|A,ali\n|The Great Zubari vs. Rudy Ruyal in a No Escape Match\n|-\n|KPW Road To The Gold\n|\n|LuluHyper Market Arena\n|Hidd\n|Razor Jaw Shareef vs. The Great Zubari for the KPW Championship title.\n|-\n|KPW WinterSlam\n|\n|Galleria Mall Arena\n|Zinj\n|Razor Jaw Shareef (c) vs. Jabbar vs. The Great Zubari is a Triple Threat Match.\n|-\n|KPW BattleZone\n|\n|Galleria Mall Arena\n|Zinj\n|Khalid Kombat vs. MKM The NightWolf in a Mask On A Pole Match\n|-\n|KPW Comiccon 1\n|\n|Bahrain International Circuit\n|Zallaq\n|The Great Zubari & Madrex & Tigre w/ Hasan Maki vs. Mansoor & Masson Madden & Razor Jaw Shareef w/ Glen Holbrook in a 6 Men Tag Team Match\n|-\n|KPW Comfest\n|\n|Bahrain International Circuit\n|Zallaq\n|Razor Jaw Shareef (c) vs. MKM The NightWolf for the KPW Championship tile.\n|-\n|KPW WinterClash\n|\n|Galleria Mall Arena\n|Zinj\n|Razor Jaw Shareef (c) vs. MKM The NightWolf for the KPW Championship tile.\n|-\n|KPW ComicCon 2\n|\n|Bahrain International Circuit\n|Zallaq\n|Razor Jaw Shareef (c) vs. MKM The NightWolf vs. Ismaeel The Living Dead vs. Qassimovic for the KPW Texas Championship tile.\n|-\n|KPW Underground 1\n|\n|Riffa Sport Club\n|Riffa\n|Razor Jaw Shareef (c) vs. Hasan Maki for the KPW Championship Title.\n|-\n|KPW Underground 2\n|\n|Riffa Sport Club\n|Riffa\n|Razor Jaw Shareef (c) vs. Aldababa for the KPW Texas Championship tile.\n|-\n|KPW Underground 3\n|\n|Riffa Sport Club\n|Riffa\n|Razor Jaw Shareef (c) vs. Aldababa for the KPW Texas Championship tile.\n|-\n|KPW Underground 4\n|\n|Riffa Sport Club\n|Riffa\n|Razor Jaw Shareef (c) vs. Aldababa (c) in a Title vs. Title Match for the KPW Texas Championship tile & The KPW Championship Title.\n|-\n|KPW Underground 5\n|\n|Riffa Sport Club\n|Riffa\n|Aldababa won KPW championship title and KPW Texas championship title.\n|}\nRoster\nWrestlers\n* Razor Jaw Shareef – Current KPW champion and KPW Texas champion\n* Ahmed Dragon\n* Aldababa\n* Hamad The Lion\n* Ismaeel The Living Dead\n* Jabbar\n* Khalid Kombat\n* Khalil Kombat\n* Madrex\n* MKM The Night Wolf\n* Nerd #1\n* Nerd #2\n* Qassimovic\n* Rudy Ruyal\n* Shankool\n* The Great Zubari\n* Tigre\n* VCT\n* Yaqoob\n* Zameel Bhia\nManagers\n* Glen Holbrook\n* Mr. Khorshid\n* Mr. Mohamed Hamada\nVisiting International Wrestlers\n* Mansoor *appeared in 2024\n* Masson Madden *appeared in 2024\nChampions\nKPW Championship Title\nThe KPW Championship  is the main championship in the Kingdom Pro Wrestling promotion. The current champion is Razor Jaw Shareef, who is in his first reign.\nReigns\n|reign    = 1\n|date     =\n|days     =\n|location = Hidd, Bahrain\n|event    = Road To The Gold\n|notes    = The Great Zubari defeated Madrex in the tournament final to become the first ever KPW champion in history but lost it after 4 minutes.\n|ref      =\n}}\n|reign    = 1\n|date     =\n|days     =\n|location = Hidd, Bahrainl\n|event    = Road To The Gold\n|notes    = Razor Jaw Shareef asked for his title shot and won the KPW championship by pinning The Great Zubari.\n|ref      =\n}}\n|reign    = 1\n|date     =\n|days     = +\n|location = Hidd, Bahrainl\n|event    = KPW Underground 5\n|notes    = Aldababa wins the KPW championship title to end Razor Jaw Shareef's 723 days title reign.\n|ref      =\n}}\nKPW Texas Championship Title\nThe KPW Texas Championship is a championship introduced by KPW Head Trainer Glen Holbrook. The current champion is Razor Jaw Shareef, who is in his Second reign.\nReigns\n|reign    = 1\n|date     =\n|days     =\n|location = Zallaq, Bahrain\n|event    = ComicCon 2\n|notes    = Razor Jaw Shareef won a four-man Gauntlet Match to become the first ever KPW Texas champion in history.\n|ref      =\n}}\n|reign    = 1\n|date     =\n|days     =\n|location = Riffa, Bahrain\n|event    = Underground 3\n|notes    = Aldababa won the championship by pinfall.\n|ref      =\n}}\n|reign    = 2\n|date     =\n|days     =\n|location = Riffa, Bahrain\n|event    = Underground 4\n|notes    = Razor Jaw Shareef won the title for the 2nd time in a Ladder Match.\n|ref      =\n}}\n|reign    = 2\n|date     =\n|days     = +\n|location = Riffa, Bahrain\n|event    = Underground 5\n|notes    = Aldababa won The 7 Men Battle Royal Match to win the title.\n|ref      =\n}}\nReferences"
    }
  ]
}