{
  "content": [
    {
      "type": "text",
      "text": "# King's Trust__disambig_1\n\n| type                     = Charity\n| purpose                  = The development and improvement of young people\n| location                 = The King's Trust8 Glade PathLondon, England\n| region_served            = United Kingdom and the CommonwealthUnited StatesEgypt\n| founder                  = Charles III\n| num_staff                = 1,241 (2019)\n| num_volunteers           = 9,000\n| website                  =\n| leader_title             = President\n| leader_name              = Charles III\n| leader_title2            = UK Chief Executive\n| leader_name2             = Jonathan Townsend\n| subsidiaries             =\n| formerly                 = Prince's Trust\n}}\nThe '''King's Trust (formerly the Prince's Trust''') is a United Kingdom-based charity founded in 1976 by King Charles III (then Prince of Wales) to help vulnerable young people get their lives on track. It supports 11-to-30-year-olds who are unemployed or struggling at school and at risk of exclusion. Many of the young people helped by the trust face issues such as homelessness, disability, mental health problems, or trouble with the law.\nIt runs a range of training programmes, providing practical and financial support to build young people's confidence and motivation.\nIn 1999, the numerous trust charities were brought together as the Prince's Trust and acknowledged by Queen Elizabeth II at a ceremony in Buckingham Palace where she granted it a royal charter. The following year it devolved in Wales, Scotland, Northern Ireland, and other English regions but overall control remained in London. The King's Trust fundraising and campaign events are often hosted by and feature entertainers from around the world.\nThe King's Trust is one of the most successful funding organisations in the UK and is the UK's leading youth charity, having helped over 1,000,000 young people turn their lives around, created 125,000 entrepreneurs, and given business support to 395,000 people in the UK. From 2006 to 2016, its work for the youth has been worth an estimated £1.4&nbsp;billion.\nIn 2019, the then Prince's Trust signed a partnership with the Department of Health and Social Care to support 10,000 young people (16-to-30-year-olds) into health and social care jobs. This initiative aims to future-proof the sector, provide employment opportunities to young people, and support the department's \"widening participation\" goals, increasing the diversity of its workforce.  Following the death of Queen Elizabeth and the ascension of Charles to the throne, the Prince's Trust was renamed the King's Trust.\nGovernance\n, then the Prince of Wales]]\nCharles III founded the then Prince's Trust and is now its president, a figurehead position with no legal responsibility. The King's Trust Council are the trustees of the charity and are legally responsible for management, administration and deciding policy.\nTom Ilube became Chair of The King’s Trust Council in July 2024, taking over from John Booth who was the chairman of the then Prince’s Trust Council from July 2018 to 2024. Sir Lloyd Dorfman CBE, previously held this position, before becoming the chairman of Prince's Trust International.\nNick Stace, the former chief executive of the Trust, joined in October 2017, replacing Dame Martina Milburn DCVO CBE who was a member of the board and group chief executive for the Prince's Trust. At the end of 2019, Jonathan Townsend took over as interim CEO – a position made permanent in spring 2020.\nOn 10 November 2023 it was announced the Prince's Trust, and all Prince's Trust charities globally, intend to become the King's Trust. The change enables the group of charities to retain proximity to their founder, the King, and reflects his passion for the charity's mission to help young people into work, education and training.\nStaff\nIn 2019 the then Prince's Trust employed 1241 people, including 1106 people who worked in charitable purposes and support, and 235 in fundraising. The cost of employing these staff is £38&nbsp;million a year and is the organisation's single biggest expenditure.\nMartina Milburn, former chief executive of the Prince's Trust Group (covering the UK, Australia, Canada, New Zealand, United States and International), who joined the Trust in 2004 and was appointed group chief executive in 2017, stepped down from this role in September 2022. Previously she worked as the chief executive of BBC Children in Need.\nJonathan Townsend was formally appointed chief executive officer of Prince's Trust UK in April 2020, following an interim period. He was previously the CEO of Prince's Trust International.\nWill Straw was appointed chief executive officer of Prince's Trust International in summer 2020.\nAmbassadors\nThe King's Trust consist of different kinds of Ambassadors:\nThe first are young ambassadors, these are young leaders who are volunteers and support the King's Trust in different ways including motivating other young people and winning contributors and the media about the work the King's Trust do.\nThe second are job ambassadors. This group has taken part in a King's Trust programme and have graduated from being a Young Ambassador. They are then employed by the King's Trust and work to inspire, motivate and assist the young people in fulfilling the programmes they enrol in.\nLastly, there are celebrity ambassadors who help raise awareness of the work that is done by the King's Trust in young people's lives. Celebrity ambassadors also involve themselves by visiting the young people during courses and programmes, host and help fundraising events and additionally start and support campaigns for the King's Trust. Current Celebrity Ambassadors include: Phil Collins, Gary Lineker, Jeremy Irons, Tom Hardy, Geri Halliwell, Benedict Cumberbatch, Justin Packshaw, Idris Elba, Gemma Arterton and Sharon Osbourne.\nIn 2017, the then Prince's Trust recruited Tom Fletcher and Giovanna Fletcher as the charity's first Digital Celebrity Ambassadors, following the great support they had given following their attendance at our Celebrate Success Awards.\nIn May 2023, Phillip Schofield was removed as an ambassador as the charity said it was \"no longer appropriate\" for it to work with the former television presenter due to his affair with a younger employee.\nSubsidiaries\nThe trust has five charitable subsidiaries, each of which has its own board of trustees: King's Trust International, King's Trust Australia, King's Trust Canada, King's Trust New Zealand, and King's Trust America.\nIn 2019, the then Prince's Trust International also operated in Barbados, Greece, India, Jamaica, Jordan, Malta and Pakistan.\nThe trust also has one non-charitable subsidiary, King's Trust Trading Limited, which is responsible for the trust's commercial activities.\nThe King's Trust Group\nThe King's Trust Group's mission is to transform lives and build sustainable communities across the world. Together, the group of the then Prince's Trust charities supported around 90,000 people during 2019–20.\nEstablished in 2018, the King's Trust Group includes the work of the King's Trust in the UK alongside a group of charities including: King's Trust International, King's Trust Australia, King's Trust New Zealand, King's Trust Canada and most recently King's Trust USA. Through the King's Trust Group young people are supported to access education, employment and self-employment in Australia, Barbados, Canada, Greece, India, Jordan, Malta, New Zealand and Pakistan. During 2019–20, the then Prince's Trust Group started supporting young people in Ghana, Kenya, Rwanda, Trinidad and Tobago, Jamaica, and Malaysia. Similar projects were later launched in Uganda, Tanzania, and Nigeria.\nThe Aga Khan is the global founding patron of the King's Trust Group. American singer and songwriter, Lionel Richie, is the founding global ambassador of the Global Ambassador Group.\nFinances\nIn 2009–10 the then Prince's Trust charity, and its trading subsidiary, Prince's Trust Trading Ltd, had a total income of nearly £36&nbsp;million, and expenditure of £38&nbsp;million. Facing the impact of the economic climate and a decline in funding it drew on its reserves, which stand at £22&nbsp;million, representing roughly six months operating costs. The King's Trust is one of the 100 largest charities in the UK ranked by expenditure.\nIncome\nBetween 2006 and 2016, its work is reported to be worth an estimated £1.4 billion.\nGenerating income\nIncome from charitable activities\nIt is unclear how much money in total came from the European Union (EU), as although some money (£4 million) is declared as coming directly, other money can be channelled indirectly through other organisations. Previously much of the EU money for the then Prince's Trust came from the European Social Fund (ESF) and could only be spent to help young people who are Not in Education, Employment or Training (NEET). Some of the ESF money went directly to the Prince's Trust (£816,000 2006/7), but mostly it went to the Learning and Skills Council (LSC) who \"doubled it up\" with government money that then had the same restrictions placed on it. Some LSC money was given directly to the Prince's Trust (£1.3&nbsp;million 2006/7) but the majority went to the regional LSC offices who took out contracts with the regional Prince's Trust offices to provide services for unemployed young people. The ESF money was channelled through so many routes it is difficult to determine how much it amounted to, but in 2006 the funding provided by the LSC to the Prince's Trust in total came to approximately £11&nbsp;million, although clearly these figures have decreased somewhat in recent years.\nFundraising events\nThe trust still has some fundraising events, including a Rock Gala that aired on 25 December 2010 on DirecTV. In 2012, the Prince's Trust was one of the main beneficiaries of Bob Finch and Michael Holland's Oil Aid.\nExpenditure\nThe Prince's Trust expenditure of £38.2&nbsp;million was made up of £30&nbsp;million spent on charitable activities with the rest being spent on administration and other costs. The £30&nbsp;million spent on charitable activities was divided between the different programme areas such as the Team programme and the Enterprise programme. £1.2&nbsp;million went on grants to young people and institutions.\nCharitable activities\nThe King's Trust has seven main types of charitable activity.\n* The Enterprise programme helps young people start a business.\n* The Team Programme is a 12-week personal development course, offering work experience, practical skills, community projects and a residential week.\n* Get antos are short courses offering training and experience in a specific sector to help young people get a job.\n* Get Starteds are short courses that give people the chance to take part in a week of activities to grow their confidence and skills.\n* Fairbridge offers a mix of group activities and one-to-one support for young people.\n* Development Awards are small monetary grants given to young people to help them get some training, education or a job.\n* Achieve clubs are held in schools, or through the Trust's centres for those outside of education.\n* Mosaic runs programmes in primary and secondary schools to link young people with role models to boost their confidence.\nEnterprise programme\nThe Enterprise programme is the offer for which the King's Trust is best known for. Helping young people to become their own boss by starting a business, 18 to 30-year-olds are given practical, mentoring and financial support of up to £5,000.\nTeam programme\nTeam is a 12-week personal development programme which gives young people that are NEET (not in education, employment or training) and aged 16–25 the chance to gain new skills, complete a qualification and meet new people through team-building activities, a residential trip, community project and work placement. The course is usually run by a local organisation known as the delivery partner.\n205,063 young people have participated in the 12-week Team programme since its launch in 1990.\nThe people going on Team are usually unemployed, and if they are receiving Jobseekers' Allowance and other benefits they are still able to receive these whilst on the course. People going on the course also get their travel expenses and other costs paid. Some people in employment also go on part of a course but their employer has to pay a course fee of £1,250 to the King's Trust. The King's Trust employs fundraisers with \"proven sales experience\" to persuade employers to pay for their employees to go on the King's Trust Team Course. In 2006/7 the then Prince's Trust received nearly £687,000 from employer's fees for Team courses.\nAs part of the programme participants go on a trip to an outbound activity centre where they focus on communication, teamwork and confidence building. Later in the programme they work on their Maths and English skills, and give back to their local community by volunteering, raising awareness and fundraising for causes that matter to them. Participants also complete a two-week work experience placement.\nGet into\nGet intos are short courses that give young people experience and training in a specific sector, to allow them to gain employability skills to move into work. Focus industries include retail, rail, construction, logistics and hospitality.\nIn 2017, the then Prince's Trust launched Employability Online, to enable 18 to 30-year-olds to gain skills to secure work.\nGet Started\nGet Starteds are short courses that give young people the chance to take part in a week of activities that allow them to develop skills with help from industry experts. Working with partners including the Premier League, ASOS and Sony, they work towards a group challenge while developing skills and confidence.\nFairbridge\nThe Fairbridge programme offered group activities and one-to-one support for young people to develop skills and confidence. It started with a five-day Access course delivered from one of The Trust's 10 centres across the UK, and included a residential trip.\nOnce the Access course was complete, young people could choose from a range of activities, from sports to drama and photography to cooking, to help them reach their goals.\nIn 2016, L'Oréal Paris partnered with the then Prince's Trust to develop a confidence training course for the Fairbridge programme, covering relationships, body language and employability.\nAs the Prince's Trust took over Fairbridge in 2012, it became liable for claims brought forward by individuals who were sent by the programme's previous iteration between 1909 and 1980 to \"farm schools\" in Australia and Canada for \"opportunity and education\" and then suffered cruelty, mistreatment and sexual abuse. In November, the High Court of Justice determined that each claimant could be entitled to £204,000, but the Prince's Trust announced in 2023 that it would pay the 328 survivors £1,000-£2,000 each because it had set aside \"insufficient moneys\" for the claims. The sum set aside has not been announced, but is thought to be £1.275 million. The incident resulted in the Old Fairbridgians Association, which represents the survivors, writing to the King and asking him to intervene. The trust had formally apologised to the survivors in 2018 and set up a mechanism to manage compensation in 2020.\nAchieve programme\nThe King's Trust education programme, Achieve (formerly known as xl clubs) provides young people at risk of underachieving and exclusion the chance to try new activities to boost their confidence, while gaining a recognised qualification.\nDelivered in schools, youth centres, pupil referral units, youth offender institutions and King's Trust centres, the course allows young people to explore personal and social development; life skills; active citizenship; enterprise; and skills to prepare them for work.\nIn 2006/7 the then Prince's Trust spent £4&nbsp;million on the xl programme and of this £298,000 consisted of grants to clubs, £1.26&nbsp;million was spent on Prince's Trust staff costs and £2.3&nbsp;million on other direct costs and support costs.\nDevelopment Awards\nThe King's Trust Development Awards remove young people's financial barriers to enable them to take the next step into work, education or training. Covering course fees, transport or equipment, eligible young people can receive up to £500.\nMosaic Mentoring\nMosaic moved into the Prince's Trust in April 2016. Its programmes – which run in primary and secondary schools and prisons and include an Enterprise challenge competition – aim to bridge the aspirations-attainment gap by linking young people with inspirational role models and helping boost their confidence, self-efficacy and long-term employability.\nFuture Leaders\nThe Future Leaders programme gives young people the foundations of leadership and teamwork. The programme was launched by  Prince's Trust Goodwill Ambassador Gareth Southgate in May 2019.\nGet Hired\nGet Hired is a monthly recruitment event run by the Trust. At each event, up to 20 employers with live entry-level vacancies do ten-minute interviews with candidates.\nThe Jason Kanabus Fund\nThe Jason Kanabus Fund was created from the £2.5&nbsp;million left to the Prince's Trust by Jason Kanabus, a young farmer in Sussex who died from cancer in July 2006. He left his money to the Prince's Trust, with the request that the income was used to help young people become established in farming.\nAwards\nat the Prince's Trust Awards]]\nThe King's Trust celebrates the achievements of young people each year through its King's Trust Awards (formerly known as Celebrate Success Awards).\nThroughout the autumn the Trust holds 11 Oscar-style regional award ceremonies across the country before hosting a national final in London where the red carpet is rolled out.\nHosted by Ant and Dec and attended by a range of celebrity ambassadors, including Thierry Henry, Gemma Arterton and Emilia Fox, it recognises the Young Achiever of the Year, Young Ambassador of the Year and many more. And since 2022, it airs on ITV\nTimeline\n{| class=\"wikitable\"\n|-\n! style=\"text-align:left\" | Year\n! style=\"text-align:left\" | Event\n|-\n|1976||The Prince of Wales launches the charity.\n|-\n|1982||The charity's first ever fund-raising concert was held on 14 May at the NEC Arena in Birmingham and was headlined by Status Quo.\n|-\n|1986||The Prince's Trust All-Star Rock Concert is held at Wembley Arena to celebrate the first 10 years of the Trust.\n|-\n|1988||An appeal costing £40&nbsp;million is launched for the Prince's 40th birthday year. Singer Michael Jackson donates $450,000 from his concert tour to The Trust, designated for the Great Ormond Street Children's Hospital, described as \"a favorite charity of Jackson's\".\n|-\n|1990||The Prince's Trust Volunteers programme is launched.\n|-\n|1996||First rock concert in Hyde Park.\n|-\n|1997||The Prince's Trust celebrates its 21st birthday with a special variety show at the Manchester Opera House. Hosted by David Frost and Joanna Lumley, the show featured, amongst others, the Spice Girls and the Manchester United side, led by their manager, Alex Ferguson.\n|-\n|1999||Trust charities are brought together as the Prince's Trust. This is recognised by the Queen at a ceremony in Buckingham Palace, when she granted it a Royal Charter.\n|-\n|2000||The Trust is devolved. Wales, Scotland, Northern Ireland and each of the English regions now has its own Director and Council but overall control remains in London.\n|-\n|2002|| BBC News and general media outlets report on Dee Narga's high-profile tribunal claim. The former Asian, Prince's Trust, divisional director claimed she suffered sexual discrimination and unfair constructive dismissal.\n|-\n|2003||The Prince's Trust loses appeal in high-profile tribunal case, former, black Manchester City football star Darren Beckford, suffered racial discrimination and victimisation by a director and assistant director at the Trust. He was brought in to lead a project in Manchester for black and Asian young people under the title \"Don't Let Us be a Minority\".\n|-\n|2003||The 10,000th Development Award.\n|-\n|2003||Volunteers programme renamed Team programme.\n|-\n|2003||Prince's Trust Council restrict help to four \"core groups\" of young people.\n|-\n|2004\n|Prince's Trust Launch the 'Urban Music Festival' featuring the likes of Jay Z, Beyonce and a young and up and coming Dizzee Rascal. Animation series 'The Booo Krooo' were used as part of the marketing campaign.\n|-\n|2004\n|Prince's Trust charity concert at the Wembley Arena celebrating Trevor Horn's 25 years as a record producer featuring the likes of The Buggles, Grace Jones, ABC, Yes, Pet Shop Boys, Seal, Frankie Goes to Hollywood among other guests.\n|-\n|2006||The Prince's Trust turns 30 with a Birthday concert at the Tower of London presented by Cat Deeley, an ITV1 documentary, The Prince of Wales: Up Close, a live televised event on ITV1 presented by Vernon Kay, Kate Thornton, Patrick Kielty and Ben Elton and TV presenting duo Ant & Dec conducting the first interview with all three princes, Prince Charles, Prince William and Prince Harry.\n|-\n|2007||The Prince's Trust launches leadership groups to better engage with business.  Examples include the Technology Leadership Group and Insurance Leadership Group supported by Steve Verrall, Neil Atkins and Mike Dodd from Sirius Financial Solutions plc\n|-\n|2008||Controversy over the legacy of Jason Kanabus of the Sainsbury family.\n|-\n|2008||25th anniversary of the Enterprise Programme.\n|-\n|2009||The Prince's Trust is criticized for making a donation of £10,050 to the Conservative Party via Women2Win. The Charity Commission investigates whether the Prince's Trust has broken charity law.\n|-\n|2009||Controversy over Jason Kanabus Fund & spending of donation.\n|-\n|2010||The Rock concert made a return to the Royal Albert Hall with a sell-out performance and 3D coverage on television.\n|-\n|2011||The Trust merged with another youth charity, Fairbridge.\n|-\n|2012||Singer Will.i.am donated £500,000 to The Trust, to fund education, training and enterprise schemes with a focus on technology and computer skills.\n|-\n|2013||Charles III opened the new Prince's Trust Cardiff Centre.\n|-\n|2014|| Singer Beyoncé's global campaign #BeyGOOD raised more than £85,000 for the Prince's Trust to help change the lives of disadvantaged young people in the UK.\n|-\n|2016||The Prince's Trust celebrates its 40th anniversary, airing a documentary titled ''When Ant and Dec Met The Prince: 40 Years of the Prince's Trust''  on ITV, presented by Ant and Dec, interviewing the Prince, his wife the Duchess of Cornwall and his sons.\n|-\n|2017\n|The Prince's Trust launches its online learning platform to help young people to become their own boss or gain skills to help them secure work with Prince's Trust online\n|-\n|2018\n|[https://www.itv.com/presscentre/ep1week46/we-are-most-amused-and-amazed We Are Most Amused and Amazed] event broadcast on ITV to celebrate HRH's 70th Birthday and support The Trust\n|-\n|2023\n|On 10 November 2023, it was announced The Prince's Trust, and all Prince's Trust charities globally, intend to become The King's Trust.}}\nSee also\n* The Prince's Charities\n* Party in the Park\nReferences\nExternal links\n* [https://www.kingstrust.org.uk/ Official website of the King's Trust]\n* [https://youtube.com/@kingstrust King's Trust YouTube channel]\n*"
    }
  ]
}