{
  "content": [
    {
      "type": "text",
      "text": "# King Fire\n\n&nbsp;million in )}}\n| reference           =\n| date                =  – ||( days)}}\n| location            =\n| coordinates         =\n| pushpin_map         = USA California\n| pushpin_map_caption =Location of fire in Northern California\n| area                =\n| buildings           =\n| cause               = Arson\n| landuse             =\n| injuries            = 12\n| fatalities          = 0\n| perps               =\n| motive              =\n|image_map=2014 King Fire map 1.png|image_map_caption=The footprint of the King Fire, west of Lake Tahoe and north of U.S. Route 50|evacuated=2,830|alt=A night-time scene shows a firefighter is silhouetted bottom right against a stand of dark conifer trees, one of them completely ablaze}}\nThe 2014 King Fire was a large wildfire in El Dorado County, California, which burned  primarily in the Eldorado National Forest. The wildfire started on September 13, 2014, near Pollock Pines, California, to the east of Sacramento. The ensuing fire suppression effort, which cost more than $100 million and engaged more than 8,000 personnel at its peak, allowed for the full containment of the King Fire by October 9, 2014. Despite the size and ferocity of the fire, it caused no deaths. Eighty structures were destroyed, the majority of them outbuildings. The King Fire was determined to have been caused by an act of arson and a suspect was swiftly apprehended and convicted in 2016.\nBackground\nMuch of the Eldorado National Forest where the King Fire burned had no recent fire history. The last major wildfire there had been the Cleveland Fire in 1992, which burned roughly .\nProgression\nThe King Fire began on Saturday, September 13, 2014. It was ignited by an act of arson along King of the Mountain Road—from which the fire got its name—in Pollock Pines, a small community along U.S. Route 50 in the western Sierra Nevada between Sacramento and Lake Tahoe.\nOn September 16, three days after starting, the fire had spread to , forcing the evacuation of over five hundred homes. A handcrew of ten inmates and a fire captain were saved from being overrun when they were led to safety by a helicopter that was staged at the nearby Swansboro Country Airport.\nOn September 17, the fire underwent a rapid expansion, pushing forward  and burning an additional . Firebrands and embers created spot fires more than  downwind of the main fire. California governor Jerry Brown declared a state of emergency in El Dorado County, citing the fire's threat to water and power infrastructure.\nBy September 18, the fire had expanded to , becoming the second largest wildfire of the 2014 California wildfire season.\nBy the start of October the fire had grown to  with containment increasing to 94%. On October 9, the perimeter of the King Fire was reported to be 100% contained, with a final acreage of . The U.S. Forest Service calculated the total cost of fighting the King Fire at approximately $117 million.\nCause\nThe firefighters first on scene detected multiple points of origin for the King Fire, leading the El Dorado County District Attorney’s Office to swiftly conclude that arson had been the cause. Within days, witnesses came forward and disclosed that they had encountered Wayne Huntsman, a Pollock Pines resident and former inmate firefighter, near the scene of the fire's origin. Huntsman had told two of them \"You better get home. Your house is going to burn down.\" After being given a ride near the fire, Huntsman had shown another man a 'selfie' video of himself in the forest, surrounded by flames. The man recorded Huntsman's video and submitted the information to authorities.\nOn September&nbsp;18, 2014, Wayne Huntsman was arrested on suspicion of intentionally starting the fire. He initially pled not guilty to the charges, but in April 2016 pled guilty to arson. He was sentenced to 20 years in prison, the maximum allowable sentence, and ordered to pay $60&nbsp;million in restitution by an El Dorado County Superior Court judge.\nEffects\nThe King Fire injured a total of twelve people.  It destroyed 12 residences and 68 other structures.\nClosures and evacuations\nThe King Fire threatened hydroelectric infrastructure and recreation areas throughout the Sierra Nevada west of Tahoe. The U.S. Forest Service closed trails to the Desolation Wilderness from the Eldorado National Forest on September 11. The total number of evacuees reached 2,830.\nEnvironmental impacts\nThe King Fire produced copious amounts of smoke, pushing parts of Placer, El Dorado, Nevada, and Amador counties into unhealthy-to-hazardous ranges of PM2.5 air pollution. Officials temporarily deployed emergency air-quality sensors throughout the Sierra.\nGrowth and containment\n{| class=\"wikitable\" style=\"text-align: right;\"\n|+Fire containment status\nGray: contained; Red: active; %: percent contained;\n!Date\n!Area burned in acres (ha)\n!Personnel\n!Containment\n|-\n| style=\"text-align: left;\" |Sep&nbsp;13\n|...\n|...\n| style=\"text-align: left;\" |...\n|-\n| style=\"text-align: left;\" |Sep&nbsp;14\n|\n|806 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;15\n|\n|1,477 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;16\n|\n|2,466 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;17\n|\n|3,367 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;18\n|\n|3,842 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;19\n|\n|4,936 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;20\n|\n|4,901 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;21\n|\n|5,557 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;22\n|...\n|...\n| style=\"text-align: left;\" |...\n|-\n| style=\"text-align: left;\" |Sep&nbsp;23\n|...\n|...\n| style=\"text-align: left;\" |...\n|-\n| style=\"text-align: left;\" |Sep&nbsp;24\n|\n|7,952 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;25\n|\n|8,061 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;26\n|\n|7,214 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;27\n|\n|5,863 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;28\n|\n|4,878 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;29\n|\n|3,401 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Sep&nbsp;30\n|\n|2,364 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Oct&nbsp;1\n|\n|2,557 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Oct&nbsp;2\n|\n|2,451 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Oct&nbsp;3\n|\n|2,382 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Oct&nbsp;4\n|\n|2,095 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Oct&nbsp;5\n|\n|1,904 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Oct&nbsp;6\n|\n|1,734 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Oct&nbsp;7\n|\n|1,734 personnel\n| style=\"text-align: left;\" |\n|-\n| style=\"text-align: left;\" |Oct&nbsp;8\n|\n|...\n| style=\"text-align: left;\" |...\n|-\n| style=\"text-align: left;\" |Oct&nbsp;9\n|\n|...\n| style=\"text-align: left;\" |\n|}\nGallery\nFile:King Fire, California.jpg|alt=A true-color satellite imager from directly above eastern California and western Nevada shows a plume of thick gray smoke streaming northeast from the King Fire|The King Fire as captured by NASA’s Aqua satellite on September 17\nFile:King fire, 2014 Sep 19, Landsat 8 false-color infrared.jpg|alt=The King Fire stands out as a jagged red slice of forest, southwest of Lake Tahoe|The King Fire as captured by NASA’s Landsat 8 satellite on September 19: \"In the false-color image, burned forest appears red; unaffected forests are green; cleared forest is beige; and smoke is blue\"\nSee also\n*2014 California wildfires\n*Caldor Fire\n*Mosquito Fire\nReferences"
    }
  ]
}