{
  "content": [
    {
      "type": "text",
      "text": "# King Xi of Han\n\nKing Xi of Han (; died 273 BC), personal name Han Jiu (韓咎), was a ruler of the Han state, reigning from 295 BC until his death in 273 BC. He was a son of King Xiang.\nIn 293 BC, King Xi sent Gongsun Xi (公孫喜) to lead an alliance of Han, Wei, and Eastern Zhou forces of 240,000 to attack the Qin state. The resulting Battle of Yique ended in alliance defeat and capture of Gongsun Xi. The defeated troops were executed and Han lost an additional five cities, according to Zizhi Tongjian. In 295 BC, Qin attacked and took Wan (宛; modern-day Nanyang, Henan). In 296 BC, Han ceded 200 li around Wusui (武遂), southwest of modern Linfen or southeast of modern Yuanqu County, to Qin. In 286 BC, Qin defeated a Han army in Xiashan (夏山), within modern-day Yuzhou, Henan.\nIn 284 BC, King Xi met with King Zhao of Qin in the Western Zhou state to form an alliance against the Qi state. According to Zizhi Tongjian, the alliance was led by Yan and also included Wei and Zhao. The alliance sacked the capital of Qi. King Min of Qi initially escaped capture, but was eventually executed.\nIn 275 BC, Qin attacked Wei. Han sent Bao Zheng (暴蒸) or Bao Yuan (暴鳶) to assist the Wei state, but was defeated. Qin executed 40,000 Han soldiers.\nIn 273 BC, Wei and Zhao attacked Han at Huayang (華陽), in modern-day Xinzheng. Han requested helped from Qin, but Qin would not help. Han again requested help, this time sending Chen Shi (陳筮). The chancellor of Qin, Wei Ran (魏冉), received Chen Shi and asked whether he was sent because of the desperate state in Han. Chen Shi replied in the negative. Wei Ran became angry and asked why Chen Shi claimed the situation was fine when the Han state repeatedly sought help. Chen Shi replied that if the situation was truly desperate, Han would have sought protectorship from a different state. Wei Ran immediately sent help and defeated Wei and Zhao at Huayang.\nKing Xi died in 273 BC and was succeeded by his son, King Huanhui.\nAncestors\nReferences\n*Shiji Chapter 45\n*Zizhi Tongjian Volume 4"
    }
  ]
}