{
  "content": [
    {
      "type": "text",
      "text": "# King of the Ring (1985)\n\n|event      = King of the Ring tournament\n|nextevent2 = 1986\n|lastevent2 = First\n}}\nThe 1985 King of the Ring was the inaugural King of the Ring professional wrestling tournament produced by the World Wrestling Federation (WWF, now WWE). The tournament was held on July 8, 1985, at the Sullivan Stadium in Foxborough, Massachusetts, as a special non-televised house show. The Magnificent Muraco won the inaugural 1985 tournament. In addition to the tournament, there was only one other match during the night. In this match Hulk Hogan pinned Nikolai Volkoff in order to retain the WWF World Heavyweight Championship. Only the finals of the tournament and the main event were shown through closed circuit (CCTV).\nThe event drew 23,000 people of whom 20,000 were paid.\nProduction\nBackground\nIn 1985, to boost attendance at their house shows, the World Wrestling Federation (WWF, now WWE) scheduled their July 8, 1985, event as a tournament called the King of the Ring. It was a single-elimination tournament in where the winner would be crowned the \"King of the Ring.\" The inaugural tournament was held at the Sullivan Stadium in Foxborough, Massachusetts, as a special non-televised house show.\nAftermath\nA second tournament was scheduled for 1986, also as a non-televised house show, thus establishing the King of the Ring tournament as an annual event. The event continued to be held as a special non-televised house show up through 1989 and in 1991; a tournament was not held in 1990. A tournament was also not held in 1992, but returned in 1993, this time as a pay-per-view (PPV) entitled King of the Ring. Only the final few matches of the tournament took place at the PPV, with the first few tournament matches being held prior to the PPV. The PPV would continue until 2002, the same year that the WWF was renamed to World Wrestling Entertainment (WWE), after which the tournament would only be periodically held across episodes of Raw and SmackDown. However, the final match of the 2006 tournament took place at the Judgment Day PPV, while the semifinals and finals of the 2015 tournament aired as a WWE Network-exclusive event.\nResults\nTournament bracket\n|RD2-seed06=\n|RD2-team06=Jim Brunzell\n|RD2-score06=20:00\n|RD2-seed07=\n|RD2-team07=Ricky Steamboat\n|RD2-score07=10:55\n|RD2-seed08=\n|RD2-team08=Iron Sheik\n|RD2-score08=PIN\n|RD3-seed01=\n|RD3-team01=The Magnificent Muraco\n|RD3-score01=PIN\n|RD3-seed02=\n|RD3-team02=Pedro Morales\n|RD3-score02=14:52\n|RD3-seed03=\n|RD3-team03=Jim Brunzell\n|RD3-score03=7:43\n|RD3-seed04=\n|RD3-team04=Iron Sheik\n|RD3-score04=PIN\n|RD4-seed01=\n|RD4-team01=The Magnificent Muraco\n|RD4-score01=PIN\n|RD4-seed02=\n|RD4-team02=Iron Sheik\n|RD4-score02=12:55\n}} Hulk Hogan (c) defeated Nikolai Volkoff\n1.  Tito Santana fought Jim Brunzell to a time limit draw; Brunzell then won a coin toss to determine who would continue in the tournament.\nReferences"
    }
  ]
}