{
  "content": [
    {
      "type": "text",
      "text": "# Kingston Rule\n\n| death_date =\n| country =  United States\n| colour = Chestnut\n| breeder = David H. Hains\n| owner = Mr. & Mrs. David H. Hains\n| trainer = Bart Cummings\n| record = 18: 4-4-2\n| earnings = A$1,549,125\n| race = VATC Tommy Woodcock HandicapVATC H A Currie HandicapMoonee Valley Cup (1990)Melbourne Cup (1990)\n| awards =\n| honours =\n| updated=\n}}\nKingston Rule was an American-bred racehorse who raced in Australia, where he won the 1990 Melbourne Cup in a record time of 3:16:3. This time still stands as the record today.\nBred and raced by Victoria's David H. Hains, who had bred Kingston Town, Kingston Rule was sired by the famed U.S. Triple Crown Champion Secretariat and, out of the 1982 Australian Horse of the Year, Rose of Kingston.\nHe was initially trained in France by Patrick Biancone but only raced once there. He then came to Australia and initially trained by Tommy Smith but was unimpressive.\nIn the Spring of 1989, Kingston Rule was moved to the stables of Bart Cummings. He won two races at Sandown over a mile and was later placed second in the Carlyon Cup at Caulfield to Marwong.\nHe ran in a number of feature races to qualify for the Caulfield and Melbourne Cups but without any wins:\n* 7th in the Australian Cup won by Vo Rogue.\n* 5th in the Memsie Stakes won by The Phantom.\n* 4th in the Craiglee Stakes won by Zabeel.\n* 2nd in the Coongy Handicap, Caulfield, won by Kessem.\nAfter not qualifying for the Caulfield Cup, he was finally successful in the Moonee Valley Gold Cup in record time, ridden by Jim Cassidy\nBart Cummings and David Hains did not wish to wait for Cassidy or Michael Clarke who were both offered the ride on Kingston Rule in the 1990 Melbourne Cup to commit. The horse was unable to get a start in the Mackinnon Stakes and he was ridden by young Sydney jockey, Darren Beadman in the Hotham Handicap for second.\nBeadman again rode him in his Melbourne Cup win ahead of the New Zealand horses The Phantom (Murray Baker, G Cooksley) and Mr Brooker (Peter Hurdle, Greg Childs) in a race record time.\nAfter placing third in both the St George Stakes and Blamey Stakes to Better Loosen Up and Sydeston respectively he suffered an injury to his tendons and never returned to his best.\nStud career\nHe entered stud in 1991, and as of the end of 2009 has sired 91 winners, including 4 stakes winners.\nNotable progeny\nc = colt, f = filly, g = gelding\n{| border=\"1\" cellpadding=\"0\" style=\"border-collapse: collapse; font-size:90%\"\n|- bgcolor=\"#eeeeee\"\n| width=\"35px\" | Foaled\n| width=\"120px\" | Name\n| width=\"35px\" | Sex\n| width=\"510px\" | Major wins\n|-\n| 1994\n| Kensington Palace\n| f\n| Crown Oaks\n|-\n| 1994\n| Sheer Kingston\n| g\n| Adelaide Cup, Brisbane Cup\n|-\n|}\nDeath\nKingston Rule died at Ealing Park, Euroa, Victoria, in December 2011.\nReferences\n* [http://www.pedigreequery.com/kingston+rule Kingston Rule's pedigree and partial racing stats]\n* [https://www.youtube.com/watch?v=gBZoK6LQIeY Video at YouTube of Kingston Rules win in the 1990 Melbourne Cup]\n* [https://web.archive.org/web/20091013192558/http://www.kingstonparkstuds.com.au/stallion_kingstonrule.html Kingston Rule's profile at Kingston Park Studs Pty Ltd.]"
    }
  ]
}