{
  "content": [
    {
      "type": "text",
      "text": "# Kingston City Library\n\n| location             = Kingston, NY\n| built                = 1903\n| architect            = Raymond Almirall\n| architecture         = Classical Revival\n| added                = 1995\n| designated_nrhp_type =\n| visitation_num       =\n| visitation_year      =\n| refnum               = 95001404\n| mpsub                =\n}}\nThe former Kingston City Library building is located on Broadway in the center of Kingston, New York, United States. It is a brick Carnegie library built in 1903 in the Classical Revival architectural style.\nIt served continuously as the city's library until 1974, when it was closed after a newer library was built in the city's Stockade District. Since then it has been the property of the Kingston City School District, which has used it as the offices for the janitorial department at neighboring Kingston High School. In 1995 it was listed on the National Register of Historic Places. Starting in 2009, the library was renovated into an arts and technology center. On September 12, 2011, it was officially reopened as the Carnegie Learning Center used by Kingston High School and the community.\nBuilding\nThe library building sits on a  lot on the south side of Broadway, slightly raised from street level. Kingston Hospital is across the street, as is City Hall. Just to the east is Kingston High School.\nIt is a one-and-a-half-story rectangular building of brown brick on a rough-cut bluestone foundation. A limestone pedimented entry portal is located in the middle of the front. It is heavily decorated with classical motifs. Two ionic columns frame the recessed entrance. On the pediment itself is a book-and-flower frieze. Limestone bands also go around the building at both the lower end of the brick and the top level of the fenestration.\nBoth interior floors are . The lower floor has what was once a lecture hall with raised dais, two study rooms, two bathrooms and a boiler room. A staircase with a Craftsman-style bannister leads up to the main floor, where there are remnants of a cast iron mezzanine for book stacks. Leaded pane glass partitions divide the rooms. Two fireplace surrounds remain at either end.\nHistory\nKingston established its first public library in 1899, a quarter-century after it had been formed from a merger of the previous villages of Kingston and Rondout. It was housed in a room in City Hall, but within three years of the library's establishment it had already outgrown it. In 1902 the library's trustees wrote to Andrew Carnegie, who had funded libraries all over the world, to see if he would consider providing them with the money to build a freestanding library.\nHis secretary wrote back. If the city of Kingston would commit itself to spending $3,000 a year ($}} in contemporary dollars) to maintain the library, Carnegie would donate $30,000 ($740,000 in contemporary dollars) to build it. City Council accepted the offer and passed an ordinance establishing the required level of funding and accepting Carnegie's gift. Local steamboat magnate Samuel Coykendall donated the land, provided the trustees raise money for its purchase through subscription. Ground was broken in 1903 and the new building was opened the next year.\nIt remained the city's library until 1974, when more space was needed and the current library on Franklin Street was built. After the library moved out, it became property of the school district. The interior was heavily modified to serve as classroom space, but that proved unworkable. It was used as the offices of the high school's custodial services until renovations.\nDuring that time the building was neglected, and the front entrance was fenced off from the sidewalk. In 2009 school district voters approved a $3.6 million proposal to rehabilitate the library building into an arts and technology center. The building is now open to the Kingston City School District.\nSee also\n*National Register of Historic Places listings in Ulster County, New York\nReferences"
    }
  ]
}