{
  "content": [
    {
      "type": "text",
      "text": "# King Calaway\n\n| current_members   =\n| past_members      =\n}}\nKing Calaway was an American-Gibraltarian country band. The band was formed in Nashville in 2018, and was composed of Chris Deaton, Simon Dumas, Chad Michael Jervis, and Caleb Miller. The band released a self-titled five-song EP in January 2019 which was expanded into a full album Rivers in October 2019. They disbanded in February 2024.\nBackground\nIn early 2018, the former BMG president Zach Katz and music producer Robert Deaton expressed an interest in creating a new band. Deaton enlisted the help of Jason Halbert and Jon Shoen to find talents for the band. Within a few months, they recruited 6 singers for the band, the band members are Robert Deaton's son Chris who also plays drums, Simon Dumas on keyboards and guitar, Austin Luther on bass, Caleb Miller on lead guitar, Chad Michael Jervis and Jordan Harvey who both play guitar. Dumas, Jervis and Harvey share lead vocals. Dumas is from Gibraltar, Harvey is from Scotland, while the other four are from the United States. Chris Deaton said that 'Calaway' is the name of someone he once worked with: \"Kind of like a Lynyrd Skynyrd story, it's the last name of a person. And then we just threw 'king' on it.\" The band was signed to BBR Music Group's Stoney Creek Records.\nIn January 2019, the band released their debut 5-song self-titled EP. The debut single, \"World For Two\", with its video also premiered prior to the album release. The single reached No. 43 on Hot Country Songs. They opened for the Garth Brooks Stadium Tour in May 2019, and played at the Gibraltar Calling in September. They made their television debut on Jimmy Kimmel Live! in June.\nThe band also guest appeared in the Australian soap opera, Neighbours, on the 20 August 2019 performing \"World for Two\" alongside Australia's Got Talent winner Bonnie Anderson.\nThe band released their first full album, Rivers, which includes the five songs of the EP, in October 2019.  They also released a non-album single, a cover of \"Happy Xmas (War Is Over)\", which they performed on The Kelly Clarkson Show.\nIn July 2020, the group announced that Jordan Harvey has left to \"pursue his own musical journey\".\nIn 2022, the band performed on national TV shows such as Jimmy Kimmel, The Late Late Show with James Corden, TODAY and The Kelly Clarkson Show. They have also opened for Garth Brooks, Rascal Flatts, Gabby Barrett and Scotty McCreery. The band's most recent EP Midnight ushered in a harmonious California Country sound, and led to the release of their newest song on June 10, 2022, titled “When I Get Home” that was produced and co-written by founder, front man, and lead vocalist for the multi-platinum, GRAMMY Award-winning group Zac Brown Band, Zac Brown.\nDiscography\nStudio albums\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\" style=\"width:12em;\"| Title\n! rowspan=\"2\" style=\"width:19em;\"| Album details\n! colspan=\"2\"| Peak chart position\n! rowspan=\"2\" style=\"width:9em;\"| Sales\n|- style=\"font-size:smaller;\"\n! style=\"width:4em;\"| US Indie\n! style=\"width:4em;\"| US Heat\n|-\n! scope=\"row\"|Rivers\n|\n* Release date: October 4, 2019\n* Label: Stoney Creek Records\n| 48\n| 9\n|\n* US: 1,300\n|-\n! scope=\"row\"|''Tennessee's Waiting\n|\n* Release date: August 4, 2023\n* Label: Stoney Creek Records\n| —\n| —\n|\n|}\nExtended plays\n*King Calaway (2019)\n*Midnight (2021)\nSingles\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\"| Year\n! rowspan=\"2\" style=\"width:18em;\"| Title\n! colspan=\"3\"| Peak chart positions\n! rowspan=\"2\"| Album\n|- style=\"font-size:smaller;\"\n! style=\"width:4em;\"| US Country\n! style=\"width:4em;\"| US Country Airplay\n! style=\"width:4em;\"| US AC\n|-\n| rowspan=2|2019\n! scope=\"row\"| \"World for Two\"\n| 43\n| 50\n| —\n|Rivers\n|-\n! scope=\"row\"| \"Happy Xmas (War Is Over)\"\n| —\n| —\n| 17\n|\n|-\n| 2020\n! scope=\"row\"| \"No Matter What\"\n| —\n| —\n| —\n|Rivers''\n|-\n| 2022\n! scope=\"row\"| \"I'm Feelin' Good (Steve Miller Band)\"\n| —\n| —\n| —\n|''Tennessee's Waiting''\n|-\n| colspan=\"6\" style=\"font-size:8pt\"| \"—\" denotes releases that did not appear on chart\n|}\nMusic videos\n{| class=\"wikitable\"\n|-\n! Year\n! Video\n! Director\n|-\n| 2019\n| \"World for Two\"\n| Gerry Wenner\n|-\n| 2020\n| \"No Matter What\"\n| Roger Pistole\n|-\n|}\nReferences"
    }
  ]
}