{
  "content": [
    {
      "type": "text",
      "text": "# Kingdon Gould Jr.\n\n| birth_place = Manhattan, New York City, New York, U.S.\n| death_date =\n| death_place = North Laurel, Maryland, U.S.\n| education =Millbrook SchoolYale University\n| occupation = Diplomat, businessman, philanthropist\n| spouse =Mary Thorne\n| party = Republican\n| children =9, including Kingdon Gould III\n| parents =Kingdon Gould, Sr.Annunziata Lucci\n| allegiance      =\n| branch          =  United States Army\n| serviceyears    = 1942&ndash;1945\n| rank            =  Second lieutenant\n| battles = World War II\n| commands        =\n| unit =  36th Mechanized Cavalry (Reconnaissance)\n| mawards         = 2 Purple Hearts and 2 Silver Stars\n}}\nKingdon Gould Jr. (January 3, 1924 – January 16, 2018) was an American diplomat, businessman, and philanthropist. A Republican businessman, Gould was appointed by President Richard Nixon to serve as United States Ambassador to Luxembourg, a position he would hold from 1969 through 1972. In 1973, Gould was appointed as Ambassador to the Netherlands also by President Nixon, serving until 1976.\nHe is member of the Gould family of financiers, philanthropists, and public servants.\nEarly life\nGould was the third child and the only son of Kingdon Gould, Sr., and his wife, Annunziata Lucci. He attended Millbrook School in 1938 and graduated in 1942. He attended Yale University for two months in the spring of 1942 before enlisting in the United States Army in World War II and was the recipient of two Purple Hearts, two Silver Stars, and a battlefield commission. After returning from England in 1945, he married Mary Bruce Thorne in 1946; they had four sons, including Kingdon Gould III (born 1948), Frank, Thorne and Caleb, as well as five daughters, Lydia, Candida, Melissa, Annunziata and Thalia. Gould returned to Yale to complete his undergraduate degree and then to study law, graduating in 1951. He was the grandfather of United States Olympic cyclist Georgia Gould.\nDiplomatic career\nGould served as United States ambassador to Luxembourg from May 1969 to October 1972 during the Richard Nixon administration. He later served as ambassador to the Netherlands from October 1973 to September 1976 under a second appointment by President Nixon, and continued serving through most of the Ford Administration.\nWhen President Nixon delivered his resignation speech in August 1974, Chief Justice Warren E. Burger was visiting with Gould in The Hague during his tenure as Ambassador to the Netherlands. When discovering that Burger would swear in Gerald Ford to the presidency, Burger told Gould: \"Do you understand the irony, Kingdon? That man [Nixon] appointed me to the highest office, and I wrote the opinion [that forced Nixon to turn over the Watergate tapes and papers as evidence in the trial of presidential aides accused of covering up the Watergate scandal\".\nLater life and death\nFor many years Gould was business partner of Dominic F. Antonelli, Jr. in the Washington DC parking and real estate development PMI Parking Management Inc. From 2013 until his death, he served as a trustee to the Baltimore Council on Foreign Affairs, a nonpartisan organization \"dedicated to educating citizens about foreign affairs\". Gould's donations to Republican candidates and party organs attracted the attention of the media, as for instance in 2006 when the New York Times reported that he had donated $25,000 to the Republican National Committee.\nIn addition to his business and political interests, he was known in the area as a donor to a range of educational institutions. He also figured in the creation of the Capital Crescent Trail; having purchased the DC portion of the newly abandoned Georgetown branch from CSX in 1989, he sold the route to the National Park Service the following year. In his retirement, Gould was known in the Baltimore-area as a donor to a range of educational institutions. Gould died on January 16, 2018, at his home in North Laurel, Maryland of pneumonia at the age of 94, 13 days after his 94th birthday.\nReferences\nExternal links\n*"
    }
  ]
}