{
  "content": [
    {
      "type": "text",
      "text": "# King of Scars\n\n| country       =\n| language      = English\n| genre         = Fantasy\n| set_in        =\n| publisher     = Imprint\n| pub_date      = January 29, 2019\n| media_type    = Print\n| pages         =\n| awards        =\n| isbn          = 978-1250142283\n| followed_by   = Rule of Wolves\n| series        = King of Scars duology\n}}\nKing of Scars is a fantasy novel by the Israeli–American author Leigh Bardugo published by Imprint in 2019. It is the first in a duology, followed by Rule of Wolves, and a continuation of Bardugo's Grishaverse. The story is primarily told in third person by three point of views: Nikolai Lantsov and Zoya Nazyalensky from the original trilogy in Ravka, and Nina Zenik from Six of Crows in Ketterdam.\nPlot\nKing of Ravka Nikolai Lantsov attempts to rebuild his country after the Ravkan Civil War and get it in order to fend off threats from neighboring nations Shu Han and Fjerda while dealing with the demons the Darkling infested him with. Zoya Nazyalensky, his friend, a powerful Squaller, and general of Ravka's Second Army, is desperate to help him.\nThey also run into the Cult of the Starless Saint, who worship and claim loyalty to the Darkling, the former general of the Second Army and the creator of the now gone Shadow Fold, a dark expanse of land full of monsters. Yuri, the leader of this cult, travels with Zoya and Nikolai while they are searching for a way to control the monster inside of Nikolai. They are trapped in a remnant of the Shadow Fold that holds some of Ravka's Saints, including Sankta Elisaveta, Sankt Juris, and Sankt Grigori. Sankta Elisaveta helps Nikolai prepare for a dangerous ritual to rid himself of the monster, while Sankt Juris works with Zoya to hone her Grisha powers. Elisaveta ends up betraying Zoya and Nikolai with Yuri's help. Juris is murdered by Elisaveta and is joined with Zoya as an amplifier. By the end of the ritual, the Darkling's spirit has entered Yuri's body.\nMeanwhile, Nina Zenik is disguised as a woman named Mila Jandersdat as she, Leoni, and Adrik help Grisha flee Fjerda, where Grisha are oppressed and even hunted. Shortly after burying her lover, Matthias, Nina meets Hanne, a Grisha living in secret in Fjerda. Hanne is revealed to be the child of Jarl Brum and Ylva, a Hedjut woman. Together, Nina and her allies manage to rescue young Grisha women and children who are being drugged with parem and forced to conceive children born already addicted to the drug.\nIn the second half of the novel, Isaak, a member of Ravka's royal guard, is introduced. He is recruited by the Grisha at the palace to impersonate Nikolai, who has gone missing while on a mission to rid himself of the monster. Isaak struggles to hold his facade as the King of Ravka while attempting to find Nikolai a politically advantageous bride, finding interest in Princess Ehri of Shu Han. However, Princess Ehri is revealed to actually be a member of the Shu Han secret guard and fatally stabs Isaak and then herself, planning to frame Fjerda for the murders. The real Princess Ehri was disguised as a member of the secret guard. Despite witnessing this, Nikolai chooses the real Princess Ehri to be his bride.\nCharacters\n*Nikolai Lantsov: known as handsome and charming, he is the King of Ravka\n*Zoya Nazyalensky: General of the Second Army and bodyguard to Nikolai. She is a Squaller and member of the Triumvirate.\n*Nina Zenik: Ravkan spy and a Heartreander\n*Genya Safin: Member of the Triumvirate, a Grisha Tailor\n*Tamar Kir-Bataar: Tolya's twin, a Grisha\n*Tolya Yul-Bataar: Tamar's twin, a Grisha\n*David Kostyk: Member of the Triumvirate, a Grisha Durast.\n*Isaak Andreyev: a Ravkan soldier who served under Nikolai during his tenure as King of Ravka. He is a close friend of Nikolai and disguises himself as the King with Genya's tailoring when Nikolai is away.\nReception\nKing of Scars was an instant #1 New York Times Best Seller.\nAwards and nominations\n{| class=\"wikitable sortable\" style=\"text-align:center;\"\n|-\n! Year\n! Award\n! Category\n! Result\n! Ref\n|-\n| 2019\n| Goodreads Choice Awards\n| Best Young Adult Fantasy and Science Fiction\n|\n|\n|-\n| 2020\n| Locus Award\n| Best Young Adult Book\n|\n|\n|-\n|}\nReferences"
    }
  ]
}