{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of Shadows\n\nKingdom of Shadows (2000) is a novel by Alan Furst. It won the 2001 Hammett Prize.\nPlot summary\nThe story is set in Europe between April 1938 and July 1939, a time of ever-increasing fear and apprehension throughout the continent.  Nicholas Morath is an expatriate Hungarian in his forties and the co-owner of an advertising agency in Paris. His uncle, Count Janos Polanyi, is a high-level functionary at the Hungarian embassy in France. Morath is in fact an amateur spy, sent on one dangerous mission after another at his uncle's behest (laundering money through the Antwerp diamond industry, or spending a week in a Romanian jail, for example).  Polanyi tells his nephew little about the reasons for or the results of these excursions, and friction often rises between the two men.  But after Polanyi disappears mysteriously, Morath continues his perilous work alone.\nThemes\nTravel\n''\"Maybe the Belgian border guards didn't care who came and went, but the French customs inspectors did.\"\nFurst (a seasoned travel writer) uses travel and its related experiences to vividly depict the Europe his characters live in.  Morath journeys across the continent by train frequently and sees a world of suspicious border guards, desperate passengers with the wrong papers, and tenuous luxury surrounded by encroaching violence and squalor.  A random brick thrown through a compartment window symbolizes the collapse of yet another country.  Paris, the adopted home Morath returns to time and again, is for him the endangered symbol of an older and more decent way of life.\nHonor and Obligation\n\"'I'm just a fat old Hungarian man, Nicholas.  I can't save the world.  I'd like to, but I can't.'\"\nLike many veterans of World War I, Nicholas Morath believes that he squandered his youth in a meaningless and senseless conflict that knocked the world off its hinges.  He views the prospect of another war with numb horror.  But he and his uncle have a special cross of their own to bear, for they are among the scattered survivors of the old European upper class that failed to prevent the earlier war.  A new evil is now engulfing Europe, and an unspoken obligation to fight it hangs over both of them.\nLove and Redemption\n\"'You are really very good, Nicholas,' she said. 'Really you are.'\"''\nLove (as in many works of literature) is presented here as one of the highest human aspirations, something that can energize a spirit and set it free.  Morath lives for many years in a twilight world of secrets and danger, and seems to take solace in a series of easy women who ask no questions about the things that matter to him.  By forging a relationship with someone who demands to know what is truly important to him (Mary Day), he finds his soul mate even as their physical world crumbles around them."
    }
  ]
}