{
  "content": [
    {
      "type": "text",
      "text": "# King Abdulaziz City for Science and Technology\n\n| location = Al Raed, Riyadh\n| free                   =\n| colors                 =\n| colours                =\n| website                = [http://www.kacst.gov.sa]\n}}\nKing Abdulaziz City for Science and Technology (KACST; ) in Riyadh, Saudi Arabia is a governmental organization established in 1977 as the Saudi Arabian National Center for Science & Technology (SANCST; ); in 1985, it was renamed King Abdulaziz City for Science and Technology.\nHistory\nIn 1977, the Saudi Arabian National Center for Science and Technology (SANCST) was established, with Prof. Rida M.S. Obaid being the president. This center was created as an independent scientific organization that is responsible for the promotion of science and technology in Saudi Arabia. However, the name was later changed to King Abdulaziz City for Science and Technology (KACST). In 1987, KACST has joined the International Council for Science (ICSU) as a National Member.\nIn 1984, Abdul Rahman Al-Athel was named as the President of the city. In 2007, Mohammed Ibrahim Al-Suwaiyel, who used to be the KACST vice president for research, became the president. HH Dr. Turki Al Saud is the KACST vice president.\nOrganization\nInstitutes\nThe research complex is divided into the following research institutes:\n*Atomic Energy Research Institute\n*Computer and Electronics Research Institute\n*Petroleum and Petrochemical Institute\n*Energy Research Institute\n*Resource and Development Institute\n*Astronomy and Geophysics Institute\n*Space Research Institute\nCenters\nKACST has many different research centers, including:\n*GIS Innovation Center\n*National Center for Nano Technology Research\n*The National Robotics and Intelligent Systems Center\n*The National Center for Water Research\n*The National Center of Mathematics & Physics\n*Technology Development Center\n*The National Center for Astronomy\n*The National Center for Biotechnology\n*The National Center for Agricultural Technologies\n*The National Centre Environmental Technology\n*The National Center for Radiation Protection\n*The National Center for Radioactive Waste Management\n*Center of Excellence for Wireless Applications - CEWA (Working with Intel)\n*Center of Excellence for Software Development (Working with IBM)\n*Saudi Lunar and Near-Earth Object Science Center (Working with NASA)\n*Center of Excellence for Space and Aeronautics (Working with Stanford University)\n*Center of Excellence for Wildlife Research (Working with the Saudi Wildlife Authority)\n*Center of Excellence for Nanotechnology (Working with IBM)\n*Center of Excellence for Nanotechnology Manufacturing (Working with Intel)\n*Center of Excellence for Green Nanotechnology (Working with UCLA)\n*Center of Excellence for Bionanotechnology (Working with Northwestern University)\n*Center of Excellence for Nanomedicines (Working with UCSD)\n*Center for Excellence in Biomedicine (Working with Brigham and Women's Hospital)\n*Media Center\n*Middle East Center for Energy Efficiency (Working with Intel)\n*Joint Center for Genomics (Working with Chinese Academy of Sciences)\n*Advanced Sensors & Electronics Defense (ASED) Center\n*Center for Complex Engineering System - CCES (Working with MIT)\nPrograms\nKACST is now working in the following programs:\n*National Satellite Technology Program\n*National ECP Program\n*National Program for Advanced Materials and Building Systems\n*National Program for Automobile Technology\n*Aviation Technology National Program\nProjects\nThe National Science, Technology and Innovation Plan\nThe National Science, Technology and Innovation Plan (NSTIP) is a collaboration between the King Abdulaziz City for Science and Technology and the Ministry of Economy and Planning. This program was approved by the Council of Ministers in 2002. This program has fifteen strategic technologies that will help the future development of Saudi Arabia.\nThese plans are: Water, Oil and Gas, Petrochemicals Technology, Nanotechnologies, Biotechnology, Information Technology, ECP (Electronics, Communications, Photonics), Space and Aeronautics Technology, Energy, Advanced Materials, Environment, Mathematics and Physics, Medical and Health, Agricultural Technology, Building and Construction\nKing Abdullah's Initiative for Arabic Content\nis a project that aims to provide high-quality Arabic contents in all disciplines. To achieve this goal, KACST started to work with the local and international organizations. For example:\n*Nature Arabic Edition: KACST has collaborated with the Macmillan Publishers to translate Nature journal into Arabic. The print issues are freely available to qualified subscribers. Also, the contents of this journal will be available online for free.\n*Wiki Arabi (): This is another project initiated by King Abdullah's Initiative for Arabic Content. This project aims to improve the content of the Arabic Wikipedia by translating the high-quality articles from other languages of Wikipedia such as English, French and Hebrew Wikipedia. The first Wiki Arabi event was in 2010, where over 2000 articles were translated into Arabic. The second Wiki Arabi was in 2012.\nNuclear technology\nIn 1988, KACST starts planning to develop nuclear technology in Saudi Arabia. Therefore, KACST decided to open the Atomic Energy Research Institute (AERI). This Institute will help Saudi Arabia to develop the nuclear power along with King Abdullah City for Atomic and Renewable Energy. The AERI has four different departments: Radiation Protection Department, Industrial Applications, Nuclear Reactors and Safety, and a Materials Department\nScientific achievements\n* KACST's Space Research Institute has designed some satellites that are used in scientific purposes. Such as: SaudiSat 5A,5B, SaudiComSat-1, SaudiGeo-1 and the Geostationary Satellite SGS-1 ( 1/Hellas Sat 4) and Arabsat-6A which was recently launched on 4 February 2019.\n* In 2006, KACST signed a collaboration agreement with CERN to participate in the construction of LINAC4 project. KACST engineers constructed a warm prototype of it. This prototype was then qualified at CERN. And now, KACST is working build up a high-energy physics community to participate in future CERN programs.\n* On September 30, 2008, KACST funded the science team of Gravity Probe B, helping them to complete the project.\n* In 2012, KACST announced the first electrostatic accelerator in Saudi Arabia. This accelerator has been designed by the National Center of Mathematics and Physics.\n* In April 2013, KACST announced the creation of WaferCatalyst, which is a Multi-project Wafer (MPW) consolidation initiative, which aims to promote Integrated circuit design and related technologies in Saudi Arabia and surrounding regions.\nInformation Technology Unit (ITU)\nInformation Technology requirements for research center and city staff is fulfilled by the ITU section situated in building No. 1.\nInternet proxy for Saudi Arabia\nThe King Abdulaziz City for Science and Technology operates the Internet backbone in Saudi Arabia as well as the local registry address space. According to RIPE, \"all Saudi Arabia web traffic will come from [the] IP block\" registered to KACST.\nBoard Membership\n* Ahmed Alsuwaiyan (March 2017 – December 2019).\nSee also\n* Communication in Saudi Arabia\n* Censorship in Saudi Arabia\n* List of things named after Saudi kings\nReferences\nExternal links\n*\n*[https://web.archive.org/web/20121219033255/http://nstip.kacst.edu.sa/ The National Science, Technology and Innovation Plan website]\n*[https://web.archive.org/web/20130602154228/http://www.econtent.org.sa/ King Abdullah's Initiative for Arabic Content]\n*[https://drive.google.com/file/d/0BxvDWiER2XumT3VFNmlqZEJnbEU/edit?usp=sharing KACST high resolution logo (text in black)]\n*[https://drive.google.com/file/d/0BxvDWiER2XumX184cHd6Z055alU/edit?usp=sharing KACST high resolution logo (text in white)]\n*[http://www.gistic.org/ GIS Innovation Center]"
    }
  ]
}