{
  "content": [
    {
      "type": "text",
      "text": "# Kingsford Community School\n\n| motto                   =\n| established             = 2002\n| closed                  =\n| type                    = Community school\n| religious_affiliation   =\n| president               =\n| head_label              = Head Teacher\n| head                    = Joan Deslandes OBE\n| r_head_label            =\n| r_head                  =\n| chair_label             = Chair of Governors\n| chair                   = Paul Jackson\n| founder                 =\n| specialist              = Language\n| address                 = Kingsford Way\n| city                    = Beckton\n| county                  = London\n| country                 = England\n| postcode                = E6 5JG\n| local_authority         = Newham\n| dfeno                   = 316/4037\n| urn                     = 132058\n| ofsted                  =\n| staff                   =\n| enrolment               = 1476\n| gender                  =\n| lower_age               = 11\n| upper_age               = 16\n| houses                  =\n| colours                 =\n| publication             =\n| free_label_1            =\n| free_1                  =\n| free_label_2            =\n| free_2                  =\n| website                 = http://www.kingsfordschool.org.uk\n}}\nKingsford Community School is a secondary school in Beckton in the London Borough of Newham, East London, England. It opened in September 2000, and educates full-time students from the ages of 11 to 16. As of 2024, the headteacher is Joan Deslandes.\nInternational School\nKingsford Community School is a  holder of the British Council's International School Award.\nConfucius Classroom\nIn 2001, Kingsford became one of the first schools in the United Kingdom to introduce lessons of Mandarin to its curriculum.  In 2007, the school became the first Confucius Classroom, a centre for promoting Mandarin Language and Chinese Culture, in London and the South-East.  Subsequently, the school has worked closely with both the Specialist Schools and Academies Trust and Hanban (the National Office for Teaching Chinese as a Foreign Language), now CLEC (Chinese Center for Language Education and Cooperation) in order to develop its own Chinese learning programme and also to promote the teaching of the Chinese language and culture to other schools in the capital and South-East region.\nLinks with independent schools\nPupils who take part in the school's Scholarship Aspiration Programme are able to secure fully funded scholarships at leading independent schools, boarding and day schools, at home and abroad.\nIn recent years graduates from the programme have benefited from and enriched the learning communities of prestigious institutions such as Brighton College, Eton College, Wellington College, and University College School Hampstead, as well as many others across the UK.\nThe 100 Group\nThe 100 Group was a collection of the 50 leading state school heads and 50 independent school heads selected in discussion between former Schools Secretary, Ed Balls, headmaster of Brighton College, Richard Cairns, and Joan Deslandes, headteacher of Kingsford Community School. The heads were chosen on the basis of their standing in their sectors, their commitment to furthering co-operation between the independent and state sectors and their public contributions to educational debate.\nOn 22 January 2010 Kingsford hosted the 100 Group's second annual conference, on the subject of social mobility.\nOfsted Report\nIn October 2022, Ofsted rated the school as \"good\" with many areas, including Leadership and Management and Behaviour and safety of pupils being graded \"outstanding\". \" .\nReferences\n.\nExternal links\nSchool Website: http://www.kingsfordschool.org.uk"
    }
  ]
}