{
  "content": [
    {
      "type": "text",
      "text": "# King of Hearts (Lloyd album)\n\n| prev_title = Lessons in Love\n| prev_year  = 2008\n| next_title = Tru\n| next_year  = 2018\n| misc       =\n}}\nKing of Hearts is the fourth studio album by American R&B recording artist Lloyd, released on July 5, 2011 by Zone 4 and Interscope Records. Production for the album took place at several recording studios and was handled primarily by producer and Zone 4-head Polow da Don. It is Lloyd's first release after leaving his former record label Murder Inc. Records in 2009.\nThe album debuted at number ten on the US Billboard 200 chart, selling 26,000 copies in its first week. Upon its release, King of Hearts received generally positive reviews from music critics, who commended Lloyd's vocal performance in tandem with Polow da Don's production, although many criticized its songwriting.\nBackground\nAfter releasing three albums for The Inc. Records, Lloyd left the record label in 2009 due to creative differences. He subsequently released an eight-track EP, Like Me: The Young Goldie EP, as a free download on the Internet. In 2010, Lloyd was featured on the Young Money hit single \"BedRock\" and signed to Zone 4, the label of producer and longtime friend Polow da Don. He previously worked with Lloyd on the latter's 2008 album Lessons in Love.\nRecording\nRecording sessions for the album took place at Doppler Studios in Atlanta, Georgia, No Excuses Studio in Santa Monica, California, Record Plant in Hollywood, California, and Setai Recording Studios in Miami, Florida. Polow da Don served as the album's executive producer and produced or co-produced all of its songs, managing sessions with background singers and horn and string sections. In an interview for Billboard, he said of his role on the album, \"I promised [Lloyd] my full dedication. So I stopped doing a lot of work with a lot of other artists. I usually have seven songs on the radio at the same time, but I shut down shop to focus on his album\". Lloyd has said of the album's music, \"We've created something in the likes of what Justin Timberlake and Timbaland were able to create [on FutureSex/LoveSounds] and Usher and Jermaine Dupri were able to create [on Confessions]\".\nRelease and promotion\nThe album was released by Zone 4, with distribution through Interscope Records. It was released on July 5, 2011, in the United Kingdom, and on July 6 in the United States. In promotion of the album, Lloyd will accompany rapper Lil Wayne on the second leg of his I Am Music II tour during the summer.\nSingles\nThe album's lead single, \"Lay It Down\", was released on August 31, 2010. It peaked at number 64 on the US Billboard Hot 100 and at number seven on the US Hot R&B/Hip-Hop Songs chart, becoming Lloyd's fourth top-ten hit on the chart.[ Lay It Down Edited Version - Lloyd]. Billboard. Retrieved on July 7, 2011. The second single \"Cupid\" peaked at number 11 on the Hot R&B/Hip-Hop Songs.\n\"Dedication To My Ex (Miss That)\", which features Andre 3000 and Lil Wayne, was released as the third single on August 9. \"Be the One\", which features Trey Songz and Young Jeezy, was originally planned to be the third single. A music video for the song was still released on December 19.\nCritical reception\n| rev2 = The A.V. Club\n| rev2Score = B+\n| rev3 = Los Angeles Times\n| rev3Score =\n| rev4 = Pitchfork\n| rev4Score = 7.9/10\n| rev5 = Rolling Stone\n| rev5Score =\n| rev6 = Slant Magazine\n| rev6Score =\n| rev7 = USA Today\n| rev7Score =\n}}\nKing of Hearts received positive reviews from most music critics. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the album received an average score of 77, based on 12 reviews, which indicates \"generally favorable reviews\". AllMusic editor Andy Kellman called it \"clearly the singer’s best album yet [...] his most unified set of songs\", adding that \"Lloyd has pretty much perfected the art of transcending the modern-R&B Lothario cliché\". Maura Johnston of The Village Voice described the album as \"utterly replayable\" and commented that it \"veers back and forth between unabashed romanticism [...], club-borne lust [...], and the brooding, yet unleashed love songs that helped him initially break onto the scene\". The A.V. Clubs Evan Rytlewski complimented Polow da Don's material for Lloyd and wrote that the album \"doubles down on his amorous enthusiasm, pushing it to such delirious extremes that these songs feel risky and uncharted even as they play to his most obvious strengths\". Glenn Gamboa of Newsday called it \"ambitious\" and commended Lloyd as \"a bold thinker and a skillful singer\". Pitchforks David Drake praised \"the chemistry of Lloyd with producer Polow da Don\", writing that \"his work is primarily devoted to underlining Lloyd's vocals for maximum impact.\" Drake commented that the album \"takes a major step toward streamlining his sound, pushing Lloyd's voice to the center and making a bid for a higher level of recognition in the R&B world,\" and elaborated on its musical significance, stating:\nHowever, Ken Capobianco of The Boston Globe found its songwriting \"weak\" and stated, \"Lloyd shows little nuance, and Polow Da Don doesn’t color in the tracks with enough interesting musical flourishes to mask some of the vocalist’s weaknesses.\" Slant Magazine's Matthew Cole criticized its \"trendy production choices\" and found its songs ill-suited for Lloyd, writing that he \"fares best when he stays on the sillier, sexier side of things.\" Despite calling it a \"strong-laced R&B vocal album\", Mireya Fernandez of The Source perceived an \"inability to definitively differentiate from the vast sea of other R&B singers.\" The Washington Posts Allison Stewart complimented \"Dedication to My Ex (Miss That)\", but stated, \"it’s the first and only track on King of Hearts to inspire any kind of strong reaction at all.\" Los Angeles Times writer Jeff Weiss commented that \"Lloyd possesses a levitating croon and admirably fills out most of producer Polow Da Don’s synthetic boudoir songs\", while noting \"not a cliché left unemployed.\" Jon Caramanica of The New York Times viewed a lack of \"focus\" with the songs, but commended Polow da Don for \"feeling the full range of [Lloyd's] lushness\" in his production. Rolling Stone writer Jody Rosen commended its \"salacious silliness\" and compared Lloyd to recording artist R. Kelly. Steve Jones of USA Today stated, \"it's Lloyd's energetic but smooth deliveries that create a diverse set of keepers.\"\nCommercial performance\nKing of Hearts debuted and peaked at number ten on the US Billboard 200 and on number five on the Top R&B/Hip-Hop Albums chart, with first-week sales of 26,000 copies in the United States. It marked Lloyd's third top-10 album in the United States. By July 2011, King of Hearts had sold 35,600 copies domestically, according to Nielsen SoundScan.\nTrack listing\n| extra2 = }}\n| length2 = 3:56\n| title3 = Cupid\n| note3 = featuring Awesome Jones\n| writer3 =\n| extra3 = }}\n| length3 = 3:55\n| title4 = Luv Me Girl\n| note4 = featuring Chris Brown & Veronica Vega\n| writer4 =\n| extra4 =\n| length4 = 4:05\n| title5 = Naked\n| writer5 =\n| extra5 = |Paul \"Hollywood Hot Sauce\" Dawson}}\n| length5 = 5:07\n| title6 = Jigsaw\n| writer6 =\n| extra6 = Polow da Don\n| length6 = 3:36\n| title7 = Bang!!!!\n| note7 = featuring 2 Chainz & Salo\n| writer7 =\n| extra7 = |Polow da Don}}\n| length7 = 3:40\n| title8 = Be the One\n| note8 = featuring Trey Songz & Young Jeezy\n| writer8 =\n| extra8 = Polow da Don\n| length8 = 4:33\n| title9 = Shake It 4 Daddy\n| writer9 =\n| extra9 = Polow da Don\n| length9 = 3:57\n| title10 = Lay It Down\n| writer10 =\n| extra10 = }}\n| length10 = 4:01\n| title11 = Angel\n| writer11 =\n| extra11 =\n| length11 = 2:59\n| title12 = This Is 4 My Baby\n| writer12 =\n| extra12 = Polow da Don\n| length12 = 5:13\n| title13 = You II\n| writer13 =\n| extra13 = Polow da Don\n| length13 = 4:57\n| title14 = World Cry\n| note14 = featuring R. Kelly, Keri Hilson & K'naan\n| writer14 =\n| extra14 = |Poo Bear}}\n| length14 = 4:41\n}}\n| extra15          = }}\n| length15         = 4:23\n| title16          = Never Window Shoppin'\n| writer16         =\n| extra16          = D'Mile\n| length16         = 3:45\n| title17          = King of Hearts\n| writer17         =\n| extra17          = }}\n| length17         = 4:53\n}}\nNotes\n*}} signifies a co-producer\nPersonnel\nCredits for King of Hearts adapted from AllMusic.\n* Brian Allison – assistant, assistant engineer\n* Marcella Araica – mixing\n* Matt Benefield – assistant, assistant engineer\n* André Benjamin – composer\n* Joshua Berg – assistant\n* Timothy Bloom – background vocals\n* India Boodram – background vocals, vocal producer\n* Jason \"Pooh Bear\" Boyd – composer, producer\n* Veronika Bozeman – producer, vocal producer\n* Chris Brown – composer\n* Matt Champlin – assistant engineer\n* Kelvin Chu – A&R\n* W. Clarke – composer\n* Corey Shoemaker – engineer\n* Greg Curtis – composer, keyboards, producer\n* Paul \"Hot Sauce\" Dawson – guitar, keyboards, producer\n* DJ Mormile – A&R\n* \"Angry\" Mike Eleopoulos – assistant, assistant engineer, engineer, mixing engineer\n* Ken Fambro – composer, producer\n* Cliff Feiman – production supervisor\n* Iain Findlay – assistant\n* Mike Fontana – assistant, assistant engineer\n* Full Circle – composer\n* Chris Galland – assistant\n* Jesus Garnica – assistant\n* B. Green – composer\n* Daniel Gruber – guitar\n* Patrick \"Guitarboy\" Hayes – guitar\n* Clifford Henson – composer, producer\n* Keri Hilson – arranger, background vocals\n* Kesia Hollins – background vocals, vocal producer\n* Jean-Marie Horvat – mixing\n* Ghazi Hourani – assistant, assistant engineer\n* Jaycen Joshua – mixing\n* Polow A. Jones – composer, vocal producer\n* Josh Mosser – assistant, engineer, keyboards\n* Robert S. Kelly – composer\n* Martin Kierszenbaum – A&R\n* King David – drums, keyboards, percussion, piano, producer\n* K'naan – composer\n* Henry \"Noonie\" Lee, Jr. – executive producer\n* Lil Wayne – composer, narrator\n* Ryon Jermain Lovett – composer\n* Erik Madrid – mixing engineer\n* David Manzoor – composer, keyboards\n* Manny Marroquin – mixing\n* Justine Massa – creative coordinator\n* Justin Merrill – assistant engineer, engineer\n* Jonathan Merritt – assistant engineer, engineer, mixing engineer\n* Jazmyn Michel – background vocals, vocal producer\n* Mizzle Boy – producer\n* Brian Morton – assistant, engineer\n* Tremaine Aldon Neverson – composer\n* Jason \"JP\" Perry – bass, keyboards, strings\n* Keithin \"Mizzle Boy\" Pittman – composer\n* Lloyd Polite Jr. – composer, executive producer\n* Polow da Don – executive producer, producer\n* Tameka Raymond – stylist\n* Dan Rockett – bass, guitar, piano, producer\n* Will Sandels – engineer\n* Tony Scales – composer\n* Donnie Scantz – keyboards, mixing\n* Zach Steele – assistant engineer\n* Jeremy Stevenson – assistant, engineer, mixing\n* Corey Stocker – engineer\n* Theron Thomas – composer\n* Timothy Thomas – composer\n* Tron \"Teezy T\" Thomas – composer\n* Titi Boi – composer\n* P. Wright – composer\n* Young Jeezy – composer\nCharts\nWeekly charts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+ Weekly chart performance for King of Hearts\n|-\n!Chart (2011)\n!Peakposition\n|-\n! scope=\"row\"|Australian Hitseekers Albums (ARIA)\n|align=\"center\"|15\n|-\n|-\n|}\nYear-end charts\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|+ Year-end chart performance for King of Hearts\n|-\n!Chart (2011)\n!Position\n|-\n! scope=\"row\"|US Top R&B/Hip-Hop Albums (Billboard)\n|align=\"center\"|83\n|}\nReferences\nExternal links\n*\n* [http://www.metacritic.com/music/king-of-hearts-2011 King of Hearts] at Metacritic"
    }
  ]
}