{
  "content": [
    {
      "type": "text",
      "text": "# King Skellig Mör\n\nKing Skellig Mör (Irish: Sceilig Mhór [ˈʃcɛlʲəɟ woːɾˠ]; – July 7, 1909) was an Irish goat who served as the mascot of the USS Vermont battleship. Following the goat's importation from Killorglin, Ireland, he was involved in a lengthy ownership dispute between various Irish-American fraternal organizations in Massachusetts.\nImportation\nBorn in Killorglin, Ireland, King Skellig Mör was purchased by the Knights of Saint Brendan in 1905 after member Michael Shea saw the goat among his father's herd while visiting Ireland's Puck Fair. Upon arriving in the United States, the foreign goat was seized for deportation by the federal government, but the Knights of Saint Brendan successfully lobbied President Theodore Roosevelt to intervene and allow King Skellig Mör to remain.\nOwnership dispute\nIn 1906, Colonel Roger F. Scannell resigned as President of the Knights of Saint Brendan to start the Kerryman's Association as a competing organization. Citing his designation to oversee the goat, Scannell claimed ownership over King Skellig Mör and prohibited the goat from being displayed at fairs, prompting a lawsuit that initially granted a writ of replevin returning ownership to the Knights of Saint Brendan.\nIn a series of court cases, Scannell cited payments for the goat's purchase, transportation, presentation, and trademark made in his name, which the Knights of Saint Brendan disputed as subsequently reimbursed by the organization. Explaining that the reimbursement committees acted in violation of the organization's bylaws, Scannell argued that such activities did not prove a transfer of ownership. Following appeals, the parties compromised by donating the goat to serve as a mascot for the USS Vermont.\nIn March 1909, Arthur D. Hill, District Attorney for Suffolk County, Massachusetts, and Scannell's lawyer, dedicated King Skellig Mör's arrival on the USS Vermont. Following the goat's death in July 1909 from indigestion, the Museum of Science in Boston, Massachusetts, acquired King Skellig Mör's taxidermied remains in 1910.\nLegacy\nIn June 2024, artist Duke Riley staged an exhibition at the Praise Shadows Art Gallery in Brookline, Massachusetts, titled The Repatriation of King Skellig Mör. The exhibition featured scrimshaw engravings on consumer goods as a form of plastic recycling. The engravings depicted scenes of nautical history, such as a sailor grieving over King Skellig Mör's death. To promote the exhibition, Riley purchased an advertisement in The Boston Globe newspaper seeking information on King Skellig Mör's remains, as the Museum of Science could not locate them.\nReferences"
    }
  ]
}