{
  "content": [
    {
      "type": "text",
      "text": "# Kings Sutton railway station\n\n| grid_name           = Grid reference\n| grid_position       =\n| manager             = Chiltern Railways\n| platforms           = 2\n| code                = KGS\n| classification      = DfT category F2\n| original            = Great Western Railway\n| pregroup            = Great Western Railway\n| postgroup           = Great Western Railway\n| years               = 1 June 1872\n| events              = Opened as ''King's Sutton\n| years1              = 2 November 1964\n| events1             = Renamed King's Sutton Halt\n| years2              = 6 May 1968\n| events2             = Renamed Kings Sutton''\n| mpassengers =\n82,796}}\n22,494}}\n45,532}}\n54,582}}\n67,132}}\n| footnotes           = Passenger statistics from the Office of Rail and Road\n|mapframe=yes\n|mapframe-zoom = 13\n}}\nKings Sutton railway station serves the village of King's Sutton and the nearby town of Brackley in Northamptonshire, England. The station is managed by Chiltern Railways, which provides most of the services including from London Paddington and Marylebone to Oxford and Banbury. It is the least used station in the county of Northamptonshire.\nHistory\nmap of railways around King's Sutton (bottom left, in yellow)]]\nThe Great Western Railway built the  —  section of the Oxford and Rugby Railway between 1845 and 1850; however, the GWR did not open a station at King's Sutton until 1872. By 1881, the arrival of the Banbury and Cheltenham Direct Railway, via , had made King's Sutton a junction. British Railways (BR) withdrew passenger services between King's Sutton and Chipping Norton in 1951 and closed the B&CDR line to freight traffic in 1964. The station was reduced to an unstaffed halt from 2 November 1964.\nBR demolished the station building and removed King's Sutton station's footbridge in the 1960s and replaced it with a signal-controlled barrow crossing at the north end of the platform. An incident in early 2005, where a passenger was nearly hit by an express train, saw the northbound platform closed for a short period whilst security guards were brought in to man the crossing. This led to work starting on a new bridge in late 2005 and completion in May 2006. The old passenger shelter on the up platform was replaced by a new plastic and metal bus-shelter.\nA late night robbery in 2001 led Chiltern Railways to raise security concerns. As a result, CCTV cameras were installed in 2002.\nServices\nKing's Sutton is served by two train operating companies:\n* Chiltern Railways operates services approximately every two hours off-peak between London Marylebone and , with the majority of these extended to . On Sundays, these services are extended beyond Banbury to . Chiltern Railways also operate a single late evening service between Oxford and Banbury, via the Cherwell Valley Line.\n* Great Western Railway operates services approximately every two hours on Mondays-Saturdays between Banbury and Oxford, with some of these services extended to  and . A limited Sunday service of three trains per day operates on this route during the summer months only.\n}}\n}}\n|notemid =}}\nLine open, station closed|previous=Line and station open|route1=Great Western RailwayOxford and Rugby Railway\n|next2=Line open, station closed|route2=Great Western RailwayBicester \"cut-off\"\n|next3=Line and station closed|route3=Great Western RailwayBanbury and Cheltenham Direct Railway|col= }}\nGallery\nFile:King's sutton station Mk2 (6).png|King's Sutton village, as seen from the station in 2000. The chain-link fence was replaced in 2009.\nFile:King's sutton station Mk2 (4).png|The station in 2010; it was upgraded in 2006, with a new shelter installed\nFile:King's sutton station Mk2 (5).png|Kings Sutton station regained its footbridge in 2006.\nFile:Kings Sutton geograph-2135106.jpg|A down car train north of Kings Sutton in 1963.\nReferences\nExternal links\n* [https://www.youtube.com/watch?v=inbE3xgJrVQ Least Used Station in Northamptonshire via YouTube]"
    }
  ]
}