{
  "content": [
    {
      "type": "text",
      "text": "# King's Christian Collegiate\n\nBlue and Maroon\n| athletics = Cavaliers\n| mascot =\n| nickname =\n| rival =\n| accreditation =\n| national_ranking = #1943\n| test_name =\n| test_average = 67%\n| yearbook =\n| affiliations = Edvance Christian Schools Association\n| website = http://kingschristian.ca\n| footnotes =\n| picture =\n| picture_caption =\n| picture2 =\n| native_names =\n| category_label =\n| gender_label =\n| affiliation =\n| assst_admin =\n| president =\n| chairman_label =\n| head_name =\n| head_name2 =\n| head2 =\n| officer_in_charge =\n| enrollment = 650\n| grades_label =\n| latitude =\n| longitude =\n| campus =\n| colors =\n| student_union =\n| free_label = Emblem\n| free_text =\n| free_label_1 =\n| free_1 =\n| free_label_2 =\n| free_2 =\n| free_label_3 =\n| free_3 =\n| picture_caption2 =\n}}\n'''King's Christian Collegiate''' is a private high school in Oakville, Ontario. The school was founded in 2001 by a group of parents who envisioned a local Christian education. In its first year, King’s Christian Collegiate started with 64 students and has since grown to 680 students.\nThe campus sits at the intersection of Neyagawa Blvd. and Burnhamthorpe Rd. The first wing and gym were completed in 2001. In 2006, the school underwent the second phase of construction to expand Student Services, initiate the Learning Commons, a library, several more classrooms, plus an atrium and cafeteria. Construction of the Music Conservatory was completed in 2010, and in 2013 a multi-use sports field was built both for the King’s community as well as wider Halton use. The final construction phase included eight new classrooms, a Fitness Area with weights area, a Fitness Studio for wrestling or dance, and a two-story gym with a surrounding running track on the second floor.\nNotable alumni include University of South Carolina women's basketball player Laeticia Amihere, Harvard University men's basketball player Luka Sakota, Olympic swimmer Tera van Beilen, Matthew \"Fergie\" Ferguson and former CFL and NFL player Joel Reinders.\nStructure\nA structural component for King’s Christian Collegiate Faculty is the weekly Research & Development program, where teachers meet for two hours of instruction-focused learning, conversation, and collaboration. The program includes “a culture of inquiry, critical thought and mutual accountability.”\nExtracurricular activities\nThe \"Doc Talk\" program exists for students interested in exploring careers related to medicine. The program includes presentations from health professionals, as well as a connection to SickKids Hospital where students volunteer to provide blood tests and nasal swabs.\nI am Second is a faith-focused student group that provides a chance for students to learn more and converse about Christianity. The program includes fellowship, worship, story telling, small group discussions, and outreach opportunities at nursing homes and food banks.\nModel United Nations is a club for awareness, research, debate, and resolutions of current and pressing issues in the world. The MUN club uses debate procedures similar to those of the United Nations. Students participate in local and global conferences, and this club now organizes an annual King'sMUN conference every February that relies on student leadership and offers tutorials for participants who want to learn debating skills, increase awareness of the world's complexities, and try resolution processes related to the United Nations.\nThe Prefect program provides leadership training to selected Grade 11 and 12 students who have the role of helping Grade 9 students transition to high school.\nRobotics engages students in STEM and provide activities for those keen to use and develop the technical skills of designing, building, and operating a robot regularly for the FIRST Robotics competitions. Experienced students have the leadership role of mentoring younger students, and the team competes in provincial competitions. In 2013, the team competed in the FIRST Championship and ranked 57th of 100 teams.\nKing's students compete in the Bay Area Science and Engineering Fair (\"BASEF\") and present their research projects in the STEM field. In 2016, King's was awarded the Herb Gildea trophy for the highest-earning high school in the fair.\nThe Student Council increases unity and invites students to connect and have fun within community. It plans school-wide events to unite the student body and promote school spirit.\nNotable alumni\n*Laeticia Amihere (class of 2019), WNBA player\nSee also\n* Education in Ontario\n* List of secondary schools in Ontario\nReferences"
    }
  ]
}