{
  "content": [
    {
      "type": "text",
      "text": "# Kings Landing Historical Settlement\n\nKings Landing is a New Brunswick living history museum with original buildings from the period of 1820-1920. It was created around buildings that were saved and moved to make way for the headpond for the Mactaquac Dam.\nAlthough Kings Landing is not and never was a real village, New Brunswick and the areas surrounding Prince William were primarily settled by Anglo-American Loyalists from the nascent United States, who were called the United Empire Loyalists in Canada; Scottish, Irish and English immigrants were early settlers as well. It is approximately 40&nbsp;km west of Fredericton, New Brunswick in the community of Lower Prince William.\nKings Landing is a representation of rural New Brunswick during the 19th and early 20th century. It is not a replica of an actual village, but a collection of salvaged or recreated buildings from around the Mactaquac headpond and other locations around New Brunswick. With few exceptions, all the historical buildings on the site have been moved and remodelled to specific years in their history. The project was originally started in the late 1960s and continues to the present day, as new buildings are being added every few years.\nInterpretation\nWhile the collection and preservation of artifacts is a major part of daily business, Kings Landing is first and foremost a living museum. The principle is simple: \"Tell them and they'll forget. Show them and they'll remember. Involve them and they'll understand\". Costumed interpreters with extensive knowledge of their area - and often more than one area - bring the site to life for the visitors. Interpretation on site ranges from simple explanations of household objects to complete demonstrations of period activities.\nStructures and exhibits\nMore than a dozen houses, most of which are original buildings, are gathered on site. In the houses, employees welcome visitors, go about daily chores, cook period meals and create period crafts, all while in costumes appropriate to the time period of their area.\nThere are also \"trades\" buildings: these are the shops and businesses that the local men would have owned and operated, many of which would have required a period of apprenticeship/training for those employed there. Examples would be the Print Shop, Sash and Door Factory, the Carpenter Shop, the Blacksmith Shop, etc.\nBeing a living museum, these buildings are kept in working order whenever possible and, in some case, artisans provide goods and services for other parts of the village and for sale in the shops. The complex has a number of barns, and appropriate livestock to go with them. This ranges from chickens and geese to large work horses and oxen. The animals are kept on site not only for show, but also for practical purposes. For example, the chickens give eggs, the cows produce milk, and the horses are used to pull wagons for the visitors from one end of the village to the other.\n;List of locations at Kings Landing:\n* Welcome Centre\n* Heritage Gallery\n* Learning Centre\n* Summer Stage\n* C.B. Ross Factory Gallery & Workshop\n* The Gordon House\n* The Hagerman House\n* Lower Pokiok Superior School\n* The Joslin Farm\n* The Jones Farm\n* Sawmill\n* Gristmill\n* King's Head Inn Restaurant & Pub\n* The Lint House\n* The Blacksmith\n* Ox Barn\n* The Long House\n* St. Mark's Church (Anglican)\n* Carpenter Shop\n* The Huestis House\n* The Fisher House\n* The Donaldson House\n* The Ingraham House\n* The Morehouse Farm\n* The Grant Store\n* The Perley House\n* Theatre\n* Queensbury Parish School\n* The Peddler's Market (Gift Shop)\n* The Killeen Cabin\n* Riverside Presbyterian Church\n* The Print Shop\n* The Slipp House (for overnight Camps)\nSpecial events\nEvery few weekends, there are what are known as Special Events. These are often recreations of specific events in New Brunswick's history. They normally correspond to a particular date, or time of the year. For example, around and on July the 1st, the Confederation Debate features Charles Fisher and William Needham as portrayed by actors.  Visitors get a taste of the controversy surrounding the formation of Canada. As with most of the activities on site, the visitors are encouraged to join in, asking questions, giving votes.\nWorkshops\nKings Landing hosts workshops that happen during open hours. The workshops include learning about many different 19th century tasks and crafts, including candle making, beekeeping, woodworking, and several others.\nHistory\nResearch for the site was begun in 1967 with the creation of a Historical Resources Administration Branch by the provincial government, which created the Mactaquac Historical Program. The program created the idea to establish a site to preserve cultural aspects that would otherwise be lost, as a living museum.\nThe site was opened unofficially to the public in 1971 and officially on 20 July 1974.\nElizabeth II and Prince Philip visited the site in 1976.\nReferences\nExternal links\n*[https://kingslanding.nb.ca/ King's Landing Historical Settlement]"
    }
  ]
}