{
  "content": [
    {
      "type": "text",
      "text": "# King Solomon Hill\n\n| birth_place      = near McComb, Mississippi, U.S.\n| death_date       =\n| death_place      = Sibley, Louisiana, U.S.\n| genre            = Blues\n| occupation       = Musician\n| instrument       =\n| spouse           = Roberta Allums(m. probably 1918)\n}}\nKing Solomon Hill is the name assigned to a blues singer and guitarist who recorded a handful of songs in 1932. His unique guitar and voice combined to produce a sound that has been described as haunting. After much speculation and dispute, he has been identified as Joe Holmes (July 18, 1897 – August 13, 1940), a self-taught guitarist from Mississippi.\nIdentity\nThe Mississippi blues artist Big Joe Williams took a fancy to the name King Solomon Hill and laid claim to it in interviews with Bob Koester, stating that the Hill sides were his first recordings. This story was published by Samuel Charters in his pioneering history The Country Blues. Williams had not known Blind Lemon Jefferson, so he claimed that the song \"My Buddy Blind Papa Lemon\" was about another singer. In a footnote, Charters admitted that the story was open to question, as the style, especially the singing, on the King Solomon Hill sides was so different from Williams's usual style. In his later work The Bluesmen, Charters dismissed Williams's story and commented on the strong resemblance between King Solomon Hill and Sam Collins, which led some blues enthusiasts to believe that they were the same man., 1932; the A-side was \"My Buddy Blind Papa Lemon\"]]The identification of Hill as Joe Holmes was made by the prominent blues scholar Gayle Dean Wardlow and strongly contested by another prominent blues scholar, David Evans. Wardlow eventually found four informants who had known Joe Holmes and identified his voice on the records of King Solomon Hill. One informant lived in a section of Sibley, Louisiana, known as Yellow Pine, within which is a community formerly known as King Solomon Hill, centered on a hill on which stood King Solomon Hill Baptist Church. A retired postal worker confirmed that King Solomon Hill would have been a valid postal address in 1932. The community is now known as Salt Works. No informant remembers Holmes using the name King Solomon Hill, so Wardlow concluded that Paramount Records chose to use his address as his recording name.\nBiography\nHolmes was born near McComb, Mississippi, in 1897. In 1915 he followed his brother to northern Louisiana, where he married Roberta Allums. In 1920 he returned to McComb with his wife and their child, Essie. There he played with the most famous local blues musician, Sam Collins, known locally as \"Salty Dog Sam\" and on record as \"Cryin' Sam Collins\". When interviewed by Wardlow, Roberta recalled seeing her husband playing with Collins, whom she recognized from a publicity image for Black Patti Records. One year later, Roberta and Essie returned to Sibley, while Joe pursued his musical career, initially in McComb and then as an itinerant, returning periodically to Sibley. One town he played in was Minden, Louisiana, where he had a friend, George Young. In 1928 Blind Lemon Jefferson passed through Minden, and Holmes and Young left with him for Wichita Falls, Texas. Holmes later celebrated his brief partnership with Jefferson on his record \"My Buddy Papa Lemon\". At that time he befriended Willard Thomas, known as Ramblin' Thomas, who became his favorite musical partner. Holmes would often travel to Shreveport, Louisiana, to play with Thomas.\nLittle evidence exists of his life outside of music. He was described as a heavy drinker. He died of a cerebral hemorrhage in Louisiana in 1940. Some sources put his date of death at 1949.\nRecording\nIn 1932, while performing in Minden, Holmes was invited to record for Paramount. Wardlow speculated that the Paramount sales manager Henry Stephany stopped at Minden en route from Birmingham, Alabama, to Dallas on the recommendation of Ben Curry (possibly the same man as Bogus Ben Covington), a friend and fellow musician who had moved from Arcadia, Louisiana, to Birmingham. In any case, somebody representing Paramount took Holmes to Birmingham, where he met up with Ben Curry and other Alabama musicians: the blues singer Marshal Owens and a gospel quartet, the Famous Blue Jay Singers of Birmingham. The musicians travelled to the Paramount recording studio in Grafton, Wisconsin, and recorded at least twenty-eight titles, six of them by Holmes and issued under the name King Solomon Hill. It has been speculated that the recording session occurred about January 1932, but Roberta Allums stated that it was in the spring. Fourteen records were issued, three by King Solomon Hill, but Paramount was on the edge of bankruptcy, pressing and shipping only small numbers of records. Holmes took three discs with white labels back to Sibley, but his friends and family never saw any discs with a Paramount label. His friend John Wills did not believe they were \"real records\". Until persuaded by Wardlow, he believed that Holmes had paid to have them recorded privately. Few copies survived. One of the three, Paramount 13125, with \"My Buddy Papa Lemon\" and \"Times Has Done Got Hard\", was long believed to be lost, until a copy was discovered in 2002.\nLegacy\n, there are eight known recordings by King Solomon Hill:\n*\"Down on My Bended Knee\" (Take 1)\n*\"Down on My Bended Knee\" (Take 2)\n*\"The Gone Dead Train\"\n*\"My Buddy Blind Papa Lemon\"\n*\"Tell Me Baby\"\n*\"Times Has Done Got Hard\"\n*\"Whoopee Blues\" (Take 1)\n*\"Whoopee Blues\" (Take 2)\n\"The Gone Dead Train\" was the title of an episode in the ninth season of the television series CSI: Crime Scene Investigation. A portion of the song is played in the episode, and King Solomon Hill is mentioned as the artist.\nThe 1969 film Performance, directed by Nicolas Roeg and Donald Cammell and starring Mick Jagger and Marianne Faithfull, contained a song called \"The Gone Dead Train\", performed by Randy Newman. It is a rewrite by Jack Nitzsche and Russ Titelman and bears only a passing resemblance to \"The Gone Dead Train\" as performed by King Solomon Hill. As noted by the cultural historian Greil Marcus, the \"dead train\" in the Newman version is a metaphor for impotence.\n}}\nExternal links\n*[http://tefteller.com/html/78_king_solomon_hill.html Photos of labels of records by King Solomon Hill]\n*[http://www.the-blindman.com/vids/ksh.htm A biography]\n*[http://www.wirz.de/music/hillkiso.htm King Solomon Hill discography]"
    }
  ]
}