{
  "content": [
    {
      "type": "text",
      "text": "# King's Gambit, Rice Gambit\n\n| moves         = 1.e4 e5 2.f4 exf4 3.Nf3 g5 4.h4 g4 5.Ne5 Nf6 6.Bc4 d5 7.exd5 Bd6 8.0-0\n| ECO           = C39\n| birth         =\n| nameorigin    = Isaac Rice\n| parentopening = King's Gambit\n| AKA           =\n| chessgid      =\n}}\nThe Rice Gambit is a chess opening that arises from the King's Gambit Accepted. An offshoot of the Kieseritzky Gambit, it is characterized by the moves 1. e4 e5 2. f4 exf4 3. Nf3 g5 4. h4 g4 5. Ne5 Nf6 6. Bc4 d5 7. exd5 Bd6 8. 0-0 (instead of the normal 8.d4). White offers the sacrifice of the knight on e5 in order to get his king to safety and prepare a rook to join the attack against Black's underdeveloped position.\nHistory\nThe Rice Gambit was heavily promoted by wealthy German-born, American businessman Isaac Rice towards the end of the 19th century. He sponsored numerous theme tournaments where the diagram position became the starting point of every game played. Such giants of the chess world as Emanuel Lasker, Mikhail Chigorin, Carl Schlechter, Frank Marshall, and David Janowski were among the participants. These events stretched from Monte Carlo, Saint Petersburg, and Ostend, to Brooklyn and Trenton Falls. In a 1905 Pillsbury National Correspondence Chess Association event, 230 amateurs played the gambit by mail. So fascinated was Rice with his pet line, he formed The Rice Gambit Association in 1904, at his home in New York. With Dr. Lasker as Secretary, the Association even published a book of all the games played in the theme tournaments.\nConcrete analysis has long since shown the gambit to be \"neither good nor necessary\", so it has been abandoned in serious play and stands only as \"a grotesque monument to a rich man's vanity\".\nGallagher (1992) states \"Basically, White sacrifices a piece and castles into a raging attack, but according to theory, he miraculously holds the balance. Nevertheless, I still advise you to steer well clear of it.\"\nThe Encyclopedia of Chess Openings (1997) analyzes\n:8...Bxe5 9.Re1 Qe7 10.c3 Nh5 11.d4 Nd7 12.dxe5 Nxe5 13.b3 0-0 14.Ba3 Nf3+ 15.gxf3 Qxh4 16.Re5 Bf5 (or 16...Qg3+ =) 17.Nd2 Qg3+ 18.Kf1 Qh2 19.Bxf8 g3 20.Bc5 g2+ 21.Ke1 Qh4+ (or 21...g1=Q+ 22.Bxg1 Qxg1+ 23.Bf1 Ng3 with an unclear position [but note that computer analysis shows that here 23...Qg3+, not mentioned by ECO, wins for Black]) 22.Ke2 Ng3+ 23.Kf2 Ne4+\nwith a draw by perpetual check, attributing this analysis to José Raúl Capablanca, Amos Burn, and Edward Lasker.\nShaw (2013) gives \"After the following accurate (and by no means obvious) sequence Black is better: 8 ... Bxe5 9. Re1 Qe7! 10. c3 f3! 11. d4 Ne4! 12. Rxe4 Bh2+ 13. Kxh2 Qxe4 ∓\"\nSee also\n* List of chess openings\n* List of chess openings named after people\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\nExternal links\n* Edward Winter, [https://www.chesshistory.com/winter/extra/rice.html Professor Isaac Rice and the Rice Gambit] (2006)"
    }
  ]
}