{
  "content": [
    {
      "type": "text",
      "text": "# King John (film)\n\n. Prince Henry attends a poisoned and feverish King John as Lords Pembroke and Salisbury look on.]]\nKing John is the title by which the earliest known example of a film based on a play by William Shakespeare is commonly known.\nFilmed in London, England, in September 1899, at the British Mutoscope and Biograph Company's open-air studio on the Embankment, it was a silent film made from four very short separate films. Each of those films showed a heavily edited scene from Herbert Beerbohm Tree's forthcoming stage production of Shakespeare's mid-1590s play, King John, at Her Majesty's Theatre London.\nThe first film was of The Temptation Scene with John, Hubert, and Arthur, the second of The Lamentation Scene with Constance, Philip of France, Lewis, and Pandulph, the third of ''King John's Dying Scene with John, Henry, Pembroke, and Salisbury, and the fourth of King John's Death Scene with John, Henry, Falconbridge, Pembroke, and Salisbury.\nThe filming of King John was produced and directed by William Kennedy Laurie Dickson and Walter Pfeffer Dando. The acting and production design was by Herbert Tree, the cinematography was by William Dickson, and the  production company was the British Mutoscope and Biograph Company.\nSurviving copies\nThe EYE Film Institute Nederland has an incomplete copy of the third film lasting just under one minute. The last seconds of the scene are missing from the EYE copy; the BFI National Archive has a film clip of a few frames of the missing part.\nPreserved still frames\nThe below still frames from the film were published in the 27 September 1899 issue of The Sketch'' accompanying a review of Tree's stage production. While these were known to scholars ever since Robert Hamilton Ball's Shakespeare On Silent Film (1968), and preceding journal papers, they were assumed to be ordinary production stills from the stage adaptation. It was not until B. A. Kachur's paper \"The First Shakespeare Film: A Reconsideration and Reconstruction of Tree's King John\" (1991) in Theatre Survey that they were identified as still frames from the film.\nFile:King John (1899) - Act 1, Scene 5 (FF3.3).jpg|The John—Hubert Temptation Scene: Act 1, Scene 5, corresponding to Act 3, Scene 3 in the original play. King John  persuades Hubert  to murder Prince Arthur .\nFile:King John (1899) - Act 2, Scene 1 (FF3.4).jpg|The Lamentation Scene: Act 2, Scene 1, corresponding to Act 3, Scene 4 in the original play. Lady Constance  laments the capture of her son, Prince Arthur, as Lewis , Cardinal Pandulph , and Philip of France  look on.\nFile:King John (1899) - Act 3, Scene 3 (FF5.7)-1.jpg|''King John's Death Scene: Act 3, Scene 3, corresponding to Act 5, Scene 7 in the original play. A poisoned and feverish King John  rants as Prince Henry , Pembroke, and Salisbury looks on.\nFile:King John (1899) - Act 3, Scene 3 (FF5.7)-2.jpg|King John's Death Scene: Act 3, Scene 3, corresponding to Act 5, Scene 7 in the original play. King John  lays dead as Faulconbridge  crowns Prince Henry  while the kneeling Pembroke, and Salisbury looks on.\nCast\n*Herbert Beerbohm Tree as King John\n*Dora Senior as Prince Henry\n*Charles Sefton as Prince Arthur\n*James Fisher as Earl of Pembroke\n*S. A. Cookson as Earl of Salisbury\n*Franklyn McLeay as Hubert de Burgh\n*Lewis Waller as Philip Faulconbridge\n*Julia Neilson as Constance\n*William Mollison as Philip, King of France\n*Gerald Lawrence as Lewis, The Dauphin\n*Louis Calvert as Cardinal Pandulph\nNotes and references\nSources\n*\n*\n*\n*\nFurther reading\n*Anonymous King John Souvenir | Shakespeare's Historical Drama King John | Her Majesty's Theatre. London, England, British Mutoscope & Bioscope Company, 1899 [Theatre Programme].\n*Barnes, John The Beginnings Of The Cinema In England 1894-1901 | Volume Five: 1900. Exeter, England, Exeter University Press, 1997.\n*McKernan, Luke & Terris, Olwen Walking Shadows | Shakespeare In The National Film And Television Archive. London, England, British Film Institute, 1994.\n*McKernan, Luke A Scene - King John - Now Playing At Her Majesty's Theatre in: Fitzsimmons, Linda & Street, Sarah Moving Performances | British Stage & Screen 1890s-1920s''. Trowbridge, England, Flick Books, 1999.\nExternal links\n*"
    }
  ]
}