{
  "content": [
    {
      "type": "text",
      "text": "# King Biscuit Flower Hour\n\n| last_aired    =\n| num_series    =\n| num_episodes  =\n| audio_format  =\n| opentheme     =\n| othertheme    =\n| endtheme      =\n| sponsor       =\n| website       =\n}}\nThe King Biscuit Flower Hour was an American syndicated radio show presented by the D.I.R. Radio Network that featured concert performances by various rock music recording artists.\nHistory\nThe program was broadcast on Sunday nights from 1973 until 1993. Following the end of original programming, the program continued, featuring material from previously broadcast shows, until 2005. During its prime, the program was carried by more than 300 radio stations throughout the United States. The show's name was derived from the influential blues radio show King Biscuit Time, which was sponsored by the King Biscuit Flour Co., combined with the hippie phrase \"flower power\". The first show was broadcast on February 18, 1973, and featured Blood, Sweat & Tears, the Mahavishnu Orchestra, and Bruce Springsteen. The long-time host of the show until the mid-1990s was Bill Minkin, whose voice has been described as \"the perfect blend of hipster enthusiasm and stoner casualness.\"\nThe concerts were usually recorded with a mobile recording truck, then mixed and edited for broadcast on the show within a few weeks. In the 1970s, the show was sent to participating radio stations on reel-to-reel tape. Some shows were recorded and mixed in both stereo and quadraphonic. In 1980, D.I.R. began using the LP format, producing the show on a three-sided, two-record set. The first show on compact disc was a live retrospective of the Rolling Stones broadcast on September 27, 1987. By 2000, King Biscuit was using CD-R media to distribute the show. These tapes, records or compact discs were accompanied by a cue sheet which gave the disc jockey a written guideline of the content and length of each segment of the program.\nAlthough closely associated with classic rock in its later years, the King Biscuit Flower Hour dedicated much air time to new and emerging artists, including new wave and modern rock artists in the late 1970s and early 1980s.\nArchives\nOn January 2, 1982, a three-alarm fire damaged the Manhattan office tower that housed D.I.R. Broadcasting. Reportedly, many of the King Biscuit Flower Hour recordings were lost in the fire.\nIn 2006, the remaining King Biscuit tape archives were acquired by Wolfgang's Vault which began streaming concerts online and has made some available for download.\nKing Biscuit Flower Hour Records\nAfter founder Bob Meyrowitz sold his interest to new ownership, King Biscuit Flower Hour Records was formed in 1992 with the intention of releasing live albums from the archives. Licensing issues prevented the release of the most popular artists featured on the program, although dozens of recordings did see commercial release.\nReferences\nExternal links\n*\n*[https://web.archive.org/web/20220522125823/https://www2.bfi.org.uk/films-tv-people/4ce2b9852d71d DIR Broadcasting] at the British Film Institute\n* Fred Jacobs [https://jacobsmedia.com/could-the-king-biscuit-flower-hour-survive-today/ Could The King Biscuit Flower Hour Survive Today ?] · Jacobs Media Strategies"
    }
  ]
}