{
  "content": [
    {
      "type": "text",
      "text": "# King's Service Medal\n\n| awarded_for      = Voluntary service to the communityServices to the Crown in the public sector, in elected or appointed office\n| campaign         =\n| status           =\n| description      =\n| motto            =\n| clasps           =\n| post-nominals    = KSM (or 'QSM' for previous awards)\n| established      = 13 March 1975 as Queen's Service Medal\n| firstawarded     =\n| holder_label     = Latest award\n| holder           = 2 June 2025\n| total_awarded    = 4,041\n| total_awarded_posthumously       =\n| total_recipients =\n| precedence_label =\n| individual       =\n| higher           = Royal Victorian Medal\n| same             =\n| lower            = New Zealand Antarctic Medal\n| related          = King's Service Order\n| image2           = Ribbon bar of the Queen's Service Medal.svg\n| image2_size      = 100px\n| caption2         = Ribbon of the King's Service Medal\n}}\nThe '''King's Service Medal (created as the Queen's Service Medal''' in 1975 and renamed in 2024) is a medal awarded by the government of New Zealand to recognise and reward volunteer service to the community and also public service in elected or appointed public office. It was established in 1975 and is related to the King's Service Order. The QSM replaced the Imperial Service Medal as an award of New Zealand.\nOn 3 May 2024, the Queen's Service Medal was renamed to the King's Service Medal by Royal Warrant. Recipients of the Queen's Service Medal from 1975 until May 2024 will continue to use the 'QSM' postnominal letters with recipients of the King's Service Medal from June 2024 using the postnominal letters 'KSM'.\nAppearance\n1975–2007\nThe original medal was made of sterling silver,  in diameter. The obverse bears the same effigy of the Queen as the badge of the Queen's Service Order. Surrounding the effigy are the Royal styles and titles \"ELIZABETH II DEI GRATIA REGINA F.D.\". The reverse depicts the New Zealand Coat of Arms surrounded by the inscription \"The Queen's Service Medal\" and the name of the sub-division either \"for Community Service\" or \"for Public Services\". The initials and name of the recipient is engraved on the rim of the Medal. The medals were made by the Royal Mint.\n2007–2023\nThe medal is also made of sterling silver, and is 36&nbsp;mm in diameter. The obverse bears the Ian Rank-Broadley designed effigy of the Queen. The effigy is surrounded by the Royal styles and titles \"ELIZABETH II QUEEN OF NEW ZEALAND\". The reverse bears the New Zealand Coat of Arms surrounded by the inscription \"The Queen's Service Medal\" above and \"for service – MO NGA MAHI NUI\" below. The new Badge and Medal are made by Thomas Fattorini Limited, of Birmingham, United Kingdom.\nSince 2024\nThe obverse of the King's Service Medal depicts King Charles III's portrait and his title 'CHARLES III KING OF NEW ZEALAND'.\nThe reverse of the King's Service Medal is the same as the Q.S.M., but references to 'Queen's' has been replaced with 'King's'.\nRibbon\nBoth versions of the medal are suspended from a ribbon 36&nbsp;mm wide. The edges are a narrow red ochre (kokowhai) stripe. The centre has alternating stripes of red ochre, white and black in a descending step pattern from left to right. The design is inspired by the Māori poutama pattern used in tukutuku wall panels. It is usually interpreted as the \"stairway to heaven\", but in this case it refers to \"steps of service\".\nSee also\n* British and Commonwealth orders and decorations\n* New Zealand Honours System\nReferences\nExternal links\n*[https://legislation.govt.nz/regulation/public/1975/0200/latest/whole.html Statutes of the King's Service Order]"
    }
  ]
}