{
  "content": [
    {
      "type": "text",
      "text": "# Kingsville, Maryland\n\n|subdivision_type1        = State\n|subdivision_name1        =\n|subdivision_type2        = County\n|subdivision_name2        =  Baltimore\n|government_footnotes     =\n|government_type          =\n|leader_title             =\n|leader_name              =\n|leader_title1            =\n|leader_name1             =\n|established_title        =\n|established_date         =\n|unit_pref  = Imperial\n|area_footnotes           =\n|area_magnitude           =\n|area_total_km2           = 26.17\n|area_land_km2            = 26.00\n|area_water_km2           = 0.17\n|area_total_sq_mi         = 10.11\n|area_land_sq_mi          = 10.04\n|area_water_sq_mi         = 0.07\n|population_as_of         = 2020\n|population_footnotes     =\n|population_total         = 4358\n|population_density_km2   = 167.62\n|population_density_sq_mi = 434.15\n|timezone                 = Eastern (EST)\n| utc_offset = &minus;5\n|timezone_DST             = EDT\n| utc_offset_DST = &minus;4\n|elevation_footnotes      =\n|elevation_m              = 83\n|elevation_ft             = 272\n|coordinates              =\n|postal_code_type         = ZIP code\n|postal_code              = 21087\n|area_code                = 410\n|blank_name               = FIPS code\n|blank_info               = 24-44350\n|blank1_name              = GNIS feature ID\n|blank1_info              = 0585320\n|website                  =\n|footnotes                =\n|pop_est_as_of =\n|pop_est_footnotes =\n|population_est =\n}}\nKingsville is a semi-rural, unincorporated community and census-designated place in Baltimore County, Maryland, United States. It is a close-knit and rustic community bounded by the Little Gunpowder Falls river (to the northeast) and the Big Gunpowder Falls river (to the southwest) which join to form the Gunpowder River. The population of Kingsville was 4,318 at the 2010 census.\nHistory\nKingsville takes its name from Abraham King (1760–1836), who died there on December 15 at the age of 76. King, a native of Willistown Township, Chester County, Pennsylvania, acquired some  of land from Thomas Kell (a county judge) in and about the site of Kingsville from parts of the original grants of Leaf's Chance, William the Conqueror, Selby's Hope, John's Delight and Onion's Prospect Hill, according to a deed executed May 13, 1816. King lived in the old Hugh Deane-John Paul mansion (later known as the Kingsville Inn and presently as the Lassahn Funeral home on Belair Road) with his wife Elizabeth Taylor, a sister of the Hon. John Taylor of Willistown, who settled in the West and was the Chief Judge of the Superior Court of Mississippi for a number of years. An 1823 assessment of Old District 2 showed \"Abraham King with 290 acres of 'William the Conqueror' and $350 worth of improvements, no slaves.\"\nThe King family operated a tavern according to an 1847 advertisement in American Farmer (a pioneer agricultural journal) at the forks of Bel Air and Joppa (presumably present day Jerusalem) roads. U.S. postal records indicate that a post office was established at King's Tavern on January 29, 1829, with a George King noted as the postmaster; the office was named \"Kingsville\" on January 8, 1830. In 1840, State Geologist John Henry Alexander was the first to put Kingsville on a map.\nKingsville is bordered by the restored Jerusalem Mill Village museum, Jericho Farm, and the renovated Jericho Covered Bridge on the banks of the Little Gunpowder Falls.  They are listed on the National Register of Historic Places.\nOther nearby communities include Upper Falls, Bradshaw, Franklinville, Joppa, Fork and Perry Hall.\nGeography\nKingsville is located at  (39.449257, &minus;76.413933).\nAccording to the United States Census Bureau, the CDP has a total area of , all land.\nDemographics\n}}\n2020 census\n{| class=\"wikitable\" style=\"text-align:center;\"\n|+Kingsville CDP, Maryland – Racial and ethnic composition\n!Race / Ethnicity (NH = Non-Hispanic)\n!Pop 2000\n!Pop 2010\n!\n!% 2000\n!% 2010\n!\n|-\n|White alone (NH)\n|4,087\n|4,112\n|style='background: #ffffe6; |3,957\n|96.99%\n|95.23%\n|style='background: #ffffe6; |90.80%\n|-\n|Black or African American alone (NH)\n|15\n|40\n|style='background: #ffffe6; |45\n|0.36%\n|0.93%\n|style='background: #ffffe6; |1.03%\n|-\n|Native American or Alaska Native alone (NH)\n|10\n|2\n|style='background: #ffffe6; |4\n|0.24%\n|0.05%\n|style='background: #ffffe6; |0.09%\n|-\n|Asian alone (NH)\n|40\n|55\n|style='background: #ffffe6; |58\n|0.95%\n|1.27%\n|style='background: #ffffe6; |1.33%\n|-\n|Native Hawaiian or Pacific Islander alone (NH)\n|0\n|0\n|style='background: #ffffe6; |11\n|0.00%\n|0.00%\n|style='background: #ffffe6; |0.25%\n|-\n|Other race alone (NH)\n|1\n|5\n|style='background: #ffffe6; |11\n|0.02%\n|0.12%\n|style='background: #ffffe6; |0.25%\n|-\n|Mixed race or Multiracial (NH)\n|25\n|37\n|style='background: #ffffe6; |122\n|0.59%\n|0.86%\n|style='background: #ffffe6; |2.80%\n|-\n|Hispanic or Latino (any race)\n|36\n|67\n|style='background: #ffffe6; |150\n|0.85%\n|1.55%\n|style='background: #ffffe6; |3.44%\n|-\n|Total\n|4,214\n|4,318\n|style='background: #ffffe6; |4,358\n|100.00%\n|100.00%\n|style='background: #ffffe6; |100.00%\n|}\n2000 census\nAs of the census of 2000, there were 4,214 people, 1,483 households, and 1,224 families residing in the CDP. The population density was . There were 1,522 housing units at an average density of . The racial makeup of the CDP was 97.41% White, 0.36% African American, 0.31% Native American, 0.97% Asian, 0.24% from other races, and 0.71% from two or more races. Hispanic or Latino of any race were 0.85% of the population.\nThere were 1,483 households, out of which 35.5% had children under the age of 18 living with them, 73.6% were married couples living together, 6.1% had a female householder with no husband present, and 17.4% were non-families. 13.9% of all households were made up of individuals, and 7.3% had someone living alone who was 65 years of age or older. The average household size was 2.84 and the average family size was 3.14.\nIn the CDP, the population was spread out, with 24.4% under the age of 18, 6.1% from 18 to 24, 24.8% from 25 to 44, 29.8% from 45 to 64, and 14.9% who were 65 years of age or older. The median age was 42 years. For every 100 females, there were 97.1 males. For every 100 females age 18 and over, there were 95.0 males.\nThe median income for a household in the CDP was $78,025, and the median income for a family was $87,071. Males had a median income of $52,140 versus $31,438 for females. The per capita income for the CDP was $34,579. About 2.6% of families and 2.6% of the population were below the poverty line, including 0.5% of those under age 18 and 7.4% of those age 65 or over.\nNotable people\n* Charles Joseph Bonaparte (1851-1921), U.S. Secretary of the Navy and Attorney General\n* Ishmael Day, early resident\n* Dave Johnson, former MLB pitcher\n* Tom Phoebus, former MLB pitcher\n* Blaze Starr, former burlesque star\n* William Purington Cole Jr. - US Congressman 1927-29, 31-38; President Board of Trustees of University of Maryland; resided at Beachmont Farm, then known as Clearview Farm.\nReferences\nExternal links\n* [https://web.archive.org/web/20110625062229/http://gkca.info/historic/index.html Historic sites in the Greater Kingsville area]\n* [http://www.mdcoveredbridges.com/jerusalem.html Jerusalem Covered Bridge] (not to be confused with Jericho Covered Bridge)\n* [http://www.jerusalemmill.org/ Historic Jerusalem Mill Village]\n* [http://kingsvilleparade.org/ Kingsville Independence Day Parade]\n* [http://wikimapia.org/1646413/Former-NIKE-Missile-Launch-Site-BA-09/ Former Nike Missile Launch Site (BA-09)]\n* [http://wiki.worldflicks.org/former_nike_missile_fire_control_site_ba-09.html#coords=(39.447379,-76.461754)&z=17/ Former Nike Missile Firing Control Site]\n* [http://www.kvfc.com/content/history/ History of the Kingsville Volunteer Fire Company]\n* [http://kingsvillees.bcps.org/ Kingsville Elementary School]\n* [http://www.kingsvillerec.org/ Kingsville Recreation Council]"
    }
  ]
}