{
  "content": [
    {
      "type": "text",
      "text": "# Kingston upon Hull West (UK Parliament constituency)\n\nKingston upon Hull West was a borough constituency in Kingston upon Hull which returned one Member of Parliament (MP) to the House of Commons of the Parliament of the United Kingdom from 1885 until it was abolished for the 1918 general election.\nIt was recreated for the 1955 general election and abolished again for the 1997 general election.  It was then replaced by the new Hull West and Hessle constituency.\nBoundaries\n1885–1918: The Municipal Borough of Kingston-upon-Hull wards of Albert, Botanic, Coltman, Newington, and Park.\n1955–1974: The County Borough of Kingston-upon-Hull wards of Albert, Coltman, North Newington, Pickering, St Andrew's, and South Newington.\n1974–1983: The County Borough of Kingston-upon-Hull wards of Boothferry, Coltman, Derringham, Newington, Pickering, and St Andrew's.\n1983–1997:  The City of Hull wards of Boothferry, Derringham, Myton, Newington, Pickering, and St Andrew's.\nMembers of Parliament\nMPs 1885–1918\n{| class=\"wikitable\"\n|-\n!colspan=\"2\"|Election!!Member\n!Party\n|-\n|style=\"color:inherit;background-color: \" |\n| 1885\n| Charles Wilson\n| Liberal\n|-\n|style=\"color:inherit;background-color: \" |\n| 1906\n| Charles Wilson\n| Liberal\n|-\n|style=\"color:inherit;background-color: \" |\n| 1907\n| Guy Wilson\n| Liberal\n|-\n|\n| 1918\n|colspan=\"2\"| Constituency abolished\n|}\nMPs 1955–1997\n{| class=\"wikitable\"\n|-\n!colspan=\"2\"|Election!!Member\n}}\n|votes =3,045\n|percentage = 39.7\n|change = −1.6\n}}\nElections in the 1890s\nElections in the 1900s\nElections in the 1910s\nGeneral election 1914–15:\nAnother general election was required to take place before the end of 1915. The political parties had been making preparations for an election to take place and by July 1914, the following candidates had been selected;\n*Labour: Alfred Gould\n*Liberal: Guy Wilson\n*National Sailors' and Firemen's Union: John R. Bell\n*Unionist: W. H. Grace\nElections in the 1950s\nElections in the 1960s\nElections in the 1970s\nElections in the 1980s\n}}\n}}\nElections in the 1990s\n}}\nNotes and references"
    }
  ]
}