{
  "content": [
    {
      "type": "text",
      "text": "# Kings River (Arkansas)\n\n| source1_elevation  =\n| mouth              =\n| mouth_location     = Table Rock Lake, Carroll County, Arkansas\n| mouth_coordinates  =  (confluence with Table Rock Lake waters in northern Carroll County, Arkansas)\n| mouth_elevation    =\n| progression        =\n| river_system       =\n| basin_size         =\n| tributaries_left   =\n| tributaries_right  =\n| custom_label       =\n| custom_data        =\n| extra              =\n}}\nThe Kings River is a tributary of the White River. It rises in the Boston Mountains of Arkansas and flows northward for more than 90 miles into Table Rock Lake in Missouri. The Arkansas portion of the river is undammed and bordered by rural and forested land, the river is popular for paddling and sport fishing.\nCourse\nThe highest sources of the Kings River are at an elevation of more than  on the north slope of the Boston Mountains in the Ozark National Forest. The stream headwaters arise on the north flank of a ridge about 1.5 miles east of Boston at an elevation of about 2270 feet. The stream flows generally north through the Kings River Falls Natural Area. It passes under Arkansas Highway 74 and past Kingston and flows roughly parallel to Arkansas Highway 21 then turns northwest to pass U.S. Route 412 just east of Marble. It continues to the northwest becoming a portion of the Madison - Carroll county line east of Rockhouse. It enters Carroll County and meanders north passing under U. S. Route 62 west of Berryville. It passes under Arkansas Highway 143 south of Grandview and enters Table Rock Lake and the Missouri line at the Stone-Barry county line southwest of Carr Lane on Missouri Route 86.\nThe river follows a meandering course with the confluence with the White River being almost due north of the source with a drainage basin of , before emptying into Table Rock Lake, a reservoir on the White River at an elevation of . The Missouri portion of the river and its confluence with the White River is flooded as part of Table Rock Lake.\nThe town of Berryville is the only incorporated city within the watershed. Near Berryville, the average annual mean flow of the Kings River from 1935 to 2008 was 572 cubic feet of water per second.\nTributaries of the Kings River include Felkins Creek, Maxwell Creek, Pine Creek, Keels Creek, Dry Fork Creek and Osage Creek.\nHistory\nThe Kings River area was a hunting territory of the Osage Indian tribe during early historic times. A man named Henry King from Alabama was part of an expedition to the Boston Mountains to search for land to settle on. He died and was buried on the banks of the river which was supposedly given his name. Other families from Alabama soon settled the area. However an article titled \"A Description of the Arkansas Territory\" published in the February 4, 1823, issue of The Arkansas Gazette, refers to the Kings River (and also mentions the White River, Buffalo River and War Eagle River). About 1940 the poultry industry began to replace subsistence farming as the main source of employment for the sparse population of the region. In 1951 the U.S. Army Corps of Engineers proposed a dam on the Kings River, but the dam was never constructed, making the Kings River one of the few undammed rivers in the Ozark region.\nConservation and recreation\nThe Kings River has been designated by the state of Arkansas as an \"Extraordinary Resource Waterbody.\" This designation imposes restrictions on streambed alterations and development and pollution in the river basin. The state of Arkansas describes the river: \"High in the Boston Mountains of Madison County lie the beginnings of the Kings River. From this steep country the stream twists its way northward to the White River....In its upper reaches, the Kings cuts a narrow gorge through sandstone, shale and limestone.  On downstream, the countryside is not quite so precipitous, but the water is the same -- clear and cool.\"\nThe King's River Natural Area, established in 1979, is located on the upper Kings River east of the hamlet of Boston. The Natural Area includes  and features a two mile hiking trail which leads to Kings River Falls, a scenic 6-feet (2 mt) high waterfall. The Natural Area is located in a rugged mountain area. A mixed pine-hardwood forests cloaks the east slopes of the preserve; the steeper western slopes are covered with hardwood forest.  The uppermost tributaries of the Kings River are in the Ozark National Forest.\nThe McIlroy Madison County Wildlife Management Area comprises  including several miles along the Kings. In 2010, the Nature Conservancy established a  preserve which includes seven miles of frontage on the Kings River, a short distance downstream (north) of the Wildlife Management Area.\nRecreational paddlers divide the Kings River into two sections. An upper section of eleven miles, from Dripping Springs to the Arkansas State Route 74 crossing of the river, is a turbulent class III whitewater stream, including the waterfall at the Kings River Natural Area. The water level of the river in this section is usually sufficient for floating in winter and spring until about July 1.  Water quality is excellent. The lower Kings River comprises 82.5 river miles from State Highway 74 to Missouri State Highway 86. It is a relatively gentle Class I stream that usually contains enough water to be floated in winter, spring, and early summer until August or after rains at any time. The Kings River has good sport fishing for smallmouth bass and other species.\nReferences"
    }
  ]
}