{
  "content": [
    {
      "type": "text",
      "text": "# King's Manor, Southwark\n\nThe '''King's Manor''' - formally 'The City of London's King's Manor of the Town and Borough of Southwark' - is an institution of the City of London which is not a Livery Company as it is territorially rather than trade based, being the organisation of the Juror freemen of the Court Leet. The Manor covers the area from the western-side of Borough High Street, Southwark, to the borders of Newington and Lambeth. The manor originally lay in Surrey.\nThe City of London acquired the 'borough of Southwark' from the Crown in 1327, nicknamed the 'Guildable Manor' since 1377. In 1550 the City purchased from Edward VI's government the manors to the south of this on the west and the east of the high street.  The City's royal charter of 1550 makes difficult reading because the three manors being described are referred to as 'The Town and Borough of Southwark' (Guildable), 'Our Lordship and Manor of Southwark' (King's) and 'Our Manor and Borough of Southwark' (Great Liberty), all three together are termed 'The Borough and Town of Southwark and all of its parishes and precincts aforesaid' (all text in Latin). Today the City officers refer to the three manors as the 'Town and Borough of Southwark', as stated on the Courts Leet summons, on which none of the nicknames appear.\nEarliest beginnings: The 'Abbot of Bermondsey's manor of Southwark'\nAt the time of Domesday Book in 1086 the Southwark and Bermondsey areas were owned by the king and by the Archbishop of Canterbury, the latter's holding was the manor along the eastern side of the high street. The king owned the northern bridge-head or borough area and the land on the western side of the highway, over to Lambeth and also the areas of Bermondsey and Rotherhithe to the east of the Canterbury manor.\nBefore Henry VIII acquired the manor in 1536 it belonged to Bermondsey Abbey. A fascinating early plan-map, discovered in the Duchy of Lancaster archive, shows Southwark at some point between the Dissolution and the 1550 charter. Perhaps it was prepared with reference to the jurisdictional disputes with the king's agents, the City and its manor of the Guildable, as the boundary points are shown on it. A date of 1543 has been assigned to this. On this plan the City's manor at the northern end of the high street is called the lyberte off the mayre. The later nicknames ''King's manor, and occasionally the Queen's manor, for the western Bermondsey Abbey manor, are used only after the crown had sold it to the City; the nickname probably derives from the prominent royal mansion/ mint there; Henry VIII only held it from 1536. This western manor area is delineated, ambiguously, as the liberte off the manor''. In fact the plan refers to the eastern manor acquired from Canterbury, the so called 'Great Liberty', as the kynges lyberte. In John Silvester's (Recorder~High Steward in 1807) notes and procedures of the Southwark manors he also uses the abbreviations of the borough for the Guildable, the manor for the King's and the liberty for the Great Liberty.\nThe first post Domesday fracture of this extensive royal estate is a result of the creation by one Aylwin 'Cild' of a priory at Bermondsey in 1082, but he also assigned rents from properties in the City to a Cluniac house in France, presumably for the purpose of supporting this church. Members of the Order arrived in Bermondsey in 1089 to formalise the relation. The priory was dedicated to 'St Saviour'. We know little of this benefactor save that he was a London merchant but seems to have been (by name and title) an Englishman rather than a Norman.\nIt has been suggested that the mercantile dynasty of the early mediaeval period called 'Ailwyn' were his descendants and that Henry Fitz-Ailwyn, the first known Mayor of London (ca 1189) was one of these; we know that his daughter in law was interred in the Priory church.\nThe Priory's, (from 1399 an Abbey) main site can be identified today by Abbey Street and Bermondsey Square. In Domesday 'Bermondsey' is described as 'held' by King William I but before him by 'Earl' Harold i.e. Harold Godwinson. According to the Annals of the Abbey, King William Rufus gave the manor of Bermondsey (along with Rotherhithe) to the Priory in 1092.\nThe priory became exceptionally well endowed and eventually as an abbey had lands all over the country. However, one of its earliest forays was into local real estate but it was constrained by the neighbouring manors, including Walworth to the south, held by Canterbury. Nevertheless, it approached Henry I in 1103/04 to acquire what was held directly by the crown there. This was all of the territory on the western side of the high street, designated by this writer the 'Royal Manor' for convenience; it was described as 'the hide of Southwark', i.e. of one hide, as a part of the king's demesne.\nThis transaction did not include the far north-western part of the area. This, presumably, had already been granted by the crown to another party. It was later described as 'Wideflete' or 'the Wyldes', this was very poor quality low-lying flood-plain as its original name indicates. The priory had this granted to them, shortly afterwards, by Robert Marmion in 1113. He was the hereditary King's Champion and certainly a direct tenant of the Norman kings. It was described as of \"one hide, seventy acres and a mill\". It was later to be called 'Paris Garden' and is best identified today as the northern part of Blackfriars Road.\nTherefore, by 1113, Bermondsey Priory had control of most of the Southwark area, all of that which had previously constituted the 'Royal Manor', except the borough. There is an anomaly to this territory: The Canterbury holding on the eastern side of the high street has a small part detached from it. This, at least in part, derives from what was the small de Ardern family property which occupied the corner of the junction of the high street, Long Lane and 'old' Kent street (Tabard Street), presumably this had been acquired from Canterbury after 1086. It may have been a hamlet that had congealed at what is the junction of the Roman roads now known as Stane Street and Watling Street. This too was given to Bermondsey priory in 1122, by the Ardern's along with St George's church which is in that precinct. It clearly is in the 'wrong' manor as the high street is the natural border. However, at the period under scrutiny it was just a small part of the extensive combined area held by the Priory occupying the western side of the high street, which as shown above was already owned by it. This area is coincident with St George's ancient parish. Obviously, this largely open area was assigned to that church as an administrative convenience. The Rectors were appointed by the Priory/Abbey until the transfer to Henry VIII in 1536. The main open ground, sparsely populated, of the manor was assigned to this church as its outlying parish and hence it acquired the alternative epithet of 'St George's Fields'.\nTo use the post-Reformation titles of these areas we can see that by 1122 Bermondsey Abbey owned all of the so-called 'King's', 'Clink' and 'Paris Garden' manors, as well as Bermondsey and Rotherhithe. Canterbury owned Walworth as well as the 'Great Liberty'. The crown controlled only the western side of the 'borough' or 'Guildable' manor, the eastern part being controlled by the de Warrennes successors to the Godwins' sub manor.\nFrom this large combined area Bermondsey Priory divided a part which was let-out to one Ordgar the Rich; just when is not clear. However, it was from Ordgar (with the consent of Bermondsey Priory) that the Bishop of Winchester acquired it, no earlier than 1144/49, this was for the creation of a palace near London to enable the Bishop to carry out his political duties. The part acquired by Winchester was the nucleus of the manor later known as 'The Clink'.  The parts remaining to Bermondsey Priory were 'Wideflete' and the remnant of the 'Royal Manor' (i.e. less the 'Clink') along with the Ardern property. The 'Wideflete'/ Paris Garden was demised to the Templars (on the opposite side of the river to their 'New Temple') in 1166.\nThe manorial area that was left was informally referred to as  (i.e. the 'soke' west of the 'high' street) in the thirteenth century and as the 'Abbot's manor' later. From some point in the fifteenth century the Brandon family became the King's Marshals; as such they controlled the two ancient royal prisons on the eastern side of the high street, the King's Bench and the Marshalsea. As they became more prominent at court they grew wealthier and acquired parts of the western side of the high street from the Abbey to create a large mansion and grounds including, notably, Moulton Close which is now the park around the Imperial War Museum. The house became known as Brandon Place. Charles Brandon, the last of the male line, became Marshal in 1510 and was created Duke of Suffolk in 1514; he married Henry VIII's sister in 1516. The mansion then becomes known as Suffolk Place.\nHenry took an interest in Suffolk Place and acquired it from Charles in 1536. Shortly after, in June 1536, the St Saviour's Abbey of Bermondsey was induced to 'grant' its land to the king, part of the Dissolution process, hence he now owned all of the Abbey's manor west of the high street. However, Henry gave this building to Queen Jane Seymour in 1537, mother of Edward VI, who died of post-natal complications shortly after his birth. In 1538 Henry acquired from Thomas Cranmer the Archbishop of Canterbury's manor on the eastern side of the high street; it seems it was his intention to create a new hunting park out of the two areas and the Brandon mansion was to act as its lodge.\nThe mansion is shown on the 'Lancaster Plan' of 1543 and there called De manor place. In any case Henry seems to have lost interest in the project before his death in 1547. From 1545 until 1551 it was the Mint, supplementing the main mint at the Tower of London. This part of the borough is still called 'the Mint'. These manors belonged to the king for only fourteen and twelve years respectively, as in 1550 the City acquired both of the properties. The building then reverted to being a royal mansion; in 1554 Queen Mary I stayed overnight with her new husband King Philip II of Spain as part of their progress to London. In 1556 she granted it to the Archbishop of York for his London house, but it was soon leased out in parts for income. Unfortunately, although the park behind it and various buildings at its lodge or gatehouse were transferred to the City the mansion and garden were retained by the king; this curtilage might be what is delineated by the semi-circular line around the building in the 'Lancaster Plan'. These had been specifically excluded from the City's jurisdiction by clauses in the charter. This allowed it to become a haunt and refuge for undesirable persons and activities (see Alsatia). So notorious a place did it become that it was included in the Escape of Debtors, etc. Act 1696 (8 & 9 Will. 3. c. 27) to allow the sheriff a power of 'posse comitatus' (a writ to raise an armed group) and enter into it to evict its inhabitants. However, it reverted to its bad ways and another, specific act, The Mint in Southwark Act 1722 (9 Geo. 1. c. 28) was required to clear it out for good. The City's jurisdiction was now complete.\nAnnual Court Day\n\"The Court Leet and View of Frankpledge with the Court Baron of the Lord Mayor and Commonalty of the City of London\" is now summoned for each of the three City manors once a year, usually on the second Wednesday in November, i.e. following the Presentation of the Lord Mayor (see Lord Mayor's Show).\nReferences"
    }
  ]
}