{
  "content": [
    {
      "type": "text",
      "text": "# King Kung Fu\n\n| runtime        = 94 minutes\n| country        = United States\n| language       = English\n| budget         =\n| gross          =\n}}\nKing Kung Fu is a 1976 comedy film  directed by Lance D. Hayes that is a low budget spoof of both King Kong and Kung Fu done in a slapstick style.\nPlot\nKing Kung Fu tells the story of a good-humored, hat-loving, Chinese talking gorilla originally named Jungle Jumper who has been taught karate. After beating up his Kung Fu Master owner, Alfunku, when the latter dared him to snatch a banana from his hand, he is shipped off to the U.S. as a \"goodwill gift\" by his battered and embarrassed teacher, where he is renamed King Kung Fu for publicity purposes. On the way to the New York Zoo, the \"Monster Master of the Martial Arts\" is put on display in Wichita, Kansas, where two out-of-work reporters set him free with plans to \"capture\" him and get jobs.\nPolice Captain J.W. Duke (who resembles a certain Western Movie star) and his patriotic-helmeted little assistant, Officer Pilgrim, get involved in the citywide chase along with the phony-looking ape's love interest, Rae Fey (a beautiful blonde Pizza Hut waitress/model). Rae Fey is the only one who understands that Fu just wants to see the sights like any other tourist. Her conniving TV journalist boyfriend, Bo Burgess (not Beau Bridges as has been listed in some sources, a reference no doubt to the actor's brother Jeff who starred in the first remake of King Kong), and his hapless sidekick, Herman, a pair of prudish protesters from \"OLD HAGS\" (\"Outraged Ladies Dedicated to Hiding Animals Great Shame\"), and a host of others including cops, cowboys and baseball players partake in a wild chase in order to catch the ape.\nThe gorilla and the girl end up on top of the tallest building in Wichita, a Holiday Inn and homage to the original King Kong film, where the hairy hero makes a final stand involving instances of stop motion animation.\nCast\n* John Ballee as Gorilla\n* Billy Schwartz as Bo Burgess\n* Lois Ayres as Myrtle\n* Allan Baker as Smilin' Jack\n* Fred Burton as Bruce the Great\n* Dan Campbell as Dr. Harris Freeb\n* Robert Carroll as F. Lawrence LaRue\n* Lee Elliot as Sig Heil\n* Jim Erickson as Al Funku\n* Maxine Gray as Rae Jean Fey\nProduction\nProduction began on King Kung Fu in 1974 with principal photography taking place in Wichita, Kansas. Due to financial constraints, it was not finished until 1987. The film's production cost around $300,000. The theme song used for the ending (\"Gorilla Rag\") was written and performed by local Wichita band, LEGION.\nReception\nThe movie, while obscure, developed a slight cult following, eventually gaining a DVD release years after its release.\nReferences\nExternal links\n*"
    }
  ]
}