{
  "content": [
    {
      "type": "text",
      "text": "# King of Emotion\n\n| recorded   =\n| studio     =\n| venue      =\n| genre      =\n| length     = 4:50\n| label      = MercuryReprise (US)\n| writer     = Stuart Adamson\n| producer   = Peter Wolf\n| prev_title = Hold the Heart\n| prev_year  = 1986\n| next_title = Broken Heart (Thirteen Valleys)\n| next_year  = 1988\n}}\n\"King of Emotion\" is a song by Scottish rock band Big Country, released in 1988 as the lead single from their fourth studio album Peace in Our Time. It was written by Stuart Adamson and produced by Peter Wolf. \"King of Emotion\" reached number 16 in the UK Singles Chart. In the US, it reached number 11 on the Billboard Modern Rock Tracks chart and number 20 on the Billboard Album Rock Tracks chart.\nBackground\nRecalling the song in the early 1990s, Adamson revealed that the song was influenced by the Rolling Stones' \"Honky Tonk Women\", \"There was a groove that suited us, so I thought why not go the whole hog and write our own song?\" In 2002, the song was performed by British singer-songwriter Steve Harley (of Cockney Rebel) at the Stuart Adamson Tribute Concert.\nMusic video\nThe song's music video was filmed in Wittenoom Western Australia and directed by Richard Lowenstein. It received breakout rotation on MTV.\nCritical reception\nUpon its release as a single, William Shaw of Smash Hits noted, \"Big Country used to be the group whose tunes sounded all Scottish due to having billions of bagpipe-like guitars on them. This, on the other hand, is hip wiggling \"rock\" of the kind large crowds punch their fists into the air and shout \"Awwwwwwwright\" to. This is raunchy rock and ruddy roll, this is. Who are these imposters? Whoever they are, they've probably got a big hit on their hands.\" Mica Paris, as guest reviewer for Number One said, \"This sounds like an album track. It's stronger than their old stuff but it's just not a single.\"\nIn the US, Cash Box commented, \"A rough and ready rocker that has more elements of tough than tender. If Big Country sounded like guitars emulating bagpipes, this single sounds like guitars as axes, a decidedly heavier brushstroke here. Should score well on AOR.\" Bill Coleman of Billboard wrote, \"A new musical maturity is more than evident on this cleanly produced power chord rock piece of merit.\"\nIn his 2015 book The Top 40 Annual 1988, James Masterton noted, \"Even two and a half decades later \"King of Emotion\" still has the capacity to annoy as it only takes one listen to realise just how much better it could have been.\" In a retrospective review of the album, William Ruhlmann of AllMusic commented, \"On songs like the \"King of Emotion\", Wolf sought to retain Big Country's heroic quality while adding the widescreen dramatic style and cheerleader choral approach of Starship's \"We Built This City.\" It was a brave try, but didn't really suit the group.\"\nTrack listing\n7-inch single\n#\"King of Emotion\" – 4:50\n#\"The Travellers\" – 3:16\n12-inch single\n#\"King of Emotion\" – 4:52\n#\"The Travellers\" – 3:14\n#\"Starred & Crossed\" – 4:26\nCassette single (UK release)\n#\"King of Emotion\" – 4:51\n#\"The Travellers\" – 3:13\n#\"Starred and Crossed\" – 4:25\n#\"On the Shore\" – 3:38\nCD single\n#\"King of Emotion\" – 4:51\n#\"The Travellers\" – 3:13\n#\"Starred and Crossed\" – 4:25\n#\"Not Waving but Drowning\" – 5:55\nCD single (US promo)\n#\"King of Emotion\" (LP Version) – 4:50\nPersonnel\nBig Country\n* Stuart Adamson – vocals, guitar\n* Bruce Watson – guitar\n* Tony Butler – bass\n* Mark Brzezicki – drums\nProduction\n* Peter Wolf – producer of \"King of Emotion\"\n* Big Country – producers of \"The Travellers\", \"Starred & Crossed\", \"On the Shore\" and \"Not Waving But Drowning\"\nOther\n* Paul Harrison – front cover design\n* Andy Earl – front cover photography\n* Terry O'Neill – back cover photography\nCharts\n{| class=\"wikitable sortable\"\n|-\n!Chart (1988)\n!Peakposition\n|-\n|Finland (Suomen virallinen lista)\n| style=\"text-align:center;\"|17\n|-\n|Irish Singles Chart\n| style=\"text-align:center;\"|11\n|-\n|UK Singles Chart\n| style=\"text-align:center;\"|16\n|-\n|US Billboard Album Rock Tracks\n| style=\"text-align:center;\"|20\n|-\n|US Billboard Modern Rock Tracks\n| style=\"text-align:center;\"|11\n|}\nReferences"
    }
  ]
}