{
  "content": [
    {
      "type": "text",
      "text": "# King of the Hill__disambig_2\n\n| creator              =\n| developer            =\n| showrunner           =\n| voices               =\n| theme_music_composer = The Refreshments\n| opentheme            = \"Yahoos and Triangles\"\n| endtheme             =\n| composer             =\n| country              = United States\n| language             = English\n| num_seasons          = 14\n| num_episodes         = 269\n| list_episodes        = List of King of the Hill episodes\n| executive_producer   =\n| producer             =\n| editor               =\n| runtime              = 20–25 minutes\n| company              =\n| network              = Fox\n| first_aired          =\n| last_aired           =\n| network2             = First-run syndication\n| first_aired2         =\n| last_aired2          =\n| network3             = Hulu\n| first_aired3         =\n| last_aired3          = present\n}}\nKing of the Hill is an American animated sitcom created by Mike Judge and Greg Daniels that initially aired on Fox from January 12, 1997, to September 13, 2009, with four more episodes airing in syndication from May 3 to 6, 2010. The show would later be revived on August 4, 2025, starting with season 14 on Hulu and Disney+ with Hulu.\nThe series follows the Hills, an American family who live in the fictional city of Arlen, Texas, as well as their neighbors, co-workers, relatives, classmates, friends, and acquaintances. The show's realistic approach seeks humor in the conventional and mundane aspects of everyday life, blue-collar workers, family conflicts, and the trials of puberty.\nJudge began creating King of the Hill during his time making the MTV series Beavis and Butt-Head, which he also created and voiced the characters for. After pitching the pilot to Fox, Judge was paired with Greg Daniels, an experienced writer who previously worked on The Simpsons. The series debuted on the Fox network as a midseason replacement in 1997, before episodes of The Simpsons and The X-Files, quickly becoming a success. The show became one of Fox's longest-running series, with a total of 259 episodes over the course of its 13 seasons. Four episodes from the final season were planned to air on Fox, but later premiered in nightly syndication in May 2010. The show would later be revived in August 2025 with 10 extra episodes, with the current total of 269 episodes.\nKing of the Hill was named by Time in its 2007 list of \"The 100 Greatest TV Shows of All Time\". The series has won two Emmy Awards and has been nominated for seven. Its celebrity guest stars include Texas Governor Ann Richards, Brad Pitt, Chuck Mangione, Tom Petty, Alan Rickman, Meryl Streep, Ben Stiller, Matthew McConaughey, Michael Keaton, Jennifer Aniston, Johnny Depp, and numerous country music artists―including Randy Travis. The series' popularity led to worldwide syndication, and cable reruns currently air on FXX and Adult Swim, having aired on FX and Comedy Central in the past.\nOn January 18, 2022, Judge and Daniels announced the formation of a new company called Bandera Entertainment, with a revival of King of the Hill being one of several series in development. On January 31, 2023, Hulu announced it had picked up the revival for two seasons. The revival premiered on August 4, 2025, with the new season airing on Hulu and Disney+ with Hulu. On October 30, 2025, Hulu renewed the series for two more seasons.\nPremise and characters\nPremise\nKing of the Hill depicts an \"average\" family and their lives in a typical American town. It documents the Hills' day-to-day-lives in the small Texas town of Arlen, exploring themes such as parent-child relationships, friendship, loyalty, and justice.\nUnlike most adult animated sitcoms, e.g. Family Guy, the show uses a simple slice-of-life format and humorously mundane content. Critics have praised King of the Hill for its sense of humanity shown throughout the show.\nCharacters\nKing of the Hill is set in the fictional small town of Arlen, Texas. The show centers on the Hill family, headed by the ever-responsible, hard-working, honest, but emotionally stunted propane salesman Hank Hill (Mike Judge). The punning title refers to Hank as the head of the family, as well as metaphorically to the children's game king of the hill. He often finds his traditional conservative values challenged by the changing world around him, though his common decency usually sees him through. Hank typically serves as the de facto leader for his friends and family.\nHis wife Peggy Hill, née Platter (Kathy Najimy), a native of Montana, begins the series as a substitute Spanish teacher, though she has a poor grasp of the language. She pursues numerous other careers throughout the show's run. She is confident, frequently to the point of lacking self-awareness.\nHank and Peggy's only child is twelve year old Bobby Hill (Pamela Adlon), a student at Tom Landry Middle School. Much to the chagrin of his football-loving father, Bobby has little interest in athletics and instead aspires to become a \"prop comic\".\nThroughout a good share of the series, Peggy's naïve and emotional niece Luanne Platter (Brittany Murphy), lives with the Hill family while her mother is in jail. Luanne attends beauty school and hosts a Christian-themed puppet show for a local cable-access TV station. She eventually finds employment and moves into a house on the same street as the Hill family, remaining very close to them. She engages in a relationship with and marries Elroy \"Lucky\" Kleinschmidt (Tom Petty), a snaggle-toothed lay about, who lives on the settlement he has earned from a frivolous lawsuit.\nHank has a healthy relationship with his mother, Tilly (Tammy Wynette, later Beth Grant and K Callan), a kind woman who moved to Arizona after divorcing Hank's father Cotton Hill (Toby Huss). In contrast, Hank has a strained relationship with his father, a cantankerous World War II veteran who lost his shins to Japanese machine gun fire and verbally abused Tilly during their marriage. Cotton later marries Didi (Ashley Gardner), a young candy striper, and they have a son, \"G.H.\" (\"Good Hank\"), who bears a striking resemblance to Bobby.\nEvery episode opens with Hank standing and drinking with three of his friends and neighbors Dale, Bill, and Boomhauer.\nDale Gribble (Johnny Hardwick; later Huss) is the Hills' chain-smoking, balding, conspiracy-theorist, next-door neighbor. He is married to Nancy Hicks-Gribble (Gardner), a weather reporter known for her good looks and charm. Dale is unaware that their only child, Joseph (Murphy, later Breckin Meyer, and later Tai Leclaire), is not his biological son, and is instead the result of Nancy's 14-year-long affair with John Redcorn (Victor Aaron; later Jonathan Joss), a Native American healer who has given her therapeutic massages for her \"headaches\" for years. Despite his inclination for conspiracy theories, Dale seems to be the only one in town unaware of the affair. His neighbors decide to keep Nancy's secret to preserve Dale and Joseph's loving relationship.\nBill Dauterive (Stephen Root) lives across from the Hills. Known as the \"Billdozer\" in his high-school football glory days, Bill is now overweight, bald, and clinically depressed, still struggling to get over his divorce with his ex-wife Lenore. He is a sergeant and barber in the Army. He idolizes Hank and pines for Peggy, often trying to insert himself in the family. His intense loneliness makes him gullible and desperate for attention.\nJeff Boomhauer (Judge) is an easy-going philanderer most notable for his unique speech pattern. Most of Boomhauer's lines are long-winded and meandering, delivered very quickly through a mumble and a very thick Texan accent. While the characters understand him just fine, the audience isn't necessarily meant to. His given name and occupation are not revealed until the end of the 13th season.\nIn the series' first season, the Souphanousinphones, a Laotian-American family, move in next door to the Hills. The family consists of the materialistic Kahn (Huss; later Ronny Chieng), his class-conscious wife Minh (Lauren Tom), and their tween daughter, Kahn \"Connie\" Jr. (Tom).\nKahn – who has a lucrative office job– is often at odds with his neighbors, believing them to be \"hillbillies\" and \"rednecks\" due to their lower socioeconomic status. Minh befriends Peggy and Nancy, though she still sees herself as superior to them. Connie has been pushed by her father to become a child prodigy and excels at a variety of things from academics to music, though she still finds plenty of time to be a kid despite the stress. She forms a close relationship with Bobby Hill, frequently hanging out with him and Joseph Gribble.\nOther minor characters include Buck Strickland (Root), Hank's licentious boss at Strickland Propane; Joe Jack (Huss) and Enrique (Danny Trejo), Hank's co-workers at Strickland; Carl Moss (Dennis Burkley), Bobby's principal at Tom Landry Middle School; and Reverend Karen Stroup (Mary Tyler Moore in her debut appearance, and then Ashley Gardner in regular appearances), the female minister of Arlen First Methodist.\nEpisodes\nProduction\nConception\n.]]\nIn early 1995, during the successful first run of Beavis and Butt-Head on MTV, Mike Judge decided to create another animated series, this one set in a small Texas town based on an amalgamation of Dallas suburbs, including Garland, where he had lived, and Richardson. Judge conceived the idea for the show, drew the main characters, and wrote a pilot script.\nThe Fox Broadcasting Company was uncertain of the viability of Judge's concept for an animated comedy based in reality and set in the American South, so the network teamed the animator with Greg Daniels, an experienced primetime TV writer who had previously worked on The Simpsons. Daniels rewrote the pilot script and created important characters who did not appear in Judge's first draft, including Luanne and Cotton. Daniels also reworked some of the supporting characters (whom the pair characterized as originally having been generic, \"snaggle-toothed hillbillies\"), such as making Dale Gribble a conspiracy theorist. While Judge's writing tended to emphasize political humor, specifically the clash of Hank Hill's social conservatism and interlopers' liberalism, Daniels focused on character development to provide an emotional context for the series' numerous cultural conflicts. Judge was ultimately so pleased with Daniels' contributions, he chose to credit him as a co-creator, rather than give him the \"developer\" credit usually reserved for individuals brought onto a pilot written by someone else.\nInitial success\nAfter its debut, the series became a large success for Fox and was named one of the best television series of the year by various publications, including Entertainment Weekly, Time, and TV Guide. For the 1997–1998 season, the series became one of Fox's highest-rated programs and even outperformed The Simpsons in the ratings that season, ranking 15th with an average of 16.3&nbsp;million viewers per episode. During the fifth and sixth seasons, Mike Judge and Greg Daniels became less involved with the show. They eventually refocused on it, even while Daniels became increasingly involved with other projects.\nFormat change\n{| class=\"wikitable plainrowheaders floatright\" style=\"max-width:20%;\"\n|+Showrunners throughout the series' run\n|-\n! scope=\"col\" | Season\n! scope=\"col\" | Showrunners\n|-\n! scope=\"row\" | 1–2\n| Mike Judge and Greg Daniels\n|-\n! scope=\"row\" | 3–4\n| Greg Daniels and Richard Appel\n|-\n! scope=\"row\" | 5\n| Richard Appel\n|-\n! scope=\"row\" | 6\n| Jonathan Aibel and Glenn Berger\n|-\n! scope=\"row\" | 7–13\n| John Altschuler and Dave Krinsky\n|-\n! scope=\"row\" | 14\n| Saladin K. Patterson\n|-\n|}\nJudge and Daniels' reduced involvement with the show resulted in the series' format turning more episodic and formulaic. Beginning in season seven, John Altschuler and Dave Krinsky, who had worked on the series since season two, took it over completely, tending to emphasize Judge's concept that the series was built around sociopolitical humor rather than character-driven humor. Although Fox insisted that the series lack character development or story arcs (a demand made of the network's other animated series, so that they can be shown out of order in syndication), Judge and Daniels had managed to develop minor arcs and story elements throughout the early years of the series, such as Luanne's becoming more independent and educated after Buckley's death, and the aging of characters being acknowledged (a rare narrative occurrence for an animated series).\nConnection to Bless the Harts\nBless the Harts, an animated series created for Fox, loosely shares a universe with King of the Hill, and features the Mega-Lo-Mart in the show. Story editors Christy Stratton and Emily Spivey for King of the Hill are involved in the show, although Judge is not. It premiered on September 29, 2019, and ended on June 20, 2021, due to Fox canceling the series after two seasons.\nFacing cancellation\nBecause it was scheduled to lead off Fox's Sunday-night animated programming lineup, portions of King of the Hill episodes were often pre-empted by sporting events that ran into overtime (the show was pre-empted more often than not by NFL football); in season nine especially, whole episodes were pre-empted. Ultimately, enough episodes were pre-empted that the majority of the series's 10th season—initially intended to be the final season—consisted of unaired ninth-season episodes. The 11th season was also meant to be the last, with a planned finale televised before it was renewed.\nThe 13th-season episode \"Lucky See, Monkey Do\" became the first episode of the series to be produced in widescreen high definition when it aired on February 8, 2009.\nCancellation\nAlthough ratings remained consistent throughout the 10th, 11th, and 12th seasons and had begun to rise in the overall Nielsen ratings (up to the 105th-most watched series on television, from 118th in season 8), Fox abruptly announced in 2008 that King of the Hill had been canceled, which coincided with the announcement that Seth MacFarlane, creator of Family Guy and American Dad!, would be creating a Family Guy spin-off called The Cleveland Show, which would take over ''King of the Hill's'' time slot.\nHopes to keep the show afloat surfaced as sources indicated that ABC (which was already airing Judge's new animated comedy, The Goode Family) was interested in securing the rights to the show, but in January 2009, ABC president Steve McPherson said he had \"no plans to pick up the animated comedy\".\nOn April 30, 2009, it was announced that Fox ordered at least two more episodes to give the show a finale. The show's 14th season was originally supposed to air sometime in the 2009–2010 season, but Fox later announced that it would not air the episodes, opting instead for syndication. On August 10, 2009, however, Fox released a statement that the network would air a series finale on September 13, 2009.\nRevival\nIn August 2017, Judge and Daniels were revealed to have talked with Fox executives about a potential revival. In an interview with Rotten Tomatoes the following March, Judge said he would want the revived series to include aged characters, such as an older Bobby. In March 2020, Daniels revealed that Judge and he had an idea for the reboot. Daniels stated: \"We do have a plan for it and it's pretty funny. So maybe one day.\" In March 2021, writer Brent Forrester stated that a reboot was currently underway, stating in a tweet: \"I am sure Greg Daniels and Mike Judge will murder me for sharing this but... HELL YES. They are in hot negotiations to bring back King of the Hill.\" The reboot will possibly feature \"aged-up characters\".\nIn January 2022, Judge and Daniels announced the formation of a new company called Bandera Entertainment, with a revival of King of the Hill being one of several series in development.\nDuring a panel at Comic-Con 2022, Judge stated that the show \"has a very good chance of coming back\". In September 2022, Fox Entertainment president Michael Thorn confirmed that the series would not air on Fox, with the reason being that Fox, which had split away from rights holder 20th Television Animation following the acquisition of 21st Century Fox by Disney, prefers to have full ownership of whatever new shows they air.\nOn January 31, 2023, a revival on Hulu was officially confirmed to be ordered. Judge, Najimy, Root, Adlon, and Tom were all expected to reprise their roles. With Murphy and Petty's deaths, how the characters of Luanne and Lucky would be handled was not announced, and whether Huss would return as Kahn was unknown. On May 1, 2023, Root had stated that the new revival will also have a time jump taking place years after the series finale where Bobby is \"older\". Hardwick was also confirmed to reprise his role as Dale Gribble, but died in August 2023 before any new episodes made it to air. Later, Hardwick was revealed to have recorded six episodes prior to his death.\nTo promote the revival, the San Antonio-based Alamo Beer Co. will be partnering with Hulu to release King of the Hill-inspired Alamo Beer, which will launch in 2025.\nA first-look poster for the new series was revealed online on May 14, 2025. Its premiere date of August 4, 2025, was revealed, as well as the show's updated opening credits sequence featuring adult Bobby, during a panel at the ATX Television Festival in Austin's Paramount Theater on May 30 that featured the cast and crew, including Judge, Daniels, Patterson, Adlon, Tom, and Huss. The same day, Judge and Daniels were reported to be executive producing the revival with showrunner Saladin Patterson, Michael Rotenberg and Howard Klein of 3 Arts, and Dustin Davis of Judge and Daniels' Bandera Entertainment, while Judge, Kathy Najimy, Pamela Adlon, Johnny Hardwick, Stephen Root, Lauren Tom, and Toby Huss would also return as voice actors. Huss will also replace Hardwick as the voice of Dale Gribble from in the seventh episode of the 14th season onwards.\nOn June 1, 2025, Jonathan Joss, John Redcorn's second voice actor, who was slated to return to the show, was shot and killed by a neighbor, following a confrontation outside his home in San Antonio, Texas. How the production team will move forward from this point is currently unclear. However, People noted afterwards that Joss did manage to return for the revival and had recorded lines for four episodes prior to his death. All ten episodes of season 14 premiered on Hulu on August 4, 2025. On August 26, 2025, it was reported that season 15 would premiere in 2026.\nOriginally, the revival was only expected to last two seasons. However, on October 30, 2025, it was announced that Hulu had renewed the series for seasons 16 and 17, and had ordered 20 additional episodes to stream after the conclusion of season 15. If the series continues to release ten episodes per year on Hulu, this renewal will take the show through 2028.\nSetting and opening sequence\nOpening sequence\nIn the opening sequence, Hank joins Dale, Bill, and Boomhauer in the alley behind his house. When he opens his can of beer, the playback speed increases greatly and depicts other main and secondary characters carrying out various daily activities around them in a time-lapse. Meanwhile, the four continue drinking beer and a nearby recycling bin fills with their empty cans. When Peggy brings a bag of garbage out to Hank, the other three leave and the playback returns to normal speed (which was sped up for the first half of the last few seconds of the introduction from seasons 4–13) as he takes it to the trash can and gathers with Peggy and Bobby in a parody of American Gothic. In the 14th season, the introduction has been changed to serve as a compressed timelapse of the events that occurred in between the 13th and 14th seasons, while maintaining the same increased playback speed and a similar start and end compared to the original.\nThe opening theme, \"Yahoos and Triangles\", is performed by Arizona rock band The Refreshments. Variations of the theme are used for special episodes, including season finales and Christmas episodes.\nSetting\n(back), Bobby, Hank, and their dog, Ladybird.]]\nKing of the Hill is set in the fictional town of Arlen, Texas, an amalgamation of numerous Dallas–Fort Worth suburbs, including Garland, Richardson, Arlington, and Allen. In addition to drawing inspiration from the DFW region, Judge has described Arlen as \"a town like Humble\" (a suburb of Houston). Time magazine praised the authentic portrayal as the \"most acutely observed, realistic sitcom about regional American life bar none\". In the episode \"Hank's Cowboy Movie\", the town's entrance sign lists its population as 145,300.\nThough Arlen is inspired by various Texas suburban communities, its specific location in Texas is never specified in the series. Similar to the location of Springfield on The Simpsons, the location of Arlen within Texas is arbitrarily based on the needs of a particular episode's plot, and multiple episodes give conflicting information as to Arlen's geographic location within the state. For example, one episode indicates that it is just north of the Brazos River in central Texas. Other episodes place it near Houston or Dallas, while others feature trips to Mexico and back taking place within a matter of hours. In the episode \"Harlottown\", the location is revealed to be somewhere on the Chisholm Trail. In all cases, the general location for Arlen coincides with the eastern half of the state as opposed to the western half, the latter being predominantly desert.\nThe Hills and other major characters reside on Rainey Street. Hank's friend and neighbor Bill Dauterive is a barber at Fort Blanda, a small army post near Arlen. Most of the children in the show attend Tom Landry Middle School; other schools depicted are Arlen High (home of the Longhorns) and Staubach Elementary. Early in the series, the school is referred to as being in the Heimlich County School District (according to markings on the school buses), though in later seasons, this is changed to Arlen Independent School District. The school's mascot is a longhorn steer.\nReception\nCritical response\nKing of the Hill received critical acclaim over its 13-year run. Early reviews of the show were positive, and it was named as one of the best new shows of 1997 by Entertainment Weekly, Time and TV Guide. Diane Holloway at the Chicago Tribune considered it the \"most Texan television series since Dallas\" and praised the show's \"sly sense of humor and subversive sensibility\". At the Los Angeles Times, writer Howard Rosenberg suggested that the show \"totes a few smiles, but [there's] little to bowl you over, and it takes a spell getting used to\". The show's first season received an approval rating of 87% on review aggregator Rotten Tomatoes, based on 31 reviews with an average rating of 7.3/10. Its consensus reads: \"King of the Hills mild yet extremely funny depiction of small-town Texas life is refreshingly worlds away from conventional prime-time animation.\" The fifth and thirteenth seasons received more critical praise with a 100% approval rating. The fourteenth season revival received similar critical acclaim. On Rotten Tomatoes, 98% of reviews from 48 critics were positive with an average rating of 8.60/10 and its consensus reads: \"Dang it Bobby! King of the Hill is back and still as flavorful as barbecue grilled with propane in a revival season that deftly brings these characters into the modern era.\"\nIn 2007, James Poniewozik included it on Times list of the 100 Greatest TV Shows, writing: \"The most acutely observed, realistic sitcom about regional American life bar none, this animated series is a lot like its protagonist, Texas propane salesman Hank Hill: it isn't flashy, never gets a lot of attention, but does its job year in and year out... Mike Judge makes Hank Hill funny in his pained Boy Scout rectitude without making him a figure of fun for it, and with its canvas of mega-stores and Laotian yuppies, the show sees modern America's fine detail like an electron microscope.\" At the show's conclusion, Poniewozik opined that it had \"quietly been the best family comedy on TV\", calling the show's ending \"one of the most moving things I've seen on TV this year\". Alan Sepinwall of The Star-Ledger described it as \"sweeter and more human than the great majority of live-action sitcoms that overlapped its run\". Genevieve Koski of The A.V. Club described it as a \"steadfast, down-to-earth series\" and contrasted it with other contemporary cartoons: \"King of the Hills characters aren't funny because they tell perfectly crafted jokes or make pop-culture references or constantly get themselves into ridiculous situations; they're funny because they have real hopes, flaws, and limitations that satirize the absurdity of everyday life while simultaneously celebrating it.\" She also noted that \"the show saw its fair share of silly conceits and contrived setups—and got fairly repetitive in the final seasons\".\nWriters have examined the show through a political lens. \"It's not a political show\", said Mike Judge in 1997. \"It's more a populist, common sense point of view.\" In 2005, Matt Bai of The New York Times Magazine called it \"the most subtle and complex portrayal of small-town voters on television\". A 2016 reappraisal from The Atlantic dubbed it the \"last bipartisan TV comedy\", with writer Bert Clere noting the program \"imbued all of its characters with a rich humanity that made their foibles deeply sympathetic. In this, King of the Hill was far ahead of its time, and the broader TV landscape has yet to catch up.\"\nAs of 2014, King of the Hill was ranked No. 27 on IGN's \"Top 100 Animated TV Series\". The publication also ranked it as No. 66 on their \"The Top 100 Best TV Shows of All Time\" list in 2023. In 2013, TV Guide ranked King of the Hill as one of the top 60 Greatest TV Cartoons of All Time.\nRatings\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\" colspan=\"2\"|Season\n! rowspan=\"2\"|No. ofepisodes\n! colspan=\"3\"|Originally aired\n! colspan=\"2\"|Nielsen ratings\n|-\n! Time slot (ET)\n! Season premiere\n! Season finale\n! Ranking\n! Viewers(in millions)\n|-\n| 1st\n| 1996–97\n| 12\n| rowspan=\"2\"|Sunday 8:30&nbsp;pm\n| January 12, 1997\n| May 11, 1997\n! No. 43\n! 8.6\n|- style=\"background:#f9f9f9;\"\n| 2nd\n| 1997–98\n| 23\n| September 21, 1997\n| May 17, 1998\n! No. 15\n! 16.3\n|- style=\"background:#f9f9f9;\"\n| 3rd\n| 1998–99\n| 25\n| Tuesday 8:00&nbsp;pm\n| September 15, 1998\n| May 18, 1999\n! No. 110\n! 7.9\n|- style=\"background:#f9f9f9;\"\n| 4th\n| 1999–2000\n| 24\n| rowspan=\"2\"|Sunday 7:30&nbsp;pm\n| September 26, 1999\n| May 21, 2000\n! No. 77\n! 8.7\n|- style=\"background:#f9f9f9;\"\n| 5th\n| 2000–01\n| 20\n| October 1, 2000\n| May 13, 2001\n! No. 68\n! 9.5\n|- style=\"background:#f9f9f9;\"\n| 6th\n| 2001–02\n| 22\n| Sunday 7:30&nbsp;pm Wednesday 8:00&nbsp;pm Sunday 8:30&nbsp;pm Sunday 7:00&nbsp;pm\n| November 11, 2001\n| May 12, 2002\n! No. 90\n! 7.7\n|- style=\"background:#f9f9f9;\"\n| 7th\n| 2002–03\n| 23\n| Sunday 8:30&nbsp;pm Sunday 7:30&nbsp;pm Sunday 7:00&nbsp;pm\n| November 3, 2002\n| May 18, 2003\n! No. 68\n! 9.5\n|- style=\"background:#f9f9f9;\"\n| 8th\n| 2003–04\n| 22\n| Sunday 7:30&nbsp;pm Sunday 7:00&nbsp;pm\n| November 2, 2003\n| May 23, 2004\n! No. 118\n! 6.4\n|- style=\"background:#f9f9f9;\"\n| 9th\n| 2004–05\n| 15\n| Sunday 7:00&nbsp;pm Sunday 9:30&nbsp;pm\n| November 7, 2004\n| May 15, 2005\n! No. 110\n! 4.8\n|- style=\"background:#f9f9f9;\"\n| 10th\n| 2005–06\n| 15\n| Sunday 7:30&nbsp;pm\n| September 18, 2005\n| May 14, 2006\n! No. 111\n! 5.2\n|- style=\"background:#f9f9f9;\"\n| 11th\n| 2006–07\n| 12\n| Sunday 8:30&nbsp;pm Sunday 7:30&nbsp;pm Sunday 7:00&nbsp;pm\n| January 28, 2007\n| May 20, 2007\n! No. 109\n! 5.5\n|- style=\"background:#f9f9f9;\"\n| 12th\n| 2007–08\n| 22\n| Sunday 8:30&nbsp;pm Sunday 7:00&nbsp;pm\n| September 23, 2007\n| May 18, 2008\n! No. 105\n! 6.6\n|- style=\"background:#f9f9f9;\"\n| 13th\n| 2008–09\n| 24\n| Sunday 8:30&nbsp;pm Sunday 7:30&nbsp;pm Sunday 8:00&nbsp;pm\n| September 28, 2008\n| September 13, 2009\n! No. 95\n! 6.0\n|}\nStreaming Viewership\nKing of the Hill ranked No. 1 on Hulu's \"Top 15 Today\" list—a daily updated list of the platform's most-watched titles—upon its Season 14 premiere on August 4. The series subsequently remained among the top five titles on Hulu, as of August 13. Season 14 garnered 4.4 million views worldwide in its first seven days of streaming, becoming the most-viewed adult animation season premiere on Hulu and Disney+ in five years. Nielsen Media Research, which records streaming viewership on U.S. television screens, reported that King of the Hill recorded 1.208 billion minutes of watch time, ranking as the second most-streamed program overall from August 4–10. The following week, from August 11–17, it garnered 714 million minutes of watch time, ranking as the third most-streamed original series. From August 18–24, King of the Hill recorded 567 million minutes of watch time, placing fourth among original series for that week. Nielsen further reported that King of the Hill was streamed for 424 million minutes from August 25–31, making it the seventh most-streamed original series of the week.\nThe revival also renewed interest in earlier seasons, with streaming viewership for Seasons 1 through 13 increasing by 41% and reaching a total of 26 million hours streamed between March and August 2025. The series has generated over $100 million in streaming revenue since 2020.\nAwards and nominations\n{| class=\"wikitable sortable plainrowheaders\"\n|-\n! scope=\"col\" | Year\n! scope=\"col\" | Award\n! scope=\"col\" style=\"width:40%;\" | Category\n! scope=\"col\" style=\"width:30%;\" | Nominee(s)\n! scope=\"col\" | Result\n|-\n| rowspan=\"8\"|1997 || rowspan=\"6\"|Annie Awards || Best Animated TV Program || 20th Century Fox and Film Roman ||\n|-\n| Best Individual Achievement: Directing in a TV Production || John Rice () ||\n|-\n| Best Individual Achievement: Voice Acting by a Female Performer in a TV Production || Brittany Murphy () ||\n|-\n| Best Individual Achievement: Voice Acting by a Male Performer in a TV Production || Mike Judge () ||\n|-\n| rowspan=\"2\"|Best Individual Achievement: Writing in a TV Production || Paul Lieberstein () ||\n|-\n| Alan R. Cohen and Alan Freedland () ||\n|-\n| Primetime Emmy Awards || Outstanding Animated Program (For Programming One Hour or Less) || Greg Daniels, Mike Judge, Howard Klein, Michael Rotenberg, et al. () ||\n|-\n| TCA Awards || Outstanding Achievement in Comedy || King of the Hill ||\n|-\n| rowspan=\"7\"|1998 || rowspan=\"2\"|Annie Awards || Outstanding Achievement in an Animated Primetime or Late Night Television Program || 20th Century Fox Television, Deedle-Dee Productions, Judgemental Films, and 3 Arts Entertainment ||\n|-\n| Outstanding Individual Achievement for Voice Acting by a Female Performer in an Animated Television Production || Kathy Najimy () ||\n|-\n| BMI Film & TV Awards || BMI TV Music Award || John O'Connor, Roger Neill, and Lance Rubin ||\n|-\n| Kids' Choice Awards || Favorite Cartoon || King of the Hill ||\n|-\n| rowspan=\"2\"|Golden Reel Award || Best Sound Editing – Television Animated Specials || \"The Unbearable Blindness of Laying\" ||\n|-\n| Best Sound Editing – Television Animation – Music || King of the Hill ||\n|-\n| Primetime Emmy Awards || Outstanding Animated Program (For Programming One Hour or Less) || Greg Daniels, Mike Judge, Howard Klein, Michael Rotenberg, et al. () ||\n|-\n| rowspan=\"3\"|1999 || rowspan=\"2\"|Annie Awards || Outstanding Achievement in an Animated Television Program || 20th Century Fox Television ||\n|-\n| Outstanding Individual Achievement for Writing in an Animated Television Production || Jim Dauterive () ||\n|-\n| Primetime Emmy Awards || Outstanding Animated Program (For Programming One Hour or Less) || Greg Daniels, Mike Judge, Howard Klein, Michael Rotenberg, Richard Appel, et al. () ||\n|-\n| rowspan=\"4\"|2000 || rowspan=\"4\"|Annie Awards || Outstanding Individual Achievement for Directing in an Animated Television Production || Kyoung Hee Lim and Boo Hwan Lim () ||\n|-\n| Outstanding Individual Achievement for Voice Acting by a Female Performer in an Animated Television Production || Brittany Murphy () ||\n|-\n| Outstanding Individual Achievement for Voice Acting by a Male Performer in an Animated Television Production || Mike Judge () ||\n|-\n| Outstanding Individual Achievement for Writing in an Animated Television Production || Garland Testa () ||\n|-\n| rowspan=\"4\"|2001 || American Comedy Awards || Funniest Television Series – Animated || King of the Hill ||\n|-\n| rowspan=\"2\"|Annie Awards || Outstanding Individual Achievement for Voice Acting by a Female Performer in an Animated Television Production || Kathy Najimy () ||\n|-\n| Outstanding Individual Achievement for Writing in an Animated Television Production || Garland Testa () ||\n|-\n| Primetime Emmy Awards || Outstanding Animated Program (For Programming Less Than One Hour) || Greg Daniels, Mike Judge, Richard Appel, Howard Klein, Michael Rotenberg, et al. () ||\n|-\n| rowspan=\"4\"|2002 || rowspan=\"2\"|Annie Awards || rowspan=\"2\" |Outstanding Writing in an Animated Television Production || Norm Hiscock () ||\n|-\n| Kit Boss () ||\n|-\n| rowspan=\"2\"|Primetime Emmy Awards || Outstanding Voice-Over Performance || Pamela Adlon () ||\n|-\n| Outstanding Animated Program (For Programming Less Than One Hour) || Greg Daniels, Mike Judge, Richard Appel, Howard Klein, Michael Rotenberg, et al. () ||\n|-\n| rowspan=\"3\"|2003 || Annie Awards || Outstanding Writing in an Animated Television Production || Tony Gama-Lobo and Rebecca May () ||\n|-\n| GLAAD Media Awards || Outstanding Individual Episode (In a Series Without a Regular Gay Character)|| \"My Own Private Rodeo\" ||\n|-\n| Writers Guild of America Awards || Animation || Alex Gregory and Peter Huyck () ||\n|-\n| rowspan=\"3\"|2004 || rowspan=\"2\"|Annie Awards || Voice Acting in an Animated Television Production || Brittany Murphy () ||\n|-\n| Writing in an Animated Television Production || Etan Cohen () ||\n|-\n| Writers Guild of America Awards || Animation || Tony Gama-Lobo and Rebecca May () ||\n|-\n| 2005 || Annie Awards || Best Voice Acting in an Animated Television Production || Johnny Hardwick () ||\n|-\n| rowspan=\"2\"|2006 || Annie Awards || Best Animated Television Production || 20th Century Fox Television ||\n|-\n| Teen Choice Awards || TV – Choice Animated Show || King of the Hill ||\n|-\n| rowspan=\"2\"|2007 || People's Choice Awards || Favorite TV Comedy – Animated || King of the Hill ||\n|-\n| Writers Guild of America Awards || Animation || Jim Dauterive () ||\n|-\n| rowspan=\"5\"|2008 || Annie Awards || Best Animated Television Production || 20th Century Fox Television ||\n|-\n| People's Choice Awards || Favorite Animated TV Comedy || King of the Hill ||\n|-\n| Primetime Emmy Awards || Outstanding Animated Program (For Programming Less Than One Hour) || Mike Judge, Greg Daniels, John Altschuler, Dave Krinsky, Jim Dauterive, Garland Testa, et al. () ||\n|-\n| rowspan=\"2\"|Writers Guild of America Awards || rowspan=\"2\"|Animation || Jim Dauterive () ||\n|-\n| Tony Gama-Lobo and Rebecca May () ||\n|-\n| rowspan=\"3\"|2009 || Prism Awards || Comedy Episode || \"Dia-BILL-ic Shock\" ||\n|-\n| rowspan=\"2\"|Writers Guild of America Awards || rowspan=\"2\"|Animation || Jim Dauterive () ||\n|-\n| Dan McGrath () ||\n|}\nHome media\nThe first six seasons were released on DVD by 20th Century Fox Home Entertainment from 2003 to 2006. The seventh season was originally planned to be released in late 2006, but most likely due to poor sales of the DVDs, the release was canceled. However, 8 years later in 2014, Olive Films acquired the sub-license to release future seasons of the show, and seasons seven and eight were released on November 18, of that same year, with nine and ten released on April 7, 2015, eleven released on August 25, 2015, twelve released on September 22, 2015, and thirteen released (also Blu-ray) on October 20, 2015.\nNetflix and Fox streamed all episodes, but stopped streaming on October 1, 2013, and in early 2017, the series was removed from iTunes and Google Play, though it returned to the latter later that year. As of May 2018, all episodes were again removed from Google Play and iTunes.\nOn November 1, 2018, all episodes became available for streaming on Hulu in the US. In some countries, the series was unavailable to stream or buy digitally, since Hulu is only available in the United States. However in 2022, the series was made available internationally on Disney+ through the Star hub.\n{| class=\"wikitable\"\n|-\n! rowspan=\"2\" | Title\n! rowspan=\"2\" | Episodes\n! colspan=\"3\" | DVD release date\n! rowspan=\"2\" | Blu-ray release date\n|-\n!\n!\n!\n|-\n| The Complete First Season\n|\n| July 1, 2003\n| March 13, 2006\n| March 15, 2006\n|\n|-\n| The Complete Second Season\n|\n| November 11, 2003\n| March 13, 2006\n| May 23, 2006\n|\n|-\n| The Complete Third Season\n|\n| December 28, 2004\n| August 28, 2006\n| September 26, 2006\n|\n|-\n| The Complete Fourth Season\n|\n| May 3, 2005\n| January 15, 2007\n| June 19, 2007\n|\n|-\n| The Complete Fifth Season\n|\n| November 22, 2005\n| February 26, 2007\n| April 23, 2008\n|\n|-\n| The Complete Sixth Season\n|\n| May 2, 2006\n| July 27, 2015\n|\n|\n|-\n| The Complete Seventh Season\n|\n| November 18, 2014\n| July 27, 2015\n|\n|\n|-\n| The Complete Eighth Season\n|\n| November 18, 2014\n| August 24, 2015\n|\n|\n|-\n| The Complete Ninth Season\n|\n| April 7, 2015\n| August 24, 2015\n|\n|\n|-\n| The Complete Tenth Season\n|\n| April 7, 2015\n| February 29, 2016\n|\n|\n|-\n| The Complete Eleventh Season\n|\n| August 25, 2015\n| February 29, 2016\n|\n|\n|-\n| The Complete Twelfth Season\n|\n| September 22, 2015\n| March 28, 2016\n|\n|\n|-\n| The Complete Thirteenth Season\n|\n| October 20, 2015\n| April 4, 2016\n|\n| October 20, 2015\n|}\nThe show aired in broadcast syndication from 2001 to 2019. From September 2004 to December 2008, FX aired the series daily nationwide. The show later aired on Cartoon Network's late-night programming block Adult Swim from January 1, 2009, to June 29, 2018. The series then aired short-lived reruns on Comedy Central and CMT from July 24, 2018, until November 2019, when the series was pulled from their lineups. However, the series joined FXX's lineup on September 20, 2021; shortly thereafter, Adult Swim regained partial syndication, and so FXX and Adult Swim share the syndication rights as of November 22, 2021.\nVideo games\nA video game based on the series was released on November 13, 2000, for the PC. The player goes on a hunting trip with Hank and the gang where the player must hunt for various animals. The game received mixed to negative reviews. The characters also appeared in a crossover game, Animation Throwdown: The Quest for Cards, which features not only King of the Hill, but also Family Guy, American Dad!, Futurama, ''Bob's Burgers, and Archer. They are also playable characters in a 2022 racing game, Warped Kart Racers, also featuring Family Guy and American Dad!, as well as Solar Opposites. Hank Hill also appears as an outfit in Fortnite.\nReferences\nArchival sources\n* [http://www.thewittliffcollections.txstate.edu/research/a-z/dauterive.html The King of the Hill Production Archive] 1995–2006 (75 linear ft) is housed at the Wittliff Collections, Texas State University in San Marcos.\nExternal links\n*\n*\n*[https://archive.today/20121206002047/http://www.bcdb.com/cartoons/Other_Studios/F/Film_Roman_Productions/King_of_the_Hill/index.html King of the Hill] at the Big Cartoon DataBase\n*[https://web.archive.org/web/20181015003104/http://www.cc.com/shows/king-of-the-hill King of the Hill] at Comedy Central\n* [https://www.hulu.com/series/king-of-the-hill-52b8dd8a-eff2-4ed2-9b8d-7c0039df1c53 King of the Hill''] on Hulu"
    }
  ]
}