{
  "content": [
    {
      "type": "text",
      "text": "# King Star King\n\n| creator              = JJ VillardEric Kaplan (pilot co-creator)\n| developer            = Tommy Blacha\n| director             = JJ Villard\n| creative_director    = Antonio Canobbio (series only)\n| voices               = (See Voices)\n| composer             =\n| country              = United States\n| language             = English\n| num_episodes         = 6 (+1 pilot and 1 special)\n| list_episodes        =\n| executive_producer   =\n}}\n| producer             =\n| editor               =\n|Jukka Montonen and J. J. Villard\n|Paul D. Calder\n}}\n| runtime              = 11 minutes approx.22 minutes (special)\n| company              =\n|Titmouse, Inc.\n|Williams Street\n|Villard Film\n}}\n| channel              =\n| first_aired          =\n| last_aired           =\n}}\nKing Star King is an American adult animated web series created by JJ Villard for Cartoon Network's nighttime programming block Adult Swim. The series aired on the network's online video streaming service Adult Swim Video on June 15, 2014 before it was aired on TV. Eric Kaplan also worked on the series' pilot episode.\nVillard would later create ''JJ Villard's Fairy Tales for Cartoon Network Studios and Adult Swim. A TV special sequel using the same visual style titled King Star King!/!/!/ aired on February 13, 2023 on Adult Swim.\nSynopsis\nThe series revolves around the titular character, King Star King (Tommy Blacha): a tall, blond muscular man. After seducing his love, Princess Snow White, he falls from his higher plane of existence to serve as a fry cook in a run-down waffle house. In order to reclaim his place in the heavens, he must battle his amnesia to defeat the evil Spring Bunny (Eric Kaplan) and rescue Snow White.\nProduction\nThe series was created by Jean-Jacques Villard, who typically goes by \"J.J. Villard\". He was born in Europe, and once attended the California Institute of the Arts. He was previously known for his work on films for DreamWorks Animation, including Shrek the Third, Monsters vs. Aliens, and Shrek Forever After''. He often cited the likes of Bob Clampett, Tex Avery, Max Fleischer, Mike Judge, John R. Dilworth, Jhonen Vasquez, Chuck Jones, Joe Murray, Dr. Seuss, Matt Groening, Stephen Hillenburg, Danny Antonucci, Maxwell Atoms, Doug TenNapel, John Kricfalusi, Walt Disney, Ralph Bakshi, Genndy Tartakovsky, Christy Karacas, and Robert Crumb as influences for his work. The pilot was announced preceding the network's 2012 upfront as part of their development slate. It was also disclosed during the upfront, and was reported again before the network's upfront the following year. It was announced as a web series for Adult Swim Video to premiere June 15, 2014; the series was advertised as \"too shexxxy \" for television. The network conducted an online poll whether episodes should be released daily or all at once; on June 11, the network announced it would release all six episodes of the first season simultaneously. A sweepstake for the series was announced on June 9, promoting six chances to win original artwork by Villard.\nThe series was animated using Adobe Flash by Titmouse, Inc. with ink and paint services made by Cyber Chicken Studios in South Korea and produced by J. J. Villard's vanity card, Kurtis; Mirari Films's Romanian facilities provided animation for the pilot episode, while the special was animated by Digital eMation In an interview at the 2013 Comic-Con, Villard dubbed the titular character as \"He-Man on drugs\". Series developer Tommy Blacha went on to describe comments with the network's Standards and Practices to \"better tell [the show].\" When asked about the inspiration for the series, Blacha joked that Villard pitched the series to network executive Mike Lazzo with a drawing of the protagonist, to which he approved production of the pilot. The two explained that as Villard started working on it with another producer and driving Lazzo \"crazy,\" he abandoned the pilot; this led to Blacha joining as producer and toning it down by \"two percent.\"\nVoices\n* Tommy Blacha – King Star King, Hank Waffles (2014), Gurbles, Fat Frank, Mike Balls, KWA KWA\n* Robin Atkin Downes – Narrator, Alfonso Molestro, Doctor, Chunkles, Hank's Mother, Tim Tumor, Carmine Excrementi, Pinchy Laroux, God Star God (2014)\n* J. J. Villard – Pooza, Customer, Surfer\n* Rachel Butera – Princess Snow White (2014), Slutty Waitress, Baroness Sludgeclot, Smear, Mrs. Balls, Burger Bitch\n* Mallory McGill – Princess Snow White (2013)\n* Eric Kaplan – Spring Bunny, Scrod\n* Will Sasso – Eddie 5 Antlers\n* Justin Roiland – Hank Waffles (2023 special), Cop\n* Robert Englund – Jeff Bezos\n* Andie MacDowell – Katrina\n* John Waters – God Star God (2023 special)\nEpisodes\n| color1     = #802020\n| link1      = #Series (2014)\n| episodes1  = 6\n| start1     =\n| end1       =\n| color2S    = #5F0909\n| link2S     = #Special (2023)\n| linkT2S    = Special\n| episodes2S = 1\n| start2S    =\n}}\nPilot (2013)\n|ShortSummary=The pilot introduces King Star King, who (while attempting to declare his love for Snow White) gets kicked out from the realms of gods to serve as a fry cook at a waffle joint.\n|LineColor=9A9A9A\n}}\n}}\nSeries (2014)\n|OriginalAirDate=\n|ProdCode=101\n|ShortSummary=When Princess Snow White gets decapitated by the evil Alfonzo Molestro, King Star King and his crew must battle him for her body before it rots away.\n|LineColor=802020\n}}\n|OriginalAirDate=\n|ProdCode=102\n|ShortSummary=Hank Waffles, Gurbles and Pooza are forced to babysit Chunkles and Smear at the Waffle Zone; meanwhile, King Star King and Baroness Sludgeclot go on a date.\n|LineColor=802020\n}}\n|OriginalAirDate=\n|ProdCode=103\n|ShortSummary=King Star King and his crew run into trouble at Fat Frank's Fantasy Lounge.\n|LineColor=802020\n}}\n|OriginalAirDate=\n|ProdCode=104\n|ShortSummary=King Star King must harden a cowardly alien by the name of Mike Balls in order to defeat his enemy, Tim Tumor.\n|LineColor=802020\n}}\n|OriginalAirDate=\n|ProdCode=105\n|ShortSummary=King Star King hatches into a new and improved version of himself; meanwhile, during spring break, Hank Waffles falls in love with the Burger Bitch.\n|LineColor=802020\n}}\n|OriginalAirDate= (digital retailers)\n|ProdCode=106\n|ShortSummary=In order to save the world, King Star King and his crew of strange heroes must escape a strange alien city located inside the head of a petty thief that they get sucked into.\n|LineColor=802020\n}}\n}}\nSpecial (2023)\n|ShortSummary=Years after the events of the series, King Star King has become a fat, bald, middle-aged slob with a family (a loving housewife, and two preteen children), a mortgage and a job at Amazon. He must team up with his old friends Hank Waffles, Pooza, and Gerbils on a dimension-spanning adventure to save his family.\n|LineColor=5F0909\n}}\n}}\nRelease and reception\nThe pilot was screened at the 2013 San Diego Comic-Con, along with a panel hosted by Villard and Blacha. In July 2013, it was released online as part of a presentation of in-development shows for the network, partnered with KFC; viewers could vote for their favorite pilot, with the winner being broadcast on August 26, 2013. The series lost to Übermansion, a Stoopid Buddy Stoodios production, although the presentation won an Internet Advertising Campaign Award in 2014 for \"Best TV Integrated Ad Campaign\". Nevertheless, the pilot aired on the network's Toonami block on November 3, 2013 during the daylight saving time transition; Nielsen ratings were not captured during this period.\nMeredith Woerner of io9 said that the series gained their approval at its description of a \"punk rock He-Man\". Conversely, upon surveying the show's description, Patrick Kevin Day of the Los Angeles Times official blog dubbed the network a \"home for stupid characters\".\n}}\nExternal links\n*\n*\n* [https://web.archive.org/web/20140109202307/http://video.adultswim.com/pilots/king-star-king-ksk.html King Star King pilot] on Adult Swim Video"
    }
  ]
}