{
  "content": [
    {
      "type": "text",
      "text": "# King of the World (biography)\n\nKing of the World is a 1998 biography of Muhammad Ali written by David Remnick with a special focus on the period in Ali's life from his victory in the Olympics to his second fight with Sonny Liston. It has been described as \"a book about a boxer, not a book about boxing.\"\nDuring this time, the two prominent boxing contemporaries of Ali were Floyd Patterson and Sonny Liston. Patterson had the reputation of being a \"Good Negro\" and Liston that of a \"Bad Negro.\" Ultimately Ali would transcend both stereotypes. In an interview with the author, Ali stated: \"I had to prove you could be a new kind of black man. I had to show that to the world.\"\nAccording to a review of the book in The New York Times, ... explores the difference between the civil rights movement, founded on democratic principles, and the self-sufficient, fiercely independent Black Is Beautiful movement that caught fire with Ali, captured the imagination of his generation and gave him the courage to refuse the draft, thereby sacrificing his precious championship, facing the prospect of five years in jail and, while appealing his case on the grounds of conscientious objection, being deprived of the license without which he could not ply his trade... How Ali finally won vindication in the Supreme Court of the United States, 8-zip, how he came back to the ring slower and inevitably more hittable but winning his title back again, and how after the tide turned against our Vietnam misadventure the unpatriotic sinner of the 60's each year grew in stature as a man of honor and respect – maybe only a prophet could have foreseen these events.As Remnick ties it all together in King of the World, building on all those books and articles and transcripts, along with personal interviews, it doesn't read like the case history of a man (although the man is here in living colors, sometimes funny as hell) but of a comic and cosmic superman.}}\nReferences"
    }
  ]
}