{
  "content": [
    {
      "type": "text",
      "text": "# King's Scout\n\n-->\n| location         =\n| country          = Commonwealth (including the United Kingdom, Canada, Australia, and New Zealand)\n| presenter        =\n| host             =\n| former name      =\n| preshow_host     =\n| acts             =\n| reward           =\n| year             =\n| year2            =\n| holder_label     =\n| holder           =\n| most_awards      =\n| most_nominations =\n| award1_type      =\n| award1_winner    =\n| award2_type      =\n| award2_winner    =\n| award3_type      =\n| award3_winner    =\n| award4_type      =\n| award4_winner    =\n| award5_type      =\n| award5_winner    =\n| website          =\n| network          =\n| runtime          =\n| viewership       =\n| producer         =\n| director         =\n| image2           =\n| image2size       =\n| alt2             =\n| caption2         =\n| previous         =\n| main             =\n| next             =\n}}\nA '''King's Scout (also known as Queen's Scout during the reign of Elizabeth II) is a Scout who has attained the King's Scout Award'''. The King's Scout Award is the highest youth award achievable in the Scouting movement in the Commonwealth realms, including the United Kingdom, Canada (King's Venturer Award), Australia, and New Zealand (King's Scout Kauri Award), where Scouts operate under the patronage of King Charles III. Whether the award recipient is a Queen's or King's Scout depends on who is the current monarch of the Commonwealth realms.\nInitially the award required demonstrated proficiency in standardised Scoutcraft and skills useful for service to others and the nation. The current requirements are different in each country and now focus on personal development and typically involve achieving challenges from several areas such as community involvement, adventurous activities, personal growth and leadership development. King's Scouts are entitled to attend one King's Scout Parade held at Windsor Castle each year held on the Sunday closest to St George's Day; this is the only time when Scouts officially march.\nHistory\nIn November 1909, King Edward VII approved Robert Baden-Powell's request that boys who passed special tests for efficiency be ranked as \"King's Scouts\". A badge with a crown signified the award as a \"King's Scout\", on the left sleeve. The First Class Scout had to pass the Guide's badge, and any three of: Ambulance, Bugler, Cyclist, Marksman, Seaman, and Signaller. From 1911, it was proposed that one troop from each of the countries of the United Kingdom, Canada, Australia, New Zealand, and South Africa would be awarded a Challenge Standard of the name of \"King's troop\", where the troop had no less than 24 boys, and each King's Scout must have been a member of the troop for at least six months.\nFrom early-1919 to at least the mid-1920s, there briefly existed a \"King's Sea Scout\" badge for the Sea Scout branch alongside the King's Scout Award. Badges for both could be earned by a Sea Scout. After the formal establishment of the Senior Scout section in 1946, only Senior Scouts (or Boy Scouts over 15 years of age) could become King's Scouts. Under the reign of Elizabeth II the uniform award emblem normally consisted of a stylised St Edward's Crown. The award was renamed from King's Scout to Queen's Scout by April 1952, with the succession and approval of Queen Elizabeth II. Since 1947, individuals who achieve the King's Scout or Queen's Scout award receive a certificate with a facsimile signature of the monarch at that time. The certificate for a King's Scout, headed by a stylised Royal coat of arms of the monarch, stated:\n:AS A KING'S SCOUT you have prepared yourself for service to God and your fellow-men, and have shown yourself a worthy member of the great SCOUT BROTHERHOOD. I wish you God-speed on your journey through life; may it prove for you a joyous adventure.\nUnited Kingdom\nThe King's Scout Award in the United Kingdom is the ultimate goal of a progressive award scheme and is achieved by completing the following requirements through The Scout Association:\n* Be 16 or over to start this award and be under 25 to complete it as well as still being a member of the Association.\n* Be a member of Explorer Scouts or the Scout Network or both for at least 18 months.\n* Complete 18 nights away as an Explorer Scout or member of the Scout Network, of which 12 must be camping.\n* Complete six activities from a list of International, Environment and Values activities, two from each topic area.\n** Holders of the Chief Scout's Platinum Award only need to complete four activities from the list, and holders of the Chief Scout's Diamond Award only need to complete two. The activities should be different from those completed as part of the other awards.\n* Hold the Gold Duke of Edinburgh's Award, or complete the five King's Scout Award Challenges, which are:\n** Take up a Skill for 6 or 12 months and show progress and lasting interest.\n** Take up a Physical Activity for 6 or 12 months.\n** All members should complete 12 months of either the Physical or the Skill.\n** Provide Service to an individual or the community for 12 months.\n** Plan, complete and review a four-day and three-night expedition in open or adventurous country by foot, cycle, horse, canoe, kayak, boat or dinghy.\n** Complete a five-day and four-night residential project in an unfamiliar environment with people who are not known.\n* Following completion of the first four elements of the Award, make a presentation, to a suitable audience, of your achievements so far in working towards the King's Scout Award.\nExplorer Scouts and members of the Scout Network who are not holders of the Duke of Edinburgh's Silver Award or the Chief Scout's Diamond Award must complete an extra six months in either the Service or the longer of the Skills or Physical Recreation Challenge. Upon the succession of King Charles III in September 2022, the award in the United Kingdom was renamed \"King's Scout\". The first King's Scout in England was awarded to patrol leader Victor Watkins, of Broadstone, Dorset, on or before January 1910. The first person to hold both the Queen's Guide Award and the Queen's Scout Award was Susan Parker of 1st Brantham Panthers Venture Scout Unit in 1980.\nAustralia\nHistorically, it is given the first Australasian King's Scout was in New Zealand by August 1910.  By October 1910, at least one troop in Australia had two King's Scouts, the 1st Kensington Troop, Adelaide.  The first King's Scout in Queensland was awarded by June 1911.  Those scouts were then eligible to complete 21 badges to be awarded the 'Silver Wolf'.\nThe Award Scheme is designed for Venturer Scouts, formerly called Senior Scouts.  Its aim is to widen the interests and knowledge of Venturer Scouts. Its rationale is based on the aim and methods of Scouting allowing fun, variety, personal choice and to assist in planning for a balanced program. It is a system designed to be challenging and encouraging for people over a wide range of activities. The Queen's Scout Award requires the Scout to complete a number of achievements in the Venturer Scout Award Scheme. These are:\n* Completion of Program Essentials – Milestone 3\n* Twelve progressions in the Outdoor Adventure Skills. This must include achieving at least Stage 5 in each of the Core skills of:\n** Bushcraft (Pioneering and/or Survival Skills),\n** Bushwalking, and Camping, if not previously completed\n** This must include at least four achievements of Stage 4 or higher in any stream\n* Six Special Interest Area projects\n* An Adventurous Journey\n* A Leadership or Personal Development Course\n* A Personal Reflection\nApproval may be required from the youth member's unit council, the district venturer council or a separate examiner. This peer review aims to maintain good standards for the award. A number of the requirements of the Venturer Scout Award Scheme, and thus the peak award itself, are mapped to competencies in the Australian Qualifications Framework (AQF), which allows award recipients to apply for several nationally-recognised qualifications in vocational areas such as Business, Active Volunteering and Outdoor Recreation.\nAn adult leader who has earned the King's Scout Badge, the Queen's Scout Badge or the Queen's Scout Award (as a youth member) is entitled to wear a miniature replica of the cloth badge on their uniform. Following the death of her Majesty, Queen Elizabeth II, it was announced in September 2024, the award would be renamed from the \"Queen's Scout Award\" to the \"King's Scout Award\" by King Charles III when he accepted the Royal Patronage of the Scout Association of Australia.\nCanada\nInitially the King's Scout Award, Scouts Canada changed the Queen's Scout Award (during the reign of Queen Elizabeth II) into the Queen's Venturer Award in 1968, when the Scout programme was divided into the Scout and Venturer programmes. The award is presented to venturers who have acquired competence and skills that will be of considerable use to themselves, their company, and their community. These venturers will have also been recognized by the company, the advisor, and Scouts Canada as being worthy of receiving the award. The certificate is signed by the governor general of Canada, in the official capacity as the Chief Scout of Canada.\nHong Kong\n.]]\nThe Queen's Scout award was awarded in Hong Kong for the Venture Scout section before 1 April 1997. The Royal Certificate (Queen's Scout Award certificate) was awarded in the Hong Kong Scout Rally or on St George's Day (before 1987), by the Governor of Hong Kong. A Scout Leader who was awarded the Queen's Scout Award could have worn a Queen's Scout Leader's insignia on their uniform. After 1997, it was replaced with the HKSAR Scout Award. The name of the current award was revised again in 2008, due to the outbreak of SARS in Hong Kong, to the Dragon Scout Award.\nMalaysia\nUntil 1957, Malaya was part of the British Empire, and scouts may have been earned the King's Scout or Queen's Scout Award.  Since gaining independence from the United Kingdom, Malaysia's King's Scout Award is conferred in the name of the Royal Patron of the Scouts Association of Malaysia, His Majesty the Yang di-Pertuan Agong (unofficially, the King of Malaysia). The King's Scout Certificate is signed by His Majesty the Yang di-Pertuan Agong of Malaysia and all the sultans in Malaysia.\nNew Zealand\nThe first King's Scout in New Zealand was Sergeant Rennie, First Woolston Troop; and given to be the first scout in Australasia. Venturer section members were eligible to achieve the King's Scout Badge, then from 1952, the Queen's Scout Award.  It included completing modules on road safety, environmental awareness, personal development and community service.  In 2020, the award was renamed as the Queen's Scout Kauri Award.\nSingapore\nUntil 1963, Singapore was part of the British Empire, then becoming part of Malaysia, and in 1965, becoming its own republic.  Before 1965, scouts earned the King's Scout (1926–1951) or Queen's Scout (1952–1966) Awards.  After independence, the award was renamed the 'President's Scout Award' in 1967.  This award is separate to the Rover Scout section's  Award.\nSouth Africa\nScouts in South Africa earned the King's Scout (1910–1951) or Queen's Scout (1952–1961) Awards.  Upon becoming the Republic of South Africa on 31 May 1961, the award's name and insignia was changed to the Springbok Award.\nSee also\n* Queen's Guide Award\n* List of highest awards in Scouting\nReferences"
    }
  ]
}