{
  "content": [
    {
      "type": "text",
      "text": "# Kingsville, Ontario\n\n| subdivision_name1        =\n| subdivision_name2        = Essex\n| leader_title             = Mayor\n| leader_title1            = MP\n| leader_title2            = MPP\n| leader_name              = Dennis Rogers\n| leader_name1             = Chris Lewis (CPC)\n| leader_name2             = Anthony Leardi (PC)\n| established_title        = Incorporated\n| established_date         = 1901\n| area_magnitude           =\n| area_footnotes           =\n| area_total_km2           =\n| area_land_km2            = 246.83\n| area_water_km2           =\n| population_as_of         = 2016\n| population_footnotes     =\n| population_total         = 21552\n| population_density_km2   = 87.3\n| timezone                 = Eastern (EST)\n| utc_offset               = -5\n| timezone_DST             = EDT\n| utc_offset_DST           = -4\n| postal_code_type         = Forward sortation area\n| postal_code              = N9Y\n| area_codes                = 519 and 226\n| coordinates              =\n| elevation_m              = 200.00\n| elevation_footnotes      =\n| website                  = [http://www.kingsville.ca/ www.kingsville.ca]\n| footnotes                =\n}}\nKingsville is a town in Essex County, Ontario, Canada.\nIt is best known for being \"Canada's Southernmost Town.\"\nThe town had a population of 22,119 in the Canada 2021 Census, a 2.6% increase from the previous census figure of 21,552 in 2016.\nHistory\nKingsville was incorporated as a town in 1901. It was named for Colonel James King, an early settler who was instrumental in the establishment of the community.\nOn January 1, 1999, it was amalgamated with the adjoining Townships of Gosfield North and Gosfield South to form an expanded municipality.\nGeography\nKingsville—the country's southernmost town—lies on the north shore of Lake Erie. The town of Lakeshore is to the north, the municipality of Leamington is to the east, and the town of Harrow is to the west.\nThe town is approximately 570 feet above sea level. Long stretches of the coastline are elevated above Lake Erie. However, the terrain is generally flat, and consists of glacial drift—a mixture of various rocks, sand and clay.\nCommunities\nIn addition to the primary settlement at Kingsville, the municipality also includes the smaller communities of Cedar Beach, Cedar Island, Cedarhurst Park, Cottam, Klondyke, Linden Beach, North Ridge, Olinda, Ruthven and Union. The community of Albuna is located on the boundary between Kingsville and Leamington, and the communities of Arner and Elford are located on the boundary between Kingsville and Essex.\nClimate\n|date=August 2010\n}}\nDemographics\nIn the 2021 Census of Population conducted by Statistics Canada, Kingsville had a population of  living in  of its  total private dwellings, a change of |21552|1}} from its 2016 population of . With a land area of , it had a population density of  in 2021.\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" | Canada 2006 Census!! Population !! % of Total Population\n|-\n| rowspan=\"12\" | Visible minority groupSource: || South Asian || 0 ||\n|-\n| Chinese || 30 ||\n|-\n| Black || 190 ||\n|-\n| Filipino || 20 ||\n|-\n| Latin American || 395 ||\n|-\n| Arab || 80 ||\n|-\n| Southeast Asian || 15 ||\n|-\n| West Asian || 0 ||\n|-\n| Korean || 0 ||\n|-\n| Japanese || 0 ||\n|-\n| Other visible minority || 0 ||\n|-\n| Mixed visible minority || 10 ||\n|-\n| colspan=\"2\" | Total visible minority population|| 740 ||\n|-\n| rowspan=\"3\" | Aboriginal groupSource: || First Nations || 105 ||\n|-\n| Métis || 75 ||\n|-\n| Inuit || 0 ||\n|-\n| colspan=\"2\" | Total Aboriginal population || 180 ||\n|-\n| colspan=\"2\" | White || 19,580 ||\n|-\n| colspan=\"2\" | Total population || 20,500 || 100%\n|}\nAttractions\nKingsville is home to the Jack Miner Bird Sanctuary. Jack Miner was awarded The Order of the British Empire (OBE) for his achievements in conservation in the British Empire. It was awarded June 23, 1943, by King George VI, as King of Canada. Jack Miner is considered \"the father of the conservation movement on the continent\".\nKingsville is home to Colasanti's Tropical Gardens which attracts people from all over Ontario. The gardens have many varieties of tropical plants and animals.\nKingsville is also home to the Kingsville Music Festival, organized by the Kingsville Music Society. It began in early August 2014 and has continued each year with headliners such as Bruce Cockburn, Ashley MacIsaac, Steven Page, and Kathleen Edwards.\nSports\nKingsville was, for 26 years, the home town of the Great Lakes Jr. C team Kingsville Comets. The team was sold and moved to Amherstburg in 2013, becoming the Amherstburg Admirals. The town was among the top 5 places in Canada chosen for CBC's Kraft Hockeyville 2008, and finished in 2nd place in the competition with over 1.5 million votes.\nIn 2015, the Kingsville Kings were formed and added to the South Conference of the Greater Metro Junior A Hockey League. They play out of the Kingsville Arena Complex.\nAfter playing a neutral site game in Kingsville during the 2016–17 season, the St. Clair Shores Fighting Saints of the Federal Hockey League relocated to Kingsville for the 2017–18 season as the North Shore Knights. The team played most of its home games out of the Kingsville Arena Complex with a few other neutral site home games in various cities in Ontario and Quebec. After cancelling several games during the season, the Knights were not listed as an FHL member the following season.\nEducation\nKingsville has two schools: Erie Migration District School and St. John de Brebeuf Catholic Elementary School.\nErie Migration District School, which opened in September 2024, consolidated the student populations of three of Kingsville’s public schools—Jack Miner Public School (which had previously absorbed Ruthven Public School in 2013), Kingsville Public School, and Kingsville District High School. All three predecessor schools closed in June 2024.\nNotable people from Kingsville\n* Meghan Agosta, Olympic ice hockey player\n* Jack Miner, conservationist\n* Ellie Moon, playwright and actor\n* Dalton Prout, NHL hockey player\n* Paul Quantrill, Major League baseball player\nSee also\n*List of townships in Ontario\nReferences\nExternal links\n*"
    }
  ]
}