{
  "content": [
    {
      "type": "text",
      "text": "# Kingsborough Early College Secondary School\n\n| type          = Public\n| established   = 2006\n| principal     = Tracee Murren\n| enrollment    = 1000 (2019)\n| grades        = 6-12\n| authority     = NYCDOE\n| team_name     = The Patriots (PSAL Lafayette)\n| colors        = Yellow and navy blue\n| school_code   = 21K468\n| website       =\n}}\nKingsborough Early College Secondary School (KECSS), or IS 468 is a Middle School/High School located in the Bensonhurst section of Brooklyn, New York. KECSS is housed in the Lafayette Educational Complex/Campus (Lafayette High School (New York City)) building. Students also take college courses at Kingsborough Community College located in the Manhattan Beach section of Brooklyn, New York. KECSS offers each child the opportunity to better themselves with strong character building programs. Upon completion of the eighth grade level, students participate in college level courses in addition to the high school curriculum. Upon completion of all courses with a passing grade each student will have earned 60 college credits (the equivalent of an associate degree).\nExtended Day\nExtended Day Periods programs are the type of lessons that may teach students ahead and beyond the topic. If students have problems with subjects like ELA, Science, and Math they may take this course. Extended Day is mandatory for 9th Graders as during the Extended day, 9th Graders take Elementary Spanish College Course.\nEnrichment Clusters\nEnrichment Clusters are activities that are only on Fridays that let students be a grown up and show jobs that grown ups can do like actors, steppers, hair stylists, and even chefs. There are 3 cluster sessions each year. For the survey, there will be recommended clusters that students may choose. On the survey, students may choose 4 of the clusters that students are most interested in. The clusters change as cycles approach.\nNational Honor Society\nKECSS has an outgoing National Honor Society which is dedicated to helping the community.\nExternal links\n* Monahan, Rachel. [http://www.nydailynews.com/ny_local/education/2008/02/05/2008-02-05_kingsborough_early_college_schools_new_l-1.html \"Kingsborough Early College School's new location troubles parents\"], Daily News, February 5, 2008"
    }
  ]
}