{
  "content": [
    {
      "type": "text",
      "text": "# King (2026 film)\n\nKing is an upcoming Indian Hindi-language action thriller film directed by Siddharth Anand from a screenplay by Anand, Sujoy Ghosh, Suresh Nair, and Sagar Pandya, with dialogues by Abbas Tyrewala. Produced by Gauri Khan, Shah Rukh Khan, and Mamta Anand under Red Chillies Entertainment in association with Marflix Pictures, the film stars Shah Rukh Khan in the title role as an aged assassin alongside Suhana Khan in her theatrical debut, with Deepika Padukone in an extended cameo appearance, Abhishek Bachchan as an antagonist, and an ensemble cast including Abhay Verma, Raghav Juyal, Arshad Warsi, Rani Mukerji, Anil Kapoor, Jackie Shroff, Jaideep Ahlawat, Saurabh Shukla, Akshay Oberoi, and Karanvir Malhotra in supporting roles. The cinematography is handled by Satchith Paulose, editing by Aarif Sheikh, and the music is composed by Anirudh Ravichander.\n| story          = Sujoy Ghosh\n| producer       =\n| starring       =\n| cinematography =\n| editing        =\n| music          = Anirudh Ravichander\n| studio         =\n| distributor    =\n| released       =\n| country        = India\n| language       = Hindi\n| budget         =  crore\n}}\nDevelopment began in 2023 when Ghosh pitched the idea to Shah Rukh Khan as a vehicle for Suhana Khan. Initially set to direct, Ghosh stepped down in favour of Anand, who reworked the script to feature Shah Rukh Khan in a leading role while retaining Ghosh as a co-writer. The film is described as an emotional action thriller with international chase sequences. Principal photography commenced in May 2025 in Mumbai, with subsequent schedules in Poland and other European locations. Visual effects are being overseen by Red Chillies VFX.\nKing is scheduled for a theatrical release in the last quarter of 2026.\nPlot\nA mentor and his disciple embark on a perilous journey, pushing their survival skills to the limit against overwhelming odds and unforgiving environments. Shah Rukh Khan plays a vengeful assassin who takes on a protégé, portrayed by Suhana Khan. The story incorporates elements of a mafia drama, with Khan's character channeling a gangster vibe. As of October 2025, further plot details have not been officially revealed.\nCast\n* Suhana Khan as the disciple and daughter\n* Deepika Padukone in an extended cameo appearance as the mother and love interest\n* Abhishek Bachchan as an antagonist\n* Abhay Verma\n* Raghav Juyal\n* Arshad Warsi\n* Rani Mukerji\n* Anil Kapoor\n* Jackie Shroff\n* Jaideep Ahlawat\n* Saurabh Shukla\n* Akshay Oberoi\n* Karanvir Malhotra\n}}\nProduction\nDevelopment\nThe project was initially conceived by Sujoy Ghosh, who pitched the idea to Shah Rukh Khan in 2023 as a vehicle for Suhana Khan with Khan in a supporting role. The script evolved to feature Khan in the lead, leading Ghosh to step down as director while remaining as a co-writer. Siddharth Anand assumed directorial duties and contributed to the screenplay alongside Suresh Nair and Sagar Pandya. The film is described as an action thriller with emotional elements, focusing on sleek chase sequences and international action blocks, drawing comparisons to John Wick. Action is choreographed by Casey O'Neill. Khan confirmed the collaboration with Anand in January 2025, assuring fans the film would be entertaining.\nCasting\nShah Rukh Khan and Suhana Khan were confirmed as leads in early 2024, marking Suhana's feature film debut after her appearance in The Archies (2023). Abhishek Bachchan joined as an antagonist in March 2024. Deepika Padukone was added in an extended cameo role in September 2025, marking her sixth collaboration with Shah Rukh Khan. Other cast members including Abhay Verma, Raghav Juyal, Arshad Warsi, Rani Mukerji, Anil Kapoor, Jackie Shroff, Jaideep Ahlawat, Saurabh Shukla, Akshay Oberoi, and Karanvir Malhotra were announced through trade reports between April and September 2025.\nFilming\nPre-production began in late 2023, with filming originally slated for January 2025 but delayed to May 2025. Principal photography commenced in Mumbai, with international schedules in Poland and other European locations. Khan sustained a shoulder injury during an action sequence in July 2025, briefly halting production, but filming resumed by September. As of October 2025, filming is ongoing in Poland, with Arshad Warsi joining the schedule there.\nVarious cast members, including Shah Rukh Khan, Suhana Khan, Deepika Padukone, and Arshad Warsi, were reported to be on location in cities such as Warsaw and Gdańsk for the shoot.\nActor Arshad Warsi confirmed his presence on the set by sharing a picture from Warsaw's Old Town on Instagram. Director Siddharth Anand responded to the post with a comment, \"Welcome to the Kingdom.\"\nPost-production\nVisual effects are being handled by Red Chillies VFX. As of October 2025, post-production is ongoing alongside filming.\nMarketing\nAs of October 2025, no official teasers or trailers have been released. Leaked set photos and looks, including Shah Rukh Khan in a black suit with grey hair, have generated significant online buzz. Director Siddharth Anand teased the film on social media with the phrase \"Heavy is the head that wears the crown,\" exciting fans. The film's logo was accidentally unveiled in leaked photos from Poland.\nIn early October 2025, while filming was reportedly ongoing, Anand posted a cryptic message, \"Tick. Tock. Tick. Tock.,\" on X (formerly Twitter). The post, made without direct reference to the film, led to widespread fan speculation that it was a countdown to the reveal of the film's first look. He also shared behind-the-scenes moments from the set on his Instagram stories, including a picture of the crew during an early morning shoot.\nRelease\nKing is planned for a worldwide theatrical release in the last quarter of 2026. Initial reports suggested an Eid 2026 slot, but delays due to Khan's injury may push it to 2027.\nIn May 2025, Times Now reported, King is planned to be released on Gandhi Jayanti 2026. But, later in August, it was reported that this film may not have a release on Gandhi Jayanti due to Khan's injury and rest for a month. And it may released in late 2026 on the occasion of Christmas.\nMusic\nThe film's score and soundtrack are composed by Anirudh Ravichander, marking his second collaboration with Shah Rukh Khan after Jawan (2023).\nThere is a rumours reported by Hindustan Times that British singer-songwriter Ed Sheeran may have a contribution in a Hindi-language track for the film. This rumor began from Shah Rukh Khan's appearance in the music video \"Sapphire\" by Sheeran and his related social media activity. Although, nothing is officially confirmed by the makers.\nAs of October 2025, no tracks have been released.\nReception\nMedia outlets and trade analysts have reported on the film's pre-release anticipation. Analysts pointed to the film's cast and genre as potential draws for audiences. Reports from publications like GQ India and Box Office Worldwide discussed the film's significant budget and the expectation from industry trackers that it could become a major commercial success, with some analysts speculating it could enter the ₹1000 crore club worldwide. Additionally, the film registered over 30,000 expressions of interest on BookMyShow before any official marketing materials were released.\n|url=https://www.news18.com/movies/bollywood/darr-nahi-dehshat-hoon-shah-rukh-khan-unleashes-brutal-action-in-king-title-reveal-watch-9674855.html |access-date=2 November 2025 |publisher=News18}}\nKing is scheduled for a theatrical release in 2026 in its original Hindi language, and in the Tamil, Telugu, Malayalam, Kannada, English languages, and many international languages.\nSee also\n* Shah Rukh Khan filmography\n* List of most expensive Indian films\nReferences\nExternal links\n*\n* [https://www.bollywoodhungama.com/movie/king/ King] at Bollywood Hungama"
    }
  ]
}