{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom Arena\n\n| built =\n| opened =\n| closed =\n| demolished =\n| renovated =\n| owner = General Entertainment Authority\n| operator = General Entertainment Authority(Al-Hilal Company, only for its football matches)\n| surface = Grass\n| construction_cost =\n| architect = Ali Al-Yami\n| builder =\n| former_names = Boulevard Hall (2023)\n| tenants = Al-Hilal (2023–present)\n| seating_capacity = 30,000\n| website =\n}}\nKingdom Arena is a multi-purpose stadium located in the Hittin neighborhood of Riyadh, Saudi Arabia. The stadium has a seating capacity of approximately 30,000 and is designed to host a wide range of events, including football matches, music concerts, Professional boxing bouts, and Professional wrestling shows. It features a retractable roof and is fully air-conditioned. The stadium is also notable for being one of the fastest major stadium construction projects in the world, completed in just six months.\nHistory\nThe stadium was built in 180 days and accommodates 26,090 spectators, including 20 luxury boxes. It has a retractable roof and a four-sided video screen suspended over the center. In September 2023, the Kingdom Holding Company obtained the management rights to operate the stadium as the home of Al-Hilal. As part of the agreement, it also received the naming rights to the stadium.\nThe first football match to be played at the stadium was a friendly match on 29 January 2024 (corresponding to the 2024 Riyadh Season Cup) between Al-Hilal and Inter Miami, which ended in Al Hilal winning 4–3.\nOn 8 February 2024, the stadium received two Guinness World Records for the largest covered football stadium and the highest capacity for an indoor covered stadium.\nEvents\nBoxing\n*Tyson Fury vs. Francis Ngannou\n*Anthony Joshua vs. Otto Wallin\n*Anthony Joshua vs. Francis Ngannou\n*Tyson Fury vs. Oleksandr Usyk\n*Queensbury vs. Matchroom 5v5\n*Artur Beterbiev vs. Dmitry Bivol\n*Oleksandr Usyk vs. Tyson Fury II\n*Artur Beterbiev vs. Dmitry Bivol II\nMixed martial arts\n*PFL vs. Bellator\n*UFC on ABC: Whittaker vs. Aliskerov\nProfessional wrestling\n;WWE\n* Night of Champions (2025)\n* SmackDown (2025)\nAssociation football\nRiyadh Season Cup 2024\n*Al-Hilal vs. Inter Miami\n*Al-Nassr vs. Inter Miami\n*Al-Hilal vs. Al-Nassr\nCAF Super Cup: 2024 Final\n*Al-Ahly vs. Zamalek\nSaudi Women's Cup\nSaudi Women's Cup: Final 2023–24\n*Al-Ahli vs. Al-Shabab\nSaudi Women's Cup: Final 2024–25\n*Al-Ahli vs. Al-Qadsiah\nSee also\n* Riyadh Season\n* Boulevard World\n* Boulevard City\n* List of football stadiums in Saudi Arabia\nReferences"
    }
  ]
}