{
  "content": [
    {
      "type": "text",
      "text": "# Kingledoors\n\nKingledoors is a group of settlements in a valley in southern Scotland near Tweedsmuir in the Scottish Borders, in the valley of the  River Tweed. It is part of the parish of Drumelzier and is bounded on the north by Mossfennan, on the east by Polmood, on the south by the lands of Crook and Oliver.\nThe settlement is at the foot of a long valley through which runs Kingledoors Burn and it is divided into three parts – Chapel Kingledoors is a small settlement at the foot of the valley,  Kingledoors Hope or Over Kingledoors is at the tope end of the valley and. Kingledoors Craig occupies the lands to the north of the Burn. Kingledoors was originally part of the barony of Oliver Castle which was originally owned by the Clan Fraser. When Sir Simon Fraser was killed in 1306,  Craig Kingledoors became the property of the Hays, and the other lands the property of the Flemings.\nChapel Kingledoors is named from a chapel dedicated to St Cuthbert. This had been a hermit's cell and as a chapel it was granted to the monks of Melrose along with the adjacent lands called then South Kingledoors. There was previously a Peel tower a short way up the valley on the north side of the burn. Much of the land was later tenanted or owned by the  Tweedies and a conflict with the Flemings in 1524 led to the death of the then Lord Fleming. Craig Kingledoors was acquired by William Hay of Drumelzier in 1686 and the Tweedies  were proprietors of Chapel Kingledoors and one half of Over Kingledoors in 1712, which property  William Hay acquired from the Tweedies before his death, and his son Alexander in 1736 had a Crown charter of the whole property. The estate then passed through a succession of owners including Sir George Montgomery of Macbiehill, Baronet and James Tweedie of Quarter who bought up many properties previously owned by the Tweedies.\nKingledoors Burn which runs through the valley is a gravel bed stream which has provided a basis for several  geographical research papers.\nReferences\n* J. W. Buchan and Rev. H. Paton A History of Peeblesshire 1925–7.\n* Peter C. Klingeman Gravel-bed Rivers in the Environment 1998 Water Resources Publication\n* R. J. Price Glacial Meltwater Channels in the Upper Tweed Drainage Basin The Geographical Journal, Vol. 126, No. 4 (Dec., 1960)\nExternal links\n* [https://www.geograph.org.uk/photo/248018]\n* [https://web.archive.org/web/20080829215155/http://www.tweedie.org/twe_mft.htm Michael Forbes Tweedie The History of the Tweedie or Tweedy Family (1902)]"
    }
  ]
}