{
  "content": [
    {
      "type": "text",
      "text": "# King Ghartey IV\n\n| predecessor        = King Henry Acqual\n| successor          = King Kodwo Abeka\n| mother             = Obaapanyin Ekua Kaadze\n| father             = King Gyateh Kumah III\n}}\nKing Ghartey IV (born Kwamena Akyempong; c. 1820 – July 30, 1897) was the king of Winneba, enstooled in 1872. He became king after the death of King Henry Acqual, alias Kwesi Eguasi. He was the first President of the Fante confederation. He was a politician, author, entrepreneur, statesman, innovator and philanthropist. He was a leading figure in the business transactions which flowed from the Gold Coast to Britain to France. He was succeeded by King Kodwo Abeka (George Acquah Robertson).\nBiography\nHe was born in 1820 at Winneba and named Kwamena Akyempong. His parents are King Gyateh Kumah III and Obaapanyin Ekua Kaadze, who was a princess of Senya Beraku. During his career, Mynheer Stooves gave him the name Robert Johnson Ghartey due to his intelligence and his father's name \" Gyatey(Tiger)\" was anglicized to \"Ghartey\". His wife was Sarah Efuwa Betse Ghartey. He did not have any formal education. He was able to read and write by reading books given to him by Mynheer Stooves. Through this, he was able to speak English, Dutch and Portuguese. He was very religious. He died on July 30, 1897.\nCareer\nAs a young boy living in a fishing community, he worked as a fisherman. Afterwards, he worked as a cooper in the factory of Stooves at Apam.Later, he was transferred to Elmina and then to Shama where he worked for 14 years. He established his personal enterprise at Anomabu which he named Ghartey Bros. He worked with the European firm at Winneba. In 1867, he was appointed treasurer then later, a magistrate for the town court by King Kofie Afedsi and the chiefs of Anomabu.\nAchievements\n* He dug a bore-hole at Anomabu which became the only source of water for the people at a cost of £150.\n* He also introduced the cover shoulder dress;Kabasrotu currently known as \" Kaba fashion style\" to aid cover the upper part of the body of the Fante women who went about their daily activities bare-chested. He started this initiative first on his maidservants then on the girls at his temperance society.\n* He created the \"band of hope\" which sung at church services and at funerals, using the girls at the Temperance society and his maidservants\n* In 1864,he measured the distance from the coast to Ashanti using his pocket watch at three miles an hour.\n* In 1864, he published a pamphlet entitled \"A guide to coomassie\".\n* He became the first King-President of the Fante confederation.\n* He instituted a branch of Temperance Society at Anomabu with the help of Revds. T.B. Freeman, J. A. Solomon, J. Fynn and Messrs John Ogoe, J. E. Sampson among others.\n* He promoted the mining of gold and the timber industry in the Gold Coast.\n* In his reign as king, he invited European merchants to establish in winneba for rapid development of winneba.\n* He pioneered the cracking of palm nuts and its exportation in the gold coast.\nReferences"
    }
  ]
}