{
  "content": [
    {
      "type": "text",
      "text": "# King's Gate (Kaliningrad)\n\nThe '''King's Gate' (Russian: Королевские ворота, tr.: Korolevskie vorota, German: Königstor'') is one of the former six gates that were built during the 19th century around Kaliningrad (the former Prussian city of Königsberg).\nThe King's Gate was originally the Gumbinnen Gate (German: Gumbinner Tor), built in 1765 at the edge of the district Neue Sorge. In 1811 it was renamed the King's Gate and was the terminus of the Königstraße boulevard. The gate was redesigned by Friedrich August Stüler in 1850. The west facade has three sandstone statues, made by sculptor Wilhelm Stürmer: nine metres above the ground to the left the Bohemian king Ottokar II is depicted, who was Königsberg's namesake. Frederick I of Prussia, Prussia's first king, follows as the middle statue. To the right Albert, Prussia's first duke and founder of the Albertina university, holds an eye over the city. Above the sculptures the coat of arms of Samland and Natangen are shown.\nThe gate was damaged during the Second World War. Furthermore, as a first victory celebration, Soviet soldiers decapitated the statues. With the celebration of the city's 750-year existence in June 2005, the gate was renovated. A few months before the beginning of the festivities, the gate was still in a desolate condition. Within a few weeks, however, the gate was restored to its condition before the war. Fully restored statues replaced the decapitated ones on the gate with this renovation.\nImage:ID003163 A070 Koenigstor.jpg|King's Gate before the Second World War\nImage:ID003164 A071 Koenigstor.jpg|King's Gate before the Second World War\nImage:Bundesarchiv Bild 183-R94432, Königsberg, gefangene deutsche Offiziere.jpg|German POWs after the Battle of Königsberg\nImage:Kaliningrad Koenigstor.JPG|King's Gate before reconstruction in 2004\nImage:Kaliningrad 05-2017 img19 Kings Gate.jpg|Statues on the facade of King's Gate\nLiterature\n* Robert Albinus: Königsberg-Lexikon. Würzburg 2002,\n* Richard Armstedt: Geschichte der königl. Haupt- und Residenzstadt Königsberg in Preußen. Reprint der Originalausgabe, Stuttgart 1899.\n* Fritz Gause: Die Geschichte der Stadt Königsberg in Preußen. 3 Bände, Köln 1996,\n* Jürgen Manthey: Königsberg – Geschichte einer Weltbürgerrepublik. Hanser 2005,\n* Gunnar Strunz: Königsberg entdecken. Berlin 2006,"
    }
  ]
}