{
  "content": [
    {
      "type": "text",
      "text": "# Kingsley College Australia\n\nKingsley College was until 2008 a Wesleyan Methodist Church of Australia school of theology located in Melbourne, Australia.\nIts student body had always been largely non-Wesleyan Methodist, and without the students from other Christian denominations the school probably could not have survived as long as it did.\nHistory\nThe college was founded by President of the Australian Wesleyan Methodist Conference and editor of the Australian Wesleyan Kingsley Ridgway in 1948, and was (despite being in Melbourne) until 2008 a member institute of the Sydney College of Divinity.\nIt was originally known as the Wesleyan Methodist Bible College of Australia; but in 1973 its name was changed to honour its founder upon his retirement.\nIt was funded initially from donations made by Wesleyan Methodist church members in North America, reported by Ridgway as being \"in the neighbourhood of one dollar (six shillings) per member over the whole connexion\". Its first principal was professor Leo G. Cox, an American who was elected Conference President in 1948 after Ridgway.\nIn January 2008 it merged with Tabor Victoria, with the majority of its staff and faculty and the whole of its library transferred to Tabor, with its original building and property scheduled to be sold.\nWhat was left of Kingsley continues to provide Wesleyan Methodist ministerial and lay person training in Bible and theology through the Vocational Education Training sector.\nPrincipals\n{| class=\"wikitable\"\n|+ Principals of Kingsley College\n! Name !! Years of Service\n|-\n| Dr Leo G. Cox || 1949-1955\n|-\n| The Revd Robert Mattke || 1956-1961\n|-\n| The Revd James Ridgway || 1961-1966\n|-\n| The Revd Arthur Calhoun || 1967-1969\n|-\n| The Revd Aubrey Carnell || 1970-1971\n|-\n| The Revd Dr James Ridgway || 1972-1984\n|-\n| The Revd Dr David Wilson || 1985-2002\n|-\n| The Revd Lionel Rose || 2003\n|-\n| The Revd Peter Dobson || 2004-2010\n|-\n| The Revd Kevin Brown || 2010 – present\n|}\nReferences\nSources\n*\n*\n*\n*|author1=Dr Wynand J. de Kock, Principal Tabor Victoria|author2=The Revd Peter J. Dobson, Principal Kingsley College|title = Kingsley College and Tabor Victoria - United Press Release: Christian Colleges Unite with 100 years' experience|accessdate = 2008-10-18|url=http://www.kingsley.edu.au/PressRelease/?ID=PRelease|archiveurl=https://web.archive.org/web/20080719122507/http://www.kingsley.edu.au/PressRelease/?ID=PRelease |archivedate=2008-07-19}}\n*\nExternal links\n*"
    }
  ]
}