{
  "content": [
    {
      "type": "text",
      "text": "# King Hussein Cancer Foundation and Center\n\nKing Hussein Cancer Center under expansion.\nThe King Hussein Cancer Foundation (KHCF) and Center (KHCC) (Arabic مؤسسة ومركز الحسين للسرطان), an independent Jordanian non-governmental, non-profit institution. It was established in 2001 by a royal decree issued and is led by Princess Ghida Talal. The foundation's mission is to combat cancer through awareness, prevention, and early detection programs, providing comprehensive care for cancer patients from Jordan and the Arab world, in addition to promoting research and innovation.\nserves as the chair of the Board of Trustees of the King Hussein Cancer Foundation.]]\nInstitutional governance\nAs the chairperson of the Board of Trustees of the King Hussein Cancer Foundation and Center, Princess Ghida presides over the management of KHCF/KHCC with a Board of Trustees composed of prominent business and social leaders who volunteer their expertise in the health, economic, and financial fields.\nKing Hussein Cancer Foundation\nThe King Hussein Cancer Foundation is the largest community organization in Jordan dedicated to the fight against cancer. Its activities include fundraising and development, mobilizing international and local efforts to combat cancer, implementing cancer prevention and early detection programs, supporting underprivileged patients through Goodwill and Zakat funds, implementing psychosocial and academic support programs for patients and their families, in addition to administering the non-Cancer Care Insurance (CCI) program, a sustainable cancer financing mechanism which covers the treatment of subscribers at KHCC.\nInternational Branches\nThe King Hussein Cancer Foundation USA (KHCF USA) is registered as an independent entity in the United States of America and exempt from federal taxes under Section 501(3)(C) of the Income Tax Code. The King Hussein Cancer Foundation UK (KHCF UK) is registered as a charitable entity in the United Kingdom by the Charity Commission of England and Wales since 2021.\nJordan Breast Cancer Program\nThe Jordan Breast Cancer Program is a comprehensive national initiative operated under the leadership and support of the King Hussein Cancer Foundation and Center, and the Jordanian Ministry of Health. The program, which was launched in 2007, aims to reduce breast cancer mortality rates by providing breast cancer early detection services to all women in Jordan and moving from diagnosing the disease in its late stages (3-4) to diagnosing it in its early stages (0-2), where the chances of recovery and survival are higher and the costs of treatment are lower.\nCancer Care Insurance (CCI)\nThe Cancer Care Insurance (CCI) program is a non-profit social solidarity insurance administered by the King Hussein Cancer Foundation. For a minimal annual fee, subscribers are guaranteed treatment at the King Hussein Cancer Center.\nKing Hussein Cancer Center\nThe King Hussein Cancer Center was established in 2001 and named after King Hussein bin Talal. The Center provides advanced, comprehensive care for cancer patients of all ages from Jordan and across the Middle East, and is managed by Dr. Asem Mansour in his capacity as its CEO and Director General.\nThe Center has an area of 108,700 square meters and consists of three main buildings: the King Salman bin Abdulaziz Al Saud Building, the Sheikh Khalifa Bin Zayed Al Nahyan Building, and the Nizar Al-Naqeeb Building. It includes 13 operating rooms, 36 intensive care units, and 352 beds.\nThe Center receives approximately 7,000 new patients annually, and the number of admissions reaches 14,000 cases, with an estimated 250,000 outpatient clinics visits annually.\nThe medical staff consists of more than 400 doctors and oncology consultants, 1,100 nurses specialized in oncology, 1,500 administrators, technicians, and medical care specialists, and approximately 100 pharmacists qualified to prepare oncology medications.\nKHCC is home to the first public umbilical cord stem cell bank in Jordan and houses several important facilities, such as intensive care units for children and adults, diagnostic and therapeutic radiology departments, the cell therapy and applied genomics department, as well as the bone marrow transplant program.\nInternational Accreditations\nThe Center has obtained numerous international accreditations and recognition, including:\n* Accreditation by the Joint Commission International for Healthcare Accreditation (JCIA)\n* Being the first center outside the United States to obtain a certificate of clinical care programs.\n* Accreditation of laboratories affiliated with the College of American Pathology (CAP): KHCC is the first hospital in Jordan and the fifth in the Arab world to obtain this accreditation .[http://www.cap.org/web/home Home - College of American Pathologists]\n* National Health Accreditation Council (HCAC) accreditation in Jordan.\n*Accreditation by the American Nurses Credentialing Center (ANCC), which qualifies KHCC to conduct training courses accredited by the ANCC.[http://www.nursecredentialing.org/ American Nurses Credentialing Center - ANCC]\n*Accreditation by the Arab Board for Health Specialties for the breast imaging training center, KHCC is the first center in the Arab world to obtain this accreditation.\n* Certificate of Excellence in Nursing (MAGNET) from the American Nurses Credentialing Center (ANCC): KHCC is the first specialized cancer treatment center outside the United States to obtain this accreditation, which has been obtained by only 8% of U.S. hospitals and 9 global healthcare institutions.\n* International Accreditation for Clinical Research (AAHRPP): from the Association for the Accreditation of Human Research Protection Programs, which confirms that KHCC’s research conforms to international standards related to quality and protecting the rights of research participants. KHCC is the eighth center in the world to obtain this accreditation.\n*Accreditation of Jordan’s Health Care Accreditation Council (HCAC) for the breast imaging unit.\n* American Heart Association accreditation.\nPartnerships and Affiliations\nKHCC has established strategic, medical, educational, and research partnerships with a number of regional and international institutions to support its work and programs.\nStrategic Partnerships\n* Sister Institution: MD Anderson Cancer Center at Texas University, US.\n* Strategic Partner: St. Jude Children's Research Hospital, US.\nMedical, Educational, and Research Partnerships\nThe Center maintains partnerships and collaboration with cancer centers around the world, including:\n*American University of Beirut Medical Center - Lebanon.\n*National Cancer Institute, US.\n*Leeds Teaching Hospitals NHS Trust, United Kingdom.\n*Princess Margaret Cancer Centre, Canada\n*French Curie Foundation for Cancer Research\n*H. Lee Moffitt Cancer Center & Research Institute, US\n* Union for International Cancer Control, in Switzerland.\n* German Cancer Research Center, in Germany\n*European Cancer Foundations, in Belgium\n* Champalimaud Foundation, in Portugal\n* International Federation for Targeted Cancer Therapy, in France.\n* European Organisation for Research and Treatment of Cancer, in Belgium\n* An-Najah National University, in State of Palestine.\n* Qatar Biomedical Research Institute\n* National Cancer Center, Egypt\n* University of Jordan\n* Ministry of Higher Education and Scientific Research, Jordan\nModern Technologies\nKHCC utilizes the most advanced technologies available for cancer treatment, including:\n* Neurosurgery operating room: This facility is equipped with an advanced navigation system that enables the surgeon to remove the tumor with high precision while preserving the integrity of the surrounding tissues. The system also allows the surgeon to transfer the patient to the MRI machine linked to a navigation system during the operation, and to conduct an immediate evaluation according to the MRI image to ensure more accurate results when compared to traditional surgery.\n* Robotic surgery: Minimally invasive robotic surgery uses very precise instruments, resulting in very small surgical incisions of less than one centimeter in most cases, through which the surgeon can obtain a clear view of the location of the operation on a large screen and perform the necessary procedures without the need to cut a large wound.\n* Modern techniques of radiation oncology: The advanced therapeutic radiology department includes 6 Linear Accelerators equipped with an X-ray tracking system, which depicts a four-dimensional image of the tumor and the patient’s organs with great precision in directing radiation to the site of solid tumors.\n* Modern techniques in diagnosing tumors: Diagnostic imaging rooms operate with modern audiovisual technology, including magnetic resonance imaging (MRI), CT, and radiotherapy sessions.\n*Laboratory of Cell Therapy and Applied Genomics: The CTAG Lab is home to the public bank for the preservation of cord blood (the first of its kind in Jordan) which provides stem cells that play an important role in saving the lives of leukemia patients and other blood diseases. The laboratory also conducts advanced genetic analyses that enable the doctor to understand the patient’s genetic makeup, and thus help the doctor make the appropriate medical decisions for the patient’s condition.\nScientific Research and Innovation\nThe Office of Scientific Affairs and Research (OSAR) at the Center provides a supportive environment for the fight against cancer, by conducting scientific research activities that contribute to reducing the death rate and alleviating the suffering of cancer patients.\nOSAR is home to the Education and Training Academy, through which the King Hussein Cancer Center offers courses for healthcare professionals, a master’s program in care informatics, fellowship and residency programs, and professional diploma programs.\nKing Hussein Award for Cancer Research\n]]\nThe King Hussein Cancer Foundation launched the King Hussein Award for Cancer Research in 2020, which aims to strengthen cancer-related research efforts in the Arab world at the individual and institutional levels in memory of King Hussein bin Talal, who was a strong advocate for cancer research. The award honors both established and promising distinguished Arab researchers. It also aims to advance Arab research in order to understand the characteristics of cancer in the region, and to study Arab genes in particular, to strengthen Arab efforts to overcome cancer with advanced scientific methods\nSee also\n*King Hussein Medical Center\nReferences\nExternal links\n* [http://www.khcc.jo/ Official website]"
    }
  ]
}