{
  "content": [
    {
      "type": "text",
      "text": "# King's Field (1995 video game)\n\n| producer = Naotoshi Zin\n| writer = Toshiya KimuraShinichiro Nishida\n| programmer = Eiichi Hasegawa\n| composer = Koji EndoKaoru Kono\n| series = ''King's Field\n| engine =\n| released = }}\n| genre = Action role-playing\n| modes = Single-player\n| platforms = PlayStation\n}}\n'''King's Field II'}} is a 1995 action role-playing game developed and published by FromSoftware for the PlayStation. It is the second entry in the ''King's Field series and the first one to be released internationally; it was released as simply '''King's Field' as the previous game was never released outside Japan.\n| Allgame =\n| EGM = 8.375 / 10\n| Fam = 35 / 40\n| NGen =\n}}\nOn release, the Japanese gaming magazine Famicom Tsūshin scored the game a 35 out of 40. One of Electronic Gaming Monthlys four reviewers remarked, \"This title has all the great aspects of a true RPG, including items to pick up and equip, but also has an adventure feel to it because of the strategy used in doing battle with the enemies.\" Though one of the reviewers complained about the player character's slow movement, another two felt it added to the realism. A GamePro reviewer took the negative side on the issue, arguing that \"Chasing monsters is one thing, but chasing them in slow motion while they speed up to kill you is a different matter.\" He also criticized the slowly charging weapon bar and the graphical similarity of the levels and monsters, and compared the game unfavorably to DeathKeep, another first-person dungeon crawling RPG which was released for the 3DO at around the same time. A Next Generation critic complained that the battles \"are slow and meticulous, and ... lack a lot of the strategy involved in most RPG battles\", but gave the game a strong overall recommendation. He complimented the graphics, sound, and RPG elements, but found the game's best aspect as the ability to freely look around and explore every corner of the massive 3D world with no load times.\nIn a retrospective review AllGame editor Michael L. House highly praised the game, referring to it as an \"exceptional sequel\" and that \"experiencing the magic of this wonderful game would be time well spent\".\nNotes\nReferences\n}}\nExternal links\n*[https://web.archive.org/web/20081007212814/http://www.agetec.com/catalog/product_info.php?manufacturers_id=10&products_id=94&osCsid=uueta7b1fr62e3e543u5c3b914 Agetec ''King's Field (U.S.)'' listing]"
    }
  ]
}