{
  "content": [
    {
      "type": "text",
      "text": "# King Kong Encounter\n\nKing Kong (better known as King Kong Encounter and also known as Kongfrontation during opening and King Kong: The Ride) was an attraction formerly part of the Studio Tour at Universal Studios Hollywood in Los Angeles. The attraction was based on the 1976 King Kong film and served as a basis for a stand-alone Kongfrontation, a former attraction at Universal Studios Florida. The scene, located amongst the New York Street backlot sets in the heart of the studios, was destroyed in the 2008 Universal Studios fire and was replaced by King Kong: 360 3-D, which was opened on July 1, 2010.\nSummary\nThe show began as the tour tram entered the soundstage into a world of New York City where they stopped in front of an apartment building facade. Guests watched a breaking news report about Kong's rampage on television monitors located inside of the building's windows showing live coverage of the destruction and it showed a news footage with news anchor Sander Vanocur (replaced in 1990 with WWOR-TV, anchored by Rolland Smith), of King Kong on the loose in the city. The giant ape was destroying the city, including throwing two elevated trains off the platforms of the rail track. New York City Police Department (NYPD) authorities could do nothing to stop him as he traveled toward the Brooklyn Bridge.\nA news helicopter that carried reporter Kelly King (portrayed by Sheree J. Wilson, voiced by Tress MacNeille beginning on June 15, 1986) was circling overhead and covering the story, when Kong suddenly swatted at the helicopter, causing it to come crashing down from above and explode only a few feet away from the tram. As the tram rounded a corner, it drove out onto the Brooklyn Bridge, putting guests at eye-level with the giant animatronic ape. An NYPD helicopter fired upon Kong to protect the tram, but this enraged the beast who then shook the bridge and ripped the suspension bridge cables apart in an attempt to grab the tram. Miraculously, guests managed to escape the clutches of Kong as the tram exited the soundstage just in the nick of time.\nMechanics and inspirations\nThe 7-ton, 30-foot-tall Kong figure in the attraction was the largest and most complex animatronic figure in existence for many years. Kong was designed by legendary Disney Imagineer Bob Gurr. The detailing was so rich that Kong even had banana-scented breath. The attraction broke new ground and paved the way for the complex themed attractions of today and was the inspiration behind the former Kongfrontation attraction at Universal Studios Florida. The Kong sequence was also featured in the film The Wizard starring Fred Savage and Christian Slater.\nHistory\nUniversal Studios Tour began building its $7-million, computer-controlled, 30-foot animated King Kong in December 1985 to be housed in his own lower-lot studio that duplicated Lower East Side New York. The attraction opened on June 14, 1986, with the un-dubbed voice of actress Sheree J. Wilson as Kelly King in the news footage. The poor reception of Wilson's original voice acting led to voice actress Tress MacNeille dubbing King on June 15, the day after the opening of the attraction. MacNeille's dubbing was praised for giving the character a more suitable and intense tone, and helped to improve the overall quality of the attraction. The attraction was completely destroyed by a fire in the early morning of June 1, 2008.[https://www.today.com/news/universal-studios-reopens-after-damaging-fire-wbna24916515 Universal Studios reopens after fire - Movies - nbcnews.com] On June 3, Universal Studios Officials stated that the experience would not be rebuilt, but instead be replaced by a new contemporary attraction. This had caused outrage among fans of the giant ape, which prompted Universal's decision to bring Kong back to the tour in the form of an all new 3D film experience. Following the loss of Kong, the Earthquake tour scene is featured more often in Universal Studios Hollywood promotional materials and the Collapsing Bridge tour scene was reopened, although The Collapsing Bridge was closed and was replaced by King Kong: 360 3-D on July 1, 2010.\nTimeline of the attraction\n* 1974 - The Collapsing Bridge which was next to the New York Street backlot sets opens on the Studio Tour at Universal Studios Hollywood before the King Kong Encounter opens.\n* 1984 – Work started on the King Kong Encounter attraction at Landmark Entertainment.\n* October 1985 – Sequoia Creative starts work on the Kong figure.\n* March 18, 1986 – Attraction previews at Universal Studios Hollywood.\n* June 14, 1986 – Public opening at Universal Studios Hollywood.\n* June 15, 1986 – Kelly's voice was dubbed by Tress MacNeille. In the original version of the attraction on June 14, its opening day, Sheree J. Wilson's voice was considered to be too high-pitched for the fictional character of helicopter reporter Kelly King in the news footage of the King Kong Encounter section at Universal Studios Hollywood's Studio Tour. MacNeille's voice was thought to be more suitable for the tone and delivery of the character's lines, and her voice acting is widely credited for the success of the attraction. The dubbing of Wilson's voice allowed the footage to better convey the urgency and intensity of the scene, adding to the realism and immersion of the experience.\n* April 21, 1987 – MCA (Universal's parent company) takes control of WOR-TV in Secaucus, New Jersey and renamed it WWOR-TV.\n* February 1, 1990 – News video footage re-made with WWOR news anchor Rolland Smith at the station's studios in Secaucus.\n* 1990 – Kongfrontation opened at Universal Studios Florida.\n* September 8, 2002 – Kongfrontation closed in Florida to make room for their version of Revenge of the Mummy dark ride.\n* 2005 – King Kong by Peter Jackson was released.\n* March, 2006 - The Collapsing Bridge was no longer part of the Studio Tour due to mechanical problems.\n* June 1, 2008 – The entire King Kong attraction was destroyed in the 2008 Universal fire. Only the outer walls of the show building remained. A few days later, they had been demolished too.\n* August, 2008 - The Collapsing Bridge was repaired and reopened on the Studio Tour after the June fire had closed much of the normal tram route.\n* July 1, 2010 – The King Kong Encounter and The Collapsing Bridge was replaced by King Kong: 360 3-D.\nReferences\nExternal links"
    }
  ]
}