{
  "content": [
    {
      "type": "text",
      "text": "# King James's School, Knaresborough\n\n| motto                   = Quid Retribuam Domino\n| established             = (closed between 1901–1903)\n| closed                  =\n| type                    = Community school\n| religious_affiliation   =\n| president               =\n| head_label              =\n| head                    = Clare Martin\n| r_head_label            =\n| r_head                  =\n| chair_label             =\n| chair                   =\n| founder                 = Robert Chaloner\n| address                 = King James Road\n| city                    = Knaresborough\n| county                  = North Yorkshire\n| country                 = England\n| postcode                = HG5 8EB\n| local_authority         = North Yorkshire Council\n| ofsted                  = yes\n| urn                     = 121687\n| dfeno                   = 815/4202\n| staff                   =\n| enrolment               = 1726\n| lower_age               = 11\n| upper_age               = 18\n| houses                  = Airedale, Nidderdale, Swaledale, and Wharfdale\n| colours                 =\n| publication             = The Chaloner\n| free_label_1            =\n| free_1                  =\n| free_label_2            =\n| free_2                  =\n| free_label_3            =\n| free_3                  =\n| website                 = http://www.king-james.co.uk\n}}\n'''King James's School''' is located on King James Road, Knaresborough, North Yorkshire, England. King James's is a large non-selective school with a large sixth form.\nAdmissions\nKing James's School is the only secondary school in Knaresborough and serves the town and the surrounding villages. The current Headteacher is Clare Martin. The school is situated in the centre of the town on the main A59, next to the leisure pool. Application to the school must be made via North Yorkshire Council.\nHistory\nGrammar school\nThe school was founded in 1616, as King James Grammar School with a charter from King James I.\nIt was also originally a boy's only school\nThe school magazine The Chaloner is named after Dr Robert Chaloner who founded the school. It discusses school events and achievements for both school and its students and is published annually. It is created by the students and edited by the school's sixth form.\nComprehensive\nThe school became a comprehensive in September 1971.\nThe school was refurbished with major building work at the school being completed, including an art block with modern facilities. Annual non-compulsory school trips became available for the students.\nDr Arnold Kellett has written a book about the history of the school.\nThe school was later refurbished further with the building of a modern bespoke sixth form block and cafe. Followed by an FA registered 3G football pitch being introduced for both school and community use.\nFederation\nThe school became part of a federation in 2021.\nRetaining its LA maintained school status, King James's School formed a local partnership on 4 January 2021 to form the Boroughbridge High School and King James's School Federation.\nNotable Events\nOn Monday 20 March 2023 3 girls were arrested after trying to get into the school. 1 was arrested for Criminal Damage and the 2 others were arrested to prevent Breach of Peace. 1 staff member was slightly injured.\nTraditions\nQuid Retribuam Domino (What can I render to the Lord?) is the school motto.\nHouses\nKing James's School has four school houses which have a colour each, Airedale – Blue\nNidderdale – Red\nSwaledale – Yellow\nWharfedale – Green\nSex and Relationships Education Policy\nIn August 2013 the LGBT online Pink News stated that King James's School's Sex and Relationships Education Policy included the words: \"Ensure that homosexuality is not promoted as a pretended family relationship whilst not encouraging homophobia.\" Pink News links King James' to its reported comments by the Department for Education on the Department's own 'sex and relationship education guidance', and the British Humanist Association \"concerns regarding 45 schools across the country.\" Pink News believes such policies, overt or vague, are a reflection of the repealed Section 28 of the Local Government Act 1988.\nThe school's current (last reviewed March 2023) Relationships & Sex Education Policy does not take this stance, instead stating \"that there are different types of committed, stable relationships\" and \"how stereotypes, in particular stereotypes based on sex, gender, race, religion, sexual orientation or disability, can cause damage (e.g. how they might normalise non-consensual behaviour or encourage prejudice).\"\nNotable alumni\nKing James's Grammar school\n* Robert Brook, CBE — former National Bus Company chief executive (1977–1986)\n* David John Bowes Brown, CBE — engineer and former Multidrive chairman (1996–2004)\n* Sir Albert Costain — late Conservative politician and longtime Folkestone and Hythe MP (1959–1983)\n* George Andrew Hobson — late civil engineer who designed the Victoria Falls Bridge\n* James \"Ginger\" Lacey, DFM — late Royal Air Force squadron leader credited with 28 enemy aircraft destroyed in the Battle of Britain\n* Paul Stewart, FRCP — endocrinologist and medicine professor and Dean of Medicine and Health at the University of Leeds\n* James Turner, 1st Baron Netherthorpe — late National Farmers Union president (1945–1960)\n* Timothy Wood — former Conservative MP for Stevenage (1983–1997)\nKing James's School\n* Grant Kirkhope — video game composer and voice actor\n* Jacquie O'Neill — illustrator\n* Martin Clayton — Head of Prints and Drawings at the Royal Collection Trust at Windsor Castle\nSee also\n* Dr Challoner's Grammar School\nReferences\nExternal links\n*\n* [http://www.ofsted.gov.uk/inspection-reports/find-inspection-report/provider/ELS/121687 Ofsted report]\n* [http://www.education.gov.uk/edubase/establishment/summary.xhtml?urn=121687 EduBase]\nNews items\n* [http://news.bbc.co.uk/1/hi/england/north_yorkshire/3215897.stm Secondary school teacher of the year in 2003]"
    }
  ]
}