{
  "content": [
    {
      "type": "text",
      "text": "# King's Seafood Company\n\n-->\n| hq_location =\n| hq_location_city = Costa Mesa, California\n| hq_location_country = United States\n| num_locations =\n| num_locations_year =\n| area_served = California, Arizona, Nevada, Colorado (2022)\n| key_people =\n| products =\n| services = Restaurants and seafood distribution\n| revenue =\n| revenue_year =\n| operating_income =\n| income_year =\n| net_income =\n| net_income_year =\n| owner =\n| num_employees =\n| num_employees_year =\n| parent =\n| divisions =\n| subsid =\n| website =\n| footnotes =\n}}\n'''King's Seafood Company''' is a family-owned and operated restaurant and seafood distribution company based in Costa Mesa, California, with restaurants in California, Nevada, Arizona, Colorado and Washington. The company's restaurants include Water Grill (7), King's Fish House (12), three steakhouses (555 East in Long Beach, Lou & Mickey's in San Diego, and Meat On Ocean in Santa Monica), and Pier Burger.\nHistory\nCousins Jeff and Sam King launched the company as University Restaurant Group in 1983 as a successor to their family's long-running restaurant operations. The cousins' parents, brothers Mickey and Lou King, opened their King's Coffee Shop in Huntington Park, California, in 1945. The brothers sold to Tiny Naylor's in 1982. Two years later, their sons opened 555 East steakhouse in Long Beach. Their original organization was called University Restaurant Group because the cousins had graduated from rival schools, USC and UCLA. Jeff King served as chairman of the board and Sam King was chief executive of the company. In 1998 the company name was changed to King's Seafood Company.\nToday, the company operates 12 King's Fish House restaurants, seven Water Grill locations, Meat On Ocean and Pier Burger in Santa Monica, California, 555 East steakhouse in Long Beach, California, and Lou & Mickey's, a steakhouse in San Diego named for their parents.\nIn the 2000s, Jeff King served on the board of the Los Angeles Convention and Visitors Bureau and was chairman of the California Restaurant Association. He died at age 77 on May 17, 2017. Sam King was one of the founders of the Sustainable Seafood Forum. As of 2007, he is chief executive and resides in Coto de Caza, California.\nReferences\nExternal links\n*"
    }
  ]
}