{
  "content": [
    {
      "type": "text",
      "text": "# King of Jerusalem__disambig_1\n\n| image             =\n| caption           =\n| first_monarch     = Godfrey of Bouillon\n| last_monarch      = Henry II\n| style             =\n| residence         = David's Tower\n| began             =\n| ended             =\n| pretender         = Claimants\n}}\nThe king or queen of Jerusalem was the supreme ruler of the Kingdom of Jerusalem, a Crusader state founded in Jerusalem by the Latin Catholic leaders of the First Crusade, when the city was conquered in 1099. Most of them were men, but there were also five queens regnant of Jerusalem, either reigning alone suo jure (\"in her own right\"), or as co-rulers of husbands who reigned as kings of Jerusalem jure uxoris (\"by right of his wife\").\nGodfrey of Bouillon, the first ruler of the Kingdom of Jerusalem, refused the title of king choosing instead the title , that is Advocate or Defender of the Church of the Holy Sepulchre. In 1100 Baldwin I, Godfrey's successor, was the first ruler crowned as king. The crusaders in Jerusalem were conquered in 1187, but their Kingdom of Jerusalem survived, moving the capital to Acre in 1191. Crusaders re-captured the city of Jerusalem in the Sixth Crusade, during 1229–1239 and 1241–1244.\nThe Kingdom of Jerusalem was finally dissolved with the fall of Acre and the end of the Crusades in the Holy Land in 1291.\nEven after the Crusader States ceased to exist, the title of \"King of Jerusalem\" was claimed by a number of European noble houses descended from the kings of Cyprus or the kings of Naples, and is claimed by the current king of Spain.\nKings of Jerusalem (1099–1291)\nThe Kingdom of Jerusalem had its origins in the First Crusade, when proposals to govern the city as an ecclesiastical state were rejected. In 1099 Godfrey of Bouillon was elected as the first Latin ruler of Jerusalem and was inaugurated in the Church of the Nativity in Bethlehem. He took the title of prince and Advocatus Sancti Sepulchri, meaning Advocate of the Church of the Holy Sepulchre. This was probably in response to the opinion that only Christ could wear a crown in Jerusalem. Advocatus was a title with which Godfrey was already familiar as the term was much used in the lands where the Crusaders originated; it referred to a layman who protected and administered Church estates. The following year, Godfrey died. His brother Baldwin I was the first to use the title of king and the first to be crowned king in the Church of the Holy Sepulchre in Jerusalem itself.\nThe kingship of Jerusalem was partially elective and partially hereditary. During the height of the kingdom in the mid-12th century there was a royal family and a relatively clear line of succession. Nevertheless, the king was elected, or at least recognized, by the Haute Cour. Here the king was considered a primus inter pares (first among equals), and in his absence his duties were performed by his seneschal.\nThe purpose-built royal palace used from the 1160s onwards was located south of Jerusalem's citadel. The Kingdom of Jerusalem introduced French feudal structures to the Levant. The king personally held several fiefs incorporated into the royal domain, that varied from king to king. He was also responsible for leading the kingdom into battle, although this duty could be passed to a constable.\nWhile several contemporary European states were moving towards centralized monarchies, the king of Jerusalem was continually losing power to the strongest of his barons. This was partially due to the young age of many of the kings, and the frequency of regents from the ranks of the nobles.\nAfter the fall of Jerusalem in 1187, the capital of the kingdom was moved to Acre, where it remained until 1291, although coronations took place in Tyre.\nIn this period the kingship was often simply a nominal position, held by a European ruler who never actually lived in Acre. When young Conrad III was king and living in Southern Germany, his father's second cousin, Hugh of Brienne, claimed the regency of the Kingdom of Jerusalem and, indirectly, his place in the succession. The claim was made in 1264 as senior descendant and rightful heir of Alice of Champagne, second daughter of Queen Isabella I, Hugh being the son of their eldest daughter. But was passed over by the Haute Cour in favour of his cousin, Hugh of Antioch, the future Hugh III of Cyprus and Hugh I of Jerusalem.\nAfter Conrad III's execution by Charles I of Sicily in 1268, the kingship was held by the Lusignan family, who were simultaneously kings of Cyprus. However, Charles I of Sicily purchased the rights of one of the heirs of the kingdom in 1277.\nIn that year, he sent Roger of Sanseverino to the East as his bailiff. Roger captured Acre and obtained a forced homage from the barons. Roger was recalled in 1282 due to the Sicilian Vespers and left Odo Poilechien in his place to rule.  His resources and authority was minimal, and he was ejected by Henry II of Cyprus when he arrived from Cyprus for his coronation as King of Jerusalem.\nAcre was captured by the Mamluks in 1291, eliminating the crusader presence on the mainland.\nHouse of Boulogne (1099–1118)\n{| class=\"wikitable\"\n|-\n! Monarch\n! Image\n! Birth\n! Marriages\n! Death\n|-\n|Godfrey1099–1100 ||  ||Flandersson of Eustace II, Count of Boulogne and Ida of Lorraine || never married || 18 July 1100Jerusalemaged about 40\n|-\n|Baldwin I1100–1118 ||  ||Lorraine, Franceson of Eustace II, Count of Boulogne and Ida of Lorraine || Godehilde of Tosnyno childrenArda of Armenia1097no childrenAdelaide del Vasto1112no children || 2 April 1118Arish, Egyptaged about 60\n|}\nHouse of Rethel (1118–1152)\n{| class=\"wikitable\"\n|-\n! Monarch\n! Image\n! Birth\n! Marriages\n! Death\n|-\n|Baldwin II1118–1131 ||  || 1075Franceson of Hugh I, Count of Rethel and Melisende of Montlhéry || Morphia of Melitene1101four daughters || 21 August 1131Jerusalem\n|-\n|Melisende1131–1152with Fulk until 1143with Baldwin III from 1143 ||  ||1105Jerusalemdaughter of King Baldwin II and Morphia of Melitene || Fulk V, Count of Anjou2 June 11292 sons || 11 September 1161Jerusalemaged 56\n|}\nHouse of Anjou (1152–1205)\nIn 1127 Fulk V, Count of Anjou, received an embassy from King Baldwin II of Jerusalem. Baldwin II had no male heirs but had already designated his daughter Melisende to succeed him. Baldwin II wanted to safeguard his daughter's inheritance by marrying her to a powerful lord. Fulk was a wealthy crusader and experienced military commander, and a widower. His experience in the field would prove invaluable in a frontier state always in the grip of war.\nHowever, Fulk held out for better terms than mere consort of the Queen; he wanted to be king alongside Melisende. Baldwin II, reflecting on Fulk's fortune and military exploits, acquiesced. Fulk then resigned his titles to his son Geoffrey and sailed to become King of Jerusalem, where he married Melisende on 2 June 1129. Later Baldwin II bolstered Melisende's position in the kingdom by making her sole guardian of her son by Fulk, Baldwin III, born in 1130.\nFulk and Melisende became joint rulers of Jerusalem in 1131 with Baldwin II's death. From the start Fulk assumed sole control of the government, excluding Melisende altogether. He favored fellow countrymen from Anjou to the native nobility. The other crusader states to the north feared that Fulk would attempt to impose the suzerainty of Jerusalem over them, as Baldwin II had done; but as Fulk was far less powerful than his deceased father-in-law, the northern states rejected his authority.\nIn Jerusalem as well, Fulk was resented by the second generation of Jerusalem Christians who had grown up there since the First Crusade. These \"natives\" focused on Melisende's cousin, the popular Hugh II of Jaffa, who was devotedly loyal to the Queen. Fulk saw Hugh as a rival, and in 1134, in order to expose Hugh, accused him of infidelity with Melisende. Hugh rebelled in protest and secured himself to Jaffa, allying himself with the Muslims of Ascalon. He was able to defeat the army set against him by Fulk, but this situation could not hold. The Patriarch interceded in the conflict, perhaps at the behest of Melisende. Fulk agreed to peace and Hugh was exiled from the kingdom for three years, a lenient sentence.\nHowever, an assassination attempt was made against Hugh. Fulk, or his supporters, were commonly believed responsible, though direct proof never surfaced. The scandal was all that was needed for the queen's party to take over the government in what amounted to a palace coup. Author and historian Bernard Hamilton wrote that the Fulk's supporters \"went in terror of their lives\" in the palace. Contemporary author and historian William of Tyre wrote of Fulk \"he never attempted to take the initiative, even in trivial matters, without (Melisende's) consent\". The result was that Melisende held direct and unquestioned control over the government from 1136 onwards. Sometime before 1136 Fulk reconciled with his wife, and a second son, Amalric, was born.\nIn 1143, while the king and queen were on holiday in Acre, Fulk was mortally wounded in a hunting accident. His horse stumbled, fell, and Fulk's skull was crushed by the saddle, \"and his brains gushed forth from both ears and nostrils\", as William of Tyre describes. He was carried back to Acre, where he lay unconscious for three days before he died. He was buried in the Church of the Holy Sepulchre in Jerusalem. Though their marriage started in conflict, Melisende mourned for him privately as well as publicly. Fulk was survived by his son Geoffrey Plantagenet, Count of Anjou by his first wife, and Baldwin III and Amalric I by Melisende.\nBaldwin III ascended the throne with his mother as co-ruler, in 1143. His early reign was laced with squabbles with his mother over the possession of Jerusalem, till 1152, when he took personal hold of the government. He died in 1163, without heirs, and the kingdom passed to his brother, Amalric I, although there was some opposition among the nobility to Amalric's wife Agnes; they were willing to accept the marriage in 1157 when Baldwin III was still capable of siring an heir, but now the Haute Cour refused to endorse Amalric as king unless his marriage to Agnes was annulled. The hostility to Agnes may have been exaggerated by the chronicler William of Tyre, whom she prevented from becoming Latin Patriarch of Jerusalem decades later, as well as from William's continuators like Ernoul, who hints at a slight on her moral character: \"car telle n'est que roine doie iestre di si haute cite comme de Jherusalem\" (\"there should not be such a queen for so holy a city as Jerusalem\").\nNevertheless, consanguinity was enough for the opposition. Amalric agreed and ascended the throne without a wife, although Agnes continued to hold the title Countess of Jaffa and Ascalon and received a pension from that fief's income. The church ruled that Agnes's children were legitimate and preserved their place in the order of succession. Through them Agnes would exert much influence in Jerusalem for almost 20 years. Almaric was succeeded by his son by Agnes, Baldwin IV.\n]]\nAlmaric's first wife Agnes of Courtenay was now married to Reginald of Sidon;Maria Comnena, the dowager Queen, had married Balian of Ibelin in 1177. His daughter by Agnes, Sibylla, was already of age, the mother of a son, and was clearly in a strong position to succeed her brother, but Maria's daughter Isabella had the support of her stepfather's family, the Ibelins.\nIn 1179, Baldwin began planning to marry Sibylla to Hugh III of Burgundy, but by spring 1180 this was still unresolved. Raymond III of Tripoli attempted a coup, and began to march on Jerusalem with Bohemund III, to force the king to marry his sister to a local candidate of his own choosing, probably Baldwin of Ibelin, Balian's older brother. To counter this, the king hastily arranged her marriage to Guy of Lusignan, younger brother of Amalric, the constable of the kingdom. A foreign match was essential to bring the possibility of external military aid to the kingdom. With the new French king Philip II a minor, Guy's status as a vassal of the King and Sibylla's first cousin Henry II of England – who owed the Pope a penitential pilgrimage – was useful.\nBy 1182, Baldwin IV, increasingly incapacitated by his leprosy, named Guy as bailli. Raymond contested this, but when Guy fell out of favour with Baldwin the following year, he was re-appointed bailli and was given possession of Beirut. Baldwin came to an agreement with Raymond and the Haute Cour to make Baldwin of Montferrat, Sibylla's son by her first marriage, his heir, before Sibylla and Guy. The child was crowned co-king as Baldwin V in 1183 in a ceremony presided by Raymond. It was agreed that, should the boy die during his minority, the regency would pass to \"the most rightful heirs\" until his kinsmen – the Kings of England and France and Frederick I, Holy Roman Emperor – and the Pope were able to adjudicate between the claims of Sibylla and Isabella. These \"most rightful heirs\" were not named.\nBaldwin IV died in spring 1185, and was succeeded by his nephew. Raymond was bailli, but he had passed Baldwin V's personal guardianship to Joscelin III of Edessa, his maternal great-uncle, claiming that he did not wish to attract suspicion if the child, who does not seem to have been robust, were to die. Baldwin V died during the summer of 1186, at Acre. Neither side paid any heed to Baldwin IV's will.\nAfter the funeral, Joscelin had Sibylla named as her brother's successor, although she had to agree to divorce Guy, just as her father had divorced her mother, with the guarantee that she would be allowed to choose a new consort. Once crowned, she immediately crowned Guy. Meanwhile, Raymond had gone to Nablus, home of Balian and Maria, and summoned all those nobles loyal to Princess Isabella and the Ibelins. Raymond wanted instead to have her and her husband Humphrey IV of Toron crowned. However, Humphrey, whose stepfather Raynald of Châtillon was an ally of Guy, deserted him and swore allegiance to Guy and Sibylla.\n{|class=\"wikitable\"\n|-\n! Monarch\n! Image\n! Birth\n! Marriages\n! Death\n! Notes\n|-\n|Fulk1131–1143with Melisende ||   || 1089/1092Angers, Franceson of Fulk IV, Count of Anjou and Bertrade de Montfort || Ermengarde of Maine11094 childrenMelisende of Jerusalem2 June 11292 sons || 13 November 1143Acre, Kingdom of Jerusalemaged about 52\n||\n|-\n|Baldwin III1143–1163with Melisende until 1152 ||  ||1130son of King Fulk and Queen Melisende || Theodora Komnene1158no children || 10 February 1163Beirut, Kingdom of Jerusalem aged 33 || Crowned co-king with his mother Melisende on Christmas Day 1143 shortly after the death of his father Fulk. Just 13 year old when he ascended to the throne, he immediately had to deal with the loss of Edessa in 1144 and the Second Crusade through 1149. He engaged his mother in a civil war from 1152 to 1154, with the two eventually reconciling. He was responsible for the military first success after the Second Crusade, the siege of Ascalon of 1153, resulting in the capture of a strategic fortress from the Fatimids. In 1156, Baldwin was forced into a treaty with Nūr-ad-Din, and later entered into an alliance with the Byzantine Empire. Melisende died on 11 September 1161, and Baldwin succumbed two years later on 10 February 1163. Childless, he was succeeded by his brother, Amalric.\n|-\n|Amalric1163–1174 ||  || 1136son of King Fulk and Queen Melisende || Agnes of Courtenay11573 childrenMaria Komnene29 August 11672 children || 11 July 1174Jerusalemaged 38 || Crowned as King of Jerusalem on 18 February 1163. He married Agnes of Courtenay and, after an annulment, Maria Komnene. Three of Amalric's children would assume the throne of Jerusalem. He undertook a series of four invasions of Egypt from 1163 to 1169, taking advantage of weaknesses of the Fatimids. The campaign was generally indecisive, but did lay the groundwork for the takeover of Egypt by Saladin in 1171. Amalric died at a young age, on 11 July 1174, and was succeeded by his son Baldwin IV of Jerusalem.\n|-\n|Baldwin IV the Leprous1174–1185with Baldwin V from 1183 ||  || 1161Jerusalemson of King Amalric and Agnes of Courtenay || never married || 16 March 1185Jerusalemaged 24  || Became king on 5 July 1174 at the age of 13. As a leper he was not expected to live long, and served with a number of regents, and served as co-ruler with his nephew Baldwin V of Jerusalem beginning in 1183. Baldwin IV's rule began simultaneously with the death of Nūr-ad-Din and the rise of Saladin. Notably, Baldwin and Raynald of Châtillon defeated Saladin at the celebrated battle of Montgisard on 25 November 1177, and repelled his attacks at the battle of Belvoir Castle in 1182 and later in the siege of Kerak of 1183. He died on 16 March 1185.\n|-\n|Baldwin V1183–1186with Baldwin IV until 1185 ||  || 1177son of William of Montferrat and Sibylla of Jerusalem || never married || August 1186Acre, Kingdom of Jerusalemaged 9 || Became sole king upon the death of his uncle in 1185 under the regency of Raymond III of Tripoli. Raymond negotiated a truce with Saladin which went awry when Baldwin V died in the summer of 1186. He was succeeded in the kingdom by his mother Sibylla of Jerusalem—daughter of Amalric—and his stepfather, the French knight Guy of Lusignan.\n|-\n|Sibylla1186–1190with Guy ||  ||  c. 1157daughter of King Amalric and Agnes of Courtenay || William of Montferrat, Count of Jaffa and Ascalon1176one sonGuy of LusignanApril 11802 daughters || 25 July (probable), 1190Acre, Kingdom of Jerusalemaged about 40 || rowspan=\"2\"| Crowned as queen and king of Jerusalem in the summer of 1186, shortly after the death of Baldwin V. They immediately had to deal with the threat posed by Saladin, and, in particular the battle of Hattin in 1187. During the battle Guy was captured, and remained in Saladin's custody until 1188. After the fall of Jerusalem, Sibylla fled to Tripoli, later joining Guy in Acre to meet the vanguard of the Third Crusade. She died on 25 July 1190.\n|-\n|Guy of Lusignan1186–1190/1192with Sibylla until 1190 ||  || c. 1150 or 1159/1160son of Hugh VIII of Lusignan and Bourgogne de Rançon || Sibylla of JerusalemApril 11802 daughters || 18 July 1194Nicosia, Cyprusaged about 45\n|-\n|Isabella I1190/1192-1205with Conrad until 1192with Henry II 1192–1197with Amalric II from 1198 || rowspan=\"2\"|  || 1172Nablus, Kingdom of Jerusalemdaughter of King Amalric I and Maria Komnene || Humphrey IV of ToronNovember 1183no childrenConrad of Montferrat24 November 1190one daughterHenry II, Count of Champagne6 May 11923 daughtersAmalric of LusignanJanuary 11983 children || 5 April 1205Acre, Kingdom of Jerusalemaged 33 || rowspan=\"2\"| Sister to Sibylla, became heiress to the kingdom upon her death, sometime after 25 July 1190. After much political haranguing, she married Conrad of Montferrat on 24 November 1190, with him become de jure king. In April 1192, Conrad was elected king but on 28 April 1192, he was felled by two Assassins before he could be crowned. His political rival Richard I of England was suspected as having supported the murder, a suspicion that remains unproven.\n|-\n|Conrad I of Montferrat1190/1192–1192with Isabella I || mid-1140sMontferrat, Holy Roman Empireson of William V, Marquess of Montferrat and Judith of Babenberg || unidentified womanbefore 1179no childrenTheodora Angelina1186/1187no childrenIsabella I of Jerusalem24 November 1190one daughter || 28 April 1192 (murdered)Acre, Kingdom of Jerusalemaged mid-40s\n|-\n|Henry I of Champagne1192–1197with Isabella I || || 29 July 1166Champagneson of Henry I, Count of Champagne and Marie of France || Isabella I of Jerusalem6 May 11923 daughters || 10 September 1197Acre, Kingdom of Jerusalemaged 31 || Became king on 5 May 1192 when he married Isabella. Henry was the nephew of both Richard I of England and Philip II of France, but did not use the royal title. He died in Acre on 10 September 1197 after a fall from his window at the palace in Acre.\n|-\n|Aimery of Lusignan1198–1205with Isabella I ||  ||  1145son of Hugh VIII of Lusignan and Bourgogne de Rançon || Éschive d'Ibelinbefore 29 October 11746 childrenIsabella I of JerusalemJanuary 11983 children || 1 April 1205Acre, Kingdom of Jerusalemaged 60 || As Isabella's next husband, they were crowned king and queen of in January 1198. A former commander at the Battle of Hattin of 1187 as well as King of Cyprus since the death of Guy of Lusignan in 1194, his rule was a period of peace and stability in both of his realms.  In particular, he signed a truce with al-Adil, now Ayyubid sultan of Egypt in 1198 which secured the Christian possession of the coastline from Acre to Antioch. This truce essentially prevented the remnants of the Fourth Crusade from their mission. He died on 1 April 1205. His son Hugh I of Cyprus succeeded him in Cyprus, while Isabella I continued to rule the Kingdom of Jerusalem. Isabella died four days later on 5 April 1205 and was succeeded by her daughter by Conrad, Maria of Montferrat, who served through 1212, with her husband John of Brienne after 1210.\n|}\nHouses of Aleramici and Brienne (1205–1228)\n{|class=\"wikitable\"\n|-\n! Monarch\n! Image\n! Birth\n! Marriages\n! Death\n|-\n|Maria1205–1212with John I from 1210 || rowspan=\"2\"|  ||  1192daughter of Conrad of Montferrat and Queen Isabella || John of Brienne14 September 1210one daughter || 1212aged 20\n|-\n|John I1210–1225with Maria until 1212with Isabella II from 1212 || c. 1170son of Erard II of Brienne and Agnes de Montfaucon || Maria of Jerusalem14 September 1210one daughterStephanie of Armeniaone sonBerengaria of León12244 children || 27 March 1237aged about 67\n|-\n|Isabella IIalso called Yolande1212–1228with Frederick from 1225 ||   || 1212daughter of John of Brienne and Queen Maria || Frederick II, Holy Roman Emperor9 November 12252 children || 25 April 1228Andria, Kingdom of Sicilyaged 16\n|-\n|Frederick1225–43with Isabella II until 1228with Conrad II from 1228 ||   || 1194son of Henry VI, Holy Roman Emperor and Constance of Sicily || Constance of Aragon  15 August 1209  one son  Isabella II of Jerusalem9 November 12252 childrenIsabella of England  15 July 12354 children || 13 December 1250Apulia, Kingdom of Sicilyaged 55\n|}\nHouse of Hohenstaufen (1228–1268)\n{|class=\"wikitable\"\n|-\n! Monarch\n! Image\n! Birth\n! Marriages\n! Death\n|-\n|Conrad II1228–1254 ||  ||  25 April 1228Andria, Kingdom of Sicilyson of Frederick II, Holy Roman Emperor and Queen Isabella II || Elisabeth of Bavaria1 September 1246one son || 21 May 1254Lavello, Kingdom of Sicilyaged 26\n|-\n|Conrad III1254–1268 ||  ||  25 March 1252Wolfstein Castle, Landshut, Bavaria, Holy Roman Empireson of King Conrad II and Elisabeth of Bavaria || never married || 29 October 1268Castel dell'Ovo, Naples, Kingdom of Sicilyaged 16\n|}\nHouse of Lusignan (1268–1291)\n{|class=\"wikitable\"\n|-\n! Monarch\n! Image\n! Birth\n! Marriages\n! Death\n|-\n|Hugh1268–1284 ||||  1235son of Henry of Antioch and Isabella of Cyprus, a granddaughter of Queen Isabella I || Isabella of Ibelinafter 25 January 125511 children || 24 March 1284Nicosia, Cyprusaged 49\n|-\n|John II1284–1285 ||  ||    1259/1267son of King Hugh and Isabella of Ibelin || never married || 20 May 1285Nicosia, Cyprusaged 17 or 26\n|-\n|Henry II1285–1324in title only after 1291 ||     ||   1271son of King Hugh and Isabella of Ibelin || Constance of Sicily16 October 1317no children || 31 August 1324Strovolos, Cyprusaged 53\n|}\nRegents\nThe frequent absence or minority of monarchs required regents to be appointed many times throughout the Kingdom's existence.\n{|class=\"wikitable\"\n|-\n! Regent\n! Regent for\n! Relation to the monarch\n! Became regent\n! Regency ended\n|-\n|Eustace Grenier, Constable of the Kingdom || rowspan=\"2\"|Baldwin II || – || 1123King held captive by the Ortoqids || 1123death\n|-\n|William I of Bures, Prince of Galilee || – || 1123King held captive by the Ortoqids || 1124return of the King from captivity\n|-\n|Queen Melisende || Baldwin III || mother || 1154as the King's advisor || 1161death\n|-\n|Raymond III, Count of Tripoli || rowspan=\"2\"|Baldwin IV || cousin || 1174minority of the King  || 1176majority of the King\n|-\n|Guy of Lusignan || brother-in-law || 1182appointed by the King in his illness || 1184deposed by the King\n|-\n|Raymond III, Count of Tripoli || Baldwin V || first cousin once removed || 1185minority of the King || 1186death of the King\n|-\n|John of Ibelin, the Old Lord of Beirut || Maria || half-uncle || 1205minority of the Queen || 1210majority of the Queen\n|-\n|King John I || Isabella II || father || 1212minority of the Queen || 1225the Queen's marriage\n|-\n|Frederick II, Holy Roman Emperor || rowspan=\"4\"|Conrad II || father || 1228minority of the King || 1243majority of the king\n|-\n|Alice of Champagne, Queen of Cyprus || half-aunt || 1243absence of the king || 1246death\n|-\n|Henry I of Cyprus || half-cousin; son of Alice and Hugh I || 1246absence of the King || 1253death\n|-\n|rowspan=\"2\"|Plaisance of Antioch, dowager Queen of Cyprus || half-cousin-in-law || rowspan=\"2\"|1253absence/minority of the King || rowspan=\"2\"|1261death\n|-\n|rowspan=\"3\"|Conrad III || half-cousin-in-law once removed\n|-\n|Isabelle de Lusignan || half-cousin once removed; daughter of Alice || 1261minority of the King || 1264death\n|-\n|Hugh of Antioch || half-second cousin; son of Isabelle || 1264minority of the King || 1268death of the King, ascension to the throne\n|}\nLater claims\n: 10 Paoli Francesco III of Tuscany, 1747. On the front of the coin is the Latin phrase: \"FRANCISCVS·D·G·R·I·S·A·G·H·REX·LOT·BAR·M·D·ETR\" (François I, By the Grace of God, Emperor of the Romans, Always Augustus, King of Germany and Jerusalem, Duke of Lorraine and Bar, Grand Duke of Tuscany)]]\nOver the years, many European rulers claimed to be the rightful heirs to the kingdom.  None of these claimants, however, has actually ruled over any part of Outremer:\n* Count Hugh of Brienne claimed the regency of the Kingdom of Jerusalem, and indirectly, his place in the succession in 1264 as senior heir of Alice of Jerusalem, second daughter of Queen Isabella I, and Hugh I of Cyprus.  Hugh, although the son of their eldest daughter, was passed over by the Haute Cour in favour of his cousin Hugh of Antioch, the future Hugh III of Cyprus and Hugh I of Jerusalem.  The Brienne claim to the Kingdom of Jerusalem continued, but the family had afterwards next to no part in affairs in Outremer.\n* Frederick of Meissen, Landgrave of Thuringia, briefly used the title of King of Jerusalem (alongside the titles of King of Sicily and Duke of Swabia) after the death of Conradin in 1268, as grandson of Frederick II, who had crowned himself King of Jerusalem in his own right. This claim was never recognized in Outremer or elsewhere.\n* After the end of the kingdom, Henry II of Cyprus continued to use the title of King of Jerusalem.  After his death the title was claimed by his successors, the kings of Cyprus.\n* The title was also continuously used by the Angevin kings of Naples, whose founder, Charles I of Anjou, had in 1277 bought a claim to the throne from Mary of Antioch.  Thereafter, this claim to the Kingdom of Jerusalem was treated as a tributary of the crown of Naples, which often changed hands by testament or conquest rather than direct inheritance.  As Naples was a papal fief, the Popes often endorsed the title of King of Jerusalem as well as of Naples, and the history of these claims is that of the Neapolitan Kingdom. At the time of their dethronement, the Habsburg Emperors of Austria used the title King of Jerusalem, as did the Savoyard kings of Italy, and the title is among those claimed by Felipe VI of Spain.\n* In 1948 King Abdullah I of Jordan was crowned king of Jerusalem by the Coptic bishop.\nFamily tree\n}}\nSee also\n* List of queens of Jerusalem\n* Family tree of Kingdom of Jerusalem monarchs\n* Timeline of the Kingdom of Jerusalem\nReferences\nBibliography\n*\n*\n*\nFurther reading\n* [https://scholar.harvard.edu/files/abeaver/files/dissertation.pdf Adam G. Beaver, A Holy Land for the Catholic Monarchy: Palestine in the Making of Modern Spain, 1469–1598]"
    }
  ]
}