{
  "content": [
    {
      "type": "text",
      "text": "# Kings Contrivance, Columbia, Maryland\n\n| established_title1      =\n| established_date1       =\n| established_title2      =\n| established_date2       =\n| established_title3      =\n| established_date3       =\n| extinct_title           =\n| extinct_date            =\n| founder                 =\n| named_for               = The King's Contrivance restaurant\n| website                 =\n| footnotes               =\n| coordinates             =\n}}\nKings Contrivance is a village in the planned community of Columbia, Maryland, United States and is home to approximately 11,000 residents. It is Columbia's southernmost village, and was the eighth of Columbia's ten villages to be developed. Kings Contrivance consists of the neighborhoods of Macgill's Common, Huntington and Dickinson, and includes single-family homes, townhouses, apartments and a Village Center (open-air shopping center).\nEtymology\nThe village takes its name from a local restaurant that was opened in 1962 by Kingdon Gould, Jr. in an old county home that previously belonged to the Macgill family. Gould named his restaurant \"The King's Contrivance\", which combined his nickname with the word \"contrivance\". This name was inspired by the names of old Colonial-era land grants, many of which were referred to as the \"contrivances\" of their owners. In 1967, Gould sold the restaurant to the Rouse-related developer of Columbia, the Howard Research and Development Corporation. In 1973, Kings Contrivance was selected as the name of the new village \"because of its familiarity and identification with the area of the village.\"\nHistory\nOver a period of time, developer James W. Rouse became interested in building a new model city, and in the early 1960s, his company, The Rouse Company, with funding provided by Connecticut General Life Insurance Company, acquired over 14,000 acres in Howard County, Maryland for that purpose. Together, the Rouse Company and Connecticut General formed The Howard Research and Development Corporation (HRD) to develop the new town of Columbia. In October 1963, the plans for the new city were made public. In 1965 the Howard County government approved the HRD's requested master plan for Columbia which included a new zoning classification, New Town zoning, that applied to the HRD's development of Columbia and which allowed for considerable flexibility in that development.\nIn November 1973, the HRD announced plans for its newest village, Kings Contrivance. Development of Kings Contrivance, however, was subsequently delayed due to the effects of the 1973–75 recession. The first neighborhood of Kings Contrivance, Macgill's Common, opened in 1977.\nMacgill's Common and the vast majority of the Dickinson neighborhood are located on land that was sold to HRD in September 1963 by Overlook, Inc., a company owned by Kingdon Gould. Overlook, Inc. had acquired the land in several purchases in 1960 and 1961. The Macgill's Common and Dickinson areas were included in the original 1965 New Town zoning district, and in 1966 was subjected to the Columbia Association lien that generally delineates the boundaries of Columbia. Most of the land in the Huntington neighborhood was not acquired by HRD until 1971, and was added to the New Town zoning district in December 1976.\nThe neighborhood of Macgill's Common opened in 1977, Huntington in 1979, and Dickinson in 1982.\nIn 1999 the HRD proposed that an additional 517-acre tract be annexed to Columbia as Kings Contrivance's fourth neighborhood. The tract, initially known as the Key property, but later called Emerson, was located on Gorman Road and bordered Route 216 and straddled I-95. It had been acquired by HRD in 1971 from a firm led by Kingdon Gould, and was about two miles from the nearest part of Kings Contrivance. Opponents of the proposal contended that Emerson was too distant from the rest of Kings Contrivance and that the Columbia Association would be required to make expensive near-term expenditures to provide amenities for the new neighborhood, including a swimming pool and pathways. Supporters of the proposal argued that annexation of Emerson would generate considerably more revenue for the Columbia Association in the long-run. In November 2000 the Columbia Council, governing board of the Columbia Association, rejected the annexation proposal by a 7-to-3 vote, with Kings Contrivance's representative supporting it. Emerson was subsequently developed separately from Columbia.\nNeighborhoods\nMacgill's Common\nMacgill's Common is Kings Contrivance's first neighborhood. It is bounded on the south by Route 32, on the west by Route 29, on the north by the Donleigh, Arrowhead and Allview neighborhoods, and on the east it straddles the Little Patuxent River.\nAccording to the original 1973 plans for Kings Contrivance, the neighborhood was to be called Macgill's Range, and was to include single family homes and a 35-acre 18-hole golf course that was to be built and operated by the Columbia Association. The HRD promoted the golf course as a future revenue source for the Columbia Association that would lessen reliance on property assessments, while critics of the plan charged that its purpose was to allow HRD to charge more for property in the neighborhood. In March 1974 the Columbia Association, which was then still dominated by the HRD, approved a budget that called for building the golf course. In July 1974, however, HRD announced that it was delaying development of Kings Contrivance and Macgill's Range indefinitely due to slow real estate sales caused by the 1973–75 recession.\nDevelopment of Kings Contrivance did not resume until the Spring of 1976, with the first work beginning on what was now called Macgill's Common in October 1976. Macgill's Common officially opened on June 25, 1977, and the golf course was never built there.\nIn 2010, Macgill's Common had 2,603 residents.\nMost of Macgill's Common is located on Athol, a tract that was patented to Reverend James Macgill in 1732. Some parts closer to the Little Patuxent River are located on Brown's Hopyard, which was patented to Robert Brown in 1725. The village takes its name from the Reverend James Macgill, first pastor of Christ Church Guilford, and resident of Athol Manor. Prominent heir, land planner and Judge James Macgill lived in the house that later became The King's Contrivance restaurant as a child, selling the 780-acre estate and home to Kingdon Gould for development through a company named Overlook Inc., after his personal Overlook Farm Estate.\nThe street names of Macgill's Common come from the Folk Songs of North America compilation recorded by Alan Lomax.\nHuntington\nHuntington is bordered on the north by the Little Patuxent River, on the south by the Middle Patuxent River, on the west by Broken Land Parkway (if extended), and on the east it straddles I-95. Another part, known as Huntington East, is about one mile east of the main part of Huntington, and is located on Savage-Guilford Road.\nAlthough HRD bought the Vollmerhausen farm property in 1963 (which roughly covered the area from the Vollmerhausen Drive/Keepsake Way line eastward to straddle I-95), only about 25 percent of Huntington was included in the original 1965 Columbia New Town zoning district. By the mid-1960s, most of what would become Huntington was owned by Contee Sand & Gravel Company and other related companies that were led by Homer Gudelsky. In 1965, one of those companies, the Guilford Granite and Stone Company, applied for a permit to operate a granite quarry on the 315 acres that it and its related companies owned. Under the proposal, a 60-acre area would be quarried, and when the quarry was exhausted in about 25 years, a reservoir would be created. Those who opposed the proposal included James Rouse, developer of Columbia, and Kingdon Gould, who lived on the property on the south side of the Middle Patuxent River across from the proposed quarry property.  In early 1966, County officials denied the application for a quarry permit.  In 1969, another attempt was made by Contee Sand & Gravel to obtain a permit to operate a stone quarry on the property. This application also met with stiff opposition, including again from Gould. After lengthy hearings, county officials denied the request in April 1970.\nIn August 1971, Contee sold its 349-acre tract to HRD for $2.4 million. Thereafter, HRD agreed to sell the Huntington property to The Marriott Corporation. The sale was contingent on Marriott obtaining approval to build a theme park on the land.\nIn January 1972, Marriott announced its plans for the massive theme park. It was to be called \"Marriott's Great America\" and was to include four separate entertainment areas: a park with thrill rides; a marine life park; a drive through animal preserve; and a New Orleans-styled indoor plaza with specialty shops, theatres and restaurants. A 600-room hotel and a campground were also to be built in the park. Marriott projected that the park would draw 11 million visitors a year when completed. Many local residents supported the project, while many others opposed it. Supporters argued that it would provide jobs, entertainment opportunities and tax revenues, while opponents contended that it would overwhelm area roads and the local sewerage system, and that it would result in undesired commercial sprawl. Opponents of the proposed park included Kingdon Gould. HRD and the Rouse Company defended criticism of their sale of the property to Marriott in part on the grounds the theme park would result in more open space than residential development of the land. In September 1972, the County Council rejected Marriott's request for changes in zoning laws that were needed for the project to go forward. The sale of the land by HRD to Marriott was never completed.\nIn late 1973, HRD announced plans to annex its Huntington property to Columbia and the New Town district as part of Kings Contrivance. The land to be annexed amounted to about 500 additional acres that had not been made part of Columbia in 1965, and about 75% of what was to become Huntington. The HRD's plan to add Huntington to the New Town district was part of a larger proposal. Although adding Huntington was not controversial, other parts of the HRD's proposal were, especially its request to increase the number of townhouses and apartments that it was permitted to build in the New Town zone. Lengthy hearings and appeals ensued, and it was not until December 1976 that HRD's request to add Huntington to the New Town district was finally granted.\nHuntington opened for home sales on June 1, 1979. When developed, Huntington had the highest percentage of open space of any Columbia neighborhood, with about 330 of its 613 acres preserved as open land and woodland.\nHuntington had 3,202 residents according to the 2010 Census.\nHuntington is located on Wincopin Neck, an 883-acre tract patented to Benjamin and Richard Warfield in 1702. The neighborhood is named for a historic home land grant of 259 acres to the son of Henry Ridgely Sr. in 1696.\nThe street names of Huntington are primarily derived from the works of Carl Sandburg, although some come from the poems of Emily Dickinson and Walt Whitman. Huntington South, an outparcel surrounded by Huntington, was developed in 1986 by the Security Development Company, which requested input from the Rouse Company in naming the streets in its development. The list of names provided, including Lumberjack Row, Red Rain Way and Windbeat Way, were also taken from Sandburg poems.\nDickinson\nDickinson lies south of Route 32, and is bordered on the east by Broken Land Parkway and Huntington, and on the south by the Middle Patuxent River. On the west, it nears Old Columbia Road.\nDickinson opened September 25, 1982. The neighborhood takes its name from the famous American poet, Emily Dickinson and has street names taken from her works.\nDickinson had a population of 5,523 in 2010.\nDickinson is located on land that was included in of a number of Colonial land patents, including Ridgely's Neck (patented to Henry Ridgely in 1716), Broken Land (Thomas Worthington and Henry Ridgely&nbsp;– 1722), The Addition (Thomas Worthington&nbsp;– 1730) and Bare Hills (John Parr&nbsp;– 1734).\nAt one time Kindler Road ran from Guilford Road, in what is now Dickinson, across a bridge over the Middle Patuxent River and then to Gorman Road in Hammond Village. The bridge, however, washed out during Tropical Storm Agnes in June 1972 and was not replaced. Parts of the bridge abutment are still present.\nVillage Center\nThe Kings Contrivance Village Center is located in the Dickinson neighborhood at the intersection of Guilford Road and Eden Brook Drive.\nThe Village Center opened on June 14, 1986. It was originally anchored by Valu Food, a local supermarket chain. After Valu Food went out of business, a Safeway opened in the Village Center in late 1999. The  Safeway store and a nearby Friendly's Restaurant were demolished in 2006 to make way for a new  Harris Teeter supermarket. The new Harris Teeter, the second in Maryland, opened in May 2008. In November 2011, the Corner Stable replaced Michael's Pub as the flagship restaurant in the village center. Michael's Pub, which had been located in the center since 1986, was unable to stay in business after it spent $200,000 to construct an enclosed and separately ventilated smoking area in its bar that complied with existing law, only to have Howard County  thereafter prohibit smoking anywhere in bars.\nAmherst House, the location of the Kings Contrivance Community Association, is also in the village center. This building, named after Emily Dickinson's hometown in Massachusetts, also serves as a rental hall for community events, parties, and meetings.\nParks and recreation\nEach of the three neighborhoods of Kings Contrivance has a community swimming pool operated by the Columbia Association.\nVarious scenic trails weave within and around the neighborhoods of Kings Contrivance, providing access to Columbia's extensive bike/hiking trail system and County parks. These trails include The Patuxent Branch Trail, which runs along the Little Patuxent River, connecting Huntington and Magill's Common to Lake Elkhorn. Along the Middle Patuxent River, the Dickinson neighborhood includes extensive paths that are located within the Gorman Stream Valley Natural Resource Area. Recreational parks located in and near Kings Contrivance include Gorman Park, Huntington Neighborhood Park, and Savage Park, all of which are maintained by Howard County Recreation and Parks.\nEducation\nThe public schools serving the village are:\n*Elementary Schools\n**Atholton Elementary School\n**Bollman Bridge Elementary\n**Forest Ridge Elementary\n**Guilford Elementary\n**Hammond Elementary\n*Middle Schools\n**Patuxent Valley Middle\n**Hammond Middle\n**Murray Hill Middle\n*High School\n**Hammond High School\nMiscellaneous\nIn 1992 the South Columbia Baptist Church was built on Guilford Road adjacent to Hammond High School after a historic 1846 granite home \"Moundland\" was demolished. Thirty truckloads of stone from Moundland were used by Bruno Reich to renovate his home in Wilde Lake. That renovation project was featured in the show \"Dream House\" on the HGTV television network.\nScenes from the movie Roulette (2013) were filmed at the Kings Contrivance restaurant.\nSee also\n*Guilford, Maryland\nReferences\nExternal links\n*[http://www.kingscontrivancecommunityassociation.org/ Kings Contrivance Community Association]"
    }
  ]
}