{
  "content": [
    {
      "type": "text",
      "text": "# King's Cross railway accident\n\n| route_map_state     =\n| route_map_name      = Location within Greater London\n| footnotes           = List of UK rail accidents by year\n}}\nThe '''King's Cross railway accident''' occurred on 4 February 1945, at London King's Cross railway station on the East Coast Main Line of the London & North Eastern Railway. Two passengers were killed and 25 injured, as well as the train attendant.\nDescription\nThe situation\nThe exit from Kings Cross station is through Gasworks Tunnel, which has three bores, each of which had two tracks at the time of the accident. The centre bore had the No. 1 down main line on its western side, and the up relief line on its eastern side. Trains from platforms 5, 6 or 7 gained the no. 1 down main line via a crossover from the up relief line, which was controlled by points no. 145. One end of this crossover was inside the tunnel. When points 145 were \"reversed\", the no. 1 down main line could be reached from platforms 5, 6 or 7; when points 145 were \"normal\", this line was reached from platforms 8 to 17. The signal box controlling this was situated at the end of platforms 5 & 6.\nThe track is level through platform 5; it then dips at 1 in 100 (1%) for , to a point  inside the tunnel, where the line passes beneath Regent's Canal; it then rises at a gradient of 1 in 105 (0.95%) through the tunnel for a total of . Because of the gradient in the tunnel, it had been the practice since December 1943 for heavy trains to be assisted for the first  by being propelled by the locomotive which had hauled the empty coaches into the platform.\nDuring the night and morning of 3–4 February 1945, the worn rails of no. 1 down main line had been replaced with new ones as part of routine maintenance; this line had been in use since 12:45 on 4 February.  The newly laid rails had lower adhesion, and the first (empty) train to travel on them slipped to a stand on the incline.\nThe train\nOn 4 February 1945, the 18:00 service from Kings Cross to Leeds was formed of 17 coaches hauled by Class A4 4-6-2 locomotive no. 2512 Silver Fox, which had been built in 1935. It was in normal condition but some trouble had been experienced that day with the sanding gear.\nThe rearmost coach was a Vestibuled Brake Composite, no. 1889, which had been built at Doncaster in 1941 as part of an order for ten (authorised in 1939 against order no. 999). The design, known as Diagram 314, used a steel underframe  long, mounted on two bogies each having a wheelbase of , spaced at  centres. The body was  long,  wide, and built largely of wood, principally teak. It consisted of two first-class compartments in the centre seating six each, flanked on one side by three third-class compartments also seating six each, and on the other side by a brake section for the guard. There was a side corridor, and unlike other pre-war designs of brake composite on the LNER, the external doors in the body sides were in vestibules close to the ends, instead of in the compartments; a feature which had been gradually introduced from 1930.\nEvents\nOn this occasion the train was not assisted, because the coaches had been propelled, rather than hauled, into the platform, and so there was no locomotive at the rear as was the usual arrangement. The train left platform 5 at King's Cross station five minutes late, and entered Gasworks Tunnel. When it reached the rising gradient at the far end of the tunnel the locomotive began to slip badly on a section of newly replaced rail. In the absence of an assisting locomotive and with its own sanding equipment not working fully, no. 2512 was unable to grip the rail and eventually came to a stand. Preoccupied with his tasks at the controls and operating in darkness the driver didn't notice when the train slowed to a stop, and then began to run backwards.\nMeanwhile, the points behind the train (no. 145) had been set for the next departure, which was to be from Platform 10. The coaches for this service, the 19:00 Aberdonian to , were already in the platform.  The signalman became aware of the 18:00 train rolling back and operated the points again in order to route it into unoccupied platform 15, but he was too late; the first bogie of the rear coach (BCK no. 1889) had already passed. This caused the two bogies to take different tracks. The rear of the train collided with the front of the coaches in platform 10. The rear coach rose into the air and struck a signal gantry, crushing one of the two first-class compartments in the middle of the coach. Two passengers were killed, one of whom was Cecil Kimber, the former managing director and co-founder of the MG car company.\nAfter the accident\nThe signal gantry demolished in the collision carried shunting discs and platform indicators in addition to main aspect signals. In an emergency measure hand signallers were introduced to control main line trains using platforms 6 to 17, as well as movements to and from the locomotive yard. Suburban services were terminated and turned round at .\nCoach no. 1889 was so severely damaged that it was written off. It had been scheduled to be renumbered 10153, but that number then remained unused.\nTwo weeks later, the signal gantry was replaced, but complete services were not restored until 23 February 1945.\nThe accident has variously been described as \"somewhat bizarre\" and \"stupid\".\nThe Inspecting Officer, Col. Wilson, concluded in his report that the main fault lay with the driver. Although it was difficult for him to tell which direction he was moving in the tunnel, he should have anticipated the possibility that he might roll back after the prolonged slipping.  He did not realise for some minutes after the train had stopped that a collision had occurred.\nA similar accident occurred at Glasgow Queen Street in 1928, involving a lighter train but on a much steeper gradient.\nNotes\nReferences\n*\n*\n*\n* }}\n*\n*\n*\n*"
    }
  ]
}