{
  "content": [
    {
      "type": "text",
      "text": "# Kington Town F.C.\n\n| season   =\n| position =\n| pattern_la1=|pattern_b1=|pattern_ra1=|leftarm1=F1EF20|body1=F1EF20|rightarm1=F1EF20|shorts1=F1EF20|socks1=F1EF20\n| pattern_la2=|pattern_b2=|pattern_ra2=|leftarm2=E00922|body2=E00922|rightarm2=E00922|shorts2=E00922|socks2=E00922\n}}\nKington Town Football Club is a football club based in Kington, Herefordshire, England. They are currently members of the  and play at Mill Street.\nHistory\nThe club was established in 1875. In 1923 they joined Division One of the Mid Wales League, but left after a single season. They returned to the league in 1951, and were champions in 1954–55. The club were Mid Wales League runners-up in 1957–58, but left the league again in 1960. However, they returned the following season, and were champions for a second time in 1963–64. The club were champions again in 1965–66. After leaving the league in 1977, they returned in 1981, but finished bottom of the table in 1981–82. The club left the league again in 1984, before returning in 1990.\nIn 1996 Kington transferred to Division One South of the West Midlands (Regional) League. They won the division at the first attempt and were promoted to the Premier Division. The club went on to win the Premier Division Cup in 1997–98 and both the Premier Division title and Premier Division Cup the following season. In 2000–01 they won the Herefordshire Senior Cup with a 1–0 win over Ross Town in the final. The club were Premier Division runners-up and Premier Division winners in 2002–03, and won the Herefordshire Senior Cup again in 2003–04.\nAfter finishing second-from-bottom of the division in 2005–06, Kington dropped into the Herefordshire League, replacing their reserves in the Premier Division. The 2008–09 season saw the club finish bottom of the Premier Division, but avoid relegation to Division One. They returned to the West Midlands (Regional) League in 2014, joining Division Two. The club went on to win Division Two in 2014–15, earning promotion to Division One. At the end of the 2017–18 season they resigned from the West Midlands (Regional) League to join the Herefordshire League. In 2020 the club joined Division Two West of the Hellenic League. They subsequently transferred to the Herefordshire League Premier Division in 2022.\nHonours\n*West Midlands (Regional) League\n**Premier Division champions 1998–99\n**Division One South champions 1996–97\n**Division Two champions 2014–15\n**Premier Cup Winners 1997–98, 1998–99, 2002–03\n*Mid Wales League\n**Champions 1954–55, 1963–64, 1965–66\n*Mid Wales South League\n**Champions 1988–89\n*Herefordshire Senior Cup\n**Winners 2000–01, 2003–04\n*Radnorshire Cup\n**Winners 1992–93\nRecords\n*Best FA Vase performance: Second round, 1998–99\nSee also\n*\nReferences\nExternal links\n*[https://www.facebook.com/KingtonTownFC/ Official website]"
    }
  ]
}