{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom Rush: Origins\n\n| released =\n| genre = Tower defense\n| modes = Single-player\n}}\nKingdom Rush: Origins is a 2014 tower defense game developed by Ironhide Game Studio. The third entry in the Kingdom Rush series, it was released for iOS and Android on November 20, 2014, and for Nintendo Switch on September 17, 2020. In the game, players take control of a nation of elves as they attempt to defend themselves from their evil enemies. Monsters can be defeated using four types of defensive towers, which can all be upgraded in order to better fight against increasing waves of enemies.\nGameplay\nKingdom Rush: Origins is a tower defense game in a high-fantasy setting. The player takes control of a nation of elves as they defend themselves from their ancient enemies. At the start of a level, players possess a limited amount of gold, which they can use to build defensive towers on fixed locations around a path. Enemies advance across the path from a number of pre-set entrances, and the player must stop them from reaching the end. The player possesses four types of towers, including archers which are more effective at fighting weaker enemies, and boulder-throwing towers that have attacks suited for slaying powerful foes. Infantry towers fight on the path itself and can prevent enemies from advancing, allowing towers to deal damage while the enemies are slowed. As enemies are slain, they give the player gold, which can be spent to build more towers and upgrade existing ones with better damage and new attacks. If an enemy reaches the exit, they drain lives from the player, and the depletion of all the lives causes a game over.\nIn addition to towers, the player is also given control of a powerful \"hero\" character that can be instructed to move to any part of the path, and can be used to fight powerful enemies. Heroes include ranged attackers that fight from a distance, to warriors better suited to fighting enemies in melee combat. Each hero has five different capabilities that can be upgraded using a currency gained from completing levels, and the player can choose which hero they want to use or upgrade.\nReception\n}}\nNintendo Life praised the graphics and the accessibility of gameplay, but said that the pacing of levels was too slow, and hurt the experience. Game Informer liked the graphics, controls, and structure of gameplay, which he found familiar to earlier entries in the Kingdom Rush series. CNET agreed that the gameplay was similar to earlier games in a favorable way, but also liked the new heroes and upgrades. However, both he and TouchArcade were disappointed that many of the heroes could only be unlocked by spending money on microtransactions. Gamezebo praised the levels as the best designed in the entire series, but noted that the gameplay formula was similar to the previous titles, and did not make significant changes.\nDuring the 18th Annual D.I.C.E. Awards, the Academy of Interactive Arts & Sciences nominated Kingdom Rush: Origins for \"Mobile Game of the Year\".\nReferences\nExternal links\n*"
    }
  ]
}