{
  "content": [
    {
      "type": "text",
      "text": "# King Jeonggan\n\n}}\nKing Jeonggan (1021–1069; born Wang Ki) was a Goryeo Royal Prince as the 5th son of King Hyeonjong, from Queen Wonhye. He was a brother to King Munjong and Queen Hyosa, also became both of paternal uncle and father-in-law to King Sunjong. He was known as Duke Pyeongyang and Duke of the Gaeseong State during his lifetime.\nThe Prince was born in 1021 (12th year reign of his father) at Yeondeok Palace (), his mother's official residence with the name of \"Wang Ki\" (). Through his parent, he became both of paternal half younger brother and maternal first cousin to Wang Heum and Wang Hyeong. In 1031, Ki was appointed as Honginsunghyogwangdeokgongsin Sutaewi Sangseoryeong () and honoured as Duke of the Gaeseong State () while three years later became a Sutaebo () during the first year reign of King Jeongjong.\nAt the beginning of King Munjong's year, Ki started fell ill and the king then sent an Eoui () to take care of his younger brother. In 1049, Ki  became Sutaesa Naesaryeong () and then became Jungseoryeong () in 1061. On his birthday, it was said that he was given a Royal Ceremonial Service () and honoured as Duke Pyeongyang (). However, he later died in 1069 due to his illness and then honoured as King Jeonggan ().\nIn 1072, \"Gyowi\" (), \"Geosin\" () and others who did a conspiracy case of an attempt to abolished Munjong and established Ki as the new king, were discovered and executed, while his eldest son, Wang Chin got exiled to the Haenam. Beside Chin, Duke Pyeongyang also had 2 other sons (Wang Geo and Wang Yeong) and a daughter who would marry King Sunjong.\nFamily\n*Father: Hyeonjong of Goryeo (1 August 992 – 17 June 1031, r. 1009–1031)\n*Mother: Queen Wonhye of the Ansan Kim clan (d. 1022)\n*Consorts and their Respective issue(s):\n#Unknown Queen\n##Wang Chin (왕진, d.1072), first son\n##Wang Kŏ (), second son\n##Wang Yŏng (1043–1112), Prince Nakrang, third son\n##Queen Jeongui of the Kaesong Wang clan, first daughter\nNotes\nReferences\nExternal links\n*[http://encykorea.aks.ac.kr/Contents/SearchNavi?keyword=%EC%A0%95%EA%B0%84%EC%99%95%20&ridx=0&tot=1 Duke Pyeongyang] on the Encyclopedia of Korean Culture .\n*[https://www.doopedia.co.kr/mo/doopedia/master/master.do?_method=view2&MAS_IDX=101013000945341 평양공] on Doosan Encyclopedia .\n*[http://db.history.go.kr/KOREA/search/searchResult.do?sort=levelId&dir=ASC&limit=20&page=1&pre_page=1&codeIds=PERIOD-0-3&searchTermImages=%EC%A0%95%EA%B0%84%EC%99%95%C2%A0&searchKeywordType=BI&searchKeywordMethod=EQ&searchKeyword=%EC%A0%95%EA%B0%84%EC%99%95&searchKeywordConjunction=AND#searchDetail/kr/kr_090r_0010_0330_0010/7/1/7/r Duke Pyeongyang] on Goryeosa ."
    }
  ]
}