{
  "content": [
    {
      "type": "text",
      "text": "# Kings of Bachata: Sold Out at Madison Square Garden__disambig_1\n\n| venue      = Madison Square Garden\n| studio     =\n| genre      = Bachata\n| length     = Disc 1: 46:38  Disc 2: 44:18\n| label      =\n| producer   =\n| prev_title = K.O.B. Live\n| prev_year  = 2006\n| next_title = The Last\n| next_year  = 2009\n| misc       =\n}}\n}}\nKings of Bachata: Sold Out At Madison Square Garden is the third live album released by bachata group Aventura. It is based on the sold out concert that took place on September 1, 2007 at Madison Square Garden. This was part of the K.O.B. Live tour. The live album and film of the concert was released on November 13, 2007. The album was certified 8× Platinum (Latin) by the Recording Industry Association of America on June 4, 2009 for shipping 800,000 copies in the United States.\nTrack listing\nCD\nDVD\n*The song \"La Boda\" (\"The Wedding\") was not included in the concert film, only audio.\n*The song \"La Novelita\" (\"The Little Soap Opera\") was part of \"Medley Old School Aventura\" but it was referred on this live album as \"Amor Bonito (Beautiful Love)\", which is another song and The sequel to \"La Novelita\" song. It even had the words \"La Novela 2\" (\"The Soap Opera 2\") next to the title \"Amor Bonito\". The reasons for this is unknown since no questions have ever been ask about why the title was different from the actual song.\n*Both CD and DVD have the song \"Llorar (Cry)\". However, it is shown on the tracklist as 'Lloro\". It also means cry depending on the sentence or on what you are referring to.\n*The DVD included special segments to introduce the next song involving the topic of it. Romeo only sang a piece of \"Te Invito (I Invite You)\" and then talked about what some people have said about it. This is why it's not in the CD version. The song \"Wanna Make You Mine\" was also not included in the CD version. This was probably because it was a bonus performance by Max Agenda and Toby Love, which did not feature the other members.\nCharts\nWeekly charts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (2007)\n! scope=\"col\"| Peakposition\n|-\n|-\n!scope=\"row\"|US Top Current Album Sales (Billboard)\n|style=\"text-align:center;\"| 97\n|-\n|-\n|}\nYear-end charts\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (2008)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| US Top Latin Albums (Billboard)\n| 6\n|-\n! scope=\"row\"|US Tropical Albums (Billboard)\n| style=\"text-align:center;\"|1\n|-\n! scope=\"col\"| Chart (2009)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| US Top Latin Albums (Billboard)\n| 13\n|-\n! scope=\"row\"|US Tropical Albums (Billboard)\n| style=\"text-align:center;\"|2\n|}\nSales and certifications\nSee also\n*List of number-one Billboard Tropical Albums from the 2000s\nReferences\nExternal links\n*[http://www.aventuramusica.com Aventura official site]"
    }
  ]
}