{
  "content": [
    {
      "type": "text",
      "text": "# King George V Police Coronation Medal\n\nThe Police Coronation Medal was sanctioned in 1911 as an award to policemen, members of ambulance units, firemen and Royal Parks' staff on duty during the official celebrations of the coronation of King George V that took place during 1911.\nAward\nThe medal was presented in silver to all ranks.  It continued the practice of awarding a special medal to police on duty during major royal celebrations that commenced with Queen Victoria's Golden and Diamond Jubilee Police Medals, and Edward VII's Police Coronation Medal, although qualification was now widened to include bodies outside London.\nSeveral service organisations qualified, with the name of the organisation shown on the reverse of the medal.\nA total of 31,822 medals were awarded:\nMetropolitan Police 19,783\nScottish Police 2,800\nSt John Ambulance Brigade 2,755\nCounty and Borough Police 2,565\nCity of London Police 1,400\nLondon Fire Brigade 1,374\nRoyal Irish Constabulary 585\nSt Andrew's Ambulance Corps 310\nPolice Ambulance Service 130\nRoyal Parks 120\nNo recipient was permitted to receive both the Police Coronation Medal and the more broadly awarded Coronation Medal 1911.\nDescription\nThe medal is silver and is  in diameter. It was designed by the Australian sculptor Bertram Mackennal.\n* Obverse: A crowned left-facing bust of King George V with the inscription GEORGIVS V REX ET IND: IMP:.\n* Reverse:  The Imperial Crown with an ornate surround, with the inscription CORONATION 1911 below and the name of the service the recipient was serving with above.\n* Ribbon:  wide. Red with a narrow central blue stripe, with a similar stripe towards each edge.\n* The recipient's rank and name were engraved on the edge of the medal.\n* The medal was worn in date order with other Royal commemorative medals. These were worn before campaign medals until November 1918, after which the order of wear was changed, with such medals now worn after campaign medals and before long service awards.\nReferences\nExternal links\n* [http://www.scottishpolicemedals.co.uk/king-george-v-coronation-scottish-police-medal-1911-history-and-medal-rolls/the-10-types-of-gvr-1911-coronation-police-medals King George V Coronation (Police) Medal]\n* [http://www.medals.org.uk/united-kingdom/united-kingdom-ribbons6.htm ODM of the United Kingdom - ribbon chart]"
    }
  ]
}