{
  "content": [
    {
      "type": "text",
      "text": "# King Fahd Security College\n\n| name                            =\n}}\nKing Fahd Security College is an educational/military institute part of the Saudi Ministry of Interior. The College is located in eastern Riyadh, the capital of Saudi Arabia.\nHistory\n'' 'The need to require the evolution of life after the reunification of the country at the hands of His Majesty King Abdul Aziz - may Allah have mercy on him - the introduction of the scientific method in all matters of life and to achieve stability and security of procedure had to be the same token, the security issues involved in science and training.''\nWas the order of the High Holy 29/9/1354 e approval of the proposal of the Police Directorate, which includes the establishment of a police school in Mecca, in order to take care of the preparation of the police and the rehabilitation of employees from both the science and military.\n29 Ramadan 1354 e Royal Order was issued approving the establishment of the Police Academy in Makkah. E In 1369 instructions were issued to specify the duration of the study and the conditions of acceptance, and to determine administrative procedures and educational organization for the conduct of work, and the graduate level. The graduate was appointed the rank of (the Commissioner) or the Assistant Commissioner, and the curriculum includes the study of civil Kalinchae and reading and algebra, engineering and management systems, imaging and other criminal in addition to military training and sports. In 1370 e set qualified acceptance to complete primary school, and the duration of the study of one year. E In 1377 became a period of two years study, and remained as a qualified acceptance of the certificate of completion of primary school. In 1380 e become eligible to accept the second medium, the duration of the study and remained two years. In 1381 e rose qualification for admission to the certificate of completion of middle school, and became a three-year period of study. E In 1385 the College changed its name to \"police\" instead of the police school. In 1385 the college was e Mecca to the city of Saudi Arabia. In the e 25/1/1386 issued a ministerial decision to separate the police from the Faculty of Public Security Directorate and attached to a separate Ministry of the Interior directly, as the text on the formation of the Council of the College.\nIn the e 21/3/1386 issued by the Council of Ministers decision to change the name of the college to \"College of the internal security forces\", and linked directly to a ministry, and the creation of an independent budget, with the opportunity for all sectors of security to participate in the discussion of the general plan of the College.\n15/4/1386 in e become eligible to accept the General Certificate of Secondary Education.\nE In 1391 became a period of three years of study, college graduate, then get a Bachelor of Science in the internal security forces and to obtain the rank of lieutenant.\nIn 1394 the total e taken in the methods of modern education systems and introduced the system of the classroom.\nIn 1403 a royal order was issued e cream to change the name of the College to the \"King Fahd Security College,\" also changed the name of the certificate to the \"Bachelor of Science in security.\"\nIn 1405 the development of e Custodian of the Two Holy Mosques, the foundation stone of the headquarters building of the Directorate General of King Fahd Security College and move to new headquarters in 1409 e\nE in 1422 has been confined to the College for admission to university graduates.\nAdmission requirements\n* High school diploma\n* Be in full health and fitness\nEmployment\nGraduates have jobs in the government sector\n* Ministry of the Interior\n* Police\n* Civil Defense\n* Drug Control\n* The Security of Facilities\n* General Directorate of Investigation\n* Intelligence\n* Immigration\n*Corrections and prisons\nSee also\n* List of things named after Saudi kings\nReferences\nExternal links\n*Riyadh Newspaper : http://www.alriyadh.com/2005/07/11/article80077.html\n*KFSC website : http://www.kfsc.edu.sa/Docs/about/----------/index.aspx\n* https://web.archive.org/web/20090209210740/http://www.sa-l.com/s1339.html"
    }
  ]
}