{
  "content": [
    {
      "type": "text",
      "text": "# King of Water\n\nMir Taher MazlumiMino SalehiAmir Karbalaei-Zadeh\n| music          = Behzad Abdi\n| cinematography =\n| editing        =\n| studio         = Avin Media Studio\n| distributor    = Bahman Sabz Cultural and Artistic Institute\n| released       =\n| runtime        = 81 minutes\n| country        = Iran\n| language       = Persian\n| budget         = 1–2 billion Iranian tomans\n| gross          = 9,128,000,000 Iranian tomans\n}}\nKing of Water is an Iranian 3D animation in the realistic genre, produced in 2018 (1397 in Iranian calendar) and released on August 8, 2025, in cinemas across the country. It was written and directed by Majid Esmaeili, produced by Mojtaba Amini, and supervised by Hossein Soltani at Avin Media Studio. The story follows Iranian youths striving to free United Nations personnel from terrorists. Within less than two months of release, it attracted over 170,000 viewers and earned more than 9.1 billion tomans, making it the highest-grossing animation in Iran during August and September.\nMajid Esmaeili has announced that a second installment is planned and is expected to be completed by 2027 (1406 Iranian calendar).\nPlot\nThe story takes place near the city of Samarra and depicts the hostage-taking of a UN expert team by a terrorist group. A group of Iranians, led by a character named Farid, traces the source of these activities. The narrative touches on themes such as Iran’s defensive strength and Islamic unity.\nProduction\nProduction took place at Avin Media Studio with over 100 staff members and utilized motion capture technology. The main characters are voiced by Pouria Poursorkh, Mir Taher Mazlumi, Mino Salehi, and Amir Karbalaei-Zadeh, with music composed by Behzad Abdi.\nIn an interview, the director stated that keeping the staff on the project for several years while producing heavy content in a child-friendly style was the biggest production challenge.\nRelease\nTheatrical release began on August 8, 2025. The animation was shown in cinema complexes as well as in schools, mosques, and villages. Online and TV distribution has also been planned. It became the highest-grossing animation in Iran for the summer months of 2025.\nAwards\nThe film received the Honorary Diploma for Best Animation at the 10th Ammar International Popular Film Festival.\nReferences\nExternal links\n*\n* [https://kodoumo.ir/reviews/animations/فرمانروای-آب Evaluation page for \"The Water Ruler\" on Kodoumo]\n* [https://ekranmardomi.ir/movie/farmanravaye-aab Official public screening page of \"The Water Ruler\"]\n* [https://www.aparat.com/v/mgc068x Official teaser of the animation on Aparat]"
    }
  ]
}