{
  "content": [
    {
      "type": "text",
      "text": "# King Duncan\n\nKing Duncan is a fictional character in Shakespeare's Macbeth.  He is the father of two youthful sons (Malcolm and Donalbain), and the victim of a well-plotted regicide in a power grab by his first cousin, and trusted captain, Macbeth. The origin of the character lies in a narrative of the historical Donnchad mac Crinain, King of Scots, in Raphael Holinshed's 1587 The Chronicles of England, Scotland, and Ireland, a history of Britain familiar to Shakespeare and his contemporaries.  Unlike Holinshed's incompetent King Duncan (who is credited in the narrative with a \"feeble and slothful administration\"), Shakespeare's King Duncan is crafted as a sensitive, insightful, and generous father-figure whose murder grieves Scotland and is accounted the cause of turmoil in the natural world.\nAnalysis\nKing Duncan is a father-figure who is very generous and kind. Duncan is also firm (\"No more that Thane of Cawdor shall deceive / Our bosom interest. Go pronounce his present death / And with his former title greet Macbeth.\"), insightful (\"There's no art / To find the mind's construction in the face.\"), and sensitive (\"This castle hath a pleasant seat. The air / Nimbly and sweetly recommends itself / Unto our gentle senses.\"). However, the role is full of irony; he is completely deceived in the intents of Macbeth and therefore may come across as naive. Although a modern reader may view Duncan as an incompetent monarch in this respect, Duncan represents moral order within the play and his murder signals the onset of chaos.\nFilm and television performances\nFilm\nDuncan has been played in film adaptations of the play by Anthony Head in 2008, Gary Sweet in 2006, and Tom Reid in 2003. Javier Ronceros performed the role in ''Dogg's Hamlet, Cahoot's Macbeth (2005) and John Little in Macbeth: The Comedy (2001).  Christopher McCann played Duncan in Macbeth in Manhattan'' (1999). Greg Korin, John Corvin, and Antti Litja played the role in 1998, 1997, and 1987 respectively.\nErskine Sanford played King Duncan in Orson Welles' 1948 version, Louis Northop in a 1946 film adaptation, and by Nicholas Selby in Roman Polanski's 1971 version. In Akira Kurosawa's 1957 film Throne of Blood, which draws its plot from Macbeth, the role of Duncan is filled by the character of Lord Tsuzuki, portrayed by Takamaru Sasaki.\nSpottiswoode Aitken and Charles Kent both played Duncan in silent versions of Macbeth in 1916 and 1908 (the first screen version of the play). David Thewlis portrayed the part in Justin Kurzel's 2015 adaptation. Brendan Gleeson performed the role for Joel Coen in his 2021 version.\nIn Orson Welles' 1948 film adaptation of Macbeth, the role of King Duncan is reduced. 1.2 is cut entirely as well as generous portions of 1.4.  King Duncan is seen briefly in 1.6 as he enters Macbeth's castle amid considerable pomp. The top of 1.4 with its description of Cawdor's execution has been transplanted to this scene. Banquo's \"temple-haunting martlet\" speech is given to Duncan. Duncan is later seen asleep in bed for a fleeting moment as Lady Macbeth slinks about in the chamber's shadows. Donalbain has been cut from the film, leaving Duncan with just one son, Malcolm.\nTelevision\nVincent Regan played King Duncan in \"ShakespeaRe-Told\" Macbeth (2005), Ray Winstone in Macbeth on the Estate (1997), Laurence Payne in \"Shakespeare: The Animated Tales\" Macbeth (1992), Griffith Jones in A Performance of Macbeth (1979), and Jacques Mauclair in Macbett (1974), Kevin Coughlin on the \"Goodyear Television Playhouse\" (1955), and Lee Patterson on the \"Douglas Fairbanks, Jr., Presents\" Dream Stuff (1954).  Other television performers of the role include Philip Madoc (1998), Mark Dignam (1983), Powys Thomas (1961), Malcolm Keen (1960), Leo G. Carroll (1949), Arthur Wontner (1949).\nReferences\nBibliography\n*Bevington, David, ed., and William Shakespeare. Four Tragedies. Bantam, 1988.\nsimple:Macbeth#Characters"
    }
  ]
}