{
  "content": [
    {
      "type": "text",
      "text": "# King's Station\n\n'''King's Station, also known as Moore's and Hollandsville''', was a stagecoach station of the Butterfield Overland Mail 1st Division between 1858 and 1861 in southern California.\nThe adobe building also served other travelers on the Stockton - Los Angeles Road, and other uses, until its 1928 destruction.\nGeography\nKing's Station was located in the lower section of San Francisquito Canyon, in the Sierra Pelona Mountains. It was  south of Widow Smith's Station near San Francisquito Pass, and was  north of Lyons Station in the present-day Newhall neighborhood of Santa Clarita. Its present-day site is along San Francisquito Canyon Road, about  north of its intersection with Copper Hill Drive.\nHistory\nThe watering place on San Francisquito Creek was first known as \"Moore's\" in 1854, and was located on the Stockton - Los Angeles Road wagon route, on the section  between the San Fernando Valley and the San Joaquin Valley.\nButterfield Overland Mail\nBy 1858, when the New York Herald reporter Waterman L. Ormsby passed through on the Butterfield Overland Mail it was known as King's Station. In 1860 the station was referred to as Hollandsville.\nKing's Station was  north of Lyons Station (Hart's Station) in Santa Clarita. It was  south of Widow Smith's Station (Clayton's Station, Major Gordon's Station) in upper San Francisquito Canyon near San Francisquito Pass.\nRaggio Ranch — Hollands\nAbout 1880, Charles Raggio, acquired the ranch and adobe station building from the Perea family, and it became known as the Raggio Ranch.\nLater in 1894, the adobe was a post office on the Raggio Ranch for the surrounding settlement known as Hollands or Hollandsville.\nSt. Francis Dam flood and destruction\nIn March 1928 the massive flood caused by the collapse of the St. Francis Dam washed away the old stagecoach station, along with the Hollands and Raggio Ranch buildings. The dam had been upstream in San Francisquito Canyon.\nThe only present day indicator of the station's location is the Ruiz family cemetery, that survived by being just above the flood's crest.  The station had been located just below the cemetery.\nThe Raggio Ranch was rebuilt and remained in the family until after the 1940s.\nSee also\n*Butterfield Overland Mail in California\n*Rancho San Francisco\nReferences\nExternal links\n*[http://www.scvhistory.com/scvhistory/gr0840.htm  Santa Clarita Valley History in Pictures: Raggio Ranch and San Francisquito Canyon]\n* [https://www.latimes.com/archives/la-xpm-1989-12-30-me-896-story.html  Los Angeles Times (December 30, 1989): \"Owners Treat Cemetery as a Monument to the Past\"]\n* [http://deadwrite.wordpress.com/tag/ruiz-cemetery/ Deadwrite’s Dailies (March 31, 2011), Tag Archives: \"Ruiz Cemetery, In the Wake of the St. Francis Dam\"]"
    }
  ]
}