{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of Sitawaka\n\nThe Kingdom of Sitawaka (, ) was a kingdom located in south-central Sri Lanka. It emerged from the division of the Kingdom of Kotte following the Spoiling of Vijayabahu in 1521. Over the course of the next seventy years it came to dominate much of the island. Sitawaka also offered fierce resistance to the Portuguese, who had arrived on the island in 1505. Despite its military successes, Sitawaka remained unstable, having to contend with repeated uprisings in its restive Kandyan territories, as well as a wide-ranging and often devastating conflict with the Portuguese. Sitawaka disintegrated soon after the death of its last king Rajasinha I in 1593.\nHistory\nFoundation\nThe kingdom of Kotte had been the major power in western Sri Lanka since its foundation in the early 15th century; under Parakaramabahu VI, the polity has been the last to unite the entirety of the island of Sri Lanka under one crown. By 1467, however, the Jaffna kingdom to the north had asserted its independence. In 1505 the first Portuguese arrived in Sri Lanka; by 1518 a large fleet of Portuguese ships had landed at Colombo and begun to construct a fort known as Santa Bárbara. To the east, the client kingdom of Kandy was by this time operating with a considerable degree of independence as well.\nVijayabahu VII of Kotte  (1509–1521) was deposed in a palace coup known as the Spoiling of Vijayabahu in 1521 by his three sons who feared their succession to the throne was about to be overlooked in favour of Vijayabahu's fourth son, Devaraja. The eldest succeeded him to the throne as Buvanekabahu VII, whilst the other two claimed parts of Kotte for themselves—Mayadunne ruling from Sitawaka and Pararajasinha establishing the kingdom of Raigama. The kingdom of Kandy was effectively outside of the control of any of these three successor states.\nThe kingdom of Sitawaka initially covered a relatively small area including Kosgama, Ruwanwella, Yatiyanthota, Hanwella, Padukka, Ehaliyagoda, Kuruwita and Rathnapura. The terrain was hilly, bordered to the east by Kandy and with no access to the sea. The capital city—modern Avissawella—was situated on a steep hill at the base of bluff hills rising around  above the surrounding jungle cover.\nRise (1521–1551)\nSoon after his ascent to the throne, Bhuvanekabahu began to strengthen his ties with the Portuguese in order to secure his throne from any potential challenge from Sitawaka. Though local resistance prevented them from completing a fortress in Colombo, from 1524 a Portuguese agent remained in Kotte under the king's protection. Portuguese naval forces began vying with the Malabari Mappilas for dominance of cinnamon trade but were eventually repulsed by a Bhunvanekabahu VII, who was assisted by forces despatched by the Portuguese Viceroy of Goa. Another attempt at seizing Kotte in 1537 failed when Mayadunne's forces were defeated by forces under the command of the Portuguese Captain-General in Colombo, Afonso de Souza. A fleet sent from Calicut to assist Mayadunne was also defeated by the Portuguese at Vedalai. A truce was negotiated between Sitawaka and Kotte in the aftermath of the conflict. Mayadunne subsequently turned his attention south to the kingdom of Raigama, which he annexed following the death of Raigam Bandara (Pararajasinha) in 1538.\nTwo further invasions of Kotte occurred over the next five years. The first, beginning in 1539, was repelled due to resistance organized by the new Portuguese Captain-General in Colombo, Miguel Ferreira. Once again, Calicut supplied troops and weaponry to Sitawaka; however, following their defeat, Kulhenamarikkar and Pachimarikkar, two of the Zamorin’s generals, were handed over to the Portuguese, effectively ending the alliance between Calicut and Sitawaka. In 1543, news that Bhuvanekabahu VII had named his grandson Dharmapala as his successor prompted yet another invasion, which was once again repulsed with the aid of Portuguese forces under the command of the new Captain-General, António Barreto.\nConquest of Kotte (1551–1581)\nPortuguese involvement in the internal politics of Kotte increased with the arrival in 1550 of viceroy Afonso de Noronha and a contingent of some 500 Portuguese soldiers. The Portuguese sacked Sitawaka later that year, but failed to retain the city. Accounts indicate that Mayadunne had adopted a policy of simply evacuating his capital and retreating into the surrounding terrain when the Portuguese approached—on occasion leaving the palace lights burning and spreading white cloth on the floor as a welcome for the invaders. Once the invaders had left the capital, the king's forces would then harass them along the route down to the Kelani river.\nIn 1551 Bhuvanekabahu VII was assassinated and succeeded by Dharmapala, who relied heavily on his European allies to maintain his hold over the kingdom. A new Portuguese fortress was constructed in Colombo in 1554, and by 1556 the 70,000 inhabitants in the vicinity of Colombo Fort had converted to Catholicism.\nKing Dharmapala himself converted to Catholicism in 1557 and adopted the name Dom João Pereira Bandara. Large numbers of Buddhist clergy and commoners fled the kingdom fearing persecution amidst rumours of forced conversions. Perhaps most significantly, the Tooth Relic—the most sacred object in the land and a traditional symbol of royal authority and inheritance—was smuggled out of Kotte and taken to Delgamu Viharaya in Ratnapura. Portuguese claims to have burnt the relic further inflamed the resentment of the populace. A Sitawakan invasion that year was repulsed by Captain-General Dom Afonso Pereira de Lacerda.\nKotte counter-attacked in 1562, with Lacerda leading a substantial force from Colombo along the banks of the river Kelani. At Mulleriyawa they encountered a force led by Tikiri Banda, Mayadunne's son; in the subsequent Mulleriyawa Satana a significant number of Portuguese and several thousand Lascarins were killed, and the invading force was decisively routed. The victory was a huge psychological boost for the Sitawakans, reflected in Tikiri Banda's acquisition of the moniker Rajasinha—\"King of the Lions\".\nPressing their advantage, Mayadunne and Tikiri Bandara launched a two-pronged attack on Kotte in 1564, laying siege to both Kotte and Colombo. Portuguese forces were forced to retreat from Kotte with Dharmapala, leaving Sitawaka in control of much of the kingdom. Major Sitawaka garrisons were established at Wattala, Nagalagama and Mapane. However a thin coastal strip, running from Negombo to Galle and including the fort in Colombo, was kept provisioned from the sea by Portuguese ships and remained in Portuguese hands until after the collapse of Sitawaka a generation later. Strategically, this enabled them to harass and wage attritionary campaigns against the kingdom, the most notable being the invasion of 1574 which saw Negombo, Kalutara and Beruwala plundered, Sitawaka garrisons at Nagalagama and Mapane expelled, and the districts of Weligama and Chilaw ravaged. Portuguese influence reached its peak with Dharmapala’s 1580 declaration that, upon his death, the lands of Kotte would pass to Philip II of Spain.\nRajasinha I\nMayadunne died in 1581 and was succeeded by Rajasinha I. In 1582, the new king invaded and conquered the kingdom of Kandy to the east, bringing the entirety of Sri Lanka into the Sitawakan fold, with the exception of the Jaffna kingdom and Portuguese holdings in the south. Karaliyadde Bandara, king of Kandy, fled to Trincomalee and subsequently died of smallpox; his young daughter, Kusumasana Devi, came under the protection of the Portuguese, who baptised her Dona Catherina and over the next decade claimed the throne of Kandy in her name. Rajasinha I's hold over the area was further disrupted by the rebellion of his viceroy Wirasundara Mudiyanse. Though the uprising was crushed, and Wirasundara murdered, his son Konappu Bandara fled into Portuguese territory. Baptised as Don Juan, he would become a persistent opponent of the king of Sitawaka.\nPortuguese intrigue in Rajasinha I's court had dramatic results between 1583 and 1587; numerous nobles were executed following accusations of treachery. Most importantly Rajasinha I turned against the Buddhist clergy following the discovery of collaboration with his enemies; temples were destroyed, Sri Pada seized and given over to Hindu priests, and Rajasinha I himself converted to Hinduism. Many of the disaffected fled to the highlands. Meanwhile, in Kotte, King Dharmapala formally ratified his 1580 donation to Philip II on 4 November 1583.\nRajasinha I redoubled his efforts at dislodging Europeans and by 1587 he had amassed a force of some 50,000 infantry, as well as war elephants, cavalry, and a number of locally manufactured cannon. The army commenced what was to become a twenty-two month siege of Colombo that year. In the absence of a Sitawakan navy, the Portuguese—supplied from Goa via the sea—could hold out for extended periods of time. A shift in policy by Calicut ensured that there was no hope of rekindling the old alliance with the South Indian kingdom, and Rajasinha I was forced to abandon the siege in February 1588 to deal with unrest further inland.\nThe last years of Rajasinha I's reign were spent defending the kingdom's borders, a task made more difficult by the Portuguese invasion of the northern Jaffna kingdom in 1591. The following year Portuguese forces briefly occupied Kandy, but were expelled. Nonetheless a new, and formidable enemy had emerged in the form of Konappu Bandara, who had returned to Kandy in the early 1590s. Adopting the name Vimaladharmasuriya, he seized the throne of Kandy, converted back to Buddhism, and married Dona Catherina to legitimise his claim. In 1593, he defeated Rajasinha I at Balane and Mawela, effectively securing Kandy's independence from Sitawaka. Rajasinha I died the following year.\nDespite the kingdom's impressive successes, much of its stability was dependent on a smooth succession and a competent ruler; Rajasinha I's sudden death in 1593 (the same year the Portuguese appointed their first Governor-General of Ceylon) was met with neither of these and within less than a year Sitawaka had ceased to function as a cohesive polity.\nSuccessor states and legacy\nIn 1594 the Portuguese forces sacked the city and pressed inland in the Campaign of Danture until they were expelled by Kandyan forces under Vimaladharmasuriya. The Portuguese remained the premier power in lowland Sri Lanka until the early 17th century, when they were finally expelled by Rajasinha II and his Dutch allies.\nA resurgent kingdom of Kandy under Vimaladharmasuriya I also sacked Sitawaka, and went on to become the major source of resistance to European power for the next two hundred years. Avissawella was reduced to being a border town, and the royal complex was eventually lost to the jungle until explored by the British in the 19th century.\nMilitary\nThe kingdom of Sitawaka was known for its military power that could challenge Europeans in conventional warfare and succeeded in keeping the Portuguese restrained to a coastal strip but attempts at entirely expelling them were unsuccessful. According to Portuguese sources, by 1587 the kingdom was able to raise an army of 50,000-60,000 soldiers, armed with muskets and field cannons supported by 60,000 pioneers and servants, and a logistical train of 2200 pack elephants and 40,000 oxen. Despite the possibility of exaggeration, the army likely exceeded 30,000 soldiers. The 200-strong War Elephant corps was used to devastating effect against the Portuguese on open fields but was largely ineffective against fortified targets.\nThe greatest weakness of Sitawaka which stopped it from entirely removing the European foothold on the island was its inexperience in siege warfare and its weak navy. Sitawaka lacked siege artillery that could significantly damage forts built by the Portuguese who were vastly more experienced in siege warfare due to constant conflicts with Moors in the Iberian Peninsula and North Africa. Thus Sitwaka had to rely entirely on its large labor force to mine Portuguese forts during sieges. The Portuguese used their superior navy to defend coastal forts by bombarding Sitawaka forces and bringing in reinforcements from India. Rajasinha I attempted to build a capable navy and sought assistance from Kunjali admirals of Calicut and the Sumatran naval power of Acheh. As a result, Sitawaka managed to build up a small navy that while not effective against the Portuguese navy managed to impede trade and supplies.\nSee also\n*List of Kandyan monarchs\n*Mayadunne of Sitawaka\n*Sitawaka fort\n*Sri Lanka\n*History of Sri Lanka\n*List of monarchs of Sri Lanka\n*Kastane\n*Lascarins\nReferences"
    }
  ]
}