{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom Come (Big Love)\n\n| length       = 58 minutes\n| guests       = * Bruce Dern as Frank Harlow\n* Mary Kay Place as Adaleen Grant\n* Brian Kerwin as Eddie\n* Luke Askew as Hollis Green\n* Sarah Jones as Brynn\n* Sylva Kelegian as ATF Agent\n* Garrett M. Brown as Bishop Devery\n* Sandy Martin as Selma Green\n* Lawrence O'Donnell as Lee Hatcher\n| prev         = Good Guys and Bad Guys\n| next         = Circle the Wagons\n| episode_list = List of Big Love episodes\n}}\n\"Kingdom Come\" is the eighth episode of the second season of the American drama television series Big Love. It is the 20th overall episode of the series and was written by Dustin Lance Black, and directed by Dan Attias. It originally aired on HBO on July 30, 2007.\nThe series is set in Salt Lake City and follows Bill Henrickson, a fundamentalist Mormon. He practices polygamy, having Barbara, Nicki and Margie as his wives. The series charts the family's life in and out of the public sphere in their suburb, as well as their associations with a fundamentalist compound in the area. In the episode, Bill faces consequences when the rift between Roman and the Greenes escalates, while his wives decide to give him the cold shoulder when he asks for a night off.\nAccording to Nielsen Media Research, the episode was seen by an estimated 2.02 million household viewers and gained a 1.0/3 ratings share among adults aged 18–49. The episode received critical acclaim, who praised the performances, writing and ending.\nPlot\nBill (Bill Paxton) faces a hangover after dealing with many businesses, upsetting Nicki (Chloë Sevigny) as he missed her day and wonders if she considers her inferior to Barbara (Jeanne Tripplehorn) and Margie (Ginnifer Goodwin). Despite Roman (Harry Dean Stanton) mandating to cut ties with the Greenes, Bill continues supplying the family with vital Juniper Creek's records.\nLois (Grace Zabriskie) arrives home, discovering that Frank (Bruce Dern) has found her stash of money in a can. She visits the laundromat to ask Eddie (Brian Kerwin) for money, but he refuses as he already gave it to Bill for Weber Gaming. Bill surprises his wives by declaring that he should get the \"seventh night\" for himself, concerning them. Bishop Devery (Garrett M. Brown) visits Barbara to discuss Ben (Douglas Smith), who has been skipping church. Discovering his sexual activity with Brynn (Sarah Jones), Bill confronts Ben over his new behavior. When Ben questions his methods, Bill grounds him. Bill is then asked by Lois for the money that Frank took, and he declines. However, he is astonished upon learning that Eddie's money were stolen from a cancer patient.\nDuring Barbara's night, Barbara asks Bill to scale back on his business tactics. This leads to an argument, and Barbara decides to sleep on the couch. Bill leaves for Margie's house, and they end up having oral sex, which is witnessed by Nicki from her window. The following morning, Nicki confronts Margie for depraving Bill's behavior, while Barbara is upset that she did not reject him. They come up with giving him the cold shoulder, although Margie secretly informs Bill about it. At Home Plus, Frank confronts Bill, as Lois told him he had the rest of the money and reveals to Don (Joel McKinnon Miller) that the money came from a dead woman. When Frank tries to blackmail him, Bill kicks him out and decides to stop collaborating with the Greenes by revealing vital information to Roman. Bill is further confronted by his wives, and Barbara expresses disappointment over a potential fourth wife. Later on, Nicki visits Bill and they reconcile after Bill gives her what she really wants: sex while looking at each other.\nHollis (Luke Askew) calls Bill to condemn for his betrayal, as many of his henchmen and family were injured. He threatens him into giving up all his business interests within 24 hours or face consequences. To protect his family, Bill and Hatcher (Lawrence O'Donnell) collaborate with the ATF to raid the Greenes' warehouse, forcing Lee to relocate his family. To show his commitment to Brynn, Ben proposes to her, which she accepts. But Bill and Barbara refuse to support his decision, and Barbara is heartbroken when Ben suggests he might get a second wife. Barbara tells Brynn about Ben's decision, and she decides to break up with him. Bill consoles Ben, and convinces him into becoming a priesthood holder. In Juniper Creek, Roman is shot thrice in the street by two Green henchwomen. As the women flee, Lois and Alby (Matt Ross) quickly tend to Roman.\nProduction\nDevelopment\nThe episode was written by Dustin Lance Black, and directed by Dan Attias. This was Black's third writing credit, and Attias' first directing credit.\nReception\nViewers\nIn its original American broadcast, \"Kingdom Come\" was seen by an estimated 2.02 million household viewers with a 1.0/3 in the 18–49 demographics. This means that 1 percent of all households with televisions watched the episode, while 3 percent of all of those watching television at the time of the broadcast watched it. This was a 8% increase in viewership from the previous episode, which was watched by an estimated 1.87 million household viewers with a 0.9/3 in the 18–49 demographics.\nCritical reviews\n\"Kingdom Come\" received critical acclaim. Trish Wethman of TV Guide wrote, \"I thought Nicki's line about being “the most stress-free of any of us” was wonderfully ironic because, in her own twisted way, she was absolutely right. From the perspective of a practicing polygamist, Nicki’s blind belief in the Principle makes her the most likely to acquiesce to Bill’s wishes.\"\nAlan Sepinwall wrote, \"the latest episode was really quite something, absolutely living up to the \"Kingdom Come\" title. The Roman vs. Hollis action happened largely off-stage, and Roman even took a few bullets at the episode's end. Bill grappled with the wives on the issues of free time, adding a fourth wife, and the impact that living the principle is having on their children. When the series moves away from the political gamesmanship and sticks to the nuts and bolts of trying to fit this lifestyle into a modern American life, it can be pretty great.\" Emily Nussbaum of Vulture wrote, \"There's a lot of talk about liens and houses of cards, the FBI gets involved, and in the final shocking sequence, Roman Grant is assassinated, apparently by two fundamentalist J.T. Leroys. Which was all very exciting. But in between, we got dollops of Big Loves central appeal: the highbrow titillation that is HBO at its core.\"\nEmily St. James of Slant Magazine wrote, \"This season of Big Love has been particularly skillful at illuminating the conflicts between creed and self (especially in the case of the Henrickson wives and teens), and the season’s eighth episode, “Kingdom Come,” turns this overriding theme into a character-specific plotline as Ben struggles to find a way to reconcile both sides of his life.\" Shirley Halperin of Entertainment Weekly wrote, \"All week, HBO had been touting this episode, titled \"Kingdom Come,\" as Big Loves \"most dramatic yet\", and man, they weren't kidding. Finally, some resolution to questions that have lingered for almost half a season, some serious action between Bill and his many business enemies, not to mention the return of those steamy sex scenes. It all came to a, ahem, head last night, and I, for one, was left very pleased.\"\nJen Creer of TV Squad wrote, \"What a great episode. There were so many threads in this episode, it was great to see how fast and furious old and new facts were being hurled out through the dialogue. Oh, poor Benny. How humiliating. I think it's bad enough for any teenager to have his parents find out that he's having sex - but it has to be especially bad when those parents think not only is he too young, but what he is doing is also a pretty serious sin.\" Television Without Pity gave the episode a \"B\" grade.\nBill Paxton submitted this episode for consideration for Outstanding Lead Actor in a Drama Series at the 60th Primetime Emmy Awards.\nReferences\nExternal links\n* [https://www.hbo.com/big-love-lwm/season-2/8-kingdom-come \"Kingdom Come\"] at HBO\n*"
    }
  ]
}