{
  "content": [
    {
      "type": "text",
      "text": "# King's School, Worcester\n\n(refoundation)\n| closed                  =\n| type                    = Private day schoolCathedral school\n| religion                = Church of England\n| president               =\n| head_label              = Head\n| head                    = Dr Alison Oliver (Acting Head)\n| chair_label             = Chairman\n| chair                   = Pat Preston\n| founder                 = Henry VIII (refoundation)\n| specialist              =\n| address                 = 5 College Green\n| city                    = Worcester\n| county                  = Worcestershire\n| country                 = England\n| postcode                = WR1 2LL\n| local_authority         =\n| urn                     = 117037\n| ofsted                  =\n| staff                   =\n| enrolment               = 1,467\n| gender                  = Coeducational\n| lower_age               = 2\n| upper_age               = 18\n| houses                  = 8 (+ 4 discontinued)\n| colours                 = Navy blue and white\n| publication             = The Vigornian\n| alumni                  = Old Vigornians\n| free_label_2            = Affiliation\n| free_2                  = HMC\n| website                 =\n}}\nThe '''King's School, Worcester''' is a private co-educational day school refounded by Henry VIII in 1541. It occupies a site adjacent to  Worcester Cathedral on the banks of the River Severn in the centre of the city of Worcester. It offers mixed-sex mainstream education that follows the UK National Curriculum to around 1,465 pupils aged 2 to 18. At age 11, approximately two thirds of pupils join the senior school from its two prep schools, King's Hawford and King's St Albans, while others come from maintained schools in the city of Worcester and the surrounding areas that include Malvern, Redditch, Kidderminster, Evesham and Pershore.\nCampuses\nThe King's, Worcester group consists of three different schools. These include:\n*'''King's Hawford''': (ages 2–11,  pupils), formerly an autonomous fee-paying prep school named Hawford Lodge, purchased by King's in 1992, situated north of central Worcester. No recommendations were made in the 2008 inspection.\n*'''King's St Alban's''': (ages 2–11,  pupils), formerly the Cathedral Choir School, amalgamated with King's in 1943, situated adjacent to the senior school. St Alban's includes a pre-prep department for ages 4–7, opened September 2009.\n*'''King's Worcester''': (ages 11–18,  pupils), the senior school.\nThe senior school is situated on Worcester's College Green, next to Worcester Cathedral and on the east bank of the River Severn. Many of the school's buildings on the Green are leased from the cathedral, including College Hall (formerly the monastic refectory, for many years the school's only teaching hall, and currently an assembly hall) and Edgar Tower, the medieval gatehouse to College Green, which for many years housed the school library. The school and the cathedral maintain a close relationship, with the school providing cathedral choristers and using the cathedral for major services. The most senior members of school staff, the cathedral choristers, and the school's King's and Queen's Scholars are ex officio members of the cathedral foundation, while the school is required by statute to have the cathedral Dean and Chapter represented on its governing body.\nThe school owns extensive land next to New Road cricket ground across the river, used as sports pitches and fields. The school also owns an outward bound centre, the Old Chapel near Crickhowell in Mid Wales.\nView of the school from the cathedral tower(photo Bob Embleton)\nHistory\nFollowing the dissolution of the monastery in 1540, the new cathedral foundation included provision for a choir school for ten cathedral choristers and tuition for forty ''King's Scholars''. The school was one of seven \"King's Schools\" established or re-endowed by Henry VIII following the dissolution. On 7 December 1541, Henry VIII appointed the school's first headmaster, John Pether, by means of a letter to Richard Rich. One early headmaster, Henry Bright is mentioned in Thomas Fuller’s Worthies of England, and is commemorated in Worcester Cathedral.\nThe school was managed by the cathedral Dean and Chapter until 1884, when Headmaster W.E. Bolland's New Scheme introduced governance by a separate Governing Body, on which the Chapter nonetheless retained a majority. From its inception until the construction of School House in 1888, all teaching was conducted in College Hall, the former monastic refectory.\nFrom 1945 to 1976, the school participated in the direct grant scheme, accepting pupils funded by central government on a competitive basis. The school first admitted girls in small numbers to the sixth form in 1971, prior to the establishment of College House in 1977, which housed 21 girls. In 1989 the decision was made to make the school fully co-educational, with girls entering the Lower Fourth (Year 7) in 1991. Having accommodated boarders since its inception, the final boarders left in July 1999.\nActivities\nThe school has an artist-in-residence and actor-in-residence, provides one-to-one LAMDA tuition and has several performance venues, including the Keyes Building, College Hall and the John Moore Theatre. Art exhibitions, plays, musicals, dance showcases and other performances are staged across the age range. Partly due to its links with the cathedral the school has a musical tradition.\nThe school has achieved success at rowing with the King's School Worcester Boat Club, and maintains a boathouse on the River Severn. The school also has an indoor swimming pool on the junior school campus and an outdoor pool at Hawford. Several sports undertake regular tours abroad.\nThe school has an active Combined Cadet Force with army and RAF sections.\nThe school produces three pupil-authored publications: Stepping Fourth (for the Fourth Forms, years 7–8), ''The Removes' Gazette (for the Removes, years 9–10) and Term Time a Sixth Form magazine, first published in summer 2010, as a replacement for the defunct King's Herald newspaper. The King's Herald'' was an annual newspaper written, compiled and formatted in a single day and submitted to a national competition which it won three times.\nYear classification system\nThe school uses its own class nomenclature. In the main section of the school (ages 11–18), the classification runs as follows:\n{| class=\"wikitable\"\n! Year !! Year Name !! Notes\n|-\n| 7 || Lower Fourth (L4) || The Start of the Senior School.\n|-\n| 8 || Upper Fourth (U4) || The Year which determines who are awarded King's and Queen's Scholarships.\n|-\n| 9 || Lower Remove (LR) || The start of the house system.\n|-\n| 10 || Upper Remove (UR) || The start of the GCSE course.\n|-\n| 11 || Fifth Form (FF) || GCSE exams taken.\n|-\n| 12 || Lower Sixth (L6) || AS-level exams taken.\n|-\n| 13 || Upper Sixth (U6) || A2-level exams taken.\n|}\nHouses\nUpon reaching the 'Lower Remove', pupils are assigned to one of the following houses (listed with their respective colours):\n{| class=\"wikitable\"\n|-\n! House !! House Colours !! Eponym !! Type & Timespan\n|-\n| Castle(Ca) || Red  || Castle House building(named for Worcester Castle) || Boarding, 1902–1995; Day, 2015–\n|-\n| Chappel(Cl) || Yellow  || William Haighton Chappel, Headmaster 1896–1919 || Day, 1936–\n|-\n| Choir(Ch) || Dark Blue  || Choir House building|| Boarding, 1948–1995;Day, 1995–\n|-\n| Creighton(Cr) || Pink  || Cuthbert Creighton, Headmaster 1919–36 & 1940–42 || Day, 1936–\n|-\n| Kittermaster(K) || Light Blue & Yellow  || F. Ronald Kittermaster, Headmaster 1942–1959 || Day, 1984–\n|-\n| Oswald(Os) || Red & White  || Saint Oswald, Bishop of Worcester 961–992 || Day, 1984–\n|-\n| School(S) || Light Blue  || School House building || Boarding, 1888–1991;Day, 1991–\n|-\n| Wulstan(W) || Purple  || Saint Wulstan, Bishop of Worcester 1062–1095 || Day, 1961–\n|-\n! colspan=5 | Discontinued Houses\n|-\n! House !! House Colours !! Eponym !! Type & Timespan\n|-\n| Hostel(H) || Green  || The Hostel building || Boarding, 1903–1999\n|-\n| Bright(Br) || Orange  || Henry Bright, Headmaster 1589–1627 || Day, 1961–2024\n|-\n|College|| ||College House building||Girls, Boarding, 1977–1999\n|-\n|Eliot|| ||Peter Eliot, Archdeacon of Worcester 1961–1975||Girls, Day House, 1986–1991\n|}\nCastle, Choir, Hostel and School Houses, all former boarding houses, are named for the buildings which originally housed them. As boarding diminished during the 1990s, these houses either converted to day houses (School and Choir), or were discontinued (Castle and Hostel). The remaining houses, which originated as day-boys' houses, are named for former school headmasters (Saint Oswald and Saint Wulstan, both Bishops of Worcester, being regarded as \"headmasters\" of the former monastic school).\nOld Vigornians\nAll former pupils are considered to be Old Vigornians, and can use the post-nominal letters OV. Predecessor institutions are not considered: only those who attended King's from its refoundation in 1541 onwards are listed below.\n{|\n| colspan=3|Politics and Law:\n|-\n| Edward Winslow || (1595–1655) || Pilgrim Father, Governor of Plymouth Colony, Massachusetts\n|-\n| Sir John Vaughan || (1603–1674) || Judge and statesman, Chief Justice of the Common Pleas\n|-\n| Lord Somers || (1651–1716) || Lawyer and statesman, Lord Chancellor\n|-\n| John Porter-Porter || (1855–1939) || Politician, Senator (Ulster Unionist) in the Senate of Northern Ireland\n|-\n| Sir Stephen Tomlinson || (born 1952) || Judge, Lord Justice of Appeal\n|-\n| Sir Julian Flaux || (born 1955) || Judge, Lord Justice of Appeal, Chancellor of the High Court\n|-\n| Richard Bacon || (born 1962) || Politician, MP (Conservative) for South Norfolk\n|-\n| Sir Ashley Fox || (born 1969) || Politician, MEP (Conservative) for South West England, leader of the Conservatives in the European parliament\n|-\n| colspan=3|Public Service:\n|-\n| Sir Jack Longland || (1905–1993) || Educational administrator, mountain climber, broadcaster\n|-\n| Sir Richard Tilt || (born 1944) || Director General of HM Prison Service, Chairman of the Social Security Advisory Committee\n|-\n| Lord Garden || (1944–2007) || RAF Air Marshal, Assistant Chief of the Air Staff; Director of Chatham House\n|-\n| colspan=3|Clergy:\n|-\n| Roger Maynwaring || (1582–1653) || Dean of Worcester and Bishop of St David's, chaplain to Charles I\n|-\n| Thomas Warmestry || (1610–1665) || Dean of Worcester\n|-\n| Anthony Williams || (1892–1975) || Bishop of Bermuda\n|-\n| Seiriol Evans || (1894–1984) || Dean of Gloucester\n|-\n| Sir Philip Strong || (1899–1983) || Bishop of New Guinea and Archbishop of Brisbane\n|-\n| Alistair Magowan || (born 1955) || Bishop of Ludlow\n|-\n| colspan=3|Academia and Education:\n|-\n| Robert Harris || (1581–1658) || President of Trinity College, Oxford, member of the Westminster Assembly\n|-\n| Hannibal Potter || (1592–1664) || President of Trinity College, Oxford, royalist\n|-\n| William Dugard || (1606–1662) || Schoolmaster, textbook writer and publisher, associate of John Milton\n|-\n| Thomas Good || (1609–1678) || Master of Balliol College, Oxford\n|-\n| Thomas Hall || (1610–1665) || Schoolmaster, radical presbyterian clergyman\n|-\n| Alexander Pearce Higgins || (1865–1935) || International law scholar; Professor, London School of Economics, University of Cambridge\n|-\n| Martin Lowson || (1938–2013) || Aeronautical engineer; Professor, University of Bristol\n|-\n| Godfrey Hewitt || (1940–2013) || Evolutionary biologist; Professor, University of East Anglia\n|-\n| Anthony J. Culyer || (born 1942) || Economist specialising in health policy; Professor, University of York, University of Toronto\n|-\n| colspan=3|Commerce and Industry:\n|-\n| Dr John Wall || (1708–1776) || Physician, founder of the Royal Worcester porcelain company\n|-\n| Tony Garrett || (1918–2017) || Businessman, Chairman of Imperial Tobacco\n|-\n| Lord Wolfson || (1927–2010) || Businessman and philanthropist, Chairman of GUS\n|-\n| Sir Geoffrey Mulcahy || (born 1942) || Businessman, Chief Executive of Kingfisher plc\n|-\n| colspan=3|Literature:\n|-\n| Samuel Butler || (1613–1680) || Poet and satirist, author of Hudibras\n|-\n| Treadway Russell Nash || (1724–1811) || Worcestershire antiquarian and historian\n|-\n| Jonathan Raban || (1942–2023) || Travel writer and literary critic\n|-\n| Edward Kemp || (born 1965) || Playwright and theatre director, Director of RADA\n|-\n| colspan=3|Music:The school produced several notable musicians under the organist Harry Bramma (Director of Music 1965–76).\n|-\n| Hugh Blair || (1864–1932) || Organist of Worcester Cathedral and Holy Trinity Church, Marylebone; composer\n|-\n| Sir Stephen Cleobury || (1948–2019) || Organist, Director of Music at King's College, Cambridge\n|-\n| Nicholas Cleobury || (born 1950) || Organist, conductor of the Britten Sinfonia and the Oxford Bach Choir\n|-\n| Andrew Millington || (born 1952) || Organist, Director of Music at Guildford Cathedral and Exeter Cathedral\n|-\n| Stephen Darlington || (born 1952) || Organist, Director of Music at St Albans Cathedral and Christ Church, Oxford\n|-\n| Jonathan Darlington || (born 1956) || Conductor of the Duisburg Philharmonic Orchestra and music director of Vancouver Opera\n|-\n| Adrian Partington || (born 1958) || Organist, Director of Music at Gloucester Cathedral and artistic director of the BBC National Chorus of Wales\n|-\n| Geoffrey Webber || (born 1959) || Organist, Director of Music at Gonville and Caius College, Cambridge\n|-\n| Jonathan Nott || (born 1962) || Music Director of the Orchestre de la Suisse Romande and the Tokyo Symphony Orchestra\n|-\n| Allan Clayton || (born 1981) || Operatic tenor\n|-\n| colspan=3|Acting and Comedy:\n|-\n| Samuel Foote || (1720–1777) || Comic actor and dramatist\n|-\n| Clifford Rose || (1929–2021) || Actor: Secret Army, Wallis & Edward\n|-\n| Rik Mayall || (1958–2014) ||  Comedian and actor: The Young Ones, The New Statesman, Bottom\n|-\n| Jonathan Dow || (born 1965) || Actor: No Job for a Lady, The Bill, Cardiac Arrest\n|-\n| colspan=3|Journalism and Broadcasting:\n|-\n| Clive Everton || (1937–2024) || BBC snooker commentator, journalist and author\n|-\n| Chris Tarrant || (born 1946) || Television and radio broadcaster, host of Who Wants to Be a Millionaire?\n|-\n| Jeremy Thompson || (born 1947) || Journalist, news presenter for Sky News\n|-\n| Mark Webster || (born 1953) || Journalist, news correspondent for ITN\n|-\n| Will Buxton || (born 1981) || Formula One presenter and reporter for Liberty Media\n|-\n| colspan=3|Sport:\n|-\n| Brian Brain || (1940–2023) || Cricketer for Worcestershire\n|-\n| Derek Bell || (born 1941) || Racing driver\n|-\n| David Townsend || (born 1955) || Rower, bronze medallist at the 1980 Olympics\n|-\n| Luke Narraway || (born 1983) || Rugby union player for Gloucester Rugby, USA Perpignan, London Irish, Coventry R.F.C. and England\n|-\n| Zac Purchase || (born 1986) || Rower, gold medallist at the 2008 Olympics and silver medallist at the 2012 Olympics\n|-\n| Hayley Simmonds|| (born 1988)|| Racing cyclist\n|-\n| Lizzy Banks|| (born 1990)|| Racing cyclist\n|-\n| Josh Tongue || (born 1997) || Cricketer for Worcestershire and England\n|-\n| colspan=3|Miscellaneous/Eccentric:\n|-\n| Sir Edward Kelley || (1555–1597/98) || Occultist and spirit medium\n|-\n| Francis Potter || (1594–1678) || Clergyman, theorist on the Number of the Beast and on blood transfusion\n|-\n| Tim Dinsdale || (1924–1987) || Loch Ness Monster hunter\n|}\nSee also\n*List of English and Welsh endowed schools (19th century)\nReferences\n;Secondary sources\n*\n*\n*\nExternal links\n* [http://www.ksw.org.uk The King's School, Worcester official website]\n* [https://web.archive.org/web/20100817084200/http://www.isc.co.uk/school_TheKingsSchool_Worcester.htm Independent Schools Council: The King's School, Worcester]\n* [https://web.archive.org/web/20110711133250/http://www.guidetoindependentschools.com/schools/view/240/King-s-Worcester-/HMC-CSA-IAPS/The-King-s-School-Worcester-WR1-2LL Guide to Independent Schools: The King's School, Worcester]\n* [https://www.ksw.org.uk/alumni The Old Vigornians website]"
    }
  ]
}