{
  "content": [
    {
      "type": "text",
      "text": "# Kingman Park Historic District\n\n| image = Kingman Park DC row houses 08.jpg\n| caption = Row houses in Kingman Park\n| locmapin = United States Washington, D.C. east#USA\n| area =\n| built =\n| architect =\n| architecture =\n| added = December 17, 2018\n| visitation_num =\n| visitation_year =\n| refnum = 100002960\n| mpsub =\n| designated_other1 = DCIHS\n| designated_other1_abbr = DCIHS\n| designated_other1_date = May 3, 2018\n}}\nKingman Park is a historic district and residential neighborhood in Washington, D.C.. Kingman Park's boundaries are 19th Street NE to the west, C Street SE to the south, Benning Road to the north, and Oklahoma Avenue and the RFK Stadium campus to the east. The neighborhood is composed primarily of two-story brick rowhouses (most of which were built when the neighborhood was founded in 1928). Kingman Park is named after Brigadier General Dan Christie Kingman, the former head of the United States Army Corps of Engineers (for whom nearby Kingman Island and Kingman Lake are also named).\nEarly history\nBefore the 1920s, Kingman Park was a largely uninhabited, wooded area located near the D.C. city dump. The area was originally on the shores of the Anacostia River. Between 1860 and the late 1880s, large mudflats (\"the Anacostia flats\") formed on both banks of the Anacostia River due to deforestation and the heavy erosion it caused. At this time, the city allowed its sewage to pour untreated into the Anacostia. Marsh grass began growing in the flats, trapping the sewage and leading public health experts to conclude that the flats were unsanitary. Health officials also feared that the flats were a prime breeding ground of malaria- and yellow fever-carrying mosquitoes. By 1876, a large mudflat had formed just south of where Benning Bridge is today, and another,  wide, had developed just south of the former flat. By 1883, a stream named \"Succabel's Gut\" traversed the upper flat and another dubbed \"Turtle Gut\" the lower, and both flats hosted substantial populations of American lotus, lily pads, and wild rice. In 1898, officials with the United States Army Corps of Engineers and the District of Columbia convinced the United States Congress that the Anacostia River should be dredged to create a more commercially viable channel that would enhance the local economy as well as provide land where factories or warehouses might be built. The material dredged from the river would be used to build up the flats and turn them into dry land, eliminating the public health dangers they caused. In 1901, the McMillan Commission (a body established by the United States Senate to advise the Congress and District of Columbia on ways to improve the parks, monuments, memorials, and infrastructure of the city as well as plan for urban renewal, economic growth, and expansion of the federal government) concluded that commercial land was not needed and proposed turning the reclaimed flats into parkland. The D.C. government agreed in 1905, the United States Commission of Fine Arts (a federal advisory agency with review authority over the design and aesthetics of projects within Washington, D.C.) and the Army Corps of Engineers concurred in 1914, and the National Capital Park and Planning Commission signed on (belatedly) to the park plan in 1928. Most of the reclaimed mudflats were subsequently declared to be parkland and named Anacostia Water Park (now Anacostia Park) in 1919. This left the Kingman Park neighborhood cut off from the Anacostia River.\nIn 1805, local landowner Benjamin Stoddert built a wooden bridge over the Anacostia River at the present site of Benning Bridge. The bridge was sold to Thomas Ewell, who in the 1820s sold it to William Benning. Thereafter the structure was known as Benning's Bridge (or Benning Bridge). The wooden bridge was rebuilt several times after 1805. This included construction of a steel bridge in 1892, and the current beam-concrete pier bridge in 1934.\nBuilding the neighborhood\nand RFK Stadium (in the Hill East neighborhood) are center-left. The Whitney Young Memorial Bridge crosses the Anacostia River, center-bottom. Kingman Island (the long island), Heritage Island (the smaller island between Kingman Island and the far shore), and Kingman Lake (the water between Kingman Island and the far shore) can also be seen.]]\nNoted D.C. real estate developer Charles Sager began constructing homes on the vacant land that is now Kingman Park in 1927. The first 40 homes in the area, built on 24th Street NE, were sold in July 1928. Sager found that white homebuyers were not interested in living in the area, so he focused on selling homes to African Americans. Thus, Kingman Park became the first D.C. neighborhood of single-family houses to be developed specifically for Black people. By 1931, there were 230 homes in the area. Development included 22nd through 25 Streets NE, between Benning Road and E Street SE.\nA major boost to development in the area came with the construction of Charles E. Young Elementary School and Hugh M. Browne Junior High School. In May 1930, the District of Columbia Public Schools decided to construct one junior high, and one senior high, and four elementary schools in the city, including a \"platoon school\" for black children in northeast D.C. near Benning Road. Originally scheduled to be finished in November 1931, the need for the new school was so great that the school board pushed up the construction completion date by two months in November 1930. The new school was named for United States Army Colonel Charles E. Young, who was only the third black man to graduate from West Point, the first black U.S. national park superintendent, the first black man to achieve the rank of colonel in the U.S. Army, and the highest-ranking black officer in the Army at the time of his death in 1922. Young Elementary School opened on October 1, 1931, (delayed a month due to construction backlogs), and graduated its first class in January 1932. Efforts to open a junior high school for African American students in the Kingman Park area began around 1920, but it was not until 1930 that the D.C. public school system actually built one. Constructed adjacent to Young Elementary School, the new junior high was named for Hugh M. Browne, a Howard University professor and prominent educator. Browne Junior High School opened in May 1932, and was the first junior high school for black students in Northeast D.C.\nThe two new schools significantly boosted interest from homebuyers and development in the Kingman Park neighborhood. Sager announced plans in February 1931 to build another 350 homes in the neighborhood, more than doubling its existing size. The city also announced plans to build a new high school (in time, this became Spingarn High School) next to the Young and Browne schools. Additional houses were built in the late 1930s as sales took off.\nMost of the area's first residents were middle class African American families whose head of household worked for the federal government. Most of the African Americans who moved to the neighborhood in the 1940s and 1950s were Black people leaving the Deep South during the Great Migration. The construction of Robert F. Kennedy Stadium in 1961 proved problematic for the neighborhood. The stadium lies directly east of Kingman Park, and soon after it opened residents began complaining about the immense amounts of traffic that flooded their streets, attendees at stadium events illegally parking on city streets, and excessive noise and trash.\nDespite this problem with RFK Stadium, the Kingman Park neighborhood is notably stable, with many families having owned the same home for several generations. In the late 1970s and early 1980s, the neighborhood suffered a downturn as younger people grew up and left the area and homeowners (the majority of whom were now senior citizens) found themselves without access to public transportation or public services (such as grocery stores and pharmacies). In 1991, the neighborhood had a population of about 10,000 residents.\nKingman Park has been fully a part of Ward 7 since 2011. Prior to 2001, all of Kingman Park had been part of Ward 6. But with neighborhoods east of the Anacostia River losing population while areas west of it gained voters, the D.C. City Council was forced to redraw each ward's boundaries in order to maintain equal populations. In June 2001, the D.C. City Council adopted and Mayor Anthony A. Williams signed the \"Ward Redistricting Act,\" which transferred 1,840 residents of Kingman Park from Ward 6 to Ward 7. Many Kingman Park residents were very vocal about the change (which extended Ward 7 west of the Anacostia River for the first time). But these protests were not successful, and the Kingman Park voters were added to Ward 7. The Kingman Park Civic Association sued, claiming the city's action violated the federal Voting Rights Act. The Kingman Park voters lost their suit when the United States Court of Appeals for the District of Columbia Circuit held in 2003 that the District's actions did not violate federal law. Kingman Park residents filed a second lawsuit in District of Columbia (e.g., state) court, claiming that the city's actions violated the \"District of Columbia Election Act.\" But the District of Columbia Court of Appeals ruled against them in this second suit in 2007.\nCivic action\nIn the early 1970s, the Washington Metro proposed allowing the planned Orange/Blue Line to come above-ground after it left the proposed Stadium–Armory Station. In addition to the Stadium-Armory stop south of RFK Stadium, Metro also proposed an \"Oklahoma Avenue Station\" with a large parking lot north of RFK on Oklahoma Avenue NE. Residents on Oklahoma Avenue NE and members of the Kingman Park Civic Association bitterly opposed the parking lot, fearing heavy traffic and streets clogged with non-residents parking illegally in front of their homes. The Civic Association demanded that the station be placed underground, a request Metro opposed because it would cost $40 million. Residents also demanded that Metro cancel the parking lot. Residents began heavily lobbying District and federal officials against the parking lot, and in 1977, Metro finally canceled all plans for an Oklahoma Avenue Station—marking the only time citizen groups in the District of Columbia were able to get an entire station scrapped.\nIn 1975, federal, regional, and city transportation planners proposed an extension to I-695/Southeast Freeway to be called the \"Barney Circle Freeway\" to help alleviate the problems created by the failure to complete the Inner Loop. The freeway would extend I-695 past its existing terminus at the Barney traffic circle, and travel along the western bank of the Anacostia River (through Anacostia Park) to East Capitol Street and Robert F. Kennedy Memorial Stadium. A new bridge over the Anacostia River at Kingman Island would provide vehicles easy access to the Anacostia Freeway. But protests from Kingman Park and other residents of Capitol Hill forced the District of Columbia to reduce the number of lanes on the Barney Circle Freeway to two from four. The protests and legal and regulatory challenges to the proposed freeway did not end, however, and by 1992 the freeway's cost had ballooned to $160 million and it remained unbuilt. In 1993, D.C. Mayor Sharon Pratt Kelly gave her approval for construction to begin. But construction was delayed yet again when the Kingman Park Civic Association, Sierra Club Legal Defense Fund, Anacostia Watershed Society, Citizens Committee to Stop It Again, D.C. Federation of Civic Associations, and other organizations threatened to sue unless the city scaled back the freeway even further. The groups could not reach an agreement with the city, and filed suit to stop construction in May 1994. The groups claimed that federal and city officials had covered up how much hazardous waste lay under the construction sites; that the roads and bridge would add pollution, traffic, and noise to existing neighborhoods; that construction and runoff from the roadway would pollute the Anacostia River; that the road would destroy much-needed city parkland; and that the freeway would only benefit out-of-state commuters and affluent Capitol Hill residents while harming the poorer, African American neighborhoods in Anacostia. The D.C. City Council, which had the final say on whether to proceed with the project or not, bowed to neighborhood opposition and voted overwhelmingly to reject the project.\n, with Kingman Park visible towards the right]]\nAnother major battle occurred in the late 1980s and early 1990s over plans to build a new football stadium next to RFK. Talks between the Washington Redskins football team and the D.C. government over whether to build a new stadium (and keep the team from moving to Maryland) began in 1988, and almost immediately Kingman Park residents protested that they had not been consulted about the various stadium design proposals. Residents were angered that their concerns over existing parking and traffic problems at the stadium had not been addressed, and they began lobbying city and federal officials, picketing, and protesting at public meetings. Economic, property, tax, and traffic studies showed citizens of Kingman Park would suffer from a new stadium. In part because of the opposition of Kingman Park residents (who flooded Congress with visits and lobbying efforts), the Redskins organization was unable to obtain federal approval for the plan and moved to Maryland.\nTwo years after the stadium battle, Kingman Park residents began protesting plans to build a large theme park for children on nearby Kingman Island. The Children's Island theme park had been proposed since the 1960s, but had never moved past the planning stage.  However, after the federal government transferred Kingman Island and nearby Heritage Island to the city in 1995, theme park development seemed to move forward much more rapidly.  Once again, Kingman Park residents were worried about traffic and parking issues, as well as the possible environmental degradation construction might have on Anacostia Park and the Anacostia River. They began lobbying city and federal officials heavily against the theme park, and participated in lawsuits to force the developers to assess any environmental damage the park might cause. Children's Island was cancelled in 1999 when the District of Columbia Financial Control Board voted to kill the development as too costly.\nKingman Park residents have also been deeply concerned about environmental damage to the nearby Anacostia River.  In 1998, the Kingman Park Civic Association sued the United States Environmental Protection Agency (EPA) over the agency's refusal to order local communities to stop pouring untreated sewage and storm wastewater into the Anacostia River. In Kingman Park Civic Association v. U.S. Environmental Protection Agency, 84 F.Supp.2d 1 (D. D.C. 1999), the EPA agreed to a timetable under which all communities adjacent to the river would be forced to treat their sewage or suffer significant fines and penalties.\nKingman Park residents also protested a major automobile race at RFK Stadium in 2002 and 2003.  The dispute began in 2002, when D.C. officials approved a proposal to utilize RFK Stadium's parking lots for an American Le Mans Series racing event to be held that year. Kingman Park residents were again concerned about traffic and parking, but also about the excessive noise levels the lengthy event would create. Citizens were outraged when they learned that District officials had ignored laws and regulations requiring an environmental impact assessment for the race, and that Le Mans officials had lied to the city about noise levels. Kingman Park residents were further angered when American Le Mans racing officials reneged on a promise to remove the Jersey barriers outlining the racecourse from stadium parking lots, leaving the unsightly structures behind and preventing the lots from being used for parking. When the American Le Mans organization tried to hold a second race at RFK in 2003, outraged Kingman Park residents successfully forced D.C. officials to cancel the city's 10-year lease with the company (no more races were ever held).\nMore recently, residents in the neighborhood opposed the construction of a boarding school to be built by the SEED Foundation. Residents also opposed the use of fireworks at RFK Stadium when it reopened for use by the Washington Nationals baseball team. The team had proposed setting off fireworks over the stadium after each home game.  Kingman Park residents were upset about the noise, smoke, and debris the fireworks would cause, as well as the possibility of fire in their neighborhood. The residents of the neighborhood successfully prevented the team from using any fireworks.\nTransportation\nKingman Park is served by the Stadium–Armory station on the Washington Metro Blue, Orange, and Silver Lines.\nEducation\nDistrict of Columbia Public Schools operates public schools. Kingman Park is served by Miner Elementary School, Brown Education Campus, Elliot-Hine Middle School, Eastern High School and Phelps Architecture, Construction and Engineering High School.\nReferences"
    }
  ]
}