{
  "content": [
    {
      "type": "text",
      "text": "# King's Norton and Northfield Urban District__disambig_1\n\n|DivisionsMap=\n|CodeName=\n|Code=\n}}\n'''King's Norton and Northfield Urban District' was a local government administrative district in north Worcestershire, England, from 1898 until 1911. Much of its area was afterwards absorbed into the neighbouring Borough of Birmingham, under the Greater Birmingham Scheme'', and now constitutes most of the city's southern and southwestern suburban environs.\nCreation\nThe district was originally created in 1894 as the '''King's Norton Rural District, under the Local Government Act 1894, and succeeded the former King's Norton Rural Sanitary District' upon which its area was largely based.  It was later reconstituted as an urban district on 1 October 1898, by the Local Government Board Order, No. 38,127, and was accordingly renamed the 'King's Norton and Northfield Urban District'''. Both as a rural and an urban district it comprised only those civil parishes of the King's Norton Poor Law Union then wholly within the Administrative County of Worcester, namely the parishes of King's Norton, Northfield and Beoley.\nGovernance\nElectoral Wards\nThe district was arranged into the following wards for the election of local councillors:\nKing's Norton Civil Parish\n*King's Norton Ward\n*Moseley (Moor Green) Ward\n*Moseley (Wake Green) Ward\n*King's Heath (East) Ward\n*King's Heath (West) Ward\n*Stirchley (North) Ward\n*Stirchley (South) Ward\n*Rednal and Rubery Ward\n*Wythall Ward\nNorthfield Civil Parish\n*Northfield Ward\n*Selly Oak (East) Ward\n*Selly Oak (West) Ward\n*Bartley Green Ward\nBeoley Civil Parish\n*Beoley Ward\nCommittees\nThe district council was organised into several committees with responsibility over a number of areas:\nGeneral Purpose Committee\nBaths, Parks and Cemeteries Committee\nWhen the committee was initially set up it was as the Cemeteries Committee, with a separate sub-committee that had specific responsibility for baths and parks.  However, from May 1898 onwards, the Baths & Parks Sub-Committee ceased to exist and the Cemeteries Committee assumed their duties, altering its title to reflect this change.\nBuilding Committee\nEducation Committee\nThe committee was formed on 1 June 1903, and consisted of 40 members, of whom 28 were district councillors.\nPensions Committee\nThe committee had distinct sub-committees for the following areas of the district: King's Norton & Stirchley, Moseley & King's Heath, Wythall & Beoley, Northfield, and Selly Oak.\nDistress Committee\nThe Committee consisted of 25 members, of whom 12 were district councillors, eight were guardians of the King's Norton Poor Law Union, and the remaining five were \"persons experienced in the relief of distress\".\nDemography\nAccording to the 1911 census the district had a population of 81,153, large enough to become a county borough.\nAmenities and services\nDuring its existence the district council provided public amenities for its populace in the form of two cemeteries, two swimming baths, several parks and recreation grounds, and a handful of free libraries.  The council also ran a number of elementary schools, as well as being responsible for the local volunteer fire service:\nDistrict cemeteries\n{| class=\"wikitable unsortable\"\n|-\n! Image\n! style=\"width: 15em\" | Name\n! style=\"width: 8em\" | Year of opening\n! Details\n|-\n| align=\"center\"| || Lodge Hill Cemetery || align=\"center\"|1895|| The site for the cemetery at Lodge Hill in Selly Oak was initially secured by the old rural sanitary authority for £3,528, after which the rural district council oversaw the construction of two mortuary chapels and the cemetery offices, which were designed by F. B. Andrews. The cemetery opened in January 1895, but it was not until the following year that it was consecrated by the then Bishop of Worcester and Coventry, the Right Reverend John Perowne.  As well as having specific burial sections for Anglicans, Catholics and Non-conformists, it also had an area exclusively for the use by the Society of Friends, in which notable members of the Quaker families of Lloyd and Cadbury were buried.\n|-\n| align=\"center\"|? || Brandwood End Cemetery || align=\"center\"|1899|| The Rural District Council bought land at Brandwood End, near King's Heath, for the purpose of building a cemetery in 1895.  The combined cost of the purchase price and its laying out came to £17,000, which included deep drainage work due to the area's clay subsoil.  Two terracotta and red brick mortuary chapels were erected on the site, one consecrated and the other not, both designed by Brewin Holmes. The Cemetery officially opened on 13 April 1899, with its first burial taking place two days later.\n|-\n|-\n|}\nPublic baths\n{| class=\"wikitable unsortable\"\n|-\n! Image\n! style=\"width: 15em\" | Name\n! style=\"width: 8em\" | Year of opening\n! Details\n|-\n| align=\"center\"| || Tiverton Road Public Baths || align=\"center\"|1906 || The baths in Bournbrook were built in 1905.  Designed by E. Harding Payne, the building work was carried out by the local firm of Messrs T. A. Cole & Son.\n|-\n| align=\"center\"|? || Bournville Lane Public Baths || align=\"center\"|1911 ||Stirchley\n|-\n|}\nPublic parks\n{| class=\"wikitable unsortable\"\n|-\n! Image\n! style=\"width: 15em\" | Name\n! style=\"width: 8em\" | Year of opening\n! Details\n|-\n| align=\"center\"| || Selly Oak Park || align=\"center\"|1899 || A gift of 11½ acres of the former Weoley Park Farm estate, in Selly Oak, was made to the urban district council by Mrs Emma J. Gibbins and her four sons, in February 1899, specifically for the formation of a public park.\n|-\n| align=\"center\"| || Cotteridge Park || align=\"center\"|1905 || Cotteridge\n|-\n| align=\"center\"| || Muntz Park || align=\"center\"|1905 || Selly Park\n|-\n| align=\"center\"|? || Victoria Common || align=\"center\"|1905 || Northfield\n|-\n| align=\"center\"|? || ''King's Heath Park'' || align=\"center\"|1909 || King's Heath\n|-\n| align=\"center\"|? || Selly Park Recreation Ground || align=\"center\"|1910 ||The land for this recreation ground had originally been earmarked for housing as part of the residential development of the Selly Hill Estate (later the Selly Park Estate), but for some unknown reason the building work never commenced. The main area, therefore, was acquired by the urban district council in April 1910, being bought from Mr W. A. Issett for £1,940, with further acreage being purchased in the December of that same year from the Martin Trustees at a cost of £3,067.\n|-\n|}\nFree libraries\nProposals for the provision of free libraries in the district were first mooted in 1902, and following the adoption of the Libraries Acts the next year, a scheme to establish libraries throughout its area was set up.  Between 1905 and 1909 seven new libraries were built across the district, with the land being donated by local philanthropic businessmen and the building work funded through the benevolence of Dr Andrew Carnegie.\n{| class=\"wikitable unsortable\"\n|-\n! | Image\n! style=\"width: 15em\" | Name\n! style=\"width: 8em\" | Year of opening\n! Details\n|-\n| align=\"center\"|? || Bartley Green Free Library || align=\"center\"|1905 ||\n|-\n| align=\"center\"| || ''King's Heath Free Library || align=\"center\"|1906 ||\n|-\n| align=\"center\"|? || King's Norton Free Library || align=\"center\"|1906 ||\n|-\n| align=\"center\"| || Selly Oak Free Library || align=\"center\"|1906 || Built on land in the High Street, given by Mr Thomas Gibbins Junior of the Birmingham Battery and Metal Company in Selly Oak, in 1903, the foundation stone was laid on 1 August 1905 by Councillor E. A. Olivieri. The construction work itself was paid for by the Carnegie Foundation, and, at a final cost of £3,000, the Library was officially opened by Mr Gibbins on 23 June 1906. The completed building comprised a Reading Room, Lending Department and Reference Department.\n|-\n| align=\"center\"| || Northfield Free Library || align=\"center\"|1906 || Situated in Church Road, Northfield, and costing £750 to build, this small Library first opened its doors in September 1906. The original building, however, was consumed by fire on 12 February 1914. Believed to be the work of an arsonist, local suffragettes were reputed to have been responsible as they were active in the area, and a note was found spiked on the railings outside bearing the words \"Give Women the Vote\" along with a small brown paper parcel containing a copy of The Great Scourge and How to End It by Miss Christabel Pankhurst, apparently inscribed \"To start your new library.\"\n|-\n| align=\"center\"| || Stirchley Free Library || align=\"center\"|1907 || Located on Bournville Lane in Stirchley, the Library was built in 1907.  As well as donating the land itself, George Cadbury apparently contributed £3,000 towards the building cost, though much of the work also seems to have been paid for by the Carnegie Trust.\n|-\n| align=\"center\"|? || Rednal Free Library'' || align=\"center\"|1909 || Built in Leach Green Lane, Rednal, the Library's foundation stone was laid on 12 June 1909 by \"P. Farrell Esq.\"  The memorial tablet declares that \"The funds for the erection of this building were provided by Andrew Carnegie Esq. of Skibo Castle N.B. and the purchase money for the site was given by Messrs Edward and George Cadbury Junior\".\n|-\n|}\nCouncil schools\nUntil the Education Act 1902, elementary education within the district was provided through a combination of a number of voluntary schools established by religious organisations, such as the Church of England national schools and the non-denominational British schools, together with those schools built and maintained by the local school boards for King's Norton and Beoley, who had been set up in the wake of the Elementary Education Act 1870.  Under the 1902 act the urban district council was designated a local education authority, and thereafter assumed the duties of the former King's Norton and Beoley school boards, which were accordingly abolished, inheriting their existing school buildings, as well as being given the power to establish new elementary schools within the area.\n{| class=\"wikitable unsortable\"\n|-\n! Image\n! style=\"width: 15em\" | Name\n! style=\"width: 8em\" | Year of opening\n! Details\n|-\n| align=\"center\"|? || Woodgate Council School || align=\"center\"|1906 || The school was originally opened as the Woodgate British School in 1891, at the local Primitive Methodist Chapel, but passed into the control of the Urban District Council in 1906. Considerable alterations to the building had taken place in 1893, as the original structure was considered inadequate, and despite further repairs carried out after its transfer it was repeatedly condemned. The school was finally closed in 1914 by Birmingham Corporation, when it was replaced by the new Bartley Green Council School.\n|-\n| align=\"center\"|? || Tiverton Road Council School || align=\"center\"|1906 || The urban district council opened the Tiverton Road School at Bournbrook in 1906.\n|-\n| align=\"center\"| || Raddlebarn Lane Council School || align=\"center\"|1909 ||A school was first established on Raddlebarn Lane (now Raddlebarn Road), Selly Park, in 1905. It replaced the earlier Selly Oak and Bournbrook Temporary Council School, which had been set up in the Bournbrook Technical Institute. The school was initially housed in some corrugated iron buildings, but work on a more permanent structure alongside began in 1906. The new school opened in 1909, and a year later was reorganised into separate Boys, Girls and Infants Departments.\n|-\n| align=\"center\"| || Selly Park Council School || align=\"center\"|1911 ||The school, situated on the A441 Pershore Road in Selly Park, opened in 1911, replacing a temporary school that had existed on nearby Fashoda Road since 1904. During World War I the new school was briefly used as a war hospital, caring for wounded soldiers, before being returned to an educational use.\n|-\n|}\nFire service\n{| class=\"wikitable unsortable\"\n|-\n! Image\n! style=\"width: 15em\" | Name\n! style=\"width: 8em\" | Year of opening\n! Details\n|-\n| align=\"center\"|? || ''King's Heath Fire Station'' || align=\"center\"|  ||The King's Heath Fire Brigade was first formed in 1886, and became the largest in the District. Its Station was in Sliver Street, King's Heath, and in 1910 it consisted of a force of 23 members, with both a manual and a steam engine, five horse-carts and four fire-escapes.\n|-\n| align=\"center\"| || Selly Oak Fire Station || align=\"center\"|  ||The Selly Oak Brigade had their Station at 'The Dingle', just off the Bristol Road. Its captain from about 1890 had been Andrew Crump, who may be the man standing beside the driver in the accompanying photograph with braiding on his sleeve.\n|-\n| align=\"center\"|? || ''King's Norton Fire Station'' || align=\"center\"|  ||A sub-station of the King's Heath Brigade, it was located on Holly Road in 'The Cotteridge'.\n|-\n| align=\"center\"|? || Northfield Fire Station || align=\"center\"|  ||Before the building of a Fire Station at 146 Maas Road, Northfield's tender was kept in the garden of the house of the then captain, Jack Hunt, in Cock Lane\n|-\n| align=\"center\"|? || Moseley Fire Station || align=\"center\"|  ||The Moseley branch of the King's Heath Brigade had their station in Tudor Road, Moseley.\n|-\n|}\nAbolition\nThe urban district was finally abolished in 1911 as part of the provisions of the Greater Birmingham Act 1911 (1 & 2 Geo. 5. c. xxxvi), when much of its area was incorporated into the County Borough of Birmingham, and thereby became associated with Warwickshire.  This included the greater part of the civil parish of King's Norton, with the exception of a substantial still largely rural area in the south-east of the parish, which afterwards constituted the new civil parish of Wythall, as well as a small part of Rednal in the far south-west, which was added to the civil parish of Cofton Hackett.  It also included most of Northfield civil parish, save for a little under 200 acres at its extreme north-western tip which was transferred to the civil parish of Illey,  then part of the Halesowen Rural District.  It did not, however, include Beoley civil parish, which remained in Worcestershire, and which, along with Wythall, initially formed a separate rural district temporarily administered by the Bromsgrove Rural District Council, until both became part of that district on 31 March 1912.\nReferences\nNotes\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*[https://web.archive.org/web/20070930201627/http://www.visionofbritain.org.uk/relationships.jsp?u_id=10186560 Vision of Britain]"
    }
  ]
}