{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom 3: The Flame of Destiny\n\n| director       = Shinsuke Sato\n| story          =\n| based_on       =\n| producer       =\n| starring       = Kento YamazakiRyo YoshizawaKanna HashimotoNana SeinoAnne WatanabeKataoka Ainosuke VITakao Osawa\n| narrator       = Kouichi Yoshinaga\n| cinematography = Tooru Kawazu\n| editing        = Tsuyoshi Imai\n| music          = Yutaka Yamada\n| studio         = Columbia PicturesSony Pictures Entertainment JapanCredeus\n| distributor    = Toho\n| released       =\n| runtime        = 130 minutes\n| country        = Japan\n| language       = Japanese\n| budget         =\n| gross          =  (Japan)\n* (worldwide)\n}}\n}}\nis a 2023 Japanese historical war film directed by Shinsuke Sato, based on Yasuhisa Hara's manga series Kingdom. It is a sequel to Kingdom (2019) and Kingdom 2: Far and Away (2022). The film stars Kento Yamazaki, Ryo Yoshizawa, Kanna Hashimoto, Takao Osawa, and Masami Nagasawa as returning cast for the film.\nA sequel, Kingdom 4: Return of the Great General, was released on July 12, 2024.\nPlot\nThe film begins 6 months after the events of the previous movie where the Wei army had marched into the state of Qin. The king of Qin hears news of Li Xin (Shin) being found in the lawless lands where he was training under General Ou Ki (Wang Qi) to become a 100-Man Commander. A voiceover tells of Shin's success, having first backed the weakest tribe of the lawless lands.\nThe Zhao army begins to invade at this time where they enact a massacre of the castle and its citizens as vengeance for a slaughter  of 400,000 Qin had inflicted upon Zhao 16 years ago.\nThe first half of the movie follows a format where Ying Zheng explains to General Ou Ki the reason for his desire to unify China. This part of the story showcases how Ying Zheng made his decisions in the first movie. General Ou Ki decides to become Commander-in-Chief of the Qin army.\nThe next half of the movie, showcases the large scale battle between Qin and Zhao.\nMeanwhile, General Ou Ki tasks Shin and his new 100-man unit with the task of sneaking into the left side battlefield to take down the commanding general, Fuki, of that side. He explains that as the battle wears on, competent military strategists like Fuki will become more and more crucial to the outcome. Shin accept. As a reward for accepting the task of this assassination attempt,  Ouki provides the name of Hi Shin Unit to the unit under Shin.\nOn the battlefield, General Fuki orders a Zhao retreat, luring the 'winning' Qin left army in. He then outflanks them from both sides with Zhao forces, decimating half of them with arrows.\nThe Hi Shin unit is initially filled with apprehension, but with Shin's motivation and leadership, they attempt to scale a steep cliff leading up to Fuki's encampment. Diving their motives, Fuki sends men to greet them at the top, where they send one of Shin's men plunging to his death. In an act of sacrifice, Yugi, one of Shin's men, suggest they split, with the majority of them directing Fuki's men while Shin leads a smaller group up a separate route. Through this action, Shin, Kyokai (Qiang Lei) from the previous movie, and the rest of the unit are able to break through to the enemy headquarters.\nFuki orders Zhao's central army forward to finish off Qin's left army right before he realizes how close Shin and his men are. He realises that he was tricked by Ou Ki into moving both wings of his army against Qin's left, leaving himself greatly unguarded. He orders Zhao's retreat, but too late. Shin kills him with a jump cut through his neck. The remnants of Qin's left army arrives to reinforce the Hi Shin Unit.\nAfter the Zhao army retreats into the nearby mountain range. Ou Ki opines that they retreated too easily, and deduces that there must be a mystery commander calling the shots. He makes all commanders under his command promise that none of them will go further than where they can see Zhao's former mountaintop headquarters.\nThe Hi Shin unit lost 31 men. General Ou Ki tells them that because of their deed, their unit will become known across all of China. As they celebrate over a campfire that night, a mystery figure in carrying a scythe approaches and begins killing the men.\nBack at the Qin palace, it is learned that there is a hidden Zhao commander who goes by the name of Hou Ken (Pang Nuan) and is the one who killed Great General Kyo (Liao), a fellow commander alongside Shou Bun Kun and Ou Ki. This is presumably the attacker who approached the camp of the Hi Shin Unit. It is surmised that Hou Ken has arrived to kill General Ouki after being defeated by him 9 years prior, and that Ouki had suspected this, which is why he agreed to take on the post of commander-in-chief.\nMeanwhile, back at the Hi Shin Unit's campsite, the attacker introduces himself as Hoken, Bushin \"War God\".\nCast\n* Kento Yamazaki as Xin\n* Ryo Yoshizawa as Ying Zheng\n* Kanna Hashimoto as He Liao Diao\n* Nana Seino as Qiang Lei\n* Amane Okayama as Wei Ping\n* Takahiro Miura as Wei Dao\n* Shinnosuke Mitsushima as Bi\n* Kunito Watanabe as Shang Lu\n* Togi Makabe as Pei Lang\n* Sō Kaku as Long Chuan\n* Miou Tanaka as Yuan\n* Takayuki Hamatsu as Ze Gui\n* Kyosuke Yabe as You Yi\n* Yūsuke Hirayama as Meng Wu\n* Riku Hagiwara as Meng Yi\n* Eri Murakawa as You Li\n* Hinako Sakurai as Dong Mei\n* Anne Watanabe as Zhi Xia\n* Yosuke Asari as Ya Men\n* Tetta Sugimoto as Dao Jian\n* Yui Sakuma as Hai Yin\n* Mitsuomi Takahashi as Gan Yang\n* Masaya Kato as Si Shi\n* Masahiro Takashima as Lord Changwen\n* Jun Kaname as Teng\n* Yuki Yamada as Wan Ji\n* Kataoka Ainosuke VI as Feng Ji\n* Koji Yamamoto as Zhuang Zhao\n* Masami Nagasawa as Yang Duan He\n* Hiroshi Tamaki as Lord Changping\n* Kōichi Satō as Lü Buwei\n* Shun Oguri as Li Mu\n* Kōji Kikkawa as Pang Nuan\n* Takao Osawa as Wang Qi\nBox office\nThe films total domestic box office gross is 5.6 billion yen ( million|long=no}}), making it the fifth top-grossing film of 2023 in Japan.\nReferences\nExternal links\n*"
    }
  ]
}