{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of Dalmatia\n\n| conventional_long_name = Kingdom of Dalmatia\n| status                 = Autonomous kingdom\n| empire                 = Austria-Hungary\n| status_text            = Constituent kingdom (part of Cisleithania)\n| era                    = WWI}}\n| event_start            = Dissolution of Illyrian Provinces\n| year_start             = 1814\n| date_start             =\n| event_end              = Formation of State of Slovenes, Croats and Serbs\n| year_end               = 1918\n| date_end               = 29 October\n| p1                     = Illyrian Provinces\n| flag_p1                = Flag of France.svg\n| s1                     = State of Slovenes, Croats and Serbs\n| flag_s1                = Flag of the State of Slovenes, Croats and Serbs.svg\n| s2                     = Governorate of Dalmatia\n| flag_s2                = Flag of Italy (1861-1946) crowned.svg\n| image_flag             = Flag of the Kingdom of Dalmatia.svg\n| image_coat             = Coat of arms of the Kingdom Dalmatia 1797-1918.png\n| coa_size               =\n| image_map              = Austria-Hungary map.svg\n| image_map_caption      = Dalmatia (number 5) within Austria-Hungary\n| common_languages       = Croatian, Italian, Chakavian, Venetian\n| government_type        = Constitutional monarchy\n| title_leader           = King\n| leader1                = Francis I\n| year_leader1           = 1815–1835\n| leader2                = Ferdinand I\n| year_leader2           = 1835–1848\n| leader3                = Francis Joseph I\n| year_leader3           = 1848 – 1916\n| leader4                = Charles I\n| year_leader4           = 1916 – 1918\n| title_deputy           = Governor\n| deputy1                = Franjo Tomašić\n| year_deputy1           = 1815 – 1831\n| deputy2                = Mario Attems\n| year_deputy2           = 1911 – 1918\n| legislature            = Diet of Dalmatia\n| capital                = Zadar\n| life_span              = 1815 – 1918\n| official_languages     = German\n| ethnic_groups          = Croats, Serbs, Dalmatians, Italians\n| religion               = Roman Catholicism\n| demonym                = Dalmatian\n| population_census      = 645,666\n| population_census_year = 1910\n| currency               = Florin(1815 – 1892),Crown(1892 – 1918)\n| today                  = CroatiaMontenegro\n}}\nThe Kingdom of Dalmatia (; ; ) was a crown land of the Austrian Empire (1815 – 1867) and the Cisleithanian half of Austria-Hungary (1867 – 1918). It encompassed the entirety of the region of Dalmatia, with its capital at Zadar.\nIt was formed at the Congress of Vienna in 1815 out of the former short-lived Illyrian Provinces. Near the end of WW1 in 1918, as part of the Triune Kingdom, all ties with Austria-Hungary were ended, and it became part of the State of Slovenes, Croats and Serbs.\nHistory\nThe Habsburg monarchy had annexed the lands of Dalmatia after the Napoleonic War of the First Coalition: when Napoleon Bonaparte launched his Italian Campaign into the Habsburg duchies of Milan and Mantua in 1796, culminating in the Siege of Mantua, he compelled Emperor Francis II to make peace. In 1797 the Treaty of Campo Formio was signed, whereby the Habsburg emperor renounced possession of the Austrian Netherlands and officially recognized the independence of the Italian Cisalpine Republic. In turn, Napoleon ceded to him the possessions of the Republic of Venice, including the Dalmatian coast (Venetian Dalmatia) and the Bay of Kotor (Venetian Albania). The Republic of Venice had sided with Austria in order to defend her Domini di Terraferma and was occupied by French troops on 14 May 1797. The treaty ended the centuries-long history of the Venetian Republic.\nThe newly acquired Habsburg crown land stretched from the Rab Island and Karlobag in the north down the Adriatic coast to Budva in the south, while the Republic of Ragusa (Dubrovnik) retained its independence until 1808. When in 1804 Francis II created the title of Emperor of Austria for himself (as Francis I), he also added that of \"King of Dalmatia\" (Dalmatiae Rex). However, the possessions were again lost after the Austrian defeat in the Battle of Austerlitz and the 1805 Peace of Pressburg, when they temporarily formed part of the French Illyrian Provinces. Not until the Congress of Vienna in 1814–15 was the Kingdom of Dalmatia formed from the regained territories, now including the former Republic of Ragusa and stretching down to Sutomore in the southeast.\nAround 1850, the Austrians had the Prevlaka fortress erected to control the maritime traffic in the Bay of Kotor. Upon the Revolutions of 1848, Dalmatia was temporarily under the control of Ban Josip Jelačić of Croatia. However, the Italian-speaking elite dominating the Diet of Dalmatia urged autonomy for the kingdom as an Austrian crown land against the Croatian national revival movement's demand for a Triune Kingdom of Croatia, Slavonia, and Dalmatia. In the Austro-Hungarian Compromise of 1867, a unification with the Kingdom of Croatia-Slavonia was denied. While Croatia-Slavonia was incorporated into the Lands of the Crown of Saint Stephen, Dalmatia remained a crown land of the Cislethanian (Austrian) half of the Dual Monarchy.\nThe kingdom was a separate administrative division of Austria-Hungary until 1918, when its territory except for Zadar and the islands of Lastovo and Palagruza which were annexed by the Kingdom of Italy became part of the State of Slovenes, Croats and Serbs and the Kingdom of Serbs, Croats and Slovenes (later the Kingdom of Yugoslavia). As a result of the Vidovdan Constitution (in 1921), the majority of the kingdom was divided into the Split Oblast and Dubrovnik Oblast, with the Bay of Kotor being administratively split off to the largely Montenegrin Zeta Oblast.\nBackground\nof the Republic of Venice from 1420 to 1797]]\nNapoleonic Kingdom of Italy in 1807 shown in yellow]]\nThe Republic of Venice, between the 9th century and 1797, extended its dominion to Istria, the islands of Kvarner and Dalmatia, when it was conquered by Napoleon. Istria and Dalmatia were then aggregated to the Napoleonic Kingdom of Italy in 1805, and annexed to the Illyrian Provinces in 1809 (for some years also the Republic of Ragusa was included, since 1808).\nAfter the fall of Napoleon (1814) Istria, the islands of Kvarner and Dalmatia were annexed to the Austrian Empire. From the Middle Ages to the 19th century, Italian and Slavic communities in Dalmatia had lived peacefully side by side because they did not know the national identification, given that they generically defined themselves as \"Dalmatians\", of \"Romance\" or \"Slavic\" culture.\nFirst Austrian Administration\nMany workers and citizens throughout Dalmatia were revolted by the fall of the Venetian Republic in 1797. A strong movement for unification of Dalmatia with Kingdom of Croatia-Slavonia emerged. The Franciscans and many other members of the clergy held gatherings, for example in the village of Gornji Karin, where they demanded unification. They were joined by Archbishop Lelije Cipiko of Split, the Bishop of Makarska and the Orthodox clergy. In June 1797, they formed a delegation which planned to travel to Vienna and ask the Emperor to approve unification but they were pre-empted by the Treaty of Campo Formio, so they decided to contact the Croatian Ban instead. By the Treaty of Campo Formio, signed on 18 October 1797 between the French First Republic and the Habsburg monarchy, Venetian territories were divided between the two states with Habsburg Monarchy gaining Istria and Dalmatia.\nThe Austrian army, with about 4,000 soldiers, was led by the Croatian general Mathias Rukavina von Boynograd in claiming the newly acquired territories. Rukavina, a supporter of the unification of Dalmatia and Croatia-Slavonia, was named Military Governor of Dalmatia. The people and the clergy were delighted to see the arrival of a Croat-led army composed predominantly of ethnic Croats. However, Dalmatia was treated as a newly conquered territory and so it had no autonomous government but was directly subjected to the government in Vienna.\nIn 1798, the Imperial and Royal Government (; ), headed by the governor, was founded in Zadar. Members of the government and the governor were appointed by the Emperor and were subordinated to the Imperial and Royal Court Committee for Istria, Dalmatia, and Albania in Venice (; ), and since 1802 to the Viennese Royal Chamber's Section for Dalmatia and the Bay of Kotor (). Dalmatia was divided into administrative-court districts, headed by the rectors and judge-administrators. Seats of the districts were in Cres, Krk, Rab, Pag, Zadar, Nin, Novigrad, Skradin, Šibenik, Knin, Sinj, Trogir, Split, Klis, Omiš, Brač, Hvar, Korčula, Imotski, Makarska, Poljica and Metković.\nIn 1802, the Habsburg court officially rejected the request for the unification of Dalmatia with the Kingdom of Croatia-Slavonia. During its short first administration of Dalmatia, the Austrian government did little to change the existing Venetian system and implemented only limited reforms in education and the judiciary. In 1803, a gymnasium was opened in Zadar. After the Austrian defeat against Napoleon, according to the provisions of the 1805 Peace of Pressburg, Dalmatia was handed over to the French, who annexed it to Napoleon's client state of the Kingdom of Italy. That ended the first Austrian administration of Dalmatia.\nFrom the Middle Ages to the 19th century, Italian and Slavic communities in Dalmatia had lived peacefully side by side because they did not know the national identification, given that they generically defined themselves as \"Dalmatians\", of \"Romance\" or \"Slavic\" culture.\nFrench Administration\nFollowing the Peace of Pressburg, Napoleon sent General Gabriel Jean Joseph Molitor to take over Dalmatia. In February 1806, the French occupied northern Dalmatia down to the Neretva River. The Bay of Kotor, which was also given to the French by the Peace, was held by the Russians and their Montenegrin allies. In addition, the Russians also occupied the Korčula and sought to capture the Republic of Ragusa.\nEnd of the Republic of Ragusa\n, from 1426 (encompassing also the area labelled \"Neum\" until 1718)]]\nAccording to the provisions of the Peace of Pressburg, France was entitled to all of Dalmatia and the Bay of Kotor. The territory of the Republic of Ragusa (Dubrovnik) cut off terrestrial connection between those French territories. With Napoleon's army on one side, and the weakened Ottoman Empire on other, the Republic was no longer safe. On 27 May 1806, endangered by the Russians, the Republic surrendered without resistance to the French troops. A French force of about 1,200 soldiers under the command of General Jacques Lauriston entered the city under the false pretenses. Since the entry of the French army into Dubrovnik, war operations in the Ottoman Empire, led by the joint Russian military and Montenegrin paramilitary forces, who were assisted by Serb population from the hinterland, began. At the beginning of October 1806, with the help of General Auguste de Marmont, the hostile Russian army was expelled from the territory of the Dubrovnik Republic. Shortly thereafter, the French took over Dubrovnik's government. The needs of a large number of French troops financially exhausted Dubrovnik. Dubrovnik's mercantile navy was destroyed or lost in the Mediterranean ports, and the once very lucrative trade with the hinterland was interrupted. On 31 January 1808 General Marmont, with Napoleon's approval, dissolved Dubrovnik's Senate and abolished Dubrovnik's independence. After the abolition of the Republic, the Dubrovnik area with Bay of Kotor was subjected to Napoleon's Kingdom of Italy and between 1810 and 1814 included in the French Illyrian Provinces.\nDalmatia under the French\n, military commander of Dalmatia during French rule (1806–1813)]]\nSoon after the occupation of Dalmatia, Napoleon appointed General Vincenzo Dandolo to the position of the provéditeur général of Dalmatia (appointed on 28 April 1806) and General Auguste de Marmont to the position of a military commander of Dalmatia (appointed on 12 June 1806). Dalmatia was administratively linked to the Kingdom of Italy whose seat was in Milan. On 14 October 1809, Illyrian Provinces were created with the Treaty of Schönbrunn. The center of the Dalmatian Government (), led by the General Dandolo, was in Zadar. Italian become the official language. Dalmatian interests were advocated (only formally) by the so-called Dalmatian minister without portfolio who worked at the then central government of the Kingdom of Italy in Milan. Ivan Stratico served as a Minister for a long time. Proveditura Generale was divided into six departments (judiciary, internal affairs, finance, military affairs, teaching, accounting) that were led by the department heads. In addition, there were also 1 police and 1 military supervisor. All of them were subordinated to the Secretary-General () who was Proveditore Generale's right hand. Main Council of Dalmatians () was an advisory body. It was composed of 48 members who were chosen by the Government from the districts, one or more from each, according to the number of districts' inhabitants. The first members were appointed by the Government alone, and after each year 12 of them would resign, after which the Council proposed a list from which the Government would then pick 12 new candidates and appoint them to serve on the council. The council was presided over by the Proveditore Generale and it discussed various subjects relevant for Dalmatia. Councils' conclusions were only valid after Proveditore Generale's formal confirmation.\nThe judiciary was separated from the administration. There were 22 local or reconciliatory courts (), primarily in all districts, as well as in some other more important areas. Zadar, Split and Dubrovnik were seats of the tribunals which were courts of appeal for local courts and first-instance courts in all civil and criminal cases. Furthermore, a Court of Appeal for Tribunal verdicts was established in Zadar, while the Court in Milan was the Supreme Court (). The original intention was to introduce French laws (Napoleonic Code et al.), but it soon became apparent that this would have been unfeasible due to the popular perceptions and customs, especially in property, inheritance and marital affairs. Therefore, in addition to superior French laws, Austrian and Venetian laws were also implied. The equality of all before the law was introduced as well.\nDalmatia was territorially divided into counties, districts, municipalities, and villages. According to such division, Dalmatia was divided into four counties: Zadar, Šibenik, Split and Makarska. Zadar County was divided into six districts (Zadar, Krk, Cres, Lošinj, Rab and Pag), Šibenik County into three (Šibenik, Skradin and Knin), Split County into five (Split, Trogir, Sinj, Nerežišća and Hvar) and Makarska into three (Makarska, Imotski and Korčula). County was led by a commissioner (), district by a Vice-commissioner (), municipality by a municipal mayor, and village by an elder captain (). When the Bay of Kotor was given to France by the 1809 Treaties of Tilsit,  and a year later the Republic of Dubrovnik was abolished, a special Proveditore Generale, Dominik Garagnin, was appointed to rule over four counties (Cavtat, Ston, Lopud and Kotor) and two districts (Herceg Novi and Budva).\n, the first governor of the Kingdom of Dalmatia]]\nThe new territorial-administrative system has fundamentally redefined the existing Venetian system in Dalmatia. Some forms of governing bodies from the Venetian period were retained, e.g. the position of the Proveditore Generale and in military terms, the reshuffled institutions of territorial forces. During the French rule in Dalmatia, not much has been done for Dalmatian economic prosperity.\nThe first feature of the cultural revival of Dalmatia under the French administration was the launch of the bilingual weekly Il Regio Dalmata – Kraglski Dalmatin, whose first issue came out on 12 July 1806. Particular attention was devoted to education, as there were virtually no schools in Dalmatia when General Dandolo first arrived. French sought to build road connections with northern Croatia, and partly with Bosnia and Herzegovina. Construction of new roads was probably followed by military-strategic interests (with respect to the maritime blockade of the Adriatic by England and Russia), but they were also used for economic purposes. Many Dalmatians, especially lower clergymen with the Franciscans at their forehead, hated the French administration, seeing in them \"atheists and Jacobins\" because the French revoked numerous privileges of some Dalmatian municipalities and corporations trying to modernize Dalmatia.\nSecond Austrian Administration\nfeatures the  Lion of Saint Mark of the Republic of Venice. Zadar was the capital of the Kingdom of Dalmatia]]\nAlready in 1811, the British took over Vis from French, and in 1812 Lastovo, Korčula, Pelješac, Hvar, Cavtat, Dubrovnik islands and Split. Kotor was held by the Russians. After Napoleon's defeat in the 1813 Battle of Leipzig, the Austrian Empire took control of the Illyrian provinces. The takeover of Dalmatia was easily accomplished in the fall of 1813 by General Franjo Tomašić and his troops of 2,900 Croatian soldiers, because the people of Dalmatia, under the leadership of the clergy, especially the Franciscans, met them as liberators. After the surrender of Zadar (6 December), General Todor Milutinović went on a military campaign to take over Dubrovnik (succeeding on 27 January 1814) and Bay of Kotor, which he did by June 1814. Thus, territory stretching from Zrmanja river to the town of Budva was again subordinated to Vienna. This was confirmed at the 1815 Congress of Vienna.\nBaron Tomašić was appointed new Governor of Dalmatia, while the administration was taken over by the newly formed Provincial Government which was led by Tomašić himself. In order to integrate the area between Rab and Budva, the Viennese court has established a special territorial unit – Kingdom of Dalmatia. With the same intent, Pope Leo XII issued papal bull Locum Beati Petri by which he founded unified Zadar metropolis which was superior to all Dalmatian dioceses, including historical Archdioceses of Split and Dubrovnik.  In the period between 1816 and 1822, all new bodies of central and provincial government were founded in Zadar. The judicial reorganization was carried out as well. These administrative and judicial bodies worked until 1852/1854 and some until 1868, when the whole administration was reformed, when new judicial organs and provincial governing bodies were established. Such organization, with minor changes, remained in force until 1918. By the provisions of the 1861 February Patent, Diet of Dalmatia was founded. Austrians were bringing foreign civil servants to Dalmatia, mostly from Austria and northern Italy (then part of the Monarchy). In 1832, a new road that went through Velebit's Mali Alan mountain pass was opened. It was the only connection between Dalmatia and continental Croatia. The Austrian government increased the number of schools; by 1839 there were 50, and by 1846 around 150, attended by a third of school children. Croatian language in schools was almost an exception in comparison to Italian.\nItalian National Revival in Dalmatia\nwere the majority of the population, in orange the areas where Istrian Italians and Dalmatian Italians were the majority of the population. The boundaries of Venetian Dalmatia in 1797 are delimited with blue dots.]]\nThe Republic of Venice, between the 9th century and 1797, extended its dominion to Istria, the islands of Kvarner and Dalmatia, when it was conquered by Napoleon. Dalmatia was then aggregated to the Napoleonic Kingdom of Italy in 1805, and annexed to the Illyrian Provinces in 1809 (for some years also the Republic of Ragusa was included, since 1808).\nAfter the fall of Napoleon (1814) Istria, the islands of Kvarner and Dalmatia were annexed to the Austrian Empire. From the Middle Ages to the 19th century, Italian and Slavic communities in Istria and Dalmatia had lived peacefully side by side because they did not know the national identification, given that they generically defined themselves as \"Istrians\" and \"Dalmatians\", of \"Romance\" or \"Slavic\" culture. Later, many Istrian Italians and Dalmatian Italians looked with sympathy towards the Risorgimento movement that fought for the unification of Italy. The first events that involved the Dalmatian Italians in the unification of Italy were the revolutions of 1848, during which they took part in the constitution of the Republic of San Marco in Venice. The most notable Dalmatian Italians exponents who intervened were Niccolò Tommaseo and Federico Seismit-Doda.\nNiccolò Tommaseo\nAfter the Third Italian War of Independence (1866), when the Veneto and Friuli regions were ceded by the Austrians to the newly formed Kingdom Italy, Istria and Dalmatia remained part of the Austro-Hungarian Empire, together with other Italian-speaking areas on the eastern Adriatic. This triggered the gradual rise of Italian irredentism among many Italians in Istria, Kvarner and Dalmatia, who demanded the unification of the Julian March, Kvarner and Dalmatia with Italy. The Italians in Istria, Kvarner and Dalmatia supported the Italian Risorgimento; as a consequence, the Austrians saw the Italians as enemies and favored the Slav communities of Istria, Kvarner and Dalmatia, fostering the nascent nationalism of Slovenes and Croats. As Italian was the language of administration, education, the press, and the Austrian navy before 1859, people who wished to acquire higher social standing and separate from the Slav peasantry became Italians. In the years after 1866, Italians lost their privileges in Austria-Hungary, their assimilation of the Slavs came to an end, and they found themselves under growing pressure by other rising nations; with the rising Slav tide after 1890, italianized Slavs reverted to being Croats. Austrian rulers found use of the racial antagonism and financed Slav schools and promoted Croatian as the official language, and many Italians chose voluntary exile. During the meeting of the Council of Ministers on 12 November 1866, Emperor Franz Joseph I of Austria outlined a wide-ranging project aimed at the Germanization or Slavization of the areas of the empire with an Italian presence:\n}}\nCritics such as Croatian historian Duško Večerina alleged that these evaluations were not conducted by modern scientific standards and that they took spoken language as the criterion, rather than blood, origin and ethnicity. They pointed out that according to a report by Imperial court councillor Joseph Fölch in 1827, the Italian language was spoken by noblemen and some citizens of middle and lower classes exclusively in the coastal cities of Zadar, Šibenik and Split. Since only around 20,000 people populated these towns and not all were Italian speakers, they claim that the real number was rather smaller, probably around seven percent of the total population, as is asserted by the Department of Historical Studies of the Croatian Academy of Sciences and Arts (HAZU).O broju Talijana/Talijanaša u Dalmaciji XIX. Stoljeća”, Zavod za povijesne znanosti HAZU u Zadru, 2002, UDK 949.75:329.7”19”Dalmacija 2002, p. 344(“Concerning the number of Italians/pro-Italians in Dalmatia in the 19th century”) See http://hrcak.srce.hr/index.php?show=clanak&id_clanak_jezik=18696\n]]\nItalian irredentists like Gabriele D'Annunzio, as well as prominent Italian scholars like Angelo Vivante, alleged that Fölch did not include the Dalmatian islands of Cres (Cherso), Lošinj (Lussino), Krk (Veglia), Vis (Lissa), Hvar (Lesina), Korcula (Curzola) and many other islands with significant Italian communities. They reasserted that the only official evidence about the Dalmatian population comes from the 1857 Austro-Hungarian census, which showed that in this year there were 369,310 indigenous Croatians and 45,000 Italians in Dalmatia, making Dalmatian Italians 10.8 percent of the total population of Dalmatia in the mid-19th century.\nTwo nationalist movements were born in Dalmatia, the Italian and the Slav. The political instances of the Dalmatian Italians were promoted to the Autonomist Party, founded in 1878 and dissolved in 1915: a prominent member was Antonio Bajamonti, who from 1860 to 1880 was mayor of Split. The party, which originally also had the favour of part of the Slavic population, gradually replaced an autonomous program for the region with an irredentist project for the region, given the hostility of the Austrian authorities and the disagreements with the Slavic element.\nIn 1889, the foundation of the Dante Alighieri Society, with the aim of protecting and promoting the Italian language, made it possible to give support to the initiatives for the preservation of the Italian-speaking linguistic element. In this period Roberto Ghiglianovich, as trustee of the company establishes the La Lega in Zadar and promoted the enhancement of Italian culture in the area. The same year the irredentist Luigi Ziliotto becomes mayor of Zara, a position he would hold until the outbreak of World War I, was accused of treason and declared forfeited by the Austrian authorities. The policy of collaboration with the local Serbs, inaugurated by Roberto Ghiglianovich and by Giovanni Avoscani, then allowed the Italians to conquer the municipal administration of Dubrovnik in 1899.\nThe Italian population in Dalmatia was concentrated in the major coastal cities. In the city of Split in 1890 there were 1,971 Dalmatian Italians (9% of the population), in Zadar 7,672 (27%), in Šibenik 1,090 (5%), in Kotor 646 (12%) and in Dubrovnik 356 (3%). In other Dalmatian localities, according to Austrian censuses, Italians experienced a sudden decrease: in the twenty years 1890-1910, in Rab they went from 225 to 151, in Vis from 352 to 92, in Pag from 787 to 23, completely disappearing in almost all inland locations.\nWhile Slavic-speakers made up 80-95% of the Dalmatia populace, only Italian language schools existed until 1848, and due to restrictive voting laws, the Italian-speaking aristocratic minority retained political control of Dalmatia.  Only after Austria liberalised elections in 1870, allowing more majority Slavs to vote, did Croatian parties gain control. Croatian finally became an official language in Dalmatia in 1883, along with Italian. Yet minority Italian-speakers continued to wield strong influence, since Austria favoured Italians for government work, thus in the Austrian capital of Dalmatia, Zara, the proportion of Italians continued to grow, making it the only Dalmatian city with an Italian majority.\nUntil 1909, both Italian and Croatian were recognized as official languages in Dalmatia. After 1909, Italian lost its official status, thus it could no longer be used in the public and administrative sphere.\nCroatian National Revival in Dalmatia\nFrench and Austrian rule greatly contributed to Croatian national awakening in Dalmatia, which was also influenced by the ideas of the Illyrian movement, active in the Kingdom of Croatia. In 1835, Božidar Petranović began printing Serbo-Dalmatian Magazine () in Zadar, while in 1844 Ante Kuzmanić launched Zora dalmatinska magazine (Dalmatian Dawn) and began working on the linguistic and national awareness of the Dalmatians, which was until then only encouraged by the clergy. Revolutionary 1848 initially created political division between the markists, who wanted to rebuild the Republic of St. Mark (Venice), and the monarchists, proponents of the Habsburg monarchy. As wealthy Italians had full control over cities and their assemblies due to the electoral system, proposals of the Croatian Kingdom's county and city assemblies to the \"Dalmatian brothers of the same blood and language\" for the unification of Dalmatia and Croatia, were rejected. Nevertheless, Croatian national movement was very strong. In response to the Autonomist Party's refusal to accept unification, vicars and inhabitants of the Dalmatian Hinterland sent a letter to the Croatian ban Josip Jelačić in which they stated that they were still seeking unification and that its opponents were in the great minority. In December 1848, Emperor Franz Joseph I appointed Jelačić Governor of Dalmatia. His appointment was opposed by the Split and Zadar municipalities (both governed by the Autonomist Party), while Croats, especially those in Dubrovnik, met Jelačić with great expectations that were later mostly not fulfilled. Jelačić's role remained largely ceremonial, and the Viennese court refused any discussion on the matter of unification. In 1851, ban Jelačić visited Kingdom, and was welcomed with special enthusiasm in Dobrota. In order to counter the opponents of unification (Italians in particular), Croats were establishing public libraries and cultural societies throughout Dalmatia, mostly under the \"Slavic\" name. Eventually, Government made the decision by which the Croatian language was taught as a second language in Dalmatian schools. However, there weren't many schools in which the Croatian language was being taught so that's why the Franciscans founded first Croatian gymnasium in 1854 in Sinj.\nConflict between People's and Autonomist parties\n, one of the most prominent advocators of unification of Dalmatia with the Kingdom of Croatia-Slavonia]]\nIn 1860, Emperor Franz Joseph I decided to renew the Empire's constitutional and political life so he convened an expanded Imperial Council. Representatives of the Kingdom of Croatia-Slavonia, Ambroz Vranyczany and Josip Juraj Strossmayer, raised the question of the unification of the Kingdoms of Croatia-Slavonia and Dalmatia. A representative of Dalmatia, Frane Borelli, stated that the Italians were indeed a minority in Dalmatia, but that he didn't believe it was the right time for unification. At the time, there were two opposing political parties in Dalmatia: Croatian nationalist liberal People's Party, led by Miho Klaić and Mihovil Pavlinović, and Italian nationalist conservative Autonomist Party, led by Antonio Bajamonti and Luigi Lapenno. Autonomist Party was supported by the Dalmatian Governor Lazar Mamula, the cities of Zadar and Split, some other smaller cities and municipalities, as well as the Viennese court that feared the weakening of Austria in relation to Croatia-Slavonia and Hungary if the unification happened. People's Party was supported by Stari Grad, Vrboska, Metković, Bol, Dubrovnik and Kotor. The main point of People's Party program was the unification of Dalmatia with Croatia-Slavonia and the introduction of Croatian language in the administration and education.\nOn the occasion of the convocation of the ''Ban's Conference'' in Zagreb in 1860, representatives from Dalmatia were invited to discuss unification, but the Autonomist Party, supported by Ante Mamula, obstructed initiative. Diet of Dalmatia was first convened in 1861. Autonomist Party held the majority of seats due to the unfair electoral system by which large landowners, clerks, and representatives of wealthy citizens, although accounting for only around 20% of the Dalmatian population, had a significant advantage. Diet refused unification of Dalmatia with Croatia-Slavonia. The Austro-Prussian War and Third Italian War of Independence resulted in the 1866 maritime Battle of Vis. After the Austro-Hungarian Compromise of 1867, which strengthened the division and unveiled the prospect of unification of Dalmatia with Croatia-Slavonia to a minimum, the People's Party returned to the political and cultural struggle to croatize Dalmatia, especially focusing on schools, wanting to introduce Croatian as a teaching language. Therefore, their aim was to win power in the municipalities, since the school curriculums were within the municipal scope. In 1862, they launched a weekly in Italian Il Nazionale in order to win over voters whose primary language was Italian. They later started publishing weekly in Croatian Narodni list (People's Gazette) as well. In 1869, Mihovil Pavlinović wrote Croatian political program -Hrvatska misao (Croatian Thought), in which he advocated the Croatian right to independence and the establishment of unified and constitutional Croatian state that would have included all \"historical Croatian territories\", including Dalmatia.\nIn October 1869, an armed revolt known as the Krivošije uprising occurred in the Bay of Kotor hinterland region of Krivošije. The uprising broke out after a decisive Prussian victory over the Austrian Empire in the 1866 Battle of Königgrätz, and the consequent introduction of mandatory conscription for the people from that region who were by then traditionally exempt from conscription. Due to conscription, sailors lost essential years they could have used for working at sea. People that lived in the mountains were disarmed so they lost the opportunity to go to Herzegovina to hunt small and large cattle. The formal peace accord, by which the conscription was abandoned, and people allowed to retain their weapons, was signed on 11 January 1870.\nMembers of the People's and Autonomist parties were increasingly clashing as tensions began to rise. On 31 July 1869, during the visit of the Italian ship on a hydrographic mission, a clash between Italian sailors and Croatian citizens of Šibenik broke out. 14 Italian sailors and a few Croats were seriously injured. This clash turned into a diplomatic conflict between the Kingdom of Italy and Austria-Hungary, known as the Monzambano Affair. In the meantime, the People's Party started getting better organized and slowly winning rural municipalities in the Dalmatian Hinterland and on the islands, which culminated in the 1870 election,  when it won the majority of seats in the Diet. On 15 February 1873 the Party won the first major city, Šibenik, where Ante Šupuk was elected mayor. In 1882, despite intimidation and violence by the Autonomist Party's paramilitary units, the People's Party Gajo Bulat defeated the Autonomist Party's Antonio Bajamonti, thus becoming the Mayor of Split. Shortly thereafter, the People's Party won the election in the Stari Grad and Trogir municipalities, while the Autonomist Party only governed Zadar. In 1883, Croatian was proclaimed the official language of the Diet of Dalmatia.\nAt the same time, the network of Croatian schools grew. In 1866, the ''Croatian Teachers' School'' () was opened in Arbanasi near Zadar. In 1883, there were about 300 primary, and 3 high schools (in Dubrovnik, Kotor and Split) in which the Croatian language was thought. In 1898, Croatian gymnasium was opened in Zadar.\nSerbo-Croatian split\nin Dubrovnik, 20 May 1893]]\nEver since Vuk Karadžić, Ilija Garašanin and Jovan Subotić started writing about Dalmatia as a Serbian land, and following the recognition of the Kingdom of Serbia as an independent state at the 1878 Congress of Berlin, the different interests of Croats and Serbs in Dalmatia became more evident. Serbs continuously started mentioning Dalmatia as a \"Serbian land\". After Croatia's enthusiasm with the Austro-Hungarian occupation of Bosnia and Herzegovina, which involved numerous Croatian soldiers from Dalmatia, many of whom had died, and the request for the unification of Bosnia-Herzegovina with Croatia-Slavonia, the conflict was inevitable. In 1879, Serbs from Bukovica voted for the Italian candidate of the Autonomist Party, instead of People's Party Mihovil Klaić. The People's Party called this the Bukovica betrayal. Shortly afterward, separate Croatian and Serbian parties were founded, but Croats still held a majority in the Diet of Dalmatia.\nIn 1891, Frano Supilo started publishing Crvena Hrvatska (Red Croatia), the journal in which he was writing against Serbian pretensions on Dalmatia and in favor of the unification of Dalmatia with Croatia. In 1893, on the occasion of the erection of a monument dedicated to Ivan Gundulić in Dubrovnik, there were great tensions between Croats and Serbs. Namely, many Croatian dignitaries, politicians, and artists came to Dubrovnik so the festivity turned into an exhibition of Croatian nationalism when people started chanting for Croatia, as opposed to the wishes of some of the people of Dubrovnik who were proponents of Serbian ideas, like Medo Pucić.\nWith the affirmation of the so-called New Direction Policy, Serbo-Croatian relations started getting better. This was confirmed by the signing of the Zadar Resolution on 25 February 1907. Dr. Lovro Monti stated: \"With Serbs, we can do a lot, without Serbs a little, and against Serbs nothing.\" In 1905, for the first time, a native of Dalmatia, Niko Nardelli (NS), was appointed Governor. In 1912, Italian was abolished in public offices and courts. However, the Austrian government still used Italian and German in its official correspondence.\nFirst World War\n, 1905]]\nDalmatia was a strategic region during World War I that both Italy and Serbia intended to seize from Austria-Hungary. Italy joined the Triple Entente Allies in 1915 upon agreeing to the Treaty of London that guaranteed Italy the right to annex a large portion of Dalmatia in exchange for Italy's participation on the Allied side.  Immediately upon the outbreak of the First World War, all organizations that the government considered close to Serbia or to the idea of the creation of a single state for all South Slavic peoples were forbidden. Many prominent politicians were persecuted and arrested while some emigrated. Until 1915, when the Kingdom of Italy joined the Entente Powers after the Treaty of London, there were no war operations on the Adriatic, but since then the maritime conflicts became frequent. Due to the Allied blockade of the Strait of Otranto, trade in the Adriatic almost completely stopped. The government recruited many ships for military purposes, while the civilian sailing has been almost completely suspended. Mandatory blackouts were imposed on the islands and in the ports due to the fear of bombing. A number of church bells were removed, melted and used for war purposes. Fighting was also taking place around Lastovo and the distant islands so artillery batteries were placed there. In 1917, French Air Force bombed Lastovo.\nIn Dalmatia, hunger and scarcity began to emerge, while at the same time Hungarian laws banned the export of foodstuff to the Austrian half of the Monarchy (which Dalmatia was part of) in the case of war. Dalmatia received food aid through the port of Trieste, but the amounts were inadequate, sometimes even completely useless, and often arriving too late (for example, supplies intended for 1917 arrived in 1918). Therefore, Franciscans and benefactors from Zagreb organized the action of sending Dalmatian children to Slavonia and Moslavina so they could have adequate nutrition. The war destroyed Dalmatian agriculture. At the end of the war, epidemics of the typhus, cholera, smallpox and Spanish influenza broke out, causing the death of many people.\nIn 1915, Croats made up 34% of Austro-Hungarian Navy personnel. Apart from the Navy, Dalmatians also fought in land units, namely in the 22nd Imperial Regiment, 23rd Zadar Imperial Home Guard Regiment, 37th Dubrovnik Imperial Regiment and the Dalmatian Mounted Rifles. Following the Italian announcement of war, Croats were mostly sent to fight on fronts against Italy because the government expected them to be motivated to fight against those who mistreated them in the past. As the war ceased, there were also cases of defection, and in February 1918 a rebellion of sailors in the Bay of Kotor broke out, the Cattaro Mutiny. In 1917, representatives of Dalmatia in Imperial Council headed by Vjekoslav Spinčić, Josip Smodlaka and Ivo Prodan, wrote the May Declaration, in which they presented a program of unification of all South Slavs within the Austria-Hungary that had to be divided into three equal parts: Austria, Hungary, and Croatia. At the end of the war, the National Council for Dalmatia was founded in Zadar and the unified National Organization for Dalmatia in Split. These bodies soon started to independently govern Dalmatia. In the last days of the Monarchy, General Stjepan Sarkotić managed to convince Hungarian Prime Minister Sándor Wekerle and Emperor Charles I. to support the unification of Dalmatia with Croatia, but that didn't happen until the collapse of the Monarchy in 1918. On 29 October 1918, when the Austro-Hungarian Parliament dismantled, the Croatian Parliament passed a decision by which Croatia-Slavonia terminated state-law relations with Austria-Hungary and, together with Dalmatia and town of Rijeka, joined State of Slovenes, Croats and Serbs.\nDalmatia was a strategic region during World War I that both Italy and Serbia intended to seize from Austria-Hungary. Italy joined the Triple Entente Allies in 1915 upon agreeing to the London Pact that guaranteed Italy the right to annex the northern of Dalmatia in exchange for Italy's participation on the Allied side. From 5 to 6 November 1918, Italian forces were reported to have reached Vis, Lastovo, Šibenik, and other localities on the Dalmatian coast. At the end of hostilities in November 1918, the Italian military had seized control of the entire portion of Dalmatia that had been guaranteed to Italy by the London Pact, and by 17 November, it had seized Fiume as well. In 1918, Admiral Enrico Millo declared himself the Italian governor of Dalmatia. The Italian nationalist Gabriele d'Annunzio supported the seizure of Dalmatia and proceeded to Zadar in an Italian warship in December 1918.\n(1915), i.e. Trentino-Alto Adige, the Julian March and Dalmatia (tan), and the Snežnik Plateau area (green). Dalmatia, after the WWI, however, was not assigned to Italy but to Yugoslavia]]\nThe ships of the Italian Royal Navy occupied the main Dalmatian ports, where they made contact with the headquarters of the , i.e. the local sections of the Italian political party expression of the dissident Italian fascist movement. Following the withdrawal of the Austrian army from Dalmatia, the Yugoslav National Council, which was formed in Zagreb awaiting the union of Croatia with Serbia, established a provisional government of Dalmatia which extended from Split to Zadar. In Zadar, the former mayor Luigi Ziliotto, who belonged to the Italian-Dalmatianist Autonomist Party, organized a local government that opposed the Slavic governorship, proclaiming the authority of the Fascio nazionale over the municipality of Zadar, investing it with the powers previously held by the Zadar municipal council dissolved in 1916.\nOn 31 October 1918, the Kingdom of Italy, with the consent of the Allies, militarily occupied Dalmatia, including many areas not promised by the London Pact but provided by the Armistice of Villa Giusti between the Kingdom of Italy and Austria-Hungary, which foresaw the end of the war and the surrender of the latter. On 4 November 1918, the Italian Royal Navy occupied the islands of Vis, Lastovo, Molat, and Korčula, where the Yugoslav national committees offered no armed resistance. Also on 4 November 1918, the ship that docked in Zadar was welcomed by Luigi Ziliotto, amidst the exultation of the Dalmatian Italians of the city. On the Yugoslav side, there were only diplomatic protests. In the following days the situation around Zadar changed, with the Yugoslavs starting to organize themselves militarily in the areas surrounding the city. The Italian military occupation of Šibenik, city not included in the London pact, was slightly more difficult, given the hostility of the Croatian population. The Italian Royal Navy then continued to occupy the Dalmatian coast, continuing southwards, arriving, on 9 November 1918, at Cape Planka on behalf of the Allies.\nAll the other Dalmatian islands were occupied during November. For example, among the largest, Hvar on 13 November, and Pag on 21 November. In Cres and Lošinj there was an enthusiastic welcome from the Italian Dalmatians who lived on the two islands. On 26 November, the Italian Royal Navy also occupied Krk and Rab, islands not included in the London Pact. The main pro-Yugoslav element that opposed the Italian occupation was the local clergy, so much so that the Italian authorities decided to expel the bishop of Krk, Anton Mahnič, who established and led the Croatian Catholic Movement.\n, the first governor of Dalmatia]]\nOnce all of Dalmatia had been occupied, the Italian government appointed Vice Admiral of the Italian Royal Navy Enrico Millo as its governor, who had already held political roles, given that he was also Minister of the Navy and had always supported the annexation of Dalmatia to Italy. Initially the capital of the Governorate of Dalmatia was established in Šibenik, a political decision which signified the intention of the Kingdom of Italy to retain control of the whole of Dalmatia. In the spring of 1919, the capital was moved to Zadar. As his first action, Millo officially removed civil and political authority from the local Yugoslavian national committees. At the same time he allowed pro-Yugoslav representatives to remain in the Dalmatian Provincial Diet and in the Dalmatian Court of Appeal. The former members of the pro-Italian Autonomist Party merged massively into the Fasci nazionali, and began to cover political roles and some of them were hired by public institutions. The former officials of Austria-Hungary, although they were contacted by the Italian administration, did not want to hold political and civil roles for fear of reprisal in the event that Dalmatia was annexed to Yugoslavia.\nThe Dalmatian hinterland was not occupied by any army for the entire month of November, even though it was de facto administered by the Yugoslav national committees dependent on Zagreb. The Italian Armed Forces, after having consolidated their control over the ports and islands, and with the arrival of reinforcements from the homeland, began to penetrate the hinterland of the Dalmatia, occupying Vodice (on 3 December 1918), and Scardona/Skradin (on 5 December 1918). The case of the occupation of Tenin/Knin was much more complex, given the scarce presence of Dalmatian Italians, while the Serbian presence was conspicuous. Enrico Millo ordered the Serbian army, which had arrived in the meantime, to withdraw, given that they were territories granted to the Kingdom of Italy by the Armistice of Villa Giusti. After repeated armed clashes between the two armies, Italian troops occupied Knin on 1 January 1919.\nEnrico Millo tried to gain the political consensus of the Slavic Dalmatians by improving living conditions, creating health services, distributing food, and stimulating the agricultural economy by decreeing a ban on the import of oil and wine from Italy. More generally, to encourage the growth of the Dalmatian economy, he established a favorable exchange rate between the former Austrian crown and the Italian lira for the local economy. The Italian authorities also left freedom of association to the Slavs, allowing the establishment of political parties and cultural associations, and granting freedom of the press even to pro-Yugoslav newspapers, without prejudice to the fact that censorship was frequent. In Zadar, Šibenik, Hvar and Krk, popular demonstrations against the Italian occupation and in favor of the union of Dalmatia with Yugoslavia were frequent, which were organized by the aforementioned Catholic and Orthodox clergy. On the other hand, the Italian Fasci nazionali organized demonstrations in favor of the annexation of Dalmatia to the Kingdom of Italy. To try to avoid anti-Italian protests, Millo decreed expulsions from the Governorate of Dalmatia and ordered the confinement of civilians in special facilities without trial, causing official criticism and protests from the United States.\nPolitical opposition to the Italian administration gradually waned, also due to the political evolution of the Kingdom of Yugoslavia, within which Serbian excessive power was increasingly evident. In fact, already at the beginning of 1919, in Yugoslavia, there was a decisive repression against the Croatian peasant movement of the Radic brothers and against the Yugoslav Social-Democratic Party. In this situation, the Croatian Catholic peasants, who were previously pro-Yugoslav, began to be indifferent to the Italian occupation. Enrico Millo, consequently, changed his government's political strategy. In fact, he began to present himself as a guarantor of social order and as a defender of Dalmatian Catholics against the Kingdom of Yugoslavia. As a consequence, anti-Italian sentiment continued to wane. In fact, it remained limitedly active in Zadar, Šibenik and Knin, as well as in Krk and Hvar.\nHowever, in spite of the guarantees of the London Pact to Italy of a large portion of Dalmatia and Italian military occupation of claimed territories of Dalmatia (for the presence of Dalmatian Italians), both the peace settlement negotiations of 1919 to 1920 and the Fourteen Points of Woodrow Wilson, who advocated self-determination, took precedence, with Italy being permitted to annex only Zadar from Dalmatia, with the rest of Dalmatia being part of Yugoslavia. Enraged Italian nationalists considered the decision to be a betrayal of the promises of the London Pact, so this outcome was denounced as a \"mutilated victory\". The rhetoric of \"mutilated victory\" was adopted by Benito Mussolini, led to the rise of Italian fascism, and became a key point in the propaganda of Fascist Italy. Historians regard \"mutilated victory\" as a \"political myth\", used by fascists to fuel Italian imperialism and obscure the successes of liberal Italy in the aftermath of World War I.\nDemographic history\n1818–1857\nAccording to M. Lorković, the total population of Dalmatia was 297,912 in 1818; 326,739 in 1825; 338,599 in 1830; 390,381 in 1840; and 393,715 in 1850. According to Austrian censuses, the Dalmatian Italians formed 12.5% of the population in 1865. Based on the 1857 census, the Kingdom of Dalmatia had 415,628 inhabitants. According to an analysis of the 1857 census, 318,500 (76.5%) inhabitants were Croats, 77,500 (18.5%) were Serbs, and ca. 20,000 were Italian-speakers (5%). The percentage of Dalmatian Serbs had been 19.9% in the 1830–50 period. In the cities, the inhabitants were 71% Croat, 22% Italian and 7% Serb. There were 745 Serbs in Kotor; in all other cities there were fewer than 400. The number of Serbs in Dalmatia fell; however, in the north it rose. Among the Orthodox, there was one priest for every 400 people, while among the Catholics, there was one priest for every 330 people.\n1880\nThe 1880 Austrian census, recorded the following ethnic groups in the Kingdom:\n* 371,565 Croats\n* 78,714 Serbs\n* 27,305 Italians\n1900\nThe 1900 Austrian census:\n;Religion\n* 496,966 Catholics\n* 96,279 Eastern Orthodox\n* 539 others\n;Language\n* Serbo-Croatian: 565,276 (95,2%)\n* Italian: 15,279 (2,6%)\n* German: 2,306 (0,4%)\n* Total: 593,784\n1910\nAccording to the official 1910 Austrian census, population by religion and mother language was:\n;Religion\n* 539,057 Catholics\n* 105,332 Eastern Orthodox\n* 1,257 others\n;Language\n* Serbo-Croatian: 610,649\n* Italian: 18,028\n* German: 3,081\n* Others: 3,077\nCities\nThe major cities were (1900):\n* Zadar, the capital, with 13,016 inhabitants\n* Split (18,547)\n* Šibenik (10,072)\n* Dubrovnik (8,437)\nAdministrative subdivisions\n(the Bay of Kotor area is in Montenegro)]]\nFrom 1822 to 1868 the Kingdom of Dalmatia was administratively divided into four circles (;  or ;  or ): Zara (Zadar), Spalato (Split), Ragusa (Dubrovnik) and Cattaro (Kotor). These were subdivided into smaller districts (, ; ), each comprised municipalities (, , ). In 1868 the circles were abolished and Dalmatia was divided into 13 larger (administrative) districts ( or ;  or ;  or ) whose capitals were (1880):\n* Benkovac\n* Dubrovnik\n* Hvar\n* Imotski\n* Knin\n* Korčula\n* Kotor\n* Makarska\n* Metković\n* Sinj\n* Split\n* Šibenik\n* Zadar\nDistricts, as governmental units with the government-appointed prefect (, , ), were subdivided into judicial districts (, ) and these into municipalities (, ) as local authorities with the elected municipal council (, ) and the mayor (, ) elected by the council.\nReligion\nThe Roman Catholic archbishop had his seat in Zadar, while the diocese of Kotor, diocese of Hvar, diocese of Dubrovnik, diocese of Šibenik and diocese of Split were bishoprics. At the head of the Orthodox community stood the bishop of Zadar.\nThe use of Croatian-Slavonic liturgies written in the Glagolitic alphabet, a very ancient privilege of the Roman Catholics in Dalmatia and Croatia, caused much controversy during the first years of the 20th century. There was considerable danger that the Latin liturgies would be altogether superseded by the Glagolitic, especially among the northern islands and in rural communes, where the Slavonic element is all-powerful. In 1904, the Vatican forbade the use of Glagolitic at the festival of SS. Cyril and Methodius, as likely to impair the unity of Catholicism. A few years previously the Slavonic archbishop Rajcevic of Zara, in discussing the \"Glagolitic controversy\", had denounced the movement as \"an innovation introduced by Panslavism to make it easy for the Catholic clergy, after any great revolution in the Balkan States, to break with Latin Rome.\"\nGovernors\nHead of the Austrian imperial administration in Dalmatia was Imperial-Royal Provincial Governor (Italian: I. R.  Governatore Provinciale, Croatian: c. k. Guverner) appointed by the emperor. From 1852 he was known as Imperial-Royal Lieutenant (Italian: I. R. Luogotenente, Croatian: c. k. Namjesnik).\n* Franjo Tomašić (1815–1831)\n* Wenzeslau Lilienberg Water (1831–1841)\n* Ivan August Turszky (1841–1848)\n* Ludwig von Welden (1848)\n* Josip Jelačić (1848–1859)\n* Lazar Mamula (1859–1865)\n* Franz Philippovich, Freiherr von Philippsberg (1865–1868)\n* Johann Wagner (1868–1869)\n* Gottfried Auersperg (1869)\n* Julius Fluk von Leidenkron (1869–1870)\n* Gavrilo Rodić (1870–1881)\n* Stjepan Jovanović (1882–1885)\n* Ludovik Cornaro (1885–1886)\n* Dragutin Blažeković (1886–1890)\n* Emil David (1890–1902)\n* Erasmus Handel (1902–1905)\n* Nicola Nardelli (1905–1911)\n* Mario Attems (1911–1918)\nMilitary\nMilitary units in the kingdom at the start of the First World War:\n* Common Army\n** 22nd (Dalmatian) Infantry Regiment \"Graf von Lacy\" (garrison: Spalato/Split)\n* Imperial-Royal Landwehr\n** Imperial-Royal Mounted Dalmatian State Rifle Division (garrison: Sinj)\n** 23rd Imperial-Royal Landwehr Infantry Regiment (garrison: Zara/Zadar)\n** 37th Imperial-Royal Landwehr Infantry Regiment (garrison: Gravosa/Gruž)\nPolitics\nDalmatian Parliament\nThe Kingdom of Dalmatia held elections to the Parliament of Dalmatia in 1861, 1864, 1867, 1870, 1876, 1883, 1889, 1895, 1901, 1908.\nReichsrat\n; 1907\nIn the 1907 elections, Dalmatia elected the following representatives to the lower chamber of the Reichsrat (Imperial Council)\n* Croatian Party\n** Ante Dulibić\n** Vicko Ivčević\n** Frane Ivanišević\n** Ante Tresić Pavičić\n** Ante Vuković\n** Juraj Biankini\n* Party of Rights\n** Ivo Prodan\n** Josip Virgil Perić\n* Serb People's Party\n** Dušan Baljak\n** Miho Bjeladinović\n* Independent\n** Frane Bulić\n; 1911\nIn the 1911 elections, Dalmatia elected the following representatives:\n* Croatian Party\n** Vicko Ivčević\n** Pero Čingrija\n** Ante Tresić Pavičić\n** Juraj Biankini\n* Party of Rights\n** Ivo Prodan\n** Ante Dulibić\n** Ante Sesardić\n** Josip Virgil Perić\n* Serb People's Party\n** Dušan Baljak\n** Gjuro Vukotić\n* Croatian Popular Progressive Party\n** Josip Smodlaka\nSee also\n* Dalmatia\n* History of Croatia\n* History of Dalmatia\n* Kingdom of Croatia (Habsburg)\n* Kingdom of Hungary (Habsburg)\n* Kingdom of Croatia-Slavonia\n* Timeline of Croatian history\n* Diet of Dalmatia\nReferences\nSources\n*\n*\n*\nFurther reading\n*\n*\nExternal links\n*\n* [http://www.deutsche-schutzgebiete.de/kuk_dalmatien.htm German protectorate]"
    }
  ]
}