{
  "content": [
    {
      "type": "text",
      "text": "# Kings of Colosseum (2021)\n\nKings of Colosseum (2021) was a special episode of MLW Fusion which aired on January 6, 2021 on Fubo Sports Network and MLW's YouTube channel. It was the second event under the Kings of Colosseum chronology.\nThree professional wrestling matches were contested at the event. In the main event, Alexander Hammerstone defended the National Openweight Championship against Mads Krügger, which ended in a double count-out, resulting in Hammerstone retaining the title. On the undercard, The Von Erichs retained the World Tag Team Championship against The Dirty Blondes in a Bunkhouse match and the debuting Lio Rush defeated Myron Reed to capture the World Middleweight Championship.\nProduction\nBackground\nThe first Kings of Colosseum event was held on July 6, 2019 and aired live as a special episode of MLW's weekly television series, Fusion. On December 3, 2020, MLW owner Court Bauer announced in a press conference that the next edition of Kings of Colosseum would be a major event for MLW. The event was original intended to air on pay-per-view, the second PPV event in the promotion's history after Saturday Night SuperFight in 2019. Instead, the event was announced to have become a free television special on December 8.\nStorylines\nThe card consisted of matches that resulted from scripted storylines, where wrestlers portrayed villains, heroes, or less distinguishable characters in scripted events that built tension and culminated in a wrestling match or series of matches, with results predetermined by MLW's writers. Storylines were played out on MLW's television program Fusion, and its web series spinoff, Pulp Fusion, produced during the 2020 COVID-19 pandemic.\nIn November 2020, multiple sources reported that Lio Rush would be making his MLW debut in the near future as part of the middleweight division, which was confirmed by MLW on November 4. On the November 18 episode of Fusion, Myron Reed successfully defended the World Middleweight Championship against Brian Pillman Jr. and then challenged Rush to a match for the title to cement his legacy as the \"young GOAT\". Reed later challenged Rush to a match for the title on the December 23 episode of Fusion. However, on the December 9 episode of Fusion, Rush refused to wrestle on Reed's terms and instead accepted the challenge for the title at Kings of Colosseum.\nOn the November 18 episode of Fusion, the National Openweight Champion Alexander Hammerstone defeated enhancement talent Jason Dugan and demanded a title shot for the World Heavyweight Championship against Jacob Fatu, as he was ranked #1 in MLW by Pro Wrestling Illustrated. However, he was instead attacked by the debuting Mads Krügger, the newest member of Fatu's faction Contra Unit. After being injured, Hammerstone returned on the December 16 episode of Fusion, where he engaged in a backstage brawl with Krügger. It was later announced on the same episode that Hammerstone would defend the National Openweight Championship against Krügger at Kings of Colosseum.\nDuring Contra Unit's attack on MLW at the end of the MLW/AAA Super Series on the May 10, 2020 episode of Fusion, they would take out Injustice member Kotto Brazil. Since then, fellow Injustice member Jordan Oliver, now a newly-minted heavyweight, has been calling out Contra, specifically World Heavyweight Champion Jacob Fatu and Simon Gotch. On the August 6 episode of Pulp Fusion, Oliver was jumped by Gotch and put out with a chokehold. On the December 9 episode of Fusion, Oliver gained a measure of revenge, jumping Gotch during a schmoz ending to Gotch and Fatu's MLW World Tag Team Championship match against Marshall and Ross Von Erich. On December 22, MLW announced on their website that Gotch and Oliver will face at Kings of Colosseum in a Grudge Match.\nA report was put on MLW's website stating that Col. Robert Parker has attempted to recruit MLW World Tag Team Champions Marshall and Ross Von Erich to the Stud Stable. A week later, Parker reportedly sent his girlfriend/southern debutante Aria Blake to Kauai, Hawaii as a \"hospitality envoy\" to the Von Erichs. Unfortunately for Parker, his recruitment attempts all failed, with Marshall and Ross's father Kevin Von Erich calling Parker a \"snake oil salesman\". On the December 23 edition of Fusion, The Dirty Blondes (Leo Brien and Michael Patrick), who's resigning to MLW and the Stud Stable were announced a month prior, made their in-ring return; with Blake as their stand-in valet. Later in the night, it was announced that the Von Erichs will defend the Tag Team Championships against the Dirty Blondes at Kings Of Colosseum in a Texas Tornado match.\nEvent\nPreliminary matches\n{|class=wikitable style=\"font-size:90%; margin: 0.5em 0 0.5em 1em; float: right; clear: right;\"\n|+ Other on-screen personnel\n!|Role:\n!|Name:\n|-\n|rowspan=2|English commentators\n|Rich Bocchini\n|-\n|Jared St. Laurent\n|-\n|rowspan=1|Ring announcer\n|Tim Barr\n|-\n|rowspan=1|Interviewer\n|Alicia Atout\n|}\nIn the opening match, the Von Erichs defended the World Tag Team Championship against The Dirty Blondes in a Bunkhouse match. The brawl spilled outside the building and with Aria Blake getting involved. The Von Erichs put away Michael Patrick with a claw slam/back drop suplex combo to win.\nSimon Gotch and Jordan Oliver were supposed to go on next, but it was reported that Gotch was MIA from the event. The match was eventually postponed, but later in the night, Oliver and Myron Reed were jumped by Gotch and Jacob Fatu, as well as new Contra Unit member Daivari.\nOpera Cup winner Tom Lawlor appeared sober as he celebrated his victory in the tournament, and verbally announcing the creation of a new event: Filthy Island.\nThe next match was part of a double main event, as Myron Reed defended the World Middleweight Championship against the debuting Lio Rush. As always, Reed was wearing a Kevlar chest protector to the ring. A fast-paced match, Rush had the advantage early, using his superior speed to evade Reed's offense. After more back and forth attacks between champion and challenger, Reed took control, later hitting Rush with an inside-out cutter over the ring ropes and onto the floor. However, when Reed went for his No Cap Splash finisher, Rush moved out of the way. This allowed Rush to hit a low sitting springboard stunner, followed by the Final Hour to secure victory and the title.\nPromociones Dorado's lead empresaria Salina de la Renta interrupted Rich Bocchini and Saint Laurent to announce that she would be the executive producer for the January 16 episode of Fusion.\nMain event match\nThe last match and second part of the double main event featured MLW's #1 ranked wrestler Alexander Hammerstone defending the National Openweight Championship against \"The Back Hand of Contra\" Mads Krügger. Brawling before the bell rings and with Hammerstone smacking Krügger with the title, the match begins fairly even. Hammerstone sing his agility, while Krügger used his height and power, even blocking Hammerstone's Nightmare Pendulum. After switching shots in the corner, with Krügger repeatedly shoving the referee off, the combatants spilled out to ringside as the feed began to cut out. They fought so long that they didn't answer the 20-Count, resulting in a double count-out.\nAftermath\nMatches were announced for the January 16 episode of Fusion in which The Von Erichs would be defending the World Tag Team Championship against Los Parks (L.A. Park and El Hijo de L.A. Park) in a Texas Tornado match. L.A. Park, de la Renta's former charge, threatened to retire and return with his sons to Mexico if they would not get title shots, but de la Renta cut a deal with Park. If the Parks got their match, they would rejoin Promociones Dorado. Tom Lawlor, the Von Erichs' old rival, would serve as special guest referee, giving closure to the referee shirt he received on Christmas from \"SDL\". Also in two weeks, Jacob Fatu would put his MLW World Heavyweight Championship on the line against Opera Cup semi-finalist A. C. H.\nAn article on MLW's website reported that Col. Robert Parker demanded the league review the tag team championship match. He believed the referee was at fault for the Dirty Blondes failure in procuring the titles when the match spilled outside the building, and that the Von Erichs deliberately did so to injure their opponents. Wanting a resolution, he asked the match be thrown out and let the two teams compete in a \"Sudden Death\" title match. MLW denied any wrongdoing by the referee and the champions, and referred Parker to the Florida State Athletic Commission, who were responsible for sanctioning matches and assigning officials.\nResults\n|match1= The Von Erichs (Marshall and Ross Von Erich) (c) defeated The Dirty Blondes (Leo Brien and Michael Patrick) (with Aria Blake)\n|stip1= Bunkhouse match for the MLW World Tag Team Championship\n|time1= 3:53\n|match2= Lio Rush defeated Myron Reed (c) (with Jordan Oliver)\n|stip2= Singles match for the MLW World Middleweight Championship\n|time2= 14:19\n|match3= Alexander Hammerstone (c) vs. Mads Krügger ended in a double countout\n|stip3= Singles match for the MLW National Openweight Championship\n|time3= 6:20\n}}\nReferences\nExternal links\n*[https://mlw.com Major League Wrestling official website]"
    }
  ]
}