{
  "content": [
    {
      "type": "text",
      "text": "# King Kobra III\n\nKing Kobra III, released in 1988 on New Renaissance Records, was the first and last album by the Edwards, Michael-Phillips, Northrup, Hart and Appice line-up of King Kobra. After the demise of the original line-up, remaining members Carmine Appice and David Michael-Phillips teamed up with Johnny Edwards, Jeff Northrup and Larry Hart, all 3 members of the Sacramento, CA band Northrup at the time.\nThe album featured a strong selection of 1980s-style mainstream metal. However, a lack of album sales resulted in the dissolution of the band. Bassist Johnny Rod, who appeared on the first two albums as bassist, does not play here. However, he does contribute backing vocals.\nThe model posing on the album cover is Carmine's then wife, Sarah Appice, who also makes a cameo appearance in the \"Take It Off\" promotional video.\nTrack listing\n#\"Mean Street Machine\" (David Michael-Phillips, Carmine Appice, Bryson Jones) - 4:26\n#\"Take It Off\" (Phillips, Mark Free, Appice) - 3:58\n#\"Walls of Silence\" (Jeff Northrup) - 5:23\n#\"Legends Never Die\" (Gene Simmons, Micki Free, Adam Mitchell) - 5:04\n#\"Redline\" (Phillips, Appice, Jones) - 4:07\n#\"Burning in Her Fire\" (Northrup) - 3:33\n#\"Perfect Crime\" (Northrup, Johnny Edwards, Glenn Hicks, Larry Hart) - 3:56\n#\"It's My Life\" (Simmons, Paul Stanley) - 3:40\n#\"#1\" (Phillips, Appice, Jones) - 5:08\nPersonnel\n;Band members\n*Johnny 'Boy' Edwards – vocals\n*David Michael-Phillips – lead and rhythm guitars, acoustic and slide guitars, bass, backing vocals, co-producer\n*Jeff Northrup – lead and rhythm guitars, backing vocals\n*Larry Hart – bass guitar\n*Carmine Appice – drums, backing vocals, producer\n;Additional musicians\n*Johnny Rod, Steve Sacchi, Mark Olsen, Bryson Jones, Peter Criss, Sarah Appice, Bob Spinella, Dave Flynn - backing vocals\n;Production\n*Alex Woltman - engineer, co-producer\n*Elliot Solomon - engineer and co-producer on \"Take It Off\"\n*Mark Paladino, Duane Baron, Rick Clifford, Angelo Arcuri, Bret Newman - additional engineering\nReferences\nCatalogue: (Vinyl) New Renaissance NRR-26; (CD) New Renaissance NRCD-26"
    }
  ]
}