{
  "content": [
    {
      "type": "text",
      "text": "# Kingsland Homestead\n\n| locmapin                 = New York City#New York#USA\n| built                    = 1774\n| architecture             = Colonial\n| added                    = May 31, 1972\n| area                     = less than one acre\n| refnum                   = 72000905\n| designated_other2_name   = New York City Landmark\n| designated_other2_date   = October 14, 1965\n| designated_other2_abbr   = NYCL\n| designated_other2_link   = New York City Landmarks Preservation Commission\n| designated_other2_number = 0005\n| designated_other2_color  = #ffe978\n| website                  =\n}}\nKingsland Homestead is an 18th-century house located in Flushing, Queens, New York City. It is the home of the remains of The Weeping Beech, a landmark weeping beech tree, believed to have been planted in 1847. The homestead is also close to the 17th-century Bowne House, the location of the first Quaker meeting place in New Amsterdam. The homestead is operated by the Queens Historical Society, whose quarters are inside; the homestead is open to the public as a museum. The Kingsland Homestead is a member of the Historic House Trust, and is both a New York City designated landmark and a National Register of Historic Places listing.\nHistory\nKingsland was built by Charles Doughty in approximately 1785 and the name \"Kingsland\" is believed to derive from Doughty's son-in-law, British sea captain Joseph King, who bought the home in 1801. Due to encroaching development from the proposed extension of the New York City Subway's Flushing Line in 1923, it was moved to the site of a stable, also built by King. The house was threatened again in 1965, by the construction of the Murray Hill Shopping Center, but the community was able to save the house and in that same year it was one of the first buildings in the city to be declared a landmark by the Landmarks Preservation Commission.\nWhen further construction threatened the house in 1968, the then three-year-old Kingsland Preservation Committee (now the Queens Historical Society) arranged for the transfer of the house to its present location. After significant delays, the Homestead was officially dedicated as a museum in March 1973. In October 1996 a $330,000 renovation that completely restored the house and included the addition of track lighting and a sprinkler system to protect the house was completed. Further structural work was required in 1999.\nExhibits\nThe Homestead has been interpreted to the Victorian era, although it has included a wide range of exhibits since its dedication as a museum. A World War II exhibit focused on events  in Queens during the war, including newspaper clippings and advertisements. There was also an exhibit on slavery and its impact in Queens and on Long Island.\nWeeping Beech\nWithin the main park that houses the Homestead is the  Weeping Beech Park, once dominated by a  weeping beech tree. The beech tree, designated as a city landmark in 1966, was one of only two living landmarks in New York City. It is believed to have originated in Belgium, transported to the U.S. by horticulturalist Samuel Parsons, and is also believed to be the source of all weeping beeches in the United States.\nThe tree survived for 151 years before succumbing in 1997. A funeral was held for the tree in December 1998. The remains of the tree were given to artists to use for sculptures and benches along a heritage trail in downtown Flushing, save for a ten-foot section that would remain in the park as a memorial,  Seven direct descendants remain in the park, shadowing the Homestead.\nSee also\n*List of New York City Designated Landmarks in Queens\n*National Register of Historic Places listings in Queens\nReferences\nExternal links\n*\n*"
    }
  ]
}