{
  "content": [
    {
      "type": "text",
      "text": "# King's Weigh House\n\nThe '''King's Weigh House''' was  the name of a Congregational church congregation in London, United Kingdom. Its Victorian church building in Mayfair is now the Ukrainian Catholic Cathedral of the Holy Family in Exile.\nHistory\nA building called the \"King's Weyhows\" is mentioned in 1460, where two men lived or worked as porters.\nThe church was formed around 1695 when Thomas Reynolds was called as minister. In 1697 the congregation built a meeting house over the King's Weigh House in Little Eastcheap, and from this home the church took its name. The King's Weigh House was where \"Merchant Strangers\" were required to have their goods weighed so that customs duties could be assessed. It was rebuilt after the Fire of London.\nReynolds ministered until 1727, then James Wood, 1727–42; William Langford, 1742–75; Samuel Wilton, 1776–1778; and John Clayton 1778–1826. Thomas Binney, 1829–69, was one of the notable Congregational ministers of the nineteenth century. During Binney's time the Weigh House site was required for widening the approaches to London Bridge. In 1833-4 a new building in Fish Street Hill designed by William Tate and seating 1000 people was erected. Prominent members during this period included Samuel Morley and George Williams who founded the YMCA in 1844.\nThe building of the King's Weigh House today serves as the Ukrainian Catholic Cathedral of the Holy Family in Exile.\nBinney was succeeded by William Braden, then Alexander Sandison, 1880–1901. In 1882 the church site was compulsorily purchased by the Metropolitan Railway. By now many members lived in the suburbs and there was less need to relocate in the City of London. The Duke of Westminster offered a site in Mayfair, part of which was occupied by a small Congregational church in Robert [now Weigh House] Street. The offer was accepted and in 1891 the new building in Duke Street, designed by Alfred Waterhouse was opened.\nThe church was of red brick with buff terracotta dressings. It has an oval nave and a tower in the southwest corner, built in a Romanesque style. The builders were John Shillitoe & Son, the structural steel work was by Andrew Handyside and Company, heating and ventilation was by G. N. Haden, the ceramic tiles were manufactured by Craven Dunnill, faience tiling was by Burmantofts, and decorative ironwork by Hart Son Peard & Co.. The cost was £26,495.\nSandison was succeeded by John Hunter, 1901–4, F.A. Russell, then E.W. Lewis. The next minister William E. Orchard ministered from 1914. During his pastorate the style of worship became increasing Catholic, and after Orchard's resignation in 1932, he joined the Catholic Church. Notable is the fact that in 1917 Claud and Constance Coltman were ordained as assistant ministers, the latter being a member of the church before training at Mansfield College, Oxford and one of the first women to be ordained in a mainstream English denomination.\nThe next years were ones of decline. On 20 October 1940 a bomb fell on the chancel during a communion service, killing the minister's wife and injuring one other. The building was requisitioned as a fire watching centre and rest centre. In 1945 22 members decided to revive the work and appointed W.J.E. Jeffery as minister, with assistance from Claud and Constance Coltman who returned in 1946. After war damage reinstatement the building was rededicated in 1953.\nIn 1956 Daniel Jenkins was appointed as  minister with the aim of providing a distinctive mission within central London but the work did not develop as hoped. In 1962 Jenkins accepted the invitation to become the first chaplain of the University of Sussex. Roger Tomes was appointed as minister with aim of guiding the small Weigh House congregation towards union with another church. Following friendly discussions with Whitefield Memorial Church, Tottenham Court Road, separate services at the Weigh House ended in July 1965.\nIn March 1966 the decision was taken to formally disband the church and dispose of the building. It was bought by the Ukrainian Catholic community in 1967 and is now the Ukrainian Catholic Cathedral of the Holy Family in Exile. Waterhouse's building was Grade II* listed in 1970.\nArchitectural history\nEastcheap building\n16 Eastcheap is now occupied by Citibank. A plaque on the frontage commemorates the previous existence of the church.\nFish Street Hill building\nThis was the church from 1834 to 1888. The building was acquired by compulsory purchase by the railway company. It is now an exit of the Monument Underground station.\nBinney Street building\nSee also\n*List of ecclesiastical works by Alfred Waterhouse\nReferences\n*\n*[https://web.archive.org/web/20070928133018/http://www.motco.com/Harben/5719.htm History of the Weigh House church]"
    }
  ]
}