{
  "content": [
    {
      "type": "text",
      "text": "# Kingston Township, Delaware County, Ohio\n\n|population_total         = 2359\n|population_density_km2   = auto\n|population_density_sq_mi =\n|timezone                 = Eastern (EST)\n|utc_offset               = -5\n|timezone_DST             = EDT\n|utc_offset_DST           = -4\n|elevation_footnotes      =\n|elevation_m              = 306\n|elevation_ft             = 1004\n|coordinates              =\n|postal_code_type         =\n|postal_code              =\n|area_code                =\n|blank_name               = FIPS code\n|blank_info               = 39-40362\n|blank1_name              = GNIS feature ID\n|blank1_info              = 1086049\n|website                  =\n|footnotes                =\n}}\nKingston Township is one of the eighteen townships of Delaware County, Ohio, United States. The population at the 2020 census was 2,359.\nGeography\nLocated in the northeastern part of the county, it borders the following townships:\n*Peru Township, Morrow County - north\n*Bennington Township, Morrow County - northeast corner\n*Porter Township - east\n*Trenton Township - southeast corner\n*Berkshire Township - south\n*Berlin Township - southwest corner\n*Brown Township - west\n*Oxford Township - northwest corner\nNo municipalities are located in Kingston Township\nName and history\nIt is the only Kingston Township statewide.\nKingston Township was established in 1813.\nMarilyn Cryder of the Delaware County Historical Society sets the tone for Kingston Township in its early era: “[Native American] tribes were frequent visitors right up to 1830. The area was covered with forests. Settlers…coming into the territory established their homes in natural clearings and had to immediately set about clearing the timber. The first houses were one room log cabins and it was many years before substantial ones were built.\"\nCryder notes that in 1842 Ohio Wesleyan University was established in Delaware City twenty miles from Kilbourne and with it came more traffic and eventually the railroad.  The rail was supposed to have gone through Kingston Township. A 1907 map of Ohio Railroads shows the rail traveling along Kilbourne Rd. The railroad was never completed, and never made it to Kingston Township.\nGovernment\nThe township is governed by a three-member board of trustees, who are elected in November of odd-numbered years to a four-year term beginning on the following January 1. Two are elected in the year after the presidential election and one is elected in the year before it. There is also an elected township fiscal officer, who serves a four-year term beginning on April 1 of the year after the election, which is held in November of the year before the presidential election. Vacancies in the fiscal officership or on the board of trustees are filled by the remaining trustees.\nPublic services\nFire protection in Kingston Township is the responsibility of the Porter-Kingston Fire District, and emergency medical services are provided by the Delaware County EMS.\nReferences\nExternal links\n*[http://www.kingstontwp.org Township website]\n*[http://www.co.delaware.oh.us County website]\n*[http://delawarecountymemory.org/collections/show/14 Kingston Township collection in Delaware County Memory]"
    }
  ]
}