{
  "content": [
    {
      "type": "text",
      "text": "# Kingston upon Thames War Memorial\n\n|location       =  Kingston upon Thames, Royal Borough of Kingston upon Thames, London\n|nearest_town   =\n|designer =    Richard Reginald Goulden\n|inscription =  IN HONOUR OF THE MEN OF THIS TOWN WHO GAVE THEIR LIVES IN THE GREAT WARS 1914–1919, 1939–1945.\n| embedded=\n}}\n}}\nKingston upon Thames War Memorial, in the Memorial Garden on Union Street, Kingston upon Thames, London, commemorates the men of the town who died in the First World War. After 1945, the memorial was updated to recognise casualties from the Second World War. The memorial was commissioned by the town council and was designed by the British sculptor Richard Reginald Goulden. The memorial includes a bronze statue of a nude warrior, carrying a flaming cross and wielding a sword with which he defends two children from a serpent, erected on a granite plinth, with bronze plaques listing the names of the dead. Goulden designed a number of such allegorical memorials, including others at Crompton, Greater Manchester, and Redhill, Surrey. The Kingston memorial was designated a Grade II listed structure in 1983. This was revised upwards in 2016 to Grade II*, denoting a building or structure of particular importance.\nBackground\nThe town of Kingston upon Thames received its first charter in 1200. It retains close links to its historic county, Surrey, although it is now the administrative centre for the Royal Borough of Kingston upon Thames, a borough of Greater London. During the First World War, the borough librarian began to maintain a record of the men from the town killed in the conflict and, at the war's end in 1919, the borough corporation determined to commemorate the dead by commissioning a memorial.\nAfter a period of discussion of the nature and site of the memorial, the commission was awarded to Richard Reginald Goulden in 1920. Goulden himself fought in the war, as a captain in the Royal Engineers until he was invalided out in 1916. He had trained as a sculptor at the Dover School of Art and at the National Art Training School, followed by a pre-war career as a teacher and artist. In 1920 he won a commission to design the Bank of England War Memorial to commemorate the staff of the Bank of England who had died in the war. His chosen subject was St Christopher carrying a child, and this allegorical approach, which Historic England terms manhood defending, became a regular motif in his work, as it is at Kingston.\nIn addition to the memorials at Kingston and at the Bank of England, Goulden designed at least nine other war memorials in the 1920s, with other examples in or near London including Middlesex Guildhall, St Michael Cornhill, Hornsey and Redhill, and further afield at Brightlingsea, Dover, Malvern, Crompton, and Gateshead.  Five (Crompton, Dover, Kingston, Redhill, and St Michael Cornhill) are listed at Grade II*, and four (Bank of England, Brightlingsea, Gateshead, Malvern) at Grade II.  As with Kingston, many of the memorials feature a bronze figure holding an object aloft, or a man one or two children, or both.\nFile:War memorial and Redhill United Reformed Church (geograph 1664715).jpg|Redhill\nFile:Dover war memorial goulden 2.jpg|Dover\nFile:War Memorial, Great Malvern - geograph.org.uk - 1005125.jpg|Malvern\nFile:WW1 Memorial-St Michael In Cornhill Church-London.JPG|St Michael Cornhill\nFile:Crompton War Memorial (1).jpg|Crompton\nDescription\nThe memorial is topped by a large bronze sculpture, which depicts a nude warrior raising aloft a burning crucifix in his left hand, while his right holds a sword which he uses to strike a serpent. At his right side are two small children, whom he is protecting. Goulden was particularly skilful at the depiction of children, another recurring theme in his work. An earlier example, from 1914, was the memorial to the feminist social reformer Margaret MacDonald at Lincoln's Inn Fields, itself Grade II listed. Cast into the base of the bronze sculpture are lines from the fourth stanza of Laurence Binyon's poem For the Fallen; \"AT THE GOING DOWN OF THE / SUN AND IN THE MORNING / WE WILL REMEMBER THEM\".\nThe statue is mounted on a tall granite pedestal, which bears the inscription: \"IN HONOUR OF / THE MEN OF THIS / TOWN WHO GAVE / THEIR LIVES IN / THE GREAT WARS / 1914 – 1919 / 1939 – 1945\", and below that bronze plaques, which extend onto lower flanking granite wings, record the names of the 624 men of the town killed in the First World War.  The pedestal and wings stand on three granite steps, with bronze planters.  The pedestal inscription was revised after the Second World War to include mention of the town's dead from that conflict, but the names of individuals were not inscribed on the memorial.  The bronze elements were cast at the A.B. Burton foundry at Thames Ditton (Goulden had made a bronze memorial sculpture for Burton's daughter Dolly, who died in 1908, which stands in Kingston Cemetery, and is also Grade II listed).\nThe memorial stands in a gated enclosure in a public garden, formerly an overflow burial ground for All Saints Church, Kingston upon Thames. The ceremony of dedication for the Kingston memorial was held on 11 November 1923 and was led by Frederick George Penny, the town's member of parliament and later created 1st Viscount Marchwood.\nSee also\n* Grade II* listed war memorials in England\n* Grade II* listed buildings in the Royal Borough of Kingston upon Thames\n* List of public art in the Royal Borough of Kingston upon Thames\nReferences and sources\nReferences\nSources\n*\nExternal links\n*\n*[http://www.victorianweb.org/sculpture/goulden/4.html  Images of the memorial at The Victorian Web]"
    }
  ]
}