{
  "content": [
    {
      "type": "text",
      "text": "# King Charles III England Coast Path\n\n| map         =\n| map_name    =\n| map_caption =\n| map_size    =\n| map_alt     =\n| route       =\n| route_state =\n}}\nThe King Charles III England Coast Path (KCIIIECP), originally and still commonly known as the England Coast Path, is a long-distance National Trail that will follow the coastline of England. When complete, it will be  long.\nVarious parts of the English Coast already had coastal paths, most notably that of the South West Coast Path. However, with the passing of the Marine and Coastal Access Act 2009, section 298 instructed Natural England to create a holistic Coastal Path. The first section, along Weymouth Bay, opened in 2012. The path is the longest Coastal Path in the world, with it being even longer if including the Wales Coast Path.\nHistory\ncliff tops on the Cleveland Way, North York Moors National Park.]]\nBackground\nFollowing the establishment of the Pembrokeshire Coast National Park in 1952, Welsh naturalist and author Ronald Lockley surveyed a route around the coast. This was constructed and then opened in 1970, as the Pembrokeshire Coast Path. Lockley's report for the Countryside Commission in 1953 was welcomed and broadly adopted. Some sections of the walk were existing rights of way, but the majority were in private hands, necessitating negotiation. Most landowners were in favour, and many benefitted from the erection of new fencing.\nIn 2000, the Government legislated to introduce a limited \"right to roam\". The Countryside and Rights of Way Act 2000 (CROW) was gradually implemented from 2000 onwards to give the general public the conditional right to walk in certain areas of the English and Welsh countryside, including coastal land. Developed land, gardens and certain other areas are specifically excluded from the right of access. Agricultural land is accessible if it falls within one of the categories described in the Act. People exercising the right of access have certain duties to respect other people's rights to manage the land, and to protect nature. The new rights were introduced region by region through England with completion in 2005.\nIn 2004, the Ramblers started their campaign, advocating for a Coastal Pathway.\nPath history\non the Saxon Shore Way]]\nThe King Charles III England Coast Path has been possible because of the introduction of a UK law, the Right of Coastal Access under Part 9 of the Marine and Coastal Access Act 2009. The Act provides for the establishment of both the England Coast Path and, usually, the right of access over the associated 'coastal margin'. This includes – where appropriate – any land, other than the trail itself, which forms part of the coastal margin and which has public rights of access along the way. This is known as 'spreading room'. However, this does not include any right to enter private houses and gardens or Ministry of Defence land. The new right of Coastal Access also includes 'roll back', namely that if a section of coast erodes, the path will move back accordingly.\nNatural England's Coastal Access Scheme was approved by the Secretary of State on 9 July 2013 under section 298(2) of the Marine and Coastal Access Act 2009, and presented to Parliament pursuant to section 298(6) of the Marine and Coastal Access Act 2009.\nThe first instance of this new law was implemented on a stretch of the English coast at Weymouth Bay on 29 June 2012.\nIn December 2014 the UK Government, encouraged by the success of the Wales Coast Path, announced that more than £5 million of additional funding was being committed over the following five years, to complete the Path by 2020, a decade earlier than would have otherwise been possible.\nIn the UK, public access to the foreshore below the line marking high tide has existed for a long time. The intertidal zone is generally deemed to be owned by The Crown, although there are some exceptions. In England ownership of land extends only to the high water mark, and The Crown is deemed to own what lies below it.\nProgress slowed due to COVID-19 and a European court judgement in April 2018 regarding environmentally protected sites. Natural England now hopes to have all stretches approved and work underway by the end of 2024.\nIn May 2023, to mark the coronation of King Charles III, the Secretary of State Thérèse Coffey announced that the England Coast Path would be renamed the King Charles III England Coast Path. New branding was introduced to reflect the colours of the English flag, with signage being gradually introduced across new stretches of the path.\nExisting coastal trails\nExisting coastal trails in England will be incorporated into the King Charles III England Coast Path. Signage along the whole route now falls to a uniform design. These paths are:\n* Bournemouth Coast Path:\n* Cleveland Way:\n* Cumbria Coastal Way:\n* Durham Coastal Footpath:\n* Isle of Wight Coastal Path:\n* Lancashire Coastal Way:\n* Norfolk Coast Path:\n* Northumberland Coast Path:\n* Saxon Shore Way:\n* Solent Way:\n* South West Coast Path:\n* Suffolk Coast Path:\n* West Somerset Coast Path:\nLinking trails\nScottish border\nThe Coastal path has four trailheads. At Berwick, the England Coast Path connects to the Berwickshire Coastal Path. There are plans to create a Scottish Coastal Way, which would likely link at Berwick. At Gretna, the path may connect to the Scottish Coastal Way, if it is built. Here, the path can also connect to Hadrian's Wall Path, allowing for users to  connect back to the England Coast Path, at Newcastle upon Tyne, south of Berwick.\nWelsh border\nAt Queensferry, the England Coastal path connects to the Wales Coastal Path. Likewise, at Aust, the Wales Coast Path can be accessed by crossing the Severn Bridge. The England/Wales border can be followed from both trailheads, by using the Offa's Dyke Path.\nConnections with other National Trails\n*South Downs Way at Eastbourne\n*North Downs Way at Dover\n*Yorkshire Wolds Way at Filey\n*Cleveland Way at Saltburn-by-the-Sea and Filey\nThe route\nThe route itself is divided into five separate areas, roughly based on the region. These areas are North-East (Berwick to Skegness), East (Skegness to London), South-East (London to Southampton), South-West (Southampton to Aust) and North-West (Queensferry to Gretna).\nSee also\n*E9 European long distance path\n* Coastline of the United Kingdom\n* List of long-distance footpaths in the United Kingdom\n* Scottish Coastal Way\n* Wales Coast Path\n* Raad ny Foillan – coastal path around the Isle of Man\n* Walking in the United Kingdom\nReferences\nExternal links\n* [https://www.gov.uk/government/collections/england-coast-path-improving-public-access-to-the-coast King Charles III King Charles III England Coast Path: improving public access to the coast] Natural England. Retrieved 20 January 2017\n* [http://www.nationaltrail.co.uk/england-coast-path King Charles III England Coast Path] National Trails. Retrieved 20 January 2017"
    }
  ]
}