{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom (American TV series)\n\n| theme_music_composer = Tyler BatesRafe Pearlman\n| composer             = Tyler Bates\n| country              = United States\n| language             = English\n| num_seasons          = 3\n| num_episodes         = 40\n| list_episodes        = List of Kingdom (American TV series) episodes\n| executive_producer   =\n| producer             =\n| location             = Los Angeles, California\n| cinematography       =\n| editor               =\n| camera               = Single-camera\n| runtime              = 46–60 minutes\n| company              = Balasco ProductionsEndemol Shine Group\n| first_aired          =\n| last_aired           =\n| related              =\n| channel              = Audience Network\n}}\nKingdom (previously titled Navy St.) is an American drama television series created by Byron Balasco. The series premiered on October 8, 2014 on the Audience Network and concluded on August 2, 2017. It stars Frank Grillo, Kiele Sanchez, Matt Lauria, Jonathan Tucker, Nick Jonas, and Joanna Going. Season one consists of ten episodes.\nOn October 17, 2014, DirecTV announced that the series was renewed for an additional 20 episodes, 10 of which aired in 2014 & 10 in 2015. On July 7, 2016, it was renewed for a third season which premiered on May 31, 2017. On April 1, 2017, it was announced that the third season would be the final season of the series.\nSummary\nAlvey Kulina owns and operates a mixed martial arts gym called Navy St. Gym in Venice, California, with his girlfriend, Lisa. He helps people work out and trains fighters along with his sons, Nate and Jay. Jay has a drug and alcohol problem, but puts it aside to start fighting again and Nate is dealing with personal issues as well. Ryan Wheeler used to be a great fighter who left Alvey when he got big until he was sent to prison after brutally assaulting his father. After Ryan's release, Alvey wants him to fight again and be his trainer as it would be good publicity for the gym. Lisa is initially opposed to this, as she and Ryan used to be engaged, but eventually accepts it for the sake of the gym. Alvey's estranged ex-wife, Christina, is a drug addict and sex worker, with sporadic contact with Kulina and her sons. Fighting is a way of life in this family both in and out of the ring.\nCast\nMain cast\n* Frank Grillo as Alvey Kulina, Jay and Nate's father. Owner of the gym Navy St., he's a retired MMA fighter who now trains MMA fighters at his gym.\n* Kiele Sanchez as Lisa Prince, Ryan's ex-fiancée and Alvey's girlfriend, She runs the business side of the gym and also manages Jay as a fighter.\n* Matt Lauria as Ryan Wheeler, an ex-convict who starts training to be a fighter again after being released from prison. He used to be engaged to Lisa and is still in love with her.\n* Jonathan Tucker as Jay Kulina, Alvey and Christina's older son and Nate's older brother. Seen as the screw up in the family by Alvey. Starts fighting again when Lisa begins to manage him. Jay is the loud mouth, obnoxious, but protective Kulina brother.\n* Nick Jonas as Nathaniel \"Nate\" Kulina, Alvey and Christina's younger son, an upcoming fighter who after an attack is put on the backbench. He is also a closeted gay man.\n* Joanna Going as Christina Kulina, Alvey's ex-wife and the mother of Jay and Nate. She's a former drug addict and sex worker, which has a negative impact on Jay.\n* Natalie Martinez as Alicia Mendez, an upcoming fighter and Lisa's new client with whom Ryan has a frequent sexual relationship. (season 2).\nRecurring cast\n* Juliette Jackson as Shelby, Lisa's friend who runs the front desk at Navy St. Gym (seasons 1–3)\n* Paul Walter Hauser as Keith, Ryan's friend and roommate at the half-way house turned housemate after Ryan moves into Keith's home (seasons 1–3)\n* Mac Brandt as Mac Sullivan, nurse and personal friend and drug supplier of the Kulinas (seasons 1–3)\n* Jamie Harris as Terry, Christina's pimp, later former (seasons 1–3)\n* Bryan Callen as Garo Kassabian, fight promoter (seasons 1–3)\n* Joe Stevenson as Fight Coach \"Daddy\" (seasons 1–3)\n* Phil Abrams as Dr. Kramer, Alvey's therapist (seasons 1–3)\n* M. C. Gainey as Rick, Ryan's father who is in a wheelchair (seasons 1–2)\n* Bruce Davison as Ron Prince, Lisa's father (seasons 1–2)\n* Zuleikha Robinson as Allison (season 1)\n* Ronnie Gene Blevins as Michael, bully at the half-way house with Ryan and Keith (season 1)\n* Mario Perez as Carlos, a gang member that's involved with Nate's beating (season 1)\n* Meaghan Rath as Tatiana, Nate's physical therapist (season 1)\n* Jai Rodriguez as Diego Diaz, Nate's physical therapist after Tatiana resigns (season 1)\n* Jamie Kennedy as Bucky DeMarco, a fight promoter (season 1)\n* Jessica Szohr as Laura Melvin, a professional photographer who was briefly Jay's girlfriend after photographing him on the beach (season 2)\n* Mark Consuelos as Sean Chapas, a friend of Alvey's and ex-fighter turned businessman (season 2)\n* Andre Royo as the owner of the Sunset Hawaiian (season 2)\n* Lina Esco as Ava Flores, Alicia's younger sister by two years. A drug-addict and former model with whom Jay had a sexual relationship. (season 2)\n* Wendy Moniz as Roxanne (season 2)\n* Michael Graziadei as Drew (season 2)\n* Jeff Ross as a promoter (season 2)\n* Paul Ben-Victor as Bob (season 2)\n* Billy Lush as Jason (season 2)\n* Kirk Acevedo as Dominick Ramos (season 3)\n* Talia Shire as Annette Kulina, Alvey's mother (season 3)\n* Patrick Fischler as Dan (season 3)\n* Zach Gilford as Tim (season 3)\nGuest stars\n* Cub Swanson as Nate's opponent (season 1)\n* Alicia Witt as Melanie (season 1)\n* Kenny Florian as himself (seasons 1–3)\n* Joseph Benavidez as Jay's opponent (season 2)\n* Greg Jackson as himself (season 2)\n* Diego Sanchez as Nate's opponent (season 3)\n* Matt Hughes as himself (season 3)\nEpisodes\nReception\nKingdom received positive reviews throughout its run. On Rotten Tomatoes, the first season has an approval rating of 81% with an average score of 6.88/10 based on 16 reviews. The critical consensus is, \"It may be a little dated in its portrayal of women, but Kingdom offers a new, well-acted take on the boxing genre.\" The first season has a Metacritic score of 72 out of 100 based on 12 reviews, indicating \"generally favorable reviews\".\nOn Rotten Tomatoes, the second season has an approval rating of 83% with an average score of 6.75/10 based on 6 reviews, and the third season has an approval rating of 100% with an average score of 7.88/10 based on 5 reviews.\nBroadcast and release\nThe series premiered in Australia on April 7, 2015, on FX and was seen by 16,000 viewers. It premiered in Canada on Bravo on October 13, 2014. It aired in Sweden on TV12, in South America on OnDirecTV, a channel of DirecTV, and in New Zealand on Sky Movies Action.\nThe series aired in the United Kingdom exclusively to Virgin Media customers via the video on demand (VoD) service on their Virgin TV XL package, the first six episodes were made available to stream on April 1, 2016, with further episodes being made available on a weekly basis.\nThe series was available on Netflix from July 2020 until April 2021.\nThe series was available to stream on Peacock from May 2023 to October 2024.\nReferences\nExternal links\n*\n*"
    }
  ]
}