{
  "content": [
    {
      "type": "text",
      "text": "# King and McGaw\n\n| founders         = Gyr King, Simon Matthews, and Marc Lickfett\n| location_city    = Newhaven, Sussex\n| location_country = United Kingdom\n| products\t       = Art Prints, frames\n| revenue \t       =  £6.5&nbsp;million\n| revenue_year     = 2013\n| homepage         =\n}}\nKing & McGaw is a British art publisher and online retailer. It supplies high quality art prints and products to museums, galleries and retail stores as well as art prints direct to consumers through its online retail site. Production is based in their  factory in Newhaven, Sussex.\nHistory\nThe company was set up in Sussex in 1982 by three brothers Gyr, Quentin and Perry King under the name King Publishing, as a silkscreen printing company. The company designed upmarket posters for art galleries and small boutique shops.  The brothers negotiated the rights to works of art by new artists and photographers, as well as established artists such as Bridget Riley, Howard Hodgkin and Terry Frost.\nThe company rebranded to King Posters by the late 1980s with the business developing into other areas including framing and product development for museum shops such as the Tate, National Gallery, Louvre, Metropolitan Museum of Art and the Museum of Modern Art.\nBy 1989 King Posters was making annual sales of £2&nbsp;million but later that year a fire destroyed the warehouse and resulted in £3&nbsp;million worth of stock being lost. The company's bank loaned an additional £5,000 so the stock could be reprinted and an American supplier, Bruce McGaw, offered to replace some of the missing stock for free, which, in turn, triggered a business deal. As a result, the company was renamed in 1990 to King & McGaw.\nDuring the 1990s, King & McGaw's focused on turning to supplying department stores with pictures and posters as well as museums and galleries resulting in partnerships with John Lewis, Next and Debenhams. As a result, sales had reached $35&nbsp;million a year by the end of 2000. Further developments occurred in 2007 when the company switched to digital printing, allowing them to print-to-order.\nBy 2011 the company decided to expand into retail by acquiring the online retailer Easyart.com. Easyart was set up by Simon Matthews in 1999 during the dot-com boom and in 2002 faced legal allegations from Sir Stelios Haji-Ioannou, the founder of EasyJet, over its use of the easy name, accusing Easyart of \"passing off\" on easyGroup's good name. Easyart won the court battle when easyGroup discontinued its legal action, saying it had bigger targets to go after. In March 2015, the company, then under CEO and co-founder Marc Lickfett, discontinued the Easyart brand and merged the site within the King & McGaw brand.\nIn May 2015 King & McGaw used a pop-up shop to showcase lithographic posters from the Mourlot Studios archives on D'Arblay Street, Soho, London. Contributions from artists such as\nPicasso, Matisse, Masson,\nLeger, Miro, Le Corbusier, Yves Klein, Raoul Dufy and René Magritte were included in the exhibit. Classes in drawing with artist Anna-Louise Felstead and screen printing classes with Print Club London, a screen printing company based in Dalston\nwere also held at the shop.\nReferences"
    }
  ]
}