{
  "content": [
    {
      "type": "text",
      "text": "# King Ly Chee\n\n}}\nKing Ly Chee is a hardcore band from Hong Kong.\nMusic\nThe band's sound is characterized by hardcore, usually with shouted verses, interspersed with melodic flourishes.\nHistory\nKing Ly Chee was formed in May 1999 fueled by the fire and passion of a form of music called 9core. In 1999, the music climate of Hong Kong was an unhealthy world of cover bands passing themselves off as \"hardcore\" or \"metal\" while belting out tunes by Limp Bizkit. The founder of King Ly Chee, Riz, had enough and one day, he decided that it was time that someone set the record straight on what \"hardcore\" truly implies. He set off on the mammoth task by releasing a bilingual zine called Start From Scratch that included interviews, essays and CD reviews of world-renowned punk, metal and hardcore bands. As the wheels were turning for Start From Scratch, Riz sat back and realized that words were not enough, kids in Hong Kong needed to hear, feel and see \"hardcore\" in action to fully absorb the impact. King Ly Chee was the result..\nThis band has tirelessly continued this mission for over 15 years now through their sheer determination and passion for hardcore, they have taken their sounds, energy and hearts to surrounding Asian countries, and Europe, helping establish the name \"King Ly Chee\" as a truly Asian band.\nIn the past 15 years they have let no obstacle come in their way when it comes to touring. With all members knee-deep in full-time day jobs, they jump at any open opportunity they get to perform outside of Hong Kong.\nKing Ly Chee had opened for the following bands: Sick of it All, Korn, NOFX, Comeback Kid, Terror, Horse the Band, Bane, Have Heart, Envy, Naiad, No Turning Back, Himsa, Rambo, 100 Demons, Reflector, The Bouncing Souls, FC Five, 100 Demons, Die Young TX\nIn January 2012 King Ly Chee released their third studio album \"Time Will Prove\".  It was 8 years since their second album \"Stand Strong\" was released.  \"Time Will Prove\" is a double CD digipak that includes all English albums as well as all Chinese album.  The album was recorded at their studio by guitarist Brian Wong and it was then sent to the US for Zack Ohren (All Shall Perish, First Blood) to mix and master.\nTo celebrate their 15th year, King Ly Chee released a new album at the end of August 2014.\nIn September and October 2015, King Ly Chee went on an Asian tour with Sick of it All, one of their biggest influences. Lou Koller of Sick of it All previously added vocals to the track Lost in a World and even performed with King Ly Chee on stage at one of their concerts in Hong Kong.\nMembers\n;Former members\n* Riz Farooqi – vocals (1999–2017)\n* Warrick Harniess – bass (1999)\n* Stephane Wong – drums (1999–2001) (formerly of Whence He Came, Charisma) (now in DJ Stef:Funn)\n* Ian Cruz – bass (1999–2000)\n* Alex Chung – vocals, bass (2000–2006) (now in Die in Velvet)\n* Andy Chung – guitar (2001–2006)\n* Fei Hin – drums (2001) (formerly of UNiXX)\n* Kevin Li – drums (2002–2005) (now in Hardpack & LMF)\n* Ming So – drums (2005–2006) (now in Yellow)\n* Pong Law – bass (2005–2008) (formerly of Guan36)\n* G Tsui – vocals (2006–2008) (formerly of Engrave Thy Heart)\n* Kin Man Leung – drums (2006–2009) (formerly of Departing Cross) (Now in Evocation and INDenial)\n* Brian Chi Wong – guitar (2007–2017)\n* Ho Chan – bass (2008–2010, 2013–2017)\n* Egas Mateus Da Silva – drums (2009–2012) (formerly of Unik)\n* Kent Wong – guitar (2009–2012) (formerly of Unik)\n* Joe Wu – guitar (2010–17)\n* Ivan Wing de Souza – drums (2014–2017)\nDiscography\nStudio albums\n*We Are Who We Are (2000)\n*Stand Strong (2003)\n*Under One Flag (2006), with Good Reason\n*Unite Asia (2008), free digitally-released EP\n*Time Will Prove (2012)\n*CNHC (2014)\nReferences\n*[http://kinglychee.com/Artciles.htm King Ly Chee web site page on mission and purpose]\n*[https://web.archive.org/web/20050325043836/http://www.hardcore-times.com/Interviews.asp?hxc=show&ID=45 Hardcore Times interview with Riz Farooqi, 2003] Retrieved 5 November 2005\nExternal links\n*[http://www.kinglychee.com/ Official Site]"
    }
  ]
}