{
  "content": [
    {
      "type": "text",
      "text": "# King Biscuit Time\n\n:\"King Biscuit Time\" is also the name under which ex-Beta Band frontman Steve Mason releases his solo work.\nKing Biscuit Time is the longest-running daily American radio broadcast in history. The program is broadcast each weekday from KFFA in Helena, Arkansas, United States, and has won the George Foster Peabody Award for broadcasting excellence. In 2018, certain selections of King Biscuit Time from 1965 were selected for preservation in the National Recording Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".\nHistory and description\nThe first broadcast of King Biscuit Time was on November 21, 1941 on KFFA in Helena, and featured blues artists Sonny Boy Williamson II (Rice Miller) and Robert Lockwood, Jr. Williamson and Lockwood played live in the studio and were the key musicians in the original studio band, the \"King Biscuit Entertainers\". Other musicians who joined the original band were Pinetop Perkins on piano and James \"Peck\" Curtis on drums. Williamson left the program in 1947 but returned for a stint in 1965 just prior to his death.\nThe 30-minute-long live radio program is broadcast at 12:15 pm every weekday and was named after the local brand of flour, King Biscuit Flour, distributed by the Interstate Grocer Company. The distributor financed the show at the behest of Williamson in exchange for endorsements and naming rights. KFFA was the only station that would play music by African-Americans, and it reached an audience throughout the Mississippi Delta region.  It inspired blues musicians including B.B. King, Robert Nighthawk, James Cotton, and Ike Turner.  The show's 12:15 pm time slot was chosen to match the lunch break of workers in the Delta.\nKing Biscuit Time celebrated its 17,000th broadcast on May 13, 2014. KBT has more broadcasts than the Grand Ole Opry (which was never a daily broadcast) and American Bandstand. From 1951 until his death in 2018, the program was hosted by the award-winning \"Sunshine\" Sonny Payne who opened each broadcast with \"pass the biscuits, 'cause it's King Biscuit Time!\" Before Payne, the show was hosted by Hugh Smith, from 1943 to 1951. It is currently hosted by Thomas Jacques from the Delta Cultural Center in Helena, Arkansas. Over the years, the biggest names in blues have been associated with the program, and important blues artists continue to perform live.\nInfluence and related projects\nThe popularity of the program made Helena a major blues center.  Helena became a stopping place for blues musicians on their way from the Delta region to the Chicago blues nightclubs and was also convenient to Memphis, Tennessee and its lively blues culture. Several blues musicians, including Little Walter Jacobs and Jimmy Rogers came to Helena and made it their home.\nKing Biscuit Time was also a major breakthrough for African-American music in general.  The popularity of the program and its reach into the untapped African-American demographic gained notice and spawned a host of imitators.  By 1947, the first black disc jockey in the South, Early Wright, had been signed at WROX across the river. WDIA in Memphis soon became the first radio station in the South with an all black staff (including deejay B.B. King) and musical format based on the success of King Biscuit Time.\nLevon Helm, the late drummer and vocalist for The Band, credited King Biscuit Time, and in particular, James \"Peck\" Curtis, for inspiring his musical career.\nMusician King Biscuit Boy was given that stage name by Ronnie Hawkins.\nThe King Biscuit Flower Hour is a one-hour syndicated rock and roll radio program, the name of which was derived from King Biscuit Time.\nIn 1986, the first annual King Biscuit Blues Festival (later renamed to Arkansas Blues and Heritage Festival and returned to King Biscuit Blues Festival in 2011) was held in Helena, attracting thousands of blues aficionados from around the world.\nIn 1992, Delta Broadcasting President Jim Howe started The King Biscuit Times'' newsletter to promote KFFA's King Biscuit Time radio show and the King Biscuit Blues Festival.  This publication soon transformed into a nationally distributed blues magazine published and edited by Mike Beck, along with Grammy-nominated writer and producer Larry Hoffman who served as staff contributor and editorial advisor.  As time passed, the list of other contributors were to include John Anthony Brisbin, George Hansen, Sandra Pointer-Jones, and Donald E. Wilcock, the latter serving as managing editor.  Regular columnists included “Sunshine” Sonny Payne and Robert Lockwood Jr.  In 1997 the publication was the recipient of a \"Keeping the Blues Alive Award\" in Print Media by the Blues Foundation.  The magazine, which later altered its name to King Biscuit Time, ceased publication in 2005.\nReferences"
    }
  ]
}