{
  "content": [
    {
      "type": "text",
      "text": "# King of the Ring (2006)\n\nThe 2006 King of the Ring was the 17th edition of the King of the Ring tournament produced by World Wrestling Entertainment (WWE). The tournament was held between April 14 and May 21, 2006 and was the first tournament conducted since the 2002 tournament which was won by Brock Lesnar. This was the first time the King of the Ring tournament was not conducted as part of the former pay-per-view event that bore the tournament's name since the 1991 tournament, which was won by Bret Hart. Unlike previous tournaments, this King of the Ring was made exclusive to the SmackDown! brand division and only wrestlers contracted with the brand could compete. The 2006 tournament final was held at Judgment Day on May 21 and was won by Booker T, who defeated Bobby Lashley in the final and began referring to himself as \"King Booker\" until he left WWE in October 2007.\nBackground\nThe King of the Ring tournament is a single-elimination tournament that was established by World Wrestling Entertainment (WWE) in 1985 with the winner being crowned \"King of the Ring.\" It was held annually until 1991, with the exception of 1990. These early tournaments were held as special non-televised house shows and were held when the promotion was still called the World Wrestling Federation (WWF, renamed to WWE in 2002). In 1993, the promotion began to produce the King of the Ring tournament as a self-titled pay-per-view (PPV). Unlike the previous non-televised events, the PPV did not feature all of the tournament's matches. Instead, several of the qualifying matches preceded the event with the final few matches then taking place at the pay-per-view. There were also other matches that took place at the event as it was a traditional three-hour pay-per-view.\nKing of the Ring continued as the annual June PPV until the 2002 event, which was the final King of the Ring produced as a PPV. After a four-year hiatus, the tournament returned in 2006 and was held exclusively for wrestlers from the SmackDown! brand. The 2006 tournament was the 17th King of the Ring tournament. The quarter-final and semi-final rounds took place across episodes of SmackDown! from April 14 to May 12 with the final round taking place at the SmackDown!-exclusive pay-per-view, Judgment Day, on May 21.\nMatches\nQuarter-finals\nThe first quarter-final match in the 2006 King of the Ring tournament took place on April 14, 2006 edition of SmackDown! between Kurt Angle and Randy Orton. Angle dominated the earlier part of the match by a series of clotheslines and a Belly To Belly Suplex to Orton. Angle applied an Ankle Lock earlier on in the match but Orton escaped the move. Orton gained momentum and attacked Angle's arm and shoulder, injuring them. Orton continued to tear Angle's arm and shoulder until Angle attempted a Sunset Flip and reversed it into an Ankle Lock but Orton did not submit and worked on Angle's injured arm and shoulder. Angle eventually sent Orton out of the ring. As Orton returned into the ring, Angle performed three German Suplexes and attempted an Olympic Slam, which he calls Angle Slam. Orton countered it into an Inverted Backbreaker. Orton tried to hit the RKO but Angle blocked the move and applied an Ankle Lock on Orton, forcing him to submit to the hold. After the match, Angle applied two more Ankle Locks on Orton, injuring his ankle in storyline.\nThe second quarter-final match took place on April 21 edition of SmackDown! between Matt Hardy and Booker T. The match went back and forth until Booker earned momentum after Hardy missed a Moonsault. Booker dominated the match until Hardy regained momentum and attempted a Front Facelock into Cutter, which he calls Twist of Fate. Booker reversed by whipping Hardy. Booker's wife and valet Sharmell pushed the rope down and Hardy fell on the ground. Booker tried to finish Hardy but Hardy executed a Reverse DDT. Booker regained his momentum and executed a Lifting Side Slam, which he calls Book End. Booker tried to finish the match by attempting a Scissors Kick on Hardy but Hardy avoided the move and executed a Side Slam, which he calls Side Effect. Sharmell joined the ring and distracted the referee. Hardy tried to execute a Twist of Fate but Booker took advantage of the situation and low blowed Hardy to win the match.\nThe third quarter-final match took place on April 28 edition of SmackDown! between Bobby Lashley and Mark Henry. Lashley used several of his moves to put down Henry but Henry dominated him and easily performed his moves on Lashley. Lashley tried to defeat Henry by attempting an Inverted Front Powerslam, which he called Dominator but Henry reversed the move. In the closing moments of the match, Henry tried to clothesline Lashley but Lashley pulled the ropes down and Henry crashed to the floor. His head crashed on the announce table and Henry was knocked out. He was unable to enter the ring and lost by count-out. As a result, Lashley was awarded the victory. However, after the match, Henry splashed Lashley into the ringpost.\nThe final quarter-final match took place on May 5 edition of SmackDown! between Chris Benoit and Finlay. The match went back and forth until Benoit started performing German suplexes on Finlay and attempted a Diving Headbutt on Finlay but Finlay avoided the move. Finlay started throwing weapons into the ring. The referee threw the weapons outside the ring. Finlay took advantage and grabbed his shillelagh. He tried to hit Benoit with the shillelagh but Benoit avoided the move and sent Finlay outside the ring on the floor. Finlay took the weapon himself outside the ring. The referee caught the shillelagh and began disposing it. Finlay took advantage and hit Benoit with a chair. Finlay followed by executing a Kryptonite Krunch Piledriver, which he calls Celtic Cross for the victory.\nSemi-finals\nThe semi-final round of the King of the Ring tournament on May 12, 2006 edition of SmackDown!. The first scheduled match was between Kurt Angle and Booker T. Angle suffered injured ribs after being attacked by Mark Henry during his World Heavyweight Championship title shot against Rey Mysterio. Angle was escorted out of the arena by the security before his scheduled semi-final match against Booker. As a result, Booker was awarded the victory by forfeit and advanced to the final round of the tournament.\nThe only semi-final match that took place was between Bobby Lashley and Finlay. Finlay and Lashley continued to wrestle each other and performed their moves. Lashley tried to finish the match by attempting a Spear on Finlay. Finlay avoided the move and tossed a chair into the ring. The referee began disposing the chair. Finlay took advantage and grabbed his shillelagh but the referee caught Finlay with it and disposed it. Finlay caught a chair and hit Lashley with it. Finlay tossed the chair outside the ring but when he turned back, Lashley speared him to win the match and advance to the final of the King of the Ring tournament against Booker T.\nFinal\nThe final round of the King of the Ring tournament took place at Judgment Day between Booker T and Bobby Lashley. Lashley took control early on in the match, until he hit the ringpost with a Shoulder Block attempt. This allowed Booker to take control, although Lashley quickly countered with a Belly To Belly Suplex. Before he could capitalise, however, Sharmell distracted Lashley. After some more back and forth offense, Sharmell caused another distraction, allowing Booker's associate Finlay to interfere in the match and hit Lashley with a shillelagh. Following that, Booker then hit a Scissors Kick on Lashley and pinned him to win the tournament. Lashley was outraged, however, and speared Booker through a throne to gain some revenge.\nAftermath\nMany rivalries were created because of the matches in the King of the Ring tournament. Two of the participants of the tournament, Chris Benoit and Finlay were scheduled to a match at Judgment Day because Finlay cheated to defeat Benoit in their tournament quarter-final match. At Judgment Day, Benoit defeated Finlay by forcing him to submit to a Crossface, which Benoit called Crippler Crossface.\nAs a result of winning the 2006 King of the Ring tournament, Booker T began wrestling under the ring name \"King Booker\". Booker had cheated to defeat Bobby Lashley in the final of the King of the Ring tournament at Judgment Day, which led to a feud between Lashley and Booker. The two competed in several matches throughout June. Following his feud with Lashley, Booker earned immediate success by winning the World Heavyweight Championship from Rey Mysterio at The Great American Bash.\nThe next King of the Ring tournament was held in 2008. The entirety of the 2008 tournament was held as a special episode of Raw. The tournament was also an interbrand tournament and included wrestlers from all three of WWE's brands at the time: Raw, SmackDown, and ECW.\nLocations\n{| class=\"wikitable sortable\" width=98% style=\"text-align:center;\"\n!width=16%|Match\n!width=16%|Tournament Round\n!width=13%|Date\n!width=17%|City\n!width=17%|Venue\n!width=15%|Event\n|-\n|Kurt Angle vs. Randy Orton\n|rowspan=\"4\"|Quarter-Final\n|April 14, 2006\n|Green Bay, Wisconsin\n|Resch Center\n|rowspan=\"6\"|SmackDown!\n|-\n|Booker T vs. Matt Hardy\n|April 21, 2006\n|St. Louis, Missouri\n|Savvis Center\n|-\n|Bobby Lashley vs. Mark Henry\n|April 28, 2006\n|London, England\n|Wembley Arena\n|-\n|Finlay vs. Chris Benoit\n|May 5, 2006\n|Cincinnati\n|U.S. Bank Arena\n|-\n|Booker T vs. Kurt Angle\n|rowspan=\"2\"|Semi-Final\n|May 12, 2006\n|San Diego\n|iPayOne Center\n|-\n|Bobby Lashley vs. Finlay\n|May 12, 2006\n|San Diego, California\n|iPayOne Center\n|-\n|Booker T vs. Bobby Lashley\n|Final\n|May 21, 2006\n|Phoenix, Arizona\n|US Airways Center\n|Judgment Day\n|}\nTournament brackets\nThe tournament took place between April 14 and May 21, 2006. The tournament brackets were\nReferences\nExternal links\n* [http://prowrestlinghistory.com/supercards/usa/wwf/kingtny2.html#2006 King of the Ring 2006 Tournament Brackets]"
    }
  ]
}