{
  "content": [
    {
      "type": "text",
      "text": "# King Charles Club\n\nThe King Charles Club (KCC) is a dining society which recruits members exclusively from amongst St John's College, Oxford students.\nHistory\nIn 1636 King Charles I, for whom the Club is named, visited Oxford in order to mark the opening of the new quadrangle at St John's College, with a day of feasting and celebrations at the college.\nIn 1646, St John's College, which sympathised with the Royalists, acted as Prince Rupert of the Rhine's headquarters for his defence of the city of Oxford, and King Charles I, present in Oxford at the time, is believed to have taken refuge with his nephew at the college for a period of time. A possibly apocryphal story relating to these times is that the King treated Prince Rupert and 11 of his closest lieutenants to an especially opulent meal. The foundation of the Club is predicated upon this incident.\nPresent day\nThe society is still active, despite being banned from college grounds. \"Invitation-only\" by nature, the King Charles Club recruits solely from amongst members of St John's College. The club has certain traditions, including the laying of a wreath at Whitehall on the anniversary of the execution of Charles I.\nThe dinner traditionally celebrated after this event has in recent years been held at Stringfellows, Covent Garden. Peter Stringfellow was the honorary president until his death in 2018. The incongruity of an ancient dining society meeting in Stringfellows has resulted in popular commentary, including an editorial comment in The Daily Telegraph in February 2001.\nMembers\nThe Conservative politician Aidan Burley was president of the club during his time at St Johns. Other present or former members include Canadian Nobel Prize–winning politician Lester Pearson, and author and clergyman Fergus Butler-Gallie.\nThe Club colours, worn by members on Club apparel, are black, blue, and gold. Members wear a Club tie which is black with stripes of pacific blue edged with gold.\nSee also\n* List of University of Oxford dining clubs\nReferences"
    }
  ]
}