{
  "content": [
    {
      "type": "text",
      "text": "# Kings Highway North Historic District\n\n| locmapin     = Connecticut#USA\n| architect    = Cutler, Charles\n| architecture = Greek Revival, Federal, Colonial\n| added        = August 10, 1998\n| area         =\n| refnum       = 98000884\n}}\nThe Kings Highway North Historic District is a predominantly residential  historic district in Westport, Connecticut.  Located on the hillside west of the Saugatuck River, this area encapsulates architecturally several major stages in the community's development, from colonial days to the 20th century.  It was listed on the National Register of Historic Places in 1998.\nDescription and history\nThe Kings Highway North Historic District is located west of Westport's downtown area, just upland from the west bank of the Saugatuck River.  Its focus is a 2/3-mile stretch of Kings Highway North,  a roadway first laid out in 1672 to facilitate travel between New York City and Boston, Massachusetts.  It also extends along minor roads connecting this road section to the Boston Post Road (here United States Route 1), which runs nearer the river bank. In 1998, it included 106 contributing buildings including The Barn at Kings Highway, and four other contributing sites.\nThe district's architecture is main residential, and is reflective of three major episodes in Westport history.  The first is its colonial beginnings in the 18th century, reflected in the presence of early cemeteries, a small common area used historically as a militia training ground, and several 18th-century houses.  The second historic period is the 19th-century growth of Westport's west side as a center of maritime commerce, represented by mid-century Greek Revival architecture.  Late in the 19th century and into the early 20th century, Westport saw an influx of artists, some of whom resided in this area, either building new homes or refashioning existing buildings into then-popular styles.\nSee also\n*National Register of Historic Places listings in Fairfield County, Connecticut\nReferences"
    }
  ]
}