{
  "content": [
    {
      "type": "text",
      "text": "# King's Church\n\n}}\n'''King's Church''' is a notable example of the Gothic Revival style of Architecture, located in the Polwarth area of Edinburgh. Originally known as the St Peter's Free Church, and then Viewforth Church the building is prominently located on two principal streets in the Bruntsfield and Fountainbridge neighbourhoods, at the intersection of Viewforth and Gilmore Place.\nGeneral Description\nA square-plan neo-Gothic church with a 3-stage entrance tower, hall and offices, and a basement, the architectural historian John Gifford describes the plan as \"unexpectedly orthodox\". The principal elevation is aligned with Gilmore Place, which provides access to the main church building as well as the office and function areas.\nThe outside external elevations are of buff-coloured sandstone solid masonry construction, adorned with typical ecclesiastical architectural features including moulded capitels, long narrow lancets, chamfered reveals, an ornate rose window, arched windows and columns with moulded capitals.\nInternally, the layout is a T-plan interior typical of Presbyterian churches of this era, exhibiting a renewed emphasis on the pulpit as the focal centre around which the congregation assembled to hear the preaching. The interior  includes a timber U-plan gallery on the first floor, boasting a carved and paneled balustrade; this is supported by slender cast-iron columns with elaborate corinthian capitals, rising all the way to the main groin vault ceiling.  Amongst other features are a 20th century war memorial.\nThe church building, along with its boundary walls, gatepiers and railings, were category B listed by Historic Scotland in 1993.\nHistory\nThe building was erected 1871-72 at the peak of the Gothic Revival. Its design is by architect Frederick Thomas Pilkington, under the auspices of his Pilkington and Bell architectural firm.  Pilkington was a major proponent of the movement in Scotland and in particular its adaption to the needs of the Free Church of Scotland, with his other designs including the nearby Barclay Church (located further up along Viewforth).\nIt was commissioned, most likely by public subscription (as was common custom at the time), to accommodate a congregation over-flow from the nearby Fountainbridge Free Church, which under the ministry of Rev. John Morgan had grown to over 1,000-strong. The new church was named the St Peter’s Free Church, as attested by an 1876 Ordnance Survey map of the area, and lettering preserved in the metal latticework at the main door entry threshold. A side hall was later added to the main church building in 1877, followed by an ornate belfry replacing the previous simpler steeple in 1879.\nIn 1900 the church became part of the United Free Church of Scotland, when the majority of Free Church and United Presbyterian Church of Scotland congregations united.  The Rev. Morgan continued to lead it until his death in 1910. Following passage of the Church of Scotland Act 1921 and the Church of Scotland (Property and Endowments) Act 1925, in 1929 the Viewforth Church became a Church of Scotland congregation, when most United Free Church congregations joined that denomination.\nIn 1973 Viewforth-St Oswalds merged with St David’s Viewforth to become Viewforth (St David’s & St Oswalds) and a new minister was ordained and inducted to the united charge, which in 1981 which reverted to its original name ofViewforth Parish Church.  The St David's Viewforth buildings were sold to Newcastle Breweries, and demolished as part of the development of their McEwan’s Brewery at Fountainbridge; the entire Brewery site has in recent years itself been demolished and redeveloped forming the new Boroughmuir High School\nViewforth-St Oswald's was itself a product of the 1957 merger between St Oswald's Parish Church (located in nearby Montpelier Place) and Viewforth with both buildings remaining in use for worship until 1963, when the St Oswald's church and hall buildings were sold to the local Education Authority, for use as the Boroughmuir High School Annexe.  Since the 2018 move of the Boroughmuir High School into its new location, the St Oswald's buildings have been turned into the St. Oswald’s Centre community hub.\nThe belfry section of the steeple was removed in 1976 due to its precarious condition, leaving it with its current \"truncated\" look.\nIn 2009 the congregation combined with the nearby Church of Scotland Barclay Bruntsfield Church, moving into their premises to form the Barclay Viewforth Church. The following year the building was purchased by the King's Church Edinburgh, an evangelical church part of the Newfrontiers group of churches, which in 2022 celebrated its 20th year in the City of Edinburgh.\nNotes\nReferences\n*\nExternal links\n*  dated circa 1920-1930. [Prof. Francis M Chrystal Collection]"
    }
  ]
}