{
  "content": [
    {
      "type": "text",
      "text": "# King George (1781 ship)\n\n{|\nor 286, or 290, or 303 (bm)\n| Ship length =\n| Ship beam =\n| Ship draught =\n| Ship draft =\n| Ship hold depth =\n| Ship propulsion =\n| Ship sail plan =\n| Ship complement =*1793:45\n*1808:32\n| Ship armament =*1781:6 × 12-pounder + 10 × 9-pounder + 2 × 6-pounder guns\n*1793: 18 × 9-pounder guns + 6swivel guns\n*1805: 8 × 6-pounder + 8 × 9-pounder guns\n*1808: 2 × 6-pounder guns + 14 × 12-pounder carronades\n*1814: 2 × 6-pounder guns + 14 × 12-pounder carronades\n| Ship notes =\n}}\n|}\nKing George was launched on the Thames in 1781. She spent about three-quarters of her career sailing for the Hudson's Bay Company (HBC), and was the third vessel by her name to sail for the HBC. She then spent the last quarter of her career as a whaler in the British northern whale fishery. She foundered there without a trace in 1822.\nCareer\nKing George first appeared in ''Lloyd's Register (LR'') in 1781 with J[oseph] Richards, master, the Hudson's Bay Company, owners, and trade London–Hudson's Bay. From then through 1811 she sailed for the Hudson's Bay Company (HBC) under a variety of masters.\nOn 8 April 1793, shortly after the outbreak of war with France Captain John Richards acquired a letter of marque.  Captain Richards was dismissed the company's service on 18 February 1801, after he admitted to having smuggled furs, \"contrary to the Duty\" he owed the HBC.\nHis replacement was Captain John Turner, who had spent a decade as the captain of the HBC's .\nOn 2 May 1808 Captain John Tinner (or Turner), acquired a letter of marque. Also in 1808, the ice was the heaviest and closest it had been in 41 years.\nThe HBC sold King George in May 1811 to Daniel and Samuel Brent & Sons. The Brents chartered her back to the HBC for a period and later offered to sell her back to the company for £5,400, an offer the HBC declined.\nOn 18 August 1813 King George and  arrived at Hudson Bay.\nShe then became a Northern Fisheries whaler, possibly after the Brents sold her to Elvgin & Co.\n{| class=\" wikitable\"\n|-\n! Year\n! Master\n! Owner\n! Trade\n! Source\n|-\n| 1814\n| P.TurnerJ.Gordon\n| Brent\n| London–Davis Strait\n| Register of Shipping; large repair 1806\n|-\n|}\nOn 19 April 1814 ''Lloyd's List reported that King George, Gordon, master, had had to put into Aberdeen leaky while sailing to the whaling grounds at Davis Strait. Two American privateers, one of them , had chased her in.\nThe following data is from Coltish:\n{| class=\"wikitable\"\n|-\n! Year\n! Master\n! Where\n! Whales\n! Tuns whale oil\n|-\n| 1814\n| Gordon\n| Davis Strait\n| 3\n| 32\n|-\n| 1815\n| Patterson\n| Davis Strait\n| 14\n| 83\n|-\n| 1816\n| Patterson\n| Greenland\n| 23\n| 162\n|-\n| 1817\n| Patterson\n| Greenland\n| 14\n| 106\n|-\n| 1818\n| Patterson\n| Greenland\n| 9\n| 101\n|-\n| 1819\n| Patterson\n| Greenland\n| 22\n| 138\n|-\n|-\n| 1820\n| Patterson\n| Greenland\n| 15\n| 172\n|-\n| 1821\n| Patterson\n| Greenland\n| 6\n| 42\n|-\n| 1822\n| Proven\n| Davis Strait\n| 3\n| 0\n|}\nFate\nKing George, Proven, master, sailed from Gravesend on 4 April 1822 for Greenland. She was reported to have been there on 5 July with three fish.\nKing George'' was then presumed to have been lost with all hands in the Davis Strait.\nNotes\nCitations\nReferences\n*\n*\n*"
    }
  ]
}