{
  "content": [
    {
      "type": "text",
      "text": "# King Lot\n\nKing Lot , also spelled Loth or Lott (Lleu or Llew in Welsh), is a British monarch in Arthurian legend. He was introduced in Geoffrey of Monmouth's pseudohistorical Historia Regum Britanniae (c.  1136) as King Arthur's brother-in-law, who serves as regent of Britain between the reigns of Uther Pendragon and Arthur. He has appeared regularly in works of chivalric romance, alternating between the roles of Arthur's enemy and ally, and is often depicted as the ruler of Lothian and either Norway or Orkney. His literary character is probably derived from hagiographical material concerning Saint Kentigern, which features Leudonus as king of Leudonia (the Latin name for Lothian) and father of Saint Teneu.\nLot is generally portrayed as the husband of Arthur's sister or half-sister known by many names but most often as Anna, Gwyar, or variants of Morgause. The number and names of their children vary depending on the source, but usually they prominently include Gawain as well as other sons and sometimes daughters. Geoffrey suggests Lot was also the biological father of Mordred. The later prose romances identify him as the father of Gawain's younger brothers Agravain, Gaheris, and Gareth, while turning Mordred into an incestuous son of Arthur.\nOrigins\nA king of Lothian named Leudonus or Leudon of Leudonia can be found in both Latin and Welsh sources. A hagiography fragmentary, Vita Kentigerni, features Leudonus as the maternal grandfather of Saint Mungo (Kentigern). In this text, Leudonus has his daughter Teneu thrown from a cliff when he discovers that she had been raped and impregnated by Owain mab Urien. However, she survives the ordeal with divine protection and goes to Saint Serf's community, where she gives birth to Mungo. The story of Saint Mungo is placed around a century after the timeframe generally associated with Arthur. Welsh sources refer to Leudonus as Lewdwn or Llewdwn Lluydauc (\"L[l]ewdwn of the Host\") and make him king of the Gododdin people in the region of Hen Ogledd.\nGeoffrey of Monmouth seems to refer to this earlier figure in the king whom he called Lot or Loth in his early 12th-century manuscript Historia Regum Britanniae. His sources are obscure, but the choice of name is probably based on its similarity to \"Lodonesia\", a Latinized name for Lothian. This toponymical connection parallels Geoffrey's association of King Leir with Leicester and Coel with Colchester, as well as William of Malmesbury's assertion that Gawain was king of Galloway, following a common idea of medieval historiography that places took their names from people. An explicit connection between Leudonus and Geoffrey's Lot was made in 1521 in John Major's Historia Maioris Britanniae, which named Kentigern's mother as Thametes, the daughter of Lot and sister of Gawain.\nLlew ap Cynfarch (Lleu son of Cynfarch) shares his name with the figure Lleu Llaw Gyffes, probably a euhemerized deity known from the Four Branches of the Mabinogi, though the extent of this connection is conjectural. Lot was also identified with the Welsh mythology hero Lludd Llaw Eraint.\nThe name Lot may be connected to the Norse name Ljot, which appears in Norse sagas and was known in Orkney. The Old Norwegian name Ljot was common in the Galte clan, who ruled Orkney and parts of Scotland before the Sinclairs. In Hardanger, the Lothe family, close kin to the old Galte clan, also used a raven banner. Lot may also be linked to the Highland Scottish standing stone called the Stone Lud.\nArthuriana\nIn Historia Regum Britanniae, Lot is one of three brothers, each of whom rules a part of northern Britain: Lot rules Lodonesia and is the lord of Carlisle, while his brothers Urien (the father of Owain, both generally reckoned historical kings of Rheged) and Angusel rule over Mureif (Moray) and Scotland, respectively. Lot is first mentioned as a vassal to Uther Pendragon in the wars against Octa, the Saxon king of Kent. When Uther falls ill, he marries his daughter to Lot and entrusts the couple with control of the kingdom. Lot and Anna have two sons, Gawain and Mordred. When Arthur becomes king, he helps Lot and his brothers regain their territories, which have fallen to the Saxons. Lot is also the heir to the throne of Norway, as the nephew of its previous king, Sichelm. With Arthur's aid, he takes the kingdom from the usurper Riculf. Lot later leads one of Arthur's armies in his war against Emperor Lucius of Rome.\nIn the wake of Geoffrey, Lot entered into Welsh Arthurian tradition under the name Lleu or Llew. The Welsh Triads maintain Geoffrey's association between Lot and Urien as brothers, drawing Lot into the historical Urien's genealogical tradition as a son of Cynfarch and Nefyn, the daughter of Brychan Brycheiniog. His wife in Welsh literature is Arthur's sister Gwyar, mother of Gwalchmei (Gawain).\nEarly Arthurian works of chivalric romance, such as those of Chrétien de Troyes, often refer to Lot, but he rarely receives more than a mention in connection to his son Gawain. De Ortu Waluuanii and Les Enfances Gauvain tell of how the teenage Lot fell in love with Uther Pendragon's young daughter Anna while serving as her page. The story takes place during the time when he was a royal hostage at the court of Uther after the first British conquest of Norway. German stories by Wolfram von Eschenbach and Der Pleier give Gawain a brother, Beacurs (Beatus), and several sisters, including Cundrie (Gundrie), Itonje (Itoni), and Soredamor (Surdamur), born from Arthur's sister named Sangive or Seife. Some works, such as Sir Gawain and the Green Knight, feature Lot as a member of Arthur's court. In the Alliterative Morte Arthure and the Didot Perceval, Lot dies in Arthur's final battle against Mordred.\nLot takes a more prominent role in the cyclical narratives of the early 13th century. In these works he is the king of Lothian and Orkney, probably due to his earlier association with Norway. In the Lancelot-Grail prose cycle, Lot of Orcania (Orkney) is the son of Hedor (Hector), the king of Lothian, and an unnamed daughter of the king of Norgales (North Wales, possibly meaning Gwynedd). After Uther marries Igraine, he marries off the daughters from her first marriage to his political allies. Her oldest daughter, appearing under different names but best known as Morgause (possibly a variant of Morgan), is married to King Lot. He and Morgause have five sons: Gawain, Agravain, Gaheris, and Gareth, as well as Mordred (whose biological father is Arthur from an incestual relationship with his sister). Later, when the young Arthur comes to power, Lot raises an army in rebellion alongside his brothers and several other Brittonic kings. After Arthur defeats the rebel coalition at Bedegraine and helps fend off the Saxons, Lot becomes Arthur's ally.\nBeginning with the Prose Tristan, the Post-Vulgate Cycle offered a different version of Lot's story. As in the Lancelot-Grail cycle, Lot opposes Arthur until his defeat at Bedegraine. Afterward, Arthur hears a prophecy that a child born on May Day is destined to destroy him. Arthur gathers up all babies born around that time, including his own illegitimate son, Mordred, and puts them on a rudderless boat that sinks, and the children are believed to have all died. Lot, who believed Mordred to be one of his own sons, joins Arthur's enemy King Rience and resumes his campaign against Arthur. Eventually, he is killed in battle by King Pellinore enabled by the intervention of Merlin. Lot's death sparks a long blood feud between their families, leading to the revenge killings of Pellinore and most of his sons, as well as the murder of Lot's wife. This version of Lot's story was taken up by Thomas Malory for ''Le Morte d'Arthur'', in which Merlin notes Lot (originally Lote) of Orkney as Arthur's strongest early enemy and that Lot must be killed on the day of their battle for Arthur to live. The subsequent Lot-Pellinore clan feud arguably constitutes one of the three main plot strands of Malory's work (alongside the sacred Grail Quest and the relationship between Lancelot and Guinevere) and has appeared in a number of modern Arthurian works.\nWhile Lot's realm is usually placed south of Hadrian's Wall (in post-Roman Lothian), Scottish late-medieval chronicles, including Hector Boece's Historia Gentis Scotorum, cast him as both king of the Picts and a Pict himself. This association has carried on to some works of modern Arthurian legend.\nReferences\n;Bibliography\n*\n*\n*Sobecki, Sebastian I. [Ed.] (2007). The Scots and Medieval Arthurian Legend (Arthurian Studies No. 61). English Studies."
    }
  ]
}