{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom Coming\n\n\"Kingdom Coming\", or \"The Year of Jubilo\", is an American Civil War-era song written and composed by Henry Clay Work (1832–1884) in 1861. It was published by Root & Cady in 1862 and first advertised in April by the minstrel group Christy's Minstrels. Narrated by black slaves on a Confederate plantation, \"Kingdom Coming\" recounts their impending freedom after their master disguises himself as a contraband and flees to avoid being captured by Union troops. It is a minstrel song, written in African American Vernacular English, spoken by slaves, and intended to be performed by blackface troupes.\nWork was an avowed abolitionist and composed numerous pro-Union songs during the Civil War such as \"Marching Through Georgia\" (1865) and \"Babylon is Fallen\" (1863)—the sequel to \"Kingdom Coming\". The song portended the then-President Abraham Lincoln's issuing of the Emancipation Proclamation in 1863, an executive order liberating all slaves in Confederate-held territory.\n\"Kingdom Coming\" was one of the most successful Union songs, renowned as a favorite among black Unionists and minstrel troupes. It amassed sheet music sales of 75,000 copies. The publisher George Frederick Root claimed that it was his firm's most successful piece \"for nearly a year and a half\" and \"the most successful patriotic song in the West.\"\nBackground\nWork as a songwriter\nHenry Clay Work arose from a \"staunch abolitionist\" family. His father, Alanson, aided thousands of fugitives attain freedom through the Underground Railroad, on which his house was situated. Work spent much of his childhood among the freedmen and gradually learned their dialect and modes of entertainment. He actively heard their harrowing recollections of plantation life before absconding the South. These left a stirring impression on him; throughout the rest of his days, he remained deeply moved by the plight of African Americans. As an adult, Work would crusade for abolitionism by communicating the routine agonies of slave life through music. In fact, author Florine Thayer McCray remarks that many of his compositions evoke \"the very atmosphere of awakening plantation life\" and echo \"the cottonpicker's musing hum and the roustabout's refrain.\"   in 1868, who Work collaborated with throughout the Civil War.]]\nAfter the family was forced to migrate away from the railroad, he started laboring a music typesetter, first in his native Connecticut and, from 1855 onward, in Chicago. While Work did not mind his trade, his true passion and \"everyday thought\" was song. The American Civil War's outbreak in April 1861 provided these aspirations a suitable breeding ground. Music was the definitive propaganda tool to raise morale among troops. This called for the enlistment of passionate abolitionists into the songwriting industry. Seeking to advance his pastime into a full-time occupation, as well as to contribute to the Union cause, Work hiked up his songwriting efforts.\nA resident Chicagoan, he was drawn to local publishing firm Root & Cady, the \"most prolific producers of wartime music.\" Their collaboration proved one of the most fruitful in the war, during which the firm attained nigh unparalleled success. Work established himself as one of the Union's national composers whose music \"captured the spirit and struggle of the Civil War.\" His catalog of 27 patriotic songs issued from 1861 to 1865 includes seriocomedies, overviews of army life, commemorations of Northern triumphs and, uniquely, depictions of African Americans' struggles in the South.\nAfrican-American music of the Civil War\nin the 1840s, a pioneering minstrel troupe led by Dan Emmett.]]\nEver since the 1830s lower-class Northern theater had been dominated by troupes of blackface performers. Dressed in extravagant costumes and armed with banjos, they acted as caricatured African Americans reminiscing about their days in the agrarian South. The Romantic portrayal of Southern plantation life, with slaves and their owners residing harmoniously, gave uninformed Northern audiences a false impression of African Americans' toil in an era when slavery was growing into a dangerously divisive political issue. Stephen Foster idealized the South in his early compositions; \"Massa's in de Cold, Cold Ground\" (1852), featuring slaves lamenting their \"kind\" master's death, provides a clear example:\n|}}\n}}\n.|left]]\nWith African Americans stereotyped as blithe, docile servants, racism pervaded Northern society and shaped public attitudes. \"Kingdom Coming\" strays from the mockery of blackface minstrelsy, portraying a realistic picture of plantation life and humanizing slaves. Instead of the oppressive master reigning supreme over his subjects as generally observed in minstrel songs, these roles are inverted; the slaves take over the plantation and overcome their overseer. This role reversal is also observed in \"Babylon is Fallen\" (1863), in which the slaves exclaim: \"We will be de Massa, / He will be de servant.\"\nPrior to the Civil War, slaves turned to simple, sometimes comic, songs to lighten their labor. However, from 1861 onward African-American music took a new serious form, serving as a collective call for liberation. Negro spirituals such as \"Go Down Moses\", alluding to Israel's journey to freedom in the promised land in Exodus, consoled stifled African-American populations and rallied support for emancipation. Music was to remedy this dispirited attitude, rallying both White and Black soldiers around a collective struggle for liberty. Work spent innumerable hours among freedmen and gradually learned their dialect, which would later enhance his songwriting capability. His exposure to minstrelsy and African American performers also influenced his writing style and its authenticity to slaves' lifestyle and concerns.\nThe Emancipation Proclamation\nby W. Roberts. ]]\nThe storyline of \"Kingdom Coming\" portends the Emancipation Proclamation, an executive order issued in January 1863 by President Abraham Lincoln. It mandated that:\nRoot, along with other Illinoisan Unionists prominently appealed to President Lincoln to issue a degree of emancipation. After the Emancipation Proclamation was issued, on September 27, 1862, approximately 10,000 Chicagoans, accompanied by several musical societies such as Root & Cady, gathered at Bryan Hall and Court House Square to celebrate the occasion. \"Kingdom Coming\", which symbolized the proclamation's outcome, was one of the tunes chanted by the crowd.\nLyrical analysis\nThe song is pro-Unionist, and the lyrics are sung from the point of view of slaves (\"de darkeys\") in Confederate territory, who celebrate their impending freedom after their master flees the approach of Union military forces. The primary persona is a \"hypocritical and cowardly\" slave owner (\"de massa\"). They speculate on the future fate of the owner, whom they suspect will pretend to be a runaway slave in order to avoid capture. With their owner absent, the slaves revolt, locking their overseer in a cellar as retribution for his harsh treatment toward them. The slaves then celebrate their impending emancipation by Union soldiers by drinking their absent owner's cider and wine in his kitchen. (or use text and translation)\n{| cellpadding=5 style=\"margin:1em auto;\" |style=\"width: 6px;\"\n|-\n| ||}} |source=first stanza}}\n|\n|}\nSay, darkeys, hab you seen: the song is positioned as a single narrator/singer addressing a group of slaves. However, the dialect indicates that the narrator is also a slave, and the rest of the song indicates that the narrator is also present on the plantation. Is the narrator removed in some way from the audience? The third stanza in particular refers to the \"darkeys\" as \"they\" rather than \"we.\" Some modern renditions (e.g. Pete Seeger's) replace \"darkeys\" with \"brothers\" or even \"comrades,\" indicating group identification, while Bobby Horton's rendition uses \"black folks\" instead, leaving the ambiguity as to identification in place.\nde massa, wid the muffstash on his face: there is no indication anywhere in the song that there is more than one master. Therefore, the inclusion of a reference to the master's mustache indicates that he does not normally wear one. The mustache may be fake (though in this case, why \"the\" instead of \"a\"?), or it may have been (hastily?) grown for the occasion.\nhe seen a smoke, way up the ribber, whar de Linkum gumboats lay: suggesting a nearby battle between Union and Confederate forces, though whether this was precipitated by the arrival or the gunboats, or of challenging Confederate forces, or some other reason, is not clear.\n{| cellpadding=5 style=\"margin:1em auto;\" |style=\"width: 6px;\"\n|-\n| ||}} |source=chorus}}\n|\n|}\nDe massa run . . . de darkey stay: pointing out the total inversion of the normal order of things, where the master rules over his plantation and the slaves run away in pursuit of freedom elsewhere. For the narrator and his audience, the world has turned upside down.\nde kingdom comin': the Kingdom of God, God's direct rule on Earth, whose advent is prophesied by Jesus Christ as narrated in the Christian Gospels, when all wrongs will be righted and everything placed in proper order.\nde year ob Jubilo: the \"year of Jubilo [Jubilee]\" alludes to the biblical practice of freeing bondsmen every 50 years (delineated in Leviticus 25, OT), a lasting metaphor of liberation from oppression; to subordinated Blacks, it represents the end of their servitude. The scripture reads: \"The fiftieth year shall be a jubilee for you; do not sow and do not reap what grows of itself or harvest the untended vines. For it is a jubilee and is to be holy for you; eat only what is taken directly from the fields.\"\nThe law \"continues to stimulate models for liberation from oppressive forces, for reconciliation, and for new beginnings\". To subjugated Blacks it symbolized the end of their servitude.\n{| cellpadding=5 style=\"margin:1em auto;\" |style=\"width: 6px;\"\n|-\n| ||}} |source=second stanza}}\n|\n|}\n(analysis of the second stanza)\n{| cellpadding=5 style=\"margin:1em auto;\" |style=\"width: 6px;\"\n|-\n|\n|\n|}\n(analysis of the third stanza)\n{| cellpadding=5 style=\"margin:1em auto;\" |style=\"width: 4px;\"\n|-\n| ||}} |source=fourth stanza}}\n|\n|}\n(analysis of the fourth stanza)\nLegacy\nIn the Civil War\nrecording by Frank Crumit.]]\nRoot embarked on a pervasive advertising campaign to promote his compositions. \"Kingdom Coming\" was his first major song supporting this cause, published by Root in 1862. \"Kingdom Coming\" was first advertised by Christy's Minstrels in April 1862, and became instantly successful and a staple of any minstrel show's repertoire. Its sheet music sold 75,000 copies. Root & Cady reportedly could not keep up with orders for the song, with the publisher claiming: \"It is whistled, sung, hummed and instrumentalized everywhere, in fact it is one of the institutions of the day.\" It was a favorite among African American troops. It was reportedly as popular as \"Dixie's Land\" during the war and subsequent years.}}First advertised by Edwin P. Christy in April 1862, \"Kingdom Coming\" quickly became a linchpin of minstrel show repertoires. Convinced of its potential, the publisher George F. Root embarked on a widespread advertising campaign to promote the song. Such was its success that Root could not keep up with orders, claiming it to be his firm's most profitable composition \"for nearly a year and a half\" and \"the most successful patriotic song in the West.\" Within a few years, it sold 75,000 copies of sheet music. After the Emancipation Proclamation was issued, approximately 10,000 Chicagoans gathered at Clark Street to celebrate the occasion; \"Kingdom Coming\", symbolizing the proclamation's outcome, was one of the abolitionist songs chanted alongside \"John Brown's Body\". While time has not been kind with the song, up until the 19th century's close, it was reportedly as popular as \"Dixie\". Jerome Kern's 1921 Broadway musical Good Morning, Dearie and the 1944 film Meet Me in St. Louis prominently feature it.\nThe sequel \"Babylon is Fallen\"\nDue to the success of \"Kingdom Coming\", Work penned a sequel titled \"Babylon is Fallen\", in which the \"massa\" who \"went and run away\" enlisted in the Confederate Army. He was discovered by his former slaves and imprisoned. The title alludes to the Book of Revelation of the New Testament: \"Fallen, fallen is Babylon the great\" (14:8), referring to the downfall of despotism, appropriate for the slave master's demise.\nIn popular culture\nThe tune to \"Kingdom Coming\" features in several cartoons. Metro-Goldwyn-Mayer made use of it in The Three Little Pups, (with Droopy) and Billy Boy, as well as in Michael Lah's Blackboard Jumble and Sheep Wrecked. The piece is whistled throughout all four pictures by a dimwitted wolf character voiced by Daws Butler (using the same slow Southern drawl he would later employ for Huckleberry Hound). This wolf character has no official name, but is commonly referred to as \"Jubilo Wolf\", in reference to \"Year of Jubilo\". It also occasionally appears in Warner Bros. cartoons, such as being used throughout the 1938 Porky Pig cartoon Injun Trouble and its 1945 remake Wagon Heels, and the closing scenes of the 1945 Bugs Bunny cartoons The Unruly Hare and Hare Trigger.\nSome films exercise it. In The Telegraph Trail (1933), John Trent (John Wayne) whistles this tune. It is instrumental background music in The Horse Soldiers (1959) (also starring Wayne). In Meet Me in St. Louis (1944), Esther Smith (Judy Garland) sings new lyrics, written for the movie, to the tune of \"Year of Jubilo\". The lyrics are in standard English and are inoffensive, with no reference to slavery, the Civil War, or any other controversial subject.\nReferences\nCitations\nBibliography\nPrimary sources\n*\n*\n* }}\n*\nSecondary sources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nStudies and journals\n*\n*\n*\n* |url-access=subscription }}\n* |url-access=subscription }}\n*\n*\nNewspaper articles\n*\n* }}\n* }}\n* }}\n* }}\n* }}\n* }}\n* }}\n* }}\n* }}\n* }}\n* }}\n* }}\n* }}\nWebsites\n*}}\n*}}\n*}}\n*\n*}}\n*}}\nExternal links\nRecordings\n* [https://www.youtube.com/watch?v=fgD03MiI4kw Recording] by the 2nd South Carolina String Band on their 2000 album Hard Road\n* [https://www.youtube.com/watch?v=7KJqo1Ix1LQ Recording] by the 97th Regimental String Band on their 1990 album Battlefields and Campfires: Civil War Era Songs, Vol. I\n* [https://www.youtube.com/watch?v=xB6r86CoFbc Recording] by Califorf Jackson in the original vernacular lyrics on the 1990 album The Songs of the American Civil War\n* Brass [https://www.youtube.com/watch?v=01Pz3kjEG-w instrumental] arranged by Randy Edelman from the 1993 film Gettysburg\n* Piano [https://www.youtube.com/watch?v=NLe6mulpcas instrumental] arranged by \"Forte Republic\"\n* String [https://www.youtube.com/watch?v=edlIHLxL7Vk instrumental] arranged by Martin Jonas\nSheet music\n* [http://www.gutenberg.org/files/21566/21566-h/images/kingdom.pdf Sheet music] from Project Gutenberg\n* [https://sheetmusicsinger.com/highbrownsongs/kingdom-coming/ Original sheet music] from Sheet Music Singer"
    }
  ]
}