{
  "content": [
    {
      "type": "text",
      "text": "# King Scrub, Queensland\n\n| local_map           = yes\n| zoom                = 11\n| pop                 = 363\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4521\n| area                = 14.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 23.2\n| dir1                = NW\n| location1           = Bray Park\n| dist2               = 24.4\n| dir2                = NW\n| location2           = Strathpine\n| dist3               = 47.6\n| dir3                = NNW\n| location3           = Brisbane CBD\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Moreton Bay\n| stategov            = Pine Rivers\n| fedgov              = Dickson\n| near-n              = Ocean View\n| near-ne             = Ocean View\n| near-e              = Rush Creek\n| near-se             = Dayboro\n| near-s              = Dayboro\n| near-sw             = Mount Pleasant\n| near-w              = Mount Pleasant\n| near-nw             = Mount Pleasant\n}}\nKing Scrub is a rural locality in the City of Moreton Bay, Queensland, Australia. In the , King Scrub had a population of 363 people. It is located on the northern outskirts of Dayboro.\nGeography\nKing Scrub has some areas of rich farmlands which are now being developed as estates. Currently the most dominant estates are Avalon Downs and Park Lands estate. Both developed in early 2000.\nKing Scrub has a road which often floods called Fingerboard Road. This road is used by the local weather station as a flood indicator. Fingerboard Road is an important transport artery for residents in Mount Mee and beyond as it avoids going through the Dayboro town centre.\nBrisbane–Woodford Road (Mount Mee Road) runs through from south to north.\nHistory\nMayfield State School opened in 1910 and closed circa 1936. It was located on Mount Mee Road ().\nDemographics\nIn the , King Scrub recorded a population of 497 people, 49.1% female and 50.9% male. The median age of the King Scrub population was 39 years, 2 years above the national median of 37.  83.9% of people living in King Scrub were born in Australia. The other top responses for country of birth were England 6.5%, Canada 0.8%, Indonesia 0.8%, Jersey 0.6%, Ireland 0.6%. 95.4% of people spoke only English at home; the next most common languages were 0.6% Dutch, 0.6% French, 0% Welsh, 0% Irish, 0% Gaelic (Scotland).\nIn the , King Scrub had a population of 348 people.\nIn the , King Scrub had a population of 363 people.\nEducation\nThere are no schools in King Scrub. The nearest government primary school is Dayboro State School in neighbouring Dayboro to the south. The nearest government secondary school is Bray Park State High School in Bray Park to the south-east.\nReferences"
    }
  ]
}