{
  "content": [
    {
      "type": "text",
      "text": "# King William's Town (House of Assembly of South Africa constituency)\n\n|border=black}} (NP)\n|local_council_label =\n|local_council     =\n|parts_label       =\n|parts             =\n|previous          =\n|next              = Eastern Cape\n}}\n'''King William's Town''' was a constituency in the Cape Province of South Africa, which existed from 1910 to 1994. It covered a rural area of the Eastern Cape centred on its namesake town (since renamed Qonce). Throughout its existence it elected one member to the House of Assembly and one to the Cape Provincial Council.\nFranchise notes\nWhen the Union of South Africa was formed in 1910, the electoral qualifications in use in each pre-existing colony were kept in place. The Cape Colony had implemented a “colour-blind” franchise known as the Cape Qualified Franchise, which included all adult literate men owning more than £75 worth of property (controversially raised from £25 in 1892), and this initially remained in effect after the colony became the Cape Province. As of 1908, 22,784 out of 152,221 electors in the Cape Colony were “Native or Coloured”. Eligibility to serve in Parliament and the Provincial Council, however, was restricted to whites from 1910 onward.\nThe first challenge to the Cape Qualified Franchise came with the Women's Enfranchisement Act, 1930 and the Franchise Laws Amendment Act, 1931, which extended the vote to women and removed property qualifications for the white population only – non-white voters remained subject to the earlier restrictions. In 1936, the Representation of Natives Act removed all black voters from the common electoral roll and introduced three “Native Representative Members”, white MPs elected by the black voters of the province and meant to represent their interests in particular. A similar provision was made for Coloured voters with the Separate Representation of Voters Act, 1951, and although this law was challenged by the courts, it went into effect in time for the 1958 general election, which was thus held with all-white voter rolls for the first time in South African history. The all-white franchise would continue until the end of apartheid and the introduction of universal suffrage in 1994.\nHistory\nAs with much of the Eastern Cape, the electorate of King William’s Town was largely English-speaking and loyal to the pro-British side of South African politics, electing South African Party and United Party MPs consistently from 1921 until 1977. However, on the collapse of the UP, its more liberal successor parties did not find much favour with King William’s Town’s rural, conservative electorate. Instead, the seat became marginal between the governing National Party, which won it in 1977, and the New Republic Party, an English-speaking conservative opposition party based largely in neighbouring Natal. The NRP won King William’s Town in 1981 in a close contest, one of their few gains in that election and one of two seats ever held by the party outside Natal (the other being neighbouring East London North). In 1987, with the NRP in freefall, the NP retook King William’s Town, and held it until the end of apartheid.\nMembers\n{| class=\"wikitable\"\n|-\n!colspan=\"2\"|Election!!Member\n!Party\n|-\n|style=\"background-color: \" |\n|| 1910\n|rowspan=\"3\" | George Whitaker\n|rowspan=\"3\" | Independent\n|-\n|style=\"background-color: \" |\n|| 1915\n|-\n|style=\"background-color: \" |\n|| 1920\n|-\n|style=\"background-color: \" |\n|| 1921\n|rowspan=\"2\" | Robert Ballantine\n|rowspan=\"4\" | South African\n|-\n|style=\"background-color: \" |\n|| 1924\n|-\n|style=\"background-color: \" |\n|| 1929\n|rowspan=\"4\" | A. C. V. Baines\n|-\n|style=\"background-color: \" |\n|| 1933\n|-\n|style=\"background-color: \" |\n|| 1934\n|rowspan=\"11\" | United\n|-\n|style=\"background-color: \" |\n|| 1938\n|-\n|style=\"background-color: \" |\n|| 1941 by\n|rowspan=\"6\" | C. M. Warren\n|-\n|style=\"background-color: \" |\n|| 1943\n|-\n|style=\"background-color: \" |\n|| 1948\n|-\n|style=\"background-color: \" |\n|| 1953\n|-\n|style=\"background-color: \" |\n|| 1958\n|-\n|style=\"background-color: \" |\n|| 1961\n|-\n|style=\"background-color: \" |\n|| 1966\n| J. E. Lindsay\n|-\n|style=\"background-color: \" |\n|| 1970\n|rowspan=\"2\" | S. A. van der Heever\n|-\n|style=\"background-color: \" |\n|| 1974\n|-\n|style=\"background-color: \" |\n|| 1977\n| H. S. Coetzer\n| National\n|-\n|style=\"background-color: \" |\n|| 1981\n| P. R. C. Rogers\n| NRP\n|-\n|style=\"background-color: \" |\n|| 1987\n|rowspan=\"2\" | R. J. Radue\n|rowspan=\"2\" | National\n|-\n|style=\"background-color: \" |\n|| 1989\n|-\n|style=\"background-color: \" |\n|| 1994\n|colspan=\"2\" | constituency abolished\n|-\n|}\nDetailed results\nElections in the 1910s\nElections in the 1920s\nElections in the 1930s\nReferences"
    }
  ]
}