{
  "content": [
    {
      "type": "text",
      "text": "# King Standish\n\nKing Standish (a.k.a. Man of 1000 Faces) is a character in the DC Comics Universe. The character first appeared in Flash Comics #3 (March 1940) and was created by Gardner Fox and William Smith.\nFictional character biography\nWealthy, sophisticated King Standish was a master of disguise who wanted to stop crime. He was considered a criminal by both the police and the underworld, but he was a crime-fighter. He used hand-to-hand combat and occasionally guns. Over time, his reputation improved. King Standish always remained in disguise, allowing no one to know what he looked like. His actual face and name are never revealed. He wore a tuxedo, an opera cape, a top hat and a domino mask, whenever making an appearance not in disguise.\nHis most frequent adversary was the Witch who rivaled his ability to disguise himself. He finally convinced her to switch sides and help him in his fight against crime.\nDuring World War II, he was contacted by Control to become a member of the Office of Strategic Services (OSS), which he remained the war was over.\nLater, he helped the Justice Society of America when Jacob Tolzmann became a supernatural threat. With Sandman and the Star Spangled Kid knocked out, King teamed up with their sidekicks, Sandy and Stripesy. The King disguised himself as Tolzmann's father to distract him, allowing the sidekicks to defeat him.\nIn Justice Society of America (vol. 3) #29, a new recruit to the team, King Chimera, reveals a little bit about himself, saying his father was King Standish and that he met with a member of a secret order on a distant island to perfect the art of illusion. King Chimera mentioned his mother had a thing for older men, hinting that he was much older than she.\nKing Standish's current activities and whereabouts were not recorded.\nPowers and abilities\nKing Standish is a master of disguise, a master illusionist, and is a skilled hand-to-hand combatant.\nEquipment\nKing Standish has made occasional use of guns.\nIn other media\nKing Standish appears in the Stargirl episode \"Frenemies: Chapter Twelve - The Last Will and Testament of Sylvester Pemberton\", portrayed by Allen Andrews. This version is a socialite who was killed by the Ultra-Humanite via Delores Winters.\nReferences\nExternal links\n* [http://www.dcuguide.com/who.php?name=king The Unofficial King Biography]\n* [https://comicvine.gamespot.com/the-king/29-61635/ The King at Comic Vine]\n* [https://dc.fandom.com/wiki/King_Standish_(New_Earth) The King at DC Wikia]"
    }
  ]
}