{
  "content": [
    {
      "type": "text",
      "text": "# King Henry VIII School, Coventry\n\n| image_size              = 260px\n| coordinates             =\n| motto                   = Religioni et reipublicae\n(For religion and for public affairs)\n| established             =\n| closed                  =\n| type                    = Private day school\n| religion                = Church of England\n| president               =\n| head_label              =\n| head                    = Richard Sewell\n| r_head_label            =\n| r_head                  =\n| chair_label             =\n| chair                   = Coventry School Foundation\n| founder                 = John Hales\n| specialist              =\n| address                 = Warwick Road\n| city                    = Coventry\n| county                  = West Midlands\n| country                 = England\n| postcode                = CV3 6AQ\n| local_authority         = Coventry\n| dfeno                   = 331/6016\n| urn                     = 103750\n| staff                   =\n| enrolment               = 869\n| gender                  = Coeducational\n| lower_age               = 3\n| upper_age               = 18\n| houses                  = Hales'Holland'sSherwyn'sWhite's\n| publication             = The Arrow (Monthly)  The Coventrian (Annually)\n| free_label_2            = Former pupils\n| free_2                  = Old Coventrians\n| free_label_3            =\n| free_3                  =\n| website                 = http://www.kinghenrys.co.uk/\n}}\nKing Henry VIII School is a coeducational private day school located in Coventry, England, comprising a senior school (ages 11–18) and associated preparatory school (ages 3–11). The senior school has approximately 574 pupils (of which 167 are in the Sixth Form). The current senior school fees stand at £18,507 per year, with bursaries and scholarships available.\nHistory\nThe school was founded on 23 July 1545 by the Clerk of the Hanaper John Hales as the Free Grammar School under letters patent of King Henry VIII.  During the initial foundation of the school it was located in the Whitefriars' Monastery.  Nevertheless, due to religious differences, the school was relocated to the building of the former Saint John's Hospital in 1558, where it spent more than 300 years before moving to its present site on the south side of the city in 1885, a building there having been designed for it by Edward Burgess. Much of this original redbrick still stands despite Second World War damage, as well as many expansions.\nIn 1572 the school's administration was conveyed to Coventry Corporation after the school's founder, Hales, left land and other property to pay for \"the maintenance of one perpetual free school within the City of Coventry\".\nIn 1601, the school's library was established and maintained by the donations of affluent contributors.\nIn the 18th century the school experienced decline and struggle. Due to financial difficulties, the school was required to introduce fees to the students. In an attempt to deal with these struggles the School was divided into two departments: Classical and Commercial. The Commercial subjects were taught at the schoolroom and were greatest in demand, while the Classical subjects were taught in the library and were specifically aimed at boys willing to attend the university.\nIn 1878 the school was no longer a \"Free Grammar School\" and it became an independent institution after being under the administration of the corporation and the city authorities for 300 years. The old school premises were condemned and the new buildings, used at the present, were established on Warwick Road in 1885. Further improvements to the curriculum were also implemented and more subjects were introduced. By 1910 the number of pupils had increased. Over the next several years, the school continued to thrive and in 1926 the Preparatory classes were reinstated. By 1939 the number of boys in the school had grown from 94 in 1901 to approximately 500. The number of pupils continued to grow during the Second World War (1939–1945) with over 822 students in the school, 179 in the Junior division. Regardless of the damage caused by the bombings over Coventry, which diminished the school's library and other buildings, the school continued to expand and develop. Girls were first admitted to the school in 1975.\nThe school has faced multiple controversies since the late 1980s to the early 2020s; with a child having been expelled for engaging in pornography, teachers (including a former headteacher) convicted of possessing child pornography, a teacher convicted of criminal damage, students expelled for dealing drugs, allegations of sexism for requiring female students to dress \"like secretaries\" with \"many skirts cut above the knee\", and personal data having been stolen from the school's computer systems.\nIn October 2020, it was announced that the school would merge with Bablake School, with the combined school is set to open in September 2021. The proposed new school was initially named Coventry School, before backlash from parents and staff led to Bablake and King Henry VIII School being chosen. The plan was abandoned during the course of 2021, with the decision to share some facilities and teaching (particularly in the sixth form) between King Henry VIII School and Bablake School.\nIn December 2021, at the request of the Department for Education the school was subject to a regulatory compliance inspection, carried out by the Independent Schools Inspectorate. The report following this inspection found that the school did not meet compliance standards in five areas, relating to safeguarding; quality of leadership and management; supervision of pupils; teaching of RSE and PSHE; and the carrying out of required checks on staff employed. A subsequent monitoring inspection in September 2022, found that the school still did not meet all of the statutory regulations, finding that the standard was not met in three areas, relating to safeguarding; quality of leadership and management; and the carrying out of required checks on staff employed. In 2023, the school had recognised and addressed all these issues, according to a 2023 ISI inspection report.\nIn September 2022, the governors appointed Mr. Chris Staley as Principal and CEO for all the schools under their administration. This role is to provide overall responsibility for the strategic leadership, management and development of the Foundation and those schools that fall under its operational umbrella. The heads of each of the schools report to the Principal and CEO.\nIn late 2023, the ITV series Three Little Birds was filmed at the school.\nControversies\nDebee Ashby, a teenage glamour model was expelled from the school in 1983 after topless Page 3 pictures were published.\nFormer headmaster, Terence James Vardon, left his position after pleading guilty to three charges of possessing indecent images of children between 1989 and April 1999. In 1999, John Skermer, a senior teacher was also convicted of taking and possessing photographs of naked boys.\nA teacher at the school, James Anstice, admitted to a charge of causing criminal damage in 2004 costing £2,500 by destroying a nativity scene at Madame Tussauds featuring David and Victoria Beckham.\nIn 2012, two pupils were expelled over allegations they sold drugs to other children; three other students were suspended for a term.\nIn 2016, the school faced controversy after boys uniform included business suits whilst girls would have to dress \"like secretaries\" with \"many skirts cut above the knee\".\nIn March 2021, local press reported that the school's systems were infiltrated by an \"international cyber crime organisation known to the FBI\" and reported that \"the organisation responsible did post personal data stolen from the school's system online\".\nInspection reports by the Independent Schools Inspectorate in 2021 and 2022 found that the school failed to comply with a number of regulations including on safeguarding and vetting of staff on both inspections. A December 2021 report by the inspectorate found \"the school does not always act in the best interests of the child or in keeping with locally agreed inter-agency procedures. In particular, the school does not always liaise with and, when appropriate, make referrals to relevant external agencies when concerns about sexual harassment of pupils arise.\" A September 2022 report found \"procedures to check the suitability of staff do not yet meet requirements. Not all staff appointed since the previous inspection have been checked comprehensively before beginning work in the school.\" The school recognised these issues following these issues being corrected, was recognised in a 2023 ISI report as \"excellent\" in all areas showing adherence to ISI rules.\nFormer headmasters\n* Thomas Sherwyn BA (Oxon)\n* Leonard Cox BA (Cantab) MA (Oxon), 1572–1599\n* John Tovey MA (Oxon), 1599–1602\n* Jeremiah Arnold, MA (Oxon) MA (Cantab), 1602–1611\n* James Cranford, 1611–1627\n* Philemon Holland MD (Cantab) MA (Oxon), 1628–1629\n* Phineas White BA (Cantab), 1629–1651\n* Samuel Frankland MA (Cantab), 1651–1691\n* Samuel Carte MA (Oxon), 1691–1700\n* George Greenway, 1701–1717\n* Richard Marsden MA (Oxon), 1717–1718\n* Edward Jackson BA (Cantab), 1718–1758\n* Thomas Edwards DD (Cantab), 1758–1779\n* William Brooks MA (Oxon), 1779–1833\n* Thomas Sheepshanks MA (Cantab), 1834–1857\n* Henry Temple, 1857–1867\n* John Grover, 1867–1879\n* W.W. Sweet-Escott MA (Oxon), 1879–1889\n* C.R. Gilbert MA (Cantab), 1890–1906\n* A.D. Perrott MA (Cantab), 1906–1910\n* John Lupton MA (Cantab), 1910–1931\n* A.A.C. Burton MA (Oxon), 1931–1950\n* Herbert Walker BA (London), 1950–1974 (worked in postwar Germany engaged under Lord Annan in denazification of German Universities)\n* Roy Cooke MA (Oxon), 1974–1977\n* Rhidian James BA (Leeds), 1977–1994\n* Terence Vardon MA (Oxon), 1994–1999 (stood down after pleading guilty to possession of indecent images of children)\n* George Fisher MA (Oxon), 2000–2010\n* Jason Slack BSc (Dunelm), 2010–2020\n* Philip Dearden BA MA Ed, 2020–2025\n* Richard Sewell BA, 2025-\nAlumni\n* Debee Ashby, glamour model.\n* Terence Brain, Bishop of Salford.\n* Richard Baylie, President of St John's College, Oxford.\n* Paul Barnes, graphic designer and typographer.\n* Ralph Bathurst, Vice-Chancellor of Oxford University.\n* Colin Blakemore, author and scientist.\n* Harvey Brough, musician and composer.\n* Nicholas Bullen, musician, composer and writer, co-founder of Napalm Death.\n* Joseph Butterworth, English law bookseller.\n* Bob Carlton, composer of the rock musical Return to the Forbidden Planet.\n* Stephen T. Cobb, author, information security expert.\n* Andrew Copson, Chief Executive of Humanists UK and president of the International Humanist and Ethical Union.\n* Edward Thomas Copson, mathematician.\n* Jerry Dammers, musician. Founder Member of The Specials.\n* Peter Ho Davies, author.\n* Paul Daniel, conductor.\n* Alison Dougall, academic consultant in special care dentistry.\n* Sir William Dugdale, antiquary.\n* David Duckham, England international rugby player.\n* Omar Ebrahim, baritone vocalist and actor.\n* Jackie Fisher, 1st Baron Fisher, admiral in the Royal Navy.\n* Sir Frederick Gibberd, architect of Liverpool Metropolitan Cathedral.\n* Sir Leslie Gibson, KC, former Chief Justice of Trinidad, Palestine and Hong Kong.\n* Andy Goode, rugby player.\n* James Grindal, rugby player.\n* Roger Harrabin, BBC journalist and reporter.\n* Basil Heatley, marathon runner.\n* Ian Hobson, pianist.\n* Martin Jacques, journalist, writer and TV presenter.\n* Philip Larkin, Poet. Has a room, connected to the main school hall, named after him (Philip Larkin room).\n* John Wilfrid Linnett, chemist and Vice-Chancellor of Cambridge University.\n* Christopher Marshall (doctor), Professor of Cancer Biology, Institute of Cancer Research.\n* David McCutchion, Indophile academic.\n* Eric Malpass, novelist.\n* Simon Over, pianist and conductor\n* Robert Paterson, Bishop of Sodor and Man.\n* Arthur Samuel Peake, theologian and biblical scholar.\n* S. S. Prawer, Taylor Professor of German Emeritus, Oxford University.\n* Peter Preece, England international rugby player.\n* Professor Rebecca Probert, legal historian.\n* Peter Rossborough, England international rugby player.\n* John Sheepshanks, Bishop of Norwich.\n* J. B. Steane, teacher, literary scholar and music critic.\n* Michael Tooby, curator, Professor of Art & Design, Bath School of Art & Design, Bath Spa University since 2012\n* Humphrey Wanley, librarian, palaeographer and scholar of Old English.\n* Rear Admiral Anthony Whetstone CB, former Royal Navy officer who served as Flag Officer Sea Training.\n* Peter Whittingham, football player (Aston Villa FC, Cardiff City FC and England U21).\n* R. E. S. \"Bob\" Wyatt, England test cricketer.\nReferences\nExternal links\n* [http://www.kinghenrys.co.uk/ Official website of King Henry VIII School]\n* [http://www.isc.co.uk/schools/england/west-midlands/coventry/king-henry-viii Profile] on the ISC website\n* [http://www.coventryschoolfoundation.org/ Coventry School Foundation]\n* [http://www.schoolsguidebook.co.uk/schools/King_Henry_VIII_School.html Review at schoolsguidebook.co.uk]"
    }
  ]
}