{
  "content": [
    {
      "type": "text",
      "text": "# Kingda Ka__disambig_1\n\n| status               = Removed\n| opened               =\n| soft_opened          =\n| closed               =\n| year                 = 2005\n| cost                 = $25 million\n| type                 = Steel\n| type2                = Launched\n| manufacturer         = Intamin\n| designer             = Werner Stengel\n| model                = Accelerator Coaster\n| track                =\n| lift                 = Hydraulic launch\n| height_ft            = 456\n| drop_ft              = 418\n| length_ft            = 3118\n| speed_mph            = 128\n| inversions           = 0\n| duration             = 0:28\n| angle                = 90\n| capacity             = 1400\n| acceleration_from    = 0\n| acceleration_mph     = 128\n| acceleration_in      = 3.5\n| gforce               =\n| restriction_in       = 54-77\n| virtual_queue_name   = Flash Pass\n| virtual_queue_image  = Fastpass availability icon.svg\n| virtual_queue_status = was available\n| single_rider         =\n| theme                =\n| website              =\n| rcdb_number          = 2832\n| custom_label_1       = Trains\n| custom_value_1       = 4 trains with 5 cars each. Riders were seated 2 across in 2 rows, with only 1 row in the last car, for a total of 18 riders per train.\n| custom_label_2       =\n| custom_value_2       =\n| video                = Kingda Ka at Six Flags Great Adventure, New Jersey.webm\n}}\nKingda Ka was a hydraulically launched steel roller coaster located at Six Flags Great Adventure in Jackson, New Jersey, United States. Manufactured by Intamin and designed by Werner Stengel, Kingda Ka opened as the  in the world on May 21, 2005, surpassing Top Thrill Dragster. Although both featured similar designs, Kingda Ka's layout added an airtime hill on the return portion of the track. It was also the second strata coaster ever built, exceeding  in height.\nThe ride used a hydraulic launch mechanism to accelerate the train up to  in 3.5 seconds. While Formula Rossa at Ferrari World broke its speed record in 2010, Kingda Ka remained the tallest in the world throughout its operational life, featuring a   tower. It also featured the longest drop in the world with a drop length of .\nOn November 14, 2024, following months of rumors and speculation regarding the future of the attraction, Six Flags Great Adventure revealed that Kingda Ka had permanently closed. The ride was demolished and removed from the park on February 28, 2025.\nHistory\nAnnouncement\nOn September 29, 2004, it was announced that Kingda Ka would be added to the Six Flags Great Adventure amusement park in 2005. This announcement occurred at an event held for roller coaster enthusiasts and the media. The event revealed the park's goal to build \"the tallest and fastest roller coaster on earth\", reaching  and accelerating up to  in 3.5 seconds. The ride would be part of the Golden Kingdom, an  themed area being developed at Six Flags Great Adventure. Former Six Flags CEO Kieran Burke said: \"This is the first step in a process of really transforming Six Flags Great Adventure from the largest regional theme park in the world to a true regional destination.\"\nConstruction\nIntamin subcontracted Stakotra to assist with construction. On January 13, 2005, workers completed Kingda Ka's tower with a topping out ceremony. For the ceremony, one 50-story crane was used to hoist two workers to the top of the ride; another crane lifted a  steel beam, with an American flag, to the ride's pinnacle. The ride was still under construction when the park opened for the season in March 2005. The attraction was originally scheduled to open on April 23, 2005, but its opening was delayed to May 21, as the park stated that more time was needed to complete testing. A media event was held two days prior on May 19, 2005.\nOpening\nUpon its opening, Kingda Ka became the tallest and fastest roller coaster in the world, taking both world records from Top Thrill Dragster at Cedar Point. Intamin designed both of the roller coasters, and the two share a similar design and layout that differs primarily by the theme and the additional hill featured on Kingda Ka. Both rides were built by Stakotra and installed by Martin & Vleminckx. Though Kingda Ka was popular among both the general public and roller coaster enthusiasts, its use of relatively new technology meant that Six Flags Great Adventure had to hire a dedicated maintenance team for the ride. Because of maintenance issues, the ride was closed for almost two months during its first season due to a mechanical failure, and it was closed for an additional three weeks at the beginning of the 2006 season. Kingda Ka continued to be the world's fastest coaster until Formula Rossa at Ferrari World opened in November 2010.\nAddition of Zumanjaro\nOn August 29, 2013, Six Flags Great Adventure officially announced Zumanjaro: Drop of Doom for the 2014 season. The drop tower features three gondolas integrated into the existing structure of Kingda Ka which was also built by Intamin. Kingda Ka closed at the start of the 2014 season in order to begin construction, reopened on weekends on starting Memorial Day, and fully reopened when Zumanjaro was completed on July 4, 2014.\nClosure and demolition\nRumors began circulating in the summer of 2024 that Kingda Ka would be closed permanently, and that it could occur as early as the end of the 2024 season. Six Flags did not confirm or deny the rumors, and many enthusiasts from around the region visited the park to ride in anticipation they could be true. On November 14, 2024, a few days after the ride closed for the season, Six Flags Great Adventure confirmed that Kingda Ka had closed permanently and would be removed. In addition, the park also announced the removal of Zumanjaro, Green Lantern, the parachute drop ride, and Twister. Officials stated the rides were being removed to make way for future development, including a new \"multi-world-record-breaking launch roller coaster\" that was scheduled to debut in 2026.\nThe following month on December 18, 2024, the park applied for a work permit to demolish Kingda Ka and Zumanjaro. A project bid notice for \"demolition and controlled implosion\" of the ride was sent out soon after. Kingda Ka's demolition was initiated on January 20, 2025, beginning with the removal of its track. The top hat tower remained standing until its implosion on February 28, 2025, by Controlled Demolition, Inc. That July, the front car of one of Kingda Ka's trains was donated to the National Roller Coaster Museum and Archives, following a fundraising campaign. On July 28, 2025, the ride's replacement was delayed beyond 2026.\nRide experience\nQueue\nKingda Ka originally featured a detailed and elaborate queue line that ran between the launch and brakes of the coaster. Guests would enter the ride, then walk down a narrow pathway where they would eventually cross under the launch track. A themed tunnel was built where guests crossed under the launch to ensure safety. Guests would then enter a series of three switchbacks, with the third being underneath a permanent structure. This structure featured poles with detailed carvings of animals to help immerse guests into the Golden Kingdom. Following this final series of switchbacks, guests would approach the station, where the line would divide in two to equally fill both sides of the ride station. This queue was designed to handle the large crowds the park anticipated to accompany the ride. After an incident  in the ride's opening year that occurred right where guests crossed under the launch, the decision was made to not use this queue to ensure guest safety. From that point forward, the overflow queue would be used as the permanent queue, and parts of the original queue were still visible from Kingda Ka's station.\nGuests passed under the jungle-themed entrance sign and entered the queue line, which was surrounded by bamboo, which augments the jungle-themed music that played in the background. Throughout the queue, there were safety and warning signs about the ride. Following a long straight section, guests turned left and headed into a switchback section, which was followed by several curved paths before entering the station.\nLayout\nAfter the train had been locked and checked, it moved slowly out of the station to the launch area, then passed through a switch track which allowed four trains on two tracks to load simultaneously. When the signal was given to launch, the train rolled back slightly so that the catch car could latch on to the middle car, and the brakes retracted on the launch track. As the brake fins were retracting, a recording announced: \"Arms down, head back, hold on!\" The train was launched approximately five seconds later.\nWhen the train was in position, the hydraulic launch mechanism accelerated it from  in 3.5 seconds. The hydraulic launch motor was capable of producing 20,800 peak horsepower (15.5 MW). --> At the end of the launch track, the train climbed the main tower (top hat) and rolled 90 degrees to the right before reaching a height of . It then descended  straight down through a 270-degree, clockwise spiral. It climbed the second hill of , producing a moment of weightlessness before being smoothly brought to a stop by the magnetic brakes; it then made a left-hand U-turn and entered the station. The ride lasted 28 seconds from the start of the launch. The track measured about  long.\nTrains and station\nKingda Ka's four trains were color-coded for easy identification (green, dark blue, teal, and orange) and were numbered; the four colors were also used for the seats and restraints. Each train seated 18 people (two per row). The rear car had one row, while the rest had two. The rear row of each car was positioned higher than its front row for better visibility. Kingda Ka's over-the-shoulder restraint system consisted of a thick, rigid lap bar and two flexible over-the-shoulder restraints.\nKingda Ka's station had two parallel tracks with switch tracks at the entrance and exit. Each of the station's tracks is designed to accommodate two trains, so each of the four trains could be operated from its own station. Because all of Kingda Ka's trains were mechanically identical and able to load and unload at each of the four individual station bays, the original plan was for all trains to operate at the same time, and for each train to load and unload at its own station. Trains on one side would be loaded, while trains on the other side would be launched. An employee also directed riders in line to a particular side, where they could then choose to sit anywhere within the train.\nTheme\nKingda Ka was located in the jungle-themed area of the park known as The Golden Kingdom. The namesake for the ride was a Bengal tiger who resided in the nearby Temple of the Tiger attraction, an interactive exhibit that was closed in 2010.\nRollbacks\nA train may have occasionally experienced a rollback following a launch. A rollback occurs when the train fails to make it over the top of the tower and descends back down the side it was launched. Kingda Ka included retractable magnetic brakes on its launch track to prevent a train from rolling back all the way into the loading station (and potentially colliding with the next about-to-be-launched train).\nIncidents\n2005 bolt failure/launch cable damage\nOn June 8, 2005, a bolt failed inside a trough through which the launch cable travels. This caused the liner to come loose, creating friction on the cable and preventing the train from accelerating to the correct speed. The cable rubbing against the trough caused sparks and shards of metal to fly out from the bottom of the train. The ride was closed for almost two months following the incident. Damage occurred to the launch cable, which was frayed and required replacement, including minor damage to seals and brake fins. The incident caused stress on a number of fins, and Six Flags did not have enough replacement fins. Extra brake fins were ordered, and the ride had to undergo thorough testing following the repair. Kingda Ka reopened on August 4.\n2009 lightning strike\nKingda Ka was struck by lightning in May 2009 and suffered serious damage. The ride was closed for three months for repairs and reopened on August 21, 2009.\n2011 unknown damage\nOn August 27, 2011, Kingda Ka suffered unspecified damage shortly before Hurricane Irene, and Six Flags Great Adventure did not open. It is unknown whether additional damage occurred due to the storm, but the coaster was damaged to the extent that it could not run before Irene. The ride remained closed until the start of the 2012 operating season on April 5.\n2012 birdstrike\nShortly before 5:00p.m. on July 26, 2012, a young boy was sent to the hospital after suffering minor injuries from being struck by a bird during normal operation. The ride resumed normal operation shortly after the incident.\n2019 lawsuit\nIn 2019, a guest sued Six Flags and Intamin in U.S. federal court, claiming that tall riders could be subjected to \"extreme speed and torquing forces\" and that the harnesses could also cause injuries. According to the guest, he had suffered multiple back injuries after riding Kingda Ka in 2017. This guest was  tall, three inches below the ride's posted height limit of . Both Six Flags and Intamin filed a motion to dismiss the lawsuit, which was partially granted and partially denied in 2020.\nAwards\nRecords\n}}\n}}\n}}\nNotes\nReferences\nExternal links\n* [http://www.ultimaterollercoaster.com/themeparks/new05/kingdaka/ Kingda Ka Preview Article]"
    }
  ]
}