{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of Sekar\n\n| year_leader2           = Unknown–1899\n| leader2                = Pandai Congan\n| year_leader3           = 1899–1911\n| leader3                = Lakate Heremba (acting)\n| year_leader4           = 1911–1915\n| leader4                = Saban Pipi Rumagesan\n| year_leader5           = 1915–1942, 1946–unknown\n| leader5                = Machmud Singgirei Rumagesan\n| year_leader6           = unknown\n| leader6                = Amir Syahdan Rumagesan\n| year_leader7           = 2009–2019\n| leader7                = Rustuty Rumagesan\n| year_leader8           = 2019–present\n| leader8                = Arief Rumagesan\n| title_representative   =\n| year_representative1   =\n| representative1        =\n| year_representative2   =\n| representative2        =\n| year_representative3   =\n| representative3        =\n| year_representative4   =\n| representative4        =\n| title_deputy           =\n| year_deputy1           =\n| deputy1                =\n| year_deputy2           =\n| deputy2                =\n| year_deputy3           =\n| deputy3                =\n| year_deputy4           =\n| deputy4                =\n| type_house1            =\n| house1                 =\n| type_house2            =\n| house2                 =\n| event_pre              =\n| date_pre               =\n| event_start            =\n| date_start             =\n| event1                 =\n| date_event1            =\n| event2                 =\n| date_event2            =\n| event3                 =\n| date_event3            =\n| event4                 =\n| date_event4            =\n| event5                 =\n| date_event5            =\n| event_end              =\n| date_end               =\n| event_post             =\n| date_post              =\n| stat_area1             =\n| stat_area2             =\n| stat_area3             =\n| stat_area4             =\n| stat_area5             =\n| stat_year1             =\n| stat_year2             =\n| stat_year3             =\n| stat_year4             =\n| stat_year5             =\n| stat_pop1              =\n| stat_pop2              =\n| stat_pop3              =\n| stat_pop4              =\n| stat_pop5              =\n| p1                     =\n| s1                     =\n| flag_p1                =\n| image_p1               =\n| flag_p2                =\n| p2                     =\n| flag_p3                =\n| p3                     =\n| flag_p4                =\n| p4                     =\n| flag_p5                =\n| p5                     =\n| flag_s1                =\n| image_s1               =\n| flag_s2                =\n| s2                     =\n| flag_s3                =\n| s3                     =\n| flag_s4                =\n| s4                     =\n| flag_s5                =\n| s5                     =\n| today                  =\n}}\nThe Kingdom of Sekar, formerly called the Kingdom of Kabituwar, is one of the nine kingdoms that still exist in West Papua Province. The other eight kingdoms are Atiati, Patipi, Rumbati, Fatagar, Arguni, Wertuar, Namatota, and Komisi. This kingdom is located on the Onin Peninsula, Kokas district, Fakfak Regency, West Papua. In the early period, Sekar was a subordinate to the Kingdom of Rumbati, but later it was recognized as its own kingdom.\nHistory\nInitially, the Kingdom of Sekar was centered on the entrance of Sekar Bay, which was called Kabituwar. Therefore, the first king, Pandai alias Congan, held the title of King of Kabituwar. The Kokas area became a settlement for many traders from outside Papua, and later this settlement was named Sekar. In 1896, the Sultan of Tidore appointed a man from soa Beraweri, Mner, as the Kapiten king of the Sekar. This appointment was based on the Misool and Rumbati kings' suggestions. Thus, the authority of the Kapiten King of Sekar was separate from the authority of the King of Kabituwar. Mner then moved to Sekar and founded the village of Sekar. Mner's eldest son, Kubis, also received the title of Kapiten King of Sekar, but subsequent descendants no longer received this title.\nMeanwhile, before assuming the title of King of Kabituwar, Pandai was an unofficial commissioned king from the Kingdom of Rumbati. His father Paduri alias Weker also held this title. However, when Pandai died, no potential successors were considered. This was because Pandai had no siblings, and his only son, Abdulrachman, was still a child. As a result, the government of the Kabituwar kingdom was led by the rajamuda of Wertuwar named Lakate, who was Pandai's stepson. Pandai was married twice. His second wife, Badika, was previously the wife of the rajamuda of Wertuwar, Inisuka, who was Lakate's father. Lakate assumed his role as the King of Kabituwar, while Saban Pipi Rumagesan carried out the role of the rajamuda, although he was not officially appointed. Pipi himself was the son of Dimin, the adopted \"golden child\" of Paduri. According to the local custom, Dimin's descendants could not become a king because they did not have a kinship relationship with the previous kings.\nIn 1911, the Dutch colonial authorities did not find a qualified person to replace Lakate, so they intervened in the succession of the Kabituwar kingdom by appointing Pipi as the king with the title of King Sekar. His daughter had previously been married to Lakate. Due to Pipi's old age, his son Machmud Singgirei Rumagesan was appointed as the rajamuda to assist in governance. Pikpik, originally part of the Atiati kingdom, was transferred to Sekar.\nAround 1885, the king of Atiati appointed a local chief in Pikpik, intending to gain war support amidst threats between Rumbati on one side and Atiati and Fatagar on the other. This local chief was named Tatare and was given the title of king, although this title was not recognized by the Dutch government until his son Kauat was acknowledged as the Pikpik chief. However, through the Dutch intervention, all relations between Atiati and Pikpik were abolished, and Pikpik was annexed to the Kingdom of Sekar. It can be assumed that Kauat made several maneuvers to establish his own kingdom without being under Sekar. However, the desires of the Pikpik local chiefs were never supported by the Dutch colonial government. Based on practical considerations, Pikpik was within the jurisdiction of Sekar, although traditionally, the position of the Sekar king as the head of Pikpik was still debated. Some other areas that did not acknowledge the authority of the Sekar king at that time were Sisir and Ugar, which had their own royal lineages. However, the Dutch colonial government fully supported the authority of the Sekar king.\nMachmud Singgirei Rumagesan was appointed as king in 1915 and was officially recognized by the Dutch government. However, King Rumagesan often rebelled against the Dutch. His rebellion was sparked by a conflict with Colijn Company, an oil mining company operating in Kokas. In the early period, King Rumagesan and the local residents facilitated the company's operations in Kokas, so the company agreed to give him part of the wages to distribute to the people. However, a local assistant administrator demanded King Rumagesan return the money to him, but King Rumagesan refused. This Assistant Administrator reported to the Controleur van den Terwijk, who then engaged in a fight with King Rumagesan. The local residents supported King Rumagesan and nearly killed van den Terwijk. The rebellion escalated, prompting the colonial government based in Fakfak to send troops. Eventually, 73 local residents and 5 village chiefs were arrested and sentenced to 2–10 years in prison. Meanwhile, King Rumagesan was sentenced to 15 years in prison in Saparua, Maluku. While in prison, Rumagesan wrote a letter seeking help from Muhammad Husni Thamrin, a member of the Volksraad. Thamrin successfully brought Rumagesan's case to court, where it was proven that he was innocent, and he was released in 1941. Machmud Singgirei Rumagesan was later involved in several Indonesian resistance movements against the Dutch colonial rule in Papua.\nAfter Machmud Singgirei Rumagesan died, his son, Amir Syahdan Rumagesan, was enthroned as the King of Sekar. However, after Amir's death, a succession conflict occurred. As a result, Rustuty Rumagesan, Singgirei's descendant from a princess of Gowa, became the leader. However, Rustuty refused the title of king and took a middle way by assuming the title \"Ratu Petuanan Tanah Rata Kokoda.\" Rustuty married Sri Harijanto Tjitro Soeksoro, who was a nobleman descended from Mangkunegara III. After Rustuty's death, her uncle Arief Rumagesan, Singgirei's fifth-generation grandson, became the king with the title \"Raja Petuanan Pikpik Sekar.\"\nNotes\nReferences"
    }
  ]
}