{
  "content": [
    {
      "type": "text",
      "text": "# Kingston by Sea\n\n| population               =\n| shire_district           = Adur\n| region                   = South East England\n| shire_county             = West Sussex\n| constituency_westminster = East Worthing and Shoreham\n| post_town                = Shoreham-by-Sea\n| postcode_district        = BN43\n| postcode_area            = BN\n| dial_code                = 01273\n| static_image             = St Julian's Church, Kingston Buci (IoE Code 297311).jpg\n| static_image_caption     = St Julian's Church\n}}\nKingston by Sea, also known as Kingston Buci, Kingston Bucii or simply Kingston, is a small area in the Adur district of West Sussex, England. Although it is now part of a continuous urban area, its origins lay in an ancient village and parish church between Southwick to the east, Shoreham-by-Sea to the west and the mouth of the River Adur to the south.  St Julian's Church survives, and its parish perpetuates the ancient \"Kingston Buci\" name.\nName and etymology\nWhen the parish and its accompanying settlement were founded as part of an Anglo-Saxon estate within the Rape of Bramber, it was known as \"Kingston\". By the 14th century, the names \"Kingston by Shoreham\" and \"South Kingston\" had also been recorded, but in 1315 it took the name \"Kingston Bouci\" (later \"Kingston Buci\"), derived from the de Bouci or de Boucey surname of the lord of the manor.  Later, this surname became anglicised to Bowsey and the village name changed accordingly. In the 18th century this was assumed to mean \"by sea\", and the name \"Kingston by Sea\" became established. In the 20th century, the names \"Kingston by Sea\" and \"Kingston Buci\" have both been used. Adur District Council refers to \"Kingston Bucii\".\nNikolaus Pevsner suggested that the second element of the name derived from the French beau site, but other sources disagree with this.\nTwo other villages in the historic county of Sussex are called Kingston.  Kingston by Ferring (historically known as \"Kingston by Arundel\"), to the west, is also on the English Channel coast; and Kingston near Lewes (also known as West Kingston in medieval times) is to the east.  At various times, land in all three manors was held by the Earl of Arundel, and old sources sometimes fail to distinguish between the three settlements.\nHistory\nThe area was first settled during the Bronze Age and was also inhabited by Romans.  By the medieval period, Kingston was a large village whose nucleus was further south than the ancient settlement, which had been on the lower slopes of the South Downs. Its subsequent population decline, until increasing urbanisation absorbed it from the late 19th century onwards, may have been due to coastal erosion destroying houses and washing away roads.\nThe manor (originally called \"Kingston by Shoreham\", later \"Kingston Bowsey\"), in the Rape of Bramber, was held by the de Buci family at the time of the Domesday survey in 1086, and for several centuries afterwards, before descending through other families until the 20th century, when most of its land was sold for development.  The manor house was first described in the 14th century, but it was rebuilt in the 16th and 17th centuries. The present structure was built in the mid-18th century, but has been significantly altered since. It was sold for use as a school in the 1940s, and now houses Shoreham College, a private school. It is a Grade II listed building.\nBetween the mid-19th and mid-20th centuries, several stages of residential development caused Kingston-by-Sea to merge with Shoreham-by-Sea and Southwick.  This was encouraged by the opening of the railway line between Brighton and Shoreham-by-Sea in 1840, and the development of Shoreham Harbour around the mouth of the River Adur. A lighthouse was built on the sea front in 1846, aligned with the harbour entrance. At  high, its light is visible  out to sea.\nThe population of the parish rose from 46 in 1841 to 5,322 in 1951, and the area became almost completely urbanised—although areas of open land remain on the edge of the South Downs and around the St Julian's Church and the neighbouring Shoreham College. On 1 April 1974 the parish was abolished and became part of the unparished area of Shoreham by Sea.\nChurches\nSt Julian's Church, a Grade I-listed building with many structural elements from the 11th and 13th centuries, is Kingston by Sea's parish church.  (The official name of the parish is \"St Julian, Kingston Buci\", maintaining the old name.) It existed at the time of the Domesday survey, and received its dedication to Julian of Antioch in the 12th century. Some Norman parts remain, including the nave, but the church was rebuilt in the 13th century. The well-preserved remains of an anchorite's cell, a rare feature, are visible in the chancel wall.\nSt Giles' Church, formerly the chapel of the local workhouse, is also in the parish.  Built to a design by Lacy W. Ridge in 1906, it became a public place of worship in 1934. The former workhouse is now Southlands Hospital.\nReferences\nNotes\nBibliography\n*\n*\n*\nExternal links\n* [http://www.adur.gov.uk/ Adur District Council]\n* [http://www.british-history.ac.uk/report.aspx?compid=18236 British History Online]"
    }
  ]
}