{
  "content": [
    {
      "type": "text",
      "text": "# Kings of Pain\n\n}}\n| last_aired           =\n}}\nKings of Pain is an American television series that aired on the History Channel. The show features Adam Thorn, a wildlife biologist, and Rob \"Caveman\" Alleva, an animal handler. In the show, they attempt to get stung and bitten by animals from different parts of the world, in order to measure the amount of pain they each receive from each bite or sting.\nAmid speculation, the show was renewed and returned subsequently for season 2 on May 26, 2022.\nConcept\nInspired by the Schmidt Pain Index, biologist Adam Thorn and handler Rob \"Caveman\" Alleva test the bites and stings of animals with a new 30 point scale within 3 categories: intensity of initial physical pain, the duration of the pain, and the after effects or \"damage\". The scores from the three are rated from 1-10 (10 being worst) and then added together and averaged out.\nThe animal is then ranked among the scale using the honeybee sting as the baseline. Along with creatures from the Schmidt Pain Index, animals from other categories such as reptiles and marine animals are also tested. In addition to testing the bites and stings of animals, Thorn and Alleva have started another pain index which they call the \"nature hurts\" pain index, which is intended to measure the pain from hot peppers.\nEpisodes\n| end1       =\n| color2     = #B11302\n| link2      = #Season 2 (2022)\n| episodes2  = 10\n| start2     =\n| end2       =\n}}\nSeason 1 (2019–20)\n|ShortSummary    =\n| LineColor      = FDCE30\n}}\n|ShortSummary    =\n| LineColor      = FDCE30\n}}\n|ShortSummary    =\n| LineColor      = FDCE30\n}}\n|ShortSummary    =\n| LineColor      = FDCE30\n}}\n|ShortSummary    =\n| LineColor      = FDCE30\n}}\n|ShortSummary    =\n| LineColor      = FDCE30\n}}\n|ShortSummary    =\n| LineColor      = FDCE30\n}}\n|ShortSummary    =\n| LineColor      = FDCE30\n}}\n|episodes=\n|ShortSummary    =\n| LineColor      = B11302\n}}\n|ShortSummary    =\n| LineColor      = B11302\n}}\n|ShortSummary    =\n| LineColor      = B11302\n}}\n|ShortSummary    =\n| LineColor      = B11302\n}}\n|ShortSummary    =\n| LineColor      = B11302\n}}\n|ShortSummary    =\n| LineColor      = B11302\n}}\n|ShortSummary    =\n| LineColor      = B11302\n}}\n|ShortSummary    =\n| LineColor      = B11302\n}}\n|ShortSummary    =\n| LineColor      = B11302\n}}\n|ShortSummary    =\n| LineColor      = B11302\n}}\n}}\nReferences"
    }
  ]
}