{
  "content": [
    {
      "type": "text",
      "text": "# King James Only movement__disambig_1\n\nin the 1611 printing of the KJV.]]\nThe King James Only movement (also known as King James Onlyism or KJV Onlyism) asserts that the King James Version (KJV) of the Bible is superior to all other English translations of the Bible. Adherents of the movement, mostly certain Conservative Anabaptist, traditionalist Anglo-Catholic, Conservative Holiness Methodist, Primitive Baptist and Independent Baptist churches, believe that this text has been providentially preserved as a perfect translation of the Bible into English, or at least is the best translation of the Bible in English.\nMost radical factions argue that the King James translation itself was divinely inspired, superseding the original Greek itself. However other factions who follow the view of Edward Hills maintain that the KJV is not merely a translation of the Greek text, but an independent edition of the  in its own right, faithfully rendered in English and representing the most accurate expression of the  tradition. Others prefer the KJV simply because it is in the public domain in most countries (with the United Kingdom being a notable exception), which allows them to freely copy any amount of the translation without worrying about royalties or copyright.\nVariations\nChristian apologist James White has divided the King James Only movement into five main classifications:\n* \"I Like the KJV Best\"&nbsp;– Although White lists this point of view as a subdivision of the KJVO group, this is disputed by some. This group simply regards the KJV as a very good translation and prefers it over other translations because the church which they attend uses it, has always used it, or prefers its style, or the individual person uses it, or has always used it, or prefers its style.\n* \"The Textual Argument\"&nbsp;– This group believes that the KJV's Hebrew and Greek textual base is more accurate than the alternative texts used by newer translations. Many in this group might accept a modern Bible version based on the same Greek and Hebrew manuscripts which are used in the KJV. White claims that Zane C. Hodges was a member of this group. However, Hodges considered that the Majority Text \"corrects\" the Received Text (Byzantine priority), and this view is generally distinguished from the views of the  advocates.\n* \" Only\"/\"Received Text Only\"&nbsp;– This group holds the position that the traditional Greek texts represented in the  were supernaturally (or providentially) preserved and that other Greek manuscripts not used in this compilation may be flawed. The KJV is viewed as an exemplary English translation that is based on this Greek grouping of Bible manuscripts put together by Desiderius Erasmus, but it is also believed that other translations based on these texts have the potential to be of equal quality. The views of the Trinitarian Bible Society fit into this TRO division. The Trinitarian Bible Society does not believe that the Authorized Version (KJV) is a perfect translation, only that it is the best available translation in the English language. The Society believes this text is superior to the texts used by the United Bible Societies and other Bible publishers, which use texts that incorporate as their basis a relatively few manuscripts from the 4th century, and some going back to the early 2nd century.\n* \"The Inspired KJV Group\"&nbsp;– This faction believes that the KJV itself was divinely inspired. They view the translation to be an English preservation of the very words of God and that they are as accurate as the original Greek and Hebrew manuscripts found in its underlying texts. Often this group excludes other English versions based on the same manuscripts, claiming that the KJV is the only English Bible sanctioned by God and should never be changed. White believes most KJV-Onlyists would belong to this group.\n* \"The KJV As New Revelation\"&nbsp;– This group claims that the KJV is a \"new revelation\" or \"advanced revelation\" from God, and it should be the standard from which all other translations originate. Adherents to this belief may also believe that the original languages, Hebrew and Greek, have been corrected by the KJV and that the KJV should be followed if it differs from them. This view is often called \"Ruckmanism\" after Peter Ruckman, a staunch advocate of this view.\nThese classifications are not mutually exclusive, nor are they a comprehensive summary describing those who prefer the KJV. Douglas Wilson, for instance, argues that the KJV (or, in his preferred terminology, the Authorized Version) is superior because of its manuscript tradition, its translational philosophy (with updates to the language being regularly necessary), and its ecclesiastical authority, having been created by the church and authorized for use in the church.\nHistory\nEarly views\nControversy surrounding the  already occurred in the early 18th century, as John Mill (1645–1707) collated textual variants from 82 Greek manuscripts. In his  (Oxford 1707) he reprinted the unchanged text of the , but in the index he enumerated 30,000 textual variants. After Mill published his edition, Daniel Whitby (1638–1725) criticized his work, stating that the text of the New Testament had never been corrupted and he effectively equated the autographs with the . He regarded the 30,000 variants in Mill’s edition as a threat to Holy Scripture and called for the defense of the  against these variants.\nThe exclusive use of the King James Version is recorded in a statement made by the Tennessee Association of Baptists in 1817, stating \"We believe that any person, either in a public or private capacity who would adhere to, or propagate any alteration of the New Testament contrary to that already translated by order of King James the 1st, that is now in common use, ought not to be encouraged but agreeable to the Apostles words to mark such and have no fellowship with them\".\nSome contentious  variants such as the Johannine Comma were also explicitly defended by authors such as Matthew Henry (1662–1714), John Gill (1697 – 1771), and John Brown (1722 – 1787), whose arguments influenced modern  primacist authors.\nBackground\nThe  and the King James Version were defended by John William Burgon (1813–1888) in his The Revision Revised (1881) and also by Edward Miller in A Guide to the Textual Criticism of the New Testament (1886). Burgon supported his arguments with the opinion that the Codex Alexandrinus and Codex Ephraemi were older than the Sinaiticus and the Vaticanus; and also that the Peshitta translation into Syriac (which supports the Byzantine Text) originated in the 2nd century. Miller's arguments in favour of readings in the  were of the same kind. However, despite defending the Authorised Version and the , both Burgon and Miller believed that although the  was to be preferred to the Alexandrian Text, it still required to be corrected in certain readings against the manuscript tradition of the Byzantine text (thus advocating the Byzantine priority theory).\nIn that judgement, they are criticised by Edward F. Hills, who argues that the principle that God provides truth through scriptural revelation also must imply that God must ensure a preserved transmission of the correct revealed text, continuing into the Reformation era of biblical translation and printing. For Hills, the task of biblical scholarship is to identify the particular line of preserved transmission through which God is acting; a line that he sees in the specific succession of manuscript copying, textual correction and printing, which culminated in the  and the King James Bible. Hills argues that the principle of providentially-preserved transmission guarantees that the printed  must be the closest text to the Greek autographs and so he rejects readings in the Byzantine Majority Text where they are not maintained in the . He goes so far as to conclude that Erasmus must have been providentially guided when he introduced Latin Vulgate readings into his Greek text; and even argues for the authenticity of the Comma Johanneum. As to the relationship of the King James Bible to the , Hills argued that the King James Version is not merely a translation of the , but an independent variety of the  tradition. The view of the supremacy of the  was also defended by the Lutheran Theodore Letis, but rather on grounds of the authority of the institutional church.\nAnother known defender of the King James Only movement was Benjamin G. Wilkinson (1872–1968), a Seventh-day Adventist missionary, theology professor and college president, who wrote Our Authorized Bible Vindicated (1930) in which he asserted that some of the new versions of the Bible came from manuscripts with corruptions introduced into the Septuagint by Origen and manuscripts with deletions and changes from corrupted Alexandrian text. He criticized Westcott and Hort, believing they intentionally rejected the use of the  and made changes to the text used in translation using their revised Greek text based mainly on the Codex Vaticanus and Codex Sinaiticus. Gail Riplinger (born 1947) has also addressed the issue of differences in current editions of the King James Bible in some detail. A lengthy critical review of her book New Age Bible Versions, originally published in Cornerstone magazine in 1994, authored by Bob and Gretchen Passantino of Answers in Action, described the book as \"erroneous, sensationalistic, misrepresentative, inaccurate, and logically indefensible\". King James Onlyism has been taught by many earlier Independent Baptists such as Jack Hyles (1926–2001), who argued that the King James Version has preserved the word of God perfectly. Another Independent Baptist, Jack Chick (1924–2016), who was best known for his comic tracts, advocated a King James Only position. His comic Sabotage portrayed a Christian whose faith was shipwrecked by the rejection of the King James Version as the Word of God, only to be rescued by another character's defense of the King James Version.\nDuring this time, a more radical form of King James Onlyism emerged through the teachings of Independent Baptist minister Peter Ruckman (1921–2016). Unlike more moderate King James advocates, Ruckman advanced the idea that the 1611 King James Version actually constituted a form of \"new revelation\" from God. He maintained that the KJV was superior even to the original Hebrew and Greek manuscripts, claiming that where the underlying texts included any unclarities, the English of the King James Bible could correct or clarify them. In his view, the KJV had been more than divinely preserved, but rather improved from the originals and was thus not only inerrant but also surpassing the original autographs themselves in accuracy.  This position began to be named \"Ruckmanism\", due to the association with his teaching. However, in stark contrast, John R. Rice (1895–1980), despite being an independent Baptist, in his critique of Peter Ruckman's radical form of King James Onlyism argued that the King James Version (although preferable to the American Standard Version) is still not perfect. This view has also been rejected by modern King James Only advocates such as David W. Cloud, arguing that while God has providentially preserved the Bible in the King James Version, inspiration applied only to the autographs.\nModern advocates\nA preference for the King James Version and the  is today most common among Independent Baptist congregations. However, it is also taught by Primitive Baptists alongside by some within conservative forms of Laestadianism, Anabaptism, Methodism, Pentecostalism. Such views are also held by a few groups often regarded unorthodox such as the New Independent Fundamentalist Baptist movement, started by Steven Anderson and the Alamo Christian Foundation. Alongside this, among some Presbyterians and Reformed Baptists, a form of  onlyism is taught by advocates of \"confessional bibliology\". However, this view places more emphasis on the  tradition than the King James Version itself.\nThe Church Polity of the Dunkard Brethren Church, a Conservative Anabaptist denomination in the Schwarzenau Brethren tradition, states: \"To aid in Scripture memorization among our members and our children, to help avoid confusion and to promote sound doctrine in our services, the Authorized King James Version of the Bible shall be used in our Sunday School, Bible Study, and church services. Exceptions may be made where languages other than English are necessary.\" The Apostolic Christian Church, a Conservative Anabaptist denomination, uses the King James Version of the Bible.\nThe Southern Methodist Church holds the King James Version of the Bible to be a \"trustworthy standard to preach from the pulpit.\" The 2015 Manual of the Bible Missionary Church, a Methodist denomination in the conservative holiness movement, states: \"We wholeheartedly endorse the use of the Authorized Version (King James Version) of the Bible as the final authority in our English-speaking churches and schools. We also go on record as being opposed to the Revised Standard Version of the Bible, The Living Bible, the New English Translation of the Bible, the Reader's Digest Condensed Version, the New International Version and the public use of other modern versions.\" The Immanuel Missionary Church likewise enjoins use of the King James Version of the Bible. The King James Version of the Bible is used exclusively by the Apostolic Faith Church, a Holiness Pentecostal denomination. Agapé Boarding School in Missouri endorsed the King James Only position. One student said that when he first arrived at the school, he was strip-searched and his Bible was thrown in the trash because it was not a KJV.\nAmong others, the exclusive use of the King James Version is also endorsed by the Florida Bible College of Tampa (which has been a major institution to promote Free Grace theology), writing on their statement: \"Although we do not believe the translators of the Authorized King James Bible were inspired, we do believe that the Authorized King James Version, based upon the , is the best translation. Therefore, the Authorized King James Bible shall be the Bible used by Florida Bible College of Tampa.\"\nThe  primacist view has been majorly defended by the Trinitarian Bible Society which was formed in the 1800s. The Trinitarian Bible Society has been associated with the King James Only movement, due to its exclusive sales of the KJV Bible in English and number of articles defending the KJV and against other modern versions such as the NASB, NIV, ESV, and NKJV. However, the Society stated \"The Trinitarian Bible Society does not believe the Authorised Version to be a perfect translation, only that it is the best available translation in the English language.\"\nBeliefs\nDoctrine of preservation\nThose who advocate for the exclusive use of the  and the King James Version often do so on the basis of a theological commitment to the doctrine of verbal plenary preservation. This view holds that God has not merely inspired the original autographs of Scripture but has also preserved every word of the Bible in its pure form through a specific textual tradition, as represented in the . Proponents of this perspective frequently argue that the modern critical text reflects an overreliance on human reason and scholarly reconstruction rather than divine preservation.\n.]]\nTo argue for this position, those who prefer the King James version often appeal to a number of passages in the Bible which they see as affirming the divine promise of perfect textual preservation. Some among these are Psalm 12:6–7: \"The words of the Lord are pure words: as silver tried in a furnace of earth, purified seven times. Thou shalt keep them, O Lord, thou shalt preserve them from this generation for ever.\", Psalm 119:89: \"For ever, O Lord, thy word is settled in heaven\", Matthew 5:18: \"For verily I say unto you, Till heaven and earth pass, one jot or one tittle shall in no wise pass from the law, till all be fulfilled.\", Psalm 117:2: \" For his merciful kindness is great toward us: and the truth of the Lord endureth for ever. Praise ye the Lord\", Matthew 24:35: \"Heaven and earth shall pass away, but my words shall not pass away.\", and 1 Peter 1:25: \"But the word of the Lord endureth for ever. And this is the word which by the gospel is preached unto you.\". These verses are often cited by proponents of the  as scriptural support for the doctrine of divine preservation, believing that these verses teach God has preserved his word intact through all generations, not just in meaning or in a general sense but in every word and detail.\nThese interpretations of these multiple verses, however, has been challenged by critics of the  who often assert that these scriptural passages pertain either to God's oral communication with humanity rather than the written scriptures or to a more general preservation in the New Testament manuscripts as a whole.\nByzantine text-type\nThe advocates of the  and the King James Version often prefer the Byzantine text-type, often arguing that the numerical superiority of the Byzantine text-tradition should give it more weight despite the later age of many of the Byzantine manuscripts. However, this approach differs from that of Byzantine priorists like Zane Hodges, who supported the broader use of the Byzantine text-type more broadly than the . Hodges even produced his own edition of the New Testament based on textual-critical methods within the Byzantine tradition. While advocates of the  also prefer the Byzantine text-type, they fundamentally reject modern textual critical method, especially its denial of plenary verbal preservation, arguing that variants like the Johannine Comma (1 John 5:7), though found in only a minority of Byzantine manuscripts, should be regarded as authoritative because of their long-established usage in the Christian church and their presence in a number of relatively early Latin manuscripts. Thus,  primacists often borrow the arguments of earlier writers such as Matthew Henry and Robert Lewis Dabney for the inclusion of such verses, such as claiming that the comma was lost by an occurrence of a homeoteleuton or by purpseful exclusion by antitrinitarian copyists.|Trevin Wax}}\nNotable individuals associated with the different types of King James Onlyism\nIn the modern day, multiple individuals have advocated for the primary or exclusive use of the King James version, these include the following:\n* M. R. DeHaan\n* Ian Paisley\n* Carl McIntire\n* Kent Hovind\n* Dave Hunt (Christian apologist)\n* Jack Hyles\n* Texe Marrs\n* Michael Pearl\n* Peter Ruckman\n* Shelton Smith\n* Brother Stair\n* Jimmy Swaggart\n* Steven Anderson\n* Lester Roloff\n* Gerardus D. Bouw\n* Paul Chappell\n* R. L. Hymers Jr.\n* Jack Chick\n* Gail Riplinger\n* Douglas Wilson\n* Clarence Sexton\nSee also\n* Bible translations\n* Bible version debate\n* Biblical canon\n* Biblical criticism\n* Biblical infallibility\n* Biblical inerrancy\n* Biblical literalism\n* Douay-Rheims Only movement\n* Historicity of the Bible\n* List of English Bible translations\n* Textual variants in the New Testament\n* List of New Testament verses not included in modern English translations\n* Modern English Bible translations\n* Sola scriptura\n* Textual criticism\n* Verbal plenary preservation\n* Byzantine Priority Theory\nReferences\nBibliography\n* .\n* .\nFurther reading\n*\n*\n*\n*\n*\n*\n* Hillis, Edward F. (1973). The King James Version Defended. Des Moines, IA: Christian Research Press.\n*\n*\n*\n*\n*\nExternal links\n* [https://books.google.com/books?id=SF1CAQAAMAAJ The Holy Bible: An Exact Reprint Page for Page of the Authorized Version Published in the Year MDCXI]. Oxford: The University Press, 1833, \"a scrupulous original-spelling, page-for-page, and line-for-line reprint of the 1611 edition (including all chapter headings, marginalia, and original italicization, but with Roman type substituted for the black letter of the original)\". Complete PDF of the original book."
    }
  ]
}