{
  "content": [
    {
      "type": "text",
      "text": "# Kingston Fossil Plant coal fly ash slurry spill\n\n| venue                    =\n| location                 = Kingston Fossil Plant, Kingston, Roane County, Tennessee, United States\n| coordinates              =\n| also_known_as            =\n| type                     = Coal ash spill\n| theme                    =\n| cause                    = Dike breach at coal ash storage pond\n| outcome                  =  released\n| casualties1              = *No reported injuries or deaths from initial spill.\n*~40 deaths and 250+ illnesses related to cleanup.\n| reported injuries        =\n| reported property damage =\n| inquest                  =\n| charges                  =\n| trial                    =\n| verdict                  =\n| convictions              =\n| sentence                 =\n| publication_bans         =\n| litigation               =\n| awards                   =\n| url                      =\n| blank_label              =\n| blank1_label             =\n| blank2_label             =\n| website                  =\n| notes                    =\n}}\nThe Kingston Fossil Plant Spill was an environmental and industrial disaster that occurred on December 22, 2008, when a dike ruptured at a coal ash pond at the Tennessee Valley Authority's Kingston Fossil Plant in Roane County, Tennessee, releasing  of coal fly ash slurry. The coal-fired power plant, located across the Clinch River from the city of Kingston, used a series of ponds to store and dewater the fly ash, a byproduct of coal combustion. The spill released a slurry of fly ash and water which traveled across the Emory River and its Swan Pond embayment onto the opposite shore, covering up to  of the surrounding land. The spill damaged multiple homes and flowed into nearby waterways including the Emory River and Clinch River, both tributaries of the Tennessee River. It was the largest industrial spill in United States history.\nThe initial spill, which resulted in millions of dollars' worth of property damages and rendered many properties uninhabitable, cost TVA more than $1&nbsp;billion to clean up and was declared complete in 2015. TVA was found liable for the spill in August 2012 by the U.S. District Court for the Eastern District of Tennessee. The initial spill resulted in no injuries or deaths, but several of the employees of an engineering firm hired by TVA to clean up the spill developed illnesses, including brain cancer, lung cancer, and leukemia, as a result of exposure to the toxic coal ash, and more than 30 had died within 10 years of the spill. In November 2018, a federal jury ruled that the contractor did not properly inform the workers about the dangers of exposure to coal ash and had failed to provide them with necessary personal protective equipment. After rejecting multiple offers, workers reached a settlement with the contractor in May 2023.\nBackground\nThe Kingston Fossil Plant is located on a peninsula at the junction of the Emory River (to the north) and Clinch River (to the south and east), just over  upstream from the latter's mouth along the Tennessee River. Watts Bar Dam, located along the Tennessee  downstream from the mouth of the Clinch, impounds a reservoir (Watts Bar Lake) that spans a  stretch of the Tennessee (to Fort Loudoun Dam), the lower  of the Clinch (to Melton Hill Dam), and the lower  of the Emory. The plant, originally known as the Kingston Steam Plant, began operations in 1954, primarily to provide electricity to atomic energy installations at nearby Oak Ridge. The plant contains nine units with a combined generating capacity of 1,398 megawatts and burns about 14,000 tonnes of coal every day. It was the largest coal-fired power plant in the world when it was completed.\nThe plant's ash pond disposal area is located immediately north of the plant along the Emory River shore and was subdivided into three separate sections—the main ash pond, stilling pond, and dewatering pond—for the different steps of the disposal process. The entire ash pond was impounded by a dike that rose  above the winter level and  above sea level. Fly ash is the fine particulate matter produced by the combustion of coal, which is collected rather than allowing it to escape into the atmosphere. Once ash collection is complete in the wet disposal method, it is mixed with water and pumped into a retaining pond, known as the main ash pond at the Kingston Plant, where the ash gradually settled to the bottom. Once the particulate matter settled out, the water was pumped to the stilling pond, where the remaining solids settled, and the ash was dredged and moved to drying cells in the  unlined above-ground dewatering pond, also known as the solid waste containment pond, where the spill took place. At the time of the spill, the dredge cells contained a watery slurry of fly ash generated by the burning of finely ground coal at the power plant.\nTVA had reportedly known about the dangers of using wet storage ponds for coal ash since a 1969 spill in Virginia in which coal ash seeped into the Clinch River and killed large numbers of fish. TVA officials were also confirmed to have been aware of the toxicity of coal ash as early as 1981. In the 1980s, TVA engineers raised concerns about the stability of ash ponds. The utility repeatedly found leaks in levees and seepage in the soil at many of their ash ponds, including the ones at Kingston. However, TVA continued to make small repairs instead of switch to dry storage systems in an effort to reduce costs. At the time of the disaster, TVA was using wet storage at six of their 11 coal-fired power plants.\nLeaks at the Kingston ash ponds had reportedly been taking place since the early 1980s, and local residents said that the spill was not a unique occurrence. The 1960s-era pond had been observed leaking and being repaired nearly every year since 2001. The two worst leaks occurred in 2003 and 2006 in which TVA suspended all ash deposits in the ponds to allow the dredge cells to dry out and stabilize. An October 2008 inspection report had identified a small leak in the faulty wall, but the report was not yet complete at the time of the spill.\nEvent\nDike breach and spill\nThe spill began sometime between midnight and 1 a.m. Eastern Standard Time on December 22, 2008, when the dike surrounding the ash containment dewatering pond broke. The breach occurred at the northwest corner of the dewatering pond, overlooking the Swan Pond Creek spillway. The spill consisted of an initial large wave which lasted for approximately one minute, followed by a series of smaller consecutive waves of breaking away and sliding that occurred over a period of approximately one hour.\nTVA and the Environmental Protection Agency (EPA) initially estimated that the spill released  of sludge, which is gray in color. After an aerial survey, the official estimate was more than tripled to  on December 25, 2008.\nEffects\nThe spill covered surrounding land with up to  of sludge. Although the land surrounding the power plant is largely rural, the spill caused a mudflow wave of water and ash that covered 12 homes, pushing one entirely off its foundation, rendering three uninhabitable, and caused some damage to 42 residential properties. It also washed out a road, ruptured a major gas line, obstructed a rail line, preventing a train delivering coal from reaching the plant, downed trees, broke a water main, and destroyed power lines. Though 22 residences were evacuated, nobody was reported to be injured or in need of hospitalization. However, research shows that the event had significant negative effects on mental health for people affected and in the area. It was the largest industrial spill in United States history, more than three times the size of the Martin County coal slurry spill of 2000, which spilled  of slurry. The  of sludge were enough to fill 1,660 Olympic-size swimming pools, and the volume released was about 100 times larger than the 1989 Exxon Valdez oil spill and about 10 times greater than the volume released in the 2010 Deepwater Horizon oil spill, the largest oil spill in history.\nThe next day, TVA spokesman Gil Francis Jr. stated that, at the time of the spill, the area contained about  of ash and that two-thirds of that had been released, which would later be found to cover an area of . The New York Times noted that the amount spilled was larger than the amount stated to have been in the pond before the spill, a discrepancy the TVA was unable to explain. The spill did not affect the adjacent retaining and stilling ponds; the other two stayed intact, while only the retaining wall for the  solid waste containment area was affected.\ns, which are a component of the ash.]]\nThe spill was reported to have killed and buried multiple deer and at least one dog, and ejected fish from the Emory River onto the river bank as far as  from the shore. The contamination effects in the rivers killed an extremely large number of fish and other aquatic life. Large numbers of dead fish were reported as far as the Tennessee River and other area tributaries in the aftermath of the spill.\nCause\nEngineering firm AECOM was hired by TVA to investigate the cause of the spill. A report released in June 2009 identified the main cause of the spill as the result of slippage of an unstable layer of fine wet coal ash underneath the pond. The report also identified other factors including the terraced retaining walls on top of the wet ash, which narrowed the area for storing the ash and in turn increased the pressure exerted on the dike by the rising stacks. The Kingston Fossil Plant had received  of rain between December 1 and December 22, plus  on November 29 and 30. This rain combined with  temperatures were identified by TVA as factors that contributed to the failure of the earthen embankment.\nResponse\nResponse from TVA and government officials\nThe day after the spill, TVA released a statement acknowledging the spill and apologizing for its damage to nearby homes. Francis said that the TVA was \"taking steps to stabilize runoff from this incident.\" Residents and environmental groups expressed concern that the fly ash slurry could become more dangerous once it dried out. On January 1, 2009, the TVA disseminated a fact sheet stating that the ash is \"not hazardous.\"\nTennessee Governor Phil Bredesen toured the spill site on December 31. The United States Senate Committee on Environment and Public Works, which oversees the TVA, held a hearing on January 8 to examine the disaster. Dr. Stephen Anderson Smith, Executive Director of the Southern Alliance for Clean Energy, testified at the hearing calling for stricter regulation of coal ash, more TVA oversight, and better long-range planning for TVA. Environmental activist Erin Brockovich visited the site on January 8 and spoke with residents affected by the spill.\nWater quality and efforts to stop the spill\nImmediately after the spill, the EPA and Tennessee Department of Environment and Conservation (TDEC) began testing the water quality of the area affected by the spill. Although residents feared water contamination, early tests of water  upstream of the ash flow showed that the public water supply met drinking water standards. A test of river water near the spill showed elevated levels of lead and thallium, and \"barely detectable\" levels of mercury and arsenic. On January 1 the first independent test results, conducted at the Environmental Toxicology and Chemistry laboratories at Appalachian State University, showed significantly elevated levels of toxic metals, including arsenic, copper, barium, cadmium, chromium, lead, mercury, nickel, and thallium in samples of slurry and river water.\nThe day after the spill Tennessee Emergency Management Agency indicated that barriers would be constructed to stop the ash from reaching the Tennessee River. By early on December 24 a flyover by The New York Times did note repair work being done on the nearby railroad, which had been obstructed when  of sludge-covered tracks. By the afternoon of that day, dump trucks were being used to deposit rock into the Clinch River to prevent the further downstream contamination. The TVA also slowed the river flow, for the same purpose. The slurry that was cleared from Swan Pond Road was brought back to one of the plant's intact containment ponds. By December 30 the TVA had announced it was requesting the assistance of the Army Corps of Engineers to dredge the ash-filled Emory River to restore navigation. On January 1 the TVA announced that rather than attempting to clear away all of the slurry, they would be spraying seed, straw, and mulch on top of much of it to prevent dust scattering and erosion.\nIn response to independent attempts at sampling of the water quality and the taking of photos, the TVA illegally detained, for approximately one hour, two members of the Knoxville-based environmental organization United Mountain Defense who were traversing public land in the area of the spill and warned three other individuals that any attempt to enter the public waterway would lead to prosecution. On December 26 TDEC stated that it was satisfied with the water quality in the wake of the spill but that it would continue to examine and deal with the potential for chronic health effects.\nCoal ash issues\nThe spill immediately reignited the debate about the regulation of coal ash. In response to a video that showed dead fish on the Clinch River, which had received runoff from the spill, Francis stated \"in terms of toxicity, until an analysis comes in, you can't call it toxic.\" He continued by saying that \"it does have some heavy metals within it, but it's not toxic or anything.\" Chandra Taylor, an attorney with the Southern Environmental Law Center, called this statement irresponsible and stated that coal fly ash contains concentrated amounts of mercury, arsenic, and benzene. She added, \"These things are naturally occurring, but they concentrate in the burning process and the residual is more toxic than it starts.\" Nevertheless, due to pressure exerted in 2000 by utilities, the coal industry, and Clinton administration officials, fly ash is not strictly regulated as a hazardous waste by the EPA.\nLisa Evans, an attorney for the environmental group Earthjustice, spoke out against the government, accusing them of lax regulations on the issue. She also blamed the electric power and coal industries for ineffective safeguards, citing other similar cases. She stated the issue of proper disposal of coal ash is not an extremely complicated problem and that utilities know how to solve it. Thomas J. FitzGerald, the director of the environmental group Kentucky Resources Council and an expert on coal waste, reported that the ash should have been buried in lined landfills to prevent toxins leaching into the soil and groundwater, as recommended in a 2006 EPA report, and stated that he found it hard to believe that the state of Tennessee would have approved the ash disposal sites at the plant as a permanent disposal site. Bredesen acknowledged that TDEC, which regulates coal disposal, may have relied too much on TVA's own inspections and engineering studies about the ash ponds and dredge cells, and promised that there would be an extensive investigation into the cause of the spill in order to prevent similar disasters.\nConcern was also expressed by environmental groups and local residents that no warnings were issued to residents living in the area about the potential dangers of the site after the spill. On December 27 TVA issued a list of precautions to residents but did not provide information about specific levels of toxic materials in the ash, although multiple environmental activists reported that they believed that TVA knew about the contents of the ash because they had tested it prior to the spill. The TVA released an inventory of the plant's byproducts on December 29; it included arsenic, lead, barium, chromium, and manganese. Because the pond contained decades worth of ash from coal of several different types, it was believed that the area of the spill may have contained isolated patches of higher toxicity.\nAt her Senate confirmation hearing on January 14, 2009, Lisa P. Jackson, then president-elect Barack Obama's choice to head the EPA under his administration, stated her intention to immediately review coal ash disposal sites across the country. Also on January 14 Nick J. Rahall, a U.S. Representative from West Virginia and the chairman of the United States House Committee on Natural Resources, introduced a bill to regulate coal ash disposal sites across the United States. That year, TVA committed to switching all of the ash storage facilities at their coal fired plants over to dry byproduct methods, which would reduce the chances of another spill. This was completed by 2022 at a cost of $2&nbsp;billion. At the time of the spill, five TVA-operated plants used this method, while Kingston and another five used a wet process with ponds.\nRegulation development\nFollowing the spill, the EPA began developing regulations that would apply to all ash ponds in the U.S. The EPA published a Coal Combustion Residuals (CCR) regulation in 2015. The agency continued to classify coal ash as non-hazardous, thereby avoiding strict permitting requirements under Subtitle C of the Resource Conservation and Recovery Act (RCRA), but with new restrictions:\n# Existing ash ponds that are contaminating groundwater must stop receiving CCR, and close or retrofit with a liner.\n# Existing ash ponds and landfills must comply with structural and location restrictions, where applicable, or close.\n# A pond no longer receiving CCR is still subject to all regulations unless it is dewatered and covered by 2018.\n# New ponds and landfills must include a geomembrane liner over a layer of compacted soil.\nSome of the provisions in the 2015 CCR regulation were challenged in litigation, and the United States Court of Appeals for the District of Columbia Circuit remanded certain portions of the regulation to EPA for further rulemaking. The EPA published a final RCR regulation on August 28, 2020, requiring all unlined ash ponds to retrofit with liners or close by April 11, 2021. Some facilities may apply to obtain additional time—up to 2028—to find alternatives for managing ash wastes before closing their surface impoundments. EPA published its \"CCR Part B\" rule on November 12, 2020, which allows certain facilities to use an alternative liner, based on a demonstration that human health and the environment will not be affected. These facilities were to submit their demonstration data by November 30, 2021.\nCleanup\nThe EPA first estimated that the spill would take four to six weeks to clean up; however, Taylor said the cleanup could take months and possibly years. As of June 2009, six months following the spill, only 3% of the spill had been cleaned and was estimated to cost between $675 and $975&nbsp;million to clean, according to the TVA. TVA hired California-based Jacobs Engineering to clean up the spill. The cleanup was accomplished under guidelines set by the Comprehensive Environmental Response, Compensation and Liability Act. However, the workers were not provided with personal protective equipment necessary to prevent exposure to hazardous chemicals contained within the coal ash. On May 11, 2009, TVA and EPA announced an order and agreement that documents the relationship between TVA and EPA in managing the clean-up of the Kingston ash spill, further ensuring that TVA would meet all federal and state environmental requirements in restoring affected areas.\nDuring the first phase of the cleanup, known as the time-critical phase, over  were removed within a year of the spill. This phase allowed the removal of ash from the river to be accelerated by 75% over original expectations. During this phase, the ash was safely transported to a permanent, lined, and leachate collecting facility in Perry County, Alabama, called Arrowhead landfill. The Emory River was reopened in late spring 2010. The time-critical phase removed 90% of the ash located in the Emory River. The next phase, which began in August 2010, removed the remaining ash from the Swan Pond Embayment of Watts Bar Reservoir. About  of material, which mixed with the remains of leaked material from atomic energy production operations at Oak Ridge National Laboratory during the Cold War, was left in the rivers. The final phase of the cleanup consisted of assessments on the health and environmental effects of leaving this ash in the waterways. The cleanup was completed in 2015 and cost approximately $1.134&nbsp;billion. In January 2017 the EPA announced that the ecosystems impacted by the spill had returned to conditions prior to the spill.\nDuring the cleanup TVA built a new protective levee around the pond, covered the ash pond with a  earthquake-proof clay layer, and replanted the areas damaged by the spill. They also purchased 180 properties and  from landowners affected by the spill and built a park on the former site of homes damaged by the spill. They also made more than $43&nbsp;million in-lieu-of-tax payments to the local governments to compensate for lost property and sales tax revenue. Shortly after the cleanup was complete, TVA began selling off some of the land that they had acquired around the spill.\nLegal actions\nLegal actions and criticism of TVA and EPA\nOn December 23, 2008, the environmental group Greenpeace asked for a criminal investigation into the incident, focusing on whether the TVA could have prevented the spill. On December 30, 2008, a group of landowners filed suit against the TVA for $165&nbsp;million in Tennessee state court. Also on December 30 the Southern Alliance for Clean Energy announced its intention to sue the TVA under the federal Clean Water Act and RCR. On February 4, 2009, the EPA and TDEC issued a letter to TVA in which the EPA provided notice to TVA that they consider the release to be an unpermitted discharge of a pollutant in violation of the Clean Water Act.\nOn August 23, 2012, the U.S. District Court for the Eastern District of Tennessee, representing more than 800 plaintiffs, found TVA liable for the spill. Judge Thomas A. Varlan issued an opinion stating that \"TVA is liable for the ultimate failure of North Dike which flowed, in part, from TVA's negligent nondiscretionary conduct.\" The ruling ultimately found that TVA did not build the holding ponds according to the initial plan and failed to train its employees on how to properly inspect the dikes surrounding the ash ponds, leading ultimately to a failure to maintain the facility to prevent a rupture of the dikes.\nSome critics of the EPA's response claim that the choice of how to deal with the spilled coal ash was an act of environmental racism. Roane County's population is more than 94% White, and the EPA shipped the toxic coal ash  south to Uniontown, Alabama, which has a population that is more than 90% African American. Robert D. Bullard, a champion for the victims of environmental racism, claimed that the EPA's response was a prioritization of the health of Caucasian Americans over the health of African Americans. In 2018, the EPA dismissed a complaint by the residents of Uniontown that charged that the landfill was in violation of the Civil Rights Act of 1964.\nHealth effects on workers\nNumerous workers suffered health effects in the years following the spill at the cleanup site. As early as 2012, workers began to report illnesses that they believed were caused by the cleanup, and by the ten-year anniversary of the event, hundreds of workers had been sickened, and more than 30 had died. In 2013, 50 workers and their families filed a lawsuit against contractor Jacobs Engineering. This lawsuit was dismissed by Judge Varlan the following year. This ruling was reversed by the U.S. Court of Appeals for the Sixth Circuit in 2015 after evidence was discovered that Jacobs Engineering had misled the workers about the dangers of coal ash. A federal jury ruled in favor of the workers seeking compensation on November 7, 2018. The ruling held that Jacobs Engineering had failed to keep the workers safe from environmental hazards and had misled them about the dangers of coal ash, mainly by claiming that extra protective equipment, such as masks and protective clothing, was unnecessary.\nDespite the ruling, Jacobs Engineering has maintained that it acted appropriately. Tom Bock, the top Jacobs safety officer on-site, claimed that many of the accusations about the cleanup effort and safety of the workers were false or contained misinformation. An attorney for Jacobs Engineering also claimed that the company had not been found liable for the illnesses contracted by the workers. On May 18, 2022, the Sixth Circuit Court of Appeals rejected a claim by Jacobs Engineering that the company was immune from lawsuits since it was contracted by a federal agency. The ruling also found that TVA was not immune from legal actions either. TVA has also denied wrongdoing in the case, but in September 2019 a TVA board member was reported to have told a U.S. Senate committee that he would not allow a member of his family to clean up coal ash without a dust mask.\nIn what would have been phase two of the trial, the Kingston clean-up workers would have been able to seek damages. In April 2020, 52 workers rejected a $10&nbsp;million settlement offered by Jacobs Engineering. On May 23, 2023, it was announced that Jacobs Engineering, which had rebranded the previous year as Jacobs Solutions, had reached a final settlement with more than 200 workers. The terms of this settlement were kept confidential. It was also reported at this time that the workers had rejected at least three other  settlement offers, including one for $35&nbsp;million in late 2021.\nSee also\n* Buffalo Creek Flood\n* Environmental disasters\n* Environmental impact of the coal industry\n* List of non-water floods\nReferences\nFurther reading\n*\nExternal links\n* [https://www.nytimes.com/imagepages/2008/12/25/us/20081225_SLUDGE_GRAPHIC.html New York Times map and diagram of the ash spill area]\n* [https://archive.today/20081228115856/http://www.epa.gov/Region4/kingston/ US Environmental Protection Agency: \"EPA's Response to the TVA Kingston Fossil Plant Fly Ash Release\"]\n* [http://www.epaosc.org/site_profile.asp?site_id=4642%20 US Environmental Protection Agency On-Scene Coordinator:\"TVA Kingston Fly Ash Release\"]\n; Video\n* [https://www.democracynow.org/2008/12/24/spill_at_tennessee_coal_plant_creates Story from Democracy Now!], December 24, 2008\n* [https://www.youtube.com/watch?v=rGmVCABMRRQ Video from knoxnews.com]\n* [https://www.youtube.com/watch?v=c_-EL5Jrrmk CBS News video]\n* [https://www.youtube.com/watch?v=b-NJkl1EUMI Video from United Mountain Defense]"
    }
  ]
}