{
  "content": [
    {
      "type": "text",
      "text": "# Kings Point, New York\n\n| subdivision_type1  = State\n| subdivision_name1  =\n| subdivision_type2  = County\n| subdivision_name2  = Nassau\n| government_footnotes =\n| government_type    =\n| leader_title       = Mayor\n| leader_name        = Kouros \"Kris\" Torkan\n| leader_title1      = Deputy Mayor\n| leader_name1       = Hooshang Nematzadeh\n| established_title  = Incorporated\n| established_date   = November 1924\n| unit_pref          = Imperial\n| area_footnotes     =\n| area_magnitude     =\n| area_total_km2     = 10.37\n| area_land_km2      = 8.70\n| area_water_km2     = 1.67\n| area_total_sq_mi   = 4.00\n| area_land_sq_mi    = 3.36\n| area_water_sq_mi   = 0.64\n| population_as_of   = 2020\n| population_footnotes =\n| population_total   = 5619\n| population_density_km2 = 645.87\n| population_density_sq_mi = 1672.82\n| timezone           = Eastern (EST)\n| utc_offset         = -5\n| timezone_DST       = EDT\n| utc_offset_DST     = -4\n| elevation_footnotes =\n| elevation_m        = 8\n| elevation_ft       = 26\n| coordinates        =\n| postal_code_type   = ZIP code\n| postal_code        = 11024\n| area_code          = 516, 363\n| blank_name         = FIPS code\n| blank_info         = 36-39694\n| blank1_name        = GNIS feature ID\n| blank1_info        = 0954670\n| website            =\n| footnotes          =\n| pop_est_as_of      =\n| pop_est_footnotes  =\n| population_est     =\n| subdivision_name3  = North Hempstead\n| subdivision_type3  = Town\n| named_for          = The King family\n| pushpin_label      = Kings Point, New York\n| area_code_type     = Area codes\n}}\nKings Point is a village on the Great Neck Peninsula in the Town of North Hempstead in Nassau County, on the North Shore of Long Island, in New York, United States. The population was 5,619 at the time of the 2020 census.\nHistory\nThe Village of Kings Point incorporated in November 1924. It is named for the King family, which owned large portions of land in the area.\nThe entire region was once known as Hewlett's Point after the Hewlett family, who also owned land in the area; this name is still used at times, in reference to the northernmost tip of the village.\nGeography\nAccording to the United States Census Bureau, the village has an area of 4.0&nbsp;square miles (10.3&nbsp;km2), of which 3.3&nbsp;square miles (8.7&nbsp;km2) is land and 0.6&nbsp;square miles (1.7&nbsp;km2), or 16.08%, is water.\nKings Point is surrounded on three sides by water: Little Neck Bay to the west, the Long Island Sound to the north, and Manhasset Bay to the east.\n}}\nAs of the census of 2000, there were 5,076 people, 1,401 households, and 1,203 families residing in the village. The population density was . There were 1,455 housing units at an average density of . The racial makeup of the village was 91.67% White, 0.87% African American, 0.08% Native American, 3.55% Asian, 0.65% from other races, and 3.19% from two or more races. Hispanic or Latino of any race were 1.95% of the population.\nAs of 2000, Kings Point was the most Iranian conurbation in the United States, with 29.7% of its population reporting Iranian Jewish ancestry.\nThere were 1,401 households, out of which 38.0% had children under the age of 18 living with them, 79.7% were married couples living together, 4.0% had a female householder with no husband present, and 14.1% were non-families. 11.9% of all households were made up of individuals, and 7.4% had someone living alone who was 65 years of age or older. The average household size was 3.14 and the average family size was 3.38.\nIn the village, the population was spread out, with 24.1% under the age of 18, 17.8% from 18 to 24, 17.4% from 25 to 44, 26.1% from 45 to 64, and 14.6% who were 65 years of age or older. The median age was 37 years. For every 100 females, there were 122.2 males. For every 100 females age 18 and over, there were 125.7 males.\nThe median income for a household in the village was $116,957, and the median income for a family was $122,692. Males had a median income of $100,714 versus $50,595 for females. The per capita income for the village was $57,965. About 0.8% of families and 2.0% of the population were below the poverty line, including 2.3% of those under age 18 and 2.6% of those age 65 or over.\nGovernment\nVillage government\nAs of 2023, the mayor of Kings Point is Kouros \"Kris\" Torkan, the deputy mayor is Hooshang Nematzadeh, and the village trustees are Ira S. Nesenoff, Tedi Kashinejad, and Shahriar (Ebi) Victory.\nVillage police\nThe Village of Kings Point operates its own police department. The Kings Point Police Department is responsible for providing police protection services in the village.\nAs of 2023, the commissioner of the Kings Point Police Department is Daniel Flanagan.\nRepresentation in higher government\nTown representation\nKings Point is in the Town of North Hempstead's 5th council district, which as of 2025 is represented on the North Hempstead Town Council by David A. Adhami (R–Great Neck).\nNassau County representation\nKings Point is in Nassau County's 10th legislative district, which as of 2025 is represented in the Nassau County Legislature by Mazi Melesa Pilip (R–Great Neck).\nNew York State representation\nNew York State Assembly\nKings Point is in the New York State Assembly's 16th State Assembly district, which as of 2025 is represented by Daniel J. Norber (R–Great Neck).\nNew York State Senate\nKings Point is in the New York State Senate's 7th State Senate district, which as of 2025 is represented in the New York State Senate by Jack M. Martins (R–Old Westbury).\nFederal representation\nUnited States Congress\nKings Point is in New York's 3rd congressional district, which as of 2025 is represented in the United States Congress by Tom Suozzi.\nUnited States Senate\nLike the rest of New York, Kings Point is represented in the United States Senate by Chuck Schumer and Kirsten Gillibrand.\nPolitics\nIn the 2024 U.S. presidential election, the majority of Kings Point voters voted for Donald J. Trump.\nParks and recreation\nKings Point is entirely within the boundaries of (and is thus served by) the Great Neck Park District. The special district operates two parks entirely within Kings Point: Kings Point Park and Steppingstone Park and Marina. The park district's Parkwood Pool and Sports Complex is also partially within the village, on its border with the Incorporated Village of Great Neck.\nOther recreational facilities in the village include the Broadlawn Harbour Yacht Club, the Kennilworth Pool Club, and the Shelter Bay Yacht Club, all of which are privately owned.\nEducation\nSchool district\nKings Point is entirely within the boundaries of (and thus served by) the Great Neck Union Free School District. As such, all children who reside in the village and attend public schools go to Great Neck's schools.\nJohn F. Kennedy Elementary School is also in the village, and Great Neck North Middle School is on Kings Point's border with the Incorporated Village of Great Neck.\nLibrary district\nKings Point is wholly within the boundaries of (and thus served by) the Great Neck Library District.\nHigher education\nThe United States Merchant Marine Academy is in the village, along Little Neck Bay.\nInfrastructure\nTransportation\nRoad\nMajor roadways in Kings Point include Bayview Avenue, East Shore Road, Kings Point Road, Middle Neck Road, Redbrook Road, and Steamboat Road.\nRail\nNo rail lines run through Kings Point. The nearest Long Island Rail Road station is Great Neck, on the Port Washington Branch.\nBus\nKings Point is served by the n57 and n58 bus routes, which are operated by Nassau Inter-County Express.\nUtilities\nNatural gas\nNational Grid USA provides natural gas to homes and businesses that are hooked up to natural gas lines in Kings Point.\nPower\nPSEG Long Island provides power to all homes and businesses in Kings Point, on behalf of the Long Island Power Authority.\nSewage\nKings Point is primarily unsewered. The overwhelming majority of the village, accordingly, relies on cesspools and septic systems. The only major exception is the United States Merchant Marine Academy, which operates its own sanitary sewer network.\nWater\nKings Point is within the boundaries of the Water Authority of Great Neck North, which provides the village with water.\nLandmarks\nKings Point is the home of the United States Merchant Marine Academy and its maritime museum, the American Merchant Marine Museum.\nThere is also a lighthouse known as the Kings Point Light. This is a private building owned and operated by the United States Merchant Marine Academy. The lighthouse atop the chapel shines to bring wayfaring sailors home from sea and students back from Long Island Sound, also known as the \"Play Pen\".\nNotable people\n* Sol Atlas (1907–1973), real estate developer\n* Sid Caesar (1922–2014), comic actor and writer, lived in Kings Point from the 1950s to the late 1970s in a home on the water\n* Barrie Chase (born 1933), actress and dancer, born in Kings Point\n* Walter Chrysler (1875–1940), automobile pioneer, died in Kings Point\n* George M. Cohan (1878–1942), entertainer, playwright, composer, actor, lyricist, singer, dancer and producer, lived in Kings Point 1914–1920\n* Arthur G. Cohen (1930–2014), businessman and real estate developer\n* F. Scott Fitzgerald (1896–1940), as noted below\n* Vitas Gerulaitis (1954–1994), professional tennis player, former Kings Point resident\n* W. R. Grace, as noted above\n* Emily Hughes (born 1989), member of the U.S. figure skating team at the 2006 Winter Olympics\n* Sarah Hughes (born 1985), gold medalist in figure skating at the 2002 Winter Olympics\n* Andy Kaufman (1949–1984), comedian and actor\n* Alan King (1927–2004), comedian and actor\n* Morris S. Levy, film and television producer\n* Fred Ohebshalom (born 1952), real estate developer\n* Bobby Rosengarden (1924–2007), jazz drummer and bandleader, former Kings Point resident\n* Tamir Sapir (1946/1947–2014), businessman and investor\n* Stanley Silverstein (1924–2016), entrepreneur who co-founded Nina Footwear\nMedia\nThe Great Neck Record is the newspaper of record for the Village of Kings Point.\nThe Great Gatsby\nIn the 1920s, F. Scott Fitzgerald lived in Great Neck, at 6 Gateway Drive in Great Neck Estates, which is probably Great Neck's greatest claim to fame. It was a modest house, not dissimilar to that of Nick, the protagonist of Fitzgerald's novel The Great Gatsby. It is said that Fitzgerald modeled West Egg, the fictional town where Nick lives, next to the mansion of Jay Gatsby, after Great Neck (specifically Kings Point), for its epitome of nouveau riche gaudiness, atmosphere, and lifestyle. He modeled East Egg, the town where Daisy and Tom live, after Great Neck's eastern neighbor Sands Point, which is part of Port Washington.\nReferences\nExternal links\n*[http://www.villageofkingspoint.org/ Official website]"
    }
  ]
}