{
  "content": [
    {
      "type": "text",
      "text": "# Kingsmead School, Hoylake\n\nKingsmead School}}\n| motto        = Dominus Vitae Robur(The Lord is the Strength of my Life)\n| established  = 1904\n| closed       =\n| type         = Private\n| religious_affiliation     = Non-denominational Christian\n| president    =\n| head_label   = Headmaster\n| head         = Mark Gibbons\n| r_head_label  =\n| r_head        =\n| chair_label  = Chairman of Governors\n| chair        = Tim Turvey\n| founder      = Arthur Watts\n| specialist   =\n| address       = Bertram Drive\n| city         = Hoylake\n| county       = Wirral\n| country      = England\n| postcode     = CH47 0LL\n| local_authority           = Wirral Metropolitan Borough Council\n| dfeno         = 344/6014\n| urn           = 105121\n| ofsted        =\n| staff        = 32 teaching, 39 support\n| enrolment   = 215\n| gender       = Mixed\n| lower_age    = 2\n| upper_age    = 16\n| houses       =  Hilbre Ness Royden\n| colours      =  Bottle Green Navy Blue\n| publication  =\n| free_label_1 = Former pupils\n| free_1       = Old Kingsmeadians\n| free_label_2 = School hymn\n| free_2       = \"Through All the Changing Scenes of Life\"\n| free_label_3 =\n| free_3       =\n| website      =\n}}\nKingsmead School was a co-educational private day school for boys and girls aged 2 to 16 and, from 2018 until its closure, offered a sixth form for students up to age 18. The school is located in Hoylake, on the Wirral Peninsula. The school was founded in 1904 by Arthur Watts, a Baptist minister and mathematician. In 1911 the school motto was selected, \"Dominus Vitae Robur\" – The Lord is the Strength of my Life.  Kingsmead is a member of the Independent Association of Preparatory Schools (IAPS).\nIt was closed in 2020. In 2023, the Kingsmead Trust announced that they were partnering with the Oasis Charitable Trust to reopen the school site under the name \"Oasis Kingsmead\", but the project was cancelled the following year.\nHistory\nIn 1904, Arthur Watts, a gifted mathematician and one of six sons of a Baptist minister, founded Kingsmead School. His dream was to establish a Christian school in which ‘the environment would be ideal for learning well, for playing good games and keeping physically fit’.\nWorld War I claimed the lives of thirteen Old Kingsmeadians. Two Kingsmeadians won the Military Cross – a master, Lieutenant Lavery, and Francis Wright Atherton who was just 19 years old.\nThe years between the wars were ones of economy and survival as the Great Depression took the world in its grip. It would take until 1944 for numbers to return to their 1921 levels. By 1939 Kingsmead was 35 years old and Arthur Watts, aged 68, had just two years in which he shared the running of the school with his son before Gordon was called up to the RAF.\nAfter the Second World War, another son, David, returned to Kingsmead in 1949 to run the school in partnership with his brother Gordon. He soon became the sole head.\nIn 2012 the boarding department was closed and reopened in 2017 shortly followed by the establishment of a new Sixth Form in September 2018.\nIt was announced in June 2020 that the school would close permanently at the end of the school year. A letter to parents from the school explaining the closure stated that low pupil numbers exacerbated by the COVID-19 crisis meant that the school could no longer afford to remain open.\nEthos and assessment\nAlthough Kingsmead was a Christian School, it welcomed children of all beliefs and none. The school day started with an assembly which included a Bible reading, an address, a hymn and prayers.\nIn Feb 2011 Ofsted reported the some areas of boarding provision to be inadequate – notice of action to improve being given. In 2013 the Independent Schools Inspectorate (ISI) found the school was successful but with further action required to meet regulations. In March 2016 The ISI Compliance Inspection found that the Kingsmead met all regulations and there were no recommendations for improvement. The report said \"The proprietor ensures that the leadership and management demonstrate good skills and knowledge, and fulfill their responsibilities effectively, so that the standards are consistently met and they actively promote the well-being of the pupils.\"\nNotable former pupils\nFormer pupils of the school are known as Old Kingsmeadians (OKs). Notable Old Kingsmeadians include the following.\n*Nicola Horlick, investment fund manager\n*Julian Lennon, musician, songwriter, actor and photographer; son of John Lennon\n*Philip Mould OBE, art dealer and art historian\nHeadteachers\n*1904–1945 Arthur Watts\n*1939–1941, 1945–1953 Gordon Watts\n*1949–1962, 1963–1979 David Watts\n*1962–1963 John Mayor\n*1962–1963 Stanley Payne\n*1979–1986 Nicholas Bawtree\n*1986–1992 John Eadie\n*1992–2006 Edward Hugh Bradby\n*2006–2010 Jonathan Perry\n*2010–2020 Mark Gibbons\nSee also\n* List of schools in Merseyside\n* List of independent schools in the United Kingdom\nReferences\nExternal links\n*[http://www.kingsmeadschool.com/ Kingsmead School website]\n*[https://archive.today/20121223164055/http://www.ofsted.gov.uk/oxcare_providers/full/(urn)/SC018959 OFSTED Reports on Kingsmead School]"
    }
  ]
}