{
  "content": [
    {
      "type": "text",
      "text": "# King's Rhapsody (film)\n\n| runtime        = 93 minutes\n| country        = United Kingdom\n| language       = English\n| budget         = £403,718\n| gross          = £90,884 (UK)\n}}\n'King's Rhapsody' is a 1955 British musical film directed by Herbert Wilcox and starring Anna Neagle, Errol Flynn and Patrice Wymore. Wymore was Errol Flynn's wife at the time of filming. It was based on the successful stage musical ''King's Rhapsody'' by Ivor Novello.\nPlot\nPrince Richard of Laurentia is summoned from exile with his mistress Marta (Anna Neagle) in Monte Carlo, to resume Royal duties following the death of his father, the King (Finlay Currie). He is charged to marry Princess Cristiane of Norseland (Patrice Wymore) and produce an heir to the throne. Although Richard's affections are with his mistress, he soon finds his heart warming to his new wife.\nCast\n* Anna Neagle as Marta Karillos\n* Errol Flynn as Richard, King of Laurentia\n* Patrice Wymore as Princess Cristiane\n* Martita Hunt as Queen Mother\n* Finlay Currie as King Paul\n* Francis De Wolff as The Prime Minister\n* Joan Benham as Countess Astrid\n* Reginald Tate as King Peter\n* Miles Malleson as Jules\n* Edmund Hockridge as The Serenader\nProduction notes\nThe film was the second from Everest Productions, a company established by Herbert Wilcox. He hoped to sign with Republic but they refused so he signed a deal with British Lion.\nThe film was the first of what was meant to be a six-film deal over three years worth £2,500,000. The intention was that Flynn and Neagle would form a team along the lines of Neagle's pairing with Michael Wilding, starting with The White Witch of Rose Hall in Jamaica. However this was the last of the two movies they made together.\nThe budget consisted of £227,680 for British costs, plus Errol Flynn's fee, plus a Yugoslavian contribution towards location costs.\nReception\nThe film was not a success.\nFilmink said that \"at times King’s Rhapsody feels like an amateur theatre production, with the stars “acting” but with enthusiasm.\"\nIn Errol Flynn: The Life and Career, Thomas McNulty noted, \"Shot in CinemaScope, the colorful costumes were wonderful to look at but unfortunately the actors wearing those costumes, particularly Flynn, are wooden and unconvincing,\" and went on to write that he found the film \"merely dull,\" and that \"The plot is a disaster disguised as a screenplay\"; while Allmovie considered the film \"one of the few Neagle/Wilcox failures.\"\nRelease\nThe film underperformed at the box office. A condensed 45-minute version, taken from the film's soundtrack, was broadcast as a BBC Radio play in September 1955.\nReferences\nExternal links\n*\n*[https://web.archive.org/web/20160402051658/http://www.britmovie.co.uk/films/Kings-Rhapsody_1955 ''King's Rhapsody''] at Brit Movie"
    }
  ]
}