{
  "content": [
    {
      "type": "text",
      "text": "# Kingdom of Mbokomu\n\n|event_start     = Chagga states\n|year_start      = c.1700s\n|event_end       = Abolution of former nations\n|date_end        = 6 December\n|year_end        = 1962\n|event_post      = Formal abdication\n|date_post       = 6 December 1962\n|title_leader    = Mangi (King)\n|leader1         = Mangi Masha of the Mrema clan\n|year_leader1    = c.1830-1845\n|leader2         = Mangi Lowiho\n|year_leader2    = 1845-1860s\n|leader3         = Mangi Mrunge\n|year_leader3    = c.1860s\n|leader4         = Mangi Mlatie\n|year_leader4    = c.1860s-1900\n|leader5         = Mangi Msami\n|year_leader5    = 1900-1917\n|leader6         = Mangi Ngatunyi\n|year_leader6    = 1917-1936\n|leader7         = Mangi Phillipo (last Mangi of Mbokomu before annexation)\n|year_leader7    = 1938-1945\n|religion        =\n|stat_year1   = 1880s\n|stat_pop1    = ~\n|stat_year2   = 1950s\n|stat_pop2    = ~\n|stat_year4   = 1890s\n|stat_pop4    =\n|stat_area4   = 25.5\n|currency     =\n| p1          = Chagga chiefdoms\n| s1          = Old Moshi\n| today       =\n|footnotes    = Area and population not including colonial possessions\n}}\nMbokomu or Kingdom of Mbokomu also sometimes referred to as Old Mbokomu (Isarile la Mbokomu in Kimochi), (Ufalme wa Mbokomu in Swahili) was a former sovereign Chagga state located north of modern-day town of Mbokomu in Moshi Rural District of Kilimanjaro Region in Tanzania. Mobokomu was situated on Mount Kilimanjaro to the west of the Rau River to the Masaranga River to the east. Due to relatively close proxity and size, Mbokomu residents spoke Kimochi, one of the seven Chagga dialects Central Kilimanjaro language, which is still regarded as the Chagga's prestige language.\nOverview\nThe Mbokomu kingdom was located between the Msunga (tributary of Rau River) and Nanga rivers of Mochi features steep hills and deep ravines, which complicate movement and limit agricultural potential. Historically, this challenging terrain provided natural defenses against attacks.\nInitially inhabited by independent clan settlements, the area evolved into separate chiefdoms on the ridges. By the 19th century, these chiefdoms consolidated into two entities: Mbokomu in the west and Moshi in the east. Despite their small size—with Mbokomu and Moshi having around 1,000 and 2,000 male taxpayers, respectively, in the 1950s—each chiefdom maintained a distinct cultural identity.The kingdom was annxed into Moshi Kingdom in 1946.\nGeography\nMbokomu, commonly known as \"old\" Mbokomu, is characterized by its historic relevance and distinctive topography. The region features a notable elevated ridge that sharply slopes downwards to the west into the profound valley of the Msunga River and to the east towards the Kisaringo River. Additionally, a second ridge extends further east to the valley of the Msaranga River.\nA significant feature of Mbokomu is the Materuni Falls, located high along the Msunga River. This waterfall is visible from a distance as a cascade of white water surrounded by green mountain vegetation. Adjacent to the falls is the steep cliff of the Msunga gorge, which is covered in virgin forest. Above this area is Kwampung’u Hill, the highest point in Mbokomu, providing broad views of Kilimanjaro and the surrounding plains of Meru and Monduli Mountains.\nHistory\nMbokomu is composed of historic settlements, such as Foyenyi, Kimamboni, and Maedeni in the upper region, as well as Machadi, Korinyi, Mwika, and Masanga in the lower region. A notable location, \"Mbokomu,\" situated near the Kisarango River in Kimamboni, is believed to be the source of the chiefdom's name and is linked to the historical gathering place of the Mrema clan.\nSome scholars suggest that \"Mbokomu\" may derive from an earlier name linked to the Mrema clan's migration from Pokomo in the north, though the clan currently disputes this connection. Historically, the area was known as \"Saa,\" meaning \"Light,\" a name still used by locals today.\nThe settlement history of Mbokomu is complex and primarily derived from oral traditions. According to local narratives, all clans in the area, including the earlier Maanga clan, are believed to have descended from the forest. Over time, three main clans; Maanga, Mrema, and Foya, with the Mrema clan eventually becoming dominant and starting their dynasty.\nIn the early part of the 19th century, the Mbokomu kingdom became consolidated, probably between 1830 and 1845, while Moshi achieved a similar unification somewhat later, approximately in 1860. The residents of Mbokomu were generally more reclusive, favoring the security provided by their elevated geographical position. In contrast, the populace of Moshi embraced a more expansive perspective, aiming to strengthen their chiefdom's power by forming alliances with influential external groups.\nAlthough some Arab merchants explored the isolated region of Mbokomu, early European explorers predominantly overlooked it. Conversely, Moshi developed into an important trading center for Arabs on Kilimanjaro and became a vital location for European visitors. In terms of geography, Mbokomu is characterized by its hilly and more fertile landscape, yielding a larger harvest of bananas, whereas Moshi features flatter, less arable land that struggles to sustain its inhabitants.\nHistorically, each chiefdom contributed uniquely to Mbokomu's development. Mbokomu is recognized in oral tradition as the home of some of the most original inhabitants of the mountain, while Moshi gained prominence in the latter half of the 19th century under the leadership of Mangi Rindi, transforming it into one of Kilimanjaro's leading kingdoms.\nThe Mbokomu people are renowned on Kilimanjaro for their expertise in furrow-making, a skill that distinguishes them from other regions, such as Siha (Kibongoto), where a single clan typically manages furrow construction for all communities.\nIn Mbokomu, almost every clan employs its own furrow surveyor to create irrigation systems. These furrows are sourced from local springs and major rivers, including the Msunga and Kisaringo, enabling the agriculturalists of Mbokomu to irrigate their fields during the short rainy season.\nThe focus on furrow construction among the Mbokomu clans can be linked to the area's rugged landscape, which required efficient irrigation techniques. The existence of several ancient furrows indicates a lengthy history of habitation in the region. Specifically, five historical furrows in Mbokomu are acknowledged, with the initial two, Msale and Mrambo, being the earliest. The subsequent three—Teshena, Shinunyi, and Mrema—were established in the early 19th century.\nReputation in Kilimanjaro\nThe Mbokomu community has traditionally identified as prudent and autonomous, often resisting external influences. Their region maintained a significant degree of independence, attributed to its status as one of the earliest inhabited locales and the perceived challenges in governing its tenacious residents, who were recognized for their steadfastness.\nThe natural defenses of Mbokomu were essential in fending off invaders, as the rugged terrain exhausted attackers. In case of an assault, residents would retreat to Kwampung’u Hill, utilizing stored stones to repel enemies, emphasizing the importance of physical training for young men.\nDespite their warlike reputation, oral traditions suggest the Mbokomu were primarily defensive. They mostly lived in seclusion, with notable exceptions: the establishment of an Arab trading post called \"Chomba,\" which led to the abduction of women and children, and their raids alongside Mangi Rindi of Moshi.\nAdditionally, the Kahe people settled near the sacred stone of the Maanga clan but were expelled due to concerns over their growing power. In the early 19th century, Mbokomu unified under Masha of the Mrema clan, the first documented chief, who ruled from approximately 1830 to 1845. His lineage governed until 1946, when British colonial rule dissolved the chiefdom and merged it into the Moshi kingdom.\nChiefdoms of Mbokomu\nProir to the unification of Mbokomu in the 1830s by Mangi Masha, Mobokomu was dived into a number of chiefdoms with their own Mangis and ruling clans.\n{|border=0\n|valign=top|Tema\n|Was one the independent chiefdoms before being annexed into Mbokomu by Marawite in the 1800s.\n|-\n|valign=top|Natiro\n|was the stornghold for the Mrema clan. Eventually Mangi Masha's father Marawite annexes Tema and Masanga in the 1800s.\n|-\n|valign=top|Masanga\n|Masanga was also an independent chiefdom before being annexed into Mobokomu.\n|-\n|valign=top|Korinyi\n|Home of the Maanga clan with their own Mangi Kipure.\n|}\nRulers of Mbokomu\nMbokomu had a total of seven rulers in its history (all from the Mrema clan), much of rulers before Masha are not well known, the ruling house is Mrema dynasty.\n{|border=0\n|valign=top|Masha\n|(ruled 1830–1845) The first Mangi of Mbokomu was a member of the Mrema clan. He rose to power with the assistance of his father, Marawite, and gained additional support from Arab traders, which helped him consolidate his authority within the chiefdom.\n|-\n|valign=top|Lohiwo\n|Lohiwo, the son of Masha, ascended to leadership following the regency of his uncle, Kenja, who governed during the initial phase of Lohiwo's reign.\n|-\n|valign=top|Mrunge\n|Mrunge was the son of Lowiho's first wife and served as ruler for a brief period of two years. He was ultimately deposed by his uncle, Mdeo, who had been serving as his regent. Mdeo's rise to power was supported by Mangi Ndesserua of Machame, after which he ruled as regent for Mlatie..\n|-\n|-\n|valign=top|Mlatie\n|Mlatie, the youngest son of the first wife, initially ruled under the regency of his uncle, Mdeo, until he came of age. During his reign, Mbokomu faced attacks from Mangi Rindi of Moshi, prompting Mlatie to flee into exile. During this period, he explored new furrows in various chiefdoms.\nIn his absence, Mbokomu lacked a chief and was governed by appointees of Mangi Rindi. Mlatie was eventually reinstated with the assistance of Mangi Marealle of Marangu. He later retired due to old age.\n|-\n|valign=top|Msami\n|Msami (rules 1900–1917) son of Mlaties' first wife. Dies in exile in Kisimayo. In his absence, Mbokomu lacked a king and was governed by appointees of Mangi Rindi. Mlatie was eventually reinstated with the assistance of Mangi Marealle of Marangu. He later retired due to old age.\n|-\n|valign=top|Ngatunyi\n|Ngatunyi (rules 1917–1936)rules during the British coccupation era, he is known for the murder of his brother daudi and is acquitted by the British and sent to Arusha in exile.\n|-\n|valign=top|Philippo\n|Philippo of Mbokomu (rules 1938–1945) was the last mangi of Mbokomu before annexation into the Kingdom of Moshi in 1946.\n|-\n|}\nSacred sites of the Mbokomu clans\nThe clans of Mbokomu each maintained their own places of worship, featuring unique sacred emblems distinct from the typical clan shrines found on Kilimanjaro, which usually consist of clusters of trees or groves. One notable shrine is the Mrema clan's at Natiro, characterized by a clump of sacred palm trees believed to have been brought from their ancestral home. The presence of a fallen palm is traditionally interpreted as a sign of death within the clan.\nAnother significant emblem is the sacred stone of Kaa, the principal shrine of the Maanga clan, located in a banana grove in Korinyi.\nThis tall, narrow stone rises over two feet and is accompanied by a special variety of bananas known as Ndishi, which are used to predict harvest yields. The stone is considered immovable and possesses unique qualities; it can be rocked slightly by hand but is said to sway dramatically during periods of crisis or impending death among clan members.\nA smaller, immovable stone serves as a shrine for the Mrecha and Kamunde clans, situated along the Kisaringo ravine. This stone is believed to have fallen out of use after the deportation of the clan's leader in 1917. Additionally, the site of Maghonunyi features a pair of lifting stones named Kimashong’u, one male and one female, used by boys following initiation to test their strength, an indicator of their potential as warriors.\nThe decline and fall of Mbokomu\nThe kingdom of Mbokomu experienced a gradual decline, marked by a series of internal and external challenges during the German colonial occupation. Following the exile of Mangi Msami in 1917, the lineage of Mlatie faced significant difficulties, attributed to poor leadership and increasing hostility from the neighboring chiefdom of Moshi. Historically, Moshi residents had foraged in Mbokomu for resources such as bananas, yams, and beer in the 19th century, and by the 20th century, they sought to annex Mbokomu.\nDespite temporary relief under Mangi Marealle's leadership, the ambitions of Moshi's influential leaders ultimately threatened the sustainability of the Mbokomu chiefdom. By 1946, the British District Commissioner noted that Mbokomu's small population, which was only half that of Moshi, posed a challenge to its independent survival. The Mbokomu people accepted this rationale but opposed annexation by Moshi, instead proposing an affiliation with Uru or Machame.\nThe historical grievances between Mbokomu and Moshi persisted into the 1960s. Mbokomu residents argued that annexation led to discrimination in land allocation and educational resources. The administrative processes became more cumbersome, as they had to navigate longer routes to access Moshi's baraza (council), lacking direct road connections.\nMoreover, the Moshi king ordered the dismantling of the Mbokomu Mangis' stone baraza, an act that the Mbokomu people resisted, necessitating labor from Machame to complete the task.  By 1960, the stones remained in disarray at the site of the former kingdom, symbolizing the loss of local pride and identity for the Mbokomu people.\nSee also\n*Chagga states\n* Machame\n* Kingdom of Masama\n* Kibosho\n* Old Moshi\n* Siha\nReferences"
    }
  ]
}