{
  "content": [
    {
      "type": "text",
      "text": "# Kingsland Secondary School__disambig_1\n\nKingsland Secondary School was a secondary school located on Shacklewell Lane, in Shacklewell and was in the London Borough of Hackney, England. It closed in August 2003.\nThe school, originally built as Dalston County School around 1937, was closed in August 2003, demolished and rebuilt under the new name of the 'Petchey Academy', named after Jack Petchey.\nControversy\nThe decision to permanently close down Kingsland Secondary School was met with much opposition, as many faculty members and students felt that much progress was being made in improving the standards of teaching and academic levels, which ultimately meant that the school should not have been branded a 'Special Measures' institution. However, the Office of The Schools Adjudicator published its decision on 14 March 2003 that the school should be discontinued by 31 August 2004.\nBuilding layout\nKingsland Secondary School consisted of four buildings, which were known as blocks A,B,C and D.\n*A-block was the largest of the four blocks, it was the main building, where the majority of subjects were taught to students.\n*B-block contained the canteen, design and technology department and the offices of the heads of years.\n*C-block housed two gym halls, a drama studio and the music department\n*D-block was also known as the \"science block\", although it was not exclusive to the science department.  Also situated in this building was the special educational needs room, the French department and on the top floor, the home economics and art department.\nGCSE pass rate\nIn 2002 the GCSE pass rate (A*-G) was 20%, this increased to 21% in 2003.\nFilm location\nThe Granada Television series 'Murder City' used the school as a location.\nThe 2005 TV movie 'Ahead of the Class' starring Julie Walters, used the school as a location. The film was based on a real-life, turn-around-the-school story where Marie Stubbs took the helm at St George's School in Maida Vale, London. Among the many shots of the school inside and out,\nthe main hall in A block featured in assembly scenes. See IMDB https://www.imdb.com/title/tt0421570/\nNotable alumni\n* Anne Keothavong, tennis player\nReferences"
    }
  ]
}