{
  "content": [
    {
      "type": "text",
      "text": "# King John's Castle (Limerick)\n\nKing John's Castle}}\n|location=Limerick, Ireland\n|map_type=Ireland\n|map_alt=Location in Ireland\n|coordinates =\n|image=\n|caption=View of King John's Castle from the River Shannon.\n|type=Medieval castle\n|built=c. 1210\n|builder=King John of England\n|height=\n|used=\n|demolished=\n|condition=\n|ownership=\n|controlledby=\n|garrison=\n|commanders=\n|occupants=\n|battles=\n|events=Siege of Limerick (1642)\nSiege of Limerick (1650–51)\nSiege of Limerick (1690)\nSiege of Limerick (1691)\nSiege of Limerick (1922)\n}}\n'''King John's Castle () also known as Limerick Castle''' is a 13th-century castle located on King's Island in Limerick, Ireland, next to the River Shannon. Although the site dates back to 922 when the Vikings lived on the Island, the castle itself was built on the orders of King John of England in 1200. Some of the external walls, towers and fortifications remain, and the site is open for visitors. The remains of a Viking settlement were uncovered during archaeological excavations at the site in 1900.\nThe castle experienced five sieges during the 17th century. The walls were severely damaged during the 1642 siege when the castle was occupied by Protestants fleeing the Irish Rebellion of 1641 and was besieged by an Irish Confederate force under Garret Barry.\nBetween 2011 and 2013, the castle underwent a €5.7 million redevelopment to improve the visitor facilities of the castle. Among the improvements were a modern visitor centre, interactive exhibitions with computer generated animations, and a cafe.\nViking settlement\nThe Viking sea-king, Tomrair mac Ailchi, built the first permanent Viking stronghold on Inis Sibhtonn (King's Island) in 922. He used the base to raid the length of the River Shannon from Lough Derg to Lough Ree, pillaging ecclesiastical settlements. In 937 the Limerick Vikings clashed with those of Dublin on Lough Ree and were defeated. In 943 they were defeated again when the chief of the local Dalcassian clan joined with Ceallachán, king of Munster and the Limerick Vikings were forced to pay tribute to the clans. The power of the Vikings never recovered, and they were reduced to the level of a minor clan, however often playing pivotal parts in the endless power struggles of the next few centuries.\nDomnall Mór Ua Briain burned the settlement to the ground in 1174 in a bid to keep it from the hands of the Anglo-Normans. After he died in 1194, the Anglo-Normans captured the area in 1195 under John, Lord of Ireland. In 1197, Limerick was given its first charter and its first mayor, Adam Sarvant, by Richard I of England.\nEarly history\n]]\nA castle, built on the orders of King John and bearing his name, was completed around 1210. The castle was built on the boundary of the River Shannon in order to protect the city from the Gaelic kingdoms to the west and from any rebellion by Norman lords to the east and south. Under the general peace imposed by the Norman rule, Limerick prospered as both a port and a trading centre, partly due to the castle acting as a watchdog on any cargo passing through the port of Limerick. By this time the city was divided into an area known as \"English Town\" on King's Island, while another settlement, named \"Irish Town\", had grown on the south bank of the river. The town of Limerick became so wealthy during this era that King John set up a mint in the North West corner of the castle, with pennies and half pennies from this time available to see in Limerick museum today. A 1574 document prepared for the Spanish ambassador attests to its wealth:\nLuke Gernon, an English-born judge and resident of Limerick, wrote an equally flattering account of the city in 1620:\nSiege of Limerick\nThe walls of the castle were severely damaged in the 1642 Siege of Limerick, the first of five sieges of the city in the 17th century. In 1642, the castle was occupied by Protestants fleeing the Irish Rebellion of 1641 and was besieged by an Irish Confederate force under Garret Barry. Barry had no siege artillery so he undermined the walls of King John's Castle by digging away their foundations. Those inside surrendered just before Barry collapsed the walls. However, such was the damage done to the wall's foundations that a section of them had to be pulled down afterward.\n2014 Redevelopment\nBetween 2011 and 2014, the castle underwent a massive redevelopment, with €5.7 million spent to improve the visitor facilities of the castle. Among the improvements were a brand new visitor centre, interactive exhibitions with computer generated animations, and a cafe with views onto the courtyard and the river.\nSee also\n*History of Limerick City\n*Limerick City Museum, just to the south\nReferences\nExternal links\n* [https://web.archive.org/web/20110130195913/http://www.shannonheritage.com/Attractions/KingJohnsCastle/ Shannon Heritage site]\n*[http://www.limerick.ie/sites/default/files/Constables.pdf List of constables of the castle]"
    }
  ]
}