{
  "content": [
    {
      "type": "text",
      "text": "# Kingia\n\nKingia is a genus consisting of a single species, Kingia australis, and belongs to the plant family Dasypogonaceae. The Aboriginal name bullanock is used as a common name for the plant. It has a thick pseudo-trunk consisting of accumulated leaf-bases, with a cluster of long, slender leaves on top.  The trunk is usually unbranched, but can branch if the growing tip is damaged.  Flowers occur in egg-shaped clusters on the ends of up to 100 long curved stems.  Kingia grows extremely slowly, the trunk increasing in height by about 1½ centimetres per year.  It can live for centuries, however, so can attain a substantial height; 400-year-old plants with a height of six metres are not unusual.\nDescription\nWhen not flowering, Kingia australis bear a superficial similarity to species of the genus Xanthorrhoea.  However, the flower stalks of Kingia australis are completely different from that of Xanthorrhoea species and the two are not closely related.  For example, Xanthorrhoea have a secondary thickening meristem in the trunk (Dracaenoid secondary thickening meristem), whereas Kingia lacks this feature.\nTaxonomy\nSpecimens of Kingia australis were first collected by Robert Brown at King George Sound in 1801. The plant featured in the drawing ''View of the south side of King George's Sound'' by expedition artist William Westall, which was later published as a plate in Matthew Flinders' 1810 A Voyage to Terra Australis; this is the first known image of the plant. A Voyage to Terra Australia also contained the first textual reference to this species: in the botanical index, Brown writes:\n\"A plant of a very similar habit to Xanthorrhoea, agreeing with it in its caudex and leaves, having, however, a very different inflorescence, was observed abundantly at King George's Sound, but with fructification so decayed and imperfect that I have not been able to determine the structure either of its flower or fruit.\"\nBecause of the state of decay of the fruit, Brown initially did not publish a name for the species. In 1823, however, William Baxter collected ripe fruit and seeds, specimens of which were passed to Brown. Based on these specimens, Brown published it in its own genus in his Character and description of Kingia, which first appeared as the botanical appendix to Phillip Parker King's 1827 Narrative of a Survey of the Intertropical and Western Coasts of Australia performed between the years 1818 and 1822. The genus name was chosen to honour both King and his father Philip Gidley King, who was Governor of New South Wales during Brown's voyage under Flinders. The species epithet australis is Latin for \"southern\".\nDistribution and habitat\nKingia australis is confined to the southern half of Western Australia.\nUses\nThe tree was identified by the state's conservator of forests, Charles Lane Poole, as being high in cellulose and exploited for a fibre industry. These fibres were used to make brooms and brushes, either coarse and long wearing street brooms or for more delicate purposes; Poole notes that these fibres were preferred by those employed as streetsweepers in Perth and Melbourne. The fibres were crudely processed from a layer of the material found throughout the trunk of the plant. This was separated from the soft core, dried to loosen the adhesion between them, and mechanically split and guillotined to lengths that were baled up for export.\nThe name of the genus, Kingia, was adopted for the title of the Western Australian Herbarium's publication of their research notes.\nGallery\nKingia Australis. 1827.jpg|Kingia Australis. Phillip Parker King, 1827.\nView from the south side of King George's Sound.jpg|''View of the south side of King George's Sound by William Westall contains the earliest known image of a Kingia.\nKingia fibre bales Forest dept Bulletin 2 1921.png|Kingia fibre baled for export\nKingia australis.jpg| Kingia australis'' at Fernhook Falls, Western Australia\nReferences\n}}\n*\n* ."
    }
  ]
}