{
  "content": [
    {
      "type": "text",
      "text": "# King Crin\n\nKing Crin (Italian: La storia del Re Crin) is an Italian fairy tale collected by Antonio Arietti. Italian author Italo Calvino reworked the tale as King Crin in his work Italian Folktales.\nThe tale is related to the international cycle of the Animal as Bridegroom or The Search for the Lost Husband, wherein a human maiden marries a prince cursed to be an animal, loses him and has to search for him. According to scholars, the pig or swine as the form of the cursed husband is very popular in Italy.\nSources\nCalvino sourced the tale from Monteu da Po, Piedmont.\nSummary\nA king has a pig for a son, named King Crin. One day, he oinks that he wants a human wife, one of the baker's daughters. The baker's elder daughter is convinced of marrying the pig, and they celebrate the wedding. The pig prince, however, wanders through town to play in the mud, and returns to the palace to meet his wife in their wedding chambers. He jumps on the bed to caress her, and ends up dirtying her dress. The girl tries to shoo him away in disgust, and the pig threatens her. The next morning, she is found dead.\nKing Crin decides to marry again, this time to the baker's middle daughter. Again, befitting his porcine appearance, he dirties himself in mudpits around the city and goes back to his wife in their chambers. Once again, he dirties her dress, she complains about it, and he kills her for it.\nFinally, the baker's youngest daughter marries the pig, treating him with kindness despite the pig's behaviour, and survives the night. One night, however, she lights a taper to better see her husband, and finds on her bedside a handsome youth instead of the pig. She then accidentally drops the taper on his body and he wakes up. King Crin then admonishes his wife, saying she will only find him after filling seven jars with tears, and wearing out seven pairs of iron shoes, seven iron hats and seven iron mantles, then vanishes.\nThe girl decides to go after her husband: after she sheds tears to fill the jars, she commissions the iron garments to begin her quest. She passes by the house of the Wind ('Vent', in the original) and its mother, and is given a chestnut. She next goes to the house of the Lightning ('Losna', in the original) and its mother, and is given a walnut, and lastly to the house of the Thunder ('Tron', in the original) and its mother, and gains a hazelnut.\nAt the end of her wanderings, she reaches a city where the now human King Crin is set to be married to the local princess. Following the advice of the mothers of the elements, she cracks open the nuts to find valuable items inside: the chestnut reveals gems and diamonds, the walnut produces gowns and silks; and the hazelnut yields horses and carriages. For three days, the girl bribes the local princess with the exquisite gifts so she can spend a night with her husband. She gives the gems and diamonds to the princess, who gives King Crin a sleeping potion and he cannot react to his true wife's tearful pleas. The situation repeats on the second night. On the third night, King Crin pretends to be asleep, and secretly listens to his wife's pleas. He wakes up and recognizes her, and they both go home.\nAnalysis\nTale type\nPhilologist  classified the tale as Italian type 425, Lo sposo scomparso (\"The Lost Husband\"). The Italian type corresponds, in the international Aarne-Thompson-Uther Index, to type ATU 425, \"The Search for the Lost Husband\". More specifically, it is classified as subtype ATU 425A, \"The Animal (Monster) as Bridegroom\": the princess burns the husband's animal skin and she must seek him out, even paying a visit to the Sun, the Moon and the Wind and gaining their help. The heroine is given marvellous objects on the way to her husband by the personifications of the elements, or by her helpers, and she uses them to bribe the false bride for a night with him. Only on the third night the heroine manages to talk to her husband and he recognizes her.\nMotifs\nAccording to Hans-Jörg Uther, the main feature of tale type ATU 425A is \"bribing the false bride for three nights with the husband\". In fact, when he developed his revision of Aarne-Thompson's system, Uther remarked that an \"essential\" trait of the tale type ATU 425A was the \"wife's quest and gifts\" and \"nights bought\".\nThe animal husband\nPolish philologist Mark Lidzbarski noted that the pig prince usually appears in Romance language tales, while the hedgehog as the animal husband occurs in Germanic and Slavic tales.\nCalvino noted that \"the folktale about the swine king is one of the most widespread in Italy\". A similar opinion was given by Letterio di Francia: he concluded that in many Italian variants the prince is either transformed into a serpent or is an enchanted pig. Likewise, Swedish scholar  stated that the swine as the form of the enchanted husband is \"traditional\" in Italy. In turn, according to Greek folklorist 's quantitative analysis, among the many forms of the enchanted husband in Italian variants, he appears as a serpent in 11 tales and as a pig in 10 texts.\nVariants\nItaly\nAbout King Pig\nIn a Sicilian variant collected by Laura Gonzenbach, Vom Re Porco (\"About King Pig\"), a queen wishes for a son, even if it is a pig, and thus one is born. Years later, the pig son wants to marry. He marries three times: the first two times, after the marriage, he plays in the mud and tries to climb onto the bride's lap, but she rejects him. On the wedding night, the pig prince takes off his skin, becomes a handsome human prince and kills his wife. With the third bride, she accepts the dirty bridegroom and her life is spared on her wedding night. She also learns her husband is an enchanted prince and must not reveal the truth to anyone. However, she tells the queen and her pig husband disappears. The princess, then, is forced to seek him out in a distant kingdom. On her journey, she meets three old hermits, who give her a hazelnut, a nut and an almond. Finally, the princess reaches the foreign queen's realm, and cracks open the hermits' presents: first, she finds a golden hen with golden chicks; next, she finds a golden toy schoolgirl and pupils; lastly, a golden eagle. The girl uses the golden objects to buy three nights in her husband's bed.\nThe Prince with the Pigskin\nIn a Venetian variant, Der Prinz mit der Schweinshaut (\"The Prince with the Pigskin\"), an evil sorceress curses a neighbouring king so that his wife gives birth to \"a prince wearing a pigskin\". He marries two princesses who insult him when he dries off his body with their bridal dress and he kills them for it. He marries the third princess, who does not seen to mind his drying off his body with her dress. This pleases the pig prince, who lets her see his true form, in exchange for her keeping the secret. When they attend a tournament the next day, the Queen Mother notices the handsome man by her daughter-in-law's side and thinks it is not her son. Soon, the queen confronts the princess, who is forced to reveal the truth to her mother-in-law and the location of the pig prince's pigskin. The queen takes the pigskin from the ashbox and burns it, causing the prince to disappear. The princess goes on a quest to rescue him, by meeting the ''Stella d'Oro'' (\"Abendstern\"), the Sun and the Wind. She gains from each a hazelnut, a nut and an almond. The princess hires herself as a goose herd for a second spouse, and cracks opens the nuts: she finds a dress \"the colour of the Stella d'Oro\" in the first; a dress the colour of the sun in the second, and \"an even more beautiful dress\" in the third. The princess uses the three dresses to bribe for three nights with her husband.\nThe Pig King (Imbriani)\nAuthor  collected a tale from Firenze with the title Il Re Porco (\"The Pig King\"). In this tale, a pregnant queen walks to a terrace for a bit of fresh air, when she insults a passing beggar woman by calling her a swine. In return, the woman curses the queen to give birth to a pig. A prince is born, in the shape of a pig, and the queen realizes it was the beggar woman's fault. The pig prince grows up and, when he is older, wants to be married. One day, he sees a mugolio's three daughters, and falls in love with one of them. The mugolio is told of the prince's wishes and asks his daughter which will want to marry the pig: the youngest and the middle daughter refuse to do so, while the elder agrees. The pig and the girl marry in a ceremony, and, in their bedchambers, the prince takes off his pigskin to become a handsome youth. His wife is surprised at this turn of events, but the youth asks her not to tell his mother, since his porcine appearance is due to her arrogance during the pregnancy. The girl promises the youth not to tell anyone, but, the next morning, the queen pesters her for details and she blabs about it. The same night, the pig prince chastises his wife for betraying his secret, and kills her. This happens again with the second sister. The pig marries the third sister and shows her his true form, asking her not to tell his mother. The next morning, the third sister tries to keep quiet about her husband's secret, but she tells the queen and asks her not to tell a soul about it. The same night, the pig youth admonishes his wife, but, instead of killing her, says she will only find him after she wears down seven iron canes, seven iron dresses and seven pairs of iron shoes, and fill seven jugs with tears. He kisses his mother goodbye and departs. The girl goes after him, and meets three old woman on the road, each giving her a gift (a nut, a hazelnut, and an almond) and some advice: cracking open the nuts and bribing her husband's second bride, a queen, with its objects for a night with the human pig prince. The girl finally wears out the seven iron garments and reaches a palace. She cracks open the nuts and finds three \"galanterie\" which she uses to bribe for three nights with her husband. She fails on the first two nights, but manages it on the third, by recounting her journey to make him remember (in her verses, she calls herself \"Son Ginevra bella\"). The pig prince wakes up, since he put a sleeping potion in his second bride's drink, and orders his servants to bring all his riches to back to his mother's castle. His orders are carried out and the pig prince returns to his mother's palace with his wife in tow. Back to the second bride, she wakes up and notices that the castle is empty from top to bottom, releases a loud scream and falls dead.\nThe Pig King (Pitrè)\nItalian folklorist Giuseppe Pitrè collected a tale from Pratovecchio, Tuscany, with the title Il re porco. In this tale, a king and queen have a son with the face of a pig. When he is 18 years old, he wants to get married, but no maiden wishes to be his bride. One day, he finds a suitable bride for him: the elder daughter of a calzolaio. The pig prince marries the elder daughter and, during the celebration, he sploshes in the mud and dirties his bride's dress. The girl complains and is killed for it on their wedding night. The same events happen to the middle daughter of the calzolaio. Finally, the man's youngest daughter agrees to marry the pig prince, and she treats the porcine bridegroom with kindness. In return, he spares her life. They live together, and the pig prince asks his wife not to tell anyone that he becomes a handsome youth at night. Despite promising so, the girl tells the king the truth about the prince. That same night, the prince chastises his wife, and says she will never find him unless she fills seven jars with tears and wears down seven pairs of iron shoes, seven dresses and seven hats, and departs. The girl cries for the loss of her husband, then begins her journey. She passes by the house of the Vento di sotto and his wife. The Vento di sotto cannot help her, so he gives her a hazelnut and directs her to his cousin, the wind Liofante (which Pitrè understood to mean Levante, that is, from the East). The girl next reaches the house of Liofante and his wife, who also cannot help him, so she is directed to his brother, the Ponente ('Sunset Wind') and is given an almond. Lastly, she arrives at the house of Ponente and his wife, who tell her the prince has married another wife, a queen, and gives her a nut. The Ponente also takes her to the city where the queen lives. The girl cracks open the nuts and finds a golden trousseau (corredo da bambini) in the first, then a corredo for older children, and finally a corredo for a pregnant woman. She uses the three objects to bribe for three nights in her husband's bed, failing on the first two and waking him up on the third.\nThe Pig King (Forster)\nAuthor and journalist Riccardo Forster collected and published a Dalmatian Italian tale titled El Re Porco. In this tale, a king and a queen fervently wish to have a son. After many prayers, one is born to them: a pig, to the queen's great distress. The pig grows up and asks his mother fo find him a wife. The queen herself questions his intentions, since who would want to marry a pig? Despite her reservations, she finds a poor tailor ('sartor', in the original) with three daughters. The queen sends for the tailor about the prospect of marriage between their families. At first, the man is hesitant, but agrees to his elder daughter's marriage to the pig prince. After the wedding ceremony, the pig prince goes to the wedding chambers to meet his wife, but, since he has rolled in the mud during the day, he dirties the bride's clothes. The girl shoos away the pig prince, and he kills her. After a while, the pig prince asks his mother to find him another wife. She does: the tailor's middle daughter, who marries the pig prince, shoos him away on the wedding night, and is killed in retaliation. Lastly, the pig prince asks a third time for a bride, and the queen brings him the tailor's youngest daughter. Before the girl leaves, her mother reminds her to burn the pigskin after the prince is asleep. The youngest daughter marries the prince and follows her mother's suggestion, but the pig prince disappears. The girl begins a quest for him around the world with three pairs of iron shoes and an iron cane. On the road, she meets an old man, who does not the location of the King Pig's palace, but directs her to another old man and gives her a nut ('nosa'). She keeps on her journey and meets another old man, who gives her another nut ('nosella') and finally a third old man, who gives her an almond nut ('mandola'). The third old man tells the girl the King Pig has married another woman, and now lives in a grand palace. The girl finishes her quest by wearing down the seven pairs of iron shoes, until she reaches King Pig's palace, and finds work there. One day, she cracks open the first nut and finds a beautiful dress, which she uses to trade with the queen for one night in King Pig's chambers. She tries to wake him up, but the tale says he was asleep \"like a pig\". Some time later, she cracks open the second nut, which contains a sea-coloured dress, and she trades it for a second night in King Pig's quarters. Once again, he fails to wake up. Desperate that she failed twice, the girl breaks open the almond nut, and finds a sky-coloured dress, which she trades for a third night in his chambers. At last, King Pig wakes up and is told everything by his first wife. The King Pig chastises the queen, saying that by selling him she cannot be his wife, and goes back with the girl.\nThe Pig King (Busk)\nAuthor Rachel Harriette Busk collected an Italian tale from Marche with the title Il re porco (\"The Pig King\"). In this tale, a king's son is transformed into a pig by a female enemy of the king. Despite the porcine transformation, the prince's mother, the queen, can still read his wishes, and surmises he wants to be married. Knowing that no girl of noble descent will want to marry him, so she resorts to a girl of low station. She finds a baker with three daughters, and marries the eldest to the pig son. They move out to a newly built palace, and the pig prince approaches his bride while he is dirty with mud. The girl shoos him away, and he, in retaliation, he jumps on her, killing her. This repeats with the baker's second daughter. Their sister, the baker's youngest daughter, named Doralice, offers to marry the pig prince. Her friends comment with her about the situation, but Doralice replies he was a kind prince before the curse, and she could never blame him for it. The queen summons her after learning of her true feeling, and marries her to the prince. On the wedding night, Doralice embraces the pig prince, and, due to her love for him, he turns back into a human prince. Despite the good news, the human prince asks her to keep the secret between them, lest their enemy learns of this. For months, Doralice manages to remain quiet about the secret, and the prince lives as a pig during the day and human by night. One day, however, she pays a visit to her father, who has a guest with him: a spurned suitor to Doralice. The man mocks Doralice for marrying a pig, but she answers that, by marrying the pig, she saved him. On telling this, the pig prince disappears, and Doralice tries to find him. The pig prince appears to her and says the evil princess has him under her power, but Doralice can find him by walking with seven iron canes, wear down seven pairs of iron shoes, and after filling seven jars with her tears. She begins her quest and, at certain points of the journey, cries over a jar to fills it. After she sits to rest by a tree and fills the seventh jar, she meets an old hermit (who the story explains is a sorcerer and another enemy to the evil princess), who says her journey is almost at an end, for she is near to the evil princess's castle. He also gives her a nut, a hazelnut, and a nut, which she is to use at the last moment, then goes away. Doralice thanks him and goes to the evil princess's castle in man's garments. She breaks the nuts and finds beautiful jewels inside each one. She then passes herself off as a seller from a distant country and trades the jewels for three nights in the Pig King's presence. The evil princess agrees to a trade, and allows Doralice to spend the night with him, but drugs him with a sleeping potion on the first two nights. As such, Doralice cannot wake him up on the first two nights, but manages it on the third. The human Pig King wakes up and recognizes his wife, and the evil princess is killed by the populace.\nThe Pig King (Prato)\nAuthor Stanislao Prato collected a tale from Spoleto with the title Il re porco. In this tale, a baker has three beautiful daughters. One day, they are visited by an old woman who brins with her a pig. The old woman tells the girls about the pig's marvellous abilities, and convinces the elder girl to come with her to see it for herself. The girl, the old woman and the pig go to a meadow, and the old woman locks the girl with the pig in an underground castle, then explains she will not be released until the pig finds himself a wife. Down in the subterranean castle, the pig insists to marry the girl, but she refuses. The old woman traps the girl behind a room, and goes to fetch the second girl, who undergoes the same events. Finally, the youngest sister decides to go with the old woman so she can meet her sisters, and agrees to marry the pig. On hearing this, the pig turns into a human youth, who says he is a prince, cursed by the old woman since his childhood, and could only be saved if a woman agrees to marry him in pig form. However, the girl cannot tell anyone about this. The girl agrees to his terms, and goes to meet her elder sisters, telling them she accepted the pig's proposal to save them. The sisters press further and the girl is forced to tell the secret. Suddenly, the old woman enters through the doors and orders the elder sisters to return home, adding that the girl's prince will return to his kingdom, and she will only find him if she wears down seven pairs of iron shoes and fill seven jars with her tears - in the timespan of eight months. On learning this, the girl commissions the seven pairs of iron shoes and begins her quest. After seven months, she meets the old woman again, who gives her a nut and an almond nut, and direct her to a city where the human pig prince is. As a final piece of advice, the old woman tells the girl to open the nuts and use their contents to bribe for a night with the prince. The girl follows her orders, dons a pilgrim disguise and goes to the city, then cracks open the nut (which produces a golden pillow) and the almond (which produces a golden statue). The girl trades the golden objects with the local queen for a night with the prince; she fails to wake him up on the first night, because he was given a sleeping drink by the queen, but manages to wake him up on the second. The queen enters the prince's chambers and tries to expel the pilgrimess, but the prince wakes up and expels her instead, letting the pilgrimess be with him.\nThe Story of Prince Pig\nIn an Italian tale from Romagna with the title La föla de prenzip pörz (\"The Story of Prince Pig\"), translated as Il príncipe porco (\"The Pig Prince\"), a king and queen have a son that, due to the people's envy, has been cursed into a porcine form by day and human by night. The queen dies, and the pig prince lives with the king. One day, the pig prince pesters his father about marrying, and sets his sights on the miller's daughters, each more beautiful than the other. The miller's elder daughter agrees to a marriage because she wants to become queen. They marry and retire to the wedding chambers; the pig tries to come on to his wife, but the girl insults and shoos him away. For this, he kills her. The pig prince asks the king to marry the middle daughter: the girl accepts and both are eating food at the table. The pig tries to rub himself on the second bride's dress, but she shoos him away. He also kills her. Finally, the miller's young daughter marries the pig prince. When the pig returns home with a sheen of mud to meet his wife, and the girl treats him kindly and cleans his body. For this, when the couple go to the wedding chambers, he turns into a handsome youth. The next day, the girl tells her mother about the prince and she wishes to see it for herself. The girl thus keeps the door slightly ajar for her mother to see him. The next night, the prince turns into a youth and goes to sleep, and his mother-in-law gasps in shock. The pig prince wakes up and admonishes his wife for betraying the secret, then says she can find him again by wearing down seven pairs of iron shoes, seven canes and two iron hats. On her journey, she passes by the houses of the Winds: Tramontano, where she is given a nut by an old woman; by the Maestrale, where she gains a small nut (nocciuola); and by the Bora wind, where an old lady gives her a chestnut (mandorla). At the Bora wind's house, the miller's daughter learns of her husband's location: under the power of the magician Tal dei Tali. The old lady asks the Bora wind to take the girl there. The Bora wind takes her to the magician's palace and she cracks open the first nut, producing a golden \"cavallino\" (little horse). The magician's son sees the golden object and tells his mother, the magician's wife, he wishes to have it. The miller's daughter makes a trade with the sorceress: the golden little horse for one night with the youth that changes from pig to human. The girl sings some verses by his bedside, but cannot wake the youth, her husband, on the first night, and cracks open the second nut on the second day, producing a diamond \"vitellino\" (little calf). The magician's son wishes to also have, and the girl trades it for a second night with her husband. For the second time, she cannot wake him up. Failing again, she cracks open the chestnut and releases a little donkey made of gems and jewels, which she trades for a last night with the prince. The prince, lying on the bed, sheds some tears and asks her if she is his wife. The girl confirms it. The prince then reveals he was under a spell that could only be broken if he found a girl to marry and love him. They remarry.\nOther tales\nRachel Busk reported a variant told by a teller from Rome. In this tale, the pig prince is cursed by his stepmother, and marries the baker's third daughter. One night, the girl tells her mother about the pig husband's secret, and her mother burns the pigskin the next day. The pig prince disappears, and the girl goes after him. She is given an apple by an old man, a hazelnut by an old woman, and a nut by another old man. The girl reaches the palace of the false bride and cracks open the apple (which produces a golden hen with golden chicks), the hazelnut (which produces a golden carriage driven by golden horses and a golden coachman) and the nut (which produces a herd of sheep that talk instead of bleating). She passes herself off as a poor pilgrim and trades the gifts with the false bride for three nights with the prince. The girl fails to wake him up on the third night, however, but the prince goes to the false bride's bedroom and finds the extravagant gifts. He then inquires the false bride about their origin, and she says a pilgrim gave them. The human pig prince then asks his guards to find the pilgrim, and she seats by his side at the table for morning breakfast.\nSee also\n* The Pig King\n* The Enchanted Pig\n* The Enchanted Prince Who was a Hedgehog\nReferences"
    }
  ]
}