{
  "content": [
    {
      "type": "text",
      "text": "# King Kong (2013 musical)\n\nKing Kong is a musical with music by Marius de Vries, lyrics by Michael Mitnick and Craig Lucas, a book by Lucas and additional musical and lyrical contributions by 3D, Sarah McLachlan, Guy Garvey, Justice and The Avalanches. It is based on the 1933, 1976 and 2005 films. The original production was mounted in Australia in 2013. A re-worked Broadway production premiered in October 2018.\nDevelopment\nThe Australian production took five years of planning and over five months of rehearsals. Its director, Daniel Kramer, said that it took \"three years of auditions and workshops\" before performances began, also adding: \"It's tempting to focus on the spectacle of King Kong himself. But it is only through the humanity of the life around him – the people of New York City, the comic megalomania of filmmaker Carl Denham, the stubborn opposition of first mate Jack Driscoll, and the grace, beauty and power of our leading lady, Ann Darrow – that he truly takes life\".\nThe musical, according to the 2013 press notes, \"has gone back to the source – the novella of the original film by Merian C. Cooper and Edgar Wallace\".\nProductions\nMelbourne\nAn earlier version of the musical opened at the Regent Theatre, Melbourne, on 15 June 2013, following previews from 28 May. It featured a score by Marius de Vries, lyrics by Michael Mitnick and Craig Lucas, a book by Lucas, and additional music and lyrics by 3D, Sarah McLachlan, Guy Garvey, Justice and The Avalanches. The production was directed by Daniel Kramer and choreographed by John O'Connell.\nOriginally booking through 28 July 2013, the musical extended its booking period three times, closing on 16 February 2014, after an almost nine-month run. The show was produced by Global Creatures, which partnered with animatronics workshop The Creature Technology Company, who designed the six-metre animatronic silverback title character.\nEngineered, designed and built by Global Creature Technology in West Melbourne, Australia, the title role was the largest puppet ever created for the stage. The 2013 press notes stated that Kong was \"a highly sophisticated animatronic/marionette hybrid that will be controlled by the integration of hydraulics, automation and the manual manipulation from a team of puppeteer/aerialists. ... A group of 35 on-stage and off-stage puppeteers work to manipulate the large-scale puppet. Several puppeteers are positioned on swinging trapezes and others launch themselves as counterweights off the puppet's shoulders to raise Kong's massive arms as he runs and swipes at planes during the performance. ... [The musical features] a cast of 49 actors, singers, dancers, circus performers and puppeteers; a crew of 76; and arguably the most technologically advanced puppet in the world – a one-tonne, six-metre giant silverback\". King Kong also features a few other visual effects, including Kong's battle with a  snake puppet and the integration of a  video screen.\nBroadway\nThe Broadway premiere of King Kong was originally scheduled to take place in 2014. Gerry Ryan of Global Creatures told Australian Radio Station 3AW in January the same year: \"I was in New York recently and went to the theatre, and so, they're getting ready – Spider-Man: Turn Off the Dark's closed there at the Foxwoods and we'll be opening on December 12 [2014]\". Producers soon announced delays. By September, Marsha Norman was engaged to rewrite the book.\nIn 2015, Jason Robert Brown was added to the team \"to write songs for the characters. There's a whole lot of music that already exists for King Kong\". A staged presentation was held in February 2016. Directed by Eric Schaeffer, the cast included Robert Creighton (Benny), Lora Lee Gayer (Ann Darrow), Marc Kudisch (Carl Denham) and Euan Morton (Jack Driscol).\nThe musical opened at the Broadway Theatre for previews on October 5, 2018, with the official opening on November 8. The creative team includes book writer Jack Thorne, director-choreographer Drew McOnie, and Australian songwriter Eddie Perfect, who replaced the former creatives. The play grossed just over $1 million during its opening week. On February 7, 2019, the show celebrated its 100th performance. The production closed on August 18 the same year, having 29 previews and 324 regular performances.\nJapan\nNederlander Worldwide Entertainment brought the show to Japan in 2021.\nSynopsis\nMelbourne\nAct I\nIn the middle of The Great Depression in New York City, film director Carl Denham is pressured to find a leading lady for his next film (\"Hunting Season\"). He searches the city for a woman fitting for the role but with little success (\"Sweethearts on Parade/Brother Can You Spare a Dime\"). Meanwhile, Ann Darrow is also struggling to cope with life in the city (\"What's It Gonna Take\"). She is robbed by thugs who taunt her by tossing around her belongings (\"I Wanna Be Loved by You\"). Denham spots her and realises she is perfect for the role. Ann is almost arrested for trying to steal an apple but Denham is able to prevent it. He offers her a job to star in his picture which she reluctantly accepts. Ann boards his ship and meets the crew including Jack Driscoll with whom she does not get along at first. The ship leaves the port as Denham thinks about how successful his new film will be (\"Colossus\"). The next morning Ann is nervous about her screen test but later becomes confident as she gets ready (\"Special FX\"). She and Jack get to know each other a little better (\"Perfect') and eventually fall in love (\"Foxtrot\").\nThe ship eventually arrives at Skull Island, the crew argue about whether to turn back or explore the island but Denham insists they go ashore. They interrupt the natives' sacrificial ritual and a fight breaks out (\"Ritual\"). The crew head back to the ship but Ann is abducted and offered as a sacrifice to Kong (\"Ascent\"). The crew go to rescue her but are too late as Kong has already taken her. Jack, however is determined to get Ann back and ventures into the jungle (\"In the Face of Forever\"). Meanwhile, Ann wakes up to face Kong in his cave. At first she is frightened but she builds the courage to stand up to him. Kong protects her when she is almost attacked by a giant snake and they form a special bond (\"Full Moon Lullaby\"). While Kong falls asleep, Jack quietly approaches and Ann reluctantly goes back with him. Kong suddenly wakes and realizes Ann is gone and chases after them (\"The Chase\"). Denham and the crew capture Kong using gas bombs to knock him out and Ann as bait, much to her dismay. Denham decides to present Kong to the public in New York.\nAct II\nNow back in New York, Ann contemplates her experiences on Skull Island (\"What's It Gonna Take\") while Denham advertises for his show in which he intends to present a now captive Kong to the audience (\"The Greatest Show on Earth\"). Jack proposes to Ann and she accepts (\"Dance with Me\"). The couple are about to enter the theatre when Ann asks for a moment alone before joining him as she is caught between starting a new life with Jack and her affection and sympathy for Kong (\"A Simple Prayer\"). Denham presents Kong in chains to the audience much to their astonishment. Ann and Jack rush onto the stage causing Denham to panic as he is worried they will try to turn the public against him. Ann tries to console Kong but when Denham orders the guards to remove her, despite Jack warning them not to touch her, Kong believes they are trying to hurt her and breaks free as Jack quickly escapes with Ann. Denham sends out the Avalanches to entertain and calm down the nervous crowd (\"Get Happy\").\nKong rampages through the city in search of Ann and kills few look-alikes, but Ann manages to find him and calm him down. He gently picks her up and takes her to the top of the Empire State Building as the public watch in awe. Denham is arrested despite his protests \"It was beauty killed the beast! Not me!\" (\"Rise\"). Atop, Ann and Kong share a moment (\"Full Moon Lullaby (Reprise)\") but it is cut short when airplanes begin to shoot at Kong. Ann desperately yells for them stop but they don't hear her. Kong is fatally shot in the neck and falls to his death (\"Amen, Opus 35\"). Below, Jack reunites with a devastated Ann while the crowd gather around to see Kong's dead body.\nBroadway\nAct I\nAnn Darrow, a girl from the countryside, comes to New York City to seek out her dream of being on Broadway (\"Prologue\"). She auditions for a show but does not make the cut (\"Dance My Way to the Light\"). Undaunted by the rejection, she tries to audition for a plethora of jobs (\"Queen of New York\"). After taking refuge in a diner to escape the cold New York streets, Ann meets a man named Carl Denham. Due to Denham's quick thinking, Ann is saved from being kicked out of the diner, and he reveals he is a director wanting a leading lady for a new movie, the details of which are kept secret, aside from the fact that the filming location is accessible only by boat. He promises Ann that if she takes the job, he'll make her a star. Ann agrees, and the two set off to the S.S. Wander, helmed by Captain Leviticus Englehorn and his crew (\"Building the Boat\").\nDenham quickly gives introductions as Englehorn comments on the fact that they're being trailed by another boat, Denham trying to ignore it. He tells an extremely wary Ann that the ship is loaded with gas bombs he built, which will only be used in case of an emergency. As the ship sets sail, Denham wonders about what may be on Skull Island (\"Setting Sail\"). The next morning, Ann gets woken up when Denham's main cameraman, Lumpy, unexpectedly goes on board and tends to her. Ann thanks him for his kindness and, after he leaves, he wonders about the consequences of his job (\"Cabin Soliloquy\"). Back on the main deck, Englehorn starts to distrust Denham (\"Pressure Up\").\nAfter two months on the water, Denham explains to Ann about the filming location, Skull Island, and Englehorn and his crew threaten Denham, demanding Denham to explain why they're going to Skull Island. Ann suddenly appears and threatens to blow the ship up using the gas bombs if they don't let Denham go, earning Denham's awe (\"The Mutiny\"). As Englehorn and his crew return to work, Ann defends her actions, saying that Denham is her ticket to getting off the streets just as the ship arrives. As everyone disembarks to explore, Denham tries to take a few shots of Ann playing with some vines until a giant ape named Kong captures her.\nDenham tries to film the beast but Kong swipes at him, smashing the camera in the process, grabs Ann, and carries her away (\"Skull Island\"). Kong brings Ann to a high cliff overlooking the forest (\"The Ascent\"). An enraged Denham tells the crew to leave the island and let Ann fend for herself, but upon hearing Lumpy's desire to see Kong, Denham decides to make Kong a tourist attraction. As they climb through the forest, he wonders about the opportunity and profit of capturing Kong. (\"The World\"). Meanwhile, Ann wakes up to face Kong in his cave. At first, she is frightened by the beast, but after having a roaring contest with him, she builds the courage to see beyond his harsh exterior. Kong protects her when she is almost attacked by a giant snake (\"The Cobra Fight\"), and as Ann patches his wounds, the two bond (\"Full Moon Lullaby\").\nWhile Kong falls asleep, Ann quickly runs off, back into the jungle. Kong quickly realizes she's gone, prompting him to chase after her (\"The Descent\"). Ann bumps into Denham and Lumpy, the latter of whom is overjoyed to see her, and the former telling her that a queen would scream for Kong. Ann remorsefully complies, bringing Kong to where the rest of the ship's crew is waiting, and causing Kong to get ambushed and knocked unconscious by the gas bombs (\"Kong's Capture\").\nAct II\n(\"Entr'acte: The Voyager Returns\") Back in New York, Denham advertises for his show in which he intends to present a now captive Kong to audiences (\"It's Man\"). During rehearsal (\"The Wild and Perilous Sea\"), a guilt-ridden Ann abandons the rehearsal and Denham chases after her, finding her outside the theater. She explains that she can't put on a show like this due to her friendship with Kong, but Denham threatens her with being deemed as insane and jobless.\nAnn, horrified at Denham's behavior, decides to visit a captive Kong. She explains that she never meant for any of the past events to happen and tries to comfort him (\"Last of Our Kind\"). At first, Kong doesn't respond to her, but after she notices that he's effectively dying, aggressively commenting on that fact, the two rekindle their friendship.\nOn the opening night, Ann is still unsure about Denham's show (\"Last of Our Kind\" (Reprise)), before going onstage and starting the performance. When it comes time for her to scream for Kong, she notices his declining health. Despite Denham's repeated demands for her to scream and wake Kong up, she defiantly refuses (\"Scream for the Money\"). She shouts for Kong to fight back and is quickly grabbed and dragged offstage, where she lets out a true scream. In response, Kong swiftly breaks free from his shackles as the curtain falls. Denham unsuccessfully tries to keep the audience and remaining actors onstage calm (\"Dance My Way to the Light\" (Reprise)) while Kong roars from behind the curtain.\nKong rampages through the city in an attempt to find Ann (\"Broadway Nightmare\"). The two finally find each other, and Kong, with Ann climbing on his back, takes off running as the army shoots him (\"NYC Chase\"). Kong stops at the bottom of the half-completed Empire State Building and immediately starts climbing it (\"Empire Ascent\"). Back at the ruined theater, Lumpy enters to tell Denham that he's quitting, explaining that what they did wasn't right and that it isn't about the money, leaving Denham alone (\"The World\" (Reprise)).\nOn top of the Empire State Building, Ann marvels over the view from there, but then notices that Kong is slowly dying and tries to reassure Kong just as Army planes arrive to shoot him down (\"Air War\"). Kong destroys some planes, but sustains injuries from the bullets to his body before another set of planes swoop by and finish him off, causing him to fall to the ground (\"Empire Soliloquy\"). Ann grieves over the loss of Kong as she manages to make her way down from the Empire State Building. As she reaches the streets, she tries to spread the word on how Kong wasn't a monster, or an attraction to be displayed, but a wonder (\"The Wonder\").\nCharacters and original cast\n{| class=\"wikitable\" style=\"width:1000;\"\n|-\n! Character\n! Melbourne (2013)\n! Reading (2016)\n! Workshop (2017)\n! Broadway (2018)\n|-\n! Ann Darrow\n| colspan=\"1\" align=\"center\" | Esther Hannaford\n| colspan=\"1\" align=\"center\" |Lora Lee Gayer\n| colspan=\"1\" align=\"center\" | Eva Noblezada\n| colspan=\"1\" align=\"center\" | Christiani Pitts\n|-\n! Carl Denham\n| colspan=\"1\" align=\"center\" | Adam Lyon\n| colspan=\"1\" align=\"center\" | Marc Kudisch\n| colspan=\"2\" align=\"center\" | Eric William Morris\n|-\n! Lumpy\n| colspan='2' \"text-align: center;\"\n| colspan=\"1\" align=\"center\" | Tom Nelis\n| colspan=\"1\" align=\"center\" | Erik Lochtefeld\n|-\n! The Bartender\n| colspan='2' \"text-align: center;\"\n| align=\"center\" | Bradley Dean\n|align=\"center\"|Harley Jay\n|-\n! Captain Englehorn\n| colspan=\"1\" align=\"center\" | Richard Piper\n| colspan='1' \"text-align: center;\"\n| align=\"center\" | Akron Watson\n|align=\"center\"|Rory Donovan\n|-\n! Jack Driscoll\n| colspan=\"1\" align=\"center\" | Chris Ryan\n| colspan=\"1\" align=\"center\" | Euan Morton\n| colspan=\"2\" \"text-align: center;\"\n|-\n! Cassandra\n| colspan=\"1\" align=\"center\" | Queenie van de Zandt\n| colspan=\"3\" \"text-align: center;\"\n|-\n! Benny\n| colspan=\"1\" align=\"center\" | Chris Ostrenski\n| colspan=\"1\" align=\"center\" | Robert Creighton\n| colspan=\"2\" \"text-align: center;\"\n|-\n! Young Jack\n| colspan=\"1\" align=\"center\" | Jack Stoddart\n| colspan=\"1\" align=\"center\" | Cole Edelstein\n| colspan=\"2\" \"text-align: center;\"\n|-\n! Voice of Kong\n| colspan=\"1\" \"text-align: center;\"\n| colspan=\"1\" align=\"center\" | Benny Elledge\n|align=\"center\"|Harley Durst\n|align=\"center\"|Jon Hoche\n|-\n! King Kong\n| colspan=\"1\" \"text-align: center;\"\n| colspan=\"1\" align=\"center\" | Sam Foster\n| colspan=\"2\" \"text-align: center;\"\n|}\nMusical numbers\nOriginal Melbourne production (2013)\n;Act I\n*\"Hunting Season\" – Carl Denham\n*\"Sweethearts on Parade\" – Busker Quartet\n*\"Brother, Can You Spare a Dime?\" – Company\n*\"What's It Gonna Take?\" – Ann Darrow\n*\"I Wanna Be Loved by You\" – The Company\n*\"Colossus\" – Carl\n*\"Special FX\" – Ann and Company\n*\"Perfect\" – Jack Driscoll\n*\"Foxtrot\" – Instrumental\n*\"Ritual\" – High Priestess and Company\n*\"The Ascent\" – Instrumental\n*\"In the Face of Forever\" – Jack\n*\"Full Moon Lullaby\" – Ann\n*\"The Chase\" – Instrumental\n;Act II\n*\"What's It Gonna Take? (Reprise)\" – Ann\n*\"The Greatest Show on Earth\" – Carl, Cassandra and Company\n*\"Dance with Me\" – Jack\n*\"A Simple Prayer\" – Ann\n*\"Kill 4 the Thrill\" – Carl and Company\n*\"Get Happy\" – Company\n*\"Rise\" – Cassandra and Company\n*\"Full Moon Lullaby (Reprise)\" – Ann\n*\"Amen, Opus 35\" – Instrumental\nOriginal Broadway production (2018)\n;Act I\n*\"Prologue\" – Company\n*\"Dance My Way to the Light\" – Female Ensemble\n*\"Queen of New York\" – Ann Darrow and Company\n*\"Building the Boat/Setting Sail\" – Carl Denham and Orchestra\n*\"Cabin Soliloquy\" – Ann and Company\n*\"Pressure Up\" – Captain Englehorn and Male Ensemble\n*\"The Mutiny\" – Carl, Captain Englehorn and Male Ensemble\n*\"Skull Island\" – Orchestra\n*\"The Ascent\" – Orchestra\n*\"The World\" – Carl\n*\"The Cobra Fight\" – Orchestra\n*\"Full Moon Lullaby\" – Ann\n*\"The Descent\" – Orchestra\n*\"Kong's Capture\" – Orchestra\n;Act II\n*\"Entr'acte: The Voyager Returns\" – Orchestra\n*\"It's Man\" – Carl, Ann and Company\n*\"The Wild and Perilous Sea\" – Company\n*\"Last of Our Kind\" – Ann\n*\"Scream for the Money\" – Ann and Company\n*\"Dance My Way to the Light (Reprise)\" – Orchestra\n*\"Broadway Nightmare\" – Ann and Female Ensemble\n*\"NYC Chase\" – Orchestra\n*\"Empire Ascent\" – Orchestra\n*\"The World (Reprise)\" – Carl\n*\"Air War\" – Orchestra\n*\"Empire Soliloquy\" – Ann\n*\"The Wonder\" – Ann and Company\nReception\nKing Kong opened on 15 June 2013 to mixed reviews. The majority of critics lauded the visuals and the cast, but reacted negatively to the music, book and lyrics. Aussie Theatre wrote: \"It's spectacular. Visually and technically, this is theatre that we haven't seen before\", but went on to say that \"the story isn't there. There's a plot based on assuming the audience know King Kong's film story, but it's filled with illogical leaps, clunky dialogue and the melodrama of unearned emotion. It feels like it was written around the spectacle\". In terms of the score, it wrote that \"the music is forgettable. It's not boring, but it doesn't move the story, show character or add much more than a beat for the spectacle that it's supporting\", claiming that \"the most successful number is Ann's lullaby to Kong on Skull Island\".[http://aussietheatre.com.au/reviews/oh-king-kong-you-gorgeous-sexy-magnificent-beast Oh King Kong! You gorgeous, sexy, magnificent beast] aussietheatre.com.au\nAustralian Stage reviewed the show similarly, writing: \"The storyline does suffer from a lack of character development and an over-use of musical numbers that are sometimes more razzle-dazzle than relevant to the actual story\". It also reacted negatively to the original character Cassandra: \"...adding [her] was another unnecessary idea. With little to do and dressed in a costume that seemed more relevant to Wicked, one was left bewildered by her presence, although Queenie van de Zandt produced another strong performance in the role\".[https://www.australianstage.com.au/201306166377/reviews/melbourne/king-kong-%7C-global-creatures.html King Kong | Global Creatures] australianstage.com.au In a 3 1/2 star review, The Sydney Morning Herald believed the show to \"[impress] on many levels\", adding, \"if it falls short, it's because our expectations are so sky high. As such, it is a showcase for a technology's potential and also its limitations. It is a novel, intermittently powerful but synthetic spectacle that seeks to be more\".[https://www.smh.com.au/entertainment/musicals/king-kong-clings-on-to-audiences-skyhigh-expectations-20130616-2obrb.html#ixzz2XziQq7P0 King Kong] smh.com.au\nThe Broadway production opened to overwhelmingly negative reviews, with harsh critique for Jack Thorne's \"stupefyingly banal\" book, Eddie Perfect's \"forgettable lyrics\", and the actors' \"shrill, one-note performances\". Critics were very impressed with the mechanical King Kong puppet, but felt that it did not make up for the rest of the production.\nAwards and nominations\nOriginal Melbourne production\n{| class=\"wikitable\" style=\"width:95%;\"\n|-\n! style=\"width:5%;\"| Year\n! style=\"width:20%;\"| Award ceremony\n! style=\"width:45%;\"| Category\n! style=\"width:20%;\"| Nominee\n! style=\"width:10%;\"| Result\n|-\n| rowspan=\"9\" style=\"text-align:center;\"| 2013\n| rowspan=\"9\"| Helpmann Awards\n| colspan=\"2\"| Best New Australian Work\n|\n|-\n| Best Female Actor in a Musical\n| Esther Hannaford\n|\n|-\n| Best Male Actor in a Supporting Role in a Musical\n| Chris Ryan\n|\n|-\n| Best Original Score\n| Marius de Vries (original music), Michael Mitnick and Richard Thomas (additional lyrics), featuring Songs and Original Compositions by 3D, Guy Garvey, Sarah McLachlan, Justice and The Avalanches\n|\n|-\n| Best Costume Design\n| Roger Kirk\n|\n|-\n| Best Scenic Design\n| Peter England\n|\n|-\n| Best Lighting Design\n| Peter Mumford\n|\n|-\n| Best Sound Design\n| Peter Hylenski\n|\n|-\n| colspan=\"2\"| Outstanding Theatrical Achievement *\n|\n|-\n|}\n* The award for Outstanding Theatrical Achievement was created by the Industry Awards Panel and Helpmann Awards Administration Committee for the \"design, creation and operation of King Kong – the creature\". The panel and administration felt that the \"ground breaking Australian creation, the first of its kind in the world, was worthy of individual recognition\".\nBroadway production\n{| class=\"wikitable\" style=\"width:100%;\"\n!Year\n!Award\n!Category\n!Nominee\n!Result\n|-\n| rowspan=\"11\" style=\"text-align:center;\" |2019\n| rowspan=\"3\" |Outer Critics Circle Awards\n|Outstanding Lighting Design (Play or Musical)\n|Peter Mumford\n|\n|-\n|Outstanding Projection Design (Play or Musical)\n|Peter England\n|\n|-\n| Outstanding Sound Design (Play or Musical)\n|Peter Hylenski\n|\n|-\n| rowspan=\"1\" |Drama League Awards\n| colspan=\"2\" |Outstanding Production of a Broadway or Off-Broadway Musical\n|\n|-\n| rowspan=\"2\" |Drama Desk Award\n|Outstanding Puppet Design\n|Sonny Tilders\n|\n|-\n|Outstanding Projection Design\n|Peter England\n|\n|-\n| rowspan=\"5\" |Tony Awards\n|Best Scenic Design of a Musical\n|Peter England\n|\n|-\n|Best Lighting Design of a Musical\n|Peter Mumford\n|\n|-\n|Best Sound Design of a Musical\n|Peter Hylenski\n|\n|-\n|Special Tony Award\n| Sonny Tilders and Creature Technology Company\n|\n|}\nReferences\nExternal links\n*\n*"
    }
  ]
}