{
  "content": [
    {
      "type": "text",
      "text": "# King George II Inn\n\n}}\nThe King George II Inn, located in Bristol, Pennsylvania, is believed to be the oldest continuously operated inn in the United States. It was first established in 1681 as the Ferry House by Samuel Clift. The inn was a main stopping point on the road from New York to Philadelphia. The inn overlooks the Delaware River and is located at the corner of Radcliffe and Mill Streets in the Bristol Historic District.\nBackground\nSamuel Clift obtained from Sir Edmund Andros, Provincial Governor of New York, a grant of  for a plantation across the river from Burlington, New Jersey, the site of Bristol in Pennsylvania. Clift established the ferry service between the Pennsylvania and New Jersey settlements and built an inn in Bristol to service the ferry business. In 1682 Samuel deeded his land and ferry to his son-in-law Joseph English, Jr.\nClift built the Ferry House as part of his operation taking people across the Delaware River. The property was leased by Michael Hurst in 1684 and was subsequently opened as an inn by Thomas Brook in 1705. The inn was purchased by Charles Besonett in 1735 who subsequently rebuilt the  inn larger following a fire on the property. The inn was renamed named the King George II Inn in 1765.\nAs George Washington's army approached Bucks County in 1781, the image of George II was replaced with a likeness of General Washington. Shortly afterwards, the inn was renamed the Fountain House. During the 1800s, Bristol was a popular resort and spa, and the inn catered to the travelers. In 1892, the inn was renamed Ye Olde Delaware House. The Mundy family purchased the inn in the mid 1950s and operated it as The Ye Olde Delaware House. Local businessman Francis O'Boyle bought the Inn in the early 1970s and reclaimed the name King George II Inn after renovations. The O'Boyle family sold it in the early 1980s after Francis' death.\nThe restaurant closed in 2010,  and opened again less than a year later in 2011.  The Inn came under its current ownership in 2015.\nSee also\n* King's Highway (Charleston to Boston)\n* Washington-Rochambeau Revolutionary Route\n* McGillin's Olde Ale House\nReferences\nExternal links\n*[http://www.kginn.com King George II Inn Web Site]\n*[http://www.visitbuckscounty.com/listing/historic-king-george-ii-inn/3712 Historic King George II Inn] Visit Bucks County"
    }
  ]
}