{
  "content": [
    {
      "type": "text",
      "text": "# Kings–Tulare Regional Station\n\n| coordinates        =\n| map_type           = USA California\n| AlternativeMap     = Relief map of California.png\n}}\nKings–Tulare Regional Station is a planned California High-Speed Rail station serving Kings County and Tulare County, California.  It will be located near the intersection of Hanford Expressway and Central Valley Highway, just east of the city limits of Hanford and less than  west of the larger city of Visalia. The construction of the station has been controversial, with Tulare County supporting the station while Kings County, where the station would be located, has strongly opposed the entire California High-Speed Rail project.\nHistory\nPlanning\nThe current Amtrak Gold Runner service in the Central Valley uses the BNSF Railway tracks through the center of Hanford, stopping at an existing station there.  However, a high-speed rail route along this alignment was strongly opposed by Hanford city officials, who said that it would disrupt the city's historic downtown.  This meant that only routes that bypassed Hanford city limits were considered. An alignment along Route 99 was ruled out due to the extra expense and uncertain cooperation from Union Pacific Railroad, which has its own track in the vicinity.  This left routes through rural areas, which ran into opposition from farmers whose land would be taken.\nIn October 2011 the Kings County Board of Supervisors voted to oppose all possible alignments through that county. In December 2011 the Kings County Association of Governments turned down a station planning grant that it had already been approved for due to opposition within the county. Tulare County and the City of Visalia continued to pursue a similar grant, leading to complaints from Kings County officials that Tulare County was sidelining Kings County's jurisdiction. Hanford officials also complained that the opening of the high-speed rail station would lead to a loss of service to the existing downtown Amtrak station, negatively affecting the city's tourism industry due to the new station being  from the city center.\nThe initial plans called for the high-speed rail line to diverge from the BNSF line and run east of Hanford city limits, with a west bypass not considered due to increased impacts on wetlands and farmland, negative effects on potential development between Hanford and Lemoore, and increased distance from Visalia.  However, in October 2011 the California High-Speed Rail Authority recalled its draft environmental impact report to produce a new one that would consider both routes. An initial report in April 2013 indicated that the western alternative with below-grade tracks was preferred. However, in November 2013 the Authority approved the original eastern alignment for largely the same reasons that it was initially preferred, along with the discovery that the groundwater in the western area was only  to  below ground level due to an impermeable clay formation, making a below-grade track unfeasible there.\nIn August 2015, the Hanford City Council rejected contributing $100,000 to a planning grant that included a potential light rail line connecting the high-speed rail station to the centers of Hanford and Visalia, the Cross Valley Corridor. Tulare County had already approved its $100,000 contribution, and the California High-Speed Rail Authority had promised $600,000, but Hanford's rejection killed the entire grant. Tulare County and Visalia officials indicated that they would seek funding to plan for a connectivity study potentially including light rail even without the assistance of Kings County or Hanford.\nConstruction\nIn November 2019, it was announced that construction of the viaduct leading to the station would begin the following month.  The design at this point had changed from an at-grade to an elevated station on a mile-long viaduct, with the benefits of having a smaller footprint, avoiding modifications to the Union Pacific Railroad line and an electrical transmission line at the location, and allowing potential Cross Valley Corridor service to be accessed at-grade beneath the high-speed rail tracks.\nReferences"
    }
  ]
}