{
  "content": [
    {
      "type": "text",
      "text": "# King Brothers Productions\n\nKing Brothers Productions was an American film production company, active from 1941 to the late 1960s. It was founded by the Kozinsky brothers, Morris (Maurice, Maury, Morrie; September 13, 1909 – September 2, 1977), Frank (April 1, 1913 –  February 12, 1989), and Hyman (Herman, Hy, Hymie; July 4, 1916 – July 20, 1992), who later changed their professional surname to \"King\". They had notable collaborations with such filmmakers as Philip Yordan and William Castle and are particularly remembered today for employing a number of blacklisted writers during the Red Scare of the late 1940s and 1950s. Their films include  Dillinger (1945), Suspense (1946), Gun Crazy (1949), Carnival Story (1954), The Brave One (1956—which earned writer Dalton Trumbo a Best Story Academy Award), Gorgo (1961), Captain Sindbad (1963), and Heaven With a Gun (1968).\nCareer\nJoseph Kozinsky (born 1884 in Dnipro - died 1950) was a New York fruit merchant who, with his wife Sarah (known affectionately as 'Mama King'), produced five children, brothers Morris, Frank, and Hyman, and sisters Rose and Nettie. The family moved to Los Angeles in the 1920s. Morris and Frank did various odd jobs including selling newspapers and shining shoes before getting into slot machines. They borrowed $250 and built an empire up to 19,000 machines. They also branched into race horses.\nIn 1940, the brothers, along with their sister Nettie Segal, were charged with tax evasion, with the intention of exposing how kickbacks from pinball machine operators had been paid to Kent Kane Parrot and previous Los Angeles city officials.\nEntering the Film Industry\nThe same year, Morris Kozinsky looked at getting into slot machine movies. They built a slot machine projector called the Hollywood TalkiTone and formed a partnership with film producer Cecil B. De Mille who was to make 16mm films for the machines through a new company, fronted by De Mille, Hollywood Quality Pictures Incorporated - although De Mille's exclusive contract with Paramount Pictures prevented him from taking an active part as a producer for the company. Morris later recalled:\nDe Mille, he has an inferior complex. It takes two weeks to get into see him. Well, we didn't like that. We're just plain businessmen. We finally told him we had to get some pictures. He said he was going to get Sally Rand to make some. Then he said he had a deal with some trapeze artists. Well, you know yourself, you're out with a gal relaxing in a bar, you don't want to see no bubble dancer or acrobat. You want to hear some good music. You want something with class. You want to see Bing Crosby maybe. That was the trouble. De Mille might make big epics but for us he didn't have no class.\nThe Kozinskys decided to abandon slot machine projecting for actual film production. Morris said he told his brother Frank:\nWhat is this racket, anyway? If De Mille can do it, why can't we? We're clever guys, we couldn't lose more than ten or twenty thousand dollars. Maybe we should make a movie. Then maybe we can forget how he made us look like mugs.\nThe brothers knew Hollywood personalities like Louis B. Mayer and Frank Capra from the racetrack and asked them for advice. \"So we had to go ahead\", said Morris. \"Or else we would have looked cheap to Mayer and Capra because we'd told them about it.\"\nThey formed KB Productions and made the film Paper Bullets, releasing through Producers Releasing Corporation in exchange for $19,500 and 50% of the profits. The movie was shot at Talisman Studios over six days. It was a success and the brothers were launched as film producers.\nIn 1942, the Kozinskys changed their surnames to \"King\".\nThey had an enormous success with Dillinger (1945). Morris told the press at the time:\nNobody discovered us – we discovered ourselves. We didn't come in to this business as paupers and we won't go out of it as paupers ... It's like this- we're honest and our door is open to everybody. We've got no overhead – our overhead begins when we start shooting and ends the day we put the film in the can. That's the way we do business and we're not going to stop until we get an Academy Award and land one of our pictures in the Radio City Music Hall.\nDillinger was written by Philip Yordan, who would work for the brothers on numerous occasions. He later described them:\nFrank was like a 300-pound Chinaman. Always a big cigar in his mouth and a drawer full of Hershey bars. Always wondering why he was so fat because, he says, \"I don't eat.\" Maurice had been a prize fighter and would always have black coffee, but he was heavy too. When I first met them ... they weren't gangsters but they had [investments in] slot machines and they were probably running something [illegal] in town. Nobody questioned it. They had a few bucks, not rich, but they had a few bucks ... They were very honest. And they always paid me.\nThe Kings had a production assistant, Arthur Gardner, who later recalled \"Frank was the smartest brother and the leader. Maurie watched the money and Hymie just kind of tagged along ... Frank had a good story mind and supervised everything ... I believe Frank King would have succeeded in any business. He was a sharp as a tack.\"\nIn 1945, they announced plans to make their most expensive film yet, the musical Golden Girl starring Belita. The film was released as, Suspense.\nNew Company\nIn September 1950, the King Brothers changed how they financed their films. They publicly floated their company, getting permission to use a million $1-par shares. They issued $300,000 worth of shares and used it to finance Drums in the Deep South. $300,000 was later raised for The Syndicate. The King Brothers paid $70,000 for 70,000 of their own shares. There were over 700 shareholders and the King Brothers took 50% of the profits.\nThe King Brothers later sued RKO for mismanaging the distribution and sale of three of their films, The Brave One, Carnival Story and Drums in the Deep South, claiming $6,030,000 in damages.\nSelect filmography\n*Paper Bullets (1941)\n*I Killed That Man (1941)\n*Klondike Fury (1942)\n*Rubber Racketeers (1942)\n*I Escaped from the Gestapo (1943)\n*The Unknown Guest (1943)\n*''Johnny Doesn't Live Here Anymore (1944)\n*When Strangers Marry (1944)\n*Dillinger (1945)\n*Suspense (1946)\n*The Gangster (1947)\n*The Dude Goes West (1948)\n*Bad Men of Tombstone (1949)\n*Gun Crazy (1950)\n*Southside 1-1000 (1950)\n*Drums in the Deep South (1951)\n*Mutiny (1952)\n*The Ring (1952)\n*Carnival Story (1954)\n*Circus of Love (1954)\n*The Brave One (1956)\n*Rodan (1956)\n*Gorgo (1961)\n*Captain Sindbad (1963)\n*Maya (1966)\n*Return of the Gunfighter (1967)\n*Maya (1967–68) – TV series\n*Heaven With a Gun (1968)\nUnmade films\n*Wire Service (1942) – the life of Moe Annenberg\n*A Million Spies (1942)\n*Blood Money (1942)\n*Money Talks (1942)\n*I Was a Prisoner of Japan (1944)\n*I Killed Hitler by Robert Kehoe (1944)\n*Absent Without Love (1945) by Niven Busch\n*Lady Member (1944) based on story by Damon Runyon\n*The Honest Gambler (1945) by Philip Yordan\n*Payment Due (1945) with Lawrence Tierney\n*Focus (1946) based on novel by Arthur Miller\n*The Dark Road (1946) by Doris Disney\n*Tijuana (1947)\n*The Syndicate (1951)\n*The Black Lash (1952) – about the Angola Prison Farm\n*Memo to Mike (1952) – a musical with Dimitri Tiomkin\nIn popular culture\nFrank Kozinsky was portrayed by actor John Goodman and Hymie (Herman) Kozinsky was portrayed by actor Stephen Root in the 2015 film Trumbo''.\nReferences"
    }
  ]
}