{
  "content": [
    {
      "type": "text",
      "text": "# King David School, Melbourne\n\n| motto_translation     = To Know and Understand\n| established           =\n| type                  = Independent  comprehensive co-educational early learning, primary, and secondary Jewish day school\n| denomination          = Jewish\n| religious_affiliation =\n| principal             = Marc Light\n| address               =\n| location              = Armadale, Melbourne, Victoria\n| country               = Australia\n| coordinates           =\n| campus                =\n| gender                = Co-educational\n| enrolment             = 800\n| faculty               =\n| grades                = Early learning; K–12\n| grades_label          = Years\n| ratio                 =\n| colours               = Gold and blue\n| affiliation           = Eastern Independent Schools of Melbourne\n| homepage              =\n}}\nThe King David School is an independent  comprehensive co-educational early learning, primary, and secondary progressive Jewish day school, located in Armadale, a suburb of Melbourne, Victoria, Australia. The school currently caters for approximately 800 students from early learning to Year 12, and is affiliated with the Victorian Union of Progressive Judaism.\nHistory\nThe King David School was first envisioned in the 1970s, by several progressive Jews in Melbourne, and rabbis from Temple Beth Israel. The first property was a site on Kooyong Road; purchased in 1978, it was named the Joyce and Mark Southwick Campus, for two key influential figures in the school's opening.\nAs Australia's first Progressive Jewish day school, it welcomed its first class of 45 students in 1978 under the headship of Principal Norman Rothman. In 1984, the Magid Campus was purchased on Orrong Road; the name honours one of the school's leading supporters, Isadore Magid.\nThe School rapidly rose in student numbers, and celebrated the centennial year of 2000 by extending to Year 12 for the first time in its history.\nCampuses\nThe King David School consists of three campuses in the Metropolitan Armadale area of Melbourne, close to the city's Jewish community. These campuses are the Junior School (Kinder to Year 5) and the Senior School (Magid Campus) for Years 6 to 12 students), and the Rebecca Magid Center (opposite the Senior School) which is a performing, visual arts and sports centre.\nCurriculum\nKing David School prepares students for the Victorian Certificate of Education (VCE), achieving high academic results. The school's LOTE (Languages Other Than English) program includes Hebrew, French and Mandarin.\nCo-curriculum\nKing David School offers co-curricular programs in sport, music, drama, debating, outdoor education, STEM programs and in 2019 they launched their first F1 in schools team. In 2008 they became the first known school to run a teacher sanctioned Dream Team league.\nSport\nThe school's sports program is facilitated through its membership of the Eastern Independent Schools of Melbourne (EISM).\nEISM Premierships\nKing David School has won the following EISM senior premierships.\nBoys:\n* Basketball (2) – 2013, 2018\n* Table Tennis (3) – 2005, 2012, 2014\n* Tennis (4) – 2013, 2015, 2019, 2020\nGirls:\n* Basketball (2) – 2014, 2015\n* Netball – 2013\n* Table Tennis – 2014\nNotable alumni\n*David Eldar – 2017 and 2023 World Scrabble Champion and professional poker player\n*Alexandra Kiroi-Bogatyreva (born 2002) – Olympic rhythmic gymnast, 2018 and 2022 Commonwealth Games medallist, (1 gold, 1 silver, 3 bronze)\n*Nevo Zisin – writer and transgender rights activist\nSee also\n* King David School (disambiguation)\n* Jewish culture\n* Torah study\n* Reform Judaism\n* List of non-government schools in Victoria\n* Judaism in Australia\nReferences\nExternal links\n* [http://www.kds.vic.edu.au/ King David School Website]"
    }
  ]
}