{
  "content": [
    {
      "type": "text",
      "text": "# King George whiting__disambig_1\n\n| range_map = KG whiting World Distribution Map.jpg\n| range_map_caption = Range of the King George whiting\n}}\nThe King George whiting (Sillaginodes punctatus), also known as the spotted whiting or spotted sillago, is a coastal marine fish of the smelt-whitings family Sillaginidae. The King George whiting is endemic to Australia, inhabiting the south coast of the country from Jurien Bay, Western Australia to Botany Bay, New South Wales in the east. The King George whiting is the only member of the genus Sillaginodes and the largest member of the smelt-whiting family Sillaginidae, growing to a length of 80&nbsp;cm and 4.8&nbsp;kg in weight. The species is readily distinguishable from other Australian whitings by its unique pattern of spots, as well as its highly elongate shape. King George whiting are often found in bays and protected waterways over sand and seagrass beds, also venturing out onto deep continental shelf reefs during adulthood. The species is a benthic carnivore, consuming a variety of crustaceans, polychaete worms, molluscs and fish. The King George whiting forms the basis of one of southern Australia's most important commercial fisheries, reportedly worth over five million Australian dollars per year. The species is also heavily targeted by recreational anglers, who value the whiting for its sporting and eating qualities.\nTaxonomy and naming\nThe King George whiting is the only species nested in the genus Sillaginodes, which itself is in the family Sillaginidae, containing all the smelt whitings. The Sillaginidae are part of the Percoidei, a suborder of the order Perciformes.\nThe King George whiting was first officially named by Cuvier in 1829 as Sillago punctata, based on an individual taken from King George Sound in Western Australia. In 1861, Theodore Gill created the monotypic genus Sillaginodes based on a number or morphological characteristics and assigned S. punctatus to it. A number of synonyms have been applied after the initial correct naming, apparently due to Cuvier not designating a holotype, or it being lost. A lectotype was finally designated by McKay in 1985. The species has a variety of common names (many now obsolete), with the most common, \"King George whiting\", taken from the name of the body of water where the initial description was made. It is also often called the spotted whiting in reference to its obliquely positioned bars of brown spots, with other names used in markets, especially outside of Australia.\nDescription\nThe King George whiting has the same overall profile as the rest of the sillaginid fishes, an elongate, slightly compressed body with a tapering head and terminal mouth. The genus Sillaginodes is distinguished by a first dorsal fin with twelve or thirteen spines and the second dorsal fin with a single spine and 25 to 27 soft rays. The vertebrae number between 42 and 44 in the genus.\nThe King George whiting is the only member of the genus Sillaginodes and is further distinguished from any other possible taxa assigned to that genus by a number of distinct anatomical features. It is the largest of the Sillaginid fishes with 129 to 147 lateral line scales, and like all fishes in the family is best distinguished by the shape of its swim bladder. In plan view, the swim bladder has a land slug-like appearance, with a posteriorly tapering extension and two anterolateral extensions or 'horns'. There are no duct-like processes on the ventral surface unlike taxa in the genus Sillago.\nIn situations where identification is needed quickly, the colour of the King George whiting is also very distinctive, with a pale golden brown to olive brown top colour and white to silver colour on its underside. The species also as distinct obliquely positioned rows of brown spots running the length of its body, which are apparent to see even after removal from the water and after death. The caudal, anal and pectoral fins are usually a light brown, with some having olive green caudal fins.\nIt is the largest member of Sillaginidae, growing to a maximum length of 72&nbsp;cm long and 4.8&nbsp;kg in weight.\nDistribution and habitat\nbeds amongst sand patches]]\nThe King George whiting is endemic to Southern Australia, ranging lower Western Australia, South Australia, Victoria and occasionally even lower New South Wales. The westernmost reported capture was in Jurien Bay and the furthest east King George whiting have been reported from is Botany Bay in New South Wales (although this appears to be a rare occurrence).\nKing George whiting are most commonly found in tidal bays, estuaries and creeks along the coast of the mainland and numerous islands scattered throughout the species' range.\nThere is a distinct difference in habitat between the adult and juvenile fish, with the juveniles more inclined to inhabit shallower waters in protected bays, creeks and estuaries. A favourite habitat of young fish appears to be Zostera and Posidonia seagrass beds in protected bays, apparently using the seagrass as protection and for foraging purposes.\nJuveniles tend to form schools of varying sizes, occasionally schooling with other species, including other members of the family Sillaginidae. Adults tend to be solitary and found in deeper water in a range of habitats including bays, offshore surf gutters, broken bottom and deep reef, also venturing into shallower water on occasion.\nBiology\nDiet\nThe King George whiting's distinctive body shape and mouth placement is an adaptation to bottom feeding, which is the predominant method of feeding for all whiting species.\nAll larger whiting feed by using their protrusile jaws and tube-like mouths to suck up various types of prey from in, on or above the ocean substrate.\nThere is a large body of evidence that shows whiting do not rely on visual cues when feeding, instead using a system based on the vibrations emitted by their prey.\nStudies of gut content have shown that the primary food items of King George whiting are amphipods, copepods and polychaete worms.\nUnlike any of its relatives, the King George whiting does not appear to feed on molluscs, which is unusual because in many parts of Southern Australia, the main bait used by recreational fishers to catch whiting is the cockle; a mollusc, but then, it has been deshelled.  An excellent bait for catching King George Whiting is raw king prawn, such as banana prawn.  They are better bought in the shell and peeled shortly before using, as this keeps the bait fresh. Also rare in the diet are echinoderms, which are frequent prey for other species of Sillago.  This may be a function of niche partitioning, as in many areas the King George whiting's habitat overlaps with other species of the genus Sillago. Other minor components of the diet include crustaceans such as carids, leptostracans, stomatopods, crabs, tanaids, cumaceans and isopods as well as other fish and benthic algae.\nAs previously mentioned, younger fish tend to school when foraging, and have been known to forage in groups with other species such as silver trevally, tarwhine and other species of whiting.\nLarger fish tend to occupy areas with larger species such as Australasian snapper, blue morwong and larger trevally.\nPredators\nKing George whiting, especially juveniles, are known to be common prey for a number of larger inshore fishes and wading birds. The most prominent inshore predators are Australian salmon, members of the flathead family, the barracouta (a snake mackerel), snook as well as various species of sharks and rays.\nVarious species of diving birds, particularly the pied cormorant are also common predators of the species, as are marine mammals such as bottlenose and common dolphins.\nReproduction\nKing George whiting reach sexual maturity at three to four years of age, with males reaching 30&nbsp;cm in length and females 34&nbsp;cm. These lengths are used as guides when setting minimum legal lengths for the species, allowing adequate time for an individual to reproduce before being taken.\nSpawning occurs in a range of areas, depending on the geographic locality of the individual; some spawning in deeper water up to 9 m deep, others in estuaries. May and June are the most common times for spawning, with some spawning events recorded as early as February and as late as July. Juvenile fish are recruited to areas by ocean currents, with studies showing the species is too weak a swimmer to be able to undertake long distance journeys. The location of spawning also has implications for the location of the juveniles, as with some estuary breeding individuals.\nRelationship to humans\nThe King George whiting is a highly rated food fish and is common in southern Australia and so has become a major component of the commercial and recreational fisheries in this region, with aquaculture potential still being explored but apparently of low value.\nCommercial fishery\nThe main commercial King George whiting fishery is centred on South Australia from Ceduna in the west to Gulf St Vincent in the east. Smaller fisheries are present in Victoria and south west Western Australia. Common catching practices include haul seine nets, gill nets as well as longline and handline methods. This fishery is one of the most important in the country, reportedly worth five million Australian dollars a year, as King George whiting fetch premium price in markets. This single species alone was reported as comprising 60% of the total annual catch in South Australia during the late 1980s. The fish are sold either whole or as fillets and are generally rated as one of the very best quality Australian fish for the table, and are ubiquitous in Fish and chips shops.\nRecreational fishery\nIn Southern Australia, the King George whiting is often the sole target for fishermen who seek it for its high quality eating. A number of coastal towns rely heavily on the species as a tourism drawcard for anglers seeking a range of fish and crustacean species, but King George whiting is often the most desired catch. They are a relatively easy species to catch, with no special baits, rigs or techniques required and are often caught from jetties, beaches and rocks; meaning a boat is not necessary. Simple rigs such varieties of running ball sinker or paternoster rigs are commonly used, with a fixed sinker employed in area of high tidal movement. As mentioned previously, molluscs, particularly the Goolwa cockle are common bait, with varieties of worms, gents, squid, cuttlefish, fish pieces and especially raw king prawn are commonly successful. The larger fish inhabiting deep reefs are often caught on whole pilchards while fishing for snapper and morwong.\nThe King George whiting has differing size and bag limits for anglers in different states. In Victoria, there is a minimum size limit of 27&nbsp;cm and a bag limit of 20 per person.\nSouth Australia is divided into two zones concerning the taking of this species, with fish caught east of longitude 136° restricted to a minimum length of 32&nbsp;cm and fish caught to the west of longitude 136° having a minimum length of 30&nbsp;cm. In both divisions, the bag limit is 10 fish per person.  Western Australia has set a minimum legal limit of 28&nbsp;cm and a bag limit of 8 per person.\nAquaculture\nDue to the King George whitings' popularity as a food fish, extensive investigations into the viability of the species as an aquaculture species have occurred, with most initial investigations indicating the long larval cycle is a major barrier to the successful farming of the fish. Other problems have arisen in a parasite previously unknown in the species only affecting the fish in captivity. Thyroid growth hormones may be used in the future to hasten growth of larvae and make such ventures more feasible.\nReferences\nExternal links\n* [http://www.pir.sa.gov.au/fisheries/recreational_fishing/target_species/king_george_whiting Primary Industries - King George whiting]\n* [https://web.archive.org/web/20070830132116/http://www.fishsa.com/kgwhitng.php Fishing for King George whiting]\n* [https://reeflifesurvey.com/species/sillaginodes-punctatus Sillaginodes punctatus King George Whiting]"
    }
  ]
}