{
  "content": [
    {
      "type": "text",
      "text": "# Kings of the City__disambig_1\n\nKings of the City was a British rock and hip hop band from London, England. The band consisted of rappers Ali Bla Bla and Koken, lead singer and guitarist Danny Wilder, bassist Memari Man, guitarist Richie 2 Pun, drummer Royal and synthesiser  player 8bit. In 2011 they released a single with Klashnekoff, and undertook a UK tour with Maverick Sabre.\nHistory\nThe band was established by rapper Ali Bla Bla after meeting lead singer Danny Wilder at a Busta Rhymes concert at London's Wembley Arena. Ali turned to old school friends Richie 2 Pun, Memari Man and Koken as well as brother 8bit (who introduced drummer Royal to Ali) and formed the band.  Their debut single, \"I Try\", was released on 31 August 2010, gaining support from BBC Radio 1 and BBC Radio 1Xtra. They achieved further cult success through singles \"Listen To The Old Man\" (released 1 November 2010) and \"Darkness\" featuring Klashnekoff (released on 11 March 2011).\nOn 13 July 2012, the band released their biggest underground hit, \"Make Me Worse\", and went onto BBC Radio 1xtra to perform live on Charlie Sloth's Fire In The Booth. They gained additional popularity through a remix of \"Make Me Worse\" by British DJ Muzz, which was released on Canadian independent record label Monstercat and reached over two million views on YouTube.\nThe band's lead singer Danny Wilder died of lung cancer on 3 October 2013, at the age of 27.  Ali Bla Bla released the following statement via the band's Facebook page: \"For the first time in my life, I am lost for words. Our brother, friend, leader, singer, guitarist, front man and all around boss, Danny Wilder, passed away yesterday morning. The world will never be the same again. Our respect and deepest sorrows are with his family and loved ones.\"\nTheir first full-length album und final release, titled No Snake was released as a tribute to Danny Wilder's legacy with the help of a successful Kickstarter campaign on 14 August 2015. The Kickstarter raised a total of £14,129 from 338 backers on 14 September 2014. The album features other talent such as Maverick Sabre and Klashnekoff and consists of 14 tracks. Several tracks, such as \"Make Me Worse,\" \"Please Tell Me,\" \"Wrong\" and \"Doors Are Open\" received live action music videos. The albums total length is 1:03:16, and the album can be viewed in its entirety on YouTube.\nTour\nFollowing a cover of Maverick Sabre's UK chart single \"Let Me Go\" for youth broadcaster SB.TV, the band were invited to support Sabre on his 2011 UK tour.\nDiscography\n* Listen to the Old Man - 20 December 2010, EP\n* Covers - 24 October 2011, EP\n* No Rules to the Game - 1 December 2011, EP (25:31)\n1. Make Me Worse 0:00\n2. Whispers (Feat. Setarreh) 3:25\n3. If You Want A Killer 7:53\n4. Losing You 11:28\n5. Listen To The Old Man 15:08\n6. Mirage 19:28\n7. Revelator (Feat. Salar) 22:27\n* No Guts - 6 August 2012, EP\n* No Glory - 28 September 2012, EP\n* No Snake - 14 August 2015, LP (1:03:16)\n1. Make Me Worse 0:00\n2. Please Tell Me 3:26\n3. Casino ft. Maverick Sabre 7:09\n4. Sun is Rising 10:52\n5. Wrong 15:49\n6. They Know Nothing 20:06\n7. Pusher Man 24:47\n8. All The Same 29:20\n9. Can't Let it Go 34:07\n10. Doors Are Open 38:02\n11. Lonesome Dog 42:38\n12. Red ft. Klashnekoff 46:16\n13. No Snake 52:08\n14. Colours 59:17\nReferences\nExternal links\n*[http://www.soulculture.co.uk/blogs/kings-of-the-city-fuse-grime-hip-hop-rocknroll-epk-video/ Soulculture.co.uk]\n*[https://web.archive.org/web/20110227181323/http://hangout.altsounds.com/news/126374-kings-of-the-city-darkness-feat-klashnekoff.html Hangout.altsounds.com]\n*[https://web.archive.org/web/20120330050546/http://music.uk.msn.com/blog/editor-blogpost.aspx?post=24502ea3-6f75-46bf-8062-463be999a2dd Music.uk.man.com]\n*[https://web.archive.org/web/20120514034306/http://sbtv.co.uk/2012/02/kings-of-the-city-fire-in-the-booth-video/ Sbtv.co.uk]\n*[https://web.archive.org/web/20111010032518/http://sbtv.co.uk/2011/09/sb-tv-kings-of-the-city-let-me-go-maverick-sabre-cover-music-video/ Sbtv.co.uk]"
    }
  ]
}