{
  "content": [
    {
      "type": "text",
      "text": "# King Kelly (film)__disambig_1\n\n| writer         =\n| screenplay     = Mike Roberts\n| story          =\n| based_on       =\n| narrator       =\n| starring       =\n| music          =\n| cinematography =\n| editing        = Brad Turner\n| studio         = SeeThink Films\n| distributor    = GoDigital Media Group\n| released       =\n| runtime        = 84 min.\n| country        = United States\n| language       = English\n| budget         =\n| gross          =\n}}\nKing Kelly is a 2012 independent film that follows a young woman (the eponymous \"Kelly\", played by Louisa Krause) who is obsessed with gaining celebrity through her webcam stripteases, and her best friend Jordan (Libby Woodbridge) as they try to reclaim her car after it is stolen by her ex-boyfriend on the 4th of July. The film was directed by Andrew Neel and filmed almost entirely on cellphone cameras.\nKing Kelly was shown at several 2012 film festivals, including South by Southwest, the Taipei Golden Horse Film Festival, and the Puchon International Fantastic Film Festival where Louisa Krause was awarded \"Best Actress\".\nPlot\nKing Kelly is a teenage webcam porn performer, reveling in the attention and tips from her assorted admirers. Away from the webcam, she films herself constantly with her cellphone's camera, while also being paid to transport drugs around Long Island. On July 4, also her father's birthday, Kelly's ex-boyfriend Ryan takes back the car he paid for, which unfortunately for Kelly still has a package of drugs in the trunk that she was supposed to deliver. After a failed attempt with her friend Jordan to get the car back, Kelly attends the family birthday party, fights with her aunt, and huffs off on foot. Kelly and Jordan go to a friend's party, where Kelly flirts with Jordan's boyfriend, and learns from her drug contact that if she doesn't recover the drugs – which are not pills as she believed, but $20K of heroin – then the owner of said drugs will kill her.\nKelly manages to patch her relationship with Jordan, and they drive off in Jordan's father's SUV to find Ryan, who they learn drove the car to a club on Staten Island. Both girls are high on ADHD pills and cocaine, and crash the SUV into a tree. Desperate, Kelly contacts her biggest fan, \"Poo Bare\", a state trooper. Poo Bare helps them find the car, but the drugs are not there; he now demands that she sleep with him in return for his forcing Ryan to take them to the missing package. After some more misadventures, they recover the heroin from Ryan's dad's garage.\nNow very early on July 5, the group goes to a motel. Poo Bare puts both Ryan and the cocaine-addled Jordan in the bathroom – with Ryan handcuffed to the toilet – and he and Kelly proceed to strip and have sex, with Kelly filming them the whole time. Ryan convinces Jordan to get the handcuff keys from Poo Bare's belt; freeing himself, he then shoots Poo Bare in the back with the trooper's gun, then runs outside. Kelly leaves Poo Bare, ordering him to never tell anyone what happened, and with Jordan attempts to chase down Ryan. When they lose him, Jordan runs from the car screaming, but forgets her phone. Kelly discovers that Jordan posted a video of Kelly from early in the film, and the comments on it are less than complimentary. Apparently hurt emotionally, Kelly binges on a pile of cheeseburgers.\nReception\nKing Kelly has a 75% rating on Rotten Tomatoes, based on 8 critic reviews. David Noh, writing for Film Journal International, called it \"One of the cleverest, funniest and most appallingly true films of the year.\" However, some critics panned the film, such as Slant Magazines Diego Costa, who said \"the film feels, much like its protagonist's persona, fake. It isn't interested in exploring the nuances of her character, her predicaments, or her contradictions... There's no gravitas, no seriousness.\"\nReferences\nExternal links\n*[http://seethink.com/king-kelly/ King Kelly info page at SeeThink Films' website]\n*[http://www.kingkellythemovie.com/ Official film website]\n*"
    }
  ]
}