{
  "content": [
    {
      "type": "text",
      "text": "# King Leopold's Soliloquy\n\n'King Leopold's Soliloquy' is a 1905 pamphlet by American author Mark Twain. Its subject is Leopold II's rule over the Congo Free State. A work of political satire harshly condemnatory of his actions, it ostensibly recounts a fictional monologue of Leopold speaking in his own defense.\nContent\nKing Leopold II raves madly about the good things that he says he has done for the people of the Congo Free State, including the disbursement of millions on religion and art. He says he had come to Congo with piety \"oozing\" from \"every pore\", that he had only wanted to convert the people to Christianity, that he had wanted to stop the slave trade.\nLeopold II says that he did not take any of the government money, that he did not use the revenues as his personal \"swag\", and that such claims by the \"meddlesome American missionaries\", \"frank British consuls\", and \"blabbing Belgian-born traitors\" are wholly false. He asserts that for a king to be criticized as he has been is blasphemy—surely, under the rule of God, any king who was not doing God's will would not have been helped by God.\nThe book mentions the critical report by the missionary William Henry Sheppard on an 1899 massacre of over 80 people by Zappo Zaps sent to collect taxes.\nLeopold claims that his critics only speak of what is unfavorable to him, such as the unfair taxes that he levied upon the people of the Congo, which caused starvation and the extermination of entire villages, but not of the fact that he had sent missionaries to the villages to convert them to Christianity.\nPublication\nThe book was published in English, French, German and Italian. Two German-language editions were published in East Germany in 1961 and 1967 and an additional edition was published in 2014. The American publisher P. R. Warren Company from Boston, donated all surplus to relief and aid in the Congo atrocities.\nSee also\nand E. D. Morel.]]\n*\n*\n*\nReferences\nExternal links\n*[http://diglib1.amnh.org/articles/kls/ ''King Leopold's Soliloquy'' by Mark Twain] PDF download at American Museum of Natural History\n*\n*[http://diglib1.amnh.org/articles/kls/index.html AMNH.org's (American Museum of Natural History) PDFs of ''King Leopold's Soliloquy'']\n*[http://chss.montclair.edu/english/furr/i2l/kls.html Full online text of Twain's ''King Leopold's Soliloquy''] ([https://web.archive.org/web/20120702131349/https://msuweb.montclair.edu/~furrg/i2l/kls.html archive.org, 2 July 2012])\n*"
    }
  ]
}