{
  "content": [
    {
      "type": "text",
      "text": "# Kingmere Marine Conservation Zone\n\nKingmere Marine Conservation Zone is in the English Channel, between  and   off the West Sussex coast to the south of Littlehampton and Worthing. It covers an area of around .\nThe MCZ contains two marine Sites of Nature Conservation Interest (SNCIs) - Kingmere Rocks, off Littlehampton, and the Worthing Lumps, off of Worthing.\nKingmere Rocks are one of the best-known spawning sites for the black seabream.  Kingmere may also be the most important for sea bream in the UK.  The rocky habitats and chalk outcrops provide ideal nesting grounds.\nLying some three miles off the coast of Worthing, the Worthing Lumps are a series of underwater chalk cliff faces, up to three metres high. The lumps have been described as \"one of the best chalk reefs in Europe\" by the Marine Conservation Society.\nThe Kingmere MCZ site is within the jurisdiction of the Sussex Inshore Fisheries and Conservation Authority (Sussex IFCA) for fisheries management.  The site is mainly fished by vessels based on the Sussex coast in Selsey, Shoreham-by-Sea, Newhaven and Littlehampton.  The main commercial fishery is potting, followed by netting and trawling.  Most vessels fishing in the site are small static gear boats under 10 metres.\nFauna\nKingmere Rocks is one of the most important sites for the breeding of black sea bream.  Male black sea bream search for suitable parts of the sea bed on which to spawn and then use their tails to create nests within the sediment that lies over the rock.  Female sea bream then lay eggs in the nest which is watched over by the males until the eggs hatch.  The juvenile sea bream then remain in the area of the nest for some time.  Because of their delicate spawning bahviour, black sea bream are vulnerable to fishing practices like scallop-dredging that churn up the sea bed.\nThe Worthing Lumps is home to the first and only location for Baillon's wrasse in Sussex, a fish normally found in the British Isles off the coast of Dorset and Galway in Ireland.  The Worthing Lumps are home to other rare fish such as blennies and the lesser spotted dogfish.\nSee also\n* Geography of Sussex\n* Beachy Head West\n* Pagham Harbour\n* The Mixon\nReferences"
    }
  ]
}