{
  "content": [
    {
      "type": "text",
      "text": "# Kingston, Mississippi\n\n|postal_code_type =\n|postal_code =\n|area_code =\n|blank_name = GNIS feature ID\n|blank_info = 672177\n|blank1_name =\n|blank1_info =\n|website =\n|footnotes =\n}}\nKingston (also called Jersey Town) is an unincorporated community in Adams County, Mississippi, United States.\nFounded in 1784 in what was then British West Florida, Kingston is one of the earliest settlements in Adams County.\nHistory\nThe area was first settled in 1772 by Richard and Samuel Swayze of New Jersey, who purchased  of land.  A number of families from New Jersey followed and were known as the \"Jersey Settlers\", of whom actors William Holden and Patrick Swayze were descendants.\nIn 1773, Samuel Swayze, a Congregational pastor, organized what was then the first Protestant church in British West Florida.  The church lasted only until his death in 1784.\nAn early settler, Caleb King, laid out the town in 1784 and named it after his himself.  King was a surveyor by profession and came to the Jersey Settlement to survey the newly acquired lands.  King briefly returned to New Jersey to marry Richard Swayze's daughter Mary, after which the couple returned to Mississippi.\nTobias Gibson, the founder of Port Gibson, Mississippi, established a Methodist church in Kingston in 1799.  Gibson said he \"went to Kingston and procured a spot of ground by selling my watch for a meeting house.\"  The Kingston Methodist Church was built from logs in about 1802, and its deed was the first issued to a church of the Protestant faith in Mississippi (then called the Mississippi Territory).  In 1822, Caleb King's son-in-law Daniel Farrar donated a plot of land where a brick church was built.\nKingston was prosperous from 1800 to 1824, when it had three stores and a number of shops, with a population of about 150.  A tornado in 1840 destroyed most of Kingston.  By the early 1900s, all that remained of Kingston was a doctor's office, the church, and one dwelling.\nPresent day\nKingston Methodist Church and Cemetery are still located south of the settlement, and were placed on the National Register of Historic Places in 1982.\nA station belonging to the Kingston Volunteer Fire Department is located west of the settlement.\nNotable person\n* Albert Sojourner, member of the Mississippi House of Representatives from 1916 to 1924\nReferences"
    }
  ]
}