{
  "content": [
    {
      "type": "text",
      "text": "# Kinkuna, Queensland\n\n| pop                 = 105\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4670\n| area                = 113.8\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 8.1\n| dir1                = SE\n| location1           = Alloway\n| dist2               = 18.0\n| dir2                = SSE\n| location2           = Bundaberg CBD\n| dist3               = 99.2\n| dir3                = NW\n| location3           = Hervey Bay\n| dist4               = 349\n| dir4                = N\n| location4           = Brisbane\n| lga                 = Bundaberg Region\n| stategov            = Burnett\n| fedgov              = Hinkler\n| near-n              = Calavos\n| near-ne             = Coonarr\n| near-e              = Coral Sea\n| near-se             = Woodgate\n| near-s              = Woodgate\n| near-sw             = Goodwood\n| near-w              = Elliott\n| near-nw             = Alloway\n}}\nKinkuna is a coastal locality in the Bundaberg Region, Queensland, Australia. In the , Kinkuna had a population of 105 people.\nGeography\nThe Elliott River forms part of the northern boundary of the locality, while the Coral Sea (specifically Hervey Bay) forms the south-eastern boundary of the locality.\nThe North Coast railway line runs along the western boundary of the locality entering the locality from the south-west (Goodwood / Woodgate), passing through Kinkuna railway station () and the former Gotlow railway station (), before exiting to the northwest (Alloway).\nMost of the locality is within the Burrum Coast National Park which extends into neighbouring Woodgate and Goodwood to the south. The area outside the national park is within the north-west of the locality; the land use there is predominantly growing sugarcane and other crops with some rural residential housing mostly beside the Elliott River.\nHistory\nGotlow railway station was named on 3 April 1913 by the Queensland Railways Department and is an Aboriginal word meaning koala.\nThe locality takes its name from the Kinkuna railway station which was named by the Queensland Railways Department on 9 April 1941.  is an Aboriginal word meaning \"laughing\".\nThe Burrum Coast National Park was established in 1999 as the amalgamation of the Kinkuna, Woodgate and Burrum River national parks.\nDemographics\nIn the , Kinkuna had a population of 111 people.\nIn the , Kinkuna had a population of 105 people.\nEducation\nThere are no schools in Kinkuna. The nearest government primary school is Alloway State School in neighbouring Alloway to the north-west. The nearest government secondary school is Bundaberg State High School in Bundaberg South. There are also non-government schools in Bundaberg and its suburbs.\nReferences"
    }
  ]
}