{
  "content": [
    {
      "type": "text",
      "text": "# Knight of the Golden Spur (Holy Roman Empire)\n\nLithograph of Wilhelm von Bibra, an honoree by July 8, 1490, note gilded (gold) armor\n, note gilded (gold) armor]]\nThe Knights of the Golden Spur (, ; short equites aurati or milites aurati, \"golden [decorated] knights/soldiers\") were a public official elite of the Holy Roman Empire which consisted mainly of members of the gentry, but also from members of the bourgeoisie and the aristocracy. The term should not be confused with the English knight bachelor, who is frequently termed Eques Auratus in Latin monumental inscriptions, especially from the 17th century, denoting the privilege held by him of being allowed to gild his armour.\nThe honorees were awarded the accolade not necessarily for their knighthood, but because of special services. It was a personal honour for services rendered, which was not hereditary. The knight had the right to wear, contrary to existing regulations, golden spurs, or even a gold-plated armor. More practically, he enjoyed the right to wear a gold collar around the neck.\nBesides the Holy Roman Emperor himself, an eques auratus could also be a particularly privileged Count Palatine (Comes palatinus Caesareus), entitled to carry (other) noble titles and appoint equites aurati in turn.\nIn the free imperial cities, this honor was also increased to the families of the bourgeois patriciate consisting of long-distance trade merchants, bankers and the Council members to access as there was no competition on the part of the nobility to this form of giving.\nThe Order of the Golden Spur had its origins in the title Count palatine of the Lateran Palace, which was in the gift of the Holy Roman Emperor in the 14th century: Charles IV, Holy Roman Emperor conferred the title on one Fenzio di Albertino di Prato, 15 August 1357, at Prague. The Order began to be associated with the inheritable patent of nobility in the form of count palatinate during the Renaissance; Emperor Frederick III named Baldo Bartolini, professor of civil law at the University of Perugia, a count palatinate in 1469, entitled in turn to confer university degrees.  \"Bartolini also received the Knighthood of the Golden Spur, a title that sometimes accompanied the office of count palatinate in the Renaissance\", according to the historian of universities Paul F. Grendler; the Order of the Golden Spur, linked with the title of count palatinate, was widely conferred after the Sack of Rome, 1527, by Charles V, Holy Roman Emperor; the text of surviving diplomas conferred hereditary nobility to the recipients.\nAmong the recipients was Titian (1533), who had painted an equestrian portrait of Charles, and Niccolò Paganini by Pope Leo XII (1827).\nClose on the heels of the Emperor's death in 1558, its refounding in Papal hands is attributed to Pope Pius IV in 1559.\nAfter the end of the Holy Roman Empire, the winner of the title in Austria have been recognized as Knights (May 14, 1817), the leadership title \"Knight of the Holy Roman Empire\" was banned (10 April 1816, October 6, 1847). The award was presented to the end of the Austro-Hungarian monarchy.\nIn England, particularly in the 16th and 17th centuries, a Knight Bachelor could be entitled \"Eques auratus\" (eq. aur.), for example, Thomas Bodley, Henry Spelman, Isaac Newton, and Christopher Wren. Originally, this was also associated with the award, the privilege to gild the armor.\nIn 1748, Sweden established the Order of the Knights of the North Star, described as \"De stella Eques auratus\" such as Carl von Linné.\nThe Holy Roman Empire's Order of the Golden Spur is often confused with the second highest order of the Roman Catholic Church, the Order of the Golden Spur.\nReferences\nLiterature\n* Eberhard Schmitt: Behaust im Heiligen Römischen Reich? Das europäische Beziehungsnetz der „equites aurati“ im Zeitalter Kaiser Karls V. ([https://web.archive.org/web/20070804091935/http://www.orient.uni-erlangen.de/kultur/papers/schmitt.htm online])"
    }
  ]
}