{
  "content": [
    {
      "type": "text",
      "text": "# Knights and Warriors\n\n| presenter     = Joe FowlerLisa Canning\n| narrated      = Bernard Erhard\n| composer      = Fred Lapides\n| language      = English\n| country       = United States\n| location      =\n| runtime       = 60 minutes\n| network       = Syndication\n| company       = Welk Entertainment GroupWestern International Syndication\n| first_aired   =\n| last_aired    =\n}}\nKnights and Warriors is an American competition television program that premiered in syndication on September 19, 1992. The program aired on weekends for one season, with episodes airing until September 11, 1993. The show was a production of Welk Entertainment Group, and was distributed by Western International Syndication.\nKnights and Warriors was similar in format to American Gladiators, with which it shared studio space at CBS Studio Center, but it employed a medieval theme. The series matched a cast of amateur athletes against each other, as well as against the group of \"Warriors\". The show was hosted by Joe Fowler and Lisa Canning.\nThe Setting\nBernard Erhard portrayed the Lord of Rules and Discipline (L.O.R.D.) who also acted as the show's resident referee. In the first season's original opening scene, he narrates the story as follows:\nIt is written in the Book of Good and Evil that in a time long ago, all was peace and harmony, Paradise on Earth. Then one fateful day, the universe shifted, all was dark, and for those born on that day, their evil destiny was sealed! Now, they have united to wreak havoc on an unsuspecting world --- and forevermore will be known as WARRIORS!\nThis opening title sequence loosely resembles the legend of King Arthur and recalls how the world was a utopia until the day a dark force disrupted the balance that separated good from evil; and how, with that dark force, a barbarian horde known as the Warriors began to storm through the kingdoms. The L.O.R.D. has accordingly called for \"modern-day knights\" to battle the Warriors and restore honor.\nThe \"knights\" are two teams of one man and one woman. The teams are colored purple and gold. The knights must go through eight challenges set forth by the Warriors to win the game. The L.O.R.D. hands out punishment to the Warriors for any cheating, but he can also punish the knights if they cheat during competition, which was very rare in this show's all-too-short history.\nThe audience all wave purple and gold triangular flags while cheering on the knights.\nThe Warriors\nThe Warriors are the show's antagonists. In reality, they're hired actors almost similar to the Gladiators.\n*PLAGUE: The leader of the Warriors and considerably the strongest. Portrayed by Jim Maniaci.\n*STEEL MAIDEN: A beautiful and powerful female Warrior. Portrayed by Nancy Georges.\n*PYRO: A hotheaded firestarter, one of the more popular Warriors. Portrayed by Douglas Rogel.\n*LADY BATTLEAXE: A large female Warrior with unparalleled strength. Portrayed by real-life arm-wrestling champion Dot Jones.\n*KNIGHTMARE: One of the tougher Warriors, known as the Duke of Doom. Portrayed by Rodney Mitchell.\n*PRINCESS MALICE: A \"royal good-girl\" who turned to the dark side. Portrayed by fitness model Cameo Kneuer, real-life sister of Cory Everson.\n*CHAOS: The most unstable and unpredictable of the Warriors, hence his name. Portrayed by Benny Graham.\n*VENOM: A devious and dangerous female Warrior. Portrayed by Jessica Long.\n*RAVEN: A ruthless and ravishing female Warrior who replaced Steel Maiden in Season 2. Unknown performer.\n*SLASH: A male \"alternate\" Warrior. Unknown performer.\n*VANDAL: Another male \"alternate\" Warrior. Unknown performer.\n*EMPRESS VIXXEN: A female \"alternate\" Warrior, who spells double-trouble for those who cross her; hence the additional \"x\" in her name. Unknown performer.\nEpisode Guide\nSeason 1\n* Preliminaries 1 thru 6\n* Face-Offs 1 thru 3\n* Semi-Finals 1 & 2 (highest-scoring \"losers\" from Preliminaries compete as a \"Wild Card\" team)\n* Royal Finals (last show of the season)\nSeason 2\n* Preliminaries 1 thru 6\n* Face-Offs 1 thru 3\n* Semi-Finals 1 & 2 (highest-scoring \"losers\" from Preliminaries compete as a \"Wild Card\" team)\n* Royal Finals (last show of the season)\nThe Challenges\nThe start and end of each event are marked by the sound of a gong and trumpet fanfare to begin the event, and only a gong sound to end the event.\nCatapult\nThe knights must catch red dodgeballs being launched by a catapult while trying to evade yellow dodgeballs being fired by the Warriors using giant slingshots. Once the red balls are caught, the knights must throw them into the ring of fire to score. Points are scored based on which section of the playing mat the knight threw the red ball from. In Season 1, the mat was divided into three sections worth 5, 10 and 15 points, with 15 being the furthest away. In Season 2, only the front two sections of the mat were used, with the middle section scoring 25 points, and the front section scoring 50 (as the knight would have to brave harder hits from the dodgeballs). After 60 seconds, the challenge is over. Both the male and female knights took a turn competing in this event.\nPyro was always the Warrior whose tricks would ignite the ring of fire to start the match.\nBattle Swords\nThe knight and Warrior run across treadmills on an elevated platform trying to knock each other down with foam bats. The challenge is 30 seconds. A win or a Warrior disqualification earns the knight 50 points while a draw is worth 25 points. Grabbing an opponent's weapon or crossing over the small barrier between the treadmills automatically disqualifies the offender. Only one gender competes in this event.\nSorcerer's Wheel\nThe knight has 45 seconds to run across a spinning track with two hurdles. Every completed lap on the wheel is worth 10 points each. However, a lap doesn't count if both of the knight's feet touch the inside of the wheel. The Warriors stand on the outside of the wheel swinging a 75-pound spiked ball on a chain to knock the knight off the wheel and out of the game. Whichever gender did not participate in Battle Swords competes in this event.\nVolcano\nTwo knights have 45 seconds (60 for the women) to climb up a giant 30-foot volcano-shaped net. In the Royal Finals, 15 seconds have been reduced for both genders, making it 30 seconds for men and 45 for women. Inside the net are 4 Warriors. One Warrior is strapped to a harness while the other three Warriors control the height and angle. The harnessed Warrior has pads to knock the knight down trying to prevent them from scoring. Scoring ranges from 3 sections of the net, each separated by a metal ring connected to the net. The bottom of the net is worth 25 points while the next section is worth 50 points and the top section is 75 points. If the knight manages to climb to the top of the Volcano and grab their team flag, he(she) will earn 100 points. Both genders compete in this event.\nRoller Joust\nEach knight has 45 seconds to skate around the perimeter of the jousting arena carrying a foam lance to capture rings on poles scattered around the arena. Red rings are worth 10 points while gold rings are worth 25. Inside the circle are four paths forming an X. For the first 15 seconds the X is a \"Warrior-free zone\"; the Warriors cannot enter or interfere. After the 15 seconds have elapsed, the Warriors are free to enter that zone as well.  The event is over when the knight gets tackled but the knight gets to keep the points.  One gender competed in this event in Season 1, and both genders each took a turn in Season 2.\nTug O' Warriors\nThe knight and the Warrior are each standing on rotating platforms while each of them pulls on a rope. The knight has 30 seconds to pull the Warrior of their platform. Knight earn 100 points by winning. If 30 seconds expires or both go over, 50 points are awarded for a draw. Only one gender competes in this event. (In Season 1, the gender that did not participate in Roller Joust competed.)\nThe Pit\nIn this challenge, the knights are pitted against each other inside a bowl-like arena. The Warriors outside the bowl rock it back and forth with the knights inside it. The object in this game is for one knight to pin the other using a pad. Depending on where the pin was, the bowl has 4 scoring sections: two 25 points, one 50 point and one 75 point section. After 45 seconds, the total number of points are added up. Pins without using the pads won't count. Both genders took a turn competing in this event.\nA notable moment in the show's early round one episodes occurred when Knight Robert Pavell of the purple suffered a head injury while inside the Pit; he and his opponent, Michael West of the gold team, scored no points in the Pit. He was replaced by Jeff Joccum, who later went on to score in the finale and ensure a win of the purple team.\nTarget Onslaught\nSimilar to the American Gladiators final event, the Eliminator, Target Onslaught is the show's final event. Target Onslaught is a two-part challenge.\nOne knight becomes the shooter, aiming a crossbow-like cannon and firing foam arrows at six targets from afar as the other knight loads the crossbow. The targets include a dragon, spinning flags, the Sun, the Moon, and two shields. The first knight has 30 seconds to shoot the targets. The first knight cannot move to the next target until the last one is shot down. Instead of points, the knight earns 5 additional seconds for his/her partner for every successful hit.\nAfter 30 seconds expires, the second half of Target Onslaught begins. The second knight now becomes the shooter and the first knight loads the crossbow as they attempt to shoot the Warriors which travel back and forth across the top of the arena on three rails using handrail slides. The closest rail is 50 points, the next rail is 100 points and the furthest rail is 150 points. After 30–60 seconds, the final scores are totaled.\nThe Final Results\nThe team with the most points at the end of the show wins and receive medals awarded to them by the L.O.R.D. and the servant girls beside him.  Prizes are also awarded to the knights, indicated by hostess Lisa Canning as the show comes back from various commercial breaks.\nIn a \"Knights and Warriors Tournament\", which was ultimately the series finale, the champions of the Tournament are crowned \"Sir\" and \"Lady\" by the Lord of Rules and Discipline, and receive medals awarded by the show.\nEpisodes\nReferences\nExternal links\n*"
    }
  ]
}