{
  "content": [
    {
      "type": "text",
      "text": "# Koishiwara ware\n\n-period koishiwara sake bottle (tokkuri), stoneware with brown glaze and white slip, in the collection of the Los Angeles County Museum of Art]]\n, formerly known as Nakano ware, is a type of Japanese pottery traditionally from Koishiwara, Fukuoka Prefecture in western Japan. Koishiwara ware consists of utility vessels such as bowls, plates, and tea cups. The style is often slipware.\nHistory\nPottery was first made in Koishiwara in 1682 as a result of the relocation of the Korean-founded Takatori workshop to nearby Tsuzumi. A kiln for firing porcelain was built in Koishiwara, and porcelain wares were made for export there with local materials until the eighteenth century. The Koishiwara style as it is known today had developed by the mid-eighteenth century. Abandoning porcelain production, potters began to use dark-firing stoneware for their pottery.\n20th Century Developments\nBeginning in the mid-twentieth century, technological advancements such as clay crushers, kiln shelves, and electric kilns allowed Koishiwara potters to work more efficiently and profitably than other potters in the surrounding area. As a result, Koishiwara potters were able to purchase land near their ceramic sites and develop it as tourist resorts and retail centers. Modern Koishiwara ware pottery represents the success of the mingei or folk craft movement in Japan.\nContemporary Koishiwara Style\nStylistic trademarks of Koishiwara ware include different types of slip decoration in which light-colored slip is applied to a leather-hard pot before a tool is used to create a pattern which reveals the dark clay underneath. The characteristic double glazing style of Koishiwara ware uses an overall clear glaze and trailing or pouring copper green and iron glazes in spots over the clear base glaze. The area still serves as a large ceramic production site for everyday wares, attracting tourists and selling large amounts of pottery every year.\nSee also\n* Onta ware\n* List of Traditional Crafts of Japan\nReferences"
    }
  ]
}