{
  "content": [
    {
      "type": "text",
      "text": "# Kokotungo, Queensland\n\n| pop                 = 89\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4702\n| area                = 781.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 20.2\n| dir1                = ENE\n| location1           = Baralaba\n| dist2               = 64.7\n| dir2                = N\n| location2           = Moura\n| dist3               = 76\n| dir3                = NW\n| location3           = Biloela\n| dist4               = 133\n| dir4                = SW\n| location4           = Rockhampton\n| dist5               = 634\n| dir5                = NNW\n| location5           = Brisbane\n| lga                 = Shire of Banana\n| stategov            = Callide\n| fedgov              = Flynn\n| near-n              = Gainsford\n| near-ne             = Dumpy Creek\n| near-e              = Goovigen\n| near-se             = WooleinBanana\n| near-s              = Baralaba\n| near-sw             = Baralaba\n| near-w              = Alberta\n| near-nw             = Barnard\n}}\nKokotungo is a rural locality in the Shire of Banana, Queensland, Australia. In the , Kokotungo had a population of 89 people.\nGeography\nThe Dawson Valley (Theodore) railway line passes through the locality from the east (Goovigen) and travels slightly south-west across the locality passing through the three railway stations:\n* Kokotungo railway station ()\n* Kooemba railway station ()\n* Kalewa railway station ()\nbefore exiting to the south-west (Baralaba). The railway line has now closed and the stations are abandoned.\nHistory\nKokotungo is an Aboriginal name for a local hill and was assigned by the Queensland Railways Department to the railway station in June 1916. The section of the Dawson Valley railway line from Rannes to Baralaba (via Kokotungo) opened on 30 July 1917.\nTown lots were sold in the town of Kokotungo beside the railway station in February 1938.\nKokotungo State School opened in the town on 6 November 1939 and closed on 27 January 1969. It was on a  site on the southern side of the Baralaba Rannes Road (approx ).\nA branch of the Queensland Country Women's Association was active in Kokotungo from at least 1957 to 1971. The branch published a recipe book in 1959.\nDemographics\nIn the , Kokotungo had a population of 100 people.\nIn the , Kokotungo had a population of 89 people.\nEducation\nThere are no schools in Kokotungo. The nearest government primary schools are:\n* Baralaba State School in neighbouring Baralaba to the south-west\n* Banana State School in neighbouring Banana to the south-east\n* Goovigen State School in neighbouring Goovigen to the east\n* Wowan State School in Wowan to the north-west\nThe nearest government secondary schools are Baralaba State School (to Year 10) and Moura State High School (to Year 12) in Moura to the south. However, most of Kokotungo is too distant for a daily commute to Moura; the alternatives are distance education and boarding school.\nNotable residents\nNotable people from Kokotungo include:\n* Alwyn Torenbeek (1937–2015), drover, horse whisperer, endurance rider, bronc rider and author\nReferences\nExternal links\n*"
    }
  ]
}