{
  "content": [
    {
      "type": "text",
      "text": "# Kondapalli Koteswaramma\n\n|birth_place   =Pamarru, India\n|death_date    =\n|death_place   =\n|death_cause   =\n|body_discovered =\n|resting_place =\n|resting_place_coordinates =\n|nationality   = Indian\n|other_names   =\n|citizenship   =\n|education     =\n|alma_mater    =\n|occupation    =\n|employer      =\n|known_for     = Prominent communist\n|height        =\n|title         =\n|term          =\n|predecessor   =\n|successor     =\n|party         =\n|opponents     =\n|boards        =\n|spouse        =\n|partner       =\n|children      =\n|parents       =\n|callsign      =\n|awards        =\n|website       =\n|signature     =\n|footnotes     =\n|relations     =\n|years_active = 1930–2018\n}}\nKondapalli Koteswaramma (5 August 1918 – 19 September 2018) was an Indian communist leader, feminist, revolutionary, and writer. As a child widow, she remarried Kondapalli Seetaramaiah and faced many social constraints. Later, she was active in the freedom struggle and also worked underground with the party staying away from family and children. In her last years, she lived in Visakhapatnam at her granddaughter's house.\nChildhood and early life\nKondapalli was born into a wealthy family in Pamarru, Krishna district, Andhra Pradesh. She was married to her uncle at the age of 7, but he died within two years, leaving her a child widow. She did her schooling from her hometown besides getting trained in music. At the age of 10 years, she took active part in the freedom struggle by singing patriotic songs in various meetings and congregations. She got remarried at the age of 19 to Kondapalli Seetaramaiah. Initially, she faced many social constraints as widow remarriage was not accepted by the society. After marriage, she stayed along with her husband in Jonnapadu for few years. During this time, she worked for the Communist Party in Gudivada. After moving to Vijayawada, she attended various conferences and worked for Women's association.\nWork and later life\nShe worked actively for the Communist Party of India along with her husband and the likes of Puchapalli Sundaraiah. She contributed actively to the Telangana Rebellion. She worked for the party for few years staying underground (In Bandar, Eluru, Puri, Raichur), away from her family and children. Shortly after the rebellion, the communist party divided into two. Her husband deserted her and she was left to fend for herself and her children.  At the age of 35, she came to Hyderabad to study matriculation. She sustained during those years through the little money earned from writing stories and performing for the radio. Even while sustaining with such meagre earnings, she used to send ten rupees each to the party (CPI and CPI(M)) funds every month. After completing her matriculation, she joined Polytechnic college in Kakinada as a matron. She started participating in the literary events in Kakinada. Later, she worked in various colleges across the state. She had a daughter Karuna and a son Chandrasekhar. Karuna was a doctor and Chandrasekhar studied at Regional Engineering College, Warangal. Both of them died under unforeseen circumstances. During these years, her husband established the People's war party in India and worked actively towards it. But he got ousted later on from his own party and was jailed. He suffered mental illness and died at the age of 87 in his granddaughter Sudha's (daughter of Karuna) place. Koteswaramma lived in Vijayawada for a few years and later on moved to Chandra Rajewsara Rao Old age home in Hyderabad. In her last years, she was back at her granddaughter Sudha's house in Visakhapatnam. She was hospitalised in September 2018, and returned home after a few days to her other granddaughter Anuradha's house, where she died.\nLiterary works\nKoteswaramma penned various books, essays and songs to date. The notable ones include  (, 1972),  (, 1991), and  (, 1991). Her autobiography  (, 2012) was published by the Hyderabad Book Trust. It was translated to English as The Sharp Knife of Memory  and into other Indian languages. A more complete bibliography can be found on .\nOther\nShe was actively involved in Communist, Naxalbari, Feminist, Freedom and Reformist movements throughout her life. Latterly, she lived in Visakhapatnam along with her granddaughter.\nDeath\nShe died of a brain hemorrhage on 19 September  2018, presumably at the age of 100.\nReferences\nSources\n* Nirjana Vaaradhi (lit. Deserted Bridge), Autobiographical memoir of Kondapalli Koteswaramma."
    }
  ]
}