{
  "content": [
    {
      "type": "text",
      "text": "# Kong: King of the Apes\n\n| network              = Netflix\n| first_aired          =\n| last_aired           =\n| related              =\n| image_upright        =\n| image_size           =\n| image_alt            =\n| screenplay           =\n| story                =\n}}\nKong: King of the Apes is an animated television series that is produced by 41 Entertainment LLC, Arad Animation, and animated by OLM Digital and Sprite Animation Studios. It is the third animated series in the King Kong franchise. The series was released to Netflix on April 15, 2016. The second season premiered on May 4, 2018, and was the final season of the show to be produced.\nSynopsis\nEntertainment Weekly provides the following synopsis:\nhavoc at Alcatraz Island's Natural History and Marine Preserve. What most humans on the hunt for the formidable animal don't realize, though, is that Kong was framed by an evil genius who plans to terrorize the world with an army of enormous robotic dinosaurs. As the only beast strong enough to save humanity from the mechanical dinos, Kong must rely on the help of three kids who know the truth about him\".}}\nCharacters\nMain\n* Lucas Remy (voiced by Alessandro Juliani, later by Giles Panton) is a wildlife enthusiast, and the son of Leo Remy and twin brother of Richard. He loves and cares about animals, and has the closest bond to Kong. He opposes his brother's wicked schemes with the help of Kong and their friends.\n* Kong (voiced by Lee Tockar) is a supersized male gorilla. As a baby, Kong was captured by poachers but broke free and wound up befriending Lukas when he was young. Some time later when he was bigger, Kong saved Richard from a fire (from which Richard had to get a prosthetic eye) but Richard was not grateful and even tried to blame Kong for the fire. Kong is somewhat child-like (having the mentality of a three-year-old child) but has a strong bond with Lukas and the rest of the team. He became a fugitive of the law after being framed by Richard and so works with Lukas to fight against Richard's evil plans, before Richard's schemes were revealed to public.\n* Doug \"Jonesy\" Jones (voiced by Viv Leacock) is Lukas' best (human) friend and the team technical specialist. He has a questionable attraction to Botila.\n* Amy Quon (voiced by Shannon Chan-Kent) is a veterinarian and the older sister of Danny. She is of Chinese descent. Following the first 2 episodes of season 2, she leaves the team and returns to China.\n* Danny Quon (voiced by Vincent Tong) is an amateur animal-whisperer, able to speak with animals and one of Kong's best friends. He is of Chinese descent.\n* Chatter (voiced by Alessandro Juliani, later Vincent Tong) is an aptly-named parrot a scarlet macaw owned by Anita, and is known as the world's first bionic bird after Leo Remy \"saved\" his life by replacing his damaged wing with a bionic prosthetic wing.\n* Franciska (voiced by Tabitha St. Germain): Franciska (nicknamed Panchi) is Anita's grandniece, and joined the team after they came to save her from a giant anaconda. She is very intelligent for her age and loves animals like Lukas does, and admires him to the point of wanting to work with animals and protect nature.\nRecurring\n* Dr. Leo Remy (voiced by Lee Tockar) was the father of Lukas and Richard. He clearly favored Lukas, as he could never convince Richard to appreciate nature as Richard favored bionics. After a falling out the two of them became distanced both physically and emotionally. He developed a wildlife research center (partly to house Kong) but eventually died, leaving the research center (dubbed \"Kong Island\" by fans) to his sons.\n* Anita (voiced by Tabitha St. Germain) is a Spanish housekeeper for the Remy family and was the nanny of Lukas and Richard when they were children, and later Kong, loving them all like surrogate sons. Even after they've all grown up, she cares for them deeply, including Richard, though it breaks Anita's heart that he has changed for the worst. Her grandniece is Franciska.\n* Lucky is a liger cub and the son of Lady. He lives with the team and is a beloved friend of Kong.\n* Lady Liger was the mother of Lucky until the internal injuries of a robot attack and extreme stress caused her to die. Richard cloned her into three bionic ligers but they were rescued and sent to live in the wild to live peacefully. Although they are clones, they all share the same loving bond the original Lady had with Lucky.\n* Decker (voiced by Lee Tockar) is the police commissioner, and leads his police forces in pursuing Kong, Lukas, and their friends, mistakenly believing them to be criminals (due to Richard framing them). After Richard's criminal activities are revealed, Decker apologizes to Kong and his friends.\n* Zippi (voiced by Kathleen Barr) is a baby dinosaur.\n* Apex (voiced by Samuel Vincent) is the leader of a clan of apes.\n* Mummo (voiced by Kathleen Barr) is the apes' resident cook, who becomes friends with fellow cook Anita.\nAntagonists\n* Richard Remy (voiced by Samuel Vincent) is the evil twin brother of Lukas (Richard being the younger twin by 20 minutes) and the son of Leo. Since childhood, he has always irrationally hated nature and Kong. He was also so obsessed with bionics that he would even turn himself into the world's first \"bionoman\". As a child, his reckless misuse of his father's laser equipment almost got him killed in an accidental fire. Luckily, Kong saved Richard's life, but his eye was damaged and had to be replaced with a bionic one. He tried to blame Kong for the fire in an attempt to banish Kong from his life, but his ruse was seen through by everyone immediately. As an adult, Richard has turned out the polar opposite of his brother, especially in morality. After his father dies, Richard tries to take control over Kong Island. When Lukas gets in the way of Richard's bionic research, he frames Kong to turn public opinion against him, resulting in Kong and Lukas becoming fugitives. They work against Richard to stop his nefarious schemes, but at the end of season one, he is exposed as a criminal and ultimately betrayed by Botila, plotting his revenge before getting arrested in the series finale.\n* Botila (voiced by Kathleen Barr) is a bionic gynoid and personal assistant of Richard. She behaves in a mostly robotic manner but after enduring Richard's abuse for long enough, she turns against him, although they soon come to an uneasy truce and continue to conspire against Kong. In the season one finale, Botila ultimately betrays Richard, and takes over his Bionobots, declaring herself \"Empress Botila\" of the AI Liberation Front. She became the main antagonist in season 2.\n* Richie is the first robotic creation of Richard, and later becomes a servant of Botila before reforming in a new life.\n* Brag and Wheeler are two poachers that tried to hunt Kong as a baby. The duo were dropped in season 2.\n* The Bionobots are Richard's creations and serve as his personal army. Due to his love of dinosaurs, they are all designed after various species of dinos. After Botila's betrayal, they become part of her AI Liberation Front. Several \"Frankenbots\" were created as a security measure on Kong Island by Botila, before being reprogrammed by Richard for his revenge.\n** Bionobotic tyrannosaurus\n** Bionobotic triceratops\n** Bionobotic pteranodons\n** Bionobotic squid\n** Bionobotic megalodon\n** Botila clones (voiced by Kathleen Barr) are three clones of Botila who serve as her servants. They later turn against Botila and ultimately help in stopping her and Richard.\n** Bionobot Richard\n** A mind controlled anaconda though the anaconda seems to be the size of a titanoboa or 48 feet although they are extinct.\nCast\n* Lee Tockar – Kong, Commissioner Decker, Braig, Dr. Leo Remy\n* Alessandro Juliani – Lukas Remy (Season 1), Chatter (Season 1)\n* Kathleen Barr – Botila\n* Shannon Chan-Kent – Amy Quon\n* Samuel Vincent – Richard Remy\n* Tabitha St. Germain – Anita, Franciska/Panchi\n* Viv Leacock – Doug \"Jonesy\" Jones\n* Vincent Tong – Danny Quon, Chatter (Season 2)\n* Giles Panton – Lukas Remy (Season 2)\n* Ian James Corlett - Tanker A.I.\nEpisodes\nSeries overview\n| color2     = #004000\n| link2      = #Season 2 (2018)\n| episodes2  = 10\n| released2  =\n}}\nSeason 1 (2016)\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n| LineColor           = 000000\n| ShortSummary        =\n}}\n}}\nSeason 2 (2018)\n| LineColor           = 004000\n| ShortSummary        =\n}}\n| LineColor           = 004000\n| ShortSummary        =\n}}\n| LineColor           = 004000\n| ShortSummary        =\n}}\n| LineColor           = 004000\n| ShortSummary        =\n}}\n| LineColor           = 004000\n| ShortSummary        =\n}}\n| LineColor           = 004000\n| ShortSummary        =\n}}\n| LineColor           = 004000\n| ShortSummary        =\n}}\n| LineColor           = 004000\n| ShortSummary        =\n}}\n| LineColor           = 004000\n| ShortSummary        =\n}}\n| LineColor           = 004000\n| ShortSummary        =\n}}\n}}\nReception\nThe series was met with negative reviews by critics and King Kong fans alike. MiscRave noted that while the show had potential it had a young demographic in mind which ultimately meant the show did not have compelling stories to tell.\nReferences\nExternal links\n*"
    }
  ]
}