{
  "content": [
    {
      "type": "text",
      "text": "# Kopano (software)\n\n| license = AGPL-3\n| operating_system = Linux, OpenBSD\n| programming_language = C++2014\n| genre = Groupware\n| website =\n}}\n| license = AGPL-3\n| operating_system = Linux, OpenBSD, Windows, Macintosh\n| programming_language = PHP\n| website = hide\n}}\n| license = AGPL-3\n| operating_system = Linux, Windows, Macintosh\n| programming_language = C++\n| website = hide\n}}\n| operating_system       = Windows\n| programming_language   = C#\n| website                = hide\n}}\nKopano is an open-source groupware application suite originally based on Zarafa. The initial version of Kopano Core (KC) was forked from the then-current release of (the open-source parts of) Zarafa Collaboration Platform, and superseded ZCP in terms of lineage as ZCP switched to maintenance mode with patches flowing from KC. Kopano WebApp similarly descended from Zarafa WebApp. Since October 2017, Kopano Core is also known more specifically as Kopano Groupware Core, since Kopano B.V. developed more products that were not directly requiring groupware components.\nThe original goal of ZCP was to be a replacement for Microsoft Exchange, so that users could retain Outlook as a client application. While Kopano's business strategy has shifted towards providing a comprehensive office collaboration suite in its own right, Kopano Core supports connections from Outlook clients either via Z-push/ActiveSync, or the last Windows MAPI plugin from Zarafa.\nThe Kopano Outlook Extension add-in for Outlook provides the Outlook functionality that ActiveSync alone doesn't support. This includes (for example) support for Out of Office or Public Folders. ActiveSync and Kopano Outlook Extension together are therefore able to fully integrate the Kopano backend within Outlook in a corporate environment.\nWebApp plugins exist to perform advanced group tasks such as accessing cloud based storage solutions (e.g. owncloud / nextcloud), for integrated video conference (webmeetings) or for handling S/MIME email within WebApp.\nA desktop application, DeskApp, is also available. This is the same look and feel as WebApp but integrates directly with the user's desktop and it is available for Windows, Linux or Mac.\nAll server-side components (Kopano Core) and WebApp are published under the Affero General Public License (AGPL).\nThe Kopano Collaboration suite is End-Of-Life and only supported till March 31st 2025 in favor of Kopano Cloud.\nTechnology\nMicrosoft Outlook, as well as Kopano/Zarafa clients, uses MAPI at the source code level. So-called MAPI providers (essentially plugins) abstract and take care of the underlying transport mechanism. Kopano-server exposes its functionality over stream sockets and uses the HTTP protocol, with data being serialized using SOAP/XML. The commands sent in the XML data are specific to Kopano/Zarafa. Conversely, the Kopano MAPI provider implements this protocol on the client side. These HTTP connections can be secured with TLS/SSL  and be proxied if desired.\nBecause Exchange instead uses MAPI/RPC on the wire, the stock Outlook connector for Exchange could not be used and traditionally required the Windows version of the Zarafa MAPI provider (a product that is proprietary and unsupported since 2016–04). Outlook versions 2013 and 2016, support ActiveSync, a protocol also used by many mobile clients, and by using the Z-push software on the server side, ActiveSync requests can be translated and such clients can effectively talk to a Kopano server as well.\nKopano Core generally stores its data in a MySQL-compatible database. Attachments can be saved on the filesystem, Amazon S3, or the database may be used to place chunked blobs. The server can get its user information from LDAP/Active Directory, Unix user accounts or the MySQL database. Additional gateways for the IMAP, POP3 and iCalendar/CalDAV protocols are provided.\nKopano WebApp (and DeskApp which is the equivalent stand-alone application) are full-featured applications which include support for mail, calendars, group calendars, public folders and many more functionalities. WebApp can be integrated with many plugins which can be added to the installation. Kopano provides several plugins such as Files (cloud and storage access within WebApp), WebMeetings (video conference) and S/MIME (which allows reading and sending encrypted email).\nAny developer can, however, write additional plugins using the WebApp plugin API.\nEdition\nKopano is available as a freely downloadable community edition. The community edition gives the users access to the main branch builds which includes the very latest code as overnight builds. The Kopano community edition includes all the advanced and premium features such as WebMeetings (Video Conferencing), Kopano Files (cloud storage access) and the S/MIME plugin (which allows sending or receiving encrypted email).\nKopano is also available as a paid-for product where official Kopano QA tested releases are provided and supported directly by Kopano.\nKopano was briefly available in a few Linux distributions. The package in e.g. Debian saw its last update in 2020/Q1, and openSUSE removed it in 2021/Q1 following build failures with contemporary toolchains.\nVersion history\nSee also\n* List of collaborative software\nReferences\nExternal links\n*"
    }
  ]
}