{
  "content": [
    {
      "type": "text",
      "text": "# Korakou culture\n\n]]\nThe Korakou culture or Early Helladic II (in some schemes Early Helladic IIA) was an early phase of Bronze Age Greece, in the Early Helladic period, lasting from around 2650 to BC. In the Helladic chronology it was preceded by the Eutresis culture of BC (also called Early Helladic I) and followed by the Tiryns culture (2,200–2,000BC) or Early Helladic III. In some parts of Greece a Lefkandi culture, or Early Helladic IIB, follows the Korakou; elsewhere the Korakou transitions directly into the Tiryns.\nRemains of the culture have been excavated widely across south and central mainland Greece, in the Peloponnese, Attica, Euboea, Boeotia, Phocis, and Locris. Examples of Korakou pottery have been found still more widely, as far as Knossos in Crete, Lefkas in the west, Thessaly, and on Ios and Keos in the Cyclades.\nMany coastal sites were fortified, and in several areas the period ends with a destruction by burning; some settlements are reoccupied by the Tiryns culture, while many remain unoccupied until the Mycenean period.\nThe place name terms for all these cultures were proposed by Colin Renfrew in 1972 as a replacement for the \"Early Helladic\" periodizations; however, both have remained in use.\nRemains\nThe two-storey fortified House of the Tiles at Lerna in the Peloponnese was an untypically large structure, at about 25 x 12 metres, and is the best-known of the architectural remains. It was built of mud-brick over a stone socle, with much use of wood, and clay for the floors and as stucco for the walls. The ground floor had two \"halls\", two smaller rooms, and corridors along each side, with benches outside. The roof was covered with terracotta tiles, with schist ones along the eaves. Like many buildings of the culture, it seems to have been destroyed by fire at the end of the period, perhaps before it was finished. Fortunately for archaeology, it was then covered by a tumulus which preserved it well.\nThe House of the Tiles is one of a group of large fortified buildings whose function has been much discussed. Their similar plans are now grouped under the term corridor house as the series of large \"hall\" rooms are linked by corridors. They typically have two storeys connected by an internal stairway. It remains unclear whether they were the residences of a local leader, or some kind of community asset, perhaps used for storing produce.\nThe period saw a great increase in the use of metal, mostly surviving in small items from graves. These are in copper and bronze, with daggers and tweezers common, and jewellery includes pieces in gold. There are a few gold and silver vessels.\nA good deal of broken pottery sherds have survived, which have been divided into two types of \"fine\" wares, mostly with a ceramic slip, often burnished, and some with painted decoration. There are also plainer \"coarse\" wares, some with simple impressed decoration. There are also animal figures in terracotta, some with their bellies split. Clay sealings are much more common than seals; many were found in the House of the Tiles. Seals have been found in stone, lead, and terracotta. Some clay pithoi urns and hearths are decorated by rolling cylinder seals over them; intriguingly, the same seals appear to have been used at different sites.\nThere is no standard type of burial across the culture, with excavations so far revealing a number of types, varying by the location. Burials in pits, cists, and pithos urns are found, as well as some cremated remains, group burials, and secondary burials where the remains were placed in their final location some time after death.\nFootnotes\nReferences\n*Rutter, Jeremy, \"The Eutresis and Korakou Cultures of Early Helladic I-II\", [https://brewminate.com/the-eutresis-and-korakou-cultures-of-early-helladic-i-ii/ brewinate], January 2017\n*Small, David B., Ancient Greece: Social Structure and Evolution, 2019, Cambridge University Press, ISBN 9780521895057, 0521895057, [https://books.google.com/books?id=AG2MDwAAQBAJ google books]\nFurther reading\n*Renfrew, A.C., 1972, The Emergence of Civilisation: The Cyclades and the Aegean in The Third Millennium BC, London."
    }
  ]
}