{
  "content": [
    {
      "type": "text",
      "text": "# Koreatown, Queens\n\n| subdivision_type1       = State\n| subdivision_name1       =\n| subdivision_type2       = Counties\n| subdivision_name2       =\n*Queens County and Borough\n| subdivision_type3       = Region\n| subdivision_type4       = Agglomeration\n| subdivision_name4       = New York metropolitan area\n| coordinates             =\n| pushpin_map             = USA New York City\n}}\nKoreatown, Queens (), in the New York City borough of Queens, is one of the largest and fastest-growing ethnic Korean enclaves outside Korea. It is largely oriented around Northern Boulevard.\nLocation\nThe core of this Koreatown originated in the Flushing neighborhood of the New York City borough of Queens. This Koreatown has continued to expand rapidly eastward alongside Northern Boulevard through the Queens neighborhoods of Murray Hill, Auburndale, Bayside, Douglaston, Little Neck.\nHistory\nDevelopment of Flushing's Koreatown\nIn the 1980s, a continuous stream of Korean immigrants emerged in Flushing, many of whom began as workers in the medical field or Korean international students who had moved to New York City to find or initiate professional or entrepreneurial positions. They established a foothold on Union Street in Flushing between 35th and 41st Avenues, featuring restaurants and karaoke (noraebang) bars, manicure and pedicure salons, grocery markets, education centers and bookstores, banking institutions, offices, consumer electronics vendors, apparel boutiques, and other commercial enterprises, and a Koreatown was conceived in Flushing.\nKoreatownscape\nExpansion eastward\nAs the community grew in socioeconomic status and population, Koreans moved eastward along Northern Boulevard, buying homes in more affluent and less crowded Queens neighborhoods, and into the adjacent Nassau County, by the early 21st century. This expansion has led to the creation of an American Meokjagolmok, or Korean Restaurant Street, around the Long Island Rail Road station in Murray Hill, Queens, exuding the ambiance of Seoul itself. The eastward pressure to expand was also created by the inability to move westward, inhibited by the formidable presence of the enormous Flushing Chinatown centered on Main Street.\nDemographics\nAccording to the 2010 United States census, the Korean population of Queens was 64,107, representing the largest municipality in the United States with a density of at least 500 Korean Americans per square mile; while the Korean population of Nassau County had increased by nearly two-thirds to approximately 14,000 over one decade since the 2000 Census. Along with the two Koreatowns of Bergen County, New Jersey (in Palisades Park and Fort Lee) and the Manhattan Koreatown in New York City, the Queens Koreatown as a satellite node for an overall Korean American population of 218,764 individuals in the New York City Metropolitan Area, the second-largest population of ethnic Koreans outside Korea. Korean Air and Asiana Airlines provide non-stop flights from Seoul to JFK Airport in Queens.\nClimate\nKoreatown lies at the northern edge of the humid subtropical climate zone, according to the Köppen climate classification, similar to Seoul, South Korea; Koreatown has a moderately sunny climate, averaging between 2,400 and 2,800 hours of sunshine annually.\nEducation and public institutions\nKoreatown residents can enjoy an urban oasis at Flushing Meadows-Corona Park. Numerous branches of the Queens Library are readily accessible to the Koreatown community, as are branches in Nassau County. The two-county region is served by numerous public, magnet, and private schools, including the highly sought Great Neck School District in Nassau County.\nMedical care\nFlushing Hospital Medical Center in Queens located on Main Street\nTransportation\nstation () is the 12th busiest station in the New York City Subway system .]]\nThe () of the New York City Subway have their eastern terminus at Flushing – Main Street station; , it is the 12th busiest subway station in the subway system. The intersection of Main Street and Roosevelt Avenue, at the western end of Koreatown, is the third-busiest intersection in New York City, behind only Times Square and Herald Square in the borough of Manhattan. Numerous other public bus and rail connections also serve Koreatown at the Main Street/Roosevelt Avenue intersection, including 22 bus lines, and the Port Washington Branch of the Long Island Rail Road. Koreatown is also readily accessible by automobile from several major controlled-access highways, including the Grand Central Parkway and the Whitestone Expressway/Van Wyck Expressway.\nNews organizations\nThe Korea Times, a news organization based in Seoul, carries a significant presence in the neighborhood. All of the major New York City daily newspapers are also found ubiquitously in Koreatown, including The New York Times, Newsday, the New York Daily News, and the New York Post.\nInternational media exposure\nThe Korean Air nut rage incident, which occurred on December 5, 2014, at John F. Kennedy International Airport in Queens, made news headlines around the world, as did the legal case begun in 2015 against Heather Cho, former executive of the chaebol, held in Queens County Court as opposed to the Seoul High Court, per the insistence of flight attendant Kim Do-hee, the plaintiff.\nCuisine\nAccording to The New York Times, a \"Kimchi Belt\" stretches along Northern Boulevard and the Long Island Rail Road tracks, from Flushing into Nassau County. However, a prominent Korean food chef stated that \"Queens is the closest you can come to authentic Korean food.\" Koreatown features numerous restaurants that serve both traditional and/or regional Korean cuisine. As noted above, the development of this Koreatown has led to the creation of an American Meokjagolmok, or Korean Restaurant Street, around the Long Island Rail Road station in Murray Hill, Queens, exuding the ambiance of Seoul itself. Korean Chinese cuisine is also available in Koreatown.\nLanguages\nKorean and English are both spoken prevalently in Koreatown. Retail signs employing the Hangul alphabet are ubiquitous.\nEconomic and political clout\nAs the population has grown, Koreatown has concomitantly gained increasing economic and political clout. Upscale Korean-owned shopping centers continue to open along the Northern Boulevard corridor. In November 2012, Ron Kim was elected as the first Korean American to the New York State Legislature, representing the 40th district.\nSocial services\nA significant array of social services toward assisting recent as well as established Korean immigrants, is readily available in Koreatown.\nSee also\n* Korean Americans in New York City\n* Korean diaspora\n* Koreatown, Manhattan\n* Koreatown, Palisades Park\n* Koreatown, Fort Lee\n* Koreatown\n* Chinatown, Flushing\n* Chinatown, Brooklyn\n* Chinatown, Manhattan\n* Chinatown, Elmhurst\nReferences"
    }
  ]
}