{
  "content": [
    {
      "type": "text",
      "text": "# Korean traditional handicrafts__disambig_1\n\nDuring ancient times, Korean craftsmen and women mastered a range of artistic techniques and utilized them to produce essential and decorative items in the traditional Korean home. These days, traditional handicrafts are still seen in Korean homes, but are also sold as souvenirs to foreign tourists that come to visit the country. Many of these handmade specialty crafts are found in Insadong or Bukcheon, where a lot of local craftsmen and women sell handicrafts. Not only do Korean handicrafts serve practical purposes, but are also a representation of the Korean culture itself. Many foreigners and locals appreciate traditional Korean handicrafts because of its colourful and intricate nature.\nDecorative storage\nOne of handicrafts made by the ancient Korean people were pieces of wooden furniture such as wardrobes, cabinets and tables crafted with balance and symmetry. Later on, Korean people developed the art of using beautifully dyed ox-horn strips, and iridescent mother-of-pearl and abalone shell to decorate furniture. An example of this would be the two tier chest which was often decorated with pearl inlay designs and used to store clothes. Other forms of storage that were made included woven baskets, boxes, and mats made out of bamboo, wisteria, and lespedeza.\nHanji\nThe literal translation of hanji () is Korean paper, as 'han' means 'Korean' and 'ji' means paper. The main ingredient of hanji paper is the fibrous inner bark of mulberry trees. To make hanji, the inner bark is taken from the tree, which then is steamed, mashed, and then mixed with a natural adhesive. From there, the mixture is strained with a bamboo strainer in a particular back and forth motion in order to achieve a crisscross pattern. Lastly, the paper is left in the sun to dry. Hanji is not only used to make crafts, but was also used in various practical ways. The long and careful process of creating the paper makes the material to become durable, which explains why it was used to cover the windows of traditional Korean homes. In addition, because the strength of the paper, many ancient Korean literature and drawings dating back to 1,000 years ago are still well preserved.\nBojagi\nBojagi – meaning ‘wrapping cloth’ in Korean – it is one of the many other traditional forms of traditional Korean handicraft. It is used for a variety of usages from present wrapping to formal ceremonial practices such as weddings. Moreover, it is also used to wrap and store everyday household items, cover food, and transporting items. Bojagi does not only have its practical purposes but also the different styles and wrapping techniques has gained international interest within the worldwide handicraft and artistic community. The process of creating the cloth involves assembling scraps of silk, hemp, ramie, or cotton, folding, creasing, ironing, and finally sewing the pieces by hand – usually made by the women in the traditional Korean household. Earlier pieces of bojagi are dated back to the Joseon Dynasty (1392-1910).\nReferences"
    }
  ]
}