{
  "content": [
    {
      "type": "text",
      "text": "# Koret Jewish Book Award\n\nThe Koret Jewish Book Award is an annual award that recognizes \"recently published books on any aspect of Jewish life in the categories of biography/autobiography and literary studies, fiction, history and philosophy/thought published in, or translated into, English.\" The award was established in 1998 by the Koret Foundation, in cooperation with the National Foundation for Jewish Culture, to increase awareness of the best new Jewish books and their authors.\nProfessor Samuel Zipperstein of Stanford University oversaw the awards from their creation until 2005, when the Koret Foundation decided to increase public interest in the awards by honoring books that were less academic and more accessible to readers. Jewish Family & Life!, a non-profit organization, was selected to manage the awards. Its CEO, Rabbi Yosef Abramowitz, stated that he hoped to transform the awards into something akin to Oprah's Book Club. The History category and the Biography, Autobiography or Literary Study category were eliminated and replaced with a new category, Jewish Life & Living.\nThe Koret Jewish Book Award is one of the highest honors for authors of works on Jewish subjects.\nWinners\nFiction\n{|\n|-\n| 1999 || (tie) Yoel Hoffmann || Katschen & The Book of Joseph\n|-\n|  || Brian Morton ||Starting Out in the Evening\n|-\n| 2000 || A. B. Yehoshua || A Journey to the End of the Millennium\n|-\n| 2001 || Philip Roth || The Human Stain\n|-\n| 2002 || Isaac Babel, Nathalie Babel (editor) || The Complete Works of Isaac Babel\n|-\n| 2003 || Henryk Grynberg || Drohobycz, Drohobycz and Other Stories: True Tales from the Holocaust and Life After\n|-\n| 2004 || (tie) Aharon Megged || Foiglman\n|-\n| || Barbara Honigmann || ''A Love Made Out of Nothing & Zohara's Journey\n|-\n| 2005 || Tony Eprile || The Persistence of Memory\n|-\n| width=75 | 2006  || David Grossman || Her Body Knows\n|}\nJewish Life and Living\n{|\n|-\n| width=75| 2006 || Rochel Berman &nbsp; || Dignity Beyond Death\n|}\nHistory (discontinued)\n{|\n|-\n|width=75|  1999 || Miriam Bodian || Hebrews of the Portuguese Nation: Conversos and Community in Early Modern Amsterdam\n|-\n| 2000 || Chava Weissler || Voices of the Matriarchs: Listening to the Prayers of Early Modern Jewish Women\n|-\n| 2001 || David B. Ruderman || Jewish Enlightenment in an English Key: Anglo-Jewry's Construction of Modern Jewish Thought\n|-\n| 2002 || Eli Lederhendler || New York Jews and the Decline of Urban Ethnicity -- 1950-1970\n|-\n| 2003 || Benjamin Nathans || Beyond the Pale: The Jewish Encounter with Late Imperial Russia\n|-\n| 2004 || Shmuel Feiner || The Jewish Enlightenment\n|-\n| 2005 || Elisheva Baumgarten|| Mothers and Children: Jewish Family Life in Medieval Europe\n|}\nPhilosophy and Thought\n{|\n| width=75| 1999 || Arnold Eisen || Rethinking Modern Judaism Ritual, Commandment, Community\n|-\n| 2000 || David Patterson || Along the Edge of Annihilation: The Collapse and Recovery of Life in the Holocaust Diary\n|-\n| 2001 || Kenneth Seeskin || Searching for a Distant God: The Legacy of Maimonides\n|-\n| 2002 || (tie) Samuel Heilman || When a Jew Dies: The Ethnography of a Bereaved Son\n|-\n| || Ken Koltun-Fromm || Moses Hess and Modern Jewish Identity\n|-\n| 2003 || Moshe Idel || Absorbing Perfections: Kabbalah and Interpretation\n|-\n| 2004 || Daniel Matt || The Zohar, Pritzker Edition, Volumes I and II\n|-\n| 2005 || Steven Greenberg || Wrestling with God and Men: Homosexuality in the Jewish Tradition\n|-\n| 2006 || Rebecca Goldstein || Betraying Spinoza\n|}\nBiography, Autobiography or Literary Study (discontinued)\n{|\n|-\n| width=75| 2000 || Steven Nadler || Spinoza: A Life\n|-\n| 2001 || Cynthia Ozick || Quarrel & Quandary: Essays\n|-\n| 2002 || Dorothy Gallagher || How I Came Into My Inheritance and Other True Stories\n|-\n| 2003 || Tikva Frymer-Kensky || Reading the Women of the Bible\n|-\n| 2004 || Benjamin Harshav || Marc Chagall and His Times: A Documentary Narrative\n|-\n| 2005 || Amos Oz || A Tale of Love and Darkness''\n|}\nChildren's Literature\n{|\n|-\n| width=75| 2005 || Karen Hesse, Wendy Watson (illustrator) || The Cats in Krasinski Square\n|-\n|2006 || Howard Schwartz, Kristina Swarner (illustrator) || Before You Were Born ||\n|}\nSpecial Awards\nGerman writer W. G. Sebald received a special Koret award in 2002 for his contributions to literature. Steven J. Zipperstein, the director of the Korets, cited Sebald's novel Austerlitz as a particularly impressive work. Sebald died several months before the awards ceremony.\nIn 2006, Jonathan Safran Foer's novel Everything is Illuminated received JBooks.com's People's Choice award for the best Jewish work of fiction of the previous decade, as determined by 1,500 voters in an online contest.\nReferences\nExternal links\n*[https://web.archive.org/web/20070906124440/http://www2.jewishculture.org/awards/awards_koretaward.html Koret Jewish Book Award]"
    }
  ]
}