{
  "content": [
    {
      "type": "text",
      "text": "# Korean War Memorial, Canberra\n\n|lat           =\n|long          =\n|extra         =\n}}\nThe Australian National Korean War Memorial is on Anzac Parade, the principal ceremonial and memorial avenue in Canberra, the national capital city of Australia, south of the Australian War Memorial. The national memorial was established on 18 April 2000.\nThe Korean War began on 25 June 1950 when the forces of North Korea invaded South Korea. 17,000 Australians fought under the command of the United Nations until the armistice in 1953. This memorial commemorates and honours those who died and served.\nSculpture\nThe design of the memorial characterises the period of the Korean War. The boulders, transported from the Imjin River region, and the monotone of materials, recall the harsh climate and terrain that were lasting impressions for those who fought there.\nOn both sides of the memorial are figures representing Australian soldiers, sailors and airmen who served in Korea, while battlefield boulders set in a field of stainless steel poles symbolise those who died. The obelisk at the front commemorates those who died with no known graves. The inscription, taken from the UN Memorial Cemetery, Busan, is a poignant link with the Australians who are buried there, and a scroll recognises the 21 nations that committed troops or medical units to the UN Command.\nA central walk-way leads to a semi-enclosed contemplative space. A boulder from a Korean battlefield is a focal commemorative point with the words \"Peace\" and \"Independence\" inscribed in Korean. Inside are images, maps and text etched into stainless steel panels telling the story of the Australians who served in the Korean War, on the left telling the general story and on the right telling of particular involvement of the Navy (nine ships and an air group), Army (3 RAR, and elements of 1 & 2 RAR), and Air Force (77 Squadron and other elements).\nDedications\nA ground-breaking ceremony was conducted on 17 September 1999 by Kim Dae-jung, President of the Republic of Korea and John Howard MP, Prime Minister of Australia, to mark the start of work on the memorial, which is commemorated by a foundation stone. The memorial was dedicated in the presence of Sir William Deane AC K.B.E., Governor-General of Australia and John Howard MP, Prime Minister of Australia.\nGallery\nImage:AS_Korea_2.jpg\nImage:AS_Korea_3.jpg\nImage:AS_Korea_4.jpg\nSee also\n* Queensland Korean War Memorial\n* Military Memorials of National Significance in Australia\nReferences\nExternal links\n*\n*[https://www.australianplanet.com/korean-war-memorial-in-canberra-F120EC10512D54C Korean War Memorial in AustralianPlanet]"
    }
  ]
}