{
  "content": [
    {
      "type": "text",
      "text": "# Korolev and Gagarin Monument\n\n|image =\n|caption =\n|coordinates =\n|location = str.Chehova,22 Taganrog, Rostov Oblast, Russia\n|designer = O.K. Komov\n|type =\n|material = bronze\n|length =\n|width =\n|height =\n|begin = 1975\n|complete = 1975\n|open = 2002\n|dedicated_to = Korolev and Gagarin\n|map_image =\n|map_text =\n|map_width =\n|relief =\n|extra =\n}}\nKorolev and Gagarin Monument (Russian: Памятник Королёву и Гагарину) is a bronze sculpture of Yuri Gagarin and Sergei Korolev by the sculptor O. Komov. It was installed in Taganrog on Chekhov Street in front of the building \"A\" of the Engineering and Technology Academy of the Southern Federal University.\nSculpture\nThe monument is modeled after a historic 1961 photograph, but the monument subtly deviates from the original image. In the photo, Korolev and Gagarin are smiling, looking at each other, and are engaged in a lively conversation. On the monument their faces are somber; they look away from each other. Gagarin is mythologized. In real life he was shorter than Korolev, as the first cosmonauts had to be small to fit into a tiny spacecraft. On the monument, Gagarin’s height rivals Korolev’s, adding gravitas and significance to his figure.\nHistory\nThe honourable citizen of Taganrog E.V. Zaytsev, the former employee of TRTI also party and the statesman became the main initiator of emergence of this sculpture in Taganrog.  Being the first deputy minister of culture of the RSFSR, and then the USSR, E.V. Zaitsev contributed to the transfer of the monument to Taganrog in 1978.\nThe sculpture \"Gagarin - Korolev\" (before the author’s name), created in 1975, was demonstrated at the exhibition in Moscow.\nThe Formation of the park sculpture museum was delayed for an indefinite period of time. TRTI and high school No.3 known for the museum of cosmonauts fought for an installation place of a monument. But for some reason in 1979 it was decided to install a monument at the intersection of Petrovskaya street and Ukrainskiy Lane. In 2002, when the radio university celebrated its 50th anniversary, the monument was moved to today's place, to the building \"A\" of TRTI.\nLinks\n* [http://www.voopiik-don.ru/main/2009-06-01-10-23-39/37-2009-06-01-06-57-03/1576-2011-04-11-11-02-06 Памятники первому космонавту на Донской земле]\n* [https://101hotels.com/recreation/russia/taganrog/points/monuments/korolyovu_gagarinu Памятник Королеву и Гагарину]\nReferences"
    }
  ]
}