{
  "content": [
    {
      "type": "text",
      "text": "# Kraken in popular culture\n\nReferences to the fictional kraken are found in film, literature, television, and other popular culture forms.\nComics\nIn various comics, particularly DC and Marvel Comics, multiple creatures have been named Kraken.\nThe Kraken is an aquatic monster that has appeared in many comics publications.\nA Kraken was featured in the story \"The Kraken\" in issue #49 of Adventures into the Unknown by ACG in 1953.\nThe web comic \"Angry Faerie\" (from July 13, 2012), featured a bodybuilder type character called the Kraken.\nA Kraken appears in Broken Moon: Legends of the Deep #1 by American Gothic Press.\nA character called \"Kid Kraken\" appeared in the Dynamite Comics series ''The Green Hornet 66' meets The Spirit.\nDC Comics\nThree versions appeared during the Golden Age of Comic Books: the first in Adventure Comics #56 (Nov. 1940), a second, land-based version existing on the planet Venus in Flash Comics #81 (March 1947) and a third variation capable of speech that claimed to be the actual Kraken from ancient folklore who battled the hero Captain Marvel in Whiz Comics #155 (June 1953).\nTwo versions appeared during the Silver Age of Comic Books: a giant octopus encountered by the Challengers of the Unknown in Showcase #12 (Jan.-Feb 1958), and the second being a giant squid summoned by the hero Aquaman in Aquaman #34 (July-Aug. 1967). Wonder Woman #247 (Sept. 1978) and #289 (March 1982) featured additional versions, and in Wonder Woman vol. 2 #75 (June 1993) the character encountered a version complete with tiara in a dream dimension. In Aquaman'' #1,000,000 (Nov. 1998), the eponymous hero of the title encounters one of the \"Krakens of Vexjor\", a race of huge tentacled reptilian sea monsters that inhabit Earth's oceans in the 853rd Century. Wonder Woman and Aquaman also encounter a young Kraken in Issue #1 (Aug. 2011, DC Comics) of the limited series Flashpoint: Wonder Woman and the Furies.\nIn the 2016 series DC Bombshells, King Nereus took the form of a Kraken to battle the heroines of the story. He's eventually dispatched by Aqua-Woman.\nMarvel Comics\nTwo types of \"Krakens\" appear in the world of Marvel Comics, one based on the sea monster and the second as a costumed identity used by several individuals. The former first appeared in The Avengers #27 (April 1966, Marvel Comics), and several variations of it have appeared in Marvel continuity since. The latter is used as the codename for a high-ranking member of Hydra, with Daniel Whitehall and Jake Fury having assumed the identity throughout Marvel Comics' run.\nFilm\n* In silent films of the 1910s and 1920s, the Kraken was often portrayed using stock footage of an octopus in a bathtub attacking a toy ship. This footage first appeared in Georges Méliès' 1906 film Under the Seas and was recycled in many other films.\n* The Kraken appears in the film Clash of the Titans (1981) as a giant, four-armed humanoid with scales and a fishtail; it is said to be \"the last of the Titans\". This originated the phrase \"Release the Kraken\", spoken by Laurence Olivier as Zeus.\n** In the 2010 version of Clash of the Titans (2010), the Kraken is again featured as a weapon of the Olympian gods. This version of the creature has a humanoid head, torso and arms but also boasts a number of tentacles. Instead of a tail, he is depicted with crab-like legs. He is given a new backstory as the creation of Hades that was used to overthrow the Titans, and was later used by Hades to get revenge on Zeus for tricking him into the underworld. \"Release the Kraken\", as said by Liam Neeson's Zeus, has become an Internet meme.\n* A telemovie called Kraken: Tentacles of the Deep (2006) features the Kraken as its main antagonist.\n* In the film ''Pirates of the Caribbean: Dead Man's Chest'' (2006), the Kraken is an enormous cephalopod with rows of sharp teeth. It does the bidding of Davy Jones by pursuing the souls of men who bear the black spot, a mark that appears on men who are overdue on their debt to Jones. In the film, the Kraken attacks numerous ships in pursuit of Jack Sparrow, who owes Jones his soul, and is eventually sent after Will Turner after he escapes the Flying Dutchman. In the finale of the movie, it ultimately attacks the Black Pearl, and successfully drags Jack and the ship itself down to Davy Jones' Locker. It later appears in ''Pirates of the Caribbean: At World's End, where, under the orders of Lord Cutler Beckett, it has been beached and killed.\n* The Kraken makes an appearance in the 2018 animated film Hotel Transylvania 3: Summer Vacation, voiced by Joe Jonas. He sings to the other monsters on the vacation to Atlantis, and he later gets brainwashed by Van Helsing in the climax to attack the monsters. Johnny breaks the Kraken out of his brainwashed state by playing the Macarena.\n* In the 2023 film Ruby Gillman, Ruby Gillman is a shy kraken girl.\n* In the 2023 film Meg 2: The Trench, a Kraken resembling a giant octopus escapes from the Mariana Trench and wreaks havoc before being killed by a Megalodon.\nLiterature\nby author Jules Verne]]\n* Alfred Tennyson 1830 irregular sonnet The Kraken, which described a massive creature that dwelled at the bottom of the sea.\n* In Herman Melville's 1851 novel Moby Dick (chapter 59) the crew of the Pequod encounter a \"vast pulpy mass, furlongs in length\". Starbuck calls it 'The great live squid, which, they say, few whale-ships ever beheld, and returned to their ports to tell of it.' Narrator Ishmael attributes this to Bishop Pontoppidan's \"the great Kraken,\" and concludes: \"By some naturalists who have vaguely heard rumors of the mysterious creature, here spoken of, it is included among the class of cuttle-fish, to which, indeed, in certain external respects it would seem to belong, but only as the Anak of the tribe.\"\n* In Victor Hugo's 1866 novel Toilers of the Sea, Gilliatt kills a giant octopus with a knife. \"This monster is the creature that seamen call the octopus, scientists call a cephalopod, and which in legend is known as a kraken.\"\n* Jules Verne's 1870 novel Twenty Thousand Leagues Under the Seas mentions the Kraken and features a group of giant squids that attack the submarine Nautilus.\n* In Anatole France's 1908 novel ''L'île des Pingouins'' (chapter V), Kraken is the name of a character that plays a monster, depicted as, among others, a dragon.\n* H. P. Lovecraft's novel The Call of Cthulhu, written in 1926, according to Cthulhu Mythos scholar Robert M. Price, has been inspired by Alfred Tennyson's sonnet. Both reference a huge aquatic creature sleeping for an eternity at the bottom of the ocean and destined to emerge from his slumber in an apocalyptic age.\n* John Wyndham's 1953 novel The Kraken Wakes features the sonnet written by Alfred Tennyson called The Kraken (1830), which described a massive creature that dwelled at the bottom of the sea; the story itself refers to an invasion by sea-dwelling aliens. The title is a play on Tennyson's line \"The Kraken sleepeth\".\n* Jack Vance's 1966 science fiction adventure novel The Blue World, based on an earlier 1964 novella The Kragen, depicts a world where natives must beware the kragen, giant, semi-intelligent squid-like predators which roam the ocean.\n* In Richard Adams' 1980 novel The Girl in a Swing, the main female character is stalked by the Kraken to punish her for the crime of murder by drowning.\n* Terry Brooks' 1985 novel The Wishsong of Shannara features a Kraken as a giant sea creature summoned by \"dark magic\" to join an assault on a Dwarf fortress.\n* In the children's book Monster Mission (also known as Island of the Aunts) by Eva Ibbotson, the Kraken is a force for good who has the ability to clean and heal the oceans.\n* Kraken appear in Artemis Fowl: The Time Paradox as enormous, peaceful creatures that stay in the same spot for centuries feeding on algae, doubling as islands. They are described as being conical in shape, although there is a tubular shaped one on the coast of Ireland. In this book, Kraken shed their shells explosively, igniting a layer of methane under the old one and sending it flying. A comparison is made between the Kraken, and a barnacle (albeit one big enough to be mistaken for an island).\n* In Michael Crichton's posthumous 2009 novel Pirate Latitudes the sailors call the large sea creature that terrorizes the protagonist's ship \"the kraken\".\n* China Miéville's 2010 novel Kraken features a cult devoted to the worship of the creature.\nMusic\n*\"Kraken\" is a song by filk songwriter Leslie Fish, based partly on the Tennyson sonnet.\n*\"Release the Kraken\" is a song by Ninja Sex Party about a comically harmless Kraken featured on their 2018 album Cool Patrol.\nSports\n* Greg Hardy, defensive end for the Carolina Panthers of the National Football League (NFL), was called \"The Kraken\" by himself and his fans.\n* The Seattle Kraken are a National Hockey League (NHL) team based in Seattle, Washington that have played since 2021.\nTelevision\n* The television series Voyage to the Bottom of the Sea featured an episode called \"The Village of Guilt\" (1964), in which a failed experiment creates a giant octopus that terrorizes the population of a Norwegian fjord.\n* In a 2015 commercial for the U.S. insurer, GEICO, a \"kraken\" emerges from a golf course water hazard during a televised tournament, its tentacles writhing and grasping a golfer and his caddy, as the commentators intone with characteristic understatement that the sea monster looks like a kraken.\nVideo games\n* Age of Mythology (2002)\n*Archon II: Adept (1984) : Features a Kraken as one of the elementals.\n* Final Fantasy (1987)\n* Forge of Empires added Kraken to the Oceanic Future age in 2017\n* God of War II  (2007) Set in the world Greek mythology, the Kraken is the final barrier between the player character Kratos and the temple of the Fates\n* Heroes of Newerth (2010)\n*Kerbal Space Program (2015): A floating-point bug in this space flight simulator which caused vessels at high speed and/or far away places to be disassembled and destroyed was named \"Space Kraken\" by the community. This name was adopted by the developers, who named the fix for this bug \"Krakensbane\". Various other game-breaking or ship-destroying glitches have since been found, which are also referred to as the Kraken.\n* Kid Icarus: Uprising (2012) features a space kraken.\n* Marvel: Ultimate Alliance (2006)\n* One Piece: Grand Cruise (2018) features the crew taking on a kraken.\n*Return of the Obra Dinn (2018): The Kraken appears in the games 8th chapter called The Doom, killing most of the ships remaining crew before retreating.\n*Sea of Thieves (2018): The Kraken functions as a random world event that can spawn upon the player. It also appears during the 'Pirate's Life' tall tales.\n*Smite (2013): Kraken is the name of Poseidon's ultimate ability (despite Poseidon being a Greek god and the Kraken being associated with the Norse). A game achievement involving this ability was called \"Release the Kraken\"\n*Splatoon series (2015-2022): Throughout all three games in the Splatoon series, the English translation has featured a brand named Krak-On, a variant on the word kraken. In the original Japanese, this connection is not present. Splatoon features a Special Weapon called the Kraken, which temporarily transforms the player character into a giant squid, granting invincibility. A reworked version called the Kraken Royale appears in Splatoon 3.\n* Wonder Boy in Monster Land (1987): Kraken is a boss monster: a blue giant squid that floats.\n* Death In The Water 2 (2023): A giant mind-controlling Kraken called Death is the main antagonist of the game.\n* Abandon Ship (2018): The Kraken is a being worshipped by a cult which periodically attacks the player's ship\n* Sail VR (2022): The Kraken serves as a boss, it was released by Davy Jones after obtaining 1 million starstones from players in November 3rd 2025, in order to defeat the Skeleton King Bonemaw, it then stayed in the ocean and began to attack the ships of players, with Davy Jones it was too late to go back.\nMiscellaneous\n* In Greek mythology, Perseus defeats a monster called Cetus, represented by the constellation of Cetus (usually depicted as a whale, whose systematic name is Cetacean, also deriving from Cetus).\n* A set of four postage stamps displaying legendary Canadian animals was released in 1990. One stamp in the set featured the kraken.\n* Kraken was the name of a marine biological supply house in the United Kingdom from 1968 to 1978. A historical website exists .\n* The Kraken is a steel floorless roller coaster manufactured by Bolliger & Mabillard. It opened in 2000 and is located at SeaWorld Orlando, in the United States.\n* The Kraken Rum is a 94 proof rum manufactured in Trinidad and Tobago; it was released in the United States in 2009.\n* Kraken Mare is a major body of liquid ethane and methane on Saturn's moon Titan\n* Kraken Catena is a pit chain and possible tectonic fault on Neptune's moon Triton\n*The Razer Kraken is a gaming/music headphone range created by Razer Inc.\n*\"Kraken\" is a modern make of twin-hose regulator for scuba diving.\n* Attorney Sidney Powell referred to releasing supposed evidence of widespread fraud in the 2020 U.S. Presidential Election as \"[releasing] the Kraken,\" inspiring a wave of memes and criticism.\n*The Commander of the Royal Canadian Navy, with the acronym CRCN, is often referred to colloquially but respectfully as the Kraken.\nSee also\n* Cetus (mythology)\n* Colossal squid\n* Giant squid\n* Giant squid in popular culture\n* Lusca, colossal octopus\n* Sea monster\n* Seattle Kraken\nReferences\nExternal links\n* [https://archive.org/download/AuthorsPlayhouse/Authors_Playhouse_440708_The_Kracken.mp3 The Kraken:] radio drama by Frederick Engelhardt (L. Ron Hubbard).\n* [https://web.archive.org/web/20081015114819/http://www.asimovs.com/_issue_0609/ref.shtml Reflections: The Kraken] by Robert Silverberg."
    }
  ]
}