{
  "content": [
    {
      "type": "text",
      "text": "# Kree–Skrull War__disambig_1\n\nThe \"Kree–Skrull War\" is a story arc that was written by Roy Thomas, and drawn by Sal Buscema, Neal Adams, and John Buscema. The story was originally published in the Marvel Comics comic book title Avengers #89–97 (June 1971 – March 1972).\nThe \"Kree–Skrull War\" is notable for its cosmic scope of interstellar warfare, enormous cast of characters, use of metaphor and allegory (for instance, to Joseph McCarthy and HUAC and the Arab–Israeli War), and the introduction of the Vision–Scarlet Witch romance, which became an ongoing theme for the characters (and the Avengers) for years to come. The \"Kree–Skrull War\" is considered by critics to be a highlight of its era, and is the culmination of a string of notable Thomas–Adams collaborations from this period, which began with their run on X-Men in 1969.\nPublication history\nWriter Thomas admits he had no \"master plan\" in writing the storyline other than that the two \"rapacious, galaxy-spanning races ... would be at war in the far reaches of space, and that their conflict would be threatening to spill over onto the Earth, turning our planet into the cosmic equivalent of some Pacific island during World War II\". In this regard, Thomas was inspired by Raymond F. Jones' 1952 novel This Island Earth.\nIn 2000, almost thirty years after the \"Kree–Skrull War\"'s original publication, Marvel produced a trade paperback collection of the entire story arc.\nAs part of 2020's Empyre event, a prelude one-shot called Road to Empyre: The Kree/Skrull War #1 details the origins of the millennia longstanding conflict between the two species.\nPlot\nThe Kree hero Captain Marvel, arriving on Earth after an extended stay in the Negative Zone, is captured by several members of the superhero team the Avengers — Quicksilver, the Scarlet Witch, and the android hero the Vision — and Rick Jones. It is later revealed that he conceived a child with the Skrull princess Anelle during this period of time. This is necessary, as Mar-Vell has inadvertently absorbed a lethal amount of radiation from spending weeks in the Negative Zone, and it will prove fatal unless treated. With the aid of a scientist, Vision drains the excess radiation from Mar-Vell.\nA flashback sequence explains that the Avengers detected an alarm from the Baxter Building, the headquarters of the Fantastic Four. They arrived at the building and found Mar-Vell using a portal to the Negative Zone in an attempt to free Rick. Annihilus attempted to escape the Negative Zone, with Mar-Vell escaping in the ensuing chaos. The flashback ends and the group are then attacked by a Kree Sentry who captures Mar-Vell and escapes. The Avengers are questioned by Mar-Vell's former colleague, Carol Danvers.\nThe Avengers respond to a call from fellow member Goliath, who advises that he is answering a distress call from Avenger Janet Pym, also known as the Wasp. With husband and fellow member Hank Pym, the pair were en route via ship to a research base in the Arctic Circle, there to study the effect of oil exploration on the environment. The pair apparently found a lush island, and investigate as the Wasp and Yellowjacket. Yellowjacket guesses the truth and pushes Wasp away before reaching the island. When he disappears, the Wasp in turn summons Goliath.\nThe Avengers arrive and are attacked once again by the Sentry, now aided by a hypnotised Goliath. The Avengers defeat Goliath but cannot stop the Sentry, who captures all but Quicksilver. The culprit is revealed to be Ronan the Accuser, now a Kree outlaw. Ronan begins \"Plan Atavus\", intending to devolve Earth to a prehistoric time to use as a base in the war against the Skrulls. Ronan shows the heroes how the research scientists at the base and Henry Pym have devolved into cavemen, who now lust after Janet Pym. Quicksilver arrives and attacks, and Ronan ends the battle when contacted and advised of an impending attack by the Skrulls on the Kree homeworld of Hala. Lacking purpose, the Sentry self-destructs. The Avengers and Mar-Vell recover and find that Pym and the other scientists, like the environment, have reverted to normal.\nMar-Vell's existence is revealed when the scientists advise the authorities as to what they witnessed, and the \"Alien Activities Commission\" is formed, led by Senator H. Warren Craddock. The Avengers agree to participate in a hearing, but this is abandoned when the Avengers refuse to hand over Mar-Vell. The Avengers encourage Mar-Vell to go with Danvers to a private farm, and although pursued by Nick Fury of S.H.I.E.L.D. escape. The Avengers deal with frustrated members of the public, who picket Avengers Mansion and then force their way in to vandalize the building.\nAvengers Captain America, Iron Man, and Thor apparently return to the Mansion and announce that, due to the behaviour of the team, it is now disbanded. Quicksilver, the Scarlet Witch and the Vision decide to leave and check on Mar-Vell, but are attacked by Skrulls, the ancient enemies of the Kree. At the same time, Danvers has led Mar-Vell to a Skrull vessel she claims to have found, and persuades Mar-Vell to build an \"Omni-Wave Projector\", a communications device that in the hands of non-Kree is a deadly weapon. Mar-Vell, however, sees through the deception and destroys the device, but he is captured by Danvers (now revealed to actually be the Super-Skrull) and, along with Quicksilver and the Scarlet Witch, is taken off Earth.\nAlthough injured, the Vision is able to return to Avengers Mansion, where Captain America, Iron Man, Thor, and Hank Pym gathered. Ant-Man reduces himself to microscopic size and enters the Vision, and is able to repair the android. Ant-Man departs and on questioning the recovering Vision, the Avengers determine it was the Skrulls – previously disguised as cows – that dissolved the team. The four Avengers find and capture the Skrulls for interrogation, and determine that the aliens are in fact three of the four members of the original exploration team that once visited Earth and battled the Fantastic Four. The Avengers are then attacked by a team of three Mandroids, sent by Senator Craddock to apprehend the heroes for failing to cooperate. Iron Man overloads their armour with an electrical discharge.\nAt the same time Triton of the Inhumans arrives, and unable to locate the Fantastic Four, asks the Avengers for aid in locating their ruler Black Bolt, needed as his brother Maximus has seized power in their homeland Attilan. The Avengers aid Triton and, after locating Black Bolt, accompany the Inhumans to Attilan. Maximus is revealed to have entered into an alliance with the Kree, and in exchange for rulership uses Kree technology to control the population, intending to use them as soldiers against the Skrulls. The Avengers defeat Maximus and his minions, and after restoring Black Bolt to power leave (with Goliath) for Skrull space, intent on rescuing their comrades.\nMar-Vell is taken to the heart of the Skrull Empire and, after being advised that the captive Avengers will be executed, is forced to build another Omni-Wave Projector. The Avengers arrive in Skrull space, and hold off the alien fleet while Mar-Vell is forced to use the Projector, which casts a temporarily freed Rick Jones back into the Negative Zone. Jones is rescued from the Zone by the Kree ruler the Supreme Intelligence, who unlocks hidden mental powers (the Destiny Force) in Rick himself, Rick then sends a wave of Golden Age heroes with the Avengers against the Skrulls, ending the war. The Destiny Force also reverts Senator Craddock on Earth to his true Skrull form, revealing he was the fourth Skrull from the Earth expedition, and he is subsequently killed by an angered mob. The heroes return to Earth to discover that the real Craddock has been found, and the Avengers' reputation has been restored.\nThe secret superhero group the Illuminati are eventually revealed to have visited both the Kree and Skrull Empires and advised the aliens that involving Earth in their war would not be tolerated.\nSequels\nA supplemental story appeared in New Avengers: Illuminati (vol. 2) #1 – 5 (Feb. 2007 – Jan. 2008), recounting the adventures of a team that Iron Man assembled after the war consisting of himself, Black Bolt, Mister Fantastic, Professor X, Namor, and Doctor Strange, feeling that all of them together possessed information that could have averted Earth's involvement in the war if they had worked together. Issue #1 recounts the group's ill-fated confrontation with the Skrull emperor Dorrek, shortly after the Kree–Skrull War. In issue #5, Iron Man brings the Elektra Skrull's corpse to the group. Subsequently, they are attacked by a group of Super-Skrulls, including one who had been impersonating Black Bolt. This issue tied the Kree–Skrull War with the ongoing crossover storyline Secret Invasion.\nTie-ins\nThe nature of Rick's strange power at the story's conclusion is revealed in Avengers Forever, where it is identified as the Destiny Force, a manifestation of human potential.\nDuring Captain America Reborn, when Captain America was sent bouncing randomly through time by a weapon devised by the Red Skull, during a brief visit to the time of the Kree–Skrull war, he took advantage of the opportunity to isolate himself and the Vision from the conflict long enough to give the Vision a message that the Vision would subsequently 'delete' from his conscious memory until the time came for him to recall it, allowing Captain America to communicate with the present without changing history.\nIn Marvel Team-Up #5, Spider-Man and Vision learn that a Skrull scout from the Kree–Skrull War is interfering with the Vision's brainwaves.\nCollected editions\nThe Avengers storyline was collected in a trade paperback:\n* The Avengers: Kree-Skrull War (208 pages, August 2000, , May 2008, )\nIn other media\nTelevision\n* The Kree–Skrull War was going to be adapted in the Silver Surfer animated series prior to its cancellation.\n* The Kree–Skrull War was adapted for the second season of ''The Avengers: Earth's Mightiest Heroes animated series.\nFilm\nCaptain Marvel'' features the mythology of the Kree–Skrull War. In the film, the conflict is depicted as one-sided, with the Skrulls being the victims of the Kree's genocidal war. The Kree Mar-Vell goes against her people and travels to Earth to help Skrull refugees escape from Kree forces. Carol Danvers was brainwashed by the Kree to fight the Skrulls. When she discovers the truth, she rebels against her former masters and helps the Skrulls find a new homeland.\nReferences\nExternal links\n*\n*"
    }
  ]
}