{
  "content": [
    {
      "type": "text",
      "text": "# Kripapureeswarar Temple__disambig_1\n\n| other_names        =\n| proper_name        =\n| country            = India\n| state              = Tamil Nadu\n| district           = Villupuram\n| location           = Thiruvennainallur\n| elevation_m        =\n| deity  = Kripapureeswarar(Shiva)\nMangalambigai(Parvathi)\n| Direction_posture  =\n| Pushakarani        =\n| Vimanam            =\n| Poets              =\n| Prathyaksham       =\n| festivals=\n| architecture       = Dravidian architecture\n| temple_quantity  =\n| monument_quantity=\n| inscriptions       =\n| year_completed         =\n| creator            =\n| website            =\n}}\nKripapureeswarar  Temple (கிருபாபுரீஸ்வரர் கோயில்) (also called Arutkondanathar or Thiruvennainallur temple) in Thiruvennainallur, a panchayat town in Villupuram district in the South Indian state of Tamil Nadu, is dedicated to the Hindu god Shiva. The presiding deity is revered in the 7th century Tamil Saiva canonical work, the Tevaram, written by Tamil saint poets known as the Nayanmars and classified as Paadal Petra Sthalam. The temple is closely associated with Sundarar, the saivite saint of the 8th century, who started composing his Tirumurai starting with \"Pitha Piraisudi\" verse in this temple.\nConstructed in the Dravidian style of architecture, the present structure of the temple is believed to have been built during the Cholas period in the 10th century. The temple has received gracious endowments from the Chola queen Sembiyan Mahadevi. Shiva is worshipped as Kripapureeswarar and his consort Parvathi as Mangalambigai. A granite wall surrounds the temple, enclosing all its shrines. The temple has a five-tiered rajagopuram, the gateway tower.\nThe temple is open from 6am - 11 am and 4-8:00 pm on all days except during festival days when it is open the full day. Four daily rituals and many yearly festivals are held at the temple, of which the Aadi star day celebrated during the Tamil month of Aaadi (June - July) for Sundarar and Panguni Uthiram festival during Panguni (March - April) with a float festival being the most prominent.\nThe temple is maintained and administered by the Hindu Religious and Charitable Endowments Department of the Government of Tamil Nadu.\nLegend\nAs per Hindu legend, the sages in Tharukavanam were very proud of their achievements and started doing a penance to destroy Shiva. Shiva absorbed all the evils from the penance and realising their mistake, the sages started their worship to Shiva. Shiva blessed them with their wishes and came to be known as Krupapureeswarar, the \"God who would bestow wishes of the devotees\".\nAs per another legend, Sundarar, the famous Saivite saint and Nayanmar, was stopped by an old man from marrying at Thirukovilur. He showed a document indicating Sundarar was indebted to the old man for serving him for a lifetime. Sundarar called him Pitha, a lunatic. The village elders after analysing the document, asked Sundarar to follow the old man. Sundarar followed the old mand and served him in his household. It was later revealed to him that Shiva appeared as the old man to test his servitude. Sundarar felt guilty of accusing Shiva, but Shiva revealed to him in a divine voice that he enjoyed the verse and requested him to sing verses starting with \"Pitha\".\nSundarar started singing his Tirumurai with \"Pitha Piraisudi\" verse in this temple and later would go on to become one of the four most venerated saints of Saiva literature.\nArchitecture\nThe exact year of building could not be ascertained from the inscriptions, but the inscriptions found in the Visalur temple indicate benevolent gifts to the temple from Raja Raja Chola I (984-1015 CE) and his successors. Based on the inscriptions, researchers point out that the temple had gardens, which were supposed to have both floral plants and fruit bearing trees. The temple has received gracious endowments from the Chola queen Sembiyan Mahadevi and is believed to have established various sculptures.\nKripapureeswar temple is located in Thiruvennainallur, a village located  from Villupuram on the Panruti- Thirukovilur road. The temple has a seven-tiered rajagopuram, the gateway tower that pierces the rectangular wall that houses all the shrines. The sanctum houses the image of Kripapureeswarar in the form of Lingam, an iconic form of Shiva. There is an Ardha Mandap and a Mukha mandap, pillared halls leading to the sanctum. The first precinct has the images of Vinayakar, Murugan, Durga, Dakshinamurthy and Chandikeswara. The hall where the case was fought between the old man and Sundarar is believed to be the Panchyat Mandap located on the right side of the entrance.\nCulture\nThe temple follows Saivite tradition. The temple priests perform the pooja (rituals) during festivals and on a daily basis. The temple rituals are performed four times a day: Kalasanthi at 6:00&nbsp;a.m., Uchikalam at 11:00&nbsp;a.m., Sayarakshai at 5:00&nbsp;p.m., and Sayarakshai between 7:45&nbsp; - 8:00&nbsp;p.m. Each ritual has three steps: alangaram (decoration), neivethanam (food offering) and deepa aradanai (waving of lamps) for both Kripapureeswarar and Mangalambigai. There are weekly, monthly and fortnightly rituals performed in the temple. The temple is open from 6am - 12 pm and 4-8:30 pm.\nAadi star day celebrated during the Tamil month of Aaadi (June - July) as Sundarar's birthday and Panguni Uthiram festival during Panguni (March - April) with a float festival being the most prominent festivals. There are other common festivals like Shivaratri, Vinayaga Chaturthi, Vijayadasami and Karthigai Deepam celebrated in the temple.\nSundarar, an 8th-century Tamil Saivite poet, venerated Kripapureeswarar in ten verses in Tevaram, compiled as the Seventh Tirumurai. As the temple is revered in Tevaram, it is classified as Paadal Petra Sthalam, one of the 275 temples that find mention in the Saiva canon. Appar is believed to have visited the temple during the series of visits from Thingalur to Thirukovilur and Pennadam. In modern times, the temple is maintained and administered by the Hindu Religious and Endowment Board of the Government of Tamil Nadu.\nSee also\n* Marundeeswarar Temple, T. Edayar\nReferences\nFurther reading\n*\n*\nExternal links\nPhotogallery\nFile: Tiruvennainallurkirubapurisvarartemple2.jpg|Vimana of the presiding deity\nFile: Tiruvennainallurkirubapurisvarartemple5.jpg|Outer prakara (right)\nFile: Tiruvennainallurkirubapurisvarartemple6.jpg|Outer prakara (left)\nFile: Tiruvennainallurkirubapurisvarartemple8.jpg|Inner prakara(right)\nFile: Tiruvennainallurkirubapurisvarartemple7.jpg|Inner prakara (left)\nFile: Tiruvennainallurkirubapurisvarartemple3.jpg|Entrance of Amman shrine\nFile: Tiruvennainallurkirubapurisvarartemple4.jpg|Amman shrine"
    }
  ]
}