{
  "content": [
    {
      "type": "text",
      "text": "# Krone Agriculture\n\n-->\n| fate                =\n| successor           =\n| hq_location_city    = Spelle\n| hq_location_country = Germany\n| area_served         =\n| key_people          = David Frink, Jan Horstmann, Thomas Veismann, Heiner Brüning, Martin Eying\n| products            = Agricultural machinery technology\n| owner               =\n| num_employees       = 2,195 (2021)\n| revenue             = over €1 billion (2022/23)\n| parent              =\n| website             =\n}}\nKrone Agriculture is the parent company of the Agricultural Machinery Technology subgroup of Bernard Krone Holding, based in Spelle in the district of Emsland, Germany. In the 2022/23 financial year, the company generated a revenue of over €1 billion.\nHistory\nFoundation and beginnings\nThe Bernard Krone machine factory in Spelle was founded in 1906 by master blacksmith Bernhard Krone and his wife Anna. The company was initially active in horse shoeing. Under the management of Bernard Krone II, the son of the founder, a machinery trade and a small agricultural machinery production facility were added.\nTowards the end of the 1920s, the company began production of manual straw cutters, straw and beet cutters, potato crushers, disc harrows, and cultivators. In 1930, Krone received a patent for the construction of a horse-drawn fertilizer spreader. After World War II, Krone produced new machines, such as a centrifugal slurry pump with an agitator and galvanized housing. In 1948, Krone began to manufacture earth shovels, disc harrows, cultivators, fertilizer spreaders and rubber-tired farm wagons in a newly built production site. In 1951, the first all-terrain reversible plow was introduced, which enabled tractors to plow without hydraulics or lifting gear. With the motorized harrow in 1954, Krone introduced the company's first agricultural machine to be driven by PTO shafts.\nExpansion at home and abroad\nIn 1963, a plant was founded in Werlte, where some of the Emsland tippers were manufactured.\nAfter the death of Bernard Krone II in 1970, his 29-year-old son Bernard Krone III became managing director of the company. A subsidiary was founded in the USA in 1973. In the same year, the company LVD Bernard Krone was founded to sell agricultural machinery. In 1993, the first large square baler was built under the name BiG Pack, which was the first Krone agricultural machine to be launched on the market in the new colors green and beige instead of the previous colors red and beige. One year later, the production of soil tillage machinery was discontinued and from then on, Krone concentrated on forage harvesting technology. In 1996, Krone launched the BiG M self-propelled large-area mower, which earned an entry in the 2001 Guinness Book of Records. In 2000, Krone launched the BiG X self-propelled forage harvester.\nFrom 2005, Krone offered a chopping drum customized to the requirements of modern biogas plants. In 2007, Krone put a new paint plant into operation at the Spelle site. In the same year, Bernard Krone IV became the fourth generation managing director of Krone Holding, while in August 2010, he was appointed managing director of the entire Krone Group.\nIn 2012, Krone opened a new logistics center in Spelle for €2.6 million. This was followed a year later by the inauguration of a new training center, which offers training for technicians and dealers and includes a test track for forage harvesters. In 2014, Krone invested €14.5 million in a technology center with space for 500 employees. At Agritechnica 2015, Krone presented the Premos 5.000, a mobile pelleting press that produces pellets in the field.\nIn the 2015 financial year, export sales accounted for 70 percent of total sales. On January 1, 2016, the business structure of all companies belonging to Bernard Krone was adjusted. As part of this, the agricultural machinery division was merged into the new Krone Agriculture SE in Spelle.\nAlso in 2016, Krone founded the French subsidiary Krone SAS in Saint-Arnoult-en-Yvelines on a 1.6-hectare site.\nRecent developments\nIn 2018, Krone presented the BiG X 1180 forage harvester, which was the most powerful forage harvester in the world at the time with over 1,156 hp. In 2021, Krone inaugurated the \"Future Lab\", a €20 million test center in Lingen on an area of 13 hectares, which includes a machine hall with workshops, a test hall with test benches and offices and a test track for truck trailers and agricultural machinery. In February 2022, Krone announced that it would be investing €100 million in a new supplier plant in Ibbenbüren. Green Teuto Systemtechnik GmbH (GTS) acts as a supplier and independent company within the Krone Group and manufactures complex welded assemblies for the parent company at the plant. In March 2022, Krone began building a new spare parts and logistics center in Spelle on a 7.5-hectare site at a cost of €40 million. Also in 2022, together with the company Lemken, Krone presented the case study for an autonomous \"proof of concept\" engineering unit, an autonomous diesel-electric agricultural power unit, which is controlled without a driver by remote control or with a tablet PC. The machine had been tested in previous years in the areas of cultivating, plowing, sowing, mowing, turning and swathing.\nCompany structure\nKrone Agriculture acts as the parent company of the agricultural subgroup of the direct parent company Bernard Krone SE & Co. KG and employed 2,195 people in 2021. In the 2022/23 financial year, the company generated revenue of over €1 billion.\nProducts and markets\nIn agricultural technology, Krone Agriculture offers forage harvesting technology products. Krone manufactures machines for contractors, producers and farmers. The company's range includes disc mowers, rotary tedders, round balers and large square balers, rotary rakes, pelleting press, bale wrappers, forage wagons and trailers. The two self-propelled machines, the BiG M mower conditioner and the BiG X forage harvester, are the flagships of the program.\nKrone Agriculture's main sales markets are Germany, Western and Eastern Europe and North America.\nReferences\nExternal links\n*"
    }
  ]
}