{
  "content": [
    {
      "type": "text",
      "text": "# Kuligi, Warmian-Masurian Voivodeship\n\n| subdivision_type1 = Voivodeship\n| subdivision_name1 = Warmian-Masurian\n| subdivision_type2 = County\n| subdivision_name2 = Nowe Miasto\n| subdivision_type3 = Gmina\n| subdivision_name3 = Grodziczno\n| pushpin_map = Poland\n| coordinates =\n| elevation_m =\n| population_total =\n| website =\n}}\nKuligi  is a village in the administrative district of Gmina Grodziczno, within Nowe Miasto County, Warmian-Masurian Voivodeship, in northern Poland. It lies approximately  north-west of Grodziczno,  east of Nowe Miasto Lubawskie, and  south-west of the regional capital Olsztyn.\nKuligi was previously known variously as Kullygy, Kullig, Kullingen (from 14.07.1908) and Kulingen (from 03.10.1908). From 1773, just after the time of the First Partition of Poland, it was part of the new province of West Prussia. Its population was mixed German and Polish. In 1905 it had a population of 165. From 1905 onwards, the village expanded with the arrival of a number of ethnic German farming families who were resettling from the Black Sea area of the Russian empire. They built new houses, a Baptist chapel, Lutheran chapel and a post office close to the railway station at Seinskau. The Baptist chapel (now a shop) and the post office remain. By 1910 there were 324 inhabitants in the village.\nOn 20 January 1920 Kulingen was transferred to Poland without a referendum by the inhabitants, and formed part of the Polish Corridor. German inhabitants were given the option of taking Polish nationality, or selling up and leaving for Germany. A large proportion chose the latter option.\nUnder its Polish name, Kuligi, the village remained part of Poland until September 1939, when it was invaded by Nazi forces. It reverted to its German name, Kulingen, as part of the Landkreis Löbau (from 1940 Landkreis Neumark).\nOn 18 January 1945 the order was given for all German inhabitants to evacuate Kulingen to escape the approaching Soviet Red Army. Some Poles also joined the Germans on the \"trek\", which left on the morning of 19 January. The planned destination for the inhabitants of Kulingen was Kreis Berent, south of Danzig, but the rapid approach of the Soviets meant that refugees headed further west or north instead.\nOn 21 January 1945 the Soviets occupied Kulingen. After the War the area was \"cleansed\" of any remaining Germans and it returned to Poland under the name Kuligi.\nReferences"
    }
  ]
}