{
  "content": [
    {
      "type": "text",
      "text": "# Kumbia Kings\n\n| years_active    =\n| label           = EMI Latin\n| associated_acts =\n| website         =\n| current_members =\n| past_members    = See band members\n}}\nThe Kumbia Kings are a Mexican-American cumbia group from Corpus Christi, Texas, created by A.B. Quintanilla. Their music encompasses the styles of cumbia, hip hop, and R&B. They produce songs in both Spanish and English. The producers for the band are Quintanilla— the brother of the late \"Queen of Tejano\", Selena— and Cruz Martínez. Quintanilla played bass guitar for the group, while Martínez, husband of international artist Alicia Villarreal, played keyboards. Both co-wrote songs for the Kumbia Kings.\nThe band went through several member changes; artists Frankie J, DJ Kane, and group K1 (Kingz One) left the band. Quintanilla, Irvin \"Pee Wee\" Salinas, and Chris Pérez also decided to leave the group due to \"internal dissension\" and joined Los Kumbia All Starz, formed by A.B. Quintanilla. Martinez formed Los Super Reyes with the remaining members of the band.\nIn October 2009, Quintanilla and Martínez announced that the Kumbia Kings would reunite for a series of concerts lasting from late 2009 through early 2010.\nHistory\nLos Kumbia Kings 1999 debut album, Amor, Familia y Respeto, immediately sold over 500,000 copies and earned them a Grammy nomination. 2001 brought the album Shhh!, which in its first week, was number 2 among all Latin releases, and stayed at the top for almost 2 years. By 2003, the Kings had already earned a nomination for the \"Latin Artist of the Year\" at the American Music Awards, along with countless other musical awards and achievements. 4 was released in March 2003. It was a bilingual project that brought together innovative fusions of R&B, pop, reggae, hip hop, vallenatos, and electro-cumbia hits. Latin stars, such as Aleks Syntek, El Gran Silencio, Juan Gabriel, and the Grammy winning group Ozomatli brought extra dimension to the Kings' already encompassing style. In October 2004, Los Kumbia Kings released their fourth studio album titled Fuego, another CD that, as well, has gone on to sell over 500,000 copies. This album has again seen the Kings meeting the \"Gold Standard\" in the music industry. On November 2, 2006, Los Kumbia Kings won their first Latin Grammy for their album, Kumbia Kings Live (Best Tropical Regional Mexican Album).\n2006: The split\nCo-founder A.B. Quintanilla quit performing and touring with Kumbia Kings in late 2005. In late 2006 it was revealed that Quintanilla and co-founder Cruz Martinez had a falling out pertaining to financial inequities found through audits of the groups finances. Martinez and the remaining members continued touring and performing through early 2007, when ownership of the name and branding of \"Kumbia Kings\" became a point of legal contention between the groups co-founders. As a remedy to lawsuits filed by Quintinalla and Martinez both agreed to surrender usage of the name \"Kumbia Kings\" to avoid costly litigation. Subsequently, both artists would go on to form respective musical groups that emulated much of formula that powered the Kumbia Kings to international success.\nIn the summer of 2018 joined by a cast of original band members and revolving musicians Cruz Martinez again began to tour and perform under the Kumbia King banner thorough out the festival market in Mexico. As part of the original agreement with Quintanilla neither of the groups co-founders can market or profit off the name Kumbia Kings in the United States but it did not apply to the country of Mexico and South America. The latest iteration of Kumbia Kings have not released new music on any pay platforms due to Quintanilla having to approve any productions that would be sold.\nQuintanilla continued to tour with his group Los Kumbia All Starz, and their October 2006 release sold well. Cruz Martínez regrouped and took what was left of Los Kumbia Kings to Warner Music Latina. In late June it was announced that the new venture would be named \"Los Super Reyes\" with their first album El Regreso de los Reyes coming August 14, 2007. The single \"Muévelo\" was released to the public over the internet and radio. The Super Reyes ensemble includes cast-offs from the last edition of \"Los Kumbia Kings\". And in a surprising move, Martínez lured original Kumbia Kings members Alex and Roy Ramírez (who were also working with their own group Kingz One) to help him out with the project. \"They are original Kumbia Kings, so I thought it would be great to have them back, plus they're family,\" stated Martínez to Univision.\nLos Super Reyes, following their huge success on the debut album, continued to tour Latin America and, for the first time in Kumbia Kings history, headed to Japan in October 2008 and Spain in November 2008 due to the international hit \"Muévelo\" which has also certified the group for platinum and gold record sales between the United States and Mexico. The group released another very anticipated studio album, Cumbia con Soul, in early 2009. In one interview, A.B. Quintanilla stated that the \"Kumbia All Starz\" were the evolution of \"Kumbia Kings\" leaving out \"Los Super Reyes\" and \"Kingz One\".\n2009–2010: Reunion tour\nIn an exclusive interview given on October 26, 2009, through Ventaneando America, it was announced by A.B. Quintanilla and Cruz Martínez themselves that the Kumbia Kings would reunite again in fall 2009. Kumbia All Starz and Super Reyes featured a combined 18 touring members for the reunion concert, held at Palacio de los Deportes in Mexico City, Mexico on November 21, 2009. Members from both groups included A.B. Quintanilla, Cruz Martínez, Jason \"DJ Kane\" Cano, Alex \"PB\" Ramírez, Roy \"Slim\" Ramírez, Anthony \"Nino B\" López, Abel Talamántez, Chris Pérez, DJ Crazy J Rodriguez, Juan Jesús \"JP\" Peña, and Ricky Rick. The concert started with guest singer Flex who sang songs like \"Te Quiero\", \"Escápate\", \"Si No Te Tengo\" and \"Dime Si Te Vas Con Él\". Then Cruz Martínez & Los Super Reyes sang songs like \"Tu Magia\", \"No Tengo Dinero\", \"Muchacha Triste\", \"Sabes a Chocolate\", \"Na Na Na (Dulce Niña)\", \"Todavía\", \"Quédate Más (I Want You Back)\", \"Eres\" and \"Muévelo\". Then A.B. Quintanilla & Kumbia All Starz sang songs like \"Mami\", \"Reggae Kumbia\", \"Dijiste\", \"Por Ti Baby\" with Flex, performed a special tribute to Michael Jackson and Selena Quintanilla, and \"Parece Que Va a Llover\". For the grand finale A.B. Quintanilla and Cruz Martínez and the rest of the Kumbia Kings got on stage and sang songs like \"Pachuco\", \"Te Quiero a Ti\", \"Desde Que No Estás Aquí\", \"Fuiste Mala\", \"Dime Quién\", \"Se Fue Mi Amor\", \"Azúcar\", \"Boom Boom\" and \"Shhh!\".\nThe show culminated with members from both groups reuniting and performing on stage. At the time, rumors persisted that Martínez and Quintanilla would reunite and begin production on a 2010 Kumbia Kings album, with original Kumbia Kings vocalist DJ Kane on lead vocals, but the project never materialized.\n2017–present: Reunited\nIn April 2022, Los Kumbia Kings All Starz performed Tejano Explosion in San Antonio, Texas. Led by A.B. Quintanilla, the band reunited under the annual Fiesta event held throughout the city.\nBand members\nHere is the list of band members and their period of membership from before the split, while the band was still called Kumbia Kings. They were the only official Kumbia Kings.\n;Former members\n* Abraham Isaac \"A.B.\" Quintanilla III – bass guitar (1999–2006)\n* Cruz \"CK\" Martínez – keyboards (1999–2006)\n* Jason \"DJ Kane\" Cano – vocalist (1999–2003)\n* Francisco Javier \"Frankie J / Cisko\" Bautista, Jr. – vocalist (1999–2003)\n* Andrew \"Drew\" Maes – vocalist (1999–2003)\n*JB Barrientes - vocalist / dancer (2000-2004)\n* Fernando \"Nando\" Domínguez III – vocalist (2003–2006)\n* Frankie \"Pangie\" Pangelinan – vocalist (2003–2006)\n* Abel Talamántez – vocalist (2003–2006)\n* Irvin \"Pee Wee\" Salinas – vocalist (2003–2006)\n* David Schmid – vocalist (2012–2014)\n* Anthony \"Nino B\" López – dancer (2003–2006)\n* Juan Jesús \"JP\" Peña – dancer (2003–2006)\n* Chris Pérez – guitar (2003–2006)\n* Chris \"ChrisBot\" Domínguez – keyboards (2002–2005)\n* Robert \"BoBBo\" Gómez III – keyboards (2005–2006)\n* \"El Animal\" Noe \"Gipper\" Nieto, Jr. – accordion (2003–2006)\n* Robert \"Robbie\" Del Moral – drums (1999–2006)\n* Jesse \"O'Jay\" Martínez – drums (1999–2003)\n* Roy \"Slim\" Ramírez – percussion (1999–2003)\n* Alex \"PB\" Ramírez – keyboards (1999–2003)\n* Frankie \"Frankie Boy\" Aranda – percussion (1999–2003)\n* Ronnie \"Campa\" Delgado - Timbales/Percussionist (2003-2006)\n* DJ Crazy J Rodriguez - dj/remixes (1999-2003)\n* Jacob Ceniceros – vocalist (2004)\n* Jorge \"Peanut\" Peña – percussion (1999–2002)\n* Jorge \"Pekas\" Caballero – percussion (2005–2006)\n* Jai Gonzalez – percussion (1999–2001)\n* Adolfo Garcia - percussion (2000-2003)\nDiscography\n* Amor, Familia y Respeto (1999)\n* Shhh! (2001)\n* All Mixed Up: Los Remixes (2002)\n* 4 (2003)\n* Los Remixes 2.0 (2004)\n* Fuego (2004)\n* Kumbia Kings Live (2006)\nSee also\n* Kumbia All Starz – band formed by A.B. Quintanilla after the 2006 breakup and included several Kumbia Kings members who decided to join with Quintanilla\n* Los Super Reyes – band formed by Cruz Martínez after the 2006 breakup and included the remaining Kumbia Kings members who stayed with Martínez\n* Kingz One – band formed by Alex and Roy Ramírez, founding Kumbia Kings members [https://web.archive.org/web/20130610024545/http://k1musik.com/ K1's website]\n* Nando y Solja Kingz – band formed by Nando Domínguez, former Kumbia Kings and Super Reyes singer\n*List of best-selling Latin music artists\nReferences\nExternal links\n*  Archived on April 10, 2006.\n*\n*\n* [https://www.discogs.com/artist/558058-Kumbia-Kings Kumbia Kings] at Discogs"
    }
  ]
}