{
  "content": [
    {
      "type": "text",
      "text": "# Kunawarritji Community, Western Australia\n\n| pushpin_map_caption      =\n| pushpin_label_position   = left\n| map_alt                  =\n| pop                      =76\n| pop_year                 =\n| pop_footnotes            =\n| poprank                  =\n| density                  =\n| density_footnotes        =\n| established              =\n| established_footnotes    =\n| abolished                =\n| gazetted                 =\n| postcode                 =\n| elevation                =\n| elevation_footnotes      =\n| area                     =\n| area_footnotes           =\n| timezone                 =\n| utc                      =\n| timezone-dst             =\n| utc-dst                  =\n| dist1                    = 530\n| dir1                     = south east\n| location1                = Marble Bar\n| lga                      = Shire of East Pilbara\n| region                   =\n| county                   =\n| stategov                 =\n| fedgov                   =\n| url                      =\n| maxtemp                  =\n| maxtemp_footnotes        =\n| mintemp                  =\n| mintemp_footnotes        =\n| rainfall                 =\n| rainfall_footnotes       =\n| near-n                   =\n| near-ne                  =\n| near-e                   =\n| near-se                  =\n| near-s                   =\n| near-sw                  =\n| near-w                   =\n| near-nw                  =\n| near                     =\n| footnotes                =\n}}\nKunawarritji (also referred to as Well 33) is an Aboriginal community, located in the Pilbara region of Western Australia, within the Shire of East Pilbara on the Canning Stock Route.\nBackground\nThe Kunawarritji settlement (5 kilometres north-west of Well 33) was established in the early 1980s by a group of Martu people from Punmu. The current population is made up primarily of Martu people, consisting of approximately 115 people. As the community is of cultural significance to all Martu people in the western desert, the population can increase up to 1000 during cultural business.\nPunmu and Parnngurr are the other large Western Desert communities situated 165&nbsp;km and 230&nbsp;km west of Kunawarritji respectively. The Kunawarritji community frequently interacts with these and other communities in the area.\nFuel (diesel and Opal) and a wide range of supplies are available from the store.\nNative title\nThe community is covered by the determined Martu native title claim area (WC 96/78). A prescribed body corporate named the Western Desert Lands Aboriginal Corporation was registered for the Martu land on 17 July 2003. Future development at the community requires the authorisation of the prescribed body corporate.\nGovernance\nThe community is managed by its incorporated body, the Kunawarritji Aboriginal Corporation, incorporated under the Aboriginal Councils and Associations Act 1976 on 30 May 1995.\nTown planning\nKunawarritji layout plan No.1 was endorsed by the community and Western Australian Planning Commission in 2004.\nNotes"
    }
  ]
}