{
  "content": [
    {
      "type": "text",
      "text": "# Kundala Karaneswarar Temple\n\n| other_names        =\n| proper_name        =\n| country            = India\n| state              = Tamil Nadu\n| district           = Mayiladuthurai\n| location           = Tirukurakkaval (near Vaitheeswaran Koil(11 km) )[https://www.google.co.in/maps/place/Kundaleswarar+Temple/@11.2357462,79.6908143,11.89z/data=!4m19!1m13!4m12!1m3!2m2!1d79.4985187!2d11.0607106!1m6!1m2!1s0x3a54de96965eb531:0xff4608d7148409e!2sKundaleswarar+Temple,+Kondal,+Tamil+Nadu+609116!2m2!1d79.6607575!2d11.2185846!3e0!3m4!1s0x3a54de96965eb531:0xff4608d7148409e!8m2!3d11.2185846!4d79.6607575 Temple Location]\n| elevation_m        =\n| deity  = KundalaKaraneshwarar(Shiva)\nBala Tripura Sundari\n| Direction_posture  =\n| Pushakarani        =\n| Vimanam            =\n| Poets              =\n| Prathyaksham       =\n| festivals=\n| architecture       = Dravidian architecture\n| temple_quantity  =\n| monument_quantity=\n| inscriptions       =\n| year_completed         =\n| creator            =\n| website            = http://www.sgsgctrust.org/index.html\n}}\nThe Kundaleswarar or Kundalakaneswarar temple (Tamil: திருக்குரகாவல்)(குண்டலகரணேசுவரர் கோயில்) is a Hindu temple situated in the village of Thirukkurankaval  near Vaitheeswaran Koil in Mayiladuthurai taluk of Mayiladuthurai district, Tamil Nadu, India The presiding deity is KundalaKaraneswarar, a form of the Hindu god Shiva and his consort Bala Tripura Sundari. This place is also referred to as ThiruKurakkukka or Thiru KoranguKukka .\nKuntaleswarar temple is accessible by road from Vaitheeswaran Koil, which is about 11&nbsp;km&nbsp; from the temple. A tributary of Cauvery, Ganapathy Theertham, runs alongside this temple.\nKuntaleswarar temple is considered to be the 28th in the series of the Tevara Padal Petra Stalams located in Chola Nadu, north of the river Kaveri. This temple is located close to the Karuppariyalur temple, another Padal petra sthalam which shares the same legend. Hanuman worshipped Shiva seeking pardon for the offence of having tried to uproot the Shivalingam at Rameswaram. Shiva (Aparadha Kshameswarar) is said to have blessed Hanuman at Karuppariyalur, and Hanuman is believed to have built a temple for Shiva at Kurakkukka nearby. Lord Hanuman is said to have offered his Kundalams (ear rings) to Lord Shiva here, hence goes the name of the deity, Kundalakaraneshwarar. It is said that even to this day, a pack of monkeys enter the sanctum in the summer months of Chittirai and Vaikasi making offerings of flowers or Blilva leaves to the deity.\nThis is also one of the five Kaavus, though much less visited today: The other four are – Thirukkodikkaa in Thirukkodikaaval, Thirukkolakkaa (Osai Kodutta Nayaki temple, Sirkazhi), Thirunellikkaa (near Thiruvarur) and Thiruvaanaikkaa (Trichy).\nThe temple has a shrine to Lord Kundalakaraneshwarar (Lord Shiva), his consort, the Ambal Kuntalalambika or Sri Elasowndari Ambal or Bala Tripura Sundari, and Lord Anjaneya. Lord Anjaneya's shrine faces that of Lord Shiva. It is one of the two places in the world (the other being Rameshwaram) where Lord Anjaneya, typically known as devotee of Lord Rama, is shown worshipping Lord Shiva. The temple also has a shrine to Lord Gajalakshmi, Lord Chandikeshwarar, Lord Dakshinamurthy, Goddess Durga and others.\nNotes\nReferences\n*\nExternal links"
    }
  ]
}