{
  "content": [
    {
      "type": "text",
      "text": "# Kung Fu Panda: Legendary Warriors__disambig_1\n\n| designer =\n| programmer = Daniel Sud\n| artist = Sophie Ouellet\n| writer = Ann Lemay\n| composer = Tom Salta\n| released = }}\n| genre = Action-adventure\n| modes = Single-player, Multiplayer\n| platforms = Nintendo DS, Wii\n}}\nKung Fu Panda: Legendary Warriors is a 2008 action-adventure game developed by Artificial Mind and Movement and published by Activision for the Nintendo DS and Wii. It is a sequel to the video game Kung Fu Panda (2008). Players get to play the role as Po, Shifu, Tigress, and Monkey throughout the game levels. A significant feature has Jackie Chan reprising his role of Monkey.\nPlot\nWii version\nThe narrator narrates about the Valley of Peace, which was guarded under the watchful eye of the Dragon Warrior Po the panda, and the Furious Five (Master Crane, Monkey, Viper, Mantis and Tigress). Meanwhile, Tai Lung the snow leopard resurfaces and plans to get revenge after the day he was defeated by Po by capturing the Dragon Warrior and the Furious Five. He gains access to a secret weapon, which will give him super strength. He orders the Black Moon Scavenger Clan (a clan of rats), along with other villains to capture enough villagers to power the machine. The game then starts with whoever the player is playing (Monkey, Tigress, Po or Shifu) training in the Training Hall at the Jade Palace.\nAfter their training, a rabbit tells them that the Black Moon Scavenger Clan has arrived. The player then goes to the front entrance of the Jade Palace arena, and finds the Black Moon Scavenger Clan led by the Rat Boss and the player fights some of the rats. The player then uses the rocket chair to blast off into the arena and fights the Rat Boss and his rats.\nThe player is then instructed to go to the Wu Dang Mountains to save a villager of the Valley of Peace and fight Yak and his fellow Hoof Clan members. After the Hoof Clan's defeat, the rabbit cage then tumbles down the cliff with the player following it to save the villager inside. The player then defeats Great General Ox, and is sent to the Old Temple Grounds where the baboon and his servants, instructed by Tai Lung, have taken Mantis hostage.\nThe player arrives and fights the Baboon Boss and his servants. After their defeat, the player then journeys to Chor Ghom Prison to rescue Master Viper from the Gorilla Boss and his servants.\nAfter the gorilla's defeat inside the prison, the player then is instructed to head back to the Valley of Peace to rescue Master Crane from the Wu Sisters.\nAfterwards Tai Lung arrives at the celebration back at the arena. When the player arrives at the arena for the final battle, the player fights Tai Lung and eventually defeats him.\nDS version\nTai Lung plans revenge to capture the Furious Five after the day he was defeated by Dragon Warrior Po. Whoever the player is playing as (Po or Tigress), they start training in the Valley of Peace. After their training, the player then goes to the front entrance of the village.\nThe player arrives and rescues Viper from the Wu Sisters.\nAfter their defeat, Mantis is there, the player then journeys to rescue Monkey from Ox after General Ox's defeat.\nWhen the player arrives at the arena for the final battle, the player rescues Crane, fights Tai Lung and defeats him.\nReception\n| MC_WII = 57/100\n| 1UP_WII = C\n| Gamekult_WII = 2/10\n| GameZone_DS = 6.4/10\n| GameZone_WII = 7/10\n| JXV_DS = 8/20\n| JXV_WII = 8/20\n| NWR_DS = 7/10\n| NWR_WII = 6/10\n}}\nThe game received \"mixed or average reviews\" on both platforms according to the review aggregation website Metacritic.\nMedia website CinemaBlend ran a negative review by Andy Keener, who labeled the Wii version \"boring and tiresome\". He also stated, \"Your characters never get better, but the enemies get stronger. The levels never feature anything of note; they could be blank white rooms with no doors and the gameplay would be exactly the same.\"\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}