{
  "content": [
    {
      "type": "text",
      "text": "# Kurds in the United Kingdom\n\nKurds in the United Kingdom or British Kurds () refers to people of Kurdish origin born in or residing in the United Kingdom.\nHistory\nKurdish people first arrived in Britain in large numbers during the 1980s, mostly from the disputed territories of Kurdistan (Iraq, Turkey, Iran, and Syria), many of them fleeing oppression.\nDemography\nPopulation size\nAccording to the Department for Communities and Local Government, drawing on a BBC source, the Kurdish community in the UK numbered around 50,000 in 2002, among whom Iraqi Kurds make up the largest group, exceeding the numbers from Turkey and Iran. They have settled across the country, including in major cities such as London, Birmingham, Manchester, Leeds, and Glasgow.\nIn the 2011 census, \"Kurdish\" was not one of the predefined tick-box answers for the ethnicity question on the UK Census, but respondents are able to write in their preferred self-designation.\nDetailed census numbers\n{| class=\"wikitable col1left\" style=\"text-align:right;\"\n! Region !! 2011\n!2021/22\n|-\n| Greater London||\n|30,870\n|-\n| West Midlands||\n|12,066\n|-\n| Yorkshire and the Humber||\n|12,007\n|-\n| North West England||\n|11,781\n|-\n| East Midlands||\n|6,051\n|-\n| South East England||\n|5,665\n|-\n| East of England||\n|5,337\n|-\n| North East England||\n|3,512\n|-\n| South West England||\n|3,112\n|-\n| Wales||\n|2,579\n|-\n| Scotland ||\n|773\n|-\n| Northern Ireland ||\n|190\n|-\n|United Kingdom\n|49,841\n|93,947\n|}\nIntegration issues\nWriting in 2009, criminologist Aisha Gill noted that little research had taken place into honour crimes in the UK, and that this lack of evidence was \"particularly marked in the case of Iranian and Kurdish communities, where the incidence of honor crimes is increasing\".\nA report published by the Centre for Gender and Violence Research at the University of Bristol and the University of Roehampton in 2010 notes that \"it is important to recognize that it is not possible to associate honour-based violence with one particular religion...or culture\", but also concludes that \"[h]onour-based violence remains prevalent in Kurdish communities in different locations\", including the UK. The report finds that \"the patriarchal or male-dominated values that underpin these communities often conflict with the values, and even laws, of mainstream UK society. This makes it particularly hard for second or third generation women to define their own values...Instances of HBV [honour-based violence] often result from conflicting attitudes towards life and family codes\". Banaz Mahmod, a 20-year-old Iraqi Kurd woman from Mitcham, south London, was killed in 2006, in a murder orchestrated by her father, uncle and cousins. Her life and murder were presented in a documentary called Banaz: A Love Story, directed and produced by Deeyah Khan. Other examples include the first honour killing to be legally recognised in the UK, which was that of Heshu Yones, who was stabbed to death by her Kurdish father in London in 2002 when her family discovered she had a Lebanese Christian boyfriend, and the killing of Tulay Goren, a Kurdish Muslim girl who immigrated with her family from Turkey. The Centre for Gender and Violence Research report finds that: \"Both HBV survivors and women's NGOs working with them continue to encounter inadequate responses and poor practice which needs to be addressed, as well as potentially racist, judgmental and stigmatizing attitudes\". The Iranian and Kurdish Women's Rights Organisation has called for a national strategy to address the problem of honour killings. Other UK-based Kurdish organisations attempting to tackle the issue of honour killings include Kurdish Women Action Against Honour Killing.\nNotable people\n* Freema Agyeman (born 1979), actress\n* Feryal Clark (born 1979), Labour MP\n* Ibrahim Dogus (born 1980), restaurateur and Labour councillor\n* Deba Hekmat (born c. 2001), model and actress\n* Shwan Jalal (born 1983), football coach\n* Allan Mustafa (born 1985), actor, comedian and writer\n* Nadhim Zahawi (born 1967), Conservative politician\n* Mazhar Khaleqi Kurdish singer\nSee also\n*Kurdish population\n*Immigration to the United Kingdom\nReferences\nExternal links\n*[http://www.kea96.org/ Kurdish Exile Association - Camden]"
    }
  ]
}