{
  "content": [
    {
      "type": "text",
      "text": "# Kuremsa war\n\n\") during the years 1245–1349|up=yes}}\n| date              = 1252–1258\n| place             = Galicia–Volhynia\n| result            = Galician–Volhynian victory\n| territory         = Kingdom of Galicia–Volhynia retains higher degree of independence\n| combatant1        =  Galicia–Volhynia\n| combatant2        =  Mongol Empire\n*  Golden Horde\n-----\nLithuania}}\n| commander1        =  Daniel of Galicia Leo I of Galicia Vasylko Romanovych Roman Danylovich Andriy\n| commander2        =   Myliy Baskak Khval Syrvyd Rushkovych\n}}\nThe Kuremsa war or '''Kuremsa's campaign''' was a series of conflicts during 1252–1258 between Daniel (Danylo) of Galicia–Volhynia and general  of the Golden Horde, which ended in Kuremsa's defeat.\nTerminology\nThe terms \"Kuremsa war\" or \"Kuremsa's campaign\" are translated from the phrase Kuremsina rati (modern Russian and ) that originated from the Galician–Volhynian Chronicle (GVC; as preserved in the Hypatian Codex and Khlebnikov Codex). Phrases combining the Church Slavonic word рать with the name Коуремьсѣ (Kuremǐsę) can be found in various forms throughout the narrative of the Galician–Volhynian Chronicle, and translated in several ways (depending on context), such as:\n* sub anno 6765 (1257): \"По рати же Кремѧнецькои Коуремьсинѣ, Данилъ возд̑виже рать противоу Татаром̑ \". (\"After '''Kuremsa's attack on Kremenec, Danilo began a campaign' against the Tatars.\")\n* sub anno 6767 (1259): \"Ӕкоже древле писахомъ во Коуремьсиноу рать ѡ зажьженьи города Холмъ\" (\"And [now] about the burning of the city of Xolm during 'Kuremsa's campaign' which we had previously begun (1237) to narrate\".)\n* sub anno 6768 (1260): \"Данило же держаше рать с Коуремьсою и николи же не боӕсѧ Коуремьсѣ\" (\"Danilo would wage war against Kuremsa, but was never afraid of [Kuremsa]\".)\nThe term is used in Ukrainian and Russian historiography to describe this series of conflicts between 1252 en 1258. Charles J. Halperin (1987) translated the plural form рати (rati'') as \"raids\" (as found in Serapion of Vladimir's sermons).\nPrelude\nAfter the Mongol invasion of Kievan Rus', many Rus' principalities were turned into tributary states and their lands were devastated, among which was Galicia–Volhynia. Between 1241 and 1245 Prince Daniel had recovered control of most of his cities in Galicia and Volhynia, and won the War of the Galician Succession (1205–1245) at the decisive Battle of Yaroslavl (1245). However, under pressure from the Golden Horde, he decided to accept Mongol suzerainty over his lands by travelling to Sarai on the Lower Volga and submitting to Batu Khan in the winter of 1245–1246; in exchange, he received a jarlig to remain prince of Galicia and Volhynia., learns upon his return that the penalty for not complying with Tatar wishes will be the loss of his patrimony. Accordingly, Daniil travels to the Horde, goes down on his knees before Batu, accepts the designation slave (kholop'') of the Tatars, guarantees tribute, and, like Nevskii, is dismissed with honor.\"}} The other two major Rus' princes of that time, Michael of Chernigov and Yaroslav II of Vladimir, were both killed the next year (1246): Michael in apparent defiance of Batu Khan at Sarai, while the cause of Yaroslav's death during his journey to Karakorum and back is less certain. On the other hand, Yaroslav's sons Andrey and Alexander duly travelled to both Sarai and Karakorum to pay their respects to the Mongol khans and receive their jarligs in the late 1240s.\nGiven the fact that Daniel had formally submitted himself to Batu Khan in the winter of 1245–1246, the exact origin behind Daniel's \"war with Kuremsa\" is unclear. According to Mykhailo Hrushevsky (died 1934), the origin of this conflict laid in Kuremsa's desire to control Daniel's lands, and was not only a result of Daniel's independent policy from Tatars. Janet L. B. Martin (2007) pointed to the fact that Andrey II of Vladimir and Danylo of Halych both refused to renew their jarligs upon the 1251 accession of Möngke Khan; therefore, Batu Khan's son Sartaq sent out punitive expeditions against them both for daring to challenge Mongol authority. Halperin (1987) similarly pointed out the regularity of Mongol punitive expeditions against \"rebellious or recalcitrant principalities\", and that \"Galicia and Volhynia were not immune to such attacks either, and suffered much harm during the second half of the thirteenth century.\"\n(1252) was sent against Andrey, who was quickly defeated and ousted from Vladimir on the Klyazma, fleeing to Sweden via Novgorod (he later returned in 1255 to become prince of Suzdal). However, Danylo of Halych was more capable at resisting general Kuremsa's campaign than Andrey had been in defending against general Nevryuy's simultaneous punitive expedition. He held on for several years and formed an anti-Horde coalition, with political and marriage alliances with the ruling families in Lithuania, Hungary, Austria, Poland and the Catholic Church, with mixed results. Some of Daniel's plans to get assistance from other European states didn't manifest, and Daniel also had to abandon his plan of forming an anti-Mongol coalition with Nizhny Novgorod-Suzdal, having to now face Kuremsa's Mongol-Tatar forces on his own.\nWar\n{| border=\"0\" cellpadding=\"2\" cellspacing=\"2\" align=\"right\"\n|-frame\n|\n|-\n|}\nDuring 1252–1253, Prince Daniel attempted to get assistance from the West in his fight against the Golden Horde, seeking for Pope Innocent IV to declare a crusade against the \"heathen\" Tatars. From the hands of a papal legate, Daniel even accepted a royal crown that turned the Principality of Galicia–Volhynia into a kingdom. This was done for a promise by Daniel to establish a kind of Rome-aligned Ruthenian church in Galicia–Volhynia (as the Ruthenian Uniate Church would later become in the 1590s). However, the Pope was unable to call Catholic states to a crusade; Daniel nonetheless kept his new royal title. This severed Daniel's relations with the Pope and the other Catholic bishops, who even began to call for a crusade against Rus' (Ruthenia). The war against Kuremsa started as a result of his son Leo's campaign into Podolia and capture of Medzhybizh.\nIn 1253/1254, upon his return from a campaign to Lithuania, Daniel learnt about Tatar commander Myliy capturing Bakota due to the governor's surrender of the city. To recapture the city, Daniel sent out Leo (Lev), who defeated the Tatar army and took Myliy and a basqaq (Mongol-Tatar tribute collector) captive due to a surprise attack. Kuremsa himself led his army to the south of Volhynia, where he besieged Kremenets. Kremenets governor Andriy held a dual loyalty and tried to negotiate with Kuremsa, but this didn't save Andriy from execution by Kuremsa. Nonetheless, Kuremsa failed to capture Kremenets and retreated.\nIn 1255–1256, Daniel liberated territory from Mongol-Tatar control along the Southern Bug, Sluch and Teteriv rivers. King Daniel also captured Zviahel. By taking advantage of the strife within the Golden Horde, he successfully carried out this campaign. Due to clashes with Lithuanians, Daniel was unable to move further.\nIn 1256, a Lithuanian army led by voivode Khval was sent to supposedly help in a war against Mongol-Tatar forces, but instead begun to plunder Ruthenia. They were plundering the areas of Lutsk, before being confronted by local Rus' forces. The Lithuanian army was defeated, driven into the river, with many Lithuanian troops drowning and voivode Khval himself falling in battle. Syrvyd Rushkovych managed to flee.\nIn 1257, Kuremsa was now in a more advantageous position and laud siege to Volodymyr. Daniel was taken by surprise and the city was only defended by civil militia. Despite this, Kuremsa was unable to capture the city. Kuremsa made his last attempt by besieging Lutsk, but was repelled again and had to retreat. A Tatar assault on Bakota took place, which was repelled, but with Kholm accidentally burning down.\nAftermath\nAs a result of the war that took place during 1252–1258, all of Kuremsa's campaigns ended in failure. In his last unsuccessful campaign, Kuremsa declared an open war. Galicia–Volhynia became an example of one of the first states to successfully wage a war against the Mongol Empire. King Daniel built more fortifications. Part of the reason behind general Kuremsa's failure is attributed to the Mongol-Tatar population not exceeding 200,000 in Ukraine during this period, as this number wasn't enough to subjugate Daniel's Ruthenian kingdom, which pursued an independent policy against the khan of the Golden Horde. However, problems began to arise for rebellious Rus' princes when the Mongol-Tatar population in southern Ukraine drew larger forces from the western part of the Mongol Empire to raid the rebellious principalities, which was done when the local khans were unable to subjugate rebellious principalities through their own efforts.\nIn 1259, Burundai was sent with a larger army to replace Kuremsa. Burundai was known for his successful conquest of Ryazan and Suzdal. This was done in order to save Tatar prestige after Kuremsa's defeats. King Daniel didn't dare to fight Burundai. At the same time, the Golden Horde didn't want to have an open war with Galicia–Volhynia either. Daniel eventually had to accept Burundai's demands on demolishing the fortifications he had built, with the exception of Kholm. Burundai didn't dare to storm well-fortified Kholm. Daniel renewed his allegiance to the Golden Horde, but Galicia–Volhynia retained a higher degree of independence in comparison to other Rus' principalities.\nNotes\nReferences\nBibliography\nPrimary sources\n* Galician–Volhynian Chronicle ( 1292).\n**  – critical edition\n**  – 1973 English translation\n**  — A modern annotated Ukrainian translation of the Galician–Volhynian Chronicle, based on the Hypatian Codex with comments from the Khlebnikov Codex.\nLiterature\n*  (e-book).\n*\n*\n*\n*\n*\n*"
    }
  ]
}