{
  "content": [
    {
      "type": "text",
      "text": "# Kurt Warner's Arena Football Unleashed\n\n. GameSpot. Retrieved on February 12, 2008.\n| publisher = Midway Home Entertainment\n| designer =\n| engine =\n| released = }}\n| genre = Sports\n| modes = Single player, multiplayer\n| platforms = PlayStation\n| artist = Steve Mitchell\n| composer = Aubrey Hodges  Dale Stump\n| programmer = DJ Christy  Randy Johns  Detmar Peterke\n}}\n'Kurt Warner's Arena Football Unleashed' is a sports video game developed and published by Midway for the Sony PlayStation. It was released in North America on May 18, 2000 and was based on the 2000 Arena Football League season. It is of note that it would not be until 2006 before another Arena Football League video game would be released. It is based around the fame of American football quarterback Kurt Warner, a former AFL player for the Iowa Barnstormers who later went on to star in the NFL.\nGameplay\nA quarterback passes to one of his receivers.\n''Kurt Warner's Arena Football Unleashed'' differs from other American football video games due to its usage of the arena football system. A few rule changes include that there are half as many players on the field, field goals go back into play if they miss the goalposts, and that there is no such thing as punting. The overall gameplay is very similar to the NFL Blitz series for its violence controls, modes, and general game structure,  with one reviewer even noting that \"The post-play violence has been pumped up to the level that Blitz had before the NFL forced Midway to tone it down.\"\n| GSpot = 5.9/10\n| IGN = 4.0/10\n}}\n''Kurt Warner's Arena Football Unleashed received mostly poor reviews, portraying it as being a weaker version of NFL Blitz 2000''. GameSpot criticized the game and gave it a low score. \"It's a scaled-down version of Blitz 2000 with a few changes, but these changes don't really enhance the game in any way.\" IGN wrote, \"... the actual game engine seems more like a poor man's Blitz.\"\nExternal links\n*\nReferences"
    }
  ]
}