{
  "content": [
    {
      "type": "text",
      "text": "# Kurunta (king)\n\nKurunta (}}) was a Hittite prince, a younger son of the early 13th century BC Hittite great king Muwatalli II, brother of Muršili III, nephew of Ḫattušili III, and cousin of Tudḫaliya IV. Kurunta was made king of the Land of Tarḫuntašša by his uncle Ḫattušili III. It has been suggested that he may have captured the Hittite capital for a very short time during the reign of the Hittite king Tudḫaliya IV and declared himself a great king.\nName\nHis Luwian name Kurunta referenced a namesake god, one of the patron deities in the Hittite pantheon. As customary for the later Hittite princes, Kurunta also had a Hurrian name Ulmi-Teššub (spelled also Ulmi-Teshup\").\nThe names of the gods and the monarchs are derived from a Proto-Indo-European root *ker-, meaning 'head', 'horn'. In the Anatolian branch, the root originated Hittite kara=war- and Cuneiform Luwian zarwaniya ('pertaining to horn').\nLife\nThe Bronze Tablet: Treaty between Tudḫaliya IV and Kurunta\nMost of the information about Kurunta is known from a Hittite royal edict and two treaties concluded between Hittite state and kingdom of Tarḫuntašša. His name is also mentioned in the document known as the Tawagalawa Letter, various seals, and a rock inscription.\nAccording to these documents, Muwatalli gave his son Kurunta to the care of his brother Ḫattušili III at a young age and Kurunta grew up with the sons of Ḫattušili. After the death of Muwatalli, Kurunta's elder brother Muršili III (Urḫi-Teššub) took the throne. A significant event in Muwatalli's reign, which probably influenced the later course of Kurunta's life, had been his transfer of the Hittite court to Tarḫuntašša in south-central Anatolia. Muršili III, however, returned the royal court to the traditional capital Ḫattuša.\nHowever, a few years later, when Muršili III and his uncle Ḫattušili III began a struggle for the throne, Kurunta supported Ḫattušili. When Ḫattušili III ascended the throne, he rewarded Kurunta by appointing him vassal king over the city and country of Tarḫuntašša in the south of central Anatolia. Tarḫuntašša, which had already served as the Hittite royal residence during the reign of Kurunta's father Muwatalli II, now became the seat of a junior line of the Hittite royal house, inaugurated by Kurunta.\nThe treaty between Ḫattušili III and his nephew refers to the vassal king variously as Kurunta and Ulmi-Teššub, while an edict of Ḫattušili specifying the vassal king's military obligations refers to him as Kurunta. The treaty was apparently concluded early in Ḫattušili's reign, as its witnesses include as crown prince Nerikkaili, who was subsequently replaced in that role by Ḫattušili's eventual successor, Tudḫaliya IV. The treaty guaranteed Kurunta that the rights of his son and grandson to the throne of Tarḫuntašša would be respected, that they would all be protected by the Hittite great king if loyal, delineates the frontiers of Tarḫuntašša's jurisdiction, lists Kurunta's military obligations to his overlord, and calls upon divine and human witnesses.\nThe future great king Tudḫaliya IV interceded with his father on behalf of Kurunta, securing an extension of his jurisdiction. Conversely, Kurunta seems to have sworn an oath of loyalty to Tudḫaliya, whether the latter became king or not. This support from Kurunta could have been instrumental in securing the kingship for Tudḫaliya. The treaty between Tudḫaliya IV, as the new Hittite monarch, and Kurunta delineated the frontiers of Tarḫuntašša once again, in greater detail, indicating the award or return of additional territories to Kurunta, and granting him the highest status in the Hittite court below the king and crown prince. This new treaty was inscribed on a bronze tablet, discovered at Ḫattuša in 1986, the only one of its kind to be found, although a number of such official treaty copies are known to have existed from other sources. Unlike most clay tablets, the bronze tablet of the treaty is in a state of near perfect preservation, making it a rare and valuable artifact preserving a complete text.\nAt least some of the intended territory of Tarḫuntašša's might have fallen into the hands of Lukka warriors acting with support from Ahhiyawa. Kurunta may have spent Ḫattušili's reign trying to recover such lost territory. The provisions of the treaty with Tudḫaliya IV indicate that, should the Hittite great king conquer additional lands west of the border river Kaštaraya (Classical Kaistros, Aksu), in the area of the city of Parḫā (Classical Perge in Pamphylia), he was expected to turn them over to Kurunta. For modern scholarship, the treaties of Kurunta with his Hittite overlords are very important, as they help resolve some of the questions about Anatolian geography in the Bronze Age.\nOne of the so-called \"Insibia letters\" from Ramesses II to (apparently) Tudḫaliya IV and his mother Puduḫepa records the special dispatch of an Egyptian physician, Pariamaḫu, to cure Kurunta from an unspecified ailment. Kurunta's two attendant physicians, on the other hand, are to be sent to Egypt upon Pariamaḫu's arrival.\nUltimately, Kurunta does not appear to have been content with his fiefdom, and at some point he began using the title of 'Great King' on his seal and on a rock inscription at Hatip, 17&nbsp;km southwest of Konya. The seal read \"Kurunta, Great King, Labarna, My Sun,\" while the Hatip inscription named him \"Kurunta, the Great King, the Hero, the son of Muwatalli, the Great King, the Hero.\" The seal impressions were found in Ḫattuša itself, and the treaty bronze tablet was intentionally buried under a paved area near the great southern Sphinx Gate, suggesting some severe breach between the two courts that led to this purposeful act of obliteration. The general supposition is that Kurunta usurped the throne from Tudḫaliya IV or his successor Arnuwanda III, although there is no agreement on the course of events. It has also been suggested that Kurunta simply declared his local independence or his equality with the Hittite great king, perhaps profiting from Tudḫaliya IV's defeat by the Assyrians, without having to attempt at usurpation or engage in military conflict.\nDespite the treaty assurances that Kurunta would be succeeded by his son and grandson, we are nowhere told the names of such descendants. Nevertheless, it appears that a new king of Tarḫuntašša evidently lived in peace with the Hittite great king and corresponded with Niqmaddu IV and Ammurapi II, the kings of Ugarit at the end of the 13th century BC/start of the 12th century BC. A Hieroglyphic Luwian inscription on a wall of the southern acropolis of Ḫattuša mentions an attack by the last generally recognized Hittite great king, Šuppiluliuma II, a son of Tudḫaliya IV, on Tarḫuntašša. This would indicate an eventual conflict between Tarḫuntašša and the Hittite court, but a different interpretation of the text has been proposed, to the effect of stating that the ruler of Tarḫuntašša served the Hittite great king. Some scholars place Great King Ḫartapu, son of Muršili, known from inscriptions found at Burunkaya, Karadağ, Kızıldağ, and Türkmen-Karahöyük, in the early 11th century BC, as a successor of Kurunta and possibly as the supposed adversary of Šuppiluliuma II. However, Ḫartapu's date remains controversial.\nUlmi-Teššub and Kurunta\nThere has been scholarly debate about whether Ulmi-Teššub and Kurunta were the same person. Comparisons between the Ulmi-Teššub treaty and the Kurunta treaty have led some scholars to conclude they are the same person, and others to conclude that they are distinct individuals. For instance, the later treaty between Tudḫaliya and Kurunta mentions that in a former treaty, Ḫattušili had demanded that Kurunta marry a woman of queen Puduḫepa's choice; Tudḫaliya then revoked that demand. This requirement is not found in the Ulmi-Teššub's treaty, although the beginning of that treaty is missing. Other details have been noted to argue for the opposite conclusion, that Kurunta and Ulmi-Teššub are one and the same person.\nNotes\nReferences\n*Beckman, Gary (1996), Hittite Diplomatic Texts, Atlanta.\n*Bryce, Trevor (2005), The Kingdom of the Hittites, Oxford.\n*Bryce, Trevor (2012), The World of the Neo-Hittite Kingdoms: A Political and Military History, Oxford.\n*Freu, Jacques, and Michel Mazoyer (2010), Le déclin et la chute du nouvel empire Hittite, Paris.\n*Jasink, Anna Margherita (2003), \"Il ruolo di Tarḫuntašša da Muwatalli II a Šuppiluliuma II,\" Semitic and Assyriological Studies Presented to Pelio Fronzaroli by Pupils and Colleagues, Wiesbaden: 269-285.\nFurther reading\n*[http://internet.archive.org/stream/TheHittitesAndTheirWorld/TheHittitesAndTheirWorld_djvu.txt \"Collins, Billie Jean. The Hittites and Their World, 2007\" (Full Text)]\nExternal links\n*[https://web.archive.org/web/20131104112704/http://www.hittites.info/history.aspx?text=history%2FLate+Late+Empire.htm#kuruntiya Reign of Kurunta]"
    }
  ]
}