{
  "content": [
    {
      "type": "text",
      "text": "# Kwara state library\n\n| website =\n| library_name = Kwara State Library Board\n| alt = Kwara State Library Board Entrance\n| num_branches = 3\n}}\nKwara State Library is a public library in Kwara State, Nigeria. The library was established soon after the state was created in 1967 when it was found that the library in Kaduna was inadequate. The library was renovated in 2005, establishing the administrative, technical, and acquisition divisions. Its headquarters are in the state capital Ilorin, with divisional libraries in Jebba and Offa. It was established with the aim of providing qualitative and adequate reading resources for the people of the state, irrespective of age, educational background, status in the state, religion and gender.\nHistory\nKaduna state library served the residents of the Northern Region until Kwara state and other states were established in 1967. Kwara state library was created the same year, with area court building as the first location.  Afterwards it was moved to other places until the current library was built by the military governor, colonel Ahmed Abdullahi. Aside the materials from the previous library, about £&nbsp;300 was released to equip the new library. Ibrahim Babangida was the military president that commissioned Kwara state library on 21 November 1990. The library was renovated by the then, governor of the state. Bukola Saraki in 2005. The current government of the state promised spend about N100m to renovate the state library complex and use it as a launchpad for e-learning and temporary headquarters for the state’s innovation hub\nCollections\nThere are books in form of hardcopy and softcopy in the library, the softcopy are accessed from specific website used by the library.\nSee also\n* Kwara state college of education\n* University of Ilorin\n* List of libraries in Nigeria\nReferences\nExternal links\n* [https://ejournal.upi.edu/index.php/edulib/article/view/18587 Kwara State library]"
    }
  ]
}