{
  "content": [
    {
      "type": "text",
      "text": "# Kwara State University__disambig_1\n\n| logo =\n}}\nKwara State University (KWASU), is a public state research university located in Malete, Kwara State, Nigeria. It is the 77th university to be registered by the NUC, and the 95th university to be recognized in Nigeria. The university has about 60 academic departments spread across 11 faculties.\nThe university was established by the administration of Dr. Bukola Saraki in 2009, and envisioned to be more than a typical university in Nigeria. It was designed to be a centre for community service and entrepreneurship. In a country where the fundamental values of volunteerism and community involvement are yet to be fully embraced, the university recognises itself as a part of a community and has the position of a Director for Community Development to mobilize the community, set assessment strategies, and identifying the needs within the community so that lecturers can use their expertise to impact directly on the communities. KWASU held her first convocation on 1 June 2013 and inaugurated the KWASU Alumni Association with Oyinloye Damilare Peter as the pioneer President.\nHistory/Organization\nThe journey towards establishing a state university in Kwara State began on 11 July 2007 when the Kwara State Governor Bukola Saraki inaugurated a planning committee under the former governor of Kwara State, Alhaji Mohammed Shaaba Lafiagi to prepare the ground for the establishment of the Kwara State University. The Bill for the Kwara State University was signed into law on 24 December 2008. The certificate and instrument to operate the university was obtained on 9 February 2009 from the National Universities Commission (NUC). The pioneer Vice-Chancellor, Professor Abdul Rasheed Na'Allah, who until his appointment, was Chair of the African American Studies Department of the Western Illinois University, Macomb, United States of America, assumed office on 28 July 2009. The current Chief of Staff to the President of Nigeria, Muhammadu Buhari who was before his appointment a seasoned scholar and international diplomat, Professor Ibrahim Agboola Gambari is the pioneer chancellor of the school, [https://tau.edu.ng/chancellor.php Johnson Adewunmi] the current chancellor was appointed on Monday, 25 May 2020 by Governor AbdulRahman AbdulRazaq. When fully operational, the university is planned to have its academic activities operate from three campuses located in Malete, Ilesha-Baruba and Osi-Opin.\nLibrary\nIn July 2019, the university in honour of its outgoing Vice-Chancellor, Professor Abdulrasheed Na'Allah commissioned what was adjudged the best Library in the whole of West Africa at that time. The edifice was named after the former president, Muhammadu Buhari. The Muhammadu Buhari Library boasts of modern infrastructure to reflect the world class nature of the university.\nSenate Building\nMuhammed Mustapha Akanbi SAN Senate Building\nIn August 6, 2024, Kwara state university Vice-Chancellor, Professor Shaykh-Luqman Jimoh Named the newly built Senate Building Muhammed Mustapha Akanbi SAN Senate Building, after the name of the late vice chancellor Professor Muhammed Mustapha Akanbi SAN\nCampuses\nThe Kwara State University was designed to be a multi-campus university with three campuses; the main campus in Malete with satellite campuses in Ilesha Baruba and Osi Opin. The Malete Campus is the main campus and houses the Senate Building, Main Library, Faculty of Pure and Applied Sciences, Faculty of Information and Communication Technology, Faculty of Education, Faculty of Basic Medical Sciences, Faculty of Engineering and Technology, Faculty of Management and Social Sciences, Faculty of Law and the Faculty of Arts. The Osi Campus in Ekiti Local Government Area of the state, when completed, is to accommodate the proposed Faculty of Environmental Sciences. The Ilesha Baruba Campus in the Baruteen Local Government Area will permanently host the Faculty of Agriculture, when completed.  However, the satellite campuses are at various stages of development and awaiting completion.\nOsi Campus\nOn 8 January 2025 Governor AbdulRahman AbdulRazaq commissioned the Osi Campus of Kwara State University. It was a gathering of the who-is-who in Kwara State as he formally launched the take-off of the 1st of the 2 multicampus facilities of the Green University for Community Development and Entrepreneurship.\nRankings\nAccording to 2024 Webometrics Rankings, the Kwara State University was ranked as the 25th best university in Nigeria out of over 200. Making it the fifth-best state government-owned university in Nigeria and the best state university in Northern Nigeria. The university has featured consistently over the years as a top-ranked university in the Nigerian university system.\nAcademics\nKwara State University has several academic centres. One such centre is the Centre for Ecology and Environmental Management and Studies CEERMS, which recently received a grant from UNESCO worth $15.3 million to be used over six years to establish the UNESCO Chair for Alternative Energy Programme. This grant is for research in Alternative Energy and is to be handled by Kwara State University Centre for Ecological and Environmental Research Management Studies (CEERMS). Other center of the university are: Centre for Oral Traditions in Africa, Institute for Asian Studies, Institute for Advanced Military Studies, Japanese Language and Culture Institute, Ibrahim Gambari Centre for the Study of United Nations and Regional Organizations, Centre for Pre-degree and Remedial Studies, Centre for Human Rights and the law, Centre for Modernity and Religion, Centre for Art Preservation, Centre for Sponsored Projects, Centre for Innovation in Teaching and Research, KWASU International Institute for Publishing Studies, Centre for Innovative Technology, Center for Innovation and International Studies, Centre for Bio-Computational Applications and the centre for Entrepreneurship.\nThe Centre for Entrepreneurship, the first of its kind in Nigeria, is aimed at preparing its graduates to identify and recognize opportunities through an orientation towards job creation. The university works with students still in the university, to propose and implement a project. As the students graduate, the university partners with the students in implementing the various projects. It also created a start-up fund that is accessible to students for this purpose. Presently, Kwara State University offers students an opportunity to propose their research projects to the school under Undergraduate Research Day, an annual event where students of the institution present research work for funding and global recognition.\nWhile KWASU plans to expand its study abroad locations, it currently has a partnership with Thammasat University in Thailand; Korean Advanced Institute of Technology (KAIST), South Korea; Columbia University, New York, USA; [https://culturalmaya.com/uneb-university-of-the-state-of-bahia/ University of the State of Bahia (UNEB)], Salvador, Brazil; Texas Southern University, Houston, TX, USA; etc.\nIts teaching staff consists of scholars such as Prof. Leo Daniels, MLK Professor of Aeronautics and Astronautics at Massachusetts Institute of Technology, (MIT) as Provost at the College of Engineering and Technology, Prof. Abiola Irele from Harvard University as Provost at the College of Humanities, Management and Social Sciences; and Prof. Winston Wole Soboyejo from Princeton University among others.\nThe National Universities Commission (NUC) has approved Aeronautical and Astronautical Engineering as a course in Kwara State University (KWASU). Being the first institution in Nigeria to offer a (B.Eng.) in Aeronautical and Astronautical engineering. A statement issued by the Vice Chancellor of the university, Professor Abdulrasheed Na'Allah \"I must congratulate all our students and staff in Engineering, especially the department of aeronautical and astronautical engineering for their hard work and patience, that have led to this great success.\"\nReferences\n24. https://kwasu.edu.ng/commissioning-of-osi-campus/\nExternal links\n*[http://www.kwasu.edu.ng Kwara State University Website]"
    }
  ]
}