{
  "content": [
    {
      "type": "text",
      "text": "# Kyler Edwards\n\n| birth_place = Arlington, Texas, U.S.\n| high_school = * Bowie(Arlington, Texas)\n* Findlay Prep(Henderson, Nevada)\n| college = * Texas Tech (2018–2021)\n* Houston (2021–2022)\n| draft_year = 2022\n| career_start = 2022\n| years1 = 2022–2023\n| team1 = Motor City Cruise\n| years2 = 2023–2024\n| team2 = Long Island Nets\n| years3 = 2024\n| team3 = Metros de Santiago\n| years4 = 2024\n| team4 = Calgary Surge\n| years5 = 2024\n| team5 = JDA Dijon\n| years6 = 2024–2025\n| team6 = Elitzur Netanya\n| years7 = 2025-present\n| team7 = Hapoel HaEmek\n| highlights = * Second-team All-AAC (2022)\n}}\nKyler Alexander Edwards (born May 3, 1999) is an American professional basketball player who plays guard for Hapoel HaEmek of the Israeli Basketball Premier League. He played college basketball for the Texas Tech Red Raiders and the Houston Cougars.\nEarly life\nEdwards was born in Arlington, Texas. His mother is Lori Alexander, and his father Kelvin Edwards played wide receiver in the NFL for the New Orleans Saints, Dallas Cowboys, and San Francisco 49ers after playing college football at Liberty University.\nHigh school career\nEdwards began his high school career at Bowie High School in Arlington. He played alongside Cade Cunningham. As a junior, he averaged 22.4 points, 6.0 rebounds and 3.1 assists per game and was named District 4-6A Offensive Player of the Year.\nFor his senior season, Edwards transferred to Findlay Prep in Henderson, Nevada, to play for coach Rodney Haddix. He averaged 16.4 points, 5.2 rebounds, and 4.2 assists per game. Considered a three-star recruit, Edwards committed to playing college basketball for Texas Tech over offers from Butler, Georgia Tech, Houston, Iowa State, Kansas State, LSU, Missouri, Nebraska, Oklahoma State, USC and Virginia Tech.\nCollege career\nAs a freshman for Texas Tech in 2018-19, he averaged 5.5 points, 2.2 rebounds, and 1.1 assists per game, and shot 44.9% from three point range. In the 2019 NCAA Division I Men's Basketball Championship Game, Edwards scored 12 points and had three rebounds in the loss to Virginia.\nOn January 20, 2020, Edwards was named Big 12 player of the week after posting 24 points against Kansas State and 22 points in the Red Raiders' home win over Iowa State. He averaged 11.4 points, 4.0 rebounds, and 3.1 assists per game as a sophomore.\nAs a junior, Edwards averaged 10.1 points, 4.8 rebounds, and 2.8 assists per game, shooting 41.8 percent from three-point range. He was a Big 12 honorable mention selection.\nFollowing the season he opted to transfer to Houston, where he majored  in retailing and consumer sciences, picking the Cougars over LSU and Texas. On January 15, 2022, Edwards scored a career-high 29 points including seven three-pointers in a 66–64 win against Tulsa. In 2021-22 Edwards averaged 13.8 points, 5.9 rebounds (10th in the league), and 3.2 assists per game. He was named to the Second Team All-AAC,  Lefty Driesell Defensive All-America Team, American Athletic Conference All-Tournament Team, NABC All-District 24 First Team,  All-Texas Third Team (Dave Campbell’s Texas Basketball), and All-Texas Defensive Team (Dave Campbell’s Texas Basketball).\nProfessional career\nMotor City Cruise (2022–2023)\nOn November 3, 2022, Edwards was named to the opening night roster for the Motor City Cruise  of the National Basketball Association (NBA) G League.  He averaged 12.0 points, 4.2 rebounds, and 3.1 assists in 25 games.\nOn May 5, 2023, Edwards signed with the Calgary Surge of the Canadian Elite Basketball League. He was released on May 25 without appearing in a game for the club.\nLong Island Nets (2023–2024)\nOn September 25, 2023, Edwards signed with the Brooklyn Nets, but was waived three days later.\nOn October 28, he joined the Long Island Nets of the G League. He averaged 13.3 points, 4.5 rebounds, 3.2 assists, and 1.1 steals per game.\nMetros de Santiago (2024)\nOn May 24, 2024, Edwards signed with the Metros de Santiago of the Liga Nacional de Baloncesto. He averaged 11.8 points, 2.6 rebounds, and 2.8 assists in five games.\nCalgary Surge (2024)\nOn July 9, 2024, Edwards signed with the Calgary Surge of the Canadian Elite Basketball League, but was released on July 28 to join JDA Dijon.\nJDA Dijon (2024)\nOn July 9, 2024, Edwards signed with JDA Dijon of the LNB Élite, with whom he played eight games.\nElitzur Netanya (2024–2025)\nOn December 1, 2024, he signed with Elitzur Netanya of the Israeli Basketball Premier League.\nHapoel Gilboa Galil (2025-present)\nOn October 22, 2025, Edwards received a Hoops Agents Player of the Week Award for Round 2. He was the main contributor in his team's victory with 38 points, 6 rebounds, and 3 assists.  On November 5, 2025, Edwards received a Hoops Agents Player of the Week Award for Round 4. He had the game-high 25 points, 4 rebounds and 2 assists in his team's victory.\nCareer statistics\nCollege\n|-\n| style=\"text-align:left;\"| 2018–19\n| style=\"text-align:left;\"| Texas Tech\n| 38 || 0 || 17.8 || .413 || .449 || .660 || 2.2 || 1.1 || .6 || .2 || 5.5\n|-\n| style=\"text-align:left;\"| 2019–20\n| style=\"text-align:left;\"| Texas Tech\n| 31 || 31 || 33.4 || .404 || .322 || .773 || 4.0 || 3.1 || .9 || .5 || 11.4\n|-\n| style=\"text-align:left;\"| 2020–21\n| style=\"text-align:left;\"| Texas Tech\n| 29 || 26 || 31.2 || .408 || .418 || .789 || 4.8 || 2.8 || 1.1 || .5 || 10.1\n|-\n| style=\"text-align:left;\"| 2021–22\n| style=\"text-align:left;\"| Houston\n| 37 || 37 || 34.1 || .369 || .333 || .697 || 5.9 || 3.2 || 1.0 || .4 || 13.8\n|- class=\"sortbottom\"\n| style=\"text-align:center;\" colspan=\"2\"| Career\n|| 135 || 94 || 28.7 || .393 || .361 || .729 || 4.2 || 2.5 || .9 || .4 || 10.1\nPersonal life\nEdwards is the son of Lori Alexander and Kelvin Edwards. His father played football for the Dallas Cowboys in the 1980s.\nReferences\nExternal links\n*[https://www.instagram.com/kyleredwards/?hl=en Instagram page]\n*[https://uhcougars.com/sports/mens-basketball/roster/kyler-edwards/6493 Houston Cougars bio]\n*[https://texastech.com/sports/mens-basketball/roster/kyler--edwards/10140 Texas Tech Red Raiders bio]"
    }
  ]
}