{
  "content": [
    {
      "type": "text",
      "text": "# Labor Slugger Wars\n\nThe Labor Sluggers War was a 15-year period of gang wars among New York City labor sluggers for control of labor racketeering from 1911 to 1927. This began in 1911 with the first war between \"Dopey\" Benny Fein and Joe \"The Greaser\" Rosenzweig against a coalition of smaller gangs and continuing on and off until the murder of Jacob \"Little Augie\" Orgen by Louis \"Lepke\" Buchalter and Gurrah Shapiro in 1927.\nOrigin\nWith the industrialization of the United States and the emergence of labor unions in the late nineteenth century and into the early 1900s, street gangs began to be hired by companies as strikebreakers and to discourage union activity. Unions themselves would also hire labor sluggers primarily as protection from these strikebreakers, to attack scabs, and to recruit, by force if necessary, new union members. Many of these workers were recently arriving immigrants, particularly Jewish and Italians, in New York's East Side. Gangs made up of immigrants from similar backgrounds often sided with unions of their compatriots, but also were quick to exploit the lucrative opportunities for labor racketeering.\nLabor Slugger War: 1913-1917\nBy 1912 two major gangs, one led by \"Dopey\" Benny Fein and another by Joe \"The Greaser\" Rosenzweig, dominated labor slugging in New York. The various remaining gangs, who had been largely rendered powerless by Fein and Rosenzweig's brutal tactics, united in a loose alliance in an attempt to break the monopoly held by the two gang leaders.\nDeclaring war, a major gunfight was fought on Grand and Forsyth Streets in late-1913 between Fein and Rosenzweig against several gangs, including Billy Lustig, Philip Paul, Little Rhody, Punk Madden (not to be confused with Prohibition gangster Owney Madden), and Moe Jewbach. While there were no casualties on either side, gang leader Paul was later killed by Rosenzweig gunman Benny Snyder.\nLater arrested by police, Snyder confessed to the murder and agreed to testify against Rosenzweig, who also later testified against the gang. Although Fein and Rosenzweig defeated the gangs eventually, Rosenzweig's conviction in 1915, as well as Fein's arrest on a separate murder charge soon after, would see Fein also testify against his organization as an investigation was launched on labor slugging activities. Eleven gangsters and twenty-three union officials were arrested.\nSecond Labor Sluggers War: 1918-1919\nThe subsequent investigations and imprisonment of labor sluggers Benny Fein and Joseph Rosenzweig had effectively ended labor slugging and other labor-related racketeering until the release of \"Kid Dropper\" Nathan Kaplan and Johnny Spanish in 1917. Former rivals, Kaplan and Spanish formed a gang made up mostly of ex-Five Points Gang members that soon dominated labor slugging in New York virtually unchallenged. However infighting between Kaplan and Spanish began again, with Spanish leaving the gang in late 1918. The two factions began fighting for several months until Spanish was killed, supposedly by Kaplan, on July 29, 1919.\nThird Labor Sluggers War of 1923\nWith the death of Johnny Spanish, Kaplan completely controlled labor slugging operations for over four years. In the early 1920s, however, Kaplan began to face competition from rival Jacob Orgen's \"Little Augies\", including Jack Diamond, Louis Buchalter, and Gurrah Shapiro. In early 1923 war broke out between Kaplan and Orgen over striking \"wet wash\" laundry workers. Violent gunfights were fought throughout the city until Kaplan's death by Orgen gunman Louis Kushner while in police custody for a concealed weapons charge in August 1923.\nFourth Labor Slugger War of 1927\nOrgen, now in complete control of labor racketeering, began expanding into bootlegging. However, city officials began investigations into labor racketeering, putting pressure on labor slugging in particular. Advised by Meyer Lansky to instead infiltrate the unions, Orgen refused, continuing labor slugging operations.\nIn October 1927 Orgen was killed by former associates Buchalter and Shapiro, who also wounded Orgen's bodyguard Jack Diamond, in a drive-by shooting. As Buchalter took over as the principal labor racketeer in New York City he began to focus on control of labor unions and extortion, while offering his services to others in organized crime, eventually becoming head of Murder, Inc., as labor racketeering was divided among members into the National Crime Syndicate in the 1930s.\nFurther reading\n*Daugherty, Carroll Roop. Labor Problems in American Industry. New York: Houghton Mifflin Co., 1938.\n*Gottesman, Ronald and Richard Maxwell Brown. Violence in America: An Encyclopedia. New York: Simon and Schuster, 1999.\n*MacDonald, Lois. Labor Problems and the American Scene. New York: Harper & Brothers Publishers, 1938.\nReferences\n*Asbury, Herbert. The Gangs of New York. New York: Alfred A. Knopf, 1928.\n*Sifakis, Carl. The Mafia Encyclopedia. New York: Da Capo Press, 2005.\n*Sifakis, Carl. The Encyclopedia of American Crime. New York: Facts on File Inc., 2001."
    }
  ]
}