{
  "content": [
    {
      "type": "text",
      "text": "# Labrador, Queensland\n\n| alternative_location_map = Australia Gold Coast\n| local_map           = yes\n| zoom                = 12\n| pop                 = 18643\n| pop_year            =\n| pop_footnotes       =\n| elevation           = 5\n| established         =\n| postcode            = 4215\n| area                = 5.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 3.4\n| dir1                = N\n| location1           = Southport\n| dist2               = 7.4\n| dir2                = NNW\n| location2           = Surfers Paradise\n| dist3               = 45.9\n| dir3                = NNW\n| location3           = Tweed Heads\n| dist4               = 72.7\n| dir4                = SSE\n| location4           = Brisbane CBD\n| lga                 = City of Gold Coast\n| stategov            = Bonney\n| fedgov              = Fadden\n| near-nw             = Biggera Waters\n| near-n              = Biggera Waters\n| near-ne             = Main Beach\n| near-w              = Arundel\n| near-e              = Main Beach\n| near-sw             = Parkwood\n| near-s              = Southport\n| near-se             = Southport\n}}\nLabrador is a coastal suburb in the City of Gold Coast, Queensland, Australia. In the , Labrador had a population of 18,643 people.\nGeography\nThe suburb overlooks the Gold Coast Broadwater to the east and Southport on the southern border.\nThere are many Aboriginal cultural sites across the Gold Coast. Labrador was part of traditional country for several families, due to the abundance of shell fish, mudcrabs, oysters and waterfowl in the area. The two local peoples most spoken of by the early settlers were the Yugambeh and Kombumerri Aboriginals.\nThe Gold Coast City Council publishes the Labrador Heritage Walk, and produces a guide booklet which includes twenty one places of historical interest. Three mapped walks have been designed to note the points of interest.\nHistory\nIn April 1878 sugar farmer and investor Robert Muir and investor John Lennon bought  of portion 62 of Crown Land, originally known as Southport North. Portion 62 fronted the Broadwater from Biggera Creek to Broad Street, and the future Billington Street formed part of the western boundary, which continued north until it reached Biggera Creek. The land was surveyed and divided into 19 selections not long after its purchase. When the allotments were sold they were advertised as part of ‘Mr Muir’s Central Southport Estate’. The land overlooked the expanse of the Broadwater and was a good spot for fishing. Land from Portion 62, Parish of Barrow, bound by Broad Street to the south, Loder Street to the west and Saltwater Creek to the north, was offered for sale in August 1883. Allotments 7,8 and 9 of section 4, portion 62 being site of the Labrador Hotel were offered for sale at the same time.\nRobert Muir is believed to have named the area in the late 19th century after the a local fishery in north-eastern Canada, owing to the similarities both held in the recreational fishing of streams and the peninsula shape of the land.\nThe Labrador Hotel was built  by Fredrick Shaw on land originally part of Robert Muirs' selection. The hotel had fifteen bedrooms and three sitting rooms, out houses and stables sufficient for regular use by Queensland coach service Cobb and Co. Passengers arriving by boat from Brisbane were also taken to the hotel by the Cobb and Co. In 1844 the hotel lease was taken by John Langdon who secured a Country Publican's licence with liquor licence. The hotels business declined when another Hotel opened at the northern tip of Labrador, Deepwater point, in 1886. Mr Langdon sold the Labrador Hotel to a Maria Matilda Crooke at auction in April 1888. The hotel was completely destroyed by fire later in 1888.\nLabrador House was built in 1883 facing Marine Parade as a holiday home with views to the broadwater and South Stradbroke Island. It was one of the first large homes, built by Francis Augusta Lousia Thorn. It sat on  of land. In 1923 Jim (James) Cavill owned the home and thought to re-develop it. Instead he took his development ideas to Elston, now Surfers Paradise. In 1937 the land was subdivided into thirteen blocks. The following year the house was converted into three flats. In 1945 the Hasemann family became owners of the house and eleven years later built a convenience store on one side. In 1957 the house was still in the Hasemann family. In 1970 the house was demolished for redevelopment of the site.\nThe area was often portrayed as a mosquito swamp land due to its geography and numerous creeks and steams. This did not prevent the investment and building of the Grand Hotel in 1886 at Deepwater point, overlooking the ocean. It had become a local landmark by 1922, having tennis courts and a ballroom. Extensions during the 1950s included a beer garden and an entertainment room to host International cabarets popular at the time. In 1975 the timber building was completely destroyed by fire. The site saw transformation with a much smaller brick building named The Grand Tavern which was later demolished in 1987 to make way for adjacent land acquisition and development plans. A new hotel was built in a Queenslander style with an apartment block above it. The Grand opened in 2001. Remaining land was sold and apartments were built.\nThe first Labrador State School building was built on four acres of swampy land donated by the Queensland Government on the corner of Billington Street and Brisbane Road (approx ). A local committee arranged for the land to be cleared and made suitable for the 17 original students. The school was officially opened on 24 January 1921. Within two months, 26 students were officially enrolled. Miss May Macpherson was the first and sole Teacher, responsible for teaching all grades required. By 1933 there were 44 students enrolled. Concern over the swampy land that often flooded and increasing traffic on Brisbane Road led to lobbying government for larger premises. A new site at Imperial Parade was acquired in 1948. The old school house building was moved to the Southport State School grounds. Turpin Road and Gordon Street bound the new site at Imperial Parade, where the school is still located. This school building was officially opened on 2 August 1952. There were four classrooms and 193 pupils.Hilltop House was originally a community meeting place before a community hall was planned and partly funded by social events and dances at the centre. It was owned by the Freeman family who named it in the 1930s after moving moved it from the Broad Street area to higher ground and converted to a house. The street was later named Hilltop. The Freeman family had been owners of Labrador House on Marine Parade between 1924 and 1938.\nDemographics\nIn the , Labrador had a population of 15,391 people.\nIn the , Labrador had a population of 16,402 people..\nIn the , Labrador had a population of 18,261 people. Aboriginal and Torres Strait Islander people made up 2.1% of the population. 57.2% of people were born in Australia. The most common countries of birth were New Zealand 8.7%, England 4.3%, China 1.4%, India 1.1% and Philippines 1.1%. 73.3% of people spoke only English at home. Other languages spoken at home included Mandarin 1.8%, Japanese 1.1%, Bosnian 0.8%, Spanish 0.8% and Arabic 0.7%. The most common responses for religion were No Religion 32.4% and Catholic 18.4%.\nIn the , Labrador had a population of 18,643 people.\nEducation\nLabrador State School is a government primary (Prep-6) school for boys and girls at Turpin Road (). In 2017, the school had an enrolment of 940 students with 74 teachers (67 full-time equivalent) and 38 non-teaching staff (26 full-time equivalent). The school includes an Intensive English Centre and a special education program.\nThere is no secondary school in Labrador; the nearest public secondary school is Southport State High School.\nSee also\n* James Cavill involvement in the development of Surfers Paradise and Cavill Avenue\n* Labrador Australian Football Club\nReferences\nFurther reading\n*\nExternal links\n*\n*"
    }
  ]
}