{
  "content": [
    {
      "type": "text",
      "text": "# LabWare__disambig_2\n\n)\n| founder = Vance Kershner\n| defunct =\n| location_city = Wilmington, Delaware\n| location_country = United States\n| locations = 25\n| area_served =\n| key_people =\n| products = |electronic laboratory notebooks|laboratory data analytics}}\n| production =\n| services =\n| revenue =\n| operating_income =\n| net_income =\n| assets =\n| equity =\n| owner =\n| num_employees =\n| parent =\n| divisions =\n| subsid =\n| homepage =\n| footnotes =\n| intl =\n| bodystyle =\n}}\nLabWare, Inc. is an American developer of laboratory informatics software, such as laboratory information management systems, electronic laboratory notebooks and laboratory data analytics. It is a Delaware corporation, with offices in Wilmington, Delaware.\nHistory\nThe company was founded in 1987 by Vance Kershner, who is president and CEO. It has offices in 25 countries, with customers in ninety. The head office is in Wilmington, Delaware, with a training facility at Oberod Estate in Centreville.\nPharmaceutical clients include Wyeth, Teva, AstraZeneca, Pfizer, Merck, and Bristol Myers Squibb; other users are in the food and beverage, forensics, nuclear power, environmental and water testing industries. The software is used to test for water, soil, food and air quality in the United States, Ireland, Australia, and South Africa. In 2021, CTI Clinical Trial and Consulting Services (CTI), a global, full-service contract research organization (CRO) announced their partnership with LabWare.\nKörber, a global technology company, and LabWare announced in 2023 the integration of LabWare LIMS and Körber's manufacturing execution system, PAS-X, for the pharmaceutical and biopharmaceutical industry.\nLabWare and Mettler Toledo announced a plug-and-play software integration to enhance laboratory productivity by seamlessly connecting LabWare LIMS with Mettler Toledo instruments in 2024.\nLabWare uses Visual Smalltalk Enterprise to develop its products and in October 2014, LabWare joined the Pharo Consortium. In January 2024, the Cuis Smalltalk community announced that LabWare supports their efforts.\nAcquisitions\nIn March 2022, LabWare acquired CompassRed, a data analytics firm.\nAwards\nLabWare won the Scientific Computing and Instrumentation’s Readers’ Choice Award in the Laboratory Information Management System (LIMS) category each year between 2000 and 2008. LabWare LIMS won a Frost & Sullivan Product Quality Leadership Award in 2004, and the company won Frost and Sullivan's European Laboratory Information Management Systems (LIMS) Company of the Year Award in 2008. In 2016, LabWare was honored by the Delaware Bioscience Association as their company of the year. MYTECHMAG added LabWare to their list of Top Oil & Gas Tech Solution Providers in 2021.  The Center for Business Analytics at Drexel University LeBow College of Business recognized LabWare as an honoree of the 2023 Drexel LeBow Analytics 50 Awards.\nReferences\nExternal links\n*[http://www.labware.com/en Official Site]"
    }
  ]
}