{
  "content": [
    {
      "type": "text",
      "text": "# Lachie Stewart\n\n| birth_place = Alexandria, Scotland\n| death_date  =\n| death_place = Paisley, Scotland\n| height      = 1.70 m\n| weight      = 58 kg\n| medaltemplates=\n}}\n}}\nJoseph Laughlin Stewart (22 June 1943 – 31 May 2025) was a Scottish distance runner, and an inductee in the Scottish Sports Hall of Fame and competed for Great Britain in the 10,000 metres at the 1972 Summer Olympics.\nBiography\nStewart was born on 22 June 1943 in Alexandria, Vale of Leven, to Jack, a baker, and his wife Greta, who raised him with his sister Elizabeth. He attended Vale of Leven Academy, where his physical education teacher first noticed his running potential. He trained with the local harriers' club of the Vale of Leven, whom he represented in competition until 1968, when he moved to Glasgow and joined the Shettleston Harriers.\nStewart finished third behind Maurice Herriott in the steeplechase event at the 1966 AAA Championships and the following year finished third again but this time in the 6 miles event behind Jürgen Haase and Lajos Mecser at the 1967 AAA Championships but by virtue of being the highest placed British athlete was considered the British 6 miles champion.\nStewart's greatest athletic achievement was competing at the 1970 Commonwealth Games in Edinburgh, where he won the gold medal in the 10,000 metres. He defeated Ron Clarke of Australia in the final.\nStewart finished second behind Dave Bedford in the 10,000 metres event at the 1972 AAA Championships and shortly afterwards he represented Great Britain at the 1972 Olympics Games in Munich, in the 10,000 metres event.\nStewart worked as a dental technician for more than 40 years. He died in Paisley on 31 May 2025, at the age of 81.\nReferences\nExternal links\n*\n*  ([https://web.archive.org/web/20100225061026/http://www.olympics.org.uk/athleterecord.aspx?at=3784 archive])\n*\n*\n*\n* [http://nla.gov.au/nla.cs-pa-HTTP%253A%252F%252FWWW.SCRAN.AC.UK%252F000-000-538-509-C  Lachie Stewart wins gold medal]\n* [http://findarticles.com/p/articles/mi_qn4158/is_19981213/ai_n14186301  Athletics: New age of the Stewarts]\n*\n*"
    }
  ]
}