{
  "content": [
    {
      "type": "text",
      "text": "# Ladánybene archaeological complex__disambig_1\n\nThe archaeological complex in Ladánybene is a series of excavations spanning multiple archaeological periods, located in Bács-Kiskun County, Hungary. The cemetery was discovered in 1909 during plowing, and archaeologists from the local museum began the excavation. The systematic excavation in the early 20th century was started by Elek Kada and Kálmán Szabó.\nBronze Age excavation\nIn the area of Ladánybene, a Bronze Age urn cemetery belonging to the Vatya archaeological culture was excavated, in 1903. The archaeological findings from Ladánybene confirm that following the Copper Age, agriculture became widespread again during the Bronze Age, leading to longer-term settlements.\nSarmatian excavation\nIn the vicinity of Ladánybene, several Sarmatian settlements have been excavated. During field surveys, traces of their settlements were found in Templom-dűlő, Hosszúszék site, Csíkos-tó dűlő, as well as within the village itself near the school. During the 1909 excavation in Ladánybene, several blue enamel fibulae were discovered in Sarmatian graves. In one of the graves, 26 beads were found near the neck, while 234 beads were placed near the foot area.\nSarmatian vessel\nIn Ladánybene, on the land of Józsa Pál, Elek Kada excavated an authenticated Sarmatian grave in 1909. From this grave, a clay vessel, both before and after firing, was unearthed. The vessel was 12.2 cm in height, with a top diameter of 8.2 cm. The vase also features a runic inscription on its side. On the side of the vase, there is an inscription written in archaic Hungarian. The three runic inscriptions on the vase are identical.\nThe original archaic Hungarian text:\"Üriti eszt Berenga.\"English translation:\"This [cup] is emptied by Berenga\"\nAvar excavation\nA late Avar relic found in the courtyard of the old MSZMP party headquarters on Fő Street in 1974, during the building of a sewage settling tank. A well repaired, well-preserved clay jug with three wavy lines (height 12.5 cm, mouth diameter 11.0 cm, base diameter 8.0 cm) was found within the burial. A bronze belt set with pendants with leaf designs was also discovered. Beside the dead was an iron knife that was probably used for ceremonial purposes, but archaeologists can't use it anymore. The belt end piece is rectangular and has dimensions of 2.4 cm by 3.0 cm. The belt's flowery pattern complements the late Avar era (8th–9th century) archeological tradition nicely. An Avar runic-inscribed ring also found by Szabó Kálmán in Ladánybene.\nReferences"
    }
  ]
}