{
  "content": [
    {
      "type": "text",
      "text": "# Lady Emily Kingscote\n\n| death_place  = Mayfair, London, England\n| burial_place =\n| alma_mater   =\n| occupation   = Royal courtier\n| years_active =\n| known_for    =\n| spouse       =\n| children     = 4\n| mother       = Lady Harriet Georgiana Brudenell\n| father       = Richard Curzon-Howe, 1st Earl Howe\n}}\nLady Emily Marie Kingscote (née Curzon-Howe;  14 September 1836 – 9 December 1910) was a British courtier and part of the royal household as a lady-in-waiting to Princess Alexandra of Denmark when she was Princess of Wales and later Queen.\nLife\n]]\nLady Emily was one of ten children born to Richard Curzon-Howe, 1st Earl Howe, and Lady Harriet Georgiana Brudenell, daughter of the 6th Earl of Cardigan.\nLady Emily served as Woman of the Bedchamber to Alexandra of Denmark, who was England's longest-serving Princess of Wales from 1863 to 1901. With the death of Queen Victoria in 1901, the Prince of Wales succeeded to the throne as King Edward VII, and Alexandra became queen consort. Lady Emily was re-appointed a Woman of the bedchamber to the Queen, and served as such until 1907.\nLady Emily married on 5 February 1856 at Congerston, Leicestershire, becoming the second wife of Colonel Sir Nigel Kingscote, whose first wife had died in childbirth. They had two sons and two daughters:\n* Nigel Richard Fitzhardinge Kingscote b. 14 Feb 1857, d. 24 Nov 1921\n* Harriet Maude Isabella Kingscote b. Mar 1860, d. 14 Mar 1906; married Arthur Wilson and was the mother of Henry Maitland Wilson, 1st Baron Wilson.\n* Winifred Ida Kingscote b. 24 Apr 1862, d. 25 Oct 1938; married on 16 July 1879 Lord Rocksavage, later Marquess of Cholmondeley.\n* Albert Edward Leicester Fitzhardinge Kingscote b. 13 May 1865\nLady Emily died on 9 December 1910 at 74. (Her husband had predeceased her on 22 September 1908.) They are both buried in St. John the Baptist Churchyard, Kingscote, Cotswold District, Gloucestershire, England.\nReferences"
    }
  ]
}