{
  "content": [
    {
      "type": "text",
      "text": "# Laila McQueen\n\n| birth_place        = Gloucester, Massachusetts, U.S.\n| death_date         =\n| death_place        =\n| nationality        =\n| other_names        =\n| occupation         =\n| television         = ''RuPaul's Drag Race (season 8)\n| years_active       = 2016–present\n| known_for          =\n}}\nLaila McQueen is the stage name of Tyler Devlin, a drag performer and make-up artist based in Gloucester, Massachusetts. McQueen competed on season 8 of RuPaul's Drag Race in 2016. She has won a Primetime Emmy Award as a make-up artist for the HBO reality series We're Here''.\nEarly life\nDevlin was born in Gloucester, Massachusetts to Cathy and Michael Devlin.  McQueen was artistic in school, which led to bullying from her peers. She started cross dressing in high school at age 15 to ignore the bullying and to showcase her creative outlet before doing drag as a career at 18. She graduated from Gloucester High School in 2011.\nWhen asked about describing her drag, McQueen said \"I'm an idiot, I'm such an idiot. I just like to have fun and for other people to have fun, too. I started doing drag from a negative place to replace those feelings. I've always wanted to be a rock star and this is my way to express that, and I'm an artist above all else. Drag gave me an extension to capture those dreams you didn't think would happen, and I've gotten a lot of things I never thought I'd be able to.\"\nLaila moved to Manchester, New Hampshire in 2011 to attend art school and graduated from New Hampshire Institute of Art in 2015, before she moved back to Gloucester.\nCareer\n, 2017]]\nIn 2016, McQueen was cast for season 8 of ''RuPaul's Drag Race. On the first episode, she placed in the bottom with Naysha Lopez and won a lip sync to \"Applause\" by Lady Gaga. On the second episode, she placed in the bottom again with Dax ExclamationPoint. Both were eliminated after a lip sync to \"I Will Survive\" by Gloria Gaynor. McQueen has said she wanted to impersonate Betsey Johnson, Courtney Love, or Theresa Caputo for the Snatch Game challenge.\nAfter Drag Race, she worked as a make-up artist from RuPaul's Secret Celebrity Drag Race with Shannel and Mayhem Miller. McQueen did make-up for Jordan Connor on the show. Later on, she also did make-up for the cast of We're Here. In 2022, McQueen won the Creative Arts Emmy for Outstanding Makeup for a Variety, Nonfiction or Reality Program for her work on the episode \"Kona, Hawaii\".\nPersonal life\nMcQueen has a sensory-based disorder called misophonia. She has lived in Chicago, Illinois, since 2017, but works in many locations. When she was 19, she was banned from the University of Maine for a performance that involved a Bible being covered in blood.\nAwards and nominations\nEmmy Awards\nThe Emmy Awards are awarded annually by the National Academy of Television Arts and Sciences. McQueen has won 1 award.\n{| class=\"wikitable\" style=\"width:70%;\"\n|-\n! style=\"width:3%;\"| Year\n! style=\"width:23%;\"| Award\n! style=\"width:20%;\"| Nominated work\n! style=\"width:5%;\"|Result\n|-\n|align=\"center\"| 2022\n|rowspan=\"2\"| Outstanding Makeup For A Variety, Nonfiction Or Reality Program\n|rowspan=\"2\"| We're Here''\n|\n|-\n|align=\"center\"| 2024\n|\n|-\n|}\nReferences\nExternal links\n*"
    }
  ]
}