{
  "content": [
    {
      "type": "text",
      "text": "# Lakes Creek, Queensland\n\n| pop                 = 633\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4701\n| area                = 10.8\n| dist1               = 8.1\n| dir1                = ESE\n| location1           = Rockhampton CBD\n| dist2               = 43.5\n| dir2                = SW\n| location2           = Yeppoon\n| dist3               = 646\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Rockhampton Region\n| lga2                = Shire of Livingstone\n| stategov            = Keppel\n| stategov2           = Rockhampton\n| fedgov              = Capricornia\n| near-n              = Mount Archer\n| near-ne             = Nerimbera\n| near-e              = Nerimbera\n| near-se             = Nerimbera\n| near-s              = Port Curtis\n| near-sw             = Port Curtis\n| near-w              = Koongal\n| near-nw             = Frenchville\n}}\nLakes Creek is a suburb split between Rockhampton Region and Shire of Livingstone, Queensland, Australia. In the , Lakes Creek had a population of 633 people.\nGeography\nLakes Creek is predominantly in Rockhampton Region with  compared to Shire of Livingstone with . The suburb is bordered to the south-west by the Fitzroy River. The developed land in the suburb is predominantly near the river approx  above sea level (and is entirely within the Rockhampton Region). The bulk of the land is mountainous and undeveloped rising to peaks such as:\n* Mount Birkbeck () at  above sea level\nMuch of this undeveloped mountainous land in the north-east of the locality is within the Mount Archer National Park.\nThe developed land use is a mix of residential and industrial. Teys Australia operate a large abattoir and feedlot in Lakes Creek. In 2013 it was the largest employer in Rockhampton with a staff of over 1000 people.\nThe Rockhampton–Emu Park Road enters the locality from the west (Koongal) and exits to south-east (Nerimbera).\nHistory\nOn 14 September 1871, residents of the area who were mostly employees of the Central Queensland Meat Preserving Company held a meeting to establish a school in the area at which it was estimated that 25 children would attend the school if established. Although the building was completed in January 1872, Lakes Creek Provisional School did not open until 1 October 1872 but closed in 1874, reopening on 21 May 1877. In July 1894, the Queensland Government decided that the numbers of students in the area warranted a state school. In January 1895, Lakes Creek State School opened on the present site. The growth of the school over the years has resulted in increased land and buildings.\nLakes Creek Baptist Church opened on Tuesday 3 March 1914.\nDemographics\nIn the , Lakes Creek had a population of 552 people.\nIn the , Lakes Creek had a population of 633 people.\nEducation\nLakes Creek State School is a government primary (Prep-6) school for boys and girls at 445 Paterson Street (). In 2016, the school had an enrolment of 127 students with 8 teachers (7 full-time equivalent) and 9 non-teaching staff (5 full-time equivalent). In 2018, the school had an enrolment of 102 students with 8 teachers (7 full-time equivalent) and 12 non-teaching staff (7 full-time equivalent).\nThere are no secondary schools in Lakes Creek. The nearest government secondary school is North Rockhampton State High School in neighbouring Frenchville to the north-west.\nThere are numerous non-government schools in Rockhampton's suburbs.\nAmenities\nRocky Wesleyan Church is at 446 Paterson Drive (). It is part of the Wesleyan Methodist Church.\nReferences"
    }
  ]
}