{
  "content": [
    {
      "type": "text",
      "text": "# Lake Macdonald, Queensland__disambig_1\n\n| local_map           = yes\n| zoom                = 11\n| pop                 = 1352\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4563\n| area                = 26.5\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 16.8\n| dir1                = W\n| location1           = Tewantin\n| dist2               = 45.8\n| dir2                = NNW\n| location2           = Maroochydore\n| dist3               = 132\n| dir3                = N\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga      = Shire of Noosa\n| stategov = Noosa\n| stategov2= Nicklin\n| fedgov   = Wide Bay\n| near-nw  = Pomona\n| near-n   = Ringtail Creek\n| near-ne  = Cooroibah\n| near-w   = Cooroy\n| near-e   = Tinbeerwah\n| near-sw  = Cooroy\n| near-s   = Cooroy Mountain\n| near-se  = Cooroy Mountain\n}}\nLake Macdonald is a rural locality in the Shire of Noosa, Queensland, Australia. In the , Lake Macdonald had a population of 1,352 people.\nGeography\nLocated adjacent to the suburb is the Six Mile Creek Dam, a rock and earth-fill embankment dam across the Six Mile Creek that impounds the reservoir, called Lake Macdonald (). The main purpose of the reservoir is for potable water supply of the Sunshine Coast region and for recreation.\nThe Cooroy-Noosa Road runs through from west to east.\nHistory\nBetween 2008 and 2013 Lake Macdonald (along with the rest of Shire of Noosa) was within the Sunshine Coast Region.\nDemographics\nIn the , Lake Macdonald had a population of 1,129 people.\nIn the , Lake Macdonald had a population of 1,363 people.\nIn the , Lake Macdonald had a population of 1,352 people.\nEducation\nThere are no schools in Lake Macdonald. The nearest government primary school is Cooroy State School in neighbouring Cooroy to the south-east. The nearest government secondary school is Noosa District State High School which has its junior campus (Years 7–9) in neighbouring Pomona to the north-east and its senior campus (Years 10–12) in Cooroy.\nFacilities\nLake Macdonald Water Treatment Plant is on Lake Macdonald Drive ().\nThere are a number of facilities around the lake. There is a boat ramp and pontoon at Mary River Cod Park on Collwood Road for access to the lake (). There is another boat ramp at Lake MacDonald Park on Lake MacDonald Drive (). They are all managed by the South East Queensland Water Corp.\nThere are two jetties into the lake, one at the north of the lake at Lake MacDonald Drive () and one at the south of the lake (). Both are managed by the Noosa Shire Council.\nReferences\nExternal links\n*"
    }
  ]
}