{
  "content": [
    {
      "type": "text",
      "text": "# Lakshmeshwara Jain temples\n\n| location       = Lakshmeshwara, Gadag, Karnataka\n| festivals      = Mahavir Jayanti\n| deity          = Neminatha, Anantanatha\n| established    = 7th century CE\n| creator        = Pulakeshin II\n| governing_body = Shri Shankhabasadi Trust\n| temple_quantity = 3\n| architecture_style = Badami Chalukya architecture\n}}\nThe Lakshmeshwara Jain temples is a group of Jain temples in the town of Lakshmeshwara in the Gadag district of Karnataka.\nHistory\nJainism as it relates to Lakshmeshwara has a long history. Lakshmeshwara is one of the ancient Jain centres formerly known as Hugligare and Puligere. Many Jain temples are mentioned in the inscriptions. Kalyani Chalukyas' most important Jinalayas include Brahma Jinalaya at Lakkundi, Charantimatha at Aihole, and Sankha Jinalya at Lakshmeswar. The temple is believed to be an older structure than Meghuti temple. The Sankha Jinalaya at Lakshmeshwara is dedicated to Neminatha. According to many inscriptions this was an important Jinalaya. Sendraka Durgashakti, a feudatory (vassal) of Pulakeshin&nbsp;II is said to have given gifts to this temple. There is an inscription in Shanka Basadi that mentions the temple received grants from Pulakeshin&nbsp;II in  CE. An inscription by Vinayaditya (dated 686 A.D.) refers to a grant to the Jain Acharya of Devagana and Mulasangha. An epigraph dated 723 CE, by Vijayaditya mentions a grant to Niravadya Pandita who was to house pupil of Sri Pujyapada. Another inscription of Vikramaditya II (dated 734 A. D.) mentions gifts to Shanka Jinalaya. In 734–735 CE, Srivijayadevapanditacharya of dev gana received funds to make repairs to the temple. Kunkuma Mahadevi, sister of Vijayaditya, constructed a large Jain temple during the reign of Kirtivarman&nbsp;II. Lakshmeshwar was established as a Jain center by Chalukya dynasty and was further developed during Rashtrakuta period, having monuments from Rashtrakuta period.\nAdikavi Pampa wrote Ādi purāṇa, seated in this basadi (temple) during 9th&nbsp;century.\nArchitecture\nShanka Basadi\nShanka Basadi is one of the two historical Jain temples at Lakshmeswar. The more famous temple is Sankha Jinalaya, also called Sahasrakuta Jinalaya, in the Basti Bana area. Shankha Jinendra(Neminath) (Shankha is the symbol of Neminath), the 22nd Jain Tirthankara (saviour), is the presiding deity of this Jain Basadi. The temple derives its name from the image of Neminatha in kayotsarga posture standing on a large shankha (conch shell). The Basadi consists of a garbhagriha (inner sanctum), a large ardhamandapa (porch), a larger mahamandapa (hall) and a ranga mandapa (pillared hall or pavilion ). The ranga mandapa has three entrances (south, north, and west). It has a chaturmukha (four-faced) structure carrying three chaturmukha figures. The temple's shikhara is built in  a rekhanagara style. The unique feature of this temple is a monolithic pillar with the carving of 1008 Tirthankaras known as Sahasrakuta Jinabimba. There is a manasthamba (pillar) erected in front of the temple. There are ventilated walls in front of the temple, whereas yakshas and yakshini are in the other walls. There are many splendid carvings of dancers and musicians. Inside the temple, one can find the rare monolithic piece of Sahasra Jinabimbas (SahastraKut Jinalay) and the idols of Dharnendra and Padmavati. Many mutilated Jain idols are on the wall of a well nearby. The Basadi is in ruins and renovated; it represents the interest of the Kalyani Chalukyas in Jain architecture.\nAnanthanatha Basadi\nAnother Jain temple at Lakshmeshwara is the Ananthanatha Basadi, built-in , which is in the middle of the town. The temple is built using soap stone and features a phamsana style Shikhara. The temple is constructed in Trikuta style and is an example of the Chalukya style of architecture. The idol of Anantanatha, one of the 24 Tirthankars, is installed in the garbhagriha of the shrine.\nSee also\n* Western Chalukya\n* Western Chalukya architecture\n* Gadag\n* Annigeri\nReferences\nCitations\nBibliography\nBooks\n*  | publisher=Oxford University Press | location=Oxford | year=2018 |isbn=978-0-19-087886-3 }}\n*  | publisher=Bharathi Puthakalayam | location=Chennai | year=2009 |isbn=978-81-89909-97-0 }}\n*  | edition= From Prehistoric Times to the Hoysala Period | publisher=Notion Press | location=Chennai | year=2016 |isbn=978-93-5206-825-8 }}\n*  | publisher=Abhinav Publications | location=Delhi | year=1995 |isbn=978-81-7017-312-0 }}\n*  | publisher=University of Toronto Press | location=Toronto | year=2012 |isbn=978-1-4426-4511-0 }}\n*  | date=1987 | publisher=Abhinav Publications | location=New Delhi | isbn=81-7017-208-X }}\n*  | edition=3rd | publisher=Macmillan Publishers | location=New Delhi | year=2009 |isbn=978-1403-92863-4 }}\n*  |year=2008 |publisher=Motilal Banarsidass | location=New Delhi |isbn=978-81-208-3323-4 }}\n*  | edition= From Prehistoric Times to the Hoysala Period | publisher=Sura Books | location=Chennai | year=2003 |isbn=978-81-7478-175-8 }}\nWeb\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}