{
  "content": [
    {
      "type": "text",
      "text": "# Lal Kunwar\n\n| house        = Timurid (by marriage)\n| burial_place =\n}}\nImtiaz Mahal (Persian  \"distinguished one of the palace\"), better known by her birth name Lal Kunwar, was a consort of Mughal emperor Jahandar Shah. She was the daughter of Khasusiyat Khan. She was a former dancing girl who exercised supreme influence over the Emperor, encouraged frivolity and pleasure which eventually led to his ignominious downfall.\nShe was the favorite concubine of Jahandar Shah and is more often referred to in histories by her given name Lal Kunwar.\nOrigins and family\nShe is alternately referred to as a singing girl, a dancing girl, a Nautch girl, or Kanchani. She had no prior ties to the court or claims to nobility, but rose to become the favorite companion of Jahandar Shah. Her father, Khasusiyat Khan, supposedly descended from Mian Tansen, a renowned musician during the reign of Akbar.\nPolitical influence\nShe is credited with elevating the status of her relatives, as was the custom of the time for the position of a royal consort. Members of her family were given titles and lands under the  mansabdari system, along with valuable gifts. Three of her brothers were ennobled with the titles Niamat Khan, Namdar Khan, and Khanzad Khan. Other members of the Kalavant class were elevated as well. These actions invited the ire of established courtiers, for they felt their own positions had been sullied by the inclusion of lower class persons.  One such courtier, Wazir Zulfiqar Khan, went as far as arresting her brother, Khushal Khan, on the charge of assaulting a girl, to keep him from being appointed Subedar of Multan.\nComparisons have been made to Nur Jahan, who also exercised considerable influence over the placement of her own relatives. Like Nur Jahan, Lal Kunwar received a massive allowance, as well as fortunes in jewels and goods. She was permitted to use the emperor's standard and drums, and was attended by a procession of five hundred men. Emperor Jahandar Shah consulted her about his stressful and dilemma matters, both public and private, But she did not have much opinion about his affairs and court intrigues. Unlike Nur Jahan, she did not influence the policy of the state and her interests seem confined to devotion to her family and emperor. She was more occupied with comfort and pleasure with relative carelessness in the harem and encouraged Jahandar Shah to keep his mind away from political matters and turn to enjoying life to avoid worries.\nControversial behavior\nThis resentment for her lower class origins and influence over the emperor may have fueled poor public opinion of her, and aided in the circulation of anecdotes regarding not only her character, but also that of Jahandar Shah himself.\nThe emperor and his consort were famously fond of drink, and one night they were so inebriated on a ride home that when they arrived, Lal Kunwar simply exited the cart and went to bed. The drunken emperor was nowhere to be found in the morning, and when the staff awoke Lal Kunwar, she fell into hysterics for she had thought he was by her side that night. Eventually, the emperor was found passed out drunk, still in the driver's cart.\nAnother anecdote suggests that at her hinting, Jahandar Shah once ordered the entire crew as well as their passengers to abandon a boat, purely so she could satisfy her curiosity to watch so many people drown.\nThe emperor's aunt, Zinat-un-Nissa (daughter of Aurangzeb), disapproved of her and would not visit or acknowledge her at court. She is said to have hurled insults at the Begum, and at her request the emperor declined to visit his aunt and ignored her invitations. Lal Kunwar was not fond of Jahandar Shah's two young sons, and consequently their father stopped seeing them and had them imprisoned.\nUnder her companionship, Jahandar Shah gave himself over to indecencies such as bathing and frolicking naked in public, and subjecting himself to the physical and verbal abuses of drunken musicians in his own court. Her influence is credited with the loss of respect for the Mughal court system, and the role of the emperor.\nDespite her almost unanimously poor reputation amongst the Mughal elite, some modern revisionist scholars maintain that she was observed to be sympathetic and charitable toward the lower classes.\nDeath of Jahandar Shah\nNear the end of his reign, when he had lost to Farrukhsiyar at Agra, Lal Kunwar joined the deposed emperor in prison until he was ultimately executed.\nReferences"
    }
  ]
}