{
  "content": [
    {
      "type": "text",
      "text": "# Lamar King\n\n| birth_place = Baltimore, Maryland, U.S.\n| high_school = Essex (MD) Chesapeake\n| college     = Saginaw Valley State\n| position    = Defensive end\n| height_ft   = 6\n| height_in   = 3\n| weight_lbs  = 311\n| draftyear   = 1999\n| draftround  = 1\n| draftpick   = 22\n| pastteams   =\n* Seattle Seahawks ()\n* Tampa Bay Buccaneers ()\n| highlights  =\n| pfr         = KingLa20\n}}\nLamar King (born August 10, 1975) is an American former professional football player who was a defensive end  in the National Football League (NFL).\nHe was selected in the first round of the 1999 NFL draft with one of two first-round selections the Seahawks had. He was the first draft pick under newly hired head coach and general manager Mike Holmgren. He played with the Seahawks for the first five seasons of his NFL career. He did not start a game his rookie season and was only active for 14 games because he dislocated his left shoulder while tearing his labrum. King was able to pile up six sacks on the season. King was a productive NFL player when healthy, but his problem was that he couldn't stay healthy. He spent most of his NFL career injured. King's downfall was that he could not demonstrate that he could stay healthy throughout his career, which caused him to miss many games. He never played an entire 16-game schedule and averaged just 7.6 starts with the Seahawks, primarily because of injuries. In 2002, King tore his calf muscle, which caused him to miss half the season. He started three games in 2003 while only active for nine. King has had a dislocated left shoulder, torn labrum, calf strain, tears, and multiple knee problems, which caused him to get micro-fracture surgery on his left knee. After the 2003 season, he was signed as a free agent by the Tampa Bay Buccaneers and spent the season on IR because he again tore his left calf muscle. He has been out of football since 2004.\nReferences\nExternal links\n*"
    }
  ]
}