{
  "content": [
    {
      "type": "text",
      "text": "# Land Rover Discovery\n\n| production   = 1989–present\n| class= Mid-size luxury SUV\n| layout=Front-engine, four-wheel-drive\n}}\nThe Land Rover Discovery is a series of five or seven-seater family SUVs, produced under the Land Rover marque, from the British manufacturer Land Rover, and later Jaguar Land Rover. The series is currently in its fifth iteration (or generation, according to the manufacturer), the first of which was introduced in 1989, making the Discovery the first new model series since the launch of the 1970 Range Rover – on which it was based – and only the third new product line since the conception of the Land Rover (vehicle and brand) by Rover in 1948. The model is sometimes called influential, as one of the first to market a true off-road capable family car.\nAlthough the Range Rover had originally been designed as an everyday four wheel drive car that could be used as both a utility vehicle and a family car, it had progressively moved upmarket through its life to evolve into a luxury vehicle sold at a much higher price point. The Discovery was intended to fulfill the role the Range Rover originally was intended for; a segment which was now dominated by Japanese rivals such as the Nissan Patrol, Mitsubishi Pajero and Toyota Land Cruiser. Although positioned below the Range Rover in the company's line-up, the vehicle was both longer and higher, offered more room in the back, and optionally also more seats. Space utilization became more sophisticated in later generations, but the series keeps offering seats for seven occupants. Despite originally being sold as an affordable alternative to the Range Rover, the Discovery has also progressively moved upmarket through its successive generations to become a bonafide luxury SUV.\nThe second Discovery (1998) was called the Series II, and although it featured an extended rear overhang, it was otherwise an extensive facelift, which carried over the  wheelbase frame and rigid, live front and rear axles derived from the original Range Rover.\nThe third generation – succeeding the Series II in 2004 - was either called the Discovery 3 or simply LR3 (in North America and the Middle East). This was a new ground up design, the first all-original design for the Discovery. Although it followed the 2002 third generation Range Rover, also switching to fully independent suspension, it still received a separate, but integrated body and frame (IBF) structure. The fourth generation, as of 2009 – like the series II, was again mainly an update of the new generation – marketed as the Discovery 4, or Land Rover LR4 for North American and Middle Eastern markets.\nThe fifth generation of the Discovery, introduced in 2017, no longer sports a numeric suffix. Unlike the previous two generations, it now benefits from a unitized body structure, making it lighter than its predecessor.\nFirst & Second generation Discovery\nDiscovery Series I (1989–1998)\n| length       =\n| width        =\n| height       =\n| designer     = Dave Evans, Mike Sampson, Richard Bartlam, Mike Brogan, Mehmet Ozoturk, Alan Sheppard and George Thompson (1987) Alan Sheppard (1994 Update: 1992)\n}}\nThe Discovery Series I was conspicuously presented during the 1989 Frankfurt Motor Show and introduced to market in the United Kingdom in October that year, after the vehicle had been developed under the internal code-name \"Project Jay\". The new model was strongly based on the more upmarket Range Rover, using the same chassis, suspension and 4WD-system, and a derivative body design – especially the four-door copied much of the more expensive Range Rover's body structure. However, with smaller engines available, just two short side doors at introduction, and other cost-reductions, the new Discovery was priced more affordably, for a larger, more middle-class market segment, intended to counter the Japanese competition at the time.\nThe Discovery was Land Rover's first model that was positioned as a family car, designed to be both fully off-road capable and suitable as a daily driver for any family, even offering more luggage space and optionally more seats than the Range Rover. The Mark I Discovery remains the only model offered as a three-door, and was the only one available with a four-cylinder petrol engine until 2017.\nAt launch, the Discovery was only available as a three-door model; the original 64 press demonstrator examples (carrying Gxxx WAC license numbers - hence being nicknamed \"G-WAC\"s by Land Rover enthusiasts) are increasingly prized. The five-door version followed in 1990. Both were fitted with five seats, with the option to have two jump seats fitted in the boot. Compared to the Range Rover, the Discovery was given a slightly longer rear which was further extended on the series II. In order to make room for optional third row jump seats, the spare wheel had to move to the outside of the car, fitted to a side-swinging rear door, instead of the Range Rover's split tailgate. The roof of the rear section of the car was raised, to create sufficient headroom in the third row. Combined with a safari side window cluster, this gave the Discovery its own distinct look and profile.\nLand Rover employed an external consultancy, Conran Design Group, to design the interior. They were instructed to ignore current car interior design and position the vehicle as a 'lifestyle accessory'. Their interior incorporated a number of original features, although some ideas shown on the original interior mock-ups (constructed inside a Range Rover bodyshell at Conran's workshops) were left on the shelf, such as a custom sunglasses holder built into the centre of the steering wheel. The design was unveiled to critical acclaim and won a British Design Award in 1989.\nThe original transmission was a dual-ratio five-speed manual with drive via a transfer case with a lockable centre differential.\nInitially – and regardless of exterior colour choice – much of the interior in all Discovery's was trimmed in light 'Sonar Blue' upholstery and plastic, with magazine holders above the windscreen, hand-holds for rear passengers incorporated into the head restraints of the front seats, remote radio controls on the instrument cluster, twin removable sunroof panels (including a special zip-up storage bag behind the rear seats) and a Land Rover-branded cloth fabric holdall in the front centre console for oddments storage that could be removed from the vehicle and worn as a handbag using a supplied shoulder strap (relatively few of these bags have survived, making them collectable items). However, most of all of the interior and dashboard components came either from the Range Rover or from other Rover Group cars - for example the switchgear and instrument pod were from the Maestro and Montego; the digital clock from the Metro, the dashboard air vents were from the Rover 800 and the heater/air conditioning control panel was from the Range Rover. Similarly, the Discovery utilised several Range Rover body panels - most notably the door shells and window frames, but with different aluminium skin panels, retaining the distinctive Morris Marina door handles. Other standard parts used were the headlights from the Freight Rover van and tail lights from the Austin Maestro van. The latter would continue to bear the Austin Rover 'chevron' logo on their lenses until production of the first generation Discovery ended in 1998, ten years after Austin Rover ceased to exist.\nIn 1992, the Discovery received several additions and improvements. The interior was offered in a more traditional beige as well as the distinctive (but controversial) light blue, an automatic gearbox was made available on 200Tdi models, new colours were added to the range (and the large 'compass and mountain' side decals worn by early Discoveries to disguise wavy panel fit around the rear three quarter windows were no longer fitted) and the 'SE' pack (incorporating alloy wheels, front driving lights, roof bars and a special range of metallic paints) was introduced as an option. A two-seater, three-door Discovery Commercial version, lacking rear-side windows, was later offered by Land Rover Special Vehicles.\nBefore 1994, the Discovery was available with either the 2.5-litre 200 Tdi engine or the 3.5-litre Rover V8. Early V8 engines used a twin SU carburettor system, switching to Lucas 14CUX fuel injection in 1990. A 2.0-litre petrol engine from the Rover stable was briefly available in a model known as the 2.0-litre Mpi I4. This was intended to attract fleet managers, since UK (and Italian) tax laws benefitted vehicles under 2.0&nbsp;litres. A combination of changes in taxation and lack of power for such a heavy vehicle led to the demise of this engine, despite its fitting to several Discoveries supplied to the British royal family. One of these was notably driven by Prince Philip around Windsor Great Park, in his position as Park Ranger.\nThe transmission was a permanent four-wheel drive system, with a high and low range transfer box, locking centre differential at the transfer box. Similarly to the rest of the Land Rover range, the handbrake acts on the transmission at the back of the transfer box, therefore locking the rear prop shaft or both front and rear prop shafts if the central differential lock is engaged.\nIn Australia, the Series I launched in April 1991, available only as a three-door estate in 3.5-litre V8i guise with  and  and coupled with a five-speed manual gearbox. In October 1991, Land Rover launched the five-door body variant in base V8i and luxury HL versions. Both featured central locking, electric windows, headlight washers and heated door mirrors, with the HL adding alloy wheels, air conditioning, driving lights and an improved audio system. Furthermore, the Tdi engine became available, rated at  and . In early 1993, a four-speed automatic option was added to the Australian range and the HL was discontinued.\n;1994 update\nIn 1994, many changes were made to the Discovery. It reached some markets as the \"Discovery 2\"; the 200Tdi and 3.5 L V8 engines were replaced with the 2.5 L 300Tdi 4-cylinder and 3.9-litre Rover V8 engines. The 300Tdi introduced a Bosch electronic emissions control for certain models and markets. At around this time, a stronger R380 gearbox was fitted to all manual models. The newer models featured larger headlamps and a second set of rear lights in the bumper. The new rear lights had their wiring configuration changed several times to meet real or expected European safety legislation. Some vehicles were left with an arrangement where the vulnerable bumper contains the only working direction-indicator lights; other examples have these lights duplicated in the traditional rear pillar location. The interior was completely revised, dispensing with most of the Conran-designed original. An all new \"soft feel\" dashboard was introduced (a derivative of which was also used in the run-out Range Rover Classic), which replaced most of the components from the Maestro and Montego with the switchgear and instrument pack now coming from the R17-series Rover 800. The new design allowed the fitment of airbags and a proper locking glove box replaced the zip bag of the original interior.\n;North America\nThe 1994 model year marked the first year that the Land Rover Discovery was sold in the United States. Airbags were incorporated into the design of the 1994 model to meet the requirements of US motor vehicle safety regulations, though they were not fitted as standard in all markets. All North American specification (NAS) models were fitted with the 3.9-litre V8 from the Range Rover SE models, and later models saw a change to the 4.0-litre version of the engine.\nTechnically speaking, the 1996-98 US models with 4.0-litre engines had the same displacement as the 3.9-litre engines fitted to the earlier 1994-95 US models; the differences between the engines involved improvements to the block rigidity and pistons, and a change from the Lucas 14CUX engine management to the distributor-less Generic Engine Management System (\"GEMS\"). In earlier 3.9-litre US engines, the fuel injection computer (14CUX) did not control the ignition, which was instead controlled by a traditional system with an ignition coil and distributor made by Lucas. The GEMS system was developed jointly by Lucas and SAGEM; it controlled both spark timing and fuel injection. Unlike the earlier systems fitted to Rover V8 engines, GEMS was made OBD-II compliant. This change was largely driven by the federal requirement (starting in 1996) for vehicles sold in the United States to meet the OBD-II specification.\n;Other versions\nIn Japan, a badge-engineered version of the Discovery I was offered, called the Honda Crossroad. The Rover companies had a cross-holding relationship with Honda UK since the early-1980s. The relationship ended after Rover was taken over by German carmaker BMW in 1994. (Honda revived the nameplate 'Crossroad' in another small sport utility vehicle in 2007).\nIn the Republic of Ireland, local tax laws meant that the first ever example of a Discovery Commercial (van) was launched there in 1991. A revised version was launched in 1993, shortly after the UK market example of late 1992. The Irish examples have formed the basis of the Discovery's success and high sales there, as commercial models are on a much lower tax band.\n;Special editions\n* Country Life (Switzerland, 1991): The Country Life was a five-door V8i Discovery with special interior trim, including a leather-wrapped Nardi steering wheel, wood door and console trim, and identifying decals. It also included a picnic basket. A total of 50 Country Life editions were built.\n* Orienteer (Australia, 1992): The Orienteer models were all three-door, equipped with the V8 engine. They were fitted with five-spoke alloy wheels and driving lights, and \"compass\" side graphics. 75 Orienteer Discoveries were built; because they sold out quickly, this special edition was offered again for the 1993 model year.\n* Freestyle (France, 1993): The Freestyle was available as either a three-door or five-door, and all were painted metallic blue and adorned with Freestyle decals. They were fitted with front and rear anti-roll bars and the \"Freestyle\" five-spoke alloy wheels.\n* County Rider (France, 1993): Intended to appeal to equestrians, the County Rider was equipped with a rear floor liner, rub-strips and wheel-arch protectors, mudflaps, floor mats, an adjustable towbar, and a saddle rack. Available as either a three- or five-door, all were painted green with special decals.\n* Rossignol (Australia, 1993): Named for Skis Rossignol, this was a three-door V8i painted in Caprice blue-green metallic and fitted with a ski rack. It was also fitted with rub strips, wheel arch protectors, and other items that were optional on the base models.\n* Camel Trophy (Japan, 1995): All were painted Sandglow Yellow, and built with roof racks to which were fitted metal Camel Trophy plates. Available was either the V8 with automatic gearbox, or 300Tdi diesel with five-speed manual.\n* Sunseeker (Germany, 1996): Fitted with a chromed front bullbar and painted metallic blue with special decals. All were in the five-door configuration with deep-dish alloy wheels.\n* Goodwood (UK, 1997): Before it was discovered that the name \"Goodwood\" was controlled by the owners of the Goodwood Circuit, Land Rover had already planned production of 500 Goodwood special edition examples. They were painted British Racing Green (renamed to \"Goodwood Green\") with coachlines and special badging, and trimmed with a leather-wrapped steering wheel and walnut interior accents. All were also fitted with dished alloy wheels. Because of the legal objection to the use of the Goodwood name, the single unit built for the London Motor Show was the only one actually badged as such and the remaining 499 were left unnamed.\n* Horse and Hound (UK, 1997): Twenty of these were produced, as a result of a joint promotional effort between Lex Land Rover (of Maidenhead) and Horse & Hound magazine. All were five-door Tdi models with an individual series number and special decals.\n* Argyll (UK, 1997): Available as either a V8i or Tdi and painted either Oxford Blue or Woodcote Green. Re-introduced in 1998 as a three-door variant.\n* XD (US, 1997): 250 built by Land Rover Special Vehicles for the North American market. Based on the SD trim package; automatic transmission, no sunroofs, manual cloth seats, and deleted roof bars. Features included AA Yellow paint, \"XD\" embroidered seat covers, spare tyre cover with \"XD\" logo, low-profile Safety Devices roof rack, brush guard, skid plate, and an optional \"event decal package\" installed by dealers.\n* Aviemore (UK, 1998): Base on the seven-seat GS model, the Aviemore had special badging and was available as either British Racing Green over beige cloth or Rioja Red over grey cloth. It was also equipped with dished alloy wheels and a heated windscreen.\n* Anniversary 50 (UK, 1998): Designed to commemorate the fiftieth anniversary of Land Rover, this edition had special fiftieth anniversary badging and either Atlantis Blue or White Gold paint. The interior was Lightstone leather, and the wheels were the \"Boost\" style alloy design. It was built as a V8 automatic or Tdi (with either the automatic or manual gearbox.)\n* Safari (UK, 1998): Again based on the seven-seat GS, the Safari was painted Epsom Green and was equipped with a rear ladder, roof rails, and additional fog lamps. It was available with either the V8 or Tdi engine, although the manual gearbox was only offered in conjunction with the Tdi. A total of 1,100 were built.\n* Trophy (Netherlands)\n* Camel Trophy (Germany, 1998): Painted Sandglow Yellow with \"Tornado\" style alloy wheels. Equipped with a snorkel air intake, trail lamps, a roof rack, a ladder, and a bullbar.\n* Trophy (Germany, 1998): Not to be confused with the \"Camel Trophy\" edition also available in Germany during the same year, the \"Trophy\" had alloy wheels and air conditioning, twin airbags, a front bar with additional lamps, and a special spare tyre cover. The Trophy was only available with the 300Tdi engine.\n* Esquire (Germany, 1998): Like the Trophy, the Esquire was equipped with twin airbags, air conditioning, and alloy wheels, but it was also standardised with ABS and the interior was trimmed with wood and leather.\n| body_style   = 5-door estate\n| engine=4.0&nbsp;L Rover V8 (petrol)4.6&nbsp;L Rover V8 (petrol)2.5&nbsp;L Td5 I5 (diesel)\n| transmission = 4-speed automatic5-speed manual\n| wheelbase    =\n| length       =\n| height       =\n| width        =\n| weight       =\n| designer     = Mike Sampson (1995, 1996)\n}}\nThe Series II Discovery debuted in autumn 1998, four years after BMW's acquisition of Rover Group from British Aerospace in 1994. Land Rover promoted that the Discovery Series&nbsp;II had been modified with 720 'differences'. The interior and exterior were reworked to be less utilitarian, but it was still clearly an evolution of the Series I. Every body panel had been altered, except the outer skin on the rear doors. The rear body was extended to improve load space, and to now accommodate full-size adults on all seven seats on the SE7 option, as well as make them all forward facing, but at the expense of added rear overhang, which slightly reduced the car's departure angle when off-roading.\nThe Discovery Series II was the last Land Rover SUV to use an evolution of the original 1970 Range Rover underpinnings – with its extended,  long, four-door body still riding on the same, relatively short  wheelbase, ladder-frame chassis, combined with live axles front and rear, into 2004.\nChanges to the diesel-engined models saw the 2,495 cc Td5 (in-line direct-injected straight-five engine) introduced, in line with the updated Defender models. This electronically managed engine was smoother, producing more usable torque at lower revs than its 300Tdi predecessor. The Td5 engine is often mistakenly attributed to BMW but it was derived from the Rover L-series passenger car engine and further developed by Land Rover. The 3,948 cc V8 petrol version from the Discovery 1 was replaced with the Range Rover P38 Thor 4.0-litre, Rover-derived V8. There was no actual increase in capacity over the previous 3.9-litre engine. Although the basic design of the engine was similar, it was actually quite different internally: it used a different crankshaft, had larger bearing journals with cross bolted caps, different connecting rods, and different pistons. The blocks were machined differently, to accept extra sensors for the Gems and Bosch (Thor) injection system and to allow the extra stroke of the 4.6 crankshaft. For the 2003 and 2004 model year, the Discovery II changed to the 4.6-litre V8 (though the only V8 offered in the UK continued to be the 4.0).\nACE (Active Cornering Enhancement, an electronically controlled hydraulic anti-roll bar system) was fitted to some versions, which reduced cornering roll. A pair of accelerometers are used to detect the angle of body lean and to instruct the ACE computer to counteract these movements by applying pressure to the vehicle's torsion bars via actuators which are hydraulically controlled. On the Land Rover Discovery, the ACE system can counteract up 1 G of lateral acceleration in less than a tenth of a second, thus helping the vehicle become more stable and responsive during hard cornering. Self-levelling air springs were fitted to some models and European type-approval for seven-seat vehicles was only given to air-sprung examples.\nThe locking center differential was still fitted although the actual mechanism linkage was not on the early series II production, as Land Rover believed that the traction control system [TCS] and newly developed Hill Descent Control system [HDC] would render it redundant. It was fully reinstated (with the linkage) on the facelift model in 2002, as a cost option (although standard equipment on high spec vehicles). Whilst the traction control system worked very effectively, it did not offer the same level of control and smooth operation as the vehicles fitted with the differential lock. Customer demand saw the diff lock controls fully reinstated on UK and Irish models, and aftermarket kits are offered by several vendors for those vehicles which were produced with the lock, but not the linkage.\nFor 2003 and 2004, the US version was available in three trim levels: S, SE, and HSE. Those with the seven-seat option were known as the S7, SE7, and HSE7.\nThe \"facelift\" models are easily identified by new \"pocketed\" headlamps (which matched the Range Rover and facelifted Freelander models) as well as redesigned turn and brake lamps on the rear of the vehicle. The indicators were moved from the bumper to the high side fixtures. The earlier Series II models could in turn be easily distinguished from the original Discovery by the position of those stop light fixtures above the window-line (earlier models had them below), and by the replacement of paddle door handles with the current sort. The Series II also differs slightly in dimensions.\nA small number of Discovery II Commercial models were produced by Land Rover Special Vehicles, this time based on the five-door bodyshell but with the windows rendered opaque to give van-like appearance and security. Normal vehicles were exported to Republic of Ireland, where the rear-side windows were smashed and rear seats were destroyed in the presence of a Revenue official, to offer a model that avoided the Vehicle Registration Tax (saving approximately 40%). The UK Commercials came with rear self-levelling suspension as standard (an option that has in the meantime been deleted from these vehicles in subsequent ownership due to reliability issues.)\nIn the final production run of the Discovery II, only three models were offered for sale in the UK market, referred to in Land Rover publicity as \"Definitive Editions\". The 'base' Pursuit, which still retained a high level of equipment as standard, and the medium specification Landmark, which offered an all-leather interior, twin sunroofs, Active Cornering Enhancement, six-disc CD player, and a heated windscreen, and the highest spec ES Premium which included satellite navigation, harman/kardon hi-fi, \"Aero\" roof bars, stainless steel side runners, rear parking sensors and a wooden centre console. The final vehicles left the production lines in late-May 2004 to make way for the all new Discovery 3 (LR3) models.\nThird generation (L319) & Fourth generation Discovery\nDiscovery 3 / LR3 (2004–2009)\n| transmission = 6-speed manual6-speed automatic\n| wheelbase =\n| length =\n| width =\n| height = 2005–2006: 2007–2009:\n| weight =\n}}\nOn 2 April 2004, almost four years after Ford's acquisition of Land Rover from BMW, Land Rover introduced the Discovery 3, marketed as the LR3 in North America and the Middle East, and had its international debut at the British International Motorshow in May. It retained the key features of the Discovery, such as the stepped roofline and steeply raked windscreen. The LR3 name was chosen for North American and Middle Eastern markets due to negative quality associations with the Discovery name and (according to Land Rover) a preference in the American market for alpha-numeric model designations – the second generation Freelander was also redesignated for the North American and Middle Eastern market as the LR2.\nLand Rover developed a body construction method for the Discovery 3, marketed as Integrated Body Frame (IBF). The engine bay and passenger compartment are built as a monocoque, then mated to a basic ladder-frame chassis for the gearbox and suspension. Land Rover claims IBF combines the virtues of monocoque and ladder-frame – though it makes for a heavier vehicle than a monocoque construction, compromising performance and agility somewhat but adding strength, toughness and adaptability.\nThe LR3 features full independent suspension (FIS). Like the Range Rover L322, this is an air suspension system, enabling ride-height adjustment by simply pumping up or deflating the air bags. The vehicle can be raised to provide ground clearance when off-road, but lowered at high speeds to improve handling. Land Rover developed 'cross-linked' air suspension. When needed, the suspension mimics the action of a beam axle (as one wheel drops, the other rises). If the chassis of the vehicle contacts the ground when the suspension was at its 'off-road' height, the system senses the reduction in load on the air springs and raises the vehicle an extra inch. In the UK and European markets, a coil-spring independent suspension system was offered on the base model. This model was unique in the range by having only five seats and only being available with the 2.7-litre diesel engine. This model lacked the Terrain Response system.\nThe engines used in the Discovery 3 were all taken from Land Rover's sister company at the time, Jaguar. A Ford/PSA-developed 2.7-litre, ,  V6 diesel engine (the TdV6) was intended to be the biggest seller in Europe. The 2.7 L TDV6 diesel engine was offered across several trim levels including S, SE, HSE, and XS, and was regarded for its torque delivery and efficiency compared with earlier V8 petrol units. In the United Kingdom, a substantial aftermarket industry developed to supply reconditioned and remanufactured TDV6 engines, reflecting ongoing demand for replacement units compatible with the Discovery 3’s various trims and configurations.\nFor the US market and as the high-performance option elsewhere, a 4.4-litre petrol V8 of  was chosen. A  4.0-litre SOHC Ford V6 petrol engine was available in North America and Australia.\nThe gearboxes on the Discovery 3 were also all-new. For the diesel engine, a six-speed manual transmission was standard. As an option, and as standard on the V8 engine, a six-speed automatic transmission was available. Both came with a two-speed transfer box and permanent four-wheel-drive. A computer controlled progressively locking central differential ensured traction was retained in tough conditions. A similar differential was available on the rear axle to aid traction.\nThe Discovery 3 was fitted with multiple electronic traction control systems. Hill Descent Control (HDC) prevented vehicle 'runaways' when descending steep gradients and 4-wheel Electronic Traction Control (4ETC) prevented wheel spin in low-traction conditions. An on-road system, Dynamic Stability Control (DSC), prevented skidding when steering and braking at speed. The vehicle also featured the 'Terrain Response' system. Previously, off-road driving had been a skill that many drivers found daunting. A wide-ranging knowledge of the vehicle was needed to be able to select the correct gear, transfer ratio, various differential systems and master various techniques required for tackling steep hills, deep water and other tough terrain. Terrain Response attempted to take away as many of the difficulties as possible. The driver selected a terrain type (\"Sand\", \"Grass, Gravel & Snow\", \"Mud & Ruts\" and \"Rock Crawl\") on a dial in the cab of the vehicle. The on-board computer systems then select the correct gearbox settings, adjust the suspension height, adjust the differential lock settings and even alter the throttle response of the engine suitable for the terrain. For example, in \"Rock Crawl\", the suspension is raised to its maximum height and set to allow maximum wheel articulation, the differentials are locked, the driver is prompted to switch to Low Range, and the throttle response is altered to provide low-speed control. In \"Sand\" mode, the traction control system is 'primed' to be more sensitive to wheelspin, the differentials are partly locked, and the throttle response is re-mapped to produce high power outputs with short pedal movement. The driver retained some manual control over the off-road systems, being able to select the Transfer Box ratio and the suspension height manually, although use of the Terrain Response system is needed to allow full use of the vehicles' capabilities.\nAs well as new mechanical and electronic systems, the Discovery 3 introduced a new design to the interior and exterior of the vehicle. The Discovery 3 was able to have a fresh, minimalist style. The interior featured a flexible seven-seat layout. Passengers in the rearmost row now entered through the rear side doors, instead of the tailgate as in previous versions. The driver benefitted from a DVD navigation system, including some optional features like Bluetooth telephony in later models. Like the Range Rover, this audio, information & entertainment (\"infotainment\") system in the Discovery 3 adopted an electronics architecture whereby the system's distributed control units pass information and audio amongst one another and throughout the vehicle via optical links based on the MOST (or, Media Oriented Systems Transport) fibre-optic automotive networking standard (informally called the \"MOST-bus\"). The system's navigation functions were unique to Land Rover because, in addition to the typical road map navigation, benefits included an off-road navigation and four-wheel drive information mode. When in four-wheel drive information mode, the screen showed a schematic of the vehicle, displaying the amount of suspension movement, angle the front wheels were steering, the status of the locking differentials and icons showing which mode the Terrain Response was in, and what gear was selected on automatic versions.\nThe vehicle was lauded by the press, with the Terrain Response system, improved on-road dynamics, and interior design receiving particular praise. Jeremy Clarkson of the BBC's Top Gear motoring show drove one to the top of Cnoc an Fhreiceadain, a  mountain near Tongue in northern Scotland, where no vehicle had previously reached. Richard Hammond, presenter of Top Gear, praised it as the \"Best 4X4 of all time\". In Australia, the vehicle was awarded \"4WD of the Year\" by the 4WD Press.\nThe Discovery 3 was planned to be assembled from complete knock-down kits at Ford's Vsevolozhsk plant in Russia, but the project was cancelled in 2007.\nIn 2006, Land Rover used the Discovery 3 in its G4 challenge, alongside the Range Rover Sport. The vehicles used were all in standard mechanical form, except for the fitment of additional Land Rover off-road equipment.\nThe first all-new model placement since the Freelander, the Range Rover Sport is based on the Discovery 3 platform, rather than on the larger Range Rover.\nA 2008–2009 facelifted model of the Discovery 3 offered a Harman/Kardon stereo system upgrade, six-CD changer, clear side indicator lights, and body-colour bumpers.\nA driverless version of the LR3 finished 4th in the DARPA Urban Challenge.\nSafety\nDiscovery 4 / LR4 (2009–2016)\n| length       =\n| width        =  (mirrors folded)\n| height       =  (including roof rails)\n| weight       =\n}}\nThe Discovery 4 (called LR4 in North America and the Middle East) is an updated version of the Discovery 3.\nUsing the same Integrated Body Frame structure, the new Discovery has altered front and rear light units and a restyled front grille and bumper to adopt the same smoother, rounder style as also adopted for the 2010 Range Rover and Range Rover Sport. The Discovery 4 also retains the body-coloured wheel arches and bumpers as the late Discovery 3s (early D3s had black plastic trim). Optional Daylight Running Lamps can be specified whilst LED lights feature prominently in both front and rear lamp units.\nThe majority of the changes are mechanical, with reliability issues addressed, improvements to engines and gearboxes, brake and suspension refinements, but also included major interior upgrades with a more luxurious and contemporary interior with greater luxury and technology levels available. The D4 receives two engines from Jaguar Land Rover's Gen III range. The TDV6 Gen III is a 3.0-litre development of the 2.7-litre engine used in the D3. The new version features advanced twin-sequential turbochargers where a Variable geometry turbocharger is used at low engine speeds, with a second standard turbo is brought online at higher engine speeds. Two versions of the 3.0-litre diesel are offered. Fuel economy was improved over the previous generation diesel while power, torque and diesel NVH were improved significantly. This system provides greater output than the older engine, with  and  whilst reducing  emissions by 10 per cent when first introduced and in 2014 increased to . The Gen III version of the V8 petrol engine (available in markets outside the UK such as North America, Russia, Japan, Australia, and some EU countries) is now a 5-litre unit with Direct Petrol Injection rated at  and . The base 4.0-litre V6 was still available on some Asian markets in 2009–2013.\nAn improved version of the ZF six-speed automatic/sequential gearbox was incorporated and in 2012 (2014 in the US) was further improved including a change to 8 speeds. It includes taller gearing to take advantage of the new engines' greater torque output and an updated lock-up system to further reduce fuel consumption. Other technical changes include the fitting of the more powerful brakes from the Range Rover Sport and thicker anti-roll bars to improve on-road handling. The Stability Control System now includes a programme that detects the onset of understeer and applies the brakes. The Discovery 4 retains its predecessor's fully independent air suspension with cross-linking when off-road and the twin-range transfer gearbox with an electronic infinitely variable locking centre differential. As before, a similar locking rear differential is available. The Terrain Response system remains but with two new features – the 'Sand' mode incorporates a new traction control mode to prevent loss of traction when starting off and stopping in soft sand, and the 'Rock Crawl' mode gains a feature that applies gentle brake pressure at low (less than walking pace) speeds to improve grip and stability on slick rock. The system is also 'retuned' to account for the new engines and gearboxes with their different torque characteristics. Other new electronic systems include Trailer Stability Assist which can adjust the throttle and brakes to prevent a dangerously swaying trailer.\nThe 2.7-litre TDV6 engine was available in Europe on the basic 2.7 GS passenger and 2010 Commercial ranges. Unlike the Discovery 3 base model, this was equipped with air suspension and the Terrain Response system. The automatic gearbox was an option on this model. The 3.0-litre Gen III model (only with automatic gearbox) is also available in the GS trim level.\nThe Discovery 4 also features a redesigned interior (in keeping with the new styles introduced elsewhere in the LR range for 2010). The instrument cluster is updated with redesigned analogue speedometer and tachometer gauges for improved clarity. The analogue temperature/fuel gauges of the previous model and the electronic information display are replaced by a single TFT screen capable of displaying information in a variety of modes and formats. The interior also has a new centre console, which includes redesigned and simplified switches and controls. The Discovery also has a new seat design and a wider range of available interior materials – some previously only seen in Range Rover models. The stated aim of the interior redesign was to lift the vehicle upmarket, with higher-spec models now aimed at the luxury and executive markets.\nThe car gains some electronic systems from the Range Rover lineup, such as the optional 'Surround Camera System' – a series of cameras located in the front bumper, door mirrors, and rear tailgate handle which can display their images on the centre console screen to improve visibility (although the image quality of this system was downgraded by Land Rover around 2014). Other electronic systems are intended to improve efficiency – the engines feature a 'Smart' alternator that only charges the battery when engine load is low, thus helping to reduce fuel consumption when the engine is working harder.\nThe Discovery 4 was unveiled in the summer of 2009 and went on sale in the United Kingdom on 1 September that year. A Commercial van variant was released in the UK at the same time using the 2.7 engine and offered in GS and XS trim levels. In the Republic of Ireland, a Commercial van was offered from 1 January 2010 based on the XE 2.7 manual and HSE 3.0 auto engines.\nAn armoured Discovery with B6 ballistic level of protection was announced in 2010. It offers numerous safety features designed to protect the occupants, including protection from grenades and small arms fire. The vehicle is indistinguishable from the standard LR4.\nFor the 2011 model year, announced in late 2010, the 2.7-litre engine was dropped and two versions of the 3.0-litre engine were made available – one called the TDV6 and one called the SDV6, with the latter offering .\nFor the 2012 model year, diesel models in Europe came with the new eight-speed auto gearbox with steering wheel paddle controls and a circular dial selector that raises upon startup. The SDV6 engine was uprated to  whilst both diesel engines featured reduced emissions for European models. During 2012 the HSE Luxury special edition was announced, featuring enhanced trim levels, and available in Europe and North American markets.\nIn Ireland, 2012 saw the introduction of a new five-seat version of the Discovery 4 classified as an N1 Commercial vehicle, therefore attracting lower VRT rates. There is also a new two-seat Commercial on the same rules. All Irish models came with the lower emissions TDV6 engine. In 2014, an enhanced version of the unique-to-Ireland five-seater commercial utility went on sale which included almost all top-of-the-range features for a lower price. This vehicle is now the top selling Discovery in Ireland due to the fact that it attracts low road tax ( per year) and VAT can be reclaimed.\nFor 2013, models received a style freshening, new badging, new fuel stretching technology, improved audio systems and a new range of driver assistance, comfort and safety features. The 2014 Discovery comes with a standard ZF 8HP transmission, and in some markets can be supplied with a one-speed transfer case (replacing the two speed transfer case). 2014 also marks the first use of a  supercharged six cylinder engine, replacing the previous V6 and V8 offerings.\nIn a January 2011 comparison test by Car and Driver, the Land Rover LR4 came in fourth place out of five cars behind the Audi Q7, BMW X5, and Acura MDX. However, it has always won the Auto Express categories of Best Large SUV and Best Towcar since it was launched in 2009.\nTo celebrate 25 years of the Land Rover Discovery, a special edition of 1800 (?) vehicles was produced in 2014 marked as the XXV, and featured a number of unique details including light grey (Cirrus) XXV-embossed Windsor leather seats, special grill sets, and almost every extra and expansion pack available. A number of these were exported in silver grey and the darker causeway grey for UK markets.\nA major milestone in Land Rover Discovery's history came when the one millionth example built rolled off the Solihull production line in March 2012. This vehicle, along with two similar examples, was driven from Solihull to Beijing, China in a replication of a 1950s expedition. During this expedition, G459 WAC, a pre-production Discovery 1 (which was subsequently converted into an amphibious vehicle) joined in the celebrations when the expedition visited Lake Geneva. The expedition concluded with the actual Millionth Discovery appearing at the Beijing Motor Show. This vehicle subsequently returned to go on permanent exhibition at the British Motor Industry Heritage Trust centre at Gaydon, Warwickshire, England.\n;Engines\n{| class=\"wikitable\"\n|-\n!Model!!Years!!Type/code!!Power, torque at rpm\n|-\n!colspan=4|Petrol engines\n|-\n|4.0 L V6||2009–2013|| V6 12v (SOHC)|| at 4,500 rpm,  at 3,500 rpm\n|-\n|5.0 L V8||2009–2013|| V8 32v (AJ133)|| at 6,500 rpm,  at 3,500 rpm\n|-\n|3.0 L SCV6||2014–2016|| V6 supercharged (AJ126)|| at 6,500 rpm,  at 3,500–5,000 rpm\n|-\n!colspan=4|Diesel engines\n|-\n|2.7 L TDV6||2009–2010|| V6 single turbo (Ford AJD-V6/PSA DT17)|| at 4,000 rpm,  at 1,900 rpm\n|-\n|3.0 L TDV6||2011–2013|| V6 twin turbo (Ford AJD-V6/PSA DT20)|| at 4,000 rpm,  at 2,000 rpm\n|-\n|3.0 L SDV6||2009–2011|| V6 twin turbo (Ford AJD-V6/PSA DT20)|| at 4,000 rpm,  at 2,000 rpm\n|-\n|3.0 L SDV6||2011–2013|| V6 twin turbo (Ford AJD-V6/PSA DT20)|| at 4,000 rpm,  at 2,000 rpm\n|}\n;Transmissions\n{| class=\"wikitable\"\n|-\n!Model!!Years!!Type/code\n|-\n!colspan=4|Petrol engines\n|-\n|4.0 L V6||2009–2013||ZF 6-speed automatic\n|-\n|5.0 L V8||2009–2013||ZF 6HP28 6-speed automatic\n|-\n|3.0 L SCV6||2014–2016||ZF 8-speed automatic\n|-\n!colspan=4|Diesel engines\n|-\n|2.7 L TDV6||2009–2010||ZF S6-53 6-speed manual, ZF 6HP26 6-speed automatic\n|-\n|3.0 L TDV6||2009–2013||ZF 6HP28 automatic\n|-\n|3.0 L SDV6||2012–2016||ZF 8HP70 automatic\n|}\nFifth generation Discovery (L462; 2017–present)\n| body_style   = 5-door SUV\n| platform     = JLR D7u\n| related      =\n| engine       = 3.0L AJ126 supercharged V6 (petrol)3.0L AJD-V6 turbodiesel 2.0L Ingenium AJ200D turbodiesel 2.0L Ingenium AJ200 turbocharged I4 (petrol)3.0 L Ingenium AJ300 turbocharged I6 (petrol) MHEV\n| transmission = 8-speed ZF automatic\n| wheelbase    =\n| length       =\n| width        =  (body)   (with folded mirrors)\n| height       =\n| weight       =  (petrol) (diesel)\n}}\nThe fifth-generation Discovery was unveiled in the grounds of Packington Hall near Meriden, UK on 28 September 2016, the eve of the 2016 Paris Motor Show, and went on sale in the UK in February 2017. Built on a platform shared with the Range Rover and Range Rover Sport, the current Discovery leaves behind many of the design traditions of former generations for a more modern, though less overtly practical, design. This model also marks the return of the Discovery marque in the US market, replacing the LR moniker of the previous generation models. There are five-seat, seven-seat, and commercial van versions in the UK, Ireland and other European markets. In November 2020, a facelift for the model was launched, which debuted as a 2021 model.\nThis is the first Discovery that will be manufactured outside the UK, with production being moved to Slovakia in 2019.\nA Discovery 3.0 TD6 achieved an AIR Index emission rating of \"A\" (A=Best, E=Worst) when independently tested in 2019.\nThe SVX version was debuted at the 2017 Frankfurt Motor Show; the car was to be on sale in 2019 but the project was cancelled.\nDesign\nThe design of the fifth generation Discovery was previewed by the Discovery Vision Concept at the 2014 New York Auto Show. In profile, the exterior design is also very similar to the small Discovery Sport model. In contrast to previous Discovery models, the third-generation has a much more rounded shape, eschewing the traditional angular design. The tail lights have changed from a vertical orientation to horizontal, and the third-row side glass no longer blends into the roof glass. The tailgate is no longer horizontally split and has been replaced with a conventional top hinged tailgate made from composite, but retaining the asymmetrically mounted license plate as a design cue from previous generations of the Discovery. The roof is still stepped over the third row, though it is now largely cosmetic in comparison to the previous models and the roof now has a strong taper to the back. The interior closely follows that from other contemporary Land Rover models, while continuing the 3-row tradition of the Discovery.\nMechanical\nThe new Discovery 5 incorporates several changes over its predecessors. For the first time, the Discovery is based on Land Rover's aluminium architecture, first introduced on the Range Rover (L405). The use of aluminium chassis and body panels gives a weight loss of up to  over its predecessor. This weight loss combined with a new aerodynamic design, a 17 per cent lower , achieves a fuel efficiency improvement over previous Discovery generations. The new Discovery is offered with a combination of V6 petrol and diesel engines. All Fifth generation Discoverys are equipped with a standard 8 speed automatic transmission. An available option package adds a two speed transfer case (low range gearbox) and the option of an actively locking rear differential. Coil springs are now standard on base trim models, while air suspension is still offered as an option.\nTwo permanent 4x4 systems were initially offered.  The standard single-speed transfer case utilizes a Torsen limited-slip center differential.  A basic distribution of 42% front and 58% rear is maintained by the center differential when the vehicle is travelling in a straight line.  Upon loss of traction on one of the axles, the differential has a locking range of between 65/35 and 20/80 front-to-rear.  Traction control takes over to maintain propulsion when the locking range of the differential is exceeded.  A two-speed transfer case is optional.  This transfer case uses a bevel-gear center differential to distribute the torque 50/50 between the front and rear axles. There is also a multi-disc clutch to limit slip between the axles, so the front and rear axles can be locked together. The center differential is lockable using the terrain response menu.\n100% of engine power can be diverted to either axle without the need for intervention by traction control.  A locking rear differential is also available.\nLand Rover also introduced Terrain Response 2 on the Discovery 5. Similarly to the first generation of Terrain Response, Terrain Response 2 constantly monitors wheel slip, wheel speed, angle of approach or departure, and the suspension's compression or rebound to adjust the anti-lock braking system, throttle response, differentials and traction control systems. The driver can select modes for snow, grass, gravel, mud ruts, sand, or rock crawling by turning a dial on the centre console. Terrain Response 2 also introduces a new 'Auto' mode that allows the vehicles computer to select the most appropriate mode on its own.\nThe Discovery 5 is the first Discovery to be built on a unibody chassis, unlike its predecessors which were built body on frame. This allows the vehicle to have higher torsional rigidity with less weight. The latest generation has a higher wading depth (up to ), improved ground clearance and a more comfortable ride while traversing adverse terrain.\nA mid-term update with a refreshed interior and new engine range was launched in 2021. Larger infotainment screens and revisions to the layout of the Commercial variant including more underfloor storage were the main highlights.\nSafety\nDerivatives and specialist versions\n-MSU Carabinieri Discovery 4 equipped for CRC in Kosovo.]]\nSupacat, part of SC Group, offer two vehicles based on a modified Discovery 4 platforms. The Specialist Utility Vehicle 600 (SUV 600) is a production standard Land Rover Discovery 4 that is converted to 6x6 or 6x4 configuration for use in the emergency services and wider utility sectors. The Light Reconnaissance Vehicle 400 (LRV 400) is an open lightweight 4x4 vehicle of the Land Rover Defender class. The LRV 400 was developed based on a combination of market research and customer feedback from the 2011-unveiling of a proof-of-concept closed cab variant. Development of the LRV 400 continues, the latest Mk2 shown publicly for the first time at DSEI 2015 (15–18 September). The most significant design change for the Mk2 is a switch of the automotive platform to the Land Rover Discovery 4 rather than the off-road racer platform previously offered.\nLand Rover offered an armoured version of the Discovery 4, the Sentinel. Protected to Level B6 (defined in accordance with European Standard EN1063 BR6 (glazing) and EN1522 and certified by QinetiQ), according to Jaguar Land Rover, the Discovery 4 Sentinel is almost indistinguishable from the non-armoured Discovery 4. As a factory supplied product, the vehicle comes with a Land Rover three-year or  warranty, the support of Land Rover's worldwide dealer network and a range of additional after sales packages. The UK Government ministers are often seen ferried around in Discovery 4 Sentinels.\nA great number of Land Rover Discovery II and IV were bought and used by Italian Police and Carabinieri. The vehicles were configured with reinforced iron grating on mirrors and windshields, fire-extinguishing automatic system and run-flat tyres, for crowd and riot control operations.\nThe 30th Anniversary\n2019 saw the 30th Anniversary of the launch of the Land Rover Discovery. A special edition model was released. Celebratory events took place across the world. The new JLR plant in Slovakia had the capacity to produce up to 300,000 Discovery units per year. In Ireland, the Discovery range, including the Commercial, was fully aligned with that of the UK.\nWorldwide sales\nAs of 1 January 2017, some 1,200,000 Discovery models had been sold in total since launch in 1989.\nTotal sales are for 2009 and onward, excluding sales prior to that year.\n{| class=\"wikitable\" style=\"float:center; clear:center; margin:0em 0em 1em 1em; text-align:center\"\n|-\n! Year !! Sales\n|-\n| 2009 || 32,331\n|-\n| 2010 || 38,743\n|-\n| 2011 || 44,874\n|-\n| 2012 || 46,252\n|-\n| 2013 || 45,898\n|-\n| 2014 || 45,080\n|-\n| 2015 || 51,008\n|-\n| 2016 || 49,428\n|-\n| Total || 353,614\n|}\nMotorsport\nA Discovery won the Rallye Aicha des Gazelles in 2010.\nReferences\nExternal links\n*\n*  (Special Vehicle Operations)"
    }
  ]
}