{
  "content": [
    {
      "type": "text",
      "text": "# Landrecht (medieval)\n\nThe Landrecht (, \"customary law of the region\", plural: Landrechte) was the law applying within an individual state in the Holy Roman Empire during the Middle Ages and Early Modern times. The state laws that emerged in the territories of the empire from the 12th century onwards had been developed from the older tribal laws of the Saxons, Swabians, Bavarians and Bohemians. Through privileges and laws passed by the territorial princes as well as the jurisprudence of the Landgerichte or state courts, these ancient rights were supplemented and developed. Later Roman law was also accepted and incorporated into the Landrechte. The Landrecht was only applied to the burghers of a town in a secondary way, because they came primarily under municipal law and the autonomous jurisdiction of their communities.\nAmbit\nThe Landrechte contained regulations for all possible branches of law: criminal law, private law, policing, feudal law and constitutional law. However these areas were not necessarily comprehensively covered. Often they operated alongside Saxon Law (Sachsenrecht), Roman law and more recent, imperial, legal regulations.\nOverview\nThe various Landrechte were written down at very different times. The Austrian Landrecht had already been developed by the Babenberg period and was recorded around 1278 by King Rudolph I and in 1298 under Albert I. Based on the customary law (Gewohnheitsrecht) of the state of Styria, it was probably written down in the 2nd half of the 14th century and also applied to Carinthia. The Tyrolean Landrecht emerged in the late 13th century and, in 1328, Archbishop Frederick III consolidated it and made it the law of Salzburg by passing an ordinance (Landesordnung). In the Palatinate, the Landrecht was not recorded until the 16th century. The Bohemian Landrecht developed primarily as a result of the aggregation of judgments by the regional court (Landgericht), which were compiled into the so-called Landtafeln. The Bohemian development also influenced Moravian Landrecht and the law in parts of Silesia.\nThe emergence of Landrechte in the Middle Ages was crucial in the formation of countries, because they were able to constitute themselves as a legal community of free inhabitants. Once they were formed as such, they remained mostly intact as independent legal and political units, even where several states were united under the rule of one dynasty, for example, in the case of the various territories under the Habsburg monarchy.\nWith the promulgation of the German Civil Code, the Landrechte were superseded.\nSee also\n* Law of Germany\n* Lehnrecht\n* Sachsenspiegel\nLiterature\nReferences\nSources\n* Oberbayerisches Landrecht Kaiser Ludwigs des Bayern von 1346. Edition, Übersetzung und Kommentar von Hans Schlosser und Ingo Schwab. Köln u.a. 2000.\n* Codex Maximilianeus Bavaricus civilis oder neu verbessert und ergaenzt chur-bayrisches Land-Recht, welches alle zur bürgerlichen Rechts-Gelehrsamkeit gehoerige Materien in sich begreift : benebst dem am Ende beygefuegten Lehen-Recht. Munich, 1756\n* Churfürstlicher Pfaltz Landrecht. Heydelberg, 1582.\n* Landrecht des Fürstenthumbs Württemberg gemein [...] Tübingen, 1591.\n* Landrecht Der Fürstenthumben der Marggravschafften Baden vn Hachberg, Landgraveschafft Saussenberg, auch Herrschafften Röttlen vnnd Badenweyler, c. : Inn siben Teyl verfasset; Senft, Durlach, 1622 [http://digi.ub.uni-heidelberg.de/diglit/drwBadenLRuLO1622/0001 Online]\nSecondary literature\n* Heinrich Gottfried Wilhelm Daniels: Kurkölnisches Landrecht, hrsg. und bearb. von Christoph Becker. (= Rechtsgeschichtliche Schriften. 19). Cologne etc., 2005\n* Karl August Eckhardt: Das Dithmarscher Landrecht von 1447. Nach d. Ausg. von Andreas Ludwig Jacob Michelsen. (=Germanenrechte. 16). Göttingen u. Marburg/L., 1960\n* Helmut Günter (Hrsg.): Das bayerische Landrecht von 1616. (= Schriftenreihe zur bayerischen Landesgeschichte. 66) Munich, 1969.\n* Ernst Theodor Gaupp: Das schlesische Landrecht oder Eigentlich Landrecht des Fürstentums Breslau von 1356, an sich und in seinem Verhältnis zum Sachsenspiegel. Leipzig, 1828.\n* Maria Dirks: Das Landrecht des Kurfürstentums Trier. Seine Geschichte u. s. Stellung in der Rechtsgeschichte. Saarbrücken, 1965.\n* Wilhelm Hartnack (ed.): Das Wittgensteiner Landrecht nach dem Original-Codex von 1579. Laasphe, 1960\n* Otto Dehler: Das hennebergische Landrecht in den Grundzügen dargestellt. [Diss.] Würzburg, 1939.\n* Stieber, Miloslav: Das österreichische Landrecht und die böhmischen Einwirkungen auf die Reformen König Ottokars in Österreich. Innsbruck, 1905\n* Wieslaw Litewski: Landrecht des Herzogtums Preußen von 1620. 5 Bde. Warsaw, 1982-1987.\n* Ferdinand Bischoff: Steiermärkisches Landrecht des Mittelalters. Graz, 1875.\n* W. Weltin, Das österreichische Landrecht des 13. Jahrhunderts, in: Recht und Schrift im Mittelalter, 1977.\nExternal links\n* [http://www.uni-mannheim.de/mateo/desbillons/land.html Landrecht und Landesordnung der Kurpfalz (1700)]\n* [http://www.aeiou.at/aeiou.encyclop.l/l146666.htm Artikel Landrecht im Österreich-Lexikon AEIOU]"
    }
  ]
}