{
  "content": [
    {
      "type": "text",
      "text": "# Landgericht (medieval)\n\nThe Landgericht (, plural: Landgerichte, ), also called the Landtag in Switzerland, was a regional magistracy or court in the Holy Roman Empire that was responsible for high justice within a territory, such as a county (Grafschaft), on behalf of the territorial lord (e.g. the count).\nBackground and function\nThese judicial bodies emerged during the rule of the Franks (Francia, and subsequently the Kingdom of France and Holy Roman Empire). There were usually several  thingsteads (, \"assembly places\") where they would take place. It was thus a focal point for exercising the Landrecht \"law of the land\". Arnold argues that, by 1200, the institutions of the Landfrieden \"public peace,\" the hereditary county and the Landgericht, if not identical, had \"emerged as a collective legal structure which princes exercised power directly or through delegate judges from amongst their vassals, ministeriales, and officials.\nThere were very different interpretations of the term Landgericht regionally. It corresponded to the term Landrecht, with which it was used synonymously to distinguish it from other legal terms such as Stadtrecht \"town privileges\", Lehnsrecht \"feudal rights,\" and so forth. During its development, the term encompassed both royal juridical courts and those of other lords with relatively small areas of responsibility. There were imperial, royal, princely, ecclesial (monastic) and other Landgerichte.\nIn the Middle Ages, the Landgerichte came to have enormous importance for the organization and exercise of lordship, especially considering that about 90% of the population around the year 1300 was rural. There were various manifestations of the Landgerichte in the Middle Ages. Not until the emergence of a hierarchy of courts in the 16th century and the restructuring as part of citizens’ reforms of the 19th century was it possible to define and describe different types of Landgerichte.\nTerminology\nThe word Landgericht was also used to describe the territory over which the court exercised its responsibility. In addition, it can also describe the building in which a Landgericht is housed. In addition, there were regional terms for such courts; for example, the Gogericht in Saxony; the Freigericht in Westphalia, the Hesse and southwest Germany; and the Zentgericht in Franconia, and parts of the Duchy of Bavaria and Lotharingia.\nOrganisation\nOriginally, all free men who were resident or owned land within the Hundertschaft \"century territory\", Gau \"shire\" or Pflege (a small, historical, administrative district in the Electorate of Saxony) were obliged to participate in the thing. From the mid-13th century, ministeriales were also liable. County courts (Grafengerichte) under the king's ban (Königsbann, royal jurisdiction) met every eighteen weeks and were to be attended by all jurors (Schöffen). Every prince and lord who the king had given juridical authority was to hold a Landgericht every eighteen weeks that had to be attended by all those over the age of 24 living in the associated judicial district (Gerichtssprengel) or who owned a house in the same.\nThe Landgericht was responsible for property (freehold, estates) and inheritance, freedom processes and allegations of crime by the princes, their families and entourage against free men. The court personnel usually comprised the judge (Gerichtsherr), the presiding Landrichters (as representatives of the judge), a group of court 'members' (Beisitzer) and a court usher (Gerichtsbote) as an assistant.\nReferences\nLiterature\n* Arnold, Benjamin (1991). Princes and territories in medieval Germany, Cambridge University Press, Cambridge and New York, .\n* Friedrich Merzbacher, Heiner Lück: Article Landgericht, in: Albrecht Cordes, Heiner Lück, Dieter Werkmüller (eds.): Handwörterbuch zur deutschen Rechtsgeschichte (HRG), 2nd&nbsp;edn., Vol.&nbsp;3, Berlin 2012, cols.&nbsp;518–527.\nExternal links\n* [http://opac.regesta-imperii.de/lang_de/suche.php?qs=&ts=Landgericht*&ps=&tags=&sprache=&objektart=alle&pagesize=20&sortierung=d&ejahr= Veröffentlichungen zu Landgerichten] in Opac of the Regesta Imperii"
    }
  ]
}