{
  "content": [
    {
      "type": "text",
      "text": "# LaRue Howard\n\n| birth_place     = Ridgeland, South Carolina\n| origin          = Winter Garden, Florida\n| instrument      = Vocals, singer-songwriter\n| genre           = Gospel, urban contemporary gospel\n| occupation      = Singer, songwriter\n| years_active    = 2004–present\n| label           = EMI\n| associated_acts =\n| website         =\n}}\nLaRue Howard (born March 13, 1970) is an American gospel musician. Her first album, ''I'm Free, was released by Tribe Records in 2004. The subsequent album, How Great Is Our God, was released in 2008 by EMI. This album was a Billboard magazine breakthrough release upon the Christian Albums and Gospel Albums charts. The song, \"How Great Is Our God\", won her the GMA Dove Award for Contemporary Gospel Recorded Song of the Year at the 40th GMA Dove Awards in 2009.\nEarly life\nLaRue was born on March 13, 1955 , 1970, in Ridgeland, South Carolina, who was in the choir at Morris Brown College.\nMusic career\nHer music recording career commenced in 2004, with the album, I'm Free, and it was released in 2004, yet it did not chart. She released, How Great Is Our God, on March 11, 2008, with EMI. This album was her breakthrough release upon the Billboard'' magazine charts, and it placed on the Christian Albums at No. 26 and Gospel Albums at No. 6. The song, \"How Great Is Our God\", was nominated and won her the GMA Dove Award for Contemporary Gospel Recorded Song of the Year at the 40th GMA Dove Awards in 2009.\nLaRue's music has touched many lives across the globe. Through her music, she was invited to Africa (Ghana) in August 2019 by Mega Praise Projects for their annual event dubbed, My First Praise. Mega Praise Projects is a ministry in Ghana established by M'ViTim (Mensah Vincent Timothy) in 2018. LaRue happens to be the first foreign Artist invited for their first annual music event. The theme of the event was influenced by LaRue's hit song, Great I Am/There's No One Like You.\nPersonal life\nHoward is married to Marvette, and together they reside in Winter Garden, Florida, with their three children, DeAhna, Aaron and Parker. She is the worship leader at River of Life Church in Orlando, Florida.\nDiscography\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|+ List of studio albums, with selected chart positions\n! scope=\"col\" rowspan=\"2\" style=\"width:16em;\" | Title\n! scope=\"col\" rowspan=\"2\" style=\"width:16em;\" | Album details\n! scope=\"col\" colspan=\"2\" | Peak chart positions\n|-\n!style=\"width:3em; font-size:90%\"|USChr\n!style=\"width:3em; font-size:90%\"|USGos\n|-\n!scope=\"row\"|How Great Is Our God\n|\n* Released: March 11, 2008\n*\n* CD, digital download\n| 26\n| 6\n|}\n|The Moment\n* Released: 2011\n*\n* CD, digital download\n|Live at the River\n* Released: 2014\n*\n* CD, digital download\n|Who Is Like our God\n* Released: 2016\n*\n* CD, digital download\n|'''Great I Am/There's No One Like You\n* Released: 2014\n*\n* Single, digital download\n|Defender – Live at the River II'''\n* Released: 2019\n*\n* CD, digital download\nReferences\nExternal links\n* [http://www.laruelive.com/ Official website]"
    }
  ]
}