{
  "content": [
    {
      "type": "text",
      "text": "# Laryea Kingston\n\n| birth_place         = Accra, Greater Accra, Ghana\n| height              = 1.72 m\n| position            = Midfielder\n| currentclub         =\n| clubnumber          =\n| youthyears1         =\n| youthclubs1         =\n| years1              = 1999–2001\n| clubs1              = Great Olympics\n| caps1               =\n| goals1              =\n| years2              = 2000\n| clubs2              = → Al-Ittihad Tripoli (loan)\n| caps2               =\n| goals2              =\n| years3              = 2001–2003\n| clubs3              = Hearts of Oak\n| caps3               =\n| goals3              =\n| years4              = 2003\n| clubs4              = Al-Ettifaq\n| caps4               =\n| goals4              =\n| years5              = 2003\n| clubs5              = Maccabi Ahi Nazareth\n| caps5               = 0\n| goals5              = 0\n| years6              = 2003–2004\n| clubs6              = Hapoel Tel Aviv\n| caps6               = 24\n| goals6              = 2\n| years7              = 2004–2005\n| clubs7              = Krylia Sovetov Samara\n| caps7               = 15\n| goals7              = 0\n| years8              = 2005–2007\n| clubs8              = Terek Grozny\n| caps8               = 11\n| goals8              = 0\n| years9              = 2006\n| clubs9              = → Lokomotiv Moscow (loan)\n| caps9               = 12\n| goals9              = 0\n| years10             = 2007\n| clubs10             = → Heart of Midlothian (loan)\n| caps10              = 10\n| goals10             = 1\n| years11             = 2007–2010\n| clubs11             = Heart of Midlothian\n| caps11              = 41\n| goals11             = 8\n| years12             = 2010\n| clubs12             = Vitesse Arnhem\n| caps12              = 3\n| goals12             = 0\n| years13             = 2011–2012\n| clubs13             = Hapoel Be'er Sheva\n| caps13              = 7\n| goals13             = 0\n| years14             = 2012–2013\n| clubs14             = Hearts of Oak\n| caps14              =\n| goals14             =\n| years15             = 2013–2015\n| clubs15             = Phoenix FC\n| caps15              = 0\n| goals15             = 0\n| nationalyears1      = 2002–2010\n| nationalteam1       = Ghana\n| nationalcaps1       = 41\n| nationalgoals1      = 6\n| medaltemplates      =\n| club-update         =\n| nationalteam-update =\n| totalcaps = 133 | totalgoals = 10}}\nLaryea Kingston (born 7 November 1980) is a Ghanaian former professional footballer. He played either as an attacking midfielder or as a right winger. He was appointed as the Assistant Coach of the Ghana Under 17 National Team on 12 December 2022. He returned to the Under 17 FIFA World Cup as a coach in charge of Uganda on a two-year contract in 2025.\nClub career\nEarly career\nBorn in Accra, Kingston started his career with local side Great Olympics, whom he joined aged 16, before moving to Libyan side Al-Ittihad Tripoli in 2000, on a loan deal. However, after only four months of this arrangement he returned to Accra, unhappy at his treatment in Tripoli, joining one of Ghana's traditional \"Big Two\", Hearts of Oak, in 2001. Two years later he moved to Israel, initially with Maccabi Ahi Nazareth. After two Toto Cup matches, Maccabi decided not to retain him and he was signed by Hapoel Tel Aviv, where he played until 2004.\nMove to Russia\nRussia was Kingston's next destination, where he joined Krylia Sovetov Samara, helping them to third place in the Russian Premier League in his first season. Krylia Sovetov also reached the Cup final that year but were surprisingly defeated 1–0 by Terek Grozny in Moscow. Kingston joined Terek halfway through the 2005 season but was unable to help them avoid a bottom-placed finish and relegation from the top flight into the First Division.\nSeveral of Terek's higher-profile players left as a result of this demotion, and Kingston joined Lokomotiv Moscow on loan for the 2006 season. He was banned for 6 matches in July 2006 for deliberately injuring Dynamo Moscow defender Leandro Fernández.\nHearts\nWhen Terek failed to secure a return to the Premier League, Kingston appeared set for a permanent departure from the Chechen side. Despite an approach from Bolton Wanderers and rumored interest from Newcastle United and Fulham. Kingston joined Hearts on 25 January 2007 on an initial six-month loan deal. Hearts also negotiated the option to sign him permanently for a further three years at the initial contract's end and exercised this option on 6 June 2007, for a reported fee of £500,000. Kingston's time at Heart of Midlothian is generally considered a disappointment as he was so rarely available to play because of injury and international commitments.\nVitesse\nAfter his release from Hearts, Kingston moved to the Netherlands to sign for Vitesse Arnhem, but was released in December 2010 after just six months with the club.\nMove to Israel\nKingston, who had trained with his former club Hearts of Oak after his release from Vitesse, signed a two-year deal with Israeli Premier League side Hapoel Be'er Sheva on 13 July 2011.\nOn 6 August, Kingston scored his first goal for Be'er Sheva in a Free Kick Against Beitar Jerusalem In the Toto Cup in a game which Be'er Sheva won 3–0.\nReturn to Hearts of Oak\nIn the January 2012, Kingston returned to Ghana Premier League for his former club Hearts of Oak, signing a one-and-a-half-year contract.\nMove To America\nIn March 2013 Kingston signed to USL PRO team Phoenix FC.\nAfter leaving Phoenix, Kingston went on trial with Brunei DPMM of the S.League in November 2013.\nInternational career\nWell known as an uncompromising and hard-working player by fellow professionals, Kingston's determined style has occasionally caused him problems, most notably when representing the Ghanaian national side at the 2006 Africa Cup of Nations, when he was sent off during Ghana's 1–0 victory over Senegal following an altercation with Habib Beye. Both players subsequently received unprecedented four-match suspensions, which resultantly ruled Kingston out of contention for the Ghana squad for 2006 World Cup. Kingston returned to prominence for the Black Stars in February 2007 though, scoring in their 4–1 victory over Nigeria in London. He was also excluded from the squad for the 2010 World Cup.\nPersonal life\nKingston's elder brother, Richard Kingson, is also a professional footballer, who played in goal in all four of Ghana's matches at the 2006 World Cup. Richard was also first-choice at the 2010 tournament. He previously played for Blackpool, Wigan Athletic and Birmingham City.\nOn 21 November 1997 his son, Jacob, was born, he is currently a professional footballer who plies his trade with Ghanaian club Accra Great Olympics.\nReferences\nExternal links\n*\n* [https://www.londonhearts.com/scores/newplayers/h01795.html Appearances] at londonhearts.com\n*\n* [https://web.archive.org/web/20070927210832/http://www.stv.tv/content/sport/exclusive/display.html?id=opencms%3A%2Fsport%2Fexclusive%2FKingston_may_not_stay_for_long_260607 Kingston begs Gordon to stay at Hearts] [https://web.archive.org/web/20070624001544/http://www.stv.tv/content/sport/ stv] interview, 26 June 2007.\n}}"
    }
  ]
}