{
  "content": [
    {
      "type": "text",
      "text": "# Last battle of Bismarck\n\nPoland\n| combatant2        =\n| commander1        =  John Tovey   Frederic Wake-Walker   Frederick Dalrymple-Hamilton\n| commander2        =  Günther Lütjens   Ernst Lindemann\n| strength1         = 1 aircraft carrier\n*\n2 battleships\n*\n*\n2 heavy cruisers\n*\n*\n8 destroyers\n| strength2         = 1 battleship\n*\nLuftwaffe\n* I/Kampfgeschwader 28\n| casualties1       = 49 killed  5 wounded   scuttled  Rodney lightly damaged\n| casualties2       = 2,200 killeds complement as Fleet Flagship was 2,220 (2092 + 128 Fleet staff) (Chesneau, p. 224). For Operation Rheinubung she embarked over 100 supernumeraries, including merchant seamen to act as prize crews, cadets in training, and a film unit (Kennedy, p. 33). The number of these supernumeraries, and hence the exact number of casualties, is unknown.  4 floatplanes destroyed}}  110 captured  Bismarck scuttled\n| campaignbox       =\n}}\nThe 'last battle of the German battleship Bismarck' took place in the Atlantic Ocean approximately  west of Brest, France, on 26–27 May 1941 between the  and naval and air elements of the British Royal Navy. Although it was an action between capital ships, it has no generally accepted name. It represented the culmination of Operation Rheinübung where the attempt of the Bismarck and the heavy cruiser  to disrupt the Atlantic convoys to the United Kingdom failed and resulted in the former's scuttling after battle damage rendered the Bismarck unable to fight back. The four British warships continued firing throughout the scuttling process, and most experts agree that the accumulated battle damage would have caused the Bismarck to sink eventually.\nThe last battle consisted of four main phases. The first phase late on 26 May consisted of air attacks by torpedo bombers from the British aircraft carrier , which disabled Bismarcks steering gear, jammed her rudders in a turning position and prevented her escape. The second phase was the shadowing and harassment of Bismarck during the night of 26/27 May by British and Polish destroyers, with no serious damage to any ship. The third phase on the morning of 27 May was an attack by the British battleships  and , supported by the heavy cruisers  and . After about 100 minutes of fighting, Bismarck was sunk by the combined effects of shellfire, torpedo hits and scuttling. On the British side, Rodney was lightly damaged by near-misses and by the blast effects of her own guns. British warships rescued 110 survivors from Bismarck before abandoning the rest because of an apparent U-boat sighting. A U-boat and a German weathership rescued five more survivors. In the final phase, the withdrawing British ships were attacked the next day on 28 May by aircraft of the Luftwaffe, resulting in the loss of the destroyer .\nBackground\nand Royal Navy operations against the battleship Bismarck|left]]\nUnder the command of the Fleet Commander Günther Lütjens, the German battleship Bismarck and the heavy cruiser Prinz Eugen tried to break out into the Atlantic in order to attack convoys. The ships were intercepted by a British force from the Home Fleet. In the resulting Battle of the Denmark Strait on 24 May, Bismarcks fuel tanks were damaged and several machinery compartments, including a boiler room, were flooded. Her captain's intention was to reach the port of Brest for repair.\nDetermined to avenge the sinking of the \"Pride of the Navy\"  in the Battle of the Denmark Strait, the British committed every possible unit to hunting down Bismarck.\n* The old   was detached from convoy duty southeast of Greenland and ordered to set a course to intercept Bismarck if she should attempt to raid the sea lanes off North America.\n* The damaged Prince of Wales and the cruisers Norfolk and Suffolk were still in contact with the German ships after the Battle of the Denmark Strait.\n* The remainder of the Home Fleet, consisting of the battleship King George V, the battlecruiser , the aircraft carrier , four light cruisers and their escorts, had already set sail from Scapa Flow before the loss of the Hood.\n* The battleship Rodney was detached from escort duties West of Ireland and set an intercept course for the Bismarck.\n* Force H had already left Gibraltar with the aircraft carrier Ark Royal, the battlecruiser  and the light cruiser  on 23 May to take over escort duties from other ships, but once it came clear the Bismarck was heading for France, the force set course to intercept Bismarck.\n* The heavy cruiser  was escorting a convoy from Gibraltar to the United Kingdom and was also ordered to intercept.\n* The light cruiser , which was searching for blockade runners in the area West of Cape Finisterre, was also ordered to join the hunt.\nIn the early evening of 24 May, Bismarck briefly turned on her pursuers ( and the heavy cruisers Norfolk and ) to cover the escape of her companion, the heavy cruiser  to continue further into the Atlantic. During the late evening of 24 May, an attack was made by a small group of Swordfish biplane torpedo bombers of 825 Naval Air Squadron under the command of Eugene Esmonde from Victorious. One hit was scored, but caused only superficial damage to Bismarcks armoured belt. Early on 25 May the British forces lost contact with Bismarck, which headed E-S-E towards France while the British searched N-E, presuming Bismarck was returning to Norway.  Later on 25 May the commander of the German force, Admiral Günther Lütjens, apparently unaware that he had lost his pursuers, broke radio silence to send a coded message to Germany.  This faux-pas would prove critical, as the British overheard the communique, and subsequently were able to triangulate the approximate position of Bismarck, logic leading them to deduce that the German battleship had set a course for France, for re-armament and repairs.  Fuel was becoming a major concern to both sides: due to battle damage, the subsequent loss of fuel, and because Bismarck had failed to refuel in Norway, nor by fuel-tanker whilst underway in the North Atlantic.  All things considered, Lütjens chose to maintain an economical speed of 21 knots, to conserve fuel, with the hope of reaching France before the Allied flotilla could detect and intercept them.\nMeanwhile, from the pursuing Home Fleet: Prince of Wales, Repulse, Victorious and the four cruisers had to break off, and Suffolk as well.  Only King George V and Norfolk were able to continue: since the destroyer screen of King George V was (like the Bismarck) also running short on fuel, the Fourth Destroyer Flotilla consisting of the destroyers , ,  and , and the Polish destroyer , under command of Captain Philip Vian, was ordered to detach from convoy WS-8B and to screen King George V.\nAt 10:30 on 26 May Bismarck was detected by a Coastal Command Catalina reconnaissance aircraft from 209 Squadron RAF that had flown over the Atlantic from its base on Lough Erne in Northern Ireland across the Donegal Corridor. It was piloted by the British Flying Officer Dennis Briggs and co-piloted by the US Navy observer Ensign Leonard B. Smith, USNR. Smith was at the controls when he spotted Bismarck (via a trailing oil slick from the ship's damaged fuel tank) and reported her position to the Admiralty. Shortly before at 09:00 Ark Royal had launched scouting planes and half an hour after the Catalina, two Swordfish found Bismarck as well. From then on, the German ship's position was known to the British, although the enemy would have to be slowed significantly if heavy units hoped to engage outside the range of German land-based aircraft. On receiving the message from the Catalina, Capt. Vian decided not to join the pursuing British battleships, but to steer directly for Bismarck. All British hopes were now pinned on Force H and these destroyers.\nThe battle\nFirst phase: Ark Royal disables the Bismarck\nAt 14:50 on 26 May in bad weather conditions, Ark Royal launched 15 Swordfish for an attack on the Bismarck. The aircraft had not been warned that the Sheffield  had been sent forward to shadow the Bismarck, instead they had been told no other ships were in the vicinity.  The Swordfish attacked, in poor visibility, the shadowing cruiser Sheffield, but some of their torpedoes had defective magnetic pistols which caused them to explode on impact with the sea, and the remaining torpedoes could be evaded.  At 19:10 the same aircraft were relaunched for a second sortie with contact pistol torpedoes. At 19:50 Force H ran into , which obtained a perfect shooting position to hit both the Ark Royal and Renown, but the U-boat had expended all her torpedoes on previous operations and could not attack.\nThe aircraft made first contact with the Sheffield at 20:00 which vectored them to the Bismarck. Despite this helping hand and their ASV II radars, they could not find the German ship.  Half an hour later they had to recontact the Sheffield which could finally send them to the Bismarck. The attack started at 20:47 and lasted half an hour. Three aircraft had to recontact the Sheffield for a third time. A first hit midships had little effect, but a second hit astern jammed Bismarcks rudder and steering gear 12° to port. This resulted in her being, initially, able to steam only in a large circle.\nBismarck fired her main and secondary armament against the attacking aircraft, trying to hit the low flying torpedo aircraft with the shell splashes. Once the attack was over, Bismarck fired her main battery at the shadowing Sheffield. The first salvo went a mile astray, but the second salvo straddled the cruiser. Shell splinters fell on Sheffield killing three men and wounding two others. Four more salvoes were fired but no hits were scored. Sheffield quickly retreated under cover of a smoke screen. Sheffield lost contact with the Bismarck in the low visibility but shortly before 22:00 she met Capt. Vian's group of five destroyers and was able to vector them to the Bismarck. The King George V and Rodney had joined around 18:00 and were approaching from the northwest.  Since Vian's destroyers would keep in touch with the Bismarck and harry her all night, he decided to steer south, even southwest and making a circle in order to be able to engage the Bismarck in the morning silhouetted against the east. The heavy cruiser Norfolk and the light cruiser Edinburgh were also approaching separately from the northwest. Edinburgh had to abandon the chase due to fuel shortage but Norfolk took up a position to the north of Bismarck. Another heavy cruiser, Dorsetshire, was approaching from the west and would make contact the next morning. After collecting her aircraft Ark Royal and Force H first kept north of Bismarck, but during the night sailed south and remained in the vicinity.\nRepair efforts by the crew to free the rudder failed. Bismarck attempted to steer by alternating the power of her three propeller shafts, which, in the prevailing force 8 wind and sea state, resulted in the ship being forced to sail towards King George V and Rodney, two British battleships that had been pursuing Bismarck from the west. At 23:40 on 26 May, Admiral Lütjens delivered to Group West, the German command base, the signal \"Ship unmanoeuvrable. We will fight to the last shell. Long live the Führer.\"\nSecond phase: Vian's destroyers harass the Bismarck at night\nOne hour after the Swordfish attack, Maori and Piorun made contact with Bismarck at 22:38. Piorun attacked at once, signalling her identity as a Polish ship, but was not able to launch torpedoes. She approached close enough to engage Bismarck with her guns, but then lost contact and played no more role in the battle. Deteriorating weather made a concentrated attack impossible. Throughout that night, Bismarck was the target of intermittent torpedo attacks by Vian's destroyers. In ten approaches between 22:38 and 06:56 Cossack, Maori, Zulu and Sikh fired sixteen torpedoes but none hit. One of Bismarcks shells sheared off Cossacks antenna and three other shells straddled Zulu, wounding three men. Between 02:30 and 03:00 the destroyers fired starshell at Tovey's request in order to make her position visible for the battleships. The constant harrying tactics of the destroyers helped wear down the morale of the Germans and deepened the fatigue of an already exhausted crew.\nBetween 05:00 and 06:00, Lütjens ordered an Arado 196 float plane launched to the French coast, to secure the ship's war diary, footage of the engagement with Hood, and other important documents.  It was discovered that the float plane catapult had been rendered inoperative due to damage received on the 24th by the Prince of Wales. The fully fuelled aircraft was then pushed overboard to reduce the risk of fire in the upcoming battle. Lütjens then radioed at 07:10 for a U-boat to rendezvous with Bismarck to fetch these documents. U-556 was assigned at once to this task, but the U-boat missed the signalled order because it was submerged.  At any rate, it was subsequently revealed that U-556 had been too low on fuel to have been able to carry out the order. The task was then passed on to  but by then Bismarck had already sunk.\nThird phase: Bismarck is lost\nAs the British units converged on Bismarcks location, Tovey gave his instructions for the final battle. First, he ordered Renown, which had closed to within 17 miles of Bismarck, not to participate in the battle. Renown was similarly armoured as Hood and Tovey did not want to risk a repeat. He instructed the captain of Rodney to close to within  as quickly as possible, and that while he should, in general, conform to King George Vs movements, he was free to manoeuvre independently. The morning of Tuesday 27 May brought a heavy grey sky, a rising sea and a tearing wind from the northwest. Because of this northwesterly gale, Tovey postponed the final attack from sunrise until clear daylight and concluded an attack on Bismarck from windward was undesirable. He decided to approach on a northwesterly bearing before deploying.\nNorfolk was the first ship to sight Bismarck on the morning of 27 May. In poor visibility the cruiser stumbled upon an unidentified ship, flashing recognition signals before realising it was the German battleship. Norfolk quickly turned away and made contact with the British battleships before joining the final battle. At 08:43, lookouts on King George V spotted Bismarck, some  away; Rodney opened fire first at 08:47, followed quickly by King George V. Bismarck was unable to steer due to the torpedo damage to the rudders, and the consequent unpredictable motions made the ship an unstable gun platform and created a difficult gunnery problem. This was further complicated by the gale-force storm. However, Bismarck returned fire at 08:50 with her forward guns, and with her second salvo, she straddled Rodney. This was the closest she came to scoring a hit on any British warship in the final engagement, because at 09:02, a  salvo from Rodney struck the forward superstructure, damaging the bridge and main fire control director and killing most of the senior officers. The salvo also damaged the forward main battery turrets. The aft fire control station took over direction of the aft turrets, but after receiving three salvos was also neutralised. With both fire control stations out of action, Bismarcks shooting became increasingly erratic, allowing the British to close range. Norfolk and Dorsetshire closed and began firing with their  guns. Around 09:10, Norfolk fired four and Rodney fired six torpedoes from a distance of more than 10&nbsp;km, but no hits were observed.\n, the heaviest torpedo in the Royal Navy inventory. One torpedo is being loaded into a tube, whilst another is being lowered into its cradle. Rodney fired a total of 10 torpedoes at Bismarck.]]\nBy around 09:31 all of Bismarcks four main battery turrets were out of action. With the ship no longer able to fight back, First Officer Hans Oels, the senior surviving officer, then issued the order to scuttle the ship&nbsp;– for all damage control measures to cease, for all the watertight doors to be opened, for the engine-room personnel to prepare scuttling charges, and for the crew to abandon ship. Oels moved through the ship, repeating these orders to all he met, until around 10:00 when a shell from King George V penetrated the upper citadel belt and exploded in the ship's aft canteen, killing Oels and about a hundred others. Gerhard Junack, the senior surviving engineering officer, ordered his men to set the demolition charges with a 9-minute fuse. The engine-room intercom system had broken down, so Junack sent a messenger to find Oels and  confirm the order to detonate the charges. The messenger never returned, so Junack primed the charges and ordered the engineering crew to abandon ship.\nOnce all four of Bismarcks main battery turrets were out of action (around 09:31), Rodney closed to around  with impunity to fire her guns at what is effectively point-blank range into Bismarcks superstructure. King George V remained at a greater distance to increase the possibility that her plunging shells would strike Bismarcks decks vertically and penetrate into the ships's interior.  At 10:05 Rodney launched four torpedoes at Bismarck, claiming one hit.\nBy 10:20, the British battleships were running low on fuel. Bismarck was settling by the stern due to progressive uncontrolled flooding and had taken on a 20&nbsp;degree list to port. Tovey ordered Dorsetshire to close and torpedo the crippled Bismarck while King George V and Rodney disengaged. By the time these torpedo attacks took place, Bismarck was already listing so badly that the deck was partly awash. Dorsetshire fired a pair of torpedoes at Bismarcks starboard side, one of which hit. Dorsetshire then moved around to her port side and fired another torpedo, which also hit. Based on subsequent examination of the wreck, the last torpedo appears to have detonated against Bismarcks port side superstructure, which was by then already underwater. Bismarck began capsizing at about 10:35, and by 10:40 had slipped beneath the waves, stern first. During the engagement the two British battleships fired some 700&nbsp;large-caliber shells at Bismarck, and all told, King George V, Rodney, Dorsetshire, and Norfolk collectively fired some 2,800&nbsp;shells, scoring around 400&nbsp;hits.\nFourth phase: the Luftwaffe retaliates\nThe Luftwaffe had not been able to intervene on 26 May due to bad weather. Only some reconnaissance flights were made by some Focke-Wulf Fw 200 Condor of I/Kampfgeschwader 28 (Bomber Wing 28) which could locate Rodney. On 27 and 28 May some attempts were made to attack the British ships.  In the morning of 27 May one Heinkel He 111 missed Ark Royal with a few bombs and only four bombers found the British battleships but failed to score a hit. On 28 May the destroyers  and  were heading for Northern Ireland at economical speed due to their low fuel stocks and were attacked on 28 May in the morning by bombers. At 09:00 Mashona received a hit from a Heinkel He 111, and was abandoned with the loss of 46 crew members. A first attempt to scuttle her with a torpedo from Tartar failed but then she was sunk by gunfire from other destroyers arriving at the scene. The destroyer Maori was also damaged by bombers.\nSurvivors\nalso commemorating Franz Kienast, who died aged 23 in the sinking of the Bismarck]]\nDorsetshire and Maori picked up 85 and 25 survivors respectively. At 11:40 a lookout on the Dorsetshire thought he spotted a periscope and the rescue effort was abandoned whilst hundreds of Bismarcks survivors were still in the water. While the British cruiser Dorsetshire was busy rescuing survivors from the water, Midshipman Joe Brooks}} jumped over the side to help wounded Germans scramble up his ship's side. One German sailor had lost both arms and was hanging onto a rope with his teeth; Brooks tried to save him but failed. Brooks was nearly left behind when the U-boat alarm was given and the Dorsetshire began to pull away while he was still in the water, but he was thrown a line by his shipmates and was pulled aboard. After the battle, the British warships returned to the United Kingdom with 109 Bismarck survivors, as one survivor (Gerhard Lüttich) had died of his wounds the day after his rescue and was buried at sea on 28 May 1941 with full military honours by the crew of HMS Dorsetshire. That evening at 19:30,  picked up three survivors from a dinghy (Herzog, Höntzsch, and Manthey) and the following day at 22:45 the German weather ship  picked up two survivors from a raft (Lorenzen and Maus). The neutral Spanish heavy cruiser  also arrived at the sinking scene but did not find survivors. Out of a crew of over 2,200 men, only 114 survived.\nAftermath\nAfter the sinking, Admiral John Tovey said, \"The Bismarck had put up a most gallant fight against impossible odds worthy of the old days of the Imperial German Navy, and she went down with her colours flying.\"\nThe Board of the Admiralty issued a message of thanks to those involved:\n}}\nUnaware of the fate of the ship, Group West, the German command base, continued to issue signals to Bismarck for some hours, until Reuters reported news from Britain that the ship had been sunk. In Britain, the House of Commons was informed of the sinking early that afternoon.\nThe sinking of the Bismarck, especially the loss of her crew, dealt a massive blow to German morale. To Hitler the sinking was shattering, and validated his fear of open-sea warfare against the British navy. In addition Hitler's confidence in German sea power and Admiral Raeder began to wane. When the British interrogated the survivors of the Bismarck, it was clear that morale aboard the vessel before it sank was very low because Lutjens was driving them to despair in regards to preparing to die.\nOrder of battle\nAxis\n* German battleship Bismarck\nAllied\nIn the final battle\n* The battleships King George V and Rodney.\n* The heavy cruisers Norfolk and Dorsetshire.\nMade contact before final battle\n* 15 Swordfish of the aircraft carrier Ark Royal\n* The light cruiser Sheffield.\n* The destroyers Cossack, Sikh, Zulu, Maori\n* The Polish destroyer Piorun\nSupporting role\n* The aircraft carrier Ark Royal\n* The battlecruiser Renown\n* The destroyers Mashona, Tartar\nSee also\n* Sink the Bismarck!, a 1960 film based on C. S. Forester's book The Last Nine Days of the Bismarck\n* \"Sink the Bismarck\", a 1960 song by Johnny Horton inspired by the film of the same name.\n* Computer Bismarck, a 1980 computer game that simulates the battle.\n* Unsinkable Sam, a ship's cat on board Bismarck who allegedly survived the sinking and was adopted by the Royal Navy; most likely a tall tale.\nNotes\nReferences\nBibliography\n*\n*\n*\n* Cameron J., Dulin R., Garzke W., Jurens W., Smith K.,[https://www.yumpu.com/en/document/view/12480849/the-wreck-of-dkm-bismarck-a-marine-forensics-analysis-1-the- The Wreck of DKM Bismarck A Marine Forensics Analysis]\n*\n*\n* Dewar, A.D. Admiralty report BR 1736: The Chase and Sinking of the \"Bismarck\". Naval Staff History (Second World War) Battle Summary No. 5, March 1950. Reproduced in facsimile in Grove, Eric (ed.), German Capital Ships and Raiders in World War II. Volume I: From \"Graf Spee\" to \"Bismarck\", 1939–1941. Frank Cass Publishers 2002.\n*\n*\n*\n*\n* s Final Battle| journal = Warship International| volume = XXXI| issue = 2| pages = 158–190| issn = 0043-0374}}\n* Jackson, Robert (2002). The Bismarck. London: Weapons of War. .\n* Kennedy, Ludovic. Pursuit: The sinking of the Bismarck. William Collins Sons & Co Ltd 1974.\n* Jerzy Pertek, Wielkie dni małej floty (Great Days of a Small Fleet), Zysk i S-ka, 2011,\n* Michael A. Peszke, ''Poland's Navy 1918-1945, Hippocrene Books, 1999,\n* Müllenheim-Rechberg, Burkard von. Battleship Bismarck: A Survivor's Story. Triad/Granada, 1982. .\n*\n*\n*\n* Schofield, B.B. Loss of the Bismarck''. Ian Allan, 1972.\n*\n* Tovey, Sir John C. \"[http://www.ibiblio.org/hyperwar/UN/UK/LondonGazette/38098.pdf Sinking of the German Battleship Bismarck on 27™ May, 1941.]\"\n*\nExternal links\n* [https://www.youtube.com/watch?v=MCl0G1jGb5k Newsreel footage of Bismarck's last battle]"
    }
  ]
}