{
  "content": [
    {
      "type": "text",
      "text": "# Latin Grammy Award for Album of the Year\n\nThe Latin Grammy Award for Album of the Year is an honor presented annually at the Latin Grammy Awards, a ceremony that recognizes excellence and creates a wider awareness of cultural diversity and contributions of Latin recording artists in the United States and internationally. The award is given to the performers, producers, audio engineers and mastering engineers for vocal or instrumental albums with 51 percent of new recorded songs. Albums of previously released recordings, such as reissues, compilations of old recordings and greatest hits albums packages are not eligible. Due to the increasing musical changes in the industry, from 2012 the category includes 10 nominees, according to a restructuration made by the academy for the four general categories: Song of the Year, Record of the Year, Best New Artist and Album of the Year. Beginning in 2018, songwriters are eligible for the accolade if 33% of the playing time are composed by them.\nJuan Luis Guerra has won the most awards in the category with five wins, including one as a producer. Alejandro Sanz and Juanes follow with three awards, while Calle 13, Luis Miguel and Rosalía with two. Sanz has also received the most nominations with 9 nominations, followed by Juanes and Natalia Lafourcade with 7; and Guerra and Carlos Vives with 6.\nOnly four female artists have won the award. Shakira was the first female recipient, winning the award in 2006 for Fijación Oral, Vol. 1. In 2022, Rosalía became the first female artist to win the award twice. Other female winners are Natalia Lafourcade in 2020 and Karol G in 2023. Lafourcade also leads most nominations among females with 7 and Shakira with 5.\nMost nominated albums were recorded in Spanish language, though Djavan, Chico Buarque, Gilberto Gil, Ivan Lins, Maria Rita, Ivete Sangalo, Tribalistas, Caetano Veloso, Xande de Pilares and Liniker have been nominated for albums recorded in Portuguese language, with Lins winning the award in 2005 for Cantando Histórias.\nMiguel Bosé is the most nominated performer without a win, with five nominations. Rafael Arcaute, Eduardo Cabra, Gustavo Santaolalla and Residente are the most awarded producers, with two wins each, Ronnie Torres has received the most awards as engineer/mixer, with three wins and Adam Ayan is the most awarded mastering engineer with three victories as well.\nSome of the awarded albums have also earned the Grammy Award. No Es lo Mismo and Paraíso Express  by Alejandro Sanz, La Vida... Es Un Ratico and MTV Unplugged Deluxe Edition by Juanes; and Vida by Draco Rosa, for Best Latin Pop Album. La Llave de Mi Corazón by Guerra, Salsa Big Band by Rubén Blades with Roberto Delgado & Orquesta for Best Tropical Latin Album. Fijación Oral, Vol. 1 by Shakira, El Mal Querer and Motomami by Rosalía for Best Latin Rock or Alternative Album. ¡México Por Siempre! by Luis Miguel, for Best Música Mexicana Album (including Tejano); Los de Atrás Vienen Conmigo by Calle 13 for Best Latin Urban Album; and Mañana Será Bonito by Karol G for Best Musica Urbana Album.\nRecipients\n{| class=\"wikitable\" style=\"width:100%\"\n|- bgcolor=\"#bebebe\"\n! width=\"5%\" | Year\n! width=\"17%\" | Winner(s)\n! width=\"15%\" | Work\n! width=\"63%\" | Nominees\n|-\n! scope=\"row\" |2000\n| Luis Miguel, producer; Al Schmitt and Rafa Sardina engineers/mixers\n|\n|\n|-\n! scope=\"row\" |2001\n| Emanuele Ruffinengo, producer; Joel Numa, Maurizio Biancani, Renato Cantele & Roberto Maccagno, engineers/mixers\n|\n|\n|-\n! scope=\"row\" |2002\n| Humberto Gatica & Kenny O'Brien, producers; Chris Brooke, Eric Schilling & Humberto Gatica, engineers/mixers\n|\n|\n|-\n! scope=\"row\" |2003\n| JuanesGustavo Santaolalla & Juanes, producersAníbal Kerpel, Joe Chiccarelli and Thom Russo, engineers/mixers\n|\n|\n|-\n! scope=\"row\" |2004\n| Alejandro Sanz & Lulo Pérez, producersMick Guzauski, Pepo Sherman and Rafa Sardina, engineers/mixers; Bob Ludwig, mastering engineer\n|\n|\n|-\n! scope=\"row\" |2005\n| Moogie Canazio, producerMoogie Canazio, engineer/mixerLuiz Tornaghi & Moogie Canazio, mastering engineers\n|\n|\n|-\n! scope=\"row\" |2006\n| ShakiraGustavo Cerati, Luis F. Ochoa, Lester Méndez & Shakira, producersDave Way, Gustavo Celis, Kevin Killen, Mauricio Guerrero, Rob Jacobs & Serban Ghenea, engineers/mixersVlado Meller, mastering engineer\n|\n|\n|-\n! scope=\"row\" |2007\n| Juan Luis Guerra, producer Allan Leschhorn, Luis Mansilla & Ronnie Torres, engineers/mixers Adam Ayan, mastering engineer\n|\n|\n|-\n! scope=\"row\" |2008\n| JuanesGustavo Santaolalla, producerSteve Churchyard, Jorge da Silva, Aníbal Kerpel and Thom Russo, engineers/mixersTom Baker, mastering engineer\n|\n|\n|-\n! scope=\"row\" |2009\n| Calle 13Rafael Arcaute, Eduardo Cabra, Ivan Gutiérrez, Edgardo Matta and René Pérez, producersRafa Arcaute, Rodrigo Barria, Cesar Dellano, Ivan Gutierrez, Guillermo Mandrafina, Carlos Velazquez, Ramón Martínez and Omar Vivoni, engineers/mixersJames Cruz, mastering engineer\n|\n|\n|-\n! scope=\"row\" |2010\n| Juan Luis Guerra, producerDavid Channing, Rafael Lazzaro, Allan Leschhorn, Luis Mansilla, Janina Rosado, Allen Sides & Ronnie Torres, engineers/mixersAdam Ayan, mastering engineer\n|\n|\n|-\n! scope=\"row\" |2011\n| Calle 13Edgar Abraham & Rafael Arcaute, producersFelipe Álvarez, Arcaute, John Blais, Eduardo Cabra, David Cárdenas, Ivan Gutierrez, Lee Levin, José Martínez, Ramón Martinez, Edgardo Matta, Daniel Ovie, Carlos Velazquez, G. Castañón, R. Vásquez, Charles Wakeman and Dan Warner, engineers/mixersJames Cruz, mastering engineer\n|\n|\n|-\n! scope=\"row\" |2012\n| Juanes Juan Luis Guerra, producerGustavo Borner, engineer/mixerGustavo Borner, mastering engineer\n| MTV Unplugged\n|\n|-\n! scope=\"row\" |2013\n|  George Noriega & Draco Rosa, producersDave Clauss, Héctor Espinosa, Benny Faccone, Seth Atkins Horan, Nelson \"Gazu\" Jaime, Allan Leschhorn, Fernando Quintana, Fabián Serrano & Sadaharu Yagi, album recording engineersBenny Faccone, mixerBob Ludwig, mastering engineer\n| Vida\n|\n|-\n! scope=\"row\" |2014\n|  Paco de Lucía, producerPaco de Lucía, album recording engineerBori Alarcón, mixer Bori Alarcón, mastering engineer\n| Canción Andaluza\n|\n|-\n! scope=\"row\" |2015\n|  4.40 Juan Luis Guerra & Janina Rosado, producersEdgar Barrera, Rafael Lazzaro & Allan Leschhorn, album recording engineersRonnie Torres, album mixersAdam Ayan, album mastering engineer\n| Todo Tiene Su Hora\n|\n|-\n! scope=\"row\" |2016\n| Juan GabrielGustavo Farías, album producerPete Fuchs, Dan Moore & Erwin Ríos, album recording engineers Diego Farías, Gustavo Farías, Peter Fuchs, Dan Moore, Dave Rideau and Jean Smitt, album mixers\n| Los Dúo 2\n|\n|-\n! scope=\"row\" |2017\n|  with Roberto Delgado & OrquestaRoberto Delgado, producerPablo Governatori & Roberto Delgado, album recording engineersIgnacio Molino, Pablo Governatori & Roberto Delgado, album mixers Daniel Ovie, mastering engineer\n| Salsa Big Band\n|\n|-\n! scope=\"row\" |2018\n| Luis Miguel & David Reitzas, album producersDavid Reitzas & Jess Sutcliffe, album recording engineersDavid Reitzas, album mixerJosé Alfredo Jiménez, songwriterEric Boulanger & David Reitzas, album mastering engineers\n| ¡México Por Siempre!\n|\n|-\n! scope=\"row\" |2019\n| RosalíaEl Guincho and Rosalía, album producersEl Guincho, album recording engineer Jaycen Joshua, album mixerAntón Álvarez Alfaro, El Guincho and Rosalía, songwritersChris Athens, album mastering engineer\n| El Mal Querer\n|\n|-\n!2020\n| Natalia LafourcadeKiko Campos, album producerJosé Luis Fernández & Rubén López Arista, album recording engineersRubén López Arista, album mixerNatalia Lafourcade, songwriterMichael Fuller, album mastering engineer\n| Un Canto por México, Vol. 1\n|\n|-\n!2021\n| Rubén Blades and Roberto Delgado & OrquestaRoberto Delgado, album producerOscar Marín, album recording engineerDelgado and Oscar Marín, album mixersBlades, songwriterDaniel Ovie, album mastering engineer\n| SALSWING!\n|\n|-\n! scope=\"row\" |2022\n| Rosalía James Blake, Frank Dukes, El Guincho, Noah Goldstein, Dylan Patrice, Sie7e, Jean Rodriguez, Sky Rompiendo, Rosalía, Tainy, Michael Uzowuru, The Weeknd & Pharrell Williams, album producersShin Kamiyama, Michael Larson, Sean Matsukawa, Tyler Murphy & David Rodríguez, album recording engineersManny Marroquin, album mixerRauw Alejandro, William Bevan, Daniel Gomez Carrero, LaShawn Daniels, Frank Dukes, El Guincho, Kamaal Fareed, Adam Feeney, Larry Gold, Noah Goldstein, Kaan Güneşberk, Teo Halm, Cory Henry, Chad Hugo, Fred Jerkins III, Rodney Jerkins, Tokischa Altagracia Peralta Juárez, James Blake Litherland, James W. Manning, Marco Masis, Juan Luis Morera, Urbani Mota Cedeño, William Ray Norwood Jr., Juan Ivan Orengo, Carlops Querol, Justin Rafael Quiles, David Rodríguez, Rosalía, Jacob Sherman, Alejandro Ramirez Suárez, So Y Tiet, Pilar Vila Tobella, Michael Uzowuru, José Miguel Vizcaya Sánchez, The Weeknd, Dylan Wiggins & Pharrell Williams, songwritersChris Gehringer, album mastering engineer)\n| Motomami (Digital Album)\n|\n|-\n! scope=\"row\" |2023\n| Karol GOvy on the Drums, album producerRob Kinelski, album mixerKevyn Mauricio Cruz Moreno, Karol G & Ovy On The Drums, songwritersDave Kutch, album mastering engineer\n| Mañana Será Bonito\n|\n|-\n! scope=\"row\" |2024\n| Juan Luis Guerra 4.40Juan Luis Guerra & Janina Rosado, album producersAllan Leschhorn, album recording engineerAllan Leschhorn, album mixerJuan Luis Guerra, songwriterAdam Ayan, album mastering engineer\n| Radio Güira\n|\n|-\n! scope=\"row\" |2025\n| Bad Bunny Roberto José Rosado Torres, Mag & Marcos Masis, album producers Antonio Caraballo & Roberto José Rosado Torres, album recording engineersJosh Gudwin, album mixer Bad Bunny, MAG, Marcos Masis & Roberto José Rosado Torres, songwritersColin Leonard, album mastering engineer\n| Debí Tirar Más Fotos\n|\n|-\n|}\nFile:Juan Luis Guerra 2012.jpg|link=|Juan Luis Guerra has won the most in this category with 5 wins.\nFile:Alejandro Sanz - Cap Roig 2016.jpg|link=|Alejandro Sanz won Album Of The Year 3 times.\nFile:Juanes 2008.06.25 002.jpg|link=|Juanes has won this award 3 times.\nFile:Calle 13 en Venezuela.jpg|link=|Calle 13, 2-time winner.\nFile:Shakira 2012.jpg|link=|Shakira's the first female recipient of this award in 2006.\nFile:Rosalia 2019-portrait.jpg|link=|Rosalía is the first female artist to win this award twice, in 2019 and 2022.\nFile:Karol G for PUBG Mobile 02.jpg|link=|Karol G, 2023 award winner.\nSee also\n* Grammy Award for Album of the Year.\n* Billboard Latin Music Award for Top Latin Album of the Year.\nNotes\nEach year is linked to the article about the Latin Grammy Awards held that year.Showing the name of the performer, the nominated album and in parentheses the record producer(s), engineers/mixer(s) and mastering engineer(s) name(s).\nReferences\nSpecific\nGeneral\n*  Note: User must select the \"General Field\" category as the genre under the search feature.\nExternal links\n*[http://www.latingrammy.com/ Official site of the Latin Grammy Awards]"
    }
  ]
}