{
  "content": [
    {
      "type": "text",
      "text": "# Latter Day Saint polygamy in the late-19th century\n\nPossibly as early as the 1830s, followers of the Latter Day Saint movement (also known as Mormonism), were practicing the doctrine of polygamy or \"plural marriage\". After the death of church founder Joseph Smith, the doctrine was officially announced in Utah Territory in 1852 by Mormon leader Brigham Young. The practice was attributed posthumously to Smith and it began among Mormons at large, principally in Utah where the Church of Jesus Christ of Latter-day Saints (LDS Church) had relocated after the Illinois Mormon War.\nIn the years after members of the LDS Church began practicing polygamy, it drew intense scrutiny and criticism from the United States government. This criticism led to the Utah Mormon War, and eventually the abandonment of the practice pursuant to the 1890 Manifesto issued by Wilford Woodruff.\nOfficial sanction by the Church of Jesus Christ of Latter-day Saints\nThe Mormon doctrine of plural wives was officially announced by one of the Twelve Apostles, Orson Pratt, and church president Brigham Young in a special conference of the elders of the LDS Church assembled in the Salt Lake Tabernacle on 28&nbsp;August 1852, and reprinted in the Deseret News Extra the following day. The announcement came nine years after the purported original revelation by Joseph Smith, and five years after the Mormon exodus to the Salt Lake Valley following Smith's death in Carthage, Illinois. Young was unable to produce the original document and declared that Smith's widow Emma Smith had burned it. To this, Emma Smith replied that she had never seen such a document, and concerning the story that she had destroyed the original: \"It is false in all its parts, made out of whole cloth, without any foundation in truth.\"\nControversy and opposition by the United States government\nEarly tension and the Utah War (1852–58)\nPolygamy was roundly condemned by virtually all sections of the American public. During the presidential election of 1856 a key plank of the newly formed Republican Party's platform was a pledge \"to prohibit in the territories those twin relics of barbarism, polygamy and slavery\". The authorship of this phrase has generally been attribuated to John A. Willis\nFurther tension grew due to the relationship between \"Gentile\" federal appointees and the Utah territorial leadership. The territory's Organic Act held that the governor, federal judges, and other important territorial positions were to be filled by appointees chosen by the President with the advice and consent of the Senate, but without any reference to the will of Utah's population. Many of these federally appointed officers were appalled by the practice of polygamy and the Mormon belief system in general, and would harangue the Mormons for their \"lack of morality\" in public addresses. This already tense situation was further exacerbated by a period of intense religious revival starting in late 1856 dubbed the \"Mormon Reformation.\"\nThe issue of polygamy among the Latter-day Saints in Utah was one of the contributing factors that lead to the Utah War, in which the President of the United States dispatched an army to Utah to quell a perceived rebellion. In the midst of the American Civil War, Republican majorities in Congress were able to pass legislation meant to curb the Mormon practice of polygamy. One such act was the Morrill Anti-Bigamy Act, which was signed into law on July 8, 1862 by President Abraham Lincoln. The act banned plural marriage and limited church and non-profit ownership in any territory of the United States to $50,000. The act targeted the LDS Church's control of Utah Territory. The measure had no funds allocated for enforcement, and thus it was not rigorously enforced. The Mormons, believing that the law unconstitutionally deprived them of their First Amendment right to freely practice their religion, chose to ignore the law.\nAftermath and further legislation (1858–90)\nIn the following years, several bills aimed at strengthening the anti-bigamy laws failed to pass the United States Congress. These included the Wade, Cragin, and Cullom bills which had their origin in the territory of Utah and were initiated by men who were bitterly opposed to the Mormon establishment. The Wade Bill initiated in 1866 would have destroyed local government if it had passed. Three years later, the Cragin Bill was proposed, but within a few days it was substituted by the Cullom Bill, which was more radical than the Wade or Cragin bills. Members of the church worked for the defeat of the bill, including women of the church, who held mass meetings throughout the territory in January 1870 in opposition to the bill.\nFinally, the Poland Act (18 Stat. 253) of 1874 was passed which sought to facilitate prosecutions under the Morrill Anti-Bigamy Act by eliminating the control members of the LDS Church exerted over the justice system of Utah Territory. Sponsored by Senator Luke P. Poland of Vermont, the Act redefined the jurisdiction of Utah courts by giving the United States district courts exclusive jurisdiction in Utah Territory over all civil and criminal cases. The Act also eliminated the territorial marshal and attorney, giving their duties to a U.S. Marshal and a U.S. Attorney. The Act also altered petit and grand jury empaneling rules to keep polygamists off juries. By removing Latter-day Saints from positions of authority in the Utah justice system, the Act was intended to allow for successful prosecutions of Mormon polygamists.\nImmediately, under the act, the United States Attorney tried to bring leading church officials to trial. These efforts culminated in the sentencing of George Reynolds to two years hard labor in prison and a fine of five hundred dollars for his practice of polygamy. In 1876, the Utah Territorial Supreme Court upheld the sentence. His 1878 Reynolds v. United States appeal reached the United States Supreme Court, and in January 1879 that body ruled the anti-polygamy legislation constitutional and upheld Reynolds's prison sentence (it struck down the fine and hard labor portions). Reynolds was released from prison in January 1881, having served eighteen months of his original sentence.\nIn February 1882, George Q. Cannon, a prominent leader in the church, was denied a non-voting seat in the House of Representatives due to his multiple marriages. This revived the issue in national politics. One month later, the Edmunds Act was passed, amending the Morrill Act by declaring polygamy a felony, revoking a polygamist's right to vote, making them ineligible for jury service, and prohibiting them from holding political office. These restrictions were enforced regardless of whether an individual was actually practicing polygamy, or merely believed in the Mormon doctrine of plural marriage without actually participating in it. All elected offices in the Utah Territory were vacated, an election board was formed to issue certificates to those who both denied polygamy and did not practice it, and new elections were held territory-wide.\nElectoral obstacles to prosecution were now removed, and the new territorial officials began criminal prosecutions in ernest. Judge Charles S. Zane, the Republican appointee of Chester A. Arthur, handed down harsh sentences to church leaders, beginning with apostle Rudger Clawson.\nFinally, the Edmunds–Tucker Act of 1887 touched all the issues at dispute between the United States Congress and the LDS Church. The act disincorporated both the church and its Perpetual Emigration Fund on the grounds that they fostered polygamy. The act prohibited the practice of polygamy and punished it with a fine of from $500 to $800 and imprisonment of up to five years. It dissolved the corporation of the church and directed the confiscation by the federal government of all church properties valued over a limit of $50,000.\nIn July of the same year, the U.S. Attorney General filed suit to seize the church and all of its assets. The act was enforced by the U.S. marshal and a host of deputies. The act:\n*Dissolved the LDS Church and the Perpetual Emigrating Fund Company, with assets to be used for public schools in the territory.\n*Required an anti-polygamy oath for prospective voters, jurors and public officials.\n*Annulled territorial laws allowing illegitimate children to inherit.\n*Required civil marriage licenses (to aid in the prosecution of polygamy).\n*Abrogated the common law spousal privilege to require wives to testify against their husbands\n*Disfranchised women (who had been enfranchised by the territorial legislature in 1870).\n* Replaced local judges (including the previously powerful Probate Court judges) with federally appointed judges.\n* Removed local control in school textbook choice, by searching whether sectarian books have been employed in schools.\nIn 1890, the U.S. Supreme Court upheld the seizure of church property under the Edmunds–Tucker Act in Late Corporation of the Church of Jesus Christ of Latter-Day Saints v. United States.\nThe church was losing control of the territorial government, and many members and leaders were being actively pursued as fugitives. Without being able to appear publicly, in the 1880s the leadership was left to navigate \"underground\". For example, then apostle (and later church president) Wilford Woodruff fled to southern Utah in 1885 and often wore a dress and sunbonnet as a disguise.\nFollowing the Edmunds-Tucker Act, the LDS Church found it difficult to operate as a viable institution.\nCriticism of polygamy\nUnhappiness associated with plural marriages\nCritics of polygamy in the early LDS Church claim that plural marriages often produced extreme unhappiness in some wives. LDS historian Todd Compton, in his book In Sacred Loneliness, described many instances where some wives in polygamous marriages were unhappy with polygamy.\nMormon apologists claim that many women were very satisfied with polygamous marriages, and note that individuals such as Zina Huntington—a polygamous wife of Brigham Young—went on speaking tours as part of the suffrage movement touting the joys and benefits of plural marriage.\nPhilip Stewart Robinson was a traveling journalist for the Telegraph of London.  In his \"Sinners and Saints\", he notes \"I had expected to see men with long whips, sitting on fences, swearing at their gangs of wives at work in the fields. I expected every now and then to hear of drunken saints beating seven or eight wives all at once,\" but found no such thing.  While continuing to disagree with the practice of polygamy, he found that Utah-born girls, the offspring of plural wives, have figures that would make Paris envious; and they carry themselves with almost oriental dignity. There is nothing, so far as I have seen, in the manners of Salt Lake City to make me suspect the existence of that licentiousness of which so much has been written. He believed that the negative representations of Mormons came universally \"[f]rom anti-Mormons only\".\nPlural marriage used to justify immoral behavior with young girls\nRichard Abanes has claimed that church leaders sometimes used polygamy to take advantage of young girls for immoral purposes. Mormon historian George D. Smith studied 153 men who took plural wives in the early years of Mormonism, and found that two of the girls were thirteen years old, 13 girls were fourteen years old, 21 were fifteen years old, and 53 were sixteen years old.  LDS historian Todd Compton documented that Joseph Smith was sealed to two girls of age 14 and two girls of age 16. During the era of polygamy in Utah, the New York Times reported in 1857 cases of girls aged 10 and 11 being married to old men, and noting that marriages of girls aged 14 was \"a very common occurrence\". Historian Stanley Hirshson also noted these practices and cites the New York Times and several other sources as support.\nBrigham Young attempted to stamp out the practice of men being sealed to excessively young girls. In 1857, he stated, \"I shall not seal the people as I have done. Old Father Alread brought three young girls 12 & 13 years old. I would not seal them to him. They would not be equally yoked together .... Many get their endowments who are not worthy and this is the way that devils are made.\"\nShortage of wives caused by plural marriage\nRichard Abanes argues that polygamy may have caused a shortage of brides in the early Mormon community. The New York Times reported in 1860 that apostle Heber C. Kimball stated (in an address to departing missionaries): Brethren, I want you to understand that it is not to be as it has been heretofore. The brother missionaries have been in the habit of picking out the prettiest women for themselves before they get here, and bringing on the ugly ones for us; hereafter you have to bring them all here before taking any of them, and let us all have a fair shake.\nMormon scholars dispute the accuracy of the quote, as it cannot be corroborated by a second source such as the extensive (though incomplete) record of sermons in the Journal of Discourses. FairWiki suggests that it may be a paraphrase of the following quoted statement, which is authentic:\n\"You are sent out as shepherds to gather the sheep together; and remember that they are not your sheep: they belong to Him that sends you. Then do not make a choice of any of those sheep; do not make selections before they are brought home and put into the fold.\" Critics of Mormonism interpret this to be a statement of \"selecting\" converts for plural marriages. In the paragraph immediately following the above quote, Kimball went on to say:\nMormon apologists dispute that there was a shortage of women, and advocate that polygamy was used at least in part to care for women who did not have husbands or were widows. LDS historians George L. Mitton and Rhett S. James of FARMS cite Brigham Young as encouraging single men to marry, stating that the incidence of polygamy would thus be reduced.\nThe precise number who participated in plural marriage is not known, but studies indicate a maximum of 20–25 percent of adults in the church were members of polygamist households. One third of the women of marriageable age and nearly all of the church leadership were involved in the practice.\nCoercion and deception related to plural marriage\nCritics of polygamy in the early LDS Church have documented several cases where deception and coercion were used to induce marriage; for example, the case of Joseph Smith warning some potential spouses of eternal damnation if they did not consent to be his wife is often cited as an example. In 1876, English-born and Utah-immigrant LDS Church member John Horne Miles was called on a proselyting mission back to England. While in Utah, Miles had written to his childhood sweetheart Caroline Owen proposing marriage, but never received a reply. By the time he left for his church mission, he was engaged to Emily and Julia Spencer, the young daughters of the widow he and his brothers boarded with in Utah. On his mission in England, Miles ran into Caroline Owen, who had accepted his proposal in a letter that Miles had never received. The marriage proposal was renewed and Caroline was baptized into the LDS Church. Back in Utah, younger Julia Spencer backed out of the engagement at Miles's request, but Emily Spencer would not. The day after Miles's wedding to both Emily and Caroline, Caroline had Miles arrested for bigamy. Miles was tried and found guilty by local courts, but appealed his case all the way to the federal level. The Supreme Court had the lower courts' ruling overturned, as Emily's testimony was required to prove Miles's marriage to her, and she had fled to St. George, Utah. This became a significant case in polygamy law. Ann Eliza Young, nineteenth wife of Brigham Young, claimed that Young coerced her to marry him by threatening financial ruin of her brother.  However, LDS scholar Hugh Nibley disputed this claim, arguing that Ann Eliza and her mother had sought the marriage.\nMormon apologists claim that these were isolated cases, and the vast majority of wives consented willingly to plural marriage.\nIncest\nCritics of polygamy in the early LDS Church claim that polygamy was used to justify marriage of close relatives that would otherwise be considered immoral. In 1843, Joseph Smith's diary records the marriage of John Bernhisel to his sister, Maria, in what appears to be a symbolic sealing. In 1886, Abraham H. Cannon (an apostle at the time) claimed that fellow apostle Lorenzo Snow stated that the day would come when brothers and sisters could get married in the Church, and that Brigham Young purportedly shared these views.\nPublic opposition and anti-Mormon agitation\nOpponents of the LDS Church found in polygamy a convenient cause célèbre. Opposition to the church, especially among former Mormons, frequently focused, not upon the drawbacks of polygamy as a marriage system, but upon polygamy as a symptom of the depravity of Mormonism and Mormons in general.  Former LDS Church member and prominent critic Fanny Stenhouse wrote in 1875: It would be quite impossible, with any regard to propriety, to relate all the horrible results of this disgraceful system .... Marriages have been contracted between the nearest of relatives; and old men tottering on the brink of the grave have been united to little girls scarcely in their teens; while unnatural alliances of every description, which in any other community would be regarded with disgust and abhorrence, are here entered into in the name of God.\nThe end of polygamy in the LDS Church\n1890 Manifesto\nIn April 1889, Wilford Woodruff, president of the church, began privately refusing the permission that was required to contract new plural marriages. In October 1889, Woodruff publicly admitted that he was no longer approving new polygamous marriages, and in answer to a reporter's question of what the LDS Church's attitude was toward the law against polygamy, Woodruff stated, \"we mean to obey it. We have no thought of evading it or ignoring it.\" Because it had been Mormon practice for over 25 years to either evade or ignore anti-polygamy laws, Woodruff's statement was a signal that a change in church policy was developing.\nBy September 1890, federal officials were preparing to seize the church's four temples and the U.S. Congress had debated whether to extend the 1882 Edmunds Act so that all Mormons would be disenfranchised, not just those practicing plural marriage. The Supreme Court had already ruled in Davis v. Beason that a law in Idaho Territory which disenfranchised individuals who practiced or believed in plural marriage was constitutional.\nWoodruff would later recount that on the night of September 23, 1890, he received a revelation from Jesus that the church should cease the practice of plural marriage. Woodruff announced the Manifesto on September 25 by publishing it in the church-owned Deseret Weekly in Salt Lake City. On October 6, 1890, during the 60th Semiannual General Conference of the church, the Manifesto was formally accepted by the church membership.\nThe Manifesto was the end of official church authorization for the creation of new plural marriages that violated local laws. It had no effect on the status of already existing plural marriages, and plural marriages continued to be performed in locations where it was believed to be legal. As Woodruff explained at the general conference where the Manifesto was accepted by the church, \"[t]his Manifesto only refers to future marriages, and does not affect past conditions. I did not, I could not, and would not promise that you would desert your wives and children. This you cannot do in honor.\" Despite Woodruff's explanation, some church leaders and members who were polygamous did begin to live with only one wife. However, the majority of Mormon polygamists continued to cohabit with their plural wives in violation of the Edmunds Act until the 1940s and 1950s.\nAftermath: The Smoot Hearings, and the Second Manifesto\nBuilding on a limited pardon issued in 1893 by Benjamin Harrison, on September 25, 1894 Grover Cleveland issued a general pardon (with one condition) to everyone still imprisoned for polygamy offenses. Within six years of the announcement of the 1890 Manifesto, Utah had become a state and federal prosecution of Mormon polygamists subsided.\nD. Michael Quinn and other Mormon historians have documented that some church apostles covertly sanctioned plural marriages after the Manifesto. This practice was especially prevalent in Mexico and Canada because of an erroneous belief that such marriages were legal in those jurisdictions. However, a significant minority were performed in Utah and other western American states and territories. The estimates of the number of post-Manifesto plural marriages performed range from scores to thousands, with the actual figure probably close to 250. Today, the LDS Church officially acknowledges that although the Manifesto officially ended the practice of plural marriage in the church, \"on an exceptional basis, some new plural marriages were performed between 1890 and 1904\".\nHowever, Congress still refused to seat representatives-elect who were polygamists, including B. H. Roberts.\nRumors of post-Manifesto marriages surfaced and were examined in detail during a series of congressional hearings on whether the United States Senate should seat Mormon Apostle Reed Smoot, who was elected by the Utah legislature in 1903. The hearings began in 1904 and continued until 1907, when the Senate finally voted to seat him. During the hearings, Smoot was given a provisional seat on the Senate and was allowed to vote. Smoot's chief opponents in the Senate were Senators Fred Dubois of Idaho and Julius C. Burrows of Michigan, who heavily criticized the church for its practice of polygamy. However, the opposition against Smoot was not universal among the senators with Senators such as Boies Penrose of Pennsylvania making sympathetic remarks on the issue.\nIn response to the hearings, church president Joseph F. Smith issued a \"Second Manifesto\" in 1904 which reaffirmed the church's opposition to the creation of new plural marriages and threatened excommunication for Latter-day Saints who continued to enter into  or solemnize new plural marriages. Polygamy was gradually discontinued after the 1904 manifesto as no new plural marriages were allowed and older polygamists eventually died, though, these polygamous LDS families cohabitated into the 1940s and 1950s.\nApostles John W. Taylor and Matthias F. Cowley each resigned from the Quorum of the Twelve Apostles due to disagreement with the church's position on plural marriage. Involvement in or teaching plural marriage continues to be grounds for excommunication from the LDS Church. The cessation of plural marriage within LDS Church gave rise to the Mormon fundamentalist movement.\nFundamentalist reactions to the end of polygamy\nThe shift in practice regarding polygamy by the LDS Church gave rise to several sects of Mormon fundamentalism, including the Fundamentalist Church of Jesus Christ of Latter-Day Saints (FLDS Church) and others.\nPolygamy in the 20th century\nCurrently, the LDS Church does not sanction polygamy and considers practitioners to be apostate and worthy of membership removal. Polygamists, including monogamous individuals belonging to fundamentalist groups, have to get special authorisations to be baptisized in the church. The church still confirms that polygamy may be approved by God, but that observation of the practice is currently prohibited by him.\nThe Community of Christ does not, nor has ever adhered to the practice of polygamy.\nThe FLDS Church and other Mormon fundamentalists still adhere to the commandment as practiced in the early days of the movement.\nThe Church of Jesus Christ of Latter Day Saints (Strangite) does not practice polygamy, but recognizes it as a legitimate historical doctrine.\nNotes\nReferences\n*\n*.\n*.\n*.\n*}}.\n*\n*\n*.\n*.\n*\n* }}.\n*\n*\n*.\n*.\n*.\n*.\n*.\n*.\n*.\n*.\n*.\n*; Ayer Co Publishing  (Hardcover, 1978); Kessinger Publishing, LLC  (Paperback, 2003).\n*.\nFurther reading\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}