{
  "content": [
    {
      "type": "text",
      "text": "# Launggyet dynasty__disambig_1\n\n| image_flag             =\n| image_coat             =\n| symbol_type            =\n| image_map              = Burma c. 1310.PNG\n| capital                = Launggyet\n| religion               = Theravada Buddhism, Mahayana Buddhism, Animism\n| government_type        = Monarchy\n| legislature            =\n| currency               =\n| status                 = Kingdom\n| year_end               = 1430\n| year_start             = 1237/1251\n| flag_type              =\n| image_map_caption      = Map of Burma in 1310 (during the Myinsaing kingdom). Launggyet dynasty of Arakan is seen on the western part.\n| common_languages       = Arakanese, Old Burmese\n| year_leader1           = 1250–1256\n| leader1                = Alawmaphyu (first)\n| year_leader2           = 1256–1258\n| leader2                = Razathu I\n| year_leader3           = 1273–1277\n| leader3                = Nankyargyi\n| year_leader4           = 1283–1389\n| leader4                = Min Hti\n| year_leader5           = 1394–1395, 1397–1401\n| leader5                = Razathu II\n| year_leader6           = 1404–1406\n| leader6                = Saw Mon II (last)\n| event_start            = Founding of dynasty\n| date_start             =\n| event1                 = Invasion from Kingdom of Ava\n| date_event1            = 1404\n| event2                 =\n| date_event2            =\n| event3                 =\n| date_event3            =\n| event4                 =\n| date_event4            =\n| event_end              = End of kingdom\n| date_end               =\n| p1                     = Waithali kingdom\n| s1                     = Kingdom of Mrauk U\n| flag_p1                =\n| p2                     = Nyeinzara Toungoo (Parein dynasty)\n| p3                     =\n| flag_s1                =\n| flag_s2                =\n| s2                     =\n| s3                     = Interregnum\n| s4                     = Kingdom of Ava\n| s5                     = Bengal Sultanate\n| today                  = Myanmar\n| era                    =\n| flag                   =\n| symbol                 =\n}}\nThe Launggyet dynasty (Burmese: လောင်းကြက်မြို့ ; 1251–1406) was the final Arakanese kingdom of Le-Mro period which was located in present-day northern Rakhine State of western Myanmar. According to the Arakanese chronicle Rakhine Razawin Thit, the Launggyet dynasty was founded on April 22, 1251. It succeeded the Vesali kingdom and preceded the rise of the Mrauk U dynasty.\nLaunggyet prospered as a trade nexus between South Asia and Southeast Asia. Exports included rice, ivory, and lacquerware, while imports featured Bengal textiles and spices.\nThe capital, Launggyet, was strategically situated in the Kaladan River valley, providing fertile lands and access to maritime trade routes. Its defensive position against invasions from the east (Burma) and west (Bengal) made it a political and economic hub.\nTimeline\nThe dynasty was founded in 1237 by King Alawmaphyu Min after the fall of Vesali. During the late 13th century, the Mongol invasions weakened the neighboring Pagan kingdom, allowing Launggyet to strengthen its position. However, in 1404–1406, the Burmese Ava kingdom launched an invasion, temporarily displacing the Arakanese monarchy. In 1429, King Min Saw Mon, with the backing of the Bengal Sultanate, reclaimed the throne and decided to move the capital to Mrauk U. By 1430, the Launggyet dynasty came to an end as Mrauk U emerged as the new political and cultural center of Arakan.\nIn 1294, the kingdom was invaded by the Shans, but they were successfully repelled.\nIn 1327, the Pinya kingdom attacked Ramree Island of the dynast, capturing some inhabitants. This was followed by a Shan attack from the Lemro River in 1334. In response, King Min Hti sent his army across the Arakan Mountains to raid Thayet. After the campaign, Min Hti founded the town of Ann in 1334/1335 as a stopover point on the route through the Arakan Mountains to Minbu.\nDuring the reign of King Thinhse, in late 1394, he launched a campaign against the Ava kingdom.\nBy the early 15th century, repeated Burmese invasions and siltation of the Kaladan River undermined Launggyet's viability. The final blow came in 1404 when Ava forces sacked the city, prompting the royal family's exile.\n{| class=\"wikitable\"\n|+ Timeline of Key Events\n! Year !! Event\n|-\n| 1237/1251 || Dynasty founded by Alawmapru Min; Launggyet city becomes capital.\n|-\n| 1250–1300 || Consolidation of power; construction of Buddhist monasteries and irrigation systems.\n|-\n| 1279 || Accession of Min Hti, a legendary king credited with divine lineage ruling the kingdom for 95 years.\n|-\n| 1404 || Invasion by the Ava kingdom of Burma; royal family flees to Bengal.\n|-\n| 1429 || Min Saw Mon (Narameikhla) returns with Bengali military aid, reclaims the throne.\n|-\n| 1430 || Capital moved to Mrauk U; formal end of the Launggyet dynasty.\n|}\nLaunggyet city\n.]]\nNotable Kings\n* Alawmaphyu Min (r. 1237–?): Founder of the dynasty, credited with stabilizing post-Vesali Arakan.\n* Min Hti (r. 1279 to 1374): Legendary ruler who ruled the dynasty for 95 years.\n* Min Saw Mon (r. 1380–1433): Last Launggyet king and founder of Mrauk U kingdom after exile in Bengal.\nSee also\n* History of Rakhine\n* Rakhine people\nReferences"
    }
  ]
}