{
  "content": [
    {
      "type": "text",
      "text": "# Lauren J. King\n\n| birth_place      =\n| death_date       =\n| death_place      =\n| death_cause      =\n| resting_place    =\n| resting_place_coordinates =\n| nationality      = AmericanMuscogee (Creek) Nation\n| party            =\n| education        = University of Washington (BA)University of Virginia (JD)\n}}\nLauren Jennifer King (born 1982) is an American attorney who is a United States district judge of the United States District Court for the Western District of Washington.\nEarly life and education\nKing was born in Oklahoma City. She earned a Bachelor of Arts from the University of Washington in 2004 and a Juris Doctor from the University of Virginia School of Law in 2008. King is a citizen of the Muscogee (Creek) Nation.\nCareer\nKing was an associate at K&L Gates from 2008 to 2009 and  Byrnes Keller Cromwel from 2010 to 2012. She was a principal at Foster Garvey, P.C. based in Seattle, Washington, where she practiced from 2012 to 2021. She served as a pro tem appellate judge for the Northwest Intertribal Court System from 2013 to 2021. She was also appointed as a commissioner on the Washington State Gambling Commission. She previously taught Federal Indian Law at the Seattle University School of Law.\nFederal judicial service\nOn March 30, 2021, President Joe Biden nominated King to serve as a United States district judge of the United States District Court for the Western District of Washington to the seat vacated by Judge Robert S. Lasnik, who assumed senior status on January 27, 2016. On June 9, 2021, a hearing on her nomination was held before the Senate Judiciary Committee. On July 15, 2021, her nomination was reported out of committee by a 13–9 vote. On October 5, 2021, the United States Senate invoked cloture on her nomination by a 55–44 vote. Her nomination was confirmed later that day by a 55–44 vote. She received her judicial commission on December 7, 2021.\nShe was sworn in on December 15, 2021. She is the first Native-American federal judge to serve in Washington State. She is the sixth Native American federal judge to serve in the United States.\nSee also\n*List of Native American jurists\nReferences\nExternal links\n*\n*\n|years=2021–present}}"
    }
  ]
}