{
  "content": [
    {
      "type": "text",
      "text": "# Laura River (Queensland)\n\nLaura River}}\n| width_min          =\n| width_avg          =\n| width_max          =\n| depth_min          =\n| depth_avg          =\n| depth_max          =\n| discharge1_location=\n| discharge1_min     =\n| discharge1_avg     =\n| discharge1_max     =\n| source1            = Great Dividing Range\n| source1_location   = below Mount Murray\n| source1_coordinates=\n| source1_elevation  =\n| mouth              = confluence with the Normanby River\n| mouth_location     = south of\n| mouth_coordinates  =\n| mouth_elevation    =\n| progression        =\n| river_system       = Normanby River\n| basin_size         =\n| tributaries_left   = Mosman River, Kennedy Creek\n| tributaries_right  = Ninda Creek, Deighton River\n| custom_label       = National park\n| custom_data        = Rinyirru National Park\n| extra              =\n}}\nThe Laura River is a river in the Cape York Peninsula region of Far North Queensland, Australia.\nCourse and features\nThe Laura River rises on the eastern slopes of the Great Dividing Range below Mount Murray. The river flows generally northwest, shadowed by the Peninsular Development Road from nearby  and then flows north through the town of  and then the river forms the western border of the Rinyirru National Park, while the Peninsular Development Road continues north-west through  to reach the top of the peninsula at . The river is joined by sixteen tributaries including the Deighton, Little Laura and Mosman rivers. The river reaches its confluence and empties into the Normanby River south of . The river descends  over its  course.\nThe river is crossed by the Mulligan Highway near Mount Gibson.\nA railway bridge was built over this river, but because of a change in finances and plans it was never used, except for a test train.\nEtymology\nThe river was named as the Hearn River by William Hann on 19 October 1872, after his wife's family name. The name Laura was given by Archibald Macmillan, a road surveyor and explorer, after his wife, Laura Bower (nee Poingdestre).\nSee also\n}}\n* List of never used railways\n*\nReferences"
    }
  ]
}