{
  "content": [
    {
      "type": "text",
      "text": "# Laurelton, Queens\n\nborder\n| imagesize                       = 275px\n| image_alt                       =\n| image_caption                   = 228th Street at 138th Avenue in Laurelton\n| image                           =\n| nickname                        =\n| motto                           =\n| anthem                          =\n| image_map                       =\n| mapsize                         =\n| map_alt                         =\n| map_caption                     = Location within New York City\n| coordinates                     =\n| subdivision_type                = Country\n| subdivision_name                =\n| subdivision_type1               = State\n| subdivision_name1               =\n| subdivision_type2               = City\n| subdivision_name2               =\n| subdivision_type3               = County/Borough\n| subdivision_name3               =  Queens\n| subdivision_type4               = Community District\n| subdivision_name4               = Queens 13\n| established_title               = Founded\n| established_date                =\n| established_title1              =\n| established_date1               =\n| founder                         =\n| named_for                       =\n| population_footnotes            =\n| population_total                = 24,453\n| population_as_of                = 2010\n| population_density_km2          =\n| population_density_sq_mi        =\n| population_demonym              =\n| population_note                 =\n| demographics_type1              = Race/Ethnicity\n| demographics1_footnotes         =\n| demographics1_title1            = Black\n| demographics1_info1             = 90.1%\n| demographics1_title2            = White\n| demographics1_info2             = 1.5\n| demographics1_title3            = Asian\n| demographics1_info3             = 0.7\n| demographics1_title4            = Native American\n| demographics1_info4             = 0.3\n| demographics1_title5            = Hispanic\n| demographics1_info5             = 5.5\n| demographics_type2              =\n| demographics2_footnotes         =  tags -->\n| demographics2_title1            =\n| demographics2_info1             =\n| timezone                        = EST\n| utc_offset                      = −5\n| timezone_DST                    = EDT\n| utc_offset_DST                  = −4\n| postal_code_type                = ZIP Codes\n| postal_code                     = 11413, 11422\n| area_code_type                  = Area codes\n| area_code                       = 718, 347, 929, and 917\n| official_name                   =\n}}\nLaurelton is a largely middle-class neighborhood in the New York City borough of Queens and part of the former town of Jamaica. Merrick Boulevard, which bisects the community in a generally east–west direction, forms its commercial spine. It is bounded by Springfield Boulevard to the west, 121st Avenue to the north, Laurelton Parkway to the east, and Conduit Avenue to the south.\nLaurelton is located in Queens Community District 13; its ZIP Codes are 11413 and 11422. It is patrolled by the New York City Police Department's 105th Precinct.\nHistory\nLaurelton derives its name from the Laurelton station on the Long Island Rail Road, which was named for the laurels that grew there over 100 years ago. It was developed by Dean Alvord and was modeled after an English village, with stately Tudor-style homes, both attached and detached. A few co-ops exist in a former garden apartment complex, there has been some new construction but no high-rise buildings, which has enabled Laurelton to keep its small-town feel.\nThe area of Laurelton closest to Rosedale and Cambria Heights consists primarily of single-family homes whereas the area abutting Springfield Gardens contains more multi-family homes. The area south of Merrick Boulevard contains many large, individually designed houses, while certain blocks to the north, running eastward from Francis Lewis Boulevard, have attached, Tudor-style rowhouses. Laurelton also has a series of streets with landscaped and tree-lined center malls.\nDemographics\nIn the 1930s through the 1970s, Laurelton was home to many Jewish-American families, home to female American radio trio NBC radio vocal harmonists Three X Sisters during the 1930s, but succeeding generations since the 1960s have included various Afro-descended groups, including African-Americans, Caribbean/West Indians and West Africans, many of whom were attracted to Laurelton's more suburban-like environment.\nBased on data from the 2010 United States census, the population of Laurelton was 24,453, a decrease of 1,922 (7.3%) from the 26,375 in 2000. Covering an area of , the neighborhood had a population density of .\nThe racial makeup of the neighborhood was 1.5% (366) White, 90.1% (22,032) African American, 0.3% (73) Native American, 0.7% (171) Asian, 0.5% (12) Pacific Islander, 0.4% (97) from other races, and 1.6% (391) from two or more races. Hispanic or Latino of any race were 5.5% (1,344) of the population.\nEducation\n*[http://www. Cariculum Academy of Southeast Queens]  A Community Schoolhouse\n*https://www.queensunited.org/\nTransportation\nBelt Parkway exits 24A/B, 23A, and 22 service Laurelton. The section of the Belt Parkway known as the Laurelton Parkway was the subject of a master plan as part of the city's emerging system of greenways and bikeways. The restoration of this  link was completed in 2006.\nThe Laurelton station on the Long Island Rail Road, located at 225th Street and 141st Road, offers service via the Far Rockaway and Long Beach branches.\nResidents also have access to MTA Regional Bus Operations buses , which connect to New York City Subway stops in Jamaica. The  express buses to Manhattan also stops in Laurelton.\nNotable residents\n* David Bergman (born 1950), gay writer/academic.\n* Joel Brind, professor of human biology and endocrinology at Baruch College.\n* Sam DeLuca (1936–2011), New York Jets right guard in the 1970s.\n* Mikey D (born 1967), rapper for Main Source and Mikey D & LA Posse.\n* David Greenglass (1922–2014), machinist and atomic spy for the Soviet Union who worked on the Manhattan Project.\n* Derrick Harmon (born 1963), NFL running back for the San Francisco 49ers from 1984 to 1986.\n* Ronnie Harmon (born 1964), running back, kick returner who played in the NFL for the Buffalo Bills and San Diego Chargers.\n* Marcus Jansen (born 1968), Expressionist painter. Attended PS 156 in Laurelton.\n* Hettie Jones (1934–2024), poet/memoirist and former wife of writer Amiri Baraka.\n* Meir Kahane (1932–1990), founder of the Jewish Defense League.\n* Doron Lamb (born 1991), professional basketball player for Scafati Basket of the Lega Basket Serie A\n* Neil Leifer (born 1942), photographer and filmmaker known mainly for his work in the Time Inc. family of magazines.\n* Bernard Madoff (1938–2021), former NASDAQ chairman, convicted of the largest financial fraud in U.S. history.\n* Ruth Madoff (born 1941), wife of Bernie Madoff.\n* Irving Mosberg (1908–1973), politician who served in the New York Senate from 1958 to 1967.\n* Winston Rodney  (born 1945), reggae music legend, known as \"Burning Spear\".\n* Elliot Sperling (1951–2017), expert on Tibetan history and the Tibet-China conflict and chair of Central Eurasian Studies at Indiana University\nReferences\nExternal links\n*[http://www.ccoflaurelton.org Laurelton Civic Association]\n*[http://www.laureltonnewyork.net/index.html Memories of Laurelton]\n*[http://laureltonblog.blogspot.com/ The Laurelton Blog]"
    }
  ]
}