{
  "content": [
    {
      "type": "text",
      "text": "# Laura Woodward\n\nLaura Woodward (1834–1926) was an American painter. She was inducted into the Florida Artists Hall of Fame in 2013.\nBiography\nLaura Woodward was born on March 18, 1834, in Mount Hope in Orange County, New York. She was the oldest out of three children. Her siblings' names were Thomas and Elizabeth. She lived in New York City and painted in the Catskills, the White Mountains, the Adirondacks, the Green Mountains, Maine coast, Massachusetts coast, Connecticut, New Jersey, and Pennsylvania. She captured many landscapes in oil on canvas and watercolor and was a member of the Hudson River School and White Mountain School. She exhibited her work at the American Art Gallery, National Academy of Design, Boston Art Club, Brooklyn Art Association, the Pennsylvania Academy of the Fine Arts, the Centennial Exhibition of 1876, Chicago and Cincinnati's industrial expositions and Louisville's recurring Southern Exposition.  [https://edwardanddeborahpollack.com/laura-woodward-biography/ Laura Woodward Official Biography] There were many occasions where she signed her name L. Woodward to avoid being rejected by juried shows or discriminated against by other committees, judges, or critics. During her early career as an artist, she became colleagues and friends with many Hudson River School artists, including James D. Smillie and Julie Hart Beers.\nWoodward began to spend the winters in St. Augustine, Florida in the 1880s and by the end of 1889 she had joined Martin Johnson Heade and the other artists at Henry M. Flagler's Ponce de Leon Hotel. By 1890, her younger sister, Libby, would sometimes travel to Florida with due to her increasingly ill health in the hope that it would extend her life.\nWoodward was disappointed in the Ancient City because it was not as tropical as she had hoped, so she traveled throughout Florida searching for exotic plants and flowers. She was told of how beautiful Palm Beach was and made the arduous trip south to discover the true tropical foliage she was longing for. By 1889 Woodward was spending time in Palm Beach and Jupiter, painting outside amid what was then largely jungle and swampland inhabited by panthers, bears, and numerous alligators. She brought her watercolor sketches of that area back to St. Augustine where she joined her friend Martin Johnson Heade and the other artists at Henry M. Flagler's Ponce de Leon Hotel. There she became famous for her renderings of the \"curious\" Royal Poinciana tree and its blossoms. The media determined she should be \"adopted by the entire state\" of Florida due to the way she publicized its natural beauties.\nFlagler owned at least two of Woodward's paintings at his St. Augustine home, Kirkside.--a Palm Beach royal poinciana tree and a seascape. Woodward also exhibited her work at Flagler's Florida Times-Union headquarters in St. Augustine. According to documented family history that is corroborated in the award-winning Laura Woodward: The Artist Behind the Innovator Who Developed Palm Beach, she (and her friend Frances Cragin) told Henry Flagler that Palm Beach should be developed as a resort, using her paintings as full-color evidence of her visionary ideas. Flagler listened to Laura and her friend, was compelled by her art, and bought property in the same locations depicted in Woodward's paintings. When Flagler was constructing his Palm Beach Hotel Royal Poinciana in 1893, he established a home and studio for Woodward there--a permanent atelier was included when the hotel was completed in 1894. His newspapers also acknowledged Woodward as being responsible for publicizing the allure of the east coast of Florida to the entire nation. Although she often visited New York and various parts of Florida, Woodward made Palm Beach her home from 1893 to 1926.\nOne of the Florida areas visited by Woodward was Miami and the regions around it. She painted Seminoles in their dugout canoes and also sketched in the Everglades--despite the dangerous conditions there. In 1895, Laura, her sister Libbie, and Mrs. Julia Tuttle had an exciting adventure on the Miami River. Woodward's works of  Miami and its environs, as well as many other Florida locales, were well received by the Florida and New York media and collected by prominent art patrons.\nLaura Woodward became nationally well known for her delicate renderings in oil and watercolor of unspoiled nature throughout Florida. In 1920, when the Palm Beach Art League was established, Woodward was acknowledged as their pioneer and became an honorary member. Tragically, due to failing eyesight, Laura was unable to continue painting by then but remained highly regarded as the famous Florida artist and the pioneer artist of Palm Beach. She continued living in Palm Beach until 1926 when, at the age of 92, it was necessary for her to move to St. Cloud where her caregivers lived. She died shortly thereafter on May 9, 1926.  In 1940 the Palm Beach Art League held Woodward's memorial exhibition and helped found the Norton Gallery and School of Art, dedicated in 1941 (Norton Museum of Art).\nExternal links\n*https://edwardanddeborahpollack.com/laura-woodward-biography/\nReferences"
    }
  ]
}