{
  "content": [
    {
      "type": "text",
      "text": "# Laurence Edwards\n\n}}\nLaurence Edwards (born 1967 in Suffolk) is a British sculptor, best known for experimenting with a lost wax casting process to create Bronze statues. Edwards’ works are stored in an art gallery in Wiltshire.\nCareer\nEdwards began his training at Lowestoft Art College before going to Canterbury College of Art, a sculpture department heavily involved in steel formalism where Antony Caro was a frequent visiting tutor. He later attended a post-graduate course at the Royal College of Art, where he studied bronze casting and sculpture. Edwards credits Tissa Ranasinghe as a crucial influence, who helped to break down the mental process of his work, resulting in a fusion of process and creative act.\nAfter being awarded a Henry Moore bursary and the Angeloni Prize for Bronze Casting. He travelled to India and Nepal studying traditional casting techniques with an Intach travelling scholarship. The knowledge he acquired allowed him to establish his first foundry and studio in 1990 at Clock House in Bruisyard. In 1992, he established Yew Tree Farm Studios, in Laxfield, a foundry and an artistic community. It was here amongst other initiatives that he cofounded the US-UK Iron pour exchange and residency program with Professor Coral Lambert of the National casting institute Alfred University in Alfred, New York.\nIn 2002 'Yew Tree' evolved into 'Butley Mills Studios', set in the marshlands of the Butley Creek. The studio was able to grow an artist community around a thriving bronze foundry of which, Keir Smith, Sir Christopher Le Brun, Brian Taylor, were notable members.\nIn 2006, he won the Royal Society of Portrait Sculpture Award for his work Grin and Bare and became an Elected Fellow of the Royal Society of British Sculptors in 2012.\nLaurence Edwards has exhibited in Australia since 2009 and held two exhibitions alongside Messums Wiltshire at the Mary Place Gallery.\nLaurence Edwards' works are recently part of an art exhibition at the new EA exhibition hosted at Hedingham Castle in July 2021. His work which included 8&nbsp;ft tall sculptures were placed in the grounds of Hedingham Castle.\nIn November 2019, a site specific sculpture was unveiled by Edwards for the Sainsbury Centre in Norfolk called man of stones. The process was documented in film by Bill Jackson. Edwards' artistic process was filmed over a period of nine months and witnessed the journey of wax to bronze. In 2015, Edward's Crouching Man was exhibited alongside more than 100 other artworks in annual exhibition on the coastline between Bondi and Tamarama.\nSculpting method\ncampus of the University for the Creative Arts]]\nEdwards begins by creating a human form from clay over a metal armature, which is then worked and expressed. As the clay hardens, the sculpture is aggressively modelled and impregnated with organic materials. When the clay cracks it is pinned and repaired with branches, rope and string, before being bound in wet rags to create living surfaces.\nHe has used the same type of clay for many years, crushing old sculptures and rejuvenating the clay. Thus the material has a history, indicators of old work will appear as splinters, string and become part of an increasing material form with has a marshy odour. Due to the rotting material within, fungi and grasses will often sprout from the surfaces at the right time of year, and the occasional toad has been known creep from under a crevice.\nOnce these figures are molded, Edwards rebuilds them in wax and sets about interrogating the surfaces with flames and hot knives, burning more organic material into the surface and reinforcing them with sticks and binding with string, preventing the delicate forms from collapse. This results in a vulnerability which often contradicts the apparent strength of the bronze.\nInteraction with landscape\nIn 2008, Edwards created three 8&nbsp;ft bronze figures inspired by the marshes around his studio at the time. These were exhibited at the Aldeburgh Festival, after a voyage on a raft along the river Alde. The writer Robert Macfarlane comments on his first meeting with the figures, \"I came over time to see the Creek Men not as eldritch paramilitaries set on vengeance, but as more ethically neutral emanations of the Suffolk terrain itself. Chronic and chthonic, they were indigenes – and there was an aspect of tolerance to their presence, as well as of threat.\"\nIn 2017, the Police and Coastguard were called to \"body in the water\". It quickly transpired that it was Edwards' work A Thousand Tides which had been in the Butley Creek for almost a year. The figure was designed to only been seen at low tide. However, it had \"stayed on the surface longer than it should.\" Edwards further remarked that \"I've always been a bit worried that a helicopter would spot it and want to rescue it.\"\nDoncaster miners sculpture\nIn 2018, Edwards was commissioned by Doncaster Council to create a sculpture that celebrates the lives of those who worked in the collieries around Doncaster. The project was funded with donations from the community through a crowdfunding campaign. 'A Rich Seam' was unveiled in Print Office Street in 2021.\nThe sculpture consists of 40 portraits of the former miners, who told their stories while being sculpted. These sessions were filmed by Doncaster College for their online archive. In February 2021, A Rich Seam was installed in the Doncaster city centre. The bronze faces sit in the handmade crevices of two 20 tonne pieces of York Stone with a miner between them.\nRobert Macfarlane said that \"in this unique project, Laurence Edwards has created a new kind of stone book: an extraordinary double-archive – told in bronze and told in story – of a generation and a community that is now close to disappearing.\" The sculpture now stands outside the Frenchgate Centre to show how important mining is to Doncaster. Mayor Ros Jones said that \"the iconic piece of art will commemorate our past but also look forward to the future.\" Keith Marshall, who had been a miner at the Brodsworth Coillery since he was 15, said that \"this will be something that my grandchildren can take their grandchildren to, and learn our history.\"\nYoxman\nIn 2021, Edwards completed a 26&nbsp;ft sculpture named Yoxman, which stands next to the A12 in Suffolk. Russell Pearce of Yoxford Parish Council said that \"to have that standing in the village, and be able to see it from the A12, it's a great thing for Yoxford and will really help the economy. It will really stand out, and people will want to stop and have a look around here.\"\nWeighing 8 tonnes, and cast at Edwards' foundry under the supervision of foundry manager Tom Crompton, it is one of the largest bronze sculptures to be cast in the UK in recent years. He is part tree, cove, cliff and figure. Organic matter was incorporated into the casting process. Edwards used leaves, branches, stone and rope as he moulded the form together. Edwards described the work as \"a Green Man for our age' and that the work is \"a lightning rod for loads of issues about ecology and what we are doing to this planet,\". The sculpture stands on land that is part of the Wilderness Reserve, a private 8000 acre estate that has been assembled by Jon Hunt since 1995.\nReferences"
    }
  ]
}