{
  "content": [
    {
      "type": "text",
      "text": "# LaVell Edwards Stadium__disambig_1\n\n| image_map      =\n| pushpin_map    = USA#Utah\n| pushpin_relief = 1\n| pushpin_label  = Provo\n| pushpin_map_caption = Location in the United States##Location in Utah\n| broke_ground = October 1963\n| opened =\n| closed =\n| demolished =\n| publictransit =  UVX(at BYU Stadium station)\n| owner = Brigham Young University\n| operator = Brigham Young University\n| surface = Natural grass\n| construction_cost =\n| architect = Fred L. Markham\n| former_names = Cougar Stadium(1964–2000)\n| record_attendance = 66,247 (1993)(vs. Notre Dame)\n| seating_capacity = 62,073 (2024–present)\nFormer capacity:\n| tenants = BYU Cougars football (NCAA) (1964–present)BYU Cougars track and field (1964–1981)\n| website =\n}}\nLaVell Edwards Stadium is an outdoor athletic stadium in the Western United States, on the campus of Brigham Young University (BYU) in Provo, Utah. Primarily used for college football, it is the home field of the BYU Cougars, a member of the Big 12 Conference in the Football Bowl Subdivision. Opened as \"Cougar Stadium\" in 1964, its seating capacity is 62,073. It is the largest football stadium in the Big 12 by capacity.\nThe natural grass playing field is conventionally aligned north–south at an elevation of  above sea level, with the press box along the west sideline.\nHistory and seating\nOn the north end of campus, the stadium opened  in 1964 as Cougar Stadium, replacing a much smaller 5,000-seat venue of the same name. The first game on Friday night, October 2, was attended by 33,610, a state record. The original stadium, corresponding to the lower half of the current facility's grandstand seats, had a seating capacity of just over 28,800. Seating was soon added to make room for 35,000, and temporary bleachers in the end zones raised the capacity to 45,000.\nThe stadium was expanded in 1982 to accommodate more than 65,000; permanent concrete stands in the end zones, separated by entryways from the east and west grandstands, were put in place of the temporary bleachers. The playing field was lowered , and the running track was removed to make room for six additional rows.\nLaVell Edwards (1930–2016) was the head coach at BYU for 29 seasons, preceded by ten years as an assistant. He announced his retirement effective at the end of the 2000 season; the stadium was officially renamed in his honor immediately before his last home game as head coach. During the 2002 Winter Olympics, the stadium's parking lot was used as a park and ride lot for guests attending events at the Peaks Ice Arena and Soldier Hollow.\nRenovations\nThe stadium was renovated in 2003 to provide additional luxury seating, which reduced the capacity to 64,045. The luxury seating was a noticeable addition because the arrangement of blue and white seats in this section spells out BYU in block letters. In 2008, BYU unveiled a new video board on the north end zone on August 30, allowing fans seated in the south end zone to see the instant replays and graphics which previously were shown only on the south board. In addition, a brand-new addition to the stadium was the Cougar Marching Band Hall, which included a large rehearsal room, uniform storage space, band offices, instrument lockers, and video screens that assist in rehearsals.\nDuring the summer of 2010, the stadium's capacity was further reduced due to some renovations that allowed for more wheelchair accessibility. This brought the sellout capacity to 63,470.\nThe stadium underwent some upgrades before the 2012 season: new HD LED videoboards face the north and south end zones, replacing the outdated and smaller video screens, and they are flanked by video ribbons that stretch along the top of the north and south stands. The elevator shafts have been freshly coated to reflect the new BYU \"blue\" color scheme, each has the oval Y painted on it, and in 2013 the student section was unified into one area to seat the BYU student section instead of being scattered throughout the stadium.\nIn September 2021, upgrades to newer, larger video boards were completed along with larger video ribbons.  The dimensions of the old video boards were 34 by 50 feet, while the new dimensions of the new south board is 48 by 131 feet and the north board is 36 by 72 feet. The old north and south ribbon boards were four feet tall and were replaced with 8-foot ribbon boards.\nDuring the summer of 2024, before the 100th season of BYU football, the stadium underwent another renovation. The entire surface was removed and replaced maintaining the Kentucky blue grass natural turf. The players entrance was improved and new LED lights were installed to maintain light levels needed for HD/4K national broadcasting standards. The new lights also provide color and light-show options to add more to the in-game fan experience. Seating was renovated to include sections with tables as well as improved accessible seating options.  This reduced the seating capacity to the current 62,073.\nAttendance records\nTop 5 Attendances before 2003 Stadium renovations\n{| class=\"wikitable\"\n|-\n! style=\";\"|Attendance !! style=\";\"|Opponent !! style=\";\"|Year !! style=\";\"|Result\n|-\n| 66,247 || Notre Dame || 1993 || L 20–45\n|-\n| 66,235 || Miami || 1990 || W 28–21\n|-\n| 66,149 || Utah || 2001 || W 24–21\n|-\n| 66,110 || Utah || 1989 || W 70–31\n|-\n| 66,089 || Air Force || 1989 || W 44–35\n|-\n|}\nTop 5 Attendances after 2003 Stadium renovations\n{| class=\"wikitable\"\n|-\n! style=\";\"|Attendance !! style=\";\"|Opponent !! style=\";\"|Year !! style=\";\"|Result\n|-\n| 65,251 || Notre Dame || 2004 || W 20–17\n|-\n| 64,794 || Utah || 2025 || W 24-21\n|-\n| 64,749 || Utah || 2007 || W 17–10\n|-\n| 64,692 || Stanford || 2025 || W 27-3\n|-\n| 64,641 || TCU || 2009 || L 7–38\n|-\n|}\nTrack and field\nPrior to the 1982 expansion, it was the home venue for BYU's outdoor track and field teams and hosted the NCAA championships in 1967 and 1975. A new track facility was built just south of the stadium and later named for Clarence Robison, the Cougars' legendary track coach.\nJurassic fossils under the stadium\nPart of the largest collection of Jurassic period fossils in North America, housed at BYU, was stored underneath the east bleachers of the stadium until 2005.  The fossils have since been prepared and are on display in the BYU Museum of Paleontology's collection room.\nSecurity\nDue to installation of new features in the stadium, the grounds crew and BYU Police have installed a number of security features to prevent students from entering the stadium after hours, including infrared security cameras and motion detectors.\nGallery\nSee also\n* List of NCAA Division I FBS football stadiums\nFootnotes\nReferences\nExternal links\n*"
    }
  ]
}