{
  "content": [
    {
      "type": "text",
      "text": "# Lawrence Ward (serjeant-at-arms)__disambig_1\n\nLawrence Ward (born 1968) is a former postman who started his professional career with Royal Mail. From 2012 to 2015, he was the Serjeant at Arms of the British House of Commons and as such was responsible for its security, access and maintaining order.\nEarly life\nWard was born in London in 1968. He left school at 15 to work in an electronics company. At 16, he joined the two-year Youth Training Scheme as a postal cadet at the Royal Mail.\nCareer\nin 2012]]\nAt 18, he joined the management programme of Royal Mail, and became a supervisor. In 1997, having progressed his career to Senior Management, Ward was appointed the 18th postmaster for the House of Commons.\nHis responsibilities as Postmaster included overseeing postal services to Downing Street and managing the Court Postmaster at the Royal Household. His contribution to managing what was described by John Roberts, Royal Mail's CEO, as \"the Crown Jewels of the Post Office's contracts\" won him the national Commercial Manager of the Year award in 2001. Following the anthrax attacks delivered via the mail in the US, he led the development of pan-government mail screening services. Working with security agencies both in the UK and the US, he introduced advanced processes and technologies for the screening of mail across Whitehall. With a developing expertise in security, he was asked to take on a permanent position at Parliament in 2006 managing its contract with the Metropolitan Police Service.\nHe was appointed Assistant Serjeant at Arms in 2008 with responsibility for the operation of the Chamber and Commons Committees. During a heated debate on building a third runway at Heathrow airport in January 2009, John McDonnell MP, grabbed the Mace and attempted to proceed with it from the Chamber. McDonnell later said \"they stopped me before I got out of the Chamber and I wasn't going to struggle with someone wearing a huge sword on their hip”. Ward received a letter from the Speaker that recognised the dignified manner with which the incident had been resolved.\nThroughout the early 2000s, the UK Youth Parliament had sought to hold their annual debate in the House of Commons Chamber, and this was contentious as some MPs and officials disliked the idea of the Commons Chamber being used for that purpose. The initiative was supported by Prime Minister Gordon Brown and Speaker John Bercow and a vote to allow its use for the debate saw 189 MPs voting in favour, with 16 votes against. Ward told the BBC that he supported the initiative and had personally volunteered to lead the planning of the inaugural sitting. On Friday 30 October 2009, the debate took place, representing the first time the House of Commons Chamber had been used by a group other than MPs.\nAs Assistant Serjeant, Ward was responsible for some administration of State visits by the President of the United States, Barack Obama, and Pope Benedict XVI. He was cited on the front pages of The Times and The Guardian in 2011 when he hand delivered the summons' for Rupert Murdoch and James Murdoch to appear at the Culture, Media and Sport Select Committee to answer questions relating to the News International phone hacking scandal. In November 2011, he was appointed acting Deputy Serjeant at Arms. On 1 May 2012, Queen Elizabeth II appointed him the 40th Serjeant at Arms of the House of Commons.\nIn March 2013, Ward oversaw the arrest of Eric Joyce MP following a brawl at a bar in the House of Commons. Two months later, Ward was again involved in an historic event when he approved and supervised the searching of a Member’s office by Lancashire Police. The Deputy Speaker, Nigel Evans, had been arrested following allegations, later disproved, of rape and sexual assault. Working with the Speaker, and seeking advice from the Attorney and Solicitors’ General, he ensured lessons had been learned from when Damien Green’s office had been similarly searched in 2009. Specifically, legal safeguards, including a search warrant, were in place prior to the commencement of the search.\nWard was an advocate of greater accessibility to the House of Commons and was the Senior Responsible Officer for the development of Parliament's education centre on Victoria Tower Gardens. He narrated a number of educational videos to promote accessibility to, and procedural understanding of, the House of Commons Chamber. He lobbied Committees to liberalise filming regulations and this led to documentary maker Michael Cockerell being given unprecedented access to film the BBC's Inside the Commons series. The first feature film to be made within the precincts of Parliament soon followed when Suffragette was filmed there in 2014. His work on public engagement led to him being awarded House Officer of the Year in 2015 at the Asian Voice Political and Public Life Awards.\nHe announced his intention to stand down on 20 September 2015 and tributes were paid to him on the floor of the House, led by the Speaker, the Leader and Shadow Leader of the House, on 17 September 2015. He described his time in the role in interviews with the BBC's Daily Politics and Radio 4's The Westminster Hour,\nSince September 2015 he has reportedly worked in the private sector as the Global Head of Security for an international consultancy and technology company.\nReferences"
    }
  ]
}