{
  "content": [
    {
      "type": "text",
      "text": "# Le Fil (drag queen)\n\n| birth_date    =\n| birth_place   = Brighouse, West Yorkshire, England\n| death_date    =\n| death_place   =\n| occupation    = Drag performer\n| television    = ''RuPaul's Drag Race UK (series 4)Canada's Drag Race: Canada vs. the World (season 2)\n| education     =\n| website       =\n}}\nLe Fil is the stage name of Philip Simon Li, a British artist, drag performer and singer-songwriter who competed on the fourth series of RuPaul's Drag Race UK and the second season of Canada's Drag Race: Canada vs. the World''.\nCareer\nLe Fil is an artist, drag performer and singer. The first time they performed as Le Fil was at their debut solo art exhibition \"Pop Sculpture: The Filosophy of Making\" at Camberwell Space art gallery featuring their ceramic sculptures, drawings and live music performance. Le Fil's debut extended play (EP) Pop Sculpture was released in 2012. This was followed by the release of his second EP Nightlife in 2015 which was produced by Frankmusik. Nightlife had five singles which all received music videos, including the single \"24/7\". The music video was filmed in Chinatown London.\nLe Fil is a member of LGBTQ collective Sink The Pink and toured with Spice Girl Melanie C and has appeared in British Vogue.\nLe Fil competed on series 4 of ''RuPaul's Drag Race UK''. Le Fil impersonated Marie Kondo on the Snatch Game challenge, which was the sixth episode of the season. They placed in the bottom two of the challenge, and were eliminated after losing a lip sync against Black Peppa to \"Stop\" (1998) by the Spice Girls, achieving seventh place in the competition. After the show aired, Le Fil toured with her fellow cast members.\nLe Fil's five-track extended play (EP) Le Filosophical was released in 2022. Their single \"This Is My Culture\" received a music video. In 2023, Le Fil released the single \"Splash Zone\".\nPersonal life\nLe Fil is from Brighouse, and is of Chinese ancestry. Growing up, they were on the same school choir as Divina de Campo. They use the pronouns he/him and they/them in and out of drag. Le Fil cites Andy Warhol as one of their main artistic influences.\nDiscography\nEPs\n* Nightlife (2016)\n* Le Filosophical (2022)\n* Le Filosophical - Part II (2022)\nSingles\nAs main artist\n* Genesis (2016)\n* Beautiful Game (2019)\n* Boyo (2020)\n* Undercover Lover (2020)\n* Put Your Money Where Your Mouth Is (2020)\n* Movie Love (2020)\n* Ready 4 U (2022)\n* P.U.D.S.E.Y. (2022)\n* Pick up the Trash (2022)\n* Feeling so Good (2022)\n* Splash Zone (2023)\n* Break This Cycle (2024)\n* Le Fil Me Up (2024)\nAs featured artist\n* Serotonin  (2025)\nFilmography\nTelevision\n* ''RuPaul's Drag Race UK (series 4)\n* Canada's Drag Race: Canada vs. the World (season 2)\n* Bring Back My Girls'' (2024)\nReferences\nExternal links\n*"
    }
  ]
}