{
  "content": [
    {
      "type": "text",
      "text": "# League of the Three Emperors\n\nThe League of the Three Emperors or Union of the Three Emperors () was an alliance between the German, Russian and Austro-Hungarian Empires, from 1873 to 1887. Chancellor Otto von Bismarck took full charge of German foreign policy from 1870 to his dismissal in 1890. His goal was a peaceful Europe, based on the balance of power. Bismarck feared that a hostile combination of Austria-Hungary, France, and Russia would crush Germany. If two of them were allied, then the third would ally with Germany only if Germany conceded excessive demands. The solution was to ally with two of the three. In 1873 he formed the League of the Three Emperors, an alliance of the Kaisers of Germany and Austria-Hungary and the Tsar of Russia. Together they would control Eastern Europe, making sure that restive ethnic groups such as the Poles were kept in control. It aimed at neutralizing the rivalry between Germany's two neighbors by an agreement over their respective spheres of influence in the Balkans and at isolating Germany's enemy, France. The Balkans posed a more serious issue, and Bismarck's solution was to give Austria predominance in the western areas, and Russia in the eastern areas.\nThe first League of the Three Emperors was in effect from 1873 to 1878. A second one was established June 18, 1881, and lasted for three years. It was renewed in 1884 but lapsed in 1887. Both alliances ended because of continued strong conflicts of interest between Austria-Hungary and Russia in the Balkans. The second treaty provided that no territorial changes should take place in the Balkans without prior agreement and that Austria could annex Bosnia and Herzegovina when it wished; in the event of war between one party and a great power not party to the treaty, the other two parties were to maintain friendly neutrality.\nBismarck was able to temporarily preserve ties with Russia in the Reinsurance Treaty of 1887; but, after his dismissal, this treaty was not renewed, and a Franco-Russian alliance developed.\"Dreikaiserbund\". Encyclopædia Britannica. Encyclopædia Britannica Online.\nEncyclopædia Britannica Inc., 2016. Web. 10 Feb. 2016\n.\nFirst agreement (1873)\nin 1873]]\nOn 22 October 1873, Bismarck negotiated an agreement between the monarchs of Austria-Hungary, Russia and Germany. The alliance sought to resurrect the Holy Alliance of 1815 and act as a bulwark against radical sentiments that the rulers found unsettling. It was preceded by the Schönbrunn Convention, signed by Russia and Austria–Hungary on 6 June 1873.\nPolicy\nBismarck often led the League as it assessed challenges, centred on maintaining the balance of power among the states involved and Europe at large. The cornerstone of his political philosophy included preserving the status quo and avoiding war. Despite German victory in the Franco-Prussian War of 1870–1871, violence remained fresh in the new state's memory and made Germany reluctant to antagonize France but keen as ever to limit its power.\nAccording to the coalition, radical socialist bodies like the First International represented one of the other key threats to regional stability and dominance. The League actively opposed the expansion of its influence.\nThe League also met crisis in the Eastern Europe, where Bulgarian unrest elicited violent reaction from the Ottoman forces there, which, in turn, met with horror from observing states. The account of the insurrection from an Englishman, Sir Edwin Pears, describes the gruesome atrocities and reveals British surprise at their extent.\nFirst dissolution (1878)\nThe collective initially disbanded in 1878 over territorial disputes in the Balkans as Austria-Hungary feared that Russian support for Serbia might ultimately ignite irredentist passions in the Slav populations. Russian authorities, likewise, feared insurrection if a Pan-Slavist movement gained too much power.\nThe body's first conclusion in 1879 gave way to the defensive Dual Alliance between Austria-Hungary and Germany to counter potential Russian aggression. In 1882, Italy was included in a second agreement, the Triple Alliance, but the Triple Alliance never replaced the Dual Alliance, which remained in effect.\nRevival (1881–1887)\nin 1884.]]\nThe Treaty of Berlin (1878) made Russia feel cheated of its gains in the Russo-Turkish War. Its key role in European diplomacy was not, however, forgotten by Bismarck. A more formal Three Emperors' Alliance was concluded on 18 June 1881. It lasted for three years, and was renewed at Skierniewice in 1884, but lapsed in 1887. Both alliances ended because of conflicts between Austria-Hungary and Russia in the Balkans. To preserve a common understanding with Russia, Germany signed the mutual Reinsurance Treaty in 1887.\nAlthough the Russians considered it humiliating and prevented them using their Black Sea Fleet elsewhere, the closure of the Straits to foreign warships, included in the treaties of 1881 and 1884, meant there was little reason to maintain their fleet in the Black Sea.\nSee also\n* Holy Alliance\n* Triple Intervention\n* International Squadron\n* Eight-Nation Alliance\n* International relations (1814–1919)\n* Three Emperors' Corner\nReferences\nSources\n*\n*\n* Langer, William. European Alliances and Alignments 1870–1890 (2nd ed. 1950), pp.&nbsp;197–212\n* Medlicott, W. N. \"Bismarck and the Three Emperors' Alliance, 1881-87,\" Transactions of the Royal Historical Society Vol. 27 (1945), pp.&nbsp;61–83 [https://www.jstor.org/stable/3678575 online]\n* Meyendorff, A. \"Conversations of Gorkachov with Andrassy and Bismarck in 1872,\" The Slavonic and East European Review (1929) 8#23 pp.&nbsp;400–08. [https://www.jstor.org/stable/4202407 in JSTOR]\n* Schroeder, Paul W. \"Quantitative Studies in the Balance of Power: An Historian's Reaction,\" The Journal of Conflict Resolution (1977) 21#1 pp.&nbsp;3–22. [https://www.jstor.org/stable/173680 in JSTOR]\n* Taylor, A.J.P. The Struggle for Mastery in Europe 1848–1918 (1954)"
    }
  ]
}