{
  "content": [
    {
      "type": "text",
      "text": "# League of Revolutionary Black Workers\n\nThe League of Revolutionary Black Workers (LRBW) was formed in 1969 in Detroit, Michigan.  The League united a number of different Revolutionary Union Movements (RUMs) that were growing rapidly across the auto industry and other industrial sectors—industries in which Black workers were concentrated in Detroit in the late 1960s and early 1970s. The formation of the League was an attempt to form a more cohesive political organ guided by the principles of Black liberation and Marxism-Leninism in order to gain political power and articulate the specific concerns of Black workers through political action. While the League was only active for a short period of time, it was a significant development in a time of increasing militancy and political action by Black workers and in the context of both the Black liberation and Marxist–Leninist movements in the United States.\nBackground\nThere were a number of factors, particularly social and political developments, throughout the 1950s and 1960s which created the foundation upon which a revolutionary Black workers movement was formed. One of the most important factors was the mood of Black rebellion in Detroit, and indeed throughout the U.S., and the increasing political development among Black workers in Detroit. The 1967 Detroit riot was one of the largest and most violent of a number of urban insurrections that swept the U.S. between 1964 and 1968. The Detroit insurrection was led by Black working class youth, some of whom were adopting the teachings of Marxism–Leninism and incorporating this ideology into their writings and actions. Many of those who would later lead the League of Revolutionary Black Workers were involved in the insurrection, including John Watson, who began publishing a radical ghetto newspaper called \"The Inner City Voice\" in September 1967, following the intense repression of the uprising.\nIn addition to increasing militancy and revolutionary consciousness in the Black working class movement, the conditions of the trade union movement in Detroit, and particularly in the auto industry, played a significant role in the creation of the LRBW. During the intense labor shortages as a result of WWII, Black workers were hired in significant numbers, particularly in the auto industry. While there was a union in the auto industry, the United Auto Workers (UAW), most Black workers felt alienated from the union's majority white leadership and perceived the union in the same vein as the government and the bosses for its failure and outright refusal to meaningfully take up the growing concerns of Black workers in the auto industry.\nWith the social and working conditions of many Black workers deteriorating, many Black workers concentrated in the auto industry, an unrepresentative and, at times, even hostile union, and a growing spirit of militancy of revolutionary vision among these workers, the conditions were ripe for the development of a working-class movement to directly engage Black workers and to build a political organization to fight for their interests.\nThe League's Formation\nThe formation of the League of Revolutionary Black Workers finds its roots in a wildcat strike  which took place on May 2, 1968. The strike, which occurred at the Dodge Main factory, was organized in response to a speedup in the lines. Although the wildcat strike was led by a coalition of workers, including Polish women workers and Black workers, punishment following the action was disproportionately landed upon Black workers. Seven people, including five Blacks, were fired following the action, with all but two, General G. Baker Jr. and Bennie Tate, eventually rehired. Following the strike, nine workers from the plant formed close relationships with the editors of \"The Inner City Voice\", and decided to form the first Revolutionary Union Movement, called the Dodge Revolutionary Union Movement (DRUM).\nFollowing the creation of DRUM, the workers and the editors of the newsletter began to circulate a newsletter inside the plant with the same title. The newsletter was designed to build political consciousness among Black workers and articulate the main concerns of Black workers. The newsletter targeted the work conditions in the plant, the plant's bosses, and the leadership of the UAW. One of the largest actions that DRUM organized was a wildcat strike which took place on July 7, 1968. The strike addressed both the working conditions in the plant and the inability of the UAW to represent and address the needs of Black workers in the auto industry. The rally and wildcat strike brought together a number of Black community groups and radical white organizations, and was deemed a success by the leadership of DRUM. Following this action, DRUM organized a number of other successful actions and events directed against their two main enemies: the bosses at the Chrysler factory and the UAW.\nAfter the successful development of DRUM, a number of other revolutionary union movements began developing at other plants throughout 1968 and early 1969, including the Ford Revolutionary Union Movement (FRUM) and Eldon Avenue Revolutionary Union Movement (ELRUM), both of which carried out increasingly militant and successful actions against the bosses in their factories and the UAW leadership. The spread of RUMs was not only limited to the auto industry, with developments among the United Parcel Service workers (UPRUM), health workers (HRUM), and among Detroit News workers (NEWRUM).\nAs more and more revolutionary union movements began to form at plants across Detroit, it became clear that a more advanced and centralized organization would be needed to provide leadership to this growing movement among Black auto workers. In the June 1969, the League of Revolutionary Black Workers was formed, with The Inner City Voice as its official newspaper.\nOrganization of the League\nThe League quickly grew to include around 80 central members and a seven-person executive committee including: General Baker, Kenneth Cockrel, Mike Hamlin, Luke Tripp, John Watson, John Williams, and Chuck Wooten.\nDespite its ideological coherence, there were several schools of thought within the League about the most effect tactics for the organization to pursue. The first school of thought was most heavily emphasized by General Baker and Chuck Wooten. This tendency within the organization stressed the importance of in-plant organizing and the creation of new revolutionary union movements as the primary concern of the organization, and viewed other tasks as secondary to this goal.\nThis idea is perhaps most clearly articulated in the League's constitution, which stated:\nWe must act swiftly to help organize DRUM type organizations wherever there are Black workers, be it in Lynn Townsend's kitchen, the White House, White Castle, Ford Rouge, the Mississippi Delta, the plains of Wyoming, the mines of Bolivia, the rubber plantations of Indonesia, the oil fields of Biafra, or the Chrysler plant in South Africa.\nThe second tendency or school of thought within the League stressed the importance of building community ties and organizations to support the work of the workers in the factories, and thus was dubbed the out-of-plant tendency. The key proponents of this strategy were Mike Hamlin, John Watson, and Ken Cockrel. This group within the League believed that it was just as important to build connections with students, community and neighborhood organizations, and white radicals as it was to build new RUMs in the plants. Not only were these three leaders concerned about the individual RUMs becoming isolated or divorced from the larger working class movement, but they believed that communities and students played a vital role in supporting the work of the RUMs in the factories and advancing the demands of the workers. Additionally, they viewed media, in the form of films and newspapers, as a vital instrument for educating the masses of workers and building a movement which could combat capitalism.\nThe third tendency in the League consisted of Luke Tripp and John Williams, who walked a middle road between the other two schools of thought. Tripp and Williams were primarily concerned with developing the political consciousness of both League supporters outside of the plant and workers that were involved in the RUMs inside the plants. Additionally, they were concerned about either of the other two tendencies becoming too ambitious without first laying the groundwork for what they viewed as key to developing a revolutionary workers movement supported by the community. Primarily, they were concerned about other League leaders' ideas about spreading the League to other cities without first perfecting the organization in Detroit, and viewed smaller, social political meetings with workers, students and community members as key to developing a revolutionary working class movement.\nBlack Workers Congress\nThe beginning of a party split began in 1970 with the creation of the Black Workers Congress, which, while making a strong presence at their initial conference, existed basically as a paper organization and eventually burned out.  Many of the Black Workers Congress resigned over ideological differences concerning conceptual frameworks, location of priorities, and social relations.  Other problems arose between in-plant organizing, community activism, and the role of intellectuals.\nThe Easter Purges\nIn a meeting of the Central Staff called by the Executive Board, John Williams asserted there was some contention about how various members saw the League.  Some saw the goal as building a Black Vanguard Party, some wished to build a multi-racial Vanguard Party, some thought that League members should run for public office, and some believed the League should build soviets (workers councils) in the factories. This latter tendency and later disputes about the merits of aspiring to build a vanguard party may be overlooked influences of the Pan Africanist and Trotskyist CLR James, whose Facing Reality group was based in Detroit and mentored many members of the League.\nIn April 1971, what were recalled as \"the Easter Purges\" occurred . Modibo Kadalie (E.C. Cooper), Ernie \"Mkalimoto\" Allen, Loren \"Imara Hyman\" Small, Sonny Hyman, Zondalin Hyman, Shola Akintolaya, and Makeba Jones. All of these figures were fighting for greater democracy in the League. They were not one intellectual tendency but represented aspects of Maoism, Black Nationalism, a contempt for sexism, and an autonomous Marxism projecting a type of direct democracy, that was resisting the increasing arbitrary and centralized behavior of the core leadership of the League.\nThe Communist League\nAccording to the book Detroit, I Do Mind Dying by Dan Georgakas and Marvin Surkin, the split within the Detroit-based League of Revolutionary Workers became public on June 12, 1971. \"By the first of the year, those who remained in the League were making plans to affiliate what was left of the organization with a group called the Communist League. The League of Revolutionary Black Workers had become history.\" (page 164).\nWith the merging of the Communist League and a section of the League of Revolutionary Black Workers, the Communist League acquired a large grouping of black industrial workers familiar with the writings of Marx, Lenin and Mao. Elbaum speculates that the Communist League may have had more blacks, Chicanos and women in its leadership than perhaps any communist group in American history. (page 103)\nIn Detroit the Communist League formed a working relations with the Motor City Labor League (MCLL), which had also experienced a political split similar to the League of Revolutionary Black Workers, with one section combining with the Communist League in launching itself nationally as the Communist Labor Party in 1974. One section of the MCLL merged with the Communist League and another sector merged with the grouping split from the old League of Revolutionary Black Workers (LRBW). The former was expressed as activists like the anti-war veteran Frank Joyce and the later by Shelia Murphy who would later win numerous elections as Councilperson in Detroit and marry Kenneth Cockrel, a leader of the faction within the LRBW that did not join the Communist League.\nThe Communist League and then the Communist Labor Party viewed its distinguishing political and theoretical feature as its presentation of what it called \"The Negro National Colonial Question,\" by Nelson Peery, first edition published by the Communist League, 1972. In 1976 and again in 1978 the Communist Labor Party conducted \"Vote Communist\" campaigns running General Baker Jr. for State Representative in the Michigan House. They continued to work with the CPUSA, while opposing much of their ideology, until 1993 when they disbanded and refounded their group as the League of Revolutionaries for a New America.\nReferences\n* Ernie Allen. \"Dying from the Inside: The Decline of the League of Revolutionary Black Workers.\" In They Should Have Served That Cup of Coffee: Seven Radicals Remember the 1960s. Dick Cluster ed. Boston: South End Press, 1979. 71-109.\n*Dan Georgakas and Marvin Surkin.  Detroit: I Do Mind Dying.  South End Press, 1998.\n*James A. Geschwender.  Class, Race, and Worker Insurgency: The League of Revolutionary Black Workers. New York: Cambridge University Press, 1977.\n* Modibo Kadalie. \"From One Generation to the Next: The Enduring Legacies of Kimathi Mohammed.\" Introduction to Organization & Spontaneity: The Theory of the Vanguard Party and its Application to the Black Movement in the U.S. Today. By Kimathi Mohammed. Updated Edition. Atlanta: OOOA, 2013. 11-30.\n*[https://www.imdb.com/title/tt10328050/ Finally Got the News], a documentary that reveals the activities of the League of Revolutionary Black Workers inside and outside the auto factories of Detroit.\nNotes\nExternal links\n*[https://reuther.wayne.edu/node/2463 Detroit Revolutionary Movements Records], consisting of primary documents donated to the Walter P. Reuther Library by General Baker. The collection documents the Dodge Revolutionary Union Movement and League of Revolutionary Black Workers, as well as related organizations, from 1968 to 1976.\n*[https://web.archive.org/web/20091027141742/http://www.geocities.com/CapitolHill/Lobby/2379/lrbw.htm  The League of Revolutionary Black Workers: A Historical Study] by A. Muhammad Ahmad\n*\n*Martin Glaberman, [http://www.marxists.org/archive/glaberman/1969/04/drum.htm The Dodge Revolutionary Union Movement], April/May 1969."
    }
  ]
}