{
  "content": [
    {
      "type": "text",
      "text": "# Leathernecking\n\n| starring       = Irene DunneEddie Foy Jr.\n| music          = Victor BaravalleOscar LevantSidney Clare\n| cinematography = J. Roy Hunt\n| editing        = George Marsh\n| studio         = RKO Productions\n| distributor    = RKO Productions\n| released       =  |ref2= }}\n| runtime        = 79 min.\n| country        = United States\n| language       = English}}\nLeathernecking is a 1930 American musical comedy film directed by Edward F. Cline, from a screenplay by Alfred Jackson and Jane Murfin, adapted from the Broadway musical comedy Present Arms, by Richard Rodgers, Lorenz Hart and Herbert Fields.\nAlthough based on a musical, it used only two of the original Rodgers and Hart songs from the Broadway hit, along with original songs, including three by Oscar Levant and Sidney Clare. An early part-color feature film with a Technicolor insert, this film was Irene Dunne's film debut.\nPlot\nChick Evans is a Marine private in Honolulu, Hawaii.  He falls for society girl Delphine Witherspoon, and begins to scheme as to how to win her over.  His first plan involves impersonating an officer in order to get invited to a society party. However, when his Marine buddies decide to crash the party as well, his real rank is revealed, and so having the opposite effect on Delphine as he had planned.\nDespondent, he bares his soul to a mutual friend, Edna, who arranges to have the two reunited on Delphine's yacht at sea.  However, this meeting goes terribly wrong as well, and a desperate Chick convinces the yacht's captain to fake a shipwreck in order to give him time to win Delphine over.  Unfortunately, a real storm arises and the ship is actually wrecked, coming to rest on a desert island. While they are on the island, Chick's persistence with Delphine pays off. Not only that, on their return to Honolulu, he is hailed as a hero and promoted to captain.\nCast\n* Irene Dunne as Delphine Witherspoon\n* Ken Murray as Frank\n* Louise Fazenda as Hortense\n* Ned Sparks as Reynolds (Sparks)\n* Lilyan Tashman as Edna\n* Eddie Foy Jr. as Chick Evans\n* Benny Rubin as Stein\n* Rita La Roy as Fortune Teller\n* Fred Santley as Douglas\n* William von Brinken as Richter\n* Carl Gerard as Colonel\n* Werther Weidler as Richter's son\n* Wolfgang Weidler as Richter's son\n(Cast list as per AFI database)\nSongs (partial list)\n*\"You Took Advantage of Me\"\n*\"A Kiss For Cinderella\"\n*\"All My Life\"\n*\"Careless Kisses\"\n*\"Evening Star\"\n*\"Mighty Nice and So Particular\"\n*\"Shake It Off and Smile\"\n\"You Took Advantage Of Me\" and \"A Kiss For Cinderella\", the first two songs, were written by Rodgers and Hart. The other songs were written by Oscar Levant and Sidney Clare, except for \"All My Life\", which had words and music by Benny Davis and Harry Akst.\nNotes\nA copy of the film survives in the Warner Bros. film vault. The musical comedy on which this film was based, Present Arms, ran from April through September 1928 at Lew Fields' Mansfield Theatre (currently the Brooks Atkinson Theatre).  Produced by Lew Fields, it had music by Richard Rodgers, lyrics by Lorenz Hart, with a book by Herbert Fields. It starred and was choreographed by Busby Berkeley.\nThe John Tiller Sunshine Girls also appeared in this film.\nIn 1958, the film entered the public domain in the United States because the claimants did not renew its copyright registration in the 28th year after publication.\nSee also\n* List of early color feature films\nReferences\nExternal links\n*"
    }
  ]
}