{
  "content": [
    {
      "type": "text",
      "text": "# Lebanon-Warren County Airport\n\n, effective 2023-10-05\n}}\nLebanon-Warren County Airport  is a public airport located three miles (5&nbsp;km) northwest of the central business district of Lebanon, on Greentree Road, in Warren County, Ohio, United States.\nIt is a county-owned public airport operated by the Warren County Airport Authority, a board of 9 members appointed by the County Commissioners. The runway, taxiway, and communication and navigation aids are County owned. The Airport Authority leases a terminal for public use on adjacent private property. The hangars, and other airport buildings are privately owned and operated. Daily airport management is handled under contract by fixed-base operator (FBO), Warren County Airport, Ltd.\nFacilities\nRunway\nThere is one North-South Runway (01/19). The runway is 4502' x 75' asphalt paved with lighting for night operation. The runway has displaced thresholds on both ends to clear obstructions. Airport elevation is 898'. There is a taxiway parallel to the runway.\nAirport commissioners have been at odds with the Federal Aviation Administration over how best to upgrade the airport's facilities in recent years. In 2016, Warren County decided to foot the entire bill to repave taxiways at the airport instead of redo the airport's facilities in order to secure federal funding.\nNavigation and Communications aids\n* MIRL Runway & Taxiway lights\n* PCL Pilot Controlled Lighting - Frequency 123.075\n* REIL - Runway End Identification Lights\n* Rotating beacon - White-Green\n* Wind sock near center of runway, between runway and taxiway\n* 4 light PAPI\n* AWOS Automated Weather Observation System - Frequency 120.550, By Phone 513-934-5500\n* UNICOM - Frequency 123.075\n* Online weather information service in terminal building\nPrivately operated airport services\nThe airport has a fixed-base operator that offers many of the following services:\n* Aviation Fuel\n* Hangar Rental\n* Pilot training\n* Aircraft Rental\n* Aircraft Charters\n* Warren County Career Center - Aerospace Academy\n* Miami Valley Hospital CareFlight helicopter base and helipad\n* Home of the USU Wright Flyer replica built for the 100th anniversary of aviation held in 2003\n* Skydiving\n* Helicopter Training, rides, photo flights, and other helicopter services\n* Hot air ballooning\nThree new hangars were built at the airport in 2012 at a cost of $1.7 million.\nAircraft\nFor the 12-month period ending August 4, 2021,  the airport had 31,550 aircraft operations, an average of 86 per day: 98% general aviation, 2% air taxi and\nAccidents and incidents\n* On December 28, 2011, a Piper PA-28 collided with power lines while operating at the Warren County Airport. The pilot was attempting to return to the airport after the door latch on the door opened. After going around on the first landing attempt, the engine made a \"loud popping sound\" and immediately lost power; the aircraft's stall warning system also activated. The pilot attempted a forced landing but clipped the power lines, causing the aircraft to hit trees and nose over into the field where the pilot attempted to land. Two passengers and the pilot walked away, while another passenger was taken to the hospital in critical condition. The probable cause of the accident was found to be the pilot’s inadvertent positioning of the fuel selector valve between the right tank and OFF position, which resulted in fuel starvation and a total loss of engine power.\n* On June 4, 2014, a Piper PA-32 was substantially damaged while landing at the Warren County Airport. The pilot reported turbulence and wind gusts on approach to landing but that the air became call 300 feet above the ground. After the wheels touched down on the runway, a large wind gust pushed the airplane off the runway and onto the infield grass. The pilot attempted a go-around, but the aircraft did not gain altitude, and the pilot subsequently lost control. The airplane veered right, crossed the runway and travelled up an embankment. The probable cause of the accident was found to be the pilot's failure to maintain directional control of the airplane during landing, which resulted in a runway excursion.\n* On October 18 2020, a small plane made an emergency landing in a nearby cornfield while attempting to land at the airport.\nSee also\n*List of airports in Ohio\nReferences\nExternal links\n*\n*[http://www.dot.state.oh.us/aviation/ Ohio Department of Transportation - Aviation Division]\n*[http://saiawos3.com/I68/index2.html Online AWOS display]\n*"
    }
  ]
}