{
  "content": [
    {
      "type": "text",
      "text": "# Lech Browary Wielkopolski\n\n| active_beers     = Dębowe Mocne, Gingers, Lech, Miller, Redd’s, Żubr\n| seasonal_beers   =\n| other_beers      =\n| inactive_beers   =\n}}\n}}\nLech Browary Wielkopolski (; English: Lech Breweries of Greater Poland) is a big industrial brewery in Poznań, with a production capacity of 7.5 million hl. The plant is owned by Asahi Breweries subsidiary Kompania Piwowarska SA.\nHistory\nThe modern brewing plant in Poznań was built between 1975 and 1980. In 1984, a malthouse was added. By 1992, along with other brewers, it was part of Wielkopolskie Zakłady Piwowarsko-Słodownicze SA, but after 1992, it became the company's main production facility, Lech Browary SA. In 1993, the ministry decided to privatize the ownership of the brewery. As a result of the tender a majority shareholder in the company was Euro Agro Centrum Poznań, owned by entrepreneur Jan Kulczyk.\nIn 1996, the brewery was taken over by South African Breweries, which in the same year, together with Jan Kulczyk, purchased the Tyskie Brewery. Three years later, the two breweries were combined to form Kompania Piwowarska.\nOn 11 March 2007, at the newly opened section of the brewery, the world's biggest beer mug was erected and filled with Lech Pils beer, setting a Guinness world record for the largest number of people drinking from one mug, which included 4250 liters of beer. The establishment of the record was attended by 10,625 people.\nOn 31 July 2010, an advertisement containing words \"Zimny Lech\" (Cold Lech) was placed near Wawel. The controversy was that in Polish, \"zimny Lech\" means both cold Lech (beer), and can coincidentally mean cold (body of) Lech (Kaczyński), the former president of Poland, who was buried in Wawel on 18 April 2010. On 2 August 2010, it was announced that the advertisement would be removed from near Wawel, as well as from other cities.\nIn 2017, Kompania Piwowarska was acquired by Asahi.\nReferences\nExternal links\n*[http://www.zwiedzaniebrowaru.pl/ Centrum Wycieczkowe Lech]\n*"
    }
  ]
}