{
  "content": [
    {
      "type": "text",
      "text": "# Leckhampton Hill and Charlton Kings Common__disambig_1\n\n|coordinates =\n|area=63.8hectare\n|notifydate=1954\n|enref=1001777\n}}\nLeckhampton Hill and Charlton Kings Common () is a  biological and geological Site of Special Scientific Interest in Gloucestershire, notified in 1954.  There are five units of assessment.\nThe site is listed in the 'Cotswold District' Local Plan 2001-2011 (on line) as a Key Wildlife Site (KWS).\nLocation\nThe site is in the Cotswold Area of Outstanding Natural Beauty and is one of a series of unimproved Jurassic limestone grassland area which are located along the Cotswold scarp. It is south of Cheltenham and near the communities of Leckhampton and Charlton Kings, and has a north-facing aspect.  The site also includes disused quarry faces, and quarry spoil which has been vegetated.\nGeology\nThe Leckhampton quarries expose the thickest single cross-section through the Middle Jurassic, Inferior Oolite strata of the area.  They are a major research interest, and there are many published accounts of the last 150 years.  Strata of some 60 m are exposed, and the large outcrops are of significant importance to those studying palaeontology or sedimentology, and for studying ancient environments generally.\nBiology\nThe site supports a range of habitats which include unimproved calcareous grassland, woodland and scrub, cliff faces and scree slopes. The grassland is of major importance and it comprises a tall ungrazed sward.  This is dominated by tor-grass, upright brome,  meadow oat-grass, sweet vernal-grass and quaking grass. It is noted for its range of herbs which include salad burnet, common rock-rose, common bird's-foot-trefoil.  The quarry floors support wild thyme, dwarf thistle, yellow-wort and autumn gentian. The site supports many plants which are scarce at a national or county level.  These include fly orchid, musk orchid and purple milk-vetch.  It is one of a small number of sites which support meadow clary in the county.\nShrub areas support nesting birds such as meadow pipit and grasshopper warbler.  It is a shelter area for invertebrates and small mammals.\nThere are wooded areas of broad-leaved and coniferous trees including mature beech.  These areas support a woodland flora such as ivy broomrape, white helleborine and greater butterfly-orchid.\nThere is a reported population of adder.\nSee also\n*\nReferences\nSSSI Source\n* [http://www.sssi.naturalengland.org.uk/Special/sssi/sssi_details.cfm?sssi_id=1001777 Natural England SSSI information on the citation]\n* [http://www.sssi.naturalengland.org.uk/Special/sssi/unitlist.cfm?sssi_id=1001777 Natural England SSSI information on the Leckhampton Hill and Charlton Kings Common units]\nExternal links\n* [http://www.naturalengland.org.uk Natural England] (SSSI information)\nImage:View from Leckhampton Hill - geograph.org.uk - 976826.jpg|View from Leckhampton Hill\nImage:Path junction, Leckhampton Hill - geograph.org.uk - 976909.jpg|Paths on Leckhampton Hill\nImage:Toposcope on Leckhampton Hill - geograph.org.uk - 654244.jpg|Toposcope on Leckhampton Hill\nImage:Cotswold Way, Leckhampton Hill - geograph.org.uk - 976948.jpg|Cotswold Way on Leckhampton Hill\nImage:Cliffs on Leckhampton Hill - geograph.org.uk - 480138.jpg|Cliff faces on Leckhampton Hill\nImage:Devils Chimney 062515.JPG|Devil's Chimney, Leckhampton Hill\nImage:Lower slopes of Charlton Kings Common. - geograph.org.uk - 36772.jpg|Lower slopes of Charlton Kings Common\nImage:Footpath, Charlton Kings Common - geograph.org.uk - 36769.jpg|Footpath on Charlton Kings Common"
    }
  ]
}