{
  "content": [
    {
      "type": "text",
      "text": "# Ledger (software)\n\n| latest release version =                                              | latest release date    = |df=yes}}\n| latest preview version =\n| latest preview date =\n| operating system = Any Unix-like including macOS, Microsoft Windows\n| platform = Cross-platform\n| language = C++\n| status =\n| genre = Double-entry bookkeeping system\n| license = BSD-3-Clause\n| website =\n}}\nLedger is a command-line based double-entry bookkeeping application. Accounting data is stored in a plain text file, using a simple format, which the users prepare themselves using other tools. Ledger does not write or modify data, it only parses the input data and produces reports.\nReviews\nLinux Weekly News editor Jonathan Corbet found Ledger to be a \"powerful tool\", particularly for generating reports, but that the software lacked many of the features necessary to scale to the needs of a small business. }} Joe Barr writing for Linux.com commented \"If you're an MBA who groks Emacs and regular expressions, or a kernel hacker who appreciates tax deferred accruals, you'll love this application.\" }}\nFLOSS Weekly interviewed John Wiegley in 2011. It noted reading of GnuCash files, scriptability, an Emacs interface and automated transactions as strong features as well as the Common Lisp port and the Haskell port of the system. }}\nPorts\nThe Ledger system and file format have been quite influential, reimplemented in several other languages and inspiring similar tools. Actively developed ports include Abandon in Scala, Beancount in Python, and hledger in Haskell. Actively developed projects inspired by ledger include penny.\nSee also\n* Comparison of accounting software\nExternal links\n*[http://ledger-cli.org/ Ledger homepage]\n*[https://web.archive.org/web/20130921060930/http://www.adamsinfoserv.com/AISTWiki/pub/AIS/Presentations/Ledger.pdf Ledger and Text based Accounting] 2009 presentation by Russell Adams\nReferences"
    }
  ]
}