{
  "content": [
    {
      "type": "text",
      "text": "# Ledley King\n\n| birth_date =\n| birth_place = Bow, England\n| height =\n| position = Defender\n| currentclub = Tottenham Hotspur (club ambassador)\n| youthyears1 = 1996–1999\n| youthclubs1 = Tottenham Hotspur\n| years1 = 1999–2012\n| clubs1 = Tottenham Hotspur\n| caps1 = 268\n| goals1 = 10\n| nationalyears1 = 1996–1997\n| nationalteam1 = England U16\n| nationalcaps1 = 5\n| nationalgoals1 = 0\n| nationalyears2 = 1999\n| nationalteam2 = England U18\n| nationalcaps2 = 3\n| nationalgoals2 = 0\n| nationalyears3 = 1999–2001\n| nationalteam3 = England U21\n| nationalcaps3 = 12\n| nationalgoals3 = 1\n| nationalyears4 = 2002–2010\n| nationalteam4 = England\n| nationalcaps4 = 21\n| nationalgoals4 = 2\n| manageryears1 = 2020–2021\n| managerclubs1 = Tottenham Hotspur (assistant coach)\n}}\nLedley Brenton King (born 12 October 1980) is an English former professional footballer. A one-club man, he spent his entire career with Premier League club Tottenham Hotspur and played 323 competitive matches for them from 1999 to 2012. He is a club ambassador for Tottenham Hotspur.\nHighly rated as a central defender, in 2009 he was named by The Times as Tottenham's 25th best player of all time. From 2002 to 2010, King made 21 international appearances for England, scoring twice and representing the nation at UEFA Euro 2004 and the 2010 FIFA World Cup.\nIn the latter part of his career, King was plagued by chronic knee problems, for which no effective treatment or remedy was found. Instead of training with the rest of the squad King undertook fitness exercises on his own, allowing him to play one first team game per week. His former manager Harry Redknapp called King \"an absolute freak\" for being able to perform at a Premier League level despite not training. Whilst playing, King was cited by opponents and pundits as one of the best defenders in the Premier League.\nKing announced his retirement from all forms of football on 19 July 2012 as a result of the chronic knee injuries that plagued much of his career. In August 2020, King was appointed assistant first team coach to work alongside José Mourinho and other coaching staff at Tottenham.\nEarly career\nKing was born in Bow, London in 1980. As a youth footballer, he played for Senrab F.C. and the Tower Hamlets district representative team. He attended the Blessed John Roche RC School, which is now closed. King joined Tottenham as a trainee in July 1996 and progressed through the youth system. Whilst a trainee, he was identified as having qualities and instincts similar to Bobby Moore.\nClub career\n1999–2001\nHis debut came in May 1999 at Anfield ending in a 3–2 defeat to Liverpool. When breaking into the first team under former manager George Graham he was often used as a midfielder. It was with a performance in central midfield during Tottenham's 2–1 win over Liverpool in November 2000 that he established himself as a regular in the Spurs side. His first goal for Tottenham came in December 2000 in a 3–3 draw away to Bradford City after just ten seconds, setting a new Premier League record for the quickest goal. This record stood for over 18 years, finally beaten by Shane Long, scoring for Southampton on 23 April 2019 after only 7.69 seconds.\n2006–2012\nAfter injuring his knee in training before the start of the season, King did not start his season until mid-September. Then after breaking his metatarsal again, he did not feature for Spurs from Boxing Day until the UEFA Cup quarter-final clash with Sevilla in mid-April. Spurs played 59 games in all competitions that season, but King featured in less than half of them. Tottenham only managed 3 clean sheets against top flight opposition without King in the side. In a Premier League clash with reigning champions Chelsea at White Hart Lane, Spurs went on to win the game 2–1, meaning King had captained Tottenham to their first league win over Chelsea since 1990, and the first at White Hart Lane since 1987.\nKing underwent surgery in the summer, meaning he would miss the start of the season. Manager Martin Jol had been sacked and replaced by Juande Ramos. But on Boxing Day 2007, King made a surprise return to the starting line-up against Fulham, playing 73 minutes before being replaced by Adel Taarabt. He appeared sporadically for the rest of the season, but captained Tottenham to a 2–1 victory over Chelsea in the 2008 League Cup final, the first major honour of his career.\nOn 3 April 2008, it was announced that he would be rested for the remainder of the season, Spurs having been knocked out of the UEFA Cup, FA Cup and unable to qualify for the Champions League through the League. King had featured in just 10 games all season, with just four Premiership games under his belt.\nOn 12 August 2008, King picked up the trophy for the cleanest team in the Premier league for the season. He received the award at the 'Get on with the Game' programme which was shown on Sky Sports News.\nIt became clear at the start of the 2008–09 season that King's injury problems meant that he could not play in every game. Ramos picked him in all five of the cup games he managed the club for that season, but only two of the eight league games. With Spurs rooted to the bottom of the league, having picked up just 2 points from those 8 games, Ramos was sacked and replaced by Harry Redknapp, who chose to prioritise the league and only play King in those games. On 26 October 2008, King made his 200th league appearance for Tottenham Hotspur as they defeated Bolton Wanderers 2–0. He captained the club in the League Cup final yet again, this time against Manchester United, keeping a clean sheet after 120 minutes of play, but Tottenham lost on penalties.\nHarry Redknapp said of King's knee injury:\n\"There's no cure. There's no cartilage, nothing to operate on. It's just bone on bone. So it's just a question of managing it. It swells up after games and it normally takes seven days to recover but having played on Monday night he's had less time than usual. He rarely trains, he mostly just goes to the gym to keep himself ticking over. But not running or anything like that. But even if he only plays 20 games a season, he's worth having because he's so good we have a much better chance of winning.\"\nKing won his first game ever against Arsenal in the league on 14 April 2010, with a 2–1 win, of which he played 90 minutes. Exactly three weeks later, on 5 May 2010 King captained Tottenham to a 1–0 away victory at Manchester City, thus guaranteeing Tottenham's highest ever finish in the Premier League and securing entry into the qualification round of the UEFA Champions League for the first time. King had been a major doubt for the match having played against Bolton just 4 days earlier, however his performance in this game and many other games in early 2010 look to have secured his place in Fabio Capello's England squad for the 2010 FIFA World Cup in South Africa. On 16 May 2010 it was reported that King had signed a new two-year contract extension with Spurs which would keep him at the club until 2012. It was rumoured that King had been released by Tottenham after The Premier League released a list of players who would not be staying at their clubs; with King included on the list. This was confirmed to be incorrect by Tottenham, who said they were still in the process of offering King a new deal.\nThe following season he made 3 appearances for Tottenham in the UEFA Champions League. In 2011, a steel statue of King was erected in Mile End Park.\nOn 19 July 2012, King announced he would retire from football. He has continued at Tottenham as a club ambassador. Thierry Henry stated he was the best defender he had played against and the only one to tackle him without resorting to fouling. Throughout the whole of his career King received only eight yellow cards, unusual even for a relatively short career.\nPost retirement appearances\npainted in 2022 at the Tottenham Community Sports Centre, Tottenham High Rd]]\nOn 12 May 2014, Ledley made a final playing appearance at White Hart Lane in his testimonial match. King with a Guests XI featuring David Ginola, Teddy Sheringham and Dimitar Berbatov faced a Tottenham Hotspur team made up of first and reserve team players. The game finished 6–3 to the Ledley XI, with King opening the scoring from the penalty spot, and Louis Saha netting a second half hat trick for the XI.\nIn October 2018, King served as manager for a charity match held in Oldland Common for the benefit of Des Beresford, a former semi-professional footballer and respected local figure who had been diagnosed with cancer earlier in the year. He had been invited to play by Beresford's relatives, who King had grown up with but couldn't play because \"with my knees it just wasn't possible...So I said I was happy to manage. Help out on the day. Really impressed with everyone's efforts\". The teams were made up of mainly former players from nearby Bristol City and Bristol Rovers\nOn 14 May 2023, King and other former Tottenham players including Aaron Lennon, Edgar Davids and Robbie Keane took part in a charity match played at the ground of non-league club Bishop's Stortford F.C.. The match was organised by former Tottenham kitman Steve Dukes to raise money for the Essex & Herts Air Ambulance, who had airlifted Dukes' father to Royal London Hospital after he had sustained fatal skull fractures after falling off his bicycle.\nOn 23 March 2025, King partook in a charity match at the Tottenham Hotspur Stadium for the benefit of the Tottenham Hotspur Foundation, captaining Spurs Legends to a 6-2 win over AC Milan Glorie.\nInternational career\nmatch against the United States.]]\nKing's England debut came in a 1–2 loss to Italy in March 2002. He was called into the England squad for the friendly against Portugal on 18 February 2004, and netted his first goal on his third appearance.\nKing received his England call-up for Euro 2004 deputising for the injured John Terry in the opener against France in Portugal. He also made a substitute appearance in midfield in the final group game against Croatia.\nAfter featuring regularly in the qualifiers, King looked a likely participant in the England 2006 World Cup squad before fracturing a bone in his foot on 15 April 2006. Although not as bad as a similar injury affecting David Beckham, Gary Neville and Steven Gerrard, King's injury prevented him from being named in Sven-Göran Eriksson's squad. \"Ledley King is injured and he can't train. If you talk about centre-halves we are very well covered, so taking another one half-injured when we have so many good ones it is not a good idea.\"\nKing played in the Euro 2008 qualifier against Estonia on 6 June 2007. King played 90 minutes and England won 3–0. Although he featured in Fabio Capello's first squad, he had to pull out through injury. Due to the chronic knee condition which preventing him holding down a regular place in the club side he was also not selected for England games for the rest of 2007 and during the whole of 2008.\nOn 22 March 2009, King was given a recall by head coach Fabio Capello to the team to play Slovakia and Ukraine. However, two days later he was removed from the squad after being assessed by England's medical staff, who thought it was in his best interests to continue his personal training regimen at his club, due to the chronic knee condition that he has.\nFabio Capello later said, in response to Harry Redknapp's objection to King's call-up, \"Without doubt, King is one of the best central defenders in England. If he was fit, Redknapp would not need to make the journey. King could come with us.\" He later promoted King's cause again, saying that \"We hope (he has an international future), because he's a very interesting player&nbsp;– one of the best centre-backs. But I don't know the future.\"\nOn 11 May 2010, King was named in the 30-man provisional squad for the 2010 FIFA World Cup alongside fellow Spurs central defender Michael Dawson. He went on to score a headed goal against Mexico in the first preparation friendly on 24 May.\nKing made it into England's World Cup 2010 squad. On 12 June 2010, King played 45 minutes for England in their opening match against the US, before picking up a groin injury which kept him out of the rest of the tournament.\nCoaching career\nOn 26 July 2020, Tottenham Hotspur manager José Mourinho confirmed King's appointment as an assistant coach for the club. On 6 August 2020, Tottenham announced that King, who had previously been a club ambassador, would be a first-team assistant coach. Following the sacking of Jose Mourinho, King returned full time to his club ambassador duties.\nPersonal life\nKing is a cousin of Ipswich Town full-back Ben Johnson.\n2009 arrest\nOn 10 May 2009 at 2:30&nbsp;am, King was arrested on Soho Street on suspicion of a racially aggravated common assault outside a London nightclub. He spent the night in a police cell and was subsequently bailed until mid-July while the police investigated the incident. King later issued an apology to his club, saying:\n\"I sincerely regret that a night out with friends went too far. I have apologised to Harry and I fully appreciate that, as a professional footballer, I have a duty to behave in a responsible manner\", King said in a statement on the club's website. \"I am assisting the police with their enquiries. Anyone who knows me, knows that much of what has been suggested is totally out of character. I am keen to resolve this as soon as possible and concentrate on my football.\"\nThis prompted his manager at Tottenham, Harry Redknapp, to promise a ban on alcohol for Tottenham players:\n\"I'll implement a strong rule next season that drinking is a no-no here. Footballers should not drink. You shouldn't put diesel in a Ferrari. I know it's hard but they are earning big money, they are role models to kids. We wouldn't get these problems if the players weren't drinking. There's still too much of a drinking culture in English football but it's not as bad as it used to be. At Tottenham we do a lot with kids, a lot of them underprivileged. We have to set an example. Too much drinking goes on in this country. Too many people are not happy unless they have had a drink.\"\nCareer statistics\nClub\n{| class=\"wikitable\" style=\"text-align:center;\"\n|+ Appearances and goals by club, season and competition\n|+\n!rowspan=\"2\"|Club\n!rowspan=\"2\"|Season\n!colspan=\"3\"|League\n!colspan=\"2\"|FA Cup\n!colspan=\"2\"|League Cup\n!colspan=\"2\"|Europe\n!colspan=\"2\"|Total\n|-\n!Division!!Apps!!Goals!!Apps!!Goals!!Apps!!Goals!!Apps!!Goals!!Apps!!Goals\n|-\n|rowspan=\"14\"|Tottenham Hotspur\n|1998–99\n|Premier League\n|1||0||0||0||0||0||colspan=\"2\"|—||1||0\n|-\n|1999–2000\n|Premier League\n|3||0||0||0||0||0||0||0||3||0\n|-\n|2000–01\n|Premier League\n|18||1||5||1||0||0||colspan=\"2\"|—||23||2\n|-\n|2001–02\n|Premier League\n|32||0||3||0||7||1||colspan=\"2\"|—||42||1\n|-\n|2002–03\n|Premier League\n|25||0||1||0||0||0||colspan=\"2\"|—||26||0\n|-\n|2003–04\n|Premier League\n|29||1||3||1||3||0||colspan=\"2\"|—||35||2\n|-\n|2004–05\n|Premier League\n|38||2||5||1||4||0||colspan=\"2\"|—||47||3\n|-\n|2005–06\n|Premier League\n|26||3||0||0||1||0||colspan=\"2\"|—||27||3\n|-\n|2006–07\n|Premier League\n|21||0||0||0||0||0||6||0||27||0\n|-\n|2007–08\n|Premier League\n|4||0||1||0||3||0||2||0||10||0\n|-\n|2008–09\n|Premier League\n|24||1||0||0||2||0||3||0||29||1\n|-\n|2009–10\n|Premier League\n|20||2||1||0||0||0||colspan=\"2\"|—||21||2\n|-\n|2010–11\n|Premier League\n|6||0||0||0||0||0||3||0||9||0\n|-\n|2011–12\n|Premier League\n|21||0||2||0||0||0||0||0||23||0\n|-\n!colspan=\"3\"|Career total\n!268!!10!!21!!3!!20!!1!!14!!0!!323!!14\n|}\nInternational\n{| class=\"wikitable\" style=\"text-align:center\"\n|+ Appearances and goals by national team and year\n|-\n!National team!!Year!!Apps!!Goals\n|-\n|rowspan=\"9\"|England\n|2002||1||0\n|-\n|2003||1||0\n|-\n|2004||9||1\n|-\n|2005||4||0\n|-\n|2006||2||0\n|-\n|2007||2||0\n|-\n|2008||0||0\n|-\n|2009||0||0\n|-\n|2010||2||1\n|-\n!colspan=\"2\"|Total!!21!!2\n|}\n:''Scores and results list England's goal tally first, score column indicates score after each King goal.''\n{| class=\"wikitable sortable\"\n|+ List of international goals scored by Ledley King\n|-\n!scope=\"col\"|No.\n!scope=\"col\"|Date\n!scope=\"col\"|Venue\n!scope=\"col\"|Cap\n!scope=\"col\"|Opponent\n!scope=\"col\"|Score\n!scope=\"col\"|Result\n!scope=\"col\"|Competition\n|-\n|style=\"text-align:center\"|1\n|18 February 2004||Estádio Algarve, Algarve, Portugal||style=\"text-align:center\"|3||||style=\"text-align:center\"|1–0||style=\"text-align:center\"|1–1||Friendly\n|-\n|style=\"text-align:center\"|2\n|24 May 2010||Wembley Stadium, London, England||style=\"text-align:center\"|20||||style=\"text-align:center\"|1–0||style=\"text-align:center\"|3–1||Friendly\n|}\nHonours\nTottenham Hotspur\n*Football League Cup: 2007–08; runner-up: 2001–02, 2008–09\nIndividual\n*Premier League Player of the Month: September 2004\nSee also\n*List of one-club men in association football\nReferences\nExternal links\n*\n}}"
    }
  ]
}