{
  "content": [
    {
      "type": "text",
      "text": "# Leeuwarden Werpsterhoeke railway station\n\n| line          = Staatslijn A (Arnhem - Zwolle - Leeuwarden)\n| platform      = 2\n| tracks        = 2\n| opened        =\n| closed        =\n| code          =\n| services      =\n| passengers    =\n| map_type      = Netherlands Dutch railway station\n| map_caption   =\n}}\nLeeuwarden Werpsterhoeke is a railway station under construction, in southern Leeuwarden, Netherlands.\nHistory\nThe station was set to open between 2018 and 2020 in the Werpsterhoeke neighbourhood. The station will be opened on Staatslijn A (Arnhem - Zwolle - Leeuwarden) and is located between Grou-Jirnsum and Leeuwarden. The station is primarily for southern Leeuwarden as it lies adjacent to the newly built boroughs De Zuidlanden en Nieuw Stroomland, which will feature a total of 6500 houses. It will also serve small settlements in the surrounding area. Construction of a combined pedestrian and bicycle passageway, north of the station, has started on 3 October 2015 and is set to open late 2016 or early 2017. The passageway will replace one nearby railroad crossing and provide relief for another one, also nearby. The passageway will also provide a direct connection to the station platforms. An additional passageway for cars is also set to open late 2016 or somewhere in 2017. The station will also feature a plaza with bicycle racks, a park and ride parking lot and a bus station. Construction of the passageways costs €21 million and construction of the station costs €9 million.\nTrain services\nAs of 2016 it is still unclear which train services will call at the station, but it is assumed that the following train will call:\n{| class=\"wikitable vatop\"\n! Series\n! Train Type\n! Route\n! Material\n! Frequency\n|-\n| 9000\n| NS stoptrein\n| Leeuwarden - Leeuwarden Werpsterhoeke - Grou-Jirnsum - Akkrum - Heerenveen - Wolvega - Meppel\n| ICMm\n| 1x per hour (Mon-Fri only)\n|}\nAccording to Werkgroep Spoor in Friesland, it is likely that Arriva trains between Groningen and Leeuwarden will also call at this station, but Arriva needs permission from NS in order to do so. If Arriva does get permission, the train that will call at this station is the following one:\n{| class=\"wikitable vatop\"\n! Series\n! Train Type\n! Route\n! Material\n! Frequency\n|-\n| 37400\n| Arriva Stoptrein\n|  Groningen Europapark - Groningen - Zuidhorn - Grijpskerk - Buitenpost - De Westereen - Feanwâlden - Hurdegaryp - Leeuwarden Camminghaburen - Leeuwarden - Leeuwarden Werpsterhoeke\n| Spurt (Stadler GTW)\n| 2x per hour (Mon-Sat), 1x per hour (Sun)\n|}\nBus service\nAs of 2016, it's still unclear which bus services will call at this station, but it's likely to be the following bus services as they already serve the adjacent neighbourhoods and/or pass right through the location of this future station:\n{| class=\"wikitable vatop\"\n! Bus Service\n! Operator\n! From\n! To\n! Via\n! Notes\n|-\n| 28\n| Arriva\n| Heerenveen, Station\n| Leeuwarden, Busstation\n| Grou-Jirnsum, Station\n| Mon-Fri only\n|-\n| 95\n| Arriva\n| Joure, Rotonde\n| Leeuwarden, Busstation\n|\n|\n|-\n| 742\n| Arriva\n| Leeuwarden, Busstation\n| Techum, Molkenkelder\n|\n|\n|-\n|}\nReferences"
    }
  ]
}