{
  "content": [
    {
      "type": "text",
      "text": "# Leeward Antilles\n\n}}\n, Federal Dependencies of Venezuela]]\n, Netherlands]]\nThe Leeward Antilles (; ) are a chain of islands in the Caribbean,  specifically part of the southerly islands of the Lesser Antilles (and, in turn, the Antilles and the West Indies) along the southeastern fringe of the Caribbean Sea, just north of the Venezuelan coast of the South American mainland. The Leeward Antilles, while among the Lesser Antilles, are not to be confused with the Leeward Islands (also of the Lesser Antilles) to the northeast.\nLargely lacking in volcanic activity, the Leeward Antilles island arc occurs along the deformed southern edge of the Caribbean Plate and was formed by the plate's subduction under the South American Plate. Recent studies indicate that the Leeward Antilles are accreting to South America.\nIslands\nThe Leeward Antilles comprise (roughly from west to east):\n* ABC islands (a part of the Kingdom of the Netherlands)\n** Aruba, a constituent country of the Kingdom of the Netherlands\n** Bonaire, a part of the Caribbean Netherlands (public body of the Netherlands proper)\n** Curaçao, a constituent country of the Kingdom of the Netherlands\n* Federal Dependencies of Venezuela\n** La Blanquilla Island\n** La Orchila Island\n** La Sola Island\n** La Tortuga Island\n** Las Aves Archipelago\n** Los Frailes Archipelago\n** Los Hermanos Archipelago\n** Los Monjes Archipelago\n** Los Roques Archipelago\n** Los Testigos Islands\n** Patos Island\n* State of Nueva Esparta (Venezuela)\n** Coche Island\n** Cubagua Island\n** Margarita Island\n* State of Falcón (Venezuela)\n** Paraguaná/Cora Island\nNotes\nReferences\n* Levander, Alan, et al. 2006 (28 February). Evolution of the Southern Caribbean Plate Boundary. ([http://www.agu.org/pubs/crossref/2006/2006EO090001.shtml abstract] ; [http://www.ceri.memphis.edu/people/mmagnani/webpage/EOS_Article.pdf article]) Eos, Transactions, American Geophysical Union, 87(9): 97,100.\n* Levander, Alan, et al. 2006 (accessed 27 August).  [https://web.archive.org/web/20050825211238/http://terra.rice.edu/department/research/alan1/SECAR/Northeastern_Venezuela.htm Collaborative Research: Crust-Mantle Interactions During Continental Growth and High-Pressure Rock Exhumation at an Oblique Arc-Continent Collision Zone: Geology of Northeastern Venezuela]. [https://web.archive.org/web/20080819193921/http://terra.rice.edu/department/research/alan1/alan2a.html.bak SE Caribbean Plate Boundary Continental Dynamics Project]. Houston, TX: Rice University."
    }
  ]
}