{
  "content": [
    {
      "type": "text",
      "text": "# Legacy and memory of the Iran–Iraq War\n\n}}\nThe Iran–Iraq War was fought for nearly eight years and left a lasting legacy on Iran and Iraq. The Battle of al-Qadisiyya was the engagement between the Arab-Muslim army and the Sāsānian Iranian army during the first period of Muslim expansion which resulted in the Arab-Muslim conquest of Iran. In the centuries following the battle, Qādisiyyah became enshrined in Muslim collective memory as a symbol of the successes of early Islamic history. Already during the period of the Crusades, Muslim leaders referred to Qādisiyyah as a point of reference to which they compared their own achievements. Academic studies of the narratives of Qādisiyyah and other early Islamic battles have revealed numerous topoi that make up a common schema of the Arab-Muslim conquests; the generation of these literary layers seems to have begun immediately, as story-tellers (quṣṣāṣ) embellished their narrative in order to create an entertaining story or to glorify past ancestors.\nIran\nThe war is known is Iran as the  (\"Sacred Defence\") and the  (\"the Imposed War\").\nIraq\nIn modern times, Qādisiyyah saw a revival beginning with the tensions leading up to the Iran–Iraq War. Ṣaddam Ḥussein and the Ba’ath régime of Iraq began referring frequently to the historical battle, seeking to cast the contemporary hostilities as a replay of the ancient encounter. In official Iraqi rhetoric, the war even became known as Qādisiyyat-Ṣaddām, or \"Saddam's Qādisiyyah\". The state reinforced this rhetoric through a conscious pattern of nomenclature, naming provinces, newspapers, army battalions, and awards after Qādisiyyah, issuing currency, stamps, and medals featuring the battle, and by producing an all-Arab film entitled Qādisiyyah.\nOne of the more famous examples of the use of Qādisiyyah is the Victory Arch (; transliteration, Qaws an-Naṣr''), an Iraqi monument constructed by Saddam's régime to commemorate its \"victory\" in the Iran–Iraq War. Iraq's leading sculptor, Adil Kamil, won the commission to design and execute the construction of the arches, which were based on a concept sketch made Saddam Hussein. The design consists of a pair of massive hands emerging from the ground, each holding a 140-foot (43m) long sword, modelled after the imagined sword used by the Muslim general at Qādisiyyah. A small flagpole rises from the point where the swords meet, at a point about  above the ground. Kamil used photographs and plaster casts of Saddam's forearms to model for the design of the hands. When Kamil died in 1987, with the monument incomplete, his position was assumed by fellow artist Mohammed Ghani Hikmat. Ghani personally took an impression of one of Saddam's thumbs, and the resulting fingerprint was added to the mold for one of the arches' thumbs. Nearby this monument is the Monument to the Unknown Soldier, which housed in its museum Saddam's personal firearm alongside the alleged sword of Saʿd, the Muslim commander at Qādisiyyah.\nScholars have argued that Saddam's choice of Qādisiyyah reflects the emotive power of religious history in the Middle East; invoking its name imbues subconscious meaning to its audience. Qādisiyyah has continued to appear in the Middle East today, as many Muslims and Arab nationalists have named training bases, religious courts, and mosques after the engagement and have cited it in their speeches and sermons. In addition, Qādisiyyah graces the names of schools, sports clubs, bridges, businesses, and medical facilities across the Middle East and even in Europe.\nSee also\n* Battle of al-Qadisiyyah\n* Ṣaddam Ḥussein\n* Victory Arch (also called the ‘Swords of Qādisīyah’)\n* Iran–Iraq War\n* Iran–Iraq relations\n* Arab-Muslim conquest of Iran\n* Arab-Muslim conquests\n* Sasanian dynasty\n* Shāh-nāmeh\nReferences\nBibliography\n* Baram, Amatzia. [https://books.google.com/books?id=_Pd0QgAACAAJ Culture, history, and ideology in the formation of Baʿthist Iraq, 1968–69]. New York City: St Martin’s Press, 1991.\n* Bengio, Ofra. [https://books.google.com/books?id=SI6RdI3n4h0C Saddam’s word: Political discourse in Iraq]. Oxford: Oxford University Press, 1998.\n* Donner, Fred. [https://books.google.com/books?id=Mq8VAAAACAAJ The Early Islamic conquests]. Princeton: Princeton University Press, 1981.\n* Makiya, Kanan. The Monument: Art, vulgarity, and responsibility in Iraq. Berkeley: University of California Press, 1991.\n* Lewental, D Gershon. ‘[http://www.dglnotes.com/qadisiyyah.htm The Battle of al-Qādisiyyah and modern Middle Eastern discourse]’. DGLnotes.com. 21 November 2005.\n* Lewental, D Gershon. ‘[https://www.proquest.com/docview/897684699 Qādisiyyah, then and now: A Case study of history and memory, religion, and nationalism in Middle Eastern discourse]’, Ph.D dissertation. UMI Dissertation Services, 2011.\n* Lewental, D Gershon. ‘[https://dx.doi.org/10.1080/00263206.2013.870899 “Saddam’s Qadisiyyah”: Religion and history in the service of state ideology in Baʿthi Iraq]’. Middle Eastern Studies 50.6 (November 2014): 891-910.\n*\n* Noth, Albrecht (in collaboration with Lawrence Conrad). [https://books.google.com/books?id=Mq8VAAAACAAJ The Early Arabic historical tradition: A Source-critical study]. Translated from German by Michael Bonner. Studies in late antiquity and early Islam, 3. 2nd edition. Princeton: Darwin Press, 1994.\n* Rida, Muhammad. ‘Qadisiyya: A New stage in Arab cinema’. Ur 3 (1981): 40-43.\n* Vaglieri, Laura Veccia. ‘al-Ḳādisiyya’. In Encyclopaedia of Islam. 2nd edition. Leiden: Brill Publishers, 1960–2005. (pp. IV 384-387)"
    }
  ]
}