{
  "content": [
    {
      "type": "text",
      "text": "# Legoland Discovery Centre Toronto__disambig_1\n\nLegoland Discovery Centre Toronto is an indoor family entertainment center located in Vaughan Mills mall in Vaughan, Ontario just north of Toronto. The attraction includes 10 Lego build & play zones, 2 Lego-themed rides, a soft play area, a 4D cinema, the World's Largest Lego Brick Flag, and a gift shop. The Centre features more than 3 million Lego bricks, 500,000 of which are located in the Miniland. The attraction is owned and operated by British leisure group Merlin Entertainments.\nHistory\nLego bricks were invented by Danish carpenter Ole Kirk Christiansen in 1958. The first Legoland Discovery Centre was opened in Berlin in 2007, and since then a total of 13 Legoland Discovery Centres have been opened. Legoland Discovery Centre Toronto was opened in March 2013 and is the only location in Canada.\nFor the grand opening, the attraction took over Yonge–Dundas Square (now Sankofa Square) and invited the public to help build a Lego mosaic in a subway stop. In 2018, the Centre secured the Guinness World Record for Largest Lego Brick Flag with a 21-by-11&nbsp;ft. Canadian flag made from 248,072 Lego bricks.\nThe Toronto location had previously been occupied by a NASCAR Speedpark. It opened with the mall in 2004 and closed in December 2011.\nRides & Attractions\n* Lego Factory Tour where visitors can learn how Lego bricks are made\n* World's former Largest Lego Brick Flag, which is a 21-by-11&nbsp;ft. Canadian Flag made of nearly 250,000 Lego Bricks\n* Ninjago City Adventure, where children can put their ninja skills in the Dojo Temple and more\n* Camp including ninja missions and a laser maze\n* Lego 4D Cinema showing four alternating 4D films featuring popular Lego characters every 30 minutes\n* Kingdom Quest Laser Ride where visitors must zap the ogres, rats and cats and keep an eye out for treasure chests in a competition to win\n* Merlin's Apprentice Ride where visitors can pedal to lift off the ground and look over the rest of Legoland Discovery Center Toronto\n* Space Mission, an intergalactic building experience where guests explore alien worlds built entirely out of Lego bricks\n* A Lego replica of the GTA in Miniland, including the CN Tower, City Hall, Nathan Phillips Square, Pearson International Airport, and Niagara Falls\n* Build and Test station, where visitors can build and test Lego Racers\n* Duplo Village featuring a play house, a large Giraffe model, and 2 Duplo brick pits and 1 Soft Brick pit\n* Earthquake Tables for guests to test the strength of self-built Lego Towers\n* Lego Friends Heartlake City with a Karaoke station and 3 build play stations\n* Two Lego-themed Birthday Party rooms\n* Photo Station for visitors to purchase greenscreen and ride photos\n* Lego-themed Café\n* Legoland Discovery Centre Retail Shop featuring Lego products and souvenirs\nReferences\nExternal links\n* [https://toronto.legolanddiscoverycentre.ca/ Legoland Discovery Centre Toronto]"
    }
  ]
}