{
  "content": [
    {
      "type": "text",
      "text": "# Lego Star Wars: The Resistance Rises\n\n| creator            =\n| starring           =\n| country            = United States\n| language           = English\n| network            = Disney XD\n| executive_producer =\n| company            = LucasfilmLegoM2Film\n| num_episodes       = 5\n| list_episodes      =\n| first_aired        =\n| last_aired         =\n| related            =\n}}\nLego Star Wars: The Resistance Rises is a five-episode Lego Star Wars short form computer-animated series that debuted on Disney XD on February 15, 2016. A comedic prequel to the 2015 film Star Wars: The Force Awakens, it focuses on the exploits of Star Wars characters from that film, as well as legacy characters.\nCharacters\nThe first episode, \"Poe to the Rescue\", features characters Poe Dameron, C-3PO, Kylo Ren, Captain Phasma, Admiral Ackbar and BB-8. Later episodes include Han Solo, Chewbacca, Maz Kanata, Lando Calrissian, Rey, Unkar Plutt, and Finn.\nEpisodes\n|OriginalAirDate =\n|Aux4            = 6:47\n|ShortSummary    = After retrieving a marooned C-3PO, Poe Dameron and BB-8 take him to help rescue a captive Admiral Ackbar from Captain Phasma and Kylo Ren.\n|LineColor       = 6495ED\n}}\n|OriginalAirDate =\n|Aux4            = 3:39\n|ShortSummary    = While trying to manage the rathtars running loose on their ship, Han Solo and Chewbacca find themselves in the path of a First Order TIE fighter.\n|LineColor       = 6495ED\n}}\n|OriginalAirDate =\n|Aux4            = 4:41\n|ShortSummary    = At Maz Kanata'a castle, various shady characters are hunting the elusive Han Solo. Special Guest Star: Lando Calrissian.\n|LineColor       = 6495ED\n}}\n|OriginalAirDate =\n|Aux4            = 4:41\n|ShortSummary    = Unkar Plutt sends his men to steal Rey's tank speeder.\n|LineColor       = 6495ED\n}}\n|OriginalAirDate =\n|Aux4            = 4:41\n|ShortSummary    = After Captain Phasma puts him on active duty, Stormtrooper FN-2187 starts to doubt the motives of the First Order.\n|LineColor       = 6495ED\n}}\n}}\nCast\n* Grey Griffin as Maz Kanata\n* Arif S. Kinchen as Finn\n* Lex Lang as Poe Dameron\n* Helen Sadler as Rey\n* James Arnold Taylor as Bala-Tik\n* Billy Dee Williams as Lando Calrissian\n* Matthew Wood as Kylo Ren\n}}\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}