{
  "content": [
    {
      "type": "text",
      "text": "# Lego Star Wars: Castaways\n\n| genre = Action\n| modes = Single-player, multiplayer\n| producer = Jacques Durand\n| director = Lee Kaburis\n| designer =\n| composer = John Williams\n| image = LSWC Coverart1.png\n| caption = Release poster\n}}\nLego Star Wars: Castaways is an action video game developed by Gameloft Montreal and published by Gameloft. It was released on November 19, 2021 for iOS, macOS and tvOS through Apple Arcade. It is the second Lego Star Wars game to be released on the service after Lego Star Wars Battles.\nGameplay\nIn the game, players navigate an island with other players, complete quests, and engage in combat. The game includes character customization, structure building, and puzzle-solving elements. The gameplay involves exploring the island, interacting with various characters, and completing assigned tasks. In addition to combat and exploration, includes mini-games and side activities such as racing and building competitions. The game incorporates elements from the Star Wars franchise, including characters, locations, and vehicles.\nThe game also features a progression system where players can unlock new abilities, outfits, and gear as they advance. This system incentivizes continued play and offers goals for players to achieve. Daily challenges and events provide additional opportunities for rewards and engagement. Players can join or create clubs to connect with other players within the game. Players can customize their characters with many Star Wars styled outfits. Players can face enemies such as Stormtroopers or race in Microfighters.\nDevelopment\nAccording to Behind the Design by Apple, the Gameloft team \"drew heavily from the rapid-fire richly textured imagery of The Lego Movie and its equally effervescent sequel. Everything is Lego in those movies, down to the backgrounds.\" says Lee Kaburis, game manager for Lego Star Wars: Castaways. \"We investigated the matter a little further, decided it was feasible, and said, 'OK, we’re going all in.' We wanted that full immersion of being in a Lego world.\" Kaburis also stated that \"playtime — which involved nearly everyone on the team — was the most important part of development.\".\nReception\n| rev1 = Multiplayer.it\n| rev1Score = 8/10\n| rev2 = Pocket Tactics\n| rev2Score = 8/10\n}}\nLego Star Wars: Castaways received \"generally favourable\" reviews on Metacritic.\nBoth Multiplayer.it and Pocket Tactics rated the game 8/10. The Telegraph India did an unscored review of the game.\nOne critic praised the simplicity of the game, but also criticized the graphics of the game. Whereas another critic praised the graphics of the game, and stated that \"If you’re a Lego fan, a Star Wars nerd, or just an Apple Arcade subscriber, I suggest you install Lego Star Wars: Castaways.\"\nThe game was nominated for 'Best Family Game' at the 2022 Pocket Gamer Awards. It won the \"Visuals and Graphics\" award at Apple Design Awards 2022.\nReferences\nExternal links\n*\n* [https://www.starwars.com/games-apps/lego-star-wars-castaways Lego Star Wars: Castaways] at StarWars.com"
    }
  ]
}