{
  "content": [
    {
      "type": "text",
      "text": "# Leilani Battle\n\nLeilani Marie Battle is an African American computer scientist. She is an assistant professor at University of Washington's  Paul G. Allen School of Computer Science & Engineering. Leilani Battle is also a co-director in UW's interactive Data Lab program. She is known for her research into the visualization and analysis of complex database systems.\nEarly life and education\nBattle grew up with a love for video games. Because of this she originally chose computer science to become a game designer or a developer. Battle then went to University of Washington and earned her B.S. in computer engineering in 2011. However, when she started doing research internships, instead of pursuing a career in video games, the experience changed her interest in doing research as she enjoyed it.\nShe then went to Massachusetts Institute of Technology (MIT) where she earned her M.S. in 2013 and Ph.D. in 2017, both in computer science. She also finished a postdoc at the University of Washington's Interactive Data lab in 2017. During her time with MIT and her Ph.D. work, she also helped create ForeCache, a general-purpose program to create time-efficient tools for visualizing large data-sets that interact with Database Management Systems. In 2020, MIT Technology Review lists ForeCache as one of her major contributions when awarding her Innovators Under 35.\nCareer\nBattle was an assistant professor at University of Maryland, College Park, where she led the Battle Data Lab. She is now an assistant professor in University of Washington's Paul G. Allen School of Computer Science & Engineering where she teaches and mentors students, and conducts research into databases, where she focuses with Human–computer interaction to integrate databases and HCI interfaces to create visualizations for larger databases.\nAwards\nIn 2020, the MIT Technology Review named Battle one of Innovators Under 35. She won an Adobe Data Science Research Award in 2019 and a VMware Early Career Faculty Grant in 2021. She earned the ORAU Ralph E. Powe Junior Faculty Enhancement Award for her project, “Supporting Interactive Data Exploration at Scale”, in 2019.\nShe also received a National Science Foundation CAREER Award and a Sloan Research Fellowship.\nIn 2022, Battle received the TCDE Rising Star Award.\nReferences\nExternal links\n* [https://homes.cs.washington.edu/~leibatt/bio.html Personal webpage]\n*"
    }
  ]
}