{
  "content": [
    {
      "type": "text",
      "text": "# Lella Warren\n\n| birth_place   = Clayton, Alabama\n| death_date    =\n| nationality   = American\n| occupation    = Novelist, short story writer\n| notable_works = Foundation Stone\n}}\nLella Warren (March 22, 1899 – 1982) was a novelist and short story writer who is best known for her historical novel Foundation Stone chronicling the life of Alabama settlers in the 19th century. She was inducted into the Alabama Women's Hall of Fame in 1987.\nBiography\nLee Ella 'Lella' Warren was born in 1899, in Clayton, Alabama, to Lee Ella Underwood and Benjamin Smart Warren, a physician who helped to found the U.S. Public Health Service. Warren's family moved around a good deal during her childhood as her father, then in the Marine Hospital Service, was moved from one posting to another. In 1917, she graduated from Western High School in Washington, D.C. By then her writing was developed enough that her writing teacher sent one of her stories to an editor for Century Magazine, who responded encouragingly.\nWarren started her undergraduate education at George Washington University in 1917, transferred to Goucher College for her sophomore year, and returned to GWU for her last two years, receiving her A.B. degree in 1921.\nAfter graduating, she married John Spanogle, and in late 1922 they had a daughter. They divorced in 1930.\nIn 1936, Warren married the journalist Gerald Breckenridge. They divorced four years later.\nIn 1941, she married her third and last husband, Buel W. \"Dan\" Patch.\nWriting\nWarren published her first novel, the quasi-autobiographical A Touch of Earth, in 1926. It was successful enough to prompt an editor for Cosmopolitan to put Warren under contract.  For the next decade or so, she sold short stories and essays to Cosmopolitan and other magazines like Good Housekeeping, ''McClure's, Collier's, and College Humor. To support herself following her first divorce, she also undertook various jobs in journalism, public relations, and government service.\nWarren is best known for the 1940 novel Foundation Stone'', considered her magnum opus.  An historical novel about the Whetstone family, it was based on the history of Warren's own ancestors after their arrival on the Alabama frontier in the 1820s. The novel follows three generations of the Whetstone family after they leave a South Carolina plantation with worn-out soil and strike out for the Alabama wilderness. Warren went beyond family history and did extensive research in archival documents such as court records to ensure the accuracy of her narrative.\nHer publisher, Alfred Knopf, brought Foundation Stone out initially as a Borzoi Book in a special limited edition, following up with a trade edition. An overnight success, by the end of the year it was on both the Publishers Weekly and the New York Herald-Tribune's lists of bestsellers, reaching no. 2 on the latter. It was translated into Portuguese, Swedish, and Danish within a few years. Key to the novel's success was Warren's focus on the family life of Southern pioneers outside of the plantation world that Margaret Mitchell had popularized and glamorized in Gone with the Wind just a few years earlier. The novel's success prompted the Women's National Press Club to select Warren as a Woman of the Year for 1941 (the same year it honored Margaret Mitchell).\nIn 1952, Warren published a sequel to Foundation Stone, the second in what she planned to make a trilogy. Whetstone Walls again featured the Whetstone family, with a central character, Rob Whetstone, based on Warren's father. Picking up after the Civil War (where Foundation Stone had left off), it followed the Whetstone family to the end of the century. Warren never completed the third novel in the trilogy, although her manuscript notes suggest she planned to incorporate sections from some of her short stories and unpublished writings into this novel.\nWarren was still working on her third Whetstone novel when she died of cancer in 1982. Her papers—including correspondence, manuscripts, photographs, and personal memorabilia—are held by Auburn University at Montgomery.\nIn 1987, Warren was inducted into the Alabama Women's Hall of Fame.\nIn 1989, a compendium of her unpublished writing came out under the title Family Fiction: Unpublished Narratives of Lella Warren.\nReferences\nFurther reading\n*Anderson, Nancy G. \"Lella Warren: Alabama's Margaret Mitchell?\" Alabama Heritage 7 (Winter 1988): 42–51.\n*Anderson, Nancy G. \"Lella Warren's Literary Gift—Alabama.\" In Clearings in the Thicket: An Alabama Humanities Reader, Jerry Elijah Brown, ed. Macon, Ga.: Mercer University Press, 1985.\n*Hughes, Elaine W. \"Lella Warren's Use of the Kindermord Motif in Foundation Stone.\" Alabama English 2 (Spring 1990): 35–40."
    }
  ]
}