{
  "content": [
    {
      "type": "text",
      "text": "# Lenape Indian Tribe of Delaware\n\n| formerly            =\n}}\nThe Lenape Indian Tribe of Delaware Inc. is a state-recognized tribe and non-profit organization in the US state of Delaware. It does not have federal recognition as an American Indian tribe.\nHistory\nThe organization gained official recognition in Delaware on August 3, 2016. The group has around 225 members.\nMembers of the organization were once known as \"the Moors\" or the \"Delaware Moors\". Moors were sometimes listed as \"M\" on official documentation, such as state driver's licenses. A 1948 Smithsonian report referred to them as the \"Moors of Kent County, Delaware\". Prior to the state's recognition of the tribe, the Delaware Moors were considered \"Mulatto\" or of African-American descent. The Lenape Indian Tribe is related through ancestry and cultural ties to the state-recognized Nanticoke Indian Association in Delaware and the state-recognized Nanticoke Lenni-Lenape Tribal Nation in New Jersey, both of whose ancestors were known as Moors.\nIn 2021, the organization acquired 11 acres of land near Fork Branch Nature Preserve, with the assistance of the State of Delaware, a private financier, and an environmental conservation group. This was part of the Lenape historic territory. Long after the colonial period, ancestors of group members had attended a small schoolhouse that formerly existed on property near the acquired land. It is also near a former Lenape cemetery and church.\nSee also\n*Brass Ankles\n*Delaware Moors\n*Dominickers\n*Lenape Nation of Pennsylvania\n* Lumbee\n* Lumbee Tribe of North Carolina\n*Melungeons\n**Carmel Melungeons\n*Nanticoke Indian Association\n*Nanticoke Lenni-Lenape Tribal Nation\n*Piscataway-Conoy Tribe of Maryland\n*Piscataway Indian Nation and Tayac Territory\n*Redbones\n*Wesorts\nReferences\nExternal links\n*[http://www.lenapeindiantribeofdelaware.com/ Official website], Lenape Indian Tribe Delaware, Kent County"
    }
  ]
}