{
  "content": [
    {
      "type": "text",
      "text": "# Leni Robredo 2022 presidential campaign\n\n* Team Robredo-Pangilinan\n* Liberal Party\n* Akbayan\n* Katipunan ng Nagkakaisang Pilipino\n* Magdalo\n* Other political parties\n* Makabayan\n* Partido Reporma (de facto)}}\n}}\n| status           = Announcement: October 7, 2021Official launch: February 8, 2022Lost election: May 9, 2022\n| headquarters = Katipunan Avenue, Quezon City, Metro Manila\n| key_people   =\n* Erin Tañada (senate slate campaign manager)\n* Barry Gutierrez (spokesperson)\n}}\n| slogan = Gobyernong Tapat, Angat Buhay Lahat )}}Husay at Tibay, Dapat si Leni!)}}Kulay Rosas ang Bukas)}}\n| website =  (Archived)\n}}\nThe 2022 presidential campaign of Leni Robredo began on October 7, 2021, when she filed her candidacy for the 2022 Philippine presidential election. At the time of her filing, Leni Robredo was the incumbent vice president of the Philippines, to remain so until June 30, 2022. Robredo was also formerly a representative of Camarines Sur's 3rd congressional district, from 2013 to 2016.\nRobredo had been considered as a potential presidential candidate for the 2022 elections since her win in the 2016 Philippine vice presidential election; in 2021, she publicly expressed her interest to run for the presidency. After being nominated by an opposition coalition, 1Sambayan, she officially announced her candidacy in a press conference on October 7, 2021. She ran as an independent candidate despite being the chairperson of the Liberal Party, a move she explained as signifying her openness to alliances. On October 8, Robredo announced that her running mate would be incumbent senator Francis Pangilinan. Their campaign was officially launched on February 8, 2022, in Robredo's hometown, Naga.\nRobredo ran on a platform of good governance and transparency. To address the ongoing COVID-19 pandemic in the Philippines and its effects on the economy, she vowed to prioritize improving the country's healthcare system, developing the country's industries, supporting small and medium-sized enterprises, and providing stable employment.\nRobredo lost the election to Bongbong Marcos, garnering 27.94% of the vote and placing second. Robredo later urged her supporters to accept the results of the election, but did not explicitly concede to Marcos. Had Robredo been elected, she would have been the third female Philippine president after Corazon Aquino and Gloria Macapagal Arroyo, the first president to come from the Bicol Region, and the third vice president to run for the presidency and win.\nBackground\n2016 vice presidential campaign and vice presidency\nLeni Robredo ran in the 2016 Philippine vice presidential election as the running mate of Mar Roxas under the Liberal Party ticket. She won with 14,418,817 votes, or 35.11 percent of cast ballots, narrowly defeating her closest rival, then Senator Bongbong Marcos, by 263,473 votes or by 0.64 percent, the narrowest margin since the 1965 vice presidential election. Marcos filed an electoral protest on June 29, 2016; this would be dismissed by the Presidential Electoral Tribunal on February 16, 2021. On June 30, 2016, Robredo was sworn in as vice president of the Philippines at the Quezon City Reception House.\nRobredo previously expressed disinterest in running for higher office. During her 2016 campaign, she stated that incumbent vice presidents should be barred from seeking the presidency. She reiterated her disinterest in November 2020 and March 2021, but in June 2021, she changed her position and expressed her openness to running for the presidency.\n1Sambayan\nIn March 2021, former Supreme Court associate justice Antonio Carpio launched 1Sambayan (read as \"isambayan\", meaning \"one nation\"), a coalition that aimed to place one opposition candidate. Carpio was aiming not to split the vote, pointing out that Duterte won over Mar Roxas and Grace Poe in 2016 because those who were against him were not united. 1Sambayan formally began its selection process for a presidential and vice-presidential tandem on June 12, 2021, when they announced their six initial nominees. These included senator Grace Poe, vice president Leni Robredo, former senator Antonio Trillanes, human rights lawyer and former senatorial candidate Chel Diokno, incumbent house deputy speaker Vilma Santos-Recto, and CIBAC representative and house deputy speaker Eddie Villanueva. In the middle of 2022, Robredo, Trillanes, and Villanueva expressed their support for unity under 1Sambayan.\nOn September 30, 2021, the 1Sambayan coalition of the opposition nominated Robredo as their standard bearer. Former education secretary Armin Luistro, one of the convenors of the group, announced Robredo's acceptance of the nomination and the filing of her candidacy on October 5. Robredo's spokesman later announced, however, that Robredo had yet to accept the nomination and would be announcing her decision before October 8.\nCampaign\nAnnouncement\nOn October 7, 2021, Robredo officially announced her candidacy and later filed her certificate of candidacy for the election. She ran as an independent politician rather than under the Liberal Party despite being its chairperson. Robredo's camp explained that this move represented her openness to forming alliances with other political groups. During the CNN Philippines presidential debate, she explained that she broke her previous vow to not run for the presidency because of fake news and disinformation, an enabling of corruption, and the \"politics of the past.\" In a separate interview, she cited Bongbong Marcos' candidacy as one of the reasons that pushed her to run.\nAfter Robredo announced her presidential candidacy, several sources from the Liberal Party indicated that the party's president, senator Francis Pangilinan, would be her running mate in her presidential bid. Pangilinan filed his candidacy for vice president a day after Robredo. While Robredo chose to file her candidacy as an independent candidate, despite remaining as the Liberal Party's chairperson, Pangilinan ran as the party's standard-bearer.\nKey officials\nDespite running as an independent, figures from the Liberal Party and its allied parties remained as key participants in her campaign. This included:\n* Bam Aquino, former senator, cousin of former president Benigno Aquino III, campaign manager (Liberal)\n* Erin Tañada, former deputy speaker, senate slate campaign manager\n* Barry Gutierrez, spokesperson (Akbayan)\nBranding\nin Quezon City, February 13, 2022]]\nin Quezon City, March 1, 2022]]\n, Pasig]]\nRobredo described her campaign as a \"people's campaign,\" citing her supporters' efforts in organizing her campaign, with rallies organized by local chapters of a volunteer-driven Robredo People's Council (RPC).\nOn its launch, the color her campaign used was hot pink, to signify \"protest and change,\" and was popularized by 'Dapat si Leni', a group of Robredo supporters. This was a deviation from the bright yellow motif commonly associated with the Liberals. Her campaign initially planned to use blue as their main campaign color, but was yet to adopt a final theme color when pink was already being used by supporters and associated with Robredo and her campaign. According to Robredo, pink is \"the color of a personality that is open, listening, loving and loving.\" The campaign's supporters adopted the moniker kakampink, a portmanteau of kakampi, which is Filipino for \"ally\", and \"pink\".\nOn January 11, 2022, Robredo and her campaign team unveiled their campaign tagline, \"Gobyernong Tapat, Angat Buhay Lahat\" (Honest Government, a Better Life for All). Based on Robredo's Angat Buhay program under the Office of the Vice President, the slogan was made to reflect the campaign's platform of good governance and transparency. On February 7, a day before the official start of the election campaign season, Robredo's campaign adopted the pink rose flower as its official symbol.\nSeveral songs were made for and used by the campaign. The song \"Kay Leni Tayo\" (We're for Leni) was created for free by Nica del Rosario, Mat Olavides, Jeli Mateo, and Justine Peña. Del Rosario wrote and recorded another song for the campaign, \"Rosas\" (Rose), featuring Gab Pangilinan (Francis Pangilinan's niece), while Ogie Alcasid released \"Handa Ka Na Ba kay Leni\" (Are You Ready for Leni). Other songs used in Robredo's campaign rallies included \"Liwanag sa Dilim\" (Light in the Dark) by Rivermaya and \"Alapaap\" by the Eraserheads. Although she had no official hand signs like her opponents, some of her supporters would use the Laban sign, that was used during the 1978 Interim Batasang Pambansa elections by Lakas ng Bayan or LABAN, a political party formed by former senator Ninoy Aquino. The hand signal was also used in the presidential campaign of former presidents Corazon Aquino in 1986 and her son Benigno Aquino III in 2010. Some say that her hand signal is being associated with the Liberal Party, however this was also used to refer to Robredo's first letter of her nickname. Others would prefer the Finger heart, a hand signal that was popularized in South Korea.\nRallies\nOn October 24, 2021, Robredo campaign volunteers held a nationwide \"caravan of hope.\" An estimated 10,000 supporters joined the caravan.\nOn February 8, 2022, Robredo held her proclamation rally in Plaza Quezon in her hometown, Naga City, Camarines Sur. The proclamation rally was attended by Robredo, Pangilinan, and their senatorial slate. Prior to the proclamation rally, her campaign held a mini-rally in Libmanan,  Camarines Sur.\nOn February 13, 2022, Robredo and her supporters held a campaign rally at the Quezon Memorial Circle in Quezon City. The rally, dubbed \"Pink Sunday,\" was attended by at least 20,000 supporters. Due to the sheer number of supporters, the event resulted in a spillover crowd that violated several safety protocols set by the local government. Robredo's camp later apologized for the incident.\nAfter the Pink Sunday rally, Robredo campaigned in the provinces of Capiz and Aklan. The following week, Robredo began her campaign in Mindanao with a rally and caravan in Iligan. Meanwhile, Pangilinan campaigned in Tarlac with his wife, Sharon Cuneta. On February 25, Robredo campaigned in Iloilo, with an estimated crowd of 40,000 joining her at the Iloilo Sports Complex. On March 2, Robredo campaigned in Manila, which was followed by a sortie in Cavite on March 4.\nOn March 20, Robredo's campaign held a rally at Ortigas Center in Pasig, dubbed the \"PasigLaban grand rally\", which became her largest rally at that point. This caught the attention of pop star Ariana Grande when she noticed her song \"Break Free\" being used and sung by many people during the said rally. She remarked, \"I couldn't believe this was real.\" Organizers estimated that  180,000 attended, although the local police countered this with its own estimate placed at 137,000. This hitherto record turnout was later surpassed by the April 9 rally dubbed as \"Manalakáran: Pampanga People's Rally\" in San Fernando, which drew about 220,000. Regional police officials at first denied the organizers' estimate, saying that the venue could only accommodate 70,000 people; later, however, regional police director Matthew Baccay clarified that their 70,000 figure was for security planning purposes only and not meant to indicate audience size.\nOn April 23, Robredo celebrated her 57th birthday at a rally, labeled as a street party by media outlets, along Macapagal Boulevard in Pasay. According to the organizers, they estimated the crowd to have been of 412,000 people, making it the campaign's largest rally at this point. The National Capital Region Police Office contested the estimate, however, stating that only around 70,000 to 80,000 people attended.\nFinally, Robredo held her miting de avance in Makati, which drew 780,000 people, making it the campaign's biggest rally, surging ahead of the Pasay rally's crowd of 412,000.\n}}\n}}\n{| class=\"wikitable sortable mw-collapsible\" style=\"text-align: center\"\n|+List of Robredo's campaign rallies\n|-\n! class=unsortable | Date\n! class=unsortable | Venue\n! class=unsortable | City/Municipality\n! class=unsortable | Province\n! Estimatedattendance\n! class=unsortable | Ref.\n|-\n|style=\"text-align: left;| Feb 8\n|style=\"text-align: left;| Plaza Quezon || Naga || Camarines Sur || 20,000 ||\n|-\n| rowspan=\"3\" style=\"text-align: left;| Feb 9\n|style=\"text-align: left;| Central Mall Plaza Grounds || Daet || Camarines Norte || || rowspan=\"2\"|\n|-\n|style=\"text-align: left;| Sorsogon Provincial Capitol || Sorsogon City || Sorsogon ||\n|-\n|style=\"text-align: left;| Guinobatan Municipal Hall || Guinobatan || Albay || ||\n|-\n|style=\"text-align: left;| Feb 13\n|style=\"text-align: left;| Quezon Memorial Circle || Quezon City || – ||  20,000 ||\n|-\n|rowspan=2; style=\"text-align: left; |Feb 15 ||style=\"text-align: left;| Dinggoy Roxas Civic Center || Roxas || Capiz ||  4,000 ||\n|-\n|style=\"text-align: left;| Aklan Catholic College || Kalibo || Aklan ||  5,000 ||\n|-\n|style=\"text-align: left;| Feb 16\n|style=\"text-align: left;| Evelio B. Javier Freedom Park || San Jose de Buenavista || Antique||  6,000 ||\n|-\n|rowspan=2; style=\"text-align: left; |Feb 22\n|style=\"text-align: left;| Iligan City Public Plaza || Iligan || Lanao del Norte || 3,000 ||\n|-\n|style=\"text-align: left;| Plaza Divisoria || Cagayan de Oro || Misamis Oriental || 10,000 ||\n|-\n|style=\"text-align: left;| Feb 23\n|style=\"text-align: left;| Diocesan Formation Center || Malaybalay || Bukidnon || ||\n|-\n|style=\"text-align: left;| Feb 24\n|style=\"text-align: left;| Southwestern University || Cebu City || Cebu || 12,000 ||\n|-\n|style=\"text-align: left;| Feb 25\n|style=\"text-align: left;| Iloilo Sports Complex || Iloilo City || Iloilo || 40,000 ||\n|-\n|style=\"text-align: left;| Feb 26\n|style=\"text-align: left;| Guimaras Provincial Capitol Gym || Jordan || Guimaras || 2,000 ||\n|-\n|style=\"text-align: left;| Mar 2\n|style=\"text-align: left;|Plaza Noli || Manila || – || 5,000 ||\n|-\n|style=\"text-align: left; |Mar 3\n|style=\"text-align: left;| Divine Word College || Calapan || Oriental Mindoro || 7,000 ||\n|-\n|style=\"text-align: left;| Mar 4\n|style=\"text-align: left;| General Trias Sports Park || General Trias || Cavite || 47,000 ||\n|-\n|style=\"text-align: left;| Mar 5\n|style=\"text-align: left;| New Malolos City Hall Grounds || Malolos || Bulacan || 45,000 ||\n|-\n|rowspan=2; style=\"text-align: left; | Mar 8\n|style=\"text-align: left;| Bislig City Cultural & Sports Center || Bislig || Surigao del Sur ||  || rowspan=2|\n|-\n|style=\"text-align: left;| Hotel Tavern Compound || Surigao City || Surigao del Norte ||\n|-\n|rowspan=2; style=\"text-align: left; |Mar 9\n|style=\"text-align: left;| Agusan del Sur College || Bayugan || Agusan del Sur || 2,000 ||\n|-\n|style=\"text-align: left;| Guingona Park || Butuan || Agusan del Norte || 10,000 ||\n|-\n|style=\"text-align: left;| Mar 10\n|style=\"text-align: left;| Odiongan Public Plaza || Odiongan || Romblon || 3,000 ||\n|-\n|style=\"text-align: left;| Mar 11\n|style=\"text-align: left;| Paglaum Sports Complex || Bacolod || Negros Occidental || 86,000 ||\n|-\n| rowspan=\"2\" style=\"text-align: left;|Mar 12\n|style=\"text-align: left;| Alcala Municipal Grounds\n|Alcala || Cagayan || ||\n|-\n|style=\"text-align: left;| Echague Banchetto\n|style=\"text-align: center;|Echague || Isabela || 10,000 ||\n|-\n| rowspan=\"3\" style=\"text-align: left;|Mar 15\n|style=\"text-align: left;|Kidapawan City Hall\n|Kidapawan || Cotabato || 1,000 ||\n|-\n|style=\"text-align: left;|Rizal Park\n|Koronadal || rowspan=\"2\" |South Cotabato || 2,000 ||\n|-\n| style=\"text-align: left;\" | Carlos P. Garcia Freedom Park\n|General Santos || 14,000 ||\n|-\n| rowspan=\"2\" style=\"text-align: left;\" |Mar 16\n| style=\"text-align: left;\" | Cotabato State University\n|Cotabato City || Maguindanao || 3,000 ||\n|-\n| style=\"text-align: left;\" |Isabela City Plaza\n|Isabela City || Basilan || 45,000||\n|-\n| rowspan=\"2\" style=\"text-align: left;|Mar 17\n| style=\"text-align: left;\" | Sindangan Cultural and Sports Center\n|Sindangan || Zamboanga del Norte || 15,000 ||\n|-\n| style=\"text-align: left;|Cesar C. Climaco Freedom Park\n|Zamboanga City || rowspan=\"2\" | Zamboanga del Sur || 35,000 ||\n|-\n| style=\"text-align: left;|Mar 18\n| style=\"text-align: left;|Plaza Luz\n| Pagadian || 4,000 ||\n|-\n| style=\"text-align: left;|Mar 20\n| style=\"text-align: left;|Emerald Avenue\n| Pasig || – || 137,000 ||\n|-\n| style=\"text-align: left; |Mar 22\n| style=\"text-align: left;|Old Provincial Capitol Grandstand\n| Cabanatuan  || Nueva Ecija || 50,000 ||\n|-\n| style=\"text-align: left;|Mar 23\n| style=\"text-align: left;|Ninoy Aquino Boulevard\n|Tarlac City|| Tarlac || 50,000 ||\n|-\n| style=\"text-align: left;|Mar 24\n| style=\"text-align: left;|Davao del Sur Coliseum\n|Digos || Davao del Sur || 6,000 ||\n|-\n| style=\"text-align: left;|Mar 26\n| style=\"text-align: left;|Notre Dame Open Field\n|Caloocan || – || 50,000\n|\n|-\n| rowspan=\"2\" style=\"text-align: left;|Mar 28\n| style=\"text-align: left;|Samar Capitol Grounds\n|Catbalogan || Samar|| 5,000 ||\n|-\n| style=\"text-align: left;|University of Eastern Philippines\n|Catarman || Northern Samar || 73,000 ||\n|-\n| rowspan=\"3\" style=\"text-align: left;|Mar 29\n| style=\"text-align: left; |Boy Scout Monument\n| Palo || Leyte || 5,000 ||\n|-\n| style=\"text-align: left;|Naval Gymnasium\n| Naval || Biliran || ||\n|-\n| style=\"text-align: left;|Baybay Boulevard\n| Borongan || Eastern Samar || 54,000 ||\n|-\n| style=\"text-align: left;|Mar 30\n| style=\"text-align: left; |Capitol Sunken Garden\n| Maasin || Southern Leyte || ||\n|-\n| style=\"text-align: left;|Mar 31\n| style=\"text-align: left; |Longest Boardwalk\n| Kauswagan || Lanao del Norte ||  ||\n|-\n| rowspan=\"2\" style=\"text-align: left;|Apr 1\n| style=\"text-align: left; |Sagonsongan Area 6 Open Court\n| Marawi || Lanao del Sur || 5,000 ||\n|-\n| style=\"text-align: left; |Tagbilaran Airport\n| Tagbilaran || Bohol || 80,000 ||\n|-\n| style=\"text-align: left;|Apr 5\n| style=\"text-align: left; |Rizal Capitol Grounds\n| Antipolo || Rizal || 43,000 ||\n|-\n| rowspan=\"2\" style=\"text-align: left;|Apr 6\n| style=\"text-align: left; |San Jose Municipal Plaza\n| San Jose || Occidental Mindoro ||\n|\n|-\n| style=\"text-align: left; |Puerto Princesa Baywalk\n| Puerto Princesa || Palawan ||  11,000\n|\n|-\n| style=\"text-align: left;|Apr 7\n| style=\"text-align: left; |New Tagum City Hall Grounds\n| Tagum || Davao del Norte || 35,000\n|\n|-\n| style=\"text-align: left;|Apr 8\n| style=\"text-align: left; |CSI Stadia Grounds\n| Dagupan || Pangasinan ||  76,000\n|\n|-\n| rowspan=\"2\"  style=\"text-align: left;|Apr 9\n| style=\"text-align: left; |Baler Municipal Plaza\n| Baler || Aurora ||\n| rowspan=\"2\"|\n|-\n| style=\"text-align: left; |Robinsons Starmills\n| San Fernando || Pampanga || 220,000\n|-\n| rowspan=\"2\"  style=\"text-align: left;|Apr 12\n| style=\"text-align: left; |Saint Louis College\n| San Fernando || La Union || 11,000\n|\n|-\n| style=\"text-align: left; |Virac Town Center Metrowalk\n| Virac || Catanduanes || 15,000\n|\n|-\n| style=\"text-align: left;|Apr 13\n| style=\"text-align: left; |J. M. Robredo Boulevard\n| Masbate City || Masbate || 40,000\n|\n|-\n| rowspan=\"2\"  style=\"text-align: left;|Apr 18\n| style=\"text-align: left; |Infanta Government Service Complex\n| Infanta || Quezon || ||\n|-\n| style=\"text-align: left; |Boac Sports Arena\n| Boac || Marinduque || ||\n|-\n| rowspan=\"2\" style=\"text-align: left;|Apr 19\n| style=\"text-align: left; | SM City Olongapo Downtown\n| Olongapo || Zambales || ||\n|-\n| style=\"text-align: left; | Sitio Maluang Open Field\n| Balanga || Bataan || 65,000 ||\n|-\n| rowspan=\"3\"  style=\"text-align: left;|Apr 20\n| style=\"text-align: left; |Pasayaw Grounds\n| Canlaon|| Negros Oriental || ||\n|-\n| style=\"text-align: left; |Queengate Center\n| Larena || Siquijor || || rowspan=2|\n|-\n| style=\"text-align: left; |Rusi Ballfield\n| Dumaguete || Negros Oriental || 40,000\n|-\n| style=\"text-align: left;|Apr 21\n| style=\"text-align: left; |Parkmall\n| Mandaue || Cebu || 150,000\n|\n|-\n| style=\"text-align: left;|Apr 23\n| style=\"text-align: left; |Macapagal Boulevard\n|Pasay|| – || 80,000-412,000\n|\n|-\n|style=\"text-align: left;| Apr 25\n|style=\"text-align: left;| Gapan City Plaza\n| Gapan || Nueva Ecija || ||\n|-\n| style=\"text-align: left;| Apr 26\n|style=\"text-align: left;| Plaza de Francisco M. Sanchez\n| Lubang || Occidental Mindoro || ||\n|-\n|style=\"text-align: left;| Apr 27\n|style=\"text-align: left;| Bulacan Sports Complex\n| Malolos || Bulacan || 144,000 ||\n|-\n|style=\"text-align: left;| Apr 28\n| style=\"text-align: left; |Lucena City Government Complex\n|Lucena || Quezon|| 80,000\n|\n|-\n| style=\"text-align: left;|Apr 29\n| style=\"text-align: left; |Nuvali Open Field\n|Santa Rosa || Laguna\n|225,000\n|\n|-\n| style=\"text-align: left;|Apr 30\n| style=\"text-align: left; |Catalina Lake Residences Open Lot\n| Bauan || Batangas\n|280,000\n|\n|-\n| style=\"text-align: left;|May 1\n| style=\"text-align: left; |City of Dasmariñas Football Field\n| Dasmariñas || Cavite\n| 100,000\n|\n|-\n| style=\"text-align: left;|May 2\n| style=\"text-align: left; |Melvin Jones Grandstand\n| Baguio || Benguet\n| 30,000\n|\n|-\n| rowspan=2 style=\"text-align: left;|May 3\n| style=\"text-align: left; |La Paz Plaza\n| Iloilo City || Iloilo || 6,000 ||\n|-\n| style=\"text-align: left; |Bantayan Park\n| Bago|| Negros Occidental || 15,000 ||\n|-\n| rowspan=2 style=\"text-align: left;|May 4\n| style=\"text-align: left; |Pantao Ragat Central School\n| Pantao Ragat|| Lanao del Norte || ||\n|-\n| style=\"text-align: left; |Dipolog Boulevard\n| Dipolog || Zamboanga del Norte || 45,000 ||\n|-\n| rowspan=3 style=\"text-align: left;|May 5\n| style=\"text-align: left; |Provincial Farmers' Cultural and Training Center\n| Oroquieta|| Misamis Occidental ||\n|-\n| style=\"text-align: left; |Misamis University\n| Ozamiz || Misamis Occidental || ||rowspan=2|\n|-\n| style=\"text-align: left; |Datu Lipus Makapandong Cultural Center\n| Prosperidad || Agusan del Sur || 70,000\n|-\n| rowspan= 3 style=\"text-align: left;|May 6\n| style=\"text-align: left; |Magsaysay and Rizal Streets\n| Sorsogon City || Sorsogon|| 40,000 ||\n|-\n| style=\"text-align: left; |Sawangan Park\n| Legazpi || Albay|| 100,000 ||\n|-\n| style=\"text-align: left; |Magsaysay Avenue\n| Naga || Camarines Sur|| 306,000  ||\n|-\n| style=\"text-align: left;|May 7\n| style=\"text-align: left; |Ayala and Makati Avenues\n| Makati || –  || 780,000 ||\n|-\n|}\nPolling\n|caption=Graphical summary\n|border=no\n}}\nOpinion polls conducted before the filing of candidacies showed Robredo garnering about 5 to 10 percentage points of voting intentions. Her numbers significantly improved by late 2021, after the filing of candidacies. A survey conducted by Pulse Asia on December 1–6 showed Robredo polling ahead of other presidential candidates but behind Bongbong Marcos, garnering 20 percent, 12 percentage points more than the pollster's previous survey conducted during the pre-filing period, specifically from September 6–11. Surveys conducted by OCTA Research and Publicus Asia during the same period showed Robredo polling 14 and 20.2 percent respectively.\nIn early 2022, Robredo consistently ranked second behind frontrunner Marcos, garnering about 15 to 20 percent of voting intentions. After the CNN presidential debate and the first PiliPinas Debates 2022, Robredo's numbers rose. A poll conducted by Pulse Asia on March 17–21 showed Robredo polling at 24 percentage points, nine points more than in the pollster's previous survey conducted at the start of the campaign period (February 18–23). This was corroborated by the Publicus Asia poll conducted on March 30 – April 6, with Robredo garnering 23 percentage points. Another poll by Laylo conducted on the same period showed Robredo at 19 percentage points.\nCandidates\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n| colspan=\"2\"|\n|-\n| style=\"background-color:#D9027D;\"|\n| style=\"background-color:#D9027D;\"|\n|-\n| style=\"background-color:#FEB7D9;\"| for President\n| style=\"background-color:#FEB7D9;\"| for Vice President\n|-\n|\n|\n|-\n| Vice President of the Philippines\n| Senator of the Philippines\n|-\n| colspan=\"2\"| Candidates:\n* Leni Robredo for President\n* Francis Pangilinan for Vice President\n* Teddy Baguilat for Senator\n* Leila de Lima for Senator\n* Chel Diokno for Senator\n* Risa Hontiveros for Senator\n* Alex Lacson for Senator\n* Sonny Matula for Senator\n* Antonio Trillanes for Senator\n* Jejomar Binay for Senator\n* Francis Escudero for Senator\n* Dick Gordon for Senator\n* Joel Villanueva for Senator\n|}\nSenatorial slate\nRobredo and Pangilinan endorsed the following candidates for the 2022 Philippine Senate election, thus forming the tandem's \"senatorial slate\" referred to as \"Team Robredo–Pangilinan\":\n*Former representative Teddy Baguilat (Liberal)\n*Senator Leila de Lima (Liberal)\n*Lawyer Chel Diokno (Katipunan ng Nagkakaisang Pilipino)\n*Senator Risa Hontiveros (Akbayan)\n*Lawyer Alex Lacson (Ang Kapatiran)\n*Lawyer Sonny Matula (Independent)\n*Former senator Antonio Trillanes (Liberal)\n*Guest candidates:\n**Former vice president Jejomar Binay (UNA)\n**Sorsogon governor Francis Escudero (NPC)\n**Senator Dick Gordon (Bagumbayan–VNP)\n**Senator Joel Villanueva (Independent)\nSenate Majority Leader Migz Zubiri was initially included in the senatorial slate as a guest candidate. However, Zubiri later endorsed the presidential campaign of Bongbong Marcos, contrary to an agreement made with all guest candidates not to openly endorse a presidential candidate. Prompted by calls from their supporters to remove him from the slate, campaign spokesperson Barry Gutierrez confirmed on April 27, 2022, that Zubiri was no longer part of their slate, continuing their campaign with only 11 senatorial candidates fielded.\nEndorsements\nAfter her bid was announced, Robredo received support from Filipino netizens in various social media platforms; the hashtags #LetLeniLead and #LabanLeni2022 trended on social media. Various personalities publicly expressed their support for Robredo. She also received endorsements from several politicians, particularly those aligned with the opposition.\nFellow presidential aspirant and incumbent senator Panfilo Lacson questioned Robredo's character after some of her campaign staff allegedly became amenable to dropping her running mate, Kiko Pangilinan, and fielding instead his running mate, Senator Tito Sotto, as Robredo's running mate, allegedly in exchange for more votes in some provinces. Robredo's spokesperson Barry Gutierrez debunked Lacson's allegations and reiterated that \"Robredo has always been clear from the start that she will only campaign for her running mate, Pangilinan\". However, during her 57th birthday, Robredo flew without Pangilinan all the way to the Moro Islamic Liberation Front's (MILF) headquarters in Camp Darapanan in Sultan Kudarat, Maguindanao, during the official announcement of an endorsement by MILF chairman and Bangsamoro Interim Chief Minister Murad Ebrahim who also chairs the United Bangsamoro Justice Party (UBJP); the MILF and UBJP had yet to endorse a vice presidential candidate at that point. Later, while MILF and UBJP endorsed Robredo for president, the two groups eventually endorsed Davao City mayor Sara Duterte for vice president instead of Pangilinan. Earlier, Robredo also proceeded with her 2-day campaign in the island of Samar, despite Pangilinan skipping the campaign rally in Eastern Samar after he was informed by their campaign team that local officials in Eastern Samar wanted only to endorse Robredo and not his candidacy. However, during these trips to endorsing parties without Pangilinan alongside her, Robredo did not campaign for the endorsing parties' chosen vice presidential candidates.\nPolitical positions\nAbortion\nRobredo is not in favor of abortion, citing her faith as a Catholic. However, she is open to talks of decriminalization, at least in certain cases.\nDivorce\nRobredo does not support divorce, asserting that annulment in the country should be made more accessible first. She said women are often unable to leave their marriages because they are financially dependent on their husbands, and economic empowerment can help them become capable of walking away from abuses. She has, however, stated her openness to hear \"divergent opinions\" regarding abortion, divorce, and death penalty.\nEducation\nRobredo has criticized the quality of education in the country, citing it as the cause for unemployment. On November 4, 2021, she released her \"Kalayaan sa COVID\" (Freedom from COVID) plan, a portion of which was dedicated to education, \"Kalayaan sa kakulangan sa education\" (Freedom from lack of education). This included the reopening of face-to-face classes in low-risk areas, giving gadgets to students in high-risk areas, ensuring free access to quality education materials on the Internet, and establishing \"community learning hubs\" where students without Internet access and electronic devices can borrow such. In the plan, she would allocate ₱68 billion (about US$1.3 billion) in education aid for 22 million students, with each being given ₱300 (about $6). She also planned to raise the education budget to 6 percent of the country's GDP once elected. She also said she would declare an \"education crisis\" if she assumes office, so that the government can adopt an \"all-hands-on-deck approach\" to education.\nEconomy\nOn December 11, 2021, Robredo's campaign team released her \"Hanapbuhay para sa lahat\" (Livelihood for all) plan, detailing her agenda to revive industries, provide stable employment, and ensure the protection of workers' rights and improvement of labor conditions. She planned to develop the country's marine, manufacturing, climate, and technological industries. She also planned to modernize the agriculture sector and support the micro, small, and medium-sized enterprises (MSME) sector. During the first PiliPinas Debates 2022, she re-emphasized her support for MSMEs and vowed to make a ₱100 billion (about $1.9 billion) stimulus package for small businesses.\nForeign policy\nRobredo had called for the government to reassert its sovereign rights in the South China Sea (West Philippine Sea) amid the territorial dispute between China and various nations in Southeast Asia. She vowed to continue the full modernization of the armed forces and build a credible defense around the country's waters. She also pushed for multilateral talks in settling the maritime dispute with China. During a meeting with the Rotary Club of Manila on October 14, 2021, Robredo declared that she would only enter any deal with the government of China regarding the territorial disputes such as joint explorations if China recognizes the Permanent Court of Arbitration's 2016 ruling favoring the Philippines. She later clarified that her administration is nevertheless willing to cooperate with China on other policy areas, particularly trade and investment.\nHealth\nRobredo's \"Kalayaan sa COVID\" (Freedom from COVID) platform planned to address the ongoing COVID-19 pandemic. Major components of the plan included the implementation of the universal health care law, reform of the Philippine Health Insurance Corporation (PhilHealth), reducing the members of the Inter-Agency Task Force for the Management of Emerging Infectious Diseases, expanding health workers' benefits, and strengthening local health units. Robredo also supports efforts to boost testing and vaccination to withstand another COVID-19 surge.\nInfrastructure\nRobredo expressed support for the Build! Build! Build! infrastructure program of the Duterte administration. She vowed to continue the program, but said she will prioritize public–private partnerships (PPPs) instead of official development assistance (ODA) aids. She also said that her proposed infrastructure projects would be under one program.\nLGBT issues\nIn a campaign rally, Robredo committed to protect LGBT rights. She supports same-sex civil unions, but iterated that she is against same-sex marriage.\nNotes\nReferences\nExternal links\n*\n* [https://web.archive.org/web/20220512203912/https://www.lenirobredo.com/ Archived campaign website]"
    }
  ]
}