{
  "content": [
    {
      "type": "text",
      "text": "# Lennox-King Glacier\n\n| coords_ref    =\n| area          =\n| length        =\n| width         =\n| thickness     =\n| elevation_max =\n| elevation_min =\n| terminus      = Richards Inlet, Ross Ice Shelf\n| status        =\n}}\nLennox-King Glacier is a large valley glacier, about  long that flows east into the Ross Ice Shelf.\nLocation\nLennox-King Glacier drains Bowden Névé and flows northeast between the Holland Range and the Queen Alexandra Range of Antarctica to enter Richards Inlet and the Ross Ice Shelf.\nThe Law Glacier supplies ice to the Lennox-King Glacier, leading some glaciologists to refer to it as the Law/Lennox-King Glacier system or Law-Lennox-King glacier corridor.\nIts mouth is south of the Robb Glacier and west of the Beardmore Glacier.\nLennox-King Glacier was named by the New Zealand Geological Survey Antarctic Expedition (1959–60) for Lieutenant Commander James Lennox-King, Royal New Zealand Navy, leader at Scott Base, 1960.\nMouth\nRichards Inlet\n.\nA large ice-filled inlet at the mouth of Lennox-King Glacier, opening to the Ross Ice Shelf just southeast of Lewis Ridge.\nNamed by the NZGSAE (1959–60) for R. W. Richards, a member of the Ross Sea Party of the Imperial Trans-Antarctic Expedition (1914–17), who assisted in laying depots as far south as Mount Hope for Shackleton's proposed crossing of Antarctica.\nAsquith Bluff\n.\nA prominent wedge-shaped rock bluff on the west side of Lennox-King Glacier,  southeast of Mount Allen Young.\nDiscovered by the BrAE (1907–09) and named \"Mount Asquith\" for Lord Oxford and Asquith, Prime Minister, 1908–16, who was instrumental in securing a grant from the United Kingdom Government to pay off the expedition's debts. Not: Mount Asquith.\nVertigo Bluff\n.\nA prominent rock bluff,  high, located  souith of Asquith Bluff on the west side of Lennox-King Glacier.\nRock samples were collected at the bluff by John Gunner and Henry Brecher of the Ohio State University Geological Expedition, 1969-70.\nThe name suggested by Gunner reflects the precipitous nature of the bluff face.\nNévé\nThe glacier is fed by the Bowden Névé.\nThis in turn is fed by the Law Glacier and the Walcott Névé.\nBowden Névé\n.\nA névé about  wide, lying southward of Mount Miller between Queen Elizabeth Range and Queen Alexandra Range.\nObserved in 1958 by the N.Z. Southern Party of the CTAE (1956–58) and named for Charles M. Bowden, Chairman of the Ross Sea Committee which organized the N.Z. party of the CTAE.\nLaw Glacier\n.\nA glacier about  wide between the south end of Queen Elizabeth Range and the MacAlpine Hills, gradually descending east-north-east from the polar plateau to Bowden Névé. Named by the N.Z. party of the CTAE (1956–58) for B.R. Law, Deputy-Chairman of the Ross Sea Committee.\nSylwester Glacier\n.\nA glacier,  long, flowing north between Jacobs Nunatak and MacAlpine Hills into Law Glacier.\nNamed by US-ACAN for David W. Sylwester, USARP aurora scientist at South Pole Station, winter 1961, and Byrd Station, summer, 1961-62.\nWalcott Névé\n.\nA névé, about  in area, bounded by the Marshall Mountains, Lewis Cliff and Mount Sirius.\nNamed by the Northern Party of the NZGSAE (1961–62) for Richard Walcott, party leader and geologist.\nPrebble Glacier\n.\nA glacier,  long, flowing westward from Mount Kirkpatrick in Queen Alexandra Range to enter Walcott Neve north of Fremouw Peak.\nNamed by the Northern Party of the NZGSAE (1961–62) for Michael Prebble, of the base support party, who assisted the party with preparations and training.\nWyckoff Glacier\n.\nA glacier,  long, flowing west from Grindley Plateau in Queen Alexandra Range, just north of Lamping Peak.\nNamed by US-ACAN for Kent A. Wyckoff, USARP meteorologist at Hallett Station, 1963.\nLeft tributaries\nTributaries of Lennox-King Glacier, and glaciers that enter Richards Inlet from the left (north), are:\nFegley Glacier\n.\nA tributary glacier in the Holland Range, flowing east into Lennox-King Glacier,  northeast of Mount Alien Young.\nNamed by US-ACAN for Lt. Charles E. Fegley, III, CEC, USN, officer in charge of the nuclear power unit at McMurdo Station during OpDFrz, 1964.\nHoffman Glacier\n.\nA narrow glacier,  long, flowing eastward from Mount Miller in the Holland Range to enter Lennox-King Glacier south of Rhodes Peak.\nNamed by US-AC AN for Lt. Cdr. Robert D. Hoffman, USN, commanding officer of the USS Mills during OpDFrz, 1965.\nHewitt Glacier\n.\nA glacier,  long, descending the east slopes of Holland Range between Lewis Ridge and Mount Tripp to enter Richards Inlet.\nNamed by the NZGSAE (1959–60) for Leonard R. Hewitt, leader at Scott Base, 1959.\nMorton Glacier\n.\nA glacier,  long, descending eastward from Holland Range between Vaughan Promontory and Lewis Ridge to the Ross Ice Shelf.\nNamed by US-ACAN for Lt. Cdr. John A. Morton, officer in charge of USN Squadron VX-6 Detachment ALFA, which wintered at McMurdo Station, 1964.\nRight tributaries\nWahl Glacier\n.\nA glacier,  long, flowing northwest from Grindley Plateau to enter upper Lennox-King Glacier westward of Mount Mackellar.\nNamed by US-ACAN for Bruno W. Wahl, USARP ionospheric physicist at McMurdo Station, 1962.\nTillite Glacier\n.\nA tributary glacier flowing northwest from Pagoda Peak in Queen Alexandra Range to join Lennox-King Glacier north of Fairchild Peak.\nSo named by NZGSAE (1961–62) because it contains outcrops of ancient moraine (tillite), indicative of glacial action in remote Paleozoic times.\nMontgomerie Glacier\n.\nA narrow tributary glacier,  long, flowing north along the west side of Hampton Ridge in Queen Alexandra Range to enter\nLennox-King Glacier. Named by the Northern Party of the NZGSAE (1961–62) for John Montgomerie, assistant surveyor of that party. Not: Montgomery Glacier.\nMackellar Glacier\n.\nA large tributary glacier in Queen Alexandra Range, flowing north along the east side of Hampton Ridge from Mount Mackellar, to enter Lennox-King Glacier.\nNamed by the NZGSAE (1961–62) in association with Mount Mackellar. Not: Bell Glacier.\nReferences\nSources\n*\n*\n* }}\n* }}\n*\n* }}\n* }}"
    }
  ]
}