{
  "content": [
    {
      "type": "text",
      "text": "# Leon Schwartz\n\nLeon Schwartz, Yiddish אריה–לייב שווארץ (Arye-Leyb Shvarts) (1901-1990) was a klezmer and classical music violinist born in the village Karapchiv, Austria-Hungary near the town of Vashkivtsi in today’s Vyzhnytsia Region of the Bukovina area of Ukraine.\nRaised in a Hasidic family, Schwartz first learned to play violin from local Jewish, Ukrainian and Romani fiddlers who frequented the village tavern kept by his father, and began to perform occasionally in addition to working in the village post office. In 1916, as the First World War eastern front reached Bukovina, he and his family fled and lived as refugees in Jungbunzlau (Mladá Boleslav), Austrian Bohemia. Returning home at the end of the war, Schwartz began to play professionally at Jewish, Ukrainian, Romani, Polish and German weddings and other occasions throughout the Bukovina region, in a band with his younger brothers Burekh and Duvid as well as with local Ukrainian and Romani musicians Halynko Marianchuk, Kolio Tyslycki, and Aleko Yeremichuk.\nSchwartz made more than one trip to the U.S in the 1920s before settling in New York City in 1927, where he studied classical violin with Max Jacobs and Elias Malkin. In addition to orchestral and chamber music, he played weddings and other occasions professionally in Jewish and other ensembles, with trumpeter Max Peters (Petrowski) and clarinetist Shloimke Beckerman among others, and taught violin privately for many years.\nIn the 1980s he was mentor and teacher to key klezmer revivalist Michael Alpert as well as Alicia Svigals and Rebecca Miller, and was an important influence on the playing of Deborah Strauss and the klezmer revitalization in general. One of the signature pieces of Schwartz’s repertoire is the majestic \"Dem Rebns Nign\" - his solo violin rendering of a Hasidic nign he recalled from the singing of Reb Shulemke Hager, the Storozhinitser Rebbe, from the Hager dynasty of Vizhnitz Hasidim. Along with much of Schwartz's repertoire, the piece is performed and taught today by several violinists from the klezmer revitalization, including Strauss, Alpert, Steven Greenman and Mark Kovnatsky.\nSchwartz was interviewed and recorded extensively in the 1980s by Michael Alpert and Michael Schlesinger and videoed by Itzek Gottesman. A portion of his repertoire, with vignettes of Schwartz speaking, was released on the 1993 annotated album Like in a Different World on Global Village Records, which was selected as an Outstanding Folk Recording of 1993 by the American Folklife Center at the U.S. Library of Congress. He also appears in Michal Goldman’s klezmer documentary \"A Jumpin Night in the Garden of Eden\" (1988), taught at KlezKamp in the late 1980s, appeared with Kapelye on NBC's First Camera and played with Alpert at Isaac Bashevis Singer’s 83rd birthday party.\nAccording to klezmer fiddler Bob Cohen, the 1993 album offers \"One of the best examples of traditional Jewish fiddling ... Leon’s range of styles and inter-ethnic repertoire reflects his region as well as his own Jewish upbringing.\"\nReferences\n* [https://web.archive.org/web/20081030073650/http://dinayekapelye.com/jmiasi.htm Di Naye Kapelye] site\n* 'Fiddler on the Move' by Mark Slobin p.&nbsp;124-5"
    }
  ]
}