{
  "content": [
    {
      "type": "text",
      "text": "# Leon Trotsky: A Revolutionary's Life\n\n| image             = Leon_Trotsky_A_Revolutionary's_Life.jpg\n| alt               = Book cover of ''Leon Trotsky: A Revolutionary's Life'' by Joshua Rubenstein, showing a portrait of Leon Trotsky sitting on a stool.\n| caption           = Book cover\n| author            = Joshua Rubenstein\n| country           = United States\n| language          = English\n| subject           = Russian Revolution, Leon Trotsky, Soviet Union, Communism, Joseph Stalin\n| genre             = Non-fiction, Biography, History, Politics\n| publisher         = Yale University Press\n| series            = Yale Jewish Lives\n| pub_date          = 2011\n| media_type        = Hardcover, Paperback, Kindle\n| pages             = 240\n| isbn              = 978-0300137248\n| website           = [https://yalebooks.yale.edu/book/9780300198324/leon-trotsky/ Publisher's page]\n| oclc              = 696942380\n}}\nThe Life and Death of Leon Trotsky is a biography of Leon Trotsky by Joshua Rubenstein. The book was originally published in 2009 by Yale University Press and is part of the Yale Jewish Lives series.\nSynopsis and structure\nLeon Trotsky: A Revolutionary’s Life by Joshua Rubenstein is a concise biography that explores Trotsky's role as a revolutionary, his Jewish background, and his political downfall. Part of Yale University Press's Jewish Lives series, the book presents Trotsky as a complex figure—both a key architect of the Russian Revolution and a victim of the regime he helped establish.\nWhile the biography highlights Trotsky's intellectual and organizational contributions, it also underscores his ideological rigidity and political miscalculations. Rubenstein examines Trotsky's ambivalent relationship with his Jewish identity, noting moments of empathy toward Jewish suffering despite his self-identification as a Marxist internationalist. Reviewers praised the book's clarity and accessibility.\nReception\n*\n*\n*\n*\nRelease information\n* Hardcover: 2011 (First Edition), Yale University Press, 240pp. .\n* Paperback: 2013, Yale University Press, 240pp. .\n* Kindle: 2011, Yale University Press.\nSimilar or related works\n* Trotsky: A Biography by Robert Service (2009).\n* Trotsky by Tony Cliff (1989–1993, 4 vols.).\n* The Prophet: The Life of Leon Trotsky (1953, 1959, 1963, 3 vols.) by Isaac Deutscher.\nAbout the author\nJoshua Rubenstein is an American activist, writer and scholar of literature, dissent, and politics in the former Soviet Union. He won a National Jewish Book Award in Eastern European studies in 2002 for his book  Stalin’s Secret Pogrom.\nSee also\n* Russian Revolution\n* Marxist historiography\n* Trotskyism\n*\n* Leon Trotsky bibliography\nReferences\nNotes\nCitations\nExternal links\n* [https://www.jstor.org/stable/j.ctt5vm665 Leon Trotsky: A Revolutionary's Life] at JSTOR\n* [https://yalebooks.yale.edu/book/9780300198324/leon-trotsky/ Leon Trotsky: A Revolutionary's Life] at Yale University Press"
    }
  ]
}