{
  "content": [
    {
      "type": "text",
      "text": "# Les Edwards\n\n| birth_place      =\n| death_date     =\n| death_place    =\n| resting_place =\n| resting_place_coordinates =\n| nationality      = British\n| field              = Illustration\n| training          = Hornsey College of Art\n| movement      = Fantasy, horror, science fiction\n| works            =\n| patrons       =\n| influenced    =\n| awards        = British Fantasy Award (best artist) 1991, 1994, 2000, 2003, 2004, 2005, 2006World Fantasy Award (artist) 2008\n| signature     =\n| signature_alt =\n| website       = [http://www.lesedwards.com/index.php The Art of Les Edwards][http://www.edwardmiller.co.uk/ The Art of Edward Miller]\n}}\nLes Edwards (born 7 September 1949) is a British illustrator known for his work in the horror, science fiction and fantasy genres, and has provided numerous illustrations for book jackets, posters, magazines, record covers and games during his career. In addition to working under his actual name, he also uses the pseudonym Edward Miller to paint in a different style and to overcome restrictions placed on him by his association with horror. He has won the British Fantasy Society award for Best Artist seven times, and was awarded the World Fantasy Award in 2008.\nLife and career\nEdwards studied at Hornsey College of Art between 1968 and 1972, where he says he was \"firmly advised that he would never be an illustrator\" due to a general perception in the department that the job was too difficult, and later claiming that the experience failed to provide much of use in later years. After graduating, Edwards was taken on by the Young Artists agency in London, and began working as a freelance illustrator.\nOver the course of his prolific career Edward's work has included advertising campaigns, graphic novels and film design, but he is perhaps best known for his book jacket illustrations spanning the horror, fantasy and science fiction genres. Over the years he has provided many illustrations for genre titles, including numerous pieces for Robert E. Howard's Conan stories and Pratchett's Discworld setting, and books by authors such as Anne McCaffrey, Frank Herbert, Jack Vance, and many others.\nEdwards is also known for his numerous covers for books in the Fighting Fantasy series, including Caverns of the Snow Witch, Demons of the Deep, and Crypt of the Sorcerer, and many of the more recent re-issues.\nMany of Edward's paintings appeared as covers for Games Workshop's White Dwarf magazine during the 1980s, and he was featured, along with other illustrators from Young Artists, in an Illuminations exposé in White Dwarf 105. He also provided the covers for the Warhammer Fantasy Battle and Warhammer Fantasy Roleplay supplements Power Behind the Throne and Realm of Chaos: The Lost and the Damned, and a series of illustrations for the Dark Future game. In 1989 Games Workshop published an anthology of Edward's work entitled Blood and Iron. He has also provided several pieces of work for Milton Bradley's HeroQuest, and covers for books for FASA's Shadowrun and Earthdawn RPGs. Edwards has also provided illustrations for British science fiction periodicals Interzone and Postscripts. as well as the now-defunct AD&D fantasy publication IMAGINE Magazine.\nEdwards has illustrated two graphic novels, both adapted by Steve Niles from short stories in Clive Barker's Books of Blood. Having met at the World Fantasy Convention in London, Barker later recalled Edwards and recommended him to Eclipse Books for the first, Son of Celluloid; after its success Rawhead Rex followed. Edwards also created the UK publicity posters for the films The Thing, Graveyard Shift and Nightbreed, the latter a commission he received as a result of Clive Barker's influence.\nEdwards has also provided a number of record covers during his career. A portion of one of his illustrations, originally created for The Devils of D-Day by Graham Masterton was also used as cover art for Metallica's early single, \"Jump in the Fire\", whilst his painting The Croglin Vampire appeared as the cover of the album \"Alive and Screamin' by Swiss band Krokus. More recently he produced the inner artwork for the album Music for the Jilted Generation by The Prodigy.\nIn recent years, Edwards has also begun working under the pseudonym \"Edward Miller\", a move designed to allow him to pursue a more diverse range of commissions without any assumptions on the part of publishers based on his prior work, particularly any restrictive association with the horror genre.\nEdwards has won the British Fantasy Award for Best Artist seven times. He has been nominated three times for a World Fantasy Award and won, as Edward Miller, in 2008. Edwards acted as a judge for the awards in 2003, and was the artist guest of honour at the 1995 World Science Fiction Convention.\nEdwards is now represented by his wife, Val Edwards, with whom he lives in Brighton, England. When not painting, his pastimes include model kit building, playing the guitar and fencing.\nStyle and technique\nEdwards often refers to his vintage horror work as his 'Red Period', a reference to the profusion of gore prevalent in horror illustration at the time, and to more recent work as his 'Blue Period'. Edwards is generally known for his emphasis on portrait elements, whilst as Miller, on the other hand, he places a greater emphasis on landscapes, and what he views as a more 'romantic style'.\nAmongst Edwards' influences he cites the early influence of comic illustrator Frank Bellamy, particularly the Heros the Spartan strip, as well as Eagle's Dan Dare, and a later love for the work of illustrator Bruce Pennington, and describes a childhood attraction to anything 'strange or bizarre', drawing from a very early age, inspired by comics and film. His later exposure to macabre and violent elements in the work of more traditional artists, such as Goya's Saturn Devouring His Son, left an impression. Other major influences include William Blake, John Singer Sargent and John Everett Millais.\nAlthough he has also occasionally used gouache, and more recently has often worked in acrylics, Edwards' original medium of choice is oil paint. This is used on any smooth board, ideally hardboard, which is primed with gesso. Following from preliminary sketches, images are constructed on the support with a hard pencil before being developed using washes of a neutral coloured acryclic, usually brown, a technique Edwards says he borrowed from 'the old masters'. The oils are mixed with an alkyd medium called liquin, which thins the paint and speeds drying time. Edwards and Miller are also separated by distinctions of medium, with pieces under the Miller name more typically executed in acrylic paint on canvas panels as opposed to Edward's more usual use of oils on smooth board. Recently Edwards has also begun working in the digital medium with programs like Painter, enjoying the freedom afforded with computers, although he continues to express a preference for traditional painting techniques.\nReferences\nExternal links\n* [http://www.lesedwards.com/index.php The Art of Les Edwards official site]\n* [http://www.edwardmiller.co.uk/ The Art of Edward Miller official site]\n* [http://www.abandonart.co.uk/artists/biog_le.html Les Edwards, Master of the Macabre] at Abandonart\n* [http://www.shadow-writer.co.uk/edwardsinterview.htm An interview with Edwards] on Paul Kane's Shadow Writer site\n* [https://darkwolfsfantasyreviews.blogspot.com/2009/01/fantasy-art-les-edwardsedward-miller.html An Interview with Edwards] on Dark Wolf's Fantasy Reviews\n*"
    }
  ]
}