{
  "content": [
    {
      "type": "text",
      "text": "# Lethwei in popular culture\n\nThe Burmese martial art of Lethwei has been featured in films, television, manga and anime. Lethwei was featured in The Joe Rogan Experience podcast by Joe Rogan with Lethwei champion Dave Leduc as guest. Born Warriors presented an authentic up-close look at Lethwei through a series of documentaries shot entirely on location throughout Myanmar. Lethwei was featured in the Netflix documentary FightWorld with Soe Lin Oo hosted by Frank Grillo and in the popular Japanese manga series Kengan Ashura.\nFilm\n{| class=\"wikitable sortable\"\n|-\n! Movie\n! Year\n! Description\n|-\n| Born Warriors\n| align=center| 2016\n| Trilogy documentary film about the art of Lethwei.\n|-\n| La Fosse aux Tigres\n| align=center| 2017\n| Canal D documentary about the Dave Leduc vs. Tun Tun Min III fight in 2016.\n|-\n| ''Into Dave's Fist\n| align=center| 2018\n| Canal+ Myanmar documentary following Dave Leduc on his preparation for his trilogy fight against Tun Tun Min\n|-\n| Still/Life\n| align=center| 2019\n| A short Film about Lethwei in Myanmar\n|-\n| Myanmar Lethwei and Me\n| align=center| 2019\n| Canal+ Myanmar documentary following Dave Leduc around Myanmar exploring the Lethwei culture.\n|-\n| Power & Martial Arts : Lethwei\n| align=center| 2019\n| Short film about Lethwei following Dave Leduc around Yangon, Myanmar.\n|-\n| Underground\n| align=center| 2019\n| Myanmar movie in Burmese language with Dave Leduc playing a gangster and using Lethwei in fight scenes.\n|}\nTelevision\n{| class=\"wikitable sortable\"\n|-\n! Television\n! Year\n! Episode\n! Description\n|-\n| FightWorld\n| align=center| 2018\n| Myanmar: Crossroads\n| American docu-series on Netflix with Episode 3 about Lethwei.\n|-\n| Spirit of Fight\n| align=center| 2019\n| Season 1 & 2\n| Canal+ Myanmar TV Series about Lethwei fighters on Canal+ Zat Lenn channel.\n|-\n| Le Canal Nouvelles\n| align=center| 2019\n| LCN: Denis Lévesque\n| Denis Lévesque and Dave Leduc discuss Lethwei.\n|-\n| The Amazing Race Canada\n| align=center| 2019\n| Season 7 - Episode 1\n| Dave Leduc explains Lethwei during team introductions.\n|-\n| The Joe Rogan Experience\n| align=center| 2019\n| MMA Show Episode #81\n| Joe Rogan and Dave Leduc discuss Lethwei.\n|-\n| World Lethwei Championship\n| align=center| 2019\n| WLC 7: Mighty Warriors\n| The first Lethwei event to be transmitted live on UFC Fight Pass.\n|-\n| Billions\n| align=center| 2022\n| Cannonade\n| Season 6 Ep. 1 – Kate Sacker played by Condola Rashad trains for a Lethwei fight.\n|}\nAnime and manga\nLethwei has been featured in the popular Japanese manga series Kengan Ashura. In the series, opponents of the Burmese Lethwei master Saw Paing shatter the bones in their hands when they punch him.\n{| class=\"wikitable sortable\"\n|-\n! Manga or Animation\n! Characters\n|-\n| Baki the Grappler\n| Pa Paing from Kengan Ashura fights Doppo Orochi using Lethwei in \"Baki x Kengan\", Baki-Dou (2018), Chapter 107.5\n|-\n| Kengan Ashura\n| Saw Paing (Burmese fighter)\n|-\n| Batuque''\n| Batuque Vol. 8 Chapter 79: \"Lethwei vs Capoeira\"\n|}\nSee also\n* Capoeira in popular culture\n* Muay Thai in popular culture\nReferences"
    }
  ]
}