{
  "content": [
    {
      "type": "text",
      "text": "# Lewis Ocean Bay Heritage Preserve\n\n| coords_ref =\n| area = 10,444 acres\n| established = 1988\n| website = https://www2.dnr.sc.gov/ManagedLands/ManagedLand/ManagedLand/104\n| governing_body = South Carolina Department of Natural Resources\n}}\nLewis Ocean Bay Heritage Preserve is a 10,427-acre natural preserve near Carolina Forest, South Carolina.\nGeology\nLewis Ocean Bay Heritage Preserve is named for one of many Carolina Bays. Recent work by the U.S. Geological Survey has interpreted the Carolina Bays as relict thermokarst lakes that formed several thousands of years ago when the climate was colder, drier, and windier.  Thermokarst lakes develop by thawing of frozen ground (permafrost) and by subsequent modification by wind and water. Thus, this interpretation suggests that permafrost once extended as far south as the Carolina Bays during the last ice age and (or) previous ice ages.\nHuman history\nIn the 1800s some of the area had been plantations, and there was a village called Vaught. At one time, major industries in the area were turpentine and logging. Pine stumps still show evidence they were used in making turpentine.\nGeorge Buist sold the land to Southern Kraft Company, which in turn became part of International Paper.\n66,000 acres were mostly wooded with a few farms. During World War II, a portion of the area was a gunnery range for the United States Army Air Corps, and bombing and machine gun targets and the remnants of an army post can be found. Even before the attack on Pearl Harbor, people were told land was needed for a bombing range. By February 1942, over 200 people had agreed to give up their land and move, and by March 28, only seven families were left. The Conway Bombing and Gunnery Range was used from 1942 to 1947 and totalled 55,854 acres, with 36,608 acres leased and 19,246 acres government-owned.\nOn April 10, 1976, the Clear Pond Fire, the largest fire in South Carolina history, started from a campfire on International Paper land. After 25 days of no rain, with Carolina Bays vegetation that burns easily in an area where it is difficult to fight fires, 28,000 acres burned over two days, and 30,000 acres in five days.\nAlso in 1976, the South Carolina legislature created the Heritage Trust program, the first of its kind in the United States. The program allowed the South Carolina Department of Natural Resources and other state agencies to preserve areas with valuable and endangered plants, animals and other resources in heritage preserves.\nIn 1989, the first 6,422-acre section of Lewis Ocean Bay Heritage Preserve, with 20 Carolina Bays, was purchased from International Paper. A 985-acre tract called International Paper II was added in 1992, followed by the 1,936-acre International Paper III tract in 1993.\nIn 2007, 305 more acres called the Tiger Bay Tract were added after the South Carolina Department of Transportation asked property owners to donate the land, which could have been developed otherwise, in exchange for an interchange on Carolina Bays Parkway.\n754 acres called the Vaught Tract, with 23 more Carolina Bays, were purchased in 2013. SCDNR had hoped to buy the tract from the Vaught family since the preserve was created. The tract provides additional preserved green space to serve as a credit to allow widening of Glenns Bay Road. When wetlands are lost to development, developers must buy credits. Another addition in 2005 compensated for an interchange on Carolina Bays Parkway.\nThe most recent addition to the preserve is the 25-acre Hinson Tract added in 2014.\nInternational Drive\nnear Conway\n|direction_b=East\n|terminus_b=/Grissom Parkway in Carolina Forest\n|counties=Horry\n}}\nInternational Paper, developer of Carolina Forest, had wanted a ramp on Carolina Bays Parkway since the company began Carolina Forest in 1993. Burroughs Road, a dirt road also called International Drive, could provide access to South Carolina Highway 90 if paved. However, opponents of such a plan worried that the parkway would no longer serve as a bypass if there was too much development, and environmentalists feared the road's impact on the preserve. The upgrade to the Robert Grissom Parkway interchange was approved in November 2002, a month before the parkway's opening.  The paving of the first section of International Drive, connecting Carolina Forest to Grissom Parkway, was completed in 2004.\nIn April 2009, the area's worst fire in 30 years burned 2000 acres of the preserve and over 19,000 acres total, though controlled burns saved another 1000 acres. Black bear habitat was lost and it was believed the bears would move to other areas. Total estimated property damage was $25 million, with agricultural damage of $17 million. More than 70 homes were destroyed and 100 others damaged.\nThe fire made paving International Drive more urgent, since emergency vehicles could have reached the area more easily if the project had been completed. Legislation signed May 6, 2009 was expected to speed up paving of International Drive, which was on a list of projects funded by a one-cent sales tax. The project had been controversial because of the desire to keep the preserve's character and protect its wildlife.\nIn 2010, Horry County asked the South Carolina Department of Natural Resources for an easement for the International Drive widening. As part of the deal, tunnels and fences would be built to protect bears and give them a means to cross the road. In 2013 the county paid the South Carolina Department of Natural Resources $122,210 for the easement, but both requirements were dropped because the county claimed bears left the area after the fire, and the project was expanded to a four-lane road.\nAs of September 2014, the International Drive project was expected to cost $15.5 million for 5.6 miles between S.C. 90 and River Oaks Drive, with a start date of 2016. But in July 2015, the Coastal Conservation League and the South Carolina Wildlife Federation filed a request asking the state to go back to its original plans. The $16.5 million project had already been delayed for two years by environmentalists protesting other RIDE II projects. These were supposed to be completed in order, so delaying other projects also delayed International Drive. Environmentalists sought to protect the bears, even though documents showed there were only a few, but this would add $3 million to the cost of the road. The dispute led to hearings before an administrative law court judge in February 2016. On July 7, 2016, Judge Ralph King Anderson III ruled in favor of building the road, though if environmentalists chose to appeal, the road would not be built for two more years.\nLate in August 2016, clearing work began, but on August 23, environmentalists asked an administrative law judge to stop work. On November 8, Amy Armstrong, representing environmentalists, said in a letter to U.S. District Judge R. Bryan Harwell that the county agreed five areas would not be disturbed more than they had been. On January 20, 2017, the South Carolina Court of Appeals cleared the way for construction to begin.  While development has taken place on the east end, the western section will remain protected. International Drive officially opened July 25, 2018.\nAnimal and plant life\nThe National Audubon Society considers Lewis Ocean Bay Heritage Preserve \"a place of birding significance.\" It includes black bears, red-cockaded woodpeckers, and orchids. It is one of the few places to find Venus flytrap growing naturally. Coastal Carolina University biology professor James Luken predicted in 2008 that in South Carolina, where the species once was found in four counties, the Venus flytrap could be found only in the preserve within 10 years. In 2017, the U.S. Fish and Wildlife Service announced that with changes in the habitat that included nearby development, the Venus Flytrap needed an Endangered Species Act listing. In the bays themselves, which dry up in the summer, are blueberry, huckleberry, fetterbush and zenobia, along with sweetbay, catbriar, gallberry, titi. pinweed, cowbane, bearded grass pink, buckeye, and balduina. Surrounding the bays are shrub bogs called pocosins with pond pine and loblolly pine.  Other plants include mulberry bushes, wax myrtle bushes, and the pitcher plant. Other animal life includes bald eagles, raccoons, foxes, squirrels, and quail. Longleaf pine savannas can be found between the bays, though slash pine has been planted. Dwarf live oak and turkey oak are also found. Pottery provides evidence of Native American campsites. Biologist Steve Bennett said the people who camped here hunted deer, which are still hunted today.\nReferences\nExternal links\n*\n* [http://www.myrtlebeachonline.com/news/local/article196234929.html#navlink=SecList Video of International Drive]"
    }
  ]
}