{
  "content": [
    {
      "type": "text",
      "text": "# LGBTQ rights in the Central African Republic\n\nLesbian, gay, bisexual, transgender, and queer (LGBTQ) people in the Central African Republic face legal and social challenges not experienced by non-LGBTQ residents. Both male and female types of same-sex sexual activity are legal in the Central African Republic, but LGBTQ persons still face discrimination among the broader population.\nThe Central African Republic was one of the few African states that signed a \"joint statement on ending acts of violence and related human rights violations based on sexual orientation and gender identity\" at the United Nations, condemning violence and discrimination against LGBTQ people.\nLaws regarding same-sex sexual activity\nSame-sex sexual activity is legal. However, according to the U.S. Department of State's 2012 human rights report, The penal code criminalizes \"public expression of love\" between persons of the same sex is imprisonment for six months to two years or a fine of between 150,000 and 600,000 CFA francs ($300 and $1,200). When one of the participants is a child, the adult may be sentenced to two to five years' imprisonment or a fine of 100,000 to 800,000 CFA francs ($200 and $1,600); however, there were no reports that police arrested or detained persons [in 2012] under these provisions.\nRecognition of same sex relationships\nThere is no legal recognition of same-sex couples.\nSame-sex marriage is constitutionally banned as marriage is defined in Article 7 of the Constitution as \"the union between one man and one woman ... Family and marriage are under the protection of the State.\"\nAdoption and family planning\nAccording to a website of the French government, single and married people are eligible to adopt children. The website does not say whether single LGBTQ people are disqualified or not.\nDiscrimination protections\nThere are no laws protecting LGBT people from discrimination in areas such as health, employment, education, and access to goods and services. However, Law 24-001 on the Protection of Personal Data protects sexual orientation as sensitive data. Article 17 states \"Any processing of sensitive data is prohibited due to risks of discrimination or infringement of personal freedoms.\nLiving conditions\nThe U.S. Department of State's 2012 Human Rights Report found that,\nThere were no reports of the government targeting gays and lesbians. However, societal discrimination against lesbian, gay, bisexual and transgender persons was entrenched, and many citizens attributed the existence of homosexuality to undue Western influence. There were no known organizations advocating or working on behalf of the lesbian, gay, bisexual, or transgender persons.\nSummary table\n{| class=\"wikitable\"\n|-\n| Same-sex sexual activity legal\n|  (Always legal)\n|-\n| Equal age of consent\n|  (Always equal)\n|-\n| Anti-discrimination laws in hate speech and violence\n|\n|-\n| Anti-discrimination laws in employment\n|\n|-\n| Anti-discrimination laws in the provision of goods and services\n|\n|-\n| Anti-discrimination laws in all other areas (Incl. indirect discrimination, hate speech)\n| /  (Limited protection based on sexual orientation in personal data)\n|-\n| Same-sex marriage\n|  (Same-sex marriage constitutionally banned since 2016)\n|-\n| Recognition of same-sex couples\n|\n|-\n| Step-child adoption by same-sex couples\n| No\n|-\n| Joint adoption by same-sex couples\n| No\n|-\n| Gays and lesbians allowed to serve openly in the military\n|\n|-\n| Right to change legal gender\n|\n|-\n| Access to IVF for lesbians\n|\n|-\n| Commercial surrogacy for gay male couples\n| No\n|-\n| MSMs allowed to donate blood\n|\n|}\nSee also\n*Human rights in the Central African Republic\n*LGBTQ rights in Africa\nReferences"
    }
  ]
}