{
  "content": [
    {
      "type": "text",
      "text": "# LGBTQ culture in Ireland\n\nLGBTQ+ life on the island of Ireland is made up of persons who are lesbian, gay, bisexual, transgender, or otherwise.\nQueer culture and history\nPolitics\nThere was all-party support in 2010 for the Civil Partnership Bill, introduced by the Fianna Fáil / Green government which provided for legal recognition for the relationships of same-sex couples.\nAs of August 2014, all parties in the Dáil Éireann, the lower house of the Irish parliament, supported same-sex marriage: the Labour Party, the Green Party, the Socialist Party, Sinn Féin, Fianna Fáil and Fine Gael.\nBefore the 2011 general election, the Labour Party manifesto added a commitment to a referendum to allow same-sex couples to marry. This was mentioned as an item for the Constitutional Convention in the Programme for Government between Labour and Fine Gael after the election.\nIn 2006, at the opening of the new headquarters of the gay rights organisation GLEN in Dublin, the then-Taoiseach Bertie Ahern said:\n}}\nThe only Irish political party that officially came out to oppose the LGBTQ+ rights was the small Christian Solidarity Party, which as of September 2023 does not currently have any representation on the local or national level.\nOn 23 May 2015, through a nationwide referendum, Ireland became the first country to legalise same sex marriage by popular vote.\nOpenly LGBT Oireachtas members\n* David Norris, elected as an Independent Senator for Dublin University in every election since 1987, was the first openly gay member of the Oireachtas.\n* Colm O'Gorman served as a Senator from May 2007 to July 2007. He was appointed as a Taoiseach's nominee representing the Progressive Democrats.\n* Dominic Hannigan, was elected as a Labour Party Senator in 2007, and was elected to the Dáil in 2011 for Meath East, becoming the first openly gay person elected as a Teachta Dála.\n* John Lyons, was elected in 2011 in Dublin North-West for the Labour Party.\n* Katherine Zappone, was appointed to the Seanad as a Taoiseach's nominee in May 2007. She was the named plaintiff in a case to seek legal recognition of her marriage and was the first openly gay Oireachtas member to also be married. She was elected as a TD at the 2016 general election.\n* Jerry Buttimer, was elected as TD for the Cork South-Central constituency in the 2011 general election for Fine Gael. In April 2012, he became the first Fine Gael TD to come out, doing so after the party announced a new forum for gay equality. He is the chairman of Fine Gael LGBT.\n* Leo Varadkar, first elected in 2007 and appointed to Government in 2011, served as Minister for Transport, Tourism and Sport from 2011 to 2014. He also served as Minister for Health since July 2014. In January 2015, he told Miriam O'Callaghan on RTÉ radio that he is gay. In 2017 he became a Taoiseach (Head of Government).\n* Fintan Warfield is a former Sinn Féin Mayor of South County Dublin, who is currently in Cultural and Educational Panel of Sinn Féin.\n* Cian O'Callaghan was elected Mayor of Fingal in 2012, becoming Ireland's first openly gay mayor. Cian has a strong track record in local government. He was first elected as a Councillor in 2009 and then as Mayor of Fingal County Council in 2012. He was elected in 2020 as a Social Democrat TD for the Dublin Bay North constituency.\n*Annie Hoey, who has served as a Labour Party Senator for the Agricultural Panel since April 2020, is openly bisexual.\n*Roderic O'Gorman was elected as a Green Party TD for the Dublin West constituency in the 2020 General Election and subsequently became Minister for Children, Equality, Disability, Integration and Youth.\nMedia\nIreland's longest running LGBT publication is Gay Community News, which was first published in 1988 before homosexuality was legal in Ireland. In April 2013, EILE Magazine was launched, serving as a new platform for Ireland's LGBT community.\nThe national broadcaster RTÉ provides various LGBT related programming, such as the television documentary Growing Up Gay, or the drama series Raw, which contained gay characters and gay-related storylines. The RTÉ programme Telly Bingo was presented from 2001–2004 by drag queen Shirley Temple Bar. The radio station RTÉ Pulse schedules Wednesday nights as Gay Wednesday where they broadcast programming related to the gay community. Drag queen Joanna Ryde is a presenter on regional youth station Beat 102 103.\nGay life in the country\nCities and towns\nThe gay scene in Ireland is quite developed. Irish society has become more open and tolerant as a result of increased levels of prosperity and rising liberal attitudes. There are vibrant gay scenes in all major Irish cities.\nThere are 8 gay & lesbian resource centres in Ireland &ndash; Dublin, Belfast, Limerick, Derry, Waterford and Dundalk all have one each, and Cork is home to two: one for gay men and one for lesbians.\nGay pride\nAll Irish cities and many smaller towns celebrate Gay Pride with parades and festivals.\nThe town of Sligo home to a little over 20,000 inhabitants has its own annual Gay Pride parade and festival, such events are rising in popularity in rural areas of Ireland.\nThe gay scene across the island of Ireland is brought together during the annual Alternative Miss Ireland drag contest, Ms Gay Ireland and Mr Gay Ireland events.\nBear Movement\nAs in many other countries around the world, the Bear Community has taken hold in Ireland and continues to grow. The bear movement considers itself a counter culture to the mainstream gay scene and works toward challenging the single archetype of the effeminate gay man. Most things traditionally considered masculine are celebrated within the Bear community, and Bears identify as a large subset of an already diverse demographic of gay men in Ireland. There are Bear events held monthly in Belfast and in Dublin.\nSt. Patrick's day\nThe LGBT community is no exception when it comes to taking part in the Saint Patrick's Day parades and celebrations across the island in cities such as Dublin, Belfast, Cork, Limerick, Derry, Galway and Waterford.\nAnnual events\nThere are a varied range of LGBT-themed events throughout the calendar year in the Republic of Ireland and Northern Ireland:\n{| class=\"wikitable\" style=\"font-size: 95%;\"\n|-\n! style=\"background:#B0C4DE;\" | LGBT event\n! style=\"background:#B0C4DE;\" | Location\n! style=\"background:#B0C4DE;\" | Notes\n! style=\"background:#B0C4DE;\" | Date\n|-\n| Alternative Miss Ireland\n| Dublin/Ireland\n| All island contest; includes various regional heats\n| March\n|-\n| The Rainbow Ball\n| Dublin/Ireland\n| Annual fundraising gala dinner in aid of BeLonG To\n| November\n|-\n| Mr Gay Ireland\n| Dublin/Ireland\n| All island contest; includes various regional heats\n| October\n|-\n| Ms Gay Ireland\n| Ireland\n| All island contest; includes various regional heats\n| November\n|-\n|-\n| Arthouse\n| Ireland\n| Art Auction in aid of Outhouse LGBT+ Centre\n| November\n|-\n| Saint Patrick's Day\n| Ireland\n| LGBT section of main parades\n| 17 March\n|-\n| World AIDS Day\n| Ireland\n| Charity event\n| 1 December\n|-\n| Dublin Pride\n| Dublin\n| Parade and 10-day festival\n| June\n|-\n| GAZE\n| Dublin\n| Dublin International Lesbian and Gay Film Festival\n| late July–early August\n|-\n| Dublin Gay Theatre Festival\n| Dublin\n| Presentation of works by gay authors and performers or that contain LGBT themes\n| early May\n|-\n| Béar Féile\n| Dublin\n| Festival celebrating the Bear community\n| late March\n|-\n| aLAF\n| Dublin\n| Lesbian Arts Festival\n| Spring\n|-\n| Lesbian Lives\n| Dublin\n| Conference organised by the Women's Studies Centre at UCD\n| February\n|-\n| Belfast Pride Festival\n| Belfast\n| Parade and week-long festival\n| July/August\n|-\n| Outburst\n| Belfast\n| Queer Arts Festival\n| November\n|-\n| Cork Pride Festival\n| Cork\n| Parade and week-long festival\n| August\n|-\n| OutLook\n| Cork\n| Cork Film Festival programme dedicated to LGBT films and shorts\n| November\n|-\n| Lesbian Fantasy Ball\n| Cork\n|\n|\n|-\n| Cork Women's Fun Weekend\n| Cork\n|\n|\n|-\n| Black Pride Ireland\n| Ireland\n|\n|\n|-\n| Limerick Pride\n| Limerick\n| Parade and 8-day festival\n| July\n|-\n| Foyle Pride Festival\n| Derry\n| Parade and 4-day festival\n| August\n|-\n| Pride in Newry\n| Newry\n|Parade and 5-day festival\n|August\n|-\n| Galway Community Pride\n| Galway\n| Parade and 3-day festival\n| August\n|-\n| Waterford Pride Mardi Gras\n| Waterford\n| Parade and 7-day festival\n| May/June\n|-\n| Sligo Pride Festival\n| Sligo\n| Parade and 7-day festival for Sligo and the North-West of Ireland\n| August\n|-\n| Omagh Pride\n| Omagh\n| Approximately annual parade and single-day festival\n|\n|-\n|}\nSee also\n* LGBT rights in the Republic of Ireland\n** Recognition of same-sex unions in the Republic of Ireland\n** List of laws and reports on LGBT rights in the Republic of Ireland\n* LGBT rights in Northern Ireland\nReferences\nExternal links\n* [http://www.belfastpride.com/ Belfast Pride]\n* [http://dublinpride.ie/ Dublin Pride]"
    }
  ]
}