{
  "content": [
    {
      "type": "text",
      "text": "# LGBTQ culture in Mexico City\n\nThere is a large LGBTQ community in Mexico City, which became the first major city in Latin America to legalize same-sex marriage in 2010. In 2019, Oscar Lopez of Slate said Mexico City \"has become something of a queer oasis. It's here where LGBTQ people enjoy more rights than anywhere else in the country\".\nMexico City hosted the International Lesbian, Gay, Bisexual, Trans and Intersex Association's global LGBTQ rights conference in 2014. In 2024, the city's 46th annual pride parade (Mexico City Pride) was attended by approximately 260,000 people. Former mayor Claudia Sheinbaum has expressed her support for the LGBTQ community.\nIn 2020, Javier Berain became Mexico City's first openly gay commanding officer.\nBall culture\nMexico City-based House of Machos is the nation's first ballroom house. Among ball events is Religiosas Ball.\nBusiness and organizations\nin Zona Rosa, Mexico City]]\nCasa Frida works with approximately 300 LGBTQ asylum seekers and migrants in the city, as well as Monterrey and Tapachula. According to NBC News, a \"campaign led by the Organization for Refuge, Asylum and Migration, or ORAM, which assists LGBTQ asylum-seekers, has launched a campaign in Mexico to raise money to offer safe shelter, food and transportation for a month to 100 LGBTQ refugees or asylum-seekers in Mexico City.\"\nGay bars and nightlife\nThe Zona Rosa (\"Pink Zone\") is the city's most prominent LGBTQ entertainment district, with many gay bars and other nightlife.\nLa Cañita is a beach-themed bar and restaurant near downtown. Staff at La Purísima, which has been described as an \"unapologetically irreverent\" gay bar, dress as Catholic nuns and priests. Rvuelta Queer House has been described as an \"artsy, queer indoor-outdoor resto-bar-community centre\" with \"a young heart and an old soul\". Other gay bars have included Baños Finisterre, Club Roshell, El Nueve, Marrakech Salón, La Perla, Sodome, and Tom's Leather Bar.\nDrag\nDrag performers from Mexico City include Drag Race México contestants Elektra Vandergeld, Eva Blunt, Luna Lansman, and Nina de la Fuente.\nLaw\nA law known as \"Ley Paola Buenrostro\", which was introduced by the United Commissions on Gender Equality and Administration and Prosecution of Justice, makes the murder of a transgender person punishable by as many as 70 years in prison. It was approved by the state legislature in a 45 to 1 vote. Mexico City become the nation's second to pass such a law.\nPopular culture\nThis Is Not Berlin (2019) is about a teenager living in the city during the 1986 World Cup and has been described as a \"love letter\" to Mexico City's queer punks.\nSee also\n* LGBTQ culture in Mexico\n* LGBTQ rights in Mexico City\n* Nicho Bears and Bar\nReferences"
    }
  ]
}