{
  "content": [
    {
      "type": "text",
      "text": "# LGBTQ culture in Hyderabad\n\nHyderabad is a conservative city when it comes to LGBT rights, compared to other Indian Metros. But since it slowly started becoming the second IT-capital after Bangalore, there has been a continuous influx of people of all cultures from across India. In the past few years, there has been some increase in LGBT activism in Hyderabad, including pride marches of 2013 and 2014.\nSlowly, Top MNCs have been introducing LGBT friendly policies in their Hyderabad offices.\nOrganizations\nThere has been a few organizations/informal support groups setup in recent times, doing good work in LGBT rights in Hyderabad.\nA Couple of them are listed below.\n*Wajood\n*Suraksha\n*Queer Nilayam\n*Queer Campus Hyderabad\n*Hyderabad For Feminism\n*Hyderabad Queer Swabhiman Yatra\n*Queer Women Collective\nQueer Nilayam\nQueer Nilayam (నిలయం) is a Support Group for the LGBTQIA+ and Queer community in Hyderabad, India. It was established by a few queer folks to provide support to the community. This is an open space and participants are encouraged to provide more direction for queer folks to socialize and create a sense of belonging.\nThe Firefly Community\nStarted in the year 2018, The Firefly Community is a Hyderabad based NGO which works on issues related to \"Gender & Inclusion\". The Community works on raising awareness by creating safe spaces and includes the medium of art to discuss issues which are a taboo in the society. The Co-Founders include Alifiya Khan, Lawyer, Ayesha Syeda, Medical Student at VRK Medical College, Neeti Sudarsi, Medical Student at Apollo Medical College and Aaliya Syeda, Architecture Student at GITAM University. The Community aims at raising awareness through the medium of art and worked extensively on topics such as LGBTQ, Mental Health, Indian Sign Language, Sexual Abuse, Menstrual Health etc.\nMobbera Foundation\nMobbera Foundation is a registered unfunded organisation which is led by Sandipan Kushary and Anil which works for human rights, exclusively for LGBTQIA+community through Arts and cultural programs.\nDragvanti\nDragvanti  is a non profit organization from Hyderabad which is a safe space for all the drag practitioners within the city. Hyderabad drag club has started the drag scene in Hyderabad and been organizing drag events in the city and awareness sessions through drag on AIDS, safe sex, queer story telling and open mikes.\nHomophobia/Transphobia in Hyderabad\nThere have been numerous instances of incidents of homophobia and transphobia in Hyderabad.\nBack in 2011, a local news channel TV9 (Telugu) carried out a sting operation on gay dating websites and gay clubs, presented a very demeaning and homophobic view of Gay culture of Hyderabad. Following this news report, there have been many protests in Hyderabad and across India. News Broadcasting Authority of India issued notices to TV9 channel, following which it aired an unconditional apology which can be said as the first win of city's LGBT community.\nIn early 2013, a Kashmiri student in the English and Foreign Languages University, Hyderabad, allegedly committed suicide because of homophobia of university authorities, students and faculty.\nIn 2015, Few queer and trans persons were restricted from entering the GVK One mall. Included in the group was trans activist Vyjayanti Vasanta Mogli, who filed a complaint about the discrimination and asked GVK to apologize for the discrimination.\nHyderabad's LGBTIQ History\n* 2012: LGBT support group Wajood setup\n* 2013: First Queer Pride in Hyderabad\n* 2014: First Queer Carnival (Festival) by Queer Campus Hyderabad\n* 2105: 1st Telangana Queer Swabhimana Walk\n*2019: India's First Drag Con, Hyderabad Drag Con 2019 by Hyderabad Drag Club has organised Indian's first drag conference in 2019 at Hylife Brewery in association with Humans of Nirvana called Hyderabad Drag Con in 2019.  the event featured based drag artists and performers such as Patruni Sastry, Colonge and Sajiv Pasala.\n* 2021: Setup of Queer Nilayam - a support group for the LGBTQIA+ community in Hyderabad.\n* 2021: First Queer Magazine of Hyderabad - QueerNama.\n* 2024: Queer Indie Film and Literature Festival (QIFLIF), annual event.\nReferences\nExternal links\n*[http://wajoodlgbt.blogspot.in/ Wajood's blogs link]\n*[https://qiflif.notion.site/Queer-Indie-Film-and-Lit-Fest-2025-Edition-259052da60e780939138cc650b71615a QIFLIF Web Page]\n*[https://www.queernilayam.org]"
    }
  ]
}