{
  "content": [
    {
      "type": "text",
      "text": "# Lhasa Newar\n\nLhasa Newar (or Lhasa Newah; ) were the expatriate Newar traders and artisans who traveled between the Kathmandu Valley and Tibet from centuries ago. These Nepalese merchants conducted trade between Nepal, Tibet and Bengal, India over the Silk Road, and acted as a bridge for economic and cultural exchanges between South Asia and Central Asia.\nAlong with the merchants, there were colonies of artisans in various parts of Tibet who were engaged in creating Buddhist art. They were major players in the exchange of art styles across the Himalaya.\nThe thousand-year-old Lhasa Newar tradition came to an end after the caravan route linking India and Tibet through Sikkim was shut down by the Sino-Indian War in 1962. Subsequently, the merchants and craftsmen based in Tibet closed up shop and returned home to Nepal for the last time.\nHistory\nAccording to folklore, Singha Sartha Aju was the first merchant to travel to Tibet. The history of the Lhasa Newars officially dates from the seventh century with the marriage of Nepalese Princess Bhrikuti with Tibetan King Songtsän Gampo. The traders and artisans who accompanied Bhrikuti to Lhasa as part of her retinue established commercial and cultural ties between Nepal and Tibet.\nIn the 1640s, a treaty was negotiated under which Newar merchants were allowed to establish 32 business houses in Lhasa. It was also agreed that Nepal would mint coins for Tibet. By this time, the number of traders had risen considerably. Eighteenth-century traveller Ippolito Desideri noted that merchants of Nepal were \"numerous\" in Lhasá.\nThe Newars were also organized into \"pala\" () societies which arranged the celebration of festivals and provided a place for get-togethers. The merchants celebrated Mohani and other feasts like they did in Kathmandu. There were 10 \"palas\" originally in Lhasa, and seven remained active until recent times—Chyatangya, Chhusingsyar, Ghorasyar, Jhwala, Lhakam, Kun and Tarunsyar. The Newars in Shigatse and other places in Tibet had their own \"palas\". Returning merchants and craftsmen were called \"Lhasa Newars\". Most of them were Buddhist Newars like the Uray, Bajracharya, Shakya and Dhakhwa. There were also many Shresthas and Maharjans among them.\nTrade\nNewar traders exported finished products from Nepal and India to Tibet and brought back goods from Tibet and other parts of Central Asia. Metal utensils, sacred statues and rice from Nepal, and textiles and other factory products from India were the main exports to Tibet. The Lhasa Newars brought back gold dust, wool, musk pods, pelts and yak tails which were forwarded to Kolkata. The older generation in the village of Sankhu also regularly play Mahjong brought from Tibet.\nMule, donkey and yak caravans transported the trade goods over the Himalaya and across the Tibetan Plateau. In Nepal, porters carried the loads over the mountains on their backs.\nThe trade route connecting India and Tibet goes over the Himalaya. The Lhasa Newars used the Gyirong (Kyirong, Nepali: , )  and Kuti (Nepali: ) (Nyalam Tong La) passes to the north of Kathmandu to travel to Lhasa. From the 1930s, a new caravan route over the lower Nathu La and Jelep La passes on the border between Sikkim and Tibet became more popular. These passes were approached through Gangtok in Sikkim and Kalimpong in West Bengal, India.\nThe Lhasa Newars lived in Lhasa, Shigatse and Gyantse in Tibet and in Kolkata and Kalimpong in India for years at a time. Lhasa, as a center on the Silk Road, attracted merchant caravans from across Central Asia with whom the Lhasa Newars engaged in trade. A few business houses also maintained shops in Leh, Ladakh which lies on the caravan route to Kashgar in Chinese Central Asia. Kolkata was a center of wholesale trade.\nArt\nLhasa Newar artisans created statues, painted paubhas and frescoes and built temples in Tibet and other parts of Central Asia, and were instrumental in the spread and development of Buddhist art throughout the region. The Jokhang Temple in Lhasa and the Kumbum Stupa in Gyantse are examples of their artistic legacy in Tibet. The White Dagoba in Beijing, China, built by Arniko in the 13th century, is another specimen of the artistry of the Lhasa Newars.\nNewar artists were the most sought after among the foreign artists living in Tibet. French missionary traveller Évariste Régis Huc has written that it is they who construct for the Buddhist temples those fine roofs of gilt plates, which resist all the inclemencies of the seasons and always retain a marvellous freshness and glitter. They are so skilful at this class of work that they are sent to the very interior of Tartary to decorate the Lamaseries.\nNewar artists gained importance after the destruction of Indian Buddhism in 1203 as they were the only remaining experts in traditional Buddhist art. Tibetan artists thus turned to them for inspiration and learned the Newar style, or Beri as it is now known. The style prevailed for more than four centuries, and reached its peak from 1360 to 1460 when it was adopted as Tibet's universal painting style.\nThe period from the 14th to the 16th centuries is considered a golden age of Nepalese art. During this time, Newar artists travelled widely and left their mark on the artistic styles of Tibet, Bhutan, China and Mongolia.\nIn popular culture\nLhasa Newars have been the subject of ballads, epic poetry and novels in Nepal Bhasa and other languages, mostly on the theme of loneliness and couples forced to endure long periods of separation.\n* The best known epic is Ji Waya La Lachhi Maduni (\"It hasn't been a month since I came\"), written in the late 18th century, about a trader who leaves for Tibet despite the pleas of his newly wedded wife. One day, a false message arrives that he has died in Tibet, and the wife burns herself on the funeral pyre in grief. Years later, the husband returns. Upon being told of her death, he goes away and becomes an ascetic. This poem was the source of \"Muna Madan\", a short epic story in the Nepali language composed by Laxmi Prasad Devkota in 1936.\n* In the song \"My beloved has gone abroad\", a wife longs for her husband who has gone to Tibet on business. One day, she is elated to receive a message from Tibet, however, the message contains news of his death.\n* Another song, \"Oh husband, how shall I live\" was written towards the end of the 19th century. In this song, a woman expresses her sadness as her husband leaves for Tibet soon after their marriage.\n* Bhrikuti, a novel by Dharma Ratna Yami, was awarded the Shrestha Sirapa in 1959. Another novel Ang Lhamo recounts the saga of a Tibetan girl amid a backdrop of the Chinese entry into Tibet. The first edition, published in 1970 by Pasa Muna, was banned by the Nepalese government. A second edition appeared in 1992, published by Paleswan Pithana, Kathmandu.\n* Mimmanahpau (\"Unburnt Letter\") by Chittadhar Hridaya is a novel in the form of a letter from a merchant in Lhasa to his wife in Kathmandu. The husband misses home so much that he regrets the life of a trader. Published in 1968, the novel has been translated into English by Kesar Lall.\n* In the novel The Oriental Casebook of Sherlock Holmes, the famed detective befriends Gorashar, a Newar merchant in Lhasa, and travels with him to Kathmandu during the course of his journeys in Asia to unravel varied mysteries.\nGallery\nFile:Bundesarchiv Bild 135-KA-06-085, Tibetexpedition, Marktplatz in Lhasa.jpg|Barkhor market in Lhasa, 1938.\nFile:Nepalese Chamber1943.jpg|Nepalese Chamber of Commerce, Lhasa, 1947.\nFile:Kmt and krt on bsa.jpg|Merchants on a BSA Bantam in Lhasa, 1952.\nFile:Lhasa newar merchants.jpg|Newar traders in Tibetan and Western wear, 1945.\nFile:Sarbagya man tuladhar.jpg|Trader wearing a Mauser pistol, Lhasa, 1946.\nFile:Bundesarchiv Bild 135-S-12-35-20, Tibetexpedition, Lhasa, Markt.jpg|A Lhasa Newar (far left) on the Barkhor, 1938.\nFile:Bundesarchiv Bild 135-S-18-10-26, Tibetexpedition, Gyantse, Chörten.jpg|Kumbum Stupa (left) in Gyantse, 1938.\nFile:Miaoyingsi baita.jpg|Miaoying Temple in Beijing, China, 13th century.\nFile:Newar caravan in tibet.jpg|Mule caravan of Newar merchants, 1943.\nFile:Bundesarchiv Bild 135-BB-082-12, Tibetexpedition, Floß bei Chagsam.jpg|Yak hide boat on the Yarlung Tsangpo, 1938.\nFile:Nepalese mohar 816.jpg|Nepalese coin of Bhupatindra Malla, 1696.\nFile:Tibet-6048 - Largest Sitting Maitreya Buddha.jpg|Maitreya Buddha at Tashilhunpo Monastery.\nSee also\n*Nepalese Chamber of Commerce, Lhasa\n*Newa people\n*Singha Sartha Aju (legendary trader)\n*Uray (caste group)\nReferences\nFurther reading\n* Hilker, DS Kansakar (2005), Syamukapu: The Lhasa Newars of Kalimpong and Kathmandu, Kathmandu: Vajra Publications. .\n* Lall, Kesar (2007), The Newar Merchants of Lhasa, Kathmandu: Ratna Pustak Bhandar. .\n* Tuladhar, Kamal Ratna (second edition 2011), Caravan to Lhasa: A Merchant of Kathmandu in Traditional Tibet, Kathmandu: Lijala and Tisa. ."
    }
  ]
}