{
  "content": [
    {
      "type": "text",
      "text": "# Li Jing (Tang dynasty)\n\n(aged 77–78)\n| death_place =\n| other_names =\n| father = Li Quan\n| mother = Lady Han\n| children =\n| occupation = Military general, military strategist, writer\n}}\n|j=Lei5 Zing6\n|y=Léih Jihng\n|ci=\n}}\nLi Jing (571 – July 2, 649), courtesy name Yaoshi, posthumous name Duke Jingwu of Wei (also romanized as Duke Jingwu of Wey), was a Chinese military general, strategist, and writer who lived in the early Tang dynasty and was most active during the reign of Emperor Taizong. In 630, Li Jing defeated the Göktürks, led by Jieli Khan, with just 3,000 cavalry soldiers in a surprise attack, allowing the Tang Empire to subjugate the Göktürks and reduce them to the status of a vassal under the Tang Empire. Li Jing and Li Shiji are considered the two most prominent early Tang generals.\nDuring the Sui dynasty\nLi Jing was born in 571, during the Sui dynasty's predecessor state Northern Zhou. His clan was from the Chang'an region. His grandfather Li Chongyi () served as a provincial governor during the Northern Wei, and his father, Li Quan (), served as a commandery governor during Sui. In his youth, Li Jing was said to be handsome and ambitious, and was talented both in literary and military matters. His maternal uncle was the Sui general Han Qinhu (), and it was said that Han was impressed by his talent, stating, \"You are the only person that I can talk to about Sun Tzu's and Wu Qi's strategies.\"\nEarly in his career, Li Jing served as a minor county official for Chang'an countyone of the two counties within Chang'an, which served as Sui's capital. He later served as a low level official within the imperial administration, and it was said that he impressed both the prime minister Yang Su and the important minister Niu Hong ().\nNear the end of the reign of Emperor Yang, Li Jing served as the vice prefect of the Mayi Commandery (, roughly modern Shuozhou, Shanxi), when he served under the general Li Yuan the Duke of Tang, who was in charge of the nearby important city of Taiyuan (, in modern Taiyuan, Shanxi) against Eastern Tujue forces. Li Jing came to suspect that Li Yuan was plotting a rebellion, and therefore pretended to commit a crime and asked to be locked up and delivered to Emperor Yang, who was then at Jiangdu (, in modern Yangzhou, Jiangsu). However, he was first delivered to Chang'an, and then, as nearly the entire Sui state was engulfed in agrarian rebellions at that time, there was no way to deliver him to Jiangdu from there.\nIn 617, Li Yuan indeed rebelled, and soon captured Chang'an, declaring Emperor Yang's grandson Yang You the Prince of Dai emperor (as Emperor Gong) but seizing power as regent. Knowing that Li Jing was planning to report his plans to Emperor Yang, Li Yuan set to execute him. At the execution, Li Jing yelled, \"You, duke, rose in order to eliminate tyrannical rule for the people. You are not concerned about what is important, but instead are executing a brave man on account of personal enmity!\" Li Yuan was impressed by his words, and Li Yuan's son Li Shimin interceded on Li Jing's behalf. Li Yuan released Li Jing, whom Li Shimin soon retained to serve on his staff.\nDuring Emperor Gaozu's reign\nIn 618, after news arrived at Chang'an that Emperor Yang was killed in a coup at Jiangdu led by the general Yuwen Huaji, Li Yuan had Yang You yield the throne to him, establishing Tang dynasty as its Emperor Gaozu. Li Jing continued serving the new dynasty. In 619, Li Jing participated in a campaign against one of Tang's major enemies, Wang Shichong the Emperor of Zheng, and was promoted for his accomplishments. Later that year, Emperor Gaozu sent him to Kui Prefecture (, modern eastern Chongqing) to plan a military operation against another major enemy, Xiao Xian the Emperor of Liang, who then ruled the modern Hubei, Hunan, and Guangxi region. When he first reached Jin Prefecture (, roughly modern Ankang, Shaanxi), he encountered bandits in the mountain, who had several times defeated Li Yuàn (, note different tone and character than Emperor Gaozu's name ()) the Prince of Lujiang (Emperor Gaozu's distant nephew). Li Jing joined forces with Li Yuàn to defeat those bandits. However, as he arrived at the borders with Liang, he was blocked by Liang forces and long could not reach there, having to stop at Xia Prefecture (, roughly modern Yichang, Hubei). Emperor Gaozu, believing that Li Jing was intentionally not advancing, was sufficiently angry that he secretly ordered the commandant at Xia Prefecture, Xu Shao (), to execute Li Jing. Xu, however, was appreciative of Li Jing's talent, and submitted a petition urging that Li Jing be spared, and Emperor Gaozu relented. Meanwhile, in spring 620, around the same time, Ran Zhaoze () the leader of the Kaishan Tribe (), rebelled against Tang rule and attacked Kui Prefecture. When Emperor Gaozu's distant nephew Li Xiaogong the Duke of Zhao Commandery fought Ran, he was initially unsuccessful, but Li Jing reinforced him with 800 men and defeated and killed Ran.\nIn 621, Li Jing submitted 10 strategies against Liang, and Li Xiaogong submitted them to Emperor Gaozu. Emperor Gaozu approved of Li Jing's plans, and made Li Jing Li Xiaogong's assistant in the campaign against Liang. It was said that as Li Xiaogong was still inexperienced, Emperor Gaozu actually put Li Jing in charge of most of the operations, although Li Xiaogong was formally commander of the operations.\nIn fall 621, Emperor Gaozu commissioned Li Xiaogong, with Li Jing as his assistant, to launch a major attack on Xiao Xian's Liang state, with Li Yuàn and the other generals Tian Shikang () and Zhou Faming () attacking on other fronts. At that time, the Yangtze River had a high water level and was flowing rapidly. While many officers under him suggested delaying the campaign, Li Jing suggested to Li Xiaogong that the rapid water was a good opportunity to launch a surprise attack on Xiao Xian's capital Jiangling (, in modern Jingzhou, Hubei). After defeating the Liang general Wen Shihong (), Li Xiaogong put Jiangling under siege, cutting off Xiao Xian's communications with the armies in the rest of his territory. Li Jing suggested floating the Liang ships that they captured down the Yangtze, to confuse the approaching Liang relief forces into believing that Jiangling had fallen already. Xiao, not knowing that the relief forces were only a few days away, surrendered to Li Xiaogong. By the suggestion of Li Jing and Xiao's official Cen Wenben, who had persuaded Xiao to surrender, Li Xiaogong strictly prohibited pillaging and retribution against Liang generals. The Liang provinces, upon hearing the news of Jiangling's fall, soon largely submitted to Tang. Li Xiaogong delivered Xiao to Chang'an, where Emperor Gaozu executed him. For his accomplishments, Li Jing was created the Duke of Yongkang. Subsequently, Emperor Gaozu commissioned Li Jing to head south to persuade the modern Guangdong and Guangxi region, which had submitted to Xiao Xian and another rebel ruler, Lin Shihong the Emperor of Chu, to submit to Tang. Li Jing advanced to Gui Prefecture (, roughly modern Guilin, Guangxi) and was able to persuade several of the most major warlords of the region, including Feng Ang (), Li Guangdu (), and Ning Zhenzhang () to submit to Tang. Subsequently, Li Jing was made the commandant at Gui Prefecture.\nIn fall 623, the Tang general Fu Gongshi, who had served as the deputy of the powerful general Li Fuwei the Prince of Wu as the military governor of the lower Yangtze region, rebelled against Tang rule while Li Fuwei was at Chang'an, declaring himself the Emperor of Song. Emperor Gaozu commissioned Li Xiaogong to attack Fu, again making Li Jing Li Xiaogong's assistant, and also sending other generals Huang Junhan () and Li Shiji to attack Fu from other fronts. Li Xiaogong and Li Jing sailed down the Yangtze, attacking and defeating the Song generals at multiple battles. Fu ordered his generals Feng Huiliang () and Chen Dangshi () to take up position at Mount Bowang (, in modern Ma'anshan, Anhui, preparing for the assault, instructing Feng and Chen not to engage Li Xiaogong, but to wear him down. However, Li Xiaogong, under Li Jing's suggestion, cut off their supply route, and when Feng and Chen's food supplies ran low, they challenged Li Xiaogong. Against suggestions by some officers that he bypass Feng and Chen and attack the Song capital Danyang (, in modern Nanjing, Jiangsu) directly, Li Xiaogong, again with Li Jing's suggestion, confronted Feng and Chen, initially using the weaker segment of his forces to battle Feng and Chen and, after initial losses, draw Feng and Chen in deeper, and then attacked them, defeating them decisively, with the aid of Li Fuwei's subordinate general Kan Leng (). After the victory, Li Xiaogong and Li Jing attacked Danyang. Fu, in fear, abandoned Danyang and fled east, but was captured by the local men and delivered to Danyang. Emperor Gaozu, praising Li Jing, made the comment: \"Li Jing is the fatal illness for Xiao and Fu. How could even Han Xin, Bai Qi, Wei Qing, or Huo Qubing exceed him?\" Subsequently, Li Xiaogong was put in charge of the region, and Li Jing served as his assistant. it was said that Li Jing contributed much in pacifying the region after the region had seen much bloodshed for years.\nIn 625, Eastern Tujue attacked Taiyuan, and Li Jing led some of his troops north to resist Eastern Tujue. It was said that all of the other Tang generals were defeated by Eastern Tujue forces, but Li Jing was able to preserve his troops. In 626, when Eastern Tujue attacked again, Li Jing was made the commandant at Ling Prefecture (, roughly modern Yinchuan, Ningxia), and he tried to cut off Eastern Tujue's return path, although soon Tang and Eastern Tujue made peace. It was said that at this time that Li Shimin, then engaged in an intense rivalry with his older brother Li Jiancheng the Crown Prince and fearing that Li Jiancheng might be intending to kill him, solicited advice from Li Jing and Li Shiji, and both refused to speak on the matter, drawing respect from Li Shimin for their unwillingness to be involved in an internecine struggle. In 626, Li Shimin set a show down for Li Jiancheng and another brother, Li Yuanji the Prince of Qi at Xuanwu Gate, killing them, and then effectively forced Emperor Gaozu to create him crown prince and then pass the throne to him (as Emperor Taizong).\nDuring Emperor Taizong's reign\nLi Jing continued to serve in Emperor Taizong's administration, and was soon made the minister of justice. In 628, in addition to that post, he also became acting Zhongshu Ling () – the head of the legislative bureau of the government (), a post considered one for a chancellor. In 629, he was made the minister of war.\nAround the new year 630, with Eastern Tujue in internal turmoil, with its Jiali Khan Ashina Duobi attacking his nephew and subordinate khan, the Tuli Khan Ashina Shibobi (), Emperor Taizong commissioned Li Jing, Li Shiji, Wei Xiaojie, Li Daozong, Chai Shao (), and Xue Wanche () to attack Eastern Tujue, with Li Jing in overall command. Li launched his attack in a surprise manner, from Mayi through Wuyang Range (, in modern southern Hohhot, Inner Mongolia), capturing the important city of Dingxiang (, in modern Hohhot). In fear, Ashina Duobi retreated to Qikou (, in modern Xilin Gol League, Inner Mongolia). Li Jing then sent secret messengers to persuade his associate to surrender. One of them, Kangsumi (), took Emperor Yang's wife Empress Xiao and her grandson Yang Zhengdao, whom Eastern Tujue had created the Prince of Sui, and surrendered to Li Jing. Ashina Duobi sent messengers to Emperor Taizong, offering to submit and to pay homage to him later, but was still considering fleeing further with his forces. Emperor Taizong sent the official Tang Jian () as an envoy to Ashina Duobi, but also ordered Li Jing to escort Ashina Duobi. Li Jing, reading between the lines and believing that Emperor Taizong's order was to attack Ashina Duobi, after joining forces with Li Shiji, launched the attack. They defeated and captured most of Ashina Duobi's remaining forces and killed his wife, Sui's Princess Yicheng. Ashina Duobi fled further, and was soon captured by the generals Li Daozong and Zhang Baoxiang (). Eastern Tujue's nobles all submitted to Tang. In recognition of Li Jing's great victory, Emperor Taizong issued a general pardon and ordered his people to feast for five days. He also created Li Jing the greater title of Duke of Dai.\nWhen Li Jing returned to the capital, however, the imperial censor Xiao Yu accused him of allowing his soldiers to plunder the Eastern Tujue treasury. Emperor Taizong rebuked Li Jing, but still increased the size of his fief and awarded him with silk. Later, regretting rebuking Li Jing, he stated to Li Jing, \"People have accused you to hurt you. I realize this now. Please do not mind it.\" He awarded Li Jing with even more silk. Later in 630, he made Li Jing Shangshu Puye (), the head of the important executive bureau of government (), also a chancellor post. It was said that Li Jing spoke very little when conferencing with other chancellorsthen considered a virtue. A more plausible explanation is that Taizong didn't trust his high officials, especially the generals, and Li Jing was very sure about it. He deliberately tried to keep a low profile in order not to raise Taizong's suspicion.\nIn 634, Emperor Taizong wanted to send some officials to examine the circuits in the empire, to see whether the local officials were capable, to find out whether the people were suffering, to comfort the poor, and to select capable people to serve in civil service. Li Jing recommended Wei Zheng, but Emperor Taizong, believing that he needed Wei to stay at Chang'an to examine his own faults, declined, instead sending Li Jing and 12 other officials to the circuits to examine them. Li Jing's zone was Ji'nei Circuit (, roughly modern Shaanxi). After this tour, Li Jing, giving the reason that he had a foot illness, requested to retire. Emperor Taizong agreed, but still ordered that he maintain a staff and that, once he got better, he should visit the legislative and examination () bureaus every two or three days to serve as an alternative head of those bureaus.\nLater in 634, Tuyuhun attacked Tang. Emperor Taizong was considering whom to send as the commander of the counterattacking force, and he made the comment, \"It would have been wonderful to have Li Jing as commander.\" When Li Jing heard this, he personally met with the chancellor Fang Xuanling and offered to be the commander. Emperor Taizong was pleased, and made Li Jing the commander, assisted by the other generals Hou Junji, Li Daozong, Li Daliang, Li Daoyan (), and Gao Zengsheng (). Tang forces achieved initial victories against Tuyuhun forces; in response, Tuyuhun burned the grass on grazing fields to try to cut off the Tang horses' food supplies, and the Tang generals mostly believed that they should retreat them. Hou advocated attacking, however, and Li jing agreed, pushing deep into Tuyuhun territory and greatly defeating them, capturing the wives and sons of Tuyuhun's Busabo Khan Murong Fuyun. Murong Fuyun's son Murong Shun surrendered, and Murong Fuyun was soon killed by his subordinates. Emperor Taizong created Murong Shun the new khan, and Tang forces largely withdrew, although Li Daliang remained.\nDuring the campaign, on one occasion, Li Jing rebuked Gao for arriving late, but did not punish him. Gao nevertheless was displeased with Li Jing's rebuke, and he and the official Tang Fengyi () accused Li Jing of plotting treason. The matter was investigated, and the evidence was found lacking. Gao and Tang were accused of false accusations and exiled, notwithstanding pleas by others that Gao contributed to Emperor Taizong's ambush at Xuanwu Gate against Li Jiancheng. However, from this point on, Li Jing refused to receive guests, and he even did not see his relatives often.\nIn 637, as a part of Emperor Taizong's scheme to bestow prefectures on his relatives and great generals and officials as their permanent domains, Li Jing's title was changed to Duke of Wei, and he was given the post of prefect of Pu Prefecture (, roughly modern Heze, Shandong), to be inherited by his heirs. Soon, however, with many objections to the system, the strongest of which came from Zhangsun Wuji, Emperor Taizong cancelled the scheme, although Li Jing's title remained Duke of Wei. In 640, Li Jing's wife died, and Emperor Taizong ordered that a large tomb, made in the shape of Mount Tie () in Eastern Tujue territory and Mount Jishi () in Tuyuhun territory, under the precedents that the great Han dynasty generals Wei Qing and Huo Qubing had their tombs built in the shapes of mountains in Xiongnu territory to commemorate their victories, be constructed for Li Jing's wife (as Li Jing would eventually be buried there as well). In 643, when Emperor Taizong commissioned the Portraits at Lingyan Pavilion to commemorate the 24 great contributors to Tang rule, Li Jing's portrait was one of the 24.\nIn 644, when Emperor Taizong was set to attack Goguryeo, he summoned Li Jing to consult his opinion. Emperor Taizong stated to him:\n:You, duke, pacified the Wu region [i.e., the lower Yangtze] to the south, cleared the desert to the north, and settled the Murong [i.e., Tuyuhun] to the west. Only Goguryeo has not submitted. What do you think?\nLi Jing responded:\n:Your subject had, in the past, depended on your heavenly power to give my minor contributions. I am old and my bones are weak, but if Your Imperial Majesty does not look down on me, I am nevertheless willing to go despite my sickness.\nEmperor Taizong, however, saw that Li Jing was ill and decided not to send him. Emperor Taizong later personally led a largely unsuccessful attack on Goguryeo. Li Jing died in July 649just a few days before Emperor Taizong's own deathand was buried with great honor, near Emperor Taizong's own tomb.\nWorks attributed to Li Jing\nAs one of the best generals and strategists of the Tang dynasty remaining undefeated in his career, Li Jing wrote several books about military doctrines. Although most of his work is not preserved today, fractions of them were cited by the Tongdian, an encyclopedia about the historic system of politics in China. One of the Seven Military Classics of China, Duke Li of Wei Answering Emperor Taizong of Tang (), is a purported dialogue between Li Jing and Emperor Taizong about strategies, policies, and tactics. They criticised The Art of War, Zhuge Liang's strategies book and the New Book of Mengde. The work is attributed to Li Jing, although many modern scholars doubt the attribution, as neither the Old Book of Tang nor the New Book of Tang mentions the work in their biographies of Li Jing.\nLi Jing in fiction\nLi Jing appears in many Chinese folk tales and novels. Many of his legends were recorded in the Taiping Guangji (), a record of stories compiled during the Song dynasty. The novel Romance of Sui and Tang (), written by the Qing dynasty author Chu Renhuo (), for example, had Li prominently featured. The novel that most prominently featured Li, however, was the late Tang dynasty short story Biography of the Dragon-Beard Man (), written by the official Du Guangting (), which featured, as its three central characters, Li, his purported wife Zhang Chuchen (), and an ambitious man who taught Li military strategies, known only as the \"Dragon-Beard Man.\" There is no evidence to show that any of the fictional treatments of Li's life had bases in fact. The novel Fengshen Yanyi also had a substantial character named Li Jing, apparently borrowing a number of the real Li's personal characteristics, but as the Fengshen Yanyi was set near the end of the legendary Shang dynasty, more than 2,000 years before the historical Li Jing, it was not actually referring to the same person. Li Jing, who was a famous Tang dynasty military general and strategist, was well known for utilizing warfare tactics that were thought to be created by the goddess Jiutian Xuannu.\nSee also\n* Emperor Taizong's campaign against Tuyuhun\nReferences\n* Old Book of Tang, vol. 67.[https://web.archive.org/web/20080210041809/http://ef.cdpa.nsysu.edu.tw/ccw/02/tan08.htm 舊唐書　列傳　卷十一至二十]\n* New Book of Tang, vol. 93.[https://web.archive.org/web/20080210053058/http://ef.cdpa.nsysu.edu.tw/ccw/02/ntan14.htm 唐書　列傳　第十一至二五]\n* Zizhi Tongjian, vols. 184, 187, 188, 189, 190, 191, 193, 194, 196, 197, 198, 199."
    }
  ]
}