{
  "content": [
    {
      "type": "text",
      "text": "# Li Sheng (Three Kingdoms)\n\n| term_end =\n| monarch = Cao Fang\n| office1 = Administrator of Xingyang (滎陽太守)\n| term_start1 = ?\n| term_end1 = ?\n| monarch1 = Cao Fang\n| office2 = Intendant of Henan (河南尹)\n| term_start2 = ?\n| term_end2 = ?\n| monarch2 = Cao Fang\n| office3 = Chief Clerk (長史)\n| term_start3 =\n| term_end3 = ?\n| monarch3 = Cao Fang\n| office4 = Prefect of Luoyang (洛陽令)\n| term_start4 =\n| term_end4 =\n| monarch4 = Cao Fang\n| birth_date = Unknown\n| birth_place = Nanyang, Henan\n| death_date =\n| death_place = Luoyang, Henan\n| father = Li Xiu\n| occupation = Politician\n| blank1 = Courtesy name\n| data1 = Gongzhao (公昭)\n}}\nLi Sheng (died 9 February 249), courtesy name Gongzhao, was a Chinese politician of the state Cao Wei in the Three Kingdoms period of China.\nLife\nLi Sheng was from Nanyang Commandery (), which is around present-day Nanyang, Henan. His father, Li Xiu (), was formerly a subordinate of the warlord Zhang Lu. After the Battle of Yangping in 215, Li Xiu switched allegiance to the warlord Cao Cao and eventually came to serve in the Cao Wei state during the Three Kingdoms period.\nIn his younger days, Li Sheng met and befriended Cao Shuang. Along with other \"celebrities\" (e.g., sons of famous officials), he engaged in superficial and fame-seeking behaviour to earn themselves praise from other officials and citizens in the imperial capital, Luoyang. The Wei emperor Cao Rui ( 226–239) felt disgusted when he heard about it and wanted to get rid of such unhealthy and corrupt practices, so he ordered an investigation. Someone reported Li Sheng as one of those involved, resulting in Li Sheng's arrest and imprisonment. However, with help from his wide network of connections, he managed to get himself released after spending a few years behind bars.\nIn January 239, Cao Rui died and was succeeded by his adopted son, Cao Fang, who became the new Wei emperor. As Cao Fang was still young then, Cao Shuang ruled on his behalf as a regent. Cao Shuang appointed Li Sheng as the Prefect of Luoyang. In 244, he was reassigned to be a Chief Clerk () under his friend Xiahou Xuan, who then held the position of General Who Attacks the West (). In the same year, Li Sheng and Deng Yang advised Cao Shuang to launch a military campaign against Wei's rival state, Shu, to boost his fame and authority in Wei. Cao Shuang's co-regent, Sima Yi, strongly objected but Cao Shuang ignored him and went ahead. The Wei forces were subsequently defeated at the Battle of Xingshi against Shu forces and suffered heavy casualties.\nBetween 244 and 248, Li Sheng first served as the Administrator () of Xingyang Commandery () and later as the Intendant of Henan (); these two positions put him in charge of the commandery where the imperial capital, Luoyang, was located in. He governed his jurisdictions well during his tenure.\nIn 248, Li Sheng was appointed as the Inspector () of Jing Province (covering present-day Hubei and Hunan). Before leaving Luoyang to assume his new office, he visited Sima Yi, who had been staying at home after claiming that he was too ill to serve in the imperial court. Sima Yi knew that Cao Shuang had sent Li Sheng to check on him, so he pretended to be so ill that he was bedridden and could not consume porridge without soiling his clothes. When Li Sheng told him that he was going to Jing Province, Sima Yi pretended to mishear it as \"Bing Province\" at least twice. When Li Sheng returned to Cao Shuang, he reported that Sima Yi was already so feeble and frail that he might die soon. Cao Shuang, thinking that Sima Yi no longer posed a threat to him, lowered his guard.\nIn 249, while Cao Shuang and the emperor Cao Fang were away at the Gaoping Tombs, Sima Yi seized the opportunity to stage a ''coup d'état'' in Luoyang and take control of the imperial capital's armed forces. He promised Cao Shuang that he would spare him and his family if he surrendered. Cao Shuang believed and relinquished all his powers as regent, thus leaving Sima Yi solely in control of the Wei government and the puppet emperor Cao Fang. Later, Sima Yi broke his promise as he had Cao Shuang and his supporters arrested, charged with treason and executed along with their families. At the time, Li Sheng had yet to leave Luoyang for Jing Province, so he too was arrested and executed together with his family.\nSee also\n* Lists of people of the Three Kingdoms\n* Incident at Gaoping Tombs\nNotes\nReferences\n* Chen, Shou (3rd century). Records of the Three Kingdoms (Sanguozhi).\n* Pei, Songzhi (5th century). Annotations to Records of the Three Kingdoms (Sanguozhi zhu).\n* Sima, Guang (1084). Zizhi Tongjian."
    }
  ]
}