{
  "content": [
    {
      "type": "text",
      "text": "# Liang Province rebellion__disambig_1\n\nSun JianMa Teng (until 187)\n| commander2        = Beigong BoyuLi WenhouDianyuBian ZhangHan SuiWang GuoMa Teng (from 187)\n| strength1         = Various:100,000+ at Meiyang40,000+ at Chencang\n| strength2         = Several tens of thousands\n| casualties1       =\n| casualties2       =\n}}\nThe Liang Province rebellion () from 184 to 189 started as an insurrection of the Qiang peoples against the Han dynasty in the western province of Liang (roughly present-day Wuwei, Gansu) in the second century AD in China, but the Lesser Yuezhi and sympathetic Han rebels soon joined the cause to wrestle control of the province away from central authority. This rebellion, which closely followed the Yellow Turban Rebellion, was part of a series of disturbances that led to the decline and ultimate downfall of the Han dynasty. Despite receiving relatively little attention in the hands of traditional historians, the rebellion nonetheless had lasting importance as it weakened Han Chinese power in the northwest and prepared that land for a number of non-Han-ruled states in the centuries to come.\nOutbreak (184)\nThe rebellion began in the winter of 184 with two groups of Qiang people causing disturbances in the outlying regions of northwestern China, one group in the northwestern commanderies of Beidi and Anding, and another in at the counties of Fuhan () and Heguan () in the upper Yellow River valley. Initially, the two groups were likely separate, each trying to seize the opportunity to resist the weakened Han rule after years of corruption and misrule. The situation escalated in October or November 184 when the troops of the Auxiliary of Loyal Barbarians From Huangzhong (), which consisted of Qiang and Lesser Yuezhi recruits sent to suppress the disturbances, mutinied against their Han Chinese superiors in the military camp of Lianju (令居; northwest of present-day Lanzhou) and joined the insurgents, killing the Colonel Protector of the Qiang (), Leng Zheng (), in the process. At this point, the two groups had joined together, with former Auxiliary soldiers Beigong Boyu () and Li Wenhou () as their leaders. This union meant that the rebels now had control of the band of territory along the Yellow River in present-day Lanzhou.\nWithin a few weeks, the rebels attacked and captured Qianya (允吾), the capital of Jincheng Commandery (), making the commandery their main stronghold for rebel operations. The rebels were helped by the fact that the local governor Zuo Chang (), Inspector of Liang Province (), had embezzled the funds allocated for the defence force, making no relief possible. The Grand Administrator Chen Yi () went to the rebels' camp to negotiate for the release of hostages, but the rebels killed him. The hostages – which included Bian Zhang, the former Prefect of Xin'an (); and Han Sui, Attendant Official of Liang Province () – were then persuaded to join the rebels' cause. The addition of such reputable and influential men gave the rebellion wider popular support, and the two men were to play more prominent roles in the rebellion as the course of events progressed.\nThe rebels then besieged Zuo Chang's headquarters in the county of Ji (冀; south of present-day Gangu, Gansu). Some outlying Han generals were initially reluctant to help Zuo Chang, but He Xun (), a much-respected and successful general, forced those generals to come to Zuo Chang's aid with powerful persuasion. The rebels, out of respect for He Xun, broke off the siege. After this episode, Zuo Chang was replaced by Song Nie (), a devout Confucian who believed that the situation could be remedied only by teaching the people the Classic of Filial Piety. He submitted this proposal to the imperial court despite his junior officials' advice and was promptly dismissed in favour of Yang Yong (). Local situations did not improve with the appointment, however, and the local officials soon found themselves besieged by the rebels again. The new Protector Xia Yu (), a man with some experience with Qiang rebellions, was attacked by a rebel contingent led by Qiang chieftain Dianyu () at the Herding Office () of Hanyang Commandery (present-day Tianshui) and He Xun once again led troops for relief. This time, however, He Xun was severely defeated at nearby Hupan (). While both Xia Yu and He Xun made their escape, it was clear at this point that provincial authorities could not deal with the rebellion by themselves.\nResponse of the central government (185)\nIn the spring of 185, the rebels, now several tens of thousands in number, moved towards the former Han capital of Chang'an. In response, the imperial court appointed Huangfu Song, the famed conqueror of the Yellow Turbans, as the General of Chariots and Cavalry on the Left () in charge of defense of Chang'an. However, Huangfu achieved no immediate success, and was dismissed in the seventh lunar month of 185 after a four-month tenure after being slandered by the eunuchs in the imperial court.\nThe continued rebellion in Liang Province took its toll on the government treasury, and the imperial court had to call on the taxes and corvées to support the war. A high official, the Excellency over the Masses, Cui Lie (), proposed to abandon Liang Province altogether. The Gentleman-Consultant () Fu Xie () made an impassioned speech that condemned Cui Lie and emphasised on the importance of the frontier province:\nEmperor Ling was impressed by this argument and rejected Cui Lie's proposal. Fu Xie was later assigned to be the Grand Administrator of Hanyang () and was sent to the frontier region.\nIn the eighth lunar month of 185, the high minister Zhang Wen was given the military post of General of Chariots and Cavalry () to assume Huangfu Song's responsibilities. Assigned under him were Dong Zhuo, the new General Who Routs the Caitiffs (); and Zhou Shen (), the General Who Terrifies Criminals (), among others. Zhang's army, more than a hundred thousand in men and horses, traveled to Meiyang (美陽; west of present-day Wugong) and set camp there. Bian Zhang and Han Sui also brought their men to Meiyang to do battle, but the battles were inconclusive and Zhang Wen's army could not gain advantage for some time. Things changed during the eleventh month, when a shooting star appeared to fall on the rebel camp and shook the rebels' resolve. Taking advantage of the situation, Dong Zhuo smashed the rebel army in a sudden attack, forcing Bian Zhang and Han Sui to retreat west to Yuzhong (榆中; near present-day Lanzhou) of Jincheng commandery.\nFollowing the victory, Zhang Wen sent two detachments in pursuit of the rebels: Zhou Shen was to lead 30,000 men to attack Yuzhong, and Dong Zhuo was to chase the Qiang auxiliary with another 30,000 men. Both, however, ended in failure. Zhou Shen had disregarded his advisor Sun Jian's advice to cut the enemy's supply routes and got his own supply line cut by the enemy in turn, resulting in a hasty retreat. Dong Zhuo's position became surrounded by the Qiang in Wangyuan (望垣; northwest of present-day Tianshui) with depleting supplies. He made his escape by damming up the river as if to catch fish and secretly transported his men across the river. By the time the Qiang came in pursuit, the dammed river was too deep for them to cross. Dong Zhuo was the only commander to keep his forces intact after this offensive.\nAlthough the Battle of Meiyang halted the rebels' advance into the Han heartlands, the rebels were able to retain their power by the upper Yellow River due to the failure of the Han follow-up offensive. The upper Wei River valley became contested ground.\nLocal attempts at restoring Chinese power (186–187)\nAt some time during the winter of 186, the rebel leader Bian Zhang died of illness and Beigong Boyu and Li Wenhou were killed in internecine feuds. Seeing an advantage to be gained from this situation, Geng Bi (), the newly installed Inspector of Liang Province, attempted to re-establish Han-Chinese power in the region without major military assistance from other parts of the country. Fu Xie tried to dissuade Geng Bi from this enterprise, arguing that the people were not used to Geng Bi as their governor and the army did not have time to build morale, but Geng Bi went ahead with his plan anyway.\nIn 187, Geng Bi attacked the western fringe commandery Longxi with a combined army from six commanderies. Longxi was previously captured by the forces of Han Sui when its Grand Administrator Li Can () defected. However, the gentry and people were frustrated by Geng Bi's appointment of the corrupt official Cheng Qiu (). When the army reached Longxi's capital Didao in the fourth month of 187, mutiny broke out within Geng Bi's ranks, killing Cheng Qiu and Geng successively. The mutineers joined the rebels under the command of the Didao native Wang Guo (), and together they besieged Hanyang, east of Longxi. As Grand Administrator of Hanyang, Fu Xie treated the people well and was respected far and wide, and the rebels were hesitant to fight him. On several occasions, the rebels tried to convince Fu Xie to either flee the city or surrender, but Fu was determined to defend the commandery to the death despite dwindling number of men and supplies. And so, in a desperate final charge, Fu died in battle.\nAfter this affair, Geng Bi's subordinate, Major () Ma Teng brought his troops to join Han Sui. They made Wang Guo their leader, and together the rebels raided the region around Chang'an. For the first time, the rebels extended their sway over the entire Liang Province. In light of this, Zhang Wen was dismissed from his post for his failure to quell the rebellion.\nThe siege of Chencang (188–189)\nBy the end of 188, the imperial court had all but abandoned hope of recovering Liang Province and, for the most part, left the regional defences to their own devices. However, when Wang Guo led a major force east to attack Chencang (陳倉, east of present-day Baoji), a gateway to Chang'an, the court once again appointed Huangfu Song to answer this obvious threat. Huangfu, now General of the Left (), was given 20,000 men; Dong Zhuo, himself commanding another 20,000 men, were to assist Huangfu. When Huangfu and Dong reached Chencang, Dong urged Huangfu to relief the siege immediately. Huangfu, however, had a different opinion – he argued that Chencang's strong defences would not be easily captured and they would only need to wait for Wang Guo's men to become discouraged. Sure enough, Wang Guo's men laid siege to Chencang for more than eighty days with no success.\nIn spring 189, Wang Guo's men became worn out and abandoned the siege. With his men rested, Huangfu Song ordered his men to give chase. Dong Zhuo protested, citing the rule of warfare that a retreating army is not to be pursued (lest the enemy retaliates in desperation). Huangfu dismissed the protest, saying Wang Guo's retreat was not an organised retreat but a result of losing all will to fight. Huangfu led his men to attack, leaving Dong Zhuo behind as rearguard, and achieved a great victory, cutting off more than ten thousand heads. Dong Zhuo was said to be ashamed and angry at this and bore a grudge against Huangfu from here on.\nWang Guo was subsequently deposed by Han Sui and Ma Teng after his defeat in Chencang, and a Yan Zhong (), former Prefect of Xindu (), was elected to take his place as the leader of the Liang Province rebels. However, Yan Zhong died soon after, leaving the rebels to fight amongst themselves and finally splintered into three groups: Han Sui's group in Jincheng, Ma Teng's group in the Wei Valley, and Song Jian's () group in Fuhan (in present-day Gansu). As power shifted from the barbarian initiators to the local Han rebels, the Qiang and the Yuezhi seemed to have quietly withdrew their support and played no further role of note in the rebellion.\nThe rebellion could have been suppressed at this point if not for the events of 189 in the capital Luoyang. Following the death of Emperor Ling on May 13, 189, full-scale fighting broke out after the assassination of the General-in-Chief He Jin. Dong Zhuo led the frontier men to the capital in the chaos and took control of the court, replaced Emperor Shao with Emperor Xian, and made himself Chancellor of State (). By the end of the year, civil insurrection had spread across China and the Liang Province Rebellion became subsumed as an outlying disturbance in the fragmentation of the Han dynasty.\nEpilogue: the final destruction of the rebels\nAs China disintegrated into chaos, the three rebel leaders of Liang Province became warlords in their own right and took different approaches to adapt to the new geopolitical situation. Song Jian, distancing himself from the conflict in China, proclaimed himself to be King of the Sources of the River Who Will Pacify Han () and ruled the region of Fuhan and Heguan in isolated autonomy for almost thirty years. On the other hand, Han Sui and Ma Teng became involved in the wider affairs of the empire, starting with their reconciliation with Dong Zhuo, who asked for their support to deal with the coalition against him. After Dong Zhuo died in May 192, his retainers Li Jue and Guo Si seized power and gave Han Sui and Ma Teng the positions of General Who Subdues the West () and General Who Conquers the West (), respectively; thereby granting the two rebel leaders official recognition.\nLater on, Han Sui and Ma Teng shared an uneasy relationship with each other; between them were periods of alliance followed by periods of open warfare. In one occasion in 209, Ma Teng was compelled to flee to seek help from Cao Cao, the powerful warlord who had gained control of northeast China and the imperial court. At the time, Cao Cao had his interests in the northwest, and thus invited Ma Teng to his headquarters in Ye and kept him as a virtual hostage. Ma Teng was executed along with his family in 212 after his son Ma Chao rose up against Cao Cao.\nIn the spring of 211, Cao Cao sent the commander Zhong Yao to the Wei Valley, ostensibly to attack Zhang Lu's theocratic state of Hanzhong. The incursion provoked the northwestern warlords, including Han Sui and Ma Teng's son Ma Chao, into forming a coalition to resist Cao Cao. The coalition opposed Cao's forces in the Battle of Tong Pass, where Cao personally took charge of operations. With skillful manoeuvring, Cao's army crept to the rear of the coalition forces and routed them in a decisive encounter in the autumn of 211. The defeat at Tong Pass signalled the beginning of the end of autonomy in the northwest.\nCao Cao returned east after this engagement, leaving his lieutenant Xiahou Yuan in charge of mop up operations and Zhang Ji in charge of restoration of local government. Ma Chao first attempted to stage a resistance after capturing the city of Ji in Cao Cao's absence, establishing bonds with the Di people, but was ousted in 213 with a combination of Xiahou Yuan's army and internal mutiny. Ma Chao fled south to Zhang Lu, and later to the southwestern warlord Liu Bei in Sichuan, where he died in 221 without ever seeing the north again. In 214, Xiahou Yuan defeated the resistance led by Han Sui at the Changli River (長離水; present-day Hulu River, north of Tianshui), and followed up that victory by an expedition against the Di and Song Jian. Song Jian died, his capital of Fuhan was captured, and his officials were all killed by Xiahou. Han Sui died the next year, and his remaining subordinates sent his head to Cao Cao as a sign of submission. And so, the power blocs that were generated by the Liang Province Rebellion some thirty years prior were finally eliminated.\nLegacy\nAfter Cao Cao's death in 220, his son Cao Pi forced Emperor Xian to abdicate and established the state of Cao Wei to succeed the Han dynasty. Under his rule, commanderies were restored across the northwest while the region suffered only minor outbreaks of local rebellions. In 222, trade with Central Asia was officially re-established after being disrupted by the string of military action in Liang Province.\nDespite these achievements, Chinese power in the northwest was weaker than during the Han dynasty before the rebellion. Compared to the Han dynasty, Cao Wei's territory shrank in the northwest as some outlying former commanderies, such as Song Jian's realm of Fuhan, were simply abandoned. Chinese population in the area dwindled and eventually gave way to the Qiang and Di tribes of the southern mountains, as well as the Xianbei of the northern steppe. During the early Western Jin period, the various tribes in the northwest rebelled against their Chinese overlords, first under Tufa Shujineng (270–280) and then Qi Wannian (296–299), devastating the region. After the Jin was driven out of the north, the influential tribes among these peoples were able to prosper and established states during the middle and later parts of the Sixteen Kingdoms period.\nIn popular culture\nThe Liang Province Rebellion is featured as playable stages in the seventh installment of Koei's Dynasty Warriors video game series, and focuses on Sun Jian's involvement in aiding Dong Zhuo on behalf of the Han imperial court.\nThe Liang Province Rebellion also appears in Total War: Three Kingdoms, roughly at the same time as with the Yellow Turban Rebellion. Its faction is led by Beigong Boyu.\nReferences\nCitations\nSources\n*\n* de Crespigny, Rafe (1989). [https://web.archive.org/web/20120204045440/http://www.anu.edu.au/asianstudies/decrespigny/HuanLing_index.html Emperor Huan and Emperor Ling: being the Chronicle of the Later Han dynasty for the years 157 to 189 AD as recorded in Chapters 54 to 59 of the Zizhi tongjian of Sima Guang.] Faculty of Asian Studies, The Australian National University, Canberra. .\n* de Crespigny, Rafe (1996). [https://web.archive.org/web/20061004142308/http://www.anu.edu.au/asianstudies/decrespigny/peace1_index.html To Establish Peace: being the Chronicle of the Later Han dynasty for the years 189 to 220 AD as recorded in Chapters 59 to 69 of the Zizhi tongjian of Sima Guang. Volume 1.] Faculty of Asian Studies, The Australian National University, Canberra. 1996. .\n* Haloun, Gustav. [http://www.ihp.sinica.edu.tw/~asiamajor/pdf/1949/1949-119.pdf \"The Liang-chou Rebellion 184-221A.D.\"], in Asia Major 1 (1949–50). London. pp.&nbsp;119–138."
    }
  ]
}