{
  "content": [
    {
      "type": "text",
      "text": "# Liberian Declaration of Independence\n\nThe Liberian Declaration of Independence is a document adopted by the Liberian Constitutional Convention on 26 July 1847, to announce that the Commonwealth of Liberia, a colony founded and controlled by the private American Colonization Society, was an independent state known as the Republic of Liberia.\nHistory\nThe Declaration was written by Hilary Teague and adopted simultaneously with the first Constitution of Liberia. The anniversary of the adoption of the Declaration and accompanying Constitution is celebrated as Independence Day in Liberia.\nThe Declaration articulates the history of the Americo-Liberians who settled the original colony and lays out the aspiration of Liberia to be accepted as a free and independent state within the \"comity which marks the friendly intercourse of civilized and independent communities.\" Listing the injustices committed against African Americans as a result of slavery in the United States, the Declaration notes the foundation of the colony by the American Colonization Society, as well as their gradual withdrawal from governance in favor of increasing self-governance by the colonists. The noted goal of Liberia is both to establish a state built upon the structure and principles of the law of nations and to modernize the indigenous peoples of the region, including converting them to Christianity.\nThe Declaration partially relied upon the United States Declaration of Independence, in particular its discussion of natural law:\nWe recognize in all men certain inalienable rights; among these are life, liberty, and the right to acquire, possess, enjoy, and defend property.\nIts listing of injustices perpetrated by the United States parallels the charges set forth in the US Declaration of Independence against King George III. However, the Liberian Declaration asserts no right of revolution but frames its independence as the planned purpose of the colony by the American Colonization Society. The Society, having surrendered all control of the colony in January 1846, fully encouraged the independence of Liberia. The Commonwealth of Liberia declared its independence from the American Colonization Society on 26 July 1847, as the Republic of Liberia.\nOn 3 January 1848, Joseph Jenkins Roberts, a free man of color born in Norfolk, Virginia, United States, was sworn in as Liberia's first president.\nThe Liberian constitution and flag were modeled after the United States Constitution and flag because nearly all of Liberia's founders were free people of color and former slaves who had emigrated as colonists from the United States. Liberia was founded as a colony of the American Colonization Society, a private organization established in Washington, D.C., in 1816.\nOn 5 February 1862, after 15 years of avoiding the issue, the United States officially recognized Liberia's independence.\nSignatories\nEleven delegates and one secretary, representing the three counties of Liberia, gathered in the Providence Baptist Church in Monrovia to sign the Declaration along with the Constitution of Liberia:\nMontserrado County\n:1.  Samuel Benedict\n:2.  Hilary Teague\n:3.  Elijah Johnson\n:4.  John Naustehlau Lewis\n:5.  Beverly R. Wilson\n:6.  John B. Gripon\nGrand Bassa County\n:7.  John Day\n:8.  Amos Herring\n:9.  Anthony William Gardiner\n:10.  Ephraim Titler\nSinoe County\n:11.  Richard E. Murray\n:Jacob W. Prout, Secretary\nReferences\n*[https://catalog.hathitrust.org/Record/010459993 The independent Republic of Liberia : its Constitution and Declaration of Independence : address of the colonists to the free people of color in the United States, with other documents : issued chiefly for the use of the free people of color.] Philadelphia : W.F. Geddes, printer, 1848."
    }
  ]
}