{
  "content": [
    {
      "type": "text",
      "text": "# Light Crusader\n\n|EU|September 1995|NA|1995}}\n| genre = Action-adventure\n| modes = Single-player\n}}\nis a 1995 action-adventure game developed by Treasure and published by Sega for the Sega Genesis. The game’s plot follows a knight named Sir David as he attempts to rescue the kidnapped people of Greenrow. Played from an isometric perspective, the game sees the player, assuming the role of David, descending through a large dungeon by fighting enemies, solving puzzles, and traversing the environment in order to find the missing townsfolk.\nThe final title developed by Treasure for the Genesis, the game was first announced in the spring of 1994 under the working title of Relayer. During development, the dev team sought to improve the operability and enjoyment of previous pseudo-3D titles by implementing an isometric viewpoint. However, due to programming difficulties stemming from the perspective, the game was delayed for over a year in order for the development team to fix the issues.\nUpon release, the game received positive critical reception for its visuals, gameplay, and soundtrack but was criticized for its plot while mixed reactions were given towards the isometric perspective. Light Crusader has been included in various game compilations as well as on digital game storefronts and the Sega Genesis Mini.\nGameplay\non an early floor of the dungeon. The top of the screen shows David’s, as well as the boss’s, health and can show what type of magic is currently equipped.]]\nLight Crusader is an action-adventure game focused on exploration, combat, and puzzle solving. The game is played from an isometric perspective and sees the player primarily traversing a large dungeon, fighting enemies and solving puzzles, in order to rescue the kidnapped people of Green Row. The player is also allowed to freely roam Green Row to talk to townspeople or buy items from shops. Other towns can be found in the dungeon that give the player similar options but with different people to converse with and additional items to purchase from shops.\nThe player assumes the role of Sir David, who has a variety of abilities at his disposal. Aside from basic running and jumping, David can attack with his sword at a standstill, or while moving or jumping, and by lunging in midair. He can also make use of four different kinds of elemental magic, which are the core classical elements. Magic can be used either individually or combined with another element to create an attack or, in the case of certain combinations, give a buff to David. For example, using water magic on its own allows David to heal himself. Every type of magic can be combined at once, meaning that all four types can be used simultaneously.\nThe magic that is used by the player can be switched out in the pause menu, which also allows access to their inventory of items. Items can range from food that can recover David’s health to gear that can either increase offensive or defensive power. Alongside items, the pause menu allows the player to access a map of the area that they are currently in. This map doesn’t share the location of items or kidnapped townspeople within the dungeon however and needs to be filled out by the player via exploring the area that they are currently occupying.\nSynopsis\nSetting and characters\nThe game is entirely set in and around the town of Green Row, which is ruled under a monarchy. The town has a castle for the royal family, an inn, and various houses and shops owned by the townspeople. Upon the outskirts of Green Row is a farm, as well as a graveyard hiding a multi-level dungeon. A majority of the game is spent in the dungeon, as it contains kidnapped people of the town and useful items. Further down levels of the dungeon contain people living in it, including a guild of wizards and an entire town of goblins.\nThe player controls a knight named Sir David, who arrives in Green Row upon receiving an invitation to visit from the town’s king. Over the course of the game David confronts a wizard named Ragno Roke, who wishes to reawaken a demon called Ramiah.\nPlot\nUpon arriving in the town of Green Row Sir David is greeted by its king, who informs him that its townspeople have been disappearing and asks David to try searching for them. Traveling to the town’s outskirts, David discovers a stairwell hidden in the local graveyard leading to a multi-leveled dungeon. After descending into the dungeon, David finds some of the missing people and infers that more could be hidden on its floors, which turns out to be true. As he begins to rescue more of the missing townsfolk, David learns of Ragno Roke, an evil wizard who was so angered by Green Row’s queen rejecting his marriage proposal that, as an act of revenge, plans to use the kidnapped townspeople as a sacrifice to reawaken the demon Ramiah, who is currently sealed within the dungeon. Upon saving all the missing townsfolk, David confronts Roke, who sacrifices himself in order to revive Ramiah. David battles the demon and ends up victorious upon killing them. After being thanked by the townsfolk and royal family of Green Row, David begins to embark back to his home.\nDevelopment and release\nfor the Sega Genesis, which was created as part of a deal with Sega.]]\nLight Crusader was developed by Japanese studio Treasure as part of partnership with Sega to develop products for the latter's Genesis console. This four game deal also included Dynamite Headdy, Alien Soldier, and Yu Yu Hakusho Makyō Tōitsusen. Light Crusader was programmed by Kazuhiko Ishida with support from Keiji Fujitake and Treasure president Masato Maekawa. The game's graphics and art were provided by Hiroshi Iuchi, Makoto Ogino, Kaname Shindo, and Koichi Kimura. Katsuhiko Suzuki was the sound director while Aki Hata and Satoshi Murata composed the music and sound effects respectively.\nThe project was announced in the spring of 1994 under the working title Relayer. Iuchi revealed that in its earliest stages, Light Crusader was planned as an action version of the classic RPG series Wizardry. The staff sought to improve the operability and enjoyment of pseudo-3D graphics afforded by the isometric viewpoint, but this presented challenges. Ishida said that it was difficult to program multiple joints in 3D, while Iuchi claimed that the three-quarters perspective interfered with the performance of the Genesis. Development was delayed when the team started over from scratch at one point. Iuichi estimated that the final build of the game was only 30% complete by the end of 1994.\nLight Crusader was Treasure's last title to appear on the Genesis console. Throughout 1995, Sega published the game in Japan, North America, Europe, and Australia while Samsung published it in South Korea. In the following decades, Light Crusader has been made available as both a stand-alone downloadable title and as part of several Genesis compilations. The game was released on the Wii Virtual Console in 2007; as part of the Sega Genesis Classics collection for Steam and home platforms beginning in 2011; on the North America Sega Genesis Mini and PAL region Sega Mega Drive Mini consoles in 2019; and finally on the Nintendo Classics service in 2022.\nReception\n| CVG = 85/100\n| EGM = 8/10, 6/10, 6/10, 5/10\n| EuroG = 7/10\n| Fam = 27/40\n| GI = 7.25/10\n| GP = 76%\n| GMaster = 77%\n| IGN = 6.5/10\n| MMS = 80/100\n| NGen = 3/5\n| NLife = 7/10\n| rev1 = Games World\n| rev1Score = 85/100\n| rev2 = Sega Magazine\n| rev2Score = 89/100\n| rev3 = Sega Power\n| rev3Score = 85%\n| rev4 = Sega Pro\n| rev4Score = 90%\n| rev5 = Sega Saturn Magazine (JP)\n| rev5Score = 6.5/10\n| rev6 = VideoGames\n| rev6Score = 8/10\n}}\nThe Japanese publication Micom BASIC Magazine ranked Light Crusader second in popularity in its August 1995 issue, and it received a 21.7/30 score in a poll conducted by Mega Drive Fan and a 7.826/10 score in a 1995 readers' poll conducted by the Japanese Sega Saturn Magazine, ranking among Sega Mega Drive titles at the number 156 spot. The game also received an average reception from critics when it was released on the Virtual Console for the Wii, holding a rating of 67.50% based on five reviews according to review aggregator GameRankings.\nGus Swan and Steve Merrett Mean Machines Sega praised the graphics and unique mixture of gameplay elements. They criticized that the game is often too easy and dull, and compared it unfavorably to The Story of Thor for longevity, but nonetheless gave it a very positive assessment, calling it \"A superlative arcade adventure with great playability\". Next Generation said that the game design reflected Treasure's experience with action games, but that the non-action elements such as the puzzles and storyline are overly shallow, and the isometric perspective creates control difficulties. They concluded, \"Light Crusader is still one of the more exciting and graphically pleasing Genesis titles that has come out recently, but this is by no means a RPG\".\nElectronic Gaming Monthlys four editors praised the graphics, but all but one of them gave the game an overall negative assessment, saying that the perspective severely hinders visibility, the combat is clunky, the lack of story makes the game less involving and creates difficulty figuring out where to go next, and there is too much of an emphasis on puzzles. GamePros The Unknown Gamer commented that the graphics and music are impressive in parts, but that the game is less challenging and complex than most RPGs, and that the player character maneuvers poorly, \"with nowhere near the range or fluidity of movement of Ali in Beyond Oasis.\" However, they concluded, \"In the end, Light Crusader gets a passing grade because of some cool bosses and interesting puzzle challenges\".\nNotes\nReferences\nExternal links\n* [https://gamefaqs.gamespot.com/genesis/586289-light-crusader Light Crusader] at GameFAQs\n* [https://www.giantbomb.com/light-crusader/3030-13920/ Light Crusader] at Giant Bomb\n* [https://www.mobygames.com/game/light-crusader Light Crusader] at MobyGames"
    }
  ]
}