{
  "content": [
    {
      "type": "text",
      "text": "# Lilywood, Queensland\n\n| local_map           = yes\n| zoom                = 11\n| pop                 =\n| pop_year            =\n| pop_footnotes       =\n| established         = 2023\n| established_footnotes\t=\n| postcode            = 4513\n| area                = 2.8\n| area_footnotes      =\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 8.4\n| dir1                = WSW\n| location1           = Caboolture\n| dist2               = 53.7\n| dir2                = N\n| location2           = Brisbane CBD\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| elevation           =\n| maxtemp             =\n| mintemp             =\n| rainfall            =\n| lga                 = City of Moreton Bay\n| stategov            = Glass House\n| fedgov              = Longman\n| near-n              = Bellmere\n| near-ne             = Bellmere\n| near-e              = Upper Caboolture\n| near-se             = Upper Caboolture\n| near-s              = Upper Caboolture\n| near-sw             = Wagtail Grove\n| near-w              = Wagtail Grove\n| near-nw             = Bellmere\n}}\nLilywood is a rural locality in the City of Moreton Bay, Queensland, Australia.\nHistory\nIn April 2023, the Queensland Government decided to reflect the growing population of the region by creating five new localities named Corymbia, Greenstone, Lilywood, Wagtail Grove, and Waraba by excising parts of the existing localities of Bellmere, Rocksberg, Upper Caboolture, and Wamuran. Lilywood was created from land formerly within Upper Caboolture.\nThe name is a combination of the words of lily and wood, with the lily referring to the blue flax-lily (Dianella caerulea), a plant native to the Caboolture area.\nInfrastructure and development\nLilywood, a newly established suburb within the Waraba Priority Development Area (PDA), is undergoing significant development to address regional housing needs and support economic growth. The Queensland Government's declaration of Waraba as the 36th PDA on 2 August 2024 has paved the way for comprehensive planning and infrastructure investment in Lilywood.\nThe inaugural residential project, Lilywood Landings, encompasses approximately 70 hectares (approximately 173 acres) and is set to deliver 705 residential lots. This development emphasises modern living integrated with natural surroundings, featuring 70 hectares of greenspace, including pedestrian and bike paths stretching 4.5 km along the Caboolture River, promoting outdoor activities and community engagement. Plans for a new state primary school, sporting fields, local parks, and a town centre with shopping and other amenities aim to foster a self-sufficient and interconnected urban environment.\nThe addition of diverse housing options aligns with regional growth strategies, addressing housing demand and promoting affordability. The construction and operational phases are expected to generate local jobs, stimulating economic activity within the Moreton Bay region.\nAs part of the comprehensive planning for the Waraba PDA, provisions have been made for the establishment of nine primary schools, three secondary schools, a TAFE, and a private hospital to cater to the growing population.\nEducation\nThere are no schools in Lilywood. The nearest government primary school is Minimbah State School in Morayfield to the east. The nearest government secondary school is Morayfield State High School, also in Morayfield.\nReferences"
    }
  ]
}