{
  "content": [
    {
      "type": "text",
      "text": "# Lily King\n\n| birth_place      = United States\n| occupation       = Novelist\n| education        = University of North Carolina at Chapel Hill (BA)Syracuse University (MA)\n| genre            = Literary fiction\n| website          =\n}}\nLily King (born 1963) is an American novelist.\nEarly life\nKing grew up in Massachusetts. She earned a B.A. in English literature from the University of North Carolina at Chapel Hill and an M.A. in creative writing from Syracuse University.\nWork\nKing's first novel, The Pleasing Hour (1999), won the Barnes and Noble Discover Award and was a New York Times Notable Book and an alternate for the PEN/Hemingway Award. Her second novel, The English Teacher, was a Publishers Weekly Top Ten Book of the Year, a Chicago Tribune Best Book of the Year, and the winner of the Maine Fiction Award. Her third novel, Father of the Rain (2010), was a New York Times Editors Choice, a Publishers Weekly Best Novel of the Year, and winner of the New England Book Award for Fiction and the Maine Fiction Award.\nKing's fourth novel, Euphoria (2014), was inspired by events in the life of anthropologist Margaret Mead. It won the inaugural Kirkus Prize for Fiction and the 2014 New England Book Award for Fiction, and was a finalist for the 2014 National Book Critics Circle Award. Euphoria was listed among The New York Times Book Review's 10 Best Books of 2014, TIME's Top 10 Fiction Books of 2014, and the Amazon Best Books of 2014.\nKing is the recipient of a MacDowell Fellowship and a Whiting Award. Her short fiction has appeared in literary magazines, including Ploughshares and Glimmer Train, as well as in anthologies. King's first collection of stories, \"Five Tuesdays in Winter,\" was published in 2021. Her essay appeared in Vogue.\nAwards\n* 2021 Story Prize finalist for Five Tuesdays In Winter\n* 2014 Kirkus Prize for Fiction for Euphoria\n* 2014 National Book Critics Circle Award finalist for Euphoria\n* 2014 New England Book Award for Fiction winner for Euphoria\n* 2010 Maine Fiction Award for “Father of the Rain”\n* 2010 New England Book Award for “Father of the Rain”\n* 2005 Maine Fiction Award for “The English Teacher”\n* 2000 Whiting Award\n* 1999 Barnes and Noble Discover Award for “The Pleasing Hour”\n* 1995 MacDowell Fellowship\nWorks\n*\n*\n* Father of the Rain: A Novel, Grove/Atlantic, 2010\n* Euphoria, Atlantic Monthly Press, 2014.\n* Writers & Lovers, Grove Press, 2020.\n* Five Tuesdays in Winter, Grove Press, 2021.\n* Heart the Lover, Grove Press, 2025.\nReferences\n}}\nExternal links\n* [http://www.lilykingbooks.com/ Official website]\n* [http://www.whiting.org/awards/winners/lily-king#/ Profile at The Whiting Foundation]"
    }
  ]
}