{
  "content": [
    {
      "type": "text",
      "text": "# Lincoln Monument (Philadelphia)\n\n| width         =\n| height        = Overall: Sculpture:\n| begin         = Commissioned 1866Cast 1870\n| dedicated     = September 22, 1871\n| dedicated_to  =Abraham Lincoln\n| coordinates   =\n| extra_label   = Owner\n| extra         = City of PhiladelphiaFairmount Park Commission\n}}\nLincoln Monument (Philadelphia) is a monument honoring Abraham Lincoln in Fairmount Park, Philadelphia, Pennsylvania, United States. One of the first initiated in memory of the assassinated president, the monument was designed by neoclassical sculptor Randolph Rogers and completed in 1871. It is now located northeast of the intersection of Kelly Drive and Sedgley Drive, opposite Boathouse Row.\nDescription\nRogers modeled Lincoln the Emancipator in Rome. The twice-life-size bronze sculpture depicts a seated Lincoln in the act of signing the Emancipation Proclamation, and is about  in height,  in width, and  in length.\nThe granite base is in three sections: The upper section features four bronze plaques depicting a laurel wreath and crossed swords (east), crossed American flags (west), the Seal of the City of Philadelphia (north), and the Great Seal of the United States (south). At the corners, bronze eagles stand atop granite scrolls before bronze garlands of laurel leaves. The middle section features the monument's dedication inscription and quotations from the Emancipation Proclamation, Gettysburg Address, and Second Inaugural Address. The lower section is sloped and rough-cut, with projecting buttresses at the corners. The base is about  in height.\nThe statue and bronzework were cast at the Royal Bavarian Foundry in Munich, in 1870, at a cost of $3,000. The granite base was executed by Struthers & Sons, a Philadelphia masonry firm. \"The cost of the statue was nineteen thousand three hundred dollars, and of the granite base nine thousand four hundred dollars.\"\nHistory\nMonument Association\nPresident Lincoln was assassinated on April 15, 1865, and on May 22 the Lincoln Monument Association was formed in Philadelphia. Chaired by Mayor Alexander Henry, the Association rapidly raised $22,000 to commission a monument for the city honoring the late president of the United States. A number of American sculptors were invited to submit a pair of models for the monument's sculpture—a standing figure of Lincoln; and a group featuring a standing Lincoln and an allegorical figure. Thomas Ball and Randolph Rogers were the only sculptors to submit models.\nRogers strayed from the Association's guidelines: his solo figure was a seated Lincoln; and, instead of the late president and a Greek goddess, his group featured a crouching semi-nude enslaved woman, with a standing Lincoln helping her to rise. The sculptor justified his seated figure: \"Mr. Lincoln in a sitting posture holding in one hand the Emancipation Proclamation, and a pen in the other, his eyes turned toward heaven, asking the Almighty for his approval for the act. It was the great event of his life.\" The Association chose the seated Lincoln over the slavery group, and Rogers was awarded the Philadelphia commission in 1866.\nRogers, an American expatriate who trained and lived most of his life in Italy, created the Columbus Doors for the U.S. Capitol, 1855–1861.  Concurrently with the Philadelphia monument, he worked on four major Civil War monuments—the Soldiers' National Monument (1865–1869) at Gettysburg National Cemetery; the Rhode Island Soldiers' and Sailors' Monument (1866–1871) in Providence; the Michigan Soldiers' and Sailors' Monument (1867–1872) in Detroit; and the Soldiers' Monument (1871–1874) in Worcester, Massachusetts.\nRogers's final design was approved by the Association by March 1868:\nTHE PHILADELPHIA LINCOLN MONUMENT.—The Lincoln Monument Association of this city have adopted a design for a bronze statue of the late President of the United States, ABRAHAM LINCOLN. It is the work of RANDOLPH ROGERS, the American sculptor, at Rome. The figure is in a sitting posture, and will be nine feet high, and the pedestal, of granite, fourteen feet high. In the left hand Mr. LINCOLN holds the Emancipation Proclamation, and in his right the pen with which he has just signed it. The upper-side panels of the pedestal will be decorated with the arms of the United States on the one side and those of the City of Philadelphia on the other, in bronze, the corners being supported with Roman fasces, also in bronze. on the lower corners of the pedestal are four American Eagles supporting festoons of laurels, all in bronze. The bronze work is to be executed at the Royal Foundry, at Munich. The whole cost of the monument will be about $30,000, of which the Association has some $25,000.\nThe Association's chosen site for the Lincoln Monument was the center of the intersection of North Broad Street and Girard Avenue, but this plan was abandoned in 1869, for Fairmount Park.\n1871 Dedication\nThe monument was installed on a grassy traffic circle at the intersection of East River Drive (now Kelly Drive) and Sedgley Drive. A temporary platform was erected opposite it for the monument's  September 22, 1871 dedication.The day adopted for the formal unveiling of the statue was the anniversary of Mr. Lincoln's first proclamation of emancipation. To give eclat to the occasion various functionaries connected with the national and State Governments, the corporate authorities of the city, literary and scientific bodies, and a number of citizens distinguished by services and merit were invited to attend. The entire volunteer force of the first military division paraded, and numerous commanderies of the Knights Templars, in their gorgeous costumes, also assisted.\nA number of speakers addressed the crowd of 50,000. President Ulysses S. Grant had been invited, but was unable to attend. Instead, the oratory address was delivered by Col. William McMichael, a former military aide to Gen. Grant and the son of a former Philadelphia mayor. McMichael began with a greeting, recounted the major events of the Civil War and Lincoln's assassination, the President's funeral procession in Philadelphia and lying in state at Independence Hall, and concluded with a quote from the Gettysburg Address. Excerpts:\nIn your presence, fellow-citizens, who loved him; on this chosen spot, in the chosen city where the nation was born in whose cause he died, and in the sight of heaven, whither his spirit has ascended, we unveil this statue of the greatest man of our time.We have come together to-day to dedicate a monument to this great, good man; great in his goodness, good in his greatness. An honest man&mdash;not merely in the sense of pecuniary correctness&mdash;no mean praise now&mdash;but honest also in that high integrity which places principle before policy, champions the cause of truth in the face of prejudice, and defends the right for its own sake, unswerved by patronage, unbribed by place. He had the wisdom to discern, the sincerity to avow his faith, the courage to maintain it. Long ago he declared that this Union could not endure half slave and half free. It seemed like heresy to say so then. We know that it was prophecy now. In this statue behold the record of its fulfilment. Who foretold liberty, himself proclaimed it.\nRandolph Rogers traveled from Italy for the unveiling, and was acknowledged from the platform. The dedication ceremony was followed by a grand military parade, \"which embraced the First Division of Pennsylvania Volunteers, under Maj.-Gen. Charles M. Prevost and four brigades under Brig.-Gens. John P. Bankson, J. William Hoffman, William B. Thomas, and Louis Wagner.\"\nPresent day\nIn January 2002, the Lincoln Monument was relocated about  to the north side of Kelly Drive, and the traffic circle was eliminated.\nInscriptions\nThe inscriptions are carved in granite on plaques at the middle section of the base.\n::Dedication, east (front) side:\n::From the Emancipation Proclamation, south (left) side:\n::From the Gettysburg Address, west (back) side:\n::From Lincoln's Second Inaugural Address, north (right) side:\nSee also\n* List of public art in Philadelphia\n* List of statues of Abraham Lincoln\n* List of sculptures of presidents of the United States\nReferences\nExternal links\n*Gasbarro, Norman. \"[http://civilwar.gratzpa.org/2012/10/abraham-lincoln-statue-in-fairmount-park-philadelphia/ Abraham Lincoln Statue in Fairmount Park, Philadelphia].\" Philadelphia, Pennsylvania: PA Historian, October 4, 2012.\n*[http://www.philart.net/artist.php?id=197 Abraham Lincoln], at Philadelphia Public Art"
    }
  ]
}