{
  "content": [
    {
      "type": "text",
      "text": "# Lincoln's Inn War Memorial\n\n'''Lincoln's Inn War Memorial''' is a war memorial in Lincoln's Inn, London.  It was erected in 1921 as a memorial to members of the Inn of Court who died on active service during the First World War.  It became a Grade II listed building in 1999.\nThe Portland stone memorial comprises a central pylon with a curved screen incorporating seats to either side, terminating with piers at each end.  The ensemble is about  long and stands on a stone base with three steps.\nThe screen and central monument bears the Latin inscription: \"HOSPITIUM SOCIIS / SANGUINEM PRO PATRIA LARGITIS / FILIIS PARENTES\" (\"Offer your solidarity in honour of the allied sons who generously gave their blood for their country\"), which can also be read as two separate inscriptions: \"SANGUINEM PRO PATRIA LARGITIS\" (\"For those who generously gave their blood for their country\") and \"HOSPITIUM SOCIIS / FILIIS PARENTES\" (\"Offer your solidarity in honour of the allied sons\").  The end piers bear the inscriptions \"CIƆ IƆ CCCC XIV\" and \" CIƆ IƆ CCCC XIX\" using  Roman numerals in the unusual apostrophus form for the dates 1914 (MDCCCXIV) and 1919 (MDCCCXIX).\nBrass plaques on the inside face of each pier record the names of the fallen from the First World War, listing 35 people in total.  A bronze plaque on the central pylon listing 66 further names of the fallen from the First World War, in two columns.  A further plaque was added listing another 29 names from the Second World War, including Prince George, Duke of Kent.\nOther war memorials in Lincoln's Inn include a table, a book of remembrance, a plaque in the chapel, and a memorial to a Zeppelin air raid in 1915.\nSee also\n* Inns of Court War Memorial near Berkhamsted\nReferences\n* [https://historicengland.org.uk/listing/the-list/list-entry/1379321 War memorial], National Heritage List for England, Historic England\n* [http://www.londonremembers.com/memorials/lincoln-s-inn-war-memorial Monument: Lincoln's Inn War Memorial], London Remembers\n* [https://www.warmemorialsonline.org.uk/memorial/246947/ Lincolns Inn Cenotaph], War Memorials Online\n* [https://www.warmemorialsonline.org.uk/memorial/161488/ Inns of Court], War Memorials Online\n* [http://www.iwm.org.uk/memorials/item/memorial/66651 Bar Table, Lincoln's Inn], Imperial War Museum\n* [http://www.iwm.org.uk/memorials/item/memorial/66650 Book of Remembrance, Lincolns Inn], Imperial War Museum\n* [http://www.iwm.org.uk/memorials/item/memorial/66649 Lincolns Inn German Zeppelin Air Raid 1915, Lincolns Inn], Imperial War Museum\n* [http://www.iwm.org.uk/memorials/item/memorial/66648 Inns of Court Regiment – WW2 Tablet], Imperial War Museum"
    }
  ]
}