{
  "content": [
    {
      "type": "text",
      "text": "# Lincoln Monument (Wabash, Indiana)\n\nThe Lincoln Monument of Wabash, Indiana or The Great Emancipator is a public sculpture by Charles Keck (September 9, 1875 – April 23, 1951), a sculptor who was born in New York City. The cast bronze sculpture was commissioned by Wabash-native Alexander New and donated to the city of Wabash, Indiana, in 1932. It has remained on view at the northeast corner of the Wabash County Courthouse lawn ever since.\nDescription\n[[Image:Looking_south_east_at_The_Lincoln_Monument_of_Wabash,_Indiana_by_Charles_Keck._Photo_from_the_SIRIS_web_page..jpg |thumb|left|This view of the sculpture is from the early 1990s Save Outdoor Sculpture! [https://web.archive.org/web/20100428012634/http://www.heritagepreservation.org/programs/SOS/index.html] survey. The vantage point is looking to the south east.]]\nThe sculpture depicts a larger-than-life Abraham Lincoln wearing a beard and sitting on a rock with his head slightly bowed forward and his arms resting on his knees. Both of his hands are closed except for his extended right index finger. Lincoln is wearing a bow tie, vest, long coat and boots&mdash;his right boot extends just beyond the edge of the base. His watch chain is visible on his vest.\nAlong the back proper left edge of the bronze base is a foundry mark that reads \"Gorham Co. Founder\". Just past this mark appears to be another kind of indecipherable foundry mark or signature written in black, raised letters.\nThe front of the granite base is inscribed:\nLINCOLN\nWITH MALICE TOWARD NONE\nWITH CHARITY FOR ALL\nThe back of the granite base is inscribed:\nERECTED IN LOVING MEMORY\nOF HIS PARENTS\nISAAC AND HENRIETTA NEW\nBY\nALEXANDER NEW\n1932\nOther Versions\n;The Lincoln Monument of Hingham, Massachusetts\n:The town of Hingham, Massachusetts, owns what appears to be an identical version of this sculpture. It is displayed on a granite base and carries the same inscription on the front as the Wabash Lincoln. It was dedicated to the citizens of Hingham on September 23, 1939.\nImage:The_Lincoln_Monument_of_Hingham,_MA_by_Charles_Keck._Photo_from_the_SIRIS_web_page..jpg|Front view of the Lincoln Monument of Hingham, Massachusetts, by Charles Keck\nImage:Back_of_the_Lincoln_Monument_of_Hingham,_MA_by_Charles_Keck._Photo_from_the_SIRIS_web_page..jpg |Back view of the Lincoln Monument of Hingham, Massachusetts, by Charles Keck\nImage:Detail_of_the_Lincoln_Monument_of_Hingham,_MA_by_Charles_Keck._Photo_from_the_SIRIS_web_page..jpg  |Detail of the head of the Lincoln Monument of Hingham, Massachusetts, by Charles Keck\n;The Maquette of the Lincoln Monument\n:A maquette of the sculpture is owned by President Lincoln's Cottage at the Soldiers' Home, in Washington, D.C. The sculpture appears similar to the Wabash and Hingham versions, except that it is much smaller, Lincoln holds a book in his right hand, and his hat is visible near his right boot.\nMaterials\nThe sculpture was likely cast in multiple sections of bronze, a copper alloy. It rests on a granite-clad square base.\nDimensions\nThe bronze sculpture has an approximate height of 7 feet, depth of 6 feet, and width of 6 feet.\nThe base has an approximate height of 4 feet, depth of 7 feet, and width of 7 feet.\nHistory and location\nThe sculpture was commissioned by Alexander New, who \"grew up in Wabash, studied law, and ultimately built up a large chain of stores whose main offices were in New York.\"\nThe sculpture was unveiled and dedicated in Wabash on May 31, 1932 (Memorial Day), a year after Alexander New's death. A photograph [http://images.indianahistory.org/u?/dc006,70 ] in the Indiana Historical Society collections from the day of the unveiling depicts the courthouse lawn with onlookers packed around the sculpture and even seated on one of the porch roofs of the Wabash County Courthouse. In this image the sculpture appears to have an even, dark patina.\nHomer T. Showalter, the mayor of Wabash at the time of the sculpture's unveiling, provided this first-hand account of the sculptures installation:\nThe sculpture was inspected in 1992 as part of the Save Outdoor Sculpture! (SOS!) program and an on-line record [http://siris-artinventories.si.edu/ipac20/ipac.jsp?&profile=all&source=~!siartinventories&uri=full=3100001~!309310~!0#focus] was created in the Smithsonian Institution Research Information System (SIRIS). The black-and-white image,[http://sirismm.si.edu/saam/scan2/SIN000018_b.jpg ]  taken around the time of that inspection, shows the sculpture no longer having the even, dark patina that the sculpture had when it was unveiled in 1932. Likewise, Greiff's 2005 publication shows the sculpture with a similar appearance.\nAs of June 2008, the sculpture appears to have a similar even, dark patina as it did in 1932, indicating that its appearance has recently been changed.\nBy comparison the version of this sculpture in Hingham, Massachusetts, appeared to have an even, dark patina when it was inventoried as part of the SOS! program in 1996. Likewise, the smaller version at President Lincoln's Cottage shows an even, dark patina.\nImages\nImage:Wabash_County_Courthouse_with_Lincoln_Monument_by_Charles_Keck_in_the_foreground_Taken_on_May_15,_2002.jpg|Looking southwest at the Lincoln Monument of Wabash, Indiana, by sculptor Charles Keck. Photograph taken May 15, 2002.\nImage:Wabash_County_Courthouse_with_Lincoln_Monument_by_Charles_Keck_in_the_foreground_Taken_on_May_15,_2002_-2.jpg|Looking southwest at the Lincoln Monument of Wabash, Indiana, by sculptor Charles Keck. Photograph taken May 15, 2002.\nSee also\n* List of statues of Abraham Lincoln\n* List of sculptures of presidents of the United States\nReferences\nExternal links\nInformation about the artwork\n*Lincoln Monument Wabash, Indiana, [http://images.indianahistory.org/u?/dc006,70 image] of the unveiling on May 31, 1932, in the Indiana Historical Society's Digital Image Collections.\n*President Lincoln's Cottage [http://lincolncottage.wordpress.com/2008/07/21/kecks-lincoln-sculpture-an-important-part-of-new-exhibit/ Blog post], \"Keck's Lincoln Sculpture an Important Part of New Exhibit\", July 21, 2008, shows an image of what was likely the model for the Wabash Lincoln.\n* [https://talkingstatues.com/statue/abraham-lincoln-12/ The Lincoln Monument of Wabash, Indiana or The Great Emancipator] // Talking Statues\nImages or video of the artwork\n* [https://flickr.com/groups/823938@N20/ Flickr Group for Charles Keck]\n*Photographs by Ann Horn on Shutterpoint [https://www.shutterpoint.com/Photos-BrowseAlbum.cfm?album_id=63&user_id=ANNHORN]"
    }
  ]
}