{
  "content": [
    {
      "type": "text",
      "text": "# Line breaking rules in East Asian languages\n\nThe line breaking rules in East Asian languages specify how to wrap East Asian Language text such as Chinese, Japanese, and Korean. Certain characters in those languages should not come at the end of a line, certain characters should not come at the start of a line, and some characters should never be split up across two lines. For example, periods and closing parentheses are not allowed to start a line. Many word processing and desktop publishing software products have built-in features to control line breaking rules in those languages.\nIn the Japanese language, especially, the categories of line breaking rules and processing methods are determined by the Japanese Industrial Standard JIS X 4051, and it is called .\nLine breaking rules in Chinese text\nLine breaking rules for Chinese language have been described in the reference of Office Open XML, Ecma standard. There are rules about certain characters that are not allowed to start or end a line, such as below.\nSimplified Chinese\n*Characters that are not allowed at the start of a line :{{lang|zh-latn|!%),.:;?]}¢°·'\"†‡›℃∶、。〃〆〕〗〞﹚﹜！＂％＇），．：；？！］｝～|italic=no}}\n*Characters that are not allowed at the end of a line :\nTraditional Chinese\n*Characters that are not allowed at the start of a line :{{lang|zh-Hant|!),.:;?]}¢·–— '\"• 、。〆〞〕〉》」︰︱︲︳﹐﹑﹒﹓﹔﹕﹖﹘﹚﹜！），．：；？︶︸︺︼︾﹀﹂﹗］｜｝､}}\n*Characters that are not allowed at the end of a line :\nLine breaking rules in Japanese text (Kinsoku Shori)\nLine breaking rules of Japanese language are determined by JIS X 4051, Japanese Industrial Standard. It describes word wrap rules and processing rules for Japanese language documents. These rules are called Kinsoku Shori (, literally prohibition rules processing).\nWord wrap rules\nCategories\nRegarding prohibited characters, there are some conventions, known as \"house rules\", which are specific to individual publishers. The rules of some publishers contradict those of other publishers. For that reason, there are many conventions that are not supported by Western desktop publishing software tools, and that is the main cause of the growing demand of computerized phototypesetting systems.\nCharacters not permitted on the start of a line\n*Closing brackets\n:\n*Japanese characters: chiisai kana and special marks\n:\n:(Note: The kana listed here are the small, combining forms. Full-size kana can appear at the beginning of a line.)\n*Hyphens\n:\n*Delimiters\n:\n*Mid-sentence punctuation\n:\n*Sentence-ending punctuation\n:\nNote: Kinsoku Shori does not apply to Japanese characters while one line contains not enough characters.\nCharacters not permitted at the end of a line\n*Opening brackets\n:\nDo not split\n*Characters that cannot be separated\n:\n*Numbers\n*Grouped characters\n:  (Kanji sequences that have ruby characters that do not have a clear mapping to the underlying kanji characters (jukujikun)\nProcessing rules\n; Burasage (Hanging punctuation)\n: Move punctuation character to the end of the previous line.\n; Oidashi (Wrap to next)\n: Send characters not permitted at the end of a line to the next line, increase tracking to pad out first line. Another use is to wrap a character from the first line with the goal of preventing a character that shouldn't start a line from coming first on the next line.\n; Oikomi (Squeeze)\n: Reduce tracking on the first line to pull a character not permitted at the start of a line from being the first character on the second line.\n: If the software does not have tracking ability, white space is sometimes added to the end of a line.\n; Do not split\n: Use Oidashi and Oikomi to process. If characters that can't be split up straddle the end of a line, move them in a block to the next line using Oidashi, or keep them all together on the previous line by using Oikomi.\nLine breaking rules in Korean text\nLine breaking rules for Korean language have been described in the reference of Office Open XML, Ecma standard. There are rules about certain characters that are not allowed to start or end a line, such as below.\n*Characters that are not allowed at the start of a line :{{lang|ko|!%),.:;?]}¢°'\"†‡℃〆〈《「『〕！％），．：；？］｝}}\n*Characters that are not allowed at the end of a line :\nKorean standards related to line breaking rules\n*KS X ISO/IEC 26300:2007, OpenDocument standard in Korea, describes hyphenation at the start or at the end of line in OpenDocument.\n*KS X 6001, standard for file specification of Korean word processor intermediate document, describes rules for line breaking at the end of page.\nSee also\n*Word wrap\n*Word processor\n*Typography\n*Chinese punctuation\nReferences\nExternal links\n*[http://msdn.microsoft.com/en-us/goglobal/bb688158.aspx Rules for Breaking Lines in Asian Languages], Microsoft Go Global Developer Center"
    }
  ]
}