{
  "content": [
    {
      "type": "text",
      "text": "# Lionel's Kingdom\n\n'Lionel's Kingdom (Turma da Mata') is a Brazilian comic strip created in 1961 and part of the ''Monica's Gang comic strips.\nThe series features anthropomorphic animals who almost all walking on two feet (except for Tim Turtle), wear clothes, and obviously, are able to speak. Their home is a forest, presumably in Brazil, although featuring mostly African animals. Originally the strips began with the protagonist character McFox (Raposão), but over the years with the popularity and constant protagonism of other characters, comics have gone untitled for many years until being renamed to the current title.\nCharacters\n* Thunder (Jotalhão Jota Matheus Elefantônio Moreira) – Although the English name of this set of characters is given after Lionel, Thunder is the true main character in most stories. He is a green elephant, with human-like hands, and one of the most beloved characters created by Mauricio de Sousa. He is very shy, calm, and a pacifist. Thunder was originally created in 1962 as a symbol of the letter \"J\" of the newspaper Jornal do Brasil, thus deriving his original name Jotalhão which is an augmentative of Jota (Portuguese for J), but the character ended up not being used and was later introduced as a support character for McFox in newspaper comics in 1965. He is also used as spokestoon for the tomato sauce brand Elefante'' since 1968, originally derived from a newspaper strip joke involving him and Monica, but that eventually aroused interest for CICA (a defunct and now Unilever-owned  Brazilian food company) to partner with Mauricio de Sousa to use the characters in TV commercials. Due to his popularity he often appears together Monica and other characters in products and comics based in Monica's Gang.\n* King Lionel (Rei Leonino) - The king of the forest. This brown lion feels really pleased to be occupying the throne and to be giving orders to his vassals, although he's not a dictator or an authoritarian. He lives in his palace, which is actually a cavern, protected by monkey-guards.\n* Lou Courier (Ministro Luís Caxeiro) – Lionel's most important and loyal vassal and employee. Although he is officially the Minister of Come & Go, he serves Lionel more like a secretary. He serves as a messenger between Lionel and his kingdom, and vice versa, making him also a spokesman. Lou is a blue hedgehog.\n* Tim Turtle (Tarugo) – One of Thunder's best friends. This green jabuti wears glasses, and has his head coming out of a \"sunroof\" in the middle of his carapace, instead of the front edge, as a normal jabuti. Also, he has wheels instead of feet (although initially he would have normal feet). His Portuguese name is a pun on the word \"Tartaruga\", which means Turtle in that language.\n* McFox (Raposão) – One of Thunder's friends. A fox who usually acts like the trickster of the forest wanting to lead an easy life and food. He usually appears with his best friend Mr. Zig Zag, whom he calls his compadre. A recurring theme in his stories is that he shows interest in trying to eat grapes that are high on vines in reference to the fable The Fox and the Grapes. He was considered the main protagonist in the early years, but over time his role was reduced.\n* Ant Rita (Rita Najura) – A small purple ant. She has a crush on Thunder, despite the differences between them, either in size, either in species, and her attempts include creating traps for him to marry her against his will. Rita's attempts to date Thunder are almost the only subject of her strips - a similar situation to that of Piteco and Tooga, characters of another set related to Monica's Gang. Her Portuguese name is a joke on the word tanajura (Atta), a Brazilian species of ant.\n*  Mr. Zig Zag (Coelho Caolho) – This rabbit also wears glasses, has crossed ears, and lives under the ground, on a burrow filled with his uncountable children, a reference to the high rates of reproduction of rabbits. The official number of children is 118, although there are no instances where all 118 appear together. He also wears a yellow shirt that looks like a dress.\nMedia\nBesides the TV commercials, Thunder also appears in films like As Novas Aventuras da Turma da Mônica, O Natal de Todos Nós and Cine Gibi: O Filme usually along the Monica's Gang characters. In 1971 a song to Thunder was composed for the album \"A Bandinha da Turma da Mônica\", in 1987 another song for Thunder was composed for the album \"Turma da Mônica\", entitled O Elefante mais Amado do Brasil (lit. The Most Loved Elephant in Brazil, an allusion to Thunder's high popularity in commercials).\nThe series also had two special comic books in the '90s by Editora Globo, and also an almanac with classic stories that was published by Panini Comics between 2010 and 2014, the latter starring alongside The Tribe. The characters have also appeared in the fourth issue of Monica Teen; redesigned in a manga-esque style being part of a dimension called Tchalu, represented at first as a feudal Japanese people, but in later issues the characters make cameos with a design more similar to original version.\nIn 2015 a graphical novel based on the characters titled: Turma da Mata: Muralha, was published as part of the Graphic MSP, being illustrated and written by Roger Cruz, Davi Calil and Artur Fujita. Thunder, Ant Rita and McFox also appears in some episodes of the webcartoon Monica Toy, with one of the episodes under the title Jotalhão Toy.\nThunder is also playable character in the 2018 game Mônica e a Guarda dos Coelhos.\nIn the live-action movie Turma da Mônica: Laços Thunder has a cameo as a plush in Jimmy Five's room.\nReferences\n* [https://web.archive.org/web/20080902022732/http://www.monica.com.br/ingles/personag/t-mata.htm Lionel's Kingdom at Mônica’s Gang official website]\nExternal links\n* [https://web.archive.org/web/20071229074037/http://www.monica.com.br/ingles/index.htm Official Monica’s Gang website]\n* [https://web.archive.org/web/20071231221125/http://www.monica.com.br/index.htm Official Monica’s Gang website]\n* [https://www.youtube.com/watch?v=G0KD7iKP-2I The famous TV commercial featuring Thunder at YouTube]"
    }
  ]
}