{
  "content": [
    {
      "type": "text",
      "text": "# Lisa Warrington\n\n| image              = Lisa Warrington ONZM (cropped).jpg\n| alt                =\n| caption            = Warrington in 2024\n| native_name        =\n| native_name_lang   =\n| pronunciation      =\n| other_names        =\n| birth_name         = Lisa Jadwiga Valentina Warrington\n| birth_date         =\n| birth_place        = England\n| death_date         =\n| death_place        =\n| nationality        =\n| citizenship        =\n| education          =\n| alma_mater         = University of Tasmania\n| occupation         = Theatre studies lecturer\n| years_active       =\n| era                =\n| organization       =\n| agent              =\n| known_for          =\n| notable_works      = Theatre Aotearoa database\n| style              =\n| net_worth          =\n| height             =\n| weight             =\n| television         =\n| title              =\n| term               =\n| predecessor        =\n| successor          =\n| party              =\n| movement           =\n| opponents          =\n| boards             =\n| criminal_charge    =\n| criminal_penalty   =\n| criminal_status    =\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| mother             =\n| father             =\n| relatives          =\n| family             =\n| callsign           =\n| awards             = Lifetime Achievement Award, Dunedin Theatre Awards 2014New Zealand Listener Best Director award 2004, 2005, 2007\n| website            =\n| thesis_title       = Allan Wilkie in Australia: The work of a Shakespearean actor-manager\n| thesis_year        = 1981\n}}\nLisa Jadwiga Valentina Warrington  (born 14 February 1952) is a New Zealand theatre studies academic, director, actor and author. She has directed more than 130 productions, and established the Theatre Aotearoa database. In 2014 she was awarded a Lifetime Achievement Award in the Dunedin Theatre Awards, and was three times winner of a New Zealand Listener Best Director award, including one for Tom Scott's The Daylight Atheist.\nEarly life and education\nWarrington was born in 1952, and spent much of her early life in England, Nigeria, and Australia. She is of English and Polish descent, her parents Jozef and Patricia (née McLean) having changed their surname to Warrington from Wawrzynczak. Her sister is Australian actress, songwriter and author Carmen Warrington (b. 1957); her brother Jan was a Multicultural Arts Officer and lighting designer based in Canberra (d. 2008).\nWarrington obtained a BA (Hons) from the University of Tasmania in 1973, with a thesis titled Dunbar, the concise artist: a study of aspects of language, structure and imagery in his poetry. In 1981 she followed this with an MA, also at the University of Tasmania, titled Allan Wilkie in Australia: the work of a Shakespearean actor-manager.\nCareer\nWarrington taught at the University of Tasmania before being appointed as the William Evans Lecturer at the University of Otago in 1981. She initially had 30 students and was the University's only drama lecturer, with only three others in the entire country. In 1990, she led the introduction of a directing programme to the University of Otago's Theatre Studies programme. From 2011 she was appointed as Associate Professor there.\nWarrington is also responsible for the front door of the Allen Hall Theatre being painted red.\nMany of Warrington's academic publications deal with indigenous theatre in Aotearoa New Zealand, particularly Māori as well as Pasifika practitioners and productions. With David O'Donnell, Warrington wrote Floating Islanders: Pasifika Theatre in Aotearoa, a book based on interviews with practitioners over the course of seven years that, among other things, catalogues Pasifika theatre from 1984 to 2014. The book's title comes from an interview with Samoan playwright and filmmaker Makerita Urale.\nWarrington, a co-founder of Wow! Productions, directed more than 35 productions at Dunedin's Fortune Theatre, and was Acting Artistic Director of the Fortune for the latter part of 1985. She was then Associate Director of the Fortune from 1985 to 1991. She has directed more than 130 productions in total, including many for Wow! Productions.\nWarrington retired from the University of Otago on 30 June 2018, after 37 years of teaching, although she continues to work freelance and to maintain the Theatre Aotearoa database. Warrington began the database in 2004, and as of July 2021 it contained details on 17,156 New Zealand theatre productions in New Zealand and overseas. Her goal for the database is for it to cover all theatre productions in New Zealand from 1840 onwards.\nSelected productions\n* Directions, directed by Lisa Warrington and Rawiri Paratene, written by Paratene, Fortune Theatre, 1981. This was the Fortune Theatre's inaugural Youth Theatre Workshop.\n*The Cherry Orchard, directed by Lisa Warrington, with a cast consisting of Toi Whakaari: New Zealand Drama School students, including Cliff Curtis and Michael Galvin.\n*When I was a girl, I used to scream and shout, by Sharman Macdonald, directed by Lisa Warrington. Circa Theatre, Wellington, 20 January 1989\n*Nga Puke, by John Broughton, directed by Lisa Warrington, part of Te Rakau Hua o te Wao Tapu: Contemporary Māori performing arts, at Depot Theatre, Wellington, Feb–April 1990\n*Kaz: A Working Girl by Leah Poulter (Premiere. Fortune Theatre, Theatre Corporate Auckland and National Library Wellington, 1990). Starring Miranda Harcourt.\n*Arcadia by Tom Stoppard, at the Dunedin Public Art Gallery in 1998\n*Bruised, by Richard Huber, directed by Lisa Warrington, presented by GetON Productions and Allen Hall Theatre. Acted by Edwin Wright. BATS Theatre, Wellington, 3–14 April; Silo Theatre, Auckland, 19–27 April 2001\n*Lines of Fire by Gary Henderson, script commissioned by Wow! Productions, performed at the Dunedin Railway Station in 2006. Warrington later wrote about the staging of the play.\n*Four Flat Whites in Italy, by Roger Hall, at the Fortune Theatre, 2009.\n* As You Like It, directed by Lisa Warrington, by Toi Whakaari: NZ Drama School third year students, at Basement Theatre, Te Whaea, Wellington, June 2014\n*''Farley's Arcade (2015), a site specific historical promenade theatre event, at the Athenaeum, co-created with Richard Huber, Rua McCallum, Gareth McMillan, Martyn Roberts, and co-directed, Wow! Productions.\n*The End of the Golden Weather by Bruce Mason, featuring Matt Wilson, at Macandrew Bay Hall, Port Chalmers Library, Pioneer Women’s Hall, Oamaru Grainstore Gallery, and other locations in Mosgiel, Waitati and Dunedin, 2020. Reviewer Terry MacTavish said \"One of the country’s leading directors, Lisa Warrington, shows her customary finesse... ...[a] luminous, compassionate production.\"\nSelected publications\n*\n*\n* (Second edition, updated, published in 2012)\n*\n*\n*\n*\n*\n*\n*\nHonours and awards\nWarrington was awarded a Lifetime Achievement Award at the Dunedin Theatre Awards in 2014. The same year she was awarded a New Zealand Theatre Services honour medal. Warrington has been created a Life Member of the Australasian Association for Theatre, Drama and Performance Studies.\nShe received a New Zealand Listener Best Director award three times:\n* 2007 for The Road To Mecca\n* 2005 for Auntie and Me\n* 2004 for The Daylight Atheist and Cherish\nIn 2018, Warrington won the Rob Jordan Book Prize, awarded by the Australasian Association for Theatre, Drama and Performance Studies, for Floating Islanders'' (joint award with David O'Donnell).\nIn the 2024 King’s Birthday Honours, Warrington was appointed an Officer of the New Zealand Order of Merit, for services to theatre and education.\nSee also\n*\nReferences\nExternal links\n*  Warrington's [https://scholar.google.co.nz/citations?user=sLqQieEAAAAJ&hl=en Google Scholar profile]\n*  [https://tadb.otago.ac.nz/theatre/Login/Index.php Theatre Aotearoa] database"
    }
  ]
}