{
  "content": [
    {
      "type": "text",
      "text": "# Lisa H. Schwartzman\n\nLisa H. Schwartzman (born 1969) is a philosophy professor and well known feminist and social/political philosopher currently teaching at Michigan State University. Schwartzman earned her Ph.D. in philosophy at the State University of New York at Stony Brook in 2000 before going on to teach courses on feminist theory, social and political philosophy, philosophy of law, and ethics at Michigan State.\nContributions to philosophy\nSchwartzman's work primarily focuses on feminist theory, social and political philosophy, ethics, philosophy of law, informal logic, and medical ethics. She was the Program Committee Chair for the Feminist Ethics and Social Theory Conference (held in Sept. 2009) and a member of the American Philosophical Association Committee on the Status of Women from 2008 to 2011. In addition, Schwartzman was a member of the Local Advisory Board for Hypatia: A Journal of Feminist Philosophy from 2003 to 2008 and was the Program Committee Co-Chair for the North American Society for Social Philosophy's 21st International Conference.\nProfessional publications\nSchwartzman has published numerous peer-reviewed articles in journals such as Metaphilosophy, Social Theory and Practice, The Journal of Social Philosophy, and Hypatia:  A Journal of Feminist Philosophy . Her books include Challenging Liberalism:  Feminism as Political Critique  and Feminist Interventions in Ethics and Politics:  Feminist Ethics and Social Theory.\nAwards and distinctions\nIn addition to being elected to serve on the Local Advisory Board for Hypatia: A Journal of Feminist Philosophy from 2003 to 2008 and on the Program Committee for the North American Society for Social Philosophy's 21st International Conference, Schwartzman also received both the SUNY at Stony Brook Graduate Council Commendation to a Distinguished Doctoral Student Award (2000) and The Madeline Fusco Fellowship Award (1999).  Schwartzman is also a James B. Angell Scholar and is a member of Phi Beta Kappa.\nSelected works\n*Challenging Liberalism:  Feminism as Political Critique (University Park, Pennsylvania: Pennsylvania State University Press, 2006).\n*Feminist Interventions in Ethics and Politics:  Feminist Ethics and Social Theory, ed. Barbara S. Andrew, Jean Keller, and Lisa H. Schwartzman (Lanham, Maryland:  Rowman and Littlefield, 2005).\nJournal Articles (Refereed)\n*\"Abstraction, Idealization, and Oppression,\" Metaphilosophy, Vol. 37, No. 5 (October 2006), pp.&nbsp;565–588.\n*\"Feminist Analyses of Oppression and the Discourse of 'Rights':  A Response to Wendy Brown,\" Social Theory and Practice, Vol. 28, No. 3 (July 2002), pp.&nbsp;465–480.\n*\"Hate Speech, Illocution, and Social Context: A Critique of Judith Butler,\" Journal of Social Philosophy, Vol. 33, No. 3 (Fall 2002), pp.&nbsp;421–441.\n*\"Liberal Rights Theory and Social Inequality:  A Feminist Critique,\" Hypatia:  A Journal of Feminist Philosophy, Vol. 14, No. 2 (Spring 1999), pp.&nbsp;26–47.\nSee also\n*American Philosophy\n*American Philosophers\nReferences"
    }
  ]
}