{
  "content": [
    {
      "type": "text",
      "text": "# List of Romanian-built warships of World War II\n\nDuring and up to the Second World War, the naval industry of the Kingdom of Romania produced numerous medium and small size warships, of varying types, as well as auxiliaries. Warships were produced mainly for the Romanian Navy, but later Romanian naval facilities and products also benefited the Kriegsmarine, among others.\nFacilities\nThe most important Romanian shipyard was at Galați, followed by the one at Constanța and finally the ones at Severin and Brăila. Galați benefited of the country's only dry dock, built in 1937. It also had two floating docks which could lift 200 and 300 tons respectively. The entire facility employed 500–800 people. Constanța, although lacking a dry dock, had by far the largest floating dock in the country, able to lift up to 8,000 tons. Brăila also had a floating dock for small craft, which could lift up to 100 tons. Severin had no dry or floating dock, but for much of the interwar it was the only other port in the country besides Galați able to produce anything larger than barges, lighters and small river craft. Maximum annual building capacity amounted to 1,500 tons as of 1933. This facility employed 100 people.\nWarships produced for the Romanian Navy\nMihail Kogălniceanu-class\nIn 1907, despite lacking a dry dock, the Romanian shipyard at Galați was able to co-build a class of four 700-ton river monitors for the Romanian Danube Flotilla: the Mihail Kogălniceanu class. The four vessels of this class were built in sections at STT in Austria-Hungary, transported to Romania then assembled and launched at Galați. Each monitor had an overall armour thickness of 70–75&nbsp;mm. During World War II, all four monitors were fitted for service at sea as anti-submarine escorts, each being armed with three 120&nbsp;mm naval guns in single armored turrets, one 76&nbsp;mm naval/AA gun, two 47&nbsp;mm naval guns and two depth charge throwers (one of 760&nbsp;mm and the other of 700&nbsp;mm). The four warships were in service throughout both world wars. Mihail Kogălniceanu engaged in battle and damaged two Soviet river monitors during the first month of Operation Barbarossa. She also shot down one Soviet aircraft on 29 June 1941.\nAmiral Murgescu\nAmiral Murgescu was a multi-purpose warships, serving as both minelayer and escort ship. With a standard displacement of 812 tons and a full load displacement exceeding 1,000 tons, she was the largest Romanian-built warship of World War II and also the first sea-going warship built in Romania. Amiral Murgescu was laid down on 1 August 1938 and launched on 14 June 1939. Her commissioning took place on 2 March 1941 She measured 76.9 meters in length, with a beam of 9.1 meters and a draught of 2.5 meters. She was armed with two 105&nbsp;mm SK C/32 dual-purpose naval/AA guns, two Rheinmetall 37&nbsp;mm guns and four Oerlikon 20&nbsp;mm guns. She could carry up to 135 mines. She was also fitted with two depth charge throwers. With 12 Soviet aircraft shot down and numerous Soviet warships sunk or damaged by her mines, Amiral Murgescu was the most effective Romanian Navy warship of the Second World War.\nMarsuinul and Rechinul\nMarsuinul was designed by NV Ingenieurskantoor voor Scheepsbouw in the Hague, her design being an improvement of the earlier Vetehinen-class of the Finnish Navy. She was laid down at the Galați shipyard in 1938 and launched on 4 May 1941. She had a standard (surfaced) displacement of 620 tons, a length of 58 meters, a beam of 5.6 meters and a draught of 3.6 meters. Her power plant consisted of two MAN diesel engines and two electric motors powering two shafts, giving her a top speed of 16 knots on surface and 9 knots in immersion. She was armed with one 105&nbsp;mm deck gun, one 37&nbsp;mm anti-aircraft gun and six 533&nbsp;mm torpedo tubes (four in the bow and two in the stern), her crew amounting to 45.\nRechinul was a minelaying submarine, also designed by Ingenieurskantoor voor Scheepsbouw (IvS) and built at the Galați shipyard in Romania. She was also laid down in 1938 and launched on 22 May 1941. She had the same power plant as her sister, with a slightly faster surface top speed of 17 knots, due to her standard (surfaced) displacement of 585 tons (35 tons lighter than her sister). Her submerged top speed was however the same, 9 knots. She was armed with four 533&nbsp;mm torpedo tubes (all in the bow), one 88&nbsp;mm deck gun, one 20&nbsp;mm anti-aircraft gun and could carry up to 40 mines in 10 vertical tubes (5 tubes on each side). Her crew amounted to 40.\nDB-13-class\nFour vessels of the German M1940 type were acquired by the Romanian Navy in 1943. They were built locally from German materials. These Romanian warships had a standard displacement of 543 tons and a full load displacement of 775 tons. They measured 62 meters in length, with a beam of 8.5 meters and a draught of 2.3 meters. Armament consisted of two 88&nbsp;mm guns plus one twin 37&nbsp;mm and three single 20&nbsp;mm anti-aircraft guns, as well as two depth charge throwers. Two-shaft triple-expansion coal engines generated an output of 2,400 hp resulting in a top speed of 17 knots and a range of just over 1,000 nautical miles at that speed. Each of the four vessels (DB-13, DB-14, DB-15  and DB-16) had a crew of 80. In 1951, their power plants were converted to oil. It is possible that, although launched in 1943, none of the ships was actually completed by the end of the war, but in 1953.\nSmall warships and auxiliaries\nThe Vedenia class was a unique derivation of the British Power Boat MTB. By design, the six vessels of this class represented the Dutch version of the Power boat. They were built under licence at the Galați shipyard in Romania, being laid down in 1939 and commissioned in 1943. The six boats, numbered 4 to 9, were named Vedenia, Vântul, Vijelia, Viforul, Vârtejul and Vulcanul. Vijelia and Viforul were named after their Vospers type predecessors, which were sunk in November 1941 by Soviet mines. Each of the six boats was armed with two 20&nbsp;mm anti-aircraft guns and two 457&nbsp;mm (18 inch) torpedo tubes. The six boats were in service until at least 1954.\nAs of 1942, the first military vessel known to have been built in Romania was still in use. She was a 10-ton steam launch, used for border patrol. Built at Galați in 1900, she measured 14 meters in length, with a beam of 2.40 meters and a draught of 1 meter. Her top speed was of 8 knots with a crew of 5.\nIn regard to auxiliary vessels, barges of up to 1,700 tons were built at Galați before the war. Two such barges were fitted for coastal defense as floating artillery sections, each barge being armed with two guns: one with 47&nbsp;mm guns and the other with 152&nbsp;mm guns. These two armed barges were towed by two military tugs of over 600 tons each, built at Galați in 1941. The two tugs were named Vârtosu and Stoicescu. These maritime vessels were supplemented by a 420-ton river steamer, built prewar at the same shipyard. In 1942, Romania launched its first native-built tanker. Named SRT-128, she was also built at Galați.\n{| class=\"wikitable\"\n|-\n!Number of warships\n!Total displacement (standard)\n!Total guns (20–152&nbsp;mm)\n!Total guns (76–152&nbsp;mm)\n!Torpedo tubes\n!Depth charge throwers\n!Mines\n|-\n|19  || 9,000 tons || 80 || 30 || 22 || 18 || 175\n|}\nWarships assembled for the Kriegsmarine''\nbeing reassembled at Galați]]\nIn order to boost Axis naval strength in the Black Sea, the OKW ordered to the region the transfer of six E-boats of the 1st S-flotilla, the last to be released from action in the Baltic Sea before refit. The Romanian port of Constanța was elected as the S-flotilla's headquarters. Transporting the six boats overland from Germany to Romania was an impressive logistical feat. The superstructure and all weapons were removed, leaving only the hull. After a long road journey of 60 hours, the boats arrived at Ingolstadt, where they were transferred back to water and towed towards Linz. Upon reaching the Austrian city, the superstructure was rebuilt, then the journey continued down the Danube to Galați, where the main engines were installed. The E-boats then continued on their own power towards Constanța, where refitting was completed.\nSix U-boats of the rather small coastal submarine Type IIB, which at the time served as training vessels in the Baltic Sea, were assigned to the Black Sea theatre. Starting from May 1942, they were partially dismantled in Kiel, to reduce weight and size. Toppled over 90°, and fitted with additional floating devices, the stripped down hulls, weighing 140 tons, were shipped through the Kiel Canal and on the Elbe up to Dresden-Übigau, where they were placed on two 70 ton Culemeyer road transporters hauled by Kaelble tractors. The boats then traveled at an average speed of 5&nbsp;mph over the Reichsautobahn (modern day A4 and A9) to the slipway in Ingolstadt. Traveling down the Danube, one obstacle was the old Stone Bridge of Regensburg with its arches. Eventually, the submarines arrived in the Romanian port of Galați where they were re-assembled.\nRomanian shipyards also built numerous Siebelfähre type landing craft for the local Kriegsmarine forces. Further production of landing craft and invasion barges was also realized, all from pre-fabricated parts delivered by Germany and Italy.\nReferences"
    }
  ]
}