{
  "content": [
    {
      "type": "text",
      "text": "# List of unusual deaths in the Renaissance\n\nThis list of unusual deaths includes unique or extremely rare circumstances of death recorded throughout the Renaissance period, noted as being unusual by multiple sources.\nFile:Epileptici en hun begeleiders op weg naar de brug bij Molenbeek Pelgrimage naar Molenbeek (serietitel), RP-P-1904-526.jpg|alt=|The dancing plague of 1518\nFile:Tournament between Henry II and Lorges.jpg|alt=|The tournament that led to the death of Henry II of France\nFile:Брагадино.jpg|alt=|The skinning of Marco Antonio Bragadin\nRenaissance\n{|class=\"wikitable\"\n|-\n!scope=\"col\"|Name of person\n!scope=\"col\"|Image\n!scope=\"col\"|Date of death\n!scope=\"col\"|Details\n|-\n!George Plantagenet, Duke of Clarence\n|\n|\n|The 1st Duke of Clarence was allegedly executed by drowning in a barrel of Malmsey wine, apparently his own choice once he accepted he was to be killed.\n|-\n!Charles VIII of France\n|\n|\n|The French king died as a result of striking his head on the lintel of a door while on his way to watch a game of real tennis.\n|-\n!Victims of the 1518 dancing plague\n|\n|\n|Several people died of either heart attacks, strokes or exhaustion during a dancing mania that occurred in Strasbourg, Alsace (Holy Roman Empire).\n|-\n!Robert Pakington\n|\n|\n|The 47-year-old merchant and MP was killed in London by a wheellock pistol, making his death the first political assassination performed by a firearm.\n|-\n!Pietro Aretino\n|\n|\n|The influential Italian author and libertine is said to have died of suffocation from laughing too much at an obscene joke during a meal in Venice. Another version states that he fell from a chair from too much laughter, fracturing his skull.\n|-\n!Henry II of France\n|\n|\n|On 30 June 1559, a tournament was held near Place des Vosges to celebrate the Peace of Cateau-Cambrésis with the French king's longtime enemies, the Habsburgs of Austria, and to celebrate the marriage of his daughter Elisabeth of Valois to King Philip II of Spain. During a jousting match, Henry, wearing the colors of his mistress Diane de Poitiers, was wounded in the eye by a fragment of the splintered lance of Gabriel Montgomery, captain of the King's Scottish Guard. Despite the efforts of royal surgeons Ambroise Paré and Andreas Vesalius, the court doctors ultimately \"advocated a wait-and-see strategy\"; as a result, the king's untreated eye and brain damage led to his death by sepsis ten days later. His death played a significant role in the decline of jousting as a sport, particularly in France.\n|-\n!Amy Robsart\n|\n|\n|The 28-year-old wife of Robert Dudley, Earl of Leicester was found dead by a staircase with two wounds on her head and a broken neck. Theories suggest she threw herself down the stairs.\n|-\n!Hans Staininger\n|\n|\n|The burgomaster of Braunau am Inn (then Bavaria, now Austria) died when he broke his neck by tripping over his own beard. The beard, which was  long at the time, was usually kept rolled up in a leather pouch.\n|-\n!James Stewart, Earl of Moray, Regent of Scotland\n|\n|23 January 1570\n|Hearing the rumours of a plot against him, Regent Moray was on his way out of Linlithgow, a haven of supporters of his half-sister Mary in a civil war. His planned route was blocked, and he was forced to ride through a narrow crowded street by the house of Archbishop John Hamilton, the baptist of Mary's son, infant King James VI. Archbishop's nephew James Hamilton shot Moray with a gun from an upstairs window covered with linen sheets, and escaped on a horse bypassing the crowded streets. James Stewart is considered to be the first head of government to be assassinated with a firearm.\n|-\n!Marco Antonio Bragadin\n|\n|\n|The Venetian Captain-General of Famagusta in Cyprus, was gruesomely killed after the Ottomans took over the city. This was in contravention of negotiated safe passage after the Ottoman Empire took Famagusta. He was dragged around the walls with sacks of earth and stone on his back; next, he was tied to a chair and hoisted to the yardarm of the Turkish flagship, where he was exposed to the taunts of the sailors. Finally, he was taken to his place of execution in the main square, tied naked to a column, and flayed alive. Bragadin's skin was stuffed with straw and sewn, reinvested with his military insignia, and exhibited riding an ox in a mocking procession along the streets of Famagusta. The macabre trophy was hoisted upon the masthead pennant of the personal galley of the Ottoman commander, Amir al-bahr Mustafa Pasha, to be taken to Constantinople as a gift for Sultan Selim II. Bragadin's skin was stolen in 1580 by a Venetian seaman and brought back to Venice, where it was received as a returning hero.\n|-\n!Victims of the Black Assize of Oxford 1577\n|\n|\n|In Oxford, England, at least 300 people, including Lord Chief Baron of the Exchequer Sir Robert Bell and Serjeant Nicholas Barham, died in the aftermath of the trial of Rowland Jenkes, a Catholic bookseller convicted of distributing pamphlets defaming Queen Elizabeth I, at the assize at Oxford. The dead reportedly included no women or children.\n|-\n!Mary, Queen of Scots\n|\n|\n|The 44-year-old queen of Scotland was told that she was to be executed for plotting the assassination of her cousin, Queen Elizabeth I. However, when the executioner, only known as Bull, prepared to chop off her head with an axe, the first blow did not kill Mary. It only hit her head. The second blow severed her neck, but the tendon was still left. The executioner later pulled off Mary's head only to reveal that her hair was a wig.\n|-\n!Andrew Perne\n|\n|\n|The Vice-Chancellor of Cambridge University and Dean of Ely was known for his frequent religious conversions to match the established faith of the time in England. He reportedly died due to having heard the jester of Queen Elizabeth I make a joke about his uncertain spiritual state, referring to him as \"one that is neither heaven nor earth, but hangs betwixt both\".\n|-\n!Tycho Brahe\n|\n|\n|The astronomer contracted a bladder or kidney ailment after attending a banquet in Prague and died eleven days later. According to Johannes Kepler's first-hand account, Brahe had refused to leave the banquet to relieve himself, because it would have been a breach of etiquette. After he had returned home, he was no longer able to urinate, except eventually in very small quantities and with excruciating pain. Though initially ascribed to a kidney stone, and later still to potential mercury poisoning, modern analyses indicate Brahe's death resulted from a fatal case of uremia caused by an inflamed prostate.\n|}\nReferences\nWorks cited\n*\n*\n*"
    }
  ]
}