{
  "content": [
    {
      "type": "text",
      "text": "# Listed buildings in Nottingham (Dale ward)\n\nDale ward is a former electoral ward in the city of Nottingham, England.  The ward contained twelve listed buildings that are recorded in the National Heritage List for England.  Of these, one is listed at Grade&nbsp;II*, the middle of the three grades, and the others are at Grade&nbsp;II, the lowest grade.  The ward contained the suburb of Sneinton and the area to the south around Colwick Hall.  The hall is a country house that is listed, together with an adjacent ruined church.  The other listed buildings are in Sneinton, and consist of a church, a war memorial in the churchyard and its former rectory, a public house, a windmill and the former windmill owner's house, a pair of houses with top floor workrooms, a level crossing cottage, a former Congregational church, and a former bank.\n__NOTOC__\nKey\n{| class=\"wikitable\n|-\n! Grade\n! Criteria\n|-\n|align=\"center\" |II*\n| Particularly important buildings of more than special interest\n|-\n|align=\"center\" |II\n| Buildings of national importance and special interest\n|}\nBuildings\n{| class=\"wikitable sortable plainrowheaders\" style=\"width:100%; border:0px; text-align:left; line-height:150%\"\n|-\n! scope=\"col\"  style=\"width:150px\" |Name and location\n! scope=\"col\"  style=\"width:100px\" class=\"unsortable\"|Photograph\n! scope=\"col\"  style=\"width:120px\" |Date\n! scope=\"col\"  style=\"width:650px\" class=\"unsortable\"|Notes\n! scope=\"col\"  style=\"width:50px\" |Grade\n|-\n|Ruins of Church of St John the Baptist, Colwick\n|\n|align=\"center\"|\n|The church has been altered and extended through the centuries, it was closed in1936, and is now a roofless ruin.  The church is built in stone, and consists of a nave, a chancel, a north chapel and a west tower.  The tower has two stages, angle buttresses, a plinth, string courses, a round-arched west window, round-arched bell openings, and an embattled parapet.\n|align=\"center\" |\n|-\n|Lord Nelson Public House\n|\n|align=\"center\"|\n|A farmhouse and outbuildings converted into a public house, it is in painted brick on a rendered plinth, with brick dressings, and roofs in pantile and slate.  There are two storeys and an L-shaped plan, with fronts of two and three bays.  The doorway has a moulded surround and a hood on brackets, and the windows include three-light casements.\n|align=\"center\" |\n|-\n|Colwick Hall\n|\n|align=\"center\"|\n|A country house that was remodelled in 1776 by John Carr, and later converted for other uses.  It is in red brick on a plinth, with stone dressings, quoins, an eaves cornice, pierced balustrades, and hipped slate roofs.   The central block has two storeys, a triple-pile plan, and eleven bays, and the flanking wings have a single storey and two bays.  The middle five bays of the north front main block are recessed, with a colonnade of Doric columns.  Most of the windows are sashes with moulded surrounds.  The south front has nine bays, Ionic corner pilasters, and a central three-bay Ionic portico, with a pediment containing a round window with Rococo leaf decoration.  The side wings have five bays, and contain round-headed windows divided by Doric pilasters.\n|align=\"center\" |\n|-\n|Green's Mill\n|\n|align=\"center\"|1807\n|The windmill was damaged by fire in 1947, and has since been restored as part of a museum.  It is a tapering round tower with five stages, and has an ogee wooden cap with a finial, a fantail and four sails.  The windmill contains doors in the lower two stages, a circular wooden gallery in the first stage, and casement windows in each stage.\n|align=\"center\" |\n|-\n|19 and 21 Belvoir Hill, Sneinton\n|\n|align=\"center\"|\n|A pair of houses with workshops above, in red brick, with dressings in brick and stone, and a slate roof.  There are three storeys and two bays.  In the ground floor are two doorways, the lower two floors contain sash windows, and all have rubbed brick segmental-arched heads.  The top floor has two five-light workers' casement windows.\n|align=\"center\" |\n|-\n|Green's Mill House\n|\n|align=\"center\"|1825\n|The house, the former residence of the owner of Green's Mill, is in brick with painted stone dressings and corrugated asbestos roofs.  There are two storeys and an L-shaped plan, with a front range of three bays.  In the centre is a doorway with a round-arched rubbed brick head and a fanlight, and the windows are sashes with wedge lintels and double keystones.  In the front is an inscribed slate plaque.\n|align=\"center\" |\n|-\n|St Stephen's Church, Sneinton\n|\n|align=\"center\"|1837–39\n|The tower and part of the south transept were designed by Rickman and Hussey, and the rest of the church was designed by C. G. Hare and built between 1910 and 1912.  The church is built in stone with tiled roofs, and has a cruciform plan, consisting of a nave with a clerestory, north and south aisles, north and south transepts, a chancel and vestry, and a tower at the crossing.  The tower has two stages, buttresses, a roundel on each side on the lower stage, two with clock faces, the bell openings have two lights, and at the top is a plain parapet.\n|align=\"center\" |\n|-\n|Sneinton Vicarage\n|\n|align=\"center\"|1843\n|The former vicarage is in brick on a plinth, with stone dressings, and a slate roof with coped gables and kneelers.  There are two storeys and attics and an L-shaped plan, with fronts of two and three bays, and a lower single-bay service wing.  In the centre of the entrance front is a doorway with a Tudor arched head and a mullioned fanlight.  On the south front is a square bay window, most of the other windows are sashes, and there are through-eaves gabled dormers.\n|align=\"center\" |\n|-\n|Crossing House Cottage\n|\n|align=\"center\"|\n|The cottage for the railway level crossing keeper, later a private house, is in sandstone on a plinth, with stone dressings, raised quoins, a chamfered eaves band, and a slate roof with stone coped gables and kneelers.  There are two storeys, a T-shaped plan and a single bay.  On the south and west fronts are cross-mullioned canted bay windows, and in the angle is a gabled porch.\n|align=\"center\" |\n|-\n|New Albion\n|\n|align=\"center\"|1856\n|Originally a Congregational church designed by Thomas Oliver and enlarged in 1904, it is in red brick and stone on a plinth, with a parapet containing balustrade panels, and a tile roof.  There are two storeys, an entrance front of three bays, and five bays on the sides.  The entrance front has an entablature and a pediment surmounted by a corniced pedestal.  The bays are divided by fluted Ionic pilasters, and in the centre is a tall round-arched recess containing a triple doorway, above which is a round-arched window with a keystone.  In each flanking bay and in the side bays are windows, with flat heads in the ground floor, and round-arched heads and keystones in the upper floor.\n|align=\"center\" |\n|-\n|Former National Westminster Bank\n|\n|align=\"center\"|\n|The former bank is on a corner site.  It is in red brick and stone on a grey granite plinth, the ground floor in rusticated stone, with quoins, a modillion cornice, and slate roofs.  There are three storeys and attics, fronts of two and five bays, with an angled bay on the corner under a modillion pediment.  Most of the windows are sashes.  In the corner bay is a round-arched granite doorway with columns, and a broken pediment with strapwork.  Above it is a canted oriel window with a broken pediment and a crest, and over that is a sash window with a double keystone.  In the ground floor are round-arched windows, the upper floors contain sash windows with flat heads, those in the middle floor with double keystones, and in the attic are box dormers.\n|align=\"center\" |\n|-\n|War memorial\n|\n|align=\"center\"|1920\n|The war memorial is in the churchyard of St Stephen's Church, Sneinton, and was designed by C. G. Hare.  It consists of a large wooden crucifix with a bronze figure, under a gable with inscribed bargeboards and a slate roof. This stands on a square ashlar pedestal with recessed panels, on a cruciform stone base of two steps with moulded edges. On the pedestal are bronze inscribed tablets.\n|align=\"center\" |\n|-\n|}\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}