{
  "content": [
    {
      "type": "text",
      "text": "# Listed buildings in Harrogate (Woodfield Ward)\n\nWoodfield is a ward in the town of Harrogate, North Yorkshire, England. It contains two listed buildings that are recorded in the National Heritage List for England. Of these, one is listed at Grade&nbsp;II*, the middle of the three grades, and the other is at Grade&nbsp;II, the lowest grade.  The ward is to the northeast of the centre of the town, and the listed buildings consist of a large house and its former stable block.\n__NOTOC__\nKey\n{| class=\"wikitable\n|-\n! Grade\n! Criteria\n|-\n|align=\"center\" |II*\n| Particularly important buildings of more than special interest\n|-\n|align=\"center\" |II\n| Buildings of national importance and special interest\n|}\nBuildings\n{| class=\"wikitable sortable plainrowheaders\" style=\"width:100%; border:0px; text-align:left; line-height:150%\"\n|-\n! scope=\"col\"  style=\"width:150px\" |Name and location\n! scope=\"col\"  style=\"width:100px\" class=\"unsortable\"|Photograph\n! scope=\"col\"  style=\"width:120px\" |Date\n! scope=\"col\"  style=\"width:650px\" class=\"unsortable\"|Notes\n! scope=\"col\"  style=\"width:50px\" |Grade\n|-\n|Grove House\n|\n|align=\"center\"|\n|Originally an inn, later extended as a private house, and subsequently used for other purposes, it is in gritstone, with quoins, cornices, a floor band, embattled parapets, and hipped slate roofs. There are three storeys, a main block of five bays, and flanking wings with two storeys and five bays. On the front is a porte-cochère with arched openings, an embattled parapet and heraldic lions. The windows are recessed sashes and in the west wing are splayed bay windows. Attached to the east wing is a four-storey tower with an embattled parapet and machicolations.\n|align=\"center\" |\n|-\n|Royal Stables\n|\n|align=\"center\"|\n|Originally the stables for Grove House, later converted into residential accommodation, it is in gritstone with tile roofs, and consists of four ranges around a courtyard.  At the entrance is a round arch with a rusticated surround, above which is a two-storey gabled tower. Over the lower storey is a parapet with gargoyles on the corners. The upper storey is timber framed, and flanked by chimneys.  On the top is a bell tower with a clock face on each side, and an open lead ogee roof. To the right is a two-storey range containing a wide arch., a recessed doorway and windows.\n|align=\"center\" |\n|-\n|}\nReferences\nCitations\nSources\n*\n*\n*"
    }
  ]
}