{
  "content": [
    {
      "type": "text",
      "text": "# List of NFL awards\n\nIn the National Football League (NFL), the highest level of professional American football in North America, there are a variety of awards presented to recognize players and teams for outstanding achievements. Each year on the night before the Super Bowl, the NFL Honors ceremony is held to present many of the league's most prestigious awards. In addition to these awards, there are many other organizations that present their own awards after each NFL season, often accompanied by a banquet and other festivities. Because of this, there is a much wider range of awards recognized in football compared to that of other major North American sports.\nTeam awards\nVince Lombardi Trophy\nThe Vince Lombardi Trophy is awarded to the winning team of each season's Super Bowl, the NFL's championship game. The original trophy, designed by jewelry retailer Tiffany & Co., was awarded in 1967 to the winner of the first AFL-NFL World Championship Game, known retroactively as Super Bowl I. It was named in 1970 in honor of longtime Green Bay Packers head coach, Vince Lombardi.\nGeorge Halas Trophy\nThe George Halas Trophy is awarded each season to the National Football Conference (NFC) champion, i.e., the winner of that season's NFC Championship Game. It is named after the founder, owner, and longtime head coach of the Chicago Bears, George Halas.\nLamar Hunt Trophy\nThe Lamar Hunt Trophy is awarded each season to the American Football Conference (AFC) champion, i.e., the winner of that season's AFC Championship Game. It is named in honor of Lamar Hunt, the founder of the Kansas City Chiefs.\nBrunswick-Balke-Collender Cup\nThe Brunswick-Balke-Collender Cup was awarded only once—in 1920 to the Akron Pros after winning that season's APFA championship. The trophy was lost soon after, and its whereabouts are unknown.\nEd Thorp Memorial Trophy\nThe Ed Thorp Memorial Trophy was awarded to the champions of the NFL from 1934 (the second scheduled NFL championship game) through 1969, the final NFL championship Game prior to the AFL–NFL merger. It was named in honor of longtime NFL referee, Ed Thorp, who died in 1934. The trophy was deemed lost for decades; it was believed the Minnesota Vikings, who were the last to win the trophy, somehow lost it when the league switched over to the Lombardi Trophy the following year. However, in 2015, the trophy was found to be in the possession of the Green Bay Packers Hall of Fame, along with two replicas.\nIndividual awards\nMost Valuable Player\nA most valuable player (MVP) award is handed out each year to the player adjudged to be the most valuable in the NFL that season. While the Associated Press MVP award is the most widely recognized today, many selectors have chosen MVPs over the years, including the Newspaper Enterprise Association, United Press International, and Pro Football Writers Association. The first award to recognize the NFL's \"most valuable player\" was the Joe F. Carr Trophy, first given in 1938. Named in honor of NFL commissioner Joseph Carr, it was awarded until 1946, and remains the only MVP award officially sanctioned by the NFL until. The AP MVP award has been presented annually at the NFL Honors since 2012.\nOffensive Player of the Year\nThe NFL Offensive Player of the Year Award is an annual award given by various organizations to the player who is considered the top offensive player during the regular season. Organizations which issue the award include AP, PFWA, and Sporting News. The AP's award is recognized at the annual NFL Honors ceremony.\nDefensive Player of the Year\nA Defensive Player of the Year has been recognized annually by various selectors. Awards include the Associated Press NFL Defensive Player of the Year Award (since 1971), Pro Football Writers Association NFL Defensive Player of the Year (since 1969), and Newspaper Enterprise Association Defensive Player of the Year Award (1966–1997). The Associated Press award has been presented annually at the NFL Honors since 2012.\nRookie of the Year\nSeveral organizations have given an award to honor each season's top rookie, usually on both offense and defense. United Press International gave an NFL rookie of the year award from 1955 to 1969, and from 1970 to 1996 honored the top rookies in both the NFC and AFC. From 1964 to 1996, the Newspaper Enterprise Association gave the Bert Bell Memorial Trophy to the NFL's most outstanding rookie. The Associated Press has given an offensive rookie of the year award since 1957 and a defensive rookie of the year award since 1967. Pepsi began awarding an overall rookie of the year in 2002. Since 2011, the AP and Pepsi awards have been presented at the NFL Honors.\nComeback Player of the Year\nSeveral organizations give an award for the comeback player of the year in the NFL, honoring a player who showed significant improvement or overcame an injury from  previous season. The AP award has been presented annually at the NFL Honors since 2012.\nSuper Bowl MVP\nThe Super Bowl Most Valuable Player Award is presented annually to the MVP of the Super Bowl. The winner is chosen by a fan vote during the game and by a panel of 16 football writers and broadcasters who vote after the game. The media panel's ballots count for 80&nbsp;percent of the vote tally, while the viewers' ballots make up the other 20&nbsp;percent. The Super Bowl MVP has been awarded annually since the game's inception in 1967. Through 1989, the award was presented by SPORT magazine. Since 1990, the award has been presented by the NFL. At Super Bowl XXV, the league first awarded the Pete Rozelle Trophy, named after the former NFL commissioner, to the Super Bowl MVP. Most award winners have received cars from various sponsors.\nCoach of the Year\nSeveral organizations give a coach of the year award to the head coach adjudged to have had the most outstanding season. The Associated Press has also handed out an Assistant Coach of the Year Award since 2014.\nExecutive of the Year\nThis award, which is handed out by the Sporting News, is awarded to an NFL executive adjudged to have had the best season building a roster by way of drafting, free agency, and/or trades. It was first awarded by the Sporting News in 1955 and was discontinued until being revived in 1972.\nPro Bowl\nThe Pro Bowl is the all-star game of the NFL. The first Pro Bowl was held in 1951 to recognize the league's outstanding performers of the 1950 season. Prior to that, the NFL held an All-Star Game for the 1938 through 1942 seasons.\nAll-Pro Team\nVarious media selectors compile an All-Pro team after each season, an honorary team of the best players at each position. There has been at least one selector of an All-Pro team every season since the NFL began play in 1920. Today, the teams by the Associated Press, Pro Football Writers Association, and Sporting News are designated in the NFL Players Association's collective bargaining agreement for purposes of player incentives, and are thus the most widely recognized teams.\nAll-Rookie Team\nThe Pro Football Writers Association honors the top rookies at each position after each season by naming them to its All-Rookie Team.\nButkus Award\nThe Butkus Award, instituted in 1985 by the Downtown Athletic Club of Orlando, is given annually to the top linebackers at the high school, collegiate and professional levels of football. The award, named in honor of College Football Hall of Fame and Pro Football Hall of Fame linebacker Dick Butkus, is presented by the Butkus Foundation, a non-profit organization that supports a number of health and wellness activities including the \"I Play Clean\" anti-steroid program. The award was first established by the Downtown Athletic Club of Orlando, which relinquished control of the award in 2008 following a lawsuit by Butkus.\nTraditionally, the award was given only to the top collegiate linebacker. The Butkus Award was expanded in 2008 to include high school and professional winners as part of a makeover by the Butkus family to help end anabolic steroid abuse among young athletes.\nDeacon Jones Award\nIn 2013, the NFL created the Deacon Jones Award to recognize the season leader in sacks. The award is to honor Deacon Jones who, prior to sacks becoming an official statistic (pre 1982), is unofficially credited as having led the league in sacks 5 times.  Jones is also credited with coining the term quarterback sack.\nPhilanthropy and sportsmanship awards\nWalter Payton NFL Man of the Year\nThe Walter Payton Man of the Year Award is presented annually to a player in recognition of his charity work as well as excellence on the field. It was originally the \"NFL Man of the Year Award\" before being renamed in 1999 to honor recently deceased Chicago Bears great Walter Payton, himself the 1977 recipient. The award has been split between two players on three occasions, most recently in 2016, when Eli Manning and Larry Fitzgerald were named co-recipients.\nNFLPA Alan Page Community Award\nThe NFLPA Alan Page Community Award is given annually by the NFL Players Association to honor a player's service to his team, community, and country. The award, previously named in honor of Byron \"Whizzer\" White, who after his NFL career became a U.S. Supreme Court justice,  was renamed in the fall of 2018 in honor of Alan Page. Alan Page has been a stalwart for the players union since his early days as an executive committee member as well as a pioneer for social justice during his distinguished 23-year tenure on the Minnesota Supreme Court.\nBart Starr Award\nThe Athletes in Action/Bart Starr Award is given annually to an American football player in the National Football League (NFL) who \"best exemplifies outstanding character and leadership in the home, on the field, and in the community\". The award is presented by Athletes in Action (AIA), a sports ministry associated with Cru (formerly known as Campus Crusade for Christ). It is awarded to the winner each year at the Super Bowl Breakfast, an NFL-sanctioned event that occurs the day before the Super Bowl. The nominee list is compiled by a group of individuals made-up of the Public Relations Directors of every NFL team, past award winners and AIA staff. The list is trimmed to 10 players, with the award winner chosen by AIA leadership and past award winners. However, some past awardees have been chosen by fellow NFL players after the initial list is trimmed down to 10.\nArt Rooney Award\nThe Art Rooney Award, established in 2015, is given to a player in recognition of his outstanding sportsmanship. The winner is determined by a vote of NFL players. It is named in honor of Art Rooney, the founding owner of the Pittsburgh Steelers franchise.\nAwards organizations\nAssociated Press\nKansas City Committee of 101\nMaxwell Football Club\nNational Football League Alumni\nWashington D.C. Touchdown Club\nReferences\n;General\n*\n;Footnotes\nExternal links\n* [https://www.pro-football-reference.com/awards/ NFL, AFL, and AAFC Awards and Honors Index] – Pro-Football-Reference.com"
    }
  ]
}