{
  "content": [
    {
      "type": "text",
      "text": "# List of monuments in Nakhchivan__disambig_1\n\nNakhchivan is an Autonomous Republic within the territory of Azerbaijan Republic. There are historical monuments, mausoleums, museums on the territory of Nakhchivan, many of which have become historical monuments.\nChalcolithic monuments\nI Kultapa, Ovchular Tepesi, Sadarak, Khalac, Ərəbyеngicə and other monuments have been found during this period. More than 20 Chalcolithic monuments have been discovered during an archaeological expedition in the Sirab village of Babak region.\nDuzdagh field\nThe length of the Duzdagh (:de:Duzdağ) salt field is 3&nbsp;km, width is 2&nbsp;km, and the thickness is 150 m. According to short-term studies of the French-Azerbaijani expedition in 2007, the discovery of Eneolithic and Kur-Araz ceramics from the southern slopes of the deposit was supposed to start early in the operation of the mine. In order to obtain more comprehensive information, systematic investigations were launched in 2008.\n6th-15th Centuries Monuments\n{| class=\"wikitable\"\n!Name\n!Picture\n!Date\n!Note\n|-\n|Gamigaya Petroglyphs\n|\n|4th century\n| Gamigaya rock carvings (Azerbaijani: Gəmiqaya petroqlifləri) - are dated to the 4th-1st millennia BC including the Bronze and Early Iron Ages in the territory of Ordubad Rayon.\n|-\n|Saint Thomas Monastery of Agulis\n|\n|4th century\n| Destroyed in the second half of the 20th century\n|-\n|Alinja Tower\n|\n|7th-9th centuries\n|On February 11, 2014, Vasif Talibov signed an order on \"Restoration of the historical monument\" Alinja Tower. Facts related to the silver and copper coins of VII century as well as the architectural style of Fortress were discovered following the signing of this order.\n|-\n|Kohnagala\n|\n|7th century\n|\n|-\n|Saint Karapet Monastery of Aprakunis\n|\n|8th-9th centuries\n|Destroyed in 2004.\n|-\n|Armenian cemetery in Julfa\n|\n|9th century-1605\n|Destroyed between 1998 and 2005.\n|-\n|Holy Saviour Monastery of Julfa\n|\n|9th century\n|Destroyed\n|-\n|Noah’s Mausoleum (Nakhchivan, Azerbaijan)\n|\n|8th century\n|The mausoleum was reconstructed in 2006.\n|-\n|Yusif ibn Kuseyir Mausoleum\n|\n|1161–1162\n|Yusif ibn Kuseyir Mausoleum is one of the examples of Architectural school of Nakhchivan. The mausoleum consists of underground and surface parts and has been constructed in the octagonal form on both sides.\n|-\n|Momine Khatun Mausoleum\n|\n|12th century\n|The Momine Khatun Mausoleum was established by the architect Ajami Nakhchivani. It is located in the city of Nakhchivan.\n|-\n|Atabey mosque\n|\n|12th century\n|The architectural monument demolished in the 20th century is documented in images and photos from the 19th century.\n|-\n|Garabaghlar Mausoleum\n|\n|12th–14th centuries\n|The Garabaghlar Mausoleum is located in Kangarli district, Garabaghlar village. The Order of the Chairman of the Supreme Assembly of the Autonomous Republic on the restoration and investigation of the Garabagh Tomb Complex came into force on July 4, 2016.\n|-\n|Gilan Mausoleum\n|\n|13th century\n|There are several tombs in the Gilan city, Ordubad. One of them was found in 1979. The upper part of tomb was damaged.\n|-\n|Gulustan Mausoleum\n|\n|13th century\n|The Gulustan Tomb, one of the examples of the 13th century Azerbaijani architecture, is located near the city of Julfa. Unlike other monuments, the Gulustan Tomb was built of stone.\n|-\n|Khanegah tomb\n|\n|13th-15th centuries\n|The Naimi tomb, a mosque, the ruins of the unknown monument and other buildings have survived from historical architectural complex dating to the Middle Ages, located in the Khanegah village of Julfa region.\n|-\n|Dar tomb\n|\n|1487–1488 centuries\n|\n|}\n16th-18th Centuries Monuments\n{| class=\"wikitable\"\n! Name\n! Picture\n! Date\n! Note\n|-\n|Geysariyye Monument\n|\n|XVII century\n|Geysariyye Monument, one of the 17th century monuments located in the center of Ordubad. During the Soviet era, one part of the building was used as a warehouse, and the other side as a dining-room. The monument was reconstructed in 1978 by the architect of the Ordubad Zakir Babayev. The building has been operating since 1981 as Ordubad District Historical-Ethnography Museum.\n|-\n|Juma Mosque, Ordubad\n|\n|1604\n|Juma Mosque was built in the highest part of the city.\n|-\n|Imamzadeh complex in Nakhchivan\n|\n|1722-1732\n|\n|-\n|Juma mosque of Nakhchivan\n|\n|18th century\n|\n|-\n|Palace of Nakhchivan Khans\n|\n|18th century\n|\n|}\n19th Century Monuments\n{| class=\"wikitable\"\n!Name\n!Established\n|-\n|Nakhchivan State Museum of History\n|1924\n|-\n|House-Museum of Jalil Mammadguluzadeh (Nakhchivan)\n|December 31, 1998\n|-\n|Mausoleum of Huseyn Javid\n|1996\n|}\nReferences"
    }
  ]
}