{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in Cambodia__disambig_1\n\n}}\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) designates World Heritage Sites of outstanding universal value to cultural or natural heritage which have been nominated by signatories to the 1972 UNESCO World Heritage Convention. Cultural heritage consists of monuments (such as architectural works, monumental sculptures, or inscriptions), groups of buildings, and sites (including archaeological sites). Natural heritage consists of natural features (physical and biological formations), geological and physiographical formations (including habitats of threatened species of animals and plants), and natural sites which are important from the point of view of science, conservation, or natural beauty. Cambodia ratified the convention on 28 November 1991.\nCambodia has five sites on the list. Angkor was listed in 1992 when the country was briefly governed by the United Nations mission after the Cambodian–Vietnamese War, in line with the 1991 Paris Peace Agreements. The site was immediately placed on the List of World Heritage in Danger in order to quickly and efficiently deal with urgent problems of conservation. In 2004, Angkor was removed from the endangered list. The temple Preah Vihear was listed in 2008, the Sambor Prei Kuk temple complex in 2018, the Koh Ker in 2023, and the Cambodian Memorial Sites in 2025. All five sites are cultural. In addition, Cambodia has six sites on its tentative list.\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural, and vii through x are natural.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (province)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" data-sort-type=\"number\"|\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" | Angkor\n|\n| Siem Reap\n| 1992\n| 668; i, ii, iii, iv (cultural)\n| The Angkor area, one of the largest archaeological areas in the world, was the site of different capitals of the Khmer Empire from the 9th to the 15th century. The temples of Angkor Wat (pictured), Angkor Thom, Bayon, and the nearby Banteay Srei and the temples of Roluos depict different periods of Khmer architecture and are richly decorated with sculptures and stone carvings. Khmer art had an important influence on the wider region. Upon inscription, the site was listed as endangered to ensure conservation; it was removed from that list in 2004.\n|-\n! scope=\"row\" | Temple of Preah Vihear\n|\n| Preah Vihear\n| 2008\n| 1224: i (cultural)\n| The temple, dating to the first half of the 11th century, is a masterpiece of Khmer architecture. The temple complex, which comprises several sanctuaries and staircases along an  axis, is dedicated to Shiva and is richly decorated with stone carvings. It is located on the edge of a mountain plateau overlooking the plains, and, mainly due to its remote location, is well preserved.\n|-\n! scope=\"row\" | Temple Zone of Sambor Prei Kuk, Archaeological Site of Ancient Ishanapura\n|\n| Kampong Thom\n| 2017\n| 1532; ii, iii, vi (cultural)\n| Ishanapura was the capital of the Chenla Empire in the late 6th and early 7th centuries CE. The archaeological area comprises 186 sandstone temples in a unique architectural style (the Sambor Prei Kuk style) from which the Angkorian style gradually developed. The style of the temples comes from Hindu tradition with influences from Buddhism and animism. Temple inscriptions in Sanskrit and Old Khmer mention the God-King, a concept that was fundamental to the government system that existed in Cambodia and Thailand until the 20th century.\n|-\n! scope=\"row\" |Koh Ker: Archeological Site of Ancient Lingapura or Chork Gargyar\n|\n| Preah Vihear\n| 2023\n| 1667; ii, iv (cultural)\n| Koh Ker was the capital of the Khmer Empire under King Jayavarman IV in the first half of the 10th century. Now in ruins and difficult to access, the remains of the city contain Hindu temples, shrines, monuments, and water management systems.\n|-\n! scope=\"row\" |  Cambodian Memorial Sites: From centres of repression to places of peace and reflection\n|\n| Phnom Penh, Kampong Chhnang, Kampong Speu\n| 2025\n| 1748; vi (cultural)\n| The Cambodian Memorial Sites consist of three component parts which portray the abuses of human rights by the Khmer Rouge regime between 1971 and 1979. In April 1975, the Khmer Rouge occupied the capital and rapidly established a nation-wide security system to repress opposition and impose a new social order on the Cambodian people. This was a system of immense violence, torture and execution that impacted the lives of every Cambodian. The serial property of three sites demonstrates this widespread experience. The former M-13 prison site is associated with the initial phase of the repression and violence; and the two other sites are the former S-21 interrogation prison (Tuol Sleng Genocide Museum) and its associated execution site (Choeung Ek Genocidal Center).\n|}\nTentative list\nIn addition to sites inscribed on the World Heritage List, member states can maintain a list of tentative sites that they may consider for nomination. Nominations for the World Heritage List are only accepted if the site was previously listed on the tentative list. Cambodia lists six properties on its tentative list.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (province)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" | UNESCO criteria\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" | The site of Angkor Borei and Phnom Da\n|\n| Takéo\n| 2020\n| i, ii, iv (cultural)\n| Angkor Borei was a capital of Funan, an early Khmer political entity that lasted until the late 6th century CE. Brick buildings, city walls, and several canals have been preserved, as well as some of the earliest Khmer inscriptions. Phnom Da (pictured) is a nearby mount with remains of two temples and several caves with shrines. The two sites represent the early Khmer art styles that developed under influence from India, fusing elements of Hinduism and Buddhism, and were also influenced by the Greco-Buddhist art.\n|-\n! scope=\"row\" | The Archeological Complex of Banteay Chhmar\n|\n| Banteay Meanchey\n| 2020\n| ii, iii, iv (cultural)\n| The temple complex of Banteay Chhmar dates to the 12th and 13th century and was built in the Bayon style. It is decorated with stone carvings depicting scenes from Hindu mythology and scenes from the war between Khmer and Chams. An important feature of the complex is a large artificial water reservoir, a baray, with an island in the middle.\n|-\n! scope=\"row\" | Beng Mealea Temple\n|\n| Siem Reap\n| 2020\n| ii, iv (cultural)\n| The temple was constructed in the 12th century, in the Angkor period, during the reign of king Suryavarman II. The large complex is now mostly in ruins and renovations have not yet begun. Due to its location on an intersection of important trade routes, it was a regional commercial centre. The remains of some water management structures have been preserved.\n|-\n! scope=\"row\" | Ancient City of Oudong\n|\n| Kandal\n| 2020\n| ii, iv (cultural)\n| Oudong was the capital of the post-Angkorian period, from the 17th to the 19th century. The city was involved in trade with countries of Southeast Asia and also with Europe. It had enclaves to house foreigners, including Chinese, Cham, Japanese, Portuguese, Spanish, Dutch, and English. The mountain above the town (pictured) houses stupas of the Royal family.\n|-\n! scope=\"row\" | Phnom Kulen: Archeological Site/ Ancient Site of Mahendraparvata\n|\n| Siem Reap\n| 2020\n| ii, iv, v (cultural)\n| Phnom Kulen is a mountain range with a strong symbolic significance for the Khmer people. It includes the city of Mahendraparvata, where king Jayavarman II declared independence from Java in 802. The architecture of the city marks the transition form pre-Angkorian to Angkorian period, with several temples and monuments partially preserved. It was one of the first cities in Cambodia to use a grid plan. Some monuments in the area also date to the post-Angkorian period.\n|-\n! scope=\"row\" | The ancient complex of Preah Khan Kompong Svay\n|\n| Preah Vihear\n| 2020\n| ii (cultural)\n| Preah Khan Kompong Svay was a large provincial city and a religious complex of the Angkorian period. It was mostly constructed between the 11th and early 13th century. The temple is decorated with Buddhist motifs. The city had an important iron industry, due to nearby iron resources.\n|}\nSee also\n*Tourism in Cambodia\n*Khmer Culture\n*List of Protected Areas in Cambodia\n*UNESCO Intangible Cultural Heritage List in Cambodia\nReferences"
    }
  ]
}