{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in Uganda__disambig_1\n\n|caption=Location of World Heritage Sites in Uganda|float=right|width=200}}\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) World Heritage Sites are places of importance to cultural or natural heritage as described in the UNESCO World Heritage Convention, established in 1972. Cultural heritage consists of monuments (such as architectural works, monumental sculptures, or inscriptions), groups of buildings, and sites (including archaeological sites). Natural features (consisting of physical and biological formations), geological and physiographical formations (including habitats of threatened species of animals and plants), and natural sites which are important from the point of view of science, conservation, or natural beauty are defined as natural heritage. Uganda accepted the convention on 20 November, 1987, making its historical sites eligible for inclusion on the list.\nUganda has three World Heritage Sites and a further eight sites on its tentative list. The first two sites were listed in 1994, both for their natural significance. The most recent site, the Tombs of Buganda Kings at Kasubi, was listed in 2001 due to cultural significance. Rwenzori Mountains National Park was listed as endangered from 1999 to 2004 because of security issues and lack of monitoring by the park staff. The Kasubi Tombs were listed as endangered in 2010 because of a fire that destroyed several buildings and removed from the endangered list in 2023 following a careful reconstruction.\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural, and vii through x are natural.\n{|class=\"wikitable sortable plainrowheaders\"\n|+\n|-\n! style=\"width:100px;\" scope=\"col\"| Site\n! class=\"unsortable\"  style=\"width:150px;\" scope=\"col\"| Image\n! style=\"width:80px;\" scope=\"col\"| Location (region)\n! style=\"width:50px;\" scope=\"col\"| Year listed\n! style=\"width:60px;\" scope=\"col\" data-sort-type=\"number\"|\n! scope=\"col\" class=\"unsortable\" | Description\n|-\n! scope=\"row\" |Bwindi Impenetrable National Park\n|\n| Kanungu\n| 1994\n| 682; vii, x (natural)\n| The park is located in the Albertine Rift, at the intersection of three ecological zones and likely acted as a Pleistocene refugium. The area, covered by Albertine Rift montane forests, is a biodiversity hotspot, with over 100 species of ferns, over 200 species of montane forest butterflies, and 347 species of forest birds. It is also home to a significant population of the endangered mountain gorilla.\n|-\n! scope=\"row\" |Rwenzori Mountains National Park\n|\n| Kasese\n| 1994\n| 684; vii, x (natural)\n| The park is located in the Rwenzori Mountains, the legendary Mountains of the Moon. The mountains, with the highest peak Mount Stanley (Africa's third highest mountain) reaching an altitude of , have glaciers, rivers, and waterfalls. High humidity, constant temperatures, and geographical isolation have contributed to evolution of the richest montane flora in Africa. There are five Afromontane vegetation belts on the mountain slopes, with plants such as giant lobelias and giant heathers. Animals in the park include African forest elephant, eastern chimpanzee, L'Hoest's monkey, and black-fronted duiker. The site was listed as endangered from 1999 to 2004 because of security issues and lack of monitoring by the park staff.\n|-\n! scope=\"row\" |Tombs of Buganda Kings at Kasubi\n|\n| Kampala\n| 2001\n| 1022; i, iii, iv, vi (cultural)\n| The tombs of the kings, or kabakas, of the Buganda kingdom, founded in the 13th century, are located on the hillside in Kampala. They are an important spiritual site of the Baganda. The main building was built in 1882 as a palace and converted into a tomb in 1884. At the time of inscription, there were four tombs in the complex, made of wood, reeds, and with thatched roofs. The tombs were destroyed in a 2010 fire and the site was consequently listed as endangered. Following careful restoration and reconstruction, the site was removed from the endangered list in 2023.\n|}\nTentative list\nIn addition to sites inscribed on the World Heritage List, member states can maintain a list of tentative sites that they may consider for nomination. Nominations for the World Heritage List are only accepted if the site was previously listed on the tentative list. Uganda maintains eight properties on its tentative list.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (region)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" | UNESCO criteria\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" | Bigo bya Mugenyi (Archaeological Earthworks)\n|\n| Sembabule\n| 1997\n| i, ii, iii, vi (cultural)\n| This nomination comprises a series of earthworks along the Katonga River that were created between the 14th and 16th centuries, according to oral tradition by the short-lived Bacwezi dynasty. There are two systems of trenches with four enclosures.\n|-\n! scope=\"row\" | Ntusi (man-made mounds and Basin)\n|\n| Sembabule\n| 1997\n| i, iii, iv, vi (cultural)\n| Ntusi is a Late Iron Age archaeological site. There are two man-made mounds where archaeologists have uncovered bones and pottery fragments. The site is likely related to the nearby archaeological site of Bigo bya Mugenyi.\n|-\n! scope=\"row\" | Nyero and other hunter-gatherer geometric rock art sites in eastern Uganda\n|\n| Kumi\n| 1997\n| i, iii, vi (cultural)\n| This nomination comprises three rock shelters with rock paintings. They date to the Late Iron Age.\n|-\n! scope=\"row\" | Mgahinga Gorilla National Park\n|\n| Kisoro\n| 2007\n| vii, viii, ix, x (natural)\n| The park is located in the Virunga Mountains and is contiguous with Volcanoes National Park in Rwanda and Virunga National Park in the Democratic Republic of the Congo. It has three volcanoes, including Mount Muhabura (). The park is covered by Afromontane forest, although only small portions of primary forest remain. It is home to the mountain gorilla (pictured), golden monkey, blue monkey, black-fronted duiker, and African elephant.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\" | Mt. Elgon Transboundary Ecosystem (Uganda)\n|\n| Eastern\n| 2024\n| ix, x (natural)\n| Mount Elgon (satellite image pictured), an extinct stratovolcano, is located on the border with Kenya. It is the oldest volcano in East Africa, having first erupted 24 million years ago and reaching a height well above Kilimanjaro but later eroded to an elevation of . The mountain supports a diverse animal and plant life on its slopes, with savanna at the base and Afromontane communities at higher elevations. It is also an important water catchment area. Birds species Elgon francolin and Sharpe's longclaw live in the grasslands and forests.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\" | Geometric rock art in Lake Victoria Region of Kenya, Tanzania, and Uganda (Uganda)\n|\n| Eastern\n| 2024\n| iii, vi (cultural)\n| This nomination comprises twelve sites with rock art in three countries around Lake Victoria, six of which are in Uganda. Red finger-painted geometric motifs, such as concentric circles and lozenges, were created by the pygmy hunter-gatherers that do not inhabit the area anymore. The oldest paintings have been dated to be more than 4,000 years old. The images maintain spiritual significance for the people who live in the region.\n|-\n! scope=\"row\" | Kibiro Salt Producing Village\n|\n| Hoima\n| 2025\n| i, iii, iv, vi (cultural)\n| The economy of the Kibiro village, located on the shore of Lake Albert, is centred on salt production, as the land is not appropriate for agriculture. In a process which is an exclusively female occupation salt is extracted from salty soil on salt gardens (pictured) and the brine is then boiled to produce salt. Villagers then exchange salt for fish and produce with other villages.\n|-\n! scope=\"row\" | Palabek Cultural Landscapes\n|\n| Lamwo\n| 2025\n| iii, v (cultural)\n| The characteristic feature of the cultural landscape of Palabek are dry stone enclosures around villages. They were constructed between the 17th and 20th centuries but the construction method has since disappeared and is no longer being practiced. The stone walls have window-like openings in them, likely to fire guns in defense of the settlement. The structures have survived numerous conflicts, including the Lokung massacre and the Lord's Resistance Army insurgency.\n|}\nReferences"
    }
  ]
}