{
  "content": [
    {
      "type": "text",
      "text": "# List of civilian casualties in the war in Afghanistan (2007)__disambig_1\n\nList of civilian casualties in the war in Afghanistan in 2007\n* January 12, 2007 – Afghan police claim 13 civilians killed in a NATO airstrike in the Garmser district of Helmand Province. NATO claims \"no evidence of any civilian casualties\".\n* January 24, 2007 – NATO troops fired at a vehicle which failed to stop in the Gereshk district of Helmand province. The bullets killed a passerby.\n* February 17, 2007 – An unarmed man acting in a suspicious manner was shot and killed by Canadian troops near the village of Senjaray, 12&nbsp;km west of Kandahar.\n* February 17, 2007 – NATO troops shot and killed a civilian who was running through convoy near Kandahar.\n* February 18, 2007 – Canadian troops mistakenly gunned down an Afghan National Police officer and a homeless beggar after their convoy was ambushed in Kandahar City late Sunday.\n* February 27, 2007 – Canadian troops opened fire at a Toyota car that failed to stop at a security cordon around a broken down Canadian vehicle in the Kandahar area. One occupant was killed and the other was wounded. No weapons or bombs were found.\n* March 4, 2007 – Approximately 16 civilians were killed and dozens were wounded by US marine gunfire on the road between Jalalabad and Pakistan after a bomb blast directed the marine convoy in what has become known as the Shinwar shooting. In a March 14, 2007 article, the Afghan human rights commission alleged Marines put the number of victims at 12 people—including a 4-year-old girl, a 1-year-old boy and three elderly villagers and stated the Marines used excessive force, as they shot at people as they fled the scene of the bomb, even miles from the incident location. This report on killings of civilians in the Nangarhar Province is consistent with U.S. findings. The Marine commander and NCO were shipped back to the United States after this incident. Reports of killing of children and indiscriminate firing by the Marines were found to be untrue and all that were killed were found to be insurgents attacking the convoy.\n* March 5, 2007 – Nine civilians, including five women and two to three children were killed when their home was destroyed by two  bombs in the Nijrab district, in the Kapisa province, north of Kabul. The troops were responding to an attack that hit a NATO provincial reconstruction team.\n* March 16, 2007 – Five Afghan policemen were killed by US troops at a checkpoint in a village near Gereshk, in Helmand Province. In later reports, the US denied its troops had been involved in the killings.\n* April 29, 2007 – A number of Afghan civilians in Zerkoh Valley were killed in airstrikes conducted in support of US Special Operations Forces.  Estimates of the dead vary, with the Afghan government claiming 42 killed, with no sign of Taliban forces. Initial Coalition media reports stated that 87 Taliban were killed with no reports of civilian casualties.  Human Rights Watch reported the civilian dead as at least 25.\n* April 29, 2007 – Six people including a woman and a teenage girl were killed by US and Afghan forces as they raided a suspected \"car bomb cell\" in the Bati Kot area of Nangarhar province, very close to the location of the March 4th 2007. Another woman and another teenage girl were wounded in this incident.\n* May 1, 2007 – About 50 civilians, including women and children were killed by US and NATO bombings in Herat province of western Afghanistan during the preceding week.\n* May 9, 2007 – Between 21 and 38 civilians, including women and children were killed by a US Air Raid in the village of Soro, in the Sangin district of Helmand Province. Five homes were bombed after US Special Forces came under attack, an attack which cost the life of one US serviceman.\n* May 31, 2007 – At least 15 civilians were killed by NATO forces in the Kajaki district of Helmand Province.\n* June 11, 2007 – Three civilians were killed by NATO-led troops in the Kunar Province as they approached a checkpoint in a vehicle.\n* June 18, 2007 – Seven children were killed in a US Air Strike directed at a compound in Zarghun Shah, in the Paktika province. Initially the US claimed they did not know that children were in the compounds but some U.S. officials confirmed that U.S. forces were indeed aware of the children's presence but military officials told NBC News that Abu Laith al Libi, an al-Qaida leader, was considered such a high-value target it was worth the risk that some children might become casualties of the attack.\n* June 19, 2007 – 10 civilians were killed in a US missile strike inside Pakistan.\n* June 22, 2007 – About 25 civilians including 9 women and 3 children were killed in an air strike in the village of De Adam Khan, near the town of Gereshk in Helmand Province.\n* June 24, 2007 – Two men on motorcycles were shot as they approached the site of an IED explosion against a British vehicle in which a British soldier was killed. This incident occurred near Lashkar Gahin, in Helmand Province. One of the two motorcyclists died, the other was wounded.\n* June 29, 2007 – Four civilian men were killed in a house by US troops who were looking for insurgents. An 85-year-old man, Mohammada Jan, two of his sons and a grandson had been killed by troops who first blew up the gate of house in the village of Nokrukhel in Sherzad district of Nangarhar province.\n* June 29, 2007 – Between 50 and 80 civilians were killed by US airstrikes on the village of Hyderabad, in the Province of Hellmand in southern Afghanistan.\n* July 7, 2007 – Villagers from Watapour in the Province of Kunar claim that about 35 civilians were killed by NATO airstrikes, 10 on July 5 and another 25 on the 7th when the funeral for the 10 was bombed.\n* August 2, 2007 – Many people, possibly in the hundreds, were reported wounded and killed by NATO airstrikes in the Baghran district of the Province of Helmand.\n* August 16, 2007 – Eight civilians including a pregnant woman and a baby died when Polish soldiers shelled the village of Nangar Khel where a wedding celebration was taking place. Seven Polish soldiers have been charged with war crimes for allegedly opened fire in revenge.\n* September 19, 2007 – One Afghan civilian was killed and several others wounded in a traffic collision with a Canadian convoy.\n* September 19, 2007 – Six civilians, women and children were killed by an airstrike in Helmand province.\n* September 23, 2007 – A US helicopter accidentally killed two policemen and three security guards during an anti-Taliban operation in Kunar Province. Eight more were injured.\n* October 2, 2007 – A man on a motorcycle was killed, and a child riding behind him was wounded by Canadian troops in Kandahar.\n* October 23, 2007 – A child was found dead in a tent and four others found wounded after Coalition forces fired on the tent from which they claimed they had received gunfire.\n* November 6, 2007 – A son of an Afghan Army general was killed by \"warning shots\" from British troops while on his way to his brother's wedding.\n* November 15, 2007 – A man in a taxi was killed and another wounded when they were shot at in Kandahar by Canadian troops riding in a convoy.\n* November 28, 2007 – An Afghan official, Nuristan governor Tamim Nuristani, claims U.S.-led coalition troops killed 14 road construction workers in air strikes in eastern Afghanistan. This incident was confirmed by Sayed Noorullah Jalili, director of the Kabul-based road construction company Amerifa whose employees were killed in the bombing.\nSee also\n* Civilian casualties in the War in Afghanistan (2001–present)\nReferences"
    }
  ]
}