{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1899\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1899.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland).  For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign. Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\". Acts passed from 1963 onwards are simply cited by calendar year and chapter number.\nAll modern acts have a short title, e.g. the Local Government Act 2003. Some earlier acts also have a short title given to them by later acts, such as by the Short Titles Act 1896.\n62 & 63 Vict.\nThe fifth session of the 26th Parliament of the United Kingdom, which met from 7 February 1899 until 9 August 1899.\nPublic general acts\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|  to Districts in which it has not been adopted.|note4= }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  affecting the Congested Districts Board, and to make further provision for the expenses of that Board out of money provided by Parliament.}}\n|  }}\n|\n|  }}\n| |note4= }}\n|  }}\n|  with respect to Holloway College.}}\n|  }}\n|\n|  }}\n| |note4= }}\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n| |note4= }}\n|  }}\n|  and Section Four of the Pauper Inmates Discharge and Regulation Act, 1871.|note4= }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  and the Patriotic Fund Act, 1886.|note4= }}\n|\n|  }}\n|\n|  }}\n|\n|  }}\n}}\nLocal acts\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|  and for other purposes.}}\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|  relating to lands in the parishes of St. Marylebone Lee St. John Horsleydown St. Mary Stratford Bow and St. John at Hackney.|note4=|po1=Order made by the Secretary of State under the Metropolitan Police Act 1886.|po1short=n|}}\n|\n|po2=Middlesbrough Order 1899|Provisional Order for partially repealing and altering a Local Act.\n|po3=Nelson Order 1899|Provisional Order for altering a Confirming Act.\n|po4=Southampton Order 1899|Provisional Order for altering a Confirming Act.\n|po5=Stafford Order 1899|Provisional Order for altering the Stafford Corporation Act 1896. }}\n|  reducing the number of magistrates and councillors in the Royal Burgh of St. Andrews.|po1=St. Andrews Burgh Order 1899|Provisional Order.}}\n|  relating to Broughty Ferry Gas Supply and Paving.|note4=|po1=Broughty Ferry Gas and Paving Order 1899|Provisional Order.}}\n|\n|  relating to the Llanelly and Burry Pilotage District.|note4= }}\n|  }}\n|  and 1888 relating to Castleford East Barnet Yalley Grays Thurrock Mexborough Sutton Coldfield and Worksop.|po1=Castleford Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Castleford.\n|po2=East Barnet Valley Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the East Barnet Valley Urban District Council.\n|po3=Grays Thurrock Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Grays Thurrock.\n|po4=Mexborough Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Mexborough.\n|po5=Sutton Coldfield Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Sutton Coldfield.\n|po6=Worksop Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Worksop.}}\n|  and 1888 relating to Aylesbury Hartlepool Mansfield Wath-upon-Dearne and Winsford.|po1=Aylesbury Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Aylesbury in respect of the Urban District of Aylesbury in the County of Buckingham.\n|po2=Hartlepool Corporation Electric Lighting Order 1899|Provisional Order under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Hartlepool in respect of the Borough of Hartlepool in the County of Durham.\n|po3=Mansfield Corporation Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Mansfield in the County of Nottingham in respect of the said Borough.\n|po4=Wath-upon-Dearne Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Wath-upon-Dearne in respect of the Urban District of Wath-upon-Dearne in the West Riding of the County of York.\n|po5=Winsford Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Winsford Urban District Council in respect of the Urban District of Winsford in the County of Chester.}}\n|  and 1888 relating to Audenshaw Bexley Glossop Rhyl Rugby and Runcorn.|po1=Audenshaw Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Audenshaw in respect of the Urban District of Audenshaw in the County of Lancaster.\n|po2=Bexley Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Bexley in respect of the Urban District of Bexley in the County of Kent.\n|po3=Glossop Corporation Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Glossop in respect of the Borough of Glossop in the County of Derby.\n|po4=Rhyl Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Rhyl in respect of the Urban District of Rhyl in the County of Flint.\n|po5=Rugby Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Rugby in respect of the Urban District of Rugby in the County of Warwick.\n|po6=Runcorn Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Runcorn in respect of the Urban District of Runcorn in the County of Chester.}}\n|\n|\n| |note4= }}\n|\n|\n|\n|  and for other purposes.}}\n|  }}\n|  and 1896 for the compulsory purchase of lands and for the completion of the railways authorised by the said Acts and for other purposes.}}\n|  }}\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|  }}\n|\n|  for the purchase of lands and construction of works and for other purposes.|note4= }}\n|\n|\n|\n|\n|\n|\n|\n|  and to enable them to borrow additional money to amend the provisions of the said Act and for other purposes.|note4= }}\n|  }}\n|\n|  and to construct additional waterworks to amend the provisions of that Act to raise additional capital and for other purposes.}}\n|\n|  and the Wick and Pulteney Harbours Order 1883 and to confer further powers upon the Trustees and for other purposes.}}\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  and certain Confirming Acts.\n|po2=Ashton-under-Lyne Order 1899|Provisional Order for altering certain Local Acts and Confirming Acts.\n|po3=Bolton Order 1899|Provisional Order for altering a Local Act and a Confirming Act.\n|po4=Llandudno Order 1899|Provisional Order for altering a Local Act and a Confirming Act.\n|po5=Rotherham Order 1899|Provisional Order for altering the Rotherham Corporation Act 1896.\n|po6=Southport Order (No. 1) 1899|Provisional Order for altering a Confirming Act.\n|po7=Southport Order (No. 2) 1899|Provisional Order for altering the Southport Improvement Act 1885.\n|po8=York Order 1899|Provisional Order for altering the York Extension and Improvement Act 1884. }}\n|\n|po2=Borough of Halifax Order 1899|Provisional Order made in pursuance of Sections 54 and 59 of the Local Government Act 1888.\n|po3=County of East Sussex Order 1899|Provisional Order made in pursuance of sub-section (2) of Section 69 of the Local Government Act 1888.\n|po4=County of Middlesex Order 1899|Provisional Order made in pursuance of sub-section (2) of Section 69 of the Local Government Act 1888. }}\n|  and a Confirming Act.\n|po4=Devonport Order (No. 1) 1899|Provisional Order to enable the Urban Sanitary Authority for the Borough of Devonport to put in force the Compulsory Clauses of the Lands Clauses Acts.\n|po5=Devonport Order (No. 2) 1899|Provisional Order to enable the Urban Sanitary Authority for the Borough of Devonport to put in force the Compulsory Clauses of the Lands Clauses Acts.\n|po6=Margate Order 1899|Provisional Order for altering a Local Act.\n|po7=Oxford Order 1899|Provisional Order for altering a Confirming Act.\n|po8=Romford Joint Hospital Order 1899|Provisional Order for forming a United District under Section 279 of the Public Health Act 1875.\n|po9=Wallingford and Crowmarsh Hospital Order 1899|Provisional Order for forming a United District under Section 279 of the Public Health Act 1875. }}\n|  and certain Confirming Acts.\n|po5=Ripon Order 1899|Provisional Order for altering the Ripon Corporation Act 1886.\n|po6=West Bromwich Order (No. 1) 1899|Provisional Order for partially repealing and altering the West Bromwich Corporation (Consolidation of Loans) Act 1889.\n|po7=West Bromwich Order (No. 2) 1899|Provisional Order for altering the West Bromwich Improvement Act 1854. }}\n|\n|po2=Wallingford Gas Order 1899|Provisional Order under the Gas and Water Works Facilities Act 1870.\n|po3=Wokingham Gas Order 1899|Provisional Order under the Gas and Water Works Facilities Act 1870 and the Gas and Water Works Facilities Act 1870 Amendment Act 1873. }}\n|  }}\n|  and a Confirming Act.\n|po2=Saint Mary Newington Order 1899|Provisional Order for partially repealing and altering a Local Act.\n|po3=Greenwich Union Order 1899|Provisional Order made in pursuance of sub-section (3) of Scction 2 of the Poor Law Act 1889.\n|po4=Wolverhampton Union Order 1899|Provisional Order made in pursuance of sub-section (3) of Section 2 of the Poor Law Act 1889. }}\n|  relating to the Burgh of Borrowstounness.}}\n|  and 1888 relating to Bermondsey.|po1=Bermondsey Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Vestry of the Parish of Bermondsey in the County of London in respect of the Parish of Bermondsey.}}\n|  and 1888 and the Electric Lighting (Scotland) Act 1890 relating to Alloa Dumfries Inverness and Kilmarnock.|note4=|po1=Alloa Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 and the Electric Lighting (Scotland) Act 1890 to the Commissioners of the Burgh of Alloa in the County of Clackmannan in respect of the Burgh of Alloa.\n|po2=Dumfries Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 and the Electric Lighting (Scotland) Act 1890 to the Provost Magistrates and Town Council of the Royal Burgh of Dumfries in the County of Dumfries in respect of the Royal Burgh of Dumfries.\n|po3=Inverness Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 and the Electric Lighting (Scotland) Act 1890 to the Provost Magistrates and Toon Council of the Royal Burgh of Inverness in the County of Inverness in respect of the Royal Burgh of Inverness.\n|po4=Kilmarnock Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 and the Electric Lighting (Scotland) Act 1890 to the Provost Magistrates and Town Council of the Burgh of Kilmarnock in respect of the Burgh of Kilmarnock in the County of Ayr.}}\n|  and 1888 relating to Ashford (Kent) Bognor Burslem (Extension) Cheltenham (Extension) Durham Haslingden and Ilkeston.|po1=Ashford (Kent) Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Ashford in the County of Kent in respect of the Urban District of Ashford.\n|po2=Bognor Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Bognor in the County of Sussex in respect of the Urban District of Bognor.\n|po3=Burslem Electric Lighting (Extension) Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Burslem in respect of the Parish of Wolstanton in the County of Stafford.\n|po4=Cheltenham (Extension) Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Cheltenham in the County of Gloucester extending the area of supply to the whole of the Borough of Cheltenham and to amend the Cheltenham Electric Lighting Order 1890.\n|po5=Durham Corporation Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Citizens of the City of Durham in respect of the City of Durham in the County of Durham.\n|po6=Haslingden Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Haslingden in the County of Lancaster in respect of the Borough of Haslingden.\n|po7=Ilkeston Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Ilkeston in the County of Derby in respect of the said Borough.}}\n|  and 1888 relating to Gorton Heaton Norris Keighley Knutsford Ryde and Walker.|po1=Gorton Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Gorton Urban District Council in respect of the Urban District of Gorton in the County Palatine of Lancaster.\n|po2=Heaton Norris Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Heaton Norris in the County of Lancaster in respect of the Urban District of Heaton Norris.\n|po3=Stockport (Extension) Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Heaton Norris in the County of Lancaster in respect of the Urban District of Heaton Norris.\n|po4=Keighley Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the borough of Keighley in the West Riding of the County of York in respect of the said borough.\n|po5=Knutsford Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Knutsford in respect of the Urban District of Knutsford in the County of Chester.\n|po6=Ryde Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Ryde acting by their Council as the Urban Sanitary Authority in respect of the District of the Borough of Ryde in the Administrative County of the Isle of Wight.\n|po7=Walker Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Walker in respect of the Urban District of Walker in the County of Northumberland.}}\n|  and 1888 relating to Cheriton Cromer Erith Farnborough Horsham and Teignmouth.|po1=Cheriton Urban District Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Cheriton Urban District Council in respect of the Urban District of Cheriton in the County of Kent.\n|po2=Cromer Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Cromer in respect of the Urban District of Cromer in the County of Norfolk.\n|po3=Erith Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Erith in respect of the Urban District of Erith in the County of Kent.\n|po4=Farnborough Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Farnborough in respect of the Urban District of Farnborough in the County of Southampton.\n|po5=Horsham Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Horsham Urban District Council in respect of the Urban District of Horsham in the County of Sussex.\n|po6=Teignmouth Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Teignmouth Urban District Council in the County of Devon.}}\n|  and 1888 relating to Clontarf.|po1=Clontarf Electric Lighting Order 1899|}}\n|  and 1888 relating to Broadstairs Christchurch and District Guildford (Extension) Newport (Isle of Wight) Sandown and Shanklin and Westgate and Birchington.|po1=Broadstairs Electric Lighting Order 1899|\n|po2=Christchurch and District Electric Lighting Order 1899|\n|po3=Guildford (Extension) Electric Lighting Order 1899|\n|po4=Newport (Isle of Wight) Electric Lighting Order 1899|\n|po5=Sandown and Shanklin Electric Lighting Order 1899|\n|po6=Westgate and Birchington Electric Lighting Order 1899|}}\n|  and 1888 relating to Leamington Spa.|po1=Royal Leamington Spa Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Royal Leamington Spa in respect of the said Borough.}}\n|  and 1888 relating to Bournemouth (Public Purposes) Eastbourne Hendon and to the extension of the area of supply of the Midland Electric Corporation for Power Distribution (Limited).|po1=Bournemouth (Public Purposes) Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Corporation of Bournemouth in respect of the Borough of Bournemouth.\n|po2=Eastbourne Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the borough of Eastbourne in the County of Sussex in respect of the said Borough.\n|po3=Hendon Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Electrical and General Engineering Company in respect of the Urban District of Hendon in the County of Middlesex.\n|po4=Midland Electric Power Distribution and Lighting (Extension) Order 1899|Provisional Order under the Electric Lighting Acts 1882 and 1888 to the Midland Electric Corporation for Power Distribution (Limited) in respect of an Extension of their existing Area of Supply in the County of Stafford.}}\n| |po1=Provisional Order for putting in force the Lands Clauses Acts.|po1short=n|}}\n|  relating to Blackpool Lynmouth and Otter Ferry.|po1=Blackpool Pier Order 1899|Provisional Order for authorising an Extension of the Blackpool Pier and other Works at Blackpool in the County of Lancaster and other purposes connected therewith.\n|po2=Lynmouth Pier Order 1899|Provisional Order for the construction maintenance and regulation of a Promenade Pier with approaches at Lynmouth in the County of Devon.\n|po3=Otter Ferry Pier Order 1899|Provisional Order for the Construction Maintenance and Regulation of a Pier and Works at Otter Ferry in the Parish of Kilfinan and County of Argyll.}}\n|\n|\n|\n|  and for Sewerage Works.\n|po2=Thurles Provisional Order 1899|Provisional Order giving compulsory powers of purchasing lands and premises for the purposes of Part III. of the Housing of the Working Classes Act 1890. }}\n| |note4=|po1=Great Yarmouth Military Lands Order 1899|A Provisional Order made in pursuance of Section Two of the Military Lands Act 1892 authorising the purchase by the Council of the Borough of Great Yarmouth of land for Military purposes.}}\n|\n|  and 1888 relating to Camborne Dukinfield Fenton Finchley Shipley and Swinton.|po1=Camborne Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Camborne Electricity Supply Company Limited in respect of the Urban District of Camborne in the County of Cornwall.\n|po2=Dukinfield Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Dukinfield in respect of the Urban District of Dukinfield in the County of Chester.\n|po3=Fenton Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Fenton in respect of the Urban District of Fenton in the County of Stafford.\n|po4=Finchley Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Finchley Urban District Council in respect of the Urban District of Finchley in the County of Middlesex.\n|po5=Shipley Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Shipley in respect of the Urban District of Shipley in the West Riding of the County of York.\n|po6=Swinton Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Swinton in respect of the Urban District of Swinton in the West Riding of the County of York.}}\n|  and 1888 relating to East Retford Failsworth Pemberton Stourbridge Swinton and Pendlebury and Wednesbury.|po1=East Retford Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of East Retford in the County of Nottingham in respect of the said Borough.\n|po2=Failsworth Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Failsworth Urban District Council in respect of the Urban District of Failsworth in the County Palatine of Lancaster.\n|po3=Pemberton Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Pemberton in respect of the Urban District of Pemberton in the County Palatine of Lancaster.\n|po4=Stourbridge Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Stourbridge in the County of Worcester in respect of the said Urban District.\n|po5=Swinton and Pendlebury Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Swinton and Pendlebury in respect of the Urban District of Swinton and Pendlebury in the County Lancaster.\n|po6=Wednesbury Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Wednesbury in the county of Stafford in respect of the said borough.}}\n|  and 1888 relating to Hey wood Longton Ludlow Mirfield Newcastle-under-Lyme and Rawtenstall.|po1=Heywood Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Heywood in the County Palatine of Lancaster in respect of the said Borough.\n|po2=Longton Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Longton in the County of Stafford in respect of the said Borough.\n|po3=Ludlow Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Ludlow in the County of Salop in respect of the said Borough.\n|po4=Mirfield Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Mirfield in the West Riding of the County of York in respect of the Urban District of Mirfield.\n|po5=Newcastle-under-Lyme Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Newcastle-under-Lyme in the County of Stafford in respect of the said Borough.\n|po6=Rawtenstall Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Rawtenstall in the County of Lancaster in respect of the Borough of Rawtenstall.}}\n|  and 1888 and the Electric Lighting (Scotland) Act 1890 relating to Arbroath Hawick Kirkcaldy and Musselburgh.|note4=|po1=Arbroath Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 and the Electric Lighting (Scotland) Act 1890 to the Magistrates and Town Council of the Burgh of Aberbrothwick or Arbroath in the County of Forfar in respect of that Burgh.\n|po2=Hawick Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 and the Electric Lighting (Scotland) Act 1890 to the Urban Electric Supply Company Limited in respect of the Burgh of Hawick in the County of Roxburgh.\n|po3=Kirkcaldy Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 and the Electric Lighting (Scotland) Act 1890 to the Provost Magistrates and Town Council of the Royal Burgh of Kirkcaldy in the County of Fife in respect of that Burgh.\n|po4=Musselburgh Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 and the Electric Lighting (Scotland Act) 1890 to the Drake and Gorham Electric Power and Traction (Pioneer) Syndicate Limited in respect of the Burgh of Musselburgh in the County of Edinburgh.}}\n|  and 1888 to the West Kent Electricity Supply Company Limited in respect of the parish of Crayford in the county of Kent.\n|po2=Halesowen Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Rural District Council of Halesowen in respect of the Rural District of Halesowen in the County of Worcester.\n|po3=Handsworth Electric Supply Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Handsworth in the County of Stafford in respect of the Urban District of Handsworth.\n|po4=Lye and Wollescote Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Handsworth in the County of Stafford in respect of the Urban District of Handsworth.\n|po5=Lymington Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Lymington Electric Light and Power Company Limited in respect of the Borough of Lymington in the County of Hampshire.}}\n|  and 1888 relating to Bethnal Green Blackheath and Greenwich District (Extension) Lewisham District and Plumstead.|po1=Bethnal Green Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Vestry of the Parish of St. Matthew Bethnal Green in the County of London in respect of the Parish of Bethnal Green.\n|po2=Blackheath and Greenwich District (Extension) Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Blackheath and Greenwich District Electric Light Company Limited in respect of such part of the Lee District in the Administrative County of London as is not comprised in the area of supply named in the Blackheath and Greenwich District Electric Lighting Order 1897 and for the purpose of amending the said Order.\n|po3=Lewisham District Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Board of Works for the Lewisham District in respect of a portion of the Lewisham District.\n|po4=Plumstead Vestry Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Vestry of the Parish Plumstead in the County of London in respect of the Parish of Plumstead.}}\n|  and 1888 relating to Carshalton Gateshead Merthyr Tydfil and Newton Abbot.|po1=Carshalton Electric Lighting Order 1899|\n|po2=Gateshead Electric Lighting Order 1899|\n|po3=Merthyr Tydfil Electric Lighting Order 1899|\n|po4=Newton Abbot Electric Lighting Order 1899|}}\n|  relating to Alton (Hants) Gas Bedworth Gas Elstree and Boreham Wood Gas Limavady Gas and Wellingborough Gas.|po1=Alton (Hants.) Gas Order 1899|\n|po2=Bedworth Gas Order 1899|\n|po3=Elstree and Borehamwood Gas Order 1899|\n|po4=Limavady Gas Order 1899|\n|po5=Wellingborough Gas Order 1899|}}\n|  relating to Herne Bay Gas Hoy lake and West Kirby Gas and Water Tunbridge Gas and York Town and Blackwater Gas.|po1=Herne Bay Gas Order 1899|\n|po2=Hoylake and West Kirby Gas and Water Order 1899|\n|po3=Tonbridge Gas Order 1899|\n|po4=York Town and Blackwater Gas Order 1899|}}\n|  relating to Burnham and District Water Harpenden Water Maidstone Water Stourbridge Water and Tilehurst Pangbourne and District Water.|po1=Burnham (Bucks.) and District Water Order 1899|\n|po2=Harpenden Water Order 1899|\n|po3=Maidstone Water Order 1899|\n|po4=Stourbridge Water Order 1899|\n|po5=Tilehurst Pangbourne and District Water Order 1899|}}\n|\n|\n|\n|\n|\n| |po1=|po1short=n|}}\n|  relating to Aberdeen Corporation Tramways Devonport Corporation Tramways Halifax Corporation Tramways Matlock Urban District Tramways Perth and District Tramways and Reading Corporation Tramways.|po1=Aberdeen Corporation Tramways Order 1899|\n|po2=Devonport Corporation Tramway Order 1899|\n|po3=Halifax Corporation Tramways Order 1899|\n|po4=Matlock Urban District Tramway Order 1899|\n|po5=Perth and District Tramways Order 1899|\n|po6=Reading Corporation Tramways Order 1899|}}\n|  relating to Fleetwood Innellan Montrose and Southwold.|po1=Fleetwood Pier Order 1899|\n|po2=Innellan Pier Order 1899|\n|po3=Montrose Harbour Order 1899|\n|po4=Southwold Pier Order 1899|}}\n|  relating to Paisley Corporation Gas Supply.|po1=Paisley Gas Order 1899|}}\n|  and 1892 to authorise the letting of ground the construction of additional works the redemption of the annuity to the Corporation of Leith and for other purposes.|note4= }}\n|  }}\n|\n|  }}\n|\n|\n|  }}\n|\n|  }}\n|  }}\n|\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|  }}\n|  the Port Talbot Railway and Docks (Ogmore Valleys Extension) Act 1896 and the Port Talbot Railway and Docks (South Wales Mineral Railway Junction) Act 1896 and for other purposes.}}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|  by substituting for the maximum price of gas supplied by the Yeadon and Guiseley Gas Light and Coke Company a standard price with a sliding scale of profits dependent on the price charged above or below such standard / price.|note4= }}\n|\n|\n|  }}\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|  from Holborn to the Strand and a widening of Southampton Row to widen High Street Kensington and to make other street improvements and works in the administrative County of London and for other purposes.}}\n|\n|\n|\n|  }}\n|  relating to Farnham Gas Freshwater Gas Morecambe Gas and Newtown and Llanllwchaiam Gas.|po1=Farnham Gas Order 1899|Order empowering the Farnham Gas Company Limited to construct maintain and continue Gasworks and to manufacture and supply Gas in the Parishes of Farnham and Farnham Rural in the County of Surrey and for other purposes.\n|po2=Freshwater Gas Order 1899|Order empowering the Freshwater Gas Company Limited to construct and maintain Gasworks and to make and supply Gas within the Townships and Parishes of Freshwater and Totland all in the Isle of Wight and County of Southampton.\n|po3=Morecambe Gas Order 1899|Order empowering the Morecambe Gas and Light Company to raise additional Capital and for other purposes.\n|po4=Newtown and Llanllwchaiarn Gas Order 1899|Order empowering the Newtown and Llanllwchaiarn Gas and Coke Company Limited to maintain and continue Gasworks and to manufacture and supply Gas in the Urban District Newtown and Llanllwchaiarn in the County of Montgomery and for other purposes.}}\n|  and a Confirming Act.\n|po3=Reading Water Order 1899|Provisional Order for altering certain Local Acts and Confirming Acts.}}\n|  relating to Audenshaw Urban District Tramways Clayton Tramways Eccles Corporation Tramways Ilkeston Corporation Tramways Queensbury Tramway and Southport Corporation Tramways.|po1=Audenshaw Urban District Tramway Order 1899|Order authorising the Urban District Council of Audenshaw to construct a Tramway in their District and for other purposes.\n|po2=Clayton Tramway Order 1899|Order authorising the Urban District Council of Clayton to construct a Tramway in their District and for other purposes.\n|po3=Eccles Corporation Tramways Order 1899|Order authorising the Mayor Aldermen and Burgesses of the Borough of Eccles to work Tramways in their Borough and for other purposes.\n|po4=Ilkeston Corporation Tramways Order 1899|Order authorising the Mayor Aldermen and Burgesses of the Borough of Ilkeston to construct Tramways in their Borough.\n|po5=Queensbury Tramway Order 1899|Order authorising the Urban District Council of Queensbury to construct a Tramway in their district and for other purposes.\n|po6=Southport Corporation Tramways Order 1899|Order authorising the Mayor Aldermen and Burgesses of the Borough of Southport to construct Tramways and for other purposes.}}\n|  relating to Barking Town Urban District Tramways Blackpool Corporation Tramways Dudley and Wolverhampton Tramways Gravesend Rosherville and Northfleet Tramways Ilford Urban District Tramways and Wrexham District Tramways.|po1=Barking Town Urban District Tramways Order 1899|\n|po2=Blackpool Corporation Tramways Order 1899|Order authorising the Mayor Aldermen and Burgesses of the Borough of Blackpool to construct additional Tramways in the said Borough.\n|po3=Dudley and Wolverhampton Tramways Order 1899|Order providing for the Sale to and Purchase by the Mayor Aldermen and Burgesses of the Borough of Wolverhampton of the portion within the Borough of the Tramways of the Dudley and Wolverhampton Tramways Company Limited and authorising that Company to alter the Gauge of their remaining Tramways and to work the same by Mechanical Power.\n|po4=Gravesend Rosherville and Northfleet Tramways Order 1899|Order authorising the Gravesend Rosherville and Northfleet Tramways Company Limited to construct additional Tramways in the Parishes or Townships of Gravesend Milton Northfleet and Swanscombe in the County of Kent and to work the same and also their existing Tramways by Electrical Power to sell their Undertaking to the Drake and Gorham Electric Power and Traction Company Limited and for other purposes.\n|po5=Ilford Urban District Tramways Order 1899|Order authorising the Urban District Council of Ilford to construct Tramways in their District and for other purposes.\n|po6=Wrexham District Tramways Order 1899|Order authorising the Wrexham Tramways Limited to construct additional and substituted Tramways in the Parishes or Townships of Broughton Wrexham Regis Bersham Erddig Esclusham Below and Rhosllanerchrugog in the County of Denbigh and to work the same by Electrical Power to sell their Undertaking to the Drake and Gorham Electric Power and Traction Company Limited and for other purposes.}}\n|  and 1888 relating to the City of London.|po1=City of London Electric Lighting Order 1899|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Charing Cross and Strand Electricity Supply Corporation Limited in respect of the City of London.}}\n|\n| |po1=Scheme for the Management of Tancred's Charities.|po1short=n|}}\n}}\nPrivate acts\n| |private|2|27-04-1899|repealed=n|archived=n|An  Act to dissolve the Marriage of Thomas Charles Duffin Cathcart of Ruperta House Newtownards Road in that part of the City of Belfast which is situate in County Down Medical Practitioner with Emily Jane Cathcart his now wife and to enable him to marry again and for other purposes.}}\n| |private|3|13-07-1899|repealed=n|archived=n|An Act to dissolve the Marriage of Charlotte Jane Jones the wife of Robert Colvill Jones with the said Robert Colvill Jones and to enable her to marry again and for other purposes.}}\n}}\nSources\n*\n62 & 63 Vict. Sess. 2\nThe sixth session of the 26th Parliament of the United Kingdom, which met from 17 October 1899 until 27 October 1899.\nNo local or private acts were passed during this session.\nPublic general acts\n}}\n|  }}\n|  }}\n}}\nSources\n*\nSee also\n*List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}