{
  "content": [
    {
      "type": "text",
      "text": "# List of Wario video games\n\n's yellow hat and represents him in many games.|alt=A purple W in white surrounded in a circle by yellow]]\n'Wario video games' have been developed by several companies, including Nintendo, Suzak, Good-Feel, Treasure and Intelligent Systems.  All Wario video games have been developed for Nintendo video game consoles and handhelds dating from the Game Boy to the seventh generation of video game consoles. The first game to feature Wario was as the antagonist in Super Mario Land 2: 6 Golden Coins; Wario Land: Super Mario Land 3 was the first to feature Wario as a playable character.\nThe Wario series consists of two separate gameplay-oriented parts: a series of traditional side-scrolling platform games, and a series of party games under the WarioWare moniker.\nThe platform games are a spin-off from the Super Mario Land series of games for the Game Boy. The changes from the Mario Land series, both stylistically and storywise—with anime-style cutscenes and a greedy protagonist—make the games unique from other platformers in the genre. The latest Wario platform game to be released is  Wario Land: Shake It! (known as Wario Land: The Shake Dimension in Europe and  in Japan) for the Wii, and is a 2D platform game like the previous Wario platform games.\nThe WarioWare games are minigame compilations in which the player is required to perform a series of short activities at a quickening pace, with the player having four lives. The latest WarioWare game is WarioWare: Move It!, released on November 3, 2023.\nWario platforming games\n| canceled=\n| refs=\n| release=1994 – Game Boy2011 – Nintendo 3DS (VC)\n| notes= * Developed by Nintendo's Nintendo R&D1 team.\n* First game to feature Wario as a playable character.\n* Third game in the Super Mario Land series and the first game in the Wario Land series.\n* Re-released in Europe under the Game Boy Nintendo Classics brand in 2001.\n* Re-released on the Nintendo 3DS's Virtual Console service in 2012 for Japan, Europe, and North America.\n}}\n| canceled=\n| refs=\n| release=1995 – Virtual Boy\n| notes= * Developed by Nintendo.\n* Features gameplay similar to the other Wario Land games.\n}}\n| canceled=\n| refs=\n| release=1998 – Game Boy1998 – Game Boy Color2012 – Nintendo 3DS (VC)\n| notes= * Developed by Nintendo.\n* Includes support for the Super Game Boy peripheral.\n}}\n| canceled=\n| refs=\n| release=2000 – Game Boy Color2012 – Nintendo 3DS (VC)2023 – Nintendo Switch (NC)\n| notes= * Developed by Nintendo.\n* More non-linear in structure than previous games in the series.\n}}\n| canceled=\n| refs=\n| release=2001 – Game Boy Advance2011 – Nintendo 3DS (VC, Ambassador Program exclusive)2014 – Wii U (VC) 2025 – Nintendo Switch (NC)\n| notes= * Developed by Nintendo.\n}}\n| canceled=\n| refs=\n| release=2003 – GameCube\n| notes= * Developed by Treasure.\n* First Wario platform game for a home console.\n}}\n| canceled=\n| refs=\n| release=2007 – Nintendo DS2015 – Wii U (VC)\n| notes= * Developed by Suzak.\n* Fuses puzzles into a Wario platforming setting.\n}}\n| canceled=\n| refs=\n| release=2008 – Wii2016 – Wii U\n| notes= * The game is known as Wario Land: The Shake Dimension in Europe and Australia, Wario Land: Shake It! in North America, and  in Japan.\n* Developed by Good-Feel.\n* Requires the player to shake the Wii Remote to perform certain actions.\n}}\n}}\nWarioWare games\n| canceled=\n| refs=\n| release=2003 – Game Boy Advance2003 – GameCube2011 – Nintendo 3DS (VC, Ambassador Program exclusive)2014 – Wii U (VC)2023 – Nintendo Switch (NC)\n| notes= * Known as  in Japan and WarioWare, Inc.: Minigame Mania in Europe.\n* Developed by Nintendo.\n* First game in the WarioWare series.\n* Consists of a series of minigames presented in a hectic format.\n* Re-released for the GameCube as Warioware, Inc.: Mega Party Game$! with multiplayer support.\n}}\n| canceled=\n| release=2004 – Game Boy Advance\n| notes= * Known as  in Japan. Not released in Europe.\n* Developed by Nintendo.\n* Uses a rotation sensor in the cartridge to play most of the minigames.\n}}\n| canceled=\n| refs=\n| release=2004 – Nintendo DS2015 – Wii U (VC)2016 – Nintendo 3DS\n| notes= * Known as  in Japan.\n* Co-developed by Intelligent Systems.\n* Uses the Nintendo DS touch screen for most of the minigames.\n}}\n| canceled=\n| refs=\n| release=2006 – Wii2016 – Wii U\n| notes= * Known as  in Japan.\n* Co-developed by Intelligent Systems.\n* Players must hold the Wii Remote in different positions to play the minigames.\n}}\n| canceled=\n| refs=\n| release=2008 – DSiWare2011 – Nintendo 3DS\n| notes= * Known as  in Japan.\n* Co-developed by Intelligent Systems.\n* Uses the Nintendo DSi's camera to control the minigames.\n}}\n| canceled=\n| refs=\n| release=2009 – Nintendo DS\n| notes= * Known as  in Japan.\n* Co-developed by Intelligent Systems.\n* Allows the user to create their own minigames, music, and comics.\n}}\n| canceled=\n| refs=\n| release=2009 – WiiWare\n| notes= * Known as  in Japan.\n* Co-developed by Intelligent Systems.\n* Allows the user to import games and content made in WarioWare D.I.Y. for TV play.\n}}\n| canceled=\n| refs=\n| release=2013 – Wii U\n| notes= * Described as a spiritual successor to the WarioWare series.\n* Features various games utilizing the Wii U GamePad, including its touchscreen, motion controls and camera.\n}}\n| canceled=\n| refs=\n| release=2018 – Nintendo 3DS\n| notes=* Known as  in Japan.\n}}\nin Japan.\n}}\nin Japan.\n* Direct sequel to WarioWare: Smooth Moves, as shown by its Japanese title and similar English title.\n}}\n}}\nIndividual microgames\n| canceled=\n| refs=\n| release=2008 – DSiWare\n| notes= * Developed by Nintendo.\n* Known in Europe and Australasia as Pyoro.\n* Originally found in WarioWare, Inc.: Mega Microgames!, Pyoro that was modified to use both of the Nintendo DS's screens.\n}}\n| canceled=\n| refs=\n| release=2008 – DSiWare\n| notes= * Developed by Nintendo.\n* Known in Europe and Australasia as Paper Plane.\n* Originally a single microgame with expanded modes that was released for the DSiWare download service.\n}}\n}}\nOther games\n| canceled=\n| refs=\n| release=1993 – Super Nintendo Entertainment System\n| notes= * Developed by Game Freak.\n* Released exclusively in Japan.\n* Uses the Super Famicom mouse.\n}}\n| canceled=\n| refs=\n| release=1994 – Nintendo Entertainment System, Super Nintendo Entertainment System1995 – Satellaview2006 – Wii (VC)2013 – Nintendo 3DS (VC)2013 – Wii U (VC)2018 – Nintendo Switch (NC)\n| notes= * Developed by Nintendo.\n* Last game to be released for the Nintendo Entertainment System.\n* Features Toad as the protagonist, and Wario as the villain.\n* Puzzle game in which the player's cursor is Toad.\n}}\n| canceled=\n| refs=\n| release=1994 – Game Boy\n| notes= * Developed by Hudson Soft.\n* Originally released as Bomberman GB in Japan, and not featuring Wario in any way. It was altered and re-released as Wario Blast: Featuring Bomberman! in North America and Europe in the hopes that the game would reach a larger audience.\n}}\n| canceled=\n| refs=\n| release=1995 – Satellaview\n| notes= * Featuring a vocal track from the Japanese radio comedy show, Bakushō Mondai.\n* Re-released in 1997 without the Bakushō Mondai vocal track as Wario no Mori: Futatabi in two different versions (time- and score-attack).\n}}\n}}\nNotes\nReferences"
    }
  ]
}