{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in the United States__disambig_1\n\n{| style=\"background:transparent; margin:auto; float:right;\"\n|colspan=3|\n}}\n|-\n|\n}}\n|\n}}\n|\n}}\n|}\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) World Heritage Sites are places of importance to cultural or natural heritage as described in the UNESCO World Heritage Convention, established in 1972. Cultural heritage consists of monuments (such as architectural works, monumental sculptures, or inscriptions), groups of buildings, and sites (including archaeological sites). Natural features (consisting of physical and biological formations), geological and physiographical formations (including habitats of threatened species of animals and plants), and natural sites which are important from the point of view of science, conservation, or natural beauty, are defined as natural heritage. The United States accepted the convention on December 7, 1973. There are 26 World Heritage Sites in the United States, with a further 17 on the tentative list.\nThe first sites in the United States added to the list were Mesa Verde National Park and Yellowstone National Park, both at the second session of the World Heritage Committee, held in Washington, D.C., in 1978. The most recent site listed is the Historic Moravian Bethlehem District, as a part of the transnational site Moravian Church Settlements, shared with Denmark, Germany, and the United Kingdom. The 26 sites are located in 22 states and two territories. Arizona, California, Hawaii, Illinois, Montana, New Mexico, New York, and Pennsylvania each contain multiple sites (with the 20th-Century Architecture of Frank Lloyd Wright listing spread across six states). There are also two transboundary sites that are shared with Canada. Of the 26 sites, 13 are cultural, 12 are natural, and one, Papahānaumokuākea, is mixed, listed for both cultural and natural properties. One site is currently listed as endangered: Everglades National Park was listed in 2010 due to deterioration of its aquatic ecosystems. The site had also been listed as endangered between 1993 and 2007. Yellowstone National Park was listed as endangered between 1995 and 2003 because of planned mining operations. The United States has served as a member of the World Heritage Committee five times, 1976–1983, 1987–1993, 1993–1999, 1999–2001, and 2005–2009.\n__TOC__\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural, and vii through x are natural.\nIn danger|outline=silver}}\n{|class=\"wikitable sortable plainrowheaders\"\n|+\n|-\n! style=\"width:100px;\" scope=\"col\"| Site\n! class=\"unsortable\"  style=\"width:150px;\" scope=\"col\"| Image\n! style=\"width:80px;\" scope=\"col\"| Location (state)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" data-sort-type=\"number\"|\n! scope=\"col\" class=\"unsortable\" | Description\n|-\n! scope=\"row\" | Mesa Verde National Park\n|\n| Colorado\n| 1978\n| 27; iii (cultural)\n| The Mesa Verde plateau was occupied by the ancient Pueblo peoples between the 6th and 12th centuries. More than 4,000 archaeological sites have been discovered, including cliff dwellings. They range in size from small rooms to complexes containing more than 100 rooms. Notable examples include Cliff Palace (pictured), Balcony House, and Square Tower House.\n|-\n! scope=\"row\" | Yellowstone National Park\n|\n| Wyoming, Montana, Idaho\n| 1978\n| 28; vii, viii, ix, x (natural)\n| Designated in 1872 as the world's first national park, Yellowstone covers almost . It contains numerous geothermal features including over 300 geysers (more than half in the world), hot springs (Grand Prismatic Spring pictured), mudpots, and fumaroles. The area is rich in fossil deposits with nearly 150 species of plants identified. The park is home to large herds of bison, as well as grizzly bear and gray wolf. The park functions as a model system to understand the processes taking place in the ecosystem. The site was listed as endangered between 1995 and 2003 because of planned mining operations.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Kluane / Wrangell–St. Elias / Glacier Bay / Tatshenshini-Alsek\n|\n| Alaska\n| 1979\n| 72ter; vii, viii, ix, x (natural)\n| The four national parks and protected areas spanning the border between the United States and Canada contain the world's largest non-polar ice field and numerous large glaciers. The area, shaped by glacial and continuous tectonic activity, comprises different types of habitats, from high mountains above  to ocean, coastal forests, and river valleys. Some of the important animal species include grizzly bear, caribou, Dall sheep, and mountain goat. The rivers are spawning grounds for salmon that then migrate to the ocean. Johns Hopkins Glacier in Glacier Bay (pictured) was originally listed alone in 1979. Kluane (in Canada) and Wrangell–St. Elias were added to the site in 1992, and Tatshenshini-Alsek (in Canada) in 1994.\n|-\n! scope=\"row\" | Grand Canyon National Park\n|\n| Arizona\n| 1979\n| 75; vii, viii, ix, x (natural)\n| The Grand Canyon is a spectacular gorge that the Colorado River has carved during the last six million years while the Colorado Plateau was uplifted. The canyon is  long and up to  wide. It reaches depths of up to . The river has cut through geological strata spanning 2 billion years, from Precambrian to the Cenozoic, with the Precambrian and Paleozoic portions particularly well exposed and containing rich fossil assemblages. Due to its diverse topography, the area is home to numerous animal and plant species, from desert riparian to boreal forest communities.\n|-\n! scope=\"row\" style=\"background:#ffe6bd;\"| Everglades National Park\n|\n| Florida\n| 1979\n| 76; viii, ix, x (natural)\n| The Everglades comprises vast flat wetlands together with coastal and marine ecosystems. Habitats include tropical hardwood hammocks, mangrove forests, pine rocklands, fresh and saltwater marshes, and seagrass beds. The area is home to the manatee, Florida panther, snail kite, Great egret (Pictured), alligator, and crocodile. The site was placed on the List of World Heritage in Danger from 1993 to 2007 due to sustained hurricane damage and deterioration of water flow and quality due to agricultural and urban development, and again in 2010 due to degradation of the property resulting in a loss of marine habitat and decline in marine species. It is also a Ramsar Wetland.\n|-\n! scope=\"row\" | Independence Hall\n|\n| Pennsylvania\n| 1979\n| 78; vi (cultural)\n| The building was designed by Andrew Hamilton and completed in 1753 to house the colonial assembly of the Province of Pennsylvania. It was renovated several times afterwards. The original wooden steeple used to house the Liberty Bell. The Hall was the site of the Second Continental Congress, during which the Declaration of Independence was signed in 1776. Following the American Revolution, the building held the Constitutional Convention that debated and signed the United States Constitution in 1787. Both documents have served as inspirations for lawmakers and government charters throughout the world.\n|-\n! scope=\"row\" | Redwood National and State Parks\n|\n| California\n| 1980\n| 134; vii, ix (natural)\n| The site comprises one national and three state parks located along the coast of northern California. They are home to the largest contiguous forests of coast redwood trees, which are the tallest tree species on Earth. The park also contains areas of pristine coastline which is home to sea lion, bald eagle, and California brown pelican.\n|-\n! scope=\"row\" | Mammoth Cave National Park\n|\n| Kentucky\n| 1981\n| 150; vii, viii, x (natural)\n| Mammoth Cave is the longest known cave system in the world, with  of mapped passageways. The cave system is home to more than 130 cave-dwelling species. The cave system and the surrounding area exhibit numerous examples of karst topography, with sinkholes, underground rivers, speleothem, and large chambers. The system also has a great variety of sulfate minerals.\n|-\n! scope=\"row\" | Olympic National Park\n|\n| Washington\n| 1981\n| 151; vii, ix (natural)\n| The park comprises diverse habitats, including the largest protected area of temperate rainforest in the region, long stretches of undeveloped Pacific coastline, alpine meadows, and mountain peaks covered with glaciers. The rivers are important habitats for several anadromous fish species. Due to relative isolation, the area is home to several endemic species or subspecies. Some of the important species include the northern spotted owl, marbled murrelet, and bull trout.\n|-\n! scope=\"row\" | Cahokia\n|\n| Illinois\n| 1982\n| 198; iii, iv (cultural)\n| Cahokia was the largest and most important urban settlement of the Mississippian culture and is the largest pre-Columbian archaeological site north of Mexico. The society reached its peak between 1050 and 1150, when it was estimated to have a population of 10,000 to 20,000 people. The site includes some 120 mounds, including the Monks Mound (pictured), the largest prehistoric earthen structure in the Americas. The site also includes the Woodhenge, believed to serve as an astronomical observatory. The layout of the settlement demonstrates the existence of political and economic hierarchy of the society.\n|-\n! scope=\"row\" | Great Smoky Mountains National Park\n|\n| North Carolina, Tennessee\n| 1983\n| 259; vii, viii, ix, x (natural)\n| The park is a refuge of the flora and fauna from the diverse Arcto-Tertiary Geoflora era that has survived the Quaternary glaciations. It is a biodiversity hotspot, containing over 3,500 plant species and numerous animal species, including one of the world's greatest variety of salamanders, in particular lungless salamanders.\n|-\n! scope=\"row\" | La Fortaleza and San Juan National Historic Site in Puerto Rico\n|\n| Puerto Rico\n| 1983\n| 266bis; vi (cultural)\n| The 16th-century fortress La Fortaleza (pictured) and the later fortifications of Castillo San Felipe del Morro, Castillo de San Cristóbal, El Cañuelo, and the City Wall of San Juan, dating between the 16th and 20th centuries, were constructed by the Europeans to protect the bay and the city of San Juan. They incorporate architectural elements of Italian Renaissance, Baroque, and French Enlightenment, and they demonstrate the evolution and adaptation of European military architecture to the setting of a Caribbean island. A minor boundary modification took place in 2016.\n|-\n! scope=\"row\" | Statue of Liberty\n|\n| New York\n| 1984\n| 307; i, vi (cultural)\n| The statue, inaugurated in 1886, was a gift from France to commemorate the centenary of American independence. It was designed by Frédéric Bartholdi in collaboration with engineer Gustave Eiffel, and its construction, with a metal frame supporting the skin, use of concrete at the base, and electricity to power the torch, was seen as a harbinger of a new era. The statue is located at the entrance to the New York Harbor where it has welcomed millions of migrants. It symbolizes ideas such as liberty, peace, and human rights.\n|-\n! scope=\"row\" | Yosemite National Park\n|\n| California\n| 1984\n| 308; vii, viii (natural)\n| The park is located in the Sierra Nevada mountains. During the Quaternary glaciation, the glaciers created unique landscape features in the granite bedrock, such as valleys, cliffs, domes, moraines, and waterfalls. There are mountain meadows and  Giant Sequoia groves. Picture shows the Tunnel View of the Yosemite Valley, with the landforms Half Dome and El Capitan visible.\n|-\n! scope=\"row\" | Chaco Culture\n|\n| New Mexico\n| 1987\n| 353rev; iii (cultural)\n| Chaco Canyon was a major center of the Ancestral Puebloans and was occupied between 850 and 1250, with the peak between about 1020 and 1110. Living in a harsh environment, the highly organized society constructed monumental structures, \"great houses\", that had residential, storage, and ceremonial functions. Based on the size, it was likely a regional center of the Four Corners area. The great kiva at Chetro Ketl is pictured. The World Heritage Site also includes the ruins at the Aztec Ruins National Monument and some smaller sites.\n|-\n! scope=\"row\" | Hawaii Volcanoes National Park\n|\n| Hawaii\n| 1987\n| 409; viii (natural)\n| The park on the island of Hawaii is home to Kīlauea and Mauna Loa, two of the most active and among the best studied volcanoes in the world. Mauna Loa reaches  above the sea level, but measured from the ocean floor, it is the world's greatest volcanic mass. The landscape of the park is being constantly shaped and changed by the frequent volcanic eruptions. The park is home to rare bird species and a forest of giant ferns. A lava flow is pictured.\n|-\n! scope=\"row\" | Monticello and the University of Virginia in Charlottesville\n|\n| Virginia\n| 1987\n| 442bis; i, iv, vi (cultural)\n| Monticello (built between 1769 and 1809, pictured) was designed by Thomas Jefferson, third President of the United States and author of the Declaration of Independence, as his plantation home. Jefferson also designed (1817–26) the early buildings that made up the University of Virginia in Charlottesville, based on his idea of an ideal \"academical village\". The Rotunda is modeled after the Pantheon in Rome. The buildings are prominent examples of neoclassical architecture.\n|-\n! scope=\"row\" | Taos Pueblo\n|\n| New Mexico\n| 1992\n| 492; iv (cultural)\n| Taos Pueblo is the largest of the Pueblos established along the Rio Grande and its tributaries in the late 13th and early 14th centuries. It has been continuously inhabited since and is an important example of a culture retaining most of its Pre-Columbian traditions. The settlement consists of two multi-story adobe buildings, ceremonial kivas, a Catholic church, and ruins of previous buildings.\n|-\n! scope=\"row\" | Carlsbad Caverns National Park\n|\n| New Mexico\n| 1995\n| 721; vii, viii (natural)\n| The park contains over 100 karst caves, including Carlsbad Caverns (interior pictured) and Lechuguilla Cave. The latter exhibits rare and unique speleothems, including those made of gypsum. Formations also include helictites, calcite structures, and biothems, the formation of which is assisted by bacteria. The caves formed in the Capitan Reef complex during the Permian period, thus allowing researchers to study the ancient reef both from inside and from the exposed parts in the canyon outside.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Waterton-Glacier International Peace Park\n|\n| Montana\n| 1995\n| 354rev; vii, ix (natural)\n| This site comprises the Waterton Lakes National Park in Canada and the Glacier National Park in the US. Both parks are known for their outstanding scenic beauty due to mountains and glacial landforms. The park straddles the Continental Divide and includes the Triple Divide Peak. The mountains meet the prairie without intervening foothills and the geography allowed the animal and plant species typical of Pacific Northwest to spread inland. This resulted in a high number of animal and plant species present on a small area. Saint Mary Lake is pictured.\n|-\n! scope=\"row\" | Papahānaumokuākea\n|\n| Hawaii and United States Minor Outlying Islands\n| 2010\n| 1326; iii, vi, viii, ix, x (mixed)\n| Papahānaumokuākea, the world's largest marine protected area, is located west of the main Hawaiian Islands. It stretches over some  and covers a number of small islands, atolls, and seamounts, together with the surrounding ocean. They illustrate the progression of the Hawaii hotspot. The terrestrial and marine habitats are home to numerous bird, fish, seal, coral, and plant species, with many of them endemic. The islands are regarded with traditional significance for living Native Hawaiian culture, with archaeological sites in the islands of Nīhoa and Makumanamana dating before the European contact. Heterocentrotus mamillatus, a sea urchin, is pictured.\n|-\n! scope=\"row\" | Monumental Earthworks of Poverty Point\n|\n| Louisiana\n| 2014\n| 1435; iii (cultural)\n| The vast earthen complex at Poverty Point was constructed between 1700 and 1100 BCE, during the Late Archaic Period. It was created by a foraging society of fishermen-hunter-gatherers, instead of a settled agricultural society. The complex consists of semi-elliptical ridges with a central plaza, and several mounds. It was used for residential and ceremonial purposes. It was also a center of a vast trade network, extending hundreds of kilometers to supply stone and minerals. This level of earthen construction was not surpassed in North America for another 2,000 years.\n|-\n! scope=\"row\" | San Antonio Missions\n|\n| Texas\n| 2015\n| 1466; ii (cultural)\n| The site comprises five frontier mission complexes, constructed in the 18th century by Spanish Franciscan missionaries, as well as a nearby ranch. The missions were built along the San Antonio River in order to spread religion, to colonize the area, and to defend the frontier. They demonstrate the cultural interactions between the Spanish and the Coahuiltecan and other hunter-gatherer groups, who became settled agriculturalists within the time of one generation. The decorative elements in the churches represent a blend of Catholic and indigenous motifs. Mission Espada is pictured.\n|-\n! scope=\"row\" | The 20th-Century Architecture of Frank Lloyd Wright\n|\n| Arizona, California, Illinois, New York, Pennsylvania, Wisconsin\n| 2019\n| 1496rev; ii (cultural)\n| This site comprises eight buildings designed by architect Frank Lloyd Wright in the first half of the 20th century. Wright developed the concept of \"organic architecture\", the architecture that responds to the setting and the needs of the users. His style was marked by the novel uses of materials such as steel and concrete. The buildings listed include residential buildings (Fallingwater pictured), a church, and the Solomon R. Guggenheim Museum. Wright's work influenced architects worldwide.\n|-\n! scope=\"row\" | Hopewell Ceremonial Earthworks\n|\n| Ohio\n| 2023\n| 1689; i, iii (cultural)\n| The site comprises a series of features of the Hopewell culture from the Woodland period of the first millennium CE. They constructed large-scale ceremonial earthworks, such as mounds and walls in geometric designs. Fort Ancient is an example of a hilltop fort. Hopewell Culture National Historical Park comprises five sites (Mound City with more than 30 mounds pictured) with walls in shapes of squares and circles. The Newark Earthworks contain some large enclosures. Excavations at the sites uncovered several finely crafted objects from materials that were obtained by travel to areas as far as the Yellowstone basin.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Moravian Church Settlements\n|\n| Pennsylvania\n| 2024\n| 1468bis; iii, iv (cultural)\n| The settlements of the Moravian Church, a Protestant denomination, from the second half of the 18th century are planned cities, reflecting the egalitarian philosophy of the community. They share similar urban layouts, including open and green spaces, a congregational building, cemetery, sanctuary, and houses for communal living, separated by age, gender, and marital status. Christiansfeld in Denmark has been listed as a World Heritage Site in 2015. The site was extended in 2024 to include the Historic Moravian Bethlehem District (the tannery building pictured) in the United States, Herrnhut in Germany, and Gracehill in the United Kingdom.\n|-\n|}\nTentative list\nIn addition to sites inscribed on the World Heritage List, member states can maintain a list of tentative sites that they may consider for nomination. Nominations for the World Heritage List are only accepted if the site was previously listed on the tentative list. The United States lists 17 properties on its tentative list.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (state)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" | UNESCO criteria\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" | Civil Rights Movement Sites\n|\n| Alabama\n| 2008\n| vi (cultural)\n| The site comprises three African-American churches that played a role in the civil rights movement, a political movement to abolish institutional racial segregation, discrimination, and disenfranchisement throughout the United States. The sites illustrate the struggle for non-violent social change. The listed churches are the Dexter Avenue Baptist Church in Montgomery and two churches in Birmingham: Bethel Baptist Church and the 16th Street Baptist Church (pictured). The latter was partially rebuilt after the 1963 bombing.\n|-\n! scope=\"row\" | Dayton Aviation Sites\n|\n| Ohio\n| 2008\n| ii (cultural)\n| In 1904 and 1905, the Wright brothers tested a series of early airplanes, including the  Wright Flyer III, the world's first practical airplane. The nomination comprises the following sites in Dayton and the surrounding area related to early aviation: Huffman Prairie, the flying field (pictured with one of the early flights); the Wright Cycle Company where the brothers conducted early experiments; the Wright Hall that houses the first airplane; and Hawthorn Hill, the residence of Orville Wright.\n|-\n! scope=\"row\" | Thomas Jefferson Buildings\n|\n| Virginia\n| 2008\n| iii, vi (cultural)\n| This is a proposed extension to the Monticello and the University of Virginia in Charlottesville site, with two buildings designed by Thomas Jefferson. The Poplar Forest, a plantation house in Bedford County, Virginia, was inspired by the architecture of Andrea Palladio. The Virginia State Capitol in Richmond (pictured) was inspired by the Maison carrée in Nîmes, France. As an architect, Jefferson was mostly interested in buildings with domestic, educational, and governmental functions.\n|-\n! scope=\"row\" | Mount Vernon\n|\n| Virginia\n| 2008\n| iv (cultural)\n| Mount Vernon is a former plantation and home of George Washington, the first president of the United States. The property comprises 16 structures, including the mansion (pictured), houses for slaves, stables, and storage facilities. The complex represents a well-preserved cultural landscape of the 18th-century American South, inspired by English models.\n|-\n! scope=\"row\" | Serpent Mound\n|\n| Ohio\n| 2008\n| i, iii, iv (cultural)\n| The Serpent Mound is a large effigy mound in shape of a snake that was built around 1120 CE by the Fort Ancient culture. The structure is  long and up to  tall. It is the world's largest preserved prehistoric mound of that type, and is representative of the mounds built by different cultures of the Eastern United States. The complex also includes three burial sites and some remains of habitation sites.\n|-\n! scope=\"row\" | Okefenokee National Wildlife Refuge\n|\n| Georgia\n| 2008\n| viii, ix, x (natural)\n| The wildlife refuge covers most of the Okefenokee Swamp, a large wetland that is also home to undisturbed peat deposits. The area is rich in plant and animal species, including up to 1000 species of moths. As opposed to wetlands that occur in river deltas, Okefenokee is instead the source of two rivers, which means it avoids most disturbances related to water flow.\n|-\n! scope=\"row\" | Petrified Forest National Park\n|\n| Arizona\n| 2008\n| vii, viii (natural)\n| The park, located in the southern Colorado Plateau, is rich in fossil remains from the Late Triassic. There are assemblages of petrified trees, appearing at different stratigraphic levels, which allows paleontologists to study the ecosystem changes of that time. There are also remains of animals, including early dinosaurs.\n|-\n! scope=\"row\" | White Sands National Monument\n|\n| New Mexico\n| 2008\n| vii, viii (natural)\n| White Sands is a large gypsum desert. It is the world's largest and best protected surface gypsum deposit, as those deposits have been typically heavily mined in other places. The area supports several endemic animal and plant species that have adapted to living in a harsh environment.\n|-\n! scope=\"row\" | Brooklyn Bridge\n|\n| New York\n| 2017\n| ii, iv (cultural)\n| The Brooklyn Bridge is a cable-stayed suspension bridge that connects the New York City boroughs of Manhattan and Brooklyn. It was completed in 1883 and represents a milestone in construction of large bridges, with the use of novel materials and technologies, including steel cables and pneumatic caissons. The bridge is one of the symbols of the city and a monument to the development and construction in the second half of the 19th century.\n|-\n! scope=\"row\" | Ellis Island\n|\n| New York, New Jersey\n| 2017\n| iv (cultural)\n| Ellis Island is a small island in New York Harbor that served as the main entry point for millions of voluntary immigrants, mostly from Europe, entering the United States in the second half of 19th and early 20th century. The Main Building now houses the museum of immigration. Other buildings in the complex include the kitchen and laundry building, the bakery and carpentry shop, the baggage and dormitory building, the main hospital, and the contagious disease complex.\n|-\n! scope=\"row\" | Central Park\n|\n| New York\n| 2017\n| i, ii, iv (cultural)\n| Central Park is a large urban park in the middle of Manhattan. It was designed by landscape architects Frederick Law Olmsted and Calvert Vaux and constructed between 1858 and 1873. The park illustrates the beginning of the movement at the turn of the 20th century to provide access to parks to people living in rapidly expanding and industrializing cities. The design of the park made use of the underlying topography, with wetlands and large rock outcrops, transforming it into a composition of meadows, lakes, and woods. There are also several decorative elements, such as arches, bridges, pavilions, and a castle. The Pond is pictured.\n|-\n! scope=\"row\" | Early Chicago Skyscrapers\n|\n| Illinois\n| 2017\n| i, iv (cultural)\n| This nomination comprises nine buildings in the  Loop district of Chicago. They were constructed in the last 20 years of the 19th century and represent the first generation of \"skyscrapers\", high-rise buildings reaching up to 20 stories. Construction of these buildings employed novel approaches and technologies, such as the use of steel frames, elevators, electric lights, and terracotta fireproofing. The architects developed a new aesthetic for the exterior of this new type of buildings. The skyscrapers listed are the Auditorium Building (pictured), Second Leiter Building, Marquette Building, Rookery Building, Monadnock Building, Old Colony Building, Fisher Building, Schlesinger & Mayer Building, and Ludington Building.\n|-\n! scope=\"row\" | Pacific Remote Islands Marine National Monument\n|\n| United States Minor Outlying Islands\n| 2017\n| vii, viii, x (natural)\n| This nomination comprises seven islands or atolls south of the Hawaiian Islands, together with the surrounding ocean. They are home to pristine coral reefs and provide home to seabirds, fish, whales, crustaceans, and other animal groups. Numerous seamounts provide habitat for deepwater corals. A green sea turtle at Palmyra Atoll is pictured.\n|-\n! scope=\"row\" | California Current Conservation Complex\n|\n| California\n| 2017\n| vii, viii, ix, x (natural)\n| The California Current flows along the coast of California. Strong upwelling brings nutrient-rich waters to the surface, supporting an extremely productive marine ecosystem. The nomination comprises six protected areas along the California coast: Cordell Bank, Greater Farallones, and Monterey Bay National Marine Sanctuaries; and the marine waters and certain coastal areas of the California Coastal National Monument, Farallon Islands (pictured), and Point Reyes National Seashore/Golden Gate National Recreation Area. These areas have a plethora of habitats, including kelp forests, seamounts, offshore canyons, rocky shores, islands, and islets. Animals present include several species of whales and sea turtles, California sea otter, and great white shark.\n|-\n! scope=\"row\" | Marianas Trench Marine National Monument\n|\n| Northern Mariana Islands\n| 2017\n| viii, ix, x (natural)\n| This nomination comprises parts of the Mariana Trench with Sirena Deep, the world's second deepest point at about , 21 submarine volcanic sites and surrounding waters, and three of the northernmost Mariana Islands. This is the area where the Pacific Plate is subducted (i.e., thrust) beneath the smaller Mariana Plate, creating different geological formations, including a mud volcano, volcanoes that emit liquid , and hydrothermal vents. The islands and atolls are home to coral reefs with rich ecosystems while the Trench is home to many unusual and still undiscovered species. In some areas, communities that are based on photosynthesis and chemosynthesis coexist.\n|-\n! scope=\"row\" | Marine Protected Areas of American Samoa\n|\n| American Samoa\n| 2017\n| vii, ix, x (natural)\n| This nomination comprises the National Marine Sanctuary of American Samoa and the Rose Atoll Marine National Monument with the Rose Atoll National Wildlife Refuge. The area contains pristine tropical coral reefs which support high biodiversity. Some of the corals have demonstrated resilience to coral bleaching. There are seamounts and a hydrothermal vent which support communities of deep-sea organisms. Rose Atoll (pictured) is an important refuge for giant clams.\n|-\n! scope=\"row\" | Big Bend National Park\n|\n| Texas\n| 2017\n| viii, ix (natural)\n| The park comprises parts of the Chihuahuan Desert, mountains, and the area around the Rio Grande (a view at the Santa Elena Canyon pictured). It is home to desert flora and fauna, with cooler and wetter mountains acting like \"sky islands\" which are covered by relic forest of trees such as Arizona pine, Douglas fir, and Arizona cypress. The area is also rich in fossils from the past 130 million years. The Cretaceous–Paleogene boundary is visible in the strata, and furthermore, evidence of the tsunami caused by the Chicxulub impactor. The most famous fossil found in the park is the Quetzalcoatlus, the largest discovered pterosaur.\n|-\n|}\nSee also\n* Tourism in the United States\nNotes\nReferences\nExternal links\n* [https://www.nps.gov/subjects/internationalcooperation/worldheritage.htm World Heritage in the United States - U.S. National Park Service]"
    }
  ]
}