{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1958__disambig_1\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1958.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland.  For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign.  Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\".  Acts passed from 1963 onwards are simply cited by calendar year and chapter number.\n6 & 7 Eliz. 2\nContinuing the third session of the 41st Parliament of the United Kingdom, which met from 5 November 1957 until 23 October 1958.\nPublic general acts\n}}\n|  and in connection therewith, to repeal the duties of customs chargeable under or by virtue of that Act and of certain other enactments and make general provision for the purpose of customs duties as to Commonwealth preference and as to produce of the sea, and for purposes connected with the matters aforesaid.}}\n|  }}\n|  }}\n|  }}\n|  by making provision in relation to the Federation of Rhodesia and Nyasaland and to Ghana, by extending the provisions for registering persons as citizens of the United Kingdom and Colonies, by extending and providing for the discharge of the functions in Commonwealth countries of High Commissioners for Her Majesty's Government in the United Kingdom, and for purposes connected therewith.}}\n|  }}\n|  and to amend section thirteen of that Act in respect of the reports and accounts to be laid before Parliament.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  to enable laws for corresponding purposes to be passed by the Parliament of Northern Ireland, and for purposes connected therewith.|note4= }}\n|  }}\n| |note4= }}\n|  }}\n|\n|  so as to permit the use of amber coloured reflectors on the pedals of bicycles and tricycles.|note4= }}\n|\n|\n|  }}\n| |note4= }}\n|  by increasing the limit on the amount of insurances on the life of a parent or grandparent.|note4= }}\n|  }}\n|\n|\n|\n|  }}\n|  as regards registration under that Act and as regards the provision by local authorities of employment or other work under special conditions.}}\n|  }}\n|  }}\n|\n|  relating to the ascertainment of annual value for the purposes of drainage rates; and for purposes connected therewith.}}\n|\n|  to make provision for the review of committals to prison by magistrates' courts for failure to comply with maintenance orders; to enable Orders in Council under section twelve of the Maintenance Orders (Facilities for Enforcement) Act, 1920, to be revoked or varied; and for purposes connected with the matters aforesaid.}}\n|\n|  for reducing unemployment in localities suffering from a high rate of unemployment.|note4= }}\n|  }}\n|  and the Animals Act, 1948. }}\n|  and the provisions of the Copyright Act, 1956, amending it.|note4= }}\n|  section one hundred and seventeen of the Companies Act, 1947, and so much of the Companies Act, 1948, as relates to the enactments aforesaid.}}\n|\n|  }}\n|  for the purpose of increasing the maximum penalty for threatening, abusive or insulting words or behaviour in any thoroughfare or public place.|note4= }}\n|  }}\n|\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|  relating to the experience required for full registration and to applications for provisional registration, and of the First Schedule to that Act relating to fees, expenses and allowances.|note4= }}\n|  }}\n|  to authorise the payment of Exchequer grants in aid of the expenses of the administrative trustees under that deed, as amended; and for purposes connected with the matters aforesaid.}}\n|\n|  and section two of the Merchant Shipping (Liability of Shipowners and others) Act 1900; and for purposes connected therewith.}}\n|\n|  to lend money to local authorities; to provide for increase of the fees payable in Scotland under certain enactments relating to marriage and to registration of births, deaths and marriages; and for purposes connected with the matters aforesaid.}}\n|\n|\n|  }}\n|  and to provide in certain cases for suspending for a limited period the execution of any order made in such proceedings; to regulate the terms and conditions as to rent and other matters to be applied in cases where possession of such dwelling-houses is retained pending the recovery of possession; and for purposes connected with the matters aforesaid.}}\n|\n|\n|  the Agricultural Holdings Act, 1948, the Agriculture (Scotland) Act, 1948, and the Agricultural Holdings (Scotland) Act, 1949; to require the landlord of an agricultural holding in certain cases to provide, repair or alter fixed equipment on the holding; to amend Part II of the Landlord and Tenant Act, 1954, as to tenancies of agricultural land excluded therefrom; to amend the Schedule to the Corn Production Acts (Repeal) Act, 1921, and section twenty-one of the Hill Farming Act, 1946; and for purposes connected with the matters aforesaid.}}\n| |note4= }}\n}}\nLocal acts\nrelating to the Forth Road Bridge.|po1=Forth Road Bridge Order 1958|Provisional Order to authorise the Forth Road Bridge Joint Board to acquire additional lands and to construct further works to repeal the provisions of the Forth Road Bridge Orders 1947 to 1954 relative to the financing of the undertakings of the said board and to enact new provisions with respect thereto and for other purposes.}}\n|\n|  }}\n|\n| |po1=Scheme for the Application or Management of the following Charity:—The Consolidated General Almshouse Charities of Reading comprised in a Scheme confirmed by the Act 24 and 25 Vict. c. 23 and in Schemes of the Charity Commissioners of the 27th August 1888 and the 28th February 1899;The Charity of Thomas Barkshire, founded by will proved in the Principal Registry on the 23rd November 1880, for the inmates of the almshouses under the control of the Trustees of the Municipal (General) Charities;The Charity of Thomas Cooke, founded by second codicil to will proved with three codicils thereto in the Prerogative Court of Canterbury in November 1811, for the almshouses founded by John Webb;The Charity of Edward Simeon for the Obelisk in the Market Place, founded by gift on or about the 7th January 1805 and comprised in a Scheme of the said Commissioners of the 2nd January 1912;The Charity of Martin Hope Sutton, founded by first codicil to will proved with two codicils thereto in the Principal Registry on the 19th November 1901;The Charity of William Vine, founded by will proved at Oxford on the 11th January 1904;all of which Charities are together known as the Municipal (General) Charities;The Consolidated Church Almshouse Charities of Reading, comprised in the above-mentioned Scheme confirmed by the Act 24 and 25 Vict. c. 23 and in a Scheme of the said Commissions of the 2nd March 1915, being one of the Municipal (Church) Charities.|po1short=n}}\n| |po1short=n}}\n|  |po1=Scheme for the application or management of the following charity:—The Charity known as The St. James's Dwellings, in the Ancient Parish of St. James, in the City of Westminster, regulated by a Scheme of the High Court of Justice (Chancery Division) of the 3rd April 1885 as affected or supplemented by the City of Westminster (St. James) Scheme, 1901, and a Scheme of the Charity Commissioners of the 4th November 1932.|po1short=n}}\n|  }}\n|\n|  consequent upon such assumption and for other purposes incidental thereto.}}\n|\n|  relating to Margate.|note4= |po1=Margate Pier and Harbour Order 1958|Provisional Order to authorise the Company of Proprietors of the Margate Pier and Harbour to levy rates for the use of any part of their high-water landing pier or jetty to authorise the Company to operate thereon a railway and services of vehicles for carrying passengers and to charge for the use thereof to reduce the number of directors of the Company to amend the provisions as to general assemblies of the Company and for other purposes.}}\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|  relating to Bradford Corporation trolley vehicles.|po1=Bradford Corporation (Trolley Vehicles) Order 1958|}}\n|  relating to Maidstone Corporation trolley vehicles.|po1=Maidstone Corporation (Trolley Vehicles) Order 1958|Provisional Order authorising the mayor aldermen and burgesses of the borough of Maidstone to maintain and use trolley vehicles upon a route in the borough of Maidstone.}}\n|  relating to Great Yarmouth.|po1=Great Yarmouth New Britannia Pier Order 1958|Provisional Order to repeal and amend certain enactments relating to the Great Yarmouth New Britannia Pier Company and for other purposes.}}\n|  relating to King's Lynn Conservancy.}}\n|\n|\n|\n|  }}\n|  }}\n|\n|\n|\n|  relating to Sheerness.|note4= |po1=Sheerness Pier Order 1958|Provisional Order to provide for the vesting in William Hurst Limited of the Sheerness Pier to confer powers on the said Company with reference thereto and the maintenance management and improvement thereof and for other purposes.}}\n|\n|  }}\n|\n|\n|\n|  and for other purposes.}}\n|\n|\n|\n}}\nSources\n*  |title=The Public General Acts and Church Assembly Measures 1958 |date=1959 |location=London |publisher=Her Majesty's Stationery Office |page=1-1107 |via=Google Books}}\n*\n*  |pages=1136-1149 |isbn=978-0-11-840096-1 |via=Google Books}}\n*\n*\n*\n7 & 8 Eliz. 2\nThe fourth session of the 41st Parliament of the United Kingdom, which met from 28 October 1958 until 18 September 1959.\nPublic general acts\n}}\n|\n|  }}\n|  }}\n|  }}\n|\n| or the Manoeuvres Act 1958|public|7|18-12-1958|repealed=n|maintained=y|An Act to consolidate certain enactments relating to defence Manœuvres.}}\n|\n| |note4= }}\n}}\nLocal acts\nrelating to the Church of Scotland Trust.}}\n|  relating to North of Scotland Electricity.|po1=North of Scotland Electricity Order 1958|Provisional Order to consolidate certain local enactments applying to the North of Scotland Hydro-Electric Board with such amendments as are required to facilitate consolidation and secure a uniform statutory code applicable throughout the North of Scotland District to confer further powers on the said Board and for other purposes.}}\n|  relating to Society in Scotland for Propagating Christian Knowledge.|po1=Society in Scotland for Propagating Christian Knowledge Order 1958|Provisional Order to extend the powers of the directors of the Society in Scotland for Propagating Christian Knowledge with respect to the investment of the funds belonging to or held by them and for other purposes.}}\n|  relating to Glasgow Corporation|po1=Glasgow Corporation Order 1958|Provisional Order to authorise the corporation of the city of Glasgow to borrow further moneys for the purposes of their tramway undertaking to amend the provisions of the Glasgow Corporation Superannuation Scheme 1955 with respect to the investment of the fund maintained by the said Corporation in pursuance of the said scheme and for other purposes.}}\n|  relating to Edinburgh Corporation|po1=Edinburgh Corporation Order 1958|Provisional Order to consolidate with amendments the Acts and Orders of or relating to the Corporation of the city of Edinburgh with respect to the general administration of the city and the water and transport and certain other undertakings and services of the said Corporation and finance of the city and to confer further powers on them with respect thereto and for other purposes.}}\n|\n|\n}}\nSources\n*  |title=The Public General Acts and Church Assembly Measures 1958 |date=1959 |location=London |publisher=Her Majesty's Stationery Office |page=1108-1188 |via=Google Books}}\n*\n*  |pages=1149-1151 |isbn=978-0-11-840096-1 |via=Google Books}}\n*\n*\n*\nSee also\n*List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}