{
  "content": [
    {
      "type": "text",
      "text": "# List of international presidential trips made by Ilir Meta\n\nSecretary General Roberto Montella in Copenhagen, 8 April 2019.]]\nThis is a list of official trips made by Ilir Meta as the 7th President of the Republic of Albania.\n2017\nThe following international trips were made by President Ilir Meta in 2017:\n{| class=\"wikitable sortable outercollapse\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=120|Country\n! width=100|Areas visited\n! width=90|Date\n! width=550|Details\n|-\n| Italy\n|Rome\n|\n|President Meta travelled to Italy on his first state visit to the country as President, upon the invitation of President of Italy, Sergio Mattarella. He also met the President of the Italian Chamber of Deputies, Laura Boldrini and members of the Arbëresh community.\n|-\n| Macedonia\n|Skopje\n|\n|President Meta travelled to Macedonia upon the invitation of President of Macedonia, Gjorge Ivanov.\n|-\n| France\n|Marseille\n|\n|President Meta travelled to Marseille in France where he meat with regional leaders of the Provence-Alpes-Côte d'Azur upon the invitation of Renaud Muselier. He also had a meeting with Prince Albert of Monaco.\n|}\n2018\nThe following international trips were made by President Ilir Meta in 2018:\n{| class=\"wikitable sortable outercollapse\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=120|Country\n! width=100|Areas visited\n! width=90|Date\n! width=550|Details\n|-\n| Croatia\n|Zagreb\n|\n|President Meta travelled to Croatia to meet with his counterpart Kolinda Grabar-Kitarović.\n|-\n| Malta\n|Valletta\n|\n|President Meta travelled to Malta to meet with his counterpart Marie-Louise Coleiro Preca.\n|-\n| Macedonia\n|Skopje, Struga\n|\n|President Meta travelled to Macedonia to attend the Brdo-Brijuni Process Summit. During his 3-day visit, he also visited members of the Albanian community living in Skopje and Struga.\n|-\n| Malta\n|Valletta\n|\n|President Meta travelled to Malta to meet with his counterpart Marie-Louise Coleiro Preca and also to attend the Business Forum focused on Malta-Albania economical relations.\n|-\n| Kosovo\n|Prizren\n|\n|President Meta traveled to Kosovo to attend celebrations regarding the 140th Anniversary of the national League of Prizren.\n|-\n| Germany\n|Berlin\n|\n|President Meta traveled to Berlin to meet with he Chairman of the Bundestag Wolfgang Schäuble.\n|-\n| Hungary\n|Budapest\n|\n|President Meta held a state visit in Hungary, where he met with the Prime Minister of Hungary Viktor Orbán and other state officials.\n|-\n| San Marino\n|San Marino\n|\n|President Meta held a state visit in San Marino to meet state officials. During this visit, it was announced that San Marino would soon open an embassy in Tirana to further promote bilateral relations.\n|-\n| United States\n|New York City\n|\n|United Nations General Assembly\n|-\n| France\n|Paris\n|\n|Attended commemorations of the Armistice Day centenary and the 2018 Paris Peace Forum.\n|}\n2019\nThe following international trips were made by President Ilir Meta in 2019:\n{| class=\"wikitable sortable outercollapse\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=120|Country\n! width=100|Areas visited\n! width=90|Date\n! width=550|Details\n|-\n|\n|Copenhagen\n|\n|President Meta travelled to meet with the Bureau of the OSCE Parliamentary Assembly.\n|-\n|\n|Skopje\n|\n|President Meta traveled to Skopje due to the inauguration of Stevo Pendarovski as President of North Macedonia.\n|-.\n|\n|Berlin\n|\n|President Meta travelled to attend the 24th International Berlin Gathering.\n|-\n| Bosnia and Herzegovina\n|Sarajevo\n|\n|President Meta travelled to attend the SEECP Summit.\n|}\nSee also\n*Foreign relations of Albania\n*Politics of Albania\nReferences"
    }
  ]
}