{
  "content": [
    {
      "type": "text",
      "text": "# List of fictional presidents of the United States (N–R)\n\nThe following is a list of fictional presidents of the United States, N through R.\nN\nPresident Elaine Nakamura\n* President in: Time Trax (TV series)\n* By the year 2093 she is mentioned as one of the great presidents along with Abraham Lincoln and John Shaw.\nPresident Gary Nance\n* President in: Dave (movie, 1993)\n* Originally the Vice President to President William Harrison Mitchell.\n* After Mitchell suffers a heart attack and is left comatose, his lookalike Dave Kovic is convinced by White House Chief of Staff Bob Alexander to continue impersonating him, claiming that Nance was mentally unhinged. Nance was scapegoated for financial crimes relating to the First Liberty Savings and Loan by Alexander as part of a plot to become President, hoping that Nance would be forced out of office and that he would be nominated as his successor (whereupon Kovic would fake a stroke and allow Alexander to succeed 'Mitchell' as President).\n* Nance is sent on a twelve-nation goodwill tour of Africa (including to Togo and Burundi) to keep him away from Washington D.C. while the scandal developed.\n* After Alexander implicates Mitchell in the First Liberty scandal as revenge for Kovic firing him, Nance is exonerated of his alleged involvement in the scandal after Kovic presents evidence (provided by White House Communications Director Alan Reed) demonstrating Mitchell's and Alexander's involvement to a joint session of Congress. Convinced of Nance's honourable ethics and morals, Kovic fakes another stroke and switches places with the still-comatose Mitchell to allow Nance to succeed to the presidency and to return to his normal life.\n* After serving for five months as acting president, Nance is inaugurated as the forty-fifth President upon Mitchell's death. Reed possibly becomes either his vice president or chief of staff. To preserve and honor Mitchell's legacy, Nance champions and succeeds in passing into law a job guarantee bill proposed by Kovic.\n* Left a career as a shoe salesmen to become a city councilman, having operated on a shoestring budget with his wife acting as his campaign manager.\n* Played by: Ben Kingsley\nPresident Napper\n* President in: Epitaph Road (novel) by David Patneaude\n* He is removed from office in a one-day impeachment because of the military's faulty intelligence on a nuclear fallout in Los Angeles.\n* Vice President James Corson assumes the presidency.\nPresident Julian Navarro\n* President in: The Brink (TV series)\n* He is the first Latino president.\n* In office a coup takes place in Pakistan, requires him to utilise a low-level foreign service officer to ascertain more information.\n* Agrees to defend Israel should the radical-controlled Pakistan decide to use nuclear weapons against them.\n* Quickly dismisses the efforts of Secretary of State Walter Larson's diplomatic approach to avoiding international conflict, and starts to side with the hawkish Secretary of Defense Pierce Gray, who wants to bomb Pakistani nuclear sites.\n* Evacuated from the White House due to fears it may become a military target, he is taken to a secret underground bunker beneath a Neiman Marcus department store.\n* Takes most of the credit for the outcome of Operation Infinite Wisdom,  Larsons work on diffusing the conflict between Pakistan, Israel, Russia, France, Saudi Arabia, China and Iran.\n* Played by: Esai Morales\n* Political Party: Unspecified\nPresident Jack Neil\n* President in: Murder at 1600 (movie, 1997)\n* Son is framed for murder to force his resignation for making military decisions his National Security Advisor does not like. The president has an (unproven) sexual reputation and has one son, Kyle.\n* Ambidextrous, writes with his right hand, but swings (playing baseball and golf) with his left. Upon being told of his son's framing, punches out NSA Alvin Jordan with his right fist.\n* Saved from assassination by NSA Jordan when Secret Service Agent Nina Chance jumps in front him, despite being handcuffed (she survives, Neil's guards kill Jordan).\n* Played by: Ronny Cox\nPresident Nelson\n* President in: Scorcher (movie, 2002)\n* Played by: Rutger Hauer\nPresident Victor K. Neuman\n* President in: The Boys comics series\n* Formerly the Vice President under Robert \"Dakota Bob\" Shaefer, for which he earned the nickname \"Vic the Veep\", he succeeded him in Issue #60 after accidentally releasing a wolverine (thinking it was his dog) which killed him. After becoming President, a Vought-American executive directs his policymaking, namely the de facto shutdown of all CIA operations.\n* Formerly a Vought-American CEO, Vought-American intended to install Neuman as President to permit the inclusion of superhumans in the US military by assassinating Shaefer, believing that Neuman could never win an election in his own right.\n* During the September 11 attacks, during which Shaefer ordered all but one of the hijacked planes to be shot down, Neuman serves as Acting President after Shaefer is knocked unconscious with a fire extinguisher (which no-one witnessed). Neuman orders the Vought-American superhero team The Seven to liberate the last plane, but their failure leads to the destruction of the Brooklyn Bridge.\n* In Issue #65, The Homelander leads an ultimately unsuccessful superhuman coup against the United States, leading to the violent death of Neuman. After the crisis is resolved, Neuman is succeeded as president by then real-life Democratic Speaker of the House Nancy Pelosi in Issue #66 for the remainder of the term.\n* According to series co-creator Garth Ennis, Neuman is a \"grotesque parody\" of George W. Bush.\n* Party: Republican\n* The live-action television series and its spin-off series Gen V feature a female incarnation of the character Victoria \"Vic\" Neuman, played primarily by Claudia Doumit and modelled after Alexandria Ocasio-Cortez. A House representative and publicly an opponent of Vought International, she is secretly a haemokinetic Supe and the adopted daughter of Vought CEO Stan Edgar, becoming the Director of the Federal Bureau of Superhuman Affairs to manage opposition to Vought. In Season 4, she becomes Vice President-elect after serving as running mate to former Secretary of Defense Robert \"Dakota Bob\" Singer and an unwilling co-conspirator in a plot to install a Supe-supremacist regime with her as president.\nPresident D. Wire Newman\n* President in: The West Wing (TV series)\n* He is the last Democrat to be president before the election of Josiah Bartlet.\n* He serves One presidential term.\n* Spends his Administration propping up the House of Saud to ensure the flow of oil (similar to the Carter Doctrine).\n* Appears alongside Bartlet at Lassiter's funeral.\n* Party: Democratic\n* Played by: James Cromwell\nPresident Newton\n* President in: Spartan (movie, 2004) starring Val Kilmer\n* Daughter Laura is kidnapped by a sex slave ring that does not realize who she really is because her hair is dyed.\n* Presidential advisers decided to fake her death to gain sympathy for his upcoming re-election campaign.\nPresident Nguyen\n* President in: Old Twentieth (novel, 2005) by Joe Haldeman\n* A woman President in 2054, first name unknown (presumably a Vietnamese American, though this is not explicitly stated). Involved in the Immortality War (often known simply as \"The War\"), fought worldwide between the rich who can afford the Becker-Cendrek pills which makethen immune to dying of old age, and the others who can not afford them and violently resent it. As the country is already involved in a murderous second civil war in both 2048 and 2052, it is not clear by which electoral process put her in power. In 2054, President Nguyen leaves Washington, D.C., for a bunker in West Virginia, ahead of the city being sprayed with the Lot 92 biological agent, killing all of its twenty million impoverished inhabitants - a part of the worldwide killing of seven billion people, 97% of humanity, which leaves the planet in the sole possession of the rich \"immortals\".\nPresident LaMonte Nielson\n* President in: Empire (novel) by Orson Scott Card\n* Is speaker of the House when president and vice president are killed by a left-wing terrorist group.\n* Leads the United States in the Second American Civil War.\n* Chooses not to run for his own term, instead opting to re-enter Congress.\n* Party: Republican\nPresident Howard Johnson Nissen\n* President in: Give Me Liberty and Martha Washington Goes to War (comic book series)\n* The former Secretary of Agriculture, he becomes President when President Rexall, the Vice President, and most of the cabinet are assassinated in an explosion. Well-meaning but ineffective, being manipulated by the evil Colonel Moretti who eventually murders him.\nPresident John Milhous Nixon\n* President in: Red Dwarf and Last Human (novels)\n* Implements a policy to control the weather, which backfires, causing the eventual destruction of the sun.\n* Sends Arnold Rimmer's son, Michael McGruder as part of a mission to colonize the Andromeda galaxy.\n* Is a descendant of Richard Nixon and shares his middle name of Milhous.\nPresident Winston Noble\n* President in: Fahrenheit 451\n* Described as extremely charismatic and charming and \"one of the nicest-looking men who ever became president\".\n* President Noble defeats his homely and disheveled opponent, Hubert Hoag, in a landslide. Unlike Hoag, Noble does not pick his nose while on television.\n* President at some point between 1960 and 2049.\n* Society during his presidency revolves around promotions of hedonism, commercialism and anti-intellectualism (the last being enforced by the banning and burning of books). One consequence of such a society is Noble's election based largely on his photogenic appearance and pleasant-sounding name. This society is destroyed in a nuclear war that begins and ends on the same night, the only survivors being groups of exiled intellectuals who memorised books to preserve them.\n* Party: Ins Party\nNone of the above\n* President in: North American Confederacy (novel series) by L. Neil Smith\n* President of the North American Confederacy, a libertarian state encompassing North America which succeeded the United States after a successful Whiskey Rebellion resulted in George Washington being overthrown and executed by firing squad for treason in 1794.\n* Serves as the 24th and 28th president.\n* Presidential term from 1969 to 1973 and from 2001 onwards, meaning that the office of the president was left vacant.\n* The office of the president is effectively abolished upon being elected President for Life in 2008.\n* Party: possibly either Gallatinist (like all other Presidents since 1794) or Independent (the second after George Washington).\nPresident James Norcross\n* President in: Super President\n* He has superpowers.\n* Voiced by: Paul Frees\nPresident Noxin\n* President in: Schrödinger's Cat Trilogy by Robert Anton Wilson\n* One of many presidents in the series.\n* Although he appears in the novel, he is not technically a character, as he is a fictional character in a science fiction novel penned by a Harvard professor named Leary. (He is a clear parody of Richard Nixon, his name being 'Nixon' spelled backwards).\nO\nActing President Douglas Oates\n* President in: Deep Six (novel) by Clive Cussler\n* Secretary of State, who assumes powers and duties of the office after the presidential yacht, the Eagle, goes missing with the president, Vice President Vincent Margolin, Speaker of the House Alan Moran and President of the Senate pro tempore Marcus Larimar on board. He orders a cover-up, with actors playing the president and vice President while he executes power.\nPresident William Harvard Oaks\n* President in: Dead Heat (novel) by Joel C. Rosenberg\n* Is Vice President until 2016 when assumed powers and duties of the president after the president and most of the US Government are killed in nuclear attacks on Seattle, Los Angeles, New York City, and Washington, D.C. He is assassinated two days after taking office.\n* Party: Republican\nPresident Brian O'Brien\n* President in: The Protectors (comic book series)\n* Former masked vigilante known as The Clock.\n* Elected in 1988 as an Independent.\nThe Office of the Other President\n* President in: Avenue 5\n* In the episode \"Let's Play with Matches\", it is revealed that the Office of the Other President is a council comprising legacy CEOs Beth Bezos (Amazon), Dusty Musk (Tesla) and Mike Zuckerburg (RealityWhack, formerly Meta) who ratify the decisions of the President of the United States. It was established in response to the third attack on Congress.\n* TOTOPOTUS was initially willing to provide trillions to fund a rescue mission, later seizing control of Judd Mission Control after an attempt to shorten Avenue 5′s extended journey time backfired. However, they decided to destroy the ship after Herman Judd, the CEO of Avenue 5′s operating company, made public top secret knowledge that Earth was facing a lithium shortage.\n* TOTOPOTUS is aided by a quantum supercomputer, which Head of Judd Mission Control Rav Mulcair had earlier approached for funding for a rescue mission. It had stipulated that in exchange for financial aid, the ship had to dispose of 500 non-essential personnel due to weight concerns (which the crew and passengers hoped to bypass by jettisoning unnecessary weight).\nPresident Desmond Ogilvy\n* President in: My Gal Sunday by Mary Higgins Clark\n* A former U.S. Representative from Wyoming.\n* Is vice president to President Britland.\nPresident Mehdi Ohmshidi\n* President in: Phoenix Rising (novel series) by J.A. Johnstone\n* He is a Muslim, and the first foreign-born president following the repeal of Article Two, Section One of the Constitution.\n* Becomes a dictator and serves as the antagonist of the novels.\nPresident Oliver\n* President in: Independents' Day (movie, 2016)\n* He is killed by Aliens when they destroy the White House.\n* Played by: Kurt Sinclair\nPresident Howard Oliver\n* President in: The Last Ship (TV series) (TV Series) (Season 3)\n* He is the second African American president (as it is implied the incumbent president during the outbreak was Barack Obama).\n* He is the former mayor of St. Louis, where he presides over one of the most effective quarantines during the Red Flu pandemic, saving over 100,000 people.\n* He serves as vice president under President Jeffery Michener, who presides over the reconstruction of the United States after the Red Flu pandemic.\n* After a reporter reveals details regarding President Michener's actions during his time as Secretary of Housing and Urban Development which accidentally aids the spread of the Red Flu, Michener apparently commits suicide (later revealed to be murdered by forces loyal to Shaw and the regional leaders), resulting in Oliver being sworn in as his replacement.\n* He becomes the victim of a coup d'etat masterminded by White House Chief of Staff Allison Shaw, who along with regional leaders across the United States plans to split the country into smaller nations, believing the federal government to be too weak to restore order to post-pandemic America. He is blackmailed into acting as their puppet, as unlike the former president, he still has surviving family members who could be threatened.\n* He is rescued from captivity by sailors from the USS Nathan James, and temporarily operates a government in exile from an office aboard the ship.\n* After the regional leaders and Shaw are either captured or killed, the divided United States Armed Forces are made aware of the illegal and traitorous activities carried out by the leaders, and the vast majority reaffirm their allegiance to Oliver as their commander in chief. President Oliver then makes a televised address to the reunited nation from the recaptured White House in St. Louis.\n* He leaves office some time before the start of Season 5, succeeded by Joshua Reiss.\n* Played by: John Cothran\nPresident Regina Oliver\n* President in: Y: The Last Man (TV Series)\n* Formerly the Secretary of Veterans Affairs under Republican President Ted Campbell, she was considered a 'fringe lunatic' even by members of her own party, being appointed to the relatively minor Cabinet position to appease Campbell's far-right swing voters.\n* Whilst visiting Israel, a cataclysmic event occurs which simultaneously kills all mammals with a Y chromosome (except for amateur escape artist Yorick Brown and his pet monkey Ampersand), decimating the presidential line of succession and leaving Oliver the sole eligible claimant to the presidency (with Secretary of Education Abbott, the only other surviving Cabinet member, being disqualified due to being born in Antigua). However, because she was presumed dead as a result of the cataclysm, Democratic congresswoman and House Intelligence Committee Chair Jennifer Brown (Yorick's mother) instead was elevated to the presidency after being hastily elected Speaker of the House (a position she held for an hour).\n* After emerging from a weeks-long coma, Oliver is reinstated to her position in the Cabinet as surviving government officials opposed and members of a caucus of surviving Republican lawmakers (led by Kimberley Campbell Cunningham, President Campbell's daughter) were apprehensive of elevating the radical Oliver to president, especially in light of rioting, insurrection against state governments, infrastructure failure, shortages and internal displacement in the aftermath of the die-off.\n* Oliver effectively becomes President after Brown is removed from power by the Cabinet and military for keeping Yorick's survival a secret partly to resolve the reproductive crisis, partly to prevent government collapse, involving Yorick's bodyguard Agent 355 killing two helicopter pilots who helped rescue him from New York City and smuggle him out of the Pentagon (interpreted either as being directly ordered by Brown herself or as the actions of a rogue agent).\n* During a raid on the Pentagon led by Beth DeVille (Yorick's girlfriend who turned down his proposal of marriage just before the die-off) to gain control of its amenities, Oliver is taken hostage. Whilst trying to inform the raiders of Yorick's survival in a bid to be released, she is accidentally shot and killed, effectively liquidating the U.S. government.\n* Played by: Jennifer Wigmore\nPresident Patrick O'Malley\n* President in: Night at Camp David (novel, 1965) by Fletcher Knebel\n* He is vice president to president Mark Hollenbeck.\n* He is accused of corruption over the construction of a stadium named in honor of President Kennedy.\n* He becomes president when President Hollenbeck resigns due to mental instability.\nPresident Vincent O'Reilly\n* President in: Summit (novel 1987) by D.M. Thomas\n* Former Movie Actor who meets with the new Soviet Leader.\nPresident Janie Orlean\n* President in: ''Don't Look Up''\n* A female president, who creates the \"Don't look up\" movement in response to an incoming comet while also trying to divert attention from a sex scandal. Eventually, her mishandling of the situation leads to the world being destroyed.\n* Played by: Meryl Streep\nPresident A. Thorton Osgood III\n* President in: Mail to the Chief\n* Played by: Randy Quaid\nPresident Tommy Owens\n* President in: The Essential Man (novel, 1977) by Al Morgan\n* Elected in 1980, and re-elected in 1984.\n* Has a massive stroke just before he is to take the oath of office for a second term on January 20, 1985.\n* His staff organize an attempt to replace him with a lookalike, but the plan fails when the double becomes mentally unstable and is assassinated to cover up the truth.\n* Replaced by corrupt Vice President Carl Kobin.\n* Party: Democratic\nP\nPresident Sonya Paddock\n* President in: Dead Rising 3\n* Is similar in appearance to Sarah Palin, and shares her initials.\n* Married to Alan Paddock and has two daughters.\n* Becomes caught in the midst of a zombie outbreak during an official visit to open a museum in Los Peridios, California.\n* In the disarray caused by the outbreak within the city, President Paddock drops off the grid and becomes uncontactable, resulting in her dictatorial Secretary of Defense General George Hemlock to take over; he introduces strict media censorship and martial law in response to the outbreak.\n* Is later captured by special forces soldiers loyal to Hemlock, who kill her United States Secret Service bodyguards. Hemlock is revealed to be working with infamous bioscientist Marian Mallon, with the two wanting to consolidate their power by utilising a bioweapon derived from the virus to infect all of North America.\n* She is purposely infected and turned into a zombie by being exposed to the virus. Once infected, Hemlock orders his men to film her attacking and infecting a low ranking serviceman on live broadcast, and then shoot her in the head.\n* News broadcasts state she is 54 years old.\nPresident Nathaniel James Page\n* President in: Real Politics (online game) (2004–2008)\n* Former Senate majority leader, elected president after George W. Bush declines to run again. He shocks everyone when he nominates a Democrat as his running mate during the 2004 campaign.\n* Party: Republican\n* Played by: Real politics game admins\nPresident Andrew Palma\n* President in: Geostorm\n* First Hispanic president.\n* A widower, he mentions that his late wife was a passionate and dedicated advocate for environmentalism.\n* Cabinet includes Vice President Miller and Secretary of State Leonard Dekkom.\n* Administration is responsible for overseeing the transfer of control of the Dutch Boy weather controlling satellite network from the United States to a global committee overseen by the United Nations.\n* Campaigning for re-election at the time of the film, with the campaign slogans \"One World\" and \"United We Can\".\n* Whilst attending the Democratic National Convention in Orlando, Palma is subject to an assassination attempt at the hands of Dekkom, whose men take control of Dutch Boy and use it to trigger a superstorm in the area. Dekkom plans to have the storm kill Palma and the rest of the presidential line of succession gathered at the convention, so he can be sworn in as president under the 25th Amendment.\n* Kidnapped and rescued from the plot by Dutch Boy assistant director Max Lawson and Secret Service agent Sarah Wilson. He later activates the biometric kill codes to reboot the Dutch Boy satellites and wipe the virus from their system.\n* Party: Democratic\n* Played by: Andy Garcia\nPresident David Palmer\n* President in: 24 (2001–2005)\n* The first African American president, David Palmer is a native of Maryland. He attended Georgetown University and the University of Maryland and has two children, Keith and Nicole Palmer. Palmer cancels his re-election campaign after his ex-wife is killed in a murder-suicide in 2004.\n* After President Keeler's incapacitation, Vice President Charles Logan is unable to serve as acting president, and Palmer is secretly made Logan's proxy. Palmer is later assassinated by a sniper while working on his memoirs at his brother's penthouse apartment in Los Angeles.\n* Buried at Arlington National Cemetery in Arlington, Virginia\n* Previously served as a United States senator from Maryland, a U.S. congressman from Maryland's 4th congressional district, and a member of the Maryland House of Delegates\n* Services as the 44th President.\n* Party: Democratic\n* Played by: Dennis Haysbert\nPresident Wayne Palmer\n* President in: 24 (2009)\n* Serves only for three-and-a-half months in 2009.\n* The brother of David Palmer, for whom he served as chief of staff and campaign manager.\n* He was previously the Chief Operations Officer of Milliken Enterprises. His affair with the wife of its CEO escalated into the murder-suicide of both her and his brother's ex-wife. This compelled his brother to terminate his campaign and resign the presidency.\n* Injured severely in an assassination attempt and Vice President Noah Daniels becomes acting president. He was briefly taken out of an induced coma in order to rescind a drone strike on a terrorist-held nuclear weapon, but then succumbed to his injuries.\n* Daniels succeeds him soon after and serves out the rest of Palmer's term.  He then loses the election as made clear in 24: Redemption.\n* Served in the United States Marine Corps Reserve\n* Buried at Arlington National Cemetery in Arlington, Virginia\n* Party: Democratic\n* Played by: D.B. Woodside\nPresident Harriet Palmer\n* President in: Out of the Dark (novel, 2010) by David Weber\n* Leads the U.S. government during the invasion of Earth by the extraterrestrial Shongairi. She and her cabinet are killed when the aliens destroy Washington, D.C., with an orbital strike.\nPresident Pangwinn\n* President in: the Simulations Publications Inc. wargame War in the Ice\n* Defeats President Bradley in the 1992 election because of the war in Antarctica.\nPresident Davis Park\n* President in: Van Helsing\n* Elected at some point prior to the start of the series.\n* Has a son, Aaron, and an unnamed wife and daughter.\n* On the day that the Yellowstone supervolcano erupts and blocks out the sun with ash, Park and his family are evacuated from Washington, D.C., to be taken to a bunker. However, while en route, their motorcades are overrun by some of the vampires taking advantage of the loss of sunlight to seize control of the country. Park's wife and daughter are killed, while Park himself is bitten and turned into a vampire. Unable to bring himself to kill his father, Aaron instead keeps him locked up in a cell, with the help of a biker gang acting out of patriotic duty.\n* Four years later, Aaron meets Violet Van Helsing and recruits her help. Using the power of her family's genetics, Violet bites Park and turns him back into a human. While initially resistant to help due to being emotionally broken by his experience, Park eventually uses the Nuclear football to contact allies in the Pentagon and build a resistance movement against Dracula, who had killed and taken on the form of Park's successor, President Archer.\n* After Dracula is defeated and all vampires are made human again, Park is reinstated as president and begins the rebuilding process.\n* Played by: Stephen Lobo\nPresident Jack Parker\n* President in: The Election (novel, 1970)\n* U.S. Senator from Florida running an independent campaign against Republican Pennsylvania governor Nelson Maynard, and Democrat Illinois senator Jimmy Harrington.\n* When none of the candidates win a majority in the Electoral College the House of Representatives elects Parker after he cuts a deal with the governor of California for his State's support.\nPresident Eldon Parker\n* President in: The Oasis Project (novel, 1981) by David Stuart Arthur\n* Once elected, states he will only serve one term, but secretly funds weapons program to create high-tech second generation shuttles and weapons to eliminate population centres worldwide and create a new Pax-Americana.\nPresident Pete Parkin\n* President in: The Prodigal Daughter by Jeffrey Archer\n* Former vice president who agrees to serve only one term to gain the support of Senator Florentyna Kane of Illinois.\n* Due to his being irresponsible and unavailable during a crisis with the Soviet Union, Vice President Florentyna Kane resolves the matter without backing down.\n* President Parkin decides to use the success to seek a second term, and informs Vice President Kane she will not be on the ticket.\n* Dies of a heart attack shortly thereafter.\n* Party: Democratic\nPresident David Payne\n* President in: The Interim\n* Serves eight years with high approval ratings.\n* Clashes with President-Elect Candor over policies regarding a free Taiwan.\n* Party: Republican\nPresident Ambrose \"Bud\" Payton\n* President in: ''The Godfather's Revenge\n* Vice President to President James Shea.\n* Former U.S. senator from Florida.\n* President Payton assumes the office when President Shea is assassinated in 1964.\nPresident Constance Payton\n* President in: State of Affairs (TV series)\n* First female African American president.\n* Serves in the United States Air Force before entering politics.\n* Serves in the Senate before ascending to the presidency, and joins several other senators on an official visit to Kabul, Afghanistan. However, the diplomatic convoy is attacked by terrorists during the visit and results in her son being killed.\n* Married to First Gentleman Marshall Payton, who serves as pro bono counsel for advocacy groups.\n* Played by: Alfre Woodard\nPresident Riley Peacham\n* President in: Boomsday (novel, 2007) by Christopher Buckley\n* Suffers low popularity, but is re-elected to a second term.\nPresident Hunter Peale\n* President in: The Hell Candidate (novel, 1980) by Graham Masterton\n* Senator for Colorado, possessed by the Devil to start global war, exorcised by the Pope.\n* Party: Republican\nPresident Arthur Penn\n* President in: One Knight Only (novel, 2003) by Peter David\n* Sequel to Knight Life\n* Arthur Penn admits to being King Arthur returned; his advisor Merlin circumvents the Fourteenth Amendment by having filed citizenship papers for Arthur in 1787.\nPresident Grace Hagen Penn\n* President in: The Diplomat'' Season 2 and 3.\n* Elected as vice president under President William Rayburn in 2020, Penn is faced with political oblivion when a scandal involving her husband Todd Penn's mismanagement of an endowment is certain to be made public within months.\n* Despite the impending end of her career, Penn nevertheless attempts to resolve the looming strategic dominance of Russia in the Atlantic in the Spring of 2022. She orchestrates a false flag, non-fatal attack on a British naval vessel HMS Courageous with British political strategist Margaret Roylin. The aim was to provide the UK with a unifying national cause to prevent the passage of a Scottish independence referendum, which would've resulted in the US losing a critical naval base.\n* However, the attack goes disastrously wrong, resulting in the deaths of 43 British sailors. Penn institutes measures to cover it up, but US Ambassador to the UK Kate Wyler, Penn's designated successor, learns of her betrayal.\n* When President Rayburn learns of Penn's actions, he is so distressed that he suffers a fatal heart attack, thus elevating Penn to the Presidency in July 2022. As she was in the UK at the time of Rayburn's death, Penn takes the oath of office in U.S. Embassy, London.\n* Penn selects Hal Wyler, Kate's husband, himself a former U.S. Ambassador to Lebanon and Iraq) as her Vice President. In the first month of her administration, with Wyler's help, Penn obtains the previously impossible congressional votes to ratify the UN Law of the Sea Treaty.\n* Penn retains members of Rayburn's cabinet, including Chief of Staff Billie Appiah, who had previously been aware of her treachery and had manufactured Todd's finance scandal as a means to force her resignation.\n* Five months later, when it emerges a defector from the PMC hired to attack the Courageous may leak the truth, Penn meets with Prime Minister Nicol Trowbridge at her home in Amagansett. She lies that it was her predecessor who conspired with Roylin, and asks him to publicly assign full blame to Roylin in exchange for a favourable trade deal. However, during a joint press conference, the Prime Minister blames Rayburn directly. This implication causes global anti-American protests and tensions with the UK.\n* When a Russian B-90 Sarov submarine carrying an experimental Poseidon nuclear weapon sinks 12 miles off the British coast, Trowbridge refuses US assistance and instead approaches China for help in recovering it, risking them obtaining the experimental technology themselves. At a summit at Chequers, Penn convinces Trowbridge to have the two buried under concrete, much like the Runit Dome, but in secret has an Ohio-class submarine recover the Poseidon weapon.\n* Secret Service codename: Arrow\n* Played by: Allison Janney\nPresident Pérez\n* President in: Rendezvous with Rama (novel) by Arthur C. Clarke\n* He is mentioned as having been president some time prior to the novel's setting (2132).\n* A character in the novel does not remember whether it is Pérez or Harry S. Truman who said \"The buck stops here.\"\nPresident Castor Perryman\n* President in: Black Star Rising (novel) by Frederik Pohl\n* Mock-elected in the late 21st century.\nPresident Joyce Peterman\n* President in: Homeward Bound (novel) by Harry Turtledove\n* Part of the Worldwar series.\n* Elected in 2020.\nPresident Nathan Petrelli\n* President in: Heroes\n* In the episode \"Five Years Gone\", Nathan is shown as president of a future dystopian American state. His true identity is shown to be that of Sylar, the serial killer, who has presumably killed Nathan and used Candice Wilmer's power of illusion casting to take on Nathan's appearance.\n* Nathan is also the president of a future America in the episode \"I Am Become Death\".\nPresident Phillips\n* President in: Air Collision, a (2012 Direct to DVD) Film\n* On Air Force One with his wife and daughter when an EMP storm sends the plane on a collision with a Passenger Plane.\nPresident Andrew Pickett\n* President in Jack Ryan Season 1\n* Studied political science at Emory University and later served as a platoon commander in the Vietnam War.\n* Orders a JSOC mission to rescue several captured physicians kidnapped by Islamic terrorist Mousa bin Suleiman in Syria. The operation is a success, and Pickett later meets with the rescued doctors in the White House. However, it is revealed the hostages were infected with a strain of Ebola, causing Pickett, the Vice President, the Speaker of the House and several members of Congress to be medically quarantined in Washington Memorial Hospital.\n* Suleiman and his men then bomb a pizzeria in Washington, D.C, and enter the hospital in the aftermath disguised as DC FEMS paramedics, intending to set off a Caesium-137 dirty bomb. The plan is eventually thwarted by CIA officer Jack Ryan, who prevents the remote detonation of the device by shooting Suleiman as he tries to flee on the DC Metro.\n* Pickett is succeeded by President Charles Bachler in Seasons 3 and 4.\n* Secret Service codename: Buckeye\n* Played by: Michael Gaston\n* Political Party: Unspecified\nPresident Warren H. Pierce\n* President in: Syphon Filter: The Omega Strain for PlayStation 2\n* Bears a striking resemblance to and is based on George W. Bush.\n* Party: Republican\nPresident Stephanie Pilgrim\n* President in: The Hatching, Skitter and Zero Day (novel-trilogy) (2016–2018) by Ezekiel Boone\n* 47th President of the US; also first female president and youngest president ever elected (four days younger than Teddy Roosevelt).\n* Serves as a governor and senator prior to her presidency.\n* Decides to destroy the whole infrastructure of her country (due to the so-called Spanish Protocol) and to nuke thirty-one American cities later in the story, to protect her people against an invasion of millions of carnivorous spiders.\n* Faces a military coup against her, initiated by the chairman of the Joint chief of staff, Ben Broussard.\n* Has an affair with her White House chief of staff, Manny Walchuck.\n* Party: presumably Democratic\nPresident Pinhead\n* President in: Smiling Friends (TV series, episode \"Mr. President\")\n* Died after eating bad shrimp\n* Succeeded by Vice President Jimble\nPresident Ulysses Delano Fitzgerald Milhous Pinky\n* President in: Pinky and the Brain\n* Known to his friends as \"Ladybird\"\n* Is elected twice and impeached\n* Party: Pink Party\n* Played by: Rob Paulsen\nPresident Olivia Caroline Pope\n* President in: the ABC TV Series Scandal\n* In the final moments of the final episode \"Over the Cliff\", a portrait of her in a public gallery implies that she served as president at some point after 2024.\n* Former chief of staff to President Melody Parker Grant, and President Fitzgerald Thomas Grant III.\n* Head of Olivia Pope and Associates, a crisis management and public relations firm.\n* According to Chief of Staff Cyrus Beene, she may have become a de facto president (reminiscent of Edith Wilson, the First Lady to Woodrow Wilson) in what he describes as a 'bloodless coup'. President Fitzgerald Grant becomes dependent on her advice when she becomes his live-in mistress.\n* Played by Kerry Washington\nActing President Powdered Toast Man\n* President in: The Ren & Stimpy Show episode \"Powdered Toast Man\"\n* Briefly acts as president after rescuing an unnamed sitting president\n* Voiced by Gary Owens\nPresident Katherine Powers\n* President in: ''President's Daughter (novel series) by Ellen Emerson White\n* First female president.\n* Serves as a senator from Massachusetts prior to being elected president.\n* In the second book, she faces an assassination attempt, and her daughter is kidnapped in the third.\n* Party: Democratic\nPresident Pomni\n* President in: 2025 episode \"Untitled\" in The Amazing Digital Circus (animated series) by Gooseworx\n* Female president.\n* Voiced by Lizzie Freeman\nActing President Jim Prescott\n* President in: 2002 and again from 2002 to 2003 in 24 (2003)\n* Jim Prescott is vice president under President David Palmer (2001–2005) and manipulates the Cabinet to invoke the 25th Amendment, but only serves a few hours before the presidency is restored to Palmer.\n* 24: The Game shows that Prescott once again serves as acting president following an assassination attempt on Palmer (24: The Game is set between Seasons 2 and 3).\n* Party: Democratic\n* Played by: Alan Dale\nPresident Mark Prescott\n* President in: True Allegiance (novel, 2017) by Ben Shapiro\n* Has socialist leainings.\nPresident Carl Preston\n* President in: Shadowrun role-playing game\n* Presidential term 2041–2049.\n* Defeats incumbent Martin Vincenzo in 2040 Election.\n* 3rd UCAS president | 49th US president.\n* Defeated by Alan Adams (D) in the 2048 election.\nPresident Jack \"Kill the Commies\" Preston\n* President in: Whoops Apocalypse (film, 1986)\n* Author of the book Commie Bastards I Have Known.\n* Party: presumably Anti-Communist\n* Played by: Murray Hamilton\nPresident Reginald J. Priest\n* President in: Lexx (TV series, 2001)\n* Played by: Rolf Kanies\nPresident Betty Jo Pritchard\n* President in: Shadowrun role-playing game\n* Presidential term 2057.\n* 6th UCAS President | 52nd US president.\n* Speaker of the House Betty Jo Pritchard succeeds incumbent President Thomas Steele as president ad Interim on 19 January 2057, after the UCAS House of Representatives declares the UCAS Presidential Election of 2056 invalid, cancelling the second inauguration of President-elect Thomas Steele and his VP-elect. Pritchard becomes full president of the UCAS on 26 January 2057 upon the formal impeachment and conviction by Congress.\n* On 29 January 2057, President Pritchard signs into law an emergency election to be held on the first day of August 2057.\n* She is succeeded by President Dunkelzahan on 9 August 2057.\nPresident James Reynolds Pryce\n* President in: Running Mates\n* Played by: Tom Selleck\n* Pryce is a former U.S. Congressman and Governor of Michigan.\n* When asked by a reporter who his favorite president is, he responds with William Henry Harrison because he died after 30 days in office and thus never had the chance to do major damage to the country.\n* The film is largely a look at four of the women closest to Pryce and how they jockey for influence in the midst of the convention.\n* At the end of his convention speech, Pryce names Senator Terence Randle of Colorado as his running mate, spurning party power brokers.\n* Party: Democratic\nQ\nPresident Quentin Trembley III\n* President in:  Gravity Falls by Alex Hirsch\n*Full name: President Sir Lord Quentin Trembley III, Esq\n* Is the forgotten founder of Gravity Falls, Oregon\n* 8½th President of the United States of America\n* His silliness has prompted his erasure from history.\n*Quentin Trembley is pictured on The Negative Twelve Dollar Bill which is a less than worthless bill.\nR\nPresident Jeffrey Mindol Ragland\n* President in: Ragland (novel, 1972) by John Van Orsdell\n* Former senate aid to future president William F. Berndt, and chosen to be his vice president.\n* Becomes president when Berndt dies in office.\n* Tried LSD, advocates sterilization for the poor, returns a Soviet defector to insure a summit meeting takes place.\n* Threatens to blow up Air Force One with the Soviet and Chinese leaders on it during an airborne summit unless they agree to disarmament.\nPresident Robert Rand\n* President in: The Thor Conspiracy by Larry Burkett\n* He is an erstwhile actor, chosen by \"The Society\".\n* His policies dictated by \"The Society\" cause some states (including Wyoming) to revolt.\n* He is assassinated (along with most of \"The Society\") by a South Korean who parks a van containing an atomic bomb in front of the White House (after which US capital is moved to Philadelphia).\n* Thinks he is in control and \"Society\" operative Cho serves him—but revealed to be other way around shortly before he and Cho are murdered.\nPresident Raney\n* President in: Independents' Day (movie, 2016)\n* Becomes President when President Oliver is killed by aliens.\n* Played by: Fay Gauthier\nPresident Lawrence Ivor Randolph\n* President in: The Brady Bunch in the White House\n* Former congressman & speaker of the house from South Carolina. Forced to resign.\n* Presidential term 2009–2013\n* Played by: Dave Nichols\nPresident Eli Raphelson\n* President in: White House Down''\n* Former Speaker of the United States House of Representatives.\n* Hires Army sergeant John Cale to his Capitol Police security detail after the latter saves his nephew from an IED explosion in Afghanistan.\n* Evacuated to The Pentagon when domestic terrorists bomb the United States Capitol and take over the White House.\n* Sworn in as the 48th president of the United States after President James Sawyer is presumably killed in an explosion which destroys the White House cabana, and Vice President Alvin Hammond is killed when the terrorists gain control of NORAD missiles and shoot down Air Force One.\n* Revealed to have masterminded the attacks to place himself in power, with support from various members of the military industrial complex, believing that Sawyer's proposed peace treaty would \"sell the United States out to the Arabs\".\n* Has his co-conspirator, vengeful secret service agent Martin Walker, use his codes for the nuclear football in order to destroy the Middle East with American nuclear missiles.\n* Orders an air strike on the White House complex in order to destroy any evidence of his involvement.\n* When Walker is killed and the Air Force pilots go rogue and refuse to carry out his order, evidence arises that points to him being involved with the attacks (his pager is set off by one of the cell phone numbers used by the terrorists).\n* Although confident in his belief that as president he will avoid prosecution and the claims will not be believed, Sawyer is revealed to be alive and has Raphelson arrested for plotting the coup d'état. Sawyer also assures him his \"friends\" who helped orchestrate the attacks will also be imprisoned.\n* Party: Republican\n* Played by: Richard Jenkins\nPresident Rathcock\n* President in: Machete Kills\n* Runs for re-election as evidenced by his campaign television commercials.\n* Party: presumably Republican\n* Played by Charlie Sheen (credited as Carlos Estevez)\nPresident Carlton Rattigan\n* President in: Against All Enemies (novel, 1977) by Ben Wattenberg and Ervin S. Duggan\n* President Rattigan orders U.S. Forces to South America on a peacekeeping mission. When an American base is attacked by rebels, Vice President Abner Hoffman challenges Rattigan for their parties nomination. Rattigan defeats Hoffman in the New Hampshire primary.\nPresident William Tresselt 'Bill' Rayburn\n* President in: The Diplomat Season 1 and 2.\n* A native of Virginia and married to Carolyn, Rayburn is in his late seventies when elected to his first term in 2020.\n* In the first year or so of his term, the US withdraws from Afghanistan, and Russia invades Ukraine. This raises questions about the reliability of US leadership, and Rayburn, in particular, faces scrutiny for his age and fitness for office.\n* In the Spring of 2022, with his Vice President, Grace Penn, facing an impending financial scandal involving her husband, Rayburn initiates quiet proceedings to find a successor. On the advice of Chief of Staff Billie Appiah, he appoints career diplomat Kate Wyler as US Ambassador to the UK, giving her a plum diplomatic post to groom her as Penn's eventual successor.\n* However, Wyler later discovers that Penn, alongside British political strategist Margaret Roylin, had orchestrated a false flag attack on a British naval vessel that went wrong, resulting in the deaths of 43 British sailors. The attack had been planned to provide the UK with a unifying national cause to prevent the passage of a Scottish independence referendum, which would've resulted in the US losing a critical naval base in the strategic fight against Russia.\n* Upon learning of Penn's treachery in mid July 2022, Rayburn is so distressed that he suffers a fatal heart attack, elevating Penn to the Presidency.\n* Unbeknownst to Rayburn during his term, Appiah had also been aware of Penn's treachery, but manufactured the finance scandal to force Penn's resignation to give the administration a comparatively clean exit for her compared to what would happen if the scandal emerged.\n* In order to protect herself, Penn lies to Prime Minister Nicol Trowbridge that it was Rayburn who conspired with Roylin, and asks him to publicly assign full blame to Roylin in exchange for a favourable trade deal. However, during a joint press conference, the Prime Minister blames Rayburn directly. This leaves Rayburn's legacy tarnished and causes widespread anti-American protests across the globe, as well as the destabilisation of NATO.\n* Played by: Michael McKean\nPresident Arthur Timothy Read\n* President in: Arthur television series\n* Arthur often imagines himself as president.\n* In the episode \"Arthur's Lucky Pencil\", he signs into law a bill that mandates every student be served two pieces of Boston Cream Pie, at lunch.\n* Voiced by Michael Yarmush in that episode\nPresident Charles Robert Redford Jr.\n* Based on Robert Redford\n* President in Watchmen television series\n* Does not appear directly, mentioned-only and picture appearances\nPresident Carl Reed\n* President in: Invader (novel, 1980) by David Campbell Hill and Albert Fay Hill\n* President of the United States when an alien fleet is discovered heading for Earth.\n* Protested against the Vietnam War, but authorizes the construction of a Gamma Ray Cannon to use against the Aliens.\nPresident Joshua Reiss\n* President in: The Last Ship (TV series) (Season 5)\n* Succeeds Howard Oliver as president some time between the end of Season 3 and start of Season 5.\n* Declares war on the restored Gran Colombian Empire after they cripple the US military's computerized infrastructure with a virus and launch an unprovoked attack to destroy most of the recommissioned US navy.\n* Clashes with Admiral Tom Chandler over his insistence on fighting at the front, believing both that Chandler is too mentally burnt out to lead, and that he is more useful as a public face for the war effort.\n* Played by: Steven Culp\nPresident Erwin Rexall\n* President in: Give Me Liberty/Martha Washington Goes to War comic book series, set in 2014\n* Elected in 1996 (future date at the time of publication). The most popular president of all time (complete with his face on Mount Rushmore), Rexall repeals the 22nd Amendment to gain a third term.\n* Vice President Cargo, and most of his cabinet are assassinated in an explosion, while Rexall himself is left incapacitated. Succeeded by Secretary of Agriculture Howard Johnson Nissen.\n* Rexall eventually has his brain implanted into a robot body and is able to continue his presidency by the end of the series.\nPresident Caroline Reynolds\n* President in: Prison Break\n* As vice-president, she collaborates with an organization known as \"the Company\" to fake the death of her brother Terrence Steadman and frame Lincoln Burrows for the murder. When her presidential campaign begins to falter and the Company turns against her, she has President Mills assassinated and ss immediately sworn in as president.\n* Played by: Patricia Wettig\n* Party: presumably Republican\nPresident Richardson\n* President in: Virus (movie, 1980)\n* During his administration, in the then future Feb. 1982, the United States and Soviet Union both put in place the Automatic Response System (ARS), a computer system that is capable of fighting a nuclear war without human control.\n* A biological weapon is stolen from a U.S. lab and, in an attempt to recover it, the virus is released in Europe resulting in a worldwide pandemic. The only survivors are in Antarctica.\n* President Richardson dies at his desk from the virus shortly after informing those in Antarctica of the situation.\n* The Chairman of the Joint Chief of Staff activates the ARS after the President dies, and an earthquarke a few months later causing a nuclear exchange that destroys the Antarctic colony.\n* Played by Glenn Ford\nPresident Dick Richardson\n* President in: Fallout 2\n* President of the United States in the 23rd century after World War III, although it means nothing more than leading the surviving significant government employees onto an oil rig, west of the city San Francisco. He is killed by the main character, the Chosen One, in the fall of 2242.\n* Vice President is Daniel Bird\n* Played by: Jeffrey Jones\nPresident Elizabeth Richardson\n* President in: Special Report: Journey to Mars (TV movie, 1996)\n* Elected in 2000, and re-elected in 2004 due to her support of the Destiny Mission to Mars.\n* In July, 2005, it is learned that the Destiny Mission has been sabotaged. Due to the heroic efforts of the crew the craft lands safely on Mars, but all contact is soon lost.\n* Played by: Elizabeth Wilson\nPresident Robert Richmond\n* President in: Designated Survivor\n* Born in Louisiana.\n* Requests that Thomas Kirkman, his Secretary of Housing and Urban Development, resign from the cabinet after he is re-elected to a second term in 2016.\n* Killed in the first episode, along with the rest of the presidential line of succession, in a bombing of the United States Capitol during his State of the Union address.\n* Replaced by Kirkman, who is the designated survivor during the address.\n* Is close friends with Kimble Hookstraten, a  congresswoman who survived the bombing by acting as the designated survivor for the rival Republican Party.\n* Has one son, Tyler Richmond.\n* Secret Service codename: \"Eagle\".\n* Party: presumably Democratic\n* Played by: Richard Bekins\nPresident Alan Richmond\n* President in: Absolute Power (1996 book) and Absolute Power (1997 film)\n* Is an aloof, womanizing man who is cheating with his good friend's wife. After the sex beoomes rough, she attacks him with a letter opener followed by the Secret Service killing her. He and his chief of staff attempt to cover up the murder, however, a cat burglar witnesses the entire skirmish.\n* Attempts, at all costs, to kill the man who possesses the letter opener with his blood on it.\n* Book: A young lawyer later uncovers the scandal and goes public with it. President Richmond is later either impeached or resigns and is incarcerated. Later becomes the only American president to be tried for murder and executed.\n* Movie: Burglar gives the letter opener to President Richmond's \"good friend\", who assassinates Richmond with it. Death represented publicly as a suicide.\n* Played by: Gene Hackman\nPresident Eleanor Richmond\n* President in: Interface by Stephen Bury\nPresident George Richmond\n* President in: ''My Date with the President's Daughter\n* President Richmond is married to Carol Richmond and has one teenage daughter, Hallie. While running for reelection, President Richmond is mistakenly arrested by the police and spends one night in jail.\n* Played by: Dabney Coleman\nPresident Kyle Richmond\n* President in: The Squadron Supreme, a marvel Comic Book Mini-series\n* A former costumed crimefighter known as Nighthawk, he is a member of the superhero group called the Squadron Supreme.\n* He leaves the group and enters politics, first serving as a congressman, then a cabinet member, and finally as president of the United States.\n* During his term, an alien named Overmind secretly takes over his mind and forces him to conquer the world. As no other country has atomic bombs in this timeline, he faces little opposition.\n* President Richmond is seen as the dictator of the world as Overmind stays behind the scenes.\n* When Overmind is defeated, Richmond resigns from office. When the Squadron Supreme decides to take over the world and create a utopia, Richmond returns to the identity of Nighthawk and opposes them.\n* Benjamin Franklin, Hubert Humphrey, and Nelson Rockefeller all serve as president before Richmond.\nPresident Prez Rickard\n* President in: Prez, comic book series\n* Created by Joe Simon\n* Revived in several DC Comics series.\nPresident Rick Rickard\n* President in: Batman: The Dark Knight Strikes Again, by Frank Miller\n* Is actually a hologram used as a front for Lex Luthor and Brainiac to secretly rule behind the scenes.\n* His advisors include Attorney-General Snark, Secretary of State Robert \"Buzz\" Ruger-Exxon, and Chairman of the Joint Chiefs Four-Star General Cornell Starbucks.\nPresident Ridgely\n* President in: Franchise (short story) by Isaac Asimov\n* Is elected in 1988 through \"pie-in-the-sky promises and racist baloney\". Is extremely disliked even 20 years later.\nPresident Benjamin Riker\n* President in: False-Face'' by Marilyn Sharp\n* Is killed by the world's greatest assassin who makes his death look like a skiing accident.\n* President Riker is killed on orders from the speaker of the House who thinks he is too weak to deal with the Soviets.\nPresident Henry Roarke\n* President in: Quantico\n* Native of Wisconsin.\n* Former United States Speaker of the House of Representatives.\n* Ascends to the office after orchestrating the resignation of President Claire Haas.\n* Oversees the creation of a new arm of the US intelligence community, the Domestic and International Intelligence Agency (DISA).\n* Introduces a controversial Muslim Registry Act, and later conspires with rogue elements of the United States Government to orchestrate a terrorist attack on commercial airliners and blame it on innocent individuals placed on a list by the legislation.\n* Though this plan is foiled, he uses the fear generated to controversially request a Constitutional Convention in Philadelphia to drastically change and amend the Constitution of the United States in response to an increased terrorist threat.\n* Is later approached by the Russian Federal Security Service, who ask that he add a specific modification to a proposed amendment in the new constitution, should he receive the votes. This meeting however is secretly recorded and broadcast at the convention, with copies also being released to the ACLU, law enforcement and leading law firms across the country.\n* With his reputation tarnished, and not wanting to answer to the press or law enforcement in the wake of the scandal, President Roarke commits suicide by shooting himself in the head.\n* Party: Republican\n* Played by: Dennis Boutsikaris\nPresident Marcus Robbins\n* President in: Sharknado 3\n* Is saved by the hero of the movie series, Fin Shepard, when the White House is attacked by sharks\n* Vice president: Sonia Buck (played by Ann Coulter)\n* Played by: Mark Cuban\nPresident Roberts\n* President in: Captain Scarlet and the Mysterons episode The Launching\n* Is initially suspected to be the target of a Mysteron threat, until it is discovered a nuclear-powered cargo ship, the President Roberts, is the real target.\n* Played by: Puppet 19, voiced by David Healy\nPresident Marshall Roberts\n* President in: Ikon (novel, 1982) by Graham Masterton\n* Blackmailed by secretary of state Titus Alexander into cancelling nuclear reduction talks with Soviets. But really only president in name, as Russians had secretly been in charge of the United States since 1962, when Kennedy surrendered to threat of missiles in Cuba.\n* Reportedly intending to be re-elected in 1984.\nPresident Peter Arnold Robinson\n* President in: Alternities (novel, 1988) by Michael P. Kube-McDowell\n* Presidential term 1972–1976.\n* Aware of a series of connections leading to other timelines, Robinson escalates the Cold War to regain lost status and prestige, risking nuclear war with the expectation that he and his supporters can withdraw safely to another universe should events escalate.\n* Is stopped by his chief of staff after government forces in his destination timeline seize the gate, preventing easy passage.\n* Party: Republican\nPresident Elise Rochelle\n* President in: Coyote (novel) by Allen Steele\n* Is elected President-for-Life of the United Republic of America by Congress.\n* Commits suicide in 2096 to avoid being prosecuted for war crimes, as she had killed 1.1 million people with biological weapon strikes on Boston, Seattle, and Montreal.\n* As the URA is later absorbed by the socialist Western Hemisphere Union after her suicide, she is essentially the final President of the United States of America.\n* Party: Liberty Party\nJames R. Rockland\n* President in Philip Dru: Administrator: A Story of Tomorrow, 1920-1935 by Edward Mandell House published in 1912.\n* President James R. Rockland, former \"Governor of a State of the Middle West,\" sycophant of Senator Selwyn who was beholden to John Thor, \"the high priest of finance.\"\n* President Rockland believed that \"Government had been honeycombed by irresponsible demagogues, that were fattening upon the credulity of the people to the great injury of our commerce and prosperity, ...(and) contended that in protecting capital against vicious assaults, they were serving the cause of labor and advancing the welfare of all.\"\n* Faced and lost a civil war against \"the democratic western United States.\"\nPresident Steve Rogers (Captain America)\n* President in: What If, vol. II #28 (Marvel Comics) and The Last Avengers Story book by Marvel Comics (non-canon fiction)\n* Party: New Populist Party\nPresident \"Steve Rogers\"\n* President in: Marvel 2099 titles\n* The leader of a counter-revolution against Doom, \"Rogers\" claims to be Captain America, but is actually a pawn of the supervillain Herod.\nPresident John Romero\n* President in: Deadlands: Hell on Earth role-playing game\n* Former film director and anti-Confederate propagandist. Conducts secret funding of the Latin American Alliance's war against the Confederate States of America. This revelation sparks another war between North and South.\n* Romero is elected in 2070, impeached in 2078.\nPresident George Romney\n* President in: Resurrection Day by Brendan Dubios\n* Elected in 1964, two years after a nuclear exchange sparked by the Cuban Missile Crisis.\n* Re-elected in 1984.\n* Party: Republican\nPresident Ronnie\n*President in: the arcade game \"Bad Dudes Vs. DragonNinja\"\n*He is kidnapped by Ninjas and it is up to Blade and Striker to save him.\n*Based on the then current president Ronald Reagan in the arcade version.\n*On the NES port of the game, he is based on the then current president George H. W. Bush.\nPresident M. Romney\n* President in: fourth season Rick and Morty episode \"Edge of Tomorty: Rick Die Rickpeat\"\n* Alternative reality version of the President from the \"fascist dimension\"\n* Party: Fascist Party\nPresident Romulus\n* President in: Thank You for Smoking by Christopher Buckley\n* Former president.\n* Never is seen, but is referenced.\nChester Roosevelt\n* Mentioned as a former Governor-General of the North American Union in The Two Georges, co-authored by Harry Turtledove and Richard Dreyfuss.\nPresident Chet Roosevelt\n* President in: Americathon\n* Somehow becomes president at the age of 30.\n* Prior to the Roosevelt administration, the U.S. government suffers bankruptcy, a few years later the nation holds a telethon to pay off its debts and deficit.\n* Relocates the nation's capital from Washington, D.C., to Los Angeles, California.\n* Falls in love with a Vietnamese pop star and resigns the presidency to marry her. The two later move to Vietnam.\n* Played by: John Ritter\nPresident Charles Ross\n* President in: Last Best Chance (short film, 2005)\n* President Ross has to deal with the possibility a terrorist has smuggled a nuclear weapon into the United States.\n* Played by: Fred Dalton Thompson\nPresident Pete Ross\n* Ross is a former Senator from Kansas, succeeds President Lex Luthor after Luthor's impeachment, and refuses to run for re-election.\n* Party: Tomorrow Party\nPresident Thaddeus Ross\n* President in: Captain America: Brave New World (2025)\n* Initially portrayed by William Hurt in previous Marvel Cinematic Universe (MCU) films, Harrison Ford portrays Ross while in office. He is a former four-star general and Secretary of State who is an adversary of the Bruce Banner, Steve Rogers and the Avengers.\n* While president, Ross is almost assassinated by Isaiah Bradley, who is being mind-controlled by Samuel Sterns.\n* Ross transforms into the Red Hulk during a press conference and battles Sam Wilson.\n* When Ross is defeated, he resigns from office and is incarcerated at the Raft.\nPresident Paul Roudebush\n* President in: Vanished\n* Played by: Richard Widmark\nPresident Harriet Rowntree\n* President in: Air Force One Is Down\n* Due to meet with members of the Serbian government to discuss their potential joining of NATO.\n* En route to the meeting, Air Force One is digitally hijacked by English hacker John Mackenzie, and its passengers rendered unconscious by the release of gas via oxygen masks that were tampered with at Andrews Air Force Base.\n* The plane is remotely landed by Mackenzie, where the unconscious President Rowntree is kidnapped by members of the Serbian military loyal to renegade General Arkady Dragutin, who has just been sentenced to life imprisonment at The Hague. The plane is then returned to the air, where it is crashed into the ocean, creating a diversion and making it appear she has been killed.\n* Is held hostage by the rogue soldiers, who promise she will be released \"unharmed\" should Dragutin be released.\n* Is later rescued from captivity and taken for medical examination at Ramstein Air Base in Germany.\n* Played by Linda Hamilton\nPresident James Roy Wilde (Jim Roy)\n* President in: The Black President\n* The first black president, elected in 2228.\n* 88th president.\n* Preceded by President Kerlog\nPresident Oliver Russell\n* President in: The Best Laid Plans by Sidney Sheldon\nPresident Jack Rutledge\n* President in: Brad Thor (novels)\n* Kidnapped by Swiss terrorist group known as The Lions. Has a finger cut off by the group as proof of his kidnapping. Later returned safely to the White House.\n* Widower and father of a teenage (later college age daughter), who is injured in an avalanche during his kidnapping, and injured again several books later during an attack on NYC bridges and tunnel.\n* Two term president, reelected sometime between the novels Blowback and Takedown.\n* Party: Republican\nPresident Virgil Rutledge\n* President in: Hitler's Daughter (novel, 1984) by Timothy Benford\n* Defeats Vice President Elliot Benedict, and follows President William Chandler into office.\n* Vice President Leona Crawford Gordon becomes president when President Rutledge dies in the mysterious crash of Air Force One.\nPresident John Patrick \"Jack\" Ryan\n* President in: numerous novels by Tom Clancy, previously serves as a Marine lieutenant, CIA analyst and emissary, deputy director of Central Intelligence, and National Security Advisor.\n* Because he is the first Marine to become president and in reference to a gift by a Saudi Prince to him, his Secret Service codename is \"SWORDSMAN\".\n* Ryan is married and has four children, younger son is born shortly after his re-election.\n* Jack Ryan assumes the presidency after the death of the president and most of Congress after a terrorist attack on The Capitol (ending Clancy's novel Debt of Honor). The Ryan Administration tries to significantly alter Washington politics by cutting through bureaucracy and political infighting, in part by encouraging \"regular people\" to run for Congress, who will serve their terms and return home, rather than professional, lifelong politicians whom he refers to as \"a permanent ruling class\" (throughout Executive Orders).\n* Participates in the arrest of a terrorist mole in the Secret Service by helping the FBI run a sting operation in the Oval Office. The mole's fellow assassin's from Iran earlier raids the daycare center attended by Ryan's younger daughter, killing a teacher and several of little Katie's Secret Service Guards. None of the attackers survive.\n* In foreign policy, the Ryan Administration fights two wars; the Second Persian Gulf War with the newly created United Islamic Republic, a union of Iraq and Iran, and the Russo-Chinese War, fought over Siberian oil (in The Bear and the Dragon). Not long before the latter war, Ryan has successfully pushed for an expansion of NATO to include the Russian Federation, in a futile attempt to deter a Chinese attack.\n* Pronounces the \"Ryan Doctrine\"; this states that anyone who attacks American citizens anywhere in the world, no matter who they may be, will be held accountable by the United States.  This is consistent with Ryan's belief that \"the safety and security of our citizens is ultimately my country's only vital interest\".  The doctrine can be seen as a reaction to the rise of terrorist attacks on American citizens, including by the state organs of countries like Iran (or, in the book, the UIR). Iran's Ayatollah had masterminded the release of the Ebola Zaire virus in America's major cities, to neutralize the U.S. military while the UIR invades and crushes Israel. Despite this, the non-quarantined military reserves are deployed to the Middle East and thwart the invasion. Afterward, while Ryan is on camera pronouncing his doctrine, coverage flips to a palace in Iran, which is then incinerated by U.S. stealth bombs, killing the Ayatollah and his regime.\n* Ryan refuses to run for a second term - a decision he regrets when the Democrat Ed Kealty is elected president and enacts policies to which Ryan strongly objects. In the next elections Ryan re-enters active politics, runs against Kealty and narrowly defeats him.\n* Party: Independent / Republican. The Ryan Administration espouses many conservative, traditionally Republican beliefs, but Ryan is said to support candidates from both parties.  Ultimately, the integrity and loyalty of politicians matters far more to Jack Ryan than their party affiliation. However, the reference to the GOP winning Ohio and Michigan in Locked On implies that Ryan ran on the Republican Party ticket in the 2008 presidential election against incumbent Ed Kealty. This is reflected in the presidential debates, where there is only Kealty (the Democratic candidate) and Ryan.\nReferences"
    }
  ]
}