{
  "content": [
    {
      "type": "text",
      "text": "# List of films featuring the Irish Republican Army\n\nThis is a list of films in which the Irish Republican Army, a faction thereof or a break away organisation (whether real or fictional) is portrayed either through its plot or by a main character.\n{| class=\"wikitable sortable\"\n|-\n! Title !! Director !! Notable cast !! Summary !! Released !! Notes\n|-\n|Juno and the Paycock\n|Alfred Hitchcock\n|Maire O'Neill, Edward Chapman, Sidney Morgan, Sara Allgood\n|A long suffering wife's dismay as her troubled family is unwound by the prospect of wealth. Her husband is useless, her son is pursued by rebels for informing, and her daughter is dangerously in love with a lawyer due an inheritance. She tries to save her family from the storms that follows.\nBased on the 1924 play by Seán O'Casey.\n|1930\n|\n|-\n|The Informer\n|John Ford\n|Victor McLaglen\n|A disgraced former IRA member decides to inform on his former comrade and use the bounty to emigrate. His former comrade is then killed in a gunfight and things spiral as it becomes known it was he who informed.\nBased on the novel by Liam O'Flaherty.\n|1935\n|\n|-\n|Beloved Enemy\n|H.C. Potter\n|Merle Oberon, Brian Aherne, David Niven\n|During the Irish War of Independence an Irish rebel leader and a British aristocratic woman fall in love. The rebel however is pursued by a British Army officer.\n|1936\n|\n|-\n|My Life for Ireland\n|Max W. Kimmich\n|Anna Dammann, René Deltgen\n|A Nazi propaganda film where a young student who sells out his love interest to the Secret Service after seeing her with a wanted Irish revolutionary, must risk his life to rehabilitate himself.\n|1941\n|\n|-\n|I See a Dark Stranger\n|Frank Launder\n|Deborah Kerr, Trevor Howard\n|A young Irish woman becomes a Nazi spy.\n|1946\n|\n|-\n|Odd Man Out\n|Carol Reed\n|James Mason\n|A wounded Irish nationalist leader in Belfast attempts to evade police following a failed robbery.\n(The group he belongs to is not named, but the IRA were the only Irish republican group active at the time.)\n|1947\n|\n|-\n|The Quiet Man\n|John Ford\n|John Wayne\n|A retired boxer returns home to Ireland. He falls for a fiery red-headed, whose brother forms a rivalry with him.\n|1952\n|\n|-\n|The Gentle Gunman\n|Basil Dearden\n|John Mills, Dirk Bogarde\n|IRA Volunteer Terry Sullivan (Mills) become disillusioned with a bombing campaign of London during the Second World War.\n|1952\n|\n|-\n|Shake Hands with the Devil\n|Michael Anderson\n|James Cagney, Don Murray, Dana Wynter, Glynis Johns\n|A young American gets involved in the 1921 battles between the Black and Tans and the IRA, - but at last he becomes sick of all the killing and puts an end to it by shooting an IRA-leader.\n|1959\n|\n|-\n|A Terrible Beauty\n(also known as The Night Fighters)\n|Tay Garnett\n|Robert Mitchum\n|The Night Fighters is a look at the conflicted loyalties that trouble a daring young IRA recruit who comes to realize that some of his IRA cohorts are seriously misguided, and that the Nazis aren't to be trusted as allies.\nBased on the 1958 A Terrible Beauty novel by Arthur Roth.\n|1960\n|\n|-\n|''Ryan's Daughter''\n|David Lean\n|Sarah Miles, Robert Mitchum, John Mills, Leo McKern, Trevor Howard\n|IRA men arrive in a village to prepare to receive a delivery of German rifles from a ship offshore. Although the villagers help them recover the weapons during a storm, they are captured by the local British Army detachment on leaving the beach.\n|1970\n|\n|-\n|Duck, You Sucker!\n|Sergio Leone\n|James Coburn, Rod Steiger\n|An Irish explosives expert on the run and a Mexican bandit unintentionally get involved in the Mexican Revolution.\n|1971\n|\n|-\n|A Sense of Loss\n|Marcel Ophüls\n|\n|Documentary shot over six weeks in December 1971, and January 1972, the film consisted of interviews with Protestants, Catholics, politicians, and some soldiers, combined with TV news clips of bombings and violence.\n|1972\n|\n|-\n|NO GO!\n|Richard Chase\n|\n|Docudrama about both the Provisional IRA and Official IRA in Derry's Bogside.\n|1973\n|\n|-\n|Hennessy\n|Don Sharp\n|Rod Steiger, Lee Remick\n|After his family is killed, a once peaceful Irishman plots revenge, setting out to destroy the British Parliament.\n|1975\n|\n|-\n|The Eagle Has Landed\n|John Sturges\n|Michael Caine, Donald Sutherland, Robert Duvall\n|A former IRA man sheltering in Nazi Germany, where he works as a lecturer, is parachuted into England to make preparations for a Luftwaffe parachute unit, disguised as Polish soldiers, tasked with capturing or killing Prime Minister Sir Winston Churchill.\n|1976\n|\n|-\n|The Patriot Game\n|Arthur MacCaig\n|\n| A history of the Northern Irish conflict from 1968 to  1978, including the origins of the IRA and the conflict itself.\n|1979\n|documentary\n|-\n|The Outsider\n|Tony Luraschi\n|Craig Wasson, Sterling Hayden, Patricia Quinn, Niall O'Brien\n|An Irish-American man travels to Ireland during the 1970s and joins the IRA.\nBased on the book The Heritage of Michael Flaherty by Colin Leinster.\n|1979\n|\n|-\n|The Long Good Friday\n|John Mackenzie\n|Bob Hoskins, Helen Mirren\n|A London crime boss is beset by problems which prove to be caused by the Provisional IRA, targeting his organisation following coincidental events that incorrectly implicate his involvement.\n|1980\n|\n|-\n|Guests of the Nation\n|John J. Desmond\n|\n|Two British enlistees being held captive by the IRA during the Irish War of Independence form a sense of camaraderie with their IRA guards. Difficulties ensure when they are to be executed.\nBased on a short story by Frank O'Connor.\n|1981\n|Television film\n|-\n|''Harry's Game\n|Lawrence Gordon Clark\n|Ray Lonnen, Derek Thompson\n|An IRA rifleman who assassinated a British minister in front of his family in London is tracked down by an undercover British Army officer. Based on Gerald Seymour’s 1975 novel.\n|1982\n|Television serial\n|-\n|Giro City\n(also known by And Nothing But the Truth)\n|Karl Francis\n|Glenda Jackson, Jon Finch, Kenneth Colley, Bruce Alexander, Sharon Morgan\n|Drama about a TV current affairs team who are working on two major news stories, and find themselves coming up against censorship and self-censorship in the media.\n|1982\n|Television film\n|-\n|Cal''\n|Pat O'Connor\n|Helen Mirren, John Lynch, Donal McCann, Ray McAnally, John Kavanagh, Tom Hickey, J. J. Murphy\n|A young Provisional IRA member wants to leave after falling in love with the widow of a victim.\nBased on a novella by Bernard MacLaverty.\n|1984\n|\n|-\n|The Glory Boys\n|Michael Ferguson\n|Anthony Perkins, Rod Steiger, Alfred Burke, Joanna Lumley\n|The IRA assigns one of its members to aid a PLO assassin in his attempt to kill an Israeli nuclear scientist in London, while British Intelligence officers attempt to prevent and capture them.\n|1984\n|Television serial\n|-\n|Contact\n|Alan Clarke\n|Sean Chapman\n|A platoon of British paratroopers on border patrol in South Armagh face a series of tense encounters. Based on A.F.N. Clarke's experiences as a Parachute Regiment officer in 1970s Northern Ireland.\n|1984\n|Television film\n|-\n|In This Corner\n|Atom Egoyan\n|\n|An amateur boxer from Canada becomes an unwitting pawn in The Troubles when he is convinced by Irish Republican Army to help smuggle accused member back into Ireland as part of his entourage.\n|1986\n|Television film\n|-\n|A Prayer for the Dying\n|Mike Hodges\n|Mickey Rourke, Bob Hoskins, Alan Bates, Liam Neeson, Leonard Termo, Camille Coduri, Alison Doody\n|A former IRA member escapes to London and tries to forget his past.\n|1987\n|\n|-\n|Naming the Names\n|Sylvestra Le Touzel\n|Stuart Burge\n|Young Belfast woman committed to republican cause caught in web of conflicting loyalties and violence. Based on a short fiction story by Anne Devlin.\n|1987\n|TV movie\n|-\n|Act of Betrayal\n|Lawrence Gordon Clark\n|Elliott Gould, Patrick Bergin\n|An IRA informer and his family are given new identities and new lives in Australia but the IRA are still determined to track them down.\n|1988\n|TV movie\n|-\n|The Dawning\n|Robert Knights\n|Anthony Hopkins, Hugh Grant, Jean Simmons, Trevor Howard, Rebecca Pidgeon\n|Depiction of the Irish War of Independence through the eyes of the Anglo-Irish landlord class.\n|1988\n|\n|-\n|The Grasscutter\n|Ian Mune\n|Terence Cooper, Ian McElhinney\n|An Ulster Volunteer Force informer living under an assumed identity in New Zealand is revealed, with both loyalist and republican groups eager to track him down.\n|1988\n|\n|-\n|A Casualty of War\n|Tom Clegg\n|\n|Following an American air strike on Libyan leader Colonel Gaddafi's personal residence, the Libyan leader agrees to supply the IRA with weapons in revenge for Britain's involvement. Aware of the plans, MI5 persuade a former SAS man to go undercover and investigate the shipment. It is a dangerous mission especially with all becoming increasingly suspicious of him, who having retired, has become a well-known writer.\n|1989\n|Television film\n|-\n|Elephant\n|Alan Clarke\n|\n|A chilling commentary on the sectarian murders which are everyday events there, covering several sectarian murders that happened during the troubles.\n|1989\n|Television film\n|-\n|Who Bombed Birmingham?\n|Mike Beckham\n|John Hurt, Martin Shaw\n|Docudrama about the Birmingham Pub Bombings and the subsequent Birmingham Six.\n|1991\n|Documentary film\n|-\n|Behind the Mask\n|Frank Martin\n|\n|A documentary on the life and attitudes of IRA members. Includes interviews with Brendan Hughes, Martin Meehan, Joe Cahill, Gerry Adams, and Martin McGuinness, as well as some others.\n|1991\n|Documentary film\n|-\n|The Treaty\n|Jonathan Lewis\n|Brendan Gleeson, Bosco Hogan, Ian Bannen, Julian Fellowes, Barry McGovern\n|Depiction of the negotiations for the 1921 Anglo-Irish Treaty towards the end of the Irish War of Independence, and the aftermath of the treaty leading to the Irish Civil War.\n|1991\n|Television film\n|-\n|Force of Duty\n|Pat O'Connor\n|Adrian Dunbar, Donal McCann, Patrick Malahide\n|An RUC detective is consumed by guilt after he fails to act decisively in a moment of terror. As the pressure on him builds, he gradually loses control of his life.\n|1992\n|Television film\n|-\n|Patriot Games\n|Phillip Noyce\n|Harrison Ford\n|A former CIA analyst witnesses and intervenes in an attempted kidnapping of the British Minister of State for Northern Ireland by a radical IRA splinter group. The group then aims to take revenge on him, while he aims to stop them.\nAdaptation of the 1987 novel by Tom Clancy.\n|1992\n|\n|-\n|The Crying Game\n|Neil Jordan\n|Stephen Rea, Miranda Richardson, Forest Whitaker, Jaye Davidson, Adrian Dunbar, Tony Slattery, Jim Broadbent, Ralph Brown, Andrée Bernard\n|The Provisional IRA unit kidnap a black British soldier after a female member of their unit lures him to a secluded area by promising sex. The unit intends to use him to secure the release of an imprisoned Provisional IRA member. He is executed when the deadline expires. Years later a member of the unit befriends his partner in London.\n|1992\n|\n|-\n|Circles of Deceit\n|Geoffrey Sax\n|\n|The British Secret Service enlists the help of a former Special Air Service soldier to go undercover and infiltrate the IRA.\n|1993\n|Television film\n|-\n|In the Name of the Father\n|Jim Sheridan\n|Daniel Day-Lewis Pete Postlethwaite\n|Based on the Guildford Four, father and son are falsely imprisoned as IRA members accused of committing the Guildford pub bombing.\n|1993\n|\n|-\n|Blown Away\n|Stephen Hopkins\n|Jeff Bridges, Tommy Lee Jones\n|A former IRA bomber escapes from prison and begins a campaign targeting members of the Boston police's bomb squad.\n|1994\n|\n|-\n|Patriots\n|Frank Kerr\n|\n|An Irish-American girl in Boston, whose grandfather fought the Black and Tans, is persuaded to travel to Ireland to help the IRA. Unbeknownst to her, her recruiter is a double agent for the British Army.\n|1994\n|\n|-\n|More Than a Sacrifice\n|Tom Collins\n|\n|A look at how four republicans adjusted to a post-ceasefire way of life after the 1994 IRA ceasefire.\n|1995\n|Documentary film\n|-\n|The Boys of Barr na Sráide\n|Conor O'Carroll\n|\n|\n|1996\n|Short film\n|-\n|Michael Collins\n|Neil Jordan\n|Liam Neeson, Aidan Quinn, Stephen Rea, Alan Rickman, Julia Roberts, Brendan Gleeson\n|Biopic about Irish revolutionary Michael Collins.\n|1996\n|\n|-\n|''Some Mother's Son\n|Terry George\n|Helen Mirren, Fionnula Flanagan\n|Two mothers are faced with a dilemma when their sons in the IRA take part in the 1981 Hunger Strike.\n|1996\n|\n|-\n|The Eliminator''\n|Enda Hughes\n|\n|Set in the middle of the Troubles, it tells the story of a gang of youths in County Armagh known as 'The Organisation' fighting the British secret service for control of a super-vehicle named The Viper, whose plans are in the hands of a republican rebel.\n|1996\n|\n|-\n|''The Devil's Own\n|Alan J. Pakula\n|Brad Pitt, Harrison Ford\n|An NYPD officer discovers that an Irish immigrant they housed is an undercover member of the IRA attempting to purchase missiles.\n|1997\n|\n|-\n|Midnight Man\n|Lawrence Gordon Clark\n|\n|British soldiers force a recently captured IRA member to cooperate with them and to go undercover to prevent an attempt on the life of the U.S. president. But the spy soon realizes that the first plot is but a ruse for a more sinister scheme risking trouble between China and the United Kingdom.\n|1997\n|Television film\n|-\n|A Further Gesture\n(Also known as The Break)\n|Robert Dornhelm\n|Stephen Rea, Alfred Molina, Rosana Pastor, Brendan Gleeson, Jorge Sanz\n|Following his escape from prison, an IRA member escapes to America. Jaded, he is determined not to take up any fresh causes in America. He then falls in with some Guatemalan exiles who aim to assassinate a member of the CIA. He reluctantly helps the amateur trio so that he and one of the Guatemalans he has fallen for can escape together. This “further gesture” is to have unexpected repercussions for all four.\n|1997\n|\n|-\n|The Informant\n|Jim McBride\n|\n|A man who escaped the troubles is reluctantly pulled out of retirement in the Republic of Ireland by the IRAwho bring him back to Belfast to perform one last job due to his skill with an RPG. Initially refusing the job, he realises he has no choice. He is to kill a judge using an RPG. During the getaway he is arrested and becomes a supergrass.\n|1997\n|\n|-\n|The Jackal\n|Michael Caton-Jones\n|Bruce Willis, Richard Gere\n|An ex-IRA gunman is recruited to assist the CIA in tracking down a suspected presidential assassin.\n|1997\n|\n|-\n|The Boxer\n|Jim Sheridan\n|Daniel Day-Lewis, Emily Watson\n|A boxer, and former Provisional IRA returns home from a 14-year stint in prison at the age of 32. Weary of the unbroken cycle of violence in Northern Ireland, he attempts to settle down and live in peace. He starts up a non-sectarian boxing club for boys in an old gymnasium.\n|1997\n|\n|-\n|The General\n|John Boorman\n|Brendan Gleeson\n|Details the life of Dublin underworld figure Martin Cahill.\n|1998\n|\n|-\n|Titanic Town''\n|Roger Michell\n|\n|A mother and her family move during the height of the troubles into a housing estate in Catholic West Belfast. Violent conflict exists side-by-side with normal civilian life. But when an old friend is killed in the crossfire, it leads the mother to a meeting of a women's peace group.\nBased on the 1993 autobiography by Mary Costello.\n|1998\n|\n|-\n|Divorcing Jack\n|David Caffrey\n|David Thewlis, Rachel Griffiths, Jason Isaacs, Richard Gant, Robert Lindsay\n|A Northern Irish reporter gets entangled in a web of political intrigue and sectarian violence, at the same time as Northern Ireland is set to elect a new Prime Minister.\nAdaptation of the 1995 book by Colin Bateman.\n|1998\n|\n|-\n|Ronin\n|John Frankenheimer\n|Robert De Niro\n|IRA operatives hire mercenaries to retrieve a mysterious briefcase.\n|1998\n|\n|-\n|The Craic\n|Ted Emery\n|\n|Two best friends flee from Belfast and illegally enter Australia after a violent confrontation with the IRA.\n|1999\n|\n|-\n|Exiled\n|Bill Muir\n|\n|An Irishman emigrates to New York to escape the tensions of Northern Ireland in 1991. However, this does not free him from strife, soon finding himself in the middle of a gun-running operation involving his cousin and two hot-headed friends.\n|1999\n|\n|-\n|Brits\n|Peter Taylor\n|\n|Depiction of the covert war in Northern Ireland including interviews of former members of 14 Intelligence Company, the RUC Headquarters Mobile Support Unit and MI6.\n|2000\n|Documentary television series\n|-\n|Borstal Boy\n|Peter Sheridan\n|Shawn Hatosy, Danny Dyer, Michael York, Eva Birthistle, Ian McElhinney, Ronnie Drew\n|A young Behan, is jailed during an IRA bombing mission in Liverpool. He loses his naïveté over the three years of his sentence to a juvenile borstal, softening his radical Irish republican stance and warming to his British fellow prisoners.\nBased on the 1958 autobiography by Brendan Behan.\n|2000\n|\n|-\n|An Everlasting Piece\n|Barry Levinson\n|Barry McEvoy, Brían F. O'Byrne, Anna Friel, Pauline McLynn, Laurence Kinlan, Billy Connolly, Enda Oates\n|Two wig salesmen, one Catholic and one Protestant, live in war-torn Belfast, Northern Ireland in the mid-1980s and embark on their plan to get rich through selling hair pieces. Their business ends up involved with the troubles.\n|2000\n|\n|-\n|The Bombmaker\n|Graham Theakston\n|Dervla Kirwan, Mark Womack, David Hunt, Francis Magee, Samantha Bond, Angeline Ball, Keith Duffy, Scott Maslen\n|A former IRA bombmaker is forced to come out of retirement when her daughter is kidnapped and held to ransom.\nBased on the novel by Stephen Leather.\n|2001\n|Television film\n|-\n|Shamrock and Swastika\n|Brendan Culleton, Irina Maldea\n|\n|Examination of the Irish Republican Army's collaboration with the Abwehr during World War II.\n|2001\n|Television documentary\n|-\n|H3\n|Les Blair\n|Dean Lennox Kelly, Mark O'Halloran,\n|Depiction of the 1981 Irish hunger strike.\n|2001\n|\n|-\n|Bloody Sunday\n|Paul Greengrass\n|James Nesbit, Tim Pigott-Smith, Nicholas Farrell, Gerard McSorley\n|Depiction of the 1972 Bloody Sunday massacre.\n|2002\n|Television film\n|-\n|Sunday\n|Charles McDougall\n|Ciarán McMenamin, Christopher Eccleston\n|Depiction of the 1972 Bloody Sunday massacre.\n|2002\n|Television film\n|-\n|The Rising of the Moon\n|Deborah Baxtrom\n|\n|IRA member Bobby Sands is visited by his mother while imprisoned in Northern Ireland.\n|2002\n|\n|-\n|Boxed\n|Marion Comer\n|Tom Murphy\n|A priest is called upon to provide last rites to an IRA prisoner.\n|2002\n|Drama\n|-\n|The Maze\n|\n|\n|A history of the notorious HMP Maze and its role in the troubles.\n|2002\n|Television documentary\n|-\n|Omagh\n|Pete Travis\n|\n|Depiction of the 1998 Omagh Bombing by the Real IRA.\n|2004\n|Television film\n|-\n|Breakfast on Pluto\n|Neil Jordan\n|Cillian Murphy, Liam Neeson, Stephen Rea\n|A transgender woman foundling searching for love and her long-lost mother in small town Ireland and London in the 1970s.\n|2005\n|\n|-\n|The Year London Blew Up\n|Edmund Coulthard\n|\n|Dramadoc about the 1974-75 Provisional IRA campaign in London, which culminated in the Balcombe Street siege.\n|2005\n|Television film\n|-\n|Johnny Was\n|Mark Hammond\n|Patrick Bergin, Samantha Mumba, Lennox Lewis, Roger Daltrey, Eriq La Salle\n|A Provisional IRA volunteer from Ireland escapes his violent past to lie low in London. This changes when his former mentor breaks out of Brixton Prison with members of a dissident republican group hellbent on derailing the Irish peace process.\n|2006\n|\n|-\n|The Wind That Shakes the Barley\n|Ken Loach\n|Cillian Murphy, Liam Cunningham, Pádraic Delaney, Orla Fitzgerald\n|Two brothers join the IRA in the Irish War of Independence after seeing a friend killed by the Black and Tans. However tensions rise when they are on opposing sides in the Irish Civil War that follows.\n|2006\n|\n|-\n|I.R.A. King of Nothing\n|Damian Chapa\n|\n|A disgruntled IRA member becomes Ireland's biggest threat to the peace process.\n|2006\n|\n|-\n|Fifty Dead Men Walking\n|Kari Skogland\n|Ben Kingsley, Rose McGowan, Jim Sturgess\n|A loose adaptation of Martin McGartland's 1997 autobiography of the same name.\n|2008\n|\n|-\n|Hunger\n|Steve McQueen\n|Michael Fassbender, Liam Cunningham\n|Depiction of the Bobby Sands during the 1981 Irish hunger strike.\n|2008\n|\n|-\n|Five Minutes of Heaven\n|Oliver Hirschbiegel\n|Liam Neeson, James Nesbitt\n|Depiction of a historical killing in 1975 during the troubles, and a reconciliation attempt after 33 years.\n|2009\n|\n|-\n|Voices From The Grave\n|Kate O'Callaghan\n|\n| The story of the Northern Ireland Troubles through the Provisional IRA's Brendan Hughes and the UVF's David Ervine, two men who played key roles on opposite sides of the ongoing conflict.\nBased on the book ''Voices from the Grave: Two Men's War in Ireland by Ed Maloney.\n|2010\n|Documentary\n|-\n|Shadow Dancer\n|James Marsh\n|Andrea Riseborough, Clive Owen, Gillian Anderson, Domhnall Gleeson\n|Following a failed bombing an IRA member is turned into an informer for MI5 to avoid imprisonment and protect her son.\nBased on the 1998 novel by Tom Bradby.\n|2012\n|\n|-\n|'71''\n|Yann Demange\n|Jack O'Connell\n|A young British soldier is accidentally abandoned, following a riot in Belfast, in 1971.\n|2014\n|\n|-\n|The Journey\n|Nick Hamm\n|Timothy Spall, Colm Meaney, Freddie Highmore\n|A fictional account of the true story of how political enemies Ian Paisley and Martin McGuinness formed an unlikely political alliance.\n|2016\n|\n|-\n|Rebellion\n|Aku Louhimies\n|Charlie Murphy, Ruth Bradley, Sarah Greene, Brian Gleeson, Niamh Cusack, Michelle Fairley, Ian McElhinney, Barry Ward, Laurence O'Fuarain, Perdita Weeks\n|A five part serial drama about the birth of modern Ireland. The story is told from the perspectives of a group of fictional characters who live through the political events of the 1916 Easter Rising.\n|2016\n|\n|-\n|The Foreigner\n|Martin Campbell\n|Jackie Chan, Pierce Brosnan\n|A man seeks revenge for the death of his daughter, killed by a bombing committed by a rogue faction of the IRA.\n|2017\n|\n|-\n|Maze\n|Stephen Burke\n|Tom Vaughan-Lawlor\n|Prison film about the IRA Maze prison escape of 38 Provisional Irish Republican Army prisoners.\n|2017\n|\n|-\n|Resistance\n|Colin Teevan\n|Brian Gleeson, Simone Kirby, Natasha O'Keeffe, Gavin Drea\n|Set in late 1920, Resistance is a sequel series to the 2016 miniseries Rebellion.\n|2019\n|\n|-\n|Spotlight on the Troubles: A Secret History\n|Peter Johnston\n|\n|A special from Spotlight delving into the role of British Intelligence's \"dirty war\" and collusion during the troubles.\n|2019\n|documentary\n|-\n|Baltimore\n|Christine Molloy Joe Lawlor\n|Imogen Poots\n|Biopic of heiress-turned-IRA member Rose Dugdale.\n|2023\n|\n|-\n|Dead Shot\n|Tom Guard &\nCharles Guard\n|Aml Ameen, Colin Morgan, Tom Vaughan-Lawlor, Sophia Brown, Máiréad Tyers, Mark Strong and Felicity Jones.\n|A retired Irish paramilitary witnesses the shooting of his pregnant wife by a British soldier and escapes, wounded and presumed dead, to 1970s London to plot his revenge.\n|2023\n|\n|-\n|The Secret Army\n|Darragh MacIntyre & Chris Thornton\n|\n|Documentary by Darragh MacIntyre & Chris Thornton investigating the lost 1972 film '''The Secret Army''' by John Bowyer Bell and Zwy Aldouby. It showed segments from the lost film, including some unseen footage of Provisional IRA operations and training. It also included interviews with Des Long, Tony Devine, Jacob Stern, and Tim Pat Coogan.\n|2024\n|Television documentary\n|}\nReferences\nExternal links\n* [http://cain.ulst.ac.uk/images/cinema/nimovies.htm Movies with 'the Troubles' in Northern Ireland as a theme (1968 - Present)]"
    }
  ]
}