{
  "content": [
    {
      "type": "text",
      "text": "# List of war crimes__disambig_1\n\nThis article lists and summarizes the war crimes that have violated the laws and customs of war since the Hague Conventions of 1899 and 1907.\nSince many war crimes are not prosecuted (due to lack of political will, lack of effective procedures, or other practical and political reasons), historians and lawyers will frequently make a serious case in order to prove that war crimes occurred, even though the alleged perpetrators of these crimes were never formally prosecuted because investigations cleared them of all charges.\nUnder international law, war crimes were formally defined as crimes during international trials such as the Nuremberg Trials and the Tokyo Trials, in which Austrian, German and Japanese leaders were prosecuted for war crimes which were committed during World War II.\n1899–1902 Second Boer War\n, a Boer child in a British concentration camp]]\nThe term \"concentration camp\" was used to describe camps operated by the British Empire in South Africa during the Second Boer War in the years 1900–1902. As Boer farms were destroyed by the British under their \"scorched earth\" policy, many tens of thousands of women and children were forcibly moved into the concentration camps. Over 26,000 Boer women and children were to perish in these concentration camps.\nSix officers from the Bushveldt Carbineers were court-martialed for massacring POWs and civilians. Lieutenants Harry Morant, Peter Handcock, and George Witton were each found guilty of murder and sentenced to death. Morant and Handcock were executed, while Witton was reprieved and served a short prison sentence. Two of the other defendants, Major Robert Lenehan and Lieutenant Henry Picton, were found guilty of lesser charges. They were dismissed from the military and deported from South Africa after being found guilty of neglecting one's duty and manslaughter, respectively. The last defendant, Captain Alfred Taylor, was acquitted.\n1899–1902 Philippine–American War\n'' cartoon of May 5, 1902 about General Jacob H. Smith's infamous order \"Kill Everyone Over Ten\". The caption at the bottom reads: \"Criminals Because They Were Born Ten Years Before We Took the Philippines\".]]\nReported American war crimes and atrocities during the Philippine–American War included the summary execution of civilians and prisoners, burning of villages, and torture. 298,000 Filipinos were also moved to concentration camps, where thousands died.\nIn November 1901, the Manila correspondent of the Philadelphia Ledger wrote: \"The present war is no bloodless, opera bouffe engagement; our men have been relentless, have killed to exterminate men, women, children, prisoners and captives, active insurgents and suspected people from lads of ten up, the idea prevailing that the Filipino as such was little better than a dog\".\nIn response to the Balangiga massacre, which wiped out a U.S. company garrisoning Samar town, U.S. Brigadier General Jacob H. Smith launched a retaliatory march across Samar with the instructions: \"I want no prisoners. I wish you to kill and burn, the more you kill and burn the better it will please me. I want all persons killed who are capable of bearing arms in actual hostilities against the United States\".\n1904–1908: Herero Wars\n]]\nIn August, German General Lothar von Trotha defeated the Ovaherero in the Battle of Waterberg and drove them into the desert of Omaheke, where most of them died of dehydration. In October, the Nama people also rebelled against the Germans, only to suffer a similar fate. Between 24,000 and 100,000 Hereros, 10,000 Nama and an unknown number of San died in the parallel Herero and Namaqua genocide. Once defeated, thousands of Hereros and Namas were also imprisoned in concentration camps, where the majority died of diseases, abuse, and exhaustion. German soldiers also regularly engaged in gang rapes before killing the women or leaving them in the desert to die; a number of Herero women were also forced into involuntary prostitution.\n1912-1913: Balkan Wars\nin Prishtina during the Balkan wars]]\nThe Balkan Wars were marked by ethnic cleansing with all parties being responsible for grave atrocities against civilians and helped inspire later atrocities including war crimes during the 1990s Yugoslav Wars.\nMassacres of Albanians in the Balkan Wars were perpetrated on several occasions by Serbian and Montenegrin armies and paramilitaries. According to contemporary accounts, between 20,000 and 25,000 Albanians were massacred in the Kosovo Vilayet during the first two to four months of the conflict; with at least 120,000 being killed in total. Most of the victims were children, women and the elderly. In addition to the massacres, some civilians had their tongues, lips, ears and noses severed. Philip J. Cohen also cited Durham as saying that Serbian soldiers helped bury people alive in Kosovo. Yugoslavia from a Historical Perspective, a 2017 study published in Belgrade by the Helsinki Committee for Human Rights in Serbia, said that villages were burned to ashes and Albanian Muslims forced to flee when Serbo-Montenegrin forces invaded Kosovo in 1912. Some chronicles cited decapitation as well as mutilation.\nThe Serbian army also brutally suppressed the Tikveš uprising and terrorized the Bulgarian population in the rebelling regions. According to some sources, 36 Bulgarian civilians were killed in Kavadarci, 230 in Negotino, and 40 in Vatasha.\n1914–1918: World War I\nlost about 850,000 people during the war, a quarter of its pre-war population.]]\nWorld War I was the first major international conflict to take place following the codification of war crimes at the Hague Convention of 1907, including derived war crimes, such as the use of poisons as weapons, as well as crimes against humanity, and derivative crimes against humanity, such as torture, and genocide. Before, the Second Boer War took place after the Hague Convention of 1899. The Second Boer War (1899 until 1902) is known for the first concentration camps (1900 until 1902) for civilians in the 20th century.\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|- style=\"text-align:center;\"\n| colspan=\"2\"|World War I\n| colspan=\"2\" |German Empire (Imperial Germany)\n|-\n| style=\"width:18%;\"|Rape of Belgium\n| style=\"width:18%;\"|War crimes\n| style=\"width:32%;\"|Leipzig war crimes trials\n| style=\"width:32%;\"|In defiance of the 1907 Hague Convention on Land Warfare, the German occupiers engaged in mass atrocities against the civilian population of Belgium and looting and destruction of civilian property, in order to flush out the Belgian guerrilla fighters, or francs-tireurs, in the first two months of the war, after the German invasion of Belgium in August 1914.\nAs Belgium was officially neutral after hostilities in Europe broke out and Germany invaded the country without explicit warning, this act was also in breach of the treaty of 1839 and the 1907 Hague Convention on Opening of Hostilities.\n|-\n| style=\"width:18%;\"|Killings of Duala civilians during the Kamerun campaign\n| style=\"width:18%;\"|War crimes, Crime against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|German forces ordered a scorched earth policy against the indigenous Duala people to repress an alleged \"people's war.\" Numerous killings were committed by German forces including in Jabassi where a white commander reportedly gave the order to \"kill every native they saw.\"\n|-\n| style=\"width:18%;\"|Sexual violence toward Duala civilians during the Kamerun campaign\n| style=\"width:18%;\"|War crimes, Crime against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Duala women were victims of wartime sexual violence by the German forces.\n|-\n|- style=\"text-align:center;\"\n| colspan=\"2\"|World War I|| colspan=\"2\" style=\"text-align:center;\"|All major belligerents\n|-\n| style=\"width:18%;\"|Employment of poison gas\n| style=\"width:18%;\"|Use of poisons as weapons\n| style=\"width:18%;\"|No prosecutions\n| style=\"width:32%;\"|Poison gas was introduced by Imperial Germany, and was subsequently used by all major belligerents in the war, in violation of the 1899 Hague Declaration Concerning Asphyxiating Gases and the 1907 Hague Convention on Land Warfare.\n|- style=\"text-align:center;\"\n| colspan=\"2\"|World War I|| colspan=\"2\" style=\"text-align:center;\"|Ottoman Empire\n|-\n| style=\"width:18%;\"|Armenian genocide\n| style=\"width:18%;\"|War crimes, crimes against humanity, crime of genocide (extermination of Armenians in Western Armenia)\n| style=\"width:32%;\"|The Turkish Courts-Martial of 1919–20 as well as the incomplete Malta Tribunals were trials of some of the perpetrators.\nSeveral key perpetrators of the genocide were assassinated by Armenian vigilantes as part of Operation Nemesis.\n| style=\"width:32%;\"|The Young Turk regime ordered the wholesale extermination of Armenians living within Western Armenia. This was carried out by certain elements of their military forces, who either massacred Armenians outright, or deported them to Syria and then massacred them. Between 600,000 and 1.5 million Armenians were killed.\nThe Republic of Turkey, the successor state of the Ottoman Empire, does not accept the word genocide as an accurate description of the events surrounding this matter.\n|-\n|style=\"width:18%;\"|Assyrian genocide\n|style=\"width:18%;\"|War crimes, crimes against humanity, genocide, ethnic cleansing\n|style=\"width:32%;\"|Several key perpetrators of the genocide were assassinated by Armenian vigilantes as part of Operation Nemesis\n|style=\"width:32%;\"|Mass killing of Assyrian civilians by the Ottoman Empire's forces resulting in the deaths of hundreds of thousands. Turkey does not call the event genocide.\n|-\n|style=\"width:18%;\"|Greek genocide\n|style=\"width:18%;\"|War crimes, crimes against humanity, genocide, ethnic cleansing\n|style=\"width:32%;\"|The Turkish Courts-Martial of 1919–20 as well as the incomplete Malta Tribunals were trials of some of the perpetrators.\nSeveral key perpetrators of the genocide were assassinated by Armenian vigilantes as part of Operation Nemesis.\n|style=\"width:32%;\"|Violent ethnic cleansing campaign against Greeks in Anatolia resulting in the deaths of hundreds of thousands. Turkey does not call the event mass genocide.\n|-style=\"text-align:Center;\"\n| colspan=\"2\"|World War I|| colspan=\"2\" style=\"text-align:center;\"|United Kingdom\n|-\n| style=\"width:18%;\"|Baralong Incidents\n| style=\"width:18%;\"|War crimes (murder of shipwreck survivors)\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|On 19 August 1915, a German submarine, U-27, while preparing to sink the British freighter Nicosian, which was loaded with war supplies, after the crew had boarded the lifeboats, was sunk by the British Q-ship HMS Baralong. Afterwards, Lieutenant Godfrey Herbert ordered his Baralong crew to kill the survivors of the German submarine while still at sea, including those who were summarily executed after boarding the Nicosian. The massacre was reported to a newspaper by American citizens who were also on board the Nicosian. Another attack occurred on 24 September a month later when Baralong destroyed U-41, which was in the process of sinking the cargo ship Urbino. According to U41's commander Karl Goetz, the British vessel was flying the American flag even after opening fire on the submarine, and the lifeboat carrying the German survivors was rammed and sunk by the British Q-ship.\n|-style=\"text-align:center;\"\n|  colspan=\"2\"|World War I|| colspan=\"2\" style=\"text-align\"|Russian Empire\n|-\n|style=\"width:18%;\"|Urkun\n|style=\"width:18%;\"|War crimes, crimes against humanity, genocide\n|style=\"width:18%;\"|No prosecutions\n|style=\"width:18%;\"|\nUrukun was not covered by Soviet textbooks, and monographs on the subject were removed from Soviet printing houses. As the Soviet Union was disintegrating in 1991, interest in Urkun grew. Some survivors have begun to label the events a \"massacre\" or \"genocide\". In August 2016, a public commission in Kyrgyzstan concluded that the 1916 mass crackdown was labelled as \"genocide\". Arnold Toynbee alleges 500,000 Central Asian Turks perished under the Russian Empire, though he admits this is speculative. Rudolph Rummel citing Toynbee states 500,000 perished within the revolt. Kyrgyz sources put the death toll between 100,000 and 270,000. Russian sources put the figure at 3,000. Kyrgyz historians Shayyrkul Batyrbaeva puts the death toll at 40,000, based on population tallies.\n|-\n|style=\"width:18%;\"|Deportation of Volhynia Germans\n|style=\"width:18%;\"|War crimes, crimes against humanity\n|style=\"width:18%;\"|Although Germans were permitted to return and attempt to reclaim their land, it is estimated that only one-half of their number did so. Many found their houses destroyed and their farms occupied by strangers.\n|style=\"width:18%;\"|Grand Duke Nicholas (who was still commander-in-chief of the Western forces), after suffering serious defeats at the hands of the German army, decided to implement the decrees for the German Russians living under his army's control, principally in the Volhynia province. The lands were to be expropriated, and the owners deported to Siberia. The land was to be given to Russian war veterans once the war was over. In July 1915, without prior warning, 150,000 German settlers from Volhynia were arrested and shipped to internal exile in Siberia and Central Asia. (Some sources indicate that the number of deportees reached 200,000.) Ukrainian peasants took over their lands. The mortality rate from these deportations is estimated to have been 63,000 to 100,000, that is from 30% to 50%, but exact figures are impossible to determine.\n|-\n|-style=\"text-align:center;\"\n|  colspan=\"2\"|World War I|| colspan=\"2\" style=\"text-align\"|Kingdom of Bulgaria\n|-\n|style=\"width:18%;\"|Surdulica massacre\n|style=\"width:18%;\"|Summary executions\n|style=\"width:18%;\"|No prosecutions\n|style=\"width:18%;\"|The Surdulica massacre was the mass murder of Serbian men by Bulgarian occupational authorities in the southern Serbian town of Surdulica between 1915 and 1916, during World War I. Members of the Serbian intelligentsia in the region, mostly functionaries, teachers, priests and former soldiers, were detained by Bulgarian forces—ostensibly so that they could be deported to the Bulgarian capital, Sofia—before being taken into the forests around Surdulica and killed. An estimated 2,000–3,000 Serbian men were executed by the Bulgarians in the town and its surroundings. Witnesses to the massacre were interviewed by American writer William A. Drayton in December 1918 and January 1919.\n|-\n| style=\"width:18%;\"|Massacres of Albanians in World War I\n| style=\"width:18%;\"|War crimes\n| style=\"width:32%;\"|War crimes, crimes against humanity, genocide, ethnic cleansing\n| style=\"width:32%;\"|Committed by Kingdom of Serbia, Kingdom of Montenegro, Kingdom of Bulgaria, Kingdom of Greece\n|-\n|-style=\"text-align:center;\"\n|  colspan=\"2\"|World War I|| colspan=\"2\" style=\"text-align\"|\n|-\n|style=\"width:18%;\"|Štip massacre\n|style=\"width:18%;\"|Summary executions\n|style=\"width:18%;\"|No prosecutions\n|style=\"width:18%;\"|The Štip massacre was the mass murder of Serbian soldiers by the IMRO paramilitaries in the village of Ljuboten, Štip on 15 October 1915, during World War I. Sick and wounded Serbian soldiers, recuperating at the Štip town hospital, were detained by Bulgarian IMRO militants before being taken into the vicinity of Ljuboten and killed. An estimated 118–120 Serbian soldiers were executed in the massacre.\n|-\n|}\n1915–1920: First and Second Caco War\n* During the First (1915) and Second (1918–1920) Caco Wars waged during the United States occupation of Haiti (1915–1934), human rights abuses were committed against the native Haitians population. Overall, American troops and the Haitian gendarmerie killed several thousands of Haitian civilians during the rebellions between 1915 and 1920, though the exact death toll is unknown.\n* Mass killings of civilians were allegedly committed by United States Marines and their subordinates in the Haitian gendarmerie. According to Haitian historian Roger Gaillard, such killings involved rape, lynchings, summary executions, burning villages and deaths by burning. Internal documents of the United States Army justified the killing of women and children, describing them as \"auxiliaries\" of rebels. A private memorandum of the Secretary of the Navy criticized \"indiscriminate killings against natives\". American officers who were responsible for acts of violence were given Creole names such as \"Linx\" for Commandant Freeman Lang and \"Ouiliyanm\" for Lieutenant Lee Williams. According to American journalist H. J. Seligman, Marines would practice \"bumping off Gooks\", describing the shooting of civilians in a manner which was similar to killing for sport.\n* During the Second Caco War of 1918–1919, many Caco prisoners were summarily executed by Marines and the gendarmerie on orders from their superiors. On June 4, 1916, Marines executed caco General Mizrael Codio and ten others after they were captured in Fonds-Verrettes. In Hinche in January 1919, Captain Ernest Lavoie of the gendarmerie, a former United States Marine, allegedly ordered the killing of nineteen caco rebels according to American officers, though no charges were ever filed against him due to the fact that no physical evidence of the killing was ever presented.\n* The torture of Haitian rebels and the torture of Haitians who were suspected of rebelling against the United States was a common practice among the occupying Marines. Some of the methods of torture included the use of water cure, hanging prisoners by their genitals and ceps, which involved pushing both sides of the tibia with the butts of two guns.\n1921–1927: Rif War\n* During the Rif War, Spanish forces used chemical weapons against Berber rebels and civilians in Morocco. These attacks marked the first widespread employment of gas warfare in the post-WWI era. The Spanish army indiscriminately used phosgene, diphosgene, chloropicrin and mustard gas against civilian populations, markets and rivers. Spain signed the Geneva Protocol in 1925, that prohibited chemical and biological warfare, while simultaneously employing these weapons across the Mediterranean.\n* According to Miguel Alonso, Alan Kramer and Javier Rodrigo in the book Fascist Warfare, 1922–1945: Aggression, Occupation, Annihilation: \"Apart from deciding not to use chemical weapons, Franco's campaign to 'cleanse Spain' resembled that in Morocco: intelligence-gathering through torture, summary executions, forced labour, rape, and the sadistic killing of military prisoners.\"\n* Spanish mutilations of captured Moroccans were reported, including castration and severing heads, noses and ears, which were collected by Spanish legionnaries as war trophies and worn as necklaces or spiked on bayonets.\n* On August 9, 1921, the Massacre of Monte Arruit occurred, in which 2,000 soldiers of the Spanish Army were killed by Riffian forces after surrendering the Monte Arruit garrison near Al Aaroui following a 12-day siege.\n1923–1932: Pacification of Libya\n* The Pacification of Libya resulted in mass deaths of the indigenous people in Cyrenaica by Italy. 80,000 or over a quarter of the indigenous people in Cyrenaica perished during the pacification. 100,000 Bedouin citizens were also ethnically cleansed by expulsion from their land.\n* Italian war crimes included the use of chemical weapons, execution of surrendering combatants, and killing of civilians. According to Knud Holmboe tribal villages were being bombed with mustard gas by the spring of 1930, and suspects were hanged or shot in the back, with estimated thirty executions taking place daily.\n1927-1949: Chinese Civil War\n*During the Chinese Civil War both the Nationalists and Communists carried out mass atrocities, with millions of non-combatants deliberately killed by both sides. Benjamin Valentino has estimated atrocities in the Chinese Civil War resulted in the death of between 1.8&nbsp;million and 3.5&nbsp;million people between 1927 and 1949.\n*Over several years after the 1927 Shanghai massacre, the Kuomintang killed between 300,000 and one million people, primarily peasants, in anti-communist campaigns as part of the White Terror. During the White Terror, the Nationalists specifically targeted women with short hair who had not been subjected to foot binding, on the presumption that such \"non-traditional\" women were radicals. Nationalist forces cut off their breasts, shaved their heads, and displayed their mutilated bodies to intimidate the populace. From 1946 to 1949, the Nationalists arrested, tortured, and killed political dissidents via the Sino-American Cooperative Organization.\n*During the December 1930 Futian incident, the communists executed 2,000 to 3,000 members of the Futian battalion after its leaders had mutinied against Mao Zedong. Between 1931 and 1934 in the Jiangxi–Fujian Soviet, the communist authorities engaged in a widespread campaign of violence against civilians to ensure compliance with its policies and to stop defection to the advancing KMT, including mass executions, land confiscation and forced labor. According to Li Weihan, a high-ranking communist in Jiangxi at the time, in response to mass flight of civilians to KMT held areas, the local authorities would \"usually send armed squads after those attempting to flee and kill them on the spot, producing numerous mass graves throughout the CSR [Chinese Soviet Republic in Jiangxi] that would later be uncovered by the KMT and its allies.\" Zhang Wentian, another high-ranking communist, reported that \"the policy of annihilating landlords as an exploiting class had degenerated into a massacre\" The population of the communist controlled area fell by 700,000 from 1931 and 1935, of which a large proportion were murdered as “class enemies,” worked to death, committed suicide, or died in other circumstances attributable to the communists.\n*During the Siege of Changchun the People's Liberation Army implemented a military blockade on the KMT-held city of Changchun and prevented civilians from leaving the city during the blockade; this blockade caused the starvation of tens to 150 thousand civilians. The PLA continued to use siege tactics throughout Northeast China.\n*At the outbreak of the Chinese Civil War in 1946, Mao Zedong began to push for a return to radical policies to mobilize China against the landlord class, but protected the rights of middle peasants and specified that rich peasants were not landlords. The 7 July Directive of 1946 set off eighteen months of fierce conflict in which all rich peasant and landlord property of all types was to be confiscated and redistributed to poor peasants. Party work teams went quickly from village to village and divided the population into landlords, rich, middle, poor, and landless peasants. Because the work teams did not involve villagers in the process, however, rich and middle peasants quickly returned to power. The Outline Land Law of October 1947 increased the pressure. Those condemned as landlords were buried alive, dismembered, strangled and shot.\n*In response to the aforementioned land reform campaign; the Kuomintang helped establish the \"Huanxiang Tuan\" (), or Homecoming Legion, which was composed of landlords who sought the return of their redistributed land and property from peasants and CCP guerrillas, as well as forcibly conscripted peasants and communist POWs. The Homecoming legion conducted its guerrilla warfare campaign against CCP forces and purported collaborators up until the end of the civil war in 1949.\n1935–1937: Second Italo-Abyssinian War\n* Italian use of mustard gas against Ethiopian soldiers in 1936 violated the 1925 Geneva Protocol, which bans the use of chemical weapons in warfare.\n* Crimes by Ethiopian troops included the use of dum-dum bullets (in violation of the Hague Conventions), the killing of civilian workmen (including during the Gondrand massacre), and the mutilation of captured Eritrean Ascari and Italians (often with castration), beginning in the first weeks of war.\n* Yekatit 12—In response to the unsuccessful assassination of Rodolfo Graziani on 19 February 1937, thousands of Ethiopians were killed, including all of the monks residing at Debre Libanos, and over a thousand more detained at Danan who were then exiled either to the Dahlak Islands or Italy.An account of this atrocity, known in Ethiopia as \"Yekatit 12\", is contained in chapter 14 of Anthony Mockler's ''Haile Selassie's War'' (New York: Olive Branch, 2003)\n* The Ethiopians recorded 275,000 combatants killed in action, 78,500 patriots (guerrilla fighters) killed during the occupation, 17,800 civilians killed by aerial bombardment and 30,000 in the February 1937 massacre, 35,000 people died in concentration camps, 24,000 patriots executed by Summary Courts, 300,000 people died of privation due to the destruction of their villages, amounting to 760,300 deaths.\n1936–1939: Spanish Civil War\nat the beginning of the Spanish Civil War]]\nAt least 50,000 people were executed during the Spanish Civil War. In his updated history of the Spanish Civil War, Antony Beevor writes, \"Franco's ensuing 'white terror' claimed 200,000 lives. The 'red terror' had already killed 38,000.\" Julius Ruiz concludes that \"although the figures remain disputed, a minimum of 37,843 executions were carried out in the Republican zone with a maximum of 150,000 executions (including 50,000 after the war) in Nationalist Spain.\"\nCésar Vidal puts the number of Republican victims at 110,965. In 2008 a Spanish judge, Baltasar Garzón, opened an investigation into the executions and disappearances of 114,266 people between 17 July 1936 and December 1951. Among the murders and executions investigated was that of poet and dramatist Federico García Lorca.\n1939–1945: World War II\n1946–1954: Indochina War\nThe French Union's struggle against the independence movement backed by the Soviet Union and China claimed 400,000 to 1.5 million Vietnamese lives from 1945 to 1954. In the Haiphong massacre of November 1946, about 6,000 Vietnamese were killed by French naval artillery. The French employed electric shock treatment during interrogations of the Vietnamese, and nearly 10,000 Vietnamese perished in French concentration camps.\nAccording to Arthur J. Dommen, the Viet Minh assassinated 100,000–150,000 civilians during the war, while Benjamin Valentino estimates that the French were responsible for 60,000 to 250,000 civilian deaths.\nAbout French massacres and war crimes during the conflict, Christopher Goscha wrote on The Penguin History of Modern Vietnam: \"Rape became a disturbing weapon used by the Expeditionary Corps, as did summary executions. Young Vietnamese women who could not escape approaching enemy patrols smeared themselves with any stinking thing they could find, including human excrement. Severed heads were raised on sticks, bodies were gruesomely disemboweled, and body parts were taken as 'souvenirs'; Vietnamese soldiers of all political colors also committed such acts. The non-communist nationalist singer, Phạm Duy, wrote a bone-chilling ballad about the mothers of Gio Linh village in central Vietnam, each of whom had lost a son to a French Army massacre in 1948. Troops decapitated their bodies and displayed their heads along a public road to strike fear into those tempted to accept the Democratic Republic of Vietnam's sovereignty. Massacres did not start with the Americans in My Lai, or the Vietnamese communists in Hue in 1968. And yet, the French Union's massacre of over two hundred Vietnamese women and children in My Tratch in 1948 remains virtually unknown in France to this day.\"\n1947–1948: Malagasy Uprising\nDuring the French suppression of the pro-independence Malagasy Uprising, numerous atrocities were carried out such as mass killings, village burnings, torture, war rape, collective punishment, and throwing live prisoners out of airplanes (death flights). Between 11,000 and 90,000 Malagasy died in the fighting, along with about 800 French soldiers and other Europeans.\n1948 Arab–Israeli War\nDuring the 1948 Arab–Israeli War, numerous villages were destroyed, and large-scale displacement occurred, with more than 350 Arab villages wiped out and roughly 535,000 Palestinian Arabs forced to flee or resettle in neighboring countries. Nearly 15,000 people were killed during the war, including around 6,000 Jews and about 8,000 Arabs (mostly Muslims). Many of these actions, including attacks on civilians and forced expulsions, are cited as war crimes.\n1945–1949: Indonesian War of Independence\n* South Sulawesi Campaign, about 4,500 civilians killed by Pro-Indonesian and Indonesian forces and pro-Dutch and Dutch colonial forces (KNIL).\n* Rawagede massacre: about 431 civilians killed by Dutch forces\n* Bersiap massacre: about 25,000 Indo-European civilians, Dutch, and loyalists killed by Indonesian nationalist forces.\n* Indonesian National Revolution: About 100–150,000 Chinese, Communists, Europeans (French, German, British), pro-Dutch etc. were killed by Indonesian nationalist forces and Indonesian youth.\n1948–1960: Malayan Emergency\n* War crimes: In the Batang Kali massacre, about 24 unarmed villagers were killed by British troops. The British government claimed that these villagers were insurgents attempting to escape but this was later known to be entirely false as they were unarmed, nor actually supporting the insurgents nor attempting to escape after being detained by British troops. No British soldier was prosecuted for the murder at Batang Kali.\n* War crimes: includes beating, torturing, and killing by British troops and communist insurgents of non-combatants.\n* War crimes: As part of the Briggs Plan devised by British General Sir Harold Briggs, 500,000 people (roughly ten percent of Malaya's population) were eventually removed from the land and interned in guarded camps called \"New Villages\". The intent of this measure was to isolate villagers from contact with insurgents. While considered necessary, some of the cases involving the widespread destruction went beyond justification of military necessity. This practice was prohibited by the Geneva Conventions and customary international law which stated that the destruction of property must not happen unless rendered absolutely necessary by military operations.\n1950–1953: Korean War\nUnited States perpetrated crimes\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Korean War\n| colspan=\"2\" |United States\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|No Gun Ri massacre\n| style=\"width:18%;\"|War crimes (murder of civilians)\n| style=\"width:32%;\"|United States\n| style=\"width:32%;\"|In July 1950, during the early weeks of the Korean War, an undetermined number of South Korean refugees were killed by the 2nd Battalion, 7th U.S. Cavalry Regiment, and a U.S. air attack at a railroad bridge near the village of No Gun Ri,  southeast of Seoul, South Korea. Commanders feared enemy infiltrators among such refugee columns. Estimates of the dead have ranged from dozens to 500. In 2005, a South Korean government committee certified the names of 163 dead or missing and 55 wounded and added that many other victims' names were not reported. The South Korean government-funded No Gun Ri Peace Foundation estimated in 2011 that 250–300 were killed, mostly women and children.\n|}\nNorth Korean perpetrated crimes\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Korean War\n| colspan=\"2\" |North Korea and China\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Seoul National University Hospital Massacre\n| style=\"width:18%;\"|War crimes, Crimes against humanity (Mass murder of civilians)\n| style=\"width:32%;\"|North Korea\n| style=\"width:32%;\"|The Seoul National University Hospital Massacre ( Hanja: 서울國立大學校附属病院虐殺事件) was a massacre committed by the North Korean Army on June 18, 1950, of 700 to 900 doctors, nurses, inpatient civilians and wounded soldiers at the Seoul National University Hospital, Seoul district of South Korea. During the First Battle of Seoul, the North Korean Army wiped out one platoon which guarded Seoul National University Hospital on June 28, 1950. They massacred medical personnel, inpatients and wounded soldiers. The North Korean Army shot or buried people alive. The victims amounted to 900. According to the South Korean Ministry of National Defense, the victims included 100 South Korean wounded soldiers.\n|-\n|Chaplain–Medic massacre\n||War crimes (murder of wounded military personnel and a chaplain)\n||North Korea\n||On July 16, 1950, 30 unarmed, critically wounded U.S. Army soldiers and an unarmed chaplain were killed by members of the North Korean People's Army during the Battle of Taejon.\n|-\n|Bloody Gulch massacre\n||War crimes (murder of prisoners of war)\n||North Korea\n||On August 12, 1950, 75 captured U.S. Army prisoners of war were executed by members of the North Korean People's Army on a mountain above the village of Tunam, South Korea, during one of the smaller engagements of the Battle of Pusan Perimeter.\n|-\n|Hill 303 massacre\n||War crimes (murder of prisoners of war)\n||North Korea\n||On August 17, 1950, following a UN airstrike on Hill 131 which was already occupied by the North Korean Army from the Americans, a North Korean officer said that the American soldiers were closing in on them and they could not continue to hold the captured American prisoners. The officer ordered the men shot, and the North Koreans then fired into the kneeling Americans as they rested in the gully, killing 41.\n|-\n|Sunchon Tunnel Massacre\n|War crimes (murder of prisoners of war)\n|North Korea\n|180 American prisoners of war, survivors of the Seoul-Pyongyang death march, were loaded onto a railroad car and brought to the Sunchon tunnel on October 30, 1950. Prisoners, who were already suffering from lack of food, water, and medical supplies were brought in groups of approximately 40 ostensibly to receive food and were shot by North Korean soldiers. 138 Americans in total died; 68 were murdered, 7 died of malnutrition, and the remainder died in the tunnel of pneumonia, dysentery, and malnutrition on the trip from Pyongyang.\n|-\n|}\n* Rudolph Rummel estimated that the North Korean Army executed at least 500,000 civilians during the Korean War with many dying in North Korea's drive to conscript or forcibly recruit South Koreans to their war effort. Throughout the conflict, North Korean and Chinese forces routinely mistreated and tortured U.S. and other UN prisoners of war. Mass starvation and diseases swept through the Chinese-run POW camps during the winter of 1950–51. About 43 percent of all U.S. POWs died during this period. In violation of the Geneva Conventions, which explicitly stated that captor states must repatriate prisoners of war to their homeland as quickly as possible, North Korea detained South Korean POWs for decades after the ceasefire. Over 88,000 South Korean soldiers were missing and the Communists' themselves had claimed they had captured 70,000 South Koreans.\nSouth Korean perpetrated crimes\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Korean War\n| colspan=\"2\" |South Korea\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n|Jeju uprising\n|War crimes, Crimes against humanity (mass murder of civilians)\n|South Korea\n|The island of Jeju was considered a stronghold of the Korean independence movement and the South Korean Labor Party. Syngman Rhee had proclaimed martial law to quell an insurgency.\nUp to 10% of the island's population died (14,000 to 30,000) as a result of the conflict, and another 40,000 fled to Japan.\n|-\n| style=\"width:18%;\"|Bodo League massacre\n| style=\"width:18%;\"|War crimes, Crimes against humanity (mass murder of civilians)\n| style=\"width:32%;\"|South Korea\n| style=\"width:32%;\"|The Bodo League massacre () was a massacre and war crime against communists and suspected sympathisers that occurred in the summer of 1950 during the Korean War. Estimates of the death toll vary. According to Prof. Kim Dong-Choon, Commissioner of the Truth and Reconciliation Commission, at least 100,000 people were executed on suspicion of supporting communism; others estimate 200,000 deaths. The massacre was wrongly blamed on the communists for decades.\n|-\n||Goyang Geumjeong Cave Massacre\n||War crimes (Mass murder of civilians)\n||South Korea\n||The Goyang Geumjeong Cave Massacre ( Hanja: 高陽衿井窟民間人虐殺 Goyang Geunjeong Cave civilian massacre) was a massacre conducted by the police officers of Goyang Police Station of the South Korean Police under the commanding of head of Goyang police station between 9 October 1950 and 31 October 1950 of 150 or over 153 unarmed citizens in Goyang, Gyeonggi-do district of South Korea. After the victory of the Second Battle of Seoul, South Korean police arrested and killed people and their families who they suspected had been sympathisers during North Korean rule. During the massacre, South Korean Police conducted Namyangju Massacre in Namyangju near Goyang.\n|-\n|Sancheong-Hamyang massacre\n|War Crimes (Mass murder of civilians)\n|South Korea\n|The Sancheong-Hamyang massacre () was a massacre conducted by a unit of the South Korean Army 11th Division during the Korean War. On February 7, 1951, 705 unarmed citizens in Sancheong and Hamyang, South Gyeongsang district of South Korea were killed. The victims were civilians and 85% of them were women, children, and elderly people.\n|-\n||Ganghwa massacre\n||War crimes (Mass murder of civilians)\n||South Korea\n||The Ganghwa (Geochang) massacre  () was a massacre conducted by the third battalion of the 9th regiment of the 11th Division of the South Korean Army between February 9, 1951, and February 11, 1951, on 719 unarmed citizens in Geochang, South Gyeongsang district of South Korea. The victims included 385 children.\n|}\n1952–1960: Mau Mau uprising\n* In attempt to suppress the insurgency in Kenya, British colonial authorities suspended civil liberties within the country. In response to the rebellion, many Kikuyu were relocated. According to British authorities 80,000 were interned. Caroline Elkins estimated that between 160,000 and 320,000 were moved into concentration camps. Other estimates are as high as 450,000 interned. Most of the remainder – more than a million – were held in \"enclosed villages\". Although some were Mau Mau guerillas, many were victims of collective punishment that colonial authorities imposed on large areas of the country. Thousands suffered beatings and sexual assaults during \"screenings\" intended to extract information about the Mau Mau threat. Later, prisoners suffered even worse mistreatment in an attempt to force them to renounce their allegiance to the insurgency and to obey commands. Significant numbers were murdered; official accounts describe some prisoners being roasted alive. Prisoners were questioned with the help of \"slicing off ears, boring holes in eardrums, flogging until death, pouring paraffin over suspects who were then set alight, and burning eardrums with lit cigarettes\". The British colonial police used a \"metal castrating instrument\" to cut off testicles and fingers. \"By the time I cut his balls off\", one settler boasted, \"he had no ears, and his eyeball, the right one, I think, was hanging out of its socket. Too bad, he died before we got much out of him.\" According to David Anderson, the British hanged over 1,090 suspected rebels: far more than the French had executed in Algeria during the Algerian War. Another 400 were sentenced to death but reprieved because they were under 18 or women. The British declared some areas prohibited zones where anyone could be shot. It was common for Kikuyu to be shot because they \"failed to halt when challenged.\"\n* The Chuka Massacre, which happened in Chuka, Kenya, was perpetrated by members of the King's African Rifles B Company in June 1953 with 20 unarmed people killed during the Mau Mau uprising. Members of the 5th KAR B Company entered the Chuka area on June 13, 1953, to flush out rebels suspected of hiding in the nearby forests. Over the next few days, the regiment had captured and executed 20 people suspected of being Mau Mau fighters for unknown reasons. It is found out that most of the people executed were actually belonged to the Kikuyu Home Guard – a loyalist militia recruited by the British to fight an increasingly powerful and audacious guerrilla enemy. The commanding officer of the soldiers responsible, Major Gerald Griffiths, was court-martialed for murder. He was found guilty and sentenced to 7 years in prison. In an atmosphere of atrocity and reprisal, the matter was swept under the carpet and nobody else ever stood trial for the massacre.\n* The Hola massacre was an incident during the conflict in Kenya against British colonial rule at a colonial detention camp in Hola, Kenya. By January 1959 the camp had a population of 506 detainees of whom 127 were held in a secluded \"closed camp\". This more remote camp near Garissa, eastern Kenya, was reserved for the most uncooperative of the detainees. They often refused, even when threats of force were made, to join in the colonial \"rehabilitation process\" or perform manual labour or obey colonial orders. The camp commandant outlined a plan that would force 88 of the detainees to bend to work. On 3 March 1959, the camp commandant put this plan into action – as a result, 11 detainees were clubbed to death by guards. 77 surviving detainees sustained serious permanent injuries. The British government accepts that the colonial administration tortured detainees, but denies liability.\n* The Lari massacre in the settlement of Lari occurred on the night of 25–26 March 1953, in which Mau Mau militants herded Kikuyu men, women and children into huts and set fire to them, killing anyone who attempted to escape. Official estimates place the death toll from the Lari massacre at 74 dead.Anderson, David (2005). Histories of the Hanged. W.W. Norton & Company, pg. 119–80\n* Mau Mau militants also tortured, mutilated and murdered Kikuyu on many occasions.Ogot, Bethwell Allan (1995). \"The Decisive Years: 1956–63\"  Mau Mau racked up 1,819 murders of their fellow Africans, though again this number excludes the many additional hundreds who 'disappeared', whose bodies were never found.Anderson, David (2005). Histories of the Hanged. W. W. Norton & Company, pg. 84\n1954–1962: Algerian War\nThe insurgency began in 1945 and was revived in 1954, winning independence in the early 1960s. The French army killed thousands of Algerians in the first round of fighting in 1945. After the Algerian independence movement formed a National Liberation Front (FLN) in 1954, the French Minister of the Interior joined the Minister of National Defense in 1955 in ordering that every rebel carrying a weapon, suspected of doing so, or suspected of fleeing, must be shot. French troops executed civilians from nearby villages when rebel attacks occurred, tortured both rebels and civilians, and interned Arabs in camps, where forced labor was required of some of them. 2,000,000 Algerians were displaced or forcibly resettled during the war, and over 800 villages were destroyed from 1957 to 1960.\nOther French crimes included deliberate bombing, torture and mutilation of civilians, rape and sexual assaults, disembowelment of pregnant women, imprisonment without food in small cells, throwing detainees from helicopters and into the sea with concrete on their feet, and burying people alive.\nThe FLN also indulged in a large amount of atrocities, both against French pieds-noirs and against fellow Algerians whom they deemed as supporting the French or simply as refusing to support the Liberation effort. These crimes included killing unarmed children, women and the elderly, rape and disembowelment or decapitation of women and murdering children by slitting their throats or banging their heads against walls. French sources estimated that 70,000 Muslim civilians were killed, or abducted and presumed killed, by the FLN during the war. The FLN also killed 30,000 to 150,000 in people in post-war reprisals.\n1955–1975: Vietnam War\nUnited States perpetrated crimes\nDuring the war 95 U.S. Army personnel and 27 U.S. Marine Corps personnel were convicted by court-martial of the murder or manslaughter of Vietnamese.\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Vietnam War\n| colspan=\"2\" |United States\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Marion McGhee, Chu Lai\n| style=\"width:18%;\"|Murder\n| style=\"width:32%;\"|Lance Corporal Marion McGhee\n| style=\"width:32%;\"|On 12 August 1965 Lcpl McGhee of Company M, 3rd Battalion, 3rd Marines, walked through Marine lines at Chu Lai Base Area toward a nearby village. In answer to a Marine sentry's shouted question, he responded that he was going after a VC. Two Marines were dispatched to retrieve McGhee and as they approached the village they heard a shot and a woman's scream and then saw McGhee walking toward them from the village. McGhee said he had just killed a VC and other VC were following him. At trial Vietnamese prosecution witnesses testified that McGhee had kicked through the wall of the hut where their family slept. He seized a 14-year-old girl and pulled her toward the door. When her father interceded, McGhee shot and killed him. Once outside the house the girl escaped McGhee with the help of her grandmother. McGhee was found guilty of unpremeditated murder and sentenced him to confinement at hard labor for ten years. On appeal this was reduced to 7 years and he actually served 6 years and 1 month.\n|-\n| style=\"width:18%;\"|Xuan Ngoc (2)\n| style=\"width:18%;\"|Murder and rape\n| style=\"width:32%;\"|PFC John D. Potter Jr.Hospitalman John R. BretagPFC James H. Boyd Jr.Sergeant Ronald L. Vogel\n| style=\"width:32%;\"|On 23 September 1966, a nine-man ambush patrol from the 1st Battalion, 5th Marines, left Hill 22, northwest of Chu Lai. Private First Class John D. Potter Jr. took effective command of the patrol. They entered the hamlet of Xuan Ngoc (2) and seized Dao Quang Thinh, whom they accused of being a Viet Cong, and dragged him from his hut. While they beat him, other patrol members forced his wife, Bui Thi Huong, from their hut and four of them raped her. A few minutes later three other patrol members shot Dao Quang Thinh, Bui, their child, Bui's sister-in-law, and her sister in- law's child. Bui Thi Huong survived to testify at the courts-martial. The company commander suspicious of the reported \"enemy contact\" sent Second Lieutenant Stephen J. Talty, to return to the scene with the patrol. Once there, Talty realized what had happened and attempted to cover up the incident. A wounded child was discovered alive and Potter bludgeoned it to death with his rifle. Potter was convicted of premeditated murder and rape, and sentenced to confinement at hard labor for life, but was released in February 1978, having served 12 years and 1 month. Hospitalman John R. Bretag testified against Potter and was sentenced to 6 month's confinement for rape. PFC James H. Boyd Jr., pleaded guilty to murder and was sentenced to 4 years confinement at hard labor. Sergeant Ronald L. Vogel was convicted for murder of one of the children and rape and was sentenced to 50 years confinement at hard labor, which was reduced on appeal to 10 years, of which he served 9 years. Two patrol members were acquitted of major charges, but were convicted of assault with intent to commit rape and sentenced to 6 months' confinement. Lt Talty was found guilty of making a false report and dismissed from the Marine Corps, but this was overturned on appeal.\n|-\n| style=\"width:18%;\"|Charles W. Keenan and Stanley J. Luczko\n| style=\"width:18%;\"|Murder\n| style=\"width:32%;\"|PFC Charles W. KeenanCPL Stanley J. Luczko\n| style=\"width:32%;\"|PFC Charles W. Keenan was convicted of murder by firing at point-blank range into an unarmed, elderly Vietnamese woman, and an unarmed Vietnamese man. His life sentence was reduced to 25 years confinement. Upon appeal, the conviction for the woman's murder was dismissed and confinement was reduced to five years. Later clemency action further reduced his confinement to 2 years and 9 months. Corporal Stanley J. Luczko, was found guilty of voluntary manslaughter and sentenced to confinement for three years\n|-\n|Thuy Bo incident\n|Murder (disputed)\n|Company H, 2nd Battalion, 1st Marines\n|From 31 January to 1 February 1967 145 civilians were purported to have been killed by Company H, 2nd Battalion, 1st Marines. Marine accounts record 101 Viet Cong and 22 civilians killed during a 2-day battle. Marines casualties were 5 dead and 26 wounded.\n|-\n| style=\"width:18%;\"|My Lai massacre\n| style=\"width:18%;\"|War crimes (Various crimes)\n| style=\"width:32%;\"|Lt. William Calley convicted in 1971 of premeditated murder of 22 civilians for his role in the massacre and sentenced to life in prison. He served 3½ years under house arrest. Others were indicted but not convicted.\n| style=\"width:32%;\"|On March 16, 1968, a US army platoon led by Lt. William Calley killed (and in some cases beat, raped, tortured, or maimed) 347 to 504 unarmed civilians – primarily women, children, and old men – in the hamlets of My Lai and My Khe of Sơn Mỹ. The My Lai massacre was allegedly an operation of the Phoenix Program. 26 US soldiers, including 14 officers, were charged with crimes related to the My Lai massacre and its coverup. Most of the charges were eventually dropped, and only Lt. Calley was convicted.\n|-\n| style=\"width:18%;\"|Huế\n| style=\"width:18%;\"|Murder\n| style=\"width:32%;\"|Lcpl Denzil R. AllenPvt Martin R. AlvarezLcpl John D. BelknapLcpl James A. MaushartPFC Robert J. Vickers\n| style=\"width:32%;\"|On 5 May 1968, Lcpl Denzil R. Allen led a six-man ambush patrol from the 1st Battalion, 27th Marines near Huế. They stopped and interrogated two unarmed Vietnamese men who Allen and Private Martin R. Alvarez then executed. After an attack on their base that night the unit sent out a patrol who brought back three Vietnamese men. Allen, Alvarez, Lance Corporals John D. Belknap, James A. Maushart, PFC Robert J. Vickers, and two others then formed a firing squad and executed two of the Vietnamese. The third captive was taken into a building where Allen, Belknap, and Anthony Licciardo Jr., hanged him, when the rope broke Allen cut the man's throat, killing him. Allen pleaded guilty to five counts of unpremeditated murder and was sentenced to confinement at hard labor for life reduced to 20 years in exchange for the guilty plea. Allen's confinement was reduced to 7 years and he was paroled after having served only 2 years and 11 months confinement. Maushart pleaded guilty to one count of unpremeditated murder and was sentenced to 2 years confinement of which he served 1 year and 8 months. Belknap and Licciardo each pleaded guilty to single murders and were sentenced to 2 years confinement. Belknap served 15 months while Licciardo served his full sentence. Alvarez was found to lack mental responsibility and found not guilty. Vickers was found guilty of two counts of unpremeditated murder, but his convictions were overturned on review\n|-\n| style=\"width:18%;\"|Ronald J. Reese and Stephen D. Crider\n| style=\"width:18%;\"|Murder\n| style=\"width:32%;\"|Cpl Ronald J. ReeseLcpl Stephen D. Crider\n| style=\"width:32%;\"|On the morning of 1 March 1969 an eight-man Marine ambush was discovered by three Vietnamese girls, aged about 13, 17, and 19, and a Vietnamese boy, about 11. The four shouted their discovery to those being observed by the ambush. Seized by the Marines, the four were bound, gagged, and led away by Corporal Ronald J. Reese and Lance Corporal Stephen D. Crider. Minutes later, the 4 children were seen, apparently dead, in a small bunker. The Marines tossed a fragmentation grenade into the bunker, which then collapsed the damaged structure atop the bodies. Reese and Crider were each convicted of four counts of murder and sentenced to confinement at hard labor for life. On appeal both sentences were reduced to 3 years confinement.\n|-\n|Son Thang massacre\n|Murder\n|Company B, 1st Battalion, 7th Marines. One person was sentenced to life in prison, another sentenced to 5 years, but both sentences were reduced to less than a year.\n|16 unarmed women and children were killed in the Son Thang Hamlet, on February 19, 1970, with those killed reported as enemy combatant.\n|-\n|Tiger Force\n|War crimes; crime of torture and murder\n|Tiger Force LRRP\n|Tiger Force was the name of a long-range reconnaissance patrol unit of the 1st Battalion (Airborne), 327th Infantry, 1st Brigade (Separate), 101st Airborne Division, which fought in the from November 1965 to November 1967. The unit gained notoriety after investigations during the course of the war and decades afterwards revealed extensive war crimes against civilians, which numbered into the hundreds. They were accused of routine torture, execution of prisoners of war and the intentional killing of civilians. US army investigators concluded that many of the alleged war crimes took place.\n|-\n|Operation Speedy Express\n|War Crimes (Various crimes)(disputed)\n|9th Infantry Division (US Army) under General Julian Ewell\n|A six-month operation across several provinces in the Mekong Delta, which were internally reported between 5,000 and 7,000 civilian casualties. The official U.S. body count was 10,889 enemy combatants killed with 748 weapons recovered. The commander of the 9th Division, MG Ewell, was allegedly known to be obsessed with body counts and favorable kill ratios and said \"the hearts and minds approach can be overdone....in the delta the only way to overcome VC control and terror is with brute force applied against the VC\". David Hackworth, a battalion commander during Speedy Express, said \"a lot of innocent Vietnamese civilians got slaughtered because of the Ewell-Hunt drive to have the highest count in the land.\"\n|-\n|Brigadier General John W. Donaldson\n|Murder\n|11th Infantry Brigade\nCommander: Brigadier General John W. Donaldson\n|On 2 June 1971, Donaldson was charged with the murder of six Vietnamese civilians but was acquitted due to lack of evidence. In 13 separate incidences John Donaldson was reported to have flown over civilian areas shooting at civilians. He was the first U.S. general charged with war crimes since General Jacob H. Smith in 1902 and the highest ranking American to be accused of war crimes during the Vietnam War. The charges were dropped due to lack of evidence.\n|}\n* \"Vietnam War Crimes Working Group\" – Briefly declassified (1994) and subsequently reclassified (2002) documentary evidence compiled by a Pentagon task force detailing endemic war crimes committed by U.S. soldiers in Vietnam. Substantiating 320 incidents by Army investigators, includes seven massacres from 1967 through 1971 in which at least 137 South Vietnamese civilians died (not including the ones at My Lai), 78 other attacks on noncombatants in which at least 57 were killed, 56 wounded and 15 sexually assaulted, and 141 instances in which U.S. soldiers tortured civilian detainees or prisoners of war.\nSouth Korean perpetrated crimes\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n!\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Vietnam War\n| colspan=\"2\" |South Korea\n|\n|-\n! Incident !! Type of crime !! Persons responsible !! Notes\n!\n|-\n|Bình An/Tây Vinh massacre\n|massacre (disputed)\n|South Korea\n|Around 1,004 civilians were purported to have been killed between 12 February and 17 March 1966, as part of Operation Masher.\n|\n|-\n|Binh Tai Massacre\n||massacre (disputed)\n||South Korea\n||This was a massacre purportedly conducted on 9 October 1966 of 29 to 168 South Vietnamese villagers in Binh Tai village of Bình Định Province in South Vietnam.\n|\n|-\n|Bình Hòa massacre\n||massacre (disputed)\n||South Korea\n||This was a massacre purportedly conducted between December 3–6, 1966, of 430 unarmed citizens in Bình Hòa village, Quảng Ngãi Province in South Vietnam.\n|\n|-\n|Hà My massacre\n||massacre (disputed)\n||South Korea\n||This was a massacre purportedly conducted by the South Korean Marines on 25 February 1968 of 135 civilians in Hà My village, Quảng Nam Province in South Vietnam.Kwon, Heonik. After the Massacre: Commemoration and Consolation in Ha My and My Lai. University of California Press. pg. 2.\n|\n|-\n|Phong Nhị and Phong Nhất massacre\n||massacre (disputed)\n||South Korea\n||This was a massacre purportedly conducted by the 2nd Marine Division of the South Korean Marines on 12 February 1968 of 69 to 79 unarmed citizens in Phong Nhị and Phong Nhất village, Điện Bàn District of Quảng Nam Province in South Vietnam.\n|\n|}\nNorth Vietnamese and Vietcong perpetrated crimes\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Vietnam War\n| colspan=\"2\" |People's Army of Vietnam and Viet Cong\n|-\n! Incident !! Type of crime !! Persons responsible !! Notes\n|-\n|VC/PAVN terrorism\n||Murder and kidnapping\n||Viet Cong and People's Army of Vietnam\n||VC/PAVN forces murdered between 106,000 and 227,000 civilians between 1954 and 1975 in South Vietnam. VC terror squads, in the years 1967 to 1972, were claimed by the US Department of Defense as having assassinated at least 36,000 people and abducted almost 58,000 people. Statistics for 1968–72 suggest that \"about 80 percent of the terrorist victims were ordinary civilians and only about 20 percent were government officials, policemen, members of the self-defence forces or pacification cadres.\"\n|-\n|U.S. Embassy bombing\n||Terrorist bombing\n||Viet Cong\n||On 30 March 1965 the Viet Cong detonated a car bomb in the street outside the U.S. Embassy in Saigon killing two Americans, 19 Vietnamese and one Filipino and injuring 183 others\n|-\n|1965 Saigon bombing\n||Terrorist bombing\n||Viet Cong\n||On 25 June 1965 the Viet Cong detonated a bomb on a floating restaurant \"My Canh Café\" on the banks of the Saigon River. 31–32 people were killed, and 42 were wounded. Of the casualties, 13 were American and most others were Vietnamese citizens. Another bomb exploded next to a tobacco stall on the riverbank near the restaurant, killing at least one American.\n|-\n|Đắk Sơn massacre\n||massacre\n||Viet Cong\n||On December 5, 1967, two battalions of Viet Cong were reported to have killed 252 civilians in a \"vengeance\" attack on the hamlet of Đắk Sơn, home to over 2,000 Montagnards. Its alleged that the Vietcong believed that the hamlet had at one point given aid to refugees fleeing Viet Cong forces.\n|-\n| style=\"width:18%;\"|Massacre at Huế\n| style=\"width:18%;\"|massacre\n| style=\"width:32%;\"|People's Army of Vietnam and Viet Cong\n| style=\"width:32%;\"| During the months and years that followed the Battle of Huế, which began on January 31, 1968, and lasted a total of 28 days, dozens of mass graves were discovered in and around Huế. North Vietnamese troops executed between 2,800 and 6,000 civilians and prisoners of war. Victims were found bound, tortured, and sometimes apparently buried alive.Pierre Journod, \"La France, les États-Unis et la guerre du Vietnam: l'année 1968\", in Les relations franco-américaines au XX siècle, edited by Pierre Melandri and Serge Ricard (L'Harmattan, 2003), p. 176.\n|-\n|Son Tra massacre\n||massacre\n||Viet Cong\n|On the night of 28/9 June 1968 the Viet Cong attacked Sơn Trà, a fishing village located approximately 5 miles (8.0&nbsp;km) southeast of Chu Lai Base Area. It had a population of approximately 4,000 people including many resettled refugees. After a mortar attack which forced many of the civilians to take shelter in their defensive bunkers, between 75 and 300 VC then moved through the village throwing satchel charges into bunkers killing their occupants and starting fires killing 73 civilians and 15 pacification workers; a further 103 civilians were wounded. 570 homes were destroyed in the attack and the resulting fires leaving almost 2,800 people homeless.\n|-\n|Thanh My massacre\n||massacre\n||Viet Cong\n|In the early morning of 11 June 1970 the Viet Cong launched a coordinated attack on Phu Thanh village, a complex of several hamlets, straddling Highway 1 about 3 miles (4.8&nbsp;km) north of Landing Zone Baldy. Two groups of sappers entered the village, armed with grenades and satchel charges, most began burning houses and hurling their grenades and satchel charges into family bomb shelters filled with civilians who had fled to them for protection from the shelling. Civilian casualties totalled 74 dead, many of them women and children; 60 severely injured; and over 100 lightly wounded with 156 houses destroyed and 35 damaged.\n|-\n|Duc Duc massacre\n||massacre\n||People's Army of Vietnam and Viet Cong\n||On 29 March 1971 the PAVN attacked Duc Duc in Quảng Nam Province systematically destroying the civilian hamlets with satchel charges and by setting fires. 103 civilians died in the blazing hamlets; 96 were injured and 37 kidnapped. At least 1,500 homes were destroyed.\n|-\n|Shelling of Highway 1\n||Indiscriminate fire\n||People's Army of Vietnam\n||From 29 April to 2 May 1972 indiscriminate PAVN fire on civilians fleeing Quảng Trị down Highway 1 killed over 2,000 civilians.\n|-\n|Shelling of Cai Lay schoolyard\n||Indiscriminate fire\n||Viet Cong\n||On 30 August 1973 during a Viet Cong attack on South Vietnamese positions mortar fire hit a schoolyard killing approximately 20 civilians.\n|}\n* Up to 155,000 refugees fleeing the final North Vietnamese Spring Offensive were alleged to have been killed or abducted on the road to Tuy Hòa in 1975.\nLate 1960s – 1998: The Troubles\n* War crimes: Various unarmed male civilians (some of whom were named during a 2013 television programme) were shot, two of them (Patrick McVeigh, Daniel Rooney) fatally, in 1972, allegedly by the Military Reaction Force (MRF), an undercover military unit tasked with targeting Irish Republican Army paramilitaries during the last installment of the Troubles. Two brothers, whose names and casualty status were not mentioned in an article regarding the same matter in The Irish Times, ran a fruit stall in west Belfast, and were shot after being mistaken for IRA paramilitaries.\n* War crimes: The British security forces employed widespread torture and waterboarding on prisoners in Northern Ireland during interrogations in the 1970s. Liam Holden was wrongfully arrested by the security forces for the murder of a British Army soldier and became the last person in the United Kingdom to be sentenced to hang after being convicted in 1973, largely on the basis of an unsigned confession produced by torture. His death sentence was commuted to life imprisonment and he spent 17 years behind bars. On 21 June 2012, in the light of CCRC investigations which confirmed that the methods used to extract confessions were unlawful, Holden had his conviction quashed by the Court of Appeal in Belfast, at the age of 58. Former Royal Ulster Constabulary (RUC) interrogators during the Troubles admitted that beatings, the sleep deprivation, waterboarding, and the other tortures were systematic, and were, at times, sanctioned at a very high level within the force.\n* War crimes: The British Army and the RUC also operated under a shoot-to-kill policy in Northern Ireland, under which suspects were alleged to have been deliberately killed without any attempt to arrest them. In four separate cases considered by the European court of human rights – involving the deaths of ten IRA men, a Sinn Féin member and a civilian – seven judges ruled unanimously that Article 2 of the European Convention on Human Rights guaranteeing a right to life had been violated by Britain.\n* War crimes: British soldiers and police colluded with loyalist paramilitaries, such as the attacks by the Glenanne group, which carried out a string of attacks against Irish Catholics and nationalists in an area of Northern Ireland known as the \"murder triangle\" and also carried out some attacks in the Republic of Ireland. Evidence suggests that the group was responsible for the deaths of about 120 civilians. The Cassel Report investigated 76 killings attributed to the group and found evidence that British security forces were involved in 74 of those. One former member, RUC officer John Weir, said his superiors knew of the group's activities but allowed it to continue. Attacks attributed to the group include the Dublin and Monaghan bombings (which killed 34 civilians), the Miami Showband killings, the Reavey and O'Dowd killings and the Hillcrest Bar bombing.\n1961 – 1974: Portuguese Colonial War\n* During the Operation Gordian Knot of the Portuguese Colonial War, violence and brutality of Portuguese actions against the population of the countryside were increasing along with various massacres against civilians. The Portuguese stepped up new defensive tactics, herding civilians into villages and trying to ensure the population was not reachable by FRELIMO. The Portuguese regime subsequently changed its message from \"destroying FRELIMO\" to \"bringing the situation under control.\"\n* As the liberation struggle continued on, the Portuguese regime continued to commit horrific atrocities, the most infamous of which was the massacre at Wiriyamu, a village which had been classified as collaborating with FRELIMO by the PIDE/DGS. The incident itself was not brought to the attention of the rest of the world until nearly a year later, in July 1973, by Adrian Hastings, a Dominican priest who witnessed the massacre. It was at first denied, then contested, investigated and again denied by the Portuguese authorities of the Estado Novo. Though full details of the entire episode are still not known, a large number of innocent civilians were slaughtered by a group of Portuguese soldiers during a planned operation (Operation Marosca) to attack an alleged guerrilla base. The PIDE/DGS agent who guided the soldiers told them explicitly that the orders were to \"kill everyone\", despite only civilians having been found in the village and there being no signs of FRELIMO activity. This agent, Chico Kavachi, was later murdered before he could be interviewed in an investigation ordered by the Portuguese government after the massacre became public in July 1973.\n1971 Bangladesh Liberation War\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|1971 Bangladesh War\n| colspan=\"2\" |Pakistan\n|-\n! Incident !! Type of crime !! Persons responsible !! Notes\n|-\n| style=\"width:18%;\"|1971 Bangladesh genocide\n| style=\"width:18%;\"|War crimes, crimes against humanity, crime of genocide (murder of civilians; genocide)\n| style=\"width:32%;\"|Allegedly the Pakistan Government, and the Pakistan Army and its local collaborators. A case was filed in the Federal Court of Australia on September 20, 2006, for crimes of genocide, war crimes and crimes against humanity. Starting in 2010, numerous perpetrators were imprisoned and executed for their involvement under the jurisdiction of the International Crimes Tribunal.\n| style=\"width:32%;\"|During the Bangladesh Liberation War of 1971, widespread atrocities were committed against the Bengali population of East Pakistan (now Bangladesh). With 1–3 million people killed in nine months, 'genocide' is the term that is used to describe the event in almost every major publication and newspaper. Although the word 'genocide' was and is still used frequently amongst observers and scholars of the events that transpired during the 1971 war, the allegations that a genocide took place during the Bangladesh War of 1971 were never investigated by an international tribunal set up under the auspices of the United Nations, due to complications arising from the Cold War. Starting from 2010, indictments were issued to numerous participants. Several of them has since been executed or imprisoned.\n|-\n|Civilian Casualties\n||War crimes (mass murder of civilians)\n||Several imprisoned and executed under the jurisdiction of the International Crimes Tribunal since 2010.\n||The number of civilians that died in the liberation war of Bangladesh is not known in any reliable accuracy. There has been a great disparity in the casualty figures put forth by Pakistan on one hand (26,000, as reported in the now discredited Hamoodur Rahman Commission) and India and Bangladesh on the other hand (From 1972 to 1975 the first post-war prime minister of Bangladesh, Sheikh Mujibur Rahman, estimated that 3 million died). This is the figure officially maintained by the Government of Bangladesh. Most scholarship on the topic estimate the number killed to be between 1 and 3 million. A further eight to ten million people fled the country to seek safety in India.\n|-\n|Atrocities on women and minorities\n||Crimes against humanity; crime of genocide; crime of torture (torture, rape and murder of civilians)\n||Several imprisoned and executed under the jurisdiction of the International Crimes Tribunal since 2010.\n||The minorities of Bangladesh, especially the Hindus, were specific targets of the Pakistan army. Numerous East Pakistani women were tortured, raped and killed during the war. The exact numbers are not known and are a subject of debate. Bangladeshi sources cite a figure of 200,000 women raped, giving birth to thousands of war-babies. Some other sources, for example Susan Brownmiller, refer to an even higher number of over 400,000. Pakistani sources claim the number is much lower, though having not completely denied rape incidents.Debasish Roy Chowdhury [https://web.archive.org/web/20050624014444/http://atimes.com/atimes/South_Asia/GF23Df04.html \"Indians are bastards anyway\"], Asia Times, June 23, 2005.\n\"In Against Our Will: Men, Women and Rape, Susan Brownmiller likens it to the Japanese rapes in Nanjing and German rapes in Russia during World War II. \"...&nbsp;200,000, 300,000 or possibly 400,000 women (three sets of statistics have been variously quoted) were raped.\"\"Brownmiller, Susan, \"Against Our Will: Men, Women, and Rape\"; , pg. 81\n|-\n|Killing of intellectuals\n||War crimes (mass murder of civilians)\n||Several imprisoned and executed under the jurisdiction of the International Crimes Tribunal since 2010.\n||During the war, the Pakistan Army and its local supporters carried out a systematic execution of the leading Bengali intellectuals. A number of university professors from Dhaka University were killed during the first few days of the war. However, the most extreme cases of targeted killing of intellectuals took place during the last few days of the war. On December 14, 1971, only two days before surrendering to the Indian military and the Mukhti Bahini forces, the Pakistani army – with the assistance of the Al Badr and Al Shams – systematically executed well over 200 of East Pakistan's intellectuals and scholars.\n|}\n1970–1975: Cambodian civil war\nThe Extraordinary Chambers in the Courts of Cambodia for the Prosecution of Crimes Committed During the Period of Democratic Kampuchea, commonly known as the Cambodia Tribunal, is a joint court established by the Royal Government of Cambodia and the United Nations to try senior members of the Khmer Rouge for crimes against humanity committed during the Cambodian Civil War. The Khmer Rouge killed many people due to their political affiliation, education, class origin, occupation, or ethnicity.\n1973 Yom Kippur war\n1975–1999: Indonesian invasion and occupation of East Timor\nDuring the 1975 invasion and the subsequent occupation, a significant portion of East Timor's population died. Researcher Ben Kiernan says that \"a toll of 150,000 is likely close to the truth\", although estimates of 200,000 or higher have been suggested.\n1975–1990: Lebanese Civil War\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\" |Lebanese Civil War\n| colspan=\"2\" |Various\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Black Saturday\n| style=\"width:18%;\"|War crime (200 to 600 killed)\n| style=\"width:32%;\"|Kataeb Party\n| style=\"width:32%;\"|On December 6, 1975, Black Saturday was a series of massacres and armed clashes in Beirut, that occurred in the first stages of the Lebanese Civil War.\n|-\n|Karantina massacre\n||War crime (Estimated 1,000 to 1,500 killed)\n||Kataeb Party, Guardians of the Cedars, Tigers Militia\n||Took place early in the Lebanese Civil War on January 18, 1976. Karantina was overrun by the Lebanese Christian militias, resulting in the deaths of approximately 1,000–1,500 people.\n|-\n|Tel al-Zaatar massacre\n||War Crime (Estimated 1,000 to 3,000 killed)\n||Lebanese Front, Tigers Militia, Syrian Army, Lebanese Armed Forces\n||The Tel al-Zaatar Battle took place during the Lebanese Civil War from June 22 – August 12, 1976. Tel al-Zaatar was a UNRWA administered Palestinian Refugee camp housing approximately 50,000–60,000 refugees in northeast Beirut. Tel al-Zaatar massacre refers to crimes committed around this battle.\n|-\n|Damour massacre\n||War crime (Estimated 684 civilians killed)\n||PLO, Lebanese National Movement\n||Took place on January 20, 1976. Damour, a Christian town on the main highway south of Beirut. It was attacked by the Palestine Liberation Organisation units. Part of its population died in battle or in the massacre that followed, and the remainder were forced to flee.\n|-\n|Sabra and Shatila massacre\n||War crime (460 to 3,500 (number disputed))\n||Lebanese Forces militia under Elie Hobeika\n||Took place in Sabra and the Shatila refugee camp Palestinian refugee camps in Beirut, Lebanon between September 16 and September 18, 1982. Palestinian and Lebanese civilians were massacred in the camps by Christian Lebanese Phalangists while the camp was surrounded by the Israel Defense Forces.  Israeli forces controlled the entrances to the refugee camps of Palestinians and controlled the entrance to the city.  The massacre was immediately preceded by the assassination of Bachir Gemayel, the leader of the Lebanese Kataeb Party. Following the assassination, an armed group entered the camp and murdered inhabitants during the night. It is now generally agreed that the killers were \"the Young Men\", a gang recruited by Elie Hobeika.\n|-\n|October 13 massacre\n||War crime (500–700 killed during the fighting. Additionally at least 240 unarmed prisoners executed, including civilians)\n||Syrian Army, Hafez al-Assad\n||Took place on October 13, 1990, during the final moments of the Lebanese Civil War, when hundreds of Lebanese soldiers were executed after they surrendered to Syrian forces.\n|}\n1978–Present: Civil war in Afghanistan\nThis war ravaged the country for over 40 years, with several foreign actors playing important roles during different periods. From 2001 until 2021, US and other NATO troops took part in the fighting in Afghanistan in the \"War on Terror\" that is also treated in the corresponding section below.\n{| class=wikitable\n|-\n! colspan=3 |Armed conflict\n! colspan=2 |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=3|Civil war in Afghanistan || colspan=2|Taliban and Al Qaeda\n|-\n! Incident !! Date !! Type of crime !! Persons responsible !! Notes\n|-\n| style=\"width:18%;\"|Executions and torture after the Battle of Mazar-i-Sharif\n|| –\n| style=\"width:18%;\"| War crimes; crime of torture (Murder, cruel or degrading treatment and torture; summary execution)\n| style=\"width:32%;\"| Taliban\n| style=\"width:32%;\"| Mass killing of the locals; 4,000 to 5,000 civilians were executed, and many more reported tortured.\n|-\n|Assassination of Iranian diplomats\n||\n|| War crimes; offenses against the customary law of nations (outrages upon diplomatic plenipotentiaries and agents)\n|| Taliban\n|| Eight Iranian diplomats were assassinated and an Iranian press correspondent was murdered by the Taliban.\n|-\n|Murder of Ahmed Shah Massoud\n||\n||War crimes (Perfidious use of suicide bombers disguised as journalists (who are protected persons) in murder.)\n||Islamic Emirate of Afghanistan, Al Qaeda\n||Perfidiously used suicide bombers disguised as television journalists to murder Ahmed Shah Massoud, leader of the Northern Alliance, the leader of the only remaining military opponent of the Taliban, two days before the September 11th Attacks, constituting a failure to bear arms openly, and misuse of the status of protected persons, to wit, journalists in war zones.\n|- style=\"text-align:center;\"\n| colspan=3|Civil war in Afghanistan || colspan=2|Northern Alliance\n|-\n!Incident !! Date !! Type of crime!!Persons responsible!!Notes\n|-\n|Dasht-i-Leili massacre\n||December 2001\n||War crimes (Maltreatment leading to death of Islamic Emirate of Afghanistan (Taliban) prisoners of war)\n||Northern Alliance partisans\n||Allegedly placed captured Taliban POWs in cargo containers, and did seal them, leading to deaths of those within due to suffocation and excessive heat, thereby constituting war crimes.\n|- style=\"text-align:center;\"\n| colspan=3|Civil war in Afghanistan || colspan=2|United States Army / British Royal Marines / Australian Army\n|-\n!Incident !! Date !! Type of crime !! Persons responsible !! Notes\n|-\n|Bagram torture and prisoner abuse\n||December 2002\n||War crimes (Maltreatment leading to death of prisoners)\n||United States Armed Forces\n||homicides of at least two unarmed prisoners, allegations of widespread pattern of abuse\n|-\n|Kandahar massacre\n||\n||Murder and wounding of civilians\n||US Army soldier:Staff Sergeant Robert Bales\n||Nine of the victims were children. Some of the corpses were partially burned.\n|-\n|Maywand District murders\n||June 2009 – June 2010\n||Murder of at least 3 Afghans\n||US Army soldiers:Staff Sergeant Calvin GibbsStaff Sergeant David BramSPC Jeremy MorlockPFC Andrew HolmesSPC Adam WinfieldSPC Corey Moore\n||Five members of a platoon were indicted for murder and collecting body parts as trophies. In addition, seven soldiers were charged with crimes such as hashish use, impeding an investigation, and attacking their team member who blew the whistle after he had participated in the crimes.\n|-\n| Brereton Report crimes\n| 2007–2013\n| Murder of multiple prisoners of war\n| Australian Special Air Service Regiment\n| Multiple substantiated claims that prisoners of war were murdered to allow the \"blooding\" of junior Australian Special Air Service Regiment (SASR) troopers, in addition to events where unarmed civilians were killed. Report of investigation released in November 2020. Led to disbanding of 2nd squadron of SASR and currently ongoing criminal investigation into events.\n|-\n|2011 Helmand Province incident\n||\n||Murder of a wounded prisoner\n||British Royal Marine:Alexander Blackman\n||(Description/notes missing)\n|}\nDuring the war against the Coalition and Afghan government, the Taliban committed war crimes including massacres, suicide bombing, terrorism, and targeting civilians. United Nations reports have consistently blamed the Taliban and other anti-government forces for the majority of civilian deaths in the conflict, with the Taliban responsible for 75% of civilian deaths in 2011. The Taliban also perpetrated mass rapes and executions of surrendered soldiers.\nFollowing the Taliban takeover of Afghanistan in 2021, the Taliban has also executed civilians and captured insurgents during the ongoing Republican insurgency in Afghanistan.\n1980–2001: Internal conflict in Peru\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Internal conflict in Peru\n| colspan=\"2\" |Government of Peru, Peruvian Armed Forces, and National Police of Peru\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Putis massacre\n| style=\"width:18%;\"|Crimes against humanity; mass murder; massacre; attacks against civilians\n| style=\"width:18%;\"|No prosecutions\n| style=\"width:18%;\"|Massacre carried out by the Peruvian army that killed 123 peasants\n|-\n| style=\"width:18%;\"|Accomarca massacre\n| style=\"width:18%;\"|Crimes against humanity; mass murder; massacre; attacks against civilians\n| style=\"width:18%;\"|No prosecutions\n| style=\"width:18%;\"|Massacre carried out by the Peruvian army that killed 74 civilians\n|-\n| style=\"width:18%;\"|Barrios Altos massacre\n| style=\"width:18%;\"|Crimes against humanity; mass murder; massacre; attacks against civilians\n| style=\"width:18%;\"|No prosecutions\n| style=\"width:18%;\"|Massacre carried out by the Grupo Colina that killed 15 civilians\n|-\n| style=\"width:18%;\"|Santa massacre\n| style=\"width:18%;\"|Crimes against humanity; mass murder; massacre; attacks against civilians\n| style=\"width:18%;\"|No prosecutions\n| style=\"width:18%;\"|Massacre carried out by the Grupo Colina that killed 9 civilians\n|-\n| style=\"width:18%;\"|La Cantuta massacre\n| style=\"width:18%;\"|Crimes against humanity; mass murder; massacre; attacks against civilians\n| style=\"width:18%;\"|No prosecutions\n| style=\"width:18%;\"|Massacre carried out by the Grupo Colina that killed 10 civilians\n|-\n| style=\"width:18%;\"|Forced sterilization in Peru\n| style=\"width:18%;\"|Crimes against humanity; forced sterilization; genocide; ethnic cleansing;\n| style=\"width:18%;\"|Alberto Fujimori charged in Chile\n| style=\"width:18%;\"|Carried out under the National Population Program\n|}\n1980–1988: Iran–Iraq War\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Iran–Iraq War\n| colspan=\"2\" |Iraq\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Iraqi invasion of Iran\n| style=\"width:18%;\"|Crimes against peace (waging a war of aggression)\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|In 1980, Iraq invaded neighboring Iran, allegedly to capture Iraqi territory held by Iran.\n|-\n|Use of chemical weapons||War crimes, use of poisons as weapons (violation of the 1925 Geneva Protocol)|| Supreme Iraqi Criminal Tribunal||Iraq made extensive use of chemical weapons, including mustard gas and nerve agents such as tabun. Iraqi chemical weapons were responsible for over 100,000 Iranian casualties (including 20,000 deaths).\n|-\n|Al-Anfal Campaign || Crimes against humanity; crime of genocide|| Supreme Iraqi Criminal Tribunal|| A genocidal campaign by Baathist Iraq against the Kurdish people (and other non-Arab populations) in northern Iraq, led by President Saddam Hussein and headed by Ali Hassan al-Majid in the final stages of Iran–Iraq War. The campaign also targeted other minority communities in Iraq including Assyrians, Shabaks, Iraqi Turkmens, Yazidis, Mandeans, and many villages belonging to these ethnic groups were also destroyed.\n|-\n|Halabja poison gas attack\n||Dutch court has ruled that the incident involved war crimes and genocide (part of the Al-Anfal Campaign); also may involve the use of poisons as weapons and crimes against humanity.\n||Supreme Iraqi Criminal TribunalTrial of Frans van Anraat\n||Iraq also used chemical weapons against their own Kurdish population causing casualties estimated between several hundred up to 5,000 deaths. On December 23, 2005, a Dutch court ruled in a case brought against Frans van Anraat for supplying chemicals to Iraq, that \"[it] thinks and considers legally and convincingly proven that the Kurdish population meets the requirement under the genocide conventions as an ethnic group. The court has no other conclusion that these attacks were committed with the intent to destroy the Kurdish population of Iraq.\" Because he supplied the chemicals before 16 March 1988, the date of the Halabja attack, he is guilty of a war crime but not guilty of complicity in genocide.\n|}\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Iran–Iraq War\n| colspan=\"2\" |Iran\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Attacks on neutral shipping\n| style=\"width:18%;\"|War crimes, crimes against peace (attacks against parties not involved in the war)\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Iran attacked oil tankers from neutral nations in an attempt to disrupt enemy trade.\n|-\n| style=\"width:18%;\"|Using child soldiers in suicide missions\n| style=\"width:18%;\"|War crimes (using child soldiers)\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Iran allegedly used volunteers (among them children) in high risk operations for example in clearing mine fields within hours to allow the advancement of regular troops. One source estimates 3% of the Iran–Iraq War's casualties were under the age of 14.\n|-\n|Laid mines in international waters\n||War crimes (hampered transit passage)\n||No prosecutions\n||Mines damaged the US frigate\n|}\nOver 100,000 civilians other than those killed in Saddam's genocide are estimated to have been killed by both sides of the war by R.J.Rummel.\n1986–1994: Uganda\nThe Times reports (November 26, 2005 p.&nbsp;27):\nAlmost 20 years of fighting... has killed half a million people. Many of the dead are children... The LRA [a cannibalism cult] kidnaps children and forces them to join its ranks. And so, incredibly, children are not only the main victims of this war, but also its unwilling perpetrators... The girls told me they had been given to rebel commanders as \"wives\" and forced to bear them children. The boys said they had been forced to walk for days knowing they would be killed if they showed any weakness, and in some cases forced even to murder their family members... every night up to 10,000 children walk into the centre of Kitgum... because they are not safe in their own beds... more than 25,000 children have been kidnapped ...this year an average of 20 children have been abducted every week.\n* The International Criminal Court has launched an investigation and has issued indictments against LRA leaders.\n1991–1999: Yugoslav wars\n1991–1995: Croatian War of Independence\nAlso see List of ICTY indictees for a variety of war criminals and crimes during this era.\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Croatian War of Independence\n| colspan=\"2\" |Yugoslav People's Army, Army of Serbian Krajina and paramilitary units.\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n|Battle of Vukovar\n|| Persecutions on political, racial, and religious grounds; murder; unlawful confinement; deportation or forced transfer; torture; inhumane acts; wanton destruction; plunder\n||JNA, Serb Volunteer Guard. Mile Mrkšić and Veselin Šljivančanin sentenced by the ICTY. Slobodan Milosevic, Goran Hadzic and others indicted by the ICTY.\n||August 25-November 18, 1991\n|-\n|Ovčara massacre\n|| Murder, torture, cruel treatment\n||Serb Territorial Defense and paramilitary units. Mile Mrkšić sentenced to 20 years, Veselin Šljivančanin sentenced to 10 years. Miroslav Radić acquitted.\n||18–21 November 1991; bodies buried in a mass grave\n|-\n|Stajićevo camp, Morinj camp, Sremska Mitrovica camp, Velepromet camp, Knin camp\n||Unflawful confinement; turture; inhumane acts\n||Slobodan Milosevic indicted by the ICTY.\n||November 1991-March 1992\n|-\n|Dalj massacre\n||Murder; persecutions\n||Territorial Defense of SAO SBWS under Željko Ražnatović. In 2023, the follow-up International Residual Mechanism for Criminal Tribunals sentenced Serbian State Security officers Jovica Stanišić and Franko Simatović for aiding and abetting a murder in Daljska Planina in June 1992 through their control of Serb paramilitary, as well as other crimes in Bosnia and Herzegovina, included them in a joint criminal enterprise, and sentenced them each to 15 years in prison.\n||October 4, 1991\n|-\n|Lovas massacre\n||Murder, persecutions, wanton destruction, plunder, torture, unlawful confinement, inhumane acts\n||Yugoslav People's Army, Territorial Defense of SAO SBWS and Dušan Silni paramilitary unit. Ljuban Devetak and 17 individuals are being tried by Croatian courts. Lovas was also one of the charges on the Slobodan Milošević ICTY indictment.\n||On October 10, 1991\n|-\n|Široka Kula massacre\n||Murder\n||JNA and Krajina Serb Territorial Defense.\n||Široka Kula near Gospić on October 13, 1991.\n|-\n|Baćin massacre\n||Murder; persecutions\n||Serb Territorial Defense forces and SAO Krajina militia. Milan Babić and Milan Martić convicted by ICTY. Baćin was also one of the charges on the Slobodan Milošević ICTY indictment.\n||On October 21, 1991.\n|-\n|Saborsko massacre\n||Murder\n||Serb-led JNA (special JNA unit from Niš), TO forces, rebel Serbs militia. Milan Babić and Milan Martić sentenced by the ICTY.\n||On October 28, November 7, and November 12, 1991.\n|-\n|Erdut massacre\n||Murder; persecutions\n||Željko Ražnatović, Slobodan Milošević, Goran Hadžić, Jovica Stanišić and Franko Simatović indicted by the ICTY.\n||November 1991-February 1992\n|-\n|Škabrnja massacre\n||Murder; persecutions\n||Serb forces. Milan Babić and Milan Martić convicted.\n||On November 18, 1991.\n|-\n|Siege of Dubrovnik\n||Murder; cruel treatment; attacks on civilians; devastation; unlawful attacks on civilian objects; destruction or wilful damage done to institutions\n||JNA and Montenegrin territorial forces. Miodrag Jokić and Pavle Strugar sentenced by the ICTY.\n||Shelling of UNESCO protected World Heritage Site. October 1991.\n|-\n|Voćin massacre\n||Murder; wanton destruction\n||White Eagles paramilitary group under Vojislav Šešelj, indicted by ICTY. Voćin was also one of the charges on the Slobodan Milošević ICTY indictment.\n||13 December 1991.\n|-\n|Bruška massacre\n||Murder; wanton destruction\n||Serb forces. Milan Babić and Milan Martić convicted.\n||On December 21, 1991.\n|-\n|Ethnic cleansing in Serb Krajina\n||Persecutions; deportation or forced displacement. Crimes against humanity (Serb forces forcibly removed virtually all non-Serbs living there-nearly a quarter of a million people, mostly Croats)\n||JNA and Serb paramilitaries. Many people, including leaders Milan Babić and Milan Martić, convicted at ICTY and Croatian courts.\n|| June–December 1991\n|-\n|Persecution of Croats in Serbia during the Yugoslav Wars\n||Persecutions; deportation or forced displacement.\n||Vojislav Šešelj sentenced by the ICTY.\n|| May 1992\n|-\n|Zagreb rocket attack\n||Murder; attacks on civilians; cruel treatment\n||RSK Serb forces. Leader Milan Martić sentenced by the ICTY.\n||Rocket attack was started as revenge for Serb military defeat in Operation Flash.\n|-\n! colspan=\"2\" style=\"text-align:center;\"|Armed conflict\n! colspan=\"2\" style=\"text-align:center;\"|Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Croatian War of Independence|| colspan=\"2\" style=\"text-align:center;\"|Croatian Army and paramilitary units\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Lora prison camp\n| style=\"width:18%;\"|Crime of torture, War crimes (Torture of POWs)\n| style=\"width:32%;\"|Croatian army. Several people convicted by Croatian courts.\n| style=\"width:32%;\"|Croatian internment camp for Serb soldiers and civilians between 1992 and 1997\n|-\n|Pakračka Poljana camp\n||War crimes, extortion\n||Croatian army, Ministry of Interior special forces and paramilitary formations. Commander Tomislav Merčep, and various subordinates and accessories found guilty of war crimes by Croatian courts.\n||November 1991-February 1992\n|-\n|Gospić massacre\n||War crimes\n||Croatian Army. Commander Mirko Norac and others convicted by Croatian courts.\n||16–18 October 1991\n|-\n|Operation Otkos 10\n||War crimes\n||Croatian Army. No prosecutions\n||31 October – 4 November 1991\n|-\n|Paulin Dvor massacre\n||War crimes\n||Croatian Army\n||11 December 1991\n|-\n|Miljevci plateau incident\n||War crimes (killings of 40 militiamen)\n||Croatian Army. No prosecutions\n||21 June 1992; invasion and permanent occupation of territory under international protection; bodies buried in mass graves nearby\n|-\n|Battle for Maslenica Bridge || War crimes (Killings of 490 or 491 individuals, including civilians)\n||Croatian Army. No prosecutions\n||22 January – 1 February 1993; invasion of territory under international protection\n|-\n|Mirlovic Polje incident\n||War crimes\n||Croatian paramilitaries. No prosecutions\n||6 September 1993; five men and two women, four shot dead; three burned alive\n|-\n|Operation Medak Pocket\n||War crimes, Crime against peace (killings of 29 civilians and 71 soldiers; wounding 4 UN peacekeepers)\n||Croatian Army. Commanders Janko Bobetko, Rahim Ademi and Mirko Norac. Ademi acquitted, Bobetko died in the meantime, Norac sentenced to seven years.\n||9–17 September 1993; invasion of territory under international protection and assault on UN peacekeeping forces\n|-\n|Operation Flash\n||War crimes\n||Croatian Army. No prosecutions\n||1–3 May 1995; invasion and permanent occupation of territory under international protection; Western Slavonia fully taken from RSK; 53 were killed in their own homes, while 30 during the Croatian raids of the refugee colons.\n|-\n|Operation Storm\n||War crimes (Killings of at least 677 civilians, 150–200,000 Serbian refugees)\n||Croatian Army. Generals Ante Gotovina and Mladen Markač ultimately acquitted by the ICTY.\n||4–8 August 1995\n|-\n|Varivode massacre\n||War crimes\n||Croatian Army. No prosecutions\n||28 September 1995\n|}\n1992–1995: Bosnian War\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Bosnian War\n| colspan=\"2\" |Serb forces, Army of Republika Srpska, Paramilitary units from Serbia, local Serb police and civilians.\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Srebrenica massacre\n| style=\"width:18%;\"|Persecutions on political, racial or religious grounds, murder, genocide, extermination, forcible displacement or deportation, inhumane acts (murder of over 8,000 Bosnian Muslim men and boys)\n| style=\"width:32%;\"|Army of Republika Srpska. President Radovan Karadžić and military commanders Ratko Mladić, Zdravko Tolimir, Vujadin Popović, Ljubiša Beara sentenced to a life in prison for genocide by the ICTY\n| style=\"width:32%;\"|Following the fall of the eastern Bosnian enclave of Srebrenica the men were separated from the women and executed over a period of several days in July 1995.\n|-\n|Prijedor ethnic cleansing\n|| Persecutions; murder; inhumane acts; extermination; wanton destruction of cities, towns or villages or devastation not justified by military necessity; destruction or wilful damage done to institutions dedicated to religion; deportation or forcible transfer (3515 Bosniak and 186 Croat civilians killed and missing)\n||Army of Republika Srpska. Radoslav Brđanin, Darko Mrđa, Momčilo Krajišnik, Biljana Plavšić sentenced by the ICTY.\n||May 1992—1994\n|-\n|Omarska camp, Trnopolje camp, Keraterm camp, Sušica camp, Luka camp\n|| Persecutions, murder, torture, cruel treatment, inhumane acts, sexual violence, unlawful arrest and detention, forced labour\n||Army of Republika Srpska. Miroslav Kvočka, Zoran Žigić, Mlađo Radić, Milojica Kos, Duško Sikirica, Dragan Nikolić, Blagoje Simić sentenced by the ICTY.\n||Concentration camps held thousands of Bosniaks and Croats\n|-\n|Višegrad massacre\n||Persecutions on political, racial and religious grounds, murder, inhumane acts, extermination, cruel treatment (murder of 1,661 Bosniaks)\n||Serbian police and military forces. Milan Lukić, Sredoje Lukić convicted by the ICTY.\n||Acts of ethnic cleansing and mass murder of Bosniak civilians that occurred in the town of Višegrad in eastern Bosnia and Herzegovina, committed by Serb police and military forces at the start of the Bosnian War during the spring of 1992.\n|-\n|Foča ethnic cleansing\n||Torture, rape, outrages upon personal dignity, enslavement (murder of over 1513 Bosniak civilians)\n||Army of Republika Srpska. Dragoljub Kunarac, Radomir Kovač, Zoran Vuković convicted by the ICTY.\n||A series of killings committed by Serb military, police and paramilitary forces on Bosniak civilians in the Foča region of Bosnia-Herzegovina (including the towns of Gacko and Kalinovik) from April 7, 1992, to January 1994. In numerous verdicts, the International Criminal Tribunal for the former Yugoslavia ruled that these killings constituted crimes against humanity and acts of genocide.\n|-\n|Markale massacre\n||Murder\n||Army of Republika Srpska. Stanislav Galić convicted by the ICTY\n||The victims were civilians who were shopping in an open-air market in Sarajevo when Serb forces shelled the market. Two separate incidents. February 1994; 68 killed and 144 wounded and August 1995; 37 killed and 90 wounded.\n|-\n|Siege of Sarajevo\n||Murder, inhumane acts, terror\n||Army of Republika Srpska. Stanislav Galić and Dragomir Milošević, were sentenced to life imprisonment and to 33 years imprisonment, respectively.\n||The longest siege of a capital city in the history of modern warfare. Republika Srpska and the Yugoslav People's Army besieged Sarajevo, the capital city of Bosnia and Herzegovina, from April 5, 1992, to February 29, 1996.\n|-\n|Siege of Bihać\n||Attacks on civilians, starvation\n||Army of Republika Srpska\n||From April 1992 to August 1995.\n|-\n|Tuzla massacre\n||Murder\n||Army of Republika Srpska. ARS Officer Novak Đukić on trial.\n||On May 25, 1995, the Serb army shelled the city of Tuzla and killed 72 people with a single shell.\n|-\n|Korićani Cliffs massacre\n||Murder, persecutions\n||Serbian reserve police. Darko Mrđa was convicted by the ICTY.\n||Mass murder of more than 200 Bosniak men on 21 August 1992 at the Korićani Cliffs (Korićanske Stijene) location on Mount Vlašić, Bosnia and Herzegovina\n|-\n|Ahatovići massacre\n||Murder; torture (64 men and boys tortured, 56 killed)\n||Army of the Republika Srpska. No prosecutions.\n||Rounded up in an attack on a village, they were tortured. Claiming they were going to be exchanged, Serb forces put them on a bus, which they attacked with machine guns and grenades on June 14, 1992. Eight survived by hiding under bodies of the dead.\n|-\n|Paklenik Massacre\n||Murder\n||Army of the Republika Srpska. Four indicted.\n||Massacre of at least 50 Bosniaks by Bosnian Serb Army in the Rogatica Municipality on June 15, 1992.\n|-\n|Bosanska Jagodina massacre\n||Murder\n||Army of the Republika Srpska. No prosecutions.\n||The execution of 17 Bosniak civilians from Višegrad on May 26, 1992, all men.\n|-\n! colspan=\"2\" style=\"text-align:center;\"|Armed conflict\n! colspan=\"2\" style=\"text-align:center;\"|Perpetrator\n|-\n| colspan=\"2\" style=\"text-align:center;\"|Bosnian War|| colspan=\"2\" style=\"text-align:center;\"|Croat forces, HVO.\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes|-\n|-\n| style=\"width:18%;\"|Ahmići massacre\n| style=\"width:18%;\"|Crimes against humanity according to ICTY, (ethnic cleansing, murder of civilians)\n| style=\"width:32%;\"|Croatian Defence Council, Tihomir Blaškić convicted.\n| style=\"width:32%;\"|On April 16, 1993, the Croatian Defence Council attacked the village of Ahmići and killed 116 Bosniaks.\n|-\n|Stupni Do massacre\n||Crimes against humanity according to ICTY (murder of 37 civilians)\n||Croatian Defence Council, Ivica Rajić convicted.\n||On October 23, 1993, the Croatian Defence Council attacked the village of Stupni do and killed 37 Bosniaks\n|-\n|Lašva Valley ethnic cleansing\n||Crimes against humanity according to ICTY. (2,000 civilians killed and missing)\n||Croatian Defence Council. Nine politicians and officers convicted, among them Dario Kordić.\n||Numerous war crimes committed by the Croatian Community of Herzeg-Bosnia's political and military leadership on Bosnian Muslim (Bosniak) civilians in the Lašva Valley region of Bosnia-Herzegovina, from April 1993 to February 1994.\n|-\n! colspan=\"2\" style=\"text-align:center;\"|Armed conflict\n! colspan=\"2\" style=\"text-align:center;\"|Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Bosnian War|| colspan=\"2\" style=\"text-align:center;\"|Bosniak forces, Army of the Republic of Bosnia and Herzegovina\n|-\n!Incident !! type of crime!!Persons responsible!!Notes|-\n|-\n|Massacre in Grabovica\n||War crimes (13 civilians murdered)\n||Army of the Republic of Bosnia and Herzegovina. Nihad Vlahovljak, Sead Karagićm and Haris Rajkić convicted.\n||13 Croatian inhabitants of Grabovica village by members of the 9th Brigade and unidentified members of the Bosnian Army on the 8th or 9 September 1993.\n|-\n|Gornja Jošanica massacre\n||War crimes (56 civilians murdered)\n||Army of the Republic of Bosnia and Herzegovina. No prosecutions.\n||56 Bosnian Serb civilians, including 21 women and three children, in the village of Gornja Jošanica. Victims were stabbed multiple times, had their throats slit, skulls and body parts crushed or mutilated.\n|}\n1998–1999: Kosovo War\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Kosovo War\n| colspan=\"2\" |Yugoslav army, Serbian police and paramilitary forces\n|-\n!Incident !! type of crime!!Persons responsible!!Notes\n|-\n|Račak massacre\n||Murder\n||Serbian police, No prosecutions\n||45 Kosovo Albanians were killed in the village of Račak in central Kosovo. The government of the Federal Republic of Yugoslavia asserted that the casualties were all members of the Kosovo Liberation Army who had been killed in a clash with state security forces.\n|-\n|Izbica massacre\n||Murder, persecutions, forcible displacement or deportation, wanton destruction, plunder\n||Serbian police and paramilitaries, No prosecutions.\n||120 Albanian civilians killed by Serbian forces in the village of Izbica, in the Drenica region of central Kosovo on 28 March 1999.\n|-\n|Suva Reka massacre\n||Murder\n||Serbian police. Four former-policemen were convicted and received prison sentences ranging from 13 to 20 years.\n||The massacre took place in Suva Reka, in central Kosovo on 26 March 1999. The victims were locked inside a pizzeria into which two hand grenades were thrown. Before taking the bodies out of the pizzeria, the police allegedly shot anyone still showing signs of life.\n|-\n|Ćuška massacre\n||Murder\n||Yugoslav Army, Serbian police, paramilitary and Bosnian Serb volunteers, No prosecutions.\n||Serbian forces summarily executed 41 Albanians in Ćuška on 14 May 1999, taking three groups of men into three different houses, where they were shot with automatic weapons and set on fire.\n|-\n|Massacre at Velika Kruša\n||Murder\n||Serbian special forces, No prosecutions.\n||Massacre at Velika Kruša near Orahovac, Kosovo, took place during the Kosovo War on the afternoon of March 25, 1999, the day after the NATO air campaign began.\n|-\n|Podujevo massacre\n||Murder\n||Serbian paramilitaries. Four convicted and sentenced to lengthy prison sentences.\n||19 Kosovo Albanian civilians, all women and children, were executed by Serbian paramilitary forces in March, 1999 in Podujevo, in eastern Kosovo.\n|-\n|Meja massacre\n|Murder, persecutions, forcible displacement or deportation, wanton destruction, inhumane acts, plunder\n|Yugoslav Army, Serbian police. Twenty charged in relation to the massacre.\n|At least 377 Albanian civilians were executed in the Catholic village of Meja on 27 and 28 March 1999.\n|-\n|Mass deportations\n|Persecutions, deportation or focrible displacement\n|Yugoslav Army, Serbian Police, Serbian paramilliaries. Slobodan Milošević tried but died in captivity.\n|Approximately 850,000 Albanian civilians expelled from Kosovo to nearby regions and 590,000 internally displaced.\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Kosovo War|| colspan=\"2\" style=\"text-align:center;\"|Kosovo Liberation Army\n|-\n!Incident !! type of crime!!Persons responsible!!Notes\n|-\n|Lapušnik prison camp\n||War crimes\n||Kosovo Liberation Army; Haradin Bala sentenced to 13 years.\n||Detention camp (also referred to as a prison and concentration camp) near the city of Glogovac in central Kosovo during the Kosovo War, in 1998. The camp was used by Kosovo Albanian insurgents to collect and confine hundreds of male prisoners of Serb and non-Albanian ethnicity.\n|-\n|Klečka killings\n||War crime; (murder of 22 Serbian civilians)\n|Kosovo Liberation Army, No prosecutions\n|22 Kosovo Serb civilians were killed by Albanian insurgents in the village of Klečka, and their remains were cremated in a lime kiln.\n|-\n|Lake Radonjić massacre\n||War crime; (murder of 34 civilians)\n|Kosovo Liberation Army, No prosecutions\n|34 Serbs, non-Albanians and moderate Kosovo Albanians were killed by members of the Kosovo Liberation Army near Lake Radonjić\n|-\n|Staro Gračko massacre\n||War crime; (murder of 14 Serb civilians)\n|Kosovo Liberation Army, No prosecutions\n|14 Kosovo Serb farmers were executed by Kosovo Liberation Army gunmen, who then disfigured their corpses with blunt instruments.\n|}\n1990–2000: Liberia / Sierra Leone\nFrom The Times March 28, 2006 p.&nbsp;43:\n: \"Charles Taylor, the former Liberian President who is one of Africas most wanted men, has gone into hiding in Nigeria to avoid extradition to a UN war crimes tribunal... The UN war crimes tribunal in Sierra Leone holds Mr Taylor responsible for about 250,000 deaths. Throughout the 1990s, his armies and supporters, made up of child soldiers orphaned by the conflict wreaked havoc through a swath of West Africa. In Sierra Leone he supported the Revolutionary United Front (R.U.F) whose rebel fighters were notorious for hacking off the limbs of civilians.\n* Current action – Indicted on 17 counts of war crimes and crimes against humanity by the UN, which has issued an international warrant for his arrest. As of April 2006 located, extradited, and facing trial in Sierra Leone but then transferred to the Netherlands as requested by the Liberian government. As of the status of the main state actor in the war crimes in Liberia, Sierra Leone and the ongoing war crimes tribunal in the Hague for violating the UN sanctions, Libya's Muamar Gaddafi was elected to the post of President of the African Union. As of late January, 2011, Exxon/Mobile has resumed explorationary drilling in Libya after the exchange of the Lockerbie bombing terrorist was returned to Libya and Libya was taken off terrorist list by the Bush administration with the legal stipulation that Libya could never be prosecuted for past war crimes(regardless of guilt)in the future.\n1990: Gulf War\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\" |Gulf War\n| colspan=\"2\" |Iraq\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Invasion of Kuwait\n| style=\"width:18%;\"|Crimes against peace (waging a war of aggression for territorial aggrandisement; \"breach of international peace and security\" (UN Security Council Resolution 660))\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Did conspire to levy and did levy a war of aggression against Kuwait, a sovereign state, took it by force of arms, did occupy it, and did annex it, by right of conquest, a right utterly alien, hostile, and repugnant to all extant international law, being a grave breach of the Charter of the United Nations, and the customary international law, adhered to by all civilised nations and armed groups, thus constituting Crimes against peace.\n|-\n|British Airways Flight 149 Hostages torture\n|\nTorture\nHostage taking\nRape\n|No prosecutions (1 soldier extrajudicially killed)\n|1 Soldier was subjected to Extrajudicial killing for the rape of an hostess\n|}\n1991–2000/2002: Algerian Civil War\nDuring the Algerian Civil War of the 1990s, a variety of massacres occurred through the country, many being identified as war crimes. The Armed Islamic Group (GIA) has avowed its responsibility for many of them, while for others no group has claimed responsibility. In addition to generating a widespread sense of fear, these massacres and the ensuing flight of population have resulted in serious depopulation of the worst-affected areas. The massacres peaked in 1997 (with a smaller peak in 1994), and were particularly concentrated in the areas between Algiers and Oran, with very few occurring in the east or in the Sahara.\n1994–1996/1999–2009: Russia-Chechnya Wars\nDuring the First Chechen War (1994–1996) and Second Chechen War (1999–2000 battle phase, 2000–2009 insurgency phase) there were many allegations of war crimes and terrorism against both sides from various human rights organizations.\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|First Chechen War, Second Chechen War\n| colspan=\"2\" |Russian Federation\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|1995 Shali cluster bomb attack\n| style=\"width:18%;\"|War crimes, crimes against peace (attacks against parties not involved in the war), crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Russian fighter jets dropped cluster munitions on the town of Shali. Targets included a school; cemetery, hospital, fuel station and a collective farm.\n|-\n| style=\"width:18%;\"|Samashki massacre\n| style=\"width:18%;\"|War crimes, crimes against peace (attacks against parties not involved in the war), crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|The massacre of 100–300 civilians in the village of Samashki by Russian paramilitary troops.\n|-\n| style=\"width:18%;\"|Elistanzhi cluster bomb attack\n| style=\"width:18%;\"|War crimes, crimes against peace (attacks against parties not involved in the war), crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Two Russian Air Force Sukhoi Su-24 use cluster munitions on the remote mountain village of Elistanzhi. The local school is destroyed with nine children inside.\n|-\n| style=\"width:18%;\"|Grozny ballistic missile attack\n| style=\"width:18%;\"|War crimes, crimes against peace (attacks against parties not involved in the war), crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Over 100 Chechen civilians die in indiscriminate bombing on the Chechen capital of Grozny by the Strategic Missile Troops.\n|-\n| style=\"width:18%;\"|Siege of Grozny\n| style=\"width:18%;\"|War crimes, genocide, crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Thousands civilians die from bombings\n|-\n|Baku–Rostov highway bombing\n|Crimes against humanity\n|No prosecutions\n|Low flying Russian Air Force helicopters perform repeated attack runs on a large numbers refugees trying to enter Ingushetia.\n|-\n|1999 Grozny refugee convoy shooting\n|War crimes, crimes against humanity\n|No prosecutions\n|OMON officers use automatic rifles on a convoy of refugees at a federal roadblock on the road to Ingushetia.\n|-\n|Alkhan-Yurt massacre\n|War crimes, crimes against humanity\n|No prosecutions\n|Over two weeks drunken Russian troops under the command of General Vladimir Shamanov went on the rampage after taking the town from the forces of Akhmed Zakayev.\n|-\n|Staropromyslovski massacre\n|War crimes, crimes against humanity\n|No prosecutions\n|Summary executions of at least 38&nbsp;confirmed civilians by Russian federal soldiers in Grozny, Chechnya.\n|-\n|Bombing of Katyr-Yurt\n|War crimes, crimes against humanity\n|No prosecutions\n|Indiscriminate bombing by the Russian Air Force of the village of Katyr-Yurt and a refugee convoy under white flags.\n|-\n|Novye Aldi massacre\n|War crimes, crimes against humanity\n|No prosecutions\n|The killings, including executions, of 60 to 82 local civilians by special police unit, OMON, and rapes of at least six women along with arson and robbery in Grozny, Chechnya.\n|-\n|Komsomolskoye massacre\n|War crimes, crimes against humanity\n|No prosecutions\n|Chechen combantants who surrendered after the Battle of Komsomolskoye on the public promise of amnesty are killed and \"disappeared\" shortly after.\n|}\n1998–2006: Second Congo War\n* Civil war 1998–2002, est. 5 million deaths; war \"sucked in\" Rwanda, Uganda, Angola, Zimbabwe and Namibia, as well as 17,000 United Nations peacekeepers, its \"largest and most costly\" peace mission and \"the bloodiest conflict since the end of the Second World War.\"\n* Fighting involves Mai-Mai militia and Congolese government soldiers. The Government originally armed the Mai-Mai as civil defence against external invaders, who then turned to banditry.\n* 100,000 refugees living in remote disease ridden areas to avoid both sides\n* Estimated 1000 deaths a day according to Oxfam:\n: \"The army attacks the local population as it passes through, often raping and pillaging like the militias. Those who resist are branded Mai-mai supporters and face detention or death. The Mai-mai accuse the villagers of collaborating with the army, they return to the villages at night and . Sometimes they march the villagers into the bush to work as human mules.\"\n* In 2003, Sinafasi Makelo, a representative of Mbuti Pygmies, told the UN's Indigenous People's Forum that during the Congo Civil War, his people were hunted down and eaten as though they were game animals. Both sides of the war regarded them as \"subhuman\". Makelo asked the UN Security Council to recognise cannibalism as a crime against humanity and an act of genocide.\n2003–Present: Iraqi conflict\nDuring the Iraq War\n* Blackwater Baghdad shootings On September 16, 2007, Blackwater military contractors shot and killed 17 Iraqi civilians in Nisour Square, Baghdad. The fatalities occurred while a Blackwater Personal Security Detail (PSD) was escorting a convoy of US State Department vehicles en route to a meeting in western Baghdad with United States Agency for International Development officials. The shooting led to the unraveling of the North Carolina-based company, which since has replaced its management and changed its name to Xe Services.\n* Beginning in 2004, accounts of physical, psychological, and sexual abuse, including torture, rape, sodomy, and homicide of prisoners held in the Abu Ghraib prison in Iraq (also known as Baghdad Correctional Facility) came to public attention. These acts were committed by military police personnel of the United States Army together with the CIA. In January 2014, evidence accuses British troops of being involved in widespread torture and abuse towards Iraqi civilians and prisoners.\n* War crimes: 2006 al-Askari Mosque bombing by Al-Qaeda. The bombing was followed by retaliatory violence with over a hundred dead bodies being found the next day and well over 1,000 people killed in the days following the bombing – by some counts, over 1,000 on the first day alone.\n* The Mahmudiyah rape and killings were the gang-rape and murder of 14-year-old Iraqi girl Abeer Qassim Hamza al-Janabi and the murder of her family by United States Army soldiers on March 12, 2006. It occurred in the family's house to the southwest of Yusufiyah, a village to the west of the town of Al-Mahmudiyah, Iraq. Other members of al-Janabi's family murdered by Americans included her 34-year-old mother Fakhriyah Taha Muhasen, 45-year-old father Qassim Hamza Raheem, and 6-year-old sister Hadeel Qassim Hamza Al-Janabi. The two remaining survivors of the family, 9-year-old brother Ahmed and 11-year-old brother Mohammed, who were at school during the massacre, were orphaned by the event.\n* War crimes: Iraqi insurgent groups have committed many armed attacks and bombings targeting civilians. According to Iraqi Interior Minister Bayan Jabr insurgents killed over 12,000 Iraqis from January 2005 to June 2006, giving the first official count for the victims of bombings, ambushes and other deadly attacks. Iraq Body Count project data shows that 33% of civilian deaths during the Iraq War resulted from execution after abduction or capture. These were overwhelmingly carried out by unknown actors including insurgents, sectarian militias and criminals. See: Iraq War insurgent attacks, List of suicide bombings in Iraq since 2003 and List of massacres of the Iraq War for a more comprehensive list.\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Iraqi conflict\n| colspan=\"2\"|United States\n|-\n!Incident !! type of crime!!Persons responsible!!Notes\n|-\n|Fallujah killings of April 2003\n||Mass murder; Attacks against civilians; mass shooting\n||No prosecution\n||\n|-\n|Abu Ghraib torture and prisoner abuse\n||Torture of POWs; rape; killing of POW\n||12 soldiers convicted\n||\n|-\n|Death of Nagem Hatab\n||Torture and death of POW\n||Charges dropped\n||\n|-\n|Mahmudiyah rape and killings\n||Rape; mass murder; war crimes; attacks against civilians\n||6 soldiers charged\n||\n|-\n|Haditha massacre\n||massacre; attack against civilians; mass murder\n||No prosecution\n||\n|-\n|Ishaqi massacre\n||massacre\n||No prosecution\n||\n|-\n|Nisour Square massacre\n||massacre; mass murder; mass shooting\n||Perpetrated by Blackwater\n|}\n2006 Lebanon War\nAllegations of war crimes in the 2006 Lebanon War refer to claims of various groups and individuals, including Amnesty International, Human Rights Watch, and United Nations officials, who accused both Hezbollah and Israel of violating international humanitarian law during the 2006 Lebanon War, and warned of possible war crimes. These allegations included intentional attacks on civilian populations or infrastructure, disproportionate or indiscriminate attacks in densely populated residential districts.\nAccording to various media reports, between 1,000 and 1,200 Lebanese citizens (including Hezbollah fighters) were reported dead; there were between 1,500 and 2,500 people wounded and over 1,000,000 were temporarily displaced. Over 150 Israelis were killed (120 military); thousands wounded; and 300,000–500,000 were displaced because of Hezbollah firing tens of thousands of rockets at major cities in Israel.\n2003–2020 War in Darfur and Chadian Civil War\nDuring the War in Darfur and the Chadian Civil War, reports of humans rights abuses and genocide surfaced, accusing the Sudanese Armed Forces and Janjaweed militias in Darfur and Eastern Chad.\nSudanese authorities claim a death toll of roughly 19,500 civilians[http://weekly.ahram.org.eg/2006/822/re72.htm Al-Ahram Weekly | Region | Old dogs, new tricks]  while many non-governmental organizations, such as the Coalition for International Justice, claim over 400,000 people have been killed.\nIn September 2004, the World Health Organization estimated there had been 50,000 deaths in Darfur since the beginning of the conflict, an 18-month period, mostly due to starvation. An updated estimate the following month put the number of deaths for the six-month period from March to October 2004 due to starvation and disease at 70,000; These figures were criticised, because they only considered short periods and did not include deaths from violence. A more recent British Parliamentary Report has estimated that over 300,000 people have died, and others have estimated even more.\n2008–2009 Gaza War\nThere were allegations of war crimes by both the Israeli military and Hamas. Criticism of Israel's conduct focused on the proportionality of its measures against Hamas, and on its alleged use of weaponised white phosphorus. Numerous reports from human right groups during the war claimed that white phosphorus shells were being used by Israel, often in or near populated areas. In its early statements the Israeli military denied using any form of white phosphorus, saying \"We categorically deny the use of white phosphorus\". It eventually admitted to its limited use and stopped using the shells, including as a smoke screen. The Goldstone report investigating possible war crimes in the 2009 war accepted that white phosphorus is not illegal under international law but did find that the Israelis were \"systematically reckless in determining its use in build-up areas\". It also called for serious consideration to be given to the banning of its use as an obscurant.\n1983 - 2009 Sri Lankan Civil War\nThere are allegations that war crimes were committed by the Sri Lankan military and the rebel Liberation Tigers of Tamil Eelam during the Sri Lankan Civil War, particularly during the final months of the conflict in 2009. The alleged war crimes include attacks on civilians and civilian buildings by both sides; executions of combatants and prisoners by the government of Sri Lanka; enforced disappearances by the Sri Lankan military and paramilitary groups backed by them; acute shortages of food, medicine, and clean water for civilians trapped in the war zone; and child recruitment by the Tamil Tigers.\nA panel of experts appointed by UN Secretary-General (UNSG) Ban Ki-moon to advise him on the issue of accountability with regard to any alleged violations of international human rights and humanitarian law during the final stages of the civil war found \"credible allegations\" which, if proven, indicated that war crimes and crimes against humanity were committed by the Sri Lankan military and the Tamil Tigers. The panel has called on the UNSG to conduct an independent international inquiry into the alleged violations of international law. The Sri Lankan government has denied that its forces committed any war crimes and has strongly opposed any international investigation. It has condemned the UN report as \"fundamentally flawed in many respects\" and \"based on patently biased material which is presented without any verification\".\n2011–Present: Syrian civil war\nInternational organizations have accused the Syrian government, ISIL and other opposition forces of severe human rights violations, with many massacres occurring. Chemical weapons have been used many times during the conflict as well. The Syrian government is reportedly responsible for the majority of civilian casualties and war crimes, often through bombings. In addition, tens of thousands of protesters and activists have been imprisoned and there are reports of torture in state prisons. Over 470,000 people were killed in the war by 2017.\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\" |Syrian Civil War\n| colspan=\"2\" |Syrian Government\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Repression of the Syrian revolution\n|Crimes against peace (armed suppression of popular uprising leading to war), crimes against civilians, torture,\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|\n|-\n| style=\"width:18%;\"|Mass detention and torture of Syrian civilians and political prisoners in Al-Khatib prison and Sednaya Prison\n| style=\"width:18%;\"|war crimes, crimes against humanity\n| style=\"width:32%;\"|Syrian former colonel Anwar Raslan sentenced in Germany to life in prison for crimes against humanity. Former intelligence officer Eyad al-Gharib sentenced in Germany to  years in prison.\n| style=\"width:32%;\"|Amnesty International estimated in February 2017 \"that between 5,000 and 13,000 people were extrajudicially executed at Saydnaya Prison between September 2011 and December 2015.\"\n|-\n| style=\"width:18%;\"|Houla massacre\n| Crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|In August 2012, U.N. investigators released a report which stated that it was likely that Syrian troops and Shabiha militia were responsible for the massacre.\n|-\n| style=\"width:18%;\"|Siege of Aleppo\n| style=\"width:18%;\"|Crimes against humanity, mass murder, massacre, attacks against civilians, use of banned chemical and cluster weapons\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|War crimes emerged during the battle, including the use of chemical weapons by both Syrian government forces and rebel forces, the use barrel bombs by the Syrian Air Force, the dropping of cluster munitions on populated areas by Russian and Syrian forces, the carrying out of \"double tap\" airstrikes to target rescue workers responding to previous strikes, summary executions of civilians and captured soldiers by both sides, indiscriminate shelling and use of highly inaccurate improvised artillery by rebel forces. During the 2016 Syrian government offensive, the UN High Commissioner for Human Rights warned that \"crimes of historic proportions\" were being committed in Aleppo.\n|-\n| style=\"width:18%;\"|Tadamon massacre\n| style=\"width:18%;\"|War crimes; crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Summary killings of up to 288 people in April 2013.\n|-\n| style=\"width:18%;\"|Ghouta chemical attack\n| style=\"width:18%;\"|War crimes; use of poison gas as a weapon\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|The Ghouta chemical attack occurred during the Syrian Civil War in the early hours of 21 August 2013. Several opposition-controlled areas in the suburbs around Damascus, Syria, were struck by rockets containing the chemical agent sarin. Estimates of the death toll range from at least 281 people to 1,729.\n|-\n||2015 Douma market massacre\n| style=\"width:18%;\"|War crimes\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|The Syrian Air Force launched strikes on the rebel-held town of Douma, northeast of Damascus, killing at least 96 civilians and injuring at least 200 others.\n|-\n| style=\"width:18%;\"|Atarib market massacre\n| Crimes against humanity, war crimes\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"| mass murder, attacks on civilians\n|-\n| style=\"width:18%;\"|Armanaz massacre\n| Crimes against humanity, war crimes\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"| mass murder, attacks on civilians\n|-\n||2017 Khan Shaykhun chemical attack\n| style=\"width:18%;\"|War crimes; use of poison gas as a weapon\n| style=\"width:32%;\"|No prosecutions.\n| style- \"width:32%;\"| The Syrian Government ordered an attack on the rebel-held town of Khan Shaykhun in Northwestern Syria in the early morning of 4 April 2017. The chemical caused at least 80 civilians deaths, and three medical workers were injured. The chemical caused asphyxiation and mouth foaming. It is suspected by Turkish authorities to be the poison Sarin.\n|-\n||Siege of Eastern Ghouta\n| style=\"width:18%;\"|War crimes; crimes against humanity\n| style=\"width:32%;\"|No prosecutions.\n| style- \"width:32%;\"| use of poison gas as a weapon; bombardments; starvation of population under siege; attacks against protected objects (schools, hospitals)\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\" |Syrian Civil War\n| colspan=\"2\" |Islamic State in Iraq and the Levant\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|ISIL beheading incidents murder of neutral civilians; journalists; and aid workers\n| style=\"width:18%;\"|Crimes against peace (murder of uninvolved parties); war crimes\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|\n|-\n|-\n| style=\"width:18%;\"|Chemical attacks on Kurdish YPG\n| style=\"width:18%;\"|War crimes; use of poison as a weapon\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|(description/notes missing)\n|-\n| style=\"width:18%;\"|Genocide of Yazidis by ISIL\n| style=\"width:18%;\"|Crimes against humanity (ethnic cleansing, systematic forced conversions, crime of slaving); war crimes (murder of Yazidi POWs); crime of genocide (recognized by the UN as an attempted genocide)\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\" |Syrian Civil War\n| colspan=\"2\" |Syrian opposition and allies\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n|Human rights violations\n| style=\"width:18%;\"|War crimes, kidnappings, crimes against civilians, torture, extrajudicial killings, enforced disappearance, sexual violence, use of human shields\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Several human rights outlets and activists have gathered evidence of severe war crimes committed by the Free Syrian Army, the Syrian National Army, the Turkish Armed Forces, and their allies.\n|-\n|Israeli airstrikes in Syria\n| style=\"width:18%;\"|War crimes; Airstrikes against civilians\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|At least 20 civilians have been killed by Israeli airstrikes in Syria\n|-\n| style=\"width:18%;\"|2019 Turkish offensive into north-eastern Syria\n| Summary executions, attacks against civilians, crimes against peace\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Amnesty International stated that it had gathered evidence of war crimes and other violations committed by Turkish and Turkey-backed Syrian forces who are said to \"have displayed a shameful disregard for civilian life, carrying out serious violations and war crimes, including summary killings and unlawful attacks that have killed and injured civilians\". Syrian Kurdish authorities accused Turkey of employing the chemical white phosphorus to target people.\n|}\n2015–2025: Kurdish–Turkish conflict\nAccording to the U.S. State Department 2016 Human Rights Report, in February 2016, Turkish security forces killed at least 130 people, including unarmed civilians, who had taken shelter in the basements of three buildings in the town of Cizre. A domestic NGO, The Human Rights Association (HRA), said the security forces killed more than 300 civilians in the first eight months of 2016. In March 2017, the United Nations voiced \"concern\" over the Turkish government's operations and called for an independent assessment of the \"massive destruction, killings and numerous other serious human rights violations\" against the ethnic Kurdish minority.\n2020 Nagorno-Karabakh war\nUN Secretary-General António Guterres stated that \"indiscriminate attacks on populated areas anywhere, including in Stepanakert, Ganja and other localities in and around the immediate Nagorno-Karabakh zone of conflict, were totally unacceptable\". Amnesty International stated that both Azerbaijani and Armenian forces committed war crimes during recent fighting in Nagorno-Karabakh, and called on Azerbaijani and Armenian authorities to immediately conduct independent, impartial investigations, identify all those responsible, and bring them to justice.\n2020–2022: Tigray War\nDuring the Tigray War, which included fighting between the Ethiopian National Defense Force (ENDF) soldiers and Tigray People's Liberation Front (TPLF) forces in the Tigray Region, the Ethiopian Human Rights Commission (EHRC) described the 9–10 November 2020 Mai Kadra massacre committed by Tigray youth group \"Samri\" in its 24 November 2020 preliminary report as \"grave human rights violations which may amount to crimes against humanity and war crimes\".\n2022–Present: Russia-Ukraine War\n]]\n.]]\n]]\nDuring the Russian invasion of Ukraine, multiple buildings such as airports, hospitals, kindergartens were bombed. There has been abuse of prisoners of war.\nIn April 2022 bodies of civilians murdered by Russian forces were found in the town of Bucha, which had been left after the occupation of the town. It was confirmed at least more than 300 bodies were in mass graves or stranded on the streets of the city. As of 22 April 2022 there have been more than 500 confirmed bodies.\nThe Siege of Mariupol started on 24 February 2022 and ended on 20 May 2022. It has been confirmed at thousands of lives have been claimed through the siege and that the city has been reduced to rubble.\nOn 21 April 2022, Satellite images showed mass graves around the besieged city of Mariupol. It has been confirmed at least 9,000+ bodies have been found since. On the same day Vladimir Putin ordered troops to blockade the Azovstal Steel Plant, the last Ukrainian controlled place in the besieged city of Mariupol. The steel plant had more than 1,000 Ukrainians confirmed inside of it.\nOn 17 March 2023, the International Criminal Court (ICC) issued arrest warrants for Vladimir Putin and Russia's Commissioner for Children's Rights Maria Lvova-Belova for war crimes of deportation and illegal transfer of children from occupied Ukraine to Russia.\nOn 13 June 2023, Russian troops murdered 6 civilians in Sumy Oblast near Seredyna-Buda, mutilated their bodies, and then mined the place to kill people who tried to retrieve their bodies. They also blocked retrieval of bodies for 2 more days.  This case is currently being investigated by Ukrainian authorities.\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|2022 Russian invasion of Ukraine\n| colspan=\"2\" |Russian Federation\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Irpin refugee column shelling\n| style=\"width:18%;\"|War crimes, crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Russian soldiers indiscriminately fired at refugees trying to flee across a collapsed bridge. 8 killed.\n|-\n| style=\"width:18%;\"|February 2022 Kharkiv cluster bombing\n| style=\"width:18%;\"|War crimes, crimes against peace, crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Russian soldiers indiscriminately fired banned cluster bombs in the centre of the city. 9 died.\n|-\n| style=\"width:18%;\"|Murder of Oleksandr Shelipov\n| style=\"width:18%;\"|War crimes\n| style=\"width:32%;\"|Vadim Shishimarin convicted in Ukraine\n| style=\"width:32%;\"|Shelipov was shot by a Russian soldier on the instructions of several others.\n|-\n| style=\"width:18%;\"|3 March 2022 Chernihiv bombing\n| style=\"width:18%;\"|War crimes, crimes against peace, crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Russian air strike with eight unguided aerial bombs hits people waiting in line at a store to get bread. 47 dead.\n|-\n| style=\"width:18%;\"|Siege of Mariupol\n| style=\"width:18%;\"|War crimes, crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Russian Army starts a siege of Mariupol, levelling the city to the ground. Targets include theatres, schools and maternity hospitals. 10,000 dead in the city.\n|-\n| style=\"width:18%;\"|Bucha massacre\n| style=\"width:18%;\"|War crimes, crimes against humanity, genocide\n| style=\"width:32%;\"|Kyiv courts indict 10 Russian soldiers from the 64th Motor Rifle Brigade\n| style=\"width:32%;\"|Russian Army massacres from 650 up to a thousand civilians during the occupation of Bucha.\n|-\n| style=\"width:18%;\"|Izium massacre\n| style=\"width:18%;\"|War crimes, crimes against humanity\n| style=\"width:32%;\"|No prosecution\n| style=\"width:32%;\"|Several mass graves, including one site containing at least 440 bodies were found in woods near Izium after it was recaptured by Ukrainian forces from Russia.\n|-\n| style=\"width:18%;\"|Kramatorsk railway station attack\n| style=\"width:18%;\"|War crimes, crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Russian Army missile strike at refugees trying to flee at a railway station.\n|-\n| style=\"width:18%;\"|Kremenchuk shopping mall attack\n| style=\"width:18%;\"|War crimes, crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Russian Army missile strike at a shopping mall full of civilians.\n|-\n| style=\"width:18%;\"|Beheading of a Ukrainian prisoner of war in summer 2022, Torture and castration of a Ukrainian POW in Pryvillia\n| style=\"width:18%;\"|War crimes, torture\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Videos of the execution and torture of Ukrainian prisoners of war by decapitation with a knife.\n|-\n| style=\"width:18%;\"|2022 Vinnytsia missile attacks\n| style=\"width:18%;\"|War crimes, crimes against humanity\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|Russian Army's reckless missile strikes against civilians in Vinnytsia. Dozens killed.\n|-\n| style=\"width:18%;\"|Child abductions in the 2022 Russian invasion of Ukraine\n| style=\"width:18%;\"|crimes against humanity, genocide\n| style=\"width:32%;\"|Vladimir Putin and Maria Lvova-Belova indicted by the ICC for war crimes\n| style=\"width:32%;\"|Deportation of Ukrainian children to Russia\n|-\n| style=\"width:18%;\"|Russian strikes against Ukrainian infrastructure\n| style=\"width:18%;\"|crimes against humanity, war crimes\n| style=\"width:32%;\"|The ICC indicted Lieutenant General Sergei Kobylash, Commander of Russian Aerospace Forces;  Admiral Viktor Sokolov Commander of the Black Sea Fleet; former Minister of Defence Sergei Shoigu; and Head of General Staff of the Armed Forces of the Russian Federation Valery Gerasimov.\n| style=\"width:32%;\"|Attacks on electrical grid during winter, leaving millions without heat, water or electricity during the cold weather\n|-\n| style=\"width:18%;\"|Destruction of Kakhovka dam and Hydroelectric Power Plant\n| style=\"width:18%;\"|crimes against humanity, genocide, ecocide\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"| Yet unknown estimate of human deaths. Hundreds of homes destroyed. Thousands of people displaced. Ecocide. Deaths of uncountable number of animals. \"Ukraine's agriculture ministry said 10,000 hectares of agricultural land on the Ukrainian-controlled side of the Dnipro had been flooded, and several times more on the Russian-occupied.\n|-\n| style=\"width:18%;\"| Bombing of Kharkiv\n| style=\"width:18%;\"| crimes against humanity, war crimes\n| style=\"width:32%;\"| Kyiv courts sentenced two Russian soldiers to 11 1/2  years each for firing artillery on two villages in the Kharkiv Oblast and a Russian pilot to 12 years in prison for dropping eight bombs on the Kharkiv TV and radio station.\n| style=\"width:32%;\"| Indiscriminate attacks against residential areas in Kharkiv Oblast, including with cluster munition.\n|-\n| style=\"width:18%;\"| Velyka Novosilka massacre\n| style=\"width:18%;\"|  war crimes\n| style=\"width:32%;\"| 6 surrendered Ukrainian personnel would be executed by Russian forces in a massacre, United Nations and the International Red Cross petitioned for an investigation by the Prosecutor General of Ukraine\n| style=\"width:32%;\"| Execution of POWs\n|}\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|2022 Russian invasion of Ukraine\n| colspan=\"2\"|Ukraine\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Torture of Russian soldiers in Mala Rohan\n| style=\"width:18%;\"|War crimes, Summary execution; torture of POWs\n| style=\"width:32%;\"|No prosecutions\n| style=\"width:32%;\"|\n|}\n2023–Present: Gaza war\nAn ongoing armed conflict between Israel and Palestinian militant groups led by Hamas began on 7 October 2023 with a coordinated surprise attack on Israel.\nIn April 2024, the United Nations Human Rights Council (UNHRC) adopted a resolution calling for Israel to be held accountable for possible war crimes and crimes against humanity in the Gaza Strip, and demanding a halt to all arms sales to the country. 28 countries voted in favor, 13 abstained, and six voted against. Israel's ambassador accused the UN of anti-Israeli bias.\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Gaza war\n| colspan=\"2\"|Hamas\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Re'im music festival massacre\n| style=\"width:18%;\"|War crimes, crimes against humanity, massacre, hostage-taking\n| style=\"width:32%;\"|ICC arrest warrant for Mohammed Deif\n| style=\"width:32%;\"|260 people at the \"Supernova Sukkot Gathering\" music festival were murdered\n|-\n| style=\"width:18%;\"|Be'eri massacre\n| style=\"width:18%;\"|War crimes, crimes against humanity, massacre\n| style=\"width:32%;\"|ICC arrest warrant for Mohammed Deif\n| style=\"width:32%;\"|At least 110 people were killed in the attack, including women and children, claiming the lives of 10% of the farming community's residents. Dozens of homes were also burned down.\n|-\n| style=\"width:18%;\"|Kfar Aza massacre\n| style=\"width:18%;\"|War crimes, crimes against humanity\n| style=\"width:32%;\"|ICC arrest warrant for Mohammed Deif\n| style=\"width:32%;\"|Over 50 people were murdered\n|-\n|Nir Oz massacre\n|War crimes, crimes against humanity\n|ICC arrest warrant for Mohammed Deif\n|180 of 400 residents were killed or kidnapped.\n|-\n! colspan=\"2\" |Armed conflict\n! colspan=\"2\" |Perpetrator\n|- style=\"text-align:center;\"\n| colspan=\"2\"|Gaza war\n| colspan=\"2\"|Israel\n|-\n!Incident !! Type of crime!!Persons responsible!!Notes\n|-\n| style=\"width:18%;\"|Gaza Strip famine\n| style=\"width:18%;\"|Starvation, blockade, crimes against civilians, collective punishment\n| style=\"width:32%;\"|ICC issues arrest warrant for Benjamin Netanyahu and Yoav Gallant\n| style=\"width:32%;\"|On 9 October 2023, Israel imposed a \"total blockade\" of the Gaza Strip, blocking the entry of food, water, medicine, fuel and electricity. The ICC described it as starvation as a war crime. HRW estimates thousands of Palestinians were deprived of access to drinking water and died.\n|-\n| style=\"width:18%;\"|Attacks on Palestinians evacuating Gaza\n| style=\"width:18%;\"|Crimes against civilians, collective punishment\n| style=\"width:32%;\"|ICC arrest warrant for Netanyahu and Gallant\n| style=\"width:32%;\"|On 13 October, Israel directed over 1 million residents of northern Gaza to evacuate within 24 hours. 70 were killed in explosions on the road south. Sources disagree about the source of the attacks.\n|-\n| style=\"width:18%;\"|Flour massacre\n| style=\"width:18%;\"|War crimes, crimes against civilians, massacre\n| style=\"width:32%;\"|ICC arrest warrant for Netanyahu and Gallant\n| style=\"width:32%;\"|On 29 February 2024, Israeli soldiers opened fire on a crowd of Gazan civilians seeking food from a humanitarian aid convoy, killing at least 118 and wounding many more.\n|-\n| style=\"width:18%;\"|October 2024 Rufaida school attack\n| style=\"width:18%;\"|War crimes, crimes against humanity\n| style=\"width:32%;\"|ICC arrest warrant for Netanyahu and Gallant\n| style=\"width:32%;\"|Israeli Air Force bombs Rufaida school-turned-shelter. The airstrikes killed at least 28 Palestinians and injured more than 54.\n|-\n| style=\"width:18%;\"|19 October 2024 Beit Lahia attacks\n| style=\"width:18%;\"|War crimes, crimes against humanity\n| style=\"width:32%;\"|ICC arrest warrant for Netanyahu and Gallant\n| style=\"width:32%;\"|Israeli Air Force bombs Beit Lahia area.\n|-\n| style=\"width:18%;\"|Tel al-Sultan attack\n| style=\"width:18%;\"|War crimes, crimes against humanity\n| style=\"width:32%;\"|ICC arrest warrant for Netanyahu and Gallant\n| style=\"width:32%;\"|Israeli Air Force bombs a displacement camp in Tel al-Sultan, Rafah.\n|}\nSee also\n* Bosnian War\n* Children in the military\n* Crimes against humanity\n* Democide\n* Ethnic cleansing\n* Geneva Conventions\n* Genocidal rape\n* Genocide\n* Genocide definitions\n* Genocide of indigenous peoples\n* Genocides in history\n* The Holocaust\n* International humanitarian law\n* International law\n* Laws of war\n* List of ethnic cleansing campaigns\n* List of genocides\n* List of most-wanted Nazi war criminals, according to the Simon Wiesenthal Center\n* List of people indicted in the International Criminal Court\n* List of war criminals\n* Mass killings under communist regimes\n* Mass murder\n* Military history\n* Russian invasion of Ukraine\n* Russian war crimes\n* Second Italo-Ethiopian War\n* Second Sino-Japanese War\n* Soviet war crimes\n* Spanish Civil War\n* Torture\n* United States war crimes\n* War crime\n* War crimes of the Wehrmacht\n* World War I\n* World War II\nNotes\nReferences\nBarefoot in the Rubble Elizabeth B. Walter 1997.  (No pages cited)\n}}\nExternal links\n* [http://forum.axishistory.com/viewtopic.php?t=65233 1944–1945 Killing of Allied POWs in Europe]\n* [https://web.archive.org/web/20160304083122/http://www.politicaanticrimen.com/sites/all/themes/bluemasters/pdfs/BJC_rjm.pdf A Criminological Analysis of the Invasion and Occupation of Iraq By Ronald C. Kramer and Raymond J. Michalowski]\n* Kramer, Alan: [https://encyclopedia.1914-1918-online.net/article/atrocities/ Atrocities], in: [https://encyclopedia.1914-1918-online.net/home.html/ 1914-1918-online. International Encyclopedia of the First World War]."
    }
  ]
}