{
  "content": [
    {
      "type": "text",
      "text": "# List of Canadian heritage wheat varieties__disambig_1\n\n'Red Fife' was the first named variety of wheat developed in Canada. Plant breeders continue to use heritage wheat varieties in order to develop new varieties.\nFarmers are growing heritage wheat varieties as part of the 100 Mile Diet, 'eat local' and Slow Food movements. 'Red Fife' wheat is the first variety preserved heritage wheat to celebrate terroir, which is the interaction of the genetics of the variety with the growing conditions where the variety is grown.\nCanadian heritage wheat varieties\nThe following are 33 varieties of Canadian wheat listed by the year they were recognized formally, their parentage, where they were developed and any other remarks.\n* Red Fife, 1885. The seed was sent to David Fife in Peterborough, Ontario, taken from a ship in the Glasgow port originating from Danzig. A friend of his sent him seed from Glasgow in 1842. It is a good yielding wheat, high in quality; an excellent milling wheat. It was grown in Canada from 1860 to 1900, and was the industry standard.\n* Ladoga, 1888. A variety originally from Russia. Early maturing, and the parent of Preston and Stanley.\n* Hard Red Calcutta, 1890. A variety from India. The parent of Marquis, it was never grown commercially in Canada.\n* Stanley, 1895, Ladoga × Red Fife. It was developed by Agriculture Canada in Ottawa, Ontario. It was a sibling of Preston but never widely grown.\n* Preston, 1895, Ladoga × Red Fife. Developed by Agriculture Canada, Ottawa. A parent of Garnet.\n* Bishop, 1904, Ladoga × Gehun. Developed Charles Saunders at the Central Experimental Farm in Ottawa.\n* Marquis, 1910, Red Fife × Hard Red Calcutta. Developed by Agriculture Canada, Ottawa. William Saunders made the cross at Agassiz in 1892. Charles Saunders selected it in Ottawa, using a chewing test for determining quality.\n* Kitchener, 1911. Head selections from Marquis developed by Agriculture Canada. Seager Wheeler made the selections, but it was never as good as Marquis.\n* Prelude, 1913, Downey Gehun × Fraser. Developed by Agriculture Canada. A very early maturing, but low yielding variety.\n* Ruby, 1920, Downy Riga × Red Fife. Developed by Agriculture Canada. It matures 7–10 days earlier than Marquis, but it shatters.\n* Garnet, 1925, Preston × Riga. Developed by Agriculture Canada. Early and it matures under cool conditions.\n* Red Bobs 222, 1926. Selected from Early Triumph, which was selected from an Australian variety called Bobs at the University of Alberta. It is early maturing, rust susceptible, and was grown mainly in Alberta.\n* Reward, 1928, Marquis × Prelude. Developed by Agriculture Canada. It matures early and is of good quality.\n* Early Red Fife, 1932, Marquis × Kanred. Developed at the University of Alberta. It matures 3 days earlier than Red Fife.\n* Canus, 1935, Marquis × Kanred. Developed at the University of Alberta. It is root rot and smut resistant.\n* Thatcher, 1935, Marquillo × (Marquis × Kanred) Marquillo=Marquis × lumillo (Durum). Developed at the University of Minnesota. First of a series of rust resistant varieties. Widely adapted, good quality. It made up 70% of the Canadian wheat acreage in 1953.\n* Rescue, 1946, Apex × S-615 (solid stem type from Portugal via North America). C.D.A. Ottawa. It has a solid stem developed for sawfly resistance.\n* Saunders, 1947, (Hope × Reward) × Thatcher. Developed by Agriculture Canada. It was released early on the basis of extensive testing in the Peace River, Alberta area.\n* Chinook, 1952, S-615 × Thatcher. Developed by Agriculture Canada. it is resistant to sawfly.\n* Selkirk, 1953, (McMurachy × Exchange) × Redman 3. Developed by Agriculture Canada. It is resistant to stem rust 15B.\n* Canthatch, 1959, Kenya Farmer × Thatcher. Developed by Agriculture Canada. A Thatcher type that is resistant to stem rust races 15B and 11.\n* Cypress, 1962, Rescue × Chinook (Chinook S-615 × Thatcher). Developed by Agriculture Canada. Sold stem developed for sawfly resistant.\n* Park, 1963, (Mida × Cadet) × Thatcher. Developed by Agriculture Canada. Early maturing and better seed quality than Saunders.\n* Manitou, 1965, ((Frontana × Thatcher) × (Kenya Farmer × Thatchers) × Red Egyptian × Thatcher). Developed by Agriculture Canada. It has more rust resistance.\n* Lemhi 62, 1968, Federation × Cicklon. Developed by the USDA. A soft white spring wheat.\n* Neepawa, 1969. Similar to Manitou. Developed by Agriculture Canada. Earlier maturing and higher yielding than Thatcher.\n* Pitic 62, 1969. Yaktana 54 × (Norin 10 × Brever). Developed in Mexico. It was the first utility wheat to be licensed in Canada.\n* Glenlea, 1972, (Pembina2 × Bage) × CB200. Developed by the University of Manitoba. It is a Canada Western Extra Strong type with very strong gluten, and higher yield than Neepawa\n* Napayo, 1972, Manitou × R1. Developed in Agriculture Canada. It is similar to Manitou.\n* Springfield, 1972. Mostly Mexico. Developed in Idaho. A soft white strong straw type for irrigated areas.\n* Canuck, 1974, Canthatch × Mida × Cadet × Rescue. Developed by Agriculture Canada. It was a replacement for Cypress and is sawfly resistant.\n* Sinton, 1975, Thatcher × Lee × Kenya Farmer. Developed by Agriculture Canada. It is equal to Neepawa in yield.\n* Norquay, (Lerma Rojo × Sonora 64) × Justin. Developed by the University of Manitoba. A utility type.\n* Acadia, 1937. Made at the Experimental Farm in Indian Head, Saskatchewan. It was grown in tests in Eastern Canada starting in 1942 and was recommended for license in 1951 as \"wheat for use in Eastern Canada.\" Here it was a consistently high yield showing remarkably good strength and vigour of growth. According to the old research station records, Acadia and Selkirk were the two most prominent varieties of bread wheat grown in the Maritimes in the 1950s. This was a time when the region was much more self-sufficient in wheat production. Great for all types of baking. Grown in the Maritimes.\nSee also\n* History of agriculture in Canada\n* Organizations:\n** Alberta Wheat Pool\n** Canadian Wheat Board\n** Saskatchewan Wheat Pool\n** Western Canadian Wheat Growers Association\n* Taxonomy of wheat\nReferences"
    }
  ]
}