{
  "content": [
    {
      "type": "text",
      "text": "# List of Texas Revolution battles\n\nWhen Mexico's congress changed the constitution in 1827 and 1835, and banned slavery in 1829 and immigration in 1830, immigrants, slave-owners, and federalists throughout the country revolted; in Texas, an armed uprising began on October 2, 1835, when settlers refused to return a small cannon to Mexican troops. This Battle of Gonzales ended with Mexican troops retreating empty-handed to San Antonio de Bexar (now the U.S. city of San Antonio, Texas).  Emboldened by their victory, the Texans formed a volunteer army. A small force of Texans traveled down the Texas coastline, defeating Mexican troops at Goliad and  at Fort Lipantitlán. The majority of the Texan troops followed General Sam Houston where they initiated a siege of the Mexican garrison. After victories in several skirmishes, including the Battle of Concepción and the Grass Fight, the Texans attacked Bexar. After several days of fighting, the Siege of Bexar ended with the surrender of the Mexican general.\nMany Texans believed the war was now over, and the majority of the settlers returned to their homes.  The remaining settlers were garrisoned at the Alamo Mission in Bexar and at Presidio La Bahia in Goliad. In early January, a large number of the remaining settlers, most of whom were immigrants recently arrived from the United States, despite the immigration ban passed by Mexico in April, 1830, began clamoring to invade Mexico. Colonel Frank W. Johnson and Dr. James Grant began preparing to attack Matamoros. Even before Cos's defeat, Santa Anna had been making plans to retake Texas. In January, he led the \"Army of Operations in Texas\" towards the rebellious territory. At the Rio Grande, the army divided; Santa Anna led the bulk of his troops toward Bexar, where he laid siege to the Alamo.  The remaining troops, under General Jose de Urrea, traveled up the coastline, easily defeating Johnson and Grant at the battles of San Patricio and Agua Dulce.\nNews of these first Mexican victories cheered the Mexican force gathered at Bexar. On March 6, Santa Anna ordered an advance on the Alamo; all but a few of the occupants were killed. Susanna Dickinson, the wife of an Alamo occupier, her infant daughter, Angelina, and Joe, a slave of William Barret Travis, were released to tell Sam Houston what had happened. The youngest person in the Alamo was 16 years old. They were told to say that everyone would either surrender or die.\nNews of the Texan defeat and approach of the Mexican army terrified the settlers; in an event later known as the Runaway Scrape, settlers, the Texas government, and the remnants of the Texan army under the command of Sam Houston fled east, away from the approaching army. Houston ordered Colonel James Fannin to abandon Goliad and join his retreat. However, Fannin delayed his departure and sent a quarter of his troops to help evacuate the settlers at Refugio. Mexican forces in the area were stronger than the Texans expected at Refugio and defeated them. After receiving word of the defeat, Fannin finally began his retreat. His men were quickly overtaken and surrounded by Mexican soldiers. Fannin fought courageously at the Battle of Coleto, but was forced to surrender. He and his 300 men were taken prisoner, but just days later were executed in the Goliad Massacre.\nThe only remaining Texan troops were those retreating with Houston. After learning that Santa Anna had again divided his forces, Houston ordered an attack on April 21, 1836. Crying \"Remember the Alamo\" and \"Remember Goliad\", the Texans showed little mercy during the Battle of San Jacinto. Santa Anna was captured in hiding the following day and he ordered his army to return to Mexico, ending the Texas Revolution.\n{| class=\"wikitable\"\n!style=\"background: #FFEBAD\"| Battle\n!style=\"background: #FFEBAD\"| Location\n!style=\"background: #FFEBAD\"| Date(s)\n!style=\"background: #FFEBAD\"| Engagement remarks\n!style=\"background: #FFEBAD\"| Victor\n|-\n|Battle of Gonzales\n|Gonzales\n|October 2, 1835\n|This battle resulted in the first casualties of the Texas Revolution. Two Mexican soldiers killed.\n|style=\"background:#FFB19A\"|Texas\n|-\n|Battle of Goliad\n|Goliad\n|October 10, 1835\n|Texans captured Presidio La Bahia, blocking the Mexican Army in Texas from accessing the primary Texas port of Copano.  One Texan was wounded, and estimates of Mexican casualties range from one to three soldiers killed and from three to seven wounded.\n|style=\"background:#FFB19A\"|Texas\n|-\n|Battle of Concepción\n|San Antonio de Bexar\n|October 28, 1835\n|In the last offensive ordered by General Martin Perfecto de Cos during the Texas Revolution, Mexican soldiers surprised a Texan force camped near Mission Concepción.  The Texans repulsed several attacks with what historian Alwyn Barr described as \"able leadership, a strong position, and greater firepower\".  One Texan was injured, and Richard Andrews became the first Texan soldier to die in battle.  Between 14 and 76 Mexican soldiers were killed.  Historian Stephen Hardin believes that \"the relative ease of the victory at Concepción instilled in the Texans a reliance on their long rifles and a contempt for their enemies\", which may have led to the later Texan defeat at Coleto.\n|style=\"background:#FFB19A\"|Texas\n|-\n|Battle of Lipantitlán\n|San Patricio\n|November 4&ndash;5, 1835\n|Texans captured and destroyed Fort Lipantitlán.  Most of the Mexican soldiers retreated to Matamoros.  One Texan was wounded, and 3&ndash;5 Mexican soldiers were killed, with an additional 14&ndash;17 Mexican soldiers wounded.\n|style=\"background:#FFB19A\"|Texas\n|-\n|Grass Fight\n|San Antonio de Bexar\n|November 26, 1835\n|Texans attack a large Mexican army pack train. 4 Texans wounded and 17 Mexican casualties. Resulted in the capture of horses and hay (grass).\n|style=\"background:#FFB19A\"|Texas\n|-\n|Siege of Bexar\n|San Antonio de Bexar\n|October 12 – December 11, 1835\n|In a six-week siege, Texans attacked Bexar and fought from house to house for five days.  After Cos surrendered, all Mexican troops in Texas were forced to retreat beyond the Rio Grande, leaving the Texans in military control. 150 Mexicans killed or wounded and 35 Texans killed or wounded.\n|style=\"background:#FFB19A\"|Texas\n|-\n|Battle of San Patricio\n|San Patricio\n|February 27, 1836\n|This was the first battle of the Goliad Campaign. The Johnson-Grant venture, the first battle of the Texas Revolution in which the Mexican Army was the victor. From the Johnson forces, 20 Texans killed, 32 captured and 1 Mexican loss, 4 wounded.  Johnson and 4 others escaped after capture and proceeded to Goliad. Johnson would survive the Texas Revolution.\n|style=\"background:#8BDF64\"|Mexico\n|-\n|Battle of Agua Dulce\n|Agua Dulce\n|March 2, 1836\n|Second battle of the Goliad Campaign. Of 27 men of the Grant and Morris forces from the Johnson-Grant venture-12/15 killed; 6 captured and imprisoned at Matamoros; Six escaped, of whom five were killed at Goliad Massacre\n|style=\"background:#8BDF64\"|Mexico\n|-\n|Battle of the Alamo\n|San Antonio de Bexar\n|February 23 &ndash; March 6, 1836\n|Mexican President Antonio Lopez de Santa Anna personally oversaw the siege of the Alamo and the subsequent battle, where almost all 189-250 Texan defenders were killed. 600 Mexicans killed or wounded. Anger over Santa Anna's lack of mercy led many Texan settlers to join the Texan Army. (This battle is considered one of the most famous battles in American history and is the inspiration for dozens of movies and books)\n|style=\"background:#8BDF64\"|Mexico\n|-\n|Battle of Refugio\n|Refugio\n|March 14, 1836\n|Third battle of the Goliad Campaign. Texans inflicted heavy casualties, but split their forces and retreated, ending in capture. About 50 Texans killed and 98 captured with some later executions, 29 spared as laborers, survivors sent to Goliad and possibly 80-100 Mexican casualties with 50 wounded.\n|style=\"background:#8BDF64\"|Mexico\n|-\n|Battle of Coleto\n|outside Goliad\n|March 19&ndash;20, 1836\n|Final battle of the Goliad Campaign. In an attempt to rendezvous with other Texan forces, the southernmost wing of Texan army brazenly departs their heavily fortified location in the midst of oppositional forces.  A battle ensues with 10 Texans killed, 60 wounded and 200 Mexicans killed or wounded. After the second day of fighting, a Texan surrender is agreed upon. Approximately 342 of the captured Texans were not pardoned but were executed on March 27 in the Goliad Massacre with 20 spared and 28 escaped. Anger over Santa Anna's lack of mercy led many future Texan settlers to join the Texan Army.\n|style=\"background:#8BDF64\"|Mexico\n|-\n|Battle of San Jacinto\n| near modern La Porte\n|April 21, 1836\n|After an 18-minute battle, Texans routed Santa Anna's forces, eventually taking Santa Anna prisoner.  This was the last battle of the Texas Revolution. 630  Mexicans killed, 208 wounded, 730 captured and 9 Texans killed, 30 wounded.\n|style=\"background:#FFB19A\"|Texas\n|}\nSee also\n*Timeline of the Texas Revolution\n*Tampico Expedition, a group organized in New Orleans who were told they would join the Texas Revolution. They actually attacked Tampico in Mexico before the survivors retreated to Texas.\nFootnotes\nSources\n*\n*\n*\n*\n*"
    }
  ]
}