{
  "content": [
    {
      "type": "text",
      "text": "# List of historical Greek countries and regions\n\nThis is a list of Greek countries and regions throughout history. It includes empires, countries, states, regions and territories that have or had in the past one of the following characteristics:\n*An ethnic Greek majority\n*Greek language as an official language\n*A Greek ruling class or dynasty\nAntiquity (to 330 AD)\nBronze Age\nDuring the Bronze Age a number of entities were formed in Mycenean Greece (1600-1100 BC), each of them was ruled by a Wanax, including:\n*Iolcos\n*Mides\n*Mycenae\n*Orchomenos\n*Pylos\n*Thebes\n*Tiryns\nKnossos, a Minoan palace centre, was later occupied by the Mycenaeans\nCity states\nDuring the history of Ancient Greece a total of 1,500 to 2,000 city-states were established. These included:\n*Athens (1796–86 BC)\n*Chalcis (? – 146 BC)\n*Corinth (700 BC–146 BC)\n*Eretria (? – 146 BC)\n*Massalia (600–49 BC )\n*Sparta (900s– 146 BC)\n*Syracuse (734–212 BC)\n*Taras (706-201 BC)\n*Thebes (? – 146 BC)\nKingdoms, Empires and countries\n*Macedonian Empire (359 BC-323 BC)\n*Kingdom of Epirus (330 BC–167 BC)\n*Delian League (or Athenian Empire) (478-404 BC)\n*Kingdom of Cyrene (632–30 BC)\n*Thessalian League (?–170s BC): confederation of Greek city states\n*Chrysaorian League (? – 203 BC): confederation of Greek city states\n*Odrysian kingdom (480 BC–46 AD; under Greek rule since 340 BC until 46 AD)\n*Aetolian League (370–189 BC): confederation of Greek city states\n*Achaean League (256–146 BC): confederation of Greek city states\n*Antigonid dynasty (306 BC–168 BC)\n* Argead dynasty (700 BC-300 BC)\n*Antipatrid dynasty\n*Attalid kingdom (282 BC–133 BC)\n*Kingdom of Bithynia (297 BC–63 BC)\n*Seleucid Empire (312–63 BC)\n*Ptolemaic Kingdom (305–30 BC)\n*Bosporan Kingdom  (438 BC– 370 AD)\n*Kingdom of Pontus (302–64 BC): ruled by the Mithridatic dynasty of Persian origin, the kingdom was Hellenized in culture, and with Greek being the official language.\n*Greco-Bactrian Kingdom (250 – 125 BC)\n*Indo-Greek Kingdom (180 BC – 10 AD)\n*Dayuan Kingdom (329 – 160 BC)\n*Parthian Empire (247 BC – 224 AD): ruled by the Arsacid dynasty of Parthia, it was partly Hellenized in culture, and with Greek being one of its official languages.\n*Kingdom of Commagene (163 BC - 72 AD): Greco-Iranian Kingdom ruled by Hellenized branch of Orontid dynasty of Iranian origin, with Greek being the official language\n*Kingdom of Cappadocia (320s BC – 17 AD): Hellenistic-era Iranian kingdom, with Greek the official language. The kingdom was founded by an Iranian dynasty, known as the Ariarathid dynasty (331–96 BC) and was succeeded by another one, the Ariobarzanid dynasty (96–36 BC). The last dynasty, that of Archelaus of Cappadocia (36 BC–17 AD), was of Greek origin.\n*  Byzantine Empire (610 AD – 1204 AD; 1261 - 1453): The Greek language had official status\n**Epirus\n**Achaea\n**Macedonia\n**Thracia\n**Asia\nMiddle Ages (330–1453)\nThe Greek Middle Ages are coterminous with the duration of the  Byzantine Empire (330–1453).\nAfter 395 the Roman Empire split in two. In the East, Greeks were the predominant national group and their language was the lingua franca of the region. Christianity was the official religion of this new Empire, spread through the region by the Greek language, the language in which the first gospels were written. The language of the aristocracy however remained Latin, until gradually replaced by Greek by 7th century. The East Roman Empire retained its status as the power at least in the Mediterranean world until the 12th century. Amongst its impacts was the spread of Christianity to Eastern Europe and the Slavs, the halting of the Persian, Slavic and Arab expansions towards Europe and the preservation of a significant body of the cultural heritage of Greek-Roman Antiquity. In 1204, after a civil struggle over the  succession of throne among the members of ruling Angelid(Angeloi), the Fourth Crusade conquered the capital, Constantinople. The Empire was subject to partitions and crises from which it never recovered.\nByzantine Greek successor states\n*Despotate of Epirus (1205–1479)\n*Empire of Nicaea (1204–1261), which re-established the Byzantine Empire in 1261.\n* Empire of Trebizond (1204–1461)\n*Despotate of the Morea (1308/1348–1460)\n* Principality of Theodoro (early 14th century–1475)\nCrusader states\n*County of Edessa (1098–1149): crusader state with a partly Greek population\n:*30px Lordship of Turbessel: vassal of the County of Edessa\n*30px Principality of Antioch (1098–1268): crusader state with a partly Greek population\n*30px Kingdom of Jerusalem (1099–1291): crusader state with a partly Greek population\n:*Vassals of the Kingdom of Jerusalem\n*30px County of Tripoli (1102–1289): crusader state with a partly Greek population\n*County palatine of Cephalonia and Zakynthos (1185–1479): as a vassal of the Kingdom of Sicily with an ethnic Greek majority\n*30px Kingdom of Cyprus (1192–1489): crusader state with an ethnic Greek majority and partly Greek dynasty\n*30px Latin Empire (1204–1261): crusader state with an ethnic Greek majority, established after the sack of Constantinople by the Crusaders of the Fourth Crusade\n*30px Kingdom of Thessalonica (1202–1224): crusader state with an ethnic Greek majority\n*30px Duchy of Neopatria (1204–1390): crusader state with an ethnic Greek majority\n*Margraviate of Bodonitsa (1204–1414): crusader state with an ethnic Greek majority\n*30px Principality of Achaea (1205–1432): crusader state with an ethnic Greek majority\n*30px Duchy of Athens (1205–1458): crusader state with an ethnic Greek majority\n*30px Lordship of Argos and Nauplia (1205–1388): crusader state with an ethnic Greek majority\n*Lordship of Salona (1205–1410): crusader state, established after the Fourth Crusade\n*30px Duchy of the Archipelago (1207–1579): crusader state with an ethnic Greek majority\n*Lordship of Chios (1304–1566): crusader state with an ethnic Greek majority\n* Knights Hospitaller of Rhodes (1310–1522): crusader state with an ethnic Greek majority\n* (1309–1440): crusader state with an ethnic Greek majority\n*Principality of Lesbos (1355–1462)\n* Various possessions of the Republic of Venice in Greece:\n:*Kingdom of Crete (1204–1669)\n:*Kingdom of Cyprus (1489–1573)\n:*Ionian Islands (acquired at various times, held until 1799)\n:*Kingdom of the Morea (c. 1690–1715)\n:*Lordship of Negroponte (1204–1470): crusader state with an ethnic Greek majority\nOther states\n*Cretan Republic (1332–1371)\nModern era (after 1453)\nIndependent states\n* Septinsular Republic (1799–1815), independent under nominal Russian and Ottoman sovereignty. The Ionian Islands were under Venetian Sovereignty from 1386-1797. During this time, the main administrative body of the islands was the General Council of Corfu which was made up of aristocratic families, both Orthodox and Catholic. This led to the islands being ruled as a kind of oligarchic proto-republic until the formal establishment of the Septinsular Republic in 1799.\n*/ Greece (1822–present)\n* Cyprus (1960–present)\nAutonomous, secessionist or unrecognised entities\n* Autonomous Monastic State of the Holy Mountain: autonomous region of Greece since 1913. Autonomy dated at least to 943.\n* Himara (15th century - 1912): autonomous region located in modern-day southern Albania.\n* Cycladic islands (1537-1828): most of the Cycladic islands in the Aegean Sea retained their distinct local governments and charters, being ruled by locally elected representatives or dukes.\n* Koinon of the Zagorisians (1431/1670–1868): the Zagori village mountains formed league of important villages in Epirus governed by a council of elders, located in the modern-day Zagori municipality of Greece.\n*  Phanariote period in Wallachia & Moldavia (1560/1711–1822): autonomous principalities ruled by the Phanariotes. Greeks had been established as rulers in Wallachia as early as the 16th century. From 1701-1822 AD, the country was controlled exclusively by Greek Phanariotes appointed by Constantinople.\n* Mani (1461 – 1833): sovereign region in the Peloponnese. The first post-Byzantine lord of Mani is considered to be Michael Rallis, after his death in 1466 Krokodeilos Kladas succeeded him. From the 16th-18th centuries Mani was a heavily decentralised region ruled by local Orthodox Christian Captains. After 1776, the lordship of Mani was formally recognised by the Ottomans, and the local ruler was called a bey. Mani was famous for being a Christian stronghold and a trustworthy ally for the Holy League during their wars with the Ottoman Empire. By the late 1700s the Maniots controlled large swathes of land in the southern Peloponnese, and the area became a refuge for many Greeks who were fleeing from Albanian raiders in the aftermath of the Orlov Revolt. During the late 1600s, Limberakis Gerakaris was the most powerful Captain of Mani and was recognised as Bey by the Ottomans, he was famous for his numerous slave raids on Ottoman and Venetian ships. Tzanetos Grigorakis, who ruled Mani from 1782-1798 was famous for his attempts to centralise the region and his reign was romanticised by the poet Nikitas Niphakos who stayed at his court. Mani was governed according to a mixture of local oral law and Orthodox Church canon law. The first region in which the Greek Revolution began in 1821 was in Mani and it was orchestrated by Petrobey Mavromichalis. After 1833, Mani was integrated into the Kingdom of Greece.\n* United States of the Ionian Islands (1815–1864): amical protectorate of the United Kingdom.\n* Regional administrations during the Greek War of Independence (March 1821 – c. 1825):\n:*Messenian Senate (1821)\n:*Peloponnesian Senate (1821-1823)\n:*Senate of Western Continental Greece (1821-1823)\n:* Areopagus of Eastern Continental Greece (1821-1825)\n:*Polity of Crete\n:* Military-Political System of Samos (1821-1834)\n* Principality of Samos (1835–1912): incorporated into Greece.\n* (1898–1913): incorporated into Greece.\n* Free State of Icaria (1912): short-lived independent state, incorporated into Greece.\n* Autonomous Republic of Northern Epirus (1914): short-lived autonomous Greek state in modern-day Southern Albania (Northern Epirus) under a provisional government. Autonomy recognised in the Protocol of Corfu.\n* State of Thessaloniki (1916–1917): short-lived Venizelist Provisional Government  established in Macedonia amidst the National Schism. It controlled northern Greece and the island of Crete. The rest of Greece was controlled by the government in Athens (State of Athens). Greece was reunited in 1917.\n* Republic of Pontus (1917–1922): Pontian Greek short-lived state.\n* Ionian autonomy (1922): short-lived Greek dependency in the region of Ionia, Asia Minor, during the final stages of the Asia Minor expedition.\n*Imbros and Tenedos: Aegean islands inhabited historically mainly by ethnic Greeks. Under Greek administration from 1912. Following the Treaty of Lausanne in 1923, Gökçeada (Imbros) and Bozcaada (Tenedos) became part of Turkey, but were  exempted from the population exchange.\n*Greek Autonomous District (1930-1939): short-lived Greek Autonomous Raion of Russian Soviet Federative Socialist Republic\n* Political Committee of National Liberation (1944), otherwise known as the \"Mountain Government\": a provisional government established in liberated areas by the National Liberation Front in the last stages of the Axis occupation of Greece during World War II. It was integrated with the Greek government-in-exile in a national unity government at the Lebanon conference in May 1944, and existed until the full German withdrawal from the country in October.\n* Provisional Democratic Government (1947-1949): a Communist Party-dominated provisional government established during the Greek Civil War in opposition to the royal government in Athens. It ceased to exist with the victory of the royalist forces in the civil war.\nReferences"
    }
  ]
}