{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in Moldova__disambig_1\n\n}}\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) World Heritage Sites are places of importance to cultural or natural heritage as described in the UNESCO World Heritage Convention, established in 1972. Cultural heritage consists of monuments (such as architectural works, monumental sculptures, or inscriptions), groups of buildings, and sites (including archaeological sites). Natural heritage consists of natural features (physical and biological formations), geological and physiographical formations (including habitats of threatened species of animals and plants), and natural sites which are important from the point of view of science, conservation, or natural beauty. The Republic of Moldova ratified the convention on 23 September 2002. , Moldova has one World Heritage Site listed, the Struve Geodetic Arc, which was listed in 2005. It is a transnational site, shared with nine other countries. There are also three sites on the tentative list.\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural, and vii through x are natural.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n! style=\"width:100px;\" scope=\"col\"| Site\n! class=\"unsortable\"  style=\"width:150px;\" scope=\"col\"| Image\n! style=\"width:80px;\" scope=\"col\"| Location\n! style=\"width:50px;\" scope=\"col\"| Year listed\n! style=\"width:60px;\" scope=\"col\" data-sort-type=\"number\"|\n! scope=\"col\" class=\"unsortable\" | Description\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"|Struve Geodetic Arc\n|\n| Soroca District\n| 2005\n| 1187; ii, iii, vi (cultural)\n| The Struve Geodetic Arc is a series of triangulation points, stretching over a distance of  from Hammerfest in Norway to the Black Sea. The points were set up in a survey by the astronomer Friedrich Georg Wilhelm von Struve who first carried out an accurate measurement of a long segment of a meridian, which helped to establish the size and shape of the Earth. Originally, there were 265 station points. The World Heritage Site includes 34 points in ten countries (North to South: Norway, Sweden, Finland, Russia, Estonia, Latvia, Lithuania, Belarus, Moldova, Ukraine), one of which is in Moldova (station point in Rudi pictured).\n|-\n|}\nTentative list\nIn addition to sites inscribed on the World Heritage List, member states can maintain a list of tentative sites that they may consider for nomination. Nominations for the World Heritage List are only accepted if the site was previously listed on the tentative list. , Moldova lists three properties on its tentative list.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\"| Site\n! class=\"unsortable\"  style=\"width:150px;\" scope=\"col\"| Image\n! style=\"width:80px;\" scope=\"col\"| Location\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\"| UNESCO criteria\n! scope=\"col\" class=\"unsortable\" | Description\n|-\n! scope=\"row\" | The Typical Chernozem Soils of the Bălți Steppe\n|\n| Bălți\n| 2011\n| v, ix, x (mixed)\n| Chernozem is one of the most fertile soils. The tentative site comprises five locations around Bălți where long-time field experiments have been carried out for up to 50 years in order to study the impact of different agricultural practices, such as the use of crop rotations or monoculture, as well as different systems of tillage, fertilization, and irrigation on crop yields and soil fertility. The Bălți Steppe was important in the development of the soil science in the 19th century.\n|-\n! scope=\"row\" | Orheiul Vechi Archaeological Landscape\n|\n| Orhei District\n| 2017\n| ii, v (cultural)\n| Old Orhei is located on the bank of the Răut river. The area was already settled in the Paleolithic. Remains of a settlement from the Chalcolithic period (Cucuteni–Trypillia culture) have been found, as well as settlements from the Iron Age. In the 13th and 14th century, it was the site of an important Golden Horde town. Following the departure of the Mongols, Orhei developed into one of the most important Moldovan medieval towns. It was abandoned in the 18th century when the inhabitants moved to the nearby village Trebujeni.\n|-\n! scope=\"row\" | The Underground Wineries of Moldova (Cricova and Mileștii Mici)\n|\n| Chișinău, Ialoveni District\n| 2025\n| iii, iv, v (cultural)\n| The tradition of wine-making has become popular in Bessarabia since 19th century. The rising demand for Moldovan wine caused local wineries to invent innovative ways of storing the product, which, in 20th century, resulted in the repurposing of former limestone mines into giant underground wine cellars. This nomination includes two underground wineries: Cricova, spanning over 120&nbsp;km in length, and Mileștii Mici (pictured), extending over 200&nbsp;km (of which 55&nbsp;km are in use).\n|-\n|}\nSee also\n*Tourism in Moldova\nReferences\nExternal links"
    }
  ]
}