{
  "content": [
    {
      "type": "text",
      "text": "# List of USM Alger presidents\n\nclub president from, 1972 to 1975 was one of the leaders of Algeria's National Liberation Front during his country's war of independence.]]\nUSM Alger is a football club based in Algiers, Algeria that competes in Ligue 1, the most senior football league in Algeria. Since its founding in 1937, the club has had 19 different presidents, And the first president of the club is Arezki Meddad. As for the longest period as president was Saïd Allik for 16 years during which he achieved 9 titles.\nHistory\nin L'Écho d'Alger.]]\nSince its official founding in 1937, USM Alger was led by a succession of presidents and executive members who oversaw the club through its formative years under French colonial rule and during the challenging period of the Second World War. The first executive committee was established shortly after the club’s legal recognition, based on testimonies from early members and the official document submitted to the Governor of the Algiers Department. This founding committee was composed as follows: President: Ali Zaid, Vice Presidents: Bennacceur Lakhdar, Fernane Taieb, General Secretary: Halit Ali, Assistant General Secretary: Ahmed Kemmat, Treasurer: Arezki Meddad. This initial leadership laid the organizational groundwork for the club and managed its early activities during a period of growing political and social tensions in Algeria.\nThe first president of USM Alger, Ali Zaid, officially assumed his role on 5 July 1937 and remained in office until October 1938. He was succeeded by Arezki Meddad, who took over the presidency in October 1938. Meddad presided over the club during the difficult early years of the Second World War and remained in office until his death while still serving as president in April 1942. The season was further overshadowed by a tragic event: on April 2, 1942, Arezki Meddad, the club’s president, died after contracting typhus, a disease that was spreading widely in the country at the time. His death was a great loss for the club, as he had been USMA’s first honorary president, the first treasurer of the inaugural board, and a key member of the executive council. His funeral was held the following day, attended by many members of the community who came to pay their final respects. Following Meddad’s passing, Abderrahmane Boulendjas was elected on 15 October 1942. His term lasted for one year, ending on 17 October 1943, and he was succeeded by Mohamed Aïchoun, who served from 17 October 1943 until 30 October 1946. Aïchoun led the club during the immediate post war years, a time of renewed activity and reorganization.\nSaïd Allik era\nIn 1994 Saïd Allik became Chairman of the Board of Directors of USM Alger and promised to return the team to Division 1, On May 26, 1995 USM Alger won against MC Ouargla and achieved a promotion challenge back to the Division 1 after five full seasons, Allik announce that USM Alger has returned to its normal place and will not fall again to the second division, In the first season in Division 1 Allik won the first title in 33 years and the second in USM Alger history. in the following season, Alik signed a contract with the JS Kabylie duo, Tarek Hadj Adlane the former player of Al Ittihad and Mahieddine Meftah the African Cup of Nations champion with Algeria national team and because of it a great enmity began between Allik and Mohand Chérif Hannachi. From 2005 to 2010, the worst of Saïd Allik's period, where USM Alger's level declined and did not achieve any title and contented itself with playing the cup final twice against traditional rivals MC Alger and was defeated in both of them, their first final defeat since 1980. It is said that the biggest reason for this decline is the support of Saïd Allik for Ali Benflis in the presidential election against President Abdelaziz Bouteflika at the time. On October 27, 2010, Haddad replaced Saïd Allik as president and owner of the club. Allik had been the club's president for the past 16 years.\nETRHB Haddad era\nn businessman Ali Haddad owner and president of club USM Alger from 2010 until 2019.]]\n}}\nOn August 4, 2010, USM Alger went public in conjunction with the professionalization of the domestic league. Algerian businessman Ali Haddad became the majority share owner after investing 700 million Algeria dinars to buy an 83% ownership in the club to become the first professional club in Algeria. On October 27, 2010, Haddad replaced Saïd Allik as president of the club. Allik had been the club's president for the past 18 years, On 28 February 2018 Ali Haddad he changed his brother Rabouh from a post general manager by former international player and former ES Setif president Abdelhakim Serrar. After the outbreak of protests in Algeria and the arrest of club owner Ali Haddad on corruption charges. On April 30, 2019 The board of the SSPA USMA met and noted the vacancy of the post of president of the company since the incarceration of Ali Haddad there is nearly a month. It was Boualem Chendri who was unanimously elected to succeed him while ETRHB Haddad remains the majority shareholder of the club.\nGroupe SERPORT era\nOn June 2, 2019 it is official, the Haddad family is selling its shares in SSPA USMA which it holds 92%, It was the club's communication officer, Amine Tirmane, who announced it on the Echourouk TV. the reasons that made them make this decision is the imprisonment of club owner Ali Haddad and also freeze all financial accounts of the club. After it was expected that the general assembly of shareholders will be on March 12, 2020 it was submitted to March 2, especially after the imprisonment of the former club president, Rabouh Haddad. The meeting witnessed the attendance of ETRHB Haddad representative and the absence of the amateur club president Saïd Allik, and after two and a half hours, it was announced that Groupe SERPORT had bought the shares of ETRHB Haddad which amounted to 94.34%.\nOn July 31, 2020 general manager Abdelghani Haddi spoke about some newspapers and responded to them and the fake news about the value of buying USM Alger's shares, where he said that the amount was 2 billion dinars about 13 million euros., for information SERPORT is a holding company which manages the State's holdings in Algerian port services. It generates a turnover of nearly 500 million euros per year, for a net profit which oscillates between 25 and 40 million euros. On September 10, 2021, Saadi Yacef died at the age of 93, who was one of the leaders of Algeria's National Liberation Front during his country's war of independence, president of the club in the 1970s and honorary president. Asked on National Radio about a possible withdrawal from Groupe SERPORT, Achour Djelloul assured that the public company had no intention of separating from USM Alger. On May 12, 2022 Djelloul was dismissed from his post after the scandal of the exit of containers of Hyundai cars imported by the Tahkout company in 2019, and was replaced by the former CEO of  l’entreprise portuaire d’annaba (EPAN) Abdelkarim Harkati temporarily.\nOn January 2, 2024, after consultation between its various members, USM Alger announced that it had terminated the functions of the club's sports manager Taoufik Korichi with immediate effect without specifying the reasons for this decision. However two days later the majority shareholder of SSPA/USMA Groupe SERPORT has made changes at the head of the club’s management, and during the meeting of the board of directors held it was decided to appoint Hacen Hassina new president of the board in place of Sid Ahmed Arab. Furthermore Abdelmadjid Rezkane is the new CEO of SSPA/USMA, while Farid Sefar advisor to the former President of the CA was dismissed from his position. Immediately after that Korichi returned to his position as sports director by decision of Harkati.\nOn May 27, 2024, USM Alger management decided to conduct high-quality summer recruitment after being eliminated in the Semi-finals of the Algerian Cup and failing to achieve its goal of retaining the CAF Confederation Cup.\nAt the management level, the advisor to the Chairman of the Board of Directors, Réda Abdouch, submitted his resignation, justifying his decision by “personal and health reasons”, indicated the club. Previously USM Alger announced the appointment of Sid Ali Yahiaoui as new general secretary. This is a homecoming for Yahiaoui, who had already held this position in the past with the club in 2021. On June 22, 2024, The Board of Directors of USMA-SSPA met at the headquarters of the Groupe SERPORT, where it was decided to appoint Athmane Sehbane, Chairman of the Board of Directors of USM Alger, to succeed Kamel Hassena who resigned from his position.\nNew Era Begins as Saïd Allik Returns to Take Charge\nOn April 30, 2025, the Algerian Minister of Transport Saïd Sayoud, dismissed Mohamed-Karim Eddine Harkati from his position as CEO of Groupe SERPORT, the official majority shareholder of USM Alger, and appointed Abdelkrim Rezzal as his interim replacement. For the first time since his return, Saïd Allik spoke publicly about the current situation at USMA, the experienced leader acknowledged the scale of the task while remaining optimistic: \"It's not easy to take over a club with only five matches left in the season, especially with all the problems there are. But things can change. We need to be patient. I hope that within two years, USMA will come back strong.\"\nAs part of the implementation of instructions issued by Saïd Sayoud, Minister of Transport, regarding the management and restructuring of USM Alger, a club affiliated with Groupe SERPORT, the club officially signed a work contract on July 17, 2025, with Saïd Allik, appointing him as Sporting General Manager. This appointment falls within a new strategic approach aimed at reviving the club on solid professional foundations, by strengthening its structure with experienced and competent profiles capable of making a tangible impact on the club’s sporting management. Allik has been granted full authority over the recruitment file, reflecting the club’s strong confidence in his extensive experience and in-depth knowledge of the team’s inner workings. This move is expected to contribute to reorganizing the sporting sector, ensuring rational and efficient management in line with the club’s short and long term objectives.\nList of presidents\n{| class=\"wikitable\" style=\"text-align: left\"\n|-\n! style=\"color:#22228B; background:#FFFFFF;\"|Name\n! style=\"color:#22228B; background:#FFFFFF;\"|From\n! style=\"color:#22228B; background:#FFFFFF;\"|To\n!scope=col class=\"unsortable\"|Honours (total number)\n|-\n| Ali Zaid\n|align=left|5 July 1937\n|align=left|October 1938\n|\n|-\n| Arezki Meddad\n|align=left|October 1938\n|align=left|2 April 1942\n|\n|-\n| Abderrahmene Boulandjas\n|align=left|15 October 1942\n|align=left|17 October 1943\n|\n|-\n| Mohamed Aïchoun\n|align=left|17 October 1943\n|align=left|30 October 1946\n|\n|-\n| Mohamed Zenagui\n|align=left|30 October 1946\n|align=left|September 1948\n|\n|-\n| Mohamed Bensiam\n|align=left|September 1948\n|align=left|1950\n|\n|-\n| Mohamed Zenagui\n|align=left|1950\n|align=left|10 June 1953\n|\n|-\n| Ali Chérifi\n|align=left|10 June 1953\n|align=left|11 March 1956\n|\n|-\n| Saïd Meddad\n|align=left|1962\n|align=left|1963\n|1 Ligue 1 (1)\n|-\n| Abdelkader Amrani\n|align=left|1963\n|align=left|1971\n|\n|-\n| Ali Kezal\n|align=left|1971\n|align=left|1972\n|\n|-\n| Saadi Yacef\n|align=left|1972\n|align=left|1975\n|\n|-\n| Abdelaziz Tazairt\n|align=left|1975\n|align=left|1976\n|\n|-\n| Rachid Khelouati\n|align=left|1976\n|align=left|1977\n|\n|-\n| Saïd Hammo\n|align=left|1977\n|align=left|19??\n|1 Algerian Cup (1)\n|-\n| Hadji\n|align=left|19??\n|align=left|1984\n|\n|-\n| Abdesslem Bensahli\n|align=left|1985\n|align=left|1989\n|1 Algerian Cup (1)\n|-\n| Saïd Hammo\n|align=left|1989\n|align=left|1991\n|\n|-\n| Rachid Khelouati\n|align=left|1992\n|align=left|1993\n|\n|-\n| Mouldi Aïssaoui\n|align=left|1993\n|align=left|1994\n|\n|-\n| Saïd Allik\n|align=left|1994\n|align=left|4 August 2010\n|4 Ligue 1, 5 Algerian Cup (9)\n|-\n| Ali Haddad\n|align=left|4 August 2010\n|align=left|30 April 2019\n|3 Ligue 1, 1 Algerian Cup, 2 Super Cup, 1 UAFA Cup (7)\n|-\n| Boualem Chendri\n|align=left|30 April 2019\n|align=left|2 March 2020\n|\n|-\n| Achour Djelloul\n|align=left|2 March 2020\n|align=left|13 May 2022\n|\n|-\n| Abdelkarim Harkati\n|align=left|13 May 2022\n|align=left|30 April 2025\n|1 Confederation Cup, 1 CAF Super Cup (2)\n|-\n| Abdelkrim Rezzal\n|align=left|30 April 2025\n|align=left|present\n|\n|}\nReferences\nWorks cited\n*"
    }
  ]
}