{
  "content": [
    {
      "type": "text",
      "text": "# List of Mega Monster Battle characters\n\nis a multimedia project of Tsuburaya Productions' long-running Ultra Series. The story's main setting took place in the mainstream Showa Universe (Ultraman to Ultraman Mebius) where monsters on Earth went extinct after 500 years had passed. Humanity at that time began to colonize the outer space area and an event called  took place, where Alien Reiblood summoned Bullton and caused monsters and aliens from the Ultra Series multiverse to appear randomly.\nThe Mega Monster Battle multimedia work includes:\n*Mega Monster Battle: Ultra Monsters (2007 - 2011) - A Data Cardass arcade game launched on April 27, 2007. It was succeeded by Ultra Monsters Neo and finally Mega Monster Battle RR before ceasing operation in 2011.\n**Mega Monster Battle: Ultra Adventure (2008 - 2010) - A manga adaptation of the arcade game. The story took place 50 years after Ultra Galaxy Mega Monster Battle.\n**Mega Monster Battle: Ultra Adventure Neo (2010 - N/a) - Sequel of the manga series, also adapted from Ultra Monsters.\n*Mega Monster Battle: Ultra Coliseum - A Wii software game, taking place 25 years after Ultra Galaxy Mega Monster Battle.\n*Ultra Galaxy Mega Monster Battle (2007-2008) - The 24th entry of Ultra Series, the series took place 50 years prior to Ultra Monsters and Ultra Adventure.\n*Ultra Galaxy Mega Monster Battle: Never Ending Odyssey (2008-2009) - The 25th entry of Ultra Series, sequel of Ultra Galaxy Mega Monster Battle.\n*Mega Monster Battle: Ultra Galaxy (2009) - Movie adaptation of Ultra Galaxy Mega Monster Battle.\n*Ultra Galaxy Legend Side Story: Ultraman Zero vs. Darklops Zero (2010) - Side story adaptation of Mega Monster Battle: Ultra Galaxy.\n*Ultraman Zero: The Revenge of Belial (2010) - Sequel of Mega Monster Battle: Ultra Galaxy.\n*Ultraman Zero Side Story: Killer the Beatstar (2011) - Spin-off of The Revenge of Belial.\n*Ultraman Saga (2012)\n*Ultra Zero Fight (2012-2013) - Spin-off of Ultraman Saga.\nProtagonists\nRei\nis a human Reionics, ZAP SPACY's latest member and the main protagonist of Ultra Galaxy Mega Monster Battle and its succeeding series, Ultra Galaxy Mega Monster Battle: Never Ending Odyssey. He was once a baby that appeared during Bullton's attack on Planet Boris. During the series, he first appeared after being trapped inside the carcass of a Peguila and in amnesiac state, appearing to be hostile towards ZAP SPACY members despite saving their ship, Space Pendragon, twice while only cares about recovering his forgotten background. In the end, after being persuaded by Hyuga, Rei decided to join ZAP SPACY. During his membership within the ZAP SPACY crew, he was haunted by the image of the giant buried in the rock and challenged by a mysterious woman named Kate. At the end of the series, after defeating Kate, he discovered the woman as his older sister and the buried giant is Ultraman, whom asked his help to free him. Rei as well had awakened his true potential as a Reionics, becoming a figure known as . During the second season, Rei participated into the Reionics Battle to determine the successor of Alien Reiblood to conquer the galaxy. Among them was Grande, an Alien Keel whom claimed to be his rival. Unlike the others, Rei on the other hand competed in the battle only to face Alien Reiblood, not wanting to inherit the latter's role as the ruler of the galaxy. In the middle of the series, he also encounter another giant, Ultraseven, which he rescued from Armored Darkness. After facing Alien Reiblood, he was finally brought to Earth for the first time. Sometime later in the movie, having recently finished Zaragas, Rei was spirited by Mebius, as he was predicted to be the chosen one capable of defeating Ultraman Belial. However, during the remaining Ultras' battle against Belial's army, he was corrupted by Belial into joining his legion until ZAP SPACY members awakened him from his senses. Followed by the arrival of Zero and the Leo Brothers, Rei was able to hijack Belial's Giga Battlenizer to ease the Ultra's battle, allowing Zero to finish him.\nAs a Reionics, Rei's initial monsters in his Battlenizer was Gomora, before he adopted Litra and Eleking during the series' progress. With other Reionics, Rei is subjected to the life-link rule with his monsters, thus would lose his life as well when one of them died in said battle, unless either Rei or his monsters sever their connections to save each other's lives. After Eleking's death by Grande's Tyrant, this caused Rei to succumb to his injuries until Kate upgraded his Battlenizer, allowing him to be on par with Grande's Tyrant. He was temporarily received Miclas by Ultraseven as a gratitude for saving him from the Armored Darkness until his final battle with Alien Reiblood. As Reimon, he is a mysterious alien who looks highly similar to Ultraman. He is the result of a fusion between an Alien Reiblood, and a human, Rei. When placed under extreme stress, he unleashes a , which also affects his Gomora. When in burst mode, his blue markings change to a crimson colour, black markings cross his body, and his eyes turn bright red. In this state, he becomes so powerful that he often loses his ability to tell his friends and enemies apart, but can be calmed back to his normal form with some effort. Reimon's attacks are the  ray and a reviving ray, used to free and revive Ultraman. In the console game Ultra Coliseum, Reimon is capable of summoning a spectral version of himself to fight giant opponents. His finisher in the aforementioned game is , summoning EX Gomora to perform EX Super Oscillation Wave.\nRei's personal monsters are:\n*: Rei's primary monster, Gomora is specialized in melee combat, such as the use of flying kick and its tail, . Its finisher attack is , originally a technique used by its brethren to burrow underground but can be used as a ranged beam attack. Another variation can also be performed, called  where Gomora impales the target with its horn and fires the Oscillation Wave at point blank before throwing them aside. Gomora can also evolve through Rei's command in certain situations, but although facing against opponents that possess the combat knowledge of Gomora's evolved forms, said monster itself is still able to defeat them with some effort, either through both his and Rei's continuous combat experience or external forces.\n**: Through Rei's command, Gomora can transform into EX Gomora, an evolved variation of itself. EX Gomora utilizes  and a stronger attack called .\n**: When Reimon undergoes a Burst Mode transformation, Gomora would also be affected by this, turning red. This Gomora retains its original attacks but utilizes a more cruel and brutish fighting skills.\n*: Rei's secondary monster, Litra (S) was a native to the Planet Boris and had saved the ZAP SPACY crew from Juran by using the  at the cost of her own life. Rei at that time manages to save her by absorbing her into his Battlenizer and healed her. During the battle, Litra (S) is capable of launching fireballs and utilizes  mode to initiate flame-based attacks.\n*: Rei's latest monster, which he acquired after Gomora defeated it in a battle that nearly puts the fate of Planet Boris at stake. Eleking is capable of using electric-based attacks and fights underwater. When needed, Eleking can also turn into a miniature version of itself, called , which was once used to fix the Pendragon's generator. Eleking in the end was killed by Grande's Tyrant, but although the rules of Reionics Battle stated that Rei were supposed to die as well, Eleking managed to sever their connection, saving Rei at the expense of its own life. This act allows Rei to progress further into the Reionics Battle and avenge Eleking's death by having Gomora killing Tyrant.\n*Capsule Monster Miclas: See here.\nRei was portrayed by .\nIo Mikura\nis the main protagonist of the Mega Monster Battle: Ultra Adventure manga and the Mega Monster Battle: Ultra Monsters arcade game. A young boy who was originally a student of the ZAP SPACY with affinity for monsters, Io's favorite food is chocolate and his shirt has Nexus' Energy Core symbol. He was somehow brought into the past where Planet Boris was still in a good condition and immediately became a Reionics due to picking up a Battlenizer. He has his mother's ATM card, through which he performs an unlikely friendship with Kanegon. His true identity in the story was revealed to be the grandson of Karen Mikura.\nIn Ultra Monsters, Io's Battlenizer monster is optional to the player's choice, based on their own preference of cards. In Ultra Adventure, Io's Battlenizer includes:\n*Ancient Monster Gomora: A monster that Io mainly utilize in the battle. Gomora is portrayed as a prideful monster that usually doesn't get along with Io, but would ascend to the battlefield when needed. In Gomora's battle on Earth, the monster accidentally destroyed the Osaka Castle. Alongside Vittorio's EX Gomora, both monsters can perform a combination attack called 超振動波（ゼロシュート）|Daburu Chō Shindō-ha (Zero Shūto)}}, used to destroy Reiblood's Deathfacer.\n*: A monster contained within Io's Battlenizer. It was originally a follower of Alien Reiblood, tricking Io to become a Reionics but defected at the last minute. Pigmon usually ended his sentence with the word \"Piiii\" and has the ability to detect monsters. In the game series Mega Monster Battle: Ultra Monsters, Pigmon is voiced by .\n*: Originally a monster belonged to an Alien Hipporit, Bemular was adopted by Io as his third Battlenizer monster. Bemular rarely sent into the battle, as its energy sphere form was used by Io as a form of transportation. Bemular sacrificed itself to shield Io's party from being killed by the Reiblood-possessed Deathfacer.\nAi Asama\nis the main protagonist of the Mega Monster Battle: Ultra Adventure Neo manga and the Mega Monster Battle: Ultra Monsters Neo arcade game, both succeeding Io Mikura. He was a boy who lives in an alternate universe, which was soon revealed to be the same era of Ultraman Tiga. In a similar case to Io, he was also transported into the past after an incident involving Kyrieloid and Kanegon but instead of becoming a Reionics, he proves to be a better controller in guiding Kanegon's Red King when the latter has trouble over it. He befriended Kanegon in the later story after he was chased by several aliens that try to hunt his Battlenizer. At the end of the manga, he was officially recognized as a Reionics by Io, Vittorio and Kanegon, thus gaining his own Neo Battlenizer.\nHis mother works as a medical officer in the GUTS Dive Hangar\nKanegon\nis the supporting protagonist of Ultra Monsters game and manga series. He meets Io and befriended the boy for his possession of an ATM card. He appears as a minor character in the original manga but in the Neo installation, Kanegon runs away from a group of aliens that try to claim his Battlenizer without a payment. He bumped into Ai, where the boy proves to be a better controller of his Battlenizer, something Kanegon gas trouble controlling with. As the story progresses, they discovered that Reiblood was inhabiting their Battlenizer and collected their combat data in order to restore his strength and recreate Kate's Zetton (EX Zetton).\nIn Ultra Monsters, Kanegon/Ai's Battlenizer monster is optional to the player's choice, based on their own preference of cards. In Ultra Adventure, their Battlenizer includes:\n*: Kanegon/Ai's main monster. This Red King also shows a comical side when Ai forced it to apologize to Ultraman Tiga after an accident. While Red King is stubborn towards Kanegon, it shows a complete cooperation when working for Ai. Most opponents tend to overlook Red King, ending up with several of them in humiliating defeat. Because of its partnering with Ai, Red King displays new attacks, such as  explosions and  drop kick. If fighting in full strength, Red King is strong enough to be on par with Vittorio's EX Gomora.\n**Through Ai's sheer will Red King can transform into , possessing the ability to release extreme heats and counter opponents with cryokinetic abilities.\n*Capsule Monster Agira: Seven's Capsule Monster, which was adopted by Ai in the middle of his journey. It was later returned to Seven, parting ways in good terms.\nKanegon is also a playable character in Ultra Monsters game aside from his role as a navigator. During the launch of a sixth wave trading cards, Kanegon's card allows him to eat the . In terms of combat stats, Kanegon has a faster speed and is considerably weaker in brute strength. Kanegon's main attacks are entrapping his opponents in its own cocoon (),  and .\nUltraman Zero\nShin Asuka/Ultraman Dyna\nis a former Super GUTS member who transforms into  in his titular series of the same name.\nEleven years after Ultraman Dyna ended, which took place in the setting of Mega Monster Battle: Ultra Galaxy, the wormhole that Asuka went in ended up transported to the Nebula M78 Space from the Showa era. Finding himself in the middle of conflict against Belial's forces, Asuka first rescued the ZAP SPACY crew before he went to the Monster Graveyard and helped fought against Belial and his armies. He soon assist Ultraman Zero by helping out distracting Beryudora while Zero delivered the finishing blow to Ultraman Belial.\nIn Ultraman Saga, his popularity as Ultraman Dyna was made public, so much that his exploits were chronicled in the textbook. TPC Mars base were celebrating his 15 years of his sacrifice and during that same time he was transported into another world where Alien Bat kidnapped the Earth's citizens to empower his Hyper Zetton as part of his invasion. Asuka/Dyna sided with Team U, humanity's final line of defense but sacrificed himself by petrifying both him and Dyna to halt Cocoon Hyper Zetton's development. His ejected Reflasher was picked by an orphan Takeru, who used it to revive Dyna to assist Ultraman Cosmos and Zero against Zetton. When Hyper Zetton evolved into Imago, Asuka combined his light with Musashi and Taiga to form Ultraman Saga, putting an end to Alien Bat and his Hyper Zetton, therefore returning the kidnapped humans back to Earth. As he departed, he made his last stop on his teammates and assured them that Taiga is safe before leaving again, knowing that his teammates would catch up to him in one of his travels.\nreprised his role as both Shin Asuka and Ultraman Dyna.\nRun\nNao\nis one of the main characters of Revenge of Belial. He is the younger brother to Run and learned of his status being possessed by Zero, all while his brother is being rendered comatose and healing from his injuries. During the events of the movie, he joined the team in search of the Shield of Baradhi, with his necklace (a keepsake from his late parents) being used as a detector. Soon, he participated in the battle against Belial's army and becomes Jean-Bot's motion pilot. He also played a crucial part in Zero's revival, where he encouraged the resistance of Belial's Galactic Empire to not give up and finally bring forth the true form of the Shield of Baradhi, Ultimate Aegis. Along with Run, he was left by Zero in Planet Esmeralda after the battle and is distraught after learning that Princess Emerana actually survived the battle and his brother lacked the recollection of what happened when Zero possessed him.\nNao was portrayed by , while his past self was portrayed by . He is named after Naoki Tachibana, the main protagonist of Jumborg Ace.\nPrincess Emerana\nis the female protagonist of Revenge of Belial. She is the princess of Planet Esmeralda but escaped the Planet after it was invaded by Belial's forces. She spared the lives of Run (Zero) and Nao when the two stow away in Jean-Bird before the ship itself could erase their memories. During the battle, to support Jean-Bot, Emerana used her own body as a power generator to the ship/robot and seemingly died, but in fact survived her fate. One year later in Killer the Beatstar (prologue to Ultraman Saga), both her and the Jean-Bird were kidnapped by Beatstar as the villain brainwashed Jean-Bot until he managed to regain his senses. After the event of the series, she renamed Jean-Killer, Jean-Bot's brother/clone as Jean-Nine and appointed him as the new member of Ultimate Force Zero.\nPrincess Emerana was portrayed by .\nNozomu Taiga\nMusashi Haruno/Ultraman Cosmos\nis a former Team EYES member who merged with   in the series of the same name.\nIn Mega Monster Battle: Ultra Galaxy, an alternate timeline version of Musashi is an active ZAP SPACY member who was contacted by Hyuga's crew in the Space Pendragon.\nYears after Ultraman Cosmos vs. Ultraman Justice: The Final Battle, Musashi married a fellow former Team EYES member Ayano and had a son named Sora. In addition to settling their lives in Planet Juran, Musashi achieved his lifelong dream to peacefully coexist with monsters. He sent a distress call to Zero, seeking his assistance in fighting against Alien Bat's reign of terror and destroy his creation, Zetton. Alongside Dyna and Zero, Cosmos participated in the formation of Ultraman Saga. After the battle, Musashi/Cosmos returned to Planet Juran and watches the sunset scenery with his family and Juran residents.\nreprised his role as Musashi, while  returned to provide Cosmos' grunts.\nUltraman Saga\nis the titular Ultra Warrior of the film of the same name, and is a , which resulted from the combination of Ultraman Zero, Dyna and Cosmos. He was formed when the three Ultra Warrior's hosts not wanting to give up their friend's homes and lives, their spirits bringing forth the creation of the , the key to Saga's formation. Statistics wise, Ultraman Saga is capable of fighting on the same level as Alien Bat's Imago Hyper Zetton. With the help of Team U's supervision, Hyper Zetton was finally crippled and sent upwards towards space before the Super Ultraman finished it off and return Alien Bat's Earthling hostages.\nAs with all Super Ultraman (Ultraman combinations), Ultraman Saga's power is heightened beyond a normal Ultra Warrior and displayed a greater range of ESP-based abilities. His main weapon is the Saga Brace, which was transformed from Zero's Ultimate Bracelet. He is capable of channeling a mysterious energy substance called  and manifest it through various attack such as ,  and . In order to keep up with Hyper Zetton's teleportation, Saga utilizes . His finisher attack is , an energy punch attack which capable of penetrating Hyper Zetton's face, to the point of simultaneously injuring Alien Bat, whom was controlling the monster from within. After the separation, Zero was granted two additional forms, Strong Corona Zero and Luna Miracle Zero as an effect of the aforementioned combination.\nUltraman Saga's grunts were provided by , whom also Ultraman Zero's voice actor.\nZAP SPACY\nThe Zata Astronomical Pioneers SPACY (ZAP SPACY) is an organization which mainly mines energy resources using a spacecraft and supports planet reclamation.\nPendragon Crew\nOne group, which stationed in the Space Pendragon was called towards the Planet Boris after communications were mysteriously cut off. Landing on that planet, a space time distortion forced the ship to crash-landed, suffering from severe damage and forced to wait for a month until reinforcements arrive. The crew later accepted Rei into the team, as they promised to help him recover his memories in exchange of his protection using his monsters. After discovering what happened to the planet, as well as realizing that Planet Boris is at the brink of destruction, the crew managed to escape with the help of Ultraman.\nHowever, in Ultra Galaxy Mega Monster Battle: Never Ending Odyssey, the Earth Headquarters commander ordered Rei's imprisonment after deeming him as a hostile alien. It wasn't until Dail, a Reionics Hunter infiltrate the base and tried to hunt Rei for his Reionics genes, allowing the man to escape with his teammates. But during that incident, Rei and Hyuga were separated from the rest of the crew and find themselves in Planet Hammer after a black hole absorbed their Gostar Dragon. Despite having reunited with their comrades, but the team later caught in a crossfire between Reionics battles and the Reionics Hunters. With Rei participating into the battle, the crew assisted him and finally killed the perpetrator behind the Reionics Battle, Alien Reiblood.\n*: Called  in the series, he is the captain of the Space Pendragon. He is hot-blooded man who is excellent in martial arts and has overcome many hardships all over the universe. He is wise and patient, thus these traits allow him to pursue Rei to join the ZAP SPACY. Despite being Space Pendragon's leader, he is shown to be humble and dislikes being called  by his teammates. Hyuga was portrayed by .\n*: Called  in the series, she is the subcaptain of the Space Pendragon. She is a strict ace pilot and is Hyuga's right-hand man. Although initially skeptical of Rei, she was rescued from Neronga by him and reconciled with him. In Never Ending Odyssey, she served as the main captain of Space Pendragon after Rei and Hyuga were separated from the crew while boarding the Gostar Dragon. Haruna was portrayed by .\n*: Called  in the series, he is the engineer of the Space Pendragon. He is an expert in mechanics, which also allowed him to identify King Joe Black, earning the title  by Hyuga. He sometimes clashed with Oki, due to the differences of their respective interests. Kumano also adored the Space Pendragon and was once shocked when Dail modified the ship to increase its firepower, much to the former's dismay. Kumano was portrayed by , whom previously known for Shinya Mizorogi/Dark Mephisto in Ultraman Nexus.\n*, called , he is a rookie crew member of the Space Pendragon. He is a monster maniac who was majoring in monsterology at university, and was recruited into the team for his wide knowledge of monsters. He reasoned that the giant in Rei's memory is Ultraman. Despite his rivalry with Kumano, but the two were actually good friends. Oki was portrayed by .\nResource Transport Base Officers\n*:.}} The leader of Vincent Island which was the officer of the resources transportation base in Belargo City, and Jun's elder brother. He has once served as the subcaptain of the Space Pendragon under Hyuga. Hiroki was portrayed by , whom previously portrayed Tetsuo Shijoh in Ultraman Tiga.\n*: The subleader of Vincent Island who was a scientist of Belargo city. Ato was portrayed by .\nShip\n*: The space transport ship of the ZAP SPACY. The lower part is equipped with the variable cargo. Originally, although it is not a spacecraft for a battle, it is armed with the , the , and the .\n**: It is Small fighter jet separated from the nose.\n**: It is small fighter jet separated from the top part.\n*: Red body of the same model as the Space Pendragon.\nEquipment\n*: It is a multifunction gun which the ZAP SPACY crew uses.\nTeam U\nis an attack team under the organization Earth Defense Force, abbreviated as EDF, and is the final line of defense for Earth in Ultraman Saga. In reality, the team was never registered under the EDF and was simply frauds which consists of female survivors of Alien Bat's invasion, taking up the disguise when the children mistook them for members of EDF after they were nearly driven into despair. After Ultraman Saga killed Alien Bat and Hyper Zetton and returning the kidnapped citizens, Team U decided to observe the Earth again, now with Taiga as their latest member. Members of Team U were portrayed by AKB48 singers.\n*: Age 22 years old, she is Team U's leader and a former motorcycle gang member before joining the team. She was portrayed by\n*: Age 22 years old, she is the only Team U member whom had affiliated to the EDF before Alien Bat's invasion. She served as Team U's strategist and likes children despite her cool outlook. She was portrayed by .\n*: Age 20 years old and nicknamed , she was formerly one of Anna's motorcycle team in the past. She was portrayed by .\n*: Age 19 years old and nicknamed , she is a member of Team U's maintenance crew. She was portrayed by .\n*: Age 18 years old and Team U's medical expert, she was a medical student before Alien Bat's invasion and aspires to become a nurse. In contrast to her older sister, Anna Ozaki, she is very cheerful and takes care of the children when the team was sent to deal with Alien Bat's monsters. She does not join them in battle, due to being acrophobic. She was portrayed by .\n*: Age 19 years old and a member of Team U's maintenance crew, she is always seen with her trademark glasses. Prior to Alien Bat's invasion, she was the daughter of a wealthy family that runs a nursery. When Alien Bat started his invasion, she felt into a deep pessimism and almost went insane until the formation of Team U. She was portrayed by .\n*: Age 18 years old and Team U's communication officer. She strongly believes that the children in refuge would someday regain their parents, which finally achieved following the victory of Ultraman Saga. Like Lisa, she prefers to stay behind than joining the battle due to being acrophobic. She was portrayed by .\nReionics\nare a race of aliens which were combined with Alien Reiblood's genes. Most Reionics participated in a battle royal called  to determine the successor of Alien Reiblood and to conquer the galaxy. The battle reach its end with Rei as the winner, however, he instead picked to defeat Alien Reiblood, not wanting to rule the galaxy with iron fist. Appearing Reionics in the series, with the exceptions of Rei, Kate and Grande had their names tagged with the word \"RB\", meaning .\nIn Ultra Monsters and Ultra Adventure game series, Reiblood re-engineers the Reionics Battle but instead of finding a successor, he tries to usurp the energies of the strongest Reionics.\nThe Reionics's main weapon are , which capable of taming and summon monsters through a system called , with the maximum number is three. Battlenizer monsters are usually stronger than regular versions and can be deploy into the battle when summoned. A Reionics may as well be able to summon all monsters at once, however the only drawback is that they would suffer the similar injury to their monsters in battle. Selected Battlenizers can be upgraded into  in lieu with their continuous experience in battle and growth of strength, with two known users are Rei and Grande.\nThe Battlenizers' announcements were provided by .\nKate\nis the antagonist of Mega Monster Battle. In Planet Boris, she appeared to have always interfering Rei and the ZAP SPACY by summoning her monsters. During the battle, she used multiple trickery such as imposing herself as bio-plant researcher  and framing Rei as the destroyer of Planet Boris' civilization. Originally appeared to be evil, in truth, her goal was to awaken Rei's true nature as Reimon and finally gets her wish in the last episode when Rei simultaneously awaken Gomora as EX Gomora to fight both Zetton and EX Red King. She is also revealed to be Rei's older sister.\nFollowing the death of her Zetton and the destruction of Planet Boris, she was thought to be dead in the final episode. However, in the succeeding series, Never Ending Odyssey, she in fact survived, upgrading Rei's Battlenizer into Neo Battlenizer and encouraged him into the battle again after Eleking's death severely affecting Rei.\nIn Ultra Adventure, her spirit appeared and told Ai that Reiblood's EX Zetton was created from her destroyed Zetton.\nA Reionics herself, Kate has three monsters in her Battlenizers. All of them were killed by Gomora, but despite the loss, Kate however had not been killed as well.\n*: Kate's first monster, she used this first to attack a group of eight Sadolas. The next day, she sent Fire Golza during her disguise as Maki Azusa in an attempt to attack Rei and ZAP SPACY crew. Fire Golza was defeated by Gomora and ZAP SPACY's combined attack, but his true death was caused by Gan-Q, Kate's second monster. First appeared in episode 18 of Ultraman Tiga.\n*: Kate's second monster, it defeated Fire Golza after the monster was deemed weak. Soon, she lured Rei into fighting Gan-Q by using Oki as a hostage. Rei/Gomora and the ZAP SPACY crew managed to destroy the monster, though Kate escaped again. First appeared in episode 6 of Ultraman Gaia.\n*: Kate's final monster, she used this in her final battle against Rei. Unlike previous monsters, Zetton was more powerful and managed to weaken Rei/Gomora, with the condition worsened by the arrival of King Joe Black. Eventually, Rei's awakening as Reimon and Gomora's evolution as EX Gomora finally turn the tide of the battle into their favor and managed to destroy Zetton in one swoop. First appeared in episode 39 of Ultraman.\n**EX Zetton: See Alien Reiblood.\nKate was portrayed by .\nGrande\nis Rei's main rival in Never Ending Odyssey. He is in possession of Neo Battlenizer, which makes him one of the strongest Reionics on Planet Hammer at the time of Rei's arrival. He has a very odd and funny personality, which hides the fact that he is one of the most dangerous and powerful Reionics, and he would have killed Rei in their first battle had not Eleking cut the link between them. In his first battle, he utilized Tyrant and almost killed Rei until Eleking took the blow instead. After Kate upgraded Rei's Battlenizer as well, he was able to strengthen Gomora and finally killed Tyrant, avenging Eleking's death. He soon acquired another monster, Red King, which he used to take down the Reionics Hunters' King Joe Blacks and tried to challenge Rei once more. Despite being defeated, but unlike Grande, Rei spared him and his Red King instead. In Rei's final battle against Alien Reiblood, Grande assisted him and the two activated their monsters' EX forms to defeat the spiritual ruler. Before leaving Planet Hammer, he insisted Rei to introduce his sister someday, having fixated to Kate.\nGrande's monsters are:\n*: Grande's initial Battlenizer monster. A powerful monster in the series and was once proven to be an adversary to the Ultra Brothers, which made it worse following his possession of the Neo Battlenizer. Tyrant was able to overpower Gomora and killed Eleking in their first battle. The next day, Rei's Battlenizer was upgraded as well to fight at the same level with Grande and finally killed his monster. Grande survives Tyrant's destruction after he managed to sever their link. First appeared in episode 40 of Ultraman Taro.\n*Skull Monster Red King (10, 12, 13 (NEO)): Grande's second monster. Red King itself is capable of fighting King Joe Blacks single-handed. It tried to fight Rei's Gomora but defeated and spared by Rei/Gomora. Red King soon assisted Rei in his final battle against Reiblood and utilizes an evolution in a similar manner to Gomora, . Red King first appeared in episode 8 of Ultraman while EX Red King first appeared in the 2005 video game, Ultraman Fighting Evolution Rebirth under the name .\nGrande was portrayed by  and is a tribute to Alien Keel from episode 21 of Ultra Q. Grande is the first of his own race to appear in flesh, as the original Alien Keel were only mentioned in Ultra Q. Grande's space ship is a tribute to Bostang, the sea monster that appeared in the same Ultra Q episode.\nVittorio\nAn Alien Keel,  is a young Reionics, whose age is comparably 2 to 3 years older than Io and is the antihero of Ultra Monsters arcade game, as well as Ultra Adventure manga series. In a similar manner to Grande, Vittorio self-proclaims himself to be the protagonists (Io and Ai)'s rival but assisted them in times of need. His main transportation is a ship themed after the monster Bostang and wears a combat suit. Once removing his helmet, he reveals to have a blonde hair. Although appeared to be aloof, he also shows a comical side when one compares him to Grande. Although initially an anti-hero, he shows a supportive side to both Io and Ai as the story progresses, to the point of assisting them in their final battle against Reiblood.\nHis monsters are:\n*EX Gomora: Vittorio's main monster.\n*: A Terrible-Monster utilized by Vittorio in the EX Round of Ultra Monsters. Verokron's attacks are  and .\nIn Ultra Monsters, Vittorio is voiced by .\nOther Reionics\nAll of these Reionics below appeared in Never Ending Odyssey, with only one appeared in the movie.\n*: An alien that was studying the ruins of Planet Boris, the alien planned to conquer the galaxy with her Battlenizer until she was killed by Dail. Alien Pitt was voiced by  and first appeared in episode 3 of Ultraseven.\n*: A random Reionics whom plotted to attack Rei and the Gostar Dragon with Dorako, Rei summoned Eleking and finished the monster easily. Hook was caught by Rei but managed to escape quickly. Later, he acquired another Dorako, Re-Dorako and attempted to fight Alien Zetton's Talesdon but was interrupted and killed by the Reionics Hunters. He was voiced by  and first appeared in episode 47 of Ultraseven.\n*: A Reionics that attacked Rei after he was trying to find Alien Hook, Guts summoned Gomess (S) but defeated by the combined efforts of Litra and Gomora. Soon, he returned with a new monster, Kelbim but once again defeated by Rei's Miclas. He was voiced by  and first appeared in episode 39 of Ultraseven.\n*: An alien whom challenged Alien Nackle with Arstron, he was quickly defeated by Nackle's Galberos. Alien Zelan was voiced by  and first appeared in episode 31 of Return of Ultraman.\n*: An alien who owned the Space Beast Galberos. With said monster, Alien Nackle is able to taunt his enemies until they worn out and used that opportunity to kill them. He challenged Rei into a battle and used Galberos to create endless copies of Zetton for Rei and Gomora to attack but once he used that opportunity to strike, Rei and Gomora entered their Burst Mode and killed Galberos, later Alien Nackle in cold-blooded. He was voiced by  and first appeared in episode 37 and 38 of Return of Ultraman.\n*: A Reionics whom owned the Terrible-Monsters Vakishim and Doragory. He first used Doragory to fight Rei's Gomora but overpowered by the Reionic Burst Gomora and forced to retreat. Soon, he plotted his revenge by attacking the Pendragon and utilized Vakishim in a rematch against the Reionic Burst Gomora but despite that, his Terrible-Monster was overpowered again and died after his monster defeated. Alien Metron was voiced by  and first appeared in episode 8 of Ultraseven.\n*: A Reionics with the ownership of Antlar, Babarue summoned Antlar to attack Rei/Gomora. After a long battle, Gomora entered its Reionic Burst State and manages to weaken Antlar before the monster was called by Babarue to retreat for safety. He was voiced by  and first appeared in episode 38 and 39 of Ultraman Leo.\n*: A Reionics that defeated in the battle against Alien Temperor, he comes across the Armored Darkness' sword, Darkness Broad and becomes . He used this to enact his revenge on Temperor and killed Dada before fighting Rei. Mefilas later awaken Armored Darkness but was killed FOR the sentient armor to retrieve its sword. In a battle against Reimon/Gomora and Miclas, Reiblood revived Armored Mefilas as his slave representative, now wielding the  in place of the Darkness Broad, which ended up in defeat. But this takes a good turn to free Mefilas from Reiblood's control. Feeling indebted, he freed the ZAP SPACY crews that was trapped in a temporal field by Alien Reiblood as a gratitude to the young warrior. He was voiced by  and first appeared in episode 33 of Ultraman.\n*: A Reionics with the ownership of Arigera, he defeated Mefilas and crushed the warrior's Battlenizer. Temperor was killed after Armored Mefilas exact his revenge by killing him and his monster. He was voiced by .\n*: A Reionics whom laughed at Alien Mefilas for his defeat by Alien Temperor, he was killed by the latter in mere seconds out of annoyance. He was voiced by  and first appeared in episode 28 of Ultraman.\n*: A Reionics who owned Talesdon, he battled Alien Hook/Dorako but was shortly killed alongside the latter by Reionics Hunters. According to the official website, he would have survive longer if he summoned Zetton instead of Talesdon. He was voiced by suit actor  and first appeared in episode 39 of Ultraman.\n*: The last Reionics to Rei, he is in possession of Birdon and was quickly defeated, forcing him to retreat. He was voiced by  and first appeared in episode 34 of Ultraman Mebius.\n*: A Reionics that serves the Belial Army, his main goal was to defeat the surviving Ultra Brothers in their human forms after the Land of Light was rendered powerless. He was in possession of Black King, which fought Rei and his Gomora but was killed by Hayata/Ultraman and Dan/Ultraseven after being overpowered multiple times. Alien Shaplay was voiced by  and first appeared in episode 20 of Ultraseven.\nUltramen\nUltra Brothers\nThe  is a team of six legendary Showa Ultramen that have protected the peace of planet Earth and space. They were among the participants during Belial's second raid on the Land of Light but only Utraman and Ultraseven survived when the Land of Light turned into a freezing wasteland while others ended up frozen. They would appear in most succeeding films, among them are investigating the source of Belial's new army and played a pivotal role in stopping Beatstar's plan. In Ultraman Saga, while they had a smaller role in the film, but in the director's cut version, it was revealed that they assisted Ultraman Saga in fighting against his revived monster army.\n*: The leader of the Ultra Brothers. He is an old friend of Father of Ultra and Mother of Ultra. Back in his younger days, he was among the Ultra Warriors that defended the Land of Light against Ultraman Belial and his 100 monster army. He was voiced by , reprising his role since Ultraman Mebius.\n*Shin Hayata/Ultraman: See Ultraman (character)\n*Dan Moroboshi/Ultraseven: See Ultraseven (character)\n**: See Ultraseven (character)#Miclas\n**: See Ultraseven (character)#Windom\n**: See Ultraseven (character)#Agira\n*Hideki Go/Ultraman Jack: See here\n*: The fifth member of Ultra Brothers and the adopted brother of Ultraman Taro.  reprises his role as Seiji Hokuto/Ultraman Ace.\n*Ultraman Taro: See here\n*: A student of Ultraseven and a survivor of Planet L77's destruction, both him and his brother Astra were tasked to train Zero during his banishment. Leo is responsible for training Zero with Judo martial arts. In certain occasions, when his student is in trouble, he would come to his aid.  reprises his role as both Gen Ohtori and Ultraman Leo.\n*: Leo's younger brother and a fellow survivor of Planet L77's destruction. Alongside Leo, he was tasked to train Zero during his banishment.\n*: A member of the Space Garrisons, he was among the Ultra Warriors that tried to guard the Plasma Spark from Ultraman Belial but failed miserably. He is voiced by  in Ultra Galaxy Legends but reprised by  in Revenge of Belial.\n*Mirai Hibino/Ultraman Mebius: See here\n*: He was among the resistance against Ultraman Belial but defeated and was frozen alongside the Land of Light before Ultraman Zero returned the Plasma Spark. In the end of Mega Monster Battle: Ultra Galaxy, after the Plasma Spark was recovered, Ultra Force was seen listening to Ultraman King's speech.  reprises his role as Ultraman Hikari.\nOther Showa Ultras\n*: The godlike figure of the Land of Light, he was responsible for sealing Ultraman Belial during his first raid on the Land of Light and sealing his Battlenizer. After witnessing Zero defending his friend Pigmon, King acknowledged his redemption and reveal Zero's true background as the son of Ultraseven. In Mega Monster Battle: Ultra Galaxy, Ultraman King was voiced by former Prime Minister .\n*: The father of Ultraman Taro, before his promotion to his current rank, in the past, he was known as  and a comrade to young Zoffy and Belial, fighting alongside them to defend the Land of Light. In Mega Monster Battle: Ultra Galaxy, Father of Ultra was voiced by .\n*: The mother of Ultraman Taro, she was known as in the past  and alongside his future husband, was a former friend to Belial before his betrayal. In Mega Monster Battle: Ultra Galaxy, Mother of Ultra was voiced by .\n*: Ultraman 80's childhood friend, she appeared as one of the Ultra Warriors that stood in the final line of defense against Belial's theft of Plasma Spark. She also participated in a battle against Belial Galactic Empire's army of Darklops.  reprises her role as Yullian from the series, Ultraman 80.\nOther Heisei Ultras\n*: He was among the resistance against Ultraman Belial but defeated and was frozen alongside the Land of Light before Ultraman Zero returned the Plasma Spark. In the end of Mega Monster Battle: Ultra Galaxy, after the Plasma Spark was recovered, Ultra Force was seen listening to Ultraman King's speech.\n*: He was among the resistance against Ultraman Belial but defeated and was frozen alongside the Land of Light before Ultraman Zero returned the Plasma Spark. In the end of Mega Monster Battle: Ultra Galaxy, after the Plasma Spark was recovered, Ultra Force was seen listening to Ultraman King's speech.\n*: He was among the resistance against Ultraman Belial but defeated and was frozen alongside the Land of Light before Ultraman Zero returned the Plasma Spark. In the end of Mega Monster Battle: Ultra Galaxy, after the Plasma Spark was recovered, Ultra Force was seen listening to Ultraman King's speech.\n*: He was among the resistance against Ultraman Belial but defeated and was frozen alongside the Land of Light before Ultraman Zero returned the Plasma Spark. In the end of Mega Monster Battle: Ultra Galaxy, after the Plasma Spark was recovered, Ultra Force was seen listening to Ultraman King's speech.\n*: See here\n*: He was among the resistance against Ultraman Belial but defeated and was frozen alongside the Land of Light before Ultraman Zero returned the Plasma Spark. In the end of Mega Monster Battle: Ultra Galaxy, after the Plasma Spark was recovered, Ultra Force was seen listening to Ultraman King's speech.\n*: He was among the resistance against Ultraman Belial but defeated and was frozen alongside the Land of Light before Ultraman Zero returned the Plasma Spark. In the end of Mega Monster Battle: Ultra Galaxy, after the Plasma Spark was recovered, Ultra Force was seen listening to Ultraman King's speech.\nAnime Ultras\n*: A group of Ultra Warriors and were among the resistance against Ultraman Belial but defeated and frozen alongside the Land of Light before Ultraman Zero returned the Plasma Spark. In the end of Mega Monster Battle: Ultra Galaxy, after the Plasma Spark was recovered, Ultra Force was seen listening to Ultraman King's speech. They first appeared in the anime movie Ultraman: The Adventure Begins, with the Mega Monster Battle: Ultra Galaxy being their first appearance in costume.\n**: The youngest member of the Ultra Force.\n**: The oldest and leading member of the Ultra Force.\n**: The only female member of the Ultra Force.\nUltimate Force Zero\n''. From left to right: Jean-Bot, Glenfire, Jean-Nine (back), Ultraman Zero and Mirror Knight.]]\nThe  is a team of giant heroes founded by Ultraman Zero in aftermath of the destruction of Belial Galactic Empire. The team's main goal is to maintain peace in the galaxy and eliminate remnants of Belial's army. One year later, after the team and Ultra Brothers had stopped Beatstar from destroying Planet Bram, Jean-Nine was recruited into the team by Emerana and Hyuga, Rei and his Battlenizer monsters were appointed as honorary members.\nIn Ultra Zero Fight 2, Planet Esmeralda (Princess Emerana's home world) was revealed to have sponsored the group by creating their own personal base of operations, . But when Ultraman Zero was possessed by Belial into Zero Darkness, all members were mercilessly slaughtered and the base was destroyed to make way for the Darkness Five's invasion, until Shining Zero expelled Belial from his body and reverse the time surrounding to undo the damage made by Belial, reviving the Ultimate Force Zero members and rebuilt the Mighty Base.\nMembers of the Ultimate Force Zero are mostly parodies from past tokusatsu series of Tsuburaya Productions, with their Mighty Base is not an exception, being based on the 1968 series, Mighty Jack. The team made their cameo appearances in episode one of ''Wooser's Hand-to-Mouth Life Phantasmagoric Arc'' as part of Ultra Series' collaboration with the anime. In said anime, the main character Wooser is also voiced by Mamoru Miyano, who performs a dual role with Ultraman Zero. Ironically while Hiroshi Kamiya did present to voice Darth Wooser (another character of the anime), he did not reprise his role as Jean-Bot.\n*: Formerly the bodyguard of The Pirates of Flames, Glenfire and his crew at first sees Emerana's convoy as hostiles until Zero defeated him in a match, gaining their trust. He was thought to be dead after he and his crew provide cover for Emerana's team when Darkgone's army attack but survived and joined the rebellion against Belial's Galactic Empire. Glenfire's main ability is to create flame-based attacks. Glenfire was voiced by  and is a tribute to the titular hero of 1973 series, Fireman.\n*: A half Esmeraldian and Two-Dimensional People, Mirror Knight was among the resistance against Belial's Galactic Empire until the dark Ultra infected him with Belial virus, causing him to fell into submission. Followed by his purification by Zero, he returned during the final battle alongside armies from Planet Mirror to assist the resistance. Mirror Knight's main ability is to create light and reflection-based attacks, as well as capable of travelling through reflective substances. Mirror Knight was voiced by , whose previously known for voicing Gridman from Gridman the Hyper Agent, another tokusatsu series of Tsuburaya Productions. Meanwhile, Mirror Knight is based on the titular hero of 1971–1972 series, Mirrorman.\n*: A tag team combo representing Jean-Bot and his \"younger brother\" Jean-Nine.\n**: A sentient robot that served the royal Esmeralda family for years, when not in combat state, Jean-Bot assumed the form of spaceship . He transport Emerana, Run (Zero) and Nao in a quest to find the legendary shield of Baradhi, and finally participated in the battle as Jean-Bot thanks to Nao becoming his motion pilot. In Killer the Beatstar, Jean-Bot was kidnapped and brainwashed by Beatstar as part of his Robot Monster Army while using Jean-Bot's data in the creation of Jean-Kiler. Before he could attack Eemerana, Rei and Hyuga, in his last moments, Jean-Bot deactivated himself, allowing Kumano to remove the virus that implanted by Beatstar. Soon, he persuaded Jean-Killer to join the Ultimate Force Zero, which ended up in success and was ordered by Emerana to become Jean-Killer (later Jean-Nine)'s \"brother\". Jean-Bot was voiced by  and is a tribute to the titular mecha of the 1973 series, Jumborg Ace.\n**: Introduced in Killer the Beatstar, he was originally , a robot created by Beatstar based on the schematics of Jean-Bot. Originally hostile towards the Ultimate Force Zero, persuasion by Emerana and Jean-Bot managed to change his mind and assisted the team against Beatstar's army. Hyuga of the ZAP SPACY briefly becomes Jean-Killer's motion pilot, allowing the robot to defeat Beatstar. Soon, Jean-Killer was renamed Jean-Nine by Emerana out of being the ninth member of Ultimate Force Zero. Alongside his \"brother\" Jean-Bot, the two can perform a combination rocket punch . Jean-Nine was voiced by  and is a tribute to JumKiller and JumKiller Jr., the antagonist of Jumborg Ace, later Jumborg 9, the secondary protagonist of that series. Like Hikaru Midorikawa (Mirror Knight's voice actor), Miyu Irino is no stranger to the Tsuburaya Production media, as he had once appeared in Ultraman Gaia: The Battle in Hyperspace as a child actor, portraying one of the main characters, Yu Hirama.\n*: Introduced in Ultra Zero Fight, this Pigmon was once died and revived by Alien Bat Gurashie by accident in the Monster Graveyard. Pigmon eventually befriended Ultraman Zero and watched his battle against Gurashie. When the villain was nearly weakened, he revealed that because Pigmon was revived by him, their life force are connected and thus, using this opportunity to defeat Zero until Pigmon reassured him. In the end, Luna Miracle Zero managed to save Pigmon's life while Strong Corona Zero simultaneously killed Gurashie. Pigmon was also responsible for giving Ultraman Zero the courage to escape from Belial's possession, allowing the latter to free and reverse the time zone to undo all the damages done by Belial. In the end, Pigmon was given the name Moroboshi (in tribute to Zero's father, Ultraseven, whom used the human disguise \"Dan Moroboshi\") and chosen as the Ultimate Force Zero's mascot.\nAntagonists\nBullton\nwas the main antagonist of the first half of Mega Monster Battle, predating Kate herself. Bullton was once a pair of meteorite fragments that studied by the scientists of Planet Boris. When the fragments combine, it took on its true form and summoned countless monsters from multiple dimensions, causing the mass destruction and deaths of many human colonists on the planet, turning it into a barren wasteland and the space time disturbances on the planet which leads to the ZAP SPACY's Pendragon to crash land, therefore setting the course of the series.\nSometime later, Bullton revealed itself to ZAP SPACY and summoned Frogos, Red King, Telesdon and Neronga to confront Rei's monsters and ZAP SPACY members. Using its quick guidance, Rei/Gomora manages to trick Telesdon into destroying Bullton instead.\nBullton itself first appeared in episode 17 of Ultraman. Originally with no sides in the series but as revealed in Ultra Galaxy Mega Monster Battle Complete Works magazine, Bullton's appearance in Planet Boris is due to Alien Reiblood's intervention as part of launching the Reionics Battle.\nAlien Reiblood\nwas the main antagonist of Never Ending Odyssey. He was said to be an alien that had ruled the galaxy for ten of thousand years. Determining to find a successor to his tyrannic rule, Reiblood spreads his genes across the galaxy and turn several aliens into Reionics, creating the known royal battle as Reionics Battle. He was first mentioned by Kate in Mega Monster Battle, as he indeed was the one whom imprisoned Ultraman in Planet Boris before Reimon freed him and was mentioned by Ultraman Mebius to be responsible for turning Ultraman Belial into Reionics in the past.\nNear the end of Never Ending Odyssey, when Rei is about to face him, Reiblood revived Armored Mefilas as his representative to fight Rei/Gomora in a final test. Despite Rei's victory, but he rejected the offer of Reiblood's tyranny and went against him. In order to combat Rei, Alien Reiblood possessed the Armored Darkness and ended up defeated with the help of Grande, Rei's rival.\nIn Ultra Monsters and Ultra Adventure, 50 years from his final battle with Rei, Reiblood restarted the Reionics Battle in hopes of collecting their powers and added them to his strength. For a moment, he was revealed to have destroyed Yapool's homeworld. He also engineered the awakening of Io as a Reionics by having Pigmon to perform the deed and took on the appearance of Reimon's Burst Mode as a momentary physical representation and in the final battle, he possess Deathfacer to fight Io and Vittorio until he was defeated by their combined strength. Soon, it was revealed that Reiblood inhabited Kanegon's Battlenizer and collected the data of Kanegon/Ai's Red King in hopes of restoring his strength. Once their deed was done, he unveiled himself and inhabited Kate's revived Zetton as a medium but was defeated once more by the young Reionics, with the help of Ultraman and Seven.\nAs himself, Reiblood possess the ability to spread his gene in outer space, creating beings called Reionics that shared his DNA. He also had several monsters at his disposal, such as:\n*: A sentient evil armor created by Alien Empera (see Ultraman Mebius) in the past, Armored Darkness fought Ultraseven and imprisoned him inside its body but moments before, the Ultra Warrior managed to release his Eye Slugger and frozen the sentient armor in place. Its weapon, the  was separated and picked by Mefilas, luring the alien to free him until he was killed. Armored Darkness engaged in a battle against ZAP SPACY and Rei's monsters until the young Reionics used Seven's Eye Slugger to awaken him, allowing the latter to destroy Armored Darkness from within. Soon, Reiblood revived Armored Darkness and possess the armor as a physical body in a final battle against Rei/Gomora and Grande/Red King. Reiblood/Armored Darkness was defeated after both monsters used their EX evolution forms. In Ultra Zero Fight 2, Ultraman Belial used Armored Darkness as a surrogate body before he possessed Ultraman Zero. Armored Darkness was voiced by Masaharu Satō, whom also Alien Reiblood's voice actor at that time and first appeared in the Ultraman Mebius Gaiden: Armored Darkness.\n*: Summoned by Reiblood as Reimon Burst Mode, it was used to fight against Io's Gomora and Vittorio's EX Gomora before being defeated by the latter's EX Super Oscillation Wave.\n*Space Dinosaur Zetton: In Ultra Monsters, a Zetton was used as a placeholder for Grand King in the original manga.\n*: Used by Reiblood to capture every available Reionics and absorb their strength. Before it can capture Vittorio, Io managed to save him and the jellyfish saucer was destroyed by his Gomora.\n*Pigmon: See Io Mikura\n*: Originally a man-made invasion weapon called , the spaceship was stored beneath Planet Boris and was utilized by Reiblood to capture the data of Io's Gomora. Once unveiling itself, Deathfacer proceed to attack Io's party until Bemular sacrificed itself. Deathfacer was used as a medium by Reiblood to fight against Gomora and EX Gomora but was defeated due to the lack of EX Gomora's data and scrapped by the Double Super Oscilatory Wave (Zero Shoot). In the Ultra Monsters arcade game, the scenario was altered where Vittorio shielded the party instead and falls into exhaustion, causing Io to use both his and the former's Battlenizer to perform Double Monsload. Deathfacer's main weapons are  from its right hand pincher ,  on its left hand and its strongest weapon,  unveiled from its chest.\n*: Created from Kate's Zetton DNA, Reiblood reveals himself from Kanegon's Battlenizer and brings out EX Zetton. In this form, Reiblood overpowers his oppositions, the Space Alliance Army and proceed to fight against the young Reionics. Both Reiblood and EX Zetton was defeated after Seven and Ultraman interfere the battle, where the former performs Ultra Physic to stall the monster first, giving Red King and Gomora a chance to counterattack. EX Zetton's main attacks is  fireball, evaporating even the strongest monsters in mere seconds while shielding itself via  energy barrier.\nAlien Reiblood was voiced by  in the original series and game installments. Meanwhile, in Ultra Galaxy The Movie, he was voiced by professional wrestler .\nSpace Alliance Army\nFrom Ultra Adventure Neo, the  were formed by several past Ultra Monsters, aliens and Terrible-Monsters that try to oppose Reiblood's revival and hunt any available Reionics. The army try to fight against Reiblood/EX Zetton but was defeated and had their soul ascended to the Monster Graveyard.\n*: One of the group's leaders alongside Yapool. Hipporit tried to face EX Zetton/Reiblood on a one-on-one duel, petrifying the monster in his  but was forced to retreat. He soon commanded the entire Space Alien Army in an all-out attack against the monsters but none of the participants survived the attack.\n*: A group of different dimension aliens whose homeworld was destroyed by Reiblood. In the original volume, Yapool collaborates with Alien Nackle to steal Io's Battlenizer in hopes of studying its functions, sending Ace Killer and a troop of  but the army was eliminated by a rampaging EX Tyrant. In Neo, Yapool assumed the form of , shifting his focus to Kanegon's Battlenizer before he retreated. Alongside Alien Hipporit, they commanded the Space Alliance Army in an all-out attack against Reiblood/EX Zetton but failed.\nReionics Hunters\nThe  are a troop of time travelling  and one of the antagonists of Never Ending Odyssey. Fifty years into the future, after the victor of the Reionics Battle was determined, Planet Pedan was among the planets that affected and destroyed. Wanting to prevent the dystopian future's existence, the troop travel into the past, where the Reionics Battle is still in motion and eliminated every beings with Reionics genes. Dail, an ace member of the Reionics Hunter, sparked an interest on Rei, a Reionics that choose to defy Alien Reiblood's orders and wishes for his commander's approval for Rei to join them but instead, things went horribly wrong when Harlan tried to use the Reionics for invasion, choosing not to prevent their dystopian future instead. Eventually, Dail defected to the ZAP SPACY and helped them in their final battle against the Reionics Hunters' army. In the end, with most King Joe Black army destroyed and their commander Harlan died, the troop returned to the future.\nBecause of Reiblood's destruction in the past prevented their homeworld's fall, the group cease to exist 50 years later in Ultra Monsters game and Ultra Adventure. In the aforementioned manga, the Alien Pedan led by Dorothy are portrayed as aliens with huge pride of scientific research, declaring war against Alien Nackle. They are also shown to be less hostile and in fact sought Io's cooperation due to the boy's possession of Battlenizer in exchange for his return to Earth, but eventually massacred by Nackle and Yapool's EX Tyrant.\n;Members\n*: Also called as , she was the leader of the Reionics Hunters. Her initial goal is to ensure the survival of the Alien Pedan in the future, however, when Rei wanted to join them and Dail seeking her approval, Harlan instead ordered the capture of all Reionics to be brainwashed as their invasion army. With Rei and ZAP SPACY refused her ordered, she launched a mass-produced army of King Joe Black on them and was finally killed when King Joe Scarlet toppled down on her. Harlan was portrayed by , whom previously portrayed Riko Saida in Ultraman Nexus.\n*: An ace member of Reionics Hunter and a character of Never Ending Odyssey. He was the greatest member of the Hunter and had eliminated many Reionics in his path. However, when targeting Rei, his teleportation bracelet was cut off and stranded with the ZAP SPACY, forcing to become their member until their arrival on Planet Hammer. During his time with the group, he contributed the Alien Pedan technology, the Pedanium Launcher (the same weapon used by King Joe Black) to their Pendragon, much to Kumano's dismay. He sparked an interest on Rei when the youth wanted to defy Alien Reiblood instead of winning the Reionics Battle and seek Harlan's approval to have Rei recruited to their side but shocked and betrayed when his leader instead planned to use the captured Reionics as her invasion army. In his final act, Dail managed to rescue the captured ZAP SPACY for them to assist Rei before dying. His funeral was made by the ZAP SPACY. Dail was portrayed by , whom previously portrayed Mitsuhiko Ishibori/Dark Zagi in Ultraman Nexus.\n;Other Alien Pedan\n*An unnamed Alien Pedan appeared in chapter 5 to 7 of Ultra Adventure, he was stranded in a mysterious planet several years prior after an enemy attack struck his ship. In order to return, he repairs a damaged King Joe. He soon met Io in the same planet where both started their friendship. Unfortunately, he sacrificed himself to attack Alien Hipporit with his own King Joe. Io would soon create a memorial grave for him.\n*: An Alien Pedan leader that Io Mikura and his team encountered in Ultra Adventure. She proposes Io's participation in the fight against Alien Nackle and Yapool in exchange for bringing him back to Earth. She was killed after the aliens' EX Tyrant destroyed her platoon of Alien Pedan forces.\n;King Joe\n*: A black customized version of King Joe (from episodes 13 and 14 of Ultraseven) with the  rifle, this robot is the Reionics Hunters' means of fighting Battlenizer monsters of a Reionics. A single rogue unit appeared in Mega Monster Battle, predating the Reionics Hunters' arrival in the next series and terrorized in Planet Boris, even to the point of attacking ZAP SPACY forces. This unit was finally killed by the newly awakened EX Gomora, but in the succeeding series, EX Gomora's combat data was captured by that King Joe and sent to the Reionics Hunters for them to develop stronger units. One was used by Dail in a test to see if Rei can achieve his trust, which the latter manages to success but unfortunately, the power-drunk Harlan sent a large fleet of King Joe Blacks in a final battle against ZAP SPACY forces. Every available fleets were destroyed and the remaining Reionics Hunters return to the future.\n*: A red customized King Joe for commander-type, this was Harlan's personal robot. It was shown among the King Joe Black army that fought against ZAP SPACY forces until all of them were defeated. The King Joe Scarlet toppled down and brought Harlan to her death.\nAlien Zarab\nis a non-Reionics Alien that steals Battlenizers for unknown reasons. His recent target was the ZAP SPACY and masquerade himself as Haruna to infiltrate the Space Pendragon and search for the Reionics in their team. He mistook Oki for a Reionics and comically as think of him as an elite monster/alien hunter. After getting his cover blown, he transformed into the  and engages in a fight against Rei/Gomora. Eventually, unable to keep up with Gomora's strength, Zarab flees in humiliation.\nHe reappeared again in Mega Monster Battle: Ultra Galaxy, having salvaged the Giga Battlenizer and released Ultraman Belial in hopes of gaining him as an ally to conquer the universe. However, Belial instead betrayed Zarab and killed him.\nAlien Zarab/Imit-Ultraman was voiced by , whom reprises his role since the first Ultra Series, Ultraman (1966) in episode 18.\nUltraman Belial\nis a fallen Ultra Warrior who serves as the main antagonist in several Mega Monster Battle-era instalments, namely Mega Monster Battle: Ultra Galaxy, Ultraman Zero: The Revenge of Belial and Ultra Zero Fight. Originally a member of the Inter-Galactic Defense Force and a friend of Father of Ultra (Ultraman Ken), the two were participants of Ultimate Wars but Belial was banished from the Land of Light after his jealousy towards Ken implored him to touch the Plasma Spark. He is converted into a Reionics by Alien Reiblood and is imprisoned by Ultraman King after his attempt at instigating a war against his former home world failed.\nYears later, he is freed by an Alien Zarab and successfully steals the Plasma Spark, allowing him to resurrect the fallen spirits in the Monster Graveyard as his thrall while the Land of Light gets reduced to a freezing wasteland.}} He fought the survivors of said planet (Ultraman, Ultraseven and Mebius), Ultraman Dyna, and briefly corrupted Rei to his side had it not for ZAP Spacy's intervention. The arrival of Ultraman Zero turns the tides of the battle to the resistants' favor and managed to defeat Belial even when he resorted to form Belyudra.\nBelial nevertheless survived the fight and establishes his rule in another dimension under the Belial Galactic Empire banner, adopting the moniker . His attempt at once again starting a war against his former people draw Zero's attention to him, resulting in a series of events where he is finally killed by the young Ultra. His spirit would later on ended up in the Monster Graveyard, possessing the Armored Darkness as a temporary body before he moves on to Zero, intending to monopolize the young Ultra's power until he was successfully expelled. Zero's attempt to undo the damages made by Belial and the Darkness Five unintentionally resurrected Belial as well. This allowed Belial to recuperate his strength until the events of Ultraman Geed, eventually meeting his end at the hands of that series' titular protagonist; his own son.\nIn his current form, Belial usually relies upon the use of brute strength and his  to subjugate monsters to fight for him. His main finisher is . As Kaiser Belial, he puts on the  and relies on his  as melee weapons and mind-control powers. His other forms include:\n*: Belial's pre-corruption form, whose appearance is simply that of a normal Ultra Warrior with a silver body and red linings. Ultra Galaxy Fight: The Absolute Conspiracy establishes that he also retains most of the abilities he has from his future corrupted form.\n*: A form Belial assumed in the movie Revenge of Belial, after absorbing all of the emeralds he stole from Planet Esmeralda to become a  reptilian monster. In this form, Arch Belial is able to drain the energy of his captured opponents and launched his strongest attack, the , which nearly killed Planet Esmeralda until the revived Ultraman Zero acquired Noa's Ultimate Aegis and used it to defeat Arch Belial.\n*: Appeared in Ultra Zero Fight 2, the vengeful spirit of Ultraman Belial possessed the Armored Darkness as his own.\n*: Shortly after Zero stabbed Kaiser Darkness, Belial's essence possess Zero and took his rival's body as his own. With Belial in control of Zero's body, he wields a pair of  and is capable of channeling twisted versions of his adversary's powers, such as ,  and , having used them to murder the entire Ultimate Force Zero. With victory in his grasp, he was about to lead the Darkness Five in a conquest to rule the galaxy until Zero expelled Belial with Shining Ultraman Zero.\nIn Mega Monster Battle: Ultra Galaxy and Revenge of Belial, Ultraman Belial is voiced by comedian  of the manzai duo Ameagari Kesshitai. Starting from Ultra Zero Fight 2 and onwards, he is voiced by . In the 2013 crossover game HEROES VS., Belial is voiced by ..}} In the drama CD Ultra Kaijoshi, Belial is voiced by , who is also the narrator of the story.\nBelial Army and Belyudra\nThe  are Ultraman Belial's 100 Battlenizer monsters held within his Giga Battle Nizer that appeared in Mega Monster Battle: Ultra Galaxy. This army first made their participation in Revolt of Belial during his early days attacking the Land of Light before he was imprisoned by Ultraman King. Following his escape, Belial reestablishes his army by reviving several monsters in the Monster Graveyard, only to be eliminated by the resistance forces, both Ultra Warriors and ZAP SPACY. In his desperate bid to gain advantage, Belial merges with the residents of Monster Graveyard into  while serving as its brain. While Belyudra appeared to be powerful, Belial loses control of the monsters composing it when Rei channels his Reionics powers through Giga Battlenizer to affect them. This resulted in Belyudra being defeated by the Ultramen and exploding after Zero dealt a mortal injury to Belial. Belyudra's finisher is , which creates a rain of fire.\nThe list below refers to the monster parts of Belyudra that are confirmed by the Mega Monster Battle: Ultra Galaxy Super Complete Works. Despite its title as a \"100 Figure Monster\", the total identified monsters below are 226 and as confirmed by the aforementioned magazine; the actual number is, in fact, unknown, since several of them also make up its internal parts.\nAmong the identified monsters below were also those who were only made in conception, but never appeared during the final cut (e.g.; Clapton). Some of the repeated names below marked the presence of different individuals that appeared in past series.\n;Head\n*Ultraman Belial\n*Bemstar\n;Right Horn\n*Alien Metron\n*Antlar\n*Giladorus\n*Detton\n*Zumbolar\n*Garamon\n*Kemular\n*Bemlar\n*Sadola\n*Gango\n*Gabora\n*Alien Pegassa\n*King Tortoise\n*Stegon\n;Left Horn\n*Red King\n*Alien Zarab\n*Alien Baltan I\n*Goldon\n*Zaragas\n*Keronia\n*Black King\n*Vakishim\n*Gudon\n*Gamas\n*Alien Nackle\n*Pandon\n*Eleking\n;Neck\n*Zetton\n*Alien Icarus\n*Litter\n*Gomess\n*Gamakugira\n*Sasahiller\n*Black Satan\n*Zanika\n*Gorgos\n*Ace Killer\n*Jamila\n*Magular\n*Todola\n*Astromons\n*Alien Temperor\n*Gavadon B\n*Alien Guts\n*Aron\n*Samkujira\n*Zonnel\n*Balloonga\n*Alien Valky\n*Signalion\n*Pegulia\n*Deathrem\n*Alien Godola\n*Banila\n;Body\n*Fire Golza\n*Birdon\n*Leogon\n*Keylla\n*Dada\n*Tarantula\n*Gan-Q\n*Gubila\n*Garan\n*Dangar\n*Targarl\n*Mongula\n*Unitang\n*Taishoh\n*Sabotender\n*Oxter\n*Anemos\n*Dorako\n*Deemos\n*Alien Borg\n*Woo\n*Alien Bira\n*Brocken\n*Pestar\n*Ron\n*Greensmons\n*Gameron\n*Alien Magma\n*Doragory\n*Gamos\n*Alien Babarue\n*Femigon\n*Alien Terrorist\n*Alien Zamu\n*Satan Mora\n*Shishigoran\n*Golgolem\n*Uringa\n*Goldras\n*Alien Waiell\n*Absorva\n*Neo Pandon\n*Eledortus\n*Rodera\n*Alien Grotes\n*Powered Aboras\n*Yametaranse\n*Zora\n*Gavadon A\n*Baktari\n*Gagi\n*Alien Black\n*Gatanothor\n*Gasgegon\n*Blizzard\n*Pagos\n*Magnia\n*Gera\n*Black End\n*Veron\n*Alien Antira\n*Alien Bud\n*Alien Chibull\n*Vango\n*Lavras\n*Red Giras\n*Sadola\n*The Giant}}\n*King Kappa\n*Vekira\n*King Bockle\n*Alien Katan\n*Onion\n*Black Giras\n*Degunja\n*Alien Vibe\n*Alien Mefilas II\n*Snowgon\n*Antares\n*Mizunoe Dragon\n;Right Arm\n*Dodogon\n*Garamon\n*Magnedon\n*Gakuma Beta\n*Chameleking\n*Alien Pitt\n*Alien Bell\n*Guyros\n*Alien Braco\n*Neronga\n*Takkong\n*Nova\n*Alien Varduck\n*Alien Hook\n*Litmars\n*Beakon\n*Namegon\n*Star Beam Gyeron\n*Growzum\n*Gorbagos\n*Guron\n*Guigass\n*Alien Tsuruk\n*Kaiteigagan\n*Margodon\n*Kemur\n*Jirahs\n*Nokogilin\n*Alien Baltan\n*Gamerot\n*Mukamender\n*Seabozu\n*Seagorath\n*Gymaira\n*Twin Tails\n*King Dinos\n*Aboras\n*Varricane\n*Alien Hipporito\n*Shugaron\n*Alien Prote\n*Kendoros\n*Aribunta\n*Gronken\n;Left Arm\n*Muruchi\n*Red Smogy\n*Alien Ayros\n*Gabura\n*Jirenma\n*Dancan\n*Plooma\n*Iceron\n*Live King\n*Alien Plachiku\n*Zazarn\n*Sartan\n*Peter\n*Obikoboushi\n*Bullton\n*Zamsher\n*Alien Pega\n*Goga\n*King Joe\n*Billgamo\n*Baraba\n*Gazort\n*Cosmo Liquid\n*Black Terrina\n*U-Tom\n*Soundgiller\n*Gander\n*Alien Quraso\n*Priz-Ma\n*Alien Kentauros\n*Skydon\n*Annon\n*Granadas\n*Kingsaurus III\n*Alien Akumania\n*Clapton\n*Gumonga\n*Talesdon\n*Rigger\n*Nurse\n*Alien Metron Jr.\n*Alien Reguran\n*Bemular\nAlien Salome\nare an alien race that serves as the antagonist of Ultra Galaxy Legend Side Story: Ultraman Zero vs. Darklops Zero. Debuting in episode 46 of Ultraseven, these aliens previously attempted in an invasion by using a mechanical knockoff of Ultraseven before the real giant thwarted their plan. Stationing on Planet Chain, they created countless mechanical copies of the Ultra Brothers in an attempt to invade the galaxy with the help of Darklops Zero, a prototype of Belial's Darklops army. Their first resistance appeared in the form of alternate reality versions of ZAP SPACY and the prime reality Ultraman Zero, before the prime reality Hyuga and Rei appeared to assist them. Having stole the alternate Reimon's Battlenizer, they used it in the creation of Mecha Gomora as an addition to their forces. However, Darklops Zero broke free from his restraints and destroy the entirety of the facility and his captors.\n*: Leader of the Alien Salome, she was the one whom responsible for setting up the invasion plan. When Darklops Zero rebelled towards his captives, Herodia was among the casualties and confessed to Hyuga that Darklops Zero was never her kin's creation but was by someone else. Herodia was portrayed by .\n* and : Herodia's bodyguards, both wielded pistols as weapons. They were portrayed by suit actors  and Hiroshi Suenaga respectively.\n:;Alien Salome's Invasion Robots\n*: Mass-produced armies which consists of mechanical copies of the Ultra Brothers, ranging from Zoffy to Ace which were used as the alien's invasion robots. These soldiers were destroyed when a rampaging Darklops Zero destroyed the entire factory in its rampaging spree.\n*: A twisted android doppelganger of Ultraman Zero, he was created by Ultraman Belial as the prototype of the Darklops model. Darklops Zero was installed with the  as a transportation method to other universes but in an experimental test run, he went malfunction and deactivated before Alien Salome salvaged the robot and repaired it. Soon, it was refitted with the  in an attempt to aid the Imit-Ultra Brothers' fight against the real Zero but during the battle, Darklops broke free from the armor's control and fight on his own before destroying Herodia's factory. Despite having Mecha Gomora aided him, but he was defeated by Ultraman Zero and Rei's Gomora. In a last ditch effort, Darklops turned himself into a time bomb to destroy the Planet before Zero and the ZAP SPACY escaped. He was voiced by Mamoru Miyano, whom also voiced Ultraman Zero.\n*: A mechanical knockoff of the Battlenizer Gomora built using the Battlenizer stolen from the alternate reality Reimon. The alternate Reimon mysteriously dubbed this robot as the same Gomora he raised, meaning that the original Gomora was remodeled. Mecha Gomora first launched to assist the Imit-Ultra Brothers and Darklops Zero. After Ultraman Zero severed its left horn, Mecha Gomora was called to retreat. Having fixed later on, Mecha Gomora went astray after Darklops Zero destroyed the Salome's factory and was reprogrammed by Darklops to serve him. Mecha Gomora was defeated by Gomora, controlled by both prime and alternate reality Rei.\nBelial Galactic Empire\nwas the antagonist faction that appeared in Revenge of Belial. An invasion army formed by Ultraman Belial, now named as Kaiser Belial, the group's main base of operation is the .\n:;Executives\n*: A servant of Kaiser Belial, he was first shown leading an army of Legionoids to attack the Pirates of the Flames for assisting Emerana's convoy. In the film's climax, Darkgone engaged in a fight against Jean-Bot/Nao and defeated by Jean-Bot's axe. Darkgone was voiced by Taiyo Kawashita, whom previously voiced Alien Shaplay in Mega Monster Battle: Ultra Galaxy. Meanwhile, he is based on Anti Go-Ne, one of Jumborg Ace's enemies in his titular series.\n*: A servant of Kaiser Belial, he was shown leading an army against the Mirror Planet and manages to captured Ultraman Zero in his human host, Run. At the film's climax, he was fighting against Mirror Knight and killed after the former pierced through his weak spot in-between his thick armor. Iaron was voiced by  and is a tribute to Iron, Mirrorman's first enemy in his titular series.\n:;Servants\n*: Mass-produced/cheaper versions of Darklops Zero created by the Belial Galactic Empire. Based on the experiment made on Darklops Zero prior, with Dimension Core proven to be unstable, Darklops were charged with emeralds stolen from Planet Esmeralda. Most of them are sent as invasion army to the Land of Light, with three had been incapacitated by Zero and Seven while several more batches of the army are defeated by the Land of Light residents.\n*: Transport vessel/robots used to transport an army of Darklops to the Land of Light, they are also capable of fighting in the battlefield, using only a single blast from its singular optic to decimate a Land of Light residents though were no match for highly trained-Ultras like Zero. Delusts were used as dimensional transports after the Dimension Core developed by Darklops Zero proved to be a failure. It was given the label  by the Space Garrison, a nod to the final enemy confronted by Fireman in his titular series' final episode.\n*: A series of all-terrain combat robots developed by the Belial Galactic Empire. Despite the empire's destruction, most of the army went rogue with the Ultra Warriors and Ultimate Force Zero, an organization founded by Ultraman Zero bent on eliminating them. The Legionoids were themed after Baranda V, one of the monster of the week in Jumborg Ace.\n**: A ground oriented Legionoid, armed with giant drills on each hands and threads underneath their feet.\n**: A space oriented Legionoid, armed with giant cannons on each arms and boosters underneath their feet.\n*: Sentient space combat fleets which served as transportation for Legionoids.\nBeatstar\nis the main antagonist of Killer the Beatstar. Created by an unnamed alien race when the fearful Alien Bat had destroyed an entire universe, Beatstar's purpose was to control the planet-sized lifeboat, the  to another universe but when his creators raged war with each others, he fully viewed organisms as evil creatures and resorted to build an army of robots in a plot to kill all lifeforms. His  consist of reprogrammed/captured robot armies from past Ultra Series' antagonist, with the recent one being Jean-Bot, whom was also used as the forerunner of his ultimate creation Jean-Killer. However, the Ultimate Force Zero and ZAP SPACY destroyed his army, while Ultraman Zero and his defected creation, Jean-Killer (renamed Jean-Nine) destroyed him before he could destroy Planet Bram with his own sphere.\nBeatstar was voiced by .\nRobot Monster Army\nThe  is Beatstar's army, composed of re-manufactured robots of several evil factions in the Ultra Series history. Their names are added with the \"BS\" (Beatstar) distinction, further adding their main affiliation. Further addition to their ranks were a brainwashed Jean-Bot and another robot built based on the former, Jean-Killer, though they were shortly redeemed afterwards. Several of them were destroyed by Ultimate Force Zero and ZAP SPACY, while most of them were entirely wiped out after the destruction of Beatstar Celestial Sphere.\n*: Created based on the copied data of Alien Pedan's King Joe, one unit made its appearance in the first half of the special and was sliced by Zero's Zero Slugger. Several battalion later showed up on the second half, guarding the Beatstar tower before they were faced by the combined alliance of ZAP SPACY and Ultimate Force Zero.\n*: Based on one of Yapool's creation, a single Ace Killer only appeared in the first half, facing against Glenfire before being defeated with a piledriver attack. Unlike other members of Robot Monster Army, Ace Killer was only made once, though it retained the ability to utilize the Ultra Brother's finisher beams.\n*: Created based on the copied data of Empera Army's Inpelaizer from Ultraman Mebius, a single unit made its appearance in the first half of the special and was scrapped by Mirror Knight. Several battalion later showed up on the second half, guarding the Beatstar tower before they were faced by the combined alliance of ZAP SPACY and Ultimate Force Zero.\n*: Created based on the copied data of Belial Galactic Empire's Legionoids, one unit made its appearance in the first half of the special and was scrapped by Rei's Gomora. Several battalion later showed up on the second half, attempting to destroy the Ultimate Force Zero and a recently reformed Jean-Killer before they were quickly destroyed by their own targets.\nAlien Bat\nis the main antagonist of Ultraman Saga. An alien that had destroyed and invaded countless galaxies, he formed his own army of monsters, using carcasses salvaged from the Monster Graveyard and revived them using Sphires he kidnapped from the Ultraman Tiga/Dyna universe. In an alternate Earth, he wiped the entire human populations and claimed the Earth as his own, with Team U and several children were unintentionally spared. He focuses himself on creating his ultimate monster, Zetton and even with this monster at its first stage, it was capable of decimating Ultraman Dyna (the first Ultra to face him via Arstron) within moments, rendering the Ultra petrified. With Cosmos and Zero arrived, Alien Bat unleashed both Gomess (S) and Gubila but when Cosmos pacify them instead, Alien Bat killed them cold-blooded. During the film's climax, when Hyper Zetton was eliminated, Alien Bat combined his spaceship with the monster's carcass, allowing it to be revived in its final stage. He was killed when the fusion Ultraman Saga destroyed Hyper Zetton, simultaneously releasing all humans that had been captured by the alien prior.\nAlien Bat was voiced by Japanese comedian/politician , known for his role in ''Takeshi's Castle. In the Televi-kun DVD Saga Special'', he was voiced by .\nHyper Zetton\nis Alien Bat's ultimate monster, created using the carcass of the original Zetton via genetic modification. Initially appeared in its larva-like stage, Gigant, this monster was entrapped in its cocoon stage, but was enough to defeat Ultraman Dyna and petrify the Ultra first. Having consume a lot of Sphires, Hyper Zetton emerges from its cocoon and fight the remaining Ultramen Zero and Cosmos, until the revived Dyna appeared and assisted them, killing Hyper Zetton. Not content on giving up, Alien Bat fused his spaceship with Hyper Zetton's carcass, reviving the monster in its final stage, Imago. With the monster proved to be a challenge for the Ultra, the three fused into Ultraman Saga, finally be able to fight Zetton in equal levels. Via Team U's help, Ultraman Saga managed to attack its wings, the source of Zetton's power before Saga sent the monster to space and delivered Saga Maximum punch on its face, simultaneously killed Alien Bat as well.\n*: Hyper Zetton's larva state, which appeared to be larger than an average Ultraman. Its attacks are  and the use of  sickles.\n*: Hyper Zetton's matured state that resulted after Alien Bat combined with Gigant Hyper Zetton's carcass. While retaining the Dark Fireball attack, it also gained additional moves such as , ,  and a set of wings on its back.\nAlien Bat Gurashie\nis the main antagonist of the first season of Ultra Zero Fight. An alien whom contemplated to destroy Ultraman Zero for killing his brethren, he revived four monsters to test Ultraman Zero's abilities before reviving another group of monsters called The Four Beast Warriors of Hell. But with Zero having killed all of them with ease, Alien Bat absorbed their soul and turned gigantic to fight against the Ultra. Seeing Pigmon, he took advantage of the situation by revealing that Pigmon is one of the monsters he revived and his death would also killed him. Despite using this opportunity to defeat Zero, but after being reassured by Pigmon, he split himself into two forms, using Strong Corona Zero to destroy Gurashie and Luna Miracle Zero to save Pigmon's life.\nAlien Bat \"Gurashie\" was voiced by .\nThe Four Beast Warriors of Hell\nwas a group of four revived monsters from the Monster Graveyard that Alien bat Gurashie used to attack Ultraman Zero. It was later revealed that these monsters were simply baits and their souls were absorbed by Gurashie as antibody to Zero's attacks before the latter transform into Luna Miracle Zero and expelled the spirits.\n*: The first monster to fight Zero, to further assist Red King, Gurashie modified it to enter its evolved state, EX Red King and imprison Zero in the Techtor Gear Hatred. EX Red King seemingly wins and before it was about to destroy the accidentally revived Pigmon, Zero barged in, freeing himself from the armor via Strong Corona Zero and sent EX Red King to the sky before eliminating it with Garnate Buster.\n*: A cerberus-themed monster with the mastery over illusions, Galberos hypnotized Zero into attacking mirages of his alternate forms, called  until Zero used his sixth sense to attack the real Galberos, killing it and cancelling the illusions that said monster had cast. First appeared in episode 6 of Ultraman Nexus.\n* and : A pair of monsters modified by Gurashie into , allowing one monster to absorb the opponent's attack while the other one reflect it back to their source. This however becomes their undoing, as Luna Miracle Zero used it to destroy both Bemstar and Gan-Q in one swoop. Gan-Q first appeared in episode 6 of Ultraman Gaia while Bemstar first appeared in episode 18 of Return of Ultraman.\nDarkness Five\nwere a group of five evil aliens assembled by Kaiser Darkness (Ultraman Belial) in annihilating Ultimate Force Zero and were the main antagonists of the second season of Ultra Zero Fight. The team first fought the Ultimate Force Zero members while Kaizer Darkness fought his nemesis, Zero. Despite being defeated, but the team rise to victorious when Kaiser Darkness possess Zero and slaughter the entire Ultimate Force Zero members. Before they were about to invade the galaxy, Ultraman Zero regained possession of his body, expelling Ultraman Belial and turning into Shining Zero before sending the Darkness Five into the past.\nThe team later appeared in episode 100 and 103 of Ultraman Retsuden as narrators, later reappeared in episode 49 of New Ultraman Retsuden, where Belial leads them to the invasion of the World of Plasma Galaxy (Mega Monster Rush: Ultra Frontier).\nThe Darkness Five were indeed members of past alien races that attempted to invade the Earth, and sported red eyes. Among its members are:\n*: An Armored Mefilas, Sly wielded the  and utilizes  energy ball attack. He was voiced by .\n*: An , Villainous had a personal monster of his own, Tyrant, and utilizes the  attack. He was voiced by .\n**Despot Monster Tyrant: Villainous's monster, it temporarily became Jatar's replacement in Darkness Five when the latter defeated by Strong Corona Zero. Alongside Villainous, both him and Tyrant can perform the combination called .\n*: An , he is capable of using blades protruded on his arms and can use ice breath. He was voiced by .\n*: An , his main attack involve around launching red flame projectiles. He speaks in his own kind's language, prompting Grocken to become his translator.\n*: An , he was the first member of the Darkness Five to act, petrifying members of the Ultimate Force Zero before attacking their leader, Zero when in disguise as Mother of Ultra. However, his plan was foiled quickly and jettisoned by Strong Corona Zero's Garnate Buster. He was thought to be killed but in fact survived, and in episode 104 of Ultraman Retsuden, he attempted to enact his revenge on Zero and Glenfire by turning them into bronze statues but defeated and jettisoned again after the two were able to anticipate his attack. He reunited with his comrades in episode 49 of New Ultraman Retsuden but was irritated that none of them seem to remember his name correctly after almost a year of disappearances. He was voiced by  and  when in disguise of Mother of Ultra.\n*: Appeared in episode 100 and 103 of Ultraman Retsuden, this monster is capable of hacking into communication networks, as it was used by the Darkness Five to invade and narrate the Ultraman Retsuden in place of Ultraman Zero. In episode 103, after Belial complaints on how weak the invading aliens in the past, an angry Sly attacked Belial, but he comically evaded it and hits Beacon instead, killing the monster. First appeared in episode 21 of Return of Ultraman.\nOther characters\nUltra Galaxy Mega Monster Battle\n*: A girl who is one of the survivors in Belargo City. She had taken care of a mysterious baby temporarily. She discovered the mysterious giant and heard the mysterious giant's voice. Karen was portrayed by .\nUltraman Zero: The Revenge of Belial\nEsmeralda Royal Family\nThe Esmeralda Royal Family are rulers of Planet Esmeralda for generations, with their clan protected by Jean-Bot. During Belial's raid, Princess Emerana, one of the members of the Esmeralda family member managed to escape with Jean-Bird. Although Planet Esmeralda had fallen to Belial's invasion and had its supplies of emeralds stolen, the planet's remaining residents took refuge under Mirror Knight's protective barrier until the resistance of Belial Galactic Empire gathered and defeated it.\n*: Planet Esmeralda's king and Emerana's father, he was portrayed by .\n*: Planet Esmeralda's queen and Emerana's mother, she was portrayed by\n*: One of Planet Esmeralda's princess and Emerana's older sister, she was portrayed by .\nPirates of the Flames\nThe  were a wily crew of hostile pirates that are based in an astronomical object with mass quantities of Space Nitromethane. The pirates sailed throughout the galaxy, boarding the spaceship  with their giant warrior bodyguard, Glenfire until he left the crew to join Ultimate Force Zero. At first they identify Emerana's convoy as hostiles until Zero defeated Glenfire in a sparring match, gaining their trust. The pirate crew eventually joined the battle against Belial Galactic Empire and as well among those contributed their hopes for the creation of Ultimate Aegis.\n*: The captain of the Pirates of the Flames, he was portrayed by , who previously portrayed Futoshi Chiba in Fireman.\n*: One of Garu's younger brother, he was portrayed by .\n*: One of Garu's younger brother, he was portrayed by .\nTwo-Dimensional People\nThe  are residents of Planet of Mirrors. After Ultraman Belial established his Galactic Empire, they refused to rebel, given by their pacifistic nature but after the planet was under attacked, Mirror Knight encourage them to join the battle, bringing forth space fighter jets. A Two-Dimensional People that met Emerana's convoy was voiced by , whose previously known for his role as Kyotaro Kagami, the main character of Mirrorman.\nPlanet Annu Residents\n*Grandma: Run and Nao's grandmother, whom becomes their caretaker after their parents' deaths. She was portrayed by .\n*: Run and Nao's late father, whom was mentioned in the past. He is the original owner of Nao's necklace, which is actually a fragment of the Shield of Baradhi. He was portrayed by .\n*: Run and Nao's late mother, whom only making appearances in the past. She was portrayed by .\nUltraman Saga\nTPC/Super GUTS members\nPlanet Juran\nIn conclusion of Ultraman Cosmos vs Ultraman Justice: The Final Battle, Musashi finally pursued his dream to befriend monsters by removing the monster's population on Earth to space. He married Ayano, his teammate in EYES (Elite Youth Expert Squad) and had a son named Sora.\n*: Originally Ultraman Cosmos' greatest adversary, he was purified when Musashi chose to purify the being instead of killing him. Chaos Header takes upon the appearance of a goddess and is one of the protectors of Planet Juran.\n*: Virgin name , she was once a teammate of Musashi and his instructor in EYES during the latter's first membership. While initially cold towards him for only being six months older than her, she eventually warms up to him and ended up married him on Planet Juran. She was portrayed by .\n*: Musashi's and Ayano's 10-year-old son, whom was born on Planet Juran. He was portrayed by .\nChildren refugees\nDuring Alien Bat's invasion on Earth, almost all of the population were wiped out. Aside from Team U, several children, whom were orphaned by Alien Bat's attack seek refuge in the attack team.\n*: Age 9 years old, he was one of the children that take refuge in Team U after Alien Bat's invasion. Takeru was known to be a cheerful young boy until Asuka/Ultraman Dyna's defeat by Hyper Zetton shaken him to the core and rendered him speechless. Due to this, he always sneaked out from Team U's base and wandered around the vacant city with his bicycle. He remembers the fact that before Asuka/Dyna's demise, the Ultra ejected its Reflasher, which Takeru picked and had Anna returned it to Dyna, allowing the Ultraman's revival to help defeating Zetton. He finally reunited with his mother following Alien Bat/Hyper Zeton's defeat. Takeru was portrayed by .\n*: A 6-year-old boy whom was one of the victims of Hyper Zetton's attack on Team U's base, his experience being rescued by Taiga reawakened the past trauma that Taiga felt after his parents were killed in the past. Takeru was portrayed by .\n*: A 6-year-old girl, whom always shown with her teddy bear. She was portrayed by .\nOthers\n*Takeru's mother: Mother of Takeru, she was among the Earth population to be kidnapped by Alien Bat before she was freed by Ultraman Saga, reuniting with her son. She was portrayed by Shion Nakamaru, whom previously played Alien Pedan Harlan in Never Ending Odyssey.\nUltra Zero Fight\n*: Residents of Planet Fanegon, they appeared in season two of Ultra Zero Fight, first seen running away King Silvergon until Ultraman Zero neutralize the situation by taming the monster.\n}}"
    }
  ]
}