{
  "content": [
    {
      "type": "text",
      "text": "# List of mass stabbings in the United Kingdom\n\nThis is an incomplete list of mass stabbings in the United Kingdom.\n2020s\n{| class=\"wikitable sortable\"\n! scope=\"col\" style=\"width: 8rem;\" | Date\n! scope=\"col\" style=\"width: 10rem;\" | Location\n! data-sort-type=number | Dead\n! data-sort-type=number | Injured\n! data-sort-type=number | Total\n! class=unsortable | Description\n|-\n|\n| Huntingdon, Cambridgeshire, England\n| 0\n| 11\n| 11\n|  Eleven passengers on a London-bound LNER train from Doncaster were taken to hospital after being attacked before they arrived at Huntingdon.\n|-\n|\n| Bermondsey, London, England\n| 2\n| 2\n| 4\n| Two men were killed and another two were injured following a stabbing at a business; one of the injured was subsequently arrested.\n|-\n|\n| Thamesmead, London, England\n| 0\n| 5\n| 5\n| Five men were stabbed during a fight at a music event; all of them were subsequently arrested.\n|-\n|\n| Beddington, London, England\n| 0\n| 5\n| 5\n| Five people were injured after being stabbed at a warehouse.\n|-\n|\n| Southport, Merseyside, England\n| 3\n| 10\n| 13\n|  Three children were killed and 10 people, eight of whom were children, injured after a man attacked a children's Taylor Swift-themed dance and yoga event.\n|-\n|\n| Hainault, London, England\n| 1\n| 4\n| 5\n|  A 14-year-old boy was killed and four other people injured after a man crashed his vehicle into a house before walking around stabbing people.\n|-\n|\n| Bodmin, Cornwall, England\n| 1\n| 7\n| 8\n|  One man was killed and seven other people injured after an altercation outside a nightclub in Bodmin.\n|-\n|\n| Walthamstow, London, England\n| 0\n| 4\n| 4\n| Four men were injured, one critically, after a machete attack at a pub.\n|-\n|\n| Portsmouth, Hampshire, England\n| 0\n| 4\n| 4\n| Four men were stabbed outside a nightclub in Portsmouth.\n|-\n|\n| Bermondsey, London, England\n| 4\n| 0\n| 4\n|  Four people were killed in a three-bedroomed terraced house.\n|-\n|\n| Killamarsh, Derbyshire, England\n| 4\n| 0\n| 4\n|  A man killed his pregnant partner, her two children and one of their friends by striking them over their heads with a claw hammer at his home in Killamarsh.\n|-\n|\n| Birmingham, England\n| 1\n| 7\n| 8\n| A man with schizophrenia killed a man and injured seven others during a series of seemingly random knife attacks.\n|-\n|\n| Moss Side, Manchester, England\n| 1\n| 3\n| 4\n|  Four people were stabbed, one fatally, in an incident which occurred as a result of a gangland feud. The attackers were armed with a knife, machete and imitation handgun.\n|-\n|\n| Glasgow, Scotland\n| 0\n| 6\n| 6\n|  Six people, including a police officer, were seriously injured when a man stabbed them at the Park Inn Hotel in Glasgow's city centre.\n|-\n|\n| Reading, Berkshire, England\n| 3\n| 3\n| 6\n|  A man armed with a kitchen knife attacked six people in Forbury Gardens, killing three and seriously injuring three others.\n|}\n2010s\n{| class=\"wikitable sortable\"\n! scope=\"col\" style=\"width: 8rem;\" | Date\n! scope=\"col\" style=\"width: 10rem;\" | Location\n! data-sort-type=\"number\" | Dead\n! data-sort-type=\"number\" | Injured\n! data-sort-type=\"number\" | Total\n! class=\"unsortable\" | Description\n|-\n|\n| City of London, London, England\n| 2\n| 3\n| 5\n|\nA man armed with two kitchen knives stabbed multiple people inside Fishmongers' Hall and on the north side of London Bridge.\n|-\n|\n| Manchester, England\n| 0\n| 5\n| 5\n| Five people were injured, one seriously, after a man started attacking people at the Arndale Centre in Manchester.\n|-\n|\n| Manchester, England\n| 0\n| 3\n| 3\n|\nThree people, including a British Transport Police officer, were seriously injured after a man attacked them at Manchester Victoria station.\n|-\n|\n| Edmonton, London, England\n| 0\n| 4\n| 4\n| Four men were found with stab wounds following a fight apparently related to a shooting which happened the day before.\n|-\n|\n| Southwark, London, England\n| 6\n| 48\n| 54\n|\nThree attackers armed with ceramic knives killed six people and injured 48, 21 critically, in the Borough Market area in central London.\n|-\n|\n| Bristol, England\n| 0\n| 4\n| 4\n| Four people were stabbed during a large fight outside a popular nightclub in Bristol.\n|-\n|\n| Bloomsbury, London, England\n| 1\n| 5\n| 6\n|\nA man killed one person and injured five others, one seriously, in a stabbing attack in Russell Square.\n|-\n|\n| Leytonstone, London, England\n| 0\n| 3\n| 3\n|\nA man armed with a bread knife injured three people at Leytonstone tube station, one of them seriously.\n|-\n|\n| St Helier, Jersey\n| 6\n| 1 (the perpetrator)\n| 7\n|\nA man armed with two kitchen knives killed six people, including four members of his family, before repeatedly stabbing himself in the chest.\n|-\n|\n| Wootton, Northamptonshire, England\n| 4\n| 0\n| 4\n|\nFour people, all members of the same family, were found stabbed to death at their home on 1 May 2011.\n|}\n2000s\n{| class=\"wikitable sortable\"\n! scope=\"col\" style=\"width: 8rem;\" | Date\n! scope=\"col\" style=\"width: 10rem;\" | Location\n! data-sort-type=\"number\" | Dead\n! data-sort-type=\"number\" | Injured\n! data-sort-type=\"number\" | Total\n! class=\"unsortable\" | Description\n|-\n|\n| London, Greater London, England\n| 1\n| 5\n| 6\n| A man killed one person and critically injured five others after \"rampaging\" through the Green Lanes area of London.\n|-\n|\n| Crumpsall, Greater Manchester, England\n| 1\n| 4\n| 5\n|  Five police officers were stabbed, one fatally, in a flat during an immigration operation by terrorist Kamel Bourgass who had participated in the Wood Green ricin plot.\n|}\n1990s\n{| class=\"wikitable sortable\"\n! scope=\"col\" style=\"width: 8rem;\" | Date\n! scope=\"col\" style=\"width: 10rem;\" | Location\n! data-sort-type=\"number\" | Dead\n! data-sort-type=\"number\" | Injured\n! data-sort-type=\"number\" | Total\n! class=\"unsortable\" | Description\n|-\n|\n|London, England\n|0\n|11\n|11\n|A schizophrenic man attacked a church with a samurai sword, slashing 11 before being subdued by 7 people.\n|-\n|\n| Small Heath, Birmingham, England\n| 1\n| 9\n| 10\n| A man with two knives stabbed ten people in a Netto supermarket, killing one.\n|-\n|\n| Birmingham, England\n| 0\n| 15\n| 15\n|\nA man injured 15 women, three seriously, with a butcher knife and a bread knife in a Rackhams department store.\n|-\n|\n| Middlesbrough, North Yorkshire, England\n| 1\n| 2\n| 3\n| One girl was killed and two others injured when a masked man armed with a shotgun and knives burst into their classroom at Hall Garth School and stabbed them.\n|}\nSee also\n* Knife crime in the United Kingdom\n* List of mass shootings in the United Kingdom\nReferences"
    }
  ]
}