{
  "content": [
    {
      "type": "text",
      "text": "# List of Battle for Dream Island episodes\n\nBattle for Dream Island is an independent animated web series created by twin brothers Cary and Michael Huang. Its first episode was uploaded to YouTube on January 1, 2010. The show currently has over 95 episodes and is still running.\nSeries overview\n| end1       =\n| color2     = FFA500\n| link2      = List of Battle for Dream Island episodes#Season 2: Battle for Dream Island Again (2012–2013, 2023–present)\n| auxA2A     = Battle for Dream Island Again\n| auxA2Aspan = 2\n| episodes2  = 23\n| episodes2A = 5}}\n| start2A    =\n| end2A      =\n| episodes2B = 17\n| start2B    =\n| end2B      =\n| color3     = FFFF00\n| link3      = List of Battle for Dream Island episodes#Season 3: dnalsI maerD roF elttaB (2016)\n| auxA3      = dnalsI maerD roF elttaB\n| episodes3  = 1 is currently on a hiatus, but it has been confirmed that it will resume at a later date.}}\n| released3  =\n| color4     = 3198FF\n| link4      = List of Battle for Dream Island episodes#Season 4: Battle for B.F.D.I./B.F.B. (2017–2021)\n| episodes4  = 30\n| auxA4A     = Battle for B.F.D.I.\n| episodes4A = 16\n| start4A    =\n| end4A      =\n| auxA4B     = Battle for B.F.B.\n| episodes4B = 14\n| start4B    =\n| end4B      =\n| color5     = 32CD32\n| link5      = List of Battle for Dream Island episodes#Season 5: Battle for Dream Island: The Power of Two (2021–present)\n| auxA5      = Battle for Dream Island: The Power of Two\n| episodes5  = 20\n| start5     =\n| end5       =\n}}\nEpisodes\n: Battle for Dream Island (2010–2012)\n| OriginalAirDate =\n| ShortSummary    = While 20 anthropomorphic objects are interacting with each other in a grassland, a dark gray speaker box\ncalled the Announcer descends from the sky and announces the existence of Dream Island, an island designed to be the ultimate paradise, and that whoever owns the island can decide who is allowed onto it. He starts a contest for the island with the 20 objects as contestants.\nThe first challenge is to see who can stay on a balance beam the longest. Two of the objects, Pin and Leafy, win the first contest and get to organize the teams of the competition; the Squishy Cherries and the Squashy Grapes. The Squishy Cherries consist of  Blocky, Bubble, Eraser, Firey, Match, Pen, Pencil, Pin, Spongy, and Woody. The Squashy Grapes consist of Coiny, Flower, Golf Ball, Ice Cube, Leafy, Needle, Rocky, Snowball, Teardrop, and Tennis Ball. The second contest is a race to make a boat and row it to the finish line, which the Squishy Cherries win. Because Pin won the challenge for her team, she obtains a \"Win Token\", which allows her to halve her votes during Cake at Stake.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = Cake at Stake, the contest's elimination ceremony, is introduced, where the losing team's members get cake slices until there are none left, revealing the eliminated contestant. Flower is eliminated with 4 votes, and though she attempts to murder the Announcer with an \"announcer crusher\", she fails and is sent to the designated elimination area, the Tiny Loser Chamber (TLC). The contest is an obstacle course, won by the Squashy Grapes. Needle obtains a Win Token for finishing the challenge first.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is key lime pie, and Spongy is eliminated with 4 votes. The contest is a quiz, which is initially won by the Squishy Cherries until it is revealed that Blocky and Pen cheated, giving the victory to the Squashy Grapes. Golf Ball obtains a Win Token for having the highest score on the test.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is ice, and Blocky is eliminated with 6 votes. The contest consists of two parts: to bake cakes that will be rated by Announcer, Flower, and a die, and to eat 100 chocolate balls. The Squashy Grapes win in a tiebreaker, and Pin gains her second Win Token for having the highest scoring cake.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is an ice cream cake, and Woody is eliminated with 9 votes. The contest is to cross a bridge, the Squashy Grapes win in a tiebreaker. No one receives a Win Token in this episode.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is cupcakes, and Pin is eliminated with 5 votes. The teams are temporarily split into five teams of three, and the contest is to get across 3 islands. Coiny, Ice Cube, and Needle lose the contest, and Eraser, Firey, and Pen all get Win Tokens for finishing first.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is key lime pie again, and Needle is eliminated with 6 votes, even after halving her votes with a win token. The contest is to solve a puzzle, won by the Squashy Grapes. As a result, they get to choose a contestant from the Squishy Cherries to be on their team. Firey switches to the Squashy Grapes. No one receives a Win Token in this episode.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The contest is a race where each contestant has to carry one of their other team members. The Squashy Grapes win and get to have an eliminated player on their team. No one receives a Win Token in this episode.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = Blocky rejoins the game onto the Squashy Grapes with 8 votes, which are then split into Squashy Grapes (Blocky, Ice Cube, Leafy, Snowball, and Teardrop) and Another Name (Coiny, Firey, Golf Ball, Rocky, and Tennis Ball).\nA new elimination system is introduced, in which the two most voted contestants from the team that was last are voted on by the team that placed first; one contestant will join the winning team, and the other will be eliminated. The contest is a six-legged race, in which Squishy Cherries places first and Squashy Grapes in last. Blocky receives a Win Token for rejoining.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is modelling clay, with the bottom two being Teardrop and Snowball, at 5 and 18 votes respectively. Teardrop is eliminated from a 3-2 vote, with Snowball being moved to the Squishy Cherries. The contest, which is for each team to fill their tub as much as they can with tears, ends in a tie. The tiebreaker is a skiing contest in which the Squishy Cherries and Another Name were rolled into snowballs, needing an additional tiebreaker; a handstanding contest won by the Squishy Cherries. Eraser gains a Win Token for handstanding the longest.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = Starting from this episode onward, the show would feature recommended characters from viewers, with Bomby being the first under this title.\nThe Cake at Stake is imaginary cake, with the bottom two being Golf Ball at 12 votes (6 after using her win token) and Rocky at 15. Golf Ball is eliminated from a 0-6 vote, with Rocky being moved to the Squishy Cherries. The contest is try to stay up in the air with balloons, which the Squashy Grapes win and Another Name lose. No one receives a Win Token in this episode.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake has no cake, with the bottom two being Tennis Ball and Coiny at 22 and 30 votes, respectively. Leafy picks Tennis Ball for the Squashy Grapes, eliminating Coiny. The teams and Win Tokens are removed, being replaced with a points leaderboard where the bottom third go to Cake at Stake. Firey, Pen, Blocky, and Eraser earn 15 points for each token they had. The contest is to climb ladders.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is fish, with the bottom third being Snowball, Bubble, Rocky, and Tennis Ball. Snowball is eliminated with 47 votes. The contest is to find and bring a red ball to the Announcer.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is fruitcake, with the bottom third being Match, Ice Cube, Rocky, and Tennis Ball. Match is eliminated with 66 votes. The eliminated contestants get a contest to carry loaves to their basket until the deadline, won by Spongy, who rejoins the competition and gains 38 points for each loaf of bread carried. The next contest is to jump over obstacles on a conveyor belt.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is nickels, with the bottom third being Ice Cube, Leafy, Eraser, and Firey. Eraser is eliminated with 99 votes. There are two contests: to stay on floating islands in a giant barf bag, and to make a taco rated by the eliminated contestants.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is an explosive blueberry pie, with the bottom third being Pen, Bubble, and Rocky. Pen is eliminated with 144 votes. The contest is bowling, and everyone  is sent to Cake at Stake besides Firey, who earned immunity by bowling a strike.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is knives, and Blocky is eliminated with 112 votes. The contest is to throw and catch frisbees as a pair. Announcer reveals that the contestants will vote on who is eliminated, and the viewers will instead vote on one of thirty \"recommended characters\" to join the competition.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is a cracker, and Leafy and Tennis Ball tie for elimination with 2 votes. The tiebreaker is to jump over a gap, eliminating Tennis Ball who falls. David joins the game as the recommended character with 102 votes. The contest is a staring contest, won by Pencil. While the staring contest is going on, the eliminated contestants try to escape the TLC, which backfires.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is shovels covered in mud. The bottom three are Spongy, Firey, and Pencil; Pencil is eliminated with 259 votes.\nFrom this point on, points no longer exist, with contestants now obtaining immunity by winning challenges.\nThe contest is to race on unicycles, won by Bubble, Rocky, and Firey. For winning first, Bubble is allowed to choose another contestant to have immunity, choosing Leafy.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Cake at Stake is ice cream cake again, with Spongy, Ice Cube, and David up for voting. David is eliminated with 331 votes. Announcer moves the competition to outer space due to \"budget cuts\", and the contest is to get in a spaceship and shoot lasers at other contestants. Bubble wins, and once again picks Leafy to have immunity alongside her. Announcer invites the viewers to vote on an eliminated contestant to rejoin the game, while the non immune contestants being voted on by the previously eliminated.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The contestants return to Earth. The Cake at Stake is nothing, and Ice Cube is most voted to be eliminated.  Flower rejoins the game with 205 votes. The contest is a long jump competition, won by Leafy, although she gives up her immunity to Spongy.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Announcer gets crushed by Spongy, so Firey and Flower bring out their personal speaker boxes to host. The Cake at Stake is \"yoylecake\" (a cake composed of fictional \"yoyleberries\" from the show), and Rocky is eliminated with 319 votes. The contest is to escape a volcano. The contestants all tie, so Firey and Flower's Speaker Boxes do a beauty contest. They declare their creators as the winners, giving Firey and Flower immunity.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = The Announcer gets recovered, and the Cake at Stake is cheese slices. Spongy is eliminated with 432 votes. The contest is to do every previous contest in order from episode 1 to 22, which is won by Bubble. Firey is given a penalty (asking the viewers to vote for him) for performing poorly during the challenge.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = Firey and Leafy hang out in the former's ferris wheel. However, Firey installed a lava fall on it. Without a way to escape, Leafy is burned to death.\nAnnouncer abruptly cancels the show after seeing that they have gotten fewer votes than last time. Multiple bugs infest the area, and everyone except David, who is immune, is killed. Announcer then continues the competition with clones of David. The Cake at Stake is red velvet cake, and Flower is eliminated with 524 votes. At that point, the contestants suddenly come back, all having faked their deaths. There is no contest, so the Announcer invites the viewers to vote who should win Dream Island. In addition, the Announcer promises that a Season 2 will only happen if they receive 1,000 votes.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n| ShortSummary    = After releasing the eliminated contestants, the Announcer holds the final Cake at Stake for Bubble, Leafy and Firey. There were only 870 votes, which supposedly meant no Season 2 would occur. The cake is a Grand Cake, made up of all the previous cakes. Before the Announcer can declare the winner, Flower damages him, affecting his speech. With 406 out of 870 votes, Firey wins the cake and Dream Island.\nWhen choosing who gets to enter, Firey lets everyone in except for Leafy, who he excludes because he was hurt by her wanting to get off his ferris wheel. Angered, Leafy buys Dream Island from the Announcer. After Bubble calls out Flower for her behavior, the latter destroys all of the recovery centers in a fit of rage and pops the former. She is in turn crushed to death by a UFO. When the others find out about Leafy's theft of Dream Island, they threaten to kill her via Flower's announcer crusher. Before she is crushed, Firey swoops in using a hang glider and saves her, telling her that he values their friendship rather than the island as they fly away towards the sunset.\n| LineColor       = FF5F5F\n| DirectedBy      =  &\n}}\n}}\n: Battle for Dream Island Again (2012–2013, 2023–present)\n| ShortSummary    = Leafy, with the rest of the cast in hot pursuit, escapes into Yoyleland (where the previously seen yoyleberries come from) using a map, which Pin immediately rips up, rendering Leafy unable to return. The 20 most voted contestants out of 60 total, as well as 2 chosen to automatically join, are brought back for the second season. TV, a previously recommended character, begins to host this season.\nOriginally, the contestants that were supposed to join were Rocky, Firey, Leafy, Teardrop, Bubble, Needle, Spongy, Pin, Tennis Ball, Coiny, Pencil, Match, Ice Cube, Flower, and Golf Ball, alongside newcomers Nickel, Bomby, Dora, Ruby, Donut, Fries, and Gelatin. But since Leafy, Bubble, and Flower were not around, they are disqualified and replaced with additional newcomers Book, Yellow Face, and Puffball. The contestants that failed to debut are sent to the Tiny Loser Chamber, which is now inside the similar-looking Locker of Losers (LOL).\nThrough peer pressure, Donut, Coiny, and Pin form a team, with the rest of the contestants being in one big team. The challenge is a game of tug-of-war, which the smaller team quickly loses.\nInstead of voting in the comments, viewers can like or dislike a contestant's video, with the most-liked getting to spin a prize wheel and the most-disliked getting eliminated.\n| LineColor       = FFA500\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = The smaller team is named W.O.A.H. Bunch, and Coiny wins the prize with 448 likes, and Donut is eliminated with 573 dislikes. Coiny's prize is yoyleseeds. Teardrop is forced to switch to the smaller team, and the contest is to make \"yoylestew\", won by W.O.A.H. Bunch.\n| LineColor       = FFA500\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Puffball wins the prize with 387 likes, and Dora is eliminated with 347 dislikes. Puffball's prize is a personal speaker box, which becomes the host. Needle is forced to switch to W.O.A.H. Bunch, and the contest is to kill all of the bugs in the team's glass box, won by the larger team, now colloquially called \"Team No-Name\".\n| LineColor       = FFA500\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Teardrop wins the prize with 502 likes, and is also eliminated with 440 dislikes. Teardrop's prize was to choose between immunity into the final 15 or a \"Hand-Powered Recovery Center\" (HPRC), which can recover any contestant via turning a large hand crank; she chooses the HPRC. Bomby and Yellow Face switch to W.O.A.H. Bunch. The contest is to build a new Dream Island. W.O.A.H. Bunch wins the contest, with their \"Dream Island\" being a poorly-made farm.\n| LineColor       = FFA500\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Pin accidentally stabs Puffball Speaker Box, resulting in Firey bringing out his personal speaker box to host. The Cake at Stake is chunks of Donut's corpse. Puffball wins the prize with 424 likes, and Match is eliminated with 426 dislikes. Puffball's prize is to choose which contestant should have their limbs removed, and she chooses Pin. Nickel and Spongy switch to W.O.A.H. Bunch, and Book, Ice Cube, Pencil, and Ruby make their own team, named FreeSmart. The contest is to get to the summit of the far away Yoyle Mountain, in Yoyleland.\n| LineColor       = FFA500\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = This part of the episode is a puzzle-platform game using Adobe Flash.\n}}\n| OriginalAirDate =\n| ShortSummary    = The Cake at Stake is started by the bugs, but FreeSmart kills them using Spongy, so the TLC inhabitants host the next challenge. With the help of Coiny, Pin regains her face and size as a reward. However, she does not get her limbs back, instead getting a cable-powered mech suit. Golf Ball is eliminated and sent to the WTF. The challenge is to get to a bunk bed at the top of the TLC inhabitants' islands, in which they have missions assigned to complete in order to pass to the next island, though Evil Leafy is in pursuit. On the final island, which is to sing a song so as to impress Puffball, \"Ruby\", who is teamed with Book, secretly records Pin's song, modifies it, and plays it into the microphone. Having had enough of the disrespect she endured from FreeSmart in the past episodes, Pin sends a surge of electricity through her cable, which travels up the central beam and strikes \"Ruby\" and Book, putting them up for elimination.\n| LineColor       = FFA500\n| DirectedBy      = , ,  &\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = The final nine are divided into three new teams of equal size. Each team competes to get all of their respective team members inside of a birdhouse lined with lead paint. The cast eventually ends up shrinking eachother and the birdhouse down to the atomic level.\n| LineColor       = FFA500\n| DirectedBy      = , ,  &\n| WrittenBy       = , ,  &\n}}\n| ShortSummary    = Balloony ties up the rest of the TLC inhabitants and declares himself host. As Needle's allegiance is split between conflicting alliances, she decides to play for both teams simultaneously. In the challenge, the contestants are tasked with hiding a cherished item and seeking out their competitors' trinkets in order to tag them.\n| LineColor       = FFA500\n| DirectedBy      =\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = After the contestants try to use Spongy to destroy the TLC, Balloony drives it away. The residents of the WTF take over hosting duties. The challenge is for the contestants be their \"truest selves\". Book embarks on a wild goose chase of errands to restore her original cover, while Tennis Ball and Nickel are sent forward in time after a mishap involving Yoyleite.\nNote: Several guest stars have voice roles in this episode, including Rosie O'Donnell and her child Clay O'Donnell.\n| LineColor       = FFA500\n| DirectedBy      =  &\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = Tennis Ball uses his challenge reward to forcibly disband W.O.A.H. Bunch, and Needle decides to start playing for herself, effectively ending the team phase, and Nickel is eliminated. The episode's challenge is to be the first to illuminate three beacons in their dedicated color; in the end, Pin betrays Coiny and wins immunity, though it is shown later that Coiny is indifferent to this.\nNote: Rosie and Clay O'Donnell reprise their guest roles in the episode's cold open.\n| LineColor       = FFA500\n| DirectedBy      =\n| WrittenBy       =\n}}\n| ShortSummary    = A fish monster from the sea becomes the latest host of the competition, as players are tasked to fill their baskets with unique items. The episode concludes in the midst of the challenge and prompts viewers to vote on the game's next host.\n| LineColor       = FFA500\n| DirectedBy      =\n| WrittenBy       =\n}}\n| ShortSummary    = Picking up after the events of the previous episode, this time the contestants must sell their ten items for immunity tickets. Needle has an advantage due to winning the first part, and Coiny and Pin end up being up for elimination after the former sacrifices himself.\n| LineColor       = FFA500\n| DirectedBy      =\n| WrittenBy       =\n}}\n| ShortSummary    = This is a non-competition episode following Leafy and Pin, along with the BFDIA 19 voting results. Leafy and Pin play at the park, and Leafy tries convincing Pin to help find a yellow tomato, in which they climb up a giant beanstalk which catches fire, then spin a prize wheel to get the tomato. During this, the Cake at Stake is started, with the LOLers revealing the votes for the new hosts, which ends up being Leafy. Leafy goes to recover Firey, but Firey denies ever meeting Leafy, calling her a stranger, then walking away and disappearing, leaving Leafy saddened.\n| LineColor       = FFA500\n| DirectedBy      =\n| WrittenBy       =\n}}\n| ShortSummary    = The eliminated contestants rebuild the Goiky Highway, which connects the mainland to Yoyleland. Leafy is sitting next to the Hand-Powered Recovery Center when she is dropped a letter confirming she's the next host. Pin is eliminated and the challenge is to travel with Leafy until she runs out of \"Friendship Flags\", which she places if she likes a location they visit. The contestants find a hole in the highway shaped like Woody, and Needle uses a magnet to attract the Hand-Powered Recovery Center there. Woody is recovered and slotted into the hole, later slipping and falling into a crack in the Earth that was formed from Leafy's flag planting. Tennis Ball finds out Leafy has millions of flags so he starts destroying the flags to speed the contest up. Pin saves Woody but dies in the process. Coiny and Needle jump into the hole with Leafy to get the last Friendship Flag. Tennis Ball gets Pin's drill and drops it into the hole to kill Needle, Book jumps to save her but is burnt to death, and Leafy gets hit by the drill.\n| LineColor       = FFA500\n| DirectedBy      =\n| WrittenBy       =  &\n}}\n}}\n| ShortSummary    = The final three contestants of BFDIA compete in their final immunity challenge.\n| LineColor       = FFA500\n| DirectedBy      =\n| WrittenBy       =\n}}\n}}\n: dnalsI maerD roF elttaB (2016)\n| ShortSummary    = This episode is set after the events of BFDIA and focuses on the contestants' misadventures in Yoyle City. Golf Ball and Tennis Ball visit the Science Museum of Yoyle City and find a \"Wall Teleporter\", which can create portals through walls. They decide to use the Wall Teleporter to free contestants that are still inside the Tiny Loser Chamber, though they can only do one at a time. Viewers can vote in the comments to decide which contestant to release.\n| LineColor       = FFFF00\n| DirectedBy      =  &\n}}\n}}\n: Battle for B.F.D.I./B.F.B. (2017–2021)\n| ShortSummary    = After Flower calls Black Hole down to earth to open a jar of cyanide, all of the recovery centers are destroyed once again. Two creatures known as \"algebraliens\", Four and X, arrive on Earth to start a new competition, with the prize being a \"BFDI\". The 64 contestants split into eight teams of eight, being Death P.A.C.T., Free Food, BEEP, iance, The Losers, A Better Name Than That, Team Ice Cube, and [8 names at once]. The first challenge is to retrieve X's lost baskets, which iance loses.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = Pencil is eliminated and is abruptly absorbed into Four. The contestants egg on Four to recover their dead teammates. After initially refusing, he recovers them all inside of large jawbreakers, and the second contest is to find one of the revived contestants inside of one. When BEEP is revealed to have lost, they give up on their jawbreaker, leaving the remaining contestant, Taco, trapped inside.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Leafy is the next to be eliminated. The teams use varying strategies to spin their swing set around fifty times in order to win immunity, which Team Ice Cube loses. During the challenge, members of [8 names at once] speculate on the whereabouts of Taco. When Taco manages to free herself from the jawbreaker after the challenge, her teammates accuse her of leaving them (instigated by Book) and shun her.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Bracelety is the next to be eliminated. Four challenges the teams to create him the best makeover possible in honor of the fourth episode. Death P.A.C.T. is far too caught in a conundrum involving forks to commit time to the challenge, and Pen's depiction of Four leaves them up for elimination.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = The Cake at Stake prize is a fortune cookie, and Liy is eliminated. The challenge is for each team to keep their paper airplane in the sky, with the first to hit the ground being put up for elimination. BEEP loses the challenge.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Roboty is the next to be eliminated. A Better Name Than That decides that Four's abusive behavior has gone on long enough, and plots to get rid of him by \"multiplying\" him with 0, using X as a multiplication operator and Donut as the 0 integer. The plan is successful, and Four is absorbed into Donut, who becomes the new host of the show. The challenge is to avoid contracting the \"Twinkle of Contagion,\" a glowing effect that envelops whoever looks at it. The Losers hide in a basket to avoid contracting the Twinkle. However, Bell manages to smash through the basket and pass the Twinkle to The Losers just before time runs out, putting them up for elimination.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Loser, an extremely popular contestant, is scrutinized after lying about having played with eye popper toys in the past, as said eye poppers had just been created. He is then eliminated during the Cake at Stake ceremony, and is sealed inside one of the leftover jawbreakers. For the challenge, teams must prevent the jawbreaker from entering their hole to avoid being put up for elimination, which A Better Name Than That loses.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\n| ShortSummary    = In a trivia contest, teams must press their buzzers and answer Donut's questions. 8-Ball is eliminated and crushed by the moon, and Saw inhales the fumes that were created by his death, causing her to only respond with \"eight\" whenever answering a question. Stapy creates a fake buzzer to steal the final answer from Bubble, but he is caught, placing his team up for elimination.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\n| ShortSummary    = It is revealed that X had narrowly escaped being multiplied and went into hiding, and a tired Donut decides to make him the host. Stapy is eliminated as X reads the Cake at Stake votes backwards. The challenge is to throw balls into a basket and weigh it down onto the buzzers from the previous challenge, lost by BEEP.\n| LineColor       = 3198FF\n| DirectedBy      = , ,  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Once the contestants realize that Four was the only available source of contestant recovery, they decide that the next challenge is to bring him back. Firey and Pin successfully do so, extracting his essence from Donut, and once Four is recovered, he sends the remaining eliminated contestants to \"Eternal Algebra Class Withfour\" (abbreviated as EXIT), where the other eliminated contestants are. Instead of an elimination, one player in the EXIT gets the chance to rejoin BFB.\n| LineColor       = 3198FF\n| DirectedBy      = , ,  &\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = Leafy rejoins the game and is placed on The Losers due to them winning last episode's challenge. The challenge is to climb a pillar of stairs the fastest. Foldy sabotages Flower and the rest of iance in an attempt to avenge Stapy. Her plan is successful as iance ends up losing.\n| LineColor       = 3198FF\n| DirectedBy      = , ,  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Match is the next to be eliminated. Each team is put in a room and has to guess which of their teammates has had their mind swapped with someone from a different team, while the \"impostor\" has to avoid being caught. Team Ice Cube loses.\n| LineColor       = 3198FF\n| DirectedBy      = , ,  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Firey Jr. is the next to be eliminated. The challenge is to find X's treasures, which are various emeralds buried underground. Gaty confronts Book about her abandonment obsession with Taco, as the other teammates have already realized that it was a misunderstanding. Meanwhile, Death P.A.C.T. attempts to retrieve their teammate Pillow from inside of Four. The episode ends as Team Ice Cube digs into a mysterious area.\n| LineColor       = 3198FF\n| DirectedBy      = , ,  &\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = During the challenge, Team Ice Cube discovers a hot spring inside the Earth's crust. Spongy takes a dive into the lake and accidentally cracks open an underground volcano, which forces the team to evacuate. The lava starts to spread around the crust and later flood the surface, killing a majority of the contestants. [8 names at once] loses, becoming the final team to suffer a loss.\n| LineColor       = 3198FF\n| DirectedBy      = , ,  &\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = Dora is the next to be eliminated. As the lava flood from the previous episode persists, the remaining living contestants are scattered and stranded across different areas in the grasslands, and the challenge is to find a way back to Four without dying. Flower discovers a button that drains the lava, sending the remaining teams in an all out scramble toward Four. Team Ice Cube loses.\n| LineColor       = 3198FF\n| DirectedBy      = , ,  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Spongy is eliminated, but is too large for Four to absorb, and ultimately escapes along with Loser. As Four tries to recapture them, another algebralien, Two, appears and invites the contestants to battle for season five's titular \"Power of Two\". Four changes Battle for B.F.D.I.'s prize from a \"BFDI\" to a \"BFB\" to incentivize them to stay, but the majority move to Two's show, leaving BFB with only fourteen contestants. To make room for the new season, Two relocates Four and the remaining BFB contestants to a new location. Four restarts his season from there, while also reinstating the original \"BFDI\" as the prize. Viewers can vote in the comments for a new character to join TPOT.\n| LineColor       = 3198FF\n| DirectedBy      = , ,  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = The team with the Four-colored contestants is put up for elimination. The voting system is changed so the viewers can vote in the comments for a contestant to stay, and the contestant with the least votes is eliminated.\nThe challenge is to retrieve X from the set of TPOT. the Four-colored team loses due to the rope snapping and flies into the other team.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\n| ShortSummary    = Balloony is eliminated at the Cake at Stake. The challenge is for teams to protect their towers from each other. The X-colored team's tower is destroyed and the teams are given new names; the Have Cots for the winning team and the Have Nots for the losing team.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = Spongy is eliminated at Cake at Stake, the challenge is to help X's crops grow better. The Have Nots win.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Ruby is eliminated. The challenge is to cool down X. The two teams attempt to cool him down in various ways, such as making a sun angel and running across the Earth so it becomes nighttime, which earns or loses them points. After many failed attempts, Leafy realizes they could cool down X by pouring a water bucket on him, resulting in the Have Cots' victory.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = During the Cake at Stake, Loser's popularity causes him to be confident that he is going to stay in the game until Four reveals that he is eliminated with 5,600 votes. For the challenge, the two teams are tasked with picking gifts for two of their teammates from Yellow Face's warehouse, and the receivers rate their satisfaction. The Have Cots win.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\n| ShortSummary    = After a Cake at Stake ceremony that boils down to one vote, Four takes the teams to court to figure out who stole the original prize for the ceremony: a diary that belonged to Donut. While members of the Have Nots testify before the jury (the Have Cots), Firey and Leafy take things outside and eventually reconcile over the events of \"Return of the Hang Glider\", making amends. The Have Nots win.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\n| ShortSummary    = Bubble is eliminated at Cake at Stake. The challenge is to rescue Four from jail and complete a cliff-and-warehouse challenge, as their journey is complicated by a sabotaged train and a fashion subplot involving Flower's sweater line. The Have Cots win.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\n| ShortSummary    = Purple Face obscures himself and furtively gathers the elimination, Blocky is eliminated. Four announces a new change in the competition. The contestants face a merge and have to compete individually instead of on teams. The challenge is preparing a party for Four; several of the contestants don't set up a party for Four, rather producing ones for other contestants and hosts. Lollipop and Flower win immunity and Lollipop grants Gelatin immunity.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\n| ShortSummary    = Firey is eliminated at Cake at Stake. The challenge is for contestants to enter a mysterious temple to retrieve a \"blessed totem\", with only those who choose correctly gaining safety from elimination. Flower finds the blessed totem and wins.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\n| ShortSummary    = Woody is eliminated at Cake at Stake. The remaining contestants confront the revelation of a new participant, Profily, who claims to have been in the game all along and was hidden from view ever since the first episode. The challenge involves sending Profily to the BRB next to X's aloe vera garden. Leafy receives immunity.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\n| ShortSummary    = Four entertains himself with a five-week driving expedition carrying the contestants along with Purple Face and X. Lollipop is eliminated and has Gelatin inject a partial dose of her grape flavor in him. For the challenge, Four transports the contestants inside the \"World's Largest Oven\" and has them escape. Teardrop breaks free by utilizing a grappling hook and receives immunity.\n|LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\nBack From Beginning\n| OriginalAirDate =\n| ShortSummary    = While in the bus that Four used to get away from the \"intruders\", the contestants are given a note to come outside, where the Announcer makes his return.  Everyone favors the Announcer over Four, which angers them. Because of this, they merge with the desert, turning it blue. The challenge is to re-do all of the previous challenges. In each challenge, contestants meet one or more eliminated contestants. Flower wins immunity after successfully completing the final challenge, leaving Gelatin and Teardrop up for elimination.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\n| ShortSummary    = Announcer reveals that the show is facing cancellation due to a critically low budget, prompting the remaining contestants to scramble to raise enough funds to save the show. Taco is becoming suspicious on why the Announcer suddenly returned after the events of \"Return of the Hang Glider\"; he reveals to her that after BFDI ended, he wanted the show to continue, but struggled to maintain the show while avoiding being noticed by the contestants. After BFDIA ended production, the Announcer returned home, until discovering Four and X with the B.F.D.I. Announcer waited for the cast to shrink before returning and taking back the show and the B.F.D.I. Suddenly, the budget of the show begins to rapidly deteriorate, and with it, the style of the animation. The contestants rush to provide funding for the show, and at the last second, Flower donates $50,000, saving the show.\n| LineColor       = 3198FF\n| DirectedBy      =  &\n| WrittenBy       =\n}}\n| ShortSummary    = An episode of a season in an alternative reality dimension inside Four's mind—including the eliminated contestants from the EXIT—is generated as a coping method, as Four has a theory that the contestants don't care for him because they favor the Announcer. The eliminated contestants have an opinion vote for which contestant in the finale they would like to win the season. Flower wins the season and awards the season prize to the runner-up Gelatin. Purple Face robs the BFDI and conceals it under the seat of the bus. The contestants pursue to reconnect with Four while the other contestants try to collect the BFDI, but agree that the Announcer holds it. The contestants follow Four to the Sun and, after Gelatin berates him for his behavior throughout the season, Four apologizes and they reconnect again.\n| DirectedBy      =  &\n| WrittenBy       =\n| LineColor       = 3198FF\n}}\n}}\n: Battle for Dream Island: The Power of Two (2021–present)\n| ShortSummary    = Beginning after the events of \"Uprooting Everything\", Two reveals Winner the highest voted debuter to join the game. Since 41 is an prime number, and the second highest voted is Nonexisty, who technically equals to zero, Two gets the third highest voted, Price Tag to join the game instead and makes the cast 42.  Six new teams are formed, and the challenge is to get to the top of the roof of Two's hotel. Two fails to communicate that contestants are not allowed to go back down after making their way up, leading the team Death P.A.C.T. Again up for elimination.\n| LineColor       = 32CD32\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Shortly after BFB's end, Teardrop joins the game, but is placed on a solo team due to her late debut. The teams are challenged to stack their blocks into the highest possible formation.\n| LineColor       = 32CD32\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Two reveals why a year long hiatus occurred, as they were busy making an \"Atwosment Park\". Realizing the park is empty, Two challenges the teams to make something for the park. Due to two teams failing and seeing how long it is taking to have another contest, Two decides to speed the game up by putting both teams up for elimination.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       =\n}}\n| ShortSummary    = In the newly-built \"Atwosment Park\", Saw and Cloudy are eliminated. In memory of Saw, her team gathers around a \"funny plant\" she liked, until it is suddenly destroyed. The \"funny plant\" is revealed to be an endangered species, and teams are tasked to protect the seven remaining plants in different regions of the world.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       =\n}}\n| ShortSummary    = Two buys some new plates, but they are flung into the Goiky Canal. The teams are challenged to traverse the waters and each retrieve a plate to win immunity.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       =\n}}\n| ShortSummary    = Four and X return as chefs in Two's hotel, but don't allow them to eat their food, so the teams are challenged to make dinner for Two.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       =\n}}\n| ShortSummary    = While Clock is allowed to remain a spectator due to an unresolved conflict with Winner, Lightning is so angered by his elimination that he creates a storm, destroying seven monuments in the show's Goiky area. Conflict arises within Death P.A.C.T. Again as Fanny questioning if their death prevention goal is worthwhile. Robot Flower overwrites her personality, and goes on a violent rampage against all the failed debutants in the hotel.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       =\n}}\n| ShortSummary    = The teams are challenged to remain on a balance beam that was repaired in the last challenge, an homage to the first episode of BFDI. Teardrop falls ill from absorbing Barf Bag's vomit, so Snowball and Grassy volunteer to help her.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       =\n}}\n| ShortSummary    = A zombie apocalypse spreads, infecting many of the contestants; including Two. The challenge is to try and prevent your team from getting infected, and the two teams with the most people killed/infected are up for elimination. In the episode's stinger, the algebralien One emerges from the damaged moon.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       =\n}}\n| ShortSummary    = Everyone is irritable from the outbreak last episode, which annoys Two, so they make the challenge to enter a teammate's nightmare and help them face their fears as a bonding experience. Fanny and Black Hole discuss the motives of Death P.A.C.T., while Winner confronts their past and makes up with Clock.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       =\n}}\n| ShortSummary    = The EXITors are shown again, trying to devise a plan to escape Four by getting resources they need and splitting up to make the plan easier. They spend years getting said resources as an attempt to escape Four. They eventually escape Four, but then Two forces them into a kitchen to work in an attempt to compromise with Four's insistence of putting them back in the EXIT. The EXITors, angered by this, try to escape. Purple Face gets trapped inside Four trying to \"save\" the EXITors later on, not realizing they already left.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       = , ,  &\n}}\n| ShortSummary    = The contestants are shuffled into four new teams. The new teams are tasked to fill their respective pits with whatever they can find. One starts to write deals with contestants, and Basketball begins to follow her as she grows suspicious. In a post-credits scene, Basketball is noticed and One kidnaps her.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       =  Story by:  &\n}}\n| ShortSummary    = One continues to meddle in the game, creating a massive storm that rages through Goiky, and allowing Pencil to accompany Liy in joining the competition. The challenge is for each team to stop a specific part of the chaos from reaching Two and disturbing their sleep. Ultimately, Basketball is coerced into signing a contract to end the storm.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = TPOT's failed debuters host Cake at Stake, and the challenge is to capture one of two flags; either from atop a snowy mountain, or atop a volcano. Three of four teams go for the snowy mountain, and once it is captured, they attempt to team up to stop CloudYAY from capturing the volcano flag.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = Manipulated by One, the failed debuters discover the Yoyleite from \"Start the Shift\" and learn of its time-traveling capabilities. They are transported to different periods in time, which results in alterations to the series' timeline, and a large crack in the sky, known as the \"Rift\", is formed as a result. The contestants time travel to different episodes in the series to fix differences, correct the timeline, and catch the debuters, but more mistakes are made along the way, causing the Rift to grow exponentially larger, ultimately culminating in Pencil's attempt to change her past accidentally result in Leafy being allowed onto Dream Island by Firey in \"Return of the Hang Glider\", causing the universe to collapse. Gaty signs One's deal to prevent the end of the universe, and thus most of the changes to the timeline are reversed, but the Rift still remains in the sky. Upon hearing that the timeline is still imperfect, Two notices Gaty is missing.\nNote: Kevin MacLeod, TomSka, Jacksfilms, Gooseworx and Michael Gregory of Schmoyoho were also featured in this episode as voice actors.\n| LineColor       = 32CD32\n| DirectedBy      =\n| WrittenBy       = ,  &\n}}\n| ShortSummary    = With Two far too depressed upon Gaty's disappearance, Four and X take over as hosts. The challenge is a game of hide-and-seek, with both Four and X as separate seekers—the team with the most contestants found by Four and the team with the most contestants found by X respectively are up for elimination. Team CloudYAY loses the most to both, leaving them up for a double elimination.\n| LineColor       = 32CD32\n| DirectedBy      = ,  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Bottle assumes hosting duties while Four and X are busy. She sends the contestants to the revamped Atwosment Park containing four separate challenges, each with one member from each team participating. During the contest, Donut is kidnapped by One, who offers him a deal in exchange for his arms back. After Donut questions and refuses her contract, One tears off his legs and kicks him out of her dimension, where he later uses Yellow Face's limbs that he finds in a bush. While exploring the Equation Playground, Bell, Bomby, Barf Bag and Needle come across the algebralien Six, who, after learning of their encounters with One, joins them and leads them to another door leading to Four's head, which Purple Face opens for them on the other side.\n| LineColor       = 32CD32\n| DirectedBy      =\n| WrittenBy       =  &  Story by:\n}}\n| ShortSummary    = Lollipop loses her credit card and suspects that someone has stolen it. Four sets up an exhibition challenge, sending the BFBers into each other's memories to figure out who stole the card. Blocky figured out the card was hidden in some couch cushions, though it turns out to have been taken by Match after making up with Bubble. After the challenge, Loser is overcome with guilt after learning of Winner's presence in TPOT, and ventures out to find them.\n| LineColor       = 32CD32\n| DirectedBy      =  &\n| WrittenBy       =  &\n}}\n| ShortSummary    = Four learns of One's presence after distributing Two's power to the remaining contestants in an effort to hold off the rift. As the Earth is seemingly plunged into darkness, TV hosts Cake at Stake and initiates a battle royale as the next challenge. Purple Face leads the other signers and Six to the locked door to the EXIT, whereas Six reveals the algebralien Three is also in Four's head. One kidnaps Donut again, revealing to him that she erased Gaty from existence as part of the contract she signed, and erases Barf Bag and Basketball until Donut reluctantly gives up his portion of Two's power. Eventually, Pencil acquires almost all of Two's power, and takes Four's as well. She is confronted by One, who offers her a chance to redo the events of BFDI in exchange for her powers; Pencil obliges and is sent back in time. One sends Four away and blasts off into space, continuing to wreak havoc while the fate of the Earth lies uncertain.\n| LineColor       = 32CD32\n| DirectedBy      =\n| WrittenBy       =  &\n}}\nbefore being released on YouTube the following day.}}\n| ShortSummary    = In a flashback, a young One discovers a Yoylite meteor that grants her mysterious powers. After showing the meteor to Three and helping them gain their own power, she is heartbroken to discover the next morning that Three shared their secret with the rest of the numbers. One uses her powers to shatter Three before being overcome by regret, trying to revive her, and partly succeeding, albeit in a disfigured and catatonic state. Four leads the other numbers (except Two and Three) in banishing One for her actions. One later plots to exact revenge and fights other objects she has kidnapped.\nBack in the present, One finds Nine on another planet, destroys it and abducts them, leaving their fate unknown. Meanwhile, Winner and Loser make up with each other before attempting to repair the damaged Wireless Recovery Center. They are joined by Firey Jr, who had respawned from Loser's discarded torch.\n| LineColor       = 32CD32\n| DirectedBy      =\n| WrittenBy       =\n}}\n}}\nNotes\nReferences"
    }
  ]
}