{
  "content": [
    {
      "type": "text",
      "text": "# List of Republic of China Navy ships\n\nThe Republic of China Navy is the maritime branch of the Republic of China Armed Forces. The ROC Navy's primary mission is to defend ROC territories and the sea lanes that surround Taiwan against a blockade, attack, or possible invasion by the People's Liberation Army Navy of the People's Republic of China. Operations include maritime patrols in the Taiwan Strait and surrounding waters, as well as counter-strike and counter-invasion operations during wartime. The Republic of China Marine Corps functions as a branch of the Navy.\nThe ship prefix for ROCN combatants is ROCS (Republic of China Ship); an older usage is CNS (Chinese Navy Ship).\nROCN also avoids giving ships hull numbers that add up to or end at \"4\", as the Chinese pronunciation of the number 4 is close to the pronunciation of \"death\". This numbering scheme is more apparent on more newly acquired ships.\nNote: The ROCN generally uses hull classification symbols similar to the U.S. system with some changes. The proper classification is provided when known.\nPresent fleet\n{| class=\"wikitable\"\n! style=\"text-align:left; width:15%;\" |Class\n! style=\"text-align:left;\" |Image\n! style=\"text-align:left;\" |Type\n! style=\"text-align:left; width:20%;\" |Ships\n! style=\"text-align:left;\" |Note\n|-\n! colspan=\"5\" style=\"background: lavender;\" | Destroyers (4)\n|-\n|\n|\n|Destroyer\n|\n|Decommissioned U.S. Navy s transferred to Taiwan\n|-\n! colspan=\"5\" style=\"background: lavender;\" | Frigates (21)\n|-\n|\n|\n|Frigate\n|\n|Decommissioned U.S. Navy s transferred to Taiwan and further upgraded.\n|-\n|\n|\n|Frigate\n|\n|s that were built in Taiwan under license while the latest two ships were decommissioned by the U.S. Navy and transferred.\n|-\n|\n|\n|Frigate\n|\n|Modified ; purchased from France in the early 1990s\n|-\n! colspan=\"5\" style=\"background: lavender;\" | Corvettes (7)\n|-\n|\n|\n|Corvette\n|\n|Up to 12 planned of which the ROCS Tuo Chiang (PGG-618) is a prototype. The ROCS Ta Chiang is an improved variant.\n|-\n! colspan=\"5\" style=\"background: lavender;\" | Patrol Vessels and Missile Ships (37)\n|-\n|\n|\n|Patrol Ships\n|\n|Locally designed and built by CSBC Corporation, Taiwan in Kaohsiung.\n|-\n|Kung Hua VI (Kwang-Hwa)-class\n|\n|Missile Boats\nFACG-61～66  FACG-68～75  FACG-77、78  FACG-79～84  FACG-89～93\n-->\n|FACG-60 (prototype), FACG-61~66, 68~75, 77~84, 86~93\n|Prototype and 30 built; Last batch delivered to ROCN in October 2011\n|-\n! colspan=\"5\" style=\"background: lavender;\" |Mine warfare (10)\n|-\n|\n|\n|Costal Minehunter\n|\n|Built in Germany by Abeking & Rasmussen, Lemwer 1990–1991.\n|-\n|\n|\n|Minehunter\n|\n|Former U.S. s\n|-\n|\n|\n|Costal minelayer\n|\n|Built in Taiwan by Lung Teh Shipbuilding Co., 2020–2021.\n|-\n! colspan=\"5\" style=\"background: lavender;\" |Amphibious ships (4)\n|-\n|\n|\n|Dock Landing Ship\n|\n|Former U.S.\n|-\n|\n|\n|Tank Landing Ship\n|\n|Former U.S. s\n|-\n|\n|\n|Tank Landing Ship\n|\n|Former U.S. s\n|-\n|-\n|\n|\n|Amphibious transport dock\n|\n|-\n! colspan=\"5\" style=\"background: lavender;\" |Submarines (4)\n|-\n|\n|\n|Attack Submarine\n|\n|World War II era submarines that were upgraded under GUPPY II program. Former U.S.  & s.\n|-\n|Hai Lung (Sea Dragon)-class\n|\n|Attack Submarine\n|\n|Purchased from the Netherlands in the mid-1980s. Former s. A class of replacement submarines are being built under the Indigenous Defense Submarine program.\n|-\n! colspan = \"5\" style = \"background: lavender;\" | Support Vessels (5)\n|-\n|\n| frameless\n| Fast Combat Support Ship\n|\n|\n|-\n|\n|  frameless\n|  Fast Combat Support Ship\n|\n|\n|-\n|\n|  frameless\n| Auxiliary General Communications Ship\n|\n| formerly ROCS Chung Hsi (LST-219)\n|-\n|\n|  frameless\n|  Survey Ship\n|\n| Has been loaned out to National Science Council and other research agencies.\n|-\n|\n|  frameless\n|  Rescue and salvage ship\n|\n|\n|}\nIn June 2016, two s of the US Navy, ex- and , were handed over to the Government of Taiwan for the Republic of China Navy. The transfer cost was an estimated US$177 million. Following a reactivation period at Detyens Shipyard in Charleston SC, the ships sailed for Taiwan in March 2017 and arrived at their new home port in June 2017. The transfer of the ships includes the AN/SQR-19 Multi-Function Towed Array. Taiwan had previously been blocked from acquiring the AN/SQR-19, and the transfer of the system points to an anti-submarine focus in line with the s they will likely replace.\nA new class of eight (8) conventional attack submarines is planned. In November 2020, President Tsai Ing-wen officially opened the submarine construction facility in Kaohsiung, and it is reported (as of November 2021) that the lead submarine is under construction. The Taiwanese military's Indigenous Defense Submarine program anticipates having the first 2,500-ton domestically produced Hai Kun-class submarine entering service in 2025.\nDecommissioned ships\ns\nUS designed; based on PSMM MK.5\n* ROCS Long Chiang (PG-601) – built by Tacoma Boatbuilding Company\n* ROCS Sui Chiang (PG-602) – built by China Shipbuilding Corporation\n()\n*FABG-1~59 (no 4, 13, 22, 31, 40); all were decommissioned by 2013; two were gifted to Paraguay in 1994 and 4 were gifted to Gambia in 2009; replaced by Kung Hua VI project missile boats\nPCL-class offshore patrol craft\n*9 locally designed and built. 143 tons fully load. All decommissioned in 2011.\nDecommissioned in 1973.\n* ROCS Hai Jiao (海蛟)\n* ROCS Hai Lung (海龍)\nEx United States Navy ships\n()\n* ROCS Chi Yang FFG-932 (ex USN FF-1073) retired 2015\n* ROCS Hai Yang FFG-936 (ex USN FF-1083) retired 2015\n* ROCS Lan Yang FFG-935 (ex USN FF-1078) retired 2025\n()\nWorld War II era DDs later upgraded to DDGs in three batches, Wu Chin I, II and III. All ships in this class were retired by 2005. [http://www.destroyers.org/dispositions/dispositions.htm]\nWu Chin I Batch: (Retired in 1980s-1990s)\n* ROCS Dang Yang DD-11 (ex USN DD-764) [https://www.angelfire.com/hi2/DD764/DangYang2002/DangYangSept2002.html]\n* ROCS Fu Yang DD-7 (ex USN DD-838)\nWu Chin II Batch:  (Retired in late 1990s)\n* ROCS Tse Yang DDG-930 (ex USN DD-873)\n* ROCS Han Yang DDG-915 (ex USN DD-833)\n* ROCS Kai Yang DDG-924 (ex USN DD-786)\n* ROCS Lao Yang DDG-920 (ex USN DD-790)\n* ROCS Sheui Yang DDG-926 (ex USN DD-852)\nWu Chin III Batch:  (Retired in 2003–2004)\n* ROCS Chien Yang DDG-912 (ex USN DD-787)\n* ROCS Liao Yang DDG-921 (ex USN DD-832)\n* ROCS Shen Yang DDG-923 (ex USN DD-839)\n* ROCS Te Yang DDG-925 (ex USN DD-837)\n* ROCS Yun Yang DDG-927 (ex USN DD-718)\n* ROCS Chen Yang DDG-928 (ex USN DD-821)\n* ROCS Shao Yang DDG-929 (ex USN DD-788)\ns\n* ROCS Luo Yang DD-14 (ex USN DD-421)\n* ROCS Han Yang DD-15 (ex USN DD-427)\ns\n* ROCS Xian Yang DD-15 (ex USN DD-431)\n* ROCS Nan Yang DD-16 (ex USN DD-456)\ns\n* ROCS An Yang DD-918 (ex USN DD-521)\n* ROCS Qing Yang DD-909 (ex USN DD-528)\n* ROCS Gui Yang DD-908 (ex USN DD-540)\n* ROCS Kun Yang DD-919 (ex USN DD-541)\ns\n* ROCS Hui Yang DD-906 (ex USN DD-696)\n* ROCS Yue Yang DD-905 (ex USN DD-700)\n* ROCS Bo Yang DD-910 (ex USN DD-731)\n* ROCS Xiang Yang DD-901 (ex USN DD-745)\n* ROCS Luo Yang DD-914 (ex USN DD-746)\n* ROCS Heng Yang DDG-902 (formerly DD-2, ex USN DD-747)\n* ROCS Nan Yang DDG-917 (formerly DD-17, ex USN DD-760)\n* ROCS Hua Yang DD-903 (ex USN DD-857)\n* ROCN Zhong Zheng LSD-191 (Dong Hai, ex USN LSD-8)\ns\n* ROCN Zhong Zheng LSD-191 (ex USN LSD-19)\n* ROCN Zhen Hai LSD-192 (ex USN LSD-22)\ns\n* ROCS Tai Kang F-21 (ex USN DE-6)\n* ROCS Tai Ping F-22 (ex USN DE-47)\ns\n* ROCN Tai He F-23 (ex USN DE-102)\n* ROCN Tai Cang F-24 (ex USN DE-103)\n* ROCN Tai Hu F-25 (ex USN DE-104)\n* ROCN Tai Zhao F-26 (ex USN DE-112)\n* ROCN Tai Yuan F-827 (ex USN DE-579)\nYangtze Patrol gunboats\n* ROCN Tai Yuan (ex USN PR-3)\n* ROCN Mei Yuan (ex USN PR-4)\n* ROCN Shan Hai PF-41 (ex-Yong Tai, ex USS PCE-867)\n* ROCN Wei Yuan PF-42 (ex-Yong Xing, ex USS PCE-869)\ns\n* ROCN Zhen Nan (ex-Yong Sheng) PF-43 (ex USN AM-257)\n* ROCN Yu Men (ex-Yong Shun) PF-44 (ex USN AM-258)\n* ROCN Yang Ming (ex-Yong Ding) PF-45 (ex USN AM-259)\n* ROCN Yong Ning PF-46 (ex USN AM-260)\n* ROCN Yong Jia PF-47 (ex USN AM-246)\n* ROCN Yong Xiu PF-48 (ex USN AM-274)\n* ROCN Zi Ling (ex-Yong Shou) PF-49 (ex USN AM-276)\n* ROCN Yong Feng PF-50 (ex USN AM-279)\n* ROCN Lin Huai (ex-Yong Chang) PF-51 (ex USN AM-287)\n* ROCN Yong Chun PF-52 (ex USN AM-363)\n* ROCN Yong He PF-53 (ex USN AM-217)\n* ROCN Yong Kang PF-54 (ex USN AM-225)\n* ROCN Yong Ming (ex USN AM-273)\n* ex USN AM-266\n* ex USN AM-286\ns\n* ROCN Tian Shan 315 (ex USN APD-134)\n* ROCN Yu Shan PF-33 (ex USN APD-91)\n* ROCN Hua Shan PF-33 (ex USN APD-129)\n* ROCN Fu Shan PF-35 (ex USN APD-98)\n* ROCN Shou Shan PF-37 (ex USN APD-120)\n* ROCN Tai Shan PF-38 (ex USN APD-92)\n* ROCN Heng Shan PF-39 (ex USN APD-121)\ns\n* ROCN Wen Shan PF-34 (ex USN APD-42)\n* ROCN Lu Shan (ex USN APD-78)\n* ROCN Gang Shan PF-42 (ex USN APD-43)\n* ROCN PF-43 (ex USN APD-48)\n* ROCN PF-44 (ex USN APD-76)\ns\n* ROCN Jian Men PCE-45 (ex USN AM-387)\n* ROCN Wu Sheng PCE-66 (ex USN AM-378)\n* ROCN Ju Yong PCE-67 (ex USN AM-389)\n* ROCN Ping Jing PCE-70 (ex USN AM-118)\ns\n* ROCN Qing Jiang PC-116 (ex USN PC-1168)\n* ROCN Xi Jiang PC-120 (ex USN PC-1149)\n* ROCN Bei Jiang PC-122 (ex USN Hanford PC-1142)\n* ROCN Wu Song (ex USN PC-490)\n* ROCN Dong Ping (ex USN PC-1088)\n* ROCN Song Ping (ex USN PC-1090)\n* ROCN Gan Tang (ex USN PC-1091)\n* ROCN Qian Tang (ex USN PC-1549)\n* ROCN Tuo Jiang PC-104 (ex USN PC-1247)\n* ROCN Pei Jiang PC-105 (ex USN PC-492)\n* ROCN Xiang Jiang PC-108 (ex USN PC-786)\n* ROCN Zi Jiang PC-109 (ex USN PC-1078)\n* ROCN Yuan Jiang PC-110 (ex USN PC-1182)\n* ROCN Li Jiang PC-111 (ex USN PC-1208)\n* ROCN Gong Jiang PC-113 (ex USN PC-1233)\n* ROCN Bo Jiang PC-114 (ex USN PC-1254)\n* ROCN Chang Jiang PC-115 (ex USN PC-1262)\n* ROCN Qing Jiang PC-116 (ex USN PC-1168)\n* ROCN Zhu Jiang PC-117 (ex USN PC-1567)\n* ROCN Zhang Jiang PC-118 (ex USN PC-1232)\n* ROCN Dong Jiang PC-119 (ex USS Placerville PC-1087)\n* ROCN Liu Jiang PC-123 (ex USS Escandido PC-1179)\n* ROCN Gan Jiang PC-124 (ex USS Vandalia PC-1175)\n* ROCN Tuo Jiang PC-125 (ex USS Milledgeville PC-1263)\n* ROCN Yin Jiang (ex Bao Ying) PC-101 (ex USN PGM-20)\n* ROCN Lin Jiang (ex Dong Ting) PC-102 (ex USN PGM-13)\n* ROCN Ou Jiang (ex Hong Ze) PC-103 (ex USN PGM-26)\nInfantry landing craft\n* ROCN Lian Bi (ex USN LCI-516)\n* ROCN Lian Guang (ex USN LCI-517)\n* ROCN Lian Rong (ex USN LCI-632)\n* ROCN Lian Zhen (ex USN LCI-514)\n* ROCN Lian Zhu LCI-261 (ex USN LCI-233)\n* ROCN Lian Li LCI-262 (ex USN LCI-417)\n* ROCN Lian Shen LCI-263 (ex USN LCI-418)\n* ROCN Lian Hua LCI-264 (ex USN LCI-630)\n* ROCN Lian Zhen LCI-265 (ex USN LCI-631)\n* ROCN Lian Jie LCI-266 (ex USN LCI)\n* ROCN Lian Qiang LCI-266 (ex USN LCI-1017)\n* ROCN Lian Zhi LCI-271 (ex USN LSSL-81)\n* ROCN Lian Ren LCI-272 (ex USN LSSL-56)\n* ROCN Lian Yong LCI-273 (ex USN LSSL-95)\nMedium Landing ships\n* ROCN Mei Shen (ex USN LSM-433)\n* ROCN Mei Zhen LSM-341 (ex USN LSM-155)\n* ROCN Mei Le LSM-342 (ex USN LSM-157)\n* ROCN Mei Yi LSM-343 (ex USN LSM-285)\n* ROCN Mei Peng LSM-344 (ex USN LSM-431)\n* ROCN Mei Heng LSM-345 (ex USN LSM-456)\n* ROCN Mei Hong LSM-346 (ex USN LSM-442)\n* ROCN Mei Song LSM-347 (ex USN LSM-457)\n* ROCN Mei He (ex Yong Ming) LSM-348 (ex USN LSM-13)\n* ROCN Mei Jian LSM-349 (ex USN LSM-76)\n* ROCN Mei Hua LSM-350 (ex USN LSM-456)\n* ROCN Mei Cheng LSM-351 (ex USN LSM-422)\n* ROCN Mei Gong LSM-352 (ex USN LSM-478)\n* ROCN Mei Ping LSM-353 (ex USN LSM-471)\n* ROCN Mei Wei LSM-354 (ex USN LSM-472)\n* ROCN Mei Han LSM-355 (ex USN LSM-474)\n* ROCN Mei Le (ex Mei Xin) LSM-356 (ex USN LSM-363)\nTank landing ships\n* ROCN Zhong Ye (ex USN LST-717)\n* ROCN Zhong Hai LST-201 (ex USN LST-755)\n* ROCN Zhong Quan LST-202 (ex USN LST-640)\n* ROCN Zhong Ding (ex Zhong Xin) LST-203 (ex USN LST-537)\n* ROCN Zhong Xing LST-204 (ex USN LST-557)\n* ROCN Zhong Ji LST-206 (ex USN LST-1017)\n*ROCN Zhong Cheng LST-207 (ex USN LST-1075)\n* ROCN Zhong Xun LST-208 (ex USN LST-732)\n* ROCN Zhong Lian LST-209 (ex USN LST-1050)\n* ROCN Zhong Rong LST-210 (ex USN LST-574)\n* ROCN Zhong Gong LST-213 (ex USN LST-945)\n* ROCN Zhong Guang LST-216 (ex USN LST-503)\n* ROCN Zhong Zhao LST-217 (ex USN LST-400 Bradley County)\n* ROCN Zhong Xi (ex Gao Xiong) LST-219 (ex USN LST-735)\n* ROCN Zhong Quan (Heng Shan) LST-221 (ex USN LST-1030)\n* ROCN Zhong Sheng LST-222 (ex-211, ex USN LST-1033)\n* ROCN Zhong Fu LST-223 (ex USN LST-840 Iron County)\n* ROCN Zhong Cheng LST-224 (ex USN LST-859 Lafayette County)\n* ROCN Zhong Qiang LST-225 (ex USN LST-306)\n* ROCN Zhong Zhi LST-226 (ex USN LST-1091 Sagadahoc County)\n* ROCN Zhong Su LST-228 (ex USN LST-520)\n* ROCN Zhong Wang LST-229 (ex USN LST-535)\n*ROCN Zhong Pang LST-230 (ex USN LST-578)\nRepair ships\n* ROCN Hsing An (ex USN ARL-41 Achilles)\nEx Royal Navy Ships\n* ROCN Chong Qing (ex RN Aurora)\n* ROCN Fu Bo (ex RN K-79 Petunia)\nHarbour Defence Motor Launches\n* ROCN Fang 1 (ex RN ML-1033)\n* ROCN Fang 2 (ex RN ML-1047)\n* ROCN Fang 3 (ex RN ML-1058)\n* ROCN Fang 4 (ex RN ML-1059)\n* ROCN Fang 5 (ex RN ML-1068)\n* ROCN Fang 6 (ex RN ML-1390)\n* ROCN Fang 7 (ex RN ML-1405)\n* ROCN Fang 8 (ex RN ML-1406)\ns\n* ROCN Gao An (ex RN Pembroke Castle)\n* ROCN De An (ex RN Nunney Castle)\nEx Royal Italian Navy Ships\n* ROCN Xian Ning (ex Regia Marina Lepanto)\nEx Imperial Japanese Navy Ships\n* ROCN An Dong (ex IJN Ataka)\n* ROCN Hao Xue (Yong Ji, ex IJN Toba)\n*ROCN Fen Yang (ex IJN Yoizuki)\ns\n* ROCN Yong Ping (ex IJN Atami)\n* ROCN Yong An (ex IJN Futami)\ns\n*ROCN Lin An (ex IJN Tsushima)\n* ROCN Gu An (ex IJN )\ns\n*ROCN Jiang Feng (ex IJN Fushimi)\n*ROCN Chiang Hsi (ex IJN Sumida)\n*ROCN Chang Zhi (ex IJN Uji)\n* ROCN Hui An (ex IJN Shisaka)\n* ROCN Dan Yang DD-12 (ex IJN Yukikaze)\ns\n* ROCN Heng Yang (ex IJN Kaede)\n* ROCN Hui Yang (ex IJN Sugi)\n* ROCN Xin Yang DD-15 (PF-82, ex IJN Hatsuume)\n* ROCN Hua Yang (ex IJN Tsuta)\n* ROCN Zheng An (Xue Feng, ex IJN Yashiro)\n* ROCN Shen Yang (ex IJN Namikaze)\n* ROCN Min Jiang (Fu Ling) PC-107 (ex Hai Hong, SC-402, ex IJN # 9)\n* ROCN Qu Jiang (Yang Long) PC-106 (ex Hai Hong, SC-401, ex IJN # 49)\n*ROCN Chang De (ex IJN Seta)\n* ROCN Yong Jing PF-75 (ex IJN Saishū)\n* ROCN Jie 29 (ex IJN Kuroshima)\nType C escort ship\n* ROCN Rui An (Ying Kou, ex IJN # 67)\n* ROCN Huang An (ex IJN # 81)\n* ROCN Ji An (ex IJN # 85)\n* ROCN Chao An (ex IJN # 107)\n* ROCN Chang An (ex IJN # 205)\n* ROCN Jie 8 (ex IJN # 215)\nType D escort ship\n* ROCN Jie 6 (ex IJN # 14)\n* ROCN Cheng An PF-72 (ex IJN # 40)\n* ROCN Tai An PF-71 (ex IJN # 104)\n* ROCN Jie 12 (ex IJN # 118)\n* ROCN Tong An (ex IJN # 192)\n* ROCN Wei Hai (ex IJN # 194)\n* ROCN Jie 14 (ex IJN # 198)\nReferences\nExternal links==\n*[http://navy.mnd.gov.tw/Publication.aspx?CurrentNodeID=536&Level=2 ROCN active duty vessels]\n*[http://www.globalsecurity.org/military/world/taiwan/navy.htm ROCN from GlobalSecurity]"
    }
  ]
}