{
  "content": [
    {
      "type": "text",
      "text": "# List of Union Civil War monuments and memorials\n\nThis is a list of American Civil War monuments and memorials associated with the Union. Monuments and memorials are listed below alphabetically by state. States not listed have no known qualifying items for the list.\nWashington, D.C.\nsculpted by Daniel Chester French \"He saved the Union\"]]\n* Civil War Monuments in Washington, D.C., includes monuments to 16 Union generals, admirals and others\n* Lincoln Statue by sculptor Lot Flannery, 1868\n* Abraham Lincoln by Vinnie Ream, located in the Capitol Rotunda, 1871\n* General John A. Rawlins, Joseph A. Bailly, sculptor, 1874\n* Brevet Lt. General Winfield Scott, Henry Kirke Brown, sculptor, 1874\n* Emancipation Memorial, Thomas Ball, sculptor, 1876\n* Major General James B. McPherson, Louis Rebisso, sculptor 1876\n* Peace Monument, 1877\n* Major General George Henry Thomas, 1879\n* Admiral David G. Farragut, 1881\n* Pension Building frieze, Caspar Buberl sculptor, 1887\n* The Warrior, James A. Garfield Monument, J.Q.A. Ward, sculptor,  1887\n* General Winfield Scott Hancock, 1896\nfrieze, Caspar Buberl sculptor, 1887]]\n* Major General John A. Logan, 1901\n* General William Tecumseh Sherman Monument, 1903\n* Major General George B. McClellan, 1907\n* Equestrian statue of Philip Sheridan, 1908\n* Stephenson Grand Army of the Republic Memorial, 1909\n* Dupont Circle Fountain, 1921\n* Lincoln Memorial, 1922\n** Lincoln seated statue sculpted by Daniel Chester French and carved by the Piccirilli Brothers\n** \"The Gettysburg Address\" carved inscription\n** Second Inaugural Address carved inscription\n* Ulysses S. Grant Memorial, 1924\n* Nuns of the Battlefield, 1924\n* George Gordon Meade Memorial, Charles Grafly, sculptor, 1927\n* African American Civil War Memorial, 1997\n** U Street (WMATA station), which contains \"African-American Civil War Memorial/Cardozo\" in its subtitle.\n* American Red Cross National Headquarters, 1917\n* Statue of Joseph Wheeler, Berthold Nebel, artist, 1925\n* Monument honoring the 1864 Washington Arsenal explosion\nU.S. Currency\n* U.S. one-cent coin\n** Lincoln's Bust, depicted on Front since 1909\n** Lincoln Memorial, depicted on Back from 1959 – 2008\n** Lincoln Bicentennial, depicted on Back in 2009\n* U.S. five-dollar bill\n** Lincoln's Portrait, depicted on Front since 1914\n** Lincoln Memorial, depicted on Back since 1929\n* U.S. fifty-dollar bill\n** Grant's Portrait, depicted on Front since 1913\n* U.S. Postage Stamps\n** Abraham Lincoln Postage, 2nd in number for Presidents of US Stamps issues including 1866, 1869, 1890, 1903, 1938, 1954, 1965, 1995\n** US 5-cents commemorative stamp, 1963\nUS military\nBases\n* Fort Greely, Alaska (1942) named in honor of Major General Adolphus Greely.\n* Fort Logan / Fort Logan National Cemetery, Colorado (1889) named in honor of General John A. Logan. Closed in 1960.\n* Fort Sheridan, Illinois (1888), named for Gen. Philip Sheridan. Closed in 1993.\nGallery\nFile:Vinnie Ream - Lincoln.jpg|Abraham Lincoln by Ream\nFile:Garfield_Mon,_Washington_DC,_Warrior.jpg|Warrior, James A. Garfield Monument\nFile:Allegorical_detail_\"Fame\"_from_Gen._Meade_Monument.jpg|Fame from the George Gordon Meade Memorial\nFile:Grant_Memorial,_detail,_H_Shrady_sc.jpg|Ulysses S. Grant Memorial\nArizona\n* Picacho Peak State Park, Stone Monument Shaft. Erected by the Arizona Pioneers Historical Society and Southern Pacific Railroad Company on April 15, 1928. It commemorates the 3 Union soldiers who lost their life during the Battle of Picacho Pass and list their names. The dedication was a grand ceremony with many people attending and multiple organizations including the Woman's Relief Corps, Daughters of the American Revolution, and the Grand Army of the Republic. In the 21st century a plaque dedicated to the Confederate veterans which was on a wall by the stone monument was removed and it was cemented on the bottom of the Union plaque. The plaque was later stolen.\n* Southern Arizona Veterans Memorial Cemetery. A small flagstone with a Grand Army of the Republic medal on the front of it honors the dead Union veterans within the cemetery. The stone was erected in the 2000s by the Sons of Union Veterans of the Civil War Camp Negley Post of Tucson and the Burnside Post of Tombstone.\n* Southern Arizona Veterans Memorial Cemetery. A small flagstone that commemorates the 18 California Volunteers Union veterans and one colored troop buried in the cemetery. Erected by the Sons of Union Veterans of the Civil War, Department of California.\n* Prescott, Arizona. Plaque dedicated to the memory of the more than 50 Union Veterans buried with Citizens' Cemetery and their pioneer spirit that led to Arizona's statehood in 1912. Dedicated by the Sons of Union Veterans of the Civil War, Department of the Southwest on August 17, 2022.\n* Tombstone, Arizona. Oldest Union monument in the State of Arizona erected \"In memory of the comrades of Burnside Post G.A.R.\" dedicated on May 30, 1887, and is placed at the Old Tombstone Cemetery.\nArkansas\n*Gentry\n**Gentry Grand Army of the Republic Memorial, installed in 1918, listed on the National Register of Historic Places in 2016\n* Grant County, Arkansas is named after Ulysses S Grant, 1869\n* Judsonia, Arkansas: Grand Army of the Republic Memorial, obelisk surrounded by 16 union soldier graves, 1894\n* Leola, Arkansas: Officers Killed / Union Wounded Memorial (2015)\n* Little Rock,\n** Minnesota Monument, in the Little Rock National Cemetery in 1916.\n* Pea Ridge, Arkansas: Reunited Soldiery Monument (1889), one of the first to honor both Union and Confederate soldiers to be placed on a battlefield.\n* Prairie Grove Battlefield State Park:\n** Generals James G. Blunt and Francis J. Herron Memorial\n** Lieutenant Colonel John C. Black Marker\n* Sheridan is named after Union general Phillip Sheridan during the Reconstruction Era.\n* Siloam Springs, Arkansas: Grand Army of the Republic Memorial (Siloam Springs, Arkansas), 1928\nFile:Downtown Siloam Springs, AR 023.jpg|Sloan Springs\nFile:Minnesota Monument.JPG|Little Rock\nCalifornia\n* Monument to volunteers from Los Gatos\n* 'G.A.R. Monument' 'Old Eli', located in Sacramento, CA, dedicated 1899-09-09\n* 'The Hostess House War and Veterans Memorial', located in Palo Alto, CA, dedicated 1901-01-01\nSchools\n* Lincoln Elementary School in Newark\n* Lincoln Elementary School in Oakland\nColorado\ngrounds]]\n* Garfield County was named after James A. Garfield, 1883\n* \"Soldier's Monument\", Colorado State Capitol grounds, Jack (or John) Howland, sculptor, dedicated July 24, 1909\n* Statue of a standing soldier in Grandview Cemetery, Fort Collins.\n* Civil War Seacoast Mortar in Manitou Springs.\n* Memorial Sundial in City Park, Denver.\nConnecticut\n* Soldiers' Monument in Bristol, Connecticut, ca. 1865\n* Soldiers and Sailors Memorial Arch, Hartford, 1886\n* Joseph Roswell Hawley rondel, Connecticut State Capitol, Herbert Adams  1878\nSchools\n* Lincoln College of Technology in East Windsor\n* Lincoln College of New England in Southington, 2010 (formerly known as Briarwood College)\nDelaware\n* General Alfred Thomas Archimedes Torbert, Milford, erected in 2008\n* Rear Admiral Samuel Francis Du Pont, originally erected in Dupont Circle, Washington D.C. in 1884, moved to Rockford Park, Wilmington in 1920\n* Soldiers and Sailors Monument (Delaware), Wilmington, erected in 1871\nFlorida\nThese are arranged by city:\n* 2nd Regiment Infantry, U.S. Colored Troops Monument, Centennial Park, Fort Myers, dedicated in 2000\n* Union Soldier's Memorial, Evergreen Cemetery, Jacksonville, erected in 1891\n* Forgotten Soldier Memorial, in honor of African-American soldiers, Bayview Park, Key West, unveiled February 16, 2016\n* Obelisk at Clinton Square, Bayview Park, Key West, circa 1866\n* Monument Park, Lynn Haven, dedicated in 1920\n* G.A.R. Memorial, Woodlawn Cemetery, Miami, dedicated on April 12, 1939\n* G.A.R. Monument, Greenwood Cemetery, Orlando, 1910\n* G.A.R. Monument, Veterans Park, St. Cloud, erected in 2000\n* Unknown Soldiers Monument, Mount Peace Cemetery, St. Cloud, 1915\n* Union Monument, Greenwood Cemetery, St. Petersburg, erected in 1900\n* Daughter of Union Veterans Monument, Oaklawn Cemetery, Tampa\n* In Memory of Our Union Veterans, Woodlawn Cemetery, Tampa\nSchools\n* Old Lincoln High School (also known as Lincoln Academy) in Tallahassee, 1869. School closed in 1967–68.\n* Lincoln High School (Tallahassee, Florida)\n* Lincoln High School (Gainesville, Florida)\nGeorgia\n* Illinois Monument, 1914\n* Wilder Brigade Monument, 1899\nFile:Monument to the Illinois soldiers who died on 27 June, 1864. Kennesaw Mountain National Battlefield Park, Marietta, Georgia.jpg|Illinois Monument\nFile:John T Wilder monument Chickamauga.jpg|Wilder Brigade Monument\nIllinois\n* Soldiers' Monument (Freeport, Illinois), 1871\n* Civil War Memorial (Sycamore, Illinois), 1896\n* General John A. Logan Monument, Augustus Saint-Gaudens and A. Phimister Proctor, sculptors, Grant Park, Chicago, 1897\n* The Soldiers' Monument, Oregon, Lorado Taft, sculptor 1916\n* Statue of Richard J. Oglesby, Chicago, Leonard Crunelle, 1919\n* General Philip Henry Sheridan, Gutzon Borglum, sculptor, Chicago, 1923\n* Grand Army of the Republic Memorial Woods in River Forest, part of the Forest Preserve District of Cook County\n* Ulysses S. Grant Monument, Lincoln Park, Chicago, 1891\nSchools\n* Lincoln College (Illinois) private in Lincoln, 1865. Was the first establishment named for Abraham Lincoln and the only one during his lifetime.\n* Lincoln College of Technology in Melrose Park\n* Carterville\n** John A. Logan College, 1967\n* Springfield,\n** Lincoln Land Community College, 1967\n** The Lincoln Academy of Illinois, 1964\nFile:Civil War Monument, Oregon IL. USA, 1916, Lorado Taft sc.jpg|Oregon\nFile:Logan statue Grant Park Chicago.jpg|Gen. Logan. Chicago\nFile:Gen. Sheridan by Borglum, Chicago.jpeg|General Sheridan, Chicago\nFile:Richard Oglesby Monument Lincoln Park Chicago 2019-2403.jpg|Richard J. Oglesby\nIndiana\n, detail]]\n* Soldiers and Sailors Monument (Delphi, Indiana), 1888\n* Soldiers' and Sailors' Monument (Indianapolis), 1888\n* Corydon: Corydon Battle Site is a memorial to both sides that fought in the Civil War Battle of Corydon.\n* Colonel Richard Owen (bust), presented by Confederate organizations in honor of Union prison war camp director\n* Lincoln Bank Tower, 3 panels, Pioneer Backwoodsman, Preservation of the Union and Emancipation Proclamation Fort Wayne, Indiana, 1930\nFile:Civil_War_Monument,_Delphi_IN,_USA_ca._1888.jpeg|Delphi\nFile:Lincoln,_Preservation_of_the_Union.jpeg|Preservation of the Union, Lincoln Bank Tower\nIowa\n* Abraham Lincoln Statue and Park, Clermont, dedicated June 19, 1903, erected in memory of Civil War soldiers and sailors\n* Soldier's Monument (Davenport, Iowa), 1881\n* Sac City Monument Square Historic District, Sac City\n** General Sherman Hall; honors service of William T. Sherman 1892\n** Memorial Statue; 19 foot tall granite and bronze monument of Sherman unveiled Nov. 23 1894\n** 4 Civil War Cannon; \"whether it was idle curiosity or absence of thought that caused Phil Schaller to fire one of the cannon to awaken the town on July 4, 1895, one will never know. The force of the cannon fire broke all the windows on the south side of the court house and many windows in the Main Street business district. (Sac City, Iowa, p. 19)\"\n* Soldiers and Sailors Monument, Des Moines, Carl Rohl-Smith, sculptor, 1896\n* Clayton County Soldiers' and Sailors' Monument, Elkader, W. H. Mullins Company\nSchools\n* Lincoln Elementary School in Manchester, 1916\nFile:Soldiers_&_Sailors_monument,_Des_Moines_IA,_USA.jpg|Soldiers and Sailors Monument, Des Moines\nFile:Soldiers_and_Sailors_Monument,_Des_Moines,_IA,_USA.jpg|Soldiers and Sailors Monument, Des Moines, detail\nFile:ElKander_IA,_USA,_Civil_War_Monument_1916.jpg|Elkader\nFile:Ekander_IA,_USA_Civil_War_monument,_detail,_1916.jpg|Elkader detail\nKansas\nAccording to Kansas Civil War Monuments and Memorials, there are 105 counties in Kansas most have a monument to Union soldiers of the Civil War. Many were funded by GAR posts or Sons of Union Civil War Veterans, today the Sons of Union Veterans of the Civil War.\nMonuments and memorials in Kansas include:\n* Kinsley Civil War Monument, in Hillside Cemetery, Kinsley, Kansas, listed on the National Register of Historic Places in Edwards County\n* Sherman County, Kansas, named after General William Tecumseh Sherman, 1873\n* Grant County, Kansas is a county in Kansas named after Ulysses S. Grant, commanding general of Union Army during the Civil War, 1888\n* Ulysses, Kansas is a city named after Ulysses S. Grant, 1885\n* McPherson, Kansas and McPherson County are named after Union General James McPherson. There is also a monument to him and another monument to Union Civil War soldiers fighting for him. The monument was erected in 1917.\n* Baxter Springs Civil War Monument erected in 1886 after Grand Army of the Republic (GAR) post collected more than 7,000 signatures from former soldiers. The monument is located in the Soldier's Lot of the Baxter Springs Cemetery, and is dedicated to the 132 soldiers who died in the Battle of Baxter Springs October 8, 1863.\n*Grand Army of the Republic (GAR) Memorial Arch, erected 1898 in Junction City, Kansas, NRHP-listed\nKentucky\n* Battle of Tebb's Bend Monument, near Campbellsville.  It includes a historical marker from state of Michigan, commemorating the Union soldiers, mostly immigrants from the Netherlands, who were given battle orders in Dutch.\n* GAR Monument, Covington, 1929.\n* Veteran's Monument, Covington.  One of only two monuments in Kentucky to both Union and Confederate war dead, 1933.\n* Colored Soldiers Monument, Frankfort's Green Hill Cemetery. One of the relatively few monuments to black soldiers that participated in the American Civil War, 1924.\n* Captain Andrew Offutt Monument,  Lebanon, 1921.\n* Confederate-Union Veterans' Monument, Morgantown at the Butler County Courthouse, 1907.\n* 32nd Indiana Monument, near Munfordville.  The oldest surviving memorial to the Civil War, 1862.\n* Union Monument, Perryville, 1928.\n* Union Monument, Vanceburg, 1884.\nLouisiana\n* Grant Parish, Louisiana is named after Ulysses S Grant, 1869.\nMaine\n* Memorial Hall (Oakland, Maine), 1870.\n* Caribou Veterans Memorial Park Statue (Saint-Leonard, Maine), 1918.\n* Monument Square (Portland, Maine), which includes the Portland Soldiers and Sailors Monument by sculptor Franklin Simmons, 1891.\n*Farmington Civil War Memorial (Phillips, Maine), 1903\n*Wilton's Standing Soldier Monument (Phillips, Maine), 1912\n*Oak Grove Civil War Memorial (Dayton, Maine), 1902\n*Bowdoin Civil War Memorial (Woodstock, Maine), 1907\n*Houlton Civil War Monument (Florencevlle-Bristol, Maine), 1909\nFile:Civil War memorial, Auburn, Maine.jpg|Auburn\nFile:Civil War Monument Augusta 5.JPG|Augusta\nFile:Civil War Memorial in Bethel, Maine.jpg|Bethel\nFile:Civil War Memorial, Kennedy Park, Lewiston, Maine detail.jpg|Lewiston\nFile:Our Lady of Victories statue, Portland, Maine.jpg|Our Lady of Victories, Portland\nFile:Civil War memorial, Evergreen Cemetery, Portland Maine.jpg|Evergreen Cemetery, Portland\nFile:Eastman Park, Saco Maine.jpg|Saco\nFile:Civil War Memorial in Riverbank Park, Westbrook, Maine.jpg|Westbrook\nFile:Civil War Monument in York, Maine.jpg|York\nMaryland\n* United States Colored Troops Memorial Statue (Lexington Park, Maryland), 2012\n* Union Soldiers and Sailors Monument in Baltimore, 1909\n* The American Volunteer (statue), Antietam National Cemetery, Sharpsburg\n* Monuments at Antietam National Battlefield\nMassachusetts\n* Memorial Hall (Dedham, Massachusetts)\n* Civil War Memorial, Framingham, Martin Milmore, sculptor, 1872\n* Civil War Monument (Great Barrington, Massachusetts), 1876\n* Civil War Memorial (Webster, Massachusetts), 1907\n* Equestrian statue of Charles Devens, 1906\n* Memorial Hall (Harvard University), Cambridge, 1878\n* Robert Gould Shaw Memorial (Boston), 1884\n*Soldiers' and Sailors' Monument (Arlington) 1887\n* Soldiers and Sailors Monument (Boston), 1887\n* Soldiers' Monument (Worcester, Massachusetts), 1874\n* The Rockery, Easton, 1882\n* Charlestown Civil War Memorial\n* North Adams, Massachusetts\nFile:Civil War memorial, Capron Park, Attleboro, Massachusetts.jpg|Attleboro\nFile:General Charles Devens Statue by Daniel Chester French - 2011-09-25.jpg|Devens Monument\nFile:Robert Gould Shaw Memorial (36053).jpg|Robert Gould Shaw Memorial (Boston)\nFile:Boston - park 07.JPG|Boston Common\nFile:Sanders theater .jpg|Memorial Hall (Cambridge)\nFile:Civil War Monument, Cambridge, MA - side view.jpg|Cambridge\nFile:Civil War Memorial in Easton, Massachusetts.jpg|Easton\nFile:Civil War Memorial, Framingham, Massachusetts, 1872.jpeg|Framingham\nFile:Civil War Memorial in Arlington, Massachusetts.jpg|Arlington\nFile:Civil War Memorial - Grafton, MA - DSC04550.JPG|Grafton\nFile:Civil War Monument, Great Barrington, Massachusetts.jpg|Great Barrington\nFile:Civil War memorial, Clasky Common Park, New Bedford, Massachusetts.jpg|New Bedford\nFile:Pittsfield MA Civil War memorial - panoramio (6).jpg|Pittsfield\nFile:Civil War memorial at Raynham Public Library; Raynham, MA.jpg|Raynham\nFile:Soldiers and Sailors Monument in Sandwich Massachusetts.jpg|Sandwich\nFile:Civil War Monument - Springfield, MA - DSC03240.JPG|Springfield\nFile:Civil War Monument and Town Hall, Waltham, MA.JPG|Waltham\nFile:Webster MA Civil War memorial.jpg|Webster\nFile:Civil War Memorial in Whitinsville, Massachusetts.jpg|Whitinsville (Northbridge)\nMichigan\n*\n* Michigan Soldiers' and Sailors' Monument, Randolph Rogers, sculptor; (Detroit), 1867\n* Civil War Memorial (Adrian, Michigan), 1870\n* Kent County Civil War Monument, Veterans Memorial Park, Grand Rapids, American (White) Bronze Company 1885\n** also in Veterans Memorial Park: The Commandery Of The State Of Michigan Marker, In memory of Grand Army of Republic Marker, Civil War Veterans Memorial Marker\n* Defense of the Flag, Withington Park, Lorado Taft, Jackson, Michigan, 1904\n* Abraham Lincoln Monument (Ypsilanti, Michigan), 1938\nFile:For Those Who Gave All....jpg\n* Soldiers’ and Sailors’ Monument, 1887, Hastings, Michigan in Tyden Park\n* First Michigan Sharpshooters Monument (Lansing), 1915\n* Grand Army of the Republic Memorial (Lansing), 1924\n* First Regiment Michigan Engineers Monument (Lansing), 1912\n* Austin Blair Monument (Lansing), 1898\nMinnesota\n* Grant County, Minnesota is named after Ulysses S Grant\n* A monument to all Union soldiers and sailors is located in Bridge Square in Northfield, Minnesota.\nMississippi\n* Monument to United States Colored Troops (1st and 3rd Mississippi Infantry, African Descent) at Vicksburg National Military Park. The inscription reads: \"Commemorating the Service of the 1st and 3d Mississippi Infantry, African Descent and All Mississippians of African Descent Who Participated in the Vicksburg Campaign.\"\n* Monument to the 18th Wisconsin Volunteer Infantry Regiment at Vicksburg National Military Park.\n* Monument to admiral David Farragut at Vicksburg National Military Park. Henry Hudson Kitson, sculptor\n* The Illinois Memorial at Vicksburg National Military Park. Commemorating the 36,325 Illinois soldiers who participated in the Vicksburg Campaign and has 47 steps, one for every day Vicksburg was besieged.\n* Kentucky memorial composed of bronze statues of Abraham Lincoln and Jefferson Davis, both native Kentuckians, Vicksburg National Military Park.\n* The Michigan Memorial at Vicksburg National Military Park.\nMonuments and Memorials at Vicksburg National Military Park\nFile:18WisInfMonument.jpg|18th Wisconsin VI\nFile:Statue of David Glasgow Farragut at the Vicksburg National Military Park.jpg|David Farragut Monument\nFile:Illinois Monument.jpg|Illinois Memorial\nFile:22-26-190-kansas.jpg|Kansas Memorial\nFile:Lincoln and Davis Statue 2.jpg|Kentucky Memorial\nFile:Vicksburg National Military Park, Mississippi, US (18).jpg|Michigan Memorial\nFile:Missouri Memorial, Vicksburg National Military Park.jpg|Missouri State Memorial\nMissouri\n* Attorney General Edward Bates statue in Forest Park, St. Louis, dedicated 1876\n* General Francis Preston Blair Jr. statue in Forest Park, St. Louis, dedicated 1885\n* General Franz Sigel statue in Forest Park, St. Louis, dedicated 1906\n* General Ulysses S. Grant statue on the grounds of City Hall, St. Louis, dedicated 1888\n* Grant City, Missouri is named after General Ulysses S. Grant\n* Lincoln, Missouri is named after Abraham Lincoln\n* Lyon Park in St. Louis is named after Brigadier-General Nathaniel Lyon\n* President Abraham Lincoln statue on the grounds of City Hall, Kansas City, by sculptor Lorenzo Ghiglieri, dedicated 1986\nSchools\n* Lincoln College Preparatory Academy in Kansas City\n* Lincoln University in Jefferson City\nMontana\n]]\n* Garfield County was named after James A. Garfield\nNebraska\n* Grant County, Nebraska is named after Ulysses S Grant\n* Garfield County was named after James A. Garfield\n* Emancipation Proclamation panel, Nebraska State Capitol, Lincoln, Nebraska, Lee Lawrie, sculptor,  (1932)\n* Lincoln, Nebraska is named after Abraham Lincoln\n* Civil War Memorial statue in Blair, Nebraska\n* U.S. Route 6, running through the entirety of Nebraska, is named Grand Army of the Republic Highway\nNew Hampshire\n]]\n* a casting of the Robert Gould Shaw Memorial is located at the Saint-Gaudens National Historic Site in Cornish, New Hampshire, Augustus Saint-Gaudens sculptor, originally cast in 1897.\nNew Jersey\n* Monument to Strong Vincent, dedicated 1879-07-04\n* Lamington Black Cemetery Marker, located in Bedminster, NJ\nSchools\n* Lincoln Tech in Newark, 1946\nNew Mexico\n* Grant County, New Mexico is named after Ulysses S Grant\n* Santa Fe, New Mexico Soldiers' Memorial dedicated to the Federal Troops that fought in the Battle of Val Verde. Monument was destroyed on Oct 20, 2020 and never restored.\nNew York\n* Elmira Prison, where Confederate POWs were held; also site of Camp Rathbun, where soldiers trained.\n* Seventh Regiment Memorial, New York City, John Quincy Adams Ward, sculptor 1869/1874\n* Soldiers and Sailors Monument (Buffalo, New York), Caspar Buberl, sculptor, 1882\n* Lewis County Soldiers' and Sailors' Monument, Lowville in Lewis County, 1883.\n* Soldiers and Sailors Monument (Troy, New York), 1890\n* Soldiers' and Sailors' Arch (Brooklyn), 1892\n* Sherman Monument, Grand Army Plaza in Manhattan, New York, Augustus Saint-Gaudens, 1902\n* Soldiers' and Sailors' Monument (Manhattan), 1902\n* Soldiers and Sailors Monument (Syracuse), 1910\n* Cattaraugus County Civil War Memorial and Historical Building, Little Valley, NY (1914)\nSeventh Regiment memorial, NYC, 1869.jpg|Seventh Regiment Memorial\nSherman Monument, NY 1902.jpg|Sherman Monument\nBuffalo NY, USA civil War monument.jpg|Buffalo\nNorth Carolina\nSchools\n* Lincoln Academy in Kings Mountain, 1886\n*Salisbury national cemetery, Union monument, 1876\n*Salisbury national cemetery, Maine monument, 1908\n*Salisbury national cemetery, Pennsylvania monument, 1910\n*New Bern national cemetery, Connecticut monument, 1894\n*New Bern national cemetery, New Jersey monument, 1905\n*New Bern national cemetery, Massachusetts monument, 1908\n*New Bern national cemetery, Rhode Island monument, 1910\n*Hertford, US colored troops monument, 1910\n*Goldsborough Bridge battle, (jointly with CSA troops)\n*Averasboro, 20th Corps monument, 2001\n*Bentonville battlefield, Sherman's 4 corps monument, 2013\n*Bentonville battlefield, 123rd New York monument, 2012\n*Bentonville battlefield, horse and mule monument (jointly with CSA), 2011\n*Bennett place, Durham, NC, Unity monument (jointly with CSA), 1923\nNorth Dakota\n* Grant County, North Dakota is named after Ulysses S Grant\nOhio\n* Jewish Civil War Memorial (Cincinnati, Ohio), 1868\n* Circleville Memorial Hall, in Circleville, c.1871\n* Civil War Soldiers Monument (Dayton), 1884\n* Soldiers' and Sailors' Monument (Cleveland), 1894\n*  Phillip Sheridan equestrian statue (Somerset), Carl Heber sculptor, 1905\n** The figure at the top of the monument, for which Private Fair served as the model, was replaced by a bronze version of the same piece in 1993, the Fair statue now serving as another monument.\n* Dayton Memorial Hall, which commemorates the Civil War as well as other wars\n* These Are My Jewels monument (Columbus)\nFile:Soldiers' and Sailors' Monument (Cleveland).jpg | Soldiers and Sailors Monument in Cleveland\nFile:Hancock County Great Rebellion Memorial.jpg | Hancock County Great Rebellion Memorial in Findlay, Ohio\nOklahoma\n* Ardmore, Oklahoma: Union Monument in front of Veterans Home (old Confederate Home)\n* Enid, Oklahoma: Union Monument in Enid Cemetery to the unknown dead by LGAR (1917)\n* Fort Blunt: abandoned old Fort Gibson, renamed for Maj. Gen. James G. Blunt during Civil War 1862.\n* Garfield County was named after James A. Garfield\n* Grant County, Oklahoma is named after Ulysses S Grant\n* Miami, Oklahoma: GAR Cemetery Monument, obelisk honors dead soldiers by WRC and GAR.\n* Oklahoma City: Union Monument in Fairlawn Cemetery by GAR (1918), later broadened with new plaque to honor all US soldiers.\n* Rentiesville, Oklahoma: Monument to Union Soldiers in Honey Springs Battlefield (1986)\nOregon\n* Grant County, Oregon is named after Ulysses S. Grant.\n* Grants Pass, Oregon is named after Ulysses S. Grant.\n* Daughters of Union Veterans Civil War Memorial, City View Cemetery, Salem\n* Sherman County, Oregon is named after William T. Sherman.\n* Crook County, Oregon is named after George Crook.\nSchools\n* Lincoln Elementary School in Eugene 1953 (converted from prior Woodrow Wilson Junior High School). School closed in 1987 and repurposed as Lincoln School Condominiums.\nPennsylvania\n* List of monuments of the Gettysburg Battlefield, at Gettysburg National Military Park, has numerous Union monuments and memorials\n** 44th New York Monument, 1893, first Gettysburg monument with an observation deck\n** 72nd Pennsylvania Infantry Monument, 1891\n** Army of the Potomac Marker (1908)\n** Brig. Gen. Francis Barlow Statue (1922)\n** Maj. Gen. John Buford Statue (1895)\n** John L. Burns Statue (1903)\n** Father William Corby Statue (1910)\n** Brig. Gen. Samuel W. Crawford Statue (1988)\n** Culp Brothers' Memorial (2013) Near entrance Gettysburg Heritage Center, Honors Confederate Private Wesley Culp and brother Union Army, Lieutenant William Culp (\"brother against brother\").\n** Delaware State Monument (2000)\n** Maj. Gen. Thomas Devin Relief, 6th New York Cavalry Monument (1889)\n** Maj. Gen. Abner Doubleday Statue (1917)\n** Maj. Gen. Abner Doubledays Headquarters Marker, 1st Corps Headquarters Marker (1913)\n** Colonel Augustus van Horne Ellis Statue, 124th New York Infantry Monument (1884)\n** Captain Henry V. Fuller Marker, 64th New York Infantry (1894)\n** Statue of Gen. John Geary, Culp's Hill sculpted by J. Otto Schweizer (c. 1914)\n** Statue of General Alexander Hays, Ziegler's Grove sculpted by J. Otto Schweizer (c. 1914)\n** Statue of General Andrew A. Humphreys, Emmitsburg Road sculpted by J. Otto Schweizer 1919\n** Indiana State Monument (1971)\n** Lincoln Address Memorial, Gettysburn National Cemetery designed by Louis Henrick 1912\n*** Bust of bust of Abraham Lincoln, by Henry Kirke Bush-Brown 1912\n** New York State Monument (1893)\n** New York Auxiliary State Monument (1925)\n** Pennsylvania State Memorial, Gettysburg, 1914 also includes several portrait statues,\n*** Abraham Lincoln (1911–13) by J. Otto Schweizer, west side\n*** Governor Andrew Curtin (1911–13) by William Clark Noble, west side\n*** General George Meade (1911–13) by Lee Lawrie, north side\n*** General John F. Reynolds (1911–13) by Lee Lawrie, north side\n*** General Winfield Scott Hancock (1911–13) by Cyrus Edwin Dallin, east side\n*** General David McMurtrie Gregg (1911–13) by J. Otto Schweizer, east side\n*** General Alfred Pleasonton (1911–13) by J. Otto Schweizer, south side\n*** General David B. Birney (1911–13) by Lee Lawrie, south side\n** Soldiers' National Monument\n** United States Regulars Monument (1909)\n** United States Signal Corps Marker (1919)\n** Vermont State Monument, \"Stannard's Vermont Brigade Monument\" (1889)\n** Statue of Gen Wells, sculpted by J. Otto Schweizer 1914\n* Soldiers and Sailors Monument (Lancaster, Pennsylvania), 1874\n* Soldier's Monument, York, Martin Milmore, sculptor, 1874\n* Dauphin County Veteran's Memorial Obelisk, Harrisburg, by 1876?\n* Soldiers' and Sailors' Monument – Allentown, Edward Gallagher Jr., Henry F. Plaschott, Bartholomew Donovan, sculptors, 1899\n* Smith Memorial Arch, Philadelphia, 1898–1912\n* \"First Defenders\", Allentown, George Brewster, sculptor, 1917\n* Soldiers and Sailors Monument, Easton (1900)\n* Soldiers and Sailors Memorial Bridge, Lee Lawrie, sculptor Harrisburg, Pennsylvania  South pylon is inscribed with the date \"1861,\" (1930)\nSchools\n* Lincoln Elementary School in Pittsburgh, 1931\nFile:Civil_War_monument,_York,_PA,_USA,_1874,_Martin_Milmore,_sc.jpeg|York, Martin Milmore, sculptor\nFile:Pennsylvania State Memorial, Gettysburg, 1914.jpeg|Pennsylvania State Memorial, Gettysburg\nFile:Civil_War_Monument,_Allentown,_PA,_USA_1899.jpeg|Allentown\nFile:Civil_War_Monument,_Allentown,_PA,_USA_,_detail_1899.jpeg|Allentown, detail\nFile:Soldiers' and Sailors' Monument in Beaver.jpg|Beaver\nFile:Civil War Memorial in Easton, Pennsylvania.jpg|Easton\nFile:Civil War Memorial, McKeesport and Versailles Cemetery, 2015-05-25, 01.jpg|McKeesport and Versailles Cemetery\nFile:Statue_of_Gen._Wells_at_Gettysburg.jpg|Gen. Wells\nFile:Gen_AA_Humphreys_statue_by_J_Otto_Schweizer_1919.jpg|Gen. Humphreys\nFile:LincolnGett.JPG|Lincoln Address Memorial, with bust of Abraham Lincoln\nFile:Soldiers_and_Sailors_Memorial_Bridge,_Harrisburg,_PA,_USA.jpeg|Soldiers and Sailors Memorial Bridge, Harrisburg, with date \"1861\"\nRhode Island\n* Equestrian statue of Ambrose Burnside in Burnside Park, Providence, Rhode Island, 1887\n* Soldiers and Sailors Monument (Providence), Rhode Island, 1871\n* Woonsocket Civil War Monument, Woonsocket, Rhode Island, 1868\n* Soldiers' Memorial Fountain (Oak Bluffs, Massachusetts), 1891.\n* The Union Soldier, Roger Williams Park, Providence, Rhode Island (1898). This statue is a replica of an original located at Gettysburg. Cast by the Gorham Manufacturing Company.\nFile:Civil War memorial at Princes Hill Burial Ground, Barrington RI.jpg|Princes Hill Burial Ground, Barrington\nFile:Soldiers Home Monument Bristol Rhode Island-3.jpg|North Burial Ground, Bristol\nFile:Henry Tillinghast Sisson grave and statue-full.jpg|Henry Tillinghast Sisson grave and statue in Little Compton\nFile:Gen. Burnside Monument, Burnside Park, Providence, RI.jpg|Burnside Monument, Burnside Park, Providence\nFile:Soldiers and Sailors Monument Providence RI.jpg|Soldiers and Sailors Monument, Providence\nFile:Union Soldier Monument, Roger Williams Park, Providence, Rhode Island.jpg|Union Soldier Monument, Roger Williams Park, Providence\nFile:Civil War memorial at Warren Common, Rhode Island.jpg|Warren Common, Warren\nFile:Woonsocket Civil War Monument.jpg|Woonsocket\nSouth Dakota\n* Grant County, South Dakota is named after Ulysses S Grant\nTennessee\n* Fort Negley, Nashville. The Fort was built by Union forces after the capture of Nashville.\nTexas\n* Treue der Union Monument, in Comfort\nUtah\n* Salt Lake City, Utah [https://utahstatecapitol.utah.gov/uncategorized/utah-and-the-civil-war-monument Captain Lot Smith Company Memorial]\n* Garfield County was named after James A. Garfield\n* Salt Lake City, Utah Monument dedicated to the GAR dead in the GAR and USAWV Veteran Section of Mt. Olivet Cemetery. Re-dedicated in 2003 by the Sons of Union Veterans.\n* Salt Lake City, Utah Bench dedicated to Civil War Veterans which sits in the GAR Section of Mt. Olivet Cemetery and was erected by the W. O. Howard Woman's Relief Corps in 1939.\nVermont\n* Statue of Gen Wells, in Battery Park (Burlington, Vermont) sculpted by J. Otto Schweizer 1914\nFile:MajGenWilliamWellsStatue.JPG|Gen. Wells in Burlington\nFile:Civil War Monument, Burlington Vermont.jpg|Burlington\nFile:Brattleboro, Vermont Commons and Civil War memorial.jpg|Brattleboro\nFile:Civil War memorial, Chester, Vermont.jpg|Chester\nFile:Civil War memorial, Middlebury, Vermont view.jpg|Middlebury\nFile:Civil War Memorial, The Park, Rochester, Vermont.jpg|Rochester\nFile:Civil War memorial, Swanton, Vermont.jpg|Swanton\nFile:Civil War Memorial in Woodstock, Vermont Tribou Park.jpg|Tribou Park in Woodstock\nFile:Civil War Memorial in Woodstock, Vermont-eagle version.jpg|Woodstock\nVirginia\n* Monuments within Arlington National Cemetery, Arlington\n** Civil War Unknowns Monument, 1865\n** Tanner Amphitheater, built to support early Decoration Day events\n* Charlottesville: Emancipation Park in Charlottesville named in honour of Emancipation Proclamation, 2017\n* Norfolk: West Point Cemetery, Norfolk African-American Civil War Memorial\n* Petersburg:\n** 48th Pennsylvania Monument, in memory Colonel George W. Gowen and 48th Regiment 1907\n** Petersburg National Battlefield: Monument to the United States Colored Troops who fought during the Siege of Petersburg.\n* Portsmouth: Civil War Monument at Lincoln Cemetery (Portsmouth, Virginia)\n* Franklin: General Thomas Highway (Route 671).\nWashington\n* Grant County, Washington is named after Ulysses S Grant.\n* Garfield County was named after James A. Garfield.\n* Grand Army of the Republic Cemetery (Seattle) was established in 1895.\n* Port Angeles, Washington:  Memorial garden in downtown with a plaque honoring the Grand Army of the Republic.\n* Bellingham, Washington: Cornwall Park, the memorial dedicated to the Grand Army of the Republic, Department of Washington and Alaska.\n* Port Orchard, Washington: Veterans Home Cemetery has a memorial obelisk dedicated to the heroes of the Civil War, donated by the Woman's Relief Corps.\nWest Virginia\n* Grant County, West Virginia is named after Ulysses S Grant\n* Grantsville, Calhoun County, West Virginia is named after Ulysses S Grant\n* Wheeling Soldier and Sailors Monument, dedicated in 1883. In 2018 it was moved next to West Virginia Independence Hall.  It was rededicated on 27 May 2018 (Memorial Day Observed).\n* Hancock County, West Virginia Union Monument, dedicated 1886 in front of the Hancock County Courthouse, New Cumberland.\n* Jackson County, West Virginia GAR Monument, in front of Jackson County Courthouse, Ripley.\n* The Mountaineer Monument (1912), placed as a response to the 1910 Stonewall Jackson at the Capitol in downtown Charleston which burned in 1921.  Moved to the new Capitol Complex, Charleston, Kanawha County\n* Soldiers & Sailors Monument (1930), Capitol Complex, Charleston, Kanawha County\nFormer\n* Huntington Union monument dedicated by Bailey Post of the G.A.R. Formerly located at the corner of Fifth Ave. and Ninth St., it was scheduled to be moved to Ritter Park in 1915, but was subsequently lost.\nWisconsin\n*The Victorious Charge, by John S. Conway, located on the Court of Honor on West Wisconsin Avenue in downtown Milwaukee, Wisconsin, United States. The 1898 bronze sculpture is 9'10\" high and sits on a 20' square granite pedestal.\n* [https://www.kenosha.org/images/dev_insp/SoldiersMonument-WingedVictory.pdf Winged Victory], Simmons Library Park, Kenosha Wisconsin (1900)\nFile:VictoriousCharge1898.jpg|The Victorious Charge\nFile:Soldiers and Sailors Monument - Kenosha, WI.jpg|Winged Victory, Kenosha (1900)\nScotland\n* American Civil War Memorial, in Old Calton Burial Ground, in Edinburgh, Scotland\nSee also\n* Memorials to Abraham Lincoln\n* List of memorials to the Grand Army of the Republic\n* Grand Army of the Republic Hall (disambiguation), including numerous memorials in the form of buildings\n*List of Confederate monuments and memorials\n*List of Mexican-American War monuments and memorials\n*List of Korean War memorials\n*List of Vietnam War monuments and memorials\n*List of World War I monuments and memorials\n*List of World War II monuments and memorials\nExternal links\n*[https://www.maine.gov/civilwar/monuments.html Maine Civil War Monuments]\n*[https://macivilwarmonuments.com Massachusetts Civil War Monument Project]\n*[https://www.civilwarmonuments.org Commemorative Cultures Project]\nReferences"
    }
  ]
}