{
  "content": [
    {
      "type": "text",
      "text": "# Listed buildings in Upton, Newark and Sherwood\n\nUpton is a civil parish in the Newark and Sherwood district of Nottinghamshire, England. The parish contains 24 listed buildings that are recorded in the National Heritage List for England. Of these, one is listed at Grade I, the highest of the three grades, two are at Grade II*, the middle grade, and the others are at Grade II, the lowest grade.  The parish contains the village of Upton and the surrounding countryside.  To the east of the parish is a former workhouse, which is listed together with its infirmary.  The other listed buildings are in the village, and consist of a church, headstones in the churchyard, a former country house and its gateway, smaller houses, cottages, farmhouses, and associated structures, a public house and a telephone kiosk.\n__NOTOC__\nKey\n{| class=\"wikitable\n|-\n! Grade\n! Criteria\n|-\n|align=\"center\" |I\n| Buildings of exceptional interest, sometimes considered to be internationally important\n|-\n|align=\"center\" |II*\n| Particularly important buildings of more than special interest\n|-\n|align=\"center\" |II\n| Buildings of national importance and special interest\n|}\nBuildings\n{| class=\"wikitable sortable plainrowheaders\" style=\"width:100%; border:0px; text-align:left; line-height:150%\"\n|-\n! scope=\"col\"  style=\"width:150px\" |Name and location\n! scope=\"col\"  style=\"width:100px\" class=\"unsortable\"|Photograph\n! scope=\"col\"  style=\"width:120px\" |Date\n! scope=\"col\"  style=\"width:650px\" class=\"unsortable\"|Notes\n! scope=\"col\"  style=\"width:50px\" |Grade\n|-\n|St Peter and St Paul's Church\n|\n|align=\"center\"|\n|The church has been altered and extended through the centuries, including a restoration in 1893 by C. Hodgson Fowler.  It is built in stone with tile roofs, and consists of a nave, a north aisle, a north porch, a north aisle chapel, a chancel and a west tower.  The tower has three stages, corner buttresses, a moulded plinth, two string courses, gargoyles, and an embattled parapet with eight crocketed pinnacles, and another pinnacle with a weathercock in the centre of the roof.  On the west side is a doorway with a moulded and chamfered surround, a four-centred arched head and a hood mould, above which is a triple lancet window and three-light bell openings with hood moulds.\n|align=\"center\" |\n|-\n|Hall Croft\n|\n|align=\"center\"|1630–50\n|The house, originally an inn, has a timber-framed core, with brick cladding and a pantile roof.  There are two storeys, a double depth plan, and two bays.  The windows are a mix of sashes, some horizontally-sliding, and casements, and at the rear is a porch.\n|align=\"center\" |\n|-\n|The Old Post Office\n|\n|align=\"center\"|\n|The cottage, once a post office, is in pebbledashed brick, and has a thatched roof.  There is a single storey and an attic, three bays, and a rear lean-to in brick with a pantile roof.  In the centre is a doorway, and the windows are horizontally-sliding sashes, all with segmental heads.\n|align=\"center\" |\n|-\n|Orchard House\n|\n|align=\"center\"|\n|The house is in brick, partly rendered, and has a tile roof with coped gables and kneelers.  There are two storeys, four bays, and a rear lean-to with a pantile roof.  On the front is a porch and a doorway with a segmental head, and the windows are a mix of sashes and casements.\n|align=\"center\" |\n|-\n|Headstones, St Peter and St Paul's Church\n|\n|align=\"center\"|1683–84\n|A group of five headstones commemorating members of the Holmes family who died in 1683 and 1684.  They have chamfered tops and different inscriptions.\n|align=\"center\" |\n|-\n|Cross Keys Inn\n|\n|align=\"center\"|\n|The public house is in colourwashed brick, with floor bands, cogged eaves, and a pantile roof with coped gables and kneelers.  There are two storeys and attics, and an L-shaped plan, with a main range of two bays and a rear wing.  The windows on the street front are sash windows under segmental arches.  In the left return is a doorway with a hood, sash windows in the ground floor, and casement windows above.  The stable to the east has a doorway with a segmental head and casement windows, and beyond is another stable, with a single storey.\n|align=\"center\" |\n|-\n|Green Door Cottage\n|\n|align=\"center\"|\n|The cottage has a timber-framed core, it is encased in brick, and has dentilled eaves and a pantile roof.  The central doorway has a segmental head, the windows on the front are horizontally-sliding sashes, one with a segmental head, and in the south gable is a casement window.\n|align=\"center\" |\n|-\n|Candant House\n|\n|align=\"center\"|\n|The house is in whitewashed brick on a plinth, with a floor band, cogged eaves, and a roof of tile and pantile with one coped gable.  There are two storeys and three bays, the left bay projecting and gabled, and a rear lean-to.  The doorway has a geometrical fanlight, and the windows are a mix of sashes, some horizontally-sliding, and casements.\n|align=\"center\" |\n|-\n|High Farm House\n|\n|align=\"center\"|\n|The farmhouse is in brick, with a floor band, cogged eaves, and a pantile roof with coped gables and kneelers.  There are two storeys and an L-shaped plan, with a front range of two bays and a rear wing.  In the centre is a gabled latticed porch and a doorway with a fanlight, the windows on the front are sashes, and the ground floor openings have segmental heads.  In the rear wing are casement windows.\n|align=\"center\" |\n|-\n|Barns and stable, High Farm\n|\n|align=\"center\"|\n|The two threshing barns and stable are in brick on a partial plinth with plain and cogged eaves, and pantile roofs with two coped gables and kneelers.  The eastern barn has three bays, and contains stable doors and a square pitching hole, and to the left is a cartshed.  The western barn has three bays, and contains barn doors with stone imposts, and both barns have vents.  The stable, dating from the 19th century, has two storeys and a single bay, and contains a stable door with a segmental head.\n|align=\"center\" |\n|-\n|Manor Farmhouse\n|\n|align=\"center\"|\n|The farmhouse is in brick, with a floor band, cogged eaves, and roof of tile and pantile with coped gables and kneelers.  There are two storeys and attics and an L-shaped plan, with a front range of three bays, the left bay projecting and gabled, and a rear wing.  On the front is a gabled porch and a doorway with a fanlight, and sash windows, one with a segmental head.  On the west front is a bow window.  Adjoining on the east are farm buildings with a single storey and three bays.\n|align=\"center\" |\n|-\n|Upton Grange and walls\n|\n|align=\"center\"|\n|A brick house with cogged eaves and a hipped slate roof.  There are three storeys and a basement, and a square plan with fronts of three bays.  In the centre of the main front is a porch with fluted Doric columns and antae, a foliate frieze, a cornice with guttae, and a flat lead roof, and the doorway has a fanlight.  The windows are sashes with rubbed brick heads and splayed rendered lintels.  The boundary wall is in brick with stone coping, and extends for about .  It contains two panelled square piers with concave pyramidal caps.  The garden wall is in brick with ramped stone coping, it extends for about , and contains a single gate pier, and re-sited dated and initialled rainwater heads.\n|align=\"center\" |\n|-\n|Barn, Chapel Farm\n|\n|align=\"center\"|\n|A threshing barn in red brick, with plain eaves, and a pantile roof with coped gables.  There is a single storey and three bays, and the barn contains doorways and vents.\n|align=\"center\" |\n|-\n|Babthorpe Cottage\n|\n|align=\"center\"|\n|Originally an almshouse, it is in red brick with a pantile roof, a single storey and two bays.  In the garden front is a doorway, over which is a wooden lintel extending to the right over two horizontally-sliding sash windows and a lean-to with a fixed light.\n|align=\"center\" |\n|-\n|Town Farmhouse, cottages and pump\n|\n|align=\"center\"|\n|The buildings are in brick with cogged eaves and pantile roofs.  The farmhouse has two storeys and two bays.  The windows on the front are sashes, those in the ground floor with segmental rubbed brick heads.  In the gable end is a doorway with moulded jambs and a sash window,  The cottages have two bays, and contain doorways with plain jambs and horizontally-sliding sash windows.  Beyond them is a cartshed, and adjoining the house is a lead water pump with a timber case and a straight iron handle.\n|align=\"center\" |\n|-\n|Wisteria Cottage\n|\n|align=\"center\"|\n|The cottage is in brick with cogged eaves and a pantile roof.  There are two storeys, two bays, and a rear lean-to.  In the centre is a gabled latticed timber porch, and the windows on the front are sashes, those in the ground floor with segmental rubbed brick heads.  In the gable ends and the lean-to are casement windows.\n|align=\"center\" |\n|-\n|Greet House\n|\n|align=\"center\"|1824\n|The workhouse designed by William Nicholson, later a museum, is in red brick with stone dressings and a hipped slate roof.  There are three storeys, the middle three bays are canted, with a porch on the front, and a short wing at the rear, and they are flanked by seven-bay wings.  The porch has a rusticated surround and a pediment, and contains a doorway with a semicircular fanlight.  Above the doorway is a recessed round-headed panel containing a window and a semicircular blocked opening.  Most of the windows are casements with cast iron glazing and segmental heads.\n|align=\"center\" |\n|-\n|Farm Buildings, Dairy Farm\n|\n|align=\"center\"|\n|The farm buildings, which have been converted for residential use, consisted of a barn, a stable and a pigeoncote. They are in red brick with cogged eaves and pantile roofs.  The barn has a single storey and three bays, and contains doorways, square pitching holes and vents.  The stable and pigeoncote have three storeys and two bays, and contain stable doors and blocked casement windows with segmental heads, and above are two tiers of pigeonholes.  In the south gable are pigeonholes and perches.\n|align=\"center\" |\n|-\n|Crop House\n|\n|align=\"center\"|1829\n|The house is in brick, with cogged and dentilled eaves, and hipped roofs of slate and pantile.  There are two storeys, and a front range of three bays, and a rear wing.  In the centre is a doorway with a reeded surround, a geometrical fanlight and an open pediment.  Above the doorway is a blank panel, and the windows on the front are sashes, all with splayed rendered lintels. In the rear wing is a doorway with a segmental head, and a separate glazed porch.\n|align=\"center\" |\n|-\n|Upton Hall\n|\n|align=\"center\"|\n|A country house incorporating an earlier house, it was extended in 1875, and later used for other purposes.  The house is in colourwashed stuccoed brick on a plinth, with a moulded string course and cornice, moulded eaves, coped parapets, and slate roofs with a dome in a balustraded and railed enclosure.  It is in two and three storeys and has a main front of seven bays.  In the centre is a tetrastyle portico with Ionic columns, a foliate frieze and a pediment with antae.  There are three French windows flanked by fluted cast iron urns. The windows are sashes with pilasters and panelled friezes.  To the left is a two-storey bow window with Ionic pilasters.\n|align=\"center\" |\n|-\n|Gateway, Upton Hall\n|\n|align=\"center\"|1832\n|The gateway is in stuccoed brick on a stone plinth, with stone coping, and a stone cornice and parapet.  It consists of a round-headed arch flanked by recessed panels. At the top is a stepped parapet containing a foliate panel, over which is a scallop crest.  On the sides are recessed round-headed panels, and inside the arch are casts from the Parthenon frieze.\n|align=\"center\" |\n|-\n|The Hollies and wall\n|\n|align=\"center\"|\n|A brick house on a rendered plinth, with bracketed eaves at the front, cogged eaves at the rear, and a pantile roof.  There are two storeys and three bays, and a single-storey three-bay wing on the left.  The doorway in the centre of the main block has a fanlight, the windows are sashes, and all have segmental heads.  In the wing is a stable door and a sash window, both with segmental heads, and three small casement windows.  At the rear is a doorway with a gabled hood, and in front of the house is a dwarf stone wall with a  wrought iron railing, and two gates with square iron piers with urn finials.\n|align=\"center\" |\n|-\n|Former Infirmary, Greet House\n|\n|align=\"center\"|1871\n|The infirmary was an outbuilding at The Workhouse, Southwell, and was designed by William Nicholson.  It is in red brick with slate roofs.  The south front has eleven bays, the central section has two storeys and the wings have a single storey.  The doorways have fanlights and the windows are casements.  The north front has ten bays.\n|align=\"center\" |\n|-\n|Telephone kiosk\n|\n|align=\"center\"|1935\n|The K6 type telephone kiosk in Main Street was designed by Giles Gilbert Scott.  Constructed in cast iron with a square plan and a dome, it has three unperforated crowns in the top panels.\n|align=\"center\" |\n|-\n|}\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}