{
  "content": [
    {
      "type": "text",
      "text": "# List of international presidential trips made by Javier Milei\n\n(in light blue) and Argentina (in purple).]]\nThis is a list of international presidential trips made by Javier Milei, the president of Argentina, since December 2023. As of August 2024, Milei has made 19 international trips to eight countries during his presidency, five of which were to the United States.\nSummary\n{| class=\"wikitable sortable plainrowheaders\"\n|-\n! scope=\"col\" | Number of visits\n! scope=\"col\" class=\"unsortable\" | Country\n|-\n! scope=\"row\" | 11\n| United States\n|-\n| scope=\"row\" | 4\n| Italy\n|-\n| scope=\"row\" | 3\n| Spain, Switzerland, Vatican City\n|-\n! scope=\"row\" | 2\n| Brazil, France, Israel, Paraguay\n|-\n! scope=\"row\" | 1\n| Chile, Czech Republic, El Salvador, Germany\n|}\n2023\non 27 November 2023.]]\nIn 2023, Milei had made a single trip overseas as president-elect.\n{| class=\"wikitable\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=120|Country\n! width=100|Areas visited\n! width=90|Date(s)\n! width=550|Notes\n|-\n|\n|New York City\n|27 November\n| While serving as president-elect, Milei had made a trip to New York City, citing personal reasons. While on this trip, he first visited and connected with the Hasidic community. Notably paying tribute to Rebbe Menachem Mendel Schneerson and meeting Rabbi Simon Jacobson, who has had a great influence on him. Afterward, Milei met with former President Bill Clinton, as well as several officials from the American government and the International Monetary Fund.\n|}\n2024\nshake hands in Beit HaNassi in Jerusalem on 6 February 2024.]]\nSergio Mattarella]]\nand Milei shaking hands at the second inauguration of Nayib Bukele]]\nat the 50th G7 summit]]\nForeign trips made by Javier Milei as a president.\n{| class=\"wikitable\"\n|-\n! width=120|Country\n! width=100|Areas visited\n! width=90|Date(s)\n! width=550|Notes\n|-\n|\n|Davos\n|17 January\n| Milei travelled to the World Economic Forum Summit in Davos. There, he held a speech critical of certain World Economic Forum policies and ideals while appealing to entrepreneurs to invest in Argentina.\n|-\n|\n|Jerusalem\n|6 February\n| Despite having said that his first presidential trip abroad would be to Israel, it became his second official visit as president. During his visit to Israel, he met with the Israeli President, Isaac Herzog as well as Israeli Prime Minister Benjamin Netanyahu, who called Milei a \"great friend of the Jewish State\". While visiting the area near the conflict with Hamas, Milei met with the families of the victims of the Gaza war hostage crisis. During his trip, Milei also vowed to move the Argentine embassy to Jerusalem.\n|-\n|\n|Vatican CityRome\n|11 February\n|Milei visited Pope Francis in his first visit to the Vatican as president where they also commemorated and Francis canonized Argentina's first female saint. After that, Milei met with the Italian President, Sergio Mattarella, Italian Prime Minister, Giorgia Meloni along with prominent business and religious leaders during his trip.\n|-\n|-\n|\n|Washington, D.C.National Harbor\n|24 February\n|After having met with US Secretary of State Antony Blinken at the Casa Rosada, Milei boarded a plane bound for Washington, D.C. to later attend Conservative Political Action Conference (CPAC) in National Harbor, Maryland where he was scheduled to hold a speech the same day. Milei also met with former President Donald Trump.\n|-\n|-\n|\n|MiamiAustin\n|10–12 April\n|On 10 April, Milei visited a Chabad Lubavitch synagogue in Miami which honored him with a distinction. On 12 April, he met with Elon Musk in Austin, Texas where he toured the Tesla Gigafactory.\n|-\n|\n|Los Angeles\n|5–6 May\n|Milei travelled to the Milken Institute Global Conference in Los Angeles. He gave a speech on May 6 and encouraged the business leaders present in the meeting to invest in Argentina, later he met with FIFA President Gianni Infantino and Musk, in his second meeting with the businessman in 2024.\n|-\n|\n|Madrid\n|17–19 May\n| On 17 May,  Milei presented his book  in Madrid. On 18, he held a meeting with business executives and Santiago Abascal, leader of the Spanish Vox party. On 19 May, he gave a speech in the \"Europa Viva 24\" political event.\n|-\n|\n|San Francisco Bay Area\n|28–30 May\n|On 28 May, Milei met with Sam Altman, CEO of OpenAI. On 29 May, he met with Condoleezza Rice, the Director of the Hoover Institution and former Secretary of State, and Richard Saller, President of Stanford University, it was on this university where he also gave a speech. On the same day he met with Tim Cook, the CEO of Apple Inc and Sundar Pichai, the CEO of Alphabet Inc and Google. Finally on May 30 he gave a speech in the Pacific Summit conference. Later on the same day he held a meeting with Mark Zuckerberg, CEO of Meta Platforms.\n|-\n|\n|San Salvador\n|1 June\n| Attended the second inauguration of President Nayib Bukele.\n|-\n|\n|Fasano, Apulia\n|13–15 June\n|Argentina was one of the countries invited to the 50th G7 summit hosted by Italy at the Borgo Egnazia resort  in Apulia. There, Milei met with heads of state of the G7 such as French president Emmanuel Macron and US president Joe Biden as well as other invited leaders.\n|-\n|\n|Bürgenstock Resort\n|15–16 June\n|After his presidential trip to Italy, Milei attended the Ukraine peace summit at Bürgenstock Resort in Switzerland.\n|-\n|\n|Madrid\n|21 June\n|Milei made a private non-official visit to Madrid, Spain. There, he met with political opponents to Spanish prime minister Pedro Sánchez, whom he and his wife, Begoña Gómez, had been accused of corruption by Milei, which soured diplomatic tensions between the two countries.\n|-\n|\n|Hamburg\n|22 June\n| The day after meeting with Spanish opposition politicians, Milei met with German Chancellor Olaf Scholz. The German government had also organised a greeting with military honors as well as a joint press conference between Milei and Scholz, but this was later canceled by the German government.\n|-\n|\n|Prague\n|24 June\n|Milei visited the Czech Republic and was greeted by Czech President Petr Pavel and Prime Minister Petr Fiala whom he would have a meeting regarding the Russo-Ukrainian war before giving a speech at a libertarian think tank, the Liberal Institute.\n|-\n|\n|Balneário Camboriú\n|7–8 July\n| Milei travelled to Balneário Camboriú as an invitee to the Conservative Political Action Conference (CPAC) Brazil, where he met with former President Jair Bolsonaro.\n|-\n|\n|Sun Valley\n|12–13 July\n|Milei travelled to Sun Valley, Idaho as an invitee to an Allen & Company meeting with business and technology executives.\n|-\n|\n|Paris\n|25–27 July\n|Attended the 2024 Summer Olympics opening ceremony. Also held a meeting with President Emmanuel Macron.\n|-\n|\n|Asunción\n|27 July\n|Held a meeting with Argentine ambassador to Paraguay Guillermo Nielsen.\n|-\n|\n|Santiago\n|8 August\n|Attended a commemorative event for the anniversary of the foundation of the GasAndes company.\n|-\n|\n|New York City\n|22–25 September\n|On 23 September, Milei rang the opening bell of the New York Stock Exchange, on that same day he also met with Musk. On 24 September, Milei gave a speech at the General debate of the 79th session of the United Nations General Assembly.\n|-\n|\n|Palm Beach\n|14–15 November\n|Visited Trump at Mar-a-Lago. Spoke at Conservative Political Action Conference.\n|-\n|\n|Rio de Janeiro\n|18-19 November\n|He attended the 2024 G20 Rio de Janeiro summit.\n|}\n2025\n{| class=\"wikitable\"\n|-\n! width=120|Country\n! width=100|Areas visited\n! width=90|Date(s)\n! width=550|Notes\n|-\n|\n|Washington, D.C.\n|19-20 January\n|Attended the second inauguration of Donald Trump.\n|-\n|\n|Davos\n|21-23 January\n|Attended the World Economic Forum summit.\n|-\n|\n|Washington, D.C.\n|20-22 February\n|Attended the Conservative Political Action Conference (CPAC) summit.\n|-\n|\n|Palm Beach\n|2-3 April\n|Attended an event in Mar-a-Lago, where he was supposed to meet the US president Donald Trump, but it didn't happen.\n|-\n|\n|Asunción\n|9 April\n|Met with Paraguayan President Santiago Peña.\n|-\n|\n|Rome\n|26 April\n|\n|-\n|\n|Vatican City\n|26 April\n|He attended the funeral of Pope Francis.\n|-\n|\n|Rome\n|6 June\n|Met with Prime minister Giorgia Meloni\n|-\n|\n|Vatican City\n|6 June\n|Met with Pope Leo XIV\n|-\n|\n|Madrid\n|7-8 June\n|Met with the President of Vox, Santiago Abascal.\n|-\n|\n|Nice\n|9 June\n|Met with the French president Emmanuel Macron.\n|-\n|\n|Tel Aviv, Jerusalem\n|9-11 June\n|Met with the President of Israel, Isaac Herzog and the Prime Minister Benjamin Netanyahu. Milei announced during this visit that the Argentine embassy in Israel will be relocated to Jerusalem. Milei also became the first non-Jew to receive the Genesis Prize for his \"unequivocal support for Israel\".\n|-\n|\n|New York City\n|22-25 September\n|Gave a speech at the general debate of the eightieth session of the United Nations General Assembly. Met with U.S. President Donald Trump, Israeli Prime Minister Benjamin Netanyahu and IMF Managing Director Kristalina Georgieva on the sidelines of the United Nations General Assembly. Attended the Atlantic Council Global Citizen Awards gala and awarded the Global Citizen Award by U.S. Secretary of the Treasury Scott Bessent.\n|-\n|\n|La Paz\n|8 November\n|Attended the inauguration of President Rodrigo Paz Pereira.\n|}\nReferences"
    }
  ]
}