{
  "content": [
    {
      "type": "text",
      "text": "# List of owners of Warwick Castle\n\nWarwick Castle, in  Warwickshire, UK, was first constructed in 1068. Over its 950 years of history it has been owned by 36 different individuals, plus four periods as crown property under seven different monarchs. It was the family seat of three separate creations of the Earls of Warwick, and has been a family home for members of the Beaumont, Beauchamp, Neville, Plantagenet, Dudley and Greville families. The first creation of the Earldom, in 1088, specifically included the right of inheritance through the female line, so the castle three times had a woman (or girl) as the owner. Eleven of the owners were under 20 when they inherited, including a girl aged two and a boy aged three. At least three owners died in battle, two were executed and one was murdered.\nVarious owners have entertained royalty at the castle, under very different circumstances. Henry II tricked his way into the castle, Edward IV was held prisoner in it. Elizabeth I, William III and Victoria all made state visits.\nEvery century except the 21st has seen major building work or adaptations at the castle. For 100 years it was an earth mound and timber buildings. The next 300 years saw the building of the external walls and towers in stone. During the 210 years between 1500 and 1710 the living areas were transformed from medieval fortress rooms to a stately residence with elegant state rooms. In the 18th and 19th centuries the living areas were further adapted, the grounds were laid out and furnishings were acquired in great quantity. The 20th century saw the transition from aristocratic home to visitor attraction.\nTable of owners\n{| class=\"wikitable\" border=\"2\"\n|+ Table of owners of Warwick Castle and their construction activity\n|-\n! scope=\"col\" | Period of ownership\n! scope=\"col\" | Name (year of birth and death)\n! scope=\"col\" |  Title\n! scope=\"col\" |  Construction work and events\n|-\n|1068–1087\t||William the Conqueror(1028–1087)\t||King\t||Earth motte and bailey with timber stockades\t||\n|-\n|1087–1088\t||William II(c.1056–1100)\t||King ||\t||\n|-\n|1088–1119\t||Henry de Beaumont (de Newburgh)(c1045-1119)\t||1st Earl of Warwick\t||\t||\n|-\n|1119–1153\t||Roger de Beaumont (de Newburgh)(1102–1153)\t||2nd Earl of Warwick \t||\t||Went on Crusade. When Henry of Anjou (later Henry II) invaded England, he tricked Roger's wife into surrendering the castle.\n|-\n|1153–1184\t||William de Beaumont (de Newburgh)(1128–1184)\t||3rd Earl of Warwick\t||Rebuilding in stone began, including a house in the castle.\t||May have died on Crusade\n|-\n|1184–1203\t||Waleran de Beaumont (de Newburgh)(1153–1204)\t||4th Earl of Warwick\t||\t||Brother of 3rd Earl\n|-\n|1203–1229\t||Henry de Beaumont (de Newburgh)(1192–1229)\t||5th Earl of Warwick\t||Some existing curtain wall dates to this period.\t||\n|-\n|1229–1242\t||Thomas de Beaumont (de Newburg)(1208–1242)\t||6th Earl of Warwick\t||\t||Died without children, so title passed to his sister.\n|-\n|1242\t||Margaret de Newburg(Margery) (d,1253?)\t||7th Countess of Warwick||\t||Sister of the 6th Earl. Although she owned the castle in her own right, it was 'taken into the king's hand as a pledge for a suitable remarriage'.\n|-\n|1242–1263\t||John Du Plessis(1210–1263)\t||7th Earl of Warwick\t||\t||Married Margaret and was created 7th Earl. They had no children. On the Earl's death the title and castle passed to Margaret's nephew, William Mauduit, grandson of Waleran.\n|-\n|1263–1268\t||William Mauduit(1220–1268)\t||8th Earl of Warwick\t||\t||In 1264, in the Second Barons' War, Simon De Montfort succeeded in a surprise attack on the castle, taking the Earl and his wife hostage.\n|-\n|1268–1298\t||William de Beauchamp(1237–1298)\t||9th Earl of Warwick\t||The earliest windows facing the river date from this time.\t||William Mauduit's sister Isabel married William de Beauchamp, and their son, William was heir to the Earldom and castle.\n|-\n|1298–1315\t||Guy de Beauchamp(c. 1272 – 1315)\t||10th Earl of Warwick\t||\t||Embroiled in the execution of Gaveston\n|-\n|1329–1369\t||Thomas de Beauchamp(1313–1369)\t||11th Earl of Warwick\t||Thomas built Caesar's Tower and the Gatehouse Tower.\t||His effigy, holding his wife Katherine's hand, is in the chancel of St Mary's Church Warwick.\n|-\n|1369–1401\t||Thomas De Beauchamp(1339–1401)\t||12th Earl of Warwick||\tBuilt Guy's Tower (1394) and the wall to the gatehouse.\t||Convicted of Treason against Richard II and pardoned by Henry IV.\n|-\n|1401–1439\t||Richard de Beauchamp(1382–1439)\t||13th Earl of Warwick\t||\t||Supervised the execution of Joan of Arc. Endowed St Mary's Church to build the Beauchamp Chapel where his effigy takes centre stage.\n|-\n|1439–1446\t||Henry Beauchamp(1425–1446)\t||14th Earl and 1st Duke of Warwick\t||\t||Died without a son aged 21, so the Dukedom expired and Earldom passed to his baby daughter, Anne.\n|-\n|1446–1449\t||Anne Beauchamp(1444–1449)\t||15th Countess of Warwick\t||\t||When Anne died in childhood the Earldom passed to Henry's sister, also called Anne, and her husband Richard Neville.\n|-\n|1449–1471\t||Anne(1426–1492) and Richard Neville ('Warwick the Kingmaker') (1428–1471)\t||16th Earl and Countess of Warwick\t||Gatehouse and barbican completed. In 1469 Warwick rebelled against Edward IV and imprisoned him in the castle, until Royalist protests forced him to release the king. ||Although Anne had brought both castle and earldom to the marriage, on Richard's death she lost both. Of their two children, Isabella married the Duke of Clarence, while her younger daughter, also Anne, married the future Richard III. They haggled over how to divide the inheritance even though the 16th Countess outlived them all.\n|-\n|1472–1478\t||George Plantagenet(1449–1478)\t||Duke of Clarence and Earl of Warwick\t||\t||Along with gaining control (although with uncertain ownership) of the castle, George was made Earl of Warwick under a new creation.\n|-\n|1478–1499\t||Edward Plantagenet(1475–1499)\t||Earl of Warwick\t||The Bear and Clarence Towers were built around this period as stair turrets of a large tower begun by Richard III but left unfinished.\t||Edward was 3 when his father George died (by rumour, drowned in a vat of Malmsey wine), so the Warwick estates were held in custody by the Crown. Following the Simnel and Warbeck controversies, Edward was executed aged 21, and the Crown's title to Warwick Castle became absolute.\n|-\n|1499–1547\t||Crown Property ||1499–1509, Henry VII, 1509–47, Henry VIII||Kitchens improved, Spy Tower built, and state rooms extended.\t||\n|-\n|1547–1553\t||John Dudley I(1504–1553)\t||created Earl of Warwick, Duke of Northumberland ||\t||The Earldom  and subsequent grant of the castle were part of Dudley's rapid rise to power during wars with France and Scotland. Embroiled, with his son Guildford, in Lady Jane Grey's claim to the throne. Executed by Mary I.\n|-\n|1553–1554\t||John Dudley II(c.1527–1554)\t||2nd Earl of Warwick\t||\t||The younger John Dudley used the title of Earl of Warwick as a courtesy title when his father was made a Duke, and inherited the earldom in his own right when the elder Dudley died. Condemned for treason alongside his father, he was reprieved, but died soon after his release.\n|-\n|1554–1562\t||Crown Property \t||1554–1558, Mary I;1558–1561, Elizabeth I.\t||\t||\n|-\n|1562–1590\t||Ambrose Dudley(c.1530–1590)\t||created Earl of Warwick in 1561\t||\t||Younger son of the Duke of Northumberland. Restored to favour (Elizabeth I visited the castle in 1572) but died without an heir, so the castle again reverted to the Crown.\n|-\n|1590–1604\t||Crown Property \t||1590–1603, Elizabeth I; 1603–04, James I\t||\t||\n|-\n|1604–1628\t||Fulke Greville(1554–1628)\t||created Baron Brooke in 1621 \t||Substantial repairs and improvements to castle and grounds, including the winding path up the mound. \t||Sir Fulke was granted the castle by James I, but without much of its former estates. The title of Earl of Warwick was separated from the castle, and conferred on Lord Rich and his descendants in 1618, where it remained until 1759. Fulke was murdered by a trusted old servant, aggrieved that he was not included in Fulke's will.\n|-\n|1628–1643\t||Robert Greville(1607–1643)\t||2nd Baron Brooke \t||The Castle withstood a siege by Royalists in 1642, and held prisoners in the dungeon.\t||Fulke Greville never married, but a provision allowed the barony and castle to pass to his cousin. Robert fought for the Parliamentarians in the Civil War and was killed at the siege of Litchfield.\n|-\n|1643–1658\t||Francis Greville(died 1658)\t||3rd Baron Brooke\t||\t||He had no children and was succeeded in turn by his two brothers, Robert and Fulke.\n|-\n|1658–1677\t||Robert Greville(c.1638–1677)\t||4th Baron Brooke \t||Robert began, in 1670, the refitting of the state rooms. A work carried on much more thoroughly by his brother Fulke. ||Robert was one of the six peers chosen to invite the return of Charles II.\n|-\n|1677–1710\t||Fulke Greville(1643–1710)\t||5th Baron Brooke\t||Panelling in the Red Drawing Room and Cedar Room was installed around 1681. Also the Blue Boudoir and a number of upstairs interiors date to this period. ||William III visited the castle in 1695. Fulke's two sons, Fulke and William each succeeded him to the barony.\n|-\n|1710–1711\t||Fulke Greville(1693–1711)\t||6th Baron Brooke\t||\t||\n|-\n|1711–1727\t||William Greville(1695–1727)\t||7th Baron Brooke\t||\t||\n|-\n|1727–1773\t||Francis Greville(1719–1773)\t||8th Baron Brooke created Earl Brooke and in 1759, 1st Earl of Warwick in a new creation. ||From the 1740s there began a 50-year period of major works to many parts of the castle. Francis built a new two-storey block alongside the Great Hall, and cut the passage through the wall to join the two upstairs sets of rooms. He commissioned Capability Brown to lay out the gardens in 1753. Canaletto painted five views of Warwick Castle at the request of the Earl during his two visits to England in 1746-50 and 1751-55. The Chapel interior was refitted in 1759. The State Dining Room was completed in 1765, as was the stable block. ||When the last of the Rich family died without heir, Francis successfully petitioned for the Earldom, and founded the fourth creation of the Earls of Warwick.\n|-\n|1773–1816\t||George Greville(1746–1816)\t|| 2nd Earl of Warwick\t||George acquired many of the pictures, books, arms and armour that still furnish the castle. He bought a huge Roman vase, and built the conservatory to house it. He cut through the bedrock to create a winding driveway, made the lake, and planted the grounds with trees. ||The expense of these and other projects bankrupted the Earl for some years from 1804.\n|-\n|1816–1853\t||Henry Richard Greville(1779–1853)\t||3rd Earl of Warwick ||\t||\n|-\n|1853–1893\t||George Guy Greville(1818–1893)\t||4th Earl of Warwick\t||Substantial repairs were undertaken following a fire in the Great Hall in 1871, paid for by public subscription.\t||\n|-\n|1893–1924\t||Francis Richard Greville(1853–1924)\t||5th Earl of Warwick ||\t||\n|-\n|1924–1928\t||Leopold Guy Greville(1882–1928)\t||6th Earl of Warwick\t||\t||\n|-\n|1928–1967\t||Charles Guy Greville(1911–1984)\t||7th Earl of Warwick\t||  In 1967 the 7th Earl gave his estates absolutely to his only son David, Lord Brooke and deserted them to avoid future death duties. ||Charles retired to Rome and Switzerland where he died in 1984.\n|-\n|1967-1978.      ||David Robin Francis Guy Greville(1934-1996)\t||8th Earl of Warwick\t||In 1978 the castle and many of its contents were sold, reportedly as a 99-year lease, to Tussauds Group.\t||Lord Brooke, having sold the castle in 1978 inherited the Earldom in 1984 and was succeeded by Guy 9th Earl of Warwick in 1996.\n|-\n|1978–2007\t||Tussauds Group\t||\t||The castle was converted from private residence (although open to the public) to a major visitor attraction.\t||Tussauds was owned by S Pearson and Son (to 1999), Charterhouse Development Capital (to 2005) and Dubai International Capital (to 2007).\n|-\n|2007– present\t||Merlin Entertainments Group\t||\t||\t||Bought by Blackstone Group and Tussauds Group was merged with other holdings to form Merlin Entertainments\n|-\n|}\nSee also\n*Earl of Warwick\n*List of castles in England\n*Castles in Great Britain and Ireland\nReferences\nBibliography\n*|last1=Pevsner|first1=Nikolaus|authorlink =Nikolaus Pevsner|last2= Wedgewood|first2= Alexandra |title=Warwickshire| series= The Buildings of England |year=1966 |publisher=Penguin Books|isbn=978-0-300-09679-8}}\n*"
    }
  ]
}