{
  "content": [
    {
      "type": "text",
      "text": "# List of awards and nominations received by Masterpiece\n\nMasterpiece is an Iban rock band formed in Sibu, Sarawak by Willy Edwin and his brother Kennedy Edwin in 2003. The band's current line-up consists of lead vocalist Depha Masterpiece, lead guitarist Willy Edwin, rhythm guitarist and vocalist Kennedy Edwin, bassist Watt Marcus, drummer Harold Vincent and keyboardists Valentine Jimmy and Roslee Qadir. The band have released four studio albums: Merindang Ke Bintang (2009), Rock & Roll (2013), Ngap Sayot (2014) and Ngarap Ka Nuan Nikal Pulai (2016). All of the albums were released by Panggau Buluh Pengerindu Records, except for Ngap Sayot, released by DO Records Entertainment.\nMasterpiece has received fourteen awards from several nominations in Sarawak Music Awards ceremonies. The band has received nine awards from the Dayak Music Awards—Winning the Album of the Year two times for Merindang Ke Bintang in 2010 and Ngarap Ka Nuan Nikal Pulai in 2016. The group also won the 'Best Rock Artist' awards in 2014. \"Sinu\", from Merindang Ke Bintang  has won the 'Song of the Year' awards at the 2011 AJARR Music Awards while \"Ngarap Ka Nuan Nikal Pulai\" from the fourth album, winning the same category at the 2016 ACSJ Music Awards. Masterpiece also won the 'Best Stage Performance' award three times—\"Kumang Seari\" in 2014 \"Ngap Sayot\" in 2016 and \"Siku Dalam Seribu\" in 2017. The song \"Kumang Seari\", received the 'Best Rock Song' award nomination at the 2014 VIMA Music Awards.\nDayak Music Awards\nThe Dayak Music Awards is the music awards ceremony presented by Dayak Artists and Musicians Association (DAMA) since 2008 and continuously presented on every two consecutive years. Masterpiece has received nine awards from fourteen nominations.\n|-\n|rowspan=\"6\"| 2010 || rowspan=\"3\" | Masterpiece || Most Popular Group||\n|-\n| Best New Artist ||\n|-\n| Best Vocal for Duo/Group ||\n|-\n| rowspan=\"2\" | Merindang Ke Bintang || Album of the Year||\n|-\n| Best Album Cover ||\n|-\n|\"Bulat Ati Ku\" || Best Music Video ||\n|-\n| rowspan=\"2\" | 2012 ||  Masterpiece || Best Rock Artist ||\n|-\n|\"Badu\"|| Best Music Arrangement ||\n|-\n|2014 || Masterpiece || Best Rock Artist ||\n|-\n| rowspan=\"6\"| 2016 || rowspan=\"2\" | Ngap Sayot || Best Vocals ||\n|-\n| Best Performance ||\n|-\n| Ngarap Ka Nuan Nikal Pulai || Album of the Year ||\n|-\n| \"Berani Mati\" || Best Rock Song ||\n|-\n|\"Nuan Enggau Aku\" || Best Music Video ||\n|-\n|Ngarap Ka Nuan Nikal Pulai || Best Album Cover ||\nAnugerah Juara Rentak Ruai (AJARR) Awards\nThe Anugerah Juara Rentak Ruai (AJARR) Awards is an annual awards ceremony held by Cats FM radio station since 2003 until 2012. The winners are selected by a group of professional jury. Masterpiece has won one award.\n|-\n| 2011 || \"Sinu\" || Song of the Year ||\nVoice Independent Music Awards VIMA Malaysia\nThe Voice Independent Music Awards was Asia's first independent music awards launched in 2008. Masterpiece has received one nomination.\n|-\n| 2014 || \"Kumang Seari\" || Best Rock Song ||  Wild Card\nVoice Independent Music Awards VIMA Asia\n|-\n| 2014 || \"Kumang Seari\" || Best Rock Song ||\nAnugerah Carta Sapa Juara (ACSJ) Awards\nThe Anugerah Carta Sapa Juara (ACSJ) Awards are presented for Dayak musicians and entertainer in Sarawak organized by Sarawak Radio Televisyen Malaysia since 2014. Masterpiece has won four awards.\n|-\n| rowspan=\"2\" | 2014 || \"Kumang Seari\" || Song of the Year ||\n|-\n|Masterpiece || Best Performance ||\n|-\n| 2016 || \"Ngarap Ka Nuan Nikal Pulai\" || Song of the Year ||\n|-\n| rowspan=\"2\" | 2017 || \"Siku Dalam Seribu\" || Song of the Year || Runner up\n|-\n|Masterpiece & Lyssa Jean || Best Performance ||\n|-\nReferences"
    }
  ]
}