{
  "content": [
    {
      "type": "text",
      "text": "# List of surviving Republic P-47 Thunderbolts\n\nThe Republic P-47 Thunderbolt is an American fighter aircraft. From the first prototype produced in 1941, 15,686 P-47s were produced, the last of which was accepted by the United States Army Air Forces (USAAF) from Republic Aviation' Evansville, Indiana factory.\nBackground\nWhile the majority of the earlier versions and war-weary aircraft were quickly scrapped, most of the last production blocks would continue in service with the post-war USAAF and the new USAF. For the next five years, these aircraft would continue as a front-line fighter with the active United States Air Force. It would also serve for over 10 years with a preponderance of the Air National Guard fighter units east of the Mississippi River.\nThe P-47 would also be the foundation stock for rebuilding a majority of the post-war European air forces. Unlike the P-51, this aircraft was easily maintained and more forgiving of pilot mistakes (due to its more robust construction). Like the USAF, these aircraft only started to retire as the second generation jets became readily available. In the early 1950s as the now renamed F-47 was being retired from active USAF service, these aircraft were through various Military Assistance Programs (MAPs) offered to numerous South American countries. For the next 15 years, the F-47 would continue as a front line fighter with these nations.\nUnlike many of its contemporary World War II fighters, the P-47 was not a sought after aircraft on the postwar civilian marketplace. It did not have the sleek lines needed for an executive aircraft or racing. For the next 22 years, except for two razorback versions, the P-47 would progressively diminish from U.S. skies. It was only in 1968 with the retirement of the Peruvian Air Force's P-47s and the successful importation of six aircraft would the population of these aircraft begin to grow. During the late 1970s and early 1980s, more airframes would be returned from numerous South American countries for restoration and display. In the late 1980s, aircraft from Yugoslavia were also rediscovered and imported. The current batches of P-47s to return to the restored are those from long forgotten wartime crash sites.\nSurviving aircraft\n, Chile.]]\nAustralia\n;Under restoration\n;;P-47D\n*42-8066 – Historical Aircraft Restoration Society in Wollongong.\n*42-8310 – Historical Aircraft Restoration Society in Wollongong.\n*42-27608 – Historical Aircraft Restoration Society in Wollongong.\nBrazil\n;On display\n;;P-47D\n*42-26757 – Santa Cruz AFB in Rio de Janeiro. Wartime \"A5\". Painted as 44-19660 \"C5\".\n*42-26760 – Museu TAM in Sao Carlos. Wartime \"B2\". Painted as 42-29265 \"B5\".\n*44-19663 – Museu Aeroespacial in Rio de Janeiro. Wartime \"A6\". Painted as 42-19662 \"D5\".\n*45-49151 – Museu Aeroespacial in Rio de Janeiro. Painted as 42-26766 \"B4\".\n*45-49485 – Museu do Expedicionário in Curitiba. Painted as 42-26756 \"A4\".\nChile\n;On display\n;;P-47D\n*45-49219 – Museo Nacional Aeronáutico y del Espacio in Santiago de Chile. Painted as FACH N° 750.\nChina\non display\nP-47D\n* Unknown number - Beijing Air and Space Museum in Beihang University, Beijing. Painted as United States Army Air Forces with Invasion stripes and with the white and black checkerboard cowling of 78th Fighter Group, 8th Air Force. Without number.\nColombia\n;On display\n;;P-47D\n*45-49102 – Museo Aeroespacial Colombiano in Bogotá.\nCroatia\n;On display\n;;P-47D\n*13109 (ex-Yugoslav AF) – Technical Museum, Zagreb.\nFrance\n;On display\n;;P-47D\n*44-20371 – Musée de l'Air et de l'Espace north of Paris.\nGermany\n;On display\n;;P-47D\n*42-7924 – Motortechnica Museum.\nItaly\n;On display\n;;P-47D\n*44-89746 – Italian Air Force Museum in Bracciano.\nMexico\n;On display\n;;P-47D\n*44-90205 – Museo de la FAM.\nSerbia\n;On display\n;;P-47D\n*44-90464 (ex-Yugoslav AF 13056) – Museum of Aviation, Belgrade.\nTurkey\n;On display\n;;P-47D\n*44-33712 – Istanbul Aviation Museum\nUnited Kingdom\n;Airworthy\n;;P-47D\n*45-49192 Nellie – Duxford Aerodrome in Cambridgeshire.\n;On display\n;;P-47D\n*42-26671 – Imperial War Museum Duxford.\n*45-49295 – Royal Air Force Museum London.\nUnited States\n;Airworthy\n;;P-47D\n*42-29150 Dottie Mae – based at Allied Fighters in Sun Valley, Idaho.\n*44-32817 Balls Out – based at Fagen Fighters WWII Museum, in Granite Falls, Minnesota.\n*44-90368 Hoosier Spirit II – based at Evansville Wartime Museum in Evansville, Indiana.\n*42-27609 Bonnie- Based at the Dakota Territory Air Museum in Minot, North Dakota\n*44-90438 Wicked Wabbit – based at Tennessee Museum of Aviation in Sevierville, Tennessee.\n*44-90460 Hun Hunter XVI – based at Tennessee Museum of Aviation in Sevierville, Tennessee.\n*44-90471 Hairless Joe – based at Erickson Aircraft Collection in Madras, Oregon.\n*45-49205 Squirt VIII – based at Palm Springs Air Museum in Palm Springs, California.\n*45-49346 (unnamed) – based at Yanks Air Museum in Chino, California.\n*45-49385 (unnamed) – based at the National Museum of World War II Aviation in Colorado Springs, Colorado.\n*45-49406 Tallahassee Lassie – based at Flying Heritage Collection in Everett, Washington.\n;;P-47G\n*42-25068 Snafu – privately owned in Sacramento, California.\n*42-25254 Spirit of Atlantic City, NJ – based at Planes of Fame in Chino, California.\n;;YP-47M\n*42-27385 (unnamed) – based at Yanks Air Museum in Chino, California.\n]]\n;On display\n;;P-47D\n*42-8205 Big Stud/88 – Museum of Flight in Seattle, Washington.\n*42-23278 Fiery Ginger IV – National Museum of the United States Air Force at Wright-Patterson AFB in Dayton, Ohio.\n*44-32691 (unnamed) – Steven F. Udvar-Hazy Center of the National Air and Space Museum in Chantilly, Virginia.\n*44-32798 (unnamed) – Hill Aerospace Museum at Hill AFB in Utah.\n*45-49167 Five by Five – National Museum of the United States Air Force at Wright-Patterson AFB in Dayton, Ohio.\n*45-49181 (unnamed) – Air Zoo in Kalamazoo, Michigan.\n*45-49458 Norma – New England Air Museum in Windsor Locks, Connecticut. It is on loan from the National Museum of the United States Air Force in Dayton, Ohio.\n;;P-47N\n*44-89320 Expected Goose – Air Force Armament Museum at Eglin AFB, Florida.\n*44-89348 (unnamed) – Lackland AFB, Texas.\n*44-89425 Wild Hair – Peterson Air and Space Museum at Peterson AFB, Colorado.\n*44-89444 Cheek Baby – Cradle of Aviation Museum in Garden City, New York. It is on loan from the National Museum of the United States Air Force in Dayton, Ohio.\n;Under restoration or in storage\n;;P-47D\n*42-08130 (unnamed) – for static display at the Pima Air and Space Museum adjacent to Davis-Monthan AFB in Tucson, Arizona.\n*44-32814 (unnamed) – in storage at Fantasy of Flight in Polk City, Florida, Ex-Venezuelan Air Force aircraft.\n*44-90447 ''Jacky's Revenge – American Airpower Museum in Farmingdale, New York. Crashed into the Hudson River 27 May 2016, pilot killed. Wreckage recovered. Unknown what will happen with the aircraft.\n*45-49130 (unnamed) – in storage at the Tennessee Museum of Aviation in Sevierville, Tennessee.\n;;P-47N\n*171 - in storage with unknown owner.  Formerly owned by the late Walter Soplata in Newbury, Ohio.  Currently advertised for sale as a restoration project.\n*44-89136 Lil Meatie's Meat Chopper – to flightworthiness by the Commemorative Air Force (Airbase Georgia) at Atlanta Regional Airport in Peachtree City, Georgia. Heavily damaged after an accident on 21 March 2002 in Albuquerque, NM.\nVenezuela\n;On display\n;;P-47D\n*44-32809 – Aeronautics Museum of Maracay.\nReferences\nNotes\nBibliography\n*United States Air Force Museum Guidebook''. Wright-Patterson AFB, Ohio: Air Force Museum Foundation, 1975.\nExternal links\n*[http://pagesperso-orange.fr/p-47.database/ Base de Données: P-47 Database]\n*[https://web.archive.org/web/20080503214649/http://www.sentandoapua.com.br/joomla/content/view/33/88/ History of ex-350th FG / 1° GAvCa Brazilian AF in World War II]\n*[http://d520.online.fr/livres/airzone/accueil.html History of Brazilian AF]\n*[https://web.archive.org/web/20101119202621/http://www.aero-web.org/locator/manufact/republic/p-47.htm AeroWeb: P-47s On Display]"
    }
  ]
}