{
  "content": [
    {
      "type": "text",
      "text": "# List of formerly proprietary software\n\nThis is a list of notable software packages which were published under a proprietary software license but later released as free and open-source software, or into the public domain.\nIn some cases, the company continues to publish proprietary releases alongside the non-proprietary version.\n{| class=\"wikitable sortable\"\n|+List of formerly proprietary and closed-source software\n|-\n! Title\n! Original release\n! Relicensed release\n! Initial free relicense\n! Notes\n|-\n| 3D Movie Maker\n| 1995\n| 2022\n| MIT\n| The source code and assets for entire program (minus fonts) was uploaded to GitHub on 4 May 2022, under the MIT License.\n|-\n| Adobe Flex\n| 2004\n| 2007\n| MPL-1.1\n| Since renamed to Apache Flex and changed to Apache-2.0\n|-\n| AdvFS\n| 1990s\n| 2008\n| GPL-2.0-only\n| HP opened up AdvFS from Tru64 UNIX.\n|-\n| AOLserver\n|\n| 1999\n| GPL / modified MPL\n|\n|-\n| Apache Derby\n| 1996\n| 2004\n| Apache-2.0\n| Relational database management system originally called Cloudscape; released as free and open-source software by IBM in 2004 and donated to the Apache Software Foundation\n|-\n| Apache Wave\n| 2009\n| 2009\n| Apache-2.0\n| Formerly Google Wave.\n|-\n| Apus Game Engine\n| 2008\n| 2020\n| BSD-3-Clause\n| Released to the public by the developer after reaching a Patreon goal. The source code for Astral Heroes (one of the games using the engine) was released to patrons.\n|-\n| Astrolog\n| 1991\n| 2015\n| GPL-2.0-or-later / custom permissive\n| Has always been freeware and open source, but had a custom attribution demanding permissive license.\n|-\n| Atom\n| 2014\n| 2014\n| MIT\n|\n|-\n|BASIC Computer Games\n| 1973\n| 2021\n| Public-domain software (Unlicense)\n| On 31 December 2021, Jeff Atwood published an updated version of the 101 games included in the original BASIC Computer Games on GitHub under the Unlicense, with permission of David H. Ahl. On 15 June 2022, Ahl formally released everything he had ever written or edited, from prose to software, into the public domain; which includes titles like More BASIC Computer Games and BASIC Computer Adventures.\n|-\n| BDS C Compiler\n| 1979\n| 2002\n| Public domain\n| Released by author\n|-\n| BitKeeper\n| 2000\n| 2016\n| Apache-2.0\n|\n|-\n| Bitstream Vera (font)\n|\n| 2003\n| [https://web.archive.org/web/20090201013850/http://gnome.org/fonts custom]\n| Through the efforts of Bitstream and the GNOME Foundation\n|-\n|Blades of Exile\n| 1997\n| 2007\n| CPL-1.0\n| Relicensed to the GPL-2.0-only at some point between 14 May 2007 and 12 June 2007.\n|-\n| Blender\n| 1996\n| 2003\n| GPL-2.0-or-later\n|\n|-\n| BlitzBASIC (Blitz3D, BlitzPlus, BlitzMax)\n| 2001\n| 2014\n| Zlib\n| BlitzPlus was released as open source on 28 April 2014 under the Zlib license on github.com. Blitz3D follow on 3 August 2014. BlitzMax was open sourced on 21 September 2015.\n|-\n| BRender\n| 1995\n| 2022\n| MIT\n| Source code for 1997 and 1998 versions released under the MIT License on GitHub on 3 May 2022. The source code for 3D Movie Maker, a computer program using the engine was also released under the same license.\n|-\n| C-Dogs\n| 1999\n| 2002–2016\n| Public-domain software/CC BY 3.0\n| Source code released to the public on 13 February 2002, under a public-domain-equivalent license. The graphics were re-licensed to the CC BY 3.0 license on 13 April 2016.\n|-\n| Cafu Engine\n| 2000\n| 2009\n| GPL-3.0-or-later\n| Originally released under the GPL-3.0-or-later license (with an option for a commercial license), in 2016 was re-licensed under the MIT license.\n|-\n| Catacomb\n| 1989\n| 2014\n| GPL-2.0-or-later\n|\n|-\n| Catacomb II\n| 1991\n| 2014\n| GPL-2.0-or-later\n|\n|-\n| Catacomb Abyss\n| 1992\n| 2014\n| GPL-2.0-or-later\n|\n|-\n| Catacomb Armageddon\n| 1992\n| 2014\n| GPL-2.0-or-later\n|\n|-\n| Catacomb 3D\n| 1991\n| 2014\n| GPL-2.0-or-later\n|\n|-\n| C*Base\n| 1980s\n| 2003\n| GPL-2.0-or-later\n|\n|-\n| Cemu\n| 2015\n| 2022\n| MPL-2.0\n| Source code released under the Mozilla Public License 2.0 on 24 August 2022.\n|-\n| C*Base\n| 1980s\n| 2003\n| GPL-2.0-or-later\n|-\n| Command & Conquer: Renegade\n| 2002\n| 2025\n| GPL-3.0-or-later\n|-\n| Command & Conquer: Generals – Zero Hour\n| 2003\n| 2025\n| GPL-3.0-or-later\n|-\n| Command & Conquer 3: Tiberium Wars\n| 2007\n| 2025\n| GPL-3.0-or-later\n|-\n| ''Command & Conquer 3: Kane's Wrath\n| 2008\n| 2025\n| GPL-3.0-or-later\n|-\n| Command & Conquer: Red Alert 3\n| 2008\n| 2025\n| GPL-3.0-or-later\n|-\n| Command & Conquer: Red Alert 3 – Uprising\n| 2009\n| 2025\n| GPL-3.0-or-later\n|-\n| Command & Conquer 4: Tiberian Twilight''\n| 2010\n| 2025\n| GPL-3.0-or-later\n|-\n| ChakraCore\n| 2009\n| 2016\n| MIT\n|On 13 January 2016 Microsoft released ChakraCore under the MIT license on GitHub. ChakraCore is essentially the same as the Chakra engine that powers the Microsoft Edge browser, but with platform-agnostic bindings, i.e. without the specific interfaces utilised within the Windows Universal App platform.\n|-\n| CMU Sphinx\n|\n| 2000\n| Custom BSD-style license\n|\n|-\n| CodeXL\n|\n| 2016\n| MIT\n|\n|-\n| Coherent\n| 1980\n| 2015\n| BSD-3-Clause\n|\n|-\n| CP/M family\n| 1974\n| 1997, 2001, 2014\n|\n|\n|-\n| CuneiForm\n| 1993\n| 2008\n| BSD-3-Clause\n| Optical character recognition software\n|-\n| Dagor Engine\n| 2003\n| 2023\n| BSD-3-Clause\n| Gaijin Entertainment's in-house game engine was quietly released on GitHub under a BSD license in 2023; this open-source release will be used as the base for VK's Nau Engine.\n|-\n| Dink Smallwood\n| 1998\n| 2003\n| zlib-like\n| Some game data (e.g. sounds) not released under a free license.\n|-\n| DOS.MASTER\n| end 1980s\n| 2000\n| Public-domain software\n| DOS.MASTER is a program for Apple II computers which allows Apple DOS 3.3 programs to be placed on a hard drive or 3.5-inch floppy disk and run from ProDOS. Written by Glen Bredon as a commercial program during the late 1980s, it was released into the public domain by his family after the author's death.\n|-\n| Duke Nukem 3D\n| 1996\n| 2003\n| GPL-2.0-or-later\n| Game code only, no data, no engine.\n|-\n| Elasticsearch\n| 2021\n| 2024\n|AGPL-3.0-only\n| Originally Apache licensed; taken proprietary to pressure AWS; then added AGPL\n|-\n| Etherpad\n| 2008\n| 2009\n| Apache-2.0\n| Open sourced after being purchased by Google\n|-\n| Extensible Storage Engine\n| 1994\n| 2021\n| MIT\n| Formerly known as JET Blue\n|-\n| Falcon\n|\n| 2007\n| GPL\n|\n|-\n| FAR Manager\n| 1996\n| 2007\n| BSD-3-Clause\n| Version 2.0 released as open source.\n|-\n| File Manager (Windows)\n| 1990\n| April 2018\n| MIT\n| On 6 April 2018, Microsoft released binaries and the source code, licensed under the MIT license, for an improved version of File Manager able to be run on Windows 10. This version included changes such as the ability to compile in modern versions of Visual Studio, the ability to compile as a 64-bit application, and numerous usability improvements.\n|-\n| Fish Fillets\n| 1998\n| 2002\n| GPL-2.0-or-later\n|\n|-\n| Free Download Manager\n| 2003\n| 2007\n| GPL-3.0-only\n| Free since version 2.5\n|-\n| FoundationDB\n| 2013\n| 2018\n| Apache-2.0\n| Apple Inc. acquired the founding company in March 2015 and discontinued downloads of the software. In April 2018, Apple open-sourced the database and resumed downloads.\n|-\n| Game-Maker\n| 1991\n| 2014\n| MIT\n| After some consultation with the user base, on 12 July 2014 original coder Andy Stone released the Game-Maker 3.0 source code on GitHub, under the MIT license.\n|-\n| GGPO\n| 2006\n| 2019\n| MIT\n| On 9 October 2019 Cannon announced on his Twitter account that GGPO was now open source and available under the MIT license.\n|-\n| Ghostery\n| 2010\n| 2018\n| MPL-2.0\n| Cliqz GmbH acquired Ghostery from Evidon, Inc. in February 2017. Ghostery's software was open-sourced on 8 March 2018.\n|-\n| GEM family\n| 1985\n| 1999\n| GPL\n| Development continued as OpenGEM and FreeGEM.\n|-\n| Gentium (font)\n| 2002\n| 2005\n| OFL\n| Through the efforts of SIL International\n|-\n| Gigablast\n| 2000\n| 2013\n| Apache-2.0\n|\n|-\n| Glitch\n| 2011\n| 2013\n| CC0\n| After Glitch was officially shut down on 9 December 2012, the artwork and most of the source code was released under the CC0 license on 18 November 2013. On 9 December 2014, a fan project to relaunch Glitch under the name Eleven began alpha testing.\n|-\n| GLX\n| 1990s\n| 2008\n| [https://web.archive.org/web/20170420064437/http://oss.sgi.com/projects/FreeB/ SGI FreeB License]\n|\n|-\n| GW-BASIC\n| 1983\n| 2020\n| MIT\n|\n|-\n| Haaf's Game Engine\n| 2004\n| 2005\n| LGPL-2.0\n| Originally released under the LGPL-2.0 license on 25 November 2005, the following year it was re-licensed under the Zlib license. On 7 August 2011, the source code used for the Mac OS X and Linux ports of Hammerfight was also released.\n|-\n| Hovertank 3D\n| 1991\n| 2014\n| GPL-2.0-or-later\n|\n|-\n| ILWIS\n| 1988\n| 2007\n| GPL-2.0-only\n| Released as free and open-source software by ITC\n|-\n| id Tech 1\n| 1993\n| 1999\n| GPL-2.0-or-later\n| The released version is the source code to Doom. Originally released under a restrictive license on 23 December 1997. The sources for Heretic and Hexen: Beyond Heretic (other two games using the Doom engine) were released under the GPL-2.0-only license. The source code for the Atari Jaguar version of Doom was released under the non-free Doom Source License. The source code for the 3DO Interactive Multiplayer port of Doom was released under the MIT License.\n|-\n| id Tech 2\n| 1996\n| 1999\n| GPL-2.0-or-later\n| The released version is the source code to Quake. The map sources were also released under the GPL in 2006. In 2000 the source for Hexen II (another game using the id Tech 2 engine) was released under the GPL-2.0-only license.\n|-\n| id Tech 2.5\n| 1997\n| 2001\n| GPL-2.0-or-later\n| The released version is the source code to Quake II.\n|-\n| id Tech 3\n| 1999\n| 2005\n| GPL-2.0-or-later\n| The released version is the source code to Quake III Arena. The source code for other id Tech 3 games, such as Star Wars Jedi Knight II: Jedi Outcast, and Star Wars Jedi Knight: Jedi Academy was also released.\n|-\n| id Tech 3.5\n| 2001\n| 2010\n| GPL-3.0-or-later\n| The released version is the source code to Return to Castle Wolfenstein and Wolfenstein: Enemy Territory.\n|-\n| id Tech 4\n| 2004\n| 2011\n| GPL-3.0-or-later\n| The released version is the source code to Doom 3. Changes to the code had to be made to avoid use of the patented Carmack's Reverse.\n|-\n| id Tech 4.5\n| 2012\n| 2012\n| GPL-3.0-or-later\n| The released version is the source code to Doom 3: BFG Edition.\n|-\n| Impulse Tracker\n| 1995\n| 2014\n| BSD-3-Clause\n| Jeffrey Lim released the source code to Impulse Tracker as part of its 20th anniversary, with the main source code released on 19 October and sound driver source code released on 25 December.\n|-\n| Inform\n| 1993\n| 2022\n| Artistic-2.0\n| Source code for Inform 7 v10.1.0 released on GitHub under the Artistic-2.0 license on 28 April 2022.\n|-\n| JaikuEngine\n| 2006\n| 2009\n| Apache-2.0\n|\n|-\n| Java\n| 1995\n| 2006–2007\n| GPL-2.0-only\n|On 13 November 2006, Sun Microsystems released much of Java as free software under the terms of the GPL-2.0-only license. On 8 May 2007 Sun finished the process, making all of Java's core code free and open-source, aside from a small portion of code to which Sun did not hold the copyright.\n|-\n| Jumper 2.0\n| 2007\n| 2008\n| GPL\n| Publicly announced on 29 September 2008,\n|-\n| Komodo IDE\n| 2000\n| 2022\n| MPL-1.1\n| Open-sourced on 8 December 2022, by ActiveState due to variety of factors, including the deprecation of XUL and XULRunner and the market situation.\n|-\n| KornShell\n| 1982\n| 2000\n| custom; now CPL\n|\n|-\n| Le Lisp\n| 1981\n| 2020\n| BSD-2-Clause\n|\n|-\n| LightZone\n| 2005\n| 2012\n| BSD-3-Clause\n| Company went out of business\n|-\n| Linux kernel\n| 1991\n| 1992\n| GPL-2.0-only\n| Very early versions (before 0.12) of the Linux kernel used a license that prohibited commercial distribution, which is not compliant with free software or open source definitions\n|-\n| Lugaru\n| 2005\n| 2010–2016\n| GPL-2.0-or-later/CC BY-SA 3.0\n| Source code released by Wolfire Games upon the success of the original Humble Indie Bundle under the GPL-2.0-or-later license. On 21 November 2016, all of the assets (including those of Lugaru HD) were released under the Creative Commons Attribution-ShareAlike 3.0 Unported license.\n|-\n| Maelstrom\n| 1992\n| 1995–2010\n| GPL-2.0-or-later/CC BY 3.0\n| Source code for the Simple DirectMedia Layer Linux port by Sam Lantinga released under the GNU GPL v2 on 7 December 1999. On 15 April 2010, Andrew Welch and Ian Gilman allowed the assets to be re-licensed under the Creative Commons Attribution 3.0 license.\n|-\n| Marathon 2: Durandal\n| 1995\n| 2000\n| GPL-2.0-or-later\n| Only the code was released under the GPL-2.0-or-later license. Now known as Aleph One\n|-\n| Marathon Infinity\n| 1996\n| 2011\n| GPL-3.0-or-later\n|\n|-\n| Mari0\n| 2012\n| 2018\n| MIT\n| Developed using the LÖVE framework and originally available under the CC BY-NC-SA 3.0 license, it was relicensed to the MIT license on 29 September 2018.\n|-\n| MiniPanzer and MegaPanzer\n|\n|\n| GPL\n| The source code of the programs was released under the GPL in 2009 by their author, who retained the copyright.\n|-\n| MINIX\n| 1987\n| 2000\n| BSD-3-Clause\n|\n|-\n| Motif\n| 1980s\n| 2012\n| LGPL-2.1-or-later\n|\n|-\n| Movable Type\n| 2001\n| 2007\n| GPL\n| Weblog software\n|-\n| MP/M family\n| 1979\n| 1997, 2001\n|\n|\n|-\n| MS-DOS 1.25, 2.0, 4.0\n| 1982–1983\n| 2018–2024\n| MIT\n| Originally uploaded by the Computer History Museum in 2014 under a non-commercial license, on 28 September 2018, Microsoft uploaded the source code to GitHub under the MIT license. On 25 April 2024, Microsoft released the source code for MS-DOS 4.0 in collaboration with IBM.\n|-\n| .NET Framework (most components)\n| 2002\n| 2014\n| MIT, Apache-2.0, BSD license\n| Starting in 2014 Microsoft released most of their .NET ecosystem software (.NET Micro Framework, .NET Compiler Platform, ASP.NET, Entity Framework, NuGet etc.) under FOSS licenses and shifted the code to a GitHub repository.\n|-\n| NetBeans\n| 1997\n| 2007\n| GPL, CDDL\n| An integrated development environment (IDE) for Java and other programming languages\n|-\n| Netscape Enterprise Server\n|\n| 2009\n| BSD\n| Sun Microsystems open sourced it.\n|-\n| Netscape Navigator/Communicator\n| 1994\n| 1998\n| MPL\n| See Mozilla\n|-\n| OpenGL sample implementation\n| 1992\n| 2008\n| [http://oss.sgi.com/projects/FreeB/ SGI FreeB License]\n|\n|-\n| Open Sound System\n| 1992\n| 2007\n| GPL-2.0-only, CDDL-1.0\n|\n|-\n| OpenWRT\n| ?\n| 2003\n| GPL\n| As Linksys built the firmware for their WRT54G wireless router also from GPL'ed code, they were required to make the source code available in July 2003.\n|-\n| Performance Co-Pilot\n| 1993\n| 1999\n| GPL, LGPL\n|\n|-\n| PhysX\n| 2001\n| 2018\n| BSD-3-Clause\n|\n|-\n| Pinball Construction Set\n| 1982–1983\n| 2013\n| MIT\n| Source code for the Atari 8-bit port was released by Bill Budge on 12 February 2013 upon the recovery by Electronic Arts of the original floppies containing the source code. On 24 February 2013, the source code for the original Apple II version was released.\n|-\n| Plan 9 from Bell Labs\n| 1992/1995–2000\n| 2021\n| MIT\n| Applies to all the four original versions by Bell Labs. The first two editions were not released to the general public. The Third Edition was released in 2000 under the Plan 9 License, a license not approved by the Free Software Foundation and the Open Source Initiative. The Fourth Edition was released in 2002 under the LPL-1.02 license, a free and open-source software license, and relicensed to the GPL-2.0-only license on 8 February 2014, by the University of California, Berkeley with the permission of Alcatel-Lucent, the copyright holders at the time.\n|-\n| PowerShell\n| 2006\n| August 2016\n| MIT\n|Open sourced by Microsoft in August 2016 on GitHub.\n|-\n| Qt\n| 1991\n| 1999\n| QPL\n| First released as open source under the QPL license. Later released under the GPL license. Qt 4.5 and later are released under the LGPL license. Until 2005 the Windows version was only under a proprietary license.\n|-\n| RakNet\n| 2003\n| 2014\n| BSD-2-Clause\n| Oculus VR acquired RakNet and open-sourced it shortly after.\n|-\n| Rebol\n| 1997\n| 2012\n| Apache-2.0\n| Following the discussion with Lawrence Rosen, the Rebol version 3 interpreter was released under the Apache-2.0 license on 12 December 2012.\n|-\n| Rise of the Triad\n| 1994\n| 2002\n| GPL-2.0-or-later\n| Only the code was released under the GPL-2.0-or-later license.\n|-\n| Ryzom\n| 2004\n| 2010\n| AGPL-3.0-or-later\n|\n|-\n|Sandboxie\n| 2004\n| 2020\n| GPL-3.0-or-later\n| The final 5.40 version was a source code-only release, published a year after Sophos announced its discontinuation of development.\n|-\n| Second Life client\n| 2003\n| 2007\n| GPL-2.0\n|\n|-\n| Second Reality\n| 1993\n| 2013\n| Public-domain software (Unlicense)\n| Released by Jussi Laakkonen, former member of Future Crew, to celebrate the 20th anniversary of the original release.\n|-\n| SimCity\n| 1989\n| 2007\n| GPL-3.0-or-later\n| Free version released as 'Micropolis'\n|-\n| Solar2D\n| 2009\n| 2019\n| GPL-3.0\n| Originally released under the GPL-3.0 license (with an option for a commercial license), the following year it was re-licensed under the MIT license.\n|-\n| Solaris\n| 1989\n| 2005\n| CDDL\n| Free version released as OpenSolaris, which was discontinued in 2010. Forked as Illumos.\n|-\n| Soldat\n| 2002\n| 2020\n| MIT/CC BY 4.0\n| Originally limited to the game engine, assets followed shortly after under CC BY 4.0 license.\n|-\n| Source Code Control System\n| 1972\n| 2006\n| CDDL\n|\n|-\n| StarOffice\n| 1986\n| 2000\n| LGPL/SISSL\n| Free version released as OpenOffice.org, later released only under the LGPL license. (OpenOffice.org was discontinued in 2011, but forks—most prominently LibreOffice (licensed under the MPL-2.0 license) and Apache OpenOffice (licensed under the Apache-2.0 license)—have become its dominant successors.) StarOffice was still released separately under a proprietary license, using mostly the same code, until its discontinuing in 2011; Sun required all contributors to the main OpenOffice.org project assign joint copyright to Sun.\n|-\n| Star Ruler 2\n| 2015\n| 2018\n| MIT / CC BY-NC 2.0\n| Source code and assets re-released to the public (except for music, which is kept proprietary). The assets are under a non-free CC BY-NC 2.0 license.\n|-\n| Stride\n| 2014\n| 2014\n| GPL-3.0\n| Originally released under the GPL-3.0 license (with an option for a commercial license), it became proprietary in 2017, and it was re-licensed to the MIT license in 2018.\n|-\n| Super Lemonade Factory\n| 2012\n| 2012–2021\n| MIT/GPL-3.0-only\n| Source code for the Adobe AIR (Microsoft Windows/Mac OS X) and Flixel (iOS) versions was released on 27 July 2012 on GitHub under the MIT License, the assets were included but were not free. The entire source code repository for the Ouya version was released on 4 February 2021 under the GPL-3.0-only license.\n|-\n| Symbian platform\n| 1998\n| 2010\n| EPL\n|\n|-\n| Synfig\n| 2001\n| 2005\n| GPL-2.0-or-later\n| Some more information is available on the Synfig [https://web.archive.org/web/20091026025501/http://synfig.org/History history page].\n|-\n| Tesseract OCR\n| 1985\n| 2005\n| Apache-2.0\n| Released as free and open-source software by HP and UNLV\n|-\n| TextSecure\n| 2010\n| 2011\n| GPL-3.0\n| Since renamed to Signal\n|-\n| Torque 2D/iTorque 2D\n| 2006–2009\n| 2013\n| MIT\n| A combination of Torque 2D and iTorque, named Torque 2D MIT, was released under the MIT license by GarageGames. The source code for Larva Mortus, a game using the engine, was released on 1 May 2009 under a non-free non-commercial license.\n|-\n| Torque 3D\n| 2001\n| 2012\n| MIT\n| Developed for Tribes 2. Released as free and open-source software by GarageGames.\n|-\n| TurboCASH\n| 1985\n| 2003\n| GPL\n|\n|-\n| Two Tribes Engine\n| 2007\n| 2021\n| GPL-2.0-only\n| On 17 December 2021, Two Tribes released the source code to their in-house game engine under the terms of the GPL-2.0-only license (with an option for a proprietary license).\n|-\n| Ancient UNIX (Version 6 Unix, Version 7 Unix, UNIX/32V)\n| 1971–1979\n| 2002\n| BSD-4-Clause\n| The source code for the versions 1 to 7 of Unix and UNIX/32V was re-licensed by Caldera International (later SCO Group) under the BSD-4-Clause free-software license.\n|-\n| ViewMAX\n| 1990\n| 1999\n| GPL\n|\n|-\n| Visual Studio Code\n| 2015\n| 2015\n| MIT\n|\n|-\n| Warzone 2100\n| 1999\n| 2004\n| GPL-2.0-or-later\n| Video game by Eidos Interactive\n|-\n| Watcom C compiler\n| 1988\n| 2003\n| Sybase Open Watcom Public License\n| Free version released as Open Watcom under a license which is considered non-free by the GNU project but acceptable by the OSI.\n|-\n| Windows Calculator\n| 1985\n| 2019\n| MIT\n| Windows 1.0, released in November 1985, included the first iteration of Windows Calculator. In March 2019, Microsoft released the source code of Windows Calculator under the MIT license.\n|-\n| Windows Console\n|\n| 2019\n| MIT\n| In 2019, the Windows Console infrastructure was open-sourced under the MIT license, alongside Windows Terminal.\n|-\n| Windows Live Writer\n| 2012\n| 2015\n| MIT\n| An open source fork of Windows Live Writer was released as Open Live Writer by Microsoft on 9 December 2015.\n|-\n| Wintermute Engine\n| 2003\n| 2009\n| LGPL-3.0-or-later\n| Source code released upon request under the LGPL-3.0-or-later license with the release of the version 1.8.9. Publicly available under the terms of the MIT license since 23 March 2013. The source code for The White Chamber, a game using the engine, was released on 30 June 2008 under a non-free CC BY-NC-SA 2.0 UK license.\n|-\n| Wire\n| 2014\n| 2016\n| GPL-3.0\n|\n|-\n| Wolfenstein 3D engine\n| 1992\n|\n| GPL-2.0-or-later\n| Originally released under  a restrictive license on 21 July 1995, it was relicensed to the GPL at some point. The source code for Rise of the Triad and Blake Stone: Planet Strike (two games using the engine) was also released under the GPL-2.0-or-later.\n|-\n| Worms?''\n| 1983\n| 2021\n| MIT\n|\n|-\n| XMind\n| 2007\n| 2008\n| EPL and LGPL\n| Mindmapping software based on the Eclipse RCP\n|-\n| YSFlight\n| 1999\n| 2022\n| BSD-3-Clause\n|\n|-\n| ZFS\n| ~2001\n| 2005\n| CDDL\n| Released by Sun Microsystems under an open-source license in 2005. Due to a FSF announced license incompatibility of the GPL with the CDDL, ZFS wasn't directly integrated in Linux, but in the BSDs or MacOS due to their permissive licensed kernel which offers better license compatibility. After the later owner Oracle didn't release after version 28, the community forked to OpenZFS.\n|}\nSee also\n* History of free and open-source software\n* List of commercial video games with available source code\n* List of free and open-source software packages\n* List of free and open-source web applications\n* List of proprietary source-available software\n* List of formerly free and open-source software\nReferences\n}}"
    }
  ]
}