{
  "content": [
    {
      "type": "text",
      "text": "# List of New Hampshire historical markers (126–150)__disambig_1\n\n}}\nThis page is one of a series of pages that list New Hampshire historical markers. The text of each marker is provided within its entry.\n__NOTOC__\n{| class=\"wikitable\" style=\"text-align:left; font-size: 95%;\"\n|+Contents\n|-\n!No.\n!Title\n!Location\n!Coordinates\n|-\n|126 || Robert Frost 1874–1963 || Derry ||\n|-\n|127 || John Langdon 1741–1819 || Portsmouth ||\n|-\n|128 || The Concord Coach || Concord ||\n|-\n|129 || Indian Mortar Lot || Franklin ||\n|-\n|130 || Town Meeting House || Greenfield ||\n|-\n|131 || Brigadier General Enoch Poor || Exeter ||\n|-\n|132 || New Hampshire Canal System || Hooksett ||\n|-\n|133 || Captain Josiah Crosby (1730–1793)Lieutenant Thompson Maxwell (1742–1832) || Milford ||\n|-\n|134 || The Cornish Colony || Cornish ||\n|-\n|135 || The Belknap Mill – The Busiel Mill || Laconia ||\n|-\n|136 || The Bedell Bridge || Haverhill ||\n|-\n|137 || Barrett House || New Ipswich ||\n|-\n|138 || Second Rindge Meeting House || Rindge ||\n|-\n|139 || Chester Village Cemetery || Chester ||\n|-\n|140 || Capt. John W. Gunnison || Goshen ||\n|-\n|141 || Sam Walter Foss 1858–1911 || Candia ||\n|-\n|142 || Mast Tree Riot of 1734 || Fremont ||\n|-\n|143 || East Weare Village || Weare ||\n|-\n|144 || First Meeting House || Pembroke ||\n|-\n|145 || Deerfield Parade || Deerfield ||\n|-\n|146 || Home of the Molly Stark Cannon || New Boston ||\n|-\n|147 || White Park || Concord ||\n|-\n|148 || Sunset Baseball || Concord ||\n|-\n|149 || Lochmere Archeological District || Tilton ||\n|-\n|150 || Camp Stark German Prisoner of War Camp || Stark ||\n|-\n|colspan=4 align=center| Notes  References  External links\n|}\nMarkers 126 to 150\nRobert Frost Farm in Derry, New Hampshire where Frost wrote many of his poems]]\n. Robert Frost 1874–1963\n:Town of Derry\n\"Some of the best-loved poems in the English language are associated with this small farm owned by the poet from 1900 to 1911. Here Frost farmed, taught at nearby Pinkerton Academy and developed the poetic voice which later won him the Pulitzer Prize for poetry four times and world fame as one of our foremost poets.\"\nNote: this marker was erected in 1978.\nNote: , this marker has been listed as \"Out for Repair\".\n. John Langdon 1741–1819\n:City of Portsmouth\n\"John Langdon, merchant and statesman, was born June 26, 1741, on this farm which was first settled by the Langdon family about 1650. With his brother Woodbury, he became a successful trader and shipbuilder. During the American Revolution, he supervised construction of the Continental warships Raleigh, Ranger and America at his Portsmouth Shipyard, was in active military service, and personally financed General John Stark's expedition against Burgoyne in 1777. (See other side)\"\n\"John Langdon had a long and distinguished career in public life, which included service in the New Hampshire House of Representatives, the New Hampshire Senate, and the Second Continental Congress. He became President of New Hampshire in 1785 and 1788, and was later elected Governor of the state six times, in 1805, 1806, 1807, 1808, 1810, and 1811. A close friend and advisor of Thomas Jefferson, John Langdon was a delegate of the Federal Constitutional Convention in 1787 and was elected the first president of the United States Senate.\"\n. The Concord Coach\ncoach]]\n:City of Concord\n\"The Abbot-Downing Company began in 1813 when Lewis Downing founded a 'waggon' factory, located here from 1816 to 1828. In 1828 he was joined by J. Stephens Abbot. The next century saw fourteen styles of 'stage' coaches, the most famous being the Concord Coach, and forty styles of commercial and pleasure vehicles carrying the name of Concord all over the United States and around the world.\"\n. Indian Mortar Lot\n:City of Franklin\n\"The large mortar found here is in a boulder of glacial origin first hollowed out by water, then by many years of apparent use of Abnaki Indians, and later by the first settlers for grinding corn or maize which was made into cakes and baked over open fire. Also located in this historic lot is a boulder on which a shad is carved, perhaps by the red man to preserve a likeness of his favorite fish, which swam up the Winnipesaukee River when the shadbush blossomed. After the dams were built the fish disappeared.\"\nNote: this marker was erected in 1979.\n. Town Meeting House\n]]\n:Town of Greenfield\n\"The oldest original meeting house in New Hampshire serving both church and state. The frame, built from local timber by resident Hugh Gregg, was raised by one hundred volunteers from the village and surrounding towns on September 16, 1795. This fine old structure has served the people of Greenfield continuously since that time as a gathering place for them to worship their God, to legislate their town's civil affairs and to enjoy the company of their neighbors.\"\n. Brigadier General Enoch Poor\n:Town of Exeter\n\"Born in Andover, Mass. June 21, 1736, Enoch Poor settled in Exeter, becoming a successful merchant and ship-builder. In 1775 he was appointed colonel in the 3rd New Hampshire Regiment. Poor was at Stillwater, Saratoga, and Monmouth, and served under Washington, Sullivan, and Lafayette. Congress commissioned him Brigadier General in 1777. Mortally wounded in a duel fought September 8, 1781,}} he was buried in the First Reformed churchyard in Hackensack, New Jersey.\"\n. New Hampshire Canal System\n:Town of Hooksett\n\"Before the railroads came through New Hampshire, a flourishing canal system skirted the many falls on the Merrimack River. From the landing station at Boscawen to the point where the waterway entered the Middlesex Canal in Massachusetts there was great activity, terminated by the coming of the rails. Remains of locks, towpaths, loading stations, hydraulic apparatus, and masonry walls may yet be seen at a number of locations. From Boscawen to the state line, a series of falls known as Sewalls, Turkey, Garvins, Hookset, Amoskeag, Merrills, Griffins, Goffes, Coos, Moores and Cromwells were bypassed. Remnants of a branch canal at Head's Brickyard are among the most nearly intact in this state.\"\nNote: this marker was erected in 1979.\n. Captain Josiah Crosby (1730–1793) Lieutenant Thompson Maxwell (1742–1832)\n:Town of Milford\n\"These two Revolutionary soldiers were settlers near here in the Town of Monson (afterward Amherst, now Milford). Captain Crosby served with distinction at Bunker Hill and marched in defense of Ticonderoga in 1777 and of Rhode Island in 1778. He also served in Amherst as moderator, selectman, and representative to the General Court. Lieutenant Maxwell had the unusual record for a New Hampshire resident of participating in the Boston Tea Party, Battle of Lexington-Concord, and Battle of Bunker Hill. He returned to Massachusetts and later migrated west and served in the War of 1812.\"\n. The Cornish Colony\n:Town of Cornish\nThis marker appears to have been updated at least once. As of 1993, it read:\n\"The Cornish Colony (1885-1935) was a group of artists, sculptors, writers, journalists, poets, and musicians who joined the sculptor Augustus Saint-Gaudens in Cornish and found the area a delightful place to live and work. Some prominent members were sculptor Herbert Adams, poet Percy MacKaye, architect Charles A. Platt, and artist Stephen Parrish and nearby is the studio of his son, Maxfield Parrish, now a museum.\"\nThe marker now reads:\n\"The Cornish Colony (1885-1935) was a group of artists, sculptors, writers, journalists, poets, and musicians who joined the sculptor Augustus Saint-Gaudens in Cornish and found the area a delightful place to live and work. Some prominent members were sculptor Herbert Adams, poet Percy MacKaye, architect Charles A. Platt, artists Kenyon Cox, Stephen Parrish and his son Maxfield, and landscape architects Rose Nichols and Ellen Shipman.\"\nNote: this marker was erected in 1979.\n. The Belknap Mill – The Busiel Mill\n:City of Laconia\n\"Constructed in 1832, the Belknap Mill is the oldest unaltered brick textile mill in the U.S. Once a hosiery mill, it houses an intact hydraulic power plant and a bell cast by George Holbrook, apprentice to Paul Revere. The Busiel Mill, built in 1853 as a hosiery mill, was later used for the manufacture of clocks, electronic relays, and organs.\"\nNote: this marker was erected in 1979.\n. The Bedell Bridge\n:Town of Haverhill\n\"The last of five 19th century bridges which have existed at this location was erected in 1866 by a local entrepreneur, Moody Bedell, who had operated a ferry service here prior to the first bridge in 1805. The 396-foot structure was the largest surviving example of a two-span covered bridge utilizing Burr truss and timber arch design. Following several years of human effort which corrected decades of deterioration, the newly restored landmark was destroyed by a violent windstorm on September 14, 1979.\"}}\n. Barrett House\n:Town of New Ipswich\n\"Built in 1800 by Charles Barrett, as a residence for his son, Charles, Jr., 'Forest Hall' as it was known, pays tribute to the Barrett family and to the 19th century textile industry. The Barrett textile mills, located in Bank Village, produced cotton fabric for domestic and export usage. This house demonstrates fine federal architecture and testifies to the skill of local craftsmen.\"\n. Second Rindge Meeting House\n:Town of Rindge\n\"This Meeting House was an outgrowth of the time when Proprietors of the town were responsible for the encouragement of religion. It was built in 1796 when church and state were intertwined. Until 1819, regardless of denomination and belief, residents were considered members of this parish and their tax money supported the minister. In 1839 the town became owner of this edifice and the church society its tenant and this arrangement remains today. This building of simple colonial architecture still embraces some of the religious and civil affairs of this community and stands as a monument to pure democracy.\"\n. Chester Village Cemetery\n:Town of Chester\n\"This graveyard, one of the oldest in the state, was purchased by Col. John Blunt for 70 pounds in 1751. Signed stones by the finest stone sculptors in New England are found here. Among these craftsmen are: Stephen and Abel Webster, John Marble, John Wright and Timothy Eastman. Revolutionary heroes rest here as well as two governors of the state, Samuel and John Bell, William Richardson, Chief Justice of the N.H. Supreme Court, Isaac Blasdel the clockmaker, and others.\"\n. Capt. John W. Gunnison\n:Town of Goshen\n\"Born November 11, 1812, in Old Center Goshen, this rugged individualist attended Hopkinton (N.H.) Academy and taught school in a nearby log cabin before graduating from West Point in 1837. Following army service his talents as a surveyor and map maker took him to the mid-west to explore the Great Lakes; thence on an expedition to the Mormon settlement in Utah where he explored the Salt Lake, studied the Mormon faith, and published a 'History of the Mormons'. In 1853 he was chosen to command an expedition from St. Louis through Colorado and Utah to survey and map land for the Pacific Railroad which would connect the east with the west; his tragic death by bow and arrow occurred in October of that year.\"\n. Sam Walter Foss 1858–1911\n]]\n:Town of Candia\n\"Candia is the birthplace of the well known poet, journalist and publisher, Sam Walter Foss. Son of Dyer and Polly Foss, he was born June 19, 1858. His homespun verse and country poems were great favorites. 'The House By The Side of The Road,' the most popular, was believed to have been inspired by his boyhood home, on Brown Road, in this town.\"}}\n. Mast Tree Riot of 1734\n:Town of Fremont\n\"Local timbermen illegally cut Mast Trees reserved for the King's Royal Navy. When David Dunbar, Surveyor General, visited nearby Copyhold Mill to inspect fallen lumber, local citizens assembled, discharging firearms and convinced Dunbar to leave. Returning with 10 men, Dunbar's group was attacked and dispersed at a local tavern by citizens disguised as 'Indians.}}\nNote: this marker was erected in 1982.\n. East Weare Village\n:Town of Weare\n\"In 1960 their beautiful community was sacrificed for the Everett Flood Control Project. Their village was the home for over 60 families and was a self supporting thriving community. Farming and lumbering was a way of life for the villagers. East Weare formerly had a train depot, churches, school, post office, toy shop, garage, grocery store, lumber mills, grist mill, also Grange Hall, cemeteries, blacksmith shop and creamery.\"\nNote: this marker was erected in 1982.\n. First Meeting House\n:Town of Pembroke\n\"This is the site of the first meeting house in Suncook, incorporated as Pembroke in 1759. Granted to soldiers in Lovewell's Indian War (1722-25) or their survivors, the land was largely settled by Congregationalists from Massachusetts Bay. Their first meeting house was 'made of Good Hewn Loggs' in 1733. It measured 24 by 30 feet and housed town meetings and religious services. The building was improved in 1735 with seats, window glass, and a pulpit. In 1746, it was replaced by a two-story framed building, which was moved around 1806 and converted to the barn standing to the northwest.\"\n. Deerfield Parade\n:Town of Deerfield\n\"The village located to the east was settled circa 1740 on the early postal route between Concord and Portsmouth. The militia of the Revolutionary and Civil War trained and 'paraded' on the village common. It was a professional, cultural, and trade center. Local citizens founded a private academy in 1798. It was the birthplace of General Benjamin F. Butler (1818), distinguished military officer, Massachusetts Governor, and U.S. Senator.\"\n. Home of the Molly Stark Cannon\n:Town of New Boston\n\"This brass four-pounder, cast in 1743, was captured August 15, 1777 at the Battle of Bennington by Gen. John Stark's troops. Gen. Stark presented 'Old Molly' to the New Boston Artillery Company of the 9th Regiment of New Hampshire Militia, for its part in the battle. The artillery company was reorganized in 1938 and maintains a permanent home for 'Molly Stark' in New Boston.\"\nNote: this marker was erected in 1984.\n. White Park\n]]\n:City of Concord\n\"One of the oldest municipal parks in New Hampshire, White Park was conveyed to the city by Armenia White in 1884, in memory of her husband Nathaniel. Mr. White, a founder of the American Express Company, was a prominent businessman, legislator, and philanthropist. Both Mr. and Mrs. White were active in the abolition, temperance, and women's suffrage movements. The park was designed by landscape architect Charles Eliot, and retains the character of his original design.\"\nNote: this marker was erected in 1984.\n. Sunset Baseball\n:City of Concord\n\"The Sunset League, the oldest after-supper amateur baseball league in the United States, was officially organized here at White Park in 1909. The original teams were the Haymakers, the Old Timers, the Sluggers, and the White Parks. Rich in history and tradition, the league was the training ground for stars such as Red Rolfe of the New York Yankees. Games continue on the original site.\"\n. Lochmere Archeological District\n:Town of Tilton\n\"The history of Lochmere, in the broadest sense, is the history of human use of the Winnipesaukee River. Navigable by canoe, the river served as a major transportation and communications route and, with falls and rapids, it has served as a source of food and water power. Thirteen archeological sites record nine millennia of prehistory by Native Americans, and eighteen sites relate directly to the domestic and industrial life of early mill owners and the early industrial period of the village of Lochmere.\"\n. Camp Stark German Prisoner of War Camp\n:Town of Stark\n\"In the spring of 1944 a high fence and four guard towers transformed a former Civilian Conservation Corps camp on this site into New Hampshire's sole World War II prisoner of war camp. Approximately 250 German and Austrian soldiers, most captured in North Africa and Normandy, lived in Camp Stark while working in the forest cutting pulpwood vital to wartime industry. The camp closed in the spring of 1946 when the prisoners of war were returned to their homeland. Several maintained the new friendships they had formed with local residents. Germans and Americans attended a reunion here in 1986.\"\nNotes\nReferences\nExternal links\n*[https://www.nhdhr.dncr.nh.gov/registers-recognition/nh-historical-highway-markers New Hampshire Historical Highway Markers] at NH.gov"
    }
  ]
}