{
  "content": [
    {
      "type": "text",
      "text": "# Listed buildings in Nottingham (Berridge ward)\n\nBerridge is an electoral ward in the city of Nottingham, England.  The ward contains eleven listed buildings that are recorded in the National Heritage List for England.  All the listed buildings are designated at Grade&nbsp;II, the lowest of the three grades, which is applied to \"buildings of national importance and special interest\".  The parish is to the north of the centre of the city, and is mainly residential.  Many of the listed buildings were designed by Watson Fothergill, including a row of almshouses and associated structures, a semi-detached house, and three rows of terraced houses.  The other listed buildings are schools, and buildings in Basford Cemetery.\n__NOTOC__\nBuildings\n{| class=\"wikitable sortable plainrowheaders\" style=\"width:100%; border:0px; text-align:left; line-height:150%\"\n|-\n! scope=\"col\"  style=\"width:150px\" |Name and location\n! scope=\"col\"  style=\"width:100px\" class=\"unsortable\"|Photograph\n! scope=\"col\"  style=\"width:120px\" |Date\n! scope=\"col\"  style=\"width:650px\" class=\"unsortable\"|Notes\n|-\n|Chapels, Basford Cemetery\n|\n|align=\"center\"|1876\n|The cemetery chapels were designed by Herbert Walker in Gothic Revival style, and are now in ruins.  They are in stone with slate roofs, and have a single storey, three bays, and an H-shaped plan, consisting of an entrance bay flanked by two chapels.  The entrance bay has a decorative pointed arched opening, and a doorway with a pointed arched doorway on each side.  Above it is a gable with a wheel window and a hood mould, over which is a truncated square turret.  The chapels have gables with granite shafts, lancet windows, and apses.\n|-\n|Claremont School and walls\n|\n|align=\"center\"|1884\n|The school, designed by G. T. Hine, is in red brick on a plinth, with dressings in stone and terracotta, patterned string courses, moulded eaves and tile roofs.  Flanking the central block are ranges of ten bays, on the left with two storeys, and on the right with a single storey.  In the right of the central block is a round arched doorway with an inscribed frieze and a pediment, above this is an inscribed panel and a decorative tympanum.  To the left are two segmental-headed windows, above are two round-headed windows with keystones, and recessed to the right is a campanile chimney.  In front of the wings are low walls with chamfered coping containing square brick piers, some with pyramidal caps.\n|-\n|Lodge and gateway, Basford Cemetery\n|\n|align=\"center\"|\n|The entrance lodge is in stone on a plinth, with a floor band, and a slate roof with coped gables.  There are two storeys and an L-shaped plan, with fronts of two and four bays.  On the front facing the drive is a porch, and the windows are sashes, some with mullions.  In the gable apex facing the road is a coat of arms.  To the right is a gateway with a pair of shouldered square piers with pyramidal caps and cast iron gates.  The attached curving walls have matching railings.\n|-\n|Norris Homes\n|\n|align=\"center\"|1892–93\n|A row of eight almshouses, designed by Watson Fothergill, in red brick on a chamfered blue brick plinth, with dressings in blue brick, stone and terracotta, floor bands, and tile roofs with terracotta finials.  There are two storeys, 16&nbsp;bays, with six gables containing tile hanging, and a U-shaped plan, the wings with hipped roofs.  On the front are two triangular porches with a finial, each containing two doorways with ogee heads, and two porches in the angles.  The windows are cross-casements, on the wings are canted bay windows, and in the left corner is a bell under a canopy.  On the right return is a porch, above which is a bust in an octagonal surround, and to the right is a round turret with a swept conical roof and a weathercock.\n|-\n|Wall and gates, Norris Homes\n|\n|align=\"center\"|1892–93\n|The boundary wall, designed by Watson Fothergill, runs to the south and the east of the grounds and has a rounded corner.  It is in rock-faced Bulwell stone with sandstone dressings.  The wall has a stepped chamfered plinth, and it contains square piers with gabled caps and moulded coping.  There are three pairs of larger square gate piers set diagonally, with double-domed caps.\n|-\n|Sundial, Norris Homes\n|\n|align=\"center\"|1892–93\n|The sundial in the garden in front of the almshouses was designed by Watson Fothergill.  It has a moulded red sandstone base and capital, and a polished granite shaft.  On the top is a brass dial with an inscribed rim.\n|-\n|Cleave House and wall\n|\n|align=\"center\"|1893\n|A pair of semi-detached houses, designed by Watson Fothergill, in red brick, the upper floor timber framed with brick nogging, with stone dressings and tile roofs.  There are two storeys and attics, and four bays.  Each outer bay contains a canted bay window, the left with an octagonal roof, and the right, which is larger, with a canted roof, and both with finials.  The windows are sashes, between the bay windows is a verandah, and in the attic are two hipped roofed dormers.  The boundary wall is in rock-faced stone with coping and containing three gateways.\n|-\n|Clarendon College Berridge Centre\n|\n|align=\"center\"|1895\n|Originally High Pavement School, it is in red brick with a stone basement, dressings in stone and terracotta, stone bands, a first floor cornice, a main dentilled cornice, and tile roofs.  There are two storeys, basements and attics, and seven bays with two-bay recessed wings, the bays in the main block divided by buttresses with pinnacles.  Most of the windows are casements with cross frames and mullions, and in each wing is a canted oriel window.  On the roof is a lead-covered octagonal turret with a spire.\n|-\n|67–71 Foxhall Road\n|\n|align=\"center\"|1901\n|A terrace of four houses, designed by Watson Fothergill, in red brick, with dressings in blue brick and stone, a sill band, and tile roofs.  There are two storeys and attics, and four bays, the outer bays higher, with stepped gables.  In the centre is a pair of recessed doorways under a segmental arch, flanked on each side by two canted bay windows with hipped roofs, outside which is another recessed doorway.  The upper floor contains four windows, and in the gables are round-headed windows over blue brick diapering.\n|-\n|73–87 Foxhall Road\n|\n|align=\"center\"|1901\n|A terrace of eight houses, designed by Watson Fothergill, in red brick on a plinth, with dressings in blue brick and stone, a sill band and tile roofs.  There are two storeys and attics, and eight bays, the second and seventh bays higher, with stepped gables.  In the ground floor are doorways, all except the outer doors in pairs under a segmental arch, and eight canted bay windows with hipped roofs.  In the upper floor are a mix of sash and top-hung casement windows, and in the gables are round-headed windows over blue brick diapering.\n|-\n|89–95 Foxhall Road\n|\n|align=\"center\"|1901\n|A terrace of four houses, designed by Watson Fothergill, in red brick on a plinth, with dressings in blue brick and stone, a sill band, and tile roofs.  There are two storeys and attics, and four bays, the outer bays higher, with stepped gables.  In the centre is a pair of recessed doorways under a segmental arch, flanked on each side by two canted bay windows with hipped roofs, outside which is another recessed doorway.  The upper floor contains four windows, and in the gables are round-headed windows over blue brick diapering.\n|-\n|}\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}