{
  "content": [
    {
      "type": "text",
      "text": "# List of MegaMan NT Warrior episodes (Axess)\n\nThis article covers the second series of the MegaMan NT Warrior anime series titled MegaMan NT Warrior Axess, known in Japan as . Unlike the original EXE series, Axess has only one part, with 51 episodes. In the English version, only 45 episodes aired in the United States with an additional episode airing in Canada. The last 6 episodes were premiered a few weeks after the airing of the 46th.\nAxess premiered in Japan on October 4, 2003 and ran until September 25, 2004. There would be no future breaks in between new Rockman series (unlike the six-month separation between the original EXE and Axess). The English version first aired in the United States when Kids' WB ran \"sneak peek\" airings of the first episode in November 2004 (and again in December). The series officially began its run on February 28, 2005. Like the original EXE, Kids' WB aired many episodes sporadically and out-of-order. After airing 35 episodes (having skipped one that aired in Canada), the show was suddenly taken off the air after episode 22 aired on September 10, 2005. About three months later, ten more episodes aired between November 28 and December 9, bringing the series to a close and skipping five more episodes.\nAxess was meant to promote the Japanese release of Mega Man Battle Network 4 and prominently features characters and concepts from this game. However, it also uses many of the Mega Man Battle Network video games as source material for the almost entirely original plot (including characters that only appeared in Network Transmission). The series is also known for having a much darker tone, more violent battles, and a much less constant cast of characters (for example, EXE regulars Dex and Yai are reduced to guest appearances).\n__TOC__\nEpisode list\n{|class=\"wikitable\" width=99%\n|-\n! style=\"background: #CCF\" width=\"3%\" | Orig. Ep#\n! style=\"background: #CCF\" width=\"3%\" | Dub Ep#\n! style=\"background: #CCF\" | Title / Dub Title\n! style=\"background: #CCF\" width=\"12%\" | Directed by\n! style=\"background: #CCF\" width=\"12%\" | Written by\n! style=\"background: #CCF\" width=\"12%\" | Original airdate\n! style=\"background: #CCF\" width=\"12%\" | English airdate\n| AltDate         = November 22, 2004\n| ShortSummary    = Lan, Maylu and Chisao visit the Sci-Labs and witness Dr. Hikari's latest experiment in Dimensional Area technology—CrossFusion, the merger of a NetOp with his/her NetNavi, but the CrossFusion makes a NetOp lose his strength. However, the laboratory is attacked by real-world viruses and the Darkloid NetNavi SavageMan. Lan has no choice but to perform CrossFusion himself and stop SavageMan. After beating SavageMan, Lan passes out, but recovers a few seconds later.\n}}\n| AltDate         = March 1, 2005\n| ShortSummary    = After Lan finally wakes up, Dr. Hikari explains the SynchroChip to Lan, the chip that allows CrossFusion. Lan accidentally takes it with him to a museum exhibition on NetCity. A strange UFO appears over NetCity and begins sucking up NetNavis, so MegaMan and Roll jack-in to find SavageMan is responsible. Lan becomes an official NetSaver in this episode.\n}}\n| AltDate         = March 2, 2005\n| ShortSummary    = Lan visits the water works factory on a field trip when BubbleMan, a Darkloid NetNavi, attacks. He plans to flood every toilet in DenTech City. Lan uses CrossFusion to thwart him, but because he and MegaMan are bickering, the fusion becomes unstable. Lan and MegaMan stop arguing and work together to defeat BubbleMan.\n}}\n| AltDate         = March 3, 2005\n| ShortSummary    = When Lan is hired to find out what is causing the city's lights to burn out and destroy themselves, Maylu discovers Lan is a NetSaver. Lan finds himself battling with Darkloid FlashMan only to be interrupted by Maylu, who wishes to help. MegaMan becomes damaged with Roll's clumsy battling style, and Dr. Hikari has to repair him. However, FlashMan strikes again, so Maylu rushes off to defeat FlashMan and amend her mistake. In the end, FlashMan is defeated when MegaMan and Roll fuse their souls together and create RollSoul.\n}}\n| AltDate         = March 4, 2005\n| ShortSummary    = Ms. Mari and Tory take Lan and co. out on a hot springs vacation, but their strict rules make it difficult to relax. Lan also meets Tamako, a gift-shop owner who has a love for NetBattling. She challenges Lan to battle with her NetNavi HeavyMetalMan, but BubbleMan constantly interrupts, seeking revenge on MegaMan.\n}}\n| AltDate         = March 7, 2005\n| ShortSummary    = Higsby is desperate to impress Ms. Mari, so he takes her out to go virtual bowling. Lan and Maylu tag along. Meanwhile, bowling expert BowlMan becomes infected with a DarkChip and plans to destroy the bowling alley. Lan CrossFuses to fight back.\n}}\n| AltDate         = March 8, 2005\n| ShortSummary    = Darkloid VineMan is attacking all over DenTech City, and he's even trapped Roll in his life-sucking weeds. Mr. Match and HeatMan reappear to help fight, but when HeatMan is damaged, Famous helps in recreating TorchMan. Working with TorchMan, MegaMan creates TorchSoul and burns VineMan to ashes.\n}}\n| AltDate         = March 9, 2005\n| ShortSummary    = Lan investigates a science museum being built when the NetSavers receive word of a possible Darkloid attack. However, it was a set-up by SavageMan. Duplicating Lan's frequency, MegaMan is confronted with an artificial Lan, disabling cooperation with his NetOp.\n}}\n| AltDate         = March 10, 2005\n| ShortSummary    = Dex returns to DenTech City, but he's very different. He's been training with the WWW to defeat Lan in a NetBattle. However, Lan has to worry more about BurnerMan, a Darkloid who is attacking all over the city. Dex is determined to prove his strength to Lan, so he intervenes in the battle with BurnerMan. Dex learns from Maylu Lan is a NetSaver. Dex helps Lan in fight with BurnerMan. MegaMan creates GutsSoul to defeat BurnerMan.\n}}\n| AltDate         = March 14, 2005\n| ShortSummary    = Lan investigates the spread of DarkChips, chips that consume NetNavis with dark energy. During his investigation, Ms. Mari is held hostage in a freezer, and MegaMan must battle with SpikeMan to rescue her. In the end, it's revealed that Ms. Mari was really Ms. Yuri, SpikeMan's NetOp and distributor of the DarkChips.\n}}\n| AltDate         = March 15, 2005\n| ShortSummary    = BurnerMan returns to steal rare metals so more DarkChips can be built. However, every time he strikes, Lan is too late and can't enter the Dimensional Area he creates. Thus, Dr. Hikari teaches him how to enter Dimensional Areas from the outside. Lan perfects the technique and defeats BurnerMan.\n}}\n| AltDate         = April 11, 2005\n| ShortSummary    = While visiting an airplane festival, Lan and MegaMan re-encounter ShadowMan, who is now working with the Darkloids. He seeks the Control X navigational program. While facing him, MegaMan also meets SearchMan, a NetSaver from the country of Sharo, but the two have clashing opinions on morality when SearchMan sacrifices innocent NetNavis to stop ShadowMan.\n}}\n| AltDate         = April 18, 2005\n| ShortSummary    = Lan becomes arrogant with his latest investigation against Darkloid DesertMan. Meanwhile Chaud, a fellow NetSaver, investigates Ms. Yuri, but both heroes fall into traps. Lan CrossFuses against DesertMan, but fails. Chaud makes a surprise appearance using CrossFusion himself to save the day.\n}}\n| AltDate         = March 17, 2005\n| ShortSummary    = Lan and his friends are taken to Kingland by none other than Yai Ayano, who is now living there. It seems the data for AyanoTech's latest game, Strawberry Princess, has been stolen by viruses. She enlists her friends in tracking down the stolen data.\n}}\n| AltDate         = April 25, 2005\n| ShortSummary    = Returning from Kingland, Lan and co. make a detour in Jawaii to visit Dex. Meanwhile, Dex finds a card-scanning device that powers up NetNavis, and he works with the WWW to get his revenge on Lan again. However, the device sends GutsMan rampaging with power (and towering size) through NetCity, taking Roll hostage, King Kong style.\n}}\n| AltDate         = June 6, 2005\n| ShortSummary    = Lan meets Shuko, an unlucky and unconfident girl. When her electricity is cut off, her NetNavi SpoutMan decides to go turn it back on for her. However, when caught by security, he begins to cry, causing a huge flood of tears in the internet and deleting the guardian Navis. MegaMan uses NumberSoul to calm SpoutMan down.\n}}\n| AltDate         = May 2, 2005\n| ShortSummary    = While visiting an exhibit in a tower that floats in the sea, Lan meets Tamako and begins sparring with her. But SavageMan intervenes, burning with dark power, to delete MegaMan. Furthermore, Ms. Yuri sends the tower sinking into the ocean, and Lan drops his PET down a crevice in the floor, leaving MegaMan defenseless against SavageMan. MegaMan defeats SavageMan using HeavyMetalSoul. SavageMan comes to the real world, but is finally deleted.\n}}\n| AltDate         = May 9, 2005\n| ShortSummary    = Lan meets Raika, the NetSaver from Sharo who operates SearchMan. Lan and Raika have opposing views on the usefulness of CrossFusion, and the two go their separate ways to stop Darkloid VideoMan when he attacks a movie theater. In the end, Raika saves the day without the use of CrossFusion.\n}}\n| AltDate         = May 16, 2005\n| ShortSummary    = Viruses are using cloaking techniques to steal data, and Lan tracks them down to the source of their power: DesertMan. DesertMan gets the upper-hand against MegaMan, and SearchMan is forced to sacrifice MegaMan in order to delete DesertMan. However, SearchMan ignores Raika's orders, and instead, SearchSoul is used to defeat DesertMan.\n}}\n| AltDate         = May 23, 2005\n| ShortSummary    = The NetSavers have taken DesertMan hostage, but the Darkloids want him back. SpikeMan kidnaps Keifer and Manuela and threatens to crush them in a car compactor, but Lan and Famous intervene. However, FlashMan then strikes, and deletes DesertMan, but Chaud reappears and defeats him by using a Program Advance within CrossFusion.\n}}\n| AltDate         = May 30, 2005\n| ShortSummary    = After witnessing the dark energy's decay on DesertMan and FlashMan's bodies, ShadeMan begins to distrust the Mysterious Man he's working for. Meanwhile, Lan and Chaud investigate a warehouse where DarkChips are being stored, but they encounter GravityMan (who ShadeMan sent) instead.\n}}\n| AltDate         = September 10, 2005\n| ShortSummary    = BubbleMan decides that the only way to defeat MegaMan is to use DoubleSoul. In his plan, he befriends IceMan and SpoutMan in hopes of fusing with their power. However, MegaMan intervenes and spoils BubbleMan's plan.\n}}\n| AltDate         = June 13, 2005\n| ShortSummary    = The NetSavers meet Dr. Regal, a researcher who can help stop the Darkloids. While analyzing a Dimensional Area Converter salvaged by Raika, the NetSavers discover that these devices are powered by the souls of deleted NetNavis. Before more analysis can be conducted, Darkloid SparkMan appears and destroys the converter.\n}}\n| AltDate         = June 18, 2005\n| ShortSummary    = Chaud investigates another Darkloid attack involving BubbleMan and BurnerMan, leading him to a hot spring that Lan happens to be visiting. The two work together to stop the Darkloids, leading to a battle beneath the Earth's surface within a lake of magma.\n}}\n| AltDate         = June 25, 2005\n| ShortSummary    = VideoMan begins attacking DenTech City with artificial MegaMen that he passes on through VHS tapes. Lan and Chaud track him down, but are forced to battle a slew of CrossFusion MegaMen. In the end, VideoMan is deleted when Chaud uses electromagnetic waves to destroy VideoMan's cloning abilities.\n}}\n| AltDate         = July 2, 2005\n| ShortSummary    = The NetSavers meet a girl named Anetta. Chaud befriends her, but she has a dark secret: she's really working for the Darkloids. Months ago, her NetNavi Silk was presumably deleted by ProtoMan, and she plans to trick Chaud into using a DarkChip. Chaud sees through her plan and reveals the truth behind Silk's deletion. Anetta then reveals that Dr. Regal is the leader of Nebula, so Ms. Yuri swiftly kidnaps her.\n}}\n| AltDate         = July 9, 2005\n| ShortSummary    = Anetta is taken to Nebula's base on a transport ship, so Lan and Chaud chase after her. Aboard, they meet Dr. Regal, but ShadeMan intervenes to kill him only to be stopped by Regal’s NetNavi, LaserMan. Anetta is rescued, but ShadeMan prepares to detonate the ship with the kids aboard, and he proceeds to defeat MegaMan and ProtoMan. In order to save the day, Chaud uses a DarkChip and creates Dark Protoman, Just before Shademan was about to delete MegaMan, Protoman gives MegaMan his soul and defeats ShadeMan using Protosoul, but ProtoMan vanishes into the darkness.\n}}\n| AltDate         = July 16, 2005\n| ShortSummary    = Ms. Yuri is plotting to use holographic cloaking brooches at a modeling show to steal important data, and she sends SparkMan to distract Lan while she does so. However, Chaud appears and stops her plan, but faces ProtoMan, who admits that he is now a Darkloid working with Nebula.\n}}\n| AltDate         = July 23, 2005\n| ShortSummary    = Chaud is having trouble dealing with the loss of ProtoMan to darkness, but Lan helps comfort him with his loss. Later, when GravityMan and ProtoMan attack, Chaud is forced to fight against his own NetNavi to protect important NetSaver data while Lan handles GravityMan.\n}}\n| AltDate         = Aired only in Canada(Later bundled in 2023)\n| ShortSummary    = When MegaMan rescues SpoutMan from a Darkloid attack, SpoutMan begins idolizing his new hero and following him everywhere, causing Roll to grow jealous. Meanwhile, BurnerMan attacks, and MegaMan must fight, but SpoutMan and Roll get in the way. In the end, BurnerMan is deleted when MegaMan uses SpoutSoul against the Darkloid.\n}}\n| AltDate         = July 30, 2005\n| ShortSummary    = Yai needs her friends' help again. An AyanoTech satellite has been covered in space debris, so Lan and co. board a space station built from junk to solve the problem. In the station's network, MegaMan meets JunkDataMan, the NetNavi responsible for the mess, and a misunderstanding leads to a battle between the two.\n}}\n| AltDate         = September 3, 2005\n| ShortSummary    = The NetAgents have returned to DenTech City, and Lan is shocked to learn that everyone already knew their identities were Sal, Miyu, and Maysa. Mr. Gauss also returns to town to make a deal with Ms. Yuri, but mistakening Ms. Mari for her, he holds her hostage. Commander Beef dashes to rescue his love from danger.\n}}\n| AltDate         = August 6, 2005\n| ShortSummary    = Lan meets Misaki, the first person to test CrossFusion. Misaki uses his NetNavi PrismMan to help in the capture of GravityMan. However, Misaki is overcome with his desire to CrossFuse, and Ms. Yuri uses his desires to lure him toward a trap. Meanwhile, Chaud assists Lan with the Battle Chip Gate to delete GravityMan using the Program Advance.\n}}\n| AltDate         = August 13, 2005\n| ShortSummary    = Misaki uses the power of a Dark SynchroChip to CrossFuse, but as a side-effect, his human heart is enriched with darkness. Captured by the NetSavers, they begin to heal him, but Ms. Yuri reinstitutes his darkness, causing him to escape. Lan battles with Misaki in CrossFusion, but the battle causes Lan's PET to be badly damaged.\n}}\n| AltDate         = August 20, 2005\n| ShortSummary    = Lan must use his own body in order to help rebuild MegaMan after his PET is damaged beyond repair. Meanwhile, Nebula sends NovaMan, BrightMan, SwordMan, and FridgeMan to attack various locations. In Lan's absence, Raika works with old friend Raoul to stop the invasion. BrightMan is deleted, and the others retreat.\n}}\n| AltDate         = August 27, 2005\n| ShortSummary    = Dr. Hikari finishes Lan's new PET, the PET II, which amplifies CrossFusion abilities, but the installation isn't completed. However, Dark ProtoMan infiltrates the Sci-Labs to destroy the PET (with MegaMan inside). Anetta takes the PET and Dark ProtoMan gives chase with Chaud close behind to rescue her. Chaud and Anetta work together to capture Dark ProtoMan, but NovaMan appears to finish the job. The installation in PET II is finally completed. Lan appears and, using the PET II, easily deletes NovaMan.\n}}\n| AltDate         = November 28, 2005\n| ShortSummary    = Lan becomes arrogant with his new PET II's powers, so Chaud and Raoul pose as afro wig-wearing villains to teach Lan a lesson. However, SwordMan appears to cause problems, and he overcomes ThunderMan in battle. MegaMan uses ThunderSoul to stop SwordMan.\n}}\n| AltDate         = Not aired in English\n| ShortSummary    = Lan and his friends' NetNavis disappear in a tornado of wind, and they track them to Shiisaa Island. There, they meet Lily and her NetNavi WindBlastMan. Ms. Yuri also appears on the island, hoping to steal the data within an ancient relic. When SpikeMan disrupts the relic, a huge storm brews over the island, and using WindSoul MegaMan defeats Spikeman.\n}}\n| AltDate         = Not aired in English\n| ShortSummary    = Lan and Chisao are leaving a theme park on a train when SparkMan attacks the train's network. Sal has been tailing the NetNavi and sends WoodMan in to help with MegaMan. In order to delete SparkMan, MegaMan and WoodMan combine their powers to create WoodSoul.\n}}\n| AltDate         = November 29, 2005\n| ShortSummary    = A Dimensional Area has appeared over a factory in Sharo, so Raika calls for Lan to help infiltrate it against his general's orders. Inside, they meet FridgeMan who is trying to steal minerals. Upon his defeat, Lan learns that Raika was mostly trying to rescue his pet dog that was trapped in the factory.\n}}\n| AltDate         = November 30, 2005\n| ShortSummary    = While Lan is away in Sharo, Chaud and Maylu work together to investigate the disappearance of NetNavis who participated in the N1 Grand Prix last year. They meet a robot named Allegro and also re-encounter Kid Grave, now being controlled by Bass. After causing so much trouble, Bass gets rid of Allegro by destroying his CPU, and rejects an offer by Dark ProtoMan to join Nebula.\n}}\n| AltDate         = Not aired in English\n| ShortSummary    = After having a dream about performing CrossFusion, Maylu wishes to do so and protect Lan for a change. While on a date together at an amusement park, SwordMan attacks and Lan drops his SynchroChip. Maylu picks it up, determined to CrossFuse, but she fails. In the end, Lan saves her again, but their relationship has grown.\n}}\n| AltDate         = Not aired in English\n| ShortSummary    = An elderly man named Tensuke wishes to better connect with his grandson who cares more about NetBattling, not Tensuke's love for tops. Lan and Maylu decide to help Tensuke perfect his NetBattling skills with NetNavi TopMan.\n}}\n| AltDate         = December 1, 2005\n| ShortSummary    = While on summer vacation, Lan and Maylu search around the world for a beetle and find themselves in ancient desert ruins. There, they find a magic lamp that summons MistMan, a NetNavi genie, but Ms. Yuri, SwordMan, and FridgeMan also seek the power of MistMan. In the end, MistMan is freed and helps MegaMan in deleting both SwordMan and FridgeMan.\n}}\n| AltDate         = Not aired in English\n| ShortSummary    = When Maylu receives a new kitten, Rush feels neglected and runs away on the internet. He befriends a Maloko sheep virus, but BubbleMan is causing electrical interference throughout the city in hopes of reviving ShadeMan. Rush and the Maloko intervene.\n}}\n| AltDate         = December 2, 2005\n| ShortSummary    = Using Control X, the NetSavers plan to locate Dr. Regal's hidden space hideout. But to stop their plan, Nebula sends an army of previously-deleted Darkloids after the program. MegaMan, SearchMan, and the NetPolice re-delete the Darkloids while Dark ProtoMan goes straight for the program that Chaud and Anetta are working with. Meanwhile, Bass appears and revives ShadeMan.\n}}\n| AltDate         = December 5, 2005\n| ShortSummary    = With the help of Yai and his friends, Lan blasts off to space to stop Dr. Regal against the NetSavers' orders. JunkDataMan also reappears to help the kids by giving MegaMan JunkDataSoul to clear the space of junk. When Lan reaches the station, he's instead confronted by Dark ProtoMan, and after the battle, the space station sends on a crash-course to Earth. However, JunkDataMan is able to rescue the children at the last moment.\n}}\n| AltDate         = December 6, 2005\n| ShortSummary    = When Ms. Mari witnesses the apparent death of Ms. Yuri, she reveals the truth about her twin sister that she was separated from at a young age. However, Ms. Yuri returns to life and is ordered to kill her sister. She takes Misaki hostage and reveals that she's a superhuman descendant of Duo, an intergalactic force that will soon arrive on Earth. Lan and the kids intervene and try to stop Ms. Yuri who uses a Dark SynchroChip to fight, but she is swayed against Nebula. In the end, Dark ProtoMan appears and strikes, presumably killing both Ms. Yuri and Misaki.\n}}\n| AltDate         = December 7, 2005\n| ShortSummary    = The NetSavers and Lan's friends have devised a plan to bring ProtoMan back from the darkness with a VaccineChip. Luring him into a trap at a deserted hotel, the plan is put into motion, but the chip fails. Chaud performs CrossFusion with Dark ProtoMan to try and cure him, sending the two into a world of memories where they battle with the darkness. The darkness is eventually alleviated, but Chaud and ProtoMan are both hospitalized after the battle.\n}}\n| AltDate         = December 8, 2005\n| ShortSummary    = Revived, ShadeMan plans to get revenge on Dr. Regal. First, he captures Rush and uses his technology to appear in the real world without the aid of a Dimensional Area. He goes on a rampage through DenTech City to find Dr. Regal, but Lan intervenes. However, once Dr. Regal appears, he unveils a tower of Dimensional Area Converters and covers the entire planet.\n}}\n| AltDate         = December 9, 2005\n| ShortSummary    = Dr. Regal uses a Dark SynchroChip to fuse with his NetNavi, LaserMan, and then proceeds to rip ShadeMan to shreds. Then, giant-sized LaserMen begin attacking cities throughout the world. Lan uses DoubleSoul during CrossFusion to fight Regal, but it zaps his power. CrossFusion ProtoMan reappears to help fight, but Regal proceeds to attack the Sci-Labs. However, the pleas of the NetNavis' souls (powering the Dimensional Area Converters) revives Lan and he achieves FullSynchro, completely destroying Dr. Regal. With peace restored, everyone watches a night sky of shooting stars, including Ms. Yuri who claims \"As one chapter ends, another one begins.\"\n}}\n|}\nReferences"
    }
  ]
}