{
  "content": [
    {
      "type": "text",
      "text": "# List of Confederate monuments and memorials in South Carolina\n\nNote: This is a sublist of List of Confederate monuments and memorials from the South Carolina section.\nThis is a list of Confederate monuments and memorials in South Carolina that were established as public displays and symbols of the Confederate States of America (CSA), Confederate leaders, or Confederate soldiers of the American Civil War. Part of the commemoration of the American Civil War, these symbols include monuments and statues, flags, holidays and other observances, and the names of schools, roads, parks, bridges, counties, cities, lakes, dams, military bases, and other public works.\nThis list does not include items which are largely historic in nature such as historic markers or battlefield parks if they were not established to honor the Confederacy. Nor does it include figures connected with the origins of the Civil War or white supremacy, but not with the Confederacy.\nThere are at least 112 public spaces with Confederate monuments in the state of South Carolina.\nThe state restricted the removal of memorials and statues with the South Carolina Heritage Act (2000), which states that \"no historical monument can be altered or moved without a two-thirds vote in both chambers of the state's General Assembly\".\nMonuments and memorials\nSouth Carolina State House\n: In August 2017, \"a coalition of Columbia-area groups is calling for the S.C. Legislature to remove several monuments on the State House grounds.\"\n* South Carolina's Confederate Dead (1879), also known as the South Carolina Soldiers Monument. It was unveiled before a crowd of 15,000. The monument was largely destroyed by lightning in 1882, but was replaced by the state two years later. It is positioned on the northern end of the State House grounds. After a decision by the Legislature to remove the Confederate flag from the dome of the State House, where it had flown since 1962, the monument flew a traditional version of the Confederate Battle Flag from 2000 to 2015; the flag was the subject of protests and national level political debate. In 2015 it was removed by a 2/3 vote of both houses of the Legislature. It is displayed in the South Carolina Confederate Relic Room & Military Museum.\n* Monument to the South Carolina Women of the Confederacy (1912), a bronze monument by Frederic W. Ruckstull.\n* Wade Hampton III Confederate Monument (1906), 16-foot bronze equestrian statue, also by Frederick Ruckstull. There is also a statue of him within the Capitol.\nState holiday\n* Confederate Memorial Day is celebrated on May 10. Non-essential state employees have the day off.\n* On that day only, the Confederate flag is flown at the South Carolina Capitol.\nMonuments\nCourthouse monuments\n]]\n* Anderson: Anderson County Confederate Memorial, \"Our Confederate Dead'',\" dedicated in 1902. The inscription reads: \"The world shall yet decide, in truth's clear, far-off light, that the soldiers who wore the gray, and died with Lee, were in the right.\"\n* Bamberg: Bamberg County Confederate Monument\n* Bishopville: Lee County Monument to the Confederate Dead at Lee County Courthouse (1913)\n* Darlington: Monument to the Confederate Dead (1880)\n* Edgefield Confederate Monument (1900)\n* Greenwood: Confederate Monument (1903)\n* Lancaster: Our Confederate Soldiers Monument (1909)\n* Lexington: Lexington Confederate Monument (1886)\n* Manning: Confederate Monument (1914)\n* St. Matthews: \"Lest We Forget\" Monument (1914)\n* Union: Union County Confederate Memorial (1917)\n* Walterboro: Confederate Monument (1911)\n* York County: County removed a Confederate flag and portraits of CSA leaders from inside the court room. Being challenged in court.\nOther public monuments\n* Abbeville:\n** Abbeville Confederate Monument (1906)\n** First Secession Meeting Columns Monument (1927)\n* Aiken: Confederate Memorial (1901)\n* Barnwell: Confederate Monument\n* Bennettsville: Confederate Monument (1907)\n* Camden:\n** Confederate War Memorial (1883)\n** Richard Kirkland Memorial Fountain (1911)\n]]\n* Charleston:\n** Confederate Defenders of Charleston - Contains two bronze allegorical statues. The male figure, nude, is the defending warrior, with a sword in his right hand and a shield bearing the Seal of South Carolina in his left hand. The female figure, in a long dress, \"represents the City of Charleston. She holds in her right hand a garland of laurel, symbolizing immortality, and with her left hand points towards the sea to the enemy. On the base are scenes in relief of figures repairing the shattered walls of Fort Sumter with sand bags. Eleven stars on the lower base represent the eleven Confederate states.\" Defaced with \"Black Lives Matter\" and \"Racism\" in 2015. A monument to John C. Calhoun was defaced with \"racist\" and \"slavery\" at about the same time. In 2019 it was defaced with red paint; two were arrested.\n** Monuments in Washington Square, in front of the South Carolina Historical Society:\n*** Statue of General Pierre Beauregard (1904).\n*** \"At the park's center is an 1891 reduced reproduction of the Washington Monument inscribed with the names of battles fought during the 'War Between the States'.\" Defaced with red paint\n*** Monument to Henry Timrod (1901), \"author of poetic paeans to the Confederacy\": \"Sleep martyrs, of a fallen cause.\".\n* Chester Confederate Monument\n* Chester County: UDC monument to Confederate dead at Fishing Creek Presbyterian Church cemetery\n* Clemson: Old Stone Church Confederate Memorial\n* Clinton Confederate Monument\n* Columbia:\n** See State Capitol, above.\n** University of South Carolina\n*** Longstreet Theater and Annex at the University of South Carolina\n*** A dormitory is named for Wade Hampton. What was then South Carolina College was his alma mater.\n* Conway: Our Confederate Dead Monument\n* Cross Hill: Confederate Monument (1908)\n* Fort Mill:\n** Catawba Indian Monument (1900)\n** Defenders of State Sovereignty Monument (1891)\n** Loyal slaves monument (1896). Local cotton mill owner Samuel E. White and the Jefferson Davis Memorial Association dedicated the memorial to honor the \"faithful slaves who loyal to a sacred trust toiled for the support of the army with matchless devotion and sterling fidelity guarded our defenceless homes, women and children during the struggle for the principles of our Confederate States of America.\" \"Two opposing sides of the 13-foot-tall marble monument feature bas-relief carvings depicting enslaved blacks, including a 'mammy' figure cradling a white baby and a black man cutting wheat.\" The main speaker at the dedication was Polk Miller, a white defender of slavery, who in his remarks \"pitted what he called the 'uppity,' turn-of-the-century African American against the 'negro of the good old days gone-by,' suggesting emancipation had been an unfortunate development.\"  This monument is seen as an example of the Lost Cause of the Confederacy movement. See also Heyward Shepherd monument.\n* Gaffney: Cherokee County Confederate Monument (1922)\n]]\n* Georgetown: Confederate Monument (1929) at Battery White\n* Greenville: Confederate Monument (1892)\n* Jonesville: Confederate Monument (1907)\n* Kingstree: Confederate Soldier, Williamsburg County Monument (1910)\n* Laurens Confederate Monument (1910)\n* Marion: Marion Monument \"To the Dead and Living Confederate Veterans\" (1903)\n* Moncks Corner: Berkeley County Confederate Monument (2011)\n* Newberry Confederate Monument (1880)\n* Orangeburg:\n** Confederate Monument (1893)\n** Confederate Flag and Monument (2001)\n** Memorial in memory of Confederate soldiers buried in Old Pioneer Graveyard (at the Dixie Library Building)\n* Prosperity: Confederate Veterans Monument (1928)\n* Rock Hill: Ebenezer Confederate Monument (1908)\n* Salem Confederate Monument (2004)\n* Seneca: UDC Memorial Gateway (1933) dedicated to Confederate soldiers at entrance to Mountain View Cemetery\n* Spartanburg: Confederate Soldier Monument (1910)\n* Walhalla: \"Our Confederate Dead\" Monument (1910)\n* Westminster Confederate Monument (1980)\n* Williamston: Confederate Monument (1942)\n* Winnsboro: Confederate Memorial (1901)\n* York: York County Confederate Monument (1906)\nPrivate monuments\n* Abbeville: The S.C. Division of the Sons of Confederate Veterans is erecting an  foot monument on Secession Hill, dedicated to the 170 signers of South Carolina's Ordinance of Secession. The monument will be unveiled on November 10, 2018.\n* Aiken: A granite memorial dedicated to Confederate soldiers was erected in 2017.\nInhabited places\n* Counties\n** Bamberg County (1897)\n** Hampton County (1878)\n** Lee County (1902)\n* Cities\n** City of Batesburg-Leesville\n** Hampton\n** City of Kershaw (1888)\n* Other inhabited places\n** Bradley (unincorporated)\n** Wade Hampton (census-designated place)\n** Spartanburg: Hampton Heights\nParks\n* Charleston: Hampton Park\n* Columbia: Hampton Park\n* Ehrhardt:  Rivers Bridge State Park.  Website: https://southcarolinaparks.com/rivers-bridge?limit=19\nRoads\n* Aiken: Beauregard Lane\n* Anderson:\n** Beauregard Lane\n** Bonham Court (named for Milledge Luke Bonham)\n* Beaufort\n** Beauregard Court\n** Hampton Street\n* Bluffton: Robert E. Lee Lane\n* Charleston:\n** Beauregard Street\n** Bonham Drive\n** Evans Road (named for Nathan George Evans)\n** Hampton Street\n** Jeb Stuart Road (named for J. E. B. Stuart\n** Longstreet Drive (named for James Longstreet)\n** Robert E. Lee Boulevard\n** Trapper Drive (named for James H. Trapier)\n** Wade Hampton Drive\n** Wallace Drive (named for Lew Wallace)\n* Clinton:\n** Beauregard Street\n** Stonewall Street\n* Columbia:\n** Beauregard Street\n** Bonham Road\n** Bonham Street\n** Confederate Avenue\n** Hampton Hills (neighborhood)\n** South Bonham Road\n* Cowpens: Stonewall Drive\n* Daufuskie Island: Beauregard Boulevard\n* Duncan: Hampton Street\n* Early Branch: Robert E. Lee Road\n* Easley: Stonewall Drive\n* Fort Mill: Confederate Street\n* Greenville\n** Stonewall Lane\n** Wade Hampton Boulevard\n** Wade Hampton School Road\n* Greenwood: Bonham Court\n* Greer\n** Beauregard Court\n** Wade Hampton Boulevard\n* Hartsville: Stonewall Street\n* Honea Path: Beauregard Drive\n* Lake City: Beauregard Street\n* Lancaster: Confederate Avenue\n* Lyman: Wade Hampton Boulevard\n* Modoc: Beauregard Drive\n* Mountville: Jefferson Davis Road\n* Orangeburg:\n** Beauregard Street\n** Robert E. Lee Street\n** Stonewall Jackson Boulevard\n** Stonewall Jackson Street Southwest\n* Rock Hill\n** North Stonewall Street\n** South Stonewall Street\n** Wade Hampton Boulevard\n* Saluda\n** Bonham Avenue\n** Bonham Road\n* St. Matthews: Stonewall Lane\n* Summerville:\n** Beauregard Court\n** Stonewall Drive\n* Taylors\n** Wade Hampton Boulevard\n* Timmonsville:\n** Robert E. Lee Avenue\n** Stonewall Drive\n* Trenton: Thomas S. Jackson Road\n* Union:\n** Bonham Station Road\n** General Lee Drive\n* Wagener: Stonewall Jackson Road\n* Walterboro:\n** Hampton Street\n** Robert E. Lee Drive\n* Westminster: Stonewall Drive\n* Walterboro: Robert E. Lee Drive\nSchools\n* Bishopville:\n** Lee Central High School\n** Lee Central Middle School\n** Lee County Career & Technology Center\n** Lee High School\n* Blackville: Jefferson Davis Academy\n* Clemson University: Named after the Confederate soldier and son-in-law of John C. Calhoun that bequeathed the land to the state for the creation of an agricultural college.\n* Ehrhardt: Jackson Academy (private school): The school's athletic teams are nicknamed the \"Confederates\"\n* Greenville: Wade Hampton High School\n* Varnville: Wade Hampton High School\nOther\n* Greenville: Wade Hampton Fire Department\n* Holly Hill: The American, South Carolina, and Confederate flags were erected in 2017 on private land along U.S. Highway 176 west of town, along with a sign with the Sons of Confederate Veterans name. It has been vandalized. On July 9, 2018, residents protested to the City Commission what they called the \"blatant racism\" of the display. The city and the Ministerial Alliance of Eastern Orangeburg County had asked the SCV not to erect the flag.\nNotes\nReferences"
    }
  ]
}