{
  "content": [
    {
      "type": "text",
      "text": "# List of areas in the Dutch Republic destroyed or damaged during the Franco-Dutch War\n\n: 't Slot te Breukelen, Breukelen castle, destroyed by French troops in 1672, etching 1672-1676, Rijksmuseum]]\nas it was before its destruction by the French in 1673.]]\n: Castle Gunterstein in Breukelen, 1646/47.]]\n, Teylers Museum.]]\nin Bunnik with French troops on the foreground. Print from around 1840.]]\n, 2005.]]\n(in Dutch) in the 17th century.]]\n: Kasteel Kronenburg, Loenen aan de Vecht, 1646-1647.]]\n, 1887]]\n, no date supplied.]]\n: Hofke bij Bommel, castle ruin of Hof bij Maasbommel, 1718-1730.]]\nafter Roelant Roghman: View of Ruwiel Castle at Oud-Aa near Breukelen, later destroyed by French troops in 1673. Print 1711 and later.]]\nThis is an incomplete list of Dutch Republic villages, country houses and castles, that were destroyed or seriously damaged by French troops in 1672/1673 during the Rampjaar (Disaster Year) in the Franco-Dutch War. In this Guerre de Hollande the strategy of the troops of the French king Louis XIV was \"to burn as much as possible. You should burn down entire villages\", wrote the French army general Louvois to his intendant. Some castles have disappeared completely, others are still there as a ruin or were rebuilt and still exist in some later version. However, Valkenburg Castle in Valkenburg aan de Geul was not destroyed by French troops but was blown up by stadholder William III after he had expelled the French troops in 1672, to prevent a repeat occupation by the French. It was never rebuilt.\nDestroyed or damaged villages\nIn 1672/1673 French troops damaged and destroyed not only castles, but also villages, which were depicted by Isaac Sorious in 1672-1676 in a thematic series of etchings:\n* Abcoude was burned on 6 November 1672. Etching by Isaac Sorious: Abcoude, verwoest door de Fransen in 1672, 1672 - 1676, Rijksmuseum.\n* Breukelen was destroyed in 1672.\n* Bodegraven was razed to the ground  and the population was killed.\n* Harmelen, the church was destroyed in 1672 by French troops.\n* Naarden\n* Nigtevecht, also Nichtevecht, was destroyed nearly completely on 21 April 1673, leaving only a stump.. of the church tower and the house of the schoolmaster. Etching by Isaac Sorious: Nigtevecht, verwoest door de Fransen in 1672, 1672 - 1676, Rijksmuseum.\n* Overmeer near Nederhorst den Berg. Etching by Isaac Sorious: Overmeer, verwoest door de Fransen in 1672, 1672 - 1676, Rijksmuseum.\n* Vreeswijk was damaged two times with a short interval in early October 1672 and the church was destroyed. Etching by Isaac Sorious: Vreeswyk of de Vaart by Vianen, verwoeste brug en gebouwen, 1672 - 1676, Rijksmuseum.\n* Waverveen was destroyed. Etching by Isaac Sorious: Waverveen, verwoest door de Fransen in 1672, 1672 - 1676, Rijksmuseum.\n* IJsselstein was burned partially by the French in 1672.\n* Zwammerdam was totally destroyed and its population killed.\nCountry houses and castles damaged or destroyed in 1672-1673 by French troops\nAlphabetically by Dutch municipality:\nA\n* Amerongen\n** Amerongen Castle, Kasteel Amerongen. In February 1673 the castle was set on fire with fagots by French troops. It burned for two days.\n** ? Rodestein or Royestein between Huis Amerongen and Wayestein, was destroyed in 1672 by the French according to van der Aa but this is disputed.\n* Appeltern (w:nl:Huis Appeltern in Dutch) was largely destroyed in 1672 by French troops and rebuilt later on.\n* Asperen, Wadestein was destroyed by French troops in 1672.\nB\n* Baambrugge, Rijksstraatweg 147, Valckenheining  (Valck en Heining) on Angstel River. The French destroyed in 1672 at least one of the homesteads of the Valckenier family, according to the book Het ontroerde Nederlandt (1674). The family built Valckenheining on the location of the former homestead.\n* Balgoij, Huis Balgoij, gemeente Wijchen. French troops destroyed this house in 1672, leaving still extant remains underground.\n* Brakel, w:nl:Kasteel Brakel (in Dutch), blown up on 11 September 1672 by French troops after non-payment of the levy under threat of fire and was never rebuilt, a ruin.\n* Breukelen\n** Aastein was destroyed by the French in 1672. Aastein was located near the farmhouse Uilenvlucht and is sometimes mistaken for the homesteads Huis Ter Aa and Over de Aa (Clarenborg), both in Breukelen.\n** Gunterstein Castle, Slot te Breukelen, burned and blown up on 12 September 1673.\n** w:nl:Kasteel Nijenrode (in Dutch), Huis Nyenrode, (largely) destroyed on 6 and 7 September 1673. The French headquarters was established here and farmers had to pull over a stone wall for protection of the castle. Etching by Isaac Sorious: Huis te Nieuwenrode, verwoest door de Fransen in 1672.\n** w:nl:Queekhoven (in Dutch), Zandpad 51, was destroyed in 1672, and was rebuilt later.\n** w:nl:Kasteel Ruwiel (in Dutch), Ruwiel Castle, a former castle in Oud-Aa to the north west of Breukelen, was destroyed by French troops on 21 July 1673.\n** Vecht en Dam was destroyed in 1672/1673.\n** Vegtvliet or Vechtvliet, Rijksstraatweg 220, owned by the Amsterdam merchant Willem van den Broeck, when the French left in 1673 Etching by J. Sorious Het huis van de Heer vanden Broek, verwoest door de Fransen in 1672  in part II of Het ontroerde Nederlandt (1676).\n** Voortwijk was burned by the French in 1672.\n** w:nl:Vreedenoord (in Dutch) or Vredenoord, Straatweg 68. A farmhouse was set on fire in 1672 by the French. At the same location Vredenoord was erected.\n* Bunnik:\n** w:nl:Nieuw-Amelisweerd (in Dutch) was destroyed., but was still in existence in 1674 after the French occupation\n** w:nl:Oud-Amelisweerd  (in Dutch) was largely destroyed in 1672, but was rebuilt in 1770.\nC\n* Culemborg, Culemborg Castle w:nl:Kasteel Culemborg (in Dutch) was damaged severely in 1672/1673 by French troops.\nD\n* De Steeg, municipality Rheden. The main castle Middachten Castle was severely damaged by French troops in 1672.\nE\n* Epe, Quickborn, also Domselaar or Huis te Epe, was damaged severely by French troops.\nG\n* 's-Graveland, De Hooge Dreuvik and Rontomwelgevallen, country houses of Admiral Cornelis Tromp. He erected nearby in 1675-1684 a new country house Trompenburgh in a large pond.\nH\n* Haaften, w:nl:Kasteel Goudenstein (in Dutch), destroyed by French troops in 1672 leaving only a tower. Restored ruin: corner tower with wall stumps.\n* Haarzuilens, De Haar Castle partially destroyed in 1672 by the French.\n* Harmelen, Huis Harmelen was destroyed in 1672 by French troops.\n* Heukelum, Merckenburg Castle, blown up by the French in 1672.\n* Herwijnen, Huis te Herwijnen, is not identical to w:nl:Kasteel Wayenstein (in Dutch) or Wadesteyn, but is the same as \"Frissesteyn / Frissestijn\", was destroyed or severely damaged by French in 1672. The area of the former castle is a national monument.\n* Hoevelaken. The fortress Huis te Hoevelaken was destroyed by fire in 1672. Thereafter twice a new House Hoevelaken was erected elsewhere in municipality.\nJ\n* Jaarsveld, castle Slot te Jaarsveld, w:nl:Kasteel Veldenstein (in Dutch), Kasteel Jaarsveld. French troops set fire to this castle in 1673 and it was never rebuilt.\nL\n* Lobith, w:nl:Tolhuis (Lobith) (in Dutch). French troops damaged the large tower of this toll castle in 1672.\n* Loenen aan de Vecht\n** former Castle Kronenburg (in Dutch) of Cronenburg(h), Rijksstraatweg 84. Occupied in 1672 by 200 Dutch State soldiers, but due to the great force majeure and lack of ammunition, they had to surrender to the French army of 1500 men led by the Duke of Luxembourg. After this, the French occupied the castle for two months and it was only partly dismantled, because the Dutch lord of the castle was a Catholic. In September 1673, the round main tower was blown up with gunpowder.\n** Nieuwerhoek, Rijksstraatweg 78, heavily damaged in the French siege of Kronenburg.\n* Lopik, Huis te Jaarsveld or Veldenstein, just outside the village of Jaarsveld was pillaged in 1673 by French troops and set on fire.\nM\n* Maarheeze, Castle Cranendonck, w:nl:Kasteel Cranendonck (in Dutch), a ruin. Castle destroyed by French troops in 1673.\n* Maarssen\n** w:nl:Cromwijck (in Dutch), Zandpad 42\n** w:nl:Huis ten Bosch (Maarssen) (in Dutch), was destroyed, rebuilt and served as a town hall in 1924.\n** Ridderhofstad Ter Meer (in Dutch), also known as Slot te Maarssen, Termeer, Zuylenburg, a former castle. It was plundered on 12 December 1672 by the French and burned completely. Rebuilt in 1710 at the same spot.\n* Maasbommel, Bommel Castle, Kasteel Bommel, also Hof te Bommel, and Het Hoge Huis. In 1674 French troops burned it leaving a ruin, drawn in the 18th century by Abraham Rademaker. The damage was estimated at Dutch guilder fl. 124.140: furnitures, sheds, meubilair, schuren, \"150 fat sheep, 4 fair horses, two cows, burnt the corn- or windmill\". A small house was built on the site of the castle in the mid-eighteenth century, later converted into a farm 't Hof.\n* Maasdriel, w:nl:Slot van Well (nl, not to be mistaken for Kasteel Well in Limburg) was badly damaged in 1672 by French troops.\n* Millingerwaard, Millingen was destroyed in 1672 by French troops.\n* Montfoort, w:nl:Kasteel Montfoort (in Dutch), Montfoort Castle. French troops destroyed the main castle in 1672. On November 6, 1672, the upper walls of the castle were demolished and on November 7, 1672, the tower was blown up by French troops when they withdrew fleeing for the troops of Stadtholder William III. The gate, the 'voorburcht', is still there.\nN\n* Nederhorst den Berg, w:nl:Kasteel Nederhorst (in Dutch),  in 1672 set on fire by French troops.\n*Nieuwegein, w:nl:Kasteel Rijnhuizen (in Dutch), destroyed by the French in 1672 NB. De schans aen Iutfaes, de sconce at Jutphaas near the Doorslagsluis lock is a special case.\n* Nieuwersluis, Weeresteyn, Zandpad 29, was built around 1700 on the location of a fortified country house or castle that was probably destroyed by the French in 1672–1673.\nO\n* Overasselt,\n** Nagelhorst, Kasteelsestraat 10, was for the larger part destroyed  in 1672.\n** Overasselt. \"Adelijcke havesaet\" and \"kasteel\" (Huis te) Overasselt (House at Overasselt), north of the street Hoogstraat, was set on fire by the French on 1 May 1672 and was probably never rebuilt.\nP\n* Poederoijen, w:nl:Kasteel Poederoijen (nl, Castle Poederoijen), after repeated demolition as well as rebuilding by Maarten van Rossum this castle definitely destroyed by French troops in 1672. or possibly demolished to avoid occupation by French troops.\n* Putten, w:nl:Kasteel Oldenaller (nl, Castle Oldenaller) or Oudenaller between Nijkerk and Putten was occupied by French troops and destroyed.\nV\n* Vuren. \"Thuys te Vuyren\" (House at Vuyren) in municipality West Betuwe was destroyed by French troops in 1672.\nW\n* Wageningen, w:nl:Kasteel van Wageningen, Wageeningen Castle. French troops probably destroyed most of this castle in 1672. There are indications that walls have been blown up. All the towers, the gatehouse, the building along the east wall and the castle moat have disappeared on a map of 1722 .\n?\nLocation in Utrecht province to be determined:\n* Country house of the Lord van de Weert. Etching by Isaac Sorious, 1672 - 1676: Huis van de Heer vande Weert, verwoest door de Fransen in 1672, 1672 - 1676, Rijksmuseum.\n* Country house Huis Kroonwyck of Mr. Pauw. Etching by Isaac Sorious: Het Huis Kroon-wyck van de heer Pauw, verwoest door de Fransen in 1672, 1672 - 1676, Rijksmuseum.\nGallery\nRomeyn de Hooghe\nRomeyn de Hooghe (1645-1708) - Spiegel der France Tirannye gepleechd opde Hollantsche dorpen - BF.1997.32, 1673.png|Spiegel der France Tirannye gepleechd opde Hollantsche dorpen, Mirror of the French tiranny against villages in Holland, 1673. The Museum of Fine Arts Houston\nRomeyn de Hooghe (1645-1708) - Oorlog en tirannie teisteren Nederland - RP-P-OB-79.288, 1674.jpg|Oorlog en tirannie teisteren Nederland. War and tyranny rage in the Netherlands, 1674. Rijksmuseum\nRomeyn de Hooghe (1645-1708) - Franse invasie en verbreking van de eenheid van de Unie - RP-P-OB-55.161, 1674.jpg|Franse invasie en verbreking van de eenheid van de Unie, The French invasion and the breach of the Union, 1674. Rijksmuseum.\nIsaac Sorious: Destroyed villages and castles in Utrecht province in 1672, 1672-1676\nSource:\nFile:Abcoude, verwoest door de Fransen in 1672 Abcoude (titel op object) Reeks van dertien afbeeldingen van de dorpen en kastelen in de provincie Utrecht door de Fransen in 1672 verwoest (serietitel), RP-P-OB-77.089.jpg|Abcoude\nFile:Het slot te Jaarsveld, verwoest door de Fransen in 1672 't Slot te Iaarsveldt (titel op object) Reeks van dertien afbeeldingen van de dorpen en kastelen in de provincie Utrecht door de Fransen in 1672 verwoest (serieti, RP-P-OB-77.098.jpg|'t Slot te Iaarsveldt\nFile:De schans bij Jutphaas, verwoest door de Fransen in 1672 De Schans aen Iutfaes (titel op object) Reeks van dertien afbeeldingen van de dorpen en kastelen in de provincie Utrecht door de Fransen in 1672 verwoest (seriet, RP-P-OB-77.096.jpg|The Sconce near Jutphaas\nFile:Het slot Kronenburg, verwoest door de Fransen in 1672 't Slot te Kroonen-borgh (titel op object) Reeks van dertien afbeeldingen van de dorpen en kastelen in de provincie Utrecht door de Fransen in 1672 verwoest (seriet, RP-P-OB-77.099.jpg|'t Slot te Kroonen-borgh\nFile:Franse troepen trekken plunderend en schietend door de ruïnes van het dorp Nigtevecht, 1672 Nichtevecht (titel op object) Reeks van dertien afbeeldingen van de dorpen en kastelen in de provincie Utrecht door de Fransen, RP-P-OB-77.094.jpg|Ruïns of Nigtevecht village\nFile:Huis te Nieuwenrode, verwoest door de Fransen in 1672 t' Huys te Niewen rode (titel op object) Reeks van dertien afbeeldingen van de dorpen en kastelen in de provincie Utrecht door de Fransen in 1672 verwoest (serietit, RP-P-OB-77.092.jpg|''t' Huys te Niewen rode\nFile:Overmeer, verwoest door de Fransen in 1672 Overmeer (titel op object) Reeks van dertien afbeeldingen van de dorpen en kastelen in de provincie Utrecht door de Fransen in 1672 verwoest (serietitel), RP-P-OB-77.095.jpg|Overmeer\nFile:Gebouwen en brug te Vreeswijk bij Vianen, verwoest door de Fransen in 1672 Vreeswyk of de Vaart by Vianen (titel op object) Reeks van dertien afbeeldingen van de dorpen en kastelen in de provincie Utrecht door de Frans, RP-P-OB-77.100.jpg|Vreeswyk of de Vaart by Vianen, a destroyed bridge with buildings\nFile:Waverveen, verwoest door de Fransen in 1672 Waverveen (titel op object) Reeks van dertien afbeeldingen van de dorpen en kastelen in de provincie Utrecht door de Fransen in 1672 verwoest (serietitel), RP-P-OB-77.101.jpg|Waverveen''\nFile:Huis van de Heer vande Weert, verwoest door de Fransen in 1672 't Huys vande Heer vande Weert (titel op object) Reeks van dertien afbeeldingen van de dorpen en kastelen in de provincie Utrecht door de Fransen in 1672 v, RP-P-OB-77.093.jpg|'t Huys vande Heer vande Weert (country house of the Lord vande Weert)\nFile:Het Huis Kroon-wyck van de heer Pauw, verwoest door de Fransen in 1672 t Huys Kroon-wyck van 'd Heer Pauw (titel op object) Reeks van dertien afbeeldingen van de dorpen en kastelen in de provincie Utrecht door de Frans, RP-P-OB-77.091.jpg|''t Huys Kroon-wyck van 'd Heer Pauw, country house Kroon-wyck owned by Mr. Pauw\nSaved country estates and fortresses\n- Kasteel Zuilichem (1657). Zuilichem Castle was saved because of the good relations of the Huygens family with the French court. Father Constantijn Huygens was a Dutch top diplomate and his son Christiaan Huygens was a research director in French service at the Académie des sciences in Paris.]]\nSome country estates, castles but also fortresses were saved from destruction by the French in 1672, including\n* Abcoude: Slot Abcoude, because the defense was too fierce.\n* Brakel: Kasteel Zuilichem, Zuilichem Castle at Zuilichem, thanks to the French warm relations of the Huygens family.\n* Breukelen, Ridderhofstad Oudaan or Oudaen at Zandpad: in 1672 the French destroyed the village of Breukelen, but this castle was spared because the inhabitants, the van der Burch family, were Catholic and the French general Louis, Grand Condé himself took up residence there.\n* Doorwerth: Kasteel Doorwerth.\n* Herwijnen: Kasteel Engelenburg\n* Kleve: Schenkenschanz was occupied without resistance and was not destroyed.\n* Laag-Keppel: Kasteel Keppel, in 1672 headquarters of the king Louis XIV.\n* Leersum: Huis Zuylenstein (in Dutch), also Zuylestein, saved by interference by stadtholder William III of England. This castle was only later destroyed in World War II, by allied aircraft.\n* Linschoten: castle Te Nesse was pillaged but not destroyed.\n* Loenersloot, Kasteel Loenersloot, Rijksstraatweg 211, was occupied by the French without destruction.\n* Maarssen: Country house H(a)erteveld was saved in 1672/1673.\n* Nijmegen: Fortress Knodsenburg (in Dutch) near Nijmegen was occupied by the French, but not destroyed.\n* Oud-Zuilen: Zuylen Castle was not destroyed thanks to the warm relations of the owners and inhabitants, the Van Tuyll van Serooskerken family, with thee French.\n* Voorst, Kasteel Nijenbeek. In 1673, squire Johan Thomas van Steenbergen received an exemption (\"sauve-garde\") from the French general the Duke of Limburg.\n* Wijk bij Duurstede, Kasteel Duurstede, Duurstede Castle, was saved during the French occupation in 1672-1674. The French commander mistook the castle for the home of the likeable mayor of Wijk bij Duurstede.\nDutch and French language literature\n17th century\n:) Getrouw advys aen de oprechte Hollanders; rakende hetgeen gepasseert is in de dorpen van Bodegrave en Swammerdam,.., 1674.]]\n* van Domselaer, Tobias, de Hooghe, Romeyn et al.: Het ontroerde Nederlandt door de wapenen des konings van Vrankryk, dat is Een waarachtigh verhaal van den Fransen, Engelsen, Keulsen en Munstersen oorlogh, tegen de Vereenigde Nederlanden, met desselfs binnelandtse beroerten, daer in naukeuriglijk alle der zelver voorvallen worden verhandelt, Markus Willemsz. Doornik, Amsterdam, 1674, 1676\n* (Wicquefort, Abraham de:)\n** Advis fidelle aux veritables Hollandois. Touchant ce qui s'est passé dans les villages de Bodegrave & Swammerdam, & les cruautés inoüies, que les François y ont exercées. Avec un memoire de la derniere marche de l'Armée du Roy de France en Brabant & en Flandre, [Den Haag], [Daniel en Johannes Steucker], 1673, 202 p. Illustraties Romeyn de Hooghe. Facsimile reprint: Kessinger Publishing, LLC, 2010, 236 p. . Illustrations on Wikimedia Commons.\n** Getrouw advys aen de oprechte Hollanders; rakende hetgeen gepasseert is in de dorpen van Bodegrave en Swammerdam, en de ongehoorde wreedtheden, die de Fransen aldaer gepleeght hebben; met een memorie van den koning van Vranckrijck door Brabant en Vlaanderen'', [Den Haag], 1674, 317 pagina's. Pdf at Wikimedia Commons.\n** Journael, of dagelijcksch verhael van de handel der Franschen in de steden van Uytrecht en Woerden, sedert hun koomst daer binnen, tot aan hun vertrek: daer in hun gruwelijcke wreetheyt en tyrannie, in dese twee plaetsen, gelijck oock in verscheyde andere, T'Amsterdam : by Jan Claesz. ten Hoorn, Amsterdam 1674.\n19th century\n* Craandijk, J.: Wandelingen door Nederland, Haarlem 1883 2e druk\n* De Rijk, J. A.: Wandelingen door Gooi- en Eemland en omstreken, Arnhem 1967. Oorspronkelijk verschenen in De Gooi- en Eemlander, 1881, reprint 1905\n20th century\n* Blankenberg, Huub and Taselaar, Klaas: Historisch reisboek voor Nederland, Fibula-Van Dishoeck Bussum, Unieboek B.V. Bussum, 1983,\n* Klok, R. H. J.: Archeologisch reisboek voor Nederland, Fibula-Van Dishoeck Haarlem, Unieboek B.V. Bussum, 1977,\n* Munnig Schmidt, E. and Lisman, A. J. A. M., met tekeningen van Schut, C. J. Th: Plaatsen aan de Vecht en de Angstel, Canaletto, Alphen aan de Rijn, 1993,\n* Olde Meierink, Ben et al.: Kastelen en ridderhofsteden in Utrecht, Uitgeverij Matrijs, Utrecht, 1995,\n* Wilmer, C. C. S.: Buitens binnen Utrecht, Kwadraat, 1982,\n21st century\n* Fafianie, Ton, Rijntjes, R., van der Wiel, Manon, and editor Stades-Visscher, Elisabeth: Nieuwegein Geschiedenis en architectuur. Monumenteninventarisatie Utrecht, Zeist 2002,\n* Jas, J., Keverling Buisman, F., Storms-Smeets, E., te Stroete, A., Wingens, M., editor Vredenberg, J.: Kastelen in Gelderland, Uitgeverij Matrijs, 2013,\n* Mansel, Philip: Lodewijk XIV. Koning van de wereld, Spectrum, 2019. Translation of King of the World: the Life of Louis XIV, Penguin, 2019\n* Munnig Schmidt, E. and Jonker-Duynstee, J. J. A. M.: Vechtgids. Culturele gids van de Vechtstreek, Oudheidkundig Genootschap Niftarlake, 2012,\n* van Nimwegen, Olaf: De Veertigjarige oorlog 1672-1712, Prometheus Amsterdam, 2019,\n* Panhuysen, Luc:\n** Oranje tegen de Zonnekoning : De strijd van Willem III en Lodewijk XIV om Europa, Atlas Contact, Amsterdam/Antwerpen, 2016,\n** Rampjaar 1672. Hoe de Republiek aan de ondergang ontsnapte, Olympus, 2019,\n* Op de Beeck, Johan: De zonnekoning. Glorie & schaduw van Lodewijk XIV, Horizon, 2018,\nReferences\nExternal links\nCastles\n* [https://www.absolutefacts.nl/kastelen/ www.absolutefacts.nl/kastelen Kastelen in Nederland, no year (in Dutch).] Redactie Ben Hendriks (Geschiedenis, Koninklijk Huis en Kastelen) and Ruud van Capelleveen (eindredacteur). Consulted on 18 November 2020.\n* [https://www.kasteleninnederland.nl www.kasteleninnederland.nl 2020 John Wennips: ''Middeleeuwse kastelen in Nederland. Van ruim 1300 kastelen zijn foto's en publicaties verzameld, 2020 (in Dutch).] Consulted on 9 November 2020.\n* [http://www.kasteleninutrecht.eu/ www.kasteleninutrecht.eu Kees Braaksma: Kastelen en buitenplaatsen in Utrecht, 2020 (in Dutch).] Consulted on 18 November 2020. With references, such as Olde Meierink 1995, J.D.M. Bardet: Kastelenboek Provincie Utrecht, 5e druk, 1975 and C.C.S. Wilmer: Buitens in Utrecht, 1982.\nRampjaar, Disaster Year 1672-1673\n* [https://hetutrechtsarchief.nl/tentoonstellingen/14-tentoonstellingen/473-verwacht-expo-rampjaar-1672 Het Utrechts Archief: Expo Rampjaar 1672 - 1673, Tentoonstelling 13 december 2019 t/m 4 april 2021]. An exhibition on the Rampjaar (Disaster Year) 1672-1673 (in Dutch''). hetutrechtsarchief.nl. Consulted on 2 April 2021."
    }
  ]
}