{
  "content": [
    {
      "type": "text",
      "text": "# Listed buildings in Warcop\n\nWarcop is a civil parish in Westmorland and Furness, Cumbria, England. It contains 28 listed buildings that are recorded in the National Heritage List for England. Of these, one is listed at Grade&nbsp;I, the highest of the three grades, two are at Grade&nbsp;II*, the middle grade, and the others are at Grade&nbsp;II, the lowest grade.  The parish contains the villages of Warcop and Sandford, and is otherwise rural.  All the listed buildings are in the villages, apart from a milestone on the A66 road.  Most of the listed buildings are houses and associated structures, and farmhouses and farm buildings.  The other listed buildings consist of a church, a churchyard cross, a maypole, a public house, and a bridge.\n__NOTOC__\nKey\n{| class=\"wikitable\"\n|-\n! Grade\n! Criteria\n|-\n|align=\"center\" |I\n| Buildings of exceptional interest, sometimes considered to be internationally important\n|-\n|align=\"center\" |II*\n| Particularly important buildings of more than special interest\n|-\n|align=\"center\" |II\n| Buildings of national importance and special interest\n|}\nBuildings\n{| class=\"wikitable sortable plainrowheaders\" style=\"width:100%; border:0; text-align:left; line-height:150%;\"\n|-\n! scope=\"col\"  style=\"width:150px\" |Name and location\n! scope=\"col\"  style=\"width:100px\" class=\"unsortable\"|Photograph\n! scope=\"col\"  style=\"width:120px\" |Date\n! scope=\"col\"  style=\"width:650px\" class=\"unsortable\"|Notes\n! scope=\"col\"  style=\"width:50px\" |Grade\n|-\n|St Columba's Church\n|\n|align=\"center\"|\n|The church has been altered and extended on a number of occasions, and the chancel was rebuilt in 1854–55 by J. S. Crowther.  The church is built in sandstone and has slate roofs, and a cruciform plan.  It consists of a nave, a south aisle, a south porch, north and south transepts, and a chancel.  At the west end of the church is a bellcote in the form of a turret, and adjacent to the south door is a large buttress.  The north wall of the nave is Norman, the north transept is in Early English style, the windows in the nave and the aisle are in Perpendicular style, and the 19th-century chancel is Early English.\n|align=\"center\" |\n|-\n|Churchyard cross\n|\n|align=\"center\"|\n|The cross is in the churchyard of St Columba's Church.  It is in stone, and consists of a large square plinth, and has the stump of a shaft with chamfered edges set into a socket.\n|align=\"center\" |\n|-\n|Maypole\n|\n|align=\"center\"|\n|The oldest part of the maypole is the base, which possibly dates back to the medieval period, and consists of steps constructed from blocks of sandstone.  On the steps is a wooden pole surmounted by a 20th-century weathervane.\n|align=\"center\" |\n|-\n|Entrance to vicarage\n|\n|align=\"center\"|\n|This consists of a doorway, moved from a different site, at the entrance to the grounds of the vicarage from the churchyard of St Columba's Church.  It is in stone, and has a moulded surround and an ogee head.\n|align=\"center\" |\n|-\n|Warcop Old Bridge\n|\n|align=\"center\"|\n|The bridge carries a road over the River Eden.  It is in stone, and consists of three segmental arches, each with a span of about , with splayed cutwaters.  Above the cutwaters are polygonal pedestrian refuges, the road way is about  wide, the parapets are about  high and they have segmental copings.  The bridge is also a scheduled monument.\n|align=\"center\" |\n|-\n|Warcop Hall\n|\n|align=\"center\"|\n|The oldest part of the country house is the west wing, the central block was added in 1744, and the house was extended to the east in the late 19th&nbsp;century.  The original part is in stuccoed sandstone.  The central block is in stone on a moulded plinth, with rusticated quoins, an eaves cornice, and stone copings.  The latest part has a chamfered plinth, quoins, and an embattled parapet on corbels.  All the roofs are in slate, and the house has two storeys.  The west wing has four bays and contains mullioned windows.  The central block has six bays, and circular steps lead up to a doorway that has an architrave with Ionic pilasters, and a pediment.  The windows are sash windows in architraves, and at the rear is a Venetian stair window.  The extension has a single bay, and contains a mullioned and transomed window in the ground floor and a mullioned window above.  At the east end is a mock pele tower dating from about 1850.\n|align=\"center\" |\n|-\n|Warcop Tower and Farmhouse\n|\n|align=\"center\"|\n|The house is built on the site of a medieval manor house, and the front was added in 1784.  It is in rendered stone, and has a slate roof with stone coping.  The house has two storeys, a symmetrical three-bay front, and a slate outshut at the rear.  The central doorway has a pediment, and the windows are sashes.\n|align=\"center\" |\n|-\n|Ramp barn and byres,Warcop Tower Farm\n|\n|align=\"center\"|1726\n|The farm buildings have an L-shaped plan, and are in stone with quoins.  There are three doors with segmental heads, one of which has a rusticated surround, a loft door with a segmental head, and other inserted doors and windows.  At the rear is a ramp leading to a wagon door.  Incorporated into the north wall are medieval stones carved with coats of arms.\n|align=\"center\" |\n|-\n|Threshing barn, Warcop Tower Farm\n|\n|align=\"center\"|1726\n|The barn is in stone on a plinth, it incorporates sandstone blocks and has quoins and a slate roof. In the centre is a wagon entrance with a chamfered surround, a dated jamb and an elliptical head.  To the right is a doorway with a monolithic segmental head.\n|align=\"center\" |\n|-\n|Walls, gates and gate piers,Warcop Hall\n|\n|align=\"center\"|\n|The gates are at the entry to the drive, and are flanked by quadrant walls with embattled parapets.  There are two pairs of square stone gate piers on moulded plinths with moulded caps and pyramidal finials, the central piers being slightly taller.  The gates date from the 19th&nbsp;century, and are wooden.\n|align=\"center\" |\n|-\n|Walls and piers, Warcop Tower\n|\n|align=\"center\"|\n|The low walls flank the northern entrance to the house, and are in sandstone with chamfered copings.  There is a pair of gate piers, and smaller end piers.  All the piers are square and rusticated, and have ogee caps.\n|align=\"center\" |\n|-\n|Bridge End House\n|\n|align=\"center\"|\n|A rendered stone house with rusticated quoins and a slate roof.  There are two storeys and a symmetrical front of three bays.  In the centre is a doorway with an architrave, and the windows are sashes in stone surrounds.\n|align=\"center\" |\n|-\n|Walls and railings, Bridge End House\n|\n|align=\"center\"|\n|The walls enclose the garden at the front of the house.  They are in stone with segmental copings, and carry wrought iron railings with pointed standards and corkscrew twists at the top.  Between the sections are cast iron posts with urn finials.  The central gate is in wrought iron, and has iron-twist and scrollwork decoration.\n|align=\"center\" |\n|-\n|Chamley Arms\n|\n|align=\"center\"|\n|Originally a house, a cottage, and a barn, later combined into a public house.  It is in rendered stone, with rusticated quoins to the house and cottage, and with a slate roof.  There are two storeys and eight bays.  In the former house are two doorways with rusticated surrounds, and all the windows are sashes.\n|align=\"center\" |\n|-\n|The Fox, barn and garage\n|\n|align=\"center\"|\n|The house, barn and former cottage are in rendered stone, all have two storeys, the house and barn have stone-flagged roofs, and the former cottage has a slate roof.  The house has quoins, a symmetrical front of three bays, and a central door and sash windows in stone surrounds.  The barn to the right is lower and recessed, and has a garage door in the ground floor and a loft door above.  Further to the right, the former cottage is further recessed, and has doors and fixed windows.\n|align=\"center\" |\n|-\n|Gardener's Cottage and two adjoining properties\n|\n|align=\"center\"|\n|A row of three rendered stone cottages with two storeys and a slate roof, hipped at the south end.  Gardener's Cottage, to the north, and the adjoining cottage are similar, with west fronts of three bays, a central doorway, and sash windows.  The cottage to the south has a door on the south front flanked by fixed windows, and the other windows are sashes.\n|align=\"center\" |\n|-\n|House and cottage,north-west of Sandford Hall\n|\n|align=\"center\"|\n|The house and adjoining cottage are in stone with two storeys, and have slate roofs with stone copings. The house has three bays, a central doorway in an architrave with a segmental pediment, and sash windows in architraves.  The later cottage to the left has two bays, one casement window and sash windows, all in stone surrounds.\n|align=\"center\" |\n|-\n|Warcop House\n|\n|align=\"center\"|\n|The house is in rendered stone on a plinth, with rusticated quoins, a band, an eaves cornice, and hipped slate roofs.  It has a U-shaped plan, two storeys, and a symmetrical five-bay front.  In the centre is a portico with four Doric columns.  The windows are sashes; in the ground floor they are in architraves with cornices on consoles, and in the upper floor they have stone surrounds.\n|align=\"center\" |\n|-\n|Croft House\n|\n|align=\"center\"|\n|The house is in rendered stone on a plinth, and has rusticated quoins, a band, and a hipped slate roof with overlapping eaves.  There are two storeys and a symmetrical front of three bays.  On the front is a gabled, glazed wooden porch, and the windows are sashes in stone surrounds.\n|align=\"center\" |\n|-\n|Eden Gate\n|\n|align=\"center\"|\n|A large stuccoed house that was later subdivided, with a band, an eaves cornice, and a hipped slate roof.  There are two storeys and a symmetrical front of five bays.  In the centre of front is a Greek Doric prostyle porch, and the windows are sashes.\n|align=\"center\" |\n|-\n|House and railings adjoining Heather Cottage\n|\n|align=\"center\"|\n|A stone house with rusticated quoins, a band, and a slate roof.  There are two storeys and a symmetrical front of three bays.  The central doorway has a rusticated surround, and the windows are sashes in stone surrounds.  In front of the area are low walls with segmental coping carrying cast iron railings with ornate foliate spearhead standards.\n|align=\"center\" |\n|-\n|Milestone\n|\n|align=\"center\"|\n|The milestone is on the southwest side of the A66 road, and consists of a square stone, set at right angles to the road, about  high.  It is inscribed with the distances in miles to Brough and to Appleby.\n|align=\"center\" |\n|-\n|Shorgill House\n|\n|align=\"center\"|\n|Originally a house with a cottage to the left, later combined into one dwelling.  It is in rendered stone with a slate roof and has two storeys.  The house has quoins and a symmetrical three-bay front.  The central door has a stone surround and a cornice, and the windows are sashes. also in stone surrounds.  The cottage is recessed, it has two bays, and has a plank door and sash windows.\n|align=\"center\" |\n|-\n|Walls and gate, Shorgill House\n|\n|align=\"center\"|\n|The low walls in front of the house and garden are in sandstone with chamfered copings.  On the walls are wrought iron railings that have standards with a corkscrew twist to top, and the sections are divided by cast iron posts with urn and acorn finials.  In the centre is a wrought iron gate with iron-twist and scrollwork decoration.\n|align=\"center\" |\n|-\n|Gate piers and walls, Warcop House\n|\n|align=\"center\"|\n|Flanking the entrance to the drive are sandstone quadrant walls about  high with segmental copings.  The gate piers are square and rusticated, and have moulded plinths and caps with pyramidal finials.\n|align=\"center\" |\n|-\n|House to north-east of Warcop House\n|\n|align=\"center\"|\n|The house is in sandstone with quoins and a slate roof.  There are two storeys, a symmetrical three-bay front, and a rear outshut.  The central doorway has a stone surround and a rectangular fanlight, and the windows are sashes also in stone surrounds.\n|align=\"center\" |\n|-\n|Walls and railings, house to north-east of Warcop House\n|\n|align=\"center\"|\n|The walls on two sides of the garden in front of the house are in stone with segmental copings.  On the walls are wrought iron railings that have square standards with twisted spearhead, the sections separated by scrollwork panels with urn finials.  The gate is also in wrought iron and has iron-twist and scrollwork decoration.\n|align=\"center\" |\n|-\n|Courtyard group, Warcop House\n|\n|align=\"center\"|\n|This is a group of outbuildings around a cobbled courtyard, in stone and embattled.  In the centre is a four-centred entrance arch.  To the west of this is a two-storey stable block and a coach house; to the north is a dog-run and a wagon shed.  The buildings are linked to the west wing of the house by an embattled wall.\n|align=\"center\" |\n|-\n|War memorial\n|\n|align=\"center\"|1920\n|The war memorial stands in a triangular area at a road junction.  It is in red sandstone, and consists of an obelisk on a moulded plinth and a two-tiered base.  The obelisk has the carving of a laurel wreath at the top and a sword and rifle at the base.  Also on the obelisk are inscriptions and the names of those lost in the two World Wars.  The memorial is set in a square kerbed area surrounded by wooden posts and chains.\n|align=\"center\" |\n|-\n|}\nNotes and references\nNotes\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}