{
  "content": [
    {
      "type": "text",
      "text": "# List of international presidential trips made by Mohamed Muizzu\n\nThis is a list of international presidential trips made by Mohamed Muizzu, the 8th and current President of the Maldives, since he assumed the presidency on 17 November 2023.\nAs of May 2025, Mohamed Muizzu has made 18 trips to 12 countries.\nSummary\n*1 Visit: China, Turkey, Saudi Arabia, Antigua and Barbuda\n*2 Visits: United Arab Emirates, India\n*3 Visits: Singapore\n2023\n{| class=\"wikitable sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n!class=\"unsortable\" width=3|\n!Country\n!City Visited\n!Dates\n!class=\"unsortable\" |Details\n|-\n| rowspan=2 |\n|\n| Ankara\n| 26–30 November\n| State visit, at the invitation of President Recep Tayyip Erdoğan. He was accompanied by wife, Sajidha Mohamed and Government officials.\n|-\n|\n| Dubai\n| 30 November – 2 December\n| Working visit, Muizzu departed in Dubai for the 2023 United Nations Climate Change Conference. He delivered a National Statement at the High-level Segment of the COP28, Muizzu outlined the Maldives' expectations for COP28, emphasizing the importance of the Global Stocktake committing to a strategy that corrects the course towards a 1.5-degree trajectory in accordance with the Paris Agreement.\n|}\n2024\n{| class=\"wikitable sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n!width=3|\n!Country\n!City Visited\n!Dates\n!class=\"unsortable\" | Details\n|-\n| 2\n|\n| Beijing\n| 7–13 January\n| State Visit, following an invitation from the President of China, His Excellency Xi Jinping, President of China.\n|-\n| 3\n|\n| Dubai\n| 11–15 February\n| Working visit, to attend the World Governments Summit 2024, at the invitation of Sheikh Mohammed bin Rashid Al Maktoum, Ruler of Dubai.\n|-\n| 4\n| rowspan=2 |\n| rowspan=2 | Singapore\n| 21–23 March\n| Unofficial visit\n|-\n| 5\n| 30 April – 5 May\n| Unofficial visit\n|-\n| 6\n|\n| MakkahMadinah\n| 10–15 May\n| Official visit, to perform Umrah with the hospitality of King Salman bin Abdulaziz Al Saud of Saudi Arabia. He was accompanied by Mohamed Shaheem Ali Saeed, Sheikh Mohamed Latheef, Chief of Staff, Abdulla Fayaz, Ali Arif and Abdulla Nasir.\n|-\n| 7\n|\n| St. John's\n| 25–31 May\n| Working visit, to attend the Small Island Developing States (SIDS), held in St. John's, Antigua and Barbuda. He also co-chaired the conference, called on the international community to honour its past commitments and meet Small Island Developing States's tailored financing needs.\n|-\n| 8\n|\n| New Delhi\n| 9–11 June\n| State Visit, after accepting the invitation from Prime Minister Narendra Modi, to the third swearing in ceremony of the Prime Minister and Council of Ministers of India. This visit is Muizzu's first state visit to India since his Inauguration in November 2023.\n|-\n| 9\n|\n| Singapore\n| 26–28 August\n| Unofficial visit for medical purposes.\n|-\n| 10\n|\n| New York City, Trenton, New Jersey\n| 20–29 September 2024\n| Official visit, to attend the Seventy-ninth session of the United Nations General Assembly, delivered speech to the GA and will meet world leaders, and co-chair 2024 Summit of the Future.\n|-\n| 11\n|\n| New DelhiMumbaiAgraBangalore\n| 6–10 October 2024\n| State visit; First bilateral visit to India.\n|-\n| 12\n|\n| Riyadh\n| 11–12 November\n| Arab-Islamic summit 2024.\n|-\n|13\n|\n|Baku\n|12–15 November\n|2024 United Nations Climate Change Conference.\n|-\n|14\n|\n|London\n|20–29 November\n| Unofficial visit.\n|-\n|}\n2025\n{| class=\"wikitable sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n!width=3|\n!Country\n!City Visited\n!Dates\n!class=\"unsortable\" | Details\n|-\n| 15\n|\n| TallinnTartu\n| 13–16 January\n|Official visit at the invitation of Estonian president, Alar Karis.\n|-\n|16\n|\n|LiverpoolLeeds\n|1–5 April\n|Official visit to promote Maldivian tourism, meeting Maldivian students in the UK and visiting AXA Training Centre in Liverpool. Visiting the University of Leeds, Leeds Town Hall, and meeting with the Councilor of Leeds.}}\n|-\n|17\n|\n|Kuala LumpurPutrajaya\n|27–30 April\n|State visit at the invitation of Malaysian prime minister, Anwar Ibrahim. He witnessed the exchange of MoU's and EoN's between Malaysia and Maldives and received an honorary degree from the International Islamic University Malaysia. He also delievered a keynote.\n|-\n|18\n|\n|Mecca\n|1–9 June\n|Went to perform Hajj.\n|-\n|19\n|\n|Singapore\n|29 June–2 July\n|State visit, where he met with the Singaporean Prime Minister Lawrence Wong, attending a state banquet, witnessed the signing of agreements, visited the Tuas Port, ITE College Central, the Urban Redevelopment Authority, as well as Maldivian's living in the country. He conferred recognition awards for individuals that strengthened bilateral relations.\n|-\n|20\n|\n|London\n|15–19 July\n|Official visit, where he met Charles III, Commonwealth Secretary-General Shirley Ayorkor Botchwey, Speaker of the House of Commons Lindsay Hoyle, the All-party parliamentary group on the Maldives, the Foreign Secretary David Lammy. He also attended the Maldives–UK Business forum.\n|-\n|21\n|\n|Singapore\n|31 July–5 August\n|Unofficial visit.\n|-\n|22\n|\n|Beijing\n|29 August–4 September\n|Attending the Shanghai Cooperation Organisation and holding bilateral talks with other foreign leaders.\n|-\n|23\n|\n|Doha\n|14–16 September\n|Official visit to attend the 2025 Arab–Islamic extraordinary summit condemning the Israel's airstrike in Qatar.\n|}\nNotes\nReferences"
    }
  ]
}