{
  "content": [
    {
      "type": "text",
      "text": "# List of awards and honors received by Ted Kennedy\n\nDuring his lifetime, Senator Edward M. Kennedy received many awards and honors.\nHonorary degrees\n* In 1964, Kennedy gave the commencement address and received an honorary from Assumption College in Worcester, Massachusetts.  The same year, he received an honorary degree from Stonehill College in North Easton, Massachusetts, and also received another honorary degree and gave the commencement address at Saint Dunstan's University, Charlottetown, Prince Edward Island, Canada.\n* In 1966, Kennedy received the honorary degree of Doctor of Laws from Boston College.\n* In 1967, Kennedy was awarded the degree of Doctor of Humane Letters by St. Peter's College.\n* In 1969, Kennedy received an honorary degree from the University of Massachusetts Amherst, and gave the commencement speech.\n* In 1970, Kennedy received an honorary Doctor of Laws degree from Babson College.\n* In 1973, Kennedy received an honorary Doctor of Laws degree from Syracuse University.\n* In 1977, Kennedy received an honorary Doctor of Laws degree from the College of the Holy Cross.\n* In 2000, Kennedy received an honorary Doctor of Laws degree from Bentley University.\n* In 2006, Kennedy received an honorary degree from Springfield College.\n* On December 1, 2008, Kennedy received a final honorary degree of Doctor of Laws from Harvard University, his own undergraduate alma mater.  The University President Drew Gilpin Faust chose to honor Kennedy at a special ceremony, after the initial commencement awarding had to be postponed due to Kennedy's ongoing battle with a brain tumor.  Kennedy became only the fourth person to receive such a special ceremony from Harvard, following George Washington, Winston Churchill, and Nelson Mandela.\nHonorary knighthood\n{| style=\"border:1px solid #ccc; background:#f9f9f9;\"\n|-\n|\n|-\n|\n|-\n| KBE ribbon and badge\n|}\nIn a speech to Congress on March 4, 2009, Prime Minister of the United Kingdom Gordon Brown announced that Kennedy had been granted an honorary knighthood by Queen Elizabeth II for his work in the Northern Ireland peace process, and for his contribution to UK–US relations. To an American citizen, this dignity is purely honorary, and therefore Kennedy was not entitled to the title of \"Sir Edward\", although he was able to use the post-nominal KBE (Knight Commander of the Order of the British Empire) outside the United States.\nKennedy released a statement saying he was \"deeply grateful\" for the \"extraordinary honor\".\n\"I have always prized the opportunity to work with the British government and strengthen and deepen the role of our two countries as leading beacons of democracy in the world\", Kennedy said. \"So for me this honor is moving and personal&mdash;a reflection not only of my public life, but of things that profoundly matter to me as an individual\".\nThe granting of an honorary knighthood to Kennedy caused controversy in the UK, due to his connections with Gerry Adams of the Irish republican political party Sinn Féin.\nOther\nIn 1997, Kennedy was honored as the Irish American of the Year by Irish America magazine.\nIn 1999 he received the Freedom medal.\nIn 2003, Kennedy received the George Bush Award for Excellence in Public Service from former President George H. W. Bush.\nIn 2006, Kennedy received the Lifetime Achievement Award from the National Association of Public Hospitals and Health Systems.\nIn 2007, Kennedy was awarded the Esperanza Leadership Award at the 2007 National Hispanic Prayer Breakfast in Washington, D.C. for his endeavors for comprehensive immigration reform.\nKennedy received the Order of the Aztec Eagle in July 2008 in recognition of his support for immigrants' rights. The order is the highest decoration that the Mexican government can bestow upon a foreigner.\nOn September 23, 2008, Kennedy was presented with the Order of Merit of Chile (Grand Cross class) by the Chilean President Michelle Bachelet for Kennedy's dedication to human rights and his support of the Chilean people during the country's years under a military regime. The Order is Chile's highest civilian award.\nIn 2009, Kennedy received the U.S. Senator John Heinz Award for Greatest Public Service by an Elected or Appointed Official, an award given out annually by Jefferson Awards (not to be confused with the Heinz Award of the Heinz Family Foundation).\nOn March 8, 2009, Kennedy received the John F. Kennedy Profile in Courage Award, as part of a 77th birthday celebration event at the Kennedy Center for the Performing Arts.\nOn March 10, 2009, it was announced that Kennedy would receive the National Association of State Boards of Education's Lifetime Achievement Award, for his contributions to public education during his time as a senator.\nOn April 25, 2009, Kennedy received the annual Cancer Compassion Award from the George Washington University Medical Center.\nOn June 26, 2009, Kennedy received the Henry Clay Medallion for Distinguished Service from the Henry Clay Memorial Foundation, in recognition of his record of bipartisan collaboration in the Senate.\n{| style=\"border:1px solid #ccc; background:#f9f9f9;\"\n|-\n| style=\"width:106px;\"|\n|-\n|\n|-\n| Presidential Medal of Freedom ribbon and medal\n|}\nKennedy was awarded the Presidential Medal of Freedom on July 30, 2009.  The statement from the Obama administration said that Kennedy \"has been one of the greatest lawmakers – and leaders – of our time.\"\nOn September 15, 2009, three weeks after Kennedy's death, it was announced by the United Nations High Commissioner for Refugees that Kennedy had been given its annual Nansen Refugee Award for \"his achievements as an unparalleled champion of refugee protection and assistance for more than 45 years.\" The statement also reads: \"UNHCR is grateful it was able to inform Senator Kennedy of the Nansen Committee's decision in June, and deeply saddened by his passing.\"\nIn October 2022, the Government of Bangladesh posthumously conferred Kennedy with the Friends of Liberation War Honour for his outspoken support for the Bangladesh cause during the Bangladesh Liberation War and criticism of the Nixon administrations complicity in genocide and war crimes in Bangladesh. The Prime Minister Sheikh Hasina stated \"I recall with gratitude the great contributions of late senator Edward M Kennedy Sr to our Liberation War\". The award was accepted by his son, Edward M. Kennedy Jr. who was on a seven day visit with his family to Bangladesh to commemorate 50 years of Bangladesh-US relations.\nCoat of arms\nIn 1961, President John F. Kennedy was presented with a grant of arms for all the descendants of Patrick Kennedy from the Chief Herald of Ireland. The arms of the Kennedy family are black with three gold helmets depicted upon it, within a border that is divided into red and ermine segments, and strongly alludes to the symbols in the coats of arms of the O'Kennedys of Ormonde and the Fitzgeralds of Desmond from whom the family is believed to be descended. The crest is an armored hand holding four arrows between two olive branches, elements taken from the coat of arms of the United States of America and also symbolic of Kennedy and his brothers. The coat of arms is described in heraldic terms as, Sable three helmets in profile Or within a bordure per saltire gules and ermine, and the crest is, Between two olive branches a cubit sinister arm in armor erect the hand holding a sheaf of four arrows points upward all proper on a torse Or and sable, while the mantling is gules doubled argent.\nReferences"
    }
  ]
}