{
  "content": [
    {
      "type": "text",
      "text": "# List of San Diego Asian Film Festival award winners\n\nThe following is a list of San Diego Asian Film Festival winners by year.\n2024 - 25th Annual\nNovember 7–16, 2024\nAward Winners\n* Grand Jury Award - Light of the Setting Sun (dir. Vicky Du)\n* Best Narrative Feature - ''Moloka'i Bound (dir. Alika Tengan)\n* Best Documentary Feature - Standing Above the Clouds (dir. Jalena Keane-Lee)\n* Best Narrative Short - Myself When I Am Real (dir. Angeline Gragasin)\n* Best Documentary Short - Wouldn't Make It Any Other Way (dir. Hao Zhou)\n* Best Experimental Short - I Would've Been Happy (dir. Jordan Wong)\n* International Short  - The Inescapable Desire of Roots (dir. Mark Chua and Lam Li Shuen)\n* Special Jury Mention All That We Love (dir. Yen Tan)\n* Emerging Filmmaker Award - History as Hypnosis (dir. Alison Nguyen)\n* Audience Award Winner - Home Court (dir. Erica Tanamachi)\nNotable Events and Appearances\n* Notable Films: international premiere of Cells at Work! live action film, world premiere of Tura Satana documentary\n2023 - 24th Annual\nNovember 2–11, 2023\nAward Winners\n* Grand Jury Award - When You Left Me On That Boulevard (dir. Kayla Abuda Galang)\n* Best Narrative Feature - Egghead & Twinkie (dir. Sarah Kambe Holland)\n* Best Documentary Feature - Rally (dir. Rooth Tang)\n* Best Narrative Short - Invasive Species (dir. Annie Ning)\n* Best Documentary Short - Tracing History (dir. Jalena Keane-Lee)\n* Best Experimental Short - Teetering Graphite (dir. Cherlyn Hsing-Hsin Liu)\n* International Short  - Primetime Mother (dir. Sonny Calvento)\n* Special Jury Mention Through Sunless Ways (dir. Kira Dane, Katelyn Rebelo)\n* Emerging Filmmaker Award - Divine Factory (dir. Joseph Mangat)\n* Audience Award Winner - Wonderland (dir. Chai Yee Wei)\nNotable Events and Appearances\n* Notable Films: Monster, Elegies with Ann Hui in attendance\n2022 - 23rd Annual\nNovember 3–12, 2022\nAward Winners\n* Grand Jury Award - Wisdom Gone Wild (dir. Rea Tajiri)\n* Best Narrative Feature - Riceboy Sleeps (dir. Anthony Shim)\n* Best Documentary Feature - Bad Axe (dir. David Siev)\n* Best Narrative Short - Last Hawaiian Sugar (dir. Déjà Cresencia Bernhardt)\n* Best Documentary Short - In Loving Memory (of Who We Used to Be) (dir. Vicky Lee)\n* Best Experimental Short - Declarations of Love (dir. Tiff Rekem)\n* International Short  - Will You Look at Me (dir. Shuli Huang)\n* Special Jury Mention - Lucky Fish (dir. Emily May Jampel)\n* Emerging Filmmaker Award - Liquor Store Dreams (dir. So Yum Um)\n* Audience Award Winner - Riceboy Sleeps (dir. Anthony Shim)\nNotable Events and Appearances\n* Notable Films: A Confucian Confusion 4K restoration, No Bears\n2021 - 22nd Annual\nOctober 28 to November 6, 2021\nAward Winners\n*Grand Jury Award - I Was A Simple Man  (dir. Christopher Makoto Yogi)\n* Best Narrative Feature - 7 Days (dir. Roshan Sethi)\n* Best Documentary Feature - Manzanar Diverted: When Water Becomes Dust (dir. Ann Kaneko)\n* Best Narrative Short - Americanized (dir. Erica Eng)\n* Best Documentary Short - An Uninterrupted View of the Sea (dir. Mika Yatsuhashi)\n*Best Experimental Short - Rumi and his Roses (dir. Navid Sinaki)\n* International Short  - Lemongrass Girl (dir. Pom Bunsermvicha)\n* Special Jury Mention - To Live Here (dir. Melanie Dang Ho)\n*Emerging Filmmaker Award - Never Rest/Unrest (dir. Tiffany Sia)\n* Audience Award Winner - Like a Rolling Stone: The Life and Times of Ben Fong-Torres (dir. Suzanne Joe Kai)\nNotable Events and Appearances\n* Notable Films: Catch the Fair One, Drive My Car\n* Special Sections: Asian-American Panorama, Asia Pop!, Masters, Classics Restored, Taiwan Film Showcase\n2020 - 21st Annual\nOctober 23–31, 2020\nAward Winners\n*Grand Jury Award - Mizuko (Water Child) (dir. Katelyn Rebelo, Kira Dane)\n* Best Narrative Feature - Mogul Mowgli (Bassam Tariq)\n* Best Documentary Feature - The Donut King (Alice Gu)\n* Best Narrative Short - Thank You, Come Again (Nirav Bhakta)\n* Best Documentary Short - I Bought a Time Machine (Yeon Park)\n* Best Animated Short - Felt Love (Angeline Vu and Arlene Bongco)\n* International Short  - Red Aninsri; or, Tiptoeing on the Still Trembling Berlin Wall (Ratchapoom Boonbunchachoke)\n* Special Jury Mention - Finding Yingying (Jiayan “Jenny” Shi)\n*George C. Lin Emerging Filmmaker Award - Stray (Elizabeth Lo)\n* Audience Award Winner - Down a Dark Stairwell (Ursula Lang)\nNotable Events and Appearances\n*Notable Films: 76 Days, Mogul Mowgli\n* Special Events (Pandemic Specials): Virtual Cinema options, Drive-In Movies, Q&As on Twitch, 16mm x Twitch, Mystery Kung Fu Theater, Taiwan Showcase, Virtual Lobby on Animal Crossing\n2019 - 20th Annual\nNovember 7–16, 2019\nAward Winners\n* Grand Jury Award - Straight Up (James Sweeney)\n* Best Narrative Feature - Driveways (Andrew Ahn)\n* Best Documentary Feature - The Cancer Journals, Revisited (Lana Lin)\n* Best Narrative Short - First (Micaela Durand & Daniel Chew)\n* Best Documentary Short - My American Surrogate (Leslie Tai)\n* Best Animated Short - Umbilical (Danski Tang)\n* International Short  - Grand Bouquet (Nao Yoshigai)\n* Special Jury Mention - Jaddoland  (Nadia Shihab)\n* George C. Lin Emerging Filmmaker Award - No Data Plan (Miko Revereza)\n* Audience Award Winner - Yellow Rose (Diane Paragas)\nNotable Events and Appearances\n* Opening Night Film: The Paradise We Are Looking For\n* Centerpiece: Straight Up\n* Closing Night: To Live to Sing\nSpecial Events: Taiwan Film Showcase, Spotlight on Tibet\n9th Spring Showcase\nApril 11–18, 2019\n* Opening Night Film: First Night Nerves\n* Closing Night Film: Ek Ladki Ko Dekha Toh Aisa Laga\n* Notable Films: Memories of My Body, Swing Kids, Song Lang, The Crossing\n* Special Events: From the Claws of Darkness: Restoring Philippine Cinema, Mystery Kung Fu Theater\n2018 - 19th Annual\nNovember 8–17, 2018\nAward Winners\n* Grand Jury Award: June\n* Best Narrative Feature: Bitter Melon\n* Best Documentary Feature: Blowin' Up\n* Best Narrative Short: First Generation\n* Best Documentary Short: Nai Nai\n* Best International Short: Babylon\n* Best Animated Short: Yoko\n* Special Jury Mention: Origin Story\n* George C. Lin Emerging Filmmaker Award: August at Akiko's (dir. Christopher Makoto Yogi)\n* Lifetime Achievement Award: Marcus Hu\n* Audience Award: One Cut of the Dead\nNotable Events and Appearances\n* Notable Films: Little Forest, Inventing Tomorrow, Ramen Shop\n*HBO Preview: Folklore\n8th Spring Showcase\nApril 19–26, 2018\n* Opening Night Film: Meditation Park\n* Closing Night Film: Kusama: Infinity\n* Notable Films: Minding the Gap, Love Education, Mukshin, The Third Murder,\n* Special Presentations: Falling for Angels: the Films of Yasmin Ahmad\n2017 - 18th Annual\nNovember 9–18, 2017\nAward Winners\n* Grand Jury Award: My Enemy My Brother, directed by Ann Shin\n* Narrative Feature: Wexford Plaza, directed by Joyce Wong\n* Documentary Feature: Out of State, directed by Ciara Lacy\n* Narrative Short: Float, directed by Tristan Seniuk & Voleak Sip\n* Documentary Short: Mother’s Day, directed by Elizabeth Lo & R.J. Lozada\n* Animated Short: Crushed in Spaces, directed by Janice Chun\n* International Short: Afternoon Clouds, directed by Payal Kapadia\n* Special Jury Mention: Santa Claus, directed by Jeff Man\n* Digital Pioneer Award: Angry Asian Man, directed by Phil Yu\n* George C. Lin Emerging Filmmaker Award: Anahita Ghazvinizadeh, director of They\n* Audience Award: Island Soldier, directed by Nathan Fitch\nNotable Events and Appearances\n* Notable Films: Oh Lucy!, A Better Man, The Villainess, Columbus and Newton.\n* Musical performance by actress/singer Tia Carrere.\n* Potluck Collective Podcasts: Saturday School, the Fresh Creatives and They Call Us Bruce.\n* Classic Films Restored: Shopping for Fangs (1997), Pigsy Eats Watermelon (1958) and The Little Sisters of the Grassland (1965).\n* Mystery Kung Fu Theater\n7th Spring Showcase\nApril 20–27, 2017\n* Notable Films: Gook, An Insignificant Man, The Long Excuse, Sunday Beauty Queen, Window Horses\n* Special Presentations:  “Right to Resist: From 9066 to 2017” featuring four documentary films and four shorts about political resistance.\n* Audience Award: Abacus: Small Enough to Jail\n2016 - 17th Annual\nNovember 3–12, 2016\nAward Winners\n* Grand Jury Award: The Lockpicker, directed by Randall Okita\n* Narrative Feature: Chee and T, directed by Tanuj Chopra\n* Documentary Feature: Bad Rap, directed by Salima Koroma\n* Narrative Short: Death in a Day, directed by Lin Wang\n* Documentary Short: Bruce Takes Dragon Town, directed by Emily Chao\n* Animated Short: Hold Me (Ca Caw Ca Caw), directed by Renee Zhan\n* Special Jury Mention: Random Acts of Legacy, directed by Ali Kazimi\n* George C. Lin Emerging Filmmaker Award: Andrew Ahn, director of Spa Night\n* Lifetime Achievement Award: Wayne Wang\n* Audience Award: Daze of Justice, directed by Michael Siv\nNotable Events and Appearances\n* Notable Films: The Tiger Hunter, Mifune: The Last Samurai\n* Standup comedy by Actor and Comedian Randall Park (Fresh Off the Boat, Trainwreck, The Interview).\n* Panel discussion with The Edge of Seventeen actor Hayden Szeto.\n6th Spring Showcase\nApril 28th - May 5th, 2016\n* Notable Films: Sweet 20, 3688, Born to Dance, Heart Attack, Honor Thy Father, Right Now, Wrong Then\n* Special Presentations:  “China Now: Independent Visions” featuring four film programs from works from the Beijing Independent Film Festival.\n* Audience Award: The Music of Strangers: Yo-Yo Ma and the Silk Road Ensemble (Morgan Neville)\n2015 - 16th Annual\nNovember 5–14, 2015\nAward Winners\n* Grand Jury Award: Distance Between, directed by R.J. Lozada\n* Narrative Feature: Crush the Skull, directed by Viet Nguyen\n* Documentary Feature: Operation Popcorn, directed by David Grabias\n* Narrative Short: Drama, directed by Tian Guan\n* Documentary Short: From Tonga, directed by Huay-Bing Law\n* Animated Short: Cuz He’s Black, directed by Ji Sub Jeong\n* Special Jury Mention: Reunification, directed by Alvin Tsang\n* George C. Lin Emerging Filmmaker Award: Takeshi Fukunaga, director of Out of My Hand\n* Lifetime Achievement Award: Tyrus Wong\n* Audience Award: Tyrus, directed by Pamela Tom\n* Digital Pioneer Award: BuzzFeed Motion Pictures\nNotable Events and Appearances\n* Notable Films: Miss India America, Seoul Searching, Made in Japan.\n* Panel discussion with Ken Jeong.\n* Discussion with BuzzFeed producer Eugene Lee Yang.\n5th Spring Showcase\nApril 16th-25th, 2015\n* Films: Top Spin, Giovanni’s Island, Margarita, With a Straw, Mariquina, My Brilliant Life, The Taking of Tiger Mountain 3D (Tsui Hark), Today\n* Special Presentation: Cinema Little Saigon, a retrospective of films and videos by Vietnamese Americans on the occasion of the 40th anniversary of the Fall of Saigon\n* Audience Award: Princess Jellyfish\n2014  - 15th Anniversary\nNov 6-14, 2014\nAward Winners\n* Grand Jury Award: Appropriate Behavior, directed by Desiree Akhavan\n* Narrative Feature: Man from Reno, directed by Dave Boyle\n* Documentary Feature: My Life in China, directed by Kenneth Eng\n* Narrative Short: Hypebeasts, directed by Jessica dela Merced\n* Documentary Short: Transformers: the Premake, directed by Kevin B. Lee\n* Animated Short: Behind My Behind, directed by David Chai\n* Special Jury Mention: Kumu Hina, directed by Dean Hamer and Joe Wilson\n* George C. Lin Emerging Filmmaker Award: Vera Brunner-Sung, director of Bella Vista\n* Audience Award: Limited Partnership, directed by Thomas Miller\n* Digital Pioneer Award: Anna Akana\nNotable Events and Appearances\n* Notable Films: Revenge of the Green Dragons, The Kingdom of Dreams and Madness and Meet the Patels.\n* Pilot episode of Fresh Off the Boat screening.\n* Taiwan Films Showcase\n* Remembering Queer Korea Reception\n4th Spring Showcase\nApril 17–24, 2014\n* Notable Films: Like Father, Like Son, How to Fight in Six Inch Heels, Miss Granny, The Protector 2, Siddharth, Why Don’t You Play in Hell?\n* Special Presentation: Live performances of 18 Mighty Mountain Warriors\n* Audience Award Winner: To Be Takei\n2013 - 14th Annual\nNovember 7–16, 2013\nAward Winners\n* Grand Jury Award: Karaoke Girl, directed by Visra Vichit-Vadakan\n* Narrative Feature: Sake-Bomb, directed by Junya Sakino\n* Documentary Feature: Your Day is My Night, directed by Lynne Sachs\n* Narrative Short: The Perils of Growing Up Flat-Chested, directed by Yulin Kuang\n* Documentary Short: Draft Day, directed by Josh Kim\n* Animated Short: The Present, directed by Joe Hsieh\n* Special Jury Mention: Documented, directed by Jose Antonio Vargas and Ann Lupo\n* Social Justice Award: When I Walk, directed by Jason DaSilva\n* George C. Lin Emerging Filmmaker Award: Leslie Tai\n* Audience Award: American Revolutionary: The Evolution of Grace Lee Boggs, directed by Grace Lee\nNotable Events and Appearances\n* Notable Films: Finding Mr. Right, Blind Detective, Norte: The End of History and Ip Man: The Final Fight.\n* Drive-By Cinema screenings of webseries premieres: Night Girls Crew and Flat3.\n* Mapping event for wheelchair accessibility with Jason DaSilva.\n3rd Spring Showcase\nApril 18–25, 2013\n* Opening Night Film: Linsanity\n* Closing Night Film: Jab Tak Hai Jaan\n* Notable Films: Abigail Harm, Comrade Kim Goes Flying, Kai Po Che, Key of Life, La Source, The Last Supper, Pieta, United Red Army\n* Audience Award: Harana\n2012 - 13th Annual\nNovember 1–9, 2012\nAward Winners\n* Grand Jury Award: Johnny Loves Dolores, directed by Clarissa de los Reyes\n* Narrative Feature: Graceland, directed by Ron Morales\n* Documentary Feature: Seeking Asian Female, directed by Debbie Lum\n* Narrative Short: Monday Monday, directed by Eric K. Yue\n* Animated Short: 38-39°C, directed by Kangmin Kim\n* Special Jury Mention: The World Before Her, directed by Nisha Pahuja\n* George C. Lin Emerging Filmmaker Award: Ernie Park, director of Late Summer''\n* Lifetime Achievement Award: Chung Chang-wha\nNotable Events and Appearances\n* Notable Films: Don't Stop Believin': Everyman's Journey\n2nd Spring Showcase\nApril 19–26, 2012\n* Opening Night Film: Sunny\n* Closing Night Film: Zindagi Na Milegi Dobara\n* Notable Films: The Front Line, Headshot, I Wish, Life Without Principle, My Back Page, Patang (Prashant Bhargava), A Simple Life.\n2011 - 12th Annual\nAward Winners\n* Grand Jury Award: Surrogate Valentine, directed by Dave Boyle\n* Narrative Feature: In the Family, directed by Patrick Wang\n* Documentary Feature: Tales of the Waria, directed by Kathy Huang\n* Narrative Short: Andy, directed by Andrew Ahn\n* Documentary Short: Making Noise in Silence, directed by Mina T. Son\n* Animated Short: Enrique Wrecks the World, directed by David Chai\n* Special Jury Mention: The LuLu Session, directed by S. Casper Wong\n* George C. Lin Emerging Filmmaker Award: Patrick Wang, director of In the Family\n* Lifetime Achievement Award: Nancy Kwan\n* Audience Award: The Power of Two, directed by Marc Smolowitz\nNotable Events and Appearances\n* Honored Gala Guests: the Board of San Diego County Supervisors, the director of the San Diego Chinese Historical Museum and the Principal of Barnard Mandarin Chinese Magnet School.\n1st Spring Showcase\nApril 15–22, 2011\n* Opening Night Film: Little Big Soldier (Ding Sheng)\n* Closing Night Film: Boy (Taika Waititi)\n* Films: Getting Home, Hansel & Gretel, The House of Suh, The Man from Nowhere, One Voice, Patisserie Coin De Rue, Poetry (Lee Chang-dong), Saigon Electric\n* Special Presentation: Japan earthquake fundraiser screening of A Tale of Mari & Three Puppies.\n2010 - 11th Annual\nAward Winners\n* Grand Jury Award: The House of Suh, directed by Iris Shim\n* Narrative Feature: Littlerock, directed by Mike Ott\n* Documentary Feature: Finding Face, directed by Skye Fitzgerald and Patti Duncan\n* Narrative Short: Works of Art, directed by Andrew Pang\n* Documentary Short: Top Spin, directed by Sara Newens and Mina T. Son\n* Animated Short: The Wonder Hospital, directed by Beomsik Shimbe Shim\n* George C. Lin Emerging Filmmaker Award: Nadine Truong\n* Influential Asian American Artist Award: Daniel Dae Kim\n* Audience Award: One Voice, directed by Lisette Flannery\nNotable Events and Appearances\n* Asian Americans in Hollywood (Panel) - featuring: Ellen Wong, Harry Shum, Aaron Yoo, Jon M. Chu, and CS Lee.\n2009 - 10th Anniversary\nAward Winners\n* Grand Jury Award: Children of Invention, directed by Tze Chun\n* Narrative Feature: Children of Invention, directed by Tze Chun\n* Documentary Feature: Whatever It Takes, directed by Christopher Wong\n* Narrative Short: A Green Mountain In a Drawer, directed by Hwa-Jun Lee\n* Documentary Short: Rough Cut, directed by Firouzeh Khosrovani\n* Animated Short: Kudan, directed by Taku Kimura\n* Special Jury Mention: A Song For Ourselves, directed by Tadashi Nakamura\n* George C. Lin Emerging Filmmaker Award: Mark Tran, director of All About Dad\n* Audience Award: White on Rice, directed by David Boyle\nNotable Events and Appearances\n* Notable Screenings: Red Cliff, Afro Samurai Resurrection (TV), Detroit Metal City, Neko Ramen and Vampire Girl Vs. Frankenstein Girl.\n* Celebrity Appearances: Margaret Cho, Tamlyn Tomita, and Dante Basco.\n2008 - 9th Annual\nAward Winners\n* Grand Jury Award: Dirty Hands: the Art & Crimes of David Choe, directed by Harry Kim\n* Narrative Feature: Santa Mesa, directed by Ron Morales\n* Documentary Feature: Shame, directed by Mohammed Naqvi\n* Narrative Short: Lady, directed by Wendy Cheng\n* Animated Short: Meat Days, directed by Joe Hsieh\n* Special Jury Mention: Damn the Past!, directed by Julie Kang\n* Lifetime Achievement Award: Soon-Tek Oh\nNotable Events and Appearances\n* A Celebrity Panel: Asian Americans in Hollywood - featuring: Aaron Yoo, James Kyson Lee, Leonardo Nam, Smith Cho, Sheetal Sheth, and Jimmy Tsai.\n* From Comics to Film - featuring: Greg Pak and Jim Lee\n2007 - 8th Annual\nAward Winners\n* Grand Jury Award: Cats of Mirikitani, directed by Linda Hattendorf\n* Narrative Feature: Owl and the Sparrow, directed by Stephane Gauger\n* Documentary Feature: Na Kamalei: The Men of Hula, directed by Lisette Flanary\n* Narrative Short: Monsoon, directed by Shyam Balse\n* Documentary Short: Mookey’s Story, directed by Carolyn Goossen & Daffodil Altan\n* Animated Short: City Paradise, directed by Gaelle Denis\n* Music video: Champion by Native Guns, directed by Patricio Ginelsa\n* Lifetime Achievement Award: George Takei\n2006 - 7th Annual\nAward Winners\n* Grand Jury Award: Journey From the Fall, directed by Ham Tran\n* Narrative Feature: Eve & the Firehorse, directed by Julia Kwan\n* Documentary Feature: Last Atomic Bomb, directed by Robert Richter\n* Narrative Short: Hiro, directed by Matthew Swanson\n* Animated Short: Mirage, directed by Youngwoon Jang\n* Experimental: Latent Sorrow, directed by Shon Kim\n* Music Video: Steal the Blueprints, directed by Chris Deaner\n* Special Jury Mention: Colma: The Musical, directed by Richard Wong\n* Lifetime Achievement Award: Kieu Chin\n2005 - 6th Annual\nAward Winners\n* Grand Jury Award: Seibutsu: (Still Life), directed by Joe Turner Lin\n* Narrative Feature: The Motel, directed by Michael Kang\n* Documentary Feature: And Thereafter, directed by Hosup Lee\n* Narrative Short: Summer of the Serpent, directed by Kimi Takesue\n* Documentary Short: Daastar: Defending Sikh Identity, directed by Kevin Lee\n* Animated Short: Public Bath, directed by Tak Hoon Kim\n* Experimental: 5 x 90: The Wake, directed by Samuel Kiehoon Lee\n* Music Video: Psychokinetics: The Vault, directed by Gene Celso\n* Visionary Award: Saving Face, directed by Alice Wu\n* Lifetime Achievement: Joan Chen\n2004 - 5th Anniversary\nAward Winners\n* Grand Jury Award: The Magical Life of Long Tack Sam, directed by Ann Marie Fleming\n* Narrative Feature: First Morning, directed by Victor Vu\n* Documentary Feature: The Magical Life of Long Tack Sam, directed by Ann Marie Fleming\n* Narrative Short: Sangam, directed by Prashant Bhargava\n* Documentary Short: Yellow Brotherhood, directed by Tadashi Nakamura\n* Animated Short: Birthday Boy, directed by Sejong Park\n* Experimental: Balikbayan, directed by Larilyn Sanchez & Riza Manalo\n* Music Video: Skyflakes: Bad Thoughts, directed by Dino Ignacio\n2003 - 4th Annual\nAward Winners\n* Grand Jury Award: Refugee, directed by Spencer Nakasako\n* Narrative Feature: Book of Rules, directed by Sung H. Kim\n* Documentary Feature: Sleeping Tigers: The Asahi Baseball Story, directed by Jari Osborne\n* Narrative Short: Anniversary, directed by Ham Tran\n* Documentary Short: How to Make Kimchee, directed by Samuel Kiehoon Lee\n* Animated Short: Henry’s Garden, directed by Moon Seun\n* Experimental: Nothing But Love, directed by Wen-Yao Chuang\n2002 - 3rd Annual\nAward Winners\n* Grand Jury Award: Sophie, directed by Helen Lee\n* Narrative Feature: Charlotte Sometimes, directed by Eric Byler\n* Documentary Feature: Journey for Lotus, directed by Eunhee Cha\n* Narrative Short: Barrier Device, directed by Grace Lee\n* Documentary Short: BLT Genesis, directed by Evan Leong\n* Animated Short: Vessel Wrestling, directed by Lisa Yu\n* Experimental: Still I Rise, directed by Umesh Shukla\n2001 - 2nd Annual\nAward Winners\n* Grand Jury Award: Roads and Bridges, directed by Abraham Lim\n* Narrative Feature: Dog Food (Azucena), directed by Carlos Siguion-Reyna\n* Documentary Feature: Made in China, directed by Karin Lee\n* Narrative Short: Talk to Taka, directed by Richard Kim\n* Documentary Short: Bitter and Sweet, directed by Johanna Lee\n* Animated Short: Lint People, directed by Helder Sun\n* Experimental: Staccato Fugue, directed by Teo Carlo Pulgar\n2000 - Festival Launch\nAward Winners\n* Grand Jury Award: Karma Local, directed by Darshan Bhagat\n* Narrative Feature: The Debut, directed by Gene Cajayon\n* Documentary Feature: When You’re Smiling, directed by Janice Tanaka\n* Narrative Short: Mouse, directed by Greg Pak\n* Documentary Short: Shit, the Movie, directed by Julie Gaw\n* Experimental: By this Parting, directed by Mieko Ouchi\nReferences"
    }
  ]
}