{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in Palestine__disambig_1\n\n}}\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) World Heritage Sites are places of importance to cultural or natural heritage nominated by signatory countries to the World Heritage Convention of 1972. Cultural heritage comprises monuments (such as architectural works, monumental sculptures, or inscriptions), groups of buildings, and sites (including archaeological ones). Natural heritage comprises natural features (such as physical and biological formations), geological and physiographical formations (including habitats of threatened flora and fauna), and natural sites which are important for scientific research, conservation or natural aesthetic. Palestine accepted the convention on 8 December 2011, making its cultural and natural heritage sites eligible for inclusion on the list. There are five World Heritage Sites in the country: four in the West Bank and one in the Gaza Strip. In addition, the government of Palestine has placed 12 sites on its tentative list, meaning they intend to nominate them sometime in the future.\nThe first Palestinian World Heritage site was inscribed in 2012, being the \"Birthplace of Jesus: Church of the Nativity and the Pilgrimage Route, Bethlehem.\" The most recently inscribed Palestinian World Heritage Sites, , is the \"Saint Hilarion Monastery/ Tell Umm Amer\", being inscribed in 2024. Three sites, \"Palestine: Land of Olives and Vines – Cultural Landscape of Southern Jerusalem, Battir\", \"Hebron/Al-Khalil Old Town\", and \"Saint Hilarion Monastery/ Tell Umm Amer\", are on UNESCO's List of World Heritage in Danger. The site \"Birthplace of Jesus: Church of the Nativity and the Pilgrimage Route, Bethlehem\" was also endangered between 2012 and 2019.\nJordan proposed the site \"Old City of Jerusalem and its Walls\", located in East Jerusalem, to be listed, and UNESCO listed it with no attribution to any state, with respect to its still-disputed status on whether it belongs to Israel or Palestine. In 2011, responding to allegations that they were going to assign the site to a state, UNESCO responded, \"In line with relevant UN resolutions, East Jerusalem remains part of the occupied Palestinian territory, and the status of Jerusalem must be resolved in permanent status negotiations.\"\nDue to the conflict between the two countries, Israel has consistently opposed Palestine's presence in UNESCO and eventually left the organization in 2019, accusing it of being dismissive of Jewish ties to the land. Tell es-Sultan's inclusion as a Palestinian site was criticized by Israel's Foreign Ministry as \"distorted\" and \"another sign of Palestinians' cynical use of UNESCO and politicization of the organization\", while Palestine's Minister of Agriculture Riad Attari called it progress towards achieving the Palestinian right to return. Several scholars argued that the Israeli cabinet is the one politicizing heritage, with Israeli heritage organization Emek Shaveh noting that the part of Jericho claimed by Israel is not the one listed. In 2011, in response to Palestine's entry as a UNESCO member, both Israel and the United States stopped paying all UNESCO dues. Still dissatisfied with UNESCO's treatment of Palestine, both countries left UNESCO in 2017, although the United States later rejoined in 2023.\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural, and vii through x are natural. Four sites are in the West Bank and one in the Gaza Strip.|In danger|outline=silver}}\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (Governorate)\n! style=\"width:60px;\" scope=\"col\" | Year listed\n! style=\"width:50px;\" scope=\"col\" |\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" | Ancient Jericho/Tell es-Sultan\n|\n| Jericho Governorate\n| align=\"center\" | 2023\n| 1687; iii, iv (cultural)\n| This tell and the nearby village of Ein es-Sultan date to at least 10,500 BC. During the 9th to 8th millennia BC, humans began permanently settling here due to the presence of fertile soil and accessible water. Surviving neolithic architectural works include a sunk fence and a tower. During the Middle Bronze Age, this site went through significant urban development, such as establishing the city-state of Canaan.\n|-\n! scope=\"row\" | Birthplace of Jesus: Church of the Nativity and the Pilgrimage Route, Bethlehem\n|\n| Bethlehem Governorate\n| align=\"center\" | 2012\n| 1433; iv, vi (cultural)\n| Located  from Jerusalem, many Christians regard a cave here as the birthplace of Jesus. The Church of the Nativity is the oldest regularly-used church and has become a pilgrimage site. The main route from Jerusalem to Bethlehem, which also extends to the Damascus Gate, is believed to be the path Jesus' parents, Joseph and Mary, used. UNESCO listed it as a World Heritage in Danger due to the church's poor condition, but removed it from the list in 2019 following extensive exterior restoration.\n|-\n! scope=\"row\" style=\"background:#ffe6bd;\"| Hebron/Al-Khalil Old Town\n|\n| Hebron Governorate\n| align=\"center\" | 2017\n| 1565; ii, iv, vi (cultural)\n| Established during the Mamluk Sultanate in an area known for its limestone, Hebron is a pilgrimage site for Judaism, Christianity, and Islam. The site includes the Cave of the Patriarchs, also known as the Ibrahami Mosque, where Abraham and his family were allegedly buried. It is a sacred place for Judaism, Christianity, and Islam. Once a trade hub for nearby countries, Hebron was expanded under Ottoman rule, although the Mamluk architecture persists. The site was immediately listed as endangered.\n|-\n! scope=\"row\" style=\"background:#ffe6bd;\"| Palestine: Land of Olives and Vines – Cultural Landscape of Southern Jerusalem, Battir\n|\n| Bethlehem Governorate\n| align=\"center\" | 2014\n| 1492; iv, v (cultural)\n| Located between Hebron and Nablus, Battir's valleys and terraces are used for market gardening, farming grapevines and olive trees. Due to its mountainous terrain, underground irrigation channels were made to accommodate farmers, and an egalitarian water distribution system is employed. The cultural landscape also includes rock-cut tombs and watchtowers. The impacts of the Israeli–Palestinian conflict, including the construction of the West Bank barrier, have caused the site to be listed as endangered.\n|-\n! scope=\"row\" style=\"background:#ffe6bd;\"| Saint Hilarion Monastery/Tell Umm Amer\n|\n|Deir al-Balah Governorate\n| align=\"center\" | 2024\n|1749; ii, iii, vi (cultural)\n|This 4th-century monastery, located in the Nuseirat municipality, was named after saint Hilarion. Among the earliest in the Middle East, it was also the first in the Palestine region, triggering the spread of monasticism locally. Its members initially opted for solitude before turning coenobitic. Its location made it a crucial Afro-Asian cultural, religious, and economic hub. It was listed as endangered due to the bombing of the Gaza Strip since 2023.\n|}\nWorld Heritage Sites in East Jerusalem\nAlthough listed without a specific state attributed, UNESCO acknowledges the area to be within Palestine, hence its inclusion here.\n{| class=\"wikitable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (Governorate)\n! style=\"width:60px;\" scope=\"col\" | Year listed\n! style=\"width:50px;\" scope=\"col\" |\n! scope=\"col\" class=\"unsortable\" | Description\n|-\n! scope=\"row\" style=\"background:#ffe6bd;\" | Old City of Jerusalem and its Walls\n|\n|Jerusalem Governorate\n| align=\"center\" | 1981\n| 148rev; ii, iii, vi (cultural)\n|Jerusalem is a holy city for three Abrahamic religions: Christianity, Islam, and Judaism. One of its landmarks, the 7th-century Dome of the Rock, is believed by all three to be the location of the binding of Isaac. Other landmarks include the Western Wall, a worshipping site for Jews; and the Church of the Holy Sepulchre, whose rotunda is believed by Christians to be Jesus' burial site. Proposed by Jordan in 1980, the Old City was listed in 1981 and was listed as endangered in 1982. In 2000, Israel published a tentative extension of the site, but due to its still-debated status, the proposal is put on hold.\n|}\nTentative list\nIn addition to sites inscribed on the World Heritage List, member states can maintain a list of tentative sites for nomination consideration. Nominations for the list are only accepted if the site had been on the tentative list. Palestine has 12 properties on its tentative list.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:100px;\" scope=\"col\" | Location (governorate)\n! style=\"width:60px;\" scope=\"col\" | Year listed\n! style=\"width:50px;\" scope=\"col\" |\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\"| Anthedon Harbour\n|\n|Gaza Governorate\n| align=\"center\" | 2012\n|5719; ii, iv (cultural)\n|Anthedon was Gaza's first seaport between 800 BC to 1100 AD. Nearby is the ancient Maiumas seaport, once dubbed the Harbour of Gaza and a thriving city under Roman rule. The exact location of Anthedon remains ambiguous. However, a major theory is that it is at a tell named Tida, which was also Anthedon's nickname. Excavations on the coast revealed a Roman temple, a series of villas, and various architectural works from the Iron Age, Persian, Hellenistic, Roman and Byzantine eras.\n|-\n! scope=\"row\"| Baptism Site \"Eshria'a\" (Al-Maghtas)\n|\n|Jericho Governorate\n| align=\"center\" | 2015\n|6155; iii, iv, vi (cultural)\n|Located on the western bank of the Jordan River and the Jordan Rift Valley, this site is believed by Christians to be where Jesus was baptized, thus their third holiest site. It began seeing popularity from the 1st century BC up to the 15th century AD, and has become a popular baptism and tourism site among Christians. The eastern bank of the river is already a Jordanian World Heritage Site titled \"Baptism Site \"Bethany Beyond the Jordan\" (Al-Maghtas)\".\n|-\n! scope=\"row\"| El-Bariyah: wilderness with monasteries\n|\n| Jericho Governorate\n| align=\"center\" | 2012\n|5708; i, ii, iii (cultural)\n|Widely known as the Judaean Desert, this part of the Irano-Turanian Region is a diverse natural habitat, also classified an Important Bird Area. Three caves along the Wadi Khureitun were used as homes in the prehistoric period. One of these caves, Umm Qatafa, is the site of the earliest recorded domesticated fire use in Palestine. The site also includes the Herodium, a fortified palace that was adapted into one of the many monasteries in the area. The tentative El-Bariyah site also encompasses maqams (shrines) that were built during the advent of Islam.\n|-\n! scope=\"row\"| Hisham's Palace/ Khirbet al-Mafjar\n|\n|Jericho Governorate\n| align=\"center\" | 2020\n|6546; i, ii (cultural)\n|The palace was likely built by Hisham ibn Abd al-Malik, hence its name, at Wadi Nueima between 724 and 743 during the Umayyad Caliphate. Intended as a winter palace for the caliph, it was heavily impacted by the 749 Galilee earthquake. During the caliphate and the Abbasid dynasty, the northern area was used for agriculture. The palace features a star-shaped window that has become a symbol of Jericho. There was also a large audience hall, a mosque with a mihrab, and possibly a residence.\n|-\n! scope=\"row\"| Mount Gerizim and the Samaritans\n|\n|Nablus Governorate\n| align=\"center\" | 2012\n|5706; iii, vi (cultural)\n|Believers of Samaritanism identify Gerizim's main summit as where the Binding of Isaac occurred, and its temple as the correct holy site in lieu of the Temple Mount in Jerusalem. There was once a settlement area, and during the Roman Empire a temple of Zeus was built at the Tell er-Ras summit. A church was fortified in a religious revolt in 529 AD. The Samaritans continue to engage in rituals like the Passover sacrifice here, and they make pilgrimages to the summit annually.\n|-\n! scope=\"row\"| Old Town of Nablus and its environs\n|\n|Nablus Governorate\n| align=\"center\" | 2012\n|5714; ii, iv (cultural)\n|Tell Balata has been identified as an ancient urban city called Shechem which was established in the 4th millennium BC. After being abandoned during the Iron Age, it was reoccupied in the Hellenistic period. The Flavian dynasty re-founded it as Neapolis in 72,  from Tell Balata. It became a major city in the 2nd century; landmarks include a hippodrome and a Roman Temple of Zeus. The city was conquered by the Arabs in the second half of the 7th century, coming to be nicknamed \"little Damascus\" after the 10th century. The site was then a part of Medieval Nablus, the Kingdom of Jerusalem, Mamluk Sultanate, Ayyubid dynasty and Ottoman Syria. In the 18th century after earthquakes destroyed the city, it was rebuilt as Nablus, derived from the name Neapolis. The Old Town of Nablus is considered endangered due to effects of the Israeli–Palestinian conflict.\n|-\n! scope=\"row\"| QUMRAN: Caves and Monastery of the Dead Sea Scrolls\n|\n|Jericho Governorate\n| align=\"center\" | 2012\n|5707; iii, iv, vi (cultural)\n|The ascetic Jewish sect Essenes lived in Qumran during the Greco-Roman period. The Dead Sea Scrolls detailed their culture and beliefs, a unique insight into Judaism and early Christianity in the area. Contents include the biblical canon and apocrypha, the Community Rule, the Damascus Document, and The War of the Sons of Light Against the Sons of Darkness. Excavations revealed buildings like communal facilities, a library, and a cemetery. The area is currently occupied by Israel.\n|-\n! scope=\"row\"| Sebastia\n|\n|Nablus Governorate\n| align=\"center\" | 2012\n|5718; ii, v (cultural)\n|The former city in this site, ancient Samaria, was capital of the Kingdom of Israel. The Bible mentions it being acquired by Omri. Following the Neo-Assyrian reign, it was occupied and fortified in 332 BC by Alexander the Great. After a revitalization by Pompey, Herod the Great ruled the city and named it Sebastia after the Greek name of Augustus who gave him the land. Christians and Muslims believe that the city houses the tomb of John the Baptist. The current city was the eastern part of the Roman city.\n|-\n! scope=\"row\"| Umm Al-Rihan forest\n|\n|Jenin Governorate\n| align=\"center\" | 2012\n|5721; x (natural)\n|Located near the Green Line, this site is estimated to be 60,000-dunam, making it the largest woodlands in the West Bank. Part of the Mediterranean Biogeographic Region, it is notable as a migration stopover for birds, including endangered species like the lesser kestrel, crested honey buzzard, and Egyptian vulture. Fauna in the forest include endangered wolves and red foxes. Plant species include the original wild variants of barley and wheat. This diversity makes Umm Al-Rihan suitable for in-situ conservation.\n|-\n! scope=\"row\"| Throne Villages\n|\n|Ramallah and al-Bireh, Jenin, Nablus, Salfit, Hebron, and Tulkarm Governorates\n| align=\"center\" | 2013\n|5717; iii, iv (cultural)\n|This site comprises the villages within Palestine's central highlands. In the 18th and 19th centuries, the area was divided into 24 sheikhdoms, administrative regions ruled by sheikhs with wealthy or noble relations backed by the Ottoman Empire. They adopted feudalism and had a distinct architectural segregation between the sheikhs and the peasants: the former lived at higher altitudes, and had defensive walls built.\n|-\n! scope=\"row\"| Wadi Gaza Coastal wetlands\n|\n| Deir al-Balah and Gaza Governorates\n| align=\"center\" | 2012\n|5722; x (natural)\n|Wadi Gaza is most identified with its plethora of meanders, and the part of the watercourse in the Gaza Strip has eight. The river gradually widens as it nears its mouth which spans 100 meters. It is the meeting point of six other wadis. With Gaza being between Africa and Eurasia, this site is a common passage point for migratory birds, and the endemic Palestine sunbird is the most common. The wadi faces many environmental problems, most notably refugee camps using it as a landfill.\n|-\n! scope=\"row\"| Wadi Natuf and Shuqba cave\n|\n|Ramallah and al-Bireh Governorate\n| align=\"center\" | 2013\n|5712; ii, iii, iv (cultural)\n|The Natufian culture is a Late Epipaleolithic pre-agricultural culture discovered in the karstic Shuqba cave, which also housed two major prehistoric occupations: the Upper Levallois-Mousterian and Upper Natufian period. Their respective layers reveal tools like geometric microliths, as well as human burials. The settlers had a communal hunter-gatherer lifestyle, though they transitioned to being agricultural.\n|}\nSee also\n* List of Intangible Cultural Heritage elements in Palestine\n* Tourism in Palestine\n* List of World Heritage Sites in the Arab states\n* Destruction of cultural heritage during the Israeli invasion of the Gaza Strip\nReferences"
    }
  ]
}