{
  "content": [
    {
      "type": "text",
      "text": "# List of revolutions and coups d'état in Haiti\n\nThis article lists successful '''revolutions and coups d'état''' that have taken place in the history of Haiti:\n18th century\n* 1791 onward: Emergence of the State of Haiti; independence proclaimed in 1804 as a consequence of the Haitian Revolution and the disestablishment of the French colony of Saint-Domingue.\n19th century\n* 8 October 1820: Suicide of King Henri Christophe.\n* 13 February 1843: Deposition of President for life Jean-Pierre Boyer.\n* 15 January 1859: Deposition of Emperor Faustin Soulouque.\n* 15 April 1876: Deposition of President Michel Domingue.\n* 10 August 1888: Deposition of President Lysius Salomon.\n20th century\n* 2 December 1908: Deposition of President for life Pierre Nord Alexis.\n* 28 July 1915: Deposition and murder of President Vilbrun Guillaume Sam, triggering the U.S. occupation.\n* 11 January 1946: Deposition of president Élie Lescot (Revolution of 1946)\n* 10 May 1950: Deposition of president Dumarsais Estimé (1950 Haitian coup d'état)\n* June 14, 1957: Deposition of Daniel Fignolé.\n* 7 February 1986: Deposition of President for life Jean-Claude Duvalier (climax of the Anti-Duvalier protest movement).\n* 20 June 1988: Deposition of President Leslie Manigat (June 1988 coup d'état).\n* 18 September 1988: Deposition of President Henri Namphy (September 1988 coup d'état).\n* 29 September 1991: First deposition of President Jean-Bertrand Aristide (1991 coup d'état).\n21st century\n* 5–29 February 2004: Second deposition of President Jean-Bertrand Aristide (2004 coup d'état).\n* 7 July 2021: Assassination of President Jovenel Moïse\n* 24 April 2024: Acting Prime Minister of Haiti Ariel Henry, unable to return to the country after an international trip due to widespread gang violence, is forced to resign.\nSee also\n* List of coups d'état and coup attempts\n* List of coups d'état and coup attempts by country\n* Assassination of Jovenel Moïse\nReferences"
    }
  ]
}