{
  "content": [
    {
      "type": "text",
      "text": "# List of Intangible Cultural Heritage elements in Thailand\n\n]]\nThe United Nations Educational, Scientific and Cultural Organisation (UNESCO) intangible cultural heritage elements are the non-physical traditions and practices performed by a people. As part of a country's cultural heritage, they include celebrations, festivals, performances, oral traditions, music, and the making of handicrafts.\nBackground\nThe \"intangible cultural heritage\" is defined by the Convention for the Safeguarding of Intangible Cultural Heritage, drafted in 2003 and took effect in 2006. Inscription of new heritage elements on the UNESCO Intangible Cultural Heritage Lists is determined by the Intergovernmental Committee for the Safeguarding of Intangible Cultural Heritage, an organisation established by the convention.\nThailand ratified the convention on 10 June 2016.\nIntangible Cultural Heritage of Humanity\nRepresentative List\n{|class=\"wikitable sortable plainrowheaders\"\n! style=\"width:25%\" | Name\n! class=\"unsortable\"| Image\n! Year\n! No.\n! class=\"unsortable\"| Description\n|-\n! scope=\"row\"| Khon, masked dance drama in Thailand\n|\n| 2018\n| [https://ich.unesco.org/en/RL/khon-masked-dance-drama-in-thailand-01385 01385]\n| The Khon Masked Dance Drama is a performing art that combines musical, vocal, literary, dance, ritual, and handicraft elements. Khon performances – which involve graceful dance movements, instrumental and vocal renditions and glittering costumes – depict the glory of Rama, the hero and incarnation of the god Vishnu, who brings order and justice to the world.\n|-\n! scope=\"row\"| Nuad Thai, traditional Thai massage\n|\n| 2019\n| [https://ich.unesco.org/en/RL/nuad-thai-traditional-thai-massage-01384 01384]\n| Nuad Thai is regarded as part of the art, science, and culture of traditional Thai healthcare. As a non-medicinal remedy and manual therapy, it involves bodily manipulation in which the practitioner helps rebalance the patient's body, energy and structure to treat illnesses believed to be caused by the obstruction of energy flow along ‘sen’, lines understood to crisscross the human body.\n|-\n! scope=\"row\" | Nora, dance drama in southern Thailand\n|\n| 2021\n| [https://ich.unesco.org/en/RL/nora-dance-drama-in-southern-thailand-01587 01587]\n| Nora is a lively and acrobatic form of dance theatre and improvisational singing from southern Thailand. Performances normally include a long oral invocation, followed by a presentation by a lead character who dances with vigorous and elaborate movements of the legs, arms, and fingers. The main Nora performers – whether male or female – wear colourful costumes with crowns or headdresses, beads, bird-like wings tied around the waist, ornate scarves, and swan tails that give them a bird-like appearance.\n|-\n! scope=\"row\" | Songkran in Thailand, traditional Thai New Year festival\n|\n| 2023\n| [https://ich.unesco.org/en/RL/songkran-in-thailand-traditional-thai-new-year-festival-01719 01719]\n| In Thailand, Songkran refers to the sun's annual passing into the Aries constellation, the first sign of the Zodiac, which marks the traditional start of the new year. Occurring in mid-April after the rice harvest, it is a time when people reunite with their families and pay their respects to older adults, ancestors, and sacred Buddha images. Pouring water is a significant act during Songkran, symbolizing cleansing, reverence. and good fortune.  The tradition is passed on through participation in the festivities.\n|-\n! scope=\"row\" | Tomyum Kung\n|\n| 2024\n| [https://ich.unesco.org/en/RL/tomyum-kung-01879 01879]\n| Tomyum Kung is the Thai spicy and sour shrimp soup—a variant of tom yum, combined with many of Thailand's key herbal and seasoning ingredients, often served with a side of steamed rice, sometimes with a dollop of chili paste and a splash of lime juice, enhancing its spicy and tangy profile.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Kebaya: knowledge, skills, traditions and practices +\n|\n| 2024\n| [https://ich.unesco.org/en/RL/kebaya-knowledge-skills-traditions-and-practices-02090 02090]\n| Kabaya is an upper garment traditionally worn by women in Southeast Asia, notably in Brunei, Indonesia, Malaysia, Singapore, and Southern Thailand. It is also worn in parts of southern Philippines. Kebaya is an upper garment opened at the front that is traditionally made from lightweight fabrics such as brocade, cotton, gauze, lace, or voile and sometimes adorned with embroidery. The front is secured with either buttons, pins, or brooches. The lower garment for the outfit is known as sarong, kemben or kain, a long piece of cloth wrapped and tucked around the waist or under the armpits, either made out of batik, ikat, songket or tenun.\n|}\nTentative List\n{|class=\"wikitable sortable plainrowheaders\"\n! Name\n! class=\"unsortable\"| Image\n|-\n! scope=\"row\"| Muay Thai: Thai traditional boxing\n|\n|-\n! scope=\"row\"| Chud Thai: knowledge, craftsmanship and practices of the Thai national costume\n|\n|-\n! scope=\"row\"| Phakhaoma, a multifunctional cloth in Thai life\n|\n|}\nSee also\n* List of World Heritage Sites in Thailand\n* Culture of Thailand\n* Dance in Thailand\n* Khon\n* Traditional Thai massage\n* Menora (dance)\n* Songkran (Thailand)\n* Tom yum kung\n* Kebaya\nNotes\nReferences\nExternal links\n* [https://ich.unesco.org/en/home UNESCO Intangible Cultural Heritage]: Official site\n* [https://ich.unesco.org/en/state/thailand-TH UNESCO Intangible Cultural Heritage in Thailand]: Official site"
    }
  ]
}