{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1821\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1821.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland).  For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign.  Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\".  Acts passed from 1963 onwards are simply cited by calendar year and chapter number.\nAll modern acts have a short title, e.g. the Local Government Act 2003.  Some earlier acts also have a short title given to them by later acts, such as by the Short Titles Act 1896.\n1 & 2 Geo. 4\nThe second session of the 7th Parliament of the United Kingdom, which met from 23 January 1821 until 11 July 1821.\nThis session was also traditionally cited as 1 & 2 G. 4.\nPublic general acts\n}}\n|  for more effectually discovering the Longitude at Sea, and encouraging Attempts to find a Northern Passage between the Atlantic and Pacific Oceans, and to approach the Northern Pole.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  to allow the Importation into certain Ports in Nova Scotia and New Brunswick, of certain enumerated Articles and the Re-exportation thereof from such Ports.}}\n|  for staying Proceedings against any Governor or other Persons concerned in imposing and levying Duties in New South Wales; for continuing certain Duties; and for empowering the said Governor to levy a Duty on Spirits made in the said Colony.|note4= }}\n|  }}\n|  }}\n|  }}\n|  for the More effectual Encouragement of the Manufacture of Flax and Cotton in Great Britain.|note4= }}\n|  to continue certain Laws of Excise with regard to Crown Glass, and Flint and Phial Glass, and to alter certain Laws with regard to Flint Glass.|note4= }}\n|  }}\n|\n|\n|  and Solicitors, and other Purposes therein mentioned.|note4= }}\n|  }}\n|  }}\n|\n|  }}\n|\n|\n|  to that part of the United Kingdom called Ireland.}}\n|  }}\n|  }}\n|  }}\n| or the West Coast of Africa Possessions Act 1821|public|28|07-05-1821|archived=n|An Act for abolishing the African Company, and transferring to and vesting in His Majesty all the Forts, Possessions, and Property now belonging to or held by them.}}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  and in the Seventeenth Year of King George the Second, as inflicts Capital Punishment on Persons guilty of stealing to the Amount of Five Shillings out of or from Shops, Warehouses and other Outbuildings and Places, and to provide more suitable and effectual Punishment for such Offences.|note4= }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  for preventing Frauds committed by Bankrupts, as inflicts Capital Punishment on certain Offences therein specified; and to provide more suitable and effectual Punishment for such Offences.}}\n| or the Steam Engines Furnaces Act 1821|public|41|28-05-1821|archived=n|An Act for giving greater facility in the Prosecution and abatement of Nuisances arising from Furnaces used and in the working of Steam Engines.}}\n|  }}\n|  }}\n| or the House of Commons (Disqualification) Act 1821|public|44|28-05-1821|archived=n|An Act to exclude Persons holding certain Judicial Offices in Ireland, from being Members of the House of Commons.}}\n|  for consolidating and rendering more effectual the several Acts for the Purchase of Buildings, and further Improvement of the Street and Places near to West minster Hall and the Two Houses of Parliament.}}\n|  }}\n|  }}\n|  and Solicitors.|note4= }}\n|  relating to the Execution of Letters of Attorney and Wills of Petty Officers, Seamen and Marines, in His Majesty's Navy.|note4= }}\n| |note4= }}\n|  for explaining an Act made in the Twelfth Year of Queen Anne, intituled \"An Act to reduce the Rate of Interest without any Prejudice to Parliamentary Securities.\"}}\n|  }}\n|  }}\n|  }}\n|  }}\n|  for the better Relief Employment of the Poor.|note4= }}\n|  relating to Prisons in Ireland.}}\n|\n|  }}\n|  }}\n|  }}\n|\n| |note4= }}\n|  }}\n|\n| or the Second Canada Jurisdiction Act 1821|public|66|02-07-1821|archived=n|An Act for regulating the Fur Trade, and establishing a Criminal and Civil Jurisdiction within certain Parts of North America.}}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|\n|  }}\n|  for regulating Payments to the Treasurer of the Navy under the Heads of Old Stores and Imprests, and to make other Provisions in lieu thereof.|note4= }}\n|  }}\n|  }}\n|\n|  }}\n|\n|  }}\n|  as requires a Registry of Wool sent Coastwise.|note4= }}\n|  }}\n|  }}\n|  for granting certain Duties of Customs in Great Britain.|note4= }}\n|  }}\n|  for enabling William Blackall Simonds Esquire, to sell or mortgage his Estate and Interest in the Impropriate Rectory of Caversham, in the County of Oxford, free from the Claims of the Crown.}}\n|  Thirty third, Forty fourth and Forty fifth Years of His late Majesty King George the Third, for regulating the Importation and Exportation of Corn, Grain, Meal and Flour into and from Great Britain, and to make further Provisions in lieu thereof.|note4= }}\n|\n|  as restrains the Proprietors of Wharfs between London Bridge and the Temple from erecting any Buildings or Enclosures thereon.|note4= }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  for rendering the growing Produce of the Consolidated Fund of the United Kingdom, arising in Great Britain, available for the Public Service.|note4= }}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  for regulating the Trade of the Isle of Man, so far as relates to the Quantity of Muscovado Sugar to be imported into the said Island.|note4= }}\n|  }}\n|  }}\n|  as relates to the Purchase of Lands, Tenements, and Hereditaments, at Sheerness, in the County of Kent, and to vest certain Lands and Hereditaments at Gillingham in the said County, in Trustees, to be appropriated to the Public Service in the Department of the Navy.}}\n|  }}\n|\n|  }}\n|  }}\n|\n|  }}\n|\n|  relating to Bankrupts, as requires the Meetings under Commissions of Bankrupt to be holden in the Guildhall of the City of London; and for building Offices in the said City for the Meetings of the Com missioners; and for the more regular Transaction of Business in Bankruptcy.|note4= }}\n|  }}\n|  for the better Management of the Foundling Hospital in Dublin.|note4= }}\n|  }}\n|  }}\n|  }}\n|  for the effectual Examination of the Accounts of certain Colonial Revenues.|note4= }}\n|  }}\n|  for granting to His Majesty a Duty on Pensions and Offices in England; and an Act, made in the Thirty eighth Year of His late Majesty, for granting an Aid to His Majesty by a Land Tax to be raised in Great Britain, for the Service of the Year One thousand seven hundred and ninety eight.|note4= }}\n}}\nLocal acts\n}}\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|\n|  }}\n|\n|  }}\n|  for providing an additional Burying Ground for the Parish of Saint Pancras, in the County of Middlesex; and for altering and enlarging the Powers of an Act of the Fifty sixth Year of His late Majesty, for building a new Parish Church and Chapel for the said Parish.|note4= }}\n|  }}\n|  }}\n|\n|  }}\n| |local|29|19-04-1821|archived=n|An Act for continuing the Term, and amending, altering and enlarging the Powers, of an Act of His Majesty's Reign, for more effectually repairing the Road from Foston Bridge, in the County of Lincoln, to Little Drayton in the County of Nottingham.}}\n| |local|30|19-04-1821|archived=n|An Act for more effectually repairing and improving the Road from Newark upon Trent, in the County of Nottingham, to join the Road from Nottingham to Grantham, in the County of Lincoln, near the Guide Post on the Foss Road, near Bingham, in the said County of Nottingham.}}\n|\n|\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|\n|  }}\n|\n|  }}\n|\n|  }}\n|  }}\n|\n|\n|\n|\n|  }}\n|  }}\n|\n|\n|  }}\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|\n| or the Bedford Level Drainage and Ouse Navigation Act 1821|local|64|28-05-1821|maintained=y|archived=n|}}\n|\n|\n|  }}\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|  }}\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|\n|  }}\n|\n|  }}\n|\n|  }}\n| }}|local|95|28-05-1821|archived=n|An Act to rectify Mistakes in the Titles of Two Acts passed in the present Session of Parliament, the one for continuing the Term of an Act of His late Majesty’s Reign, for repairing the Road from Foston Bridge, in the County of Lincoln, to Little Drayton, in the County of Nottingham; and the other for repairing the Road from Newark-upon-Trent, in the said County of Nottingham, to join the Road in the said Act mentioned near\nBingham, in the said County of Nottingham.}}\n|  }}\n|\n|  }}\n|\n|  Fifty fourth, and Fifty sixth Years of His late Majesty, for enabling Commissioners to erect and maintain a new Gaol and other Buildings for the County and City of Edinburgh, and for opening Communications with the same; and to enable the Trustees for Turnpike and other High Roads in the said County of Edinburgh to advance further Sums of Money to the said Commissioners.}}\n|  }}\n|  }}\n|\n|\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|  }}\n|  for building a Bridge across the River Irwell from Water Street, in the Township of Salford, to Saint Mary's Gate, in the Township of Manchester.}}\n|\n|  for repairing the Road from Basingstoke, through Wortin and other Places in the County of Southampton, to Lobcomb Corner, in the County of Wilts, and other Roads in the County of Southampton.}}\n}}\nPrivate acts\n| )}} for inclosing Lands in the Parish of Moreton Valence, and in the Hamlet or Tything of Putloe in the Parish of Standish, both in the County of Gloucester.}}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n| |private|21|28-05-1821|repealed=n|archived=n|}}\n|\n|\n|\n| )}} and for amending and explaining the said Act.}}\n|\n|\n|\n|\n|\n|\n|\n| )}} for inclosing Lands in the of Llanrwst in the several Counties of Denbigh and Carnarvon.}}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n| |private|46|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|47|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|48|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|49|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|50|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|51|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|52|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|53|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|54|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|55|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|56|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|57|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|58|23-01-1821|note3=|repealed=n|archived=n|}}\n| |private|59|23-01-1821|note3=|repealed=n|archived=n|}}\n}}\nSources\n*\n*\n*\nSee also\n*List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}