{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1860\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1860.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland).  For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign.  Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\".\nSome of these acts have a short title. Some of these acts have never had a short title.  Some of these acts have a short title given to them by later acts, such as by the Short Titles Act 1896.\n23 & 24 Vict.\nThe second session of the 18th Parliament of the United Kingdom, which met from 24 January 1860 until 29 August 1860.\nPublic general acts\n| or the Supply Act 1860|public|2|12-03-1860|repealed=y|archived=n|An Act to apply the Sum of Four hundred and seven thousand six hundred and forty-nine Pounds out of the Consolidated Fund to the Service of the Year ending the Thirty-first Day of March One thousand eight hundred and sixty.|note4= }}\n| or the Supply (No. 2) Act 1860|public|3|23-03-1860|repealed=y|archived=n|An Act to apply the Sum of Four million five hundred thousand Pounds out of the Consolidated Fund to the Service of the Year One thousand eight hundred and sixty.|note4= }}\n|  of the annual Revision of the Valuation of Rateable Property in Ireland out of the Consolidated Fund.}}\n|  to Indian Bonds.|note4= }}\n|  }}\n|\n| or the Administering of Poison Act 1860|public|8|23-03-1860|repealed=y|archived=n|An Act to amend the Law relating to the unlawful administering of Poison.|note4= }}\n|  }}\n|  }}\n|\n| or the Supply (No. 3) Act 1860|public|12|31-03-1860|repealed=y|archived=n|An Act to apply the Sum of Eight hundred and fifty thousand Pounds out of the Consolidated Fund to the Service of the Year ending the Thirty-first Day of March One thousand eight hundred and sixty.|note4= }}\n|  }}\n|\n|\n| or the Municipal Corporation (Mortgages, &c.) Act 1860|public|16|15-05-1860|archived=n|An Act to make further Provision concerning Mortgages and other Dispositions of Property belonging to Municipal Corporations in England and Ireland.}}\n| or the Inclosure Act 1860|public|17|15-05-1860|archived=n|An Act to authorize the Inclosure of certain Lands in pursuance of a Report of the Inclosure Commissioners for England and Wales.}}\n|\n|  to facilitate the Improvement of Landed Property in Ireland, and Acts amending the same, to the Erection Dwellings for the Labouring Classes in Ireland.}}\n|  }}\n|  for better regulating the Business of Pawnbrokers.|note4= }}\n|  or the Customs Act 1860|public|22|15-05-1860|repealed=y|archived=n|An Act to amend the Laws relating to the Customs.|note4= }}\n| |public|23|25-05-1860|repealed=y|archived=n|An Act to provide for the Consideration of an Ordinance which has been laid before Parliament in a Report of the Oxford University Commissioners.|note4= }}\n|\n| or the Supply (No. 4) Act 1860|public|25|25-05-1860|repealed=y|archived=n|An Act to apply the Sum of Nine million five hundred thousand Pounds out of the Consolidated Fund to the Service of the Year One thousand eight hundred and sixty.|note4= }}\n| or the Common Lodging Houses (Ireland) Act 1860or the Common Lodging Houses Act 1860|public|26|25-05-1860|repealed=y|archived=n|An Act to remove Doubts as to the Application of \"The Common Lodging Houses Acts\" to Ireland, and to amend the Provisions of the same so far as they relate to Ireland.|note4= }}\n|\n|  commonly called \"Sir John Barnard's Act,\" and the Act of the Tenth Year of King George the Second, Chapter Eight.|note4= }}\n|  relative to malicious Injuries to Property.|note4= }}\n|  }}\n|\n|\n|\n|  }}\n|  to amend the Law for the better Prevention of the Sale of Spirits by unlicensed Persons and for the Suppression of illicit Distillation in Ireland.}}\n| or the Customs Act 1860|public|36|23-07-1860|repealed=y|archived=n|An Act to authorize the Appointment and Approval of Places for the warehousing of Goods for the Security of Duties of Customs.|note4= }}\n|  }}\n|\n|\n|  }}\n|  to amend the Law relating to Cheap Trains, and to restrain the Exercise of certain Powers by Canal Companies being also Railway Companies.|note4= }}\n| or the Dublin, Phoenix Park Act 1860|public|42|23-07-1860|archived=n|An Act to vest the Management of the Phoenix Park in the Commissioners of Public Works in Ireland.}}\n|\n|  relating to the Districts of Southampton, Leicester, Epsom, Coventry, Ipswich, Fareham, Wells, Tormoham, Scarborough, Ludlow, Banbury, Boston, Penrith, Barnsley, and Shipley; and for other Purposes in relation thereto.|po1=|po1short=n}}\n|  for preventing fishing for Trout or other Fresh-water Fish by Nets in the Rivers and Waters in Scotland.}}\n|\n|\n|\n|\n| or the Annuity-tax (Edinburgh and Montrose) Abolition Act 1860or the Annuity-Tax (Edinburgh and Montrose) Act 1860or the Annuity Tax Abolition (Edinburgh and Montrose &c.) Act 1860or the Annuity Tax in Edinburgh and Montrose Act 1860|public|50|23-07-1860|repealed=n|archived=n|An Act to abolish the Annuity Tax in Edinburgh and Montrose, and to make Provision in regard to the Stipends of the Ministers in that City and Burgh, and also to make Provision for the Patronage of the Church of North Leith.}}\n|\n| or the Metropolitan Building (Amendment) Act 1860|public|52|23-07-1860|repealed=y|archived=n|An Act to alter and amend \"The Metropolitan Building Act (1855).\"|note4= }}\n|  }}\n| or the '''Court of Queen's Bench Act Amendment Act 1860or the Crown Office Act 1860'''|public|54|06-08-1860|repealed=y|archived=n|An Act to amend an Act for abolishing certain Offices on the Crown Side of the Court of Queen's Bench, and for regulating the Crown Office.|note4= }}\n| or the Inclosure (No. 2) Act 1860|public|55|06-08-1860|archived=n|An Act to authorize the Inclosure of certain Lands in pursuance of a Special Report of the Inclosure Commissioners.}}\n|  }}\n| or the Dominica Hurricane Loan Act 1860|public|57|06-08-1860|repealed=y|archived=n|An Act to authorize an Extension of the Time for Repayment of a Loan made by the West India Relief Commissioners to the Island of Dominica.|note4= }}\n| |note4= }}\n| or the Universities and College Estates (Extension) Act 1860|public|59|06-08-1860|archived=n|An Act to extend the Provisions of the Universities and College Estates Act (1858), and of the Copyhold Acts, and of the Act of the Third and Fourth Years of the Reign of Her Majesty, Chapter One hundred and thirteen, and of the Seventeenth and Eighteenth Years of the same Reign, Chapter Eighty-four, so far as the same relate to Universities and Colleges.}}\n| |note4= }}\n|  }}\n| or the Census (No. 2) Act 1860|public|62|06-08-1860|repealed=y|archived=n|An Act for taking the Census of Ireland.|note4= }}\n|  to provide for the Relief of Her Majesty's Subjects professing the Jewish Religion.|note4= }}\n|\n|  }}\n|  }}\n|  for authorizing the Application of Highway Rates to Turnpike Roads.|note4= }}\n|  }}\n|\n|  to facilitate Arrangements for the Relief of Turnpike Trusts.}}\n|  }}\n| or the Endowment and Augmentation of Small Benefices (Ireland) Act 1860|public|72|06-08-1860|archived=n|An Act to promote and facilitate the Endowment and Augmentation of small Benefices in Ireland.}}\n| |note4= }}\n|  for the Regulation of Municipal Corporations in Ireland, with respect to the Appointment of Coroners in Boroughs.}}\n|\n| |note4= }}\n| or the Nuisances Removal and Diseases Prevention Act 1860|public|77|06-08-1860|repealed=y|archived=n|An Act to amend the Acts for the Removal of Nuisances and the Prevention of Diseases.|note4= }}\n|  }}\n| or the Sheriff Court Houses (Scotland) Act 1860|public|79|06-08-1860|archived=n|An Act to provide additional Accommodation for the Sheriff Courts in Scotland.}}\n|\n|  for consolidating the Copyhold and Inclosure Commissions and for completing Proceedings under the Tithe Commutation Acts.|note4= }}\n|  }}\n|  enabling Infants with the Approbation of the Court of Chancery to make binding Settlements of their Real and Personal Estate on Marriage.}}\n|  }}\n|  and of the Eighteenth Year of Her present Majesty relating to the Registration of Births Deaths and Marriages in Scotland.}}\n|  }}\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|  }}\n|\n|  so as to enable Towns and populous Places in Scotland to avail themselves of its Provisions for sanitary and other Improvements without at the same Time adopting its Provisions as regards the Establishment and Maintenance of a Police Force.|note4= }}\n| or the Railways (Ireland) Act 1860|public|97|13-08-1860|archived=n|An Act for amending and making perpetual the Railways Act, Ireland (1851). }}\n|  }}\n| or the Corrupt Practices Act 1854 Continuance Act 1860|public|99|20-08-1860|repealed=y|archived=n|An Act to continue the Corrupt Practices Prevention Act (1854).|note4= }}\n|  and of certain other Acts, as authorizes the Secretary of State in Council to give Directions for raising European Forces for the Indian Army of Her Majesty.}}\n|  }}\n|\n| or the Supply (No. 5) Act 1860|public|103|20-08-1860|repealed=y|archived=n|An Act to apply the Sum of Ten Millions out of the Consolidated Fund to the Service of the Year One thousand eight hundred and sixty.|note4= }}\n|  }}\n| or the Prisons (Scotland) Administration Act 1860|public|105|20-08-1860|archived=n|Act to provide for the Management of the General Prison at Perth, and for the Administration of Local Prisons in Scotland.}}\n| or the Lands Clauses Consolidation Act 1860|public|106|20-08-1860|repealed=n|maintained=y|archived=n|An Act to amend the Lands Clauses Consolidation Acts, 1845, in regard to sales and compensation for land by way of a rentcharge, annual feu duty or ground annual, and to enable Her Majesty’s Principal Secretary of State for the War Department to avail himself of the powers and provisions contained in the same Acts.}}\n|\n| |note4= }}\n|  }}\n| or the Customs Consolidation Act 1860|public|110|28-08-1860|repealed=y|archived=n|An Act to consolidate the Duties of Customs.|note4= }}\n|  }}\n|\n|\n|  }}\n|\n|\n|\n| or the Local Government Supplemental (No. 2) Act 1860|public|118|28-08-1860|archived=n|An Act to confirm certain Provisional Orders under the Local Government Act (1858), relating to the Districts of Nottingham, Sunderland, Hastings, Reading, Chatham, Dartmouth, Tunbridge Wells, Sheerness, Sandgate, Wilton, Bridgnorth, and Dorchester.|po1=|po1short=n}}\n|  }}\n|  }}\n| |note4= }}\n|  Section Eight.}}\n|  }}\n|  concerning the Management of Episcopal and Capitular Estates in England.}}\n|  }}\n|  }}\n| or the Attorneys and Solicitors Act 1860|public|127|28-08-1860|archived=n|An Act to amend the Laws relating to Attorneys, Solicitors, Proctors, and Certificated Conveyancers.}}\n| or the Chancery Evidence Act 1860or the Chancery Evidence Commission Act 1860|public|128|28-08-1860|repealed=y|archived=n|An Act to enable the Lord Chancellor and Judges of the Court of Chancery to carry into effect the Recommendations and Suggestions of the Chancery Evidence Commissioners by General Rules and Orders of the Court.|note4= }}\n|\n|\n|  }}\n|  }}\n|  }}\n| or the Roman Catholic Charities Act|public|134|28-08-1860|archived=n|An Act to amend the Law regarding Roman Catholic Charities.}}\n|\n|\n|  }}\n| |note4= }}\n| or the Gunpowder and Fireworks Act 1860|public|139|28-08-1860|repealed=y|archived=n|An Act to amend the Law concerning the making, keeping, and Carriage of Gunpowder and Compositions of an explosive Nature, and concerning the Manufacture, Sale, and Use of Fireworks.|note4= }}\n|  }}\n|  to restrain Party Processions in Ireland.|note4= }}\n|  }}\n|  to Titles to Land held by Burgage Tenure; and to amend the said Act.|note4= }}\n|  }}\n| or '''Lord Cranworth's Act 1860'|public|145|28-08-1860|repealed=y|archived=n|An Act to give to Trustees, Mortgagees, and others certain Powers now commonly inserted in Settlements, Mortgages, and Wills.|note4= }}\n|  for regulating Measures used in Sales of Gas.}}\n| |note4= }}\n|  }}\n|\n| or the Church Temporalities (Ireland) Act 1860|public|150|28-08-1860|archived=n|An Act further to amend certain Acts relating to the Temporalities of the Church in Ireland.}}\n|  }}\n|\n|\n| or the Landlord and Tenant Law Amendment Act (Ireland) 1860or 'Deasy's Act|public|154|28-08-1860|repealed=n|maintained=y|archived=n|An Act to consolidate and amend the Law of Landlord and Tenant in Ireland.}}\n}}\nLocal and personal acts\n|  }}\n|  to authorize the stopping up, altering, and constructing of certain Roads; and for other Purposes.}}\n|\n|  }}\n|\n|  }}\n|\n|  to enable the Inverness and Aberdeen Junction Railway Company to raise further Sums of Money; and for other Purposes.|note4= }}\n-\n|\n|\n|  }}\n|  }}\n|\n|\n|\n|\n|  }}\n|\n-\n|\n|  for amending and improving the Road from Glossop to Marple Bridge in the County of Derby, and the several Branches of Roads leading to and from the same, and to make other Provisions in lieu thereof.}}\n|  }}\n|\n|\n| or the Shrewsbury and Welshpool Railway Act 1860|local|25|15-05-1860|maintained=y|archived=n|An Act to enable the Shrewsbury and Welchpool Railway Company to complete and maintain Deviations in the Line and Levels of their Railway and to complete and maintain the same across certain Roads on a Level, and to raise a further Sum of Money; and for other Purposes.}}\n|  for erecting a Bridge over the River Dee at the Craiglug in the Parish of Old Machar in the County of Aberdeen and of Nigg in the County of Kincardine, and for making a Road from Cairnrobin by the said Bridge toward the City of Aberdeen.|note4= }}\n|  }}\n|\n| or the Clearing House (Ireland) Act 1860|local|29|15-05-1860|maintained=y|archived=n|An Act for more effectually carrying out the Clearing House System in Ireland, and for facilitating legal Proceedings in relation thereto.}}\n-\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|  }}\n-\n|\n|\n|  and for authorizing Agreements with respect to the Silverdale and Newcastle Railway, and for other Purposes.}}\n| or the Cutlers' Company Act 1860|local|43|15-05-1860|maintained=y|archived=n|An Act for amending the Acts passed with respect to the Master, Wardens, Searchers, Assistants, and Commonalty of the Company of Cutlers in Hallamshire in the County of York.}}\n|\n|\n|\n|\n|\n|  and for other Purposes.|note4= }}\n-\n|\n|\n|\n|\n|\n|\n|\n|  relating to the Turnpike Roads from Hurdlow House in the County of Derby to Manchester in the County Palatine of Lancaster, and to confer other Powers in lieu thereof.|note4= }}\n|\n|\n-\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n-\n|  so as to comprise the Parish of Ecclesfield; for making further Provisions with respect to the said Company; and for other Purposes.|note4= }}\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n-\n|\n|\n|\n|\n|\n| , 1847;\" and for other Purposes.|note4= }}\n|  for making a fair and equal County Rate for the County of Buckingham.|note4= }}\n|\n|\n|\n-\n|\n|\n| or the London and South Western and Bristol and Exeter Railways (Yeovil Station) Act 1860|local|92|14-06-1860|archived=n|An Act for the Alteration at Yeovil of the Salisbury and Yeovil Railway leased to the London and South-western Railway Company, and of the Yeovil and Durston Branch of the Bristol and Exeter Railway; and for the making at Yeovil of a Joint Station for the London and South-western and the Bristol and Exeter Railway Companies; and for other Purposes.}}\n|\n|\n|  }}\n|\n|\n|  }}\n|\n-\n|\n|\n|\n|\n|  }}\n|\n|  to extend the Time for Completion of Works, and to levy additional Tolls and Rates; and for other Purposes.}}\n|\n|  }}\n|\n-\n|\n|\n|  relating to the said Roads; and for other Purposes.}}\n|\n|\n|  }}\n|\n|\n|\n|\n-\n|\n|\n|\n|\n|\n|\n|  and Tenth Years of the Reign of His Majesty King George the Fourth, relating to certain Roads and Bridges in the Counties of Lanark and Dumbarton.}}\n|\n|\n|\n-\n|\n|  }}\n|  }}\n|\n|\n|  for the Construction and Completion of the Works authorized by \"The Swansea Harbour Act, 1854.\" }}\n|\n|  for enabling the Commissioners to construct Works, and supply their District with Water and Gas; and for other Purposes.}}\n|\n|\n-\n|\n|\n|\n|  }}\n|\n|\n|  and to make other Provisions in lieu thereof, and for other Purposes.}}\n|\n|\n|\n-\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n-\n|\n|\n|\n|\n|\n|  and to grant other and further Powers for the Improvement of the said Navigation.}}\n|\n|\n|\n|  }}\n-\n|  }}\n| or the London, Brighton and South Coast Railway (Mid-Sussex Junction) Act 1860'''|local|171|23-07-1860|maintained=y|archived=n|An Act to enable the London, Brighton, and South Coast Railway Company to make certain Alterations in their Coast Lines and in the Line of the West End of London and Crystal Palace Railway, a new Channel for the River Arun, and other Works; and for other Purposes.}}\n| . }}\n|\n|\n|\n|  }}\n|\n|\n|\n-\n|\n|  }}\n|  }}\n|\n|\n|\n|\n|\n|\n|\n-\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n-\n|\n|  }}\n|  and to confer additional Powers on the Galway Harbour Commissioners; and for other Purposes.}}\n|\n}}\nPrivate acts\n|  }}\n|\n|\n|\n|\n|\n|\n|\n| |private|10|20-08-1860|repealed=n|archived=n|An Act for naturalizing Charles Maria Joseph Livy Anthony James Joachim Levingstone Bandini Giustiniani Caroline Maria Elena Gioacchina Bandini Giustiniani, and Elena Maria Concetta Isabella Gioacchina Guiseppa Bandini Giustiniani, the infant Children of Sigismund Nicholas Venantius Gaietano Francis Bandini Giustiniani Esquire, commonly called Viscount Kynnaird Marquess Bandini in the Roman States, the only Son and Heir Apparent of Maria Cecilia Agatha Anna Josepha Laurentia Donata Melchiora Balthassara Gaspara Countess of Newburgh.}}\n}}\nSources\n*  |title=A Collection of the Public General Statutes |location=London |publisher=Eyre & Spottiswoode |date=1860 |via=Google Books}}\n*\n*  |pages=393–399 |via=Google Books}}\nSee also\n* List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}