{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in Slovenia__disambig_1\n\n}}\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) designates World Heritage Sites of outstanding universal value to cultural or natural heritage which  have been nominated by countries which are signatories to the UNESCO World Heritage Convention, established in 1972. Cultural heritage consists of monuments (such as architectural works, monumental sculptures, or inscriptions), groups of buildings, and sites (including archaeological sites). Natural heritage consists of natural features (physical and biological formations), geological and physiographical formations (including habitats of threatened species of animals and plants), and natural sites which are important from the point of view of science, conservation, or natural beauty. Slovenia, following the declaration of independence from Yugoslavia on 25 June 1991, ratified the convention on 5 November 1992.\n, there are five sites in Slovenia on the list and a further four on the tentative list. The first site in Slovenia to be added to the list was Škocjan Caves, at the 10th UNESCO session in 1986. In the 2010s, three more sites were added, all of them transnational entries: pile dwellings at Ig, part of the Prehistoric pile dwellings around the Alps transnational site, in 2011, Idrija, as part of the transnational site Heritage of Mercury. Almadén and Idrija, in 2012, and two forest reserves, the Krokar and Snežnik–Ždrocle Virgin Forests in 2017, as a part of the extension to the site of Primeval Beech Forests of the Carpathians and the Ancient Beech Forests of Germany. The most recent site added were the works of Jože Plečnik in Ljubljana, in 2021. Of these five sites, Škocjan Caves and the Primeval Beech Forests are natural sites while the other three are cultural sites, as determined by the organization's selection criteria.\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural, and vii through x are natural.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" data-sort-type=\"number\"|\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" | Škocjan Caves\n|\n| Škocjan (Municipality of Divača)\n| align=center | 1986\n| 390; vii, viii (natural)\n| The cave system of Škocjan Caves and its surroundings represent some of the most significant karst topography phenomena, including one of the world's largest known underground river canyons. It is located in the Karst Plateau which is of special importance in the history of Earth sciences.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\" | Prehistoric pile dwellings around the Alps\n|\n| Municipality of Ig\n| align=center | 2011\n| 1363; iv, v (cultural)\n| This transnational site comprises 111 locations with prehistoric pile-dwellings settlements, two of which are in Slovenia: the pile dwellings in Ig, northern group (), and the pile dwellings in Ig, southern group (). Excavations in these sites have provided insight into life in prehistoric times during the Neolithic and the Bronze Age in Alpine Europe. The site is shared with Austria, France, Germany, Italy, and Switzerland.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\" | Heritage of Mercury. Almadén and Idrija\n|\n| Idrija\n| align=center | 2012\n| 1313; ii, iv (cultural)\n| Idrija had one of the two largest mercury mines in the world, with mercury being first discovered there in 1490. The site features the infrastructure and technology related to mining and mercury production and bears testimony to the intercontinental trade in mercury, which generated important exchanges between Europe and America over the centuries. The entrance to Antonijev rov mine is pictured. The site is shared with the mining town of Almadén, Spain.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\" | Ancient and Primeval Beech Forests of the Carpathians and Other Regions of Europe\n|\n| Municipalities of Kočevje, Ilirska Bistrica, Loška Dolina\n| align=center | 2017\n| 1133ter; ix (natural)\n| This site comprises undisturbed examples of temperate forests that demonstrate the postglacial expansion process of European beech from a few isolated refuge areas in the Alps, Carpathians, Dinarides, Mediterranean, and Pyrenees. The site was originally listed in 2007 to include forests in Slovakia and Ukraine. It was expanded in 2011, 2017, and 2021, to include forests in a total of 18 European countries. Two forests reserves in Slovenia were listed in 2017, Krokar (pictured) and Snežnik – Ždrocle Virgin Forest.\n|-\n! scope=\"row\" | The works of Jože Plečnik in Ljubljana – Human Centred Urban Design\n|\n| Ljubljana and Črna Vas\n| align=center | 2021\n| 1643; iv (cultural)\n| The site encompasses some of the most prominent works of  Slovenian architect Jože Plečnik in Ljubljana. During the interwar period, Plečnik worked to transform Ljubljana from a provincial city to the capital of the Slovenian nation by creating a series of public spaces and public institutions and integrating them into the pre-existing urban fabric. Sites include the St. Michael's Church in Črna Vas, and the following sites in Ljubljana: the promenade along the embankments of the Ljubljanica River and the bridges crossing it (Triple Bridge pictured), the \"Green promenade\":  Vegova Street with the National and University Library from French Revolution Square to Congress Square and Star Park, Trnovo Bridge, Roman Walls in Mirje, the Church of St. Francis of Assisi, and the All Saints Garden in Žale Cemetery.\n|}\nTentative list\nIn addition to the sites on the World Heritage list, member states can maintain a list of tentative sites that they may consider for nomination. Nominations for the World Heritage list are only accepted if the site was previously listed on the tentative list. , Slovenia recorded four sites on its tentative list.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" | UNESCO criteria\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" | Fužina hills in Bohinj\n|\n| Stara Fužina and Studor v Bohinju (Municipality of Bohinj)\n| align=center | 1994\n| ii, v (cultural)\n| The area that was developed for the particular needs of alpine pasture cattle-raising, with herdsmen gradually moving the cattle up to the highlands in the summer months. Mountainous settlements developed specific farm structures, especially hayracks.\n|-\n! scope=\"row\" | Franja Partisan Hospital\n|\n| Dolenji Novaki (Municipality of Cerkno)\n| align=center | 2000\n| i, iii, iv (cultural)\n| A clandestine partisan hospital complex, set up during World War II. It had a capacity of up to 120 patients and provided treatment to soldiers of various nationalities. It was never discovered by the enemy forces.\n|-\n! scope=\"row\" | Classic Karst\n|\n| Karst Plateau\n| align=center | 2015\n| vii, viii, ix, x (natural)\n| Karst Plateau is the region where Karst phenomena were scientifically described for the first time. Continuous human settlement for over 2000 years has created a cultural landscape with a unique identity. The karst region of Slovenia is among the richest areas in Europe in terms of flora and fauna and one of the global \"hotspots\" of biodiversity.\n|-\n! scope=\"row\" | The Walk of Peace from the Alps to the Adriatic – Heritage of the First World War\n|\n| Upper Carniola and Slovene Littoral\n| align=center | 2016\n| ii, vi (cultural)\n| The site encompasses the area where the Isonzo front took place during the First World War. Sites include the Russian Chapel on the Vršič Pass, military cemeteries in Log pod Mangartom, Solkan, Štanjel, Gorjansko, and Črniče, Charnel houses in Tolmin and Kobarid, Memorial Church of the Holy Spirit in Javorca, historical areas at Zaprikaj, Mengore, and Sabotin, military chapel in Ladra, and Bohinj Railway.\n|}\nSee also\n* List of Intangible Cultural Heritage elements in Slovenia\n* Tourism in Slovenia\nReferences\nExternal links"
    }
  ]
}