{
  "content": [
    {
      "type": "text",
      "text": "# List of presidents of entertainment of The CW\n\nThe CW Television Network is a successor and rebrand of both the previous two operations of the network: The WB and UPN, both of which launched within one week of each other in 1995.\nUPN\nLucie Salhany (1995-1997)\nShe moved back to Paramount as they were about to launch the United Paramount Network, also known as the UPN—which later merged with The WB. Salhany was chief executive officer of UPN from 1995 to 1997.\nDean Valentine (1997-2002)\nDawn Ostroff (2002-2006)\nFrom 2002 to 2006, Dawn Ostroff served as president of the UPN Network, a subsidiary of CBS, where she developed the popular reality series America’s Next Top Model, along with other programs including Veronica Mars, Star Trek: Voyager, WWE SmackDown, Girlfriends, Moesha, Everybody Hates Chris and Dilbert. From 1996 to 2002, she served as executive vice president of entertainment at Lifetime Television and led the network to rise from sixth to become the #1-rated cable network in prime time.\nThe WB\nGarth Ancier (1995-1999)\nIn 1994, Ancier re-teamed with Fox colleague Jamie Kellner and Warner Bros. CEO Barry Meyer to launch The WB as its chief programmer from 1994 to 1999, where he helped put 7th Heaven, ''Dawson's Creek, Charmed, Buffy the Vampire Slayer, The Steve Harvey Show and The Jamie Foxx Show on the air.\nSusanne Daniels (1999-2003)\nShe developed TV shows such as Dawson's Creek, Buffy The Vampire Slayer, and Gilmore Girls\nWhile at The WB, Daniels co-authored the book Season Finale: The Unexpected Rise and Fall of The WB and UPN along with Cynthia Littleton.\nDavid Janollari (2003-2006)\nThe CW\nDawn Ostroff (2006-2011)\nBeginning in 2006 after the merger of UPN and The WB, Ostroff was president of entertainment for The CW  Ostroff was in charge of programming, digital initiatives, branding, marketing, research and sales. As president, she developed several TV series, including Gossip Girl and The Vampire Diaries''.\nMark Pedowitz (2011-2022)\nMark Pedowitz replaced Dawn Ostroff in 2011, who had been the Head of Entertainment since the network's inception in 2006. Pedowitz oversaw all aspects of The CW, including programming, sales, marketing, distribution, finance, research and publicity.\nDuring his tenure, Pedowitz focused on trying to broaden the audience for The CW, increased the diversity at the network, launched the Arrowverse, developed several franchised other TV series including The 100, Riverdale and its spinoff Katy Keene, debuted reboots of Charmed, Dynasty, Roswell, and The Originals and spin-off Legacies, both part of The Vampire Diaries Universe, and also developed shows like All American and All American: Homecoming, Nancy Drew, and award-winning shows like Jane The Virgin and Crazy Ex Girlfriend. Under his tenure, and made the shows of the network available through The CW app. He also increased the amount of original programming, with the network airing shows on Sunday and Saturday, as well as during the summer. Producer Greg Berlanti credited him with giving many shows that were not successful initially a chance in contrast to other networks\nThe CW also during his tenure ended the 2014–15 season posting its highest average total viewership in a single television season since 2007–08 with 2.15 million viewers, a 12 percent increase in total viewership year-to-year; The CW also posted its highest seasonal demographic ratings among males ages 18–49 with a 0.8 share.\nHe eventually became the longest-tenured head for a broadcast network and was promoted to the position of chairman and chief executive officer in January 2020, before leaving The CW in 2022, amidst the acquisition of the channel by Nexstar Media Group and was replaced by Dennis Miller as President, and Brad Schwartz as President of Entertainment.\nReferences"
    }
  ]
}