{
  "content": [
    {
      "type": "text",
      "text": "# List of inmates of Topaz War Relocation Center\n\nThis is a list of inmates of Topaz War Relocation Center, an American concentration camp in Utah used during World War II to hold people of Japanese descent.\n*Karl Ichiro Akiya (1909–2001), a writer and political activist.\n*Richard Aoki (1938–2009), an American civil rights activist.\n*Mitsuye Endo (1920–2006), plaintiff of the Ex parte Endo Supreme Court case that led to Japanese Americans being allowed to return to the West Coast and to the closing of the war relocation camps.  Also interned at Tule Lake.\n*Yoshiaki Fukuda (1898–1957), a Konko bishop and missionary. Also interned at Fort Missoula and the Crystal City Internment Camp.\n*Taneyuki “Dan” Harada (1923–2020), a painter and computer programmer. Also interned at Tule Lake.\n*Marii Hasegawa (1918–2012), a peace activist.\n*George Matsusaburo Hibi (1886–1947), an Issei artist.\n*Hisako Shimizu Hibi (1907–1991), an Issei painter and printmaker.\n*Yuji Ichioka (1936–2002), an American historian who coined the term \"Asian American\".\n*Kazu Iijima (1918–2007), an activist and community organizer.\n*Homei Iseyama (1890-1975), artist\n*George Ishiyama (1914–2003), businessman and former president of Alaska Pulp Corporation. Also interned at Heart Mountain.\n*Miyoko Ito (1918–1983), an artist known for her watercolor and abstract oil paintings and prints.\n*Willie Ito (1934–), an animator best known for his work on cartoons like The Jetsons, The Flintstones, and The Yogi Bear Show from Hanna-Barbera and Walt Disney Studios.\n*Chizu Iiyama (1921–2020), an activist, social worker, and educator.\n*Tsuyako Kitashima (1918–2006), a Japanese American activist noted for her role in seeking reparations for Japanese American internment.\n*Michi Kobi (1924–2016), an American actress.\n*Fred Korematsu (1919–2005), who challenged the constitutionality of Executive Order 9066 in Korematsu v. United States.\n*Toshio Mori (1910–1980), author.\n*Robert Murase (1938–2005), a world-renowned landscape architect.\n*Chiura Obata (1885–1975), a Japanese American artist.\n*Frank H. Ogawa (1917–1994), the first Japanese American to serve on the Oakland City Council.\n*Miné Okubo (1912–2001), a Japanese American artist and writer, noted for her book, Citizen 13660.\n*Mary Yamashiro Otani (1923–2005), a community activist.\n*Kay Sekimachi (born 1926), an American fiber artist.\n*Toyo Suyemoto (1916–2003), an American poet, memoirist, and librarian.\n* Goro Suzuki (1917–1979), an Oakland-born entertainer known widely under his stage name, Jack Soo, star of the original stage and movie productions of Flower Drum Song and remembered for his role as Detective Nick Yemana on the 1970s sitcom Barney Miller.  Suzuki was a favorite performer at Topaz gatherings.\n*Dave Tatsuno (1913–2006), a Japanese American businessman who documented life in an American concentration camp on film.\n*Kazue Togasaki (1897–1992), one of the first two women of Japanese ancestry to earn a medical degree in the United States.  Also interned at Tule Lake and Manzanar.\n*Yoshiko Uchida (1921–1992), a Japanese American writer, most notable for her books, Desert Exile: The Uprooting of a Japanese American Family and Picture Bride.\n*Koho Yamamoto (born 1922), an American artist. Also interned at Tule Lake.\n*Thomas Yamamoto (1917–2004), an American artist.\nReferences"
    }
  ]
}