{
  "content": [
    {
      "type": "text",
      "text": "# Listed buildings in Leeds (Cross Gates and Whinmoor Ward)\n\nCross Gates and Whinmoor is a ward in the metropolitan borough of the City of Leeds, West Yorkshire, England.  It contains nine listed buildings that are recorded in the National Heritage List for England.  Of these, one is listed at Grade&nbsp;II*, the middle of the three grades, and the others are at Grade&nbsp;II, the lowest grade.  The ward is a suburb to the east of the centre of Leeds, and is mainly residential.  Most of the listed buildings are on the eastern rural edge of the ward, and consist of houses and associated structures, a farmhouse, and two railway bridges.\n__NOTOC__\nKey\n{| class=\"wikitable\"\n|-\n! Grade\n! Criteria\n|-\n|align=\"center\" |II*\n| Particularly important buildings of more than special interest\n|-\n|align=\"center\" |II\n| Buildings of national importance and special interest\n|}\nBuildings\n{| class=\"wikitable sortable plainrowheaders\" style=\"width:100%; border:0; text-align:left; line-height:150%;\"\n|-\n! scope=\"col\"  style=\"width:150px\" |Name and location\n! scope=\"col\"  style=\"width:100px\" class=\"unsortable\"|Photograph\n! scope=\"col\"  style=\"width:120px\" |Date\n! scope=\"col\"  style=\"width:650px\" class=\"unsortable\"|Notes\n! scope=\"col\"  style=\"width:50px\" |Grade\n|-\n|Dovecote, Manston Hall Farm\n|\n|align=\"center\"|\n|The dovecote is in stone and orange brick, with quoins and a stone slate roof.  It has a square plan, and contains a boarded opening with a brick segmental head in the south wall, and a doorway in the north wall.\n|align=\"center\" |\n|-\n|Redhall House\n|\n|align=\"center\"|\n|The house was extended in the 18th century, and again in the 19th century.  It is in red brick on a stone plinth, with stone dressings, sill bands, a moulded eaves cornice, and slate roofs.  There are two storeys and attics, a front of nine bays, and a three-bay rear wing.  The middle five bays are the original part, and the middle three bays project under a pediment.  In the centre is a doorway with an eared architrave and a pediment, flanking it are narrow windows, and above it is a large semicircular window with an architrave and a keystone.  The other windows are sashes with architraves, some with pediments, some with cornices, and some with keystones.\n|align=\"center\" |\n|-\n|Austhorpe Hall\n|\n|align=\"center\"|1694\n|A country house in brick with quoins, a modillion cornice, and a hipped stone slate roof.  There are two storeys, attics and cellars, and a front of seven bays, the middle bay projecting under a pediment.  The central doorway has an eared architrave, a pulvinated frieze, a plaque with the date and initials, and a broken pediment.  The windows are mullioned and transomed with eared architraves.\n|align=\"center\" |\n|-\n|Ha-ha and roadside wall, Austhorpe Hall\n|\n|align=\"center\"|\n|The ha-ha wall is the older, it is to the south of the house, in brick with stone coping, and it contains a wooden gate.  The roadside wall is probably later, it is to the west of the grounds, in stone with flat coping, and it contains wrought iron double gates.\n|align=\"center\" |\n|-\n|Pigeon house, Redhall House\n|\n|align=\"center\"|\n|The pigeon house is in gritstone and brick, with quoins, a pyramidal stone slate roof, and a lantern.  There are three storeys and a square plan.  On the south side is a wide cart arch and a narrow doorway above, both with segmental-arched heads.\n|align=\"center\" |\n|-\n|Lazencroft Farmhouse\n|\n|align=\"center\"|\n|The farmhouse is in rendered brick, and has a hipped slate roof.  There are two storeys, a square plan, and a front of three bays.  In the centre is a round-arched doorway with a fanlight, and the windows are top-hung casements.  In the right return is a bay window, and the left return has four windows and a doorway with a fanlight.\n|align=\"center\" |\n|-\n|Former coach house and stables, Redhall House\n|\n|align=\"center\"|\n|The coach house and stables have been converted into offices, and are in gritstone with a slate roof.  There are two storeys and three bays, the middle bay projecting under a coped pediment with kneelers.   This bay contains an elliptical arch and a traceried circular window.  The other windows have small panes, plain stone sills and wedge lintels.\n|align=\"center\" |\n|-\n|Austhorpe Lane Bridge\n|\n|align=\"center\"|\n|The bridge was built by the Leeds and Selby Railway to carry Austhorpe Lane over its line.  It is in sandstone and gritstone, and consists of a single basket arch.  The bridge has voussoirs, an impost band, a string course, and parapets with curved coping ending in oval piers.  It is flanked by abutments and wing walls.\n|align=\"center\" |\n|-\n|Crawshaw Woods Bridge\n|\n|align=\"center\"|\n|The bridge was built by the Leeds and Selby Railway to carry a track over its line.  It is in cast iron, and consists of a single segmental arch with a span of .  The abutments are in gritstone with quoins and impost bands, and the inner abutment walls and wing walls are in sandstone.  The parapets consist of wrought iron balustrades, and end in stone piers with mushroom tops.\n|align=\"center\" |\n|-\n|}\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}