{
  "content": [
    {
      "type": "text",
      "text": "# List of international presidential trips made by Pratibha Patil\n\nThis is a list of international presidential trips made by Pratibha Patil, the 12th President of India. Patil was elected as president and assumed the office for a five-year term on 25 July 2007 to succeed A. P. J. Abdul Kalam and served until 25 July 2012 and was succeeded by Pranab Mukherjee.\nSummary of international trips\nIn her five-year tenure as the President, Pratibha Patil made 13 international trips, visiting 24 countries. The first state visit was to Brazil between 12 and 16 April 2008, followed by Mexico and Chile. South Africa was the final country to be visited by her during her presidency.\n{| class=\"wikitable\"\n|+President Pratibha Patil's visits by country\n|-\n!Number of visits\n!Country\n|-\n|1 visit (24)\n|Austria, Bhutan, Brazil, Cambodia, Chile, China, Cyprus, Indonesia, Laos, Mongolia, Mauritius, Mexico, Poland, Russia, Seychelles, South Africa, South Korea, Spain, Switzerland, Syria, Tajikistan, Vietnam, United Arab Emirates, United Kingdom\n|}\n2008\n{|class=\"wikitable outercollapse sortable\"\n!\n! style=\"width:10em\"| Country\n! style=\"width:7em\"| Areas visited\n! style=\"width:7em\"| Date(s)\n! class=\"unsortable\"| Details\n! class=\"unsortable\"| Images\n|-\n!rowspan=\"3\"| 1\n|\n|São Paulo,Rio de Janeiro,Brasília\n|1216 April\n|Maiden state visit upon assumption of presidency in July 2007. Addressed the National Congress and met with Chamber of Deputies President Arlindo Chinaglia and Supreme Court President Ellen Gracie Northfleet. Welcomed by President Luiz Inácio Lula da Silva at Palácio do Planalto and accorded ceremonial reception. Held bilateral talks with President Lula and witnessed signing of documents.\n|\n|-\n|\n|Mexico City, Guadalajara\n|1719 April\n|Visited National Hero's Memorial and addressed Indian community. Welcomed by President Felipe Calderón and held bilateral and delegation-level talks with him and addressed joint press statement. Met with Supreme Court President Guillermo Iberio Ortiz Mayagoitia, addressed India-Mexico Chamber of Commerce meeting. Also met with Jalisco Governor Emilio González Márquez.\n|\n|-\n|\n|Santiago\n|2025 April\n|Received by President Michelle Bachelet and accorded ceremonial guard of honour at Palacio de La Moneda. Held delegation-level talks with President Bachelet and witnessed signing of documents. Met with Santiago Mayor Raul Alcaino Lin and received Key of the city and citation from him. Conferred honorary doctorate from University of Chile Rector Victor Peres Vera.\n|\n|-\n!colspan=\"6\"|\n|-\n!2\n|\n|Paro\n|58 November\n|Attended coronation of King Jigme Khesar Namgyel Wangchuck. Welcomed by 4th King Jigme Singye Wangchuck and met with Prime Minister Jigme Thinley. Attended ceremonial coronation rituals at Tashichho Dzong and mass gathering at Changlimithang Stadium. Also attended royal banquet hosted by the King of Bhutan.\n|\n|-\n!colspan=\"6\"|\n|-\n!rowspan=\"2\"| 3\n|\n|Ho Chi Minh City, Hanoi\n|2427 November\n|Met with Ho Chi Minh City People's Committee chairman Le Hoang Quan and attended banquet hosted by him. Addressed FICCI business delegation meeting. Welcomed by President Nguyễn Minh Triết at Presidential Palace and held bilateral talks with him and witnessed signing of documents and MOUs. Met with Communist Party General Secretary Nông Đức Mạnh and Prime Minister Nguyễn Tấn Dũng. Also visited Ho Chi Minh Mausoleum.\n|\n|-\n|\n|Bali, Jakarta\n|28 November1 December\n|Visited Pura Taman Ayun temple in Bali. Received and met with Foreign Minister Hassan Wirajuda. Welcomed by President Susilo Bambang Yudhoyono at Merdeka Palace and accorded guard of honour. Held bilateral talks with him and witnessed signing various documents and pacts.\n|\n|}\n2009\n{|class=\"wikitable outercollapse sortable\"\n!\n! style=\"width:10em\"| Country\n! style=\"width:7em\"| Areas visited\n! style=\"width:7em\"| Date(s)\n! class=\"unsortable\"| Details\n! class=\"unsortable\"| Images\n|-\n!rowspan=\"2\"| 4\n|\n|Madrid\n|2023 April\n|First-ever visit by an Indian President. Welcomed by King Juan Carlos I and Queen Sofía at El Pardo Royal Palace and witnessed ceremonial guard of honour. Addressed special joint sitting of the Cortes Generales and visited the Monumento a los Caídos por España. Received gold key to the city from Madrid Mayor Alberto Ruiz-Gallardón and state banquet hosted in her honour by the King. Met with Prime Minister José Luis Rodríguez Zapatero and addressed India-Spain business meeting.\n|\n|-\n|\n|Warsaw, Kraków\n|2327 April\n|Welcomed by President Lech Kaczyński and accorded ceremonial reception and delivered press statement. Met with Prime Minister Donald Tusk and Marshal of Sejm Bronisław Komorowski. Also visited Tomb of the Unknown Soldier and attended state banquet hosted by the President. Visited Jagiellonian University and Birkenau concentration camp.\n|\n|-\n!colspan=\"6\"|\n|-\n!rowspan=\"2\"| 5\n|\n|Moscow, Saint Petersburg\n|25 September\n|Visited Tomb of the Unknown Soldier and laid ceremonial wreath. Met with President Dmitry Medvedev, held delegation-level talks and attended banquet hosted by the president. Addressed gala concert on occasion of \"Year of India in Russia\" at Bolshoi Theatre. Also met with Prime Minister Vladimir Putin, Chairman of Federation Council Sergey Mironov, Chairman of State Duma Boris Gryzlov, Saint Petersburg Deputy Governor Alexander Vakhmistrov and Presidential Envoy for Northwestern Federal District Ilya Klebanov.\n|\n|-\n|\n|Dushanbe\n|68 September\n|Welcomed by President Emomali Rahmon at Palace of the Nation and accorded ceremonial guard of honour. Held delegation level talks with President Rahmon and addressed India-Tajikistan business meeting. Visited Dousti Square and also attended state banquet hosted by the president. Met with Prime Minister Oqil Oqilov and Defence Minister Sherali Khayrulloyev. Also addressed special function of 19th Independence Day celebration of Tajikistan and visited Hamadani Mausoleum.\n|\n|-\n!colspan=\"6\"|\n|-\n!rowspan=\"2\"| 6\n|\n|London\n|2629 October\n|State visit. Welcomed by Queen Elizabeth II and Prince Philip, Duke of Edinburgh at Windsor Castle and visited royal exhibition and attended state banquet hosted by the Queen. Addressed joint session of the Parliament of the United Kingdom Attended reception hosted by Lord Mayor Ian Luder at Guildhall and met Prime Minister Gordon Brown at 10 Downing Street and Charles, Prince of Wales at Clarence House. Attended launch of Queen's Baton Relay for XIX Commonwealth Games and received the baton from the Queen.\n|\n|-\n|\n|Larnaca, Nicosia\n|30 October1 November\n|Welcomed by President Demetris Christofias at Presidential Palace and accorded guard of honour. Met and held delegation-level talks with the President. Also met with President of the House of Representatives Marios Garoyian and Archbishop Chrysostomos II of Cyprus. Attended state banquet hosted by the President.\n|\n|}\n2010\n{|class=\"wikitable outercollapse sortable\"\n!\n! style=\"width:10em\"| Country\n! style=\"width:7em\"| Areas visited\n! style=\"width:7em\"| Date(s)\n! class=\"unsortable\"| Details\n! class=\"unsortable\"| Images\n|-\n!7\n|\n|Beijing, Luoyang, Shanghai\n|2631 May\n|Received by President Hu Jintao at Great Hall of the People and participated in delegation-level talks with the President. Met with Premier of the State Council Wen Jiabao and Chairman of the Chinese People's Political Consultative Conference Jia Qinglin. Visited the Temple of Heaven and Forbidden City. Addressed special event commemorating 60th anniversary of India-China Diplomatic Relations along with Vice President Xi Jinping. Also met with Henan Governor Guo Gengmao and Party Secretary for Shanghai Yu Zhengsheng.\n|\n|-\n!colspan=\"6\"|\n|-\n!rowspan=\"2\"| 8\n|\n|Vientaine,Luang Prabang\n|913 September\n|Welcomed by President Choummaly Sayasone at Presidential Palace and accorded ceremonial guard of honour. Participated in bilateral and delegation-level talks with the President and witnessed signing of documents. Met Prime Minister Bouasone Bouphavanh and National Assembly President Thongsing Thammavong and attended state banquet hosted by the President. Also met Luang Prabang Governor Bouheuang Doungphachanh and attended banquet hosted by the Governor.\n|\n|-\n|\n|Phnom Penh,Siem Reap\n|1318 September\n|Received and welcomed by King Norodom Sihamoni at Royal Palace and held bilateral meeting with him and attended state banquet hosted by the King. Met with Prime Minister Hun Sen, Senate President Chea Sim and National Assembly President Heng Samrin. Visited Angkor Wat temple and Banteay Srei temple and laid foundation stone of the MGC Asian Traditional Textiles Museum.\n|\n|-\n!colspan=\"6\"|\n|-\n!rowspan=\"2\"| 9\n|\n|Abu Dhabi, Dubai, Sharjah\n|2125 November\n|Welcomed by President Khalifa bin Zayed Al Nahyan at Al-Mushrif Palace and held bilateral talks with the President. Addressed the Abu Dhabi Indian School and Abu Dhabi Chamber of Commerce. Met with Prime Minister and Ruler of Dubai Mohammed bin Rashid Al Maktoum and Deputy Prime Minister Mansour bin Zayed Al Nahyan. Also met with Ruler of Sharjah Sultan bin Muhammad Al-Qasimi.\n|\n|-\n|\n|Damascus, Aleppo\n|2630 November\n|Welcomed by President Bashar al-Assad at Presidential Palace and accorded ceremonial guard of honour. Participated in delegation-level talks with the President and attended state banquet hosted in her honour. Visited Umayyad Mosque and met with Prime Minister Muhammad Naji al-Otari, Speaker of Parliament Mahmoud al-Abrash and Minister of Trade and Economy Lamia Assi. Addressed India-Syria Business Summit and interacted with leaders of Missionaries of Charity in Damascus. Also met with Aleppo Governor Ali Ahmed Mansoura.\n|\n|}\n2011\n{|class=\"wikitable outercollapse sortable\"\n!\n! style=\"width:10em\"| Country\n! style=\"width:7em\"| Areas visited\n! style=\"width:7em\"| Date(s)\n! class=\"unsortable\"| Details\n! class=\"unsortable\"| Images\n|-\n!10\n|\n|Port Louis\n|2428 April\n|Received by Prime Minister Navin Ramgoolam and held talks at Clarisse House. Met with President Sir Anerood Jugnauth and Lady Sarojini Jugnauth at State House. Visited samadhi of Father of the Nation Sir Seewoosagur Ramgoolam and Aapravasi Ghat. Met with Leader of the Opposition Paul Berenger and Chief Justice Y. K. J. Yeung Sik Yuen. Attended state banquet hosted by the prime minister and also addressed special session of the National Assembly. Inaugurated bust of Indira Gandhi and special postal covers at Indira Gandhi Centre for Indian Culture and offered puja at Mangal Mahadev.\n|\n|-\n!colspan=\"6\"|\n|-\n!rowspan=\"2\"| 11\n|\n|Seoul\n|2427 July\n|Welcomed by President Lee Myung-bak at Blue House and held delegation-level talks with the president and attended state banquet hosted in her honour. Addressed Indo-Korean Business Meeting and Indian community reception. Also met with National Assembly Speaker Park Hee-tae.\n|\n|-\n|\n|Ulaanbaatar\n|2730 July\n|Welcomed by President Tsakhiagiin Elbegdorj and inspected ceremonial guard of honour Sükhbaatar Square. Held bilateral and delegation-level talks with the President and addressed joint press conference. Met with Education Minister Yo Otgonbayar during India-Mongolia Business Forum and visited Pethub Tangey Choskhorling Monastery.\n|\n|-\n!colspan=\"6\"|\n|-\n!rowspan=\"2\"| 12\n|\n|Geneva, Bern\n|30 September4 October\n|Visited CERN and interacted with Indian scientists and addressed Indian community reception. Welcomed by President Micheline Calmy-Rey at Federal Palace and participated in talks with her and made joint press statements. Addressed the Federal Assembly and attended state banquet hosted by the President.\n|\n|-\n|\n|Vienna, Salzburg\n|47 October\n|Welcomed by President Heinz Fischer at Hofburg Palace and inspected guard of honour. Later participated in bilateral and delegation-level talks with the President, addressed joint press conference and attended state banquet hosted by the President. Met with Federal Chancellor Werner Faymann and National Council President Barbara Prammer and visited the Austrian Parliament. Also met with Salzburg Governess Gabi Burgstaller and attended concert at Mozart's House.\n|\n|}\n2012\n{|class=\"wikitable outercollapse sortable\"\n!\n! style=\"width:10em\"| Country\n! style=\"width:7em\"| Areas visited\n! style=\"width:7em\"| Date(s)\n! class=\"unsortable\"| Details\n! class=\"unsortable\"| Images\n|-\n!rowspan=\"2\"| 13\n|\n|Mahé\n|29 April1 May\n|Received by President James Alix Michel and inspected guard of honour and held talks with the President at State House. Met with Vice President Danny Faure and held delegation-level talks. Addressed special session of the National Assembly and met with people of Indian origin in Seychelles. Also met Leader of Opposition David Pierre and interacted with naval personnels at SPDF Air Wing Hangar.\n|\n|-\n|\n|Pretoria, Johannesburg, Cape Town, Durban, Pietermaritzburg\n|18 May\n|Final foreign visit. Welcomed by President Jacob Zuma for ceremonial reception at Union Buildings and accorded guard of honour. Held delegation level talks with the President and addressed joint press conference. Visited Freedom Park and unveiled bust of Mahatma Gandhi at Constitution Hill along with Chief Justice Mogoeng Mogoeng. Met with Deputy President Kgalema Motlanthe and visited the National Assembly. Attended reception hosted by Pietermaritzburg Mayor Chris Ndlela.\n|\n|}\nSee also\n* Presidency of Pratibha Patil\n* List of international presidential trips made by Ram Nath Kovind\n* List of international presidential trips made by Droupadi Murmu\n* List of international prime ministerial trips made by Manmohan Singh\n* List of international trips made by Salman Khurshid as Minister of External Affairs of India\n* History of Indian foreign relations\nReferences"
    }
  ]
}