{
  "content": [
    {
      "type": "text",
      "text": "# List of Japanese adult video awards (1991–2008)\n\nAlthough pornography in Japan has a long history and is a major business, until recently, the adult video industry did not develop a broad-based set of awards for sales or performance such as the AVN Awards in American pornography.\nThat has changed in recent years, and the two primary awards given at present (which are covered in separate articles) are the AV Grand Prix for retail and internet videos and the Adult Broadcasting Awards for programs broadcast on Japanese satellite TV.\nThis text is focused on the various earlier Japanese adult video awards given in the period 1991–2008, none of which are presently active. Some were given only infrequently and many were limited to particular studios or groups of companies.\nTokyo Sports Film Awards (1991–1999)\nThe Tokyo Sports Film Awards (東京スポーツ映画大賞) are sponsored by the Japanese tabloid newspaper Tokyo Sports. The award ceremonies are always held in January for movies in the previous year. The first awards were given in 1991 for the 1990 cinema year. The awards were for mainstream movies but occasionally awards were also given for adult video work. The sometimes idiosyncratic selections were made by famed filmmaker and actor Takeshi Kitano. Adult awards ended with the establishment of the Takeshi Kitano Entertainment Awards in 2000.\n1st Tokyo Sports Awards (1991)\nAV Award Best Actress\n* Kasumi Yuka (Kasumi Yuuka)\nNo AV Awards given 1992–1997\n8th Tokyo Sports Awards (1998)\nAV Award Best Actress\n* Sena Wakana\nAV Award Best Actor\n* Taka Kato\n9th Tokyo Sports Awards (1999)\nAV Award Best Actress\n* Maria Yumeno\nAV Award Best Actor\n* Ryuji Yamamoto\nTakeshi Kitano Entertainment Awards (2000–2006)\nThe Takeshi Kitano Entertainment Awards (ビートたけしのエンターテインメント賞) were begun by Tokyo Sports in 2000 for the 1999 entertainment year. They run in parallel with the Tokyo Sports Film Awards.  Filmmaker, director and actor Takeshi Kitano is the head of the screening committee. Awards are given in the Performing Arts but from the start they have included categories for adult video work. The adult awards ceased after the 2006 presentations.\n1st Takeshi Kitano Awards (2000)\nStar AV Actress\n* Mami Goto\nStar AV Actor\n* Chocoball Mukai\n2nd Takeshi Kitano Awards (2001)\nStar AV Actress\nStar AV Actor\n* Shiratama Dango\n3rd Takeshi Kitano Awards (2002)\nStar AV Actress\n* Ryōko Mitake\nStar AV Actor\n* Mong Mong\nBest AV Title\n* Dora Eman (ドラえまん) from Natural High starring Kyoka & Uta Komori\n4th Takeshi Kitano Awards (2003)\nStar AV Actress\nStar AV Actor\n* No Award\nBest AV Title\n* Battle Without Foreplay? (前戯なき戦い?即入かましてﾖｶですか?) from Crystal-Eizou (Fan label) starring Yayoi Fujino, Reiko Honda, Ryo Aoi, Hikari Tomosaki, Ayaya Hanasaki & Maho Hayami\n5th Takeshi Kitano Awards (2004)\nStar AV Actress\n* Nana Natsume\nStar AV Actor\n* No Award\nBest AV Title\n* Faithful Pooch Saseko (忠犬サセ公) from the Media Station Exert label, starring Hotaru Akane, Ami Sakuragi, Maki Abe, and Riko Mizuno\n6th Takeshi Kitano Awards (2005)\nStar AV Actress\n* DEVI\nStar AV Actor\n* No Award\nBest AV Title\n* Expo 2005 (液ジュポ2005 マン国博覧会) from SHY, starring Yaya Matsushima, Mari Takeuchi, Haruka Yanase and Aki Yato\n7th Takeshi Kitano Awards (2006)\nStar AV Actress\n* Rin Aoki\nStar AV Actor\n* No Award\nBest AV Title\n* No Award\nX City Adult Video Grand Prix Awards (1998–2004)\nX City, the \"BIGGEST ADULT SITE IN JAPAN!!\", is the website of the Kuki Inc. conglomerate of adult video producers which includes Alice Japan, Media Station (Cosmos Plan), Max-A, SexiA, VIP and others. For a time it sponsored a fan vote based competition called the Adult Video Grand Prix (or Grandprix) which gave awards in various categories. Voting was done at the official website usually in November and early December for works and actresses nominated for that year. Results were announced in late December. Most of the nominees and awards for actresses and videos are from companies associated with Kuki.\nX City AV '98 Awards\nBest AV Idol Award\n* Manami Suzuki\nThe City AVGY '99 Awards\nDetermined by fan e-mail votes from the official website. Votes were for New Faces, Big Breasts, Most Beautiful and Wildest. The overall Grand Prix winner was chosen from a combination these votes. The voting period was from November 12 to December 12, 1999 and the winners were announced December 24, 1999.\nGrand Prix Winner\n* Riko Akina\nBest Newcomer Award\n* Riko Akina\nBest Breasts Award\n* Mai Shiina\nMost Beautiful Actress Award\n* Riko Akina\nBest Nasty Actress Award\n* Sayuri Honjyou\n2000 X City Grand Prix Awards\nNo information on results\n2001 X City Grand Prix Awards\nVoting was done by making selections by e-mail from the official site. Voting ended December 27, 2001:\nBest Actress Award\n* Ai Nagase (2nd place)\n* Ami Ayukawa (3rd place)\nAlso nominated for Best Actress were Momo Kanda and Koharu Tohno\nBest New Actress Award\n* Hitomi Hayasaka\n* Megumi Osawa (2nd place)\n* Ai Kurosawa (3rd place)\nAlso nominated for Best New Actress were Asuka Ozora and Ayumi Tahara\nBest Video Title Award\n* ''Small Girls' Fuck (ミニモミ。FUCKだぴょん！) from Media Station Bazooka label (starring Sayaka Tsutsumi)\nBest Breasts Award\n* Hikari Kisugi\nBest Lolita Award\n* Asuka Ozora\nPrettiest Face Award\n* Megumi Osawa\nBest Mature Actress Award\n* Mariko Kawana\n2002 X City Grand Prix Awards\nResults of the voting:\nBest Actress Award\n* Ryōko Mitake\n* Nao Oikawa (2nd place)\n* Hikari Kisugi (3rd place)\nBest New Actress Award\n* Sora Aoi (2nd place)\n* Senna Kurosaki (3rd place)\nBest Video Title Award\n* Fallen Angel X (堕天使X) series from Media Station Bazooka label\nBest Breasts Award\n* Sakurako Kaoru\nBest Lolita Award\n* Sayaka Tsutsumi\nPrettiest Face Award\n* Senna Kurosaki\nNastiest Actress Award\n2003 X City Grand Prix Awards\nResults of the voting:\nBest Actress Award\n* Maria Takagi\n* Ryōko Mitake (2nd place)\n* Sora Aoi (3rd place)\nAlso nominated for Best Actress were Naho Ozawa, Nao Oikawa, Ran Asakawa, Rei Ito, Sakurako Tokiwa, Izumi Hasegawa and Mai Haruna\nBest New Actress Award\n* Maria Takagi\n* Alice Ogura (2nd place)\n* Mai Sakashita (3rd place)\nAlso nominated for Best New Actress were Akiho Yoshizawa, Miyuki Uehara, Hijiri Kayama, Mirano Matsushita, Yuki Maioka, Yuna Mizumoto and Yuria Yoshinaga\nBest Video Title Award\n* Welcome to Max Cafe: Maria Takagi (Max Cafeへようこそ！ 高樹マリア) from Max-A Calen label (starring Maria Takagi and directed by Taira Takano)\nBest Breasts Award\n* Sora Aoi\nPrettiest Face Award\n* Maria Takagi\n2004 X City Grand Prix Awards\nResults of the voting:\nBest Actress Award\n* Sora Aoi (2nd place)\n* Yua Aida (3rd place)\nBest New Actress Award\n* Yua Aida\n* Shiori Mizuno (2nd place)\n* Yui Miho (3rd place)\nBest Video Title Award\n* Naho Ozawa Reverse Soap Heaven (逆ソープ天国 小沢菜穂) from Alice Japan (starring Naho Ozawa and directed by Shigeo Katsuyama)\n* Complete Body Riko Tachibana (COMPLETE BODY 立花里子) from Leo (starring Riko Tachibana)\nBest Body Award\n* Sora Aoi\n* Yua Aida (2nd place)\nSOD AV Awards (2002–2006)\nThe Soft On Demand (SOD) porn conglomerate had its own Grand Prix awards before it sponsored the AV Open. The first awards were presented in 2002 and the 5th and last event took place in Tokyo in 2006. As usual with studio awards, prizes were given to actresses and staff from the SOD group of companies.\n2002 SOD Awards\nBest Video\n* Super High Class Soap Lady (超高級ソープ嬢 スペシャル版) from SOD starring Natsumi Kawahama, Ruri Asase and Chiharu Moritaka\n2003 SOD Awards\nThe 2003 SOD Award (SOD大賞) ceremony was held on November 26, 2003, at the Century Hyatt hotel in Shinjuku, Tokyo, a 40 million yen party with 500 attendees mostly devoted to professional wrestling with AV awards and actresses as a side attraction. Actresses from the American porn company Vivid Entertainment were also part of the scene. Hostess for the awards ceremony was future AV superstar Nana Natsume making her first appearance for SOD.\nBest Actress Award\n2004 SOD Awards\nNo information\n4th Annual SOD Awards 2005\nThe 4th SOD Award (2005年 第4回 SOD大賞) ceremony was held December 14, 2005 at the Hotel New Otani Tokyo. In addition to the awards, the inauguration of the AV Open competition in association with Tokyo Sports was announced and representatives from the various studios involved in the AV Open contest were present.\nSOD Award (for contributions to company sales and image)\n* Nana Natsume\nBest Actress Award\n* Nana Natsume\nActress Awards for Excellence\n* Shou Nishino\n* Emi Kitagawa\n* Kaho Kasumi\n* Aya Koizumi\nBest Director Award\n* Itaka & Smithring Powder (Natural High)\n* CHAIN Shu (CHAIN宗) (SOD Create)\nDirector Award for Excellence\n* 槍ヶ崎一 (Otis)\nBest New Director Award\n'Manufacturer's Excellence Award'''\n* 1st Place: SOD Create\n* 2nd Place: Natural High\n* 3rd Place: Deep's\n'''Writer's Award\n* Nobuyoshi Hirabayashi\nActor's Award\n* Tomohiro Abe\nSupporting Actress Award\n* Minaki Saotome\nCinematographer Award\n* Kazuaki Yoshizawa\nStill Photographer Award\n* Hisayuki Ubukata\nSound Award\n* Hideki Fujioka\nBest Rental Video Award'\n* Final Pussy from SOD Create, starring Nana Natsume and directed by Noboru Iguchi\n5th Annual SOD Awards 2006\nThe 5th and last SOD Award (2006年第5回SOD大賞) ceremony was held in Tokyo on December 14, 2006. The SOD awards were subsequently replaced by the broader based AV Open competition.\nSOD Award (for contributions to company sales and image)\n* Sasa Handa\nBest Actress Award (based on sales)\n* Nana Natsume\nActress Awards for Excellence\n* Hotaru Akane\n* Kaho Kasumi\n* Emi Tojo\n* Tsugumi Nagasawa\n* Sasa Handa\n* YOKO\nBest New Actress Award (based on sales)\n* Sasa Handa\nBest Director Award (based on sales)\n* Yakumo Matsubara\nDirector Awards for Excellence\n* Itaka & Smithring Powder (Natural High)\n* GORI (SOD Create)\n* Yukitsugu Tsuchiya (SOD Create)\n* Nomao Beidu\nBest New Director Award\n* Keita No. 1 (SOD Create)\n'Manufacturer's Excellence Award\n* 1st Place: SOD Create\n* 2nd Place: IEnergy\n* 3rd Place: Natural High\nNew Manufacturer Award\n* AKNR (Akinori)\nKMP Million Academy Award Prize 2004\nAt a ceremony held in Tokyo on December 15, 2004, the KMP studio announced the winners of their in-house Million Academy Award Prize (ミリオンアカデミー大賞受賞) contest which was determined by fan voting:\nAcademy Award Prize'\n* The Woman Called Nao (NAOと呼ばれた女) starring Nao Oikawa and nao, and directed by Goro Tameike\nAwards for excellence\n* Best Friend 2 (ベストフレンド2) starring Karen Kisaragi and Kasumi Misato, and directed by Goro Tameike\n* Ayaya Cos 3 (あやや・コス3) starring Ran Monbu and directed by Hideto Aki\n* It's the Occupation of Million's Girls! (ミリオンガールズのお仕事ですよ！) starring nao, Miyuki Uehara, Kyoko Nakajima, Asuka Sawaguchi and Miyu Sugiura, and directed by Goro Tameike\n* Cosplay Superstar Hitomi Hayasaka (コスプレスーパースター完全版 早坂ひとみ) starring Hitomi Hayasaka and directed by Ryoichi Murakami\nAV Actress Grand Prix 2006\nThe Hirorin awards (ヒロリン大賞2006) were determined by a combination of viewer votes and total sales of videos. This award from the \"AV Actress Hirorin Fan Blog\" website seems to have been given only for 2006. It should be distinguished from the 2006 AV Open contest awards and from the later AV Grand Prix competition.\nAV Grand Prix Winner\n* Yuma Asami\nBest Actress Winner\n* Honoka\nBest Actress Awards for Excellence\n* Akiho Yoshizawa\n* Mihiro\n* Nayuka Mine\n* An Nanba\n* Yua Aida\n* Risa Coda\nBest New Actress Winner\n* Tina Yuzuki (Rio)\nBest New Actress Awards for Excellence\n* Tsugumi Nagasawa\n* Sasa Handa\n* Rin Aoki\n* Megumi Haruka\n* Arai Mieko\n* Azumi Harusaki\nBest Video Award\n* Nana Natsume for Face Within Japan, Body Within a Vehicle!!'' (顔は日本カラダは車中！！) from SOD (directed by Masaaki Kai)\nSpecial Award\n* Sora Aoi\nDogma D-1 Climax Awards (2005–2007)\nThe D-1 Climax  (D-1 クライマックス) awards were a competition among directors. The AV studio Dogma invited a number of directors to produce a video under the Dogma label. The winner was determined by sales of the video over a three-month period and judges' votes.\n1st D-1 Climax Awards 2005\nNine directors were chosen for the first competition. Videos were released on September 15, 2005, as Dogma D1-001 through D1-009. Dogma also released a DVD with scenes from the videos and a bonus video of the D-1 Climax ceremonies.\n'''Director's Grand Prix Award'\n* TOHJIRO for M Drug - Female Meat Toilet - Mayura Hoshitsuki [D1-009] with Mayura Hoshitsuki\n* Hitoshi Nimura (2nd place) for The Most Naughty Thing In This World (この世で、いちばんエロいコト。ダブル痴女の濃厚接吻セックス&ふたなりレズ) [D1-008] with Ramu Amamiya & Airu Kaede\n* Baba The Babee (3rd place) for Shit Freedom (くそ解禁 七海ここな・西村あみ) [D1-004] with Kokona Nanami & Ami Nishimura\n2nd D-1 Climax Awards 2006\nFor the second contest, 11 directors competed with videos released by Dogma on September 15, 2006, as a series of DVDs numbered D1-201 through D1-211. Once again, a video was released with selected scenes plus the D-1 Climax ceremony.  The award ceremonies which took place on December 20, 2006, also featured an open audition for 42 prospective actresses and the \"Erotic Cinderella Award\" (エロシンデレラ) for Best Actress.\n'Director's Grand Prix Award'\n* TOHJIRO for Getting High On Lesbian Fist-fucking - A Young Girl Dream Is To Be Fist-fucked (レズフィスト・ドラッグ 長谷川ちひろ 友田真希) [D1-211] with Maki Tomoda & Chihiro Hasegawa\n* Itaka Smithering (2nd place) for Pheromone Drug - Ecstasy With a Big Bang (脳内麻薬 ～爆音中出しアクメ～ 持田茜) [D1-207] with Akane Mochida\n* Hitoshi Nimura (3rd place) for Hermaphrodite - Lesbian Climax (ふたなりレズビアンCLIMAX 立花里子×大塚ひな ) [D1-210] with Riko Tachibana & Hina Otsuka\nErotic Cinderella Award for Best Actress\n* Maki Tomoda\nKurumi Morishita Award\n* Yui Matsuno\n3rd D-1 Climax Awards 2007\nIn the third and last competition, 14 directors produced videos, released by Dogma on September 15, 2007, as a series of DVDs numbered D1-301 through D1-314. There was also an open audition for 60 aspiring porn actresses as part of the award ceremonies held on December 29, 2007.\n'Director's Grand Prix Award'\n* Hitoshi Nimura for Why Pussy Loves Pussy - Lesbian School Girls Addicted To Orgasm [D1-313] with Kasumi Nanase, Rika Nagasawa & Rina Yuki\n* Baba The Babee (2nd place) for Black Baby Zero [D1-312] with Rico\n* Hiroshi Washimoto (3rd place) for No-Bra Salon - The Ultimate Treatment'' (ノーブラサロン NB極上トリートメント ) [D1-302] with Reiko Katahara, Saki Tsuji, Yuu Tsuyuno, Haruna Yokoyama & Ayu Akihara\nMoodyz Awards (2001–2008)\nThe Moodyz Awards began in 2001 as part of a year-end bonenkai (忘年会) party held for Moodyz actresses and staff to honor achievements during the year. Awards were given for actresses, directors, and video titles with the most prestigious prize being the Moodyz Award.\n2001 Moodyz Awards\nThe party and award ceremony were held at the 'NEPUSHISU\" Restaurant in Shibuya, Tokyo on December 27, 2001, with 217 participants. The following awards were given:\nMoodyz Award\n* Dream School 2 (ドリーム学園2) starring Mio Okazaki, Bunko Kanazawa (as Fumiko Kanazawa), Izumi Seika, Mami Goto, Megumi Shirasaki, Ran Fujimaru, Anna Kuramoto & Nana Mizuno, directed by Taikei Shimizu.\nBest Actress Award\n* Mayu Koizumi\nBest Director Award\n* Taikei Shimizu\nSpecial Actress Awards\n* Momoka\n* Marina Kyono\nSpecial Award Title\n* Real Train Molester (史上最強の痴漢電車で本物痴漢を捕まえろ！1)\n2002 Moodyz Awards\nThe party and awards ceremony were held in Ebisu, Tokyo on December 18, 2002, with 400 people in attendance. Awards were given in the following categories:\nMoodyz Award\n* Dream School 5 (ドリーム学園5) starring Nao Oikawa, Izumi Seika, Yumiko Anzai, Karen, Marina Kyono, Nanami Yusa & Yui Fujimoto, directed by Taikei Shimizu.\nBest Actress Award\n* Nao Oikawa\nBest Director Award\n* Alala Kurosawa\nBest Newcomer Award\n* Ran Monbu\nSpecial Actress Award\n* Four Moodyz idols (Momoka, Ran Monbu, Saiko & Marina Kyono) featured in Moodyz Daughter 1 (ムーディーズ娘。1), directed by Akira Shibahara.\nSpecial Award Title\n* (妄走犯 ～ひなこを捕まえて本番しませんか？) starring Hinako and directed by Shigeru Akagi.\n2003 Moodyz Awards\nHeld in Ebisu, Tokyo on December 17, 2003, with more than 700 people participating including actresses and actors, managers, friends, directors and staff, and the press. Awards presented were:\nMoodyz Award\n* Digital Mosaic Vol. 11 (デジタルモザイク Vol.011) starring An Nanba, directed by Sabbath Horinaka\nBest Actress Award\n* An Nanba\nBest Director Award\n* Alala Kurosawa\nBest Newcomer Award\n* Moe Kimishima\nSpecial Actress Award\n* Manami Suzuki\nSpecial Award Title\n* Women Who Want to See the Penis series 1-9 (チンポを見たがる女たち)\nBest Sales Award\n* Dream School 7 (ドリーム学園7) starring An Nanba, Kay, Izumi Seika, Ruri Anno, Hikaru Kawai & Saya Hyozaki, directed by Taikei Shimizu\n2004 Moodyz Awards\nThe ceremony took place on December 22, 2004, at a hotel in Shinjuku, Tokyo with about 120 AV actresses present. Also represented at the party in addition to Moodyz were AV studios Attackers, Madonna and IdeaPocket. The 2004 awards for the Moodyz company were:\nMoodyz\nMoodyz Award\n* Digital Mosaic Vol. 37 (デジタルモザイクVol.037) starring Hikari Kisugi and directed by Tadanori Usami\nBest Actress Award\n* An Nanba\nActress Awards\n* Hikari Kisugi\n* Kirari Koizumi\n* Kyoko Ayana\n* Yui Haruka\nBest Director Award\n* KINGDOM\nDirector Awards\n* Hideto Aki\n* Tadanori Usami\n* Alala Kurosawa\n* Katsuyuki Hasegawa\n* Bunchou Yoshino\nBest Newcomer Award\n* Yui Haruka\nNewcomer Awards\n* Miki Uehara\n* nana\n* Rin Nonomiya\n* MIREI\n* Kaede Fujisaki\n* Ayu Mayumi\nSpecial Awards Titles\n* Bukkake Nakadashi Anal Fuck (ぶっかけ中出しアナルFUCK！) starring An Nanba and directed by Katsuyuki Hasegawa.\n* Dosukoi (どすこい) starring Sakura Sakurada, Yuria Yoshinaga, Kirari Koizumi, Mai Haruna, Syouko Mikami, Mai Tamura, Naho Asakura & Yuu Kanzaki, directed by Yakumo Matsubara.\n* Life in Prison for Sexual Woman (無期懲役痴女刑務所) and Sexual Jail House (塀の中の懲りない痴女と僕の獄中性活 無期懲役痴女刑務所 刑期延長編) both starring Sara Ilyuin, Koyuki Morisaki, Yuu Ichinose, Shizuka Kitayama, Chika Kazeno, Aoi, Chiaki Sakai & Saki Yumemura, and both directed by KINGDOM.\nSpecial Actress Awards\n* Kirari Koizumi\n* Kaede Fujisaki\nSpecial Director Awards\n* Alala Kurosawa\n* Shibato Taiyo\nOther studios\nSome of the other studios associated with the Hokuto Corporation also presented awards for their staff at the 2004 ceremony.\nS1 No. 1 Style Awards\n:Best Newcomer Award\n:* MEW\n:Special Actress Award\n:\n:S1 Award\n:* Sell Debut (セル初) starring Sora Aoi and directed by Hideto Aki\nAttackers Awards\n:Best Actress Award\n:* Ruka Uehara\n:Attackers Award\n:* Psychic Agent Ruka (サイキックエージェント 留華) starring Ruka Uehara with Serina Komuro & Aoi, and directed by Kiwanosuke\n2005 Moodyz Awards\nHeld in Tokyo in December 2005 with over 1000 in attendance including more than 300 actresses. For 2005, manufacturers S1 No. 1 Style, IdeaPocket, Attackers and Madonna also presented separate awards for their companies at the ceremony.\nMoodyz\nMoodyz Award\n* A Queendom of Eros (エロスの王宮) starring  Miki Komori, Ayano Azusa, Yuna Takizawa, Chihiro Hara, Shuri Himesaki & Jun Seto, directed by KINGDOM.\nBest Actress Award\n* An Nanba\nBest Director Award\n* Wataru Ishibashi\nBest Newcomer Award\n* Natsumi Yoshioka\nSpecial Actress Awards\n* Sayuki\n* Hotaru Akane\nSpecial Award Titles\n* Celeb x Bitch Yuna Takizawa (セレビッチ 滝沢優奈) starring Yuna Takizawa & Celeb x Bitch Sayuki (セレビッチ 沙雪) starring Sayuki.\nS1\nBest Actress Award\n* Sora Aoi\nBest Newcomer Award\n* Maria Ozawa\nS1 Award\n* Sell Debut Yua Aida (ギリギリモザイク あいだゆあ) starring Yua Aida and directed by Hideto Aki\nIdeaPocket\nSpecial Award\n* Megu Shirosaki\nBest Director Award\n* AZNA(あずな)\nBest Actress Award\n* Mina Nakano\nIdeaPocket Award\n* First Impression Rena Nagai (First Impression 永井レナ) starring Rena Nagai and directed by Tadanori Usami\nAttackers\nBest Director Award\n* Katsuyuki Hasegawa\nBest Actress Award\n* Ruka Uehara\nAttackers Award\n* Slave Island (奴隷島) starring Syuri Himesaki, Ryoko Mizusaki & Kyōko Kazama, and directed by Kenzo Nagira\nMadonna\nBest Actress Award\n* Kyōko Aizome\nMadonna Award\n* ''Widow's Obscene Desire (愛欲の未亡人) starring Kyōko Aizome and directed by HiroA\n2006 Moodyz Awards\nFor the 2006 combined awards held in Tokyo on December 19, 2006, the participating studios included not only Moodyz but also S1 No. 1 Style, IdeaPocket, Attackers, Madonna, Cross, Premium, Opera, Yellow, Hajime-Kikaku and Goro Tameike, all associated with the Hokuto Corporation and selling their products via the DMM website. A fashion show and entertainment by erotic-rock band \"Campakex\" were part of the ceremony.\nBest Actress Award\n* Yuma Asami\n* Honoka (2nd Place)\n* Rin Aoki (3rd Place)\n* Nayuka Mine (4th Place)\n* Sayuri Shiraishi (5th Place)\nBest Title Award\n* K-cup Active Idol Risky Mosaic (現役アイドル ギリギリモザイク 青木りん) starring Rin Aoki, and directed by Hideto Aki [S1 ONED-432]\n* New Face Risky Mosaic (新人 ギリギリモザイク 麻美ゆま) starring Yuma Asami, and directed by Hideto Aki (2nd Place) [S1 ONED-292]\n* Sell Debut x Risky Mosaic (セル初 ギリギリモザイク 穂花) starring Honoka, and directed by Hideto Aki (3rd Place) [S1 ONED-381]\n* Karin - Active Idol Debut (現役アイドル ギリギリモザイク 果梨) starring Karin [S1 ONED-538]\n* Deep Impact - Honoka Sell Debut (ディープインパクト 穂花) starring Honoka, and directed by Tadanori Usami [Premium PGD-001]\nBest Director Award\n* Hideto Aki\n* Tadanori Usami (2nd Place)\n* Goro Tameike (3rd Place)\n* Kenzo Nagira (4th Place)\n* Eitaro Haga (5th Place)\n2007 Vegas Night\nIn 2007 the awards were sponsored by Moodyz and 22 other AV manufacturers who distribute their products through DMM, the online distribution arm of the Hokuto Corporation. The field for award nominations was widened to include these other companies, including actresses and directors from S1 No. 1 Style who won the majority of the awards. The ceremony was held in Las Vegas, Nevada on December 17, 2007.\nBest Actress Award\n* Akiho Yoshizawa\n* Mihiro (2nd Place)\n* Honoka (3rd Place)\n* Yuma Asami (4th Place)\n* Aya Tanaka (5th Place)\nBest Title Award\n* Hyper-Risky Mosaic Mihiro (ハイパーギリギリモザイク みひろ) starring Mihiro, and directed by Hideto Aki - S1 studio\n* Hyper-Risky Mosaic Akiho Yoshizawa (ハイパーギリギリモザイク 吉沢明歩) starring Akiho Yoshizawa, and directed by Hideto Aki (2nd Place) - S1 studio\n* AV Consent (AV了解) starring Minori Hatsune and directed by Seishiro Bando (3rd Place) - S1 studio\n* Active Announcer, Shock!! Real Name AV Debut - Aya Tanaka (現役アナウンサー衝撃！！実名AVデビュー 田中亜弥) starring Aya Tanaka and directed by Tatsuya Aoki (4th Place) - Moodyz studio\n* Newcomer - Giri Giri Mosaic (新人×ギリギリモザイク ミス湘南ギリギリモザイク 浜名優衣) starring Yui Hamana and directed by KENGO (5th Place) - S1 studio\nBest Director Award\n* Hideto Aki\n* Tadanori Usami (2nd Place)\n* Goro Tameike (3rd Place)\n* Seishiro Bando (4th Place)\n* Fubuki Sakura (5th Place)\n2008 Moodyz Awards\nThe 2008 Moodyz Awards were even more broad-based than the 2007 Vegas Night with 37 AV producers participating.\nBest Actress Award\n* Rion Hatsumi\n* Akiho Yoshizawa (2nd Place)\n* Rio (Tina Yuzuki) (3rd Place)\n* Honoka (4th Place)\nBest Title\n* High School Girl and Sex (学校でしようよ！ 初美りおん) starring Rion Hatsumi, directed by Tadanori Usami, released by IdeaPocket\n* Risky Mosaic Rio (ギリギリモザイク Rio) starring Rio (Tina Yuzuki), directed by Hideto Aki, released by S1 (2nd Place)\n* Special Bath House Tsubaki 8 Hours'' (ハイパー×ギリギリモザイク 特殊浴場TSUBAKI8時間) with 12 actresses, directed by Hideto Aki, released by S1 (3rd Place)\nBest Director Award\n* Tadanori Usami\n* Hideto Aki (2nd Place)\n* YOUSEI (3rd Place)\n* [[(Jo)Style|[Jo]Style]] (4th Place)\nNotes"
    }
  ]
}