{
  "content": [
    {
      "type": "text",
      "text": "# List of buildings in King's Lynn\n\nKing's Lynn is an English market town in West Norfolk. This list details a selection of some of the more prominent buildings in the town.\nChurches\nAll Saints' Church\nAll Saints' Church () in South Lynn predates the Domesday Book of 1086, where it is described as All Hallows, in a reference to the founding of a Cluniac priory by Lord Ralph de Tony. The church is known today for the Anchorhold room located on the south side of a church. For a period of several centuries it was occupied by cloistered Anchorite women. The church is Grade II* listed.\nKing's Lynn Minster (St Margaret's Church)\nThe construction of St Margaret's Church () in 1101 is the point at which King's Lynn first came into existence in terms of how it is now recognised today. Commissioned by the Bishop of Norwich, Herbert de Losinga, at the request of the townspeople 'in honour of the Holy Mary Magdalene and St Margaret and all holy virgins', the church is one of the town's most dominating landmarks. Along with St Nicholas' church in Great Yarmouth, it was granted the honorific title of \"minster\" in 2011.\nThe most serious damage to the church occurred in 1741, when a great storm destroyed the spires of St Margaret's church and St Nicholas' Chapel as well as St Margaret's central lantern. Despite generous donations totalling £1,000 from George II and Robert Walpole, the £3,500 required was not raised, and the church was not able to be restored to its former glory.\nThe sixteen misericords date from 1370 to 1377. These predominately feature heads; for instance, S-02 is the head of Edward the Black Prince. The supporters are mainly floral / foliate.\nThe church is a Grade I listed building.\nSt Nicholas Chapel\nSt Nicholas Chapel () was constructed around 1200, during the expansion of Lynn by Bishop William Turbus, the third Bishop of Norwich. The expansion saw not only the construction of the chapel, but also the Tuesday Market Place, which is still the primary marketplace in the town today. Consequently, the chapel quickly became Lynn's second church by a comfortable margin. It was not long before it was so popular that it launched pleas to become an independent parish from St Margaret's Church; in 1426 St Nicholas Chapel had congregations of 1,400 – compared to 1,600 at St Margaret's. Despite this, it took until 1627 before the chapel obtained baptismal rights.\nDue to its rise in popularity, and the fact that the north of Lynn became quite affluent, the chapel was rebuilt between 1380 and 1410 on a much larger scale in the grand perpendicular scale of the time.\nThe church is England's largest chapel of ease, a chapel dependent on a church and serving part of the parish for the convenience of parishioners nearby.\nThe church is most distinctive for its tall spire, although it is not the original. There were at least two spires previously – one of which was destroyed in the storm of 1741 (along with the spire and lantern of St Margaret's), and another which stood from 1749 to 1854 (described as 'never a regular spire but a kind of wooden extinguisher stuck on to be seen at sea').\nThe chapel is a Grade I listed building.\nHistoric buildings\nSt George's Guildhall\nSt George's Guildhall in King's Lynn is a Grade I listed building, currently in the ownership of the National Trust. At 32.6 x 8.8 m (107 x 29 feet), it is the oldest and largest complete medieval Guildhall in England, with an unrivalled history as a venue for theatrical production.  At present it is leased by the Borough Council for hire by the public as a space for music, performances, lectures and entertainments.\nCustom House\nThe King's Lynn Custom House () is one of the town's most iconic landmarks. It was designed by architect Henry Bell and built by Sir John Turner in 1683. It was not the first Custom House built for the town – originally one was constructed in 1620 on the site where the Hogge Mansion is currently located (currently occupied by Barclay's Bank); however, this was too small and as a result a larger one was needed; St George's Guildhall was used in the intervening years.\nIt is a Grade I listed building.\nThe building was described by architect Nikolaus Pevsner as \"one of the most perfect buildings ever built\". He was an admirer of King's Lynn in general, also commenting that the walk from the Tuesday Market Place to the River (by the Custom House) was one of the finest in the world.\nGreyfriars Tower\nThe Greyfriars Tower () is the only remaining part of the Franciscan monastery on this site, and one of only three surviving Franciscan monastery towers in England and is considered to be the finest. It is a Grade I listed building.\nFollowing the Dissolution of the Monasteries by Henry VIII, nearly all such monasteries were demolished. The tower at Lynn remained because it was considered to be a useful seamark by sailors entering the town, still being clearly visible on the town's skyline to this day.\nThe tower is informally referred to as 'the leaning tower of Lynn' as it leans dramatically to the west. At its worst, the lean was 67.5 centimetres – which given its height of more than 28 metres is just over 1 degree. This compares to 3.98 degrees on the Leaning Tower of Pisa.\nAlthough it was not believed to be in imminent danger of collapse, work was undertaken in 2006 to .\nThe tower itself was featured in the first season of the BBC TV series Restoration for the Eastern region.\nSouth Gate\nThe South Gate () is one of the most recognisable structures in King's Lynn, as most visitors to the town still have to pass through it. Originally constructed in the 14th century, it was rebuilt in the 1450s, much in the form that is seen today. However the ashlar front, which gives the building a much more imposing impression, is merely a facade which was added in 1520; the structure itself is actually bricks and mortar, which given the date of construction makes it one of the oldest surviving brick structures in the country. It is a Grade I listed building.\nAlthough the gate has stood largely unaltered since the 1520, it was modified later in the 19th century with the two smaller arches to the side of the main one. Whilst the main arch was used for horse-drawn carriages, the smaller arches were intended for pedestrians – mainly the lower class. However, by the end of the 19th century the traffic demands had grown so much that in 1899 London Road was widened, and now the gate only straddles half of the road.\nToday, traffic still passes through the arch to enter from the south. The structure is situated on London Road, one of the busiest roads in the town, meaning there is a constant stream of traffic through it during the day. Despite this, accidents are unheard of, as the arch can comfortably fit most forms of traffic from articulated lorries to double-decker buses.\nTown Hall and Trinity Guildhall\nThe town hall of King's Lynn () has existed since the early fifteenth century, between 1422 and 1428, when the Guildhall of the Holy Trinity was built. It is the most prominent feature of the town hall today with its steep arched roof, large window and chequered patterned exterior. The building was enlarged in 1624, when an extension with the same chequered style was added which now forms the main entrance to the town hall. The guildhall is a Grade I listed building.\nThe arms of Elizabeth I can be seen above the main window on this building. They were removed from St James' Church on 7 August 1624. The arms of Charles II are above them – they were added 40 years later.\nCorn Exchange\nThe Grade II listed facade of King's Lynn Corn Exchange, originally built in 1854, is a testimony to the glory of Victorian architecture. The hall itself is a simple brick rectangle with a glazed roof supported by delicate wrought-iron trusses. The building was still used for community events until the mid-1990s, although showing signs of age. A project to restore and enlarge it, as had been done with Cambridge Corn Exchange in the mid-1980s, was begun with the aim of creating a venue suitable for a wide range of cultural activities.\nThe Dukes Head hotel\nThe Dukes Head is reputed to be one of the most haunted buildings in King's Lynn. It stands on the site of an ancient inn called the Gryffin. There is a grey lady, the man who reputedly shot himself in room 18 during the 18th century, and probably a host of other less spooktacular residents.\nRed Mount\n]]\nSitting in the centre of The Walks, King's Lynn's main urban park, lies the Red Mount chapel (). Also known as 'Our Lady's Chapel' it is a remarkable building in that it is completely unique and no other building like it can be found. It was built in the 15th century to contain a relic of the Virgin, but was also used by pilgrims on their way to Walsingham.\nIt was built by Robert Corraunce on instructions from the Prior of Lynn. The inner core is divided into 3 storeys and there is an additional cross-shaped ashlar building in Ancaster stone on top.\nBefore the renovation of the Walks, its location in the centre of the park meant it was the target of vandalism – particularly graffiti. However, since rejuvenating the Walks, the curious landmark is now open to the public during the day. It is a Grade I listed building. The Red Mount was the subject of a painting by Thomas Baines.\nLibrary\nThe King's Lynn library () was funded and opened by philanthropist Andrew Carnegie. It is possible that he chose King's Lynn as a site for the library due to its close proximity to the Royal residence in Sandringham in an attempt to get a knighthood – however, this is probably a cynical point of view given Carnegie's history of financing libraries across the world, as well as his positive comments regarding King's Lynn and similar towns in his autobiography. It had a brief period of fame in May 2010 following reports in the national press that bouncers had been hired to keep order in the Library following incidences of anti-social behaviour. The ghostly monk who reputedly haunts the cellar is another matter however, at one time, female staff were apparently too scared to enter the area by themselves.\nThe library is built on the site of the Greyfriars monastery, and sits adjacent to the remains of the tower. The library is still in use today and is still the town's primary library, opening Monday to Saturday. It is situated on London Road, the main entrance to the town, opposite one of the entrances to the Walks, the town's main urban park.\nOld county court house\nThe County Court was built in 1861 and closed in the recent years. It is now home to a firm of solicitors.\nTheatre Royal\nThe Theatre Royal () is situated in St James Street next to the Greyfriars Tower. It is no longer used as a theatre and is now the home of Gala bingo. The present building replaced a previous structure that burnt down in May 1936.\nThe Majestic Cinema\nOne of King's Lynn's more 'modern' buildings. The cinema, situated in Tower Street, was built and run by Ernest, Ralph, Adams in 1927. Mr. Adams worked closely with architects Carnell and White, in its design and construction, buying the contents of the Empire, Leicester Square, London, which following restoration, were installed in the interior of the Majestic. The Majestic officially opened on 23 May 1928; It was later owned by Union and subsequently ABC Cinemas. this year is commemorated in the stained glass window at the front of the building.\nHanseatic Warehouse\nLocated on St Margaret's Lane, the Hanseatic Warehouse () is the only surviving Hansa building in England. It was constructed in 1475 following the Treaty of Utrecht, allowing Hansa to establish a trading depot in Lynn for the first time. It was used as such until 1751, by which time the river had receded. It was then sold to Lynn merchant Edward Everard for £800. He added the Georgian town house at the East side of the building which is now known as St Margaret's House (and Grade I listed), after the nearby church.\nIn 1971 it was renovated as part of a preservation project and converted into offices by the Norfolk County Council. It is currently used by the council for various functions, including weddings, as it houses Lynn's register office.\nHampton Court\nLocated near to St Margaret's Church, Hampton Court () is a Grade I listed group of buildings forming a quadrangular shape which were built up over a period of 300 years.\nThe South Wing was constructed first, consisting mainly of a 14th-century merchant's hall house and is thus the earliest surviving section.\nThe West Wing was constructed towards the end of the 15th century, probably as a warehouse to better service and extend the business part of the merchants premises. When it was constructed, it was on the edge of the river bank, but by the 17th century the river had receded and the warehouse was converted into a house.\nClifton House\nClifton House () is a Grade I listed building located at the heart of King's Lynn. A former merchant's house, it retains an amazing series of historic interiors dating from the 13th to the 18th centuries. Features of interest include two tiled floors from the later 13th century (the largest in-situ tiled floors in any secular building in Britain); the 14th-century vaulted undercroft; the five-storey Elizabethan tower and a series of rooms created by the architect Henry Bell in 1700.\nThe house is a privately owned family home, but is open to visitors on a number of occasions during the year.\nMarriott's Warehouse\nMarriott's Warehouse, was originally an old Tudor Warehouse built on the quayside late in the Elizabethan Era (1533–1603). Thomas Clayborne funded its construction. It was used to store corn from visiting ships, and is believed to have been constructed with robbed out materials taken from monastic properties confiscated by the crown during the Dissolution of the Monasteries in the reign of Henry VIII of England (1491–1547). Restored in the early 2000s as The Green Quay the building has now reverted to its original name. It is now used as an educational facility, with exhibits about The Wash, The Fens and local heritage on the upper floors, while the ground floor has become a popular restaurant.\nSt Anne's Fort\nBuilt in 1570. Located in the northwest corner of the town where the Fisher Fleet joined the Ouse, it was the major fortification in Lynn until replaced by defences outside the town in 1839. It was originally just an earthwork platform for cannons, some buildings, a section of wall and a gate giving access to the Fisher Fleet. In 1625 pirate raids on Lynn led to the town petitioning the King for 12 guns for the battery. These were delivered. Even as late as 1778, when the ten guns in the fort were replaced by ten 18-pounders, the battery had no protective parapet. Troops were billeted here for many years. Decommissioned in 1839, it was never more than a coastal battery. Today there are only fragmentary remains of walls and the pilot's office. Until the late 1930s a small square lock-up stood nearby where drunken sailors and townspeople were incarcerated for the night.\nThe Lattice House\nThis pub (originally a 15thC town house) situated in Chapel Street, not far from the Tuesday Market Place, uses the name acquired in 1714, when this ancient building first became an inn. Previously, it had been used for centuries by the clerks of the nearby Chapel of St Nicholas.\nThe growth of Lynn, in the 18th century, saw the building of new taverns, as well as the conversion of shops or workshops. The Lattice House is an example of the latter, becoming a public house in 1714. For many years it was called Ye Olde Lattice Inn, until its closure in 1919. It became a public house once again in 1982.\nThe Grampus\nAn old hostelry in Pilot street. It ceased to be a public house in 1921 and is now a private residence.\nThe Valiant Sailor\nA 15th-century building in Nelson street. It probably became an inn in the late 1600 but ceased to be licensed in 1925. The well-known artist Walter Dexter lived here until his death in 1958.\nThe Exorcist's house\nThis house was attached to St Nicholas's church. The position of exorcist in olden times was one which a Catholic priest could hold as he progressed up the church career ladder. It has a reputation of being haunted. It is believed that a previous occupant dabbled in the black arts here. It is also the former residence of author and broadcaster  F. R. Buckley.\nJewish cemetery\nThe Jewish Community in King's Lynn was founded in about 1740, but ceased to exist by the middle of the nineteenth century, although it was briefly revived during World War II.\nGrade I listed buildings\n* Guildhall of St George\n* Nos 28, 30, 32 King St\n* Thoresby College\n* Clifton House\nModern buildings\nVancouver Quarter\nVancouver Quarter (), also referred to as the Vancouver Shopping District, is the contemporary main shopping centre in King's Lynn. It was originally constructed to much controversy in the 1960s, as many people objected to the idea of a traditional market town having its historic centre pulled down and replaced with modern shops.\nIn 2007, the shopping centre was rebranded 'The Vancouver Quarter' with a sign placed at the top of the circular building (currently Costa); it was previously just referred to as the 'Vancouver Shopping Centre', the name Vancouver coming from the explorer Captain George Vancouver, who was born in the town.\nPolice Station\nThe Police Station () is situated next to the Greyfriars Tower, near to the Multi-storey car park.\nSt James Street Car Park\nCompleted in 2005, the St James Street Car Park () is the only multi-storey car park in the town. It was built in conjunction with the redevelopment of the Vancouver Shopping Centre. The car park was described as 'without compare' by Kevin Beresford, self-appointed head of the Car Park Appreciation Society, who awarded the car park as the best in Britain – claiming it was 'love at first site', citing praise: \"It is spacious, well-lit and adorned with beautiful red brickwork, complemented by slinky silver vertical aluminium fins that create a rippling wave effect. However, these cosmetic fins are apt to cause problems in  high winds.\nPart of the reason the car park has received such praise for its aesthetics is the commitment by the council to ensure that none of the materials used in construction were downgraded to cheaper alternatives.\nThere are 700 car parking spaces on 4 levels, 4 pay points, two elevators and 3 staircases.\nPost Office\nThe Central Post Office (), found on Baxter's Plain in King's Lynn, closed from public use in late September 2007. Customers wanting to send letters or parcels now have to go to a refurbished section of Lynn's WHSmith branch on Norfolk Street. Incidentally, the oak panels lining the interior walls of this building were taken from the old London bridge. The World War memorial plaque is now located in the Austin fields sorting office.\nIndustrial buildings\nKing's Lynn Power Station\nKing's Lynn Power Station () is located on Willows Business Park, Saddlebow, King's Lynn. The plant is Gas Fired which is supplied using gas from Transco's National Transmission System. Construction of the power station began in October 1994 and was completed and started producing electricity in December 1997. The owners of the plant, TXU sold the plant to Centrica in October 2001.\nAlthough popular belief is that the power station was built on the site of the old Sugar Beet Factory the actual site is slightly south of where the plant was situated.\nKing's Lynn Docks\nConsidered to be as important to England in medieval times as Liverpool was during the Industrial Revolution, the port at King's Lynn has been fundamental to the town's economy as long as it has existed.\nOriginally, ships docked at the town near the Customs House, down past the quay near St Margaret's Church. However, with the development in ship design during the Industrial Revolution this was no longer adequate, and in the 19th century the larger, more modern docks () were constructed. Whilst the surrounding structures and equipment are now obviously more modern, the docks themselves are still the same today.\nThe white tower, a grain silo, seen in the photograph is the tallest structure in King's Lynn and can be seen for miles.\nGaywood\nGaywood Clock\nA war memorial erected by the residents of Gaywood in 1920. It used to be located in the centre of the nearby road until being moved in 1990 to the paved area outside the former Clock Café.\nBishop's Terrace\nGrade II listed 16th-century building tastefully converted into shop units. Many people miss this building on their rush to get somewhere else. Oak beams are on display in many of the shop units.\nGaywood Almshouses\nThese almshouses are of 13th-century origin. Until comparatively recent times they were known as Gaywood Hospital. They were destroyed in the Siege of Lynn in 1643, and rebuilt in 1649. The eight almshouses are arranged around a courtyard. They were restored in 1904, with further modernisation in 1965.\nThere is a well-known painting by Sir George Clausen (1852&nbsp;– 1944) of these almshouses from 1881.\nDemolished buildings\nThe Pilot Cinema\nThe Pilot cinema on Pilot Street was built by local builder Ben Culey in 1938. It closed in 1983 and the last film shown according to local memory was Gandhi. Since then it has been a roller skating rink, a garden centre and, lastly, Zoots nightclub which was refurbished at a cost of 2&nbsp;million pounds before it reopened on 15 April 1999. It closed the doors for the final time on Saturday, 26 January 2008. Since then it has been left to become derelict.\nIn April 2014 the old pilot cinema was demolished to make way for a new housing development.\nCampbell's Soup Tower (1959–2012)\nIn a low-rise market town, the vertical addition of the Campbell's Soup Tower () in 1959 marked a radical departure from the norm. Due to the flat nature of the Fens the building was visible for miles, much more prominently than any of the other tall buildings, mostly church towers, so it was often referred to as King's Lynn's 'Skyscraper'.\nThe tower was built as part of Campbell's international expansion. King's Lynn was chosen as a site due to the large local agricultural economy.\nThe building was situated on the town's largest commercial/industrial sector, the Hardwick Estate. It was the most noticeable part of the estate when driving past on the A47 southern bypass.\nThe tower was demolished by a controlled explosion on 15 January 2012 to make way for a new Tesco superstore and outlet which opened in October 2013.\nThe Shambles\nThe Shambles (meat market downstairs and grammar school upstairs) once stood near the site of the Saturday market place until 1914, when it was demolished to enlarge the marketplace. Eugene Arram taught in the grammar school here.\nThere are sealed off underground passages associated with this building that were allegedly used in WW2 as air raid shelters.\nEast Gate\nApproximately 200 years prior to the erection of the South Gate, there was another gate, the East Gate, situated on the borders of King's Lynn and Gaywood.\nThe East Gate originally stood near what is now known as Dodman's Bridge, near the College of West Anglia. Also known as St Catherine's Gate, it was demolished in 1800 because the low arch was a hindrance to traffic. The stone was taken to Hillington Hall and used in the construction of the main gate, while the coat of arms that formerly adorned the East Gate is now above the entrance to King's Lynn Crown Court.\nReffley Temple\nThe inscription above the door read: REFFLEY TEMPLE\nErected by a Friendly Society AD 1789\nEnlarged AD 1841\nThe Brethren or Sons of Reffley were a secret society of Royalist sympathisers formed in 1650. In 1750–56 an obelisk  dedicated to 'Bacchus and Venus' was erected at the site of a chalybeate spring, the basin of which still exists, although damaged and dry. The Temple was built by the brethren as a rendezvous for social gatherings. In the 1980s the temple was vandalised and pulled down, the obelisk demolished, and the spring dried out. On one side of the obelisk was a curse, stating \"Whosoever shall remove this or bid its removal, let him die the last of his race\".\nThe Athenaeum\nThe Athenaeum was built on Baxter's plain where the old post office now stands. It opened on 16 August 1854 with the aim of uniting the town's literary, artistic and scientific societies under a single roof. Unfortunately it was a commercial failure and a large part of the building was taken over by the government as a post office and telegraph station on 20 January 1883.\nGallery\nThe following are photographs of buildings not detailed above and minor details of buildings not warranting a paragraph themselves.\nImage:St John's Church King's Lynn.JPG|St John's Church\nImage:Guildhall King's Lynn.JPG|St George's Guildhall\nImage:True's Yard King's Lynn.JPG|True's Yard Museum\nImage:Granary King's Lynn.JPG|The Granaries\nImage:King's Lynn Mart 2.jpg|Tuesday Market Place whilst the Mart is in town\nFile:Dedication window 1928.JPG|Stained glass 1928 dedication window above entrance to Majestic cinema\nImage:Kingslynnfrontage.jpg|Railway Station\nImage:Bagge_Mansion_King's_Lynn.JPG|Bagge Mansion\nFile:Demeter, Kings Lynn corn exchange.JPG|Statue of Demeter above Corn Exchange facade\nFile:080209 - kings lynn - 004.JPG|Hogge Mansion\nImage:St Margaret's House King's Lynn.JPG|St Margaret's House\nimage:365504 at King's Lynn.jpg|Railway Station\nFile:Our Lady of the Annunciation Church, King's Lynn by N Chadwick geograph 6638177.jpg|Our Lady of the Annunciation Church, King's Lynn\nSee also\n* Blackfriars, King's Lynn\nReferences\nExternal links\n* [http://www.allsaintskingslynn.org.uk All Saints' Church website]\n* [http://www.cliftonhouse.org.uk Clifton House – A 13th-century merchant's house]\n* [http://www.stmargaretskingslynn.org.uk/ The homepage of St Margaret's Church]\n* [https://web.archive.org/web/20090917065811/http://www.west-norfolk.gov.uk/Default.aspx?page=24485 Red Mount Chapel] – visiting information\n* [https://web.archive.org/web/20100705124935/http://www.west-norfolk.gov.uk/Default.aspx?page=21817 Custom House] – visiting information"
    }
  ]
}