{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in Bulgaria__disambig_1\n\n}}\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) designates World Heritage Sites of outstanding universal value to cultural or natural heritage which  have been nominated by countries which are signatories to the UNESCO World Heritage Convention, established in 1972. Cultural heritage consists of monuments (such as architectural works, monumental sculptures, or inscriptions), groups of buildings, and sites (including archaeological sites). Natural heritage consists of natural features (physical and biological formations), geological and physiographical formations (including habitats of threatened species of animals and plants), and natural sites which are important from the point of view of science, conservation, or natural beauty. Bulgaria accepted the convention on 7 March 1974.\n, there are ten World Heritage Sites listed in Bulgaria. The first four sites were listed in 1979: the Boyana Church, the Madara Rider, the Rock-hewn Churches of Ivanovo, and the Thracian Tomb of Kazanlak. Four more sites were listed in 1983, one in 1985, and the most recent one in 2017. Seven of these sites are cultural and three are natural. There is one transnational site, the Ancient and Primeval Beech Forests of the Carpathians and Other Regions of Europe, which is shared with 17 other countries. In addition, Bulgaria maintains 16 sites on the tentative list.\n__TOC__\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural, and vii through x are natural.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" |\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" | Boyana Church\n|\n| Sofia\n| 1979\n| 42; ii, iii (cultural)\n| The Bulgarian Orthodox Boyana Church in the outskirts of Sofia is an ensemble of three buildings. The first part was built in the 10th century, the second in the 13th, and the third in the early 19th century. Wall paintings dating from all periods have been preserved in full or in fragments and have been carefully restored in the 21st century. The frescos from the mid-13th century that were commissioned by Kaloyan Sebastocrator are considered of the best artistic value in the complex.\n|-\n! scope=\"row\" | Madara Rider\n|\n| Shumen Province\n| 1979\n| 43; i, iii (cultural)\n| The Madara Rider is a rock relief depicting a knight on a horse, triumphing over a lion, and accompanied by a bird and a dog. It was carved in a  tall cliff, at a height of , near the village of Madara. It dates to the beginning of the 8th century, when Madara was a sacred site of the First Bulgarian Empire. Near the relief, there are inscriptions in Medieval Greek, describing the events of the early Bulgarian state and its khans.\n|-\n! scope=\"row\" | Thracian Tomb of Kazanlak\n|\n| Stara Zagora Province\n| 1979\n| 44; i, iii, iv (cultural)\n| The tomb dates to the Hellenistic period, at the end of the 4th century BCE. It is a beehive tomb (a tholos), with a narrow corridor and a round burial chamber. The frescos in the tomb depict Thracian culture and burial rites. The tomb is a part of a larger necropolis, located near the ancient Thracian city of Seuthopolis, the capital of king Seuthes III. It was rediscovered in 1944, with frescos remarkably well-preserved.\n|-\n! scope=\"row\" | Rock-Hewn Churches of Ivanovo\n|\n| Ruse Province\n| 1979\n| 45; ii, iii (cultural)\n| In the 12th century, hermits started carving churches, cells, and monasteries in the cliffs above the river Rusenski Lom, near the village of Ivanovo. The frescos from the 14th century, during the Second Bulgarian Empire, are some of the finest examples of the Palaeologues style and represent a departure from the earlier Byzantine iconography, by means of composition and motives.\n|-\n! scope=\"row\" | Rila Monastery\n|\n| Kyustendil Province\n| 1983\n| 216; vi (cultural)\n| The monastery was founded in the 10th century by Saint John of Rila and was an important spiritual and cultural centre of Bulgaria through centuries. It was especially important as a Christian centre during the Ottoman rule in Bulgaria. The monastery was destroyed in a fire in the early 19th century and rebuilt between 1834 and 1862, at the time of Bulgarian National Revival.\n|-\n! scope=\"row\" | Ancient City of Nessebar\n|\n| Burgas Province\n| 1983\n| 217; iii, iv (cultural)\n| The coastal city of Nessebar started as a Thracian settlement and became a Greek Black Sea colony in the 6th century BCE. Most remains date to the Hellenistic period, including the acropolis and a temple of Apollo. The city was an important Byzantine Christian centre in the Middle Ages; a basilica and a fortress remain from this period. The 19th century saw the construction of wooden houses in the style of Bulgarian National Revival.\n|-\n! scope=\"row\" | Srebarna Nature Reserve\n|\n| Silistra Province\n| 1983\n| 219bis; x (natural)\n| Lake Srebarna and the surrounding wetlands near the Danube river are important habitats for birds, either as a breeding place, wintering area, or as a stop on a migratory route. There are 178 species recorded in the area, including several that are endangered or globally threatened. The lake is home to the largest colony of Dalmatian pelicans in Bulgaria. A minor boundary modification took place in 2008.\n|-\n! scope=\"row\" | Pirin National Park\n|\n| Blagoevgrad Province\n| 1983\n| 225bis; vii, viii, ix (natural)\n| The national park in the Pirin Mountains comprises different types of mountain habitats, from pine forests, alpine meadows, and high mountains, with the highest peak at . It is home to many plant and animal species, including brown bear and wolf. The site boundaries were extended in 2010.\n|-\n! scope=\"row\" | Thracian Tomb of Sveshtari\n|\n| Razgrad Province\n| 1985\n| 359; i, iii (cultural)\n| The Thracian tomb dates to the 3rd century BCE and was rediscovered in 1982. The decoration is extremely well preserved and is a rare example of Thracian architecture. It represents the local art of the Gets, inspired by Hellenism. A prominent feature of the tomb are 10 caryatids which are half women and half plants.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\" | Ancient and Primeval Beech Forests of the Carpathians and Other Regions of Europe\n|\n| several sites\n| 2017\n| 1133ter; ix (natural)\n| The Primeval Beech Forests are used to study the spread of the European beech (Fagus sylvatica) in the Northern Hemisphere across a variety of environments and the environment in the forest. The site is shared with 17 other European countries. The site was first listed in 2007 in Romania and Ukraine, first extended in 2011, then again in 2017, when the nine properties within the Central Balkan National Park in Bulgaria were added, and finally in 2021.\n|}\nTentative list\nIn addition to sites inscribed on the World Heritage list, member states can maintain a list of tentative sites that they may consider for nomination. Nominations for the World Heritage list are only accepted if the site was previously listed on the tentative list. , Bulgaria recorded 16 sites on its tentative list.\n{|class=\"wikitable sortable plainrowheaders\"\n|+\n|-\n! style=\"width:100px;\" scope=\"col\"| Site\n! class=\"unsortable\"  style=\"width:150px;\" scope=\"col\"| Image\n! style=\"width:80px;\" scope=\"col\"| Location\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\"| UNESCO criteria\n! scope=\"col\" class=\"unsortable\" | Description\n|-\n! scope=\"row\" | Two neolithic dwellings with their interior and household furnishings and utensils completely preserved\n|\n| Stara Zagora Province\n| 1984\n| iii, iv (cultural)\n| This nomination covers two neolithic dwellings, dating to the 6th millennium BCE, now located in the city of Stara Zagora. They are remarkably well preserved, the best in the world from that period. Several household appliances were found on the site, including ceramics, ornaments, stone tools, hand grinders, and there are preserved furnaces. A dedicated museum has now been constructed above the site to allow visitor access.\n|-\n! scope=\"row\" | The Magoura cave with drawings from the Bronze Age\n|\n| Vidin Province\n| 1984\n| (cultural)\n| The cave, located near the village of Rabisha, has several accessible halls and galleries. It was occupied during the Bronze Age and early Iron Age. Remnants of settlements have been preserved in the cave, as well as wall drawings that were likely ritual in nature.\n|-\n! scope=\"row\" | The ancient town of Nicopolis ad Istrum\n|\n| Veliko Tarnovo Province\n| 1984\n| iii, iv (cultural)\n| The town was founded by the Roman Emperor Trajan at the beginning of the 2nd century CE, after the Dacian Wars. The town had an orthogonal plan and was surrounded by fortified walls. They minted their own coins. During the Byzantine period, the town was an episcopal centre, until it was ultimately destroyed by the Avars in the late 6th century.\n|-\n! scope=\"row\" | The late ancient tomb of Silistra\n|\n| Silistra Province\n| 1984\n| i, iii (cultural)\n| This Roman tomb, dating to the 4th century CE, is located in the town of Silistra. It is a rare well-preserved example of late ancient painting, with walls entirely covered in murals in the fresco-secco technique. A frieze running along the walls of the tomb contains 11 panels featuring the portraits of male and female slaves bringing various gifts and garments to the masters.\n|-\n! scope=\"row\" | The Bachkovo Monastery\n|\n| Plovdiv Province\n| 1984\n| i, iv, vi (cultural)\n| The monastery was founded in the 11th century and is one of the oldest monasteries in the Balkans. It represents a unique combination of three cultures during the Middle Ages: Bulgarian, Byzantine, and Georgian. The ossuary remains from the original monastery, while the Church of the Holy Archangels was constructed between the 12th and 14th centuries and the reflectory in the 17th century. Several murals have been preserved in the monastery, from different periods.\n|-\n! scope=\"row\" | The town of Melnik and the Rozhen Monastery\n|\n| Blagoevgrad Province\n| 1984\n| i, iv (cultural)\n| This nomination comprises the medieval town of Melnik, the fortress above it, and the nearby monastery. They are located in a setting surrounded by natural sand pyramids. The monastery was founded in the Middle Ages and has preserved portions built from the 16th to the 19th centuries, with murals and wooden altars.\n|-\n! scope=\"row\" | The Roussensky Lom National Park\n|\n| Ruse Province\n| 1984\n| (natural)\n| The canyon of the Rusenski Lom river is home to several bird species, such as the saker falcon, Egyptian vulture, golden eagle, and long-legged buzzard.\n|-\n! scope=\"row\" | The Ancient Plovdiv\n|\n| Plovdiv Province\n| 2004\n| ii, iv, vi (cultural)\n| The city of Plovdiv is located on an important corridor crossing the Balkans. The site has been inhabited since prehistory. Among the city's monuments, there are a Roman theatre (pictured) and stadium from classical antiquity, remains from the medieval period, houses in the Ottoman style, and buildings in the style of the Bulgarian National Revival.\n|-\n! scope=\"row\" | Thracian Tomb with Wall Paintings beside Alexandrovo village\n|\n| Haskovo Province\n| 2004\n| i, ii, iii (cultural)\n| The Thracian tomb, near the Aleksandrovo village, was constructed in the second half of the 4th century BCE. Both the antechamber and main chamber are decorated with well-preserved frescos. The scenes depict boar and deer hunting.\n|-\n! scope=\"row\" | Vratsa Karst Nature Reserve\n|\n| Vratsa Province\n| 2011\n| vii, viii, ix, x (natural)\n| The reserve, situated in the western part of the Balkan Mountains, features several karst formations, such as sinkholes, gorges, and caves. The cliffs of the Vratsata Gorge reach  high. The area is also an important spot for biodiversity, with Mediterranean and sub-Mediterranean plant species growing on limestone terrain, far from the Mediterranean basin borders.\n|-\n! scope=\"row\" | Rocks of Belogradchik\n|\n| Vidin Province\n| 2011\n| vii, viii (natural)\n| This nomination comprises sandy and calcareous rock formations near the town of Belogradchik. Some of the formations are over  tall. They come in different shapes that people have likened to human figures or animals.\n|-\n! scope=\"row\" | Central Balkan National Park\n|\n| Lovech, Gabrovo, Sofia, Plovdiv, and Stara Zagora provinces\n| 2011\n| vii, viii, ix, x (natural)\n| The national park covers a  stretch of the Balkan Mountains. It comprises a variety of habitats, including forests, meadows, mountain pastures, and rocky peaks up to  high. The area contains several primeval European beech (Fagus sylvatica) forests and is home to several endemic plant species.\n|-\n! scope=\"row\" | Pobiti Kamani Natural Monument\n|\n| Varna Province\n| 2011\n| vii, viii (natural)\n| This nomination comprises several groups of calcareous rock formations, created by the erosion processes from the Eocene sediments. They are located along the Black Sea coast in a desert-like landscape. A theory proposes that some of the structures were formed around natural methane seeps.\n|-\n! scope=\"row\" | The royal necropolis of the Thracian city of Seuthopolis – a serial site, extension of the Kazanlak Thracian tomb\n|\n| Stara Zagora Province\n| 2016\n| i, ii, iii, iv (cultural)\n| This nomination represents an extension to the existing World Heritage Site Thracian Tomb of Kazanlak. Eight tombs are listed in the nomination. They are part of a necropolis located near the ancient Thracian city Seuthopolis, the capital of king Seuthes III. They date to the 4th and 3rd centuries BCE and display a mixture of Thracian and Hellenistic influences. The Thracian tomb Golyama Arsenalka is pictured.\n|-\n! scope=\"row\" | Bishop's Basilica and Late-Antique Mosaics of Philippopolis, Roman Province of Thrace\n|\n| Plovdiv Province\n| 2018\n| ii, iii, iv, vi (cultural)\n| The basilica and two other buildings in this nomination, dating from the 2nd to the 6th century, were located in the city of Philippopolis (today's Plovdiv), an important city of the Roman Empire. The floor mosaics in the basilica, that have been uncovered from the 1980s on, represent some of the largest collections of early Christian mosaics preserved in situ.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\" | Frontiers of the Roman Empire – The Danube Limes (Bulgaria)\n|\n| several sites\n| 2020\n| ii, iii, iv (cultural)\n| This is a transnational nomination covering sites with Roman fortifications along the Danube river. The ruins at Ratiaria are pictured.\n|-\n|}\nReferences\nExternal links"
    }
  ]
}