{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1892\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1892.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland).  For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign. Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\". Acts passed from 1963 onwards are simply cited by calendar year and chapter number.\nAll modern acts have a short title, e.g. the Local Government Act 2003. Some earlier acts also have a short title given to them by later acts, such as by the Short Titles Act 1896.\n55 & 56 Vict.\nThe seventh session of the 24th Parliament of the United Kingdom, which met from 9 February 1892 until 28 June 1892.\nPublic general acts\n|\n|\n|  }}\n|\n|\n|\n|\n| |note4= }}\n|  }}\n|  }}\n|\n|  }}\n| |note4= }}\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|  as to Scotland.}}\n|  }}\n|  in relation to its application to Scotland, and to apply that Act to the Isle of Man and to the Channel Islands.|note4= }}\n|  }}\n|  }}\n|\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|  so far as regards the mode of transfer of Stock to which that Act applies.|note4= }}\n|  }}\n|  }}\n|\n|  }}\n|  to Employments of Profit under the Government of India.}}\n|\n|\n|\n|  }}\n|\n|  }}\n|  }}\n|\n|  }}\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|  with respect to Contributions for Technical Instruction in Scotland.}}\n|\n|\n}}\nLocal acts\nand to enable the South Yorkshire Junction Railway Company to raise further money and for other purposes.}}\n|\n|  }}\n|\n|  }}\n|  and 1878.|note4= }}\n|  and 1880; and for other purposes. |note4= }}\n|  }}\n|\n|  and for other purposes.|note4= }}\n|  }}\n|  }}\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|\n|  and the Dundee Suburban Railway Act 1889 and for other purposes.}}\n|\n|\n|  relating to the Pilotage District of Swansea.|po1=Swansea Pilotage Order 1892|Order for exempting Masters and Owners of all Vessels inward bound to Swansea Harbour from Compulsory Pilotage.}}\n|  relating to the Town of Larne.|po1=Larne (Town) Provisional Order 1892|Town of Larne. Provisional Order.}}\n|  relating to Birchington, Colwyn Bay, Llandudno, Penarth, and Plymouth.|po1=Birchington-on-Sea Pier Order 1892|Order for the Construction, Maintenance, and Regulation of a Pier and Esplanade at Birchington-on-Sea, in the County of Kent.\n|po2=Colwyn Bay Pier Order 1892|Order for the Construction and Maintenance of a Pier and Works at Llandrillo yn Rhôs, near Colwyn Bay, in the County of Denbigh.\n|po3=Llandudno Pier Order 1892|Order for altering certain of the Rates or Tolls taken at the Llandudno Pier and Landing Stage.\n|po4=Penarth Promenade and Pier Order 1892|Order for the Construction, Maintenance, and Regulation of a Pier at Penarth in the County of Glamorgan.\n|po5=Plymouth (Phœnix Wharf) Pier Order 1892|Order for the Construction of a Pier and other Works at Phœnix Wharf, in the Borough of Plymouth, in the County of Devon.}}\n|\n|\n| |po1=Govan Electric Lighting Order 1882|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 to 1890 to the Commissioners of Police of the Burgh of Govan in respect of the Burgh of Govan.}}\n|  and 1888, relating to Aberystwyth, Ashton-under-Lyne Halifax, Harwich, Limerick, and Maidstone.|po1=Aberystwyth Electric Lighting Order 1892|Provisional Order granted by the Board of Trade, under the Electric Lighting Acts 1882, and 1888, to the Mayor, Aldermen, and Burgesses of the Borough of Aberystwyth, in the County of Cardigan.\n|po2=Ashton-under-Lyne (Corporation) Electric Lighting Order 1892|Provisional Order granted by the Board of Trade, under the Electric Lighting Acts 1882, and 1888, to the Mayor, Aldermen, and Burgesses of the Borough of Ashton-under-Lyne, in the County of Lancaster.\n|po3=Halifax Corporation Electric Lighting Order 1892|Provisional Order granted by the Board of Trade, under the Electric Lighting Acts 1882, and 1888, to the Mayor, Aldermen, and Burgesses of the County Borough of Halifax.\n|po4=Harwich (Corporation) Electric Lighting Order 1892|Provisional Order granted by the Board of Trade, under the Electric Lighting Acts 1882, and 1888, to the Mayor, Aldermen, and Burgesses of the Borough of Harwich, in the County of Essex.\n|po5=Limerick Electric Lighting Order 1892|Provisional Order granted by the Board of Trade, under the Electric Lighting Acts 1882, and 1888, to the Mayor, Aldermen, and Burgesses of the Borough of Limerick.\n|po6=Maidstone Electric Lighting Order 1892|Provisional Order granted by the Board of Trade, under the Electric Lighting Acts 1882, and 1888, to the Mayor, Aldermen, and Burgesses of the Borough of Maidstone, in the County of Kent.}}\n|  and 1888, relating to Kilkenny, Newbury, Sutton (Surrey), West Ham, and Woking (Horsell and Chertsey).|po1=Kilkenny Electric Lighting Order 1892|Provisional Order granted by the Board of Trade, under the Electric Lighting Acts 1882, and 1888, to the Mayor, Aldermen, and Burgesses of the Municipal Borough of Kilkenny.\n|po2=Newbury Electric Lighting Order 1892|Provisional Order granted by the Board of Trade, under the Electric Lighting Acts 1882, and 1888, to the Mayor, Aldermen, and Burgesses of the Borough of Newbury.\n|po3=Sutton (Surrey) Electric Lighting Order 1892|Provisional Order granted by the Board of Trade, under the Electric Lighting Acts 1882, and 1888, to the Sutton (Surrey) Local Board.\n|po4=West Ham (Corporation) Electric Lighting Order 1892|Provisional Order granted by the Board of Trade, under the Electric Lighting Acts 1882, and 1888, to the Mayor, Aldermen, and Burgesses of the County Borough of West Ham.\n|po5=Woking Electric Supply Co. Electric Lighting (Horsell and Chertsey) Order 1892|Provisional Order granted by the Board of Trade, under the Electric Lighting Acts 1882, and 1888, to the Woking Electric Supply Company, Limited.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Abbotsbury Railway Company, and certain other Railway Companies |po1=Railway Rates and Charges, No. 1 (Abbotsbury Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of —(1.) The Railways belonging to the following Railway Companies whose lines are leased or worked by the Great Western Railway Company, viz., the Abbotsbury Railway Company; Abingdon Railway Company; Bala and Festiniog Railway Company; Banbury and Cheltenham Direct Railway Company; Bridport Railway Company; Buckfastleigh, Totnes, and South Devon Railway Company; Calne Railway Company; Cornwall Minerals Railway Company; Corwen and Bala Railway Company; Devon and Somerset Railway Company; Didcot, Newbury, and Southampton Railway Company; Ely Valley Railway Company; Great Marlow Railway Company; Helston Railway Company; Kington and Eardisley Railway Company; Leominster and Kington Railway Company; Llangollen and Corwen Railway Company; Marlborough Railway Company; Milford Railway Company; Minehead Railway Company; Much Wenlock and Severn Junction Railway Company; Nantwich and Market Drayton Railway Company; Newent Railway Company; Oldbury Railway Company; Princetown Railway Company; Ross and Ledbury Railway Company; Ross and Monmouth Railway Company; Staines and West Drayton Railway Company; Teign Valley Railway Company; Tiverton and North Devon Railway Company; Vale of Llangollen Railway Company; Wellington and Severn Junction Railway Company; Wenlock Railway Company; West Somerset Railway Company; Woodstock Railway Company; Wye Valley Railway Company.(2.) The Railways belonging to the following Railway Companies whose lines are leased or worked by the London and North-Western and Great Western Railway Companies, viz., the Ludlow and Clee Hill Railway Company; Vale of Towy Railway Company.(3.) The following Railways which are owned, leased, or worked by the London and North-Western and Great Western Railway Companies, viz., the Shrewsbury and Hereford Railway; Shrewsbury and Wellington Railway; Shrewsbury and Welshpool Railway; Tenbury Railway.(4.) The following Railway which are owned, leased, or worked by the Midland Railway Company and the Great Western Railway Company, viz., the Clifton Extension Railway.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Brecon and Merthyr Tydfil Junction Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 2 (Brecon and Merthyr Tydfil Junction Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Brecon and Merthyr Tydfil Junction Railway Company, the Llanelly and Mynydd Mawr Railway Company, the Pontypridd, Caerphilly, and Newport Railway Company, the Ravenglass and Eskdale Railway Company, the West Lancashire Railway Company, and the Wrexham, Mold, and Connah's Quay Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Cambrian Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 3 (Cambrian Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Cambrian Railway Company; Bishop's Castle Railway Company; Buckley Railway Company; Exmouth Docks and Railway Company; Mawddwy Railway Company; Mid-Wales Railway Company; South Wales Mineral Railway Company; Van Railway Company; and West Somerset Mineral Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Cleator and Workington Junction Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 4 (Cleator and Workington Junction Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Cleator and Workington Junction Railway Company; Cockermouth, Keswick, and Penrith Railway Company; Corris Railway Company; Maryport and Carlisle Railway Company; Pembroke and Tenby Railway Company; Rowrah and Kelton Fell Railway Company; Severn and Wye and Severn Bridge Railway Company; and Southwold Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the East London Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 5 (East London Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the East London Railway Company, the Hounslow and Metropolitan Railway Company, the Metropolitan District Railway Company, the North and South Western Junction Railway Company, the West London Railway Company, the West London Extension Railway Company, and certain other Railway Companies connected therewith.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Festiniog Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 6 (Festiniog Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Festiniog Railway Company, the Gorsedda Junction and Portmadoc Railway Company, the North Wales Narrow Gauge Railway Company, and the Portmadoc, Croesor, and Beddgelert Tram Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Furness Railway Company and the London and North Western and Furness Railway Companies' Joint Railways.|po1=Railway Rates and Charges, No. 7 (Furness Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Furness Railway Company and the London and North Western and Furness Railway Companies' Joint Railways.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Hull, Barnsley, and West Riding Junction Railway Company.|po1=Railway Rates and Charges, No. 8 (Hull, Barnsley and West Riding Junction Railway) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the classification of merchandise traffic and the schedule of maximum rates and charges, including all terminal charges applicable to the said classification of the Hull, Barnsley, and West Riding Junction Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Isle of Wight Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 9 (Isle of Wight Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the classification of merchandise traffic and the schedule of maximum rates and charges, including all terminal charges applicable to the said classification of the Isle of Wight Railway Company; Isle of Wight Central Railway Company; Brading Harbour Improvement Railway and Works Company; and Freshwater, Yarmouth, and Newport Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Lancashire and Yorkshire Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 10 (Lancashire and Yorkshire Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the classification of merchandise traffic and the schedule of maximum rates and charges, including all terminal charges applicable to the said classification of the Lancashire and Yorkshire Railway Company, and certain other Railway Companies connected therewith.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the London, Tilbury, and Southend Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 11 (London, Tilbury and Southend Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the London Tilbury and Southend Railway Company, Burry Port and Gwendraeth Valley Railway Company, Colne Valley and Halstead Railway Company, East and West Junction Railway Company, Eastern and Midlands Railway Company, Evesham Redditch and Stratford-on-Avon Railway Company, Felixstow Railway and Dock Company, Gwendraeth Valley Railway Company, King's Lynn Docks and Railway Company, Mellis and Eye Railway Company, Northampton and Banbury Junction Railway Company, Ramsey and Somersham Junction Railway Company, Tottenham and Hampstead Junction Railway Company, and the Wivenhoe and Brightlingsea Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Manchester, Sheffield, and Lincolnshire Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 12 (Manchester, Sheffield and Lincolnshire Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Manchester, Sheffield and Lincolnshire Railway Company, the Liverpool, Southport, and Preston Junction Railway, and the Macclesfield Committee, and certain other Railway Companies connected therewith.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Metropolitan Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 13 (Metropolitan Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Metropolitan Railway Company, and certain other Railway Companies connected therewith.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Midland and South Western Junction Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 14 (Midland and South Western Junction Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the classification of merchandise traffic and the schedule of maximum rates and charges, including all terminal charges applicable to the said Classification of the Midland and South Western Junction Railway Company, Golden Valley Railway Company, Liskeard and Caradon Railway Company, Liskeard and Looe Union Canal Company, Manchester and Milford Railway Company, Neath and Brecon Railway Company, Redruth and Chasewater Railway Company, Snailbeach District Railway Company, Talyllyn Railway Company, and Wirral Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the North Eastern Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 15 (North Eastern Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the classification of merchandise traffic and the schedule of maximum rates and charges, including all terminal charges applicable to the said Classification of the Forcett Railway Company, the Great North of England, Clarence, and Hartlepool Junction Railway Company, the Scarborough, Bridlington, and West Riding Junction Railways Company, the Scarborough and Whitby Railway Company, and the Marquis of Londonderry in respect of the Londonderry (Seaham to Sunderland) Railway.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the North London Railway Company.|po1=Railway Rates and Charges, No. 16 (North London) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the classification of merchandise traffic and the schedule of maximum rates and charges, including all terminal charges applicable to the said classification of the North London Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the North Staffordshire Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 17 (North Staffordshire Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the classification of merchandise traffic and the schedule of maximum rates and charges, including all terminal charges applicable to the said classification of the North Staffordshire Railway Company, and certain other railway companies connected therewith.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Taff Vale Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 18 (Taff Vale Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Taff Vale Railway Company, the Aberdare Railway Company, the Alexandra (Newport and South Wales) Docks and Railway Company, the Barry Railway Company, the Great Western Railway Company and the Rhymney Railway Company Joint Railways, the Great Western Railway Company and Taff Vale Railway Company Joint Railway, the Mersey Railway Company, the Penarth Extension Railway Company, the Penarth Harbour, Dock, and Railway Company, the Rhondda and Swansea Bay Railway Company, and the Rhymney Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Caledonian Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 19 (Caledonian Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Caledonian Railway Company, and certain other Railway Companies connected therewith.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Callander and Oban Railway Company.|po1=Railway Rates and Charges, No. 20 (Callander and Oban Railway) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Callander and Oban Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Bates and Charges applicable thereto, of the City of Glasgow Union Railway Company.|po1=Railway Rates and Charges, No. 21 (City of Glasgow Union Railway) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the City of Glasgow Union Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Glasgow and South Western Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 22 (Glasgow and South Western Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Glasgow and South Western Railway Company, and certain other Railway Companies connected therewith.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Great North of Scotland Railway Company.|po1=Railway Rates and Charges, No. 23 (Great North of Scotland Railway) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Great North of Scotland Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Highland Railway Company.|po1=Railway Rates and Charges, No. 24 (Highland Railway) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Highland Railway Company.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the North British Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 25 (North British Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the North British Railway Company, and certain other Railway Companies connected therewith.}}\n|  containing the Classification of Merchandise Traffic, and the Schedule of Maximum Rates and Charges applicable thereto, of the Athenry and Ennis Junction Railway Company, and certain other Railway Companies.|po1=Railway Rates and Charges, No. 26 (Athenry and Ennis Junction Railway, &c.) Order 1892|Order of the Board of Trade under the Railway and Canal Traffic Act, 1888, embodying the Classification of Merchandise Traffic and the Schedule of Maximum Rates and Charges, including all Terminal Charges applicable to the said Classification of the Athenry and Ennis Junction Railway Company; Atherny and Tuam Railway Company; Ballinascarthy and Timoleague Junction Light Railway Company; Ballinrobe and Claremorris Railway Company; Ballycastle Railway Company; Baltimore Extension Railway Company; Belfast and County Down Railway Company; Belfast and Northern Counties Railway Company; Bessbrook and Newry Tramway Company; Castlederg and Victoria Bridge Tramway Company; Cavan, Leitrim, and Roscommon Light Railway and Tramway Company; Clara and Banagher Railway Company; Claremorris and Collooney Railway Company; Clonakilty Extension Railway Company; Clogher Valley Tramway Company; Cork and Macroom Direct Railway Company; Cork and Muskerry Light Railway Company; Cork, Bandon, and South Coast Railway Company; Cork, Blackrock, and Passage Railway Company; Derry Central Railway Company; Downpatrick, Killough, and Ardglass Railway Company; Draperstown Railway Company; Dublin and Kingstown Railway Company; Dublin and Lucan Steam Tramway Company; Dublin, Wicklow, and Wexford Railway Company; Dundalk, Newry, and Greenore Railway Company; Great Northern Railway (Ireland) Company; Great Southern and Western Railway Company; Ilen Valley Railway Company; Kanturk and Newmarket Railway Company; Kilkenny Junction Railway Company; Letterkenny Railway Company; Limavady and Dungiven Railway Company; Limerick and Kerry Railway Company; Listowel and Ballybunion Railway Company; London and North-Western Railway Company (Irish Lines); Londonderry and Lough Swilly Railway Company; Loughrea and Attymon Light Railway Company; Midland Great Western Railway of Ireland Company; Rathkeale and Newcastle Junction Railway Company; Sligo, Leitrim, and Northern Counties Railway Company; Southern Railway Company; Timoleague and Courtmacsherry Extension Light Railway Company; Tralee and Dingle Light Railway or Tramway Company; Tralee and Fenit Railway Company; Tuam and Claremorris Railway Company; Waterford and Central Ireland Railway Company; Waterford and Limerick Railway Company; Waterford and Tramore Railway Company; Waterford and Wexford Railway Company; Wateford, Dungarvan, and Lismore Railway Company; West Carbery Tramways and Light Railways Company; West Clare Railway Company; West Donegal Railway Company; the Cork, Bandon, and South Coast Railway Company in respect of the extension to Bantry Bay; the Great Southern and Western Railway Company in respect of the Headford and Kenmare Railway, and the West Kerry (Killorglin and Valentia) Railway; and the Midland Great Western Railway of Ireland Company in respect of the Ballina to Killala Railway, the Galway to Clifden Railway, and the Westport to Mallarany Railway, and any extension railway to Achill.}}\n|  relating to Milnathort Water.|po1=Milnathort Water Order 1892|Milnathort Water Supply. Provisional Order.}}\n|  relating to Cullingworth Gas, Kempston Gas, Mitcham and Wimbledon District Gas, South Normanton and Blackwell Gas, and Sutton and Hooton District Gas.|po1=Cullingworth Gas Order 1892|Order empowering the Cullingworth Gas Company, Limited, to maintain and continue gasworks and to manufacture and supply gas in the township and parish of Bingley and the township of Wilsden, in the parish of Bradford, all in the West Riding of the county of York.\n|po2=Kempston Gas Order 1892|Order empowering the Kempston Gas Company, Limited, to maintain and continue gasworks and to manufacture and supply gas in the several parishes of Kempston, Elstow, and Wooton, all in the county of Bedford.\n|po3=Mitcham and Wimbledon District Gas Order 1892|Order empowering the Mitcham and Wimbledon District Gaslight Company to construct and maintain additional works.\n|po4=South Normanton and Blackwell Gas Order 1892|Order empowering the South Normanton, Blackwell, and Hucnkness-under-Huthwaite Gas Company, Limited, to maintain and continue gasworks and to manufacture and supply gas within the parish of Blackwell and parts of the parishes of South Normanton and Tibshelf, all in the county of Derby.\n|po5=Sutton and Hooton District Gas Order 1892|Order empowering the Sutton and Hooton Gas Company, Limited, to maintain and continue gasworks and to manufacture and supply gas in the townships of Willaston, Hooton, Childer, Thornton, Great Sutton, Little Sutton, Ledsham, and Capenhurst, all in the county of Chester.}}\n|  relating to Canna, Fleetwood, Mevagissey, and Newlyn.|po1=Canna Pier Order 1892|Order for the Construction, Mointenance, and Regulation of a Pier at Rudha Carr-Innis, in Canna Harbour, in the Parish of Small Isles and County of Inverness.\n|po2=Fleetwood Pier Order 1892|Order for the Construction, Maintenance, and Regulation of a Pier at Fleetwood in the County of Lancaster.\n|po3=Mevagissey Harbour Order 1892|Order for amending the Mevagissey Harbour Orders, 1865 and 1886.\n|po4=Newlyn Pier and Harbour Order 1892|Order for extending the time for construction of the Works authorised by the Newlyn Pier and Harbour Order, 1886, and for conferring additional powers on the Newlyn Pier and Harbour Commissioners.}}\n|\n|\n|\n|\n|\n|  Delating to Bathgate Water.|po1=Bathgate (Linlithgowshire) Water Supply Order 1892|County Council of Linlithgow (Bathgate District) Water Supply. Provisional Order.}}\n|  relating to the Parish of Abson-with-Wick, in the Rural Sanitary District of the Chipping Sodbury Union.|po1=Chipping Sodbury Union Order 1892|Chipping Sodbury Union. Provisional Order.}}\n|  relating to the towns of Dundalk and Bangor.|po1=Dundalk Burial Ground Provisional Order 1892|Dundalk Burial Ground. Provisional Order.\n|po2=Bangor Waterworks Provisional Order 1892|Bangor Additional Waterworks. Provisional Order.}}\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|\n|  }}\n|  }}\n|\n|\n|\n|\n|\n|  relating to the Enrolment of Memorials of the names of Members of the Society and Office in the High Court of Chancery and to provide for the keeping of a register in lieu thereof and for other purposes.}}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|\n|\n|\n|\n|\n|\n|  and by the West Highland Railway Act 1889 to extend the time limited by those Acts for the completion of the Railways thereby authorised to authorise the North British Railway Company to increase their subscription to the West Highland Railway Company and to subscribe to the Kirkcaldy and District Railway Company to raise additional Capital to authorise the repayment of the Eyemouth Railway Deposit Fund and for other purposes.}}\n|\n|\n|  }}\n| |note4= }}\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|  a new Pump Room and to hold and maintain the same and for conferring powers on the Board in relation to the Local Government of the District and for other purposes.|note4= }}\n|\n|\n|  incorporating the Stamford and Saint Martin's Stamford Baron Gas Light and Coke Company and for extending the limits of supply and defining and regulating the capital and powers of that company and for authorising the company to extend their works and to raise further capital and for other purposes}}\n|  and for reviving the powers granted by that Act for the compulsory purchase of lands and for further extending the period for the completion of the works thereby authorised.}}\n|\n|\n|  }}\n|\n|  and for constituting that Railway a separate undertaking and for other purposes.}}\n|  }}\n|\n|\n|\n|  with respect to the construction of the Tramways thereby authorised and to authorise the Weston-super-Mare Clevedon and Portishead Tramways Company to construct additional Tramroads and for other purposes.}}\n|  }}\n|\n|\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|\n|\n|  }}\n|\n|  }}\n|  and for other purposes.|note4= }}\n|\n|\n|\n|\n|  to authorise the construction of a Wet Dock and other Harbour Work* and for other purposes.|note4= }}\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|\n|\n|  }}\n|\n| |note4= }}\n|  relating to Birmingham and Western Districts Tramways, Drypool and Marfleet Steam Tramways, Morecambe Tramways (Extension), and Northampton Street Tramways.|po1=Birmingham and Western Districts Tramways (Abandonment) Order 1892|\n|po2=Drypool and Marfleet Steam Tramways Order 1892|\n|po3=Morecambe Tramways (Extension) Order 1892|\n|po4=Northampton Street Tramways Order 1892|}}\n|\n|  relating to Bideford Gas, Glastonbury and Street Gas, Prestatyn Gas, and Willenhall Gas.|po1=Bideford Gas Order 1892|\n|po2=Glastonbury and Street Gas Order 1892|\n|po3=Prestatyn Gas Order 1892|\n|po4=Willenhall Gas Order 1892|}}\n|\n|\n|\n|\n|\n|\n|  relating to the Hundred of Mutford and Lothiogland.|po1=Hundred of Mutford and Lothingland (Suffolk) Order 1892|}}\n|  relating to Killala, Stornoway, Sutherland, and Torquay.|po1=Killala Pier Order 1892|\n|po2=Stornoway Harbour Order 1892|\n|po2=Sutherland (Talmin, Skerray and Portskerra) Harbours Order 1892|\n|po2=Torquay Harbour Order 1892|}}\n|  relating to Carloway and Kinsale.|po1=Carloway Harbour Order 1892|\n|po2=Kinsale Harbour Order 1892|}}\n|  relating to Bournemouth.|po1=Bournemouth Pier Order 1892|}}\n|  relating to Morton Fen, in the Parish of Morton, in the County of Lincoln.|note4=|po1=|po1short=n|}}\n|  relating to lands in the Parishes of St. Marylebone, St. Mary Abbotts, Kensington, and All Saints, Poplar.|note4=|po1=|po1short=n|}}\n|  relating to the Purchase of Land for Burial Grounds in the Poor Law Union of Sligo.|po1=Tawnagh Burial Ground Provisional Order 1892|\n|po2=Ballynakill Burial Ground Provisional Order 1892|}}\n|  relating to the City of Belfast.|po1=Belfast Order 1892|}}\n|  relating to the improvement of Streets in the Township of Blackrock.|po1=Blackrock Provisional Order 1892|}}\n|  relating to the purchase of Land for Waterworks in the Poor Law Union of Tullamore.|po1=Tullamore Waterworks Provisional Order 1892|}}\n|  relating to the Rural Sanitary District of Fermoy.|po1=Kilworth Waterworks Provisional Order 1892|}}\n|  relating to the Purchase of Lands for Waterworks for the towns of Athlone, Castletown-Berehaven, Cookstown, and Skibbereen.|po1=Athlone Waterworks Provisional Order 1892|\n|po2=Castletown-Berehaven Waterworks Provisional Order 1892|\n|po3=Cookstown Waterworks Provisional Order 1892|\n|po4=Skibbereen Waterworks Provisional Order 1892|}}\n|  relating to the Town of Tralee.|po1=Tralee Provisional Order 1892|}}\n|  relating to the Drainage of the City of Dublin, and to enable the Corporation of Dublin to borrow in excess of their Statutory Powers.|po1=Dublin Main Drainage Provisional Order 1892|}}\n|  }}\n|  to enable the School Board for London to put in force the Lands Clauses Consolidation Act, 1845, and the Acts amending the same.|po1=School Board for London Order 1892|}}\n|  and 1888, relating to Dublin, Fareham, Liverpool, Oxford, Sheffield, and Waterford.|po1=Dublin Electric Lighting Order 1892|\n|po2=Fareham Electric Lighting Order 1892|\n|po2=Liverpool Electric Lighting Order 1892|\n|po2=Sheffield Electric Lighting Order 1892|\n|po2=Waterford Electric Lighting Order 1892|}}\n|  and 1888, relating to Hampstead, Lambeth, Shoreditch, and Whitechapel.|po1=Hampstead (London) Electric Lighting Order 1892|\n|po2=Lambeth Electric Lighting Order 1892|\n|po3=Shoreditch Electric Lighting Order 1892|\n|po4=Whitechapel District Electric Lighting Order 1892|}}\n|  relating to the Burgh of Inverness.|po1=Inverness Order 1892|}}\n|\n|\n|\n| |po1=|po1short=n}}\n|  relating to Ross Water and Sevenoaks Water.|po1=Ross Water Order 1892|\n|po2=Sevenoaks Water Order 1892|}}\n|  and 1888, relating to the County of London (a portion of), Southwark, and Wandsworth.|po1=County of London (North) Electric Lighting Order 1892|\n|po2=Southwark Electric Lighting Order 1892|\n|po3=Wandsworth Electric Lighting Order 1892|}}\n|  }}\n|\n|  relating thereto and to define the objects and powers of that Company.}}\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|\n|  }}\n|\n|\n|\n}}\nPrivate act\n}}\nSources\n*\nSee also\n*List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}