{
  "content": [
    {
      "type": "text",
      "text": "# List of World War II military service football teams\n\nThis List of World War II military service football teams includes all those top-level American football teams consisting of active duty military personnel of the United States Armed Forces that played against collegiate or professional opponents during the seasons of 1942, 1943, 1944, or 1945.\nBackground\nDuring the years of World War II the American military saw a rapid expansion of its system of military bases as the number of young men skyrocketed through enlistment and conscription. Many of these included former collegiate and professional stars of the football gridiron. Nineteen active or former players of the National Football League died in the American war effort, in addition to an uncounted number of former collegians.\nEarly in the war effort one football writer said about the applicability of the formation of football teams with military training:\nFootball is a body-toughener. Football lights the fighting spark in fighting men. It develops aggressiveness, teamwork, stamina, physical and mental coordination under active stress, and therefore it holds a foremost place in our national wartime training program. Teams by the hundreds are in formation at various Army camps and posts and Navy bases. The greatest participation in the history of the sport will be entered in the records of 1942.\nBeginning in the fall of 1942, the War Department began to promote organized football exhibitions involving select teams from its military bases that played full schedules against the depleted squads of regional universities. These elite teams are included in the following list.\nThese were further distilled into military All-Star Teams which played against collegiate and professional opponents. In 1942, the U.S. Army named two \"All-Army teams\" of approximately 60 players per unit, located in the East and West. These were informally known as the \"Million Dollar teams\" — their purpose being to raise upwards of $1 million for the Army Emergency Relief fund through a series of exhibition clashes with the professional teams of the National Football League. The Eastern Army All-Star team was led by Lt. Col. Robert R. Neyland, and played September 1942 games against the New York Giants, Brooklyn Dodgers, and Chicago Bears. The Western All-Stars, coached by Major Wallace Wade of Duke University, played a slate including games beginning late in August 1942 against the Washington Redskins, Chicago Cardinals, Detroit Lions, Green Bay Packers, and Giants. By the end of the exhibition games, it had raised $241,392.29 for the fund.\nBy the time that the war had ended, various service teams had been coached by such legends as Bernie Bierman (Iowa Pre-Flight Seahawks), Paul Brown (Great Lakes Navy Bluejackets), Don Faurot (Iowa Pre-Flight Seahawks and Jacksonville Naval Air Station Fliers), Tony Hinkle (Great Lakes Navy Bluejackets), Jack Meagher (Iowa Pre-Flight Seahawks), and Joe Verducci (Alameda Coast Guard Sea Lions)—as well as the aforementioned Neyland and Wade.\nEven with the surrender of Japan on September 2, 1945, however, the times still remained uncertain to an extent with the Allied occupation forces facing possible pacification campaigns in the defeated Axis countries, not to mention increasingly strained relations with the Soviet Union. As a result, much of the American war apparatus remained intact, at least initially, during peacetime—including many service football teams.\nThe State Fair of Louisiana, which normally sponsored a series of college football games as part of its annual State Fair Classic, found itself without its regular host schools at times during the war when they were forced to drop their football programs. The locally based Barksdale Field Sky Raiders were invited to play in two of the classic's October games, one against the Selman Army Airfield Cyclones and another against the Lake Charles Army Airfield Flying Tigers; the Camp Swift Dragons ended up filling in for Lake Charles Army Airfield. The fair's \"Negro Day\" game featured Wiley College paired against the Randolph Field Brown Bombers (the African American counterpart to the Randolph Field Ramblers). Barksdale Field had also previously competed in the 1934 classic, against Texas Military College.\nEven the service academies remained strong through 1945, with Army and Navy's annual game featuring the two top teams of the 1945 AP poll and the game being declared the \"Game of the Century,\" with Pres. Harry S. Truman himself attending. Army's Doc Blanchard even won the Heisman Trophy that year.\nAfter encountering no significant resistance in the occupied countries over the subsequent year (save for a few, isolated efforts at sabotage by Edelweiss Pirates or Japanese holdouts), most American servicemen were then quickly discharged, and the service football teams essentially left with them. Truman issued Proclamation 2714 formally ending the war on December 31, 1946.\nOne noteworthy post-war game (which may have typified just how far the few remaining service teams had fallen since Iowa Pre-Flight's magical run at No. 2 in the 1943 AP poll) pitted Central State University of Ohio against the Wright Field Kittyhawks; despite it being CSU’s first season as a new four-year institution in 1947, CSU still won the game by an astonishing score of 101–0.\nList of teams\nUnited States Army teams\nTeams associated with the bases of the United States Army included:\n* Beaumont General Hospital Raiders (Texas)\n* Camp Beale Bears (California)\n* Camp Blanding Gunners (Florida)\n* Camp Cooke Engineers (California)\n* Camp Davis Fighting AA's (North Carolina)\n* Camp Detrick Army Chemists (Maryland)\n* Camp Edwards Yanks (Massachusetts)\n* Camp Ellis Cardinals (Illinois)\n* Camp Gordon Johnston Helldivers (Florida)\n* Camp Gordon Tankers (Georgia)\n* Camp Grant Warriors, (Illinois)\n* Camp Hearne Warriors (Texas)\n* Camp Kilmer Eagles (New Jersey)\n* Camp McCoy Engineers (Wisconsin)\n* Camp Lee Travellers (Virginia)\n* Camp Peary Pirates (Virginia)\n* Camp Swift Dragons (Texas)\n* Fort Benning (Georgia)\n** 124th Infantry Gators\n** 176th Infantry Spirits\n** 300th Infantry Sabers\n** Fort Benning Doughboys\n** Fourth Infantry Raiders\n** Third Infantry Cockades\n* Fort Bliss Anti-Aircraft Gunners (Texas)\n* Fort Douglas MPs / Fort Douglas GIs (Utah)\n* Fort Dupont (District of Columbia)\n* Fort Knox Tankers (Kentucky)\n* [https://onlyinark.com/sports/the-1941-arkansas-travelers-football/ Fort Lewis Washington]\n* Fort McClellan Riflemen (Alabama)\n* Fort Monmouth Signalmen (New Jersey)\n*  Fort Monroe Gunners (Virginia)\n* Fort Riley Centaurs (Kansas)\n* Fort Sheridan Miracles (Illinois)\n* Fort Totten Redlegs (New York)\n* Fort Warren Broncos (Wyoming)\n* Indiantown Gap Indians (Pennsylvania)\n* North Camp Hood Maroons (Texas)\n* South Camp Hood Doughboys (Texas)\nUnited States Army Air Forces teams\nTeams associated with the bases of the United States Army Air Forces included:\n* Air Transport Command Rockets\n* Albuquerque Army Air Base / Kirtland Field Flying Kellys\n* Amarillo Army Air Field Sky Giants\n* Barksdale Field Sky Raiders\n* Bergstrom Field Troop Carriers\n* Blackland Army Air Field Eagles\n* Bowman Field Bombers\n* Bryan Army Air Field Ducks\n* Chatham Field Blockbusters\n* Camp Pickett, Blackstone, Virginia\n* First Air Force Aces\n* Fourth Air Force Flyers\n* Dalhart Army Air Field Dominators\n* Daniel Field Fliers\n* Douglas Army Air Field Rattlers\n* Great Bend Army Air Field Gee Bees\n* Galveston Army Air Field Islanders\n* Greensboro Tech-Hawks\n* Greenville Army Air Base Jay Birds\n* Gulfport Army Air Field Bombers\n* Hondo Army Air Field Comets\n* Kearney Army Air Field Raiders\n* Kearns Field Eagles\n* Keesler Field Fliers\n* Lake Charles Army Air Field Invaders\n* Las Vegas Army Air Field Indians\n* Lincoln Army Air Field Wings\n* Lowry Field Bombers\n* Lubbock Army Air Field Fliers\n* Luke Field Mustangs\n* March Field Flyers\n* Maxwell Field Marauders, which became Eastern Flying Training Command Eagles in 1945\n* McCook Army Air Field Bombers\n* Minter Field Atomic Bombers\n* Patterson Field All-Stars\n* Personnel Distribution Command Comets\n* Pocatello Army Air Base Bombardiers\n* Randolph Field Ramblers, which became the Army Air Forces Training Command Skymasters in 1945\n:: The 1943 Randolph Field Ramblers football team played the Texas Longhorns to a 7–7 tie in the 1944 Cotton Bowl Classic played on January 1.\n:: The 1944 Randolph Field Ramblers football team finished the season 12–0 and was ranked No. 2 in the AP poll.\n* Richmond Army Air Base Thunderbyrds\n* Salt Lake Army Air Base Wings\n* Santa Ana Army Air Base Flyers\n* Second Air Force Superbombers\n:: The 1942 Second Air Force Bombers football team won the 1943 Sun Bowl, played on January 1, over the Hardin–Simmons Cowboys.\n* Selman Field Cyclones\n* South Plains Army Air Field Winged Commandoes\n* Spokane Air Service Commandos\n* Stockton Army Air Field Commandos\n* Third Air Force Gremlins\n* Tonopah Army Air Field Indians\n* Tuskegee Army Air Field Warhawks\n* Will Rogers Field Golden Eagles\n* Williams Field Fliers\n* Wright Field Kittyhawks\nUnited States Navy teams\nTeams associated with the bases of the United States Navy included:\n* Albany Navy Beach Busters\n* Atlantic City Naval Air Station Hellcats/Corsairs\n* Bainbridge Commodores\n* Bunker Hill Naval Air Station Blockbusters\n* Camp Peary Pirates\n* Corpus Christi Naval Air Station Comets\n* Del Monte Pre-Flight Navyators\n* Farragut Naval Training Station Bluejackets\n* Fleet City Bluejackets\n* Fort Pierce Amphibs\n* Georgia Pre-Flight Skycrackers\n* Great Lakes Navy Bluejackets\n:: The 1942 and 1943 Great Lakes Navy Bluejackets football teams were coached by former Butler University coach Tony Hinkle. The 1944 and 1945 Great Lakes Navy teams were coached by former Ohio State coach Paul Brown.\n* Hutchinson Naval Air Station Gobs\n* Iowa Pre-Flight Seahawks\n:: The 1942 Iowa Pre-Flight Seahawks football team was coached by former Mississippi State, Tulane, and Minnesota coach Bernie Bierman. The 1943 Iowa Pre-Flight team finished the season 9–1 and was ranked No. 2 in the AP poll; they were coached by former Missouri coach Don Faurot. The 1944 Iowa Pre-Flight team was coached by former Rice and Auburn coach Jack Meagher.\n* Jacksonville Naval Air Station Fliers\n:: The 1944 Jacksonville Naval Air Station Flyers football team was coached by former Missouri coach Don Faurot.\n* Lakehurst Naval Air Station (New Jersey)\n* Logan Navy\n* Little Creek Amphibs\n* Miami Naval Air Station\n* Miami Naval Training Center Navaltars\n* Norfolk Fleet Bluejackets\n* Norman Naval Air Station Zoomers\n* North Carolina Pre-Flight Cloudbusters\n* Oceana Naval Air Station Hellcats\n* Olathe Naval Air Station Clippers\n* Ottumwa Naval Air Station Skyers, also called the \"Sea Flyers\"\n* Pensacola Naval Air Station Goslings\n* Saint Mary's Pre-Flight Air Devils\n* Sampson Naval Training Station Bluejackets\n* San Diego Naval Training Station Bluejackets\nUnited States Marine Corps teams\n* Camp Davis Blue Brigade, Wilmington, North Carolina\n* Camp Lejeune Marines\n* Camp Pendleton Marines\n* Cherry Point Marines\n* Eagle Mountain Marines\n* El Toro Flying Marines\n* Kinston Marine Hellcats\n* Oak Grove Marine Flyers\n* Santa Barbara Marines\n* Ward Island Marines Raiders\nUnited States Coast Guard teams\nTeams associated with the bases of the United States Coast Guard included:\n* Alameda Coast Guard Sea Lions, Governors Island, California\n::The 1942, 1943, and 1944 Alameda Coast Guard Sea Lions football teams were coached by future St. Mary's and San Francisco State coach Joe Verducci.\n* Charleston Coast Guard Cutters\n* Curtis Bay Coast Guard Cutters\n* Manhattan Beach Coast Guard Depth Bombers\nSee also\n* List of American football games in Europe during World War II\nFootnotes\nFurther reading\n* John Daye, Encyclopedia of Armed Forces Football: The Complete History of the Glory Days. Haworth, New Jersey: St. Johann Press, 2014."
    }
  ]
}