{
  "content": [
    {
      "type": "text",
      "text": "# List of Union units from North Carolina in the American Civil War\n\nAs in almost all Southern states during the American Civil War, a number of units were raised to fight for the Union Army, from pro-Union citizens and former slaves. North Carolina provided four white Union Army regiments, and four black Union Army regiments. Approximately 10,000 white North Carolinians, and 5,000 black North Carolinians, joined Union Army units. Union soldiers from North Carolina included men who served in North Carolina Union regiments, men who left the state to join other Union regiments elsewhere, and Confederate Army deserters who later fought for the Union. The list of North Carolina Confederate Civil War units is shown separately.\nThe first North Carolina Union Volunteer Infantry Regiment was established in the spring of 1862, around the city of New Bern. North Carolina Union troops captured and raided cities and towns in western North Carolina, eastern Tennessee, and southwest Virginia, most notably during the Battle of Bull's Gap, Battle of Red Banks and Stoneman's 1864 and 1865 raid. The territory captured remained under Union control for the duration of the war.\nTerritory under Union control in North Carolina from the start of the war was first organized into the Department of Virginia in 1861, then the Department of North Carolina shortly after in 1862. The department played large roles in key coastal battles such as the Battle of Roanoke Island and Battle of Wilmington, securing strategic Confederate ports and what was then the state's largest city, in support of the Anaconda Plan. The XVIII Corps stationed in North Carolina, was also one of the largest in the Union Army from 1862 to 1864.\nInfantry\n*1st North Carolina Union Volunteer Infantry Regiment\n*2nd North Carolina Union Volunteer Infantry Regiment\n*1st North Carolina Union Volunteer Infantry Regiment (African Descent) – redesignated 35th United States Colored Infantry Regiment\n*2nd North Carolina Union Volunteer Infantry Regiment (African Descent) – redesignated 36th United States Colored Infantry Regiment\n*3rd North Carolina Union Volunteer Infantry Regiment (African Descent) – redesignated 37th United States Colored Infantry Regiment\nMounted Infantry\n*2nd North Carolina Union Volunteer Mounted Infantry Regiment\n*3rd North Carolina Union Volunteer Mounted Infantry Regiment\nArtillery\n*1st North Carolina Heavy Artillery Regiment (African Descent) – redesignated 14th United States Colored Artillery Regiment\nSee also\n*Lists of American Civil War Regiments by State\n*Southern Unionists\n*United States Colored Troops\nReferences\n*[http://www.civilwararchive.com/unionar.htm The Civil War Archive]"
    }
  ]
}