{
  "content": [
    {
      "type": "text",
      "text": "# List of awards and nominations received by True Detective\n\n}}\nTrue Detective is an American crime drama television series that premiered on January 12, 2014, on the HBO network. It was created and written by Nic Pizzolatto. Conceived as an anthology, each season will be engineered as a disparate, self-contained narrative, employing new cast ensembles and following various sets of characters and settings.\nTrue Detective was a candidate for television awards in a variety of categories recognizing its writing, acting, production, and direction. The show received eleven Primetime Emmy nominations heading into the 2014 Emmy season, scooping up five wins, among them being Outstanding Directing for a Drama Series for Cary Joji Fukunaga. At the 72nd Golden Globe Awards, the show scored three Golden Globe nominations, including Best Actor in a Miniseries or Television Film for Matthew McConaughey and Woody Harrelson and Best Supporting Actress in a Miniseries or Television Film for Michelle Monaghan. Other substantial nominations include four TCA Awards (two wins), three Satellite Awards, and a BAFTA (one win).\nMcConaughey is the most decorated of the show's actors, with ten nominations. Pizzolatto earned two Writers Guild of America Awards (WGAs) for his work as a writer for the series. To date, True Detective has been nominated for 37 awards and has won 24.\nAstra TV Awards\nThe Astra TV Awards, presented annually by the Hollywood Creative Alliance (HCA), a non-profit organization of critics, entertainment journalists, content creators, industry influencers, and creatives. True Detective has received seven nominations.\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| rowspan=\"7\"| 2024\n| Best Limited Series\n| True Detective: Night Country\n|\n| align=\"center\" rowspan=\"7\"|\n|-\n| Best Actress in a Limited Series or TV Movie\n| Jodie Foster\n|\n|-\n| rowspan=\"2\"| Best Supporting Actor in a Limited Series or TV Movie\n| Finn Bennett\n|\n|-\n| Christopher Eccleston\n|\n|-\n| Best Supporting Actress in a Limited Series or TV Movie\n| Kali Reis\n|\n|-\n| Best Directing in a Limited Series or TV Movie\n| rowspan=\"2\"| Issa López\n|\n|-\n| Best Writing in a Limited Series or TV Movie\n|\n|}\nBAFTA TV Awards\nThe British Academy Television Awards, presented annually by the British Academy of Film and Television Arts (BAFTA), recognize distinguished artistic achievement in British television. The branch of awards recognizing technical and production-based work (such as cinematography, editing, and music) are designated as British Academy Television Craft Awards. True Detective has won one award.\nBritish Academy Television Awards\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| 2015\n| rowspan=\"2\"| Best International Programme\n| Nic Pizzolatto, Cary Joji Fukunaga, Scott Stephens, and Steve Golin\n|\n| align=\"center\"|\n|-\n| 2025\n| Production Team\n|\n| align=\"center\"|\n|}\nBritish Academy Television Craft Awards\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| 2025\n| Best Sound: Fiction\n| Howard Bargroff, Stephen Griffiths, Tom Jenkins, Andy Shelley, Mark Timms, and Michele Woods\n|\n| align=\"center\"|\n|}\nBlack Reel Awards\nThe Black Reel Awards are presented by the Foundation for the Augmentation of African-Americans in Film (FAAAF) to recognize excellence of African Americans, as well as the cinematic achievements of the African diaspora, in the global film and television industry.\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| rowspan=\"2\"| 2024\n| Outstanding Television Movie or Limited Series\n| True Detective: Night Country\n|\n| rowspan=\"2\" align=center|\n|-\n| Outstanding Supporting Performance in a TV Movie/Limited Series\n| Kali Reis\n|\n|}\nCritics' Choice Television Awards\nThe Critics' Choice Television Awards is an annual accolade bestowed by the Broadcast Television Journalists Association in recognition of outstanding achievements in television, since 2011. True Detective has received one award from four nominations.\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| rowspan=\"2\"| 2014\n| Best Drama Series\n| True Detective\n|\n| align=\"center\" rowspan=\"2\"|\n|-\n| Best Actor in a Drama Series\n| Matthew McConaughey\n|\n|-\n| 2015\n| Best Actress in a Movie/Limited Series\n| Rachel McAdams\n|\n| align=\"center\"|\n|-\n| 2019\n| Best Actor in a Movie/Limited Series\n| Mahershala Ali\n|\n| align=\"center\"|\n|-\n| rowspan=\"2\"| 2025\n| Best Actress in a Limited Series or Movie Made for Television\n| Jodie Foster\n|\n| align=\"center\" rowspan=\"2\"|\n|-\n| Best Supporting Actress in a Limited Series or Movie Made for Television\n| Kali Reis\n|\n|}\nDirectors Guild of America Awards\nThe Directors Guild of America Awards are presented annually to directors to acknowledge their artistic and technical achievements in American entertainment. Winners are chosen jointly by the Directors Guild of America. True Detective has received two nominations.\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| 2014\n| rowspan=\"2\"| Outstanding Directorial Achievement in Dramatic Series\n| Cary Joji Fukunaga\n|\n| align=\"center\"|\n|-\n| 2024\n| Issa López\n|\n| align=\"center\"|\n|}\nEmmy Awards\nThe Primetime Emmy Awards are awarded annually by members of the Academy of Television Arts & Sciences for excellence and outstanding achievements in American primetime television. The branch of awards recognizing technical and production-based work (such as cinematography, editing, and music) are designated as Creative Arts Emmy Awards. True Detective has received six awards from forty-one nominations.\nPrimetime Emmy Awards\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| rowspan=\"5\"| 2014\n| Outstanding Drama Series\n| Nic Pizzolatto, Cary Joji Fukunaga, Scott Stephens,  Steve Golin, Woody Harrelson, Matthew McConaughey,  Richard Brown, and Carol Cuddy\n|\n| align=\"center\" rowspan=\"6\"|\n|-\n| rowspan=\"2\"| Outstanding Lead Actor in a Drama Series\n| Woody Harrelson\n|\n|-\n| Matthew McConaughey\n|\n|-\n| Outstanding Directing for a Drama Series\n| Cary Joji Fukunaga\n|\n|-\n| Outstanding Writing for a Drama Series\n| Nic Pizzolatto\n|\n|-\n| 2019\n| Outstanding Lead Actor in a Limited Series or Movie\n| Mahershala Ali\n|\n|-\n| rowspan=\"6\"| 2024\n| Outstanding Limited or Anthology Series\n| Issa López, Mari Jo Winkler-Ioffreda, Jodie Foster,  Barry Jenkins, Adele Romanski, Mark Ceryak,  Chris Mundy, Nic Pizzolatto, Matthew McConaughey,  Woody Harrelson, Steve Golin, Richard Brown,  Cary Joji Fukunaga, Alan Page Arriaga,  Princess Daazhraii Johnson, Cathy Tagnak Rexford,  Layla Blackman, and Sam Breckman\n|\n| align=\"center\" rowspan=\"6\"|\n|-\n| Outstanding Lead Actress in a Limited or Anthology Series or Movie\n| Jodie Foster\n|\n|-\n| Outstanding Supporting Actor in a Limited or Anthology Series or Movie\n| John Hawkes\n|\n|-\n| Outstanding Supporting Actress in a Limited or Anthology Series or Movie\n| Kali Reis\n|\n|-\n| Outstanding Directing for a Limited or Anthology Series or Movie\n| Issa López\n|\n|-\n| Outstanding Writing for a Limited or Anthology Series or Movie\n| Issa López\n|\n|}\nPrimetime Creative Arts Emmy Awards\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| rowspan=\"7\"| 2014\n| Outstanding Art Direction for a Contemporary or Fantasy Series (Single-Camera)\n| Alex DiGerlando, Mara LePere-Schloop, Tim Beach, and  Cynthia Slagter\n|\n| align=\"center\" rowspan=\"16\"|\n|-\n| Outstanding Casting for a Drama Series\n| Alexa L. Fogel, Christine Kromer, and Meagan Lewis\n|\n|-\n| Outstanding Cinematography for a Single-Camera Series\n| Adam Arkapaw\n|\n|-\n| Outstanding Main Title Design\n| Patrick Clair, Raoul Marks, and Jennifer Sofio Hall\n|\n|-\n| Outstanding Makeup for a Single-Camera Series (Non-Prosthetic)\n| Felicity Bowring, Wendy Bell, Ann Pala, Kim Perrodin, and  Linda Dowds\n|\n|-\n| Outstanding Music Composition for a Series (Original Dramatic Score)\n| T Bone Burnett\n|\n|-\n| Outstanding Single-Camera Picture Editing for a Drama Series\n| Affonso Gonçalves\n|\n|-\n| 2016\n| Outstanding Sound Mixing for a Limited Series or Movie\n| Daniel J. Leahy, Steve Pederson, Geoffrey Patterson, and  Ron Bedrosian\n|\n|-\n| rowspan=\"8\"| 2019\n| Outstanding Cinematography for a Limited Series or Movie\n| Germain McMicking\n|\n|-\n| Outstanding Hairstyling for a Limited Series or Movie\n| Brian B. Badie, Andrea Mona Bowman, and Lawrence Cornell Davis\n|\n|-\n| Outstanding Main Title Design\n| Patrick Clair, Nic Pizzolatto, Raoul Marks, Woosung Kang,  Kyle Moore, and Victor Joy\n|\n|-\n| Outstanding Makeup for a Limited Series or Movie (Non-Prosthetic)\n| John Blake, Francisco X. Perez, and Debi Young\n|\n|-\n| Outstanding Music Composition for a Limited Series, Movie or Special (Original Dramatic Score)\n| T Bone Burnett and Keefus Ciancia\n|\n|-\n| Outstanding Single-Camera Picture Editing for a Limited Series or Movie\n| Leo Trombetta\n|\n|-\n| Outstanding Sound Editing for a Limited Series, Movie, or Special\n| Mandell Winter, David Esparza, Micah Loken, Bernard Weiser,  Ryan Collins, Fernand Bos, Jason Wormer, Eryne Prine,  Sarah Monat, and Robin Harlan\n|\n|-\n| Outstanding Sound Mixing for a Limited Series or Movie\n| Tateum Kohut, Greg Orloff, Geoffrey Patterson, and Biff Dawes\n|\n|-\n| rowspan=\"13\"| 2024\n| Outstanding Casting for a Limited or Anthology Series or Movie\n| Francine Maisler, Deborah Schildt, and Alda B. Gudjónsdóttir\n|\n| align=\"center\" rowspan=\"13\"|\n|-\n| Outstanding Cinematography for a Limited or Anthology Series or Movie\n| Florian Hoffmeister\n|\n|-\n| Outstanding Contemporary Costumes for a Limited or Anthology Series or Movie\n| Alex Bovaird, Linda Gardar, Rebekka Jónsdóttir, Tina Ulee,  Giulia Moschioni, and Brian Sprouse\n|\n|-\n| Outstanding Contemporary Makeup (Non-Prosthetic)\n| Peter Swords King, Natalie Abizadeh, Kerry Skelton,  Flóra Karítas Buenaño, and Hafdís Pálsdóttir\n|\n|-\n| Outstanding Prosthetic Makeup\n| Dave Elsey, Lou Elsey, and Brian Kinney\n|\n|-\n| Outstanding Original Music and Lyrics\n| \"No Use\"   Music and Lyrics by John Hawkes\n|\n|-\n| Outstanding Music Supervision\n| Susan Jacobs\n|\n|-\n| rowspan=\"2\"| Outstanding Picture Editing for a Limited or Anthology Series or Movie\n| Matt Chessé\n|\n|-\n| Brenna Rangott\n|\n|-\n| Outstanding Production Design for a Narrative Contemporary Program (One Hour or More)\n| Daniel Taylor, Jo Riddell, and Charlotte Dirickx\n|\n|-\n| Outstanding Sound Editing for a Limited or Anthology Series, Movie or Special\n| Martín Hernández, Stephen Griffiths, Tom Jenkins, Michele Woods,  Andy Shelley, Jake Fielding, Stuart Bagshaw, Barnaby Smyth,  Rebecca Glover, and Ben Smithers\n|\n|-\n| Outstanding Sound Mixing for a Limited or Anthology Series or Movie\n| Howard Bargroff, Mark Timms, Skúli Helgi Sigurgíslason, and  Keith Partridge\n|\n|-\n| Outstanding Special Visual Effects in a Single Episode\n| Barney Curnow, Jan Guilfoyle, Eggert \"Eddi\" Ketilsson,  Simon Stanley-Clamp, Manuel Reyes Halaby, Tiago Faria,  Panos Theodoropoulos, Cale Pugh, and Tim Zaccheo\n|\n|}\nGolden Globe Awards\nAwarded since 1944, the Golden Globe Awards is an annual accolade bestowed by members of the Hollywood Foreign Press Association honoring outstanding achievements in television and film. True Detective won once and received seven nominations.\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| rowspan=\"4\"| 2014\n| Best Miniseries or Television Film\n| True Detective\n|\n| align=\"center\" rowspan=\"4\"|\n|-\n| rowspan=\"2\"| Best Actor – Miniseries or Television Film\n| Woody Harrelson\n|\n|-\n| Matthew McConaughey\n|\n|-\n| Best Supporting Actress – Series, Miniseries, or Television Film\n| Michelle Monaghan\n|\n|-\n| rowspan=\"3\"| 2024\n| Best Miniseries or Television Film\n| True Detective: Night Country\n|\n| align=\"center\" rowspan=\"3\"|\n|-\n| Best Actress – Miniseries or Television Film\n| Jodie Foster\n|\n|-\n| Best Supporting Actress – Series, Miniseries, or Television Film\n| Kali Reis\n|\n|}\nProducers Guild of America Awards\nThe Producers Guild of America Awards were created in 1990 by the Producers Guild of America to acknowledge the contributions of film and television producers in American entertainment. True Detective has been nominated once.\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| 2014\n| Norman Felton Award for Outstanding Producer of Episodic Television – Drama\n| Richard Brown, Carol Cuddy, Steve Golin, Woody Harrelson, Cary Joji Fukunaga,  Matthew McConaughey, Nic Pizzolatto, and Scott Stephens\n|\n| align=\"center\"|\n|-\n| 2019\n| rowspan=\"2\"| David L. Wolper Award for Outstanding Producer of Limited Series Television\n| Nic Pizzolatto, Scott Stephens, Daniel Sackheim, Peter Feldman, Steve Golin, and Bard Dorros\n|\n| align=\"center\"|\n|-\n| 2024\n| Issa López, Mari Jo Winkler-Ioffreda, Jodie Foster, Barry Jenkins, Adele Romanski, Mark Ceryak,  Chris Mundy, Sam Breckman, Alan Page Arriaga, Princess Daazhraii Johnson,  Cathy Tagnak Rexford, and Layla Blackman\n|\n| align=\"center\"|\n|}\nSatellite Awards\nThe Satellite Awards are the International Press Academy's annual entertainment awards, since 1997. True Detective has been nominated for four awards.\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| rowspan=\"3\"| 2014\n| Best Drama Series\n| True Detective\n|\n| align=\"center\" rowspan=\"3\"|\n|-\n| Best Actor in a Drama Series\n| Woody Harrelson\n|\n|-\n| Best Supporting Actress in a Series, Miniseries, or Television Film\n| Michelle Monaghan\n|\n|-\n| 2024\n| Best Actress in a Miniseries, Limited Series, or Motion Picture Made for Television\n| Jodie Foster\n|\n| align=\"center\"|\n|}\nScreen Actors Guild Awards\nPresented since 1995, the Screen Actors Guild Awards is an annual accolade honoring excellence and outstanding achievement in television acting. Winners are chosen by members of the Screen Actors Guild. True Detective has been nominated four times.\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| rowspan=\"2\"| 2014\n| rowspan=\"2\"| Outstanding Performance by a Male Actor in a Drama Series\n| Woody Harrelson\n|\n| align=\"center\" rowspan=\"2\"|\n|-\n| Matthew McConaughey\n|\n|-\n| 2019\n| Outstanding Performance by a Male Actor in a Miniseries or Television Movie\n| Mahershala Ali\n|\n| align=\"center\"|\n|-\n| 2024\n| Outstanding Performance by a Female Actor in a Miniseries or Television Movie\n| Jodie Foster\n|\n| align=\"center\"|\n|}\nTelevision Critics Association Awards\nThe TCA Awards are distributed by the Television Critics Association in recognition of distinguished artistic contribution in the television industry.  True Detective has won two awards from four nominations.\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| rowspan=\"4\"| 2014\n| Program of the Year\n| rowspan=\"3\"| True Detective\n|\n| align=\"center\" rowspan=\"4\"|\n|-\n| Outstanding New Program\n|\n|-\n| Outstanding Achievement in Movies, Miniseries, and Specials\n|\n|-\n| Individual Achievement in Drama\n| Matthew McConaughey\n|\n|-\n| rowspan=\"2\"| 2024\n| Outstanding Achievement in Drama\n| True Detective: Night Country\n|\n| align=\"center\" rowspan=\"2\"|\n|-\n| Individual Achievement in Drama\n| Jodie Foster\n|\n|}\nWriters Guild of America Awards\nThe Writers Guild of America Awards are presented annually to writers to acknowledge their artistic and technical achievements in American entertainment. Winners are chosen jointly by the Writers Guild of America, East and the Writers Guild of America, West. True Detective has won two awards.\n{| class=\"wikitable plainrowheaders\"\n|+\n|-\n! Year\n! Category\n! Nominee(s)\n! Result\n! Ref.\n|-\n| rowspan=\"2\"| 2014\n| Dramatic Series\n| rowspan=\"2\"| Nic Pizzolatto\n|\n| align=\"center\" rowspan=\"2\"|\n|-\n| New Series\n|\n|-\n| 2019\n| Long Form – Original\n| Alessandra DiMona, Graham Gordy, Gabriel Hobson, David Milch, and Nic Pizzolatto\n|\n| align=\"center\"|\n|-\n| 2024\n| Limited Series\n| Katrina Albright, Alan Page Arriaga, Namsi Khan, Issa López, Chris Mundy, and Wenonah Wilms\n|\n| align=\"center\"|\n|}\nReferences\nExternal links\n* List of [https://www.imdb.com/title/tt2356777/awards awards and nominations received by True Detective] at the Internet Movie Database"
    }
  ]
}