{
  "content": [
    {
      "type": "text",
      "text": "# List of awards and nominations received by Good Charlotte\n\nGood Charlotte's songs and albums have received recognition at the MTV Australia Awards, the MTV Europe Music Awards, and the MTV Video Music Awards. \"The Anthem\" is the second single from the band's second album The Young and the Hopeless. The song was awarded the \"Best Rock Video\" award from the MTV Video Music Awards Japan and the \"Peoples Choice: Favorite International Group\" award from the MuchMusic Video Awards. The band itself has received awards including \"Fave International Band\" at the Nickelodeon Australian Kids' Choice Awards, \"Best International Group\" at the NRJ Music Awards, and \"Best International Rock Act\" at the TMF Awards. As of 2020, Good Charlotte has received nine awards from twenty-one nominations.\nKerrang! Awards\nThe Kerrang! Awards is an annual awards ceremony held by Kerrang!, a British rock magazine.\n|-\n|rowspan=\"2\"| 2003 || \"Lifestyles of the Rich and Famous\" || Best Single ||\n|-\n| Good Charlotte || Best International Band ||\n|-\n| 2005 || \"The Chronicles of Life and Death\" || Best Video ||\nMTV Australia Awards\nThe MTV Australia Awards is an annual awards ceremony established in 2005 by MTV Australia.\n|-\n|rowspan=\"3\"| 2007 ||rowspan=\"3\"| \"Keep Your Hands off My Girl\" || Viewers Choice Australia ||\n|-\n| Best Group ||\n|-\n| Best Rock Video ||\nMTV Europe Music Awards\nThe MTV Europe Music Awards is an annual awards ceremony established in 1994 by MTV Europe.\n|-\n|rowspan=\"2\"| 2003 || Good Charlotte || Best Rock ||\n|-\n| Good Charlotte || Best New Act ||\n|-\n| 2004 || Good Charlotte || Best Rock ||\n|-\n| 2007 || Good Charlotte || Best Band ||\nMTV Video Music Awards\nThe MTV Video Music Awards were established in 1984 by MTV to celebrate the top music videos of the year.\n|-\n|rowspan=\"3\"| 2003 ||rowspan=\"3\"| \"Lifestyles of the Rich and Famous\" || Viewer's Choice ||\n|-\n| Best Rock Video ||\n|-\n| Best Group Video ||\n|-\n|rowspan=\"2\"| 2004 ||rowspan=\"2\"| \"Hold On\" || Best Group Video ||\n|-\n| Viewer's Choice ||\nMTV Video Music Awards Japan\nThe MTV Video Music Awards Japan was established in 2002 and is presented by MTV Japan.\n|-\n| 2004 || \"The Anthem\" || Best Rock Video ||\nMuchMusic Video Awards\nThe MuchMusic Video Awards is an annual awards ceremony presented by the Canadian music video channel MuchMusic.\n|-\n| 2003 || \"The Anthem\" || People's Choice: Favorite International Group ||\nNickelodeon Australian Kids' Choice Awards\nThe Nickelodeon Australian Kids' Choice Awards is an annual awards show which comments entertainers and is voted by children aged 12 to 19.\n|-\n| 2007 || Good Charlotte || Fave International Band ||\nNRJ Music Awards\nThe NRJ Music Awards is an annual French awards ceremony created by the NRJ radio station and the TF1 television network.\n|-\n| 2004 || Good Charlotte || Best International Group ||\nAlternative Press Music Awards\nThe Alternative Press Music Awards was an annual music awards show in the United States, founded by the music magazine Alternative Press.\n|-\n| 2016 || Good Charlotte || Classic Album Award ||\nReferences"
    }
  ]
}