{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1843\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1843.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland). For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign. Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\".\nSome of these acts have a short title. Some of these acts have never had a short title. Some of these acts have a short title given to them by later acts, such as by the Short Titles Act 1896.\n6 & 7 Vict.\nThe third session of the 14th Parliament of the United Kingdom, which met from 2 February 1843 until 24 August 1843.\nPublic general acts\n}}\n|  for relating the Vend and Delivery of Coals in the Cities of London and Westminster, and in certain Parts of the adjacent Counties.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|\n|  }}\n|  \"for taking away the Punishment of Death in certain Cases,\" for certain Offences therein specified.|note4= }}\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n| or the Annuity, Duchess of Mecklenburgh Strelitz Act 1843or '''Princess Augusta's Annuity Act 1843|public|25|27-06-1843|repealed=y|archived=n|An Act to enable Her Majesty to settle an Annuity on Her Royal Highness the Princess Augusta Caroline, eldest Daughter of His Royal Highness the Duke of Cambridge.|note4= }}\n|  }}\n|  }}\n|  }}\n| or the Canada Corn Act 1843|public|29|12-07-1843|repealed=y|archived=n|An Act for reducing the Duty on Wheat and Wheat Flour, the Produce of the Province of Canada, imported thence into the United Kingdom.|note4= }}\n|  }}\n|\n|\n|  }}\n|  }}\n|  }}\n| or the Scientific and Literary Societies Act 1843|public|36|28-07-1843|repealed=y|archived=n|An Act to exempt from County, Borough, Parochial, and other local Rates, Land and Buildings occupied by Scientific or Literary Societies.|note4= }}\n| or the Spiritual Care of Populous Parishes Act 1843|public|37|28-07-1843|maintained=y|archived=n|An Act to make better Provision for the Spiritual Care of populous Parishes.}}\n|\n|\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n| or the Limitation of Action Act 1843|public|54|10-08-1843|repealed=y|archived=n|An Act for extending to Ireland the Provisions not already in force there of an Act of the Third and Fourth Years of the Reign of the late King William the Fourth, intituled \"An Act for the Limitation of Actions and Suits relating to Real Property, and for simplifying the Remedies for trying the Eights thereto;\" and to explain and amend the said Act.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|  }}\n| or the Theatre Regulation Act 1843|public|68|22-08-1843|repealed=y|archived=n|An Act for regulating Theatres.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  and Solicitors practising in England and Wales.|note4= }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|\n|  }}\n|\n|  }}\n|\n|\n|  }}\n|  }}\n| or Lord Campbell's Libel Act|public|96|24-08-1843|maintained=y|archived=n|An Act to amend the Law respecting defamatory Words and Libel.}}\n|  }}\n|\n|  }}\n}}\nLocal acts\n|  }}\n|  }}\n|\n|\n|\n|  relating to the said Railway.}}\n|\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  relating to such Railway.|note4= }}\n|  relating to the building of the Hungerford and Lambeth Suspension Foot Bridge; and for granting further Powers to the Hungerford and Lambeth Suspension Foot Bridge Company.}}\n|  }}\n|  for better lighting with Gas the Town of Brighton, and the several Places therein mentioned, in the County of Sussex.|note4= }}\n|  }}\n|  }}\n|\n|  }}\n|\n|  relating to such Railway.}}\n| or the Northern and Eastern Railway (Newport Extension) Act 1843|local|28|31-05-1843|maintained=y|archived=n|An Act to enable the Northern and Eastern Railway Company to make an Extension of their present Railway; and to alter and amend the Acts relating to the said Railway.}}\n| |note4= }}\n|  for lighting with Gas the Town and Neighbourhood of Leeds in the Borough of Leeds in the West Riding of the County of York.|note4= }}\n|  }}\n|  incorporating the said Company, and to extend and enlarge their Powers.}}\n|  }}\n|  }}\n|  }}\n|  establishing the London Cemetery Company.}}\n|\n|\n|  }}\n|\n|  }}\n|  }}\n|\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|\n| or the Monkland Canal (Drumpeller Railway) Act 1843'''|local|63|04-07-1843|archived=n|An Act for making a Railway with other necessary Works to connect certain Coal Fields in the Parishes of Old Monkland and Bothwell in the County of Lanark with the Monkland Canal.}}\n|  }}\n|  }}\n|\n|\n|\n|  }}\n|  relating to the Maryport and Carlisle Railway.|note4= }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|\n|  }}\n|  }}\n|  for better raising and securing the Fund for the Relief of Widows and Children of Burgh and Parochial Schoolmasters in Scotland.|note4= }}\n|\n|  for the Improvement of the Navigation of the Rivers Burry, Loughor, and Lliedi, in the Counties of Carmarthen and Glamorgan, and to improve the Harbour of Llanelly in the said County of Carmarthen.}}\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  for draining and embanking certain Lands in Lough Swilly and Lough Foyle in the Counties of Donegal and Londonderry, so far as the same relates to the said Lands in Lough Foyle.}}\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|  and to facilitate the Sale of the Estates and Properties belonging to the said Company.}}\n}}\nPrivate acts\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n| |private|25|10-08-1843|maintained=y|repealed=n|archived=n|An Act for authorizing the Sale of Portion of the Real Estate devised by the Will of Richard Fox of Foxhall in the County of Longford, Esquire, deceased, and vesting the Residue thereof in Richard Maxwell Fox of Foxhall aforesaid, Esquire, his Heirs and Assigns, in Fee Simple, and for vesting certain Lands and Hereditaments of the said Richard Maxwell Fox in the Right Honourable Henry Lord Baron Farnham, in lieu thereof, to the Uses and upon the Trusts of the said Will.}}\n|\n|\n|\n|\n| |private|30|03-04-1843|repealed=n|archived=n|An Act to enable Thomas Fuller Drought Esquire and his Issue Male to take the Surname and use the Arms of Samwell, pursuant to the Will of Sir Thomas Samwell Baronet, deceased.}}\n| |private|31|03-04-1843|repealed=n|archived=n|An Act for naturalizing Dame Virginie Marie Hesketh Fleetwood, the Wife of Sir Peter Hesketh Fleetwood Baronet.}}\n| |private|32|31-05-1843|repealed=n|archived=n|An Act to enable Henry Caswall, Clerk, to exercise his Office of a Priest, and to hold any Benefice or Preferment in the United Church of England and Ireland.}}\n| |private|33|27-06-1843|repealed=n|archived=n|An Act to dissolve the Marriage of Nicholas Kendall, Esquire, with Mary Anne, his now Wife, and to enable him to marry again, and for other Purposes therein mentioned.}}\n| |private|34|27-06-1843|repealed=n|archived=n|An Act to dissolve the Marriage of William Watson, Esquire, with the Honourable Catharine Georgians, his now Wife, and to enable him to marry again, and for other Purposes therein mentioned.}}\n| |private|35|12-07-1843|repealed=n|archived=n|An Act to declare that certain Persons therein mentioned are not Children of the Most Honourable George Ferrars Marquis Townshend.}}\n| |private|36|12-07-1843|repealed=n|archived=n|An Act to dissolve the Marriage of John Todhunter with Rosa Matilda his now Wife, and to enable him to marry again; and for other Purposes therein mentioned.}}\n| |private|37|28-07-1843|repealed=n|archived=n|An Act to dissolve the Marriage of William Oliver Jackson Esquire with Georgiana Maria Jane Jackson his now Wife, and to enable him to marry again; and for other Purposes.}}\n| |private|38|10-08-1843|repealed=n|archived=n|An Act for naturalizing Carl Joachim Hambro.}}\n| |private|39|22-08-1843|repealed=n|archived=n|An Act to dissolve the Marriage of Herbert Morgan Esquire, a Lieutenant in Her Majesty's First or Royal Regiment of Dragoons, with Elizabeth Morgan his now Wife, and to enable him to marry again; and for other Purposes therein mentioned.}}\n}}\nSources\n*\n*\n*\n*\nSee also\n* List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}