{
  "content": [
    {
      "type": "text",
      "text": "# List of best-selling singles of the 1960s in the United Kingdom\n\nreleased 18 of the best-selling songs of the 1960s.|alt=Composite image of four black-and-white photographs showing the faces of the Beatles.]]\nA single is a type of music release defined by the British Official Charts Company (OCC) as having no more than four tracks and not lasting longer than 25 minutes. On 31 May 2010, a retrospective record chart was broadcast on BBC Radio 2 that listed the 60 biggest-selling singles in the United Kingdom during the 1960s. The programme, entitled The Top 60 Best Selling Records of the 60s, was hosted by British DJ Tony Blackburn. The chart was compiled by the OCC, and was based on sales of singles from 1 January 1960 to 31 December 1969.\nThe most represented act in the chart is the Beatles, who feature on the list with 18 releases, seven of which are in the top twenty. Similarly, the most represented record label is Parlophone, who released music from the Beatles between 1962 and 1968 in the UK. The most represented act after the Beatles is the Rolling Stones, who have five singles in the list. The highest-placed solo female artist on the list is Cilla Black at number 27, with her 1964 single \"Anyone Who Had a Heart\", which was also distributed by Parlophone. Of the 60 discs in the chart, more than half (44) are by British acts.\nDuring the 1960s, sales of singles in the UK were monitored by several magazines, including New Musical Express (NME), Record Retailer, Melody Maker and Disc. Before 1969, no officially recognised singles chart was published in the UK. Until 10 March 1960, chart compilers used the weekly chart listed by NME, after which they moved to the singles list published by Record Retailer, despite NME having the wider circulation and higher readership. During the start of the decade, Record Retailer was sampling roughly 30 stores; NME and Melody Maker had a sample size of more than one hundred. One source explains that the reason for using the Record Retailer chart for the early 1960s was that it was \"the only chart to have as many as 50 positions for almost the entire decade\". On 15 February 1969, Record Retailer and the BBC jointly commissioned the British Market Research Bureau (BMRB) to record sales of singles in what officially became the UK Singles Chart. The BMRB compiled the chart by using hand-written and post-submitted data from approximately 250 record stores.\nBetween 1960 and 1969, fourteen singles sold more than one million copies in the UK, of which the biggest-selling was \"She Loves You\" by the Beatles. Released on 23 August 1963, the single spent six non-consecutive weeks at number one and sold more than 1.89&nbsp;million copies, approximately 140,000 more than its nearest rival, \"I Want to Hold Your Hand\", also by the Beatles. The biggest-selling record not to top the UK Singles Chart was Acker Bilk's 1961 instrumental \"Stranger on the Shore\" – it sold more than 1.13&nbsp;million copies and peaked at number two, being kept off the top by \"The Young Ones\" by Cliff Richard and the Shadows, another million-seller.\nSingles\nhad five of the biggest-selling singles of the decade.|alt=Black-and-white photograph of the Rolling Stones sitting on a staircase in 1965.]]\nfeatured in the decade-end singles chart with four songs.|alt=Black-and-white promotional photograph of Elvis Presley from the 1957 film Jailhouse Rock.]]\nreleased three of the best-selling singles.|alt=Head-and-shoulders colour photograph of Cliff Richard in 1975.]]\n's 1965 song \"Tears\" was the third best-selling track of the decade.|group=lower-alpha|name=A}}\n!scope=col|Year\n!scope=col|Chartpeak|group=lower-alpha}}\n|\n|Parlophone\n|align=center|1967\n|align=center|2\n|-\n!scope=row style=\"text-align:center;\"|47\n|\"Wooden Heart\"\n|\n|RCA\n|align=center|1961\n|align=center|1\n|-\n!scope=row style=\"text-align:center;\"|48\n|\"19th Nervous Breakdown\"\n|\n|Decca\n|align=center|1966\n|align=center|2\n|-\n!scope=row style=\"text-align:center;\"|49\n|\"It's Not Unusual\"\n|\n|Decca\n|align=center|1965\n|align=center|1\n|-\n!scope=row style=\"text-align:center;\"|50\n|\"Honky Tonk Women\"\n|\n|Decca\n|align=center|1969\n|align=center|1\n|-\n!scope=row style=\"text-align:center;\"|51\n|\"Penny Lane\" / \"Strawberry Fields Forever\"\n|\n|Parlophone\n|align=center|1967\n|align=center|2\n|-\n!scope=row style=\"text-align:center;\"|52\n|\"\"\n|\n|Parlophone\n|align=center|1964\n|align=center|1\n|-\n!scope=row style=\"text-align:center;\"|53\n|\"I Love You Because\"\n|\n|RCA\n|align=center|1964\n|align=center|5\n|-\n!scope=row style=\"text-align:center;\"|54\n|\"Summer Holiday\"\n| and The Shadows\n|Columbia\n|align=center|1963\n|align=center|1\n|-\n!scope=row style=\"text-align:center;\"|55\n|\"Oh, Pretty Woman\"\n|\n|London\n|align=center|1964\n|align=center|1\n|-\n!scope=row style=\"text-align:center;\"|56\n|\"I Won't Forget You\"\n|\n|RCA\n|align=center|1964\n|align=center|3\n|-\n!scope=row style=\"text-align:center;\"|57\n|\"Lady Madonna\"\n|\n|Parlophone\n|align=center|1968\n|align=center|1\n|-\n!scope=row style=\"text-align:center;\"|58\n|\"Surrender\"\n|\n|RCA\n|align=center|1961\n|align=center|1\n|-\n!scope=row style=\"text-align:center;\"|59\n|\"Delilah\"\n|\n|Decca\n|align=center|1968\n|align=center|2\n|-\n!scope=row style=\"text-align:center;\"|60\n|\"Jumpin' Jack Flash\"\n|\n|Decca\n|align=center|1968\n|align=center|1\n|}\nReferences\n;General (chart positions)\n*\n;Specific"
    }
  ]
}