{
  "content": [
    {
      "type": "text",
      "text": "# List of awards and nominations received by the Veronicas__disambig_1\n\nThe Veronicas are an Australian pop music duo. Formed in Brisbane in 2005, the group consists of twin sisters Jessica and Lisa Origliasso. The Veronicas have released three studio albums, The Secret Life Of... (2005), Hook Me Up (2007) and The Veronicas (2014).\nThe Veronicas have won and been nominated for numerous music awards. They include two ARIA Music Award, two Channel V Oz Artist of the Year awards and three MTV Australia Awards. In 2008 The Veronicas received an ARIA No.1 Award for their single, \"Hook Me Up\", reaching number-one on the Australian Singles Chart in 2007. Additionally they have been nominated for seven ARIA Music Awards, an APRA Award and an MTV Europe Music Award.\nAPRA Awards\nThe APRA Awards were established by the Australasian Performing Right Association (APRA) in 1982 to honour the achievements of songwriters and music composers, and to recognise their songwriting skills, sales and airplay performance, by its members annually. The Veronicas have been nominated twice: once in 2009 for Most Played Australian Work for their single \"Untouched\", which was written by Jessica, Lisa Origliasso and Tobias Gad; in 2015 \"You Ruin Me\" (co-written by the duo along with Anthony Egizii and David Musumeci) was nominated for Song of the Year.\n|-\n| 2009\n| \"Untouched\"\n| Most Played Australian Work\n|\n|-\n| 2015\n| \"You Ruin Me\"\n| Song of the Year\n|\nARIA Music Awards\nThe ARIA Music Awards have been presented by the Australian Recording Industry Association (ARIA) since 1987. These awards recognise excellence in Australian music across different genres. The Veronicas have been nominated ten times for two wins: Best Pop Release in 2006 for their debut album The Secret Life Of... and Best Video for \"You Ruin Me\" – directed by Matt Sharp and Daniel James – in 2015.\n|-\n| 2005 || \"4ever\"  || Best Breakthrough Artist – Single ||\n|-\n|rowspan=\"3\"| 2006 ||rowspan=\"3\"| The Secret Life Of... || Best Pop Release ||\n|-\n| Breakthrough Artist – Album ||\n|-\n| Highest Selling Album ||\n|-\n|rowspan=\"4\"| 2008 || rowspan=\"2\"|Hook Me Up || Best Pop Release ||\n|-\n| Highest Selling Album ||\n|-\n|\"Untouched\" ||rowspan=\"2\"| Highest Selling Single ||\n|-\n|\"Hook Me Up\" ||\n|-\n|rowspan=\"2\"| 2015 || \"You Ruin Me\" || Song of the Year ||\n|-\n| \"You Ruin Me\" –  Matt Sharp, Daniel James || Best Video ||\n|-\n|rowspan=\"3\"| 2016 || rowspan=\"3\"|\"In My Blood\" || Best Group ||\n|-\n| Best Pop Release ||\n|-\n| Song of the Year ||\n|-\n| 2023\n| Vodka Cruiser: The Solo Project (BRING Agency)\n| Best Use of an Australian Recording in an Advertisement (over 2 minutes duration)\n|\n|-\nBerlin Music Video Awards\nThe Berlin Music Video Awards is an international festival that promotes the art pf music videos\n|-\n| 2024\n| Perfect\n| Best Song\n|\n|-\n|}\nARIA No.1 Chart Awards\nThe ARIA No.1 Chart awards were established in 2002, by the Australian Recording Industry Association (ARIA), to recognise Australian artists who achieved a number-one single, album or music DVD on the Australian music charts. The Veronicas have won two ARIA No.1 Awards: one in 2008 for their single \"Hook Me Up\", which peaked at number-one on the Australian Singles Chart on 18 November 2007; and in 2014 for \"You Ruin Me\" which debuted atop the chart on 5 October 2014.\n|-\n| 2007\n| \"Hook Me Up\"\n| rowspan=\"2\"|Reaching number-one on the ARIA Singles Chart\n|\n|-\n| 2014\n| \"You Ruin Me\"\n|\n|-\nChannel V\nThe [[Channel V Oz Artist of the Year|[V] Oz Artist of the Year]] Award honours the \"finest artists for valour, excellence and innovation\" and is chosen by the Australian public. It is presented annually at the ARIA Awards.\n|-\n| 2005\n|rowspan=\"8\"| The Veronicas\n|rowspan=\"8\"| OZ Artists of the Year\n|\n|-\n| 2006\n|\n|-\n| 2007\n|\n|-\n| 2008\n|\n|-\n| 2009\n|\n|-\n| 2011\n|\n|-\n| 2012\n|\n|-\n| 2013\n|\nDolly Teen Choice Awards\nThe Dolly Teen Choice Awards were established in 2006 by Dolly Magazineo honour achievements in music, fashion, sport, television and media personalities. The nominees are chosen by the magazine, and the winner is selected by public vote. The Veronicas have won two Dolly Teen Choice Awards from three nominations.\n|-\n| rowspan=\"2\"|2006\n| The Veronicas\n| Hottest Music Act\n|\n|-\n| The Secret Life Of...\n| Hottest Album of 2006\n|\n|-\n| 2008\n| Hook Me Up\n| Most played on my iPod\n|\n|-\nMTV Awards\nLos Premios MTV Latinoamérica\nThe Los Premios MTV Latinoamérica were established in 2002 by MTV Networks Latin America (MTVNLA). These awards celebrate the years best music videos in Latin America and the world. The Veronicas have received two nominations at the Los Premios MTV Latinoamérica 2009 awards.\n|-\n| rowspan=\"2\"|2009\n| Themselves\n| Best New Artist — International\n|\n|-\n|\"Untouched\"\n| Best Live Performance at \"Los Premios 2009\"\n|\n|-\nMTV Australia Awards\nThe MTV Australia Awards (MTVAA) is an annual awards ceremony established in 2005 by MTV Australia. The Veronicas have won three awards from seven nominations, including the 'Video of the Year' award in 2006 for \"4ever\".\n|-\n| rowspan=\"4\"|2006\n| The Veronicas\n| Spankin' New Aussie Artist\n|\n|-\n| rowspan=\"2\"|\"4ever\"\n| Video of the Year\n|\n|-\n| Best Pop Video\n|\n|-\n| The Veronicas\n| Viewer's Choice Award\n|\n|-\n| 2007\n| \"Revolution\"\n| Best Pop Video\n|\n|-\n| 2008\n| The Veronicas\n| Best Australian Artist\n|\n|-\n| 2009\n| The Veronicas\n| Best Aussie\n|\n|-\nMTV Europe Music Awards\nThe MTV Europe Music Awards (EMA) were established in 1994 by MTV Networks Europe to celebrate the most popular music in Europe. The Veronicas have been nominated once in 2009 for 'Best Push Act'.\n|-\n|2009\n| The Veronicas\n| Best Push Act\n|\n|-\n| 2016\n| The Veronicas\n| Best Australian Act\n|\n|-\nNickelodeon Australian Kids' Choice Awards\nThe Nickelodeon Australian Kids' Choice Awards is an annual awards show, established in 2003 by Nickelodeon Australia. The awards honour the best in film, television, music, books and personalities as voted by young people. The Veronicas have received three awards out of seven nominations, including the 'Fave Band' award which they won in 2007 and 2008.\n|-\n| rowspan=\"3\"|2006\n| rowspan=\"2\"| The Veronicas\n| Fave Aussie Group\n|\n|-\n| Fave Celeb Duo\n|\n|-\n| \"When It All Falls Apart\"\n| Fave Song\n|\n|-\n| rowspan=\"2\"|2007\n| rowspan=\"2\"| The Veronicas\n| Fave Band\n|\n|-\n| Fave Celeb Duo\n|\n|-\n| rowspan=\"2\"|2008\n| The Veronicas\n| Fave Band\n|\n|-\n| Untouched\n| Fave song\n|\n|-\n|}\nPremios Oye!\nPremios Oye! are presented annually by the Academia Nacional de la Música en México for outstanding achievements in Mexican record industry. The Veronicas have received one nomination.\n|-\n| 2009\n| The Veronicas\n| Best International New Artist\n|\n|-\n|}\nQueensland Music Awards\nThe Queensland Music Awards (previously known as Q Song Awards) are annual awards celebrating Queensland, Australia's brightest emerging artists and established legends. They commenced in 2006.\n|-\n| 2016\n| The Veronicas\n| Highest Selling Album\n|\n|-\n| 2017\n| \"In My Blood\"\n| Highest Selling Single\n|\n|-\nRolling Stone Awards (Australia)\nThe Rolling Stone Australia Awards are awarded annually by Rolling Stone Australia magazine since 2010 for outstanding contributions to music and popular culture in the previous year. The Veronicas have been nominated once.\n|-\n| 2015\n| \"You Ruin Me\"\n| Music Video of the Year\n|\n|-\n|}\nTMF Awards\nThe TMF awards were established in 1995 by The Music Factory (TMF) in Belgium to recognise achievements in music. The Veronicas have received one award from one nomination in 2006 for the Best International New Artist.\n|-\n|rowspan=\"6\"|2006\n|The Veronicas\n| Best International New Artist\n|\n|-\n|}\nReferences"
    }
  ]
}