{
  "content": [
    {
      "type": "text",
      "text": "# List of awards and nominations received by the All-American Rejects__disambig_1\n\nThe All-American Rejects is an alternative rock band formed in Stillwater, Oklahoma. The All-American Rejects have been nominated for many awards, most frequently in the Teen Choice Awards. The band was awarded accolades such as \"Best Group Video\" at the MTV Music Video Awards for \"Move Along\", as well as the \"Rising Star\" award from the Oklahoma Music Hall of Fame, and was also inducted into the hall itself. The video for the band's 2017 single \"Sweat\" has received a nomination from the UK Music Video Awards.\nAPRA Awards\nThe APRA Awards are a series of annual award ceremonies created by the Australasian Performing Right Association, since 1982.\n|-\n|align=\"center\"| 2010\n|\"Gives You Hell\"\n|International Work of the Year\n|\n|-\nASCAP Pop Music Awards\nThe ASCAP Pop Music Awards is an awards show that honors its top pop members. The All-American Rejects have received 1 award.\n|-\n|align=\"center\"| 2007\n|The All-American Rejects\n|ASCAP Vanguard Award\n|\n|-\nFuse Fangoria Chainsaw Awards\nThe Fuse Fangoria Chainsaw Awards was an awards show that aired on Fuse TV only in 2006. The All-American Rejects received 1 nomination.\n|-\n|align=\"center\"| 2006\n|\"Move Along\"\n|Killer Video\n|\n|-\nMTV Video Music Awards\nThe MTV Video Music Awards were established in 1984 by MTV to celebrate the music videos of the year. The All-American Rejects have won 1 award from 3 nominations.\n|-\n| align=\"center\"| 2003\n| \"Swing Swing\"\n|Best New Artist in a Video\n|\n|-\n| rowspan=\"2\" align=\"center\"| 2006\n| rowspan=\"2\"| \"Move Along\"\n|Best Group Video\n|\n|-\n|Best Editing in a Video\n|\n|-\nMuchMusic Video Awards\nThe MuchMusic Video Awards are awarded annually presented by the Canadian music video channel MuchMusic. The All-American Rejects has received 1 nomination.\n|-\n| align=\"center\"|2006\n| \"Dirty Little Secret\"\n|Best International Group\n|\n|-\nOklahoma Music Hall of Fame\nThe Oklahoma Music Hall of Fame, located in Muskogee, Oklahoma, honors Oklahoma musicians for their lifetime achievements in music.   The All-American Rejects have received 1 award.\n|-\n|align=\"center\"| 2008\n| The All-American Rejects\n| Rising Star\n|\n|-\nTeen Choice Awards\nThe Teen Choice Awards are held annually and presented by Fox Broadcasting Company. The All-American Rejects have received 6 nominations.\n|-\n|rowspan=\"2\" align=\"center\"| 2006\n|The All-American Rejects\n|Choice Music: Rock Group\n|\n|-\n|\"Move Along\"\n|Choice Music: Rock Track\n|\n|-\n| align=\"center\"| 2007\n|The All-American Rejects\n|Choice Music: Rock Group\n|\n|-\n|rowspan=\"3\" align=\"center\"| 2009\n|The All-American Rejects\n|Choice Music: Rock Group\n|\n|-\n|\"Gives You Hell\"\n|Choice Music: Rock Track\n|\n|-\n|When the World Comes Down\n|Choice Music: Group Album\n|\n|-\nUK Music Video Awards\n|-\n| align=\"center\"|2017\n| \"Sweat\"\n|Best Rock/Indie Video - International\n|\n|-\nReferences"
    }
  ]
}