{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in Nicaragua__disambig_1\n\n|caption=Location of World Heritage Sites in Nicaragua|float=right|width=250}}\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) World Heritage Sites are places of importance to cultural or natural heritage as described in the UNESCO World Heritage Convention, established in 1972. Cultural heritage consists of monuments (such as architectural works, monumental sculptures, or inscriptions), groups of buildings, and sites (including archaeological sites). Natural features (consisting of physical and biological formations), geological and physiographical formations (including habitats of threatened species of animals and plants), and natural sites which are important from the point of view of science, conservation or natural beauty, are defined as natural heritage. Nicaragua accepted the convention on December 17, 1979, making its historical sites eligible for inclusion on the list. As of 2024, Nicaragua has  two World Heritage Sites, both located in León Department.\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural, and vii through x are natural.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (department)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" data-sort-type=\"number\"|\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" |Ruins of León Viejo\n|\n|León Department\n|2000\n|613rev; iii, iv (cultural)\n|León Viejo is one of the oldest Spanish colonial settlements in the Americas. It did not develop and so its ruins are outstanding testimony to the social and economic structures of the Spanish Empire in the 16th century. Moreover, the site has immense archaeological potential.\n|-\n! scope=\"row\" |León Cathedral\n|\n|León Department\n|2011\n|1236rev; ii, iv (cultural)\n|Built between 1747 and the early 19th century to the design of Guatemalan architect Diego José de Porres Esquivel, the monument expresses the transition from Baroque to Neoclassical architecture and its style can be considered to be eclectic. The Cathedral is characterized by the sobriety of its interior decoration and the abundance of natural light. The vault of the Sanctuary, however, presents rich ornamentation. The Cathedral houses important works of art including a wooden Flemish altarpiece, and paintings of the 14 stations of the Way of the Cross by Nicaraguan artist Antonio Sarria (late 19th and early 20th centuries).\n|}\nTentative list\nIn addition to sites inscribed on the World Heritage List, member states can maintain a list of tentative sites that they may consider for nomination. Nominations for the World Heritage List are only accepted if the site was previously listed on the tentative list. , Nicaragua has listed five properties on its tentative list.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (department)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" | UNESCO criteria\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" |Fortress of the Immaculate Conception\n|\n|Río San Juan Department\n| align=\"center\" |1995\n|(mixed)\n|\n|-\n! scope=\"row\" |The Natural Reserve \"Miskitos Keys\"\n|\n|North Caribbean Coast Autonomous Region\n| align=\"center\" |1995\n|(natural)\n|\n|-\n! scope=\"row\" |The Natural Reserve \"Bosawás\"\n|\n|Jinotega Department, North Caribbean Coast Autonomous Region\n| align=\"center\" |1995\n|(natural)\n|\n|-\n! scope=\"row\" |Volcan Masaya National Park\n|\n|Managua Department, Masaya Department\n| align=\"center\" |1995\n|(natural)\n|\n|-\n! scope=\"row\" |City of Granada and its natural environment\n|\n|Granada Department\n| align=\"center\" |2003\n|(mixed)\n|\n|}\nReferences\nExternal links"
    }
  ]
}