{
  "content": [
    {
      "type": "text",
      "text": "# List of World War II British naval radar\n\nThis page is a List of World War II British naval radar.\nNomenclature\nThese sets were initially numbered as wireless telegraph (w/t) sets, but a distinguishing prefix of \"2\" was soon added. Metric sets were numbered in the 28x and 29x series. When centimetric sets arrived with the advent of the cavity magnetron, they were numbered by subtracting 10 from the metric type number they were based on (e.g. the metric Type 284 was replaced by the centimetric Type 274). This was not always possible however, as Types 271 - 274 were already in use for original centimetric sets, thus some metric sets in the Type 28x range had 20 subtracted (e.g. the metric Type 282 was replaced by the centimetric Type 262). Aerial outfits were given a three letter identifier that began with \"A\".\nSuffixing letters indicated the following;\n* B - conversion of sets with separate transmitting (Tx) and receiving (Rx) antennas to single antenna operation.\n* M, P, Q - major set modifications\n* R - addition of range-taking panel\n* U - modification to suit coastal operations\n* W - modification to submarine use\n* X, Y, Z - experimental modifications\nSets\nASV II\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n!Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|ASV Mark I/Mark II\n|\n|7\n|176\n| 1700\n|1940\n|}\nThe first successful air-to-surface-vessel (ASV) radar, from early 1940. ASV II was a re-packaged ASV I but otherwise similar. ASV II radar allowed Fleet Air Arm (FAA) Swordfish from the carriers  and  to locate and attack the German battleship  in May 1941.\nASV III\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n!Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|ASV III/XI\n|\n|50\n| 3000\n|100\n|1943\n|}\nThe first successful airborne microwave radar. Used on FAA Swordfish and Barracuda aircraft, and many RAF Coastal Command aircraft. High-resolution centimetric radar could detect even small objects, such as the periscope or snorkel of a submerged submarine, making it a highly efficient tool for Anti-submarine warfare (ASW). The Mk XI was a further development exclusively for the FAA.\nType 79\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n!Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|79\n|\n|70\n|42.8\n|7,000\n|1938\n|}\nBased on the Type 79 w/t, first fitted to  then  and later ; (40 sets ordered)\nType 86\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|86M\n|APH\n|\n|\n|\n|1962\n|}\nFore-runner to Type 286.\nType 262\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|262\n|APE\n|30\n|9,670\n|31\n|\n|}\nCentimetric fire-control set for 40 mm Bofors weapons. Fitted to Close Range Blind Fire (CRBF) director and STAAG weapon mount. Dish antenna spun off-centre at high speed to produce scanning cone, target lock and blind fire possible.\nType 267\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|267\n|APT\n|100\n|214\n|1,400\n|\n|}\nAir warning set for submarines replacing Type 291W.\nType 268\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|268\n|AQN\n|40\n|9,386\n|32\n|\n|}\nFirst X band naval radar. Used on small vessels for target indication and navigation.\nType 271\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|271\n|\n|5\n|2,997\n|100\n|March 1941\n|-\n|271P\n|\n|90\n|2,997\n|100\n|1943\n|-\n|271Q\n|\n|90\n|2,997\n|100\n|1943\n|}\nType 271 was the original naval centimetric target indication radar, later fitted with a plan position indicator. Type 271 had separate transmit and receive aerials, small \"cheese\" antennas stacked on top of each other. The antenna array was carried in a distinctive protective perspex \"lantern\", and initially had to be fitted directly onto the radar office roof due to limitations in coaxial cabling (until suitable waveguides had been developed). The Type 271 was a vitally important war weapon, as for the first time it allowed escort ships to reliably detect surfaced U-boats or even just their periscopes. It was first fitted in . 350 sets were ordered. Modification Q was much more powerful and known as the \"Centimetric Mark IV\". Mark V was even more powerful and later renamed Type 277.  Type 271 was fitted widely to escort vessels of corvette and frigate size, with the unsuccessful Type 272 intended for destroyers and the Type 273 for cruisers and battleships.\nType 272\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|272\n|\n|90\n|2,997\n|100\n|1941\n|}\nA version of the Type 271 with a cable-drive and more powerful receiver allowing the antenna to be mounted remotely from the radar office. Was not considered successful and not widely used.\nType 273\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|273\n|AQN\n|90\n|2,997\n|100\n|1941\n|}\nA version of the 271 with a much larger  diameter full-parabolic antennas instead of the smaller clipped \"cheese\" antennas of the 271. The antennas were mounted on a stabilized mounting and placed high on the mast on cruiser and battleship sized ships. The larger antennas more than made up for the wiring losses seen in the 272, and the resulting system was even more powerful than the original 271. Upgrades followed those of the original 271 series. In the Battle of the North Cape,  identified the target of  at  using her Type 273 set, receiving a solid signal on the ''Scharnhorst's mast while the ship was still well below the radar horizon. Replaced by the Type 276.\nType 274\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|274\n|AUM\n|500\n|3,294\n|91\n|1944\n|}\nCentimetric replacement for Type 284. Main armament ranging and shot-spotting set for cruisers and battleships. \"Double cheese\" antennas. Most notably in place on HMS Belfast\nType 275\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|275\n|\n|400\n|3,526\n|85\n|1944\n|}\nCentimetric replacement for Type 285. Destroyer main armament and capital ship secondary fire control set. Fitted to directors HACS Mark VI and Mark 6M and modified American Mark 37. Separate Tx and Rx dishes.\nType 276\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|276\n|AUS / AUJ\n|500\n|2,997\n|100\n|1944\n|}\nCombined the electronics of the Type 277 and the stabilized mounting of the Type 273. Reduced  antennas in aerial outfit AUS.\nType 277\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|277P\n|AUK\n|400\n|2,997\n|100\n|1943\n|-\n|277Q\n|ANU\n|500\n|2,997\n|100\n|1944\n|}\nOriginally known as Type 271 Mark V, this was a significant improvement on the original design and was later renamed to make this clear. Used a single transmit/receive antenna, waveguides instead of coaxial cables and a much more powerful magnetron that considerably improved all-around performance. Aerial Outfit AUK was a parabolic dish, ANU was a cropped paraboloid. Fitted on a \"nodding\" mount, often used as a height finding set. Superseded in service by Type 278 height finder in s.\nType 279\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|279\n|\n|70\n|39.9\n|7,450\n|1940\n|-\n|279M\n|\n|70\n|39.9\n|7,450\n|1941\n|}\nFollow on from Type 79, metric air warning set. Had separate Tx and Rx antennas, combined in Type 279M to single antenna operation. This set also had a secondary surface search with surface and aerial gunnery capability and used a Precision Ranging Panel, which passed accurate radar ranges directly to the HACS table (analogue computer).\nType 280\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|280\n|\n|25\n|85\n|3,500\n|1940\n|}\nMetric air warning set with separate Tx / Rx antennas. Based upon Army GL Mark I set, fitted to s converted to anti-aircraft ships. This set used a Precision Ranging Panel, which passed accurate radar ranges directly to the HACS table (analogue computer).\nType 281\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|281\n|AQB\n|350\n|85\n|3,500\n|1940\n|}\nMetric air warning set with separate Tx / Rx antennas. Type 281B had combined Tx / Rx antenna.  First fitted to  then  This set also had a secondary surface search function along with aerial and surface gunnery capability and used a Precision Ranging Panel. The Type 281 ranging system allowed the user to select either a  or a  range display with range accuracies of  RMS, respectively. Aerial target ranges were passed directly to the HACS table (fire control computer).\nType 282\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (cm)\n! In service\n|-\n|282\n|\n|25\n|600\n|50\n|1941\n|}\nDecimetric (50&nbsp;cm) ranging set for Bofors 40&nbsp;mm and \"multiple pom-pom\" fire control. Fitted on Bofors mounting Mark IV \"Hazemeyer\" and \"Pom-pom Director Mk IV\", twin Yagi antennas. Type 282 used a mechanical ranging panel and a 0-5000yd display. Type 282M increased transmission power to 150&nbsp;kW, used a 0 - 6000yd display and introduced Beam Switching, while Type 282P introduced a Precision Ranging Panel.\nType 283\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (cm)\n! In service\n|-\n|283\n|\n|25\n|600\n|50\n|1942\n|}\nMain armament anti-aircraft barrage fire control set fitted to \"barrage director\" for cruiser  and battleship guns. This set used a Precision Ranging Panel and was used to fire the guns automatically using the Automatic Barrage Unit.\nType 284\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (cm)\n! In service\n|-\n|284\n|ASF\n|25\n|600\n|50\n|1940\n|-\n|284M\n|ASF\n|150\n|600\n|50\n|1941\n|-\n|284P\n|ASF\n|150\n|600\n|50\n|1942\n|}\nMain armament ranging and shot-spotting set for cruisers and battleships with lobe switching beginning with Type 284M to increase accuracy of bearing readings.  Prototype fitted on .  received first production set.  Used by  to shadow Bismarck.  Type 284P was instrumental in the Battle of the North Cape allowing Duke of York to attack Scharnhorst blind.\nType 285\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (cm)\n! In service\n|-\n|285\n|\n|25\n|600\n|50\n|1941\n|-\n|285M\n|\n|150\n|600\n|50\n|1941\n|-\n|285P\n|\n|150\n|600\n|50\n|1942\n|}\nRanging set for anti-aircraft fire control, fitted to HACS directors and rangefinder-directors and used ranging panel L12. Type 285 with six element Yagi antenna with separate Tx / Rx. Type 285P with five element Yagi antenna with combined Tx / Rx function. The Type 285M could provide accurate ranges via the mechanical ranging panel, L12, and bearing information using lobe switching, but height finding was primitive and had to be calculated using maximum signal indication. As such it could not achieve a target lock, and could not offer blind fire capability. Type 285P introduced a Precision Ranging Panel and had 25yd RMS range accuracy.\nType 286\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|286M\n|ATQ\n|\n|214\n|1,400\n|1940\n|-\n|}\nMetric target indication set based upon RAF ASV (Air to Surface Vessel) Mark II set. Type 286M had fixed antennas, with a central Tx and an Rx on either side to give some indication of contact bearing. The antennas were fixed, scanning being achieved by conning the ship. Type 286PU and Type 286W were fixed antennas sets for coastal vessels and submarines respectively. Type 286PQ had a steerable combined Tx / Rx antenna from the Type 291 set.\nType 290\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|290\n|\n|100\n|214\n|1,400\n|\n|-\n|}\nMetric target indication set, replacement for Type 286.\nType 291\nof the submarine  is showing a 291W air-warning set]]\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|291\n|\n|100\n|214\n|1,400\n|1941\n|-\n|}\nMetric air warning sets. Original Type 291 had a hand-steered antenna, replaced by Type 291M with power training and plan position indicator. U and W variants for coastal craft and submarines respectively.\nType 293\n{| class=\"wikitable\"\n!Type\n! Aerial outfit\n! Peak power (kW)\n! Frequency (MHz)\n! Wavelength (mm)\n! In service\n|-\n|293M\n|AUR\n|500\n|2,997\n|100\n|1945\n|-\n|293P\n|AQR\n|500\n|2,997\n|100\n|1945\n|-\n|293Q\n|ANS\n|500\n|2,997\n|100\n|1945\n|-\n|}\nBased on the same electronics as the Type 277/276, the Type 293 used a new antenna design intended to cover the area above the ship to provide air warning instead of surface search. Stabilised \"cheese\" antenna,  diameter in outfit AUR, upgraded to  in Type 293P (replaced all Type 293 and Type 276 sets) and to  in Type 293Q.\nPrecision Ranging Panel\nThe Precision Ranging Panel (PRP) was an electromechanical transmission and calculating system. The PRP allowed for accurate range determination, range rate determination using radar, and accurate transmission of radar ranges and range rates to fire control computers. The PRP used an electronic timing signal and pip matching to provide very accurate ranges. It also used a power follow up to continuously transmit the correct range rate as long as the target maintained a steady course and speed. The PRP was adapted from the British Army GL, Gun Laying'', radar system, and first went to sea in 1939 aboard several C-class cruisers, using the Type 280 radar. By 1941 the PRP was a common feature on the Type 280, 279 and 281 radars, and by late 1941 began to appear on the type 282P, 284P and 285P radar systems.\nMechanical Ranging Panel\nThe Type 282, 282M, 285, and 285M radars used a mechanical ranging panel that used a mechanical cursor placed over the ranging display, to estimate range and automatically transmitted the calculated range to either the HACS or FKC fire control computer. Type 285 used Ranging Panel L12 and this also featured range rate estimation with power follow up so that the ranging panel would continue to transmit the correct range without operator intervention as long as the target maintained a steady course at a constant speed.\nSee also\n* List of World War II electronic warfare equipment\n* History of radar\nNotes\nReferences\n*\n*\n*\nExternal links\n* [http://www.rnmuseumradarandcommunications2006.org.uk/index.htm The RN Radar and Communications Museum ]\n* [https://www.iwm.org.uk/collections/item/object/1060020035 RADIO LOCATION (RDF) PART 7 : OPERATIONAL USE OF TYPE NOS 273M AND 284M (4) IN A CRUISER]"
    }
  ]
}