{
  "content": [
    {
      "type": "text",
      "text": "# List of presidents of the University of Kentucky\n\nin the background.]]\nThe University of Kentucky is a public research university in Lexington, Kentucky. It was founded by John Bryan Bowman in 1865 as the Agricultural and Mechanical College of Kentucky (A&M), a publicly charted department of Kentucky University (now called Transylvania University), under the Morrill Land-Grant Colleges Act. James Kennedy Patterson, a professor at Kentucky University, became the first president of A&M in 1869. Nine years later, amid concerns about a private religious university receiving public land-grant funding, A&M split from Kentucky University and moved to its present campus in downtown Lexington. The institution was renamed State University, Lexington, Kentucky, upon reaching university status in 1908, and eight years later, was again renamed the University of Kentucky. Today, the university is the state's largest and its flagship.\nThe office of the president is housed in the Main Building. Finished in 1882, the Main Building was one of the original three State College buildings. Patterson personally financed the construction of all three. Maxwell Place, an Italianate villa located off Rose Street in the heart of campus, serves as the residence of the president. It was originally constructed for James Hillary Mulligan and his wife Mary in 1872, and was acquired by the university in 1917 after Mulligan's death. Frank L. McVey was the first president to reside at Maxwell Place.\nThe president is the chief executive officer of the university. The president is appointed by the Board of Trustee and can only be removed \"for incompetence, neglect of or\nrefusal to perform duties, or for immoral conduct,\" and then only after notice and hearing. The president is the chair of the University Senate and an ex officio member of the Staff Senate. While the Board has delegated most administrative power to the President, it retains the right to approve certain major decisions, including the annual budget and establishing academic councils. In the event of a vacancy, the provost serves as president until the Board appoints an interim or new president.\nTwelve men have served as president of the University of Kentucky. Of those, five were graduates of the university or its predecessor institutions, and another attended without graduating.  A. D. Kirwan served only in an interim capacity, but was retroactively named the seventh president by the Board of Trustees. The twelfth and current president, Eli Capilouto, assumed the office in 2011.\nPresidents\n{| class=\"wikitable\" width=80%\n|-valign=\"top\"\n! scope=\"col\" width=\"4%\"| #\n! scope=\"col\" width=\"80px\"| Image\n! scope=\"col\" width=\"20%\"| Name\n! scope=\"col\" width=\"10%\"| Term begin\n! scope=\"col\" width=\"10%\" | Term end\n! scope=\"col\" width=\"*%\"| Notes\n! scope=\"col\" width=\"5%\"| References\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" | 1\n|\n| James Kennedy Patterson\n| align=\"center\" | 1869\n| align=\"center\" | 1910\n|\n| align=\"center\" |\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" | 2\n|\n|Henry Stites Barker\n| align=\"center\" | 1911\n| align=\"center\" | 1917\n| Attended A&M (1869–1872; did not graduate)\n| align=\"center\" |\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" | 3\n|\n|Frank L. McVey\n| align=\"center\" | 1917\n| align=\"center\" | 1940\n|\n| align=\"center\" |\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" |4\n|\n|Herman Lee Donovan\n| align=\"center\" | 1941\n| align=\"center\" | 1956\n| Graduate of State University (BA 1914)\n| align=\"center\" |\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" | 5\n|\n|Frank G. Dickey\n| align=\"center\" | 1956\n| align=\"center\" | 1963\n| Graduate of the University of Kentucky (MA 1942, EdD 1947)\n| align=\"center\" |\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" | 6\n|\n|John W. Oswald\n| align=\"center\" | 1963\n| align=\"center\" | 1968\n|\n| align=\"center\" |\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" | 7\n|\n|A. D. Kirwan\n| align=\"center\" | 1968\n| align=\"center\" | 1969\n| Graduate of the University of Kentucky (BA 1926). Only served as interim, but retroactively named the seventh President by the Board of Trustees\n| align=\"center\" |\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" | 8\n|\n|Otis A. Singletary\n| align=\"center\" | 1969\n| align=\"center\" | 1987\n|\n| align=\"center\" |\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" | 9\n|\n|David Roselle\n| align=\"center\" | 1987\n| align=\"center\" | 1989\n|\n| align=\"center\" |\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" | 10\n|\n|Charles T. Wethington Jr.\n| align=\"center\" | 1990\n| align=\"center\" | 2001\n| Graduate of the University of Kentucky (MA 1962, PhD 1966).\n| align=\"center\" |\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" | 11\n|\n|Lee T. Todd Jr.\n| align=\"center\" | 2001\n| align=\"center\" | 2011\n| Graduate of the University of Kentucky (BS 1968)\n| align=\"center\" |\n|-valign=\"top\"\n| scope=\"row\" align=\"center\" | 12\n|\n|Eli Capilouto\n| align=\"center\" | 2011\n| align=\"center\" | present\n|\n| align=\"center\" |\n|}\nReferences\nExternal links\n* [https://www.uky.edu/president/ University of Kentucky Office of the President]"
    }
  ]
}