{
  "content": [
    {
      "type": "text",
      "text": "# List of people from Newark, New Jersey\n\nThis is a list of notable people from Newark, New Jersey.\nAcademics and science\n* Steve Adubato Sr. (1932–2020), founder of Robert Treat Academy Charter School\n* Alan P. Bell (1932–2002), psychologist who worked at the Kinsey Institute\n* Cornelia Chase Brant (1863–1959), Dean of New York Medical College and Hospital for Women\n* Jabez Campfield (1737–1821), doctor who served as a surgeon in the Continental Army during the American Revolutionary War\n* Robert Curvin (1934–2015), researcher and theorist on issues related to urban poverty\n* John Cotton Dana (1856–1929), public librarian and founder of the Newark Museum\n* Carl Neumann Degler (1921–2014), historian and Pulitzer Prize winning author\n* Adele Dunlap (1902–2017), educator, was the oldest living American (from July 8, 2016, to February 5, 2017)\n* Theodosia Garrison (1874–1944), poet who published frequently in popular magazines from the 1890s into the 1920s\n* Jotham Johnson (1905–1967), archaeologist whose specialty was Mediterranean archaeology and primitive time-reckoning, professor at University of Pittsburgh and chairman of classics at New York University, editor of Archaeology and President of the Archaeological Institute of America\n* Arnie Kantrowitz (1940–2022), LGBT activist and college professor\n* Peter Knobel (1943–2019), Reform rabbi, educator and editor\n* Leonard Krieger (1918–1990), historian who paid particular attention to Modern Europe, particularly being known as an author on Germany\n* Ernest Mae McCarroll (1898–1990), medical doctor who became the first African American physician to be appointed to the staff of the Newark City Hospital, in 1946\n* August Meier (1923–2003), professor of history at Kent State University and a scholar on African American history\n* Charles Anthony Micchelli (born 1942), mathematician who has focused on numerical analysis, approximation theory and machine learning\n* Edward Morley (1838–1923), scientist best known for his role in the Michelson–Morley experiment, whose negative results paved the way for Albert Einstein's special relativity\n* Joseph S. Murphy (1933–1998), political scientist and university administrator, who was president of Queens College, president of Bennington College and chancellor of the City University of New York\n* James B. Nies (1856–1922), Episcopal minister and Assyriologist who was president of the American Oriental Society in 1921\n* John Alsop Paine (1840–1912), Presbyterian minister, botanist, professor of natural history and German, archaeologist and editor\n* Sam Porcello (1935–2012), food scientist who developed the Oreo cookie filling\n* Eugene G. Rochow (1909–2002), inorganic chemist and winner of the Perkin Medal\n* Frederick Schauer (1946–2024), legal scholar who was known for his work on American constitutional law, freedom of speech and on legal reasoning\n* Gaddis Smith (1932–2022), historian at Yale University and an expert on U.S. foreign relations and maritime history\n* Barbara Stanley (1949–2023), psychologist, researcher and suicidologist\n* Harold Widom (1932–2021), mathematician best known for his contributions to operator theory and random matrices\n* Charles D. Wrege (1924–2014), management historian and professor at Rutgers University\n* Lewis Yablonsky (1924–2014), sociologist, criminologist, author and psychotherapist, best known for his innovative and experiential work with gang members\nArts\nArchitecture\n* Peter Eisenman (born 1932), architect\n* Daniel Riggs Huntington (1871–1962), architect best known for his work in Seattle\n* Richard Meier (born 1934), Pritzker Prize-winning architect\nAuthors\n* Paul Auster (1947–2024), author, known for works blending absurdism and crime fiction\n* Amina Baraka (born 1942 as Sylvia Robinson), poet, actress, author, community organizer, singer, dancer and activist\n* Amiri Baraka (1934–2014), Poet Laureate of New Jersey\n* Albert Boni (1892–1981), publisher\n* Milton W. Brown (1911–1998), New York art historian who wrote American Painting from the Armory Show to the Depression\n* Niobia Bryant (born 1972), author, who also writes under the pseudonym Meesha Mink\n* John W. Campbell (1910–1971), science fiction writer who was editor of Astounding Science Fiction from 1937 until his death\n* Harlan Coben (born 1962), novelist\n* Stephen Crane (1871–1900), author, known for the 1895 Civil War novel The Red Badge of Courage\n* Robyn Crawford (born 1960), author, producer, and former assistant to and creative director for Whitney Houston\n* Amanda Minnie Douglas (1831–1916), children's author\n* Ken Eulo (born 1939), Eugene O'Neill Award-winning writer and bestselling author whose novels have collectively sold over 13 million copies worldwide\n* Eloise Alma Flagg (1918–2018), first African American woman to be a school principal in Newark, New Jersey\n* Allen Ginsberg (1926–1997), poet, known for the 1956 poem \"Howl\"\n* Dan Gutman (born 1955), writer, primarily of children's fiction\n* Andrew Hubner (born 1962), novelist\n* Andrew Jacobs, journalist with The New York Times and documentary film director / producer\n* Jim Murphy (1947–2022), author of more than nonfiction and fiction books for children, young adults, and general audiences, including more than 30 about American history\n* Philip Roth (1933–2018), author\n* David Shapiro (born 1947), poet and art historian\n* Dave Toma, former Newark Police Department police detective whose undercover work and battles with his superiors became the basis of the television series Toma, which ran on the ABC network from 1973 to 1974\n* Richard Wesley (born 1945), playwright and screenwriter\n* Thomas Chatterton Williams (born 1981), cultural critic and author, whose works include the 2019 book Self-Portrait in Black and White\n* Ruth Winter (born 1930), journalist and science writer\n* William Woestendiek (1920–2015), editor and journalist\nFine arts\n* Hilda Belcher (1881–1963), artist known for her paintings, watercolors and portraits\n* Judith Bernstein (born 1942), painter known for her large-scale paintings of penises\n* Robert Birmelin (born 1933), figurative painter, printmaker and draughtsman\n* Franco Castelluccio (born 1955), sculptor\n* Carmen Cicero (born 1926), painter\n* Andre de Krayewski (1933–2018), painter\n* M. Asli Dukan (born 1973), independent media producer, filmmaker and visual artist working with themes of speculative fiction\n* Amaranth Ehrenhalt (1928–2021), painter, sculptor and writer\n* Robert Farber (born 1944), photographer, known for his work with female nudes, fashion and still lifes\n* Jerry Gant (1961–2018), visual artist, poet, performance artist and educator\n* John R. Grabach (1886–1981), painter, known for his social and urban realism works of working class New Jersey and New York\n* Walter Granville-Smith (1870–1938), illustrator and painter who produced the first colored illustration that appeared in the United States\n* Gladys Barker Grauer (1923–2019), artist and activist, who was known as the \"matriarch of Newark arts\"\n* Tom Patrick Green (1942–2012), painter and professor\n* Akintola Hanif (born 1972), photographer\n* Alexander F. Harmer (1856–1925), painter who has been described as the first prominent painter of California\n* Grace Hartigan (1922–2008), abstract expressionist painter, member of the post-war avant-garde New York School\n* Eleanor Kish (1924–2014), artist best known for her paleoart depicting dinosaurs during the 1970s until the mid 1990s, many of which are on public display in museum collections\n* Douglas Kolk (1963–2014), artist known for drawing and work in collage and mixed media\n*Barbara Kruger (born 1945), conceptual artist\n* Lee Lozano (1930–1999), painter and conceptual artist\n* William Pope.L (1955–2023), visual artist best known for his work in performance art\n* Jason Seley (1919–1983), sculptor, educator and academic administrator\n* Nina Howell Starr (1903–2000), photographer, art historian and art dealer\n* Philip Stein (1919–2009), painter\n* George A. Tice (1938–2025), photographer, known for his images of people and places in New Jersey\nFilm, television and theater\n* Jason Alexander (born 1959), actor, known for his role in Seinfeld\n* John Amos (1939–2024), actor who appeared on television in Good Times and The West Wing\n* Charita Bauer (1922–1985), soap opera radio and television actress\n* Bill Bellamy (born 1965), actor and former MTV VJ\n* Taurean Blacque (1941–2022), actor, best known for appearing on Hill Street Blues\n* Vivian Blaine (1921–1995), actress\n* John Carter (1922–2018), film editor whose work includes The Heartbreak Kid and Paper Lion\n* Brian De Palma (born 1940), film director\n* Ernest Dickerson (born 1951), film and TV director\n* Monique Dupree (born 1974), actress and wrestler best known for work in Tommy Dreamer’s wrestling promotion House of Hardcore\n* Grant Ellis (born 1993), television personality best known as a contestant on season 21 of The Bachelorette, and as the star of season 29 of The Bachelor\n* Allen Garfield (1939–2020), actor\n* Bernard Gersten (1923–2020), theatrical producer\n* Ice-T (born 1958), actor and rapper\n* Michael B. Jordan (born 1987), actor\n* Victor J. Kemper (1927–2023), cinematographer\n* Jerome Kern (1885–1945), composer credited with the idea of making Edna Ferber's novel Show Boat into a musical; also composed its music as well as the scores for many other shows; he considered \"Ol' Man River\" his masterpiece\n* Jerry Lewis (1926–2017), actor, director and comedian\n* Bob Ley, (born 1955), sports anchor for ESPN\n* Ray Liotta (1954–2022), actor\n* The Lucas Bros. (born 1985), Academy Award-nominated writers and producers of Judas and the Black Messiah, stand-up comedians\n* Bebe Neuwirth (born 1958), stage, TV and film actress\n* Okieriete Onaodowan (born 1987), actor\n* Leighton Osmun (1880–1928), screenwriter, playwright and author, who was active during Hollywood's silent era\n* Joe Pesci (born 1943), Academy Award-winning actor\n* Keshia Knight Pulliam (born 1979), actress; played Cliff Huxtable's youngest daughter Rudy on The Cosby Show\n* B.S. Pully (1910–1972; born Murray Lerman), nightclub comedian and stage actor who created the role of Big Jule in the musical Guys and Dolls\n* Queen Latifah (born 1970), Academy Award-nominated actress, Grammy Award-winning rapper and singer\n* Retta (born 1970), comedienne and actress, known for playing Donna Meagle in Parks and Recreation\n* Joe Rogan (born 1967), comedian, host of Fear Factor and The Joe Rogan Experience podcast\n* Eva Marie Saint (born 1924), Academy Award-winning actress\n* Todd Solondz (born 1959), independent film director and screenwriter\n* Trish Vradenburg (1946–2017), playwright, author, television writer and advocate of research to cure Alzheimer's disease\n* Jack Warden (1920–2006), two-time Academy Award-nominated actor\n* Renauld White (1944–2024), actor and model, who appeared in the soap opera television series Guiding Light\n* Thea White (1940–2021), voice actress best known for her work as Muriel Bagge in the animated TV show Courage the Cowardly Dog\n* J. D. Williams (born 1978), actor\n* Ian Ziering (born 1964), actor, known for playing Steve Sanders on the television series Beverly Hills, 90210\nMusic\n* Tawatha Agee (born 1953), singer-songwriter\n* Andy Bey (1939–2025), jazz singer and pianist\n* Geraldine Bey (born 1935), jazz singer and concert organizer\n* Salome Bey (1933–2020), singer-songwriter\n* Lou Brutus (born 1972), radio host, musician and photographer\n* John-Michael Caprio (1947–1997), conductor\n* Betty Carter (1929–1998), jazz singer\n* Lou Carter (1918–2005), jazz pianist, composer and songwriter\n* Eric Chasalow (born 1955), composer of acoustic and electronic music\n* Bill Chinnock (1947–2007), singer-songwriter and guitarist; part of the Asbury Park music scene with Bruce Springsteen in the late 1960s\n* Kat DeLuna (born 1987), singer\n* Rah Digga (born 1972), rapper\n* Faith Evans (born 1973), singer-songwriter\n* Ted Fio Rito (1900–1971), singer-songwriter\n* Connie Francis (1937–2025), singer of hit songs such as \"Who's Sorry Now?\" and \"Where the Boys Are\"\n* Fugees, hip-hop group\n* Gloria Gaynor (born 1949), singer, known for disco-era hits including \"I Will Survive\"\n* Savion Glover (born 1973), actor, tap dancer and choreographer\n* Lorraine Gordon (1922–2018), longtime owner of the Village Vanguard jazz club in New York City's Greenwich Village\n* John Gorka (born 1958), folk musician\n* Bernard Greenhouse (born 1916), cellist\n* Young Guru (born 1974 as Gimel Androus Keaton), audio engineer, record producer, disc jockey and record executive\n* Gwen Guthrie (1950–1999), R&B and soul singer with dance hits \"Ain't Nothin' Goin' On but the Rent\" and \"It Should've Been You\"\n* Stefon Harris (born 1973), jazz vibraphonist\n* Cissy Houston (1933–2024), soul and gospel singer\n* Whitney Houston (1963–2012), singer and actress, also a member of the Rock And Roll Hall Of Fame\n* Mach-Hommy, Haitian-American rapper and record producer\n* Nick Massi (1935–2000), Rock and Roll Hall of Fame member, as part of The Four Seasons\n* James Moody (1925–2010), jazz saxophonist and flute player\n* Melba Moore (born 1945), actress and singer\n* Tame One (born 1970 as Rahem Brown), hip hop artist of the rap duo Artifacts\n* Outsidaz, rap group\n* Charlie Persip (1929–2020), jazz drummer\n* Redman (born 1970), rapper\n* Marc Ribot (born 1954), guitarist and composer\n* Fred Schneider (born 1951), singer-songwriter, arranger and musician, best known as the frontman of the rock band the B-52's, of which he is a founding member\n* Woody Shaw (1944–1989), jazz trumpeter and composer\n* Wayne Shorter (1933–2023), jazz composer and saxophonist\n* Paul Simon (born 1941), songwriter and musician, who has been inducted into the Rock and Roll Hall of Fame\n* Tyshawn Sorey (born 1980), drummer and composer\n* Frankie Valli (born 1934), singer, frontman of The Four Seasons, member of the Rock and Roll Hall of Fame\n* Sarah Vaughan (1924–1990), jazz singer\n* Marlene VerPlanck (1933–2018), jazz and pop vocalist whose body of work centered on big band jazz, the American songbook and cabaret\n* Mikey Way (born 1980), bassist with My Chemical Romance\n* Max Weinberg (born 1951), drummer for Bruce Springsteen's E Street Band and The Max Weinberg 7 on ''Late Night with Conan O'Brien\n* Larry Young (1940–1978), jazz organist\nBusiness and industry\n* Seth Boyden (1788–1870), inventor, best known for patent leather\n* Ray Chambers (born 1942), businessman and philanthropist\n* William A. Conway (1910–2006), CEO of Garden State National Bank\n* Frederick Eberhardt (1868–1946), engineer, philanthropist, university administrator and president of Gould & Eberhardt\n* Martin S. Fox (1924–2020), publisher\n* John Jelliff (1813–1893), furniture maker during the second half of the 19th century\n* Dennis Kozlowski (born 1946), businessman and disgraced former CEO of Tyco International\n* Thomas N. McCarter (1867–1955), chief executive officer of PSE&G Corporation; developer of Newark's Pennsylvania Station; original benefactor of the McCarter Theatre in Princeton\n* Grace Mirabella (1929–2021), fashion journalist who was editor-in-chief of Vogue magazine between 1971 and 1988, after which she founded Mirabella magazine\n* Jack Northrop (1895–1981), aviation pioneer\n* Marc Roberts (born 1959), entrepreneur, sports manager, real estate developer and businessman\n* Brandon 'Scoop B' Robinson, NBA analyst\n* Narciso Rodriguez (born 1961), fashion designer\n* Arthur A. Schmon (1895–1964), business executive who became a leading figure in the paper industry of Ontario and Quebec\n* Jordan Zimmerman (born 1955), advertising business executive and philanthropist\nCrime\n* Mary Frances Creighton (1899–1936), housewife, who along with Everett Applegate, was executed in Sing Sing Prison's electric chair, Old Sparky, for the poisoning of Applegate's wife, Ada\n* Jerome Dennis (serial killer) (born 1966) - serial killer who raped and murdered five women in 1991 and 1992\n* Robert Peace (–2011), subject of The Short and Tragic Life of Robert Peace, a 2002 Yale University graduate and scientist, who operated a hydroponic marijuana farm in Newark, where he was shot to death\n* Akbar Pray (born 1948), drug kingpin who was sentenced to life in prison in 1990 for leading a drug gang since the early 1970s\n* Abner Zwillman (1904–1959), Jewish American mob boss\nGovernment, politics and community\n* Harold A. Ackerman (1928–2009), United States district judge of the United States District Court for the District of New Jersey\n* J. LeRoy Baxter (1881–1954), dentist / oral surgeon and politician, who was elected to represent Essex County, New Jersey, in the New Jersey General Assembly in 1928\n* Cory Booker (born 1969), United States Senator and former mayor of Newark\n* William J. Brennan Jr. (1906–1997), Associate Justice of the Supreme Court of the United States\n* Michael Donald Brown (born 1953), Shadow United States Senator representing the District of Columbia\n* Jacob Burnet (1770–1853), U.S. Senator\n* Aaron Burr (1756–1836), politician and Vice President of the United States\n* John F. Callinan (1935-2025), judge of the New Jersey Superior Court\n* Robert L. Carter (1917–2012), civil rights leader; United States District judge\n* Chris Christie (born 1962), 55th Governor of New Jersey\n* Silas Condit (1778–1861), represented New Jersey in the United States House of Representatives, 1831–1833\n* Steve Corodemus (born 1952), politician who served in the New Jersey General Assembly from 1992 to 2008, where he represented the 11th Legislative District\n* Eunice Dwumfour (1993–2023), member of the borough council of Sayreville, New Jersey, from 2021 until her assassination\n*Bill Field (1926–2022), politician who served in the New Hampshire House of Representatives from 2002 to 2006\n* Marvin E. Frankel (1920–2002), United States district judge of the United States District Court for the Southern District of New York and human rights activist\n* Arline Friscia (1934–2019), politician who served in the New Jersey General Assembly from 1996 to 2002, where she represented the 19th Legislative District\n* Jacques Gansler (1934–2018), aerospace electronics engineer, defense contracting executive and public policy expert, who served as Under Secretary of Defense for Acquisition, Technology and Logistics\n* Michael Giuliano (1915–1976), politician who served two terms in the New Jersey Senate\n* Edward E. Gnichtel (1869−1933), businessman and politician who represented Essex County in the New Jersey General AssemblyHe was born in Newark on\n* Diane Gutierrez-Scaccetti, former executive director of the New Jersey Turnpike Authority and Florida's Turnpike Enterprise, who was Commissioner of the New Jersey Department of Transportation\n* George A. Halsey (1827–1894), represented New Jersey's 7th congressional district from 1867–1869 and 1871–1873\n* R. Graham Huntington (1897–1957), politician who served three terms in the New Jersey General Assembly representing Essex County\n* Anthony Imperiale (1931–1999), paramedic, activist, vigilante and militant leader and populist who served on the Municipal Council of Newark and represented the city in the New Jersey General Assembly and New Jersey Senate\n* Abraham Kaiser (1852–1912), businessman, alderman and member of the New Jersey General Assembly\n* Ed Koch (1924–2013), Mayor of New York City\n* James Lordi (1910–1985), politician who served in the New Jersey General Assembly from 1970 to 1972\n* Joseph P. Lordi (1919–1983), law enforcement official who served as the Essex County prosecutor and as the first Chairman of the New Jersey Casino Control Commission\n* Alexander Matturri (1913–1992), politician and jurist who served in the New Jersey State Senate from 1968 to 1972\n* LaMonica McIver (born 1986), politician who represents New Jersey's 10th congressional district; former president of the Municipal Council of Newark\n* Yaakov Ben Zion Mendelson (1875–1941), served as chief rabbi of the city in the 1920s and 1930s\n* John J. Miller Jr. (1923–2012), politician who served in the New Jersey General Assembly from 1962 to 1964\n* Hymen B. Mintz (1909–1986), politician who served in the New Jersey General Assembly from 1954 to 1957\n* George DeGraw Moore (1822–1891), Wisconsin State Senator and New Jersey jurist\n* Rocco Neri (1919–2011), politician who represented the 28th Legislative District in the New Jersey General Assembly from 1974 to 1976\n* Sheila Oliver (1952–2023), politician who served as the second lieutenant governor of New Jersey, from 2018 until her death\n* Cortlandt Parker (1818–1907), Prosecutor of the Pleas for Essex County, New Jersey and President of the American Bar Association\n* Francis F. Patterson Jr. (1867–1935), represented New Jersey's 1st congressional district in the United States House of Representatives, 1920–1927\n* Donald M. Payne (1934–2012), member of the United States House of Representatives from New Jersey's 10th congressional district\n* Alexander C. M. Pennington (1810–1867), represented  in the United States House of Representatives, 1853–1857\n* Hugo Pfaltz (1931–2019), politician who served two terms in the New Jersey General Assembly\n* Nicholas H. Politan (1935–2012), attorney who served as a United States district judge of the United States District Court for the District of New Jersey\n* Oliver Randolph (1882–1951), first African American to be admitted to the New Jersey bar and second African American elected to the New Jersey Legislature\n* Ronald Rice (1945–2023), politician who served in the New Jersey State Senate from 1986 to 2022, where he represented the 28th legislative district\n* Peter W. Rodino (1909–2005), member of the United States House of Representatives from New Jersey's 10th congressional district\n* Marge Roukema (1929–2014), politician who represented New Jersey in the U.S. House of Representatives from 1981 to 2003\n* Robert A. Salerno, associate judge on the Superior Court of the District of Columbia\n* William Cortenus Schenck (1773-1821), founder of Newark, Ohio, who was a member of the Ohio Senate from 1803 to 1804\n* William F. Schnitzler (1904–1983), labor union leader\n* Herbert Norman Schwarzkopf (1895–1958), first superintendent of the New Jersey State Police; father of Desert Storm commander H. Norman Schwarzkopf\n* Peter Shapiro (born 1952), financial services executive and former politician who was the youngest person ever elected to the New Jersey General Assembly and went on to serve as Essex County Executive\n* Sir Bysshe Shelley (1731–1815), grandfather of radical progressive English poet Percy Shelley was born here\n* Craig A. Stanley (born 1955), politician who served in the New Jersey General Assembly from 1996 to 2008, where represented the 28th Legislative District\n* Gary Saul Stein (born 1933), attorney and former associate justice of the New Jersey Supreme Court, who served for 17 years where he wrote over 365 published opinions\n* Isaac Tichenor (1754–1838), politician who served as the third and fifth Governor of Vermont and as United States Senator\n* Seymour Trieger (1924–2012), leader of the Green Party of Canada from 1984 to 1988\n* Anthony M. Villane (1929–2022), dentist and politician who was elected to serve seven terms in the New Jersey General Assembly from 1976 to 1988\n* John Beam Vreeland (1852–1923), lawyer who served in the New Jersey Senate and as the United States Attorney for the District of New Jersey\n* Milton Waldor (1924–1975), politician who served in the New Jersey State Senate from 1968 to 1972, representing Essex County\n* George M. Wallhauser (1900–1993), Member of United States House of Representatives from New Jersey's 12th congressional district\n* Thomas C. Wasson (1896–1948), diplomat who was killed while serving as the Consul General for the United States in Jerusalem\n* William Adee Whitehead (1810–1884), historian, surveyor, customs official and public servant\n* Evelyn Williams, politician who briefly served in the New Jersey General Assembly representing the 28th Legislative District\n* James Zangari (1929–2011), politician who served in the New Jersey General Assembly from the 28th Legislative District from 1980 to 1996\nActivists\n* Helen Tufts Bailie (1874–1962), women's, labor and social rights activist who outed the Daughters of the American Revolution for having a blacklist\n* Earl Best (1947–2021), community activist known as \"The Street Doctor\"\n* Emma Bourne (1846–1924) president, New Jersey Woman's Christian Temperance Union\n* Jody Cohen (born 1954), first woman rabbi in Connecticut history and active in Jewish women's movements\n* Mary R. Denman (1823-1899), first president of the New Jersey Woman's Christian Temperance Union\n* Ida Wharton Dawson (1860–1928), social worker; President, New Jersey State Federation of Women's Clubs\n* Muriel Fox (born 1928), feminist activist who was a co-founder of the National Organization for Women\n* Lawrence Hamm (born 1954), civil rights activist and founder of the People's Organization for Progress\n* Mary G. Hill (1803-1884), first of president the Woman's Christian Temperance Union of Newark\n* Charles Jacobs, co-founder of the American Anti-Slavery Group\n* Daryle Lamont Jenkins (born 1968), civil rights activist and founder of One People's Project\n* Joseph Zadroga (1947–2024), advocate for first responders sickened from their time in the rubble of the World Trade Center following the September 11 terrorist attacks\nMilitary\n* Shan K. Bagby (born 1967), U.S. Army brigadier general and the 28th Chief of the Army Dental Corps\n* Holmes E. Dager (1893–1973), U.S. Army major general, raised and educated in Newark\n* Lawrence N. \"Larry\" Guarino (1922–2014), spent eight years as a prisoner of war in the Hanoi Hilton prison during the Vietnam War\n* LeRoy P. Hunt (1892–1968), United States Marine Corps general who commanded the 2nd Marine Division at the end of World War II\n* Stephen W. Kearny (1794–1848), victorious commander of the Army of the West during the Mexican–American War who served as Military Governor of California\n* Cortlandt Parker (1884–1960), US Army major general\n* William W. Smith (1888–1966), vice admiral, USN; commanded cruiser task force during the Battles of the Coral Sea and Midway in 1942\n* William M. Wright (1863–1943), career officer in the United States Army who attained the rank of lieutenant general and was most notable for his service as a division and corps commander during World War I\nSports\n]]\n* Jackie Autry (born 1941), Major League Baseball executive\n* Trevor Baptiste (born 1996), professional lacrosse midfielder for the Boston Cannons\n* Mike Barca (born 1954), soccer player\n* Moe Berg (1902–1972), Major League Baseball baseball player and spy\n* Jalen Berger, American football running back for the Michigan State Spartans football team\n* Jim Bouton (1939–2019), professional baseball player\n* Dino Boyd (born 1996), offensive lineman for the Ottawa Redblacks of the Canadian Football League\n* Da'Sean Butler (born 1987), former basketball player who is currently an assistant coach for the College Park Skyhawks of the NBA G League\n* Robinson Canó (born 1982), baseball player\n* Rick Cerone (born 1954), professional former baseball player for the New York Yankees and the New York Mets; founder of the Newark Bears\n* Roger Chanoine (1976–2016), offensive tackle who played in the NFL between 1998 and 2002, primarily for the Cleveland Browns\n* Mike Charles (born 1962), former professional football player who played nose tackle for nine seasons in the National Football League\n* Andy Chisick (1916–1986), American football center who played in the NFL for the Chicago Cardinals\n* Patrick Cole (born 1993), professional basketball player\n* Leonard S. Coleman Jr. (born 1949), last president of the National League, serving from 1994 until 1999, when the position was eliminated by Major League Baseball\n* Tim Coleman (born 1995), professional basketball player\n* Sharife Cooper (born 2001), basketball player\n* August Desch (1898–1964), won bronze in the 400-meter hurdles at the 1920 Summer Olympics in Antwerp, Belgium\n* Jahan Dotson (born 2000), professional football wide receiver for the Philadelphia Eagles\n* Kenneth Faried (born 1989), basketball player for the Denver Nuggets who is the NCAA Division I modern era's all-time leading rebounder\n* William Fenn (1904–1980) , cyclist who competed in two events at the 1924 Summer Olympics\n* Randy Foye (born 1983), professional basketball player for the Oklahoma City Thunder\n* Awful Gardner (1825–1899), boxer who was one of the first celebrity Christian converts in the United States\n* Tate George (born 1968), point guard who played in the NBA for the New Jersey Nets and the Milwaukee Bucks\n* Willie Gilzenberg (1901–1978), booker, boxing promoter and wrestler in the New York and New Jersey areas\n* Norm Granger (born 1961), former fullback in the National Football League, who played for the Dallas Cowboys and the Atlanta Falcons\n* Kai Gray (born 1997), professional gridiron football defensive back for the Edmonton Elks of the Canadian Football League\n* Jerry Greenspan (1941–2019), NBA basketball player\n* Marvin Hagler (1954–2021), boxer and former Undisputed World Middleweight Champion who finished his career with a record of 62–3–2 with 52 knockouts and 12 title defenses\n* Billy Hamilton (1866–1940), major league baseball player\n* Larry Hazzard (born 1944), former amateur boxer, boxing referee, athletic control board commissioner, teacher and actor\n* Larry Hesterfer (1878–1943), pitcher who played a single MLB game in 1901 with the New York Giants, in which he became the only player known to have hit into a triple play in his first major league at bat\n* Qadry Ismail (born 1970), former professional football player who played for 10 years in the NFL\n* Amara Kamara (born 1988), former gridiron football linebacker\n* Mohamed Kamara, American football defensive lineman for the Colorado State Rams\n* Sheldon Karlin (1950–2000), distance runner who won the New York City Marathon in 1972\n* David Levin (1948–2017), balloonist, who is the only person to have completed the \"triple crown\" by winning the World Gas Balloon Championship, the World Hot Air Ballooning Championships and the Gordon Bennett Cup\n* Honey Lott (1925–1980), Negro league outfielder who played for the New York Black Yankees\n* Boris Malenko (1933–1994), professional wrestler\n* Bobby Malkmus (1931–2025), former professional baseball infielder who played in MLB for the Milwaukee Braves, Washington Senators and Philadelphia Phillies\n* Richard Matuszewski (born 1964), former professional tennis player\n* Jamar McGloster (born 1995), professional gridiron football offensive tackle for the Montreal Alouettes of the Canadian Football League\n* Art McMahon (born 1946), defensive back for the Boston / New England Patriots football team from 1968 to 1970 and 1972\n* Jerron McMillian (born 1989), football safety who played in the NFL for the Green Bay Packers\n* George Mehnert (1881–1948), two-time Olympic gold medalist in freestyle wrestling, first American wrestler to win two Olympic gold medals in wrestling\n* Angelo Mongiovi (born 1952), former wheelchair track, basketball and rugby competitor\n* Glenn Mosley (born 1955), former professional basketball player who played in the NBA for the Philadelphia 76ers and San Antonio Spurs\n* Renaldo Nehemiah (born 1959), hurdler; played in the NFL\n* Shaquille O'Neal (born 1972), professional basketball player, four-time NBA champion\n* Lou Palmer (1935–2019), sportscaster who was a SportsCenter anchor and reporter and one of the original studio anchors at WFAN, the nation's first all-sports radio station\n* Chet Parlavecchio (born 1960), former NFL football player\n* Aulcie Perry (born 1950), professional basketball player\n* Al Pfeifer (1928–2013), professional football end who played for the Toronto Argonauts and Ottawa Rough Riders\n* Richie Regan (1930–2002), basketball player and coach who played in the NBA for the Rochester / Cincinnati Royals\n* Herb Rich (1928–2008), safety who played in the NFL for the New York Giants, Baltimore Colts and Los Angeles Rams\n* Camille Sabie (1902–1998), athlete who represented the United States in several events at the 1922 Women's World Games, winning gold medals in the 110 yd hurdles and standing long jump and a bronze medal in the conventional long jump\n* George MacDonald Sacko (1936–2011), captain of the Liberian national soccer team into the 1960s\n* Ron San Fillipo (1942–2024), athletic director and athletics coach who was head coach of the Newark State / Kean Squires football team\n* Pete Shaw (born 1976), former NFL safety who played for the San Diego Chargers and the New York Giants\n* Alshermond Singleton (born 1975), former football linebacker who played 10 seasons in the NFL for the Tampa Bay Buccaneers and Dallas Cowboys\n* Brittney Sykes (born 1994), WNBA guard for the Washington Mystics\n* David Smukler (1914–1971), American football fullback / linebacker who played in the NFL for the Philadelphia Eagles\n* Shakur Stevenson (born 1997), amateur bantamweight boxer who was chosen to be part US boxing team at the 2016 Summer Olympics in Rio de Janeiro\n* Andre Tippett (born 1959), Hall of Fame former linebacker with the New England Patriots\n* Walt Walsh (1897–1966), Major League Baseball player who played in two games as a pinch runner for the Philadelphia Phillies in 1920, never getting an at-bat\n* Art Weiner (1926–2013), end who played in the National Football League for the New York Yanks\n* Charley Weinert (1895–1969), boxer, known as the \"Newark Adonis\"\n* Dick Weisgerber (1915–1984), defensive back, fullback and kicker who played four NFL seasons with the Green Bay Packers\n* Gregor Weiss (born 1941), Olympic gymnast\n* Peter Westbrook (1952–2024), 13-time national sabre fencing champion and Olympic bronze medalist\n* Greg White (born 1979), defensive end for the Tampa Bay Buccaneers\n* Tahir Whitehead (born 1990), NFL linebacker, has played for the Detroit Lions\n* Earl Williams (1948–2013), Major League Baseball player who was the 1971 NL Rookie of the Year\n* Eric Williams (born 1972), former professional basketball player who played for the Boston Celtics and Denver Nuggets\n* Keith Willis (born 1959), former American football defensive lineman who played in the NFL for the Pittsburgh Steelers, Buffalo Bills and Washington Redskins\n* Yasin Willis, American football running back for the Syracuse Orange\n* Sal Wormley (born 2001), professional football offensive lineman for the Jacksonville Jaguars\nSee also\n*List of people from New Jersey\nReferences"
    }
  ]
}