{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1911\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1911.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland).  For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign.  Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\".  Acts passed from 1963 onwards are simply cited by calendar year and chapter number.\n1 & 2 Geo. 5\nThe first session of the 30th Parliament of the United Kingdom, which met from 31 January 1911 until 16 December 1911.\nThis session was also traditionally cited as 1 & 2 G. 5, 1 Geo. 5 or 1 G. 5.\nPublic general acts\n}}\n|\n|  }}\n|  }}\n|  }}\n|\n| |note4= }}\n|  }}\n|\n-\n|  }}\n|  }}\n|\n|\n|  }}\n|  }}\n| |note4= }}\n|\n| |note4= }}\n|\n-\n|  }}\n|  }}\n|  }}\n|\n|  }}\n| |note4= }}\n|\n|\n|  with Amendments.}}\n|  and the Church Building Act, 1839.|note4= }}\n-\n| |note4= }}\n| |note4= }}\n|  }}\n|  }}\n|  }}\n|\n| |note4= }}\n| |note4= }}\n| |note4= }}\n|  }}\n-\n|\n|\n|  to certain British Courts in foreign countries.|note4= }}\n|  }}\n| or the Military Manoeuvres Act 1911|public|44|16-12-1911|repealed=y|An Act to amend the Military Manœuvres Act, 1897.|note4= }}\n|\n|\n|  }}\n|\n|\n-\n|  }}\n|\n|\n|\n|  }}\n|  }}\n|  so as to authorise a payment to be made to the National Telephone Company, Limited, of a sum on account of the Telephone Purchase Money before the amount thereof is finally ascertained.|note4= }}\n|\n|\n}}\nLocal acts\nrelating to Paisley Corporation.|po1=Paisley Corporation Order 1911|Provisional Order to authorise the Corporation of the burgh of Paisley to excamb a portion of the lands of Carriagehill to amend the law relating to the levying and recovery of assessments within the burgh to provide for the filling up of casual vacancies in the Corporation and for other purposes.}}\n|  relating to Ayrshire (Loch Bradan) Water Distribution.|po1=Ayrshire (Loch Bradan) Water Distribution Order 1911|Provisional Order to authorise the District Committees of the Ayr and Kilmarnock Districts of the county of Ayr to supply water within their districts under the Public Health (Scotland) Act 1897 to define the special water supply district and to constitute such district a Special Water Supply District under that Act to authorise and require the County Council of the county of Ayr to levy assessments and to borrow money for the purposes of such water supply to authorise the Town Council of the burgh of Troon to borrow money and for other purposes.}}\n|  relating to Irvine Burgh.|po1=Irvine Burgh Order 1911|Provisional Order for empowering the Corporation of the Burgh of Irvine to construct a bridge across the River Irvine with roads of access thereto to borrow money and for other purposes.}}\n| |po1=Holcombe Rifle Ranges Order 1910|po1year=y|A Provisional Order made in pursuance of section two of the Military Lands Act 1892 authorising the purchase by the Territorial Force Association of the County of Lancaster of land for the provision of rifle ranges and for other military purposes.}}\n|\n|\n|\n|\n|\n-\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n-\n|  }}\n|  and for other purposes.|note4= }}\n|  }}\n|\n| )}} Charles Sheils' Almshouses Charity Act 1866)}} and Charles Sheils' Charity Act 1875.)}} }}\n|\n|\n|\n|\n|\n-\n|\n|\n|\n|  relating to the St Andrew's Ambulance Association.|po1=St. Andrew's Ambulance Association Order 1911|Provisional Order to authorise the St. Andrew's Ambulance Association to transfer a portion of the Red Cross Fund held by the said Association to the Scottish Branch of the British Red Cross Society to discharge the said Association in respect of and to sanction and confirm payments made to the said Scottish Branch and for other purposes.}}\n|  relating to Christ Church Glasgow.|po1=Christ Church Glasgow Order 1911|Provisional Order to authorise the Trustees of the Church and ground known as Christ Church Glasgow to erect certain buildings and to use the same or permit the same to be used in connexion with the work of the Scottish Episcopal Church in the East End of Glasgow and for other purposes.}}\n|  }}\n| or the Greater Birmingham Act 1911|local|36|02-06-1911|maintained=y|repealed=y|An Act to confirm a Provisional Order of the Local Government Board relating to Birmingham.|note4=|po1=Birmingham (Extension) Order 1911|Provisional Order made in pursuance of Sections 54 55 and 59 of the Local Government Act 1888. }}\n| |note4=|po1=Thorpe Acre Dishley Order.|po1short=n}}\n|  relating to Dundee Water.|note4=|po1=Dundee Water Order 1911|Provisional Order to empower the Dundee Water Commissioners to extend enlarge and alter their Lintrathen Reservoir and Works connected therewith and construct other Works and for other purposes.}}\n|\n-\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|\n-\n|\n|\n|  to confer further powers upon the mayor aldermen and burgesses of the borough of Harrogate in regard to their water undertaking and for other purposes.|note4= }}\n|\n|\n|  }}\n|\n|  }}\n|\n|\n-\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|\n-\n| |note4= }}\n|  }}\n|\n|\n|  }}\n|\n|\n|\n|  }}\n|\n-\n|  }}\n|\n|\n|\n|  to confer further powers on the Corporation with respect to the control of streets and structures in streets and buildings and in reference to repair of streets to enable the Corporation to enter into agreements with the Stepney Borough Council in reference to the special rate leviable in the city under the Great Tower Hill Act 1869 to make further provisions for the health and good government of the city to empower the Corporation to borrow money and for other purposes.}}\n|\n|\n|\n|  extension of time for the purchase of lands for the further tramways and works authorised by the Nottinghamshire and Derbyshire Tramways Act 1908 abandonment of certain tramways authorised by the Act of 1903 and for other purposes.|note4= }}\n|  }}\n-\n|  and for other purposes.}}\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|\n-\n|\n|\n|  }}\n|  }}\n|\n|\n|\n|  as regards certain bridges vested in the company of proprietors of the Basingstoke Canal Navigation and for other purposes.}}\n|\n|  }}\n-\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|\n-\n|\n|  relating to Inverness Harbour.|po1=Inverness Harbour Order 1911|Provisional Order to alter the constitution of the Trustees of the Harbour of Inverness and the method of electing Trustees to authorise the Trustees to construct works to confer further powers on the Trustees with respect to tolls rates and charges and the borrowing of money to confer powers on the Town Council of the Royal Burgh of Inverness with respect to levying a special harbour rate the granting of a guarantee and other matters and for other purposes.}}\n|  relating to Dumbarton Churchyard.|po1=Dumbarton Churchyard Order 1911|Provisional Order to empower the Heritors of the Parish of Dumbarton to sell a portion of the Churchyard of the Parish and for other purposes.}}\n|  relating to Chambers Institution Peebles.|po1=Chambers Institution of Peebles Order 1911|Provisional Order to transfer the administration and management of the Chambers Institution Peebles and endowments thereof to the Provost Magistrates and Councillors of the Royal burgh of Peebles and to the committee to be appointed on the adoption in the said burgh of the Public Libraries Consolidation (Scotland) Act 1887 as modified by this Order and to provide for the administration and management of the said Institution to continue the privileges of the said Institution to persons resident in the county of Peebles and for other purposes.}}\n|  relating to Aberdeen Corporation.|note4=|po1=Aberdeen Corporation Order 1911|Provisional Order to confer further powers on the lord provost magistrates and town council of the city and Royal burgh of Aberdeen.}}\n|  relating to the North British Railway (Superannuation Fund &c.)|po1=North British Railway (Superannuation Fund, &c.) Order 1911|Provisional Order to provide for a Superannuation Scheme for the salaried officers of the North British Railway Company in substitution for the North. British Railway Superannuation Fund established under the provisions of the North British Railway Act 1875. }}\n|  relating to Dunfermline and District Tramways.|po1=Dunfermline and District Tramways Order 1911|Provisional Order to extend the time for the construction of certain Tramways authorised by the Dunfermline and District Tramways Order 1906 to revive the powers and extend the time for the acquisition of Lands in connexion therewith and for other purposes.}}\n|  relating to Edinburgh Suburban Electric Tramways.|po1=Edinburgh Suburban Electric Tramways Order 1911|Provisional Order to extend the time for the construction of the tramways and street works authorised by the Edinburgh Suburban Electric Tramways Order 1906 to revive the powers and extend the time for the acquisition of lands in connexion therewith and for other purposes.}}\n|  relating to Paisley District Tramways.|note4=|po1=Paisley District Tramways Order 1911|Provisional Order to regulate the issue of the share capital of the Paisley District Tramways Company and for other purposes.}}\n|  relating to Partick Burgh.|po1=Partick Burgh Order 1911|Provisional Order to provide for the application of certain sums of money belonging to the burgh of Partick to enable the Town Council of that burgh to raise money by bills to constitute a dean of guild court for the burgh to enlarge the powers of the Town Council in relation to their electricity undertaking to amend the Burgh Police (Scotland) Acts and other Acts in their application to the burgh to confer further powers on the Town Council and for other purposes.}}\n-\n|  relating to Wellpark (Glasgow) Church and Parish Quoad Sacra.|po1=Wellpark (Glasgow) Church and Parish Quoad Sacra Order 1911|Order to authorise the annexation of Wellpark Parish Quoad Sacra Glasgow to one or more of the adjoining parishes the sale of the Church of that Parish the application of the endowments and the price of the Church to the endowment of a new parish and the provision of a Church for such new parish and other matters relating to these objects.}}\n|\n|po2=County of Kilkenny Order 1911|Provisional Order made in pursuance of Article 22 of the Local Government (Application of Enactments) Order 1898.\n|po3=County of Tipperary (North Riding) Order 1911|Provisional Order made in pursuance of Article 22 of the Local Government (Application of Enactments) Order 1898.\n|po4=County of Waterford Order 1911|Provisional Order made in pursuance of Article 22 of the Local Government (Application of Enactments) Order 1898. }}\n|\n|\n|  in the matter of a proposed drainage district in the Parishes of Minsterworth and Highnam Over and Linton in the County of Gloucester.|note4=|po1=In the matter of a proposed Drainage District in the Parishes\nof Minsterworth and Highnam Over and Linton in the County of Gloucester.|po1short=n}}\n|  in the matter of a proposed drainage district in the Parishes of West Butterwick Owston and Belton in the County of Lincoln.|note4=|po1=In the matter of a proposed Drainage. District in the Parishes of West Butterwick Owston and Belton in the\nCounty of Lincoln.|po1short=n}}\n|  in the matter of a proposed drainage district in the Parishes of Billingborough and Birthorpe (detached) in the County of Lincoln.|note4=|po1=In the matter of a proposed Drainage District in the Parishes of Billingborough and Birthorpe (detached) in the\nCounty of Lincoln.|po1short=n}}\n| |note4=|po1=Order made by the Secretary of State under the Metropolitan Police Act 1886.|po1short=n}}\n|  relating to the River Derwent and other waters.|po1=Derwent Fisheries Provisional Order 1911|Derwent Fisheries Provisional Order 1911.}}\n|  relating to the River Severn and other waters.|po1=Severn Fisheries Provisional Order 1911|Severn Fisheries Provisional Order 1911.}}\n-\n|  the Fulwood Local Board Act 1885 and the Fulwood Local Board (Water) Act 1894.\n|po2=Scarborough Order 1911|Provisional Order for partially repealing and altering the Scarborough Valley Bridge Company's Act 1864.\n|po3=Sowerby Bridge Order 1911|Provisional Order for altering the Sowerby Bridge Gas Act 1861 the Sowerby Bridge Local Board Act 1863 the Local Government Board's Provisional Orders Confirmation (No. 8) Act 1884 and the Local Government Board's Provisional Orders Confirmation (No. 6) Act 1894.\n|po4=Stockton-on-Tees Order 1911|Provisional Order for altering the Stockton Gas Act 1857 the Stockton Gas Act 1866 the Stockton Gas Act 1873 and the Stockton-on-Tees Corporation (Gas) Act 1893.\n}}\n|\n|po2=Epsom Rural Order 1911|Provisional Order to enable the Rural District Council of Epsom to put in force the Compulsory Clauses of the Lands Clauses Acts.\n|po3=Exeter Order 1911|Provisional Order to enable the Urban Sanitary Authority for the City and County of the City of Exeter to put in force the Compulsory Clauses of the Lands Clauses Acts.\n|po4=Liverpool Order 1911|Provisionat Order for altering the Liverpool Improvement Act 1867 the Liverpool Corporation Act 1902 the Liverpool Corporation (General Powers) Act 1905 and the Liverpool Corporation (Streets and Buildings) Act 1908.\n|po5=Pontypridd Order 1911|Provisional Order for altering the Pontypridd Urban District Council Act 1903 and the Pontypridd Urban District Council Act 1907.\n|po6=East Dean and United Districts Joint Hospital Order 1911|Provisional Order for forming a United District under Section 279 of the Public Health Act 1875. }}\n|\n|po2=Padiham Order 1911|Provisional Order for altering the Padiham Local Board Act 1876 and the Padiham Urban District Council Act 1908.\n|po3=Plymouth Order 1911|Provisional Order for partially repealing and altering the Plymouth Corporation Act 1887.\n|po4=Skipton Order 1911|Provisional Order for altering the Skipton Water and Improvement Act 1904.\n|po5=Weston-super-Mare Order 1911|Provisional Order for altering the Weston-super-Mare Improvement Commissioners Water Act 1878 and the Weston-super-Mare Improvement Act 1887. }}\n|\n|po2=Torquay Order 1911|Provisional Order for altering the Torquay Corporation Water Act 1903.\n|po3=Tottenham Order 1911|Provisional Order for altering the Tottenham Local Board Act 1890.\n|po4=Wolverhampton Order 1911|Provisional Order for altering the Wolverhampton Improvement Act 1869.\n|po5=Whaley Bridge Joint Sewerage Order 1911|Provisional Order for altering a Confirming Act. }}\n|\n|po2=Bury (Extension) Order 1911|Provisional Order made in pursuance of Sections 54 and 59 of the Local Government Act 1888. }}\n|\n|  the Burton-upon-Trent Improvement Act 1878 and the Burton-upon-Trent Corporation Act 1896.\n|po2=Colwyn Bay and Colwyn Order 1911|Provisional Order for altering the Colwyn Bay and Colwyn Urban District Council Act 1902.\n|po3=Kingston-upon-Thames Order 1911|Provisional Order for altering the mode of defraying the expenses of an Urban District Council and for partially repealing and altering the Kingston-upon-Thames Improvement Act 1855.\n|po4=Leigh Order 1911|Provisional Order for partially repealing and altering a Local Act and certain Confirming Acts.\n|po5=Northallerton Order 1911|Provisional Order for altering the Northallerton Waterworks Acts 1891 and 1909. }}\n|  the Accrington District Gas and Water Board Act 1905 and the Accrington District Gas and Water Board Act 1906.\n|po2=Middlesex Districts Joint Small-Pox Hospital Order 1911|Provisional Order for altering certain Confirming Acts.\n|po3=South Staffordshire Joint Small-Pox Hospital Order 1911|Provisional Order for altering certain Confirming Acts.\n|po3=Swansea Rural Order 1911|Provisional Order for dissolving the Gower Road Special Drainage District.}}\n| |po1=Reading (Extension) Order 1911|Provisional Order made in pursuance of Sections 54 and 59 of the Local Government Act 1888. }}\n|  and the Hereford Improvement Act 1872.\n|po2=Lancaster Order 1911|Provisional Order for partially repealing and altering the Local Act 5 George IV. Cap. LXVI. the Lancaster Water and Improvement Act 1876 the Lancaster Corporation Act 1880 the Lancaster Corporation Act 1888 and the Lancaster Corporation Act 1900.\n|po3=Sudbury (Suffolk) Order 1911|Provisional Order for partially repealing and altering the Local Act 6 George IV. Cap. LXX and the Local Act 5 & 6 Victoria Cap. LXXXVII.\n|po4=Birmingham, Tame and Rea Main Sewerage Order 1911|Provisional Order for altering certain Confirming Acts.\n|po5=Peterborough Joint Cemetery Order 1911|Provisional Order for repealing the Peterborough Improvement and Cemetery Act 1850 and for forming a United District under Section 279 of the Public Health Act 1875.\n}}\n-\n|  the Milford Improvement Act 1869 and certain Confirming Acts.}}\n|  and the Gas and Water Works Facilities Act 1870 Amendment Act 1873.\n|po2=Liverpool Corporation (Fazakerley) Gas Order 1911|Provisional Order under the Gas and Water Works Facilities Act 1870 and the Gas and Water Works Facilities Act 1870 Amendment Act 1873. }}\n|  and the Gas and Water Works Facilities Act 1870 Amendment Act 1873. }}\n|  relating to the yearly payment out of the Corporation Funds to the Corporation Schools in the Borough of Alnwick under section seven of the Alnwick Corporation Act 1882.|po1=Board of Education (Alnwick Corporation) Scheme 1911|Alteration of Alnwick Corporation Act 1882. }}\n|\n|\n|\n|  relating to Banff Gardenstown and Port Gordon.|po1=Banff Harbour Order 1911|Order for amending an Act passed in the Third and Fourth Years of the Reign of Her Majesty Queen Victoria relating to Banff Harbour and the Banff Harbour Order 1895 and for conferring further powers upon the Banff Harbour Trustees.\n|po2=Gardenstown Harbour Order 1911|Order for the Incorporation of a body of Trustees and the construction maintenance and regulation of Piers and Works at the Harbour of Gardenstown in the Parish of Gamrie in the County of Banff.\n|po3=Port Gordon Harbour Order 1911|Provisional Order for amending the rates authorised to be taken at the Harbour or Port of Port Gordon in the County of Banff and for other purposes connected therewith.}}\n|  relating to Brighton Portsmouth and Southend-on-Sea.|po1=Brighton Marine Palace and Pier Order 1911|Order authorising a widening of the Brighton Marine Palace and Pier in the County Borough of Brighton in the County of Sussex and for other purposes.\n|po2=Portsmouth Camber Dock and Flathouse Wharf Order 1911|Provisional Order empowering the Corporation of Portsmouth to construct subsidiary works in connexion with the Camber Dock and Flathouse Wharf and to levy rates and dues and for other purposes.\n|po3=Southend-on-Sea Loading Pier Order 1911|Provisional Order for authorising the construction of a loading pier or jetty at Southend-on-Sea in the County of Essex and the abandonment of the existing loading pier and for other purposes.}}\n|  relating to Cullen.|po1=Cullen Harbour Order 1911|Order for the transfer from the Cullen Harbour Commissioners incorporated under the Cullen Harbour Orders 1884 and 1886 as confirmed by the Pier and Harbour Orders Confirmation Acts 1884 and 1886 and the Acts incorporated therewith of the undertaking known as the Cullen Harbour and certain lands and other subjects in the vicinity thereof to the Provost Magistrates and Councillors of the Royal Burgh of Cullen in the County of Banff to confer powers on the Town Council with reference to the holding maintenance management and improvement of the said Harbour and to authorise the Town Council to borrow money for the purposes of the said Harbour and otherwise and for other purposes.}}\n-\n|  and 1888 relating to Accrington (Extension) Aldeburgh Ashford Blandford Forum Budleigh Salterton Carlisle (Extension) Chichester (Extension) Cirencester Leominster and Newcastle upon Tyne (Extension).|po1=Accrington Corporation Electric Lighting (Extension) Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Accrington in respect of the Urban District of Clayton-le-Moors and the Parish of Altham in the Rural District of Burnley both in the County of Lancaster.\n|po2=Aldeburgh Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to Messrs. Christy Brothers and Company Limited in respect of the Borough of Aldeburgh in the County of Suffolk.\n|po3=Ashford Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the East Kent Electric Supply Company Limited in respect of the Urban District of Ashford and portions of the Rural District of East Ashford all in the County of Kent.\n|po4=Blandford Forum Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to Messrs. J. and W. Purves in respect of the Borough of Blandford Forum in the County of Dorset.\n|po5=Budleigh Salterton Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to John Archibald Purves and William Thompson Purves in respect of the Urban District of Budleigh Salterton in the County of Devon.\n|po6=Carlisle Corporation Electric Lighting (Extension) Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Citizens of the City of Carlisle in respect of part of the Rural District of Carlisle in the County of Cumberland.\n|po7=Chichester Electric Lighting (Extension) Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Chichester Electric Light and Power Company Limited in respect of portions of the Rural Districts of Westhampnett and Westbourne in the County of Sussex.\n|po8=Cirencester Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to James Herbert Edwards in respect of the Urban District of Cirencester in the County of Gloucester.\n|po9=Leominster Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to James Herbert Edwards in respect of the Borough of Leominster in the County of Hereford.\n|po10=Newcastle-upon-Tyne (Kenton Extension) Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Newcastle-uроп-Тyne Electric Supply Company Limited in respect of an Extension of their existing Area of Supply to include that portion of Kenton which is now included in the City\nand County of Newcastle-upon-Tупe.}}\n|  and 1888 relating to Macclesfield Pateley Bridge Portishead and District Rhondda Salisbury (Extension) Wimbledon (Extension) and Witney.|po1=Macclesfield Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the New Electricity Company of Macclesfield Limited in respect of the Municipal Borough of Macclesfield in the County of Chester.\n|po2=Pateley Bridge Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to Messieurs Christy Brothers and Company Limited in respect of parts of the Parishes of Bewerley and High and Low Bishopside in the Rural District of Pateley Bridge in the West Riding of the County of York.\n|po3=Portishead and District Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to Messieurs Christy Brothers and Company Limited in respect of the Urban District of Portishead and the Parishes of Portbury Easton-in-Gordano North Weston Abbotsleigh Clapton Wraxall Flax Bourton Long Ashton Nailsea Tickenham Weston-in-Gordano and part of the Parish of Walton-in-Gordano in the Rural District of Long Ashton all in the County of Somerset.\n|po4=Rhondda Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Rhondda Urban District Council in respect of the Rhondda Urban District in the County of Glamorgan.\n|po5=Salisbury (Extension) Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Salisbury Electric Light and Supply Company Limited in respect of part of the City of Salisbury part of the Parish of Bemerton in the Rural District of Wilton and part of the Parish of West Harnham in the Rural District of Salisbury and for the amendment of the Salisbury Electric Lighting Order 1895.\n|po6=Wimbledon Electric Lighting (Extension) Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Mayor Aldermen and Burgesses of the Borough of Wimbledon in respect of the Urban District of the Maldens and Coombe in the County of Surrey.\n|po7=Witney Urban District Council Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Witney in respect of the Urban District of Witney.}}\n|  and 1888 the Electric Lighting (Scotland) Act 1890 and the Electric Lighting (Scotland) Act 1902 relating to Alloa (Extension) the County of Fife certain Burghs and Parishes and Grangemouth (Amendment).|po1=Alloa Electric Lighting (Extension) Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 the Electric Lighting (Scotland) Act 1890 and the Electric Lighting (Scotland) Act 1902 to the Provost Magistrates and Councillors of the Burgh of Alloa in the County of Clackmannan in respect of the Burgh of Alloa.\n|po2=Fife Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 the Electric Lighting (Scotland) Act 1890 and the Electric Lighting (Scotland) Act 1902 to the Fife Tramway Light and Power Company Limited in respect to certain Burghs and Parishes in the County of Fife.\n|po3=Grangemouth Electric Lighting (Amendment) Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 the Electric Lighting (Scotland) Act 1890 and the Electric Lighting (Scotland) Act 1902 to the Provost Magistrates and Councillors of the Burgh of Grangemouth in the County of Stirling amending the Grangemouth Electric Lighting Order 1905.}}\n|  and 1888 relating to Chepping Wycombe Extension Harrow and District Sandwich Deal and Walmer and Sevenoaks.|po1=Chepping Wycombe (Extension) Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Wycombe (Borough) Electric Light and Power Company Limited in respect of part of the Borough of Chepping Wycombe and the Parishes of West Wycombe Chepping Wycombe Rural and Hughenden all in the Rural District of Wycombe and for the amendment of the Chepping Wycombe Electric Lighting Order 1894.\n|po2=Harrow and District Electric Supply Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Harrow Electric Light and Power Company Limited in respect of portions of the Urban District of Wealdstone in the County of Middlesex and for connecting that Company's generating station in Harrow-on-the-Hill with the said Urban District.\n|po3=Sandwich Deal and Walmar Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Sandwich Deal and Walmer Electricity Supply Company Limited in respect of the Boroughs of Sandwich and Deal and the Urban District of Walmer all in the County of Kent.\n|po4=Sevenoaks Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Urban District Council of Sevenoaks in respect of the Urban District of Sevenoaks in the County of Kent.}}\n|  and 1888 relating to Donaghadee.|po1=Donaghadee Electric Lighting Order 1911|Provisional Order granted by the Board of Trade under the Electric Lighting Acts 1882 and 1888 to the Donaghadee Urban District Council in respect of the Urban District of Donaghadee in the County of Down.}}\n|  relating to the definition of dues for the purposes of the first election of members of the Port of London Authority under that Act.|note4=|po1=Port of London (First Election of Members) Order 1911|Provisional Order pursuant to paragraph (18) of Part IV. of the First Schedule to the Port of London Act 1908 relating to the definition of dues for the purposes of the first election of members of the Port of London Authority under that Act.}}\n|  relating to Alfreton Gas Barnstaple Gas Burnham Gas and Launceston Gas.|po1=Alfreton Gas Order 1911|Order empowering the Alfreton Gas Company to acquire additional land and to construct additional works for the manufacture and storage of gas and residual products.\n|po2=Barnstaple Gas Order 1911|Order empowering the Barnstaple Gas Company to extend their limits of supply to raise additional capital and for other purposes.\n|po3=Burnham Gas Order 1911|Order empowering the Burnham Gas Company Limited to maintain and continue gasworks and to manufacture and supply gas within the Urban District of Burnham-on-Crouch and the parishes of Creeksea Althorne and Latchingdon in the Rural District of Maldon all in the County of Essex and for other purposes.\n|po4=Launceston Gas Order 1911|Order empowering the Launceston Gas Company Limited to maintain and continue gasworks and to manufacture and supply gas within the Borough of Launceston and parts of the Parishes of St. Thomas the Apostle Rural and St. Stephen by Launceston Rural in the Rural District of Launceston all in the County of Cornwall and for other purposes.}}\n|  relating to Cannock Gas Clay Cross Gas Hythe and Sandgate Gas Lichfield Gas and Witney and District Gas.|po1=Cannock Gas Order 1911|Order empowering the Cannock Hednesford and District Gas Company Limited to supply gas in part of the Parish of Norton-under-Cannock known as Norton Canes the Townships of Shareshill Saredon Hatherton and Huntington and the Hazleslade Ward of the Parish of Brereton all in the County of Stafford to raise additional capital and for other purposes.\n|po2=Clay Cross Gas Order 1911|Order empowering the Undertakers of the Clay Cross Gas Order 1902 to extend their limits of supply to raise additional Capital and for other purposes.\n|po3=Hythe and Sandgate Gas Order 1911|Order empowering the Hythe and Sandgate Gas Company to raise Additional Capital and for other purposes.\n|po4=Lichfield Gas Order 1911|Order extending the limits of supply of the Lichfield Gas Company and for other purposes.\n|po5=Witney and District Gas Order 1911|Order empowering the Witney Gas and Coke Company Limited to maintain and continue their existing gasworks at Witney and to construct and maintain further works and to manufacture store and supply gas to and within the Parish and Urban District of Witney and certain other parishes and places all in the County of Oxford.}}\n|  relating to Holyhead Gas Llangefni Gas Llanrwst Gas and Pwllheli Gas.|po1=Holyhead Gas Order 1911|Order authorising the maintenance and continuance of existing gasworks and the manufacture and supply of gas within the urban district of Holyhead and part of the rural district of Valley both in the county of Anglesey and for other purposes.\n|po2=Llangefni Gas Order 1911|Order authorising the maintenance and continuance of existing gasworks and the manufacture and supply of gas within the urban district of Llangefni in the county of Anglesey and for other purposes.\n|po3=Llanrwst Gas Order 1911|Order authorising the maintenance and continuance of existing gasworks and the manufacture and supply of gas within the urban district of Llanrwst in the county of Denbigh and for other purposes.\n|po4=Pwllheli Gas Order 1911|Order authorising the maintenance and continuance of existing Gasworks and the Manufacture and Supply of Gas within the Borough of Pwllheli and Parish of Denio in the County of Carnarvon and for other purposes.}}\n|  relating to Busby and District Gas Longford Gas Preston Gas and Uxbridge Gas.|po1=Busby and District Gas Order 1911|Order empowering the Busby and District Gas Company Limited to maintain and continue their existing gasworks in the parishes of Cathcart and Mearns in the county of Renfrew and to supply gas within part of the parish of Mearns in the said county and within parts of the parishes of East Kilbride and Carmunnock in the county of Lanark and for other purposes.\n|po2=Longford Gas Order 1911|Order empowering the Longford District Gas Company Limited to maintain and continue gasworks and to manufacture and supply gas within the urban district of Longford and adjacent parishes in the county of Longford and for other purposes.\n|po3=Preston Gas Order 1911|Order authorising the Preston Gas Company to reduce the illuminating power of their gas and for other purposes.\n|po4=Uxbridge Gas Order 1911|Order extending the limits of supply of the Uxbridge Gas Company and empowering that company to maintain continue and enlarge existing gasworks and to supply gas in certain parishes in the counties of Buckingham and Hertford and for other purposes.}}\n-\n|  relating to Blandford Water Gisborough Water North Pembrokeshire Water and Gas Sheringham Gas and Water and West Gloucestershire Water.|po1=Blandford Water Order 1911|Order extending the limits of supply of the Blandford Waterworks Company Limited authorising the Company to raise additional capital and for other purposes.\n|po2=Gisborough Water Order 1911|Order conferring further powers upon the Undertakers of the Gisborough Water Undertaking and amending the Gisborough Water Order 1871 and the Gisborough Water Order 1880.\n|po3=North Pembrokeshire Water and Gas Order 1911|Order empowering the North Pembrokeshire Water and Gas Company to raise unissued capital by preference shares and for other purposes.\n|po4=Sheringham Gas and Water Order 1911|Order empowering the Sheringham Gas and Water Company to raise Additional Capital and for other purposes.\n|po5=West Gloucestershire Water Order 1911|Order authorising the West Gloucestershire Water Company to take a supply of Water in bulk and to make agreements with reference thereto and for other purposes.}}\n|  relating to Dartford and District Tramways and Dewsbury Corporation Tramways.|po1=Dartford and District Tramways Order 1911|Order authorising Balfour Beatty and Co. Limited to construct Tramways in the Parishes of Stone and Swanscombe in the Rural District of Dartford in the County of Kent and for other purposes.\n|po2=Dewsbury Corporation Tramways Order 1911|Order authorising the Mayor Aldermen and Burgesses of the Borough of Dewsbury to construct an additional Tramway in their Borough.}}\n| |note4= }}\n|\n|\n|\n|\n|\n|  relating to Stonehaven Harbour Stonehaven Harbour.|note4=|po1=Stonehaven Harbour Order 1911|Provisional Order to revive the powers and extend the time for the construction of Works at the Harbour of Stonehaven in the County of Kincardine authorised by the Stonehaven Harbour Order 1891 and extended by the Stonehaven Harbour Orders 1896 and 1905 to grant additional borrowing powers to the Trustees and for other purposes.}}\n|\n-\n|\n|  relating to Kelso Water.|po1=Kelso Water Order 1911|Provisional Order to authorise the Provost Magistrates and Councillors of the Burgh of Kelso to provide an additional water supply and to construct and maintain new waterworks and for other purposes.}}\n|  relating to the Glasgow and South Western Railway.|po1=Glasgow and South Western Railway Order 1911|Provisional Order for conferring further powers on the Glasgow and South Western Railway Company for the construction of works and the acquisition of lands for empowering the Company to create and substitute debenture stock of the Company for the shares of the Ayr and Maybole Junction Railway Company for dissolving that company and for other purposes.}}\n|  relating to Lerwick Harbour.|po1=Lerwick Harbour Order 1911|Provisional Order to authorise the erection of New Works by the Trustees of the Port and Harbour of Lerwick to authorise the Trustees to borrow money and to levy Tonnage Dues and for other purposes.}}\n|\n|po2=Sheffield (Extension) Order 1911|Provisional Order made in pursuance of Sections 54 and 59 of the Local Government Act 1888. }}\n|\n|po2=Southport (Extension) Order 1911|Provisional Order made in pursuance of Sections 54 and 59 of the Local Government Act 1888. }}\n|  relating to Ullapool.|po1=Ullapool Pier Order 1911|Provisional Order for the Construction Maintenance and Regиlation of Piers and Works at Ullapool in the Parish of Lochbroom in the County of Ross and Cromarty and for other purposes.}}\n|\n|\n|\n-\n|\n}}\nPrivate and personal acts\n| |private|2|16-12-1911|repealed=n|archived=n|An Act to remove doubts as to the nationality of Richard Maximilian Baron Acton and his issue.}}\n| |private|3|16-12-1911|repealed=n|archived=n|An Act to dissolve the marriage of Josephine Turner Maxwell of Crinken Abbey Shankill in the county of Dublin with Henry Pendleton Maxwell her husband and to enable her to marry again and for other purposes.}}\n| |private|4|16-12-1911|repealed=n|archived=n|An Act to dissolve the marriage of Alexander John McDonnell Pilkington of 14 Herbert Place in the city of Dublin in Ireland Esquire with Dorothy Pilkington his wife and to enable him to marry again and for other purposes.}}\n| |private|5|16-12-1911|repealed=n|archived=n|An Act to dissolve the marriage of Herbert Watson of Mount Nephin Newtownbreda in the county of Down in Ireland Esquire Bachelor of Engineering with Rosanna Gertrude Watson his now wife and to enable him to marry again and for other purposes.}}\n}}\nSources\n*  |via=Google Books}}\n*  |via=Google Books}}\nSee also\n*List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}