{
  "content": [
    {
      "type": "text",
      "text": "# List of heritage buildings in Perth, Western Australia\n\nPerth, Western Australia was occupied by British settlers in 1829 and originally named the Swan River Colony. Many of the older buildings are still extant, and have been heritage-listed. The places are listed here in chronological order and include significant buildings in the Perth metropolitan area.  Included are examples of governmental, religious, residential, commercial and institutional buildings. Places of identified heritage significance in metropolitan and regional Western Australia are listed in the official \"InHerit\" database which includes the State Register of Heritage Places, local government inventories and other lists, the Australian Government's heritage list, and other non-government lists and surveys.\nWestern Australia’s settlements struggled in the 1800s from lack of resources, labour and investment. The gold rushes of the 1890s brought a great influx of people from interstate and overseas, and considerable development arising from the new wealth. Many ornate and substantial buildings were constructed in the metropolitan area from the 1890s to the early-mid 1900s, including the Palace Hotel, Perth, the Esplanade Hotel, Fremantle, His Majesty's Theatre, Perth and the Old Perth Technical School.\nIn the late 1950s, a group of individuals who were concerned for the need to \"preserve our heritage\" came together to form the National Trust of Australia (WA) in 1959. The National Trust’s mandate was to educate the public on the importance of valuing our landscapes. At this time, there was no legislation or a statutory body in WA to formally recognise and protect heritage places. The National Trust was able to promote and bring attention to the significance of the state's heritage places including natural landscapes and buildings which were supported by heritage assessments of buildings with a classification system. In 1965, an Act of Parliament established the National Trust as a statutory body in WA and properties were able to be vested under the responsibility of the organisation.\nA mining boom in the 1960s-70s led to another wave of intensive development in Perth and as a result the city lost many of its early 1900s buildings, particularly along St Georges Terrace. From this time, a greater awareness in the community of the loss of heritage places developed as demonstrated by several high profile public campaigns for the Pensioner Barracks (now the Barracks Arch), the Palace Hotel on St Georges Terrace and the Swan Brewery.\nThe lack of statutory protection for heritage places was a serious issue in WA and it wasn’t until the adoption of the Heritage Act of WA 1990 and the formation of the Heritage Council that post-colonial heritage places were given recognition and statutory protection under the State Register of Heritage Places. This work is undertaken by the State Heritage Office which supports the Heritage Council and Minister for Heritage. Aboriginal heritage places are dealt with separately under the Aboriginal Heritage Act 1972.\nFurther, under the Heritage Act of WA 1990, each local government in Western Australia is required to compile a Municipal Heritage Inventory which identifies places of heritage significance within their municipality.\nThe National Trust of Australia (WA) since the early 1960s has maintained a List of Classified Places. Classification by the National Trust does not provide statutory protection; instead these assessments provide a record of heritage places (historic, natural and Aboriginal) and support the Trust’s education and advocacy programs. The National Trust's List of Classified Places can be searched via the \"inHerit\" website.\nThousands of places across Western Australia have been recognised for their heritage significance. The recognition, protection and conservation of these heritage places has developed from individuals and communities who value these places and understand the contribution they make to WA’s history, culture and environment.\nList\n{| class=\"wikitable\"\n|-\n!Building\n!Construction period\n!HCWAlink\n!Notes\n!Image\n|-\n!colspan=5 |\n1830s\n|-\n|The Round HouseFremantle\n|1830\n|\n|Built as a prison shortly after the establishment of the Swan River Colony in 1829.\n|\n|-\n|The Old MillSouth Perth\n|1835\n|\n|also known as ''Shenton's Mill''.  The original (1833) building was destroyed in 1834 and rebuilt.\n|\n|-\n|The Old Court HouseSupreme Court Gardens, Perth\n|Built between 1836 and 1837\n|\n|The city's oldest surviving public building.  Designed by Henry Willey Reveley.   , houses the Francis Burt Law Education Centre and Museum.\n|\n|-\n|Tranby HouseMaylands\n|Built in 1839\n|\n|Built by a group of devout Methodists known as the Tranby People who arrived in the Swan River Colony in 1830.\n|\n|-\n!colspan=5 |\n1840s\n|-\n|All Saints ChurchUpper Swan\n|Built between 1838 and 1840\n|\n|The oldest still-standing church in Western Australia.\n|\n|-\n|St John's Pro-Cathedral18 Victoria Avenue, Perth\n|Between 1843 and 1844\n|\n|The earliest Roman Catholic church building constructed in Western Australia.\n|\n|-\n|Shenton House\nCrawley\n|1846\n|\n|Substantial house built in 1846. Now part of the University of Western Australia campus and home to the School of Indigenous Studies.\n|\n|-\n!colspan=5 |\n1850s\n|-\n|Old Perth Boys School139 St Georges Terrace, Perth\n|1854\n|\n|Taken over by the Technical College in 1898 - owned by the National Trust of Australia (WA).\n|\n|-\n|Royal Perth Hospital\n|1855\n|\n|\n|\n|-\n|Perth GaolNorthbridge, behind Western Australian Museum\n|Built in 1856\n|\n|\n|\n|-\n|The Cloisters200 St Georges Terrace, Perth\n|Built in 1858\n|\n|Designed by Richard Roach Jewell for Bishop Mathew Blagden Hale.  Served as W.A.'s first boys' secondary school\n|\n|-\n|Fremantle PrisonFremantle\n|Between 1852 and 1859\n|\n|\n|\n|-\n|The DeaneryCorner of St Georges Terrace and Pier Street, Perth\n|Built in 1859\n|\n|Built as a residence for the first Dean of Perth.\n|\n|-\n|Bishop's HouseCorner Spring Street and Mounts Bay Road, Perth.\n|Built in 1859\n|\n|Residence of Bishop Mathew Blagden Hale\n|\n|-\n!colspan=5 |\n1860s\n|-\n|Archbishop's Palace41 Victoria Square, Perth\n|First stage completed 1860\n|\n|Built by Bishop Joseph Serra who became Catholic Bishop of Perth\n|\n|-\n|Barracks Arch266 St Georges Terrace, Perth\n|Built in 1863\n|\n|The former Barracks were built to house the retired Pensioner Forces.  The two wings on each side of the entrance were demolished in the 1960s to make way for the Mitchell Freeway. The Government of the day—led by David Brand—intended to demolish the entire structure, but public outrage forced a compromise and the arch was saved.\n|\n|-\n|Government HouseSt Georges Terrace, Perth\n|Between 1859 and 1864\n|\n|Official residence of the Governor of Western Australia\n|\n|-\n|Fremantle Arts CentreFinnerty Street, Fremantle\n|Between 1861 and 1864\n|\n|Originally built as the Fremantle Lunatic Asylum\n|\n|-\n|Trinity Church72 St Georges Terrace, Perth\n|Partly obscured Trinity Congregational Chapel was built in 1865. The Church (foreground) was built in 1897.\n|\n|Chapel designed by Richard Roach Jewell. Hosted the first meeting of the Karrakatta Club in 1894.\n|\n|-\n|St Mary's Cathedral41 Victoria Square, Perth\n|Western end was begun in 1865\n|\n|\n|\n|-\n!colspan=5 |\n1870s\n|-\n|Perth Town HallCorner Barrack and Hay Streets, Perth\n|Between 1868 and 1870\n|\n|Built using convict labour\n|\n|-\n|Wesley Church75 William Street, corner Hay Street\n|1870\n|\n|\n|\n|-\n|St Mary's ChurchMiddle Swan\n|1870\n|\n|Located near the site of an earlier octagonal church which had been built in 1839\n|\n|-\n|Central Government OfficesBarrack Street, Perth\n|1874\n|\n|The former Treasury buildings and Titles Office buildings bounded by Barrack St, St Georges Tce and Cathedral Avenue were originally Perth's GPO, which was moved by the Commonwealth to the Forrest Place building in 1923.\n|\n|-\n!colspan=5 |\n1880s\n|-\n|Royal Hotel, Perth300 Murray Street\n|1882\n|\n|Part of Raine Square\n|\n|-\n|Fremantle Grammar School200 High Street, Fremantle\n|1885\n|\n|Established by Henry Briggs as an Anglican public school\n|\n|-\n|Fremantle Town Hall8 William Street, Fremantle\n|1887\n|\n|\n|\n|-\n|Court HotelBeaufort Street, Northbridge\n|1888\n|\n|\n|\n|-\n|nowrap|St George's Cathedral2 Cathedral Avenue, Perth\n|Completed in 1888\n|\n|Currently undergoing a major renovation\n|\n|-\n!colspan=5 |\n1890s\n|-\n|St George's House235-239 St Georges Terrace, Perth\n|1892\n|\n|designed by Talbot Hobbs\n|\n|-\n|The Weld Club4 Barrack Street, Perth\n|1892\n|\n|designed by Talbot Hobbs\n|\n|-\n|Perth Railway StationWellington Street, Perth\n|1893 to 1894\n|\n|designed by George Temple-Poole\n|\n|-\n|Theatre Royal & Metropole Hotel637-645 Hay St\n|1894-97\n|\n|\n|\n|-\n|The Palace HotelWilliam Street and St Georges Terrace, Perth\n|1896\n|\n|Currently offices for Bank of Western Australia\n|\n|-\n|The Esplanade HotelMarine Terrace, Fremantle\n|1896\n|\n|\n|\n|-\n|Beaufort Street Terraces235-241 Beaufort Street, Highgate\n|1897\n|\n|Currently used as doctors' and dentists' surgeries, and private residences\n|\n|-\n|Fremantle MarketsMarket Street, Fremantle\n|Commenced in 1897\n|\n|Design - H.J. Eales and Charles Oldham.\n|\n|-\n|Tom Burke House191-195 Newcastle Street, Northbridge\n|c.1898\n|\n|designed & initially occupied by Louis Bowser Cumpston\n|\n|-\n|Perth Mint310 Hay Street, Perth\n|Foundation stone was laid in 1896 and competed in 1899\n|\n|Australia's oldest operating mint\n|\n|-\n|Old Perth Observatory4 Havelock St, West Perth\n|Construction completed 1896 and officially opened in 1900\n|\n|National Trust, WA branch Headquarters.  Design - George Temple-Poole\n|\n|-\n|Jubilee BuildingNorth Perth\n|completed in 1899\n|\n|Part of the Western Australian Museum\n|\n|-\n|The CliffePeppermint Grove\n|constructed in 1894\n|\n|designed by Talbot Hobbs\n|\n|-\n!colspan=5 |\n1900s\n|-\n|The Old Perth Fire StationPerth\n|1900\n|\n|First purpose-built fire station in WA, operated until 1979. Now the FESA Fire Safety Education Centre & Museum\n|\n|-\n|His Majesty's TheatrePerth\n|1904\n|\n|Constructed at the time of the Western Australian gold rush, it was the largest theatre in Australia, and had seating for over 2,500 people. It is believed to be the only remaining working Edwardian theatre in Australia.\n|\n|-\n|The North Mole LighthouseFremantle\n|1906\n|\n|This cast iron light tower, together with its southern twin, are the only remaining navigation lights of this design in this State.\n|\n|-\n!colspan=5 |\n1910s\n|-\n|The Old Perth Technical SchoolPerth\n|1910\n|\n|First tertiary-education institution in WA.  Designed by Hillson Beasley and built on the site of Reveley's Tuscan mill.\n|\n|-\n|Wireless Hill Museum\n|1912\n|\n|Originally built as the Applecross Wireless Station\n|Wireless Hill Museum\n|-\n| The Albany Bell Castle\n|1914\n|\n| Bakehouse Factory, expression with considerable elaboration of details, towers, battlements, generous natural lighting and garden setting, is uncommon in the Western Australian community\n|\n|-\n|Anzac Cottage\n|1915\n|\n|\n|\n|-\n!colspan=5 |\n1920s\n|-\n|General Post Office, Perth\n|1923\n|\n|\n|\n|-\n|Young Australia League building\n|1924\n|\n|\n|\n|-\n!colspan=5 |\n1930s\n|-\n|Salvation Army Congress Hall (fmr)69 Murray Street, Perth\n|192930\n|\n|\n|\n|-\n|Atlas Building810 The Esplanade, Perth\n|1931\n|\n| Houses the Museum of Perth\n|\n|-\n|St Joseph's ChurchSubiaco\n|1933–1934\n|\n|Interwar Gothic church designed by Edgar Le Blond Henderson.\n|\n|-\n|First Church of Christ, Scientist, Perth\n|1939\n|\n|Art Deco church designed by Ochiltree & Hargrave\n|\n|}\nSee also\n*List of heritage places in Fremantle\n*History of Perth, Western Australia\n*:Category:Heritage places of Western Australia\nReferences\nFurther reading\n* Austen, Tom The Streets of Old Perth St George Books. 1988.\n* Le Page, J. S. H. Building a state : the story of the Public Works Department of Western Australia 1829-1985 Leederville, W.A : Water Authority of Western Australia, 1986.\n* Stannage, C. T ''The people of Perth : a social history of Western Australia's capital city''  Perth : Carroll's for Perth City Council, 1979.\n* Witcomb A and Gregory K From the Barracks to the Burrup: the National Trust in Western Australia University of New South Wales Press Ltd, Sydney. 2010.\nExternal links\n*[https://web.archive.org/web/20060618053019/http://www.perth.wa.gov.au/html/vis_pdffiles/Icons_Influence.pdf Perth.gov: Self-guided walking tour of listed buildings in Perth]\n*[http://www.heritage.wa.gov.au/ Western Australia Heritage Council website]"
    }
  ]
}