{
  "content": [
    {
      "type": "text",
      "text": "# List of international presidential trips made by Muhammadu Buhari\n\nMuhammadu Buhari became President following the 2015 Nigerian general election. The following is a list of international presidential trips made by Muhammadu Buhari as the 15th President of Nigeria.\nPresident Muhammadu Buhari has travelled out of Nigeria a total of 51 times since assuming office in 2015.\nSummary of International Trips\nHere is a summary of the countries President Muhammadu Buhari of Nigeria has visited as President. There are two trips that he made to the United Kingdom, one on his official vacation and one for medical treatment that are included in this list.\n{| class=wikitable\n|-\n!Number of visits\n!Country\n|-\n|1 visit\n|Belgium, Burkina Faso, Cameroon, Egypt, Guinea-Bissau, India, Iran, Japan, Liberia, Mali, Malta, Mauritania, Netherlands, Russia, Rwanda, Poland, Portugal, South Korea, Spain, Sudan, Togo, Turkey\n|-\n|2 visits\n|Benin, China, Côte d'Ivoire, Equatorial Guinea, Germany, Jordan, Morocco, Qatar\n|-\n|3 visits\n|Chad, Ghana, Kenya, Niger, South Africa, The Gambia, United Arab Emirates\n|-\n|4 visits\n|Senegal\n|-\n|5(+) visits\n|Ethiopia (6), France (5), Saudi Arabia (5), United Kingdom (5), United States (11)\n|}\n2015\nThe following is a list of international presidential trips made by Buhari in 2015.\n{| class=\"wikitable outercollapse sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=150|Country\n! width=120|Areas visited\n!width=100|Date(s)\n!width=150|Purpose(s)\n!width=550|Notes\n|-\n|\n|Niamey\n|3 June\n|Anti-Boko Haram summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari travels to Niamey along with presidents of Cameroon to discuss the operation against the insurgency created by the Boko Haram in the Lake Chad region. Nigeria committed to relocate their military command centre to Maiduguri and further support the rebuilding of the infrastructure in Borno State.\n|}\n|-\n|\n|N'Djamena\n|4 June\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|After the summit in Niger, Buhari makes a one-day visit to Chad to further discuss with Idriss Déby regarding the Boko Haram counter insurgency plan. Buhari is directly welcomed by Idriss Deby at N'Djamena International Airport.\n|}\n|-\n|\n|Munich\n|7 – 8 June\n|42nd G7 summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari presented his \"wishlist\" to the G7 members, in help to combat terrorism in Nigeria and in help to revive the Nigerian economy. Buhari met Angela Merkel, French president François Hollande, Canadian prime minister Stephen Harper, Japanese prime minister Shinzō Abe and World Bank President Jim Yong Kim at the sidelines of the summit.\n|}\n|-\n|\n|Johannesburg\n|12 – 13 June\n|25th African Union Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the 25th African Union Summit on Security. Terrorism was a key discussion topic and Buhari held a number of bilateral talks with various heads of state on the sidelines.\n|}\n|-\n|\n|Washington, D.C.\n|19 – 23 July\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari held talks with various high level US officials and on 20 July had a private meeting with Barack Obama. Buhari sought US help in the combat against terrorism in Nigeria and asked for further military assistance in terms of technology and intelligence.\n|}\n|-\n|\n|Yaoundé\n|29 – 30 July\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari's visit was focused on the continued fight against Boko Haram in the Lake Chad region and Buhari discusses strategies with Cameroon president Paul Biya. Cameroon also raises the issue that the Cameroonian Military did not enjoy the freedom to enter Nigeria soil to fight the insurgency; while both Niger and Chad did.\n|}\n|-\n|\n|Cotonou\n|2 – 3 August\n|Independence Celebrations\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attended Benin's 55 years of independence celebration. He also held talks with Thomas Boni Yayi with regards to the Boko Haram insurgency after Benin increased the number of troops in its task force against the terrorist group.\n|}\n|-\n|\n|Accra\n|7 September\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari makes a one-day official visit to hold bilateral talks with president of Ghana John Dramani Mahama. Buhari tries to discuss the repatriation of Nigerian funds, that allegedly the previous administration had stolen and stashed in Ghana. Further trade and regional security were also discussed.\n|}\n|-\n|\n|Paris\n|14 – 16 September\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari's main agenda for the visit was to increase bilateral trade and seek closer ties against the fight against terrorism in Nigeria.  Buhari met with François Hollande with regards to oil and defence in Nigeria.\n|}\n|-\n|\n|New York City\n|24 – 29 September\n|70th session of the United Nations General Assembly\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari makes his first visit to the UN headquarters in New York. He holds various bilateral talks with Barack Obama, François Hollande and other high level leaders. Buhari also attended the World Leaders summit on violent extremism.\n|}\n|-\n|\n|New Delhi\n|26 – 30 October\n|Third India Africa Forum Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the Third India Africa Forum summit hosted by Narendra Modi. It was the biggest India-Africa summit ever with representatives from all 54 African countries.\n|}\n|-\n|\n|Khartoum\n|30 October\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|On the way back from the India-Africa forum, Buhari makes quick stop in Khartoum. Buhari held bilateral talks.\n|}\n|-\n|\n|Tehran\n|22 – 24 November\n|3rd Gas Exporting Countries Forum\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari makes a 2-day state visit to attend the 3rd Gas Exporting Countries Forum. Buhari meets Nigerians living in Iran and had a private meeting with Ali Khamenei.\n|}\n|-\n|\n|Valletta\n|28 – 30 November\n|2015 Commonwealth Heads of Government summit.\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the 2015 Commonwealth Heads of Government Summit along with various other heads of state.\n|}\n|-\n|\n|Paris\n|30 November – 1 December\n|Paris Conference of Parties 21\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the Paris Conference on Climate change right after his visit to Malta. Buhari also gives a speech at the conference and promises that Nigeria will cut 20% of its emissions as part of the carbon reduction effort.\n|}\n|-\n|\n|Johannesburg\n|4 – 5 December\n|China Africa summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the China-Africa Corporation Forum. While in South Africa Buhari discussed with Jacob Zuma regarding the MTN $5.2&nbsp;billion fine and held talks to strengthen bilateral relationships.\n|}\n|}\n2016\nThe following is a list of international presidential trips made by Buhari in 2016. Buhari makes a trip to the United Kingdom in February 2016 & June 2016, however, they were not in an official capacity and were for routine medical checkups.\n{| class=\"wikitable outercollapse sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=150|Country\n! width=120|Areas visited\n!width=100|Date(s)\n!width=150|Purpose(s)\n!width=550|Notes\n|-\n|\n|Cotonou\n|8 January\n|11th summit of the Heads of State of the Niger Basin Authority\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the 11th summit of the Heads of State of the Niger Basin Authority. The summit focused on the water resources in the area and the new secretary general is elected.\n|}\n|-\n|\n|Abu Dhabi\n|17 – 20 January\n|World Future Energy Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the World Future Energy Summit. Various agreements were also signed with the UAE government, in terms of Trade and share intelligence against terrorism.\n|}\n|-\n|\n|Addis Ababa\n|26 January\n|26th Summit of African Union Heads of State and Government.\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the 26th Summit of African Union Heads of State and Government. The Summit focused on Peace and Security, which has been part of Buhari's main foreign policy agenda.\n|}\n|-\n|\n|Eldoret, Nairobi\n|27 – 29 January\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari arrived at Eldoret International Airport first, to join Uhuru Kenyatta president of Kenya and Hassan Sheikh Mohamud president of Somalia in the memorial service for Kenya Defence Forces soldiers that died in Somalia due to the Al-Shabaab insurgency. This is Buhari's first visit to East Africa and various trade agreements are drafted to promote intra-Africa trade which is the agenda of the Kenyan president. Furthermore, the laws in banking and taxation were reviewed.\n|}\n|-\n|\n|Strasbourg\n|2 – 4 February\n|Official Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari address the special session of the European Union Parliament with regards to the global fight against terrorism, extremism and corruption.\n|}\n|-\n|\n|Sharm El Sheikh\n|18 February\n|Sharm el-Sheikh 'Africa 2016’\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the Sharm El Sheikh conference that attracted over 1200 delegates. The conference aimed to build relationships between North Africa and Sub-Saharan Africa. Buhari's main focus during the summit was focused on eliminating terrorism to improve the investment atmosphere. Buhari also held bilateral talks with Abdel Fattah el-Sisi, president of Egypt with regards to military and economic co-operation.\n|}\n|-\n|\n|Riyadh, Jeddah, Mecca, Medina\n|22 – 27 February\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari was received by high level Saudi officials at the airport. Buhari was in Saudi Arabia to encourage Saudi investment into Nigeria and discuss trade agreements between the countries in terms of Oil and Shipping. Buhari meets the Saudi monarch, King Salman bin Abdulaziz al-Saud. Buhari also visits the two holy Islamic sites of Mecca and Medina.\n|}\n|-\n|\n|Doha\n|27 – 28 February\n|OPEC Meeting\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari visit Qatar for the OPEC meeting. Buhari also meets the Emir of Qatar, Sheikh Tamim bin Hamad Al Thani to discuss the recent oil price glut. Buhari stresses the co-operation needed between OPEC and non-OPEC members to sustain oil producing countries economies.\n|}\n|-\n|\n|Malabo\n|14 March\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari visit's Malabo to discuss with president Teodoro Obiang Nguema Mbasogo with regards to maritime security in the Niger Delta. The countries want to establish a joint task force to combat piracy and oil theft in the Gulf of Guinea.\n|}\n|-\n|\n|Washington, D.C.\n|30 March – 3 April\n|4th Nuclear Security Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the 4th Nuclear Security Summit.\n|}\n|-\n|\n|Beijing\n|11 – 14 April\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari and his team of Nigerian delegates discussed various deals and agreements totalling over $6&nbsp;billion. Various Nigerian and Chinese firms through the Nigeria-China business forum created bilateral agreements.\n|}\n|-\n|\n|London\n|13 May – 15 May\n|Anti-Corruption Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the first ever Anti-corruption summit in the United Kingdom. The summit attracted various heads of state from around Africa. Anti-corruption and terrorism have been the heart of the administrations agenda and the summit was vital to get international support.\n|}\n|-\n|\n|N'Djamena\n|8 August\n|Inauguration of Idris Deby\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|The President attended the Inauguration of Idris Deby along with various heads of state.\n|}\n|-\n|\n|Nairobi\n|27 – 28 August\n|Tokyo Conference on Africa\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the Sixth Tokyo International Conference on African Development. The conference promoted structural economic transformation through diversification and industrialisation.\n|}\n|-\n|\n|New York City\n|11 – 15 September\n|Seventy-first session of the United Nations General Assembly\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the Seventy-first session of the United Nations General Assembly.\n|}\n|-\n|\n|Berlin\n|13 – 16 October\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the Nigerian business forum in Germany and tries to increase economic ties between Germany and Nigeria. Buhari also held bilateral talks with Angela Merkel to increase economic and military ties between the country. Buhari made the official announcement that 21 Chibok girls were released and that the government was further negotiating the remaining girls release.\n|}\n|-\n|\n|Marrakesh\n|14 – 18 November\n|United Nations Climate Change conference\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attended the COP22 conference on climate change in Morocco.\n|}\n|-\n|\n|Dakar\n|5 – 7 December\n|Third Dakar International Forum on Peace and Security in Africa\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attended the Third Dakar International Forum on peace and Security in Africa. Along with various other leaders. Buhari also met some Nigerian diaspora based in Senegal.\n|}\n|-\n|\n|Banjul\n|13 December\n|ECOWAS summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari along with two other heads of state, Ellen Johnson Sirleaf and John Dramani Mahama, flew into Banjul to persuade Yahya Jammeh to follow the constitution and accept defeat in the country's election. The Economic Community of West African States leaders also met with Adama Barrow to discuss international involvement in the presidential transfer process.\n|}\n|}\n2017\nThe following is a list of international presidential trips made by Buhari in 2017. In January, May and September 2017, Buhari traveled to the United Kingdom, however, they were not in an official capacity and were for routine medical checkups.\n{| class=\"wikitable outercollapse sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=150|Country\n! width=120|Areas visited\n!width=100|Date(s)\n!width=150|Purpose(s)\n!width=550|Notes\n|-\n|\n|Accra\n|7 January\n|Inauguration of Nana Akufo-Addo\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the inauguration of Nana Akufo-Addo.\n|}\n|-\n|\n|Banjul\n|13 January\n|ECOWAS mediation meeting\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the mediation meeting along with other Economic Community of West African States leaders such as Macky Sall. The meeting was to help find a solution to the constitutional crisis left by Yahya Jammeh following the country's election. President elect Adama Barrow left with president Buhari and is to be escorted by West African leaders when his tenure begins.\n|}\n|-\n|\n|Bamako\n|13 – 14 January\n|27th Africa France Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the 27th Africa France Summit along with various other African leaders. The trip is made after the president makes a quick stop in The Gambia.\n|}\n|-\n|\n|New York City\n|17 – 20 September\n|Seventy-second session of the United Nations General Assembly\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the Seventy-second session of the United Nations General Assembly.\n|}\n|-\n|\n|Ankara, Istanbul\n|18 – 22 October\n|State Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari makes a 4 day state visit to Turkey to discuss bilateral issues with his counterpart Recep Erdoğan. Various issues with regards to security, aid and infrastructure were discussed. After the trip to Ankara, president Buhari attends the ninth D-8 Summit in Istanbul.\n|}\n|-\n|\n|Abidjan\n|28 – 30 November\n|5th EU-AU summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the Fifth AU-EU Summit.\n|}\n|-\n|\n|Amman\n|1 – 4 December\n|Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari and King Abdullah II of Jordan co-host the counter-terrorism summit. Both leaders agreed to strengthen counter-terrorism commitments between the two nations to help reduce violent extremism in West Africa.\n|}\n|}\n2018\nThe following is a list of international presidential trips made by Buhari in 2018.\n{| class=\"wikitable outercollapse sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=150|Country\n! width=120|Areas visited\n!width=100|Date(s)\n!width=150|Purpose(s)\n!width=550|Notes\n|-\n|\n|Addis Ababa\n|28 – 30 January\n|30th Summit of African Union Heads of State and Government.\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the 30th Summit of African Union Heads of State and Government. Buhari was named the 2018 Anti-Corruption Champion. Buhari also met with former Nigerian president Olusegun Obasanjo.\n|}\n|-\n|\n|London\n|19 – 20 April\n|2018 Commonwealth Heads of Government Meeting\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the Commonwealth Heads of Government meeting held in London. On the sidelines of the summit held discussions with the Shell Group with regards to increased investments in Nigeria.\n|}\n|-\n|\n|Washington D.C.\n|28 April – 4 May\n|Working Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari hold bilateral talks with his US counterpart Donald Trump. Buhari was the first African leader to make a state visit to the United States after Trump was elected in 2016. Security agreements and defense contracts were discussed between the two countries.\n|}\n|-\n|\n|Rabat\n|10 – 11 June\n|Working Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari undertook the first visit by a Nigerian Head of State to Morocco where he held bilateral talks with King Mohammed VI. The two leaders discussed issues with regards to agriculture, fertilized production and their commitment to the regional gas pipeline.\n|}\n|-\n|\n|Nouakchott\n|30 June – 3 July\n|31st Summit of African Union Heads of State and Government.\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the 31st Summit of African Union Heads of State and Government. Buhari spoke on ‘Winning the Fight against Corruption, A Sustainable Path to Africa's Transformation’ during the summit.\n|}\n|-\n|\n|The Hague\n|15– 18 July\n|20th Anniversary of the International Criminal Court\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari is a keynote speaker at the hearing commemorating the 20th anniversary of the International Criminal Court.\n|}\n|-\n|\n|Lomé\n|29 July\n|ECOWAS-ECCAS Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the ECOWAS-ECCAS Heads of State and Government Summit on Peace, Security, Stability and Fight against Terrorism and Violent Extremism. He urged the leaders for stronger inter-regional collaborate on maritime security and anti-terrorism activities.\n|}\n|-\n|\n|Beijing\n|1 – 7 September\n|7th Summit of the Forum on China–Africa Cooperation\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari along with various other African heads of state attended the China–Africa Cooperation Summit. President Buhari met with president Xi Jinping on the sidelines of the summit.\n|}\n|-\n|\n|New York City\n|23 – 29 September\n|Seventy-third session of the United Nations General Assembly\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the Seventy-third session of the United Nations General Assembly.\n|}\n|-\n|\n|Paris\n|10 – 16 November\n|1st Paris Peace Forum\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the first edition of the Paris Peace Forum along with 60 other world leaders at the invitation of French president Emmanuel Macron.\n|}\n|-\n|\n|Kraków\n|2 – 3 December\n|Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|24th session of the Conference of the Parties\n|}\n|-\n|\n|Niamey\n|25 December\n|60th proclamation anniversary of Niger\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the celebrations of the 60th proclamation anniversary of the Niger republic.\n|}\n|}\n2019\nThe following is a list of international presidential trips made by Buhari in 2019. Between May 16–21, Buhari made a personal trip to Saudi Arabia to attend Lesser Hajj.\n{| class=\"wikitable outercollapse sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=150|Country\n! width=120|Areas visited\n!width=100|Date(s)\n!width=150|Purpose(s)\n!width=550|Notes\n|-\n|\n|Dakar\n|2 April\n|Inauguration of Macky Sall\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attends the inauguration of President Macky Sall's second term in office.\n|}\n|-\n|\n|Amman\n|4 – 7 April\n|World Economic Forum Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attended the World Economic Forum on the Middle East and North Africa where he was a keynote speaker.\n|}\n|-\n|\n|Dubai\n|7 – 10 April\n|Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attended the annual Investment Meeting in Dubai.\n|}\n|-\n|\n|N'Djamena\n|13 April\n|Working Visit.\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari make a one-day visit to chad to attend the Extraordinary Session of the Conference of Heads of State and Government of the Community of Sahel-Saharan States to discuss regional security concerns.\n|}\n|-\n|\n|Jeddah\n|29 – 30 May\n|Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the Summit of the Organisation of Islamic Cooperation (OIC).\n|}\n|-\n|\n|Yokohama\n|28 – 30 August\n|Tokyo International Conference on African Development Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the seventh TICAD summit in Japan. During the summit, the president held bilateral talks with Prime Minister Shinzo Abe. Various MoUs were signed between the two countries. The president requested that Japan assist Nigeria to combat piracy and illegal fishing.\n|}\n|-\n|\n|Ouagadougou\n|14 – 15 September\n|ECOWAS Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the ECOWAS Extraordinary Summit on Counter Terrorism. Leaders from Chad, Cameroon and Mauritania attended the event to formulate a plan to address the spread of extremism in the region.\n|}\n|-\n|\n|New York City\n|21 – 26 September\n|Seventy-fourth session of the United Nations General Assembly\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the Seventy-fourth session of the United Nations General Assembly\n|}\n|-\n|\n|Pretoria\n|2 – 4 October\n|State Visit.\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari makes a three-day official visit to South Africa where he met with President Cyril Ramaphosa. The visit came after months of xenophobic attacks in South Africa directed against Nigerians and other African migrants.\n|}\n|-\n|\n|Sochi\n|21 – 23 October\n|Working Visit.\n|1st Russia-Africa Summit\n|-\n|\n|Riyadh\n|29 – 31 October\n(Buhari remained in Saudi until  1 November)\n|Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the third Future Investment Initiative business forum that was hosted by the Saudi Public Investment Fund. The event was hosted by King Salman bin Abdulaziz. After the summit, Buhari visited Jeddah to perform Hajj.\n|}\n|}\n2020\nThe following is a list of international presidential trips made by Buhari in 2020.\n{| class=\"wikitable outercollapse sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=150|Country\n! width=120|Areas visited\n!width=100|Date(s)\n!width=150|Purpose(s)\n!width=550|Notes\n|-\n|\n|London\n|18 – 23 January\n|Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the UK Africa Investment Summit 2020.\n|}\n|-\n|\n|Addis Ababa\n|7 – 8 February\n|33rd Summit of African Union Heads of State and Government.\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the 33rd Summit of African Union Heads of State and Government.\n|}\n|}\n2021\nThe following is a list of international presidential trips made by Buhari in 2021. In April 2021, Buhari made a visit to the United Kingdom, however, they were not in an official capacity and were for routine medical checkups.\n{| class=\"wikitable outercollapse sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=\"150\" |Country\n! width=\"120\" |Areas visited\n! width=\"100\" |Date(s)\n! width=\"150\" |Purpose(s)\n! width=\"550\" |Notes\n|-\n|\n|London\n|27 – 30 July\n|International Summit\n|Buhari attends the Global Education Summit on Financing Global Partnership for Education (GPE) 2021 to 2025.\n|-\n|\n|New York City\n|18 – 24 September\n|UN Summit\n|Seventy-sixth session of the United Nations General Assembly.\n|-\n|\n|Addis Ababa\n|3 – 6 October\n|Inauguration of Abiy Ahmed\n|Abiy Ahmed's inauguration for a second term in office after the 2021 Ethiopian general election.\n|-\n|\n|Riyadh\n|25 – 28 October\n(Buhari remained in Saudi until 29 October)\n|Working Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the Future Investment Initiative business forum. After the summit, Buhari visited Jeddah to perform Hajj.\n|}\n|-\n|\n|Paris\n|10 – 13 November\n|Working Visit, Paris Peace Forum\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari hold bilateral talks with President Emmanuel Macron and then attends the Paris Peace Forum.\n|}\n|}\n2022\nThe following is a list of international presidential trips made by Buhari in 2022. Buhari made two trips to the United Kingdom in May and November 2022, however, they were not in an official capacity and were for routine medical checkups.\n{| class=\"wikitable outercollapse sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=\"150\" |Country\n! width=\"120\" |Areas visited\n! width=\"100\" |Date(s)\n! width=\"150\" |Purpose(s)\n! width=\"550\" |Notes\n|-\n|\n|Banjul\n|19 January\n|Inauguration of Adama Barrow\n|Adama Barrow's inauguration for a second term in office after 2021 Gambian presidential election.\n|-\n|\n|Addis Ababa\n|3 – 4 February\n|AU Summit\n|35th Ordinary Session of the Assembly of Heads of State and Government of the African Union.\n|-\n|\n|Brussels\n|17 – 18 February\n|EU Summit\n|6th European Union–African Union Summit\n|-\n|\n|Nairobi\n|2 – 3 March\n|Commemoration\n|Commemoration of the 50th Anniversary of the United Nations Environmental Program.\n|-\n|\n|Abidjan\n|8-9 May\n|Conference of Parties\n|Attended The fifteenth session of the Conference of the Parties (COP15) of the United Nations Convention to Combat Desertification\n|-\n|\n|Abu Dhabi\n|21 May\n|Working Visit\n|Condolence visit following death of President of the UAE Khalifa bin Zayed Al Nahyan.\n|-\n|\n|Malabo\n|26 – 28 May\n|AU Summit\n|African Union Extra-ordinary Session of Assembly of Heads of State and Government.\n|-\n|\n|Madrid\n|31 May – 1 June\n|Working Visit\n|State visit with Prime-Minister Pedro Sánchez and King Felipe VI.\n|-\n|\n|Accra\n|4 June\n|ECOWAS Summit\n|2022 Second Ordinary Session of ECOWAS Parliament.\n|-\n|\n|Kigali\n|22 – 26 June\n|CHOGM Summit\n|26th Commonwealth Heads of Government Meeting 2022.\n|-\n|\n|Lisbon\n|28 June  – 2 July\n|Working Visit\n|Working visit with Marcelo Rebelo de Sousa and United Nations Ocean Conference.\n|-\n|\n|Dakar\n|6 – 7 July\n|IDA Summit\n|International Development Association (IDA) for Africa Summit.\n|-\n|\n|Monrovia\n|26 July\n|Working Visit\n|Liberia's 175th Independence anniversary celebrations.\n|-\n|\n|New York City\n|19 – 21 September\n|UN Summit\n|Seventy-seventh session of the United Nations General Assembly.\n|-\n|\n|Seoul\n|25 – 26 October\n|WHO Summit\n|1st World Bio Summit,\n|-\n|\n|Niamey\n|25 – 26 November\n|AU Summit\n|African Union Summit on Industrialisation and Economic Diversification and the Extraordinary Session on African Continental Free Trade Area (AfCFTA).\n|-\n|\n|Bissau\n|8 December\n|Working Visit\n|Amilcar Cabral Award awarded to Buhari by President Umaro Sissoco Embaló.\n|-\n|\n|Washington, D.C.\n|10 – 18 December\n|US Summit\n|Buhari attended the United States–Africa Leaders Summit 2022 along with 49 other African leaders.\n|}\n2023\nThe following is a list of international presidential trips made by Buhari in 2023.\n{| class=\"wikitable outercollapse sortable\" style=\"margin: 1em auto 1em auto\"\n|-\n! width=\"150\" |Country\n! width=\"120\" |Areas visited\n! width=\"100\" |Date(s)\n! width=\"150\" |Purpose(s)\n! width=\"550\" |Notes\n|-\n|\n|Dakar\n|24 – 26 January\n|Dakar 2 Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|Buhari attended the Dakar 2 Summit hosted by the African Development Bank called “Feeding Africa: Food Sovereignty and Resilience” where he was a keynote speaker. The event was attended by various African heads of states.\n|}\n|-\n|\n|Addis Ababa\n|17 – 19 February\n|AU Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|36th Ordinary Session of the Assembly of Heads of State and Government of the African Union.\n|}\n|-\n|\n|Doha\n|4 – 8 March\n|UN Summit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attended the  Fifth United Nations Conference on the Least Developed Countries (LDC5) in Qatar.\n|}\n|-\n|\n|Jeddah\n|11 – 19 April\n|Working Visit\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari makes his last official visit to Saudi Arabia, during the visit, the President performed Umrah.\n|}\n|-\n|\n|London\n|5 – 6 May\n|Coronation of Charles III and Camilla\n|\n{| class=\"wikitable collapsible innercollapse\"\n|-\n!Details\n|-\n|President Buhari attends the Coronation of Charles III and Camilla along with other heads of Commonwealth of Nations. Buhari extended his trip by a week for personal medical appointments.\n|}\n|}\nReferences"
    }
  ]
}