{
  "content": [
    {
      "type": "text",
      "text": "# List of German guided weapons of World War II\n\nDuring World War II, Nazi Germany developed many missiles and precision-guided munition systems.\nThese included the first cruise missile, the  first short-range ballistic missile, the first guided surface-to-air missiles, and the first anti-ship missiles.\nOrganizations\n* Peenemünde rocket test site\nPeople involved\n* Wernher von Braun\n* Walter Dornberger\n* Walter Thiel\n* Max Kramer\n* Herbert A. Wagner\nModels\nSurface-to-surface missiles\nThe V1, which may be seen as the first cruise missile, was used operationally against London  and Antwerp. The V-2 ballistic missile was used operationally against London, Antwerp, and other targets. The Rheinbote was fired against Antwerp.\n* V-1 flying bomb\n* V-2 rocket\n* Rheinbote\n* A4b\nSurface-to-air missiles\nGermany developed a number of surface-to-air missile systems, none of which was used operationally:\n* Enzian (Gentian)\n* Rheintochter (Rhine Daughter) -  (an air-to-air variant was also planned)\n* Henschel Hs 117 Schmetterling (Butterfly) - radio-controlled (an air-to-air variant was also planned)\n* Wasserfall (Waterfall)\n* Feuerlilie (Fire Lily)\nAir-to-air missiles\nAs with the surface-to-air missiles above, these were never used operationally:\n* Henschel Hs 298\n* Ruhrstahl X-4 (actively wire-guided; anti-tank variants of this were also designed, such as the X-7)\nAnti-ship missiles\nAnti-ship missiles were used operationally against allied shipping in 1943, notably in the Mediterranean Sea, guided by the Funkgerät FuG 203 Kehl series of MCLOS radio guidance systems aboard the deploying aircraft:\n* Fritz X armored, anti-ship gravity PGM\n* Henschel Hs 293 air-to-ship, rocket-boosted gliding guided bomb\nAir-to-surface weapons\nThe Mistel composite aircraft configuration was used (with almost no effects) on the front lines both on western and eastern front. This system was composed by a bomber filled with explosive, coupled to a fighter plane: the pilot in the fighter plane flew the two coupled airplanes up to near the target, then he disconnected the aircraft and commanded the bomber to crash onto the target by radio control.\nSee also\n*List of military aircraft of Germany\n*List of World War II military aircraft of Germany\n*List of RLM aircraft designations\n*List of missiles\nReferences"
    }
  ]
}