{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1887\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1887.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland). For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign. Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\". Acts passed from 1963 onwards are simply cited by calendar year and chapter number.\nAll modern acts have a short title, e.g. the Local Government Act 2003. Some earlier acts also have a short title given to them by later acts, such as by the Short Titles Act 1896.\n50 & 51 Vict.\nThe second session of the 24th Parliament of the United Kingdom, which met from 27 January 1887 until 16 September 1887.\nPublic general acts\n|\n|  }}\n|  }}\n|  }}\n| |note4= }}\n|  }}\n|  }}\n|\n|\n|\n|  and the Truro Chapter Act, 1878. }}\n|   and to extend and otherwise amend the provisions of the Colonial Governors (Pensions) Acts, 1865 and 1872. }}\n|\n|\n|\n|\n|  }}\n|\n| or the Crimes Act 1887or the Irish Crimes Act 1887or the Perpetual Crimes Act 1887or the Jubilee Coercion Act 1887|public|20|19-07-1887|archived=n|An Act to make better provision for the prevention and punishment of Crime in Ireland, and for other purposes relating thereto.}}\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|  }}\n|\n|  }}\n|\n|  and 1881, with Amendments, to Sanitary Districts throughout England, Wales, and Ireland; and for other purposes.|note4= }}\n|  and the Purchase of Land (Ireland) Act, 1885, and for other purposes connected therewith.}}\n|\n|  }}\n|\n|  }}\n|\n|\n|  }}\n|\n|\n|  and for other purposes relating thereto.|note4= }}\n|\n|\n| or the Truck Act 1887|public|46|16-09-1887|repealed=y|maintained=y|archived=n|An Act to amend and extend the Law relating to Truck.|note4= }}\n|\n|\n|\n|\n| |note4= }}\n|\n|  }}\n|\n|\n| |note4= }}\n|\n|  and 1886, and the Stratified Ironstone Mines (Gunpowder) Act, 1881. }}\n|\n|  as to Scotland.}}\n|  }}\n|  }}\n|\n|\n|  }}\n|  }}\n|  and 1859; and for other purposes.}}\n| |note4= }}\n|  and the Conveyancing (Scotland) Act (1874) Amendment Act, 1879.}}\n| |note4= }}\n|\n|\n|  }}\n}}\nLocal acts\nand the Acts amending the same, relating to the Follistown Drainage District, in the County of Meath.|po1=Follistown Drainage Order 1887|In the matter of the Follistown Drainage District, in the county of Meath.}}\n|  }}\n|  and for making provision as to the application of the moneys deposited in respect of the application to Parliament for the Skegness Chapel Saint Leonard's and Alford Tramways Act 1883; and for other purposes.}}\n|\n|  }}\n|  }}\n|\n|  for the compulsory purchase of Lands and for the completion of the Railway thereby authorised; to confer further powers on the Trustees of the Clyde Navigation and on the Clyde Pilot Board, with respect to the collection of Rates and Dues, the appointment of Officers, and the erection of Signals; and for other purposes.}}\n|\n-\n|  and to make further provisions in relation to the capital of the Society and to the distribution of profits, and for other purposes.|note4= }}\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|\n-\n|\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|\n|\n-\n|  as regards the county of Orkney; and for other purposes.}}\n|  relating to lands in the Parishes of Leyton (Essex) and Coulsdon (Surrey).|note4=|po1=Provisional Order made by the Secretary of State under the Metropolitan Police Act, 1886.|po1short=n}}\n|  }}\n|\n|\n|\n|\n|\n|\n|\n-\n|\n| |note4= }}\n|\n|  and for other purposes.}}\n|  }}\n|\n|  and for other purposes.|note4= }}\n|\n|  and to make further provision with respect to the Charter and Capital of the Company and as to Agreements made by the Company and for other purposes.}}\n|\n|po3=Bridlington Order 1887|Provisional Order to enable the Sanitary Authority for the Urban Sanitary District of Bridlington to put in force the Compulsory Clauses of the Lands Clauses Consolidation Acts.\n|po4=Cheltenham Order 1887|Provisional Order to enable the Sanitary Authority for the Borough of Cheltenham to put in force the Compulsory Clauses of the Lands Clauses Consolidation Acts.\n|po5=Epsom Order 1887|Provisional Order to enable the Sanitary Authority for the Urban Sanitary District of Epsom to put in force the Compulsory Clauses of the Lands Clauses Consolidation Acts.\n|po6=Merton Rush Order 1887|Provisional Order for dissolving the Special Drainage District of Merton Rush.\n|po7=Pontypool Order 1887|Provisional Order to enable the Sanitary Authority for the Urban Sanitary District of Pontypool to put in force the Compulsory Clauses of the Lands Clauses Consolidation Acts.\n|po8=Saint Helens Order 1887|Provisional Order for altering the Saint Helen's (Corporation) Water Act, 1882.\n|po9=Surbiton Order 1887|Provisional Order to enable the Sanitary Authority for the Urban Sanitary District of Surbiton to put in force the Compulsory Clauses of the Lands Clauses Consolidation Acts.}}\n-\n|\n|  for the compulsory purchase of lands for and for the completion of works thereby authorised and for other purposes.}}\n|\n|  and for other purposes.}}\n|\n|\n|\n|  relating to the North Riding of the County of York.|po1=Disturnpiked Roads (Yorks. North Riding) Order 1887|}}\n|  as amended and extended by the Poor Law Act, 1879, relating to the Parishes of Birtley, Carlton Little, Cockerington North, Cockerington South, Ludford Magna, Ludford Parva, Reston North, Swaby, Theddlethorpe All Saints, and Theddlethorpe Saint Helen's; and to the Townships of Bagby, Belleau, Chollerton, Dalton, and Louth Park.|po1=Birtley and Chollerton Order 1887|\n|po2=Carlton-Little, Cockerington-North, Cockertington-South, Ludford-Magna, Ludford-Parva, Reston-North, Swaby, Theddlethorpe-All Saints, and Theddlethorpe-St. Helens, and the Townships of Belleau and Louth-Park Order 1887|\n|po3=Bagby and Dalton Order 1887|}}\n|  as amended and extended by the Poor Law Act, 1879, relating to the Parishes of Asterby, Cowbit, Curdworth, Dalderby, Durston, Goulceby, Langton, Lyng, Mareham-le-Fen, Pinchbeck, Revesby, Scrivelsby, Spalding, Tattershall, Thimbleby, Thornton, and Woodhall; to the Township of Tattershall Thorpe, and to the Hamlet of Minworth.|po1=Cudworth and Minworth Order 1887|\n|po2=Durston and Lyng Order 1887|\n|po3=Asterby, Dalderby, Goulceby, Langton, Mareham le Fen, Revesby, Scrivelsby, Tattershall, Thimbleby, Thornton, and Woodhall, and the Township of Tattershall Thorpe Order 1887|\n|po4=Cowbit, Pinchbeck, and Spalding Order 1887|}}\n-\n|\n|\n|  }}\n|\n|\n|\n|\n|  to change the name of the Felixstowe Railway and Dock Company; and for other purposes.}}\n|\n|\n-\n|  }}\n|  }}\n|  }}\n|\n|  relating to Aberdeen, Alum Bay, Greenock, Sandown, and Teignmouth.|po1=Aberdeen Harbour Order 1887|\n|po2=Alum Bay Pier Order 1887|\n|po3=Greenock Harbour Order 1887|\n|po4=Sandown Pier Order 1887|\n|po5=Teignmouth Quays Order 1887|}}\n|\n|\n|\n|\n|\n-\n|\n|\n|  as amended and extended by the Poor Law Act, 1879, relating to the Parishes of Aldington, Saint Leonard, Hythe, and West Hythe.|note4=|po1=Aldington, Saint Leonard, Hythe, and West Hythe Order 1887|East Ashford, Elham, and Romney Marsh Unions.}}\n|  the Gas and Water Works Facilities Act, 1870, Amendment Act, 1873, and the Public Health Act, 1875, relating to the Local Government Districts of East Dereham and Meltham.|po1=East Dereham Gas Order 1887|\n|po2=Meltham Gas Order 1887|}}\n|\n|  }}\n| |note4= }}\n|\n|\n|\n-\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|\n|\n|\n-\n|  relating to Poole (Wareham Channel).|po1=Poole (Wareham Channel) Fishery Order 1887|}}\n|\n|\n|  to extend the time for the purchase of lands and completion of the railway; and for other purposes.|note4= }}\n|\n|\n|\n|\n|  }}\n|  }}\n-\n|\n|\n|\n|\n|\n|\n|\n|\n|  so far as relates to the Borough of Belfast.}}\n|  to enable the School Board for Christchurch (extra municipal), Monmouth, to put in force the Lands Clauses Consolidation Act, 1845, and the Acts amending the same.|po1=Christchurch Order 1887|}}\n-\n|  to enable the School Board for London to put in force the Lands Clauses Consolidation Act, 1845, and the Acts amending the same.|po1=London Order 1887|}}\n|\n|\n|  relating to Dudley, Netherton, Old Hill, and Cradley Tramways, Newport Pagnell and District Tramways, Norwich Tramways, Wolverton and Stony Stratford Tramways (Deanshanger Extension), and Worcester Tramways.|po1=Dudley, Netherton Old Hill and Cradley Tramways Order 1887|\n|po2=Newport Pagnell and District Tramways Order 1887|\n|po3=Norwich Tramways Order 1887|\n|po4=Wolverton and Stony Stratford (Deanshanger Extension) Tramways Order 1887|\n|po5=Worcester Tramways Order 1887|}}\n|  relating to Beverley Water, Freshwater and Yarmouth Water, Hoylake and West Kirby Water, Poole Water, and West Lulworth Water.|po1=Beverley Waterworks Order 1887|\n|po2=Freshwater and Yarmouth Water Order 1887|\n|po3=Hoylake and West Kirby Water Order 1887|\n|po4=Poole Water Order 1887|\n|po5=West Lulworth Water Order 1887|}}\n|  relating to Bedford Gas, Long Melford Gas, Musselburgh Gas, Penmaenmawr Gas, and Portsea Gas.\n|po1=Bedford Gas Order 1887|\n|po2=Long Melford Gas Order 1887|\n|po3=Musselburgh Gas Order 1887|\n|po4=Penmaenmawr Gas Order 1887|\n|po5=Portsea Gas Order 1887|}}\n|\n|\n|\n|\n-\n|\n|\n|  }}\n|\n|\n|  and for other purposes.}}\n|\n|  }}\n|\n|  and to authorise the Mersey Docks and Harbour Board to make and maintain additional Overhead Railways; and for other purposes.|note4= }}\n-\n|\n|  and for other purposes.}}\n|  }}\n|  and the Burry Port and North-western Junction Railway Amendment Act 1881.|note4= }}\n|  relating to Cowdenbeath Water.|po1=Cowdenbeath Water Order 1887|}}\n|  relating to Duntocher and Dalmuir Water.|po1=Duntocher and Dalmuir Water Order 1887|}}\n|  }}\n|\n|  }}\n|  }}\n-\n|\n|\n|\n|\n|\n|\n|\n|  relating to Caterham and District Gas, Sunbury Gas, and Stowmarket Water.|po1=Caterham and District Gas Order 1887|Order empowering the Caterham and District Gaslight and Coke Company, Limited, to maintain and continue Gasworks, to purchase additional land, to construct additional works, and to make and supply gas in the parishes of Caterham, Warlingham, Chelsham, Chaldon, and Farley, and in parts of the parishes of Coulsdon and Tandridge, all in the County of Surrey.\n|po2=Sunbury Gas Order 1887|Order empowering the Sunbury Gas Consumers Company (Limited) to maintain and continue Gasworks and to manufacture and supply Gas within the Parishes of Sunbury Littleton Hanworth Feltham and a portion of Ashford all in the County of Middlesex.\n|po3=Stowmarket Water Order 1887|Order authorising the Construction and Maintenance of Waterworks and the Supply of Water within the Parishes of Stowmarket and Stow-Upland in the County of Suffolk.}}\n|  relating to Boscombe.|po1=Boscombe Pier Order 1887|Order for the construction maintenance and regulation of a Pier at Boscombe in the parish of Christchurch in the county of Southampton.}}\n|\n-\n|\n|\n|  }}\n|\n|\n|  and for other purposes.}}\n| |note4= }}\n|\n|\n|  }}\n-\n|  and for other purposes.}}\n|\n|\n|  }}\n|  }}\n|\n|  and for other purposes.}}\n|\n|  }}\n|\n|po2=Hindley Order 1887|Provisional Order to enable the Sanitary Authority for the Urban Sanitary District of Hindley to put in force the Compulsory Clauses of the Lands Clauses Consolidation Acts.\n|po3=Norwich Order 1887|Provisional Order to enable the Urban Sanitary Authority for the City of Norwich to put in force the Compulsory Clauses of the Lands Clauses Consolidation Acts.\n|po4=Richmond Main Sewerage Order 1887|Provisional Order for forming a United District under Sec. 279 of the Public Health Act, 1875.\n|po5=West Kent Main Sewerage Order 1887|Provisional Order for altering certain Local Acts and a Confirming Act. }}\n-\n|\n|po3=Dewsbury and Heckmondwike Order 1887|Provisional Order for altering the Dewsbury and Heckmondwike Waterworks Act, 1876.\n|po4=Milford Order 1887|Provisional Order for partially repealing and altering the Milford Improvement Act, 1857.\n|po5=Rhyl Order 1887|Provisional Order for partially repealing and altering certain Local Acts and a Confirming Act.\n|po6=West Worthing Order 1887|Provisional Order for partially repealing and altering the West Worthing Improvement Act, 1865. }}\n|\n|\n|\n|\n|  }}\n|\n|\n|  and for other purposes.}}\n|  as extended by the Commissioners of Public Works in Ireland.}}\n-\n|\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|  relating to Birmingham Central Tramways (Extension), Bristol Tramways, Burnley and District Tramways, and Burnley and District Tramways Extension, Macclesfield Tramways, Oldham, Ashton-under-Lyne, Hyde, and District Tramways, West Metropolitan Tramways, and Weymouth Tramways.|po1=Birmingham Central Tramways (Extension) Order 1887|Order authorising the construction of Tramways in the parishes or places of Aston, in the county of Warwick, and King's Norton and Balsall Heath, in the county of Worcester, and for other purposes.\n|po2=Bristol Tramways Order 1887|Order authorising the Bristol Tramways Company (Limited) to construct additional Tramways in the City and County of Bristol and for other purposes.\n|po3=Burnley and District Tramways Extensions Order 1887|Order authorising the use of steam or any mechanical power on certain portions of the tramways authorised by the Burnley and District Tramways Order 1879 and the Burnley and District Tramways Extension Order 1882 and for other purposes.\n|po4=Macclesfield Tramways (Abandonment of Tramways and Release of Deposit) Order 1887|Order authorising the Abandonment of the Tramways authorised by the Macclesfield Tramways Order 1883 and the Release of the Deposit Fund paid into Court on the application for the said Order.\n|po5=Oldham Ashton-under-Lyne Hyde and District Tramways (Release of Deposit) Order 1887|Order authorising the Release of Deposit Fund paid into Court on the application for the Oldham Ashton-under-Lyne Hyde and District Tramways Order 1883.\n|po6=West Metropolitan Tramways Order 1887|Order authorising the use of electrical or any mechanical power other than steam power on the Tramways of the West Metropolitan Tramways Company.\n|po7=Weymouth Tramways Order 1887|Order amending the Weymouth Tramways Order 1884 with respect to the commencement and opening for public traffic of the tramways thereby authorised.}}\n|\n|  }}\n| |note4= }}\n-\n|\n|  }}\n}}\nPrivate and personal acts\n| |private|2|23-05-1887|repealed=n|archived=n|An Act to dissolve the Marriage of Harriett Frances Gifford with James Richard Gifford, and to enable her to marry again, and for other purposes.}}\n| |private|3|23-05-1887|repealed=n|archived=n|An Act to dissolve the Marriage of William Hewat (formerly of 102, Saint Stephen's Green South, but now of 18, Westmoreland-street, in the City of Dublin), Merchant, with Agnes Anna Hewat, his now Wife, and to enable him to marry again, and for other purposes.}}\n| |private|4|12-07-1887|repealed=n|archived=n|An Act to dissolve the Marriage of Ringrose Atkins, Of Lower Grange, in the County of Waterford, in Ireland, Esquire, Doctor of Medicine, with Mary Ellen Atkins, his now Wife, and to enable him to marry again, and for other purposes.}}\n}}\nSources\n*\n*  |via=Google Books}}\n*  |via=Google Books}}\n*  |via=Google Books}}\nSee also\n*List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}