{
  "content": [
    {
      "type": "text",
      "text": "# Listed buildings in Nottingham (Wollaton West ward)\n\nWollaton West ward is an electoral ward in the city of Nottingham, England.  The ward contains 42 listed buildings that are recorded in the National Heritage List for England.   Of these, one is listed at Grade&nbsp;I, the highest of the three grades, three are at Grade&nbsp;II*, the middle grade, and the others are at Grade&nbsp;II, the lowest grade.  The ward contains the village of Wollaton, and the surrounding area.  The most important building in the ward is Wollaton Hall, which is listed together with associated structures and buildings in the garden, the grounds, and in Wollaton Park.  The other listed buildings are in the village, and include houses, cottages, and associated structures, a church, headstones in the churchyard, the former rectory, a village pump in a shelter, a dovecote and a telephone kiosk.\n__NOTOC__\nKey\n{| class=\"wikitable\n|-\n! Grade\n! Criteria\n|-\n|align=\"center\" |I\n| Buildings of exceptional interest, sometimes considered to be internationally important\n|-\n|align=\"center\" |II*\n| Particularly important buildings of more than special interest\n|-\n|align=\"center\" |II\n| Buildings of national importance and special interest\n|}\nBuildings\n{| class=\"wikitable sortable plainrowheaders\" style=\"width:100%; border:0px; text-align:left; line-height:150%\"\n|-\n! scope=\"col\"  style=\"width:150px\" |Name and location\n! scope=\"col\"  style=\"width:100px\" class=\"unsortable\"|Photograph\n! scope=\"col\"  style=\"width:120px\" |Date\n! scope=\"col\"  style=\"width:650px\" class=\"unsortable\"|Notes\n! scope=\"col\"  style=\"width:50px\" |Grade\n|-\n|St Leonard's Church, Wollaton\n|\n|align=\"center\"|\n|The church has been altered and extended through the centuries, including additions and a restoration in 1885–87 by C. Hodgson Fowler.  It is built in stone with slate roofs, and consists of a nave with a clerestory, north and south aisles, a chancel, a south chapel, and a west steeple.  The steeple has a tower with two stages, diagonal buttresses, pointed arched openings in the lower stage on the north and south sides, later glazed, a clock face on the west side, two-light bell openings, an embattled parapet, and a recessed octagonal spire with lucarnes.  Inside the church are many monuments.  The boundary wall is in stone with rounded coping, and it extends for about .\n|align=\"center\" |\n|-\n|The Chantry\n|\n|align=\"center\"|\n|A stone house on a plinth, with dressings in stone and brick, and a tile roof with a single coped gable and kneelers.  There are two storeys and an attic and two bays.  In the centre is a Tudor arched doorway, the ground floor windows are casements, in the upper floor are horizontally-sliding sash windows, and the attic contains a blocked window with a hood mould.\n|align=\"center\" |\n|-\n|Circular pond, Wollaton Hall Garden\n|\n|align=\"center\"|\n|The pond was designed by Robert Smythson, it originally had a central fountain, and was later moved to its present site.  The pond has a circular plan with slightly raised sandstone edging and lining, brick footings, and a lead pipe.\n|align=\"center\" |\n|-\n|Wollaton Hall\n|\n|align=\"center\"|1580–88\n|A country house designed by Robert Smythson, it has since been altered, and it was converted into a museum in 1925.  It is built in Ancaster limestone with lead roofs, and has a square plan with symmetrical fronts.  In the centre is a two-storey block with a basement and four bays, surmounted by a prospect room with a balustrade and corner bartizan turrets.  The block is flanked by two-storey single bays, and projecting three-storey towers with shaped gables and pinnacles.  In the centre of the entrance front, steps with balusters lead up to a round-arched recessed doorway flanked by Doric columns and Ionic pilasters.  Above the doorway is a scrolled elongated corbel keystone, an entablature and a balustrade.\n|align=\"center\" |\n|-\n|[https://www.wollatonhistorical.com/dovecote Wollaton Dovecote]\n|\n|align=\"center\"|c. 1565\n|The dovecote, later used for other purposes, is in red brick on a plinth, with string courses, an eaves band, and a pantile roof with plain tile verges, and a central glover with a pyramidal roof.  There are two storeys and a rectangular plan.  In the south front is a doorway with a four-centred arched head and a hood mould, and in the north front is a stable door flanked by two-light casement windows, all with segmental heads.\n|align=\"center\" |\n|-\n|Terrace wall, balustrade and steps,Wollaton Hall Garden\n|\n|align=\"center\"|\n|The wall, in stone and brick, is about  long, and in the centre are steps with a straight upper flight and a half-round lower flight.  The balustrade is in stone, with pedestals, and cast iron columns linked by chains.  At the west end is a coped stone wall containing an integral stone bench, flanked by pedimented niches.\n|align=\"center\" |\n|-\n|Four statue bases,Wollaton Hall Garden\n|\n|align=\"center\"|\n|Four identical statue bases on the upper south terrace of the garden, they are in Hollington sandstone.  Each base consists of a pedestal with a moulded base and cornice, and a plain shaft.\n|align=\"center\" |\n|-\n|Western section of park boundary wall\n|\n|align=\"center\"|\n|The wall, which has been restored, is in red brick with gabled brick coping.  It is about  high and extends for about .  A gateway has been cut through the wall.\n|align=\"center\" |\n|-\n|Three headstones\n|\n|align=\"center\"|\n|The headstones are in the churchyard of St Leonard's Church, Wollaton to the south of the south chapel.  They are in stone; the left headstone has an ogee head and the date 1717, and the two to the right are scroll-headed with illegible inscriptions.\n|align=\"center\" |\n|-\n|Headstone of Samuel Slack\n|\n|align=\"center\"|1728\n|The headstone is in the churchyard of St Leonard's Church, Wollaton to the southeast of the south chapel.  It is in stone, and has an arched top with shoulders.\n|align=\"center\" |\n|-\n|Headstone of William Addis\n|\n|align=\"center\"|1741\n|The headstone is in the churchyard of St Leonard's Church, Wollaton to the south of the south aisle.  It is in slate, and has an inscription, and military trophies in the spandrels.\n|align=\"center\" |\n|-\n|Stable and Service Ranges,Wollaton Hall\n|\n|align=\"center\"|1743\n|The ranges, which were later extended and subsequently used for other purposes, including as a museum.  They are in sandstone and brick with roofs of Westmorland slate and tile, and have two storeys.  The buildings form three courtyards, with two quadrangles and a cart yard, and include square pavilions with pyramidal roofs, and a dovecote.  The stable range has 13&nbsp;bays, the ground floor is rusticated, with a plinth, a floor band, a cornice and a parapet.  The middle three bays project and contain an engaged Ionic portico, a triangular pediment with a decorative Rococo tympanum containing a coat of arms and carved figures, and a clock in a decorated surround.  The central entrance has a round arch with a keystone, and a doorway with a fanlight, flanked by niches.  The ground floor windows have round-arched heads, and those in the upper floor are sashes with shouldered architraves.\n|align=\"center\" |\n|-\n|Ivy Cottage\n|\n|align=\"center\"|\n|The cottage is in brick on a stone plinth, with quoins at the rear, a moulded string course, cogged eaves, and a pantile roof with coped gables.  There is a single storey and an attic, four bays, and a single-storey extension at the rear.  The doorway has a double pointed-arched fanlight, the windows are casements with triple pointed-arched heads, and at the rear is a through-eaves dormer.\n|align=\"center\" |\n|-\n|The Cottages\n|\n|align=\"center\"|\n|Four houses, later combined into two, in brick, with dentilled eaves, and a tile roof with coped gables and kneelers.  There are two storeys and attics and three bays.  There are three doorways with fanlights, one with a segmental head, and most of the windows have flat brick arches.\n|align=\"center\" |\n|-\n|Boathouse, Wollaton Park\n|\n|align=\"center\"|1774–85\n|The boathouse was designed to appear like a bridge.  It is in brick with stone keystones and impost bands, and replacement concrete coping.  Facing the lake are five graduated round arches leading to barrel vaults, the outer ones blind, and the inner ones with wrought iron gates.  At the rear, the central chamber has a projecting gable.\n|align=\"center\" |\n|-\n|1 to 4 Bramcote Lane\n|\n|align=\"center\"|\n|A row of five, later four, cottages in brick, with tile roofs and coped gables.  There are two storeys and seven bays.  The windows are horizontally-sliding sashes with two lights, and all the ground floor openings have segmental heads.\n|align=\"center\" |\n|-\n|2, 2A and 4 The Square\n|\n|align=\"center\"|\n|A row of three cottages in red brick on a rendered plinth, with a tile roof, hipped on the left.  There are two storeys and three bays.  The windows are casements with two lights, and all the ground floor openings have segmental heads.\n|align=\"center\" |\n|-\n|Park wall and gateways bordering Wollaton Road\n|\n|align=\"center\"|\n|The wall is in brick on an incomplete stone plinth, it has brick coping, it is about  high, and extends for about .  The wall contains three pairs of panelled square gate piers with cross-gabled stone caps, and a smaller gateway.\n|align=\"center\" |\n|-\n|Park wall between Ancaster Gardens and Eton Grove\n|\n|align=\"center\"|\n|The wall is in brick with gabled brick coping.  It is about  high, and extends for about .\n|align=\"center\" |\n|-\n|Park wall between Cambridge Road and Ancaster Gardens\n|\n|align=\"center\"|\n|The wall is in brick with gabled brick coping.  It is about  high, and extends for about .\n|align=\"center\" |\n|-\n|Remains of park wall between Eton Grove and Middleton Boulevard\n|\n|align=\"center\"|\n|The wall is in brick with gabled brick coping and is ramped at the west end.  It is about  high, and extends for about .\n|align=\"center\" |\n|-\n|Garden Cottage and outbuildings,Wollaton Hall\n|\n|align=\"center\"|\n|The cottage and the outbuildings are in brick.  The cottage has a hipped tile roof, two storeys, an L-shaped plan, and three bays.  The windows and doorway have pointed heads, the doorway has a fanlight, and the windows are casements with Gothic tracery.  To the right are two ranges of single-storey outbuildings with irregular fenestration, the nearer one with a roof of Westmorland slate and tile, and the other with coped gables.\n|align=\"center\" |\n|-\n|Ha-ha, Wollaton Park\n|\n|align=\"center\"|\n|The ha-ha is in brick with chamfered stone coping.  It borders the northeast side of the lake, and runs in a straight line for about .\n|align=\"center\" |\n|-\n|Mr Man's Restaurant Barn and cartshed, Wollaton Park\n|\n|align=\"center\"|\n|The barn, which has been converted for other uses, is in red brick, and has a tile roof with coped gables.  There are two storeys, three bays and single-storey extensions.  It contains a blocked central segmental-headed doorway with a smaller doorway inserted, a hatch and windows with segmental heads, and three tiers of vents.  Attached at the north end is the former cartshed, with a single storey and nine bays, and brick piers to the openings.\n|align=\"center\" |\n|-\n|Vase and pedestal,Wollaton Hall garden\n|\n|align=\"center\"|\n|The vase and pedestal on the lower south terrace are in sandstone.  The vase is shallow and has acanthus leaf carved moulding to the soffit.  The pedestal and foot were added in the mid-19th&nbsp;century.  The pedestal has a square moulded base, a cornice and a plain shaft.\n|align=\"center\" |\n|-\n|Wollaton House\n|\n|align=\"center\"|\n|The house is in stuccoed and painted brick on a plinth, with a gutter on wooden brackets, and slate roofs.  The main block has two storeys and three bays, and most of the windows are sashes.  In the centre of the front is a doorway with a traceried fanlight, and a cornice on brackets.  To its right is a two-storey canted bay window, and to its left is a single-storey canted bay window.  In the left gable end is a two-storey canted bay window, and at the rear is an extension with a round-headed stair window.  To the left is a two-storey service wing on a partial plinth, with dentilled eaves.\n|align=\"center\" |\n|-\n|Garden walls, outbuildings and gates,Wollaton Hall\n|\n|align=\"center\"|1783–88\n|The walls enclosing the garden are in red brick with sandstone coping, and some were heated, with the remains of fire holes.  They are about  high, they form a parallelogram plan about  square, and contain gateways, some with square brick piers.  On the northwest side are two lean-to bothies with nine two-light windows, in the centre is a group of store sheds, and to the west is a lean-to mushroom house with ten windows.\n|align=\"center\" |\n|-\n|Mounting blocks, Wollaton Hall\n|\n|align=\"center\"|1794\n|The two mounting blocks are in stone and about  high.  Each has a square stepped pedestal with mounting block on the inner side, and is surmounted by a large ball finial.\n|align=\"center\" |\n|-\n|5 Bramcote Lane and outbuildings\n|\n|align=\"center\"|\n|The house is in brick with a pantile roof, two storeys and three bays.  It contains a doorway, casement windows with segmental heads in the ground floor, and horizontally-sliding sash windows with flat heads in the upper floor.  The two single-storey outbuildings to the north contain a casement window and two sashes.\n|align=\"center\" |\n|-\n|Doric Temple and bridge,Wollaton Hall\n|\n|align=\"center\"|\n|The temple is in stone, and has a brick parapet with sandstone coping, and a flat roof.  There is a single storey and three bays.  It consists of an open loggia, with two outer pilasters and two inner columns in Roman Doric style, and a painted wooden cornice.  On the inner rendered walls are oval panels with reliefs depicting mythological themes, dated 1588.  To the northeast is a projecting niche with a round-arched window.  On the northwest and southeast ends are segmental-arched doorways, the latter with a decorative wrought iron grille.  Adjoining the temple is a bridge over a ha-ha, consisting of a single elliptical brick arch with stone coping, the parapet walls fanning out.\n|align=\"center\" |\n|-\n|Wall enclosing the kitchen garden wall, Wollaton Hall\n|\n|align=\"center\"|\n|The wall is in red brick with moulded coping, it is about  high, and it extends for about  in a U-shaped curve.  On the southwest side are buttresses and a doorway, and on the south side is a pair of square brick piers and wrought iron gates.\n|align=\"center\" |\n|-\n|Camellia House, Wollaton Hall\n|\n|align=\"center\"|1823\n|The camellia house is in cast iron, the north and west walls are in stuccoed brick, and the other walls and roof are glazed.  There is a single storey, an irregular octagonal plan, and ten bays.  The bays are divided by Doric columns with urns, and a cornice with breaks.  At the east end is a window in a round-arched recess under a pediment, and at the north end are double doors and a parapet.  Inside, the paths are flanked by slender columns with foliage capitals, and over the paths are sheet-iron segmental vaults.\n|align=\"center\" |\n|-\n|Gazebo, Wollaton Hall\n|\n|align=\"center\"|\n|The gazebo is in stone on a plinth, with corner pilasters, an impost band, an entablature, and a lead coped parapet.  There is a single storey, a square plan, and a single bay.  On each side is a round-arched opening with a keystone, and on the southwest is a doorway with a fanlight, above which is a bell bracket.\n|align=\"center\" |\n|-\n|Old Rectory\n|\n|align=\"center\"|\n|The rectory, later a private house, was later extended, and is stuccoed, on a plinth, with floor bands, and hipped  slate roofs.  The main block has three storeys and fronts of three bays, and most of the windows are sashes.  In the centre of the garden front is a three-storey canted bay window, flanked by two-storey bay windows.  The right return contains a central Doric portico with an entablature and an elliptical-arched double doorway, and in the right return is a two-storey bow window.  The extension has two storeys and two bays.\n|align=\"center\" |\n|-\n|Village pump and shelter\n|\n|align=\"center\"|\n|The village pump and shelter are on a traffic island near a road junction.  The pump is in the centre of the shelter, it is in cast iron in a wooden case, and has a stone trough.  The shelter has a square plan, at each corner is a square post, with a bracket, on a stone pad.  The posts carry a concave pyramidal roof with shaped slates, and a shaped lead-covered finial.\n|align=\"center\" |\n|-\n|Gateway and boundary wallWollaton House\n|\n|align=\"center\"|\n|The gateway is flanked by square brick piers, and serpentine walls with moulded stone coping.  The boundary wall is in brick with moulding brick coping, it includes a blocked gateway, and extends for about .\n|align=\"center\" |\n|-\n|Lodge Number 1, Wollaton Park\n|\n|align=\"center\"|\n|The lodge is in brick on a rendered plinth, and has a hipped Westmorland slate roof.  There is a single storey, an L-shaped plan, and three bays.  The windows are casements with twin pointed heads.\n|align=\"center\" |\n|-\n|Lodge Number 2, Wollaton Park\n|\n|align=\"center\"|\n|The lodge, which was later extended, is in red brick with a hipped slate roof.  The original part has a single storey, the addition has two storeys and an attic, and the lodge has an L-shaped plan.  The ground floor windows have flat brick arches and a linked hood mould, and on the road side is a hip roofed through-eaves dormer.\n|align=\"center\" |\n|-\n|Ice House southeast of Lodge Number 1, Wollaton Park\n|\n|align=\"center\"|\n|The ice house is in brick, and consists of an oval earth mound covering two brick-vaulted oval chambers.  There are two round-arched tunnel entrances with segmental-arched doorways.\n|align=\"center\" |\n|-\n|Ice House, wall, steps and railings, Wollaton Hall\n|\n|align=\"center\"|\n|The wall is in brick, mainly rendered, with stone dressings and slab coping.  It curves, and retains a hillside into which the ice house is set.  At the end nearer the hall is a flight of semicircular steps leading to a path flanked by cast iron railing, and set into the wall is a water trough.  Set into the slope is a round-arched tunnel entrance to the ice house.\n|align=\"center\" |\n|-\n|Wall, Ivy Cottage\n|\n|align=\"center\"|\n|The boundary wall is in brick with moulded coping.  In the centre is a gateway flanked by square brick piers with stone slab caps, and between them are wrought iron gates.\n|align=\"center\" |\n|-\n|Telephone kiosk, Wollaton Hall\n|\n|align=\"center\"|1935\n|The K6 type telephone kiosk north of the stable range was designed by Giles Gilbert Scott.  Constructed in cast iron with a square plan and a dome, it has three unperforated crowns in the top panels.\n|align=\"center\" |\n|-\n|}\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}