{
  "content": [
    {
      "type": "text",
      "text": "# Listed buildings in Harrogate (Hookstone Ward)\n\nHookstone is a ward in the town of Harrogate, North Yorkshire, England.  It contains six listed buildings that are recorded in the National Heritage List for England.  Of these, one is listed at Grade&nbsp;II*, the middle of the three grades, and the others are at Grade&nbsp;II, the lowest grade.  The ward is to the southeast of the town centre, and the listed buildings consist of houses and associated structures, a farmhouse and stable, and a railway viaduct.\n__NOTOC__\nKey\n{| class=\"wikitable\n|-\n! Grade\n! Criteria\n|-\n|align=\"center\" |II*\n| Particularly important buildings of more than special interest\n|-\n|align=\"center\" |II\n| Buildings of national importance and special interest\n|}\nBuildings\n{| class=\"wikitable sortable plainrowheaders\" style=\"width:100%; border:0px; text-align:left; line-height:150%\"\n|-\n! scope=\"col\"  style=\"width:150px\" |Name and location\n! scope=\"col\"  style=\"width:100px\" class=\"unsortable\"|Photograph\n! scope=\"col\"  style=\"width:120px\" |Date\n! scope=\"col\"  style=\"width:650px\" class=\"unsortable\"|Notes\n! scope=\"col\"  style=\"width:50px\" |Grade\n|-\n|Bilton Court\n|\n|align=\"center\"|\n|A house in gritstone with a moulded eaves cornice, a panelled parapet and a slate roof.  There are two storeys and cellars, three bays, and slightly recessed lower two-storey flanking bays, with hipped roofs and console bracketed cornices.  The entrance in the east wing has a Tuscan doorcase, and an arched doorway with a fanlight.  The windows are slightly recessed sashes, and in the west wing is a French window.\n|align=\"center\" |\n|-\n|Crimple Farmhouse and stable block\n|\n|align=\"center\"|\n|The farmhouse is in gritstone, and has a slate roof with coped gables and kneelers.  There are two storeys and three bays.  On the front is a recessed square-headed doorway with a radial fanlight and French window, and the other windows are recessed sashes.  To the north is a stable block with external steps, added in the early 19th century.\n|align=\"center\" |\n|-\n|Crimple Valley Viaduct\n|\n|align=\"center\"|1848\n|The viaduct was built by the York and North Midland Railway to carry its line across the Crimple Valley.  It is built in rusticated gritstone, and consists of 31&nbsp;round arches with voussoirs and imposts, and has a parapet with a dentilled cornice.  Its maximum height over the valley is .\n|align=\"center\" |\n|-\n|Coach house and stable block,Bilton Court\n|\n|align=\"center\"|\n|The building is in rusticated gritstone, with a floor band, and a hipped slate roof with a central pedimented pigeon loft.  There is a central block with two storeys and three bays, and single-storey single-bay wings.  In the centre is a round-arched doorway with a fanlight and a keystone, and the windows are recessed horizontally-sliding sashes with segmental heads.\n|align=\"center\" |\n|-\n|197 and 199, Hookstone Chase\n|\n|align=\"center\"|1903\n|A pair of semi-detached houses, designed by Parker and Unwin, in red brick with a tile roof. There are two storeys and four bays, the middle two bays rising to form a gable.  In the outer bays are square bay windows and doorways under a catslide roof, and above are dormers with hipped roofs.  The other windows are casements under segmental brick arches.\n|align=\"center\" |\n|-\n|Entrance gates, Bilton Court\n|\n|align=\"center\"|Undated\n|The entrance to the drive is flanked by stone gate piers with ball finials, between which are wrought iron gates.  Outside these are wrought iron railings ending in similar gate piers.\n|align=\"center\" |\n|-\n|}\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}