{
  "content": [
    {
      "type": "text",
      "text": "# List of awards and honors received by Elon Musk\n\nElon Musk is recognized for his design and engineering work on Tesla vehicles and SpaceX rockets and his efforts to combat global warming. For his renewable energy work and advocacy, he has received several environmentalist awards, including the National Wildlife Federation's Connie Award and a Global Green award. In part for his contributions to space travel, Musk  was elected a Fellow of the Royal Society in 2018, was listed among the Time 100 Most Influential People in the World in 2010, 2013, 2018 and 2021, and was ranked joint-first on the Forbes list of the \"Most Innovative Leaders of 2019\". On December 13, 2021, Time magazine named him Person of the Year.\nAwards and honors\n]]\nfrom the Brazilian Armed Forces in 2022]]\n* In 2006, Musk was a member of the United States National Academy of Sciences Aeronautics and Space Engineering Board.\n* Inc. magazine Entrepreneur of the Year award for 2007 for his work on Tesla and SpaceX.\n* 2007 Index Design award for his design of the Tesla Roadster. Global Green 2006 product design award for his design of the Tesla Roadster, presented by Mikhail Gorbachev.\n* American Institute of Aeronautics and Astronautics George Low award for \"the most outstanding contribution in the field of space transportation in 2007/2008\". Musk was recognized for his design of the Falcon 1, the first privately developed liquid-fuel rocket to reach orbit.\n* National Wildlife Federation 2008 National Conservation Achievement award for Tesla and SolarCity. Other 2008 recipients include journalist Thomas Friedman, U.S. Senator Patrick Leahy (D-VT), and Florida Governor Charlie Crist.\n* National Space Society's Von Braun Trophy in 2008/2009, given for leadership of \"the most significant achievement in space\". Prior recipients include Burt Rutan and Steve Squyres.\n* Honorary graduate of the University of Surrey in 2009.\n* Listed as one of Times 100 people who most affected the world in 2010.\n* The world governing body for aerospace records, Fédération Aéronautique Internationale, presented Musk in 2010 with the highest award in air and space, the FAI Gold Space Medal, for designing the first privately developed rocket to reach orbit. Prior recipients include Neil Armstrong, Burt Rutan of Scaled Composites and John Glenn.\n* Named as one of the 75 most influential people of the 21st century by Esquire magazine.\n* Recognized as a Living Legend of Aviation in 2010 by the Kitty Hawk Foundation for creating the successor to the Space Shuttle (Falcon 9 rocket and Dragon spacecraft). Other recipients include Buzz Aldrin and Richard Branson.\n* In February 2011, Forbes listed Musk as one of \"America's 20 Most Powerful CEOs 40 And Under.\"\n* In June 2011, Musk was awarded the  Heinlein Prize for Advances in Space Commercialization\n* In 2012, Musk was awarded the Royal Aeronautical Society's highest award: a gold medal.\n* In 2013, Musk was named the Fortune Businessperson of the year for SpaceX, SolarCity, and Tesla.\n* Awarded the President's award for Exploration and Technology of the Explorers Club at the annual gala on March 16, 2014.\n* In 2014, Elon Musk was honored with an Edison Achievement Award for his \"commitment to innovation throughout his career\".\n* 2015 at Yale's 314th Commencement Ceremony, received Honorary Doctorate in Engineering and Technology.\n* In 2015, he was awarded IEEE Honorary Membership.\n* In June 2016, Business Insider named Musk one of the \"Top 10 Business Visionaries Creating Value for the World\" along with Mark Zuckerberg and Sal Khan.\n* In May 2017, Musk was awarded the Oslo Business for Peace Award.\n* In 2018, Musk was ranked 25th on Forbes list of The World's Most Powerful People.\n* Musk was elected a Fellow of the Royal Society (FRS) in 2018.\n* Listed among the Time 100 Most Influential People in the World in 2010, 2013, 2018 and 2021.\n* Musk was awarded as member (fifth class) of the Most Admirable Order of the Direkgunabhorn on March 4, 2019, for his contribution in the rescue at Tham Luang cave, Chiang Rai Province, Thailand.\n* In 2019, Musk was awarded the Starmus Festival's Stephen Hawking Medal for Science Communication\n* Musk was listed joint first on the Forbes list of the \"Most Innovative Leaders of 2019\".\n* Musk was cited as one of the Top 100 most influential Africans by New African magazine in 2020.\n* On December 1, 2020, Musk was awarded the Axel Springer Award.\n* Musk ranked No.1 on Businessperson Of The Year 2020 List By Fortune Magazine.\n* On January 7, 2021, Musk was ranked as the wealthiest person in the world according to Bloomberg.\n* On January 10, 2021, Musk was ranked #1 on Forbes Billionaires List.\n* Financial Times named Musk 2021 Person of the Year for his contribution to accelerate the world's auto industry towards EVs.\n* Musk added to Newsweek Hall of fame for his disruption in Auto and Space Industry.\n* On December 13, 2021, Time magazine named Musk Person of the Year.\n* On February 9, 2022, National Academy of Engineering announced that Musk was among their new, peer-elected members, an award considered to be among the highest professional distinctions accorded to an engineer, \"for breakthroughs in the design, engineering, manufacturing, and operation of reusable launch vehicles and sustainable transportation and energy systems\".\n* On May 20, 2022, Musk was awarded with the Order of Defence Merit by the Brazilian government after negotiating the launch of the Starlink internet service in the Amazon rainforest.\n* On January 6, 2023, Guinness World Records reported that Musk broke a world record for the largest loss of wealth at approximately $182 billion, as estimated by Forbes.\nReferences"
    }
  ]
}