{
  "content": [
    {
      "type": "text",
      "text": "# List of Vikings episodes\n\nVikings is a historical drama television series written and created by Michael Hirst for the History channel. Filmed in Ireland, it premiered on March 3, 2013, in Canada. Vikings is inspired by the sagas of  Viking Ragnar Lothbrok, one of the best-known legendary Norse heroes. The series portrays Ragnar's and his family's rise from farmers to nobility and fame through successful raids into Anglo-Saxon kingdoms and Francia. The series is also inspired by, and loosely adapts, various historical events from European history during the Early Middle Ages.\nSeries overview\n| end1       =\n| color2     = #555555\n| link2      = List of Vikings episodes#Season 2 (2014)\n| episodes2  = 10\n| start2     =\n| end2       =\n| color3     = #C4CAC4\n| link3      = List of Vikings episodes#Season 3 (2015)\n| episodes3  = 10\n| start3     =\n| end3       =\n| link4       = List of Vikings episodes#Season 4 (2016–2017)\n| episodes4   = 20\n| color4A     = #3A3634\n| episodes4A  = 10\n| start4A     =\n| end4A       =\n| color4B     = #0FADB8\n| episodes4B  = 10\n| start4B     =\n| end4B       =\n| link5       = List of Vikings episodes#Season 5 (2017–2019)\n| episodes5   = 20\n| color5A     = #1A2125\n| episodes5A  = 10\n| start5A     =\n| end5A       =\n| color5B     = #2A5F71\n| episodes5B  = 10\n| start5B     =\n| end5B       =\n| link6       = List of Vikings episodes#Season 6 (2019–2021)\n| linkR6      =\n| episodes6   = 20\n| color6A     = #83A4AE\n| episodes6A  = 10\n| start6A     =\n| end6A       =\n| color6B     = #241819\n| episodes6B  = 10\n| start6B     =\n| end6B       =\n}}\nEpisodes\nSeason 1 (2013)\nSeason 2 (2014)\nSeason 3 (2015)\nSeason 4 (2016–2017)\nSeason 5 (2017–2019)\nSeason 6 (2019–2021)\nSpecials\n''Athelstan's Journal\nA series of 13 webisodes known as Vikings: Athelstan's Journal, directed by Lucas Taylor and written by Sam Meikle, was released by the History Channel. Each webisode serves as a journal entry for the Vikings character Athelstan. The webisodes were released prior to and in conjunction with the beginning of the third season of Vikings.  available on YouTube, the webisodes have a running time of 1:45 to 5:01 minutes.\n}}\n}}\n}}\n}}\n}}\n}}\n}}\n}}\n}}\n}}\n}}\n}}\n}}\n}}\nSaga'' recaps\n|ShortSummary    = A recap of seasons 1–4, part 1 which aired before season 4, part 2. The cast and Michael Hirst discuss the remaining episodes of season 4.\n|LineColor       = 500000\n}}\n|ShortSummary    = A recap of seasons 1–4 which aired before season 5. The Seer narrates the story of Lagertha to Ivar. The cast and Michael Hirst discuss season 5, part 1.\n|LineColor       = 500000\n}}\n|ShortSummary    = A recap of seasons 1–5, part 1 which aired before season 5, part 2. Torvi narrates the story of Bjorn to their son Hali. The cast and Michael Hirst discuss the remaining episodes of season 5.\n|LineColor       = 500000\n}}\n|ShortSummary    = A recap of Floki's arc from the first five seasons with Ivar narrating the story to Vigrid. Alex Høgh Andersen, Jordan Patrick Smith, Georgia Hirst, Peter Franzén, Marco Ilsø and Michael Hirst discussed the first half of the final season.\n|LineColor       = 500000\n}}\n|ShortSummary    = A recap where Bjorn reunited with his brothers Ivar and Hvitserk for a strange gathering after Bjorn is gravely injured in battle. As they share tales of the exploits of their people and prophecies of Ragnarök, it becomes clear this is not a simple reunion.\n|LineColor       = 500000\n}}\n}}\nSee also\n*\nNotes\nReferences\nExternal links\n*\n*"
    }
  ]
}