{
  "content": [
    {
      "type": "text",
      "text": "# List of awards and honours received by Harold Pinter\n\nHonours and awards to Harold Pinter lists (in chronological order) honours, awards, prizes, and honorary degrees received by English playwright Harold Pinter (1930–2008), which often acknowledge his international importance and his reach beyond national and regional boundaries.\nBackground\nPinter declined a British knighthood in 1996, when it was offered to him on behalf of Queen Elizabeth II by British Prime Minister John Major, then leader of the Conservative Party. Despite his declining it, many in the media (both in the UK and elsewhere) still refer erroneously to Pinter as \"Sir Harold Pinter\".\nIn addition to having already been made a Commander of the Order of the British Empire (CBE) in 1966, he accepted his appointment as Member of the Order of the Companions of Honour (CH) for services to Literature from the British monarch in 2002.  He was presented the Nobel Prize in Literature in December 2005 and the French Légion d'honneur in January 2007.\nHe was awarded academic honorary degrees at the University of Leeds, in April 2007 (in person), at which its Humanities faculty processed in full academic garb solely to present the honorary doctorate to Pinter; at the University of Kragujevac, in Serbia; and at the University of Cambridge, in June 2008 (both of the latter in absentia). In December 2007, the British Library announced that it had acquired his literary archive for over £1.1 million (approx. US$2.24 million) on behalf of the British nation.\nAfter having accepted the honorary presidency of the Central School of Speech and Drama, a constituent college of the University of London, in October 2008, he received an honorary fellowship during its honorary degree ceremony, also in absentia, due to ill health, on 10 December 2008, two weeks before his death from cancer on 24 December 2008.\nHonours, awards, and prizes\n*Best Play award for The Caretaker in the Evening Standard Theatre Awards, 1960\n*Commander of the Order of the British Empire (CBE), 1966\n*Best Play award for The Homecoming in the 1967 Tony Awards\n*Shakespeare Prize (Hamburg), 1970\n*European Prize for Literature (Vienna), 1973\n*Pirandello Prize (Palermo), 1980\n*Giles Cooper Award, 1981\n*Order of Merit (Chile), 1992\n*America Award, 1995\n*The David Cohen Prize for Literature, 1995\n*Honorary fellow of Queen Mary, University of London\n*Laurence Olivier Special Award, 1996\n*Molière d'honneur, Paris, in recognition of his life's work, 1997\n*The Sunday Times Award for Literary Excellence, 1997\n*BAFTA Fellowship, 1997\n*Companion of Literature, Royal Society of Literature, 1998\n*The Critics' Circle Award for Distinguished Service to the Arts, 2000\n*Brianza Poetry Prize (Italy), 2000\n*The South Bank Show Award for Outstanding Achievement in the Arts, 2001\n*S.T. Dupont Golden PEN Award, 2001 for a Lifetime's Distinguished Service to Literature\n*\"Premio Fiesole ai Maestri del Cinema\", Italy, 2001\n*World Leaders Award (World Leaders: A Festival of Creative Genius, Toronto), 2001\n*Hermann Kesten Prize for outstanding commitment on behalf of persecuted and imprisoned writers, awarded by German PEN (Berlin), 2001\n*Member of the Order of the Companions of Honour (CH) for services to Literature, 2002\n*Diploma ad Honorem, Teatro Filodrammatici (Milan), 2004\n*The Evening Standard Theatre Awards, 50th Anniversary – Special Award, 2004\n*Wilfred Owen Poetry Prize, 2005\n*Franz Kafka Prize, 2005\n*Nobel Prize in Literature, 2005\n*Europe Theatre Prize, 2006\n*Serbian Foundation Prize, 2006\n*St. George Plaque of the City of Kragujevac, 2006\n*Legion d'honneur, France, 2007\n*Blue plaque on his old home in Worthing, 2009\nHonorary degrees\n*University of Reading, 1970\n*University of Birmingham, 1971\n*University of Glasgow, 1974\n*University of East Anglia, 1974\n*University of Stirling, 1979\n*Brown University, 1982\n*University of Hull, 1986\n*University of Sussex, 1990\n*University of East London, 1994\n*University of Sofia, 1995\n*University of Bristol, 1998\n*Goldsmiths, University of London, 1999\n*Aristotle University of Thessaloniki, 2000\n*University of Florence, 2001\n*University of Turin, 2002\n*National University of Ireland, 2004\n*University of Leeds, 2007\n*University of Kragujevac, 2008\n*University of Cambridge, 2008\n*Central School of Speech and Drama, 2008\nEurope Theatre Prize\nIn 2006, he was awarded the X Europe Theatre Prize, in Turin, with the following motivation:\nHarold Pinter started out as an actor in 1951. In 2005 he won the Nobel Prize for Literature. In the intervening half-century he has been many things: playwright, screen-writer, director, poet and performer. But his greatest achievement has been to re-write the rules of drama. He has created poetry out of everyday speech with its pauses, hesitations and repetitions. He has constantly explored, like a theatrical Proust, the pervasive power of memory. And, in a sequence of remarkable plays from The Room (1957) to Celebration (2000), he has demolished the idea of the omniscient author: instead of manipulating character to a chosen end, Pinter presents the evidence as he sees it and allows the spectator freedom of interpretation. But, although Pinter is a true theatrical poet, his work and life are filled with a moral rage against injustice. He is a political writer, not in the sense of endorsing a party ideology but in his assault on the abuse of human dignity and the mis-use of language by those in power. There are many other facets to Pinter: the Cockney humourist, the skilled movie-writer, the heavyweight actor, the cricket-loving Englishman. But, if Pinter's plays are performed the world over, it is because they touch a universal chord. And what everyone recognises is that we live in a world of fear and anxiety briefly alleviated by memories of past happiness. Pinter speaks to audiences everywhere and to generations yet unborn; which makes him an ideal recipient of the Europe Theatre Prize.\nSee also\n*Characteristics of Harold Pinter's work\n*The Harold Pinter Archive in the British Library\n*List of people who have declined a British honour\nNotes\nFurther reading\n*Billington, Michael.  Harold Pinter.  2nd ed.  London: Faber and Faber, 2007.   (13).   (10). Print.  (The official authorized biography.) [Updated ed. of The Life and Work of Harold Pinter  1996.  London: Faber and Faber, 1997.]\n*The Swedish Academy.  [http://nobelprize.org/nobel_prizes/literature/laureates/2005/bio-bibl.html \"Bio-bibliography\"]: \"Harold Pinter, Nobel Prize in Literature 2005\".  NobelPrize.org.  The Swedish Academy and The Nobel Foundation, 2005. Web.  5 January 2009.  (Contains both [http://nobelprize.org/nobel_prizes/literature/laureates/2005/bio-bibl.html \"Biobibliographical Notes\"] and [http://nobelprize.org/nobel_prizes/literature/laureates/2005/pinter-bibl.html \"Bibliography\"], with the latter hyperlinked separately in site menu.)\nExternal links\n*[https://web.archive.org/web/20010503025827/http://www.haroldpinter.org/biography/index.shtml \"Harold Pinter: Awards\"] – Biography at HaroldPinter.org: The Official Website of the International Playwright Harold Pinter.  (Through 2007; periodically updated.)\n*[https://web.archive.org/web/20061001193335/http://www.pintersociety.org/events/events/pinterevents.html \"Harold Pinter's Appearances, Publications, or Productions\"] – Harold Pinter Society Webpage.  (Periodically updated.)"
    }
  ]
}