{
  "content": [
    {
      "type": "text",
      "text": "# List of accidents and incidents involving airliners in the United Kingdom\n\nThis list of accidents and incidents on airliners in the United Kingdom summarises airline accidents that occurred within the territories claimed by the United Kingdom (UK), with information on airline company with flight number, date, and cause.\nThis list is a subset of the list of accidents and incidents involving airliners by location; it is also available:\n*grouped by year as List of accidents and incidents involving commercial aircraft\n*grouped by airline\n*in alphabetical order\nFor alternative, more exhaustive lists, see:\n*[http://www.baaa-acro.com Bureau of Aircraft Accidents Archives]\n*Aviation Safety Network\n1910–1919\n;1919\n*1 May – an Aircraft Transport and Travel Airco DH.9, C6054, crashed at Portsdown Hill near Portsmouth in fog while operating from Hendon to Bournemouth on the first commercial flight in the United Kingdom; two occupants were killed.\n*20 October – an Aircraft Transport and Travel Airco DH.4A cabin biplane registered G-EAHG, crashed into the English Channel in bad weather.\n*11 December – G-EAHF, an Aircraft Transport and Travel Airco DH.4A, crashed at Caterham on a flight from Hounslow to Le Bourget. The pilot and passenger were killed.\n1920–1929\n.|alt=]]\n;1920\n*18 March – Aircraft Transport & Travel Airco DH.16 G-EACT crashed into the English Channel off Beachy Head; the pilot was rescued by a ship.\n*29 March – Nieuport Delage 30T F-CGTI crashed at Lympne.\n*14 December – Handley Page Transport Handley Page O/400 G-EAMA crashed on take-off from Cricklewood Aerodrome on a scheduled flight from London to Paris. Two crew and two of the six passengers were killed.\n;1921\n*25 January – a Belgian Airco DH.4 registered O-BAIN crashed near the Valiant Sailor pub at Dover Road, in Folkestone.\n*20 August – EARI, an Aircraft Transport & Travel de Havilland DH.18 force-landed and was wrecked at Wallington, Surrey following engine failure.\n*15 November – a Handley Page Type O suffered engine failure shortly after passing Lympne on a flight from Paris to Croydon, resulting in the loss of a propeller. The aircraft made a forced landing at Lympne, damaging the undercarriage in the process.\n;1923\n*10 January – De Havilland Aeroplane Hire Service Airco DH.16 G-EALM crashed at Stanmore, Middlesex. The pilot and a passenger were killed, three others were injured.\n*27 August – Farman F.60 Goliath F-AECB of Air Union crashed at East Malling, Kent following the failure of an engine and passengers misunderstanding an instruction to move aft, affecting the aircraft's centre of gravity. One of the thirteen people on board was killed.\n*14 September – Daimler Airway de Havilland DH.34 G-EBBS crashed near Ivinghoe, Buckinghamshire killing all five on board.\n;1924\n*24 April – Fokker F.III H-NABS of KLM departed Lympne for Rotterdam and Amsterdam and was never heard of again. It was presumed to have crashed into the sea, killing the pilot and both passengers.\n*24 December – G-EBBX, an Imperial Airways de Havilland DH.34, crashed shortly after take-off from Croydon Airport, killing all eight on board.\n;1925\n*8 February – a Farman F.60 Goliath of Air Union crashed whilst attempting to land at Lympne. The aircraft was on a cargo flight from Paris to Croydon when an engine failed over the Channel.\n;1926\n*18 August – Air Union Blériot 155 F-AIEB, named Wilbur Wright, crashed at Hurst, Kent whilst attempting a forced landing due to engine failure. Of the 15 passengers and crew on board, the pilot and two passengers were killed.\n*2 October – Air Union Blériot 155 F-AICQ, named Clement Ader, crashed at Leigh, Kent following a mid-air fire. All seven passengers and crew were killed.\n;1927\n*22 August – a KLM Fokker F.VIII, registration H-NADU, was on a flight from Croydon to Amsterdam when control of the aircraft was lost after the failure of the tailfin. The aircraft crashed into a tree at Underriver, Kent killing one of the eleven people on board.\n;1928\n*13 July – Vickers Vulcan G-EBLB of Imperial Airways, conducting a test flight from Croydon Airport with a pilot and five passengers on board, crashed near Purley, Surrey, with the loss of four passengers. As a result of the crash Imperial Airways stopped the flying of staff (so called joy rides) on test flights.\n;1929\n*19 May – Air Union Farman F.63bis Goliath F-GEAI, crashed at Keylands Sidings near Paddock Wood railway station, Kent while operating a flight from Croydon to Paris. It stopped yards from the signal box and was destroyed by fire; the pilot and mechanic escaped with minor injuries.\n*17 June – Imperial Airways' City of Ottawa, a Handley Page W.10 registered G-EBMT, crashed into the English Channel near Dungeness killing seven out of 13.\n*31 July – Compagnie des Grands Express Aériens Farman Goliath F-GEAB, on a flight from London to Paris carrying gold bullion, was damaged in a forced landing near Smarden in Kent. A hedge stopped the aircraft entering the River Beult although some of the gold bullion it was carrying ended up in the river; the bullion was recovered by spectators.\n*6 November – a Luft Hansa Junkers G 31 registered D-903 and named Oberschlesien crashed into trees at Godstone, Surrey. Six of the seven people on board were killed, including Prince Eugen of Schaumburg-Lippe, who was a member of the crew; aviator and race-car driver Glen Kidston was the only survivor. The aircraft was operating an international scheduled flight from Croydon to Amsterdam.\n1930–1939\n;1930\n*10 February – a Farman F.63 Goliath of Air Union, registration F-FHMY, crashed at Marden Airfield, Kent following structural failure of the starboard elevator. Of the six people on board, two passengers were killed.\n*2 May – Farman F.63 Goliath F-ADCA of Air Union crash-landed at Penshurst, Kent after encountering a heavy squall whilst on a flight from Le Bourget, Paris, France to Croydon.\n*25 July – Lioré et Olivier LeO 21 F-AIZO Golden Ray/Rayon dOr of Air Union made a forced landing at Snave, Kent following an engine failure. The aircraft was subsequently dismantled and removed to Hythe, Kent.\n*21 July – a Walcot Air Line Junkers F13 registered G-AAZK crashed at Meopham, Kent; all on board were killed.\n;1931\n*17 January – Breguet 280T F-AIVU of Air Union crashed whilst attempting to land at Lympne. The aircraft caught the boundary fence and crashed onto the airfield, damaging the forward fuselage and undercarriage. Of the eight people on board, one of the crew was injured.\n*8 August – Handley Page HP.42 G-AAGX Hannibal made a forced landing at Tatlingbury Farm, Five Oak Green following the failure of the port lower engine whilst on a flight from Croydon to Le Bourget, Paris. The tail of the aircraft was ripped off when it struck a telegraph pole.\n;1932\n*17 September – Lioré et Olivier LeO 212 F-AIFE of Air Union crashed at Selsdon Park near Croydon on a Paris to London mail flight, pilot killed.\n*29 October – Junkers W 33 D-2017 Marmara of Luft Hansa was on a freight flight from Croydon to Cologne when it crashed off the Kent coast.\n;1934\n*9 May –  Wibault 282T-12 F-AMHP of Air France crashed into the sea off Dungeness, Kent, killing all six people on board.\n*19 May – a Golden Clipper of Air France crash-landed on a cricket pitch adjacent to Croydon Airport, Surrey, due to fuel exhaustion. Only one of the ten people on board was injured.\n*31 May – Air France Lioré et Olivier LeO 213 F-AIVG hit a radio mast on take-off from Croydon and crashed killing both crew.\n*22 September – Handley Page W.10, registration G-EBMM a named Youth of New Zealand of Sir Alan Cobham's National Aviation Displays crashed into a field at Aston Clinton, Buckinghamshire, four crew killed.-->\n*29 September – Airspeed Courier G-ACSY of London, Scottish & Provincial Airways crashed just north of Shoreham, Kent killing all four people on board. The aircraft was on a scheduled international passenger flight from Heston to Paris.\n*2 October – de Havilland DH.89A Dragon Rapide G-ACPM of Hillman's Airways crashed into the sea off Folkestone, Kent, killing all seven people on board.\n*22 December – Air France Wilbaut 282T F-AHHO overran the airfield at Croydon and hit a house in Plough Lane, neither pilot or occupants of house seriously injured.\n;1935\n*26 January – Hillman's Airways de Havilland Dragon Rapide G-ACPO, operating a mail flight from Aldergrove Airport, Belfast to Stapleford Aerodrome, Abridge, Essex via Speke Airport, Liverpool, Lancashire crashed at Derbyhaven, Isle of Man, whilst attempting to divert to Ronaldsway Airport during bad weather.\n*1 July – Railway Air Services de Havilland Dragon G-ADED crashed on take-off from Ronaldsway Airport, Isle of Man injuring all seven people on board. The aircraft, which was operating a scheduled passenger flight from Ronaldsway to Ringway Airport, Manchester, Lancashire via Squires Gate Airport, Blackpool and Speke Airport, Liverpool, was destroyed in the subsequent fire.\n*3 July – a Cobham Air Routes Westland Wessex G-ADEW ditched in the English channel close to the Isle of Wight with the loss of the pilot, the one passenger was rescued.\n*10 December – a Sabena Savoia-Marchetti S.73 registered OO-AGN crashed at Tatsfield, Surrey while on approach to Croydon at the end of a flight from Brussels; all four crew and seven passengers were killed.\n;1936\n*16 May – British Airways Spartan Cruiser G-ACYL crashed on landing at Hall Caine Airport, Ramsey, Isle of Man. The aircraft was operating a scheduled passenger flight from Abbotsinch Airport, Glasgow. Despite the loss of a wing in the accident, the aircraft was repaired and returned to service.\n*9 December – KLM Douglas DC-2 PH-AKL crashed into a house shortly after take-off from Croydon Airport. Amongst the fifteen people killed were autogyro inventor Juan de la Cierva, and former Prime Minister of Sweden Arvid Lindman; two crew members were the only survivors.\n;1937\n*9 December – Handley Page H.P.45 G-AAXD Horatius of Imperial Airways was struck by lightning whilst flying across the Channel from Paris to Croydon. A precautionary landing was made at Lympne where it was found that minor damage had been done to a wing.\n*13 December – British Airways Lockheed 14 G-AEPP landed at Croydon in a snowstorm and hit a hangar and was destroyed. All four people on board survived with slight injuries.\n;1938\n*9 May – Isle of Man Air Services de Havilland Express G-AENR crashed on landing at Ronaldsway Airport, Isle of Man. The aircraft was operating a mail flight from Speke Airport, Liverpool, Lancashire. Despite substantial damage to the port lower wing and both port engines, the aircraft was repaired and returned to service.\n*1 June – SABENA Fokker F.VII OO-AIL crashed into the grounds of Sellindge Methodist Church whilst attempting to land at Lympne during a thunderstorm.\n*In September, Handley Page H.P.45 G-AAXD Horatius of Imperial Airways suffered damage to its port undercarriage and lower port wing in a forced landing at Lympne; the aircraft was repaired and returned to service.\n*25 June – Blackpool & West Coast Air Services, de Havilland Dragon G-ADCR crashed in heavy fog during landing at Land's End Airport, Cornwall following a flight from the Isles of Scilly; killing the pilot & injured six passengers.\n*4 November – Jersey Airways de Havilland Express registration G-ACZN crashed at Saint Brélade, Jersey shortly after take-off on a flight from Jersey Airport to Southampton Airport; all thirteen people on board were killed as well as one person on the ground.\n*22 November 1938 – British Airways Lockheed 14 G-AFGO crashed at Walton Bay near Portishead while on a test flight, two crew killed.\n;1939\n*11 February – Hawker Audax K7459 crashed into a house in Brighton, killing the pilot and three people in the house.\n*19 June – Short S.30 Empire flying boat G-AFCW Connemara of Imperial Airways burnt out and sank at Hythe, Hampshire during refuelling. Fire started on the refuelling barge and spread to the flying boat, one of the engineers from the barge was killed.\n*20 November – Airspeed Oxford G-AFFM being operated by British Airways crashed at Gosport, Hampshire after it hit a barrage balloon cable, two crew killed.\n1940–1949\n;1940\n*15 January – a Lockheed 14 G-AFMO of British Airways crashed on take-off at Heston Aerodrome, aircraft destroyed but those on board unhurt.\n*22 April – a Lockheed 14 G-AFKD of British Overseas Airways Corporation crashed at Beinn Uird, near Loch Lomond, Scotland; three crew killed.\n*23 May – BOAC Armstrong Whitworth Ensign G-ADTA Euryalus crash-landed at Lympne and was damaged. The aircraft was one of six that escaped after a Luftwaffe raid on Merville Airfield, France. The intended destination was Croydon. Approaching the English coast, first she lost her port inner engine and the pilot set course for Hawkinge. A short time later her starboard inner engine also had to be shut down. The pilot changed course for Lympne. On landing, the starboard undercarriage was not fully down, causing the wing to scrape the ground and the aircraft to go through a fence as no braking was attempted. Euryalus was flown to RAF Hamble in June, but it was decided to cannibalise her to repair G-ADSU Euterpe which had been damaged in an accident at Bonnington on 15 December 1939. Euryalus was officially written off on 15 November 1941 and scrapped in September 1942.\n;1941\n*1 September – a BOAC Consolidated Liberator I registration AM915, crashed into Achinhoan Hill (), Campbeltown, Argyllshire, Scotland, killing all 10 passengers and crew. The aircraft was operating a ferry flight from Montreal, Canada to RAF Heathfield, Ayrshire, Scotland.\n;1942\n*15 February – a BOAC Consolidated Liberator I C I, registered G-AGDR, was shot down in error by two Royal Air Force Supermarine Spitfires over the English Channel off the Eddystone Lighthouse, killing all 9 passengers and crew. The aircraft was on a flight from RAF Cairo West, Egypt to the United Kingdom. The Polish pilots failed to identify the aircraft as friendly.\n;1943\n*17 December – BOAC Lockheed Lodestar G-AGDE crashed into the sea off Leuchars, Scotland on a flight from Bromma Airport, Stockholm, Sweden to RAF Leuchars; the accident killed all 10 passengers and crew on board the flight.\n;1946\n*6 November – KLM Douglas DC-3 PH-TBO crashed into trees at Shere, Surrey on approach to Croydon Airport, no fatalities but three slight injuries.\n*19 December – a Railway Air Services DC-3 G-AGZA crashed into houses on departure from RAF Northolt, Middlesex. There were no injuries amongst the five people on board, or the occupants of the houses. The pilot had taken off with wings contaminated by ice and snow.\n;1947\n*11 January – a Douglas Dakota of BOAC crashed at Stowting, Kent; eight out of 16 on board were killed.\n*25 January – a Douglas C-47A operated by Spencer Airways failed to get airborne from Croydon Airport and crashed into a parked aircraft, killing 12 of the 23 on board.\n*15 April – British European Airways de Havilland Dragon Rapide G-AHKR crashed into Slieu Ruy whilst operated a scheduled passenger flight from Speke Airport, Liverpool, Lancashire to Ronaldsway Airport, Isle of Man. There were only minor injuries amongst the six people on board.\n*3 July – Air Transport Association Avro Anson G-AHFV crashed into the English Channel  south south west of Brook, Isle of Wight. Both crew were killed.\n*25 July – Skyways Avro York G-AIUP overran the runway at Heathrow Airport, aircraft destroyed and three serious injuries.\n*23 August – an Avro Tudor on a test flight from Woodford Aerodrome crashed nearby with four of the six crew killed.\n*19 November – BOAC Short Hythe G-AGSU on a positioning flight from Hythe, Hampshire to Poole, Dorset crashed into high ground near Newport, Isle of Wight killing one of the four crew and seriously injuring the other three.\n*20 November – British Air Transport Avro Anson G-AIWW crashed into one of the Chain Home radio masts at the former RAF Boniface Down, Isle of Wight, killing both crew.\n*15 December – Lancashire Aircraft Corporation Handley Page Halifax G-AIHU crashed into the Cwm Mountain, Denbighshire, killing the four crew. The aircraft was operating an international scheduled cargo flight from Lille, Nord, France to Speke Airport, Liverpool, Lancashire.\n;1948\n*6 January – G-AHPK a Vickers Viking of British European Airways crashed near Ruislip, Middlesex. Pilot was killed and some of the passengers were seriously injured.\n*3 March – SABENA Douglas DC-3 OO-AWH crashed while landing at Heathrow Airport. Twenty of the 22 people on board were killed. The aircraft was operating an international scheduled passenger flight from Zaventem Airport, Brussels, Belgium to Heathrow.\n*21 April – a British European Airways Vickers Viking G-AIVE crashed into a mountain in Ayrshire, Scotland, no injuries to the 20 on board.\n*20 May – Air Transport Charter Douglas Dakota G-AJBG operating an international scheduled cargo flight from Valence-Chabeuil Airport, Drôme, France to RAF Bovingdon, Hertfordshire crashed near Bovingdon killing three of the four crew.\n*28 May – Miles Marathon G-AGPD of the Aeroplane and Armament Experimental Establishment operating a test flight from RAF Boscombe Down, Wiltshire crashed near Amesbury killing the two crew.\n*10 June – Hargreaves Airways de Havilland Dragon Rapide G-AIUI crashed at Cronk ny Arrey Laa, Isle of Man. Seven of the nine people on board were killed. The aircraft was operating a scheduled passenger flight from Speke to Ronaldsway.\n*11 June – Lancashire Aircraft Corporation Avro XIX G-AGNI ditched off Bradda Head, Isle of Man due to fuel exhaustion. The aircraft was operating a scheduled passenger flight from Squires Gate Airport, Blackpool to Ronaldsway Airport, Isle of Man via RAF Walney Island, Lancashire. All nine people on board were rescued by a trawler from Port Erin and the .\n*4 July – Scandinavian Airlines System Douglas DC-6 SE-BDA and Royal Air Force Avro York MW248 collided in mid-air over Northwood, London killing all 39 people on board. This remains the deadliest mid-air collision in the United Kingdom.\n*28 September – World Air Freight Handley Page Halifax G-AJNZ operating a domestic scheduled cargo flight from Speke Airport, Liverpool to RAF Nutts Corner, Belfast, crashed into Cronk ny Arrey Laa mountain on the Isle of Man, killing all four crew.\n*20 October – KLM Lockheed 049 Constellation PH-TEN operating a flight from Amsterdam Airport Schiphol to John F. Kennedy International Airport was due to make a brief stopover at Glasgow Prestwick Airport. Due to the crew's reliance on a combination of erroneous charts and incomplete weather forecasts, the aircraft was inadvertently flown into terrain near the airport. All 40 people on board (including 10 crew members) were killed.\n*11 November – Mannin Airways de Havilland Dragon Rapide G-AKOF on a charter flight from Dublin to the Ronaldsway Airport, Isle of Man. Ronaldsway was fog-bound, and after orbiting for almost an hour, diverted to Speke Airport, Liverpool. The Rapide ditched in the River Mersey after the pilot reported that the aircraft was out of fuel, killing both crew and five out of the six passengers on board. The accident investigation blamed the accident on a miscalculation of the remaining fuel by the pilot, the managing director of Mannin Airways.\n*22 November – Avro Lancastrian G-AHJW of Flight Refueling operating a non-scheduled passenger flight from RAF Wunstorf, Germany to Tarrant Rushton Airfield crashed at Conholt Park, Fyfield, Hampshire, killing all eight on board.\n;1949\n*19 February – British European Airways Douglas Dakota G-AHCW and Royal Air Force Avro Anson VV243 collided in mid-air near Exhall, Warwickshire.\n*6 May – G-AIFF a Bristol Freighter on a test flight from Filton Airport, Bristol, Somerset, crashed into the sea off Portland Bill, Dorset, following structural failure of the fin and rudder due to asymmetric forces experienced during a single-engine test. All seven people on board were killed.\n*6 June – Somerton Airways de Havilland Dragon Rapide G-AGPI crashed on landing at Somerton Airfield, Isle of Wight. Seven of the nine people on board were injured, one seriously.\n*19 August – British European Airways Douglas Dakota G-AHCY crashed near Ringway Airport, Manchester. Out of the 32 people on board 8 survived.\n1950–1959\n, Warwickshire in 1953.|alt=]]\n;1950\n*1 February – BOAC Short Solent G-AHIX sank in Southampton water during a test flight, aircraft destroyed but no injuries.\n*12 March – Fairflight Avro Tudor G-AKBY stalled and crashed Llandow, Glamorganshire, killing 80 of the 83 people on board.\n*21 March – Bristol Freighter G-AHJJ crashed near Cowbridge, Glamorganshire, Wales, on a test flight. All four crew killed.\n*15 April – BEA Vickers Viking G-AIVL was badly damaged by a bomb that detonated in the rear toilet compartment, but managed to safely land back at Northolt, with pilot I R Harvey being awarded the George Medal.  The aircraft was later repaired and returned to service with BEA.\n*17 October – British European Airways Douglas C-47A G-AGIW crashed shortly after take-off from RAF Northolt, Middlesex, killing 28 of the 29 people on board.\n*31 October – British European Airways Vickers Viking G-AHPN crashed on landing at London Heathrow Airport, killing 28 of the 30 people on board.\n;1951\n*8 March – Lancashire Aircraft Corporation Handley Page Halifax G-AJZY was operating a non-scheduled freight flight carrying frozen reindeer carcases when it crashed at Deep Mill Farm, Great Missenden, Buckinghamshire. All four crew were killed.\n*27 March – Air Transport Charter Douglas Dakota G-AJVZ crashed shortly after take-off from Ringway Airport, Manchester, killing four of the six people on board.\n*10 July – Air Navigation and Trading Company de Havilland Dragon Rapide G-ALXJ crashed into the sea off Laxey, Isle of Man, killing the pilot. The aircraft was operating a scheduled cargo flight from Squires Gate Airport, Blackpool, Lancashire to RAF Jurby instead of its normal destination of Ronaldsway Airport, which was fogbound.\n;1952\n*10 January – Aer Lingus Douglas Dakota EI-AFL crashed at Cwm Edno, Wales. All 23 people on board were killed.\n*14 June – Morton Air Services Airspeed Consul G-AHFT crashed into the sea off Brighton on a charter from Croydon to Le Mans, six killed.\n;1953\n*1 January – Aer Lingus Douglas Dakota EI-ACF St. Kieran was destroyed when it made a forced landing near Spernall, Warwickshire. There was one serious injury amongst the 25 people on board.\n*5 January 1953 – British European Airways Vickers Viking G-AJDL crashed on approach to Nutts Corner Airport, Belfast. Twenty-seven of the 35 people on board were killed.\n*28 January – Aquila Airways Short Sunderland G-AGKY capsized and sank off Calshot, Hampshire following a take-off accident in The Solent off Cowes, Isle of Wight. All on board were rescued before the aircraft sank.\n;1954\n*4 February – Ministry of Supply Bristol Britannia G-ALRX, on a test flight from Filton Airport, crashed onto Littleton Flats on the Severn Estuary, aircraft destroyed but no serious injuries.\n*19 June – Swissair Convair CV-240 HB-IRW ditched in the English Channel near Folkestone due to fuel exhaustion, killing 3 passengers out of 9 passengers and crew. The aircraft was operating an international scheduled passenger flight from Geneva International Airport to London.\n*16 August 1954 – Airwork Vickers Viking G-AIXS crashed on approach to Blackbushe Airport. The aircraft was destroyed. There were two serious injuries of the 37 on board.\n*6 November – Britavia Handley Page Hermes G-ALDJ crashed on a night approach to Blackbushe Airport in bad weather after a flight from Tripoli. Seven out of 80 passengers and crew died in the crash\n*25 December – BOAC Boeing 377 Stratocruiser G-ALSA crashed on landing at Prestwick Airport, Glasgow, killing 28 of the 36 people on board.\n;1956\n*20 January – BEA Vickers Viscount G-AMOM crashed on take-off from Blackbushe Airport on a training flight.\n*28 March – Starways Douglas DC-3 G-AMRB crashed at Largs, Ayrshire, killing one of the three crew.\n*30 April – Scottish Airlines Avro York G-AMUL crashed on takeoff from London Stansted Airport on a flight to Malta. The accident killed two passengers out of 49 passengers and 5 crew.\n;1957\n*14 March – British European Airways Vickers Viscount G-ALWE crashed on approach to Ringway Airport, Manchester killing all twenty people on board and a further two on the ground.\n*1 May – Eagle Airlines Vickers Viking G-AJBO crashed on take-off from Blackbushe Airport, killing 34 of the 35 people on board.\n*29 June – Island Air Services de Havilland Dragon Rapide G-AGUE crashed on take-off from Ramsgate Airport on a local pleasure flight and was written off, but all on board escaped uninjured.\n*28 September – British European Airways de Havilland Heron G-AOFY crashed on approach to Glenegedale Airport, Islay. Three people were killed.\n*6 November – Bristol Britannia G-ANCA on a test flight from Filton Aerodrome crashed on approach to the airport, killing four crew and 11 passengers.\n*15 November – Aquila Airways Short Solent G-AKNU Sydney crashed at Chessel Down, Isle of Wight, killing 45 of the 58 people on board.\n*23 December – Scottish Airlines Avro York G-AMUN crashed on approach to Stansted Airport, Essex. All four people on board were killed.\n;1958\n*15 January – Channel Airways de Havilland DH.104 Dove G-AOCE crashed on approach to Ferryfield Airport, Lydd, Kent due to a double engine failure caused by mismanagement of the fuel system. All seven people on board survived.\n*27 February – Manx Airlines Bristol Freighter G-AICS on a flight from the Isle of Man Airport to Manchester Airport met hazardous weather conditions near the Pennines. The aircraft was unintentionally flown directly into Winter Hill, killing 35 passengers. The weather that night was so severe that no one working in the nearby ITA transmitting station was aware of the crash.\n*2 September – Independent Air Travel Vickers Viking G-AIJE crashed at Southall, Middlesex killing all three people on board and a further four on the ground.\n*2 December – Hunting Clan Vickers Viscount G-ANRR on a post-maintenance test flight from London Heathrow Airport crashed near Camberley in Surrey and was destroyed by fire, three crew and three passengers killed.\n*24 December – British Overseas Airways Corporation Bristol Britannia G-AOVD on an airworthiness test flight from London Heathrow Airport hit a hill obscured by fog north of Christchurch, Hampshire, two crew and seven passengers killed.\n;1959\n*17 February – Turk Hava Yollari Vickers Viscount TC-SEV crashed at Newdigate, Surrey whilst on approach to Gatwick Airport. Fourteen of the 24 people on board were killed.\n1960–1969\non 4 June 1967.|alt=]]\nat Heathrow on 3 July 1968.|alt=]]\n;1960\n*7 January – BEA Vickers Viscount G-AOHU was damaged beyond economic repair when the nose wheel collapsed on landing at Heathrow Airport. A fire then developed and burnt out the fuselage. There were no casualties among the 59 people on board.\n*8 March – Skyways Handley Page Hermes G-ALDH starboard undercarriage collapsed during landing at London Heathrow Airport, resulting in the aircraft being written off. None of the six crew were injured in the incident.\n*9 October – Falcon Airways Handley Page Hermes G-ALDC overran the runway on landing at London Southend Airport ending up across the Shenfield to Southend railway line. The aircraft was written off but all 76 people on board survived.\n;1961\n*1 May – Eric Rylands' de Havilland Dragon Rapide G-AGOJ was damaged beyond economic repair in a landing accident at Lympne Airport.\n*17 October – A BKS Air Transport Douglas Dakota G-AMVC crashed on a flight from Leeds Bradford Airport to Carlisle Airport. The Dakota crashed on approach to the airport in low cloud, rain and strong winds. The crash killed all 4 crew.\n*1 November – Silver City Airways Bristol Freighter G-ANWL crashed on landing at Guernsey Airport, Channel Islands. Two of the ten people on board were killed.\n;1962\n*6 May – Channel Airways, Douglas C-47A G-AGZB crashed at St Boniface Down, Isle of Wight, killing 13 of the 18 people on board.\n*28 December - (Channel Air Bridge), Aviation Traders ATL98 'Carvair', G-ARSF, crashed on approach in a snowstorm at Rotterdam airport and overturned, killing the pilot, 3 crew + 14 pax safe\n;1963\n*22 October – the prototype BAC One-Eleven G-ASHG crashed at Chicklade, Wiltshire during a test flight when it entered a deep stall from which recovery was impossible.\n*6 November – Trans-Canada Air Lines Douglas DC-8 CF-TJM operating Flight 861 from London Heathrow Airport to Montreal, Quebec, Canada overran the runway after take-off was aborted. The aircraft was substantially damaged, but only a small number of minor injuries occurred amongst the seven crew and 90 passengers. The aircraft was repaired and returned to service.\n;1965\n*14 April – British United Airways Douglas C-47B G-ANTB crashed on landing at Jersey Airport, Channel Islands. There was only one survivor of the 27 people on board.\n*11 July – an Avro 748 G-ARMV of Skyways Coach-Air crashed on landing at Lympne Airport.\n*20 July – Cambrian Airways Vickers Viscount G-AMOL crashed on approach to Speke Airport, Liverpool, Lancashire.\n*27 October – BEA Vickers Vanguard G-APEE crashed on approach to Heathrow Airport, killing all 36 people on board.\n;1966\n*3 July – Hawker Siddeley Trident 1C G-ARPY 1966 Felthorpe Trident crashed at Felthorpe, Norfolk after entering an unrecoverable deep stall during a test flight.\n;1967\n*3 May – Channel Airways Vickers Viscount G-AVJZ crashed on take-off from London Southend Airport on a test flight. The aircraft was destroyed. The three crew survived but two people were killed on the ground.\n*4 June – British Midland Airways Canadair C-4 Argonaut G-ALHG crashed at Stockport, Cheshire whils on approach to Ringway Airport, Manchester, Lancashire following fuel starvation. Seventy-two of the 84 people on board were killed.\n*21 September- Aer Lingus Vickers Viscount EI-AKK overran the runway at Bristol Airport on landing after a flight from Dublin. All 21 passenger and crew were uninjured but the Viscount was damaged beyond repair in the accident.\n*4 November – Iberia Airlines Sud Aviation Caravelle EC-BDD crashed at Blackdown Hill, West Sussex, killing all 37 people on board and 88 sheep.\n;1968\n*8 April – BOAC Boeing 707-465 G-ARWE sustained an engine fire on take-off from Heathrow Airport. The engine fell off in flight but the fire could not be extinguished. An emergency landing was made at Heathrow, but four people were killed in the subsequent fire. Stewardess Barbara Jane Harrison was awarded a posthumous George Cross for her actions in the accident. , this remains the only George Cross ever awarded directly to a woman in peacetime.\n*3 July – BKS Air Transport Airspeed Ambassador G-AMAD crashed on landing at Heathrow Airport, London. The crashing aircraft collided with de Havilland Tridents G-ARPI and G-ARPT before ending up embedded in Terminal 1, which was then under construction. G-ARPT was damaged beyond economic repair. G-ARPI was repaired and returned to service, only to be lost in an accident in June 1972.\n;1969\n*5 January – Ariana Afghan Airlines Boeing 727-113C YA-FAR crashed at Horley, Surrey whilst on approach to Gatwick Airport, killing 50 of the 62 people on board, as well as two people on the ground.\n*20 February – British Midland Airways Vickers Viscount G-AODG crashed short of the runway at East Midlands Airport, Leicestershire during a radar approach in bad weather. The nose gear collapsed and the fuselage broke just ahead of the wings. The aircraft was damaged beyond economic repair but all 53 people on board survived.\n*20 March – British Midland Airways Vickers Viscount G-AVJA crashed on take-off from Ringway Airport, Manchester, Lancashire. The aircraft was operating a training flight. During a simulated engine failure control was lost and the aircraft rolled inverted and dived into the ground. Three of the four crew were killed.\n*15 April – Douglas DC-3D N4296 of Aviation Enterprises was destroyed by fire at Baginton Airport, Coventry.\n1970–1979\n;1970\n*19 January – Cambrian Airways Vickers Viscount G-AMOA was written off in a heavy landing at Bristol Airport; all 63 on board escaped uninjured.\n*22 January – British Midland Vickers Viscount G-AWXI was written off after an engine fire on departure from London Heathrow Airport, it returned and made an emergency landing. Some passengers were injured, one seriously during the emergency evacuation.\n*6 September – El Al Flight 219; an attempted hijacking over the English Channel failed due to the actions of the crew and a security agent on board. The Boeing 707 aircraft then made an emergency landing at London Heathrow Airport. This was one of five aircraft involved in the Dawson's Field hijackings. Another was Pan Am Flight 93, a Boeing 747 that was hijacked over Scotland the same day and subsequently flown to Cairo and was part of the Dawson's Field hijackings in Jordan.\n;1971\n*3 June – Moormanair Douglas DC-3 PH-MOA had an engine problem on departure from London Southend Airport. The aircraft made an emergency landing but overran and hit an earth bank. The aircraft was substantially damaged, but only two of the 36 on board were injured.\n*12 December – Britannia Airways Boeing 737 G-AVRN struck and killed a man on the runway during a night time landing at Birmingham Airport.\n;1972\n*18 June – British European Airways Hawker Siddeley Trident 1C G-ARPI entered a deep stall shortly after take-off from London Heathrow Airport and crashed near Staines, Middlesex, killing all 118 people on board. , this remains the deadliest accident involving a civil aircraft in the United Kingdom.\n;1973\n*19 January – British European Airways Vickers Viscount G-AOHI crashed into Ben More, Stirlingshire, killing all four people on board.\n;1974\n*18 April – Court Line Flight 95, operated by BAC One-Eleven G-AXMJ was involved in a ground collision with Piper PA-23 Aztec G-AYDE during take-off from Luton Airport, Bedfordshire. The Aztec had entered the active runway without permission. The pilot of the Aztec was killed and his passenger was injured. The One-Eleven aborted its take-off and an emergency evacuation was performed with all 93 people on board escaping uninjured. The Aztec was written off and the substantially damaged One-Eleven was repaired and returned to Service.\n*4 October – Delta Air Transport Douglas DC-6 OO-VGB was taking off on London Southend Airport runway 24 for a flight to Antwerp International Airport in Belgium when the nose gear collapsed, causing damage and fire to one of the engines. The aircraft stopped before the flight could overrun the runway. All 105 passengers and crew were uninjured in the accident and the DC-6 was written off.\n*24 December – British Island Airways Handley Page Herald G-BBXJ was written off in a landing accident at Jersey Airport. All 53 people on board escaped uninjured.\n;1975\n*20 July – British Island Airways Handley Page Herald G-APWF was substantially damaged in a take-off accident at London Gatwick Airport. All 45 people on board escaped uninjured.\n;1977\n*17 March – British Airtours Boeing 707 G-APFK crashed on landing at Glasgow Prestwick Airport during a training flight. The aircraft was destroyed in the post-crash fire. All four people on board escaped uninjured.\n;1979\n*31 July – Dan-Air Flight 0034, operated by Hawker Siddeley HS 748 G-BEKF crashed on take-off from Sumburgh Airport, Shetland Islands. Seventeen of the 44 people on board were killed.\n1980–1989\n;1980\n*17 July – Alidair Vickers Viscount G-ARBY, crash-landed at Ottery St Mary, Devon after running out of fuel on a charter flight from Santander, Spain to Exeter. All 62 people on board escaped uninjured. The aircraft was damaged beyond economic repair.\n;1981\n*26 June – Dan-Air Flight 240, a mail flight operated by Hawker Siddeley HS 748 Series 2A G-ASPL crashed at Nailstone, Leicestershire following the loss of the rear cabin door, leading to control difficulties, overstressing the airframe and in-flight break up. All three crew were killed.\n*18 September – Jersey European Airways Britten-Norman Islander G-BDNP crashed on approach to Guernsey Airport, Channel Islands. All nine people on board escaped uninjured.\n;1982\n*27 September – Harvest Air Douglas DC-3 G-AKNB was damaged beyond economic repair in an accident at Squires Gate Airport, Blackpool, Lancashire.\n;1984\n*1 June – Loganair Britten-Norman Islander G-BDVW crashed short of the runway at Sanday Airport, Orkney Islands. All eight people on board escaped uninjured.\n;1985\n*27 May – British Airtours Lockheed Tristar G-BBAI overran the runway on landing at Leeds Bradford Airport, West Yorkshire and was substantially damaged. All on board escaped with just a few minor injuries reported.\n*22 August – British Airtours Flight 28M operated by Boeing 737-236 G-BGJL suffered an engine fire on take-off from Manchester Airport. Take-off was aborted and an emergency evacuation was initiated. Fire spread to the passenger cabin, killing 53 and seriously injuring 15 of the 131 people on board.\n;1986\n*31 January – Aer Lingus Short 360 EI-BEM crashed on approach to East Midlands Airport, Leicestershire. Two of the 36 people on board were slightly injured.\n*12 June – Loganair de Havilland Canada DHC-6 Twin Otter G-BGPC crashed on approach to Glenegedale Airport, Islay. One of the sixteen people on board was killed.\n;1987\n*18 January – British Midland Airways Fokker F-27 G-BMAU crashed on approach to East Midlands Airport, Leicestershire whilst on a training flight. All three crew survived.\n*10 March – Pan Am Flight 125 operated by Boeing 747-100 N740PA on an international cargo flight from London Heathrow Airport to John F. Kennedy International Airport, New York, United States suffered a cargo door failure and pressurization problems and returned to Heathrow. No casualties were reported; however, the same issue that occurred aboard Pan Am Flight 125 is thought to have occurred two years later on United Airlines Flight 811 with fatal consequences.\n;1988\n*21 December – Pan Am Flight 103, operated by Boeing 747-100 N739PA en route from London Heathrow Airport to John F. Kennedy International Airport was blown up just after crossing the England-Scotland border. The terrorist attack was conducted by Libyan Abdelbaset al-Megrahi. All 243 passengers and 16 crew members on board the aircraft were killed as well as 11 residents of Lockerbie – the town on which a large percentage of the debris fell – which leaves a total of 270 deaths. , this remains the deadliest terrorist attack in the United Kingdom.\n;1989\n*8 January – British Midland Flight 92, operated by Boeing 737-400 G-OBME crashed at Kegworth, Leicestershire whilst on approach to land at East Midlands Airport. The aircraft was operating a scheduled domestic flight from London Heathrow Airport to Belfast International Airport when the port engine suffered a failure but the starboard engine was shut down. Of the 126 people on board, 47 were killed and 79 were injured.\n1990–1999\n;1990\n*10 June – British Airways Flight 5390, operated by BAC One-Eleven G-BJRT on an international scheduled passenger flight from Birmingham to Málaga, Spain suffered an explosive decompression when a windscreen in the cockpit blew out in flight. An emergency landing was made at Southampton Airport, Hampshire. Two of the 87 people on board were injured.\n*23 December – Manx Airlines BAe ATP G-OATP was substantially damaged in a landing accident at Ronaldsway Airport, Isle of Man. There were no injuries amongst the 73 people on board.\n;1992\n*6 October 1992 – British Aerospace BAe Jetstream 32 G-SUPR crashed shortly after take-off from Prestwick Airport, Ayrshire on test flight. Both crew were killed.\n;1994\n*25 February – British World Airlines Vickers Viscount G-OHOT, operating a cargo flight between Edinburgh Airport and Coventry Airport suffered triple engine failure due to flameout (although one engine was restarted) and crashed near Uttoxeter, killing one of the two crew on board.\n*21 December – Air Algérie Flight 702P, operated by Boeing 737-2D6C 7T-VEE crashed into a woodland in Binley, Coventry, Following a collision with an electric tower on approach to Coventry Airport, killing all five people on board, and injuring two who were struck by falling rubble as the landing gear of the plane clipped their houses.\n;1995\n*27 April – Airtours International Airways McDonnell Douglas MD-83 G-DEVR was substantially damaged when the port undercarriage collapsed whilst the aircraft was taxying after landing at Manchester Airport. There were no injuries amongst the 178 people on board. The aircraft was subsequently repaired and returned to service.\n*24 May – Knight Air Embraer 110P1 Bandeirante G-OEAA crashed shortly after take-off from Leeds Bradford Airport, killing all 12 people on board.\n;1996\n*19 May – a Loganair Britten-Norman Islander on a flight from Inverness Airport to Tingwall Airport in the Shetland Islands crashed on its second landing attempt. One of the three people on board was killed.\n;1997\n*5 November – a Virgin Atlantic Airbus A340-311 G-VSKY suffered a partial undercarriage failure while being prepared for a landing at London Heathrow Airport. After numerous attempts to free the jammed left main undercarriage, an emergency landing was made. The aircraft suffered substantial damage. Seven of the 114 people on board were slightly injured in the subsequent emergency evacuation. The aircraft was repaired and returned to service.\n*7 December – Air UK Fokker F-27 Mk 500 G-BNCY overran the runway on landing at Guernsey Airport and was damaged beyond economic repair. There were no injuries amongst the 54 people on board.\n;1998\n*31 March – Emerald Airways Hawker Siddeley HS 748 G-OJEM suffered an uncontained engine failure immediately after take-off from London Stansted Airport, Essex. The aircraft was landed back on the runway but overran the end and the nose gear collapsed. All 44 people on board evacuated without injury. The aircraft was damaged beyond economic repair.\n*28 November – DNK Aviation Leasing de Havilland Canada Dash 7 VP-CDY crashed at Ashburton, Devon whilst operating a test flight from Guernsey Airport, Channel Islands. Both crew were killed.\n;1999\n*12 January 1999 – Channel Express Fokker F-27 Mk 500 G-CHNL stalled and crashed on approach to Guernsey Airport, Channel Islands. Both crew were killed. Two houses were destroyed by fire and one person on the ground was injured.\n*22 December – Korean Air Cargo Flight 8509, operated by Boeing 747-2B5F HL7451 bound for Malpensa Airport, Milan, Italy crashed two minutes after takeoff from London Stansted Airport. All four crew members were killed.\n2000–2009\non 17 January 2008 received worldwide media attention despite there being only minor injuries among the occupants.|alt=]]\n;2000\n*6 February – Ariana Afghan Airlines Flight 805, operated by Boeing 727-228 YA-FAY, was hijacked on a domestic scheduled passenger flight from Kabul, Afghanistan to Mazar-i-Sharif. After landing at Tashkent and Aktyubinsk in Uzbekistan, and then at Moscow's Sheremetyevo International Airport, the aircraft was flown to London Stansted Airport where the hijackers surrendered after four days. There were no injuries amongst the 187 people on board.\n*17 June – CityFlyer Express Flight 8106, operated by a BAe 146, was subjected to an attempted hijack on an international scheduled passenger flight from Zürich, Switzerland to London Gatwick Airport. The aircraft landed at Gatwick where the hijacker was arrested. There were no injuries amongst the 98 people on board.\n;2001\n*4 February – Short 360-100 EI-BPD of Aer Arann was damaged beyond economic repair in a landing accident at Sheffield City Airport, South Yorkshire when the pilot mishandled the propeller controls, resulting in a heavy landing and departure from the runway.\n*27 February – Loganair Flight 670A, operated by Short 360-100 G-BNMT, suffered a double engine failure shortly after take-off from Edinburgh Airport on a mail flight to Belfast International Airport, Northern Ireland. Both pilots were killed and the aircraft was damaged beyond economic repair when it ditched in the Firth of Forth off Granton.\n*10 May – Spanair Flight 3203, operated by McDonnell Douglas MD-83 EC-FXI, was substantially damaged when the starboard undercarriage collapsed on landing at Liverpool Airport. All 51 people on board evacuated via the escape slides. The substantially damaged aircraft was repaired and returned to service.\n;2002\n*24 December – North Flying Flight 924, operated by Fairchild Metro III OY-BPH, crashed on take-off from Aberdeen Airport following a bird strike. Both crew escaped uninjured, the aircraft was written off.\n;2005\n*15 March – Loganair Britten-Norman Islander G-BOMG, carrying out an air ambulance mission, crashed on approach to Campbeltown Airport, Argyll and Bute. Both people on board were killed.\n;2006\n*15 June – TNT Airways Flight 325N was operated by Boeing 737-301F OO-TND on a scheduled international cargo flight from Liège, Belgium to London Stansted Airport, Essex. On arrival at Stansted, the visibility was too poor to allow a landing. The aircraft diverted to East Midlands Airport, Leicestershire where it landed heavily on the grassed area to the left of the runway. A go-around was initiated but the starboard undercarriage was ripped off when it touched down off the runway. A further diversion was made to Birmingham Airport, West Midlands where a successful emergency landing was made. The aircraft was damaged beyond economic repair but both crew escaped uninjured.\n;2007\n*29 April - Thomsonfly Flight 263H was operated by a Boeing 757-200 G-BYAW, a scheduled international passenger flight starting from Manchester Airport to Lanzarote. It had barely taken off from Manchester Airport when it suffered a bird strike, videographer Simon Lowe catching [https://www.youtube.com/watch?v=9KhZwsYtNDE footage of a bird being sucked into the right engine], causing it to flame. The pilot had planned to land in Liverpool John Lennon Airport, but was able to safely land back at Manchester. None of the 221 passengers and 12 crew members on board were injured.\n*18 August – Swiss European Air Lines Flight 444, a scheduled international passenger flight from Geneva, Switzerland to London City, was operated by Avro RJ100 HB-IYU. The aircraft was substantially damaged in a hard landing at London City Airport. All 93 people on board escaped uninjured. The aircraft was repaired and returned to service.\n;2008\n*17 January – British Airways Flight 38 operated by Boeing 777-236 G-YMMM, was a scheduled international passenger flight from Beijing, China to London Heathrow. It suffered a double engine failure on approach to Heathrow, landing short of the threshold. The aircraft was written off, the first for a Boeing 777. There were 47 injuries amongst the 152 people on board. The double engine failure was caused by ice in the fuel blocking the fuel-oil heat exchangers on both engines.\n;2009\n*13 February – BA CityFlyer Flight 8456 was a scheduled international passenger flight from Amsterdam to London City Airport. It was operated by Avro RJ100 G-BXAR. On landing at London City, the nose gear collapsed. All 72 people on board evacuated by the emergency escape slides. The aircraft was damaged beyond economic repair.\nSee also\n*Air transport in the United Kingdom\n*List of accidents and incidents involving airliners by location\n*List of mid-air collisions and incidents in the United Kingdom\nNotes\n#This article only lists accidents and incidents involving civiian or privately chartered aircraft (i.e. excluding military crashes).\n#Where flight numbers were not used or are not available, the aircraft registration number is listed instead.\n#For the purpose of this article, airports involved in airliner accidents and incidents are listed by the title they went by when the incident occurred.\n#As the article heading states, only accidents and incidents on United Kingdom soil or within British airspace are listed; flights associated with UK airports are not included (i.e. accidents and incidents on aircraft that have left the UK's airports or were bound for them).\n#Links in italics are links to an article on the accident or incident.\n#Accidents and incidents highlighted in bold resulted in 50+ fatalities.\n#For the purposes of this artcle, the term 'United Kingdom' shall include the Channel Islands and the Isle of Man. It shall also include the Republic of Ireland for any accident occurring before 1923, when the 26 counties formed part of the United Kingdom of Great Britain and Ireland.\nReferences\n;Citations\n;Bibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}