{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in Mongolia__disambig_1\n\n}}\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) designates World Heritage Sites of outstanding universal value to cultural or natural heritage which have been nominated by countries which are signatories to the UNESCO World Heritage Convention, established in 1972. Cultural heritage consists of monuments (such as architectural works, monumental sculptures, or inscriptions), groups of buildings, and sites (including archaeological sites). Natural heritage consists of natural features (physical and biological formations), geological and physiographical formations (including habitats of threatened species of animals and plants), and natural sites which are important from the point of view of science, conservation, or natural beauty. Mongolia ratified the convention on 2 February 1990.\nMongolia has six sites on the list. The first site, the Uvs Nuur Basin, was listed in 2003. The most recent site, the Deer Stone Monuments and Related Bronze Age Sites, was listed in 2023. Two sites are natural and are shared with Russia. The other four sites are listed for their cultural significance. In addition, Mongolia has 12 sites on the tentative list.\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural, and vii through x are natural.\nTransnational site|outline=silver}}\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (province)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" data-sort-type=\"number\"|\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" style=\"background:#E0F0FF;\"| Uvs Nuur Basin\n|\n| Uvs, Zavkhan, Khövsgöl\n| 2003\n| 769rev; ix, x (natural)\n| This transnational site comprises seven properties in Russia and five in Mongolia. The Uvs Nuur Basin is a large endorheic basin that drains into the large, shallow, and very saline Uvs Lake. The basin contains a wide variety of habitats, including wetlands, steppe, different types of forests, fresh and saltwater ecosystems, as well as mountain tundra. The area is home to several bird species, snow leopard, Mongolian gerbil, argali, and Siberian ibex.\n|-\n! scope=\"row\" | Orkhon Valley Cultural Landscape\n|\n| Arkhangai, Övörkhangai\n| 2004\n| 1081rev; ii, iii, iv (cultural)\n| The cultural landscape along both banks of the Orkhon River covers extensive pastures and several archaeological sites. The area was home to several waves of nomadic peoples, with the first signs of settlement over 60,000 years ago. In the last two millennia, the valley has been inhabited by nomadic pastoralists, the Huns, Turkic peoples, the Uighurs, the Khitans, and finally the Mongols. In the 13th century, the latter created a vast Mongolian Empire with the capital in Karakorum. Monuments in the valley include the Orkhon monuments created by the Göktürks in the 8th century, the ruins of Ordu-Baliq, the capital of the Uyghur Khaganate in the 8th and 9th centuries, and the Erdene Zuu and Tövkhön Buddhist monasteries from the 16th and 17th centuries.\n|-\n! scope=\"row\" | Petroglyphic Complexes of the Mongolian Altai\n|\n| Bayan-Ölgii\n| 2011\n| 1382; iii (cultural)\n| This site comprises three complexes of petroglyphs, Tsagaan Salaa-Baga Oigor, Upper Tsagaan Gol, and Aral Tolgoi, parts of which are located in the Altai Tavan Bogd National Park. The earliest petroglyphs date to about 11,000 BCE, to the Late Pleistocene, and depict animals such as mammoths, rhinoceros, and ostriches that lived in the area when it was much colder and drier than today. Images from the following millennia depict the change in animal communities and the transition from hunting to a herding-based society and horse-dependent nomads. The most recent remains date to the later Turkic period (7th and 8th centuries CE).\n|-\n! scope=\"row\" | Great Burkhan Khaldun Mountain and its surrounding sacred landscape\n|\n| Khentii\n| 2015\n| 1440; iv, vi (cultural)\n| The area is believed to be the place where Genghis Khan, who established the Mongol Empire in 1206, was born and is buried. According to The Secret History of the Mongols, he formalized the practice of mountain worship, previously deeply rooted in shamanic traditions of nomadic peoples. The pilgrimage route to the mountain passes three ovoos (shamanic rock cairns). In the late 15th century, Buddhism replaced the mountain worship, but since the 1990s, some of the traditions have been revived and integrated with Buddhist rituals.\n|-\n! scope=\"row\" style=\"background:#E0F0FF;\" | Landscapes of Dauria\n|\n| Dornod\n| 2017\n| 1448rev; ix, x (natural)\n| Dauria, or Transbaikal, is a region east of Lake Baikal. The transnational site comprises areas of Daursky Nature Reserve in Russia and three areas in Mongolia, including the Mongol Daguur Biosphere Reserve. The landscape includes different steppe ecosystems, forests, and grasslands, as well as wetlands and lakes. The area is important as a nesting ground or migration route for several bird species, such as the white-naped crane (a specimen pictured), and is also a migration area of the Mongolian gazelle.\n|-\n! scope=\"row\"| Deer Stone Monuments and Related Bronze Age Sites\n| ]]\n| Khövsgöl, Arkhangai\n| 2023\n| i, iii (cultural)\n| This site comprises four clusters with deer stones, megaliths dating to the late Bronze Age and early Iron Age that were used for ceremonial and funerary practices. The stones are made of blocks of granite and engraved with depictions of deer, as well as with human faces, symbols, and different animals. About 1200 of these stones have been discovered so far. Monuments called khirgisüürs and slab burials are found at the sites as well.\n|}\nTentative list\nIn addition to sites inscribed on the World Heritage List, member states can maintain a list of tentative sites that they may consider for nomination. Nominations for the World Heritage List are only accepted if the site was previously listed on the tentative list. Mongolia has 12 properties on its tentative list.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (province)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" | UNESCO criteria\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\"| Desert Landscapes of the Mongolian Great Gobi\n|\n| several sites\n| 2014\n| viii, ix, x (natural)\n| This nomination comprises three large areas in the Gobi Desert: Great Gobi Strictly Protected Area – Part A and Part B, and Small Gobi Strictly Protected Area – Part B. The harsh landscape with a vast range of intact desert features is home to several large mammal species, many of which are endangered or threatened. They include the saiga antelope, snow leopard, Przewalski's horse, Mongolian wild ass, goitered gazelle, and wild Bactrian camel (pictured).\n|-\n! scope=\"row\"| Cretaceous Dinosaur Fossil Sites in the Mongolian Gobi\n|\n| several sites\n| 2014\n| vii, viii (natural)\n| During the Late Cretaceous, what is now the Gobi Desert had a humid climate with abundant water resources, and was home to numerous dinosaur species. In the 100 years of excavations, paleontologists have uncovered nearly 80 dinosaur genera, dating to the period from 99 to 70 million years ago. The findings had immense importance in the development of paleontology and on understanding of the evolution of dinosaurs. Among the important finds are the first nest with dinosaur eggs, discovered in 1922, and the Fighting Dinosaurs (pictured), the remains of a Protoceratops and a Velociraptor in combat.\n|-\n! scope=\"row\"| Eastern Mongolian Steppes\n|\n| several sites\n| 2014\n| ix, x (natural)\n| This nomination comprises five properties with the largest remaining intact temperate grasslands in the world. The landscape is dominated by five types of grasses, as well as bushes and shrubs. The steppes are home to the herds of Mongolian gazelle (illustration pictured) which graze on the grasses. Other mammal species include the goitered gazelle, tarbagan marmot, five-toed pygmy jerboa, and Kozlov's pygmy jerboa.\n|-\n! scope=\"row\"| Amarbayasgalant Monastery and its Surrounding Sacred Cultural Landscape\n|\n| Selenge\n| 2014\n| ii, iii (cultural)\n| The Buddhist monastery, finished in 1736, is located at the end of a long deep valley. The valley has numerous Turkic-era graves dating to the 3rd to 7th centuries, which indicate long religious significance of the setting. The monastery blends different styles: the layout is Manchu, the architectural elements are Chinese, and the vernacular elements are Mongolian.\n|-\n! scope=\"row\"| Baldan Bereeven Monastery and its Sacred Surroundings\n|\n| Khentii\n| 2014\n| ii, iii, v (cultural)\n| The Buddhist monastery is located in the Khentii Mountains, close to several holy mountains, including the Burkhan Khaldun. It reached its peak in the early 19th century when the main temple was built. Today, three restored temples remain. The landscape surrounding the monastery preserves traditions of nomadic pastoralism and transhumance.\n|-\n! scope=\"row\"| Sacred Binder Mountain and its Associated Cultural Heritage Sites\n|\n| Khentii\n| 2014\n| ii, iii, v (cultural)\n| The sacred mountain is located in the Khentii Mountains. The area contains numerous archaeological sites dating from different periods, starting with the Paleolithic. Some of the sites include the Binder Ovoo (a cairn), the Almsgiver's wall (a stone masonry wall with a length of ), remains of settlements and burial sites from different periods, and several places with rock art and inscription in various languages. The remains reflect a fusion of shamanism and Buddhist traditions of nomadic peoples.\n|-\n! scope=\"row\"| Funeral Sites of the Xiongnu Elite\n|\n| several sites\n| 2014\n| ii, iii (cultural)\n| This nomination comprises five funeral sites of the Xiongnu, nomadic people who were the dominant power in the grasslands of Central Asia between the 4th century BCE and 2nd century CE and are the ancestors of modern Mongols. The sites show similar styles: big elite terraced tombs and small circular tombs and sacrificial features. The grave goods demonstrate the trade connections of the Xiongnu with the Qin and Han dynasty China, as well as with Graeco-Bactria and Persia.\n|-\n! scope=\"row\"| Archaeological Site at Khuduu Aral and Surrounding Cultural Landscape\n|\n| Khentii\n| 2014\n| iii, iv, vi (cultural)\n| The cultural landscape of Khuduu Aral is located at the meeting of mountains and dry steppe. The area has been inhabited since the Paleolithic by different nomadic communities, as demonstrated by numerous archaeological sites. In Avarga, Genghis Khan established his first capital, as described in The Secret History of the Mongols and ''Jami' al-tawarikh''. It was later used by his successors. Today, ruins are preserved.\n|-\n! scope=\"row\"| Petroglyphic Complexes in the Mongolian Gobi\n|\n| Dundgovi, Bayankhongor, Ömnögovi\n| 2014\n| iii (cultural)\n| This nomination comprises three sites with petroglyphs (Khavtsgait pictured), dating to the Bronze Age, roughly from the 4th to the 1st millennium BCE. They depict humans, animals, such as horses and camels, symbols, hunting scenes, men with carts, and a rare depiction of cattle pulling a plow. The petroglyphs illustrate the culture and religious beliefs of people who lived in the Mongolian Gobi and surrounding areas. The Javkhlant Khairkhan mountain is still venerated by the local herders.\n|-\n! scope=\"row\"| Highlands of Mongol Altai\n|\n| Bayan-Ölgii\n| 2014\n| ii, iii, iv, x (mixed)\n| This nomination comprises three properties in the Mongolian Altai Mountains, the Altai Tavan Bogd National Park (Tavan Bogd, the country's highest mountain, pictured) and two areas in the Siilkhem Mountain National Park. Different cultures left their marks on the area. The petroglyph complexes at Tavan Bogd are already listed as a World Heritage Site. There are Scythian burial sites from the 1st millennium BCE, deer stones, and kurgans. From the natural perspective, the area is home to animals such as the argali, snow leopard, and ibex.\n|-\n! scope=\"row\"| Sacred Mountains of Mongolia\n|\n| several sites\n| 2015\n| iii (cultural)\n| Mountain worship traditions have been taking place in Mongolia since the ancient times, initially with shamanistic practices and later with Buddhist rituals. Some mountains have temples or ovoos associated with them. Worshipers offer milk libations and chant prayers and sutras associated with the particular sacred mountain. Due to their sacred nature, the mountains have remained untouched and pristine. Otgontenger mountain is pictured.\n|-\n! scope=\"row\" | The Mongolian section of the Great Tea Route\n|\n| several sites\n| 2025\n| ii, iii, v, vi (cultural)\n| The Great Tea Route was an overland trade network stretching from Wuhan, China, crossing Mongolia, and continuing through Siberia to European Russia. It was established in the late 17th century, primarily to transport tea, but also knowledge, technological innovations, and arts. Camel caravans were used for transport. The nomination comprises 12 sites along the Mongolian section of the route, including transport stations, Choiriin Bogd sacred mountain, and historical places, such as the Gandantegchinlen Monastery (pictured).\n|}\nReferences"
    }
  ]
}