{
  "content": [
    {
      "type": "text",
      "text": "# List of canal locks in the United Kingdom\n\nThis is a selective list of canal locks in the United Kingdom which have unique features or are notable in some other way. This list is not comprehensive.\n{| class=\"wikitable\"\n|-\n! Lock\n! Canal\n! Grid Reference\n! Notes\n|-\n| Bath Locks\n| Kennet and Avon Canal\n|\n| Flight of six locks, in a quite ornate setting and including the UK's second deepest lock, two pumping stations and several Grade II listed buildings.\n|-\n| Bingley Five Rise Locks\n| Leeds and Liverpool Canal\n|\n| These staircase locks are the steepest flight of locks in the UK, with a gradient of about 1:5.\n|-\n| Bow Locks\n| River Lee Navigation\n|\n| These locks are bidirectional to connect to the tidal Bow Creek.\n|-\n| Caen Hill Locks\n| Kennet and Avon Canal\n|\n| Flight of 29 locks, 16 of which form an impressively steep flight in a straight line up the hillside.\n|-\n| Fourteen Locks\n| Monmouthshire Canal\n|\n| Dramatic flight of narrow and very deep locks featuring a unique and complex series of interdependent pounds.\n|-\n| Foxton Locks\n| Grand Union Canal (Leicester Line)\n|\n| Two \"staircases\", each of five locks. Alongside the locks is the site of the Foxton Inclined Plane, built in 1900 as a solution to operational restrictions imposed by the lock flight.\n|-\n| King's Norton Stop Lock\n| Stratford-upon-Avon Canal\n|\n| Stop lock with two guillotine gates.\n|-\n| Neptune's Staircase\n| Caledonian Canal\n|\n| Staircase lock of eight locks constructed by Thomas Telford in 1811 lifting boats .\n|-\n| Tardebigge Locks\n| Worcester and Birmingham Canal\n|\n| Longest flight in the UK. 30 locks rising 67m.\n|-\n| Tuel Lane Lock\n| Rochdale Canal\n|\n| Deepest lock in the United Kingdom, with a fall of 19' 8½\".\n|-\n| Watford Locks\n| Grand Union Canal (Leicester Line)\n|\n| Staircase of four locks, within an overall flight of seven.\n|}\nGallery\nImage:Bingley Five Rise Locks 1.JPG|Bingley Five Rise\nImage:Bow Locks low tide.jpg|Bow Locks\nImage:Watford Locks.jpg|Watford Locks\nImage:Caen.hill.locks.in.devizes.arp.jpg|Caen Hill flight\nSee also\n*Canals of the United Kingdom\n*Camden Lock, Commercial Road Lock, Limehouse Basin Lock\n*Locks on the Kennet and Avon Canal\n*Boat lift, Caisson, Caisson lock, Canal inclined plane, Canal pound, Flash lock, Lock staircase, Pound lock\n*List of canal aqueducts in the United Kingdom\n*List of canal basins in Great Britain\n*List of canal junctions in Great Britain\n*List of canal tunnels in the United Kingdom\nReferences"
    }
  ]
}