{
  "content": [
    {
      "type": "text",
      "text": "# List of English medieval pottery\n\nEnglish medieval pottery was produced in Britain from the sixth to the late fifteenth centuries AD.\nDuring the sixth to the eighth centuries, pottery was handmade locally and fired in a bonfire. Common pottery fabrics consisted of clay tempered with sand or shell, or a mix of sand and shell.  Pottery forms were common items used for cooking and storage, and were undecorated or decorated simply with incised lines.  By the eighth century, the slow wheel was being used by local craftsmen to finish pots. By the late ninth century, potters in urban areas started to mass-produce their products. A larger variety of forms were being made and decorated in new ways. During the tenth century, potters began transitioning to a fast wheel and firing pots in kilns. Grooved lines, thumbed-applied strips, stamping and rouletting were commonly used decorations.  From the thirteenth to the fifteenth centuries, glazed and slip pottery appeared more frequently in the marketplace, along with new fabric colours and decorations, and a large number of new forms.\nList of English medieval pottery\nThis is a partial list of English medieval pottery.\n{| class=\"wikitable sortable\" style=\"text-align:center\"\n|-\n|-\n! width=\"12%\" | Pottery Name !! width=\"12%\" | Time period !! width=\"20%\" |Characteristics!! width=\"10%\" | Origin!! width=\"10%\" | Image\n|-\n| Brandsby-type ware\n|| 13th to 14th centuries AD\n||  Finer and sandier, more hard-fired than the earlier York Glazed Ware\n|| Brandsby, North Yorkshire\n||\n|-\n|-\n| Coarse border ware\n||Late 13th to mid 14th centuries AD\n|| Later class of Surrey whiteware\n|Surrey-Hampshire border area\n||\n|-\n|-\n| Deritend ware\n||12th to 13th centuries AD\n|| Three types: Glazed, Reduced and Deritend cooking pot ware\n|| Birmingham\n||\n|-\n| Ham Green Pottery\n||Early 12th to mid 13th centuries AD\n|| Two types of decorated jugs: earlier yellow-splashed plain glaze and a later more green glaze\n|| Somerset\n||\n|-\n|-\n| Humber ware\n|| Late 13th to early 16th centuries AD\n||  Hard-fired, iron-rich usually red-bodied wares\n|| North Yorkshire\n||\n|-\n| Ipswich ware\n|| Early 8th to 9th centuries AD\n||  Hard, sandy grey ware made in both a smooth and gritty fabric\n|| Ipswich, Suffolk\n||\n|-\n| Sandy ware\n||8th to 16th centuries AD\n||  Includes a variety of sandy wares\n|| South East England, East Midlands\n||\n|-\n| Shelly ware\n|| 7th to 12th centuries AD\n|| The fabric is tempered with shell powder or reduced shell, typically handmade until the 10th century.\n|| Thames Valley, East Midlands, South East England\n||\n|-\n| Shelly-sandy ware\n||12th to 13th centuries AD\n|| The fabric is a blend of both sand and shell, most commonly quartz sand and ground-up shell\n|| Greater London\n||\n|-\n|-\n| Stamford ware\n||9th to 13th centuries AD\n|| One of the earliest forms of glazed English ceramics\n|| Stamford, Lincolnshire\n||\n|-\n| Surrey whiteware\n||  13th to 16th centuries AD\n|| includes Kingston-type ware, Coarse Border ware, Cheam ware\n|| Surrey-Hampshire border area\n||\n|-\n| Thetford ware\n||  Late 9th to mid-12th centuries AD\n||  Hard sandy fabric, typically grey in colour\n|| Norfolk  and Suffolk\n||\n|-\n|-\n| York Glazed Ware\n||  12th to 13th centuries AD\n||  The fabric has an open texture and can be light grey, light brown or pink\n|| Hambleton Hills, Yorkshire\n||\n|-\n|}\nSources"
    }
  ]
}