{
  "content": [
    {
      "type": "text",
      "text": "# List of advertising awards\n\nThis list of advertising awards is an index to articles about notable awards given to the advertising industry. The list is organized by the home country of the sponsor, although most awards are not limited to one country. The list is restricted to the advertising industry, as opposed to trade organizations, film and music festivals, and so on where the awards may be considered to have some advertising value.\n{|class=\"wikitable sortable\"\n|-\n!style=\"width:6em;\"|Country !! Award !! Sponsor !! Notes\n|-\n|Africa\n|Pitcher Awards\n|Pitcher Festival of Creativity\n|Pitcher Awards is the Pan-African benchmark for creative excellence. Awards are given annually in various areas of Print, Film, Outdoor , Radio Advertising, Media, PR, Entertainment, Digital and Sustainability Communications initiates.\n|-\n| Australia || YoungGuns International Award || YoungGuns Award || Best young commercial practitioners and students across the fields of advertising, communication design, digital creative, advertising media and public relations\n|-\n|Belarus\n|White Square Awards\n|Belarus Advertising Coalition\n|One of the most important Eastern European advertising festivals\n|-\n| Europe || Cristal Festival Awards || Cristal Festival Europe || Prizes are awarded to advertising agencies, producers and advertisers\n|-\n|Europe\n|Art Directors Club of Europe Awards\n|Art Directors Club of Europe\n|The best of the best, the ADCE Awards set the highest benchmark of creative excellence in Europe\n|-\n| France || Cannes Lions Awards || Cannes Lions International Festival of Creativity ||\n|-\n| France || Epica Awards || Epica || The only global creative award judged by members of the press. Rewards outstanding creativity\n|-\n| France || Lion of St. Mark (award) || Cannes Lions International Festival of Creativity || Lifetime of services to creativity in communications\n|-\n| India || MADDYS (award) || Advertising Club Madras || An oldest advertising club in India and have been running advertising awards for 40 plus years for both creative and media\n|-\n| Japan || Galaxy Award (Japan) || Japan Council for Better Radio and Television || Production award for television, radio and commercials\n|-\n|New Zealand\n|AXIS Awards\n|Commercial Communications Council\n|To celebrate and inspire the best creative advertising in Aotearoa New Zealand.\n|-\n|New Zealand\n|Beacon Awards\n|Commercial Communications Council\n|Celebrating outstanding media thinking in Aotearoa New Zealand.\n|-\n|New Zealand\n|Effie Awards\n|Commercial Communications Council\n|Awarding ideas that work in Aotearoa New Zealand.\n|-\n|New Zealand\n|Pressie Awards\n|Commercial Communications Council\n|Celebrating the best PR, Experiential and Social campaigns in Aotearoa New Zealand.\n|-\n| Portugal || Lisbon International Advertising  Festival Group || Lisbon Awards Group ||\nA global advertising award recognized for its prestigious jury members and for gathering in Lisbon some of the biggest names of the advertising and creativity's world. It is composed by the Lisbon International Advertising Festival and two others focused on PR and Health. https://www.lisbonawardsgroup.com/awards\n|-\n| South Africa || The Loeries ||  Loerie Awards Company || Awards for the brand communications industry, in Africa and the Middle East\n|-\n|Ukraine\n|Kyiv International Advertising Festival\n|All-Ukrainian Advertising Coalition\n|Annual Ukrainian international festival\n|-\n| United Kingdom || Cresta International Advertising Awards || Creative Standards International || Creative excellence in international advertising, digital design and marketing communications\n|-\n| United Kingdom || The Annual|| Creativepool || Global award for all creative disciplines, includes People's Choice and awards for both companies and individuals\n|-\n| United Kingdom ||  British Television Advertising Awards ||  British Arrows ||\n|-\n| United Kingdom || European Video Awards || VideoWeek || celebrate the outstanding creativity and innovation within the video & CTV advertising industry, the awards are open to agencies, publishers, adtech and brands across Europe\n|-\n| United Kingdom ||  London International Awards || London International Awards || Creativity, innovative ideas and new technology in advertising, digital media, production, design, package design, music & sound and branded entertainment\n|-\n| United Kingdom || Creative Circle Awards || Creative Circle || Person or organisation that has had the greatest impact on advertising / Single best advertising creative idea\n|-\n| United Kingdom || D&AD Pencils || Design and Art Direction || To promote excellence in design\n|-\n| United Kingdom || Eurobest European Advertising Festival || Ascential || Celebrates and rewards creative excellence in creative communications, advertising and related fields in Europe\n|-\n| United Kingdom || [https://shotsawards.com/ shots Awards] || Advertising publication || 3 focused awards covering EMEA, The Americas and Asia Pacific, these awards celebrate the most inspirational creative work, as well as showcasing some of the most successful companies and people in the industry.\n|-\n| United States || Graphis International Advertising Awards || Graphis Inc. || Honors creative excellence in advertising around the globe in print, digital, and video\n|-\n| United States || International ANDY Awards || The Advertising Club of New York || Recognize creative excellence in advertising and to raise the standards of craftsmanship in industry\n|-\n| United States || One Show awards | The One Club || Excellence in advertising ||\n|-\n| United States || REGGIE Awards || Association of National Advertisers || Innovative, impactful, and groundbreaking brand activation campaigns\n|-\n| United States || Shorty Awards || Shorty Awards || The best of social media - from creators to brands\n|-\n| United States || American Advertising Awards || American Advertising Federation ||\n|-\n| United States || American Advertising Federation Hall of Fame || American Advertising Federation ||\n|-\n| United States || Caddy Awards || Detroit Creative Directors Council || Notable advertising created in the Detroit area\n|-\n| United States || Clio Awards || Evolution Media || Innovation and creative excellence in advertising, design and communication\n|-\n| United States || DMACS Awards || Digital Media Advertising Creative Showcase || Creative talent in digital and rich media marketing for the entertainment industry\n|-\n| United States || Golden Trailer Awards || Golden Trailer Awards || Excellence in motion picture marketing, film trailers, posters and television advertisement\n|-\n| United States || Graphis Advertising Awards || Graphis || International juried awards promoting excellence in advertising and design. Award-wiinners are shown online and in the Awards Annual.\n|-\n| United States || National Student Advertising Competition || American Advertising Federation || Student's strategic advertising/marketing/media campaign for a corporate client\n|-\n| United States || OAAA OBIE Awards || Out of Home Advertising Association of America || Creativity in the out-of-home advertising industry\n|-\n| United States || Promax Awards || Promax International/BPME || Honor promotion, design and marketing\n|-\n| United States || Summit Awards || Summit International Awards || Excellence in the communications and marketing industry\n|-\n| United States || Digiday Awards || Digiday Awards || Recognition of companies, campaigns and creative modernizing media and marketing.\n|-\n| United States || DailyCommercials Awards || Advertising publication || Honor the most outstanding and innovative video advertising industry work, focusing on creativity, impact, and storytelling. These awards celebrate the best in video commercial advertising, recognizing the achievements of brands, agencies, and creative professionals.\n|-\n| United States || Jay Chiat Awards || 4A's (American Association of Advertising Agencies) || Recognizes the best strategy in marketing, media, and advertising around the world\n|}\nSee also\n* Gunn Report: annual publication identifying and detailing the most awarded new work within the advertising industry.\n* List of business and industry awards\n* Lists of awards\nReferences"
    }
  ]
}