{
  "content": [
    {
      "type": "text",
      "text": "# List of British gallantry awards for Operation Granby\n\nA list of British awards for gallantry in Operation Granby (Gulf War) in 1991. Apart from the Distinguished Service Order, a purely military award for leadership in combat, only gallantry awards have been included and only those that allow post-nominal letters.\nThe list includes the name, rank and regiment, corps or service of the recipient, the appointment they held at the time, the place and date of the action (although many awards were not made for specific actions), and (in brackets) the date of gazette of the award in the London Gazette. All were gazetted on 29 June 1991 unless otherwise indicated.\nDistinguished Service Order\nThe Distinguished Service Order (DSO) was primarily awarded for leadership and gallantry in combat in the face of the enemy. Usually restricted to senior officers at company to division level it was the second highest medal (after the Victoria Cross).\n* Major General Rupert Anthony Smith OBE QGM, late Parachute Regiment; General Officer Commanding, 1st Armoured Division\n* Brigadier Patrick Anthony John Cordingley, late 5th Royal Inniskilling Dragoon Guards; Commander, 7th Armoured Brigade\n* Wing Commander John Anthony Broadbent, Royal Air Force; Officer Commanding, No.XV Squadron and the Muharraq Tornado GR1 Detachment.\n* Wing Commander Ian Travers Smith, Royal Air Force; Officer Commanding, No. 16 Squadron RAF and Tabuk Tornado GR1 Detachment.\n* Wing Commander Glenn Lester Torpy, Royal Air Force; Officer Commanding, No. 13 Squadron RAF and Reconnaissance Element, Dhahran Detachment\n* Wing Commander Jeremy John Witts, Royal Air Force; Officer Commanding, No. 31 Squadron RAF and Dhahran Tornado GR1/1A Detachment\n* Major Andrew John Whistler MBE, Special Air Service. Awarded 29 June 1991, gazetted as Royal Regiment of Fusiliers, 25 April 1994.\n* Squadron Leader Simon Owen Falla, Royal Air Force. Awarded 29 June 1991, gazetted 1994.\n* Unidentified officer, Special Air Service. Awarded 29 June 1991.Note: Probably Andrew John Whistler. Awarded 29 June 1991, subsequently gazetted in 1994.\n* Unidentified officer, Special Forces, Royal Air Force. Awarded 29 June 1991.Note: Probably Simon Owen Falla, awarded 29 June 1991, subsequently gazetted in 1994.\nDistinguished Service Cross\nThe Distinguished Service Cross (DSC) awarded to officers for gallantry in the face of the enemy at sea.\n* Commander Richard Jeffrey Ibbotson, Royal Navy; Commanding Officer, HMS Hurworth\n* Commander Philip Lawrence Wilcocks, Royal Navy; Commanding Officer, HMS Gloucester\n* Lieutenant Commander David Lionel Harold Livingstone, Royal Navy; Helicopter Flight Commander, HMS Gloucester\n* Lieutenant Commander Michael Scott Pearey, Royal Navy; Helicopter Flight Commander, HMS Brazen\n* Lieutenant Stephen Michael Marshall, Royal Navy; Officer-in-Charge, Fleet Diving Unit A\n* Lieutenant Phillip David Needham, Royal Navy; Helicopter Flight Commander\n* Lieutenant Anthony Peter Williams, Royal Navy; Deputy Officer-in-Charge, Fleet Diving Unit B\nMilitary Cross\nThe Military Cross (MC) was awarded to officers and warrant officers for gallantry in the face of the enemy on land\n* Major Simon James Knapper MBE, Staffordshire Regiment; Officer Commanding, A Company, 1st Battalion; 25–26 February 1991\n* Major John Potter, Royal Highland Fusiliers; Officer Commanding, B Company, 1st Battalion The Royal Scots\n* Major John Matthew Rochelle, Staffordshire Regiment; Officer Commanding, C Company, 1st Battalion; 26 February 1991\n* Acting Major Nicholas Roy Davies, Special Air Service. Awarded 29 June 1991, gazetted as Royal Corps of Signals in 1997.\n* Acting Major Vincent James Tobias Maddison, Queen's Royal Irish Hussars; Squadron Commander; 25–26 February 1991\n* Captain Norman Graeme Scott Soutar, Royal Scots; Officer Commanding, A Company, 1st Battalion\n* Captain David John Wood MBE, Special Air Service. Awarded 29 June 1991, gazetted as Light Infantry in 1994.\n* Lieutenant Anthony Guy Briselden, Royal Regiment of Fusiliers; Anti-Tank Platoon Commander, 3rd Battalion; 26 February 1991\n* Lieutenant Darcy Mark Lambert Knight, Army Intelligence Corps, 29 June 1991\n* Lieutenant Steven Argent Wakely, Special Boat Service. Awarded 29 June 1991, gazetted as Royal Marines in 1994.\n* Second Lieutenant Richard Edmund Telfer, Royal Scots Dragoon Guards; Troop Commander; 25 February 1991\n* Warrant Officer Class 2 William Glen Guthrie McGill, Special Air Service. Awarded 29 June 1991, gazetted as Parachute Regiment in 1997.\n* Unidentified officer, Special Boat Service. Awarded 29 June 1991.Note: Probably Steven Argent Wakely. Awarded 29 June 1991, subsequently gazetted in 1994.\n* 3 unidentified officers, Special Air Service. Awarded 29 June 1991.Note: Probably includes David John Wood, Nicholas Roy Davies and William Glen Guthrie McGill. All awarded 29 June 1991, subsequently gazetted in 1994 and 1997.\nDistinguished Flying Cross\nThe Distinguished Flying Cross (DFC) was awarded to officers for gallantry in the face of the enemy in the air.\n* Wing Commander George William Pixton AFC, Royal Air Force; Officer Commanding, No. 41 Squadron RAF\n* Squadron Leader William Norman Browne, Royal Air Force; Buccaneer Navigator, Al Muharraq Detachment\n* Squadron Leader Gordon Christopher Aisthorpe Buckley, Royal Air Force; Senior Tornado Flight Commander, No. XV Squadron\n* Squadron Leader Richard Frank Garwood, Royal Air Force; Reconnaissance Tornado Pilot, Dhahran Detachment\n* Squadron Leader Michael Andrew Gordon MBE, Royal Air Force; Jaguar Flight Commander, No. 41 Squadron RAF\n* Squadron Leader Robert Ian McAlpine, Royal Air Force; Squadron Weapons Leader and Tornado Flight Commander, No. 20 Squadron RAF\n* Squadron Leader Douglas Elliot Moule, Royal Air Force; Tornado Pilot, No. 14 Squadron RAF\n* Squadron Leader Nigel Leslie Risdale, Royal Air Force; Tornado Pilot, No. XV Squadron\n* Flight Lieutenant Sean Keith Paul Reynolds, Royal Air Force. Awarded 29 June 1991, gazetted in 1994.\n* Flight Lieutenant Brian Geoffrey Marcel Robinson, Royal Air Force; Reconnaissance Tornado Pilot, Dhahran Detachment\n* Flight Lieutenant Edward David Smith, Royal Air Force; F-16 Pilot, 4th Tactical Fighter Squadron, United States Air Force\n* Flying Officer Malcolm David Rainer, Royal Air Force; Jaguar Pilot, No. 54 Squadron RAF\n* Unidentified officer, Special Forces, Royal Air Force. Awarded 29 June 1991.Note: Probably Sean Keith Paul Reynolds. Awarded 29 June 1991, subsequently gazetted in 1994.\nAir Force Cross\nThe Air Force Cross (AFC) was awarded to officers for bravery not in the face of the enemy in the air.\n* Group Captain Geoffrey Dennis Simpson, Royal Air Force; Officer Commanding, No. 101 Squadron RAF and RAF Detachment, King Khalid International Airport, Riyadh\n* Wing Commander Jerome Connolly, Royal Air Force; Officer Commanding, No. 6 Squadron RAF and Jaguar Detachment, Thumrait\n* Wing Commander Richard Vaughan Morris, Royal Air Force; Officer Commanding, No. 14 Squadron and Tornado Squadron, Al Muharraq\n* Wing Commander Andrew Ernest Neal, Royal Air Force; Officer Commanding, No. 120 Squadron RAF and Nimrod Detachment, Oman\n* Lieutenant Commander Peter Whitfield Nelson, Royal Australian Navy; Sea King Flight Commander, 845 Naval Air Squadron; 26 February 1991\nDistinguished Conduct Medal\nThe Distinguished Conduct Medal (DCM) was the second highest medal (after the Victoria Cross) awarded to other ranks for gallantry in the face of the enemy on land.\n* Warrant Officer Class 1 Peter Ratcliffe, Special Air Service. Awarded 29 June 1991, gazetted as Parachute Regiment in 1997.\n* Warrant Officer Class 2 Stephen Francis Maguire, Special Air Service. Awarded 29 June 1991, gazetted as Parachute Regiment in 1997.\n* Staff Sergeant Kevin Michael Davies, Commander, 3 Platoon, 203 Provost Company Royal Military Police. Awarded 29 June 1991.\n* Sergeant Steven Billy Mitchell (AKA Andy McNab), Special Air Service gazetted as Royal Green Jackets. Awarded 20 November 1991, gazetted in 1998.\n* Sergeant Terence Powell, Special Boat Service. Awarded 29 June 1991, gazetted as Royal Marines in 2006.\n* Corporal Floyd Matthew Woodrow, Special Air Service. Awarded 29 June 1991, gazetted as Parachute Regiment in 1997\n* Unidentified Royal Marine, Special Boat Service. Awarded 29 June 1991.Note: Probably Terence Powell. Awarded 29 June 1991, subsequently gazetted in 2006.\n* 3 unidentified soldiers, Special Air Service. Awarded 29 June 1991.Note: Probably includes Peter Ratcliffe, Stephen Francis Maguire and Floyd Matthew Woodrow. All awarded 29 June 1991, subsequently gazetted in 1997.\nConspicuous Gallantry Medal\nThe Conspicuous Gallantry Medal (CGM) was the second highest medal (after the Victoria Cross) awarded to other ranks for gallantry in the face of the enemy at sea or in the air.\n* Chief Petty Officer (Diver) Philip John Hammond, Royal Navy; Chief Petty Officer, Fleet Diving Units A & B\nCPO (Diver) Hammond was the last recipient of the CGM before the inception of the Conspicuous Gallantry Cross (CGC) in 1993. Only two CGM (Navy) were issued during the reign of Queen Elizabeth II: Hammond's for the Gulf War; and Sergeant Ian Prescott, a Royal Engineer who was attending a Naval task aboard HMS Antelope, in the Falklands War of 1982.\nDistinguished Service Medal\nThe Distinguished Service Medal (DSM) was the third highest medal awarded to other ranks for gallantry in the face of the enemy at sea.\n* Acting Petty Officer (Diver) Richard John Peake, Royal Navy; Acting Deputy Officer-in-Charge, Fleet Diving Unit A\n* Acting Petty Officer (Diver) Andrew Seabrook, Royal Navy; Fleet Diving Unit A\nMilitary Medal\nThe Military Medal (MM) was the third highest medal awarded to other ranks for gallantry in the face of the enemy on land.\n* Sergeant Michael James Dowling, Royal Electrical and Mechanical Engineers (posthumous). Fitter Sergeant, C Squadron, 16th/5th The Queen's Royal Lancers. Awarded 29 June 1991.\n* Sergeant Keith Goodlad, Special Air Service. Awarded 20 November 1991, gazetted as Green Howards in 1998.\n* Sergeant Andrew Melville, Special Air Service. Awarded 29 June 1991, gazetted as Parachute Regiment in 1997.\n* Sergeant Nicholas Mark Scott, Queen's Royal Irish Hussars, Tank Commander. Awarded 29 June 1991.\n* Corporal Kenneth Anderson, Royal Scots Dragoon Guards, Tank Commander. Awarded 29 June 1991.\n* Corporal Colin Armstrong (AKA Chris Ryan), Special Air Service. Awarded 29 June 1991, gazetted as Parachute Regiment in 1998.\n* Corporal David Edwin Denbury, Corps of Royal Engineers (posthumous). Gazetted as serving with the Special Air Service. Awarded 29 June 1991\n* Corporal Kevin Peter Dunbar, Special Air Service. Awarded 29 June 1991, gazetted as Parachute Regiment in 1997.\n* Corporal John Ernest Yourston, Special Air Service. Awarded 29 June 1991, gazetted as Parachute Regiment in 1997.\n* Lance Corporal Ian Michael Dewsnap, Corps of Royal Engineers, Plant Operator Mechanic, 73 Engineer Squadron. Awarded 29 June 1991.\n* Lance Corporal Kevin Melvin Simon Reid, Royal Electrical and Mechanical Engineers. Attached 10 (Assaye) Air Defence Battery Royal Artillery. Awarded 29 June 1991.\n* Lance Corporal Richard Sellers, Special Air Service. Awarded 29 June 1991, gazetted as Duke of Wellington's Regiment in 1997.\n* Private Thomas Robertson Gow, Royal Scots, Acting Section Second-in-Command, 5 Platoon, B Company, 1st Battalion. Awarded 29 June 1991.\n* Trooper Robert Gaspare Consiglio, Special Air Service (posthumous). Awarded 20 November 1991, gazetted as Private, Parachute Regiment in 1996.\n* Trooper Steven John Lane, Special Air Service (posthumous). Awarded 20 November 1991, gazetted as Lance Corporal, Corps of Royal Engineers in 1996.\n* Trooper Anthony Cyril James Nicholls, Special Air Service. Awarded 29 June 1991, gazetted as Private, Parachute Regiment in 1997.\n* 6 unidentified soldiers, Special Air Service. Awarded 29 June 1991.\nDistinguished Flying Medal\nThe Distinguished Flying Medal (DFM) was the third highest medal awarded to other ranks for gallantry in the face of the enemy in the air.\n* Sergeant Paul Douglas John Holmes, Royal Air Force. Awarded 29 June 1991 as unidentified member of Special Forces, Royal Air Force, subsequently gazetted as named recipient, 1996.\nAir Force Medal\nThe Air Force Medal (AFM) was awarded to other ranks for bravery not in the face of the enemy in the air.\n* Staff Sergeant Mark William Torpy, Army Air Corps, Qualified Helicopter Instructor, 659 Squadron AAC. Awarded 29 June 1991.\nQueen's Gallantry Medal\nThe Queen's Gallantry Medal (QGM) was the third highest medal (after the George Cross and George Medal) awarded for bravery not in the face of the enemy.\n* Sergeant Stephen Allen, Royal Artillery, 27 February 1991\n* Sergeant Trevor Hugh Smith, Royal Anglian Regiment; Platoon Sergeant, 8 Platoon, C Company, 3rd Battalion, Royal Regiment of Fusiliers; 26 February 1991\n* Corporal Michael John Driscoll, Royal Corps of Transport; Ambulance Driver; 28 February 1991\n* Corporal Mark Robert Griffiths, Royal Electrical and Mechanical Engineers; 26 February 1991\n* Fusilier Simon Bakkor, Royal Regiment of Fusiliers; Warrior Gunner, 8 Platoon, C Company, 3rd Battalion; 26 February 1991\nSee also\n* British honours system\nReferences\n*"
    }
  ]
}