{
  "content": [
    {
      "type": "text",
      "text": "# List of Seattle Kraken award winners\n\nThe Seattle Kraken are a professional ice hockey team based in Seattle. They are members of the Pacific Division of the National Hockey League (NHL).\nThe Seattle Kraken have not won any whole-team awards. Matty Beniers has won the only individual award of any Kraken in team history, the Calder Memorial Trophy, for being rookie of the year for the 2022–23 season.\nThe Kraken have four internal team awards—the Pete Muldoon Award, the 3 Stars of the Year Award, the Guyle Fielder Award, and the Fan Favorite Award.\nLeague awards\nTeam trophies\nThe Kraken have not won any of the team trophies the NHL awards annually—the Stanley Cup as winners of the Stanley Cup playoffs, the Clarence S. Campbell Bowl as winners of the Western Conference in the playoffs, or the Presidents' Trophy as the team with the most regular season standings points.\nIndividual awards\nFollowing the 2022–23 season, the Kraken's Matty Beniers was named the winner of the Calder Memorial Trophy for being the NHL rookie of the year. That season, Beniers had scored 24 goals and managed 57 points, both the most out of any rookie that season, through 80 games.\n{| class=\"wikitable\" width=\"75%\"\n|+Individual awards won by Seattle Kraken players and staff\n! scope=\"col\" |Award\n! scope=\"col\" class=\"unsortable\" |Description\n! scope=\"col\" |Winner\n! scope=\"col\" |Season\n! scope=\"col\" class=\"unsortable\" |Ref.\n|-\n! scope=\"row\" | Calder Memorial Trophy\n|Rookie of the year\n|\n|\n|\n|-\n|}\nAll-Stars\nNHL All-Rookie Team\nThe NHL All-Rookie Team consists of the top rookies at each position (three forwards, two defenseman, and one goaltender) as voted on by the Professional Hockey Writers' Association. Matty Beniers, following his Calder Memorial Trophy-winning 2022–23 season, was selected for that season's All-Rookie Team.\n{| class=\"wikitable\" width=\"75%\"\n|+ Seattle Kraken players selected to the NHL All-Rookie Team\n! scope=\"col\" |Player\n! scope=\"col\" |Position\n! scope=\"col\" |Season\n!Ref.\n|-\n! scope=\"row\" |\n|\n|\n|\n|}\nAll-Star Game selections\nThe NHL All-Star Game is a mid-season exhibition game held annually between many of the top players of each season, selected by both the NHL themselves and a fan vote. The All-Star game consists of a three-game tournament, with the winning faction receiving US$1 million. Three All-Star Games have been held since the Seattle Kraken entered the league in 2021.\n{| class=\"wikitable sortable\" width=\"75%\"\n|+Seattle Kraken players and coaches selected to the All-Star Game\n|-\n!scope=\"col\" | Game\n!scope=\"col\" | Year\n!scope=\"col\" | Name\n!scope=\"col\" | Position\n!scope=\"col\" class=\"unsortable\"|Ref.\n|-\n! scope=\"row\" | 66th\n|2022\n|\n|\n|\n|-\n! scope=\"row\" | 67th\n|2023\n| (did not play due to injury)\n|\n|\n|-\n! scope=\"row\" | 68th\n|2024\n|\n|\n|\n|}\nAll-Star Game replacement events\n{| class=\"wikitable sortable\" width=\"75%\"\n|+Seattle Kraken players and coaches selected to All-Star Game replacement events\n! scope=\"col\" |Event\n! scope=\"col\" |Year\n! scope=\"col\" |Name\n! scope=\"col\" |Position\n! scope=\"col\" class=\"unsortable\" |References\n|-\n!4 Nations Face-Off\n|2025\n|Kaapo Kakko (Finland)\n|Right wing\n|\n|}\nCareer achievements\nRetired numbers\nThe Seattle Kraken have retired one jersey number. The number 32 was retired by the team on October 23, 2021, in recognition of the team being the 32nd to join the NHL and in honor of the 32,000 fans who placed deposits for tickets on the first possible day. Also out of circulation is the number 99, which was retired league-wide for Wayne Gretzky on February 6, 2000.\nTeam awards\nThe Kraken have four team awards that they give out to members of their team at the end of each season. The Pete Muldoon Award is given to the team's most valuable player. The 3 Stars of the Year Award is an annual award which is given to the player who earned the most three stars of the game honors following each Kraken home game. The Guyle Fielder Award is an annual award which is given to the player \"who best exemplifies 'perseverance, hustle and dedication' associated with a Seattle hockey legend.\" The award's namesake played 15 professional seasons for the Seattle Totems of the Western Hockey League. The Fan Favorite Award is determined by a vote of the Kraken's fans.\n{| class=\"wikitable\"\n! scope=\"col\" style=\"width:6em\"|Season\n! scope=\"col\" style=\"width:12em\"|Pete Muldoon Award winner\n! scope=\"col\" style=\"width:12em\"|3 Stars of the Year Award winner\n! scope=\"col\" style=\"width:12em\"|Guyle Fielder Award winner\n! scope=\"col\" style=\"width:12em\"|Fan Favorite Award winner\n! scope=\"col\" style=\"width:2em\"|Ref.\n|-\n! scope=\"row\"| 2021–22\n| Jared McCann || Philipp Grubauer || Yanni Gourde || Yanni Gourde ||\n|-\n! scope=\"row\"| 2022–23\n| Vince Dunn || Jared McCann || Jaden Schwartz || Matty Beniers ||\n|-\n! scope=\"row\"| 2023–24\n| Jared McCann || Joey Daccord || Jaden Schwartz || Joey Daccord ||\n|-\n! scope=\"row\"| 2024–25\n| Joey Daccord || Joey Daccord || Jaden Schwartz || Brandon Montour||\n|}\nSee also\n*List of NHL awards\nReferences"
    }
  ]
}