{
  "content": [
    {
      "type": "text",
      "text": "# List of awards and nominations received by Kevin Smith\n\nThis is a list of awards and nominations received by American film director Kevin Smith.\nAwards\n* 1994 Sundance Film Festival. Co-winner of the Filmmakers Trophy for Clerks.\n* 1994 Cannes Film Festival. Won the Prix de la Jeunesse Award (\"Prize of the Youth\") for Clerks and won the Mercedes Benz-sponsored International Critics Week Prize.\n* 1994 Deauville Film Festival. Won the Audience Award for Clerks.\n* 1997 Independent Spirit Awards. Won Best Screenplay for Chasing Amy.\n* 1997 Humanitas Prize. Won (with Scott Mosier) for \"Good Will Hunting\" as executive producers.\n* 1999 Harvey Awards. Won Best New Talent for Daredevil/Bullseye: Target, Clerks: The Comic Book and the Jay & Silent Bob series.\n* 1999 People for the American Way’s Defender of Democracy Award.\n* 1999 Festival Internacional de Cine Cinema Jove. Lifetime Achievement Award.\n* 2000 Wizard Fan Awards. Won Best Writer.\n* 2005 Empire Awards. UK. Won the Independent Spirit Award.\n* 2006 Edinburgh International Film Festival. UK - Standard Life Audience Award chosen by audience votes from the Gala and British Gala sections of the Film Festival for Clerks II.\n* 2006 Hawaii International Film Festival. Maverick Award.\n* 2006 UCLA.  Jack Benny Award for Comedy.\n* 2007 MTV Movie Awards. Won 'The Orbit Dirtiest Mouth Moment' award along with Jason Mewes for their work for \"Clerks II.\"  They received the Golden Bucket of Popcorn award as well as a lifetime supply of Orbit (gum).\n* 2008 Woodstock Film Festival Maverick Award\n* 2008 Visionfest Vision Award\n* 2009 Vail Film Festival Renegade Award\n* 2010 Provincetown International Film Festival Filmmaker on the Edge Award\n* 2011 Sitges Film Festival Best Film for Red State\nHonorary degrees\n* 2000, Doctor of Humane Letters from Illinois Wesleyan University\n* 2004, Doctor of Humane Letters from Montclair State University\n* 2005, Honorary Degree from Vancouver Film School\n* 2007, Honorary Associate of Letter from Brookdale Community College (Lincroft, New Jersey)\nNominations\n* 1994 Sundance Film Festival. Nominated for the Grand Jury Prize for \"Clerks\".\n* 1994 Deauville Film Festival Nominated for the Critic's Award for \"Clerks\".\n* 1994 Cannes Film Festival Nominated for Camera d'Or for \"Clerks\".\n* 1995 Independent Spirit Awards. Nominated (with Scott Mosier) for Best First Feature and for Best First Screenplay for Clerks.\n* 1997 Independent Spirit Awards. Nominated for Best Film (with Scott Mosier) for Chasing Amy.\n* 1997 Butaca Awards. Nominated for Best Art House Film for Chasing Amy.\n* Nominated for the 1999 Comics Buyer's Guide Award for Favorite Writer\n* 2000 Las Vegas Film Critics Society Awards. Nominated for Best Screenplay, Original for Dogma.\n* 2000 Independent Spirit Awards. Nominated for Best Screenplay for Dogma.\n* Nominated for the 2000 Comics Buyer's Guide Award for Favorite Writer.\n* 2001 Science Fiction and Fantasy Writers of America Awards. Nominated for Best Script for Dogma.\nOther honors\n*A street was named after him in Paulsboro, New Jersey, where he filmed Jersey Girl, \"Kevin Smith Way\". The road leads to Paulsboro High School.\n*In 2019, Smith's film Clerks was selected by the Library of Congress for preservation in the National Film Registry for being \"culturally, historically, or aesthetically significant\".\nReferences"
    }
  ]
}