{
  "content": [
    {
      "type": "text",
      "text": "# List of pilots awarded an Aviator's Certificate by the Royal Aero Club in 1911\n\nThe Royal Aero Club issued Aviators Certificates from 1910. These were internationally recognised under the Fédération Aéronautique Internationale.\nList\n{|class=\"wikitable\"\n|-\n!colspan=5 | Aviator's Certificates awarded\n|-align=\"center\"\n|align=\"center\"|in 1910(1–38)\n|align=\"center\"|in 1911(39–168)\n|align=\"center\"|in 1912(169–382)\n|align=\"center\"|in 1913(383–719)\n|align=\"center\"|in 1914(720–1032)\n|}\nLegend\n{| class=\"wikitable\"\n|+ Royal Aero Club certificates awarded in 1911 (nos. 39–168)\n! width=\"5%\" |No. !! width=\"20%\" |Name !! width=\"16%\" |Date !! width=\"59%\" |Comment\n|-\n| align=\"center\" |39\n| Bethell Godefroy Bouwens\n| align=\"center\" | 7 January 1911\n| Author of several books on the subject of genealogy.\n|-\n| align=\"center\" |40\n| Lt. George Bayard Hynes RGA\n| align=\"center\" | 7 January 1911\n| Awarded the DSO during service with the Royal Flying Corps during the first world war, retired as a Royal Air Force Group Captain in 1931 and became the deputy director of aeronautical inspection in the Air Ministry.\n|-\n| align=\"center\" |41\n| style=\"background: #e3d9ff;\" | St. Croix Johnstone\n| align=\"center\" | 7 January 1911\n| Killed 16 August 1911 when his Moisant monoplane crashed into Lake Michigan while he was taking part in the 1911 Chicago International Aviation Meet.\n|-\n| align=\"center\" |42\n| Henry Cook\n| align=\"center\" | 7 January 1911\n| He was awarded Royal Aero Club Special Certificate No. 7 for carrying out a series flights and aerial manoeuvres which were of special merit in the early years of aviation.\n|-\n| align=\"center\" |43\n| Basil Herbert Barrington-Kennett\n| align=\"center\" | 7 January 1911\n| (1884–1915). A Lieutenant in the Grenadier Guards, he used a Bleriot Monoplane at Hendon. He \"was seconded to the Air Battalion of the Royal Engineers, the forerunner of the Royal Flying Corps, which came into being in April, 1912. He went to France with the R.F.C. in 1914, but in 1915 he returned to his regiment and was killed in action at Festubert\" (France) on 18 May 1915. He is buried at Le Touret Military Cemetery. Three of the four brothers were killed in the Great War (see entry: No. 190).\n|-\n| align=\"center\" |44\n| Paul Georges Leon Jezzi\n| align=\"center\" | 7 January 1911\n| Leo Jezzi was an aircraft designer; named on Eastchurch memorial to Pioneer Aviators. Built two aircraft of his own design at Eastchurch.\n|-\n| align=\"center\" |45\n| style=\"background: #e3d9ff;\" | Lt. Reginald Archibald Cammell, RE\n| align=\"center\" | 7 January 1911\n| He died 17 September 1911 when he crashed in an ASL Valkyrie which had been recently been given to the Army. He was one of only three officers in the Air Battalion, Royal Engineers who qualified in all forms of aircraft: balloons (Airship Certificate No. 1), man-lifting kites and aeroplanes.\n|-\n| align=\"center\" |46\n| Oscar Colin Morison\n| align=\"center\" | 17 January 1911\n| An engineer, he used a Bleriot Monoplane at Brooklands. Died in 1966.\n|-\n| align=\"center\" |47\n| James Valentine\n| align=\"center\" | 17 January 1911\n| Used a Macfie Biplane at Brooklands: Valentine died following an operation as a Lt.-Col. in the Royal Flying Corps on 7 August 1917 at Kieff in Russia (now Kyiv in Ukraine). One of only four airmen who completed the 1911 Circuit of Britain and the only British aviator to complete the whole course of the European circuit. For these achievements he was awarded the Silver Medal of the R.Ae.C. in 1912 Valentine was awarded the second R.Ae.C. Special certificate on 6 December 1911;\n|-\n| align=\"center\" |48\n| style=\"background: #e3d9ff;\" | Henry J. Delaval Astley\n| align=\"center\" | 24 January 1911\n| Died flying a Blériot in an exhibition Flight in Belfast on 21 September 1912.\n|-\n| align=\"center\" |49\n| Robert Francis Macfie\n| align=\"center\" | 24 January 1911\n| Aircraft designer and constructor (e.g. the Macfie Monoplane); sometimes credited with the invention of the 'tank' (i.e. the armoured vehicle with caterpillar tracks); he was a member of the British Landships Committee.\n|-\n| align=\"center\" |50\n| Cecil Howard Pixton\n| align=\"center\" | 24 January 1911\n| Winner of the 1914 Schneider Trophy in a Sopwith Tabloid floatplane; founder of the AVRO flying school at Brooklands.\n|-\n| align=\"center\" |51\n| Herbert John Thomas\n| align=\"center\" | 24 January 1911\n| Born 1892, at the time he was the youngest pilot to have been awarded the Aviator's Certificate. He was a founding member of the British and Colonial Aeroplane Company, formed 1910, and stayed with the company under its various names until his death following surgery in 1947, at which time he was assistant managing director of the Bristol Aeroplane Company. He had also served as chairman and council member of the Society of British Aerospace Companies.\n|-\n| align=\"center\" |52\n| Sir Ellis \"Victor\" Sassoon (announced under the name E.\"Smith\")\n| align=\"center\" | 24 January 1911\n| 3rd (and last) Baronet Sassoon.\n|-\n| align=\"center\" |53\n| Geoffrey de Havilland\n| align=\"center\" | 7 February 1911\n| Aviation pioneer, designer, founder of de Havilland Aircraft Company; he received the R.Ae.C. Special Certificate no. 4 on 9 Jan. 1912.\n|-\n| align=\"center\" |54\n| Captain Daniel Goodwin Conner RFC\n| align=\"center\" | 7 February 1911\n| Capt. Conner was a flight commander in No. 5 Squadron RFC and later, as temporary major, squadron commander. A photograph of Lt. Conner appeared in Flight Magazine's \"Aviation Pioneers\" series in its issue dated 4 March 1911.\n|-\n| align=\"center\" |55\n| James Vernon Martin\n| align=\"center\" | 7 February 1911\n| Martin was an American citizen and inventor, who took out many aeronautical patents, including an \"automatic stabilizer (1916) and retractable landing gear (1916)\".\n|-\n| align=\"center\" |56\n| Arthur Haynes Aitken\n| align=\"center\" | 14 February 1911\n| Flight Roll of Honour: Reported missing on 11 November 1918: Aitken, Sec. Lieut. A.H.\n|-\n| align=\"center\" |57\n| Charles L A Hubert\n| align=\"center\" | 14 February 1911\n| French aviator, born 16 March 1889; took part in the King George V Coronation (airmail) flights from Hendon, where he crashed his Farman III and broke both legs.\n|-\n| align=\"center\" |58\n| George Henry Challenger\n| align=\"center\" | 14 February 1911\n| Elected \"Associate Fellow of the Royal Aeronautical Society\" in 1913, chief designer and engineer in the aviation department of Vickers; formerly chief engineer at the British and Colonial Aeroplane Company, and previously employed as an engineer by the Bristol Tramways and Carriage Co. Challenger was the author and co-author of numerous patents, including those for a ring mounting and the Vickers-Challenger interrupter gear, both for machine-guns.\n|-\n| align=\"center\" |59\n| George Richard Sutton Darroch\n| align=\"center\" | 14 February 1911\n| Blériot school, Hendon. 22 Feb. 1880, d. 3 Dec. 1959; went to Eton College; was an apprentice at the London & North Western Railway (LNWR) in Crewe; fought in World War I, being awarded the Croix de Guerre; returned to work in Crewe, eventually becoming Assistant Works Manager with the LNWR and its successor, the London, Midland and Scottish Railway; retired in 1941. During his first employment in Crewe he designed and supervised the construction of the \"Orion\", a one-sixth scale model Webb Compound locomotive now maintained and operated by the Stephenson Locomotive Society.\n|-\n| align=\"center\" |60\n| Archibald Knight\n| align=\"center\" | 14 February 1911\n| at Bristol Flying School, Brooklands; instructor at the Vickers Flying School; joined the RFC in 1914; recalled to join Maxwell Muller in managing the Vickers works at Weybridge as works manager until his retirement 1936; returned in 1939 to manage Wellington and Warwick repair.\n|-\n| align=\"center\" |61\n| Collyns Price Pizey\n| align=\"center\" | 14 February 1911\n| Used a Bristol Biplane at Salisbury Plain. Later chief instructor at Bristol's Brooklands school. Died of dysentery in Greece 11 June 1915. He was a Flt. Lt. in the Royal Naval Air Service working for the British Naval Mission to Greece.\n|-\n| align=\"center\" |62\n| Louis Maron\n| align=\"center\" | 14 February 1911\n| A French aviator who used a Bristol Biplane at Salisbury Plain.\n|-\n| align=\"center\" |63\n| William Hugh Ewen\n| align=\"center\" | 14 February 1911\n| Scottish aviator who used a Bleriot Monoplane at Hendon. Performed the first flight across the Firth of Forth in 1911. At the end of 1911, he contacted the Caudron Brothers at Rue and his company, W.H. Ewen Aviation Co Ltd, Hendon, became the registered agent for the construction and sale of Caudron aeroplanes in the British Empire. Founded the Ewen Flying School at Hendon in 1912. Served in the Royal Flying Corps and Royal Air Force, reaching the rank of Major, resigning his commission due to ill health in 1918. He died in 1947. Ewen was also an organist and conductor (he composed the \"Zephyr Waltz\"), and appeared in the 1913 aviation film Through the Clouds.\n|-\n| align=\"center\" |64\n|style=\"background: #e3d9ff;\" | Gustav Hamel\n| align=\"center\" | 14 February 1911\n| Holder of the French aviator's certificate no. 358; he disappeared over the English Channel on 23 May 1914 while returning from Paris in a new 80&nbsp;hp Morane-Saulnier monoplane he had just collected. At this time of high international tension, there was speculation that he might have been the victim of sabotage, but no trace was ever found.\n|-\n| align=\"center\" |65\n| Quinto Poggioli\n| align=\"center\" | 28 February 1911\n| Italian aviator used a Bleriot Monoplane at the New Forest Aviation School, Beaulieu.\n|-\n| align=\"center\" |66\n| Lewis William Francis Turner\n| align=\"center\" | 4 April 1911\n| Used a Farman Biplane at Hendon. Served with the Royal Flying Corps during the First World War.\n|-\n| align=\"center\" |67\n| Waldo Ridley Prentice\n| align=\"center\" | 25 April 1911\n| 14 August 1883-18 January 1952Used a Farman Biplane at Hendon to gain his certificate. Flew for Aeronautical Syndicate Limited until it closed in 1912 and became involved with British Anzani. Due to heart problems he didn't fly much and spent over thirty years in the diplomatic service.\n|-\n| align=\"center\" |68\n| Eric C. Gordon England\n| align=\"center\" | 25 April 1911\n| One of the early pioneers of gliding.\n|-\n| align=\"center\" |69\n| Henry R. Fleming\n| align=\"center\" | 25 April 1911\n| –\n|-\n| align=\"center\" |70\n| Charles Cyril Turner\n| align=\"center\" | 25 April 1911\n| Author of [https://books.google.com/books?id=VAn3ySgxNXkC&pg=PA197 \"The Old Flying Days\"].\n|-\n| align=\"center\" |71\n| Lt. Charles Rumney Samson RN\n| align=\"center\" | 25 April 1911\n| Samson was the first pilot to take off from a moving ship, and was instrumental in the development of aerial wireless communications, bomb- and torpedo-dropping, navigational techniques and night flying.\n|-\n| align=\"center\" |72\n| Lt. Arthur M. Longmore RN\n| align=\"center\" | 25 April 1911\n| Later Air Chief Marshal Sir Arthur Longmore RAF; named on Eastchurch memorial to Pioneer Aviators.\n|-\n| align=\"center\" |73\n| style=\"background: #e3d9ff;\" | Lt. Wilfred Parke RN\n| align=\"center\" | 25 April 1911\n| Gained his certificate at Brooklands in a Bristol Boxkite on his fourth flight. Known for the 'Parke Dive' spin-recovery on 25 August 1912; crashed and died near Wembley 15 December 1912 with Mr Arkell Hardwick of Handley Page.\n|-\n| align=\"center\" |74\n| Francis Conway Jenkins CBE\n| align=\"center\" | 2 May 1911\n| b. 1888, d. 1933; raced cars at Brooklands; took part in the Circuit of Britain Air Race; rose from 2nd. Lt. to Brigadier-General (RAF), Director of Parks and Depots, Air Ministry; he resigned his commission and became a director of The British Motor Trading Corporation (founded 1919).\n|-\n| align=\"center\" |75\n| Lt. Reginald Gregory RN\n| align=\"center\" | 2 May 1911\n| Named on Eastchurch memorial to Pioneer Aviators.\n|-\n| align=\"center\" |76\n| Lt. Eugene Louis Gerrard RMLI\n| align=\"center\" | 2 May 1911\n| Named on Eastchurch memorial to Pioneer Aviators.\n|-\n| align=\"center\" |77\n| style=\"background: #e3d9ff;\" | Edward Victor Beauchamp Fisher\n| align=\"center\" | 2 May 1911\n| On 13 May 1912 Fisher was piloting a Green powered Flanders monoplane with an American passenger Mr. Mason when it crashed at Brooklands killing them both.\n|-\n| align=\"center\" |78\n| style=\"background: #e3d9ff;\" | Hubert Oxley\n| align=\"center\" | 9 May 1911\n| Chief Flying Instructor at Filey, Yorkshire; died 6 December 1911, together with his passenger, Mr. Weiss: during a steep dive in a Blackburn Mercury, fabric tore off the wings and the plane crashed, killing both Oxley and Weiss.\n|-\n| align=\"center\" |79\n| Harold Blackburn\n| align=\"center\" | 9 May 1911\n| Demonstration pilot for Robert Blackburn. Won the Wars of the Roses air race on 2 October 1913 and piloted the first scheduled airline flights in Great Britain on 22 July 1914. Served with the RFC in France and Palestine. Retired from the RAF in 1929.\n|-\n| align=\"center\" |80\n| Ronald C. Kemp\n| align=\"center\" | 9 May 1911\n| Test pilot for Short Brothers; was injured (and his passenger Ewart Temple Haynes killed) in a crash at Brooklands on 23 February 1914.\n|-\n| align=\"center\" |81\n| R. W. Philpott\n| align=\"center\" | 9 May 1911\n| –\n|-\n| align=\"center\" |82\n| Wilfred Herbert Dolphin\n| align=\"center\" | 9 May 1911\n| Used a Hanriot Monoplane at Brooklands, an Automobile Engineer born in Birmingham on 8 May 1882, later served with the Royal Flying Corps.\n|-\n| align=\"center\" |83\n| C. H. Marks\n| align=\"center\" | 9 May 1911\n| –\n|-\n| align=\"center\" |84\n| Capt. Seaton Dunham Massy\n| align=\"center\" | 9 May 1911\n|Flew with the Air Battalion during 1911, and was commandant of the Indian Central Flying School at Sitapur.\n| –\n|-\n| align=\"center\" |85\n| F. P. Raynham\n| align=\"center\" | 9 May 1911\n| 1893–1954\n|-\n| align=\"center\" |86\n| James L. Travers, Jr.\n| align=\"center\" | 16 May 1911\n| Named on Eastchurch memorial to Pioneer Aviators; named on Eastchurch memorial to Pioneer Aviators. 'Jack' Travers was a draughtsman at Short Brothers and later also a flying instructor at Eastchurch.\n|-\n| align=\"center\" |87\n| style=\"background: #e3d9ff;\" | Edward Hotchkiss\n| align=\"center\" | 16 May 1911\n| Killed on 10 September 1912, together with his passenger, Lt. C. A. Bettington (granted his Aviator's certificate, No. 256, on 24 July 1912) when his Bristol Monoplane crashed due to the failure of a quick-release cable fitment, which caused the fabric of the starboard wing to fail.\n|-\n| align=\"center\" |88\n| T. C. R. Higgins\n| align=\"center\" | 16 May 1911\n| Commanded the RFC's Home Defence Brigade during World War I, retired as an air commodore in 1929.\n|-\n| align=\"center\" |89\n| Lt. W. D. Beatty RE\n| align=\"center\" | 30 May 1911\n| –\n|-\n| align=\"center\" |90\n| Lt. R. B. Davies RN\n| align=\"center\" | 30 May 1911\n| Awarded Victoria Cross for actions during Dardanelles Campaign. Retired as Vice-admiral in 1941\n|-\n| align=\"center\" |91\n| Bentfield Charles Hucks\n| align=\"center\" | 30 May 1911\n| Test flights at Filey, Yorkshire using a Blackburn monoplane. Died from pneumonia 6 November 1918. Was a captain in the Royal Air Force when he died, the first Englishman to loop and fly upside down. The Hucks starter, an essential vehicle on Great War aerodromes, was named after him.\n|-\n| align=\"center\" |92\n| Captain Herbert Ramsay Playford Reynolds RE\n| align=\"center\" | 6 June 1911\n| Royal Flying Corps, test flights at Salisbury Plain using a Bristol Biplane.\n|-\n| align=\"center\" |93\n| Thomas Henry Sebag-Montefiore\n| align=\"center\" | 13 June 1911\n| –\n|-\n| align=\"center\" |94\n| H. R. Busteed\n| align=\"center\" | 13 June 1911\n| The first Australian to hold a pilot's licence. Later an RAF air commodore.\n|-\n| align=\"center\" |95\n| Frederick Sykes\n| align=\"center\" | 20 June 1911\n| Senior RFC commander and second Chief of the Air Staff.\n|-\n| align=\"center\" |96\n| G. Higginbotham\n| align=\"center\" | 27 June 1911\n| –\n|-\n| align=\"center\" |97\n| Herbert Stanley-Adams\n| align=\"center\" | 27 June 1911\n| –\n|-\n| align=\"center\" |98\n| Lt. J. W. Pepper RA\n| align=\"center\" | 27 June 1911\n| –\n|-\n| align=\"center\" |99\n| Henry Salmet\n| align=\"center\" | 27 June 1911\n| –\n|-\n| align=\"center\" |100\n| style=\"background: #e3d9ff;\" | Charles Gordon Bell\n| align=\"center\" | 4 July 1911\n| First professional test pilot (at Short Brothers); having been invalided out of military service in World War I, Bell died Monday, 29 July 1918, test flying for Vickers Ltd.\n|-\n| align=\"center\" |101\n| Charles Reginald Abbott\n| align=\"center\" | 4 July 1911\n| –\n|-\n| align=\"center\" |102\n| William Miller Hilliard\n| align=\"center\" | 4 July 1911\n| –\n|-\n| align=\"center\" |103\n| William Darnley Johnstone\n| align=\"center\" | 4 July 1911\n| 1889–1912 Died at the Minster Infirmary, Sheppey, aged 23 on 15 June 1912 following a motor-cycle accident.\n|-\n| align=\"center\" |104\n| style=\"background: #e3d9ff;\" | Gerald Francis Napier\n| align=\"center\" | 18 July 1911\n| Awarded after a flight at Brooklands in a Bristol Biplane. On 1 August 1911, aged 19, he lost control during a flight at Brooklands and was killed; his passenger was thrown clear and survived.\n|-\n| align=\"center\" |105\n| Lt. Thomas Gerard Hetherington\n| align=\"center\" | 18 July 1911\n| 1886–1951, became one of the first members of the Royal Flying Corps in 1912 and retired in 1935 as a Group Captain.\n|-\n| align=\"center\" |106\n| Cecil Lawrence Pashley\n| align=\"center\" | 18 July 1911\n| –\n|-\n| align=\"center\" |107\n| Henry De Grey Warter\n| align=\"center\" | 18 July 1911\n| Born 20 July 1885 at Kirkee, Bombay, India; Lieutenant, later Captain, 4th Dragoon Guards; served with his cavalry regiment in First World War and killed in action at Battle of Cambrai (1917).\n|-\n| align=\"center\" |108\n| Capt. C. Robert Brooke-Popham\n| align=\"center\" | 18 July 1911\n| –\n|-\n| align=\"center\" |109\n| Harry Bingham Brown\n| align=\"center\" | 1 August 1911\n| –\n|-\n| align=\"center\" |110\n| Evelyn Frederick Driver\n| align=\"center\" | 1 August 1911\n| South African born aviator used a Farman Biplane at Hendon for certificate flights.\n|-\n| align=\"center\" |111\n| Norman Scott Percival\n| align=\"center\" | 1 August 1911\n| –\n|-\n| align=\"center\" |112\n| Walter Oswald Watt\n| align=\"center\" | 1 August 1911\n| –\n|-\n| align=\"center\" |113\n| Walter Lawrence\n| align=\"center\" | 1 August 1911\n| –\n|-\n| align=\"center\" |114\n| George Miller Dyott\n| align=\"center\" | 17 August 1911\n| –\n|-\n| align=\"center\" |115\n| Lt. Col. Charles Oswald Smeaton\n| align=\"center\" | 17 August 1911\n| -\n|-\n| align=\"center\" |116\n| Louis Noel\n| align=\"center\" | 17 August 1911\n| –\n|-\n| align=\"center\" |117\n| Lt. Spenser Douglas Adair Grey RN\n| align=\"center\" | 17 August 1911\n| Used a Farman biplane at Brooklands. Served with the Royal Naval Air Service during the first world war being awarded the Distinguished Service Order and the American Navy Distinguished Service Medal. Left with the rank of Lt Col. He died in 1937 when he fell off the roof of his flat in London.\n|-\n| align=\"center\" |118\n| Brig. Gen. Colonel D Henderson CB, DSO\n| align=\"center\" | 17 August 1911\n| Gained his certificate at Brooklands in Bristol Boxkite after less tham a weeks instruction.\n|-\n| align=\"center\" |119\n| style=\"background: #e3d9ff;\" | Theodore John Ridge\n| align=\"center\" | 17 August 1911\n| Assistant Superintendent of the Royal Aircraft Factory – killed 18 August 1911 in crash of Royal Aircraft Factory S.E.1.\n|-\n| align=\"center\" |120\n| Carl Olaf Dahlbeck\n| align=\"center\" | 29 August 1911\n| Swedish aviator, used a Farman Biplane at Hendon.\n|-\n| align=\"center\" |121\n| Lt. L.V. Stewart Blacker\n| align=\"center\" | 29 August 1911\n| Joint organizer and chief observer on first flight over Mount Everest in 1933.\n|-\n| align=\"center\" |122\n| Mrs. Hilda Beatrice Hewlett\n| align=\"center\" | 29 August 1911\n| The first British woman to receive a pilot's certificate, gained flying her Farman biplane. Opened a flying school at Brooklands with Gustav Blondeau and an aircraft company with him. She taught her son, Francis Hewlett (certificate 156), to fly.\n|-\n| align=\"center\" |123\n| Walter C. England\n| align=\"center\" | 29 August 1911\n| –\n|-\n| align=\"center\" |124\n| Herbert Spencer\n| align=\"center\" | 29 August 1911\n| Described as an Aviator/Aero Engineer he obtained licence on a biplane he had built himself.\n|-\n| align=\"center\" |125\n| Capt. Captain D. Le Geyt Pitcher\n| align=\"center\" | 29 August 1911\n| –\n|-\n| align=\"center\" |126\n| Capt. C. G. Hoare\n| align=\"center\" | 29 August 1911\n| –\n|-\n| align=\"center\" |127\n| Lt. Robert Hamilton Clark-Hall RN\n| align=\"center\" | 29 August 1911\n| Later Air Marshal Sir Robert Clark-Hall RAF (and Air Commodore RNZAF 1943–45).\n|-\n| align=\"center\" |128\n| Henry Aloysius Petre\n| align=\"center\" | 12 September 1911\n| Henry Aloysius Petre DSO, MC, was an English solicitor who became Australia's first military aviator, and a founding member of the Australian Flying Corps, predecessor of the Royal Australian Air Force.\n|-\n| align=\"center\" |129\n| William E. Gibson\n| align=\"center\" | 12 September 1911\n| –\n|-\n| align=\"center\" |130\n| E. W. Copland Perry\n| align=\"center\" | 12 September 1911\n| –\n|-\n| align=\"center\" |131\n| Eric Harrison\n| align=\"center\" | 12 September 1911\n| –\n|-\n| align=\"center\" |132\n| style=\"background:#999999;\" | Samuel Pepys Cockerell\n| align=\"center\" | 12 September 1911\n|  Part of the Cambridge University crew for the 1900 Boat Race. Died in service with the Royal Flying Corps in Egypt in 1915.\n|-\n| align=\"center\" |133\n| R. O. Crawshay\n| align=\"center\" | 12 September 1911\n| –\n|-\n| align=\"center\" |134\n| R. O. Abercromby\n| align=\"center\" | 12 September 1911\n| –\n|-\n| align=\"center\" |135\n| Lt. G. J. E. Manisty\n| align=\"center\" | 12 September 1911\n| –\n|-\n| align=\"center\" |136\n| John Brereton\n| align=\"center\" | 19 September 1911\n| –\n|-\n| align=\"center\" |137\n| Albert Hunter\n| align=\"center\" | 19 September 1911\n| –\n|-\n| align=\"center\" |138\n| Alfred Dunkinfield Jones\n| align=\"center\" | 19 September 1911\n| –\n|-\n| align=\"center\" |139\n| Eric Clowes Pashley\n| align=\"center\" | 26 September 1911\n| –\n|-\n| align=\"center\" |140\n| style=\"background: #e3d9ff;\" | John Lewis Longstaffe\n| align=\"center\" | 26 September 1911\n| (see Flight 29 March 1912, see also The Daily Journal and Tribune, Knoxville, Tennessee: 29 September 1912)\n|-\n| align=\"center\" |141\n| style=\"background: #e3d9ff;\" | Lt. A. Wyness Stuart RA\n| align=\"center\" | 26 September 1911\n| Died in a crash in Deperdussin Monoplane 100 Gnome No. 258, piloted by Capt. P. Hamilton, at Graveley, near Stevenage, on 6 September 1912. The accident was considered to have been caused by \"a part of the engine coming off and hitting the bonnet over the engine, smashing one of the wing wires, and thus loosening the wings\".\n|-\n| align=\"center\" |142\n| Capt. Frederick William Richey\n| align=\"center\" | 3 October 1911\n|1875–1934 Royal Artillery officer who became an instructor at the Central Flying School and served with the Royal Flying Corps until January 1917 when he returned to his regiment. In 1915–16 he was commanding officer of 21 Squadron.\n|-\n| align=\"center\" |143\n| Capt. Steele Hutcheson\n| align=\"center\" | 3 October 1911\n|  Indian Army seconded to the Royal Flying Corps during the First World War.\n|-\n| align=\"center\" |144\n| Capt. Cyril L. N. Newall\n| align=\"center\" | 3 October 1911\n| –\n|-\n| align=\"center\" |145\n| Lt. E. J. Strover\n| align=\"center\" | 10 October 1911\n| An officer in the Burma Rifles served with the Royal Flying Corps during the First World War.\n|-\n| align=\"center\" |146\n| Lionel Seymour Metford\n| align=\"center\" | 17 October 1911\n| 1888–1950 Served with the Royal Flying Corps/Royal Air Force, died in Canada.\n|-\n| align=\"center\" |147\n| style=\"background:#999999;\" | William Barnard Rhodes-Moorhouse\n| align=\"center\" | 17 October 1911\n| Rhodes-Moorhouse was the first airman to be awarded the VC. He died from injuries sustained from small-arms fire during an aerial attack on a railway junction at Kortrijk, Belgium on 26 April 1915.\n|-\n| align=\"center\" |148\n| Zee Yee Lee\n| align=\"center\" | 17 October 1911\n| Chinese aviator who used a Bristol Biplane at Salisbury Plain.\n|-\n| align=\"center\" |149\n| Lt. Alexander Francis Anderson Hooper\n| align=\"center\" | 24 October 1911\n| Used a Bristol biplane at Salisbury Plain. Born at Starcross in Devon on 5 June 1885. He was a lieutenant in the Prince of Wales's (North Staffordshire Regiment), a Squadron Leader in the Royal Air Force in 1920, and a Wing Commander in 1928. Died in 1977 in Devon.\n|-\n| align=\"center\" |150\n| Lt. Edward Guy Kynaston Cross\n| align=\"center\" | 24 October 1911\n| Used a Bristol biplane at the Bristol School, Salisbury Plain. Born in Bolton 23 November 1884. He was a lieutenant in the 7th Hussars in 1911, later a lieutenant-colonel. Died 15 November 1969.\n|-\n| align=\"center\" |151\n| Frank Martin Ballard\n| align=\"center\" | 31 October 1911\n|  Served with the Royal Flying Corps and Royal Air Force during the first world war.\n|-\n| align=\"center\" |152\n| Lt. Henry Harold Harford\n| align=\"center\" | 7 November 1911\n| Used a Bristol biplane at Brooklands, a lieutenant in the Royal Field Artillery in 1911. He was born in Lahore, India on 1 January 1887.\n|-\n| align=\"center\" |153\n| Mrs. Cheridah de Beauvoir Stocks\n| align=\"center\" | 7 November 1911\n| Licence test flights at Hendon using a Farman biplane, the second British woman to hold a licence. Gave up flying following a serious flying accident at Hendon in 1913.\n|-\n| align=\"center\" |154\n| style=\"background: #e3d9ff;\" | Eustace B. Loraine\n| align=\"center\" | 7 November 1911\n| Died in a crash in a Nieuport 70 Gnome Monoplane on Salisbury Plain 5 July 1912, the first R.F.C. officer to die in this way; Staff-Sergeant R.&nbsp;H.&nbsp;V. Wilson, his passenger, also died in the crash.\n|-\n| align=\"center\" |155\n| Oswald Lawrence Mellersh\n| align=\"center\" | 14 November 1911\n|1892–1974 Moved to Canada in 1925\n|-\n| align=\"center\" |156\n| Sub.-Lt. Francis Esmé Theodore Hewlett RN\n| align=\"center\" | 14 November 1911\n| Used a Farman Biplane at Brooklands. Son of the first woman to hold a licence, Hilda Hewlett. Took part in the Cuxhaven Raid in 1914. Transferred to the Royal Air Force and then Royal New Zealand Air Force.\n|-\n| align=\"center\" |157\n| Robert Bertram Slack\n| align=\"center\" | 14 November 1911\n| A former chauffeur from Nottingham before becoming an aviator, he died in a motoring accident on 21 December 1913, aged 28.\n|-\n| align=\"center\" |158\n| Captain Richard Scorer Molyneux Harrison\n| align=\"center\" | 14 November 1911\n| A Captain with the 51st Sikhs (Frontier Force), used a Bristol Biplane at Brooklands. Killed in action 16 August 1915 during the Gallipoli campaign.\n|-\n| align=\"center\" |159\n| style=\"background: #e3d9ff;\" | Captain Clement Robert Wedgwood Allen, Welch Regiment\n| align=\"center\" | 14 November 1911\n| Used a Bristol Biplane at Brooklands for certificate. Died in an aircraft accident 11 March 1914.\n|-\n| align=\"center\" |160\n| H. A. Williamson\n| align=\"center\" | 28 November 1911\n| –\n|-\n| align=\"center\" |161\n| Robert Smith-Barry\n| align=\"center\" | 28 November 1911\n| –\n|-\n| align=\"center\" |162\n| George Bentley Dacre\n| align=\"center\" | 28 November 1911\n| RNAS pilot and prisoner of war during World War I, senior RAF commander during World War II.\n|-\n| align=\"center\" |163\n| Lt. John Graham Bower RN\n| align=\"center\" | 28 November 1911\n|  Awarded the Distinguished Service Order in 1918 for service in submarines.\n|-\n| align=\"center\" |164\n| James Arthur Anderson\n| align=\"center\" | 28 November 1911\n| Served in the Royal Naval Air Service and Royal Air Force during the First World War.\n|-\n| align=\"center\" |165\n| Maj. Reginald Limond Benwell\n| align=\"center\" | 6 December 1911\n|  Indian Army, later a Lieutenant-Colonel, imported the first aircraft into India.\n|-\n| align=\"center\" |166\n| Capt. Robert Gordon\n| align=\"center\" | 6 December 1911\n| –\n|-\n| align=\"center\" |167\n| James Denys Perceval Chataway\n| align=\"center\" | 12 December 1911\n|  Used a Deperdussin Monoplane at the Deperdussin School, Brooklands. He was appointed an OBE in 1948 when he was a Principal in the Board of Trade.\n|-\n| align=\"center\" |168\n| Charles Ferris Montagu Chambers\n| align=\"center\" | 12 December 1911\n|  Born in South Africa. Used a Valkyrie Monoplane at Hendon. Served in the Royal Flying Corps and Royal Naval Air Service during the First World War. Awarded the Distinguished Service Cross in 1917. He committed suicide in Brighton in 1947.\n|-\n|}\nSee also\nLists for other years:\n*1910\n*1911\n*1912\n*1913\n*1914\n*List of pilots with foreign Aviator's Certificates accredited by the Royal Aero Club 1910-1914\nReferences\n}}\nBibliography\n*\n*\n*"
    }
  ]
}