{
  "content": [
    {
      "type": "text",
      "text": "# List of international presidential trips made by Joachim Gauck\n\nThis is a list of presidential visits to foreign countries made by Joachim Gauck, the former President of Germany. Gauck was elected and assumed the office for a five-year term on 18 March 2012, following the resignation of Christian Wulff and served until 18 March 2017.\n2012\n{| class=\"wikitable\" border=\"1\"\n!       Date\n!       Countries\n!       Places visited\n!       Narrative\n|-\n|nowrap|26–27 March\n|\n|Warsaw\n|Inaugural visit to President Bronisław Komorowski; Gauck also met with Prime Minister Donald Tusk.\n|-\n| rowspan=\"2\" |16–17 April\n|\n|Brussels\n|Inaugural visit to the institutions of European Union and NATO: Gauck met with Secretary General of NATO Anders Fogh Rasmussen, Prime Minister of Belgium Elio Di Rupo\n|-\n|\n|Strasbourg\n|Met the President of the European Council Herman Van Rompuy, President of the European Commission José Manuel Barroso and President of the European Parliament Martin Schulz.\n|-\n|4 May\n|\n|Stockholm\n|Gauck was received by King Carl XVI Gustaf of Sweden at Stockholm Palace and attended the 400th anniversary celebrations of the [http://www.tyskaskolan.se/ Tyska Skolan] (German School) in Gamla stan.\n|-\n|5–6 May\n|\n|BredaAmsterdam\n|Gauck became the first foreign head of state to participate in the Liberation Day celebrations, in the course of which he delivered a speech. He met with Queen Beatrix and Crown Prince Willem-Alexander; together, they took a boat trip on Amstel river.\n|-\n| rowspan=\"2\" |28–31 May\n|\n|Tel AvivJerusalemRehovot\n|In Tel Aviv, Gauck was received by President of Israel Shimon Peres and met with further politicians including Prime Minister Benjamin Netanyahu, Foreign Minister Avigdor Liberman and leader of the opposition Shelly Yachimovich. During his stay, the German President visited the grave of Ignaz Bubis (the former President of the Central Council of Jews in Germany), the Yad Vashem memorial, and the Weizmann Institute of Science and came together with survivors of The Holocaust and the Israeli delegation of the 1972 Summer Olympics.\n|-\n|\n|Ramallah\n|Opened a German-funded girls school and met with Palestinian leaders Mahmoud Abbas and Salam Fayyad.\n|-\n|11 June\n|\n|Chur\n|Gauck attended the annual informal meeting of the German speaking heads of state with President of Austria Heinz Fischer, Crown Prince Alois of Liechtenstein and President of the Swiss Confederation Eveline Widmer-Schlumpf.\n|-\n|15 June\n|\n|Rome\n|Inaugural visit to President Giorgio Napolitano; Gauck also met with Prime Minister Mario Monti.\n|-\n|2 July\n|\n|Paris\n|Inaugural visit to President François Hollande.\n|-\n|27–28 July\n|}}\n|London\n|Gauck attended a reception at Buckingham Palace for foreign heads of state hosted by Queen Elizabeth II due to the beginning of the 2012 Summer Olympics, as well as the opening ceremony later that evening. On the next day, he met with German athletes at the Olympic Village and watched a gymnastics competition at the North Greenwich Arena.\n|-\n|2 August\n|\n|\n|Together with President of Poland Bronisław Komorowski, Gauck opened the Przystanek Woodstock rock music festival.\n|-\n|16 August\n|\n|Vienna\n|Inaugural visit to President Heinz Fischer; Gauck also met with Chancellor Werner Faymann and visited the Austrian National Library.\n|-\n|29–30 August\n|\n|London\n|Gauck attended the opening ceremony of the 2012 Summer Paralympics. On the next day, he came together with athletes at the Paralympic Village and presented the medals to the winners of the Men's time trial cycling event.\n|-\n|11 September\n|\n|Copenhagen\n|Inaugural visit to Queen Margrethe II; Gauck also met with members of the Danish government and parliament.\n|-\n|10 October\n|\n|PragueLidice\n|Gauck met with President Václav Klaus and Prime Minister Petr Nečas as well as activists of the Velvet Revolution. In order to mark the 70th anniversary of the nazi massacres in retaliation of Operation Anthropoid, he visited the Lidice Memorial.\n|-\n|13 November\n|\n|London\n|Completing a series of inaugural visits to European neighboring and close partner states, Gauck was received by Queen Elizabeth II at Buckingham Palace and attended a discussion about the different views on the future of Europe with British politicians and society members at the residence of the German ambassador.\n|-\n|19–20 November\n|\n|Naples\n|Trilateral meeting with Presidents Giorgio Napolitano and Bronisław Komorowski of Italy and Poland: This included the signing of the Naples Appeal calling for the overcoming of the economical and financial crisis, and a memorial ceremony honoring Polish freedom fighter Gustaw Herling-Grudziński.\n|-\n|5–6 December\n|\n|Vatican City\n|Gauck was received by Pope Benedict XVI for a private audience and met with Cardinal Secretary of State Tarcisio Bertone. He also paid a visit to the Collegio Teutonico.\n|-\n|6–7 December\n|\n|Zagreb\n|Gauck was received by President Ivo Josipović and had a talk with Prime Minister Zoran Milanović concerning the Accession of Croatia to the European Union.\n|-\n|\n|\n|Mazar-i-SharifKabul\n|Gauck met with Bundeswehr soldiers at Camp Marmal as well as German humanitarian workers. In Kabul, he was received by President Hamid Karzai and honored with the Order of the Sun.\n|-\n|}\n2013\n{| class=\"wikitable\" border=\"1\"\n!       Date\n!       Countries\n!       Places visited\n!       Narrative\n|-\n|\n|\n|Geneva\n|First in a series of journeys to institutions concerned with the protection of the human rights (because Germany had been elected a member of the United Nations Human Rights Council (UNHRC) for a three-year term beginning 1 January 2013): Gauck gave a speech at the UNHRC, met with the High Commissioner for Human Rights and the President of the International Committee of the Red Cross, and visited the grave of Nobel Peace Laureate Ludwig Quidde.\n|-\n|17–20 March\n|\n|Addis AbabaLalibela\n|During his first journey to Africa, Gauck met with President Girma Wolde-Giorgis and Prime Minister Hailemariam Desalegn, as well as Nkosazana Dlamini-Zuma (the chairperson of the African Union Commission). He gave a speech addressing the Permanent Representatives' Committee of the African Union on occasion of the 50th anniversary of the union and visited the grave of Gudina Tumsa. In Lalibela, he visited the Church of Saint George and had talks with representatives of the different religions in Ethiopia.\n|-\n|24 March\n|\n|\n|On the invitation of President of Italy Giorgio Napolitano, Gauck attended the memorial ceremony of a World War II massacre.\n|-\n|22 April\n|\n|Strasbourg\n|Second in a series of journeys to institutions concerned with the protection of the human rights: Gauck visited the European Court of Human Rights and the Council of Europe, where he delivered a speech.\n|-\n| rowspan=\"2\" |8–16 May\n|\n|BogotáMedellín\n|Gauck was received by President Juan Manuel Santos and gave a speech about Vergangenheitsbewältigung and reconciliation at the University of the Andes on the occasion of recent peace talks between the Colombian government and the FARC rebels. Also, he met with members of human rights organizations at Biblioteca España in Medellín.\n|-\n|\n|São PauloRio de Janeiro\n|Was received by President Dilma Rousseff. Among other appointments, Gauck visited the Volkswagen factory near São Paulo, met with Governor of Rio de Janeiro Sérgio Cabral Filho as well as members of the National Truth Commission, and visited the \"model favela\" of Santa Marta.\n|-\n|30 May\n|\n|The Hague\n|Third in a series of journeys to institutions concerned with the protection of the human rights: Gauck visited the International Criminal Court, the International Criminal Tribunal for the former Yugoslavia and the International Court of Justice.\n|-\n| rowspan=\"4\" |5–13 July\n|\n|SavonlinnaTurku\n|Following him attending the opening performance of the annual Savonlinna Opera Festival together with President of Finland Sauli Niinistö and being formally received at the President's summer residence near Turku on the next day, Gauck paid State visits to the Baltic states.\n|-\n|\n|Riga\n|Was received by President of Latvia Andris Bērziņš at the House of the Blackheads on 7 July, which was followed by a visit of the Museum of the Occupation of Latvia. Also, Gauck had talks with Prime Minister Valdis Dombrovskis and Solvita Āboltiņa, the Speaker of the Saeima.\n|-\n|\n|Tallinn\n|Met with President Toomas Hendrik Ilves at his summer residence and was formally received at Kadriorg Palace in Tallinn on the following day (9 July), which was followed by a memorial ceremony at the War of Independence Victory Column and a visit of the Museum of Occupations. The day concluded with a state dinner at the Estonian Maritime Museum. The next day, Gauck met with Prime Minister Andrus Ansip and visited St Mary's Cathedral.\n|-\n|\n|VilniusKlaipėdaNida\n|On 11 July, he was received by head of state Dalia Grybauskaitė at the Presidential Palace and met members of the Lithuanian parliament; also, Gauck attended a ceremony at the Independence Memorial. The next day, he had a talk with Prime Minister Algirdas Butkevičius and attended discussions on the future development of Europe and the Soviet/German Occupations of Lithuania. Gauck's journey concluded with visits to the site of the planned reconstruction of St. John's Church in Klaipėda and the Thomas Mann Cultural Centre in Nida.\n|-\n|19 July\n|\n|Salzburg\n|Gauck met with President Heinz Fischer and delivered the opening speech at the annual Salzburg Festival.\n|-\n|3–5 September\n|\n|ParisOradour-sur-GlaneMarseille\n|First state visit of a German President to France in 16 years on occasion of the 50th anniversary of the Élysée Treaty: Gauck was received by President François Hollande at the Élysée Palace and met with Prime Minister Jean-Marc Ayrault. The two Presidents attended a memorial ceremony at Oradour-sur-Glane, the site of a World War II massacre committed by members of the Waffen-SS. Gauck concluded his stay with a visit of Marseille, in that year a European Capital of Culture.\n|-\n|9 September\n|\n|Innsbruck\n|Gauck attended the annual informal meeting of the German speaking heads of state with President of Austria Heinz Fischer, Crown Prince Alois of Liechtenstein and President of the Swiss Confederation Ueli Maurer.\n|-\n|7–9 October\n| rowspan=\"2\" |\n|Kraków\n|On 7 October, Gauck met with Presidents Giorgio Napolitano and Bronisław Komorowski of Italy and Poland, to discuss the political developments since their last convention in the previous year which had included the signing of the Naples Appeal. Later that day, the three presidents had a talk with Viktor Yanukovych, the President of Ukraine, which dealt with the Ukraine–European Union relations. On 8 and 9 October, Gauck, Napolitano and Komorowski attended the 2013 Arraiolos meeting with another five non-executive presidents of EU member states.\n|-\n|18 October\n|Słubice\n|Together with Bronisław Komorowski, the President of Poland, Gauck opened the academic term at Collegium Polonicum (pl) in Słubice and Viadrina European University in Frankfurt (Oder), Germany, which is located on the other bank of the Oder river.\n|-\n|10 December\n|}}\n|Johannesburg\n|Gauck attended the state memorial service for Nelson Mandela and visited Liliesleaf Farm.\n|}\n2014\n{| class=\"wikitable\" border=\"1\"\n!       Date\n!       Countries\n!\n!       Narrative\n|-\n| rowspan=\"2\" |\n|\n|New DelhiBangalore\n|During his state visit to India, Gauck was received by President Pranab Mukherjee had talks with Prime Minister Manmohan Singh and further politicians and delivered a speech at Jawaharlal Nehru University. Other appointments saw him visiting businesses in Bangalore and a German-funded coir development aid project.\n|-\n|\n|NaypyidawYangon\n|Gauck's official visit to Burma was due to the 60th anniversary of diplomatic relations between the two countries. He was received by President Thein Sein, met with Nobel Peace laureate Aung San Suu Kyi and delivered a speech addressing the Union of Myanmar Federation of Chambers of Commerce and Industry.\n|-\n|5–7 March\n|\n|AthensLingiadesIoannina\n|Gauck paid a state visit to the Hellenic Republic, during which he was received by President Karolos Papoulias, had talks with further Greek politicians and intellectuals and delivered a speech at the Acropolis Museum \"On the Heritage and Future of Europe\". Gauck also visited the memorial at Lingiades, a village where in 1943, the 1st Mountain Division of the Wehrmacht had committed a massacre killing 87 civilians, as well as the synagoge of the Jewish community in Ioannina, commemorating their deportation to Auschwitz 70 years earlier.\n|-\n|1–2 April\n|\n|BernGeneva\n|During his official stay in Switzerland, Gauck was received by President Didier Burkhalter, attended a discussion about the concept of direct democracy and paid a visit to CERN.\n|-\n|26–29 April\n|\n|KahramanmaraşAnkaraIstanbul\n|Before being officially received by President Abdullah Gül, Gauck visited a camp for refugees of the Syrian Civil War near Kahramanmaraş, as well as a Bundeswehr unit operating the MIM-104 Patriot as part of Operation Active Fence. In Ankara, he also met with Prime Minister Recep Tayyip Erdoğan and delivered a speech at the Middle East Technical University on the Germany–Turkey relations. In Istanbul, he visited Hagia Sophia and opened the German-Turkish University.\n|-\n|4–7 May\n|}}\n|PragueTerezínMladá Boleslav\n|At the beginning of his state visit, Gauck was received by President Miloš Zeman and had talks with Prime Minister Bohuslav Sobotka and other Czech politicians. On 6 May, he held a speech at Charles University about multiculturalism in Europe and attended a memorial ceremony at the site of Theresienstadt concentration camp, together with Zeman. On the final day of his stay, Gauck visited the headquarters of Škoda Auto in Mladá Boleslav.\n|-\n|13 May\n|\n|Uddel\n|Gauck paid a visit to the I. German/Dutch Corps and observed a NATO Response Force exercise.\n|-\n|4 June\n|\n|Warsaw\n|First in a series of meetings of the Presidents of Germany (Gauck), Poland (Komorowski), the Czech Republic (Zeman), Slovakia (Gašparovič) and Hungary (Áder) to commemorate key events of the Revolutions of 1989: On the 25th anniversary of the 1989 Polish legislative election (which had paved the way to the fall of communism in Poland), they convened in Warsaw.\n|-\n|7 June\n|\n|Kyiv\n|Gauck attended the inauguration of President Petro Poroshenko, together with President of Poland Bronisław Komorowski, US Vice President Joe Biden and Herman Van Rompuy, the President of the European Council. Their attendance is seen as a symbol of support for the legitimacy of the 2014 Ukrainian presidential election.\n|-\n|10–13 June\n|\n|OsloTrondheim\n|The state visit commenced with Gauck being received by King Harald V of Norway in Oslo and subsequent talks with Prime Minister Erna Solberg and Olemic Thommessen, the President of the Storting. Further appointments saw him visiting the Norwegian Nobel Institute and hosting a reception on board the Gorch Fock, a tall ship of the German Navy. In Trondheim, Gauck had a discussion with students of the Norwegian University of Science and Technology and visited Nidaros Cathedral.\n|-\n|16 June\n|\n|Budapest\n|Second in a series of meetings of the Presidents of Germany (Gauck), Poland (Komorowski), the Czech Republic (Zeman), Slovakia (Gašparovič) and Hungary (Áder) to commemorate key events of the Revolutions of 1989: On the 25th anniversary of the rehabilitation of Imre Nagy and the reburial of his remains (which is considered a vital element in ending communism in Hungary), they convened in Budapest.\n|-\n|23–25 June\n|\n|LisbonPalmelaSintra\n|Gauck was received by President Aníbal Cavaco Silva at Belém Palace and had a luncheon with Prime Minister Pedro Passos Coelho and other politicians. His further appointments included visits of the AutoEuropa plant in Palmela and the Sintra National Palace.\n|-\n|13 July\n|\n|Rio de Janeiro\n|Gauck attended the final of the 2014 FIFA World Cup, which was contested between the national football teams of Germany and Argentina, together with chancellor Angela Merkel.\n|-\n| rowspan=\"2\" |3–4 August\n|\n|Vieil Armand\n|Centenary of the outbreak of World War I: On 3 August, 100 years after Germany had declared war on France, Joachim Gauck and French President François Hollande commemorated that day at the national monument of the Battle of Hartmannswillerkopf.\n|-\n|\n|LiègeLeuvenMons\n|On the next day, the centenary of the German invasion of Belgium and the British entry into the war, the two presidents attended a memorial ceremony near Liège, together with dignitaries from more than 50 countries. They both delivered a speech, as did King Philippe of Belgium and the Duke of Cambridge. Together with the King and Queen of Belgium, Gauck held further memorial services in Leuven, which included him delivering a speech at the library of the Catholic University, that was destroyed by German troops in 1914. On the invitation of British Prime Minister David Cameron, Gauck concluded the day attending a memorial ceremony at St Symphorien military cemetery, which contains the graves of World War I servicemen of Germany and the Commonwealth.\n|-\n|30 August\n|\n|Maastricht\n|Gauck attended the festivities of the 200th anniversary of the Kingdom of the Netherlands.\n|-\n|1 September\n|\n|Gdańsk\n|At Westerplatte, Gauck joined a memorial ceremony due to the 75th anniversary of the German attack on Poland, which had marked the outbreak of World War II.\n|-\n|\n|\n|OttawaTorontoQuébec City\n|During his first official visit to Canada, Gauck was received by the Governor General of Canada David Lloyd Johnston, Prime Minister of Canada Stephen Harper, the Speaker of the House of Commons Andrew Scheer and the Speaker of the Senate Noël Kinsella. He also visited the subsidiary of banknote printing company Giesecke & Devrient in Ottawa.\n|-\n|29–30 September\n|\n|Braga\n|Meeting of the Arraiolos Group.\n|-\n|3–5 November\n|\n|Luxemburg (city)ViandenSchengenEsch-sur-Alzette\n|During his visit to Luxembourg, Gauck was received by the Grand Duke of Luxembourg Henri, Prime Minister Xavier Bettel, Minister for Foreign Affairs Jean Asselborn and the President of the Chamber of Deputies Mars Di Bartolomeo.\n|-\n| rowspan=\"2\" |16–17 November\n|\n|Bratislava\n| rowspan=\"2\" |Together with the Presidents of Poland, Hungary, the Czech Republic and Slovakia, Gauck commemorated the fall of communism in Czechoslovakia during the Velvet Revolution 25 years ago.\n|-\n|\n|Prague\n|-\n|25–26 November\n|\n|LjubljanaNova Gorica\n|During his visit to Slovenia, Gauck was received by President Borut Pahor and Prime Minister Miro Cerar.\n|-\n|11 December\n|\n|Turin\n|Gauck gave a speech at the first Italian-German dialogue forum.\n|-\n|}\n2015\n{| class=\"wikitable\" border=\"1\"\n!       Date\n!       Countries\n!\n!       Narrative\n|-\n|27 January\n|\n|Oświęcim\n|Gauck attended the commemoration of the 70th anniversary of the liberation of Auschwitz concentration camp.\n|-\n|3–6 February\n|\n|Dar es SalaamZanzibarArushaSeronera\n|During his visit, Gauck was received by the President of Tanzania Jakaya Kikwete and the President of Zanzibar Ali Mohamed Shein. He also visited the headquarters of the East African Community in Arusha and the Serengeti National Park.\n|-\n|22 February\n|\n|Kyiv\n|Gauck travelled to Kyiv at the invitation of Ukrainian President Petro Poroshenko. Along with other heads of state, the Federal President attended a ceremony to mark the culmination of the protests on the Maidan a year ago and thus expressed solidarity with the Ukrainian pro democracy movement.\n|-\n|20–24 March\n|\n|LimaAyacuchoCuscoOllantaytamboMachu Picchu\n|Gauck was welcomed by President Ollanta Humala with military honours in Lima followed by talks and a state banquet. He also met with the President of Congress and the President of the Supreme Court of Justice. On his third day he visited the Museo de la Memoria in Ayacucho and met with the president of the National Association of Relatives of the Kidnapped, Arrested, and Disappeared in Peru.\n|-\n|27 April\n|\n|Vienna\n|Gauck participated in a state ceremony for the 70th anniversary of the reinstitution of the Republic of Austria.\n|-\n|27–29 April\n|\n|TunisSiliana\n|Gauck was welcomed by President Beji Caid Essebsi. Gauck also met with Prime Minister Habib Essid. With members of the \"Commission for Truth and Dignity\" he talked about the challenges of the transitional justice system.\n|-\n|29–30 April\n|\n|VallettaMarsaAttard\n|Gauck met with President Marie Louise Coleiro Preca and Prime Minister Joseph Muscat. He visited the refugee camp in Marsa.\n|-\n|4 May\n|\n|Warsaw\n|Gauck attended the funeral of Władysław Bartoszewski.\n|-\n|13–15 July\n|\n|DublinGalwayCounty Clare\n|During his state visit, Gauck was received by the President of Ireland Michael D. Higgins. He also met with Taoiseach Enda Kenny and the Minister for Foreign Affairs and Trade Charles Flanagan. He visited the Houses of the Oireachtas and Trinity College Dublin. On last day, he was awarded an honorary doctorate at NUI Galway and gave a speech at the Irish Centre for Human Rights. He then visited the Cliffs of Moher.\n|-\n|\n|}}\n|VaduzTriesenberg\n|Gauck met with Crown Prince Alois of Liechtenstein and the reigning Prince of Liechtenstein Hans-Adam II in Vaduz Castle. On the second day he attended the annual meeting of the heads of state of German speaking countries with President of Austria Heinz Fischer, King Philippe of Belgium, Crown Prince Alois of Liechtenstein, Grand Duke Henri of Luxembourg and President of the Swiss Confederation Simonetta Sommaruga.\n|-\n|5–8 October\n|\n|Philadelphia\n|Gauck visited the German Society of Pennsylvania, the Liberty Bell, the Independence Hall and the National Constitution Center in Philadelphia and gave a speech at the University of Pennsylvania. In Washington D.C. he was welcomed by President Barack Obama at the White House. Afterwards he met with Vice President Joe Biden for lunch and held political talks with United States Secretary of State John Kerry. He also visited the Capitol, the Library of Congress, the Lincoln Memorial and the Martin Luther King, Jr. Memorial.\n|-\n|10–14 October\n|\n|SeoulPaju\n|The visit to South Korea was focused on 25 years of German unity and 70 years of Korea's division. In Seoul Gauck addressed the South Korean National Assembly and held political talks with President Park Geun-hye and other high ranking politicians. Then he spoke to members of the German-Korean advisory body on foreign policy aspects of reunification. Meetings with North Korean refugees and representatives of South Korea's civil society were also on the agenda. On the border between North and South Korea, he opened an exhibition on German unity and visited the Korean Demilitarized Zone.\n|-\n|14–16October\n|\n|Ulaanbaatar\n|Held political talks with President Tsakhiagiin Elbegdorj and the Chairman of Parliament. He also met business representatives, religious leaders and representatives of civil society and academia in Ulaanbaatar. At the German Mongolian University of Applied Sciences for Raw Materials and Technology he met students and staff.\n|-\n| rowspan=\"2\" |5–8 December\n|\n|Tel AvivJerusalem\n|In Israel, Gauck was welcomed by Israeli President Reuven Rivlin at the Israeli Opera in Tel Aviv. Together they attended a concert of the Thomanerchor and the Gewandhausorchester marking the 50th anniversary of the establishment of diplomatic relations between Germany and Israel. On second day he met with Prime Minister Benjamin Netanyahu in Jerusalem. There he was awarded an honorary doctorate by the Hebrew University.\n|-\n|\n|AmmanAzraq\n|Lecturered to students at the German-Jordanian University in Amman. Afterwards he was welcomed with military honours by King Abdullah II of Jordan of the Hashemite Kingdom of Jordan at the Husseiniya Palace. The last day he visited a refugee camp for Syrian refugees run by the UNHCR in Azraq.\n|}\n2016\n{| class=\"wikitable\" border=\"1\"\n!       Date\n!       Countries\n!\n!       Narrative\n|-\n|20 January\n|nowrap|\n|Davos\n|Gauck attended the annual meeting of the World Economic Forum.\n|-\n| rowspan=\"2\" |\n|\n|LagosAbuja\n|Gauck arrived in Lagos and had a meeting with Lagos State Governor Akinwunmi Ambode. He also visited the Freedom Park Memorial and met with the Nobel Laureate in Literature Wole Soyinka. In Lagos, he also met with German and Nigerian business representatives. In Abuja he met with Kadré Désiré Ouédraogo, President of the Commission of the Economic Community of West African States ECOWAS. Gauck visited the New Kuchigoro refugee camp, afterwards he talked with civil society representatives at the German Ambassador's Residence. The next day, he was welcomed with military honours by the President of the Federal Republic of Nigeria Muhammadu Buhari.\n|-\n|\n|BamakoKoulikoro\n|Welcomed with military honours by Ibrahim Boubacar Keita, President of the Republic of Mali. He also visited the EUTM headquarters, where he talked with German members of EUTM, EUCAP Sahel, MINUSMA and UNPOL. He visited Camp Gecko as well, where he talked with German soldiers.\n|-\n|8–10 March\n|\n|BrusselsAntwerpMechelenLiègeEupen\n|At his official state visit to Belgium, Gauck was welcomed with military honours by King Philippe and Queen Mathilde of Belgium. He also met with Charles Michel, Prime Minister of the Kingdom of Belgium, Siegfried Bracke, President of the Belgian House of Representatives, and Christine Defraigne, President of the Senate. In Eupen, he met with Oliver Paasch, Minister-President of the German-speaking Community, and Karl-Heinz Klinkenberg, Mayor of Eupen.\n|-\n|20–24 March\n|\n|BeijingShanghaiXi'an\n|During his visit, Gauck was received by the President of the People's Republic of China Xi Jinping and met with intellectuals, artists and religious representatives. He also gave a speech at the Tongji University.\n|-\n|13 April\n|\n|Turin\n|Gauck met with Italian President Sergio Mattarella.\n|-\n|\n|}}\n|OrkneyLondon\n|Gauck and Princess Anne paid tribute to sailors killed in battle at a service of remembrance at St Magnus Cathedral in Kirkwall, Orkney to commemorate the 100th anniversary of the Battle of Jutland between the British and German fleets. Following his visit to the Orkney Islands, he arrived in London for the final day of his visit to the UK where he toured the Victoria and Albert Museum and met with Queen Elizabeth II.\n|-\n|17 June\n|\n|Warsaw\n|Gauck met with Polish President Andrzej Duda and Prime Minister Beata Szydło.\n|-\n| rowspan=\"3\" |20-24 June\n|\n|BukarestSibiu\n|Gauck met with Romanian President Klaus Johannis, Prime Minister Dacian Cioloș and the chairmen of the two parliamentary chambers. He also talked with representatives of the Romanian and German business, representatives of civil society and the German minority in Romania.\n|-\n|\n|Sofia\n|Met with President Rosen Plevneliev, Prime Minister Boyko Borisov the President of the Parliament of the Republic of Bulgaria Tsetska Tsacheva and attended the opening of the German-Bulgarian Economic Forum.\n|-\n|\n|Ljubljana\n|Met with President Borut Pahor and attended the celebrations for the 25th anniversary of the independence of the Republic of Slovenia.\n|-\n| rowspan=\"2\" |11-16 July\n|\n|\n|Met with President Michelle Bachelet.\n|-\n|\n|Montevideo\n|Met with President Tabaré Vázquez.\n|-\n|7-8 September\n|\n|Brussels\n|Gauck participated in the meeting of heads of state of German-speaking countries.\n|-\n|\n|\n|SofiaPlovdiv\n|Gauck participated in the meeting of the Arraiolos Group.\n|-\n|29 September\n|\n|Kyiv\n|Gauck participated in the commemorative events on the 75th anniversary of the mass executions of Babi Yar.\n|-\n|30 September\n|\n|Jerusalem\n|Gauck participated in the funeral of former Israeli President Shimon Peres.\n|-\n|10 November\n|\n|Gdańsk\n|Gauck visited the European Solidarity Centre.\n|-\n|13-18 November\n|\n|TokyoKyotoNagasaki\n|Gauck had political talks with Emperor Akihito, Prime Minister Shinzō Abe, Crown Prince Naruhito and representatives of the Parliament. He also gave a speech to students at Waseda University. In Kyoto, he visited the Ginkaku-ji. In Nagasaki, he visited the Nagasaki Peace Park.\n|-\n|28 November\n|\n|Szczecin\n|Gauck visited the Multinational Corps Northeast, accompanied by Polish President Andrzej Duda.\n|-\n|}\n2017\n{| class=\"wikitable\" border=\"1\"\n!       Date\n!       Countries\n!\n!       Narrative\n|-\n|\n|\n|Paris\n|Gauck met with French President François Hollande and was awarded the honorary doctorate of the University of Paris-Sorbonne.\n|-\n|1 February\n|\n|Madrid\n|Gauck had a lunch with the Spanish King Felipe VI and Queen Letizia. He also visited the Museo del Prado.\n|-\n|6-7 February\n|}}\n|The HagueMaastricht\n|Gauck met with King Willem-Alexander of the Netherlands and Queen Máxima. He also visited the Mauritshuis Museum and was awarded the honorary doctorate of Maastricht University.\n|-\n|9 February\n|\n|Riga\n|Gauck met with Latvian President Raimonds Vējonis, Lithuanian President Dalia Grybauskaitė and Estonian President Kersti Kaljulaid.\n|-\n|}\nReferences\nExternal links\n* [https://web.archive.org/web/20130705180043/http://www.bundespraesident.de/DE/Bundespraesident-Joachim-Gauck/Reisen-und-Termine/Berichte/berichte-node.html Official website about the appointments and journeys of the Federal President of Germany]"
    }
  ]
}