{
  "content": [
    {
      "type": "text",
      "text": "# List of Byzantine wars\n\nThis is a list of the wars or external conflicts fought during the history of the Eastern Roman or Byzantine Empire (395–1453). For internal conflicts see the list of Byzantine revolts and civil wars.\nFor conflicts of the Ancient Roman Kingdom, Republic and Empire see the: List of Roman wars and battles.\n5th century and earlier\n* 421–422: Roman–Sasanian War of 421–422\n* 440: Byzantine–Sasanian War of 440 with Sassanid Persia\n* 447: Battle of the Utus\n* 468: Battle of Cape Bon\n* 492: Battle of Cotyaeum – The Byzantine army under John the Scythian defeated the Isaurians under Longinus of Cardala.\n6th century\n, at its greatest extent since the fall of the Western Roman Empire (its vassals in pink)]]\n* 502–506: Anastasian War with Sassanid Persia.\n* 526–532: Iberian War with Sassanid Persia.\n* Justinian campaigns  (533–555): The Eastern Roman emperor Justinian launched an ambitious reconquest of Italy, North Africa and parts of Spain. However, new invaders like the Avars, Lombards and Slavs, alongside a pandemic known as the Plague of Justinian  and various volcanic winters ended his ambition of recuperate the West and consolidate the reconquest.\n** 533–534: Vandalic War in Northern Africa.\n** 534–548: Moorish Wars in Africa.\n** 535–554: Gothic War in Dalmatia and Italy.\n** 541–562: Lazic War with Sassanid Persia.\n** 552–555: Byzantine intervention in the Visigoth civil war in Spain, formation of Spania province.\n** 560s–578: War with the Romano-Moorish kingdom of Garmul.\n* 568-626: Avar-Byzantine wars in the Balkans and Greece including the siege of Constantinople in 626.\n* 568-750: Byzantine-Lombard Wars in northern Italy.\n* 572–591: Byzantine–Sasanian War of 572–591 over the Caucasus.\n* 589: Franco-Lombard-Byzantine conflict over the Po Valley. The war was stopped by breaching dam in Cucca.\n* 582–602: Maurice's Balkan campaigns against the Avars and Slavs in the Balkans.\n7th century\n, to the Rashidun Caliphate. At the same time the Slavs invaded and settled in the Balkans. The losses continued in the next century]]\nThe Eastern Roman emperor Heraclius adopted the Greek language as official language in 610. Constantinople's territorial control shrunk to Greece and Anatolia, because of Persian, Avar and finally Arab invasions. Due to these changing circumstances, the reign of Heraclius is often regarded as the turning point from which historiography stops calling it the \"Eastern Roman Empire\", and starts speaking of the \"Byzantine Empire\".\n* 602–628: Byzantine–Sasanian War of 602–628: last Roman/Byzantine–Persian/Sasanian war.\n* 626: Avar–Sasanian siege of Constantinople.\n* 633–642: Beginning of the early Muslim conquests. The Rashidun Caliphate conquered Syria (634–638) and Egypt (639–642).\n* 645–656: Renewed war with the Caliphate, loss of Cyprus and most of Armenia. The Rashidun advance towards Constantinople halted following the outbreak of the First Fitna.\n* 647–709: Umayyad conquest of North Africa.\n* 668–678: Renewed attacks on the Byzantine Empire by Muawiyah II, leading to the First Arab Siege of Constantinople. Following its failure, a truce was agreed, providing for payment of tribute, men and horses to the Empire.\n* 676–678: Siege of Thessalonica by the local Slavic tribes.\n* 680–681: Constantine IV's campaign against the Bulgar khan Asparukh ends in defeat, forcing the Empire to recognize the establishment of the First Bulgarian Empire in Moesia.\n* 686–688: Successful Byzantine offensive established Byzantine control over Armenia and Caucasian Iberia, followed by favourable peace agreement with the Umayyad Caliphate, in return for the withdrawal of the Mardaites into the Empire.\n* 688–689: Balkan campaign of Justinian II secured the coast between Thrace and Macedonia. Many Slavs were captured and resettled in imperial territory. Over 30,000 were incorporated into the Byzantine army.\n* 689: Justinian II leads his army into Syria when Abd al-Malik ibn Marwan stops the payment of tributes due to Mardaites raids. Approximately 12,000 Mardaites are deported to the Empire. Peace is re-established and tributes resumed.\n* 692–718: Almost constant war with the Arabs in various fronts. The defeat at the Battle of Sebastopolis and internal instability led to the gradual loss of Armenia and Cilicia, and despite some successes by Emperor Heraclius, the Byzantines generally maintained a defensive stance against the annual Arab raids into Anatolia. Carthage fell in 697. Recovered soon after, it was again lost in 698, marking the end of Byzantine North Africa. From 712 on, the Arab raids penetrated ever deeper into Anatolia, with the final objective of mounting an assault on Constantinople itself. The repulsion of the Second Arab Siege of Constantinople (717–718) was a major Byzantine success. Consider to be one of history's most important battles, the victory halted Muslim advance into Southeastern Europe for centuries.\n8th century\n* 708: War with Bulgaria ends in defeat at Anchialus.\n* 720–740 : Annual Arab raiding expeditions (''ṣawā'if) against Byzantine Anatolia resume. Stiffening Byzantine resistance leads to the victory at Akroinon at 740.\n* 741–752: Campaigns of Constantine V against the Arabs, who were embroiled in civil war, leading to the recovery of all of Armenia and Cyprus.\n* 755–767: War with the Bulgars. Constantine V defeats the Bulgar khan Telets, leading to the conclusion of a favourable peace treaty in 767.\n* 772–775: War with the Bulgars under Telerig, launched as a pre-emptive strike by Constantine V.\n* 775–783: War with the Abbasids. After the death of Constantine V in 775, Arab raids resumed. After a heavy defeat at Germanicopolis in 779/780, the Abbasids launched a series of major invasions under Harun al-Rashid, which led to the conclusion of a truce in 783.\n* 780–783: Raids by the Bulgars under Kardam, leading to an agreement of non-aggression in exchange for annual payments.\n* 783: Expedition of Staurakios against the Sclaviniae'' of Greece.\n* 791–792 and 796: Campaigns against the Bulgarians under Constantine VI end in defeat at the Battle of Marcellae.\n* 797–798: Large-scale invasion by Harun al-Rashid leads to the resumption of annual payments to the Caliphate in return for peace.\n9th century\n* 803–809: War with the Abbasids, resulting from Nikephoros I's cessation of annual tribute payments. The Arabs under Harun al-Rashid achieved significant early successes, but the outbreak of a revolt in Khorasan facilitated a Byzantine counter-offensive in 807–809. A truce in 809 restored the territorial status quo.\n* 806–814: War with the Frankish empire as the Carolingian Empire over control of the Italian Peninsula, Dalmatia and the Adriatic Sea, and also the Problem of two emperors. Ended with the Pax Nicephori in a Status quo ante bellum and Republic of Venice as Buffer state.\n* 808–816: Wars with the Bulgars, beginning with the Bulgarian capture of Sofia. A large-scale retaliatory campaign ended in the disastrous battle of Pliska (811), following which Krum of Bulgaria raided Eastern Thrace and secured a major victory at Versinikia. Following his death in 814, Leo V the Armenian defeated the Bulgars at Mesembria and secured a 30-year peace.\n* 827–902: Muslim conquest of Sicily.\n* 830–841: War with the Abbasids, with large-scale invasions launched by caliphs al-Ma'mun and al-Mu'tasim. Despite a crushing defeat at the Battle of Dazimon and the sack of Amorium in 838, Emperor Theophilos was able to conclude a truce in 841 without territorial losses, although raids by the Muslim border emirates continued.\n* 830s: Rus' raid in Paphlagonia.\n* ca. 844–878: Wars with the Paulicians of Tephrike end with the destruction of the Paulician state and its incorporation into the Empire.\n* 851–863: War with the Abbasids and their clients. Successful Byzantine raids in Syria, Mesopotamia and Egypt are checked by a series of Muslim invasions of Anatolia in 860. Another invasion in 863 sees the complete annihilation of the Muslim army at the Battle of Lalakaon.\n* 860: Rus' raid against Constantinople.\n* 852, 855–856: Short wars with Bulgaria, ending in the recovery of several cities in northern Thrace.\n* 871–885: Campaigns led by Basil I in person against northern Mesopotamia (871–873) are followed by a series of expeditions against the Muslims in Sicily and Southern Italy. The final loss of Sicily could not be averted, but the Arabs are driven from Southern Italy and Dalmatia, laying the foundations of the Catepanate of Italy.\n* 894–896/897: War with Bulgaria under Tsar Simeon erupts over trade rights. It ends with a Bulgarian victory after the Battle of Bulgarophygon. The Byzantines agree to pay tribute and restore the market for Bulgarian goods to Constantinople.\n10th century\n* 907: Rus' raid against Constantinople.\n* 913–927: War with Bulgaria under Tsar Simeon.\n* 926–944: Byzantine offensive in the East under John Kourkouas, fall of Melitene and Theodosiopolis.\n* 941: Rus' raid against Constantinople.\n* 948–962: Constant large-scale raids and counter-raids along the Byzantine-Arab border, chiefly against the Hamdanid dynasty Emir of Aleppo, Sayf al-Daula.\n* 960–961: Huge amphibious expedition against the Emirate of Crete under Nikephoros Phokas, resulting in the recapture of the island.\n* 964–965: Byzantine conquest of Cilicia\n* 964–975: Sustained Byzantine offensive in the East, under Nikephoros II Phokas and John I Tzimiskes, leads to the conquest of Cilicia, Cyprus, much of western Armenia and northern Syria. Aleppo becomes an imperial vassal.\n* 970–971: War against the Kievan Rus' in Bulgaria.\n* 976–1018: War against Bulgaria led by the Cometopuli dynasty.\n* 986: Battle of the Gates of Trajan major defeat of Basil II at the hands of Samuel of Bulgaria\n* 992–999: War with the Fatimids over Aleppo. Initial Fatimid victories over Michael Bourtzes lead to the direct intervention of Basil II, who clears northern Syria of the Fatimids and secures a ten-year truce\n11th century\n* 1014: Battle of Kleidion decisive victory over the Bulgarians under Samuel.\n* 1018: Byzantine conquest of Bulgaria.\n* 1021-1022: Campaigns of Basil II against Georgia.\n* 1027: Pecheneg raid in the Balkans is defeated by Constantine Diogenes.\n* 1030–1032: War against the Muslims in Syria. Emperor Romanos III is defeated, but George Maniakes captured Edessa.\n* 1032–1036: Operations against renewed Muslim piratical raids. The Byzantine fleet, including a large Varangian contingent, is victorious.\n* 1038–1043: Campaigns of George Maniakes in Sicily and Southern Italy, until his own revolt against Constantine IX.\n* 1040–1189: Byzantine–Norman wars\n* 1040–1041: Uprising of Peter Delyan in Bulgaria failed.\n* 1042: Battle of Bar, Stefan Vojislav asserts his state's independence from Byzantium.\n* 1043: Rus' attack against Constantinople.\n* 1048: First confrontation between Byzantines and the Seljuk Turks results in an indecisive battle at Kapetron.\n* 1049–1053: Pecheneg Revolt in Thrace.\n* 1068-1071: Siege of Bari The Normans conquered Bari and put an end to the Catepanate of Italy.\n* 1071: Battle of Mantzikert The Seljuk Turks defeated the Byzantines and began the invasion of Anatolia.\n* 1078:  Suleyman creates the Sultanate of Rum after conquering Nicaea.\n* 1081–1085: War against the first Norman invasion of the Balkans. Early Byzantine defeat at Dyrrhachium (1081), but the successful defence of Thessaly and naval victories with Venetian aid led to the eventual abandonment of the invasion after the death of Robert Guiscard.\n* 1081–1095: Seljuk campaigns in the Aegean: Tzachas of Smyrna launches fleets in the Aegean and seizes a number of islands, but is eventually defeated by the Byzantines.\n* 1086–1091: Uprising of the Bogomils in the Balkans, aided by the Cumans and Pechenegs. Early Byzantine defeat at Dristra (1086), but the Pechenegs were decisively defeated at the Battle of Levounion in  1091.\n* 1090–1095: Byzantine–Serbian War\n* 1096–1097: The First Crusade passed through Byzantium on its way to the Holy Land. Recovery of Nicaea with the Crusaders' aid, and subsequent reconquest of much of western Asia Minor by John Doukas.\n* 1091–1108: Renewed war with the Normans under Bohemond I of Antioch, both in Cilicia against the Principality of Antioch and in Epirus. The war ended with Bohemond recognizing Byzantine suzerainty over Antioch.\n12th century\n* 1107–1110: Provided diplomatic and economic support to the Norwegians during the Norwegian Crusade\n* 1110–1117: Renewed war with the Seljuk Turks. Initial Turkish advances are reversed in a treaty concluded after the Byzantine victory at the Battle of Philomelion (1116).\n* 1124–1126: War with Venice over the non-renewal of trading privileges by John II Komnenos. The Venetian fleet ravaged the coasts of Greece, forcing  the emperor to back down.\n* 1127–1129: War with Hungary.\n* 1136–1139: Conquest of Armenian Cilicia and vassalization of the Principality of Antioch.\n* 1147–1148: Roger II of Sicily attacks and occupies Euboea, Thebes and Corinth\n* 1149–1152: Serbian rebellion is subdued by Manuel I Komnenos. Manuel also defeats a Hungarian army that came to aid the Serbs.\n* 1155–1156: War with Hungary ends in Byzantine victory.\n* 1155–1158: Italian expedition of Manuel I Komnenos. Despite initial success, the expedition fails.\n* 1158–1161: Expeditions against the Seljuks\n* 1163–1168: War with Hungary. It ends in a Byzantine victory with the Battle of Sirmium, after which the Empire regains most of the Western Balkans.\n* 1169: Joint Byzantine-Crusader raid on Damietta fails.\n* 1171–1177: War with Venice. Initial Venetian moves in the Aegean checked by the Byzantine fleet. Truce concluded in 1177, peace treaty in 1183.\n* 1176–1180: War with the Seljuks. Initial campaign against ends in the defeat at the Battle of Myriokephalon, resulting in the gradual loss of territory in Anatolia.\n* 1180–1185: War with Hungary ends in Hungarian victory.\n* 1185: Norman invasion of the Balkans. The Normans take Dyrrhachium and Thessalonica before being defeated.\n* 1185: Uprising of Asen and Peter. Reestablishment of the Bulgarian Empire.\n* 1189–1190: Byzantine–Holy Roman Empire conflict during the Third Crusade: a short small-scale war from August 1189 to early 1190 due to a breakdown in diplomatic relations between Byzantine emperor Isaac II Angelos and Frederick I, Holy Roman Emperor, who was passing through Byzantine lands to Jerusalem with his crusader army\n13th century\n* 1203–1204: Fourth Crusade, culminating in the capture of Constantinople by the Crusaders.\n* 1204–1214: Wars between the Empire of Nicaea and the Latin Empire. Ended by  the Treaty of Nymphaeum.\n* 1205-1206: Siege of Trebizond Trapezuntine victory; Seljuks fail to take the capital.\n* 1211: Battle of Antioch on the Meander Nicaean decisive victory against the Seljuks.\n* 1214: Siege of Sinope Seljuq victory, fall of the city.\n* 1215–1227: Expansion of Epirus under Theodore Komnenos Doukas. Epirote forces conquer the Kingdom of Thessalonica and much of Thrace from the Empire of Nicaea. Theodore of Epirus is crowned emperor at Thessalonica.\n* 1222-1223: Siege of Trebizond by the Seljuks, Trapezuntine victory.\n* 1230: Theodore of Epirus invades Bulgaria but is defeated and captured at the Battle of Klokotnitsa.\n* 1235: Joint Nicaean-Bulgarian siege of Constantinople fails\n* 1254–1256: Bulgaria attacks Nicaea after the death of John III Vatatzes, in an attempt to recover lost territory. Emperor Theodore II Laskaris campaigns against the Bulgarians and drives them back.\n* 1257–1259: War between Nicaea and Epirus. After the Battle of Pelagonia (1259), most of Epirus and Thessaly fall to the Nicaeans, but the conquest proves temporary.\n* 1260: Unsuccessful siege of Constantinople by the Empire of Nicaea.\n* 1263–1266: Campaign in the Morea against the Principality of Achaea. Initial successes undone by defeats in the battles of Prinitza and Makryplagi.\n* ca. 1272–1280: Campaigns of Licario recover Euboea and many Aegean islands for the Empire.\n* sometime in 1273–1275: Large-scale campaign against John I Doukas of Thessaly. The Byzantine army is defeated at Neopatras, but the navy scores a major victory at Demetrias.\n* 1274–1275: Byzantine offensive against Angevin holdings in Albania drive the Angevin forces out of most of the country, although repeated assaults on their last two strongholds of Dyrrhachium and Valona fail.\n* 1279: Unsuccessful campaigns against Bulgaria, defeat at Devina.\n* 1280–1281: Angevin offensive in Albania is repulsed at Berat, and most of Albania is retaken.\n* 1282: Failed Georgian Siege of Trebizond.\n* 1294–1302: Byzantine–Venetian War, fought mostly in the Aegean and Marmara seas.\n14th century\n* 1302–1305: War with the Ottoman Turks. After a defeat in the Battle of Bapheus, the Byzantines hire the Catalan Company. After a series of victories against the Turks, the Catalans turn against Byzantium following the murder of their leader.\n* 1304–1305: The Bulgarians attack Byzantium, and manage to recover the port cities on the Black Sea coast.\n* 1306-1310: Hospitaller conquest of Rhodes.\n* 1321–1328: Byzantine civil war of 1321–1328.\n* 1326–1338: Gradual capture of the remaining Byzantine cities in northwestern Anatolia by the Ottomans, Bursa in 1326, Nicaea in 1331 and Nicomedia in 1337. Defeats of the Byzantines in battles at Pelekanon and Philokrene.\n* 1332: Battle of Rusokastro, the last major battle of the Byzantine–Bulgarian Wars ends with a Bulgarian victory.\n* 1333–1340: Andronikos III Palaiologos recovers Epirus and Thessaly.\n* 1334: Serbian invasion of Macedonia led by Syrgiannes Palaiologos.\n* 1343–1348: Taking advantage of the ongoing Byzantine civil war, Serbian ruler Stefan Dushan conquers Albania, Macedonia and Epirus.\n* 1348–1349: Byzantine–Genoese War, fought over control of custom duties and tariffs on the Bosporus Straight.\n* 1352–1357: Byzantine civil war of 1352–1357.\n* 1362: Ottoman conquest of Adrianople.\n* 1373–1379: Byzantine civil war of 1373–1379.\n* 1394-1402: Siege of Constantinople Byzantine victory.\n15th century\n* 1411: Siege of Constantinople Ottomans fail to capture the city.\n* 1422: Unsuccessful Ottoman siege of Constantinople.\n* 1422-1430: Siege of Thessalonica Ottomans capture the city.\n* 1442: Unsuccessful Ottoman siege of Trebizond.\n* 1453: Final Ottoman siege and fall of Constantinople to Mehmed II.\n* 1460: Mehmed II's conquest of the Despotate of the Morea.\n* 1461: Mehmed II's conquest of the Empire of Trebizond, the last proper Byzantine Greek successor state.\n* 1475: Mehmed II's conquest of the Principality of Theodoro, a rump state of the Empire of Trebizond, and the last Byzantine Greek successor state.\nSee also\n* Medieval warfare\nReferences\nSources"
    }
  ]
}