{
  "content": [
    {
      "type": "text",
      "text": "# List of Pakistani submissions for the Academy Award for Best International Feature Film\n\nPakistan submitted its first film for the Academy Award for Best International Feature Film}} in 1959, three years after the incorporation of the category, and submitted a  second entry in 1963. The award is given annually by the United States Academy of Motion Picture Arts and Sciences to a feature-length motion picture produced outside the United States that contains primarily non-English dialogue. The \"Best Foreign Language Film\" category was not created until 1956; however, between 1947 and 1955, the Academy presented a non-competitive Honorary Award for the best foreign language films released in the United States.\nAs of 2025, Pakistan has submitted thirteen films, but none of them were nominated.\nSubmissions\nThe Academy of Motion Picture Arts and Sciences has invited the film industries of various countries to submit their best film for the Academy Award for Best Foreign Language Film since 1956. The Foreign Language Film Award Committee oversees the process and reviews all the submitted films. Following this, they vote via secret ballot to determine the five nominees for the award. Below is a list of the films that have been submitted by Pakistan for review by the Academy for the award by year and the respective Academy Awards ceremony.\nPakistan's first Oscar submission, The Day Shall Dawn was a co-production between the two halves of what was then a geographically divided Pakistani state (now independent Pakistan and Bangladesh). The movie was filmed in Dhaka, East Pakistan (contemporary Bangladesh) by the East Pakistan Film Development Corporation (EPFDC) by a A.J. Kardar from Lahore (in West Pakistan)  and scripted in the Urdu language, which is native to the West. The film, which won a major award at the Moscow International Film Festival, was about the daily lives of East Pakistani fishermen. Pakistan's second submission, The Veil, is about the disappearance of a veiled young bride on the day she is scheduled to be married off to a rich young man.\nAfter the submission of first two films, there was no any submission for fifty years because of the sudden collapse of Pakistani cinema. The growth of Pakistani cinema began from 1947 to 1958 and went through the golden age of films between 1959 and 1977, where good productions were uplifted by many directors, producers and writers. In 1977 the county's political condition became critical due to the overthrowing of the government of Zulifiqar Ali Bhutto by Zia-ul-Haq who bring Sharization in Pakistan. Since then, the Pakistan film industry went through many obstacles and was unable to overcome the consequences, good productions in industry were stopped and Urdu films were merely reached to the cinema. According to the Federal Bureau of Statistics there were at least 700 cinemas operating in the country but the number had declined to less than 170 by 2005.\nIn 2013 Pakistan submitted their third film after a gap of 50 years. Zinda Bhaag was a Punjabi-language comedy drama film, that encounters the life of three young-men trying to get rid of the life miseries. Pakistan fourth submission, Dukhtar, was a drama-thriller film about a mother and her ten-year-old daughter who abandon their home to save the girl from an arranged marriage to a tribal leader.\nIn 2016, semi-biographical drama film, Mah e Mir was submitted which follows the life of a troubled poet who obsessed himself with 18-century legendary poet Mir Taqi Mir.\n2022's Joyland was shortlisted between the 15 finalist films, but was not nominated.\nIn 2023, Emmy-nominated documentary filmmaker Mohammed Ali Naqvi was appointed by Pakistani Academy Selection Committee as its chairman to choose one film among those released that year to be submitted as Pakistan's Official entry to Oscars. The chosen films, along with their English subtitles, are sent to the Academy, where they are screened for the jury.\n{| class=\"wikitable sortable\" width=\"98%\" style=\"background:#ffffff;\"\n|-\n! Year(Ceremony) !! Film title used in nomination !! Original title !! Language !! Director !! Result\n|-\n! 1959(32nd)\n| The Day Shall Dawn\n| }}\n| rowspan=2 | Urdu\n|\n|\n|-\n! 1963(36th)\n| The Veil\n| }}\n|\n|\n|-\n! 2013(86th)\n| Zinda Bhaag\n| }}\n| Punjabi\n|  and\n|\n|-\n! 2014(87th)\n| Dukhtar\n| }}\n| rowspan=\"2\" | Urdu, Pashto\n|\n|\n|-\n! 2015(88th)\n| Moor\n| }}\n| Jami\n|\n|-\n! 2016(89th)\n| Mah e Mir\n| }}\n| rowspan=\"4\" | Urdu\n| Anjum Shahzad\n|\n|-\n! 2017(90th)\n| Saawan\n| }}\n| Farhan Alam\n|\n|-\n! 2018(91st)\n| Cake\n| }}\n| Asim Abbasi\n|\n|-\n! 2019(92nd)\n| Laal Kabootar\n| }}\n| Kamal Khan\n|\n|-\n! 2020(93rd)\n| Circus of Life\n| }}\n| rowspan=\"2\" | Urdu, Punjabi\n| Sarmad Khoosat\n|\n|-\n! 2022(95th)\n| Joyland\n| }}\n| Saim Sadiq\n|\n|-\n! 2023(96th)\n| colspan=\"2\" | In Flames\n| Urdu\n| Zarrar Kahn\n|\n|-\n! 2024(97th)\n| The Glassworker\n| }}\n| Urdu, English\n| Usman Riaz\n|\n|}\nSee also\n* List of Academy Award winners and nominees for Best International Feature Film\n* List of Academy Award winners and nominees from Pakistan\n* List of countries by number of Academy Awards for Best International Feature Film\n* List of Academy Award-winning foreign language films\n* Cinema of Bangladesh\n* Cinema of Pakistan\nNotes\nReferences\n; General\n*\n;Specific\nExternal links\n* [https://web.archive.org/web/20080707023727/http://www.oscars.org/awardsdatabase/ The Official Academy Awards Database]\n* [https://web.archive.org/web/20080622050250/http://www.oscars.org/impc_site2/index.html The Motion Picture Credits Database]\n* [https://www.imdb.com/Sections/Awards/Academy_Awards_USA/ IMDb Academy Awards Page]\n* [http://socfilms.com/ Shermeen Obaid Chinnoy films, PASC]"
    }
  ]
}