{
  "content": [
    {
      "type": "text",
      "text": "# List of townships in Prince Edward Island\n\nThis is a list of townships, known as \"lots\", for the Canadian province of Prince Edward Island, some of which also act as Prince Edward Island's census subdivisions.\nHistory\nAfter being ceded the island in the Treaty of Paris in 1763, Great Britain immediately sought to bring its own settlers to occupy the vacated Acadian holdings.  In 1764, Great Britain ordered a survey of what was then called St. John's Island which was completed in 1766.  As with other surveys of Britain's North American territories, the survey of St. John's Island was done with the primary goal of encouraging settlement at minimal cost to the treasury.  A feudal system was proposed, along the lines of the European experience with lease-tenure.\nThree counties of roughly 500,000 acres (2,000&nbsp;km2): Prince, Queens, and Kings; were surveyed (Kings County being the smallest), each of which had a \"royalty\" or shire town.  Each county was subdivided into five 100,000 acre (400&nbsp;km2) parishes (for the Church of England) - Kings County having four parishes on account of its smaller size - and each parish was further subdivided into roughly 20,000 acre (80&nbsp;km2) townships or \"lots\".  Each township/lot were to be granted to individuals with certain conditions of settlement (i.e. personally finance and transport settlers to the island; settlers would be obliged to clear land for their farms and pay annual quitrents which, over time would pay off the initial outlay of the owner and eventually turn a profit).  Since more individuals were interested than there were lots available, the government of Great Britain devised a lottery for the sixty four (of sixty seven) lots being granted.\nSt. John's Island was renamed to Prince Edward Island on November 29, 1798.  After a contentious century of conflict between property owners/landlords (many of whom were absentee) and the largely poor peasant leaseholders, the last of the property owners was bought out in the 19th century after financing was made available to the Government of Prince Edward Island expressly for buying out the landlords under Prince Edward Island's Terms of Union for entry into Confederation on July 1, 1873.\nToday, the townships/lots continue to exist on paper and in maps as Prince Edward Island's census subdivisions.\n{| class=\"wikitable\"\n|-\n! colspan=2 | Prince County\n|-\n| North Parish\n|\n* Lot 1\n* Lot 2\n* Lot 3\n|-\n| Egmont Parish\n|\n* Lot 4\n* Lot 5\n* Lot 6\n* Lot 7\n|-\n| Halifax Parish\n|\n* Lot 8\n* Lot 9\n* Lot 10\n* Lot 11\n* Lot 12\n|-\n| Richmond Parish\n|\n* Lot 13\n* Lot 14\n* Lot 15\n* Lot 16\n* Lot 17\n|-\n| St. David's Parish\n|\n* Prince Royalty\n* Lot 18\n* Lot 19\n* Lot 25\n* Lot 26\n* Lot 27\n* Lot 28\n|}\n{| class=\"wikitable\"\n|-\n! colspan=2 | Queens County\n|-\n| Grenville Parish\n|\n* Lot 20\n* Lot 21\n* Lot 22\n* Lot 23\n* Lot 67\n|-\n| Hillsboro Parish\n|\n* Lot 29\n* Lot 30\n* Lot 31\n* Lot 65\n|-\n| Charlotte Parish\n|\n* Queens Royalty\n* Lot 24\n* Lot 32\n* Lot 33\n* Lot 34\n|-\n| Bedford Parish\n|\n* Lot 35\n* Lot 36\n* Lot 37\n* Lot 48\n* Lot 49\n|-\n| St. John's Parish\n|\n* Lot 50\n* Lot 57\n* Lot 58\n* Lot 60\n* Lot 62\n|}\n{| class=\"wikitable\"\n|-\n! colspan=2 | Kings County\n|-\n| St. Patrick's Parish\n|\n* Lot 38\n* Lot 39\n* Lot 40\n* Lot 41\n* Lot 42\n|-\n| East Parish\n|\n* Lot 43\n* Lot 44\n* Lot 45\n* Lot 46\n* Lot 47\n|-\n| St. George's Parish\n|\n* Kings Royalty\n* Lot 51\n* Lot 52\n* Lot 53\n* Lot 54\n* Lot 55\n* Lot 56\n* Lot 66\n|-\n| St. Andrew's Parish\n|\n* Lot 59\n* Lot 61\n* Lot 63\n* Lot 64\n|}\nSources\n*"
    }
  ]
}