{
  "content": [
    {
      "type": "text",
      "text": "# List of awards and honours received by Mahathir Mohamad\n\nThis is a comprehensive list of awards, honours and recognitions received by Mahathir Mohamad, the 4th and 7th Prime Minister of Malaysia. He has been internationally and domestically acknowledged for his contributions to Malaysia's development, leadership, and global influence, earning numerous accolades throughout his career.\nFrom 1981 to 2003, Mahathir served as Malaysia's longest-serving Prime Minister, leading the nation through a period of rapid modernization and economic growth. He later returned to office from 2018 to 2020, becoming the world's oldest serving head of government.\nMahathir is widely acknowledged for his efforts in improving Malaysia's infrastructure, fostering economic growth, and strengthening its presence on the international stage.\nHonours of Malaysia\n*\n**  Grand Commander of the Order of the Defender of the Realm (SMN) – Tun (2003)\n*\n**  Grand Knight of the Order of the Territorial Crown (SUMW) – Datuk Seri Utama (2008)\n*\n**  First Class of the Royal Family Order of Johor (DK I) (1989)\n**  Knight Grand Commander of the Order of the Crown of Johor (SPMJ) – Dato' (1979)\n**  First Class of the Sultan Ibrahim Medal (PIS) (1985)\n*\n**  Member of the Royal Family Order of Kedah (DK) (2003)\n**  Member of the Kedah Supreme Order of Merit (DUK) (1988)\n**  Knight Grand Companion of the Order of Loyalty to the Royal House of Kedah (SSDK) – '''Dato' Seri' (1977)\n*\n**  (2002, revoked in 2018)\n*\n**  Knight Grand Commander of the Premier and Exalted Order of Malacca (DUNM) – Datuk Seri Utama (1982)\n*\n**  Recipient of the Royal Family Order of Negeri Sembilan (DKNS) (1982)\n**  Knight Grand Commander of the Order of Loyalty to Negeri Sembilan (SPNS previously SUNS now) – 'Dato' Seri Utama (1981)\n*\n**  Knight Grand Companion of the Order of Sultan Ahmad Shah of Pahang (SSAP) – Dato' Sri (1977)\n*\n**  Knight Grand Commander of the Order of the Defender of State (DUPN) – Dato' Seri Utama (1981)\n*\n**  Knight Grand Commander of the Order of Cura Si Manja Kini (SPCM) – Dato' Seri (1981)\n*\n**  Member of the Perlis Family Order of the Gallant Prince Syed Putra Jamalullail (DK) (1995)\n*\n**  Grand Commander of the Order of Kinabalu (SPDK) – Datuk Seri Panglima (1981)\n*\n**  Knight Grand Commander of the Most Exalted Order of the Star of Sarawak (SBS) – Pehin Sri (2003)\n** Knight Grand Commander of the Order of the Star of Hornbill Sarawak (DP) – Datuk Patinggi' (1980)\n*\n**  (2003, returned 2017)\n**  (1978, returned 2017)\n*\n**  Knight Grand Companion of the Order of Sultan Mahmud I of Terengganu (SSMT) – 'Dato' Seri (1982)\nForeign honours\nVladimir Putin and then Yang-di Pertuan Agong Syed Sirajuddin in 2003. The day this photograph was taken Putin bestowed the Order of Friendship upon Mahathir.]]\n*\n**  Order of the Liberator General San Martín (1991)\n*\n** Order of the Dragon of Bosnia (1996)\n*\n**  Royal Family Order of Brunei 1st Class (DK (Laila Utama)) - Dato Laila Utama''' (1997)\n*\n**  Grand Cross of the Order of Merit (1991)\n*\n**  Order of José Martí (1997)\n*\n** Commander of the Order of the Great Star of Djibouti (1998)\n*\n**  Star of the Republic of Indonesia (1st Class) (1987)\n*\n**  Grand Cordon of the Order of the Rising Sun (1991)\n**  Grand Cordon of the Order of the Paulownia Flowers (2018)\n*\n**  Collar of the Order of Mubarak the Great (1997)\n*\n** Grand Cordon of the Order of Merit (1997)\n*\n**  Grand Cross of the National Order of Mali (1984)\n*\n**  Grand Cross of the Order of the Aztec Eagle (1991)\n*\n**  Order of Pakistan (NPk) (2019)\n*\n**  Grand Cross of the Order of the Sun of Peru (1995)\n*\n**  Grand Cross of the Order of Merit of the Republic of Poland (2002)\n*\n**  Order of Friendship (2003)\n*\n**  Grand Cross of the Order of Good Hope (1997)\n*\n**  Grand Gwanghwa Medal of the Order of Diplomatic Service Merit (1983)\n*\n**  Grand Cross of the Order of Civil Merit (24 March 1995)\n*\n**  Commander Grand Cross of the Order of the Polar Star (KmstkNO) (1996)\n*\n**  Knight Grand Cordon (Special Class) of the Order of the White Elephant (MPCh) (1981)\n*\n**  Order of the Republic (2019)\n*\n**  Medal of the Oriental Republic of Uruguay (1996)\n*\n**  Order of the Liberator (1990)\nRecognitions and accolades\n*\n** Order of Great Leader (Nishan-e-Quaid-i-Azam) (1984)\n*\n** Honorary citizenship of Tirana (1993)\n*\n** Gold Medal of Toulouse City (1994)\n*\n** Jawaharlal Nehru Award for International Understanding (1996)\n*\n** The Star of Sukarno (2015)\n*\n** King Faisal International Prize for Service to Islam (1997)\n*\n** Key to Beverly Hills (1997)\n*\n** U Thant Peace Award (1999)\n*\n** Doha Forum Award (2019)\nHonorary degrees\n*\n** Honorary Fellow from Academy of Sciences Malaysia (1996)\n** Honorary Ph.D. degree in Management and Engineering from University of Technology, Malaysia (2003)\n** Honorary Litt.D. degree in Social Work from International Islamic University Malaysia (2004)\n** Honorary Ph.D. degree in Islamic Thoughts from University of Malaya (2004)\n** Honorary LL.D. degree from National University of Malaysia (2004)\n** Honorary Ph.D. degree in Engineering and Technology from PETRONAS University of Technology (2004)\n** Honorary Ph.D. degree in Government and Political Science from MARA University of Technology (2004)\n** Honorary Ph.D. degree in Knowledge Science from Multimedia University (2004)\n** Honorary Ph.D. degree in Development Studies from Universiti Malaysia Sarawak (2004)\n** Honorary Ph.D. degree in Technology Management from Universiti Teknologi Tun Hussein Onn (2005)\n** Honorary Ph.D. degree in Engineering Technology from University of Kuala Lumpur (2006)\n** Honorary Ph.D. degree from Universiti Teknikal Malaysia Melaka (2009)\n** Honorary D.Sc. degree from Universiti Malaysia Terengganu (2010)\n** Honorary Ph.D. degree from Universiti Tenaga Nasional (2013)\n** Honorary Ph.D. degree in Global Peace and National Reconciliation from Perdana University (2018)\n** Honorary Doctor of Business Management from Asia School of Business (2019)\n*\n** Honorary Ph.D. degree from Tsinghua University (2004)\n*\n** Honorary Ph.D. degree in Literature from Al-Azhar University (1998)\n*\n** Honorary Ph.D. degree from Meiji University (2001)\n** Honorary Doctor of Laws from Keio University (2004)\n** Honorary Ph.D. degree from Ritsumeikan Asia Pacific University (2018)\n** Honorary Ph.D. degree from Tsukuba University (2018)\n** Honorary Ph.D. degree from International University of Japan (2019)\n** Honorary Doctor of Humane Letters from Doshisha University (2019)\n** Honorary Doctorate from Kyushu University (2025)\n*\n**Honorary Ph.D. degree in Humanities from National University of Mongolia (1997)\n*\n** Honorary Ph.D. degree from Padjadjaran University (2004)\n** Honorary Ph.D. degree in Humanities and Cultural Studies from Sebelas Maret University (2012)\n** Honorary Ph.D. degree in Peace and Islamic Studies from Muhammadiyah University of Yogyakarta (2016)\n*\n**Honorary Ph.D. degree from University of Santo Tomas (2012)\n*\n** Honorary Ph.D. degree from Qatar University (2019)\n*\n** Honorary Doctor of Laws from the National University of Singapore (2018)\n*\n** Honorary Ph.D. degree in Social Leadership, Business and Politics from Rangsit University (2018)\n*\n** Honorary Ph.D. degree in Political Science and Public Administration from Yildirim Beyazit University (2019)\nOthers\n*In August 1983, Mahathir has been named Bapa Malaysia Moden (Father of Modern Malaysia) by the Kedah Menteri Besar Syed Nahar Shahabuddun at the opening ceremony of the Tunku Building.\n*In December 1983, Mahathir was conferred the first honorary fellowship of the Malaysian Institute of Directors. Tan Siew Sin, the president of the institute at the time, stated that the institute recognized Mahathir's meritorious contributions, not only as the nation's prime minister but also through his imaginative innovation of various concepts.\n*In 1994, The World Health Organization (WHO) presented Mahathir with an award for his \"vast contributions towards primary health care in Malaysia\".\n*On 10 January 1996, Mahathir being conferred the Honorary Fellowship of the International College of Surgeons (ICS) at the 11th Asian Pacific Federation Congress of the college in Kuala Lumpur. Presenting the sash to him is ICS president Professor Earl Owens and co-ordinating chairman of the congress, Dr P. Boopalan.\n*In June 1996, a regional weekly magazine according to a survey conducted, Mahathir has been ranked as Asia's fourth most powerful political leader.\n* In May 1997, Asiaweek has moved Mahathir up to number two in its list of 50 most powerful individuals in Asia.\n* On 24 October 1997, Mahathir and Siti Hasmah Mohamad Ali were made Fellows of the Royal College of Physicians of Edinburgh.\n* On 17 March 1998, Mahathir was conferred the prestigious international IFAWPCA-Atsumi Award in recognition of his contribution to the construction industry.\n* On 20 April 1998, Mahathir received the Honorary Fellowship Award from the Chartered Institute of Marketing of the United Kingdom in recognition of his contribution to market Malaysia world-wide.\n* On 26 November 1998, Mahathir was conferred the Asian-Oceanian Computing Industry Organisation IT Award 1998 for his contribution to the development of information technology and IT-related industries.\n* Mahathir is among the nominations that have been received for the 1999 Timesport-Sports Toto MAN OF THE YEAR award.\n* On 31 December 1999, Mahathir was awarded the Man of the Millennium Award by non-governmental organisation, (NGO) Rotary International District 3300. Rotary International chose Mahathir for the award because of his many contributions to the country, particularly in restoring Malaysia's economy, which had suffered from its worst crisis in 1998.\n* On 2 September 2000, Mahathir received a Lifetime Achievement Award from an American Islamic finance house near Chicago in recognition of his leadership.\n* On 21 September 2000, Mahathir was awarded NASYO's Distinguished International Leadership Award for his contributions to the cause of the Non-Aligned Movement.\n* On 10 September 2001, Mahathir was conferred the \"Asean Achievement Millennium Award\" by the Asean Business Forum (ABF) at a special dinner in Singapore for turning Malaysia into an exemplary and dynamic nation.\n* On 18 September 2003, Mahathir and his wife, Siti Hasmah Mohamad Ali, received the \"Ambassador for Peace\" award for their contribution to promoting peace and unity.\n* On 10 October 2003, the International Cycling Union (UCI) approved the grant of the UCI Merit, the highest honour for contributions towards the sport, to Mahathir.\n* On 21 December 2003, Prime Minister Abdullah Ahmad Badawi declared Mahathir as Bapa Pemodenan Malaysia (Father of Malaysia's Modernisation).\n* On 17 April 2004, Mahathir was conferred the Institute of Engineers' Distinguished Honorary Fellow for his contribution to the engineering profession and the nation.\n* On 17 August 2004, the Academy of Sciences Malaysia launched the Mahathir Science Award in honor of Mahathir for his contributions to the country's development in science and technology.\n* On 24 September 2004, Mahathir was received Fiabci award by the real estate industry for his contributions in modernising the country, including the building of first-class infrastructure.\n* From 2005 to 2016, Mahathir had once topped the Google chart for the sixth time.\n* Mahathir was named the Newsmaker of the Year by Malaysiakini in both 2005 and 2006. In 2015, Malaysiakini readers have voted him, again, as Newsmaker. In 2016, at 91 years old, he was the runner-up for the title of Newsmaker in Malaysiakini, continuing to hog the headlines and embarking on a campaign to oust Prime Minister Najib Razak from power. In 2017, once again, the newsmaker is Mahathir.\n* On 11 September 2005, Mahathir was received the Malaysia Tatler Lifetime Achievement Award in recognition of his unwavering dedication to the country.\n* On 1 December 2005, Mahathir arrived in Libya to receive the Gaddafi International Prize for Human Rights, awarded in appreciation for his deeds and contributions to the Islamic world. After the ceremony, he also held a meeting with the Libyan leader, Muammar Gaddafi.\n* On 20 May 2006, Mahathir was conferred the Great Mind Award by Malaysian Invention & Design Society (Minds) in recognition of his leadership abilities.\n* On 19 November 2006, Mahathir is the first Malaysian to receive the Mother Teresa Memorial International Award for Social Justice.\n* On 21 June 2011, Mahathir was awarded the inaugural Lifetime Achievement Award at the Kuala Lumpur Mayor's Tourism Award 2011.\n* In November 2011, Mahathir was bestowed with the ICT Lifetime Achievement Award from Pikom, the National ICT Association of Malaysia, in recognition of his immense contribution to the ICT industry in the country. He was credited for much of the success of Malaysia's ICT industry.\n* On 28 September 2012, Mahathir received the 2012 Rafik Hariri United Nations (UN) – Habitat Memorial Award at a ceremony held at the New York Public Library in New York. He is the second recipient after Turkey's prime minister Recep Tayyip Erdoğan.\n* On 9 May 2013, Mahathir has been conferred the \"Master Foreign Going\" award by Malaysia Harbour Pilots Association, which carries the title Captain.\n* In November 2014, Mahathir was presented with the Dai-Soke award at the inaugural Martial Arts Warrior assembly.\n* On 27 September 2015, Mahathir was awarded \"The Star of Soekarno\" by the Soekarno Education Foundation (YPS) for his contribution in championing human rights.\n* Guinness World Records: Mahathir was recognised as the world's oldest current prime minister in 2018, at the age of 92 years 141 days.\n* On 7 November 2018, Mahathir has been conferred the Nation-Building Lifetime Achievement Award (Public Sector) by Thailand's Nation-Building Institute (NBI).\n* On 13 November 2018, Mahathir was conferred the Distinguished Honorary Patron Award by the Asean Federation of Engineering Organisations (AFEO). In the award citation, the group praised Mahathir's \"visionary and scientific leadership,\" citing the numerous mega infrastructure projects undertaken in Malaysia during his previous term.\n* Time magazine named Mahathir as one of the 100 most influential people in the world in 2019.\n* On 12 February 2019, Mahathir was conferred the PETRONAS SIC Motorsports Association of Malaysia (MAM) Awards 2018 Lifetime Achievement Award for his significant contributions and undying support towards Malaysian motorsports industry. He is the first recipient of the Lifetime Achievement Award.\n* On 29 April 2019, Mahathir received the “Visionary Leader and Nation Builder” Award at the 20th Asian Association of Management Organisations (AAMO) triennial conference and dinner.\n*In May 2019, Fortune magazine has ranked Mahathir the world's 47th greatest leader.\n* On 9 August 2019, Mahathir received the Instafamous Inspiration Award from hurr.tv, Malaysia's contemporary digital lifestyle hub. The award was in appreciation of his leadership, hard work, dedication and contribution to the Malaysian people.\n* On 2 September 2019, Mahathir was honored with the Muslim Exemplary Leadership award by the Cambodian Muslim Community in recognition of Malaysia's role in assisting the Muslims in the country.\n* On 23 September 2019, Mahathir was the first person to receive the Universiti Sains Malaysia (USM) Special Chancellor Sustainability Award at the university's Commemorative Convocation ceremony in conjunction with its 50th anniversary in Penang.\n* On 30 April 2021, Mahathir was honored with the Sinan Wren Foundation's Lifetime Achievement Award 2021 during a virtual ceremony. This award recognizes exceptional individuals who have shown exemplary Servant Leadership, encompassing both personal and community excellence. It is presented biennially.\n* On 26 May 2023, Mahathir has been conferred the Lifetime Award under the IBR Global Maritime and Aerospace Awards 2023.\n* On 15 September 2023, Mahathir has received the Global Islamic Leader Award at the World Islamic Tourism Award (Wita) 2023.\nPlaces named after him\nSeveral places were named after him, including:\n* Kolej Tun Dr Mahathir, a residential college in Universiti Teknologi MARA (Machang Branch), Machang, Kelantan.\n* Kolej Kediaman Tun Dr. Mahathir (KKD), a residential college in Universiti Malaysia Perlis, Kuala Perlis, Perlis.\n* Institut Pemikiran Tun Dr Mahathir Mohamad, Universiti Utara Malaysia.\n* Jalan chedet.cc, his residence in Seri Kembangan, Selangor.\n* Rumah Kelahiran Tun Dr Mahathir, a museum birthplace of himself in Alor Setar, Kedah.\n* Jalan Mahathir Mohamad in Kalitimbang, Cibeber, Cilegon City, Banten, Indonesia.\n* Mahathir Mohamad Road (شارع مهاتير محمد) in Mukallaf, Hadhramaut, Yemen.\n* Mahathir house, a house system named after him in Sekolah Menengah Sains Tengku Muhammad Faris Petra.\nSee also\n* List of awards and honours received by Siti Hasmah Mohamad Ali\nReferences"
    }
  ]
}