{
  "content": [
    {
      "type": "text",
      "text": "# List of shipwrecks of the United Kingdom\n\nin a storm on the coast of Anglesey in 1859. About 450 lives were lost.]]\nThis is a list of shipwrecks located in the United Kingdom.\nEngland\nNorthern Ireland\n{| class=wikitable | style = \"width:100%\"\n! style=\"width:15%\" | Ship\n! style=\"width:18%\" | Flag\n! style=\"width:15%\" | Sunk date\n! style=\"width:37%\" | Notes\n! style=\"width:15%\" | Coordinates\n|-\n|\n|\n|2 October 1917\n|Torpedoed by  in Rathlin Sound.\n|\n|-\n|Girona\n|\n|26 October 1588\n|Foundered and sank off Lacada Point, County Antrim.\n|\n|-\n|Lagan\n|\n|March 1946\n|Sank in collision off Belfast Lough.\n|\n|-\n|Normanby Hall\n|\n|8 October 1965\n|Foundered and sunk off Kilroot.\n|\n|-\n|\n|\n|31 January 1953\n|Foundered in heavy seas off the Copeland Islands.\n|\n|-\n|State of Louisiana\n|\n|28 December 1878\n|A passenger liner that ran aground on Hunter Rock.\n|\n|-\n|Tiberia\n|\n|26 February 1918\n|A merchant ship torpedoed and sunk by  off Black Head near Larne, County Antrim.\n|\n|-\n|Tullaghmurray Lass\n|\n|February 2002\n|A Kilkeel fishing boat that sank after a gas explosion.\n|\n|}\nScotland\n{| class=wikitable | style = \"width:100%\"\n! style=\"width:15%\" | Ship\n! style=\"width:18%\" | Flag\n! style=\"width:15%\" | Sunk date\n! style=\"width:37%\" | Notes\n! style=\"width:15%\" | Coordinates\n|-\n|\n|\n|9 April 1956\n|Ran aground and was wrecked in the River Clyde.\n|\n|-\n|\n|\n|28 September 1853\n|Sank off Vatersay, Outer Hebrides in a gale, with the loss of 350 lives.\n|\n|-\n|\n|\n|4 February 1918\n|An ocean liner that was torpedoed by  off the coast of Ireland.\n|\n|-\n|\n|\n|7 May 1945\n|A cargo ship that was sunk by  south of the Isle of May.\n|\n|-\n|\n|\n|30 March 1930\n|An Aberdeen trawler that wrecked on the Ve Skerries, Shetland, killing the ~9 crew.\n|\n|-\n|\n|\n|23 December 1940\n|Dutch cargo ship, sunk by two German Heinkel He 111 bomber aircraft in Ardmucknish Bay off Oban.\n|\n|-\n|\n|\n|21 June 1919\n|A  that was among the 74 ships scuttled in Scapa Flow by Admiral Reuter.\n|\n|-\n|HMS Caribbean\n|\n|27 November 1915\n|Sank  off Cape Wrath due to bad weather.\n|\n|-\n|\n|\n|2 February 2015\n|A cargo ship that foundered  east of Muckle Skerry.\n|\n|-\n|\n|\n|4 August 2019\n|A Spanish-owned, UK-registered longliner that wrecked on the Ve Skerries, Shetland.\n|\n|-\n|\n|\n|21 June 1919\n|A  that was among the 74 ships scuttled in Scapa Flow by Admiral Reuter.\n|\n|-\n|\n|\n|26 February 1982\n|British container ship ran aground at Killantringan lighthouse, Wigtownshire.\n|\n|-\n|\n|\n|9 October 1690\n|A frigate wrecked in the Sound of Mull.\n|\n|-\n|\n|\n|27 March 1943\n|Aircraft carrier sunk by a major internal explosion. Lies in the Clyde estuary.\n|\n|-\n|\n|\n|12 June 1915\n|Intercepted and sunk by German submarine ,  off Montrose.\n|\n|-\n|\n|\n|21 June 1919\n|A  that was among the 74 ships scuttled in Scapa Flow by Admiral Reuter.\n|\n|-\n|\n|\n|27 September 1588\n|A ship of the Spanish Armada that was wrecked on Fair Isle.\n|\n|-\n|\n|\n|9 December 1977\n|An Aberdeen trawler that wrecked on the Ve Skerries, Shetland.\n|\n|-\n|\n|\n|22 June 1940\n|A cargo ship torpedoed by  off Barra Head.\n|\n|-\n|\n|\n|19 December 2007\n|A tug that sank in foggy conditions in the River Clyde at Clydebank.\n|\n|-\n|\n|\n|19 February 1915\n|An  wrecked at Start Point.\n|\n|-\n|\n|\n|16 August 1940\n|A cargo ship that was torpedoed by  off Lewis, Outer Hebrides.\n|\n|-\n|\n|\n|20 March 1944\n|Formerly the German U-boat . Captured and taken into Royal Navy service in 1942, she ran aground and was wrecked on Islay in 1944.\n|\n|-\n|\n|\n|5 June 1916\n|British armoured cruiser that struck a naval mine off Orkney.\n|\n|-\n|\n|\n|18 December 1954\n|A Swedish steamboat that struck rocks in the Sound of Mull.\n|\n|-\n|\n|\n|16 July 1940\n|An  that collided with  off Duncansby Head.\n|\n|-\n|\n|\n|28 March 1918\n|A steamship that was torpedoed by  south of Burrow Head.\n|\n|-\n|\n|\n|1 January 1919\n|An Admiralty yacht sank in The Minch outside Stornoway harbour with the loss of 205 men returning from World War I.\n|\n|-\n|\n|\n|5 September 1952\n|Struck a mine on 5 July 1942 in the Denmark Strait. The forepart was salved but broke tow on 1 September 1952 and was later wrecked at Torrisdale Bay, Sutherland on 5 September.\n|\n|-\n|\n|\n|21 June 1919\n|A  that was among the 74 ships scuttled in Scapa Flow by Admiral Reuter.\n|\n|-\n|\n|\n|6 January 1916\n|A  that struck a naval mine laid by  off Cape Wrath.\n|\n|-\n|\n|\n|21 June 1919\n|A  that was among the 74 ships scuttled in Scapa Flow by Admiral Reuter.\n|\n|-\n|\n|\n|21 June 1919\n|A  that was among the 74 ships scuttled in Scapa Flow by Admiral Reuter.\n|\n|-\n|\n|\n|8 March 1943\n|A straggler from Convoy SC 121 that was hit by a torpedo from  and sank west of the Hebrides. The master and 25 crewmembers were lost.\n|\n|-\n|\n|\n|21 June 1919\n|A  that was among the 74 ships scuttled in Scapa Flow by Admiral Reuter.\n|\n|-\n|\n|\n|June 1850\n|A paddle steamer that sank off Wigtownshire.\n|\n|-\n|\n|\n|27 November 1940\n|British minelayer ran aground in the Kyle of Lochalsh, caught fire while being unloaded, destroyed by explosion.\n|\n|-\n|\n|\n|8 August 1915\n|An armed boarding steamer that was sunk by  northeast of Fair Isle.\n|\n|-\n|\n|\n|13 January 1915\n|A minesweeper that sank following a collision with HMS Imperieuse in Scapa Flow, near Longhope.\n|\n|-\n|\n|\n|25 January 1935\n|Sunk in the Sound of Mull in a storm.\n|\n|-\n|\n|\n|14 October 1939\n|A  torpedoed in Scapa Flow by , with 833 deaths.\n|\n|-\n|\n|\n|5 November 1588\n|A ship of the Spanish Armada that was blown up at Tobermory.\n|\n|-\n|\n|\n|13 March 1945\n|An S-class submarine scuttled off the Isle of Arran.\n|\n|-\n|\n|\n|8 November 1950\n|A cargo ship that sank off the Bo Vich Chuan Rock in the Outer Hebrides.\n|\n|-\n|\n|\n|10 April 1930\n|A cruise ship that ran aground on the island of Mousa.\n|\n|-\n|\n|\n|13 September 1653\n|A warship that sunk in a storm while anchored off Duart Castle.\n|\n|-\n|\n|\n|16 October 1889\n|A steamship that ran aground on a reef in the Sound of Mull.\n|\n|-\n|\n|\n|5 February 1918\n|An ocean liner that was torpedoed by  off Islay, Inner Hebrides.\n|\n|-\n|\n|\n|12 February 1940\n|A Type VIIA U-boat that was sunk by  in the Firth of Clyde.\n|\n|-\n|\n|\n|6 December 1944\n|A Type VIIC/41 U-boat that was sunk by a British Short Sunderland flying boat of No. 201 Squadron RAF  west of Yesnaby, Orkney Islands.\n|\n|-\n|\n|\n|14 March 1945\n|German U-Boat sunk by depth charges from the South African frigate . She was discovered in the Firth of Forth in 2007.\n|\n|-\n|\n|\n|27 March 1945\n|A Type VIIC U-boat that was sunk in the Sea of the Hebrides by ,  and .\n|\n|-\n|\n|\n|14 April 1945\n|A Type VIIC U-boat that sprung a leak and sank off Cruden Bay, Aberdeenshire.\n|\n|-\n|\n|\n|28 October 1918\n|A Type UB III U-boat that was sunk by a mine while attempting to enter the Scapa Flow.\n|\n|-\n|Unknown shipwreck\n|Unknown\n|Unknown\n|Found in 2000.\n|\n|-\n|\n|\n|5 July 1894\n|A cutter that collided with Satanita on the Firth of Clyde.\n|\n|-\n|\n|\n|24 February 1943\n|A U-class submarine sunk off Lochranza four days after commissioning.\n|\n|-\n|\n|\n|9 July 1917\n|A  that exploded and sank at Scapa Flow, with about 804 deaths.\n|\n|-\n|\n|\n|1925\n|A Russian protected cruiser that ran aground and sank in the Firth of Clyde.\n|\n|-\n|\n|\n|8 July 1913\n|A training ship of the Royal Technical College, Glasgow, ran aground and wrecked at Colonsay of her first voyage as a training ship.\n|\n|}\nWales\n{| class=wikitable | style = \"width:100%\"\n! style=\"width:15%\" | Ship\n! style=\"width:18%\" | Flag\n! style=\"width:15%\" | Sunk date\n! style=\"width:37%\" | Notes\n! style=\"width:15%\" | Coordinates\n|-\n|Amazonese''\n|Unknown\n|15 April 1881\n|A cargo steamship that ran aground at St. David's Head.\n|\n|-\n|\n|\n|24 November 1940\n|A 6,100-ton steamer,  in length, with a cargo of 4,700 tons of government stores, allegedly including Harley Davidson motorbikes. Sunk by magnetic parachute mine in Milford Haven, Pembrokeshire.\n|\n|-\n|\n|\n|13 November 1915\n|A Canadian barque that ran aground in a gale off Strumble Head.\n|\n|-\n|\n|\n|12 February 1943\n|A cargo ship that ran aground off The Skerries, Anglesey.\n|\n|-\n|\n|\n|14 April 1953\n|A training ship wrecked near Menai Bridge.\n|\n|-\n|\n|\n|21 November 1940\n|A 6,400-ton steamer,  in length, with a cargo of 1,300 tons of tinplate. Sunk by magnetic parachute mine approximately  west of Dale in Milford Haven, Pembrokeshire.\n|\n|-\n|\n|\n|2 January 1825\n|A protected wrecksite; a three-masted square rigger with a composite hull, forerunner of the Ocean liners, lost in Cardigan Bay.\n|\n|-\n|\n|\n|5 April 1942\n|A coastal trading vessel that struck a mine off Pembrokeshire.\n|\n|-\n|\n|\n|25 March 1941\n|A cable layer that was attacked by a Heinkel He 111 off Milford Haven, Pembrokeshire, and sank the following day off St Anne's Head. It is now a protected wreck.\n|\n|-\n|Herefordshire\n|\n|15 March 1934\n|Former Bibby Line liner, 7,000 tons, on passage to breakers, lost tow in a storm and ran aground on Cardigan Island; no lives lost, but rats destroyed puffin and Manx shearwater colonies; lies in 12m of water.\n|\n|-\n|\n|\n|14 January 1865\n|A steamship that sank in a storm off the Great Orme.\n|\n|-\n|Loch Shiel(aka Whiskey Wreck)\n|\n|30 January 1877\n|A 1,218-ton rigged sailing ship,  in length, with a cargo of 7,000 cases of whiskey, beer & general goods. Ran aground at Thorne Island in Milford Haven, Pembrokeshire. Now at a depth of , is very broken up, but the brick ballast is still visible.\n|\n|-\n|Lucy\n|\n|14 February 1967\n|A  coaster, sank off Skomer Island, Pembrokeshire, while carrying a cargo of calcium carbide from Uddevalla, Sweden to Barry.\n|\n|-\n|\n|\n|25 March 1675\n|A protected wrecksite; the first British Royal Yacht, hit rocks in fog off Anglesey.\n|\n|-\n|Ocean Monarch\n|\n|25 August 1848\n|A barque that caught fire and sank northeast of Llandudno.\n|\n|-\n|\n|\n|January 1856\n|A Collins Line transatlantic steamer that sank (possibly in the Irish Sea) from unknown causes. Wreck found in 1986.\n|\n|-\n|\n|\n|30 October 1925\n|A four masted windjammer that was wrecked on the Cefn Sidan sands.\n|\n|-\n|Resurgam II\n|\n|25 February 1880\n|A protected wrecksite near Rhyl.\n|\n|-\n|\n|\n|18 August 1831\n|A paddle steamer that ran aground and broke up at the eastern end of the Menai Strait in 1831.\n|\n|-\n|Royal Charter\n|\n|26 October 1859\n|A steam clipper driven onto rocks near Moelfre, Anglesey.\n|\n|-\n|\n|\n|23 April 1947\n|A steamship wrecked off Sker Point.\n|\n|-\n|\n|\n|27 November 2011\n|Sank after hitting a large wave following gale force 8 conditions  off the coast of Anglesey.\n|\n|-\n|\n|\n|17 November 1917\n|A Type U 57 U-boat that was sunk by  in the action of 17 November 1917.\n|\n|-\n|\n|\n|7 March 1945\n|A Type VIIC/41 U-boat that was sunk by depth charges from the Canadian frigates ,  and  in St. George's Channel.\n|\n|-\n|\n|\n|15 July 1945\n|A German cargo ship that was captured by the Allies and ran aground on Grassholm.\n|\n|-\n|\n|\n|29 October 1974\n|A W-class destroyer that was sunk as a target in Cardigan Bay.\n|\n|}\nReferences\nExternal links"
    }
  ]
}