{
  "content": [
    {
      "type": "text",
      "text": "# List of Star Wars: The Clone Wars episodes\n\nStar Wars: The Clone Wars is an American 3D CGI animated television series created by Lucasfilm Animation, Lucasfilm Animation Singapore, and CGCG Inc. The debut film was released in theaters on August 15, 2008; it served as the introduction of the series. The series made its debut on the American Cartoon Network on October 3, 2008. It is set in the fictional Star Wars galaxy during the three-year interim between Episode II – Attack of the Clones and Episode III – Revenge of the Sith (the same time period as the previous 2003 Clone Wars series). Each episode has a running time of 22&nbsp;minutes, filling a half-hour time slot.\nIn March 2013, following the 2012 acquisition of Lucasfilm by Disney, the series was cancelled. The unreleased episodes that had already been produced were referred to at the time as \"bonus content\". The German television network Super RTL began to air these episodes as a sixth season, which consisted of 13 episodes in February 2014. Season 6, along with the other seasons and the feature film, were made available on Netflix on March 7 the same year. The series returned with 12 new episodes on Disney+, serving as the seventh and final season. It premiered February 21, 2020.\nSeries overview\n| released0  =\n| network0   = Theatrical release\n| color1     = #B11010\n| link1      = List of Star Wars: The Clone Wars episodes#Season 1 (2008–09)\n| auxA1      = The Clone Wars\n| episodes1  = 22\n| start1     =\n| end1       =\n| network1   = Cartoon Network\n| color2     = #C0BDBD\n| link2      = List of Star Wars: The Clone Wars episodes#Season 2: Rise of the Bounty Hunters (2009–10)\n| auxA2      = Rise of the Bounty Hunters\n| episodes2  = 22\n| start2     =\n| end2       =\n| color3     = #07078F\n| link3      = List of Star Wars: The Clone Wars episodes#Season 3: Secrets Revealed (2010–11)\n| auxA3      = Secrets Revealed\n| episodes3  = 22\n| start3     =\n| end3       =\n| color4     = #1F1E1E\n| link4      = List of Star Wars: The Clone Wars episodes#Season 4: Battle Lines (2011–12)\n| auxA4      = Battle Lines\n| episodes4  = 22\n| start4     =\n| end4       =\n| color5     = #FF5F5F\n| link5      = List of Star Wars: The Clone Wars episodes#Season 5 (2012–13)\n| auxA5      = Who Will Fall\n| episodes5  = 20\n| start5     =\n| end5       =\n| color6     = #E0BD11\n| link6      = List of Star Wars: The Clone Wars episodes#Season 6: The Lost Missions (2014)\n| auxA6      = The Lost Missions\n| episodes6  = 13\n| released6  =\n| network6   = Netflix\n| color7     = #8F422C\n| link7      = List of Star Wars: The Clone Wars episodes#Season 7: The Final Season (2020)\n| auxA7      = The Final Season\n| episodes7  = 12\n| start7     =\n| end7       =\n| network7   = Disney+\n}}\nNote: episodes 37 to 43, 65, 66, and 109 to 119 aired earlier in some countries than their original U.S. release.\nEpisodes\nFilm (2008)\nAs a lead-in to the TV series of the same name, the film was released theatrically on August 15, 2008, and was distributed by Warner Bros. Pictures. Though critical reception was negative, the film was a box-office success and grossed $68.3 million worldwide against an $8.5 million budget.\n| ProdCode        = 1.01 / 1.03 / 1.04 / 1.18\n| ShortSummary    = As more star systems get swept into the Clone Wars, the valiant Jedi Knights struggle to maintain order. Anakin Skywalker and his Padawan learner Ahsoka Tano embark on a mission that brings them face-to-face with Jabba the Hutt. Plotting against them is Sith Master Count Dooku and his agent, Asajj Ventress - who would ensure that the Jedi fail. Meanwhile, Yoda and Obi-Wan Kenobi lead the clone army against the forces of the dark side.\n| LineColor       = 233237\n}}\n}}\nSeason 1 (2008–09)\nThe premiere episodes of Star Wars: The Clone Wars aired on October 3, 2008, and set a new record with Cartoon Network as their most-watched series premiere, attracting  total viewers. The season finale, \"Hostage Crisis\", was broadcast on March 20, 2009, and the original broadcast received  viewers. Season 1 depicted the attempts of the Republic and the Separatists to gain the allegiance of many planets and moons.\n| ProdCode        = 1.08\n| Viewers         = 3.99\n| ShortSummary    = Jedi Master Yoda must face off against Count Dooku's dreaded assassin Asajj Ventress and her massive droid army to prove the Jedi are strong enough to protect a strategic planet and forge a treaty for the Republic. Ventress fails against Yoda, so Dooku tells Ventress to kill the king of the planet, who wants to sign the treaty with the Republic. Yoda protects the king from Ventress, who then flees.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.07\n| Viewers         = 3.92\n| ShortSummary    = An attack by a devastating new Separatist weapon—the powerful starship Malevolence—leaves Jedi Master Plo Koon and his clone troopers struggling to survive until Anakin and Ahsoka can find them.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.09\n| Viewers         = 2.8\n| ShortSummary    = With the help of his Padawan, Ahsoka, and Jedi Master Plo Koon, Anakin uses new long-range Y-wing bombers to lead a bold strike on General Grievous's warship, the Malevolence, and its destructive weapon.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.11\n| Viewers         =\n| ShortSummary    = Padmé Amidala and C-3PO are taken hostage by General Grievous, leaving Anakin and Obi-Wan to save the senator and complete the destruction of the Malevolence.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.14\n| Viewers         =\n| ShortSummary    = Alone on a distant outpost, clone officers Rex and Cody must inspire their rookie unit to believe in themselves to stave off a droid commando invasion.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.02\n| Viewers         =\n| ShortSummary    = R2-D2 is lost during a fierce space battle—and Anakin must find him before the Separatists discover the Jedi military secrets locked in his memory banks.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.06\n| Viewers         =\n| ShortSummary    = Anakin, Ahsoka, and replacement droid R3-S6 embark on a dual rescue/sabotage mission when they discover that R2-D2 is being held at General Grievous's secret enemy listening post, Skytop Station.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.05\n| Viewers         = 2.77\n| ShortSummary    = On a diplomatic mission to the planet Rodia, Padmé discovers that her old friend and fellow Republic senator Onaconda Farr has allied his planet with the Separatists. In exchange for food and resources for his people, Onaconda captures Padmé and promises to deliver her to Nute Gunray. Sensing that Padmé is in trouble, Jar Jar Binks disguises himself as a Jedi and, with the help of , courageously fights to rescue his friend and fellow senator.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.10\n| Viewers         = 1.95\n| ShortSummary    = Ahsoka and Jedi Master Luminara Unduli escort the captured notorious Separatist leader Nute Gunray to Coruscant so he can stand trial for his crimes. However, they are unaware that Count Dooku has sent his assassin, Asajj Ventress, to free their captive. With the help of Senate Commandos, the Jedi have to thwart Ventress's efforts to free their prisoner, despite the traitorous plans of Senate Guard Captain Argyus.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.12\n| Viewers         = 2.14\n| ShortSummary    = Jedi Master Kit Fisto and his former Padawan, the Mon Calamari Jedi Nahdar Vebb, track escaped prisoner Nute Gunray to a remote world. Following Nute into a mysterious den filled with strange creatures, weapons, and war-time artifacts, the Jedi discover that it is the trap-laden lair of General Grievous. Learning that Count Dooku has led the Jedi there in order to punish Grievous for his recent failures, the general is determined to prove his abilities and destroy the Jedi. Kit and Nahdar, along with a contingent of clones, must now fight their way past Grievous and his caretaker droid  to avoid being caught in Grievous's evil clutches forever.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.16\n| Viewers         =\n| ShortSummary    = During their own attempt to kidnap Dooku, Anakin and Obi-Wan discover that the Sith lord has already been captured by pirates. Hondo Ohnaka and his gang of pirates hold Dooku captive in their den on Florrum, and hold him for ransom. It is up to Anakin and Obi-Wan to see if the offer is too good to be true.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.20\n| Viewers         = 2.31\n| ShortSummary    = Anakin and Obi-Wan have been duped and are being held for ransom, along with Count Dooku, by the pirate chief Hondo Ohnaka and his second-in-command, Turk Falso. While Anakin, Obi-Wan, and Dooku unsuccessfully attempt to escape, the Republic sends the ransom via a special envoy, including Representative Jar Jar Binks. When Falso tries to steal the ransom from his boss by shooting down the shuttle, the only survivors are a squad of clones and Jar Jar, who, as the most senior officer alive, has to take charge of the mission. It becomes a race against time as Jar Jar rushes to deliver the ransom to take custody of Dooku and save the Jedi.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.22\n| Viewers         = 2.35\n| ShortSummary    = Anakin and Ahsoka arrive at a pitched sky battle to help besieged Jedi General Aayla Secura. Anakin is gravely injured in the fight. Aayla and Ahsoka, along with the now-wounded Anakin, Rex, and the surviving clones, crash land on the uncharted grass-covered planet Maridun. Forced to leave Anakin behind in order to save him, Aayla teaches Ahsoka why the Jedi have no personal attachments. They make their way to a Lurmen village. Their ruler, Tee Watt Kaa, explains that they are pacifists in this war and not aligned with either side. Hesitant to have anything to do with the Jedi, Kaa agrees to help save Anakin's life.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.24\n| Viewers         = 2.17\n| ShortSummary    = Tee Watt Kaa refuses to shelter the Jedi from arriving Separatist forces, fearing that such an action would unnecessarily bring his neutral people into the war. Ahsoka, Aayla, the wounded Anakin, and the rest of the clones respect their wishes as they do not want to jeopardize the village with their presence, so they have to retreat into the wilds of the planet. Separatist Neimoidian General Lok Durd arrives to test a devastating weapon, which they plan to use on the Lurmen. Ultimately, the villagers have to decide whether they will surrender to the Separatists or fight with the Jedi to defend their village.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.25\n| Viewers         = 2.62\n| ShortSummary    = Arriving on the desolate ice world of Orto Plutonia, Anakin and Obi-Wan investigate the disappearance of a clone security force stationed on a remote outpost. The Jedi, accompanied by Senator Riyo Chuchi and Chairman Cho of the nearby moon of Pantora, soon discover their clone troopers were attacked by a tribe of furry natives known as the Talz. Fierce beast-riding warriors, the Talz are very territorial and only want to be left alone. The Jedi manage to negotiate peace with the Talz chieftain, Thi-Sen, when greedy Chairman Cho breaks it by insisting that the planet and the Talz are under his power. The resulting conflict escalates into war between the clones and the Talz, with the Jedi caught in the middle.\n| LineColor       = B11010\n}}\n| ProdCode        = 2.01\n| Viewers         = 2.51\n| ShortSummary    = Anakin and Obi-Wan lead Republic forces in an attempt to defeat the droid armies and free the planet of Christophsis from the Separatist siege. When the Republic is ambushed and forced to retreat, it becomes clear that someone in their midst has set them up. The Jedi believe this infiltration is a Sith-backed operation and go behind enemy lines to investigate. Meanwhile, Captain Rex and Commander Cody set out to uncover the traitor amongst them.\n----\nDave Filoni, the supervising director of the series, refers to the betrayal of the Republic by a clone trooper as them having \"gone Jango\", saying that \"they have a little too much of Jango Fett in them\". The episode went through numerous changes during production. Slick was originally planned to have red hair in the episode. However, when rendered, the dark hair model that was standard for clone troopers was used instead, helping him blend in with the rest of the clones rather than stick out as a potential suspect. The script of the episode had the opening sequence feature the clone troopers preparing a combat droid known as \"The Beast\", which resembled the dome-shaped mining droids from the original Star Wars film and a head of the Dalek from the British program Doctor Who. The sequence was cut from the episode, as it was decided to keep the 2 opposing sides fixed as \"clones versus droids\", and the scene involving \"The Beast\", whose function was not revealed, unnecessarily complicated the storyline. Most of the main voice actors in the series appeared in the episode. The episode's opening was narrated by Tom Kane, while Matt Lanter voices Anakin Skywalker and James Arnold Taylor voices Obi-Wan Kenobi and the tactical droid. Nika Futterman returns as Asajj Ventress in the episode. Dee Bradley Baker voices the clone troopers in the episode, including Captain Rex and Commander Cody. Matthew Wood provided the voices of the battle droids. \"The Hidden Enemy\" takes place on Christophsis, the first episode in the series to do so. The planet was previously featured in the 2008 Star Wars: The Clone Wars film. The episode is placed second chronologically in the series, after season 2, episode 16, \"Cat and Mouse\", and before the Star Wars: The Clone Wars film. The episode was meant to serve as a prequel to the film. Eric Goldman from IGN called it \"another solid episode\", praising its opening battle sequence, Obi-Wan Kenobi's dialogue with Asajj Ventress, and Captain Rex and Commander Cody's strategy to catch Slick, although he did note that Ventress' appearance in the episode felt \"a bit unnecessary\". He ultimately gave the episode a \"great\" rating of 8.5 out of 10. Dan Zehr from Coffee With Kenobi commended the episode, calling the chase sequence involving Rex, Cody, and Slick \"thrilling\" and saying that the episode was \"integral to disseminating the mystery that will eventually become Order 66\". Zehr praised the anthology structure of the series, calling it \"quite brilliant\", and said he was even more impressed with Dave Filoni after watching the episode. Susan Lulgjuraj from FanSided said that the episode makes the clone troopers feel like individuals, thus revealing their \"dark side\", and it raises moral questions about the clones' rights and freedoms.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.26\n| Viewers         = 2.94\n| ShortSummary    = The Republic discovers a Separatist bio-weapon lab hidden on the planet of Naboo. Rather than wait for help, Padmé explores the lab with Jar Jar. Anakin, Ahsoka, Rex, and Obi-Wan arrive and follow after her. They find that the Senator is being held captive by the sinister Dr. Nuvo Vindi. The mad scientist has been developing a lethal virus for the Separatists. Vindi threatens to set off a bomb and release the virus.\n| LineColor       = B11010\n}}\n| ProdCode        = 2.02\n| Viewers         = 2.11\n| ShortSummary    = Even though the lab has been shut down, Dr. Vindi manages to activate the dreaded Blue Shadow Virus, infecting Ahsoka, Padmé, and many clone troopers. The plague is fatal within 48 hours. Anakin and Obi-Wan must travel to the mysterious planet Iego to secure the only known antidote to the sickness. They arrive to find its population living in fear of a mysterious force that has been killing anything that tries to leave their world. With the help of Jaybo Hood, a clever Iegoan boy, Anakin and Obi-Wan must solve the planet's mystery before they can leave, and before everyone infected with the Separatist virus dies.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.15\n| Viewers         = 2.37\n| ShortSummary    = Ryloth, home world of the Twi'lek people, has been subjected to military occupation by the droid army of the Separatists and surrounded by a blockade of Trade Federation battleships. While launching a surprise attack against the blockade, Ahsoka disobeys Anakin's orders and ends up losing most of her squadron. Even though she is emotionally rocked by this failure, Anakin helps her learn to persevere, placing her in charge of another risky attack.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.17\n| Viewers         = 2.49\n| ShortSummary    = With the space blockade around Ryloth destroyed, Obi-Wan must lead a small clone force into a droid-occupied town to sabotage their anti-aircraft guns. Obi-Wan's mission is complicated when he learns the town's inhabitants are being used as living shields. A pair of clones in his platoon forges an unlikely friendship with a refugee Twi'lek girl, Numa, who has been orphaned by the war. Through their relationship with her, the clones begin to understand the real cost of the war.\n| LineColor       = B11010\n}}\n| ProdCode        = 1.19\n| Viewers         = 3.01\n| ShortSummary    = The battle for Ryloth rages as the Republic attempts to drive off the occupying droid army led by Techno Union foreman Wat Tambor. With his forces stretched thin, Mace Windu must convince Twi'lek freedom fighter Cham Syndulla to help him save the capital city from the droids' destruction. Initially, the Twi'lek hero is hesitant to aid Mace, but ultimately he realizes that the Jedi can be trusted and joins with him to liberate the city—and ultimately the planet—in the climactic battle.\n| LineColor       = B11010\n}}\n| ProdCode        = 2.04\n| Viewers         = 3.29\n| ShortSummary    = In an attempt to force the release of the crime lord Ziro the Hutt from prison, bounty hunters seize control of the Senate Building and hold members of the Senate hostage. Cad Bane, the leader of the operation, with the help of bounty hunter Aurra Sing, issues his demands to Chancellor Palpatine, who has no choice but to meet his request. Unbeknownst to the hunters, Anakin is loose in the Senate building.\n----\nHostage Crisis received attention for it being the episode that contained the debut of Cad Bane. The episode was generally well received for its willingness to portray violence, but drew criticism for its inclusion of Ziro the Hutt, due to that character being seen as uninteresting and as an offensive LGBT stereotype. The effectiveness of the episode's portrayal of Anakin Skywalker was disputed among critics.\n| LineColor       = B11010\n}}\n}}\nSeason 2: Rise of the Bounty Hunters (2009–10)\nThe season two premiere, \"Holocron Heist\", was broadcast on October 2, 2009, and attracted  viewers. Episode 15 was first released in Canada. Episodes 16–21 were released in the UK before airing in the US. In season 2, the Sith resort to hiring bounty hunters and mercenaries to steal objects and intel or to assassinate targets for them. Meanwhile, the Jedi lead the Republic forces in an assault on the primary battle droid manufacturing facility.\nThe one-hour season finale combined of \"R2 Come Home\" and \"Lethal Trackdown\" was broadcast on April 30, 2010, and the original broadcast received  viewers.\n| ProdCode        = 1.23\n| Viewers         = 2.58\n| ShortSummary    = Obi-Wan and Anakin try to stop bounty hunter Cad Bane from stealing a holocron from the Jedi temple. Meanwhile, Ahsoka discovers another shapeshifting bounty hunter disguised as a Jedi.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 1.13\n| Viewers         = 2.58\n| ShortSummary    = Cad Bane moves to sell the stolen holocron to the Separatists while Anakin and Ahsoka try to retrieve it and return it to the holocron vault inside the Jedi Temple.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.03\n| Viewers         = 2.8\n| ShortSummary    = Cad Bane uses the holocron to find and kidnap Force-sensitive younglings. Anakin and Ahsoka try to find them and take them home while Mace Windu and Obi-Wan track down the holocron.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.05\n| Viewers         =\n| ShortSummary    = The Jedi suspect that Senator Rush Clovis is working for the Separatists, so they recruit Padmé to spy on him. Anakin discovers that Padmé and Clovis have a romantic history.}}\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.07\n| Viewers         =\n| ShortSummary    = Using the information stolen from Senator Clovis, Obi-Wan, Anakin, Ahsoka, and Ki-Adi-Mundi lead a combined clone trooper assault on a massive droid factory on Geonosis.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.08\n| Viewers         =\n| ShortSummary    = Ahsoka and Luminara Unduli's Padawan, Barriss Offee, sneak into the droid factory to destroy it while their masters face the new, indestructible \"Super Tanks\".\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.09\n| Viewers         =\n| ShortSummary    = Luminara is captured while looking for Separatist leader Poggle the Lesser, and it's up to Anakin, Obi-Wan, and Commander Cody to enter a colony of Geonosian zombies to find her.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.12\n| Viewers         =\n| ShortSummary    = Ahsoka and Barriss are to transport critical supplies to a medical station, but their clone troops are infected with mind-controlling Geonosian worms that try to kill the Jedi. Barriss is also infected by this mind-controlling worm.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.14\n| Viewers         =\n| ShortSummary    = Jedi Master Eeth Koth is captured by General Grievous. While Jedi Master Adi Gallia and Anakin try to rescue him, Obi-Wan plays bait to lure Grievous and capture him.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.06\n| Viewers         =\n| ShortSummary    = After escaping to the planet Saleucami, Grievous searches for a ship to get offworld. Obi-Wan, Commander Cody, and Rex try to search for Grievous before he escapes the planet. Rex is wounded by a commando droid sniper while scouting ahead and meets a deserter at a farm where he takes shelter.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.11\n| Viewers         =\n| ShortSummary    = When Ahsoka's lightsaber is stolen by a pickpocket, she gets help from the seemingly feeble elder Jedi Tera Sinube as she tracks down the thief.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.13\n| Viewers         =\n| ShortSummary    = Obi-Wan is assigned to protect Duchess Satine Kryze of Mandalore from a terrorist organization called Death Watch.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 1.21\n| Viewers         =\n| ShortSummary    = As Satine heads to Coruscant protected by clones and two Jedi, Anakin, R2 and the clones find assassin droids in the cargo while Obi-Wan tries to identify the traitor.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.16\n| Viewers         =\n| ShortSummary    = On Coruscant, Satine disguises herself as a civilian to avoid assassins as she pleads for the Senate to leave her planet in peace.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.10\n| Viewers         =\n| ShortSummary    = Senator Onaconda Farr is poisoned, and Padmé teams up with Bail Organa to unmask the culprit, who turns out to be a fellow senator.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.17\n| Viewers         = 2.02\n| ShortSummary    = A highly seasoned Separatist strategist stands between the Republic fleet and beleaguered Republic forces on Christophsis. Anakin finds himself in command of an advanced prototype stealth ship with orders to ferry supplies to the weary troops on the planet below. Will he obey orders, or use the stealth ship to launch a sneak attack on the Separatist blockade?\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.19\n| Viewers         =\n| ShortSummary    = When Anakin, Ahsoka and Obi-Wan crash on the lush rainforest planet of Felucia, they decide to help four bounty hunters protect local farmers from pirates intent on stealing their valuable crops. Obi-Wan and Anakin soon find out that the pirates are led by the duo's old foe, Hondo.\n----\nNote: This episode is dedicated to celebrated filmmaker, Akira Kurosawa, and draws parallels from his film \"Seven Samurai\".\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.22\n| Viewers         =\n| ShortSummary    = The Republic's newest droid-annihilating proton bomb awakens a monstrous, gargantuan, and near-invincible beast from its underground hibernation. Mace Windu and Anakin Skywalker face a dilemma: save the beast as the last specimen of its kind, or help the Dugs kill it and secure a treaty for critical fuel supplies?\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.23\n| Viewers         =\n| ShortSummary    = When the Zillo Beast is brought back to Coruscant in hopes of learning the secret of its impenetrable armour, it instead breaks loose and rampages across the ecumenopolis. As the clones prepare to kill it with poison gas, the Jedi are again trapped in a moral conflict between the value of its life and that of the planet's civilian populace.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.15\n| Viewers         = 2.85\n| ShortSummary    = Boba Fett infiltrates a Republic cruiser and joins a group of young clones with the intention of assassinating Mace Windu for killing his father Jango Fett.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.18\n| Viewers         = 2.76\n| ShortSummary    = Anakin Skywalker and Mace Windu are trapped in the crumbling ruins of a crashed ship while searching for survivors, and only R2-D2 can get out a message to save them—if he can elude vicious gundarks and, worse yet, a crew of determined bounty hunters led by Boba Fett and Aurra Sing.\n| LineColor       = C0BDBD\n}}\n| ProdCode        = 2.20\n| Viewers         = 2.76\n| ShortSummary    = The finale is significant for ending \"with twin fandom bangs, courtesy of Boba Fett and a mammoth beast inspired by Godzilla.\" Fett's entrance in the series commemorates the 30-year anniversary of the character's appearance in the 1980 film The Empire Strikes Back. While Anakin and Mace Windu recover from their injuries, Plo Koon and Ahsoka track down Boba Fett from the underworld of Coruscant to the desert planet of Florrum. Boba's revenge scheme finally leads to a climactic battle, and the life of a Republic admiral hangs in the balance.\n----\nBryan Young, a writer for The Huffington Post and Examiner.com, also disliked Fett's responses at the end of the episode when confronting Mace Windu: \"He says something incredibly whiny.\" Young does state, however, that \"[o]verall, this pair of episodes was a satisfying conclusion to season two, which really upped the game in this series in terms of animation, storytelling and suspense.\" GalacticBinder.com's reviewer Chris Smith wrote, \"Lucasfilm delivers another exciting episode to finish off a tremendous second season.\" Adam Rosenberg writing in MTV Movies Blog discusses Boba Fett's return: \"He's going to have to be put through a lot more hell before he embraces his inner badass. I'll say though... he's off to a mighty good start with the dual blasters he wears on his belt. Sure, they're almost the size of his thighs, but hey... he's still just a kid.\"\n| LineColor       = C0BDBD\n}}\n}}\nSeason 3: Secrets Revealed (2010–11)\nThe season three premiere, consisting of \"Clone Cadets\" and \"ARC Troopers\", was broadcast on September 17, 2010, attracting  viewers. These episodes, and certain others in this season, cover events from previous seasons. Episodes 21 and 22 were released in the UK before airing in the US. The season finale, consisting of \"Padawan Lost\" and \"Wookiee Hunt\", was broadcast on April 1, 2011, attracting  viewers.\n| ProdCode        = 3.01\n| Viewers         = 2.42\n| ShortSummary    = On Kamino, before the events of \"Rookies\" (Season 1 Episode 5), five clone cadets of Domino Squad are at risk of washing out unless they pull their team together while trainers Bric, El-Les, and Jedi Master Shaak Ti debate their fate.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.02\n| Viewers         = 2.42\n| ShortSummary    = General Grievous and Ventress's Separatist forces launch a major attack on the Republic cloning facilities on Kamino with Anakin, Obi-Wan, Jedi Master Shaak Ti, and the 501st defending it.\n----\nNote: Clone Commander Colt's death scene was cut when the episode aired on Cartoon Network, specifically when Ventress impales him with her lightsaber and kisses him on the cheek. The Netflix distribution of the episode includes the deleted scene intact. Disney+ uses the Cartoon Network edit.\n| LineColor       = 07078F\n}}\n| ProdCode        = 2.24\n| Viewers         = 1.69\n| ShortSummary    = With Ryloth under siege, trapped Jedi Master Ima-Gun Di and his clone forces rally the local forces of Cham Syndulla. Elsewhere, the Jedi council sends Bail Organa and Jar Jar Binks to go to Toydaria to ask King Katuunko for aid to Ryloth.\n| LineColor       = 07078F\n}}\n| ProdCode        = 2.25\n| Viewers         = 1.88\n| ShortSummary    = Chairman Papanoida's family is kidnapped and held for ransom. Ahsoka must team up with the Senator from Pantora, Riyo Chuchi, to aid the new chairman in recovering his family before the Trade Federation can unduly influence the future of his planet.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.04\n| Viewers         = 1.78\n| ShortSummary    = Padmé, on a diplomatic mission to Mandalore, guarantees the pacifist planet the Republic's full protection, but she and Duchess Satine soon find something sinister lurking beneath the planet's serene facade. Moogan smugglers have been sneaking in supplies, including bottled tea destined for the Mandalorian schools. To increase their profits, they have been diluting the tea with a hazardous chemical.\n| LineColor       = 07078F\n}}\n| ProdCode        = 2.26\n| Viewers         = 1.79\n| ShortSummary    = Ahsoka is assigned as a teacher at the cadet academy on Mandalore while covertly investigating the corruption inside Satine's administration. Soon after she arrives, Satine's zealous nephew Korkie and his classmates uncover a nefarious plot.\n| LineColor       = 07078F\n}}\n| ProdCode        = 2.21\n| Viewers         = 1.85\n| ShortSummary    = Having volunteered to protect Padmé during a political mission to Alderaan, Ahsoka is plagued by recurring visions of the presumed dead bounty hunter Aurra Sing assassinating the senator.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.03\n| Viewers         = 1.84\n| ShortSummary    = While on an important shopping trip on Coruscant, C-3PO and R2-D2 are kidnapped by the sinister bounty hunter Cad Bane in the dastardly plot to free Ziro the Hutt.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.05\n| Viewers         = 1.76\n| ShortSummary    = Due to his possession of incriminating information, Ziro the Hutt is placed under the custody of the Hutt Council. When Cad Bane is sent to hunt down Ziro, he learns that Jedi Masters Obi-Wan and Quinlan Vos are searching for Ziro too.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.06\n| Viewers         = 1.75\n| ShortSummary    = When the Senate begins debate on a bill that would eliminate government oversight of the Banking Clan's activities, Padmé and Ahsoka travel in secret to the capital of the Confederacy of Independent Systems in an attempt to forge a peace agreement with the Separatists. However, after both the Republic and Separatists agree to have a peace conference, Dooku orders General Grievous to dispatch a group of droids to launch a terrorist attack on Coruscant, resulting in a failure of peace.\n----\nNote:  The episode's title is a reference to the opening crawl of Revenge of the Sith.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.07\n| Viewers         = 1.61\n| ShortSummary    = Senators Padmé Amidala, Bail Organa and Onaconda Farr push against a new bill in the Senate to buy new clones for the Republic. But someone does not like their opposition and tries to dissuade them.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.08\n| Viewers         = 1.86\n| ShortSummary    = Darth Sidious commands Count Dooku to eliminate Asajj Ventress, troubled by her growing progress in the dark side of the Force. When Ventress survives Dooku's assassination attempt, the jilted former apprentice vows to take revenge, enlisting her kinswomen - the Nightsisters of Dathomir - in her scheme.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.10\n| Viewers         =\n| ShortSummary    = With Ventress's attack on Dooku resulting in failure, Mother Talzin gives Dooku a new apprentice named Savage Opress, who is the clan brother of Darth Maul and secretly controlled by the Nightsisters.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.12\n| Viewers         = 2.21\n| ShortSummary    = With Savage Opress connected to the Force, he is sent out by Dooku to capture King Katuunko, where he meets Obi-Wan and Anakin, sent by the Jedi to search for Savage Opress as he murdered two Jedi. Opress escapes and is punished by Dooku for killing Katuunko rather than capturing him. Eventually, Ventress arrives and both attack Dooku. But the attack fails when Opress becomes enraged after being confused between his loyalties to Dooku and Ventress, and also when Obi-Wan and Anakin interfere. All remain unharmed. Savage returns to Mother Talzin, believing Ventress betrayed him, and he's then sent by Talzin to look for his long-lost brother: Darth Maul.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.09\n| Viewers         = 1.74\n| ShortSummary    = Obi-Wan, Anakin and Ahsoka become stranded on a mysterious planet where the Force is very strong. Three powerful entities called the Father, Son and Daughter live there. The Father tries to convince Anakin to stay and remain as Anakin will be the only one able to control the Son and Daughter since he is the Chosen One.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.11\n| Viewers         = 2.29\n| ShortSummary    = Before the Jedi can leave Mortis, the Son takes Ahsoka captive in an attempt to entice Anakin into joining him to use their combined strength to overpower his Father and Sister. To this end, the Son casts Ahsoka under the spell of the dark side and she battles Anakin when he comes to rescue her, and, later, battles with Obi-Wan. After a battle between the Son and the Daughter is stopped by the Father, Ahsoka steals the dagger that controls the Son. The Son is about to kill the Father, but the Daughter sacrifices herself to save the Father and returns Ahsoka to normal as well by the Daughter transferring her life to Ahsoka.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.13\n| Viewers         = 2.24\n| ShortSummary    = The Jedi remain stranded on Mortis, and the Son aligned with the Dark Side of the Force renews his efforts to convert Anakin as the Jedi prepare for a decisive confrontation. To turn Anakin to the Dark Side, the Son shows Anakin future images of himself causing so much pain and death as the Sith Lord Darth Vader. This works, and Anakin joins the Son out of fear that what he saw would actually happen. Ahsoka disables the ship upon hearing that Anakin joined the Son, and leaves to help Obi-Wan find the Father. The Father later confronts Anakin and erases his memory of the terrible vision the Son had shown him. When the Son tries to kill the Father, the Father steals the sword and uses it to kill himself, taking away his Son's power, allowing Anakin to kill the Son and restore the balance.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.14\n| Viewers         = 1.84\n| ShortSummary    = An elite team of Jedi attempts to free Master Even Piell, who is in possession of hyperdrive coordinates that could harm both Separatists and Jedi alike, from an impenetrable prison, encountering reprogrammed battle droids, carbonite chambers and a younger Captain Tarkin along the way (before he joined the Galactic Empire). It is revealed that Piell and Tarkin each have memorized half of the coordinates.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.15\n| Viewers         = 1.87\n| ShortSummary    = With freed prisoners in their possession and brutal warden Osi Sobeck attempting desperately to thwart them, Obi-Wan and Anakin search for a way out of the Citadel and back to Coruscant. The prison, however, has more traps, perils and pitfalls in store for them than they had imagined and they must work past their differences if they are to escape. ARC trooper Echo is seemingly killed in battle.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.17\n| Viewers         = 1.55\n| ShortSummary    = While finding their way out of the Citadel prison which is under the command of the Separatist Osi Sobeck, the elite team's ship was destroyed, forcing them to wait for a rescue by the Republic fleet. Along the way to the rendezvous point, they encounter waves of droid squads which they have to fight in order to evacuate freed prisoners and save the information they hold. The Jedi attempt to escape, but are cornered by a pack of anoobas who kill Even Piell. But before he dies, he gives his half of the information to Ahsoka, telling her not to reveal it to anyone but the Jedi Council. Yet, as the Jedi are about to escape, they are cornered by Sobeck who tries to kill Tarkin, but is stabbed and killed by Ahsoka. Plo Koon then arrives and rescues the Jedi, taking them back to Coruscant.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.16\n| Viewers         = 2.31\n| ShortSummary    = Ahsoka gets captured by Trandoshans during a battle on the planet Felucia. They drop her off on a planet where they intend to hunt her and others for sport. Ahsoka encounters three Jedi younglings named Kalifa, Jinx and O-mer, whom she teams up with to survive. The next day, they set out to escape the Trandoshans but are found and hunted. The lead Trandoshan's son is accidentally killed, and, in revenge, his father shoots and kills Kalifa. Ahsoka promises to take care of the other two younglings as Kalifa dies.\n| LineColor       = 07078F\n}}\n| ProdCode        = 3.18\n| Viewers         = 2.31\n| ShortSummary    = As Ahsoka and her allies struggle to evade the Trandoshan hunters, their efforts receive an unexpected boost when a new captive arrives: Chewbacca the Wookiee. Together, the younglings, Ahsoka and Chewie attack the Trandoshan fortress, and with the help of other Wookiee warriors, are able to kill a large number of Trandoshans. Ahsoka herself kills the Trandoshan leader Garnac with a powerful Force push.\n| LineColor       = 07078F\n}}\n}}\nSeason 4: Battle Lines (2011–12)\nThe season four premiere, consisting of \"Water War\" and \"Gungan Attack\", was broadcast on September 16, 2011, and attracted  viewers, the lowest premiere viewing of all seasons. The season finale, \"Revenge\" was broadcast on March 16, 2012, attracting 2.03 million viewers. This season marks the return of Darth Maul.\n| ProdCode        = 3.22\n| Viewers         = 1.93\n| ShortSummary    = Anakin, Padmé, Kit Fisto and Ahsoka find themselves on the planet of Mon Calamari helping to keep the peace in a near civil war. But the Separatists have another plan. Will the Jedi and the inhabitants of Mon Calamari join forces and push back the invaders, or will another planet fall into the hands of the Separatists? An underwater battle takes place as the Republic attempts to save the planet from falling.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 3.23\n| Viewers         = 1.93\n| ShortSummary    = After the Separatists defeat most of the Republic forces on Mon Calamari, the Jedi Council are forced to call in the help of Jar Jar Binks and the Grand Gungan Army to aid the remaining Republic forces on the planet. However, in the aftermath of the battle, those forces and the Jedi are captured, leaving Ahsoka and Prince Lee-Char to devise a new strategy.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 3.24\n| Viewers         = 1.61\n| ShortSummary    = After Anakin, Padmé, Kit Fisto and Jar Jar Binks are all captured by Riff Tamson, Ahsoka and Prince Lee Char must find a way to free their friends from the grip of the Separatists. Endeavoring to liberate his planet from the sinister Tamson, Lee Char must now convince the Quarren to rejoin his cause.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 3.19\n| Viewers         = 1.56\n| ShortSummary    = Anakin, Padmé and Jar Jar uncover a plot by the Gungan \"shaman\" Rish Loo to trick the Gungans into aiding the Separatists in an assault on Naboo. As the charade unravels, can Jar Jar convince the Gungan army that they've been deceived? Shortly after General Grievous arrives, demanding to know why the attack was cancelled, Jar Jar manages to capture Grievous, but Dooku lures Anakin, who is chasing after Rish Loo, into a trap. Now Dooku demands the freedom of Grievous in exchange for Skywalker.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 3.20\n| Viewers         = 1.35\n| ShortSummary    = Plo Koon's clone legion \"The Wolfpack\", R2-D2 and C-3PO are sent to repair power & communication systems on the planet of Aleen after a series of devastating earthquakes; but the droids discover a severe ecological imbalance between the planet's subterranean ecology and surface biospheres.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 3.21\n| Viewers         = 1.67\n| ShortSummary    = On their return voyage to Coruscant, their Republic cruiser is attacked by General Grievous. R2-D2 and C-3PO find themselves in a Y-wing and on a series of four mini-adventures whilst trying to get back to the safety of Coruscant, the last of which is being trapped on General Grievous' ship with captured Jedi Master Adi Gallia. Jedi Master Plo Koon and his clone legion the Wolfpack rescues them.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 3.25\n| Viewers         = 1.78\n| ShortSummary    = When Anakin is forced to temporarily turn over command of his clone troopers (the 501st Legion) to a new commander, Jedi Pong Krell, tensions begin to run high as the clones are assigned with a very deadly mission to take the capital of Umbara.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 3.26\n| Viewers         = 1.56\n| ShortSummary    = General Krell orders Captain Rex and the clone troopers of the 501st Legion to conquer a heavily fortified Umbaran airbase, and will not accept anything less than victory. It is an almost certain suicide mission unless the clones can use their ingenuity to defeat their new enemy.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.01\n| Viewers         = 1.80\n| ShortSummary    = After the Republic conquers an Umbaran airbase, General Krell orders Rex and his men on towards the heavily fortified capital. Realizing there is a better plan, clone troopers Fives, Jesse and Hardcase disobey orders to carry out a rogue, covert operation with Hardcase sacrificing himself to ensure the success of the operation. Angered at their disobedience, Krell decides to have Jesse and Fives executed.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.02\n| Viewers         = 1.62\n| ShortSummary    = The Clones of the 501st Legion refuse to execute Jesse and Fives, and Krell sends them to engage Umbarans, disguised as clone troopers, that are preparing for an attack. The 501st Legion soon realizes that they are not shooting at Umbarans, but at the 212th Battalion of Clones. A dying Waxer reveals that Krell gave them the same orders. Realizing they have been betrayed, the Clones set out to arrest Krell, and a chase ensues. Clone Trooper Tup eventually manages to stun the General, who reveals he planned to ensure the Umbarans won the battle so that Dooku would make him his apprentice. The Clones agree Krell is too dangerous to be kept alive and decide to execute him; when Rex hesitates to shoot Krell, he is suddenly killed by another Clone Trooper, Dogma.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.03\n| Viewers         = 1.57\n| ShortSummary    = Zygerrian slavers are behind the sudden disappearance of an entire colony of people on the planet Kiros. As Anakin and Ahsoka rush to defuse a series of bombs planted by the slavers, Obi-Wan must fight with their imposing leader who runs off, leading Anakin and Ahsoka to raid and take over his ship.\n----\nNote: This episode and the following two are based on a six-part Star Wars Legends comic, Slaves of the Republic, originally published by Dark Horse between September 2008 and May 2009.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.04\n| Viewers         = 1.37\n| ShortSummary    = Anakin, Obi-Wan, Rex, and Ahsoka go undercover to infiltrate the slavers on Zygerria to find the missing Colonists. Obi-Wan, Rex, and Anakin pretend to be slavers with Ahsoka as a slave (impersonating an heiress). Later on, Obi-Wan is captured for trying to help a colonist escape, and Anakin and Ahsoka are also captured by the Zygerrian Queen. Anakin struggles with his emotions as a wily Zygerrian queen forces him to take questionable actions in order to carry out his mission.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.05\n| Viewers         = 1.39\n| ShortSummary    = Anakin tries to convince the Zygerrian Queen that she, too, is a slave and pawn in an evil Separatist plot. Meanwhile, Obi-Wan and Rex are captured and taken to the Planet of Kadavo to toil in the slave camps.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.06\n| Viewers         = 1.51\n| ShortSummary    = A peace conference between Separatists and Republic delegates is interrupted by Lux Bonteri, the son of the late Separatist Senator, Mina Bonteri (\"Heroes on Both Sides\"). Soon after, he involves Ahsoka in his dangerous search to find justice for his mother's death—which subsequently leads to Ahsoka crossing paths with Pre Vizsla and the Death Watch.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.07\n| Viewers         = 2.12\n| ShortSummary    = Obi-Wan fakes his own death and goes undercover (as Rako Hardeen) in a Republic prison, in order to gather information on a plot to kidnap Chancellor Palpatine from a convict named Moralo Eval. While there, he learns that another prisoner, notorious bounty hunter Cad Bane, is also involved. Meanwhile, Anakin seeks vengeance for the death of his former master.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.08\n| Viewers         = 1.62\n| ShortSummary    = Having escaped from prison, Obi-Wan, Cad Bane and Moralo Eval flee across the galaxy, pursued by Anakin and Ahsoka. Obi-Wan must devise a way to warn his fellow Jedi to halt their chase without blowing his cover.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.09\n| Viewers         = 1.80\n| ShortSummary    = Count Dooku invites some of the best bounty hunters in the galaxy, including Cad Bane and a still-disguised Obi-Wan, to compete in an obstacle course designed by Moralo Eval known as \"The Box\", with involvement in the plot to kidnap Chancellor Palpatine as the reward for survival. After facing many challenges in The Box, Obi-Wan survives, along with Cad Bane and three other bounty hunters. Cad Bane is appointed by Dooku to lead the kidnap operation against Palpatine on Naboo.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.10\n| Viewers         = 1.86\n| ShortSummary    = Supreme Chancellor Palpatine goes to Naboo, guarded by Jedi Knights. Meanwhile, Cad Bane, a still-disguised Obi-Wan and a pack of bounty hunters put their plan into action, but it fails when Obi-Wan alerts the Jedi and Dooku doesn't rendezvous with them to collect his quarry. With the bounty hunters now in Republic custody, Obi-Wan wants to change back to his original self. However, what Obi-Wan doesn't realize was that Dooku was eavesdropping via a hidden recorder when he alerted Mace Windu and Anakin Skywalker, indicating that a deeper conspiracy is still at hand. Will Anakin be able to stop Dooku's plan before it is too late?\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.11\n| Viewers         = 1.46\n| ShortSummary    = After failing to kill Dooku or control Savage Opress, Asajj Ventress is advised by Mother Talzin to reject the ways of the Sith and rejoin the Nightsisters. Upon discovering Ventress' location, Dooku commands General Grievous to launch an assault in a bid to eliminate Ventress and the entire Nightsister clan. As Ventress and Grievous square off, Talzin uses a voodoo doll against Dooku whilst her relative Daka—the eldest of the sister's clan—awakens an army of undead Nightsisters to hold off the droid forces. Ventress defeats Grievous and escapes while the rest of the Nightsisters are massacred, whereas Talzin escapes when her attempt of finishing off Dooku is ultimately foiled. The episode closes with Talzin's 'spirit' bidding farewell and good luck to Ventress, who is now left to grieve for her sisters and lament her lost future.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.12\n| Viewers         = 2.07\n| ShortSummary    = An aimless Asajj Ventress joins a team of bounty hunters under the leadership of a pre-teen Boba Fett. On an alien world, they undertake a precarious, profitable, subterranean delivery mission that tests the limits of their skills, and the strength of Asajj's character. Realizing that familial love is a ubiquitous virtue throughout the galaxies and that her powers are needed by many, Ventress finds a sense of closure and hope for her future after all.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.13\n| Viewers         = 1.99\n| ShortSummary    = With a magical amulet from Mother Talzin, Savage Opress lands on a junk planet in the Outer Rim and searches for his lost brother. With the help of the snake-like Morley, Savage finds his brother, the former Sith lord Darth Maul, who has been driven to insanity from his bisection and near-death experience on Naboo over ten years earlier.\n----\nNote: This episode's title card is red instead of yellow.\n| LineColor       = 1F1E1E\n}}\n| ProdCode        = 4.14\n| Viewers         = 2.03\n| ShortSummary    = Driven by hatred, Maul and Opress set out to take revenge on the Jedi who had sliced him in half. Maul sends a message to Obi-Wan Kenobi to confront him alone by murdering the inhabitants of a village on a distant planet. Upon arrival, Kenobi is attacked by both Maul and Opress, who leave the planet with Kenobi as their prisoner. Obi-Wan receives aid from an unlikely ally, Asajj Ventress, now a bounty hunter after the one million credit bounty on Opress. Outmatched, Obi-Wan and Ventress flee Maul and Savage in the ship's cockpit, leaving the two Dathomirian brothers to patiently stage their next move—with Maul vowing to exact his revenge on Obi-Wan.\n----\nNote: This episode's title card is red instead of yellow.\n| LineColor       = 1F1E1E\n}}\n}}\nSeason 5 (2012–13)\nThe season five premiere, \"Revival\", was broadcast on September 29, 2012, and attracted  viewers. Season five consisted of 20 episodes instead of the normal 22 episode count. The season five finale, \"The Wrong Jedi\", was broadcast on March 2, 2013, and attracted  viewers. Unlike the first four seasons, the episodes of the fifth season were released to DVD and Blu-ray in chronological order as opposed to broadcast order.\n| ProdCode        = 4.26\n| Viewers         = 1.94\n| ShortSummary    = Darth Maul and Savage Opress steal a fortune of Republic credits, and bribe a squad of pirates to take down a pirate stronghold run by Hondo. Obi-Wan and Jedi Master Adi Gallia intervene, but Savage kills Adi. Hondo ambushes the pirates and wins their loyalty back, while Obi-Wan fights Savage and Maul and cuts off Savage's left arm. The brothers flee to their ship under fire from Hondo and the pirates, but are forced to board an escape pod when the ship is damaged. Obi-Wan returns to Coruscant where the Chancellor informs him that the brothers are of no importance compared to the Separatists, and no further action should be taken against them.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 4.15\n| Viewers         = 1.71\n| ShortSummary    = On the Separatist world of Onderon, a group of rebels call for the assistance of the Jedi. Ahsoka, Anakin, Rex, and Obi-Wan go to train the rebels to fight, and see that former Separatist and Ahsoka Tano love interest Lux Bonteri is among them, as Onderon is his homeworld.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 4.16\n| Viewers         = 1.75\n| ShortSummary    = Ahsoka Tano, now leading the rebels on Onderon, but forbidden to fight, puts their training to use by having them hijack an AAT and blow up the main power station for the capital city of Onderon, so that the rebels can wreak havoc.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 4.17\n| Viewers         = 1.57\n| ShortSummary    = Sanjay Rash, Onderon's puppet king, accuses Ramsis Dendup, the deposed king, of inciting the rebellion against his rule and orders his execution. After an ill-concocted solo effort by Saw Gerrera to rescue Dendup, Steela, Lux Bonteri, and Ahsoka, with no help from the Republic, devise a plan to retrieve the King from the Palace. The plan fails, but as Dendup is about to be executed, the rebels are saved by General Tandin and the Onderonian militia, whom Saw has managed to sway to their side. Now knowing the Jedi's involvement, Dooku grows impatient with his underlings.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 4.18\n| Viewers         = 1.42\n| ShortSummary    = The rebels on Onderon struggle to reclaim their home planet. After the Republic and the Jedi High Council refuse to give Ahsoka Tano and the rebels assistance, Anakin Skywalker persuades Hondo Ohnaka to supply illegal rocket launchers to the rebels to combat the Separatists' new gunships. The rebels succeed in taking back Onderon, but Steela is killed in a fall during the battle. With Onderon lost to him, Dooku executes Sanjay Rash and has his forces depart the planet.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 4.22\n| Viewers         = 1.66\n| ShortSummary    = Ahsoka and Yoda take a group of younglings to a cave on Ilum to perform a Jedi rite of passage called \"The Gathering\", where they will each have to face an internal fear or flaw in order to retrieve a Kyber crystal so they can begin building their own lightsabers.\n----\nThe episode marks the first in the series' Young Jedi arc, the entirety of which was screened at the Star Wars Celebration VI convention on August 25, 2012. Critics praised the episode's animation and imagery, as well as the introduction of the Young Jedi characters to the series. IGN's Eric Goldman wrote, \"From the devilish mouth around one crystal to the glowing center of the ice [one of the Younglings] traveled to, it was all amazing to look at.\" Bryan Young wrote that his favorite aspect of the episode was its exploration of Jedi mythology and compared the Youngling's rite of passage to the test Luke Skywalker was given inside the pit on Dagobah in the film The Empire Strikes Back. Jayson Peters of the East Valley Tribune wrote that he appreciated how similar the voice for Yoda in the episode sounded to the original voice-overs done by Frank Oz in Yoda's first appearance in film, The Empire Strikes Back. Eric Goldman wrote in his review for IGN that the episode missed a major opportunity to explore the relationship between Ahsoka and Yoda: the two were left outside of the cave together while the Younglings completed their rite of passage, but the two Jedi's interactions during this time are not featured. Goldman also noted that with six new characters being introduced during the one 22 minute episode, only the very basic aspects of the Younglings' personalities were developed.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 4.23\n| Viewers         = 1.74\n| ShortSummary    = While returning to Coruscant with their lightsaber crystals, the younglings are attacked by Hondo, who wants to steal their crystals and sell them. Ahsoka must defend the younglings from the pirates.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 4.24\n| Viewers         = 1.96\n| ShortSummary    = With Ahsoka captured by Hondo, the younglings go to Florrum to rescue her, against the wishes of Obi-Wan Kenobi. However, before Obi-Wan can help the younglings, he is attacked by General Grievous and defeated, but nearly kills the droid general by setting the self-destruct on the Negotiator, allowing his escape. The younglings succeed in infiltrating Hondo's lair, but end up as prisoners themselves.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 4.25\n| Viewers         = 1.39\n| ShortSummary    = To revenge himself on Hondo for his past capture, Count Dooku has General Grievous attack the pirates' lair on Florrum, so Ahsoka and Hondo must join forces in order to survive this encounter.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 5.04\n| Viewers         = 1.46\n| ShortSummary    = R2-D2 is part of a team of Republic droids chosen for an important mission led by the diminutive Colonel Meebur Gascon to obtain an encryption module from a Separatist dreadnought. The droids must overcome numerous challenging obstacles to succeed in this crucial assignment.\n----\nNote: This episode's title card is light blue instead of yellow.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 5.05\n| Viewers         = 1.43\n| ShortSummary    = After their ship crashes on a desolate planet, D-Squad and Colonel Gascon must find a way off to get back to Coruscant, or be stranded forever.\n----\nNote: This episode's title card is light blue instead of yellow.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 5.06\n| Viewers         = 1.74\n| ShortSummary    = Colonel Gascon and D-Squad discover that Abafar, the planet they are trapped on, is Separatist-controlled, but they also discover a Republic Clone Commando named Gregor, who has been stranded on the planet as well. They must work together to get off the planet safely.\n----\nNote: This episode's title card is light blue instead of yellow.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 5.07\n| Viewers         = 1.47\n| ShortSummary    = After believing themselves safe, Colonel Gascon and D-Squad discover that they are prisoners of the Separatists in a captured Republic cruiser, finding themselves enmeshed in thwarting a plot to destroy a Republic space station holding a strategic conference.\n----\nNote: This episode's title card is light blue instead of yellow.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 5.01\n| Viewers         = 1.85\n| ShortSummary    = Darth Maul and Savage Opress form an alliance with the Mandalorian terrorist group Death Watch and several crime syndicates, including the Black Sun, the Pyke Syndicate, and the Hutt Cartel, in order to take over Mandalore and defeat Obi-Wan Kenobi.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 5.02\n| Viewers         = 1.83\n| ShortSummary    = Maul's alliance helps the Death Watch and their leader, Pre Vizsla, conquer Mandalore and imprison Duchess Satine, but Vizsla's ambitions surface and he betrays Maul, who later challenges him to a duel. After killing Vizsla, Maul  assumes control over a majority of the Death Watch.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 5.03\n| Viewers         = 1.86\n| ShortSummary    = Maul proceeds to lure Obi-Wan Kenobi to Mandalore with news of Satine's capture. Obi-Wan infiltrates Mandalore, but ends up captured himself. Maul murders Satine, but Obi-Wan is rescued by Bo-Katan (who is revealed to be Satine's sister) and her Death Watch faction, who trigger a civil war against Maul. Meanwhile, the takeover captures the attention of Darth Sidious, Maul's former master, who travels to Mandalore to deal with the rogue Sith brothers. Seeing Maul as a rival, he duels Maul and Opress, which leads to Opress's death at the hands of Sidious. Maul, however, is spared, but only because Sidious has plans for him. The episode ends as Maul is continuously tortured by Sidious using force lightning.\n----\nNote: This episode is dedicated to Ian Abercrombie, who voiced Palpatine/Darth Sidious in The Clone Wars.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 5.08\n| Viewers         = 2.02\n| ShortSummary    = After Ahsoka manages to rescue Anakin from certain peril on Cato Neimoidia, the two are called back to Coruscant from the front lines to investigate a terrorist bombing at the Jedi Temple.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 5.09\n| Viewers         = 1.64\n| ShortSummary    = Ahsoka Tano goes to the cell of Letta Turmond, the key suspect in the bombing, to question her, but Letta is Force-strangled to death by an unidentified assassin. Ahsoka is framed and detained by Admiral Tarkin. Despite Anakin's best efforts to exonerate her, she is forced to escape the military prison where she is incarcerated and flee into the Coruscant underworld to find the actual perpetrator and prove her innocence.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 5.10\n| Viewers         = 2.06\n| ShortSummary    = While on the run in the Coruscant Underworld, pursued by Republic authorities, Ahsoka makes a deal with Asajj Ventress to find out who the actual murderer of Letta Turmond really is. She talks to Barriss Offee to find out where the weapons used in the bombing of the Temple are located. When the pair go their separate ways, Ventress is knocked unconscious by a mysterious but Force-sensitive figure, who takes her lightsabers, and duels Ahsoka, who believes the unknown person is Ventress. While the unknown assailant escapes, Ahsoka is captured and escorted back up to the surface.\n| LineColor       = FF5F5F\n}}\n| ProdCode        = 5.11\n| Viewers         = 2.18\n| ShortSummary    = The prosecution of Ahsoka begins in the High Courts after the Jedi Council expels her from the Jedi Order. As Padmé fights to prove Ahsoka's innocence, Anakin finds Asajj Ventress in the Coruscant Underworld and reveals that Ahsoka had spoken to Barriss Offee while she and Ventress were still together. Back at the Jedi Temple, Anakin confronts Barriss, leading to a duel that reveals that she was the true culprit behind the crimes. Before Ahsoka can be sentenced, Anakin arrives with Barriss, who makes a speech denouncing the Jedi. Despite being cleared of all charges, Ahsoka is disillusioned by the turn of events and leaves the Jedi Order.}}\n| LineColor       = FF5F5F\n}}\n}}\nSeason 6: The Lost Missions (2014)\nThe sixth season was released in its entirety on March 7, 2014, on Netflix. The season had already premiered in Germany on February 15 the same year, on Super RTL.\n|episodes=\n| ProdCode        = 5.12\n| ShortSummary    = Clone Trooper Tup is suffering from a severe neurological disorder that causes him to shoot a Jedi Master dead. Trying to find the motives for the murder, the Republic escorts Tup back to Kamino for examination, but then they are attacked by the Separatists, who capture him. Anakin, Captain Rex and ARC Trooper Fives rescue Tup and take him to Kamino safely.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 5.13\n| ShortSummary    = Tup is undergoing a medical examination in the sterile laboratories of Kamino to find the motives for his shocking attack on the Jedi Master. For the examination to succeed, Fives must enter the depth of Tup's mind, where he finds a secret code manipulation in the cloning program of the Republic. The inhibitor chip is successfully removed, but Tup dies shortly after.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 5.14\n| ShortSummary    = Tup is transported back to Coruscant, where his body is to be examined by the Chancellor's personal physician. Fives is also investigating the matter and discovers that a modified code has been hidden in the minds of all the clones.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 5.15\n| ShortSummary    = In an effort to find more answers about Tup's actions, Fives attempts to speak with Chancellor Palpatine personally, only to find himself on the run. While unsuccessfully explaining what he learned to Anakin Skywalker and Rex, Fives is shot and killed by Commander Fox.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 4.19\n| ShortSummary    = While on a mercy mission to the planet Scipio, Padmé Amidala's old flame Rush Clovis gets in touch with her asking for help. Having made a stand against the corruption on his planet, Clovis has now become the target of the bounty hunter Embo. Together with Padmé, he is now trying to leave his planet and get help.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 4.20\n| ShortSummary    = Back on Coruscant, Clovis strikes a dubious deal to become the leader of the banking clan, which is deeply mired in corruption. Anakin doesn't trust Clovis, causing tensions in his relationship to Padmé.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 4.21\n| ShortSummary    = Clovis' deal with the Separatists backfires and consequently brings the war to Scipio, thus provoking the Republic to intervene and ultimately win the battle. In the midst of the chaos, Anakin confronts Clovis just as the duo and Padmé are caught in a blast—with Anakin barely managing to cling onto the other two when they virtually fall to their death. Though he intended to pull both up to safety, Anakin merely saves Padmé when Clovis allows himself to be killed.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 5.16\n| ShortSummary    = The peaceful world of Bardotta finds itself threatened by an ancient prophecy. Since now, of all times, its spiritual leaders have vanished, Bardotta's people ask their representative in the senate for help. And Jar Jar Binks indeed manages to convince Jedi Master Mace Windu that this matter is of grave importance.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 5.17\n| ShortSummary    = In order to fulfill a dark prophecy, a mysterious cult kidnaps Julia, queen of the planet Bardotta. Now, Jedi Master Mace Windu and Senate Representative Jar Jar Binks need to give everything in order to stop the cult. If they fail, the cult might unleash a dreadful force.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 5.18\n| ShortSummary    = Jedi Master Sifo-Dyas died under mysterious circumstances years ago. When a secret Jedi mission accidentally finds his crashed ship and lightsaber, Anakin Skywalker, Obi-Wan Kenobi, and Master Yoda investigate Sifo-Dyas's death again. To keep them from uncovering the Sith conspiracy, Darth Sidious orders Dooku to erase all traces that links up to the murder investigation. This is successful and Dooku escapes shortly after Obi-Wan and Anakin learn that he was the one who killed Sifo-Dyas under his Sith alias \"Darth Tyranus\", the same name under which he commissioned for the clone army. Now knowing that Dooku had a hand in creating the clones, the Jedi decide to keep the knowledge to themselves to avoid widespread panic and confusion until they know more.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 5.19\n| ShortSummary    = Yoda is deeply unsettled when he hears the voice of his deceased friend Qui-Gon Jinn in his head, because he knows that not even a Jedi can speak to the living from beyond the grave. The Jedi Council is concerned about Yoda's behavior and wants to examine him further. But with the help of Anakin, Yoda escapes from the hospital and he sets out to find the origin of the voice by himself.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 5.20\n| ShortSummary    = Guided by the Force, Yoda travels to the heart of the galaxy. There, on the planet where he finds the origin of the Force, he must face difficult trials. Only upon passing them will the Sages deem him worthy of learning the deepest mysteries of the Force.\n| LineColor       = E0BD11\n}}\n| ProdCode        = 5.21\n| ShortSummary    = On Moraband, the homeworld of the Sith, the time has come for Yoda to pass his final test. Only then will he learn the best-kept secret of his order, but first he encounters a vision that heavily foreshadows what is to come—which involves Yoda facing the spirit of Darth Bane. During this time, Darth Sidious summons Count Dooku to his hideout whereupon the duo plan to break Yoda—which stages an inevitable confrontation in the realm of the mind, between the Sith Lords and Yoda alongside Skywalker and his squad. Yoda realizes that—no matter who wins the Clone Wars or what the future holds—there will one day be a new hope.\n| LineColor       = E0BD11\n}}\n}}\nSeason 7: The Final Season (2020)\nThe Clone Wars returned with 12 new episodes released on Disney+ during the service's first year. The seventh and final season premiered on February 21, 2020.\n|episodes=}}\n|ProdCode        = 6.09\n|ShortSummary    = As Jedi generals Anakin Skywalker and Mace Windu lead the campaign on Anaxes to defend the main Republic shipyard from Admiral Trench, they find that the Separatists' droid army have always been one step ahead of them. Commander Cody, Captain Rex and the \"Bad Batch\", an unorthodox group of clone commandos with desirable mutations, go behind enemy lines to discover the source of the Separatists' series of victories. Inside the Separatist command center, Rex hears a mysterious signal feeding battle strategies to the droid army, leading him to believe that the lost clone trooper Echo may still be alive.\n|LineColor       = 8F422C\n}}\n|ProdCode        = 6.10\n|ShortSummary    = Anakin, Rex, and the Bad Batch launch a dangerous rescue mission under the assumption that Echo might be alive. Their last infiltration leads them to Skako Minor, where, after a brief skirmish with the natives, they trace Echo's signal to Wat Tambor's facility. There they discover Echo alive, used as a living computer by the Techno Union.\n|LineColor       = 8F422C\n}}\n|ProdCode        = 6.11\n|ShortSummary    = Anakin, Rex, and the Bad Batch escape Wat Tambor's facility with Echo and fight their way past Techno Union droid forces. They retreat to the native village, and, with the help of the locals, defend Echo from reinforcements sent by Wat Tambor to recapture the Techno Union's \"experiment\".\n|LineColor       = 8F422C\n}}\n|ProdCode        = 6.12\n|ShortSummary    = Back on Anaxes, Obi-Wan Kenobi and Mace Windu lead a final stand against the Separatist forces commanded by Admiral Trench. Anakin, Rex, the Bad Batch and Echo embark on a mission to strike at the heart of Trench's command ship, all the while questioning the rescued clone's loyalty to the Republic after unwittingly serving the Separatists. Proving his loyalty once more, Echo uses his cybernetic implants to foil the droid forces on Anaxes, but Trench activates a bomb that could destroy most of the planet. Anakin confronts Trench and successfully obtains the deactivation code before executing the admiral. As the Republic emerges victorious, Rex gives Echo permission to join the Bad Batch.\n|LineColor       = 8F422C\n}}\n|ProdCode        = 6.05\n|ShortSummary    = After crashing her speeder in the lower levels of Coruscant, Ahsoka Tano befriends Trace Martez, who offers to help work on her speeder. Some thugs come to ask Trace for some money her sister, Rafa, owes them; Trace and Ahsoka fight them off. Ahsoka then helps work on some of Rafa's droids, which turn out to be violence-prone. By secretly using the Force, Ahsoka helps Trace deactivate them.\n|LineColor       = 8F422C\n}}\n|ProdCode        = 6.06\n|ShortSummary    = Rafa accepts an assignment to deliver a load of spice from Kessel to the Pyke crime syndicate on Oba Diah, and uses Trace and her self-built ship, the Silver Angel, for the job. When Ahsoka argues with Rafa that the Pykes might not claim just the spice, but the ship as well, Trace jettisons the shipment into hyperspace. Ahsoka tries to deceive the Pykes into thinking that they have been double-crossed by Kessel's king Yaruba, but she, Trace, and Rafa get captured instead.\n|LineColor       = 8F422C\n}}\n|ProdCode        = 6.07\n|ShortSummary    = Ahsoka, Trace, and Rafa attempt to escape their imprisonment by the Pyke Syndicate. The Martez sisters reveal that their parents were accidentally killed by the Jedi as they apprehended Ziro the Hutt. Ahsoka secretly uses the Force to aid their escape, and three Mandalorians catch sight of her. Ahsoka and the Martez sisters end up recaptured by the Pykes.\n|LineColor       = 8F422C\n}}\n|ProdCode        = 6.08\n|ShortSummary    = Ahsoka manages to make a deal with the Pykes which allows the Martez sisters to temporarily leave Oba Diah to retrieve the spice, while she is held hostage. Ahsoka escapes the prison and places explosives all over the facility, where she overhears the Pykes talking to Darth Maul, who is on Mandalore. Meanwhile, the Martez sisters steal spice from the Pykes and bring it back to Oba Diah, where they learn that Ahsoka was a Jedi. They escape by blowing up the facility and are followed back to Coruscant by the three Mandalorians, who were previously part of Death Watch. One of them, Bo-Katan, manages to convince Ahsoka they have a common enemy in Maul, and Ahsoka decides to leave for Mandalore after reconciling with the sisters.\n|LineColor       = 8F422C\n}}\n|ProdCode        = 7.21\n|ShortSummary    = Ahsoka and Bo-Katan contact Anakin Skywalker and Obi-Wan Kenobi, asking them for help in apprehending Darth Maul in his new hideout on Mandalore. While Obi-Wan is apprehensive, Anakin and the 501st give Ahsoka a warm welcome until news arrives that General Grievous and the Separatists are attacking Coruscant. Upon Anakin's suggestion, Rex (field-promoted to commander) and part of the 501st accompanies Ahsoka to Mandalore, forcing Maul's loyalists under Gar Saxon into retreat. Bo-Katan apprehends Prime Minister Almec, while Ahsoka follows a trail into the city's tunnel network, only to walk right into Maul's trap.\n----\nNote: This episode opens with the classic Lucasfilm logo. The \"Star Wars theme\" by John Williams is heard and the title card is red instead of yellow. In place of the usual philosophical lesson, the episode title (preceded by \"Part I\") appears in red. The story overlaps with Revenge of the Sith, with this episode showing Anakin and Obi-Wan's whereabouts just prior to the events of the film.\n|LineColor       = 8F422C\n}}\n|ProdCode        = 7.22\n|ShortSummary    = Ahsoka faces off against Maul, who mentions Darth Sidious before escaping. Ahsoka relays this to Obi-Wan, who says he had inferred from the recently killed Count Dooku that Sidious is the name of the Sith Lord who orchestrated the Clone Wars. Obi-Wan stresses that Maul must be taken alive as he may be their only chance to learn more about Darth Sidious. The captured Almec mentions that Maul had hoped to lure Anakin to Mandalore, but is assassinated by Saxon before he can reveal why. As Bo-Katan's and Rex's forces lead a final assault against Maul's Mandalorians, Ahsoka confronts Maul again, who reveals that Sidious has engineered the destruction of both the Republic and the Jedi and asks Ahsoka to join him to stop Sidious. When she demands to know his intentions with Anakin, Maul claims that Sidious wants to make him his new apprentice, and that he had hoped to kill Anakin before this happens. Refusing to believe him, Ahsoka fights Maul above the city, where she rescues him from falling to his death. She then leaves Maul to be captured by clone troopers, despite his frantic warnings that everyone will soon die.\n----\nNote: This episode opens with the classic Lucasfilm logo. The title card is red instead of yellow. In place of the usual philosophical lesson, the episode title (preceded by \"Part II\") appears in red. No opening narration is given. The story overlaps with Revenge of the Sith. Through the use of motion capture, Lauren Mary Kim and Ray Park provided Ahsoka and Maul's movements for their duel.\n|LineColor       = 8F422C\n}}\n|ProdCode        = 7.23\n|ShortSummary    = With the Siege of Mandalore over, Ahsoka and Rex prepare to take Maul before the Jedi Council on Coruscant. Mace Windu and Yoda contact Ahsoka via hologram and reveal that Obi-Wan has tracked Grievous down to Utapau, indicating that the war may soon be over. On their way to Coruscant, however, Ahsoka senses Anakin falling to the dark side and helping Darth Sidious to kill Windu, moments before Sidious executes Order 66, which brands all Jedi as traitors to the Republic and orders their deaths. As Ahsoka's clone troopers, including Rex, suddenly turn on her, she is forced to escape. Rex resists the order just long enough to mention the incident with Fives, allowing Ahsoka to learn about the inhibitor chips. She releases Maul to create a distraction, then subdues and captures Rex. With the help of three astromech droids, Ahsoka removes the inhibitor chip from his brain, restoring his free will.\n----\nNote: This episode opens with the classic Lucasfilm logo. The title card is red instead of yellow. In place of the usual philosophical lesson, the episode title (preceded by \"Part III\") appears in red. No opening narration is given. The story overlaps with Revenge of the Sith. In addition to the regular cast, the episode features the original voices of Silas Carson as Ki-Adi-Mundi, Ian McDiarmid as Darth Sidious, Hayden Christensen as Anakin Skywalker, and Samuel L. Jackson as Mace Windu via archive recordings.\n|LineColor       = 8F422C\n}}\n|ProdCode        = 7.24\n|ShortSummary    = As Ahsoka and Rex try to escape from the cruiser, Maul destroys its hyperdrive, causing the vessel to drop out of hyperspace and into a nearby moon's gravitational field. Forced to fight their way through the clones, Ahsoka tries to prevent Maul from getting away in their shuttle but fails. Just barely clearing the doomed ship, Ahsoka and Rex escape to the moon, where they respectfully bury the clones and Ahsoka discards one of her lightsabers. Some time later, Anakin, now as Darth Vader, arrives on the moon and recovers Ahsoka's lightsaber from the wrecked cruiser.\n----\nNote: This episode opens with the classic Lucasfilm logo. The title card is red instead of yellow. In place of the usual philosophical lesson, the episode title (preceded by \"Part IV\") appears in red. No opening narration is given. The story overlaps with  Revenge of the Sith.\n|LineColor       = 8F422C\n}}\n}}\nChronological order\nWhile the series is designed to be an anthology of both standalone episodes and small story arcs, various events throughout inform stories, characters, and relationships to create a recognizably continuous narrative. In recognition of the release of the complete series on Netflix, StarWars.com released the official chronological episode order for the first six seasons on March 17, 2014; this was later updated to include links to the episodes on Disney+. Regarding the seventh and final season, StarWars.com revealed that episodes five through eight are set before the season premiere, \"The Bad Batch\".\nThe Clone Wars Legacy\nAt the time of cancellation in March 2013, there were still many episodes in development. Thirteen of these episodes were finished to become part of Season 6: The Lost Missions but there were still additional arcs that were never released. Lucasfilm released details of multiple story arcs from the unfinished episodes in September 2014. The Bad Batch was eventually completed and aired as the first arc of season 7.\nPrint\nDarth Maul: Son of Dathomir\nA four-episode arc continued the story of Darth Maul following the events of the season 5 episode \"The Lawless\". The four episodes were titled: \"The Enemy of My Enemy\", \"A Tale of Two Apprentices\", \"Proxy War\", and \"Showdown on Dathomir\" (original production codes: 6.21–6.24). According to Dave Filoni, the four scripts \"came out of one of our story conferences with George Lucas\". The scripts and designs for the arc were adapted into a four-issue comic book titled Darth Maul: Son of Dathomir, released in August 2014 by the publisher Dark Horse Comics. For ten years, the comic was effectively the final Star Wars comic published by Dark Horse before Lucasfilm transferred the license to Marvel Comics in 2014, until in 2022, Marvel and Lucasfilm entered a multi-license distribution agreement with both Dark Horse and IDW Publishing to dual publish Star Wars comics once more. However, it was collected into a trade paperback by Marvel in 2018, and all reprints bear its logo instead of Dark Horse's.\nThe plot follows Darth Maul, who was captured by Darth Sidious at the end of the season 5 episode \"The Lawless\". He is tortured by Count Dooku for information about the Shadow Collective and the allies Maul has made. Maul escapes and heads to Zanbar to command the Death Watch army, but is followed by General Grievous and his droids. They battle Maul and the Mandalorians, who are soon overwhelmed by the droids. Maul flees and confers with Mother Talzin, who is revealed to be his biological mother, and plots to draw out Sidious by capturing Dooku and Grievous. The scheme works, and Talzin is able to restore herself to her physical form, but sacrifices herself to save Maul and is killed by Grievous. Although Maul escapes with a company of loyal Mandalorians, the Shadow Collective has fallen apart due to the conflict with Sidious, as the Hutts, Pykes, and Black Sun have all abandoned Maul.\nDark Disciple\nAn eight-episode arc with Asajj Ventress and Jedi Quinlan Vos was adapted into a novel by Christie Golden titled Dark Disciple, released on July 7, 2015. The eight episodes were titled: \"Lethal Alliance\", \"The Mission\", \"Conspirators\", \"Dark Disciple\", \"Saving Vos, Part I\", \"Saving Vos, Part II\", \"Traitor\", and \"The Path\" (original production codes: 6.13–6.16 and 7.05–7.08). The story follows Vos partnering up with Ventress, hoping to execute Count Dooku. Eric Goldman of IGN gave the book an 8 out of 10, saying it was great.\nStory reels\nCrystal Crisis on Utapau\nIn September 2014, four unfinished episodes were released in completed story reel format, titled: \"A Death on Utapau\", \"In Search of the Crystal\", \"Crystal Crisis\", and \"The Big Bang\" (original production codes: 6.01–6.04). The arc takes place on Utapau with Obi-Wan and Anakin investigating an arms deal involving the Separatists and a gigantic kyber crystal. The arc also deals with Anakin's feelings after Ahsoka left the Jedi Order. It was included in the season 6 Blu-ray.\nThe Bad Batch\nThe story reels for this four-episode arc were screened on April 17, 2015, at Star Wars Celebration Anaheim, and were later released on the official Star Wars website on April 29. Scripted by Brent Friedman, the four episodes were later completed and aired as the first arc of season 7 (with some changes from the original story reels). A spin-off sequel series titled Star Wars: The Bad Batch was announced in 2020; it follows the titular group of clones working as mercenaries in the immediate aftermath of the Clone Wars.\nSee also\n* List of Star Wars: Clone Wars episodes\n* Star Wars: The Clone Wars (film)\nReferences\nFootnotes\nCitations\nFurther reading\n*\n*\nExternal links\n*\n* [https://web.archive.org/web/20090208195049/http://search2.sky.com/search/skymovies/search?search=all&pageno=2&totalno=66&query=clone+wars Skymovies.com Episode Guide]\n* [https://web.archive.org/web/20140627025234/http://starwars.com/explore/the-clone-wars/ The Clone Wars section on StarWars.com]\n* [https://web.archive.org/web/20091014095308/http://www.cartoonnetwork.com/schedule/index.html CartoonNetwork.com Schedule]\n* [https://www.starwars.com/news/star-wars-the-clone-wars-chronological-episodeorder Chronological order on StarWars.com]"
    }
  ]
}