{
  "content": [
    {
      "type": "text",
      "text": "# Listed buildings in King's Meaburn\n\nKing's Meaburn is a civil parish in Westmorland and Furness, Cumbria, England.  It contains twelve listed buildings that are recorded in the National Heritage List for England.  All the listed buildings are designated at Grade&nbsp;II, the lowest of the three grades, which is applied to \"buildings of national importance and special interest\".  The parish contains the village of King's Meaburn and the surrounding countryside.  The listed buildings comprise houses, farmhouses, farm buildings, a school, a former mill, a telephone kiosk, and three boundary stone.\n__NOTOC__\nBuildings\n{| class=\"wikitable sortable plainrowheaders\" style=\"width:100%;border:0px;text-align:left;line-height:150%;\"\n|-\n! scope=\"col\"  style=\"width:150px\" |Name and location\n! scope=\"col\"  style=\"width:100px\" class=\"unsortable\"|Photograph\n! scope=\"col\"  style=\"width:120px\" |Date\n! scope=\"col\"  style=\"width:650px\" class=\"unsortable\"|Notes\n|-\n|Scarcroft farmhouse, byres and barn\n|\n|align=\"center\"|\n|The farmhouse was extended to the rear in the 19th century.  The house and the outbuildings are in sandstone and have slate roofs.  The house has two storeys, a front of four bays, and a rear extension of three bays.  The windows on the front are mullioned, and in the extension there are sashes and a stair window with a semicircular head. At the rear is a porch with a hipped roof.  To the north of the farmhouse is a range of byres and barns.\n|-\n|Virginia House and barn\n|\n|align=\"center\"|\n|A sandstone house that has a slate roof with coped gables.  There are two storeys, three bays, and a 19th-century extension at the rear.  On the front is a gabled wooden porch with decorative bargeboards.  Most of the windows are mullioned, and there are three sash windows, one being a horizontally-sliding sash.  The barn to the right is higher, it has a corrugated asbestos roof, and the openings on the front have been altered.\n|-\n|Peaslands farmhouse\n|\n|align=\"center\"|1707\n|A stone farmhouse on a plinth, with quoins and a slate roof with coped gables.  There are two storeys and five bays.  On the front is a gabled wooden porch and a doorway with a moulded surround, a dated lintel, and a cornice.  The mullions have been removed from the windows and replaced by horizontally-sliding sashes.  Above the upper floor windows is a continuous hood mould.\n|-\n|Threshing barn, Sycamore House\n|\n|align=\"center\"|1715\n|The barn is in stone and has a symmetrical three-bay front.  In the centre is a wagon door with a dated and initialled keystone, this flanked by two smaller doors, and there is a small door at the rear.  All the doorways have segmental heads.  Also on the front are two tiers of ventilation slits.\n|-\n|Meadow Bank\n|\n|align=\"center\"|1784\n|Originally a farmhouse, later a private house, it is in sandstone on a chamfered plinth, with rusticated quoins, moulded eaves, and a green slate roof with stone copings.  There are two storeys, and a symmetrical front of three bays, with sash windows.  In the centre is a doorway with a moulded segmental canopy on ornate brackets, and a tympanum containing initials and the date.  At the rear are two two-light mullioned windows.\n|-\n|Greystone House and byre\n|\n|align=\"center\"|1789\n|The farmhouse is in ashlar and the byre is in rubble, and both have quoins.  The house has a slate roof with coped gables, two storeys, and a symmetrical front of three bays.  The central doorway has a rusticated surround, above the door is a dated and inscribed panel, and there are two sash windows with stone surrounds in each floor.  The byre to the left has a corrugated roof, two doorways and a loft door with segmental heads, and in front is a mounting block.\n|-\n|King's Meaburn Mill\n|\n|align=\"center\"|1811\n|A former corn watermill, in stone with quoins and a slate roof.  It consists of a three-storey mill, a two-storey drying kiln. and an external wheelhouse.  On the front of the mill is a former millstone used as a datestone.  In the wheelhouse is a breast waterwheel, and in the mill are metal gear wheels and four pairs of millstones.\n|-\n|School\n|\n|align=\"center\"|1831\n|The school was later extended to the south.  It is in stone with quoins and a slate roof.  The school is in a single storey, and the original part has three bays with windows that have stone surrounds with semicircular heads, projecting keystones and an impost band.  Above the central window is a date panel.  In the extension is a three-light mullioned window with a chamfered surround.\n|-\n|Parish boundary stone\n|\n|align=\"center\"|\n|The stone marks the boundary between the parishes of King's Meaburn and Maulds Meaburn.  It is in sandstone, and consists of a tall narrow block with a segmental head and chamfered edges.  The stone is carved with the names of the parishes, and with a benchmark.\n|-\n|Parish boundary stone\n|\n|align=\"center\"|\n|The stone marks the boundary between the parishes of King's Meaburn and Maulds Meaburn.  It is in sandstone, and consists of a tall narrow block with a segmental head and chamfered edges.  The stone is carved with the names of the parishes.\n|-\n|Parish boundary stone\n|\n|align=\"center\"|\n|The stone marks the boundary between the parishes of King's Meaburn and Bolton.  It is in sandstone, and consists of a tall narrow block with a segmental head and chamfered edges.  The stone is carved with the names of the parishes.\n|-\n|Telephone kiosk\n|\n|align=\"center\"|1935\n|A K6 type telephone kiosk, designed by Giles Gilbert Scott.  Constructed in cast iron with a square plan and a dome, it has three unperforated crowns in the top panels.\n|-\n|}\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}