{
  "content": [
    {
      "type": "text",
      "text": "# List of footballers killed during World War II\n\nMany former professional and top-level association footballers lost their lives during World War II, either while serving in their own or other countries' armed forces, as civilian casualties of enemy action or in enemy captivity. In addition, a number of Jewish players became victims of the Nazi Holocaust.\nIn the case of players whose countries were annexed by others or who migrated from their country of birth, they are classified under the nation of football association in which they spent most if not all of their playing careers.\nThose who died as a result of the war or service in it, include:\nAustria\n* Heinrich Belohlavek – midfielder who played in the national team in one match (1910), and for Vienna club SC Rudolfshugel. A political resister of the Nazi regime following the annexation by Germany in 1938, he was arrested for running a cell of the banned Austrian Communist Party at his factory and executed by beheading at Plotzensee Prison, Berlin, on 2 March 1943 aged 53.\n* Franz Cisar – played in the national team (1933–34), as well as for Hertha Wien (1926–29), Wiener A.C. (1929–35), Czech teams SK Moravská Slavia Brno (1935–36) and SK Prostějov (1937–39) and French club FC Metz (1936–37). An Obergefreiter (Corporal) in a German Army tank regiment, he was killed in action on the Eastern Front in Russia on 10 August 1943 aged 34.\n* Fritz Dunmann – Jewish striker who played in the national team (1906–07), and for Rapid Wien. He was imprisoned in 1941 and ultimately deported to Auschwitz concentration camp where he was killed on 5 June 1942 aged 57.\n* Otto Fischer – a Jewish player in the national team (1923–28) and for Hakoah Vienna (1926–30), and was coach for Italian club S.S.C. Napoli (1928) and Olimpia Liepaja in Latvia where he settled in 1936. Following German occupation of Latvia, he was killed in the Liepāja massacres, on 1 July 1941 aged 40.\n* Karl Gall – played in the national team (1931–36).  A Gefreiter (lance corporal) in the German army, he was killed in action on the Eastern Front near Staraya Russa, Russia, on 27 February 1943 aged 37.\n* Leopold Giebisch – played in the national team (1927–29). An Unteroffizier (corporal) in the German army, he was killed in action on the Eastern Front at Pillau, East Prussia, on 20 April 1945 aged 43.\n* Wilhelm Holec – a striker who played in the national team (1935). Played for SK Viktoria XXI (1932), First Vienna FC (1932–37) and SK Rapid Wien (1937–42). Reported missing in action serving under German command in Broasca, Romania, on the Eastern Front on 23 August 1944 aged 30.\n* Franz Jelinek – a forward who represented Germany (1940) after the Anschluss. Played for Wiener Sport-Club. He served as a corporal in the German army and was killed in action in Italy on 20 May 1944 aged 21.\n* Eduard Kanhauser – goalkeeper who appeared in the national team (1922–25). Played for Wiener Sport-Club (1921–26). An Unteroffizier in the German Army, he was reported missing in action in Italy on 22 May 1944 aged 42.\n* Franz Kellinger – played in the national team (1929). A soldat (private) in the German army, he died while serving at Barlad, Romania, on 14 June 1941 aged 35.\n* Ernst Künz – competed internationally at the 1936 Summer Olympics two years before the Anschluss. He was killed in action serving on the Eastern Front under German command in Lithuania on 21 August 1944 aged 32.\n* Fritz Löhner-Beda – though better known as a lyricist and librettist, he was a founder player with Hakoah Vienna in 1909. Jewish, he was arrested after the German annexation of Austria and was in concentration camps the rest of his life. Beaten to death at Auschitz Monowitz III camp in Poland on 4 December 1942 aged 59.\n* Johann Luef - player in national team (1929-33). Played as forward for Rapid Wien (1926-37), KSV Strassenbahn Wien (1937-39) and Vorwarts Steyr (1939-45). Died of wounds received in action as soldier in hospital in East Prussia on 3 April 1945 aged 39.\n* Franz Riegler II – a forward whose senior career was spent entirely under the Nazi Anschluss, enabling him to appear in the national team (1941–42). Played for Austria Wien (1939–43) and LSV Markersdorf/Peilach (1943–44). A civilian in the war apart from service in the Wehrmacht during 1942–43, he was killed in an Allied air raid on Vienna on 15 February 1945 aged 23.\n* Max Scheuer – Jewish player in the national team (1923). Played for Hakoah Vienna and later in French team Olympique de Marseille. He was arrested by the Nazis while trying to flee France and via Drancy internment camp was deported to Auschwitz concentration camp where he died after August 1941.\n* Karl Stürmer – played in the national team (1903–05). Played for First Vienna in 1898 and Wiener A.C., which he managed 1918–19 before settling into managing a series of teams in Italy including Reggiana (1920–22 and 1924–26), Torino (1922–24, 1929–30), Alessandria (1931-31 and 1936–37), Lazio (1932–34), Cremonese (1940–41), Verona (1941–42) and Cesena (1942–43). He was arrested by occupying German troops and shot at Faenza in 1943 aged 60.\n* Karl Wahlmuller – competed internationally at the 1936 Summer Olympics as midfielder. Played for SV Ufahr Linz and LSV Adlerhorst Weis. A corporal in a Luftwaffe field unit, he was killed in action on the Eastern Front in Toila, Estonia, on 16 February 1944 aged 30.\n* Walter Werginz – competed internationally at the 1936 Summer Olympics. He was missing in action serving under German command, later declared dead, in Ukraine on the Eastern Front on 21 March 1942 aged 31.\nBelgium\n* Henri Bierna – non-playing reserve member at the 1928 Summer Olympics, competed internationally in the national team (1927–28), and domestically for US Liege (1926–39). A civilian in the war, he was killed in an American air raid on Waremme, Belgium, on 28 August 1944 aged 38.\n* Frans Christiaens – goalkeeper with the national team (1935–36), who played for Lierse S.K. 1925–43. A civilian in the war, he was killed in an American air raid on Mortsel, Belgium, on 5 May 1943 aged 29.\n* Hector Goetinck – played in the national team (1906–23), and twice managed it (1930–34 and 1939–40). Midfielder with the Club Brugge (1903–14 and 1919–28) and their manager (1930–33), as well as with A.S. Oostende (1933–39). A civilian in the war, he was killed in an air raid at Knokke-Heist, Belgium, on 26 June 1943 aged 57.\n* Rene Joannes-Powell – played in youth for FC Liege until 1910, subsequently branching out into field and track sport, for which he became more distinguished as a hurdler. A civilian in the war, he was accidentally killed as a spectator to the deliberate destruction of a bridge at Liège in attempt to halt the German invasion of Belgium on 11 May 1940 aged 44.\n* Jean Petit – played four times with the national team in 1938. Defender with Standard de Liege (1930–39). A civilian doctor in the war, he was killed in an Allied air raid on Liege, Belgium, on 25 May 1944 aged 30.\nChina\n* Chen Zhenhe – competed internationally at the 1936 Summer Olympics and Far Eastern Games (1930 and 1934). Played for Shanghai team You-You. A Squadron Leader in the Chinese Air Force, he was killed on active service when he crashed on first flying a new aircraft near Lanzhou, China, on 28 January 1941 aged 34.\nCzechoslovakia\n* František Kloz – in the national team (1929–37) and twice top First League goalscorer (1931 and 1937). Played mainly for SK Kladno between 1928 and 1940, where he became manager (1942–43), and for SK Slavia Praha (1931) and Sparta Prague (1933). Anti-Nazi during his country's German occupation while continuing to professionally play, he was wounded when as a civilian volunteer he took part in a raid on an ammunition store in May and died in hospital at Louny on 13 June 1945 aged 40.\nEstonia\n* Erich Altosaar – though better known as basketball player, he played for Kalev when they won the 1930 Estonian Football Championship. A civilian police officer, after Estonia's annexation by the Soviet Union, he was arrested by the NKVD on charge of anti-Soviet activity and shot at a Gulag camp in Kirov Oblast, Russia, on 11 October 1941 aged 33.\n* Eduard Eelma (known until 1936 as Eduard-Wilhelm Ellman) – competed internationally at the 1924 Summer Olympics, in the national team (1921–35). Played for Kalev (1919–25), TJK (1925–30) and JS Estonia Tallinn (1930–35). He was arrested by the NKVD following Estonia's annexation by the Soviet Union, deported to Siberia and executed in prison at Kirov on 16 November 1941 aged 39.\n* William Fiskar – played for Meteor (1910–11) and Kalev (1911–12) (when Estonia was then part of the Russian Empire), becoming a founder of Estonia Football Association in 1921. A civilian in the war, he was arrested by the NKVD in 1940 following annexation by the Soviet Union on possible espionage charges, then transferred in 1941 to custody in Nazi Germany where he was executed in a concentration camp for anti-German activity charges in 1943 aged 53.\n* Harald Kaarmann – competed internationally at the 1924 Summer Olympics, in the national team (1921–26). Played for Kalev (1920–25) and Tallinna Jalgpalliklubi (1925–26). A civilian state policeman in Estonia, he was arrested by Soviet authorities in 1941 following the Soviet annexation and deported to Siberia where he was executed at a prison camp in Sverdlovsk on 19 August 1942 aged 40.\n* Valter Neeris – played in the national team (1934–40). Mobilized into the Red Army in 1941, killed in action in Battle of Velikiye Luki on 30 December 1942 aged 27.\n* Heinrich Paal – competed internationally at the 1924 Summer Olympics, in the national team (1920–30). Deported to Siberia following Soviet annexation he died in prison camp at Vyatlag on 20 September 1942 aged 47.\n* Egon Parbo – played in the national team (1931–39). Arrested by the NKVD in 1941 and died in a prison camp in Sosva on 24 April 1942 aged 32.\n* Viktor Piisang – played in the national team (1938–40). Played for club JS Estonia Tallinn. Drafted into the Red Army in 1941, he was wounded at the Battle of Velikiye Luki and was killed while in transport at Kohila, Estonia, on 24 September 1944 aged 26.\n* Voldemar Rõks – played in the national team (1923–24) and for JK Tallinna Kalev (1923–24). A bank official, he was deported to Siberia and died in Soviet prison camp at Solikamsk on 27 December 1941 aged 40.\n* Otto Silber – competed internationally at the 1924 Summer Olympics, in the national team (1920–26). Founder player for TJK(1920–25), and also a referee. A former Estonian Army soldier, he was arrested by the NKVD and executed in Saue, Estonia, on 23 December 1940 aged 47.\n* Elmar Tepp –  played in the national team (1937–40). Conscripted into the Red Army in 1941 and became a prisoner of war of the Germans during the Battle of Velikiye Luki. He was released in a later Soviet advance and subsequently sentenced to death by Soviet authorities, later commuted to a fifteen-year prison sentence. He died in prison in Kalinin, Russia on 11 March 1943 aged 30.\n* Heinrich Uukkivi – played in the national team (1931–40) and five times winning player in Estonian Football Championships. Played for TJK (1928–31).  Following the Soviet annexation he was conscripted into the Red Army and taken prisoner of war in the Battle of Velikiye Luki in 1941, released in a later Soviet advance and subsequently sentenced to imprisonment in the Gulag. He died in prison camp at Krasnoyarsk Krai, Russia, on 12 April 1943 aged 30.\nFinland\n* Holger Granström – played in the national team (1938–41). A corporal in the Finnish Army, he was killed in action at Espoo on 22 July 1941 aged 24.\n* Jarl Malmgren – competed internationally at the 1936 Summer Olympics and captained the team; and in the national team (1928–38). Played for HIFK (1928–37) and VIFK (1938–41). Served as lieutenant in the Finnish Army, being killed in action on Russian front in Eastern Karelia on 5 June 1942 aged 30.\n* Kaarlo Oksanen – played in the national team (1929–37). Played for Kullervo Helsinki (1927–28) and HPS Helsinki (1929–41). A runner in the Finnish Army, he died of wounds received in action by Suma River in Eastern Karelia on 14 October 1941 aged 30.\nFrance\n* Grégoire Berg – a Jewish player for national team (1922). Played for SC Red Star Strasbourg (1921–23). A member of the French Resistance in the war, he was arrested and executed by fleeing German troops in Paris on 24 August 1944 aged 48.\n* Rino Della Negra – played for Red Star Olympique (1942–43) during German occupation. A French Resistance member, he was wounded and captured during an attack in 1943 and was executed by firing squad at Fort Mont-Valérien on 21 February 1944 aged 20.\n* Émilien Devic – qualified to compete at the 1912 Olympics but the team withdrew, and in the national team (1911–21). A French resistance member, he was executed by German forces by firing squad on 21 August 1944 aged 55.\n* Victor Farvacques – left winger who appeared in the national team once, against Ireland (1928). Played for US Tourcoing (1927–28). An infantryman in the French Army, he was killed in action during the Battle of France at Gravelines on 25 April 1940 aged 37.\n* Noël Liétaer – midfielder who appeared 7 times with France national team, including 1934 FIFA World Cup. Played for US Tourcoing and Excelsior AC Roubaix. An infantryman in the French Army, he died of illness when prisoner of war in Rostock, Germany on 21 February 1941 aged 32.\n* Eugène Maës – striker who appeared in the national team (1911–13). Played for Red Star A.C. (1910–14) and Caen (1919–30). A civilian in the war, he was deported to Germany after being denounced to the Gestapo for anti-German remarks in 1943 and died at Dora-Mittelbau concentration camp on 30 March 1945 aged 54.\n* Jacques Mairesse – a defender who appeared in the national team (1927–34) including 1934 FIFA World Cup. Played for FC Cette (1926–27), FC Sete (1927–32), Red Star (1932–35), AS Villeurbanne (1935–36) and Strasbourg (1937–39). A soldier in a train repair group of the French Army, he was killed in action during the Battle of France at Veron on 13 June 1940 aged 35.\n* Maurice Thédié – in the national team (1925). Played for Red Star Amical Club (1921–22) and Amiens A.C. (1922–25). A French Resistance member, he was deported by the occupation authorities to Dachau concentration camp, Germany, but died on train en route at Puteaux, France, on 2 July 1944 aged 48.\n* Alexandre Villaplane – midfielder; competed internationally at the 1928 Summer Olympics, in the France men's national football team (1926–30) at the first match of the FIFA World Cup. Played for FC Sete (1921–24), Nimes (1927–29), RC Paris (1929–32), FC Antibes (1932–33), Nice (1933–34) and Hispano-Bastidienne (1934–35). During the war he collaborated in anti-resistant activities with Vichy and Nazi German authorities, the latter appointing him a SS-Untersturmführer (second lieutenant) and granting him German nationality. After the Liberation, he was arrested as a collaborator and executed by firing squad at Arcueil, for direct involvement in at least 10 killings, on 26 December 1944 aged 40.\nGermany\n* Willi Arlt – national team (1939–42). Played for Riesaer SV (1937–42). An Unteroffizier (sergeant) in the German Army, he survived the war but died in Soviet prisoner of war camp in Karachev, Russia on 27 July 1947 aged 27.\n* Karl Auer – German international footballer (1924–26). Played for SpVgg Fürth (1917–30) and Würzburger FV (1930–31). A police sergeant-major in the German army, he was killed in action on the Eastern Front on 22 February 1945 aged 41.\n* Walter Berg – German international footballer (1938). Played for SV Kray 04 to 1935, Schalke 04 (1935–39 and 1940–44) and Hamburger SV (1940). A Gefreiter (private) in the German army, he survived the war but died a prisoner of war after being captured by Soviet forces in Milin, Czechoslovakia, on 12 May 1949 aged 33.\n* Walter Claus-Oehler – German international footballer (1923). Played for Arminia Bielefeld (1918–35). A Hauptmann (captain) in the German army, he died on active service at Rennes, France, on 14 December 1941 aged 44.\n* Jakob Eckert – in reserve member at the 1936 Summer Olympics. German international footballer (1937). Played for Wormatia Worms. A private in the German army, he died in action in the Battle of France at Villers-Carbonnel on 5 June 1940 aged 23.\n* Georg Frank – German national footballer (1927–30). Played for SpVgg Fürth (1926–44). A corporal in the German army, he was killed in action at Skarzysko-Kamienna, Poland, on 13 November 1944 aged 36.\n* Hermann Gramlich – German national footballer (1934). Played in FC 08 Villingen. A corporal in the German Army, he died in action on the Eastern Front in Bardino, Russia, on 6 February 1942 aged 28.\n* Julius Hirsch – competed internationally at the 1912 Summer Olympics, in the national team (in 1911) – its first Jewish player. Player and coach for Karlsruher FV until 1943 was made to resign under Nazi regime. Deported 2 March 1943 when aged 50 to Auschwitz concentration camp where he was legally declared to have died on 8 May 1945, although it is alternatively believed he may have been gassed on arrival.\n* Friedel Holz – German international footballer (1938). Played for Duisburg 99. A corporal in the German army, he was killed in action in the Battle of Crete on 20 May 1941 aged 22.\n* Adolf Jäger – competed internationally at the 1912 Summer Olympics, and an international footballer (1908–24). A civilian in the war, he was killed after an air raid while on bomb disposal work in Hamburg on 21 November 1944 aged 55.\n* Johannes Jakobs – German international footballer (1939). Played for Hannover 96. An Oberfeldwebel in the Luftwaffe, he was killed as a pilot on a reconnaissance flight on the Eastern Front in Poland on 24 August 1944 aged 27.\n* Werner Klaas – German international footballer (1935). Played for Militar SV Koblenz. An Oberleutnant (senior lieutenant) in the German army, he was killed in action in Czechoslovakia between 30 March and 3 April 1945 aged 30.\n* August Klingler – German international footballer (1942), scored three goals in Germany's final international during World War II in November 1942, killed on the Eastern Front 23 November 1944 aged 26.\n* Georg Köhl – German international footballer (1937). Played for 1.FC Nürnberg. A soldier in the German army, he died in hospital in Kraków, Poland, from wounds received in action on the Eastern Front on 15 January 1944 aged 33.\n* Hans Lang – German international footballer (1922–26). Played for BC Augsburg (1920–21), SpVgg Fürth (1921–23) and Hamburger SV (1924–30) which he managed in 1935–39. An Oberfeldwebel in the Luftwaffe, he died from a heart attack at Aalborg Air Base, Denmark, on 27 April 1943 aged 44.\n* Ludwig Leinberger – competed internationally at the 1928 Summer Olympics and in the national team (1927–33). Competed domestically in: SpVg Fürth (1925–33) and Kölner CfR (1933–36). Inducted into German army in 1941, he died after appendicitis surgery at a military hospital in Bad Pyrmont, Germany, on 3 March 1943 aged 39.\n* Richard Malik – German international footballer (1932–33). Played for Beuthener SuSV 09. Drafted in the German army he was reported killed at unknown place on the Eastern Front on 20 January 1945 aged 35.\n* Hugo Mantel – German international footballer (1927–33). Played for Dresdner SC (1925–28), Eintracht Frankfurt (1928–38) and Frankfurter Germania (1938–42). A private in the German army, he died on the Eastern Front at Berdychiv, Ukraine, on 11 February 1942 aged 34.\n* Hans Mengel – German international footballer (1938). Played for TuRU Düsseldorf. A soldier in the German army, he was reported missing in action on the Eastern Front in Russia on 1 January 1943 aged 25.\n* Rudolf Noack – striker who was German international footballer (1934–37), notably in 1934 FIFA World Cup. Played for Hamburger SV (1931–45). A corporal in a German Army anti-aircraft unit, he was captured by Soviet forces in Bohemia in 1945 and died in captivity at POW camp at Rakitianka near Orsk, Russia, on about 30 June 1947 aged 34.\n* Alfred Picard – German international footballer (1939). Played for TSG Ulm 1846. A lieutenant in the German army, he was killed in action in Cloppenburg, Germany, on 12 April 1945 aged 32.\n* Ludwig Schmitt – played for Eintracht Frankfurt (1930–38). Died in Soviet captivity on the Eastern Front after 1941.\n* Helmut Sievert – German international footballer (1936). Played for Hannover 96 (1932–41) and Eintracht Braunschweig (1943–44). A sergeant in the German army, he died serving at Benešov, Czechoslovakia, on 28 March 1945 aged 30.\n* Heinrich Sonnrein – goalkeeper who was German international footballer (1935–36). Played for FC Hanau 93 (1930–42). A lieutenant in the German army, he was killed in Italy at the Battle of Monte Cassino on 3 February 1944 aged 32.\n* Wolfgang Strobel – German international footballer (1922–24). Played for 1. FC Nürnberg (1917–30). A civilian in the war who served as an auxiliary policeman, he was shot dead by invading American troops at Bad Kreuznach, Germany, on 19 April 1945 aged 48.\n* Willi Tiefel – German international footballer (1935–36). Played for Eintracht Frankfurt (1932–36), Berliner SV (1936–40) and BSC Brandenburg (1940–41). A private in the German army, he died serving on the Eastern Front at Narva, Estonia, on 28 August 1941 aged 30.\n* Adolf Urban – competed internationally at the 1936 Summer Olympics, and international footballer (1935–41). Played for Schalke 04. An infantryman in the German army, he died of wounds on the Eastern Front at Staraya Russa, Russia, on 23 May 1943 aged 29.\n* Werner Widmayer – German international footballer (1931). Played for Holstein Kiel. A first lieutenant in the German army, he died serving on the Eastern Front in Semenivka, Ukraine, on 19 June 1942 aged 33.\n* Willi Wigold – German international footballer (1932–34). Played for Fortuna Dusseldorf, in the team which won the 1933 German football championship. A corporal in the Germany army, he died serving on the Eastern Front on 28 November 1944 aged 34.\n* Carl Zörner – German international footballer (1923). Played for SC 99 Köln. A Hauptmann (captain) in the German army, he died serving on the Eastern Front in Vyazma, Russia, on 12 October 1941 aged 46.\nGreat Britain\n* Reg Anderson – An England international in 1938–39. Played for Dulwich Hamlet (1934–1938 and 1939–1940) and Cardiff City (1938–1939). A sergeant in the Royal Air Force (RAF), he died when his bomber was shot down by flak during a mine-laying operation over the Heligoland Bight on 24 February 1942 aged 25.\n* Matthew Armstrong – played for Darlington (1936–1939) and before enlistment for Aston Villa. Died during service as private with Royal Army Medical Corps in the Middle East on 12 July 1941 aged 22.\n* Claude Ashton – an England international team captain in one match, against Northern Ireland (1925). An amateur who played in various positions for Corinthians. A squadron leader in the Auxiliary Air Force, he was killed in a mid-air collision on training flight near Caernarfon, Wales on 31 October 1942 aged 41.\n* Brian Atkins – played as youth for Everton before being posted overseas as he was selected for first team. A leading aircraftsman in the RAF Regiment, he died while serving at Portello, Italy, on 22 April 1944 aged 22.\n* Arthur Bacon – played for Chesterfield (1923–25 and 1932–33), Derby County (1925–27), Manchester City (1927–28), Reading (1928–32), Coventry City (1933–35) and Burton Town. A civilian during the war, reportedly a Special Constable and fireman, he was killed during an air raid in Derby on 27 July 1942 aged 37.\n* Hiley Bamsey – played for Exeter City (1935–1938). A sergeant in the Royal Electrical and Mechanical Engineers, he was killed in Iraq on 31 December 1943 aged 27.\n* Arthur Baxter – played for Barnsley (1938–1939). Died serving as private with the London Scottish of the Gordon Highlanders in the Battle of Rimini in Italy on 5 September 1944 aged 32.\n* Albert Bonass – played for Darlington (1932–33), York City (1933–34), Hartlepools United (1934–36), Chesterfield (1936–39) and Queen's Park Rangers (1939–45). He survived the war, in which he served as a Metropolitan Police War Reservist and a sergeant in the Royal Air Force Volunteer Reserve (RAFVR), but was killed on a training flight when his Short Stirling bomber crashed at Tockwith, Yorkshire, on 9 October 1945 aged 34.\n* Billy Bryan – played for Swindon Town (1936–1938) and Wrexham (1939–40). Died during the Battle of Normandy on 2 August 1944 aged 31 when serving as a private in the Dorsetshire Regiment.\n* George Bullock – played for Barnsley (1936–1940). Died in a road accident near Appleton, Cheshire while serving as naval airman in the Fleet Air Arm on 31 May 1943 aged 27.\n* Alec Campbell – played for Southampton (1919–1926), manager of Chesterfield (1927). Died of pneumonia in Portsmouth while serving as a second lieutenant in the Royal Artillery on 16 June 1943 aged 53.\n* Leslie Cant – goalkeeper who played in the Football League for Bury (1933–34), Stockport County and Southport (both 1934–35). A lance-corporal in the Durham Light Infantry, he was killed in an explosion during the North African campaign in Tunisia on 19 January 1943 aged 35.\n* Joe Carr – played for Sheffield United (1937–1940). Killed during the Battle of Dunkirk serving as gunner with the Royal Artillery on 31 May 1940 aged 21.\n* Norman Catlin – played for Southampton (1935–1937). A Royal Navy seaman, he lost his life in the controversial sinking of  off the coast of Crete on 22 May 1941 aged 23.\n* William Chalmers – played for Bournemouth & Boscombe Athletic (1932–1938). Died accidentally at Grimsby while serving as a gunner in the Royal Artillery on 7 October 1943 aged 31.\n* Charlie Clark – played for Queens Park Rangers (1935–1938). Clark died of wounds during the Tunisian campaign on 1 March 1943 aged 27 when serving as lance sergeant in the Hampshire Regiment.\n* Albert Clarke – played for Blackburn Rovers (1938–1944). Killed in France on 16 June 1944 aged 27 when serving as private in the Devonshire Regiment.\n* David Clyne – played for Queen's Park (1937–1939) in the Scottish League. A flight sergeant in the RAFVR, he was killed in a training accident whilst piloting a Catalina flying boat at Vatersay, Scotland, on 12 May 1944 aged 27.\n* Joe Coen – played for Celtic (1931–32) and Luton Town (1934–1939). A leading aircraftsman in the RAF, he died on 15 October 1941 aged 34, in a mid-air collision on a training accident at RAF Cranwell.\n* Tom Cooper – England international, making 15 appearances between 1927 and 1934. Played for Port Vale (1924–1926), Derby County (1926–1934) and Liverpool (1934–1940). Died serving the Corps of Military Police in England on 25 June 1940 aged 36 after his motorcycle struck a lorry.\n* Haydn Dackins – played for Swansea Town (1934–1935) and Port Vale (1935–1936). He was killed in action in Sicily on 2 August 1943 aged 31, when serving in the Royal Inniskilling Fusiliers.\n* Bobby Daniel – played for Arsenal but never made a first-team appearance. Served as flight sergeant in the RAFVR, disappeared in action on a bombing raid over Berlin on 24 December 1943.\n* Ernie Davies – played for Tranmere Rovers (1936–1940). Died off North Africa serving as corporal in the King's Own Royal Regiment (Lancaster) on 17 August 1942 aged 36, when his troopship S.S. Princess Marguerite was torpedoed en route to Cyprus.\n* Bill Dean – played for Arsenal (1940–1941). A stoker in the Royal Navy, he was killed in the sinking of his ship, HMS Naiad south of Crete on 11 March 1942.\n* Stanley Docking – played for Newcastle United (1934–1938). Died accidentally whilst serving as an aircraftman in the RAFVR on 27 May 1940 aged 25.\n* Joe Donnachie (junior) – played for Everton, Bolton Wanderers and Chester City before enlistment. Killed in aircraft accident while serving as sergeant in the RAFVR on 12 October 1944 aged 32.\n* Tom Douglas – played for Blackpool (1931–1933) and Burnley (1933–1936). Died on active service in French Algeria serving as a sapper in the Royal Engineers on 6 March 1943 aged 32.\n* Andy Ducat – England international six times between 1910 and 1920. Played for Southend United (1903–05), Arsenal (1905–12), Aston Villa (1912–21) which he captained to an FA Cup win in 1920, and Fulham (1921–24) of which he became manager in 1924–26. He served in the Surrey Home Guard during the war and died of a heart attack batting in an inter-unit cricket match against Sussex's Home Guard at Lord's Cricket Ground on 23 July 1942 aged 56.\n* Stan Duff – played for Tranmere Rovers (1937–1938). Died in a training accident while serving as leading aircraftman with the RAFVR on 9 September 1941 aged 22.\n* Tom Farrage – played for Birmingham (1937–1944). Killed serving with the Parachute Regiment during the Battle of Arnhem on 23 September 1944 aged 26.\n* David Fenner – played for Airdrieonians (1938–1939) in the Scottish League. A flying officer with the RAF, he was killed on 25 February 1945 aged 31 when his bomber crashed in the Netherlands.\n* Fred Fisher – A wartime England international in 1941. Played for Millwall (1938–1944). A sergeant air gunner with the RAFVR, he was killed when his bomber was shot down by a night fighter over France on 26 July 1944 aged 34.\n* Ivan Flowers – played for Mansfield Town (1938–1940). Killed in action during the Battle of Normandy on 8 July 1944 while serving as a sergeant in the Royal Norfolk Regiment aged 25.\n* Alan Fowler – played for Swindon Town. A sergeant PT Instructor with the Dorsetshire Regiment he was killed in action shortly after D-day on 10 July 1944 aged 32.\n* Hugh Glass – played for Arsenal (1938–1939). A Merchant Navy seaman, he was killed when his ship was torpedoed on 26 November 1942 aged 23.\n* Robert Gordon – played for Huddersfield Town (1937–1939). Died on 18 September 1940 of pulmonary tuberculosis while serving as leading aircraftman in the RAF.\n* Harry Goslin – played for Bolton Wanderers (1930–1939). Served with the Bolton Artillery, rising to Lieutenant and being awarded MC. Mortally wounded in action in Italy and died 18 December 1943 aged 34.\n* George Groves – played for Sheffield United (1891–1896). A civilian during the war, Groves was killed during the Blitz at Newmarket, Suffolk, on 18 February 1941, aged 72.\n* Sid Gueran – played for Southampton (1936–1938). He was killed serving with the Royal Engineers' 1st Parachute Squadron in action in the Battle of Arnhem on 18 September 1944 aged 27.\n* Ernest Hall – played for Newcastle United (1935–1936) and Brighton & Hove Albion (1937–1938). A pilot officer in the RAFVR, he was killed serving as a Vickers Wellington bomber pilot in raid on St Polten, Austria, on 7 July 1944 aged 27.\n* Harry Hampson – played for Southport (1936–1938) and Sheffield United (1938–1940). Died in England of septicaemia serving with the Royal Armoured Corps as a corporal on 24 June 1942 aged 24.\n* George Handley – played for Crystal Palace (1934–1935). Died during the invasion of Sicily while serving as lance corporal with the South Staffordshire Regiment on 9 July 1943 aged 31.\n* Dennis Higgins – played for Fulham (1935–39). He was killed in action in North Africa on 25 September 1942 aged 26 serving with the Durham Light Infantry.\n* Alex Highet – played for Queen's Park (1938) in the Scottish League. A Royal Naval Volunteer Reserve seaman, he was killed when his ship was mined in the English Channel on 14 October 1940 aged 26.\n* Willie Imrie – a Scottish international in 1929, he played for Blackburn Rovers (1929–1934) and Newcastle United (1933–1938). Died of cancer, whilst serving as a corporal with the RAF, in hospital at Windygates, Fife, on 26 December 1944 aged 36.\n* Bill Isaac – played for Brighton & Hove Albion (1939–1940). Died of meningitis on 14 April 1941 aged 22 while serving as a bombardier with the Royal Artillery.\n* Alex Jackson – Scotland football international 1925–30. Played for Huddersfield Town (1925–1930) and Chelsea (1930–1932). He survived the war, but was killed in a road incident in Egypt on 15 November 1946 aged 41 while serving as a major in the Royal Pioneer Corps.\n* Sam Jennings – played for several clubs, including Reading (1921–1924), Brighton & Hove Albion (1925–1928) and Port Vale (1929–1931), and was manager at Rochdale (1937–1938). Died while serving on 26 August 1944, aged 45.\n* Alex Johnson – played for Norwich City (1938–1939). Killed in an aviation accident in Oman on 31 July 1944 aged 26, whilst serving as corporal in the RAFVR.\n* George Jordan – played for Cowdenbeath (1938–1940) in the Scottish League. Killed during the Western Allied invasion of France on 8 July 1944 aged 27 while serving with the Black Watch.\n* Jack Kearns – played as full back for Wolverhampton Wanderers (1936–37), Millwall (1937–38) and Tranmere Rovers (1938–39). Died while serving in England as bombardier in the Royal Artillery on 14 February 1945 aged 31.\n* Alfred Keeling – played for Bradford (Park Avenue) (1937–1939). A sergeant in the RAFVR, he was shot down and killed over the Bay of Biscay on 1 December 1942 aged 21.\n* Leslie Lack – played for Arsenal but never made a first-team appearance. Served as sergeant in the RAF, killed by friendly fire while returning from a mission in his Spitfire on 18 March 1943 aged 22.\n* Frank McEwan – played for Airdrieonians in the Scottish League (1935–38), and Tottenham Hotspur (1938–44). A rifleman in the Rifle Brigade, he died of wounds near Donk, Belgium, on 21 September 1944 aged 29.\n* Les Milner – played for York City (1937–1939). Killed serving as sergeant in the Seaforth Highlanders near Bayeux on 25 June 1944 aged 26.\n* Fred Mills – played for Port Vale (1932–1934) and Leeds United (1934–1939). Killed by an explosive device at Blerick, Holland, while serving as gunner with the Royal Artillery on 5 December 1944,aged 34.\n* Peter Monaghan – played for Bournemouth & Boscombe Athletic (1937–1940). Killed in the Netherlands on 21 January 1945 aged 27, whilst serving as a private with the Highland Light Infantry.\n* Jimmy Morgan – played for Hamilton Academical (1932–1941) in the Scottish League. Killed in a plane crash, while serving as flight lieutenant in the RAFVR, in the North Atlantic Ocean off Trevose Head, Cornwall, on 31 July 1944 aged 32.\n* David Murphy – played for Middlesbrough (1937–1939). Killed in Italy on 19 September 1944 aged 27 while serving as a gunner in the Royal Artillery.\n* Jim Olney – played for Birmingham (1936–1938) and Swindon Town (1938–44). Killed in Belgium on 14 September 1944 aged 30 while serving as lance sergeant in the Coldstream Guards.\n* William Parr – played for Arsenal (1940). Died in an aircraft crash near RAF St Mawgan training as a sergeant with the RAFVR on 8 March 1942 aged 26.\n* Alfred Penlington – played for Everton (1940–1941). A sergeant in the RAFVR, he was lost when his Vickers Wellington was shot down over the Mediterranean Sea on 18 April 1943 aged 23.\n* Colin Perry – played for Nottingham Forest (1939–1940). Died at Tobruk on 28 November 1942 aged 26 when serving as driver with Royal Army Service Corps.\n* Albert Potter – played for Exeter City (1922–27), Wigan Borough (1927–29) and Colwyn Bay United (1929–30). A civilian during the war, served as an Air Raid Warden when killed in the Exeter Blitz on 4 May 1942 aged 44.\n* Albert Powell – played for Swindon Town (1928–1929) and Coventry City (1929–30). Died on active service in the UK as gunner with the Royal Artillery on 23 October 1940 aged 32.\n* Sidney Pugh – played for Arsenal (1938–1944). Killed in a flying accident training as flying officer in the RAF at Seighford, Staffordshire, on 15 April 1944 aged 24.\n* Henry Race – played for Nottingham Forest (1933–1937). Killed at El Alamein in North Africa as a corporal with the Queen's Own Cameron Highlanders on 24 October 1942 aged 36.\n* Hubert Redwood – played for Manchester United (1933–1940). Died on 28 October 1943 of tuberculosis, aged 30, while serving as corporal with the South Lancashire Regiment.\n* William Reid – reserve goalkeeper for Everton. A lance corporal in the Black Watch, he was killed when ship transporting him was sunk off Greece on 30 May 1941 aged 22.\n* Frederick Riley – competed internationally at the 1936 Summer Olympics for Great Britain. Amateur who played for Casuals. Shot down and killed serving as flight lieutenant in the RAF over Desvres, France, on 7 December 1942 aged 30.\n* Gerald Roberts – Full-back who played for Tranmere Rovers (1932–33). Killed in the Battle of Normandy on 16 July 1944 aged 36, when serving as a serjeant with 144th Regiment Royal Armoured Corps (formerly 8th Battalion East Lancashire Regiment).\n* Grenville Roberts – played for Nottingham Forest (1937–1939). Died of wounds serving with the West Yorkshire Regiment at Dunkirk on 3 June 1940 aged 20.\n* Herbie Roberts – onetime England international against Wales (1931). Played for Arsenal (1926–1937). He died of erysipelas on 17 June 1944 aged 39, while on active duty as lieutenant with the Royal Fusiliers.\n* Eric Robinson – played for York City (1940–1941) and Wolverhampton Wanderers (1941–1942). Drowned during a training exercise on the River Derwent, Yorkshire while serving with the East Lancashire Regiment on 20 August 1942 aged 23.\n* Tom Robson – played for Everton (1929–1930) and Northampton Town (1934–1937). Died of a heart condition serving as a leading aircraftman in the RAFVR on 10 April 1942 aged 34.\n* Joe Rooney – played for Wolverhampton Wanderers (1938–39). Served as private in the Gloucestershire Regiment, he was killed during the Belfast Blitz on 5 May 1941 aged 24.\n* Henry Salmon – played for Stoke City (1932–33), Millwall (1933–34), Southport (1936–37) and before enlistment for Shrewsbury Town. Killed during the Battle for Caen serving as sergeant in the Royal Warwickshire Regiment on 30 July 1944 aged 34.\n* George Salvidge – played for Hull City (1938–1940). A lance-corporal in the York and Lancaster Regiment, Salvidge was killed in action near Tobruk on 23 November 1941 aged 21.\n* Percy Saunders – played for Sunderland (1937–1939) and Brentford (1939). A sergeant in the Royal Army Ordnance Corps, he was killed when his ship was torpedoed in the Indian Ocean on 2/3 March 1942 aged 25.\n* George Scott – played for Aberdeen (1936-1939) in the Scottish League. A sergeant and air gunner in the RAF, he was killed in an air accident when his plane crashed into Dornoch Firth on 26 July 1942 aged 27.\n* Wilf Shaw – played for Doncaster Rovers (1930–1944). Killed in Operation Veritable on 20 February 1945 aged 32 when serving with the Argyll and Sutherland Highlanders.\n* Ralph Shields – played for Huddersfield Town (1914–1920). A member of the Second Australian Imperial Force as private in the Australian Army Service Corps, Shields was taken prisoner by the Japanese and died at the Sandakan POW camp on 21 November 1944 aged 52.\n* Walter Sidebottom – played for Bolton Wanderers (1939–1941). Killed serving as an able seaman on board  when the ship was sunk off France on 23 October 1943 aged 22.\n* Charlie Sillett – played for Southampton (1931–1938). He was killed in a U-boat attack off Lizard Point while on an allied convoy while serving as able seaman with the Royal Navy on 27 February 1945 aged 38.\n* Allan Sliman – played for Bristol City (1932–1938) and player-manager of Chelmsford City (1938–40). A RAF flight engineer, he died at Ely, Cambridgeshire of wounds received on air bomber operations on 14 April 1945 aged 39.\n* Walter Spratt – played for Brentford (1911–1915 and 1920–1921) and Manchester United (1915–20). A civilian during the war, he was killed by a V-2 rocket in Southwark, London, on 22 January 1945 aged 54.\n* Eric Stephenson – England international player in 1938. Played for Leeds United (1935–1941). Killed in British Burma on 8 September 1944 aged 29 as a Major in the British Indian Army's 2nd Gurkha Rifles.\n* William Sumner – played for Everton (1940–41) before enlistment. A pilot officer in the RAFVR, he was killed in a flying accident at Trichinopoly, India on 22 May 1944 aged 21.\n* Benny Thomson – played for Kilmarnock (1934–1939) in the Scottish League. A Merchant Navy seaman, he was killed when his ship was sunk by German aircraft in the North Atlantic on 12 November 1940 aged 27.\n* John Thomson – played for Hamilton Academical (1932–1941) in the Scottish League. Died in Normandy serving as a private in the Seaforth Highlanders on 30 July 1944 aged 28.\n* Jimmy Tompkins – played for Fulham (1934–1939). A Major in the Royal Fusiliers, he was killed during Normandy campaign on 10 July 1944 aged 30 when attached to Hampshire Regiment.\n* Sandy Torrance – played for Bristol City (1921–28) and Bath City. A civilian in the war who served as a Fire Guard, he died from air raid injuries in Bedminster, Bristol on 14 April 1941 aged 39.\n* Ernie Tuckett – played for Arsenal (1932–1937) and Fulham (1938–45). Killed in an aircraft accident serving as corporal in the RAF on 27 May 1945 aged 31.\n* Edwin Watson – played for Huddersfield Town (1937–1938). A flight sergeant in the RAF, he was killed when his Short Sunderland flying boat was shot down during an anti-submarine sweep in the Bay of Biscay on 12 June 1944 aged 30.\n* Jack Watson – played as centre-back in the Football League for Tranmere Rovers (1933–36). Killed in action serving as a captain in the Royal Artillery on the Gothic Line in Italy on 9 September 1944 aged 32.\n* Walter Webster – played for Rochdale and Barrow. Killed in Tunisia serving as a private with the Parachute Regiment on 17 November 1942 aged 36.\n* David Willacy – played for Preston North End (1938–1939). Killed in a training accident serving as sergeant with the RAFVR on 1 September 1941 aged 25.\n* Bob Wrigglesworth – played for Chesterfield Amateurs (1935). A flight sergeant with the RAFVR, he died of hypothermia after his bomber was shot down over the Aegean Sea on 23 January 1943 aged 24.\nGreece\n* Spyros Kontoulis – appeared for the national team (1938). Played for AEK Athens (1935–44). A wounded Hellenic Army veteran of the Greco-Italian War, who continued to play under the Axis occupation, he was killed by German troops when attempting escape in Athens from a prison truck taking him to Kaisariani in June 1944 aged 28 or 29.\n* Mimis Pierrakos – appeared for the national team (1931–38). Played for Panathinaikos (1926–33 and 1936–40) and Cyprus team Anarthosis Famagusta (1933–36). An infantry radio operator in the Hellenic Army, he was killed in action against the Royal Italian Army near Pogradetsh in North Epirus, Greece, in November 1940 aged 32.\n* Nikos Sotiriadis – goalkeeper who appeared in the national tam in 1938 FIFA World Cup qualifying match against Mandatory Palestine. Played for PAOK F.C. (1932–40). An infantry sergeant in the Hellenic Army, he was killed in action against the Italians in the Capture of Klisura Pass on 28 January 1941 aged 33.\nHungary\n* József Braun (aka Barna) – competed internationally at the 1924 Summer Olympics and a Jewish player in the national team (1918–26). Played for MTK Budapest (1916–25) and, in United States, for Brooklyn Hakoah (1929) and Brooklyn Wanderers (1929–30). Later manager for ŠK Slovan Bratislava between 1934 and 1938 and MTK Hungaria (1938). Conscripted into forced labour in support of the Hungarian Army, he was killed in Nazi forced labour camp in Kharkiv, Ukraine, 20 February 1943 aged 41.\n* Sándor Bródy – Jewish member of the national team (1906–13). Played for Ferencváros (1902–14), which he managed in 1937, and first manager of Swedish club IFK Göteborg (1921–23). Killed in roundup of Jews following German occupation of Hungary on 19 April 1944 aged 59.\n* Géza Kertész – player in national team (1914). Played for Ferencváros before becoming manager of a series of Italian clubs ultimately A.S. Roma (1942–43) and Hungarian team Újpest (1943–44). Recalled from Italy for service as lieutenant-colonel in the Royal Hungarian Army in 1943, he ran a clandestine resistance network aided by the American secret service that rescued many Hungarian partisans and Jews from deportation to Nazi concentration camps during the German occupation and Arrow Cross rule. Denounced to Gestapo for sheltering Jews, he was executed at Budapest on 6 February 1945 aged 50.\n* Henrik Nádler – on reserve at the 1924 Summer Olympics, and a Jewish player in the national team (1924–26). Played for MTK Budapest (1919–30). After being made to do forced labour under the Nazis he died in Buchenwald concentration camp, Germany, on 12 May 1944 aged 43 (though other sources place it at Mauthausen concentration camp in 1945).\n* Imre Taussig – Jewish member of national team (1914–18). Played for MTK Budapest from 1907. Deported to Nazi labour camp at Bruck an der Leitha, Austria, where he was killed on 23 March 1945 aged 50.\n* István Tóth – striker in national  team (1909–28). Played for Ferencváros, which he managed (1926–38 and 1943). Also managed Újpest FC (1932–34) and Italian sides US Triestina (3 times between 1930 and 1939) and Inter Milan (1931–32). A reserve officer in the Hungarian army, he joined with Kertesz in the underground resistance and with him was arrested by Gestapo and executed by Arrow Cross troops on 6 February 1945 aged 53.\n* Antal Vágó (aka Weiss) – Jewish player in the national team (1908–17). Played in Fővárosi TC (1906–11) and MTK Budapest (1922–23). Killed in massacre of Jews shot in River Danube at Budapest during the German backed Arrow Cross rule on 30 December 1944 aged 53.\n* Árpád Weisz – member of national team (1922–23); played for Törekvés (1922–23), the Italian Alessandria (1924–25) and Inter Milan (1925–26); manager of latter (between 1926 and 1934) and ultimately Dutch Dordrecht (1938–40). Arrested by German SS, he and his family as Jews were deported to Auschwitz concentration camp where they were gassed on 31 January 1944 aged 47.\n* Ferenc Weisz – member of national team (1903–17); played for Ferencváros (1902–20) and manager of Újpest (1920–22). He and his wife as Jews were deported to Auschwitz concentration camp where he died on 8 July 1944 aged 59.\nIndonesia (Netherlands East Indies to 1945)\n* Suwu Lontoh – player in the national team at the 1934 Far Eastern Championship Games. Serving with the Royal Netherlands East Indies Army, he was captured by the Japanese in 1942 and died a prisoner of war at Port Timor on 4 January 1945 aged 36.\n* Frans Alfred Meeng – player in the national team at the 1938 FIFA World Cup and for club SVVB Batavia. During the war as a corporal of the Royal Netherlands Marine Corps he was taken prisoner of war by the Japanese. He was lost at sea when transported on the Japanese vessel Jun'yo Maru; torpedoed by British submarine HMS Tradewind on 18 September 1944 aged 34.\nItaly\n* Giuseppe Baldi – played as goalkeeper for Reggiana 1919 (1924–29) and Foggia 1920 (1930–35). Accused of withholding money from resistance fighters, he was executed by anti-fascist partisans at Reggio Emilia on 29 January 1945 aged 29.\n* Luigi Barbesino – competed internationally at the 1912 Summer Olympics, in the national team (1912–14). Played for Casale (1912–20) and managed Roma (1934–38). A major in the Regia Aeronautica, he was posted missing on a reconnaissance flight in the Mediterranean Sea on 20 April 1941 aged 46.\n* Carlo Castellani – played for Empoli (1926–30 and 1934–39) and Livorno and Viarezzio Calcio (both 1933–34). Died of dysentery at Gusen concentration camp, Austria, where he had been deported after turning himself in to the Gestapo to go in place of his anti-fascist father, on 11 August 1944 aged 35.\n* Armando Frigo – United States-born, he played for L.R. Vicenza (1934–39) and Fiorentina (1939–42). An infantry second lieutenant with the Royal Italian Army who joined with anti-German partisans following the Italian armistice, he was arrested and executed by German forces in Crkvice, Croatia on 10 September 1943 aged 26.\n* Rosolino Grignani – forward who played for Fanfull (1929–37). An anti-fascist resistance member, he died of wounds received when accosted by occupying German troops at Lodi, Lombardy on 27 April 1945 aged 36.\n* Bruno Neri – competed internationally in the national team (1936–37) and for clubs Faenza (1926–29 and 1940–44), Fiorentina (1929–36), Lucchese (1936–37) and Torino (1937–40). An anti-fascist who was actively involved in the Italian resistance movement, he was killed in an ambush by occupying German troops at Marradi on 10 July 1944 aged 33.\n* Federico Ferrari Orsi – played for Torino (1907). A general in the Royal Italian Army, he was killed by a landmine in Egypt before the Second Battle of El Alamein on 18 October 1942 aged 55.\n* Walter Petron – forward who played for Torino (1938–42) and Venezia (1942–43). Killed in Allied air raid on Padua on 21 March 1945 aged 26.\n* Vittorio Staccione – played for Torino (1923–27), Fiorentina (1927–31), and Cosenza (1931–34). An anti-fascist, he was arrested by the SS in March 1944 and died a year later in Mauthausen concentration camp on 16 March 1945 aged 40.\n* Pietro Tabor – played for Lucchese (1939–40), Bari (1940–41) and Liguria (1941–44). A civilian in the war, he was killed in an American air raid on Genoa on 29 July 1944 aged 25.\nJapan\n* Akira Matsunaga – competed internationally at the 1936 Summer Olympics, in the national team. Served in the Imperial Japanese Army as an infantry lieutenant and was killed in action at Guadalcanal, Solomon Islands on 20 January 1943 aged 28.\n* Naoemon Shimizu – in the national team (1923). Played for Hiroshima club Rijo Shukyu-Dan. A civilian in the war, he was killed in the atomic bombing of Hiroshima on 6 August 1945 aged 44.\n* Teizo Takeuchi – in the national team (1930–1936), represented Japan at the 1936 Summer Olympics. He served in the military and was detained by the Soviet Union following the war; he died in a prisoner of war camp on 12 April 1946 aged 37.\n* Tokutaro Ukon – in the national team (1934–1940), represented Japan at the 1936 Summer Olympics. Served in Imperial Japanese Army when killed in action at Bougainville Island, Papua New Guinea in March 1944 aged 30.\nLatvia\n* Kārlis Bone – competed internationally at the 1924 Summer Olympics and in the national team (1920–24). Deported by Soviet authorities following annexation of Latvia to Siberia where he died in prison camp at Sevurallag, Russia, on 13 November 1941 aged 42.\n* Adolfs Greble – competed internationally in the national team (1923–29). A civilian journalist and pre-war member of the fascist Perkonkrusts movement, he was deported by Soviet authorities to the Gulag in 1941 after being deemed 'socially dangerous', and died in prison camp at Vyatlaga, Russia, on 30 March 1943 aged 40.\n* Alfrēds Plade – In one match for national team (1923) and also in the 1924 Summer Olympics though did not play. During German occupation he joined the Latvian Auxiliary Police and was killed on the Eastern Front on 29 March 1944 aged 38.\n* Eriks Raisters – in the national team (1934–40). Played for JKS Riga (1931–33), RFK (1934–40), Dinamo Riga (1940) and Belorussia team Dynamo Minsk (1941). He was drafted into the Red Army and died of pneumonia in camp at Gorohovica, Russia, on 25 May 1942 aged 28.\n* Janis Rozitis – in the national team (1934–39). Played for RFK (1930–36) and VEF (1937–42). A civilian in the war, he was killed in an accidental explosion when removing German Army munitions from storage on VEF's ground in Riga on 3 May 1942 aged 29.\n* Aleksandrs Stankus – in the national team (1930–37). Played for Liepaja Olympia (1926–36) and Riga ASK (1937–38). Missing in action serving with the Latvian Legion of the German Waffen SS on the Eastern Front in Dzukste, Latvia, on 23 December 1944 aged 31.\nLithuania\n* Kestutis Bulota – a champion in multiple sports, he played for LFLS Kaunas in 1922–23 when he won the first two national football championships. He was deported following Soviet annexation of Lithuania to Siberia on 14 June 1941 when aged 44, subsequently being shot by sentry trying to escape from a Gulag camp.\n* Romualdas Marcinkus – appeared in the Lithuanian national team in 1927, later becoming the team's playing manager (1932 and 1935–37). Played for LFLS Kaunas while pursuing peacetime career in the Lithuanian Air Force. During 1940 he left Lithuania before the Soviet annexation of his country and served in the French Air Force before joining the British RAFVR, ultimately becoming Flight Lieutenant, being shot down and made prisoner of war in Germany in 1942.  While taking part in the Great Escape from the Stalag Luft III camp he was captured by the Gestapo at Danzig and shot nearby on 29 March 1944 aged 36.\nNetherlands\n* Henri Baaij – played for national team (1921) and HFC Haarlem. An infantry soldier in the Royal Netherlands East Indies Army, he died working on the Burma Railway as a Japanese prisoner on 31 May 1943 aged 42.\n* Rein Boomsma – played for national team (1905) and for Sparta (1894–1907). A colonel in the Royal Netherlands Army during the Battle of the Netherlands and a resistance leader, he was arrested by the Gestapo and transferred to Neuengamme concentration camp, Germany, where he died on 26 May 1943 aged 63.\n* Eddy de Neve – played for the national team (1905–1906) and HBS Craeyenhout. A civilian plantation worker in the Dutch East Indies, he died in an internment camp in Buitenzorg, Java on 30 August 1943 aged 58 or 61.\n* Piet Dumortier – played in one match as forward for the national team (1938). Played for VV DOS (1930–1944). A civilian in the war, he died during an Allied bombing raid in Utrecht, while hospitalised for diphtheria when the electric power was lost to his iron lung, on 5 April 1945 aged 29.\n* Jur Haak – played for the national team (1912) and HFC Haarlem. A civilian member of the Dutch resistance, he was deported to Sachsenhausen concentration camp, Germany, where he reportedly died of dysentery on 30 January 1945 aged 54.\n* Eddy Hamel – played for Amsterdamsche (1917–1922) and AFC Ajax (1922–1930) and manager of Alcmaria Victrix (1932–33). Arrested as a Jew and, in disregard of his U.S. nationality (through being born in New York City before his parents returned to Holland), deported in 1942 to Auschwitz concentration camp, where he was killed on 30 November 1943 aged 40.\n* Jan Herberts – played for SBV Vitesse. A resistance fighter, he was arrested after a failed attack on a German soldier in August 1944 and was executed at Herzogenbusch concentration camp on 3 September 1944 aged 18.\n* Harry Kuneman – played for the national team (1908) and for HBS Craeyenhout. A colonial administrator in the Dutch East Indies, he survived the war as prisoner of the Japanese but was still in an internment camp at Ambarawa, Java when he died on 7 September 1945 aged 59.\n* Piet Tekelenburg – played for the  national team (1919) and for HFC Haarlem. A reservist medical officer in the Royal Netherlands East Indies Army, he became prisoner of war of the Japanese and died in internment camp at Pangkal Pinang on Bangka Island, Indonesia, on 1 April 1945 aged 50.\n* Lothar van Gogh – played for the  national team (1907) and for HFC Haarlem. A civilian colonial administrator in the Dutch East Indies, he died in a Japanese internment camp in Cimahi on Java on 28 May 1945 aged 57.\n* Barend Van Hemert – played for Netherlands national team (1914) and goalkeeper for DFC Dordrechtse. He enlisted in the German army in 1941 during the German occupation of Holland and died serving in action at Warsaw, Poland, between 5 and 17 January 1945 aged 53.\nNew Zealand\n* Charles Ives – played for the national team (1933) and Port Chalmers. An infantry private and stretcher bearer in the Second New Zealand Expeditionary Force, he was killed in action during the Second Battle of El Alamein on 24 October 1942 aged 35.\nNorway\n* Sigurd Wathne – competed internationally at the 1920 Summer Olympics and played for SK Brann. A seaman in the Norwegian Merchant Navy in the war, he was wounded when his ship was sunk by German aircraft in British waters and died in hospital at Swansea, Wales on 26 March 1942 aged 44.\nPhilippines\n* Virgilio Lobregat – Filipino international footballer, who played for the Philippines at the 1925 Far Eastern Games. Was a guerilla and spy aligned with the Allies, and was beheaded after his capture by the Imperial Japanese soldiers at Manila on 30 August 1944 aged 43.\nPoland\n* Waclaw Adamowicz - goalkeeper who played for Polonia Warsaw (to 1924), Orkan Warsaw (1924-26) and Legia Warsaw (1927-35). A captain in the Polish Army, he was killed in the Battle of Kock on 2 October 1939 aged 34.\n* Telesfor Banaszkiewicz – forward who played for Pogon Poznan (1924–30) and Warta Poznan (1930–31 and 1935). A lieutenant of infantry in the Polish Army, he was captured in the Soviet invasion of Poland and was murdered by the NKVD at Katyn on 2 April 1940 aged 31.\n* Jan Drapala – goalkeeper who played one match with the national team (1926). Played for Czarni Lwow (1915–29) and Oldboye Lwow (1931–33). A civilian in the war, he was killed in an allied air raid at Johanngeorgenstadt, Germany, in late March/early April 1945 aged 45.\n* Marian Einbacher – Jewish player in the national team (1921). Played for Warta Poznań. Killed in Auschwitz concentration camp on 12 January 1943 aged 41.\n* Klemens Frankowski – forward who played for Legia Warsaw (1935–38). Served in the Polish Home Army during the war, for which he was executed by German occupation troops in Warsaw on 29 May 1943 aged 26.\n* Stefan Fryc – competed internationally at the 1924 Summer Olympics and Jewish player in the national team (1922–24). Played for Cracovia. Killed by the German SS in a mass execution in the Warsaw Ghetto on 9 November 1943 aged 49.\n* Tadeusz Gebethner – co-founder, first president and captain of Polonia Warsaw in which he played 1911–28. A cavalry captain serving with the underground Polish Home Army, he was captured after taking part in the Warsaw Uprising and died of wounds received in the action, while prisoner of war at Stalag-XI-A in Germany on 14 October 1944 aged 46. He was posthumously declared a Righteous Among The Nations for sheltering Jews at his home during the German occupation in Warsaw.\n* Józef Klotz – Jewish player in the national team (1922) when he scored Poland's first goal, against Sweden. Played for Jutrzenka Kraków (1910–25) and Makabi Warsaw (1925–30). Killed by the Germans in the Warsaw Ghetto, where he was confined, during 1941.\n* Adam Knioła – played in the national team (1931 and 1935). Played for Warta Poznan. Killed in Auschwitz concentration camp on 26 December 1942 aged 36.\n* Karol Kossok – played for national team (1928–32). Played for clubs including 1. FC Kattowitz, Cracovia (twice) and Pogoń Lwów, and after playing coached Cracovia and the national team. An ethnic German, he was drafted into the German Army in 1944 and survived the war but having been captured by the Red Army he died at a prisoner of war camp in eastern Germany on 11 March 1946 aged 39.\n* Tadeusz Kowalski – played for Czarni Lwów. An artillery captain in the Polish Army, he was arrested by the NKVD and executed at Kharkov during the Katyn massacre in April 1940 aged 45.\n* Władysław Kowalski  – played in the national team (1923–24). Played for Wisla Kraków. An infantry adjutant in the Polish Army, he was taken prisoner of war in the Soviet invasion of Poland and shot at Wołczatycze, Poland, on 21 September 1939 aged 42.\n* Antoni Lyko – played in the national team (1937–38) and for Wisła Kraków (1930–39). Involved with the Polish Armed Underground during German occupation of Poland, he was arrested by the Gestapo in Kraków and shot at Auschwitz concentration camp on 3 June 1941 aged 34.\n* Leonard Malik – played in the national team (1930). An ethnic German, during the war he collaborated with the German occupation, running a casino for Wehrmacht troops. He was arrested by the Polish People's Republic after the liberation of Poland on charge of being a Gestapo informant and died in a forced labour camp at Mysłowice, Poland, on 10 October 1945 aged 36.\n* Bronisław Makowski – played in the national team (1931). Played for Wisła Kraków (1927–31), Wilja Wilnius and Warszawianka Warszawa (1932–36). A member of the Polish underground resistance during the war he was arrested and executed by the Gestapo in Krakow on 25 May 1944 aged 39.\n* Adam Obrubański – played for Wisła Kraków and ŁKS Łódź, manager of the national team in the 1924 Summer Olympics, and later a referee. An officer in the Polish Army, he was arrested by the NKVD and executed in the Katyn massacre in April 1940 aged 47.\n* Stanisław Ptak – played in the national team (1927). Played for Cracovia. He disappeared following the Soviet invasion of Poland, believed killed by the NKVD when attempting to cross the border, in September 1939 aged 37.\n* Aleksander Pychowski – played in the national team (1925–26). Played for Cracovia (1922–25) and Wisla Kraków (1925–35). During the German occupation of Poland he worked with the underground resistance until he committed suicide to avoid expected arrest by the Gestapo in Kraków on 20 October 1943 aged 39.\n* Franciszek Sobkowiak – played in the national team (1938), and for Warta Poznań. A Polish and Royal Air Force Flight Sergeant, he was shot down over Norway on 30 October 1942 aged 28 returning from a S.O.E. flight to aid the Polish Home Army.\n* Leon Sperling – Jewish player in the national team (1921–30) at the 1924 Summer Olympics, and for Cracovia. Killed by the Gestapo in the Lviv Ghetto on 15 December 1941 aged 41.\n* Marian Spoida – played in the national team (1922–28), at the 1924 Summer Olympics, and was its coach in the 1938 FIFA World Cup. Played for Warta Poznań. Captured by the Soviets following annexation of east Poland in 1939, he was executed by NKVD in prison at Lviv during the Katyn massacre on 16 April 1940 aged 39.\n* Zygmunt Steuermann – Jewish player in the national team (1926–28). After his east Polish home town Sambor (which became part of Soviet territory in 1939) was occupied by the Germans following Operation Barbarossa, he was deported to the Lviv ghetto where he died in December 1941 aged 42.\n* Adolf Zimmer – played in the national team (1934). Played for Pogoń Lwów. A Lieutenant in the Polish Army, he was killed in the Katyn Massacre in May 1940 aged 32.\nRomania\n* Nicolae Honigsberg (aka Miklos Kinigli) – played in the national team (1922–24), including at 1924 Olympics. Played for Oradea (1921–25). Of Jewish-Hungarian ethnicity, he died a victim of the Holocaust at Mauthausen concentration camp, Austria, on 8 December 1944 aged 43.\n* Petre Sucitulescu – played in national team (1934–35). Played for Teisor Bucuresti (1932), Unirea Tricolor Bucuresti (1932–39), Olympia Bucuresti (1940) and Sportul Studențesc București (1941). Inducted in the Romanian army, he was killed in action on the Eastern Front at Dalnik, Ukraine, on 20 September 1941.\n* Petea Vâlcov – played in national team (1933–35). Played for Mihai Viteazul Chisinau (1924–30) and Venus Bucuresti (1930–41). Killed in action serving with the Romanian army on the Eastern Front in the Kalmyk Steppe, Russia, on 16 November 1943 aged 33.\nSoviet Union\n* Sergei Filippov – striker who appeared in 1912 Summer Olympics for the Russian Empire. Had career in series of St Petersburg/Leningrad clubs (1911–27). A civilian in the war, he died during the Siege of Leningrad in July 1942 aged 51.\n* Volodymyr Fomin – midfielder who played for the Soviet Union in unofficial matches during the 1920s and for Dynamo Kharkiv (1929–36), which he coached 1937–41, and also briefly managed Dynamo Kyiv in 1938. A civilian in the war, he was executed by occupying German troops in Kharkiv, Ukraine, for hiding a Jew, in spring of 1942\n* Pyotr Grigoryev – striker who appeared in the national team (1924–25) and was champion player of the RSFSR (1924) and USSR (1935). Played latterly for Elektrik Leningrad (1930–38). A civilian in the war, he died during the Siege of Leningrad on 13 November 1942 aged 43.\n* Olexi Klimenko – defender who played for Dynamo Kyiv and, during German occupation of Kyiv, in Start FC against German military teams, participating in the so-called Death Match in August 1942, following which he and other teammates were arrested by the Gestapo and imprisoned in Syrets concentration camp. He was executed in a reprisal shooting at the camp on 24 February 1943 aged 30.\n* Mykola Korotkykh - played with Dynamo Kyiv to 1939 then Rotfront and Start FC in the Death Match in August 1942. He was arrested after the match by the Gestapo after hiding, having been denounced as a pre-war NKVD officer, and died under torture in Kyiv in September 1942 aged 33.\n* Ivan Kuzmenko – striker who played for Dynamo Kyiv and the Start FC in the Death Match. Executed in same shooting as Klimenko on 24 February 1943 aged 30.\n* Dmitri Lagunov – defender who played in one match for the national team against Norway (1913). Played for series of St Petersburg/Leningrad clubs between 1911 and 1930. A civilian in the war he died during the siege of Leningrad on 10 February 1942 aged 53.\n* Nikolai Trusevich – goalkeeper for Dynamo Kyiv and Start FC in the Death Match. Executed in same shooting as Kuzmenko and Klimenko on 24 February 1943 aged 33.\n* Alexei Uversky – midfielder; competed internationally at the 1912 Summer Olympics for the Russian Empire. A civilian in the war, he died during the Siege of Leningrad in 1942, reportedly after being wounded on the frontline.\n* Vladimir Vonog – midfielder appeared in the national team (1923–25), was champion player of the RSFSR in 1924 and 1926–28 and Honoured Master of Sport of the USSR in 1931. Played for FC Spartak Leningrad (1922–28) and Krasny Putilovets (1925–35). A civilian in the war, he died during the Siege of Leningrad on 16 March 1942 aged 43.\n* Mikhail Yakovlev – midfielder and sometimes defender, who appeared in the 1912 Summer Olympics for the Russian Empire. A civilian in the war, he died during the Siege of Leningrad in 1942.\nYugoslavia\n* Svetozar Danic – a Croat player in the national teams of both Yugoslavia and the Ustase-led axis puppet Independent State of Croatia in 1940–41. Played for FK Slavija to 1934, FK Vojvodina (1934–36) and Gradanski Zagreb (1936–37 and 1939–41) besides the Czech SK Zidenice (1937–38) and FC Viktoria Plzen (1938–39). On returning from playing at a Croatia v Germany match in Vienna, he was arrested by the Ustase, sentenced to death on charge of collaborating with Communists, and executed at Zagreb on 18 June 1941 aged 24.\n* Ljubiša Đorđević – competed internationally at the 1928 Olympics. A supposed collaborator with Nazi Germany, having built bomb shelters, he was shot at Belgrade following the liberation of the city on 2 November 1944 aged 38.\n* Franjo Giler (aka Giller) – competed internationally at the 1928 Olympics and in the national team (1926–32). Played in clubs including Gradanski Zagreb (1925–31) and SK Jugoslavija Belgrade (1931–35). As a Volksdeutsche Croatian during the German occupation, he was conscripted into the German forces, attempted escape to join the Yugoslav Partisans, arrested by Gestapo and shot at Vrsac on 20 December 1943 aged 36.\n* Milutin Ivkovic – a Serb player in the national team (1925–34), appeared at 1928 Olympics. Played for SK Jugoslavija (1922–29) and BASK Belgrade (1929–34). A Communist who co-operated with the Partisans, he was executed at Banjica concentration camp near Belgrade for 'communist activities' on 25 May 1943 aged 37.\n* Dževdet Mustagrudić – a Montenegrin player for GSK Balsic Podgorica (1937–41) before the German invasion of Yugoslavia, and in Sarajevo-based NK Derzelez (1941–44) when it was under the Independent State of Croatia. When about to be signed up for HSK Gradanski Zagreb he absconded to join the underground Communist League and later the Yugoslav partisans, with whom he was fatally wounded in action in an attack on a German military bunker at Pazaric near Sarajevo in September 1944.\n* Emil Perska – a Croat player; competed internationally at the Olympic Games (1920, 1924 and 1928), in the national team (1920–27). Played for HSK Gradanski (1919–29). A civilian journalist in the war who allegedly supported the Ustase, he was shot at Zagreb by Yugoslav Partisans on 8 May 1945 aged 48.\n* Josip Solc (aka Scholz) – competed internationally at the 1920 Summer Olympics, in the national team (1920–23), and was a midfield player for HSK Concordia (1918–28).  A Croat officer in the Yugoslav Royal Army until 1940, he subsequently served through the war in the German-backed Croatian Home Guard, becoming an infantry general. He was captured by Yugoslav Partisans and executed in Belgrade as a Ustase war criminal on 24 September 1945 aged 47.\nReferences\nSee also\n* Association football during World War II"
    }
  ]
}