{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1846__disambig_1\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1846.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland). For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign. Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\".\nSome of these acts have a short title. Some of these acts have never had a short title. Some of these acts have a short title given to them by later acts, such as by the Short Titles Act 1896.\n9 & 10 Vict.\nThe sixth session of the 14th Parliament of the United Kingdom, which met from 22 January 1846 until 28 August 1846.\nPublic general acts\n}}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n| or the Trading Within Burghs Act 1846|public|17|14-05-1846|maintained=y|archived=n|An Act for the Abolition of the exclusive Privilege of trading in Burghs in Scotland.}}\n|  for regulating the Labour of Children, young Persons, and Women in Print Works.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  for providing for the Government of His Majesty's Settlements in Western Australia on the Western Coast of New Holland.|note4= }}\n| |note4= }}\n|  }}\n|\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  for authorizing and facilitating the Completion of a Survey of Great Britain^ Berwick-upon-Tweed, and the Isle of Man.|note4= }}\n|  }}\n|  }}\n| |note4= }}\n|  }}\n|  }}\n| |note4= }}\n|  }}\n|  }}\n|  of the Disembodied Militia in Great Britain and Ireland; to grant Allowances in certain Cases to Subaltern Officers, Adjutants, Paymasters, Quartermasters, Surgeons, Assistant Surgeons, Surgeons Mates, and Serjeant Majors of the Militia; and to authorize the Employment of the Non-commissioned Officers.|note4= }}\n|  }}\n| or the Regulating the Gauge of Railways Act 1846|public|57|18-08-1846|repealed=y|archived=n|An Act for regulating the Gauge of Railways.|note4= }}\n|  }}\n|  }}\n|  }}\n|  for consolidating and amending the Laws relating to Prisons in Ireland.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|\n| |note4= }}\n|\n|  }}\n| or the Public Baths and Wash-houses Act 1846|public|74|26-08-1846|repealed=y|archived=n|An Act to encourage the Establishment of public Baths and Wash-houses.|note4= }}\n|  }}\n|\n|  }}\n|  }}\n|  for amending the Law relative to Private Lunatic Asylums in Ireland.|note4= }}\n|  }}\n|  }}\n|  for authorizing a Loan from the Consolidated Fund to the New Zealand Company.|note4= }}\n|  }}\n| or the Lunacy Act 1846|public|84|26-08-1846|repealed=y|archived=n|An Act to amend the Law concerning Lunatic Asylums and the Care of Pauper Lunatics in England.|note4= }}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n| or '''Lord Campbell's Act|public|93|26-08-1846|repealed=y|archived=n|An Act for compensating the Families of Persons killed by Accidents.|note4= }}\n|  }}\n| or the County Courts (England) Act 1846|public|95|28-08-1846|repealed=y|archived=n|An Act for the more easy Recovery of Small Debts and Demands in England.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n| or the New Zealand Constitution Act 1846|public|103|28-08-1846|repealed=y|archived=n|An Act to make further Provision for the Government of the New Zealand Islands.|note4= }}\n|  for regulating the Sale of Waste Land belonging to the Crown in the Australian Colonies, and to make further Provision for the Management thereof.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|  for regulating the Irish Fisheries.|note4= }}\n|\n|  }}\n|\n}}\nLocal acts\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|  }}\n|\n|  to borrow additional Money, for the Purposes of the Company, and for confirming a Purchase made by them; and for other Purposes.}}\n|\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|\n|\n|  and Fiftieth Years of the Reign of His late Majesty King George the Third, relating to the Port and Harbour of the Town and County of the Town of Southampton.|note4= }}\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|\n|  and Eighth Years of His Majesty King George the Fourth, for supplying with Water the Town of Liverpool and Harrington and Toxteth Park in the County Palatine of Lancaster.|note4= }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  for repairing and maintaining the Road from Whiteburn, upon the Turnpike Road from Edinburgh to Greenlaw, passing through Thornydike and Westruther to Choicelee, upon the Turnpike Road from Greenlaw to Dunse, all in the County of Berwick.}}\n|  }}\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|\n|\n|  and for other Purposes.}}\n|  and for other Purposes.}}\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|  relating to such Railway.}}\n|\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|\n|  }}\n|  for making and maintaining a navigable Communication between Stowmarket and Ipswich in the County of Suffolk, so as to enable the Trustees of such Act to lease the said Navigation; and for other Purposes connected therewith.}}\n|\n|  }}\n|  }}\n|\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n| |note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n| or the Liverpool  Act 1846|local|127|26-06-1846|repealed=y|archived=n|An Act for the Improvement of the Sewerage and Drainage of the Borough of Liverpool, and for making further Provisions for the sanatory Regulation of the said Borough.|note4= }}\n|  of the Bye and Derwent in the North and East Ridings of the County of York.}}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  relating to such Railway.}}\n|\n|  and the Sixth Year of the Reign of Her present Majesty.|note4= }}\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n| or the Deeside Railway Act 1846|local|158|16-07-1846|repealed=y|archived=n|An Act for making a Railway from Ferryhill near Aberdeen to Aboyne, to be called \"The Deeside Railway.\"|note4= }}\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|  }}\n|  }}\n}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|\n|  }}\n| or the Manchester Markets Act 1846|local|219|16-07-1846|repealed=n|archived=n|An Act for providing Market Places and for regulating the Markets and Fairs in the Borough of Manchester in the County Palatine of Lancaster.}}\n| or the Bath Act 1846|local|220|16-07-1846|repealed=n|archived=n|An Act for more effectually supplying with Water the City of Bath, and several Parishes and Places adjacent thereto.}}\n|  }}\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n| or the Great North of England Railway Purchase Act 1846|local|242|27-07-1846|repealed=n|archived=n|An Act for enabling the Great North of England Railway Company to lease and also to sell their Railway to the Newcastle and Darlington Junction Railway Company; and to authorize the raising of additional Money by the said last-mentioned Company for those and other Purposes.}}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  and for authorizing certain Deviations from the Line and Levels of the said Railway, and for making and maintaining certain Branches and Extensions therefrom.}}\n|\n|\n|\n|\n|\n|  }}\n|\n| |note4= }}\n|\n|\n|\n|\n|\n|\n| or the Huddersfield and Sheffield Junction and Manchester and Leeds Railways Act 1846|local|277|27-07-1846|repealed=n|archived=n|An Act to incorporate the Huddersfield and Sheffield Junction Railway Company with the Manchester and Leeds Railway Company.}}\n|  relating thereto.}}\n|  relating thereto.|note4= }}\n|  and for making a Railway from the said Ipswich and Bury Saint Edmunds Railway to Norwich, with a Branch therefrom.|note4= }}\n|\n| or the Liverpool and Bury and Manchester and Leeds Railways Act 1846'''|local|282|27-07-1846|repealed=n|archived=n|An Act to incorporate the Liverpool and Bury Railway Company with the Manchester and Leeds Railway Company.}}\n|\n|\n|  }}\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|  }}\n|  and for more effectually draining and improving Lands adjacent to the River or Stream called the Pow of Inchaffray, in the County of Perth.}}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|  relating to the Liverpool and Bury Railway, and for making Branches therefrom.}}\n|\n|\n|\n|\n|\n|  relating thereto.|note4= }}\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|  }}\n|  for lighting and watching the Road leading from Newington Butts to the Nag's Head on the Wandsworth Road, and other Places communicating therewith, in Lambeth, Clapham, and Battersea in Surrey; and for making other Provisions for lighting and improving the said Road, and other Places adjacent or near thereto.|note4= }}\n|  for granting certain Powers and Authorities to the Australian Agricultural Company.|note4= }}\n|\n|  }}\n|\n|\n|  }}\n|  }}\n|  }}\n| or the London and Birmingham Railway (Birmingham Extension) Act 1846|local|359|07-08-1846|maintained=y|repealed=n|archived=n|An Act for making a Railway from the London and Birmingham Railway to or near to Navigation Street within the Borough of Birmingham.}}\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|\n| or the London and South Western Railway (Basingstoke and Salisbury Extension) Act 1846|local|370|13-08-1846|maintained=y|repealed=n|archived=n|An Act to enable the London and South-western Railway Company to make a Railway by Whitchurch and Andover to Salisbury.}}\n|\n|  }}\n| or the Andover Canal Sale Act 1846|local|373|13-08-1846|maintained=y|repealed=n|archived=n|An Act for authorizing the Sale of the Andevor Canal and other Property of the Company of Proprietors of the Andevor Canal Navigation.}}\n|\n|  }}\n|\n|\n| or the Manchester, Bolton, and Bury and Manchester and Leeds Canal and Railway Act 1846|local|378|18-08-1846|maintained=y|repealed=n|archived=n|An Act to incorporate the Company of Proprietors of the Manchester, Bolton, and Bury Canal Navigation and Railway with the Manchester and Leeds Railway Company.}}\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|  }}\n|\n|\n|  or the London and South Western Railway (London Bridge Extension) Act 1846|local|391|26-08-1846|maintained=y|repealed=n|archived=n|An Act to enable the London and South-western Railway Company to extend their Railway to the Thames near London Bridge in the County of Surrey.}}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n}}\nPrivate acts\n|\n| )}} and for other Purposes. }}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n| )}} and for better carrying the same Act into effect.}}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  and to make further Provision for the beneficial Management and Administration of the several Charity Estates and Charities of the said Humphrey Booth the elder and Humphrey Booth, his Grandson, respectively.}}\n|\n|  }}\n| )}}|note4= }}\n|\n|\n|\n| ))}} }}\n|\n|\n|\n|\n| |private|44|30-03-1846|repealed=n|archived=n|An Act to repeal so much of an Act passed in Ferguson's the fourth year of the reign of his late Majesty King George the Fourth, intituled, \"An Act for naturalizing Henry Robert Ferguson,\")}} as enacts that the said Henry Robert Ferguson should not thereby be enabled to be of the Privy Council, or a Member of either House of Parliament, or to take any Office or Place of Trust either Civil or Military, or to have any Grant of Lands, Tenements or Hereditaments from the Crown to Himself, or any other Person or Persons in Trust for him.}}\n| |private|45|16-07-1846|repealed=n|archived=n| An Act to dissolve the Marriage of Jasper Byng Creagh, Esquire, with Emma Susan Weldale Creagh, his present Wife, and to enable him to marry again, and for other Purposes therein mentioned.}}\n| |private|46|16-07-1846|repealed=n|archived=n|An Act to dissolve the Marriage of George Savage Curtis, Esquire, with Emma Curtis, his now Wife, and for other Purposes.}}\n| |private|47|13-08-1846|repealed=n|archived=n|An Act to dissolve the Marriage of Edward Clark, with his now Wife, and to enable him to marry again, and for other Purposes.}}\n| |private|48|13-08-1846|repealed=n|archived=n|An Act to dissolve the Marriage of Edward Matthyssens with Joanna Frances, his now Wife, and to enable him to marry again, and for other Purposes.}}\n| |private|49|13-08-1846|repealed=n|archived=n|An Act for naturalizing the Reverend Samuel Gobat, Clerk, Bishop of the United Church of England and Ireland in Jerusalem.}}\n| |private|50|26-08-1846|repealed=n|archived=n|An Act to dissolve the Marriage of Robert Nesham Farquharson, Esquire, with Mary Ann, his now Wife, and to enable him to marry again, and for other Purposes }}\n| |private|51|26-08-1846|repealed=n|archived=n|An Act to dissolve the Marriage of the Reverend Salusbury Humphreys, Clerk, with Harriet Ruthan Humphreys, his now Wife, and to enable him to marry again, and for other Purposes.}}\n}}\nSources\n*\n*\n*\nSee also\n* List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}