{
  "content": [
    {
      "type": "text",
      "text": "# List of people with dwarfism\n\n, Diego Velázquez]]\nThe following is a list of people who are known for their dwarfism and who have been open about it. While these people are not known for being the shortest ever, they have been mentioned in sources describing how the condition has affected their lives. Dwarfism is caused by several different types of medical conditions, and is typically defined as an adult with a height of  or less. Records or mentions of people with dwarfism have not always been kept well, resulting in estimated heights that were taken from eyewitnesses. In some given cases the height of the person is unknown except to say that they were mentioned as a \"dwarf\" in various media. This list does not include every prominent person with dwarfism, as others are already included on other linked Wikipedia lists.\nActors and actresses\n{| class=\"wikitable sortable\" style=\"width:100%;\"\n|-\n! Nationality\n! Height\n! Name\n! scope=\"col\" class=\"unsortable\"| Note\n! Lifespan\n|-\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Jyoti Amge\n| Actress known for holding the Guinness World Record for shortest living woman, and for starring in American Horror Story: Freak Show.\n| 1993–\n|-\n|\n|\n| Nelson de la Rosa\n| Actor (known as Mahow) who starred in the Italian horror film Ratman.\n| –2006\n|-style=\"background:#d0f0c0;\"\n|\n|\n|Ajay Kumar\n|Indian actor and director known for holding the Guinness World Records for being the shortest actor to play a character in a full-length film\n|1976–\n|-\n|\n|081\n|Verne Troyer\n| American actor and stunt performer best known for playing Mini-Me in the Austin Powers series of comedy films.\n| 1969–2018\n|- style=\"background:#d0f0c0;\"\n|\n|081\n|Linden Porco\n| Canadian actor, known for playing a body double for Marlon Wayans' character in Little Man.\n| 1996–\n|-\n|\n|\n| Ernesto de la Cruz\n| Actor, stunt performer and martial artist (known by the stage name Weng Weng), who played the leading role in the 1981 spy film ''For Y'ur Height Only.\n| 1957–1992\n|-\n|\n|084\n|Michu Meszaros\n|\n| 1939–2016\n|-\n|\n|086\n|Pat Bilon\n| Known for his performances in Under the Rainbow, and one of two dwarfs hired for the role of E.T. the Extra-Terrestrial (body suit).\n| 1947–1983\n|-\n|\n|089\n|Angelo Rossitto\n| Angelo was an American actor that was billed as \"Little Angie\" or \"Moe\". He was one of the actors in a classic horror movie Freaks.\n| 1908–1991\n|-\n|-\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Ucok Baba\n| Actor and Comedian\n| 1971–\n|-\n|\n|091\n|Eric Lynch\n| American actor, writer and former member of The Howard Stern Show's Wack Pack.\n| 1975–2014\n|-\n|\n|096\n|Josh Ryan Evans\n| American actor with achondroplasia, known for his role as Timmy Lenox from the TV series Passions.\n| 1982–2002\n|-\n|\n|096\n|Mikey Post\n|\n| 1982–2018\n|- style=\"background:#d0f0c0;\"\n|-\n|\n|106\n|Annabelle Davis\n| British actress known for her role as Sasha Bellman in The Dumping Ground. She is the daughter of actor and TV presenter Warwick Davis and Samantha Davis.\n| 1997–\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Daus Mini\n| Actor and Comedian\n| 1987–\n|- style=\"background:#d0f0c0;\"\n|\n|\n|Tony Cox\n| American actor known for his roles in Bad Santa, Me, Myself and Irene, Date Movie, Epic Movie and Disaster Movie.\n| 1958–\n|- style=\"background:#d0f0c0;\"\n|\n|\n|Phil Fondacaro\n| Fondacaro appeared in Star Wars Return of the Jedi as an Ewok, the only one to have a death scene.\n| 1958–\n|- style=\"background:#d0f0c0;\"\n|\n|\n|Warwick Davis\n| British actor with spondyloepiphyseal dysplasia congenita. Davis is known for his role as Wicket W. Warrick from the Star Wars series.\n| 1970–\n|- style=\"background:#d0f0c0;\"\n|\n|\n|Kiruna Stamell\n| Australian actress who received her first major role in the movie Moulin Rouge! as \"La Petite Princesse\".\n| 1981–\n|- style=\"background:#d0f0c0;\"\n|-\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Kohey Nishi\n| Japanese Adult Actor and YouTuber\n| 1993–\n|-\n|\n|\n|Michael J. Anderson\n| American actor known for his roles as \"The Man from Another Place\" in the series Twin Peaks.\n| 1953–\n|-\n|\n|\n|Kenny Baker\n| English actor who originally portrayed R2-D2 in the Star Wars series.\n| 1934–2016\n|- style=\"background:#d0f0c0;\"\n|\n|\n|Jimmy Vee\n| Scottish actor who has portrayed R2-D2 in Star Wars: Episode VII and beyond.\n| 1959–\n|-\n|\n|\n|Billy Barty\n| American actor with cartilage–hair hypoplasia, who had multiple roles in film from 1927 until his death.\n| 1924–2000\n|- style=\"background:#d0f0c0;\"\n|\n|\n|Bridget Powers\n| American pornographic actress also known as \"Bridget the Midget\".\n| 1980–\n|- style=\"background:#d0f0c0;\"\n|\n|\n|Mark Povinelli\n|\n| 1971–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| KK Goswami\n|\n| 1973–\n|-\n|\n|\n|Michael Dunn\n|Oscar-nominated (for Best Supporting Actor in Ship of Fools) American actor with spondyloepiphyseal dysplasia, type unspecified.\n| 1934–1973\n|- style=\"none\"\n|\n|\n|Patty Maloney\n| Maloney is an American actress who portrayed Honk from Far Out Space Nuts.\n| 1936–2025\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Mick Walter\n| English actor who is known for his roles in television comedies.\n| 1955–\n|-\n|\n|\n|Johnny Roventini\n|\n| 1910–1998\n|-\n|\n|\n|Felix Silla\n| Italian-American actor best known for his portrayal as Cousin Itt (voiced by Tony Magro) from the original 1964 TV series, The Addams Family.\n| 1937–2021\n|-\n|\n|\n|Hervé Villechaize\n| French-born actor, known for roles in The Man with the Golden Gun and Fantasy Island.\n| 1943–1993\n|-\n|\n|\n|David Rappaport\n| Rappaport was a British actor who is known for his roles in the films Time Bandits and The Bride.\n| 1951–1990\n|-\n|\n|\n| Aťka Janoušková\n| Prolific voice actress best known for her dub of the titular character in Maya the Honey Bee.\n| 1930–2019\n|-\n|\n|\n| Oliviero Migliore\n| Pornographic actor known by the stage name Holly One.\n| 1965–2006\n|-\n|\n|\n| Michael Gilden\n| American actor who starred in the TV series NCIS.\n| 1962–2006\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Danny Woodburn\n| American actor who is noted for the role on the TV comedy series Seinfeld, as Mickey Abbott.\n| 1964–\n|-\n|\n|\n| Jiří Krytinář\n| Actor with osteochondrodysplasia who had been featured in Czech and American films.\n| 1947–2015\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Shorty Rossi\n| Star of Pit Boss, and owner of Shortywood Productions.\n| 1969–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Meredith Eaton\n| American actress known for portraying the attorney Emily Resnick on the CBS television series Family Law (in which she was the first woman with dwarfism to fill a regular role in an American prime time series), for her recurring role as Bethany Horowitz on the ABC series Boston Legal, and for her lead role as Matilda Webber on the CBS series MacGyver.\n| 1974–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Jason Acuña\n| Acuña is an American skateboarder with achondroplasia who is also known as \"Wee-Man.\" He is one of the stars in the TV series Jackass.\n| 1973–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Martin Klebba\n| American actor best known for his role as Marty in the Pirates of the Caribbean franchise.\n| 1969–\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Juhi Aslam\n| Television actress known for starring in Baba Aiso Varr Dhoondo, a show about a woman with dwarfism.\n| 1991–\n|-\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Adul\n| Actor and Comedian\n| 1983–\n|-\n|\n|\n| Matthew Roloff\n| Roloff is an American actor, author, and businessman with diastrophic dysplasia. He was featured on the TV show Little People Big World.\n| 1961–\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Daiki\n| Actor and Dancer\n| N/A\n|-\n|- style=\"background:#d0f0c0;\"\n|\n|\n| María Elena Saldaña\n| Mexican actress and comedienne, best known for her role on several Televisa series as La Güereja.\n| 1963-\n|-\n|\n|\n| Zelda Rubinstein\n| American actress, best known for her role in Poltergeist as the medium Tangina Barrons.\n| 1933–2010\n|- style=\"background:#d0f0c0;\"\n|\n|\n|Sofiya Cheyenne\n|Sofiya is an actress and active disability advocate in the arts. She has SEDc type dwarfism. Best known for her recurring role as Louise in Loudermilk (2018–2020)\n| 1991–\n|-\n|-\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Megi Irawan\n| Indonesian actor.\n| 1996–\n|-\n|\n|\n|Angelo Muscat\n|Maltese English actor, best known for playing The Butler in The Prisoner.\n| 1930–1977\n|-\n|\n|\n|Vladimir Fyodorov\n|Soviet and Russian actor, known for playing Chernomor in Ruslan and Ludmila.\n| 1939–2021\n|-\n|\n|\n| Chuy Bravo\n|\n| 1956–2019\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Mimie Mathy\n| French actress and comedian who is best known for her role in the Josephine, Guardian Angel'' television series.\n| 1957–\n|-\n|\n|\n| Eric Cullen\n| Cullen was a Scottish actor with achondroplasia who was known for his role as \"Wee Burney\" in BBC's Rab C Nesbitt.\n| 1965–1996\n|-\n|\n|\n| Ben Woolf\n| Actor with pituitary dwarfism who was known for his roles in American Horror Story.\n| 1980–2015\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Peter Dinklage\n| Dinklage is an Emmy-winning American actor with achondroplasia. He has starred in The Station Agent, Game of Thrones and X-Men: Days of Future Past.\n| 1969–\n|-\n|\n|\n| Dick Beals\n| Beals specialized in doing the voices of young boys, although he was also hired to voice young female children.\n| 1927–2012\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Rick Howland\n|\n|\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Linda Hunt\n| American actress who won the Academy Award for Best Supporting Actress for playing Billy Kwan in The Year of Living Dangerously. She also played Shadout Mapes in David Lynch's adaptation of Dune.\n| 1945–\n|-\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Köksal Baba\n| Turkish actor and YouTuber\n| 1975–\n|-\n|\n|\n| John George\n|\n| 1898–1968\n|-\n|\n|\n| George Brasno\n|\n| 1911–1982\n|-\n|\n|\n| Olive Brasno\n|\n| 1917–1998\n|-\n|\n|\n| George Claydon\n|\n| 1933–2001\n|-\n|\n|\n| Luis Aguad Jorge\n| Actor known for starring in the Puerto Rican television show La Criada Malcriada, and for being their national spokesperson for Holsum Bread.\n| 1925–2007\n|-\n|\n|\n| Fritz Hakl\n|\n| 1932–2012\n|-\n|\n|\n| Suon Bou\n| Actor (known as Loto) who was well known in Cambodian film for his comedic roles.\n| 1936–2006\n|-\n|\n|\n| Martí Galindo\n| Theatre actor known for his appearances on the Spanish late night talk show Crónicas marcianas.\n| 1937–2019\n|-\n|\n|\n| Ateng\n| Actor known for playing comedic roles in Indonesian film and television.\n| 1942–2003\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Mike Edmonds\n| British actor in Maid Marian and her Merry Men, Time Bandits, and \"The Safety Dance\" video.\n| 1944–\n|-\n|\n|\n| Guy Big\n| Canadian actor best known for his role in the children's television series The Hilarious House of Frightenstein as the Midget Count.\n| 1946–1978\n|-\n|\n|\n| Malcolm Dixon\n|\n| 1953–2020\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Romy Pastrana\n| Pastrana (Dagul as his stage name) is a Filipino dwarf actor who does roles on the children's gag show ''Goin' Bulilit, he is the only adult actor.\n| 1958–\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Allan Padua\n| Actor and comedian (Mura as his stage name) who has appeared in various Filipino films.\n| 1969–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Jordan Prentice\n| Canadian actor, who appeared in In Bruges.\n| 1973–\n|-\n|\n|\n| Noemi Tesorero\n| Tesorero (Mahal as her stage name) is a Filipina dwarf actress, comedian and vlogger.\n| 1974–2021\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Chinedu Ikedieze\n| Ikedieze is best known for playing alongside Osita Iheme in most movies after their breakthrough in Aki na Ukwa.\n| 1977–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Osita Iheme\n| Iheme is known for his nickname \"PawPaw\", which he adopted after the role he played of the same name in the film Aki na Ukwa''.\n| 1982–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Lisa Hammond\n|\n| 1983–\n|-\n|\n|\n| Fa'afiaula Sagote\n| Samoan actor who played the lead role in his country's first ever feature film, The Orator (2011).\n| 1980s–2022\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Josephine Bibit Berry\n| Berry (Jo Berry as her stage name) is a Filipina dwarf actress from GMA Network. She was known for her role \"Onay\" in Onanay, \"Princess R. Montivano\" in Little Princess, and \"Lilet Mercado-Matias\" in Lilet Matias: Attorney-at-Law.\n| 1994–\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Sam Humphrey\n| Actor known for playing General Tom Thumb in the 2017 film The Greatest Showman.\n| 1994–\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Quaden Bayles\n| Murri child actor known for his roles in Three Thousand Years of Longing and Furiosa: A Mad Max Saga.\n| 2010–\n|-\n|\n|\n| Javed Kodu\n| Actor who had many Punjab and Urdu language film and television roles.\n| ?–2025\n|-\n|\n|\n| Jimmy Karoubi\n| Actor known for starring in the 1955 film The Woman for Joe, and for being part of boxer Sugar Ray Robinson's entourage.\n|\n|- style=\"background:#d0f0c0;\"\n|  DR Congo\n|\n| Cécile Bayiha\n| Bayiha is best known for playing the part of captive Pygmy Likola in the 2005 Franco-British-South African film Man to Man\n|\n|}\nArtists and writers\n{| class=\"wikitable sortable\" style=\"width:100%;\"\n|-\n! Nationality\n! Height\n! Name\n! Note\n! Lifespan\n|-\n|\n|\n| Judy-Lynn del Rey\n| American science fiction editor.\n| 1943–1986\n|-\n|\n|\n| Richard Gibson (painter)\n| 17th century painter of portrait miniatures.\n| 1615–1690\n|-\n|\n|\n| Henri de Toulouse-Lautrec\n| French painter\n| 1864–1901\n|-\n|\n|\n| François de Cuvilliés\n| Flemish architect noted for Cuvilliés Theatre.\n| 1695–1768\n|}\nAthletes\n{| class=\"wikitable sortable\" style=\"width:100%;\"\n|-\n! Nationality\n! Height\n! Name\n! Sport\n! width=\"700\"| Note\n! Lifespan\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Juli Windsor\n| Runner\n| Windsor was among the first dwarfs to complete the Boston Marathon after first trying in 2013. While she was unable to finish that year due to the bombing, she accomplished her goal in 2014.\n| 1987–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Ellie Simmonds\n| Swimmer\n| Multiple gold medallist and world record holder in Paralympic swimming events.\n| 1994–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Lauritta Onye\n| Paralympic athlete\n| Onya won gold in shot put at the 2016 Summer Paralympics, and 2015 IPC Athletics World Championships.\n| 1984–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Kate Wilson\n| Paralympic swimmer\n| Wilson represented Australia at the 2016 Rio Paralympics.\n| 1998–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Rico Abreu\n| Auto racing\n| NASCAR driver.\n| 1992–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Özlem Kaya\n| Paralympic swimmer\n| Kaya participated in the 2011 European Championships where she won bronze in the 100m Breaststroke.\n| 1992–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Kyron Duke\n| Paralympic athlete\n| Duke took part in the 2010 Commonwealth Games among other events where he won bronze and silver medals.\n| 1992–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Çiğdem Dede\n| Paralympic athlete\n| Dede won a silver medal at the 2012 Paralympics in powerlifting.\n| 1980–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Sarah Bowen\n| Paralympic swimmer\n| Bowen has won two gold, and two silver Olympic medals.\n| 1984–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Sarah Rose\n| Paralympic swimmer\n|\n| 1986–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Holly Neill\n| Paralympic athlete\n|\n| 1989–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Claire Keefer\n| Paralympic athlete\n|\n| 1995–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Tiffany T. Kane\n| Paralympic swimmer\n|\n| 2001–\n|}\nEntertainers\nThe names here include circus performers, comedians, reality TV stars, and occupations that do not primarily involve acting in films.\n{| class=\"wikitable sortable\" style=\"width:100%;\"\n|-\n! Nationality\n! Height\n! Name\n! Type\n! Note\n! Lifespan\n|-\n|\n|\n|Che-Mah\n|Circus performer\n|Born in China, brought to the U.S. with Barnum & Bailey in 1881. Retired in Knox, Indiana.\n|1838–1926\n|-\n|\n| 081\n| Lavinia Warren\n| Circus performer\n| Warren performed in the circus with her husband Charles Stratton (see below) under P. T. Barnum.\n| 1841–1919\n|-\n|\n|\n| Count Primo Magri\n| Circus performer\n| Stage name of the second husband of Lavinia Warren.\n| 1849–1920\n|-\n|\n| 086\n| Nicolas Ferry\n| Court dwarf\n| French court dwarf nicknamed \"Bébé\" of the Polish king Stanisław Leszczyński.\n| 1741–1764\n|-\n|\n| 091\n| Charles Sherwood Stratton\n| Circus performer\n| Also known as \"General Tom Thumb\", he gained fame under P. T. Barnum who exaggerated his short height to be .\n| 1838–1883\n|-\n|\n| 091\n| Thomas Dilward\n| Stage actor\n| Nineteenth-century minstrel show entertainer.\n| 1840–1902\n|-\n|\n|\n| Jeffrey Hudson\n| Court dwarf\n| English court dwarf and jester to Charles I.\n| 1619–1682\n|-style=\"background:#d0f0c0;\"\n|\n|\n|Hasbulla\n|Internet personality\n|Russian social media personality.\n|2002–\n|-\n|\n|\n| Hedsor Conrad Ernest Coppernin\n| Court dwarf\n| Served as a page to Princess Augusta of Saxe-Gotha making him the last court dwarf.\n| 18th century\n|-style=\"background:#d0f0c0;\"\n|\n|\n|Evan Eckenrode\n|Internet Personality\n|Eckenrode grew to fame on the social media platform Vine before moving his career to work alongside social media star Logan Paul.\n|1997–\n|-\n|\n|\n| George Washington Morrison Nutt\n| Circus performer\n| Known as \"Commodore Nutt\".\n| 1848–1881\n|-\n|\n|\n| Billy Merchant\n| Circus performer\n| British circus entertainer.\n| 1919–2001\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Imaan Hadchiti\n| Comedian\n| Lebanese–Australian standup comedian and actor known for being one of two known cases of his form of dwarfism, alongside his sister.\n|\n|-\n|\n|\n| Pee Wee Marquette\n| Comedian\n| Master of ceremonies at the original Birdland jazz club.\n| 1914–1992\n|-\n|\n|\n| Frankie Saluto\n| Circus performer\n| Saluto performed for over four decades with the Ringling Brothers circus.\n| 1906–1982\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Charla Baklayan Faddoul\n| Reality TV\n| American (Syrian born) The Amazing Race contestant (Seasons 5 and 11).\n| 1976–\n|-\n|\n|\n| Henry Joseph Nasiff Jr.\n| Radio personality\n| American entertainer who frequently appeared on The Howard Stern Show.\n| 1962–2001\n|-\n|\n|\n| Jimmy Clitheroe\n| Comedian\n| British comedian called \"The Clitheroe Kid\".\n| 1921–1973\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Lester \"Beetlejuice\" Green\n| Comedian\n| Entertainer known for his appearances on The Howard Stern Show.\n| 1968–\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Brad Williams\n| Comedian\n| American comedian and radio personality.\n| 1984–\n|-\n|\n|\n| Marjorie Johnson\n| Baker\n| American popular baker and talk show guest. Correspondent for the The Tonight Show with Jay Leno''.\n| 1919–2025\n|-\n|\n|\n| Wee Georgie Wood\n| Comedian\n| Comic actor with a railway named after him, and an Australian rhyming slang term adopted from his name (\"wee georgie\").\n| 1894–1979\n|-\n|\n|\n| Braccio di Bartolo\n| Court jester\n| Member of the court of Cosimo I de' Medici, nicknamed Nano Morgante.\n| 16th century\n|-\n|\n|\n| Marshall P. Wilder\n| Comedian\n| American comedian.\n| 1859–1915\n|}\nMusicians/singers\n{| class=\"wikitable sortable\" style=\"width:100%;\"\n|-\n! Nationality\n! Height\n! Name\n! Note\n! Lifespan\n|-\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Thomas Quasthoff\n| Bass-baritone classical singer.\n| 1959–\n|-\n|-style=\"background:#d0f0c0;\"\n|\n| 130.0&nbsp;cm (51.2&nbsp;in)\n| Olympia Ivleva\n| Russian musician and founding member of Little Big\n| 1990–\n|-\n|\n|\n| Nelson Ned\n| Brazilian singer and composer.\n| 1947–2014\n|-\n|\n|\n| Bushwick Bill (b. Richard Shaw)\n| American rapper, founding member of the Geto Boys.\n| 1966–2019\n|-\n|\n|\n| Joe C. (Joseph Calleja)\n| Kid Rock's sidekick.\n| 1974–2000\n|-\n|\n| 124&nbsp;cm (49&nbsp;in)\n| Chick Webb\n| Big band drummer.[https://archive.org/details/jazzdeathmedical00spen  Jazz and Death: Medical Profiles of Jazz Greats by Frederick J. Spencer (x)]: Although it states that calling him a \"hunchbacked dwarf\" is \"indelicate.\"\n| 1905–1939\n|-\n|\n| 91&nbsp;cm (36&nbsp;in)\n| Michel Petrucciani\n| French jazz pianist.\n| 1962–1999\n|-\n|-style=\"background:#d0f0c0;\"\n|\n|\n| Abdu Rozik\n| Tajikistani Singer and Social Media.\n| 2003–\n|-\n|}\n* The Ovitz family were a family of Romanian Jewish actors/traveling musicians who survived imprisonment at the Auschwitz concentration camp during World War II. They were the largest family of dwarfs ever recorded and were the largest family (twelve family members from a 15-month-old baby to a 58-year-old woman) to enter Auschwitz and to survive intact.\nPoliticians\n{| class=\"wikitable sortable\" style=\"width:100%;\"\n|-\n! Nationality\n! Height\n! Name\n! Note\n! Lifespan\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Sandra Borch\n| Norwegian politician with achondroplasia.\n| 1988–\n|-\n|\n|\n| Józef Boruwłaski\n| Polish \"count\".\n| 1739–1837\n|-\n|\n|\n| Alan Eggleston\n| Australian politician with achondroplasia.\n| 1941–2025\n|- style=\"background:#d0f0c0;\"\n|\n|N/A\n|Simone Fischer\n|Member of the German Bundestag.\n|1979–\n|- style=\"background:#d0f0c0;\"\n|\n|150&nbsp;cm (59&nbsp;in)\n|Robert Reich\n|United States Secretary of Labor with multiple epiphyseal dysplasia.\n|1946–\n|-\n|\n|114&nbsp;cm (45&nbsp;in)\n|Charley Lockhart\n|Texas State Treasurer.\n|1876-1954\n|}\n* Chnoum-Hotep, ancient chief of perfumes from the Fifth dynasty of Egypt who is believed to have had achondroplasia.\n* Seneb, Egyptian high-ranking court official\nOthers\n{| class=\"wikitable sortable\" style=\"width:100%;\"\n|- Sam Maslaney\n! Nationality\n! Height\n! Name\n! Note\n! Lifespan\n|-\n|\n|\n| Pauline Musters\n| Dutch woman, recognized by the Guinness World Records as the shortest woman ever recorded\n| 1876–1895\n|-\n|\n|\n| Anne Clowes\n| Reported centenarian dwarf (second longest lived next to Susanna Bokoyni) with house designed for her stature.\n| 1681–1784\n|-\n|- style=\"background:#d0f0c0;\"\n|\n|\n| Hitomi Goto\n| Japanese model and fashioner\n| N/A\n|-\n|\n|\n| Paul Steven Miller\n| Disability rights expert, EEOC Commissioner, professor at the University of Washington School of Law, Special Assistant to the President\n| 1961–2010\n|-\n|\n|\n| Alexander Pope\n| Prominent writer, poet, translator and satirist\n| 1688–1744\n|-\n|\n| N/A\n| John William Bean\n| British jeweller, news vendor and criminal who attempted to assassinate Queen Victoria, also \"hunchbacked\".\n| 1824–1882\n|-\n|\n| N/A\n| Charles Proteus Steinmetz\n| German-American mathematician and electrical engineer, also \"hunchbacked.\"\n| 1865–1923\n|-\n|\n| N/A\n| Alexander Katan\n| Dutch teacher and victim of Nazi experimentation who eventually became an anatomical display.\n| 1899–1943\n|- style=\"background:#d0f0c0;\"\n|\n| N/A\n| Tom Shakespeare\n| Also known as Sir Thomas William Shakespeare, 3rd Baronet. A geneticist with achondroplasia.\n| 1966–\n|}\n* Sebastiano Biavati, 17th century curator of museum of curiosities\n* Joyce Carpenter (December 21, 1929 – August 7, 1973), suffered from Morquio syndrome. At 74&nbsp;cm or 29&nbsp;in the shortest recorded adult in the UK.\n* Wybrand Lolkes, Dutch dwarf (visited Britain in 1790)\n* Anne Clowes, (died 5 August 1784), English dwarf, from Matlock, Derbys; cited as one of two recorded centenarian dwarfs, she lived to 103 years old and is listed in Guinness World Records\nSee also\n* List of dwarfism organisations\n* Cultural depictions of dwarfism\n* List of tallest people\n* List of people with gigantism\nNotes\n:A. Male or Female (full grown)\n:B. Estimated height\n:C. Charles Sherwood Stratton's final height varies in reliable sources, which put it just above or near 3 feet (91cm).\n:D. Thomas Dilward's height was between 23 and 36 inches tall, his highest estimated height is included here.\nReferences"
    }
  ]
}