{
  "content": [
    {
      "type": "text",
      "text": "# List of Star Wars planets and moons\n\nfor the Lars Homestead on the Planet Tatooine at Chott el-Jerid, Tunisia (pictured in 2010)]]\nThe fictional universe of the Star Wars franchise features multiple planets and moons. While only the feature films and some other works are considered canon to the franchise since the 2012 acquisition of Lucasfilm by The Walt Disney Company, some canon planets were first named or explored in works from the non-canon Star Wars expanded universe, now rebranded as Star Wars Legends.\nIn the theatrical Star Wars films, many scenes set on these planets and moons were filmed on location rather than on a sound stage. For example, the resort city of Canto Bight on the planet Cantonica, seen in Star Wars: The Last Jedi (2017), was filmed in Dubrovnik, Croatia.\nStar Wars canon astrography\nThe Star Wars galaxy contains several broad sub-regions. Their exact definitions fluctuated somewhat during the Legends continuity, but were later formally updated by the new canon continuity when Disney purchased Lucasfilm. The new canon map is broadly similar to the later versions of the Legends galactic map.\nAs a general rule, most of the galaxy's wealth, power, and population are concentrated near the middle of the galactic circle – the \"Core Worlds\". The first major interstellar powers in the core are stated to have risen many millennia ago, gradually coalescing into the early Galactic Republic, with its capital at Coruscant. Waves of colonization (and conquest) by the Republic gradually spread outward from the Core, into the sparser systems at the galaxy's edge, such as Tatooine. Worlds of the Outer Rim are rich in raw resources but lack the population, infrastructure, or political power of the Core. Major galactic sub-regions are further divided into quadrants, sectors, etc., down to individual star systems and planets.\nThe galaxy has at least two companion-satellite dwarf galaxies, one of which is known as the Rishi Maze, but they are very lightly settled or explored.\nThe canon map depicts a top-down view of the galactic disk, with \"north\" as the side of the galactic center that Coruscant is located on. As the capital planet of the Republic and later the Empire, Coruscant is used as the reference point for galactic astronomy, set at XYZ coordinates 0-0-0. Standardized galactic time measurements are also based on Coruscant's local solar day and year.\nAccording to the updated Visual Dictionary series made by Pablo Hidalgo for the Sequel Trilogy, these are the general regions of the galaxy spreading outward from the Core:\n* Deep Core – the innermost brightly lit region of space, with a supermassive black hole at the center which binds the galaxy together. Densely packed with stars, nebulae, and other anomalies, it is therefore thinly settled due to the resulting high radiation levels and lack of stable hyperspace routes.\n* Core Worlds – powerful and wealthy planets with millennia-long histories, many of them founding members of the Galactic Republic. On-screen examples include Coruscant, Alderaan, Chandrila, Corellia, and Hosnian Prime.\n* The Colonies – the first colonies founded by the nascent Galactic Republic in ancient times. The name is somewhat anachronistic, as they have grown nearly as powerful as the \"Core Worlds\" themselves, though their histories aren't quite as long or prestigious (i.e. comparable to how the United States or Canada could be called \"the colonies\" of Great Britain). Mentioned by name in The Rise of Skywalker.\n* Inner Rim – the original edge of the Galactic Republic, where expansion waves stopped for many generations.\n* Expansion Region – nestled between the \"Inner Rim\" and the \"Mid Rim\", anachronistically named due to a new colonization wave starting again.\n* Mid-Rim – Generally industrialized though not very important planets, but more developed than the true \"frontier\" in the Outer Rim. On-screen examples include Naboo and Kashyyyk.\n* Outer Rim – a vast region including all of the last major star systems up to the galaxy's edge. As the last region that the Republic expanded into, it is relatively the least developed, a frontier more often than not exploited by the central galactic government for its resources. On-screen examples include Tatooine, Yavin, Hoth, Bespin, Endor, Geonosis, Utapau, Mustafar, and Kessel.\n* Wild Space – star systems located beyond the Outer Rim – because a galaxy's \"edge\" is not a fixed border line, but a concentration of stars tapering off in frequency. Unlike the Outer Rim, these sparse few systems around the galaxy's circumference were never formally charted. More broadly, Attack of the Clones established that the Star Wars galaxy actually possesses at least three small satellite galaxies, never colonized and considered largely inhospitable. The secret cloner-world Kamino, however, is located in one of these minor galactic clusters beyond the Outer Rim.\n* Unknown Regions – the new Canon map establishes that, due to the stability of hyperspace lanes, inhabited planets are weighted toward the \"eastern\" quadrant of the galactic plane with the \"western\" one being mostly unexplored. These Unknown Regions are home to the first Jedi temple on Ahch-To, the planet Illum which would become Starkiller Base, and the Chiss Ascendancy, into which Grand Admiral Thrawn was born. The remnants of the Empire retreated here after their defeat at Endor, reforming into the First Order – as well as, secret even to the First Order, Darth Sidious' Sith forces reconstituting on Exegol.\n* Western Reaches – the sectors once controlled by the Republic that border the Unknown Regions of the galactic \"west\". Essentially similar to the Outer Rim in terms of their history and economic development, the only difference being that instead of being located at the galaxy's physical edge, they are located at the edge of galactic exploration in the \"western\" side of the Republic. In The Force Awakens, it is stated in dialogue that Jakku is in the Western Reaches.\nApart from these broad regions radiating out from the galactic core, there are also several major galactic sub-regions of note:\n* Mandalorian space – technically located in the Outer Rim, but relatively close to the border with the Mid-Rim, near Kashyyyk, in the galactic \"northeast\". The planet Mandalore had its own regional space empire in ancient times, led by their formidable warrior culture. The Mandalorians were the most difficult enemies the Jedi ever faced short of the Sith: they were not Force-wielders, but were a culture of regular humans who had honed themselves to possess the pinnacle of combat training, equipment, and battle tactics. During a series of long wars with the Republic, however, many centuries before the Clone Wars, the Jedi were eventually able to fight them into submission – though with heavy losses. In the Star Wars: Clone Wars animated series, both the Republic and the Separatists compete for support from rival Mandalorian factions, and in the later Star Wars: Rebels animated series, Mandalorians again divide into a proxy war between pro-Imperial and pro-Rebel forces. According to The Mandalorian TV series, this eventually resulted in the devastation of Mandalorian space by the Empire, with surviving enclaves scattering across the Outer Rim.\n* Hutt Space – a fairly large swath of space along the \"eastern\" quadrant of the galactic plane, loosely straddling the border between the Mid-Rim and Outer-Rim. The Hutts are a kleptocratic Mafia state, derided as \"gangsters\" composed of several rival clans. The Hutts' resources and power are formidable enough that both the Republic and the Empire never bothered to conquer them, while the Hutts were too divided by their own internal politics to seriously challenge the Republic (unlike the Mandalorians).\nThis official galactic astrography was later re-confirmed for the first time in on-screen, live-action dialogue in The Mandalorian. In the second season's fourth episode, \"The Siege\", a classroom is briefly shown on a planet in the Outer Rim, in which a lesson on galactic astrography is being taught by a protocol droid. The teacher not only lists off each of these major regions from the Visual Dictionary, but lists them in the exact same order, from the Outer Rim to the Core:\n:\"Who can name one of the five major trade routes in the galaxy? The Hydian Way [runs] from the Outer Rim to as far away as the Core Worlds. However, there are several other regions within our galaxy. They are the Mid Rim, the Expansion Region, the Inner Rim, the Colonies, the Core, and the Deep Core.\"\nStar Wars canon planets and moons\nThe following list names prominent planets and moons from the Star Wars films or other canon media.\n{| class=\"wikitable sortable\" border=\"1\"\n! scope=\"col\" | Name\n! scope=\"col\" | First appearance\n! scope=\"col\" | Year\n! scope=\"col\" | Media\n! scope=\"col\" class=\"unsortable\" | Fictional description\n! scope=\"col\" class=\"unsortable\" |\n|-\n| Abafar\n| Star Wars: The Clone Wars\n| 2012\n| TV series\n| A desert planet located in the Outer Rim with a completely white surface. Known as The Void, the planet is barely populated but is home to massive amounts of rhydonium, a scarce and volatile fuel.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"3\" |\n|  The Farlander Papers\n| 1993\n| Novella\n| rowspan=\"3\" | A barren, rocky planet in the Outer Rim. Site of a still-active reserve of Separatist droids that became known for surviving the Clone Wars.\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n| Star Wars: The Clone Wars\n| 2012\n| TV series (mentioned)\n|-\n| Star Wars Rebels\n| 2016\n| TV series\n|-\n|\n|\n| 2015\n| Film\n| Largely oceanic planet on which Luke Skywalker has been hiding for several years, and the location of the first Jedi Temple and the Tree Library of sacred Jedi texts. Porgs, Lanai and thala-sirens are among the native species.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars Battlefront II\n| 2017\n| Video game\n| A jungle moon which serves as a new base of operations for the Resistance. Years before, Leia and Luke were training there. Leia Organa dies here after using the last of her energy to reach out to her son through the Force.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: Aftermath\n| 2015\n| Book\n| Jungle planet and home of Norra and Temmin Wexley, and a primary setting in Aftermath.\n| style=\"text-align:center;\" |\n|-\n| Alaris Prime\n| Star Wars Galactic Battlegrounds (2001 video game)|Star Wars Galactic Battlegrounds\n| 2001\n| Video game\n| a green moon orbitting the gas giant Alaris,in the Kashyyyk system. It was colonized by the Wookiees with the help of Jedi Master Qui-Gon Jinn some time between the years 36 BBY and 39 BBY, after twenty years of much debate in the Senate of the Galactic Republic over colonization rights.\n|-\n| Alderaan\n|\n| 1977\n| Film\n| Forests, mountains; home planet of Princess Leia and the House of Organa. Destroyed by the first Death Star as punishment for her involvement in the Rebel Alliance and also as a demonstration of power.\n| style=\"text-align:center;\" |\n|-\n|\n| Andor\n| 2022\n| TV series\n| A temperate, alpine planet with highlands, valleys, forests, and lakes sacred to the indigenous Dhani people, until they were relocated by the Empire, having established a base situated within a dam housing a vault funding its military.\n| style=\"text-align:center;\" |\n|-\n| Aleen\n| Star Wars: The Clone Wars\n| 2011\n| TV series\n| A subterranean world located in the Mid Rim. The native species include, the surface-dwelling beings called the Aleena and sentient tree-like beings called Kindalo.\n| style=\"text-align:center;\" |\n|-\n|rowspan=\"2\"|\n|  Jedi Knight II: Jedi Outcast\n| 2003\n| Video game\n|rowspan=\"2\"| Ice planet, with many glaciers, and on its surface lies a crashed separatist carrier, with an anti-gravitational device.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: Last Shot\n| 2018\n| Book (mentioned)\n|-\n| rowspan=\"2\" | Anaxes\n| Star Wars: Empire at War\n| 2006\n| Video game\n| rowspan=\"2\" | A rocky planet located in the Azure sector of the galaxy's Core Worlds region. A majority of its surface was covered with tall, red plant-like life. In the early years of the Imperial Era, the planet was destroyed in a cataclysm, with the remains becoming the Anaxes asteroid belt.\n| rowspan=\"2\" style=\"text-align:center;\" |\n|-\n| Star Wars: The Clone Wars\n| 2020\n| TV series\n|-\n| rowspan=\"2\" | Ando\n| Dark Force Rising\n| 1992\n| Book\n| rowspan=\"2\" | A water-covered planet located in the Outer Rim, it is home to the amphibious Aqualish species and endures great turmoil during the Separatist Crisis.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars Rebels: Head to Head\n| 2014\n| Book\n|-\n| rowspan=\"3\" |\n|\n| 1980\n| Film (mentioned)\n| rowspan=\"3\" | Polluted; A nearly inhospitable planet used by the Empire.\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n| Star Wars: Dark Forces\n| 1995\n| Video game\n|-\n| Star Wars: Uprising\n| 2015\n| Video game\n|-\n|\n| Star Wars: Skeleton Crew\n| 2024\n| TV series\n| A planet that was one of the nine Jewels of the Old Republic. During the New Republic it is war-torn, due to constant conflict between clans.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: Skeleton Crew\n| 2024\n| TV series (mentioned)\n| A planet that was one of the nine Jewels of the Old Republic. Later it was destroyed.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: Skeleton Crew\n| 2024\n| TV series (mentioned)\n| A planet that was one of the nine Jewels of the Old Republic.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: Skeleton Crew\n| 2024\n| TV series (mentioned)\n| A planet that was one of the nine Jewels of the Old Republic.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: Skeleton Crew\n| 2024\n| TV series\n| A planet that was intentionally hidden and physically cut-off from the rest of the galaxy; it is considered a Jewel of the Old Republic. Most believe At Attin to be a myth, described as a lost planet containing eternal treasure. This is partially true, At Attin is a sparsely populated Synthetic Technocracy-governed planet with only one metropolis settlement and a singular economic output dubbed \"the great work\": security printing and money creation, a \"piggy-bank\" for the Star Wars Galaxy. Only the Republic Treasury Department representative, on a specially designated Republic spaceship, is permitted the location and entry to At Attin.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: Skeleton Crew\n| 2024\n| TV series (mentioned)\n| A planet that was one of the nine Jewels of the Old Republic.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars Rebels\n| 2016\n| TV series\n| Desert planet, site of Phoenix Squadron Rebel base. Home of the spider-like hexapods known as the Krykna, and the powerful force-wielder Bendu. The Battle of Atollon was allowed by Grand Admiral Thrawn himself, and destroyed most of the base, forcing the Phoenix Squadron to leave.\n| style=\"text-align:center;\" |\n|-\n|\n| The Bad Batch\n| 2023\n| TV series\n| An icy planet where the Galactic Empire maintained a supply depot. The clone trooper CT-9904 \"Crosshair\" was sent to the outpost on the planet.\n| style=\"text-align:center;\" |\n|-\n| Balnab\n| Star Wars: The Clone Wars\n| 2008\n| TV series\n| A Barbaric world once visited by R2-D2 and C-3PO.\n| style=\"text-align:center;\" |\n|-\n| Batuu\n| Thrawn: Alliances\n| 2018\n| Book\n| A planet that features a remote frontier outpost and an old trading port. In 34 ABY, Kylo Ren travel into the planet to try and find Rey.\n| style=\"text-align:center;\" |\n|-\n|\n|\n| 1980\n| Film\n| A gas planet with a thin layer of habitable atmosphere where Cloud City was located. The planet's gas layers were a source of rare tibanna gas which was harvested and refined at mining complexes like Cloud City. Location of Han Solo's carbonization, and Luke Skywalker and Darth Vader's duel, with the latter cutting of Luke's hand and losing his lightsaber, and revealing to be his father.\n| style=\"text-align:center;\" |\n|-\n| Bogano\n| Star Wars Jedi: Fallen Order\n| 2019\n| Video game\n| A largely uninhabited grassy planet in the Outer Rim, home to a Zeffo vault.\n| style=\"text-align:center;\" |\n|-\n|Bora Vio\n|The Bad Batch: Season 1 Episode 9\n|2021\n|TV Series\n|Located in the Lido system, this planet has a cloudy atmosphere and hosted a Kaminoan facility that was abandoned by the time of the Galactic Empire.\n|style=\"text-align:center;\" |\n|-\n|\n| Star Wars Jedi: Fallen Order\n| 2019\n| Video game\n| An inhospitable junkyard planet in the Mid Rim considered strategically important in the Clone Wars. Becomes useful to the Scrapper Guild whose members salvage decommissioned ships for the Empire.\n| style=\"text-align:center;\" |\n|-\n|\n| The Acolyte\n| 2024\n| TV series\n| A planet in the Outer Rim that is home to Osha and Mae Aniseya, as well as a coven of force-sensitive witches known as the Witches of Brendok.\n| style=\"text-align:center;\" |\n|-\n|\n|\n| 2017\n| Film\n| An arid planet where the resort city of Canto Bight, home of the Canto Casino and Racetrack, is located.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars Resistance\n| 2018\n| TV series\n| An ocean planet located in the Outer Rim near Wild Space. Home to the aircraft refueling station Colossus, as well as a destination for racers.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n| Darth Maul: Saboteur\n| 2001\n| Short story\n| rowspan=\"2\" | Colony world of the Neimoidian species. The site of battles throughout the Clone Wars, notable for its \"Bridge Cities\". Also the site of Plo Koon's death during the Great Jedi Purge.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Revenge of the Sith\n| 2005\n| Film\n|-\n| rowspan=\"3\" |\n| The Truce at Bakura\n| 1994\n| Book\n| rowspan=\"3\" | A prominent Core world known for producing scholars and diplomats, steeped in ancient traditions. Its serene geography features majestic mountain vistas and lush valleys. Represented by Mon Mothma in the galactic Senate. Appeared on-screen for the first time when it prominently featured in Andor Season 2. After the fall of the Empire it became the first temporary capital of the New Republic.\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n| Star Wars: Aftermath\n| 2015\n| Book\n|-\n| Andor\n| 2022\n| TV series\n|-\n|\n| Star Wars: The Clone Wars\n| 2008\n| TV series\n| During the Clone Wars, the Battle of Christophsis occurs here, serving as an introduction to Ahsoka Tano.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"3\" |\n| The Last One Standing: The Tale of Boba Fett\n| 1996\n| Short story\n| rowspan=\"3\" | Home planet of Jango Fett. Habitable planet that is surrounded by a large amount of debris from many vicious wars. Formerly controlled by the Mandalorians.\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n| Star Wars: The Clone Wars\n| 2012\n| TV series (mentioned)\n|-\n| Star Wars Rebels\n| 2016\n| TV series\n|-\n| rowspan=\"3\" |\n|\n| 1977\n|\n| rowspan=\"3\" | Industrial planet located in the Core of the galaxy, with a strong culture of training pilots. Homeworld of Han Solo and Qi'ra.\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n| The Corellian Trilogy\n| 1995\n| Book\n|-\n| Solo: A Star Wars Story\n| 2018\n| Film\n|-\n| rowspan=\"3\" | Coruscant\n| Heir to the Empire\n| 1991\n| Book\n| rowspan=\"3\" | Cosmopolitan urban world consisting of one planet-wide city. Coruscant is situated in the heart of the Star Wars galaxy with a population of over one trillion, and is Governmental center of the Galactic Republic and later the Galactic Empire. Home to the main Jedi Temple, which would become the Imperial Palace.\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n| Return of the Jedi (Special Edition)\n| 1997\n| Film\n|-\n|\n| 1999\n| Film\n|-\n|\n| Leia, Princess of Alderaan\n| 2017\n| Book\n| Small mineral planet located in a remote section of the galaxy, its surface is covered with a layer of white salt over its red-colored soil. In Leia, Princess of Alderaan it is the location of an early Rebel Alliance outpost. Leia and her remaining Resistance forces flee there in The Last Jedi, where they face off with the First Order until the intervention of Luke.\n| style=\"text-align:center;\" |\n|-\n|\n| '\n| 2015\n| Film\n| Site of a Partisan operations base led by Saw Gerrera, it was later abandoned after an Imperial spy was discovered in their ranks. Decades later, the Partisan base was occupied by the Resistance led by General Leia Organa, and was destroyed during the evacuation following the destruction of Starkiller Base.\n| style=\"text-align:center;\" |\n|-\n| Dagobah\n| '\n| 1980\n| Film\n| Swamp planet and Yoda's residence after the fall of the Jedi.\n| style=\"text-align:center;\" |\n|-\n|\n| Obi-Wan Kenobi\n| 2022\n| TV series\n| A cityscape planet where Ben Kenobi begins his search for Leia Organa.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"3\" |\n|\n| 1977\n|\n| rowspan=\"3\" | Rural planet and the former site of a Rebel base. The writers of Rogue One considered depicting the Rebels evacuating the base for Yavin&nbsp;4, but \"it didn't move the story forward and it would have cost a ton of money.\"\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n| Jedi Search\n| 1994\n| Book\n|-\n| Star Wars Rebels\n| 2017\n| TV series\n|-\n| rowspan=\"2\" |\n| The Courtship of Princess Leia\n| 1994\n| Book\n| rowspan=\"2\" | Sith world and homeworld of the Nightsisters, including the Force-sensitive Asajj Ventress. Also the homeworld of the Zabrak warriors, including Darth Maul. A remote world, perpetually bathed in blood-red sunlight and home to numerous dangerous predators.\n| rowspan=\"2\" style=\"text-align:center;\" |\n|-\n| Star Wars: The Clone Wars\n| 2011\n| TV series\n|-\n| rowspan=\"2\" |\n| Tales from the Mos Eisley Cantina\n| 1995\n| Book\n| rowspan=\"2\" | Forest planet with an ancient Jedi Temple. Home to the horned Devaronian species.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2009\n| TV series\n|-\n|\n| Rogue One\n| 2016\n| Film\n| Rocky, mountainous planet beset by constant severe storms. Home to an Imperial weapons research facility. Its appearance was partly inspired by the fictitious planet LV-426 from the Alien franchise.\n| style=\"text-align:center;\" |\n|-\n| Endor (planet)\n|Return of the Jedi\n|1983\n|Film\n| Blue gas giant with a complex planetary system, including moons like Endor and Kef Bir. This system was controlled by the Empire until the second Death Star was destroyed.\n| style=\"text-align:center;\" |\n|-\n| Endor (moon)\n|Return of the Jedi\n| 1983\n| Film\n| Forest moon that the second Death Star orbits, and home to an Imperial outpost. Inhabited by Ewoks. The location of the battle between the Rebel Alliance and the Empire leading to the destruction of the second Death Star.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars Commander\n| 2014\n| Video game\n| Desert planet located in the galaxy's Outer Rim Territories. Homeworld of the Er'Kit species.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" | Eriadu\n| Darth Maul: Saboteur\n| 2001\n| Book\n| rowspan=\"2\" | Planet located in the galaxy's Outer Rim. Homeworld of Grand Moff Tarkin and his family.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Tarkin\n| 2014\n| Book\n|-\n|rowspan=\"2\"|Esseles\n| Episode I Adventures\n|1999\n|Book\n|rowspan=\"2\"|Under Imperial Control. The Empire has a listening post concealed in Esseles icy ring.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n|Star Wars Squadrons\n|2020\n|Video game\n|-\n|\n|\n| 2019\n| Film\n| rowspan=\"1\" | A stormy planet in the galaxy's \"Unknown Regions\", with its location deliberately obscured by Republic and Jedi efforts. An ancient bastion of the Sith, it serves as the lair of Darth Sidious and the Sith Eternal during the construction of a Sith armada known as the Final Order.\n| style=\"text-align:center;\" rowspan=\"1\" |\n|-\n|\n| Revenge of the Sith\n| 2005\n| Film\n| Jungle planet teeming with plants but little animal life. Aayla Secura is assassinated here during the Great Jedi Purge.\n| style=\"text-align:center;\" |\n|-\n|\n| Andor\n| 2022\n| TV series\n| Desert planet with extensive scrapyard industry and known for its salvage markets.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: The Clone Wars\n| 2009\n| TV series\n| Sulfurous desert planet. Hondo Ohnaka is the leader of a pirate gang based on the planet.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  Darth Vader Strikes\n| 1981\n| Comics\n| rowspan=\"2\" | Imperial manufacturing center with large shipyards.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars Battlefront II\n| 2017\n| Video game\n|-\n|\n| Attack of the Clones\n| 2002\n| Film\n| Rocky desert planet where battle droids are manufactured, and the site of the opening battle of the Clone Wars. All life on the planet is presumed destroyed by the Empire in Star Wars Rebels, with two exceptions: Klik-Klak and his offspring. Primary construction site of the first Death Star. Homeworld of the Geonosians.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  The Rebel Alliance Sourcebook\n| 1990\n| Book\n| rowspan=\"2\" | A planet where the Ghorman Massacre, when the Empire slaughtered a crowd of peaceful protesters, occurred. The Ghorman Massacre was an inciting incident for the growth of the Rebel Alliance. In the legends continuity the massacre was perpetrated by Grand Moff Tarkin. Home to large kalkite reserves and the rebel group the Ghorman Front. The depiction of Ghorman in Andor was inspired by France.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Andor\n| 2025\n| TV series\n|-\n|\n|\n| 2015\n| Film\n| Urban planet and capital of the New Republic. Destroyed by the First Order's Starkiller Base.\n| style=\"text-align:center;\" |\n|-\n| Hoth\n| '\n| 1980\n| Film\n| Desolate ice planet and base for the Rebel Alliance. Homeworld of the Wampas.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" | Iego\n| '\n| 1999\n| Film (mentioned)\n| rowspan=\"2\" | An Outer Rim planet that harbors flying creatures called Xandu and medicinally important plants called Reeska. Iego is surrounded by 1000 moons and at least one of these, named Millius Prime, is home to a race called the Angels.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2009\n| TV series\n|-\n| rowspan=2|\n| Jedi Quest: Path to Truth\n| 2001\n| Book\n| rowspan=2| Remote ice planet where kyber crystals are mined. Converted into Starkiller Base by the First Order and destroyed in The Force Awakens.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2012\n| TV series\n|-\n| rowspan=\"2\" |\n|  Star Wars Episode I Journal: Darth Maul\n| 2000\n| Book\n| rowspan=\"2\" | Home of the Iridonian Zabrak people and formerly rumored birthplace of Darth Maul.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2011\n| TV series (mentioned)\n|-\n| rowspan=\"2\" |\n| Star Wars: Republic\n| 2003\n| Comics\n| rowspan=\"2\" |A desert planet site of the Path where Ben Kenobi helped people to escape from the Empire.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Obi-Wan Kenobi\n| 2022\n| TV series\n|-\n| Jakku\n|\n| 2015\n| Film\n| Desert planet. Site of a \"graveyard\" of ships damaged during the Battle of Jakku, the final battle between the New Republic and the Galactic Empire. Also the homeworld of Rey.\n| style=\"text-align:center;\" |\n|-\n|\n| Rogue One\n| 2016\n| Film\n| Cold desert moon, and a sacred place for believers in the Force. A source of kyber crystals used for lightsabers and the Death Star's primary weapon. It is also the first location on which the Death Star's destructive capability is tested.\nRogue Ones director, Gareth Edwards, has described the location as \"a Mecca or Jerusalem within the Star Wars world\". It is also a homonym for Jeddah, the principal gateway to Mecca.\n| style=\"text-align:center;\" |\n|-\n|Jelucan\n|Star Wars: Lost Stars\n|2015\n|Book\n|A rocky, mountainous planet in the Outer Rim, and the homeworld of Thane Kyrell and Ciena Ree.\n|style=\"text-align:center;\" |\n|-\n| Jestefad\n| Revenge of the Sith\n| 2005\n| Film\n| A large gas planet that is part of the Mustafar system. Directly responsible for Mustafar's volcanic climate due to an intense gravitational tug-of-war with close by gas giant Lefrani.\n| style=\"text-align:center;\" |\n|-\n|\n| Attack of the Clones\n| 2002\n| Film\n| Ocean planet located outside the main galaxy, where cloning technology is developed and the Clone Army is created and trained. Obi-Wan Kenobi discovers that the planet is missing from the Jedi archives; it is later revealed to have been deleted as a part of the Sith plot to start the Clone Wars, and take over the galaxy.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" | Kashyyyk\n| Star Wars Holiday Special\n| 1978\n| TV film\n| rowspan=\"2\" | Forest planet and home of the Wookiees. Also the site of one of the final battles of the Clone Wars.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Revenge of the Sith\n| 2005\n| Film\n|-\n|\n|\n| 2019\n| Film\n| A moon of Endor and the location of some of the wreckage of the second Death Star after it was destroyed in Return of the Jedi. Location of Rey and Kylo Ren's final duel, with the latter rejecting the dark side.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"3\" |\n| Star Wars\n| 1977\n|\n| rowspan=\"3\" | A mining planet that has been fought over by crime lords for its valuable Spice. A fissure vent beneath the spice mines served as a source of astatic coaxium, an element that could be refined into hyperfuel for starships.\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n|  Jedi Search\n| 1994\n| Book\n|-\n| Star Wars Rebels\n| 2014\n| TV series\n|-\n|\n| The Acolyte\n| 2024\n| TV series\n| A forest planet in the Outer Rim. Home to the Wookie Jedi Master Kelnacca.\n|style=\"text-align:center;\" |\n|-\n|\n|\n| 2019\n| Film\n| A frigid mountainous planet. It was the homeworld of Zorii Bliss, leader of the smuggling gang known as the Spice Runners of Kijimi. It is later destroyed by the Xyston-class Star Destroyer Derriphan of the Sith Eternal's fleet, the Final Order, as a show of force for the rest of the galaxy.\n| style=\"text-align:center;\" |\n|-\n|Koboh\n|Star Wars Jedi: Survivor\n|2023\n|Video game\n|A rugged planet known for its abundance of the mineral priorite. Location of Rambler's Reach outpost.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|\n| 1996\n| Book\n| rowspan=\"2\" | Industrial planet home to Kuat Drive Yards, the manufacturer of Star Destroyers.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2009\n|\n|-\n|\n| Catalyst: A Rogue One Novel\n| 2016\n| Book\n| A remote planet with black sands, where Jyn Erso and her parents go into hiding.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars Rebels\n| 2014\n| TV series\n| Remote farm planet and birthplace of Ezra Bridger.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: The Clone Wars\n| 2011\n| TV series\n| A planetary junkyard and hiding place of Darth Maul after his presumed death.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n| Star Wars Knights of the Old Republic II: The Sith Lords\n| 2004\n| Video game\n| rowspan=\"2\" | Desolate Sith world and site of two major battles thousands of year apart: one involving the Scourge of Malachor, the other between Darth Maul, several Rebels, Darth Vader, and several Inquisitors.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars Rebels\n| 2016\n| TV series\n|-\n| rowspan=\"2\" |\n|\n| 1999\n| Film (mentioned)\n| rowspan=\"2\" | Forested planet where podracing is popular. Birthplace of Sebulba and homeworld of the Dug.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2010\n| TV series\n|-\n| rowspan=\"3\" |\n|  Star Wars: Knights of the Old Republic\n| 2003\n|\n| rowspan=\"3\" | Homeworld of the Selkath. The ocean planet is the only known natural source of a medical substance known as kolto.\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n| Star Wars: Aftermath\n| 2015\n| Novel (mentioned)\n|-\n| Star Wars Jedi: Fallen Order\n| 2019\n| Video game (mentioned)\n|-\n| rowspan=\"2\" | Mandalore\n|  Marvel Star Wars\n| 1982\n| Comics\n| rowspan=\"2\" | Outer Rim planet that is the homeworld of the Mandalorians torn by wars between Mandalorians and Jedi and eventually purged by the Empire, scattering the few Mandalorians throughout the galaxy (including Bo-Katan).  Mandalore has one moon, Concordia, which is fully inhabited.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2010\n| TV series\n|-\n|\n| Obi-Wan Kenobi\n| 2022\n| TV series\n|A planet desertified by Galactic Empire where Ben Kenobi and Leia Organa are hiding; first rematch between Kenobi and Vader.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  Star Wars: Empire\n| 2004\n| Comics\n| rowspan=\"2\" | Grassy planet remaining undiscovered until the Clone Wars.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2009\n| TV series\n|-\n| rowspan=\"3\" |\n|  ''Splinter of the Mind's Eye\n| 1978\n| Book\n| rowspan=\"3\" | Swamp planet with perpetual fog and overcast sky.\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n| Star Wars: The Clone Wars\n| 2008\n| TV series (mentioned)\n|-\n| Solo: A Star Wars Story\n| 2018\n| Film\n|-\n|\n| Andor''\n| 2025\n| TV series\n| A grassy, agrarian planet covered in wheat fields spanning towards the horizon, inhabited by farmers looking for a simple life. It is used as a refugee site for several of Cassian Andor's friends after they had fled from Ferrix.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  Dark Empire\n| 1991\n| Comics\n| rowspan=\"2\" | Ocean planet, home to the Mon Calamari and Quarren species. Also known as Mon Calamari, or Dac.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2011\n| TV series\n|-\n| Moraband\n| Star Wars: The Clone Wars\n| 2014\n| TV series\n| Home planet of ancient Sith lords. Known as Korriban in Legends.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: The Clone Wars\n| 2011\n| TV series\n| Planet existing in the spiritual realm within the Force, with a wall surrounding it, home to the three near-omnipotent Force wielders known only in the Jedi Archives as the Mortis Gods. It is said that \"the planet is a conduit through which the Force flows.\"\n| style=\"text-align:center;\" |\n|-\n|\n| Revenge of the Sith\n| 2005\n| Film\n| Volcanic planet and Sith world used by the Techno Union to mine for valuable materials. Hiding place of the Separatist Council during the final days of the Clone Wars, and the location of the duel between Anakin Skywalker and Obi-Wan Kenobi that results in Anakin's disfigurement. During the Imperial Era, it is the location of Darth Vader's personal stronghold.\nIn the VR game Vader Immortal, it is revealed that Mustafar was once forested and very populous, but was left devastated by an ancient battle. It later begins to slowly heal itself, and, by the time of The Rise of Skywalker, trees appear to have regrown on Mustafar's surface.\n| style=\"text-align:center;\" |\n|-\n|\n| Revenge of the Sith\n| 2005\n| Film\n| Cold, urban planet that served as a battle site in the final days of the Clone Wars, as well as the death place of Jedi Master Ki Adi Mundi by Order 66. Colony world of the Muun species.\n| style=\"text-align:center;\" |\n|-\n| Naboo\n|\n| 1999\n| Film\n| Home planet of the Gungans, including Jar Jar Binks, and various humans, who compose a civilization called the Naboo, which includes Padmé Amidala and Palpatine.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  Dark Empire\n| 1991\n| Comics\n| rowspan=\"2\" | Home planet of Jabba and other Hutts. Close to the urban moon of Nar Shaddaa.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2010\n| TV series\n|-\n|\n| Andor\n| 2022\n| TV series\n| The fifth moon orbiting the gas giant Narkina, containing massive lakes, rocky islands, and snowy mesas. Many artificial island prison complexes are where hundreds of inmates are forced to build machines and weapons to power the Imperial Army.\n|style=\"text-align:center;\" |\n|-\n|  Navarro}}\n|\n| 2019\n| TV series\n| A volcanic planet with black sands and lava flows, located in the Outer Rim Territories. Nevarro was a hub of the Bounty Hunter Guild as well as home to a Mandalorian covert in the early days of the New Republic.\n| style=\"text-align:center;\" |\n|-\n|\n| Andor\n| 2022\n| TV series\n| A warm, sunny resort planet with pleasant beaches and calm waters that serves as a destination for outlaws to hide. Under Imperial occupation, it was where Cassian Andor was arrested by Imperial shoretroopers and given a six-year sentence on Narkina 5.\n| style=\"text-align:center;\" |\n|-\n|\n| Solo: A Star Wars Story\n| 2018\n| Film\n| Rainforest paradise that is a haven to smugglers and thieves.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars Jedi: Fallen Order\n| 2019\n| Video game\n|A water moon of Mustafar, base of Fortress Inquisitorius where Ben Kenobi rescues Leia Organa.\n| style=\"text-align:center;\" |\n|-\n|Oba Diah\n|Star Wars: The Clone Wars\n|2014\n|TV series\n|Location of the Pyke Syndicate's stronghold\n| style=\"text-align:center;\"|\n|-\n|\n| Star Wars: Skeleton Crew\n| 2024\n| TV series\n| A frigid moon orbiting a swirling gas giant. Features an ancient telescopic array operated by the astronomer, Kh’ymm. The formal name of this moon, if any, is not currently known, nor is the name of the planet it orbits.\n| style=\"text-align:center;\" |\n|-\n|\n| The Acolyte\n| 2024\n| TV series\n| A planet where the Jedi Order operates a High Republic-era Jedi temple.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  Tales of the Jedi\n| 1994\n| Comics\n| rowspan=\"2\" | Jungle planet where Anakin Skywalker and his padawan Ahsoka Tano lead a revolt against its Separatist-controlled usurpatory king Sanjay Rush during the Clone Wars; birthplace of Saw Gerrera.\n| rowspan=\"2\" style=\"text-align:center;\" |\n|-\n| Star Wars: The Clone Wars\n| 2012\n| TV series\n|-\n| rowspan=\"2\" |\n|\n| 1980\n|\n| rowspan=\"2\" | A planet where Han Solo tells of having a run-in with a bounty hunter.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n|  The Bounty Hunter of Ord Mantell\n| 1981\n| Comics\n|-\n|\n| The Force Awakens\n| 2015\n| Film\n| A verdant planet; home of Luke Skywalker's Jedi Temple.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: The Bad Batch\n| 2023\n| TV series\n| An ocean planet containing an idyllic, thriving village of refugees, fishermen, and moon-yo monkeys on Pabu Island, which would experience seismic activities and sea surges, yet the village would endure and rebuild. Clone Force 99 went into hiding on this planet with help from pirate Phee Genoa after cutting ties with Cid.\n|style=\"text-align:center;\" |\n|-\n|\n|\n| 2019\n| Film\n| A desert planet on the edge of the galaxy, home to the Aki-Aki species.\n| style=\"text-align:center;\" |\n|-\n|\n|Ahsoka\n|2023\n|TV series\n|A barren planet where both Grand Admiral Thrawn and Ezra Bridger were exiled after the events of Star Wars: Rebels. The only known extragalactic planet after Kamino\n|style=\"text-align:center;\" |\n|-\n|\n| Star Wars Battlefront II\n| 2017\n| Video game\n| Uncolonized aquatic planet with over 3 million species, and the location of one of Darth Sidious' observatories.\n| style=\"text-align:center;\" |\n|-\n|\n| Revenge of the Sith\n| 2005\n| Film\n| Outer Rim planetoid within an asteroid field of the same name; birthplace of Luke Skywalker and Leia Organa.\n| style=\"text-align:center;\" |\n|-\n|Raada\n|Ahsoka (novel)\n|2016\n|Book\n|Farming moon in the Outer Rim, where Ahsoka Tano hid under the name \"Ashla\" after Order 66.\n|style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  Dark Force Rising\n| 1992\n| Book\n| rowspan=\"2\" | Tropical planet used by the Republic to monitor the nearby cloning facility on Kamino.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2008\n| TV series\n|-\n| rowspan=\"2\" |\n|  Shadows of the Empire\n| 1996\n| Book\n| rowspan=\"2\" | Home planet of the Rodians, including Greedo. A remote swampy, jungle planet, it was represented by Onaconda Farr in the Galactic Senate during the Clone Wars.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2008\n| TV series\n|-\n| Rugosa\n| Star Wars: The Clone Wars\n| 2008\n| TV series\n| A moon that consists of giant coral reefs. Yoda meets King Katuunko of the Toydarians here after being tested in battle by the Separatist Droid Army, during the early days of the Clone Wars. It is here where King Katuunko pledges Toydaria's allegiance to the Galactic Republic.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  Star Wars Jedi Knight: Dark Forces II\n| 1997\n| Video game\n| rowspan=\"2\" | Barren planet housing the Valley of the Jedi. Site of a great battle between the Sith and the Jedi.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2008\n| TV series\n|-\n| rowspan=\"2\" |\n|  ''Tales from Jabba's Palace''\n| 1995\n| Book\n| rowspan=\"2\" | Dry, hot home planet of the Twi'leks, including Hera Syndulla and Jedi Master Aayla Secura.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2009\n| TV series\n|-\n|\n| Revenge of the Sith\n| 2005\n| Film\n| Primary terrain deserts and swamps. Home of the clone trooper deserter Cut Lawquane. Jedi Master Stass Allie is killed here during the Great Jedi Purge.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n| Star Wars Adventure Journal 9\n| 1996\n| Comics\n| rowspan=\"2\" | Desert and ocean planet. where destitute villages farm wind and refine coaxium. In Solo: A Star Wars Story, the Millennium Falcon arrives there after Han and his crew steal coaxium from Kessel, and Dryden Vos and Tobias Beckett die there.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Solo: A Star Wars Story\n| 2018\n| Film\n|-\n| rowspan=\"2\" |\n| Star Wars Battlefront: Rogue One: Scarif\n| 2016\n| Video game DLC\n| rowspan=\"2\" |Oceanic \"paradise world\" used for construction of the Death Star after the project was moved from Geonosis during the Imperial Era. When Rebel Alliance members raid the Imperial database from the secret base on one of its tropical islands, the planet is destroyed to impede their escape with the Death Star plans.\n| style=\"text-align:center;\" |\n|-\n|Rogue One\n|2016\n|Film\n|style=\"text-align:center;\" |\n|-\n|\n|Ahsoka\n|2023\n|TV series\n|A forest planet with red-leaved trees. Location of the Reflex Point and where Morgan Elsbeth's ship, the Eye of Sion, is built.\n|style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  Darth Bane: Rule of Two\n| 2007\n| Comics\n| rowspan=\"2\" | A planet in the Outer Rim Territories. Homeworld of Count Dooku.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2011\n| TV series\n|-\n|\n| Star Wars: The Clone Wars\n| 2012\n| TV series\n| Home planet of the Togruta, including Jedi Council member Shaak Ti and Padawan Ahsoka Tano.\n| style=\"text-align:center;\" |\n|-\n|Sienar TF73\n|Andor\n|2025\n|TV series\n|Also known as Sienar or 73, it is a snowy planet owned by Sienar Fleet Systems, and was one of many numbered planets owned by the company. It hosted Sienar Test Facility 73 which was infiltrated by Cassian Andor, who stole a prototype TIE Avenger for the Axis network.\n| style=\"text-align: center;\" |\n|-\n|Sissubo\n|Star Wars Squadrons\n|2020\n|Video game\n|Seventh Planet of the  system. It is surrounded by a debris field of remnants of Imperial Ships.\n| style=\"text-align:center;\" |\n|-\n| Skako Minor\n| Star Wars: The Clone Wars\n| 2020\n| TV series\n| Home planet of Wat Tambor. Known for its highly pressurized atmosphere, necessitating specialized suits to be worn by all off-world Skakoans.\n| style=\"text-align:center;\" |\n|-\n|\n|\n| 2019\n| TV series\n| A forested backwater planet in the Outer Rim mostly populated by human farmers who harvest krill which is used to make spotchka, a popular drink on the planet. Local farmers are constantly attacked by Klatooinians.\n| style=\"text-align:center;\" |\n|-\n|\n| Attack of the Clones\n| 2002\n|\n| Mining planet mentioned by Dexter Jettster who spent time prospecting there. Located near Kamino, beyond the Outer Rim.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"3\" |\n| Return of the Jedi\n| 1983\n|\n| rowspan=\"3\" | A volcanic planet whose atmosphere was highly toxic forcing the native Sullustans to build technologically advanced subterranean cities. It was the base of Imperial factories and the SoroSuub corporation employed roughly half the population.\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n| Star Wars: Rogue Squadron\n| 1998\n| Video game\n|-\n| Star Wars: Battlefront\n| 2015\n| Video game\n|-\n|\n|\n| 2015\n| Film\n| Forest planet and site of Maz Kanata's castle. Neutral territory between First Order and Resistance.\n| style=\"text-align:center;\" |\n|-\n|Tanalorr\n|Star Wars Jedi: Survivor\n|2023\n|Video game\n|A planet strong with the Force, hidden inside a nebula near Koboh. Home of Dagan Gera's Jedi Temple.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  Star Wars: Knights of the Old Republic\n| 2003\n|\n| rowspan=\"2\" | A heavily populated urban planet, destroyed by Darth Malak's bombardment in 3956 BBY\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: Aftermath\n| 2015\n| Novel\n|-\n| Tatooine\n|\n| 1977\n| Film\n| Desert planet and childhood home of Anakin Skywalker and Luke Skywalker. Location of Jabba the Hutt's palace.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"3\" |\n|  Star Wars: Knights of the Old Republic II: The Sith Lords\n| 2004\n|\n| rowspan=\"3\" | Mountainous planet in the Outer Rim. Homeworld of one of Darth Revan's companions aboard the Ebon Hawk, Carth Onasi.\n| style=\"text-align:center;\" rowspan=\"3\" |\n|-\n| Catalyst: A Rogue One Novel\n| 2016\n| Novel (mentioned)\n|-\n| Star Wars: Skeleton Crew\n| 2024\n| TV series (mentioned)\n|-\n|\n|\n| 2008\n|\n| During the Clone Wars, Jabba's son Rotta is abducted by the Separatists and brought to this planet. Anakin and Ahsoka Tano travel to Teth and rescue Rotta from Asajj Ventress.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: The Clone Wars\n| 2010\n| TV series\n| Home planet of Watto and other Toydarians. Close to Nal Hutta.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  The Mandalorian Armor\n| 1998\n|\n| rowspan=\"2\" | Homeworld of the Trandoshan hunters. In the same solar system as Kashyyyk.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Clone Wars\n| 2011\n| TV series\n|-\n|Ueda\n|The Acolyte\n|2024\n|TV Series\n|Planet home to a village that contained the Lomi Usqi Noodle Shop.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars: The Clone Wars\n| 2011\n| TV series\n| Planet with a thick, foggy atmosphere. Home to the Umbarans.\n| style=\"text-align:center;\" |\n|-\n| Utapau\n| Revenge of the Sith\n| 2005\n| Film\n| Remote planet, covered in deep sinkholes and home to the Utai and Pau'ans. Site of General Grievous' death and a separatist base during the last days of the Clone Wars.\n| style=\"text-align:center;\" |\n|-\n|\n| Solo: A Star Wars Story\n| 2018\n| Film\n| Icy, mountainous planet that is the site of a Crimson Dawn train heist led by Tobias Beckett in Solo: A Star Wars Story.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars Battlefront II\n| 2017\n| Video game\n| Imperial stronghold and home to Iden and Garrick Versio. One of the first targets of Operation: Cinder, and later a First Order base for their kidnapping of children to become the next generation of stormtroopers.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  Heir to the Empire\n| 1991\n| Book\n| rowspan=\"2\" | A mountainous jungle planet where the Empire conducts cloning experiments and imprisons decommissioned and seditious clone troopers atop a hidden base on Mount Tantiss. In Legends, Grand Admiral Thrawn gains access to one of Palpatine's stockpiles.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: The Bad Batch\n| 2021\n| TV series\n|-\n|\n| Rogue One\n| 2016\n| Film\n| A desolate wasteland and the site of an Imperial penal labor colony.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" |\n|  The New Rebellion\n| 1996\n| Book\n| rowspan=\"2\" | A planet near an asteroid field where Saw Gerrara raises Jyn Erso after her father is taken by the Empire.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: Rebel Rising\n| 2017\n| Book\n|-\n| Yavin\n| Star Wars\n| 1977\n| Film\n| Gas planet with several moons, including Yavin 4.\n| style=\"text-align:center;\" |\n|-\n| Yavin 4\n| Star Wars\n| 1977\n| Film\n| Forest moon and base for the Rebel Alliance.\n| style=\"text-align:center;\" |\n|-\n| Zeffo\n| Star Wars Jedi: Fallen Order\n| 2019\n| Video game\n| A planet with many mountains and stormy weather. Featuring ancient ruins and tombs, imperial excavations, and a crashed Venator near an ancient tomb.\n| style=\"text-align:center;\" |\n|-\n| Zygerria\n| Star Wars: The Clone Wars\n| 2011\n| TV series\n| A planet in the Outer Rim Territories home of the Zygerrian species. Zygerria was also known for a slave empire.\n| style=\"text-align:center;\" |\n|}\nStar Wars Legends planets and moons\nThese are planets with multiple appearances in the Star Wars Expanded Universe, now rebranded as Star Wars Legends. The accompanying works were declared non-canon by Lucasfilm in April 2014, following its acquisition by The Walt Disney Company in October 2012.\n{| class=\"wikitable sortable\" border=\"1\"\n|-\n! scope=\"col\" | Name\n! scope=\"col\" | First appearance\n! scope=\"col\" | Year\n! scope=\"col\" | Media\n! scope=\"col\" class=\"unsortable\" | Fictional description\n! scope=\"col\" class=\"unsortable\" |\n|-\n| Abregado-rae\n| Heir to the Empire\n| 1991\n| Book\n| The base of operations for the smuggler Talon Karrde.\n| style=\"text-align:center;\" |\n|-\n| Ambria\n| Tales of the Jedi\n| 1991\n| Comics\n| The site of an ancient battle between Jedi and Sith.\n| style=\"text-align:center;\" |\n|-\n| Anoth\n| Dark Apprentice\n| 1994\n| Book\n| Rocky planet used to conceal the newly born Solo children.\n| style=\"text-align:center;\" |\n|-\n| Arkania\n| Tales of the Jedi\n| 1994\n| Comics\n| Gem mining planet with humanoid inhabitants.\n| style=\"text-align:center;\" |\n|-\n| Bakura\n|\n| 1993\n| Book\n| Peaceful planet which issues a distress call when invaded by the Ssi-ruuk.\n| style=\"text-align:center;\" |\n|-\n| Bonadan\n| ''Han Solo's Revenge\n| 1979\n| Book\n| Corporate sector planet which lures a young Han Solo into a trap.\n| style=\"text-align:center;\" |\n|-\n| Borleias\n| Rogue Squadron\n| 1996\n| Book\n| Planet used as a stepping-stone for the New Republic to retake Coruscant.\n| style=\"text-align:center;\" |\n|-\n|\n| Dark Empire''\n| 1991\n| Comics\n| Planet chosen as the base of operations for a clone of Emperor Palpatine. Located very close to the center of the galaxy. It is destroyed by the Dark Empire's weapon, the Galaxy Gun. Included in at least one canon map.\n| style=\"text-align:center;\" |\n|-\n| Carida\n| Jedi Search\n| 1994\n| Book\n| Planet destroyed by the vengeful ex-Jedi Kyp Durron.\n| style=\"text-align:center;\" |\n|-\n| Da Soocha V\n| Dark Empire\n| 1991\n| Comics\n| Moon in Hutt space housing a provisional Rebel base under siege from the Palpatine clone. Capital of the New Republic between the Dark Empire recapture of Coruscant and its destruction. It is destroyed by the Galaxy Gun.\n| style=\"text-align:center;\" |\n|-\n| Drall\n| Ambush at Corellia\n| 1995\n| Book\n| A planet in the Corellian system whose inhabitants, the Drall, try to keep a low profile.\n| style=\"text-align:center;\" |\n|-\n| Dromund Kaas\n| Star Wars Jedi Knight: Mysteries of the Sith\n| 1998\n| Video game\n| A jungle planet and capital world of the Resurgent Sith Empire. Consumed with dark side energy and heavily electrified, site of the Imperial Citadel.\n| style=\"text-align:center;\" |\n|-\n| Dxun\n| Tales of the Jedi\n| 1993\n| Comics\n| Largest of the four moons of Onderon. Covered in dense jungles teeming with predatory animals. The location of Mandalore the Indomitable's death near the end of the Great Sith War.\n| style=\"text-align:center;\" |\n|-\n| Hapes\n|\n| 1994\n| Book\n| Planet whose prince tries to marry Princess Leia.\n| style=\"text-align:center;\" |\n|-\n| Honoghr\n| Dark Force Rising\n| 1992\n| Book\n| Planet whose warrior race is recruited by Grand Admiral Thrawn.\n| style=\"text-align:center;\" |\n|-\n| Ithor\n| Children of the Jedi\n| 1995\n| Book\n| Forest planet inhabited by pacifists who run a tourism industry.\n| style=\"text-align:center;\" |\n|-\n| J't'p'tan\n| Before the Storm\n| 1996\n| Book\n| A planet where Luke Skywalker tries to learn the identity of his mother.\n| style=\"text-align:center;\" |\n|-\n|\n| Darksaber\n| 1995\n| Book\n| Planet home to an insular society of clones.\n| style=\"text-align:center;\" |\n|-\n|\n| Tales of the Jedi\n| 1994\n| Comics\n| A planet used by generations of Sith lords. Known as Moraband in canon works.\n| style=\"text-align:center;\" |\n|-\n|\n| Shadows of the Empire\n| 1996\n| Book\n| Bothan colony with a facility housing the second Death Star's plans.\n| style=\"text-align:center;\" |\n|-\n| rowspan=\"2\" | Lwhekk\n|\n| 1993\n| Book (mentioned)\n| rowspan=\"2\" | Home planet of the Ssi-ruuk military society.\n| style=\"text-align:center;\" rowspan=\"2\" |\n|-\n| Star Wars: Empire at War\n| 2006\n| Video game\n|-\n|\n| Specter of the Past\n| 1997\n| Book\n| Capital of the Intergalacting Banking Clan and homeworld of the Muun race, which includes Separatist leader San Hill and Sith Lord Darth Plagueis. The site of battles depicted in Star Wars: Clone Wars.\n| style=\"text-align:center;\" |\n|-\n| Myrkr\n| Heir to the Empire\n| 1991\n| Book\n| Treacherous swamp planet used by Talon Karrde and Mara Jade.\n| style=\"text-align:center;\" |\n|-\n| N'zoth\n| Before the Storm\n| 1996\n| Book\n| Desert planet home to a violent and genocidal species.\n| style=\"text-align:center;\" |\n|-\n| Nkllon\n| Heir to the Empire\n| 1991\n| Book\n| Barren planet, home to a mining venture by Lando Calrissian.\n| style=\"text-align:center;\" |\n|-\n|\n| Star Wars (radio)\n| 1981\n| Radio drama\n| Core world and galactic trading centre, occupied by Imperial forces under Lord Tion.\n| style=\"text-align:center;\" |\n|-\n| Rattatak\n| Star Wars: Clone Wars\n| 2003\n| TV series\n| Outer Rim planet and former home to Asajj Ventress. Homeworld of the white-skinned Rattataki. Ruled by various warlords.\n| style=\"text-align:center;\" |\n|-\n| Sacorria\n| Ambush at Corellia\n| 1995\n| Book\n| Planet near Corellia which attempts a coup against the New Republic.\n| style=\"text-align:center;\" |\n|-\n| Selonia\n| Assault at Selonia\n| 1996\n| Book\n| Ocean planet and the original home of many who reside on Sacorria.\n| style=\"text-align:center;\" |\n|-\n|\n|\n| 1997\n| Book\n| Rainforest planet controlled by the Bacta Cartel.\n| style=\"text-align:center;\" |\n|-\n| Toprawa\n| Star Wars (radio)\n| 1981\n| Radio drama\n| Imperial security facility and source of the first Death Star plans (supplanted by Scarif in Rogue One).\n| style=\"text-align:center;\" |\n|-\n|\n| Dark Apprentice\n| 1994\n| Book\n| A planet disrupted by an accidental crash of Admiral Ackbar's ship.\n| style=\"text-align:center;\" |\n|-\n| Zonama Sekot\n| Rogue Planet\n| 2000\n| Book\n| A living, sentient world capable of traveling through space; source of the fastest ships in the galaxy. It is the seed of Yuuzhan'Tar, the Yuuzhan Vong homeworld.\n| style=\"text-align:center;\" |\n|-\n|}\nSimilarities to real-world planets\nartist's impression of OGLE-2005-BLG-390Lb, an exoplanet compared to the ice planet Hoth]]\nThe discovery of exoplanets in the real-world universe gained pace in the early 21st century. In 2015, the US space agency NASA published an article which stated that many of the newly discovered astronomical bodies possessed scientifically confirmed properties that are similar to planets in the fictional Star Wars universe.\nKepler-452b, a rocky super-Earth-type planet, is said to be similar to the Star Wars planet Coruscant. Likewise, the planets Kepler-16b and Kepler-453b, planets discovered orbitting binary stars probably resemble the desert world Tatooine. The hot, molten worlds of Kepler-10b and Kepler-78b are comparable to the volcanic planet Mustafar. OGLE-2005-BLG-390Lb, a cold, remote exoplanet, is like the ice planet Hoth. Kepler-22b, thought by scientists to be an ocean planet, is compared to the planet Kamino. According to NASA, there are also similarities to Alderaan and Endor in the real-world universe.\n}}\nSources\n*  Content in this article was copied from [https://starwars.fandom.com/wiki/The_galaxy The galaxy] at the Wookieepedia, the Star Wars Wiki, which is licensed under the [https://creativecommons.org/licenses/by-sa/3.0/ Creative Commons Attribution-Share Alike 3.0 (Unported) (CC-BY-SA 3.0) license].\n*\n*\n*\n*\n*\nExternal links\n* [https://www.starwars.com/news/galaxy-building-from-alderaan-to-utapau Galaxy Building, from Alderaan to Utapau] at StarWars.com (official)\n* [http://www.escapistmagazine.com/articles/view/scienceandtech/columns/forscience/11200- Star Wars Canon: Just How Realistic Are the Single-Biome Planets?]  at The Escapist\n*\n* [http://www.swgalaxymap.com/search/ Interactive map of Star Wars galaxy]"
    }
  ]
}