{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in Montenegro__disambig_1\n\n}}\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) World Heritage Sites are places of importance to cultural or natural heritage as described in the UNESCO World Heritage Convention, established in 1972. Montenegro, which declared independence in 2006 following the breakup of Yugoslavia and the dissolution of Serbia and Montenegro, acceded to the convention on 3 June 2006.\nThere are four sites in Montenegro on the list and a further six on the tentative list (the official list of sites that may be considered for future submission). The first site in Montenegro to be added to the list was Natural and Culturo-Historical Region of Kotor, inscribed at the 3rd UNESCO session in 1979. Durmitor National Park was inscribed in 1980 and extended in 2005. These two sites were first added to the list when Montenegro was still a part of Yugoslavia. In addition, there are two transnational sites on the list. The site Stećci Medieval Tombstone Graveyards, inscribed in 2016, is shared with Bosnia and Herzegovina, Croatia, and Serbia, while the site Venetian Works of Defence between the 16th and 17th centuries is shared with Croatia and Italy. The Durmitor National Park is listed as a natural site while the other three are cultural sites, as determined by the organization's selection criteria.\nAt the time of its inscription in 1979, the site Natural and Culturo-Historical Region of Kotor was immediately listed as endangered, due to the damage it sustained in an earthquake registering 6.9 Mw that affected the area earlier that year. Following restoration, largely financed by the UNESCO, it was removed from the list of endangered sites in 2003.\n__TOC__\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural, and vii through x are natural.\n|Transnational site|outline=silver}}\n{| class=\"wikitable sortable plainrowheaders\"\n|-\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (municipality)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" data-sort-type=\"number\"|\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" | Natural and Culturo-Historical Region of Kotor\n| align=center |\n| Kotor, Herceg Novi, Tivat\n| align=center | 1979\n| 125; i, ii, iii, iv (cultural)\n| The Bay of Kotor, a strategic natural harbour in the Eastern Adriatic, was an important center of arts and commerce during the Middle Ages. The value of the region is embodied in the quality of the architecture in its fortified and open cities, settlements, palaces and monastic ensembles, and their harmonious integration to the cultivated terraced landscape on the slopes of high rocky hills. The site includes the cities of Kotor, Perast, and Risan, as well as the fortifications of Kotor. Between 1979 and 2003, the site was listed as endangered due to the damage caused by the 1979 Montenegro earthquake. Minor modifications of the site boundaries took place in 2012 and 2015.\n|-\n! scope=\"row\" | Durmitor National Park\n| align=center |\n| Žabljak\n| align=center | 1980\n| 100; vii, viii, x (natural)\n| Durmitor is a limestone massif that is part of Dinaric Alps. It was shaped by the glaciers and is traversed by river canyons, of which the Tara River Canyon has the deepest river gorges in Europe, at about . There are 18 glacial lakes in the park, the largest is the Black Lake. Durmitor is also an important biodiversity spot. Following the inscription to the UNESCO World Heritage List in 1980, the borders of the site were modified in 2005 to be in line with the national park boundaries.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\" | Stećci Medieval Tombstones Graveyards\n|\n| Žabljak, Plužine\n| align=center | 2016\n| 1504; iii, vi (cultural)\n| Stećci (sing. stećak) or the medieval tombstones are the monolith stone monuments found in the regions of the present Bosnia and Herzegovina, parts of Croatia, Serbia, and Montenegro. They first appeared in the 12th century and reached their peak in the 14th and 15th century. There are three sites inscribed in Montenegro, two at Žabljak and one at Plužine.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\" | Venetian Works of Defence between the 16th and 17th centuries: Stato da Terra – Western Stato da Mar\n|\n| Kotor\n| align=center | 2017\n| 1533; iii, iv (cultural)\n| This property comprises six components of defence works in Italy, Croatia, and Montenegro, spanning more than  between the Lombard region of Italy and the eastern Adriatic Coast. The design of the fortifications (termed alla moderna) was marked by the introduction of gunpowder to warfare, which led to significant shifts in military techniques and architecture. The fortifications of Kotor is the part of the site in Montenegro.\n|}\nTentative list\nIn addition to the sites inscribed on the World Heritage List, member states can maintain a list of tentative sites that they may consider for nomination. Nominations for the World Heritage List are only accepted if the site was previously listed on the tentative list. , Montenegro recorded six sites on its tentative list.\n{| class=\"wikitable sortable plainrowheaders\"\n|-\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location (municipality)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" | UNESCO criteria\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\" | Cetinje Historic Core\n|\n| Cetinje\n| align=center | 2010\n| ii, iii, vi (cultural)\n| The town of Cetinje was the old royal capital of Montenegro, as well as an important religious center. It was founded in the 15th century and saw major urban development in the 19th century.\n|-\n! scope=\"row\" | Old Town of Bar\n|\n| Bar\n| align=center | 2010\n| ii iii, v (cultural)\n| The town of Bar, a seaport in southern Montenegro, represents a composition of several Mediterranean cultures: Illyrian, Hellenistic, Roman, Byzantine, Slavic, Venetian and Ottoman. It is an important archaeological site from the Medieval period.\n|-\n! scope=\"row\" | Doclea\n|\n| Podgorica\n| align=center | 2010\n| ii iii, vi (cultural)\n| Doclea was a typical Roman town with features such as the forum, temples, spas, and urban villas. It was ravaged in the 5th century by the Western and Eastern Goths, and saw some revival in the 9th century. Roman necropoli are found around the town.\n|-\n! scope=\"row\" | Biogradska Gora National Park\n|\n| Kolašin\n| align=center | 2010\n| vii, viii, x (natural)\n| The national park, a home to one of the last European virgin forests, is an important biodiversity spot. It encompasses the catchment area of the Biograd River in the central part of the mountain massif of Bjelasica. The mountains reach above  and there are six glacial lakes.\n|-\n! scope=\"row\" | Ulcinj Old town\n|\n| Ulcinj\n| align=center | 2018\n| ii, iv, v (cultural)\n| The Old Town preserves cultural layers that were created during several historical periods, which is indicated by archaeological remains and architectural structures. It is also an exceptional example of traditional settlements of this type that continuously developed and adapted to the natural configuration of the terrain at one of the most recognizable points of the Montenegrin Littoral.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\" | Ancient and Primeval Beech Forests of the Carpathians and Other Regions of Europe*\n|\n| Kolašin\n| align=center | 2019\n| ix (natural)\n| The nomination aims to extend the serial property by including one component of Montenegro's Biogradska Gora National Park. The Virgin Forest Reserve of Biogradska Gora is characterized by a large number of complex ecosystems, with a high degree of refugial habitats, as well as a considerable number of endemic and rare plant and animal species.\n|}\nReferences\nSee also\n*List of national parks of Montenegro"
    }
  ]
}