{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in France__disambig_1\n\n{| style=\"background:transparent; margin:auto; float:center;\"\n|colspan=2|\n}}\n|-\n|\n}}\n|}\nThis is a list of World Heritage Sites in France with properties of cultural and natural heritage in France as inscribed on UNESCO's World Heritage List or as on the country's tentative list. France accepted the Convention Concerning the Protection of the World Cultural and Natural Heritage on 27 June 1975, after which it could nominate properties on their territory to be considered for the World Heritage List.\nAs of 2025, 54 properties in France are inscribed on the World Heritage List. 45 of these are cultural properties, 7 are natural properties, and 2 are mixed. Six properties are transboundary properties. The first was added to the list in 1979 and the latest in 2025. Five properties were submitted in 1979. The tentative list of France contains 32 properties.\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural, and vii through x are natural.\n{|class=\"wikitable sortable plainrowheaders\"\n|+\n|-\n! style=\"width:100px;\" scope=\"col\"| Site\n! class=\"unsortable\"  style=\"width:150px;\" scope=\"col\"| Image\n! style=\"width:80px;\" scope=\"col\"| Location (region)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" data-sort-type=\"number\"|\n! scope=\"col\" class=\"unsortable\" | Description\n|-\n! scope=\"row\" | Abbey Church of Saint-Savin-sur-Gartempe\n|\n| Nouvelle-Aquitaine\n| 1983\n| 230quater; i, iii (cultural)\n|\n|-\n! scope=\"row\" | Cistercian Abbey of Fontenay\n|\n| Bourgogne-Franche-Comté\n| 1981\n| 165bis; iv (cultural)\n|\n|-\n! scope=\"row\" |Arles, Roman and Romanesque Monuments\n|\n| Provence-Alpes-Côte d'Azur\n| 1981\n| cultural\n|\n|-\n! scope=\"row\" |Vézelay, Church and Hill\n|\n| Bourgogne-Franche-Comté\n| 1979\n| cultural\n|\n|-\n! scope=\"row\" | Belfries of Belgium and France\n|\n| Hauts-de-France\n| 1999\n| cultural\n| Transboundary property, shared with Belgium; extension of the former Belfries of Flanders and Wallonia\n|-\n! scope=\"row\" | Bordeaux, Port of the Moon\n|\n| Nouvelle-Aquitaine\n| 2007\n| cultural\n|\n|-\n! scope=\"row\" | Canal du Midi\n|\n| Occitania\n| 1996\n| cultural\n|\n|-\n! scope=\"row\" | Amiens Cathedral\n|\n| Hauts-de-France\n| 1981\n| cultural\n|\n|-\n! scope=\"row\" | Bourges Cathedral\n|\n| Centre-Val de Loire\n| 1992\n| cultural\n|\n|-\n! scope=\"row\" | Chartres Cathedral\n|\n| Centre-Val de Loire\n| 1979\n| cultural\n|\n|-\n! scope=\"row\" | Cathedral of Notre-Dame, Former Abbey of Saint-Remi, and Palace of Tau, Reims\n|\n| Grand Est\n| 1991\n| cultural\n|\n|-\n! scope=\"row\" | The Causses and the Cévennes, Mediterranean agro-pastoral Cultural Landscape\n|\n| Occitania\n| 2011\n| cultural\n|\n|-\n! scope=\"row\" | Historical centre of Avignon: Papal Palace, Episcopal Ensemble and Avignon Bridge\n|\n| Provence-Alpes-Côte d'Azur\n| 1995\n| cultural\n| Palais des Papes, Episcopal Ensemble and Pont Saint-Bénezet\n|-\n! scope=\"row\" |Routes of Santiago de Compostela in France\n|\n| Diverse sites (right-of-way and route)\n| 1998\n| cultural\n|\n|-\n! scope=\"row\" |Episcopal City of Albi\n|\n| Occitania\n| 2010\n| cultural\n|\n|-\n! scope=\"row\" | From the Great Saltworks of Salins-les-Bains to the Royal Saltworks of Arc-et-Senans, the Production of Open-pan Salt\n|\n| Bourgogne-Franche-Comté\n| 1982\n| cultural\n|\n|-\n! scope=\"row\" | Fortifications of Vauban\n|\n| various\n| 2008\n| cultural\n|\n|-\n! scope=\"row\" | Jurisdiction of Saint-Émilion\n|\n| Nouvelle-Aquitaine\n| 1999\n| cultural\n|\n|-\n! scope=\"row\" | Le Havre, the City Rebuilt by Auguste Perret\n|\n| Normandy\n| 2005\n| cultural\n| Built from 1945–1964 by the ''Atelier de Reconstruction du Havre d'Auguste Perret''\n|-\n! scope=\"row\" | Megaliths of Carnac and of the shores of Morbihan\n|\n| Brittany\n| 2025\n| cultural\n|\n|-\n! scope=\"row\" | Mont Saint-Michel and its Bay\n|\n| Normandy\n| 1979\n| cultural\n|\n|-\n! scope=\"row\" | Palace and Park of Fontainebleau\n|\n| Île-de-France\n| 1981\n| cultural\n|\n|-\n! scope=\"row\" | Palace and Park of Versailles\n|\n| Île-de-France\n| 1979\n| cultural\n|\n|-\n! scope=\"row\" | Paris, Banks of the Seine\n|\n| Île-de-France\n| 1991\n| cultural\n|\n|-\n! scope=\"row\" | Place Stanislas, Place de la Carrière, and Place d'Alliance in Nancy\n|\n| Grand Est\n| 1983\n| cultural\n|\n|-\n! scope=\"row\" | Pont du Gard (Roman Aqueduct)\n|\n| Occitanie\n| 1985\n| cultural\n|\n|-\n! scope=\"row\" | Provins, Town of Medieval Fairs\n|\n| Île-de-France\n| 2001\n| cultural\n|\n|-\n! scope=\"row\" | Historic site of Lyon\n|\n| Auvergne-Rhône-Alpes\n| 1998\n| cultural\n|\n|-\n! scope=\"row\" | Prehistoric pile dwellings around the Alps\n|\n| Bourgogne-Franche-Comté, Auvergne-Rhône-Alpes\n| 2011\n| cultural\n| A series of prehistoric pile-dwelling (or stilt house) settlements in and around the Alps. transboundary property, shared with Austria, Germany, Italy, Slovenia, Switzerland, 11 of the total 111 sites are in France.\n|-\n! scope=\"row\" | Prehistoric Sites and Decorated Caves of the Vézère Valley\n|\n| Nouvelle-Aquitaine\n| 1979\n| cultural\n|\n|-\n! scope=\"row\" | Strasbourg – From the Grande Île to the Neustadt\n|\n| Grand Est\n| 1988\n| cultural\n|\n|-\n! scope=\"row\" | Roman Theatre and its Surroundings and the \"Triumphal Arch\" of Orange\n|\n| Provence-Alpes-Côte d'Azur\n| 1981\n| cultural\n|\n|-\n! scope=\"row\" | The Loire Valley between Sully-sur-Loire and Chalonnes\n|\n| Centre-Val de Loire, Pays de la Loire\n| 2000\n| cultural\n| An outstanding cultural landscape of great beauty, containing historic towns and villages, great architectural monuments (the châteaux), and cultivated lands formed by many centuries of interaction between their population and the physical environment, primarily the river Loire itself.\n|-\n! scope=\"row\" | Historic Fortified City of Carcassonne\n|\n| Occitanie\n| 1997\n| cultural\n|\n|-\n! scope=\"row\" | Gulf of Porto: Calanche of Piana, Gulf of Girolata, Scandola Reserve\n|\n| Corsica\n| 1983\n| natural\n|\n|-\n! scope=\"row\" | Lagoons of New Caledonia: Reef Diversity and Associated Ecosystems\n|\n| New Caledonia\n| 2008\n| natural\n| Diversity of ecosystems in New Caledonia Barrier Reef\n|-\n! scope=\"row\" | The Pitons, Cirques and Remparts of Réunion Island\n|\n| Réunion\n| 2010\n| natural\n|\n|-\n! scope=\"row\" | Pyrénées – Mont Perdu\n|\n| Occitanie\n| 1997\n| mixed\n| Transboundary property, shared with Spain\n|-\n! scope=\"row\" | Nord-Pas de Calais Mining Basin\n|\n| Hauts-de-France\n| 2012\n| cultural\n| Remarkable landscape shaped by three centuries of coal extraction.\n|-\n! scope=\"row\" | Decorated Cave of Pont d’Arc, known as Grotte Chauvet-Pont d’Arc, Ardèche\n|\n| Auvergne-Rhône-Alpes\n| 2014\n| cultural\n| Earliest-known and best-preserved figurative drawings in the world.\n|-\n! scope=\"row\" | The Climats, terroirs of Burgundy\n|\n| Bourgogne-Franche-Comté\n| 2015\n| cultural\n| An outstanding example of grape cultivation and wine production developed since the High Middle Ages.\n|-\n! scope=\"row\" | Champagne Hillsides, Houses and Cellars\n|\n| Grand Est\n| 2015\n| cultural\n| Sites where the method of producing sparkling wines was developed.\n|-\n! scope=\"row\" | The Architectural Work of Le Corbusier, an Outstanding Contribution to the Modern Movement\n|\n| Nouvelle-Aquitaine, Bourgogne-Franche-Comté, Île-de-France, Grand Est, Provence-Alpes-Côte d'Azur, Auvergne-Rhône-Alpes\n| 2016\n| cultural\n| Testimonial to the invention of a new architectural language. A transnational serial property shared with Argentina, Belgium, Germany, India, Japan and Switzerland.\n|-\n! scope=\"row\" | Taputapuātea\n|\n| French Polynesia\n| 2017\n| cultural\n| A Polynesian political, ceremonial and funerary centre.\n|-\n! scope=\"row\" |Chaine des Puys – Limagne fault tectonic arena\n|\n| Auvergne-Rhône-Alpes\n| 2018\n| natural\n| A geologically important site illustrating the process of continental rifting.\n|-\n! scope=\"row\" | French Austral Lands and Seas\n|\n| French Southern and Antarctic Lands\n| 2019\n| natural\n| Remote islands in the Southern Ocean home to unique flora and fauna including a whole slice of Antarctica making this the largest World Heritage Site.\n|-\n! scope=\"row\" | Great Spa Towns of Europe\n|\n| Auvergne-Rhône-Alpes\n| 2021\n| cultural\n| A transnational site of 11 towns in seven European countries that developed around natural mineral water springs and bear witness to the international European spa culture. Spa town of Vichy represents this site in France.\n|-\n! scope=\"row\" | Cordouan Lighthouse\n|\n| Nouvelle-Aquitaine\n| 2021\n| cultural\n| Cordouan Lighthouse embodies the great stages of the architectural and technological history of lighthouses.\n|-\n! scope=\"row\" | Nice, Winter Resort Town of the Riviera\n|\n| Provence-Alpes-Côte d'Azur\n| 2021\n| cultural\n| Nice bears witness to the evolution of the winter resort due to the city's mild climate and seaside location at the foot of the Alps.\n|-\n! scope=\"row\" | Ancient and Primeval Beech Forests of the Carpathians and Other Regions of Europe\n|\n| Diverse sites\n| 2021 (extension to sites in France)\n| natural\n| This transnational property represents an outstanding example of relatively undisturbed, complex temperate forests and exhibit a wide spectrum of comprehensive ecological patterns and processes of pure and mixed stands of European beech across a variety of environmental conditions.\n|-\n! scope=\"row\" | Funerary and memory sites of the First World War (Western Front)\n|\n| Hauts-de-France, Grand Est, Île-de-France\n| 2023\n| cultural\n| Transnational serial site shared with Belgium incorporates 139 cemeteries and memorials on the Western Front of the First World War.\n|-\n! scope=\"row\" | The Maison Carrée of Nîmes\n|\n| Occitania\n| 2023\n| cultural\n| An ancient Roman temple in Nîmes, southern France; one of the best-preserved Roman temples to survive in the territory of the former Roman Empire.\n|-\n! scope=\"row\" | Volcanoes and Forests of Mount Pelée and the Pitons of Northern Martinique\n|\n| Martinique\n| 2023\n| natural\n| Volcanic area of global significance to vulcanology, and home to a number of endemic species.\n|-\n! scope=\"row\" | Te Henua Enata – The Marquesas Islands\n|\n| French Polynesia\n| 2024\n| Mixed\n| Biodiversity hotspot home to rare and diverse flora, emblematic marine species, and one of the most diverse seabird assemblages in the South Pacific. The property also includes archaeological sites.\n|-\n|}\nTentative List\nIn addition to sites inscribed on the World Heritage List, member states can maintain a list of tentative sites that they may consider for nomination. Nominations for the World Heritage List are only accepted if the site was previously listed on the tentative list. , France recorded 32 sites on its tentative list. The sites, along with the year they were included on the tentative list are:\n{|class=\"wikitable sortable plainrowheaders\"\n|+\n|-\n! style=\"width:100px;\" scope=\"col\"| Site\n! class=\"unsortable\"  style=\"width:150px;\" scope=\"col\"| Image\n! style=\"width:80px;\" scope=\"col\"| Location (region)\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\"| UNESCO criteria\n! scope=\"col\" class=\"unsortable\" | Description\n|-\n! scope=\"row\" | Saint-Denis Cathedral\n|\n|Seine-Saint Denis\n|1996\n|i, ii, iv (cultural)\n|\nensemble urbain à pans de bois, cathédrale, église Saint-Ouen, église Saint Maclou, 1996. Rouen: timber-framed urban area, Rouen Cathedral, Basilica of Saint Ouen, Church of Saint Maclou\n*Château de Vaux-le-Vicomte, 1996. Vaux-le-Vicomte Castle\n*Les villes bastionnées des Pays-Bas du nord-ouest de l'Europe, 1996. Fortified cities of the Low Countries of north-western Europe\n*Montagne Sainte-Victoire et sites cézaniens, 1996. Mount Saint Victoire and Paul Cézanne sites\n*Ensemble de grottes à concrétions du Sud de la France, 2000. Concretion cave complexes in southern France\n*Parc national de la Vanoise, 2000. Vanoise National Park\n*Massif du Mont Blanc, 2000. Mont Blanc\n*La Camargue, 2002. The Camargue\n*Bouches de Bonifacio, 2002. Strait of Bonifacio\n*Parc national des Écrins, 2002. Écrins National Park\n*Parc national de Port-Cros, 2002. Port Cros National Park\n*Marais salants de Guérande, 2002. Guérande salt marshes\n*Le rivage méditerranéen des Pyrénées, 2002. Mediterranean shore of the Pyrenees Mountains\n*Rade de Marseille, 2002. Bay of Marseille\n*Les villes antiques de la Narbonnaise et leur territoire : Nîmes, Arles, Glanum, aqueducts, via Domitia, 2002. Roman Narbonensian cities and area: Nîmes, Arles, Glanum, aqueducts, via Domitia\n*Le chemin de fer de Cerdagne, 2002. Cerdagne railway\n*Office National d'Études et de Recherches Aérospatiales, Meudon, 2002. National Aerospace Research Centre, Meudon\n*Hangar Y, 2002. Hangar Y\n*Ancienne chocolaterie Menier à Noisiel, 2002. Former Menier chocolate factory in Noisiel\n*Centre ancien de Sarlat, 2002. Historic centre of Sarlat\n*Arsenal de Rochefort et fortifications de l'estuaire de la Charente, 2002. Rochefort arsenal and fortifications of the Charente Rivers estuary\n* Metz Royal et Impériale, enjeux de pouvoir, confrontations stylistiques et identité urbaine, 2014. Royal and Imperial Metz, power plays, stylistic exchange and urban identity\n*Les Plages du Débarquement, Normandie, 1944, 2014. Allied landing beaches in Normandy, 1944\n*Cité de Carcassonne et ses châteaux sentinelles de montagne, 2017. City of Carcassonne and its mountain sentinel castles.\n*Le Charolais-Brionnais, paysage culturel de l'élevage bovin, 2018. Charolais-Brionnais region, a cultural landscape for cattle farming\n*Domaine de Fontainebleau : château, jardins, parc et forêt, 2020. Fontainebleau Castle, Gardens, Park and Forest\n*Les témoignages matériels de la construction de l’État des Pyrénées : la Co-principauté d’Andorre, 2021. The built heritage of the construction of a State in the Pyrenees: the Co-principality of Andorra\n*Saint-Honorat, Île monastique de l’archipel de Lérins à Cannes, 2022. Saint-Honorat, a monastic island in the Lérins archipelago at Cannes\n*L’observatoire du pic du Midi de Bigorre, pionnier en haute montagne, 2022. Pic du Midi de Bigorre Observatory, a high-altitude pioneer\n*Enclos paroissiaux du Finistère, 2024. Churchyards of Finistère\n|-\n|}\nSee also\n* List of Intangible Cultural Heritage elements in France\n* List of World Heritage Sites in Western Europe\n* Tourism in Brittany\n* Tourism in France\nReferences"
    }
  ]
}