{
  "content": [
    {
      "type": "text",
      "text": "# List of Marshals of the First French Empire\n\n|caption2=|image2=|caption=The baton of a Marshal; although often treated as such, Marshal was not a rank, rather, a reward|image_size=75|history=}}Marshal of the Empire was a civil dignity in the First French Empire between 1804 and 1815. The successor of the dignity, the Marshal of France, is a five-star rank with a NATO code of OF-10, equivalent to an Admiral of France in the French Navy. The distinction was used sporadically and was vacant during parts of its history. A marshal was a grand officer of the Empire, entitled to a high-standing position at the court and to the presidency of an electoral college. In total, Napoleon granted 26 men a marshal's baton.\nUnlike many positions, the Marshal of the Empire distinction was not a rank, rather a reward. Almost all officers to hold the position of Marshal were professional soldiers in the French Army. Some, including Józef Poniatowski, served in foreign armies. Of all 26, 5 were killed in action, or by accident. One Marshal was present at the Battle of Vitoria, fought in 1813, where the Duke of Wellington earned the British equivalent of the distinction. Most had defected to the royalists before the Battle of Waterloo and Napoleon's subsequent defeat, with only four (most notably Marshals Emmanuel de Grouchy and Michel Ney) serving under Napoleon at the Battle of Waterloo.\nAuguste de Marmont, born in 1774, was the youngest officer to earn the distinction, while Francois Kellerman, born in 1735, was the oldest. The majority (18 out of 26) were given the title in 1804, while Grouchy received the last, in 1815, shortly before the Battle of Waterloo.\nList of Marshals\nIndicates that the Marshal was either killed in action or killed by accident|border=1px solid #AAAAAA|text=†}}\n{| class=\"wikitable sortable\"\n|+\n!scope=\"col\"| Name\n!scope=\"col\" class=\"unsortable\" | Image\n!scope=\"col\"| Born\n!scope=\"col\"| Died\n!scope=\"col\"| Date of promotion\n|-\n!scope=\"row\" style=\"background:#e3d9ff;\"| †\n|\n|November 20, 1753\n|June 1, 1815\n|May 19, 1804\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\" style=\"background:#e3d9ff;\"| †\n|\n|\n|\n|\n|-\n!scope=\"row\" style=\"background:#e3d9ff;\"| †\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\" style=\"background:#e3d9ff;\"| †\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|-\n!scope=\"row\" style=\"background:#e3d9ff;\"| †\n|\n|\n|\n|\n|-\n!scope=\"row\"|\n|\n|\n|\n|\n|}\nSee also\n* Field Marshal (United Kingdom)\nNotes\nReferences\n*\n*\n*\n*"
    }
  ]
}