{
  "content": [
    {
      "type": "text",
      "text": "# List of international presidential trips made by Donald Trump\n\nThis is a list of international presidential trips made by Donald Trump, the 45th and 47th president of the United States. Donald Trump made 19 international trips to 25 countries (in addition to visiting West Bank) during his first presidency, which began on January 20, 2017 and ended on January 20, 2021. Trump has made 8 international trips to 13 countries during his second presidency, which began on January 20, 2025.\nDue to the COVID-19 pandemic, he did not make any international trips between February 2020 and the end of his first presidency.\nSummary\nFirst presidency (2017–2021)\nThe number of visits per country where President Trump traveled during his first presidency are:\n* One: Afghanistan, Argentina, Canada, China, Finland, India, Iraq, Israel, North Korea, the Philippines, Poland, Saudi Arabia, Singapore, the Vatican City, and the West Bank\n* Two: Belgium, Germany, Ireland, Italy, South Korea, Switzerland, and Vietnam\n* Three: Japan and the United Kingdom\n* Four: France\nSecond presidency (2025–present)\nThe number of visits per country where President Trump traveled during his second presidency are:\n* One: Canada, Egypt, Israel, Italy, Japan,  Malaysia, the Netherlands, Saudi Arabia, South Korea, the United Arab Emirates and the Vatican City\n* Two: Qatar and the United Kingdom\nFirst presidency\n2017\n{| class=\"wikitable sortable\" style=\"margin:1em auto 1em auto;\"\n|-\n! style=\"width: 3%;\"|\n! width=100|Country\n! width=70|Areas visited\n! width=120|Dates\n! width=550|Details\n! Image\n|-\n|rowspan=7|1\n|\n|Riyadh\n|\n|Met with King Salman and Muslim leaders at the Riyadh Summit. Signed a $110 billion arms deal with Saudi Arabia, and was honored with the Collar of Abdulaziz Al Saud, his first foreign order. Visited, along with First Lady Melania Trump, the National Museum of Saudi Arabia.\n|\n|-\n|\n|Jerusalem\n|\n|Met with President Reuven Rivlin and Prime Minister Benjamin Netanyahu. Visited the Western Wall and the Church of the Holy Sepulchre, the first sitting U.S. president to do so. Visited the Yad Vashem and delivered an address at the Israel Museum.\n|\n|-\n|\n|Bethlehem\n|\n|Met with Palestinian president Mahmoud Abbas.\n|\n|-\n|\n|Rome\n|\n|Met with President Sergio Mattarella and Prime Minister Paolo Gentiloni.\n|\n|-\n|\n| Vatican City\n|\n|Met with Pope Francis.\n|\n|-\n|\n|Brussels\n|\n|Met with King Philippe and Prime Minister Charles Michel. Attended the 28th NATO summit and the U.S.–EU Summit Meeting, where he also met with French president Emmanuel Macron.\n|\n|-\n|\n|Taormina\n|\n|Attended the 43rd G7 summit. Also held a bilateral meeting with Japanese prime minister Shinzo Abe.\n|\n|-\n|rowspan=2|2\n|\n|Warsaw\n|\n|Met with President Andrzej Duda and Croatian president Kolinda Grabar-Kitarović. Attended the 2nd summit of the Three Seas Initiative. He delivered a speech to the People of Poland in front of the Warsaw Uprising Monument at the Krasiński Square to honor victims of the past Nazi occupation and communist domination in Poland.\n|\n|-\n|\n|Hamburg\n|\n|Attended the G-20 summit. Also held bilateral meetings with British prime minister Theresa May, Chinese president & CCP general secretary Xi Jinping, German chancellor Angela Merkel, Indonesian president Joko Widodo, Japanese prime minister Shinzo Abe, Mexican president Enrique Peña Nieto, Russian president Vladimir Putin and Singaporean prime minister Lee Hsien Loong.\n|\n|-\n|3\n|\n|Paris\n|\n|Met with President Emmanuel Macron. Participated in the Bastille Day celebrations marking the 100th anniversary of the entry of the United States into World War I.\n|\n|-\n|rowspan=5|4\n|\n|Kawagoe,Tokyo\n|\n|Met with Emperor Akihito at the Tokyo Imperial Palace and Prime Minister Shinzo Abe at Akasaka Palace.\n|\n|-\n|\n|Osan,Seoul\n|\n|State visit. Met with South Korean president Moon Jae-in, and addressed the South Korean National Assembly. Also met with troops from the Eighth United States Army at Camp Humphreys. This was the president's first trip to a U.S. combat zone.\n|\n|-\n|\n|Beijing\n|\n|State visit. President Trump arrived in Beijing to meet with CCP General Secretary and President Xi Jinping and Premier Li Keqiang.\n|\n|-\n|\n|Da Nang,Hanoi\n|\n|State visit. Met with Communist Party General Secretary Nguyễn Phú Trọng, President Trần Đại Quang and Prime Minister Nguyễn Xuân Phúc. Attended the APEC Vietnam 2017.\n|\n|-\n|\n|Manila,Pasay\n|\n|Attended the 31st ASEAN Summit. Met with President Rodrigo Duterte.\n|\n|}\n2018\n{| class=\"wikitable sortable\" style=\"margin:1em auto 1em auto;\"\n! style=\"width: 3%;\"|\n! width=100|Country\n! width=70|Areas visited\n! width=120|Dates\n! width=550|Details\n! Image\n|-\n|5\n|\n|Davos\n|\n|Attended the World Economic Forum; also held bilateral meetings with British prime minister Theresa May and Israeli prime minister Benjamin Netanyahu.\n|\n|-\n|rowspan=2|6\n|\n|La Malbaie\n|\n|Attended the 44th G7 summit at the Manoir Richelieu in La Malbaie. Also held bilateral meetings with prime minister Justin Trudeau and French president Emmanuel Macron. Trump left the summit several hours early.\n|\n|-\n|\n|Central Area,Sentosa Island\n|\n|After a refueling stop at Crete Naval Base in Greece, President Trump attended the summit meeting with North Korean chairman Kim Jong Un, becoming the first sitting U.S. president to meet a North Korean chairman. Also met with Prime Minister Lee Hsien Loong.\n|\n|-\n|rowspan=3|7\n|\n|Brussels\n|\n|Attended the 29th NATO summit; also held bilateral meetings with NATO secretary general Jens Stoltenberg, French president Emmanuel Macron and German chancellor Angela Merkel.\n|\n|-\n|\n|London,Blenheim Palace,Chequers,Windsor Castle,Turnberry\n|\n|Met with Queen Elizabeth II and Prime Minister Theresa May. Spent weekend in Scotland and visited his golf course in Turnberry.\n|\n|-\n|\n|Helsinki\n|\n|Attended the summit meeting with Russian President Vladimir Putin. Also met with President Sauli Niinistö.\n|\n|-\n|8\n|\n|Paris\n|\n|Met with President Emmanuel Macron. Participated in the Armistice Day celebrations marking the 100th anniversary of the Armistice with Germany that brought major hostilities of World War I to an end. Visited the Suresnes American Cemetery and Memorial.\n|\n|-\n|9\n|\n|Buenos Aires\n|\n|Attended the G-20 summit. Also held bilateral meetings with Argentinian president Mauricio Macri, Australian prime minister Scott Morrison, Chinese president & CCP general secretary Xi Jinping, German chancellor Angela Merkel, Indian prime minister Narendra Modi, Japanese prime minister Shinzo Abe, South Korean president Moon Jae-in, and Turkish president Recep Tayyip Erdoğan.\n|\n|-\n|rowspan=2|10\n|\n|Al Asad Airbase\n|\n|Visited with U.S. military personnel serving in Western Iraq accompanied by First Lady Melania Trump. This was the president's second trip to a U.S. combat zone.\n|\n|-\n|\n|Ramstein Air Base\n|\n|Visited with United States Armed Forces serving in Rhineland-Palatinate, Germany.\n|\n|}\n2019\n{| class=\"wikitable sortable\" style=\"margin:1em auto 1em auto;\"\n! style=\"width: 3%;\"|\n! width=100|Country\n! width=70|Areas visited\n! width=120|Dates\n! width=550|Details\n! Image\n|-\n|11\n|\n|Hanoi\n|\n|Attended the summit meeting with North Korean leader Kim Jong Un. Also met with Communist Party General Secretary and President Nguyễn Phú Trọng and Prime Minister Nguyễn Xuân Phúc. Trump made a refueling stop at an airbase in Qatar on the trip to Vietnam.\n|\n|-\n|12\n|\n|Tokyo,Yokosuka\n|\n|State visit. Met with Emperor Naruhito at the Tokyo Imperial Palace and Prime Minister Shinzo Abe at Akasaka Palace. Visited with troops and delivered remarks on the USS Wasp at Yokosuka Naval Base.\n|\n|-\n|rowspan=\"4\"|13\n|\n|London,Portsmouth\n|\n|\nState Visit. Met with Queen Elizabeth II, Prince Charles, and Duchess Camilla at Buckingham Palace and Prime Minister Theresa May at 10 Downing Street. Laid a wreath on the Tomb of the Unknown Warrior in Westminster Abbey. Attended the 75th anniversary of D-Day commemorative ceremonies.\n|\n|-\n|\n|Shannon,County Clare\n|\n|Met with Taoiseach Leo Varadkar. Spent one night at his International golf resort in Doonbeg.\n|\n|-\n|\n|Colleville,Caen\n|\n|Met with President Emmanuel Macron. Attended the 75th anniversary of D-Day memorial ceremonies. Visited the Normandy American Cemetery and Memorial.\n|\n|-\n|\n|Shannon,County Clare\n|\n|Spent one night at his International golf resort in Doonbeg\n|\n|-\n|rowspan=\"4\"|14\n|\n|Osaka\n|\n|Attended the G-20 summit. Also held bilateral meetings with Australian prime minister Scott Morrison, Brazilian president Jair Bolsonaro, Chinese president & CCP general secretary Xi Jinping, German chancellor Angela Merkel, Indian prime minister Narendra Modi, Japanese prime minister Shinzo Abe, Saudi crown prince Mohammed bin Salman, Turkish president Recep Tayyip Erdoğan and Russian president Vladimir Putin.\n|\n|-\n|rowspan=\"2\"|\n|rowspan=\"2\"|Seoul,Korean Demilitarized Zone\n|rowspan=\"2\"|\n|rowspan=\"2\"|Met with President Moon Jae-in. Visited the Korean Demilitarized Zone. Attended the Koreas–United States DMZ Summit with President Moon and North Korean chairman Kim Jong Un at the Inter-Korean Freedom House on the southern side of the Joint Security Area of the Korean Demilitarized Zone. Visited U.S. troops at Osan Air Base.\n|\n|-\n|\n|-\n|\n|Joint Security Area\n|\n|Briefly walked into the northern side of the Joint Security Area of the Korean Demilitarized Zone, accompanied by North Korean chairman Kim Jong Un, becoming the first sitting U.S. president to enter North Korea.\n|\n|-\n|15\n|\n|Biarritz\n|\n|Attended the 45th G7 summit at the Hôtel du Palais in Biarritz. Also held bilateral meetings with Australian prime minister Scott Morrison, British prime minister Boris Johnson, Canadian prime minister Justin Trudeau, Egyptian president Abdel Fattah el-Sisi, French president Emmanuel Macron, German chancellor Angela Merkel, Indian prime minister Narendra Modi and Japanese prime minister Shinzo Abe.\n|\n|-\n|16\n| Afghanistan\n|Bagram Airfield\n|\n|Visited with U.S. military personnel serving in Eastern Afghanistan accompanied by First Lady Melania Trump. This was the president's fourth trip to a U.S. combat zone. Also met with President Ashraf Ghani.\n|\n|-\n|17\n|\n|London, Watford\n|\n|Attended the 30th NATO summit. Met with Queen Elizabeth II and Prime Minister Boris Johnson. Also held bilateral meetings with Canadian prime minister Justin Trudeau, Danish prime minister Mette Frederiksen, French president Emmanuel Macron, German chancellor Angela Merkel and Italian prime minister Giuseppe Conte.\n|\n|}\n2020\n{| class=\"wikitable sortable\" style=\"margin:1em auto 1em auto;\"\n! style=\"width: 3%;\"|\n! width=100|Country\n! width=70|Areas visited\n! width=120|Dates\n! width=550|Details\n! Image\n|-\n|18\n|\n|Davos\n|\n|Attended the World Economic Forum; also held bilateral meetings with European Commission president Ursula von der Leyen, Iraqi president Barham Salih, Iraqi Kurdish president Nechirvan Barzani, Pakistani prime minister Imran Khan, and Swiss president Simonetta Sommaruga.\n|\n|-\n|19\n|\n|Ahmedabad, Agra, New Delhi\n|\n|Addressed a \"Namaste (Welcome) Trump\" event with Prime Minister Narendra Modi in Ahmedabad. Toured Mahatma Gandhi's Sabarmati Ashram and the Taj Mahal. Received a formal welcome from President Ram Nath Kovind at the Rashtrapati Bhavan Presidential Palace in New Delhi. Conducted a series of meetings with Modi and other government officials, as well as Indian business executives.\n|\n|-\n|}\nSecond presidency\n2025\n{| class=\"wikitable sortable\" style=\"margin:1em auto 1em auto;\"\n|-\n! style=\"width: 3%;\"|\n! width=100|Country\n! width=70|Areas visited\n! width=120|Dates\n! width=550|Details\n! Image\n|-\n|rowspan=\"2\"|1\n|\n|Rome\n|April 25–26\n|Transited through Italy to Vatican City for the funeral of Pope Francis. Spent the night at Villa Taverna, the residence of the U.S. ambassador to Italy.\n|\n|-\n|\n|Vatican City\n|\n|Attended the funeral of Pope Francis at St. Peter's Square.\n|\n|-\n|rowspan=\"3\"|2\n|\n|Riyadh\n|\n|\nMet with Crown Prince Mohammed bin Salman and King Salman. Visited The Royal Court Palace and At-Turaif World Heritage Site for Saudi State dinner. Participated in a Saudi-U.S. Investment Forum at the King Abdulaziz Conference Center. Attended the GCC Summit. Also met with Syrian president Ahmed al-Sharaa, becoming the first sitting U.S. president to meet with a Syrian head of state since 2000.\n|\n|-\n|\n|Doha\n|\n|Met with Emir Tamim bin Hamad Al Thani at the Amiri Diwan. Visited Lusail Palace for Qatari State dinner. Delivered remarks with troops at Al Udeid Air Base.\n|\n|-\n|\n|Abu Dhabi\n|\n|Visited the Sheikh Zayed Grand Mosque. Met with President Mohamed bin Zayed Al Nahyan at Qasr Al Watan. Also visited the Abrahamic Family House. Trump made a refueling stop at RAF Mildenhall in the United Kingdom enroute back to the United States.\n|\n|-\n|3\n|\n|Kananaskis\n|June 15–16\n|Attended the 51st G7 summit. Held bilateral meetings with Prime Minister Mark Carney, German chancellor Friedrich Merz and British prime minister Keir Starmer. Trump left the summit a day early.\n|\n|-\n|4\n|\n|The Hague\n|June 24–25\n|Attended the 35th NATO summit at the World Forum. Met with King Willem-Alexander and Queen Máxima at Huis ten Bosch. Held bilateral meetings with Prime Minister Dick Schoof and NATO Secretary General Mark Rutte.\n|\n|-\n|5\n| rowspan=\"2\" |\n|Turnberry and Aberdeenshire\n|July 25–29\n|Made a private trip to Scotland and visited his golf course in Turnberry as well as his property in Aberdeenshire. He met with European Commission president Ursula von der Leyen and successfully reached a trade deal with the European Union. He also met with Prime Minister Keir Starmer to finalize a trade agreement between the United States and the United Kingdom. Trump had a private dinner with the First minister of Scotland John Swinney, and met in a one to one meeting the following day where they discussed the war in Gaza, the Scottish economy, oil and gas taxation, and trade and tariffs particularly relating to Scotch Whisky.\n|\n|-\n|6\n|Windsor, London, Chequers\n|September 16–18\n|\nState Visit. Met with King Charles III, Queen Camilla, Prince William, and Princess Catherine at Windsor Castle and Prime Minister Keir Starmer at Chequers. Visited tomb of Queen Elizabeth II at the King George VI Memorial Chapel at St George's Chapel.\n|\n|-\n|rowspan=\"2\"|7\n|\n|Jerusalem\n|rowspan=\"2\"|October 13\n|Met with Prime Minister Benjamin Netanyahu, in order to finalize a Gaza hostages-for-ceasefire deal. Also met with hostage families and addressed the Knesset.\n|\n|-\n|\n|Sharm El Sheikh\n|Attended a Middle East Peace Ceremony at the Tonino Lamborghini International Convention Center in order to finalize a Gaza hostages-for-ceasefire deal.\n|\n|-\n|rowspan=\"4\"|8\n|\n|Al Udeid Air Base\n|October 25\n|During a refueling stop en route to Malaysia, attended a bilateral meeting with Emir Tamim bin Hamad Al Thani and Prime Minister Mohammed bin Abdulrahman bin Jassim Al Thani.\n|\n|-\n|\n|Kuala Lumpur\n|October 26–27\n|Attended the 47th ASEAN summit. Also attended the signing ceremony of a Kuala Lumpur Peace Accord with Cambodian prime minister Hun Manet and Thai prime minister Anutin Charnvirakul at the Kuala Lumpur Convention Centre. Met with Prime Minister Anwar Ibrahim, Vietnamese prime minister Phạm Minh Chính and Brazilian president Luiz Inácio Lula da Silva.\n|\n|-\n|\n|Tokyo, Yokosuka\n|October 27–29\n|Met with Emperor Naruhito at the Tokyo Imperial Palace and Prime Minister Sanae Takaichi at Akasaka Palace. Visited with troops and delivered remarks on the USS George Washington at Yokosuka Naval Base.\n|\n|-\n|\n|Gyeongju, Busan\n|October 29–30\n|Met with President Lee Jae Myung at the Gyeongju National Museum. Was awarded the Grand Order of Mugunghwa. Delivered remarks at the APEC CEO Luncheon at Gyeongju Arts Center and participated in a U.S.–APEC Leaders Working Dinner at Hilton Hotel Gyeongju. Also met with Chinese leader Xi Jinping.\n|\n|}\nFuture trips\nThe following international trips are scheduled to be made by Donald Trump during 2025 or 2026:\n{| class=\"wikitable\" style=\"margin:1em auto 1em auto;\"\n|-\n! Country\n! Areas visited\n! Dates\n! Details\n|-\n|\n| Davos\n| January 2026\n| President Trump will attend the World Economic Forum.\n|-\n|\n| TBD\n| April 2026\n| Trump announced in October 2025 that he will visit China in April 2026.\n|}\nMultilateral meetings\nFirst presidency\nMultilateral meetings of the following intergovernmental organizations took place during Donald Trump's first presidency (2017–2021).\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:85%; text-align:center;\"\n|-\n! rowspan=\"2\"|Group !! colspan=\"4\"|Year\n|-\n! 2017 !! 2018 !! 2019 !! 2020\n|-\n| APEC || November 10–11 Đà Nẵng || style=\"background:#ffa07a;\"|November 17–18 Port Moresby ||  Santiago}} ||  Kuala Lumpur}}\n|-\n| EAS(ASEAN) || style=\"background:#ffe4e1;\"|November 13–14 Pasay || style=\"background:#ffa07a;\"|November 14–15 Singapore || style=\"background:#ffa07a;\"|November 4 Bangkok || style=\"background:#ffa07a;\"|November 14(virtual) Hanoi\n|-\n| G7 || May 26–27 Taormina || style=\"background:#ffe4e1;\"|June 8–9 La Malbaie || |August 24–26 Biarritz||  Camp David}}\n|-\n| G20 || July 7–8 Hamburg || November 30 – December 1 Buenos Aires || June 28–29 Osaka ||  Riyadh}}\n|-\n| NATO || May 25 Brussels || July 11–12 Brussels || December 3–4 Watford ||\n|-\n| SOA(OAS) ||  || style=\"background:#ffa07a;\"|April 13–14 Lima || ||\n|-\n| rowspan=\"2\"|Others || rowspan=\"2\"|Riyadh summitMay 20–21 Riyadh || rowspan=\"2\"  || United States–Caribbean summitMarch 22 Mar-a-Lago || rowspan=\"2\"\n|-\n|DMZ summitJune 30 Freedom House\n|-\n! colspan=\"6\"|Vice President Pence attended in his place.• President Trump traveled to the Philippines to attend the ASEAN summit, but ultimately left early and Rex Tillerson participated in his place for the East Asia summit.• Robert C. O'Brien attended in his place.•President Trump left the G7 summit several hours early to travel to Singapore for the summit meeting with North Korean chairman Kim Jong Un.\n|}\nSecond presidency\nMultilateral meetings of the following intergovernmental organizations are scheduled to take place during Donald Trump's second presidency (2025–present).\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:85%; text-align:center;\"\n|-\n! rowspan=\"2\" | Group\n! colspan=\"4\" | Year\n|-\n! 2025\n! 2026\n! 2027\n! 2028\n|-\n| APEC\n|style=\"background:#ffe4e1;\"|October 31 – November 1 Gyeongju\n| Shenzhen}}\n| }}\n| }}\n|-\n| EAS(ASEAN)\n|style=\"background:#ffe4e1;\"|October 26–28 Kuala Lumpur\n|  Manila}}\n|\n|\n|-\n| G7\n| style=\"background:#ffe4e1;\"|June 16–17 Kananaskis\n|  Évian-les-Bains}}\n| }}\n| }}\n|-\n| G20\n| style=\"background:#ffa07a;\"|November 22–23 Johannesburg\n|  Miami}}\n|\n|\n|-\n| NATO\n| June 24–25 The Hague\n|  Ankara}}\n|  Tirana}}\n|\n|-\n| SOA(OAS)\n|\n|  Punta Cana}}\n|\n|\n|-\n| NALS\n|\n|\n|\n|\n|-\n| rowspan=\"3\" | Others\n| Multilateral meeting on UkraineAugust 18 Washington\n| rowspan=\"3\"\n| rowspan=\"3\"\n| rowspan=\"3\"\n|-\n| Gaza peace summitOctober 13 Sharm El Sheikh\n|-\n|C5+1November 6 Washington\n|-\n! colspan=\"6\"|•President Trump unexpectedly left the G7 summit a day early to return to Washington due to the Iran–Israel War.• President Trump traveled to Malaysia to attend the ASEAN summit, but ultimately left early. Scott Bessent attended in his place for the East Asia summit.•  ''President Trump participated in various meetings on the sideline of APEC, but skipped leaders' summit. Scott Bessent attended in his place. •President Trump not only boycotted this G20, but even more, stated that the United States, would not send any representative, citing claims of Afrikaner persecution in South Africa and calling the hosting of the summit there \"a total disgrace\".''\n|}\nSee also\n* Foreign policy of the first Trump administration\n* Foreign policy of the second Trump administration\n* Foreign policy of the United States\n* List of international trips made by Rex Tillerson as United States Secretary of State\n* List of international trips made by Mike Pompeo as United States Secretary of State\n* List of international trips made by Marco Rubio as United States Secretary of State\nReferences\nExternal links\n* [https://history.state.gov/departmenthistory/travels/president/trump-donald-j Travels of President Donald J. Trump]. U.S. Department of State Office of the Historian."
    }
  ]
}