{
  "content": [
    {
      "type": "text",
      "text": "# List of World War II monuments and memorials in Bosnia and Herzegovina\n\nList of World War II monuments and memorials in Bosnia and Herzegovina includes Yugoslav monuments and memorials build on the territory of the present day Bosnia and Herzegovina.\nHistory\nThe Yugoslav authorities established several memorial sites between 1945 and 1960, though widespread building started after the founding of the Non-Aligned Movement.\nYugoslav president Josip Broz Tito commissioned several memorial sites and monuments in the 1960s and 70s dedicated to World War II battle and concentration camp sites. They were designed by notable sculptors, including Dušan Džamonja, Vojin Bakić, Miodrag Živković, Jordan and Iskra Grabul, and architects, including Bogdan Bogdanović, Gradimir Medaković. After Tito's death, a small number were built, and the monuments were popular visitor attractions in the 1980s as patriotic sites, and since the Yugoslav Wars and the dissolution of Yugoslavia, the sites have been abandoned and have lost their importance.\nThe list includes monuments and memorials built between 1945 and 1991, but does not include busts or other statues of individuals (see bottom).\nList\n{| class=\"wikitable\"\n!Image\n!Name\n!Location\n!Notes\n|-\n|\n|Vraca Memorial Park\n|Sarajevo\n|Rehabilitation of old Austro-Hungarian fortress with combined work of Vladimir Dobrović as designer, Alija Kučukalić as sculptor, and Aleksandar Maltarić as landscaper, opened on 25 November 1981.\n|-\n|\n|Partisan cemetery in Mostar\n|Mostar\n|Designed by Bogdan Bogdanović, built in 1965.\n|-\n|\n|Monument to the Revolution\n|Kozara\n|Also known as the Mrakovica Memorial, dedicated to the Battle of Kozara. Designed by Dušan Džamonja. Completed in 1972.\n|-\n|\n|Partisan Memorial, Banja Luka\n|Banja Luka\n|\n|-\n|\n|Valley of heroes\n|Tjentište\n|\n|-\n|\n|Necropolis for the victims of Fascism\n|Novi Travnik\n|Designed by Bogdan Bogdanović, opened in 1975.\n|-\n|\n|Monument to the Revolution\n|Grmeč\n|Located in the Korčanica Memorial Zone of the Grmeč.\n|-\n|\n|Monument to the fallen Frontiersmen\n|Banja Luka\n|Dedicated to fallen frontier soldiers in the Banj hill. Designed by Antun Augustinčić.\n|-\n|\n|Memorial cemetery in Vukosavci\n|Vukosavci\n|Designed by Drago Tršar; built in 1986. Dedicated to the fighters of Majevica partisan detachment that were killed by chetniks in 1942.\n|-\n|\n|Monument to Zenica Partisan Detachment\n|Zenica\n|Built in 1968. Dedicated to fallen fighters of Zenica Partisan Detachment.\n|-\n|\n|Monument to Husino miners\n|Tuzla\n|Designed by Ivan Sabolić. Dedicated to Husino miners fallen in the Husino uprising of 1920 and People's Liberation Struggle 1941–1945.\n|-\n|\n|Eternal flame\n|Sarajevo\n|Built in 1946. Dedicated to Yugoslav army liberators of Sarajevo in 1945.\n|-\n|\n|Monument to fallen fighters\n|Banja Luka\n|\n|-\n|\n|Partisans' Cemetery\n|Prijedor\n|Burial place of National Hero Mladen Stojanović. Approximately 120 Partisan fighters buried here.\n|-\n|\n|Monument to fallen fughters\n|Banja Luka\n|\n|-\n|\n|Monument to victims of fascism\n|Rakovačke bare\n|Dedicated to the mine workers killed by Ustaša on 7 February 1942.\n|-\n|\n|Monument to fallen fighters and victims of fascism\n|Ljubačevo\n|Dedicated to the mine workers killed by Ustaša on 7 February 1942.\n|-\n|\n|''Memorial relief to the People's Liberation Struggle\n|Bihać\n|\n|-\n|\n|Djevojka sa Une\n|Bihać\n|Dedicated to soldiers of the Yugoslav Army fallen during the liberation of Bihać in 1945.\n|-\n|\n|Memorial ossuary of fallen fighters\n|Bratunac\n|\n|-\n|\n|Monument to fallen fighters and victims of fascism\n|Mašići\n|\n|-\n|\n|Monument to the first partisan airport\n|Međuvođe\n|\n|-\n|\n|Monument to victims of fascism\n|Bosanska Kostajnica\n|\n|-\n|\n|Monument to fallen fighters\n|Kotor Varoš\n|\n|-\n|\n|Monument to fallen fighters\n|Baraći\n|\n|-\n|\n|Monument to fallen fighters and victims of fascism\n|Bosanski Novi\n|\n|-\n|\n|Monument to fallen fighters\n|Visoko\n|Opened in 1963.\n|-\n|\n|Monument to fallen fighters\n|Cazin\n|\n|-\n|\n|Partisan cemetery in Livno\n|Near Livno\n|Designed by Vinko Kragic and Frano Buskareli, built in 1972.\n|-\n|\n|Mass Grave\n|Ljeskare, Prijedor municipality\n|Monument erected in the 1980s to mark site of mass grave containing 13 individuals\n|-\n|\n|Monument to the First Partisan Pilots''\n|Prijedor\n|Located beside the 'Urije' airstrip.\n|-\n|\n|Garavice Memorial Park\n|Bihać\n|Designed by Bogdan Bogdanović, built in 1981. Declared a National Monument of Bosnia & Herzegovina in 2011.\n|-\n|\n|Monument in Vogošća\n|Vogošća\n|Designed by Zlatko Ugljen, built in 1969. Commemorates 62 Partisan fighters and Illegal Workers.\n|}\nSee also\n*People's Heroes of Yugoslavia monuments\n*List of Yugoslav World War II monuments and memorials\n*List of World War II monuments and memorials in Serbia\n*List of World War II monuments and memorials in Croatia\n*List of World War II monuments and memorials in Montenegro\n*List of World War II monuments and memorials in North Macedonia\n*List of World War II monuments and memorials in Slovenia"
    }
  ]
}