{
  "content": [
    {
      "type": "text",
      "text": "# List of German-sponsored acts of terrorism during World War I\n\nDuring World War I Imperial Germany funded or inspired a number of terrorist acts in America and abroad. It was hoped that these attacks would harm the war efforts of the Allies or Entente Powers. Spy heads like the American-based German Military Attaché Franz von Papen received money to fund these terrorist activities and distributed them to local actors or German agents. In 1917 the New York Times reported that there were 10,000 German, Austro-Hungarian, Bulgarian, and Ottoman agents in America. While most of the terrorist attacks were amateurish and foiled by local law enforcement, some like the Black Tom explosion caused immense devastation.\nList of state-sponsored terrorist attacks\nState-sponsored terrorism is government support of violent non-state actors engaged in terrorism. States can sponsor terrorist groups in several ways, including but not limited to funding terrorist organizations, providing training, supplying weapons, and hosting groups within their borders.  During WWI, Imperial Germany sponsored multiple terrorist attacks.\n{| class=\"wikitable sortable\"\n|+\n!Date\n!Name\n!Location\n!Status\n!Notes\n!References\n|-\n|\n|Welland Canal Plot\n|Welland Canal, Canada\n| Attack was abandoned when its main plotter saw Canadian defences.\n|\n|\n|-\n|\n| Pencil bomb attacks\n| Allied shipping\n| The incendiary device ignited cargos when ships were far at sea.  It was estimated that the pencil bombs destroyed $10 million (US$ }} million in ) worth of cargo on 36 ships.\n|\n|\n|-\n|\n|1915 Vancouver bridge arson attack\n|Granville Street Bridge, Vancouver\n|Bridge is set on fire, with zero fatalities.\n|\n|\n|-\n|\n|Fay Bombing Plot\n|New York City\n|Spy ring arrested before implementation\n|\n|\n|-\n|\n|Vanceboro international bridge bombing\n|Saint Croix–Vanceboro Railway Bridge\n|Railway officials inspected the bridge following the bombing and discovered the damage was relatively minor, resulting in the bridge being out of service for only several days.\n|\n|\n|-\n|\n|Muenter attacks\n|\n*Senate reception room in the United States Capitol, Washington, D.C.\n*J. P. Morgan's house at East Island, Glen Cove, New York\n|In 1915, an agent planted a bomb that exploded in the US Capitol, shot Jack Morgan, and predicted the bombing of a steamship bound for England before committing suicide while in police custody.\n|\n|\n|-\n|\n| Harbor Island Bombing\n| Harbor Island, Seattle\n| Imperial German agents blew up a barge carrying 15 tons of refined gunpowder just off of Harbor Island, Seattle.\n|\n|\n|-\n|\n| German biological warfare sabotage program\n| American cattle industry\n| While the program was successful, it is unknown if any cattle were harmed.\n|\n|\n|-\n|\n| Black Tom explosion\n| New York City\n| Killed 7 people and destroyed some $20,000,000 ($}} million in ) worth of military goods.\n|\n|\n|-\n|\n| Kingsland explosion\n| Lyndhurst, New Jersey\n| In 4 hours, probably 500,000 pieces of 76&nbsp;mm (3\") high explosive shells were discharged.\n|\n|\n|}\nLone Wolf attacks\nA lone wolf attack is a particular kind of terrorist attack, committed in a public setting by an individual or group who plans and commits an act of terrorism inspired by another organization or state, in this case, Imperial Germany. However, instead of being directed to or paid to carry out the attack the planning and the implementation for it is independent of the German Empire.\n{| class=\"wikitable sortable\" style=\"font-size: 100%;\"\n! style=\"width:15%;\" |Date\n!Name\n!Location\n!Status\n!Notes\n! style=\"width:1%;\" class=\"unsortable\" |References\n|-\n|\n|Rochambeau bomb plot\n|SS Rochambeau\n|Spy ring arrested before implementation\n|\n|\n|-\n|\n| Bomb attack of various Ontario targets by Detroit-based Charles Respa and Albert Kaltschmidt\n| Successful bombing of the Peabody Overall Co factory in Walkerville, Ontario.\n| Factory bombed, but a bomb placed at the Windsor Armoury failed to explode, saving the lives of 200 soldiers who were stationed there. On March 7, 1916, Respa was sentenced to life imprisonment. In 1917, ring leader and president of the Marine City Salt company, Albert Kaltschmidt, faced charges in America for attempting to bomb the Detroit Screw Works. Others charged were William M. Jarosh, Richard Herman, and Fritz A. Neef, general manager of the Eismann Magneto company.\n|\n|\n|}\nSee also\n*German war crimes\n*War crimes in World War I\n*Terrorism in the United States\n*Great Phenol Plot\nBibliography\nNotes\nReferences\n*|date= December 23, 1914|title= Police Frustrate German Attempt To Blow Up Ship|url=https://chroniclingamerica.loc.gov/lccn/sn85038485/1914-12-23/ed-1/seq-1/|newspaper=The Birmingham Age-Herald|location=Birmingham, AL |issn=2692-6318|oclc=12607279|pages=1–12 |access-date= December 23, 2021 |via=Library of Congress}}\n*\n*|date= May 22, 1917|title= Kaltschmidt and four others tried to wreck screwworks, is charge|url=https://chroniclingamerica.loc.gov/lccn/sn83016689/1917-05-22/ed-2/seq-1/#|newspaper=The Detroit Times|publisher=Detroit To-Day Co.|location=Detroit, Wayne, Michigan|issn=2688-9390|oclc=9977557|pages=1–8|accessdate= June 21, 2022 }}\n* - Total pages: 692\n*\n*\n*|date= April 29, 1915|title= Flames Break Out On Two Bridges; Four Germans Are Arrested; War Reports Vary|url=https://chroniclingamerica.loc.gov/lccn/sn82014682/1915-04-29/ed-2/seq-1/|newspaper=Honolulu Star-Bulletin|publisher=P.T. Gialanella|location=Honolulu, Hawaii|issn=2326-1137|oclc=8807359|pages=1–16|accessdate= December 24, 2021 }}\n*\n*\n*|date= February 4, 1917|title= German Spies Active Here For Months|url=https://www.nytimes.com/1917/02/04/archives/german-spies-active-here-for-months-hostile-agents-reported-to.html|newspaper=The New York Times|issn=1553-8095 |oclc=1645522|access-date= December 23, 2021 }}\n*|date= June 21, 1915|title= Charge Germans in Powder Plot|url=https://chroniclingamerica.loc.gov/lccn/sn88085187/1915-06-21/ed-1/seq-1/|newspaper=The Tacoma Times|publisher=Tacoma Times Pub. Co.|location=Tacoma, Pierce, Washington|issn=2158-4729|oclc=17347623|pages=1–8 |accessdate= June 21, 2022 }}\n*\n*"
    }
  ]
}