{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1858\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1858.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland).  For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign. Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\".\nSome of these acts have a short title. Some of these acts have never had a short title. Some of these acts have a short title given to them by later acts, such as by the Short Titles Act 1896.\n21 & 22 Vict.\nContinuing the second session of the 17th Parliament of the United Kingdom, which met from 3 December 1857 until 2 August 1858.\nPublic general acts\n|\n|  to authorize the embodying of the Militia.|note4= }}\n|  }}\n|  }}\n|  }}\n|  or the Inclosures Act 1858|public|8|26-03-1858|archived=n|An Act to authorize the Inclosure of certain Lands in pursuance of a Report of the Inclosure Commissioners for England and Wales.}}\n|  }}\n|  to the District of Skipton in the West Riding of the County of York; and to further declare the Limits of the District of Toxteth Park in the County Palatine of Lancaster, for the Purposes of the said Act.|po1=Provisional Order for the Application of the Public Health Act to the District of Shipton in the West Riding of the County of York.|po1short=n}}\n|\n| or the Customs Act 1858|public|12|11-05-1858|repealed=y|archived=n|An Act for the Alteration of certain Duties of Customs.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  to amend the Laws relating to Loan Societies.}}\n|  }}\n|\n|\n| |public|23|14-06-1858|archived=n|An Act for abolishing the Tolls now levied on the Bridge over the Shannon at Portumna in Ireland.}}\n|  }}\n|  concerning Non-parochial Registers, and the Acts for Marriages, and for registering Births, Deaths, and Marriages, in England, and concerning Vaccination.|note4= }}\n|  }}\n| or '''Lord Cairns' Act|public|27|28-06-1858|repealed=y|archived=n|An Act to amend the course of procedure in the High Court of Chancery, the Court of Chancery in Ireland, and the Court of Chancery of the county palatine of Lancaster.|note4= }}\n| |note4= }}\n|\n|\n|\n|  }}\n|\n| |note4= }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|\n| |note4= }}\n|\n|  }}\n|\n|  for separating the Palatine Jurisdiction of the County Palatine of Durham from the Bishoprick of Durham; and to make further Provision with respect to the Jura Regalia of the said County.}}\n|\n|\n| or the Oaths Act 1858'''|public|48|23-07-1858|repealed=y|archived=n|An Act to substitute One Oath for the Oaths of Allegiance, Supremacy, and Abjuration; and for the Relief of Her Majesty's Subjects professing the Jewish Religion.|note4= }}\n| or the Jewish Disabilities Act 1858|public|49|23-07-1858|maintained=y|archived=n|An Act to provide for the Relief of Her Majesty's Subjects professing the Jewish Religion.}}\n|\n|  }}\n|\n|  for consolidating the Copyhold and Inclosure Commissions, ana for completing Proceedings under the Tithe Commutation Acts.|note4= }}\n|  }}\n|  amending the Act for limiting the Time of Service in the Army.|note4= }}\n|\n|  for enabling Ecclesiastical Corporations, aggregate and sole, to grant Leases for long Terms of Years.|note4= }}\n|\n|\n| or the Joint Stock Companies Act 1858|public|60|23-07-1858|archived=n|An Act to Amend the Joint Stock Companies Acts, 1856 and 1857, and the Joint Stock Banking Companies Act, 1857. }}\n| or the Inclosures Act 1858|public|61|02-08-1858|archived=n|An Act to authorize the Inclosure of certain Lands in pursuance of a Special Report of the Inclosure Commissioners of England and Wales.}}\n|  }}\n| or the Turnpike Acts Continuance Act 1858|public|63|02-08-1858|repealed=y|archived=n|An Act to continue certain Turnpike Acts in Great Britain.|note4= }}\n|\n|  to render more effectual the Police in Counties and Burghs in Scotland.|note4= }}\n|  and to abolish Foot Passenger Tolls on Chelsea Bridge after Payment of the Sum of Eighty thousand Pounds and Interest.}}\n|  }}\n|\n|\n|  to consolidate and amend the Laws relating to the Copyright of Designs for ornamenting Articles of Manufacture.|note4= }}\n|\n|\n|\n| or the County Court Districts (England) Act 1858|public|74|02-08-1858|repealed=y|archived=n|An Act for the Re-arrangement of the Districts of the County Courts among the Judges thereof.|note4= }}\n|\n|\n|  }}\n|\n|\n|  to facilitate Arrangements for the Belief of Turnpike Trusts.}}\n|\n|  }}\n|\n| or the Dublin, Four Courts Act 1858or the Four Courts Extension Act 1858|public|84|02-08-1858|repealed=y|archived=n|An Act for enabling the Commissioners of Public Works in Ireland to acquire certain Lands and Houses for the Site of a new Court or Courts, and other Offices and Buildings required for the Public Service, in Extension of the Four Courts in the City of Dublin; and for other Purposes.|note4= }}\n|  to enable Her Majesty to accept the Services of the Militia out of the United Kingdom.|note4= }}\n|  to authorize the embodying of the Militia.|note4= }}\n|  }}\n|  to consolidate and amend the Laws relating to Civil Bills and the Courts of Quarter Sessions in Ireland, and to transfer to the Assistant Barristers certain Jurisdiction as to Insolvent Debtors.}}\n|  for the Regulation of the Care and Treatment of Lunatics, and for the Provision, Maintenance, and Regulation of Lunatic Asylums, in Scotland.|note4= }}\n|\n|\n|\n|\n| or the Copyholds Act 1858|public|94|02-08-1858|repealed=y|archived=n|An Act to amend the Copyhold Acts.|note4= }}\n| |note4= }}\n|  }}\n|\n|  and to make further Provision for the Local Government of Towns and populous Districts.}}\n|\n|\n|  relating to Friendly Societies.|note4= }}\n|  }}\n|\n|  and to extend the Powers of the Metropolitan Board of Works for the Purification Of the Thames and the Main Drainage of the Metropolis.}}\n|  to amend the Laws concerning Judgments in Ireland.}}\n|\n|  }}\n| |note4= }}\n|\n|  for issuing Writs during any Recess of the House of Commons, whether by Prorogation or Adjournment.}}\n}}\nLocal acts\n}}\n|  for improving the Port, Harbour, and Town of Whitehaven in the County of Cumberland, in relation to the Securities to be granted for borrowed Money.}}\n|\n|\n|\n|  }}\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|  relating to the Company of Proprietors of the Liverpool Exchange, and to substitute other Provisions in lieu thereof.|note4= }}\n|  }}\n|\n|\n|\n|\n|  }}\n| or the Ely Valley Railway (Mwyndy Branch) Act 1858|local|30|14-06-1858|archived=n|An Act to authorize the Ely Valley Railway Company to make a Branch Railway, to be called \"The Mwyndy Branch;\" and for other Purposes.}}\n|\n|\n| or the British Gaslight Company Limited (Staffordshire Potteries) Act 1858|local|33|14-06-1858|archived=n|An Act for better enabling the British Gaslight Company, Limited, to light with Gas certain Parts of the District called the Staffordshire Potteries; and for other Purposes.}}\n|\n|  }}\n|\n|\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|  and for other Purposes.}}\n|\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|  and to regulate the Company constituted thereby; and for other Purposes.}}\n|\n|\n|  and to make other Provisions in lieu thereof so far as regards a Portion of the said Turnpike Rood.|note4= }}\n|\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|  especially with respect to the General Mortgage Debt of the Commissioners and their Powers to sell certain Lands; and for other Purposes.|note4= }}\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|  relating to the Company.}}\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n| or the Shrewsbury and Welshpool Railway Act 1858|local|110|23-07-1858|archived=n|An Act for extending the Powers of the Shrewsbury and Welchpool Railway Company for purchasing Lands and completing their Railway; and for other Purposes.}}\n|\n|  }}\n|\n|  to or near to Skinningrove, all in Cleveland in the North Riding of the County of York; and for other Purposes.}}\n|\n| , and the Darlington and Barnard Castle Railway Companies; and for regulating the Capital and Borrowing Powers of the Stockton and Darlington Railway Company formed by the Amalgamation; and for other Purposes.}}\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|  and for other Purposes.}}\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n}}\nPrivate acts\n|\n|\n|\n|\n|\n|\n|\n|\n|  (I))}} }}\n| |private|11|11-05-1858|repealed=n|archived=n|An Act to repeal so much of an Act passed in the Seventh Year of the Reign of His late Majesty King William the Fourth and in the First Year of the Reign of Her present Majesty, intituled \"An Act for naturalizing Dame Marie Louise Pelline De Dalberg Acton and her infant Son Sir John Emerich Edward Dalberg Acton Baronet,\")}} as enacts that the said Sir John Emerich Edward Dalberg Acton Baronet shall not thereby be enabled to be of the Privy Council, or a Member of either House of Parliament, or to take any Office or Place of Trust, either Civil or Military, or to have any Grant of Lands, Tenements, or Hereditaments from the Crown, to himself or any other Person or Persons in trust for him.}}\n}}\nSources\n*\n*\n*  |title=Local and Personal Laws |via=Google Books}}\n*  |title=Local and Personal Laws |via=Google Books}}\n*\nSee also\n* List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}