{
  "content": [
    {
      "type": "text",
      "text": "# List of civilian casualties in the war in Afghanistan (2008)__disambig_1\n\nList of civilian casualties in the war in Afghanistan in 2008\n* January 24, 2008 – Nine or ten Afghan policemen and two civilians were killed by US Forces in the Ghazni province, 100&nbsp;km south of Kabul.\n* January 30, 2008 – Three civilians showed up at a Kandahar hospital with gunshot wounds, claiming they had been shot at by a Canadian convoy. One of them later died of his injuries.\n* March 12, 2008 – The British government says its troops were responsible for an airstrike that killed two women and two children around Helmand. At least 10 others were injured.\n* March 13, 2008 – Two women and two children were killed in Pakistan by cross border shelling fired by US forces in Afghanistan.\n* March 19, 2008 – Several civilians were killed by US troops in Muqibel, a village of Khost province.\n* June 11, 2008 – At least 30 killed at 10&nbsp;P.M. on Tuesday night, June 10, 2008, in the village of Ebrahim Kariz, Mata Khan district of Paktika Province. US forces launched an air and ground attack upon the village allegedly targeting a \"militant hideout.\" Residents said that dozens of civilians were killed.\n* June 23, 2008 – A father and son were allegedly killed by gunfire from US-led soldiers, a governor and witnesses said. Around 200 people demonstrated in the Khogyani district of Nangarhar province.\n* July 4, 2008 – 23 civilians were killed by US air strikes the district of Waygal, in the province of Nouristan.\n* July 6, 2008 – 47 civilians attending a wedding (including 39 women and children and the bride) were killed by US air strikes in Dih Bala district, Nangarhar province.\n* July 14, 2008 – Officials in Nuristan province said almost 30 defenseless civilians have been reportedly killed during NATO-led International Security Assistance Forces (ISAF) airstrike in Want-Waigal district of the eastern province. ISAF denies the claim.\n* July 15, 2008 – US Forces admit to killing eight civilians in the Bakwa district of Farah province. They bombed a number of houses from which they were receiving fire.\n* July 17, 2008 – Dozens of civilians are reported killed and injured by air strikes in the Shindand district of Herat province.\n* July 20, 2008 – Thirteen civilians were killed in two separate incidents: nine policemen were killed by a US air strikes in the Ana Darreh district of Farah province. In the second episode, a NATO statement said, at least four civilians were accidentally killed and four other civilians wounded in mortar strikes by the NATO-led International Security Assistance Force in the eastern province of Paktika. The deaths of an additional three people had not been confirmed, the statement said.\n* July 26, 2008 – British troops opened fire on a vehicle that failed to stop at a checkpoint in the Sangin district of Helmand province, killing four and injuring three.\n* July 27, 2008 – Canadian troops opened fire on a vehicle that came too close to a Canadian convoy in Kandahar. A two-year-old girl and her four-year-old brother were killed and the father of the two children was wounded.\n* August 7, 2008 – US troops killed four women and a child in an exchange of fire in an area of central Ghazni province.\n* August 10, 2008 – Eight hostages held by the insurgents were killed by a coalition air strike in Uruzgan province.\n* August 16, 2008 – Four civilians were killed by a British rocket attack against a compound in the Sangin district of Helmand province. Three others were wounded. The casualties included women and children.\n* August 21, 2008 – The Afghan Interior Ministry reported that U.S. coalition bombs had killed up to 95 (up from 76) civilians, including 60 children, in an airstrike on Azizabad, a village in the Shindand district of Herat province.\n* August 31, 2008 – Three children were killed by ISAF-fired artillery shells in the Gayan district of Paktika province. Seven other civilians were wounded.\n* September 1, 2008 – A man and his two young children were killed in a night raid on his home in Kabul. His wife was injured.\n* September 9, 2008 – At least two Afghan civilians have been killed and 10 wounded in an air strike by Nato-led forces in the eastern province of Khost, Nato officials say.\n* September 18, 2008 – Canadian soldiers in a convoy fire at a civilian truck in Kandahar, killing one of the occupants.\n* September 29, 2008 – A British soldier shot and killed a civilian on a motorbike at a checkpoint near the Forward Operating Base Inkermanin in the Sangin district of Helmand province.\n* October 16, 2008 – About 18 civilians were killed by an air strike in the Nad Ali district of Helmand Province.\n* November 3, 2008 – Dozens of people, including over 30 women and children, were killed by US air strikes in the village of Wech Baghtu in the district of Shah Wali Kowt, Kandahar province. The strike was called in on the village when a wedding was taking place. A joint Afghan-U.S. investigation found that 37 Afghan civilians were killed and 35 others wounded by the U.S. air strike.\n* November 6, 2008 – At least seven civilians were killed by an air strike by ISAF forces in the Ghowrmach district of Badghis province.\n* November 19, 2008 – British Soldiers from 'J' Company, 42 Commando Royal Marines fired \"warning shots\" at vehicle approaching convoy in Sangin, Helmand Province, Afghanistan. An Afghan child was killed.\nSee also\n* Civilian casualties in the war in Afghanistan (2001–14)\nReferences"
    }
  ]
}