{
  "content": [
    {
      "type": "text",
      "text": "# List of Star Wars Rebels episodes\n\nStar Wars Rebels is an American 3D CGI animated television series produced by Lucasfilm and Lucasfilm Animation. Beginning fourteen years after Revenge of the Sith and five years before A New Hope, Rebels takes place during an era when the Galactic Empire is securing its grip on the galaxy. Imperial forces are hunting down the last of the Jedi while a fledgling rebellion against the Empire is taking form, with the series following the crew of the Ghost.\nThe series was previewed throughout August 2014 with a set of shorts introducing the main characters before the television film pilot episode premiered on Disney Channel on October 3, 2014. The regular series premiered on Disney XD on October 13, 2014. The second season started on June 20, 2015, and the third season premiered on September 24, 2016. The two-part season three finale aired on March 25, 2017. The fourth and final season premiered on October 16, 2017, with the two-part episode \"Heroes of Mandalore\", and continued to air until November 13, 2017 taking a winter break and preparations for the release of the film Star Wars: The Last Jedi. The series picked up on February 19, 2018, Disney XD then released two episodes a week, airing the final two episodes on March 5, 2018. A total of 75 episodes were aired, with the narrative of the series being continued in the 2023 live-action television series Ahsoka.\nSeries overview\n| end0S      =\n| color1     = #E6771C\n| link1      = List of Star Wars Rebels episodes#Season 1 (2014–15)\n| episodes1  = 15\n| start1     =\n| end1       =\n| color2     = #E5D12A\n| link2      = List of Star Wars Rebels episodes#Season 2 (2015–16)\n| episodes2  = 22\n| start2     =\n| end2       =\n| color3     = #21AE05\n| link3      = List of Star Wars Rebels episodes#Season 3 (2016–17)\n| episodes3  = 22\n| start3     =\n| end3       =\n| color4     = #0FDDAF\n| link4      = List of Star Wars Rebels episodes#Season 4 (2017–18)\n| episodes4  = 16\n| start4     =\n| end4       =\n}}\nEpisodes\nShorts (2014)\n|ProdCode        = 101A\n|ShortSummary    = Following a raid on an Imperial supply convoy, the Ghost is pursued by TIE fighters, which take out its shields and communication system. Only one TIE fighter remains after a dogfight and Chopper destroys it.\n|LineColor       = AC1D1D\n}}\n|ProdCode        = 101B\n|ShortSummary    = Sabine infiltrates a TIE fighter landing platform to create a diversion for the Ghost to escape. She taunts the Stormtroopers to chase her and leaves behind an explosive that covers them with purple paint.\n|LineColor       = AC1D1D\n}}\n|ProdCode        = 101C\n|ShortSummary    = Zeb walks through an alley on Lothal and intervenes when he sees two Stormtroopers harassing a salesman. The Stormtroopers call for reinforcements and they fire at him, but accidentally cause a fuel leak in a TIE fighter, which explodes.\n|LineColor       = AC1D1D\n}}\n|ProdCode        = 101D\n|ShortSummary    = Ezra witnesses the Ghost shoot down a TIE fighter and goes to the wreckage. When the pilot shows no gratitude to Ezra for saving him, Ezra steals from him several items, including his helmet. The pilot fires at Ezra, who evades and incapacitates him with an energy slingshot before walking away wearing the helmet.\n|LineColor       = AC1D1D\n}}\n}}\nSeason 1 (2014–15)\n|ProdCode_1        = 101\n|ProdCode_2        = 102\n|Viewers         = 2.74\n|ShortSummary    = Street thief Ezra Bridger is an orphan on Lothal, an Outer Rim world. He interferes with the theft of blaster rifles from the Empire by three Ghost crew members: leader Kanan Jarrus, Mandalorian saboteur Sabine Wren, and Lasat strongman Garazeb \"Zeb\" Orrelios. Ezra ends up stuck with the crew while making their getaway and also meets Twi'lek pilot Hera Syndulla and her C1 astromech droid Chopper. Ezra finds a lightsaber and a holocron in Kanan's room and steals the holocron. The rifles are sold to buy food and information from black market dealer and crime lord Cikatro Vizago. The food is given to the displaced people of Lothal while the information leads them to the location of several Wookiees captured by the Empire. However, this is a trap, and Ezra is captured by Agent Kallus. Ezra somehow opens the holocron and sees a message from Obi-Wan Kenobi (James Arnold Taylor). Ezra is saved by the Ghost crew after learning where the Wookiees have been sent. During the rescue of the Wookiees, Kanan draws his lightsaber, revealing himself as a Jedi, and together with the Wookiees, he defeats Agent Kallus and escapes. Having proven himself by opening the holocron, Kanan offers to make Ezra his apprentice.\n|LineColor       = E6771C\n}}\n|ProdCode        = 103\n|Viewers         = 1.03\n|ShortSummary    = The Ghost crew steal a shipment of disruptor weapons from Minister Maketh Tua to sell to Vizago, accidentally bringing the Imperially serviced droids C-3PO and R2-D2 with them in the process. Zeb objects to the mission since the same weapons were used to nearly wipe out his species, the Lasats. Agent Kallus intercepts C-3PO's distress call and follows the Ghost to Lothal. Zeb sees that Agent Kallus uses a Bo Rifle, a weapon only used by the Lasat Honor Guard, which Kallus had taken from a guardsman he killed himself. In the ensuing duel between Zeb and Kallus, Ezra saves Zeb by instinctively using the Force combatively for the first time, pushing Kallus away and knocking him unconscious.  allowing the crew to escape after setting the weapons to self-destruct as a diversion. Kanan returns the two droids to their rightful owner Bail Organa, who surveys R2-D2's recordings of the rebel crew's actions.\n|LineColor       = E6771C\n}}\n|Viewers         = 0.58\n|ProdCode        = 104\n|ShortSummary    = Chopper ends up causing a fight between Ezra and Zeb, so Hera sends them out on a supply run together to keep them from bickering with each other, specifying that they do not return without a rare meiloorun fruit. The two find that the market's sole supply of meilooruns has been purchased by the Empire. Ezra's attempt to steal the fruit leads to an entanglement against the stormtroopers, forcing Zeb to hijack a TIE fighter for the two to escape in. En route to their rendezvous with the Ghost, the two find farmer Morad Sumar — a friend of Ezra's parents — and his family being arrested over a property dispute with the Empire. Using the TIE fighter to their advantage, Ezra and Zeb are able to rescue Sumar and retrieve the fruit. On their return to the Ghost after supposedly crashing the fighter, Hera is pleased to see Ezra and Zeb are more friendly towards each other.\n|LineColor       = E6771C\n}}\n|ProdCode        = 105\n|Viewers         = 0.95\n|ShortSummary    = Ezra has started his Jedi training, but struggles with the basics while Kanan also struggles in his new role as a mentor. The rebels discover an underground transmission reporting that Jedi Master Luminara Unduli has survived Order 66 and is being held in a high-security Imperial prison on Stygeon Prime. Frustrated with his own inability to teach Ezra, Kanan leads his crew to rescue Luminara, hoping she will be a more capable teacher for Ezra. Upon reaching her cell, Kanan and Ezra discover that Luminara is long dead, and that her remains are being used as bait by an Inquisitor to lure the Jedi into a trap. The two work together to escape the Inquisitor before Hera rescues them aboard the Phantom. After Ezra reveals his insecurities over Kanan trying to find him another mentor, Kanan resolves to train Ezra himself.\n|LineColor       = E6771C\n}}\n|ProdCode        = 106\n|Viewers         = 0.64\n|ShortSummary    = Ezra goes undercover as an Imperial Academy cadet to help foil a shipment of kyber crystals. Thanks to his training Ezra quickly proves the most capable student in the class. During his operation, he befriends fellow cadets Zare Leonis and Jai Kell, the former of whom has similarly infiltrated the academy in search of his missing sister, Dhara. After completing the mission, Ezra discovers that the Inquisitor, having taken notice of his and Jai's abilities, intends to take them prisoner. With Zare and the other rebels' help, the three are able to fight their way out of the facility during an Imperial walker training exercise. Jai goes into hiding while Zare remains at the academy to continue his search for Dhara.\n|LineColor       = E6771C\n}}\n|ProdCode        = 107\n|Viewers         = 0.60\n|ShortSummary    = Chopper's antics cause Ezra and Zeb to forget to carry out an important repair on the Phantom. Hera and Sabine set out to an abandoned Republic asteroid base to retrieve supplies provided by Fulcrum, an anonymous informant whom Hera has been in contact with. Sabine voices her displeasure towards Hera's secrecy about their mission, feeling as though neither she nor Kanan trust her. Due to the fuel tank leaking on the Phantom, the two are left stranded on the base, which is infested with deadly fyrnocks. The two work together to survive the creatures long enough for the rest of the crew to rescue them aboard the Ghost, allowing Sabine to overcome her trust issues while Hera tells her to have faith in the growing rebellion.\nNote: This is the last episode to take place in 5 BBY.\n|LineColor       = E6771C\n}}\n|ProdCode        = 108\n|Viewers         = 0.67\n|ShortSummary    = Kanan tries to teach Ezra how to use the Force to make a connection to other living creatures. The rebels destroy the Empire's new prototype TIE fighter during a parade celebrating the 15th anniversary of the Empire's creation. Ezra, who was born on the original Empire day and has turned 15, is preoccupied with his feelings towards his missing parents and opts out of the mission. He soon discovers that his parents' Rodian friend Tseebo is wanted by the Empire, and rejoins his friends to look for him. Tseebo is found hiding in the basement of Ezra's old house, where Ezra reveals his parents were arrested for making anti Empire radio broadcasts, after which Tseebo had gone to work for the Empire. The rebels learn that Tseebo has allowed himself to be implanted with cybernetics so he could steal information that is valuable to the Empire, though the sheer amount of information he uploaded has affected his mind. The Rebels smuggle him off of Lothal aboard the Ghost. During the ensuing chase led by the Inquisitor, Tseebo regains his senses and reveals that he knows what happened to Ezra's parents.\nNote: This is the first episode to take place in 4 BBY.\n|LineColor       = E6771C\n}}\n|ProdCode        = 109\n|Viewers         = 0.66\n|ShortSummary    = Learning that Tseebo failed to save his parents from being abducted by the Empire, Ezra lashes out at Tseebo for betraying his parents' trust. Amidst the chase, the Imperials attach a homing beacon to the hull of the Phantom, which Kanan opts to detach from the Ghost in hyperspace with himself and Ezra on board to mislead the Imperials. The two arrive at Fort Anaxes, where Kanan teaches Ezra to forgive Tseebo by admitting his fear of not knowing what happened to his parents. The two tame the fyrnocks by connecting to them through the Force and set them against the arriving Imperial forces, but are cornered by the Inquisitor, who injures Kanan. Overcome with anger, Ezra uses the dark side of the Force to summon a giant fyrnock against the Inquisitor, allowing the two to escape. Back on the Ghost, Sabine gives Ezra a picture of his parents she found in his house. Afterwards, the Ghost crew take Tseebo to Fulcrum, while Hera offers to relay to Ezra what Tseebo knows of his parents' fate.\n|LineColor       = E6771C\n}}\n|ProdCode        = 110\n|Viewers         = 0.57\n|ShortSummary    =  Concerned with Ezra's previous display of the dark side against the Inquisitor, Kanan brings him to a hidden Jedi Temple on Lothal to be tested for his readiness in Jedi training. While Kanan stays behind, Ezra makes his way through the temple alone and is faced with a series of visions showing the Inquisitor killing Kanan and the rest of the Ghost crew. After seeing through the illusions, Ezra is guided by the disembodied voice of Jedi Master Yoda, who helps him admit his fear of being alone again. Kanan also speaks with Yoda about his own ability to teach Ezra. Yoda leads Ezra to a kyber crystal, which he uses to build his own lightsaber.\n|LineColor       = E6771C\n}}\n|ProdCode        = 111\n|Viewers         = 0.53\n|ShortSummary    = Zeb bets and loses Chopper to smuggler Lando Calrissian in a game of sabacc, forcing the Ghost crew to assist Lando with a dangerous smuggling run to get their droid back. However, during the smuggling run Lando trades Hera to crime lord Azmorigan in exchange for a puffer pig, which can detect precious minerals for mining purposes, leaving Hera to escape in an escape pod. Humiliated, Azmorigan and his henchmen intercept the rebels on Lothal to take revenge. The crew successfully drive the gangsters away. The rebels part ways with Lando, though not before Chopper steals the fuel to Lando's ship, which the smuggler concedes as payment for their help.\n|LineColor       = E6771C\n}}\n|ProdCode        = 112\n|Viewers         = 0.71\n|ShortSummary    = During lightsaber practice, Ezra has a fragmented vision of meeting Gall Trayvis, an exiled Imperial senator and rebel sympathizer, and assumes that Trayvis knows about his parents. The rebels receive a transmission from Trayvis notifying them of a secret rally on Lothal, but Ezra receives a tip from Zare Leonis that Kallus is planning to use the senator to lure the rebels into a trap. Following Trayvis's transmission, the rebels find him and save him from Kallus by escaping into Lothal's sewer systems. To Ezra's dismay, Trayvis reveals himself to be an Imperial spy who has used his anti-Imperial transmissions to identify rebel sympathizers, and claims that Ezra's parents are dead and gone. Having suspected his treachery, Hera outsmarts Trayvis and knocks him out so that the rebels can escape. Although disappointed by the betrayal, Ezra and the other rebels remain hopeful of their cause.\n|LineColor       = E6771C\n}}\n|ProdCode        = 113\n|Viewers         = 0.60\n|ShortSummary    = Grand Moff Tarkin visits Lothal to deal with the rebels. In light of discovering that Trayvis is actually an Imperial spy, the rebels debate broadcasting a message to the nearby star systems about their cause. Ezra adamantly supports the idea, since his parents had broadcast secret messages from their basement for years. Kanan decides to invade the main Imperial communications tower on Lothal. The Rebels think they have the element of surprise, but they do not take into account the arrival of Tarkin, who has deduced where they will strike. The Inquisitor and Kallus are sent out to capture Kanan alive to earn back Tarkin's trust. When the Imperial forces attack the group at the tower, Kanan instructs the team to leave him and thus is captured. The team is able to have Ezra send a message of hope, urging those living under the oppression of the Empire to fight, before Tarkin orders the tower to be destroyed, ending their broadcast.\n|LineColor       = E6771C\n}}\n|ProdCode        = 114\n|Viewers         = 0.55\n|ShortSummary    = After failing to find where Kanan is being detained, Hera is urged by Fulcrum to put the crew of the Ghost into hiding. Against Hera's orders to leave Kanan, Ezra devises a plan to rescue him. He strikes a deal with Vizago for an unspecified favor in the future and learns that due to the destruction of the Imperial communications tower the Empire is forced to send all its messages via courier droids. Meanwhile, Kanan is brought aboard Tarkin's ship where he is tortured by the Inquisitor as the Empire hopes to gain more information about the rebels. The crew of the Ghost substitute a disguised Chopper for an Imperial courier droid so he can access the Empire's data on Kanan, eventually learning that Tarkin plans to transfer Kanan to the prison on Mustafar where, according to Hera, Jedi go to die.\n|LineColor       = E6771C\n}}\n|ProdCode        = 115\n|Viewers         = 0.72\n|ShortSummary    = The crew of the Ghost seize an Imperial transport and use the TIE fighter that Zeb and Ezra had previously stolen to infiltrate and disable Tarkin's star destroyer in the Mustafar system. Ezra frees Kanan using the duct system while Hera, Sabine and Zeb attempt to secure an escape route. Ambushed in the engine room, Ezra and Kanan face the Inquisitor in a lightsaber duel, during which Ezra falls and is believed dead by Kanan. Abandoning his fear of losing Ezra, Kanan succeeds in destroying the Inquisitor's lightsaber and rupturing the ship's engine, into which the defeated Inquisitor casts himself to his death. Ezra reveals himself to be alive (and to have gotten a scar during the battle with the Inquisitor) and escapes with Kanan. Both groups successfully emerge from the doomed destroyer with stolen TIEs. Chopper arrives in the stolen transport alongside a number of other ships, and they all successfully escape into hyperspace. The rebels are greeted by Senator Organa and Fulcrum, the latter of whom is revealed to be Ahsoka Tano, who tells the group that they are just one cell out of many working for a larger rebellion. On Lothal, Tarkin introduces Agent Kallus to Darth Vader, who has been selected by Emperor Palpatine to hunt the rebels in the Inquisitor's place.\n|LineColor       = E6771C\n}}\n}}\nSeason 2 (2015–16)\n|ProdCode_1        = 201\n|ProdCode_2        = 202\n|Viewers         = 0.59\n|ShortSummary    = On orders to hunt down the Rebels and especially the Jedi among them, Darth Vader begins an oppressive campaign against Lothal's populace in order to find the group. The Ghost crew starts working with the wider Rebel cells, but are divided between joining the larger network and waging open war on the Empire, or staying out of a large-scale fight. The situation is even more complicated when Minister Maketh Tua, fearing punishment for failing to neutralize the Lothal rebels, tries to defect to them in order to escape Vader, offering to reveal the truth behind why the Emperor wants the planet. However, Vader uses this to his advantage and orchestrates Tua's murder by shuttle explosion, framing the rebels for the act and turning Lothal's population against them. The Ghost crew tries to flee but are cornered by Vader, who injures Kanan and Sabine and nearly kills Ezra before they finally escape. After being smuggled off-world by Lando Calrissian to escape the Empire, the demoralized crew meet up with Ahsoka's rebel cell, but Vader pursues them and proceeds to wipe out most of the rebel ships, discovering Ahsoka's presence during a mental encounter via the Force. Ahsoka is horrified to discover that Vader is in fact her former master and her mind is temporarily overwhelmed in the process. She later joins the Ghost crew as they vow to join the wider fight against the Empire. Darth Vader later reports Ahsoka's existence to Darth Sidious, who issues Vader new orders to dispatch another one of their Inquisitors to capture the crew of the Ghost.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 203\n|Viewers         = 0.46\n|ShortSummary    = Having barely escaped total destruction of the rebel cell Phoenix Squadron by Darth Vader, Ahsoka Tano sends the Ghost Crew to locate a former military commander somewhere in the Seelos system who has the knowledge of useful hideouts in the Outer Rim. The crew discover the commander to be former clone trooper Captain Rex, accompanied by Commander Wolffe and clone commando Gregor. Kanan is immediately hostile as soon as he finds out about them being clones due to their role in Order 66 although Rex claims they removed their brain chips. Ezra negotiates with Rex for information relating to potential bases. In return Gregor enlists them for a hunt by using Zeb as bait to catch an elusive Joopa. With the hunt successful, Rex holds up his end of the deal but Sabine discovers that Wolffe betrayed the Ghost crew's location to the Empire. A skirmish with an Imperial probe having damaged the Phantom shuttle, the crew is temporarily stranded with the clones waiting for an Imperial assault.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 204\n|Viewers         = 0.54\n|ShortSummary    = The Empire tracks the Lothal Rebels to Seelos. Admiral Kassius Konstantine and Agent Kallus arrive at the Seelos System to capture the Jedi. Rex gives the Lothal Rebels a datachip containing old Republic bases in the Outer Rim. Ezra tries to persuade the clones to join the Rebellion, but Rex and the clones instead offer to delay the Empire so the Lothal Rebels can escape. Agent Kallus commands the clones to hand over the Rebels, but when Rex refuses, Kallus arrives with three AT-ATs. Taking advantage of a sandstorm and the Force, Kanan, Ezra and the clones use their AT-TE's main gun to destroy one of the AT-ATs. Meanwhile, Admiral Konstantine is summoned away by Darth Vader. Instead of meeting him, the admiral meets Fifth Brother, an inquisitor, who claims that he will succeed where Kallus and Konstantine have failed. The Lothal Rebels prepare to leave on the Phantom, but Ezra is unwilling to leave Rex and the clones behind. Kanan, Ezra, and Zeb commandeer one of the AT-ATs and turn its weapons on Kallus' AT-AT which Rex destroys with a critical hit. Kallus flees the battle on a speeder. Hera returns to pick up the clones and the Ghost crew. Returning to the Rebel flotilla, the Lothal Rebels and Rex reunite with Ahsoka.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 205\n|Viewers         = 0.54\n|ShortSummary    = Zeb, Sabine, and Chopper, with Ezra volunteering himself to avoid Kanan and Rex, head out to an Old Republic medical base in search of vital medical supplies only to encounter Fifth Brother and Seventh Sister, another inquisitor. Seventh Sister captures Ezra and interrogates him about the whereabouts of Ahsoka Tano while Sabine is also captured by Fifth Brother. Zeb and Chopper eventually rescue them and they all barely escape the Inquisitors and head back to the rebel fleet where Ezra pointedly questions Kanan about the extra Inquisitors.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 206\n|Viewers         = 0.55\n|ShortSummary    = Ezra receives a distress signal from Vizago's ship. Ezra and Chopper decide to see what has happened. When they arrive, they find out that the ship has been taken over by Hondo Ohnaka, who claims to have won it from Vizago in a game of sabacc. Ezra, assuming the name Lando Calrissian, works out a deal to help Hondo in exchange for some sorely-needed power generators.  Impressed with Ezra's skill, Hondo offers him a place in his pirate crew.  However, Ezra and Chopper discover Vizago imprisoned in his ship's brig and Ezra helps him get it back in hopes of developing a useful contact for the Rebels.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 207\n|Viewers         = 0.55\n|ShortSummary = Phoenix Squadron tries to break an Imperial blockade in order to provide food supplies to those who need it, but their transport is destroyed and the mission fails. Hera is then tasked to go to a planet whose atmosphere is very difficult to fly in to get a ship being built by a Mon Calamari named Quarrie that can break the blockade. After nearly crashing her shuttle, Hera convinces Quarrie to let her pilot the ship, called the Blade Wing, or B-Wing for short. With the Blade Wing's firepower, Hera singlehandedly destroys one of the Imperial blockade ships, allowing the Ghost to break the blockade and deliver the needed supplies.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 208\n|Viewers         = 0.47\n|ShortSummary    = Sabine is sent by Hera to acquire an unknown information courier. She goes with Ezra and Chopper and they find that the courier is a clunky droid. They then encounter Ketsu Onyo (Gina Torres), Sabine's estranged friend who works as a bounty hunter and is now after the droid. When some Stormtroopers begin to fire at them, Sabine and Chopper steal a ship and go off planet with the droid, unfortunately with Ezra left behind. Ketsu also escapes in her own ship and, after a confrontation with Sabine, captures Chopper and the two meet up to exchange droids. Their activity draws the attention of an Imperial cruiser and the two team up to escape by setting charges on the stolen ship. Sabine is knocked out and almost abandoned with the ship, but Ketsu saves her and the explosion allows them to fly the droid to a rebel location and then rejoin Ezra and Hera before Ketsu leaves on better terms with Sabine.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 209\n|Viewers         = 0.55\n|ShortSummary    = Ezra and Commander Jun Sato are captured when a new Imperial weapon—an experimental Interdictor-class Star Destroyer—generates a gravity well strong enough to pull ships out of hyperspace. Hera sends Kanan, Rex and Chopper to rescue them, using a stolen shuttle, stormtrooper armor, and Rex's knowledge of Imperial codes and protocols to infiltrate the Interdictor, although Kanan's lingering distrust of Rex initially hampers the mission. Ezra and Chopper head to the reactor to sabotage the Interdictor, but Rex is captured as he and Kanan escort Sato and his crew to their shuttle. Kanan heads back to rescue Rex and they deploy an escape pod, as Chopper's sabotage causes the gravity well projectors to overload, pulling the other Imperial cruisers towards the Interdictor and destroying it.\nNote: This is the last episode to take place in 4 BBY.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 210\n|Viewers         = 0.49\n|ShortSummary    = Ahsoka informs Kanan that she's continuing her investigation on the Sith Lord Darth Vader, but finding information on him is difficult. In the meantime, she receives word of two sets of coordinates that cross the Imperial net.  She heads to look into one of them while dispatching Kanan, Ezra, Zeb, and Chopper to the other.  Ahsoka arrives at her location first, a ransacked passenger ship adrift in space, and finds signs of weapon damage all over.  The lone survivor, a grandmother, claims \"two redblades\" kidnapped her grandchild from her and disappeared. Ahsoka informs the team at their destination on a distant planet that the two Inquisitors are involved.  Zeb and Chopper locate the Inquisitors' fighters at the spaceport and reclaim the baby stored in one before destroying them, while Kanan and Ezra find the distressed mother of the second child.  Chopper takes the first child to the Phantom shuttle while Zeb encounters the Inquisitors on the street after relieving a fleeing droid of the second baby. Kanan, Zeb, and Ezra discover that the children are force sensitive and were targeted by the Inquisitors to ensure they do not become Jedi. They attempt to lose the Inquisitors through a housing block on their way back to the shuttle, but are overpowered by them.  Ahsoka appears and easily defeats both of the Inquisitors while the rest escape, using the Force to jump up and join them in the shuttle as it passes overhead. The Rebels escape, but not before one of Seventh Sister's probe droids hears Ezra saying they are going to the planet Garel.\nNote: This is the first episode to take place in 3 BBY.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 211\n|Viewers         = 0.55\n|ShortSummary    = Ezra has a vivid dream about his parents, which he is convinced is a vision which will lead him to discover their fate. Hera and Kanan reveal that they have secretly spent months investigating Imperial prisons, and have heard about a recent prison break. As the Ghost prepares to return to Lothal to investigate Ezra's visions, the Imperial fleet arrives at Garel based on the intelligence from the Seventh Sister's probe droid. Ezra and Kanan escape to Lothal in the Phantom, while the Ghost remains behind to assist the escape of the rebel fleet. On Lothal, Ezra follows a Loth-cat which appeared in his dream to Prisoner X-10, one of the escapees who is the former Governor of Lothal, Ryder Azadi. Azadi tells Ezra that his parents heard his broadcast and it had inspired them to organize the prison break in which he had escaped, but Ezra's parents were killed during the breakout. While saddened at his parents' deaths, Ezra takes solace in that they heard his message, and Kanan comforts him by telling him that his parents live on inside him.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 212\n|Viewers         = 0.60\n|ShortSummary    = While Ezra grapples with the news about his parents, the rebels make plans with Senator Bail Organa to secure three much-needed cruisers. Leading the mission is an agent hand-picked by the Senator: his daughter, Princess Leia. Leia meets up with Kanan and Ezra and plans to have them take her ships, giving the pretext that the Rebels hijacked them so as not to reveal Alderaan's support. However, their plans are thwarted when Imperial security proves to be much stronger than expected. The trio link back up with rest of the Ghost crew, rescuing Azadi from an Imperial patrol in the process. Leia then inspires the crew to come up with a plan to steal the cruisers, with Leia distracting the guards while the Phantom provides air support and Azadi disables the gravity locks on the cruisers. The plan is a success, with the Rebels stealing all three cruisers and Leia further masking her involvement by blaming the Imperials for their failure to protect them. Inspired by the actions of Leia and the Rebels, Azadi decides to join the cause.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 213\n|Viewers         = 0.48\n|ShortSummary    = With the Empire tightening its cordon around Lothal, the Rebels look for a new smuggling route. Hera and Sabine head out to the world of Concord Dawn to request safe passage from the Protectors, the Mandalorian faction that controls the world. However, the Protectors reveal that they have sided with the Empire and immediately attack. Hera and Sabine escape, but Hera is critically wounded. Kanan and Sabine return to Concord Dawn, with Kanan still wanting to negotiate with the Protectors and Sabine wanting to get revenge for Hera. They discover the Protector's leader, Fenn Rau (Kevin McKidd), is being bribed by the Empire. Kanan meets with Rau, revealing that Rau had saved his life during the Clone Wars. Meanwhile, Sabine attempts to sabotage the Protectors' fighters but is caught. She reveals to the Protectors that she is from House Vizsla, and challenges Rau to single combat. Working together, Kanan and Sabine capture Rau, and he agrees to allow the Rebels safe passage through Concord Dawn.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 214\n|Viewers         = 0.56\n|ShortSummary    = Following a tip from Hondo, the Ghost crew rescues a pair of Lasats from Imperial custody: Chava the Wise and Gron, who both recognize Zeb as Captain of the Lasan Honor Guard. Chava and Gron explain that they are searching for the mythical world of Lira San, where the surviving Lasats can find refuge. However, Zeb is reluctant to help due to his guilt over failing to protect Lasan from the Empire. With some encouragement from Ezra, Zeb transforms his Bo-Rifle into its true form and combines it with Chava's staff, revealing Lira San's location in uncharted Wild Space. However, they find their way blocked by a dense cluster of black holes while Agent Kallus pursues them. Trusting in Chava's wisdom, Zeb uses the energy from his Bo-Rifle to create a protective field around the Ghost, allowing it to navigate the black hole cluster safely. On the other side, they find the world of Lira San, which is the true home planet of the Lasat people. After dropping off Chava and Gron, Zeb decides to stay on the Ghost in order to find more Lasat survivors to guide back to Lira San. It is in this episode that the ancient names of the sides of the Force are first revealed by Chava, calling the light side the ashla, and the dark side the bogan, and repeated by The Bendu on Atollon in a later episode of Rebels.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 215\n|Viewers         = 0.59\n|ShortSummary    = The Ghost crew is on a mission to capture a fuel shipment from the Mining Guild to the Empire, in order to restock the Rebel fleet's own dwindling supplies. While travelling to the Guild's asteroid refinery, the Ghost encounters a flock of purrgil, space-travelling creatures whom Hera considers dangerous. However, Ezra establishes contact with them through the Force and learns that his crew and the purrgil actually pursue the same basic goal, if for slightly differing priorities. Upon reaching the Mining Guild base, the crew finds the Mining Guild attempting to exterminate the purrgil. Kanan plans to raid the base and steal the shipment, while igniting the rest of the fuel to create a diversion. However, Ezra stops him when he realizes that the purrgil also need the fuel. When it appears as if the Mining Guild forces will overwhelm the crew, the purrgil arrive and attack the Mining Guild, giving the crew the time they need to escape with the fuel. As the Ghost flies away, the crew witnesses the purrgil going into hyperspace, confirming rumors that they are a migratory species capable of faster-than-light travel without technology.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 216\n|Viewers         = 0.51\n|ShortSummary    = In order to provide a safe shelter for their fighters, the Rebels plan to capture an Imperial carrier currently stationed above Ryloth, Hera's home planet. In order to pull the mission off, the Ghost crew contacts Hera's father, the famed Twi'lek resistance fighter Cham Syndulla. However, Cham desires to destroy the carrier as a demonstration of power, and only grudgingly agrees to capture it. Hera later tells Ezra that she and her father are not on the best of terms, as Hera believes Cham is obsessed with the Twi'lek Resistance while Cham believes Hera's faith in the Rebellion is misguided. Piloting a captured TIE Bomber, Hera successfully infiltrates the crew and Cham's team into the carrier, but Cham's team betrays them and moves to destroy the carrier. Ezra uses a Jedi mind trick on the captain to have the crew abandon ship while Zeb and Sabine subdue Cham's men. Hera convinces Cham to help her, and they destroy a pursuing Imperial cruiser, achieving the demonstration Cham wanted. After adding the carrier to the Rebel fleet, Hera and Cham reconcile before parting ways.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 217\n|Viewers         = 0.56\n|ShortSummary    = The Ghost crew receives a tip about Imperial activity around the planet Geonosis and go to investigate only to find the planet completely devoid of life and evidence of a large weapon having been constructed in orbit. When the crew boards one of the abandoned construction modules, they are ambushed by Agent Kallus. Most of the crew is able to escape back to the ship, but Zeb is forced to take an escape pod. Kallus pursues Zeb into the pod, which gets damaged during their struggle and the pair crash land on one of Geonosis' icy moons. Kallus' leg is injured in the crash, and he and Zeb are forced to work together to survive by fending off hostile monsters and climbing out of the cave they are trapped in. During this, Kallus admits to Zeb that he respects Lasats as warriors, but dislikes them due to his first squad being wiped out by a Lasat. He also reveals he did not agree with the Empire's decision to exterminate the Lasats and that the Bo Rifle he claimed to have stolen from a dead Lasat Honour Guard was actually given to him by the guard after defeating him in an honourable duel. Upon reaching the surface, they activate their emergency transponder. The Ghost arrives to rescue Zeb shortly after. Kallus wishes to take his chances and wait for Imperial rescue rather than be a Rebel prisoner, and both he and Zeb part ways with a newfound respect for each other. Returning to his Star Destroyer, Kallus is greeted rather coldly, even by Imperial standards, and the episode concludes with him sitting in his quarters, deep in thought.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 218\n|Viewers         =0.68\n|ShortSummary    = Ezra and Kanan, after facing off with the Inquisitors again, decide it is not safe for them to be around the Rebels while they are being targeted by the Empire, and decide to get advice from Ahsoka. On her advice, the three set out for the Jedi Temple on Lothal, where each have a separate vision; Ezra, of Master Yoda, Kanan, of the Temple Guard who is testing him, and Ahsoka, of Anakin/Vader. As the Inquisitors track the group to the temple and force their way inside, Ezra is told by Yoda to \"find Malachor\", Kanan is warned by the Guard, who reveals himself as the former Grand Inquisitor, to beware Ezra's turning toward the Dark Side, dubbing Kanan the official rank of Jedi Knight, a rank he was never able to achieve due to the execution of Order 66 and the extermination of the Jedi Order. During her vision, Ahsoka faces her guilt over not being present during the fall of the Jedi, while also accepting the fact that her former master, Anakin Skywalker, has become the Sith Lord Darth Vader. The three escape as the shades of the Temple Guards hold off the Inquisitors. Vader and the Empire's forces arrive at the Temple, as Ahsoka informs Ezra that Malachor is actually a place.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 219\n|Viewers         =0.58\n|ShortSummary    =While on a mission to steal fuel, Chopper steals a replacement strut for his original leg. Chopper is separated from the Ghost crew and finds himself stranded on an Imperial freighter. He is eventually discovered by the ship's inventory droid, AP-5, who does not report him upon finding out that Chopper is a veteran of the Clone Wars, just like him. AP-5 complains to Chopper that the Empire does not appreciate his previous role as a strategist, and the freighter crew constantly mistreats him. Chopper removes AP-5's restraining bolt, and the two work together to trap the crew in the cargo hold and detach it from the ship. Chopper makes contact with the Ghost, and AP-5 warns them that the Empire knows their destination and has set up a trap. AP-5 is shot by the freighter captain as he transmits new coordinates, but the Ghost crew repairs him by using parts from the leg Chopper stole.\n|LineColor       = E5D12A\n}}\n|ProdCode        = 220\n|Viewers         =0.53\n|ShortSummary    = After finally finding a planet that is safe from the Empire, the Rebel fleet lands to set up their base. However, one of their scouts goes missing after setting up a sensor beacon. Sabine and Rex go to investigate when they are attacked by a swarm of Krykna spiders. Sabine is rescued by the Ghost crew, but Rex is captured by the spiders. The crew follows them and rescues Rex, but cannot escape upon finding that the spiders have trapped the Ghost with a web. Sabine discovers that the spiders cannot go near the sensor beacons they had set up, and uses one to ward them away while the rest of the crew cuts the web and escapes. Back at the base, instead of abandoning the planet, the Rebels use their sensor beacons as a makeshift barrier to keep the spiders away. Ezra, Kanan, and Ahsoka decide to head for Malachor to find a way to deal with the Inquisitors.\n|LineColor       = E5D12A\n}}\n|ProdCode_1        = 221\n|ProdCode_2        = 222\n|Viewers         = 0.69\n|ShortSummary    = Ahsoka, Ezra, Kanan and Chopper arrive on Malachor – a Sith world long forbidden to the Jedi – in search of knowledge, discovering a cavern containing a Sith Temple amid the site of an ancient battlefield between Sith and Jedi who used cross guard lightsabers. They soon are attacked by a new Inquisitor, the Eighth Brother, who is hunting a mysterious hermit calling himself \"Old Master.\" When Ezra encounters the hermit, he reveals himself to be Maul (Sam Witwer) and offers to help Ezra get into the Temple, aiding him in recovering a Sith holocron.  When the other Inquisitors arrive and alert Darth Vader of their presence, Ezra convinces the group to work together in spite of Kanan's fears that Maul is corrupting his student, allowing them to finally kill the three Inquisitors. However, Maul soon betrays the group and blinds Kanan with his lightsaber, revealing his true intentions of making Ezra his apprentice. Although sightless, Kanan dons the mask of a fallen Jedi Temple Guard and throws Maul from the top of the temple. Ahsoka finally faces Darth Vader – who has cornered Ezra and destroyed his lightsaber – and comes to terms with his identity as Anakin Skywalker as she engages him in a duel, while Kanan and Ezra remove the Sith Holocron. Unable to abandon her old Master, Ahsoka stays within the crumbling temple and stalls Vader while Ezra, Kanan, and Chopper flee the planet and reunite with the Ghost crew. Maul flees Malachor in one of the Inquisitor's ships while Vader, who survived the destruction of the temple, walks away as a convor watches from above and an unknown figure is briefly seen limping into the shadows. As the Ghost crew tries to cope with their losses, Ezra continues to meditate on the Sith Holocron and finally succeeds in opening it.\nNote: This is the last episode to take place in 3 BBY.\n|LineColor       = E5D12A\n}}\n}}\nSeason 3 (2016–17)\n|ProdCode_1        = 301\n|ProdCode_2        = 302\n|Viewers         = 0.56\n|ShortSummary    = Six months after the events of the previous season, Ezra leads a mission to rescue Hondo Ohnaka from an Imperial prison, wielding a new lightsaber and displaying Force skills that he's learned from the Sith holocron in the process. Hondo's intel regards a squadron of Y-wings due to be destroyed at an Imperial shipyard that the Rebels set out to appropriate, with Ezra being given command of the mission. Kanan, meanwhile, is struggling with his blindness when he discovers Ezra's use of the holocron and confiscates it, before being summoned out into the Atollon wilds by a mysterious call that proves to be from the Bendu (Tom Baker), an ancient Force user who is neither Jedi nor Sith but rather \"the one in the middle\". Meanwhile, Governor Arihnda Pryce decides that the growing rebel threat requires a greater response and requisitions the Seventh Fleet, which is revealed to be under the leadership of the recently promoted Grand Admiral Thrawn (Lars Mikkelsen). The Bendu helps Kanan to realize that the Force grants him abilities that can make up for his lost sight, and on sensing Ezra's peril on the mission Kanan leaves to go help him, leaving the holocron with the Bendu. The Rebels secure a handful of fighters but lose the Phantom after Ezra sets the shipyard plummeting, and it is only the timely arrival of the Ghost and other rebel ships that saves them after Thrawn determines that they are not dealing with the entire rebel fleet and orders his forces to allow their escape. Ezra is suspended, but expresses his gratitude to Kanan for rejoining the action while the rebels learn that the Y-wings are to be delivered to General Dodonna's unit.\nNote: This is the first episode set in 2 BBY.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 303\n|Viewers         = 0.41\n|ShortSummary    = Kanan and Ezra are scheduled to rendezvous with a Rebel corvette, which they discover to have been attacked. They find a survivor who claims that a \"red blade\" cut him and was forced to give up the Ghost crew's location. They contact Hera only to find out that Maul has already captured them. Kanan and Ezra agree to give Maul both the Sith and Jedi holocrons. If not, the rest of the crew of the Ghost will die. Kanan and Ezra return to the Bendu to retrieve the Sith holocron. The Bendu first tests Kanan and Ezra by having them navigate a cave, infested with Atollon's native krykna hexapod spiders. Kanan teaches Ezra to move among the spiders without alerting them and retrieve the holocron. The Bendu then warns the pair that if the Jedi and Sith holocrons are combined, they would be able to grant the wielder immeasurable knowledge, but at a price. Kanan and Ezra then meet with Maul. Kanan rescues the Ghost crew while Maul combines the holocrons with Ezra. Ezra asks how to defeat the Empire while Maul asks for the whereabouts of someone. Kanan interrupts the process before it can be completed, but Ezra and Maul sense that the answers to both of their questions can be found on \"a planet with twin suns\". Maul flees, gleefully muttering \"he lives\". Ezra receives visions of various locations, but cannot make sense of them, and Kanan assures him they will find the answers.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 304\n|Viewers         = 0.51\n|ShortSummary    = The Rebellion begins suffering heavy casualties due to Imperial ambushes on their convoys, and they risk running out of pilots. Fortunately, they receive a tip from a new \"Fulcrum\" that several Imperial cadets at Skystrike Academy are willing to defect. Sabine is selected to infiltrate the academy and she meets and befriends a fellow cadet named Wedge Antilles (Nathan Kress). Ezra and Kanan wait in space with a transport ready to evacuate Sabine once she finds the defectors. Meanwhile, Governor Pryce and Agent Kallus arrive at the academy to root out the defectors. Sabine figures out Wedge is one of the defectors, and assures him that she will get him and his friends Hobbie and Rake to the Rebellion. Pryce then organizes a trap by arranging a training flight in space. Sabine and Wedge take the bait, only to find out their fighters have been sabotaged. Sabine, Wedge, and Hobbie are captured and Rake is killed while Ezra and Kanan are forced to retreat. Pryce attempts to interrogate Sabine, but Sabine knocks her out and escapes, freeing Wedge and Hobbie as well. Kallus secretly provides assistance to Sabine in order to repay his debt to Zeb. Sabine and Wedge steal a TIE bomber, rendezvous with Ezra, and return to the Rebel base safely.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 305\n|Viewers         = 0.40\n|ShortSummary    = The Ghost crew makes a supply run to the Twi'lek resistance on Ryloth, only to find out from Cham that under Thrawn's leadership, the Imperials have begun to seize the upper hand, and have captured their home and converted it into their headquarters. This also means that their \"kalikori\", an important family heirloom, is in Imperial hands as well. Determined to retrieve her kalikori, Hera decides to return to her home and infiltrate the Imperial headquarters. She and Ezra sneak into the base while the rest of the crew and Cham distract the Imperial patrols. However, Thrawn predicts Hera's actions and captures her and Ezra, and decides to keep her kalikori for himself. He then arranges a deal with Cham where Hera and Ezra's lives will be spared if Cham turns himself in. However, with Chopper's help, Hera creates a distraction by destroying her home and the Imperial HQ with explosives and everybody escapes on the Ghost. Meanwhile, Thrawn observes the entire event, and impressed with Hera's ingenuity, decides to let the rebels escape. Back on the Ghost, Hera reassures her crew that even though she wasn't able to recover her kalikori, the most important thing is that she's back with her family and friends.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 306\n|Viewers         = 0.45\n|ShortSummary    = On a salvage mission to an old Clone Wars battlefield led by Captain Rex, the Ghost crew is captured by a unit of old battle droids. Their commander, a Super Tactical Droid named \"General Kalani\", had avoided the army-wide shutdown command and now wants to pit his forces against Rex and the Jedi in order to determine whether the Separatist or Republic forces are superior once and for all. As Rex, Ezra, and Kanan battle the droids, Chopper sneaks away and sends a distress signal to Hera and Sabine. Ezra then discovers Chopper immediately afterwards, with Chopper also having discovered a trio of intact and still-spaceworthy Neimoidian shuttles. However, the Empire also receives the distress call and dispatches an assault force. Rex and the Jedi reach \"Kalani\", and Ezra points out to him that neither the Republic nor the Separatists won the Clone Wars, but were in fact both defeated by the Empire. Ezra also notes that since the Separatists were originally fighting to resist tyranny, the battle droids should naturally oppose the Empire. \"Kalani\" sees the logic in Ezra's words, with the Ghost crew and the droids working together to escape the Imperial assault force in two of the three vintage Neimoidian shuttles Chopper found; the one on which the Spectres escape replaces the lost Phantom. Calculating that the Rebellion has less than a 1% chance of succeeding against the Empire, \"Kalani\" amicably parts ways with the Rebels. Rex congratulates Ezra for doing what no Senator, Clone, or Jedi ever could: convincing clones and battle droids to set aside their differences and agree to peace.\nNote: This episode features the title logo and end credits theme of Star Wars: The Clone Wars.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 307\n|Viewers         = 0.55\n|ShortSummary    = Sabine continues to try to convince Fenn Rau to have his Protectors formally join the Rebellion, but Fenn remains staunchly loyal to Mandalore. When contact with the Protectors is lost, Sabine, Ezra, and Chopper are sent with Fenn to investigate. However, when they arrive, they find the Protectors base completely destroyed. After they destroy an Imperial probe droid, a squad of Imperial Mandalorians led by Gar Saxon arrive to investigate. Ezra and Chopper are captured while Sabine and Fenn escape. While spying on Gar, Fenn realizes that the Empire intended to destroy him and the Protectors all along, and he decides to join forces with Sabine. Sabine rescues Ezra and Chopper, but Fenn seemingly betrays them when he takes their shuttle and escapes without them. Gar explains how Sabine's defection to the Rebellion caused disgrace to her family, who have now pledged their allegiance to the Empire. Sabine, Ezra, and Chopper try to flee from Gar and his men, and are assisted by Fenn who helps them escape, but not before Sabine defeats Gar in hand to hand combat. Fenn, impressed by Sabine's loyalty to the Rebellion and her friends, decides to officially join the Rebellion.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 308\n|Viewers         = 0.41\n|ShortSummary    = The Ghost crew arrives at a planet to help evacuate anti-Imperial dissidents. They are assisted by another armed freighter that identifies itself as Iron Squadron. Commander Sato explains that Iron Squadron used to be led by his brother, but he was killed in combat, leaving the squadron under the leadership of his headstrong nephew Mart Mattin (Zachary Gordon). While the rest of the crew evacuates the dissidents, Ezra and Sabine board Iron Squadron's ship and meet Mart and his crew. However, they are young and inexperienced, and their hyperspace drive is inoperable. When Thrawn learns of Iron Squadron, he sends a larger force. Ezra, Sabine, and Mart's crew flee while Mart stays behind to try to fight the Imperials but his freighter is disabled. The Ghost crew and Commander Sato return to rescue Mart, and barely escape Thrawn's ambush. Now safe, Mart and his friends decide to join the rebels.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 309\n|Viewers         = 0.44\n|ShortSummary    = The Rebels form an uneasy alliance with Hondo in order to break into an abandoned Imperial ship to steal its valuable cargo, with Hondo promising them a shipment of proton bombs in return. However, the cargo ship is dangerously close to a heavy storm, making any salvage attempt hazardous. They enlist the aid of AP-5, but Kanan and Hera are worried that Ezra puts too much trust in Hondo. The group boards the ship and finds the cargo they are looking for. However, as they load the cargo onto the Ghost, they are attacked by Imperial sentry droids which were protecting the ship. Both the Rebels and Hondo's crew narrowly escape the cargo ship before it plunges into the storm, and while the Rebels are able to retrieve most of the proton bombs, Hondo is unable to secure any of the treasure. In addition, Ezra comes to realize how little Hondo cares about his own crew or \"business partners\".\n|LineColor       = 21ae05\n}}\n|ProdCode        = 311\n|Viewers         = 0.36\n|ShortSummary    = Ezra and Kanan return to Lothal to scout the Imperial factory there, intending to destroy it. With the help of a local resistance cell led by Azadi, they infiltrate the factory disguised as workers in order to gain intelligence on a new weapon the Empire is developing. However, Thrawn is also present in the factory and locks it down, suspecting rebel spies are sabotaging the vehicles being made there. Ezra, Kanan, and Chopper steal the weapon data, and are assisted by Kallus, who reveals that he is Fulcrum. The three escape the factory in stolen walkers and get the data to the rebels. After analyzing the data, they discover that Thrawn is developing a new type of TIE fighter: the TIE Defender, which unlike other TIE fighters, comes equipped with shields. Thrawn deduces that the rebels could not have retrieved the data without help from the inside. However, instead of hunting for the spy, Thrawn decides to wait, intending to use the spy against the rebels.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 310\n|Viewers         = 0.43\n|ShortSummary    = Ezra is plagued by visions of Maul, who approaches him and Kanan as they consult the Bendu, offering a deal. Maul threatens to reveal Chopper Base to the Empire unless Ezra accompanies him to complete a ritual in order to reveal to both of them the information they sought from the Jedi and Sith holocrons. Maul and Ezra arrive on Dathomir, where they use dark magic to complete their holocron vision—a desert planet with two suns, where what they both seek is located. As the ritual completes, Ezra and Maul are attacked by the spirits of the Nightsister clan. Kanan and Sabine arrive, having tracked Ezra to Dathomir, but they are possessed by the Nightsisters and made to attack Ezra and Maul. Maul escapes, and Ezra uses the Force to push Sabine out of the range of the altar which is the source of the spirits' power. He offers himself to the Nightsisters to free Kanan, but then destroys the altar. As they leave, Sabine grabs the Darksaber used by Maul. Kanan asks Ezra about his vision and he reveals that his means to defeat the Sith and the target of Maul's vengeance are one and the same; the Jedi Master Obi-Wan Kenobi.\n|LineColor       = 21ae05\n}}\n|ProdCode_1        = 312\n|ProdCode_2        = 313\n|Viewers         = 0.56\n|ShortSummary    = After the legendary Saw Gerrera (Forest Whitaker) and his rebel squad go missing on Geonosis, the Ghost crew is sent to investigate. Ezra, Kanan, Rex, and Chopper split off to search for Saw while Hera, Sabine, and Zeb stay behind to salvage a still operational shield generator. Ezra and his group are rescued from a battle droid ambush by Saw, who explains that the droids killed the rest of his team, and that they were rebuilt by a Geonosian survivor. Ezra, Saw, and the rest of the group pursue the Geonosian and it activates more battle droids which attack Sabine and Zeb. Ezra corners the Geonosian and Saw destroys its control device, disabling all of the battle droids. Saw then begins to interrogate the Geonosian, demanding that it tell him what the Empire was building on Geonosis. In response to Saw's questions, the Geonosian (nicknamed \"Klik-Klak\") draws two circles in the dirt. Not understanding what Klik-Klak is trying to say, Saw handcuffs Klik-Klak and forces him to lead them deeper into the ruins. Ezra becomes concerned at the hostility Saw is showing to Klik-Klak, and Rex explains that Saw's sister was killed by a Geonosian-built gunship during the Clone Wars. Meanwhile, an Imperial patrol detects life signs on Geonosis and sends scouts to investigate. Underground, Klik-Klak leads the Rebels to his hideout, where he was protecting a Geonosian Queen egg. The rebels then bring Klik-Klak back to the Ghost, where Saw begins torturing Klik-Klak and threatens to destroy the egg if he does not talk, ignoring the crew's objections. Ezra then points out Saw would be no better than the Empire if he destroys the Geonosians' last chance of survival as a species, causing Saw to reconsider. However, the Imperials send an attack force after the Ghost, forcing it to flee deep underground. In an underground chamber, they find large containers full of poison gas that the Imperials had used to exterminate the Geonosians. Saw decides to give the Geonosians a second chance at survival and lets Klik-Klak go. Klik-Klak flees deeper into the tunnels. The Rebels then try to escape with the gas containers to use them as proof of the Empire's atrocities, but they are lost when they blast their way through an Imperial cruiser. Bail Organa notes that without the containers, there is insufficient evidence for the Senate to act, but the pictures the crew had taken can be used as propaganda to further the Rebel cause. Kanan reminds Ezra that like Saw, not all Rebels fight for the same cause or for the same reasons, but Hera muses that despite her misgivings about him, Saw proved that he was better than the Imperials.\n|LineColor       = 21ae05\n}}\n|OriginalAirDate =\n|ProdCode        = 314\n|Viewers         = 0.37\n|ShortSummary    = While the rest of the Ghosts crew and Phoenix Squadron are away on an exercise mission, Zeb is left in charge of security at Chopper Base. At the same time, the Empire launches a large number of disguised infiltrator droids throughout the galaxy, and one of these units lands near Chopper Base. Damaged by the Krykna spiders and losing its memory, it is taken in by Zeb, Chopper and AP-5; but after a warning from Agent Kallus about the nature of their foundling, Zeb tries to apprehend it. Once it realizes that it is inside a rebel base, the droid's original programming kicks back in and it adopts combat mode. Cannibalizing the base's droids to repair itself, the infiltrator proves a tough nut to crack, especially since this battle is confined to a storage area filled with explosive ordnance. After a hard struggle, Zeb and the droids take it down before it can transmit its position to the Empire, but the infiltrator activates a self-destruct device inside its chassis. Faced with the prospect of the droid either blowing up the base or the Empire coming to look for it when it fails to report, Zeb instructs AP-5 to set the detonator to stall its countdown until the infiltrator transmits its collected information to the Empire. After reactivation, the droid travels back to its base ship and blasts it apart when it self-destructs; but this event nevertheless gives Grand Admiral Thrawn enough information to narrow down his search for the rebel base.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 315\n|Viewers         = 0.48\n|ShortSummary    = Upon being told by Fenn Rau what status the Darksaber Sabine recovered from Dathomir holds among the Mandalorians – especially the prestigious House Vizsla, who once ruled Mandalore – Kanan decides that Sabine should wield it in order to rally the Mandalorians into the ranks of the Rebel Alliance. Sabine, who resents her family, reluctantly agrees to the proposal and retreats with Kanan and Ezra to the Bendu's abode to be trained in the saber's use, but her persistent frustration at the expectations thrust upon her starts to fray Kanan's own patience. Tensions escalate between the two until Sabine walks away from her training to cool off; after a talk with Hera and a mutual apology upon Sabine's return, Kanan offers her the Darksaber, and the training begins in earnest. As it progresses, Kanan forces Sabine to let her own emotional turmoil loose, revealing at last the truth about her past: she feels guilty about what the weapons she designed at the Imperial Academy had done to her own people and she wanted to make up for it by saving them from the Empire's clutches, only for her family to turn its back on her out of fear of the Empire. After this difficult confession, Kanan, Ezra and Rau profess their loyalty to Sabine, no matter what course she eventually chooses.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 317\n|Viewers         = 0.36\n|ShortSummary    = Sabine, Ezra, Kanan and Rau travel from Atollon to Krownest in the Mandalore sector in order to straighten out matters with Sabine's estranged family. However, the initial reception is quite hostile, since Sabine is still considered a traitor to her family due to her defection from the Empire. Upon being presented with the Darksaber, Sabine's mother, Countess Ursa, allows her daughter the benefit of a personal conversation, but is still too fearful of an Imperial reprisal against her people, given that they hold her husband hostage, to join with the Rebellion, and so she decides to sell out the Jedi to Gar Saxon in exchange for Sabine's freedom. Saxon, however, immediately goes back on his word and denounces the entire Clan Wren as traitors to the Empire. Clan Wren and the rebels battle the Imperial collaborators, and, wielding Ezra's lightsaber, Sabine duels Saxon and the Darksaber. Sabine emerges victorious, but as she turns away from him and Saxon prepares to shoot her in the back, Ursa kills him, repairing her relationship with her daughter. Foreseeing the chaos Mandalore will face with the demise of its Imperial governor, Sabine and Rau decide to stay behind and help restore order and to find the one person truly worthy of leading Mandalore into the war against the Empire.\n|LineColor       = #21ae05\n}}\n|ProdCode        = 316\n|Viewers         = 0.42\n|ShortSummary    = An Imperial light cruiser over Lothal intercepts a shuttle fleeing the planet. On board are Ezra Bridger (disguised as a bounty hunter) and the droids Chopper and AP-5. Ezra tells Agent Kallus that the Rebels believe the Empire has intercepted his last transmission as Fulcrum, and they have come to help him defect if his cover is blown. Grand Admiral Thrawn arrives in his Star Destroyer Chimaera, and informs the officers on board that he has asked Colonel Wullf Yularen of the ISB to locate the Rebel spy in their midst. Kallus swaps his code cylinder with that of Lieutenant Lyste, and uses Lyste's credentials to free Ezra and infiltrate Thrawn's office, where the droids erase Atollon from Thrawn's database and transmit clearance codes for Kanan and Rex to rescue them. Lyste, believing Governor Pryce to be the traitor, stuns her as she tries to stop the rebels from leaving, and he is arrested as the spy. With Lyste believed to be Fulcrum, Kallus decides to remain with the Empire—although in conversation with Yularen, Thrawn reveals that he knows Kallus is the spy, and intends to use him to their advantage.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 318\n|Viewers         = 0.42\n|ShortSummary    =  The crew of the Ghost waits in a junk field to rendezvous with and refuel a Rebel ship carrying a secret cargo. The Ghost is found by an Imperial infiltrator probe droid, which the crew destroys, but not before it transmits their location to the Empire. The Rebel ship arrives, and the \"cargo\" is revealed to be Senator Mon Mothma, who is on the run after recently speaking out against the Emperor in the Senate. Two Imperial cruisers arrive, and Ezra joins Gold Squadron to fight off the TIE fighters and disable one of the cruisers, as Mothma and her crew evacuate to the Ghost. Grand Admiral Thrawn surmises that Hera will attempt to escape the sector via the Archeon Nebula, and he sends two Star Destroyers and the prototype TIE Defender to intercept them. Hera destroys two TIEs by flying close to a star, but the Defender survives and destroys most of Gold Squadron except for Ezra and Gold Leader. As the Ghost leaves the nebula, it is caught in a tractor beam by Governor Pryce's Star Destroyer. Ezra and Gold Leader disable the TIE Defender with ion cannons, then exit the nebula and fire their proton torpedoes into it, triggering an explosion which causes massive damage to the Star Destroyers. Escaping into hyperspace, the Ghost brings Mothma to Dantooine, where she transmits a message to all Rebel cells, urging the formation of the Rebel Alliance. As the Ghost crew watches in amazement, dozens of capital ships from around the galaxy drop out of hyperspace in response to the call to rebellion.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 319\n|Viewers         = 0.36\n|ShortSummary    = Chopper, AP-5, and Wedge are sent on a mission to an Imperial facility to steal access codes for the factory on Lothal. AP-5 successfully locates and steals the codes. Meanwhile, Chopper accesses the Imperial network and draws the attention of the Controller, an Imperial agent who controls an advanced spy ship. Using his ship's capabilities, the Controller remotely seizes control of Chopper, intending to use him to locate the Rebel base. With their mission successful, Chopper, AP-5, and Wedge head back to rendezvous with the Ghost. AP-5 begins to suspect something is wrong when Chopper acts uncharacteristically nice. The rest of the crew thinks AP-5 is just squabbling with Chopper again though Hera begins to have her suspicions as well. The Controller then uses Chopper to lock the crew in the cargo hold while he attempts to hack the Ghosts computer. AP-5 overrides the door controls, allowing the crew to disable Chopper. Angry that the Imperials have harmed her droid, Hera sends a counter signal back to the Controller, overloading his ship's systems and causing it to explode. Chopper returns to normal and begins bickering with AP-5 again.\n|LineColor       = 21ae05\n}}\n|ProdCode        = 320\n|Viewers         = 0.40\n|ShortSummary    =\n|LineColor       = 21ae05\n}}\n|ProdCode_1        = 321\n|ProdCode_2        = 322\n|Viewers         = 0.49\n|ShortSummary    = Various Rebel cells begin gathering at Atollon to prepare for the attack on Lothal. However, Thrawn is aware of the Rebel plans and tells Governor Pryce and Grand Moff Tarkin that \"The real performance is about to begin\" and he has already planned a trap for them. Kallus tries to warn the Rebels, but is captured by Thrawn. Thrawn traces Kallus's transmission and determines the Rebel base's location at Atollon. Thrawn sends his fleet to Atollon, which includes two Interdictor-class Star Destroyers. With the Interdictors in orbit, it is impossible for the Rebel ships to escape and the fleet is forced to fight a losing battle against the Imperials. Knowing that their only chance is to send someone out to summon the rest of the Rebel fleet, Commander Sato sacrifices himself by crashing his carrier into Konstantine's Interdictor, giving Ezra a window to escape. On Atollon, Kanan attempts to ask the Bendu for help, but the Bendu is reluctant due to its neutral role. Kanan then accuses the Bendu of being a coward, which angers the Bendu and it disappears. In hyperspace, Ezra contacts Mon Mothma for help, but she is unable to send reinforcements due to fear of them getting caught in another of Thrawn's traps. With no options left, Ezra decides to ask Sabine for help. With the battle going poorly, the Rebels are forced to retreat back to their base on Atollon and activate its shield generator, protecting them from the Imperial fleet's bombardment. Thrawn responds by sending a ground force to assault the base. Ezra reaches Sabine and convinces her and Rau to lead a small Mandalorian force to destroy the remaining Interdictor cruiser, which will allow the Rebels to escape. Thrawn's forces breach the base's defenses, but before he can capture the Rebels, the Bendu intervenes, attacking the Imperial forces and distracting them long enough for the Rebels to evacuate, but attacks them as well. At the same time, Ezra and Sabine destroy the Interdictor. Kallus escapes imprisonment and ejects in an escape pod to be picked up by the Ghost crew. The Rebel fleet then escapes. Back on the surface, Thrawn incapacitates the Bendu, who warns Thrawn that it has already foreseen his defeat. Refusing to believe this, Thrawn attempts to kill the Bendu personally, but it disappears before the shot can hit it. The remaining Rebel fleet leaves to rendezvous with the rest of the Rebellion at Yavin IV, and Hera promises to help Sabine and the Mandalorians on an upcoming mission. Ezra is worried about the massive defeat the Rebellion has suffered, but Kanan points out that it is in fact a victory since they escaped. He then tells Ezra that he foresees a future where everybody is free, but that they will have to fight to make it happen.\nNote: This is the last episode to take place in 2 BBY.\n|LineColor       = 21ae05\n}}\n}}\nSeason 4 (2017–18)\n|ProdCode_1        = 401\n|ProdCode_2        = 402\n|Viewers         =\n|ShortSummary    = Sabine, Kanan and Ezra lead Clan Wren in a raid on a Clan Saxon outpost to rescue Sabine's father who is being held captive by Clan Saxon on behalf of the Empire. The outpost turns out to be a trap to capture Sabine but they are rescued by Lady Bo-Katan of Clan Kryze. As Bo-Katan should have become ruler of Mandalore after her sister, Duchess Satine Kryze, was murdered, Sabine attempts to give her the Darksaber but Bo-Katan refuses to accept it. Sabine's father is to be moved to the capital city for a public execution, so Sabine plans to rescue him as he is being transported there. They attack the convoy and succeed in rescuing Sabine's father, Alrich Wren, who turns out to be as much of an artist as Sabine. Sabine is contacted by her mother just as the Empire reveals a new weapon, the sound of which Sabine recognises. They rush to the site of the attack and find every Mandalorian warrior vaporized. Sabine is devastated as she realises they were killed by a weapon she personally designed for the Empire, but is relieved to find her mother and brother have survived the attack. As more Imperials arrive, Sabine and her allies are rescued by Clan Kryze, while Bo-Katan and Ezra destroy the pursuing TIE fighters. Saxon shows a recording of the weapon's field test to Thrawn—the weapon superheats an alloy in Mandalorian armor, killing the occupant, but leaving stormtroopers unharmed. At Bo-Katan's camp, her men confront Sabine for her role in the creation of the weapon which she named the Duchess, after Bo-Katan's sister, Satine. Sabine convinces Clan Kryze to join her in a raid on Saxon's Star Destroyer to destroy the weapon. During the assault, Sabine is incapacitated by Saxon, who orders her to adjust the weapon to its full power. She does so, but she also recalibrates the weapon to target Imperial armor, which stuns the Imperial troops. Sabine slashes the weapon with the Darksaber, breaching its power core and destroying the Star Destroyer. At the Kryze camp, Sabine gives Bo-Katan the Darksaber, making her the true leader of Mandalore.\nNote: This is the first episode to take place in 1 BBY.\n|LineColor       = 0FDDAF\n}}\n|ProdCode_1        = 403\n|ProdCode_2        = 404\n|Viewers         = 0.26\n|ShortSummary    = Ezra, Kanan and Sabine arrive on Yavin 4 to join the main group of the Rebel Alliance. Hera's squadron also arrives in an emergency fuel dump landing, having barely survived an Imperial ambush, which Bail Organa attributes to an Imperial communications relay on Jalindi. A droid projects a hologram of Saw Gerrera, who mocks Mon Mothma for her unwillingness to go to any lengths to defeat the Empire, and Mothma angrily responds, refusing to stoop to the violence and extremism committed by Gerrera's cell. She sends the Ghost crew on a mission to intercept the relay's transmissions. Sabine inadvertently connects them to the main channel on an approaching light cruiser, forcing Ezra to impersonate an Imperial officer—unfortunately it is the very officer who is commanding the cruiser, Brom Titus. Sabine calls for Hera to pick them up, as they have been seen. Before she can do so, a U-wing piloted by Gerrera arrives, picks up Ezra and Sabine, then bombs the relay dish, destroying it and the cruiser. Hera demands Gerrera transfer Ezra and Sabine, but he jumps into hyperspace. Gerrera convinces Ezra and Sabine to aid him in discovering the secret weapon he is convinced the Empire is working on. They board an Imperial cargo shuttle disguised as a regular civilian spacecraft, and discover a group of prisoner engineers from the planet Coruscant who are being shipped to Jedha for an apparent project. Gerrera insists that this is more evidence of a secret weapon. They also find a giant kyber crystal, which they plan to haul out of there with the prisoners. Chopper attempts to get the prisoners out of harm's way via escape pod, though they are stopped by the Empire. When the plans to get the crystal off of the ship fail, Gerrera blasts it so that it will explode. He calls Two-Tubes to pick him up, and Ezra and Sabine are rescued by the Ghost crew after destroying a massive Star Destroyer. The engineers decide they want to join the Rebel cause, and they head back to Yavin 4.\n|LineColor       = 0FDDAF\n}}\n|ProdCode        = 405\n|Viewers         = 0.20\n|ShortSummary    = The rebels are informed by Ryder Azadi that the Empire is building a new and improved version of the TIE Defender. Ezra and the Ghost crew depart for Lothal, using Vizago to smuggle them in because the Empire has severely tightened its grip around the planet and nearly crushed the local rebel cell. They find the environment ruined from the Empire's activities, and that some acquaintances like Old Jho were arrested and executed for aiding rebels. Identified and chased, Ezra's crew finds unexpected aid from Ezra's old Academy friend Jai Kell and Azadi himself, who ferry them to safety, but are sorely disappointed to hear that the Rebel Alliance is unable to execute a liberation strike on Lothal. Ezra tries to stay optimistic by telling them that they can destroy the TIE Defender factory by working together, though Azadi remains skeptical due to having witnessed the capabilities of the TIE Defender Elite.\n|LineColor       = 0FDDAF\n}}\n|ProdCode        = 406\n|Viewers         = 0.19\n|ShortSummary    = The Ghost crew scouts an Imperial air field where the TIE Defender Elite is being tested. Sabine hits upon the idea of stealing its flight data recorder to obtain the information the rebels need about the TIE, but unfortunately Grand Admiral Thrawn appears to witness a combat demonstration of the new fighter. Cornered, Sabine steals the fighter to get herself and Ezra to safety, but due to an installed kill switch the fighter ends up stranded in the hills of Lothal. While hiding the TIE's hyperdrive for later retrieval and then trying to evade the Imperial search parties, Ezra catches several unexpected glimpses of a white Loth-Wolf, a rare predatory species. Eventually, the Loth-Wolf appears before him, sends Sabine to sleep and carries them back to their friends, only to disappear as mysteriously as it appeared, leaving Ezra with the strange parting message \"Dume\" to ponder over.\n|LineColor       = 0FDDAF\n}}\n|ProdCode        = 407\n|Viewers         = 0.27\n|ShortSummary    = Ezra, Jai Kell and Zeb move to secure the TIE Defender Elite's hyperdrive before the Imperial recovery team can find it, but Thrawn has already dispatched an additional helper for the search: Rukh, an assassin and unerringly accurate tracker. As Zeb takes the hyperdrive to safety, Ezra and Jai end up being chased by Rukh; they elude him with much difficulty, but a tracking beacon Rukh attached to their speeder leads Governor Pryce to the Ghost crew's hideout. While Hera and Chopper evacuate to Yavin with the stolen flight recorder, the rest of the rebels face the incoming Imperials to cover their retreat. Just before the two groups clash, the white Loth-Wolf reappears and leads them into a hidden tunnel complex imbued with the Force. Walking mysterious paths, the rebels inexplicably find themselves in a hidden settlement halfway across the planet which was visited in ancient times by the Jedi who erected the secret temple on Lothal, and discover that the Loth-Wolf is a messenger of the Force, here to tell them of a more sinister goal pursued by the Empire.\n|LineColor       = 0FDDAF\n}}\n|ProdCode        = 408\n|Viewers         = 0.26\n|ShortSummary    = After the Lothal rebels have taken shelter in the ancient settlement, they discover a Mining Guild ore crawler stripping Lothal's surface for raw materials passing by, and decide to hijack it to establish contact with Hera and the Yavin rebel base with its communicators. However, the crawler's captain shuts down the vehicle and raises the alarm, and as Sabine works to reactivate it, Kanan and Zeb discover a number of slaves in the hull, among them Vizago, who was sold to the Guild by the Empire. Working together, the rebels and the former slaves waylay an incoming Imperial patrol investigating the distress call and prevent the captain from destroying the crawler. In the meantime, Hera, unwilling to wait any longer, inspires rebel command to conduct an immediate assault on the factory where the TIE Defender is being produced, and after communication is established, Ezra's team agrees to coordinate the impending assault from the planet's surface.\n|LineColor       = 0FDDAF\n}}\n|ProdCode        = 409\n|Viewers         = 0.28\n|ShortSummary    = Hera and her assault team arrive at Lothal and begin to battle their way past the Imperial blockade, while the Ghost crew on the ground sabotage the anti-aircraft batteries to allow an unhindered attack on the TIE factory at Lothal's capital. However, with Thrawn coordinating the Imperial defenses, the Rebel attack force is annihilated, with only a few survivors – Hera, Chopper and pilot Mart Mattin – managing to reach the surface and regroup safely. As Hera's group attempts to slip out of the city under constant pursuit by Rukh, Kanan returns to the capital to look for her, only to be stopped by the Loth-Wolf, and he asks it what he should do. Hera opens an escape route, but is captured by Rukh before she can use it. Mart and Chopper are then picked up by Kanan and brought to the rebels' hideout as the Loth-Wolf watches.\n|LineColor       = 0FDDAF\n}}\n|ProdCode        = 410\n|Viewers         = 0.34\n|ShortSummary    = While Hera is being tortured by Governor Pryce, Ezra, Kanan and Sabine prepare to rescue her. With Admiral Thrawn absent on Coruscant, they infiltrate the Lothalian Imperial command center using gliders they built to look like Loth-bats, and as Ezra and Sabine secure a gunship as an escape craft, Kanan recovers Hera's kalikori—an important family heirloom that was taken by Thrawn earlier in the series—and frees Hera before she (under the effect of a truth serum) can reveal the location of the Rebel base. As they attempt to escape on one of the gliders, Kanan instructs Hera to land them inside Lothal City's fuel depot. Just as Ezra and Sabine pick them up, Pryce orders her troops to open fire on the fuel tanks, causing an explosion. Caught on top of the tank, Kanan uses the Force to control the explosion and push Hera and his friends away from the blast, at the cost of his own life.\n|LineColor       = 0FDDAF\n}}\n|ProdCode        = 411\n|Viewers         = 0.35\n|ShortSummary    = With the destruction of the Imperial fuel depot and the resulting shutdown of the TIE Defender project, Governor Pryce decides to cover up her blunder by throwing a victory parade, but Thrawn is not deceived. While Sabine and Zeb depart for Lothal City to spoil that party, Ezra sinks into despair until he is challenged by the Loth-Wolves and led toward a gigantic Loth-Wolf called Dume, who confronts him with his fears and tells him to return to the Lothal Jedi temple. Meanwhile, after noticing that the Imperial TIE factory has been shut down, Sabine and Zeb encounter and engage in combat with Rukh; after beating him unconscious, they send him, covered in Sabine's graffiti, back to Lothal City to show that the rebels are still willing to fight. Hera overcomes her own grief by adding a token for Kanan to her kalikori, and by being told by Sabine and Zeb of how Kanan essentially fulfilled their goal of stopping the TIE Defender project. Ezra then informs his friends of their important mission to go to the Jedi temple and recover its precious knowledge from the hands of the Imperials.\n|LineColor       = 0FDDAF\n}}\n|ProdCode        = 412\n|Viewers         = 0.28\n|ShortSummary    = With the aid of the Loth-Wolves, Ezra, Hera, Sabine, Zeb and Chopper head for the Jedi temple, which they find being occupied by a Mining Guild excavation team led by Imperial Minister Hydan, who is very close to penetrating the temple's secrets. By interpreting an unearthed mural depicting the Mortis Gods (Father, Son and Daughter), Ezra uses the Force to bring the images to life, which show him the location of the door. However, despite their disguises as Imperial scouts, their presence is found out and the alarm is raised. Ezra escapes through the door into the temple just before he can be captured.\n|LineColor       = 0FDDAF\n}}\n|ProdCode        = 413\n|Viewers         =\n|ShortSummary    = Sabine ends up being questioned by Hydan and asked by him to interpret the pictograms he has found within the Jedi temple, thereby learning that Darth Sidious intends to breach the barriers between life and death as a final stepping stone to controlling the Force within the entire universe. Just after she has deciphered how to close the portal, Sabine is extracted by Hera and Zeb. In the meantime, Ezra wanders within the \"World Between Worlds,\" a void between space and time until he is led by Morai to another portal, which opens Ahsoka's final battle against Darth Vader. Just before her imminent demise, Ezra pulls her through the portal into the void, saving her. Thinking that he has a chance to save Kanan as well, he considers an attempt, but is dissuaded by Ahsoka, who tells him realizing that if he had pulled Kanan out, he and the others would have perished instead. But with the opening of the Lothal door, Sidious is finally able to reach into the void and attack them. Ezra and Ahsoka separate and escape through the portals through which they have come. With Sabine's hint, Ezra is able to seal the portal to the void, which also triggers the full collapse of the temple. After a narrow escape, Hera returns to the temple, which has completely vanished. With what he has learned in the void, Ezra is finally able to overcome his grief over Kanan's death.\n|LineColor       = 0FDDAF\n}}\n|ProdCode        = 414\n|Viewers         = 0.51\n|ShortSummary    = Hera, Rex, and Kallus recruit Hondo, Gregor, Wolffe, and Ketsu for a plan to liberate Lothal, which they agree to out of respect for Ezra. Back on Lothal, Ezra receives a vision that Thrawn is returning from Coruscant, meaning that they must enact their plan to seize the capital right away. At the capital, Pryce is secretly contacted by Ryder, who offers to betray the Rebels to her in return for his own safety. Pryce and Rukh lead an assault force on the Rebel base, while Hera attempts to return with reinforcements but must first slip past the Imperial blockade. The Imperials quickly gain the upper hand and capture the Rebels, but Ryder reveals that his betrayal was merely a ruse to lure Pryce out of the capital. Hera then arrives with the Ghost and her reinforcements while Ezra summons the Loth-Wolves to aid in the battle. The Imperials are swiftly defeated and Pryce is captured, but Ezra reminds everybody that the battle to liberate Lothal is just beginning.\n|LineColor       = 0FDDAF\n}}\n|ProdCode_1        = 415\n|ProdCode_2        = 416\n|Viewers         = 0.46-->\n}}"
    }
  ]
}