{
  "content": [
    {
      "type": "text",
      "text": "# List of Breakout Kings episodes\n\nBreakout Kings is an American crime drama television series that premiered on the A&E Network on March 6, 2011. The series was created by Nick Santora and Matt Olmstead, who previously worked together on Prison Break. It premiered as the most-watched original drama series in A&E's history among adults 25–54 and adults 18–49, delivering 1.6 million adults 25–54 and 1.5 million adults 18–49. The series was picked up for a second season on July 6, 2011. The season finale of the second season aired on April 29, 2012 at 9 p.m. ET/PT featured two hours of back-to-back episodes \"Freakshow\" and \"Served Cold\" instead of the usual one-hour episode at 10 p.m. Executive producer and creator Nick Santora once opined, \"Our DVR+7 day numbers are really strong. A lot of people are watching the show; a lot of them just don't watch it on the night it premieres.\"\nOn May 17, 2012, A&E canceled Breakout Kings after two seasons, with co-creator Matt Olmstead choosing to move on to another series.\nSeries overview\n{| class=\"wikitable\"\n|-\n! colspan=2 rowspan=2|Season\n! rowspan=2|Episodes\n! colspan=2|Originally aired\n|-\n! Season premiere\n! Season finale\n|-\n|bgcolor=\"#FF6314\"|\n|align=center| 1\n|align=center| 13\n|align=center| March 6, 2011\n|align=center| May 30, 2011\n|-\n|bgcolor=\"#006556\"|\n|align=center| 2\n|align=center| 10\n|align=center| March 4, 2012\n|align=center| April 29, 2012\n|}\nEpisodes\nSeason 1 (2011)\n|OriginalAirDate =\n|ProdCode        = 1WAF79\n|ShortSummary    = When convicted murderer August Tillman (Jason Cerbone) escapes from prison, U.S. Marshal Charlie Duchamp (Laz Alonso) enlists the help of former U.S. Marshal Ray Zancanelli (Domenick Lombardozzi) to help recapture Tillman. They take an unorthodox approach to fugitive apprehension by forming a special task force composed of the four most elusive fugitives Ray has ever captured. Convicts Fritz Gunderson (Brock Johnson), Shea Daniels (Malcolm Goodwin), Dr. Lloyd Lowery (Jimmi Simpson), and Philomena Rotchliffer (Nicole Steinwedell) agree to assist in the case in exchange for time off their sentences. Julianne Simms (Brooke Nevin) also joins the team as an analyst. Tillman, who conducted a bank robbery prior to his conviction, begins to hunt down the members involved in the robbery in an effort to get the money. Gunderson attempts to make an escape by stealing a knife and is sent back to prison. The team suspects an inside job at the bank and are correct in identifying a teller. His daughter is taken hostage until Tillman gets his money. However the team stops him at the Canada/U.S. border, preventing any harm to the teller and his daughter.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF11\n|ShortSummary    = Philly's failure to inform the authorities that she had over a million dollars in a bank account gets her sent back to Muncy Correctional Facility. Taking her place is Erica Reed (Serinda Swan), but Charlie will not tell the others why she was chosen to be on the team. While investigating, Lloyd hits a nerve with Erica by realizing that she had lost custody of her daughter due to her incarceration, and she attacks him and is kept off of the investigation. The team tracks Xavier Price (Jamie McShane), a man convicted of reckless homicide. Two leads send the team to two abandoned properties. The first has recently burnt down and in the second they find a woman who has been kept there for months. Price has been collecting women and has murdered the first and was unable to reach the second. The team, in a race against time manages to track down Price and the final woman. Price cornered attempts to kill himself in a house fire but is rescued by Ray. Later, Charlie reveals to Ray that Erica is the daughter of a bounty hunter who taught her everything, and when he was tortured and murdered by gang members he helped bring in, she hunted them down and hid the bodies so efficiently that she could only be convicted of weapons charges. Ray, feeling sorry for how he treated her earlier, gives her a photo of her daughter that was contained in her file, and reinstates her place on the team.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF08\n|ShortSummary    = Theodore \"T-Bag\" Bagwell (Robert Knepper) uses the opportunity while being transferred for a new prosthetic to escape. Bagwell makes it to Indiana, killing one man with multiple stabs wounds in a slow drawn out death, and killing another at a quarry with the use of a rock crusher. The team finds out that the two men were accused of inappropriate contact with a patient suffering from dementia and cancer, as well as stealing her jewelry during their employment at a nursing home. The patient was Bagwell's mother and the murders were in retaliation for their misdeeds. Bagwell travels to the hospital to see his mother before she dies; where he is caught but allowed to see his mother before being sent back to prison. This episode serves as a crossover with Prison Break, which Olmstead and Santora worked on previously.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF03\n|ShortSummary    = Joseph Ramsey (Derek Phillips), a convicted child sex offender, escapes and is seemingly out to exact revenge on Tess Samuels (Jennifer Ross), his first victim who had accused him of abuse. Ramsey's attempt to make contact with Tess fails and he narrowly escapes in the process. A credit card transaction leads them team to believe Ramsey is fleeing to Canada. Lloyd is forced to stay behind because of an injury sustained during the chase and Julianne is left to supervise him. However Lloyd comes to realize that Ramsey was a victim of moral panic and the real abuser was Tess's father. Lloyd and Julianne manage to have a talk with Tess, giving her the courage to come forward and clear Ramsey's name.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF02\n|ShortSummary    = Lilah Tompkins (Christina Cole), threatens a guard's son, allowing her to escape. Tompkins is found to be a manipulative narcissist who uses various men to get her what she wants, all of whom believe she loves them. Lloyd cannot predict her actions because of her disorder, but Erica manages to manipulate one of the men to give her Tompkins' cell phone number. However the lead is short lived after the team is too late in stopping Tompkins from taking her son with her. Predicting that Tompkins will continue to abuse her relationships with men they track her down to a trailer park. With her plans unraveling she is now mentally unstable and attempts to kill her son and commit suicide as a last resort but is stopped by Ray. Frank Grillo, who appears in the episode as Agent Stoltz, previously recurred in the first season of Prison Break as Nick Savrinn.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF05\n|ShortSummary    = The upcoming 10-year anniversary of an anti-government extremist's execution, sees Christian Beaumont (Zack Ward) escape and plan a series of attacks, to honor his fallen idol. Using the resources of an extremist group, Beaumont begins his attacks with the bombing of a postal office and hacks the Marshal's network to gain personal information. Charlie's wife is targeted with a parcel bomb but escapes with minor injuries. The team tracks the hacker which leads them to Beaumont's personal bunker. As they enter, Ray steps on a tripwire and Beaumont pins them inside with gunfire. Shea and Erica fend off Beaumont, while Charlie and Lloyd delay the explosion long enough for the team to escape safely. Plans taken from the bunker show that Beaumont is planning to destroy the building of the Fish and Wildlife Service after his mother was fired shortly after his incarceration. Beaumont delivers the van filled with fertilizer to destroy the building but is caught and the bomb is defused.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF06\n|ShortSummary   = Mars O'Connell (Rodney Eastman) escapes prison by using a hostage, Starla Roland (Scout Taylor-Compton), during visiting hours. However it becomes clear that the two are in a relationship and they become a modern-day Bonnie and Clyde. As the couple travel south they kill four people including a police officer. Lloyd believes that Roland will eventually turn on O'Connell as she is the submissive and her conscience will tell her the killings are wrong. As the trail runs cold, Ray visits O'Connell's cellmate who had given him information on how to evade the authorities. O'Connell and Roland have broken away from their M.O. of stealing cars and running and have now settled into a suburb residence taking a family hostage. After the capture of Roland at department store, Lloyd realizes that she is the dominant one and she will not give up the location of O'Connell. Ray devises a trap where he lets Roland take him hostage and leads him back O'Connell. The team tracks Ray's phone and arrives to capture the couple and save the hostages.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF09\n|ShortSummary    = A coupon for a steak dinner prompts a competition between Lloyd, Shea and Erica to see who can perform at their best in the latest case. After Carl McCann (Matthew John Armstrong) poisons an inmate, he and Oliver Day (Jonathan Keltz) escape by substituting themselves for the corpse in the coffin. The two convicts work together to retrieve $100,000 that Day's former cell mate, Kellen Stackhouse (Andrew Jackson), had mentioned having. The team discovers a book coded with messages that McCann and Day had used to communicate, and Lloyd goes to work deciphering the information. After McCann and Day kill two more people, the team tracks them to a small town, where they get into a shootout with Ray and Charlie. McCann and Day both get away after Charlie collapses with a heart problem and is shot in the leg. Julianne gets a location on McCann and Day after Lloyd finishes decoding the book. Day lied to McCann about the money in order to get him to help in the escape; Day's real objective is to find Stackhouse, who sexually abused him in prison, and get revenge. A tense standoff leads to both convicts being captured, after which Erica wins the steak dinner. However, she tears up the coupon, saying that she is a vegetarian and that she only participated to keep Shea and Lloyd from winning.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF04\n|ShortSummary    = Andre Brennan (Richard Burgi), the leader of a ring of international jewelry thieves escapes and plans his biggest job before disappearing for good. Shea has a visit from his girlfriend Vanessa (Tattiawna Jones), but Charlie denies him a conjugal visit. The team look at various women who had visited Brennan while he was incarcerated. Kate Lavin (Josie Davis) convinces the team that she is not associated with Brennan anymore, but her lies are soon revealed and coded communications are found at her residence. These communications lead the team to a hotel where Brennan has murdered one of his colleagues and escapes after being spotted by Ray. Shea suggests bringing in another of Brennan's visitors, Heather Storrow (Helena Mattsson). She denies any involvement with Brennan but Ray, who is unconvinced, plants a tracker on her. Brennan completes his heist and meets with Storrow, who had lied about her involvement. The tracker planted on Storrow gives away their location and both are arrested. Even though Shea took advantage of Julianne to have an intimate encounter with Vanessa, for which Julianne later tells him off, Shea later tells Vanessa that he needs to follow the rules if he ever wants to see her again, before leaving a small diamond from the jewelry store in her hand.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF10\n|ShortSummary    = The Breakout Kings are assigned to track down notorious hitman Virgil Downing (Mark Pellegrino), who has taken one last contract to gain funds before he disappears. The convicts are distracted by their suspicions that Ray is not a U.S. Marshal, and begin to wonder whether their sentences are being reduced. Downing assassinates two people, but the team are unable to find a connection, until Laird Lapinski (Daniel Lucifora) is killed. The team connect the murders to the alleged rape of Genevieve Krause (Marcella Lentz-Pope) whose father Cliff (W. Earl Brown) works at the prison Downing escaped from. Cliff helped Downing escape and used Genevieve's college fund to pay for the assassinations of four men responsible for the alleged rape of Genevieve. When Ray is confronted about his status as a Marshall, he reveals his conviction for stealing money from a crime scene. When pressed about his attitude towards the convicts, Ray points out their crimes, revealing that Lloyd was selling fake prescriptions to college students, one of whom died in an overdose. After the death of two more people, one of which was collateral, there remains one last target. The team manages to save Genevieve's ex-boyfriend before Downing can get to him, and at headquarters Lloyd states his deep regret for the overdose and Charlie reveals his congenital heart defect to the cons.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF07\n|ShortSummary    = Bennett Ballester (Robin Wilcock), a psychiatric patient, kills one of the aides whilst on a field trip and escapes. Ballester is revealed to have murdered a newscaster he was obsessed with and was institutionalized after his attorney managed to show he is mentally unstable. Meanwhile, Charlie is distracted by the suspicions that one of the convicts stole his grandfather's watch. A visit to the psychiatric center yields only one lead: \"Meow Time\". Jules discovers that it refers to children's television host Debbie Myers (Paula Garcés), whom Ballester has already found and abducted to the Adirondacks because he believes she loves him. Erica begins to have flashbacks of one of the murders she committed at the Adirondacks, and worries that they will find one of the bodies. Jules, with the help of Shea, gains access to Ballester's diary, which Lloyd is left behind to decipher whilst the team heads to the Adirondacks. Charlie decides to bring back Fritz Gunderson to help track down Ballester, because of his vast knowledge of the area. However Gunderson is not needed after Erica admits she knows the area as well. The team splits up with Erica going with Ray and Charlie with Shea. After Ray gets pinned in a bear trap, he allows Erica to go on ahead to where she saves Debbie, but Ballester takes her hostage next. Charlie arrives and is forced to kill Bennett, who threatened to kill Erica. Back at the office, Ray finds Charlie's watch in the bathroom, and Charlie remembers taking it off earlier, and he apologizes to the convicts.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF01\n|ShortSummary    = A truck breaks through the wall of Attica Correctional Facility, and five inmates—Ponzi scheme millionaire Ronald Barnes (Jeff Seymour), gang member Chester Rhodes (Avery Kidd Waddell), car thief Carlos Zepeda (Lombardo Boyar), forger Tran Jun (Jeff Ong), and drug smuggler Sandy Clemente (Dean Chekvala)—escape with a prison guard as a hostage. U.S. Marshals Chief Director Richard Wendell (Gregg Henry) approaches Charlie, telling him that he is going to be investigating the task force and decide whether or not anyone should be removed. The team realizes that each of the escapees has a role; Barnes provides the funds, with Rhodes as his bodyguard, Zepeda provides transport, Jun the fake passports, and Clemente the routes out of the country. When they discover the body of the prison guard, they also find an extra set of clothes. Shea is sent undercover to Attica to find the sixth intended escapee, but complications arise as his cover is almost blown. The team captures Zepeda, Jun and Clemente with relative ease, making Lloyd believe they are just decoys. Shea informs Ray he has found the sixth escapee but has no more information and requests extraction. Ray is unable to comply and orders Shea to continue his work. Barnes' returns to his former residence with Rhodes to retrieve several thousand dollars from a hidden compartment. Shea manages to get the sixth escapee to reveal what he knows and finds out the escapees intend to take a boat out of the country. Shea informs Ray of this, and the team track a boat that belongs to one of Barnes' associates. Barnes heads to the wharf by himself after he betrays Rhodes shortly after gaining the keys to the boat. Ray and Charlie arrive at the boat first only to find it empty. Barnes takes Lloyd hostage, but Ray tricks Barnes into trading the boat for the money, and using a flare gun manages to disarm and capture him. At the office, Director Wendell states he wants Ray off the task force, but Charlie puts his own career on the line to keep the team together.\n|LineColor       = FF6314\n}}\n|OriginalAirDate =\n|ProdCode        = 1WAF12\n|ShortSummary    = Convicted drug smuggler Carmen Vega (Lauren Vélez) is allowed to attend the funeral of her eldest son, Sebastian. As she pays her respects, she pulls a gun out of the casket, shoots her guards, and escapes with her younger son Cesar (Manny Montana) and several gang members. Shea tells the others that he used to do \"business\" with Carmen, who is the head of a local drug cartel. Because of this Shea is given control of the case. However shortly after, he receives a call from his girlfriend Vanessa, who is being held hostage by Carmen's men and who will be killed unless Carmen is allowed to escape. As they work the case, Shea uses his contacts to help getting Vanessa freed without telling the others. Carmen, who had ordered her son killed, begins to groom Cesar to be her successor, and kills drug kingpin \"Flow-Flow\" (Brooks Darnell). Shea's contacts go into hiding and with little choice he brings in an informant named \"The Mayor\" (Eugene Clark), revealing the name of Sebastian's father, Jose Rodriguez (Tim Sell). Shea is also forced to reveal to the other convicts that Vanessa has been kidnapped. Upon leaving the office \"The Mayor\" and the U.S. Marshals are killed by Carmen's gang members, making it appear that Shea is a mole as Senior Director Mike Colburn (Derek Webster) takes over the investigation. When Jose Rodriguez has been murdered and Carmen narrowly escapes and Shea is without his phone, they determine that Colburn is the mole. Charlie and Shea confront Colburn, but before he can give them information, Colburn kills himself. Shea leads the task force to Carmen's hideout, from where she is already gone and where they find Cesar, several enforcers, and the body of a nautical supply salesman. They eventually track Carmen down to a dock where a boat is headed for Colombia and find her in a shipping container. Before she is taken away, she calls out to Erica and Lloyd. During her interrogation with Shea, she disowns her son, and Cesar agrees to tell them where Vanessa is being held. Erica debates on running, taking Lloyd with her, but Julianne tells them that the Marshals will protect them and their families, and she does not want to help hunt them down should they run away. At a pizzeria later, Shea and Vanessa are reunited, and Charlie notifies Erica and Lloyd that their families are going to be taken into Witness Protection for a few weeks while the Marshals run risk assessment after Senior Director Colburn's actions. Julianne proposes a toast, and everyone enjoys themselves before the cons head back to Maybelle.\n|LineColor       = FF6314\n}}\n}}\nSeason 2 (2012)\n|OriginalAirDate =\n|ProdCode        = 2WAF01\n|ShortSummary    = A serial killer named Damien Fontleroy (Jason Behr) whom Lloyd helped put away escapes from prison. The program is put in jeopardy when Charlie is offered a promotion by Chief Inspector Craig Renner (Mark Rolston). Damien's former partner, Brent Howson (Nate Mooney) who was interviewed earlier by the team also escaped from prison. Brent meets Damien and tells him that Lloyd is working with the Marshals. They kidnap a girl, Becky as per their M. O. Meanwhile, Charlie tells Ray that Craig wants an answer from him today. Ray tells Charlie to do what's best for him and his family, but Charlie tells Ray that he's decided to turn down the promotion. Ray nods, a hint of a smile on his face. In the process of rescuing Becky and capturing Damien, Charlie gets shot and Damien escapes. Ray, and the rest of the team run up to Charlie, panicked. Lloyd presses his sweater into Charlie's wound. Erica, covering her mouth in shock, stands nearby. Shea kneels next to Charlie, holding his hand. But it's too late. Charlie slips away, leaving his crew standing over him in complete and utter disbelief. After offering his condolences, Craig informs the team that Charlie had two requirements for accepting the promotion, had he done so. The first was that the original taskforce remain intact. The second was for Ray to be reinstated as a Marshal. Craig hands Ray an envelope. Ray pours out the contents and discovers his badge and a letter of reinstatement. Craig tells the cons that they have to head back to Maybelle as the case has been reassigned to another team. The cons and Ray are not happy with this news. After Craig leaves, Ray tells the team that no matter how angry they are, he refuses to dishonor Charlie by going rogue. But he assures them that they will cross paths with Damien again, and when they do, they're taking him down.\n|LineColor       = 006556\n}}\n|OriginalAirDate =\n|ProdCode        = 2WAF02\n|ShortSummary    = Victor Mannion (Channon Roe) and Brody Ardell (James Harvey Ward), two vicious criminals escape prison via a tunnel.  Ray recruits Lloyd to do grief counseling since they refused to speak to a prison counselor at Maybelle. None of the cons are thrilled. The team find themselves cooperating with FBI agents Maruca (Daneen Tyler) and Rooney (Damon Lipari) after learning one of the gang members is actually an undercover agent. When it starts to look like the undercover agent may have been turned, the team discovers that Brody's wife and son have been kidnapped by Victor's men. The team saves them and tracks Victor to an airfield and capture him. Back at the warehouse, Ray asks Lloyd if he talked to everybody. Lloyd says yes, but admits that nobody talked back. Erica accuses him of being pretty critical considering he didn't have to talk to anyone. Lloyd responds that he didn't talk to anyone because no one asked him to. The team takes a moment and realizes it's true. No one thought to ask Lloyd if he wanted to talk. Julianne recovers first, and asks him how he's dealing with Charlie's death. He reveals that he feels guilty. He thinks that, had he done his job properly ten years ago, Damien would be locked up tight and Charlie would still be alive. Shea steps up and tells the team that they shouldn't be mourning Charlie, but celebrating him. Erica has an idea, so she heads down to Pete's office, gets a bottle of booze and some glasses. Back in the bullpen, the Kings lift their glasses as Shea says a few words. \"To Charlie, a good man gone too soon. \" As the cons get back into their uniforms, Ray heads into his new office and opens a drawer. Inside is a picture of Charlie - his academy picture, young with the world at his feet. Ray sets the picture on the desk. He walks outside, grabs the bottle of whisky, and pours another shot. He walks out of the office, leaving the full shot glass next to the photo of Charlie.\n|LineColor       = 006556\n}}\n|OriginalAirDate =\n|ProdCode        = 2WAF03\n|ShortSummary    = Travis Muncey (Nicholas D'Agosto), actor and stool pigeon, escapes from prison. The team captures him only to discover that Travis is the key to capturing Bob Dixon (Dominic Keating), one of the most powerful and violent arms trafficker in the world. Meanwhile, Erica has a no strings attached romantic encounter with neighbor Pete Gillies (Ian Bohen). Things get serious when Julianne is kidnapped by the Malko brothers (Stelio Savante), a local gang, who are involved with Dixon, but the team rescue her and finally capture Bob Dixon. After which at the warehouse, Lloyd follows Julianne to the coffee nook and asks her about someone named Greg Margolis. He admits that, when she was kidnapped and he was working at her computer, he noticed several tabs open in her browser with information about the child killer. Julianne shakes her head. Lloyd realizes she's not ready to discuss it, and backs off. But she returns to the bathroom where Lloyd is rinsing the blood off his face. Julianne opens up and tells that she's falling to pieces and there's nothing she can do it about it. Lloyd tells her that he can help if she lets him. Unsure, Julianne just stands there. Ray, in the next room, yells for Lloyd to hurry it up. Lloyd leaves Julianne alone in the bathroom.\n|LineColor       = 006556\n}}\n|OriginalAirDate =\n|ProdCode        = 2WAF04\n|ShortSummary    = Benny Cruz (Kevin Alejandro), a member of a gang called the Royals escapes from prison. Julianne visits Lloyd at Maybelle and opens up about Gary Margolis. The team after arriving at the warehouse learns that Cruz has lung cancer and has only two or three months to live. Then meet Roberto Menchaca (Roberto Sanchez), Cruz's uncle and a member of the Royals gang. The team later learn that Cruz killed Thomas Kelly, a lawyer and Martin Mitchell, a sex offender. In the meantime at the bullpen, Lloyd quietly tells Julianne that Margolis' parole hearing is coming up and he thinks it'd be good for her to write a letter to the parole board. Not only would it reduce Margolis' chances of getting out, but it'd be therapeutic for her. To Lloyd's surprise, she quickly agrees to do it. From a meeting with Cruz's hospice counselor, the sketches in Cruz's cell which were of Archangel Michael, the captain of God's army, sent to rid the world of darkness and the bible left near the body of Mitchell, Lloyd concludes that Cruz is trying to kill his way into Heaven. The team tries to narrow him down when he comes to kill his uncle. Lloyd tries to speak to him by phone to calm him down, while Ray uses the opportunity and shoots him. Cruz falls to the ground dead. The cons wait for the transpo van back at the office. Lloyd approaches Shea and Erica asking if they thought it was right that Ray killed Cruz, but they walk away, avoiding the conversation entirely - mostly because they aren't too sure themselves. Julianne walks up to Lloyd and hands him a large, sealed manila envelope with her letter to Margolis' parole board inside. Lloyd walks into the Ray's office and hands him the envelope to pass along to the parole board. He confronts Ray about shooting Cruz. He tells him that, when they came on this task force, they were told that their job is to chase and catch, not question and judge. This strikes a nerve with Ray. Lloyd insists that he could have gotten Cruz out alive. Ray tells him that they'll never know and walks out of the office leaving Lloyd alone and, still, a little shocked\n|LineColor       = 006556\n}}\n|OriginalAirDate =\n|ProdCode        = 2WAF05\n|ShortSummary    = Ronnie Marcum (Omari Hardwick), an up-and-coming self-help guru is jailed for violating various provisions of federal labor law. He escapes from prison, with five months remaining of his ten-month sentence, after an inmate Arturo attacks him. In the bullpen, Ray goes through his mail and finds a postcard. His face falls as he reads it. The elevator opens and Lloyd, Erica, and Shea file in. Ray quickly stuffs the postcard in his pocket and begins to brief them on their new runner. Lloyd asks Julianne how she's feeling, since today is Greg Margolis' parole hearing. She forces a weak smile, and nods her head, assuring Lloyd that she's fine, but nervous. The team visit the Marcum Institute in Jamaica, Queens where Lena, the office manager does not cooperate after Lloyd yells that the whole program is nothing more than a pyramid scheme after he watches a video loop in the TV where one of Ronnie's students talks about how his life turned around thanks to the program. Ken Reily (Michael Reilly Burke), the man from the video loop at the Marcum Institute encounters Ronnie walking towards him and asks for a ride. Erica and Lloyd learn from Arturo that Ronnie was attacked since he talked ill about his daughter and realize that Ronnie wanted to get hit. The team later learn that Mo Blakely, one of Ronnie's previous employees was murdered by Ronnie. At the crime scene, they learn he was searching for something. Lloyd trains Shea to disguise as one of Ronnie's employees to get information from Ronnie's accountant. In the meantime, neighbor Pete comes to meet Erica. Ray yells at her to keep her prison blues off the floor. Pete stands there, stunned as Erica lies and tells him that she was in prison for mortgage fraud. Pete replies that half of the people he does business with should be in prison, so he understands. Benjamin Funger, Ronnie's accountant tells Shea that Ronnie fired, two more employees Curtis Ridgeway and Gerald Pike along with Mo Blakely. The team learn that Ronnie with the help of Ken Reily has killed Gerald Pike and kidnapped Naomi, Curtis Ridgeway's niece to blackmail him. At the office, the phone rings and Ray answers and then tells Lloyd and Erica that Gary Margolis' parole was denied, and, based on how he performed at the hearing, he isn't ever getting out. For a moment, Julianne and Lloyd high-five each other, and after that they get a hit on Curtis' phone. Using which, they locate the place but find Naomi alive but Curtis and Ken murdered. Julianne flips through Ken's camera, looking at the hundreds of photos he had of his kids. Ray, nearly defeated, tells the team that it was like they were chasing a ghost. Lloyd pauses with a massive realization. Ronnie was a ghost on purpose! He left behind no fingerprints, and even went so far as to kidnap Ken so no one would see him driving. Why? Because he's breaking back in. Julianne perks up, telling the team that she might have found something. The team rushes through the prison hallway to the mailroom. They turn a corner and burst into the room to find Ronnie, working at his mail station. Ronnie apologizes to the warden, telling him that he was hiding out because he was afraid Arturo would attack him again. Ray approaches Ronnie with a cell phone. He holds it up and plays back the incriminating evidence Ronnie was trying to get rid of. In the video, a 17-year-old Ronnie brags about how he killed another kid, Chris Lodi. Ronnie is shocked and confused. Ray explains that when Ronnie chased after Naomi, Ken made a copy of the tape on his phone. Ray handcuffs the con and arrests him. Back at the office, Ray, hanging up the phone, tells the team that since they didn't actually pin Ronnie for breaking out of the prison, they can't get their months off. The cons, not happy with this news, take it a little easier when Ray tells them to put their civies back on because they have the night off and don't have to go back to Maybelle until the next morning. Lloyd tells Julianne they're going to celebrate. At the bar, she thanks him for caring so much, leans in, kisses him on the lips, and walks off to the bar. Lloyd is speechless, dumbfounded, gobsmacked. A small smile crosses his face. Meanwhile, Shea peruses the business section of a library. He self-consciously plucks a couple of basic business and marketing books from the shelf. In Pete's office, Erica and Pete are having a little post-romantic dinner make-out session. Ray, back in his office, pours himself a glass of whisky, and pulls out the postcard he was looking at before. On the back, it reads: \"MISS YOU. LOVE, DAMIEN. \" Ray lays the postcard on top of his office table, which is covered with photos and documents related to Damien. It's Ray's war room. He has not given up on finding the man who killed Charlie.\n|LineColor       = 006556\n}}\n|OriginalAirDate =\n|ProdCode        = 2WAF06\n|ShortSummary    = A female prison volunteer Claire Lyons (Ever Carradine) is attacked by a rough female inmate Emmy Sharp (Camille Guaty). On the way to the court hearing that is a result of that attack, the inmate takes ill at a very precise time. The transport is forced to turn into a rest stop, where the inmate escapes. When the inmate shows up at the home of the volunteer and kills her husband it appears tragic, until it's learned the volunteer and inmate had been working together. The team are in hot pursuit of this \"Thelma and Louise-like\" duo as they make a run for it. In the meantime, Lloyd gets a postcard from Damien Fontleroy (Jason Behr) who was responsible for the death of Charlie Duchamp. While Lloyd cracks the code from the postcards, the rest of the team search for Emmy & Claire. They encounter the body of Claire at a hotel, finding out that Emmy is trying to escape with another partner. They are caught. The latest kidnapped victim of Damien is also rescued alive. Finally, the Lloyd and the team realize since Damien's teammate Brent who acts as his audience is dead, Damien has made Lloyd as his new audience. Not satisfied with the other team's efforts, the Breakout Kings begin to work again on finding Damien.\n|LineColor       = 006556\n}}\n|OriginalAirDate =\n|ProdCode        = 2WAF07\n|ShortSummary    = An inmate Rodney Cain (Josh Zuckerman) escapes from prison to see his college sweetheart Lorraine Hamilton (Ellen Woglom). Rodney was convicted for the murder of Lorraine's stepfather. He escapes due to the letters he received from Lorraine while in prison. Lloyd on advice from Shea ignores Julianne to take his relationship with her to the next step. After meeting Lorraine, Rodney realizes that it was all written by her mom Candice Hamilton (Jessica Tuck). Rodney also learns that she made him kill the stepfather by lying that he molested Lorraine. The team tracks and in the process learns about this too. Then they find Candice's body who was actually killed by Lorraine herself by accident. Finally the team captures him. Lloyd, realizing Shea's advice was a disaster, follows Julianne into the coffee nook. After a surprisingly eloquent, yet thoroughly Lloyd-like explanation, he declares his love for her, but tells her that his admission does not require a response. Instead, he leaves her with the option of placing a pencil on his desk if she feels even the slightest bit the same about him. Lloyd, back at his desk, waits anxiously to see what Julianne will do. He gets up, but before he can head to the bathroom to change, Julianne emerges from the coffee nook and walks up to his desk. She places a pen in front of him and walks away. Lloyd stares at the pen in disbelief wondering what it means. Is it a sign? Does she love him? He sits back down, examining the pen, totally confused, but hopeful.\n|LineColor       = 006556\n}}\n|OriginalAirDate =\n|ProdCode        = 2WAF08\n|ShortSummary    = Jonah Whitman (Dash Mihok), convicted for 10 years for nearly killing somebody in a bar fight, escapes. Whitman was a former Navy SEAL who worked at Alastor, a paramilitary organization.  Meanwhile, Julianne explains to Lloyd that he's important to her, but only as a friend. This upsets Lloyd. Ray shows Lloyd a new postcard from Damien (Jason Behr).  Whitman kills Chase Lansing, an employee of Alastor and takes away his head, which he uses to gain access to Alastor in order to access their computer files while Erica, Shea, and Ray are there interviewing Alastor's Executive Director, Kendra Park (Kelly Hu), and the Chief of Security, Richard Drake.  Meanwhile, Pete Gillies (Ian Bohen), the neighbor, asks Erica if she could track down his cousin, Tommy Fitzgerald.  She tells him that cons aren't allowed to access the Marshals' database; however, later, Erica returns and explains to him that it means a lot to her that he trusts her, and hands him a piece of paper with Tommy Fitzgerald's address on it. Lloyd tries his best to stay focused on the postcard in spite of his feelings for Julianne. He traces the clues from the postcard to a book at the NYU library, but it proves to be a trap where he is then kidnapped by Damien. Damien forces Lloyd to be the audience for his brutal killing of a NYU girl student he kidnapped. The team finds another ex-SEAL Lawrence (Taylor Kinney) and learns that he, Whitman and two others were sent on a mission to Yemen for Alastor which was supposed to kill insurgents in a house. Afterwards the team learned the insurgents had been innocent people who were going to vote against a proposed gas line. Alastor tried to cover their tracks killing the other two members of the team, when Lawrence found out he faked his own death as protection.  Although, the team finally capture Whitman when he breaks into Director Park's home, he is taken away by the CIA and Alastor officials. Inspector Bergman arrives at the bullpen to report that a search of Tommy Fitzgerald was run from a computer in their office and that Tommy is now in a coma after being severely beaten. Erica goes downstairs to Pete's office and finds that it has been cleared out. Lloyd, who was rescued from the scene of the student's murder, tells Ray that he quits the team.\n|LineColor       = 006556\n}}\n|Viewers            = 1.33\n|OriginalAirDate =\n|ProdCode        = 2WAF09\n|ShortSummary    = A prisoner Max (Michael Filipowich), is a professional escape artist. He agrees to do an interview with a reporter and uses it to escape. Erica and Shea are already at the office when Ray goes to get Lloyd. Lloyd still doesn’t want to go work with the marshals and Ray is trying to convince him to come back. Ray sits him down and calls Lloyd’s mother. Lloyd gives in. Just as they arrive at the office, the NYPD are there asking about Pete Gillies. Erica goes to Pete’s office and Shea follows. She confesses to him and he tells her to clean the mess up. As Lloyd begins to study Max, Damien Fontleroy calls. He ignores it and Ray picks up the phone. This upsets Damien. Max kills a shopkeeper to get a change of clothes and hitches a ride with some guy. Lloyd, Erica, Shea, and Ray head to a carnival held at the same place where the circus Max worked was located to get information on Max. They arrest a clown who tells them who Max’s real parents were. They figure Max is going to kill his father, Tiny Tony. Before they leave, Erica is contacted by Pete and she tells him to disappear. He gives her a number to reach him. When they arrive, they find out that Tony is already dead. Max kills the guy that he was getting a ride from and takes his truck. Julianne finds Max and tells Ray that he is heading somewhere else. Lloyd puts it together and figures out that he is going to kill his half-brother Kurt Peebles (Mark Povinelli). At this moment Damien calls again, and again Ray answers. This angers Damien. The team head to Kurt’s home and find the local police everywhere. They pretty much have alerted Max that they are on to him. Kurt refuses to leave. The local police order porter potty’s and Ray goes to yell at the chief. Erica uses this moment to go to the local payphone and call Pete. He tells her he is going to turn himself in and implicate her as well. Max uses the porter potty’s to get in and kill Kurt. Ray figures that out but is too late. However, since Erica is at the local store instead of with Ray, she spots Max running. She hops into the truck and apprehends him. Upon their arrival at the office, Damien calls the office line. Lloyd has Julianne put it on speaker and he finally talks to him. Damien has taken another girl and drops the hint that he is watching them. They figure out he is on the roof of the building next to theirs. Once they get up there, they find out who he has taken. Damien has taken Ray’s daughter.\n|LineColor       = 006556\n}}\n|Viewers            = 1.33\n|OriginalAirDate =\n|ProdCode        = 2WAF10\n|ShortSummary    = Damien leaves a piece of paper for Lloyd in her I.D. Ray decides to not hand Max over because if he does, his team has to go back to prison. So Erica and Shea hide the convict. This is when she tells Shea about Pete’s plans. Lloyd decodes the message into a phone number. They call Damien and tells them that Lloyd has to follow the treasure hunt to save Ray’s daughter. The first step is to visit the man who Julianne lost her virginity to. She tells them that it was Billy McBride (Gabe Begneaud). Outside his home, Shea stays behind with Max in the car. As Erica is getting out, he lifts her cellphone and sends Pete a text. They go into Billy’s home and find the next clue. This takes them to Marisol Duchamp’s home, Charlie’s widowed wife. Erica takes her out of the home upon Lloyd request. He tells Ray where the next clue is. Ray is forced to dig into Charlie’s urn. They get the next clue and Max tries to escape again. Erica grabs him and they continue to drag him to where ever they go. Once back at the office, Shea sneaks out and meets Pete outside. Pete thought he was meeting Erica. Shea beats Pete up and tells him that he is to confess to everything. If he mentions Erica, he will find out how far his reach is. When he walks back in, he hands Erica her phone back. Julianne continues to try to track Damien but is unable to. Lloyd decodes the clue and is forced to go to its location. He is brought face to face with the parents of the young girl he had killed by accident. Ray gets a letter from them with the next location. They arrive at a trash dump and find a bag waiting for them. When they open it they find a hankie inside. Damien calls them and tells them that it is to wipe the prints off the gun that Lloyd is to use to kill Max. At the office, Ray is losing it. Lloyd pulls him aside and tells him that this whole game is about driving him crazy. Damien wants Lloyd to break down and land up in a straitjacket. Lloyd agrees to kill Max. They receive the call from Damien telling them where to kill Max. Ray and Lloyd head out with Max as the NYPD show up. They tell the others that Pete confessed to doing everything himself. Lloyd gets to the location and points the gun at Max. Damien calls him and starts to taunt him. Ray tells Julianne that Damien is watching from one of the nearby buildings and there is only five. She starts setting off fire alarms one by one. When they hear it through the phone just as Damien is about to hang up, they know what building he is in. Erica and Shea get there and start the chase. Shea chases him up to the roof. Ray and Lloyd catch Damien up there. Ray gets the location of his daughter by hanging Damien off the roof: she's on the roof of the Kings building and Julianne rescues her alive and unharmed. As Shea is about to cuff Damien, he tells Ray that he still has a little bit of Charlie stuck in his fingernails. Ray, in anger, pushes him off the roof to his death. Ray takes off as U.S. Marshals Chief Director Richard Wendell shows up. Ray goes to his daughter to bring her home and returns Charlie's shield to his widow. Wendell brings the team back to the office where they turn over Max, claiming that his story about what they did to him was a drug-induced hallucination. Wendell pulls all three into the interrogation room at the same time. He tells them that they will all be released with time served if they just tell the truth about what happened on the roof. He just wants Ray.\n|LineColor       = 006556\n}}\n}}\nReferences\nExternal links\n* [http://www.aetv.com/breakout-kings/episode-breakdowns/an-unjust-death/ Breakout Kings Episodes] at A&E official website\n*\n* List of [http://thetvdb.com/?tab=seasonall&id=219341&lid=7 Breakout Kings Episodes] at [http://thetvdb.com/ TVDB.com]"
    }
  ]
}