{
  "content": [
    {
      "type": "text",
      "text": "# List of MPs elected in the 1832 United Kingdom general election\n\n}}\nThis is a list of the 658 Members of Parliament (MPs) elected to the House of Commons of the 11th Parliament of the United Kingdom at the 1832 general election, held over several days from 8&nbsp;December 1832 to 8&nbsp;January 1833.\nA total of 401 constituencies returned members. 153 constituencies returned one member each; 240 constituencies returned two members each; 7 constituencies returned 3 members each; and one constituency returned 4 members.\nBackground\n, architect of the Reform Act 1832 was elected in 1832 as MP for Devonshire Southern]]\n1832 was the first general election in the United Kingdom of Great Britain and Ireland after the Representation of the People Act 1832 (commonly known as the \"Reform Act 1832\" or the \"Great Reform Act\") had introduced wide-ranging changes to the electoral system. The Act disenfranchised many small towns (some of which were known as rotten boroughs), reduced the number of MPs elected by some of the remaining boroughs, and created 65 new seats for the counties and 65 new seats for parliamentary boroughs.\nThe Act also increased the number of individuals entitled to vote, allowing a total of one out of six adult males to vote, but included the first statutory bar to women voting. The franchise was subsequently extended in several steps over the next century, culminating in the Representation of the People (Equal Franchise) Act 1928, which allowed all adult men and women to vote.\nNot all constituencies voted. Where the number of candidates did not exceed the number of seats, members were returned unopposed; this was the case for 189 of the 658 members returned.\nExplanatory notes\nScope\nThe list of MPs records those MPs listed in the London Gazette as having been \"returned to serve in the new Parliament\". It does not include those subsequently elected in by-elections.\nWhere the election of an MP was subsequently overturned as a result of an election petition, the relevant entry in the list is shown in italics, and a footnote added to explain the circumstances. For a list of results which were overturned, see below: overturned elections.\nParties\nThe party labels for MPs in this period should be treated with caution.\nThe source for party affiliation of MPs for constituencies in England, Scotland and Wales is F. W. S. Craig's British Parliamentary election results 1832–1885. Craig does not distinguish between Liberals, Radicals and Whigs, labeling them all as \"Liberal\".  Similarly, Craig does not distinguish between those who described themselves as Conservatives and those described as Tory, labeling them all as \"Conservative\". That convention has been followed in this list, with one variation: the label \"Tory\" has been used for Conservatives and Tories, because the term \"Conservative\" was not officially adopted by the party until 1834. Craig's volume covers only two years before that date, and 51 years after it, so \"Conservative\" is the more appropriate term for the period as a whole; but for 1832, it is an anachronism.\nCraig warns that party affiliations in the period were fluid and cannot always be accurately assessed, and that some candidates could have been equally well described as either \"Liberal\" or \"Conservative\".\nWalker's Parliamentary election results in Ireland, 1801–1922 is the source for the party affiliations of the MPs for constituencies in Ireland. Walker also uses the labels \"Liberal\" and \"Conservative\", but warns that they are an \"over-simplification\", noting that until 1868 neither term was used consistently by contemporaries.\n(Dublin University) was one of six MPs elected for university constituencies]]\nA number of Irish MPs have been labelled as \"Repeal\", referring to the Repeal Association. Walker assigned this label to MPs who \"signed the repeal pledge, advocated it at this election, or supported repeal measures in the ensuing parliament\".\nTypes of constituency\nThere were three types of constituency, each with different arrangements for the franchise:\n*Counties, which covered the whole of a county. In some cases they were divided into two or more divisions\n*University constituencies, which had no geographical basis. Their electorate comprised the graduates of the university\n*Parliamentary boroughs, known in Scotland as burghs, which comprised a town and in some cases some areas outside the town boundaries.\n**Districts of burghs (in Scotland) and districts of boroughs (in Wales) were a type of borough constituency in which several boroughs jointly elected one Member of Parliament. The areas were not geographically contiguous, and in some cases the boroughs were in different counties\nList of MPs elected\n{| class=\"wikitable\"\n!colspan=\"2\"|Parties\n|-\n|style=\"background: \" |\n| Liberal Party\n|-\n|style=\"background: \" |\n| Tory\n|-\n|style=\"background: \" |\n| Repeal\n|}\nEdit by initial letter of constituencies: A–B •\nC •\nD–E •\nF–I •\nJ–L •\nM–N •\nO–R •\nS–T •\nU–Z\n|}\nOverturned elections\n, whose election in Hertford was later declared void]]\nThe list of MPs records those MPs listed in the London Gazette as having been \"returned to serve in the new Parliament\". Where the election of an MP was subsequently overturned as a result of an election petition, the relevant entry in the list is shown in italics, and a footnote added to explain the circumstances. A total of 16 MPs in 14 constituencies were unseated, although one (Sir Charles Paget) was subsequently reinstated.\nVoided elections\nThe 1832 elections were declared void as a result of a petition for a total of 7 MPs in six constituencies:\n{|class=\"wikitable\"\n|-\n!Constituency !! Country !! County !! Seats voided !! Reason for voiding\n|-\n|Carrickfergus || Ireland || Antrim || align=\"center\" | 1 of 1 || Bribery and/or corrupt practices. Writ suspended\n|-\n|Hertford || England || Hertfordshire || align=\"center\" | 2 of 2 || Bribery and/or corrupt practices. Writ suspended\n|-\n|Montgomery Boroughs || Wales || Montgomeryshire || align=\"center\" | 1 of 1 ||Bribery and/or corrupt practices. Writ suspended\n|-\n|Oxford || England || Oxfordshire || align=\"center\" | 1 of 2 || Bribery and/or corrupt practices. Writ suspended\n|-\n|Tiverton || England || Devon || align=\"center\" | 1 of 2 || Candidate lacked property qualification to be elected\n|-\n|Warwick || England || Warwickshire || align=\"center\" | 1 of 2 || Bribery and/or corrupt practices. Writ suspended\n|}\nUndue elections\n, whose election in Caernarvon Boroughs was overturned. He was reinstated after a further petition]]\nIn 8 constituencies, a petition led to a recount and another candidate was declared elected without a further ballot being held. Nine seats changed hands in this way:\n{|class=\"wikitable\"\n|-\n!Constituency !! Country !! County !! Seats overturned\n|-\n| Caernarvon Boroughs || Wales || Caernarfonshire || align=\"center\" | 1 of 1\n|-\n| Coleraine || Ireland || County Londonderry || align=\"center\" | 1 of 1\n|-\n| Galway Borough || Ireland || County Galway ||  align=\"center\" | 1 of 2\n|-\n| Longford || Ireland || County Longford ||  align=\"center\" | 2 of 2\n|-\n| Mallow || Ireland || County Cork ||  align=\"center\" | 1 of 1\n|-\n| Petersfield || England || Hampshire ||  align=\"center\" | 1 of 1\n|-\n| Salisbury || England || Wiltshire ||  align=\"center\" | 1 of 1\n|-\n| Southampton || England || Hampshire ||  align=\"center\" | 1 of 1\n|}\nNotes and references\n*\nSee also==\n*1832 United Kingdom general election\n*List of parliaments of the United Kingdom\n*List of United Kingdom Parliament constituencies (1832–1868)"
    }
  ]
}