{
  "content": [
    {
      "type": "text",
      "text": "# List of aircraft at the Imperial War Museum Duxford\n\nThis list of aircraft at the Imperial War Museum Duxford summarises the collection of aircraft that is housed at the Imperial War Museum Duxford in Cambridgeshire, England.\nAirSpace Hangar\nAircraft on display that are the property or on loan to the Imperial War Museum or the Duxford Aviation Society:\n{| class=\"wikitable\"\n!Type\n!Image\n!Identity\n!Markings/notes\n|-\n|Airco DH.9\n|\n|D5649\n|Royal Air Force/Royal Flying Corps\n|-\n|Airspeed Oxford I\n|\n|V3388\n|Royal Air Force\n|-\n|Avro Anson I\n|\n|N4877\n|Royal Air Force – No. 500 Squadron markings, coded MK-V\n|-\n|Avro Canada CF-100 Canuck\n|\n|18393\n|Royal Canadian Air Force\n|-\n|Avro Lancaster X\n|\n|KB889\n|Royal Canadian Air Force – No. 428 Squadron, coded NA-I\n|-\n|Avro Vulcan B.2\n|\n|XJ824\n|Royal Air Force – No. 101 Squadron\n|-\n|BAC TSR.2\n|\n|XR222\n|Royal Air Force\n|-\n|BAC Concorde\n|\n|G-AXDN\n|Former pre-production development aircraft G-AXDN was donated to the society and flown to Duxford in 1977.\n|-\n|de Havilland Mosquito TT.35\n|\n|TA719\n|Royal Air Force\n|-\n|English Electric Canberra B.2\n|\n|WH725\n|Royal Air Force – No. 50 Squadron, on loan from the Royal Air Force Museum\n|-\n|English Electric Lightning F.1\n|\n|XM135\n|Royal Air Force – No. 74 (Fighter) Squadron markings, coded B\n|-\n|Fairey Swordfish\n|\n|NF370\n|Royal Air Force – No. 119 Squadron, coded NH-L\n|-\n|Handley Page Hastings C.1A\n|\n|TG528\n|Royal Air Force – No. 24 Squadron\n|-\n|Handley Page Victor B.1\n|\n|XH648\n|Royal Air Force – No. 57 Squadron\n|-\n|Hawker Siddeley Harrier GR.3\n|\n|XZ133\n|Royal Air Force, coded 10\n|-\n|Miles Magister I\n|\n|G-AFBS\n|In wartime Royal Air Force colour scheme but with civil registration.\n|-\n|Panavia Tornado GR.1\n|\n|ZA465\n|Royal Air Force – No. 12 Squadron, coded FF\n|-\n|Royal Aircraft Factory R.E.8\n|\n|F3556\n|Royal Air Force/Royal Flying Corps\n|-\n|Short Sunderland MR.5\n|\n|ML796\n|Royal Air Force, it is a former French Navy aircraft\n|-\n|Supermarine Spitfire F.24\n|\n|VN485\n|Royal Air Force\n|-\n|Westland Lysander\n|\n|V9673\n|Royal Air Force – No. 161 Squadron markings, coded MA-J, a former Royal Canadian Air Force aircraft.\n|-\n|Westland Wessex HAS.1\n|\n|XS863\n|Fleet Air Arm – 815 NAS,  coded 304/R\n|-\n|Westland Whirlwind HAS.7\n|\n|XK936\n|Fleet Air Arm\n|-\n|}\nAir and Sea\n{| class=\"wikitable\"\n!Type\n!Image\n!Identity\n!Markings/notes\n|-\n|Airco DH.9\n|\n|E8894\n|CAA Reg-G-CDLI Operator-Historic Aircraft Collection Ltd\n|-\n|BAC Strikemaster\n|\n|1133\n|Royal Saudi Air Force\n|-\n|Bristol Blenheim IF\n|\n|L6739\n|YP-Q CAA Reg-G-BPIV Operator-Aircraft Restoration Company Ltd\n|-\n|de Havilland Sea Vixen FAW.2\n|\n|XS576\n|Fleet Air Arm – 899 NAS, coded 125\n|-\n|Fairey Gannet ECM.6\n|\n|XG797\n|Fleet Air Arm – 831 NAS markings, coded 277\n|-\n|Fairey Firefly TT.I\n|\n|Z2033\n|275-N/Evelyn Tensions\n|-\n|Hawker Fury I\n|\n|K5674\n|CAA Reg-G-CBZP Operator-Historic Aircraft Collection Ltd\n|-\n|Hawker Sea Fury FB.11\n|\n|SR661\n|(P) Operator-Fighter Aviation Engineering Ltd\n|-\n|Hawker Nimrod II\n|\n|K3661\n|562 CAA Reg-G-BURZ Operator-Historic Aircraft Collection Ltd\n|-\n|Hawker Hurricane I\n|\n|P2902\n|DX-R CAA Reg-G-ROBT Operator-Fighter Aviation Engineering Ltd\n|-\n|Hawker Hurricane XII\n|\n|R4118\n|UP-W CAA Reg-G-HUPW Owner-Hurricane Heritage Ltd Operator-Aircraft Restoration Company Ltd\n|-\n|Hawker Hurricane TR.2B\n|\n|BE505\n|XP-L Pegs CAA Reg-G-HHII Owner-Hurriback Operator-Aircraft Restoration Company Ltd\n|-\n|Hawker Hurricane I\n|\n|5547/P3935/P2954\n|WX-D/WX-E CAA Reg-G-HURI Operator-Historic Aircraft Collection Ltd\n|-\n|Hawker Sea Hawk FB.5\n|\n|WM969\n|Fleet Air Arm\n|-\n|Hawker Tempest II\n|\n|MW763/PR533\n|5R-V CAA Reg-G-TEMT Operator-Fighter Aviation Engineering Ltd\n|-\n|Hawker Siddeley Buccaneer S.2B\n|\n|XV865\n|Royal Air Force – No. 208 Squadron\n|-\n|Lockheed 12A Electra Junior\n|\n|\n|CAA Reg-G-AFTL Operator-Fighter Aviation Engineering Ltd\n|-\n|North American P-51D Mustang\n|\n|413521\n|5Q-B/Marinell CAA Reg-G-MRLL Owned-Marinell Ltd Operator-Aircraft Restoration Company Ltd\n|-\n|North American P-51D Mustang\n|\n|472216\n|HO/M/Miss Helen CAA Reg-G-BIXL Owned-Robert Tyrrell Operator-Aircraft Restoration Company Ltd\n|-\n|CAC CA-18 Mustang 22\n|\n|415152\n|QI-T/Jersey Jerk CAA Reg-G-JERK Operator-Fighter Aviation Engineering Ltd\n|-\n|Percival Proctor III\n|\n|LZ766\n|G-ALCK Royal Air Force\n|-\n|Republic P-47D Thunderbolt\n|\n|549192\n|F4-J/Nellie B CAA Reg-G-THUN Operator-Fighter Aviation Engineering Ltd\n|-\n|Supermarine Spitfire VB\n|\n|BM597\n|JH-C CAA Reg-G-MKVB Owned-Aerial Speed Icons Ltd Operator-Aircraft Restoration Company\n|-\n|Supermarine Spitfire VC\n|\n|EE602\n|DV-V/Central Railways Uruguayan Staff CAA Reg-G-IBSY Operator-Fighter Aviation Engineering Ltd\n|-\n|Supermarine Spitfire LF.IXB\n|\n|MH434\n|ZD-B Mylcraine CAA Reg-G-ASJV Owned-Merlin Aviation Ltd Operated-Aircraft Restoration Company Ltd\n|-\n|Supermarine Spitfire HF.VIIIC\n|\n|MV154|MT928\n|ZX-M CAA Reg-G-BKMI Owned-Max-Alpha Aviation GMBH Operator-Aircraft Restoration Company Ltd\n|-\n|Supermarine Spitfire FR.XIVE\n|\n|MV293\n|Z CAA Reg-G-SPIT Operator-Fighter Aviation Engineering Ltd\n|-\n|Supermarine Spitfire LF.XVIE\n|\n|RN201\n|CAA Reg-G-BSKP Owned-Aerial Speed Icons Ltd Operator-Aircraft Restoration Company\n|-\n|Supermarine Spitfire LF.XVIE\n|\n|RW382\n|WZ-RR CAA Reg-G-PBIX Operator-The Suffolk Spitfire\n|-\n|Westland Sea King HAS.6\n|\n|XV712\n|Fleet Air Arm\n|-\n|Westland Wasp HAS.1\n|\n|XS567\n|Fleet Air Arm, coded 434\n|-\n|}\nBattle of Britain\nImperial War Museum Battle Of Britain Collection.\n{| class=\"wikitable\"\n!Type\n!Image\n!Identity\n!Markings/notes\n|-\n|Avro 671 Rota I\n|\n|HM580\n|KX-K\n|-\n|Bristol F.2B Fighter\n|\n|E2581\n|Royal Air Force/Royal Flying Corps – No. 39 Squadron, coded 13\n|-\n|de Havilland Vampire T.11\n|\n|WZ590\n|Royal Air Force – No. 5 FTS, coded 49\n|-\n|Gloster Meteor F.8\n|\n|WK991\n|Royal Air Force – No. 56 (Fighter) Squadron\n|-\n|Gloster Javelin FAW.9\n|\n|XH897\n|Aeroplane & Armament Experimental Establishment markings\n|-\n|Hawker Hurricane I\n|\n|V7497\n|SD-X CAA Reg-G-HRLI Owned-Hurricane 501 Operations LLP Operated-Aircraft Restoration Company Ltd\n|-\n|Hawker Hurricane IIB\n|\n|Z2315\n|Royal Air Force – No. 111 Squadron markings, coded JU-E, aircraft recovered from Russia\n|-\n|Hawker Hunter F.6A\n|\n|XE627\n|Royal Air Force – No. 65 Squadron markings, on loan from the United States Air Force.\n|-\n|McDonnell Douglas Phantom FGR.2\n|\n|XV474\n|Royal Air Force – No. 74 (Fighter) Squadron, coded T\n|-\n|Messerschmitt Bf 109E-3\n|\n|1190\n|Luftwaffe aircraft that force landed in 1940, presented in the position of the crash.\n|-\n|Mikoyan-Gurevich MiG-21\n|\n|501\n|Hungarian Air Force\n|-\n|Panavia Tornado GR.4\n|\n|ZA469\n|Royal Air Force – Marham Wing, coded 029\n|-\n|Royal Aircraft Factory B.E.2C\n|\n|2699\n|\n|-\n|Supermarine Spitfire IA\n|\n|N3200\n|QV CAA Reg-G-CFGJ Owned-Imperial War Museum Operator-Aircraft Restoration Company Ltd\n|-\n|}\nConservation in Action\nImperial War Museum Restoration Hanger.\n{| class=\"wikitable\"\n!Type\n!Image\n!Identity\n!Markings/notes\n|-\n|Avro Shackleton MR.3\n|\n|XF708\n|Royal Air Force – No. 203 Squadron, coded C\n|-\n|de Havilland Tiger Moth\n|\n|N6635\n|Royal Air Force – No. 22 Elementary Flying Training School, coded 25\n|-\n|FMA IA 58 Pucará\n|\n|ZD487 [A-549]\n|Argentine Air Force captured during the Falklands War\n|-\n|Heinkel He 162 A-2 Salamander\n|\n|\n|Yellow 6\n|-\n|SEPECAT Jaguar GR.1A\n|\n|XX108\n|Royal Air Force\n|-\n|}\nAmerican Air Museum\nAircraft owned or on loan to the Imperial War Museum and displayed in the American Air Museum:\n{| class=\"wikitable\"\n!Type\n!Image\n!Identity\n!Markings/notes\n|-\n|Bell UH-1H Huey\n|\n|72-21605\n|United States Army\n|-\n|Boeing B-17G Flying Fortress\n|\n|231983\n|F-BDRS was operated by the French Institut géographique national (National Geographic Institute) before acquisition in 1974 as a spare parts source for the airworthy Sally B. In 1978 it was donated to the Imperial War Museum and displayed as 231983 IY-G of the 401st Bomb Group United States Army Air Forces based at RAF Deenethorpe which was named Mary Alice.\n|-\n|Boeing B-52D Stratofortress\n|\n|56-0689\n|United States Air Force, on display outside since 1983 and moved inside the American Air Museum in 1997.\n|-\n|Boeing B-29A Superfortress\n|\n|44-61748\n|A former United States Air Force B-29A, it was recovered from the China Lake range in 1979, restored to flying condition as G-BHDK and flown across the Atlantic to Duxford, arriving in March 1980. Painted as 461748 to represent an aircraft of the 501st Bomb Group United States Army Air Forces and named ''It's Hawg Wild. On loan from the United States Navy.\n|-\n|Boeing-Stearman PT-17\n|\n|CF-EQS [25]\n|Painted as 25 of the United States Army it was a static restoration mainly using bits from a former Canadian-owned example CF-EQS.\n|-\n|Consolidated B-24M Liberator\n|\n|44-50493\n|44-51228 was the last B-24 in United States Air Force service, being used for ice research before being retired in 1953. It was placed on display at Lackland Air Force Base. Built by Ford at Willow Run it was donated to the museum by the Ford Motor Company arriving in 1999. Painted as 44-50493 of the 392nd Bombardment Group/578th Bombardment Squadron United States Army Air Force based at RAF Wendling in Norfolk, England, and named Dugan.\n|-\n|Douglas C-47A Skytrain\n|\n|43-15509\n|Painted in the markings it flew in 1944 as an aircraft of the 316th Troop Carrier Group/37th Troop Carrier Squadron based at RAF Cottesmore, Rutland.\n|-\n|Fairchild Republic A-10 Thunderbolt II\n|\n|77-0259\n|A-10A 77-0259 was last flown by the 10th Tactical Fighter Wing and it was flown to Duxford on retirement from the United States Air Force in 1992 from its base at nearby RAF Alconbury. On loan from the United States Air Force.\n|-\n|General Dynamics F-111E\n|\n|67-0120\n|A veteran of Operation Desert Storm, it was based at RAF Upper Heyford with the 20th Fighter Wing of the United States Air Force prior to arriving at Duxford for display in 1993. On loan from the United States Air Force Museum.\n|-\n|Lockheed SR-71A Blackbird\n|\n|61-7962\n|17962 was loaned to the museum in 2001 by the United States Air Force Museum to represent the aircraft based at RAF Mildenhall.\n|-\n|Lockheed U-2C\n|\n|56-6692\n|Operated by the United States Air Force from 1956 until retired and presented to the museum in 1992 to represent the type as flown at nearby RAF Alconbury.\n|-\n|McDonnell Douglas F-4J(UK) Phantom\n|\n|155529\n|ZE359 is a former United States Navy F-4J from 1968 until it was converted to a F-4J(UK) for service with the Royal Air Force from 1984. Flown to Duxford on retirement and restores to original United States Navy markings of VF-74 as 155529.\n|-\n|McDonnell Douglas F-15A Eagle\n|\n|76-0020\n|Flown by the United States Air Force from 1976 to 1994. Allocated to the Imperial War Museum in 2001 and later painted to represent the aircraft when it served with the 5th Fighter Interceptor Squadron. On loan from the United States Air Force Museum.\n|-\n|North American AT-16 Harvard II\n|\n|\n|B-168\n|-\n|North American B-25J Mitchell\n|\n|44-31171\n|Retired from service as a TB-25J trainer with the United States Air Force in 1957 it then had various civil owners before being delivered to Duxford in 1976. Since 1996 it has been displayed as 44-31171'', a PBJ-1J of the United States Marine Corps. It has now been repainted to represent B-25J 43-4064 \"LI'L Critter From the Moon\" of the 488th Bomb Squadron, 340th Bomb Group of the USAAF's Twelfth Air Force in the latter stages of the Second World War.\n|-\n|North American P-51D Mustang\n|\n|411631\n|MX-V Etta Jeanne II\n|-\n|Republic P-47D Thunderbolt\n|\n|226413\n|A composite static rebuild painted to represent an aircraft of the 78th Fighter Group based at Duxford.\n|-\n|SPAD XIII\n|\n|\n|This replica SPAD was built in Germany and flown in the United Kingdom since 1978. It was placed in the Fleet Air Arm museum in 1986 and transferred to Duxford in 1996. Painted as S.4513 to represent an aircraft flown in 1918 by Captain Rickenbacker with the United States Army Air Service in France.\n|-\n|}\nDuxford Aviation Society Apron\nAircraft owned or on loan to the Duxford Aviation Society:\n{| class=\"wikitable\"\n!Type\n!Image\n!Identity\n!Markings/notes\n|-\n|Airspeed Ambassador 2\n|\n|G-ALZO\n|The only surviving Ambassador; operated by British European Airways (BEA) from 1952 to 1958, it was then used by the Royal Jordanian Air Force as a VIP aircraft. It was bought by Dan-Air in 1963 and operated until 1971 when it went on display at Lasham Airfield. Donated to the Duxford Aviation Society in 1986 and moved to Duxford still painted in Dan-Air markings.\n|-\n|Avro York\n|\n|G-ANTK\n|In the markings of Dan-Air, its last operator. Originally operated by the Royal Air Force from 1946, it was used on the Berlin Airlift. Sold to Dan-Air in 1954 which flew it until 1964. After retirement it was on display at Lasham Airfield until it was transferred to the Duxford Aviation Society and moved to Duxford in 1986 for a 20-year restoration programme.\n|-\n|BAC One Eleven 500\n|\n|G-AVMU\n|Operated by BEA from 1969 until British Overseas Airways Corporation (BOAC) and BEA merged to form British Airways in 1972. After retirement by British Airways it was donated to the society and flown to Duxford in 1993. Displayed in the British Airways Landor Associates livery and named County of Dorset.\n|-\n|BAC Super VC10\n|\n|G-ASGC\n|Former BOAC and British Airways aircraft, painted in BOAC-Cunard markings which it wore when it was operated by the 1960s' joint venture between BOAC and Cunard Line. Donated and flown to Duxford in 1980.\n|-\n|British Aerospace 146 CC2\n|\n|ZE701\n|Formerly of No. 32 Squadron RAF. Donated by the Royal Air Force on 21 January 2022, ZE701 replaced Handley Page Dart Herald G-APWJ's placement on the apron after a brief period of restoration work.\n|-\n|Bristol Britannia 312\n|\n|G-AOVT\n|Had been operated by BOAC and British Eagle but retains the colours of the last operator Monarch Airlines. Donated to the society by Monarch Airlines and flown to Duxford in 1975.\n|-\n|Britten-Norman BN-2A-III Trislander\n|\n|G-BEVT\n|Formerly of Aurigny Air Services, operated short-haul flights in and around the British Isles. Obtained by the museum in 2017\n|-\n|de Havilland Dove\n|\n|G-ALFU\n|Used as a navaid calibration aircraft with the Civil Aviation Flying Unit (CAFU) from 1948 until 1972. Donated to the IWM in 1973 and moved to Duxford, transferred to the society in 1984; it is displayed in CAFU markings.\n|-\n|de Havilland Comet\n|\n|G-APDB\n|Former Dan-Air aircraft; painted in the markings of its first operator BOAC, which operated it from 1958. Donated by Dan-Air in 1974 and flown to Duxford.\n|-\n|Hawker Siddeley Trident 2E\n|\n|G-AVFB\n|Painted in British European Airways markings to represent the first operator of the aircraft between 1968 and 1972. Used by Cyprus Airways until it suffered damage during the Turkish invasion of Cyprus and was abandoned at Nicosia airport. It was recovered by British Airways and repaired; and continued in service until 1982, when it was donated to the society and flown to Duxford.\n|-\n|Vickers Viscount 701\n|\n|G-ALWF\n|Painted to represent a Viscount of British European Airways with the original name Sir John Franklin. Whiskey Foxtrot was the second production aircraft and was delivered to British European Airways in 1953. The last operator was Cambrian Airways. She was retired in 1971 and placed on display at Liverpool Airport with the Viscount Preservation Trust. Transferred to the Duxford Aviation Society and moved to Duxford by road in 1976.\n|-\n|}\nReferences"
    }
  ]
}