{
  "content": [
    {
      "type": "text",
      "text": "# List of battleships of Spain\n\nIn the latter half of the 19th century, the Spanish Navy had built a series of ironclad warships that culminated in the barbette ship Pelayo in the 1880s. Following the destruction of much of the Spanish fleet in the Spanish–American War in 1898, Spain slowly began to rebuild its navy. In the early 20th century, the Spanish Navy built three battleships and planned several more; the three ships that were completed were the vessels of the . These ships were the smallest dreadnought-type battleships ever built. A further three ships of the  were authorized by the Navy Law of 1913, but the outbreak of World War I prevented these ships from being built, as Spain was heavily dependent on Great Britain for material and technical expertise. The three completed battleships all served in the Rif War in North Africa, where the lead ship, España, ran aground and was wrecked.\nFollowing the end of the First World War, occasional plans for the construction of new battleships were proposed, including a small design deriving from Britain's powerful s. However, nothing had come of these efforts by the time of the outbreak of the Spanish Civil War. Following the victory of Francisco Franco's Nationalists in that conflict, in which both of the surviving Spanish battleships—one serving on the side of the Nationalists, the other on that of the Republicans—had been destroyed, proposals for the construction of four fast battleships to an Italian design, as well as the construction of \"large cruisers\"—the only battlecruiser designs proposed for or by Spain—were made. However, the outbreak of the Second World War resulted in these plans being disrupted.\nEspaña class\nAuthorized under the Navy Law of 1908 and assigned to the Primera Escuadra (First Squadron), the España class were the first and only Spanish dreadnoughts, and also the smallest of that type of ship ever to be built. Considered by some to be more \"Dreadnought-type coast-defense ships\" than pure battleships, the three ships of the class were built in Ferrol by Sociedad Española de Construcción Naval (SECN), the lead ship being completed in under four years, but the onset of World War I resulted in delays to the remaining two ships, and especially the third, as equipment and armament deliveries from England were disrupted due to the war.\nObsolete before completion due to the rapid progress of naval technology, the Españas saw combat service in the Rif Wars and the Spanish Civil War, España being wrecked on the Moroccan coast in 1923, Alfonso XIII being renamed España following the establishment of the Second Spanish Republic in 1931. In the mid-1930s, it was proposed that the two surviving ships of the class be rebuilt as \"pocket battleships\", including a lengthening of the hull and rearranging of the turrets to a centerline alignment. By 1936, a more modest rebuild was proposed, including conversion to oil firing, but the outbreak of the Spanish Civil War put this plan to rest.\nThe remaining two ships of the class, one operating on each side, were both lost in the Spanish Civil War. España (ex-Alfonso XIII), serving the Nationalist side, struck a mine in April 1937 and sunk, while Jaime I fighting as part of the Republican navy, suffered an internal explosion at Cartagena in June 1937, being scuttled as a precautionary measure afterwards. The wreck was raised the following year before being scrapped in 1939.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the España class\n|- valign=\"top\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Armor\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"2\" | Service\n!\n|- valign=\"top\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n| align= left |\n| rowspan=\"3\" | 8 ×\n| rowspan=\"3\" |\n| rowspan=\"3\" |\n| rowspan=\"3\" | 4 screws, Parsons steam turbines,\n| 5 December 1909\n| 23 October 1913\n| Ran aground off Cape Tres Forcas 26 August 1923; broken up on site\n|- valign=\"top\"\n| align= left |\n| 23 February 1910\n| 16 August 1915\n| Sunk, 30 April 1937\n|- valign=\"top\"\n| align= left |\n| 5 February 1912\n| 20 December 1921\n| Sunk, 17 June 1937\n|-\n|}\nReina Victoria Eugenia class\nAuthorized as the Plan de la Segunda Escuadra under the Navy Law of 1913, the three ships of the Reina Victoria Eugenia-class, named for King Alfonso's queen consort and designated ships \"A\", \"B\" and \"C\" (only \"A\" having a formally proposed name), were designed by Vickers-Armstrongs and were planned to displace  with a speed of . Early plans for the type called for an armament of  guns, however financial difficulties resulted in the selection of an armament of eight  weapons instead. As significant technical assistance from Britain would have been required for construction of the class, the outbreak of the First World War led to the cancellation of the project.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the Reina Victoria Eugenia class\n|- valign=\"top\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Armor\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"2\" | Service\n!\n|- valign=\"top\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n| align= left | Reina Victoria Eugenia\n| rowspan=\"3\" | 8 ×\n| rowspan=\"3\" | Unknown\n| rowspan=\"3\" |\n| rowspan=\"3\" | 4 screws, Parsons steam turbines,\n| rowspan=\"3\" | —\n| rowspan=\"3\" | —\n| rowspan=\"3\" | Cancelled, 1914\n|- valign=\"top\"\n| align= left | \"B\"\n|- valign=\"top\"\n| align= left | \"C\"\n|}\nPostwar projects\nThe Italian battleship Littorio, a variation of which was proposed for Spain.\nFollowing the end of the First World War, Spain did not participate in the Washington Naval Conference which limited  battleship construction for its signatories. Nevertheless, battleships of the  displacement class—the limit under the Washington Naval Treaty—were considered by the Spanish Navy in the early 1920s. By the early 1930s, the navy made proposals for a \"reduced  type\" ship, although nothing came of either project.\nAfter his victory in the Spanish Civil War, Francisco Franco made plans for the Spanish Navy that included the acquisition of four modern battleships, and a variation on the Italian s was the favored candidate to fill the requirement. In late 1939, a Spanish mission to Italy received assurances of technical support for the construction of ships of the class in Spanish yards, and a slipway of sufficient size to construct two ships at a time was built at Ferrol. However, Italy's entry into the Second World War in 1940, combined with the limited resources of Spain, led to the cancellation of the project.\nA \"super-Treaty cruiser\" type was also projected as part of Franco's naval expansion plans, with some designs proposed for the type calling for an armament of six  guns; alternatively, some have speculated that the Spanish desired to purchase the two triple  turrets that were available following the decision by the German Kriegsmarine to rebuild the damaged battleship  with twin  turrets. The war situation meant that nothing was to come of this project either.\nSee also\n* List of battleships\n* List of retired Spanish Navy ships\n* List of galleons of Spain\n* List of ships of the line of Spain\nNotes\nReferences\n*\n*"
    }
  ]
}