{
  "content": [
    {
      "type": "text",
      "text": "# List of Waking the Dead episodes\n\nWaking the Dead is a British television police procedural crime drama series that was produced by the BBC featuring a fictional Cold Case unit comprising CID police officers, a psychological profiler and a forensic scientist. Nine series of the show were broadcast over the course of eleven years.\nEpisodes\nPilot (2000)\n{| class=\"wikitable plainrowheaders\" style=\"width:100%;\"\n|- style=\"color:#FFFFFF;\"\n! style=\"background:#D48142;\"| Episode\n! style=\"background:#D48142;\"| Title\n! style=\"background:#D48142;\"| Written by\n! style=\"background:#D48142;\"| Directed by\n! style=\"background:#D48142;\"| Original airdate\n! style=\"background:#D48142;\"| Viewers(millions)\n| Aux1= Barbara Machin\n| Aux2= Martin Hutchings\n| OriginalAirDate=\n| Aux4= 7.776.88\n| ShortSummary= Boyd decides to have a second attempt at cracking the case of Alice Miller, a young girl who was raped and murdered five years ago, but whose killer was never identified. Although the case was deemed cold at the time, Boyd's second investigation leads to a surprise turn of events, spurring the killer out of hiding, and forcing him to abduct a second girl, Jodie Whitemore. Realising that his actions have resulted in the girl's abduction, Boyd is forced to play catch-up as the killer sends him information regarding the girl's whereabouts. Boyd has Alice Miller's body exhumed, hoping that new DNA tests may reveal the killer's true identity, and provide clues as to the location of the missing girl, Jodie. However, the killer is keen to kill again, and it's a race against time for Boyd to save the missing girl. When the team pinpoint the girl's location, they use Mel as bait to lure the killer out. However, their plan soon backfires, when Boyd discovers that the kidnapper is looking for more than money – he wants revenge on Boyd's team – and Mel is in danger.\n''During this episode, we see Boyd with his wife and two-year-old son, who are never seen again in later episodes. They were written out in favour of a totally different storyline after the pilot. The opening scene of \"Burn Out\" explicitly shows that Boyd had a son who has vanished years before and would have been 25 in the timeframe of the episode. The whole story of Boyd's (presumably) dead son is told in the second part of \"Blind Beggar\". Storylines about abused, missing or dead children remained a recurring theme in the series throughout the nine series. The ultimate fate of Boyd's son will become a series-long arc in Series 7.''\n| LineColor= D48142\n}}\n|}\nSeries 1 (2001)\n{| class=\"wikitable plainrowheaders\" style=\"width:100%;\"\n|- style=\"color:#FFFFFF;\"\n! style=\"background:#212B2C;\"| Episode\n! style=\"background:#212B2C;\"| Title\n! style=\"background:#212B2C;\"| Written by\n! style=\"background:#212B2C;\"| Directed by\n! style=\"background:#212B2C;\"| Original airdate\n! style=\"background:#212B2C;\"| Viewers(millions)\n| Aux1= Peter Jukes\n| Aux2= Edward Bennett\n| OriginalAirDate=\n| Aux4= 8.806.96\n| ShortSummary= When a young woman, Marina, sets alight an abandoned car in the middle of a busy street, and takes photographs of it as it burns, Boyd is forced to pin her to the ground, attempting to shield her from the possible explosion. Boyd later discovers that Marina's father died in a car accident a few years previously in the same street, and that Marina refuses to accept that his death was simply an accident. Boyd is intrigued, and reluctantly agrees to investigate. Frankie performs forensic tests on Marina's father's car, and proves that he was still alive after the crash, and could have easily escaped. However, the answers they uncover may mean that the danger to Marina is much greater than any of them had thought possible. Boyd has Marina's uncle, Mike Coleman, and her mother, Gwen, brought in for questioning, while Frankie searches their house. As she finds items that were recovered from the car nine years ago, she suspects that Perry Coleman was being blackmailed by Rod Brogan. When Boyd has the body exhumed, the DNA results surprise everyone.\nFeaturing Simon Kunz as DAC Ralph Christie, Angela Griffin as Marina Coleman, Clive Russell as Perry Coleman and Beverly Hills as Gwen Coleman.\n| LineColor= 212B2C\n}}\n| Aux1= John Milne\n| Aux2= Robert Knights\n| OriginalAirDate=\n| Aux4= 8.026.81\n| ShortSummary= Workmen renovating the crypt of a Catholic church are alarmed when they discover the skeletal remains of a young man buried within the concrete. The team set about trying to pinpoint the identity of the body, which appears to have been buried with the accoutrements of certain Catholic rituals. However, an unusual piece of evidence – a message in Braille buried with the corpse, turns out to be a passage from one of St. Paul's letters to the Corinthians and proves to be a vital clue in identifying both the victim, and the killer. As the team suspect that the body was never meant to be discovered, the hunt continues for the murderer, until former priest Fr Stuart is brutally murdered in similar circumstances. Suspecting that he may have known the identity of the killer, Boyd decides to dig deeper, and the team uncover some long hidden family secrets while questioning the community and congregation. When Frankie discovers a possible biological connection between the former parish priest, Fr Stuart, and the first victim, sparks begin to fly.\nFeaturing Simon Kunz as DAC Ralph Christie, Barry Morse as Fr Sebastian Stuart and Annette Crosbie as Moira Bowen.\n| LineColor= 212B2C\n}}\n| Aux1= Simon Mirren\n| Aux2= Robert Del Maestro\n| OriginalAirDate=\n| Aux4=7.336.93\n| ShortSummary= New evidence comes to light in the case of Annie Keel, a woman who was tried and convicted twenty-five years ago of a double murder when both her husband and a neighbour's son were killed in extreme circumstances. However, her imprisonment was based solely on her own confession, as no evidence was recovered from the scene to suggest that she may have been responsible. When new evidence casts doubt upon her version of her events, Boyd decides to challenge the validity of the conviction, and decides to investigate further in order to discover what really happened that night. Suspecting that her son may have been present at the time of the murders, Boyd begins to wonder if Annie is covering for somebody else, suspecting that they may have been responsible. When his theory is proven right, Annie re-unites with her long lost son, who she believed to be responsible, but was in fact, simply a witness, and the hunt for the real killer continues. As Boyd's evidence leads to a prime suspect, Annie is forced to recall the events on the night of the murders.\nFeaturing Simon Kunz as DAC Ralph Christie, Harriet Walter as Annie Keel, Cal MacAninch as Alex Bryson / Sam Keel, Lynda Bellingham as Mary Mantel, Nicholas Woodeson as Reese Dickson and Noel Clarke as Harry (police constable in archives).\n| LineColor= 212B2C\n}}\n| Aux1= Barbara Machin\n| Aux2= Gary Love\n| OriginalAirDate=\n| Aux4=9.098.60\n| ShortSummary= When the corpse of well-known police woman Debbie Britten, who disappeared a year earlier, is found floating in a golf bag in the River Thames, Boyd and the team try to discover who would have the motive to kill both her and her unborn child. The problem is, the list of suspects fails to help narrow down the identity of the killer. At the time of her death, she was being stalked by an obsessive whom she had met online, was struggling with an ex-husband who didn't want to let her go, and was also being harassed by the father of her unborn child. When the stalker confesses to killing her, Grace isn't entirely convinced he is telling the truth. Matters take a turn for the worse when the stalker's body is found nailed to a bridge over a river. Determined to get to the bottom of the case, Boyd makes use of dubious tactics to coach the killer into making a mistake. A reconstruction of the night of Debbie's murder leads to the identity of a further suspect, Boyd does not waste any time in questioning him about what he knows in relation to Debbie's death.\nFeaturing Simon Kunz as DAC Ralph Christie, Thomas Lockyer as DI Steven Maitland, Lee Ross as Christopher Redford, Andrew Buckley as Michael Skinner, Tessa Peake Jones as Fiona Maitland and Janet Ellis as TV Reporter.\n| LineColor= 212B2C\n}}\n|}\nSeries 2 (2002)\n{| class=\"wikitable plainrowheaders\" style=\"width:100%;\"\n|- style=\"color:#FFFFFF;\"\n! style=\"background:#FF5795;\"| Episode\n! style=\"background:#FF5795;\"| Title\n! style=\"background:#FF5795;\"| Written by\n! style=\"background:#FF5795;\"| Directed by\n! style=\"background:#FF5795;\"| Original airdate\n! style=\"background:#FF5795;\"| Viewers(millions)\n| Aux1= John Milne\n| Aux2= Edward Bennett\n| OriginalAirDate=\n| Aux4= 8.337.31\n| ShortSummary= The team are forced to enlist the help of a psychotic serial killer named Thomas Rice, when the one woman who escaped death at his hands, the cool and poised Dr. Clare Delaney, gets a dreadful reminder of her past ordeal and a fearful shock when a playing card is flung at her car windscreen as she sets off to make a house call on a wet, windy, dark night. The team take a second look at Rice's crimes, prompted by Boyd's unshakeable belief that Rice had claimed other, hitherto undiscovered victims. Boyd, who has personal links to the case, and Grace decide to use Mel to lure a confession from Rice, but the plan goes horribly wrong when Rice tries to stab Mel. Reluctantly choosing to continue using his assistance, Boyd tries to protect Dr. Delaney from repeating her terrifying ordeal at the hands of a copycat assailant. It becomes apparent that Rice might have help on the outside, and it soon becomes crucial that Boyd confronts Dr. Delaney, to find out what went on during her captivity. Why did he spare her life, yet kill all his other victims?\nFeaturing Samuel West as Thomas Rice, Susannah Harker as Claire Delaney, Paterson Joseph as Dermot Sullivan and David Burke as Philip Bryant.\n| LineColor=FF5795\n}}\n| Aux1= Stephen Davis\n| Aux2= Maurice Phillips\n| OriginalAirDate=\n| Aux4= 8.257.04\n| ShortSummary= Boyd and the team take on the task of infiltrating the dark underworld of London's gangland crime families when small-time gangster Harry Newman makes a deathbed confession to twelve \"unauthorised killings\". Grace is intrigued by this strange expression of guilt, but Boyd and the rest of the team are tempted to dismiss it as the meanderings of a dying man. However, the investigation takes a rather abrupt turn when Frankie discovers that Newman did not die of natural causes – and was murdered in such a way as to make it look so. The team soon realize there is a lot more to Newman than they first imagined. Added to all that, there is a link to a famous fifties trial as a result of which, a gangster was hanged for killing two policemen. Recent inquiries into Newman's past and the identities of the possible twelve murder victims uncover a connection to the infamous trial and execution. Desperate to get the truth told, the gangster's brother, Frank, recruits a journalist to publish the real truth about his brother's execution.\nFeaturing David Hemmings as Ex-DCI Malcolm Finlay, Warren Mitchell as Edgar Truelove, Ronald Pickup as Sutton, Tony Osoba as Andrew Wallace and Cheryl Hall as Valerie Truelove, David de Keyser as Marcus Freeman and David Ashton as Fr Cameron.\n| LineColor= FF5795\n}}\n| Aux1= Stephen Davis\n| Aux2= David Thacker\n| OriginalAirDate=\n| Aux4= 8.258.10\n| ShortSummary= When a petty criminal is acquitted of the murder of a prominent Home Office adviser and well known female activist, Boyd and his team struggle to find the identity of the real killer. Victim Katherine Reed had attacked the establishment at every opportunity, only to change sides later, having been discovered to have slept with countless men in an attempt to get pregnant, to have a baby for her and her lesbian partner. Boyd's progress on the case is hampered not only by a Home Office audit, which means the team will be shadowed throughout, but also by the fact that the original investigation was conducted by one of his old flames, with whom he is desperate to rekindle a relationship. As the team continue with their investigation at Whitehall, they quickly discover the atmosphere to be very dark and secretive, and soon realise that only cunning tactics will allow them to flush out Katherine's killer, and eliminate those who simply slept with her in an attempt to get her pregnant. With a dark cloud shrouding the investigation, Boyd discovers his prime suspect is protected.\nFeaturing Corin Redgrave as Sir James Beatty, Patricia Hodge as Lady Alice Beatty, Ruth Gemmell as DI Jess Worrall and Colin Stinton as Larry Karp and Ed Bishop as Tyler.\n| LineColor= FF5795\n}}\n| Aux1= Ed Whitmore\n| Aux2= Edward Bennett\n| OriginalAirDate=\n| Aux4= 8.918.92\n| ShortSummary= Twelve years after sixteen-year-old Joanna Gold famously disappeared in broad daylight on Hampstead Heath, the dress she was wearing is found in a lock-up garage owned by one of her old friends. Suspecting that he may have been responsible for her death, and having discovered blood on the dress, Boyd is convinced he has found his man. However, when evidence points to another assailant, he is forced to let his original suspect go – which later results in a suicide attempt. Feeling guilty that he persecuted the wrong person, Boyd goes on a manhunt in order to discover the real identity of her killer. When Joanna's sister, Clara, informs Boyd that she is being followed, he suspects that the killer is going to strike again, and uses Clara as bait to lure him out. However, while under pressure to keep a watchful eye, Boyd slips up and makes possibly some irreversible mistakes, leading to Clara's father informing the Chief Constable of Boyd's actions. Realising the mystery of Joanna's murder lies closer to home than first thought, Boyd uses cunning tactics to flush the killer out.\nFeaturing Cherie Lunghi as Leah Gold, Roger Allam as Benjamin Gold, Sophie Winkleman as Joanna Gold / Clara Gold and Jack Ellis as Police Commissioner\n| LineColor= FF5795\n}}\n|}\nSeries 3 (2003)\n{| class=\"wikitable plainrowheaders\" style=\"width:100%;\"\n|- style=\"color:#FFFFFF;\"\n! style=\"background:#473D80;\"| Episode\n! style=\"background:#473D80;\"| Title\n! style=\"background:#473D80;\"| Written by\n! style=\"background:#473D80;\"| Directed by\n! style=\"background:#473D80;\"| Original airdate\n! style=\"background:#473D80;\"| Viewers(millions)\n| Aux1= Ed Whitmore\n| Aux2= Robert Bierman\n| OriginalAirDate=\n| Aux4= 6.636.79\n| ShortSummary= Carl McKenzie, a man convicted of opening fire on a town centre crowd from a multi-storey car park, and killing a policeman in the process, protests his innocence. He claims that he was kidnapped by the actual killer, locked in the back of a camper van, and forced to watch as the killings took place. Boyd's colleagues question where his loyalties lie when he seems unwilling to re-investigate the case. As Mel digs deeper, she discovers some disturbing truths about her boss, and also discovers that the policeman killed in the massacre was one of Boyd's best friends. Boyd struggles with his past, whilst continuing the investigation into the mass murderer, who was also guilty of killing his close friend. When a theory revealed at the time of the murders proves to be completely hollow, Boyd begins to believe that the gunman's claims of innocence are true. As the team investigate further, it looks as if someone else may have been involved, and that the policeman's death may have been caused by friendly fire, and that McKenzie may have been telling the truth.\nFeaturing Sean Pertwee as Carl McKenzie, Jason Hughes as Andrew Cross, Robert Pugh as Robert Cross, Kim Vithana as Beth Downing, Guy Henry as Guy Reynolds, Shirley Anne Field as Monica Reynolds, Raji James as Stephen Markland, Brendan Coyle as Martin Corgan, Clarke Peters as Howard Boorstin, Cliff Parisi as Tony King, Saskia Wickham as Sally Patterson and Zig Byfield as John Nesbit.\n| LineColor=473D80\n}}\n| Aux1= Simon Mirren\n| Aux2= Andy Hay\n| OriginalAirDate=\n| Aux4= 7.167.75\n| ShortSummary= When Mark Lovell, a man convicted of murdering his adoptive father ten years previously, is cleared on appeal, Boyd is not convinced that he is innocent, and decides to re-open the case. The clue to uncovering the real identity of the killer lies in finding the rest of the family, who disappeared on the night of the murder. With a big inheritance at stake, both parties appear to have a lot to hide. The situation becomes even more complicated when a body washed up on a nearby beach turns out to be that of Mark Lovell's cousin. The team establish that Mark has a watertight alibi, and the search for the real murderer narrows down to the remaining family members. Their investigation into the two remaining brothers is further complicated by the discovery of major drug dealing, and involvement with the witness protection scheme. Realizing that his prime suspect may be under the watchful eye of another police officer and his team, Boyd decides to use the brothers against each other, in order to uncover evidence, which traps the killer and secures a conviction.\nFeaturing Craig Kelly as Mark/Maria Lovell, Lorraine Pilkington as Mandy Lovell and Alan Ford as Jack Ely.\n| LineColor=473D80\n}}\n| Aux1= Stephen Davis\n| Aux2= David Thacker\n| OriginalAirDate=\n| Aux4= 7.417.35\n| ShortSummary= When a memory therapist approaches Boyd with information about a sexual abuser at a children's care home, the team unravel a regime of sexually abused young boys, and a suspected murderer, only known to his victims as Papa Doc. The situation is further complicated by Boyd's inability to believe that any of the information given to him is true. Grace uses her contacts to hook up with the manager of the care home from all those years ago, only to discover that he knew about the abuse, but was too unstable at the time to do anything about it. When the client who revealed the abuse in therapy disappears, in search of the man who abused him and murdered one of his best friends, the team strongly suspect that the information given to them has been helped along the way. In their attempts to prevent another murder, the team desperately try to establish the identity of the care home paedophile, who is now being hunted down by two of his victims. As a ghastly world of online paraphernalia is discovered, Boyd becomes determined to find the abuser.\nFeaturing Charlie Creed-Miles as Tanner, Navin Chowdhry as Rainman, Saskia Reeves as Dr. Laurie Poole, Ian Hogg as Oliver Gill, Tom Bell as Prof. Hugh Cullen and Michael Pennington as Prof. Alan Macintosh.\n| LineColor= 473D80\n}}\n| Aux1= Stephen Davis\n| Aux2= Betsan Morris Evans\n| OriginalAirDate=\n| Aux4=7.908.41\n| ShortSummary= The discovery of a mummified body in a derelict house in Notting Hill leads the team back to the sixties, and a film which was shot in the house, featuring a murderous fight between gangsters. But was it real? Further renovation works at the house reveal three more bodies buried within, and a dark day for Spencer, who used to live in the house as a child with his mother and father. The identity of the victims reveal that the film's content may not be so fictional after all. And when Spencer looks into his family history, he discovers that his father may be linked to the mysterious men involved. Just as Boyd believes he has cracked the case, the gangster responsible for the bodies behind the walls decides it's time to avenge old wounds, and the unearthing of past events provokes more murders and an international turf war between old rivals. As events start to become even more complicated, Boyd realises that Spencer's family history is the key to unravelling the mystery, and Spencer is forced to confront his mother and discover the truth about the reason his father left.\n''In the opening sequence of this story's first episode, Mel is promoted to Detective Sergeant.\nFeaturing Richard McCabe as Karl Meerman, Sharon D. Clarke as Camelia Baptiste, Maurice Roëves as Vinnie Peverell, Gina Bellman as Frannie Henning, Ken Russell as Gerry Raistrick and Earl Cameron as Carlton Jordan.''\n| LineColor= 473D80\n}}\n|}\nSeries 4 (2004)\n{| class=\"wikitable plainrowheaders\" style=\"width:100%;\"\n|- style=\"color:#FFFFFF;\"\n! style=\"background:#009FE9;\"| Episode\n! style=\"background:#009FE9;\"| Title\n! style=\"background:#009FE9;\"| Written by\n! style=\"background:#009FE9;\"| Directed by\n! style=\"background:#009FE9;\"| Original airdate\n! style=\"background:#009FE9;\"| Viewers(millions)\n| Aux1= Tony McHale\n| Aux2= Andy Hay\n| OriginalAirDate=\n| Aux4= 8.048.19\n| ShortSummary=Boyd and the team are tasked with investigating the unsolved murder of George Western, a man found with a nine-inch nail in his skull in 1948, when his grandson, Adam, discovers new \"evidence\" which spurs the police into re-opening the case. Boyd initially suspects that the man's death may be due to the fact he was a conscientious objector in the Second World War, but the team suspects otherwise. When the body of a second victim, William Davis, is found in similar circumstances almost fifty-six years after the first murder, the trail of clues leads Grace to discover the unsolved murder of Norman Taylor that took place thirteen years after the first victim and follows the same modus operandi (MO) – a nine-inch nail through the head. Spence discovers that Taylor and Western were in the same regiment during the war and that Davis was also a member of the same regiment, albeit under a different name. Realising that the killer is trying to pick off the survivors of the regiment one by one, Boyd and the team try to track down the survivors before they meet the same fate.\nFeaturing Michael Byrne as Joe Brackley, Geoffrey Bayldon as Edward Atkinson, Clive Wood as Neil Clayton, JJ Feild as Adam Western, Alibe Parsons as Carmen Davis, Richard Mayes as Martin Raynor and Andi Osho as Policewoman.\n| LineColor= 009FE9\n}}\n| Aux1= Stephen Davis\n| Aux2= Suri Krishnamma\n| OriginalAirDate=\n| Aux4= 8.117.95\n| ShortSummary= Boyd and his team face a race against time after a skeleton found in a condemned garage triggers a tragic chain of events. The skeleton is that of garage owner, Gerald Doyle, a student who was reported missing in 1981. An unexploded car bomb found at the scene points to terrorist activity as the cause of death. However, Doyle’s parents produce a set of his diaries, which reveal that he was actually a mole for the intelligence services. The team begin to feel like they are being watched, and their fears are confirmed when they find unauthorised surveillance equipment in Boyd's car. As they discover their victim may have not have been as guilty as they once thought, a witness Boyd questioned as a part of the investigation commits suicide – leading them to find a link to an assassination. Boyd is then given two days to solve the case, before the security services take over.\n''During this story's second episode, Spencer is promoted to the rank of Detective Inspector.\nFeaturing Timothy West as Joe Doyle, Frances de la Tour as Alice Taylor-Garnett, Oliver Cotton as MI5 Director General Sir Charles Stewart, Danny Webb as Sir Martin Havering, Caroline Lee Johnson as Assistant Commissioner Dyson, Tom Georgeson as Major Timothy Cooper and Peter De Jersey as Dr. Chris Reed.''\n| LineColor= 009FE9\n}}\n| Aux1= Ed Whitmore\n| Aux2= Ben Bolt\n| OriginalAirDate=\n| Aux4= 8.769.08\n| ShortSummary= (For the psychiatric term, see dissociative fugue.) The unsolved disappearance of five-year-old twins Jason and Cindy Murphy is re-opened when Jason is found after being admitted to hospital with injuries sustained after being hit by a car. Thirteen years since their disappearance, and the police are no closer to finding Cindy. Boyd uncovers evidence that Jason has been in contact with Cindy within the past six weeks, and thus realises that she must also still be alive. But when Jason disappears from hospital, the team are forced to spring into action and track him down – and discover how the twins were taken – and why. Meanwhile, Mel searches for her biological mother, and Spence makes use of his first job as an Inspector. As the team link the twins' disappearance to Dr. Roper, the man driving the car, which hit Jason, they find him dead, after being stabbed repeatedly with a kitchen knife in his own home. They then unravel his past, and discover some dark secrets, which could lead to two families being blown apart. As the team attempt to work out Cindy's identity, the race is on to try to find her. The episode ends with the shocking revelation of the real killer's identity in a related case thought to have been solved many years before.\n''Featuring Sean McGinley as Dr. Donald Roper, Ray Stevenson as Dr. Tim Faulkner, Joe Armstrong as Jason Murphy, Maimie McCoy as Sarah Faulkner, Patrick O'Kane as Greg Murphy and Denise Black as Ingrid Faulkner.''\n| LineColor= 009FE9\n}}\n| Aux1= John Milne & Andy Hay\n| Aux2= Andy Hay\n| OriginalAirDate=\n| Aux4= 8.168.31\n| ShortSummary= When the deputy manager of a probationary hostel apparently uses a gun to commit suicide, the local police are convinced he killed himself, and the case is wrapped up. However, Frankie remains unconvinced, and upon investigation, discovers the gun used was linked to two unsolved murders from the 1970s and 1980s. Now convinced that deputy manager Tim Denby did not kill himself, the investigation into the ownership of the gun gets underway. However, shortly before tests can begin, a masked man takes Frankie hostage in her lab and uses her to steal the gun out of her possession. The case becomes even more complicated when the gun is found to have been involved in nine separate contract killings. When the gun is used in the murder of local hotshot Phil Brown, the team suspect that his former hitman Sam Jacobs may be responsible, and that Denby's murder may have been the result of mistaken identity, with Brown having sent his gofer Mark Andrews to kill Jacobs, but then shooting the wrong man by accident, as he has trouble with his vision.\n''In this episode, the narration is done in a non-linear way. The episode uses both flashbacks and fast-forwards to connect the team's side and Sam Jacobs' side of the storyline, that finally converge at the end. The episode also sees the first hints of a rift between Jordan's \"tough on crime\" approach and Boyd's more \"liberal\" approach.\nFeaturing Nigel Terry as Sam Jacobs, T. P. McKenna as Phil Brown, Kerry Fox as Elsbeth Varley, Andrew Tiernan as Don Keech and Arnold Wesker as Rabbi Reg Solomon.''\n| LineColor= 009FE9\n}}\n| Aux1= Doug Milburn\n| Aux2= Phillipa Langdale\n| OriginalAirDate=\n| Aux4= 8.568.82\n| ShortSummary= The team are asked to re-open the murder of local headmaster James Carstairs, when a second victim, Tomas Barac, is found in similar circumstances. Both victims had the word \"Sorry\" carved into their backs, were tied to a bed and then had semen poured over them, to perhaps signify that they were homosexuals. As the latest victim has a brother linked to organised crime, DSI Andy Bulmer and his team from NCIS are all over the case, and suspect that Barac's death may be related to his activities rather than the work of a serial killer. Boyd takes an instant dislike to Bulmer, but soon finds a bond with Bulmer's profiler, Greta. When Bulmer's right hand man, DS Dave Marvin, and Marvin's informant, Graham Penn, are both murdered in similar circumstances, Boyd suspects that the killings may be linked to a paedophile group grooming young girls, and that the perpetrator may be someone who was abused as a child. The case begins to unravel, however, when the man spotted at the scene of every crime arrives at the unit, and announces himself to be Greta's father.\n''The title of the episode is derived from Elton John's song \"Sorry Seems to Be the Hardest Word\".\nFeaturing Phil Daniels as DSI Bulmer, Emma Fielding as Dr. Greta Simpson, Julian Glover as William Laurence, Phyllida Law as Mrs. Carstairs, James Dreyfus as Raymond Carstairs and Paul Reynolds as DS Dave Marvin.''\n| LineColor= 009FE9\n}}\n| Aux1= Ed Whitmore\n| Aux2= Andy Hay\n| OriginalAirDate=\n| Aux4= 8.358.55\n| ShortSummary= Boyd and the team are tasked with investigating the case of a young woman, with a history of psychiatric problems, who murders her family by setting the family home on fire, when the circumstances surrounding the incident are linked with a similar case from three years previously, in which both women claim they were told to commit the crimes by a mysterious character only known as 'The Shepherd'. Suspecting that the psychiatrist linked to the two women may be the guilty party, Grace and Spence look into similar cases from the past five years, and discover that a third case, that of suicide victim Judy Walsh, is also linked to the same psychiatrist. Mel is keen to keep his name out of the investigation, mainly due to the fact she has fallen in love with him. But as the web of lies begins to unravel, The Shepherd's latest victim sees red, and sends Mel plummeting to her death. Ridden with guilt, Boyd re-evaluates the evidence, and discovers that the son of the original victims may hold the key to the entire case, but is it too late to save his latest conquest? The episode ends with an ambiguous scene that suggests that the actual perpetrator known as \"The Shepherd\", though correctly identified by the team, might escape punishment.\nFeaturing Paul Kaye as Dr. David Carney, Kenneth Cope as Neville Harding and Lois Baxter as QC Joyce.\nLast appearances of Claire Goose as Detective Sergeant Amelia \"Mel\" Silver and Holly Aird as Forensic Pathologist Dr Frankie Wharton.\n| LineColor= 009FE9\n}}\n|}\nSeries 5 (2005)\n{| class=\"wikitable plainrowheaders\" style=\"width:100%;\"\n|- style=\"color:#ffffff;\"\n! style=\"background:#FB692B;\"| Episode\n! style=\"background:#FB692B;\"| Title\n! style=\"background:#FB692B;\"| Written by\n! style=\"background:#FB692B;\"| Directed by\n! style=\"background:#FB692B;\"| Original airdate\n! style=\"background:#FB692B;\"| Viewers(millions)\n| Aux1= Joe Cozens\n| Aux2= Philippa Langdale\n| OriginalAirDate=\n| Aux4= 8.587.56\n| ShortSummary= A mummified body found on a derelict aeroplane leads Boyd and the team to a person already convicted of committing a similar crime, and Spence goes undercover in a bid to understand his motives. The victim's uncle reveals the dead man's connections with a corrupt businessman selling fake drugs – but a tragedy foils the detectives' work. Boyd and the team's investigation of a shifty businessman leads them to uncover a pharmaceutical conspiracy involving fake drugs to treat AIDS. A major company is implicated in the scandal – and its bosses are prepared to do whatever is necessary to ensure their secret remains safe. A new Detective Sergeant is assigned to the team due to her knowledge of the original murder case, but will leave after the current case is resolved, never to be seen again.\nFirst appearance of Esther Hall as Forensic Pathologist Dr Felix Gibson. Only appearance of Georgia Mackenzie as Detective Sergeant Andy Stephenson (works on the case as a full team member, listed with the team in the closing credits but not part of the main cast in the opening credits).\nFeaturing Nina Wadia as Roshni Mehta, Gerard Murphy as James Alcock, David Walliams as Bell, Henry Ian Cusick as Jeremy Allen, Sara Stewart as Claire Yardley and Paul Bhattacharjee as DCI Chowdray.\n| LineColor= FB692B\n}}\n| Aux1= Raymond Khoury\n| Aux2= Ben Bolt\n| OriginalAirDate=\n| Aux4=5.966.94\n| ShortSummary= Boyd expects a confession of guilt when he is summoned to prison by one of the inmates, a former policeman serving life for the murder of his partner. The convict does make a revelation – but what he has to say causes the detective to re-examine the facts of the old case from every possible angle to assure himself of the man's guilt. Meanwhile, the detectives interview Stella Goodman, the latest applicant for Mel's job. Boyd is suspended from duty following a hit-and-run incident, but he claims he can't remember what happened. The rest of the cold case squad are convinced he's guilty though he was actually framed, but nevertheless continue to seek the truth in the Eddie Vine case. A new member is assigned to the team, and appears to be concealing an agenda of her own. Meanwhile, tension between Boyd and Jordan rises to an unprecedented high when Boyd inserts himself in the case despite being suspended.\nFirst appearance of Félicité Du Jeu as Detective Constable Stella Goodman.\nFeaturing David Hayman as Eddie Vine, Diane Parish as Sheryl Palliser, Peter Polycarpou as Dominic Parks, Connor McIntyre as DCI Gulley and Robin Soans as Mr. Adamson.\n| LineColor= FB692B\n}}\n| Aux1= Ed Whitmore\n| Aux2= Michael Offer\n| OriginalAirDate=\n| Aux4= 6.957.11\n| ShortSummary= A millionaire businessman is found dead, having apparently committed suicide, a year after his initial disappearance. Evidence suggests he was imprisoned in a cellar immediately before his death, and it's not long before a second body is discovered at the scene. The other corpse has been dead for far longer and it seems both murders could be the work of an unlikely suspect. The team are convinced Dr Nick Henderson is behind the murders, and Stella puts together damning evidence against him. However, before he can be arrested, he disappears without trace and his wife vanishes as well. The squad soon realise she could be the next victim and embark on a race against time to find her. Tension still remains high between Boyd and Jordan after Jordan's open display of distrust towards Boyd in the previous episode, and occasionally also between Boyd and Foley. Stella has a hard time adjusting at first, because the others have still not overcome their grief and guilt over Mel's death.\nFeaturing Toby Stephens as Dr. Nick Henderson, Ronan Vibert as Dr. Jonathan Lynch, Ayesha Dharker as Mary Sharman and Frank Harper as John Tate.\nThe core elements of the storyline are a fictional representation of the real-life story of Jean-Claude Romand.\n| LineColor= FB692B\n}}\n| Aux1= Declan Croghan\n| Aux2= Jim O'Hanlon\n| OriginalAirDate=\n| Aux4= 6.297.16\n| ShortSummary= The appeal of Tony Greene, a man convicted of murder and mutilation, forces Grace to question the decision she made on her first case in 1980. Someone who appears to be copying his chilling tactics sends the team footage of a new victim having his finger cut off. At the same time, Grace receives threats and a macabre package, a jar of pickled severed fingers. The team work out the identity of the killer, an old acquaintance of Tony Green's from prison who is harbouring a grudge against Grace. She decides to confront him personally, but gets more than she bargained for when she stumbles upon the kidnap victim. During the investigation, Spencer and Stella are seen building what appears to be an efficient working relationship. Spencer also sees some of his certainties about himself shaken up during one of the interviews and is obviously uncomfortable about it. An unexpected and darker side of Grace's past is revealed, which she obviously wanted to remain hidden from her colleagues, especially from Boyd. Ultimately a shocking ramification from past events leads to the discovery of the perpetrator in the contemporary case.\nFeaturing Emma Lowndes as Grace Foley in 1980 and Tom Ellis as Detective Sergeant Harry Taylor, the senior investigator in the original case (now deceased).\nAlso featuring Paul Freeman as Dr. Charles Hoyle, Natalie J. Robb as Emma Lloyd and Angela Bruce as Judge.\n| LineColor= FB692B\n}}\n| Aux1= Oliver Brown\n| Aux2= David Thacker\n| OriginalAirDate=\n| Aux4= 7.507.79\n| ShortSummary= The team find evidence linking Steven Hunt, a soon-to-be-released benefit fraudster, with a string of murders. Unfortunately, the nature of their proof is circumstantial at best. With only a short while to go until the end of the man's nine-month sentence, the detectives have their work cut out to solve the crimes before he is released and free to kill again. The team are forced to release Hunt from custody. Boyd arranges to have him followed to prevent any more murders, but the body of a girl soon turns up, drowned in the local swimming pool. Boyd takes a personal interest in the case and gradually loses control of his actions. He ultimately leaks the suspect's name to a journalist hoping to uncover more information. His mistake proves fatal for two of the protagonists but results in the identification of a second, as yet unsuspected, killer.\nFeaturing Stephen Moyer as Steven Hunt, Cheryl Campbell as Maureen Hunt, Peter Wight as Donald Hunt, Dan Fredenburgh as Ben Elwes, Sharon Duncan-Brewster as Sarah Baker and Peter Hamilton Dyer as Chris Wright.\n| LineColor= FB692B\n}}\n| Aux1= Ed Whitmore\n| Aux2= Richard Standeven\n| OriginalAirDate=\n| Aux4= 7.588.17\n| ShortSummary= Spencer comes under suspicion when a double murder he worked on eighteen years ago is re-examined. DNA profiling proves the wrong man was convicted, and when Felix discovers that someone is trying to destroy the new evidence, the signs point to one of her colleagues. However, a package that arrives for Spencer turns out to be a gas bomb that injures Felix, forcing the detectives to reconsider. The team are placed in quarantine while the substance that harmed Felix is identified, but Spencer has already gone in search of the suspect whose DNA was found at the scene. By the time Boyd realises a dangerous insider is damaging his investigation, he is sealed into the building. Spencer, the only one who was not inside the building when the gas bomb exploded, is then left to carry on the investigation on his own, in the face of overwhelming odds and opposition from far higher circles of power. A confrontation between Boyd and Stella's former guardian (an extreme-right leaning MI5 officer who manipulated Stella in the current case) confirms Boyd's liberal leaning.\nFeaturing Mark Lewis Jones as Tom McQueen, David Calder as Commander Bill Drake, Mark Letheren as Toby Holmes, Paul Copley as Clifford Day and Abhin Galeya as Dr. Harry Barton.\nLast appearance of Esther Hall as Forensic Pathologist Dr Felix Gibson.\n| LineColor= FB692B\n}}\n|}\nSeries 6 (2007)\n{| class=\"wikitable plainrowheaders\" style=\"width:100%;\"\n|- style=\"color:#ffffff;\"\n! style=\"background:#EBD704;\"| Episode\n! style=\"background:#EBD704;\"| Title\n! style=\"background:#EBD704;\"| Written by\n! style=\"background:#EBD704;\"| Directed by\n! style=\"background:#EBD704;\"| Original airdate\n! style=\"background:#EBD704;\"| Viewers(millions)\n|Aux1=Declan Croghan\n|Aux2=Tim Fywell\n|OriginalAirDate=8 January 2007\n|Aux4=9.519.11\n|ShortSummary= The team is joined by new forensic scientist Eve as they investigate the death of a teenage boy, Davy, who drowned in a concrete pit on a building site in 1990. A lump of human ear found in his stomach belongs to a comatose man who is currently in hospital after being involved in an illegal fight. Eve discovers the man is in fact Davy's brother and that the events on the night of his death were linked to the ear. Meanwhile, Stella is attacked by a wayward dog at a woodland shrine where a mysterious nun, who seems to have stigmata, warns her to leave without collecting the evidence required. Boyd is suspicious of Sean Killigan, the contractor on whose construction site Davy's body was found and also the man who brought Joe to the hospital, and his wife Ester. Joe awakes from his coma to hear Davy is dead, unaware that after the fight on the night of his death, someone else had decided to go after Davy. Intricate storylines involving a group of Irish Travellers, illegal dog-fights, illegal boxing matches, and ancient Druidic rituals unfold before the team identify the true perpetrator and find out the truth about Ester's long lost child.\n''First appearance of Tara Fitzgerald as Forensic Pathologist Dr Eve Lockhart. Felix's departure and Eve's arrival are never seen on-screen. From the dialog in the opening sequence, it is clear that Eve has already been with the team for some time before the events in this episode.\nAlso featuring Carey Mulligan as Sister Brigid, Daragh O'Malley as Sean Killigan Snr, Ann Bell as Mother Superior, and Tony Rohr as Liam Ryan.''\n|LineColor=EBD704\n}}\n|Aux1=Nicholas Blincoe\n|Aux2=Andy Hay\n|OriginalAirDate=15 January 2007\n|Aux4=7.106.57\n| ShortSummary= A Sudanese politician based in Britain, Khaled Ahmed, goes on hunger strike, protesting at Britain's continued refusal to hand over the skull of the 'Mahdi', a Sudanese ruler from the nineteenth century, that was originally stolen from a Sudanese mausoleum by British forces. Boyd and the team are tasked to investigate and locate the current whereabouts of the skull, before the Sudanese engage in another civil war. However, the discovery of a skull, which turns out not to be that of the Mahdi, uncovers links to the death of an Asian shopkeeper in East London in 1993. Boyd is relieved when Ahmed comes off the hunger strike, on the instruction of his daughter, but soon becomes startled by numerous false alarms in finding the missing Mahdi skull. Michael Leonard informs Stella that he was tortured by Catherine Braithwaite, the CEO of a multinational weapons company, Scott Grey Ltd. But Braithwaite has an alibi for the time of the beating, and the team wonders if Leonard is simply trying to implicate her in a crime that she did not commit, in order to save himself.\nFeaturing Alex Jennings as James Andrews, Polly Walker as Catherine Braithwaite, Graham Crowden as Sir Cyril Barrett, Adam James as Michael Leonard, Hassani Shapi as Omar Jaffiri, and Omar Mostafa as Hassan Hadid.\n|LineColor=EBD704\n}}\n|Aux1=Damian Wayling\n|Aux2=Robert Bierman\n|OriginalAirDate=22 January 2007\n|Aux4=7.857.77\n| ShortSummary= The team is called to investigate when workmen dislodge two conjoined bodies in the ceiling of a former city bank, which closed after Black Wednesday. The team discovers the woman, Katherine Keane, was, in fact, having an affair with the man, Mervyn Simmel, behind her husband's back, and the pair planned to leave the UK after the bank folded, using money smuggled out of the country in gold to Katherine's native Ireland by bent Irish Ambassador Brian McGurk. However, troubled by the appearance of a journalist, Lisa Tobin, investigating the case, Grace does a little investigating of her own and discovers that the journalist is none other than Katherine's biological daughter. When some of the gold resurfaces in the hands of Katherine's husband, Declan, Boyd decides to pay a visit to Ireland, but little does he know that the Irish officer investigating the case with him is actually looking to get his hands on the rest of the remaining gold, and has had a stake in the discovery of Katherine's body ever since the time of her death.\nFeaturing Peter Capaldi as Lucien Calvin, Terence Harvey as Philip White, Oliver Ford Davies as Hugo Keegan, Nick Dunning as Declan Keane, Catherine Walker as Lisa Tobin, Stanley Townsend as DI Bailey, and Alison Doody as Katherine Keane.\nThe episode was preceded with a lengthy BBC disclaimer heavily stressing its totally fictional nature and the lack of direct references to actual people or organisations, as the plot relies strongly on banking fraud practices within the City of London, and the involvement of Opus Dei in these and other frauds.\n|LineColor=EBD704\n}}\n|Aux1=Laurence Davy & Declan Croghan\n|Aux2=David Thacker\n|OriginalAirDate=29 January 2007\n|Aux4=7.337.34\n| ShortSummary= James Jenson, a long-term patient in a secure psychiatric unit, is released back into the community. However, on the same day, the wallets of three murder victims from the past are sent anonymously to the wife of one of the victims. Jenson was the prime suspect at the time of the three murders, but was deemed mentally unfit to stand trial, and was instead committed to the psychiatric unit. The team's investigation leads them to discover a systematic scheme of abuse in a care home during the 1970s and 1980s, and pinpoints the connection between the three victims that was originally unidentified at the time of the original investigation. The first victim, Harry Valentine, was the housemaster who regularly beat the children, a fact which care home owner Bruno Rivelli claims to know nothing about. The second, Dr. Reilly, was a physician who treated the injuries caused by Valentine, but failed to report the cause. And the third, a local councillor, was killed on the premise that he discovered exactly what was going on.\nFeaturing Nicholas Beveney as James Jenson, James Fox as Dr Bruno Rivelli, Jemma Redgrave as Sophie Wall, Richard Dillane as Ricardo Rivelli, Helen Blatch as Mrs. Jenson, Roy Holder as Mr. Flynn, Paul Ritter as Alan Pierce and Dominic Letts as Harry Valentine.\n|LineColor=EBD704\n}}\n|Aux1=Richard Warlow\n|Aux2=Andy Hay\n|OriginalAirDate=5 February 2007\n|Aux4=7.697.05\n| ShortSummary= The team are called to investigate when escaped psychiatric patient Daniel Lennon directs a family to unearth a forty-year-old male corpse buried beneath their Hampstead garden. They discover that Daniel was committed to a mental institution after killing both of his parents, but his psychiatrist suspects he is cutting adrift and becoming something new. Attempting to track him down to discover how he knew about the buried corpse, Boyd discovers that not only is he unable to remember killing his parents, he has started taking LSD to try and remember who was responsible for the corpse in the garden. When the team talk to former patient Heather Hardiss, they discover that Lennon's doctor, Parke, took all of the patients out of the mental institution in 1967 and instead treated them in a hippy squat, which happens to be the exact same house where the body was found in the garden. Suspecting that Lennon may be trying to unearth Parke as the killer, Boyd follows Lennon on his quest to discover what really happened that night, and who the real killer is. The team is shaken early in the episode when Grace quits after a severe row with Boyd. But it doesn't take long for Boyd to realize how much he needs Grace, both professionally and personally, and how much he wants her back.\nFeaturing Miles Anderson as Daniel Lennon and Richard Johnson as Dr. Raymond Parke.\n|LineColor=EBD704\n}}\n|Aux1=Declan Croghan\n|Aux2=Tim Fywell\n|OriginalAirDate=19 February 2007\n|Aux4=5.996.73\n| ShortSummary= Boyd is surprised when he receives an anonymous package containing a Nazi ceremonial dagger, which has a cold case file number attached to it. Tracking down the file, he discovers that the case is that of a young girl found stabbed to death on an East London street in May 1945. Boyd discovers that the last person to look at the file was his former colleague Mel Silver, two weeks before her death, and that the pendant sent to Mel after her death belonged to the young girl in question. Discovering that the dagger is in fact the murder weapon, Boyd finds out that it was found by two Polish builders working for the Dusniak family, who then took it to a dealer who is subsequently murdered. After a Mossad agent becomes actively involved in the case, Boyd progressively realizes that the Dusniak family may not be who they claim to be. The family's solicitor, Dennis Holland, admits to Boyd that the head of the family, Abigail forced him to witness her father, Marek, signing over powers of attorney to her, shortly before his death by suicide with a cyanide pill. And when Abigail's grandson, Ben, disappears from the local Synagogue, new revelations link the case to some of the darkest events of 65 years before.\nClaire Goose as Detective Sergeant Mel Silver appears in flashback sequences (actually footage from the Series 4 episode \"Shadowplay\").\nFeaturing Michelle Forbes as Sarah, Eileen Atkins as Abigail Dusniak, Pip Torrens as Dennis Holland, Jim Norton as David Dusniak, and Bo Poraj as Viktor Cyrak.\n|LineColor=EBD704\n}}\n|}\nSeries 7 (2008)\n{| class=\"wikitable plainrowheaders\" style=\"width:100%;\"\n|- style=\"color:#ffffff;\"\n! style=\"background:#43C210;\"| Episode\n! style=\"background:#43C210;\"| Title\n! style=\"background:#43C210;\"| Directed by\n! style=\"background:#43C210;\"| Written by\n! style=\"background:#43C210;\"| Original airdate\n! style=\"background:#43C210;\"| Viewers(millions)\n| Aux1= Tim Fywell\n| Aux2= Declan Croghan\n| OriginalAirDate=\n| Aux4= 7.197.12\n| ShortSummary= When the investigation into a woman defending her daughter from a mugger throws up a link to an unsolved murder from 1993, Boyd and the team investigate. Evidence of a video cassette at the scene leads them to suspect a case involving prostitution, sexual violence and snuff movies, but when the DNA of the woman defending her daughter turns out to belong to Lore Dutana, a Basque national with links to ETA, Boyd suspects that he has unearthed the remains of a terrorist cell. And when Lore goes on the run, the team unearth even more secrets, including links to an Algerian pimp known as BB, who may not exactly be who he says he is. However, little does Lore suspect that one of her old allies, Una Doyle, is out for revenge, and that her children are in danger. As the mystery begins to reveal itself, stories of terrorist organisations training together at an army camp in Libya proves to be the link between the victim, Lore and Una. Boyd attempts to smoke out Una and discover the real truth about what happened that night, and who is responsible for the unsolved 1993 death. In this episode, Boyd finds his son, Luke, in a secure mental unit. Unable to face Luke at first, Boyd leaves without seeing him and by the time he returns to the unit at the end of this episode, Luke has disappeared once again.\nFeaturing Michelle Forbes as Sarah, Angus Wright as Stephen Carson, and George Rainsford as Luke Boyd.\n| LineColor=43C210\n}}\n| Aux1= Daniel Percival\n| Aux2= Declan Croghan\n| OriginalAirDate=\n| Aux4= 6.496.44\n| ShortSummary= The investigation into the murder of prison governor James Reading is re-opened after seven years when his head, missing at the time of the initial enquiry, is unearthed from the bottom of a river. At the time, two initial suspects, Michael Kelleher and Terry Ryan, were questioned, after spending time under Reading in prison. However, they had straight alibis for the night of his death, and no evidence was found at the scene to connect them to the case. It soon transpires that Reading was beating and sexually abusing some of his seriously ill inmates, but before Boyd can get to Michael Kelleher, he escapes on a routine visit to hospital, and then, with the help of his old adversary, kidnaps the prison psychiatrist, who he believes is responsible for the disappearance of six former inmates after they were released. On the trail of Kelleher, Eve finds the burial site of the six bodies, as well as the freshly buried body of Kelleher's friend, Ryan. When Boyd discovers the true identity of the killer, he races to the seaside in the hope of finding the prison doctor. At the beginning of this episode, Boyd finds Luke's cell phone in an abandoned warehouse but not Luke. In the final sequence, father and son are briefly reunited in a shockingly revealing scene but separated again as Luke runs away from Boyd.\nFeaturing David Schofield as Michael Kelleher, Michael Maloney as Dr Damien Hooper, Ruth Gemmell as Linda Cummings, Alexandra Moen as Cathy Reading, Gregg Chillin as Nabil, and George Rainsford as Luke Boyd.\n| LineColor=43C210\n}}\n| Aux1= Robert Bierman\n| Aux2= Adrian Mead\n| OriginalAirDate=\n| Aux4= 7.066.39\n| ShortSummary= When one of the hands belonging to a mutilated body is found by a dog in a wood, a two-year-old unsolved murder is re-opened, in the hope of identifying the victim. Initially, the team suspects the victim to be Francis Duggan, a soldier who disappeared six months after his tour of duty in Iraq and has never been seen since. However, medical records prove that Duggan is not the victim, and for long, Duggan re-appears to attend to his terminally ill mother. New evidence shows the victim to be Mark Bennett, a soldier with a grievance after his corporal slept with his girlfriend behind his back. The team also finds out about the possible involvement of a Blackwater-like British security firm led by a retired Colonel. The night of the regimental dinner proves to be the key in the entire investigation, but it soon transpires that Bennett had bigger fish to fry than his corporal. And when a woman from Iraq turns up, wanting to prove that the soldiers were working for an Iraqi war-lord who had her son killed, the real truth behind Bennett's beef begins to come to light. After Duggan is shot dead to prevent him from talking, Boyd discovers the real suspect for Mark Bennett's murder. Throughout the episode, Boyd is haunted by memories of his encounter with Luke at the end of the previous episode, with Grace starting to try to get involved in the search for Luke.\nFeaturing Rupert Graves as John Garret, Nicholas Farrell as Colonel Douglas Malham, Jamie Sives as Corporal Robert Lomax, Holliday Grainger as Nicola Bennet, Lorraine Stanley as Susan Carlyle, George Rainsford as Luke Boyd and Stefan Kalipha as Mushrat Badawi.\nAfter the episode was filmed but before it aired, it surfaced that the head of a real-life British security firm bore a name very similar to the retired Colonel heading the fictional Blackwater-like security firm in the episode. Both parts of the episode, when aired, and later DVD releases had a disclaimer added before the opening credits, stressing the totally coincidental nature of the similarity.\n| LineColor=43C210\n}}\n| Aux1= Edward Bennett\n| Aux2= Clive Bradley & Declan Croghan\n| OriginalAirDate=\n| Aux4= 6.426.46\n| ShortSummary= Construction workers in an underground car park disturb a twenty-year-old corpse in an air ventilation system, leading Boyd and the team to investigate. The man is soon identified as George Andrews, a neo-Nazi skinhead who was a member of the local right-wing activist group alongside thug leader Jim Brown. Eve discovers a picture of a man was shoved down his throat shortly before his death, and the photo is identified as Charles Aniyeke, the only victim of a hospice fire in 1990 from which he was unable to escape. Boyd soon discovers that Andrews was in fact Sam Cohen, Aniyeke's lover, who was not an actual neo-Nazi but infiltrated the gang in order to get the evidence – a videotape – of the gang killing Aniyeke. However, the investigation takes an unexpected turn when Brown kidnaps a young Muslim who has been having an affair with his daughter. The team is forced to race against time to find the location of the missing boy, while also having to discover the reason why every single member of the neo-Nazi gang is going to die from AIDS. Meanwhile, Boyd finds out about Luke's whereabouts and has him committed to rehab. An unforeseen clash happens between Boyd and Jordan when Boyd defends his liberal views while Jordan comes close to admitting he shares the views on law and order of a far-right party whose candidate in a by-election is one of the protagonists of the case.\nFeaturing Philip Whitchurch as Jim Brown, Cyril Nri as Fr Raymond Ayanike, Russell Boulter as Martin Armstrong, Kelly Hunter as Marie Waters and George Rainsford as Luke Boyd.\n| LineColor=43C210\n}}\n| Aux1= Sam Miller\n| Aux2= Paul Farrell\n| OriginalAirDate=\n| Aux4= 6.696.50\n| ShortSummary= The discovery of a corpse in a disused tunnel beside a motorway leads the team to investigate the twelve-year-old murder of Christopher Deardon, who disappeared in 1996 after supposedly leaving the country for an international conference, but actually never left, and instead vanished into thin air. Boyd believes the case may be linked to a number of protests, which occurred the year before, as the protestors regularly used the tunnels to sleep or camp in. However, Grace suspects that Deardon's death may be a ritualistic killing, a fact which Boyd is sceptical of at first. When the three friends from Deardon's pub quiz team, the Awkward Squad, are all sent letters with the words 'time to pay' on the front, they all start to remember the tragic events that occurred that night and begin hallucinating and seeing Deardon's ghost. When two of the three men, Josh Findlay and Harold Bloom, die of heart attacks after having convulsions, the third man is forced to come clean about what really happened, which forces Deardon's son to resent one of his idols. In the closing scene, a devastated Eve informs Boyd that Luke has been found dead from a heroin overdose.\nFeaturing Lorcan Cranitch as Victor Coleridge, Ian Puleston-Davies as Harold Bloom, Christopher Fulford as Josh Findlay, Ralph Ineson as Frank Monk and George Rainsford as Luke Boyd.\n| LineColor=43C210\n}}\n| Aux1= Philippa Langdale\n| Aux2= Declan Croghan\n| OriginalAirDate=\n| Aux4= 6.606.53\n| ShortSummary= DNA taken from the scene of a road accident flags up when it is discovered to have appeared on the shawl of a mother shot dead in Bosnia in 1995. Eve takes a particular personal interest in the case, having excavated mass graves in the region, and having discovered the body of the victim herself. The key to the road traffic accident is discovered to be the homeless girl who questioned Boyd in \"Missing Persons\", and who happens to have known Luke when he was living on the streets. During the first part of the episode, it becomes clear that neither Boyd nor Eve has informed the rest of the team of Luke's death. Boyd cannot even deal with the funeral arrangements, leaving Eve to sort it out with the mortuary, which proves too much of a burden for her. When Eve manages to identify the contents of a stolen handbag, the team stumble upon a hospital laboratory worker, Anna, using the laboratory to store pure samples of heroin, to be used in a major drug deal. However, the two men she is working with lose their cool when Boyd and the team come hot on their tail and use Anna as bait to allow themselves some time, and get to their real target – a North London cafe owner whose activities during the Balkans War are somewhat questionable. When both suspects are hauled in, it is a simple matter of uncovering who is responsible for the murder of the mother and child found in the mass grave. The unravelling of the case prompts Boyd to deal with his own grief and he is last seen claiming Luke's body from the mortuary.\nFeaturing Sean Harris as Radovan Sredinic, Jacek Koman as Max Fowler / Jovan Petropecic, Anna Madeley as Anna Vaspovic, Ron Cook as Dr. Milan Vaspovic and Branka Katić as Jasni Vaspovic.\n| LineColor=43C210\n}}\n|}\nSeries 8 (2009)\n{| class=\"wikitable plainrowheaders\" style=\"width:100%;\"\n|- style=\"color:#ffffff;\"\n! style=\"background:#260A45;\"| Episode\n! style=\"background:#260A45;\"| Title\n! style=\"background:#260A45;\"| Directed by\n! style=\"background:#260A45;\"| Written by\n! style=\"background:#260A45;\"| Original airdate\n! style=\"background:#260A45;\"| Viewers(millions)\n| Aux1=Andy Hay\n| Aux2=Declan Croghan\n| OriginalAirDate=\n| Aux4=6.866.99\n| ShortSummary= A naked woman is found wandering through woodland with no recollection of how she got there, but Boyd is more concerned that her DNA has flagged up as appearing at a murder scene in a Soho brothel in 1967. However, he has more important fish to fry, as it is discovered that three days prior to her turning up in the wood, she was kidnapped from her own home and continually raped until she provided her bank account details. Boyd unravels a plot, which involves the woman's business partner, attempting to reclaim six million pounds he lost in a dodgy stock deal, and three Turkish men, who originally invested the money and now want it back. However, a more pressing matter comes to hand, when it is discovered that the woman has an identical twin, and that the Turkish men have kidnapped her by mistake. When it is discovered that the twin was actually the one present in the brothel, the entire story begins to piece itself together. However, heartache once again comes to the forefront, as it is the end of the road for Stella, after being shot by one of the Turks. Katrina Howard, a former Detective Sergeant demoted to Police Constable for insubordination, helps resolve the case in an off-limits manner.\nLast appearance of Félicité Du Jeu as Detective Constable Stella Goodman.\nFirst appearance of Stacey Roca as Police Constable (formerly Detective Sergeant) Katrina Howard. Also featuring Sharon Maughan as Elizabeth Andrews / Michelle English, Bosco Hogan as Fr Quinn and Daniel Lapaine as Samuel Knight.\n| LineColor=260A45\n}}\n| Aux1=Dan Reed\n| Aux2=Ed Whitmore\n| OriginalAirDate=\n| Aux4=7.377.51\n| ShortSummary= Rape victim Gemma Morrison tries to kill herself after remembering the tragic events of one night, twelve years ago, when she and her little brother, Sean, were kidnapped and beaten by two men, before she was raped and he was thrown off a bridge to his death. When crime scene examiners find a card in her car with the words 'find them' written on it, and Boyd's phone number on the other side, he decides to re-open the case, much to the dismay of an unhappy Spence. However, his outlandish techniques and open DNA searches allow him to pinpoint a suspect, Jason Bloch, from whom he illegally takes a DNA sample, in order to prove Bloch was one of Gemma's rapists. Bloch refuses to identify his accomplice, so it is once more up to Boyd to use some cunning tactics and old-school methods in order to flush out the other culprit. However, just as he makes a breakthrough, Boyd's tactics come back to haunt him, with professional standards looking into his actions. Gemma then resorts to extreme tactics, leading to a showdown with the man responsible for her brother's death. Meanwhile Spencer is seen actively seeking a job outside the unit.\nIn this episode Katrina Howard (Stacey Roca), now reinstated as Detective Sergeant, becomes a full-time member of the unit.\nAlso featuring Michelle Dockery as Gemma Morrison, Ian Mercer as Jason Bloch, Rory Kinnear as James Mitcham, Kate Fleetwood as Zoe Morrison, Fiona Gillies as Miranda Bloch and Trevor Laird as DI Mike Vedder.\n| LineColor=260A45\n}}\n| Aux1=Edward Bennett\n| Aux2=Edward Bennett and Ed Whitmore\n| OriginalAirDate=\n| Aux4=7.217.32\n| ShortSummary= Eve becomes suspicious when, after a passionate night with her new lover, Stefan, she discovers he has multiple passports and identities, leading her to take an illegal DNA sample from him in order to discover who he really is. However, her plan backfires, when the sample flags up as a match to the scene of an unsolved murder, involving aid worker Briony Havers. Initially suspecting that her killing was a sex attack gone wrong, Boyd allows Eve to dig a little deeper to discover the truth. He initially suspects that Stefan and Briony were involved in people trafficking, but Eve stumbles upon the real truth: Stefan, along with Briony's ex-boyfriend James Devlin, have set up shop in a derelict hospital, and are taking organs from live victims to send to the third world in exchange for large amounts of money. With the horrific discovery of a live body farm, and discovering that Briony was implicated in the entire operation, Boyd realises that Devlin killed her after she refused to continue picking victims for him. But can Boyd catch Stefan before he dismembers Eve? Meanwhile Spencer receives a firm job offer from CID and accepts it.\nFeaturing Joseph Mawle as Stefan Kocsinski, Nigel Lindsay as Michael Devlin, Suzanne Burden as Dr Greenberg and Ariyon Bakare as Victor.\n| LineColor=260A45\n}}\n| Aux1=Daniel Percival\n| Aux2=Daniel Percival and Andrew Holden\n| OriginalAirDate=\n| Aux4=7.117.09\n| ShortSummary= Boyd receives a package from convicted killer Linda Cummings, who is now being held in a secure mental facility. The package contains a severed finger, which Eve identifies as belonging to Sandra White, a patient at Padworth who disappeared shortly after her release two years ago. However, Linda is adamant that Sandra never left, and that whoever killed her, was also responsible for the death of Dominic McCarthy, a doctor who was found in his office having supposedly committed suicide. Boyd is forced to face up to his fears and give in to Linda's games, in order to secure the information he needs to track down Sandra's killer. But little does he know that Linda has crafted a major plan in order to exact her final revenge, and during a riot, which she happily contributes to, she manages to escape, ready to carry out the final stage of her scheme. With Boyd closing in on the truth, he is forced to choose between saving Grace's life, and murdering the person who is ultimately responsible for his own son's untimely death. It's up to Boyd who lives – and who dies. Meanwhile Spencer has left the unit for a post at CID, and a young psychologist is appointed to the team as Grace's replacement while Grace undergoes treatment for cancer.\n''Featuring Gina McKee as Dr Jackie Cochran, Alexander Siddig as Dr Doshan Mohammed, Nathan Constance as David O'Neal, Barbara Marten as Penny Cain and Ruth Gemmell as the returning character of Linda Cummings.\nLast appearance of Stacey Roca as Detective Sergeant Katrina Howard.''\n| LineColor=260A45\n}}\n|}\nSeries 9 (2011)\n{| class=\"wikitable plainrowheaders\" style=\"width:100%;\"\n|- style=\"color:#ffffff;\"\n! style=\"background:#A92236;\"| Episode\n! style=\"background:#A92236;\"| Title\n! style=\"background:#A92236;\"| Directed by\n! style=\"background:#A92236;\"| Written by\n! style=\"background:#A92236;\"| Original airdate\n! style=\"background:#A92236;\"| Viewers(millions)\n| Aux1=Marc Jobst\n| Aux2=Ed Whitmore\n| OriginalAirDate=\n| Aux4= 7.117.06\n| ShortSummary= Boyd is forced to break-in a new member of the team, Detective Superintendent Sarah Cavendish, an officer of equal rank whose high-flying activities were recently grounded by a hushed-up failed operation. Spencer is back full-time with the unit after relinquishing his post with the National Crime Squad, apparently at Boyd's request. The team re-investigate the mystery of missing banker Donald Rees, who disappeared in October 2007 after withdrawing £100,000 from his bank account. Rees's car is found crashed into a tree down a ravine with blood on the airbag; the working theory is that he may have committed suicide. Donald's son Toby, daughter Miranda, and wife Julia all report having seen an elderly couple in funeral attire shortly before Donald's disappearance. The elderly couple are determined to be in possession of the missing money – but then their bodies turn up in an old paper mill and their abandoned house is burnt down with an innocent WPC inside. Spence suspects that Donald may still be alive. Boyd is convinced that Donald is not a murderer and pushes the team to make sense of all the connections in the case.\n''Featuring Cecilia Noble as Una Mason, Graham Turner as Glenn Burke, Genevieve O'Reilly as Julie Rees, Charles Edwards as Donald Rees and Janet Dibley as Denise Metcalf. First appearance of Eva Birthistle as Detective Superintendent Sarah Cavendish.''\n| LineColor=A92236\n}}\n| Aux1=Edward Bennett\n| Aux2=Richard Warlow\n| OriginalAirDate=\n| Aux4=7.367.21\n| ShortSummary= When a charred body from the scene of a car fire is discovered to be that of Claire Somers, a woman who disappeared from her care home twenty five-years ago when she was still a 7-year-old girl, the team investigate. When they find the remains of a hotel room key on her person, they are led to the scene of a sixteen-year-old girl tied up in the wardrobe. As the investigation into how or when the girl was kidnapped gets underway, the team discover that shortly before her death, Claire visited a local private clinic in order to obtain some pills to help her with depression. When it is discovered that the doctor of the clinic is in fact the sister of the abducted girl, the puzzle begins to piece together, but CCTV footage spurs Grace into believing that she also had a connection to the doctor in question. After discovering that a similar disappearance took place twenty five-years ago – that of a nine-year-old boy David Drew – and after the sudden death of the doctor, Boyd suspects that Claire's death has seemingly unleashed a predator – The Bag Man – straight from her childhood nightmare.\nFeaturing Alice Krige as Karen Harding, Anna Hope as Claire Somers, Philip Wright as Peter Broading, Georgina Rich as Teresa Harding and Mary Jo Randle as Trish Somers.\n| LineColor=A92236\n}}\n| Aux1=Andy Hay\n| Aux2=Ed Whitmore\n| OriginalAirDate=\n| Aux4=6.726.55\n| ShortSummary= The remains of missing political activist Piers Kennedy are found in a wall beneath London's sewer system, leading the team to re-open the case. They discover that Piers was a former marine, who after retiring from duty, discovered he was suffering from a terminal bone marrow disease, leading his last act to be to infiltrate a peace movement against nuclear weapons and trying to discredit it by hijacking a nuclear convoy on a deserted country lane one night in 1983. The trouble is, however, of the four people involved with the hijack, two are already dead – Piers and one of his college associates, Hugo Christie – and the killer is on the look-out for the third perpetrator, Hugo's sister, Lucy. Discovering that the entire case may be built around the fact that the other perpetrator, Murray Stuart, who murdered an MOD policeman at the scene, has a videotape of the entire incident. The problem is, however, that Murray and Grace were lovers back in the day, forcing Boyd to use Grace as bait to lure Murray out of hiding, and discover the truth behind Piers' brutal murder.\nFeaturing Adam Rayner as Piers Kennedy, Frances Tomelty as MI5 Agent Jane Hussey, Anna Chancellor as Lucy Christie, John Shrapnel as John Christie and Jack Shepherd as Ralph Palmer.\n| LineColor=A92236\n}}\n| Aux1=Tim Fywell\n| Aux2=Timothy Prager\n| OriginalAirDate=\n| Aux4=7.206.73\n| ShortSummary= The investigation into the disappearance of medical student Karl Barclay is re-opened when his DNA is connected to an unidentified corpse found in a reservoir six years ago. Unable to understand why his DNA had never been entered into the database, and the even weirder fact that his body had been cremated just two weeks after it was found, Sarah discovers that Karl had been on a watchlist as a possible national threat, following the 7/7 bombings in London, and the fact that his mother reported him to the authorities following his conversion to Islam after he fell in love with a Muslim girl, Naz. Suspecting that he may have been part of a terrorist cell, Boyd discovers that his peers have taken false identities, meaning that not even Karl knew exactly who he was dealing with. Discovering that Naz was actually an informant for the secret services, on the request of fellow lover Mohammed, Boyd uncovers what really happened on the night of Karl's death. But the security services are determined to prevent Boyd from blowing the whistle, and hatch a dangerous plan to take him out. An unexpected consequence is the revelation of the true circumstances of Sarah's dismissal from Counter Terrorism.\nFeaturing Claire Benedict as Lisbetta Barclay, Don Warrington as Gideon Barclay, Tom Goodman-Hill as Tristin, Ashley Chin as Jakob Barclay, Amber Agha as Nazeem Ahmed, Clive Wood as John Carney and Babatunde Aleshe as Karl Barclay.\n| LineColor=A92236\n}}\n| Aux1=Andy Hay\n| Aux2=Ed Whitmore\n| OriginalAirDate=\n| Aux4=7.037.24\n| ShortSummary= Boyd is informed by Deputy Chief Commissioner Maureen Smith that his time at the cold case unit is about to run out, and that the Met are interested in relocating him into a teaching post. Angered by the decision, he decides his last case at the unit will be re-investigating his very first – the disappearance of sixteen homeless boys from the Waterloo Bridge area between 1979 and 1982. Although he had not managed to make any headway the first time round, a search of records of unidentified bodies finds a match to one of the missing boys, Pele. And further investigation leads the team directly to a torture chamber just south of the M11. However, when Eve discovers evidence that relates to another murder, Boyd finds himself entangled in a chain of events involving a prisoner being beaten to death, the killing of three police officers, the death of the sixteen boys and an Assistant Commissioner trying to protect the killer. And when he is framed for Sarah's murder, Boyd realises that time is finally running out, and that he must use his knowledge to fight for justice against a powerful adversary.\nFeaturing George Rainsford as Luke Boyd (in flashback sequences taken from Series 7 footage), Elizabeth Rider as Deputy Chief Commissioner Maureen Smith, Paul McGann as Assistant Chief Commissioner Anthony Nicholson, David Bradley as George Barlow and Louis Mahoney as Reverend Dennis Grant.\n| LineColor=A92236\n}}\n|}\nReferences"
    }
  ]
}