{
  "content": [
    {
      "type": "text",
      "text": "# List of Russian submissions for the Academy Award for Best International Feature Film\n\nRussia has submitted films for the American Academy Award for Best International Feature Film}} since 1992. Prior to that, Russian SFSR-produced films formed the vast majority of motion pictures submitted by the former Soviet Union. The Foreign Language Film award is handed out annually by the U.S.-based Academy of Motion Picture Arts and Sciences to a feature-length motion picture produced outside the United States that contains primarily non-English dialogue. Each year, the Academy invites countries to submit their best films for competition, with only one film being accepted from each country.\nBefore 1992, most of the films submitted by the Soviet Union were Russian. Eight of them were nominated, including three winners – War and Peace, Dersu Uzala and Moscow Does Not Believe in Tears.\nAs of 2025, Russia has been nominated seven times, and won once for Burnt by the Sun.\nSubmissions\nwas the first post-Soviet Russian director to win the award, for Burnt by the Sun.]]\nThe Academy of Motion Picture Arts and Sciences has invited the film industries of various countries to submit their best film for the Academy Award for Best Foreign Language Film since 1956. The Foreign Language Film Award Committee oversees the process and reviews all the submitted films. Following this, they vote via secret ballot to determine the five nominees for the award. Below is a list of the films that have been submitted by Russia for review by the Academy since 1992. All Russian submissions were filmed mostly in Russian.\nNikita Mikhalkov has been chosen to represent Russia five times. While The Barber of Siberia was disqualified when the print did not arrive in Los Angeles in time, three other films were nominated for an Oscar.\nIn 2022, Russia's Oscar Committee, headed by Pavel Chukhray, confirmed its intention to submit a film. However, days later, the Russian Film Academy announced they would not enter. Chukhray resigned in protest and said he was not consulted about the decision. Nikita Mikhalkov, alluding to the United States' reaction to the 2022 Russian invasion of Ukraine, had previously said, \"The way I see it, choosing a film that will represent Russia in a country that, in fact, now denies the existence of Russia, is simply pointless.\"\n{| class=\"wikitable\" style=\"background:#ffffff;\" width=\"98%\"\n|-\n! Year(Ceremony)\n! Film title used in nomination\n! Original title\n! Director\n! Result\n|-\n! 1992(65th)\n| Close to Eden\n| Урга\n|\n|\n|-\n! 1994(67th)\n| Burnt by the Sun\n| Утомлённые солнцем\n|\n|\n|-\n! 1995(68th)\n| A Moslem\n| Мусульманин\n|\n|\n|-\n! 1996(69th)\n| Prisoner of the Mountains\n| Кавказский пленник\n|\n|\n|-\n! 1997(70th)\n| The Thief\n| Вор\n|\n|\n|-\n! 1998(71st)\n| The Barber of Siberia\n| Сибирский цирюльник\n|\n|\n|-\n! 1999(72nd)\n| Moloch\n| Молох\n|\n|\n|-\n! 2000(73rd)\n| ''His Wife's Diary\n| Дневник его жены\n|\n|\n|-\n! 2001(74th)\n| The Romanovs: An Imperial Family\n| Романовы - Венценосная семья\n|\n|\n|-\n! 2002(75th)\n| House of Fools\n| Дом дураков\n| Andrei Konchalovsky\n|\n|-\n! 2003(76th)\n| The Return\n| Возвращение\n| Andrey Zvyagintsev\n|\n|-\n! 2004(77th)\n| Night Watch\n| Ночной дозор\n|\n|\n|-\n! 2005(78th)\n| The Italian\n| Итальянец\n|\n|\n|-\n! 2006(79th)\n| 9th Company\n| 9 рота\n|\n|\n|-\n! 2007(80th)\n| colspan=\"2\" | 12\n|\n|\n|-\n! 2008(81st)\n| Mermaid\n| Русалка\n|\n|\n|-\n! 2009(82nd)\n| Ward No. 6\n| Палата №6\n| Aleksandr Gornovsky and Karen Shakhnazarov\n|\n|-\n! 2010(83rd)\n| The Edge\n| Край\n|\n|\n|-\n! 2011(84th)\n| Burnt by the Sun 3: The Citadel\n| Утомлённые солнцем 2: Цитадель\n|\n|\n|-\n! 2012(85th)\n| White Tiger\n| Белый тигр\n|\n|\n|-\n! 2013(86th)\n| Stalingrad\n| Сталинград\n|\n|\n|-\n! 2014(87th)\n| Leviathan\n| Левиафан\n| Andrey Zvyagintsev\n|\n|-\n! 2015(88th)\n| Sunstroke\n| Солнечный удар\n| Nikita Mikhalkov\n|\n|-\n! 2016(89th)\n| Paradise\n| Рай\n| Andrei Konchalovsky\n|\n|-\n! 2017(90th)\n| Loveless\n| Нелюбовь\n| Andrey Zvyagintsev\n|\n|-\n! 2018(91st)\n| Sobibor\n| Собибор\n| Konstantin Khabensky\n|\n|-\n! 2019(92nd)\n| Beanpole\n| Дылда\n| Kantemir Balagov\n|\n|-\n! 2020(93rd)\n| Dear Comrades!\n| Дорогие товарищи!\n| Andrei Konchalovsky\n|\n|-\n! 2021(94th)\n| Unclenching the Fists''\n| Разжимая кулаки\n| Kira Kovalenko\n|\n|}\nSee also\n* List of Academy Award winners and nominees for Best International Feature Film\n* List of Soviet submissions for the Academy Award for Best International Feature Film\n* List of Russian Academy Award winners and nominees\n* Cinema of Russia\n* Cinema of the Soviet Union\nNotes\nReferences"
    }
  ]
}