{
  "content": [
    {
      "type": "text",
      "text": "# List of fictional United States presidencies of historical figures (E–G)\n\n}}\nThe following is a list of real or historical people who have been portrayed as President of the United States in fiction, although they did not hold the office in real life. This is done either as an alternate history scenario, or occasionally for humorous purposes. Also included are actual US Presidents with a fictional presidency at a different time and/or under different circumstances than the one in actual history.\nE\nThomas Edison\n* Thomas Edison is elected as the 27th president in 1908 in the novel And Having Writ... by Donald R. Bensen. In this book, the aliens whose ship crashed in the Tunguska event on June 30, 1908 instead land safely in San Francisco. They create an effective hearing aid for Edison and cure the infirmities of Kaiser Wilhelm II and Tsarevich Alexei, the son of Tsar Nicholas II. Edison is nominated by the Republicans over Secretary of War William Howard Taft and elected by a technology-enthused public. After pursuing the aliens and their companion, H. G. Wells, across Europe, he briefly tries to imprison them in order to obtain more of their secrets, but later relents. President Edison chooses not to run for a second term in 1912 and would rather go back to inventing. Later that year, former president Theodore Roosevelt would be reelected and would serve as the 28th President until 1921.\nDavid Eisenhower\n* David Eisenhower, the grandson of the real-life president Dwight D. Eisenhower, was president in the 1976 film Tunnelvision (set in 1985), and a former president in 1997 in Americathon. Both films were directed by Neal Israel.\nDwight D. Eisenhower\n* In Poul Anderson's The Psychotechnic League, Dwight Eisenhower died from surgical complications in June 1956 and was succeeded by his 43-year-old vice president Richard Nixon, who became the 35th president. Only a few years removed from his active participation in the House Un-American Activities Committee and with his anti-Communist zeal untampered by the pragmatism which he might have gained in later life, President Nixon embarked on a wild, provocative and confrontational policy with respect to the Soviet Union. By 1958, this resulted in a worldwide nuclear war, in which Nixon himself was killed along with hundreds of millions of other people.\n* In one of the alternate timelines featured in Michael P. Kube-McDowell's novel Alternities, Dwight Eisenhower was killed in a plane crash in 1951. Senator Robert A. Taft of Ohio was elected as the 34th president in 1952. President Taft pursued a policy of isolationism which allowed the Soviet Union to emerge as the dominant superpower. Taft subsequently died shortly into his term in office.\n* In another of the alternate timelines featured in Michael P. Kube-McDowell's novel Alternities, Dwight Eisenhower lost his bid for re-election in 1956 to Adlai Stevenson. President Stevenson was re-elected in 1960, though he would later describe his second term as a curse.\n* In the alternate history short story \"We Could Do Worse\" by Gregory Benford, Senator Robert A. Taft secured the Republican presidential nomination at the 1952 Republican National Convention, narrowly beating Dwight Eisenhower, with the support of the California delegation which was delivered by Senator Richard Nixon. In the election the following November, Taft defeated Adlai Stevenson and was inaugurated as the 34th president on January 20, 1953. However, after only six months in office, President Taft died of a heart attack on July 31, 1953, as occurred in reality. He was succeeded by his vice president Joseph McCarthy, who went on to create a brutal dictatorship in the United States.\n* In the alternate history short story \"The Impeachment of Adlai Stevenson\" by David Gerrold included in the anthology Alternate Presidents edited by Mike Resnick, Dwight Eisenhower was defeated by his Democratic opponent Adlai Stevenson, the Governor of Illinois, in 1952 after he made the mistake of accepting Joseph McCarthy as his running mate instead of Richard Nixon. He successfully ran for re-election in 1956, once again defeating General Eisenhower. However, Stevenson proved to be an extremely unpopular president. As the title of the story implies, Stevenson, the 34th president, was impeached during his second term in August 1958 and resigned, leaving his untested 41-year-old Vice-President, John F. Kennedy, as his successor. Kennedy was considered something of a laughing stock, having recently married the Hollywood actress Marilyn Monroe. This lead satirists to dub the marriage \"the new Monroe Doctrine.\" Although the story ends immediately after Stevenson has decided to resign, it is heavily implied that Nixon, already the front runner for the next Republican nomination, will defeat Kennedy in the 1960 election. This is due to the public's antipathy towards the Democrats and the fact that Kennedy is a much derided figure due to his marriage to Monroe.\n* In the HBO television adaptation of the alternate history novel Fatherland by Robert Harris, General Eisenhower, the Supreme Commander of the Allied Forces in Europe, oversaw the landing operations of the Allied invasion of Normandy, the first phase of Operation Overlord during World War II, on June 6, 1944, which were successfully defeated and repelled by Nazi Germany's forces. Consequently, the United States turned its back on the Western Front and focused its attention on defeating Japan, allowing Germany the necessary time to regroup, annex Western and Southern Europe and therefore win the war. After the failure of the D-Day invasion, Eisenhower returned to the United States and retired in disgrace.\n* In Eric Norden's Dystopian Alternate History novel The Ultimate Solution, Nazi Germany developed nuclear bombs while  the US did not have them. Germany demonstrated the terrible power in its hands by bombing and destroying Chicago. General Dwight Eisenhower was part of the faction favoring a surrender to the Germans, in order to prevent more American cities being destroyed. When Generals George Patton and Douglas MacArthur opposed the surrender and tried to continue resistance to the Germans at whatever price, Eisenhower oversaw the arrest of Patton and MacArthur, who were court-martialled at the Saint Louis Trials and executed by firing squad. The book does not mention Eisenhower's later fate in Nazi-occupied America. A handful of diehard anti-Nazi fighters nicknamed \"The Patties\" continued a decades-long underground struggle against the extremely harsh Nazi occupation regime, with covert support from Imperial Japan which entered a tense cold war with its erstwhile Nazi ally; The Patties recalled Eisenhower as the most despicable of traitors, on a par with Judas Iscariot and Benedict Arnold.\n* In a parallel universe featured in the Sliders Season Five episode \"The Return of Maggie Beckett\",  the German forces broke through the Allied lines at the Battle of the Bulge in 1944, which caused World War II to drag on until 1947. General Eisenhower was relieved as the Supreme Commander of the Allied Forces in Europe and returned to the United States in disgrace. Consequently, Adlai Stevenson became president. The Stevenson administration made the Roswell incident in July 1947 public knowledge and signed the Reticulan-American Free Trade Agreement (RAFTA), giving the US access to advanced Reticulan technology. This led to a human mission to Mars in the 1990s.\n* In the 2015 alternate history novel Joe Steele by Harry Turtledove, Dwight Eisenhower was a prominent American military leader, who rose to the rank of general during the dictatorial reign of President Joe Steele, and proved instrumental to the country's victory over Japan in the Pacific Theater during World War II. In 1934, Major Eisenhower came to prominence as part of the military tribunal that presided over the trial of the Supreme Court Four. After surviving the purges of the 1930s, he and Admiral Chester W. Nimitz planned and executed the operation that took control of the Solomon Islands from the Japanese during World War II. He then planned and executed the capture of Tarawa, Saipan, Angaur, Iwo Jima and Okinawa. Eisenhower then planned and executed Operation Downfall which was executed in two parts: Operation: Olympic and Operation: Coronet. The war ended with the death of Emperor Hirohito and ascension of his twelve-year-old son Akihito who, while nominally the head of state, became a puppet to Eisenhower. Eisenhower remained part of the Steele Administration during and after the Japanese War. The Republican Party tried to recruit both Eisenhower and Omar Bradley as potential presidential nominee in 1952, but both Bradley and Eisenhower (after some prompting from Joe Steele's allies) declined with Eisenhower stating that politics was no place for soldiers. The Republicans chose Robert Taft as their candidate, who in turn lost to Steele in the general election.\n* In the Worldwar series novel Upsetting the Balance by Harry Turtledove, Dwight Eisenhower was a prominent general during World War II and the war against the Race's Conquest Fleet. In 1944, he traveled through Missouri with Albert Einstein, Benito Mussolini, Robert Goddard, Sam Yeager, Ullhass, and Ristin. As the war wound down, Eisenhower led a successful counter-offensive against the Race's toehold within the state.\n* In Harry Turtledove's alternate history novel The Man with the Iron Heart, General Dwight \"Ike\" Eisenhower became the senior United States Army official on the ground in Allied-occupied Germany after the end of World War II. He was firmly in favor of a continued American occupation of the country, even after the German Freedom Front began inflicting massive casualties upon Allied troops, and the will of the American people began to erode. Nonetheless, the possibility that Eisenhower might be the Republican Party's choice to run against President Harry S. Truman in 1948 was already being floated in 1946 around the time he was transferred back home and was succeeded by General Lucius D. Clay.\n* In Harry Turtledove's Hot War series, where the Korean War escalates into World War III, Dwight Eisenhower was being bandied about as the Republican presidential nominee for the 1952 election. In May 1951, as World War III was underway, incumbent President Harry S. Truman reflected on Eisenhower as possible president, finding him an amiable but lightweight executive better fit to run a car company rather than a country. Despite this, Truman found Eisenhower a more palatable choice than Senator Joseph McCarthy, who was slowly getting his own campaign underway. Throughout the remainder of 1951, Eisenhower still seemed to be viable, but McCarthy's increasingly heated rhetoric seemed to be gaining support. Still, Eisenhower's role in World War II did seem to give him an edge over many of his Republican rivals such as McCarthy and Robert Taft, to say nothing of the Democrats as a whole. The course of the war changed the political calculus completely, when most of the contenders for the presidency were killed by the Soviet atomic bombing of Washington, D.C. in May 1952. As Eisenhower was not in Washington at the time, it seemed likely he would become the Republican nominee by default.\n* In the short story \"An Old Man's Summer\" by Esther Friesner in the anthology Alternate Generals edited by Harry Turtledove and Roland J. Green, President Dwight D. Eisenhower travels through a time portal to 1863 and witnesses the Battle of Gettysburg.\n* In the short story \"I Shall Return\" by John Mina in the anthology Alternate Generals III edited by Harry Turtledove, General Dwight D. Eisenhower alongside George Patton and Jimmy Doolittle end up garrison in the Battle of the Philippines in December 1941 rather than in Europe.\nJoycelyn Elders\n* In a parallel universe featured in the Sliders Season One episode \"Luck of the Draw\", Joycelyn Elders was president in 1995. In this universe as in real life, the 18th-century English economist Reverend Thomas Robert Malthus published his highly influential An Essay on the Principle of Population which warned that humanity would be condemned to misery and poverty because the rate of population growth would increase faster than the rate of food supply. Taking Malthus' theory seriously, the inhabitants of this version of Earth managed to keep the world population down to 500,000,000. San Francisco had a population of less than 100,000 people, giving it the feel of a small city rather than a major metropolis. The population was maintained at this low level through heavy emphasis on birth control (provided in the form of soft drinks) and the Lottery system. The Lottery itself worked like an ATM except that people asked for money from it. The more money a person asked for, the higher the chance that he/she would be chosen to participate in a euthanasia program which rewarded the beneficiaries of those who chose to \"make way\". Pro-life movements swept across the United States to fight the Lottery. While the manner of death was humane, protesters believed that population could be controlled through other means. President Elders did not agree with this assessment and the Lottery system continued unabated as of 1996.\nF\nGeraldine Ferraro\n* In the short story \"Bloody Bunnies\" by Bradley Denton contained in The Magazine of Fantasy & Science Fiction, the Denton of an alternate timeline finds himself trapped in our universe. It is implied that he became a kind of walk-in spirit, his consciousness entering the body of his counterpart after his original body died in a car accident. Denton refers to former President Geraldine Ferraro several times. One of her many accomplishments was \"the Universal Health Care and Child-Proof Trigger Lock Initiative\".\nGuy Fieri\n* In The Simpsons \"Treehouse of Horror XXXIV\" segment \"Lout Break\", Homer Simpson's likeness, mannerisms and low intelligence became symptoms of a highly infectious disease resulting from him eating a doughnut covered in radioactive waste and the DNA of assorted animals. After Homer refused to allow Professor Frink to use his DNA to develop a cure, the disease spread worldwide, infecting the global population apart from Bart, Lisa, and Maggie Simpson (who were seemingly immune). As a result of this, Guy Fieri was elected president.\nMillard Fillmore\n* In the short story \"How the South Preserved the Union\" by Ralph Roberts contained in the anthology Alternate Presidents edited by Mike Resnick, General Zachary Taylor was elected as the 12th president in 1848 with Millard Fillmore as his running mate, as happened in real life. Shortly after taking office, however, both he and President Taylor were killed in a carriage accident. Taylor was succeeded by David Rice Atchison, the President pro tempore of the United States Senate and a prominent pro-slavery activist, who became the 13th president. Shortly after President Atchison's accession, the American Civil War broke out on April 17, 1849, with the secession of Massachusetts from the Union and the Second Battle of Lexington and Concord, from which the rebelling abolitionists, who styled themselves as the New Minutemen, emerged victorious. New Hampshire and Vermont seceded shortly thereafter and were soon followed by the three remaining New England states, New York, New Jersey and Pennsylvania. The seceding Northeastern states banded together to form the New England Confederacy with Daniel Webster as its first and only president and the revolutionary abolitionist John Brown as the commander of its army. The war came to an end in 1855, two years after President Atchison had issued a proclamation promising that any slave who fought in the United States Army would be granted his freedom following the end of the war and that any factory slave who worked satisfactorily would be granted his or her freedom after the war and would be paid for that work from then onwards. Stephen Douglas succeeded Atchison as the 14th president after being elected in 1860 and introduced the Civil Rights Act 1861 which brought an end to slavery in the United States in its entirety.\n* In the short story \"Now Falls the Cold, Cold Night\" by Jack L. Chalker, also contained in the anthology Alternate Presidents edited by Mike Resnick, Millard Fillmore was elected the Know Nothing Party candidate in 1856, defeating the Democratic candidate James Buchanan (who had suffered a stroke in October) and the Republican candidate John C. Frémont. He therefore became the 15th president, having previously served as the 13th president from 1850 to 1853 as a member of the Whig Party. His vice president was Andrew Jackson Donelson, the namesake nephew of former president Andrew Jackson. When Fillmore upholds the Fugitive slave laws in 1858, this resulted in ethnic tensions and riots in New England that lead it to secede from the Union. John C. Frémont becomes President of the New England Confederacy with William Tecumseh Sherman as his commanding general, opposed by the Army of the United States under Robert E. Lee.\nGerald Ford\n* In one of the timelines featured in the novel Replay by Ken Grimwood, Gerald Ford was defeated by Ronald Reagan, the former Governor of California, in the Republican Party's presidential primaries in 1976. Reagan went on to defeat his Democratic opponent Jimmy Carter in the 1976 election, taking office as the 39th president on January 20, 1977. In November 1979, President Reagan went to war with Iran over the hostage crisis.\n* In the alternate history short story \"Demarche to Iran\" by Alexis A. Gilliland contained in the anthology Alternate Presidents edited by Mike Resnick, Gerald Ford defeated his Democratic opponent Jimmy Carter in the 1976 election after he gave former president Richard Nixon a specific, rather than general, pardon, thus keeping his popularity high enough that he was reelected president. Illinois shifted from Democrat to Republican after the second recount is also a result of Ford's victory. His vice president was Bob Dole. As he had served more than two years of his predecessor Richard Nixon's second term, he was not eligible to run for re-election in the 1980 presidential election. On November 4, 1979, militant Iranian students who supported the Iranian Revolution took 63 American citizens hostage after seizing control of the US Embassy in Tehran. Although his Chief of Staff Dick Cheney suggested seizing Iranian bank accounts, Ford was convinced by his masseur to present the Iranian ambassador, Doctor Mehdi Haeri Yazdi, with a démarche threatening to sever diplomatic relations with Iran if the hostages were not returned within three days. He did so over the initial objections of two key members of his cabinet. Henry Kissinger, the Secretary of State, was concerned that war with Iran would result if the Ayatollah Ruhollah Khomeini ignored the démarche and the negative impact that this would have on Soviet Union–United States relations. He also reminded the President that, in spite of the Ayatollah, Iran was a friendly nation as well as the United States’ only bulwark against the USSR in the Persian Gulf. Donald Rumsfeld, the Secretary of Defense, believed that a war would cost the Republicans the 1980 election. As Kissinger predicted, the Ayatollah initially ignored the démarche. As he explained to President Abolhassan Banisadr and General Mohammed Suliman, he was willing to accept the possibility of war with the United States as he believed that the Americans would eventually lose heart or a new president would be elected. During a press conference in the Rose Garden of the White House, the President failed to remember that Iran was not a naval power and instead referred to nuclear weapons. This remark was interpreted by the American media, the Iranian authorities and the rest of the world as Ford voicing his intention to use such weapons on Iran if the hostages were not returned by the expiration of the démarche. Within hours, the Soviet Union and the People’s Republic of China issued strong diplomatic protests over the comment. It also resulted in one million people protesting at a demonstration in London, one and a half million people protesting at a similar demonstration in Tokyo and the US embassies in Pakistan, Syria and Iran being burned. The Ayatollah did not take this threat seriously and instructed the newly appointed Minister of the Interior Akbar Hashemi Rafsanjani to appear on live television in front of the US Embassy and tell the Iranian people that they would stand resolute in the face of American provocation. However, Rafsanjani was attacked by protesters fearful of a nuclear strike and was strangled with his own turban. His death was televised and shown all over the world. This incident convinced the Ayatollah Khomeini to back down and order the students to release the hostages. Although all 63 hostages were released unharmed only four days after they were captured, Ford was severely criticized for threatening to use nuclear weapon on a non-nuclear, friendly nation, a costly mistake which permanently alienated Iran from the United States’ cause. It was regarded as being as serious a failure for American diplomacy as the Vietnam War had been for American arms. The incident came to be seen as \"the most serious of many blunders committed by President Ford during his term of office.\"\n* In the alternate history novella trilogy Then Everything Changed by Jeff Greenfield, Gerald Ford wins the 1976 election after clarifying his statement that \"there is no Soviet domination of Eastern Europe and there never will be under a Ford administration\" during the second presidential debate. Narrowly winning the electoral votes of Ohio and Mississippi in part due to support from Eastern European Americans to win the Electoral College by 272 to 266, Ford loses the popular vote to Jimmy Carter by about 1,500,000 votes, prompting freshman congressman Al Gore to propose a constitutional amendment abolishing the Electoral College. While the Ford administration is able to orchestrate the exile to France and covert assassination of Ayatollah Ruhollah Khomeini and pressure the dying Shah Mohammad Reza Pahlavi to abdicate to bring about a moderate quietist regime under Hussein-Ali Montazeri in Iran, this antagonises Saudi Arabia into declaring an oil embargo, resulting in an energy crisis and worsening economic recession in the United States. With the Democrats in control of both houses of Congress and aggrieved with their loss in 1976, legislative impasse between Congress and the White House arose. With Ford being ineligible to run for a second full term in 1980 and deeply unpopular, he is succeeded as the Republican candidate by Ronald Reagan (with Vice President Bob Dole ending his own prospects through off-the-cuff remarks about Pope John Paul II in 1978) and as president by Democratic candidate Gary Hart. This outcome was privately favoured by Ford due to antipathy towards Reagan for his primary challenge against him and non-existent campaigning for him in 1976 and disagreement over policy and principles.\nHarrison Ford\n* Portrayed as the president in an episode in VIP\n* Referred to as a former president in the film Scary Movie 3 when current president Baxter Harris \"[wonders] what President Harrison Ford would have done\". The audience is led to believe he's referring to actual president Gerald Ford, but the portrait shows Harrison Ford's image, possibly a reference to the 1997 film Air Force One.\nMichael J. Fox\n* In the 1989 video game Mean Streets, Michael J. Fox is mentioned as being a former president. In real life, Michael J. Fox is ineligible for the presidency, as he was born in Edmonton, Alberta, Canada.\nAl Franken\n* President in Why Not Me?, a satirical novel by Al Franken himself. He was elected as the 43rd president in 2000, running as a dark horse candidate on a platform of eliminating ATM fees. He is eventually given the Democratic nomination over the incumbent vice president and early favourite Al Gore due in a rise in support when the Y2K bug solely effects ATMs. He was the first Jewish President and won in a landslide. Franken's running mate was Senator Joe Lieberman of Connecticut, making the Franken-Lieberman ticket the first all-Jewish presidential ticket since Reconstruction. President Franken suffered from severe depression and mood swings. For instance, he attacked Nelson Mandela and appointed Sandy Koufax as Secretary of Veterans Affairs. President Franken resigned after 144 days in office on June 10, 2001. In his resignation speech, he said: \"It is my fondest wish that, in the fullness of time, the American people will look back on the Franken presidency as something of a mixed bag and not as a complete disaster.\" Lieberman succeeded him as the 44th president, going on to serve a total of eighteen years in office. In stark contrast to Franken, President Lieberman was widely considered to be one of the greatest Presidents in US history. In real life, Franken went on to serve as United States Senator from Minnesota from 2009 to 2018 as a member of the Minnesota Democratic–Farmer–Labor Party. The novel, which was written in 1999, correctly predicted that Lieberman would be the Democratic vice presidential nominee in the 2000 election, though with Gore rather than Franken as the presidential candidate.\nBenjamin Franklin\n* Listed as a former president in the Doctor Who audio play Seasons of Fear.  It is unclear whether this refers to him being President in the original Doctor Who timeline or one of the fictional ones implied by the time corruption depicted in this story.\n* In the short story \"The Father of His Country\" by Jody Lynn Nye contained in the anthology Alternate Presidents edited by Mike Resnick, Benjamin Franklin was elected as the first president of the United States by the 1st United States Congress on April 6, 1789, defeating his sole opponent George Washington and achieving a clear mandate to govern in the process. In spite of the fact that Franklin was 83 years old and was rumored to have fathered numerous illegitimate children while serving as ambassador to France from 1778 to 1785, he ultimately won the election in part due to reservations voiced by prominent members of Congress such as John Hancock and Charles Thomson regarding Washington. They were concerned that it would set a bad precedent for the first president to be a general. Furthermore, Franklin's supporters stressed that he was well liked and respected by foreign heads of state friendly to the United States, had been prominent in matters of diplomacy and government at home and abroad and had already proven that he had the best interests of the nation at heart. When he was offered the presidency after his election, Franklin emulated the fictionalized Julius Caesar's stance in the Shakespearean tragedy of the same name who denied the crown of Rome three times in Act 1, Scene 2 of the play. Consequently, he only accepted the position on being offered it for the fourth time. He was inaugurated in Federal Hall in New York City on April 30, 1789. His vice president was John Adams who had supported Washington in Congress, as had his second cousin Samuel Adams. During his tenure in office, President Franklin attempted to create a more democratic society and managed to live longer than he did in real life. Shortly after taking office, he began to insist on organizing the government as if it were a business. In a letter to his wife Abigail Adams, Vice President Adams was scornful of the idea that a government \"could run with the same dispatch and efficiency as a printshop.\" However, the notion proved to be extremely popular with the citizenry as President Franklin was often surrounded by his supporters, friends and former subscribers while walking through the streets of Philadelphia. Adams believed that his role as President of the Senate would mean that the vice presidency would soon eclipse the presidency in importance and prestige. In September 1789, President Franklin made a speech decrying ambition and avarice as the two principal sins besetting the United States. The speech, which was published in the Philadelphia Gazette, was popular with Quakers, small merchants and farmers but less so with the landowners and aristocrats who made up the Congress. Congress also moved to insist that Franklin limit his writings to only the most serious of topics so as not to adversely affect the dignity of his office. Although he outwardly complied, Adams was aware that he continued to write his satires and hoaxes, which he published under various pseudonyms. One of these was a playful satire regarding Great Britain's position on trade with the United States which was attributed to a \"Mr. Newly.\" On being confronted by Adams about the piece, Franklin did not admit or deny writing it but \"his eyes twinkled with mischief.\" Losing patience with the elderly president, Adams told him that he must accede to Congress' request to cease from publishing such ephemera as the United States had gained the upper hand in its trade negotiations with Britain and did not want it to be ruined by a trivial matter. To Adams' annoyance, the Newly piece had become very popular with the general public and encouraged them to support the trade negotiations. While this proved advantageous to the government in the short-term, Adams confided in his wife that could also serve to set a precedent which he and his colleagues sought to avoid, namely allowing the public control of their government. In defiance of Congress' numerous requests, Franklin continued to publish articles using pseudonyms. In one commentary published in March 1791, the President stated that a trade agreement with Britain should be reached with great alacrity. Furthermore, Franklin attempted to manipulate the public through these articles by voicing the opinion that proposed bills should be presented to the public before being presented to Congress. This led to Adams being accosted by a tavern owner who objected to the new duty on rum. Adams was concerned that, if this trend continued, he and his fellow politicians would be forced to the indignity of consulting their constituents before voting in Congress, which he regarded as an absurd notion which would delay the workings of government. In a letter dated April 29, 1792, Adams confided in his wife Abigail that he regarded Franklin as \"a meddlesome old man\" and was privately relieved that his advanced age meant that he was coming to the end of his life. When that day came, Adams stated that he and his colleagues would be able to get on with the business of government unhindered.\n* On The Price is Right, whenever someone wins a bonus for a perfect bid, host Drew Carey jokes that \"Ben Franklin was his favorite president,\" in reference to Franklin appearing on the $100 bills given to the contestants who score the perfect bids.\n* In the comic book series Squadron Supreme , Benjamin Franklin is shown on Mount Rushmore, implying he was president in the comic’s universe.\nG\nAlbert Gallatin\n* In the alternate history novel The Probability Broach as part of the North American Confederacy Series by L. Neil Smith, Albert Gallatin intercedes in the Whiskey Rebellion in 1794 to the benefit of the farmers rather than the fledgling US Government like he did in real history. The rebellion soon escalates into a Second American Revolution. Soon, an army of farmers march into the capital Philadelphia, Pennsylvania and they overthrow and execute George Washington by firing squad for treason. After the war, Gallatin becomes the 2nd president and serves from 1794 to 1812. During his time as president, he declared the Constitution null and void, a new caretaker government is established in 1795, and a revised version of the Articles of Confederation, which severely limiting its powers and grants a much greater emphasis on individual freedom, are ratified in 1797. In 1803, he and James Monroe arranged the Louisiana Purchase from France, borrowing money from private sources against the value of the land. In 1812, he decided to retire and Edmond-Charles Genêt would become president. In 1836, Gallatin would step out of retirement and would defeat John C. Calhoun in the 1836 election, becoming the 7th president and serving from 1836 to 1840. By 1986, his likeness was minted on .999 fine gold coins. Gallatin's legacy would eventually led to the formation of the North American Confederacy in 1893.\nJames A. Garfield\n* In the alternate history novel series Southern Victory book How Few Remain by Harry Turtledove, James Garfield was a Republican senator who represented Ohio in 1882. He had been an officer in the Union Army during the War of Secession (1861–1862) and had served on a number of courts-martial. He rose to prominence by purging the Army of defeatists after the war. In 1882, Garfield was one of several prominent Republican leaders to attend a convention called by former president Abraham Lincoln in Chicago. He resisted Lincoln's proposal to replace hostility toward the Confederate States of America with workers' rights as the central plank of the party's platform, going so far as to suggest that following Lincoln's plan would cause the Republican party to split into three factions. The meeting ended with Garfield and every other delegate walking out, leaving Lincoln alone. Garfield was proved correct as the Republicans were left as a rump centrist third party after elements broke off to form the new Socialist party and to join up with the Democrats, transforming it into the major right-leaning party.\n* In the short story I Shall Have a Fight to Glory by Michael P. Kube-McDowell contained in the anthology Alternate Presidents edited by Mike Resnick, James Garfield loses the 1880 election to Samuel J. Tilden after Tilden uses underhanded tactics to win the election. However, Garfield gets help from Charles J. Guiteau (his assassin in real history) and he and Guitaeu vainly attempts to convince Tilden that they can fix the corrupted electoral system. When he declines the offer, they assassinate Tilden before he can be inaugurated as the 20th president.\nJohn Nance Garner\n* In the alternate history novel The Man in the High Castle by Philip K. Dick, John Nance Garner was, as in real life, elected as vice president in 1932 as the running mate of Franklin D. Roosevelt. However, Garner himself was inaugurated as the 32nd president on March 4, 1933 as a result of President-elect Roosevelt's assassination by Giuseppe Zangara on February 15, 1933. He was re-elected in 1936, but failed to combat the Great Depression and the United States remained strongly isolationist. He was succeeded in the 1940 election by the Republican John W. Bricker, who also failed to confront the economic and foreign policy issues. As a result of their combined presidencies, the Axis powers won World War II and invaded and conquered the United States in 1948.\n* A similar role is assigned to Garner in the history of another Nazi-victorious timeline, the unpleasant GURPS timeline known as Reich-5. In this timeline, too, Zangara succeeded in assassinating Roosevelt, John Nance Garner became President and was unable to handle the Great Depression - followed on this timeline by the equally unsuccessful Charles Lindbergh and Henry Wallace and finally leading to the far-right William Dudley Pelley become President following Lindbergh's assassination and getting elected to a full term in 1944, assuming dictatorial powers, and inviting the Nazis to conquer the US to help him against the pro-democracy resistance - ending with a Nazi-dominated world even worse than the one envisioned by Philip K. Dick.\n* In the Elseworlds one-shot comic book Superman: War of the Worlds, Vice President Garner became the 33rd president in the aftermath of the Martian invasion of 1938, in which Franklin D. Roosevelt was killed. Lex Luthor was his vice president.\n* In the 2003 alternate history short story \"Joe Steele\" by Harry Turtledove, John Nance Garner was elected vice president in 1932 as the running mate of Congressman Joe Steele of Fresno, who defeated the extremely unpopular Republican incumbent Herbert Hoover to become the 32nd president. In the years that followed, President Steele slowly but surely built up the powers of his office until he was effectively the dictator of the United States. Steele was ultimately elected to six terms from 1932 to 1952. Observing the ruthless manner in which Steele dispatched his enemies, both real and imagined, Garner kept his head down and consequently remained his vice president for 20 years. After Steele died six weeks into his sixth term on March 5, 1953, the 84-year-old Garner briefly succeeded him as the 33rd President and promptly orders the execution of the Vince \"The Hammer\" Scriabin (Vyacheslav Molotov) and J. Edgar Hoover. The Hammer likewise orders the execution of Garner and Hoover. Hoover also orders the deaths of Garner and the Hammer. In the end, Hoover triumphs and becomes the 34th president and proves to be even more tyrannical than Steele while Garner is executed.\n* In the 2015 alternate history novel Joe Steele, which is an expansion of the short-story of the same name, '''Garner's''' role in the novel follows mostly the same as in the short story. However, within the following weeks after assuming the presidency following Steele's death in March 1953, Garner has nearly everyone in his cabinet (most made up of Steele's cronies) removed from office. However, a newly courageous Congress would impeach Garner for the sins of Steele, and the executive branch becomes vacant. Garner would retire to Uvalde, Texas while GBI (Government Bureau of Intelligence) director J. Edgar Hoover assumes political control and becomes Director of the United States.\nEdmond-Charles Genêt\n* In the alternate history novel The Probability Broach by L. Neil Smith in which the United States became a libertarian state in 1794 after a successful Whiskey Rebellion and George Washington being overthrown and executed by firing squad for treason, Edmond-Charles Genêt served as the 3rd president of the North American Confederacy from 1812 to 1820.\nJohn Glenn\n* In the 1999 short story \"Hillary Orbits Venus\" by Pamela Sargent, John Glenn was elected President in 1976 and 1980. His two immediate successors were Bob Dole and Bill Clinton. By 1998, he and Dole were the only living former Presidents.\nBarry Goldwater\n* In the short story \"Fellow Americans\" by Eileen Gunn in the anthology Alternate Presidents edited by Mike Resnick, Barry Goldwater defeated the early favorite and incumbent Lyndon B. Johnson in the 1964 election to become the 37th president. He was subsequently re-elected in 1968. His vice president was William E. Miller. During his term in office, President Goldwater ordered that nuclear weapons be deployed against North Vietnam in the Vietnam War. By 1990, tactical nuclear weapons were frequently used in the troubled parts of the world, including the Middle East. This led to a high level of genetic mutation among children in the relevant areas as well as mutations in certain species of animals such as rats. There was also speculation that the ongoing AIDS epidemic could be attributed to the significant nuclear fallout over the previous two decades. Having been re-elected in 1968, Goldwater left office after serving two full terms on January 20, 1973. He retired to the Arizona desert where he resided with his wife Peggy until her death in 1985. In the interest of raising contributions for the Barry Goldwater Presidential Museum, Goldwater put his distaste for television aside and agreed to be interviewed by the highly respected PBS political commentator Geraldo Riviera, who questioned him on his use of nuclear weapons in Vietnam, on ''Geraldo's Manifest Destinies''. As Goldwater had never liked nor trusted his fellow Republican presidential candidate Richard Nixon, he was pleased that Dwight D. Eisenhower's former vice president had retired from politics in the early 1960s and had therefore never acceded to the nation's highest office. Nixon subsequently parlayed his electoral defeat into television success and was given a late-night talk show entitled Tricky Dick (referring to his famous political nickname) on NBC in 1970. Much to Goldwater's annoyance, the series garnered high ratings from its inception and, by 1990, was still as popular as ever despite being on its twentieth season. He believed that it was time for the 77-year-old Nixon to retire from television as well as politics. Upon reading in The Washington Post that Robert F. Kennedy, the Governor of New York, was considering seeking the Democratic presidential nomination for the 1992 election, Goldwater considered it highly unlikely as he had never actively sought the nomination previously. However, after a failed assassination attempt at the 1990 New York World's Fair, Governor Kennedy informed his wife Ethel Kennedy that he was going to announce in January 1991 that he was indeed planning to run.\n* In Kim Newman and Eugene Byrne's alternate history novel Back in the USSA, Barry Goldwater is president of the United Socialist States of America (USSA), succeeding Al Capone. Goldwater serves as a parallel to Nikita Khrushchev, and is succeeded by Richard Nixon (Leonid Brezhnev).\nAl Gore\n* Shown as the 43rd and current president in an alternate reality in The One (2001) and in the comic book Hero Squared X-Tra Sized Special.\n* The One was produced before the outcome of the 2000 Presidential Election was known. In keeping with the film's alternate-universe concept, the filmmakers used stock footage of Al Gore and George W. Bush to create a pair of similar mock-up news broadcasts of each candidate as president. The eventual winner's version would be inserted into a scene in \"our\" universe, while the other would be shown in an alternate universe.\n* Was allowed to sit at the desk of the Oval Office on the set of The West Wing in a skit from Saturday Night Live making fun of the television show and depicting Al Gore, who had just lost the 2000 United States presidential election, as overly eager to act the role of president on his visit to the television set.\n* The opening sketch of a 2006 episode of Saturday Night Live showed him addressing the nation, describing how his reversal of global warming led to encroaching glaciers, offering to bail out the oil companies because oil prices had dropped dramatically due to the popularity of alternative fuels, California had left the Union to become the nation of \"Mexifornia\", Major League Baseball Commissioner George W. Bush was doing his best to crack down on the use of steroids, Afghanistan was an extremely popular Spring Break destination, and a Six Flags theme park had been opened in Tehran\n* The television series SeaQuest DSV implies that Al Gore had become President sometime before 2032, as the show's namesake vessel was stationed at the nonexistent Fort Gore.\n* Is mentioned as the president in the webcomic The Spiders, focusing on an alternative American invasion of Afghanistan.\n* Al Gore is mentioned as president in the episode \"Meet the Quagmires\" of Family Guy when Peter Griffin is allowed by Death to go back in time to relive his youth and ends up marrying Molly Ringwald instead of Lois Pewterschmidt, thus allowing Glen Quagmire to marry her instead. Gore enacts liberal policies beneficial to the country such as free universal healthcare, education reform, gun control, and the development of vegetable-oil-fuelled flying cars, and has found and strangled Osama bin Laden to death on the set of MADtv. Although Peter wants to go back and restore the timeline, Brian Griffin cites Gore's achievements as reasons not to do so (partly as they made death a less frequent occurrence, thus making Death harder to find).\n*  In The Execution Channel by Ken MacLeod, Al Gore was elected as the 43rd president in 2000, defeating George W. Bush. His vice president was Joe Lieberman. The point explicitly made by the author is that – with the September 11 attacks still happening with a Democrat in the White House – Gore and Hillary Clinton who succeeds him as President would have undertaken an aggressive War on Terrorism similar to that undertaken by George W. Bush in actual history, leading to an unstable, oppressive situation in the later part of the 21st century when the plot is set.\n* In the alternate history novel 43*: When Gore Beat Bush - A Political Fable by Jeff Greenfield, Al Gore defeated George W. Bush in 2000 and became the 43rd president. A much worse September 11 attacks take place with United Airlines Flight 93 crashing into the United States Capitol, killing a large amount of members of Congress and its leaders, and members of the Supreme Court. Vice President Lieberman, meanwhile, resigns after Gore refuses to invade Iraq.\n* On Futurama, Al Gore was supposed to become the 43rd president. However, it was revealed in Bender's Big Score that Bender destroyed most of Gore's votes in Florida and caused George W. Bush to become president. Later on in his life, Al Gore would become a taxi driver by 2012, and become the first emperor of the Moon and have his head preserved in a jar by the year 3000. Gore guest starred as himself whenever his character appeared in the show.\n* In the fourth season of the series For All Mankind, which depicts an alternate history where the Soviet Union landed the first man on the moon, Al Gore is narrowly elected the 42nd president in the 2000 United States presidential election, defeating Vice President George H.W. Bush. Having previously served as Vice President to Gary Hart, he lost the 1992 Democratic primaries to Bill Clinton and seemingly returned to Congress where he was able to build a bipartisan coalition which helped grant Elián González American citizenship. Improved relations with the Soviet Union under Mikhail Gorbachev led Gore to declare in 2002 that the Cold War had ended, although this was followed by a Soviet coup d'etat orchestrated by hardliner Fyodor Korzhenko. During the attempted capture of an iridium-rich asteroid nicknamed 'Goldilocks', Gore seemingly took personal credit for identifying it after ad-libbing during a speech. Unsuccessful attempts to prevent a plot by elements of Helios Aerospace to force the asteroid into a Mars orbit to preserve the Happy Valley colony included the torture of detainees by undercover operatives of the CIA and KGB, news of which was eventually leaked.\nUlysses S. Grant\n* In the alternate history short story \"We are Not Amused\" by Laura Resnick contained in the anthology Alternate Presidents edited by Mike Resnick, Ulysses Grant was precluded from running for re-election in 1872 due to a new constitutional amendment which stated that no president may be elected more than once. He was succeeded by Victoria Woodhull, who became the 19th President as well as the first woman to hold the office.\n* In the alternate history novel The Guns of the South by Harry Turtledove, '''General Grant's''' great achievement in 1862–63 was to seize control of the Mississippi River by defeating a series of uncoordinated Confederate armies and by capturing Vicksburg in July 1863. After a victory at Chattanooga in late 1863, President Abraham Lincoln made him general-in-chief of the Union Army. He faced Confederate General Robert E. Lee during the Battle of the Wilderness through which he attempted to advance on Richmond, Virginia, the Confederate capital. Grant's superiority in numbers came to naught due to the AK-47s supplied by the Rivington Men, who were in actuality members of the South African white supremacist organisation Afrikaner Weerstandsbeweging who had travelled back in time from 2014, to Lee. A second defeat at Bealeton, Virginia allowed Lee to advance on and capture Washington, D.C. Grant later served as an Election Commissioner during the Kentucky and Missouri statewide referendum on whether they would remain with the Union or join the Confederacy. Although he had a reputation as a heavy drinker, Grant remained abstinent during the election campaign, preferring coffee at dinner with fellow commissioner General Lee. However, the night of the vote, after it became clear Kentucky voted to join the Confederate States while Missouri voted to remain with the Union, he drank himself into a stupor. In 1868, Lee had the opportunity to review Grant's Overland Campaign as it had taken place in the world the Rivington Men had come from.\n* In the Southern Victory alternate history novel How Few Remain by Harry Turtledove, Ulysses Grant achieved a string of victories in 1862. However, these eventually came to naught as General Robert E. Lee's Army of Northern Virginia forced the Army of the Potomac under the command of General George B. McClellan onto the banks of the Susquehanna River in Pennsylvania and destroyed the opposing army in the Battle of Camp Hill on October 1, 1862. Following this decisive victory, Lee moved eastward and occupied Philadelphia. As a direct result, the Confederate States of America earned diplomatic recognition from the United Kingdom and France, which forced the United States to mediate. The Confederacy therefore gains full recognition in the War of Secession came to an end on November 4, 1862. Grant became deeply depressed and reverted to his pre-war alcoholism. At the outset of the Second Mexican War in 1881, General Grant was one of the few sympathetic members of a crowd in St. Louis addressed by Frederick Douglass. He later died of his alcoholism. As McClellan was considered to be one of the worst generals in US history, the most common criticism of Lincoln in subsequent years was that he did not relieve McClellan of his duties and replace him with a more competent general such as Grant.\n* In the Elseworlds one-shot comic book Superman: A Nation Divided in which Kal-El's spaceship landed in Kansas during the 1840s and he was raised by a farming couple named Josephus and Sarah Kent, General Grant was at the Battle of Vicksburg on May 23, 1863 when he was notified of the capture of the city and his opponent, Confederate States Army General John C. Pemberton by the superhuman individual Private Atticus Kent. He and General William Tecumseh Sherman realized the potential that Atticus had in the Union Army. When he sent a letter to President Abraham Lincoln informing him of Atticus' tremendous contributions to the war effort, the President wondered if Grant was once again drinking heavily. However, Lincoln was convinced when Atticus came to the Oval Office and demonstrated his powers. He came to agree with Grant's assessment that Atticus would prove to be the Union's secret weapon against the Confederate States of America. Grant later participated in the Battle of Gettysburg, during which Atticus, who was by then a captain, captured Confederate Generals J.E.B. Stuart and Robert E. Lee and instructed the latter to order to his troops to surrender. Atticus spent the next two days burying the dead. General Grant consoled him by telling him that many more men would have been killed if it had not been for Atticus.\nSequoyah Guess\n* In the alternate history novel The Probability Broach by L. Neil Smith in which the United States became a libertarian state in 1794 after a successful Whiskey Rebellion and George Washington being overthrown and executed by firing squad for treason, Sequoyah Guess served as the 8th president of the North American Confederacy from 1840 until his death in a battle in 1842 by a sniper. He was the first Native American president and was succeeded by Osceola, who served as the 9th president from 1842 to 1848.\nRudy Giuliani\n* In the 2011 BattleTech sourcebook Historical: Reunification War, Rudy Giuliani is depicted as the president after the 2012 presidential election. In 2015, Giuliani reluctantly presided over the ascension of the U.S. into the fictional political union known as the Western Alliance. The Western Alliance was formed in 2014 by Prime Minister of the United Kingdom Boris Johnson (who had yet to be elected to this office in real life), and it comprised the other members of both NATO as well as the EU. Despite fearing the possible loss in American clout and stature, President Giuliani agreed to join the Western Alliance after the U.S. was threatened with a complete boycott from all of the other members.\nReferences"
    }
  ]
}