{
  "content": [
    {
      "type": "text",
      "text": "# List of presidents of the University of Louisiana at Lafayette\n\nThis is a list of University of Louisiana at Lafayette presidents from the University of Louisiana at Lafayette (UL Lafayette), in Lafayette, Louisiana. The school has had six presidents spanning more than a century.\nOver the years the university held different names, including Southwestern Louisiana Industrial Institute (SLII) from 1898 to 1920; Southwestern Louisiana Institute of Liberal and Technical Learning (SLI) from 1921 to 1959; and the University of Southwestern Louisiana (USL) from 1960 to 1998.\nEdwin Lewis Stephens, 1900–1938\nEdwin Lewis Stephens (1873–1938) was named the first president of Southwestern Louisiana Industrial Institute, on January 3, 1900. Stephens was 27 years old at the time. During his administration, the first Martin Hall, the President's House, DeClouet Hall, Foster Hall, McNaspy Stadium, and O.K. Allen Hall were constructed. Stephens also initiated the alumni association, The Vermilion newspaper, and ''L'Acadien'' yearbook. He retired as president emeritus in 1938.\nLether Edward Frazar, 1938–1941\nLether Edward Frazar (1904–1960) became president of UL Lafayette in 1938. Although Frazar served as president for only two and a half years, he supervised the construction of many of the buildings and halls that still stand on campus and form the physical personality of the university. He retired in 1941.\nJoel Lafayette Fletcher, 1941–1966\nJoel L. Fletcher was president of the university for 25 years, from 1941 to 1966, and was known for never permitting a student to resign from college without a personal interview to discover why the student wanted to leave school and to seek a solution to the student's problem. Fletcher served higher education for a total of 45 years. In the 1950s, President Dwight Eisenhower appointed him to the Federal Reserve Board for the Louisiana region.\nClyde Lee Rougeou, 1966–1974\nClyde Rougeou served as SLI's president from 1966 to 1974. During his eight years as president, enrollment at UL Lafayette increased from 8,400 to more than 12,000 students. And through his guidance and effort, the university expanded academically. In 1968, UL Lafayette became a doctoral-granting institution. It also added graduate programs in English, history, microbiology, mathematics, statistics, education, and computer science. Rougeou coordinated more than $34 million in building projects on campus.\nConstruction completed during his presidency included Angelle Hall, Maxim Doucet Hall, Wharton Hall, the Student Union, Cajun Field, the Athletic Complex, and the two upper floors of Dupré Library. He was named Outstanding UL Lafayette Alumnus from the College of Agriculture in 1966.\nRay P. Authement, 1974–2008\nRay Authement took office in 1974, and served until 2008. During his presidency UL Lafayette developed a Ph.D. program in computer science, along with doctoral programs in math, English and history. Under his guidance, UL Lafayette became the state's second largest university and earned the distinction of being the first public university in the state to earn a Doctoral II ranking.\nIn 1997, Authement and a group of supporters launched a campaign to increase the university's privately held assets to $75 million with the majority of funds to be used for endowed chairs, professorships, and scholarships. After reaching its goals early, the campaign then exceeded them.\nJoseph Savoie, 2008–2025\nJoseph Savoie took office in 2008. Prior to his appointment in 1996 as the state's Commissioner of Higher Education, he served in many roles on the UL Lafayette campus, including vice president for university advancement, executive director of the alumni association, program director for the Union Program Council and student government adviser, as well as an adjunct assistant professor.\nUnder Savoie’s leadership, the university achieved Carnegie R1 classification, modernized and beautified campus, launched its largest fundraising campaign to date, construction of Our Lady of Lourdes Stadium, the Health Science campus, a new Student Union, suite-style residence halls, and a reconstructed Quadrangle.\nSee also\n* List of University of Louisiana at Lafayette people\nReferences"
    }
  ]
}