{
  "content": [
    {
      "type": "text",
      "text": "# List of King of the Hill characters\n\nKing of the Hill is an American animated sitcom created by Mike Judge and Greg Daniels. The main characters are Hank Hill, Peggy Hill, Bobby Hill, Dale Gribble, Bill Dauterive, Jeff Boomhauer, Luanne Platter, Nancy Gribble, Joseph Gribble, Kahn Souphanousinphone, Minh Souphanousinphone, Connie Souphanousinphone, John Redcorn, Cotton Hill, Didi Hill, Buck Strickland, Lucky Kleinschmidt, and Brian Robertson are all listed first followed by recurring and guest characters.\nOverview\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|-\n! colspan=\"16\" style=\"background:#ccf;\" | Main characters\n|-\n! scope=\"col\" rowspan=\"2\" style=\"width:20%\" | Character\n! scope=\"col\" rowspan=\"2\" style=\"width:17%\" | Voice actor(s)\n! scope=\"col\" colspan=\"14\" | Seasons\n|-\n! style=\"width:4.5%\" | 1\n! style=\"width:4.5%\" | 2\n! style=\"width:4.5%\" | 3\n! style=\"width:4.5%\" | 4\n! style=\"width:4.5%\" | 5\n! style=\"width:4.5%\" | 6\n! style=\"width:4.5%\" | 7\n! style=\"width:4.5%\" | 8\n! style=\"width:4.5%\" | 9\n! style=\"width:4.5%\" | 10\n! style=\"width:4.5%\" | 11\n! style=\"width:4.5%\" | 12\n! style=\"width:4.5%\" | 13\n! style=\"width:4.5%\" | 14\n|-\n| scope=\"row\" | Hank Hill\n| rowspan=\"2\" | Mike Judge\n| colspan=\"14\"\n|-\n| scope=\"row\" | Boomhauer\n| colspan=\"14\"\n|-\n| scope=\"row\" | Peggy Hill\n| Kathy Najimy\n| colspan=\"14\"\n|-\n| scope=\"row\" | Bobby Hill\n| Pamela Adlon\n| colspan=\"14\"\n|-\n| scope=\"row\" | Luanne Platter\n| rowspan=\"2\" | Brittany Murphy\n| colspan=\"13\"\n|\n|-\n| scope=\"row\" rowspan=\"3\" | Joseph Gribble\n| colspan=\"4\"\n| colspan=\"10\"\n|-\n| Breckin Meyer\n| colspan=\"4\"\n| colspan=\"4\"\n| colspan=\"5\"\n|\n|-\n| Tai Leclaire\n| colspan=\"13\"\n| }}\n|-\n| scope=\"row\" rowspan=\"2\" | Dale Gribble\n| Johnny Hardwick\n| colspan=\"13\"\n|\n|-\n| rowspan=\"2\" | Toby Huss\n| colspan=\"13\"\n|\n|-\n| scope=\"row\" rowspan=\"2\" | Kahn Souphanousinphone\n| colspan=\"4\"\n| colspan=\"3\"\n| colspan=\"4\"\n| colspan=\"2\"\n|\n|-\n| Ronny Chieng\n| colspan=\"13\"\n|\n|-\n| scope=\"row\" | Bill Dauterive\n| Stephen Root\n| colspan=\"14\"\n|-\n| scope=\"row\" | Nancy Gribble\n| Ashley Gardner\n| colspan=\"4\"\n| colspan=\"7\"\n| colspan=\"3\"\n|-\n| scope=\"row\" | Minh Souphanousinphone\n| rowspan=\"2\" | Lauren Tom\n| colspan=\"4\"\n| colspan=\"3\"\n|\n| colspan=\"3\"\n|\n| }}\n|\n|-\n| scope=\"row\" | Connie&nbsp;Souphanousinphone\n| colspan=\"4\"\n| colspan=\"6\"\n|\n| colspan=\"2\" }}\n|\n|-\n|scope=\"row\" | Lucky Kleinschmidt\n|Tom Petty\n| colspan=\"7\"\n| ]]}}\n| colspan=\"2\"\n| }}\n| colspan=\"2\"\n|\n|}\nMain\nHank Hill\nHank Rutherford Hill (voiced by Mike Judge) is the main protagonist who proudly sells \"propane and propane accessories\" as the assistant manager at Strickland Propane. Hank's enthusiasm for his career is not usually shared by other characters in the series. The episodes \"Movin' On Up\" and \"Chasing Bobby\" show Hank escaping from his troubled home life by working on his lawn and truck when times are tough. Hank resembles—in both voice and appearance—the Tom Anderson character from Beavis and Butt-Head, who is also voiced by Judge. Hank is usually a well-meaning father, but is often confused and anxious towards modern trends and the antics of his friends and family members. He suffers from a narrow urethra, which made Bobby's conception difficult. Hank is uncomfortable with public displays of intimacy with his wife and son. He has a very difficult time saying \"I love you\" to any member of his family, as he thinks it is unmanly. Hank's trademark exclamation when surprised, angered or discomforted (sounding like \"Bwaaa!\") and his phrase \"I tell you what\" (\"what\" in his dialect being pronounced \"hwaht\") are running gags on the series. Hank is always faithful, friendly, firm, reasonable, well-read, and hard-working. Much of the series revolves around Hank's desire to do the right thing compared to much of the rest of the people around him who would rather cheat, lie or exploit; however, the people who try to take advantage of Hank tend to regret it because Hank is tougher and a lot shrewder than they thought. His favorite sports team is the Dallas Cowboys (he never expressed much interest in the NBA and Major League Baseball teams in the Dallas-Fort Worth area) though he has indicated that being a Houston Texans fan isn't out of the question because they aren't in the same NFL conference as Dallas and would only require any rooting interest decisions if the Cowboys and Texans somehow faced each other in a Super Bowl (a scenario that Hank looks forward to with hope akin to religious reverence). Hank is a proud Texan, having grown up there. He was, however, born in a ladies room at Yankee Stadium, and spent the first three days of his life in New York City.\nPeggy Hill\nMargaret J. \"Peggy\" Platter Hill  (née Platter) (voiced by Kathy Najimy) is Hank's wife. Peggy was born in Montana and raised on her family's cattle ranch, her strained relationship with her mother being a source of drama for her. Peggy is a substitute teacher in Arlen, Texas, specializing in teaching Spanish despite having a terrible grasp of the language. Peggy resembles in appearance the Marcie Anderson character from Beavis and Butt-Head. Peggy is also a mediocre freelance newspaper columnist, notary public, an exemplary softball pitcher, a Boggle champion, and has started a career in real estate. She has a habit of adding or changing ingredients to ordinary dishes and then naming them after herself. \"Spa-Peggy & Meatballs\" and \"Apple Brown Peggy\" are examples. Peggy is very self-conscious about her larger-than-normal feet (size 16 ½ on the left, 16 on the right). Despite boasting of her intelligence, she has been the victim of manipulation, such as being conned out of $2,500 for a phony degree, indoctrinated into a homogeneous cult, and tricked into a pyramid scheme selling Herbalife inspired products. She has brown hair and typically wears glasses, an aquamarine sleeveless shirt, and denim culottes, but often wears different outfits.\nBobby Hill\nRobert Jeffrey \"Bobby\" Hill (voiced by Pamela Adlon) is Hank and Peggy's husky son who starts out the series at 11 years old, and later turns 13 years old. He is best friends to Joseph and Connie. Although friendly, gentle, lovable, and generally well-liked, he is often prone to making bad decisions. He wants to seek fame as a prop comic and move to New York when he is older. Bobby displays little interest in gender roles and, although superb at golf and target shooting, dislikes team sports, often taking such classes as Home Economics and Peer Counseling instead of more traditionally \"masculine classes\", much to Hank's chagrin. Although many (including Hank) tend to typify him as \"not right\", he is romantically successful, dating Connie and other girls throughout the series.\nDale Gribble\nDale Alvin Gribble (voiced by Johnny Hardwick from 1997 to 2025, Toby Huss from 2025–present) is the Hills' chain-smoking neighbor who is also an insect exterminator among various self-appointed occupations. His physical appearance was modeled after Hunter S. Thompson. Hank considers Dale a close friend, but he often gets annoyed with his schemes and conspiracy theories. Dale is paranoid about any government activity and frequently uses the alias of \"Rusty Shackleford\" to operate without revealing his true identity, including receiving unemployment compensation payments as Rusty. Dale is the president of the Arlen gun club and is a licensed bounty hunter. He possesses a vast collection of guns from pistols to automatic weapons and is an ardent defender of Second Amendment rights. Despite being a firearms aficionado, his aim is relatively poor and despite being knowledgeable in military matters, he is the weakest, physically, of the main cast and is an abject physical coward. He is an avid UFOlogist. It is heavily implied that his wife, Nancy, has cheated on him with John Redcorn for 14 years, and his son Joseph, who strongly resembles John Redcorn, is not his biological son; despite Dale's conspiratorial tendencies, he never suspects his wife of infidelity although he did suspect an alien to be his biological father. Everyone else knows of Joseph's paternity but chooses not to tell Dale because of his total obliviousness, the loving, trusting relationship he has with Joseph and Nancy, and the fact that Dale is more of a father to Joseph than John Redcorn. In season 14, Dale was previously elected the Mayor of Arlen but won with only 9% of the vote after running against a wide pool of candidates; as an \"election denier denier\", Dale stood down 36 hours after his election, saying that he had no faith in a system that would allow him to get elected.\nBill Dauterive\nSgt. William \"Bill\" Fontaine de La Tour Dauterive (voiced by Stephen Root) is the Hills' overweight, divorced, clinically depressed neighbor. He grew up in Louisiana with his cousin Gilbert and speaks Creole and English. He was formerly a rugged star fullback on Arlen High's football team where he set the school record for touchdowns and was nicknamed the \"Billdozer\", and is now a sergeant barber in the United States Army. While his job mostly consists of shaving recruits, he is in fact an extremely talented barber who is able to replicate Hank's signature flattop when Hank's longtime barber became senile. Bill once had a bright future in the Army wanting to be a tanker, but ended up ruining his life after marrying the promiscuous Lenore. Bill is something of a masochist and is often attracted to people who abuse him; after suffering under his father and Lenore, Bill has an almost complete lack of self-worth. He obsesses about his ex-wife, and his loneliness is a running gag on the series. He frequently tries to flirt with and win over Peggy, who alternates between being disgusted and dismissive at his presence or recognizing his essential kindness and harmlessness and being nice to him. Despite coming across as a loser, however, Bill has enjoyed several romantic successes (or near-successes), including romances with Kahn and Luanne's mothers, former Texas governor Ann Richards, and the young widows of two of his dead cousins. He is named after executive producer and writer Jim Dauterive. Between seasons 13 and 14 but before the COVID-19 pandemic, the Army had forced Bill to take an early retirement, leading to Bill to befriend Brian's friends at an all-black barber shop so he could continue cutting hair. However, once COVID hit (as well as the ensuing lockdowns), Bill became an unkempt recluse, gaining significant amounts of weight and never shaving or cutting his own hair, completely relying on delivery services such as Amazon, DoorDash, Uber Eats & Instacart, and never leaving his house—to the point where Netflix issued a wellness check once he ran out of programs to watch on Netflix—even after the pandemic ended until Hank and Peggy return home.\nJeff Boomhauer\n| relatives =\n| home = 73 Rainey Street, Arlen, Texas, United States\n}}\nJeffrey Dexter \"Jeff\" Boomhauer III, referred to as simply Boomhauer, (voiced by Mike Judge) is a slim blonde ladies' man and neighbor of the Hills, whose mutterings are hard to understand to the audience but easily understood by his friends. A running joke is when his friends fail to understand him for some reason other than his incoherence, such as reading out loud the legalese in a contract. His speech is usually heavily littered with the phrases \"dang\" and \"dang ol'\". Boomhauer can mumble his words, but he sings clearly and speaks other languages clearly (mainly French and Spanish). Boomhauer is a classic-car aficionado and owns a 1969 Dodge Coronet Super Bee (in high school, he owned a late 1960s Ford Mustang nicknamed \"Ms. Sally\"), and, despite his incoherent ramblings and womanizing, often displays himself to be very intelligent and philosophical. Although hinted at previously, in episode 18 of season 13, his first name is finally revealed when a Canadian woman who lives next door to the family that trades houses with him for the summer calls him \"Jeff\", and the driver's license shown in the 13th season finale reads \"Boomhauer, Jeff\". Throughout the series it is never known what he does for a living, although it was revealed in an early episode that he was an electrical engineer, but was on workers' compensation. At the end of the 13th season finale, a badge seen in his open wallet reveals that he is a Texas Ranger. By season 14, Boomhauer is dating a woman who has a son, whom he treats like his own.\nLuanne Platter\nLuanne Leanne Platter Kleinschmidt (née Platter) (voiced by Brittany Murphy from 1997 to 2009) is the Hills' 19-year-old niece, daughter of Peggy's scheming fraternal twin brother Hoyt and his alcoholic former wife Leanne. Luanne moves in with the Hills after her mother Leanne stabs Hoyt with a fork during a drunken fight that tips over their trailer. Hank initially makes frequent attempts to encourage Luanne to move out on her own, but later more or less accepts her as a member of the family. She was a student at the beauty academy and later at Arlen Community College. She was often portrayed as an airhead. When Peggy was scammed by an internet test that \"proved\" she was a genius, she only believed it to be a scam upon learning that Luanne was also proclaimed a genius. Despite this, Luanne was shown to be an expert mechanic in the first two seasons and is good at logic puzzles. She also has something of a vindictive streak, especially when she feels slighted; she was once shown to have tried flushing Hank's keys down the toilet after being passed over for a propane sales position he was hired for instead (though she actually flushed Peggy's by mistake), and later tried putting Peggy's shoes and glasses down the garbage disposal and intentionally dyed Peggy's hair green after being fired as her stylist for a local beauty pageant. Luanne was promiscuous, but she settles down after being visited by the spirit of her first boyfriend, the slacker Buckley, whom she calls \"Buckley's angel\", and then attending a church-sponsored \"born-again virgin\" program, where she starts a Bible study class. Luanne created a puppet show entitled \"The Manger Babies\" for a public-access television cable TV station, featuring the barnyard animals who witnessed Jesus's birth (though they included a penguin and an octopus). In the 10th-season finale, Luanne revealed that she was pregnant with the child of Lucky, whom she married in the 11th-season finale. In the 13th season, she has a baby girl named Gracie Margaret Kleinschmidt. She wears a green sleeveless crop top and red capris (or, in some early episodes, a red-orange T-shirt and blue jeans). Outside of a photograph she does not appear in season 14, as a result of Murphy's death in 2009, nor was she mentioned, leaving her fate unknown.\nNancy Hicks-Gribble\nNancy Hicks-Gribble (voiced by Ashley Gardner) (née Hicks) is Dale's wife, Joseph's mother and weather-girl-turned-anchor for local news station Channel 84, and is 40 years old. She had a 14-year affair with John Redcorn, which produced her son, Joseph, although the affair ended when John Redcorn befriends Dale. Nancy finally becomes a faithful wife to Dale. John Redcorn refused to come back to her out of respect for Dale. Her mother Bunny was similarly unfaithful to Nancy's father, but did not reveal her own long-term affair until Nancy began suffering from stress-induced hair loss over her unresolved feelings for John Redcorn. Nancy is a former beauty queen, a fact which helped her get her job as a news weather-girl. It is implied during Season 14 that her and John Redcorn have rekindled their affair at some point, with the two also being partners on a home-selling video blog.\nJoseph Gribble\nJoseph John Gribble (voiced by Brittany Murphy from 1997 to 2000, Breckin Meyer from 2000 to 2010, Tai Leclaire from 2025–present) is Dale and Nancy's 13-year-old son and one of Bobby's best friends. Despite Joseph's obvious Native American features, his similarity in appearance to John Redcorn, and the fact that his middle name is \"John\", neither he nor Dale is aware that Redcorn is his biological father (Nancy refers to Dale having a \"Jamaican grandmother\" to explain Joseph's dark complexion). Redcorn's occasional and awkward attempts to get closer to Joseph (against Nancy's wishes) lead Joseph to regard him as strange and creepy. Joseph starts out as an ordinary teen, but eventually grows weird and creepy—not to mention dim-witted. Joseph begins to take after Dale more than John Redcorn, Nancy, or even any of his friends. Joseph has a half-sister named Kate (Charlene and John Redcorn's daughter), who is very similar to Joseph in personality and interests but likewise does not realize that Redcorn is their father. Joseph is the only character of the series shown to physically mature, having grown six inches in height over the course of a summer, a more built physique, athletic prowess and having a deeper voice and a wispy mustache upon his reappearance. In season 14, Joseph has slowly appeared to be interested in some Native American imagery including a love for horses and a dreamcatcher hanging in his and Bobby's apartment, but is still oblivious to his relationship to John Redcorn, though it is implied Bobby is aware by this point. Joseph has also picked up Dale's habit of smoking cigarettes and has still shown a lot of the same traits Dale has, to the point where the two were both using similar tactics to help Bobby and Hank win a beer brewing contest respectively.\nKahn Souphanousinphone\nKohng Koy \"Kahn\" Souphanousinphone () (voiced by Toby Huss from 1997 to 2010, Ronny Chieng from 2025–present) is Hank's materialistic and self-centered Laotian-American next-door neighbor, Minh's husband, and Connie's father. He was born and raised in Laos until he emigrated to Anaheim, California before the events of the series took place, then moved to Arlen during season 1 due to problems with their previous neighbors. He frequently believes he is better than his new neighbors due to having more of and owning everything a little better than them, especially the Hills, often referring to them as \"hillbillies\" or \"rednecks\" despite not knowing what they mean. He frequently boasts of his superiority to others, though his biggest dream is to be more successful than Ted Wassanasong (). Despite his arrogant and self-centered attitude, Kahn seeks approval and friendship from his neighbors. He previously worked for a defense contractor that manufactured composite ceramic armor, but was fired for spilling company secrets. After a string of job failures due to his attitude, which forced his family to move to other locations in the U.S., he found a new job in Houston, which forces him to commute. Upon recollection of the story of how Minh and Kahn met, it is revealed that he was formerly a rebel and playboy whom Minh chose over the straight-laced intellectual her father set her up with. In one episode, Kahn shows that he is a trained martial artist while getting into a fight with a few rednecks. In the episode \"Just Another Manic Kahn-Day\", it is revealed that Kahn has bipolar disorder (which was also briefly mentioned in the earlier episode \"Lost in Myspace\") and he wildly bounces between being brilliant and surprisingly likable when he's taking his medicine and being a miserable, sullen jerk when he's not. It is revealed in the episode \"Three Days of the Kahndo\" that Kahn has a brother also living in the U.S. with a family of his own. By season 14, Khan and Minh had divorced with Khan living in the garage; once the divorce becomes public after hiding it for two years, Khan is last shown packing up his belongings. Kahn has also resumed his grudge against Bill for having dated his mother, showing more hostility to him than anyone else.\nMinh Souphanousinphone\nMinh Souphanousinphone () (voiced by Lauren Tom) is Kahn's wife and Connie's mother. Minh is a housewife who enjoys making rude comments about the neighbors, particularly Peggy. Her father is General Gum. She sometimes has a snobbish attitude toward the neighbors, referring to them as \"hillbillies\", \"rednecks\", or \"dumb monkeys\" despite lacking knowledge of what they actually mean. However, she is overall a more understanding parent and better neighbor than Kahn. She is a crack-shot with championship-level skills, and at one point joined Dale's gun club, exerting a positive effect on its members. She is highly competitive, going so far as to cheat on The New York Times crossword puzzle. Like her husband, Minh grew up in Laos, where her father was a powerful general in the army who was not happy with her decision to marry Kahn. She once told Nancy Gribble that she didn't grow up oppressed: rather, because of her father's high ranking position in the army, she \"was peasants' worst nightmare\", implying that she was a bully in her youth. She once taught Bobby some of the Laotian language. By season 14, Minh and Khan had divorced.\nConnie Souphanousinphone\nKahn \"Connie\" Souphanousinphone Jr. () (voiced by Lauren Tom) is the 13-year-old daughter and only child of Kahn and Minh. She is one of Bobby's best friends who briefly falls in love with him and becomes his first girlfriend. She is a talented violinist, straight-A student, and general overachiever and child prodigy only because her father holds her to very high standards. Though it is implied that she works hard because of her overbearing parents, in reality, she does it for herself. Connie is named after Kahn because he wanted a son but was disappointed; if anything, Connie is often embarrassed by his egotistical attitude and rudeness towards others. In season 14, Connie is studying for a double major at UT Dallas and was dating Chane Wassannasong casually, with the two having an open relationship. However the two broke up when Connie's parents' divorce was revealed publicly and Chane was far from comforting. Shortly after this, Connie and Bobby resumed their old relationship.\nJohn Redcorn\nJohn Redcorn (voiced by Victor Aaron in 1997, Jonathan Joss from 1998 to 2025) is Nancy's Native American former \"healer\", masseur, and musician, and Joseph's biological father. He is a former roadie for Winger and lead singer of Big Mountain Fudgecake. In Season 9, he began writing and performing his own children's music. He works out of his trailer as a masseur, though his clients are generally only women. It is implied that he has a history of having sex with them, as Hank is horrified when Peggy goes to see him, and John Redcorn even states to him, \"Hank, I consider you a friend. I would never heal your wife the way I heal the wives of others.\" He is also active in American Indian rights campaigns, and Dale once helped him with a lawsuit that netted him 12 acres of land from the federal government. However, he was manipulated into building a casino on the property, which was not—and, as of 2025, still is not—legally permitted to operate in the state of Texas, as their tribes previously forfeited their gaming rights in exchange for federal recognition, and his property was permitted for hazardous dumping to pay the debt. Because Dale had been so helpful, Redcorn felt extremely guilty over what he did with Nancy, and ended his affair by encouraging Nancy and Dale to strengthen their marriage. Dale re-tailored Redcorn's status as a musician from a mediocre rock singer to a successful children's performer. He also has a daughter, Kate, whose mother is Charlene. Following Joss's death in 2025, a tribute for Joss appeared in the season finale; it is not known if Redcorn will appear in season 15.\nCotton Hill\nColonel Cotton Lyndal Hill (voiced by Toby Huss) is Hank's cantankerous father, Peggy's father-in-law and Bobby's grandfather. He has a hair-trigger temper and practically no respect for his son or daughter-in-law, although he has a soft spot for his grandson. Despite his many shortcomings, he occasionally showed a softer side, for example, in the episode \"Cotton's Plot\" where he helped Peggy learn to walk again after her parachuting accident. His shins were blown off in World War II by a \"Japan man's machine gun\" and his feet were reattached to his knees, resulting in a short height and stilted gait. Despite his disability, he eventually reached the rank of colonel in the Texas State Guard/Texas Army National Guard. After Cotton and his first wife Tilly, Hank's mother, divorced, he married a much younger, soft-spoken, busty blonde candy striper named Didi who gave birth to his youngest son \"G.H.\" (\"Good Hank\"). He was immensely proud of his military service, stating that he was in the US 77th Infantry Division despite being shown with a gold US 2nd Infantry Division badge in his military items and with a Red and White division patch. Though his claim of fighting \"nazzies\" (Nazis) was proven false and his claim of killing \"fitty [50] men\" was dubious, his participation in several of the bloodiest battles in the Pacific Theater was confirmed and his uniform was shown to be decorated with the Medal of Honor and the Purple Heart. Cotton himself died in episode #1218, \"Death Picks Cotton\", after suffering severe burns and an allergic reaction to shrimp during a flashback at a Japanese restaurant. Instead of addressing Peggy by her name he calls her \"Hank's wife\". He appears in season 14 strictly in flashbacks.\nDidi Hill\nDidi Hill (voiced by Ashley Gardner) is Cotton's second wife, Hank's stepmother, Peggy's stepmother-in-law and Bobby's stepgrandmother.  She's a candy striper after she retired from being an exotic dancer. She and Hank went to elementary school together, meaning they are the same age being 39 at the time of her debut. She has breast implants and suffers from postpartum depression following the birth of Cotton's third son \"G.H.\" She is generally depicted as docile and ditzy, although she is a certified optometry assistant. She wasn't present when Cotton died, and years later when she calls Hank and says she needs to meet him to discuss something, Hank pointedly says that he hoped that he would not have any interactions with Didi anymore. She shows up with a box that Cotton had marked to be sent to Hank, and has no idea what it is, telling a frustrated Hank that she's forgotten everything about Cotton since she got engaged to a wealthy professional wrestler before driving away and never returning. By season 14, Didi is a struggling single mother to G.H. and appears to have had her breast implants that Cotton had bought her removed.\nBuck Strickland\nBuck Strickland (voiced by Stephen Root) is the slightly overweight, 68-year-old owner of Strickland Propane, and Hank's boss. A chauvinist, alcoholic, and adulterer, his physical appearance and attitude greatly resemble those of Lyndon B. Johnson, particularly his hairline and habit of hosting employee discussions in his bathroom. A picture of Buck seen in \"Pregnant Paws\" also shows him picking up one of his bloodhounds by the ears, much like a similar famous photograph of Johnson doing the same. Originally hailing from Arkansas, Buck was historically known for his modest start in business and general business smarts. These attributes have since been worn away by life and been replaced with many habits which often come in the way of his business decisions. Buck is a compulsive gambler to the point where he will use company profits to continue gaming, even betting in underground events. It is often implied that Hank reveres Buck and that, in Hank's eyes, the two have a close relationship. Compared to Hank who is the ultimate model of a good employee, Buck's vices require Hank to keep an extremely close eye. Buck refers to Hank as his \"Golden Goose\" implying Hank is the only reason his business remains afloat and thus he would never fire him. Hank has used the threat of quitting to capitulate Buck's transition from things Hank found unsavory. His health is questionable as he has suffered numerous infarctions and has had several cardiovascular surgeries including valve replacements. However, Buck tends to backstab Hank when it comes to crimes. He was willing to frame Hank for murder. Despite this, Hank easily forgives him because Hank worships Buck and he's desperate for a father figure. Buck appears in season 14—by this point completely bald—retired from the propane business and living in a nursing home but still alert and making business decisions.\nLucky Kleinschmidt\nElroy \"Lucky\" Kleinschmidt (voiced by Tom Petty) is Luanne's boyfriend and later husband, a 38-year-old hillbilly. It's often hard for Lucky to hold down a job as he has no credit or Social Security number. He lives on the remainder of the $53,000 \"settlement monies\" he received after \"slipping on pee-pee at the Costco\" having had a portion of his spine fused. He was nicknamed \"Lucky\" after the settlement windfall. After he spent a majority of his money customizing his truck, his finances dwindled down to nine thousand dollars but regained another $53,000 when an ambulance chasing lawyer paid off Lucky to avoid a lawsuit. Originally appearing as one of Kahn's redneck friends when he went through a brief redneck phase, Lucky lives by an unusual but firm self-implied moral code, refusing to marry Luanne unless he receives a GED, and also referred to Hank and Peggy as \"Uncle Hank and Aunt Peggy\". While Bobby immediately bonds with Lucky and Hank tolerated and even was somewhat friendly with Lucky as he \"wasn't like Luanne's other boyfriends\", Peggy initially didn't like Lucky because she felt he was holding her back and didn't want Luanne reliving her past with her parents. Peggy even tried very hard to break him and Luanne apart by sabotaging his studying efforts, but after Luanne's pregnancy was revealed, she and Hank reconciled the two, giving them a shotgun wedding at Lucky's request. He is also one of the guitarists for John Redcorn's band \"Big Mountain Fudgecake\". Although dimwitted in some aspects, Lucky has learned some facets such as basic math through life experience as opposed to formal education, and was astute enough to deduce that his father-in-law spent time in prison whereas Luanne believed the story that he works on an oil rig. He does not appear in season 14, as a result of Petty's death in 2017, nor was he mentioned, leaving his fate unknown.\nBrian Robertson\nBrian Robertson (voiced by Keith David) is an African American man whose family rented the Hill residence while Hank and Peggy were in Saudi Arabia. Despite moving out to make room for the Hills' return to Arlen, Brian continues to hang out with Hank and his neighbors in the alley as he \"liked the atmosphere\". He has a son who plays youth soccer, and is also in an R&B tribute band. During Hank's absence, he acted as the straight man to his friends' antics.\nOther Hill, Platter, and Kleinschmidt relatives\n*  (vocalizations by Kathy Najimy)  is the Hills' 13-year-old purebred Georgia Bloodhound named after Lady Bird Johnson. It is said that her mother helped track down James Earl Ray, as revealed by Hank in episode 7 of season 1 titled \"Westie Side Story\". Her companionship temporarily relieved Hank's stress (and narrow urethra), allowing him to impregnate Peggy. Later on in the series Ladybird would become deaf and despite much effort on Hank's part, would never bear puppies because of her narrow uterus. She does not appear in season 14 and is not mentioned, implying she has died at this point.\n*  Good Hank \"G.H.\" Hill (voiced by Finn Wolfhard in the 2025 revival) is Cotton and Didi's infant son, and the younger of Hank's two half-brothers. G.H. is an abbreviation for \"Good Hank\", implying that the original Hank was unsatisfactory to his father. Cotton treats G.H. much better than Hank presumably because Cotton sees him as being his second chance of being a better father than he was for Hank. G.H. was key at a time when Hank had to convince Cotton not to end his life as well as to permit Hank to give his father money for the baby's sake (and as payback for the years Cotton raised him). G.H. was absent at the time of his father's death, and is not seen throughout the rest of the series, although it is presumed he is living with his mother and stepfather. In season 14, G.H.  is 13 years old and is mostly withdrawn, lacking a father figure and taking after many of Cotton's misogynistic traits, though he does view Hank as somewhat more of a father figure.\n*  Tilly Mae Garrison (formerly Hill) (voiced by Tammy Wynette from 1997 to 1998, Beth Grant in 1999, and K Callan from 2000 to 2009) is Cotton's first wife, Hank's mother, Peggy's mother-in-law and Bobby's grandmother, and is 69 years old. She divorced Cotton after suffering years of verbal abuse. Tilly is a kind woman who collects miniatures because they made her happy during Cotton's abuse. Hank is often over-protective of her, fearing she is too old and fragile to go out and do things on her own. Tilly lives in Arizona with her husband Chuck. Tilly's legal name varies during the series. She is listed as \"Tilly\" on Hank's birth certificate, but is addressed as Matilda by the clergyman during her wedding to Chuck.\n*  Gracie Margaret Kleinschmidt (vocalizations by Tara Strong) is the daughter of Lucky and Luanne. She was born in the season 13 episode \"Lucky See, Monkey Do\". Luanne originally wanted to name her Lasagna (stating that lasagna was their favorite food) while under the influence of hospital analgesics, but choosing a more conventional name after she had recovered. Along with her parents, she doesn't appear in season 14, leaving her fate unknown.\n*  (voiced by Paget Brewster) is Lucky's sister, Luanne's sister-in-law, Gracie's aunt and the main antagonist in \"Lucky See, Monkey Do\". She is a strict modern mother who only appears in the episode \"Lucky See, Monkey Do\". She has two children, one son and one daughter (Gracie's paternal first cousins) and raises them in strict accordance with contemporary parenting practices, something which leads her into a rivalry with Peggy, whose parenting skills are from older schools of thought, over how to assist Luanne as her pregnancy due date approaches. When Luanne goes into labor, Myrna commandeers the situation and insists that Luanne have a natural, drug-free water birth, but under Hank's encouragement to think for themselves about how to raise their child, Luanne and Lucky opt for a hospital birth instead.\n*  (voiced by Pamela Adlon) is Luanne's violent alcoholic mother, Gracie's grandmother, Bobby's aunt and Lucky's mother-in-law, and is 42 years old. She was imprisoned for \"second-degree assaulting\" her husband in the back with a fork. Though she is often mentioned during the course of the series, she appears only in the episode \"Leanne's Saga\", visiting Luanne in Arlen after her release from prison and briefly was engaged to Bill Dauterive.\n*  (voiced by Johnny Knoxville) is Luanne's father, Peggy's older brother, Hank's brother-in-law, Bobby's uncle, Lucky's father-in-law, Gracie's grandfather and Leanne's ex-husband, and is 50 years old. Despite Luanne's beliefs, he never worked on an oil rig, but was in jail for most of Luanne's life, with the oil rig story acting as a cover so Luanne wouldn't know her father was a convict. He appears in only one episode: \"Life: A Loser's Manual\". After being released from jail, Hoyt commits a robbery and initially tricks Lucky into taking the blame, but he eventually confesses and is sentenced to life in prison under a three-strikes law. The episode \"Leanne's Saga\" reveals that Hoyt was planning on marrying a pharmacist girl before meeting Leanne, then working as a stripper, entertained at his bachelor party.\n*  (voiced by Joanna Gleason) is Peggy and Hoyt's mother, Hank's mother-in-law and Bobby and Luanne's grandmother. Mother Platter lives in Montana with her husband Doc. She's an old-fashioned, tough-as-nails rancher type and loathes Peggy for deserting the family ranch and not marrying a local neighbor boy. Earlier episode flashbacks feature a totally different \"Peggy's mother\" character, a demure housewife who is essentially an older version of Peggy—it's not made clear if one is her real mother and one is her stepmother, or if the rancher character retconned the older version completely. Peggy gives up on them having any relationship late in the series and never mentions her again.\n*  (voiced by Stephen Root) is Peggy and Hoyt's father, Hank's father-in-law and Bobby and Luanne's grandfather. He makes only a single major appearance when Peggy, Bobby and Hank visit the family ranch. He seems to be going somewhat senile and preachy, only talking in rural old-west metaphors which Hank interprets as old-fashion Western-style wisdom. By season 14, Peggy mentions that Doc had died at some point between seasons 13 and 14.\n*  (voiced by David Carradine, Mike Judge in season 14) is Hank's older half-brother and Cotton's son with a Japanese nurse, Michiko, from an affair in Japan during World War II. Hank and Junichiro share many similarities in appearance and mannerisms (this in spite of the fact that Hank actually shares more of his mother's features); one of these is that when he is shocked, like Hank, he yells \"BWAH!\" Like Hank, Junichiro also has a narrow urethra and is an assistant manager at the company for which he works, making robots and robot accessories. At first, he renounces the Hill blood in him, but eventually calls Cotton \"Father\". He makes a brief video appearance in season 14 after he, Hank, and G.H. receive settlement money for a shin cream from Cotton's estate.\n* Dusty Hill (voiced by himself) is the bassist and vocalist for the band ZZ Top and Hank's cousin. In the episode \"Hank Gets Dusted\", Cotton gives his prized Cadillac to Dusty without allowing Hank a chance to buy it. Dusty enters the car in a demolition derby in which it is badly damaged. Hank and Dusty make their peace after Dusty has the car repaired and installed at the Cadillac Ranch.\nOther Gribbles\n*  (voiced by David Herman) is Dale's father, Nancy's father-in-law and Joseph's grandfather, who had been estranged from Dale for many years for kissing Nancy at her and Dale's wedding reception. Bug is actually gay and had been flirting with a Filipino caterer instead. Upon sensing Dale's imminent entry into the room, attempted to hide his sexual orientation from his son by grabbing and kissing 'the nearest thing in a dress'. This misunderstanding, and Bug's inability to reveal his true sexuality to Dale, resulted in their estrangement. When Dale and Nancy renew their wedding vows 20 years afterward, Nancy arranges to invite Bug, and Dale initially suspects his odd behavior and his having a \"partner\" of meaning that Bug is an undercover government agent, but finally accepts the truth upon seeing Bug and his partner share a devoted kiss. Bug's appearance in \"My Own Private Rodeo\" retcons his appearance in earlier episodes, where he bears a near-identicality to present-day Dale.\nOther Dauterives\n* Gilbert Fontaine Dauterive (voiced by David Herman) (pronounced \"zhil-BEAR\") is Bill's cousin. Though at one point shown to live on the family estate with his aunt and cousin in a Louisiana bayou in \"A Beer Can Named Desire\", he and Bill eventually wind up as the last two living Dauterives, with all the others either dead, imposters, institutionalized or sterile, implying that the Dauterive family is inbred. It is strongly implied that he is gay, and he even hits on Buck Strickland when Buck attempts to capitalize on the Dauterive family's traditional barbecue sauce recipe in \"Blood and Sauce\".\n* Esmé Dauterive (voiced by Meryl Streep) was Bill and Gilbert's aunt, and matriarch of the Dauterive clan. She expressed deep concern over the family's ever-shrinking headcount, lamenting that \"the Dauterive blood is down to a trickle\". She happily received Bill upon his return for a visit and was not displeased to see him and his cousins' widows taking mutual interest. She is only seen in \"A Beer Can Named Desire\"; it is later revealed that she had died after a fever.\n* Violetta, Rose and Lily Dauterive (voiced by The Chicks: Natalie Maines, Emily Strayer, and Martie Maguire) are Bill and Gilbert's cousins. Violetta is Bill's cousin by blood, while the other two are related by marriage to Bill's now-deceased cousins. They all lived on the family estate in Louisiana with Esmé and Gilbert. Upon Bill's visit, all three, having been without male companionship for years, vied for Bill's affections and attempted to seduce him, even despite Violetta's own blood relation to him. Like Esmé, they are only seen in \"A Beer Can Named Desire\"; it is later revealed that Violetta had died in her sleep, making Gilbert Bill's last blood relative.\n*  (voiced by Ellen Barkin) is Bill's mean-spirited ex-wife. She is mentioned frequently throughout the course of the series, but only appears twice – once being when Bill and Bobby watch Bill's wedding video. She appears when Bill begins dating former Texas Governor Ann Richards to meddle with their relationship in \"Hank and the Great Glass Elevator\", but with help from Richards, Bill is finally able to tell her off and move past her toxic influence.\n* Mr. Dauterive (voiced by Stephen Root) is Bill's implicitly-deceased father, who was said to be an abusive man and a heavy drinker, and is largely responsible for Bill's emotional instability. Among the abuses Bill recalls from his father are having been spanked every day between the ages of 9 and 16, being called a girl and made to wear \"pretty, pretty dresses\", and being locked in a rabbit hutch.\nOther Boomhauers\n* Patch Boomhauer (voiced by Brad Pitt) is Boomhauer's sleazy, womanizing younger brother. He appears in \"Patch Boomhauer\", apparently engaged to marry Boomhauer's old flame, Katherine—much to Boomhauer's mounting displeasure, as he himself has unresolved feelings for Katherine, and Patch's continued philandering angers him for her sake. The wedding is later called off after Patch hires strippers for his bachelor party and frames Boomhauer for trying to break up the engagement. Patch makes a final cameo in \"Lucky's Wedding Suit\" as one of the guests at Luanne and Lucky's wedding. Patch, like Boomhauer, speaks in a fast-paced Southern gibberish.\n* Dr. and Mrs. Boomhauer (voiced by Mike Judge) are Boomhauer's parents. While Dr. Boomhauer remains silent onscreen, Mrs. Boomhauer is shown to speak like her son in \"Peggy's Turtle Song\". In \"Three Coaches and a Bobby\", Boomhauer mentions that his parents had won the lottery and moved to Florida.\n* \"Mee-Maw\" Boomhauer (voiced by Mike Judge) is Boomhauer's elderly grandmother. She is seen in \"Dang Ol' Love\", when Boomhauer, infatuated with Marlene, goes to Mee-Maw to ask for a family-heirloom wedding ring as well as \"Lucky's Wedding Suit\", where she is seen sitting with the other guests as well as dancing with Patch for a brief moment. Mee-Maw speaks in the same characteristic gibberish that the rest of the Boomhauers share and wears dentures.\nOther Souphanousinphones\n* Doggie Kahn () (often referred to simply as \"Doggie\") is the Souphanousinphones' West Highland White Terrier.\n* Tid Pao Souphanousinphone () (voiced by Lucy Liu) is Connie's criminally-inclined cousin and Kahn and Minh's niece from Los Angeles and the main antagonist in \"Bad Girls, Bad Girls, Whatcha Gonna Do\", who was sent by her parents to stay at Kahn's for a semester because she stole drugs from a street gang. She attended Tom Landry Middle School in the meantime. She seduced Bobby and tricked him into creating a meth lab by pretending to help him with building a candy machine for his group science project, and persuaded him to steal propane tanks from Strickland Propane to complete it. Tid Pao was caught by Connie and she was sent away by Kahn to Wisconsin to work on her last uncle's dairy farm at the end of the episode because of her criminally-inclined nature. There her uncle told her she was on her last chance as he was the last relative left in America. Any more trouble would see her shipped off to live with her grandmother in Laos.\n* Laoma Souphanousinphone () (voiced by Amy Hill) is Kahn's mother, Minh's mother-in-law and Connie's grandmother who appears in the seventh season finale \"Maid in Arlen\".  She is the only person on the show who addresses Kahn by his full name. She's kind and hardworking and enjoys housekeeping. She is disliked by Minh because of her criticism of Minh's housework skills. The status-conscious Kahn is horrified when Laoma, bored and unwanted by her daughter-in-law, becomes the Hills' housekeeper, and even more horrified when she begins a love affair with Bill Dauterive. Kahn gets over it, and Bill and Laoma are still together at the end of the episode, but at the beginning of the next season, Bill is once again single, and Laoma is never heard from again. In Season 14, Kahn reveals that Laoma died and he is shown to have resumed his grudge against Bill for having dated her.\n* General Gum () (voiced by James Sie) is Minh's father, Kahn's father-in-law and Connie's grandfather usually referred to as \"The General\", he appeared only in the episodes \"Pour Some Sugar on Kahn\" (in which he visits  the family) and \"Father of the Bribe\" (in which Minh recalls her courtship by Kahn). While he shows great affection towards Minh and Connie, he dislikes Kahn. He served under several Laotian dictators and was put on trial for war crimes at The Hague.\n* Phonsawan Souphanousinphone () (voiced by James Sie) is the nephew of Kahn and Minh and the cousin of Connie and Tid Pao. He primarily speaks Lao.\nStrickland Propane\n* Joe Jack (voiced by Toby Huss) is a fuel-truck driver and co-worker with Hank at Strickland Propane. He has a drinking and gambling problem, as seen when he is a member of the Propaniacs. Joe Jack has an unhealthy habit of calling people he speaks to \"honey\", regardless of their gender or level of familiarity with him.\n* Enrique (voiced by Eloy Casados from 1997 to 1998, Mike Judge in 2003 and Danny Trejo from 2003 to 2009) is a good-natured Mexican-American truck driver at Strickland Propane. Originally he spoke with a very weak accent. In the episode \"Enrique-cilable Differences\", Enrique forcibly befriends Hank after a nasty fight with his wife. Enrique ends up moving in with the Hills for a short time eventually developing a pathological attachment to the Hill family, but quickly patches things up with his wife after a fed-up Hank kicks him out. Enrique nearly lost his house due to rent increases when property values in his neighborhood skyrocket when Peggy began selling working class housing to upper-middle class hipsters. To solve the problem, Peggy helped the neighborhood value decline when she fabricated the area as uncool by making it appear as if typical middle-class families were moving in prompting the hipsters to leave. Afterwards he applied and became a homeowner. While a hard worker, he has poor fiscal habits, often spending money on lavish outdoor parties to celebrate any seemingly significant event such as his daughter's Quinceañera or becoming a homeowner.\n* Donna (voiced by Pamela Adlon) is the name of two separate women who have both worked as Strickland accountants, and are often referred to as \"Donna from Accounting\". The first Donna appears, albeit infrequently, as a larger Black woman, most notably in \"Meet the Propaniacs\". In \"Are You There, God? It's Me, Margaret Hill\", Buck mentions that he fired her after discovering stolen office supplies in her bedroom (presumably during an extramarital encounter), and orders Hank to \"find us a new Donna\". The \"new Donna\" is a tall, curvy white woman who first appears in \"The Miseducation of Bobby Hill\". In \"24 Hour Propane People\" she mentions a husband; in \"You Gotta Believe (In Moderation)\", Dale notes her \"recent divorce\". In \"Lost in MySpace\", her most significant episode, she is briefly promoted to assistant manager alongside Hank, which didn't settle in well with him. She often uses MySpace during work hours and ignored Hank when he asked her for a down to business approach. In turn, Donna is briefly fired when some of her MySpace friends mistook Buck for Hank and brutally beat him up. She sought revenge against Hank by making rude comments about him and Strickland. After sifting through the blogs, he confronts Donna for her behavior at Goobersmooches and eventually makes amends with her. After being rehired as an accountant, Donna takes down the blogs and rearranges it to a down to business approach like Hank wanted.\n* Roger \"Booda\" Sack (voiced by Chris Rock in the first appearance, Phil LaMarr in later appearances) is a comedian and traffic school instructor. Despite having a rising TV career some years prior, his career stalled following an unfortunate encounter with Moesha. His abrasive and insulting style of humor infuriates Hank, as well as the dean of the traffic school, who terminates his employment at the traffic school for not teaching traffic safety as he was hired to do. However, when Bobby's attempt to break into stand-up comedy goes disastrously awry (Roger gave him advice about \"getting in touch with your roots\", and Bobby ends up using racist material he found on a white supremacist website), Roger stands up for Bobby's right to free speech and wins over the enraged crowd (and Hank) in the process. Hank later gets Roger a job at Strickland Propane. Grateful to Hank for saving him from unemployment, Roger's attitude mellows afterward. In \"Racist Dawg\", he attempts to help Hank prove that he isn't racist by administering a racial sensitivity test, which a confused Hank flunks, making Roger think he is racist after all.\n* Elizabeth \"Miz Liz\" Strickland (voiced by Kathleen Turner) is the deep-voiced, long suffering wife of Buck Strickland, first seen in \"Hanky Panky\". In \"Hanky Panky\", the first half of a two-part episode, Miz Liz confronts Buck at an awards dinner while he is there with his mistress. She files for divorce from Buck and subsequently takes control of Strickland Propane. This forces Buck to move in with Debbie. She promotes Hank to manager and attempts to seduce Hank in a propane-powered hot tub. However, the interest was not reciprocated. She brags to Buck about this, Buck, in turn, surprises Hank with a loaded shotgun expressing his jealousy. She and Buck reconcile in the second half \"High Anxiety\", but later on, in \"The Good Buck\", Buck claims that Miz Liz has left for good, stating that \"she could handle my drinkin' binges, and my gamblin', and even turn a blind eye to my extramarital escapades, but not when they happen all once! ...and on her birthday!\"\n* Debbie Grund (voiced by Reese Witherspoon) was an employee of Strickland Propane and was Buck Strickland's mistress and the main antagonist in the episode \"Hanky Panky\". As revenge for Buck ending their relationship, she plotted to murder Buck and his wife, but accidentally killed herself with Buck's shotgun while attempting to climb into the dumpster she was using as a hiding place.\nTom Landry Middle School\n* Carl Moss (voiced by Dennis Burkley) is the principal of Tom Landry Middle School. Moss is one of Hank's high school classmates; he played center for their football team. His primary concerns are tight budgets, maintaining discipline, and the school's zero tolerance policy for \"everything\". He tends to follow procedure to avoid trouble, even when it conflicts with his friendship with Hank or common sense. Hank will often remind Carl of how he used to be and insinuate that Carl sold out for a position of power. He frequently rejects staff demands for better teaching aids, citing budget cuts; he once referred to wood being used in shop class as a \"fancy teaching aid\". Often the center of various scandals at the school, he permitted installation of soda dispensing vending machines solely for raising funds for staff vacations and purposely placed lazy students into special education classes to avoid state-mandated exams (whose grades would heavily affect school funding). Once, when one of Dale's plots to get rid of Moss came to nothing before they got started, Bill mentioned that Moss couldn't hide behind inflated test scores forever. He doesn't appear in season 14, partially due to Burkley's death in 2013 as well as the general aging of the characters making most of the middle school characters outside the main cast and Chane unnecessary.\n* Coach Kleehammer (voiced by Toby Huss) is the football coach at Tom Landry Middle School. He has a difficult time relating to things outside of football and often uses football-related expressions in everyday speech. Kleehammer is portrayed as being sexist, having displayed a very negative attitude towards women's sports.\n*Stuart Dooley (voiced by Mike Judge), usually referred to by his surname, is Bobby's deep-voiced, laconic classmate with shaggy hair. He is also the resident bully. He always sardonically intones something obvious after witnessing an event (for example, to Bobby after witnessing Mega-Lo Mart exploding, \"Your Dad got blown up.\"). He also is something of a rebel — he pulled down Peggy's pants, and he is seen smoking. His style of speech is similar to Butt-Head from Mike Judge's previous show, Beavis and Butt-Head, albeit with a deeper inflection and without Butt-Head's trademark laughter or lisp.\n* Clark Peters (voiced by Pamela Adlon) is an overweight bully at Tom Landry Middle School. He has a blond ponytail and speaks as though he has a perpetual head cold (Minh once referred to him as \"that creepy booger-nosed kid\"). He often targets Bobby and sometimes forces him to do homework for him. He is something of a cohort to Dooley, which combined with his blond hair and slow wit gives him a vague resemblance to Beavis.\n* Randy Miller (voiced by Cheryl Holliday in 1997–1999, David Herman in 2000–2009) is the quintessential \"nerd\" who loves to tattle on people and then see them being punished. Bobby, Connie and Joseph do not like him very much, though Bobby once stopped Dooley from beating him up. He is very proud of his father being a successful patent lawyer. Although once a somewhat prominent character, he largely vanished after the fifth season.\n* Chane Wassonasong () (voiced by Pamela Adlon from 2000 to 2007, Ki Hong Lee from 2025 to present) is an obnoxious and rude classmate of Bobby and Connie. Connie's parents are constantly trying to fix her up with Chane, also Laotian-American, as they see him as a very preferable alternative to Bobby (and because Chane is the son of prominent Laotian-American Ted Wassonasong, with whom they are constantly trying to curry favor), which briefly succeeds by season 14, though Connie later dumps him after her parents divorce becomes public and Chane isn't supportive. In season 14, Chane is less antagonistic to Bobby but is a spoiled rich kid and is more into a party scene with his frat brothers, appearing to have taken his family's wealth for granted when he casually mentions he wrecked his WRX \"again\".\n* Emily (voiced by Ashley Johnson) is a sixth grade blonde pig-tailed hall monitor who takes her position quite seriously. She often serves as the gatekeeper of Principal Moss' office.\n* Ramon Alejandro (voiced by Pamela Adlon) is a classmate of Bobby's of Hispanic descent. He is among the more popular students and is very popular with the girls.\n* Lori (voiced by Jillian Bowen) is a classmate of Bobby and Joseph. Joseph once dated her, having made out in closets throughout the school on several occasions. Very late into the series, Lori insisted that she and Joseph go \"all the way\" in their relationship, but Joseph broke up with her before it could happen.\n* Eugene Grandy (voiced by John Ritter) is the school's music teacher seen in four episodes.\nArlen VFW\n* Sgt. \"Topsy\" Toppington (voiced by Stephen Root) is an old wartime buddy of Cotton Hill. He often acts as an accomplice to Cotton's schemes. Topsy could inflate his cheeks in a manner similar to Dizzy Gillespie, and according to Cotton, he was legally blind and had to have all his teeth pulled out because they were badly decayed. In \"DaleTech\", Cotton mentions that Topsy died six months prior during a conversation with Peggy. In \"Death Buys a Timeshare\", Cotton mentions that Topsy has left his estate to him. Topsy was apparently cremated and his remains flushed down a toilet once used by General George S. Patton, as his name can be seen along with all of Cotton's war buddies above the toilet.\n* Stinkey (voiced by Edward Asner),  a name shared by several of Cotton Hill's surviving wartime friends, the most notable of whom is overweight and suffers from diabetes. At least one of them died at some point later in the series as it is mentioned by Cotton and his name is among the veterans' ashes flushed down the toilet that General Patton used. Cotton spoke his name as he lay dying in the VA hospital.\n* Irwin Linker (voiced by Jack Carter) is one of Cotton Hill's wartime friends who is often seen with an oxygen tank. He was one of the few to not be named Stinky, Fatty, or Brooklyn.\nOther recurring characters\n* Ted and Cindy Wassonasong () and () (voiced by Toby Huss 2000 to 2008, Kenneth Choi 2025 to present and Lauren Tom respectively) are affluent Laotian-American acquaintances of the Souphanousinphones. Kahn and Minh envy and resent them, but go to great lengths to gain their favor, such as inviting them over for dinner. They live in the upscale, gated community of Arlen Heights, and are prominent members of the upscale Nine Rivers Country Club; in one episode Ted tried to get Hank to join the club (because Nine Rivers did not have any Caucasian members and needed at least one to qualify as a PGA event hosting site) but Hank's initial interest in joining vanished when he learned Ted didn't even know what Hank did for a living and was trying to use Hank for his own interests. Ted and Cindy tolerate the Souphanousinphones but, in reality, look down upon them. They joined the Episcopal Church despite being Buddhist because it was \"good for business\". Ted is also blatantly hypocritical. He referred to Kahn as a \"Banana\" (an ethnic slur to identify an Asian American apparently lost in touch with their ethnic identity; more comfortable with Western society) even though Ted possesses far greater degree of luxury commodities, and lost most of his accent. He also helped pass a city ordinance banning the use of trans fats only to be immediately found consuming the very foods he helped prohibit. In season 14, Ted is an investor and silent partner in Bobby's restaurant and, with Bobby appearing to be more responsible with his money than Chane is, seems to have more of a respect for Bobby than his own son.\n* Octavio (voiced by Mike Judge) is a Hispanic quasi-mercenary who does various bizarre favors for Dale when paid enough money, such as breaking into the Hills' home in the middle of the night to look for Dale's kidney (earlier in the episode, Hank, who had power of attorney over Dale for three days while Dale was in the hospital to give his kidney to NHRA drag racer John Force, was forced to help Octavio bash his own car with rebar to try and claim motor accident insurance, a scheme he had cooked up with Dale). On his chest is a large Rob Zombie tattoo which he once tried to pass off as a tattoo of Jesus in order to join Luanne's Bible study group because she was conducting lessons in her pool while wearing a two-piece bikini. His appearance was modelled after actor Danny Trejo (who would eventually join the show as the voice actor for Enrique). His last appearance was a non-speaking cameo in Just Another Manic-Kahn Day.\n*  M.F. Thatherton (voiced by Burt Reynolds in his first appearance, Toby Huss in later appearances) is a former employee of Strickland Propane who strikes out on his own and opens up the crooked Thatherton Fuels company across the street from Strickland. He dresses like an old school rich cowboy with a ten-gallon hat and cowboy boots. An untrustworthy type, Thatherton is sometimes a foil to Hank Hill and Buck. His sins are similar to Buck Strickland's (womanizing, gambling, using people), but more pronounced. Thatherton openly considers customers as little more than moneymakers and hires centerfold models or Hooters girls to bait potential propane customers. Hank, who also despises him, was forced to work for Thatherton for a week due to Buck losing at a game of cards. Whenever his name is mentioned, any of the Hills remark angrily, \"Thatherton!\".\n* Reverend Thomason (voiced by Maurice LaMarche) – A minister at Arlen First Methodist Church. He was replaced by Reverend Karen Stroup upon retiring to start an online ministry.\n* Reverend Karen Stroup (voiced by Mary Tyler Moore in 1999, Ashley Gardner from 2000 to 2010) – The first female minister of Arlen First Methodist Church. She is originally from Minnesota, but is assigned to Arlen after Reverend Thomason left to start an online ministry. She and Bill become a couple, but he broke up with her when she moved in and it felt like everything was moving too fast. The congregation also objected to any relationship she might have as a woman of the cloth.\n* Jimmy Wichard (voiced by David Herman) – Jimmy is the town imbecile, and the main antagonist in \"Life in the Fast LaneBobby's Saga\". He has had several jobs, including concession manager at the racetrack and outsider artist. Dale notes that he may have given himself brain damage from staring into the sun for too long, although \"he can't have been too bright to do it in the first place.\" Jimmy has a hair-trigger temper and a fractured speaking style, and has been shown to be very selfish but also easily dismissed when he ineffectually tries to get advantages over other people. Like Peggy, he is easily conned into believing he is smarter than he is.\n* Chuck Mangione (voiced by himself) is a famous jazz trumpeter and flugelhorn player, and his hit song \"Feels So Good\" is played frequently on the show. He shamelessly promotes Mega-Lo Mart until he grows tired of going to every new store opening (he told Dale that he didn't read the contract properly, stating that Mega-Lo Mart opened 400 new stores per year and it left him no time to tour, record or be with his family). This forced him to disappear where Dale discovers he has become a hermit, living within the Arlen Mega-Lo Mart in a \"Toilet Paper Castle\" and stealing stocked items at night when the store is closed. When he tells Dale that he disappeared to \"stick it to the man\", Dale decides to keep his secret and Mangione goes on living in the store undetected.\n*  (voiced by Mike Judge) is a gun-toting priest antihero on the telenovela Los Dias y Las Noches de Monsignor Martinez, a favorite program of many of the principal characters. Clips of his program are often inserted into episodes as part of a running gag. In one of the episodes, Hank mentions that Martinez is an undercover cop. The clips of his episodes which appear on the series usually feature him just about to kill one of his nemeses while solemnly uttering his catchphrase, \"Vaya con Dios\"; often preceding a melodramatic explosion. In the 8th-season episode \"Flirting with the Master\", Eduardo Filipe, the actor who plays Martinez, invites Peggy to Mexico City to tutor his children, and she mistakes his interest for romantic passion. A live-action pilot was filmed featuring the character, but was scrapped before airing. The pilot was discovered by collectors in 2020.\n* Lane Pratley (voiced by Dwight Yoakam in the first appearance, Dave Thomas in later appearances) is a sleazy car dealer who owns \"Pratley Ford\" and \"Pratley Hyundai\", and as he says, \"I got my eye on Pratley Cadillac—my daddy ain't doing so good.\" Lane once owned a women's roller derby team that Peggy and Luanne skated for, before Peggy organized the skaters into a buyout and quit.\n*  (voiced by David Herman) was the slacker boyfriend of Luanne. He was killed by his own negligence while working at Mega-Lo Mart in the season two episode \"Propane Boom\", when he dragged a propane tank by the valve instead of its handles, causing the tank to leak and explode. The character did return once (as an angel) in the season three episode \"Wings of the Dope\", where Kahn buys Buckley's trampoline for his backyard and Luanne (who has been stressed over beauty school finals) begins seeing Buckley's angel.\n* Officer Brown (voiced by Fred Willard) is a local police officer in Arlen who is not averse to tampering with evidence and taking bribes from illegal food operations, as explained in episodes 20 and 11 (respectively) of season 12. In the episode \"Cops and Roberts\", Principal Moss states that \"Officer Brown may be a disgraced cop who tampered with evidence ... but this here used to be a man\". His appearance is modeled after his voice actor. Brown (as well as other Arlen police officers) were seen to be 'starstruck' by fictional ex-Dallas Cowboy player Willie Lane (and his 1978 Super Bowl ring) but was unafraid to arrest him for felonies against Hank and Kahn even after finding out who he was in the episode \"New Cowboy on the Block\".\n* Jack (voiced by Brian Doyle-Murray) is Hank's mentally unstable barber. Eventually, his distress affects his ability to style hair, causing Hank great embarrassment. Jack was almost forced out of business when a trendy salon named Hottyz opened across the street, but he was able to secure Luanne and Bill's services after Hottyz fired them when they learned Bill was not the homosexual hairstylist he'd been posing as.\n* Eustace Miller (voiced by David Herman) is a wimpy, mustachioed patent lawyer and father of Bobby's classmate Randy.\n* Bob Jenkins (voiced by Henry Gibson) is a veteran reporter for The Arlen Bystander and is Peggy's main rival there. His left eye was scraped out of his skull because he had a brain tumor, leading him to wear an eye patch. When Peggy thinks the \"Waffle House beat\" is beneath her, Bob takes it over and breaks the story of Dale as \"The Smoking Bandit.\" In \"Bystand Me\" (his debut episode), he tells Peggy that whenever he gets writer's block, he hires a prostitute.\n* Miss Kremzer (voiced by Jennifer Coolidge) is the teacher at the beauty school Luanne went to. She is very condescending towards Luanne in her first appearance. After Hank's speech that gets Kremzer to change her grade for Luanne, she acts sympathetic along with the other students, but is right back to her previously displayed bad attitude in subsequent episodes.\n* Sharona Johnson (voiced by Dawnn Lewis) is a girl that goes to the same beauty school that Luanne went to, Sharona is hardworking and intelligent but is also very arrogant and puts down Luanne constantly.\n* Chris Sizemore (voiced by Chris Elliott) is a real estate agent that Peggy once worked for after she wrote a scathing article about him in the Bystander for which she was consequently fired.\n* Gary Kasner (voiced by Carl Reiner) is an elderly Jewish man and Tilly Hill's boyfriend. He served on a submarine during Korea, but tells Bobby he didn't see any action during the conflict. Hank was initially not happy with his mother's decision to pursue a relationship again, but Hank changed his mind when Gary stood up for Tilly against Cotton. Hank was disappointed when Tilly and Gary eventually broke up.\n* Tom Chick (voiced by Phil Hendrie) is the manager of the Channel 84 news division.\n* Nguc Phong () (voiced by James Sie) is a Laotian who is one of Ted Wassonasong's friends.\n* Fred Ebberd (voiced by Chelcie Ross) is a member of the city council who also works at a movie theater. He appeared in only two episodes, but is mentioned by Hank in several others. Hank mentions voting for him and having no regrets about it even though he has expressed disappointment with his performance.\n* Anthony Page (voiced by David Herman) is an ultra-liberal social worker from Los Angeles, whose attempts to help people cause more harm than good. Physically frail and called \"twig boy\" by Hank, he considers carpal tunnel a disability. In the pilot episode, he is assigned to investigate the allegation that Hank is beating Bobby. He appears in a later episode as Leon's advocate when Hank fired him for drug-abuse.\n* Carl (voiced by Dennis Burkley) is a restaurateur who owns and operates a series of establishments that serve regional cuisine. In the episode \"Love Hurts and So Does Art\", he notes that his restaurant, the Showbiz Deli, had served Italian food before switching to New York-style deli fare, as Italian food requires cooking. After the apparent failure of the Showbiz Deli, Carl appears again in Bad Girls, Bad Girls, Whatcha Gonna Do?, again having switched his menu, this time to sushi, another food that can be served raw. Carl is not a stickler for quality in his cuisine, noting that he orders chopped chicken liver in a large drum, uses canned tuna to make sushi, and serves chicken tempura with mashed potatoes and gravy. He is not to be confused with the similarly named school principal Carl Moss, who was also voiced by Burkley.\n*Collete Davis (voiced by Christina Applegate) is the Owner of Hottyz in the episode \"My Hair Lady\" and a trendsetting hairstylist responsible for bringing the messy ponytail to Arlen. She hired both Luanne Platter and Bill Dauterive to work at her salon shortly after Luanne dropped out of college. Both become popular stylists until Bill admits to not being gay. Collete fires them both despite an impassioned speech by Luanne about acceptance and is not seen again until appearing in a non-speaking role during the episode \"Lucky's Wedding Suit\".\n*Cane Skretteburg (voiced by Tré Cool) is the lead singer of a punk rock garage band and one of the main antagonists in the episode \"The Man Who Shot Cane Skretteburg\". Hank confronts this character with his band (voiced by the other members of Green Day - Billie Joe Armstrong as Face, Mike Dirnt as Zeus) because their music was too loud. Later in the episode they have three paintball wars, the first two Hank, Boomhauer, Bill, and Dale lose but win the last one. The lost bet led the band to give up their amplifiers and exposed how untalented they were. Cane and his band later appear in the episode \"Master of Puppets\".\n* Emilio (voiced by Anthony Campos) is the Mexican-American sous-chef of Robata Chang's in the revival and Bobby's most reliable employee, having worked for several restaurants prior to working under Bobby.\nReferences\nExternal links\n*"
    }
  ]
}