{
  "content": [
    {
      "type": "text",
      "text": "# List of 17th-century shipwrecks in Australia\n\nThis list includes all ships known or thought to have been shipwrecked on the coast of what is now Australia up to 1699, including those that were refloated. All of them occurred on the west coast; that is, on the coast of what is now Western Australia.\nList of 17th century shipwrecks in Australia\n{| class=\"wikitable\"\n|-\n! Vessel !! When wrecked !! Where wrecked !! Status !! Remarks\n|-\n| Tryall || 24 May 1622 || Tryal Rocks || Sunk; found || British East India Company ship; departed Plymouth for Batavia (now Jakarta, Java) on 4 September 1621; wrecked on the Tryal Rocks on 25 May 1622; wreck discovered in 1969\n|-\n| 't Wapen van Hoorn || June 1622 || West coast || Refloated || VOC ship; departed Texel on 26 December 1621; ran aground near Shark Bay in June 1622, but was refloated; arrived in Batavia on 22 July 1622.\n|-\n| Vianen || 25 January 1628 || Barrow Island vicinity || Refloated || Dutch East India Company (VOC) ship; departed Batavia on 6 January 1628; blown south by strong headwinds, and ran aground in the vicinity of Barrow Island (Western Australia), but was refloated; arrived at the Cape of Good Hope on 24 May; arrived at Goeree on 8 November; shipwrecked in the Sunda Strait the following year.\n|-\n| Batavia || 4 June 1629 || Morning Reef, Houtman Abrolhos || Sunk; found || Dutch East India Company ship; left Texel for Batavia on 29 October 1628; left the Cape of Good Hope on 22 April 1629; shipwrecked on the Morning Reef; the captain and senior officers sailed the ship's longboat to Batavia; the remaining passengers and crew were left behind; a ship was sent to collect the survivors, only to find that mutineers had murdered over 100 of them; wreck found in 1970.\n|-\n| Vergulde Draeck || 28 April 1656 || Off Ledge Point || Sunk; found || Dutch East India Company ship; left Texel on 4 October 1655; left the Cape of Good Hope on 12 March 1656; wrecked off Ledge Point; survivors sent a boat to Batavia to ask for help; three rescue missions failed to find the survivors; wreck found in 1963.\n|-\n| Goede Hoops boat || July 1656 || 100 kilometres north of Fremantle || Sunk; not found || Dutch East India Company ships Goede Hoop and Witte Valke were sent from Batavia to rescue survivors of the Vergulde Draeck; search party sent ashore in Goede Hoops boat, but the boat was smashed against rocks and sunk; 8 sailors drowned; 3 more disappeared ashore.\n|-\n| Waeckende Boeys jawl || 22 March 1658 || Moore River || Refloated, wrecked on Java || Dutch East India Company ships Waeckende Boey and Emerloort were sent from Batavia to search for the Vergulde Draeck; 14 men were sent ashore in the Waeckende Boeys jawl; a storm developed, and the jawl was driven northward and wrecked on an island; the Waeckende Boey gave the men up as lost, and returned to Batavia; the ship was repaired and sailed north where it was wrecked again on the coast of Java; the four survivors walked overland to Jepara.\n|-\n| Ridderschap van Holland || After 5 February 1694 || Between Cape Colony and Batavia (now Jakarta) || Not found || Dutch East India Company ship; departed Wielingen on 11 July 1693; departed the Cape of Good Hope on 5 February 1694; did not arrive at Batavia; remains of a shipwreck found on Pelsaert Island in 1727 may be that of the Ridderschap van Holland; any remaining archaeological evidence was destroyed by guano mining in the 20th century.\n|}\nNotes\n* Both the National Shipwreck Database and the Western Australian Shipwrecks Database list an unidentified ship that ran aground at Victoria Harbour on the south coast of Western Australia in 1627. According to the National Shipwreck Database, it was refloated. The Western Australian Shipwrecks Database lists as sources Heeres (1899) p. 51; The West Australian, 4 February 1937; The West Australian, 24 February 1937; and research notes of D. C. Cowan. The first of these appears to be in error, as Heeres makes no mention of a ship grounding on the south coast on that page.\nGeneral references\n*\n*\n*"
    }
  ]
}