{
  "content": [
    {
      "type": "text",
      "text": "# List of international presidential trips made by Ronald Reagan\n\nThis is a list of international presidential trips made by Ronald Reagan, the 40th president of the United States. Reagan made 24 international trips to 26 different countries during his presidency, which began on January 20, 1981 and ended on January 20, 1989.\nReagan visited four continents: Europe, Asia, North America, and South America. He made seven trips to continental Europe, three to Asia and one to South America. He is perhaps best remembered for his speeches at the 40th anniversary of the Normandy landings, for his impassioned speech at the Berlin Wall, his summit meetings with Mikhail Gorbachev, and riding horses with Queen Elizabeth II at Windsor Park.\nSummary\nThe number of visits per country where President Reagan travelled are:\n* One visit to Barbados, Brazil, China, Colombia,  Costa Rica, Finland, Grenada, Honduras, Iceland, Indonesia, Ireland, Jamaica, Portugal, South Korea, Soviet Union, Spain, Switzerland\n* Two visits to Belgium, Italy, Japan, Vatican City\n* Three visits to United Kingdom and West Germany\n* Four visits to France\n* Five visits to Canada and Mexico\nFirst term (1981–1985)\n1981\n{| class=\"wikitable sortable\" border=\"1\" style=\"margin: 1em auto 1em auto\"\n|-\n! style=\"width: 3%;\"|\n! width=120|Country\n! width=100|Areas visited\n! width=70|Dates\n! width=550|Details\n! Image\n|-\n|1\n|\n|Ottawa\n|\n|State visit. Met with Governor General Edward Schreyer and Prime Minister Pierre Trudeau. Addressed parliament.\n|\n|-\n|2\n|\n|Ottawa,Montebello\n|\n|Attended the 7th G7 summit.\n|\n|-\n|3\n|\n|Cancun\n|\n|Attended the North–South Summit on International Cooperation and Development. Met with the heads of state and government of Algeria, Bangladesh, Canada, China, France, Guyana, India, Japan, Mexico, Nigeria, the Philippines, Saudi Arabia, Sweden, Tanzania, the United Kingdom, Venezuela and Yugoslavia.\n|\n|}\n1982\n{| class=\"wikitable sortable\" border=\"1\" style=\"margin: 1em auto 1em auto\"\n|-\n! style=\"width: 3%;\"|\n! width=120|Country\n! width=100|Areas visited\n! width=70|Dates\n! width=550|Details\n! Image\n|-\n|rowspan=2|4\n|\n|Kingston\n|\n|Official visit. Met with Prime Minister Edward Seaga.\n|\n|-\n|\n|Bridgetown\n|\n|Official visit. Met with the prime ministers of Barbados, Dominica, Antigua and Barbuda, St. Christopher and Nevis, and St. Vincent and the Grenadines.\n|\n|-\n|rowspan=7|5\n|\n|Paris\n|\n|State visit. Met with President François Mitterrand and Prime Minister Pierre Mauroy.\n|\n|-\n|\n|Versailles\n|\n|Attended the 8th G7 summit.\n|\n|-\n|\n|Rome\n|\n|Met with President Sandro Pertini and Premier Giovanni Spadolini.\n|\n|-\n|\n|Apostolic Palace\n|\n|Audience with Pope John Paul II.\n|\n|-\n|\n|London,Windsor Castle\n|\n|State visit. Met with Queen Elizabeth II and Prime Minister Margaret Thatcher. Addressed Parliament.\n|\n|-\n|\n|Bonn\n|\n|State visit. Met with Chancellor Helmut Schmidt and President Karl Carstens. Addressed the Bundestag and attended a meeting of the North Atlantic Council.\n|\n|-\n|\n|West Berlin\n|\n|Met with Chancellor Helmut Schmidt.\n|\n|-\n|6\n|\n|Tijuana\n|\n|Exchange of visits with President-elect Miguel de la Madrid.\n|\n|-\n|rowspan=4|7\n|\n|Brasília,São Paulo\n|\n|Official working visit. Met with President João Figueiredo.\n|\n|-\n|\n|Bogota\n|\n|Official working visit. Met with President Belisario Betancur.\n|\n|-\n|\n|San José\n|\n|Official working visit. Met with President Luis Alberto Monge and President Álvaro Magaña of El Salvador.\n|\n|-\n|\n|San Pedro Sula\n|\n|Official working visit. Met with President Roberto Suazo Córdova and with Guatemalan President Efraín Ríos Montt.\n|\n|}\n1983\n{| class=\"wikitable sortable\" border=\"1\" style=\"margin: 1em auto 1em auto\"\n|-\n! style=\"width: 3%;\"|\n! width=120|Country\n! width=100|Areas visited\n! width=70|Dates\n! width=550|Details\n! Image\n|-\n|8\n|\n|La Paz\n|\n|Informal meeting with President Miguel de la Madrid.\n|\n|-\n|rowspan=2|9\n|\n|Tokyo\n|\n|State visit. Met with Emperor Hirohito and Prime Minister Yasuhiro Nakasone and addressed the Diet.\n|\n|-\n|\n|Seoul,Demilitarized Zone\n|\n|State visit. Met with President Chun Doo-hwan. Addressed the National Assembly and visited U.S. troops.\n|\n|}\n1984\n{| class=\"wikitable sortable\" border=\"1\" style=\"margin: 1em auto 1em auto\"\n|-\n! style=\"width: 3%;\"|\n! width=120|Country\n! width=100|Areas visited\n! width=70|Dates\n! width=550|Details\n! Image\n|-\n|10\n|\n|Beijing,Xi'an,Shanghai\n|\n|State visit. Met with President Li Xiannian and Premier Zhao Ziyang.\n|\n|-\n|rowspan=3|11\n|\n|Shannon, Galway, Ballyporeen, Dublin\n|\n|Met with President Patrick Hillery and Taoiseach Garret FitzGerald. Visited ancestral home. Addressed Parliament.\n|\n|-\n|\n|London\n|\n|Attended the 10th G7 summit.\n|\n|-\n|\n|Normandy\n|\n|Attended commemorative ceremonies of the 40th anniversary of the Allied landing in Normandy. Also present were Canadian prime minister Pierre Trudeau, Queen Beatrix of the Netherlands, King Olav V of Norway, King Baudouin I of Belgium, French president François Mitterrand, Queen Elizabeth II and Jean, Grand Duke of Luxembourg.\n|\n|}\nSecond term (1985–1989)\n1985\n{| class=\"wikitable sortable\" border=\"1\" style=\"margin: 1em auto 1em auto\"\n|-\n! style=\"width: 3%;\"|\n! width=120|Country\n! width=100|Areas visited\n! width=70|Dates\n! width=550|Details\n! Image\n|-\n|12\n|\n|Quebec City\n|\n|Met with Prime Minister Brian Mulroney.\n|\n|-\n|rowspan=5|13\n|\n|Bonn\n|\n|Attended the 11th G7 summit.\n|\n|-\n|\n|Bonn,Bergen-Belsen,Bitburg,Hambach Castle\n|\n|State visit. Attended ceremonies commemorating 40th anniversary of the end of World War II in Europe.\n|\n|-\n|\n|Madrid\n|\n|State visit. Met with King Juan Carlos I and President Felipe González.\n|\n|-\n|\n|Strasbourg\n|\n|Addressed the European Parliament.\n|\n|-\n|\n|Lisbon\n|\n|State visit. Met with President António Ramalho Eanes and Prime Minister Mário Soares. Addressed the National Assembly.\n|\n|-\n|rowspan=2|14\n|\n|Geneva\n|\n|Attended the Summit Meeting with Soviet general secretary Mikhail Gorbachev. Met also with Swiss president Kurt Furgler.\n|\n|-\n|\n|Brussels\n|\n|Attended the NATO Summit Meeting. Present were the Heads of State and Government of Belgium, Canada, Denmark, Federal Republic of Germany, Italy, the Netherlands, Norway, Luxembourg, Portugal, Turkey and the United Kingdom.\n|\n|}\n1986\n{| class=\"wikitable sortable\" border=\"1\" style=\"margin: 1em auto 1em auto\"\n|-\n! style=\"width: 3%;\"|\n! width=120|Country\n! width=100|Areas visited\n! width=70|Dates\n! width=550|Details\n! Image\n|-\n|15\n|\n|Mexicali\n|\n|Informal meeting with President Miguel de la Madrid.\n|\n|-\n|16\n|\n|St. George's\n|\n|Met with Governor General Paul Scoon and Prime Minister Herbert Blaize, and with the Prime Ministers of Barbados, Dominica, Jamaica, St. Lucia, St. Christopher and Nevis, St. Vincent and the Grenadines, Antigua and Barbuda, and Trinidad and Tobago. Dedicated a memorial to U.S. servicemen.\n|\n|-\n|rowspan=2|17\n|\n|Bali\n|\n|Attended the ASEAN Ministerial Meeting. Met with Indonesian president Suharto and Philippine vice president Salvador Laurel.\n|\n|-\n|\n|Tokyo\n|\n|Attended the 12th G7 summit.\n|\n|-\n|18\n|\n|Reykjavík\n|\n|Pre-Summit Meeting with Soviet general secretary Mikhail Gorbachev. Met with President Vigdís Finnbogadóttir.\n|\n|}\n1987\n{| class=\"wikitable sortable\" border=\"1\" style=\"margin: 1em auto 1em auto\"\n|-\n! style=\"width: 3%;\"|\n! width=120|Country\n! width=100|Areas visited\n! width=70|Dates\n! width=550|Details\n! Image\n|-\n|19\n|\n|Ottawa\n|\n|State visit. Met with Governor General Jeanne Sauvé and Prime Minister Brian Mulroney. Addressed parliament.\n|\n|-\n|rowspan=4|20\n|\n|Venice,Rome\n|\n|Attended the 13th G7 summit. Met with President Francesco Cossiga and Prime Minister Amintore Fanfani in Rome.\n|\n|-\n|\n|Apostolic Palace\n|\n|Audience with Pope John Paul II.\n|\n|-\n|\n|West Berlin\n|\n|Attended celebration's commemorating the 750th Anniversary of the founding of Berlin. Met with Chancellor Helmut Kohl. Reagan gave his \"Tear down this wall!\" speech during this visit.\n|\n|-\n|\n|Bonn\n|\n|Met with Chancellor Helmut Kohl.\n|\n|}\n1988\n{| class=\"wikitable sortable\" border=\"1\" style=\"margin: 1em auto 1em auto\"\n|-\n! style=\"width: 3%;\"|\n! width=120|Country\n! width=100|Areas visited\n! width=70|Dates\n! width=550|Details\n! Image\n|-\n|21\n|\n|Mazatlan\n|\n|Informal meeting with President Miguel de la Madrid. Signed textile agreement.\n|\n|-\n|22\n|\n|Brussels\n|\n|Attended the NATO Summit Meeting. Present were the Heads of State and Government of Canada, Denmark, France, Federal Republic of Germany, Greece, Iceland, Italy, Luxembourg, Norway, Portugal, Spain, Turkey and the United Kingdom.\n|\n|-\n|rowspan=3|23\n|\n|Helsinki\n|\n|Met with President Mauno Koivisto and Prime Minister Harri Holkeri.\n|\n|-\n|\n|Moscow\n|\n|Summit meeting with General Secretary Mikhail Gorbachev. Exchanged ratifications of the INF Treaty.\n|\n|-\n|\n|London\n|\n|Met with Queen Elizabeth II, Prime Minister Margaret Thatcher and Japanese prime minister Noboru Takeshita.\n|\n|-\n|24\n|\n|Toronto\n|\n|Attended the 14th G7 summit.\n|\n|}\nMultilateral meetings\nMultilateral meetings of the following intergovernmental organizations took place during Ronald Reagan's presidency (1981–1989).\n{| class=\"wikitable\" style=\"margin:1em auto; font-size:85%; text-align:center;\"\n|-\n!rowspan=\"2\"|Group !!colspan=\"8\"|Year\n|-\n!1981 !!1982 !!1983 !!1984 !!1985 !!1986 !!1987 !!1988\n|-\n|G7 || July 20–21 Montebello||June 4–6 Versailles ||May 28–30 Williamsburg ||June 7–9 London ||May 2–4 Bonn ||May 4–6 Tokyo ||June 8–10 Venice ||July 20–21 Toronto\n|-\n|NATO ||style=\"background:#dcdcdc;\"|none||June 10 Bonn||style=\"background:#dcdcdc;\"|none||style=\"background:#dcdcdc;\"|none||November 21 Brussels||style=\"background:#dcdcdc;\"|none||style=\"background:#dcdcdc;\"|none||March 2–3 Brussels\n|-\n|}\nSee also\n* Foreign policy of the Ronald Reagan administration\n* Foreign policy of the United States\nReferences\nExternal links\n* [https://history.state.gov/departmenthistory/travels/president/reagan-ronald Travels of President Ronald Reagan]. U.S. Department of State Office of the Historian."
    }
  ]
}