{
  "content": [
    {
      "type": "text",
      "text": "# List of SIP software\n\nThis list of SIP software documents notable software applications which use Session Initiation Protocol (SIP) as a voice over IP (VoIP) protocol.\nServers\nFree and open-source license\nA SIP server, also known as a SIP proxy, manages all SIP calls within a network and takes responsibility for receiving requests from user agents for the purpose of placing and terminating calls.\n* Asterisk\n* ejabberd\n* FreeSWITCH\n* GNU SIP Witch\n* Kamailio, formerly OpenSER\n* Mobicents Platform (JSLEE[2] 1.0 compliant and SIP Servlets 1.1 compliant application server)\n* OpenSIPS, fork of OpenSER\n* SailFin\n* SIP Express Router (SER)\n* Enterprise Communications System sipXecs\n* Yate\nProprietary license\n* 3Com VCX IP telephony module: back-to-back user agent SIP PBX\n* 3CX Phone System, for Windows, Debian 8 GNU/Linux\n* Aastra 5000, 800, MX-ONE\n* Alcatel-Lucent 5060 IP Call server\n* Aricent SIP UA stack, B2BUA, proxy, VoLTE/RCS Client\n* AskoziaPBX\n* Avaya Application Server 5300 (AS5300), JITC certified ASSIP VoIP\n* Bicom Systems IP PBX for telecoms\n* Brekeke PBX, SIP PBX for service providers and enterprises\n* Cisco SIP Proxy Server, Cisco unified border element (CUBE), Cisco Unified Communication Manager (CUCM)\n* CommuniGate Pro, virtualized PBX for IP Centrex hosting, voicemail services, self-care, ...\n* Comverse Technology softswitch, media applications, SIP registrars\n* Creacode SIP Application Server Real-time SIP call controller and IVR product for carrier-class VoIP networks\n* Dialogic Corporation Powermedia Media Servers, audio and video SIP IVR, media and conferencing servers for Enterprise and Carriers.\n* Dialexia VoIP Softswitches, IP PBX for medium and enterprise organizations, billing servers.\n* GoTo Connect - Cloud phone system with unified communications and contact center capabilities.\n* Grasshopper - Virtual phone system for entrepreneurs.\n* IBM WebSphere Application Server - Converged HTTP and SIP container JEE Application Server\n* Interactive Intelligence Windows-based IP PBX for small, medium and enterprise organizations\n* Kerio Operator,  IP PBX for small and medium enterprises\n* Microsoft Lync Server 2010 & 2013\n* Mitel Communications Director\n* NEC SV7000 back-to-back user agent SIP PBX\n* NEC UNIVERGE 3C Unified Communications and Collaboration software\n* Nokia Siemens Networks hiQ8000\n* Nortel SCS500\n* Nortel SIP Multimedia Communication Server 5200\n* Objectworld UC Server\n* Oracle Communications Converged Application Server (OCCAS)\n* Oracle WebLogic SIP Server\n* Spirent SIP Server Platform\n* ShoreTel IP phone systems with unified communications and contact center built in\n* Snom One free/blue/yellow (Snom acquired and renamed pbxnsip) (SIP)\n* Speedflow Communications VoIP class 4/5 softswitches with integrated billing, transcoding, SIP-H.323 converter.\n* Sterlite Technologies Neox IPPBX, IMS - ISC, Dial Center - OmniChannel Call Center, IVR products\n* Sun Microsystems Sun GlassFish Communication Server\n* Tadiran Telecom Coral Ipx family and Aeonix softswitch\n* Tandberg Video Communication Server - SIP application server, media server and H.323 gateway\n* Unify OpenScape Voice, OpenScape 8000 SIP softswitch, mediaserver, ... (SIP)\n* Voice Elements Inventive Labs' .NET Voice Development software and SIP stack platform.\n* Zultys MX250/MX30 IP PBXs for SMB and enterprise\nClients\nFree and open-source license\n*Ekiga (formerly known as GnomeMeeting). SoftPhone, Video Conferencing and Instant Messenger. Since 2013, no longer maintained but still available under declining number of distributions.\n*Jami, with GTK/Qt GUI, also supports IAX2 protocol, for Linux, OS X, Windows GPL\n* Jitsi, a Java VoIP and Instant Messaging client with ZRTP encryption, for FreeBSD, Linux, OS X, Windows; LGPL\n* Linphone, with a core/UI separation, the GUI is using Qt libraries, for Linux, OS X, Windows, and mobile phones (Android, iPhone, Windows Phone, BlackBerry)\n* Telephone, OS X softphone written in Cocoa/Swift\n* Twinkle, using Qt libraries, GPL, for Linux\n* Yate client, using Qt libraries, GPL\nProprietary license\n* Blink, for Mac\n* Librestream's 2500 Camera, 5000HD camera, Onsight Cube (wearable/modular camera), Onsight Connect (Windows, iOS, Android).\n*LifeSize Desktop, for Windows\n* Phoner and PhonerLite, for Windows, Voice: G.711, G.722, G.726, GSM, iLBC, Speex, Opus; security: TLS, SRTP, ZRTP\n* Polycom PVX, for Windows. Voice: G.711, G.722, G.722.1, G.728, G.729A, Siren Codec; Video: H.261, H.263, H.264; Data: T.120, People+ Content, H.239, H.323 Annex Q far-end camera control\nDiscontinued\n* QuteCom, formerly named OpenWengo, using Qt libraries, GPL, for Windows, Mac, and RPM- DEB-based Linux, discontinued in 2016\n* Gizmo5, formerly PhoneGaim, discontinued in 2011\n*Empathy, using GTK libraries and Telepathy framework, GPL, discontinued in earliest visible, 2021.\n* Windows Messenger versions 4 and 5 (not to be confused with Windows Live Messenger or MSN Messenger which do not support SIP)\nMobile clients\nFree and open-source license\n* Jami for Android, iOS; GPL v3\n* Linphone for Android, BlackBerry, iPhone, Windows phone; GPL v2\nProprietary license\n* Acrobits for iOS and Android\nSession border controllers\n* Acme Packet Session Director\n* Audiocodes Mediant\n* Genband Quantix SBC\n* Ingate Systems Ingate SIParators\n* Metaswitch Perimeta\n* Kamailio\nEnabled firewalls\n* Check Point VPN-1 firewalls, include complete SIP support for multiple vendors\n* The firewall feature in Cisco IOS includes complete SIP support\n* Cisco PIX/ASA firewalls include complete SIP support\n* D-Link Firewall DFL-210/260/800/860/1600/2500 supports SIP (SIP-ALG) with firmware 2.20.01.05 and above\n* Fortinet, all FortiGates running v280/v300 builds\n* Intertex SIP transparent routers, firewalls and ADSL modems, for broadband deployments and SOHO market\n* Juniper Networks Netscreen and SRX firewalls include complete SIP Application Layer Gateway support\n* Linux Netfilter's SIP conntrack helper fully understands SIP and can classify (for QOS) and NAT all related traffic\n* Netopia Netopia supports ALG\n* PF, built-in OpenBSD firewall PF can handle the NAT through the \"static-port\" directive and the bandwidth control through the built-in queuing system of SIP connections\n* pfSense, a firewall/router distribution based on FreeBSD and PF; has QoS that properly tags VoIP traffic and a SIP proxy package that is available for NATed endpoints. Its functionality can be expanded with packages like FreeSWITCH, a free/open source software communications platform for making SIP, voice and chat driven products.\n* Secure Computing, SnapGear firewall includes siproxd SIP proxy, Sidewinder 7 firewall includes a SIP proxy\n* SonicWall, supports SIP\n* ZyXEL ZyWALL P1, 2Plus, 5 UTM, 35 UTM, 70 UTM, 1050, USG 100, USG 200, USG 300, USG 1000 supports SIP-ALG\nLibraries\n* oSIP\nTest tools\n* Codenomicon Defensics: commercial test automation framework\n* Ixia (company) commercial SIP-VoIP and Video test and emulation and load test platform\n* Mu Dynamics: commercial SIP-VoIP, RTSP-IPTV Triple Play service assurance platform\nSee also\n* Comparison of VoIP software\n* List of video telecommunication services and product brands\n* Mobile VoIP\nReferences"
    }
  ]
}