{
  "content": [
    {
      "type": "text",
      "text": "# List of The Ancient Magus' Bride episodes\n\n''The Ancient Magus' Bride'' is an anime television series based on Kore Yamazaki's manga series of the same name. A three-part prequel original animation DVD (OAD) was announced in the fifth volume of the manga, titled . It is directed by Norihiro Naganuma and written by Kore Yamazaki, with scripts by Aya Takaha. Wit Studio produced the animation and Production I.G is credited with planning and production. Hirotaka Katō designed the characters and Bamboo is in charge of the background art. The series' music is composed by Junichi Matsumoto and produced by Flying Dog. The episodes were bundled with the sixth, seventh and eighth volumes of the manga, between September 10, 2016, March 10, 2017, and September 9, 2017. The first episode was shown in theaters for two weeks, starting on August 13, 2016; the second episode premiered on February 4, 2017; and the third episode premiered on August 19, 2017. Crunchyroll began streaming the first episode on September 10, 2016. An anime television series adaptation was announced on March 10, 2017, and aired from October 7, 2017, to March 24, 2018, on MBS, Tokyo MX, BS11 and other Japanese channels. Junna performed the opening theme \"Here\", and Hana Itoki performed the ending theme . The second opening theme is \"You\" by May'n, and the ending theme is  by Aiki & Akino from bless4. Funimation streamed an English dub.\nA second three-part OAD series titled  was announced in March 2021, and the episodes were bundled with the sixteenth, seventeenth and eighteenth volumes of the manga, released on September 10, 2021, March 10, 2022, and September 9, 2022. The OAD series is animated by Studio Kafka, which was established by Japanese production company Twin Engine for producing the project. It was directed by Kazuaki Terasawa, with scripts by Aya Takaha and Yoko Yonaiyama. Hirotaka Katō returned to design the characters, and Junichi Matsumoto returned to compose the music.\nA second season was announced on September 5, 2022. Studio Kafka returned from the second OAD series to produce the season, with Kazuaki Terasawa returning to direct. Chiaki Nishinaka joins Aya Takaha and Yoko Yonaiyama in writing the screenplay. Hirotaka Katō and Junichi Matsumoto are also returning as character designer and composer. The first cour aired from April 6 to June 22, 2023, on Tokyo MX, BS11, SUN, and AT-X. For the first cour, the opening theme is \"Dear\" performed by Junna, while the ending theme is  performed by edda. The second cour aired from October 5 to December 21, 2023. For the second cour, the opening theme is  performed by Junna, while the ending theme is \"fam\" performed by Yuyu.\nSeries overview\n| end1       =\n| color2     = #B11000\n| link2      = #Season 2 (2023)\n| episodes2  = 24\n| episodes2A = 12\n| start2A    =\n| end2A      =\n| episodes2B = 12\n| start2B    =\n| end2B      =\n}}\nEpisodes\nSeason 1 (2017–18)\n| director   = 15\n| directorR  =\n| aux2       = 12\n| aux2T      = Storyboarded by\n| aux2R      =\n| airdate    = 12\n| episodes   =\n| ShortSummary    = Elias the mage, bids five million pounds in an auction and wins Chise, a Japanese orphan shunned by society who decided to sell herself into slavery. They move to Elias' house in the English countryside and he announces she will be his apprentice. He asks her to bathe, during which fairies visit and reveal she is a Sleigh Beggy, a type of mage who unconsciously attracts magical creatures who can help her in need, though helping them may harm as easily as it helps. That night, the fairies convince Chise to walk through the woods where they attempt to kidnap her to spite Elias. After Chise insists on staying with Elias, he chases away the fairies and reveals he knew their plans, and used the opportunity to show Chise a magical creature's idea of \"help\". Elias tells Chise he wants her to become his wife.\n| LineColor       = 373021\n}}\n| ShortSummary    = Chise awakens having slept for two days after her fairy ordeal. Elias takes her shopping to a magus shop disguised as a bookstore; Chise meets the shop owner, Angelica Burley, a Magus Craft Artificer making magical tools. When she learns about the adoption and proposal, she angrily sends him out. Angelica teaches Chise about alchemy, while magic is closer to being a miracle capable of bending reality with help from magical creatures. After Angelica crafts a crystal flower, Chise has a flashback of her mother in the field, causing Angelica’s workshop to fill with hundreds of crystal flowers. However, Elias stops them from spreading. Angelica sells Chise a magical knife, coat and several other magical items. As they return home they meet Simon Cullum, who asks Elias for a favor in return for the Church turning a blind eye to his activities. Elias is tasked with heading to Iceland to investigate the dragons there. Once they arrive, Chise is kidnapped by a dragon and its caretaker Lindel.\n| LineColor       = 373021\n}}\n| ShortSummary    = Chise wakes up at the nesting ground and meets a wise dragon named Uncle Nevin, who is dying and turning his body into a tree. He explains that dragons are not afraid of death and live longer without regrets. Chise remembers being so alone she considered suicide, but Nevin is glad she chose to live or Elias never would have found her. In his final moment, Nevin shares with her his memories of flying. Elias regrets that as human populations grow Chise may one day be one of the last surviving mages. Nevin dies transforming his body into a tree covered in white flowers and tells Chise that when the time comes and she needs a wand, he would be happy for her to use one of his branches, as thanks for making his final moments happy. Chise feels she has learned something about living a happy life. Before leaving, Chise collapses after expending magic and sharing memories with Nevin.\n| LineColor       = 373021\n}}\n| ShortSummary    = Chise awakens on a train with Elias. They meet a cat messenger who informs Elias the Cat King is waiting. Chise learns the rumour she is a special person. Chise sees a mysterious woman before meeting the Cat King, who reveals there is a problem within the cat kingdom. Elias begins investigating while Chise learns about the history of the cat kingdom. Years ago, a man who enjoyed killing cats was killed by the first Cat King and his corrupted soul was imprisoned on an island. Chise is kidnapped by the mysterious woman who drops her into the lake. There, Chise meets Mina, a deceased woman whose husband, Matthew, went mad after she died. Chise resolves to free them. Elias saves Chise and asks her to cleanse Matthew. Chise prepares her spell, but is stopped by the mysterious woman and a man called Renfred, sorcerers who want the corrupted Matthew for other purposes. Renfred accuses Elias for using Chise and hiding the truth about Sleigh Beggies having a limited life span.\n| LineColor       = 373021\n}}\n| ShortSummary    = The mysterious woman, Alice, explains Sleigh Beggies are valuable because they continuously generate magical power, but the strain it puts on the body results in an early death. Renfred offers to free Chise but she chooses to stay with Elias. Elias keeps the two sorcerers away while Chise performs the cleansing spell. Inside Matthew’s mind, Chise witnesses him asking a sorcerer to cure Mina. The sorcerer teaches Matthew how to make a potion that steals cats’ nine lives to make Mina healthy. They force Mina to drink and she dissolves into liquid. The sorcerer in reality had used Mina to test his soul manipulation spell. Matthew was then killed by the Cat King. Mina had wanted Chise to erase her and Matthew from existence, since the corruption prevented them from finding their way to the afterlife, condemning them to eternity in the darkness. The Cat King offers her ninth life to act as their guide. Chise instead uses the fairies' power over wind to carry Mina and Matthew to the afterlife where they happily reunite after so long apart. While watching them, Chise cannot help but wonder how many years she has left.\n| LineColor       = 373021\n}}\n| ShortSummary    = With Matthew’s soul cleansed, Renfred and Alice leave and meet the sorcerer who killed Mina. Elias informs Chise she probably only has three years of life remaining, but he believes he has found a method of preventing her death. Chise promises to stay by his side before she passes out. Chise remains unconscious for two weeks, limiting her physical functions in favor of restoring her magic faster. They meet Titania, Queen of the Faeries, and her husband, King Oberon, before Chise wakes up. Chise surprises the king by running straight to Elias instead of being frightened of him. The king believes Chise and Elias do not have children. Chise wonders about this while Elias experiences an unknown feeling in his gut, which amuses Titania. As they leave Oberon wonders whether Chise and Elias will stay together. Titania believes it would make more sense to guess exactly how many children they end up having. While returning home, Chise wishes she had met Elias years ago. Elias assures her it does not matter, since he intends on curing her so they can spend decades together.\n| LineColor       = 373021\n}}\n| ShortSummary    = The sorcerer, Cartaphilius, threatens to use Alice in an experiment if Renfred fails him again. Elias is asked to discover if a Grimm in a nearby graveyard is dangerous. He gives Chise a magical ring to reduce the amount of magic she generates. At the graveyard, they find that a young woman was killed. Chise is attacked by a dark magical creature, but is saved by a young man who crushes the creature before collapsing from bite wounds. He suddenly transforms into the Grimm. Alice tries to take the Grimm, but Chise knocks her unconscious with a sleeping potion. The Grimm, called Yuris, cannot remember who injured him. Alice reveals Cartaphilius wants to turn Yuris into a Chimera. Elias appears and decides Yuris is safe. Alice asks Elias to help against Cartaphilius, who took Renfred's arm and created the Chimera that killed the woman. Elias agrees since the Church was probably going to ask him to do it anyways. Cartaphilius then attacks Chise.\n| LineColor       = 373021\n}}\n| ShortSummary    = Elias attacks Cartaphilius’s Praying Mantis Chimera. Chise experiences Yuris’s memories of Isabelle and suddenly awakens, quickly rushing to stop Elias, unafraid of his true form. Renfred appears and shoots Cartaphilius. Elias returns to normal, believing Chise is courageous. Cartaphilius returns to life and summons a Spider Chimera. Chise stops Yuris and unleashes her magic, summoning Tarantula hawks to kill the spider. Elias stops her, as spells used to change the rules of nature are forbidden. They are suddenly teleported away by a Will-o'-the-wisp (Blue Flame). It berates Yuris for clinging to his memories of Isabelle. Yuris finally accepts that Isabelle is dead and asks to become Chise’s familiar. Cartaphilius reappears but has his arm shot off by Alice. Chise makes Yuris her familiar and renames him Ruth. Empowered by Chise, Ruth destroys the Chimera. Cartaphilius decides to leave, but reveals he has spent eternity experimenting to free himself of the pain his body is cursed with. Renfred and Alice depart. Blue Flame retrieves the souls from the chimeras and guides them to the afterlife.\n| LineColor       = 373021\n}}\n| ShortSummary    = Since the incident with Cartaphilius, Elias stays in his bedroom and avoids everybody. Silver, the fairy housekeeper, requests Chise and Ruth to go shopping. At the town, they meet Angelica, who learns Chise has become dependent on Elias. Chise realizes Angelica is right. Chise enters Elias’s room, finding that he is stuck in his inhuman form. Chise stays with him all night. The next day, Elias leaves, so Chise and Ruth try to find him. Chise meets a Leanan sídhe, a type of Fairy living off of a human's lifeforce that is haunting a wise man named Joel, but does not steal the lifeforce. Chise believes the Leanan sídhe loves Joel, but the Leanan sídhe insists such a thing is impossible, before giving Chise a kiss and telling her to visit Joel someday. Chise finds Elias hiding in the forest and becomes upset with him. Elias promises he will tell her everything when he is ready. A fairy familiar then appears with a message from Lindel asking Chise to visit the dragons.\n| LineColor       = 373021\n}}\n| ShortSummary    = Chise struggles to control her magic and Lindel offers to make a wand from Uncle Nevin's tree for her. Chise worries about being separated from Elias, but she and Ruth travel to the land of dragons without him. After meeting Lindel, Chise sets about finding a suitable branch to become her wand. Back home Elias is noticeably upset at Chise’s absence, remarking that the house feels colder without her. Via a magical messenger bird Elias speaks with Adolf Stroud, an administrator from The College wanting to talk about Chise’s future. Lindel tells Chise how he first met Elias hundreds of years ago walking through a snowy forest alone. He took him to his master, Rahab, who cannot identify what he is. Elias himself cannot remember anything about where he came from except for the colour red. Rahab decides Lindel should take him as his apprentice and names him Elias. Renfred then confronts Elias and warns him that he will ruin Chise's life if he does nothing.\n| LineColor       = 373021\n}}\n| ShortSummary    = Lindel tells Chise about the time he spent training Elias. He noticed while Elias was a quick learner, he had trouble understanding humans. On a occasion, Elias almost killed several villagers who attacked Lindel. Elias tells Lindel he thinks he ate humans once and still has urges to do so. Despite learning this, Chise insists he has never frightened her. Lindel suggests that she tell Elias exactly how she feels. Chise is instructed to carve Nevin's branch into a wand. As night falls Lindel demonstrates his power and sings a beautiful song that causes flowers to bloom. Chise accidentally casts a mirror spell on the lake, through which she can see Elias. Elias tells her how he feels, that their home feels cold without her, despite it being summer. Chise says she is ready to tell him what she could not tell before and promises to return home after using the wand. Lindel complains he feels like a father raising two children. Silver buries the magical bird used to relay Renfred and Adolf’s voices to Elias, implying Elias killed the bird after they warned him about the future.\n| LineColor       = 373021\n}}\n| ShortSummary    = With Chise still away Elias thinks about how close he has become to her. With Chise finished carving her wand, Lindel sings a new spell, combining the wand with magical gems and Chise’s hair. As Chise holds her wand she has a vision of the spirit realm where she meets Uncle Nevin. She admits her feelings for Elias worry her as she had tried to stay distant in case he didn’t want her anymore. Nevin tells Chise he is grateful her mother chose to protect her because she never could have helped people otherwise. He tells her to think about what she wants to do with her life. When Chise awakens she declares with a smile she has something to tell Elias and casts a powerful spell to fly back to Elias in the form of a giant fiery phoenix. As she arrives in Elias's arms he becomes happy: their home feels warm again. Before Chise can tell him what she wants to say she falls asleep from using magic. Chise dreams about a time when her parents were happy then awakens after two days asleep, happy for the first time in years.\n| LineColor       = 373021\n}}\n| ShortSummary    = Chise and Elias shear Woolybugs, a flying sheep with cold air on wool. When the same species steal the body heat from Chise, Elias fends them off and sends Chise indoors to warm up. Chise reveals she knows about Elias's impulse to eat humans, and the time he was tempted to eat her while in his inhuman form. Elias nearly erases the memory, but she prevents him from doing so. Since she lost her parents and brother, Elias was the only family she had, so the thought of losing Elias scares her more than anything. Chise also reveals that both of her parents had the \"sight\" and could see the same creatures that most other humans cannot see. Elias admits he has no experience of emotions except for feeling cold when Chise was gone and warm when she returned. Chise recognizes this as loneliness and promises to teach him human things. They are later visited by a faerie acquaintance of Elias named Ashen Eye, who gives Chise a “gift” for capturing and binding fellow spirits. He traps Chise in an animal skin, transforming her into a fox.\n| LineColor       = 373021\n}}\n| ShortSummary    = Chise, lost to the sensations and instincts, goes to the forest where she is joined by Ruth in his canine form who requests to be with her. Elias chides Ashen for thinking he knows what is best for him when he (like others) always keeps distance from him, but transforms into a beastial form to pursue Chisa. Catching up with Chise, Elias and Ruth ask her to stay; the latter expressing that his life feels cold and lonely without her. Chise reverts into a human as she feels the same thing, the three returning home together. Chise is asked by the Leanan sídhe to save Joel, who is dying, as she has been unintentionally draining his life. Elias tells Joel he probably only has a week to live. Joel accepts his fate as his life had been happy. His one wish is to speak with the red-eyed girl living in his garden. Chise decides to create a forbidden potion allowing Joel to see the Leanan sídhe. Elias almost refuses, due to the magic required but instead warns Chise against exhausting herself. Five days later, the Leanan sídhe uses the potion on Joel. Joel happily offers her his remaining life for unintentionally inspiring him to continue living after his wife died. As his life runs out Joel fades away, leaving her devastated. The Leanan sídhe decides to stay in Joel’s garden to avoid hurting any more people. King Oberon confiscates the rest of the forbidden potion. Chise becomes weaker, after limiting her magic and the ring shatters.\n| LineColor       = 373021\n}}\n| ShortSummary    = Elias and Oberon take Chise to the Land of Fairies, where time passes rapidly, so she can recover under the care of the Fairy Doctor, Shannon. Titania tells Elias it would be safer for Chise to live in the Fairy Kingdom. Shannon tells Chise that living there would eventually turn her into something resembling a fairy. Elias, claiming he values Chise’s will, declines Titania’s offer. Shannon lures Chise to a pool and tries to drown her, claiming she hates Sleigh Beggies. Chise finds the strength to fight back and overpowers Shannon, only to find her injuries healed. Shannon apologises as she had used Chise’s sudden desire to live as a healing spell. Silver becomes increasingly agitated when Elias and Chise do not return. She recalls her previous life as a Banshee who lost the human family she was \"haunting\". She was rescued by Spriggan, who tells her to always protect the weak. He transforms her into a silkie and places her with the human family living in the house Elias will one day own. As Chise and Elias leave the Land of Fairies, they conclude that months have passed since it is now winter.\n| LineColor       = 373021\n}}\n| ShortSummary    = On Christmas Eve, Chise and Elias are reminded by fairies called the Yule Twins to be sure to burn a Yule log for the Horned God and Dark Lady. Chise and Elias share an awkward kiss beneath Mistletoe, which, Elias claims, makes his back tingle. Chise goes shopping with Alice, who needs help choosing a present for Renfred. They meet Hazel, a Centaur postman, who suggests them presents for Renfred. They are then accosted by Alice’s former drug dealer who wants her to begin buying drugs again, but they escape. Alice explains that as a child she used to take drugs, until Renfred saved her and took her as his apprentice. Following an accident where a spirit scarred Renfred's face, Alice promised to always look after him. Ruth tells Chise he is happy to find a friend. Chise returns home and gives a new bolo tie for Elias to replace the old one. In return, Elias gives Chise a teddy bear he made himself that will, at night, absorb some of Chise's excess magic and turn it into a rock candy like crystal, along with other gifts she received from Angelica, Simon and Lindel. Meanwhile, Ashen Eye sees a young boy in the woods.\n| LineColor       = 373021\n}}\n| ShortSummary    = Stella requests Chise to find her brother Ethan, who has gone missing. Chise realises the teddy bear Elias gave her grows crystal flowers by absorbing magic. She receives a magic reduction bracelet from Angelica. Stella agrees to pay Chise with homemade sweets to find Ethan. After giving the crystal flowers to various creatures for information, they learn that Ashen Eye kidnapped Ethan and Stella realises her mistake leaving him alone after an argument. Ashen Eye then intervenes, trapping Elias under a lake with Ethan and erasing his and Stella's memories. Chise uses a magical fur to transform herself into bear, and is able to find where Elias and Ethan are being held. Ethan forgives Stella, after Ashen Eye returns their memories. Despite their success, Chise is reminded of her lost brother and becomes upset.\n| LineColor       = 373021\n}}\n| ShortSummary    = Stella visits Chise with her payment of sweets. Elias, irritated by Stella, runs away. Chise finds him hiding in a shadow but becomes worried as he restrains her and seems to want to bite her. As Stella returns to London, both Ashen Eye and Cartaphilius are seen nearby. Chise becomes afraid Elias may be about to eat her and sends a distress signal to Ruth. Ruth is helped by the fairy daughter of the Dark Lady who shows him which shadow Elias is hiding in. Chise realises Elias is upset about Stella. As his grip tightens, she gets angry and threatens to stab herself, causing him to suddenly let go. Elias admits he became afraid Chise would leave. Chise and Elias later sleep in the same bed where she sings him a lullaby. Chise visits Angelica, worried that Elias has been sleeping for several days. Angelica suggests Chise may have accidentally sang a spell that put him to sleep. Chise awakens Elias, offering a remedy for him to drink, before she passes out. Meanwhile, Cartaphilius kidnaps a dragon.\n| LineColor       = 373021\n}}\n| ShortSummary    = Cartaphilius performs a procedure on the dragon. In a dream, Chise visits London and sees Cartaphilius suffering from pain and insisting her to name him Joseph. During the meeting, Chise learns Cartaphilius has stolen a teleportation device from Renfred, in order to kidnap and sell a dragon at the underground magical auction house. There, Chise and the others plan bid on and buy the dragon to keep it safe. While Elias and Renfred argue about the future, a woman contacts Chise and they make an unknown agreement. As a result of Cartaphilius' procedure, the traumatized dragon transforms into a giant Chimera version of itself and goes on a rampage.\n| LineColor       = 373021\n}}\n| ShortSummary    = To end the dragon's suffering, Chise absorbs the dark magic from the dragon and they fall unconscious into the river. Chise wakes up at home, and finds her left arm mutated and restrained by bandages. She concludes her body will fall apart, after absorbing the dragon's curse. Shannon has Chise to stay in the kingdom, hoping a fairy might help her. Chise promises to consider the offer this time. Elias and Chise discuss how they will move forward with the time Chise has left. They are visited by Mariel, the witch Chise met at the auction. Mariel sees Chise’s arm and offers to help her find a cure, but only if she becomes a witch and joins her coven. Chise attends the meeting, as Mariel warns Elias about Chise.\n| LineColor       = 373021\n}}\n| ShortSummary    = Elias and Chise meet Phyllis, Mariel’s high priestess, but they decline to join the coven after learning that killing the Dragon is the only way to free Chise from the curse. As they leave, Mariel apologizes for wasting their time and passes a message to Elias, suggesting that to save a life, someone to be sacrificed. Upon returning home, Elias captures Stella detecting that Cartaphilius has possessed her. Cartaphilius, as Stella, congratulates Elias for being a monster. After berating Elias and leaving home, Chise pursues Stella. Cartaphilius promises to Chise that he will release Stella in return for Chise leaving with him and participating in his experiments. As they teleport and vanish, Elias arrives late and only finds Chise's necklace.\n| LineColor       = 373021\n}}\n| ShortSummary    = Chise wakes up in the laboratory. Cartaphilius explains his plan: since he is cursed with eternal life and Chise is cursed to die, he proposes to swap her arm for his own, hoping it will curse him to die and for her to live. After forcibly performing corneal transplantation, Cartaphilius enters Chise's mind and Chise has a flashback to her past. While Chise was tormented by creatures due to being a Sleigh Beggy, her father took her brother and abandoned the family, and her mother committed suicide after a failed attempt to kill her. Chise confronts and congratulates her mother for their memory. She then finds a fragment of Cartaphilius which represents her curse. She asks what he wanted in return. The fragment says there is one wish he wanted for thousands of years. However, Chise wakes up in reality and tells Cartaphilius what happened.\n| LineColor       = 373021\n}}\n| ShortSummary    = Titania and Oberon offer Elias their help in finding Chise, under the condition she be taken to the Fairy Kingdom. Elias is tempted, but remembers that neither he nor Chise would want to live confined there. Titania and Elias cast a locating spell. Phyllis tells Marielle to help fix the problem she caused. Chise learns that Cartaphilius had thrown a stone at Jesus during his crucifixion and was punished with immortality. Thousands of years later, Cartaphilius met a young gravekeeper named Joseph and fused with him, taking his body. Cartaphilius attacks Chise, but she is saved by Elias and their allies. Outmatched, Cartaphilius flees but Chise pursues him to the fountain.\n| LineColor       = 373021\n}}\n| ShortSummary    = Chise and Cartaphilius argue about the different ways they suffer. Ashen Eye appears near Cartaphilius, while Ruth, Elias and Aerial the wind fairy, save Chise. Ashen Eye tries to flee, but is defeated by Elias and Aerial. Though Chise fails to put Cartaphilius to sleep, Elias traps him and Ruth retrieves the eye. Chise hugs Cartaphilius and sings a lullaby to end their suffering. Cartaphilius then reveals that Chise's cursed arm will now extend her life. Later, Chise forgives Elias for all the things he did. They make an agreement about the future. Life returns to normal and Cartaphilius is now being kept by Chise in a place where he sleeps peacefully. Ashen Eye, who survived the attack, expresses his disappointment. Chise visits Angelica and Stella, who both give her birthday gifts. Elias discovers Chise in a wedding dress and veil at the forest. She places a ring on his left hand and they promise to stay together.\n| LineColor       = 373021\n}}\n}}\nSeason 2 (2023)\n| director   = 20\n| directorR  =\n| writer     = 12\n| writerR    =\n| aux2       = 12\n| aux2T      = Storyboarded by\n| aux2R      =\n| airdate    = 12\n| episodes   =\n| ShortSummary    = Adolf offers Chise a place at the College, admitting he hopes to study Chise as she is a Sleigh-Beggy who also possesses a Dragon-curse and Immortality-curse. Elias is uncertain but supports Chise’s desire to learn. College President Liza Quillyn grants Elias a temporary teaching position to stay close to her. College doctor Alexandra Heath, a Caterpillar Muryan, is intrigued by Chise’s unique physiology. Adolf is surprised Elias left Chise alone with Alexandra and Elias admits the thought of Chise catching him spying fills him with a strange sensation. Adolf confirms this is probably fear. Elias encounters Renfred who is not happy to see him. Chise reveals since receiving Cartaphilus’ eye she has flashes of his many lifetimes of memories, and since she only has 15 years of her own memories she worries Cartaphilus memories will dominate and alter her personality. Chise meets the four dormitory mothers, cats who specialise in different children’s needs. Remembering Nevin’s claim she has freedom in her heart Chise chooses mother Rose-Lyn’s dormitory and is assigned a roommate, Lucy Webster, who appears antisocial. On her way to meet Alice Chise encounters a silver haired student who abruptly faints.\n| LineColor       = B11000\n}}\n| ShortSummary    = The silver haired girl, Philomena, explains she suffers from nervous fear, so Chise prescribes calming tea. Philomena returns to class with her classmate Veronica. Alice reveals she now has her own familiar, Will-o-the-Wisp, who took a liking to her despite being a sorcerer. Chise attends her first class with Professor Narcisse to begin learning the basics of sorcery. Chise learns that, as a mage, she is not expected to actually perform sorcery, just to pass written exams. Veronica expresses interest in Chise’s magic. Elias, disguised as a young woman, teaches the class how to begin using magic by negotiating with magical creatures. Alice has a good relationship with Will-o-the-Wisp but loses control easily due to her temper, while Chise is easily able to convince a fire salamander to assist her. A student named May insults the salamander when it refuses to work with him and Elias is forced to stop the salamander killing him, revealing his true appearance. As only a few students show aptitude for magic Elias wisely advises the rest to quit his class, but he is still lectured by Renfred for putting students at risk. Classmate Rian asks a surprised Chise to teach him magic instead of Elias. Elsewhere, two sorcerers enter a mysterious room.\n| LineColor       = B11000\n}}\n| ShortSummary    = Their conversation is partially overheard by Tory Innis, an instructor and Rian’s master. Rian is disappointed when Ruth and Will-o-the-Wisp confirm he has no magical aptitude. Elias and Chise have dinner in the cafeteria. Narcisse reports to vice-principal Gregory, who is concerned Chise and several other students will upset the balance of power within the college. Elias’ students insist on eating with them; Beatrice, Sofia, Isaac, Kevin, Martin, twins Jasmine and Violet, Lazarus, Roy and Zoe. Veronica, April, May and Philomena sit separately. Lucy sits alone, seeing no point in making friends. Chise senses fear from Zoe. Adolf contacts Lindel to find out if Elias is dangerous; Lindel decides to share how Elias earned the title Pilum Muralis (Spear Wall). Chise relaxes lying on the lawn. Elias, who cannot usually lay on his back with his horns, is able to lie down by resting on Chise’s lap. While harvesting pumpkins for Halloween/Samhain Joseph briefly awakens and is disappointed Chise won’t return his eye, so he reminds her of their promise then goes back to sleep. Stella visits, making Elias uncomfortable as he had once tried to kill her. Chise and Ruth abruptly vanish in a strange mist.\n| LineColor       = B11000\n}}\n| ShortSummary    = Chise meets Rahab, Lindel’s master, who summoned her. Angelica visits Elias. Rahab reveals Elias lived with her for decades learning about humans, but he always failed to understand emotions so he could only imitate human behaviour. Rahab once tried to explain marriage to him but it didn’t go well. Elias explains his growing worry to Angelica about Chise’s habit of confronting danger, even giving her his precious silver necktie hoping by trying to avoid breaking it she will start avoiding danger. Chise assures Rahab that Elias definitely has emotions, even if he doesn’t know it himself. Rahab is happy Elias met Chise but asks Chise not to mention her to Elias. Elsewhere, Philomena throws away the tea Chise gave her except for one small sachet. Elias shows Chise a shortcut to the college through a mystical doorway, but warns her it is extremely dangerous as it is possible to become lost forever in time and space. The Centaur postman guides them, showing them how to bribe the guardian hounds for passage. Chise ends up asking Elias what he thinks a bride is. Philomena overhears Zoe confess his fear of Chise to Doctor Alexandra. Lucy has a nightmare of her past.\n| LineColor       = B11000\n}}\n| ShortSummary    = Chise struggles to talk to Lucy. Jasmine hints at the Webster Tragedy but won’t reveal more. Isaac tells Chise about the seven families who founded the College. Rian is of the Scrimgeour family of Protectors. Chise tries to speak with Zoe but when he ignores her Lucy steals his earphones, revealing his hair is actually snakes. Zoe is shocked when Chise fearlessly pushes his snakes aside, allowing Lucy to return the headphones. Zoe explains his mother was a gorgon and his father a sorcerer. His father sent him to the College to experience humans but upon meeting Chise his senses told him she was a monster. Chise reveals her dragon arm; dragons and gorgons are natural enemies. Lucy calls his snakes beautiful, embarrassing him. Ruth catches Philomena spying, revealing she is a cousin to the Scrimgeour’s specialising in intelligence gathering. At Rian’s suggestion everyone enters a magical contract to keep Zoe’s secret since Gorgons are often hunted for their body parts. Lucy refuses to trust Philomena as it was spies who got her family killed. Rian scolds Jasmine for telling Chise about the Webster Incident. As a member of the St Georges Jasmine is concerned Rian has abandoned his Scrimgeour family. Violet reminds Jasmine if they wanted they could abandon sorcery and the St Georges, especially since Elias told them they have potential as mages.\n| LineColor       = B11000\n}}\n| ShortSummary    = Chise asks Elias why he proposed marriage when he can’t comprehend what it means. Elias asks Renfred’s advice, assuming Renfred plans on marrying Alice to continue his sorcerer bloodline. Renfred is furious at the assumption since he is raising Alice as a daughter. Alice overhears and is upset, so she stays at Elias’ house with Chise. Alice is upset Renfred still thinks of her as a child to be protected, when all this time Alice thought she had been protecting him after he lost his arm to Cartaphilus. She asks Chise about Elias; Chise admits it is confusing as Elias is her master, technically her husband yet sometimes acts like her father. Alice goes to sleep, unsure what she actually wants from Renfred. Elias admits to Chise that when he proposed he thought having the same person be apprentice and spouse would be more convenient than two separate people. Chise accepts this but also explains neither relationship is permanent; apprentices graduate and spouses can divorce, but she is happier with Elias than without. Alice confronts Renfred but he persists in protecting her until she can be trusted to stop acting like a child. Meanwhile, two sorcerers enter the mysterious room to store an object with a dark aura.\n| LineColor       = B11000\n}}\n| ShortSummary    = Rian recalls his childhood playing happily with Philomena. During PE Elias watches Chise happy with her friends and is momentarily jealous. Adolf sadly recalls his original home in Dresden, Germany, which he hasn’t visited since it was destroyed during World War II, reminding Elias just because Chise is happy where she is doesn’t mean she won’t ever return home. Veronica encourages Philomena to make friends with Chise but she is suspicious of Veronica’s motive. Philomena is abruptly summoned by her family, most of whom scorn her for her mother’s efforts to become heir ahead of other relatives. She asks family familiar Alcyone how Chise could have caught her spying while concealed. Alcyone reveals some mages can scent emotions, even the human soul itself, and promises to find a countermeasure. Philomena’s grandmother, a cruel, abusive woman, has a job for her. Alice is advised by a teacher to relax with her training as she is pushing herself too hard. Adolf notices Renfred is troubled about Alice. The students are taken wild camping in Scotland to learn bushcraft. While there Chise is watched by a purple eyed creature.\n| LineColor       = B11000\n}}\n| ShortSummary    = Chise had refused to let Elias come since the trip is about learning self-sufficiency. In the end Elias split himself in half so he could be with Chise but powerless. Chise spots an Each-uisge, a dangerous relative of Kelpies. She briefly speaks with Philomena and is happy she is still carrying the calming tea she gave her. Lucy reveals she hates sorcerers despite attending the college. Chise, half-Elias and Ruth sense a magical disturbance and find Lucy drained of magic. The purple eyed creature is revealed as a Nuckelavee, a dangerous centaur-like sea monster. Half-Elias is confused since Nuckelavee don’t drain magic.  Chise and her friends flee across a river as it cannot touch fresh water. Half-Elias cannot fight but summons the Each-uisge for assistance. The Nuckelavee is forced into a lake to die but tries to drown Chise for possessing “the power to see beyond shadows”. Chise’s dragon arm abruptly mutates into a dragon claw that kills the Nuckelavee. The Each-uisge tries to secretly eat Chise as payment but is forced away by Rian with an iron axe. Ignorant of this Chise offers her hair as payment, which it grudgingly accepts. Returning to camp Chise realises without Elias she had almost no idea what to do.\n| LineColor       = B11000\n}}\n| ShortSummary    = Lucy remains in a coma. Chise replaces Lucy’s magic with her own. Concerned about her arm Chise visits Cartaphilus who assures her killing to protect herself is natural, but is gleeful Chise has started down a dark path. Lucy’s brother Seth visits. Lucy awakens and Chise sees her dreams of a massacre, and spiders. Philomena asks Chise to be friends. College librarians discover a forbidden book has been replaced with a forgery, the Testament of Carnamagos, a Grimoire so dangerous reading the words can kill the reader. Elias, having read the book once, reveals it concerns how to steal magic, create or kill immortals, and necromancy. Since the forgery contained spider silk the teachers suspect the Websters are involved. The teachers reveal the Websters cultivated special spiders to use their silk to preserve grimoires. The Webster tragedy involved the massacre of the family, except Lucy and Seth, and the theft of every spider. Seth has long been a suspect, having left the family due to having no magic. Teacher Simeon Paladihle, an expert in Sound Magic, is attacked by someone wielding the stolen Grimoire. Lucy wonders why Seth visited when they hate each other. Outside the college Seth’s driver is murdered by non-humans planning to invade the college.\n| LineColor       = B11000\n}}\n| ShortSummary    = The chauffeur survives and is retrieved by the witch Marielle. Lucy is upset Seth has given her a million pounds but won’t explain its origin (Seth is the auctioneer who sold Chise to Elias). Dr Alexandra saves Simeon with a magic transfusion from Elias. Seth, Lucy and Chise are attacked by the non-humans, revealing their goal is to assassinate the remaining Websters. Lucy remembers it was the non-humans responsible for the Webster tragedy, then discovers she can’t use her sorcery. Chise takes Lucy and Seth into Elias’ shortcut and Elias allows the non-humans to follow. The guardian hounds attack the non-humans, revealed to be married werewolves, only stopping when Chise promises a larger bribe. The female werewolf flees with her dead husbands head. Seth reveals despite raising Lucy she grew to hate him following rumours of his involvement in the Webster tragedy. Seth is unsure why the werewolves deliberately spared Lucy that night. Marielle discovers the missing Grimoire is continuing to drain Simeon’s magic. Lucy is upset Chise spared the female werewolf but also glad as there is still a chance to find the mastermind of her family’s murder. Lucy passes out as the Grimoire continues to drain her magic.\n| LineColor       = B11000\n}}\n| ShortSummary    = Philomena is saddened the scent of Chise’s tea is starting to fade. Elias decides to solve the Grimoire mystery before Chise does something dangerous. Chise is astonished Elias considers Simeon a friend. Philomena is able to ask Chise to refresh her tea. In Rune Class Chise is drawn to the protective rune Thurisaz which represents Thorns and is dangerous for humans. Zoe visits Lucy and is shocked when she asks to pet his snakes, despite the act being incredibly intimate for Gorgons, which an eavesdropping Seth finds amusing. Silver is unhappy Chise will live at the college until Lucy recovers. Chise returns to Elias shortcut to pay her bribe owed to the hounds, three sheep. The centaur postman warns against further foolishness as the hounds may demand human flesh next time, and one body might not be enough. The college celebrates Halloween. Lucy attempts to go to her job in the Waste Tower, where the college stores the results of failed experiments and can be a useful source of valuable materials. Chise, Zoe, Rian and Isaac volunteer to go instead so she can rest. While there they encounter Philomena and Tower employee Fabio; Philomena secretly informs Chise Fabio is dangerous. President Liza receives a letter from Philomena’s grandmother withdrawing her from the college to study elsewhere.\n| LineColor       = B11000\n}}\n| ShortSummary    = Fabio shows them a certain plant. To Zoe and Isaac, the plant is invisible, and Philomena is hesitant to reveal what makes the plant visible to everyone else. Rian demands to know why Philomena still fears her grandmother, but she refuses to answer. Alice decides to ask Adolf about Renfred’s past. Zoe is confronted by Undergrounders, dangerous sorcerers who live under the Tower permanently, but he escapes. Fabio, actually a disguised Undergrounder named Zacheroni, tries to abduct Chise for her Sleigh Beggy abilities but is warded off by her Cartaphilus fragment. He accepts defeat but abruptly reveals he knows Chise is a monster because only murderers can see the invisible plant. Seth finds Lucy crying and they finally apologize to each other for their past actions. Lizbeth sends her owl familiar plus Alcyone to finalize Philomena’s withdrawal, outraging Chise and her other friends. Liza refuses unless it is what Philomena wants. Lisbeth insults Philomena who is surprised when it is Isaac who steps in and pulls her to safety. Liza smugly warns Lizbeth the college is sealed due to the recent attacks and has the owl familiar banished by the dormitory mothers, revealed to be Cat-sìth’s. Alcyone ends up stuck inside the now sealed college. Lizbeth decides to accelerate her plans.\n| LineColor       = B11000\n}}\n| ShortSummary    = Philomena is unsure whether to obey Lisbeth and leave, or stay with Veronica who is technically her Master. Alcyone, revealed to be an artificial fairy servant of the Sergeant family, is trapped in the college and defaults to serving the only Sergeant there, Philomena. While visiting Simeon Elias ponders what “friends” are and realises he might have several already, at least four. Many students are fearful as it is possible the criminal is now sealed inside the college with them. Zaccheroni is put in charge of self-defence classes, teaching students to fight with runes and weapons, since their attacker can potentially drain their magic leaving them defenceless. Many students successfully slay the practice golems. Philomena finds herself mutually drawn to Isaac. Chise somehow excels at physical combat through an unfamiliar instinct, enough to duel Zaccheroni to a draw before Professor Wachhman stops them for safety reasons and scolds Zaccheroni for going too far. The class stresses Philomena enough she faints but refuses to see Doctor Heath. Everyone is amazed at Chise’s abilities. Meanwhile, others begin searching for the missing Grimoire.\n| LineColor       = B11000\n}}\n| ShortSummary    = The female werewolf mourns her husband while her dreams reveal they only attacked the college because Lizbeth kidnapped their children. With the college completely sealed the students are put to work digging vegetable patches to grow the food they need. Alcyone reveals violence always makes Philomena feel ill. Philomena can’t understand why Chise helps her when she has no reason to trust her. Lucy believes it is Chise’s ego, but Chise insists she wants Philomena to feel free and not bound by her family. Philomena is sad she can’t trust anyone, even those showing kindness. Responding to her emotional state Alcyone automatically recites a pre-recorded warning from Lizbeth for Philomena to obey orders or risk never seeing her parents again. Liza suspects the Grimoire has left the college and hopes Marielle finds it soon. Marielle and the chauffeur hire another witch to search the city with his wasp familiars. Chise and the others resume classes, but Philomena starts avoiding them again. Chise realises Alcyone is a lot like Elias. Rian and Isaac suspect each other of secretly being in love with Philomena. Marielle gets a message to Liza; the wasps have confirmed the Grimoire is still inside the college.\n| LineColor       = B11000\n}}\n| ShortSummary    = Simeon recovers. Everyone is stressed from being trapped in the college. As a distraction they play with wooden puzzle blocks, competing to open them the fastest with magic. While discussing music with Simeon Elias realises he doesn’t know if Chise likes music, or any of her likes and dislikes. Rian challenges Philomena to beat his speed at the blocks and she reluctantly agrees. Encountering Elias Alcyone believes he is a summoned being like her; Elias is certain he is not but their similarities are remarkable. Philomena is plagued by memories of Lizbeth’s abuse, distracting her so Rian wins, though he has never beaten her before and is angered she is letting herself grow weaker. Izaac scolds Rian as it is obvious Philomena is protecting herself from something. Chise recognises the symptoms of deep psychological trauma and realises she is driven to help Philomena because she was the same before meeting Elias. Lizbeth agrees to give the distraught werewolf her children back. Elias and Chise are able to spend some time together like normal. Jasmine becomes ill and is hospitalized. Elias reminds Violet if they want to be mages they need a mage teacher as sorcerers are unsuited to teach mages. Violet abruptly invites Chise to play a game. Dozens of students simultaneously fall ill and require treatment.\n| LineColor       = B11000\n}}\n| ShortSummary    = Violet invites everyone to tour the colleges seven most haunted locations. Chise is partnered with Veronica and asks about Philomena’s situation. Veronica is unable to help as she is as bound to her family as much as Philomena is bound to her own, and advises Chise to stop interfering. Veronica fondly remembers forcing Philomena to be her attendant from a young age, even tasting Veronica’s food to check for poisons as she was frequently targeted by assassins. Violet partners with Rian to keep him away from Philomena following his outburst over the wooden puzzles. He reminds Rian unlike him who had a relatively normal childhood Philomena was essentially raised in captivity, so trying to force her to suddenly seize freedom is doing more harm to her mental health than good. Isaac reminds Philomena Rian isn’t trying to upset her, it’s just from his point of view he can’t understand why she chooses to remain trapped by her family. After the seven locations everyone gathers to watch a horror movie. Rian decides to apologise to Philomena just as teachers catch them all out past curfew. Violet ends the night by revealing his sister Jasmine is actually being impersonated by a real ghost, a student who died 30 years ago, scaring everyone. Alexandra asks Chise to visit the infirmary immediately.\n| LineColor       = B11000\n}}\n| ShortSummary    = Alexandra borrows Chise’s limitless Sleigh Beggy magic to help the students all drained of magic. Chise is grabbed by a student, allowing a creature inside his mind to begin draining her magic. Her Cartaphilus fragment protects her, destroying the students arm. Based on the inefficiency of the attack Elias theorises either the missing Grimoire is controlling the unwilling attacker or the attacker is an amateur. The sick students all recover for no reason. Elias believes receiving so much magic from Chise so suddenly broke the Grimoire’s link with its victims. Rian tries to see Philomena to apologise but she avoids him. Alcyone is curious of Elias’ closeness with Chise, compared to Philomena who hasn’t needed her for some time. Elias compares this to a child no longer needing parents as they grow up, causing Alcyone to wonder if she is worthy to be Philomena’s mother. After weeks without an attack students grow restless, resulting in an argument where Kevin accuses Lucy of being the attacker, referencing the Webster tragedy, so she knocks him out. Philomena has not felt well in weeks and grows sicker as her feelings of fear grow worse, especially around Veronica whose motives grow more mysterious and sinister.\n| LineColor       = B11000\n}}\n| ShortSummary    = Cartaphilus and Silver are visited by the Horned God and Dark Lady seeking Chise. Chise is worried by her emerging power to enter peoples minds. Lucy asks her to see her memory of the Webster tragedy where Chise discovers the werewolf couple killing everyone except Lucy as the female werewolf refused to kill someone so young. Chise also sees a second young girl present, though this confuses Lucy even further. Liza refuses to unseal the college and yet makes no actual effort to hunt the attacker. Chise gives everyone a charm with the Thorn rune, hoping it will protect them. She also sends one to Philomena who refuses to see her. Lizbeth is angered by the delay of her plans concerning her son Adam. Alexandra confirms Chise has been cursed by the creature that attacked her mind. While it seems dormant it is too powerful to ever be removed. Philomena suffers a mental break, swallows the Thorn rune, retrieves the Grimoire from its hiding place inside Alcyone, and confronts Veronica while her body starts to mutate, witnessed by Rian who is knocked unconscious. Chise senses this and rushes to help with Elias. Philomena drains magic from every student she encounters and demands Liza unseal the college so she can visit her parents in Hell.\n| LineColor       = B11000\n}}\n| ShortSummary    = Liza realises the Grimoire must contain a god and reluctantly unseals the college. Gregory transforms into a bear to attack Philomena but the female werewolf appears through Chise’s shortcut and escapes with Philomena. Chise insists on finding Philomena but Liza refuses as the Grimoire has cost Philomena her humanity, so she will soon either become a monster or die. Elias points out as mages he and Chise work by different rules; having made a promise of friendship to Philomena Chise is bound by magical contract to help her, so she and Elias depart from the college. They are joined by her friends and by Zaccheroni. Chise suffers a vision of the god and recites an unfamiliar spell, transforming into a great red dragon that seeks out Philomena by swimming through ley lines under the earth. Philomena gives the Grimoire to Lizbeth, allowing her to begin a forbidden ritual. Zoe, Isaac, Zaccheroni and Lucy awaken in a mass of thorns, revealed to be inside Elias, the only safe way they as humans could follow Chise through the ley lines. Chise surfaces by Lizbeth’s home but is confronted by an unknown woman who demands Chise offer her payment. Philomena worsens and Alcyone, who remembers it was Philomena's parents who asked her to care for Philomena, can’t think how to help her.\n| LineColor       = B11000\n}}\n| ShortSummary    = Alcyone recalls helping raise Philomena from the day she was born. Philomena’s mother Iris had been given to her father Adam to practice torture skills on, but instead they fell in love and abandoned the Sargant’s to raise Philomena. Lisbeth waited until Philomena was old enough to be useful then sent men to retrieve her and Adam. Iris was murdered and Adam committed suicide to spite Lisbeth. Alcyone attempted to flee with Philomena but was captured so they wound up with the Sargant family. Now, with Philomena mutated Alcyone fears she has failed. The unknown woman is revealed as the goddess Dark Lady, wife of the Horned God, and she demands Chise pay what she is owed; the Golden Branch, a reference to mistletoe and a blood sacrifice, though the details are unclear. Elias delays her request, claiming Chise is too young. Dark Lady accepts Elias’ promise to pay in the future and directs Chise to return her ancient lost powers of war and conflict by calling her true name, Morrigan. Unleashed, Morrigan slaughters Lizbeth’s guards so Chise and her friends can reach the house. On the way the female werewolf attacks so Zoe sends everyone ahead while he fights the werewolf with his powers as a Gorgon.\n| LineColor       = B11000\n}}\n| ShortSummary    = Zoe reveals his inner Gorgon personality. He notices iron screws in the werewolf’s skull which he turns to stone, breaking the spell controlling her. She leaves, while Zoe has no memory of what he did. Philomena starts disintegrating. Alcyone recalls that, to prevent Chise sensing her presence, she removed Philomena’s soul, which she now returns to her. Chise and everyone enter the house and Alcyone allows all except Elias to see Philomena. Lucy sees a preserved Webster spider displayed on the wall and realises Philomena was there during the Webster tragedy. She confronts her, causing Philomena to lose control at the memory of Lizbeth abusing her. Chise forces her way into Philomena’s mind and they travel together past shadows of both their terrible memories. Chise helps begin healing the damage to Philomena’s mind and soul, after which they encounter Isaac’s mind, then Lucy’s. Encountering Lucy causes them all to see Philomena’s memory. Lizbeth had sent the werewolves to murder the Websters and forced Philomena to watch to learn about assassination. It was also Lizbeth who forced Philomena to attack college students so their drained magic could be used to resurrect Adam and Iris. Lucy realises Philomena was never to blame, she was just another of Lizbeth’s victims. Together, they finally convince Philomena to reach out and ask them to help her. As she does a dark figure appears and takes her away before Chise can stop it.\n| LineColor       = B11000\n}}\n| ShortSummary    = Everyone is expelled from the dream world unconscious, except Philomena; now back in a more human body. Lizbeth prepares to resurrect Adam. Elias overpowers Alcyone and forcibly removes a spell Lizbeth placed on her artificial soul, restoring the programming Adam created her with. Lizbeth recalls Adam’s birth. She held no love for Adam outside his role as her heir, and after his suicide she took in Philomena but despised her for being an unworthy replacement for Adam. Chise, Lucy and Isaac awaken. Philomela makes it to Lizbeth who plans to use the Grimoire and Philomena’s blood to summon a goddess. The dark figure pressures Philomena to agree but she resists, so Lizbeth restrains her, revealing the ritual was always going to require Philomena to die and would only resurrect Adam, not Iris. Chise and the others arrive and demand to know if Philomena actually wants to die. Despite her despair Philomena realises she wants to live and once again asks for their help. Chise destroys the goddess summoning circle with a flaming war hammer, which should be impossible against goddess magic, and rescues the relieved Philomena.\n| LineColor       = B11000\n}}\n| ShortSummary    = Outside, Zaccheroni encounters a small, masked creature. Infuriated, Lisbeth allows the Grimoire to mutate her as well. The werewolf arrives to demand her children, resulting in Lizbeth destroying Alcyone’s core. This triggers a trap placed on Alcyone by Adam, summoning a copy of Adam. As Alcyone dies she transfers all her memories to Philomena. Shadow-Adam reveals as Adam’s final act of spite he left him behind to defend Philomena by killing whoever killed Alcyone. Lucy demands he wait until Lizbeth confesses to the Webster tragedy, but the partial goddess absorbs Lizbeth. Morrigan arrives and scolds it for intruding on her territory. Elias explains the goddess is like Morrigan, only no one has named it, so it remains only a partial goddess. Morrigan makes Shadow-Adam her spear and Ruth her war-dog. The werewolf flees with Lucy and Isaac and reveals Lizbeth actually worked with one of the Websters. Chise realises Morrigan can’t kill the goddess as it was summoned by a human and must be banished by a human. Working together they retrieve the Grimoire from inside the goddess and Philomena borrows magic from Chise, Lucy and Isaac to activate the Grimoire.\n| LineColor       = B11000\n}}\n| ShortSummary    = Philomena collapses as Lizbeth enters her mind trying to take her over. No longer the frightened child she was Philomena uses Chise’s Thurisaz rune to force Lizbeth out, completes the Grimoire incantation and summons another stronger Goddess who drags the partial goddess away. With it gone all the affected college students recover. Morrigan departs but reminds Chise she is owed a Golden Branch. Philomena asks Lizbeth why she killed the Websters since Lucy deserves the truth. Before Lizbeth can answer she is beheaded by the masked creature being chased by Zaccheroni. He reveals it is a familiar belonging to another sorcerer as it flees with the Grimoire. The werewolf aids his escape, recognising it as one of her sons. With the danger over Elias takes everyone to his home to recover. As the college begins investigating Philomena has time to finally relax and expresses interest in making potpourri. Elias and Chise give the weakened Morrigan a golden Mistletoe, which she accepts and offers Snowdrops as a gift for the Spring. Elias considers them extremely lucky Morrigan didn’t demand anything else. Veronica is revealed as the young werewolf’s master. Chise visits Cartaphilus who is pleased she has learned to value her own life over others, though she is unsure what to do next. As she starts her potpourri Philomena smiles and even laughs with her friends.\n| LineColor       = B11000\n}}\n}}\nOADs\nThose Awaiting a Star (2016–17)\n| director   = 12\n| directorR  =\n| aux2       = 12\n| aux2T      = Storyboarded by\n| aux2R      =\n| airdate    = 12\n| episodes   =\n| ShortSummary        = Angelica sends a bag of books to Elias and Chise recalls her past in Japan. Chise evades a masked creature through the forest and goes to a cottage library, where Riichi Miura takes her in.\n| LineColor           = F8981F\n}}\n| ShortSummary        = Despite Miura's warning after revealing the truth, Chise secretly entered the library by a basement door. This allowed the same creature to consume all books and kill Miura.\n| LineColor           = F8981F\n}}\n| ShortSummary        = Chise learned Miura accompanied Mayumi Niikura, but their relationship failed due to different positions. After returning the book, Chise asked Miura to meet her in the future. Miura realized he could not leave after entering the library. Back in the present day, Chise gives the book to Mayumi and plans to read other ones.\n| LineColor           = F8981F\n}}\n}}\nThe Boy from the West and the Knight of the Blue Storm (2021–22)\n| director   = 12\n| directorR  =\n| aux2       = 12\n| aux2T      = Storyboarded by\n| aux2R      =\n| airdate    = 12\n| episodes   =\n| ShortSummary        = During a heavy storm, lightning strikes an ancient stone, chipping two pieces off of it. In response, the Wild Hunt appears, but with their leader missing, they begin roaming the forest randomly, much to Spriggan's concern. Meanwhile, Chise prepares to attend the College, but suddenly begins to feel ill. Elsewhere, a young boy named Gabriel has recently moved into the countryside with his parents due to his illness. While exploring the forest, he comes across the stone and picks up one of the broken off pieces and takes it home. The other broken stone piece transforms into a spirit horse. Spriggan finds the horse and takes it to Elias, warning him that he must find the Wild Hunt's missing leader and reunite him with his horse or they will eventually destroy the forest. Elias accepts the job since the Wild Hunt's presence is what is causing Chise's illness. At Gabriel's home, he polishes the stone piece he had taken, which causes the spirit of a young boy to manifest. Excited at seeing a spirit for the first time, Gabriel declares that they are both friends and promises to get the young spirit back to his home. However, that night, the Wild Hunt still roams the forest, their deadly aura killing every living being they come across.\n| LineColor           = 9C380C\n}}\n| ShortSummary        = The next morning, Elias and Chise head out to find the horse's master. Meanwhile, Gabriel decides to name the young spirit Evan after a knight in his favorite story, and the both begin exploring the countryside looking for Evan's home. Elias and Chise come across Titania and Oberon, who point them towards the ancient stone. Gabriel meanwhile becomes more self conscious about his illness which serves to isolate him from other children his age, which attracts the attention of an evil spirit. Gabriel and Evan flee from the spirit and find their way to the ancient stone, where Elias destroys the spirit pursuing them. Evan is reunited with his horse and regains his memory and true form. However, the Wild Hunt does not respond to his summons. The group decides to rest of Elias' home until nightfall to search for the Wild Hunt. However, Gabriel begins to grow angry and jealous of Evan due to his belief that Evan prioritizes his duty as a part of Wild Hunt over their friendship.\n| LineColor           = 9C380C\n}}\n| ShortSummary        = As night falls, Evan summons the rest of the Wild Hunt as they prepare to return home. Wanting to bring Gabriel with him to free him from his frail body, Evan hypnotizes Gabriel into riding with him, intending to take him to their realm. Chise and Elias give chase, but have trouble getting close to the Wild Hunt due to their aura. Fortunately, Gabriel regains his senses when the Wild Hunt passes by the hospital his mother works at, reminding him of his family. Gabriel tells Evan that while he does value their friendship, he does want to return home just as Elias and Ruth temporarily immobilize his horse. Deciding to honor Gabriel's wish, Evan allows him to dismount and return to the human world. The Wild Hunt return to their own realm, and Elias and Chise take Gabriel back to his home. The next day, Gabriel starts his first day at the local school, having matured from his encounter with Evan and coming to terms with his illness. Chise receives her new school uniform, and she wonders what the College is like.\n| LineColor           = 9C380C\n}}\n}}\nHome media release\nJapanese\nShochiku released the series on Blu-ray in Japan on four volumes, with the first volume released on November 29, 2017, and the final one released on July 25, 2018.\n{| class=\"wikitable\" style=\"text-align:center; width: 100%;\"\n|+ Shochiku (Japan – Region 2/A)\n|-\n! width=\"15%\" | Volume\n! Episodes\n! Release date\n! width=\"5%\" |\n|-\n| 1\n| 1–6\n| November 29, 2017\n|\n|-\n| 2\n| 7–12\n| March 21, 2018\n|\n|-\n| 3\n| 13–18\n| May 30, 2018\n|\n|-\n| 4\n| 19–24\n| July 25, 2018\n|\n|-\n|}\nEnglish\nThe series was released in North America by Funimation, who released the series in two volumes. The first volume received a limited edition combo set release and a standard combo set release on January 29, 2019, and the second volume received a standard combo set release on April 16, 2019. Manga Entertainment released the series in the United Kingdom and Ireland, releasing the first volume on a standard combo set on April 1, 2019, and the second volume on June 3, 2019. In Australia and New Zealand, Madman Entertainment imported Funimation's North American release, releasing the limited edition first volume set on March 6, 2019, the standard edition first volume on April 3, 2019, and the second volume on June 5, 2019.\n{| class=\"wikitable\" style=\"text-align:center; width: 100%;\"\n|+ Crunchyroll LLC (North America – Region 1/A)\n|-\n! width=\"16%\" | Volume\n! Episodes\n! Release date\n! width=\"5%\" |\n|-\n| Part One\n| 1–12, OADs 1–3\n| January 29, 2019\n|\n|-\n| Part Two\n| 13–24\n| June 5, 2019\n|\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center; width: 100%;\"\n|+ Manga Entertainment (United Kingdom and Ireland – Region 2/B)\n|-\n! width=\"16%\" | Volume\n! Episodes\n! Release date\n! width=\"5%\" |\n|-\n| Part One\n| 1–12, OADs 1–3\n| April 1, 2019\n|\n|-\n| Part Two\n| 13–24\n| June 3, 2019\n|\n|}\n{| class=\"wikitable\" style=\"text-align:center; width: 100%;\"\n|+ Madman Entertainment (Australia and New Zealand – Region 4/B)\n|-\n! width=\"16%\" | Volume\n! Episodes\n! Release date\n! width=\"5%\" |\n|-\n| Part One (Limited Edition)\n| 1–12, OADs 1–3\n| March 6, 2019\n|\n|-\n| Part One\n| 1–12, OADs 1–3\n| April 3, 2019\n|\n|-\n| Part Two\n| 13–24\n| June 5, 2019\n|\n|}\nNotes\nReferences"
    }
  ]
}