{
  "content": [
    {
      "type": "text",
      "text": "# List of Ronin Warriors characters\n\n}}\nThe following is a list of characters in the manga and anime series Ronin Warriors by Hajime Yatate.\nProtagonists\nThe Ronin Warriors are a group of five who each wear an Armor and represent a virtue. In the OVA Message, they each gain a new suit of Armor from Suzunagi.\nRyo Sanada\nis the unofficial leader of the Ronin Warriors and the . Though brash and impulsive, he is kind, loyal, and determined. He is the first of the five rōnin to arrive in Shinjuku during the Evil Dynasty's first invasion, having arrived with his companion, the white tiger , shortly before the attack, and the first to be rescued by Mia and Ully after their siege on Talpa's castle. Though they defeat Talpa, the Evil Dynasty resurfaces and captures Sage, Kento, and Cye. Along with Rowen, Mia, and Ully, Ryo ventures into the Nether Realm to rescue them and defeat Talpa for good.\nHe wears the , which represents the element of Fire and the virtue  and makes him immune to flame, and wields the , dual katana that can connect at the kashira to form a double-bladed weapon. His finishing move is , which creates a column of white-hot energy. Ryo's transformation call is .\nRyo later obtains the , which requires the energy of four other armors to summon. Along with the , which he acquires from Lord Sabre Stryke, they are used to perform , which releases the Armor's power as rays of light and flame. The Inferno and Wildfire Armors are destroyed following the battle with Mukala and the Black Inferno Armor.\nRyo comes from the ninja school of the Sanada Ten Braves, a group of ninjas believed to have assisted Sanada Yukimura, with the crest on his armor being a stylized version of the Takeda clan's family symbol.\nIn a Newtype poll, Ryo ranked #17 of the top 30 most popular male anime characters from the 1980s.\nKento Rei Faung\nKento Rei Faung, known in Japan as  is the . Kento is a descendant of a Chinese martial artist who came to Japan, and his family owns a Chinese restaurant in Chinatown, Yokohama.\nHe wears the , which represents the element of Earth and the virtue  and is said to be the most violent of the Armors, and wields a weapon that is a cross between a three-section staff and a naginata. His finishing move is , which causes a massive earthquake-like disruption. Kento's transformation call is .\nHis rival is Dais, who he defeats when the Ancient One sends him to Mt. Aso to learn how to focus his power and unlock his Armor's true power.\nSage Date\nSage Date, known in Japan as , is the . He wears the Armor of , which represents the element of Light and the guiding virtue of . In the English dub of the series, his guiding virtue is Chi (Wisdom). His rival is Cale.\nSage wields a nodachi and his finishing move is , a powerful thrust attack that also appears as a burst of energy beams. Sage's transformation call is\nWhen the Ancient One sends him to the Catasota Gulch Pinnacles to unlock his Armor's true power, Sage realizes that the Armors can be used for good or evil. In the OVA Gaiden, Shikaiden and the Mad Scientist capture him and his Armor is used to kill people in New York, including Runa's brother.\nSage's family name, Date, is derived from Date Masamune, with his hairstyle covering one eye being a reference to how Masamune was blind in one eye and was known as \"The One-Eyed Dragon\".\nCye Mori\nCye Mori, known in Japan as , is the  and the oldest of the Warriors. He wears the , which represents the element of Water and the virtue . His rival is Sekhmet.\nHe wields a Jūmonji yari with prongs that can close, allowing him to grab opponents from afar or cut through obstacles, and the Armor is equipped with a tantō dagger and a claw-like weapon on the gauntlet. His finishing move is , a powerful burst of water. Cye's transformation call is .\nWhen the Ancient One sends him to the Sea of Toyama to unlock his Armor's true power, he encounters a clone of himself, Red Torrent, which he defeats by purifying the water around him.\nAccording to Cye, his family is said to be descendants of Mōri Motonari.\nRowen Hashiba\nRowen Hashiba, known in Japan as , is the . He is childhood friends with Kento, having met through Kento's paternal grandfather, and close friends with Sage due to their similar interests. As the most intelligent of the Warriors and the most rational and level-headed, he often acts as a voice of reason to Ryo and Kento's temper. His rival is Anubis.\nHe wears the , which represents the virtue of , or  in the English dub. He wields a golden bow and his finishing move is the , a powerful light arrow. He also possesses the ability to create protective barriers. Rowen's transformation call is .\nRowen's surname, Hashiba, is likely derived from Toyotomi Hideyoshi's original surname, Hashiba.\nAntagonists\nTalpa\nTalpa, the Emperor of the Dynasty, known in Japan as , is the main antagonist of the series. One thousand years ago, he attempted to conquer Earth, but was defeated by the Ancient One, who banished him to the Nether Realm. As his Armor remained on Earth and could not be destroyed, the Ancient One split it into the nine Armors. Five went to the Ronin Warriors, with Talpa taking the other four, Cruelty, Corruption, Illusion, and Venom, and giving them to four humans who became his Dark Warlords.\nIn thee present day, he returns and conquers Tokyo, sending the Warlords to do his bidding. Eventually, he confronts the Warriors, absorbing them and the Warlords to regain his physical form, but is vanquished by the Armor of Inferno. Though assumed to be destroyed, he later returns along with Lady Kayura, seeking to gain the Armor of Inferno for himself. He nearly succeeds in absorbing the nine Armors, but is thwarted by Anubis' sacrifice before being destroyed by the Jewel of Life.\nAnubis\nAnubis, the Dark Warlord of Cruelty, known in Japan as , is the initial leader of the Four Dark Warlords. Four hundred years ago, he was the warrior , whose ambition and bloodlust made him susceptible to Talpa's influence.\nIn the present day, he is the first of the Warlords to fight the Warriors. After several battles, Talpa, sensing that Anubis was showing weakness, uses the Nether Spirits to return him to the Dynasty's control. However, he is saved after Kento defeats the Spirits and, after the Ancient One makes him realize that Talpa was using him, renounces the Dynasty.\nThough he disappears after Talpa's first defeat, he later returns after taking on the Ancient One's role as protector. Though the Warriors are initially distrusting of him, Anubis proves himself by aiding them in battle. After meeting Lady Kayura, whom he recognizes as the last living member of the Ancient One's clan and seeks to redeem, he sacrifices himself to free her from Lord Badamon's control, giving her his Armor and the Ancient One's staff.\nAnubis wears the Armor of Cruelty, also known as the Armor of Cruelty, which represents Spring and the virtue of Chū (忠, Loyalty). He wields a kusarigama and his finishing move is , in which he sends his chain into the ground and it emerges as several chains.\nHis Japanese name, Shutendōji, is a reference to the demon from Japanese folklore.\nCale\nCale, the Dark Warlord of Corruption, known in Japan as , formerly , is the third Warlord to fight the Warriors. He wears the Armor of Corruption/, which represents Winter and the virtue Kou (考, filial piety), or Tei (Obedience) in the English dub. He wields a nodachi and claw-like armor spikes and his finishing move is , which fires several black lasers.\nAccording to The Encyclopedia of YST, if Cale was to use his powers for good, he would guide those lost in the darkness.\nDais\nDais, the Dark Warlord of Illusion, known in Japan as , formerly , is the oldest of the Four Dark Warlords. He is the fourth Warlord to confront the Warriors and the first to confront Anubis when he reemerges. Though Anubis attempts to turn Dais away from evil, Dais stays with the Dynasty until Talpa is destroyed for good. He wears the Armor of the Illusion/, which represents Summer and the virtue Nin (忍, lit. \"to endure\"), or \"Serenity\" in the English dub. It allows him to spin webs and create illusions, and has six kamas on its back resembling spider legs that can extend and are connected to a handle attached to his back. He also wields a flail on his right gauntlet and a nunchaku on his left. His finishing move is , in which he throws his kamas.\nAccording to The Encyclopedia of YST, if Dais were to use his powers for good, he would be able to create peaceful illusions.\nSekhmet\nSekhmet, the Dark Warlord of Venom, known in Japan as , formerly , is the second Warlord to fight the Warriors. He wears the Armor of the Venom/, which represents Autumn and the virtue Tei (梯, Obedience), or Kou (Piety) in the English dub.\nSekhmet wields six katanas, which exude a poison that can cause blindness. His finishing move is , where he combines his swords into a whip-like weapon.\nHis Japanese name, Nāga, is a reference to the ophidian deities of Hinduism.\nAccording to The Encyclopedia of YST, if Sekhmet were to use his powers for good, he would be able to heal injuries and illnesses and turn venom into medicine.\nSaranbou\nis a lord of the Nether Realm, who rises to power while Talpa is presumed dead and seeks to claim the Inferno Armor for himself after discovering that Ryo is its wielder. After manipulating Ryo into fighting him on a pier, he captures him before attempting to destroy his spirit with the Dark Flame. However, the Armors dispel the Dark Flame and Ryo kills Saranbou with the Inferno Armor at the cost of his swords breaking.\nLord Saber Stryke\nLord Saber Stryke, known in Japan as , is a demon warrior from the Nether Realm who, along with his companion, the demon tiger Black Blaze, seeks to overthrow Talpa and become the greatest warrior in both worlds. After hearing that Ryo wears the Inferno Armor that defeated his rival, he seeks him out to claim the armor for himself and collects the Soul Swords of Fervor, which were meant for the original wearer of the Inferno Armor. He later deceives them with fake swords and faces them, during which Ryo's swords break and White Blaze is wounded protecting him. Impressed by White Blaze's courage, he leaves, but promises a rematch.\nUpon his return to the Nether Realm, Talpa reveals to Saber Stryke that he is alive and fights him, wounding him. He flees to the mortal realm and attempts to convince Ryo to fight him. Though he initially refuses, he relents when White Blaze is mortally wounded while taking one of the Soul Swords for him. Pointing out that White Blaze risked his life for him and that the swords are not meant to be separated, Saber Stryke convinces Ryo to have a final match, with the winner getting the swords and the Inferno Armor. Ryo defeats Saber Stryke, who, before dying, recognizes Ryo's convictions were more powerful than his desire before entrusting the other sword to him.\nLady Kayura\nis the last known member of the Ancient One's clan, who was abducted from her home by the Dynasty at a young age and raised to be the ultimate weapon against the Ronin Warriors, being kept under Talpa's control with a magical amulet. In her first appearance, she battles Ryo and Rowen while the other Warriors are captured by the Dynasty, overwhelming them until Anubis summons the Inferno Armor.\nWhen Ryo inadvertently destroys Kayura's amulet, she remembers her past and is freed from Talpa's control, but Badamon possesses Kayura's body to keep her evil.  She nearly gains control of the Jewel of Life before Anubis' sacrifice frees her from Badamon's possession and he entrusts her with the Ancient One's staff and his armor. After Talpa's destruction, Kayura and the Warlords return to the Nether Realm to help rebuild the Dynasty.\nThough several centuries old, physically she is twelve years old. Due to her ancestry as a member of the Clan, she possesses supernatural powers. She wields dual sai  that she calls the Starlight Swords and her finishing move is , which summons a barrage of stellar energy. She also later gains Anubis' Cruelty armor and the Ancient One's staff.\nIn the manga, Kayura's Virtue is \"ai\" (愛, love). In the Shin Yoroiden Samurai Troopers manga, Kayura serves as the mentor to the new wearer of the Armor of Wildfire. She also appears in the novel Shinkon-Hen, which follows the history of the Ancient One's clan.\nDynasty Soldiers\nare Talpa's servants, spirits trapped within suits of Armor. They can only be killed if they are decapitated or the armor is destroyed.\nDala\nDala, known as  in Japanese, is a warlord and strategist of the Nether Realm dynasty who Talpa sends to capture Ryo and Rowen, with Kayura giving him a sword imbued with Kento, Sage, and Cye's power. Though he overwhelms them with his power, they kill him with the Inferno Armor. His attack is later revealed to have been a distraction so Badamon could carry out his plan to help Talpa control the Inferno Armor.\nBadamon\nis a follower of Talpa and the leader of the Nether Spirits. After tricking Ryo into using the Warlords' armor to form Inferno and control him, it causes a great disturbance between the worlds after he is initially unable to control the power. Afterwards, he holds the Dark Warlords hostage before returning to Talpa. Later, he sends the assassin Gash (Kashura in the Japanese version) to stop Mia, Ully and Anubis from finding the Jewel of Life after learning of its discovery from the Dynasty Warriors. He last appears when he possesses Kayura to keep her under Talpa's control and attempts to use the Armor to open a gate to the Nether Realm before Anubis sacrifices himself to stop him. During the final battle, Badamon and his spirits succeed in opening the door to the human world, but he is destroyed by Ryo in the Inferno Armor.\nSupporting characters\nThe Ancient One\nThe Ancient One, known in Japan as , is a mystic and warrior who wields a shakujo. During the Warring States period, defeated Talpa and banished him to the Nether Realm before creating the Armors from his discarded armor. He serves as the Warriors' mentor and helps Anubis defect from Talpa by showing him how he regarded him as a tool.\nAfter being mortally wounded in battle with Talpa, the Ancient One turns himself into the Warriors' bridge to Talpa's castle. After his death, Anubis and Kayura inherit his role as protector and he aids the Warriors in spirit form by destroying the Nether Spirits and sending the Warriors on quests to unlock their Armors' true power.\nThe third OVA, Message, reveals through flashbacks how, during World War II, he discovered the sealed Armor of Strata and the ghost child Suzunagi. Though he felt sorry for her after sensing that she was filled with hatred and revenge, he was forced to use the Armor of Strata to drive her away when she attacked him.\nMia Koji\nMia Koji, known in Japan as , is the daughter of a French mother and a Japanese father, who was born in Canada and was visiting her paternal grandfather when Talpa's invasion began. Despite lacking powers, she serves as Ully's caretaker and aids the Warriors with her knowledge of the Armors and various ancient artifacts. She is seventeen years old at the start of the series, nineteen years old in Gaiden, and in her early twenties in The Legend of the Inferno Armor and Message.\nIn The Legend of the Inferno Armor, she decodes the Taulagi's ancient language to track down Ryo and Sage. In Message, she attends the special session of the United Nations General Assembly addressing the Nether Realm's activities.\nMia's birthday technically falls on two dates, due to an error by Sunrise. According to the book Memorials, her birthday is May 15, 1970; however, merchandise lists her birthday as May 28, 1970, which is more commonly accepted.\nHer Japanese given name, Násti, means \"star\" in Northern Sámi language, while her Japanese surname, Yagyū, is derived from the Japanese clan of the same name.\nUlly Yamano\nUlly Yamano, known in Japan as , is an 8-year-old boy and friend of the Warriors.\nWhile shopping with his parents in the Shinjuku ward of Tokyo, Ully is separated from his parents when Talpa's invasion begins before Mia rescues him.\nIn the second season, he becomes the keeper of the Jewel of Life, with his purity and innocence allowing him to unlock its powers and destroy Talpa for good. In the OVA Message, where he is now eleven years old, he is shown to be a kendo champion of Sakura Hill Junior High School.\nWhite Blaze\nis a white tiger and Ryo Sanada's companion. After he is mortally wounded protecting Ryo from Lord Saber Stryke, he is revived when Black Blaze merges with him. Afterwards, White Blaze transforms into Black Blaze when Ryo summons the Armor of Inferno.\nRuna\nRuna, known in Japan as , appears in the OVA Gaiden. A 14-year-old girl who lives in New York City, she meets the Warriors while investigating the murder of her older brother and helps them track down Shikaisen and rescue their friends. While confronting Shikaisen to avenge her brother's death, she is mortally wounded and dies in Ryo's arms.\nMukala\n, also known as Mukala of the Sun, is an African warrior who appears in the OVA The Legend of the Inferno Armor. A warrior of the Taulagi tribe and Naria's fiancée, he wields a boomerang and wears the . After defeating the Warriors, he captures Ryo and Sage and brings them to his home territory in Tanzania.\nThey discover that Mukala is being controlled by the Black Inferno Armor, whose powers could destroy the world if it clashed with the Armor of Inferno. However, because of Mukala's position as head warrior and the Taulagi's worship of the Armor, they refuse to help the Warriors. After Naria is killed in the crossfire during his battle with Ryo, he realizes the truth and is freed from the Armor's control, with Naria being revived soon after.\nSuzunagi\nappears in the OVA Message. She was born in the late Edo period to a Christian family who were indirect descendants of the Ancient One's clan. Her father was a local playwright who ran a theater house, while her mother helped with theater duties. After her father wrote a play about five young men wearing suits of Armor who fought against forces of evil, the Shogun's samurai set the theater on fire and executed Suzunagi's father, with Suzunagi and her mother dying in the fire.\nFollowing her death, Suzunagi became a wandering spirit, unable to rest until the Armors, which she believed to be evil, were destroyed. During World War II, she encountered the Ancient One and attempted to stop him from unsealing the Armor of Strata, but was driven off.\nIn the present day, she confronts the Warriors, who were mentioned in her father's play, capturing them by using their deepest fears and strengths against them. She then creates her own sets of Armor to hold them captive, wanting them to summon the Inferno Armor and use its power to purge the world from pain and sorrow. However, after she realizes that they were suffering because of Talpa's influence affecting the Armors, they help her reunite her with her mother. In return, Suzunagi gives them new Armors free from Talpa's influence and helps them realize that being Ronin Warriors was their choice, rather than their destiny.\nReferences\nth:ซามูไรทรูปเปอร์"
    }
  ]
}