{
  "content": [
    {
      "type": "text",
      "text": "# List of electoral wards in Surrey\n\nThis is a list of electoral divisions and wards in the ceremonial county of Surrey in South East England. All changes since the re-organisation of local government following the passing of the Local Government Act 1972 are shown. The number of councillors elected for each electoral division or ward is shown in brackets.\nCounty council\nSurrey\nElectoral Divisions from 1 April 1974 (first election 12 April 1973) to 7 May 1981:\nElectoral Divisions from 7 May 1981 to 5 May 2005:\nElectoral Divisions from 5 May 2005 to 2 May 2013:\n† minor boundary changes in 2009\nElectoral Divisions from 2 May 2013 to present:\nDistrict councils\nElmbridge\nWards from 1 April 1974 (first election 7 June 1973) to 6 May 1976:\nWards from 6 May 1976 to 4 May 2000:\nWards from 4 May 2000 to 5 May 2016:\nWards from 5 May 2016 to present:\nEpsom and Ewell\nWards from 1 April 1974 (first election 7 June 1973) to 6 May 1976:\nWards from 6 May 1976 to 1 May 2003:\nWards from 1 May 2003 to present:\nGuildford\nWards from 1 April 1974 (first election 7 June 1973) to 6 May 1976:\nWards from 6 May 1976 to 1 May 2003:\nWards from 1 May 2003 to present:\nMole Valley\nWards from 1 April 1974 (first election 7 June 1973) to 6 May 1976:\nWards from 6 May 1976 to 4 May 2000:\nWards from 4 May 2000 to present:\nReigate and Banstead\nWards from 1 April 1974 (first election 7 June 1973) to 3 May 1979:\nWards from 3 May 1979 to 4 May 2000:\nWards from 4 May 2000 to 2 May 2019:\nWards from 2 May 2019 to present:\nRunnymede\nWards from 1 April 1974 (first election 7 June 1973) to 6 May 1976:\nWards from 6 May 1976 to 4 May 2000:\nWards from 4 May 2000 to present:\nSpelthorne\nWards from 1 April 1974 (first election 7 June 1973) to 3 May 1979:\nWards from 3 May 1979 to 1 May 2003:\nWards from 1 May 2003 to present:\nSurrey Heath\nWards from 1 April 1974 (first election 7 June 1973) to 6 May 1976:\nWards from 6 May 1976 to 1 May 2003:\nWards from 1 May 2003 to present:\nTandridge\nWards from 1 April 1974 (first election 7 June 1973) to 6 May 1976:\nWards from 6 May 1976 to 4 May 2000:\nWards from 4 May 2000 to present:\n† minor boundary changes in 2007\nWaverley\nWards from 1 April 1974 (first election 7 June 1973) to 5 May 1983:\nWards from 5 May 1983 to 1 May 2003:\nWards from 1 May 2003 to present:\nWoking\nWards from 1 April 1974 (first election 7 June 1973) to 6 May 1976:\nWards from 6 May 1976 to 4 May 2000:\nWards from 4 May 2000 to 5 May 2016:\nWards from 5 May 2016 to present:\nElectoral wards by constituency\nEast Surrey\nBletchingley and Nutfield, Burstow, Horne and Outwood, Chaldon, Dormansland and Felcourt, Felbridge, Godstone, Harestone, Horley Central, Horley East, Horley West, Limpsfield, Lingfield and Crowhurst, Oxted North and Tandridge, Oxted South, Portley, Queens Park, Tatsfield and Titsey, Valley, Warlingham East and Chelsham and Farleigh, Warlingham West, Westway, Whyteleafe, Woldingham.\nEpsom and Ewell\nAshtead Common, Ashtead Park, Ashtead Village, Auriol, College, Court, Cuddington, Ewell, Ewell Court, Nonsuch, Nork, Ruxley, Stamford, Stoneleigh, Tattenhams, Town, West Ewell, Woodcote.\nEsher and Walton\nClaygate, Cobham and Downside, Cobham Fairmile, Esher, Hersham North, Hersham South, Hinchley Wood, Long Ditton, Molesey East, Molesey North, Molesey South, Oxshott and Stoke D’Abernon, Thames Ditton, Walton Ambleside, Walton Central, Walton North, Walton South, Weston Green.\nGuildford\nAlfold, Cranleigh Rural and Ellens Green, Burpham, Blackheath and Wonersh, Christchurch, Cranleigh East, Cranleigh West, Ewhurst, Friary and St Nicolas, Holy Trinity, Merrow, Onslow, Pilgrims, Shalford, Shamley Green and Cranleigh North, Stoke, Stoughton North, Stoughton South, Westborough, Worplesdon.\nMole Valley\nBeare Green, Bookham North, Bookham South, Box Hill and Headley, Brockham, Betchworth and Buckland, Capel, Leigh and Newdigate, Charlwood, Clandon and Horsley, Dorking North, Dorking South, Effingham, Fetcham East, Fetcham West, Holmwoods, Leatherhead North, Leatherhead South, Leith Hill, Lovelace, Mickleham, Westhumble and Pixham, Okewood, Send, Tillingbourne, Westcott.\nReigate\nBanstead Village, Chipstead, Hooley and Woodmansterne, Earlswood and Whitebushes, Kingswood with Burgh Heath, Meadvale and St John's, Merstham, Preston, Redhill East, Redhill West, Reigate Central, Reigate Hill, Salfords and Sidlow, South Park and Woodhatch, Tadworth and Walton.\nRunnymede and Weybridge\nAddlestone Bourneside, Addlestone North, Chertsey Meads, Chertsey St Ann's, Chertsey South and Row Town, Egham Hythe, Egham Town, Englefield Green East, Englefield Green West, Foxhills, New Haw, Oatlands Park, St George's Hill, Thorpe, Virginia Water, Weybridge North, Weybridge South, Woodham.\nSouth West Surrey\nBramley, Busbridge and Hascombe, Chiddingfold and Dunsfold, Elstead and Thursley, Farnham Bourne, Farnham Castle, Farnham Firgrove, Farnham Hale and Heath End, Farnham Moor Park, Farnham Shortheath and Boundstone, Farnham Upper Hale, Farnham Weybourne and Badshot Lea, Farnham Wrecclesham and Rowledge, Frensham, Dockenfield and Tilford, Godalming Binscombe, Godalming Central and Ockford, Godalming Charterhouse, Godalming Farncombe and Catteshall, Godalming Holloway, Haslemere Critchmere and Shottermill, Haslemere East and Grayswood, Hindhead, Milford, Witley and Hambledon.\nSpelthorne\nAshford Common, Ashford East, Ashford North and Stanwell South, Ashford Town, Halliford and Sunbury West, Laleham and Shepperton Green, Riverside and Laleham, Shepperton Town, Staines, Staines South, Stanwell North, Sunbury Common, Sunbury East.\nSurrey Heath\nAsh South and Tongham, Ash Vale, Ash Wharf, Bagshot, Bisley, Chobham, Frimley, Frimley Green, Heatherside, Lightwater, Mytchett And Deepcut, Old Dean, Parkside, St Michaels, St Pauls, Town, Watchetts, West End, Windlesham.\nWoking\nBrookwood, Byfleet, Goldsworth East, Goldsworth West, Hermitage and Knaphill South, Horsell East and Woodham, Horsell West, Kingfield and Westfield, Knaphill, Maybury and Sheerwater, Mayford and Sutton Green, Mount Hermon East, Mount Hermon West, Normandy, Old Woking, Pirbright, Pyrford, St John's and Hook Heath, West Byfleet.\nSee also\n*List of parliamentary constituencies in Surrey\nReferences"
    }
  ]
}