{
  "content": [
    {
      "type": "text",
      "text": "# List of heritage sites damaged during the Syrian civil war__disambig_1\n\n, a World Heritage Site, coming under fire during the Syrian Civil War]]\nThis is a list of heritage sites that were damaged or destroyed during the Syrian Civil War. Damage has been caused to numerous historic buildings, tell mounds and archaeological locations, including all six UNESCO World Heritage Sites in the country. Destructive effects of the conflict are caused by shelling, looting and rebel occupation.\nShelling\n* Krak des Chevaliers (World Heritage Site) An air raid on Syria's famed Krak des Chevaliers castle, a UNESCO World Heritage Site, has damaged one of the fortress's towers. The footage shows a huge blast as a tower of the Crusader castle appears to take a direct hit, throwing up large clouds of smoke, and scattering debris in the air.\n* Archaeological Villages of Northern Syria (World Heritage Site)\n* Bosra (World Heritage Site)\n* Palmyra (World Heritage Site), Islamic citadel damaged by gunfire.\n* Old city of Damascus (World Heritage Site)\n* Medieval buildings in the Ancient City of Aleppo (World Heritage Site)\n* Al-Madina Souq in Aleppo, world's largest covered historic market, destroyed and burnt by fire.\n* Great Mosque of Aleppo, damaged during a Syrian rebel offensive. Wall destroyed by Rocket-propelled grenades.\n* Apamea and the wall and towers of the citadel of Al-Madiq Castle (Tentative World Heritage Site)\n* Mosque of Idlib Sermin\n* Mosque of al-Tekkiyeh Ariha\n* Grand Mosque of Al-Qusaayr\n* Monastery of St. Elian\n* Mosque al-Herak\n* Our Lady of Seydnaya Monastery\n* Monastery of St. James the Mutilated\n* Citadel of Aleppo\n* Assyrian Temple at Tell Sheikh Hamad\n* Large parts of Hama\n* Large parts of Homs\n* Tomb of Sheikh Dahur al-Muhammad, Rityan\n* Unspecified sites and monuments in the Daraa District (in particular Dar al-Balad, Da'il and Inkhil)\n* Mosque al-Umary in Daraa (one of the oldest Islamic monuments)\n* Ancient temple of Ain Dara at Afrin. During the Turkish military operation in Afrin at 2018, Turkish shelling had seriously damaged the temple.\n* Beit Ghazaleh Museum of the city of Aleppo\nConcern has also been raised about sites likely to be affected by shelling including the World Heritage Sites at the centres of Damascus and Aleppo and the tentative World Heritage Site of Norias of Hama.\nLooting\nThere are twenty five cultural heritage museums dispersed around Syria, many with artifacts stored outside. It has been reported that the museum at Homs has been looted and that only the museums and monuments of Damascus are safe from looting and destruction from the escalating warfare between government and armed rebel militias. Syria's Prime Minister, Adel Safar, warned on 11 July 2011 that \"the country is threatened by armed criminal groups with hi-tech tools and specialized in the theft of manuscripts and antiquities, as well as the pillaging of museums\" and called for increased security measures.\n* The Museum of Hama: \"According to sources in Syria, the well-known regional Museum of Hama situated in the town of Hama, north-west region of Syria, has fallen victim to looters. Notably, an intricate gilt bronze statue, dating back to the Aramaean era, is currently reported as missing, and there are growing fears it may be trafficked out of Syria to international markets.\"\n* The Raqqa Museum, also known as the Qala'at Jabar Museum, was looted on 1 May 2012. Stolen items included three figurines of the goddess Ishtar and pottery dating to the third millennium BC.\n* Roman mosaics were looted from Apamea with Roman floors were ripped up with bulldozers.\n* Two capitals from the colonnade of Decumanus, the main (Roman) road in Apamea.\n* The Museum of Deir ez-Zor\n* The Maarat al-Numan Museum\n* Beit Ghazaleh Museum of the city of Aleppo\nSecurity at the Museum of Idlib has also been raised as a concern by the organization Syrian Archaeological Heritage Under Threat. The lack of documentation of antiquities in the country has created a severe problem protecting the collections. Looting carries a fifteen-year prison sentence in Syria.\nLatest reports indicate a growing black market in the region where antiquities are being traded for weapons by the rebels. Time commented that continued looting will \"rob Syria of its best chance for a post-conflict economic boom based on tourism, which, until the conflict started 18 months ago, contributed 12% to the national income\".\nMoreover, there were reports about looting and illegal excavations by pro-Turkish militia in Tell Halaf and Cyrrhus. Meanwhile, the pro-opposition SOHR has claimed that a pro-Iranian militia had excavated Tar as Sarayim in the eastern Homs Governorate.\nArmy or militias occupation\nDamage to ancient sites can be caused due to army occupation by encampments, entrenchment of military vehicles and weapons. It can also be caused during movement of materials for construction, souvenirs or even target practice.\n* Palmyra (World Heritage Site), tank occupation, statues and reliefs damaged.\n* Apamea (Tentative World Heritage Site), damaged by bulldozers used by looters digging into the citadel mound for treasure.\n* Bosra (World Heritage Site), damaged by tanks.\n* Tell Rifa'i or Tell Rifa'at, damaged by soldiers using it as a camp.\n* The Chateau de Chmemis in Salamyeh, shelters for tanks excavated at the base of the citadel.\n* Khan Sheikhoun, shelters for tanks on the slopes of the tell.\n* Tell Afis, damaged by encampments.\n* Tell A'zaz, damaged by installation of heavy weaponry.\n* Deir Mar Musa al-Habashi monastery, possibly damaged during army search.\n* Kafr Nubbel rock shelters, damaged during searches for deserters.\n* Qal Markab, damaged by installation of heavy weaponry.Kadesh_(Syria)#Tell_Nebi_Mend\n* Tell Nebi Mend, damaged by installation of heavy weaponry.\n* Homs Qal, tanks and heavy weaponry installation.\n* Qal Hama, tanks and heavy weaponry installation.\n* Sidi Yahia mosque, tanks and heavy weaponry installation.\nDemolition\nSeveral cultural heritage sites in Syria have been deliberately destroyed by the Islamic State of Iraq and the Levant from 2014 onwards, including:\n* Several buildings and structures in or near Palmyra:\n** Lion of Al-lāt, destroyed in June 2015\n** Medieval tombs of Mohammed bin Ali and Nizar Abu Bahaaeddine, blown up in June 2015\n** Temple of Bel, blown up in August 2015\n** Temple of Baalshamin, blown up in August 2015\n** Tower of Elahbel and several other ancient tombs, destroyed between June and September 2015\n** Monumental Arch, largely destroyed in October 2015\n* Armenian Genocide Memorial Church in Der Zor, blown up in September 2014\n* Virgin Mary Church in Tel Nasri, blown up in April 2015\n* Monastery of St. Elian near Al-Qaryatayn, destroyed in August 2015\nUNESCO reaction\nOn 30 March 2012, Irina Bokova, the Director-General of UNESCO made a public appeal for the protection of Syria's cultural heritage and expressed \"grave concern about possible damage to precious sites\".\nOn 2 October, Bokova issued a statement of regret about the destruction and fire that burnt the ancient souk in the old city of Aleppo. Calling it a \"crossroads of cultures since the 2nd millennium BC\". She called on the parties involved to comply with the Hague Convention of 1954 on the protection of cultural property in the event of armed conflict. She furthermore promised to send a team to assess the situation and provide assistance for emergency situations in order to protect Aleppo's heritage and to mitigate the effects of the cultural disaster and to avoid further damage.\nIn June 2013, UNESCO placed Syria's six World Heritage Sites on the organization's list of endangered sites. Subsequently UNESCO issued its Five years of conflict: the state of cultural heritage in the Ancient City of Aleppo Report in 2018.\nSee also\n* Tourism in Syria\n* Syrian Archaeological Heritage Under Threat\n* Control of cities during the Syrian civil war\n* Tell Sakka\n* List of destroyed heritage\n* Iconoclasm\n* Destruction of cultural heritage by the Islamic State (the Islamic State of Iraq and the Levant)\nReferences\nBibliography\n* [http://ghn.globalheritagefund.com/uploads/documents/document_2107.pdf Damage to the soul: Syria's cultural heritage in conflict] ()\nExternal links\n* [https://www.facebook.com/Archeologie.syrienne Le patrimoine archéologique syrien en danger]\n* [https://www.youtube.com/user/SyrianArchaeological Syrian Archaeological] channel on YouTube ([https://archive.org/details/SyrianArchaeologicalHeritageUnderThreat Archived] at Internet Archive)\n* [http://periodismohumano.com/en-conflicto/el-patrimonio-sirio-rehen-de-la-guerra.html El patrimonio sirio, rehén de la guerra]  ()\n*\n*\n*\n*\n* [http://sphotos-c.ak.fbcdn.net/hphotos-ak-ash3/10478_376042539130743_1127219497_n.jpg Photo] Great Mosque of Aleppo damage taken from the Facebook page of Le patrimoine archéologique syrien en danger ()\n* [http://sphotos-d.ak.fbcdn.net/hphotos-ak-ash4/3715_375501379184859_767854001_n.jpg Photo] Mar Assia Al-Hakim Church damage taken from the Facebook page of Le patrimoine archéologique syrien en danger ()\n* [https://www.facebook.com/apsa2011 The Association for the Protection of Syrian Archaeology - APSA2011]\n* [http://sphotos-b.ak.fbcdn.net/hphotos-ak-snc6/285753_375251362543194_1447940378_n.jpg Photo] Sarmada clandestine excavations taken from the Facebook page of Le patrimoine archéologique syrien en danger ()\n* [https://web.archive.org/web/20141231043015/http://www.visualizing.org/visualizations/culture-under-attack-terrorism Map and Infographic]"
    }
  ]
}