{
  "content": [
    {
      "type": "text",
      "text": "# List of county flags of Warmian-Masurian Voivodeship\n\nCounties (powiat) in Warmian-Masurian Voivodeship, Poland have symbols in the form of flags.\nAccording to the definition, a flag is a sheet of fabric of a specific shape, colour and meaning, attached to a spar or mast. It may also include the coat of arms or emblem of the administrative unit concerned. In Poland, territorial units (municipal, city and county councils) may establish flags in accordance with the Act of 21 December 1978 on badges and uniforms. In its original version, it only allowed territorial units to establish coats of arms. It was not until the ‘Act of 29 December 1998 amending certain acts in connection with the implementation of the state system reform’ that the right of Voivodeships, powiats and municipalities to establish this symbol of territorial unit was officially confirmed. This change benefited powiats, which were reinstated in 1999.\nIn 2024, Warmińsko-Mazurskie Voivodeship had its own flag in 17 out of 19 poviats (powiats: Nowomiejski and Olsztyński did not have a flag) and 2 cities with powiat rights. This symbol, since 2002, has been established by the voivodeship itself.\nList of current county flags\nCities with powiat rights\n{| class=\"wikitable\"\n!Powiat\n!Wzór\n!Opis\n|-\n|City of Elbląg\n|\n|The city's flag refers to a banner from Hanseatic times. It is a rectangular flag, divided into two equal horizontal stripes: white and red. To the left are two Maltese crosses: the upper red and the lower white.\n|-\n|City of Olsztyn\n|\n|The city's flag, designed by Jacek Skorupski, was established in 2003. It is a rectangular flag with proportions of 5:8, blue in colour, in the left part of which a golden shell (symbol of St James) is placed, and under it a white wavy line, referring to the River Łyna.\n|}\nCounties\n{| class=\"wikitable\"\n|+\n!Powiat\n!Wzór\n!Opis\n|-\n|Powiat bartoszycki\n|\n|The county flag was established by Resolution No. V/37/2003 of 25 April 2003. It is a flag with proportions 1:2 in the form of a red flag, surrounded by a red and white border. On the left-hand side of the flag there is an axe from the county coat of arms.\n|-\n|Powiat braniewski\n|\n|The county flag was established by Resolution No. XXVIII/218/2001 of 29 June 2001. It is a rectangular flag with proportions of 5:8, divided into three equal horizontal stripes: blue, yellow and green. On the left side of the flag there is a black triangle.\n|-\n|Powiat działdowski\n|\n|The county flag was established by Resolution No. XXXV/219/02 of 26 June 2002. It is a rectangular flag with proportions of 5:8, divided into two equal horizontal stripes: blue and red. In the upper left corner of the patch, in a white canton (1/4 of the length of the upper stripe), there is a red lion from the county coat of arms, facing the opposite direction to the one on the coat of arms.\n|-\n|Powiat elbląski\n|\n|The flag of the district was established by means of resolution No VIII/72/03 of 26 September 2003. It is a rectangular flag with proportions 5:8 in red in colour , in the central part of the flag the emblem from the district coat of arms is placed.\n|-\n|Powiat ełcki\n|\n|The county flag was established by Resolution No. XXX.306.2013 of 28 March 2013. It is a rectangular flag  with proportions of 5:8, divided into two parts in the ratio of 2:3: the left one is blue, with the emblem from the county coat of arms, and the right one is white, with three blue diagonal stripes.\n|-\n|Powiat giżycki\n|\n|The county flag was established by Resolution No. XXVIII/228/2001 of 26 June 2001. It is a rectangular piece of cloth with proportions of 5:8, divided in a cross into four blue and white parts (the canton is blue). In its central part is placed on a green shield a yellow deer's head, taken from the county coat of arms.\n|-\n|Powiat gołdapski\n|\n|The county flag was established by Resolution No. VIII/50/2007 of 28 June 2007. It is a rectangular flag with proportions of 5:8, divided into seven equal horizontal stripes: four yellow and three black. In the central part of the flag is the county coat of arms.\n|-\n|Powiat iławski\n|\n|The flag of the district was established by virtue of resolution no. XXXVII/308/2002 of 19 June 2002. It is a rectangular flag with proportions 5:8, blue in colour, in the central part of the flag the emblem from the district coat of arms is placed.\n|-\n|Powiat kętrzyński\n|\n|The county flag is a rectangular flag with proportions of 5:8, divided into five equal horizontal stripes: two blue, two white and one green. In the central part of the flag there may be the county coat of arms.\n|-\n|Powiat lidzbarski\n|\n|The flag of the district was established by the resolution No. 113/XV/2000 of 23 March 2000. It is a rectangular flag with proportions of 5:8, divided into three vertical stripes: blue, yellow and red in the ratio of 1:3:1. In the central part of the flag is the district coat of arms.\n|-\n|Powiat mrągowski\n|\n|The county flag was established by Resolution No. 182/XXVI/2000 of 24 November 2000. It is a rectangular flag with proportions of 5:8, divided into three vertical stripes: two blue and a wider white one. In the central part of the flag is the county coat of arms.\n|-\n|Powiat nidzicki\n|\n|The flag of the district was established by means of Resolution No. XIV/81/08 of 30 January 2008. It is a rectangular flag with proportions of 5:8, white in colour, in the central part of the flag the emblem from the district coat of arms is placed (a wavy line extended to the edges of the flag).\n|-\n|Powiat olecki\n|\n|The county flag, designed by Robert Szydlik, was established by Resolution No. XXXII/214/2013 of 30 August 2013. It is a rectangular flag with proportions of 5:8, divided into three horizontal stripes: two green and one white in the ratio of 2:1:2. In the central part of the flag the county coat of arms is placed.\n|-\n|Powiat ostródzki\n|\n|The county flag was established by Resolution No. XIX/128/2000 of 27 June 2000. It is a rectangular flag with proportions of 5:8, divided into three vertical stripes: two red and one white in the ratio of 1:2:1. In the central part of the flag is a rose bud - the symbol of the Prussian Confederation.\n|-\n|Powiat piski\n|\n|The county flag was established by Resolution No. XXXII/161/2001 of 28 June 2001. It is a rectangular flag with proportions of 5:8, divided into twelve green and gold fields radiating from the centre of the flag (this refers to the rays of the sun spreading in the forests). In the central part of the flag is the county coat of arms.\n|-\n|Powiat szczycieński\n|\n|The county flag was established by Resolution No. XXVIII/189/02 of 8 October 2002. It is a rectangular flag with proportions of 5:8, divided into three horizontal stripes: blue, white and red in a ratio of 2:1:1. The above the upper white stripe features the county coat of arms.\n|-\n|Powiat węgorzewski\n|\n|The county flag, designed by Łukasz Aleksandrowicz, was established by Resolution No. LI/231/2018 of 4 October 2018. It is a rectangular flag with proportions of 5:8, divided into two parts in the ratio of 3:2, on the top part the county coat of arms are placed.\n|}\nSee also\n* Flags of municipalities in the Warmian-Masurian Voivodeship\nReferences"
    }
  ]
}