{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1834\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1834.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland).  For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign.  Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\".  Acts passed from 1963 onwards are simply cited by calendar year and chapter number.\nAll modern acts have a short title, e.g. the Local Government Act 2003.  Some earlier acts also have a short title given to them by later acts, such as by the Short Titles Act 1896.\n4 & 5 Will. 4\nThe second session of the 11th Parliament of the United Kingdom, which met from 4 February 1834 until 15 August 1834.\nThis session was also traditionally cited as 4 & 5 Gul. 4, 4 & 5 Wm. 4 or 4 & 5 W. 4.\nPublic general acts\nfor regulating the Labour of Children and young Persons in the Mills and Factories of the United Kingdomm.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  intituled \"An Act to alter certain Rates of Postage, and to amend, explain, and enlarge several Provisions in an Act made in the Ninth Year of the Reign of Queen Anne, and in other Acts relating to the Revenue of the Post Office,\" as authorizes the taking of certain Rates of Inland Postage within His Majesty's Dominions in North America.|note4= }}\n|  }}\n|  and Solicitors to make and file the same on or before the First Day of Hilary Term One thousand eight hundred and thirty-five; and to allow Persons to make and file such Affidavits, although the Persons whom they served shall have neglected to take out their Annual Certificates.|note4= }}\n|  }}\n|\n|  }}\n|  for the Prevention of Smuggling, as authorizes Magistrates to sentence Persons convicted of certain Offences to serve His Majesty in His Naval Service, and to alter and amend the said Act.|note4= }}\n|  }}\n|\n|\n|  }}\n|  }}\n|\n|  to regulate the Conveyance and Sale of Fish at First Hand.}}\n|  for regulating the buying and selling of Hay and Straw.}}\n|\n|\n|  }}\n|  for amending and consolidating the Laws relating to the Pay of the Royal Navy.|note4= }}\n|  }}\n|\n|\n|\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  for the Improvement of Glasgow.|note4= }}\n|  for the more effectual Suppression of local Disturbances and dangerous Associations in Ireland.|note4= }}\n|\n|  to consolidate and amend the Laws relating to Friendly Societies.|note4= }}\n|\n|  }}\n|\n|\n|  for altering and consolidating the Laws for regulating the Pensions and Allowances to Persons in respect of their having held Civil Offices in His Majesty's Service.|note4= }}\n|\n|\n|  }}\n|  and Sixth Years of the Reign of His late Majesty King George the Fourth, relating to Weights and Measures.}}\n|  for amending the Irish Road Acts.}}\n|\n|  for the Relief and Support of sick, maimed, and disabled Seamen, and the Widows and Children of such as shall be killed, slain, or drowned in the Merchant Service; and for other Purposes.|note4= }}\n|  }}\n|\n|  and in the First and Second Years and in the Second and Third Years of the Reign of His present Majesty, for the uniform Valuation of Lands and Tenements in the several Baronies, Parishes, and other Divisions of Counties in Ireland; and to provide for the more effectual Levy of Grand Jury Cess.|note4= }}\n|  }}\n|  }}\n|  }}\n|  for ascertaining the Boundaries of the Forest of Dean, and for inquiring into the Rights and Privileges claimed by Free Miners of the Hundred of Saint Briavel's, to the Twenty-first Day of January One thousand eight hundred and thirty-five, and from thence to the End of the then next Session of Parliament.|note4= }}\n|\n|\n|  }}\n|  of the Disembodied Militia in Great Britain and Ireland; and to grant Allowances in certain Cases to Subaltern Officers, Adjutants, Paymasters, Quartermasters, Surgeons, Assistant Surgeons, Surgeons Mates, and Serjeant Majors of the Militia, until the First Day of July One thousand eight hundred and thirty-five.|note4= }}\n|  }}\n|\n|  }}\n|\n|  }}\n|  }}\n|\n|  affecting the Printers, Publishers, and Proprietors of Newspapers in Ireland.|note4= }}\n|\n|  }}\n|  for rendering the Payment of Creditors more equal and expeditious in Scotland.|note4= }}\n|\n| or the New Poor Law|public|76|14-08-1834|archived=n|An Act for the Amendment and better Administration of the Laws relating to the Poor in England.}}\n|\n|  }}\n|\n| |note4= }}\n|  for regulating Turnpike Roads in England, so far as the same relates to the Weights to be carried upon Waggons with Springs.}}\n|  to effectuate the Service of Process issuing from the Courts of Chancery and Exchequer in England and Ireland.|note4= }}\n| |note4= }}\n|  }}\n|  to permit the general Sale of Beer and Cider by Retail in England.}}\n|  to provide for the Election of Magistrates and Councillors for the several Burghs and Towns of Scotland which now return or contribute to return Members to Parliament, and are not Royal Burghs.}}\n|  to alter and amend the Laws for the Election of the Magistrates and Councils of the Royal Burghs in Scotland.}}\n|\n|  }}\n|  }}\n|  }}\n|\n|  }}\n| or the Trading Companies Act 1834|public|94|15-08-1834|archived=n|An Act to enable His Majesty to invest trading and other Companies with the Powers necessary for the due Conduct of their Affairs, and for the Security of the Rights and Interests of their Creditors.}}\n|  }}\n|\n}}\nLocal acts\nrelating to the said Company.|note4= }}\n|  }}\n|  relating to the Saint Helen's and Runcorn Gap Railway Company.}}\n|\n|  }}\n|  }}\n|  for enabling the Company of Proprietors of Lambeth Waterworks to supply the Inhabitants of the Parish of Lambeth and Parts adjacent in the County of Surrey with Water.|note4= }}\n|  }}\n|\n-\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|  }}\n-\n|\n|  }}\n|  for taking down and rebuilding Folly Bridge otherwise Friars Bridge, across the River Isis, in or near the City of Oxford.}}\n|\n|  }}\n| or the Preston and Wigan Railway Act 1834|local|25|22-05-1834|archived=n|An Act for uniting the Wigan Branch Railway Company and the Preston and Wigan Railway Company; for authorizing an Alteration to be made in the Line of the last-mentioned Railway; and for repealing, altering, and amending the Acts relating to the said Railways.}}\n|\n|  for making the said Railway.}}\n|\n|  }}\n-\n|  }}\n|\n|\n|  }}\n|  and for granting certain Powers to the said Company instead thereof.}}\n|\n|  }}\n|  for enabling \"The West of England Fire and Life Insurance Company\" to sue and be sued in the Name of their Secretary, and to give further Powers to the said Company.}}\n|  }}\n| |note4= }}\n-\n|  for the more easy and speedy Recovery of Small Debts within the Parish of Merthyr Tidfil and other Places therein mentioned in the Counties of Glamorgan, Brecon, and Monmouth.|note4= }}\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|\n|\n-\n|  and Tenth Years of His late Majesty King George the Fourth, for building a Bridge over the River Thames at Staines in the County of Middlesex, and for making proper Approaches thereto.}}\n|  }}\n|  }}\n|\n|\n|  }}\n|  relative to the Hartlepool Railway.}}\n|\n|  for paving, lighting, watching, and otherwise improving Grosvenor Place, and several Streets and other public Places in the Parishes of Saint George Hanover Square and Saint Luke Chelsea in the County of Middlesex.|note4= }}\n|  }}\n-\n|  }}\n|\n|  and the Parishes of Hove and Preston, in the County of Sussex.|note4= }}\n|\n|\n|\n|\n|  intituled \"An Act for enlarging, improving, and maintaining the Port and Harbour of Perth, for improving the Navigation of the River Tay to the said City, and for other Purposes therewith connected.\"|note4= }}\n|\n|\n-\n|  relating to the said Company.}}\n|  }}\n|\n|  }}\n|  for amending and keeping in repair the Mail Coach Road leading from Banbridge in the County of Down to Belfast in the County of Antrim|note4= }}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n-\n|\n|\n| |note4= }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  for more effectually repairing and improving the Middlesex and Essex Turnpike Roads; to provide for the rebuilding of Bow Bridge in the Counties of Middlesex and Essex, the improving of the several other Bridges upon the said Roads, and for other Purposes relating thereto.}}\n-\n|\n|  }}\n|  }}\n|  for establishing and maintaining the Harbour of Port Crommelin in the Bay of Cushendun in the County of Antrim.}}\n|\n|  }}\n|\n}}\nPrivate acts\n)}} }}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n| )}} for inclosing Lands in the Parish of Longney in the County of Gloucester.}}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n| or the Mealiffe, Upper Church and Temple Beg (Tipperary) Inclosure Act 1834|private|34|30-07-1834|maintained=y|repealed=n|archived=n|An Act for inclosing Commons and Waste Lands within the Parishes of Mealiffe, Upper Church, and Temple Beg, in the County of Tipperary.}}\n|\n|\n| |private|37|26-03-1834|repealed=n|archived=n|An Act to enable James Thomas of Halifax in the County of York, Gentleman, and his Issue, to take and use the Surname and Arms of Berry.}}\n| |private|38|22-05-1834|repealed=n|archived=n|An Act for inclosing Lands in the Township of Raskelf in the Parish of Easingwold in the North Riding of the County of York.}}\n| |private|39|16-06-1834|repealed=n|archived=n|An Act for the Naturalization of John Peter Segundo Mousley and Charles Edward Eugene Mousley.}}\n| |private|40|16-06-1834|repealed=n|archived=n|An Act for inclosing Lands within the Manors and Tithings of Elwell otherwise Ridgeway and Stottingway within the Parish of Upway in the County of Dorset.}}\n| |private|41|27-06-1834|repealed=n|archived=n|An Act to dissolve the Marriage of John Allan with Jane his now Wife, and to enable him to marry again; and for other Purposes therein mentioned.}}\n| |private|42|27-06-1834|repealed=n|archived=n|An Act to enable Frederick Lumley Esquire to take and use the Surname and Arms of Savile.}}\n| |private|43|27-06-1834|repealed=n|archived=n|An Act for naturalizing Charles William Francken.}}\n| |private|44|25-07-1834|repealed=n|archived=n|An Act to dissolve the Marriage of Isaac John Horlock Esquire with Phebe Horlock his now Wife, and to enable him to marry again; and for other Purposes therein mentioned.}}\n| |private|45|25-07-1834|repealed=n|archived=n|An Act for naturalizing Arthur Auguste de la Rive of Geneva, and William de la Rive, Jeanne Adele de la Rive, and Charles Lucien de la Rive, his Children.}}\n| |private|46|13-08-1834|repealed=n|archived=n|An Act to dissolve the Marriage of Henry Howell with Elizabeth his now Wife, and to enable him to marry again; and for other Purposes therein mentioned.}}\n}}\nSources\n*\n*\n*\n*\n*\nSee also\n* List of acts of the Parliament of the United Kingdom\nNotes\nReferences"
    }
  ]
}