{
  "content": [
    {
      "type": "text",
      "text": "# List of Bakugan: Battle Planet episodes\n\nis a Canadian-Japanese-American action adventure anime television series that acts as a reboot of the 2007–2012 anime show Bakugan Battle Brawlers. The series was produced by TMS Entertainment, Nelvana Enterprises, Man of Action Studios and Spin Master Entertainment under the direction of Kazuya Ichikawa. The story centers on the lives of creatures called Bakugan and the battle brawlers who possess them.\nThe series first premiered in the United States on Cartoon Network on December 23, 2018, with a number of episodes made available through video-on-demand platforms prior to first broadcast. In Canada, the show debuted on Teletoon on December 31, 2018, and was later rebroadcast on YTV starting January 11, 2019. Bakugan: Battle Planet began airing in Japan on TV Tokyo and other TX Network stations starting April 1, 2019.\nA series of animated shorts were released online shortly following the show's television debut.\nSeries overview\n| end1       =\n| network1   = Cartoon Network (US)  Teletoon (CAN)\n| color2     = #EAAF37\n| link2      = #Bakugan: Armored Alliance (2020–21)\n| auxA2      = 104\n| episodes2  = 52\n| start2     =\n| end2       =\n| color3     = #120A8F\n| link3      = #Bakugan: Geogan Rising (2021)\n| auxA3      = 52\n| episodes3  = 26\n| start3     =\n| end3       =\n| network3   = Netflix (US)  Teletoon (CAN)\n| color4     = #FF631A\n| link4      = #Bakugan: Evolutions (2022)\n| auxA4      = 56\n| episodes4  = 28\n| start4     =\n| end4       =\n| color5     = #8b0000\n| link5      = #Bakugan: Legends (2023)\n| auxA5      = 26\n| episodes5  = 13\n| released5 =\n| network5  = Netflix (US)  Cartoon Network (CAN)\n}}\nEpisode list\nEach of the episodes contains a total of two 11-minute segments.\nBakugan: Battle Planet (2018–20)\n{|class=\"wikitable\" style=\"width:98%; margin:auto; background:#FFF;\"\n|- style=\"border-bottom: 3px solid #EAAF37\"\n! style=\"width:3em;\"  | Ser#\n! style=\"width:3em;\"  | Sea#\n! English Title Japanese title\n! style=\"width:12em;\" | Air date\n! style=\"width:12em;\" | Japanese air date\n! style=\"width:12em;\" | U.S. viewers\n(US)December 31, 2018 (CAN)\n| AltDate         = April 1, 2019\n| Viewers         = 0.40\n| ShortSummary    = Magnus challenges Dan to a battle which he reluctantly accepts. The scene then shifts to the beginning of the “Great Collision” from 12 years ago. Dan Kouzo and his friends Wynton Styles, Lia Venegas, and their dog Lightning are a team known as the “Awesome Ones” that live in the city of Los Volmos. They like to make videos based on their adventures and put them on Viewtube to share with other viewers just for fun. One night, the AO decide to investigate the site where the “Great Collision” took place. They sneak in to shoot their video, but their electronics shut down for no reason. They soon get caught in the crossfire, but they manage to escape. They begin hearing a strange noise and find an odd-looking puddle with something inside of it. Dan pulls out a strange looking ball, wondering what it is and rolls it out, which transforms into a strange looking creature. They flee at first, but Dan soon learns that it is a Bakugan who introduces himself as Dragonoid, revealing that he is now his partner. His friends also find Bakugan of their own and they decide to learn everything about them. Part 2: The AO begin to learn how to battle with their Bakugan, all while filming. Their videos start to go viral as they show how battles work. Soon many kids all over the world start to find Bakugan of their own, following the videos they made. The scene then shifts back to the battle between Dan and Magnus. Magnus gains the upper hand, knowing his moves and has his other Bakugan occupy Dan's friends so he can have him all to himself. Dan manages to power up Drago and defeat Nillious. The others defeat the other Bakugan as well. Suddenly, a group of Brawlers such as China Riot, Strata, and Aay arrive, hoping to convince them to join them, leaving them in shock. Magnus taunts them about the power they don’t understand before he and the others disappear, warning them to stop posting their videos. The AO don’t listen to them and continue with their video making to spread the word about Bakugan everywhere. Meanwhile in Japan, Shun Kazami watches their videos and is inspired to come meet them. Elsewhere, a mysterious man also watches their videos and decides to find out what to do with them.\n|LineColor        = 3198FF\n}}\n(US)January 1, 2019 (CAN)\n| AltDate         = April 8, 2019\n| Viewers         = 0.40\n| ShortSummary    = The Bakugan want to battle, but the AO are tired and hungry following their previous ones. Dan decides to get them lunch and Drago tags along as well. Arriving, they discover Aay trying to rob the Burger Joint. Dan is not impressed with him using his Bakugan like that and vows to stop him. Aay challenges Dan to a battle and he accepts. The battle proves pointless as Dan has no idea what to do to win. Aay taunts him into thinking that Bakugan can be controlled, but Dan disagrees, saying that friendship with Bakugan is more important than control. Dan changes his strategy up by having Drago stall for time, then has him attack multiple times and successfully defeats Mantanoid. Aay becomes paranoid about his loss and Dan announces that the AO will protect Los Volmos from any threat related to Bakugan. Dan finally gets his lunch, but is shocked to learn from Dwayne (the owner of Burger Joint) that it’s “on the house,” having saved this place from the battle they just won. Lia and Wynton are thrilled to have their lunch, and Dan learns that there are many Brawlers out there seeking to use Bakugan for evil and vows to stop them at any cost. He and Drago soon fall asleep, following their battle with Aay.\n|LineColor        = 3198FF\n}}\n(US)January 1, 2019 (CAN)\n| AltDate         = April 8, 2019\n| Viewers         = 0.40\n| ShortSummary    = Dan and Drago are training which doesn’t go so well, accidentally causing damage in the process. Wynton and Lia advise him to “think about your surroundings,” which Dan brushes off, saying that all he wanted was to have fun. Later, they discover 3 kids called the Rowdy Reds playing with their Skorporos Bakugan, then find the park completely destroyed by accident. They recognize Dan, having watched the AO’s videos. He attempts to pass on his friends advice to them, hoping they’ll understand. Later, the AO find out that the Rowdy Reds are still continuing to wreck parts of the town with their Bakugan. Confronting them, they refuse to listen to Dan, thinking that he’s being bossy. They decide to battle him while Lia and Wynton watch, which becomes obscure as the trio attempt to interfere with Dan unfairly. Things become far out of place as they continue to fight, but Dan stops them, saying that the battle must end or else they’ll cause even more damage. The trio eventually decide to call it a day and decide to clean up their messes, with the AO helping out as well.\n|LineColor        = 3198FF\n}}\n(US)January 2, 2019 (CAN)\n| AltDate         = April 15, 2019\n| Viewers         = 0.35\n| ShortSummary    = The Rowdy Reds lose a battle to a bully named Marco Chezanello and his Bakugan Cyndeous who claims the park all for himself. Mac and Maggie head to Studio D and ask the AO for help, informing them about their problem with Marco. Dan eventually decides to stand up to him, thinking he can handle it. Arriving at the park, they find out that Max has joined him out of his own free will. Cyndeous begins to question Marcos motives, unable to understand his true intentions, but Marco dismisses his words. Dan battles Marco, hoping to reclaim the park for everyone. He resorts to cheating by sending Drago flying before he is unleashed, distracting Dan, something Cyndeous doesn’t agree with. Lia and Wynton battle him, but Marco continues to use dirty tricks to cheat his way through. Cyndeous refuses to battle unfairly, but Marco orders him to do so by attempting to coerce him into destroying the AO and the other members of the Rowdy Reds, much to his complete shock. He refuses to comply, realizing that he can’t hurt humans because it’s wrong. Marco continues to ferociously yell at him to do what he says, causing Cyndeous to lose control of himself. Drago and Dan arrive just in time to save them. The Bakugan manage to apprehend Cyndeous as he starts to calm down, not wanting to continue this battle. Marco’s demands have made Dan realize that he was like that before, and he knocks him down, saying that Brawlers shouldn’t act like they own Bakugan, thus ending the battle. Max finally realizes Marco’s true nature and decides to return to his siblings. Cyndeous decides to leave Marco for good and partners up with Dan because he agrees with his true nature. Dan happily accepts.\n|LineColor        = 3198FF\n}}\n(US)January 2, 2019 (CAN)\n| AltDate         = April 15, 2019\n| Viewers         = 0.35\n| ShortSummary    = Wynton starts pulling pranks on Trox, believing this to be fun, but Trox becomes annoyed by them. After countless pranks, Trox can’t take it anymore and says that he doesn’t want to be his partner anymore. He decides to prove to Wynton that he would be better off without him by battling Drago, Gorthion and Cyndeous at the same time. Wynton allows it, believing that he won’t stand a chance. During the battle, Trox proves to be handling it well while Wynton still believes that he can’t win while he’s outmatched. He eventually wins the battle, knowing that they always rush into things too quickly (a weakness that he sees in them). He then leaves to find a new partner. Wynton, realizing his mistake, runs after Trox, begging him not to go as he starts to apologize for all those pranks he’s done to him, vowing to stop forever. Trox stops for a moment and reminds Wynton about earning trust and, seeing the tears in his eyes, decides to stay, knowing that he proved it today. Having reconciled with each other, they decide to work together for the greater good.\n|LineColor        = 3198FF\n}}\n(US)January 3, 2019 (CAN)\n| AltDate         = April 22, 2019\n| Viewers         = 0.32\n| ShortSummary    = The AO continue to shoot videos on their Bakugan battles, until they accidentally start causing minor damage. Kravitz, a mysterious agent, decides to use this opportunity to turn everyone against Bakugan by using a device to revert them out of their ball forms, causing even more damage. She continues to do this as part of her plan to outlaw all Bakugan in Los Volmos. The AO discover this and learn that the people are beginning to protest against Bakugan, unaware that Kravitz is behind this. They head to a field where all the other Brawlers are trying to battle since they can’t battle anywhere else. They are eventually caught and forced to give up their Bakugan. Kravitz collects them and leaves. Later, Veronica, Lia’s mother, announces that a weather satellite is about to crash towards the city, forcing an evacuation. The AO want to save the city and are determined to get their Bakugan back. Kravitz hears about the news but doesn’t care about it until the AO confront her, demanding that she give back their Bakugan. She refuses and storms past them, but the device falls out of her pocket, freeing their Bakugan and exposing her plan to them before disappearing. The AO proceed to save the city by getting the people to safety while Dan and Drago destroy the satellite, saving Los Volmos. They are soon hailed as heroes and the people decide to lift the ban, knowing that the Bakugan can be trusted again. Meanwhile, Kravitz reports the incident to Philomena who finds out about the AO’s involvement, knowing that they will give them trouble eventually.\n|LineColor        = 3198FF\n}}\n(US)January 3, 2019 (CAN)\n| AltDate         = April 22, 2019\n| Viewers         = 0.32\n| ShortSummary    = During a video shoot, Lia hears a familiar sound and goes to investigate. She finds another Bakugan who introduces herself as Pegatrix who has the power to battle beautifully. Later, they are approached by Jenkins, a servant sent by China Riot asking for Lia’s presence to battle her as per contract. After he leaves, she discovers that the contract states that the winner will take the loser's Bakugan, much to her shock. Pegatrix tries to persuade Lia to use a different battle strategy to win, but she brushes her off, saying that she can win this. The next day, the AO meet China Riot who starts the battle with Lia. Riot rigs the arena that gives her the advantage and defeats Gorthion easily, taking him in the process. Dan and Wynton, not wanting to lose Gorthion challenge her in order to win him back. Riot continues to use the rigged arena to throw them off balance so she can take their Bakugan too. Pegatrix convinces Lia to use her battle strategy to get Gorthion back and Lia, realizing her mistake agrees with her. She guides Dan and Wynton to Bakucores, pulling off an attack. Riot discovers Pegatrix wearing a camera on her leg and accuses Lia of cheating. Knowing that Riot cheated first, Lia pulls off a win and defeats her Bakugan Maxotaur. Even though she lost, Riot refuses to give them her Bakugan and escapes, breaking off the contract. Lia thanks Pegatrix for winning the battle as it really was dramatic after all.\n|LineColor        = 3198FF\n}}\n(US)January 4, 2019 (CAN)\n| AltDate         = April 29, 2019\n| Viewers         = 0.35\n| ShortSummary    = A new Brawler named Magnus challenges Aay to a battle. It is soon interrupted by the arrival of Shun Kazami, whom Magnus doesn’t need help from. The AO arrive just as Aay flees. They meet the Brawlers and Magnus asks to join them, but Dan is not quite sure about adding a new member. He decides to set up some tests for him to prove his worth. Magnus accepts as well as Shun, who also wants to take the tests, having come all the way from Japan. The challenges prove to be nonsense and Magnus believes that a Bakugan battle can prove himself worthy enough to be an Awesome One. On the last challenge, which is a race, Magnus battles Shun in the middle of it, showing off his true colors. In one incident where a huge tree branch is about to fall onto the AO, Shun saves them, but this results in his defeat by Magnus. With the decision finally made, Dan chooses Shun as their newest member, much to Magnus’s shock, knowing that he won the battle. Dan tells him that they have seen his true nature, and that he needs to think about others, not just himself, but he disappears without a trace. Meeting back up with Aay, Magnus decides to seek revenge against the AO for rejecting him.\n|LineColor        = 3198FF\n}}\n(US)January 4, 2019 (CAN)\n| AltDate         = April 29, 2019\n| Viewers         = 0.35\n| ShortSummary    = A young boy named Bobby is playing with his Bakugan Bear. Strata, a Bakugan hunter uses a device and captures him, putting him under his control. Meanwhile, the AO are filming their videos and start to wonder why Shun is trying to hide himself from being filmed, thinking that he’s too embarrassed to be on video. Just then, Bobby arrives, telling them of what happened and they go to investigate. They find a crushed car, assuming it was Bear, and a man who warns them that there are other Brawlers out there that will eventually come out of nowhere and steal their Bakugan before leaving. They find Bear wreaking havoc and prepare to apprehend him. Bobby intervenes, telling them not to hurt him as he’s usually not like this. Bear attacks the AO’s Bakugan, but starts to hesitate as he calls out to him. Strata continues to torture him into fighting until he is discovered. They see the device he’s using to control the Bakugan and plan to disarm him. Strata attacks their Bakugan, but Lightning intervenes and destroys the device, freeing Bear, then chases after him. Bobby is glad to have Bear back as he’s back to his normal self. Meanwhile, Lightning follows Strata to a strange location as he asks for a replacement device while vowing revenge. He then flees to warn the others about what he just saw.\n|LineColor        = 3198FF\n}}\n(US)January 12, 2019 (CAN)\n| AltDate         = May 6, 2019\n| Viewers         = 0.28\n| ShortSummary    = The AO set up a Bakugan field as their home so that they can battle without causing property damage. Lightning discovers another Bakugan who introduces himself as Artulean. Howlkor begins to take a dislike towards him, culminating in a battle, resulting in his defeat. Back at Studio D, Artulean begins to annoy Howlkor with his obnoxious personality despite Lightning trying to stop him. The AO return and discover the mess while also meeting Artulean who is responsible for this. Wondering what to do with him despite Lightning defending him, they soon meet a Bakugan counselor, unaware of who he truly is who offers to take care of Artulean and handle his mental and emotional state. Afraid, Lightning takes Artulean and runs away. Dan catches up to him and convinces him that he’ll be fine in the counselors hands. He soon gives in and hands him over. Just then, the counselor reveals himself as Magnus who tricked them into handing over Artulean to use against them. He causes him to go berserk by fueling his anger and manipulating him into believing that the AO were trying to get rid of him. Dan prepares to fight Artulean, but Lightning intervenes asking him not to, believing he can reach out to him. Howlkor manages to calm him down before going for Magnus, proving to be no match for him. Artulean saves him, then Lightning tells him everything that has transpired here. Realizing this, Artulean and Howlkor decide to put their differences aside and work together to defeat Magnus. He soon retreats as the others show up. In the end, the AO begin to see Howlkor and Artulean getting along well and realize he was only teasing him in the first place because he likes him. Lightning is soon satisfied, having known all along.\n|LineColor        = 3198FF\n}}\n(US)January 12, 2019 (CAN)\n| AltDate         = May 6, 2019\n| Viewers         = 0.28\n| ShortSummary    = Veronica wants to shoot a story on the AO, having seen their heroic actions when they saved Los Volmos from the weather satellite, and they eventually agree. Strata overhears this and plans to turn the AO against each other by having Dan hog the spotlight. He begins using his device to stage a few scenes, giving all of the credit to Dan, much to his friends' shock and annoyance. Aay and his team known as “The Exit arrive and challenge them to a battle. Lia, Wynton, and Lighting, tired of Dan hogging the spotlight, intervene, resulting in them quarreling with each other, giving “The Exit the advantage needed to take them down. Shun witnesses this and confronts them, reprimanding them for wanting to be on TV so badly. He reveals to them that their videos of them having fun inspired him to come to Los Volmos to meet them, and the incident they’re in now isn’t really fun at all. They soon realize this and decide to work together. Unbeknownst to them, Strata has captured Hydorous, intending to sell him in order to become rich. Dan and Shun go after him while the others stay behind to deal with “The Exit.” They free Hydorous, and, using their new found teamwork, defeat “The Exit”. Veronica is thrilled by their story, saying that it will all be about Dan, but he instead tells her that the story should be all about his friends too, saying that when they’re together, they have fun, which she agrees to edit.\n|LineColor        = 3198FF\n}}\n(US)January 19, 2019 (CAN)\n| AltDate         = May 13, 2019\n| Viewers         = 0.38\n| ShortSummary    = The AO discover that “The Exits” videos are way better than theirs and decide to do the same, but end up copying them instead. They see a video where they have challenged them to a battle in an upcoming tournament hosted by Kravitz where they have begun to spread an unfair rule: the winner takes the loser's Bakugan. They have already collected everyone else’s, saddening them. The AO are determined to stop that rule from spreading. They advise Dan not to battle them just yet not wanting to risk losing their Bakugan. Dan waits outside, but seeing how sad every Brawler is for losing their Bakugan heads into the arena and decides to accept “The Exits” challenge. He brokers a deal with Aay where if he wins, he must give back everyone's Bakugan, but if Aay wins, he loses Drago. During the battle, Aay uses a device to control his Bakugan into fighting dirty while taunting Dan, saying that Bakugan should be used for money purposes, which Dan disagrees with. He and his team soon outnumber him, but before they can finish him off, the AO arrive and work together to defeat “The Exit,” which leaves Kravitz in shock, wondering how she will report this to Plilomena. Having won the battle, they return everyone's Bakugan to the people.\n|LineColor        = 3198FF\n}}\n(US)January 19, 2019 (CAN)\n| AltDate         = May 13, 2019\n| Viewers         = 0.38\n| ShortSummary    = The AO learn from the Bank that they have to buy the land where they have built their Bakugan field on. Unable to come up with the money, Everett suggests that they join his Bakugan League, an event where people are charged admission to come watch battles, with him as the manager, and the AO as the stars. They disagree with his idea, thinking that it’s wrong. China Riot also agrees with the league, persuading them to join, to no avail. A battle is soon initiated between her and Dan which Everett records. Later, they learn that the city has banned all Bakugan, following the destructive battle, and they also learn that Everett edited it to expose Dan’s bad side (which he does not have). With no other option, Lia contacts Everett and agrees that they will join his league, much to everyone’s shock. Everett is glad that they have made a snap decision and reveals the match to be a presentation for the Bank. Dan battles Riot where she resorts to cheating, but he still defeats her, leaving the people to disown Everett for the match. The AO decide not to support him, and Dan announces to everyone that Bakugan should never be used for money purposes, persuading everyone to support them. Much to their surprise, donations start pouring in fast as everyone agrees with Dan, and the land is officially bought by the AO despite Riot attempting to buy the land as well. Their victory is witnessed by the man they met earlier, believing that they're going to help make all of his dreams come true, which they don’t know about yet.\n|LineColor        = 3198FF\n}}\n(US)January 26, 2019 (CAN)\n| AltDate = May 20, 2019\n| Viewers         = 0.38\n| ShortSummary    = Wynton is heading back to Studio D on his birthday, unaware that he's being monitored by Col. Armstrong Tripp, an army general who is seeking their Bakugan (mostly Dragonoid). Arriving, he overhears their plan to prank him as part of their surprise and he eventually runs off. Dan goes to find Wynton and locates him in a field, having overheard their surprise plan. He soon hears a familiar sound and finds another Bakugan who introduces himself as Lupitheon. Hoping to get to know him better, Drago and Trox battle him as they see him in action, proving to be a very fast Bakugan. He is soon defeated by them, but he is impressed by their teamwork and soon asks them to let him rest. Tripp arrives and throws 2 B-mines at Trox and Drago, putting them under his control. Determined to get their Bakugan back, they are left with no choice but to battle them. Lupitheon’s power increases as he releases his true potential, following the light of the moon, and Wynton realizes that he’s a werewolf type Bakugan. Tripp throws another B-mine, hoping to gain control of Lupitheon, but he begins to resist it. Taking a big risk, Wynton gives him a Bakucore, giving him the strength needed to destroy the B-mine on him, and free the others, causing Tripp to retreat. Heading back to Studio D, Dan and Wynton find Lia, Shun and Lightning already asleep, having waited for a long time. Wynton says that this was the best birthday he’s ever had.\n|LineColor        = 3198FF\n}}\n(US)January 26, 2019 (CAN)\n| AltDate = May 20, 2019\n| Viewers         = 0.38\n| ShortSummary    = Dan begins to act rudely towards everyone, much to their shock. He starts to anger Lightning, thinking that he shouldn’t be on the team, much to their suspicions. Determined to find out why Dan is acting like this, Lightning follows him and heads inside a vent. There, he eavesdrops on him having a conversation with Kravitz and is shocked to discover the real Dan enjoying a virtual reality game, finding out that the imposter is actually Magnus, having impersonated Dan as part of their plan to break up the AO. Lightning tries to get the real Dan’s attention, but he’s too distracted by the game and returns to tell the others about the scheme. Meanwhile, Lia is set up by a prank, thinking that it was from Wynton which he denies. Then Shun accuses Lia of putting videos of him online to which Lia also denies. Wynton’s pie throwing machine is destroyed and blames Shun for it. Soon the AO begin to quarrel over each other, unaware that they have been set up. Dan thinks that they should break up the team until Lightning arrives, attempting to tell the others about what he has seen. They misunderstand him and think they should have a Bakugan battle, and proceed to do so. Before they begin, they become suspicious of Dans behavior, suggesting he be positive. He refuses and summons Nillious and, much to their shock reveals himself as Magnus, thus exposing his plan to break up the AO. They soon realize he was the one that set them up all along. Kravitz finds out that Magnus exposed himself, ruining the plan in the process, much to her shock. They fight Magnus with their combined teamwork, but it is still not enough to defeat him. Kravitz activates a device that returns Nillious to ball form, knowing that he brought them all together instead of breaking them up, then issues a retreat. Magnus vows revenge. Dan soon returns, telling them of his virtual reality experiences, to which they are glad to have him back, especially with his old self.\n|LineColor        = 3198FF\n}}\n(US)February 2, 2019 (CAN)\n| AltDate = May 27, 2019\n| Viewers         = 0.35\n| ShortSummary    = Dan and Wynton arrive at the Dane Mansion where the Dane parents are happy to see them, hoping that they can teach their son Duran the basics of Bakugan battling. Duran shows up and leads them into a secret passageway which disappears behind them. They are shocked to discover this place under the house but also find Duran missing. They are soon forced to evade many obstacles with help from their Bakugan who have come out by themselves (something totally different). Drago begins to feel something familiar about this place, but Dan can’t point out what it is. Duran shows up to battle them, leaving their Bakugan to battle without them. A giant rock is about to crush them until Duran’s Bakugan Nobillious saves them before being crushed himself. Dan and Wynton find a way out and are determined to escape. Drago confronts Nobillious as he explains that he doesn’t want to hurt humans, but has no choice but to follow Durans orders. He soon tells him to leave and never return. Dan and Wynton manage to make it out from below, but are shocked to discover that the hole has disappeared. They return to the Dane mansion, only to find it completely abandoned. They learn from a groundskeeper that the house has remained vacant for years, much to their shock. The Dane family meet up with the man who rewards them for their part in his plan. Duran begins to question him about the place below, but he refuses to reveal those secrets to him. He learns that Wynton and Dan risked their lives in order to save their Bakugan, doing what he expected them to do.\n|LineColor        = 3198FF\n}}\n(US)February 2, 2019 (CAN)\n| AltDate = May 27, 2019\n| Viewers         = 0.35\n| ShortSummary    = The AO discover a field of goo where many kids have come to search for new Bakugan. It turns out that they return to ball form after a few seconds. Checking it out, Lia witnesses a gold Bakugan asking for help from her. It leads her to a huge garbage pile, having been dumped there illegally before seeing that Bakugan again. Lia tells everyone that the goo was caused by the pollution from the garbage, which is why the Bakugan revert to their ball forms quickly because they don’t have enough energy, including the Golden Bakugan that she saw earlier. Soon the AO’s Bakugan become obsessed with battling for no reason. As they battle, it attracts the kids' attention who become upset by it. The AO begin to witness the Bakugan sinking into the goo, then disappearing due to the battle. The kids tell them to stop what they’re doing, but Lia tells them that the Bakugan are just sick and the only way they can get better is by sending them back to where they came from. Everyone agrees and unleashes their Bakugan to join the battle. Lia begins to suspect that they’re releasing their power into the Drome. Shun says that it is a ritual, revealing its history, saying that they are offerings to appease the gods. The Drome starts to get bigger until it shatters, restoring the field. With everything back to normal, they reveal the garbage flow to the media, and become determined to find the people responsible for this. No one has any clue of how this happened in the first place as Lia begins to wonder about that Golden Bakugan she saw earlier.\n|LineColor        = 3198FF\n}}\n(US)February 9, 2019 (CAN)\n| AltDate = June 3, 2019\n| Viewers         = 0.33\n| ShortSummary    = Magnus undergoes rigorous training, determined to defeat Dan. Philomena believes he is ready to face him and undergoes a power up which proves to be unstable, but Magnus goes through with it anyway. Emily, who is sick, decides to seek out Dan for help. Meanwhile, Dan tells Drago the importance of family until they meet Emily who tries to talk Dan out of battling “him,” referring to Magnus. Dan finds out she’s sick and goes to get her some water, but she has disappeared somehow. Magnus confronts him and challenges him to a battle. Dan accepts, and he unleashes his new power. To his shock, he evolves Nillious to his first evolution known as Hyper Nillious. Drago is unable to defeat him because of his new power level as he’s invulnerable to his abilities and is defeated soon afterwards. Magnus becomes seriously injured following the use of his new power. Emily soon shows up, knowing what would happen to him if Dan ever battled him, and he is shocked to discover that she is Magnus’s younger sister. She falls seriously ill and Magnus returns her to AAAnimus to get treatment. Philomena learns about his victory and congratulates him.\n|LineColor        = 3198FF\n}}\n(US)February 9, 2019 (CAN)\n| AltDate = June 3, 2019\n| Viewers         = 0.33\n| ShortSummary    = The AO discover a video of an army unit capturing a Bakugan, but can’t figure out who sent them the video. Wynton does a little transcribing and constructs a set of coordinates that will lead them to where they need to go, which is in the forest. They decide to go anyway, knowing that the Bakugan is in danger. Arriving at the location late at night, they discover a huge door. They follow Lightning inside where they discover a large facility. They run into a security robot who begins to chase them, but manage to escape it. More show up, but Shun holds them off while the others free the Bakugan. Pegatrix revives it, but soon Colonel Tripp shows up and takes control of the Bakugan known as Pandoxx. Tripp reveals that he has no knowledge of this facility and attempts to steal him away, only for Pandoxx to be pinned down by the other Bakugan. He reveals that he let the soldiers capture him in order for the AO to lead him to this facility where Bakugan were once held prisoner there before they were moved to another place. He snuck in, getting past the security which they tipped off. They soon realize that he was the one who sent them the video in the first place, knowing that they would come for it anyway. He explains that the facility was used to develop controlling devices for Bakugan owned by Dusk, which the thugs like Aay used to control their Bakugan. The AO soon become distracted by his men while Tripp escapes with Pandoxx and initiates a self-destruct sequence on the facility. They escape the facility unharmed and begin wondering what is really going on here.\n|LineColor        = 3198FF\n}}\n(US)February 16, 2019 (CAN)\n| AltDate = June 10, 2019\n| Viewers         = 0.31\n| ShortSummary    = Shun is trying to escape his family's bodyguards led by Toshi, knowing that they’re here to take him back to Japan. After escaping, Shun doesn’t know where else to go, so Dan suggests that he stay at Wyntons house which he does, and his family begins to take a liking to him. The next day, Shun runs into Toshi who asks him to come back with them to Japan. He refuses, saying that he wants to stay with his friends to build up his strength. Toshi challenges Shun to a battle in order to allow him to stay. During the battle, Toshi begins to believe that Shun needs him for his own protection, which he brushes off. His confidence and strength from his friends allow him to win the battle. Toshi and the others decide to return to Japan for now. Before they leave, he gives Shun Fade Ninja, thinking that he can be useful to him, much to his happiness. In the end, Wynton’s family decide to accept Shun into their family, leaving him forever grateful.\n|LineColor        = 3198FF\n}}\n(US)February 16, 2019 (CAN)\n| AltDate = June 10, 2019\n| Viewers         = 0.31\n| ShortSummary    = Shun is training with Fade Ninja and Dan is desperate to prove himself. Battling him, Drago runs out of power too quickly and the battle is put to an end, leaving Dan upset. Later, he is approached by Shargo Ronin, a samurai Brawler, having witnessed the battle himself. He begins to taunt him, thinking that he doesn’t have the strength and confidence needed to win future battles. Dan decides to challenge him, and Ronin accepts. Dan is nearly defeated until Shun intervenes and advises Dan to “pull himself together.” Dan admits that all he wanted was to be strong like Shun, but can’t seem to reach that point. He begs for his help to win the battle and Shun agrees. Seeing that his Bakugan are using the katana swords for defense, they come up with a strategy and disarm them, leaving Dan to finish him off. Shargo Ronin leaves, knowing that they’ll meet again soon. Dan thanks Shun for his help and Shun says to Dan that he’ll always be a leader to him, as long as he plans different strategies in different battles.\n|LineColor        = 3198FF\n}}\n(US)February 23, 2019 (CAN)\n| AltDate = June 17, 2019\n| Viewers         = 0.30\n| ShortSummary    = The AO are enjoying themselves until Shun is shocked by a visit from his father Ichiro Kazami. During a conversation, he tells Shun that he must return to Japan with him to help expand the Bakugan business, believing that his friends are an interference. They soon leave, planning to pick him up later, leaving Shun in despair. The AO learn about this and figure out a plan to convince his father to let him stay. They attempt to put on a performance with a fancy Japanese dinner, but fail. As Shun is about to leave for Japan, after saying goodbye to his friends, Colonel Tripp arrives, demanding he give him Hydorous after throwing 2 B-mines at Fangzor and Vicerox. Ichiro attempts to make an exchange deal where he will return the Bakugan that he has control of in exchange for Hydorous. Tripp is reluctant to make that exchange, but eventually agrees after Ichiro warns him that his company will most likely target him as an enemy if he doesn’t comply. Ichiro forces Shun to give Tripp his Bakugan, but he refuses and pushes him aside, initiating a battle. Shun convinces his father that Bakugan are friends, and not just things, something that the AO taught him. Tripp, deciding to take Hydorous by force pits the Bakugan against him. Dan and the others defend Shun and the Kazami’s and pull off a powerful attack, defeating and rescuing the corrupt Bakugan after which Tripp retreats. As they are about to leave, Shun begs his father to let him stay, and he eventually allows him to do so, having proved his strength today. Toshi gives him Vicerox who will support him, much to his happiness. Ichiro reveals that he’s allowing Shun to stay with his friends in order to discover the secrets behind Bakugan, knowing that his profits always come first before anything else. The AO are then thrilled that Shun is officially staying with them.\n|LineColor        = 3198FF\n}}\n(US)February 23, 2019 (CAN)\n| AltDate = June 17, 2019\n| Viewers         = 0.30\n| ShortSummary    = While everyone is asleep, Drago is awakened by a familiar presence and discovers all of the Bakugan rolling somewhere and decides to follow them. He first wakes up Trox, then the others, and is determined to find out what's going on. They spot a gold Bakugan, assuming that they are following her. They head to the site of the “Great Collision” where it creates a DNA strand after which they are caught into it. They are soon teleported to an unknown place where they discover an evil entity which they battle. The entity is powerful, proving no match for the Bakugan, setting off an energy explosion. Trying to find a way to defeat it, the Golden Bakugan appears and reveals a way to defeat it, but it will put them in a deep sleep. Drago decides to take that chance and a huge amount of energy is released. Drago wakes up the next morning, beginning to believe that it was all a dream. He realizes that the dream was a message, and that he needs to build up his strength, much to Dans shock.\n|LineColor        = 3198FF\n}}\n(US)March 2, 2019 (CAN)\n| AltDate = June 24, 2019\n| Viewers         = 0.39\n| ShortSummary    = Dan is teaching young kids some lessons on Bakugan battling until they are interrupted by a Brawler named Kurin who believes that listening to important lessons is a waste of time. He taunts Dan into battling him, thinking that he’s afraid. Dan does so, but Kurin ends the battle quickly before walking off, leaving him paranoid. Following the battle, Wynton learns that Dan did fight well, but Kurin predicted his every move during that time. Drago sees a flash of light in the video and they return to investigate. They find a camera and other spy equipment, and they soon learn that Kurin has been spying on them this whole time. Planning to expose him, they follow him to a house that's right next to Dan’s. Lia sends Lighting inside and they find a team working for him. They are soon found and a battle begins. Kurins team guides him, giving him the upper hand, having collected data on them, leaving the AO at near defeat. Lightning intervenes and disrupts their connection, giving them the time to recover and pull off a counter attack. They defeat Kurin, with Dan reminding him that the only way to win a battle is to listen to your Bakugan. The AO confront Kurin, demanding that he tell them everything, but he refuses and runs into the house as they give chase. Kurin flees with the data into a portal, the same one Dan and Wynton first entered during their visit at the Dane Mansion. Heading back out, they meet the same man they met before who offers to tell them everything about what's going on here. Part 2: The man, revealed to be Benton Dusk, a famous multi tech millionaire who has been studying and researching Bakugan for a long time takes the AO to Dusk Industries where he works. There, he informs them about their recent activities spreading the word about Bakugan everywhere that got the attention of other Brawlers, governments, and businesses because Dan was the first person to introduce Bakugan to the world. He explains the origin of the Bakugan following the “Great Collision,” and what researchers are trying to do with obtaining the same power kids have, as well as the existence of AAAnimus, a business empire run by Philomena Dusk, including the people that they encountered before trying to put their Bakugan in danger, revealed to be agents working for the organization, and who have been collecting data on them for a long time. They plan to erase the data so it can no longer be used for evil purposes. He shows them a gateway into the maze, a tunnel area under the surface that will lead them to where the agents are hiding out. After further discussion among the team, they decide to go with Benton. They head into an entrance in their hideout where Benton instructs them to battle the agents while he goes to erase the data. They soon find out that the hideout is actually the Dane Mansion as they run into Kurin and his agents. Battling them, he gains the upper hand at first, but the AO, not wanting to fall for the same tricks again, change things up and defeat Kurin once again. Benton arrives, having erased all of the data on them and orders him and his agents to surrender. Philomena soon appears and Benton reveals that she’s the leader of AAAnimus, and also his sister. Philomena vows revenge and is determined to take the AO’s Bakugan no matter what before disappearing. They soon discover that Kurin and the agents have also disappeared as well, but it doesn’t matter, because the data they have collected is gone for good. Benton hopes that they will continue to help him fight AAAnimus, and the AO agree to work with him for the sake of all Bakugan.\n|LineColor        = 3198FF\n}}\n(US)March 9, 2019 (CAN)\n| AltDate = July 8, 2019\n| Viewers         = 0.34\n| ShortSummary    = The AO arrive at Dusk Industries, having been sent by Benton. He informs them about a Bakugan named Phaedrus who escaped a prison in the maze, and that her friends are still trapped there. They decide to rescue them and vow to be at her side during the journey. Before entering, Benton warns them that if they become separated from her, they won’t be able to find their way out. Entering the maze, the Bakugan begin to have a strange feeling about this place, wondering what it is. They manage to locate the imprisoned Bakugan and encounter Strata who has captured them, and demands that they hand over their Bakugan as well. Battling him, he gains the upper hand, having mastered the effects of the maze, proving no match for him. Lightning uses his sense of smell to locate Strata, and Pheadrus pulls off an attack, trapping him and his Bakugan until a pile of rocks. They free the Bakugan and escape through the portal. Strata follows them, forcing Dan and the others to stay behind to fend him off. His attack causes them to fall deeper into the maze, which leaves them completely lost.\n|LineColor        = 3198FF\n}}\n(US)March 9, 2019 (CAN)\n| AltDate = July 8, 2019\n| Viewers         = 0.34\n| ShortSummary    = The AO become trapped in the maze after being separated from Lightning and Phaedrus. Drago begins to lead them someplace, thinking that it's the way out. After dodging various obstacles, they start to become worried that they’ll never find their way out. Drago says that he has a sense of where they need to go in the maze and decides to guide them through. The AO head into an unknown area where the laws of gravity have been altered. They soon come across Strata trying to find a way out. Interrogating him, Strata says that he doesn’t have any clue on how to escape the maze, until they are attacked by an evil Bakugan entity, causing him to flee. The Bakugan are left to deal with it, but their attacks don’t work as they are powerless here. Wondering what to do, Dan races towards a Bakucore with the others following behind despite Drago pleading with them not to. Dan grabs it, but can’t reach Drago as he is too far. The AO use the gravity and power up their Bakugan to defeat the entity as it disappears. A strange looking evil Bakugan watches on, planning to destroy them, thinking that they’ll get in his way of something he’s after.\n|LineColor        = 3198FF\n}}\n(US)March 23, 2019 (CAN)\n| AltDate = July 15, 2019\n| Viewers         = 0.33\n| ShortSummary    = The AO travel into a jungle themed world of the maze while their Bakugan scout the area. Returning, they discover that they have been transformed into little kids, and they are eventually forced to play along with their shenanigans. An evil Bakugan entity shows up, and, determined to get their partners to safety, they have them float down the river as part of a “game.” During the fight, the Bakugan discover a Bakugan hiding under that black ooze that’s taking control of it on the inside, much to their shock. The AO manage to reach the end of the river as the Bakugan rendezvous with them. They find a portal leading out, but are soon intercepted by a powerful evil Bakugan who tries to stop them, wounding Drago in the process. They manage to escape with Drago barely making it. The AO soon wake up, having returned to normal, thinking it was all a dream, but their Bakugan reveal that it wasn’t, much to their shock before continuing on with their journey.\n|LineColor        = 3198FF\n}}\n(US)March 23, 2019 (CAN)\n| AltDate = July 15, 2019\n| Viewers         = 0.33\n| ShortSummary    = The AO travel into another area of the maze, thinking that it's the way out. Turns out, it is as they are back in Los Volmos. However, later on, they are forced to regroup when they encounter their counterparts with opposite personalities compared to their own, and realize that they have not found the way out. The mirror AO reveal that they have created an illusion of Los Volmos and plan to take their place in their world. Shun says that their feelings have resulted in the creation of this illusion, and reveals that they’re the only ones who can erase it from existence by putting their belief in themselves. They defeat their copies with the belief they have and escape. The effects of the maze begin messing with them with Drago explaining that their getting close to something powerful and are determined to find it. The Golden Bakugan watches on as it follows them, believing that their heading towards the power their searching for.\n|LineColor        = 3198FF\n}}\n(US)March 30, 2019 (CAN)\n| AltDate = July 22, 2019\n| Viewers         = 0.27\n| ShortSummary    = The AO head into an area, thinking that “it’s” nearby. The Bakugan scout the area, then return to find their partners asleep, doing the same. Drago is soon awakened by a familiar presence and finds the other Bakugan rolling into a secret passageway, with him following. He finds the “Bakuzon” (a name Dan came up with for the powerful evil Bakugan earlier) trying to get inside a strange looking place. Thinking that the power source is inside there, Drago is determined to stop him. However, the Bakuzon uses his black ooze that corrupts most of the Bakugan, leaving Drago, Gorthion, Lupitheon, and Vicerox standing to hold them off. The AO wake up and discover their Bakugan missing, prompting them to go searching for them. They locate them, but can’t get down to help them, until the Golden Bakugan secretly helps them, as well as summoning Bakucores. However, they have no effect on the corrupt Bakugan. Drago is held captive by the Bakuzon, intending to corrupt him too, until a Golden Bakucore appears in front of Dan. He uses it to power up Drago and wounds him, freeing all of the Bakugan in the process. The Bakuzon soon flees to recover. The Bakugan head straight for the place and discover a mysterious power source right in front of them, with the AO wondering what it is.\n|LineColor        = 3198FF\n}}\n(US)March 30, 2019 (CAN)\n| AltDate = July 22, 2019\n| Viewers         = 0.27\n| ShortSummary    = The AO and their Bakugan examine the power source called the Core Cell which called to them as they listen to strange messages, but are unable to understand its meaning. They begin to suspect that the Core Cell has a connection with Bakugan. They are soon attacked by a group of Bakuzon, and the Bakugan are determined to protect the Core Cell. However, they have a disadvantage as they destroy nearby Bakucores. The evil Bakuzon wounds Drago until the Core Cell calls to him as it opens up a portal, wanting him to go inside. Dan joins him as they head in, followed by the Bakuzon as he holds the portal open long enough for him to get inside. Inside the Core Cell, Dan and Drago see many balls of light as they heal his wound. Just then, the Bakuzon appears, trying to destroy Drago. Wondering what to do, Dan soon realizes that he needs to use the light of the Core Cell to power up. He tells Drago about this, and he begins absorbing the light, allowing him to evolve into Hyper Dragonoid. Drago regains some of his memories and recognizes the Bakuzon as Tiko, an old enemy of the Bakugan. Using his new power, he defeats Tiko, vanquishing him for good, unaware that it’s causing some friction above the surface. Reuniting with the others, the AO deduce that Tiko was after the Core Cell to get more power, but he’s no longer a problem as the mission is complete. The Golden Bakugan appears and thanks them for their help with protecting the Core Cell. She then opens up a portal that will take them home and they head through it, knowing that their adventure in the maze is finally over.\n|LineColor        = 3198FF\n}}\n(US)April 6, 2019 (CAN)\n| AltDate = July 29, 2019\n| Viewers         = 0.31\n| ShortSummary    = Lightning and Phaedrus return with the captured Bakugan, and Benton learns that they got separated from the others. After he leaves to go search for a way to get them out, Strata escapes from the maze, reclaims the Bakugan that were rescued, and initiates a battle with Lightning, resulting in Howlkor being defeated. The AO make it through the portal provided by the Golden Bakugan as it collapses behind them, and find Lightning outmatched. They go up against Strata as they explain their adventures in the maze, having had their knowledge increased. They defeat Strata, but before he can escape, Phaedrus forces him to release the Bakugan he stole, and he vows to return for them. The AO soon become shocked after discovering that no time has passed since their return, following the destruction of the gate. With their mission complete, they rest up for now.\n|LineColor        = 3198FF\n}}\n(US)April 6, 2019 (CAN)\n| AltDate = July 29, 2019\n| Viewers         = 0.31\n| ShortSummary    = The AO are glad to be back home, following their adventure in the maze. They are about to relax until they discover a Bakugan hiding in Lia’s hair. Phaedrus reveals that his name is Cubbo who was one of the Bakugan prisoners back in the maze and must have found a way to escape. Cubbo is revealed to have a lazy and annoying attitude, leading them to figure out what to do with him. They challenge him to a battle, which doesn’t last as Cubbo begins to taunt Dan about being told what to do like all partners. He sarcastically leaves, making Lia think about what he’s going through right now. They follow him to the park where the Rowdy Reds are playing as they witness him staging an act in front of them. They decide to battle him, this time, Cubbo puts up an actual fight using cheap moves despite his size. After that, Cubbo tells them that he doesn’t need a partner, having overheard their conversation earlier, thinking that they’ll just order him around. Lia soon realizes that he’s just lonely, which is why he followed them home because he likes them, and vows to stay with him. She decides to make the best of Cubbo and becomes his partner.\n|LineColor        = 3198FF\n}}\n(US)April 13, 2019 (CAN)\n| AltDate = August 5, 2019\n| Viewers         = 0.29\n| ShortSummary    = Marco and his friends challenge Dan to a battle, but he says he’s moved on since their power levels are different. Dan is forced to anyway and tries to evolve Drago, to no avail. He is forced to summon Cyndeous to defeat their Bakugan instead. The AO begin to wonder why Drago couldn’t evolve in the first place. Dan reveals to everyone that Magnus used a device to evolve Nillious into Hyper Nillious during their last battle. They become angry with him for keeping this from them, but soon learn that they can find a way to evolve their Bakugan by drawing energy from the Core Cell. At the arena, they attempt to do so for a long time, to no avail. Meanwhile, Masato, a newcomer in town finds Marco and asks him to take him to the AO, whom he despises. Arriving, they learn that Masato is Shun's cousin from home. Masato says that he's here to take Shun back to Japan, having learned of his adventures in the maze, his interaction with the Core Cell, and Drago’s evolution, which is exactly what he needs for the Kazami’s plans to come into motion. Shun says that his father gave him permission to stay, but he reveals that things have changed since then, having been given full authority to speak on the Kazami’s behalf. He fights back against Masato, but he is too strong for him as he continues to taunt him about his role in the Kazami Family. He easily defeats Shun and gives him until tomorrow to figure out his decision, leaving him completely upset.\n|LineColor        = 3198FF\n}}\n(US)April 13, 2019 (CAN)\n| AltDate = August 5, 2019\n| Viewers         = 0.29\n| ShortSummary    = The AO learn that Shun is going back to Japan which he does not want to do. He contacted his father earlier where he reveals that he only allowed him to stay in Los Volmos so that he could discover the secrets behind Bakugan, which is why he sent Masato to retrieve him, having accomplished his goals. He warns him that if he refuses to return, not only will he be cut off, but he will no longer have any relation to him or the Kazami family. Determined to get their Bakugan to evolve, the AO visit Benton who doesn’t know how to draw energy from the Core Cell. Wondering how Masato found out about their adventures, Shun reveals that he has been emailing his father about what he has been doing with his friends since then. They eventually forgive him. Benton says that the only way to evolve is if one is determined to grow, and puts his belief in them. The AO continue attempting to evolve their Bakugan on the beach, leaving Shun to make a hard choice because he doesn’t want to go against his family's decision. The next morning, Masato arrives, still wondering about Shun’s decision. Since he hasn’t made up his mind yet, he’s thrust into a battle. The others arrive to help, only to be intercepted by Toshi and the other bodyguards who use a technique to imprison them as ordered by President Kazami to keep them from helping Shun. Serpenteze defeats Fade Ninja and Vicerox, leaving Hydorous as the only one standing as Masato continues to taunt Shun, revealing that he plans to defeat him and take his place as the rightful heir of the Kazami’s. Dan and the others stand up to Masato, saying that they care about Shun more than his family and business. Shun begins to realize that his friends and Bakugan are very important to him. Making the ultimate decision, he chooses to sever all ties with his father and the Kazami’s. As a result, he unleashes his true courage by drawing energy from the Core Cell, and successfully evolves Hydorous into Hyper Hydorous, defeating Serpenteze in the process. Masato, having witnessed the power of Hydorous evolved leaves for Japan to report everything to Ichiro, including his betrayal. Shun attempts to contact his father, but he doesn’t answer, having learned of his betrayal. He allows Lia to upload the video of Hydorous evolving, knowing that this is the path he has chosen. They vow to stick together and spread the word about the Bakugan’s potential.\n|LineColor        = 3198FF\n}}\n(US)April 20, 2019 (CAN)\n| AltDate = August 12, 2019\n| Viewers         = 0.42\n| ShortSummary    = Lia develops an obsession with her video making skills, wanting them to be perfect, much to her friends shock and dissatisfaction. Pegatrix tries to talk Lia into finding her own way to tap into the Core Cell energy, but Lia dismisses her. It is revealed that Lia has video footage of her late father who was advising her to not give up and try again when she first rode her bike as a little kid. Meanwhile, China Riot is desperate to know how to evolve her Bakugan, having watched the AO’s video. She believes it is not enough and decides to steal Lia’s video footage, hoping she’ll find other videos that will show her how to properly evolve a Bakugan. The next day, Lia discovers her room ransacked and her video footage gone. She finds out that Riot stole them and goes to confront her. Upon arrival, she sees her footage being destroyed as her servants search for the video. Furious, she challenges her to a battle, determined to get back at her for destroying her video footage. Pegatrix tries to tell Lia not to let anger blind her, but she refuses to listen. Soon she gives in and starts crying, saying that her videos have held a lot of precious memories over the years, including the ones of her father. Pegatrix assures her that her father will always be with her, from within. Soon Lia has a vision of her memory of her father, and realizes that her memories were with her all along, and as long as they’re in her mind, she’ll be okay. This gives her the confidence needed to evolve Pegatrix into Hyper Pegatrix where she easily defeats Riot. In the aftermath, Lia finally gets over her video obsession after telling her friends about it, and they continue to make more videos.\n|LineColor        = 3198FF\n}}\n(US)April 20, 2019 (CAN)\n| AltDate = August 12, 2019\n| Viewers         = 0.42\n| ShortSummary    = Dan begins to develop an obsession with evolving Drago by trying many times to draw energy from the Core Cell, leaving Drago annoyed. He first makes a video to prove it, but it soon turns out to be a fake. Duran shows up, revealing that he was hired to trap Dan and Wynton in the maze, but doesn’t reveal who hired him. He challenges him to a battle which Dan accepts, hoping to get Drago to evolve. During the battle, Duran and Nobillious begin to act in fear, much to Dan’s confusion, until he reveals that they were only pretending; it was part of their plan to cause him to lower his guard. Dan realizes what he has done and regains his focus in the process, defeating Duran. Dan apologizes to Drago for lying and Drago forgives him, finally putting their differences aside. Duran soon reveals that Benton was the one that hired him to trap them inside the maze from the start. This leads the AO to figure out why Benton would do something like this to begin with.\n|LineColor        = 3198FF\n}}\n(US)April 27, 2019 (CAN)\n| AltDate = August 19, 2019\n| Viewers         = 0.28\n| ShortSummary    = Dan continues to try and evolve Drago, to no avail. Wynton arrives and shows the AO an invention he made called the Core Cell Capturer which will allow them to locate the Core Cell, hoping to draw out its power. Dan decides to tag along with him in hopes of getting his Bakugan to evolve. As they head to the location, Dan, impatient starts messing with it, setting off an energy impulse which Colonel Tripp tracks. Wynton becomes furious with what he has nearly done to the Capturer. They pick up a reading and head to the location, which is on a big hill. They start quarreling over who gets to evolve their Bakugan first until Tripp arrives, seeking the power for himself. Wynton soon realizes that Dan was responsible for leading them here and becomes angry with him. With no other option, he uses the Core Cell Capturer to tap into the Core Cell and evolves Trox, defeating Pandoxx in the process, much to Tripps shock, which also attracts the attention of all the researchers and scientists at AAAnimus. Tripp is shocked by what he has witnessed, thinking about what to do next before retreating. Dan attempts to get the Capturer to work, but ends up breaking it, resulting in an argument between him and Wynton.\n|LineColor        = 3198FF\n}}\n(US)April 27, 2019 (CAN)\n| AltDate = August 19, 2019\n| Viewers         = 0.28\n| ShortSummary    = Dan falls into an angry depression following his argument with Wynton, leaving the others worried about him. Meanwhile back at home, Wynton tries to repair the Core Cell Capturer, but fails. He starts to feel bad about his argument with Dan and heads to Studio D to apologize. He soon runs into Colonel Tripp and tries to flee, but Tripp throws a B-mine at him and puts him under his control, ordering him to show the world just how dangerous Bakugan can be as part of his plan to ignite a war between humans and Bakugan. The mind-controlled Wynton unleashes Lupitheon to cause damage in the city just as the army arrives. Tripps men arrive at Studio D in an attempt to round up the other members of the AO, but Dan escapes to go after Wynton. He runs into Tripp who attempts to show him that this is what Bakugan are really like. However, he refuses to believe this outcome and continues to pursue Wynton, leaving them out in the open. Drago instructs Dan to get through to him while he holds off Lupitheon, but is soon defeated. The army shows up as Dan apologizes to Wynton, saying that he got competitive about wanting to evolve his Bakugan first. Wynton begins to resist the effects of the B-mine after realizing what has transpired here that led to their argument in the first place and pulls it off of himself, finally over the Core Cell Capturer. However, Lupitheon still continues to run rampant, but he summons Trox, successfully evolves him into Hyper Trox, having begun to cherish his true friendship with Dan, and defeats him. A soldier discovers the B-mine and Tripps plan is exposed. He and his men are soon arrested as he swears revenge on them sooner or later. Dan and Wynton rekindle their friendship where the latter says that he’ll have his chance at evolving his Bakugan soon.\n|LineColor        = 3198FF\n}}\n(US)May 4, 2019 (CAN)\n| AltDate = August 26, 2019\n| Viewers         = 0.28\n| ShortSummary    = The AO are worried about Dan, having fallen into a depression of not getting Drago to evolve. To his shock, he finds out that an Exit team has been formed, consisting of Magnus, China Riot, Kurin, Aay, and Strata performing good deeds for the city. He soon learns that they plan to stop a volcano from erupting, raising his suspicions that they are up to something. They decide to investigate despite Drago trying to convince him to call the others for help. Arriving, they head inside an opening into the volcano. There, they discover the team using devices to make it look like the volcano is about to erupt, learning that their good deeds have been staged all along as planned. Magnus discovers them, resulting in a battle. He learns that all of his friends have gotten their Bakugan to evolve and taunts him to do the same. Dan tries but fails, allowing Magnus to evolve Nillious into Hyper Nillious, barely defeating Drago. They escape the volcano as he activates the devices to erupt it. Dan and Drago escape the volcano and try to block the lava flow, but fail as the flow is too strong for them. Just as they are about to be left to their demise, Magnus saves them and has Nillious stop the erupting volcano, saving everyone in Los Volmos. The Exit team are rewarded by the mayor for their bravery, leaving the AO in deep dissatisfaction. They begin to ask Dan on why he didn’t call them before, but Dan says that he doesn’t know, revealing the volcano to have been staged, but has no evidence about it since it was destroyed. He is soon left struggling about his recent failure to evolve Drago.\n|LineColor        = 3198FF\n}}\n(US)May 4, 2019 (CAN)\n| AltDate = August 26, 2019\n| Viewers         = 0.28\n| ShortSummary    = Lightning explores Los Volmos with his Bakugan until they stumble upon the Core Cell excavation site. Hiding, they overhear Kravitz talking to Strata about their plan to extract the Core Cell for Philomena. After she leaves, Strata discovers them and initiates a battle with them as he doesn’t want Lightning to tell anyone about this place. He begins to taunt him over their last battle, this time defeating Phaedrus and Artulean, leaving only Howlkor standing. Howlkor begins to express Lightning’s loyalty to him, causing Strata to unleash Krakelios on him. Lightning intervenes, saying that he must protect him, no matter the cost. This allows him to evolve Howlkor, defeating Strata in the process as he flees, vowing revenge. They then celebrate their victory. As the AO (except Dan) leave Studio D, they find Lightning asleep and start to assume what life would be like as a dog.\n|LineColor        = 3198FF\n}}\n(US)May 11, 2019 (CAN)\n| AltDate = September 2, 2019\n| Viewers         = 0.24\n| ShortSummary    = The AO can’t stand the Exit Teams fame, knowing that their good deeds are fake. Lightning tries to tell them about AAAnimus’s plan, to no avail. Phaedrus tells them instead and they learn that they are planning to extract the Core Cell from the maze. They soon realize that they did all those stunts to distract everyone from the excavation site, and they are determined to stop them from taking the Core Cell. Arriving at the site, they discover the Exit team already there, led by Magnus who orders them to leave at first. However, the other members want revenge and a battle ensues. Dan is left hesitating, worried that he’ll lose, causing him to call back Drago early. His friends are left in shock as they find out that Dan doesn’t want to be a part of this team anymore, worried that he’ll hold them back. They remind him of everything that they’ve been through together lately and encourage him to have confidence and push forward. The AO gain the upper hand by evolving their Bakugan and pull off a combined attack, including the opposing team which also causes Magnus to call back his Bakugan early. This results in all the Bakugan being put in a hyper sleep, leaving Dan and Magnus as the only Brawlers left standing with power. With some encouragement, Dan decides to battle Magnus, initiating an ultimate battle.\n|LineColor        = 3198FF\n}}\n(US)May 11, 2019 (CAN)\n| AltDate = September 2, 2019\n| Viewers         = 0.24\n| ShortSummary    = Dan and Magnus are the last 2 Brawlers standing in the ultimate battle to determine the true winner. Magnus evolves Nillious into Hyper Nillous first and gains the upper hand. Dan encourages Drago to keep pushing forward despite the situation they're in. Drago reveals his reason on why he couldn’t evolve in the first place; his worries and insecurities have been holding him back, and Dan didn’t even notice, afraid of what might happen. Dan apologizes, giving Drago the confidence needed to stand up to Nillious. They vow to battle together which allows Dan to draw energy from the Core Cell where he successfully evolves Drago into Hyper Dragonoid, giving him the advantage. Drago’s evolution has proven to be too strong for Nillious to handle as he’s invulnerable to his attacks, and Nillious isn’t even strong enough to repel his abilities as well. In the climactic point where they draw energy to their Bakucores to determine the winner, a flashback about Magnus’s past is revealed: Years ago, he and his younger sister Emily have been living in poverty and were left struggling to survive out in the open, until they were found and taken in by AAAnimus. Magnus wanted to push himself forward as hard as he could for Emily, vowing to always succeed at everything. Dan says that as long as he’s with Drago, they’ll always be the strongest. Magnus fails to draw more energy as he powers up Nillious to pull off a final attack. Dan on the other hand manages to draw enough power for Drago, defeating Nillious, and emerging victorious, thus ending the ultimate battle. Magnus is left in defeat as the AO celebrate Dan’s ultimate victory.\n|LineColor        = 3198FF\n}}\n(US)May 18, 2019 (CAN)\n| AltDate = September 9, 2019\n| Viewers         = 0.27\n| ShortSummary    = The AO discover from a video that Philomena has announced that AAAnimus signed a contract with Los Volmos that will allow them to take control of the Core Cell. Wondering about what they should do, they think about talking to Benton about it, but are left with second thoughts after hearing about what Duran had said earlier, revealing that he was hired by him to trap Dan and Wynton inside the maze in the first place. They are soon visited by Kravitz who gives them an invitation to AAAnimus, asking for their presence by Philomena. Meeting with her, Philomena reveals that she wants to hire them to guard the Core Cell, having disbanded and fired the Exit team when they tried to steal it for themselves. She shows them their recent heroics when they saved Los Volmos from the weather satellite crashing down and reveals that it was caused by Benton Dusk, much to their shock, warning them to “be careful around that man.” Desperate for answers, they confront Benton, and he confirms that what he did to them is true, causing them to leave in distrust. Dan begins to express his hatred against Benton for doing those awful things to them after they agreed to work with him for the sake of all Bakugan. They are soon contacted by Kravitz asking for their help because the excavation site is under attack. Dan confronts the thugs, unaware that Tripp is one of them. The Core Cell calls to Dan, which allows him to evolve Drago and easily defeats them. After some thought, Dan decides to take up Philomena’s offer, much to everyone's shock. They eventually agree, seeing this as an opportunity to go undercover and find out what AAAnimus is planning to do with the Core Cell. Benton soon becomes upset when he learns that the AO are going over to Philomena’s side.\n|LineColor        = 3198FF\n}}\n(US)May 18, 2019 (CAN)\n| AltDate = September 9, 2019\n| Viewers         = 0.27\n| ShortSummary    = The AO are about to start their first day at AAAnimus. Kravitz gives them a tour of their facilities while they attempt to find information on their plans, to no avail. She then takes them to a studio where a video will be made about them while meeting their director. Not agreeing with his motives, the AO decide to have their Bakugan “audition” where they wreak havoc on the studio. In the aftermath, Kravitz brings them back to Philomena, believing that they will be fired for damaging the studio. Instead, Philomena is actually impressed with their performance, much to their shock. After that, the AO continue with their undercover mission to find out their true plan for the Core Cell. Meanwhile, Philomena enters a room where her Bakugan is being kept, hoping to use the Core Cell to power it up.\n|LineColor        = 3198FF\n}}\n(US)May 25, 2019 (CAN)\n| AltDate = September 16, 2019\n| Viewers         = 0.25\n| ShortSummary    = The AO are sent by Philomena to guard the Core Cell convoy team. They are soon intercepted by Masato and the family bodyguards who seek to take the Core Cell as ordered by Ichiro Kazami who is desperate to know everything about Bakugan evolution. A battle ensues in the air as the AO are determined to protect the Core Cell from them. Masato begins to question Dan on why he and his team are helping AAAnimus, revealing that they are being used, including Philomena’s intent on keeping the Core Cell for herself. Dan has no reason for doing this, but still resolves to protect the Core Cell from them. Masato gains the upper hand and is about to finish Dan and Drago off, but Dan takes a big risk and retrieves a Bakucore from the air, giving Drago the strength needed to finish off Serpenteze. Luckily, he is saved by Lia. Masato calls for a retreat, knowing that they failed to secure the Core Cell. Back at AAAnimus, Philomena congratulates them for completing their mission, then reveals that they plan to study and experiment on it in order to learn about its power. The AO begin to have suspicions of what AAAnimus is really up to with the Core Cell, but they still decide to continue to protect it.\n|LineColor        = 3198FF\n}}\n(US)May 25, 2019 (CAN)\n| AltDate = September 16, 2019\n| Viewers         = 0.25\n| ShortSummary    = The scientists and researchers at AAAnimus conduct experiments on the Core Cell, hoping to wake it up at first, to no avail. Meanwhile, the AO undergo tests which they shouldn’t do because they don’t want to hand over data to AAAnimus. They sneak away to find out where the Core Cell is being kept, only to be seen by Kravitz and chased by AAAnimus security personnel. Reaching a door, they are shocked to discover that the security cards they were given won’t give them access to that room, making them believe that the Core Cell is in there. The chase continues, but they manage to evade them and continue their search, only to run into more agents, unaware that one of them is Tripp. He initiates a battle with them, until the Core Cell starts to destabilize and corrupts the opposing Bakugan as they wreak havoc on the facilities. Trox lures them all together, and Drago defeats them. Even though Kravitz is pleased that the damages were only minor, she still punishes the AO for cheating out of their tests despite them trying to get answers on what is really going on here. Meanwhile, Philomena is satisfied that her Bakugan is once again stabilized, soon to be ready.\n|LineColor        = 3198FF\n}}\n(US)June 1, 2019 (CAN)\n| AltDate = September 23, 2019\n| Viewers         = 0.26\n| ShortSummary    = Experiments on the Core Cell continue as the scientists attempt to wake it up, to no avail, but a reaction is shown. Determined to complete the “system,” Philomena learns that the AO have a connection with the Core Cell and plans to use them to awaken it. Meanwhile, the AO return to their office, only to find plenty of gifts given to them by AAAnimus. The fun is soon interrupted when their Bakugan hear the Core Cell calling to them. Since the entrance is guarded, they use the vents to get inside. Once inside, they find the Core Cell shrieking in pain. It starts an activity spike all of a sudden, affecting their Bakugan as they start to go on a rampage. Realizing that the Core Cell caused all of this, the AO are determined to save their Bakugan. Philomena finds out about the incident, but is pleased when she is shown the data needed to activate the Core Cell and complete the system, once they find a way to control it. The AO manage to make their Bakugan stand still and resort to Dan where he uses his song to snap them out of their trance. However, the other Bakugan are still affected, but manage to defeat them. Philomena congratulates them for stopping the wild Bakugan, but the AO are skeptical and demand answers. She explains that she plans to use the Core Cell to create a peaceful world between humans and Bakugan. Although they are still confused by what has transpired here, they hope that this “perfect world” will become a reality eventually. With the data she now has on activating the Core Cell, and the AO’s Bakugan, Philomena begins to believe that she will no longer need them, now that she has everything needed to complete the system.\n|LineColor        = 3198FF\n}}\n(US)June 1, 2019 (CAN)\n| AltDate = September 23, 2019\n| Viewers         = 0.26\n| ShortSummary    = Philomena presents the Bakugan Control System (BCS) to everyone at AAAnimus, and the AO are thanked for their services. Once activated, they are completely shocked to discover the Bakugan being forced to work for AAAnimus due to the BCS. They confront Philomena for using them like this, but Philomena, realizing that she no longer has a use for them, having served their purpose has them thrown out of AAAnimus. They soon learn, much to their shock that Colonel Tripp has been working for her all this time, having been kicked out of the army. The AO summon their primary Bakugan in an attempt to get back inside and stop this, but the BCS puts them under the control of AAAnimus, forcing them to fight against them. Tripp uses the system to his advantage and evolves Drago, defeating their secondary Bakugan in the process. The AO are soon left in defeat, much to Philomena’s delight, now that she has finally obtained her goal, having used them all along. Back at Studio D, the AO vow to take back their Bakugan, no matter the cost.\n|LineColor        = 3198FF\n}}\n(US)June 8, 2019 (CAN)\n| AltDate = September 30, 2019\n| Viewers         = 0.26\n| ShortSummary    = The AO come up with different plans to get their primary Bakugan back, but they soon learn that they will all fail because they are still under the control of the BCS at AAAnimus. They are soon visited by Benton who wishes to redeem himself after learning about what had happened to them. He apologizes for the things he has done to them out of regret, explaining that he was only testing them because he needed their help to make his dream a reality; to create a peaceful world between humans and Bakugan by creating an open source system for the Core Cell energy. The whole point of this system is for the Core Cell energy to spread across the Earth’s surface so everyone can use it freely, meaning that no one could own the Core Cell alone. The Core Cell would then belong to everyone in the world. They plan to hack the BCS in order to turn the Core Cell into a transmitter, making it into an open source generator. Benton vows to help the AO get their Bakugan back in order to make up for his previous actions. After some thought, they decide to accept his help. They use a portal to sneak back inside the locked down facility. There, they split up as planned. The AO start to position all of the radar dishes at an exact angle, until they are eventually found and forced to battle their corrupt Bakugan, vowing to free them soon. Philomena learns about the intrusion and soon discovers the system being hacked, finding out that Benton is behind this and has already begun. Part 2: The AO, currently outmatched battle their corrupt Bakugan while Benton hacks the BCS, only to be intercepted by Philomena. Nevertheless, he continues to hack the system while fending her off. At one point, Dan manages to reach out to Drago, who hesitates to use his ability just as the system is successfully hacked, freeing all of the Bakugan in the process. As a last resort, Philomena summons her Bakugan Apollyon who, charged with Core Cell energy, easily takes out the AO’s secondary Bakugan. The AO use their primary Bakugan against him, but they prove to be no match for his power level as Benton watches the battle, saying that his own Bakugan will emerge soon. Drago tells Dan of how he used his emotions to reach out to him while he was still under the control of the BCS, which led to his hesitation in the first place. Using their courage and strong bond with their Bakugan, the AO pull off 1 combined attack, all in their evolved forms, defeating Apollyon at last. Following the defeat, a group of people from the Los Volmos City Auditor arrive and launch an investigation, following problems with AAAnimus’s Core Cell research activities. It is revealed that Benton summoned them, thus ending Philomena’s reign. News reports show that since AAAnimus violated their contract, their facility has been seized by the city, now under its authority. Following the release of the Core Cell energy, Benton reveals the locations of Core Cell energy signatures worldwide, and has decided to send the AO around the world on an important mission, prompting a whole new adventure for them.\n|LineColor        = 3198FF\n}}\n(US)September 1 2019 (CAN)\n| AltDate = October 14, 2019\n| Viewers         = 0.23\n| ShortSummary    = The AO travel in an airship provided by Benton around the world during their mission to set up all the Core Cells to become open source. They plan to use the connectors (provided by Benton) to set up a Core Cell each, then do the same for the other ones. Once they’re all set up, the Core Cells will then be connected by a network where the energy will spread and cover the entire world, meaning that everyone will be able to use Core Cell energy for free. Benton contacts them when they reach their first destination known as Maglie Island where a Core Cell signal is located. He explains that the connectors have a jamming function which have electromagnetic interference to keep anyone from detecting the signal, and also to keep them safely hidden. Landing on the island, they start to explore it for a while, then they begin their search using an improved version of the Core Cell Capturer that Wynton has. They believe that they can summon the Core Cell with a Bakugan battle. During the battle, they attract the attention of a young boy named Kino who lives on the island, having witnessed the battle for himself, and who also has a Bakugan of his own. After some lessons, Kino battles Dan for the first time using his Bakugan Kelion with great improvement. The battle is soon interrupted by Kino’s stubborn grandfather (who does not trust outsiders) who accuses the AO for damaging the island. Even though they fix the damage by lifting the Drome, he is still angry at them for their reckless actions and scolds Kino for befriending them. He orders them to leave the island at first, but Kino defends them and says they were only teaching him how to battle, and earning their friendship before storming off, not wanting to deal with his stubbornness. Kino tells them that his grandfather believes that all outsiders would come and destroy the island they live on, and mentions another one that their currently wrecking on, making him think their like them. Their conversation is soon interrupted by a couple of thugs who attempt to force them to give them their Bakugan. Dan challenges them where one of the thugs battles cluelessly and is defeated easily. He soon flees, abandoning his Bakugan Turtonium, whom Wynton takes in. The AO soon find out that Kino is missing before discovering his Bakugan Kelion, then they learn that he has been captured. They inform his grandfather where he reveals that the island has punished him for using his Bakugan recklessly. Believing that he doesn’t care about his grandson, the AO leave for the other island to rescue Kino.\n|LineColor        = 3198FF\n}}\n(US)September 1, 2019 (CAN)\n| AltDate = October 14, 2019\n| Viewers         = 0.23\n| ShortSummary    = The AO head to the other island where Kino has been taken to by the thugs. There, they witness them forcing humans to work in the mines, including Bakugan at their disposal. Dan distracts them by luring them away from the mine while the others sneak in to find Kino. There, they find him and the other refugees held captive, until they are confronted by the same thugs who force them to surrender. Dan defeats the thugs and contacts Wynton, only to find out that they have been captured. Confronting them, they force him to give them his Bakugan, having already captured his friends as well. Before Dan can do so, Kino's grandfather shows up and attacks them, giving the AO the upper hand, defeating the thugs and their Bakugan, and freeing everyone in the process. The thugs are soon arrested and brought off the island, and Kino thanks them for saving everyone. Dan even thanks his grandfather for coming for them, having been worried about Kino after all. He eventually begins to trust the AO more, after what they have accomplished here. Dan returns Kelion to Kino, but he allows the former to keep him instead, knowing that he would be better off with the AO in order to keep on battling. Back on the airship, they soon learn that the ore in the mine was the reason they picked up a Core Cell signal, meaning that there was never really a Core Cell there in the first place. It doesn’t really matter though, because they have helped the people on the island, and that’s what really matters as they fly away to their next destination.\n|LineColor        = 3198FF\n}}\n(US)September 8, 2019 (CAN)\n| AltDate = October 21, 2019\n| Viewers         = 0.19\n| ShortSummary    = The AO are invited to the Cool Movie Grand Prix, an event where internet stars from around the world gather together, which is held every year. Flying there, they learn that the event is being held in Brakkistan, a small country ruled by an all-powerful king who has control over the government. Around nighttime, the airship gets struck by lightning and is forced to make an emergency landing in the middle of a forest. The AO, finding out that they should wait for help to arrive decide to find a way to survive out in the open, with the help of their Bakugan of course. Later, they are confronted by a pack of wolves, so they summon their Bakugan to protect them, which proves to be hard due to their size difference. Luckily, Wynton uses an invention that he fixed up earlier to project special effects onto the Bakugan that scares the pack away. The next morning, they are found by Lord Brakken, king of Brakkistan.\n|LineColor        = 3198FF\n}}\n(US)September 8, 2019 (CAN)\n| AltDate = October 21, 2019\n| Viewers         = 0.19\n| ShortSummary    = The AO are welcomed by Brakken to his country where he reveals that he is a big fan of their work by showing them endorsements, including statues of them, having watched their videos. He even falls in love with Lia, much to everyone’s shock. After enjoying their day in Brakkistan, they ask him about the Core Cell their searching for, but he doesn’t know anything about it. When they ask him about the event, Brakken reveals that it was a fake in order to lure them to his country, hoping to meet them. He then challenges them to a battle, claiming that he never lost a single one. During the battle, it goes well for Dan, as for Brakken, he develops an obsession to win, not fully understanding how battles really go. Eventually, Dan defeats Brakken, leaving him humiliated. He suggests to him that he practice more so that he can be strong enough to face him again, with good focus, but he accuses his advice for insult and has him and his friends arrested. They manage to escape, causing Brakken to send Callous and his forces to recapture them.\n|LineColor        = 3198FF\n}}\n(US)September 15, 2019 (CAN)\n| AltDate = October 28, 2019\n| Viewers         = 0.20\n| ShortSummary    = The AO are on the run from Brakkens forces, following a misunderstanding. They attempt to disguise themselves in order to slip away undetected which works for a while, until Dan is accidentally exposed and the chase continues. They manage to evade them in a small area of the town. Lia discovers a gate leading into the maze and enters it, followed by Lightning while the rest of the AO are found and captured. Traveling inside the maze, they find a familiar light and try to reach it, only to fall back out to the surface. Dan and the others attempt to escape with their Bakugan, but Callous uses a device to steal them. Lia and Lightning soon appear until Brakken arrives and asks Lia to marry him. Lia reluctantly accepts, much to everyone's shock as they return to the palace.\n|LineColor        = 3198FF\n}}\n(US)September 15, 2019 (CAN)\n| AltDate = October 28, 2019\n| Viewers         = 0.20\n| ShortSummary    = Lia is getting ready for the wedding but declines; she only accepted the proposal as part of a ruse to return to the maze and find out about that light, which she already knows what it is. Meanwhile, Dan, Wynton, Shun, and Lightning attempt to sneak back into the palace to rescue Lia. Lightning makes it through, but the others are found, captured, and imprisoned. Lightning reunites with Lia and helps her dig a hole back into the maze where they locate and set up the Core Cell to become open source using the connectors, then they leave to rescue their friends. They manage to escape, but before Callous can steal their Bakugan again, Brakken arrives and decides to battle them in order to distract himself for a bit while he waits for Lia, unaware that she has escaped. The battle proves to be pointless as he cheats, using Bakutraps to trap their Bakugan, except Drago who struggles to keep himself in the air. Lia arrives and Brakken realizes she has lied to him. Lia makes a deal that she’ll marry him if he defeats her in battle using his own strength; Brakken agrees. During the battle, Lia reveals the reason behind his winnings, warning him that he won’t see the truth if he continues like this, but Brakken brushes her off. Lia finally defeats him after evolving Pegatrix, but instead of being infuriated, Brakken finally realizes the true meaning of a Bakugan battle and thanks Lia for showing him the truth. Although he still asks her to marry him, Lia reminds him of the deal they made and says that someday, he’ll beat her again. Brakken agrees, hoping to do so. Back on the airship, Lia shows everyone the Core Cell all set up, much to everyone’s delight, and they continue with their search in order to complete their mission.\n|LineColor        = 3198FF\n}}\n(US)September 22, 2019 (CAN)\n| AltDate = November 4, 2019\n| Viewers         = 0.17\n| ShortSummary    = Dan and Wynton make a video about their first success in making one of the Core Cells open source. Lia discovers this and tells them that they can’t show this to anyone because their mission is supposed to be “top secret”. They assure her that they didn’t reveal anything else, and that everything will be completely fine. Benton contacts the AO and congratulates them for setting up their first Core Cell. He rewards them with a short vacation at a hotel on the Yucatan Peninsula until he can pinpoint the location of the next Core Cell. The AO are eventually delighted and start to enjoy their vacation. Meanwhile back in Los Volmos, Magnus is living in a small condo with his sister Emily, having fallen into a deep depression following his loss to Dan. He thought he could succeed and rise to the top of AAAnimus, but failed to do so after his defeat. While watching a video from Dan and Wynton, much to his surprise, he discovers a Core Cell, indicating that there’s more than one out there. He leaves Emily alone for a while and starts searching for leads that eventually take him to Studio D. He learns that Dan and Benton Dusk are connected somehow and heads to Dusk Industries to retrieve the locations of the Core Cells. He unleashes Nillious to wreak havoc on the facility while he sneaks into the central database and downloads the map, but ends up getting a partial download, having run out of time before escaping. Benton contacts the AO, informing them of the theft and instructs them to begin their search for the Core Cell at their location at once. They learn that Magnus broke in and stole part of the map, and is already on his way to find the Core Cell.\n|LineColor        = 3198FF\n}}\n(US)September 22, 2019 (CAN)\n| AltDate = November 4, 2019\n| Viewers         = 0.17\n| ShortSummary    = The AO arrive at a Mayan Temple and begin their search for the gateway into the maze, with no luck whatsoever. Magnus spots them and decides to use them to lead him to the Core Cell. Approaching them, he offers them a gateway into the maze in exchange for passage with them. Although they are reluctant to lead Magnus to the Core Cell, Dan decides to take that chance, learning that there's no other way. Heading to the Core Cell, Dan begins to question Magnus about what he has been up to lately following the aftermath, which he brushes off angrily. Arriving at the place where Drago first evolved, they find the Core Cell, only to be intercepted by the Golden Bakugan who begins to act hostile towards them. Wanting the power for himself, Magnus has Nillious attack her, but proves to be no match. The Golden Bakugan, whose name is Pyravian orders them to leave the maze; however, Magnus continues to fight her, but is soon defeated. He then leaves through the same portal while the AO are forced to leave by Pyravian who has vowed to protect the Core Cell at all cost. Heading back out, Dan begins to wonder if there's any good in Magnus, much to everyone's shock.\n|LineColor        = 3198FF\n}}\n(US)September 29, 2019 (CAN)\n| AltDate = November 11, 2019\n| Viewers         = 0.17\n| ShortSummary    = Shun dreams about his early childhood when he and his father had a close relationship with each other. This leaves Lia concerned about what he is going through right now. Benton contacts the AO, having picked up another Core Cell signal with a strange reading that doesn’t make sense, located in Japan. Everyone begins to feel worried about Shun as he starts to think about what his father did to him as he cut him off from the family. Arriving in Japan the next day, they land on an island owned by Kazami International Holdings. They find out that the Core Cell is inside one of the buildings in front of them, but before they can get inside, Masato intercepts them. Shun holds him and his forces off while the others head in to find the Core Cell. They manage to evade the guards and locate the room with the Core Cell coming from another room where they also find a huge machine. The Bakugan begin to sense the energy that is unstable, signifying what Benton had said earlier, until they are found by President Kazami. Shun discovers in battle that the Bakucores are shattering, having become unstable. Masato prepares to finish him off, but Ichiro shows up and reprimands him for his actions, reminding him that he doesn’t need people who “can’t produce results.” He turns towards Shuns friends asking to speak with them, leaving Shun confused. In the end, Magnus arrives, having located the Core Cell on the island and vows to search for it.\n|LineColor        = 3198FF\n}}\n(US)September 29, 2019 (CAN)\n| AltDate = November 11, 2019\n| Viewers         = 0.17\n| ShortSummary    = The AO discuss their mission to Ichiro about the Core Cells. They ask about the machine they’re using that’s giving off Core Cell energy, and what they’re planning to do with a Core Cell, but he says it’s for business reasons and dismisses them, not believing their story. As they are about to leave, he asks Shun to stay for a while to discuss other things with him. While waiting outside, Dan and Lia soon find out that Lightning is missing, then they discover Wynton acting strange on his phone, but they learn that he’s guiding Lightning towards the machine in order to figure out what it is and what it does. Connecting to the machine, Wynton tells them it is a Core Cell Extractor; it is used to warp space in order to connect from the surface to the Core Cell, then it sucks out its energy. In reality, their planning to suck the Core Cell dry. They witness the test, including Lightning where they discover a group of Bakugan being used as an energy source in an attempt to force a connection to the maze. He soon leaves, not wanting to see anymore. Meanwhile, Masato becomes frustrated about what is transpiring here, then learns that the test failed and is told to report to Ichiro about this. Elsewhere, Magnus attempts to search for a way to find the Core Cell. Spotting Lightning, he attempts to retrieve the camera that he has on him, believing there’s information on the Core Cell, to no avail at first. Magnus defeats Lightning in battle quickly, takes the camera from him, and flees after the AO arrive, learning that he’s after the Core Cell. Masato arrives to give a report about the test failure to Ichiro, but he finds him missing. Overhearing a conversation between him and Shun, he soon finds out that Ichiro is planning to replace him with Shun, further infuriating him. Shun is soon left with a decision to make following his father’s offer.\n|LineColor        = 3198FF\n}}\n(US)October 6, 2019 (CAN)\n| AltDate = November 18, 2019\n| Viewers         = 0.17\n| ShortSummary    = Drago sees a vision of a Golden Bakugan, as well as the destruction of the island in his dream, which he later tells the AO about. They suspect that it’s the Core Cell Extractor which will make the Core Cell overload and destroy the island. They think the message was sent by the Core Cell because of it, which is why they believe that it caused the Bakucores to become unstable. The AO decide to stop the destruction that will eventually come soon. They tell Ichiro about it, but he doesn’t believe them and refuses to stop development on the Core Cell Extractor, then he reveals to Shun about the decision he’s still thinking of. Meanwhile, an infuriated Masato activates the Extractor despite the scientists pleading for him not to because it is unstable. The AO see this and confront Masato where he reveals that he overheard the entire conversation between Shun and his father about replacing him. He explains that his own father used to work for the Kazami family, having been given an important task, until he was fired for his failure. He vowed to never be like him and dedicated himself to working hard so that he could succeed without fail. Shun successfully evolves Hydorous through the unstable Bakucores with encouragement from his friends and wounds Serpenteze, but before he can destroy the Extractor, Ichiro shows up, telling him of the outcome that will happen if he destroys it. Shun reminds his father about what his life was like in his early childhood, and how they have gotten along since then, which is why he has chosen to continue down his own path. He proceeds to destroy the Extractor, but unfortunately his attack is absorbed into the machine like Masato expected him to, which unleashes a burst of power, intending to stabilize the tunnel between the surface and the Core Cell, creating a huge ball of energy in the process. They soon realize that this will make the island explode, destroying everyone and everything on it. Magnus sees the ball of energy and flies towards it, intending to take that power all for himself.\n|LineColor        = 3198FF\n}}\n(US)October 6, 2019 (CAN)\n| AltDate = November 18, 2019\n| Viewers         = 0.17\n| ShortSummary    = Everyone witnesses the unstable power of the Core Cell, not knowing what it will do to them. Masato has Serpenteze absorb the power to use against the AO, but it reverts him to ball form very quickly after absorbing too much of it, and the unstable power level knocks him out. The destruction continues as an evacuation is ordered. The AO become determined to stop that unstable power before it’s too late. With help from a scientist, he explains that since the Extractor is overloading, the only way to stop it is to decrease its power level to a perfect color zone so that the controls can function again, which will give them enough time to shut it down. However, they still have no clue on how to decrease the energy output, until Magnus and Nillious show up and start to absorb the power, but they soon flee, unable to handle this much as it is unstable. The AO soon discover to their surprise that the energy output has decreased, and that absorbing the power will decrease the Extractor to that color zone. Ichiro decides to stay behind to witness this for himself. They use all of their Bakugan to absorb as much energy as they can as it flows through them and themselves, with help from Toshi and the others, but suffer heavy casualties, leaving Dan and Drago as the only ones standing. They manage to overcome the energy and fly straight into the eye of the storm as they shut down the Extractor from within before it is destroyed as it falls back down. Construction on the island commences and the AO are thanked for their heroic actions. Ichiro gives Shun a mobile gate, a device that will allow them to enter the maze from anywhere, much to everyone’s surprise. He tells him that he now understands the future their creating for Bakugan and humans and hopes that they will make it a reality, leading Shun to thank him. As they fly off, Ichiro looks on, hoping that Shun and his friends can succeed in their mission.\n|LineColor        = 3198FF\n}}\n(US)October 13, 2019 (CAN)\n| AltDate = November 25, 2019\n| Viewers         = 0.22\n| ShortSummary    = The AO test out the mobile gate and enter the maze in order to complete their mission by making all of the Core Cells open source. Setting one up, they head for the next one, but soon find out that it’s pretty far away, and they don’t have anymore connectors with them, having used all of them up. They also learn that they have to attend a party hosted by Benton to celebrate the near completion of the open source network, so they decide to come back later to set it up. As they head back, they are unaware that the Bakuzon, presumably Tiko, has found a Core Cell, intending to corrupt it. The AO celebrate their party (joined by Benton) for all the hard work they have been doing to help make Benton’s dream come true as he is planning on making the preparations to activate the network as fast as possible as he’s really excited about it. After that, they learn that Benton has returned to work as usual. They begin to have thoughts about Pyravian when they last encountered her at the Yucatan Peninsula, wondering why she was protecting the Core Cell from them in the first place for no reason. Lia guesses that she has a special mission to protect all Core Cells everywhere, leading them to wonder what she is truly protecting them from. Shun questions about the open source network their helping Benton create, wondering if it holds a good intention for all Bakugan, leaving everyone confused. Meanwhile, China Riot has hired Colonel Tripp to be his bodyguard/mentor/coach ever since he was fired from AAAnimus following its aftermath. Tripp quarrels over the Exit Team’s disbanding and learns that Riot only joined them out of her own fun, and has no idea what the other members are up to now. Meanwhile, Magnus wanders the streets grieving over his failed attempt to take the Core Cell protected by Pyravian, including the fact that he fled in fear, and then learns about Dan’s bravery when he faced the unstable Core Cell energy back in Japan. He begins to lose faith in going after the power he deserves, but just as he is about to give up for good, an energy surge emerges and begins affecting his Bakugan, including the AO’s as well. The cause of this is from Tiko who is making the power of the Core Cell his own. Magnus sees a vision of Tiko, which prompts him to continue his quest to find the power and take it all for himself. The AO learn from their Bakugan that they heard a voice calling for help, presumably the Core Cell that has also affected the other Bakugan out there as well. Since they don’t know what caused this event in the first place, they begin to suspect that something bad is going to happen soon. In the end, Tiko has successfully corrupted one of the Core Cells, intending to use its power for his own purpose.\n|LineColor        = 3198FF\n}}\n(US)October 13, 2019 (CAN)\n| AltDate = November 25, 2019\n| Viewers         = 0.22\n| ShortSummary    = Dan has a dream about a dark power that has affected one of the Core Cells, the maze, and Earth altogether. Drago reveals that he also shared the same dream as he did. He tells his friends about this who actually believe him, following the incident of their Bakugan back at the party. They suspect that the dream was a warning with an important meaning that they can’t figure out yet. Benton contacts the AO with news about some strange Core Cell activity that he has never seen before, prompting them to further investigate it. Meanwhile, Tripp and China Riot are training until Magnus arrives to recruit her into helping him find the Core Cells in the maze. She is reluctant to do so, but eventually agrees in order to get back at them for defeating her in the past. Meanwhile, the AO travel in the maze in search of the Core Cell. Their Bakugan start to fall ill, making everyone think that the maze had something to do with it. Just then, a black ooze appears, restrains Drago, and drags them further in despite resistance. Much to everyone’s shock, they soon encounter Tiko, thought to have been destroyed by Drago during their last encounter, but somehow managed to survive. He begins to attack Drago out of revenge for defeating him earlier. What’s worse is that the other Bakugan can’t go big to help him, nor can Drago access his abilities due to Tiko’s new power level. The AO soon discover a Core Cell that has been corrupted by Tiko (the same one Dan saw in his dream), and learn that he has made that power his own, which is why their at a disadvantage right now. They fall deeper into the maze as the Bakugan try to save them, still being pursued by Tiko. Shun uses the mobile gate as they escape back up to the surface just as he attacks them. They inform Benton on everything that has happened in the maze, which explains the different type of Core Cell activity, leaving him very concerned. They learn that the Core Cells' messages were warnings about Tiko. They decide to find a way to stop him before he can do anymore harm to them.\n|LineColor        = 3198FF\n}}\n(US)October 20, 2019 (CAN)\n| AltDate = December 2, 2019\n| Viewers         = 0.21\n| ShortSummary    = Strata is being chased by a black shadow inside the maze, presumably Tiko. Meanwhile, the AO are at an amusement park waiting for Benton. When he arrives, he takes them to an old theater where a gate has appeared and reveals that someone is using it. No one really knows who is using it and for what reason, which is why he has asked them to deal with whoever will come out of it. Just then, a terrified Strata runs out through the gate and Dan attempts to ask him what he was doing in the maze, but he flees in terror. The AO chase him all over the park until they eventually catch up with him. Lia knocks him out with her Bakugan when he insults her. Regaining consciousness, he begs for Dan to save him, much to his shock. Recovering at the theater, Strata tries to remember what happened to him in the maze, to no avail as he’s in a state of confusion. However, he does reveal that he has found a Core Cell, but before he can reveal anything more, a dark energy starts to corrupt him and drives him mad, initiating a battle in the process. Dan, Wynton and Shun battle his Bakugan under the same condition while Benton deals with Strata. He tries to attack him, but Benton fends him off, but he is still standing due to the energy. Benton tries but fails to get any information out of Strata as he continues to attack him. The AO manage to defeat his Bakugan while Benton defeats Strata as his gauntlet falls off of him. In the aftermath, even though the theater is destroyed, Benton reveals that he bought this amusement park after discovering the gate, much to everyone’s delight. Strata regains consciousness and attempts to attack Benton, again, but he freezes him instead. The AO are soon left wondering on how he ended up like this.\n|LineColor        = 3198FF\n}}\n(US)October 20, 2019 (CAN)\n| AltDate = December 2, 2019\n| Viewers         = 0.21\n| ShortSummary    = Following the events at the amusement park, Strata is taken to a medical lab at Dusk Industries where Benton intends to examine him and find the source of his altered state. The AO learn that something did happen to him in the maze, but they can’t figure out what. Wynton finds his gauntlet that fell off of him during the battle, hoping they can find information on what really happened to him. Back at Studio D, they review video footage on the gauntlet where they see Strata in the maze heading straight for the Core Cell. Despite malfunctioning in the middle, the footage continues to play as he continues his search, until he finds the gate, enters it, and locates the Core Cell. However, as he’s about to approach it, a black ooze from Tiko falls onto him, which explains the condition he’s in now. Learning that Tiko is after that Core Cell, they resolve to find it before he does. Heading back to the gate, they use Strata’s route to lead them to it. During their journey, they encounter many obstacles along the way, but they finally manage to reach the gate, unaware that they are being watched by another gold Bakugan. Meanwhile at Dusk Industries, Benton starts to examine Strata for the condition he’s in. However, he regains consciousness and tries to break free from his restraints, but he manages to get him back into the pod. Back in the maze, the AO find the Core Cell safe, but Tiko is nowhere to be found. They soon discover a Golden Bakugan protecting it, indicating that Pyravian is not the only one. However, he starts to attack them, thinking that their after the Core Cell. They resolve to find a way to get through to him and make him understand that they’re on the same side here. Dan tries to reach out to the Golden Bakugan, to no avail as he continues to attack them. As they get closer to him at first, he stuns Drago and opens up a gate that takes them out of the maze. However, they are unaware that an amount of black ooze can be seen on his back, indicating that he is corrupted somehow.\n|LineColor        = 3198FF\n}}\n(US)October 27, 2019 (CAN)\n| AltDate = December 9, 2019\n| Viewers         = 0.22\n| ShortSummary    = At Dusk Industries, Benton witnesses the AO falling into his office from the gate, much to his shock. Meanwhile, Magnus spots the gate at the park being guarded and reports this to Riot and Tripp. He says that Kurin and Aay have been sent to gather information as they overhear a conversation between Benton and the AO as they tell him about the Golden Bakugan that attacked them, plus their attempt to reach out to him with the same intention of protecting the Core Cell. They plan to get to it first and use that power to defeat them. Another plan of theirs comes into motion when they learn that the AO are planning to find the Core Cell again. Kurin and Aay capture Lightning by luring him away from the others with a fake bone, intending to use him to lead them to the Core Cell. Wondering that to do next, the AO plan to return to the maze to warn the Golden Bakugan about Tiko, and continue with their attempt to make him understand that they want to protect the Core Cell too. Benton decides to accompany them because he’s worried about the danger they’ll get themselves in. While he goes to prepare, they soon find Lightning missing and become worried. Meanwhile in the maze, Tripp and the nearly reformed Exit team take Lightning captive in order for him to lead them to the Core Cell. He tries to break free from his restraint, but Tripp threatens to use a B-mine on him if he doesn’t comply. Seeing this as an opportunity, as they will have to deal with the Golden Bakugan, Lightning agrees to lead them to the Core Cell while secretly planning to lure them into the hands of that Bakugan. They tackle dangerous obstacles along the way that try to stop them from getting near the Core Cell which Magnus overcomes easily. However, one of the traps brings Kurin and Aay back up to the surface. The AO search for Lightning and find a bone, thinking that something happened to him. Benton alerts them to the amusement park where they discover the maze has been breached. A gate soon appears that brings Kurin and Aay back, and they attempt to interrogate them, but they manage to escape, suggesting they ask Magnus. The AO learn that he’s after the Core Cell and continue with their pursuit. Tripp, Magnus, and Riot manage to reach the gate and locate the Core Cell, only to run into the Golden Bakugan. Benton and the AO arrive as well where they reunite with Lightning, while also learning about his capture. They intend to stop them from taking the Core Cell, whatever means necessary.\n|LineColor        = 3198FF\n}}\n(US)October 27, 2019 (CAN)\n| AltDate = December 9, 2019\n| Viewers         =  0.22\n| ShortSummary    = Dan battles Magnus to prevent him from taking the Core Cell, leaving the others to fend off Tripp and Riot. The Golden Bakugan attacks them as he takes out most of the Bakugan. Magnus evolves Nillious to fight him, but is still no match for him; despite blocking his attack once, Nillious is still defeated, leaving Magnus frustrated. Just as he is about to attack Drago, his attack dissipates, knowing that something is weakening him. Benton and the AO approach the Golden Bakugan and find him covered in a black ooze that’s slowly taking over. Lia and Wynton use their Bakugan to try and heal him by cleansing him of the ooze, but they only manage to get rid of most of it; however, his ability to speak has been restored. The Bakugan introduces himself as Trhyno who was tasked with protecting the Core Cell they are at now. He explains that he was battling Tiko who was after it for more power. He didn’t stand a chance against him, having already gained the power of another Core Cell. Before Tiko could claim it, he attacked him, but was infected with the V virus that took away his ability to speak, which is why he was trying to chase them away from this area, to keep them safe because of the virus. He apologizes for his violent behavior against them and asks for forgiveness. Magnus, still seeking the power, flies towards the Core Cell, unaware of the virus. Dan and Drago fly after him despite Trhyno attempting to warn them not to go near it as it is already infected. The V virus starts to take over the Core Cell as Dan and Magnus fall into it. Dan finds him absorbing the infected power and tries to get him out of there, but Magnus shoves him away. Soon he emerges from the Core Cell, now with the power he has been seeking for a long time.\n|LineColor        = 3198FF\n}}\n(US)November 3, 2019 (CAN)\n| AltDate = December 16, 2019\n| Viewers         = 0.24\n| ShortSummary    = Magnus finally has the power that he has been searching for, seeking to use it against anyone who stands in his way. He uses it on Trhyno first who is still weak from the ooze. Dan and Drago escape the Core Cell and reunite with everyone, informing them of Magnus's new power, and that he was unable to stop him from absorbing it. Magnus manages to defeat Trhyno which also spreads the V virus even more. Dan and the others resolve to stop him, no matter the cost. However, they are no match for his new power level. Benton finds and recovers Trhyno, still infected with the virus. Left with no other option, the AO evolve their Bakugan, but they are still unable to defeat him. Magnus uses his new power by evolving Nillious into his super evolution called Titan Nillious Nova and Shadow. He defeats everyone’s Bakugan easily, leaving Drago as the only one standing. His abilities prove to be no match for Nillious’s new power as he repels them. He finally manages to defeat Hyper Dragonoid at last, much to Dan’s shock. As Magnus celebrates his victory over Dan’s defeat, Tiko starts to possess him, intending to make him his servant. He opens a gate and flees to the surface with the infected power in his hands as Dan calls out to him.\n|LineColor        = 3198FF\n}}\n(US)November 3, 2019 (CAN)\n| AltDate = December 16, 2019\n| Viewers         = 0.24\n| ShortSummary    = At Dusk Industries, Benton searches for Magnus, knowing of the danger he’s in because of the power he possesses from the Core Cell infected by the V virus with unknown effects. He believes that he’ll spread it all over the surface world unless they do something about it. Riot thinks that he would go see his sister, which Dan believes in, knowing that she's important to him. The AO, Riot, and Tripp visit Emily who doesn’t know where Magnus is. Not wanting to worry her even more, they come up with a false story, saying that he’s using his power to save the world from certain disaster. Before they leave, Emily asks Dan to not do anything dangerous because she still cares about him. Meanwhile, Magnus falls under the influence of Tiko who plans to use him to gather Core Cells for him. Benton continues his search and is able to locate him, but is shocked to discover that he is heading for the Core Cell at AAAnimus. He starts to infect their Bakugan as they go on a destructive rampage around the facilities. Philomena is informed of the incident and discovers his presence. Magnus and his army of infected Bakugan confront her as she battles him, intending to stop him, but he is too strong for her. The AO, Tripp, and Riot head to AAAnimus and arrive just in time, informing Philomena of the V virus that has affected Magnus, and unless they do something about it, the virus will spread, making her fully understand what’s at stake. She explains that since the Core Cell is under the authority of the city, it has been locked up in an enclosure to keep anyone from even touching it. Despite Dan trying to reach out to him when he mentions Emily, Magnus, still under the control of Tiko, destroys the enclosure and starts to infect the Core Cell, intending to give it to him so that he can rule Vestroia, much to Dan’s confusion. The AO attempt to stop him, but they are blocked by the infected Bakugan trying to prevent their interference. Flying up from atop, Dan fails to get through to Magnus as he continues to fully corrupt the Core Cell completely.\n|LineColor        = 3198FF\n}}\n(US)November 10, 2019 (CAN)\n| AltDate = December 23, 2019\n| Viewers         = 0.19\n| ShortSummary    = Magnus is about to take the Core Cell for Tiko, but it is soon brought back down to the lab by Benton. He and the infected Bakugan surround everyone, intending to capture every Core Cell and spread the V virus everywhere so that Tiko can take control of Vestroia, and most likely Earth. Wondering about what he is talking about, Drago reveals that Vestroia is the home world of the Bakugan. Benton arrives and explains that Vestroia somehow merged with Earth during the “Great Collision” 12 years ago, and anyone that was born after the event were affected by it, which explains the AO’s connection with their Bakugan. As the infected Bakugan prepare to attack everyone, Pyravian arrives and cures them, and also seeks to cure Magnus of Tiko’s influence on him. Her attack reverts Nillious to his current form, causing Magnus to escape back into the maze, but not before Tripp tags him with a tracker. Wynton links it with the Core Cap 2 and finds Magnus and Nillious inside the infected Core Cell, now a hot spot for the virus. Benton theorizes that the virus will most likely spread to Bakugan and other Core Cells, including the whole world unless they can stop it. He suggests that they destroy the Core Cell, but Dan and the others are against that, not knowing of the outcome. He seeks to save Magnus and the Core Cell, but Benton argues that it is the only way to save the world. He and Philomena decide to put their differences aside and work together in order to save everyone from the V virus. When Dan asks Pyravian about this, she explains that since the Core Cell is infected, it is impossible for a Golden Bakugan to even heal it. However, she suggests to him that he battle Magnus inside the Cell in order to cure him and the Core Cell from the virus, which is possible since the previous battle returned the polluted Earth to normal. However, because of the infection, she warns him that if he loses this battle, the virus will corrupt not just the Bakugan and him, but the other Brawlers involved as well. Benton refuses to go along with this idea, thinking that it’s too risky for them to attempt. Dan persuades him to let him go, knowing that he can do it. Shun opens a gate and they head back into the maze to stop Magnus. The Core Cell starts to attack them due to the change in the area, but they are aided by Pyravian. The AO see Dan and Drago flying towards it, wondering why it’s not attacking them. Dan discovers the infection on him and is shocked to learn that Drago knew about this the whole time. He soon finds out that when he was trying to stop Magnus from absorbing the infected power, some of the virus got onto him. He worries that if he is completely infected, they’ll end up just like Strata and Magnus. Drago assures Dan that they will defeat him before the infection spreads, and everyone will return to normal, putting his faith in him. They head inside the Core Cell where Magnus is waiting for them, intending to defeat him once and for all. Part 2: Dan faces Magnus in the final battle for the fate of Earth and Vestroia. Magnus gains the upper hand using his unlimited power, unwilling to fail like he did last time. Soon the infection begins to get the best of Dan. Drago is nearly defeated, but he still hasn’t lost. He begins to criticize him for serving Tiko under his influence. Magnus sees the infection on Dan, realizing that this was how they got into the Core Cell and taunts him, thinking that it will possess him fully. He continues to resist it and resolves to cure him and the Core Cell completely. The courage and strength that Dan and Drago possess help them to continue the fight, leading Magnus to realize that they have never given up in every battle they faced together in the past due to their strong bond, which he has seen before. He begins to break free from Tiko’s grip, but he still attempts to keep him under his control. Dan finds a Bakucore, but is confronted by Nillious. Before he can attack him, Magnus stops him, still fighting over Tiko’s control. He continues to fight it, which leads him to further possess him fully while he pleads for Dan’s help. Meanwhile, the AO and their allies are still unable to get close to the Core Cell due to the infection. Shun opens a gate connecting the dimensions and Benton tells them to keep it open as planned. At one point, Pyravian becomes impressed with the strength and bond that the Bakugan and children share together. Back at AAAnimus, Benton works to bring the BCS back online. Once activated, the energy from the Core Cell heads straight through the gate into the maze as Shun directs it towards the infected Core Cell. The energy manages to reach Dan as it cures him of his infection. Feeling everyone’s emotions, Dan unlocks his new power, allowing him to evolve Drago into his super evolution called Titan Dragonoid, giving him the upper hand. Drago uses his new abilities to overcome Nillious’s attacks, with him and Dan vowing to protect the Core Cell and Vestroia. Using their final attack, they successfully defeat Magnus and Nillious, freeing them from Tiko’s control completely, and curing the Core Cell from within. Magnus is relieved that he is finally free from Tiko’s control. He and Dan decide to resolve their differences, hoping that they will battle each other again soon. In the aftermath, everyone learns that Magnus is off somewhere, most likely to see Emily. With the world saved (for now), Benton decides to continue his research on Tiko and Vestroia, but is unaware that some of the virus has gotten onto him.\n|LineColor        = 3198FF\n}}\n(US)November 17, 2019 (CAN)\n| AltDate = January 6, 2020\n| Viewers         = 0.22\n| ShortSummary    = The AO are thrilled that they have saved the world from the V virus caused by Tiko, for now, but they are still concerned about his attempt to find another Core Cell in order to gain more power. Drago believes that he is trying to take control of Vestroia, even Earth too. With everything that is transpiring here, they decide to train themselves so that they will be ready to face Tiko again. Meanwhile, Benton is doing research on everything related to Vestroia. Due to a miscalculation, he begins to believe that the open source network will most likely put humanity in danger, and is determined to eradicate both the V virus and Tiko at the same time. He has also created a vaccine that will protect anyone from it. Suddenly, the virus starts to infect him, and he learns that Strata passed it on to him during their fight. He attempts to use the vaccine on himself, but it soon gets the best of him. Benton finds himself in the maze and encounters Tiko who seeks to possess him. Meanwhile after training, the AO are shocked to discover that the Drome hasn’t repaired anything like they usually do. Shun suspects that it’s connected to the Core Cells, and since the power is broken, Vestroia and the Core Cells are unbalanced somehow. They decide to contact Benton in order to find out what’s really going on. Benton wakes up, thinking it was all a dream, then he learns that the Brawlers have been trying to get in touch with him for a long time. Contacting them, he apologizes for not returning their calls, and they ask to speak with him. Benton agrees, saying that he has information that he would like to share with them in person. What he doesn’t realize is that the mark of Tiko has appeared on the back of his neck, signifying that he is under the possession of Tiko, or at least not yet anyway.\n|LineColor        = 3198FF\n}}\n(US)November 17, 2019 (CAN)\n| AltDate = January 6, 2020\n| Viewers         = 0.22\n| ShortSummary    = The AO arrive at Benton’s office, only to find him missing. When he returns, they start rambling about what they have witnessed at the arena, which infuriates him a little bit. He manages to calm down, and Dan tells him about the Drome acting differently. Benton explains that the data he has been studying based on the battles, the maze, and the Core Cells led to a conclusion; Vestroia has an ecosystem that produces energy which is sustained by Core Cells and Bakugan battles, with the Drome forming the nucleus, creating an energy cycle that is based on Vestroia’s foundation. This explains how the previous battle cleaned up the polluted field, providing energy for the Drome and the land. Since Vestroia merged with Earth, it has developed an impact on its environment as well. Benton concludes that Tiko is trying to destroy that ecosystem using the V virus, and what he seeks is control of Vestroia. He starts to feel pain in the middle of their discussion and leaves for a moment to clear his head, but soon comes face to face with Tiko who starts to possess him. The AO discuss the info they heard, believing that they are all connected to Vestroia somehow. They conclude that Tiko is planning to use the V virus to break this connection until there is nothing left. Meanwhile, Benton, possessed by Tiko, awakens his Bakugan to use in battle. Returning to the AO, he takes them to an arena where he shows them his Bakugan Hydranoid and challenges them to a battle. Dan accepts, wanting to know just how strong he is. Benton starts to act differently during the battle, much to everyone’s shock. Dan evolves Drago to his titan form in order to give him more of a challenge. Tiko, still possessing Benton recognizes Drago as Maximus before Dan successfully defeats him. In the aftermath of the battle, Benton asks the AO to continue with their mission by setting up connectors for all of the Core Cells in order to complete the open-source network. Unbeknownst to them, inside his subconscious, the real Benton learns that Tiko is lying to them, and is planning to use the open source network to take control of Vestroia. Tiko reveals to him that he plans to use his knowledge and body to make it happen before further possessing him fully in order to prevent him from telling the AO about his possession over him, and his secret plan. “Benton” soon recovers and the Brawlers decide to continue with their mission. Before doing so, he gives them another mission to undertake. He tells them the existence of another type of Core Cell called the “Great Core Cell” that is completely different from the other Core Cells and asks them to go look for it. The AO agree, knowing that their purpose is to protect all Bakugan and Core Cells alike. However, they are completely unaware that Benton has been taken over by Tiko who plans to use them in order to fulfill his sole purpose of controlling Vestroia.\n|LineColor        = 3198FF\n}}\n(US)November 24, 2019 (CAN)\n| AltDate = January 13, 2020\n| Viewers         = 0.19\n| ShortSummary    = In Brakkistan, Brakken is preparing himself to become the strongest Brawler so that one day, he’ll beat Lia again in a battle so that he can marry her. Grom, his minister of technology reports to him about his machine that is now ready to use which will make him become the true “Battle King”. Brakken activates the machine which starts to admit a strange light, making him believe that he will realize his true destiny. Meanwhile, the AO have become suspicious about “Benton’s” strange behavior as he starts to overeat on junk food for example. He tells them to return to Brakkistan because the signal to the connectors has gone offline and asks them to set them up again, much to their shock. Flying there, the AO are left concerned about the last time they've been there, knowing that Brakken is a big fan of Lia who tried to marry her. They believe that he might allow them to reattach the connectors to the Core Cell again somehow. When they arrive, they are shocked to discover a party being thrown in the palace and the people acting differently. They also learn that Brakken has changed too. Meeting with him, Brakken shows them the machine called the Baku-up machine and explains that it draws energy from the Core Cell to power up Bakugan and Brakkistan, with Shun suspecting that this must be the reason why the connectors went offline. Brakken says that he removed them, thinking that they’re an interference. Lia asks him if they can restore the connectors because they are important, but he refuses, much to her shock. He begins to stop showing interest in Lia, infuriating her as she still remembers the time he attempted to bring her into a forced marriage. When Dan asks Brakken the same thing, he eventually agrees if he beats him in a Bakugan battle, saying that he has the advantage, now that he has the Core Cell. Lia decides to battle him in Dan's place in order to get back at him for his changed behavior. While she battles, the AO become suspicious about the people's changed behavior and Brakken’s. They meet Grom, the creator of the machine who explains that it is a failure because after it drew Core Cell energy into itself, it also added an effect to everyone’s mind due to the light, which explains their change in behavior where all they can think about is fun. He was the only one to have escaped the effects of the device using a helmet that he invented to protect himself. Asking why they’re not affected too, Grom says that the power of the Core Cell must be protecting them from the machine. Shun theorizes that Tiko is behind this and they suspect that something in the maze is causing this. Grom advises the AO to stop the machine as he doesn’t want to risk being affected too if he gets too close. They inform him that Brakken will turn off the machine if Lia wins, but Grom says that it can also do other things than put people in a good mood. Brakken, feeling bored decides to change things up as he starts using his Bakugan to cause damage to his own palace. Grom says that the machine makes people switch from one emotion to another. Due to the machine, Brakkens mood changes to an angry one where he accuses Lia for hurting him and has his forces arrest the AO, with Grom explaining that anyone put in a bad mood becomes unstoppable. The AO are then captured.\n|LineColor        = 3198FF\n}}\n(US)November 24, 2019 (CAN)\n| AltDate = January 13, 2020\n| Viewers         = 0.19\n| ShortSummary    = A court trial commences for the AO injuring Brakken, even though they didn’t do anything wrong. However, Lightning is the only one present. Meanwhile, the AO have escaped the clutches of the people of Brakkistan and locked themselves inside a building. Since the Baku-up machine is making the people act like this, they are determined to destroy it in order to return everyone to normal, including Brakken. But they would have to agree to the trial first in order to do so, which will be hard since their Bakugan have been taken away by the people. Shun comes up with a plan that might work and they discuss it in private. The AO soon show up as the defendants legal team in order to prove themselves innocent. Despite their attempts to do so, due to many misunderstandings (in reality, it’s really the effects of the machine), they fail and end up imprisoned while also being given large prison sentences, leaving Dan as the only one standing. He challenges Brakken to a battle in order to earn their freedom, but since their Bakugan are locked up, Brakken refuses to release them. Meanwhile, the Bakugan have become incarcerated and are determined to escape. Drago and Trox try to help Pegatrix escape by squeezing her through the bars which proves to be hard at first. Just then, the machine malfunctions which Pegatrix witnesses after successfully escaping. The light from the device begins to turn everyone back to their fun state, making the AO believe that it’s overloading. Grom soon arrives and frees them, explaining that he didn’t want to risk coming sooner, or else he would have been locked up too. The AO rush to the machine intending to destroy it, but they are stopped by Brakken. Pegatrix reunites with Lia who initiates a battle with him. Grom instructs her to destroy the device by cutting the tubes. Pegatrix does so, and all of the people return to normal; even Brakkens feelings for Lia have been restored as well. In the end, Brakken apologizes for what he has done, and the AO accept it, saying that they have already restored the Core Cell connectors. Brakken admits that he was so focused on his technology, he begins to believe that he's not a very good king at all. Lia assures him that he is a great king, saying that his Bakugan have gotten stronger at least. Brakken hopes that someday when he gets strong enough, he’ll be able to visit and become friends with her. Lia happily accepts. Pyravian is then seen flying off into the distance after observing the AO. Meanwhile, “Benton” holds Trhyno prisoner as he starts to interrogate him for the location of the “Great Core Cell.”\n|LineColor        = 3198FF\n}}\n(US)December 1, 2019 (CAN)\n| AltDate = January 20, 2020\n| Viewers         =0.21\n| ShortSummary    = The AO continue with their mission when they set up a Core Cell. Finding out that there are even more of them, much to Dan's shock, they are determined to set all of them up in order to protect their planet and the Bakugan’s from Tiko’s grip. They begin to travel around the world, setting up as many Core Cells as possible. “Benton” congratulates them for their progress, hoping that they’ll be able to set up the last of the Core Cells. While traveling to them, the AO are soon attacked by a familiar presence. This causes damage to the engines of the airship as it crash lands into the middle of the ocean. Determined to find out who or what is attacking them, Dan  summons Drago to find out for themselves. They are soon shocked when they discover that Pyravian is the one attacking them for no reason as they are unable to find out why. Shun uses Vicerox to create a bubble cloud in order to buy them time to escape, which makes it harder for Pyravian to find them. Wynton activates the repair system to fix the airship, saying that it will take time before it’s fully functional, leaving the others to buy him all the time that he needs by fending off Pyravian for as long as possible. Lia has Cubbo distract Pyravian for a while, but her attack clears up the cloud quickly while also creating a huge wave, engulfing the AO in the process. In reality, they are safe as they are now hiding out at the bottom of the ocean. However, she parts the sea and locates them, much to their shock. Dan asks Pyravian why she’s attacking them, and Pyravian reveals that they have changed. With repairs nearly complete, Dan stalls for time by creating a steam cloud. The airship is soon repaired and they escape unharmed. The AO soon become concerned about why Pyravian attacked them, wondering about what they could have done that upset her so badly.\n|LineColor        = 3198FF\n}}\n(US)December 1, 2019 (CAN)\n| AltDate = January 20, 2020\n| Viewers         = 0.21\n| ShortSummary    = The AO inform “Benton” that Pyravian attacked them earlier for no reason. “Benton” explains that the Golden Bakugan have a duty to protect the Core Cells, and that she is against the idea of the Brawlers using the connectors to interfere with them. He tells them that if she tries to get in their way again, they must defeat her, much to their shock. The AO are left in shock on what they should do as they want to prevent Tiko from taking over Earth and Vestroia. Dan suggests that they go see Pyravian in person, and find out why she attacked them, and how they could have changed. They agree, reminiscing the time she fought alongside them during their battle with Magnus who was possessed by Tiko earlier. Since they don’t know where to find her, they decide to search for her near the Core Cells. The AO return to the set up Core Cells to search for Pyravian, but there is no sign of her. Just as they are about to give up their search, a Bakuzon appears from out of nowhere. Before it can attack them, Pyravian saves them. Dan approaches her and asks again on why she attacked them, wanting to understand how they could have changed, and Pyravian finally reveals that she thought they were infected with the V virus. She explains that when she attacked them on the ocean, she didn’t see any signs of them infected, and that she saw them stand up to an infected Bakugan, confirming that they’re not really infected with the V virus. The AO feel relieved that this misunderstanding is finally cleared up. Pyravian says that the virus can change anyone’s nature, which is why she had to push them to the very edge in order to see it for herself, wanting to find out if their true nature would show. Before she can reveal her suspicions on why she thought the AO were infected in the first place, more Bakuzon show up. Pyravian says that they have been sent by Tiko to destroy her and all Golden Bakugan, and that Tiko’s goal is to claim all of the Core Cells, and they are the only ones that stand in his way. She tries to fight them off, but they gain the upper hand and restrain her. The AO save her and battle the Bakuzon, determined to protect Pyravian. Pyravian becomes confused as to why they continue to fight, knowing that the V virus can also have an effect on humans too. They explain to her about how much they love to battle, ever since they first discovered the Bakugan to begin with. It has become an enjoyment to them, and they are determined to create a world where humans and Bakugan can coexist. The AO then proclaim that they will protect Earth and Vestroia from Tiko’s grip, impressing Pyravian. They manage to defeat the Bakuzon very easily, showing just how brave they really are. In the end, Pyravian tells the AO that she’s going to continue protecting the Core Cells. When they show her the devices their using, she says that they possess a flaw, explaining that they disrupt the energy flow between the Core Cells and Vestroia, which will eventually lead to a terrible impact on them and all Bakugan, which is why she thought they were planning on causing damage to Vestroia in the first place. The AO become shocked and confused, saying that “Benton” told them to set them up. They suspect that either he didn’t know about the truth until now, or he knew what the connectors would most likely do, and had them set them up anyway, making them believe that he’s trying to cause a negative impact on Vestroia just like Tiko and the Bakuzon. That’s when they begin to realize that Benton has somehow been infected with the V virus, meaning that he’s under Tiko’s control.\n|LineColor        = 3198FF\n}}\n(US)December 8, 2019 (CAN)\n| AltDate = January 27, 2020\n| Viewers         = 0.23\n| ShortSummary    = The AO hang out in “Benton’s” office lounging around and ignoring him, which begins to annoy him at first. It is revealed that since they’ve learned that Benton has somehow been infected with the V virus due to his strange behavior, they’ve decided to trick him into revealing his true nature by pretending to ignore him, therefore annoying him. They continue to mess around which infuriates him even more, all while questioning him about their mission that their supposed to complete, saying that the connectors hold a grudge against Vestroia and the Bakugan, and that he lied to them, demanding an explanation in the process. Enraged, “Benton” shows off his true nature, revealing that the V virus is responsible for this. The AO tackle him and inject him with the vaccine given to them by the medical lab, hoping that it will cure him. Dan sees a strange mark on his neck, and “Benton,” who has recovered reveals that there was no vaccine in the injection tubes, and that he destroyed the entire stock. That’s when he reveals himself as Tiko, making the AO realize that Benton has fallen under his control. Initiating a battle with them, Tiko reveals that he was planning to keep them uninfected by the virus for now while they did his work for him in order to fool Pyravian, but since they found out about his scheme, he was forced to change things up. Tiko also reveals that he still plans on infecting them with the V virus in order to make them his puppets. With no other choice, the AO are forced into battle. Hydranoid proves to be too strong for Drago to handle because Tiko is controlling him without a device. Dan begins to hesitate, not wanting to battle Benton because he’s still in there somewhere, but Drago encourages him to regain his focus in order to defeat Hydranoid. The rest of the AO join in, evolving their Bakugan in the process. They prepare to face Hydranoid and defeat him, as well as Tiko, but he soon disappears, saying that he has other plans to use Benton’s knowledge, and that he will battle them again later on. The AO are soon left wondering on what to do next as they want to know what Tiko’s next move is.\n|LineColor        = 3198FF\n}}\n(US)December 8, 2019 (CAN)\n| AltDate = January 27, 2020\n| Viewers         = 0.23\n| ShortSummary    = The AO are upset because Benton has been taken over by Tiko. They become determined to get him back, no matter what. They sneak into AAAnimus, hoping that they can get help from Philomena, but they are soon caught. Philomena confronts them where they ask to speak with her. They inform her about Tiko’s possession over Benton, saying that even though they don’t get along well, they are still family. Hoping to find a way to get him back to normal, Philomena says that she hasn’t heard anything about Bakugan taking over humans. The AO explain that Tiko is still spreading the V virus to Core Cells everywhere, all while making enemies with the Golden Bakugan. Philomena theorizes that if Tiko really has taken control of Benton’s mind, this will lead to trouble, and that he will be impossible to stop. The AO reveal that Tiko is after the Core Cells, including the one at AAAnimus. Just then, they are informed that an intruder is messing with the BCS, making them realize that Tiko is here, and that he is behind this. Tiko begins to bring the Core Cell already infected out onto the surface. The AO and Philomena rush outside in order to stop him from infecting the Core Cell, but they arrive too late. Determined to find out what he is truly plotting, Tiko reveals that he’s planning to take AAAnimus and infects the Core Cell completely while also changing its systems. The system begins to corrupt the Bakugan and the AAAnimus security personnel, turning them all into Bakuzon in the process. Wanting to know how the Core Cell was infected in the first place, Tiko explains that Benton was infected with the V virus long before he took him over. When he used the machine, the virus spread to the Core Cell. Philomena begins to realize that when they sent the Core Cell energy through the maze, the V virus responded, which Benton didn’t even realize for himself. He was slowly infecting them all one by one, which helped spread the V virus everywhere. Shun concludes that since he took over Benton’s mind and Dusk Industries, he now wants to take over AAAnimus and their technology. Philomena, determined to keep AAAnimus out of Tiko’s hands battles him and the Bakuzon army, joined by the AO. Although they defeat the Bakuzon, the infected system restores them, making it harder for them to deal with. Tiko, referring to Drago as Maximus reveals that he lost to him in their previous battle inside the Core Cell, as well as defeating Magnus and freeing him from his control, but since he has the power of all the Core Cells now, he is determined to get back at him, leaving Dan confused. The AO and Philomena become surrounded by the Bakuzon as they are unable to defeat them. Just then, Shargo Ronin appears and rescues Philomena who instructs the Brawlers to retreat as well. Dan hesitates to retreat as he still wants to save Benton, but he soon gives in and does so. Tiko watches on as the AO flee, now that he has AAAnimus all to himself, determined to put his plans into motion.\n|LineColor        = 3198FF\n}}\n(US)December 15, 2019 (CAN)\n| AltDate = February 3, 2020\n| Viewers         = 0.22\n| ShortSummary    = During a news report, Veronica announces the recent Bakugan rampage at AAAnimus, and due to the public outcome, Philomena has been forcibly resigned as President and replaced by “Benton Dusk.” Back at Studio D, Philomena informs the AO that “Benton” created a false story that turned the public against her, having stolen all resources from her, and making everyone believe that she was the cause of the Bakugan rampage. They are also surprised to learn that she knows Shargo Ronin, whom she hired some time ago. Since Tiko has plans for them, Philomena tells the AO that she will continue to lie low for a while until the incident dies down a bit, and instructs them to stay on alert. They soon become suspicious, believing that Tiko is planning something big, now that he has control of Benton. They are also shocked to learn from the news that Kravitz has demanded that all parents confiscate their children's Bakugan, following the rampage. She believes that they’re a bad influence on them, thinking that they affect their education, making the AO learn that she’s spreading lies about the Bakugan to the public. Kravitz announces that a Bakugan Removal Campaign has been established in order to manipulate the people into supporting it. Soon the public begins to take her side and have already started protesting against Bakugan. The Bakugan Removal Force (BRF) have already begun to collect Bakugan from children, upsetting them. The AO now realize that this is Tiko’s new plan. Meanwhile, Kravitz, who has started working for “Benton” reports to him about the BRF successfully collecting thousands of Bakugan for his plans to come into motion. She believes that this will be her chance to succeed and start her own future, with everything that is being offered to her. Meanwhile, Dan is being pressured by his parents to give them his Bakugan, but he refuses and runs away. Rendezvousing with his friends, he tells them that his folks are also the same way as the other parents are. They learn that Dusk Industries is spreading lies about the Bakugan; now that “Benton” is in charge of 2 companies, including his own, anyone can buy into his lies. The AO are determined to fight back against Tiko who is using human feelings and emotions to his advantage. Wondering what to do next, Dan decides that they should tell the public that Bakugan are not a threat through the media, but they are shocked to discover that their video channel and all of their videos they have made have been deleted. They suspect that Tiko was responsible for hacking in and deleting everything off of their channel, including all information on Bakugan. Just then, the Rowdy Reds show up and tell them that their parents have taken away their Bakugan and handed them off to the BRF. Soon a group of BRF soldiers arrive and attempt to force the AO to hand over their Bakugan, but they refuse, saying that they are not dangerous. They initiate a battle using the Rowdy Reds Skorporos Bakugan, much to their shock. The AO soon learn that they have been infected with the V virus, including the soldiers. Determined to protect his friends Bakugan, including his own, Dan battles them, but since the Drome is acting weird again, it makes it hard for him to battle them at his full strength as he doesn’t want to risk damaging everything around them. Since they can’t battle under this condition, Shun creates a smokescreen, and the AO and Rowdy Reds retreat for now. Once they get to a far distance, the Rowdy Reds catch up to them and ask them if their Bakugan will stay like this forever, but Dan tells them that he doesn’t know, causing them to leave upset. The AO also become upset by what is transpiring here as they are now helpless to deal with the situation they’re in now.\n|LineColor        = 3198FF\n}}\n(US)December 15, 2019 (CAN)\n| AltDate = February 3, 2020\n| Viewers         = 0.22\n| ShortSummary    = The AO make a video to encourage kids to stand up for their Bakugan by opposing Tiko. They plan to slip by Dusk Industries servers undetected by uploading their video to different countries by disguising their IP address in an attempt to get the word out. However, their video gets deleted very quickly since they can now predict their every move so far. With no other option, Dan decides to meet with everyone in the world in person in order to encourage them. They decide to start with the kids in their neighborhood, hoping one of them can help them out. First, Dan asks Marco for assistance, but he says that he wants to impress Dusk Industries by battling him and taking his and his friends' Bakugan in order to get revenge for defeating him in the past, causing Dan to leave. Next, Shun speaks with Kurin who says that his Bakugan was also taken by the BRF, and because of that, he cannot help them. Lia talks with Duran Dane, but he says that he’s thinking about joining Dusk Industries so that he can star in one of their commercials, much to her annoyance. Wynton then speaks with Bobby and his friends, but he accidentally upsets him as he is very emotional about his Bakugan being taken away from him. After they leave, he is soon approached by Colonel Tripp, now the lead commander of the BRF who attempts to force him to give him his Bakugan. He initiates a battle with Wynton which he is forced to accept. During the battle, he is heavily outmatched by the Bakuzon, standing no chance against them. When he sees the messed up Drome, it forces him to hold back most of his strength, giving the Bakuzon the edge. Tripp throws a B-mine at Lupitheon, putting him under his control, causing him to turn against his comrades. He decides to take no interest in stealing Wynton’s remaining Bakugan and leaves, now that he has Lupitheon which he has always wanted from the beginning. Wynton informs the AO of Luptiheon’s capture, therefore no one is willing to help them because all of their Bakugan have been taken away by the BRF. Just when all hope seems to be lost for them, the Rowdy Reds arrive and show them the video that they have recently made, thought to have been deleted. They begin to realize that after their video was uploaded, someone saw it and downloaded it, and then uploaded it again, with the other kids doing the same, meaning that they have been sharing it with everyone in the world in order to get the word out. Realizing that everyone in the world is being touched by their words, the AO gain the confidence needed to fight back against Tiko, and reclaim everyone's Bakugan. Meanwhile, Kravitz orders the video to be deleted immediately, but it keeps popping back up because everyone is sharing it worldwide. When she goes to report to “Benton” about this incident, she overhears him having a discussion with Tripp, saying that he has become impatient with the Bakugan confiscations. To make matters worse, Kravitz witnesses him infecting Tripp with the V virus, causing her to flee in terror. From the AO’s video, he becomes annoyed by what they are attempting to do and becomes determined to find a way to stop them.\n|LineColor        = 3198FF\n}}\n(US)December 22, 2019 (CAN)\n| AltDate = February 10, 2020\n| Viewers         = 0.17\n| ShortSummary    = The BRF continues to take the kids Bakugan by force. The AO arrive in an attempt to stop them, but they are approached by Tripp who sarcastically reveals that they are planning to create a bright future for all children; but in reality, they are actually taking everyone’s Bakugan and giving them to Tiko, making them realize that he has been taken over by the V virus as well. He then warns them not to interfere with them again. With no other people to ask for help, Lia is determined to find someone she knows that will help them. She visits China Riot and explains the whole story to her about what is transpiring here, and asks for her help to stand up to Tiko and save everyone from the V virus. She sarcastically refuses because someone has asked for her hand in marriage and is about to become a princess. Lia is shocked to learn that Brakken was the one that has asked Riot to marry him. When he turns towards Lia for the same thing, Riot becomes super jealous despite her trying to reject his advances. They soon get into an argument which eventually leads to a couple of princess challenges to determine who will marry Brakken. During those challenges, Riot resorts to winning by cheating, much to Lia’s annoyance. Lia becomes so enraged that she challenges her to a battle, which Brakken allows because he wants to know who the strongest princess will be. During the battle, Lia and Riot get into another argument where she accuses her for using dirty tricks on her. Riot begins to taunt Lia about how she’ll never be able to become a true princess due to her anger issues, which starts to get the attention of their Bakugan. Just then, they both get annoyed when Brakken begins to lose his attention for them. That's when they realize that he and Callous have also been infected with the V virus too, meaning that Brakkistan has fallen under Tiko’s control. Realizing the situation they're in now, Lia and Riot decide to put their differences aside and battle together in order to take them down. With their combined strength, they successfully defeat Brakken and Callous, causing them to retreat after they send Brakken flying. In the end, Riot, determined to stop Tiko agrees to fight alongside the AO, much to Lia’s delight.\n|LineColor        = 3198FF\n}}\n(US)December 22, 2019 (CAN)\n| AltDate = February 10, 2020\n| Viewers         = 0.17\n| ShortSummary    = Lia takes China Riot to a Studio D that they have built to hide themselves away from the BRF. When they arrive, the rest of the AO inform them that they are unable to locate any of the Core Cells because Tiko has taken control of them, including the connectors that they have set up around them. They planned on removing them, but somehow he managed to activate their jamming functions in order to hide their locations by blocking their signals from their radar, making it harder for them to find the Core Cells, meaning that Tiko has all of them now. Just when all hope seems lost for the AO, as they are now at a disadvantage, Shun is soon contacted by his father, asking for their presence. Flying on a private jet back to Japan, having been invited by Ichiro personally because he wants to show them something, they are taken to a large fortress where they are soon greeted by Toshi. Toshi explains that Kazami International Holdings constructed this stronghold as their base of operations to combat against the Bakuzon since they already know about the V virus, and Dusk Industries plan to use Bakuzon to try and take over the world. He also reveals that their not just confiscating Bakugan, but they are also secretly targeting other Bakugan research and development facilities, and destroying their technology (capable of combating against the Bakuzon) along with it, which is why this facility was constructed in the first place. Ichiro explains that the Bakuzon pose a serious threat to humanity, and is determined to destroy them at all cost. He asks the AO to join forces with them to defeat the Bakuzon, seeing just how strong they have gotten since then. They are at first left with second thoughts, but since their goal is to protect everyone from the V virus caused by Tiko, including freeing them from his control, they agree to work with him. Meanwhile, Tiko continues to interrogate Trhyno for the location of the “Great Core Cell,” saying that the V virus will take full control of him soon. Tripp and Brakken contact him, informing him that they will arrive in Japan soon to deal with the Kazami Family while also planning to use their “secret weapon.” Back in Japan, the AO and China Riot are provided with a room of their own, but they soon learn that Shun is nowhere to be found. Lia tells them that he’s just taking a look around the fortress by himself due to his complicated relationship with his father, and that he needs time alone to think. During a discussion between him and his father, Ichiro asks if he’s still hoping for a bright future between humans and Bakugan, and Shun confirms that he is, asking the same thing to him. Ichiro reveals that he‘s fighting to protect his company because the Kazami name means everything to him. As Shun walks back to his room, he runs into Toshi who explains that his father has changed a lot since the last time he saw him. After they parted ways, he has been keeping an eye on him for a long time since then, saying that he has been interested in everything that he has been doing with his friends. Just then, the AO and Riot are alerted by a strange looking presence. They discover a huge Bakuzon heading towards the base. It is revealed that the “secret weapon” that Tripp and Brakken have unleashed is a Mega-Bakuzon, which is made out of multiple Bakuzon to begin with. Since the AO can’t use their spirit to defeat it due to its strength and size, Ichiro says that it won’t be a problem when he activates the Anti-Bakuzon force field, weakening the Mega-Bakuzon in the process. The AO and their allies fight back against it, and Shun is impressed that it’s weakened by the force field. Toshi explains that the force field is the Kazami’s newest weapon, used to reduce the power of anyone and anything infected with the V virus, giving the AO the upper hand by a bit, causing it to thoroughly retreat for now. To Dan’s shock, Drago reveals that he can sense Core Cell power all around them. Keiko tells them that the force field is created by Core Cell energy, and they are also shocked to discover a Core Cell Extractor in use. Ichiro explains that it’s not the same one as last time because they made improvements on the original in order to create this Energy Extractor, leaving Dan completely shocked. Meanwhile, Toshi ends up defeated and captured by Brakken and Tripp who intend to use him for their own purpose.\n|LineColor        = 3198FF\n}}\n(US)December 29, 2019 (CAN)\n| AltDate = February 17, 2020\n| Viewers         = 0.18\n| ShortSummary    = At the stronghold, Dan asks what the machine is and what it does. Keiko explains that the machine draws energy from the Core Cell in the maze and uses it to create the Anti- Bakuzon force field. Dan is very skeptical at first because their last Core Cell Extractor overloaded that almost lead to disaster, but Ichiro assures them that the Energy Extractor has been perfected, and that it will not overload like it did before, saying that there is no other way to deal with the Bakuzon. Just then, a Bakugan signal appears on the radar heading towards them. There, they discover Serpenteze, and with him Masato who has changed a lot since then, now a bit older than they remembered. Masato attempts to persuade the AO to listen to what he has to explain, saying that the fortress shouldn’t be here, but Ichiro, who has not forgiven him for his betrayal orders him to be disposed of, causing him to retreat quickly, but not before telling the AO to think about if what they’re doing now is the right thing to do, leaving them confused on what he was talking about. Dan suggests that they go after him in order to get answers. After they leave, Toshi returns, but he’s now acting differently than he was before. During their search, the AO and Riot find Masato who takes them to a small campsite that he built where he has been laying low there for a long time. He begins to tell them his story of what truly happened to him after they parted ways with him on the island: After the Core Cell Extractor was destroyed, he fled deeper into the facility. Feeling hurt and disowned by Ichiro, as he is unwilling to forgive him for his reckless actions, he threw his Bakugan away, feeling like he doesn’t deserve it. He soon discovered a gateway into the maze created by the Extractor and entered it where he has been surviving in there ever since, having no desire to return to the surface. Just as he was about to accept his fate, Serpenteze appeared and saved him, making him realize that his Bakugan really means a lot to him, and that he wanted to learn more about them. That’s when he began a long journey through the maze. When they ask him about how long he has been in the maze, Masato says that he has been in there for about 10 years because time works differently here than on the surface world. During his travels, he discovered a Golden Bakugan named Goreene, whom the AO haven’t met yet. Masato continues to explain that he has learned a lot from him since then, about the connection between Core Cells and Vestroia, and the threat that Tiko and the V virus pose to all Bakugan. He returned to the surface world soon afterwards to warn everyone about the upcoming threat that Tiko has brought upon them. He soon met with Ichiro and attempted to explain everything that has transpired here, asking for his help in the process, but he refused, still unable to forgive him for his past actions. He went to the maze soon after and captured Goreene because he wanted to use him to power up his Energy Extractor, in order to draw out its energy safely. Every time the device is used, more of Goreene’s strength is taken away from him. That’s when the AO begin to realize that the Extractor is being fueled by a gold Bakugan like Goreene, which is why Masato came here to rescue him. Just then, Kazami soldiers arrive to arrest him, but he escapes, determined to save Goreene by breaking him out by force, with Shun going after him. Masato is stopped by the Kazami bodyguards who attempt to keep him from interfering with the Energy Extractor, causing a battle to commence between them. Shun confronts his father and demands to know why they are using Goreene as a power source for their Energy Extractor. Ichiro reveals that there is no other way, and that they need the machine in order to win against the Bakuzon. Shun is unconvinced that he would sacrifice a Golden Bakugan just for the survival of humanity. Masasto attempts to convince him that they can work with Goreene by believing in the power of Bakugan, finding it as the only way to see if he’ll come through to them. The rest of the AO soon arrive to help him free Goreene. China Riot becomes afraid that if they do this, the machine won’t work anymore, meaning that the Mega-Bakuzon will have regained the advantage. Wynton starts to believe that it can give them a fighting chance against Tiko, but Dan argues against the idea, saying that it’s not right. After defeating them, Masato breaks into the stronghold, but Ichiro attempts to stop him, trying to explain that they won’t be able to save anyone if he interferes with the Energy Extractor. He refuses to listen and continues to proceed further, but he still tries to stop him. Before he can attack Ichiro, Shun restrains him, much to everyone’s shock in the ensuing battle. Meanwhile, Tripp contacts Toshi, now infected with the V virus who has planted a bomb near the Energy Extractor, intending to destroy it along with Goreene.\n|LineColor        = 3198FF\n}}\n(US)December 29, 2019 (CAN)\n| AltDate = February 17, 2020\n| Viewers         = 0.18\n| ShortSummary    = During the ensuing struggle between Shun and Masato, Masato, who is confused begins to question Shun, thinking that he has chosen to protect the Energy Extractor instead of rescuing Goreene. Shun explains that when he saw his father like this when he was trying to stop him, he felt pain in his heart, which is why he had to take action and stop him from attacking him. Masato tells Shun to make a decision, to either help him, or Ichiro, leading him to hesitate over what to do as he starts to think about how much his friends care about him. Shun, having made his decision, and the rest of the AO confront Ichiro, telling him that using a Golden Bakugan like Goreene is wrong, saying that doing this would mean they won’t be able to live in a world where humans and Bakugan can live happily together in peace, and that they want to protect it for that reason. He demands that he release Goreene at once, but Ichiro is hesitant to do so, given the situation they’re in now. Shun assures him that everything will be fine, and that with the combined efforts of Goreene, the Kazami’s, and the AO, they can defeat anyone. Just then, they hear a loud noise and it is revealed that Toshi has caused heavy damage to the Extractor, and has already begun to do the same with the fortress. They also discover the Mega-Bakuzon heading towards them, now unaffected by the machine, including its infected comrades. Masato explains that they are orchestrating attacks from inside and outside the fortress, and that they should split up to deal with them. He instructs the AO to deal with the forces on the outside, while he deals with them on the inside with Shun deciding to accompany him. The AO attempt to hold off the Bakuzon and its army for as long as possible, but they are no match for their power levels as they are currently outmatched. Meanwhile, Toshi manages to destroy the Extractor in which Goreene falls out of. Just as he is about to destroy him, Shun and Masato arrive just in time to save him where Shun finds out that he is now infected with the V virus before disappearing, announcing their near victory beforehand. Masato approaches Goreene where he accuses him for being a traitor. Meanwhile, Ichiro tells the AO to fall back into the fortress for now since they’re having a hard time dealing with the Bakuzon army. The fortress begins to attack and restrain them using sticky ammo, giving the Brawlers enough time to head back inside. Ichiro announces that since the Energy Extractor is now destroyed, the fortress will soon fall, meaning that everyone will be turned into Bakuzon if it happens. Dan and the rest of the AO argue that they don’t want to give up this fight, but he says that they need a concrete solution fast in order to put an end to this madness. He orders an evacuation of the stronghold in order to prevent everyone from becoming Bakuzon. Ichiro contacts the AO and reveals that he intends to overload the old Core Cell Extractor, and hit them with that energy in order to buy them enough time to escape as he doesn’t want them to get caught. Soon the Bakuzon begin to emerge onto the fortress as the evacuation commences. The Extractor begins to overload as planned with Masato helping out, saying that he wants to finish what he started. Ichiro activates the overloaded Extractor, attacking the Bakuzon in the process to which the AO witness. Ichiro contacts them once more and begins to express his love towards Shun, saying that he’s always been proud of him, and how special he is. He tells him that he must continue down his own path while entrusting him with the Kazami name, and all that he has to offer; in reality, he wants Shun to lead the Kazami’s. He also assures him that although this responsibility is a great burden to him, it has protected and supported people for many years. He has since regretted all those times he was strict with him, and not being a good father, but Shun claims that it’s not true. Ichiro tells Shun that he is no longer alone, now that he has friends by his side before telling him that he must make his escape now, saying that they will meet again soon. After the AO depart, the stronghold explodes, seemingly destroying all Bakuzon in its path. Back at Dusk Industries, Tiko is thrilled that the Kazami’s, including its resistance have now fallen, knowing that nothing can stop him now.\n|LineColor        = 3198FF\n}}\n(US)January 5, 2020 (CAN)\n| AltDate = February 24, 2020\n| Viewers         = 0.23\n| ShortSummary    = Following the destruction of the Kazami stronghold, the AO become depressed by their personal loss, trying to figure out what to do next. China Riot becomes frustrated and encourages them that there is still a chance to defeat Tiko. Goreene tells them that they’ll never have that chance again. He becomes angry with the Brawlers, accusing them for capturing him and using his energy to power up the Energy Extractor. They apologize to him, saying that they didn’t know about it at first, and that they never should have relied on the Extractor as their last beacon of hope, giving him the right to be mad at them. Dan asks Goreene to fight with them in order to protect Vestroia and Earth, but he is hesitant to believe him. The Bakugan stand up to Goreene by defending their partners, saying that he shouldn’t reprimand them for their actions. Goreene decides to challenge the AO and Riot to a battle in order to prove themselves worthy enough to face Tiko. The Bakugan put up a good fight, but they are no match for him as he begins to outsmart them all. Despite Dan powering up, Goreene still defeats Drago, including the other Bakugan. Believing that the AO are useless to him now, thinking that they’ll just hold him back, Goreene returns to the maze to continue the fight to protect Vestroia, intending to do it by himself. Meanwhile, with the open source network nearly complete, Tiko still continues to interrogate Trhyno for the location of the “Great Core Cell,’’ but Trhyno refuses to tell him anything. Tiko says that the V virus will soon take control of him, and when it does, he will belong to him, and that he’ll be able to tell him everything that he needs to hear. Meanwhile, the AO become concerned about Goreene not being able to trust them as they want to protect both Earth and the Bakugan just as much as he wants to protect Vestroia too. Just then, Callous shows up, intending to destroy them once and for all. The AO battle him despite being worn out by their recent battle with Goreene, which gives the Bakuzon the upper hand. Callous reveals to them that Tiko will soon have the “Great Core Cell” because Trhyno is being held captive by him, and that he will soon tell them everything once he is fully corrupted by the V virus, much to their confusion. Just as the Bakugan are about to be defeated due to the damage that Goreene did to them, Magnus arrives and saves them. Having seen their video they have made and touched by its words has given him the strength and confidence needed to stand up to the Bakuzon. He then encourages Dan and his friends to not give up on this battle. The Bakugan boost their confidence as the AO become determined to win this battle for good in which they successfully defeat the Bakuzon, causing Callous to flee. In the end, the AO and their allies become determined to rescue Trhyno from Dusk Industries, no matter the cost.\n|LineColor        = 3198FF\n}}\n(US)January 5, 2020 (CAN)\n| AltDate = February 24, 2020\n| Viewers         = 0.23\n| ShortSummary    = Following the battle with Callous, the AO and their allies begin to work together to find a way into Dusk Industries so that they can save Trhyno. Shun locates a hole in their security while Wynton pulls up a map of the entire facility, sending the data to the other Brawlers to review as well in which they successfully locate Trhyno. Meanwhile, Callous apologizes to Tiko for accidentally revealing information about Trhyno to the AO, but Tiko says that it doesn’t matter anymore, as this will save him some time because a special project is in the works now. Meanwhile, the Brawlers sneak into Dusk Industries, only to find out that it’s not being guarded or anything. They start searching the facility for Trhyno, but they soon run into a group of Bakuzoned soldiers. Fleeing, they discover an elevator and enter it, escaping unharmed. They soon learn, much to their luck that they are headed to the room where Trhyno is being held. Heading inside, they find Trhyno in a very bad condition due to the virus, having gotten worse than last time. Gorthion and Cyndeous free him, but just as the Brawlers are about to escape with him, Tiko and his servants confront them. They soon realize that this was all a trap to lure them here. Dan instructs Gorthion and Cyndeous to protect Trhyno while they battle Tiko and his servants. Magnus becomes determined to stop him as he begins to recall the time that he possessed him, and made him do his bidding. Dan also joins in, including Wynton who is still determined to get Lupitheon back. During the battle, Tiko, deciding to put an end to this quickly powers up his servants Bakugan, giving them the upper hand. Dan and Magnus also power up, combining their attacks to deal with the opposing Bakugan. The rest of the AO prepare to power up too, but Tiko makes the Baku-cores disappear, leaving them at a disadvantage. Eventually, most of the Brawlers end up defeated. Currently outmatched, Shun calls for a retreat, but Dan refuses to do so. Shun activates the Mobile Gate, but it doesn’t work because Tiko has jammed its signal to prevent their escape. Dan theorizes that if they can defeat Tiko, they can put an end to everything; Magnus strongly agrees. Tiko decides to give them that chance, but despite Drago and Nillious’s titan evolution, they still aren’t powerful enough to defeat him. He orders Hydranoid to destroy Trhyno, but Cyndeous and Gorthion sacrifice themselves to protect him at the cost of them getting infected with the V virus, angering Dan. Trhyno tells the Brawlers to retreat, but Dan is hesitant to do so, still determined to defeat Tiko. Trhyno tells him that there still might be a way to end all of this when he opens up a gateway into the maze, instructing them to enter it now before his strength fails. The Brawlers head through the gateway, knowing that this is their only option. Tiko and his servants try to stop them, but they manage to escape unharmed. In the maze, Dan swears to get back at Tiko, no matter the cost.\n|LineColor        = 3198FF\n}}\n(US)January 12, 2020 (CAN)\n| AltDate = March 2, 2020\n| Viewers         = 0.21\n| ShortSummary    = After rescuing Trhyno from Dusk Industries, and heading deeper into the maze to recover, Pegatrix and Turtonium attempt to heal him, as well as Gorthion and Cyndeous from the V virus, but they run out of strength too quickly because it has turned out to be impossible to get rid of. Suddenly, Pyravian and Goreene arrive, having been summoned by Trhyno’s spirit that called out to them. They have also known about their recent fight with Tiko back on the surface world. Pyravian reveals that Tiko’s impact in the maze is starting to grow. Seeing a Bakuzon, she explains that the number of them have been increasing every time his strength and power grows. There were also Core Cells that even they were unable to protect. After Pyravian and Goreene deal with the Bakuzon, the Brawlers learn that the maze has become dangerous because of it. Dan asks Goreene to allow him and his friends to help him win this battle against Tiko, but he is hesitant to do so, but since they rescued Trhyno, he eventually agrees, knowing that he may have been wrong about them. Dan admits that they might have been useless after all because of the condition Trhyno is in now, including Cyndeous and Gorthion. Just then, Goreene and Pyravian use their abilities to fully heal them, eradicating the V virus completely, much to Dan and Lia’s delight. They become relieved that they finally have gotten their Bakugan back. Magnus states that they can use their abilities to fully heal Trhyno, but Pyravian says that it would be impossible to attempt because the infection is too powerful from within, and that they don’t have enough power to pull it off. Worried that there might be nothing they can do to help Trhyno, Pyravian says that there is one last thing they can try, in which she is not certain that it will work; the only way to fully heal Trhyno is by going inside his body, and destroying the V virus from within, much to the Brawler's shock. She and Goreene will then use their power to guide them through it. Dan and the Brawlers prepare to go in, but Pyravian explains that only one Bakugan can enter Trhyno’s body because his insides are delicate, and that it cannot risk multiple Bakugan battling from within. This leads to a negotiation between the Brawlers deciding who should go in. Despite Wynton having won, they learn that Trhyno has chosen Dan and Drago to help save him, without even explaining why. Meanwhile, with the open-source network complete at last, Tiko becomes frustrated that the Brawlers were able to escape into the maze with Trhyno. He becomes certain that the infection will fully corrupt him soon so that he will become his servant, and then he’ll be able to tell him the location of the “Great Core Cell.” Tripp reports to him that the Golden Bakugan are attempting to heal Trhyno in the maze with the help of the Brawlers. Determined to keep them from destroying the virus that’s inside of him, Tiko instructs him to stop them at all cost. Back in the maze, Goreene and Pyravian create a golden Drome that will allow Dan and Drago to enter Trhyno’s body. After they enter him, the Brawlers wish him good luck, hoping that they will succeed in healing Trhyno completely.\n|LineColor        = 3198FF\n}}\n(US)January 12, 2020 (CAN)\n| AltDate = March 2, 2020\n| Viewers         = 0.21\n| ShortSummary    = Dan and Drago travel inside Trhyno’s body in hopes of healing him from the V virus. They arrive at some place that looks like a temple and discover traces of the virus affecting him. It morphs into a Bakuzon, and they prepare to face it in order to save Trhyno at any cost. Outside, Goreene and Pyravian struggle to keep the Drome active while the Brawlers witness them facing a Bakuzon after Goreene gives them a visual to see through. Dan and Drago battle the virus, not wanting to risk any damage to Trhyno’s body. However, they are still unable to defeat it. Suddenly, they witness more of the virus coming out of the pillars, meaning that it’s deeper inside of Trhyno than they thought. One of the pillars falls, but Drago catches and holds on to it. Trying to find a way to fix the pillar, they are soon surprised when Trhyno appears and helps them. Back outside, Pyravian reveals to the Brawlers that they are being aided by his Antibody that is helping to destroy the virus from within. He has willed them all into a physical form to help them combat against it. Antibody Trhyno reveals that he has formed himself into that physical form due to his intense desire to destroy the V virus once and for all. Since Drago doesn’t have enough power to stabilize the pillar, Dan powers him up, giving him the strength needed to repair the damage. He then aids Antibody Trhyno into destroying the V virus; even if it won't go down that easily, they are still determined to get rid of it bit by bit. The Brawlers learn that Trhyno’s Antibody is struggling a bit, not to mention that Pyravian and Goreene are still struggling to keep the Golden Drome up for as long as possible due to the fact that it’s taking up a lot of their energy. Just then, Tripp shows up, intending to stop them from healing Trhyno completely. The Brawlers, determined to protect the Golden Bakugan and the Drome battle him and his army for as long as possible. Tiko watches the battle, hoping that Tripp will succeed in stopping them and the Golden Bakugan. Dan and Drago soon hear the voices of Pyravian and Goreene, and Antibody Trhyno assumes that something is happening to the Golden Drome. Attempting to destroy every last trace of the infection, they soon come face to face with a V virus version of Tiko. Antibody Trhyno battles him, but he proves to be too strong and infects him. Dan and Drago face Tiko in battle as well, but before they can attack him, Antibody Trhyno attacks them, having been corrupted by the V virus. Luckily, Dan manages to snap him out of it. Antibody Trhyno soon learns that if this keeps up, he’ll become Tiko’s servant. If he gives into the virus, the “Great Core Cell” will fall into his hands, meaning that it will lead to the destruction of Earth and Vestroia, including the Bakugan and all other lifeforms. Despite Dan encouraging him to fight back hard against Tiko, he infects him again, weakening him. Refusing to give in to Tiko, Antibody Trhyno reveals to Dan and Drago that he will use his own power to put an end to this for good. The inside of his body begins to crumble with the duo still trapped inside. Pyravian learns that Trhyno has triggered the deep hibernation process that destroys all Bakuzon, causing Tripp to flee. Even Tiko is shocked by this experience as well. Wondering what is really going on here, Pyravian confirms that Trhyno has triggered the deep hibernation process in order to fully heal himself.\n|LineColor        = 3198FF\n}}\n(US)January 19, 2020 (CAN)\n| AltDate = March 9, 2020\n| Viewers         = 0.20\n| ShortSummary    = Since Trhyno triggered the deep hibernation cycle, and that he is no longer in their presence, the Brawlers become worried about Dan and Drago still trapped inside his body. Meanwhile, Tiko becomes frustrated that Trhyno has placed himself in a deep hibernation in order to protect the “Great Core Cell.” from him. Tripp suggests that they keep searching for him in the maze while Brakken suggests that they infect another Golden Bakugan with the V virus, but Tiko dismisses their ideas, saying that they should install the program that will turn the Core Cells into a network. Back in the maze, the Brawlers are still worried about Dan and Drago still inside Trhyno’s body. They ask Pyravian to make another Golden Drome so that they can get them out of there, and she agrees, having become determined to save them as much as they do. She and Goreene attempt to make another Golden Drome, but fail because they have sustained damage from the previous battle with Tripp. Still, the Brawlers encourage them to not give up, and they continue to keep the Drome up for as long as possible. Still trying to figure out who will go in to help them, Magnus offers to go. However, the Golden Bakugan lose their grip on the Drome, meaning that they can’t save the duo now. Goreene reveals that when they put up the Drome, they learned something. Since Trhyno cannot be fully healed with Dan and Drago still inside, they don’t know their whereabouts, something that they have never experienced before. This leaves them at a standstill as they have no idea what to do on how to get them back. Meanwhile, with most of the Core Cells under Tiko’s control, and the network at near completion, all of the remaining Core Cells will soon become infected with the V virus, along with Vestroia as planned. Tiko activates the network that begins to infect all of the Core Cells from around the world. This begins to cause some friction from within the maze, and from around the world. Pyravian learns that Tiko has caused this, soon realizing that the Core Cells have all been infected with the V virus. The Brawlers soon learn that the open source network has been activated, which is how they were infected in the first place. Goreene tells Pyravian that they need to leave now in order to protect the “Great Core Cell” at any cost. Magnus offers to accompany them, much to the Golden Bakugan’s shock. He says that he only fights for himself, but he still wants to get revenge on Tiko. Wynton decides to go as well, including China Riot. Shun decides to head up to the surface and find out what Tiko and his army are planning, with Lia deciding to accompany him as well. After the Golden Bakugan and half the Brawlers leave, Lia instructs Lightning to wait for Dan and Drago should they ever return from Trhyno’s body. Shun and Lia then head through the gateway to their destination. Arriving in Los Volmos, they are shocked to discover an infected Core Cell in the sky, including those strange plants covering the buildings, the same ones like from the maze. Meanwhile in Trhyno’s body, Dan and Drago awaken, only to find themselves in an unfamiliar place.\n|LineColor        = 3198FF\n}}\n(US)January 19, 2020 (CAN)\n| AltDate = March 9, 2020\n| Viewers         = 0.20\n| ShortSummary    = Dan and Drago find themselves in an unfamiliar place while still inside Trhyno’s body. Trhyno soon appears in front of them and reveals that they are now in his inner world, created by his mind. He begins to explain that in order to escape the V virus, he chose to enter a deep hibernation process that will eventually heal him over time. Before his long slumber, he says that he used the last of his strength to bring them here. Since the virus has taken control of his body, it will take a long time for him to recover. Trhyno also reveals that he regained all of his lost memories, including the ones of Drago that he wants to show them, which makes him understand why he called for him, and why he guided them to this place. He then takes the duo on a journey through the past. First, Trhyno takes them to a memory of Vestroia that was once a separate planet in which the areas are exactly like the ones in the maze. He explains that the maze is the place where Earth and Vestroia merged together, which culminated in the “Great Collision.” Seeing a couple of Bakugan battling each other, Trhyno says that Vestroia is sustained by an energy cycle which is formed by Bakugan battles and Core Cells alike. However, the only Bakugan that didn’t agree with this system and tried to change it was Tiko. He then takes them to another memory where Dan and Drago see the Bakugan Council, consisting of Pyravian, Trhyno, Goreene, and Tiko (who used to be a Golden Bakugan) discussing the fate of Vestroia. They witness him arguing against the council members about the system, saying that sustaining a life force with an infinite amount of Bakugan battles is wrong, and that it must be changed. Since there are no other energy sources that can sustain Vestroia, Tiko reveals that he created his own energy source that will supply the Bakugan with a limitless amount of energy, preserve Vestroia’s life cycle, and save the Bakugan. It is revealed that the energy source he created is called the Victory Source, the origin of the V virus. Tiko uses the Victory Source on himself which turns him evil due to a miscalculation from his experiment, making him the Bakugan he is today. He then went on to infect every Bakugan with the V virus. Accessing another memory, they witness the remaining Bakugan fighting back against the Bakuzon, aided by a powerful ally, clad in Legendary Armor known as Dragonoid Maximus; in reality, Maximus is actually Dragonoid. Maximus and Tiko then battled each other, which was the greatest battle that anyone has ever seen before. He seemed to have the advantage, but because of their final battle, the Legendary Armor ended up destroyed, which allowed Tiko to escape. He then used his influence to infect not just the Bakugan, but the Core Cells as well. This was only a matter of time before Vestroia would fall into Tiko’s hands. He states that the V virus devours any kind of energy in its path, which will eventually lead to the end of all lifeforms if it were to gain control. In the Councils last act to save their dying planet, they decide to merge it with another planet, all while waiting for the revival of Vestroia and the Bakugan, which is why they have chosen Earth. Following the fusion process, the Core Cells, the Bakugan, and Tiko ended up falling into a deep hibernation along with Vestroia. Suddenly, Dan and Drago begin to witness a strange presence affecting the place their in now. Trhyno says that the dimension is closing in on itself because the last of his strength is failing. He encourages them to return to their world because they’re needed as always. Dan begins to feel something, including Drago. Knowing what they must do now, Dan unlocks his new power, with Drago fusing with the Legendary Armor, transforming himself into Dragonoid Maximus. Using his new abilities, Maximus opens up a gateway that will take them home. Before leaving, with Trhyno’s energy completely drained, he tells them that he must go and heal now, encouraging them to carry on the battle, while also entrusting them with the fate of the Bakugan and Vestroia. Dan and Maximus then head through the gateway, with Trhyno wishing them good luck. After leaving his body, Dan reunites with Lightning who has been waiting for them for a long time. They soon witness Trhyno entering his hibernation as he disappears. Wanting to know where the other Brawlers have gone to, including the Golden Bakugan, Pheadrus tells him that they’ve gone to protect the “Great Core Cell.” They decide to join them, but Dan says that they have to make a quick detour along the way because he needs to go see someone.\n|LineColor        = 3198FF\n}}\n(US)January 26, 2020 (CAN)\n| AltDate = March 16, 2020\n| Viewers         = 0.19\n| ShortSummary    = Masato, who has survived the explosion flees from a couple of Bakuzon. At one point, he attempts to shoot a tranquilizer at someone who’s riding on one of them, but fails to get a clear shot. They soon retreat afterwards while he carries on with his journey. Meanwhile, everyone begins to witness the different changes due to the infected Core Cell hovering over the city, including those plants everywhere, the same ones like in the maze. Shun believes that the maze and the surface world must have merged somehow. Because of the Core Cell connectors, all of them have been infected with the V virus. Tiko however is still not satisfied with this result, saying that every living thing on this planet should be infected as well. He becomes annoyed that the people are just acting like nothing is happening. He starts to believe that activating the system without the “Great Core Cell” led to an error. Meanwhile, Goreene, Pyravian, Wynton, Magnus, and China Riot arrive at the location where the “Great Core Cell” is located. Wynton recognizes the same temple that the AO recently discovered back on the Yucatan Peninsula, which is actually where the “Great Core Cell” was all along. Heading inside, they arrive too late as it is already infected with the V Virus. However, Pyravian reveals to the Brawlers that it’s not infected at all. Seeing it crack, Goreene tells them that it's not actually the “Great Core Cell.” Pyravian explains that they created a secret space in order to hide it away from anyone, so that it would be safe from all opposing threats. Goreene tells them that they put that Core Cell here to act as a gate so that no one would be able to figure out that there was ever a secret space behind it. Since it’s now corrupted with the V virus, it's only a matter of time before it disappears. Asking about what will happen if the gate vanishes, Pyravian reveals that the “Great Core Cell” will appear before them. The gate eventually shatters and the “Great Core Cell” soon appears in front of them. Tiko is informed of the signal and learns that it’s from the “Great Core Cell.” However, they are unable to infect it due to its immense power. He eventually becomes determined to claim it all for himself. Meanwhile, an unknown person flies over Los Volmos and locates Shun and Lia. They soon learn that the others have found the “Great Core Cell” which was in the temple all along. Just then, Shun is shocked to discover his father alive and well. However, he soon learns that he has become a Bakuzon. He explains that after the fortress exploded, he survived somehow, but the Mega-Bakuzon caught him and infected him. Determined to stop Ichiro and protect Shun, Lia battles him, taking it to the park in order to get the Bakuzon away from the people. However, he manages to defeat her quickly. Confronting his father, Shun knows that he’s not the same person as he was before because he would never stop caring about his company, but after realizing that it’s the V virus that's making him act like this, he becomes determined to defeat him at all cost. During the battle, he soon becomes outmatched, but Masato appears and saves him, much to Shun’s delight. He informs him of what happened to Ichiro after he escaped and becomes determined to stop him. Shun says that he wants to do this himself because he wants to save him more than anyone else. Remembering his father’s words and seeking to build a bright future for all Bakugan and humans, Shun successfully defeats Ichiro, leaving him in shock. Following that, Masato shoots a tranquilizer at him, putting him to sleep. Meanwhile, Shargo Ronin and Philomena discover that all of the Core Cells have been infected. Philomena says that they need to act fast before it’s too late. They are soon ambushed by a Bakuzon, but Dan and Drago manage to save them.\n|LineColor        = 3198FF\n}}\n(US)January 26, 2020 (CAN)\n| AltDate = March 16, 2020\n| Viewers         = 0.19\n| ShortSummary    = Following Ichiro’s defeat, Keiko and Koda inform Shun that they will take good care of him, promising that they won’t leave his side until the Bakuzon threat has passed. They reveal to him that before he gave in to the V virus, he used the last of his strength to get them to safety. Lia becomes worried about her mom, wondering if she’s okay. It turns out that Veronica is still reporting to everyone about the bizarre changes occurring throughout Los Volmos and the world. From afar, Dan tells Philomena and Shargo Ronin that the Core Cells all over the world have become infected with the V virus because of Tiko’s network system. He suggests to them that since AAAnimus makes Core Cell technology, they can destroy the system and take back all of them. Philomena says that even if they could pull it off, it still won’t cure the Core Cells. Drago begins to sense something and tells everyone that they need to go to the “Great Core Cell” at once, knowing that Tiko’s plan is to try and capture it. Shargo Ronin says that it’s too risky, and Philomena is uncertain that defeating Tiko will cure the infection completely. Reminiscing the previous battle where the Bakugan charged the Drome up with energy, Dan comes up with an idea that just might work. Meanwhile, Tiko prepares his army to invade the location of the “Great Core Cell,” determined to claim it at all cost. At the temple, the Golden Bakugan and the Brawlers set up defenses to slow Tiko’s forces down. If he captures the “Great Core Cell,” all is lost. Asking what the “Great Core Cell” is, Pyravian explains that it’s the mother of all the Core Cells, Vestroia, and the Bakugan, which acts as both a heart and a mind. It’s also trying to prevent the V virus from spreading any further, meaning that it must be protected at all cost. China Riot asks if having 2 Golden Bakugan at their side will be enough to defeat them, but Wynton is unsure about that. Meanwhile, Shun tells Masato that they’re going to go help the other Brawlers to protect the “Great Core Cell’ at any cost, but he still needs to find out what Tiko is planning first. Soon a large Bakuzon appears and attacks the people. Lia spots her mom in danger and saves her, instructing her to get to safety as always. The others attempt to destroy the Bakuzon, but have no luck doing so as it begins to reform itself. Masato reveals to Lia and Shun that it’s made up of V virus particles, and that the only way to defeat it is by destroying all of the virus. The Bakuzon gains the upper hand and restrains their Bakugan, but they are soon saved by “The Exit” team. Aay begins to explain that he didn’t want to get involved with the Core Cells at first. His former Exit team arrived and attempted to persuade him to come back to them, but he dismisses them at first. When they show them their Bakugan, having escaped the BRF recently, and remembering that he still has his, he eventually agrees to get back in the game with them. The Bakuzon recovers and continues to attack the Brawlers. Shun tells everyone that the only way to defeat it is to hit it all at once. Combining their attacks, they successfully defeat the Bakuzon. Lia and her mom share an amiable moment together, and she begins to ask her where she has been all this time, having been worried about her. Suddenly, everyone discovers Tiko’s forces already on their way to the “Great Core Cell,’’ and they become determined to regroup with the other Brawlers and help defend it. Shun opens a gateway and everyone heads through it. Before leaving, Lia attempts to persuade a confused Veronica that the Bakugan are not the problem, and then assures her that she’ll come home safely after she helps save the world with her friends and allies. Meanwhile, Philomena and Dan visit Kravitz who has hidden herself away from the outside world, out of fear of being infected with the V virus, asking for her help at once.\n|LineColor        = 3198FF\n}}\n(US)February 2, 2020 (CAN)\n| AltDate = March 23, 2020\n| Viewers         = 0.23\n| ShortSummary    = At the temple, the Brawlers and the Golden Bakugan await the arrival of Tiko’s forces, determined to protect the “Great Core Cell’’ at any cost. Wynton formulates an attack plan where Pyravian will provide cover from the sky while Goreene defends the Core Cell from the entrance. Since there are not enough Brawlers to help out, they are soon surprised when Shun, Masato, and Lia arrive to help, as well as “The Exit”. Masato tells Goreene that he wants to redeem himself by helping to defend the “Great Core Cell” alongside him until the very end, which he accepts. In their sadness, the AO wish that Dan was here as well, still believing that he and Drago are still trapped inside Trhyno’s body. Meanwhile, with Tiko and his forces nearing the location of the “Great Core Cell,” he discovers the Brawlers' defenses already set up. Tripp formulates an attack plan directly from the front, with a route up to the entrance, saying that any other plan would limit the number of Bakugan used. Tiko agrees, saying that they’ll hit the Golden Bakugan from the front, and then land all airships close to the temple. He becomes determined to claim both Earth and Vestroia for himself after he claims the “Great Core Cell.” Back at the temple, Pyravian spots Tiko’s army approaching them. At one point, the AO decide to film their final battle live so that everyone will be able to see it for themselves because it will show them that they won’t give up, and that they’re going to win this battle once and for all. The Bakuzon begin to approach the temple, with the Brawlers preparing to defend it at any cost, all while putting up a good fight. At one point, Magnus, remembering his promise to Dan back in the Core Cell decides to fight for him, determined to protect everything. Meanwhile, everyone worldwide begins to watch the AO’s final battle in action, encouraging them to keep fighting. Soon the temple becomes overrun with Bakuzon, leaving the Brawlers currently outmatched. Some of them break through the entrance, but Goreene stands his ground and attempts to stop them. However, Hydranoid sneaks up from behind and attacks him. Tiko appears and says that he eventually found out about their trick, and that he knew that the Core Cell they found at the temple was a ruse. He then attacks Goreene and starts to infect the “Great Core Cell” with the V virus. Part 2: Tiko begins infecting the “Great Core Cell” with the V virus, with the process already underway. The Brawlers soon become outmatched as they are unable to defeat the Bakuzon. Luckily, Dan and Drago manage to save them, much to their happiness. He tells everyone that Trhyno saved them by using the last of his remaining power, and that Drago has regained all of his memories, including his true name, Maximus. Tiko brushes his words off, saying that the V virus is spreading through the “Great Core Cell” as we speak, and that all he has to do now is wait until it is fully corrupted. He decides to battle them so that no one will ever stand in his way again. Dan successfully transforms Drago into Maximus, much to everyone’s shock due to his immense power, and prepares to face him. Maximus gains the upper hand on Hydranoid, showing off his true power, leaving him overmatched. This gives the AO enough strength and confidence needed to defeat his servants, leaving Tiko completely shocked. Philomena arrives and says that she has done her part; now it’s up to Shargo Ronin and his team to do theirs. Seeing Hydranoid, she reveals to Dan that she and Benton found their own Bakugan (Hydranoid and Apollyon) when they were just children. Determined to stop Tiko for good since he awakened Hydranoid and started controlling him like that, Philomena battles him, which starts to anger him. At one point, Maximus manages to defeat Hydranoid, knocking him unconscious to begin with. Dan then instructs Pyravian and Goreene to do their part. They create a Golden Drome around Hydranoid in an attempt to cleanse him of the V virus for good, which also begins to have an effect on Tiko as well, with Magnus theorizing that the cleansing energy must be flowing through the Bakugan, and into the Brawler. Luckily, they manage to free Benton from Tiko’s control completely. Enraged, Tiko rises up, determined to finish off Maximus once and for all.\n|LineColor        = 3198FF\n}}\n(US)February 9, 2020 (CAN)\n| AltDate = March 30, 2020\n| Viewers         = 0.27\n| ShortSummary    = Maximus faces Tiko in the final battle for the fate of Earth and Vestroia. Tiko reveals that he’s still waiting for the V virus to take over the “Great Core Cell’’ completely, and that he is still determined to take down Maximus for good. Their battle begins to shake the Earth as they are both evenly matched. When Aay asks about what will happen if the “Great Core Cell” becomes fully corrupted by the V virus, Pyravian reveals that its immense power will belong to Tiko, then the virus will come pouring out from all the Core Cells, meaning that all life on this planet will fall under his control. Once that happens, it will then consume every last drop of energy, leaving only ruin. In the midst of the battle, since Maximus regained his title and power, Tiko decides to show off his true form when he starts absorbing the Bakuzon, thereby turning himself into a Mega-Bakuzon. The AO’s Bakugan begin to recognize it from their dream, the same one that nearly pushed them and Vestroia to the brink of destruction. Tiko gains the upper hand with his true form, taking out Masato and “The Exits” Bakugan to begin with. Maximus proves to be no match for Tiko because of the immense power of his true form, and as a result, he destroys the Legendary Armor yet again. Just when all hope seems to be lost, Philomena informs Dan that the preparations are now complete. He then asks Lia to film him. Broadcasting live, Dan asks every Brawler worldwide to “look to the skies” because the fate of all Bakugan and the world depends on it. It is revealed that Dan, Shargo Ronin, Philomena, and Kravitz went to Dusk Industries, reclaimed all of the Bakugan that were confiscated worldwide, and recruited some of their friends and allies to help return them to their human partners. He then encourages them to start having Bakugan battles with their friends now because he’s going to need every single one of them to help save the world. Soon the kids begin to set up multiple Drome’s worldwide, with all of them combining into one huge Drome, which begins to cover the entire planet. Shun begins to realize that he’s attempting to use the energy created by the Drome, including the Bakugan battles to help cure the Core Cells of the V virus on a massive scale. Benton becomes confused on how it is really possible for the Drome to give off such energy like this. Pyravian explains that it’s because of the “Great Core Cell.” It may still be infected with the V virus, but it’s using the last of its uninfected power to push the Core Cells to do the same. More than that, the Drome is starting to grow big and powerful because of all the energy being produced by all those Bakugan battles, which are also being powered by all the children of the world, including their Bakugan. Soon the entire planet becomes encased in one huge Drome, much to Tiko’s shock. Borrowing some of everyone's power, Dan restores the Legendary Armor, transforming Drago into Maximus yet again. Because of the power of the children worldwide and their Bakugan, this allowed Maximus to rejoin the battle once again. The final battle then commences between Maximus and Tiko, to decide the fate of Earth and Vestroia, with Dan preparing to give it their all.\n|LineColor        = 3198FF\n}}\n(US)February 9, 2020 (CAN)\n| AltDate = March 30, 2020\n| Viewers         = 0.27\n| ShortSummary    = The fate of Earth and Vestroia rests in the hands of the final battle between Maximus and Tiko. Refusing to admit defeat, Tiko begins absorbing the energy from the “Great Core Cell,” giving him the upper hand. Nevertheless, the Brawlers continue to fight back, determined to save both Earth and Vestroia. They use their own energy, as well as the energy from every Bakugan and Brawler worldwide to pull off one final attack, in which they successfully defeat Tiko. Just when things seem to be over, the Brawlers, much to their shock discover that Tiko has been fully cleansed of the V virus, revealing himself as a Golden Bakugan from long ago. Tiko explains that all he wanted was to free the Bakugan from the shackles of endless battling. The Bakugan Council weren’t able to understand his motives, saying that they didn’t take him seriously like he thought they would, which is why he created the V virus in the first place. Suddenly, the remnants of the virus corrupt him once again because it is deep within him. Knowing that Tiko had the whole situation all wrong, Dan reveals to him that Bakugan battles tie people together with Bakugan, becoming their energy, their fate, and their bond. Tiko charges towards Maximus in a very last attempt to destroy him, but he and Dan pull off one final attack and vanquish him for good. Following Tiko’s defeat, Earth is now restored when the plants begin to disappear, and the Core Cells begin to cleanse themselves of the V virus, including the “Great Core Cell” itself. Tripp, Toshi, Brakken, and Callous also become free from the virus as well. Even Lupitheon returns to Wynton at last. Suddenly, the Brawlers witness Tiko still here, only this time, he is now preparing to go into a deep hibernation for a long time. Before going into his long slumber, Tiko advises the Brawlers to continue to live in peace with Bakugan because it is their destiny. The world becomes at peace again where on the news, Veronica reveals that teams of specialists are working to investigate the source behind these worldwide events. During a press conference, Benton apologizes to everyone for the trouble he has caused to the world and its people on behalf of his company. In order to regain their trust, he announces that Dusk Industries has pledged itself to work solely for the betterment of Bakugan, as well as their partnership with humankind, making it his life’s mission to ensure a peaceful future for all Bakugan and humans alike. Elsewhere, Ichiro makes a full recovery and mends his relationship with Masato. With Earth and Vestroia saved at last, things have returned to normal following the event: Strata is released from Dusk Industries following his recovery, \"The Exit\" are still together, the kids continue to battle with their Bakugan as part of their enjoyment, Brakken continues to get stronger so that he will be ready to face anyone in a Bakugan battle, China Riot seems to be happy, Philomena regains control of AAAnimus, and Emily has successfully recovered from her illness, much to Magnus’s delight. Back at the site where the “Great Collision” took place, with the V virus completely destroyed, Pyravian tells the AO that she and Goreene will continue to protect the Core Cells because that’s what the Golden Bakugan do. When Dan asks if Tiko will do the same as well, she says that he won’t be because he is already in the process of healing just like Trhyno. However, their spirits live on, helping all of them. The Golden Bakugan say goodbye to the AO as they leave through the gateway to continue their mission. Following their departure, they begin to reminisce on everything that they’ve been through when they first discovered the Bakugan. In the final scene, Dan announces that their adventure has now come to an end. The AO begin to wonder what awaits them in the future as they will meet new people, make new friends, and have new adventures, saying that an ending is just the start of a new beginning.\n|LineColor        = 3198FF\n}}\n|}\nBakugan: Armored Alliance (2020–21)\nBakugan: Geogan Rising (2021)\nBakugan: Evolutions (2022)\nBakugan: Legends (2023)\nSmall Brawl Stories\n\"Bakugan Battle Planet Short Anime\"|lead=yes}}, originally known as Bakugan: Beyond the Brawl, is a series of animated web-shorts that feature the characters from the show interacting in a more comedic manner. It is streamed on YouTube through a variety of official sources. In English, the series is made available through the Bakugan, Cartoon Network and Teletoon channels, as well as Amazon Prime Video. The shorts are also aired as an interstitial program on some of the linear channels that run the series.\nIn Japan, the series is streamed on the Japanese-language Bakugan YouTube channel, as well as CoroCoro Comic's. A compilation of the shorts were aired on TV Tokyo and other TX Network stations on July 1, 2019, as an \"extra\" episode of the Battle Planet television series. A second special ran on October 7, 2019.\nShorts\n{| class=\"wikitable plainrowheaders\" width=\"100%\" style=\"margin-right: 0;\"\n|-\n! style=\"background-color: #000000; color:#ffffff;\"|No.\n! style=\"background-color: #000000; color:#ffffff;\"|English Title Japanese title\n! style=\"background-color: #000000; color:#ffffff;\"|Release date\n! style=\"background-color: #000000; color:#ffffff;\"| Japanese air date\n|-\n}}\n| AltDate         = April 18, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n| AltDate = August 1, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n|AltDate = May 16, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n|AltDate = May 30, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n|AltDate = June 6, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n|AltDate = August 1, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n|AltDate =August 15, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n| AltDate = August 15, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = August 29, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n| AltDate = June 13, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n| AltDate = August 29, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n| AltDate = June 20, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n| AltDate = June 27, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n| AltDate = November 7, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n| AltDate = July 4, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n| AltDate = September 12, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n| AltDate = September 12, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n}}\n| AltDate = November 7, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = October 10, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = October 31, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = July 11, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = July 18, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = September 19, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = November 21, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = November 21, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = July 25, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = August 8, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = August 22, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = September 5, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = September 26, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = October 3, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = November 15, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = November 28, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = December 6, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = December 12, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = December 19, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = December 26, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = January 2, 2020\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = January 10, 2020\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = January 17, 2020\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = January 24, 2020\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = January 31, 2020\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = February 7, 2020\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = February 14, 2020\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = February 21, 2020\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = February 28, 2020\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = March 5, 2020\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = March 12, 2020\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = October 24, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n| AltDate = October 17, 2019\n|ShortSummary =\n|LineColor = 000000\n}}\n|}\nCompilations\n{| class=\"wikitable plainrowheaders\" width=\"100%\" style=\"margin-right: 0;\"\n|-\n! style=\"background-color: #000000; color:#ffffff;\"|No.\n! style=\"background-color: #000000; color:#ffffff;\"|Japanese title\n! style=\"background-color: #000000; color:#ffffff;\"|Japanese air date\n|-\n|}\nHome releases\nEnglish\n{| class=\"wikitable\" style=\"text-align: center; width: 98%;\"\n|+ Warner Bros. Home Entertainment (North America, Region 1)\n|-\n! Volume\n! Episodes\n! Release date\n! style=\"width:5%;\"| Ref.\n|-\n| rowspan=\"21\" | Origin of Species\n| 1a–13b\n| October 22, 2019\n|\n|}\nJapanese\n{| class=\"wikitable\" style=\"text-align: center; width: 98%;\"\n|+ Liverpool (Japan, Region 2)\n|-\n! Volume\n! Episodes\n! Release date\n! style=\"width:5%;\"| Ref.\n|-\n| DVD-BOX Vol. 1\n| 1a-13b\n| January 24, 2020\n|\n|-\n| DVD-BOX Vol. 2\n| 14a-26b\n| February 21, 2020\n|\n|-\n| DVD-BOX Vol. 3\n| 27a-37b\n| March 27, 2020\n|\n|-\n| DVD-BOX Vol. 4\n| 38a-50b\n| May 22, 2020\n|\n|}\nNotes\nReferences\nExternal links\n*"
    }
  ]
}