{
  "content": [
    {
      "type": "text",
      "text": "# List of massacres in the Democratic Republic of the Congo\n\nThis is a list of massacres in the Democratic Republic of the Congo in reverse chronological order.\nList of massacres from 1890 to current\n{| class=\"wikitable sortable\"\n!Name\n!Date\n!Fatalities\n!Location – Circumstances\n|-\n|Kasanga massacre\n|12 February 2025\n|70+\n|North Kivu, Lubero Territory – At least 70 Christian civilians were abducted by Allied Democratic Forces (ADF) militants that entered the village of Mayba. They were executed by beheading via machetes and their bodies were discovered on February 14 in a Protestant church in Kasanga.\n|-\n|2025 Djaiba massacre\n|9–10 February 2025\n|55+\n|Ituri Province, Djaiba group of villages and Djaiba refugee camp –  CODECO attacked a refugee camp and villages. At least 33 adults and 18 children were killed.\n|-\n|2023 Goma massacre\n|27 or 30 August 2023\n|56\n|North Kivu, Goma – Protestors were shot dead by defence and security force personnel.\n|-\n|2023 LALA camp massacre\n|11 June 2023\n|46\n|Ituri Province, Djugu territory, near Bule, LALA refugee camp – An attack on the camp killed 46 displaced people, including 23 children. People were killed with guns and machetes, or burned alive in their tents.\n|-\n|2023 April massacres\n|April 2023\n|~250\n|Ituri Province (Djugu, Irumu and Mambasa territories), North-Kivu (Beni and Lubero territories) – 250 civilians were killed in separate attacks on their villages in one month.\n|-\n|Kirindera massacre\n|12 March 2023\n|19\n|North Kivu, Beni Territory, Kirindera\n|-\n|Mukondi massacre\n|8–9 March 2023\n|39-44\n|North Kivu, Mukondi\n|-\n|Makugwe massacre\n|}}\n|17-24\n|North Kivu, Makugwe\n|-\n|Kishishe massacre\n|21–30 November 2022\n|131-300+\n|North Kivu, Rutshuru Territory, Bwito Chiefdom\n|-\n|North Kivu attacks\n|August 25 and 30, 2022\n|54+\n|North Kivu\n|-\n|Otomabere massacre\n|}}\n|18-27\n|Ituri Province, Irumu Territory, Otomabere – Suspected Allied Democratic Forces attack.\n|-\n|Masambo attack\n|April 3–4, 2022\n|29\n|North Kivu, Masambo\n|-\n|Plaine Savo massacre\n|}}\n|60\n|Ituri Province, Djugu territory\n|-\n|Makutano massacre\n|September 3, 2021\n|30+\n|North Kivu, Oicha Territory, Makutano\n|-\n|Drodro massacre\n|}}\n|44\n|Ituri Province, Djugu territory, Drodro (refugee camp)\n|-\n|Kasanzi attack\n|August 28, 2021\n|19\n|North Kivu, Beni Territory\n|-\n|Maimoya highway massacre\n|}}\n|16\n|North Kivu, Beni Territory, highway between Mayi-Moya and Chani-chani\n|-\n|Boga and Tchabi massacres\n|May 30 and 31, 2021\n|57+\n|Ituri Province, Boga and Tchabi\n|-\n|Bulongo massacre\n|March 15, 2021\n|15+\n|North Kivu, Beni Territory, Bulongo\n|-\n|Mwenda massacre\n|January 4, 2021\n|23\n|North Kivu, Beni Territory, Mwenda\n|-\n|Tingwe massacre\n|December 31, 2020\n|30+\n|North Kivu, Tingwe\n|-\n|Lisasa massacre\n|October 31, 2020\n|21\n|North Kivu, Beni Territory, Lisasa\n|-\n|Kipupu massacre\n|}}\n|18-220\n|South Kivu, Mwenga Territory, Kipupu\n|-\n|Ndjala massacre\n|May 17, 2020\n|22+\n|Ituri Province, Ndjala, Hema village\n|-\n|April 2020 Virunga National Park massacre\n|\n|17\n|North Kivu, Virunga National Park\n|-\n|Oicha massacres\n|January 28–30, 2020\n|73+\n|North Kivu, Oicha Territory, Mamove, Mantumbi, Manzingi, and other towns west of Oicha\n|-\n|2018 Yumbi massacre\n|\n|890+\n|Mai-Ndombe Province, Yumbi, Bongende, Nkolo and Camp Nbanzi\n|-\n|Beni massacre\n|}}\n|101\n|North Kivu, Beni\n|-\n|Masisi massacre\n|January and February 2014\n|70+\n|North Kivu, Masisi area, three villages – Civilians were executed with machetes and their villages burnt to the ground.\n|-\n|2014 Mutarule attack\n|}}\n|35\n|South Kivu, Mutarule, near Luberizi\n|-\n|Makombo massacre\n|\n|321-345\n|Haut-Uele District, Makombo – Attack by the Christian terrorist Lord's Resistance Army.\n|-\n|2008 Christmas massacres\n|\n|620-860+\n|Haut-Uele District – Attack by the Christian terrorist Lord's Resistance Army.\n|-\n|Kiwanja massacre\n|\n|150\n|North Kivu – Perpetrated by the National Congress for the Defence of the People.\n|-\n|Bogoro massacre\n|\n|200+\n|Ituri Province, Bogoro\n|-\n|Effacer le tableau\n|October 2002 to January 2003\n|60,000-70,000\n|Ituri Province, Mambasa and the Ituri rainforest\n|-\n|Kisangani massacre\n|\n|183\n|Tshopo, Kisangani\n|-\n|Mouyounzi massacre\n|April to June 1998\n|300\n|\n|-\n|Butembo massacre\n|From February 20 to April 1998\n|300-600\n|Butembo – Reprisals for Mayi Mayi attacks by Congolese Armed Forces.\n|-\n|Makobola massacre\n|From December 30, 1998, to January 2, 1999\n|800+\n|South Kivu, Makobola – The forces of the Rally for Congolese Democracy (Rassemblement Congolais pour la Démocratie; RCD) perpetrated a massacre, resulting in the death of over 800 civilians, predominantly from the Bembe community.\n|-\n|Kasika massacre\n|}}\n|1,000+\n|South Kivu, Mwenga Territory, Kasika – Massacre of Nyindu during the Second Congo War. The figure of 1,000 was estimated by the United Nations Mapping Report. The massacre was actually a series of massacres that began with the killing of 36 Nyindu civilians inside a Catholic church by Rwanda, Ugandan, or Banyamulenge forces.\n|-\n|Massacres of Hutus during the First Congo War\n|1996-1997\n|200,000-233,000\n|Kivu (Zaire)\n|-\n|Chimanga camp massacre\n|November 17, 1996\n|300+\n|South Kivu, Bukavu, Chimanga refugee camp – Rwandan and Burundian Hutu refugees were killed by 40 rebels.\n|-\n|Musekera massacre\n|}}\n|300\n|Rutshuru district, Musekera – Three hundred Hutu civilians were bludgeoned to death by Rwandan soldiers.\n|-\n|Lemera massacre\n|October 6, 1996\n|37\n|South Kivu, Lemera – 37 individuals, including FAZ (Forces Armées Zaïroises) soldiers, nurses, patients, and Zairean civilians who were in the vicinity of the Lemera hospital, were killed by the forces of the Alliance of Democratic Forces for the Liberation of Congo (AFDL).\n|-\n|\n|\n|14,000+\n|North Kivu, Walikale territory, Masisi territory, Rutshuru territory – Initially starting in the town of Mtutu, as an anti-Banyarwanda massacre by Hunde and Nyanga people, Banyarwanda fought back, starting an ethnic conflict that killed 14,000 people. Ntoto market massacre killed 500 people.\n|-\n|Mokoto monastery massacre\n|}}\n|750\n|North Kivu, Mokoto monastery – 750 Tutsi refugees hiding in a monastery were slaughtered by Hutu forces.\n|-\n|Luamwela massacre\n|\n|50\n|Kasaï-Oriental, Luamwela – Killing of 50 miners by the Congolese army and the Societé Minière de Bakwanga.\n|-\n|Katelakayi massacre\n|}}\n|140-200\n|Katelakayi – Killing of at least 140 miners by the Congolese army and the Societé Minière de Bakwanga. Some reports said that over 200 miners had died.\n|-\n|Battle of Kolwezi\n|\n|Hundreds\n|Lualaba Province, Kolwezi – The Congolese National Liberation Front massacred hundreds of White European civilians during Shaba II, mostly Belgians.\n|-\n|Congo massacre\n|\n|8+\n|Tshopo Province, Stanleyville and  Haut-Uele Province, Paulis – Four Protestant missionaries, four Spanish nuns, and an unknown number of Catholic priests were brutally murdered by Simba rebels during the Simba rebellion. See also: Operation Dragon Rouge\n|-\n|Kindu atrocity\n|\n|13\n|Congo-Léopoldville – Murders of 13 Italian airmen by soldiers during the Congo Crisis.\n|-\n|Port Francqui incident\n|\n|47\n|Kasai province, Port Francqui (Ilebo)\n|-\n|1961 Luluabourg massacre\n|\n|44\n|Luluabourg – The New York Times reported that 44 civilians had been killed by government forces in revenge for the killing of three soldiers by rioters.\n|-\n|1959 Luluabourg massacre\n|\n|300+\n|Luluabourg – By Lulua people against Baluba people.\n|-\n|Léopoldville riots\n|January 1959\n|49+\n|Belgian Congo\n|-\n|Elisabethville Massacre\n|\n|30-70\n|Katanga Province\n|-\n|1911 Hema massacre\n|4 December 1911\n|200+\n|Ituri Province – By Lendu people against Hema people.\n|-\n|Belgian Mission - Congo Genocide\n|1890–1910\n|10–15 millions\n|Congo Free State – By King Leopold II, the constitutional monarch of Belgium, against African Congolese people. In the 19th century, Leopold II tried to persuade the government to colonize certain areas of Africa. Under the pretext of humanitarian purposes, he managed to legally own the Kongo Kingdom. The new name given to the colonized Kongo Kingdom was Congo Free State.See also: Atrocities in the Congo Free State\n|}\nSee also\n* Lists of Democratic Republic of the Congo attacks\n* Attacks on humanitarian workers\n* Dongo conflict\nReferences\nExternal links\n*\n*"
    }
  ]
}