{
  "content": [
    {
      "type": "text",
      "text": "# List of presidents of ABC News\n\nThe following is a list of presidents of the news division for the American Broadcasting Company television network.\n{| class=\"wikitable\"\n|-\n!Name\n!Years\n!Notes\n|-\n|John Charles Daly\n|1953–1960\n|During the 1950s, Daly became the vice president in charge of news, special events, and public affairs, religious programs and sports for ABC and won three Peabody Awards. From 1953 to 1960, he anchored ABC News broadcasts and was the face of the network's news division, even though ''What's My Line? was then on competing CBS. In addition, he provided the voice of a Conelrad radio announcer on the May 18, 1954 broadcast of The Motorola Television Hour on ABC entitled Atomic Attack, which showcases a story about a family in a New York City suburb dealing with the aftermath of an H-bomb attack fifty miles away. At the time, this was a very rare instance of a television personality working on two different US broadcast TV networks simultaneously. (Daly did not work for CBS but for the producers of What's My Line?'', Goodson-Todman Productions. He also filled in occasionally on NBC's The Today Show, making Daly one of the few people to work simultaneously on all three networks.) One of his most memorable days as host of the Today Show was when Harpo Marx was guest. He was promoting his book \"Harpo Speaks\". Harpo completely destroyed Daly. Daly tried to get back some sense of normalcy, but to no avail. Daly was completely convulsed in laughter.  His closing line on the ABC Newscast was \"Good night, and a good tomorrow.\" Daly resigned from ABC on November 16, 1960, after the network preempted the first hour of 1960 presidential election night coverage to show Bugs Bunny cartoons and The Rifleman from 7:30 to 8:30 pm while CBS and NBC were covering returns from the Kennedy–Nixon presidential election and other major races. In an accompanying article on the same page, however, it was stated that the reason for his resignation was the decision of the then-president of ABC, Leonard Goldenson, to bring in Time Inc. to co-produce documentaries that had previously been under Daly's direction for the network.\n|-\n|James Hagerty\n|1961–1963\n|\n|-\n|Elmer Lower\n|1963–1974\n|Lower was named president of ABC News in 1963. During his tenure, he was responsible for hiring Peter Jennings, Ted Koppel, Frank Reynolds, and Sam Donaldson.  In that time, the news division grew from 250 to 750 employees, and the evening news expanded from 15 minutes to 30 minutes\n|-\n|William Sheehan\n|1974–1977\n|\n|-\n|Roone Arledge\n|1977–1997\n|In 1977, ABC made Arledge president of the then low-rated network news division, all while Arledge retained control of the Sports Division.  ABC News had at the time been in the middle of blunders such as the disastrous pairing of Barbara Walters with Harry Reasoner at the desk of the network's evening news.  The previous year, ABC had lured Walters away from NBC's Today Show for $1,000,000. Previous to that time, the only news experience Arledge had was providing ABC's coverage of the tragedies during the '72 Olympics in Munich.  Other than that, he had no other major experience in news. Arledge's first major creation for ABC was 20/20, which premiered in June 1978. The first iteration of this program fared badly, and resulted in the firing of the original hosts, with Hugh Downs chosen as the new anchor beginning the second week of the program, with the above-mentioned Barbara Walters joining Downs the following year, eventually becoming Downs' co-anchor by 1981. Shortly thereafter, Arledge reformatted the network's evening newscast with many of the splashy graphics he had developed at Wide World of Sports, and created World News Tonight. The program was unique not only because it was anchored by three newsmen, but because each of them was located in separate cities. The lead anchor became Frank Reynolds, who was based in Washington, with Max Robinson based out of Chicago, and Peter Jennings reporting from London. The program expanded to weekends in 1979. In 1983, Reynolds died of bone cancer, and Robinson departed the network, and ABC made Jennings the sole anchor of World News Tonight on September 5, 1983. Jennings anchored the broadcast until April 5, 2005, when he announced that he had been diagnosed with lung cancer, to which Jennings would succumb on August 7, 2005. In 1979, the U.S. Embassy in Tehran, Iran was taken over by Iranian students, creating the Iranian Hostage Crisis.  And on November 4, 1979, Frank Reynolds began anchoring a series of special reports entitled America Held Hostage.  Several nights later, Ted Koppel, then the network's Diplomatic correspondent to the U.S. State Department, took over as anchor.  The special reports led to the creation of Nightline, which premiered on March 24, 1980. Koppel anchored the broadcast with Chris Bury, and served as its managing editor.  Koppel retained the position until his retirement in November 2005. In 1981, Arledge brought David Brinkley to ABC from NBC, and created the Sunday-morning affairs program This Week for Brinkley.  Brinkley would retire from the program in 1996. The last major news program created during Arledge's reign at ABC News was Primetime Live, in 1989.  The program was originally anchored by Sam Donaldson and Diane Sawyer. In 1986, Arledge stepped down as president of ABC Sports. That same year, ABC's World News Tonight began a ten-year domination of the network news ratings. In 1998, Arledge retired from ABC News.\n|-\n|David Westin\n|1997–2010\n|He was president of ABC News (from March 6, 1997, through December 3, 2010), responsible for all aspects of ABC News’ television broadcasts, including World News with Diane Sawyer, Nightline, Good Morning America, 20/20, Primetime, This Week with Christiane Amanpour, and World News Now, and ABC News Radio. During his tenure, ABC News received eleven George Foster Peabody Awards, 13 Alfred I DuPont Awards, four George Polk Awards, more than 40 News and Documentary Emmys, and more than 40 Edward R. Murrow Awards. On September 6, 2010, Westin announced he would retire from ABC, but would remain until the end of the year to give the company time to find a replacement. One news report said Westin was forced out by Disney CEO Robert Iger, but others reported that he had decided to pursue other interests—with one saying that he \"got to announce his departure on his own terms\".\n|-\n|Ben Sherwood\n|2010–2015\n|From 1989 to 1993, Sherwood was an Associate Producer and a Producer for ABC News' Primetime (then called PrimeTime Live) with hosts Diane Sawyer and Sam Donaldson. During that time, Sherwood was part of the ABC News Team that came under sniper fire in Sarajevo, Bosnia in August 1992. In April 2004, Sherwood was the Executive Producer of the ABC's Good Morning America, and on December 3, 2010, Sherwood was appointed President of ABC News in New York. In January 2015, Sherwood was named President of Disney-ABC Television Group, and Co-Chairman of Disney Media Networks. Following the Disney acquisition of Fox in March 2019, Sherwood departed the company.\n|-\n|James Goldston\n|2014–2021\n|In April 2014, Goldston became the President of ABC News, reaching the role after just ten years at the network. He replaced Ben Sherwood, who was promoted to a senior role within Disney. He was at that point one of two Britons in charge of the Big Three television networks in the US, alongside Deborah Turness who was until 2017 the President of NBC News. At the time he also formed a British executive duo at ABC, alongside ABC Entertainment president (and BBC alum) Paul Lee. At the time of his appointment, Goldston was labelled as having \"something of a Midas touch\" in the press after taking each broadcast he led (Nightline, GMA, and This Week) to the top spot for viewership, and with GMA enjoying \"its best performance in 20 years.\" In 2016, a letter was written to Goldston by journalists who were requesting reforms to improve the treatment of black candidates in hiring decisions. HuffPost sources described that Senior Vice President for Talent and Business at ABC Barbara Fedida intervened to join a meeting on the topic, a meeting which the group went on to describe as \"tense\". Mara Schiavocampo later accused Fedida of \"racial discrimination\", but later agreed a financial settlement including \"a nondisclosure and nondisparagement agreement.\" In June 2020 Goldston placed Fedida, who first joined the company in 1989, on \"administrative leave\" after a HuffPost report which alleged an \"extensive history\" of \"insensitive and racist remarks.\" In response to her suspension Fedida released a statement through her attorney describing the accusations as \"heartbreaking and incredibly misleading.\" She was fired on 21 July 2020. On January 28, 2021, Goldston in an internal memo, announced that he was stepping down from his post at ABC News. The Los Angeles Times Stephan Battaglio reported that the announcement of Goldston's exit came six months after the ouster Barbara Fedida. Goldston himself, had been rumored to have been on his way out since Fedida officially parted ways with ABC in July 2020.\n|-\n|Kimberly Godwin\n|2021–2024\n|In April 2021, Godwin was named president of ABC News making her both the first African-American person and first African-American woman to lead a major broadcast news network.\n|-\n|Almin Karamehmedovic\n|2024-Present\n|}\nReferences"
    }
  ]
}