{
  "content": [
    {
      "type": "text",
      "text": "# List of World War II electronic warfare equipment\n\nThis is a list of World War II electronic warfare equipment and code words and tactics derived directly from the use of electronic equipment.\nThis list includes many examples of radar, radar jammers, and radar detectors, often used by night fighters; also beam-guidance systems and radio beacons. Many of the British developments came from the Telecommunications Research Establishment (TRE). No. 100 Group RAF and No. 101 Squadron RAF both specialized in electronic warfare, and many of these devices were fitted to de Havilland Mosquitos of 100 Group and Avro Lancasters of 101 Squadron. A substantial number of the American radar systems originated with the MIT Radiation Laboratory, nicknamed the \"Rad Lab\".\nEquipment and code words\n* Abdullah – British radar homing system for attacking German radar sites - carried by rocket-armed Typhoons for Operation Overlord.\n*  Aircraft interception (AI) radar) – Night fighter radar.\n* Airborne Cigar (A.B.C.) – Combination of high-speed scanner and three high-power transmitters. Operator would watch the scanner for broadcasts in the typical night fighter MF and VHF radio bands (VHF low band, roughly 37 MHz to 49 MHz - including frequencies used for Close Air Support), if one was seen on the CRT, they would tune it and see if it was indeed an operator. If so, one of the three jammers would put out a warbling tone on that frequency, making verbal instructions impossible.  Carried by 101 Sqn Lancasters based at Ludford Magna and from March 1945 by 462 Sqn RAAF, operating from RAF Foulsham. These aircraft carried an 8th crew member.\n* Airborne Grocer – British 50&nbsp;cm radar jammer against early (B/C and C-1) UHF band Lichtenstein - see also Grocer/Ground Grocer.\n* Alberich – German anti-ASDIC rubber coating for U-boat hulls - tested on U-67.\n* ASDIC – British sonar system used for hunting U-boats.\n* Aspidistra - transmitter station used for Corona, q.v.\n* Aspirin – British Knickebein VHF navigation jammer (30-33 MHz)\n* ASH – Air to Surface H or AI Mk XV (U.S AN/APS-4). centimetric airborne air-to-air radar derived from ASV operating at 3&nbsp;cm wavelength at a frequency of 10&nbsp;GHz. Used by 100 Group Mosquitos; FAA Fairey Firefly, postwar in the Sea Hornet N.F. Mark 21.\n* ASV – Air to Surface Vessel radar. A 1.5 metre (200 MHz) VHF radar that could detect surfaced submarines at up to 36 miles.\n* Beam Approach Beacon System (BABS) ARI TR3567 - British blind-landing system using the Eureka beacon.\n* Benjamin – British Y-Gerät jammer - see also Domino.\n* Berlin, German Funkgerät (FuG) 240 night fighter radar, introduced April 1945, centimetric (microwave) frequency radar (9&nbsp;cm/3&nbsp;GHz).\n* Boozer – ARI R1618 fighter radar early warning device fitted to British bombers.\n* Bremenanlage - FuG 244/245, German omnidirectional airborne search (AEW-capable) radar (experimental only).\n* Bromide – British X-Gerät jammer.\n* Bumerang - German codename for Oboe-guided Mosquitoes when detected on Flammen radar - 'boomerang', from curved track flown\n* BUPS - Beacon Ultra Portable S-band, AN/UPN-1.\n* Carpet – tunable Würzburg gun laying radar jammer - from TRE; US version built as AN/APT-2.\n* Cigar (later \"Ground Cigar\") – earlier ground-based version of Airborne Cigar.\n* Corona – 100 Group radio transmissions using German-speaking personnel, later Women's Auxiliary Air Force (WAAFs) for spoof controlling of German night fighters to confuse German counter-attacks.\n* Chaff – shorter-length Window for use against possible German development of microwave radar, e.g. Berlin.\n* Chain Home radar – British land-based early warning radar used during the Battle of Britain - from TRE.\n* Düppel – German radar countermeasure called chaff in the US or Window in Britain.\n* Darky – British backup homing system: the pilot could be talked back to his home base by HF voice radio on 6440 kHz / 6.440&nbsp;MHz\n* Diver – Integrated RAF and Royal Observer Corps system for intercepting German V1 flying bombs in flight.\n* Domino – British Y-Gerät jammer - see also Benjamin.\n* Egerland – German fire-control radar-linked Marbach and Kulmbach systems, only two built by 1945\n* Egon - German bomb-targeting system using the Erstling IFF system and two Freya radar ground stations for bomb-aiming.\n* [https://medium.com/raf-caps/mischief-night-allied-radar-spoofing-operations-5-6-june-1944-d-day-4f83001f67db Elephant Cigar] - Allied Ground based Communications Jammer designed to jam German fighter communications during operation Overlord. This was built on a site 'near Brighton' but was not used.\n* Eureka – portable homing beacon system - ground transmitter - see also Rebecca.\n* Filbert –  naval barrage balloon fitted with internal  radar reflector, for Operation Glimmer and Operation Taxable.\n* Flammen – German plotting system for detecting Oboe-equipped Pathfinder Mosquitos.\n* Funk-Gerät — German prefix-phrase for nearly all their military avionics system designations, translated as \"radio equipment\" and abbreviated as FuG.\n* Fishpond – British fighter warning radar add-on to H2S, fitted early 1944 to some bombers.\n* Flensburg – FuG 227, German radar detector fitted to night fighters to detect the British Monica tail warning radar transmissions.\n* Freya – German ground based air search radar.\n* G–H – British radio navigation system used for blind bombing, from TRE.\n* GEE – British radio navigation system forerunner of LORAN, from TRE.\n* Grocer (later \"Ground Grocer\") – ground-based version of Airborne Grocer.\n* Gufo radar – Italian naval search radar (official designation EC3/ter) employed by the Regia Marina. Operational from 1942 to 1943.\n* H.F. D/F (High Frequency Direction Finding). – provided a radio position fix for the RAF up to 100 miles from the transmitters in Britain. The system was based on voice communications and was used for aircraft to find their home bases. With the development of GEE, its primary function ceased but it remained in use until the end of the war as a backup system and a communications system between aircraft and their bases.\n* H2S – British ground mapping radar to see target at night and through cloud cover - from TRE.\n* H2X – American 10 GHz ground mapping radar, higher frequency development of British H2S. Equivalent to S-band H2S Mark III.\n* High Tea – British sonobuoy used by RAF Coastal Command in 1944.\n* Himmelbett – German controlled night fighter method.\n* Hohentwiel – FuG 200, German UHF airborne radar optimized for maritime patrol use, named for Hohentwiel, an extinct volcano in south-western Germany.\n* Hookah – ARI R1625/R1668 British jammer-homer operating on 490&nbsp;MHz (to jam the Germans' FuG 202 and 212 AI radars) and 530–600Mhz.\n* Huff-Duff – Allied HF/DF High Frequency Direction Finding.\n* Identification Friend or Foe (IFF) – means of identifying possible enemy aircraft detected on Chain Home early warning system using transponder fitted in RAF aircraft - from TRE.\n* Jackal - Allied airborne jammer for tank radios\n* Jay beams – were introduced partly as a deception to help to confuse the Germans over the use of GEE. It was nevertheless just as useful as a homing beacon. A number of transmitters, from Lossiemouth to Manston in Kent transmitted on slightly different frequencies transmitted a narrow beam across the North Sea using a S.B.A. (Standard Beam Approach) transmitter, receivers for-which were fitted to all British bombers and could be received over a range of 350 miles at 10,000 feet. Once a bomber found a beam it could fly down it back to Britain. In late 1943, all but two beams were closed with the final two shutting down towards the end of 1944 because GEE could do the job better and their use to deceive the Germans was by now redundant.\n* Jostle – 2.5kW airborne jamming transmitter carried in sealed bomb bays of 100 Group Fortresses, from TRE.\n* Kehl –  series of German aircraft-mounted, [http://www.wehrmacht-history.com/images/luftwaffe/missiles/henschel-hs-293-joystick-anti-ship-missile-4.jpg joystick interface] radio control transmitter sets, designated FuG 203, for use in MCLOS operation of Hs 293 and Fritz X weapons, its signals were received by the FuG 230 Straßburg units in the ordnance. Named after Strasbourg, France and Kehl, one of its German suburbs.\n* Kettenhund – German jammer of the Eureka beacon.\n* Knickebein – German dual beam VHF low band (multiple frequencies in the 30 MHz - 33 MHz band) radio navigation aid, used early 1940.\n* Kulmbach – German targeting radar based on Marbach - linked with Marbach to form Egerland.\n* Lichtenstein – German UHF (B/C and C-1 versions), later VHF (SN-2 version) night fighter radar, introduced 1941/1942, with both versions compromised after July 1944.\n* Lorenz – German VHF blind-landing system consisting of approach guidance beam (33 MHz band) and marker beacon system (38 MHz).\n* LORAN – American navigation aid.\n* Lucero – British homing system carried by some Mosquitos for homing-in on Kettenhund jammers (Eureka jammer), from TRE.\n* Mandrel – jammer for Freya early warning radar used by 100 Group, from TRE. US version built as AN/APT-3.\n* Marbach – German microwave ground-based search radar, c. 1945.\n* Metox – metre-wavelength ASV radar detector fitted to German submarines\n* Meacon – Masking BEACON - British long wave jamming station - see Meaconing.\n* M.F. D/F (Medium Frequency Direction Finding) - provided a radio position fix for the RAF up to 230 miles from the transmitters in Britain. The system was based on voice communications.\n* Mickey — American nickname for their H2X 10&nbsp;GHz band blind bombing radar\n* Monica tail warning radar – British 300 MHz frequency fixed rearward-pointing radar fitted to British bombers to warn of attacking fighters - American designation AN/APS-13.\n* Moonshine – ARI TR1427 British airborne spoofer/jammer installed in 20 modified Boulton Paul Defiants (No. 515 Squadron RAF) to defeat Freya, from TRE.\n* Naxos – FuG 350, German H2S detection and homing device, not capable of detecting the Americans' similar, higher frequency (10&nbsp;GHz) H2X radar.\n* Neptun – FuG 216, -217 & -218, German high-VHF-band (125 to 187&nbsp;MHz) night fighter AI radar, introduced mid/late 1944, generally used the Hirschgeweih antenna setup of Lichtenstein VHF-band radar sets with shorter dipole elements, as a replacement for the compromised Lichtenstein SN-2 90&nbsp;MHz AI equipment.\n* Newhaven – target marking blind using H2S then with visual backup marking, from Newhaven, East Sussex.\n* Oboe – British twin beam navigation system, similar to Knickebein but pulse-based.\n* Parramatta – target marking by blind dropped ground markers - prefixed with 'musical' when Oboe-guided - from Parramatta, New South Wales.\n* Perfectos – device carried by night fighting Mosquitos for homing-in on German nightfighter radar transmissions and triggering IFF.\n* Ping-Pong – ground-based direction finder accurate to a quarter degree, three of them could be used to make a  plotting system for triangulating German radar site positions, allowing them to be attacked and disabled immediately prior to Overlord.\n* Piperack – airborne jamming transmitter carried by a lead aircraft that produced a cone of jamming behind it, within which the following bomber stream could shelter, carried by 100 Group Fortresses and Liberators, from TRE.\n* Pip-squeak – \"Huff-Duff\" IFF system used by the RAF in the Battle of Britain, to track fighter squadrons in the air.\n* Rebecca – portable radio beacon system - airborne receiver - see also Eureka\n* Roderich – German 4W radar jammer for use against H2S.\n* Rope – extended-length Window suspended from a small parachute; dropped by aircraft of 218 and 617 Squadrons to deceive German Seetakt coastal radar during  Operation Glimmer and Operation Taxable.\n* Seetakt – a shipborne radar developed in the 1930s and used by Nazi Germany's Kriegsmarine, later improved into Freya air search radar.\n* Serrate – British radar detection and homing device, used by night fighters to track down German night fighters with early UHF-band versions of Lichtenstein.\n* Shiver – first attempts at jamming Würzburg using ground transmissions.\n* Tinsel – British technique of transmitting amplified engine noise on German night fighter voice frequencies to hinder them.\n* Village Inn - British radar-aimed Automatic Gun-Laying Turret (AGLT) fitted to some Lancasters in 1944 - from TRE.\n* Wanganui – target marking by blind-dropped sky markers when ground concealed by cloud - prefixed with 'musical' when Oboe-guided - from Wanganui, New Zealand.\n* Window – strips of aluminium foil dropped to flood German radar with false echoes - from TRE.\n* Würzburg – German ground based air search radar.\n* X-Gerät - German VHF (60 MHz band) multiple beam guided blind bombing system, replaced earlier systems that were being jammed.\n* Y-Gerät – German VHF low (45 MHz) single beam guided blind bombing system, also known as Wotan.\nTactics\n* Bomber stream – British tactical formation of aircraft based principally on trail-in-line, open structured flights to overcome the Kammhuber Line.  The open structure countered swarm attacks.\n* Gardening – RAF operations dropping mines in strategic sea lanes, usually at the request of the CoS Naval Liaison Officer based at High Wycombe. As a spinoff, Bletchley Park cryptanalysts used German reports of Gardening activities as cribs in the decryption of Enigma messages.\n* Kammhuber Line – British name for the German Himmelbett radar controlled air defence system.\n* Operational research – the statistical analysis of results and anomalies, some caused by the use of previously unknown German electronic equipment or tactics based on the equipment.\n* Wilde Sau (Wild Boar) – German freelance night fighters, i.e. not parked round a visual beacon like the Zahme Sau (Tame Boar) fighters.\n* Zahme Sau (Tame Boar) – German tactic of guiding a night fighter 'parked' round a visual beacon, onto the incoming bomber stream by radar-assisted ground commentary.\nSee also\n* List of World War II British naval radar\n* List of Japanese World War II radars\n* Glossary of German military terms\n* Battle of the beams\n* Signal Corps Radio (SCR)\n* Air Ministry Experimental Station (AMES)\n* [https://medium.com/raf-caps/mischief-night-allied-radar-spoofing-operations-5-6-june-1944-d-day-4f83001f67db Mischief Night: Allied Radar Spoofing Operations] 5–6 June 1944, D-Day\nNotes\nReferences\n*\nExternal links\n* [http://home.btconnect.com/gmb/airequip.htm Air Ministry equipment numbers]"
    }
  ]
}