{
  "content": [
    {
      "type": "text",
      "text": "# List of best-selling singles of the 1970s in the United Kingdom\n\nWings had the biggest-selling hit of the 1970s with \"Mull of Kintyre\"/\"Girls' School\", the first single in the UK to sell more than two million copies.]]\nSingles are a type of music release that typically have fewer tracks than an extended play or an album. Throughout the 1970s the UK Singles Chart was compiled by the British Market Research Bureau (BMRB) from the sales data of a representative panel of record shops across the country, starting with about 250 shops at the beginning of the decade and increasing to around 450 stores by 1979. The \"panel sales\" data from each shop were then posted to the BMRB every week and a multiplication factor was then applied to obtain an estimate of total sales across the country.\nThis procedure led to several problems with the collection of accurate data: the ease with which the panel sales data could be tampered with resulted in repeated accusations of chart rigging or hyping (culminating in an investigation by the ITV current affairs programme World in Action broadcast in August 1980, which found evidence that the record label WEA had been guilty of chart manipulation); some stores simply forgetting to return their data some weeks; postal strikes in the early 1970s meaning data could not be sent back to the BMRB; and every year only one set of data was collected over the two-week Christmas and New Year period each. As this was normally the busiest sales period of the year, it meant many records that were high in the charts over Christmas \"lost\" large numbers of sales. Some record companies also claimed higher sales figures for their records by quoting the amounts shipped to record shops instead, although these did not necessarily reflect the sales within those shops.\nProducing an accurate list of the best-selling singles of the 1970s in the United Kingdom has therefore never been a simple task because of the difficulty in obtaining accurate sales data from the period. An official chart of the best-selling singles of the 1970s was produced by the BMRB and broadcast on the UK's national pop music radio station BBC Radio 1 on 31 December 1979. However, this chart is no longer considered accurate due to the method of data collection by the BMRB and has since been superseded.\nThe 19 September 2009 issue of the UK music trade magazine Music Week included a special supplement to celebrate its 50th anniversary. It included updated charts of the top twenty best-selling singles of each decade of the magazine's existence, based on the most recent information available from the Official Charts Company (OCC). The following chart is therefore the most up to date estimate of the top twenty best-selling singles of the 1970s, with sales figures for the top ten up until the end of 1979 as estimated by the OCC.\nBetween 1970 and 1979, fourteen different singles sold more than one million copies each in the UK. The biggest-selling single of the decade was \"Mull of Kintyre\" by the British band Wings. Released in November 1977, the song became Christmas number one and the first single ever to sell more than two million copies in the UK.\nBest-selling singles\nBoney M. released two of the top four biggest songs of the 1970s.\n{|class=\"wikitable sortable plainrowheaders\"\n!scope=col |\n!scope=col |Title\n!scope=col |Artist\n!scope=col |Year\n!scope=col |Estimatedsales\n|-\n!scope=row style=\"text-align:center;\"| 1\n| \"Mull of Kintyre\"/\"Girls' School\"\n| Wings\n| style=\"text-align:center;\" | 1977\n| style=\"text-align:center;\" | 2,050,000\n|-\n!scope=row style=\"text-align:center;\"| 2\n| \"Rivers of Babylon\"/\"Brown Girl in the Ring\"\n| Boney M.\n| style=\"text-align:center;\" | 1978\n| style=\"text-align:center;\" | 1,985,000\n|-\n!scope=row style=\"text-align:center;\"| 3\n| \"You're the One That I Want\"\n|  and Olivia Newton-John\n| style=\"text-align:center;\" | 1978\n| style=\"text-align:center;\" | 1,975,000\n|-\n!scope=row style=\"text-align:center;\"| 4\n| \"Mary's Boy Child\"\n| Boney M.\n| style=\"text-align:center;\" | 1978\n| style=\"text-align:center;\" | 1,790,000\n|-\n!scope=row style=\"text-align:center;\"| 5\n| \"Summer Nights\"\n|  and Olivia Newton-John\n| style=\"text-align:center;\" | 1978\n| style=\"text-align:center;\" | 1,515,000\n|-\n!scope=row style=\"text-align:center;\"| 6\n| \"Y.M.C.A.\"\n| Village People\n| style=\"text-align:center;\" | 1978\n| style=\"text-align:center;\" | 1,380,000\n|-\n!scope=row style=\"text-align:center;\"| 7\n| \"Bohemian Rhapsody\"\n| Queen\n| style=\"text-align:center;\" | 1975\n| style=\"text-align:center;\" | 1,300,000\n|-\n!scope=row style=\"text-align:center;\"| 8\n| \"Heart of Glass\"\n| Blondie\n| style=\"text-align:center;\" | 1979\n| style=\"text-align:center;\" | 1,180,000\n|-\n!scope=row style=\"text-align:center;\"| 9\n| \"Bright Eyes\"\n|\n| style=\"text-align:center;\" | 1979\n| style=\"text-align:center;\" | 1,150,000\n|-\n!scope=row style=\"text-align:center;\"| 10\n| \"Don't Give Up on Us\"\n|\n| style=\"text-align:center;\" | 1976\n| style=\"text-align:center;\" | 1,145,000\n|-\n!scope=row style=\"text-align:center;\"| 11\n| \"I Love You Love Me Love\"\n|\n| style=\"text-align:center;\" | 1973\n|\n|-\n!scope=row style=\"text-align:center;\"| 12\n| \"Merry Xmas Everybody\"\n| Slade\n| style=\"text-align:center;\" | 1973\n|\n|-\n!scope=row style=\"text-align:center;\"| 13\n| \"Save Your Kisses for Me\"\n| Brotherhood of Man\n| style=\"text-align:center;\" | 1976\n|\n|-\n!scope=row style=\"text-align:center;\"| 14\n| \"Eye Level\"\n| Simon Park Orchestra\n| style=\"text-align:center;\" | 1972\n|\n|-\n!scope=row style=\"text-align:center;\"| 15\n| \"Long Haired Lover from Liverpool\"\n|\n| style=\"text-align:center;\" | 1973\n|\n|-\n!scope=row style=\"text-align:center;\"| 16\n| \"Another Brick in the Wall (Part 2)\"\n| Pink Floyd\n| style=\"text-align:center;\" | 1979\n|\n|-\n!scope=row style=\"text-align:center;\"| 17\n| \"Don't Cry for Me Argentina\"\n|\n| style=\"text-align:center;\" | 1976\n|\n|-\n!scope=row style=\"text-align:center;\"| 18\n| \"I'd Like to Teach the World to Sing\"\n|\n| style=\"text-align:center;\" | 1971\n|\n|-\n!scope=row style=\"text-align:center;\"| 19\n| \"Tie a Yellow Ribbon Round the Ole Oak Tree\"\n| Dawn featuring Tony Orlando\n| style=\"text-align:center;\" | 1973\n|\n|-\n!scope=row style=\"text-align:center;\"| 20\n| \"Under the Moon of Love\"\n| Showaddywaddy\n| style=\"text-align:center;\" | 1976\n|\n|}\nPrevious charts\nRecord Business chart (mid–1979)\nThe first attempt to create a list of the best-selling singles of the decade was produced by Record Business and published in the BPI Year Book 1979. Record Business was a short-lived chart statistics company – headed by Barry Lazell, its staff included Alan Jones, who would become the leading authority on UK chart statistics and sales for the next thirty years. The BPI Year Book chart was a list of the biggest-selling singles in the UK for the period 1960-79: although it was published midway through 1979, the list includes the year's two biggest selling singles, \"Bright Eyes\" by Art Garfunkel and \"Heart of Glass\" by Blondie. Stripping out the songs from the 1960s, the remaining 16 songs in the list, in order, were:\n# \"Mull of Kintyre\"/\"Girls' School\" – Wings\n# \"Rivers of Babylon\"/\"Brown Girl in the Ring\" – Boney M.\n# \"You're the One That I Want\" – John Travolta and Olivia Newton-John\n# \"Mary's Boy Child\" – Boney M.\n# \"Summer Nights\" – John Travolta and Olivia Newton-John\n# \"Y.M.C.A.\" – Village People\n# \"Bright Eyes\" – Art Garfunkel\n# \"Bohemian Rhapsody – Queen\n# \"Heart of Glass\" – Blondie\n# \"I Love You Love Me Love\" – Gary Glitter\n# \"Don't Give Up on Us\" – David Soul\n# \"Eye Level\" – Simon Park Orchestra\n# \"Save Your Kisses for Me\" – Brotherhood of Man\n# \"Long Haired Lover from Liverpool\" – Little Jimmy Osmond\n# \"Merry Xmas Everybody\" – Slade\n# \"I'd Like to Teach the World to Sing\" – The New Seekers\nBMRB official chart (December 1979)\nIn December 1979 the BMRB produced the official lists of the 100 biggest selling singles and albums of the 1970s. The lists were published in the issue of Music Week dated 22 December 1979 and the singles list was reproduced in ''The Guinness Book of Hits of the 70's the following year. All 100 singles and a track from each of the top 100 albums were played on BBC Radio 1 on 31 December 1979 between 6 a.m. and 7 p.m. As these lists were published before the end of 1979, it is assumed that the cut-off date was the week ending 8 December 1979, and consequently the lists are missing sales from the last three weeks of the decade. The single that lost out most as a result of this decision was \"Another Brick in the Wall (Part 2)\" by Pink Floyd, which was the current number one in the singles chart and selling strongly: it would go on to pass one million sales the following month.\nAlmost immediately chart followers began to point out the inconsistencies in the BMRB list, with Alan Jones describing it as \"a farce\" in his weekly column for the music magazine Record Mirror'' in the issue dated 9 February 1980. The biggest surprise was the placing of Rod Stewart's \"Sailing\" at number four, ahead of several singles that had already been certified million sellers before the end of 1979 – \"Sailing\" itself was not certified to have sold a million copies until 2010, more than two decades later. Jones pointed out that the BMRB had calculated its chart based purely on the panel sales data, rather than actual sales data figures, and consequently sales for singles that had sold well over the Christmas period had been underestimated. The 1978 Christmas number one, \"Mary's Boy Child\", already certified to have sold over a million copies by the end of 1978, was at number 16, behind several songs that have still not reached the million sales mark as of 2022. Meanwhile, \"Merry Xmas Everyone\", which Jones calculated had sold 989,000 copies by the end of the 1970s and which was certified a million seller just nine months after the chart was produced, was only at number 67. Although the BMRB list remains the only \"official\" chart of the decade, it has since been widely discredited as unreliable.\nThe BMRB top twenty for the 1970s was:\n# \"Mull of Kintyre\"/\"Girls' School\" – Wings\n# \"Rivers of Babylon\"/\"Brown Girl in the Ring\" – Boney M.\n# \"You're the One That I Want\" – John Travolta and Olivia Newton-John\n# \"Sailing\" – Rod Stewart\n# \"Save Your Kisses for Me\" – Brotherhood of Man\n# \"I'd Like to Teach the World to Sing\" – The New Seekers\n# \"Summer Nights\" – John Travolta and Olivia Newton-John\n# \"Don't Give Up on Us\" – David Soul\n# \"Bohemian Rhapsody\" – Queen\n# \"Under the Moon of Love\" – Showaddywaddy\n# \"Mississippi\" – Pussycat\n# \"My Sweet Lord\" – George Harrison\n# \"Bright Eyes\" – Art Garfunkel\n# \"Don't Go Breaking My Heart\" – Elton John and Kiki Dee\n# \"Amazing Grace\" – The Pipes and Drums and Military Band of the Royal Scots Dragoon Guards\n# \"Mary's Boy Child\" – Boney M.\n# \"Tie a Yellow Ribbon Round the Ole Oak Tree\" – Dawn featuring Tony Orlando\n# \"If You Leave Me Now\" – Chicago\n# \"Y.M.C.A.\" – Village People\n# \"Don't Cry for Me Argentina\" – Julie Covington\nMRIB chart (January 1980)\nRecord Business produced its own rival list of the best-selling singles of the 1970s for the BMRB's chief competitor, the Market Research Information Bureau (MRIB). This chart was broadcast on Capital Radio (the leading UK independent radio station of the time) on 1 January 1980, the day after the BMRB/Radio 1 chart. Although the chart was unsurprisingly similar to the Record Business list that had appeared in the BPI Year Book just a few months before, there were still some changes.\nThe Record Business/MRIB top twenty for the 1970s was:\n# \"Mull of Kintyre\"/\"Girls' School\" – Wings\n# \"Rivers of Babylon\"/\"Brown Girl in the Ring\" – Boney M.\n# \"You're the One That I Want\" – John Travolta and Olivia Newton-John\n# \"Mary's Boy Child\" – Boney M.\n# \"Summer Nights\" – John Travolta and Olivia Newton-John\n# \"Y.M.C.A.\" – Village People\n# \"Save Your Kisses for Me\" – Brotherhood of Man\n# \"Bohemian Rhapsody\" – Queen\n# \"Heart of Glass\" – Blondie\n# \"Don't Give Up on Us\" – David Soul\n# \"Bright Eyes\" – Art Garfunkel\n# \"I Love You Love Me Love\" – Gary Glitter\n# \"Long Haired Lover from Liverpool\" – Little Jimmy Osmond\n# \"Eye Level\" – Simon Park Orchestra\n# \"Don't Cry for Me Argentina\" – Julie Covington\n# \"I'd Like to Teach the World to Sing\" – The New Seekers\n# \"Tie a Yellow Ribbon Round the Ole Oak Tree\" – Dawn featuring Tony Orlando\n# \"Under the Moon of Love\" – Showaddywaddy\n# \"Merry Xmas Everybody\" – Slade\n# \"Hit Me with Your Rhythm Stick\" – Ian Dury and the Blockheads\nReferences"
    }
  ]
}