{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1838\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1838.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland).  For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign.  Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\".  Acts passed from 1963 onwards are simply cited by calendar year and chapter number.\nAll modern acts have a short title, e.g. the Local Government Act 2003.  Some earlier acts also have a short title given to them by later acts, such as by the Short Titles Act 1896.\n1 & 2 Vict.\nContinuing the first session of the 13th Parliament of the United Kingdom, which met from 15 November 1837 until 16 August 1838.\nPublic general acts\n}}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  as authorizes Magistrates to commit to Gaols or Houses of Correction Persons who are apprehended under Circumstances that denote a Derangement of Mind and a Purpose of committing a Crime; and to make other Provisions for the safe Custody of such Persons.}}\n|  }}\n|  }}\n|  }}\n|  }}\n|  for the Abolition of Slavery in the British Colonies.|note4= }}\n|  }}\n|  }}\n|  }}\n|  }}\n| |note4= }}\n|  for extending the Period for the Repayment of Loans made under an Act passed in the Fourth and Fifth Year of His said late Majesty for the Amendment and better Administration of the Laws relating to the Poor in England and Wales.|note4= }}\n|  }}\n|\n|\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  to restrain for Five Years, in certain Cases, Party Processions in Ireland.|note4= }}\n|  }}\n|\n|\n|  for punishing idle and disorderly Persons and Rogues and Vagabonds.|note4= }}\n|  to Two Conventions with the King of the French, for suppressing the Slave Trade.|note4= }}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n|  for regulating the Admission of ; and to provide for the taking of Special Bail in the Absence of the Judges.|note4= }}\n|  for providing for the Government of His Majesty's Settlements in Western Australia on the Western Coast of New Holland.|note4= }}\n|  }}\n|\n|\n|  for the Administration of Justice in New South Wales and Van Diemens Land.|note4= }}\n|\n|  for the Regulation of the Linen and Hempen Manufactures in Ireland.|note4= }}\n|  for providing more effectual Means to make Treasurers of Counties and Counties of Cities in Ireland account for Public Monies, and to secure the same.}}\n|\n|\n| or the Irish Poor Law Act 1838|public|56|31-07-1838|archived=n|An Act for the more effectual Relief of the destitute Poor in Ireland.}}\n|\n|\n|\n|  |page=158 |date=1998}}|public|60|31-07-1838|archived=n|An Act to amend an Act of the Fourth and Fifth Years of His late Majesty empowering His Majesty to erect South Australia into a British Province or Provinces.|note4=}}\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|  in relation to granting Tacks and making Excambions by Heirs of Entail.|note4= }}\n|  }}\n|  }}\n|  }}\n|\n|  as relates to Manufactories of Pitch, Tar and Turpentine.}}\n|\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|\n|  }}\n|  to Two Conventions with the King of the French for suppressing the Slave Trade.|note4= }}\n|  }}\n| or the Court of Session Act 1838|public|86|10-08-1838|archived=n|An Act to diminish Delay and  in Advocations and Suspensions in the Court of Session in Scotland.}}\n|\n|\n|  }}\n|  }}\n|  of the Disembodied Militia in Great Britain and Ireland; and to grant Allowances in certain Cases to Subaltern Officers, Adjutants, Paymasters, Quartermasters, Surgeons, Assistant Surgeons, Surgeons Mates, and Serjeant Majors of the Militia, until the First Pay of July One thousand eight hundred and thirty-nine.|note4= }}\n|  }}\n|  }}\n|\n|\n|\n|\n|  }}\n| , and of forfeited Recognizances , in Ireland; and for the Application and Distribution thereof.}}\n|  }}\n|\n|  for authorizing Her Majesty to carry into immediate Execution by Orders in Council any Treaties made for the Suppression of the Slave Trade.|note4= }}\n|  }}\n|  }}\n|  }}\n|\n|\n|  }}\n| or the Tithe Commutation Act 1838|public|109|15-08-1838|archived=n|An Act to abolish Compositions for Tithes in Ireland, and to substitute Rent-charges in lieu thereof.}}\n|\n|  }}\n| |note4= }}\n|\n| or the Personal Diligence Act 1838|public|114|16-08-1838|maintained=y|archived=n|An Act to amend the Law of Scotland in Matters relating to Personal Diligence, Arrestments, and Poindings.}}\n|  for the uniform Valuation of Lands and Tenements in Ireland, and for incorporating detached Portions of Counties and Baronies with those Counties and Baronies respectively whereto the same may adjoin or wherein the same are locally situate.}}\n| or the County Institution (Ireland) Act 1838|public|116|16-08-1838|archived=n|An Act to facilitate Advances out of County Monies for the Support of County Gaols and Institutions in Ireland.}}\n|\n|  }}\n|  }}\n| or the Coinage Abolition Act 1838|public|120|16-08-1838|repealed=y|archived=n|An Act for the Abolition of the Duties payable on the Coinage of Tin in the Counties of Cornwall and Devon, and for giving Compensation in lieu of such Duties, and to reduce the Duties of Customs payable on Tin.|note4= }}\n}}\nLocal acts\n}}\n|  }}\n|  for better rearing the Roads from Warminster and from Frome to the Bath Road, and other Roads therein mentioned.|note4= }}\n|\n|  }}\n|\n|\n|  for improving the Navigation of the River Ribble in the County Palatine of Lancaster, and for the further Improvement of the Navigation of the said River.|note4= }}\n|  }}\n|\n|\n|  }}\n|  }}\n|  relating to the Improvement of the Town of Leominster in the County of Hereford.}}\n|  }}\n|\n|\n|\n|  relating to the Lower King's Ferry Roads in the Counties of Flint and Chester, and for making a new Road to communicate therewith; and for other Purposes renting thereto.|note4= }}\n|\n|\n|\n|\n|  relating thereto.}}\n|\n|\n|\n|\n|  }}\n|  }}\n|\n|  regarding Londonderry Bridge; and to amend several Acts relating to the City and Port of Londonderry.}}\n| |note4= }}\n|\n|\n|  }}\n|\n|  }}\n|\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|\n|  as relates to the Balmore Road; and to improve and make and maintain the said Road, and certain other Roads connected therewith, in the Parishes of Campsie and Baldernock and County of Stirling aforesaid.|note4= }}\n|\n|  }}\n|  }}\n|  }}\n|  for lighting with Gas the Borough of Leicester in the County of Leicester, and the Liberties, Precincts, and Suburbs thereof.|note4= }}\n|  }}\n|\n|\n|  relating thereto.}}\n|  relating to the Midland Counties Railway, and for making a Branch therefrom to the Town of Mountsorrel in the County of Leicester.|note4= }}\n|  }}\n|  }}\n|\n|\n|  }}\n|  for erecting and maintaining a Pier and other Works for landing and embarking Passengers in the Port of the Town of Southampton.|note4= }}\n|  }}\n|  }}\n|\n|  relating to the Metropolitan Suspension Bridge.}}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n|\n|  }}\n|\n|  so far as relates to the Wadsley and Langset District of the said Road in the West Riding of the County of York, and to make new Provisions in lieu thereof; and also for extending the said District of Road to or near to Moorfields in the Pariah of Sheffield; and for other Purposes.}}\n|\n|\n| |note4= }}\n|  }}\n|  relating to the Eastern Counties Railway.}}\n|\n|\n|\n|  for improving the Harbour of Fishguard in the County of Pembroke.}}\n|\n|\n|\n|  for the Amendment of Four several Acts passed in the Fifth, Sixth, Tenth, and Forty-seventh Years of the Reign of His late Majesty King George the Third, for the Recovery of Small Debts within the Hundreds of Blackheath, of Bromley and Beckenham, of Rokesky otherwise Ruxley, and of Little and Lesness, in the County of Kent, and within the Hundred of Wallington in the County of Surrey; and to extend the Powers thereof.|note4= }}\n|  }}\n|  for the Recovery of Small Debts within the Town of Ashby-de-la-Zouch and other Places in the Counties of Leicester, Derby, Warwick, and Stafford.|note4= }}\n|  }}\n|  }}\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|  }}\n|\n}}\nPrivate acts\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  see 1837.}}|16-08-1838|maintained=y|repealed=n|archived=n|An Act for enabling the Governors of the Possessions, Revenues, and Goods of the Free Grammar School of the Parishioners of the Parish of Saint Saviour in Southwark in the County of Surrey to sell the old School and Schoolhouse and the Site thereof; and also for enabling the Right Reverend Charles Richard Lord Bishop of Winchester and his Lessees to grant to the said Governors another Site for the Purpose of a more convenient School and Schoolhouse and proper Offices being erected thereon.}}\n| |private|41|note2=|26-01-1838|repealed=n|archived=n|An Act for naturalizing Frederic Joly.}}\n| |private|42|09-05-1838|repealed=n|archived=n|An Act for naturalizing Benedetto Albano.}}\n| |private|43|09-05-1838|repealed=n|archived=n|An Act for naturalizing George Lewis Augustus Behrens.}}\n| |private|44|11-06-1838|repealed=n|archived=n|An Act for naturalizing Sophia Nelthorpe Le Jeune.}}\n| |private|45|11-06-1838|repealed=n|archived=n|An Act for naturalizing Sarah Nelthorpe Newman.}}\n| |private|46|11-06-1838|repealed=n|archived=n|An Act for naturalizing Mark Ludwig Beurle.}}\n| |private|47|04-07-1838|repealed=n|archived=n|An Act for naturalizing John Nicholas Sibeth.}}\n| |private|48|27-07-1838|repealed=n|archived=n|An Act for naturalizing Gustavus Theodore Anthony Count Batthyany.}}\n| |private|49|27-07-1838|repealed=n|archived=n|An Act for naturalizing Frederick Rudolph Grohte.}}\n| |private|50|10-08-1838|repealed=n|archived=n|An Act to dissolve the Marriage of Lieutenant Colonel Lethbridge with Sarah Anne his now Wife, and to enable him to marry again; and for other Purposes therein mentioned.}}\n}}\nSources\n*\n*\n*\n*\n*  |pages=290–295 |via=Google Books}}\nSee also\n*List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}