{
  "content": [
    {
      "type": "text",
      "text": "# List of Grammy Award categories\n\nThe Grammy Awards are awarded in a series of categories, each of which isolates a specific contribution to the recording industry. The standard awards list nominees in each category, from which a winner is selected. In 1959, in the first award ceremony, 28 Grammys were awarded. The number of awards has grown over time as new categories are added; at one time, over 100 awards were given. The number has also fluctuated as some older ones were removed. For the upcoming 2026 ceremony, there are 96 categories, an increase of two from the previous year.\nSome special awards are awarded without nomination in eight categories ranging from \"Lifetime Achievement\" to \"Technical.\"\nGeneral Field\nThe General Field (originally known as the \"Big Four\") contains six standard awards for musical works which do not restrict nominees by genre or other criteria; these awards are voted on by all members of the Academy.\n*Record of the Year is awarded to the performer and the production team of a single song.\n*Album of the Year is awarded to the performer, songwriter(s), and the production team of a full album.\n*Song of the Year is awarded to the songwriter(s) of a single song.\n*Best New Artist is awarded to an artist without reference to a song or album.\n*Producer of the Year, Non-Classical, is awarded to a producer for a body of work.\n*Songwriter of the Year, Non-Classical, is awarded to a songwriter for a body of work.\nGenre-specific fields\nIn the General Field, but not including special awards, there are 95 award categories; these were consolidated into 11 fields (down from 26).\nSpecial merit awards\nThere are special awards that are awarded without nominations, typically covering a period of time longer than the past year, which the standard awards apply to.\n* Dr. Dre Global Impact Award (formerly the Global Impact Award) is a CEO Merit Award for artists whose dedication to the art form has greatly influenced the industry. The award is reserved only for Black individuals or groups.\n* Lifetime Achievement Award is a Special Merit Award presented to performers (and some non-performers through 1972) who, during their lifetimes, have made creative contributions of outstanding artistic significance to the field of recording.\n* Trustees Award is a Special Merit Award presented to individuals who, during their careers in music, have made significant contributions, other than performance (and some performers through 1983), to the field of recording.\n* Technical Grammy Award is a Special Merit Award presented to individuals and/or companies who have made contributions of outstanding technical significance to the recording field.\n* Legend Award is a Special Merit Award presented to individuals or groups for ongoing contributions and influence in the recording field; it was inaugurated in 1990.\n* Hall of Fame Award was established in 1973 to honor recordings of lasting qualitative or historical significance that are at least 25 years old. Winners are selected annually by a special member committee of eminent and knowledgeable professionals from all branches of the recording arts.\n* The MusiCares Person of the Year Award was established in 1991 to recognize a musician who has made an outstanding contribution to music and in addition has been active in works of philanthropy. This award is presented by the MusiCares foundation annually.\n* Best Song for Social Change is a Special Merit Award determined by a blue ribbon committee and ratified by the Recording Academy Board of Trustees. Submissions must contain lyrical content that addresses a timely social issue and promotes understanding, peacebuilding and empathy.\nNo longer awarded\nChanges in the 2010s\n2012\nOn April 6, 2011 the Recording Academy announced a major overhaul of many Grammy Award categories. In 2012, the number of categories fell from 109 to 78. Some categories were discontinued, others were merged or renamed; notably merging gender specific categories.\n2013\nOn June 8, 2012, the Academy announced a few changes , including the addition of three new categories: Best Classical Compendium, Best Latin Jazz Album and Best Urban Contemporary Album. This meant the number of categories in 2013 rose to 81.\nAccording to the Academy, the Best Classical Compendium is \"for an album collection containing (...) newly recorded material of performances (vocal or instrumental) by various soloist(s) and/or ensemble(s) involving a mixture of classical subgenres.\" Albums entered in this category cannot be entered in other classical album categories, but individual tracks can.\nThe intent for the newly formed Best Latin Jazz Album is \"to recognize recordings that represent the blending of jazz with Latin, Iberian-American, Brazilian, and Argentinean tango music.\"\nThe new Best Urban Contemporary Album category is for albums with contemporary songs derivative of R&B. It is for artists who blend contemporary styles with R&B music, such as urban (euro)pop, urban rock and/or urban alternative.\nOther changes for the 2013 Grammy Award season were:\n* Best Small Ensemble Performance category (in the classical field) has been renamed Best Chamber Music/Small Ensemble Performance.\n* Best Latin Pop, Rock or Urban Album has been split into two categories: Best Latin Pop Album and Best Latin Rock, Alternative or Urban Album, thereby returning to the situation prior to 2012.\n* The Best Banda or Norteño Album and Best Regional Mexican or Tejano Album categories have been merged into one category: Best Regional Mexican Music Album (including Tejano).\n* Mastering engineers will now be considered nominees and award winners in the Record of the Year category.\n2014\nChanges were made in 2014. One was the introduction of a new category, Best American Roots Song, which encompasses all subgenres in the American roots music field such as Americana, bluegrass, blues, folk and regional roots music. The award will be presented to the songwriter(s).\nThe Best Hard Rock/Metal Performance category, introduced in 2012, was split and recognises metal performances only. It was renamed Best Metal Performance (returning to the situation prior to 2012). Hard rock performances are screened in the Best Rock Performance category, thus losing its own genre award.\nThe two Music Video categories were renamed. The Best Short Form Music Video became the Best Music Video category, while Best Long Form Music Video is now Best Music Film. The rules and description of these two categories did not change. Also new for 2014 was the Music Educator Award. It recognizes \"current educators (kindergarten through college, public and private schools) who have made a significant and lasting contribution to the field of music education and who demonstrate a commitment to the broader cause of maintaining music education in the schools.\"\n2015\nThe Recording Academy introduced further changes beginning on the 2015 ceremony: particularly allowing samples or interpolations of previously written songs in all songwriting categories, most notably the Song of the Year category.\nAdditional changes include:\n* the introduction of Best American Roots Performance in the American Roots Music Field\n* Dance/Electronica Field to Dance/Electronic Music Field\n** renaming Best Dance/Electronica Album to Best Dance/Electronic Album\n* introduction of Contemporary Instrumental Music Field\n** renaming of Best Pop Instrumental Album to Best Contemporary Instrumental Album\n* restructuring the categories of the Gospel/Contemporary Christian Music Field\n** creation of Best Gospel Performance/Song, with both the artist(s) and songwriter(s) as recipient(s)\n** creation of Best Contemporary Christian Music Performance/Song, with both the artist(s) and songwriter(s) as recipient(s)\n** introduction of Best Roots Gospel Album\n* moving Best Traditional Pop Vocal Album to the Pop Field\n* changing Best Classical Vocal Solo (albums and tracks) to Best Classical Solo Vocal Album (limited to albums only)\n* renaming Best Instrumental Arrangement to Best Arrangement, Instruments And Vocals\n* renaming Best Instrumental Arrangement Accompanying Vocalist(s) to Best Arrangement, Instrumental Or A Cappella\nThe introduction of the changed will push the total number of categories to 83.\n2017\nIn June 2016, the Grammy organization announced changes to the voting and awarding process.\nRecordings released solely through streaming services became eligible to enter the award process. These recordings must be available through streaming platforms. Applicable streaming services are paid subscription, full catalog, on-demand streaming/limited download platforms that have existed as such within the United States for at least one full year as of the submission deadline. All recordings entered must have an assigned International Standard Recording Code (ISRC).\nBest New Artist rules were amended to remove the album barrier given trends in how new music and developing artists are released and promoted; many new artists first release singles, tracks, or EPs rather than full albums. To become eligible in the category of Best New Artist, the artist, duo, or group:\n* Must have released a minimum of five singles/tracks or one album, but no more than 30 singles/tracks or three albums.\n* May not have entered the category more than three times, including as a performing member of an established group.\n* Must have achieved a breakthrough into the public consciousness and impacted the musical landscape during the eligibility period.\nThe Best Blues Album category was split back into two distinct categories, as they were prior to 2012:\n* Best Traditional Blues Album (Blues recordings with traditional blues song and harmonic structures, including various subgenres such as Delta blues, Piedmont blues, jump/swing blues, Chicago blues, and classic/Southern soul).\n* Best Contemporary Blues Album (Recordings which may employ non-traditional blues rhythms such as funk, hip-hop, reggae, and rock, or which feature contemporary techniques such as synthesizers or loops).\nThe Best Rap/Sung Collaboration category (in the Rap field) was renamed as Best Rap/Sung Performance to allow solo performances, a result of \"the current state and future trajectory of rap by expanding the category beyond collaborations between rappers and vocalists to include recordings by a solo artist who blurs the lines between rapping and singing.\"\nAdditional amendments were made to the number and type of music creators recognized in the categories of Best Choral Performance and Best Jazz Vocal Album.\nReferences\nhy:Գրեմմի"
    }
  ]
}