{
  "content": [
    {
      "type": "text",
      "text": "# List of Papal Tithes from 1332–1337 in the Kingdom of Hungary\n\naround 1330]]\nbetween 1332–1337]]\nThe List of Papal Tithes from 1332–1337 () is the most important historical source for the ecclesiastical topography of medieval Kingdom of Hungary, containing the names of parishes and of their priests paying the yearly tithes, a tenth of their income.\nBackground\nThe papal register has survived in Rome, together with the register of the diocese of Zagreb (1334), which also covering the Lower Slavonian counties, contains altogether 4066 parishes. This list also gives the most comprehensive picture of the settlement network of the late Árpád and Anjou periods in the Kingdom of Hungary. However, the source is far from complete, some of the gaps can be filled on the basis of other sources.\nThe Hungarian parish system was similar to the Western European, and it seems that the parish/population ratio was close to the number known from similar French and English sources (c. 520–530 persons/parish). Comparing the three papal registers (English, French and Hungarian), there were 8,085 parishes in Kingdom of England in 1291, 31,624 in the most populous Kingdom of France in 1328, and 4,289 parishes in the Kingdom of Hungary in the 1330s.\nDue to the large amount of certificates that have been perished in the Kingdom of Hungary over the centuries, many place-names appear in this tithe list for the first time. This register are also sources for the origin of the names of the settlements and the ethnic relations of the 14th century, however, since these certificates were mostly compiled by foreign tax collectors, the Hungarian place names were written down after hearing them, often distorted beyond recognition. Tivadar Ortvay contributed greatly to its real usability, as he identified most of the settlement names, which were often written down in a highly distorted form. Since then, several people have tried to correct his mistakes, largely based on the historical, geographical and archaeological research of the past century.\nDemographic of the Kingdom of Hungary\nParishes and estimated population of the Kingdom of Hungary around 1330 based on the List of Papal Tithes:\n{| class=\"wikitable\" width=\"100%\"\n! width=\"40%\" |Dioceses in the Kingdom of Hungary\n! width=\"30%\" |Parishes in 1332–1337\n! width=\"30%\" |Population around 1330\n|-\n|Archdiocese of Esztergom\n| align=\"center\" |461 (10.7%)\n| align=\"center\" |244,330 (10.7%)\n|-\n|Diocese of Eger\n| align=\"center\" |821 (19.1%)\n| align=\"center\" |435,130 (19.1%)\n|-\n|Diocese of Győr\n| align=\"center\" |185 (4.3%)\n| align=\"center\" |98,050 (4.3%)\n|-\n|Diocese of Nyitra\n| align=\"center\" |84 (2.0%)\n| align=\"center\" |52,194 (2.0%)\n|-\n|Diocese of Pécs\n| align=\"center\" |529 (12.3%)\n| align=\"center\" |280,370 (12.3%)\n|-\n|Diocese of Vác\n| align=\"center\" |27 (0.6%)\n| align=\"center\" |14,310 (0.6%)\n|-\n|Diocese of Veszprém\n| align=\"center\" |515 (12.0%)\n| align=\"center\" |272,590 (12.0%)\n|-\n|Archdiocese of Kalocsa\n| align=\"center\" |130 (3.0%)\n| align=\"center\" |68,900 (3.0%)\n|-\n|Diocese of Csanád\n| align=\"center\" |218 (5.1%)\n| align=\"center\" |115,540 (5.1%)\n|-\n|Diocese of Transylvania\n| align=\"center\" |624 (14.5%)\n| align=\"center\" |330,720 (14.5%)\n|-\n|Diocese of Várad\n| align=\"center\" |244 (5.7%)\n| align=\"center\" |129,320 (5.7%)\n|-\n|Diocese of Zagreb\n| align=\"center\" |451 (10.5%)\n| align=\"center\" |239,030 (10.5%)\n|-\n! width=\"40%\" |Total\n! width=\"20%\" |4289\n! width=\"20%\" |2,273,170\n|}\nReferences\nFurther reading\n*\n*\n*\n*\n*"
    }
  ]
}