{
  "content": [
    {
      "type": "text",
      "text": "# Listed buildings in Leeds (Kirkstall Ward)\n\nKirkstall is a ward in the metropolitan borough of the City of Leeds, West Yorkshire, England. It contains 48 listed buildings that are recorded in the National Heritage List for England. Of these, one is listed at Grade&nbsp;I, the highest of the three grades, two are at Grade&nbsp;II*, the middle grade, and the others are at Grade&nbsp;II, the lowest grade. The ward contains Kirkstall, Burley and Hawksworth, all suburbs of Leeds. The River Aire and the Leeds and Liverpool Canal pass through the ward, and the listed buildings associated with these are weirs, sluices, locks, and a canal bridge. The most important building is the ward is Kirkstall Abbey, which is listed, together with associated structures. The other listed buildings include houses and associated structures, churches and items in churchyards, public houses, a school and a former Sunday school, a commemorative arch, road bridges, a railway viaduct and station, former mill buildings, buildings associated with a former forge, and a war memorial.\n__NOTOC__\nKey\n{| class=\"wikitable\"\n|-\n! Grade\n! Criteria\n|-\n|align=\"center\" |I\n| Buildings of exceptional interest, sometimes considered to be internationally important\n|-\n|align=\"center\" |II*\n| Particularly important buildings of more than special interest\n|-\n|align=\"center\" |II\n| Buildings of national importance and special interest\n|}\nBuildings\n{| class=\"wikitable sortable plainrowheaders\" style=\"width:100%; border:0; text-align:left; line-height:150%;\"\n|-\n! scope=\"col\"  style=\"width:150px\" |Name and location\n! scope=\"col\"  style=\"width:100px\" class=\"unsortable\"|Photograph\n! scope=\"col\"  style=\"width:120px\" |Date\n! scope=\"col\"  style=\"width:650px\" class=\"unsortable\"|Notes\n! scope=\"col\"  style=\"width:50px\" |Grade\n|-\n|Kirkstall Abbey\n|\n|align=\"center\"|1152\n||The remains of the Cistercian abbey are in gritstone.  The church is largely complete and much of it is roofless.  It consists of a nave with a clerestory, aisles, transepts, a chancel, a gabled west portal, and a tower at the crossing.  The foundation of the other abbeys buildings include a chapter house, kitchens, a brewhouse, a refectory, the remains of the infirmary, and the abbot's lodgings.  The ruins of the abbeys are also a scheduled monument.\n|align=\"center\" |\n|-\n|Gatehouse at Kirkstall Abbey\n|\n|align=\"center\"|\n|The gatehouse has been much altered and extended, at one time it was a private house, and has since been converted into a museum.  It is in gritstone with stone slate roofs, two storeys, and three bays, with a rib-vaulted passage.  There is a 15th–16th&nbsp;century wing to the south west that contains two and three-light mullioned windows with arched lights, and additions in the 20th&nbsp;century in Tudor style.  The upper floor is reached by a newel staircase on the northwest corner.\n|align=\"center\" |\n|-\n|Guesthouse, Kirkstall Abbey\n|\n|align=\"center\"|\n|The ruins of the guesthouse are to the west of the abbey church, and consist of a hall, a parlour, a solar, a kitchen, a cellar, and stables.  The northwest corner survives to the height of the upper floor, and the rest are only foundations.\n|align=\"center\" |\n|-\n|Kirkabbey Kennels, sluice gates, cottage and weir\n|\n|align=\"center\"|\n|The weir on the River Aire, which was built for Kirkstall Abbey, is about  wide, and consists of huge gritstone blocks.  The adjoining keeper's cottage is in stone with a single storey and an embattled parapet, and is in Gothic style. It contains a lancet window, a doorway, and a three-light oriel window.  The sluice gates have eight vertical paddles and a walkway above, and there is an embattled screen wall with pilasters.\n|align=\"center\" |\n|-\n|Vesper Gate, Kirkstall Abbey\n|\n|align=\"center\"|\n|The remaining end of a wall with door jamb stones, it is in gritstone, nine courses high.  Some corners have been cut away, and there are some iron fittings.\n|align=\"center\" |\n|-\n|Holly Bush House, barn and wall\n|\n|align=\"center\"|\n|The house and barn, which have been altered and used for other purposes, are in gritstone.  The house has a slate roof, two storeys and a basement, and four bays.  The doorway has a fanlight, and the windows are sashes with architraves.  The barn to the left is lower and has a stone slate roof.  It contains a central cart entry with quoined jambs, a doorway and inserted windows, and at the rear is an archway, doorways, and a square hay door above.  The wall with railings along the front of the building is in stone with rounded coping.  There are gate piers and a pier at the south end.  The piers are square and have moulded cornices and pyramidal caps.\n|align=\"center\" |\n|-\n|Victoria Arch\n|\n|align=\"center\"|1766 (probable)\n|The arch was altered in 1868 following the visit of Queen Victoria.  It is in gritstone and consists of four Ionic columns supporting a pediment.  In the pediment is a frieze containing glazed tiles inscribed to commemorate the visit.\n|align=\"center\" |\n|-\n|Forge locks\n|\n|align=\"center\"|1770–77\n|A flight of three locks on the Leeds and Liverpool Canal with walls are in gritstone.  There are steps on each side, steel footbridges, and an overflow and side channel on the south side.\n|align=\"center\" |\n|-\n|64 Cardigan Lane, Burley\n|\n|align=\"center\"|\n|The house, at one time used as a chapel, is in gritstone with a two-span slate roof, hipped to the road.  There are two storeys and a front of four bays.  The doorway has fluted three-quarter columns, a semicircular fanlight, and an open segmental pediment, and the windows on the front are casements.  At the rear are sash windows, and on the right return is a semicircular bay window.\n|align=\"center\" |\n|-\n|Bridge over Moseley Beck\n|\n|align=\"center\"|\n|A road bridge carrying Butcher Hill over a stream, it is in sandstone, and consists of a single semicircular arch.  The bridge has a band, pilasters at the corners, and a parapet with rounded coping.\n|align=\"center\" |\n|-\n|Kirkstall Brewery Student Village\n|\n|align=\"center\"|\n|The brewery has been much altered and extended, and was converted into student accommodation in 1994.  It is in gritstone with some brickwork, and roofs mainly slates, and it forms an L-shaped plan.  At the entrance is a tower brewery and office range, at the rear are ranges extending along the Leeds and Liverpool Canal, and in the angle are 20th-century additions.  The tower brewery has three storeys and fronts of three and two bays.  It has a chamfered plinth, a round-arched cart entry, and a balustraded parapet, and there is a circular chimney rising from the southwest corner.  The front facing the canal has three and four storeys and ranges of three, nine and 20&nbsp;bays.\n|align=\"center\" |\n|-\n|Former cottages, Kirkstall Forge\n|\n|align=\"center\"|\n|The two cottages at the entrance to the site, later used as offices, are in gritstone with quoins and slate roofs.  They have two storeys, square windows in the ground floor and three-light mullioned windows above.  To the right is a screen wall with rounded coping about  high, and further to the right is a rusticated gate pier with a ball finial.\n|align=\"center\" |\n|-\n|Forge buildings and contents, Kirkstall Forge\n|\n|align=\"center\"|\n|The forge buildings are in gritstone, largely derelict, with round-arched openings, and either roofless, or covered with corrugated asbestos.  Surviving contents include a helve-hammer, a later wheel and hammer, and drop-forge stamps that were steam-driven.\n|align=\"center\" |\n|-\n|Former stables, Kirkstall Forge\n|\n|align=\"center\"|\n|The stables near the entrance to the site, later used as garages, are in gritstone with a stone slate roof, two storeys and three bays.  In the upper floor is a central loft door flanked by casement windows, and the ground floor contains inserted two wide double doors.  At the rear are small round-headed windows.\n|align=\"center\" |\n|-\n|Former Star and Garter Hotel\n|\n|align=\"center\"|\n|The public house and attached stable and carriage house range to the right have been converted for other uses, and are in stone with hipped slate roofs.  The former public house has three storeys, a front range of five bays, a parallel rear range of two bays, a two-storey seven-bay range attached to the right, and a low two-storey bay to the left. The doorway has pilasters, the windows are sashes, and in the outer bays are two-storey segmental bay windows.  The former stable range has a sill band, two storeys, and seven bays, the middle bay projecting slightly under a pediment containing a blind circular window in the tympanum.  The middle three windows in the upper floor are in segmental-arched recesses, and the central window has a round-arched head.\n|align=\"center\" |\n|-\n|Broad Lane Canal Bridge\n|\n|align=\"center\"|\n|This is bridge No. 222, carrying a road over the Leeds and Liverpool Canal.  It is in gritstone, and consists of a single elliptical arch.  It has a raised band under a coped parapet, end pilasters, and a buttress at the northeast angle.\n|align=\"center\" |\n|-\n|Main range, Burley Mills\n|\n|align=\"center\"|1799\n|The textile mill was altered in 1822 and in 1918, and was converted into offices in 2000.  The building is in gritstone with quoins and a slate roof.  There are three storeys, 15&nbsp;bays spanning the mill race, and is approached by a bridge with three arches.  Attached to the southwest is an annexe with 1&nbsp;storeys, and on the west is a two-storey four-bay engine house.  The building contains doorways, loading doors and windows, and on the roof are ventilators and a water tank.\n|align=\"center\" |\n|-\n|Weir and sluice gates at NGR 2658 3497\n|\n|align=\"center\"|\n|The weir crossing the River Aire was built to serve Burley Mills, it is in stone slabs, with a bowed plan, and is about  wide.  The sluice and the weir have flanking walls.\n|align=\"center\" |\n|-\n|Cooper House\n|\n|align=\"center\"|\n|A stone house on a plinth with a stone slate roof that has a coped gable, and is hipped on the right.  There are two storeys, a front of four bays, the right bay recessed, and three bays at the rear.  The doorway has a traceried fanlight, and the windows on the front are sashes.  At the rear is a doorway, a canted bay window, a two-light mullioned window, a round-arched stair window, and more sash windows.\n|align=\"center\" |\n|-\n|Dryhouse and parallel range,Burley Mills\n|\n|align=\"center\"|\n|The building has been converted for other uses.  The former dryhouse is in yellow sandstone with a stone slate roof, hipped at the east end, and the parallel range is in gritstone with a slate roof.  Both parts have a single storey, the dryhouse has nine bays, and contains windows and a doorway with tie-stone jambs.  In the parallel range are two wide segmental-arched doorways.\n|align=\"center\" |\n|-\n|71 Commercial Road, Kirkstall\n|\n|align=\"center\"|\n|A workshop, later a showroom, it is in gritstone with projecting eaves and a hipped slate roof.  It is on sloping ground, with four storeys at the front and two at the rear, and is at right angles to the road, with one bay on the front and four on the sides.  In the ground floor is a shop front, and the windows are sashes.\n|align=\"center\" |\n|-\n|Abbey Mills\n|\n|align=\"center\"|\n|Former mill buildings, later converted for other uses, they incorporate material from an earlier mill, and are in gritstone, with roofs of slate and stone slate.  The buildings consist of four linked ranges, a masonry platform and a bridge over the millstream, and a further range.  The entrance block to the main range has two storeys and three bays, and contains a blocked round arch.  The buildings include a lodge, a cottage, and a four-storey drying house.\n|align=\"center\" |\n|-\n|Spinning or weaving range,Burley Mills\n|\n|align=\"center\"|\n|The range, which has been converted for other uses, is in gritstone with a hipped roof.  There are two storeys, eleven bays at right angles to the road, and three bays along the road.  The doorways and windows have been altered.\n|align=\"center\" |\n|-\n|Burley Wood Works\n|\n|align=\"center\"|\n|Stables later converted for other uses, in gritstone with a hipped slate roof.  There are two storeys and five bays, the middle bay wider and with a small open pediment.  In the centre is a wide round-arched carriageway with voussoirs.  The ground floor windows have segmental-arched heads, and lintels with keystones, and in the upper floor they have round arches and voussoirs.\n|align=\"center\" |\n|-\n|Ford and weir at NGR 2632 3507\n|\n|align=\"center\"|\n|The weir crosses the River Aire and is surmounted by a ford.  It is constructed from massive blocks of gritstone set on edge, and is about  long and  wide.  The approach roads on each bank are flanked by revetment walls about  long.\n|align=\"center\" |\n|-\n|Kirkstall House\n|\n|align=\"center\"|\n|A pair of houses in gritstone with moulded eaves and a slate roof with half-hipped ends.  There are two storeys and six bays, each house has a central doorway with a fanlight, and the windows are sashes.\n|align=\"center\" |\n|-\n|Weir at NGR 2655 3488\n|\n|align=\"center\"|\n|The weir crossing the River Aire is in gritstone with a bowed plan, about  wide and  high.  The flanking walls are edge-tooled, the northeast wall forming a revetment to the bank.\n|align=\"center\" |\n|-\n|St Stephen's Church, Kirkstall\n|\n|align=\"center\"|1828–29\n|A Commissioners' church designed by R. D. Chantrell in Gothic Revival style, it was extended in 1860 and in 1893–94.  The church is built in gritstone with a slate roof, and consists of a nave, north and south aislesnorht and south transepts, a chancel with a vestry and a west steeple.  The steeple has a three-stage tower that contains a west doorway with a moulded surround, above which is a lancet window, a clock face, corner pinnacles, and an octagonal spire with lucarnes.\n|align=\"center\" |\n|-\n|Gate, gate piers and walls,St Stephen's Church, Kirkstall\n|\n|align=\"center\"|\n|At the west entrance to the churchyard are iron double gates flanked by stone piers.  The piers are , and each pier has a moulded base, and a capstone gabled on each side.  The flanking walls are in gritstone with moulded coping and are about  high and  high.\n|align=\"center\" |\n|-\n|Milestone, Kirkstall Forge\n|\n|align=\"center\"|1829\n|The milestone at the entrance to the works is in stone, and consists of an obelisk with rusticated banding, surmounted by a ball finial.  On it is an iron plaque with an inscription including the equal distances to London and Edinburgh.\n|align=\"center\" |\n|-\n|Group of five tombs,St Stephen's Church, Kirkstall\n|\n|align=\"center\"|1831–69\n|The tombs are in the churchyard to the northwest of the church.  They are in stone, some with cast iron railings, and consist of two family vaults and three gravestones.\n|align=\"center\" |\n|-\n|Abbey Villa\n|\n|align=\"center\"|\n|A house, later divided, it is in stone with a string course and a slate roof.  There are two storeys, cellars and attics, four bays, and a projecting gabled cross-wing.  On the front is a porch with open arches on the front and side, and a parapet.  The windows are sashes, and there is a round-arched stair window.\n|align=\"center\" |\n|-\n|Headingley railway station and platformr\n|\n|align=\"center\"|1849\n|The original railway station built for the Leeds and Thirsk Railway and later used as offices.  It is in gritstone with wide eaves on paired curved brackets with a Welsh slate roof.  The main block has two storeys and three bays, the middle bay projecting under a gable.  To the left is a single-storey three-bay wing, the middle bay projecting with a gable.  The windows in both parts are sashes, and there are finials on the roof.  The original low platform has stone slabs and kerb stones.\n|align=\"center\" |\n|-\n|Railway viaductr\n|\n|align=\"center\"|1849\n|The viaduct was built by the Leeds and Thirsk Railway to carry its line over the River Aire.  It is in stone, and consists of 21&nbsp;segmental arches on rusticated piers with moulded imposts.  The viaduct has chamfered voussoirs, and a moulded cornice and parapet. The viaduct also crosses the Leeds and Liverpool Canal by a low elliptical arch with round-headed niches in the abutments.\n|align=\"center\" |\n|-\n|2 Burley Hill Drive, Kirkstall\n|\n|align=\"center\"|\n|A former lodge, it is in gritstone, with wide eaves, and a stone slate roof with gables and ornately carved bargeboards with octagonal pendants.  It is in Tudor style, and has one storey and an attic, and two bays.  The doorway has a four-centred arched head with a hood mould and a panel containing a shield above, and the windows have chamfered surrounds and hood moulds.\n|align=\"center\" |\n|-\n|Former Bridge Mills\n|\n|align=\"center\"|\n|The mill buildings, which have been converted for other uses, are in gritstone, and consist of a main building and an entrance range; the main building has a hipped tiled roof, and the roof of the entrance range is slated.  The main building has five storeys, two bays on the front and five on the sides.  It has corner pilasters, and in the left return are round arches.  The entrance range has three storeys and three bays.  It contains a blocked segmental arch with voussoirs and impost blocks, there is a blocked doorway, and the windows in both parts have plain surrounds.\n|align=\"center\" |\n|-\n|Wall and piers, Burley Mills\n|\n|align=\"center\"|\n|To the east of the mill buildings is a low boundary wall in gritstone with slab copings.  It is about  long and contains piers with flattened pyramidal caps.\n|align=\"center\" |\n|-\n|Wall, piers and railings,St Matthias' Church\n|\n|align=\"center\"|\n|The boundary of the churchyard is enclosed by a low stone wall, and cast iron railings with fleur-de-lis and arrowheads, and stanchions with twisted shafts.  At the corners are stone piers.\n|align=\"center\" |\n|-\n|St Matthias' Church, Burley\n|\n|align=\"center\"|1853–54\n|The north aisle and west porch were added in 1886.  The church is built in gritstone with a slate roof, and is in Gothic Revival style.  It consists of a nave, a north aisle, a west porch, north and south transepts, a chancel, and a south steeple.  The steeple has a tower that has angle buttresses with gabled heads, traceried bell windows, and a tall broach spire.\n|align=\"center\" |\n|-\n|Sandford Road school and railings\n|\n|align=\"center\"|1882\n|The school is in gritstone with slate roofs, and in Italianate style.  There are two storeys and a U-shaped plan.  In the central range are paired round-arched doorways on the left, and three arches to the right.  The left wing has segmental-arched windows in the ground floor and a pedimented end bay with a circular window in the gable, and the right wing has round-arched windows in the ground floor.  The forecourt is enclosed by a stone wall with iron railings and has square piers with recessed panels, deep cornices, and rounded capstones.\n|align=\"center\" |\n|-\n|Cardigan Arms Public House\n|\n|align=\"center\"|1893\n|A public house on a corner site with a brewhouse and stables at the rear.  The public house is in gritstone with a slate roof, three storeys and cellars, four bays on the front, and three on the left return.  On the front, the right bay projects and has an elaborate gable.  In the ground floor are tripartite windows and a doorway, and the middle floor contains an oriel window in the left bay and round-arched windows in the other bays; the windows are sashes.  In the left bays of the top floor are two dormers with moulded pediments.  The left return has an elaborate gable over all bays.  At the rear, the brewhouse and stables are in red brick; the brewhouse has three storeys, and the stables are lower, with two storeys and two bays.\n|align=\"center\" |\n|-\n|The former Rising Sun Public House\n|\n|align=\"center\"|1897\n|A public house on a corner site, in red brick with stone dressings, pilasters, paired eaves brackets, and a slate roof.  There are two storeys, attics and cellars, and fronts of three bays, the left bay on the front protruding under a gable.  In the ground floor is a doorway with a semicircular fanlight, three segmental-arched windows, and on the right a former cart entry. The upper floor windows have been altered and in the attic is a paired window in an architrave flanked by pilasters, and the gable has moulded coping and a ball finial.\n|align=\"center\" |\n|-\n|Burley Methodist Church\n|\n|align=\"center\"|1897–98\n|The church is in gritstone with a slate roof, and is in Gothic Revival style.  The entrance front is gabled, and contains paired doorways with trefoil arches and attached columns with decorated capitals, under a moulded arch with carved recesses in the tympanum.  Above this is a five-light window, trefoil recesses in the gable apex, and a cross finial.  To the right is an octagonal turret with an ornate spire, and to the left is a steeple.  The steeple has a tower with three stages, buttresses, a doorway with a lancet window above, an ornate belfry stage, corner spirelets, and an octagonal spire.\n|align=\"center\" |\n|-\n|Burley Methodist Church Hall\n|\n|align=\"center\"|1904–05\n|A Sunday school, later a church hall, it is in gritstone, and in Gothic Revival style.  The gable end faces the street, and contains a pair of three-light windows, between them is a gabled buttress, and above at the apex is a carved band, a traceried panel, and a crocketed pinnacle.  At the corners are octagonal turrets with truncated gabled spirelets.  At the flanks are entrance bays with hipped roofs, containing doorways in moulded arches, with fanlights, and cusped windows.\n|align=\"center\" |\n|-\n|Kirkstall Bridge\n|\n|align=\"center\"|1912\n|The bridge carries Bridge Road (B6157 road) over the River Aire.  It consists of three cast iron arches with parapet railings on rusticated stone piers carrying a sloping roadway.  The abutments have stone plaques with the city coat of arms on the river side, and at road level on the road side are stone seats.  On the east end of the north side is an inscribed cast iron plaque.\n|align=\"center\" |\n|-\n|War memorial\n|\n|align=\"center\"|\n|The war memorial is in a semicircular enclosure by the side of the road.  It is in Portland stone, and consists of a tapering cross with a sword carved on the south side, standing on a stepped plinth.  In the enclosure are low stone bollards, a kerb, and two memorial slabs containing the names of those lost.\n|align=\"center\" |\n|-\n|St Mary's Church, Hawksworth\n|\n|align=\"center\"|1932–35\n|The church was designed by W. D. Caröe in Arts and Crafts style.  It is built in knapped flint with sandstone dressings and a Westmorland slate roof.  The church consists of a nave, aisles and a chancel under one roof, a south porch at the west end, and a baptistry, porch and vestries on the north side.  At the junction of the nave and chancel is a small gabled bellcote on the south side.\n|align=\"center\" |\n|-\n|}\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}