{
  "content": [
    {
      "type": "text",
      "text": "# List of battleships of Germany\n\nof the High Seas Fleet steam in a line of battle|alt=A line of nine large gray battleships stretches into the distance, all belching dark black smoke from their funnels]]\nand II Battle Squadron before the outbreak of World War I]]\nThe German navies—specifically the  and  of Imperial and Nazi Germany, respectively—built a series of battleships between the 1890s and 1940s. To defend its North and Baltic Sea coasts in wartime, Germany had previously built a series of smaller ironclad warships, including coastal defense ships, and armored frigates. With the accession to the throne of Kaiser Wilhelm II in 1888, the  began a program of naval expansion befitting a Great Power. The navy immediately pushed for the construction of the four s, after which soon followed five  ships. The appointment of Admiral Alfred von Tirpitz to the post of State Secretary of the Navy in 1897 accelerated naval construction. Tirpitz's \"risk theory\" planned a fleet that would be sufficiently powerful so that Great Britain, then the world's preeminent naval power, would avoid risking war with Germany in order to preserve its superiority.\nTirpitz secured a series of Naval Laws between 1900 and 1912 that drastically increased the budget of the navy and authorized scores of battleships; the final law envisioned a fleet of some 41 battleships, 25 of which would have been assigned to the High Seas Fleet, with the remainder in reserve. Following the  class were the , , and es, the last pre-dreadnoughts built in Germany. The launch of the \"all-big-gun\"  in 1906 revolutionized battleship construction, and forced Tirpitz to radically alter his shipbuilding plan. In order to remain in the battleship race, Tirpitz secured the funds for the first four German dreadnoughts, the , which were laid down beginning in June 1907. The four s followed in 1908, as well as the five s in 1909–1910. Four s were laid down in 1911–1912, and four s were laid down in 1913–1915, though only two— and —were completed. Germany's defeat in 1918 resulted in the internment of the majority of the High Seas Fleet at Scapa Flow; the ships were eventually scuttled on 21 June 1919 to prevent them from being seized by the British Royal Navy. Of the ten battleships interned, only one, , was prevented from sinking; she was later expended as a gunnery target by the Royal Navy.\nFollowing the war, Germany was limited to eight pre-dreadnought battleships, two of which would be in reserve. New warships were severely limited in terms of armament and size. Admiral Erich Raeder was appointed the commander of the German navy in 1928. Raeder initially employed a cautious strategy vis a vis the government of the Weimar Republic. However, the rise of Adolf Hitler and the Nazi Party in 1933 allowed Raeder opportunity to expand the fleet. Hitler's government negotiated the Anglo-German Naval Agreement in 1935, which stipulated the German navy could rebuild to 35&nbsp;percent of the strength of the Royal Navy. The first new battleships built in Germany were the two  ships,  and  in 1935. The two s followed in 1936;  was completed in 1940 and  in 1941. Plan Z was formulated in 1939 to rebuild the German navy; the plan called for six additional battleships of the H-39 class. Two of them were laid down in mid-1939, though they were canceled within two months, due to the outbreak of World War II in September 1939. The other four were canceled without any work being done. , , and  were sunk during the war and  was scuttled in Gotenhafen in 1945. Further design studies were drawn up, culminating in the massive H-44 class, but they were not serious proposals due to the infeasibility and expense of the ships.\n{| class=\"wikitable plainrowheaders\" style=\"float: right; margin: 0 0 0 1em;\"\n|+ Key\n! scope=\"row\" | Main guns\n| The number and type of the main battery guns\n|-\n! scope=\"row\" | Displacement\n| Ship displacement at full combat load\n|-\n! scope=\"row\" | Propulsion\n| Number of shafts, type of propulsion system, and top speed generated\n|-\n! scope=\"row\" | Service\n| The dates work began and finished on the ship and its ultimate fate\n|-\n! scope=\"row\" | Laid down\n| The date the keel began to be assembled\n|-\n! scope=\"row\" | Commissioned\n| The date the ship was commissioned\n|}\n__TOC__\nPre-dreadnought battleships\nBrandenburg class\nThe -class ships were the first ocean-going battleships built for the German navy, and marked the beginning of German naval expansion. Previous classes included several types of ironclad ships, including coastal defense ships and armored frigates. The ships were unique for the time in that they were armed with six large-caliber guns instead of four, as was standard on contemporary ships in other navies. The class comprised four ships: , , , and . Of the four ships,  and  were more advanced, in that their armor was composed of higher quality steel.\nThe four ships were commissioned into the I Battle Squadron. They saw overseas service during the Boxer Uprising in China in 1900–1901 under the command of Marshal Alfred von Waldersee. Following the return from China, the s were taken into drydock for modernization, which lasted from 1901 to 1905 depending on the ship. During the reconstruction the superstructure was cut down, a second conning tower was added, and the steam boilers were replaced with newer models.  and  were sold to the Ottoman Empire in 1910 and renamed  and , respectively.  and  were decommissioned and placed into reserve. At the start of World War I, both ships were recalled to active service as coastal defense ships, but due to their age they were quickly demobilized. They spent the remainder of the war as barracks ships before being broken up in 1920.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"4\" | 6 ×\n| rowspan=\"4\" |\n| 2 screws, triple-expansion steam engines,\n| rowspan=\"4\" | 1890\n| 19 November 1893\n| Scrapped, 1920\n|- valign=\"center\"\n! scope=\"row\" |\n| 2 screws, triple-expansion steam engines,\n| 29 April 1894\n| Transferred to the Ottoman Empire on 12 September 1910, sunk 8 August 1915\n|- valign=\"center\"\n! scope=\"row\" |\n| 2 screws, triple-expansion steam engines,\n| 14 October 1894\n| Transferred to the Ottoman Empire on 12 September 1910, scrapped in 1956–1957\n|- valign=\"center\"\n! scope=\"row\" |\n| 2 screws, triple-expansion steam engines,\n| 31 October 1893\n| Scrapped, 1920\n|}\nKaiser Friedrich III class\nThe five -class ships set the standard for later German pre-dreadnought battleships: they carried smaller main guns than their foreign contemporaries, but a heavier secondary battery. This was in accordance with the \"hail of fire\" theory, which emphasized smaller, rapid firing guns over larger and slower guns. The ships of the class were also the first German battleships to use three screws, which would be used in many subsequent ships, as opposed to two in the s. The class was composed of five ships: , , , , and . All of the ships were named for German emperors.\nUpon commissioning, the five ships were assigned to the I Squadron of the Home Fleet ().  saw service as the fleet flagship until 1906. After ten years of fleet service, they were replaced with newer ships. They were transferred to the III Squadron of the fleet, which had by then been reorganized as the High Seas Fleet, and placed in reserve. In 1907, all five ships were taken into drydock for significant rebuilding. The funnels were made taller, the superstructure was cut down, and the secondary guns were rearranged; work lasted until 1910. The five ships saw no front-line service during World War I; they were all disarmed and relegated to secondary duties.  was used as a torpedo training ship,  was used as a headquarters ship, while the other three became prison ships. They were all broken up between 1919 and 1922.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"5\" | 4 ×\n| rowspan=\"5\" |\n| 3 screws, triple-expansion steam engines,\n| 1895\n| 7 October 1898\n| Scrapped, 1920\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 1896\n| 13 February 1900\n| Scrapped, 1922\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| rowspan=\"3\" | 1898\n| 5 May 1901\n| rowspan=\"2\" | Scrapped, 1920\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 4 February 1902\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 10 June 1901\n| Scrapped, 1919–1920\n|}\nWittelsbach class\nThe  class represented an incremental improvement over the preceding  class. They were equipped with the same armament of four 24&nbsp;cm guns, but were given an additional torpedo tube. They had improved defensive capabilities, as they were protected by a more extensive armored belt. They also differed from the preceding ships in their main deck, the entire length of which was flush. The  had a cut-down quarterdeck. The ships of the class, which included , , , , and , were the first battleships built under the first Naval Law of 1898.\nAfter joining the fleet, the  class ships were assigned to the I Battle Squadron, where they replaced the older -class ships. Like the -class ships, the s were withdrawn from active service after the advent of the dreadnoughts. The five ships were recalled to active service at the outbreak of war in 1914. They were assigned to the IV Battle Squadron and deployed to the Baltic. However, due to their age and vulnerability, they were withdrawn from active service by 1916. They were used as training ships, with the exception of , which was used as a prison ship. In 1919,  and  were converted into depot ships for minesweepers. By 1922, all of the ships had been broken up for scrap, with the exception of . She was converted into a radio-controlled target ship in 1926–1927. RAF bombers sank the ship in Gotenhafen in 1944; the wreck was broken up in 1949–1950.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"5\" | 4 ×\n| rowspan=\"5\" |\n| 3 screws, triple-expansion steam engines,\n| rowspan=\"3\" | 1899\n| 15 October 1902\n| Scrapped, 1921\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 1 October 1902\n| Scrapped, 1922\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 25 October 1902\n| Sunk in 1944; scrapped, 1949–1950\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| rowspan=\"2\" | 1900\n| 13 April 1904\n| rowspan=\"2\" | Scrapped, 1921\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 25 May 1903\n|}\nBraunschweig class\nThe  class, which consisted of , , , , and , was a considerable improvement over the preceding types of battleships in the German navy. They were equipped with much more powerful 28&nbsp;cm guns for their main battery, although this was still smaller than the standard  guns used on British ships. The main battery turrets were mounted on the forecastle deck, as opposed to one deck higher as in the older ships. They were also larger and faster than their predecessors, though armor protection was largely the same. These ships were authorized under the Naval Law of 1900.\nIn 1907 the II Battle Squadron was organized; the five -class battleships were assigned to it, along with the five new -class ships. When war broke out in 1914, four of the -class ships were assigned to the IV Squadron alongside the -class ships.  and  took part in the Battle of the Gulf of Riga in 1915.  remained in the II Battle Squadron and saw action at the Battle of Jutland in 1916. After the war,  and  were converted into depot ships for minesweepers. They were eventually scrapped in 1931. A  long section of  was retained for use as an explosives target; it was eventually bombed and sunk in April 1945. The hulk was raised and broken up in 1954. The other three ships were used as coastal defense ships, though between 1931 and 1935, they too were withdrawn from service and broken up, with the exception of .  was converted into a radio-controlled target ship in 1935 and served in that capacity until the end of World War II in 1945. She was then ceded to the Soviet Navy and renamed .\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"5\" | 4 ×\n| rowspan=\"5\" |\n| 3 screws, triple-expansion steam engines,\n| rowspan=\"2\" | 1901\n| 15 October 1904\n| Scrapped, 1931\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 29 November 1904\n| Scrapped, 1936\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| rowspan=\"3\" | 1902\n| 19 September 1905\n| Ceded to USSR, 1946\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 12 July 1905\n| Partially scrapped in 1931, sunk by bombers in 1945, raised in 1954 and scrapped\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 18 May 1906\n| Scrapped, 1931\n|}\nDeutschland class\nThe five -class battleships—, , , , and —were the last pre-dreadnoughts built by the German navy. They were similar to the -class ships, though their armor was thicker. The ships were built despite rumors of the capabilities of the revolutionary . Admiral Alfred von Tirpitz insisted on their construction as larger ships would have necessitated widening the Kaiser Wilhelm Canal; this would have put an enormous strain on the naval budget for the year.\nFollowing their commissioning starting in 1906, they were assigned to the new II Battle Squadron;  replaced  as the fleet flagship. During World War I, the ships remained in the II Battle Squadron and saw combat at the Battle of Jutland in 1916. Their slow speed hindered the more modern dreadnoughts of the High Seas Fleet. Early on the second day of the battle,  was sunk by a single torpedo that triggered an ammunition magazine explosion. Following the battle the s were withdrawn from fleet duty and ultimately out of service completely in August 1917.  was broken up in 1920. The three remaining ships saw continued service in the German navy;  was struck in 1935 and eventually broken up in 1944–1946.  and  were both sunk during World War II but later raised.  was broken up in 1949–1970, while  was transferred to the Soviet Navy in 1946.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"5\" | 4 ×\n| rowspan=\"5\" |\n| 3 screws, triple-expansion steam engines,\n| 1903\n| 3 August 1906\n| Scrapped, 1920–1922\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| rowspan=\"3\" | 1904\n| 1 October 1907\n| Scrapped, 1944–1946\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 6 August 1907\n| Sunk at the Battle of Jutland, 1 June 1916\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 5 May 1908\n| Scuttled 5 May 1945, scrapped between 1949 and 1970\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 1905\n| 6 July 1908\n| Scuttled on 21 March 1945, raised and ceded to USSR\n|}\nDreadnought battleships\nNassau class\nThe  class, which was composed of , , , and , was the German response to the arrival of HMS Dreadnought, the first \"all-big-gun\" battleship, in 1906. The ships were unusual in their main-armament configuration, which was hexagonal. They retained triple-expansion engines instead of more powerful turbine engines, and as a result, were slower than their British contemporaries.\nAfter their commissioning into the German fleet, all four ships served in the II Division of I&nbsp;Battle Squadron. Two of the ships,  and , took part in the inconclusive Battle of the Gulf of Riga in 1915, during which they engaged the Russian pre-dreadnought . The four -class ships took part in the Battle of Jutland on 31 May and 1 June 1916; they suffered only a handful of secondary battery hits and limited casualties. In early 1918  and  were sent to Finland to support the White Finns in their civil war, but  ran aground off Åland in April and was severely damaged. At the end of World War I, the four ships were seized as war prizes by the victorious Allied powers and sold for scrapping.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"4\" | 12 ×\n| rowspan=\"4\" |\n| 3 screws, triple-expansion steam engines,\n| rowspan=\"4\" | 1907\n| 1 October 1909\n| Scrapped, 1920\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 16 November 1909\n| Scrapped, 1924\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 30 April 1910\n| Scrapped, 1921\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 31 May 1910\n| Scrapped, 1922\n|}\nHelgoland class\nThe  class was the second type of German dreadnoughts, built during 1908–1912. The class was composed of four ships: , , , and . The ships incorporated significant improvements over the previous  type, including more powerful main guns and an improved propulsion system. The s were easily distinguished from the preceding s by the three funnels that were closely arranged, compared to the two larger funnels of the previous class. The ships retained the unusual hexagonal main battery layout of the  class.\nThe ships served as a unit in the I Division, I Battle Squadron alongside the -class ships in the II Division of the I Battle Squadron. They saw combat during World War I, including the Battle of Jutland in the North Sea and the Battle of the Gulf of Riga in the Baltic. All four survived the war, but were not taken as part of the German fleet that was interned at Scapa Flow. After the German fleet at Scapa Flow were scuttled, the four s were ceded as war reparations to the victorious Allied powers in the sunken ships' stead.  was taken by the US Navy and expended as a target during Billy Mitchell's air power demonstration in July 1921.  and  were allotted to Britain and Japan respectively, and broken up in 1921.  was delivered to France in 1920, and was used as a target ship for the French navy. The ship was eventually broken up between 1923 and 1933.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"4\" | 12 ×\n| rowspan=\"4\" |\n| 3 screws, triple-expansion steam engines,\n| rowspan=\"3\" | 1908\n| 23 August 1911\n| Scrapped, 1921\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 1 August 1911\n| Expended as a target, 1921\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 10 September 1911\n| Scrapped, 1923–1933\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, triple-expansion steam engines,\n| 1909\n| 1 May 1912\n| Scrapped, 1921\n|}\nKaiser class\nThe  class, which comprised , , , , and , was the third class of German dreadnoughts, and the first to feature turbine engines and superfiring turrets. As was usual for German battleships of the period, the  class mounted main guns that were smaller than those of their British rivals: , compared to the  guns of the British . The ten SK L/50 guns were mounted in five twin turrets; one turret was mounted fore, two aft in a superfiring arrangement, and the other two in a staggered \"wing\" arrangement amidships.\nAll five ships saw action in the North Sea during the war; they served together as the VI Division of the III Battle Squadron, with  serving as the fleet flagship. Four were present during the Battle of Jutland;  was in dock at the time. Of the four ships that took part in the battle, only  was damaged, being struck by two heavy-caliber shells. The ships also took part in Operation Albion in the Baltic Sea; during the operation they were reorganized as the IV Battle Squadron, under the command of Vice Admiral Wilhelm Souchon. At the end of the war, all five ships were interned at the British naval base at Scapa Flow. On 21 June 1919, they were scuttled to prevent their seizure by the Royal Navy. The ships were subsequently raised and broken up for scrap between 1929 and 1937.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"5\" | 10 ×\n| rowspan=\"5\" |\n| 3 screws, steam turbines,\n| 1909\n| 1 August 1912\n| rowspan=\"5\" | Scuttled at Scapa Flow, 21 June 1919\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, steam turbines,\n| rowspan=\"4\" | 1910\n| 15 October 1912\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, steam turbines,\n| 14 May 1913\n|- valign=\"center\"\n! scope=\"row\" |\n| 2 screws, steam turbines,\n| 19 August 1913\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, steam turbines,\n| 31 July 1913\n|}\nKönig class\n, , , and , the four ships of the  class, were the most powerful warships of the High Seas Fleet at the outbreak of war in 1914. The s were an improvement over the preceding ; one of the wing turrets was moved forward and placed in a superfiring arrangement, while the second wing turret was moved to the centerline amidships. This allowed for a wider angle of fire on the broadside, as all 10 guns could fire on a larger area compared to the earlier s.\nThe class operated as a unit throughout World War I—the V Division of the III Battle Squadron. The ships took part in a number of fleet operations during the war, including the Battle of Jutland, where they acted as the vanguard of the German line and were heavily engaged by the British fleet. The ships also took part in Operation Albion against the Russians in 1917, where  sank the battleship . They survived the war and were interned at Scapa Flow in November 1918. All four ships were scuttled there on 21 June 1919.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"4\" | 10 ×\n| rowspan=\"4\" |\n| 3 screws, steam turbines,\n| rowspan=\"3\" | 1911\n| 9 August 1913\n| rowspan=\"4\" | Scuttled at Scapa Flow, 21 June 1919\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, steam turbines,\n| 30 July 1914\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, steam turbines,\n| 1 October 1914\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, steam turbines,\n| 1912\n| 8 November 1914\n|}\nBayern class\nThe four -class ships were the first super-dreadnoughts built by the German navy. The class comprised , , , and . Construction started on the ships shortly before World War I;  was laid down in 1913,  and  followed in 1914, and , the final ship, was laid down in 1915. Only  and  were completed, as ship building priorities shifted as the war dragged on. It was determined that U-boats were more valuable to the war effort, and so work on new battleships was slowed and ultimately stopped altogether. As a result,  and  were the last German battleships completed by the .\nand  were commissioned into the fleet in July 1916 and March 1917, respectively. This was too late for either ship to take part in the Battle of Jutland on 31 May and 1 June 1916.  was assigned to the naval force that drove the Imperial Russian Navy from the Gulf of Riga during Operation Albion in October 1917, though the ship was severely damaged from a mine and had to be withdrawn to Kiel for repairs.  replaced  as the flagship of the High Seas Fleet, but saw no combat. Both vessels were interned at Scapa Flow following the Armistice in November 1918.  was successfully scuttled on 21 July 1919, but British guards managed to beach  to prevent her from sinking. The ship was eventually expended as a gunnery target in 1921.  and , both at various stages of completion when the war ended, were broken up for scrap metal in the early 1920s.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"4\" | 8 ×\n| rowspan=\"2\" |\n| 3 screws, steam turbines,\n| rowspan=\"2\" | 1913\n| 15 July 1916\n| Scuttled at Scapa Flow, 21 June 1919\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, steam turbines,\n| 18 October 1916\n| Ceded to Great Britain, expended as a gunnery target in 1921\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"2\" |\n| 3 screws, steam turbines and diesel engine,\n| 1914\n| —\n| Incomplete at the end of war, scrapped in 1922\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, steam turbines,\n| 1915\n| —\n| Incomplete at the end of war, scrapped in 1921\n|}\nL 20e α class\nThe L 20e α design was a plan for an unknown number of battleships to be built in 1918 for the German navy. The design was selected on 2 October 1917, and construction was to have started 11 September 1918. The ships would have been significantly larger than the preceding  class, at more than  longer than the preceding ships. The ships would have been the first German warship to have mounted guns larger than 16&nbsp;in (40.6&nbsp;cm&nbsp;cm). However, Germany's declining war situation meant that the ships were never built.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the L 20e α class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"top\"\n! scope=\"row\" | L 20e α\n| 8 ×\n|\n| 4 screws, steam turbines,\n| —\n| —\n| Design study only\n|}\nFast battleships\nScharnhorst class\nThe two -class battleships were the first capital ships built for the Kriegsmarine after the end of World War I. They marked the beginning of German naval rearmament after the Treaty of Versailles. The class comprised two vessels:  and . The ships were armed with nine 28&nbsp;cm (11&nbsp;in) SK C/34 guns in three triple turrets, though there were plans to replace these weapons with six 38&nbsp;cm (15&nbsp;in) SK C/34 guns in twin turrets.\nThe two ships were laid down in 1935, launched in late 1936, and commissioned into the German fleet by early 1939.  and  operated together for much of the early portion of World War II, including sorties into the Atlantic to raid British merchant shipping. The two ships participated in Operation Weserübung, the German invasion of Norway. During operations off Norway, the two ships engaged the battlecruiser  and sank the aircraft carrier — in the engagement with Glorious,  achieved one of the longest-range naval gunfire hits in history. In early 1942, the two ships made a daylight dash up the English Channel from occupied France to Germany.\nIn late 1942,  was heavily damaged in an Allied air raid against Kiel. In early 1943,  joined the -class battleship  in Norway to interdict Allied convoys to the Soviet Union.  and several destroyers sortied from Norway to attack a convoy; the Germans were instead intercepted by British naval patrols. During the Battle of North Cape, the Royal Navy battleship  sank . In the meantime, repair work on  had begun, and the ship was in the process of being rearmed. However, when  was sunk, work on her sister was abandoned. Instead, she was sunk as a blockship in Gdynia in 1945; the wreck was broken up for scrap in the 1950s.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"2\" | 9 ×\n| rowspan=\"2\" |\n| 3 screws, steam turbines,\n| 1935\n| 7 January 1939\n| Sunk at the Battle of North Cape, 26 December 1943\n|- valign=\"center\"\n! scope=\"row\" |\n| 3 screws, steam turbines,\n| 1935\n| 21 May 1938\n| Scuttled in Gotenhafen in 1945, raised and scrapped in 1951\n|}\nBismarck class\nand  were the last and largest battleships completed by the German navy, as well as the heaviest ever built in Europe. They were built according to the terms of the Anglo-German Naval Agreement signed in 1935, and ostensibly displaced no more than the  specified in the agreement. The ships were, in actuality, some  heavier at full load. The ships were built to counter new French battleships then under construction.\nBoth ships saw combat during World War II.  was deployed in May 1941 to raid British shipping in the Atlantic Ocean along with the heavy cruiser . During the operation,  sank the battlecruiser  and heavily damaged the new battleship  and forced her to retreat. All of the available British naval assets were mobilized in a massive hunt to track and destroy . Several days later,  was disabled by a torpedo hit from a Fairey Swordfish launched from  and subsequently destroyed by the battleships  and  on 27 May.\ns career was less active; she spent the majority of the war as a fleet in being in occupied Norway. The Royal Navy attempted to sink her with midget submarines, but these efforts were unsuccessful. In November 1944, RAF Lancaster bombers hit the ship three times with  bombs, which caused her to capsize and sink. The wreck was eventually broken up in 1948–1957.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the  class\n|- valign=\"center\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"center\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" |\n| rowspan=\"2\" | 8 ×\n|\n| 3 screws, steam turbines,\n| 1936\n| 28 April 1940\n| Sunk on 27 May 1941\n|- valign=\"center\"\n! scope=\"row\" |\n|\n| 3 screws, geared steam turbines,\n| 1936\n| 25 February 1941\n| Sunk on 12 November 1944, scrapped 1948–1957\n|}\nH-class proposals\nThe H-class was a series of battleship designs to fulfill the requirements of Plan Z in the late 1930s and early 1940s. The first variation, \"H-39\", called for six ships to be built, essentially as enlarged s with  guns. The \"H-41\" design improved the \"H-39\" ship with still larger main guns, with eight  weapons. Two subsequent plans, \"H-42\" and \"H-43\", increased the main battery yet again, with  pieces, and the monstrous \"H-44\" design ultimately resulted with  guns. Due to the outbreak of war in 1939, none of the ships were ever built; only two of the \"H-39\" ships were laid down, and what work had been accomplished was scrapped shortly thereafter.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: center;\"\n|+ Summary of the H-class proposals\n|- valign=\"top\"\n! scope=\"col\" rowspan=\"2\" | Ship\n! scope=\"col\" rowspan=\"2\" | Armament\n! scope=\"col\" rowspan=\"2\" | Displacement\n! scope=\"col\" rowspan=\"2\" | Propulsion\n! scope=\"col\" colspan=\"3\" | Service\n|- valign=\"top\"\n! scope=\"col\" | Laid down\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Fate\n|- valign=\"center\"\n! scope=\"row\" | H-39\n| 8 ×\n|\n| rowspan=\"2\" | 3 screws, diesel engines,\n| 1939\n| rowspan=\"5\" | —\n| Canceled 30 September 1939\n|- valign=\"center\"\n! scope=\"row\" | H-41\n| 8 ×\n|\n| rowspan=\"4\" | —\n| rowspan=\"4\" | —\n|- valign=\"center\"\n! scope=\"row\" | H-42\n| 8 ×\n|\n| rowspan=\"3\" | Unknown\n|- valign=\"center\"\n! scope=\"row\" | H-43\n| 8 ×\n|\n|- valign=\"center\"\n! scope=\"row\" | H-44\n| 8 ×\n|\n|}\nFootnotes\nNotes\ns, the armored frigate , and the  and es of coastal defense ships. See: .\n}}\n.\n}}\n}}\nCitations\nReferences\n*\n}}\n*\n}}\n*\n| url=https://archive.org/details/conwaysallworlds0000unse_z3o0\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n| url-access = registration\n| url = https://archive.org/details/ironcladsillustr0000hore\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\nFurther reading\n*\n*\n}}"
    }
  ]
}