{
  "content": [
    {
      "type": "text",
      "text": "# List of battlecruisers of Japan\n\n, on 23 January 1915.]]\nThe Imperial Japanese Navy () built four battlecruisers, with plans for an additional four, during the first decades of the 20th century. The battlecruiser was an outgrowth of the armoured cruiser concept, which had proved highly successful against the Russian Baltic Fleet in the Battle of Tsushima at the end of the Russo-Japanese War. In the aftermath, the Japanese immediately turned their focus to the two remaining rivals for imperial dominance in the Pacific Ocean: Britain and the United States. Japanese naval planners calculated that in any conflict with the U.S. Navy, Japan would need a fleet at least 70&nbsp;percent as strong as the United States' in order to emerge victorious. To that end, the concept of the Eight-Eight fleet was developed, where eight battleships and eight battlecruisers would form a cohesive battle line. Similar to the German Imperial Navy () and in contrast to the Royal Navy, the Japanese envisioned and designed battlecruisers that could operate alongside more heavily armoured battleships to counter numerical superiority.\nThe first phase of the Eight-Eight plan began in 1910, when the Diet of Japan authorised the construction of one battleship () and four battlecruisers of the . Designed by British naval architect George Thurston, the first of these battlecruisers () was constructed in Britain by Vickers, while the remaining three were constructed in Japan. Armed with eight  guns and with a top speed of , they were the most advanced capital ships of their time. At the height of the First World War, an additional four battlecruisers of the  were ordered. The ships would have had a main battery of ten  guns, but none were ever completed as battlecruisers, as the Washington Naval Treaty limited the size of the navies of Japan, Britain and the United States. Before the Second World War, a further class of two battlecruisers were planned (Design B-65), but more pressing naval priorities and a faltering war effort ensured these ships never reached the construction phase.\nOf the eight battlecruiser hulls laid down by Japan (the four Kongō and four Amagi class), none survived the Second World War. Amagi was being converted to an aircraft carrier when its hull was catastrophically damaged by the Great Kantō earthquake in 1923 and subsequently broken up, while the last two of the Amagi class were scrapped in 1924 according to the terms of the Washington Treaty.  was converted to an aircraft carrier in the 1920s, but was scuttled after suffering severe damage from air attacks during the Battle of Midway on 5 June 1942. The four Kongō-class ships were lost in action as well: two during the Naval Battle of Guadalcanal in November 1942, one by American submarine in November 1944, and one by American aircraft at Kure Naval Base in July 1945.\nKey\n{|class=\"wikitable plainrowheaders\"\n|+ Definitions\n| scope=\"row\"|Main guns\n| The number and type of the main battery guns\n|-\n| scope=\"row\"|Armour\n| Thickness of the armoured belt\n|-\n| scope=\"row\"|Displacement\n| Ship displacement at full combat load\n|-\n| scope=\"row\"|Propulsion\n| Number of shafts, type of propulsion system, and top speed generated\n|-\n| scope=\"row\"|Service\n| The dates work began and finished on the ship and its ultimate fate\n|-\n| scope=\"row\"|Laid down\n| The date the keel began to be assembled\n|-\n| scope=\"row\"|Commissioned\n| The date the ship was commissioned\n|-\n| scope=\"row\"|Fate\n| The eventual fate of the ship (e.g., sunk, scrapped)\n|}\nKongō class\nThe four  ships were the first battlecruisers ordered by the Imperial Japanese Navy. The four ships were authorised in 1910 as part of the Emergency Naval Expansion Bill, in response to the construction of HMS Invincible by the British Royal Navy. Designed by British naval architect George Thurston, the first ship of the class (Kongō) was constructed in Britain by Vickers, with the remaining three built in Japan. They were armed with eight  main guns, could sail at , and were considered to \"outclass all other [contemporary] ships\". Kongō was completed in August 1913, Hiei in August 1914, and Haruna and Kirishima in April 1915. The vessels saw minor patrol duty during the First World War.\nIn the aftermath of the Washington Naval Treaty, all four ships underwent extensive modernisation in the 1920s and 1930s, which reconfigured them as fast battleships. The modernisations strengthened their armour, equipped them with seaplanes, overhauled their engine plant, and reconfigured their armament. With a top speed of  and efficient engine plants, all four were active in the Second World War; Hiei and Kirishima sailed with the carrier strikeforce to attack Pearl Harbor, while Kongō and Haruna sailed with the Southern Force to invade Malaya and Singapore. Hiei and Kirishima were lost during the Naval Battle of Guadalcanal, Kongō was torpedoed on 21 November 1944 in the Formosa Strait, and Haruna was sunk during the Bombing of Kure on 28 July 1945.\n{|class=\"wikitable plainrowheaders\"\n|+ Specifications and service data\n! scope=\"col\" align= center rowspan=2 | Ship\n! scope=\"col\" align= center rowspan=2 | Main guns\n! scope=\"col\" align= center rowspan=2 | Armour\n! scope=\"col\" align= center rowspan=2 | Displacement\n! scope=\"col\" align= center rowspan=2 | Propulsion\n! scope=\"col\" align= center colspan=3 | Service\n|-valign=\"top\"\n! scope=\"col\" align= center | Laid down\n! scope=\"col\" align= center | Commissioned\n! scope=\"col\" align= center | Fate\n|- valign=\"center\"\n| scope=\"row\" align= left |\n| align= center rowspan=4  | 8 ×\n| align= center rowspan=4 |\n| align= center rowspan=4 |\n| align= left rowspan=4 | 4 screws, steam turbines,  (later )\n| align= center | 17 January 1911\n| align= center| 16 August 1913\n| align= left | Torpedoed in the Formosa Strait, 21 November 1944\n|- valign=\"center\"\n| scope=\"row\" align= left |\n| align= center | 4 November 1911\n| align= center| 4 August 1914\n| align= left | Scuttled following Naval Battle of Guadalcanal, 13 November 1942\n|- valign=\"center\"\n| scope=\"row\" align= left |\n| align= center | 17 March 1912\n| align= center| 19 April 1915\n| align= left | Sank following Naval Battle of Guadalcanal, 15 November 1942\n|- valign=\"center\"\n| scope=\"row\" align= left |\n| align= center | 16 March 1912\n| align= center| 19 April 1915\n| align= left | Sunk by air attack, Kure Naval Base, 28 July 1945\n|- valign=\"center\"\n|-\n|}\nAmagi class\nas an aircraft carrier]]\nAs part of the Eight-Eight fleet, four s were planned. The order for these ships and four battleships of the  put an enormous strain on the Japanese government, which by that time was spending a full third of its budget on the navy.  was the first ship to be laid down; construction began on 6 December 1920 at the naval yard in Kure. Amagi followed ten days later at the Yokosuka naval yard. Atagos keel was laid in Kobe at the Kawasaki shipyard on 22 November 1921, while Takao, the fourth and final ship of the class, was laid down at the Mitsubishi shipyard in Nagasaki on 19 December 1921.\nThe terms of the February 1922 Washington Naval Treaty forced the class' cancellation, but the two closest to completion (Amagi and Akagi) were saved from the scrappers by a provision that allowed two capital ships to be converted to aircraft carriers. However, the 1923 Great Kantō earthquake caused significant stress damage to the hull of Amagi. The structure was too heavily damaged to be usable, and conversion work was abandoned.  was reordered as an aircraft carrier.|group=N}} Amagi was struck from the navy list and sold for scrapping, which began on 14 April 1924. The other two ships, Atago and Takao, were officially cancelled two years later (31 July 1924) and were broken up for scrap in their slipways. Akagi went on as an aircraft carrier to fight in the Second World War, where it was sunk after air attack during the Battle of Midway.\n{|class=\"wikitable plainrowheaders\"\n|+ Specifications and service data\n!scope=\"col\" align= center rowspan=2 | Ship\n! scope=\"col\" align= center rowspan=2 | Main guns\n! scope=\"col\" align= center rowspan=2 | Armour\n! scope=\"col\" align= center rowspan=2 | Displacement\n! scope=\"col\" align= center rowspan=2 | Propulsion\n! scope=\"col\" align= center colspan=3 | Service\n|-valign=\"top\"\n! scope=\"col\" align= center | Laid down\n! scope=\"col\" align= center | Commissioned\n! scope=\"col\" align= center | Fate\n|- valign=\"center\"\n| scope=\"row\" align= left |Amagi\n| align= center rowspan=4  | 10 ×\n| align= center rowspan=4 |\n| align= center rowspan=4 |\n| align= left rowspan=4 | 4 screws, steam turbines,\n| align= center | 16 December 1920\n| align= center| November 1923 (projected)\n| align= left | Reordered as aircraft carrier; damaged in earthquake; cancelled and scrapped\n|- valign=\"center\"\n| scope=\"row\" align= left |\n| align= center | 6 December 1920\n| align= center| December 1923\n| align= left | Reordered and completed as aircraft carrier\n|- valign=\"center\"\n| scope=\"row\" align= left | Atago\n| align= center | 22 November 1921\n| align= center| December 1924\n| align= left | Cancelled and scrapped\n|- valign=\"center\"\n| scope=\"row\" align= left | Takao\n| align= center | 19 December 1921\n| align= center| December 1924\n| align= left | Cancelled and scrapped\n|- valign=\"center\"\n|-\n|}\nDesign B-64/B-65 class\nDesign B-64 was originally intended to be part of Japan's Night Battle Force, a force that would attack an enemy fleet's outer defence ring of cruisers and destroyers under the cover of darkness. After penetrating the ring, Japanese cruisers and destroyers would launch torpedo attacks on the enemy's battleships. The remainder of the enemy would be finished off by the main fleet on the following day. The B-64s were intended to support the lighter cruisers and destroyers in these nighttime strikes. This strategy was altered when the Japanese learned the specifications of the United States'  large cruisers. The design was enlarged and redesignated B-65; their purpose would now be to screen the main battle fleet against the threat posed by the fast and heavily armed Alaskas. With war looming in 1940, the Japanese focused on more useful and versatile ship types such as aircraft carriers and cruisers; the Japanese defeat at the 1942 Battle of Midway meant that the ships were postponed indefinitely, and with more important strategic considerations to worry about, the ships were never built.\n{|class=\"wikitable plainrowheaders\"\n|+ Specifications and construction data\n! scope=\"col\" align= center rowspan=2 | Ship\n! scope=\"col\" align= center rowspan=2 | Main guns\n! scope=\"col\" align= center rowspan=2 | Armour\n! scope=\"col\" align= center rowspan=2 | Displacement\n! scope=\"col\" align= center rowspan=2 | Propulsion\n! scope=\"col\" align= center colspan=3 | Service\n|-valign=\"top\"\n! scope=\"col\" align= center | Laid down\n! scope=\"col\" align= center | Commissioned\n! scope=\"col\" align= center | Fate\n|- valign=\"center\"\n| scope=\"row\" align= left |Yard number 795 (not named)\n| align= center rowspan=2  | 9&nbsp;×&nbsp;\n| align= center rowspan=2 |\n| align= center rowspan=2 |\n| align= left rowspan=2 | Four sets of geared steam turbines,\n| rowspan=2 align= center | NA\n| align= center| 1945 (projected)\n| rowspan=2 align= left | Not ordered due to war\n|- valign=\"center\"\n| scope=\"row\" align= left | Yard number 796 (not named)\n| align= center| 1946 (projected)\n|-\n|}\nSee also\n* List of battleships of Japan\n* List of cruisers of Japan\n* List of destroyers of Japan\nReferences\nNotes\nCitations\nBibliography\n*\n*\n*\n* Jackson, Robert (2000).  ''The World's Great Battleships.  Brown Books.\n*\n* McCurtie, Francis (1989) [1945]. Jane's Fighting Ships of World War II. London: Bracken Books.\n* Schom, Alan (2004). The Eagle and the Rising Sun; The Japanese-American War, 1941–1943. Norton & Company.\n* Stille, Mark (2008). Imperial Japanese Navy Battleship 1941–1945''. Oxford: Osprey Publishing.\n*"
    }
  ]
}