{
  "content": [
    {
      "type": "text",
      "text": "# List of Intangible Cultural Heritage elements in France\n\n]]\nThe United Nations Educational, Scientific and Cultural Organisation (UNESCO) intangible cultural heritage elements are the non-physical traditions and practices performed by a people. As part of a country's cultural heritage, they include celebrations, festivals, performances, oral traditions, music, and the making of handicrafts. The \"intangible cultural heritage\" is defined by the Convention for the Safeguarding of Intangible Cultural Heritage, drafted in 2003 and took effect in 2006. Inscription of new heritage elements on the UNESCO Intangible Cultural Heritage Lists is determined by the Intergovernmental Committee for the Safeguarding of Intangible Cultural Heritage, an organisation established by the convention.\nFrance ratified the convention on 11 July 2006. It registered its first element on the representative list in 2008.\nIntangible Cultural Heritage of Humanity\nRepresentative List\n{|class=\"wikitable sortable plainrowheaders\"\n! style=\"width:25%\" | Name\n! class=\"unsortable\"| Image\n! Year\n! No.\n! class=\"unsortable\"| Description\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Processional giants and dragons in Belgium and France +\n|\n| 2008\n| 00153\n| The processional giants and dragons of Belgium and France are a set of folkloric manifestations involving processional giants and dragons.\n|-\n! scope=\"row\" | Maloya\n|\n| 2009\n| 00249\n| Maloya is one of the two major music genres of Réunion, usually sung in Réunion Creole, and traditionally accompanied by percussion and a musical bow.\n|-\n! scope=\"row\" | Aubusson tapestry\n|\n| 2009\n| 00250\n| Aubusson tapestry is tapestry manufactured at Aubusson, in the upper valley of the Creuse in central France.\n|-\n! scope=\"row\" | Scribing tradition in French timber framing\n|\n| 2009\n| 00251\n| The art of the carpentry brings together the graphic means in use since the 13th century in France, making it possible to express through drawing and with the greatest precision the reality of the volumes of a building, their penetrations as well as the characteristics of the parts of wood which allows them to be composed.\n|-\n! scope=\"row\" | Gastronomic meal of the French\n|\n| 2010\n| 00437\n|\n|-\n! scope=\"row\" | Craftsmanship of Alençon needle lace-making\n|\n| 2010\n| 00438\n| Alençon lace or point d'Alençon is a needle lace that originated in Alençon. It is sometimes called the \"Queen of lace.\" Lace making began during the 16th century and the local industry was rapidly expanded during the reign of Louis XIV by Jean-Baptiste Colbert, who established a Royal Workshop in the town to produce lace in the Venetian style in 1665.\n|-\n! scope=\"row\" | Compagnonnage, network for on-the-job transmission of knowledge and identities\n|\n| 2010\n| 00441\n| Compagnonnage refers to a traditional system of transmitting knowledge and training for a profession, which is anchored in communities of journeymen. An aspiring journeyman trains for a profession through a series of educational practices supervised by the community of journeymen he wishes to join.\n|-\n! scope=\"row\" | Equitation in the French tradition\n|\n| 2011\n| 00440\n|\n|-\n! scope=\"row\" | Fest-Noz, festive gathering based on the collective practice of traditional dances of Brittany\n|\n| 2012\n| 00707\n| A fest noz is a Breton traditional festival, with dancing in groups and live musicians playing acoustic instruments.\n|-\n! scope=\"row\" | Limousin septennial ostensions\n|\n| 2013\n| 00885\n| The Limousin septennial ostensions is a series of religious processions in commemoration of the relics of Roman Catholic saints in Limousin.\n|-\n! scope=\"row\" | Gwoka: music, song, dance and cultural practice representative of Guadeloupean identity\n|\n| 2014\n| 00991\n| Gwo ka is a French creole term for big drum. Alongside Gwotanbou, simply Ka or Banboula (archaic), it refers to both a family of hand drums and the music played with them, which is a major part of Guadeloupean folk music.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Summer solstice fire festivals in the Pyrenees +\n|\n| 2015\n| 01073\n| The summer solstice fire festivals take place in the Pyrenees every year on the night of the day when the sun is at its zenith.\n|-\n! scope=\"row\" | Carnival of Granville\n|\n| 2016\n| 01077\n| The Carnival de Granville is a carnival which takes place every year, during the five days on the occasion of Mardi Gras, in Granville.\n|-\n! scope=\"row\" | The skills related to perfume in Pays de Grasse: the cultivation of perfume plants, the knowledge and processing of natural raw materials, and the art of perfume composition\n|\n| 2018\n| 01207\n| The know-how linked to perfumery in the town of Grasse.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Art of dry stone construction, knowledge and techniques +\n|\n| 2018\n| 02106\n| Dry stone is a building method by which structures are constructed from stones without any mortar to bind them together.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Alpinism +\n|\n| 2019\n| 01471\n|\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Craftsmanship of mechanical watchmaking and art mechanics +\n|\n| 2020\n| 01560\n|\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Musical art of horn players, an instrumental technique linked to singing, breath control, vibrato, resonance of place and conviviality +\n|\n| 2020\n| 01581\n|\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| The art of glass beads +\n|\n| 2020\n| 01591\n|\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Falconry, a living human heritage +\n|\n| 2021\n| 01708\n|\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Bear festivities in the Pyrenees +\n|\n| 2022\n| 01846\n|\n|-\n! scope=\"row\" | Artisanal know-how and culture of baguette bread\n|\n| 2022\n| 01883\n|\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Knowledge, craft and skills of handmade glass production +\n|\n| 2023\n| 01961\n|\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Transhumance, the seasonal droving of livestock +\n|\n| 2023\n| 01964\n| Transhumance is a type of pastoralism or nomadism, a seasonal movement of livestock between fixed summer and winter pastures.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Funfair culture +\n|\n| 2024\n| 02108\n|\n|-\n! scope=\"row\" | Skills of Parisian zinc roofers and ornamentalists\n|\n| 2024\n| 02105\n|\n|}\nGood Safeguarding Practices\n{|class=\"wikitable sortable plainrowheaders\"\n! style=\"width:25%\" | Name\n! Year\n! No.\n! class=\"unsortable\"| Description\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Craft techniques and customary practices of cathedral workshops, or Bauhütten, in Europe, know-how, transmission, development of knowledge and innovation +\n| 2020\n| 01558\n| A Bauhütten (cathedral workshop), is a structure dedicated to the construction, maintenance and restoration of a monument with a specific mode of operation, known as Bauhüttenwesen.\n|-\n! scope=\"row\" | The Martinique yole, from construction to sailing practices, a model for heritage safeguarding\n| 2020\n| 01582\n| In Martinique, the yole was originally a boat intended for fishermen.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Tocatì, a shared programme for the safeguarding of traditional games and sports +\n| 2022\n| 01709\n|\n|}\nElements in Need of Urgent Safeguarding\n{|class=\"wikitable sortable plainrowheaders\"\n! style=\"width:25%\" | Name\n! class=\"unsortable\"| Image\n! Year\n! No.\n! class=\"unsortable\"| Description\n|-\n! scope=\"row\" | Cantu in paghjella, a secular and liturgical oral tradition of Corsica\n|\n| 2009\n| 00315\n| The paghjella is a traditional Corsican polyphonic song, composed of six lines of eight syllables, where a rhythm is recreated with each word and creates poetry.\n|}\nSee also\n* List of World Heritage Sites in France\nNotes\nReferences\nExternal links\n* [https://ich.unesco.org/en/home UNESCO Intangible Cultural Heritage]: Official site\n* [https://ich.unesco.org/en/state/france-FR  UNESCO Intangible Cultural Heritage in France]: Official site"
    }
  ]
}