{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in Scotland__disambig_1\n\n, with the New Town beyond, is at the heart of the Edinburgh World Heritage Site]]\nWorld Heritage Sites in Scotland are locations that have been included in the UNESCO World Heritage Programme list of sites of outstanding cultural or natural importance to the common heritage of humankind. Historic Environment Scotland is responsible for 'cultural' sites as part of their wider responsibility towards the historic environment. The Environment Directorate is responsible for natural sites.\nThere are currently seven sites in Scotland, with one further site undergoing a process of formal evaluation. Informal discussion of a site for  \"Þings\" (Norse parliaments) has taken place.\nExisting sites\nThe seven existing sites are mapped to the right and described in detail below. They are:\n# St. Kilda\n# Old Town, Edinburgh and New Town\n# The Heart of Neolithic Orkney\n# New Lanark\n# The Antonine Wall\n# The Forth Bridge\n# The Flow Country\nSt. Kilda is a small, out-lying archipelago of Hebridean islands which was inscribed as a \"natural\" site in 1986. In 2004, the site was extended to include a large amount of the surrounding marine features as well as the islands themselves. In July 2005 it became one of the few World Heritage Sites to hold joint status for its natural and cultural qualities. The islands were bequeathed to the National Trust for Scotland in 1957. They are also a Biosphere Reserve and a National Scenic Area.\n\"Edinburgh Old and New Towns\" were together inscribed as a World Heritage Site in 1996. The former includes the medieval Royal Mile which runs from Edinburgh Castle to the Palace of Holyroodhouse, and is bordered to the north by the neo-classical 18th century \"New Town\" which includes Princes Street. It is managed by the Edinburgh World Heritage Trust.\n\"The Heart of Neolithic Orkney\" includes Maeshowe, the Ring of Brodgar, Skara Brae, the Standing Stones of Stenness and other nearby sites. It was inscribed in 1999 and is managed by Historic Scotland.\nNew Lanark was inscribed in 2001. It is a restored 18th century industrial cotton mill village in South Lanarkshire constructed by Robert Owen as an experiment in utopian socialism. Restoration was organised by the New Lanark Conservation Trust, which was formed in 1974.\n]]\nThe Antonine Wall was inscribed in July 2008. It is an extension to a wider series of sites in England, Austria, Germany and Slovakia entitled \"Frontiers of the Roman Empire\". The Wall is the remains of a defensive line made of turf c. 20 feet high, with nineteen forts. It was constructed after 139 AD and extended for 37 miles between the Firth of Forth and the Firth of Clyde. The wall was overrun and abandoned soon after 160 AD, then occupied again for a brief period after 197 AD.\n]]\nThe Forth Bridge was inscribed as a World Heritage Site on 5 July 2015. Its three iconic diamond-shaped towers form a cantilever bridge completed in 1890 carrying a dual-track railway line  above the waters of the Firth of Forth  north-west of Edinburgh over a distance of  . Network Rail, the current owners of the bridge, made their initial opposition to a nomination clear, being concerned this could impose \"additional burdens\" on their ability to operate it. Nonetheless, the bridge was nominated for inclusion in early 2014. The listing recognised it as \"an extraordinary and impressive milestone in bridge design and construction during the period when railways came to dominate long-distance land travel.\"\nCommenting on World Heritage Day in 2008, Linda Fabiani the then Scottish Minister for Europe, External Affairs and Culture stated: \"We can... take the opportunity to reflect upon the contribution of our own World Heritage Sites and their place in the global story of humanity. We can celebrate, with justified pride, Scotland's contribution\".\nA year later the then Culture Minister Mike Russell MSP announced at Mount Rushmore in the United States that Historic Scotland had launched a project called the Scottish Ten. This was to use laser scanners to create digital models of Scotland's five World Heritage Sites and for another five sites elsewhere, including the Mount Rushmore National Memorial. The aim is to use the digital imagery to aid in the \"conservation, maintenance and management of these globally important sites\". The amount of data stored will be significant. Similar work recently done on Rosslyn Chapel near Edinburgh resulted in the storage of terabytes of data, the scans being made up of 8 billion individual points. This information will be held on special secure servers and a budget of £1.5 million has been allocated to the project.\nAlso in 2009, the Clydesdale Bank commemorated Scotland's sites on the reverses of a new series of banknotes: an image based on a historical photograph of St Kilda residents appeared on the £5 notes; of the Old and New Towns of Edinburgh on the  £10 notes; of New Lanark on the £20 notes; of the Antonine Wall on the £50 notes; and of Neolithic Orkney on the £100 notes.\nThe Flow Country of Caithness and Sutherland in the north of Scotland was inscribed in July 2024. It is one of the largest and most intact areas of blanket bog in the world, supporting a distinctive wildlife community. Its 4,000 square kilometres support numerous rare plants and insects and important populations of golden plover, dunlin, greenshank, and black-throated divers.\nTentative list\nThe United Kingdom tentative list comprises sites which may be nominated for inscription over the next 5–10 years. Including the now-inscribed Antonine Wall, four Scottish sites were on the 2006 list. Several sites were then added in 2010, of which only three were selected for a short list created in 2011.\nThe one short-listed candidate remaining after designation of the Flow Country in 2024 is the Zenith of Iron Age Shetland including Mousa Broch, Old Scatness and Jarlshof as a cultural candidate.\nThe 2010 applications to join the Tentative List that were not carried forward were: Arbroath Abbey; Buildings of Charles Rennie Mackintosh in Glasgow; and St Andrews, Medieval Burgh and Links. (Arbroath Abbey's application was made on the basis of its link with the 14th century Declaration of Arbroath. The signing of the declaration is celebrated in the Abbey each year on 6 April, an event that now coincides with Tartan Day in the US.)\nIn 2010, Secretary of State for Scotland Michael Moore said: \"All these sites have something special that draws people to them and they are recognisable across the world. I am delighted that so many of Scotland’s attractions have stepped forward and answered the UK government’s call for world heritage status.\nThe Minister for Culture and External Affairs, Fiona Hyslop MSP (who took on the post from Fabiani in 2009) said: \"Many groups, individuals and local authorities across Scotland put work into nominating places that mean a lot to them and I would like to thank them for the enthusiasm they have shown for our historic environment\".\nMike Cantlay, the chairman of VisitScotland said: \"We sell Scotland to the world, bringing millions of visitors and billions of pounds to the economy and World Heritage status certainly helps make Scotland an even more attractive option for visitors in search of interesting things to see and do\". The Heart of Neolithic Orkney site has certainly been a marketing success, with annual tourist numbers visiting Skara Brae alone now exceed 55,000 per annum. However some applications have drawn criticism based on the potential costs involved. The Cairngorm Mountains, a massif at the heart of the Cairngorms National Park was on the 2006 Tentative List, but is no longer under active consideration.\nOther explorations\nIn April 2010 delegates of the THING project (which is supported by the EU's Northern Periphery Programme) explored the possibility of a transnational World Heritage nomination, based on an expansion of Iceland's existing World Heritage Site Thingvellir. Shetland Amenity Trust place names officer, Eileen Brooke Freeman, said: \"We can identify many of the assembly sites throughout areas of Scandinavian influence by their common ting, thing, ding and fing place names\". Examples quoted include Gulating (Norway), Tinganes (Faroe Islands), Tingwall in both Shetland and in Orkney, Dingwall (Highland) and Tynwald (Isle of Man). It has also emerged that Thynghowe in Sherwood Forest, England is a contender to be part of such an initiative.\nIn May 2010, just a few weeks before the announcement of The Crucible of Iron Age Shetland's application, the Shetland Islands Council sponsored \"Move.Shetland\" newsletter publicised the Thing initiative, and listed various Shetland \"Thing\" districts such as Aithsting, Sandsting, Nesting, Lunnasting and Delting and the islet of Law Ting Holm, the former location of the national þing, or Norse parliament of Shetland.\nPublic sector involvement and support\nAccording to Historic Scotland \"Scottish Ministers identify and put forward sites to the Department for Culture, Media and Sport for nomination\". In August 2010 Hyslop stated that guidance on the revised application process would become available from Historic Scotland in due course. They have stated that \"the participation of a wide variety of stakeholders, including site managers, local and regional governments, local communities, NGOs and other interested parties and partners\" is encouraged.\nThe Antonine Wall near [[Twechar]]\nAssistance to local authorities is available from LAWHF - Local Authorities Working Together for World Heritage. Established in 1996, this organisation represents communities across the UK \"which have existing or potential World Heritage Sites within their areas.\" Historic Scotland and LAWHF have liaison meetings from time to time.\nEdinburgh World Heritage is a charity funded in 1999 through donations, from the City of Edinburgh Council and Historic Scotland, with the role of conserving, enhancing and promoting the city's World Heritage Site. In 2010 it was announced that Edinburgh City Council are considering a 2% \"transient guest tax\" on visitors staying in larger hotels. If implemented, the tax could raise £3 million or more, which would be used for marketing the city and on maintenance work designed to retain the existing World Heritage Site status.\nAfter the 2008 inscription, the \"Access to the Antonine Wall\" project was created by the Central Scotland Forest Trust, North Lanarkshire Council and Falkirk Council. It has provided better information about the best routes to visit the Wall and provides information about other local facilities.\nSee also\n*Prehistoric Scotland\n*Prehistoric Orkney\n*List of World Heritage Sites in the United Kingdom\n*List of World Heritage Sites in Europe\nReferences and footnotes\nNotes\nCitations\nGeneral references\n*[https://whc.unesco.org/en/statesparties/gb UNESCO site for UK World Heritage] Retrieved 03.01.2007.\n*[https://whc.unesco.org/en/tentativelists/state=gb UNESCO Tentative lists] Retrieved 05.01.2007.\n*[https://web.archive.org/web/20080529185217/http://www.scottish.parliament.uk/business/research/pdf_res_notes/rn01-73.pdf Scottish Executive policy for World Heritage Sites] Retrieved 03.01.2007.\n*[http://www.historic-scotland.gov.uk/index/heritage/worldheritage/world-heritage-sites-in-scotland.htm Historic Scotland - World Heritage] Retrieved 29 April 2012.\n*[http://www.historic-scotland.gov.uk/index/heritage/worldheritage/achieving-world-heritage-status.htm Historic Scotland - UK Tentative List] Retrieved 29 April 2012.\n*[https://web.archive.org/web/20051128065254/http://www.snh.org.uk/scottish/nhighland/PeatlandsofCSl.asp Scottish Natural Heritage - peatlands] Retrieved 1 January 2007.\n*[http://www.rspb.org.uk/reserves/guide/f/forsinard/ RSPB Forsinard reserve] Retrieved 29 April 2012.\n*[http://www.scotland.gov.uk/News/Releases/2003/02/3152 Antonine Wall nomination]  Retrieved 03.01.2007.\n*Keay, J. & Keay, J. (1994) Collins Encyclopaedia of Scotland. London. HarperCollins.\n*Robertson, Anne S. (1960) The Antonine Wall. Glasgow Archaeological Society.\n*Watson, Adam (1975) The Cairngorms. Edinburgh. The Scottish Mountaineering Trust.\nExternal links\n*[http://www.historicenvironment.scot/worldheritage Historic Environment Scotland]\n* [http://www.scottishten.org/ The Scottish Ten Project]\n*[https://web.archive.org/web/20160110172858/http://www.kilda.org.uk/ St Kilda]\n*[http://www.newlanark.org/ New Lanark]\n*[http://www.ewht.org.uk/ Edinburgh World Heritage Trust]"
    }
  ]
}