{
  "content": [
    {
      "type": "text",
      "text": "# List of sites and peoples visited by the Hernando de Soto Expedition\n\nCharles M. Hudson map of 1997.]]\nThis is a list of sites and peoples visited by the Hernando de Soto Expedition in the years 1539–1543. In May 1539, de Soto left Havana, Cuba, with nine ships, over 620 men and 220 surviving horses and landed at Charlotte Harbor, Florida. This began his three-year odyssey through the Southeastern North American continent, from which de Soto and a large portion of his men would not return.\nThey met many varied Native American groups, most of them bands and chiefdoms related to the widespread Mississippian culture. Only a few of these ancestral cultures survived into the seventeenth century, or their descendants combined as historic tribes known to later Europeans. Others have been recorded only in the written historical accounts of de Soto's expedition.\nFlorida\nCharles M. Hudson map of 1997.]]\n* Uzita\n* Mocoso\n* Urriparacoxi\n* Timucua\n* Ocale\n* Acuera\n* Potano\n* Alachua culture\n* Northern Utina\n* Yustaga\n* Uzachile\n* Anhaica\n* Apalachee\n* Narváez expedition's \"Bay of Horses\"\nGeorgia\nThe second leg of the de Soto Expedition, from Apalachee to the Alibamu.\nThe peoples the expedition encountered in Georgia were speakers of Muskogean languages. The expedition made two journeys through Georgia - the first heading northeast to Cofitachequi in South Carolina, and the second heading southwest from Tennessee, at which point they visited the Coosa chiefdom.\nFirst Leg\n* Capachequi\n* Ichisi\n* Ocute\n* Hitchiti\nAfter leaving Ocute, the expedition crossed the \"Wilderness of Ocute\" (the modern-day Savannah River basin) to arrive in present-day South Carolina. Artifacts from the first leg have been found in Telfair County, Georgia.\nSecond Leg\nAll territory the expedition crossed through during this leg was under the control of Coosa, a paramount chiefdom with territory in Georgia, Alabama, and Tennessee.\n* Coosa chiefdom\n** Little Egypt, the likely site of the Coosa capital\n** Sixtoe Mound\n** Bell Field Mound Site\n** Talimachusi\n** Etowah Indian Mounds (Itaba)\nSouth Carolina\nThe primary destination of the expedition in South Carolina was the paramount chiefdom of Cofitachequi. The people of this chiefdom were likely the ancestors of the modern Cherokee and Catawba.\n* Hymahi\n* Cofitachequi, likely located at the present Mulberry Plantation\n** The Lady of Cofitachequi\n* Talimeco\nNorth Carolina\n* Joara, near Morganton, North Carolina\n* Cheraw (tribe)\n* Chelaque\nTennessee\nDe Soto's men burn Mabila, illustration by H.Roe\n* Chiska\n* Chiaha\n* Coste\n* Tali\n* Chalahume\n* Satapo\nAlabama\nParts of Coosa extended into Alabama. The other primary chiefdom encountered by the expedition was that of Tuscaluza. The peoples encountered in Alabama were likely the ancestors of the modern Creek, Alabama, and Choctaw.\n* Abihka\n* Chief Tuskaloosa\n* Mabila\n* Tali\nMississippi\nde Soto expedition route through Mississippi, and Arkansas, up to the point de Soto dies. Based on the Charles M. Hudson map of 1997.]]\n* Chicaza\n* Quizquiz\n* Walls phase\n* Quigate\n* Quigualtam\n* Natchez people\nArkansas\n* Aquixo\n* Casqui, believed by many archaeologists to be the same as the site of the Parkin Archeological State Park.\n* Pacaha, believed by many archaeologists to be the Nodena site.\n* Chaguate\n* Coligua\n* Tunica people\n* Tula people\n* Anilco, possibly the Menard complex in the southeastern corner of the state.\n* Guachoya\n* Quapaw\n* Caddoans\n** Aays Caddo confederacy.\n** Naguatex\nTexas\nde Soto expedition. This section shows Moscoso's route through Arkansas, and Texas, and then  to Mexico after de Soto's death. Based on the Charles M. Hudson map of 1997.]]All the peoples which the expedition encountered in Texas were the ancestors of the modern Caddo, especially the Hasinai and Kadohadacho confederacies. Intentionally misled by their Caddo guides, the expedition wandered around Texas while only encountering a few major Caddo centers, though there were many that lay not far beyond where they traveled. Eventually they were forced to turn around after reaching the River of Daycao, variously identified as the Brazos, Trinity, or even the Colorado. Beyond Daycao, the chroniclers of the expedition claimed that people did not grow maize and subsisted off the land as hunter-gatherers.\nAs this leg of the expedition took place after the death of both de Soto and Juan Ortiz, his primary translator, the records are more sparse and reveal less information than in earlier parts of the journey.\n* Caddo\n* Nadaco (Nondacao)\n* Hasinai\n* Soacatino\n* Adai (Native American culture)\nSee also\n* Alabama language\n* Caddoan languages\n* Cherokee language\n* Chickasaw language\n* Choctaw language\n* Creek language\n* Etowah Indian Mounds\n* Hitchiti\n* Lake Jackson Mounds Archaeological State Park\n* Lake Village, Arkansas\n* Mississippian culture\n* Moundville Archaeological Site\n* Ocmulgee National Monument\n* Pisgah phase\n* Southeastern Ceremonial Complex\n* Timucua language\n* Yamasee\n* Yazoo tribe\nReferences"
    }
  ]
}