{
  "content": [
    {
      "type": "text",
      "text": "# Listed buildings in Nottingham (Bilborough ward)\n\nBilborough is an electoral ward in the city of Nottingham, England.  The ward contains five listed buildings that are recorded in the National Heritage List for England.   Of these, one is listed at Grade&nbsp;II*, the middle of the three grades, and the others are at Grade&nbsp;II, the lowest grade.  The ward is a residential suburb to the north of the centre of the city, and the listed buildings consist of a church, its former rectory, a former forge, a house and cottages.\n__NOTOC__\nKey\n{| class=\"wikitable\n|-\n! Grade\n! Criteria\n|-\n|align=\"center\" |II*\n| Particularly important buildings of more than special interest\n|-\n|align=\"center\" |II\n| Buildings of national importance and special interest\n|}\nBuildings\n{| class=\"wikitable sortable plainrowheaders\" style=\"width:100%; border:0px; text-align:left; line-height:150%\"\n|-\n! scope=\"col\"  style=\"width:150px\" |Name and location\n! scope=\"col\"  style=\"width:100px\" class=\"unsortable\"|Photograph\n! scope=\"col\"  style=\"width:120px\" |Date\n! scope=\"col\"  style=\"width:650px\" class=\"unsortable\"|Notes\n! scope=\"col\"  style=\"width:50px\" |Grade\n|-\n|St Martin of Tours Church and walls\n|\n|align=\"center\"|\n|The church has been altered and extended through the centuries, and was restored in 1833 and in 1887–89.  It is built mainly in sandstone with slate roofs.  It consists of a nave, a south porch, a chancel and a west tower.  The tower is square, with diagonal buttresses, two-light bell openings, a string course, and an embattled parapet.  The porch is gabled with a Greek cross finial, and contains a doorway with an ogee arch and crockets, and two-light windows with ogee heads.  The churchyard wall is in stone, it is coped, and contains gateways.\n|align=\"center\" |\n|-\n|St Martin's Cottages\n|\n|align=\"center\"|\n|A pair of cottages in brick and stone with tile roofs.  The lower range to the left has two storeys and two bays, and contains casement windows and a horizontally-sliding sash window.  The right range has a single storey and attics, and three bays.  It contains two doorways, between which are two triangular-headed casement windows.  To the left is a horizontally-sliding sash window, and to the right is a casement window, both with segmental heads, and in the attic are three gabled dormers.\n|align=\"center\" |\n|-\n|338 Trowell Road\n|\n|align=\"center\"|\n|A pair of cottages combined into a house, in red brick, with dentilled eaves, and a pantile roof with coped gables.  There are two storeys and four bays.  The doorway has a fanlight, and the windows are horizontally-sliding sashes, those in the ground floor with segmental heads.\n|align=\"center\" |\n|-\n|Forge Cottage, wash house and wall\n|\n|align=\"center\"|\n|The forge and wash house, later a house and workshops, are in red brick and stone, with cogged eaves and tile roofs.  There are two storeys and five bays, and a lean-to on the right.  Most of the windows are casements, those in the ground floor with segmental heads.  The doorway has a fanlight, and above it is a semicircular window.  In the former forge is a segmental-headed doorway and hatch.  The adjoining wall is in stone with coping, and it extends along the street for about .\n|align=\"center\" |\n|-\n|Bilborough Old Rectory\n|\n|align=\"center\"|1842\n|The rectory, later used for other purposes, is stuccoed, on a stone plinth, with corner pilasters and a hipped slate roof.  There are two storeys and fronts of two and three bays.  In the centre of the entrance front is a square porch with corner pilasters and an entablature.  The garden front contains a two-storey bow window, and the other windows are sashes.\n|align=\"center\" |\n|-\n|}\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}