{
  "content": [
    {
      "type": "text",
      "text": "# List of ancient legal codes\n\nThe upper part of the stele of Hammurabi's code of laws.\nThe legal code was a common feature of the legal systems of the ancient Middle East. Many of them are examples of cuneiform law. The oldest evidence of a  code of law was found at Ebla, in modern Syria (c. 2400 BC). The Sumerian Code of Ur-Nammu (–2050 BC), then the Babylonian Code of Hammurabi (c. 1760 BC), are amongst the earliest originating in the Fertile Crescent. In the Roman empire, a number of codifications were developed, such as the Twelve Tables of Roman law (first compiled in 450 BC) and the Corpus Juris Civilis of Justinian, also known as the Justinian Code (429–534 AD). In India, the Edicts of Ashoka (269–236 BC) were followed by the Law of Manu (200 BC). In ancient China, the first comprehensive criminal code was the Tang Code, created in 624 AD in the Tang Dynasty.\nThe following is a list of ancient legal codes in chronological order:\n* Cuneiform law\n** The code of law found at Ebla (2400 BC)\n** Code of Urukagina (2380–2360 BC)\n** Code of Ur-Nammu, king of Ur (c. 2050 BC). Copies with slight variations found in Nippur, Sippar and Ur\n** Laws of Eshnunna (c. 1930 BC)\n** Code of Lipit-Ishtar (c. 1870 BC)\n** Babylonian law\n*** Code of Hammurabi (c. 1750 BC in middle chronology)\n** Hittite laws, also known as the 'Code of the Nesilim' (developed c. 1650–1500 BC, in effect until c. 1100 BC)\n** Assyrian law, also known as the Middle Assyrian Laws (MAL) or the Code of the Assyrians/Assura (developed c. 1450–1250 BC, oldest extant copy c. 1075 BC)\n* Law of Moses / Torah (10th–6th century BC)\n** Halakha (Jewish religious law, including biblical law and later talmudic and rabbinic law, as well as customs and traditions)\n* Draconian constitution (late 7th century BC)\n* Solonian Constitution (early 6th century BC)\n* Gortyn code (5th century BC)\n* Twelve Tables of Roman Law (451 BC)\n* Edicts of Ashoka of Buddhist Law (269–236 BC)\n* Law of Manu (c. 200 BC)\n* Tirukkural, Ancient Tamil laws and ethics compiled by Thiruvalluvar (31 BC–500 AD)\n* Corpus Juris Civilis (compiled 529–534 AD)\n** Code of Justinian\n** Digest or Pandects\n** Institutes of Justinian\n** Novellae Constitutiones\n* Sharia or Islamic Law (c. 570; Hanafi fiqh was not codified until the Ottoman Mecelle of the 1870s, the other schools were even later)\n* Traditional Chinese law\n** Tang Code (624 to 637)\n* Visigothic Code (642–653 AD)\n* Gentoo Code (origins unknown; translated from Sankskrit into Persian, English, German and French in 1776–1778)\n* Early Irish law or Brehon Law (8th century AD)\nSee also\n* Legal culture\nReferences"
    }
  ]
}