{
  "content": [
    {
      "type": "text",
      "text": "# List of Christmas hit singles in the United Kingdom\n\nThe following is an incomplete list of Christmas songs that have appeared in the official singles chart in the United Kingdom. A year indicates the first year of release for that artist's recorded version of the single or track, which may not necessarily be the first year the artist's version charted on The Official UK Charts. To be regarded as a Christmas hit, the song makes direct mention of Christmas, the winter season or the nativity; is a recognised Christmas hymn or carol; or has gone on to feature in Christmas compilation albums.\n{| class=\"wikitable sortable\"\n|-\n! Title\n! Artist\n! Year\n! Additional information\n|-\n| \"21st Century Christmas\"\n| Cliff Richard\n| 2006\n| Peaked at No. 2 on the 2006 December charts.\n|-\n| \"All I Want (For Christmas)\"\n| Liam Payne\n| 2019\n| Peaked at No. 73 on the Official Singles Chart in December 2019.\n|-\n| \"All I Want for Christmas Is a Beatle\"\n| Dora Bryan\n| 1963\n| Peaked at No. 20 in the 1963 Christmas chart.\n|-\n| \"All I Want for Christmas Is You\"\n| Mariah Carey\n| 1994\n| Written by Walter Afanasieff and Mariah Carey. Originally peaked at No. 2 on the Official Singles Chart in December 1994. Charted again on the Official Singles Chart in December 2007 (peaking at No. 4), in November 2008 (peaking at No. 12), in December 2009 (peaking at No. 18), in December 2010 (peaking at No. 22) and in December 2011 (peaking at No. 11). In December 2013 the song passed the one million sales mark in the UK. The band My Chemical Romance also recorded a version of the song. In 2020, Mariah Carey's version of the song finally peaked at No. 1 on the Official Singles Chart.\n|-\n| \"All Alone on Christmas\"\n| Darlene Love\n| 1992\n| From the film Home Alone 2: Lost in New York. Peaked at No. 31 in the 1992 Christmas Official Singles Chart.\n|-\n| \"All Join Hands\"\n| Slade\n| 1984\n| Peaked at No. 15 on the Official Singles Chart in November 1984.  Also peaked at No. 9 on the Irish Singles Chart and No. 19 on the Swedish singles chart in 1984.\n|-\n| \"Another Rock and Roll Christmas\"\n| Gary Glitter\n| 1984\n| Peaked at No. 7 on the Official Singles Chart in December 1984.\n|-\n| \"At This Time of Year\"\n| Craig Phillips\n| 2000\n| Big Brother winner's Christmas charity single for Down's Syndrome Association. Peaked at No. 14 on the Official Singles Chart after being in the Top 40 for three weeks. Phillips also appeared in the videos for Bo Selecta's \"Proper Crimbo\" (2003), and Ricky Tomlinson's \"Christmas My Arse\" (2006).\n|-\n| \"Ave Maria\"\n| Lesley Garrett & Amanda Thompson\n| 1993\n| Peaked at No. 16 on the 1993 Christmas Official Singles Chart.\n|-\n| \"Baby, It's Cold Outside\"\n| Tom Jones & Cerys Matthews\n| 1999\n| Peaked at No. 17 on the Official Singles Chart in December 1999. Written in 1944 by Frank Loesser and featured in the 1949 film ''Neptune's Daughter'' starring Esther Williams. No specific Christmas content but associated with Christmas.\n|-\n| \"Baby's First Christmas\"\n| Connie Francis\n| 1961\n| Peaked at No. 30 on the Official Singles Chart.\n|-\n| \"Best Christmas of Them All\"\n| Shakin' Stevens\n| 1990\n| Peaked at No. 19 on the Official Singles Chart. From the album Merry Christmas Everyone.\n|-\n| \"Bionic Santa\"\n| Chris Hill\n| 1976\n| Peaked at No. 10 on the Official Singles Chart.\n|-\n| \"Blue Christmas\"\n| Elvis Presley\n| 1964\n| Peaked at No. 11 in the 1964 Christmas Chart. Also a #2 hit for Shakin' Stevens in 1982, as part of the ''Shakin' Stevens EP.\n|-\n| \"Boots\"\n| The Killers\n| 2010\n| Peaked at No. 53 on the Official Singles Chart.\n|-\n| \"Carol of the Bells\"\n| John Williams\n| 1990\n| Peaked at No. 97 on the Official Singles Chart in December 2017.\n|-\n| \"Christmas Alphabet\"\n| Dickie Valentine\n| 1955\n| A Christmas No. 1 single on the Official Singles Chart in 1955. Covered in the US by The McGuire Sisters.\n|-\n| \"Christmas and You\"\n| Dave King\n| 1956\n| Peaked at No. 23 on the Official Singles Chart in December 1956.\n|-\n| \"Christmas Baby Please Come Home\"\n| Michael Bublé\n| 2011\n| Peaked at No. 47 on the Official Singles Chart in December 2011.\n|-\n| \"Christmas Countdown\"\n| Frank Kelly\n| 1982\n| Peaked at No. 26 on the Official Singles Chart in December 1983 but first released in Ireland a year earlier.\n|-\n| \"Christmas in Blobbyland\"\n| Mr Blobby\n| 1995\n| Peaked at No. 36 on the Official Singles Chart in December 1995.\n|-\n| \"Christmas in Dreadland\"\n| Judge Dread\n| 1975\n| Peaked at No. 14 on the Official Singles Chart in December 1975.\n|-\n| \"Christmas in Hollis\"\n| Run–D.M.C.\n| 1987\n| Peaked at No. 56 on the Official Singles Chart in December 1987.\n|-\n| \"Christmas in Smurfland\"\n| Father Abraham & The Smurfs\n| 1978\n| Peaked at No. 19 on the Official Singles Chart in December 1978.\n|-\n| \"Christmas Is All Around\"\n| Billy Mack\n| 2003\n| Recorded for the film Love Actually''. Peaked at No. 23 on the Official Singles Chart.\n|-\n| \"Christmas Island\"\n| Dickie Valentine\n| 1956\n| Peaked at No. 8 on the Official Singles Chart in December 1956.\n|-\n| \"A Christmas Kiss\"\n| Daniel O'Donnell\n| 1999\n|\n|-\n| \"Christmas Lights\"\n| Coldplay\n| 2010\n| Digital download track, which peaked at No. 13 on the Official Singles Chart for the week of 12 December 2010.\n|-\n| \"Christmas Medley\"\n| Weekend\n| 1985\n| Peaked at No. 47 on the Official Singles Chart in December 1985.\n|-\n| \"Christmas My Arse\"\n| Ricky Tomlinson\n| 2006\n| Video features Craig Phillips, first winner of the UK version of Big Brother.\n|-\n| \"Christmas on 45\"\n| Holly and The Ivys\n| 1981\n| Peaked at No. 40 on the Official Singles Chart in December 1981. A spoof of the Stars on 45/Hooked on Classics trope popular that year.\n|-\n| \"Christmas Rappin'\"\n| Kurtis Blow\n| 1979\n| Peaked at No. 30 on the Official Singles Chart in December 1979.\n|-\n| \"Christmas Rapping\"\n| Dizzy Heights\n| 1982\n| Peaked at No. 49 on the Official Singles Chart in December 1982.\n|-\n| \"Christmas Song\"\n| Gilbert O'Sullivan\n| 1974\n| Peaked at No. 12 on the Official Singles Chart in 1974.\n|-\n| \"The Christmas Song\"\n| Nat King Cole\n| 1946\n| Peaked at No. 51 on the Official Singles Chart in December 2019. The Alexander O'Neal cover peaked at No. 30 in December 1988.\n|-\n| \"Christmas Spectre\"\n| Jingle Belles\n| 1983\n| Peaked at No. 37 on the Official Singles Chart in December 1983.\n|-\n| \"Christmas Through Your Eyes\"\n| Gloria Estefan\n| 1992\n| Released as a double A side with \"Miami Hit Mix\". Peaked at No. 8 on the Official Singles Chart.\n|-\n| \"Christmas Time (Don't Let the Bells End)\"\n| The Darkness\n| 2003\n| Peaked at No. 2 on the Official Singles Chart.\n|-\n| \"Christmas Time\"\n| Bryan Adams\n| 1985\n| Peaked at No. 55 on the Official Singles Chart in December 1985.\n|-\n| \"Christmas Tree Farm\"\n| Taylor Swift\n| 2019\n| Peaked at No. 71 on the Official Singles Chart in December 2019.\n|-\n| \"Christmas Will Be Just Another Lonely Day\"\n| Brenda Lee\n| 1964\n| Peaked at No. 6 on the Official Singles Chart in December 1962.\n|-\n| \"Christmas Wrapping\"\n| The Waitresses\n| 1981\n| Peaked on No. 45 on the Official Singles Chart in December 1982. First appeared on the 1981 various artists holiday compilation album A Christmas Record (Ze Records). Covered in 1998 by the Spice Girls and released as a B-side on their single \"Goodbye\".\n|-\n| \"Coldcut's Christmas Break\"\n| Coldcut\n| 1989\n|\n|-\n| \"Cozy Little Christmas\"\n| Katy Perry\n| 2018\n| Peaked on No. 22 on the Official Singles Chart in December 2019.\n|-\n| \"Cruise Into Christmas Medley\"\n| Jane McDonald\n| 1998\n| Medley of \"White Christmas\", \"Winter Wonderland\" and \"Santa Claus Is Coming To Town\".\n|-\n| \"Cuddle Up Cozy Down Christmas\"\n| Dolly Parton & Michael Bublé\n| 2020\n| Peaked at No. 81 on the Official Singles Chart in December 2020.\n|-\n| \"December, 1963 (Oh, What a Night)\"\n| The Four Seasons\n| 1975\n| Peaked at No. 1 on the Official Singles Chart in early 1976. Its implied Christmas setting was made explicit in the 2005 Jersey Boys cast recording.\n|-\n| \"December Brings Me Back to You\"\n| Andy Abraham featuring Michael Underwood\n| 2006\n| The GMTV Christmas single for host Michael Underwood, written and sung with X Factor star Andy Abraham. Peaked at No. 18 on the Official Singles Chart.\n|-\n| \"December Will Be Magic Again\"\n| Kate Bush\n| 1979\n| Not released until the Christmas season of 1980. The single peaked at No. 29 on the Official Singles Chart.\n|-\n| \"December Song (I Dreamed of Christmas)\"\n| George Michael\n| 2009\n| Peaked at No. 14 on the Official Singles Chart\n|-\n| \"Ding Dong, Ding Dong\"\n| George Harrison\n| 1974\n| This record – written by Harrison as a celebration of the New Year – peaked at No. 38 on the Official Singles Chart.\n|-\n| \"Dominick the Donkey\"\n| Lou Monte\n| 1960\n| Peaked at No. 3 on the Official Singles Chart in 2011 as part of a campaign by Chris Moyles.\n|-\n| \"Do They Know It's Christmas?\"\n| Band Aid\n| 1984\n| A benefit recording by an all-star group to assist famine relief in Ethiopia; organized by Bob Geldof of the Irish rock band The Boomtown Rats. Written by Geldof and Midge Ure of the British rock band Ultravox. A Christmas No. 1 single on the Official Singles Chart in 1984, and re-recorded on three other separate occasions: Band Aid II in 1989, Band Aid 20 in 2004 and Band Aid 30 in 2014.\n|-\n| \"Don't Shoot Me Santa\"\n| The Killers\n| 2007\n| Peaked at No. 34 on the Official Singles Chart.\n|-\n| \"Driving Home for Christmas\"\n| Chris Rea\n| 1988\n| Peaked at No. 53 on the Official Singles Chart in December 1988 as an EP.  The song re-charted on the Official Singles Chart in December 2007 (peaking at No. 33), in December 2008 (peaking at No. 53), in December 2009 (peaking at No. 40), in January 2011 (peaking at No. 67) and in December 2011 (peaking at No. 27). In early January 2022, the song reached a new peak of No. 10.\n|-\n| \"Echoes of Merry Christmas Everyone\"\n| Shakin' Stevens\n| 2015\n| A 30th anniversary song, using a different style compared to the original \"Merry Christmas Everyone\" that reached the Christmas No. 1 spot in 1985. This 2015 reworking uses folk and bluegrass influences, with prominent use of banjo.\n|-\n| \"Every Year, Every Christmas\"\n| Luther Vandross\n| 1995\n| Peaked at No. 43 on the Official Singles Chart.\n|-\n| \"Fairytale of New York\"\n| The Pogues featuring Kirsty MacColl\n| 1987\n| Written by Jem Finer and Shane MacGowan. Peaked at No. 2 the Official Singles Chart in December 1987, and beaten to No. 1 by the Pet Shop Boys' \"Always on My Mind\".  Also peaked at No. 1 on the Irish singles chart (where it continues to be the most popular Christmas song).\n|-\n| \"Father Christmas Do Not Touch Me\"\n| The Goodies\n| 1974\n| Peaked at No. 7 on the Official Singles Chart. Part of a double A-side.\n|-\n| \"Fifty Grand for Christmas\"\n| Paul Holt\n| 2004\n|\n|-\n| \"Feliz Navidad\"\n| José Feliciano\n| 1970\n| Peaked at No. 54 on the Official Singles Chart in December 2019.\n|-\n| \"Footprints in the Snow\"\n| Johnny Duncan & The Bluegrass Boys\n| 1957\n| Peaked at No. 27 on the Official Singles Chart.\n|-\n| \"Gaudete\"\n| Steeleye Span\n| 1973\n| First charted on the Official Singles Chart in December 1973, peaking at No. 14.\n|-\n| \"The Gift\"\n| Sidemen\n| 2019\n| Peaked at No. 77 on the Official Singles Chart in December 2019.\n|-\n| \"The Gift of Christmas\"\n| Childliners\n| 1995\n| Peaked at No. 9 on the Official Singles Chart.\n|-\n| \"Give U One 4 Christmas\"\n| Hot Pantz\n| 2005\n| Peaked at No. 64 on the Official Singles Chart.\n|-\n| \"Hallelujah\"\n| Alexandra Burke\n| 2008\n| This version and a Jeff Buckley version occupied the top two spots on the 2008 Christmas Day chart.\n|-\n| \"Happy Xmas (War Is Over)\"\n| John and Yoko and The Plastic Ono Band with the Harlem Community Choir\n| 1971\n| Written by John Lennon and Yoko Ono. Originally charted on the Official Singles Chart in December 1972, peaking at No. 4. Reached a new peak of No. 2 on the Official Singles Chart in December 1980 after the death of Lennon. Later covered by Melissa Etheridge in 1994, The Polyphonic Spree, Celine Dion in 1997, The Idols, The Alarm, Neil Diamond, the Street Drum Corps ft. Bert McCracken of The Used, Sarah McLachlan in 2006, and most recently by John Legend in 2019.\n|-\n| \"Have a Cheeky Christmas\"\n| Cheeky Girls\n| 2003\n| Peaked at No. 10 on the Official Singles Chart.\n|-\n| \"Hey Mr. Christmas\"\n| Showaddywaddy\n| 1974\n| Peaked at No. 13 in the Christmas 1974 Official Singles Chart.\n|-\n| \"Hokey Cokey\"\n| The Snowmen\n| 1981\n| Peaked at No. 18 on the 1981 Christmas Official Singles Chart. Black Lace's version peaked at No. 31 in 1985.\n|-\n|\"The Holy City\"\n|Moira Anderson\n|1969\n|Peaked at No. 43 on the Official Singles Chart.\n|-\n|\"I Believe in Christmas\"\n|The Tweenies\n|2001\n|Peaked at No. 9 on the Official Singles Chart.\n|-\n| \"I Believe in Father Christmas\"\n| Greg Lake\n| 1975\n| Written by Greg Lake and Peter Sinfield. Peaked at No. 2 on the Official Singles Chart (behind Queen's \"Bohemian Rhapsody\") in December 1975.  Charted again in December 1982 (peaking at No. 72) and again in December 1983 (peaking at No. 65).\n|-\n| \"I Got You Babe\"\n| ''Bo' Selecta!\n| 2004\n| Second Christmas single released by Bo' Selecta!, featuring Davina McCall and Patsy Kensit.\n|-\n| \"I Have Forgiven Jesus\"\n| Morrissey\n| 2004\n| Peaked at No. 10 on the 2004 UK December chart.\n|-\n| \"I Love Christmas\"\n| Fast Food Rockers\n| 2003\n| Peaked at No. 25 on the Official Singles Chart.\n|-\n| \"I Saw Mommy Kissing Santa Claus\"\n| Jimmy Boyd\n| 1952\n| Peaked at No. 6 on the Official Singles Chart in December 1953. The Jimmy Boyd version was one of three versions to chart in 1953; the others were recorded by the Beverley Sisters and Billy Cotton.\n|-\n| \"I Want an Alien for Christmas\"\n| Fountains of Wayne\n| 1997\n| Peaked at No. 36 on the Official Singles Chart.\n|-\n| \"I Was Born on Christmas Day\"\n| Saint Etienne co-starring Tim Burgess\n| 1993\n| Peaked at No. 37 on the Official Singles Chart in December 1993.\n|-\n| \"I Wish It Could Be a Wombling Merry Christmas Everyday\"\n| The Wombles with Roy Wood\n| 2000\n| A newly recorded combination of \"I Wish It Could Be Christmas Everyday\" and \"Wombling Merry Christmas\".\n|-\n| \"I Wish It Could Be Christmas Everyday\"\n| Wizzard\n| 1973\n| Featuring backing vocals by the Suedettes, plus the Stockland Green Bilateral School First Year Choir, with additional noises by Miss. Snob and Class 3C. Peaked at No. 4 on the Official Singles Chart. Re-recorded by the writer, Wizzard frontman Roy Wood, in 1981 after the original mastertapes were lost, then again in 1984 as a 12\" single, and then again with his Roy Wood Big Band as a live single in 1995. Later covered by the A*Teens, Kylie Minogue, Girls Aloud, the Big Reunion and Wilson Phillips (whose version peaked at No. 14 on the Billboard'' Hot Adult Contemporary Tracks chart in December 2010).\n|-\n| \"If Every Day Was Like Christmas\"\n| Elvis Presley\n| 1966\n| Peaked at No. 13 in the 1966 Christmas Chart.\n|-\n| \"I'll Be Home\"\n| Meghan Trainor\n| 2020\n| Peaked at No. 83 on the Official Singles Chart in December 2020.\n|-\n| \"I'll Be Home for Christmas\"\n| Shakin' Stevens\n| 1991\n| Peaked at No. 34 on the Official Singles Chart. From the album Merry Christmas Everyone.\n|-\n| \"I'm Walking Backwards for Christmas\"\n| The Goons\n| 1956\n| Peaked at No. 4 in 1956. In a typically Goon-esque move, the record was released in the middle of summer.\n|-\n| \"In Dulci Jubilo\"\n| Mike Oldfield\n| 1975\n| Peaked at No. 4 on the Official Singles Chart in early 1976.  Also known as \"Good Christmas Men, Rejoice\" and \"In Sweetest Jubilee\".\n|-\n| \"In the Bleak Midwinter\"\n| Jamie Cullum\n| 2020\n| Cover of the traditional Christmas carol. Peaked at No. 90 on the Official Singles Chart in December 2020.\n|-\n| \"Is This Christmas?\"\n| The Wombats\n| 2008\n|\n|-\n| \"It Doesn't Often Snow at Christmas\"\n| Pet Shop Boys\n| 1997\n| Peaked at No. 40 on the Official Singles Chart in December 2009.\n|-\n| \"It Won't Seem Like Christmas Without You\"\n| Elvis Presley\n| 1968\n| The first posthumous UK top 40 hit to feature the word Christmas when peaking at No. 13 in the 1979 Official Singles Chart.\n|-\n| \"It's Beginning to Look a Lot Like Christmas\"\n| Perry Como\n| 1951\n| First charted on the Official Singles Chart in 2007, but peaked at No. 47 in 2008.\n|-\n| \"It's Christmas Time\"\n| Status Quo\n| 2008\n| Peaked at No. 40 on the Official Singles Chart.\n|-\n| \"It's Gonna Be a Cold Cold Christmas\"\n| Dana\n| 1975\n| Peaked at No. 4 on the Official Singles Chart in 1975.\n|-\n| \"It's the Most Wonderful Time of the Year\"\n| Andy Williams\n| 1963\n| Peaked at No. 21 on the 2007 Christmas charts.\n|-\n| \"It Must Be Santa\"\n| Joan Regan\n| 1961\n| Peaked at No. 42 on the Official Singles Chart.\n|-\n| \"Jingle Bell Rock\"\n| Max Bygraves\n| 1959\n| Peaked at No. 7 in the 1959 Christmas Chart; however, the many American versions that did not chart in the UK are now more widely known from frequent use on television and in films. The Bobby Helms version peaked at No. 30 in December 2019.\n|-\n| \"Jingle Bells\"\n| Basshunter\n| 2006\n| Peaked at No. 34 on the 2008 Christmas chart.\n|-\n| \"Keeping the Dream Alive\"\n| Freiheit\n| 1988\n| A UK hit single at Christmas 1988, peaking at number 14; originally recorded in the German language a year earlier.  Although it has no Christmas-themed lyrics, the song's distinctly Christmassy feel, coupled with the time of year when it was originally released, gradually led it to be regarded as a Christmas hit and has resulted in its being featured on several UK Christmas compilation albums such as Christmas Top 100.\n|-\n| \"Last Christmas\"\n| Wham!\n| 1984\n| Written by George Michael.  Peaked at No. 2 on the Official Singles Chart in December 1984. Re-released in 1985. Rumoured to have been written for Easter, but later changed to Christmas to boost sales. It was covered by Alien Voices featuring The Three Degrees in 1988 (which reached No. 54), the cast of the television series \"The Only Way is Essex\" (which peaked at No. 33 in 2011), and Crazy Frog (which peaked at No. 16 in 2006). A version by Whigfield reached No. 21 in 1995.\n|-\n| \"Let It Snow, Let It Snow, Let It Snow\"\n| Dean Martin\n| 1959\n| Peaked at No. 39 on the Official Singles Chart in 2019.  Originally released on Martin's 1959 album A Winter Romance.\n|-\n| \"Let's Party\"\n| Jive Bunny & the Mastermixers\n| 1989\n| A medley of three Christmas hits: \"Merry Xmas Everybody\" by Slade, \"I Wish It Could Be Christmas Everyday\" by Wizzard and finally \"Another Rock and Roll Christmas\" by Gary Glitter. The song was remixed again in 2004, replacing Gary Glitter with Mariah Carey singing \"All I Want for Christmas Is You\". This mix is available to only DJs.\n|-\n| \"Lick a Smurp for Christmas\"\n| Father Abraphart & The Smurps\n| 1978\n| A Jonathan King spoof of the Smurfs. Peaked at No. 58 on the Official Singles Chart.\n|-\n| \"Light Up\"\n| Flakefleet Primary School\n| 2018\n| Peaked at No. 64 on the Official Singles Chart in December 2018.\n|-\n| \"Like It's Christmas\"\n| Jonas Brothers\n| 2019\n| Peaked at No. 53 on the Official Singles Chart in December 2019.\n|-\n| \"Little Donkey\"\n| Beverley Sisters\n| 1959\n| Peaked at No. 14, Gracie Fields' version peaked at No. 21 the same year, but the song topped the sheet music charts. Dutch duo Nina & Frederik had more success with the song in 1960, peaking at No. 3.\n|-\n| \"Little Town\"\n| Cliff Richard\n| 1982\n| A contemporary reworking of the Victorian carol O Little Town of Bethlehem, peaked at No. 11 on the 1982 Christmas Official Singles Chart.\n|-\n| \"Little Drummer Boy\"\n| Pipes & Drums & Military Band of The Royal Scots Dragoon Guards\n| 1972\n| Peaked at No. 13 in the 1972 Official Singles Chart. A second version by Terry Wogan & Aled Jones peaked at No. 3 on the 2008 Christmas chart.\n|-\n| \"Lonely Pup (In a Christmas Shop)\"\n| Adam Faith with the Children\n| 1960\n| Peaked at No. 4 on the Official Singles Chart in December 1960.\n|-\n| \"Lonely This Christmas\"\n| Mud\n| 1974\n| A Christmas No. 1 single on the Official Singles Chart in 1974.\n|-\n| \"Make a Daft Noise for Christmas\"\n| The Goodies\n| 1975\n| Peaked at No. 20 on the Official Singles Chart.\n|-\n| \"Man with the Bag\"\n| Jessie J\n| 2015\n| Cover of the Kay Starr original, which did not chart. Peaked at No. 70 on the Official Singles Chart in December 2019.\n|-\n| \"Mary's Boy Child\"\n| Harry Belafonte\n| 1957\n| Written by Jester Hairston. Spent seven weeks at No. 1 on the Official Singles Chart at the end of 1957. The reissue one year later reached the Top 10. Also a Top 40 hit for Nina & Frederik in 1959.\n|-\n| \"Mary's Boy Child – Oh My Lord\"\n| Boney M.\n| 1978\n| A disco medley. The previous entry combined with a new song written by Frank Farian and Fred Jay. The UK Christmas No. 1 of 1978.\n|-\n| \"The Meaning of Christmas\"\n| Boris Gardiner\n| 1986\n| Peaked at No. 69 on the Official Singles Chart.\n|-\n| \"Merry Christmas Darling\"\n| The Carpenters\n| 1970\n| Peaked at No. 45 in the 1972 Christmas Official Singles Chart. Was re-released as a double A side in 1990 and this time peaked at No. 25.\n|-\n| \"Merry Christmas Everyone\"\n| Shakin' Stevens\n| 1985\n| Produced by Dave Edmunds. A Christmas No. 1 single on the Official Singles Chart in 1985.\n|-\n| \"Merry Gentle Pops\"\n| The Barron Knights\n| 1965\n| Novelty hit, which peaked at No. 9 in the 1965 Christmas chart.\n|-\n| \"A Merry Jingle\"\n| The Greedies\n| 1979\n| Charity single recorded by members of Thin Lizzy and Sex Pistols.  It peaked at No. 28 that year on the Official Singles Chart.\n|-\n| \"Merry Xmas Everybody\"\n| Slade\n| 1973\n| Written by Noddy Holder and Jim Lea. A Christmas No. 1 single on the Official Singles Chart in 1973. Covered by Dexys Midnight Runners in 1982, Steps, Noel Gallagher, and then Tony Christie in 2005. Has also been reissued by Slade on several occasions, most recently in 2006.\n|-\n| \"The Millennium Prayer\"\n| Cliff Richard\n| 1999\n| Topped the Official Singles Chart in December 1999.\n|-\n| \"Mistletoe\"\n| Justin Bieber\n| 2011\n| Peaked at No. 21 on the Official Singles Chart in 2011.\n|-\n| \"Mistletoe and Wine\"\n| Cliff Richard\n| 1988\n| A Christmas No. 1 single on the Official Singles Chart in 1988.\n|-\n| \"Mr. Hankey, the Christmas Poo\"\n| Mr. Hankey\n| 1999\n| Peaked at No. 4 on the Official Singles Chart in 1999.\n|-\n| \"Must Be Santa\"\n| Tommy Steele\n| 1960\n| Peaked at No. 40 on the Official Singles Chart.\n|-\n| \"Naughty Christmas (Goblin in the Office)\"\n| Fat Les\n| 1998\n|\n|-\n| \"Naughty List\"\n| Liam Payne & Dixie D'Amelio\n| 2020\n| Peaked at No. 55 on the Official Singles Chart in December 2020.\n|-\n| \"Never Mind the Presents\"\n| The Barron Knights\n| 1980\n| Novelty hit parody of various hits of the year. Peaked at No. 17 on the 1980 Official Singles Chart.\n|-\n| \"New Year\"\n| Sugababes\n| 2000\n| Peaked at No. 12 on the Official Singles Chart.\n|-\n| \"Oh Santa!\"\n| Mariah Carey, Ariana Grande & Jennifer Hudson\n| 2020\n| Peaked at No. 67 on the Official Singles Chart in December 2020.\n|-\n| \"Once Upon a Christmas Song\"\n| Geraldine\n| 2008\n| Entered and peaked at No. 5 on the 2008 Christmas chart.\n|-\n| \"Once Upon a Long Ago\"\n| Paul McCartney\n| 1987\n| As with a previous Christmas McCartney hit, \"Pipes of Peace\", the song itself makes no mention of Christmas but was released for the Christmas market with a strongly Christmas themed video, peaking at No. 10 in the 1987 Christmas chart.\n|-\n| \"One I've Been Missing\"\n| Little Mix\n| 2019\n| Peaked at No. 59 on the Official Singles Chart in November 2019.\n|-\n| \"One More Sleep\"\n| Leona Lewis\n| 2013\n| Peaked at No. 3 on the Official Singles Chart in December 2013.\n|-\n| \"One Nine for Santa\"\n| Fogwell Flax & The Ankle Biters from Frehold Junior School\n| 1981\n| Peaked at No. 68 on the Official Singles Chart in 1981.\n|-\n| \"Peace on Earth/Little Drummer Boy\"\n| David Bowie and Bing Crosby\n| 1982\n| Peaked at No. 3 on the Official Singles Chart in December 1982. Recorded on 11 September 1977 for Crosby's UK holiday television special, ''Bing Crosby's Merrie Olde Christmas''. The song wasn't released as a commercial single until 1982, and a video clip of their duet from the TV special became an MTV staple for the remainder of the 1980s.\n|-\n| \"Pipes of Peace\"\n| Paul McCartney\n| 1983\n| Released for the 1983 Christmas market, but only topped the Official Singles Chart in January 1984. The song does not actually make any reference to Christmas but its accompanying video depicts the 1914 Christmas Day truce between British and German soldiers on the Western front.\n|-\n| \"Please Come Home For Christmas\"\n| Bon Jovi\n| 1994\n| Peaked at No. 7 on the Official Singles Chart in December 1994.  An earlier version of the song, by the Eagles, peaked at No. 30 on the Official Singles Chart in 1978.\n|-\n| \"The Perfect Year\"\n| Dina Carroll\n| 1993\n| From the Andrew Lloyd Webber musical Sunset Boulevard. Also recorded by Glenn Close and Alan Campbell on the 2001 album Andrew Lloyd Webber: Gold.\n|-\n| \"The Power of Love\"\n| Frankie Goes to Hollywood\n| 1984\n| Peaked at No. 1 on the Official Singles Chart in December 1984. Contains no reference to Christmas but was promoted with a nativity-themed video and charted again as a reissue at Christmas in 1993 and 2012. A cover version by Gabrielle Aplin, recorded for John Lewis' Christmas TV advertising campaign, reached No. 1 in December 2012.\n|-\n| \"Pretty Paper\"\n| Roy Orbison\n| 1964\n| Peaked at No. 6 on the Official Singles Chart in December 1964.\n|-\n| \"Proper Crimbo\"\n| ''Bo' Selecta!''\n| 2003\n| The promotional music video features guest appearances from various celebrities including Edith Bowman, Chris Moyles, Bob Geldof, Mel B, Christine Hamilton, Craig Phillips and Jimmy Carr.\n|-\n| \"Remembering Christmas\"\n| Exeter Bramdean Boys' Choir\n| 1993\n| Peaked at No. 46 on the Official Singles Chart.\n|-\n| \"Renta Santa\"\n| Chris Hill\n| 1975\n| Peaked at No. 10 on the Official Singles Chart.\n|-\n| \"River\"\n| Ellie Goulding\n| 2019\n| Cover of the Joni Mitchell original, which failed to chart. Peaked at No. 1 on the Official Singles Chart in December 2019.\n|-\n| \"Rockin' Around the Christmas Tree\"\n| Brenda Lee\n| 1958\n| Peaked at No. 3 on the Official Singles Chart in 1965. Was covered by Mel Smith and Kim Wilde under the name Mel & Kim in 1987, matching the chart position of the original. Was covered by Justin Bieber in 2020, peaking at No. 21.\n|-\n| \"Rockin' Good Christmas\"\n| Roy 'Chubby' Brown\n| 1996\n| Peaked at No. 51 on the Official Singles Chart.\n|-\n| \"Run Rudolph Run\"\n| Chuck Berry\n| 1958\n| Peaked at No. 83 on the Official Singles Chart in December 2019.\n|-\n| \"Same Old Lang Syne\"\n| Dan Fogelberg\n| 1980\n| Despite reaching the Top 10 of the U.S. Billboard Hot 100 singles chart in February 1981, the song didn't chart on the Official Singles Chart in the UK until 2008, peaking at No. 92.\n|-\n| \"Santa Baby\"\n| Kylie Minogue\n| 2007\n| Originally recorded in 2000 as part of the Top of the Pops Christmas Special was released a B-side to her single \"Please Stay\", which peaked at No.10. Reached No. 76 on the 2007 chart due to digital downloads. Re-Entered the Christmas charts in 2011, 2012 and 2015. Re-peaked at No.72 on the Christmas charts in 2016. It became Minogue's 50th UK Top 40 hit when it reached No.38 on the during the Christmas week chart in 2017.\n|-\n| \"Santa, Bring My Baby Back to Me\"\n| Elvis Presley\n| 1957\n| Peaked at No. 7 on the Official Singles Chart.\n|-\n| \"Santa Claus Is Back in Town\"\n| Elvis Presley\n| 1957\n| Peaked at No. 41 on the Official Singles Chart in 1980.\n|-\n| \"Santa Claus is Comin' to Town\"\n| Bruce Springsteen\n| 1985\n| Peaked at No. 9 on the Official Singles Chart in December 1985. Charted again on the Official Singles Chart for one week in December 2007 (peaking at No. 60).  Versions of the song recorded by other artists that charted on the Official Singles Chart include The Jackson 5 (peaked at No. 43 in December 1972), The Carpenters (peaked at No. 37 in December 1975), and Björn Again (peaked at No. 55 in December 1992).\n|-\n| \"Santa Claus Is on the Dole\"\n| Spitting Image\n| 1986\n| With \"1st Atheist Tabernacle Choir\" on the B-side.\n|-\n| \"Santa Tell Me\"\n| Ariana Grande\n| 2014\n| Initially peaked at No. 68 in 2014. It re-entered the charts at No. 90 in 2016. In 2017, it reached No. 29 and became the fifth most streamed Christmas song in the world on Spotify in the same year. In 2018, it reached a new peak of No. 13.\n|-\n| \"Santa's Coming for Us\"\n| Sia\n| 2017\n| Peaked at No. 39 on the Christmas chart in 2017, before re-peaking at No. 24 in December 2018.\n|-\n| \"Santa's List\"\n| Cliff Richard\n| 2003\n| Peaked at No. 5.\n|-\n| \"Santo Natale\"\n| David Whitfield\n| 1954\n| Literally translates to Merry Christmas and was a double A with \"O Come All Ye Faithful\". Was kept off the 1954 Christmas number one spot by Winifred Atwell's Let's Have Another Party.\n|-\n| \"Saviour's Day\"\n| Cliff Richard\n| 1990\n| A Christmas No. 1 single on the Official Singles Chart in 1990.\n|-\n| \"Silent Night\"\n| Bing Crosby\n| 1952\n| Peaked at No. 8 in the first ever UK Christmas chart of 1952 under the title \"Silent Night – Holy Night\". Bros peaked at No. 2 on the Official Singles Chart in December 1988 with their version on a double A-sided single (\"Cat Among the Pigeons\" was on the flip).\n|-\n| \"Silver Bells\"\n| Sir Terry Wogan & Aled Jones\n| 2009\n| Peaked at No. 29 on the Christmas Day chart in 2009.\n|-\n| \"Singalong-A-Santa\"\n| Santa Claus & The Christmas Trees\n| 1982\n| Peaked at No. 19 on the Official Singles Chart.\n|-\n| \"Singalong-A-Santa Again\"\n| Santa Claus & The Christmas Trees\n| 1983\n| Peaked at No. 39 on the Official Singles Chart.\n|-\n| \"Sleigh Ride\"\n| The Ronettes\n| 1963\n| Peaked at No. 34 on the Official Singles Chart in December 2019.\n|-\n| \"Snowbound for Christmas\"\n| Dickie Valentine\n| 1957\n| Peaked at No. 28 in the 1957 Christmas Chart.\n|-\n| \"Snow Coach\"\n| Russ Conway\n| 1959\n| Peaked at No. 7 on the Official Singles Chart.\n|-\n| \"Snowbird\"\n| Anne Murray\n| 1969\n| Canadian Christmas chart topper, which peaked at No. 23 on the 1970 Official Singles Chart.\n|-\n| \"So Near to Christmas\"\n| Alvin Stardust\n| 1984\n| Peaked at No. 29 on the Official Singles Chart.\n|-\n| \"A Spaceman Came Travelling\"\n| Chris de Burgh\n| 1975\n| Originally released on Chris de Burgh's second studio album, Spanish Train and Other Stories (1975). Became a Top 40 pop hit single on the Official Singles Chart in December 1986 following the success of de Burgh's UK No. 1 pop hit, \"The Lady in Red\".\n|-\n| \"Stay Another Day\"\n| East 17\n| 1994\n| A Christmas No. 1 single on the Official Singles Chart in 1994, famous for beating Mariah Carey's \"All I Want for Christmas Is You\" to that 1994 Christmas No. 1 spot. It has no Christmas-themed lyrics, although it has a Christmas themed video as well as an alternative video that has no Christmas theme.\n|-\n| \"Step Into Christmas\"\n| Elton John\n| 1973\n| The B-side of this 1973 single contained another holiday tune by Elton titled \"Ho Ho Ho (Who'd Be a Turkey at Christmas)\". Though not a big hit upon its initial release in 1973 when it peaked at No. 24, it has returned to the charts regularly, and finally made it into the top ten at the ninth time of asking in Christmas 2018. The following year, it peaked at No. 8, its highest position to date. The British indie-rock band The Wedding Present recorded a cover of \"Step Into Christmas\" that appeared on the 1991 various artists holiday compilation A Lump of Coal.\n|-\n| \"Stop the Cavalry\"\n| Jona Lewie\n| 1980\n| Peaked at No. 3 on the Official Singles Chart in December 1980.\n|-\n| \"Thank God It's Christmas\"\n| Queen\n| 1984\n| Peaked at No. 21 on the Official Singles Chart in December 1984.\n|-\n| \"This Christmas\"\n| Jess Glynne\n| 2020\n| Cover of the Donny Hathaway original, which did not chart. Peaked at No. 13 on the Official Singles Chart in December 2020.\n|-\n| \"This One's for the Children\"\n| New Kids on the Block\n| 1990\n| Peaked at No. 9 on the Official Singles Chart in December 1990.\n|-\n|\"Time Passages\"\n|Al Stewart\n|1978\n|Failed to chart as a single in the UK (despite being a major hit in other anglophone countries), but the titular Time Passages album reached No. 39 on the Official Albums Chart in 1979.\n|-\n| \"2000 Miles\"\n| Pretenders\n| 1983\n| Peaked at No. 15 on the Official Singles Chart in December 1983.\n|-\n| \"Under the Tree\"\n| The Water Babies\n| 2005\n|\n|-\n| \"Underneath the Tree\"\n| Kelly Clarkson\n| 2013\n| Peaked at No. 21 on the Official Singles Chart in December 2019.\n|-\n| \"The Very First Christmas of All\"\n| Ruby Murray\n| 1955\n| Peaked at No. 9.\n|-\n| \"The Lighthouse Keeper\"\n| Sam Smith\n| 2020\n| Peaked at No. 81 on the Official Singles Chart in December 2020.\n|-\n| \"Virgin Mary\"\n| Lonnie Donegan\n| 1960\n| Peaked at No. 27.\n|-\n| \"Walking in the Air\"\n| Peter Auty and the Sinfonia of London\n| 1982\n| From the 1982 film adaptation of The Snowman. Reached its highest chart position of No. 37 in 1987.  Later recorded by Aled Jones in 1985 (peaking at No. 5), and Nightwish in 1999.\n|-\n| \"Warm This Winter\"\n| Gabriella Cilmi\n| 2008\n| Cover of the 1962 Connie Francis song originally titled \"I'm Gonna Be Warm This Winter\". Top 30 hit on the 2008 Christmas chart.\n|-\n| \"What Are We Gonna Get 'Er Indoors\" (Interpolating \"In The Bleak Mid-Winter\")\n| George Cole and Dennis Waterman\n| 1983\n| A one-off single, a spin-off from the popular British TV series Minder, it was based musically on a piece by Gustav Holst, who for copyright reasons was given a joint co-composing credit on the label alongside the two performers. Peaked at No. 21 on the Official Singles Chart.\n|-\n| \"What If\"\n| Kate Winslet\n| 2001\n| Peaked at No. 6 on the Official Singles Chart in December 2001. Featured and based on the film Christmas Carol: The Movie released the same year.\n|-\n| \"We Should Be Together\"\n| Cliff Richard\n| 1991\n| Peaked at No. 10 on the Official Singles Chart in December 1991.\n|-\n| \"When a Child Is Born\"\n| Johnny Mathis\n| 1976\n| Based on the instrumental \"Soleado\" by Italian composer Ciro Dammicco. English lyrics by Fred Jay. A Christmas No. 1 single on the Official Singles Chart in 1976.\n|-\n| \"White Christmas\"\n| Mantovani\n| 1952\n| Peaked at No. 6 in the first ever UK Christmas chart in 1952. A Pat Boone version peaked at No. 29 on the Official Singles Chart in December 1957. Max Bygraves' version reached No. 71 in 1989. Bing Crosby's version did not chart until 1977, but it had originally been released before the UK singles chart began, and was eventually the most successful version, peaking at No. 5.\n|-\n| \"A Winter's Tale\"\n| David Essex\n| 1982\n| Peaked at No. 2 on the Official Singles Chart in January 1983.\n|-\n| \"A Winter's Tale\"\n| Queen\n| 1995\n| Debuted and peaked at No. 6 on the Official Singles Chart during Christmas week in December 1995.\n|-\n| \"Winter Wonderland\"\n| Johnny Mathis\n| 1958\n| Peaked at No. 17 on the Official Singles Chart but has been recorded by over 200 different artists.\n|-\n| \"Winter World of Love\"\n| Engelbert Humperdinck\n| 1969\n| Peaked at No. 7 in the 1969 Christmas Chart.\n|-\n| \"Wombling Merry Christmas\"\n| The Wombles\n| 1974\n| Peaked at No. 2 on the Official Singles Chart in December 1974.\n|-\n| \"Wonderful Christmastime\"\n| Paul McCartney\n| 1979\n| Peaked at No. 6 on the Official Singles Chart in December 1979. Backed with the B-side \"Rudolph the Red-Nosed Reggae\" (an instrumental cover of \"Rudolph the Red-Nosed Reindeer\").\n|-\n| \"Your Christmas Wish\"\n| The Smurfs\n| 1996\n| Peaked at No. 8 on the 1996 Christmas Official Singles Chart.\n|-\n| \"X-M@$\"\n| Corey Taylor\n| 2009\n| A UK top-thirty hit in 2009.\n|}\nSee also\n* Best-selling Christmas/holiday singles in the United States\n* Christmas music\n* List of Christmas carols\n* List of Christmas hit singles in the United States\n* List of Christmas number one singles (UK)\n* UK Singles Chart\nReferences"
    }
  ]
}