{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1835\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1835.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland).  For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign.  Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\".  Acts passed from 1963 onwards are simply cited by calendar year and chapter number.\nAll modern acts have a short title, e.g. the Local Government Act 2003.  Some earlier acts also have a short title given to them by later acts, such as by the Short Titles Act 1896.\n5 & 6 Will. 4\nThe first session of the 12th Parliament of the United Kingdom, which met from 19 February 1835 until 10 September 1835.\nThis session was also traditionally cited as 5 & 6 Gul. 4, 5 & 6 Wm. 4 or 5 & 6 W. 4.\nPublic general acts\nfor the more effectual Administration of Justice in England and Wales, so far as relates to the Execution of Criminals in the County of Chester.|note4= }}\n|  for preventing the Mischiefs arising from the printing and publishing Newspapers, and Papers of a like Nature, by Persons not known, and for regulating the Printing and Publication of such Papers in other respects; and to discontinue certain Actions commenced under the Provisions of the said Act.}}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  and Solicitors to make and file the same on or before the First Day of Hilary Term One thousand eight hundred and thirty-six; and to allow Persons to make and file such Affidavits, although the Persons, whom they served shall have neglected to take out their Annual Certificates.|note4= }}\n|  }}\n|\n|  for providing for the Government of His Majesty's Settlements in Western Australia on the Western Coast of New Holland.|note4= }}\n|  }}\n|  }}\n| |note4= }}\n|\n|  }}\n|  }}\n|  for vesting in Commissioners the Line of Road from Shrewsbury in the County of Salop to Bangor Ferry in the County of Carnarvon; and for discharging the Trustees under several Acts of the Seventeenth, Twenty eighth, Thirty-sixth, Forty-first, Forty-second, Forty-seventh, and Fiftieth Years of His then present Majesty, from the future Repair and Maintenance thereof, and for repealing so much of the said Acts as affects the said Line of Road.|note4= }}\n|  and the Third and Fourth Year of His present Majesty, relating to the Care and Treatment of Insane Persons in England.|note4= }}\n|  }}\n|\n|\n|  }}\n| or the Linen Manufacturers (Ireland) Act 1835|public|27|21-08-1835|archived=n|An Act to continue and amend certain Regulations for the Linen and Hempen Manufactures in Ireland.}}\n| or the '''Sheriffs' Declaration Act 1835|public|28|21-08-1835|repealed=y|archived=n|An Act for removing Doubts as to the Declaration to be made and Oaths to be taken by Persons appointed to the Office of Sheriff of any City or Town, being a County of itself.|note4= }}\n|  of the Court of Bankruptcy, and for the Relief of the Suitors in the said Court; and for removing Doubts as to the Extent of the Powers of the Court of Review and of the Subdivision Courts.|note4= }}\n|  }}\n|  }}\n|  }}\n|  for preventing Delays at the Quarter Sessions of the Peace, to other Indictments; and for extending the Provisions of an Act of the Seventh Year of King George the Fourth, as to taking Bail in Cases of Felony.}}\n| |note4= }}\n|\n|\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|\n|\n|  }}\n|  for compensating Owners of Slaves upon the Abolition of Slavery.|note4= }}\n|  for making Provision for the Dispatch of the Business now done by the Court of Exchequer in Scotland.|note4= }}\n|  as relates to the Amount of the Salary granted to the Clerk of the Crown in Chancery; and to make other Provisions in relation to the said Office.}}\n|  }}\n|  }}\n|\n|  for enabling His Majesty to direct the Issue of Exchequer Bills to a limited Amount for the Purposes therein mentioned.}}\n|  so far as they relate to the Creation of the Government of Agra.}}\n|  for regulating the Carriage of Passengers in Merchant Vessels from the United Kingdom to the British Possessions on the Continent and Islands of North America; and to make further Provision for regulating the Carriage of Passengers from the United Kingdom.}}\n|\n|\n|  }}\n|  to consolidate and amend the Laws relating to Savings Banks; and to consolidate and amend the Laws relating to Savings Banks in Scotland.|note4= }}\n|\n|  }}\n|  }}\n|  }}\n|  and to make Provisions for the Abolition of unnecessary Oaths.}}\n|  relating to Weights and Measures, and to make other Provisions instead thereof.}}\n|\n|\n|  }}\n|  }}\n|  of the Disembodied Militia in Great Britain and Ireland; and to grant Allowances in certain Cases to Subaltern Officers, Adjutants, Paymasters, Quarter Masters, Surgeons, Assistant Surgeons, Surgeons Mates, and Serjeant Majors of the Militia, until the First Day of July One thousand eight hundred and thirty-six.|note4= }}\n|  }}\n|\n|  }}\n|\n|\n|\n|\n| or the Municipal Reform Act 1835or the Municipal Corporations (England) Act 1835|public|76|09-09-1835|repealed=y|archived=n|An Act to provide for the Regulation of Municipal Corporations in England and Wales.|note4= }}\n|\n|  for amending the Representation of the People in Scotland; and to diminish the  there. }}\n|  }}\n|  }}\n|  }}\n|  }}\n|  }}\n|\n}}\nLocal acts\n}}\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|\n|  }}\n|  }}\n|\n|  to change the Name of the Harbour to that of Burry Port, and to enable the Burry Port Company to raise a further Sum of Money.|note4= }}\n|\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|  for improving the Navigation of the River Cart, and for deepening and extending the Harbour of Paisley, in the County of Renfrew.}}\n|  }}\n| or the Birmingham Canal Navigations Consolidation Act 1835|local|34|17-06-1835|archived=n|An Act to consolidate and extend the Powers and Provisions of the several Acts relating to the Birmingham Canal Navigations.}}\n|\n|  }}\n|\n|\n|\n|  }}\n|\n|  relating to the said Company.|note4= }}\n|  }}\n|  to consolidate and amend several Acts for the further Improvement of the Port of London, by making Docks and other Works at Blackwall for the Accommodation of East India Shipping.|note4= }}\n|\n|  }}\n|  for paving, cleansing, and improving the Town of ; and for making further Improvements in the said Town.}}\n|\n|\n|\n|\n|\n|  }}\n|  for the Regulation of Buildings in the Town of Liverpool, and for the other Purposes therein mentioned; and for granting further and additional Powers for the Improvement and Regulation of the said Town, and the Preservation of Property therein from Fires, and otherwise.|note4= }}\n|\n|  }}\n|  relating to such Railway.}}\n|\n|  of the Company of Proprietors of the said Canal.}}\n|  }}\n|\n|\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|  of His Majesty King George the Third, for amending certain Mileways leading to Oxford, and making Improvements in the University and City of Oxford, the Suburbs thereof, and adjoining Parish of Saint Clement; and for other Purposes in the said Acts mentioned.|note4= }}\n|  }}\n|  for establishing a Floating Bridge over the River Itchen near the Town of Southampton, with proper Approaches thereto, and making Roads to communicate therewith.|note4= }}\n|  }}\n|  }}\n|  }}\n|\n|\n|  in the County of Glamorgan. }}\n|\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|  }}\n|\n|\n|\n|  for making a Pier at Southend in the County of Essex.|note4= }}\n|  }}\n| , in the County of Forfar.}}\n|  relating to the Bodmin and Wadebridge Railway.}}\n| or the City of London (Small Debts) Act 1835'''|local|94|21-08-1835|maintained=y|repealed=y|archived=n|An Act for amending and consolidating the Acts of Parliament for the Recovery of Small Debts in the City of London and the Liberties thereof, and for enabling the Goods of the Debtors to be taken in Execution.|note4= }}\n|\n|\n|  for making the said Railway.}}\n|  for more effectually supplying with Water the City and County of the City of Exeter and Places adjacent thereto.}}\n|  relating to such Company.|note4= }}\n|\n|  and Sixth Years of the Reign of His late Majesty King George the Fourth, relating to the said Town.}}\n|\n|\n|  for more effectually repairing the Road from the Exeter Turnpike Road to Biddaford, and certain Roads leading from Bridgetown Pomeroy and Totnes, and other Roads communicating therewith, and for repairing Totnes Bridge, and erecting Bridges over the Stover Canal, the Rivers Teign and Lemon, and the Mill Leat, all in the County of Devon.}}\n|  }}\n|  }}\n|\n|  for lighting, watching, and improving the Parish of Tormoham, in the County of Devon.}}\n|\n|\n|  }}\n|  for making and maintaining a Railway from the Cave Hill to the Harbour of Belfast in the County of Antrim.}}\n}}\nPrivate acts\n|\n|\n| )}} towards Payment of certain Sums laid out by General Duncan Campbell of Lochnell in the Improvement of the said entailed Estate.}}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  of the said Earl.}}\n|\n|\n|\n|\n|\n|\n| |private|28|13-04-1835|repealed=n|archived=n|An Act for naturalizing Salis Schwabe.}}\n| |private|29|12-06-1835|repealed=n|archived=n|An Act to dissolve the Marriage of Charles Conyers junior, Esquire, with Margaret Conyers his now Wife, and to enable him to marry again; and for other Purposes therein mentioned.}}\n| |private|30|12-06-1835|repealed=n|archived=n|An Act for naturalizing Christian Allhusen.}}\n| |private|31|12-06-1835|repealed=n|archived=n|An Act for naturalizing John Cortazzi.}}\n| |private|32|12-06-1835|repealed=n|archived=n|An Act for naturalizing Paul Ferdinand Willert.}}\n| |private|33|12-06-1835|repealed=n|archived=n|An Act for naturalizing Louis Magnus.}}\n| |private|34|12-06-1835|repealed=n|archived=n|An Act for naturalizing Frederic Louis Miéville.}}\n| |private|35|12-06-1835|repealed=n|archived=n|An Act for naturalizing Mendel Albrecht.}}\n| |private|36|12-06-1835|repealed=n|archived=n|An Act for naturalizing David Meyer Loewe.}}\n| |private|37|03-07-1835|repealed=n|archived=n|An Act to dissolve the Marriage of Major Hassell Richard Moor with Ann his now Wife, and to enable him to marry again; and for other Purposes therein mentioned.}}\n| |private|38|03-07-1835|repealed=n|archived=n|An Act to dissolve the Marriage of the Reverend William Thomas Blenkinsop, a Chaplain in the Service of the East India Company on their Madras Establishment, with Clara Jane his now Wife, and to enable him to marry again; and for other Purposes therein mentioned.}}\n| |private|39|03-07-1835|repealed=n|archived=n|An Act for naturalizing John Queriol Murat.}}\n| |private|40|03-07-1835|repealed=n|archived=n|An Act for naturalizing Ludwig Steinthal.}}\n| |private|41|03-07-1835|repealed=n|archived=n|An Act for naturalizing Emanuel Hallé.}}\n| |private|42|03-07-1835|repealed=n|archived=n|An Act for naturalizing Caspar Peter Elias Baron de Arabet,}}\n| |private|43|03-07-1835|repealed=n|archived=n|An Act for naturalizing Jacques Louis Augusts Joseph Des Champs de la Tour, commonly called Auguste Des Champs de la Tour, and his infant Son.}}\n| |private|44|21-07-1835|repealed=n|archived=n|An Act for naturalizing Agnes Hemilian de Tressan.}}\n| |private|45|30-07-1835|repealed=n|archived=n|An Act to dissolve the Marriage of William Charles Lambert Esquire with Georgiana Charlotte his now Wife, and to enable him to marry again; and for other Purposes therein mentioned.}}\n| |private|46|30-07-1835|repealed=n|archived=n|An Act for naturalizing Henry Christopher Bergman.}}\n| |private|47|21-08-1835|repealed=n|archived=n|An Act for naturalizing John Frederick Zoller.}}\n| |private|48|25-08-1835|repealed=n|archived=n|An Act to dissolve the Marriage of Charles Malpas Esquire with Isabella Bowness his now Wife, and to enable him to marry again; and for other Purposes therein mentioned.}}\n}}\nSources\n*\n*\n*\n*\n*\n*  |pages=277–281 |via=Google Books}}\nSee also\n* List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}