{
  "content": [
    {
      "type": "text",
      "text": "# List of vice presidents of the Maldives\n\n, the incumbent vice president of the Maldives since 2023.]]\nThe vice president of the Maldives is the second highest official in the executive branch of the government of the Maldives, after the president, and is first in the presidential line of succession. The office of the vice president has been pivotal in maintaining governmental continuity, stepping in during the president's absence or incapacity. As outlined in Article 112 of the Constitution of the Maldives, the vice president is tasked with supporting the president in carrying out their duties and responsibilities. If the office of president becomes vacant due to death, resignation, or removal from office, the vice president will succeed to the presidency.\nIn accordance with Article 107(b) of the Constitution, if the vice president assumes the presidency due to a vacancy, this will only count as a full presidential term if there are at least two years remaining in the original term. If the president is temporarily unable to perform the duties of office, he must inform the Speaker of the People's Majlis in writing and transfer responsibilities to the vice president. The president can resume office after informing the Speaker in writing. If the president cannot provide this notification due to incapacity, the vice president, with the approval of a cabinet majority, will take over the responsibilities. The vice president will assume the duties until the president is able to return and inform the Speaker in writing.\nFollowing the establishment of the first republic, Ibrahim Muhammad Didi was appointed vice president through the 1952 referendum. However, the republic did not last long when the regime of Mohamed Amin Didi was overthrown by the people of Malé. Following the overthrow of the presidency of Amin, vice president Ibrahim Muhammad Didi succeeded to the presidency as acting president. After 6 months, the republic was abolished and restored to a monarchy. As stated in the Article 45 of the second republic's 1968 Constitution, the president had the authority to appoint multiple vice presidents. President Ibrahim Nasir appointed five vice presidents; Abdul Sattar Moosa Didi, Ahmed Hilmy Didi, Ibrahim Shihab, Ali Maniku and Hassan Zareer. However, when Nasir resigned and left the Maldives in 1978, none of them were in the post, all of them had been given other positions. In the 2008 presidential election, held under the 2008 constitution, the Maldives elected its first democratically and directly elected president and vice president, with Mohamed Waheed Hassan assuming the role of vice president. On 7 February 2012, following the resignation of president Mohamed Nasheed, vice president Waheed assumed office of president, and appointed Mohamed Waheed Deen as his vice president.\nIn 2015, Mohamed Jameel Ahmed, then Vice President of the Maldives, was impeached following a no-confidence motion submitted by the ruling party. The motion accused him of incompetence, dereliction of duty, links with the opposition, failure to defend the government, and excessive expenditure from the state budget. As a result, Ahmed Adeeb was appointed as Vice President in accordance with the constitution. However, Adeeb was also removed from office by a no-confidence vote from the People's Majlis, which alleged his involvement in a plot to assassinate President Abdulla Yameen in order to assume the presidency. Abdulla Jihad was then appointed as Vice President and served until the end of Yameen's presidential term. Faisal Naseem, serving under President Ibrahim Mohamed Solih from 2018 to 2023, became the only Vice President to complete a full term and holds the record as the longest-serving Vice President.\nThe incumbent vice president is Hussain Mohamed Latheef, who assumed office on 17 November 2023.\nVice Presidents\n{| class=\"sortable wikitable\" style=text-align:center;\n|+ List of vice presidents of the Maldives\n! scope=col rowspan=2 |\n! scope=col rowspan=2  class=unsortable | Portrait\n! scope=col rowspan=2 | Name\n! scope=colgroup colspan=2 rowspan=2 | Party\n! scope=colgroup colspan=2 | Term of office\n! scope=col rowspan=2 class=unsortable | President\n! scope=col rowspan=2 class=unsortable |\n|-\n! scope=col class=unsortable | Took office\n! scope=col class=unsortable | Left office\n|-\n! scope=row | 1\n|\n|\n| style=\"background:\" |\n| RMP\n| 1 January 1953\n| 21 August 1953\n| Mohamed Amin Didi\n|\n|-\n! scope=row | 2\n|\n|\n| style=\"background:\" |\n| IND\n| 10 March 1975\n| 5 January 1977\n| rowspan=\"5\" |Ibrahim Nasir\n|\n|-\n! scope=row | 3\n|\n|\n| style=\"background:\" |\n| IND\n| 27 March 1975\n| 6 January 1977\n| rowspan=\"3\" |\n|-\n! scope=row | 4\n|\n|\n| style=\"background:\" |\n| IND\n| 12 March 1975\n| 6 January 1977\n|-\n! scope=row | 5\n|\n|\n| style=\"background:\" |\n| IND\n| 16 July 1975\n| 14 January 1977\n|-\n! scope=row | 6\n|\n|\n| style=\"background:\" |\n| IND\n| 7 June 1976\n| 6 January 1977\n|\n|-\n! scope=row | 7\n|\n|  1953)}}\n| style=\"background:\" |\n| GIP\n| 11 November 2008\n| 7 February 2012}}\n| Mohamed Nasheed\n|\n|-\n! scope=row | 8\n|\n|  1947)}}\n| style=\"background:\" |\n| IND\n| 25 April 2012\n| 10 November 2013\n| Mohamed Waheed Hassan\n|\n|-\n! scope=row | 9\n|\n|  1969)}}\n| style=\"background:\" |\n| PPM\n| 17 November 2013\n| 21 July 2015\n| rowspan=\"3\" |Abdulla Yameen\n|\n|-\n! scope=row | 10\n|\n|  1982)}}\n| style=\"background:\" |\n| PPM\n| 22 July 2015\n| 5 November 2015}}\n|\n|-\n! scope=row | 11\n|\n|  1964)}}\n| style=\"background:\" |\n| PPM\n| 22 June 2016\n| 17 November 2018\n|\n|-\n! scope=row | 12\n|\n|  1973)}}\n| style=\"background:\" |\n| JP\n| 17 November 2018\n| 17 November 2023\n| Ibrahim Mohamed Solih\n|\n|-\n! scope=row | 13\n|\n|  1982)}}\n| style=\"background:\" |\n| PNC\n| 17 November 2023\n| Incumbent\n| Mohamed Muizzu\n|\n|}\nSee also\n* History of the Maldives\n* Politics of the Maldives\n* List of Maldivian monarchs\n* President of the Maldives\n** List of presidents of the Maldives\n* Vice President of the Maldives\nNotes\nReferences\nExternal links\n*"
    }
  ]
}