{
  "content": [
    {
      "type": "text",
      "text": "# List of acts of the Parliament of the United Kingdom from 1875\n\nThis is a complete list of acts of the Parliament of the United Kingdom for the year 1875.\nNote that the first parliament of the United Kingdom was held in 1801; parliaments between 1707 and 1800 were either parliaments of Great Britain or of Ireland).  For acts passed up until 1707, see the list of acts of the Parliament of England and the list of acts of the Parliament of Scotland.  For acts passed from 1707 to 1800, see the list of acts of the Parliament of Great Britain.  See also the list of acts of the Parliament of Ireland.\nFor acts of the devolved parliaments and assemblies in the United Kingdom, see the list of acts of the Scottish Parliament, the list of acts of the Northern Ireland Assembly, and the list of acts and measures of Senedd Cymru; see also the list of acts of the Parliament of Northern Ireland.\nThe number shown after each act's title is its chapter number. Acts passed before 1963 are cited using this number, preceded by the year(s) of the reign during which the relevant parliamentary session was held; thus the Union with Ireland Act 1800 is cited as \"39 & 40 Geo. 3 c. 67\", meaning the 67th act passed during the session that started in the 39th year of the reign of George III and which finished in the 40th year of that reign.  Note that the modern convention is to use Arabic numerals in citations (thus \"41 Geo. 3\" rather than \"41 Geo. III\"). Acts of the last session of the Parliament of Great Britain and the first session of the Parliament of the United Kingdom are both cited as \"41 Geo. 3\".\nSome of these acts have a short title. Some of these acts have never had a short title.  Some of these acts have a short title given to them by later acts, such as by the Short Titles Act 1896.\n38 & 39 Vict.\nThe second session of the 21st Parliament of the United Kingdom, which met from 5 February 1875 until 13 August 1875.\nPublic general acts\nor the Consolidated Fund Act 1875|public|1|19-03-1875|repealed=y|archived=n|An Act to apply the sum of eight hundred and two thousand six hundred and sixty-one pounds eight shillings and eleven pence out of the Consolidated Fund to the service of the years ending the thirty-first day of March one thousand eight hundred and seventy-four and one thousand eight hundred and seventy-five.|note4= }}\n| or the Consolidated Fund Act 1875|public|2|19-03-1875|repealed=y|archived=n|An Act to apply the sum of seven million pounds out of the Consolidated Fund to the service of the year ending the thirty-first day of March one thousand eight hundred and seventy-six.|note4= }}\n|\n|  so far as relates to the Superannuation Allowances to be granted to Civil Servants who have served in unhealthy Climates.}}\n|\n|  }}\n|  }}\n| or the Royal Marines on Shore Act 1875|public|8|22-04-1875|repealed=y|archived=n|An Act for the Regulation of Her Majesty's Royal Marine Forces while on shore.|note4= }}\n|  and make other provision in lieu thereof.}}\n| or the Consolidated Fund Act 1875|public|10|13-05-1875|repealed=y|archived=n|An Act to apply the sum of Fifteen millions out of the Consolidated Fund to the service of the year ending the thirty-first day of March one thousand eight hundred and seventy-six.|note4= }}\n|\n|\n|  and to amend the same.}}\n|  }}\n|  }}\n|  }}\n|\n|  }}\n| or the Bishops Resignation (1869) Perpetuation Act 1875|public|19|14-06-1875|repealed=y|archived=n|An Act for making perpetual the Bishops Resignation Act, 1869.|note4= }}\n|\n|  }}\n|  }}\n|\n|  }}\n|\n|\n|  }}\n|\n|  }}\n| |note4= }}\n|  and Section Four of the Railway Companies (Scotland) Act, 1867.|note4= }}\n|  }}\n|\n|  }}\n|\n| or the Cross Act|public|36|29-06-1875|repealed=y|archived=n|An Act for facilitating the Improvement of the Dwellings of the Working Classes in Large Towns.|note4= }}\n|  }}\n|  }}\n|  with respect to the annual Returns from Mines.}}\n|  }}\n|\n|\n|  }}\n| |note4= }}\n|\n|  }}\n|\n|\n| or the Artizans and Labourers Dwellings Improvement (Scotland) Act 1875|public|49|02-08-1875|archived=n|An Act for facilitating the Improvement of the Dwellings of the Working Classes in large Towns in Scotland.}}\n|  }}\n| |note4= }}\n|\n|  }}\n|\n|\n| or the County Surveyors (Superannuation) Ireland Act 1875|public|56|11-08-1875|archived=n|An Act to enable Grand Juries in Ireland to grant Superannuation Allowances to County Surveyors in certain cases.}}\n| or the Pharmacy (Ireland) Act 1875|public|57|11-08-1875|archived=n|An Act to institute a Pharmaceutical Society, and to regulate the Qualifications of Pharmaceutical Chemists and of Chemists and Druggists, in Ireland.}}\n|\n|  and to make provision for keeping safely Parochial Records in Ireland.}}\n|  }}\n|  }}\n|\n|\n|  and to make other provision in lieu thereof.|note4= }}\n|\n|\n|\n|\n|  }}\n|\n|  relating to the Ecclesiastical Commissioners for England.}}\n|  }}\n| or the East India Home Government (Appointments) Act 1875|public|73|11-08-1875|repealed=y|archived=n|An Act to amend the law relating to the appointment of certain persons who entered the employment of the Home Government of India before the thirty-first day of December one thousand eight hundred and seventy-four.|note4= }}\n|  and other Sanitary Acts, in respect of Loans for Sanitary Purposes.}}\n|  }}\n|\n| |note4= }}\n|  }}\n|\n|  and for further amending the law concerning the remission of penalties.}}\n|\n|\n|\n|  }}\n|\n|  }}\n| or 'Lord Cairns' Act|public|87|13-08-1875|archived=n|An Act to simplify Titles and facilitate the Transfer of Land in England.}}\n|\n|\n|\n|  }}\n|\n|  }}\n|  }}\n|  intituled \"An Act to amend the Sanitary Act, 1866, so far as relates to the City of Dublin.\" }}\n|\n}}\nLocal acts\nrelating to Lay Improvement, situated in the parishes of Westbury-on-Severn, Churcham, and Minsterworth, in the county of Gloucester.|note4= }}\n|\n|  and for making further provision respecting the maintenance and use of the Market; and for other purposes.}}\n|\n|\n|  for discontinuing the admission of new contributors to the fund; for transferring the fund and its liabilities; and for other purposes/|note4= }}\n|  to enable the School Boards for Caister, Norfolk, and Rochford, Essex, to put in force \"The Lands Clauses Consolidation Act, 1845,\" and the Acts amending the same.|po1=Caister Order 1875|Provisional Order for putting in force the Lands Clauses Consolidation Act, 1845.\n|po2=Rochford Order 1875|Provisional Order for putting in force the Lands Clauses Consolidation Act, 1845.}}\n|  to enable the School Board for Brighton to put in force \"The Lands Clauses Consolidation Act, 1845,\" and the Acts amending the same.|po1=Brighton Order 1875|}}\n|  relating to the parish of Beith in the county of Ayr.|po1=Beith Order 1875|}}\n|\n|  relating to Bournemouth, Carnlough, Clacton-on-Sea, Folkestone, Hythe (Southampton), and Withernsea.|po1=Bournemouth Promenade Pier Order 1875|\n|po2=Carnlough Harbour Order 1875|\n|po3=Clacton-on-Sea Pier Order 1875|\n|po4=Folkestone Promenade Pier Order 1875|\n|po5=Folkestone Order 1875|\n|po6=Hythe Pier Order 1875|\n|po7=Withernsea Pier Order 1875|}}\n|  relating to the Barony of Fraserburgh in the county of Aberdeen.|po1=Fraserburgh Order 1875|}}\n|\n|\n|  }}\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|  }}\n|  }}\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n| or the Military Manoeuvres Act 1875'''|local|34|14-06-1875|maintained=y|archived=n|An Act for making provision for facilitating the Manœuvres of Troops to be assembled during the present Summer.}}\n|\n|  }}\n|\n|\n|\n|  to empower the Local Board to raise further Money; and for other purposes.}}\n|\n|\n|\n|\n|  and for other purposes.}}\n|  }}\n|\n|  }}\n|  }}\n|\n|\n|  as was not abandoned by \"The Birmingham and Lichfield Junction Railway Act, 1874;\" and for other purposes.|note4= }}\n|  }}\n|  }}\n|\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|  }}\n|\n|  }}\n|\n|  }}\n|  relating to Markets and Fairs; and for other purposes.|note4= }}\n|\n|\n|  relating to the Parish of Cambuslang, in the county of Lanark.|po1=Cambuslang Order 1875|}}\n|  relating to Minor Canonries, so as to authorise certain arrangements with reference to the Minor Canonries in the Cathedral Church of Saint Paul in London.}}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n| |note4= }}\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|  and for other purposes.}}\n|\n|  relating to Carlingford Lough.|po1=Harbour of Carlingford Lough Improvement Order 1875|}}\n|  relating to Brixham, Carrickfergus, Macduff, and Rosehearty.|po1=Brixham Harbour Order 1875|\n|po2=Carrickfergus Harbour Order 1875|\n|po3=Macduff Harbour Order 1875|\n|po4=Rosehearty Harbour Order 1875|}}\n|\n|  and the Acts amending the same.|po1=Stoneyford River Drainage Order 1875|}}\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|  in regard to the lines of Tramways on North Bridge and North Bridge Street, Edinburgh.|note4= }}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|  }}\n|\n|\n|\n|  and 1873. }}\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|  relating to the Bristol and Eastern District Tramways and the Manchester Corporation Tramways.|po1=Bristol and Eastern District Tramways Order 1875|\n|po2=Manchester Corporation Tramways Order 1875|}}\n|  with reference to the city of Oxford, the Parish of Stoke-upon-Trent, and the Parishes of Sutton Saint Michael and Sutton Saint Nicholas in the county of Hereford.|note4=|po1=Oxford Order 1875|\n|po2=Stoke-upon-Trent Order 1875|\n|po3=Sutton (Herefordshire) Order 1875|}}\n|  relating to Blackburn Gas, Brighton and Hove Gas, Littlehampton Gas, North Bierley Gas, Weymouth Gas, Wolverhampton Gas, Bognor Water, Newington Water, Newport (Isle of Wight) Water, and Bridgend (Glamorganshire) Gas and Water.|po1=Blackburn Gas Order 1875|\n|po2=Brighton and Hove Gas Order 1875|\n|po3=Littlehampton Gas Order 1875|\n|po4=North Bierley Gas Order 1875|\n|po5=Weymouth Consumers Gas Order 1875|\n|po6=Wolverhampton Gas Order 1875|\n|po7=Bognor Water Order 1875|\n|po8=Newington Water Order 1875|\n|po9=Newport (Isle of Wight) Water Order 1875|\n|po10=Bridgend (Glamorgan) Gas and Water Order 1875|}}\n|  relating to the Taw and Torridge Salmon Fishery District.|po1=Taw and Torridge Salmon Fishery District Order 1875|}}\n|  relating to the Burgh of Paisley, in the County of Renfrew.|po1=Paisley Burgh Slaughterhouse Order 1875|}}\n|\n|  to enable the School Board for London to put in force \"The Lands Clauses Consolidation Act, 1845,\" and the Acts amending the same.|po1=London Order 1875|}}\n|  to enable the School Board for London to put in force \"The Lands Clauses Consolidation Act, 1845,\" and the Acts amending the same.|po1=London Order 1875|}}\n|\n|\n|\n|  }}\n|\n|  and to make and maintain other Waterworks; and for other purposes.}}\n|\n|\n|\n|\n|\n|\n|\n|  }}\n|  for authorising the construction of additional Railways in Lancashire; and for other purposes.}}\n|  }}\n|\n|\n|\n|  }}\n|\n|  }}\n|\n|\n|  }}\n|\n|\n|  for the purchase of Lands.}}\n|\n|\n|\n|  }}\n|\n|\n|\n|\n|\n|\n|\n|\n|  }}\n}}\nPrivate acts\n)}} }}\n|\n|\n|  by virtue of \"The Paddington Estate Act, 1871,\")}} and the therein recited Acts by the Lessees of the Estate, with the consent of the Ecclesiastical Commissioners for England, of granting Building or Repairing Leases, and of accepting surrenders of existing Leases of four hundred acres, part of the Estate (and of granting new Leases in lieu of the surrendered Leases), by enabling Agreements to be made with the Commissioners for leasing or otherwise dealing with the excess of acreage over the four hundred acres.}}\n|  and the application of the Money for the Improvement of parts of the Estates, in order to render them available as Building Lands, and for extending the power of granting Mineral Leases conferred by the said Will; and for other purposes.}}\n|\n| )}} and \"Charles Sheils' Almshouses Charity Act, 1866.\")}} }}\n}}\nSources\n*\n*  |title=The Public General Statutes Passed in the Thirty-Eighth and Thirty-Ninth Years of the Reign of Her Majesty Queen Victoria; 1875 |date=1875 |location=London |publisher=Eyre and Spottiswoode |via=Google Books}}\n*  |via=Google Books}}\nSee also\n* List of acts of the Parliament of the United Kingdom\nReferences"
    }
  ]
}