{
  "content": [
    {
      "type": "text",
      "text": "# List of judgments of the Supreme Court of the United Kingdom delivered in 2020\n\nThis is a list of the judgments given by the Supreme Court of the United Kingdom in the year 2020.\nIn 2020, Lord Reed of Allermuir was the President of the Supreme Court; Lord Hodge was the Deputy President.\nThe table lists judgments made by the court and the opinions of the judges in each case. Judges are treated as having concurred in another's judgment when they either formally attach themselves to the judgment of another or speak only to acknowledge their concurrence with one or more judges. Any judgment which reaches a conclusion which differs from the majority on one or more major points of the appeal has been treated as dissent.\nAll dates are for 2020 unless expressly stated otherwise.\n2020 case summaries\nUnless otherwise noted, cases were heard by a panel of 5 judges.\nCases involving Scots law are highlighted in orange. Cases involving Northern Irish law are highlighted in green.\n{| class=\"wikitable sortable\" style=\"margin: 1em auto 1em auto;\"\n|-\n! style=\"width:1200px\"| Case name\n! style=\"width:420px\"| Citation\n! style=\"width:200px\"| Date\n! style=\"width:250px\"| Legal subject\n! style=\"width:1200px\"| Summary of decision\n|-\n|''FMX Foods Merchants Import Export Co Ltd v Commissioners for Her Majesty's Revenue & Customs\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0218-judgment.pdf UKSC 1]\n|29 January\n|Tax law, European Union Customs Code\n|HMRC could issue a post-clearance demand (in respect of customs duty) after the expiry of the normal three year time limit where criminal proceedings were relevant. However, HMRC could not issue demands unitarily without any time limit as this would be in breach of the fundamental principle of legal certainty under EU law.\n|-\n|bgcolor=#CEF2DA|A Reference by the Attorney General for Northern Ireland of devolution issues to the Supreme Court pursuant to Paragraph 34 of Schedule 10 to the Northern Ireland Act 1998\n|bgcolor=#CEF2DA|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0030-judgment.pdf UKSC 2]\n|bgcolor=#CEF2DA|5 February\n|bgcolor=#CEF2DA|Human rights, devolution\n|bgcolor=#CEF2DA|Providing postcode lists to the Secretary of State for Work and Pensions was not a \"devolution issue\" or capable of being incompatible with the European Convention on Human Rights. Therefore, the Supreme Court refused to accept the application by the Attorney General for Northern Ireland.\n|-\n|R (on the application of Samuel Smith Old Brewery (Tadcaster)) v North Yorkshire County Council\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0077-judgment.pdf UKSC 3]\n|5 February\n|Land law, planning law, Town and Country Planning Act 1990\n|Planning permission granted by North Yorkshire County Council for the expansion of a quarry did not breach the National Planning Policy Framework in respect of mineral extraction in the green belt as the \"openness\" of the green belt would be preserved.\n|-\n|R (on the application of Jalloh (Liberia)) v Secretary of State for the Home Department\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0137-judgment.pdf UKSC 4]\n|12 February\n|Immigration law, false imprisonment\n|Conditions of bail under the provisions of the Immigration Act 1971 which required an individual who lacked immigration status to stay at home for eight hours a day constituted false imprisonment.\n|-\n|Micula v Romania''\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0177-judgment.pdf UKSC 5]\n|19 February\n|International law, arbitration\n|The courts of England and Wales have the power to stay execution of an award by the International Centre for Settlement of Investment Disputes (ICSID) and the UK's enforforcement of obligations under and the ICSID Convention are unaffected by the EU Treaties.\n|-\n|bgcolor=#CEF2DA|In the matter of an application by Deborah McGuinness for Judicial Review (Northern Ireland)\n|bgcolor=#CEF2DA|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2019-0032-judgment.pdf UKSC 6]\n|bgcolor=#CEF2DA|19 February\n|bgcolor=#CEF2DA|Administrative law, jurisdiction\n|bgcolor=#CEF2DA|The Supreme Court did not have jurisdiction to hear appeals in respect of when Ulster loyalist Michael Stone could be released from prison.\n|-\n|R (on the application of DN (Rwanda)) v Secretary of State for the Home Department\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0140-judgment.pdf UKSC 7]\n|26 February\n|Immigration law, false imprisonment\n|An order to detain an individual prior to deportation under the Nationality, Immigration and Asylum Act 2002 was unlawful and the individual could sue for damages for false imprisonment.\n|-\n|R v Copeland\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2019-0089-judgment.pdf UKSC 8]\n|11 March\n|Explosive Substances Act 1883\n|A person was not guilty under section 4(1) of the Explosive Substances Act 1883 where the explosives were being used for experimentation and self-education and did not have an ulterior unlawful purpose.\n|-\n|MS (Pakistan) v Secretary of State for the Home Department\n|[2019] [https://www.supremecourt.uk/cases/docs/uksc-2018-0159-judgment.pdf UKSC 9]\n|18 March\n|Human rights, human trafficking, modern slavery\n|Immigration tribunals can make findings of fact and are not bound by a Home Office decision in determining whether Article 4 of the European Convention on Human Rights would be breached. The requirements of the Council of Europe Convention on Action against Trafficking in Human Beings can form part of the positive obligations owed by the State under Article 4 of the European Convention.\n|-\n|Elgizouli v Secretary of State for the Home Department\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2019-0057-judgment.pdf UKSC 10]\n|25 March\n|Human rights, capital punishment, Data Protection Act 2018\n|A decision by the government to share information with the United States Department of Justice for the prosecution of two alleged Islamic State members was unlawful without assurance from the US that the individuals would not face the death penalty.\n|-\n|Aspen Underwriting Ltd v Credit Europe Bank NV\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0229-judgment.pdf UKSC 11]\n|1 April\n|Conflict of laws, insurance law, Brussels Regime\n|The High Court of England and Wales did not have jurisdiction to hear claims relating to fraudulent misrepresentation following the loss of an insured vessel. Since Credit Europe Bank was domiciled in the Netherlands, under the Brussels Regime insurance claims involving the bank should be heard in the courts of the Netherlands. The term of the insurance contract, to which the bank was not a party, stipulating England and Wales as the exclusive venue was to that extent void. The bank was not required to prove that it was the economically weaker party to be entitled to be sued in its jurisdiction of domicile.\n|-\n|WM Morrisons Supermarkets plc v Various Claimants\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0213-judgment.pdf UKSC 12]\n|1 April\n|Tort, vicarious liability, data protection\n|Morrisons were not vicariously liable in respect of actions taken by a vengeful employee who posted the personal data of 100,000 employees online, an action which was in breach of duties imposed the by Data Protection Act 1998.\n|-\n|Barclays Bank plc v Various Claimants\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0164-judgment.pdf UKSC 13]\n|1 April\n|Tort, vicarious liability\n|Barclays Bank was not vicariously liable for the acts of a self-employed doctor who was engaged to carry out medical examinations of its staff and was accused of sexual assault.\n|-\n|Whittington Hospital NHS Trust v XX\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2019-0013-judgment.pdf UKSC 14]\n|1 April\n|Tort, medical negligence\n|Damages payable by Whittington Hospital NHS Trust to a woman who could not bear children following earlier medical negligence could include the costs of surrogacy through commercial agreements abroad.\n|-\n|''Zipvit Ltd v Commissioners for Her Majesty's Revenue and Customs\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0152-judgment.pdf UKSC 15]\n|1 April\n|Value Added Tax\n|The court referred a case relating to whether a trader can deduct input VAT in the absence of a VAT invoice and whether a trader has an entitlement to deduct VAT on supplies which are carried out by another entity to the Court of Justice of the European Union.\n|-\n|R (Palestine Solidarity Campaign Ltd) v Secretary of State for Communities and Local Government\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0133-judgment.pdf UKSC 16]\n|29 April\n|Labour law, pensions, Public Service Pensions Act 2013\n|Ministerial guidance to administering authorities of Local Government Pension Scheme funds on how to discharge their investment powers was unlawful as the Public Service Pensions Act 2013 did not allow central government to impose policy on administering authorities.\n|-\n|AM (Zimbabwe) v Secretary of State for the Home Department\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0048-judgment.pdf UKSC 17]\n|29 April\n|Human rights, criminal deportation, Article 3 of the European Convention on Human Rights\n|The deportation of an individual who had come to the UK as a teenager from Zimbabwe and was subsequently convicted of a number of serious offences was blocked amid concerns his life would be shortened by HIV and suitable medical care was not available in Zimbabwe. This upheld the position established in Paposhvili v Belgium.\n|-\n|Duval v 11–13 Randolph Crescent Ltd\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0211-judgment.pdf UKSC 18]\n|6 May\n|Land law\n|A landlord was in breach of its obligations to enforce tenant covenants where the landlord had granted a licence to a tenant to undertake structural works as the granting of such a licence had put the landlord out of its power to enforce an absolute covenant preventing structural works.\n|-\n|bgcolor=#CEF2DA|R v Adams (Northern Ireland)\n|bgcolor=#CEF2DA|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0104-judgment.pdf UKSC 19]\n|bgcolor=#CEF2DA|13 May\n|bgcolor=#CEF2DA|False imprisonment, The Troubles, Detention of Terrorists (Northern Ireland) Order 1972\n|bgcolor=#CEF2DA|The detention of Gerry Adams for his attempts to escape from the Maze Prison in the 1970s was unlawful as the custody order had not been authorised personally by the Secretary of State for Northern Ireland and therefore did not meet the requirements of the Detention of Terrorists (Northern Ireland) Order 1972.\n|-\n|Dill v Secretary of State for Housing, Communities and Local Government and another''\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2019-0001-judgment.pdf UKSC 20]\n|20 May\n|Planning (Listed Buildings and Conservation Areas) Act 1990\n|The status of two lead urns placed on limestone plinths which had been classified as listed buildings were able to be revisited by a planning inspector in considering whether or not they were in fact 'buildings'.\n|-\n|Cardtronics UK Ltd v Sykes (Valuation Officers)\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0225-judgment.pdf UKSC 21]\n|20 May\n|Business rates\n|Cash machines located inside and outside of retail stores were not separate hereditaments from the stores or shops and as such should not have been subject to separate business rates on top of normal store rates.\n|-\n|''Fowler v Commissioners for Her Majesty's Revenue and Customs\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0226-judgment.pdf UKSC 22]\n|20 May\n|Income tax, labour law\n|Despite the presence of a deeming provision in the Income Tax (Trading and Other Income) Act 2005 which treated a deep-sea diver as being self-employed for UK tax purposes, the actual relationship was that of employment and the diver should be considered to receive the income in respect of an employment when applying the tax treaty between the UK and South Africa.\n|-\n|Serafin v Malkiewicz\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2019-0156-judgment.pdf UKSC 23]\n|3 June\n|Defamation, right to a fair trial\n|A libel case was overturned after the court found that Justice Robert Jay had not allowed a claim to be properly presented. Further, he had harassed and intimidated the claimant, therefore the original trial was unfair. A retrial was ordered.\n|-\n|Sainsbury's Supermarkets Ltd v Visa Europe Services LLC and Sainsbury's Supermarkets Ltd v MasterCard Incorporated\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0154-judgment.pdf UKSC 24]\n|19 June\n|Competition law, Treaty on the Functioning of the European Union\n|Interchange fees levied by Visa and MasterCard infringed European Union competition law (namely article 101(1) of the Treaty on the Functioning of the European Union).\n|-\n|Bresco Electrical Services Ltd (in liquidation) v Michael J Lonsdale (Electrical) Ltd\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2019-0036-judgment.pdf UKSC 25]\n|17 June\n|Insolvency, adjudication\n|Adjudication on the application of a liquidator of a company is not incompatible with the insolvency process and the existence of the insolvency set-off does not result in a claim ceasing to exist. The fact that an adjudication award cannot be enforced immediately does not mean that the adjudication process is futile.\n|-\n|bgcolor=#faecc8|ABC v Principal Reporter and another and In the matter of XY''\n|bgcolor=#faecc8|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2019-0063-judgment.pdf UKSC 26]\n|bgcolor=#faecc8|18 June\n|bgcolor=#faecc8|Children's Hearings (Scotland) Act 2011, Article 6 (fair trial) and Article 8 (private and family life) of the European Convention on Human Rights\n|bgcolor=#faecc8|It is not a breach of the right to family life for a child's siblings to be denied \"relevant person\" status (being a person who has had significant involvement in the upbringing of the child and is therefore entitled to be notified of and attend any children's hearing.\n|-\n|Regeneron Pharmaceuticals Inc v Kymab Ltd\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0131-judgment.pdf UKSC 27]\n|24 June\n|Patent law, European Patent Convention\n|The claims by Regeneron Pharmaceuticals in respect of patents registered for a new type of genetically modified mouse which included a hybrid version of the gene that produces antibodies was invalid as the patents failed to adhere to the rule of sufficiency (being that documents filed with the patent need to be detailed enough to enable scientifically skilled readers to recreate the invention).\n|-\n|HMRC v K E Entertainments Ltd\n|[2020] [https://www.supremecourt.uk/cases/uksc-2020-0135 UKSC 28]\n|24 June\n|Value-added tax, Value Added Tax Regulations 1995\n|A change in calculating a price apportionment for a bingo promoter between the stake (outside of the scope of VAT) and a participation fee (subject to VAT) did not result in a decrease in the total consideration that enabled the taxpayer to claim a VAT adjustment under the Value Added Tax Regulations 1995.\n|-\n|bgcolor=#CEF2DA|R v Hilton\n|bgcolor=#CEF2DA|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0075-judgment.pdf UKSC 29]\n|bgcolor=#CEF2DA|1 July\n|bgcolor=#CEF2DA|Proceeds of Crime Act 2002\n|bgcolor=#CEF2DA|There is no automatic right for a third party with an interest in property to make representations at the first stage confiscation proceedings in respect of that property under the Proceeds of Crime Act 2002 where such representations could be made later at the enforcement stage.\n|-\n|Villiers v Villiers\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0114-judgment.pdf UKSC 30]\n|1 July\n|Family law, jurisdiction, Matrimonial Causes Act 1973\n|A maintenance claim could be pursued in England, where the claimant was now residing, rather than Scotland, despite the fact that the petition for divorce was filed in Scotland and the couple had lived in Scotland for most of their marriage.\n|-\n|Sevilleja v Marex Financial Ltd\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0178-judgment.pdf UKSC 31]\n|15 July\n|Company law, tort, reflective loss\n|The reflective loss principle should be strictly limited to cases where claims are brought by a shareholder in respect of a loss suffered by in their capacity as a shareholder and should not apply to claims by creditors.\n|-\n|bgcolor=#faecc8|Sutherland v HM Advocate\n|bgcolor=#faecc8|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2020-0022-judgment.pdf UKSC 32]\n|bgcolor=#faecc8|15 July\n|bgcolor=#faecc8|Article 8 of the European Convention on Human Rights\n|bgcolor=#faecc8|A covert investigation by paedophile hunters and the use by authorities of evidence collected from this investigation did not breach an individual's right to a private life under Article 8 of the European Convention on Human Rights.\n|-\n|Lehtimaki and others v Cooper\n|[2020] [http://www.bailii.org/uk/cases/UKSC/2020/33.pdf UKSC 33]\n|29 July\n|Company law, trusts, charity law\n|The courts were able to dictate to the directors of The Children's Investment Fund Foundation, a charitable company, in how to exercise their powers absent a breach of fiduciary duty.\n|-\n|Shagang Shipping Company Ltd v HNA Group Company Ltd\n|[2020] [http://www.bailii.org/uk/cases/UKSC/2020/34.pdf UKSC 34]\n|5 August\n|Administrative law, Civil Evidence Act 1995\n|It would be permissible for a trial judge, in determining whether a bribe had been paid, to have regard to the possibility that a forced confession of bribery had been obtained by way of torture (and would therefore be inadmissible), even if actual torture had not been proved.\n|-\n|HMRC v Parry\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/35.pdf UKSC 35]\n|19 August\n|Inheritance Tax Act 1984\n|A transfer between pensions was not a 'transfer of value' for the purpose of the Inheritance Tax Act 1984 as the motive for the transfer was not to confer a benefit on another. However, the failure by an individual to take up their rights to pension benefits was a 'transfer of value' which would be subject to inheritance tax.\n|-\n|bgcolor=#CEF2DA|Peninsula Securities Ltd v Dunnes Stores (Bangor) Ltd\n|bgcolor=#CEF2DA|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/36.pdf UKSC 36]\n|bgcolor=#CEF2DA|19 August\n|bgcolor=#CEF2DA|Contracts, restraint of trade, property law\n|bgcolor=#CEF2DA|A restriction on a property owner from allowing further retail units from being built in a shopping centre which would be in direct competition with an anchor tenant was a reasonable and proportionate restrictive covenant and therefore was enforceable by the anchor tenant.\n|-\n|Unwired Planet International Ltd and another v Huawei Technologies (UK) Co Ltd and another, Huawei Technologies Co Ltd and another v Conversant Wireless Licensing SARL, ZTE Corporation and another v Conversant Wireless Licensing SARL\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/37.pdf UKSC 37]\n|26 August\n|Patent law, jurisdiction\n|The courts of England and Wales have jurisdiction to settle a global licence on fair, reasonable and non-discriminatory (FRAND) terms in respect of a multinational standard essential patents portfolio. The grant of an injunction against an infringing party that declines a FRAND licence is both appropriate and proportionate.\n|-\n|Enka Insaat Ve Sanayi A.S. v OOO Insurance Company Chubb\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/38.html UKSC 38]\n|9 October\n|Insurance law, arbitration\n|Where an arbitration agreement does not specify a governing law then the law of the underlying main contract will ordinarily govern the arbitration agreement. Where the main contract does not specify a governing law then it is for the courts to determine the law with which the arbitration agreement is most closely connected.\n|-\n|R (on the application of Highbury Poultry Farm Produce Ltd) v Crown Prosecution Service\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/39.html UKSC 39]\n|16 October 2020\n|Animal welfare, Welfare of Animals at the Time of Killing (England) Regulations 2015\n|Offences incurred under the Welfare of Animals at the Time of Killing (England) Regulations 2015 are strict liability offences and as such there was no requirement to prove negligence by the business operating a slaughterhouse where a breach of the regulations had occurred.\n|-\n|R (on the application of Z and another) v Hackney London Borough Council and another\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/40.html UKSC 40]\n|16 October 2020\n|Equality Act 2010\n|The practices of a charity which provided social housing available primarily to the Orthodox Jewish community was proportionate to meet the needs or alleviate the disadvantages suffered by a particular group and therefore constituted permissible direct discrimination under the Equality Act 2010. The exemptions from the Act which allow charities to restrict the provision to benefits \"for the purpose of preventing or compensating for a disadvantage linked to the protected characteristic\" is not subject to a further test for proportionality.\n|-\n|R (on the application of Pathan) v Secretary of State for the Home Department\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/41.html UKSC 41]\n|23 October 2020\n|Immigration law\n|The treatment by the Home Office of an individual who had applied for an extension of his skilled worker visa in good time and which had been refused on the basis that the Secretary of State had revoked the licence of his sponsoring employer without informing the individual was unfair.\n|-\n|Stoffel & Co v Grondona\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/42.html UKSC 42]\n|30 October 2020\n|Illegality, professional negligence\n|Despite the illegality of her actions, a person who had engaged in mortgage fraud was not barred from bringing a claim for professional negligence against her solicitors for negligently failing to register the forms for the transfer of the property.\n|-\n|Ecila Henderson v Dorset Healthcare University NHS Foundation Trust\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/43.html UKSC 43]\n|30 October 2020\n|Mental health law, medical negligence, illegality\n|An NHS Foundation Trust, which had accepted that it had been negligent in respect of the care of a person receiving care for paranoid schizophrenia, was not required to pay compensation to the individual where the individual subsequently incurred a loss as a result of committing a serious criminal act.\n|-\n|Secretary of State for Health v Servier Laboratories Ltd\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/44.html UKSC 44]\n|6 November 2020\n|European Union law,\n|The doctorine of res judicata (preventing a party from re-litigating any claim) did not mean that decision of the General Court of the European Union was binding on domestic proceedings as not all rights of appeal had been exhausted.\n|-\n|''Alexander Devine Children's Cancer Trust v Housing Solutions Ltd''\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/45.html UKSC 45]\n|6 November 2020\n|Law of Property Act 1925\n|A developer who was seeking to develop land in breach of a restrictive covenant which prevented the development of land adjoining a children's cancer hospice could not rely on the covenant being \"contrary to public interest\" where it had already breached the covenant by its own actions.\n|-\n|''R (on the application of Maughan) v Her Majesty's Senior Coroner for Oxfordshire\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/46.html UKSC 46]\n|13 November 2020\n|Standard of proof, Coroners and Justice Act 2009\n|The standard of proof required in order to reach determinations of suicide and unlawful killing at inquests is the civil standard of proof (the balance of probabilities) rather than the criminal standard of proof (beyond reasonable doubt).\n|-\n|Test Claimants in the Franked Investment Income Group Litigation & Others v HMRC\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/47.html UKSC 47]\n|20 November 2020\n|Advance corporation tax, Limitation Act 1980\n|The Limitation Act 1980 applies to claims for restitution of monies paid under a mistake of law. The six-year period allowed under the Limitation Act applies from the date on which the claimant has discovered the mistake (or could have reasonably discovered it) rather than the date on which the loss was made. When relying on another judgement to determine whether a claim is possible, the date on which a claimant could reasonable have discovered a loss may be earlier than the date of that other judgement if, using reasonable diligence, the claimant could have discovered that they had a worthwhile claim.\n|-\n|Halliburton Company v Chubb Bermuda Insurance Ltd''\n|[2020] [https://www.supremecourt.uk/cases/docs/uksc-2018-0100-judgment.pdf UKSC 48]\n|27 November 2020\n|Insurance law, arbitration\n|An arbitrator has a duty to make disclosures of matters that might reasonably be considered to give rise to doubts as to their impartiality in respect of a matter they are seeking to resolve. In the specific circumstances of the case in hand, the court found that there were no justifiable doubts as to the arbitrator's impartiality.\n|-\n|HMRC v London Clubs Management Ltd\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/49.html UKSC 49]\n|27 November 2020\n|Tax law, Finance Act 1997, gaming duty\n|Non-negotiable gaming chips and free bet vouchers issued by a casino as promotional tolls in order to encourage customers to gamble did not have any monetary value and therefore are not required to be taken into account in computing the profits of the casino for the purpose of calculating gaming duty (an excise duty, i.e. consumption tax, imposed on casino games and \"equal chance gaming\" by the Finance Act 1997).\n|-\n|R (on the application of Gourlay) v Parole Board\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/50.html UKSC 50]\n|4 December 2020\n|Parole Board for England and Wales\n|A body which takes a decision in a judicial or quasi-judicial capacity (in this case, the Parole Board), and then declines to defend it when it is challenged in court proceedings, will not ordinarily face an order for costs.\n|-\n|MasterCard Incorporated and others v Walter Hugh Merricks CBE\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/51.html UKSC 51]\n|11 December 2020\n|Competition Law\n|The Competition Appeal Tribunal had erred in law in refusing to make a Collective Proceedings Order in collective proceedings brought by a representative of a group of consumers against companies in the MasterCard group.\n|-\n|R (on the application of Friends of the Earth Ltd and others) v Heathrow Airport Ltd\n|[2020] [https://www.bailii.org/uk/cases/UKSC/2020/52.html UKSC 52]\n|16 December 2020\n|Environmental law, Planning Act 2008\n|The government had taken proper account of the UK's climate change commitments, including the Paris Agreement. Heathrow Airport may apply for planning permission for a third runway.\n|-\n|Robinson (Jamaica) v Secretary of State for the Home Department\n|[2020] [http://www.bailii.org/uk/cases/UKSC/2020/53.html UKSC 53]\n|16 December 2020\n|Immigration law, European Union law\n|The phrase 'exceptional circumstances' does not import an additional hurdle before a Zambrano carer can be deported from the territory of the EU.\n|}\nNotes\nExternal links\n* [https://www.supremecourt.uk/cases?jded=2020-12-31&jdsd=2020-01-01&p=1 Supreme Court decided cases (2020)]"
    }
  ]
}