{
  "content": [
    {
      "type": "text",
      "text": "# List of Rehab People of the Year Award winners\n\nThe Rehab People of the Year Awards was an annual awards ceremony in Ireland organised by the Rehab Group, televised by RTÉ television.\nThe People of the Year Awards were given to people who \"bring joy and light to the lives of others or have supported others in their darkest hours\". The nominees were chosen by members of the public. The winners were then chosen by a panel of adjudicators, composed of leading members of the media, voluntary sector and business community.\nThe awards had for many years been held in December of each year. The 2018 edition, awarded for nominations made in 2017, was held in April, having been postponed from February due to Beast from the East weather event. No ceremony was held in 2019.\nAward categories\n* The International Person of the Year - awarded to an Irish person who has made an outstanding contribution on an international level, or to a person from outside Ireland who has made a positive impact to life on the island.\n* The Young Person of the Year - for exceptional achievements by a young person (aged 25 or under).\n* Sports Person of the Year\n* Community Group of the Year\n* People of the Year Awards\nComplete list of winners\n2010s\n2018\n(for year 2017)\n* Local historian Catherine Corless, for her work in exposing the treatment of Women and the bodies of children at the Bon Secours Mother and Baby Home, in Tuam, County Galway\n* The community of Ballaghadereen for its welcoming response to the Syrian refugee crisis\n* Colette Byrne, Everyday Hero, for founding Widow.ie, a website which helps people who have lost a spouse\n* Ifrah Ahmed, International Person of the Year, founder of the Ifrah Foundation, for her work in campaigning to end female genital mutilation\n* Harry and Molly Flynn, Young people of the Year, for saving the life of their little sister Isabelle during several apnea episodes\n* Fr. Peter McVerry S.J. (second time awardee), for a lifetime dedication to helping the homeless\n* Vera Twomey, for her campaign, including a 260 km walk to Dublin, to legalise medicinal cannabis on behalf of her daughter Ava who has Dravet syndrome\n* The Irish Coast Guard, for the heroic work of the men and women who risk, and sometimes lose, their lives to assist maritime and coastal communities\n* The community of Erris for its support in the search and rescue operation following the 2017 Irish Coast Guard Rescue 116 crash\n* Joy Neville, Sports Person of The Year, Rugby referee and grand slam winning rugby international\n* Galway county hurling team, Sports People of the Year, for winning the 2017 All-Ireland Senior Hurling Championship\n2016\n* Robbie Keane, International Person of the Year for \"service leadership and passion\" as captain of the Republic of Ireland national football team and charity ambassador\n* Davitt Walsh for rescuing an infant in the Buncrana tragedy\n* Paul and Gary O'Donovan, and Annalise Murphy, Sports Person of the Year (Joint), for their performances at the Rio Olympics\n* Alan Herdman, Young Person of the Year, for rescuing 8 children from drowning in Rusheen Bay\n* AMEN for its work in supporting male victims of domestic abuse.\n* Brother Kevin Crowley for running the Capuchin Day Centre for the homeless\n* John Muldoon and Pat Lam for leading Connacht Rugby to its first Pro12 victory\n* Róisín and Mark Molloy, for highlighting maternity service inequalities across the Irish health service\n* Ireland's Paralympic medallists for their performances at Rio 2016\n2015\n* John Evoy of the Irish Men's Sheds Association for contributing to male mental health and wellbeing\n* Padraic Mangan and Aoibhean Godwin, Young People of the Year for founding FarmSafety4Kids.\n* Philip Grant, Irish Consul, California, and Fr. Brendan McBride, International People of the Year, for their efforts following the Berkeley balcony collapse\n* Fadhili Haji, of Sports Against Racism Ireland and Football Against Racism in Europe for her work in encouraging Muslim girls to play football\n* Ade Stack and Marty Curley, for assisting parents and families of sick children, through the founding of Hugh's House, which provides accommodation near the Rotunda Hospital and the Temple Street Children's University Hospital\n* Yes Equality (Gay and Lesbian Equality Network, Irish Council for Civil Liberties, Marriage Equality Ireland) for their campaign to amend the Constitution\n* Paul O'Connell, former Munster and Irish rugby captain, Sports person of the Year\n* Ken Maleady, for saving a life by delivering CPR during the Dublin City Marathon\n* Óglaigh na hÉireann for the work of the Irish Naval Service in protecting life in the Mediterranean during the European migrant crisis.\n2014\n* Rory O'Neill/Panti, People of the Year Award winner. For his public contributions in fighting for equality and freedom of expression.\n* Paul Kelly, People of the Year Award winner. For his work with Console - a Suicide Prevention, Intervention and Postvention Service.\n* Maurice McCabe and John Wilson, People of the Year Award winners. For exposing irregularities in the work of the justice system.\n* The Society of Saint Vincent de Paul, Community Group of the Year. For its work as a leader in the homeless and hunger charity sector.\n* Owen Condon, Every Day Hero Award, in association with the Nicky Byrne Show with Jenny Greene, RTÉ 2FM. For saving the life of a friend.\n* Adam Horgan, Joint Young Person of the Year Award. For rescuing two people from drowning near Youghal, County Cork.\n* Shane Kennedy, Joint Young Person of the Year Award. For the care he gives to his younger brother who has Cri du chat syndrome.\n* Mary and Tony Heffernan, People of the Year Award winners. For their work with the Saoirse Foundation which helps children affected by Batten disease, and the BUMBLEance, children's ambulance service.\n* Tomi Reichental, International Person of the Year award 2014. For raising awareness of the Holocaust, since his family moved to Ireland in the 1950s.\n* Louise O'Keeffe, People of the Year Award winner. For her struggle to expose the abuse she and others suffered during her school days in 1973.\n2013\n* Fiona Doyle, People of the Year Award winner. For her courage, determination and bravery in fighting for her own rights and the rights of survivors of abuse.\n* Loretta Brennan Glucksman, International Person of the Year winner. In recognition of her tireless work, dedication and commitment, her extraordinary philanthropic efforts with the American Ireland Fund and her generosity of spirit.\n* Detective Garda Adrian Donohoe, Person of the Year Award winner. For his dedication in protecting the ordinary citizens of Ireland, and for his bravery and courage in the line of duty, Detective Garda Adrian Donohoe was posthumously awarded a People of the Year Award..\n* Donal Walsh, Joint Young Person of the Year (posthumous). For his courage, strength, determination and desire to show young people the true value and meaning of life, and for being an inspiration to so many people, Donal Walsh was posthumously awarded a Young Person of the Year Award.\n* Fabian Lugandu, People of the Year Award. For his bravery and fearlessness when he came to the rescue of Liz O’Brien and her son Derek, and for his quick thinking and courage, which ensured that Liz and her son returned home safely that day, Fabian Lugandu was awarded a People of the Year Award.\n* Joe Prendergast, Joint Young Person of the Year. For his motivation, determination and successful achievements, Joe Prendergast was awarded the Young Person of the Year Award.\n* Irish Women's Rugby Team, Sports Person of the Year. For their skill, passion and dedication in achieving their success, for capturing the hearts of the nation and breaking down barriers for women's sport in Ireland, the Ireland women's rugby team received a People of the Year Award.\n* Orla O'Sullivan, People of the Year Award. For her determination, her incredible talent and for acting as an inspiration for others with a disability to follow their dreams, Orla O’Sullivan was awarded a People of the Year Award.\n* Tom Arnold. People of the Year Award. For his commitment and energy as a leading and tireless advocate in the fight against hunger and malnutrition across the world Tom Arnold was presented with a People of the Year Award.\n* Ciarán Finn, Dad of the Year (in association with 2fm's Breakfast with Hector). For being a dedicated dad who goes above and beyond for his children, for teaching skills in a novel and fun way and for being an inspiration to those around him, Ciarán Finn received the Dad of the Year Award in association with 2fm's Breakfast with Hector.\n* Brendan O'Carroll, People of the Year Award. For his services to the Irish entertainment industry and his ability to bring a smile to the faces of so many people, Brendan O'Carroll was awarded a People of the Year Award.\n2012\n* Gill Waters, People of the Year Award winner, for her innovation in pioneering Today FM's Shave or Dye Campaign for the Irish Cancer Society and for creating vital public dialogue around cancer.\n* Adventurer Mark Pollock, People of the Year Award winner, for his determination in overcoming significant physical adversity and constantly pushing out new boundaries as an explorer and adventure racer.\n* Maeve Flaherty, from Ballinteer in Dublin, winner of the 2012 special award category Neighbour of the Year, for her fantastic neighbourly spirit and selflessness in supporting people in difficulty. The award was presented in association with RTÉ 2fm's  Tubridy.\n* Katie Taylor, Sports Person of the Year, for her outstanding sporting achievements, most recently as an Olympic Gold medallist, and for being a proud ambassador for Ireland Boxer.\n* Dr. Tony Scott, of University College Dublin, People of the Year Award winner, for his immense contribution to the field of science in Ireland and co-founding of what is today known as the Young Scientist Exhibition.\n* The people of Union Hall, County Cork, winner of Community Group of the Year, for its outstanding community spirit and unshakeable resolve in efforts to find five fishermen lost at sea on the Tit Bonhomme near Glandore Harbour.\n* Joanne O'Riordan, Young Person of the Year, for her determination in highlighting the challenges faced by people with disabilities today.\n* The late Garda Ciarán Jones, posthumous winner of a People of the Year Award, for the enormous bravery, heroism and selflessness shown by him in losing his life in trying to protect others in the floods of Winter 2011 in Manor Kilbride County Wicklow.\n* Cork Penny Dinners, People of the Year Award winner, for providing food and warmth to those in need in Cork for over 100 years.\n* Broadcaster Colm Murray People of the Year Award winner, for his courageous response to a diagnosis of motor neuron disease, and his inspirational efforts in speaking out about the condition and the need for a cure.\n* The 2012 Irish Paralympic Team People of the Year Award winner, for its inspiring sporting achievements at the London 2012 Paralympic Games and a record haul of 16 medals.\n2011\n* Rory McIlroy, named Sports Person of the Year, for winning the US Open Golf Championship in June 2011 becoming its youngest winner since 1923,  and tying or breaking 12 Open records.\n* The Ireland cricket team for winning a match against England at the 2011 Cricket World Cup\n* Police Constable Ronan Kerr (age 25), (posthumously) for his service in the PSNI, having been killed by a bomb in  Omagh in April 2011\n* Sharon Malloy, from County Laois, named Best Friend of the Year in a special award for 2011, for her support to a friend battling drug addiction\n* The community of Skerries in North County Dublin, named Community of the Year for its extraordinary solidarity in the search for two men who went missing at sea in April 2011\n* Edith Wilkins, named International Person of the Year for her compassion and unfaltering commitment to improving the lives of the people of India, and for providing a safe haven to the most vulnerable in society\n* Joan Freeman for her work in establishing Pieta House, the only service of its kind in Ireland to provide counselling and support for those who are actively suicidal, are contemplating suicide, or who self-harm\n* Jackie Kelly (18 years), from County Tipperary, named Young Person of the Year for being a positive role model in supporting her mum who had been diagnosed with cancer and for her determination to pass her Leaving Cert\n* AJ McCullough (21 years) for his heroic efforts in his brave and courageous rescue of the Attah family when their car plunged into the Boyne Canal in Drogheda in December 2010\n* The Tall Ships Festival Waterford 2011 for the enormous voluntary and community effort which led to a hugely successful festival, with more than 500 volunteers providing support\n2010\n*Owen O'Keefe\n*Catherine McGuinness\n*Dr. Louise Ivers and Gena Heraty\n*The families of victims of Bloody Sunday\n*Emma Fogarty, Epidermolysis bullosa campaigner\n*Rio Hogarty\n*Graeme McDowell\n*Limerick's Garda Síochána's Community Policing Unit\n*Gerry Ryan\n*Gay and Lesbian Equality Network\n2000s\n2009\n* Bernadette Lanigan\n* Sarah Kavanagh\n* Debbie Deegan\n* The Irish Rugby Team\n* Brian O'Driscoll\n* Steve Collins, father of gang-victim Roy Collins, for working to end gang violence in Limerick\n* Christine Buckley\n* Michael O'Brien\n* David Kelly\n* Eleanor Thomson\n* Sylvia Meehan\n* Irish Hospice Foundation\n2008\n* Rose Uí Shúilleabháin\n* Fr Shay Cullen\n* Ronan Hayes\n* Orla Tinsley, Young Person of the Year\n* Keith Duffy\n* Nuala O'Loan\n* Scouting Ireland\n* Robert McLoughlin\n* Joe Dolan\n* Kenny Egan, Darren Sutherland & Paddy Barnes\n2007\n* Pádraig Harrington\n* Christy Moore\n* Maureen Forrest\n* Gerald Killeen\n* Sean Creamer\n* Jane McKenna\n* Fáilte Isteach\n* Taoiseach Bertie Ahern TD, Former UK Prime Minister Tony Blair MP, & Deputy First Minister, Martin McGuinness MP, MLA\n2006\n* Tommy Tiernan\n* Munster Rugby Squad\n* Anita McCluskey\n* James Nesbitt\n* Mags Riordan\n* Alan Kerins\n* Chinedu Onyejelem\n2005\n* Terry Wogan, \"Ireland's Greatest Living Entertainer\"\n* Bob Geldof\n* Seán Kelly\n* Neil Burke, Donal Mooney Students of Palmerstown Community School\n* Fr. Peter McVerry S.J.\n* Bridgeen Hagans & the McCartney Sisters\n* Marian Finucane\n* David Joyce\n2004\n* Sonia O'Sullivan\n* Emma Synnott\n* Fr Kieran Creagh CP\n* Patrick McAweeney\n* Johnathan Irwin & Jack & Jill Foundation\n* Iseult O'Malley, Siobhán Phelan & Peter Ward\n* Rev. Roy Magee\n2003\n* Mary Davis, Person of the Year\n* Dermot Weld\n* Peter Canavan\n* Ita Bourke (posthumous)\n* Michael Elmore-Meegan, International Person of the Year\n* Niall Mellon\n* Ciara McMahon, (joint) Young Person of the Year\n* Niamh Ni Dhoibhlin, (joint) Young Person of the Year\n2002\n* Niall Quinn\n* Rosemary Daly\n* Caroline Casey, (joint) Young Person of the Year\n* Joe Kernan\n* T.K. Whitaker\n* Colm O’Gorman\n* Martin Gildea\n* Francis Fitzsimons\n2001\n* Fr J Linus Ryan\n* Kathryn Sinnott\n* Aidan O’Brien\n* Daráine Ni Mhaolmhichil\n* Tony Paget\n* Sorcha McKenna\n* Fr Mychal Judge & New York City Rescue Services\n2000\n* Maeve Binchy\n* Sean Scollan\n* Ted & Ruby Walsh\n* Rita Lawlor\n* Dr Mo Mowlam\n* The Boyne Rescue & Recovery Service\n* Christina Noble\n1990s\n1999\n* Tom Hyland\n* Eddie Jordan\n* Michael Colgan\n* Dr. Harry Counihan\n* The Coveney Family\n* Dr. Anthony O’Reilly\n* Ronan Keating\n* Dr Mary McLoughlin\n* Mamo McDonald\nUna gallagher\n1998\n* Queva Griffin, double organ transplant recipient\n* Dr. Jerry Cowley\n* Sophia McColgan\n* Brian Kerr\n* Anna May McHugh of the National Ploughing Championships\n* Dominic Pinto\n* Senator George Mitchell\n1997\n* Lainey Keogh\n* Michael Martin\n* Jane O'Brien\n* Mícheál Ó Muircheartaigh\n* Seamus Stack\n* Julia Windle\n* Mary Robinson\n1996\n* Dr. Mary Redmond\n* Michelle Smith\n* Bridie Lynch\n* Elizabeth O'Farrell\n* Jer O'Donoghue\n* Pat & Nuala Matthews\n* Dr. Derek Hill\n* Veronica Guerin\n1995\n* Ger Loughnane\n* Martin Naughton\n* Derek Nally\n* Dr. D. Colbert\n* Maureen Potter\n* Gerardo V. Garcia (PDI)\n* Sonya Doyle\n* R. McDermott\n* Noel McDonagh\n1994\n* Jim Callery & Luc Dodd\n* Moya Doherty & Bill Whelan\n* Jane Feehan\n* Sr. Jennifer McAleer\n* Dr. Patrick McKeon\n* Ellen Mongan\n* Norma Smurfit\n* Martina Daly & Jean Withers\n1993\n* Paddy Doyle\n* Noel C. Duggan\n* Sonia O'Sullivan\n* Garda Agnes Reddy\n* Dr. Joseph Robins\n* Adi Roche\n* Sr. Carmel Walsh\n* J. Dawson Stelfox\n1992\n* Sgt. Michael Carruth & Mr Wayne McCullough\n* Brian McEniff\n* Sr. Eileen Fahey\n* Prof. Fred Given\n* Kilkee Marine Rescue Recovery Service\n* Seamus Kinsella\n* Martin Naughton\n* John O'Shea\n1991\n* Tarlach De Blacam\n* Kenneth Branagh\n* Jim Connolly\n* The Cooley S.T.O.P. Committee\n* Dr. Edward Culleton\n* Brian Friel\n* Catherine Joyce\n* Dr. Thomas McGinley\n1990\n* Sr. Aquinas\n* Packie Bonner\n* Joseph Fennell\n* Davoren Hanna\n* John B. Keane\n* Kay Murphy\n* Eamon O'Leary\n* Brian Keenan\n* Brenda Gillham\n* Elaine Spence\n* Daniel St Ledger\n1980s\n1989\n* Peter Sutherland\n* Shauna McWilliams\n* Brian Banks\n* Gary O'Toole\n* Mary Moriarty\n* Denis Mulcahy\n* Patrick Mulcahy\n* Joan McGinley\n* Liam Skelly\n* Seamus Heaney\n1988\n* Tommy Boyle\n* Jack Charlton O.B.E.\n* Carmencita Hederman\n* Ollie Jennings\n* Alice Leahy\n* Maureen O'Mahony\n* Norma Smurfit\n* Gordan Walsh\n1987\n* Anna Curtin\n* Noel C. Duggan\n* Stanley Gillespie\n* Shelia Greenfield\n* Sr. Ignatius Phelan & Sr. Francis Rose O'Flynn\n* Donncha Ó Dúlaing\n* John O'Shea\n* Stephen Roche\n1986\n* Denis Brosnan\n* Cathal McDonagh\n* Gary Hynes\n* Neil Jordan\n* William A. Houlihan\n* Rev. Cecil Kerr\n* Susan McKenna-Lawlor\n* Jonjo O'Neill\n1985\n* Barry McGuigan\n* Sr. Vincent Devlin\n* Gerry Joyce\n* Gay Byrne\n* William Harford Rutherford\n* P. V. Doyle\n* Sean Davey\n* Bob Geldof\nPC John Myhill\n1984\n* Barry O'Donnell\n* Prem Puri\n* John Bermingham\n* Michael O'Hehir\n* Maeve Calthorpe\n* Patrick O'Connell\n* Feargal Quinn\n* John Hume MP, MEP\n* John Parker\n1983\n* Sheila Goldberg\n* Coilin O h'larnain\n* Carol Moffett\n* Joan Denise Moriarty\n* Mary O'Donoghue\n* Canon Billy Wynne\n* Ireland Special Olympics Team\n* Detective Inspector Denis Mullins\n1982\n* Fr. Harry Bohan\n* Irene Daly\n* James Doogan\n* Garda Eamon Doyle\n* Sr. Colette Dwyer\n* Pól Ó Foighil\n* Joseph Hughes\n* Dr. Michael J. Kileen\n* Thomas McGarry\n* Seamus McGuire\n* Prof. Tom Raftery\n* Dr. T. K. Whitaker\n* Monica Wilson\n1981\n* Rick Bourke\n* Frank Cahill\n* Br. Kevin Crowley OFM, CAP\n* Mary Dunlop\n* James Hughes\n* Freda Lyness\n* Kevin O'Doherty\n* Tony McNamara\n* Christopher Nolan\n* Bridgid O'Lynn\n* Thomas Stephens\n* Jerry Tyrrell\n1980\n* Sr. Anna\n* Tony Barry\n* Cecelia Carroll\n* Iris Doreen Charles\n* Lorna Daly\n* Mildred Dugan\n* Lady Valerie Goulding\n* Katherine Lyons\n* Very Rev. James Canon McDyer P.P.\n* Philip A. Mullally\n* Rev. Fr. Eoin Murphy\n* Donal O'Connor N.T.\n* Major General James J. Quinn\n1970s\n1979\n* Willie Bermingham\n* Dr. J.E. De Courcy Ireland\n* Rev. Dean Griffin\n* Rev. Monsignor Horan, for his work in arranging the visit of Pope John Paul II to the Republic of Ireland\n* Sr. Marian\n* Dr. Charles Mollan\n* Ms G. Morris\n* Denis O'Brien\n* Eric Peard\n* Dr. Patricia Sheehan\n* Eva Wall\n* Gisela Whyte\n1978\n* Ivy Bourke\n* Sr. Joan Bowles\n* Tony Byrne P.C.\n* Joan Carr\n* Rev. Ray Davey M.B.E.\n* Dr. Muriel Gahan\n* Matthew Kirwan\n* Vera Montgomery\n* Dr. Marie Mulcahy\n* Christine E. O'Rourke\n* Marie Roycroft\n* Bro. Aloysius Shannon O.H.\n1977\n* Criostoir De Baroid\n* Sr. M. Consillio Fitzgerald\n* H.J. Egar\n* Mary Hanley\n* T.J. Hargadon\n* Sr. Kevin Kerin\n* Dr. Brendan Menton & Don Seery of Home Farm F.C.\n* Tom & Senator Joe McCartin\n* Mary F. O'Brien\n* Arthur O'Flaithearta\n* Eileen Proctor\n* Dr Barbara Stokes\n1976\n* Betty Williams\n* Mairead Corrigan\n* Joseph O'Brien\n* Bro. Vivian Cassells\n* T. Pearce Leahy\n* S.H.A.R.E.\n* Megan Maguire\n* Dr. Jopphn F. Fleetwood\n* Sean Cooney\n* Bridie Maguire\n* Rev. W. Sydney Callaghan\n* Michael O'Regan\n* Most Rev. Dr. Birch\n1975\n* Col. Joseph Adams\n* James Anderson\n* Dr. Joseph Barnes\n* Maureen Black\n* Joseph Connolly\n* Thomas C. Fallon\n* Patricia Keeley\n* Patrick J. Leahy\n* Sr. M. Nicholas O.P.\n* Patrick J. O'Brien\n* Maura O'Dea\n* Stephen Whittle\nReferences\nExternal links\n*[https://web.archive.org/web/20190826002636/http://www.peopleoftheyear.com/ PeopleOfTheYear.com (archived)]\n*[http://www.peopleoftheyear.com/PeopleOfTheYear/media/PotyMedia/PDFs/POY-List-of-Winners-up-to-2012.pdf?ext=.pdf People of the Year Award - List of Winners]"
    }
  ]
}