{
  "content": [
    {
      "type": "text",
      "text": "# List of rulers of the Kingdom of the Isles\n\n]]\nThe Kingdom of the Isles comprised the Hebrides, the islands of the Firth of Clyde and the Isle of Man from the 9th to the 13th centuries AD. The islands were known to the Norse as the , or \"Southern Isles\" as distinct from the  or Northern Isles of Orkney and Shetland. The historical record is incomplete and the kingdom was probably not a continuous entity throughout the entire period. The islands concerned are sometimes referred to as the \"Kingdom of Mann and the Isles\", although only some of the later rulers claimed that title. At times the rulers were independent of external control, although for much of the period they had overlords in Norway, Ireland, England, Scotland or Orkney. At times there also appear to have been competing claims for all or parts of the territory. The islands involved have a total land area of over  Isle of Man Government. Retrieved 11 January 2011. the islands of the Clyde, the Inner Hebrides and the Outer Hebrides.|group=\"Note\"}} and extend for more than  from north to south.\nViking influence in the area commenced in the late 8th century, and whilst there is no doubt that the Uí Ímair dynasty played a prominent role in this early period, the records for the dates and details of the rulers are speculative until the mid-10th century. Hostility between the Kings of the Isles and the rulers of Ireland, and intervention by the crown of Norway (either directly or through their vassals the Earls of Orkney) were recurring themes.\nInvasion by Magnus Barelegs in the late 11th century resulted in a brief period of direct Norwegian rule over the kingdom, but soon the descendants of Godred Crovan re-asserted a further period of largely independent overlordship. This came to an end with the emergence of Somerled, on whose death in 1164 the kingdom was split in two. Just over a century later the islands became part of the Kingdom of Scotland, following the 1266 Treaty of Perth.\nThe orthography of the rulers' names is complicated as Old Norse and Gaelic were both spoken throughout the region for much of period under consideration. Thus a single individual might be referred to as Rognvaldr in Icelandic sources, Rag(h)nall in Gaelic, Reginaldus in Latin and perhaps \"Rognvald\" or \"Reginald\" in English language sources.\n, the site of a 9th-century siege by Ímar and Amlaíb Conung]]\n9th and early 10th centuries\nDuring this period the historical record is particularly sparse and these early entries must be considered as somewhat speculative.\n{| class=\"wikitable sortable\" style=\"font-size:100%; width:75%; border:0px; text-align:left; line-height:150%;\"\n!width=\"15%\"|Ruler of the Hebrides\n!width=\"15%\"|Dates\n! width=\"25%\"|Title\n!width=\"40%\"|Notes\n|-\n|Unknown father of Thórir\n|848\n|King of Viking Scotland\n|According to the Orkneyinga saga Rognvald Eysteinsson had a number of sons including Ivar and Thorir the Silent, Ivar being killed in battle during Harald Fairhair's expedition to the west. According to Irish sources Thorir was the heir of a king of \"Viking Scotland\" who took an army to Ireland in 848.\n|-\n|Gofraid mac Fergusa\n|d. 853\n|Lord of the Hebrides\n|The Annals of the Four Masters calls him toisech Innsi Gall.\n|-\n|Gofraidh\n|pre 872–873\n|King of Lochlann\n|Father of Amlaíb Conung and Ímar\n|-\n|Ímar\n|873\n|King of the Norwegian Vikings of the whole of Ireland and Britain\n|May have succeeded his father briefly\n|-\n|Amlaíb Conung\n|873\n|King of the Northmen/King of the Western Sea\n|Ímar's brother\n|-\n|Ásbjǫrn skerjablesi\n|874\n|\n|\n|-\n|Ketill Flatnose\n|c 890–900\n|King of the Isles\n|The earliest certain written references to Ketill are from the sagas written 200 years or more after his death. Unlikely to have been ruler of Mann and may have ruled in the mid, rather than late ninth century.\n|-\n|Unknown\n|c 900–941\n|\n|Possibly ruled by Uí Ímair dynasts Ragnall ua Ímair (d. 920/1) who ruled Mann, Sitric Cáech (d. 927), Gofraid ua Ímair (d. 934) and Amlaíb mac Gofraid (d. 941) as Kings of Dublin.\n|-\n|}\nIt is also possible that Eiríkr, King of York from 947–948 and 952–5, was a ruler in the islands at some stage in the mid-10th century. Eiríkr is believed by some authorities to be synonymous with the saga character Eric Bloodaxe, although the connection is questioned by Downham (2007), who argues that the former was an Uí Ímair dynast rather than a son of Harald Fairhair. A raid on Northumbria in 949, the purpose of which may have been either to support or oppose the kingship of Amlaíb Cuarán is described as predam albidosorum idem nannindisi in the Chronicle of the Kings of Alba. Alfred P. Smyth translated this as \"the raid of the men from beyond the spine of Britain, that is, of the islands.\"\nLate 10th and 11th centuries\n\" coin from the British Museum, minted at Dublin c. 1050]]\nin the Viking Ship Museum in Oslo]]\n{| class=\"wikitable sortable\" style=\"font-size:100%; width:75%; border:0px; text-align:left; line-height:150%;\"\n!width=\"15%\"|Ruler of the Hebrides and Mann\n!width=\"15%\"|Period of rule\n! width=\"25%\"|Title\n!width=\"40%\"|Notes\n|-\n|Amlaíb Cuarán\n|c. 941?–980\n|King of the Isles (and possibly King of Mann)\n|Amlaíb was later King of Dublin and succeeded Amlaíb mac Gofraid as King of Northumbria in 941 and died on Iona in 981\n|-\n|Maccus mac Arailt\n|980–?\n|King of the Isles\n|Said to have been \"brought under subjection\" by Edgar the Peaceful, King of England who died in 975\n|-\n|Gofraid mac Arailt\n|?–989\n|King of the Isles\n|Brother of Maccus mac Arailt\n|-\n|Gilli\n|990–?\n|Jarl\n|Operated under Sigurd the Stout, Earl of Orkney & Mormaer of Caithness. Married to Sigurd's sister. Sigurd himself was a vassal of the King of Norway.\n|-\n|Ragnall mac Gofraid\n|?–1005\n|King of the Isles\n|Son of Gofraid mac Arailt\n|-\n|Sigurd the Stout\n|1005–1014\n|Earl of Orkney & Mormaer of Caithness\n|Vassal of the King of Norway\n|-\n|Einar Sigurdsson*?\n|1014–1016?\n|Joint Earl of Orkney\n|Thomson (2008) suggests Einar rangmunnr may have inherited his father's territories in the Hebrides.\n|-\n|Håkon Eiriksson*\n|1016–1030\n|Ruler of the Suðreyar\n|Possibly as a vassal of Cnut the Great\n|-\n|Olaf Sigtryggsson*\n|1030?–1034\n|King of Mann and many of the other islands of Denmark\n|Son of Sitric Silkbeard and grandson of Amlaíb Cuarán\n|-\n|Thorfinn the Mighty\n|c 1035–c 1058\n|Earl of Orkney & Mormaer of Caithness\n|Vassal of the King of Norway\n|-\n|Ímar mac Arailt*\n|c 1045?\n|\n|Ruler of Dublin and possibly Mann. In 1045 Ímar crushed the Ulaid in a raid on Rathlin which may be evidence that he also controlled Mann at this point.\n|-\n|Echmarcach mac Ragnaill*\n|1052–1061\n|King of Mann\n|Probably ruler of both Dublin and Mann prior to 1052, when he was expelled from the former by Diarmait mac Maíl na mBó. Possibly son of Ragnal mac Gofraid and thus possibly a King of Innse Gall as well.\n|-\n|Murchad mac Diarmata*\n|1061–1070\n|King of Dublin and Mann?\n|\n|-\n|Diarmait mac Maíl na mBó\n|1070–1072\n|King of Dublin and the Isles\n|Father of Murchad, but who ruled after him over Dublin \"and, one assumes, Man\"\n|-\n|Godred Sitricson\n|?–1074\n|King of Man\n|\n|-\n|Fingal Godredson\n|1074–?\n|King of Man\n|Son of Godred Sitricson\n|-\n|Godred Crovan\n|1079–1094\n|King of Dublin and the Isles\n|Son of \"Harald the Black of Ysland\"\n|-\n|Possibly Lagmann Godredsson\n|1095–1098\n|\n|Eldest son of Godred Crovan. Whether Lagmann began his reign before or after Magnus Barelegs's arrival is not known for certain.\n|-\n|}\nEarly rulers of Mann\nVarious rulers have been identified as ruling Man, but not the Isles as a whole. The Isle of Man may have fallen under Norse rule in the 870s, and paradoxically they may have brought the Gaelic language with them. The island has produced a more densely distributed Viking Age archaeology than anywhere else in the British Isles, but the written records for this time period are poor.\n{| class=\"wikitable sortable\" style=\"font-size:100%; width:75%; border:0px; text-align:left; line-height:150%;\"\n!width=\"15%\"|Rulers of Mann\n!width=\"15%\"|Period of reign\n! width=\"15%\"|Titles\n!width=\"40%\"|Notes\n|-\n|Otir\n|912?–914?\n|Jarl and \"Master of the Isle of Man\"\n|Possibly as a vassal of Ragnall ua Ímair\n|-\n|Ragnall ua Ímair\n|914 to 921?\n|?\n|Defeated Bárid son of Otir in a naval battle off Man in 914\n|-\n|Gothfrith ua Ímair\n|pre 927 to?\n|\n|Father of Amlaíb\n|-\n|Amlaíb mac Gofraid\n|pre 935 to 941\n|King of Northumbria and possibly King of the Isles\n|After the death of Athelstan in 939, Edmund ceded Northumbria to Amlaíb. Married a daughter of Constantine II.\n|-\n|}\nThere then follows a period when it is likely that the Western Isles and Mann were jointly held by rulers of the House of Ímar (see above). Downham (2007) suggests Lagmann Godredson may have \"wielded power in Man\" and possibly even have been king but was expelled sometime after 1005, perhaps by Brian Bóruma. This may indicate that the Earls of Orkney did not control Man itself in the early 11th century. Echmarcach mac Ragnaill and his successors certainly did control Mann, but the extent of their rule over the islands of the Clyde and the Hebrides is not clear. Óláfr mac Lagmann (or Lagmainn) is recorded as having been killed at Clontarf in 1014, fighting with \"warriors from the Hebrides\".\n{|  class=\"wikitable sortable\" style=\"font-size:100%; width:75%; border:0px; text-align:left; line-height:150%;\"\n!width=\"15%\"|Rulers of Mann\n!width=\"15%\"|Period of rule\n! width=\"15%\"|Title\n!width=\"15%\"|Notes\n|-\n|Lagmann mac Gofraid\n|?–1005\n|\"King of the Swedes\"\n|Possibly a son of Gofraid mac Arailt\n|-\n|Ottar\n|d. 1098\n|Jarl\n|Earl of \"one half of Man\"\n|-\n|}\nThe period 1095–1098 seems to have been politically unsettled, culminating in a Manx civil war between the north and south of the island. A battle at Santwat between the northerners under Jarl Óttar and the southerners under Macmaras (or MacManus) in 1098 resulted in the deaths of both leaders.\nEarly rulers of the Hebrides\nIn Irish mythology the Outer Hebrides were the home of the Fomorians, described as \"huge and ugly\" and \"ship men of the sea\". They were pirates, extracting tribute from the coasts of Ireland and one of their kings was Indech mac Dé Domnand (i.e. Indech, son of the goddess Domnu, who ruled over the deep seas). Indech is also mentioned in the Cath Maige Tuired along with Balor grandson of Nét, his rival who is described as righ na n-Innsi ('king of the Isles'), which may have meant the king of the Inner Hebrides. Together they \"gathered all the forces from Lochlainn westwards into Ireland to impose their tribute and their rule over them.\"\nVarious later rulers such as Gebeachan are also mentioned in early sources as having a role of some kind over unspecified areas of the northern part of the Kingdom of the Isles.\n{| class=\"wikitable sortable\" style=\"font-size:100%; width:75%; border:0px; text-align:left; line-height:150%;\"\n!width=\"15%\"|Rulers of the Hebrides\n!width=\"15%\"|Date\n! width=\"15%\"|Title\n!width=\"15%\"|Notes\n|-\n|Indech mac Dé Domnand\n|pre 9th century?\n|King of the Fomoire\n|\n|-\n|Balor, grandson of Neit\n|pre 9th century?\n|King of the Hebrides\n|\n|-\n|Gebeachan\n|937\n|King of the Islands\n|Died whilst fighting with Amlaíb mac Gofraid at Brunanburh\n|-\n|Conmael mac Gilla Airi\n|980\n|Tributary King of the Gall\n|Fought with Amlaíb Cuarán at Tara\n|-\n|}\n12th and 13th centuries\nKings of Mann and the Isles\nin Orkney where Haakon Haakonarson, the last Norwegian king to rule over the Sudreyjar died in 1263. The spire of St Magnus Cathedral can be seen in the background.]]\n{| class=\"wikitable sortable\" style=\"font-size:100%; width:75%; border:0px; text-align:left; line-height:150%;\"\n!width=\"15%\"|Ruler of the Hebrides and Mann\n!width=\"15%\"|Period of reign\n! width=\"15%\"|Title\n!width=\"40%\"|Notes\n|-\n|Magnus Barelegs\n|1098–1102\n|Possibly King of the Isles\n|Direct Norwegian rule\n|-\n|Sigurd Magnusson\n|1102–1103\n|Direct Norwegian rule\n|Nominal control by under-age son of Magnus Barelegs\n|-\n|Lagmann Godredsson\n|1103–1110\n|\n|Eldest son of Godred Crovan\n|-\n|Domnall mac Taidc Uí Briain\n|1111–1112\n|Regent during the minority of Olave the Red\n|Nephew of Muirchertach Ua Briain. Expelled by the Islesmen.\n|-\n|Olave the Red\n|1112–1152\n|\n|Son of Godred Crovan\n|-\n|Godred the Black\n|1154–1156\n|King of Man and the Isles\n|Son of Olave the Red\n|-\n|Somerled's sons & Godred the Black\n|1156–1158\n|Rulers of the southern islands and of Mann and the North Isles respectively.\n|Somerled's sons were Dubgall, Ragnall and Aonghus\n|-\n|Somerled\n|1158–1164\n|Lord of Argyll, Kintyre and Lorne\n|Son-in-law of Olave the Red, and son of GilleBride of the old royal house of Dalriada, and a Norse woman. By 1158 Somerled was Rex Insularum, King of the Isles. His dominion covered 25,000 square miles and more than 500 islands.\n|-\n|}\nGodred the Black's dictatorial style appears to have made him very unpopular with the Islesmen, and the powerful barons of the isles began plotting with an emerging and forceful figure&nbsp;– Somerled, Lord of Argyll. When Godred heard of this he engaged Somerled's forces in the naval Battle of Epiphany in 1156. There was no clear victor, but it was subsequently agreed that Godred would remain the ruler of Man and the northern Hebrides, whilst Somerled's young sons would nominally control the southern Inner Hebrides, Kintyre and the islands of the Clyde under their father's supervision. Two years later Somerled's invasion of the Isle of Man caused Godred to flee to Norway, leaving the former as the undisputed ruler of the entire realm.\nFollowing the death of Somerled in 1164 Godred re-took possession of his pre-1158 territories in Mann and the north and the southern isles were distributed amongst Somerled's sons as had been previously agreed: Dubgall received Mull, Coll, Tiree and Jura; Islay and Kintyre went to Ragnall; Bute to Aonghas, with Arran possibly divided between him and Reginald. The Chronicle of Man and the Sudreys lamented that Somerled's marriage to Ragnhildis, daughter of Olave the Red, had been \"the cause of the ruin of the whole kingdom of the Isles\".\nKings of Mann and the North Isles\nis popularly attributed to Olaf the Black, although modern research dates it to a much later period.]]\n{| class=\"wikitable sortable\" style=\"font-size:100%; width:75%; border:0px; text-align:left; line-height:150%;\"\n!width=\"15%\"|Kings of Mann\n!width=\"15%\"|Norse name\n!width=\"15%\"|Gaelic name\n!width=\"15%\"|Period of reign\n!width=\"15%\"|Title\n!width=\"40%\"|Notes\n|-\n|Reginald\n|Unknown\n|Unknown\n|1164\n|No record\n|Half-brother of Godred the Black\n|-\n|Godred the Black\n|Guðrøðr Óláfsson\n|Gofraid mac Amlaíb\n|1164–1187\n|King of the Isles\n|Re-instated\n|-\n|Ragnvald\n|Rögnvaldr Guðrøðarson\n|Raghnall mac Gofraidh\n|1188–1226\n|King of the Isles\n|Son of Godred the Black\n|-\n|Olaf the Black\n|Óláfr Guðrøðarson\n|Amlaíb mac Gofraid\n|1226–1237\n|King of Mann and the Isles\n|Half-brother of Raghnall mac Gofraidh\n|-\n|Óspakr-Hákon\n|\n|Gille Escoib mac Dubgaill\n|1230\n|King of the Suðreyjar\n|Son of Dubgall mac Somairle?\n|-\n|Gofraid Donn\n|Guðrøðr Rögnvaldsson\n|Gofraid mac Ragnaill\n|1230\n|\n|Son of Raghnall mac Gofraidh\n|-\n|Harald Olafsson\n|Haraldr Óláfsson\n|Aralt mac Amlaíb Duib\n|1237–1248?\n|King of Mann and the Isles\n|Son of Olaf the Black\n|-\n|Ragnvald Olafsson\n|Rögnvaldr Óláfsson\n|Ragnall mac Amlaíb\n|1249\n|King of Mann and the Isles\n|Son of Olaf the Black, his rule was brief\n|-\n|Harald Godredsson\n|Haraldr Guðrøðarson\n|Aralt mac Gofraid Donn\n|1249–1250\n|King of Mann\n|Son of Gofraid Donn and grandson of Raghnall mac Gofraidh\n|-\n| Magnus Olafsson\n|Magnus Óláfsson\n|Mágnus mac Amlaib\n|1252–1265?\n|King of Mann and the Isles\n|Son of Olaf the Black\n|-\n|}\nIn a precursor to 1263, Norwegian forces invaded in 1230 in response to dynastic struggles amongst Godred the Black's descendants. The Chronicle of Lanercost states that a Norwegian fleet sailed down the west coast of Scotland with Óspakr-Hákon, who had been appointed \"King of the Suðreyjar\" by the King of Norway (and who may have been a son of Dubgall mac Somairle). His forces took Rothesay Castle, hacking through the walls with their axes. The Eirspennill version of Hákonar saga Hákonarsonar states that the fleet then sailed to Kintyre where Óspakr-Hákon fell ill and died. Olaf the Black then took control of the fleet, and led it to the Isle of Man. He and Gofraid Donn, the son of Raghnall mac Gofraidh, divided the kingdom between themselves, with the latter retaining Mann, and the former controlling the northern islands. A short time later Gofraid Donn was slain, possibly on Lewis.\nOn 30 May 1249, Ragnvald Olafsson was slain in a meadow near the Church of the Holy Trinity at Rushen by a knight named Ívarr, along with several of the knight's followers. The Chronicle of Lanercost states that he had reigned for only 27 days. Harald Godredsson then seized the kingship, although he was summoned to Norway the following year and effectively dispossessed. Magnus Olafsson was the last of the Norse kings to rule Mann, which was absorbed into the Kingdom of Scotland on his death.\nKings of the South Isles\nand the descendants of Somerled.]]\n{| class=\"wikitable sortable\" style=\"font-size:100%; width:75%; border:0px; text-align:left; line-height:150%;\"\n!width=\"15%\"|Rulers of the Hebrides\n!width=\"15%\"|Gaelic name\n!width=\"15%\"|Period of reign\n! width=\"15%\"|Title\n!width=\"40%\"|Notes\n|-\n|Dugald\n|Dubgall mac Somairle\n|1164–c1175\n|King of the Isles\n|Son of Somerled\n|-\n|Ranald\n|Ragnall mac Somairle\n|1164–1207\n|King of the Isles\n|Son of Somerled\n|-\n|Duncan\n|Donnchadh mac Dubgaill\n|? – c. 1244?\n|King of the Sudreys\n|Son of Dubgall mac Somairle\n|-\n|Dugald Screech\n|Dubgall mac Dubgaill\n|?\n|King of the Sudreys\n|Son of Dubgall mac Somairle\n|-\n|Somerled\n|Somairle mac Dubgaill\n|? – 1230\n|King of the Sudreys\n|Probably a son of Dubgall mac Somairle\n|-\n|Ruari\n|Ruaidhri mac Raghnaill\n|1207?–1247?\n|King of the Isles\n|Son of Ragnall mac Somairle\n|-\n|Ewen of Argyll\n|Eóghan\n|1248–1263\n|King of the Sudreys\n|Son of Donnchadh mac Dubhghaill\n|-\n|Dugald MacRuairi\n|Dubhghall mac Ruaidhri\n|1249–1266?\n|King of the Sudreys\n|Son of Ruaidhri mac Raghnaill\n|-\n|}\nThe 1780 Anecdotes of Olave the Black (which are based on Hákonar saga Hákonarsonar) state that there were 3 Sudreyan kings all existing at one time who were \"of the family of Somerled\" and who were \"very untrue to King Haco\". It is not entirely clear which three kings are being referred to. They include Dubgall \"Screech\" mac Dubgaill and his brother Donnchadh and either Eóghan of Argyll who \"was king afterwards\" or possibly an unknown \"relation of theirs, called Somerled, [who] was then also a King in the Sudreys\". This Somerled, who died in 1230, may have been a brother or cousin of Dubgall and Donnchadh.\nRagnall mac Somairle's son, Ruaidhri mac Raghnaill may have been the \"king of the Isles\" who was recorded in the Irish chronicles as having been killed fighting against the English at the Battle of Ballyshannon in 1247. Ruaidhri's direct descendants Dubhghall and Ailean, who ruled Garmoran and the Uists are generally not given titles by Scottish sources. However the Icelandic Annals recorded for the year 1249 that: \"Dubhghall took kingship in the Sudreys.\" Norse sources also refer to kingship being held by Eóghan of Argyll, although this was rescinded by King Haakon when he refused to participate in the latter's expeditions against Scotland.\nSee also\n* List of Manx consorts\n* Lists of monarchs in the British Isles\n* Lord of the Isles\nReferences\n; Notes\n; Footnotes\n; General references\n* Anderson, Alan Orr (1922) Early Sources of Scottish History: A.D. 500 to 1286. 2. Edinburgh. Oliver and Boyd.\n* Barrett, James H. \"The Norse in Scotland\" in Brink, Stefan (ed) (2008) The Viking World. Abingdon. Routledge.\n* Coventry, Martin (2008) Castles of the Clans. Musselburgh. Goblinshead.\n* Crawford, Barbara E. (1987) Scandinavian Scotland. Leicester University Press.\n* Downham, Clare (2007)\"England and the Irish Sea Zone in the Eleventh Century\" Anglo-Norman Studies, 26, pp.&nbsp;55–73.https://www.academia.edu/1763453/England_and_the_Irish_Sea_Zone_in_the_Eleventh_Century\n* Downham, Clare (2007) Viking Kings of Britain and Ireland: The Dynasty of Ívarr to A.D. 1014. Edinburgh. Dunedin Academic Press.\n*\n*\n* Etchingham, Colman (2001) \"North Wales, Ireland and the Isles: the Insular Viking Zone\". Peritia. 15 pp.&nbsp;145–87\n* Gregory, Donald (1881) The History of the Western Highlands and Isles of Scotland 1493–1625. Edinburgh. Birlinn. 2008 reprint – originally published by Thomas D. Morrison.\n*  Also [https://www.jstor.org/pss/550095 JSTOR].\n* Hunter, James (2000) Last of the Free: A History of the Highlands and Islands of Scotland. Edinburgh. Mainstream.\n* Johnstone J. (ed) (1780) [http://www.egil.nottingham.ac.uk/texts/olave_the_black/ Anecdotes Of Olave The Black, King Of Man, And The Hebridian Princes Of The Somerled Family (by Thordr) To Which Are Added Xviii. Eulogies On Haco King Of Norway, By Snorro Sturlson, Publ. With A Literal Version And Notes]. Retrieved 27 December 2012.\n* McDonald, R. Andrew (1997) ''The Kingdom of the Isles: Scotland's Western Seaboard c. 1100 – c. 1336. East Linton. Tuckwell Press.\n* McDonald, R. Andrew (2007) Manx Kingship in its Irish Sea setting, 1187–1229: King Rognavaldr and the Crovan dynasty. Dublin. Four Courts Press. .\n* Marsden, John (2008) \"Somerled and the Emergence of Gaelic Scotland\". Edinburgh. Birlinn.\n* Munch, P.A. (ed) and Rev. Goss (tr) (1874) [http://www.isle-of-man.com/manxnotebook/manxsoc/msvol22/index.htm Chronica regnum Manniae et insularum: The Chronicle of Man and the Sudreys]. Volume 1. Douglas, Isle of Man. The Manx Society. Retrieved 9 January 2011.\n* Ó Corráin, Donnchadh (Mar 1979) \"High-Kings, Vikings and Other Kings\". Irish Historical Studies 22 No. 83 pp.&nbsp;283–323. Irish Historical Studies Publications.\n* Ó Corráin, Donnchadh (1998) [http://www.ucc.ie/celt/news.html Vikings in Ireland and Scotland in the Ninth Century] CELT. Retrieved 27 December 2012.\n* Pálsson, Hermann and Edwards, Paul Geoffrey (1981). Orkneyinga Saga: The History of the Earls of Orkney. Penguin Classics.\n* .\n* Sellar, William David Hamilton Hebridean sea kings: The successors of Somerled, 1164–1316 in Cowan, Edward J. and McDonald, Russell Andrew (eds) (2000) Alba: Celtic Scotland in the middle ages. Tuckwell Press.\n* Thomson, William P. L. (2008) The New History of Orkney. Edinburgh. Birlinn.\n* Watson, W. J. (1994) The Celtic Place-Names of Scotland''. Edinburgh; Birlinn. . First published 1926.\n* Woolf, Alex (2005) \"The origins and ancestry of Somerled: Gofraid mac Fergusa and 'The Annals of the Four Masters'\". Mediaeval Scandinavia. 15 pp.&nbsp;199–213.\n* Woolf, Alex \"The Age of the Sea-Kings: 900–1300\" in Omand, Donald (2006) The Argyll Book. Edinburgh. Birlinn.\n* Woolf, Alex (2007) From Pictland to Alba, 789–1070. The New Edinburgh History of Scotland. Edinburgh University Press."
    }
  ]
}