{
  "content": [
    {
      "type": "text",
      "text": "# List of World Heritage Sites in Portugal__disambig_1\n\n}}\n}}\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) designates World Heritage Sites of outstanding universal value to cultural or natural heritage which  have been nominated by countries that are signatories to the UNESCO World Heritage Convention, established in 1972. Cultural heritage consists of monuments (such as architectural works, monumental sculptures, or inscriptions), groups of buildings, and sites (including archaeological sites). Natural heritage is defined as natural features (consisting of physical and biological formations), geological and physiographical formations (including habitats of threatened species of animals and plants), and natural sites which are important from the point of view of science, conservation or natural beauty. Portugal ratified the convention on 30 September, 1980.\nThere are 17 World Heritage Sites listed in Portugal, with a further 11 on the tentative list. The first four sites listed in Portugal were the Monastery of the Hieronymites and Tower of Belém in Lisbon, the Monastery of Batalha, the Convent of Christ in Tomar, and the town of Angra do Heroísmo, in 1983. The most recent additions to the list were the Sanctuary of Bom Jesus do Monte in Braga and the Palace of Mafra with its hunting park in 2019. One site, the Laurisilva, is located in the island of Madeira and is Portugal's only natural site; the other sites are cultural. Two sites are located in the Azores archipelago. The Prehistoric Rock Art Sites in the Côa Valley and Siega Verde is shared with Spain, making it Portugal's only transnational site.\n__TOC__\nWorld Heritage Sites\nUNESCO lists sites under ten criteria; each entry must meet at least one of the criteria. Criteria i through vi are cultural and vii through x are natural.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n|+\n! style=\"width:100px;\" scope=\"col\" | Site\n! class=\"unsortable\" style=\"width:150px;\" scope=\"col\" | Image\n! style=\"width:80px;\" scope=\"col\" | Location\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\" data-sort-type=\"number\"|\n! scope=\"col\" class=\"unsortable\"| Description\n|-\n! scope=\"row\"| Central Zone of the Town of Angra do Heroismo in the Azores\n|\n| Terceira Island\n| 1983\n| 206; iv, vi (cultural)\n| The town was founded in the late 15th century during the Age of Discovery. For 400 years, until the advent of steamships, it served as a port of call for ships heading to equatorial Africa and the East and West Indies, and back to Europe. The town's defence systems include the forts of São Sebastiã and São João Baptista. There are several Baroque churches. The town was significantly damaged in a 1980 earthquake but has since been substantially restored.\n|-\n! scope=\"row\"| Monastery of the Hieronymites and Tower of Belém in Lisbon\n|\n| Lisbon\n| 1983\n| 263bis; iii, vi (cultural)\n| Both the Monastery and the Tower, located in the Belém district of Lisbon along the Tagus river, are symbolically linked to the Age of Discovery when Portugal explored the world. The Monastery was founded in the memory of Prince Henry the Navigator and for the monks to pray for the king and the seafarers. The Tower (pictured) was built to commemorate the voyage of Vasco da Gama and to protect the port. Both buildings were constructed in the early 16th century in Manueline style. A minor boundary modification of the site took place in 2008.\n|-\n! scope=\"row\"| Monastery of Batalha\n|\n| Batalha\n| 1983\n| 264; i, ii (cultural)\n| The Dominican Monastery of Batalha was built in the early 15th century to commemorate the Portuguese victory over the Castilians at the Battle of Aljubarrota in 1385. The monastery is a masterpiece of Gothic architecture, with later additions in the Manueline style. For more than two centuries, it served as an important workshop for the Portuguese monarchy, as a site where the characteristic features of national art were determined.\n|-\n! scope=\"row\"| Convent of Christ in Tomar\n|\n| Tomar\n| 1983\n| 265; i, vi (cultural)\n| The convent was founded in the 12th century as a Templar stronghold. When the order was dissolved in the 14th century, the Portuguese branch was turned into the Knights of the Order of Christ that later supported Portugal's maritime discoveries of the 15th century. Built over the span of several centuries, the convent features elements of Romanesque, Gothic, Manueline, Renaissance, Mannerist, and Baroque architecture.\n|-\n! scope=\"row\"| Historic Centre of Évora\n|\n| Évora\n| 1986\n| 361; ii, iv (cultural)\n| The city of Évora is the finest example of a city of the golden age of Portugal (as Lisbon was largely destroyed in the 1755 earthquake). The city is home to monuments from different periods, including the Roman Temple (pictured), Moorish fortifications, and churches and palaces built after the 15th century when Évora became the residence of Portuguese monarchs. A typical feature of the city are the whitewashed houses from the 16th to the 18th century. They are decorated with painted tiles (the azulejos) and wrought-iron balconies. The monuments of Évora have inspired the  Portuguese colonial architecture in Brazil.\n|-\n! scope=\"row\"| Monastery of Alcobaça\n|\n| Alcobaça\n| 1989\n| 505; i, iv (cultural)\n| The Cistercian monastery was founded in the 12th century and became a cultural, religious, and political regional centre. The church and the monastic buildings were built in the 13th century in Gothic style, while the facade was renovated in the 18th century in the Baroque style. The kitchen also dates to the 18th century. The church houses the twin tombs of king Pedro I and Inês de Castro, from 1360, which are fine examples of Gothic funerary sculptures.\n|-\n! scope=\"row\"| Cultural Landscape of Sintra\n|\n| Sintra\n| 1995\n| 723; ii, iv, v (cultural)\n| The cultural landscape is located in the Sintra Mountains. In the 19th century, the area became a centre of Romantic architecture. Prominent landmarks include the Pena Palace, a ruined monastery turned into a castle in an eclectic combination of styles, Sintra National Palace (pictured), Quinta da Regaleira, Monserrate Palace, and the Castle of the Moors. Parks adjacent to the palaces are home to several exotic plant species.\n|-\n! scope=\"row\"|  Historic Centre of Oporto, Luiz I Bridge and Monastery of Serra do Pilar\n|\n| Porto\n| 1996\n| 755; iv (cultural)\n| The city of Oporto, or Porto, lies at the mouth of the Douro river. Originally a Phoenician trade settlement, the city has been continuously inhabited since the Roman times. The monuments in the city date to different periods: the Cathedral was built in Romanesque, the Church of Santa Clara in Manueline, and the Stock Exchange Palace in Neoclassical style.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\" | Prehistoric Rock Art Sites in the Côa Valley and Siega Verde\n|\n| Douro region\n| 1998\n| 866bis; i, iii (cultural)\n| This property comprises two sites with open-air rock carvings. The Portuguese site, listed in 1998, is located in the Côa Valley. The Siega Verde site in Spain was added as an extension in 2010. The carvings, representing especially animals (over 5000 figures), were made over the course of several millennia, from the Upper Paleolithic to the Magdalenian/Epipalaeolithic (22,000 to 8,000 BCE).\n|-\n! scope=\"row\"|  Laurisilva of Madeira\n|\n| Madeira\n| 1999\n| 934; ix, x (natural)\n| The laurel forests of Madeira represent a relic of a forest type that covered large parts of Southern Europe 40 to 15 million years ago. The forest consists mainly of evergreen trees and bushes, with flat, dark green leaves. The ecosystem, which is mainly primary forest, is home to many plant and animal species, several of them endemic.\n|-\n! scope=\"row\"| Historic Centre of Guimarães and Couros Zone\n|\n| Guimarães\n| 2001\n| 1031bis; ii, iii, iv (cultural)\n| As the home of the dukes who declared independence in the 12th century, Guimarães is an important town in the history of Portugal. It served as the first capital of the country. The development of the medieval town took place around the castle and the monastic complex. Between the late 15th and 17th centuries, noble houses and civic buildings were constructed in the historic centre that has been well preserved. Specialized building techniques developed in Guimarães in the Middle Ages were transmitted to Portuguese colonies in Africa and in the Americas. The Couros Zone with tanneries was added in 2023.\n|-\n! scope=\"row\"| Alto Douro Wine Region\n|\n| Trás-os-Montes e Alto Douro Province\n| 2001\n| 1046; ii, iv, v (cultural)\n| The valley of the Douro river and its main tributaries is a cultural landscape where wine has been produced for about two millennia. The landscape has been shaped by human activities, with terraced vineyards, quintas (wine-producing farm estates), roads, and chapels. Since the mid-18th century, the best-known product of the region has been Port wine.\n|-\n! scope=\"row\"| Landscape of the Pico Island Vineyard Culture\n|\n| Pico Island\n| 2004\n| 1117rev; iii, v (cultural)\n| Wine production on Pico Island began in the 15th century. In order to protect the farms and vineyards from wind and seawater, farmers built a network of long stone walls across the island. Buildings related to viticulture include the early 19th century manor houses, wine cellars, ports, and churches. Wine production in the island reached its peak in the 19th century and then declined. In the 21st century, it continues on a smaller scale.\n|-\n! scope=\"row\"| Garrison Border Town of Elvas and its Fortifications\n|\n| Elvas\n| 2012\n| 1367bis; iv (cultural)\n| The city of Elvas is located close to the border with Spain. Portugal regained independence from Spain in 1640 and a complex bulwarked dry-ditch fortification system (a star fort) was built around the city. It was designed by the Dutch Jesuit priest padre Cosmander in line with the latest Dutch defensive trends. The site also includes the Nossa Senhora da Graça Fort from the 18th century and Amoreira Aqueduct from the 16th century. A minor boundary modification of the site took place in 2013.\n|-\n! scope=\"row\"| University of Coimbra – Alta and Sofia\n|\n| Coimbra\n| 2013\n| 1387bis; ii, iv, vi (cultural)\n| The University of Coimbra was founded at the end of the 13th century on the hill overlooking the town (Alta). In 1537, it moved to the Royal Palace of Alcáçova and later developed a series of colleges. It served as a template for universities in the Lusophone world. The city of Coimbra is strongly intertwined with the university. Some of the key buildings include the 12th-century Old Cathedral, the Baroque Joanine Library, Chapel of São Miguel, and colleges along the Sofia street in the city. A minor boundary modification of the site took place in 2019.\n|-\n! scope=\"row\"| Royal Building of Mafra – Palace, Basilica, Convent, Cerco Garden and Hunting Park (Tapada)\n|\n| Mafra\n| 2019\n| 1573; iv (cultural)\n| The palace complex in Mafra was commissioned in the early 18th century by King João V. The complex includes a basilica, king's and queen's palaces, a monastery, and a library. It was built in the Italian Baroque style, in particular inspired by the architecture of Rome. The site also includes the Cerco Garden, adjacent to the palace, and the royal hunting grounds.\n|-\n! scope=\"row\"| Sanctuary of Bom Jesus do Monte in Braga\n|\n| Braga\n| 2019\n| 1590; iv (cultural)\n| The sanctuary is located on the slopes of Mount Espinho above Braga, and is an example of a sacred mount pilgrimage site. The main buildings were built in the Baroque style, the most emblematic being the Stairway of the Five Senses (pictured).\n|-\n|}\nTentative list\nIn addition to sites inscribed on the World Heritage list, member states can maintain a list of tentative sites that they may consider for nomination. Nominations for the World Heritage list are only accepted if the site was previously listed on the tentative list. Portugal has 11 sites on its tentative list.\n{|class=\"wikitable sortable plainrowheaders\"\n|-\n! style=\"width:100px;\" scope=\"col\"| Site\n! class=\"unsortable\"  style=\"width:150px;\" scope=\"col\"| Image\n! style=\"width:80px;\" scope=\"col\"| Location\n! style=\"width:50px;\" scope=\"col\" | Year listed\n! style=\"width:60px;\" scope=\"col\"| UNESCO criteria\n! scope=\"col\" class=\"unsortable\" | Description\n|-\n! scope=\"row\" |  Mértola\n|\n| Beja District\n| 2017\n| ii, iii, vi (cultural)\n| The town of Mértola is located on the banks of the Guadiana river which has served as a communication channel since the pre-Roman times. A baptistery from the Palaeochristian period has been preserved. During the Islamic period, the town played an important economic role in the commerce of agricultural and mineral goods between the Alentejo and other parts of Al-Andalus (Muslim Hispania) and Northern Africa.\n|-\n! scope=\"row\" | Vila Viçosa, Renaissance ducal town\n|\n| Évora District\n| 2017\n| ii, iv (cultural)\n| In the 15th century, Vila Viçosa became the base of the Dukes of Braganza, who transformed it according to the ideals of the Renaissance urban planning. Two open squares were constructed, one along the Ducal Palace. Fortifications and bastions were added in the 17th century. The town's plan served as a template for settlements in Portuguese colonies.\n|-\n! scope=\"row\" | Selvagens Islands\n|\n| North Atlantic Ocean\n| 2017\n| vii, viii, ix, x (natural)\n| This group of uninhabited volcanic islands and islets is located between Madeira and the Canary Islands. They are the smallest and the oldest (27 million years old) archipelago of Macaronesia. Bridging the gap between the two bigger archipelagos, they are an important habitat for marine species, as well as nesting ground for several species of seabirds.\n|-\n! scope=\"row\" | Bulwarked Fortifications of the \"Raia\" (Border)\n|\n| Elvas, Marvão, Valença, Almeida\n| 2017\n| iv, vi (cultural)\n| This nomination comprises four sites along the Portuguese-Spanish border, a border that has remained relatively unchanged for over 700 years. The Garrison Border Town of Elvas and its Fortifications is already a World Heritage Site. The other three sites are the Castle of Marvão (pictured), the Castle Fortress of Almeida, and the fortress in Valença. The key fortifications date to the 17th and 18th centuries.\n|-\n! scope=\"row\" | Águas Livres Aqueduct\n|\n| Lisbon\n| 2017\n| i, ii, iv (cultural)\n| The aqueduct, commissioned by King John V, was built between 1731 and 1799. The whole system stretches for  from Sintra area to Lisbon. At the time of construction, it contained the world's largest pointed arch with a height of  and a width of , it was also the last classical aqueduct to be built anywhere in the world. It survived the 1755 Lisbon earthquake.\n|-\n! scope=\"row\" | Ensemble of Álvaro Siza's Architecture Works in Portugal\n|\n| several sites\n| 2017\n| i, ii, iv (cultural)\n| This site comprises the works of the prominent Portuguese architect Álvaro Siza Vieira, winner of the 1992 Pritzker Architecture Prize, in Portugal. His work spans over 50 years. The buildings he designed with a unique architectural expression cover all architecture areas, including individual houses, public buildings, churches (church in Marco de Canaveses pictured), and sport infrastructure.\n|-\n! scope=\"row\" | Pombaline Lisbon\n|\n| Lisbon\n| 2017\n| i, ii, iv, vi (cultural)\n| This nomination comprises Baixa, the historic downtown of Lisbon. Following the devastating 1755 Lisbon earthquake, the area was rebuilt under the Prime Minister Marquis of Pombal. The design of Baixa followed the ideals of the Enlightenment, with rectangular street plan, wide roads, and public spaces. The Pombaline Baixa is one of the first examples of earthquake-resistant construction, with engineering innovations such as the Pombaline cage.\n|-\n! scope=\"row\" | Desert of the Discalced Carmelites and Built Ensemble of the Palace-Hotel in Bussaco\n|\n| Aveiro District\n| 2017\n| ii, iii, iv (cultural)\n| The \"Desert\" refers to a large walled enclosure,  long and  wide, where monks of Discalced Carmelites order were living in a hermitic lifestyle. It was constructed in 1628-30 and was operational until the dissolution of the monasteries in Portugal in 1834. The enclosure contains an arboretum with one of the finest collection of exotic tree species in Europe. The Palace-Hotel (pictured) was completed in 1920 in the Neo-Manueline style.\n|-\n! scope=\"row\" | Head Office and Garden of the Calouste Gulbenkian Foundation\n|\n| Lisbon\n| 2017\n| i, ii, iv, vi (cultural)\n| This nomination covers the complex of the Calouste Gulbenkian Foundation, founded by a businessman and philanthropist Calouste Gulbenkian. The complex contains a museum, a park, an auditorium, and administrative headquarters of the foundation, and is an example of modernist architecture balancing both interior and exterior designs. Construction of the complex began in the 1950s and was overseen by architects Alberto Pessoa, Pedro Cid, and Rui Jervis Atouguia. Landscape architects were António Viana Barreto and Gonçalo Ribeiro Telles.\n|-\n! scope=\"row\" | levadas of Madeira Island\n|\n| Madeira\n| 2017\n| i, iii, iv, v (cultural)\n| Levadas are a system of about 800 km of aqueducts and waterways constructed over centuries on the island of Madeira. People started building them in the 15th century, when Madeira was first settled. Initially, they were used to supply fresh water from the mountains and for irrigation, later also for hydroelectric plants. Levadas were first built in basalt rock masonry, later also in concrete. The channels are narrow to limit the losses due to evaporation.\n|-\n! scope=\"row\" style=\"background:#D0E7FF;\"| Mid-Atlantic Ridge\n|\n| Azores\n| 2017\n| vii, viii, ix, x (natural)\n| This is a transnational nomination that covers the sites in the Mid-Atlantic Ridge. In Portugal, sites include volcanic features in the Azores, including Mount Pico (pictured), Capelinhos, and Algar do Carvão, as well as seamounts and deep-sea hydrothermal fields in the surrounding ocean. These sites are important habitats for terrestrial and marine species. As most of the ridge is submerged, systematic mapping only began in the 1960s.\n|-\n|}\nSee also\n* List of Intangible Cultural Heritage elements in Portugal\n* Tourism in Portugal\nReferences\nExternal links\n*\n* [https://www.unescoportugal.mne.pt/pt/ Comissão Nacional da UNESCO – Portugal] [\"UNESCO National Commission – Portugal\"]"
    }
  ]
}