{
  "content": [
    {
      "type": "text",
      "text": "# List of Warriors characters\n\nThe Warriors novel series is written by Erin Hunter. Due to the large number of characters present in the novel series, this list is divided by Clan.\nCharacters listed under a specific arc may still play a significant role in other arcs.\nOverview\nNaming conventions\nIn the Warriors universe, the characters in the five Clans (ThunderClan, RiverClan, WindClan, ShadowClan, and SkyClan) have names composed of two parts. Each cat's name has a prefix (Blue, Bramble, Tall, etc.) which generally stays constant throughout their life. The name's suffix varies through the character's lifespan and position within the Clan, with the bestowing of the new name being a component of the ceremonies marking these role changes. As a kitten, the character's name ends with \"-kit\" (Bluekit, Bramblekit, Tallkit, etc.). Upon becoming an apprentice (a warrior or medicine cat in training), \"-paw\" replaces \"-kit\" at the end of the character's name (Bluepaw, Bramblepaw, Tallpaw). When the character completes their apprenticeship and is promoted to a full warrior or medicine cat, the suffix to their name is then changed to one chosen by the Clan leader or medicine cat (Bluefur, Brambleclaw, Talltail). If a cat becomes a Clan leader, they are granted the suffix \"-star\" at the end of their name (Bluestar, Bramblestar, Tallstar). If a leader commits a crime, they may be deemed unworthy of their name, stripped of the \"-star\" suffix, and return to using their warrior name. A cat may also have their name changed in a special ceremony.\nThis naming convention does not hold for non-Clan characters. For example, in The Tribe of Rushing Water, a cat's name is said to be the first memorable thing their mother sees after giving birth (such as \"Brook Where Small Fish Swim\" or \"Night of No Stars\"). They are often referred to by only the first word of their name (such as \"Brook\" or \"Night\"). These names remain unchanged throughout a Tribe cat's life, with one exception: if a Tribe cat becomes Teller of the Pointed Stones (a position akin to a Clan leader and medicine cat combined), their name becomes Teller of the Pointed Stones, or Stoneteller.\nCats who do not identify under any group may have entirely different names.\nSpiritual beliefs\nWhen Clan cats die, their spirits go to a place called StarClan if they were good cats in life. If the cats were not good in their life, their spirits are sent to the Dark Forest (also known as The Place of No Stars), a hellish type of purgatory. Cats may also try to communicate with StarClan through a chunk of quartz deep in a mountain off the Clans' forest territory called the Moonstone, or a secluded pool of water called the Moonpool.\nThunderClan\nThunderClan is one of the five warrior Clans. ThunderClan was the home of the original protagonist of the Warriors series and has remained a pivotal group to date.\nThe Prophecies Begin\nThe Prophecies Begin covers events in the story from Into the Wild to The Darkest Hour. It details house cat Rusty's journey from apprentice to leader of ThunderClan.\nBluestar\nLeader of ThunderClan before Firestar. She drowns in A Dangerous Path in the process of luring a pack of dogs away from ThunderClan.\nCinderpelt\nThunderClan's medicine cat after Yellowfang. She originally trained as a warrior under Firestar, but an accident left her back leg permanently broken, forcing her to become a medicine cat instead. She is killed protecting the pregnant Sorreltail during a badger attack on the ThunderClan camp in Twilight, then is reincarnated as one of Sorreltail's kits, Cinderheart. Cinderpelt's spirit ultimately leaves Cinderheart to join StarClan in The Last Hope.\nFirestar\nFirestar is the main protagonist of The Prophecies Begin. Born a house cat named Rusty, he is invited to join ThunderClan after venturing into their forest territory. He trains under the mentorship of Bluestar and rises in rank in the Clan to eventually become Clan leader. While a warrior, he exposes former ThunderClan warrior Tigerstar's treachery. Early on in his leadership, he goes on a journey to rebuild SkyClan. He later mates with Sandstorm and has two kits, Leafpool and Squirrelflight. He dies defeating Tigerstar's Dark Forest spirit in The Last Hope.\nGraystripe\nFirestar's best friend. He mated with Silverstream of RiverClan, with whom he had two kits: Feathertail and Stormfur. He was the deputy of ThunderClan for a time, but after he was captured by humans, his position was revoked. He eventually found his way back to the Clans with his new mate, Millie. He died in A Light in the Mist while fighting against the Dark Forest.\nSandstorm\nWarrior of ThunderClan and Firestar's mate, with whom she had two kits: Leafpool and Squirrelflight.\nSpottedleaf\nMedicine cat of ThunderClan when Firestar first joins ThunderClan. She is murdered early on in the series, but continues to guide Firestar from StarClan. During the Great Battle in The Last Hope, her spirit is killed.\nTigerstar\nThird deputy of ThunderClan under Bluestar's rule. Former ThunderClan warrior and later leader of ShadowClan. He is responsible for bringing BloodClan to the forest, as well as for training cats in the Dark Forest. He had four kits, Brambleclaw, Tawnypelt, Hawkfrost, and Mothwing.\nYellowfang\nThunderClan medicine cat after Spottedleaf. Former ShadowClan medicine cat, and mother of Brokenstar.\nThe New Prophecy\nThe New Prophecy series covers the events from Midnight to Sunset. It details the Clans' attempt to relocate to a new home around a lake after their old home in a forest was destroyed by humans.\nAshfur\nFormer warrior of ThunderClan. Ashfur fell in love with Squirrelflight. He was heartbroken when Squirrelflight chose Bramblestar over him in Sunset. He began plotting destruction against Squirrelflight, and tried to kill her father and her kits. After he died, he used his time in StarClan to plan his takeover of the living Clans. In The Broken Code, he sent fake visions to Shadowsight, medicine cat of ShadowClan, and possessed Bramblestar. He also blocked the connection between StarClan and the living Clans and enslaved the souls of many dead cats, which threatened to destroy the living Clans, StarClan, and the Dark Forest. All three aforementioned groups were forced to fight alongside each other in order to save their existences in A Light in the Mist, and Ashfur's spirit was killed.\nBrambleclaw\nLeader of ThunderClan after Firestar. Son of Tigerstar. He journeys with a group of cats from each Clan to the ocean, where they learn of their forest home's imminent destruction. With this group, he then leads the Clans to their new territories. He mated with Squirrelflight, with whom he had two kits: Sparkpelt and Alderheart. His body was possessed by Ashfur, and for a time his spirit was cast out from his body, trapped in the Dark Forest. He eventually defeated Ashfur and took his body back. In A Starless Clan, he steps down as leader.\nLeafpool\nMedicine cat of ThunderClan after Cinderpelt and mother to Hollyleaf, Jayfeather, and Lionblaze. Daughter of Firestar.\nSquirrelstar\nBrambleclaw's mate and leader of ThunderClan. She served as his deputy before he stepped down. She is the mother of Alderheart and Sparkpelt, and the daughter of Firestar. Leafpool is her sister.\nPower of Three\nThe Power of Three series covers events in the story from The Sight to Sunrise. It details the coming-of-age of three ThunderClan warriors, two of whom were born with special powers.\nHollyleaf\nWarrior of ThunderClan. Sister of Jayfeather and Lionblaze.\nJayfeather\nThunderClan's medicine cat after Leafpool. He is blind and can enter the dreams of other cats. He also has the ability to sense others' feelings and thoughts.\nLionblaze\nWarrior of ThunderClan. He was granted the ability to never be wounded.\nOmen of the Stars\nThe Omen of the Stars series covers events in the story from The Fourth Apprentice to The Last Hope. It details the Clans fighting against the spirits of vengeful Dark Forest cats in a battle called the Great Battle.\nDovewing\nWarrior of ThunderClan who was given the ability to hear far beyond what a normal cat could. She later left ThunderClan to live in ShadowClan with her mate, Tigerstar. Mother of Shadowsight, Lightleap, and Pouncestep.\nIvypool\nWarrior of ThunderClan who served as a spy in the Dark Forest. Sister to Dovewing. Mother of Bristlefrost.\nMapleshade\nAncient spirit she-cat who haunts the dreams of other cats. She resides in the Dark Forest.\nA Vision of Shadows\nThe A Vision of Shadows series covers events in the story from ''The Apprentice's Quest to The Raging Storm. It details the Clans trying to settle the lost Clan, SkyClan, around the lake, while also dealing with a group of dangerous stray cats.\nAlderheart\nMedicine cat of ThunderClan after Jayfeather.\nTwigbranch\nWarrior of ThunderClan, former warrior of SkyClan. Sister of Violetshine.\nThe Broken Code\nThe Broken Code series covers events in the story from Lost Stars to A Light in the Mist. It details the Clans trying to defeat Ashfur and his group of zombified spirit cats.\nBristlefrost\nWarrior of ThunderClan. Played a major role in defeating Ashfur. Ultimately gave her life to defeat Ashfur, in such a way that her spirit was also killed.\nA Starless Clan\nThe A Starless Clan series covers events in the story from River to Star. It details the struggles that come with the Clans trying to rewrite the warrior code.\nNightheart\nWarrior of ThunderClan and protagonist of the eighth arc. He is restless and uncomfortable with being related to Firestar, feeling pressured to live up to the great leader.\nChanging Skies\nThe Changing Skies series covers events in the story from The Elders’ Quest'' to an unpublished book. It details the Clans’ struggles with Twolegs and a mysterious prophecy.\nMoonpaw\nApprentice of ThunderClan and protagonist of the ninth arc.\nRiverClan\nRiverClan is one of the five warrior Clans, and the home of one of the eighth arc's protagonists.\n''Crookedstar's Promise\nCrookedstar's Promise details the life of RiverClan leader Crookedstar.\nCrookedstar\nLeader of RiverClan before Leopardstar. As a kit, he was cursed by Dark Forest warrior Mapleshade to watch all his loved ones die around him.\nThe Prophecies Begin\nLeopardstar\nLeader of RiverClan after Crookedstar.\nMistystar\nDaughter of Bluestar and Oakheart, leader of RiverClan after Leopardstar. Dies in River.\nSilverstream\nRiverClan warrior. Daughter of Crookedstar and mate of Graystripe. She died while giving birth to her kits, Feathertail and Stormfur.\nThe New Prophecy\nFeathertail\nFeathertail is a former warrior of RiverClan who saves the Tribe of Rushing Water from a mountain lion called Sharptooth in Moonrise''. However, she dies in the process, and chooses to stay in the Tribe's version of StarClan, The Tribe of Endless Hunting.\nHawkfrost\nFormer warrior of RiverClan and half-brother of Brambleclaw through Tigerstar. He tried to kill Firestar so that Bramblestar could become leader, but Brambleclaw killed Hawkfrost to save Firestar before Hawkfrost could enact his plan. In the Dark Forest, he trained Ivypool, and his spirit was eventually killed by Brambleclaw once more.\nMothwing\nMedicine cat of RiverClan after Mudfur. She didn't believe in StarClan for a very long time. Later, she admits that StarClan exists, but she still questions the idea of being guided by spirits.\nA Starless Clan\nFrostdawn\nMedicine cat of RiverClan and protagonist of the eighth arc. Previously trained as a warrior.\nSplashtail\nFalse leader of RiverClan. Went to the Dark Forest.\nIcestar\nCurrent leader of RiverClan. Trained in the Dark Forest.\nWindClan\nWindClan is one of the five warrior Clans.\n''Tallstar's Revenge\nTallstar's Revenge details the life of Tallstar, former leader of WindClan.\nTallstar\nTallstar is the leader of WindClan when Firestar first joins ThunderClan. He ultimately died of old age, which triggered a leadership struggle between his former deputy Mudclaw, and Onewhisker, whom he named as his new deputy prior to his death.\nThe Prophecies Begin\nOnestar\nLeader of WindClan after Tallstar. His son was Darktail, and he ultimately died fighting him.\nThe New Prophecy\nCrowfeather\nDeputy of WindClan under Harestar. He was the chosen WindClan cat for the journey to find the lake territories. He mated with Leafpool, with whom he had Hollyleaf, Lionblaze, and Jayfeather. He also mated with Nightcloud, with whom he had Breezepelt.\nMudclaw\nWarrior of WindClan. Led a rebellion against Onestar.\nPower of Three\nBreezepelt\nBreezepelt is the son of Crowfeather and Nightcloud. It is revealed in Long Shadows'' that he is also half-brother to Hollyleaf, Jayfeather, and Lionblaze, whose parents are Crowfeather and ThunderClan medicine cat Leafpool. He trained in the Dark Forest for a while, angry about his father's rejection of him, before eventually reconciling with him in ''Crowfeather's Trial.\nNightcloud\nNightcloud is the mother of Breezepelt and former mate of Crowfeather. She and Crowfeather separate following the revelation in Sunrise that Crowfeather also fathered Hollyleaf, Jayfeather, and Lionblaze with ThunderClan medicine cat Leafpool. They argue with each other for a while, before eventually reconciling in Crowfeather's Trial''.\nShadowClan\nShadowClan is one of the five warrior Clans. It was originally the home of most of the series' antagonists, but starting in Omen of the Stars, ShadowClan protagonists were introduced as well.\nThe Prophecies Begin\nBlackstar\nDeputy of ShadowClan under Brokenstar and Tigerstar, and later leader. He served as a bruiser for both aforementioned leaders, before eventually being redeemed.\nBrokenstar\nLeader of ShadowClan when Firestar comes to the forest in The Prophecies Begin. He killed kits by sending them into battle before they were strong enough to defend themselves. His soul was sent to the Dark Forest when he died, and it was eventually killed by Yellowfang, his mother.\nNightstar\nLeader of ShadowClan after Brokenstar. He was an elder but stepped up to lead the Clan when Brokenstar was banished. He did not receive nine lives because Brokenstar was still alive. He had a permanent respiratory disease. He led the Clan through a sickness induced by rats. He eventually died and was succeeded by Tigerstar.\nThe New Prophecy\nTawnypelt\nFormer apprentice of ThunderClan, joined ShadowClan when Tigerstar became their leader. She mated with Rowanclaw and had three kits: Tigerstar, Flametail, and Dawnpelt.\nPower of Three\nFlametail\nFlametail is a former medicine cat of ShadowClan, who drowned after falling through ice on a frozen lake.\nRowanclaw\nLeader of ShadowClan after Blackstar. He stepped down and took on his warrior name again after he failed to respond to Darktail's group correctly.\nTigerstar\nLeader of ShadowClan after Rowanclaw. He was named after former ShadowClan leader Tigerstar. His mate is Dovewing, and their children are Shadowsight, Lightleap, and Pouncestep.\nOmen of the Stars\nSnowtuft\nWarrior of ShadowClan long before the events of The Prophecies Begin. Resided in the Dark Forest, and attempted to redeem himself while working with Shadowsight and Rootspring during The Broken Code. He eventually died for their cause.\nA Vision of Shadows\nNeedletail\nFormer apprentice of ShadowClan. She joined Darktail's group for a time before she eventually gave her life to save Violetshine.\nThe Broken Code\nShadowsight\nMedicine cat of ShadowClan after Puddleshine. Played a major role in defeating Ashfur.\nA Starless Clan\nSunbeam\nWarrior of ShadowClan and protagonist of the eighth arc. She later moved to ThunderClan.\nBerryheart\nWarrior of ShadowClan, later RiverClan deputy. Splashtail’s accomplice and Sunbeam’s mother.\nSkyClan\nSkyClan is one of the five warrior Clans. Due to the Clan losing its territory from human deforestation, it was chased from the original forest by the other Clans, who were not willing to share territory with them. They tried to make a new home in a gorge far away, but were attacked by rats, and the Clan disbanded. In Firestar’s Quest, Firestar was sent to the gorge by StarClan to start the Clan anew. During A Vision of Shadows, SkyClan returns to the lake to take a place among the other four Clans once more.\nModern SkyClan\n''Firestar's Quest\nFirestar's Quest'' details Firestar's journey to rebuild SkyClan.\nEchosong\nFirst medicine cat of modern SkyClan.\nLeafstar\nFirst leader of modern SkyClan.\nSkywatcher\nFormer elder of SkyClan and descendant of ancient SkyClan. Delivered an important prophecy to Firestar before dying.\n''SkyClan's Destiny\nSkyClan's Destiny'' details the struggles of SkyClan leader Leafstar after Firestar leaves.\nHawkwing\nSecond deputy of modern SkyClan. With Pebbleshine, he fathers Twigbranch and Violetshine.\nPebbleshine\nHawkwing's mate and mother of Twigbranch and Violetshine. She was captured by humans and died shortly after giving birth to her kits.\nA Vision of Shadows\nTree\nSkyClan mediator, formerly of the Sisters. Mates with Violetshine, with whom he has Rootspring. He can talk to ghosts.\nVioletshine\nSkyClan warrior, daughter of Hawkwing and Pebbleshine. Lived in ShadowClan and Darktail's group for a time.\nThe Broken Code\nRootspring\nPlayed a major part in defeating Ashfur. Like his father, Tree, he can talk to ghosts. He fell in love with Bristlefrost.\nChanging Skies\nStarlingpaw\nSkyClan apprentice and protagonist of the ninth arc.\nAncient SkyClan\nMembers of SkyClan while or after it was driven from the forest.\nCloudstar\nLeader of SkyClan when it was driven from the forest.\nBloodClan\nBloodClan is a group of cats who live in a human town.\nThe Rise of Scourge\nThe Rise of Scourge details the coming-of-age of BloodClan leader Scourge.\nBone\nScourge's bruiser and second-in-command.\nScourge\nFormerly named Tiny. After being attacked by Tigerstar as a kit, Scourge grew to resent the Clans, and came to lead the cats of a human town as a dictator. He eventually kills Tigerstar. He was killed by Firestar.\n''Graystripe's Vow\nGraystripe's Vow tells two different stories: the story of Graystripe as a young warrior, leading the Clan against BloodClan while Firestar is away, and the story of Graystripe as an elder, trying to find the Moonstone and make contact with StarClan.\nFury\nLeader of BloodClan after Snake and Ice.\nGremlin\nMade a deal with Graystripe of ThunderClan in order to protect herself and her unborn kits from being killed in battle.\nThe Tribe of Rushing Water\nThe Tribe of Rushing Water is a group of cats who live in a mountain range. They are split into two groups: prey-hunters, who hunt prey, and cave-guards, who protect the prey-hunters and the cave the Tribe lives in. They are led by a cat who takes on the name Stoneteller.\nThe New Prophecy''\nBrook Where Small Fish Swim\nAlso known as Brook. Prey-hunter of the Tribe, Stormfur's mate.\nCrag Where Eagles Nest\nAlso known as Crag, Stoneteller, and Teller of the Pointed Stones. Former cave-guard, becomes Stoneteller in Sign of the Moon.\nStormfur\nSon of Graystripe and Silverstream. Brother of Feathertail and former RiverClan warrior. Mate to Brook Where Small Fish Swim.\nTeller of the Pointed Stones\nAlso known as Stoneteller. Leader of the Tribe until Sign of the Moon.\nAncient cats\nThe Ancient cats lived around the lake long before the Clans or the Tribes were formed.\nDawn of the Clans\nThe Dawn of the Clans series covers events in the story from The Sun Trail to Path of Stars. It details how the Clans came to be.\nClear Sky\nFirst leader of SkyClan, later Skystar. Father to Thunder.\nGray Wing\nMajorly influenced the creation of the modern Clans. Known as \"Graywing the Wise\" to modern Clan cats.\nHalf Moon\nAlso known as Stoneteller and Teller of the Pointed Stones. First leader of what would become the Tribe of Rushing Water. Was in love with Jay's Wing.\nMoth Flight\nFirst medicine cat, member of WindClan. Daughter of Wind Runner.\nOne Eye\nCat who caused trouble for the Clans.\nSlash\nAlso caused trouble for the Clans.\nTall Shadow\nFirst leader of ShadowClan, later Shadowstar.\nThunder\nFirst leader of ThunderClan, later Thunderstar. Son of Clear Sky.\nRiver Ripple\nFirst leader of RiverClan, later Riverstar.\nWind Runner\nFirst leader of WindClan, later Windstar.\nThe Sisters\nThe Sisters are a group of nomadic she-cats who roam from place to place. They have strong connections to the Earth and the spirit world. They do not allow toms to stay in their group beyond kithood.\n''Squirrelflight's Hope\nSquirrelflight's Hope details the story of ThunderClan deputy Squirrelflight struggling with her lack of a legacy.\nMoonlight\nLeader of the Sisters before Snow. She died protecting her kits.\nThe Broken Code\nSnow\nLeader of the Sisters.\nCharacters not in other groups\nTallstar's Revenge\nJake\nFriend of Tallstar. Father of Firestar and Scourge.\nThe Prophecies Begin''\nBarley\nLives on a farm with Ravenpaw, former member of BloodClan.\nPrincess\nA house cat, Firestar's sister.\nRavenpaw\nFormer ThunderClan apprentice, was mentored by Tigerstar, left ThunderClan to avoid being murdered by Tigerstar for seeing Tigerstar murder Redtail. Lived on a farm with Barley.\nSmudge\nHouse cat who was friends with Firestar, prior to the latter joining ThunderClan.\nThe New Prophecy\nMidnight\nBadger who has existed since the dawn of time. She informs the journeying protagonists of The New Prophecy of their forest home's imminent destruction and instructs them on how to help the Clans find a new home. Unlike other badgers in the series who cannot communicate with the cats, Midnight can speak with cats, as well as badgers, rabbits, and foxes.\nSasha\nFormer mate of Tigerstar, mother of Mothwing and Hawkfrost.\nSharptooth\nMountain lion who lived in the mountains and terrorized the Tribe of Rushing Water. It was killed by Feathertail.\nPower of Three\nRock\nHairless and blind cat who has existed since the dawn of time, and guided the Clans' destinies.\nSol\nFormerly a house cat named Harry. After a bad experience with SkyClan when they lived at the gorge, Sol decided to find the lake Clans and try to disband them. He failed to do so.\nA Vision of Shadows\nDarktail\nOnestar's son, leader of a group of cats who attacked the Clans and tried to disband them.\nReferences"
    }
  ]
}