{
  "content": [
    {
      "type": "text",
      "text": "# List of Queen's Counsel in England and Wales appointed in 1952\n\nA '''Queen's Counsel (post-nominal QC), or King's Counsel (post-nominal KC''') during the reign of a king, is an eminent lawyer (usually a barrister or advocate) who is appointed by the monarch to be one of \"Her Majesty's Counsel learned in the law.\" The term is recognised as an honorific. Appointments are made from within the legal profession on the basis of merit rather than a particular level of experience. Members have the privilege of sitting within the bar of court. As members wear silk gowns of a particular design (see court dress), appointment as Queen's Counsel is known informally as taking silk, and hence QCs are often colloquially called silks.\nThe rank emerged in the sixteenth century, but came to prominence over the course of the nineteenth. Appointment was open to barristers only until 1995. The first women KCs had been appointed only in 1949. In 1951, 20 people were appointed, all of them men.\n1952\n22 April 1952\n{| class=\"wikitable\"\n! width=\"20%\" |Name\n! width=\"15%\" |Inns of Court\n! width=\"20%\" |University\n!Notes\n!Ref\n|-\n| height=\"19\" |Edward Johnson Rimmer, AMICE\n|Lincoln's Inn (1912)\n|University of Liverpool\n|Born in 1883, Rimmer went to Bickerton House School before reading engineering at the University of Liverpool; he graduated BEng from Liverpool in 1904 and BSc from the Victoria University of Manchester in the same year. He trained in civil engineering with J. T. Wood before working as the assistant engineer at S. Pearson & Sons at the Port Works in Salina Cruz from 1905 until 1908 or 1909. In 1908, he became an Associate Member of the Institution of Civil Engineers. Between 1909 and 1912, he read for the bar exam under the barrister A. R. Kennedy. After being called to the bar, he practised on the Northern Circuit. He served in the Royal Engineers during the First World War and was then Director of the Federation of Civil Engineering Contractors (1919–24). He became a Bencher of Lincoln's Inn in 1955. He published The Law Relating to the Architect (1952) and edited with I. N. Duncan Wallace the eighth edition of ''Hudson's Law of Building and Engineering Contracts (1959). Rimmer died in 1962, leaving a wife and two children.\n|\n|-\n| height=\"19\" |Phineas Quass, OBE, FRSM\n|Inner Temple (1916)\n|St John's College, Cambridge\n|Quass attended the private University College School and while there completed the BSc at the University of London in 1909. He then went up to Cambridge on a natural science scholarship, graduating with a BA in 1912 before completing a Tripos (Part II) paper in law the next year. He volunteered to serve in the First World War, but was deemed physically unfit for combat service and was eventually employed in the Ministry of Food as a civil servant; he was appointed an OBE in 1920 in recognition of his work there. By then, he was already a barrister and thereafter built up his practice; this eventually extended to Commonwealth countries including Ghana, Nigeria, Ceylon and Australia, where he acted for the defence in several high-profile trials. He was also a constitutional adviser to the government in Uganda. In 1960, he was elected a Bencher of the Inner Temple. He was also treasurer of the Medico-Legal Association, a Fellow of the Royal Society of Medicine and a council member for the Institute for the Study and Treatment of Delinquency. He died in 1961, leaving a widow and two daughters; a son had predeceased him.\n|\n|-\n| height=\"19\" |Frank Gahan\n|Inner Temple (1921)\n|Trinity College, Toronto\nUniversity of London\nTrinity College, Oxford\n|Gahan was born in 1890 into an Ontarian family; he went to Talbot Street School in London, Ontario, before attending Trinity College, Toronto, with a BA in 1914. After initially being medically rejected for service in the First World War in 1914, he became a clerk the Canada Pay and Records Office. In 1916, he enrolled in the 32nd Reserve Battalion and served in the Overseas Military Forces of Canada until demobilisation in 1919. He was awarded an LLB by the University of London in 1919, and then graduated from the University of Oxford with a BCL degree in 1920. He edited ''Mayne's Treatise on Damages (1927) and wrote The Law of Damages'' (1936). Between 1936 and 1945, he was Vice-Principal of the Working Men's College. In 1957, he was appointed Lieutenant Bailiff and Magistrate of Guernsey, serving until retirement in 1964. He died in 1971.\n|\n|-\n| height=\"19\" |Cecil Harry Andrew Bennett, CBE\n|Inner Temple (1922)\n|Pembroke College, Cambridge\nUniversity of Paris\n|Born in 1898, Bennett served as an officer with the Royal Garrison Artillery in the First World War from 1915 to 1919. He graduated from Cambridge with an LLB in 1920, and also completed a Licencié-ès-Droit at the University of Paris. He was appointed Advocate-General to the Anglo-Egyptian Sudanese Government in 1936 and was Attorney-General from 1941 to 1943 before being appointed Chief Justice of Sudan in 1944. He was then made a puisne judge of the Patna High Court in 1946, and then became a legal adviser to the United Kingdom's High Commissioners in India and Pakistan in 1947. He became Legal Counsellor to the British Administration in Eritrea five years later; and then served on the Supreme Restitution Court for Berlin from 1953 to 1962, and as a British Member of the German Arbitral Commission on Property Rights and Interests from 1955 to his death in 1967, only months after he had been appointed a CBE.\n|\n|-\n| height=\"19\" |Nelson Edwin Mustoe\n|Gray's Inn (1922)\n|Trinity College Dublin\n|Mustoe was born in Woodstock, South Africa, in 1896. He was educated at Trinity College Dublin, graduating in 1921 with LLB and BA degrees. Three years after being called to the bar in 1922, he joined the Inland Revenue Solicitor's Department and remained there until 1939, when he set up private practice. He was an expert on tax law and edited the 2nd and 3rd edition of ''Simon's Income Tax (1952–66), the British Tax Encyclopedia (1962, as consulting editor) and the series of Taxation Reports (from 1939).'' He was also author of a number books relating to tax and land law. Outside of his legal work, Mustoe maintained an interest in African affairs; he was chairman of the Britain and South Africa Forum, the South Africa Settlement Association (1954–65) and the Anglo-Ethiopian Society (1956–62). From 1966 to 1970, he was Vice-President of the Royal African Society, but he garnered controversy in 1970 when he defended South Africa's Apartheid regime as \"moral, feasible and reasonable\"; he received criticism from many including authors to the RAS's journal African Affairs. This led to his resignation from his offices at the RSA. For the 1970–71 year he was Master of the Worshipful Company of Glaziers. He died in 1976 and was survived by his second wife, the headmistress and travel writer Anne Mustoe, and three children from his first marriage.\n|\n|-\n| height=\"19\" |Maurice Gravenor Hewins\n|Lincoln's Inn (1923)\n|Christ Church, Oxford\n|Hewins was born in 1897, the only son of the economist and politician William Hewins (to whom he was official private secretary at the Colonial Office in 1918). He attended Westminster School then Oxford, graduating in 1921; after being called in 1923, he practised at the Chancery bar. He died in 1953.\n|\n|-\n| height=\"19\" |John Bussé, CBE\n|Inner Temple (1925)\n|Corpus Christi College, Cambridge\n|Bussé (born 1903) was tutored privately before studying at the University of Cambridge, where he read history and law. Called the bar in 1925, he practised on the Oxford circuit, and was vice-chairman of the Price Regulation Committee from 1945 to 1953 (for which service he was appointed CBE in 1948). He was also Recorder of Burton-on-Trent (1947–56). In 1956, he was appointed Recorder of Gloucester, but became ill on the day that he was sworn in and died shortly afterwards. He was survived by his wife and a son. In his early years at the bar, he had had literary ambitions and published a biography of Elizabeth Montagu (Mrs Montagu: Queen of the Blues) in 1928.\n|\n|-\n| height=\"19\" |Philip Ingress Bell, TD\n|Inner Temple (1925)\n|The Queen's College, Oxford\n|Born in 1900, Bell went to Stonyhurst College before enrolling at the Royal Naval College in Keyham in 1918; he subsequently served as a midshipman until 1920. That year, he went up to Oxford to read law and commerce, graduating with a BA and then a BCL; he was also captain of the university boxing club for the 1922–23 year. After being called to the bar in 1925, he practised in Lancashire's Palatine Bar in Manchester and on the Northern Circuit, a career which was interrupted by the Second World War. Initially serving as an officer in France and Belgium, in 1941 he was posted to the Judge Advocate General's department. He later saw service in Europe again, reaching the rank of Major, and investigated war crimes at Bergen-Belsen concentration camp. With the war over, he returned to his legal practice. He failed to win the seat of Bolton East for the Conservatives at the 1950 general election, but took it at the general election the next year and played a key role in the passage of the Court of Chancery of Lancaster Act 1952. He left Parliament when he was appointed a County Court Judge in 1960 and in 1972 became a Circuit Judge, before retiring in 1975. A devout Roman Catholic, he disliked hearing divorce proceedings and also authored a book, Idols and Idylls (1918). Bell died in 1986, leaving a widow and three children.\n|\n|-\n| height=\"19\" |Harold Infield Willis\n|Middle Temple (1926)\n|New College, Oxford\n|Born in 1902, Willis was the second son of the civil servant Sir Frederick Willis. After attending Berkhamsted School and Oxford, he was called to the bar in 1926 and joined the chambers of Maurice Fitzgerald, KC. He quickly established a leading reputation at the Parliamentary Bar, but his career was interrupted by service in the Second World War with the Royal Air Force Volunteer Reserve. After the war, he resumed his practice, became Leader of the Parliamentary Bar, and was elected a Bencher of the Middle Temple in 1948. The Times stated that he had many of the skills needed to be a judge, but that his practice at the Parliamentary Bar likely prevented his advancement; at the time, the Lord Chancellor did not draw judges from that bar. In 1966, he was appointed deputy chairman of the Hampshire Quarter Sessions, retiring in 1971. He died in 1986, leaving two sons; his wife had died two days before him.\n|\n|-\n| height=\"19\" |Edward Ryder Richardson\n|Middle Temple (1926)\n|University College London\n|The son of a doctor, Ryder Richardson attended Epsom College and University College London before being called to the bar in 1926. He built up a steady practice in London and on the Oxford Circuit. In 1946 was appointed Recorder of Walsall, serving until 1951 when he resigned in a dispute over his precedence as an officer of the Crown. He was appointed Recorder of Stoke-on-Trent in 1954 and was also elected a Bencher of the Middle Temple.  He served as Recorder until his death from leukaemia in London in 1961 at the age of 59. His widow killed herself days later. They were survived by two sons, one of whom, Colin, was a wartime child evacuee who survived the sinking of the SS City of Benares'' by a German U-boat in 1940; Colin's adopted daughter is the interior designer Anna Ryder Richardson.\n|\n|-\n| height=\"19\" |Benjamin Ludlow Bathurst, 2nd Viscount Bledisloe\n|Inner Temple (1927)\n|Magdalen College, Oxford\n|Born in 1899, Bathurst was the son of the politician and colonial governor Charles Bathurst, 1st Viscount Bledisloe. He served in the First World War and then studied natural sciences at Oxford, graduating with a second-class chemistry BA in 1923. He also served in the Second World War, firstly in the RAF with the rank of Squadron Leader, and then in the Air Transport Auxiliary from 1940 to 1945. In 1956, he became a bencher of Lincoln's Inn and two years later he succeeded his father to the viscountcy. He died in 1979; his son Christopher, also a QC, succeeded to the title.\n|\n|-\n| height=\"19\" |Waldo William Porges\n|Lincoln's Inn (1927)\n|Christ Church, Oxford\n|Porges was born in 1899; his American father, Gustave (d. 1940), was a decorated quartermaster who served with the American Expeditionary Force during the First World War. Waldo graduated from Oxford in 1921. He became a bencher of Lincoln's Inn in 1957 and edited ''Temperley's Merchant Shipping Acts (1963). He died in 1976.\n|\n|-\n| height=\"19\" |Sir Francis John Watkin Williams, 8th Baronet\n|Middle Temple (1928)\n|Trinity Hall, Cambridge\n|The son of Colonel Lawrence Williams and a descendant of the 1st Williams baronet (created in 1798), Francis was born into the Welsh gentry in 1905 in Anglesey. After Malvern College, he went up to Cambridge and was called to the bar in 1928. He served in the Second World War in the Judge Advocate General's Department in the RAF, ending the war as a Wing Commander. In 1947, he set up chambers in Hunter Street, Chester, with Gerard Lind-Smith; this proved to be a successful partnership, with Williams taking on defence work. In 1949, he was appointed deputy chairman of the Anglesey Quarter Sessions and became chairman in 1960, serving until 1971. In the meantime, he was also the Recorder of Birkenhead (1950–58) and of Chester (1958–71), as well as deputy chairman of the Cheshire Quarter Sessions from 1952 to 1971, and deputy chairman (1953–61) and then chairman (1961–71) of the Flintshire Quarter Sessions. In 1972, he was appointed a recorder of the Crown Court, retiring in 1974. A devout Christian, he was also Chancellor of the Diocese of St Asaph from 1966 to 1983. In private, Williams enjoyed field sports (running his own shoot) and golf. He died in 1995, leaving a widow (Brenda, daughter of the industrialist and politician Sir John Jarvis, 1st Baronet) and four daughters. In 1971, he had succeeded his brother Reginald to the Williams baronetcy; on Francis's death, his half-brother Lawrence became the 9th baronet.\n|\n|-\n| height=\"19\" |Roy Ernest Borneman\n|Gray's Inn (1929)\n|University College, Reading\nUniversity College London\n|Born in 1904 in London, Borneman was educated at the University College, Reading, and University College London. Called to the bar in 1929, he joined the chambers of Norman Birkett (later Lord Birkett). His legal career was interrupted by service in the RAF's Bomber Command during the Second World War; he rose to the rank of Wing Commander. Returning to the bar on demobilisation, he joined the chambers of Frank Heyworth Talbot, QC, and thereafter work in tax law, establishing a leading reputation in the field. In 1960, he was appointed chairman of the board of referees and Finance Act 1960 Tribunal, serving until 1977. He was elected a bencher of Gray's Inn in 1958 and served as treasurer in 1972. In retirement, he enjoyed travelling widely and learnt to play the cello. He died in 1983; twice married, he had two sons, Ronald and Peter by his first wife and a step son Michael when he married Sarah Culverwell.\n|\n|-\n| height=\"19\" |Hugh Evan Ridley Boileau\n|Middle Temple (1929)\n|Trinity College, Oxford\n|Boileau was born in 1906, the son of a colonel (in 1923, his widowed mother married Sir Drummond Spencer-Smith, 5th Baronet). He read law at Oxford, graduating in 1928. He practised as a barrister on the London and South-Eastern circuits, but his legal career was interrupted by the Second World War; he served in Italy and North Africa, and ended the war as a Major and local Lieutenant-Colonel. On demobilisation, he resumed his practice, and in 1948 was appointed deputy chairman of the Isle of Ely Quarter Sessions. Two years later, he became chairman of the East and West Suffolk Quarter Sessions. He died in office in 1952.\n|\n|-\n| height=\"19\" |Richard Lionel Edwards\n|Inner Temple (1930)\n|Oriel College, Oxford\n|Born in 1907, Edwards graduated from Oxford in 1928 and was called to the bar two years later. He became a bencher of Lincoln's Inn in 1957. Edwards married Eleanor, daughter of the engineer Sir Henry Japp (d. 1939). He died in 1984.\n|\n|-\n| height=\"19\" |Sir George Gillespie Baker, OBE, PC\n|Middle Temple (1932)\n|Brasenose College, Oxford\n|Baker was born in 1910, the son of a Scottish army officer; after attending The Glasgow Academy and Strathallan School, he went up to Oxford. His career at the bar was interrupted by service in the Second World War, firstly with the Queen's Own Royal West Kent Regiment and then with the Cameronians, before he spent periods in the War Office, at the Allied Force Headquarters and then at the Nuremberg trials. With the war in Europe over, he attempted a political career and contested the seat of Southall for the Conservatives at the 1945 general election, but lost to Labour. He returned to his legal practice, focusing on the Oxford Circuit, and became Leader of the circuit in 1954, serving until 1961. He was also Recorder of Bridgnorth (1946–51), of Smethwick (1951–52) and of Wolverhampton (1952–61), and deputy chairman of the Shropshire Quarter Sessions (1954–71). In 1961, he was elevated to the High Court (taking the conventional knighthood at the same time), and was assigned to the Probate, Divorce and Admiralty Division. When the division was abolished in 1971, he became President of the Family Division, its successor. His work on family law cases included two especially notable judgements: (1) that a husband cannot prevent his wife from having an abortion and (2) that an unmarried partner has a right to occupy the matrimonial home. He retired in 1979, but led a 1983 review into Northern Ireland's emergency laws (in which he recommended that trial without juries continue). He also served as Bencher (1961) and Treasurer (1976) of the Middle Temple. He died in 1984, his wife having died the previous year; he was survived by three sons.\n|\n|-\n| height=\"19\" |Richard Marven Hale Everett\n|Gray's Inn (1933)\n|–\n|Everett attended Repton School before being called to the bar in 1933. He established a large practice in personal and industrial injury cases, which was interrupted by service in the Army during the Second World War. Between 1968 and 1971, he was Leader of the South Eastern Circuit. He held judicial office, firstly as Recorder of Deal (1959–68) and then as Recorder of Maidstone (1968–71), before he became a County Court Judge in 1971 and a Circuit Judge the following year. Elected a bencher of Gray's Inn in 1959, he was its treasurer in 1977. He died in 1978, aged 69, leaving a son; his wife had predeceased him weeks earlier.\n|\n|-\n| height=\"19\" |Sir Henry Josceline Phillimore, OBE, PC\n|Middle Temple (1934)\n|Christ Church, Oxford\n|Born in 1910, Phillimore's father Charles Augustus was a partner in Coutts bank and his first cousin once removed was the Lord Justice of Appeal Lord Phillimore, whose father Sir Robert Phillimore was Judge of the High Court of Admiralty. Educated at Eton, he read classics at Oxford before being called to the bar in 1934. He was a pupil in the chambers of Edward Pearce (later Lord Pearce) and then built up a wide practise on the Western Circuit. During the Second World War, he served as an officer in the Army, in Norway in 1940 and later in War Office. He was present at the Yalta Conference in 1944 and the following year was appointed Continental Secretary of the British War Crimes Executive and acted as junior counsel at the Nuremberg trials. In 1946, he returned to his practice and was appointed Recorder of Poole; he then became Recorder of Winchester in 1954 (serving until 1959) and in 1956 became deputy chairman of the Oxfordshire Quarter Sessions (serving as chairman from 1962 to 1968). He oversaw the inquiry into the 1958 Southall air accident. He was appointed a High Court Judge (Probate, Divorce and Admiralty Division) in 1959 and received the customary knighthood; he was also elected a bencher of the Middle Temple. Although he transferred to the Queen's Bench division in 1962, he was one of several people appointed by the Archbishop of Canterbury to make recommendations on divorce law; in 1966, they authored Putting Asunder: A Divorce Law for Contemporary Society, which led to the concept of the \"irretrievable breakdown\" of a marriage becoming grounds for divorce in 1969. From 1967, he was also a member of the Royal Commission on Assizes and Quarter Sessions, whose report led to the Courts Act 1971. In 1968, Phillimore was appointed a Lord Justice of Appeal, serving until he retired in 1973. He died the following year and was survived by his widow and their two daughters.\n|\n|-\n| height=\"19\" |Evan Roderic Bowen\n|Middle Temple (1937)\n|University College of Wales, Aberystwyth\nSt John's College, Cambridge\n|Bowen was born in Cardigan in 1913; his father, Evan, was a businessman and magistrate and his family had long been involved in liberal politics. After private schooling and attending Cardigan County School, he studied at the University College of Wales in Aberystwyth, gaining an LLB in 1933, and at Cambridge, taking a BA in 1935. After being called to the bar in 1937, he practised on the South Wales Circuit and established chambers in Cardiff. In the Second World War, he served as an officer in the Judge Advocate General's Department. On demobilisation, he resumed his legal practice, being Recorder of Carmarthen (1950–53), of Merthyr Tydfil (1953–60), of Swansea (1960–64) and of Cardiff (1964–67). He was also chairman of the Montgomeryshire Quarter Sessions (1959–71) and Leader of the Wales and Chester Circuit. Bowen also pursued a political career; he successfully contested the Cardigan seat for the Liberal Party in the 1945 general election, was the chairman of the Welsh Parliamentary Party from 1955 and was considered a potential party leader in the mid-1950s, but it was not to be. In 1965, he accepted the Labour government's offer of the Deputy Chairmanship of Ways and Means in the House of Commons; as a deputy speaker, he would thereby not vote and this reduced his party's strength without costing the government any more Labour seats (they had a very narrow majority in the chamber). The following year, he was defeated in the general election. He afterwards carried out investigative work for the government into interrogation procedures used in the British colony of Aden; he also chaired the government committee (after 1972) which recommended bilingual road signs in Wales, and served as a National Insurance Commissioner for Wales (1967–86) and as President of St David's College, Lampeter (1977–92). His later years were spent living reclusively; he never married, nor received political honours, and died in 2001.\n|\n|}\nSource: [https://www.thegazette.co.uk/London/issue/39524/page/2239 The London Gazette], 25 April 1952 (no. 39524), p.&nbsp;2239\nReferences\nNotes\nCitations"
    }
  ]
}