{
  "content": [
    {
      "type": "text",
      "text": "# Lithuania–United Kingdom relations__disambig_1\n\nLithuania–United Kingdom relations are foreign relations between Lithuania and the United Kingdom.\n]]\nThe history of Lithuania's relations with the United Kingdom started on 20 December 1921 with de jure recognition of Lithuania's statehood. The UK became a key export partner. When Lithuania lost independence, the UK officially closed Lithuania's embassy in London but allowed the ambassador to act in this capacity. On 27 August 1991, the UK recognised the restored state of independent Lithuania and soon thereafter transferred to the Bank of Lithuania the frozen gold reserves of Lithuania. On 4 September 1991, the two countries resumed their diplomatic relations. In addition to intensive economic, military, social cooperation, Lithuania and the United Kingdom stand in close cooperation in the areas of education, science, and culture. Currently, there are 8 bilateral agreements regulating the relationship between Lithuania and the UK in various fields.\n* The United Kingdom has an embassy in Vilnius and an honorary consulate in Klaipėda.\n* Lithuania has an embassy in London and 5 honorary consulates (in Northern Ireland, Northumberland,Scotland, Wales and the West Midlands).\n* There are around 100,000 Lithuanian people living in the United Kingdom.\n* Both countries are full members of NATO.\n* [https://web.archive.org/web/20081226132122/http://www.fco.gov.uk/en/about-the-fco/country-profiles/europe/lithuania British Foreign and Commonwealth Office about relations with Lithuania]\n* [http://www.urm.lt/index.php?-621782732  Lithuanian Ministry of Foreign affairs: list of bilateral treaties with Poland (in Lithuanian only)]\nHistory\nAlthough most of the trade between England and the Polish–Lithuanian Commonwealth was conducted via Polish port cities, some English merchant ships arrived in the small Lithuanian port town of Palanga in the 17th century.\nLithuania and the UK formally established diplomatic relations on 20 December 1922. During World War II, Lithuania was at various times occupied by the Soviet Union and Nazi Germany. The United Kingdom never recognised de jure the Soviet occupation and annexation of Lithuania in 1940. Lithuania continued diplomatic relations with the UK in exile and later claimed state continuity.\nBritish prisoners of war were among Allied POWs held by the Germans in the Stalag Luft VI POW camp in German-occupied Lithuania.\nThe UK reaffirmed the restoration of Lithuanian independence on 27 August 1991. Both countries re-established the diplomatic missions in October 1991.\nBoth Lithuania and the United Kingdom provided contributions to the NATO mission in Afghanistan.\nEmbassies and consulates\nThe United Kingdom has an embassy in Vilnius and an honorary consulate in Klaipėda.  Lithuania has an embassy in London and five honorary consulates (in Northern Ireland, Northumberland, Scotland, Wales and the West Midlands).\nOverview\nThere are around 100,000 Lithuanian people living in the United Kingdom. Both countries are full members of NATO.\nThe current ambassador to Lithuania is , and the ambassador to the UK is Renatas Norkus.\nIn 2006, the Queen of the United Kingdom Elizabeth II paid a visit to Lithuania.\nSince 2014, Lithuania participates in the British-led Joint Expeditionary Force, a multi-national military partnership.\nGallery\nFile:President of the Republic of Lithuania (7608821386).jpg|British Foreign Secretary William Hague meeting President of Lithuania Dalia Grybauskaitė\nFile:Prime Minister Rishi Sunak attends NATO summit (53039324384).jpg|President of Lithuania Gitanas Nausėda greets British Prime Minister Rishi Sunak during the 2023 Vilnius Summit\nFile:Foreign Secretary David Lammy meets Lithuania's Foreign Minister Kęstutis Budrys (54381039987).jpg|Foreign Secretary David Lammy with Lithuanian Foreign Minister Kęstutis Budrys in London, March 2025.\nFile:Vilnius Britu taryba.jpg|British Embassy in Vilnius\nFile:Embassy of Lithuania in London - 2021.jpg|Embassy of Lithuania, London\nFile:Lithuanian Roman Catholic Church of St. Casimir - geograph.org.uk - 1717292.jpg|St Casimir's Lithuanian Church, a Lithuanian-speaking Roman Catholic church in Bethnal Green, London\nFile:RAF Typhoon Over Lithuania MOD 45157539.jpg|RAF Typhoon patrolling over Lithuania as part of the NATO Baltic Air Policing mission\nResident diplomatic missions\n* Lithuania has an embassy in London.\n* The United Kingdom has an embassy in Vilnius.\nSee also\n* Foreign relations of the United Kingdom\n* Foreign relations of Lithuania\n* Lithuanians in the United Kingdom\nReferences\nExternal links\n* [https://web.archive.org/web/20081226132122/http://www.fco.gov.uk/en/about-the-fco/country-profiles/europe/lithuania British Foreign and Commonwealth Office about relations with Lithuania]\n* [http://ukinlithuania.fco.gov.uk/en   British embassy in Vilnius]\n* [http://uk.mfa.lt/index.php?2139425644  Lithuanian embassy in London]"
    }
  ]
}