{
  "content": [
    {
      "type": "text",
      "text": "# Little Queen (manhwa)\n\nDaiwon C.I.\n| publisher_en    =  Tokyopop\n| publisher_other =\n| demographic     =\n| magazine        =  Issue\n| first           = 2003\n| last            = 2006\n| volumes         = 8\n| chapter_list    =\n| related         =\n| content         =\n| subcat          = Daiwon\n| addpubcat1      = Tokyopop titles\n| ko              = Y\n}}\nLittle Queen is a comedy shōjo manhwa by Kim Yeon-joo. In North America, it is licensed and published by Tokyopop.\nOverview\nJune Narcieq attends Rohini Royal Academy, where all children possessing magical potential are enrolled and trained in their abilities according to the law.  In particular, girls of exceptional abilities like June are trained as candidates for the position of Queen of Light.  June competes with her rival Lucia Luferr, not only for the crown, but also for the attention of June's childhood friend Sejuru Ney.\nCharacters\nMain characters\n;June Narcieq (쥰 나르시크)\n:The hero of the story, she is lazy and unmotivated for the position of Queen until Lucia begins to show interest in Sejuru.  Compared to Lucia, June is unrefined and prone to violence, but her jovial nature and insightfulness continue to surprise people.  Despite her poor grades, June remains the top candidate to become the next Queen of Light, likely because she has come to possess Spenta Minea, the Queen's Rod.\n;Lucia Luferr (루시아 루페르)\n:June's rival for the crown and Sejuru. She was originally ranked first place as a Queen Candidate, but is soon surpassed by June. Lucia has been raised since childhood to become Queen of Light, so she possesses a regal manner and shows little emotion.  She feels lost when June so easily surpasses her and begins to question if she really wants to become the next Queen of Light.\n;Sejuru Ney (세즈루 네이)\n:A demon boy June found in the mountains near her home as a child who began living with the Narcieq family after that.  He is a gentle boy many consider adorable, though June is extremely possessive of him and regards him as a \"pet\" of sorts as much as he is her best friend.  The King of Darkness shows great interest in him.\n;Yuri Schauer (유리 샤우어)\n:A priest of the Church of Light, he is one of the judges of Candidates for Queen. He deeply dislikes June, preferring Lucia's regal bearing as attributes consistent with queen.  Known as the \"Eye of God\" for his ability to see the future, Yuri is greatly disturbed when he sees the lines of two queens from the current candidates and that the next queen will have an extremely short reign.\nSupporting characters\n;Mayanne Senora (메이옌 시뇨라)\n:The captain of the Holy Red Knights, a serious young woman who is a skilled swordfighter who wields two swords.  She and Yuri are old acquaintances; however, she believes that Yuri is wasting his talent by becoming a magistrate instead of a knight.  Mayanne also recognizes Sejuru from a past incident, which is when she first met Yuri.\n;Jibrilte (지브릴테)\n:The current Queen of Light and the 581st holder of the office.  As Queen of Light, she rules for life over all humans and is admired and beloved by her people as a wise and competent ruler.  Jibrilte is also a personal acquaintance of June's grandmother, June's mother (Eilian Sihena), Nanny, and Yuri.\n;Hecate Dirantra\n:June and Sejuru's Nanny, who raised them as though she was their mother.  She was also their teacher in swordplay and gave Sejuru his transparent sword.  Regarded as a legend when she was a knight, Hecate eventually returns to the Palace of Light to become the 536th Captain of the Holy White Knights and Chief Knight to Jibrilte. She is later killed by Sejuru when he was under the influence of the Demon King.\n;Sihena Assinof\n:Known also as Ms. Narcieq, she is June's grandmother and the former Commander of the Royal Magicians.  She lost her daughter, Eilian Sihena, and son-in-law to duty and deliberately spirited June away in order to prevent losing her granddaughter when it was revealed that June would become the next Queen of Light and have the shortest reign in history.\n;Shaocient (샤오시엔트), the Demon King\n:The Demon King, resurrected when June removed Spenta Minea, the Queen's Rod, and effectively unsealed the Demon King from his slumber.  As the King of Darkness, he shows great interest in Sejuru.  Before he was sealed away, he had intended to destroy Rohini Academy.\n;Inocia Pemprot (이노시아, Inoshia), the Queen of Light\n:The previous Queen of Light who sealed away the Demon King four hundred years ago with Spenta Minea.  She had a complex relationship with the Demon King and is responsible for Sejuru's existence.\n;Jimmy\n:One of June's friends, an athletic girl who studies at Rohini Royal Academy to become a magician.  Her twin brother, Mana, is currently studying to be a magistrate.\n;Maya Lynn Kim\n:A friend of June and Jimmy, Maya is a student at Rohini Royal Academy.  An innocent girl who has trouble making friends, she is currently studying to be a herbalist.\n;The Principal of Rohini Royal Academy\n:The Principal of Rohini is responsible for the students at Rohini Academy, as well as issues like finding funding from patrons for the school.  She reluctantly accepts June's behavior since June's enrollment means getting more donations, but is constantly exasperated that the leading Queen Candidate is incredibly unmotivated and crude compared to Lucia and the other candidates.\nReferences\nSee also\n*List of manhwa"
    }
  ]
}