{
  "content": [
    {
      "type": "text",
      "text": "# Little green men (Russo-Ukrainian war)__disambig_1\n\nPolite People}}\nmilitary base in Crimea, 9 March 2014]]\n, 28 February 2014]]\nblockading Perevalne military base, 9 March 2014]]\n]]\nThe \"little green men\" (; ) were Russian soldiers who were masked and wore unmarked uniforms upon the outbreak of the Russo-Ukrainian War in 2014. They were active just before and during the Russian annexation of Crimea and carried regular weapons and equipment, but were always masked and wore distinctly unmarked green military fatigues. Russia, which had been denying any involvement in Ukraine prior to the annexation, used these little green men to give it plausible deniability on the international stage.\nBetween February and March 2014, these unmarked Russian soldiers occupied and blockaded the Simferopol International Airport, most of Ukraine's Crimean military bases, and the Supreme Council of Crimea. The name has also sometimes been used to refer to Russian troops during the War in Donbas; the Kremlin stated that no Russian troops were active in the region, but many little green men were operating in this region while disguised as pro-Russian separatists.\nRussian media referred to them with the euphemism \"polite people\" () due to their well-mannered behaviour, as they kept to themselves and mostly made no effort to interfere with civilian life while also refusing to interact with journalists.\nAfter two months of denial, on 17 April 2014, Russian president Vladimir Putin confirmed that the Russian military had been operating in Ukraine. Furthermore, numerous sources, including Russian state-owned media, have confirmed that the little green men were a mix of operatives from the Special Operations Forces and various other units of the Spetsnaz GRU. It likely also included paratroopers of the 45th Guards Spetsnaz Brigade of the Russian Airborne Forces, as well as mercenaries from the Russian state-funded Wagner Group. While their status as soldiers acting under the orders of the Russian government was continually denied, their nationality was not. Alexander Borodai of the unrecognized Donetsk People's Republic stated that 50,000 Russian citizens had fought in Ukraine's Donbas by August 2015 and argued that they should receive the same benefits as Russia's other war veterans, though he maintained that the Russian government did not send them.\nWeapons and equipment analysis\nIn March 2014, the Finnish magazine Suomen Sotilas (Soldier of Finland) published an analysis of the weapons and equipment seen on photos of \"little green men\".\nThe article points to a number of weapons and pieces of equipment that it asserts are issued only to armed forces in the Russian Federation:\n* New EMR camouflage combat uniforms\n* New 6Sh112 or 6Sh117 tactical vest\n* New , 6B7-1M composite helmet\n* New 7.62&nbsp;mm PKP machine guns\n* 6B26 composite helmets (used only by airborne troops of the Russian Federation)\n* 6Sh92-5 tactical vest (used only by airborne troops of the Russian Federation)\n* Gorka-3 combat uniform (used only by Russian special forces and mountain troops)\n* Smersh AK/VOG tactical vest (used only by Russian special forces)\nThe article goes on to conclude that with a very high probability \"these troops are the 45th Guards Separate Reconnaissance Regiment of the VDV\" based in Kubinka, Moscow.\nOther media have published a photo of an unmarked Russian soldier armed with a VSS Vintorez taken as proof of deployment of Russian special forces.\nOfficial Russian reaction\nInitially, President of Russia Vladimir Putin stated that the men in green were not part of the Russian Armed Forces, but part of a local militia who had seized weapons from the Ukrainian Army. The SACEUR of NATO Allied Command Operations General Philip Breedlove said that these \"green men\" were in fact Russian troops.\nIn March 2014, Putin continued to maintain that there was no pre-planned intervention, but that \"the heavily armed, tightly coordinated groups who took over Crimea's airports and ports at the start of the incursion – they were merely spontaneous 'self-defence groups' who may have acquired their Russian-looking uniforms from local [military] shops (voyentorg)\". According to the Ukrainian Association of Gun Owners, Ukrainian law does not allow the selling or carrying of firearms other than for hunting.\nOn 17 April 2014, President Putin admitted publicly for the first time that Russian special forces were involved in the events of Crimea, for the purposes of protecting local people and creating conditions for a referendum. Later, he admitted that the Russian Armed Forces had blocked the Armed Forces of Ukraine in Crimea during the events.\nIn response to the question of the presence of Russian troops in Crimea, Russian Minister of Defence Sergey Shoigu said, \"Regarding the statements about use of Russian special forces in Ukrainian events, I can only say one thing&nbsp;– it's hard to search for a black cat in a dark room, especially if it's not there,\" and added cryptically that searching for the cat would be \"stupid\" if the cat is \"intelligent, brave, and polite\".\nIn April 2015, retired Russian Admiral  said that the \"little green men\" were members of Russian Spetsnaz special forces units. According to his information, Russian troop deployment in Crimea included six helicopter landings and three landings of Ilyushin Il-76 with 500 troops.\nSee also\n*Russian military deception\n*Military history of the Russian Federation\n*NKVD special groups (1940s–1950s)\n*People's Armed Forces Maritime Militia (PAFMM, a.k.a. 'Little Blue Men') of China\n*Ratnik, 'future soldier' equipment for infantry\n*Wagner Group, private military\n*Hybrid warfare\n*Black knight soldiers in medieval times who covered their insignia\nReferences\nExternal links"
    }
  ]
}