{
  "content": [
    {
      "type": "text",
      "text": "# Little London, Buckinghamshire\n\n|os_grid_reference= SP645123\n|civil_parish= Oakley\n|unitary_england     = Buckinghamshire\n|lieutenancy_england = Buckinghamshire\n|region= South East England\n|country= England\n|constituency_westminster= Mid Buckinghamshire\n|post_town= Aylesbury\n|postcode_district= HP18\n|postcode_area= HP\n|dial_code= 01844\n|website= [http://www.oakleybucks.co.uk/ Oakley Parish Council]\n}}\nLittle London is a hamlet consisting of approximately 70 houses located immediately east of the village of Oakley in Buckinghamshire and about  northwest of the market town of Thame in neighbouring Oxfordshire.\nLittle London Green is the largest area of common land in the parish of Oakley.\nHistory\nThe earliest known records of Little London are from the 16th century. Little London is clearly visible on the New College, Oxford map of Bernwood Forest of 1590. Originally the boundary between Brill and Oakley followed the stream in Oakley, meaning that Oakley parish church, 'the Nap' and 'Little London Green' would have been in Little London.\nLittle London has several 17th-century cottages. A Congregational chapel was built there in 1847.\nIn 1934 Buckinghamshire County Council revised parish council boundaries and made Little London part of Oakley. Until the 1960s the hamlet had its own shop.\nToponymy\nThe Toponymy (naming) of Little London is not clear. Some locals thought it was founded during the Black Death in the 14th century by Londoners fleeing the capital. The fact that the hamlet is one field distant from the rest of Oakley may support this theory.\nLittle London may have been established by Welsh cattle drovers. Cattle drovers established at least 70 communities established in England and Wales, many of which still exist. They were temporary homes for long distance drovers, driving their cattle to the great fairs and markets of London and other centres in England. They were on common land, separated from local communities. The drovers had a licence to travel, granted by Elizabeth I, and were regarded as \"foreigners\" by the local parishioners who could not travel without a \"settlement certificate\". One of the Old English words for \"foreigners\" was utlenden (\"outlanders\"), which could be corrupted to \"Little London\".\nReferences\nSources\n*"
    }
  ]
}