{
  "content": [
    {
      "type": "text",
      "text": "# Little Wars\n\nLittle Wars is a set of rules for playing with toy soldiers, written by English novelist H. G. Wells in 1913. The book, which had a full title of  'Little Wars: a game for boys from twelve years of age to one hundred and fifty and for that more intelligent sort of girl who likes boys' games and books', provided simple rules for miniature wargaming.\nIt is mentioned in one of Wells' other books, Joan and Peter, where, during the Great War, a sensitive young man named Bunny Cuspard tries his best to compare his life in the army as a larger version of the manual.\nContents\nLittle Wars included fairly simple rules for infantry, cavalry, and artillery in the form of a toy 4.7 inch gun that launched projectiles, usually small wooden dowels to knock down enemy soldiers. In addition to its being a war game, the book hints at several philosophical aspects of war.\nThe book is written in a whimsical style and illustrated with drawings and photographs of a game being played that Wells describes in the book. Wells also gives a description of the game from the view of one of the generals in the battle bombastically relating his memoirs.\nDevelopment\ntoy soldiers according to the rules of Little Wars.  Wells is using a piece of string cut to a set length of the distance his soldiers can move.  An umpire sits in a chair with his stopwatch timing Wells.  Wells' opponent waits for his turn to move and fire his cannon at Wells' soldiers.]]\nThe development of the game is explained and Wells's thoughts on war, as he was known to be a pacifist, are revealed in his writing. According to Wells, the idea of the game developed from a visit by his friend Jerome K. Jerome.  After dinner, Jerome began shooting down toy soldiers with a toy cannon and Wells joined in to compete. The two decided that with an addition of written rules, a good Kriegsspiel type game could be developed.  The game revolved around the use of lead hollow cast soldiers made by W. Britain and battlefields made from whatever materials were on hand, usually blocks or other toys. Simple rules of movement, firing, and close combat were developed with a set amount of time for each player to move and fire. Wells also provides a chapter of \"Extensions and Amplifications of Little War\". In an appendix, Wells provides \"Little Wars and Kriegspiel\"; more complex rules to be played in a larger space involving military logistics, military engineers, cavalry charges, and railway transport of troops.\nPublication\nLittle Wars was first published in 1913 by Frank Palmer. Da Capo Press republished Little Wars in its unabridged form in 1977. There have been numerous other reprints and it is now available online at Project Gutenberg, along with a previous game book by Wells called Floor Games (1911). A 2004 edition of the book published by Skirmisher Publishing includes an introduction by game designer Michael O. Varhola and a foreword by Gary Gygax.\nReception\nC. Ben Ostrander reviewed the 1977 unabridged version of Little Wars in The Space Gamer No. 17. Ostrander commented that \"There are many line drawings and photos of the author 'at play'. Although it is of little use to the modern gamer, this book stands as an interesting volume.\"\nReferences\nExternal links\n*\n*\n* [http://www.costik.com/littlewars.html Little Wars & Floor Games] Introduction to the 1995 edition of Wells's gaming books.\n* [http://www.nirya.be/snv/fb/fb1.html Little Wars] at \"Schild en Vriend\"\n*\ncategory:abstract strategy games\nfr:H. G. Wells#L'auteur de jeux"
    }
  ]
}