{
  "content": [
    {
      "type": "text",
      "text": "# Liu Yao (warlord)\n\n| term_end =\n| monarch = Emperor Xian of Han\n| office1 = General Who Inspires Martial Might(振武將軍)\n| term_start1 =\n| term_end1 =\n| monarch1 = Emperor Xian of Han\n| office2 = Inspector of Yang Province (揚州刺史)\n| term_start2 =\n| term_end2 =\n| monarch2 = Emperor Xian of Han\n| birth_date = 157\n| birth_place = Muping District, Yantai, Shandong\n| death_date = 198 (aged 41)\n| death_place = Nanchang, Jiangxi\n| relations = Liu Dai (brother) Liu Chong (uncle)\n| father = Liu Yu\n| children =\n| occupation = Politician, warlord\n| blank1 = Courtesy name\n| data1 = Zhengli (正禮)\n}}\nLiu Yao (157–198), courtesy name Zhengli, was a Chinese politician and warlord who lived during the late Eastern Han dynasty of China. He was a descendant of Liu Fei, the eldest son of the Han dynasty's founding emperor, Liu Bang (Emperor Gao). When he was 18, he became famous after rescuing a relative who was being held hostage by bandits. He started his career in the Han civil service after being nominated as a xiaolian, and was known for his incorruptibility. In 194, although he was appointed by the Han imperial court as the governor of Yang Province, he barely managed to gain a foothold over his jurisdiction because the warlord Yuan Shu controlled a large part of the territories around the Huai River region in Yang Province. In 195, conflict broke out between Liu Yao and Yuan Shu, who sent his ally Sun Ce to attack Liu Yao. Sun Ce defeated Liu Yao and forced him to retreat south into present-day Jiangxi, where Liu Yao defeated a minor warlord Ze Rong and died of illness shortly later. His elder brother was Liu Dai, another prominent warlord.\nFamily background\nLiu Yao was from Muping County (), Donglai Commandery (), which is in present-day Muping District, Yantai, Shandong. He was of noble descent. His ancestor, Liu Xie (), who held the title \"Marquis of Muping\" (), was a son of Liu Jianglü (). Liu Jianglü was a son of Liu Fei, the eldest son of the Han dynasty's founder, Liu Bang (Emperor Gao).\nLiu Yao's grandfather, Liu Ben (), was an eminent Confucian scholar. Liu Yao's father, Liu Yu (), served as the Administrator () of Shanyang Commandery (). Liu Yao's uncle, Liu Chong (), served as the Grand Commandant () in the Han imperial court in 169.\nLiu Yao's elder brother, Liu Dai, was a Palace Attendant and later the Inspector () of Yan Province.\nEarly life and career\nWhen Liu Yao was 18 years old, his relative Liu Wei () was taken hostage by a gang of bandits. Liu Yao managed to rescue Liu Wei and bring him back safely. He became famous for his courageous act.\nShortly after, Liu Yao was nominated as a xiaolian (孝廉; civil service candidate) to join the Han civil service. He was subsequently appointed as a Gentleman () and then the Chief () of Xiayi County (下邑縣; around present-day Dangshan County, Anhui). He resigned later after refusing to misuse his powers by helping influential elites in the commandery.\nLiu Yao was later recalled to serve as an official in Jinan State (). The Chancellor of Jinan was the son of an influential official in the central government. When Liu Yao caught him engaging in corrupt practices, he wrote a memorial to the imperial court to complain, resulting in the chancellor's dismissal.\nTaoqiu Hong (), an official from Pingyuan Commandery (), proposed to the Inspector of Qing Province to nominate Liu Yao as a maocai () for outstanding performance. The Inspector asked, \"We already nominated Gongshan (Liu Dai) last year. Why should we nominate Zhengli (Liu Yao) this year?\" Taoqiu Hong replied, \"If you nominate Gongshan first, and then Zhengli, you'll be doing exactly what people call 'riding two dragons on a long journey' and 'letting two fine steeds run freely'. Why shouldn't you do this?\" Liu Yao then received an offer to serve as an Assistant () to the Minister of Works () and an Imperial Censor (), but he declined.\nGovernorship of Yang Province\nWhen chaos broke out in central and northern China in the 180s and 190s, Liu Yao fled south to the Huainan region (present-day central Anhui). In 194, the imperial court appointed him as the Inspector () of Yang Province. Around the time, the warlord Yuan Shu controlled much of the territories in the Huainan region. Liu Yao feared Yuan Shu and did not dare to assume his appointment because much of his jurisdiction was under Yuan Shu's control. He headed further south, crossed the Yangtze River, and met Wu Jing and Sun Ben in Qu'e County (曲阿縣; present-day Danyang, Jiangsu). They helped him establish a base for his governorship of Yang Province in Qu'e County.\nIn 195, Yuan Shu, who had the intention of usurping the Han throne and declaring himself emperor, ordered his forces to start conquering nearby commanderies and counties. Liu Yao sent his subordinates Fan Neng () and Zhang Ying () to station troops near the riverbank to guard against Yuan Shu's advances. As Wu Jing and Sun Ben previously had served under Yuan Shu, Liu Yao distrusted them and forced them to leave. Yuan Shu appointed himself as the Inspector of Yang Province, and allied with Wu Jing and Sun Ben to attack Liu Yao. Fan Neng and Zhang Ying managed to hold their positions against enemy attacks for several days.\nIn 195, the Han imperial court promoted Liu Yao to Governor () of Yang Province and concurrently appointed him as \"General Who Inspires Martial Might\" (). Liu Yao managed to rally thousands of troops to defend his territories. In the same year, the warlord Sun Ce (allied with Yuan Shu) led his forces across the Yangtze River and defeated Fan Neng and Zhang Ying. Liu Yao fled south to Dantu County (丹徒縣; present-day Dantu District, Zhenjiang, Jiangsu).\nBattle of Yuzhang and death\nAt Dantu County, Liu Yao contemplated moving to Kuaiji Commandery (會稽郡; around present-day Shaoxing, Zhejiang) to take shelter. However, Xu Shao advised him to go to Yuzhang Commandery (豫章郡; around present-day Nanchang, Jiangxi) instead. He explained that Kuaiji Commandery had an abundance of resources so it would come under attack by Sun Ce very soon. Yuzhang Commandery, however, shared borders with Yu Province to the north and Jing Province to the west, so it would be more convenient for them to form alliances with other warlords such as Cao Cao and Liu Biao to counter the threat of Yuan Shu. Liu Yao heeded Xu Shao's suggestion and travelled to Yuzhang Commandery.\nLiu Yao and his forces reached Pengze County (彭澤縣; east of present-day Hukou County, Jiangxi) and garrisoned there. At the time, Zhou Shu (), the previous Administrator of Yuzhang Commandery, had died of illness so his office was vacant. Liu Biao, the Governor of Jing Province, supported Zhuge Xuan to be the new Administrator, but that became a problem because the Han imperial court had appointed Zhu Hao to succeed Zhou Shu. Liu Yao sent a subordinate, Ze Rong, to lead troops to attack Zhuge Xuan and help Zhu Hao. Xu Shao cautioned Liu Yao, \"Ze Rong doesn't care about how others see him. Zhu Wenming (Zhu Hao) is too trusting of people. You should warn him to be wary (of Ze Rong).\" After driving Zhuge Xuan away, as Xu Shao foresaw, Ze Rong killed Zhu Hao and took control of Yuzhang Commandery.\nLiu Yao led his forces to attack Ze Rong but was driven back. He then started recruiting more troops from the surrounding counties and eventually defeated Ze Rong, who fled into the hills and was killed by the Shanyue tribes. Liu Yao died of illness in 198 at the age of 42 (by East Asian age reckoning).\nPost-mortem events\nIn 199, when Sun Ce was on his way to attack Jiangxia Commandery (), he passed by Yuzhang Commandery, where he collected Liu Yao's remains, arranged a proper memorial service for Liu Yao, and treated Liu Yao's family kindly.\nWang Lang wrote to Sun Ce, explaining how Liu Yao and Sun Ce's family used to get along well before the conflict broke out between him and Yuan Shu – the conflict turned Liu Yao and Sun Ce against each other because the latter was Yuan Shu's ally at the time. He told Sun Ce that Liu Yao died in regret because he wanted, but never had a chance to, reestablish friendly ties with Sun Ce after settling down in Yuzhang Commandery. He also praised Sun Ce for his kind gesture in arranging a proper funeral for Liu Yao and advised Sun Ce to treat Liu Yao's eldest son well.\nDescendants\nLiu Yao's eldest son, Liu Ji (), came to serve under Sun Quan, Sun Ce's younger brother and the founding emperor of the state of Eastern Wu in the Three Kingdoms period. Sun Quan highly respected and favoured Liu Ji. After he became emperor, Sun Quan appointed Liu Ji as Minister of the Household (). One of Sun Quan's sons, Sun Ba (), married Liu Ji's daughter.\nLiu Yao had two other sons, Liu Shuo () and Liu Shang (), who both served as Cavalry Commandants () under Sun Quan.\nIn Romance of the Three Kingdoms\nLiu Yao is a minor character in the 14th-century historical novel Romance of the Three Kingdoms, which romanticises the events in the late Eastern Han dynasty and Three Kingdoms period. He appears in Chapter 15 and is depicted as an incompetent warlord in the Jiangdong region. He forms an alliance with two other Jiangdong warlords, Wang Lang and Yan Baihu, to counter an invasion by the warlord Sun Ce. Taishi Ci, a warrior under Liu Yao, was captured by Sun Ce, who treated him respectfully and managed to convince him to defect. Sun Ce ultimately defeated Liu Yao in battle, took over his territories, and forced him to flee to Yuzhang Commandery.\nSee also\n* Lists of people of the Three Kingdoms\nNotes\nReferences\nCitations\nBibliography\n* Chen Shou (3rd century). Records of the Three Kingdoms (Sanguozhi).\n*\n* Luo Guanzhong (14th century). Romance of the Three Kingdoms (Sanguo Yanyi).\n* Pei Songzhi (5th century). Annotated Records of the Three Kingdoms (Sanguozhi zhu).\n* Sima Guang (1084). Zizhi Tongjian."
    }
  ]
}