{
  "content": [
    {
      "type": "text",
      "text": "# Liu Yong (Song dynasty)__disambig_1\n\nLiu Yong () (approximately 984–1053), was a Chinese poet during the Northern Song Dynasty. His original name was Liu Sanbian (Chinese: 柳三变), courtesy name Jingzhuang (Chinese: 景庄); he later changed his name to Liu Yong, courtesy name Qiqing (Chinese: 耆卿). He was born in Chong'an (崇安), Fujian, but his ancestral home was in present-day Yongji, Shanxi.\nLiu Yong was ambitious to make achievements and contribute to serving the country from an early age. He had received an education for imperial examination, which laid the foundation for his poetry writing. However, he failed four times and his career as an officer was middling. He spent many leisure days with Gējì to have fun, which influenced his writing style and images in his poems.\nLiu Yong was the first poet who reformed Song Ci (宋词) poetry in a comprehensive way. The trend of long-form Song Ci poetry originated from him. Moreover, he has made great efforts in creating the poetry genre \"Slow poetry\" or \"Slow song form\" (Chinese: 慢词), and made full use of vulgar words and common sayings. The genre combined mundane images with graceful descriptions. The use of incisive narrations, plain images and other artistic expressions by Liu Yong has made a profound impact on Song Ci poetry in later ages. Liu Yong was also a representative of the subtle and concise style (婉约派) in classical Chinese literature.\nLife\nEarly years\nSince there is no credible source explicitly recording Liu Yong's date of birth, scholars speculated that Liu Yong was born approximately in the 980s (between 984–987). At that time, Liu Yong's father Liu Yi was an imperial court officer managing a town named \"Feixian\".\nSince he was born into an official family, Liu Yong received a high-quality education when he was young. In 990, Liu Yong moved to Quanzhou while his father was transferred there.\nLiu Yong showed his talent in Chinese literature from an early age. When Liu Yong was ten years old, he wrote his first article \"exhorting (the importance of) learning\" (劝学文).  And later in 998, Liu Yong wrote his first relatively well-known poem, \"Writing Zhongfeng Temple\" (题中峰寺). Then, he gave the first trial on Song Ci poetry in 1001. The poetry was named \"Clouds on Wu Mountain, Hiking in Caves\" (巫山一段云·六六真游洞). It extolled the beauty of the landscape in Wuyi Mountain, which was located near his hometown.\nStaying at Hangzhou and Suzhou\nIn the fifth year of the Reign of Emperor Xianping (1002), Liu Yong left his hometown planning to take the examination hosted by the Ministry of Rites (礼部) in the capital city Dongjing (now Kaifeng). However, while on the way to Dongjing, he greatly enjoyed the life in flourishing cities like Hangzhou and Suzhou, so he decided to provisionally stay. He immersed himself in viewing the beauty of nature there, and indulged in romantic relationships with courtesans. In order to make a living in Hangzhou, Liu Yong wrote lyrics for Jiaofang songs. With his great musical and literary talents, his lyrics was extremely popular among the public. However, his lyrics with vulgar words and romantic themes were not accepted by other poets, scholars, or the upper class. They judged and criticized Liu Yong and his inverse actions to Chinese conceptions of etiquette (Confucian culture), which also brought a negative impact on his later career.\nIn 1003, Liu Yong wrote a poem named \"Viewing Sea Tides\" (望海潮·东南形胜) as a greeting letter to Sun He, a competent and well-known officer in Song Dynasty. The poetry's popularity swept the region rapidly after its release. Since then, Liu Yong's talent in literacy had become more widely known by people. Between the years 1004 and 1007, Liu Yong wrote three poems in terms of recalling the memories he had while living in Suzhou and Hangzhou.\nFailing the imperial examination\nIn 1008, Liu Yong went to the capital city, Bianjing (Dongjing), for the imperial examination in Spring, 1009. Though Liu Yong was confident in his talent and ability for positioning in a high rank and successfully becoming an imperial court officer. However, the result turned out that he failed his first trial. To express his depression and discontent, he wrote one of his most famous poems \"Crane Into the Sky\" (鹤冲天·黄金榜上). But still holding hope for the next trial, Liu Yong wrote the poem \"Like fish in water\" (如鱼水·帝里疏散) after a period of time.\nIn 1015, Liu Yong took the imperial examination for the second time but failed again to achieve the Jinshi degree. Jinshi was the honor for those who passed the final imperial examination. He became more frustrated and dejected for his failures in both love and career. \"Soldiers' Music” (征部乐·雅欢幽会) was written down at this time.\nIn 1018, he failed again by being rejected by the emperor. Officers with an indiscreet private life were criticized in ancient China. Liu Yong's actions of writing lyrics about qinglou and his frequent contact with Gejis had damaged his reputation, inducing his failure in examinations several times.\nIn 1024, after his fourth failure, Liu Yong left the capital in annoyance. Facing the departure with his lover, he wrote another poem later made famous, \"Yu Lin Ling\" (雨霖铃·寒蝉凄切).\nAway from the Capital\nAfter Liu Yong left the capital Bianjing, he went to southern China. Along his way to the south, he restarted his business in writing lyrics for songs, and the popularity of his lyrics and poetry rose as time went on. During this time, Liu Yong moved from place to place, writing several poems to express his sentiments on the fast-passing years and nostalgia for the young adult period.\nIn 1029, Liu Yong came back to Bianjing, but left again feeling grieved that things were still flourishing in the Capital, but people changed.\nIn 1034, the imperial examination loosened its standards with Emperor Renzong's governance. Liu Yong returned to the capital from Ezhou to take the imperial examination again.\nCareer as an officer\nIn 1034, Liu Yong, who was about 40, finally achieved the Jinshi degree and began his career as an officer. In February, Liu Yong went from Bianjing to Muzhou on assignment from the Song imperial court. However, the suggestion from Liu Yong's higher-ups to promote him was turned down. The reason given was \"no positive achievement yet\", meaning the reputation accumulated in earlier years was further affecting Liu Yong's career even though his talent and ability were approved.\nLiu Yong successively served as officers in multiple positions afterward. In 1037, he was promoted to the position of Yuhang county magistrate. He did well in managing the region and was loved by the people. In 1039, Liu Yong was appointed as the officer at the \"Hsiao-feng Salt Monopoly (晓峰盐场)\" in Zhejiang province. Touched by the tough lives of the salt workers there, he wrote the poem \"Song of Boiling Sea-water\", which made a huge impact on society and earned him positivity as a \"renowned officer (名宦)\" by the people.\nIn 1050, Liu Yong served as \"Assistant Director of Military Colonies\" (屯田员外郎), which was the highest official position of his career.\nWorks\nTune patterns\nAt least 127 kinds of tune patterns were used in Liu Yong's Ci, which were far more than other Ci poets at his stage. And even his works in the same tune patterns were not the same in format. They might not strictly follow the prescribed tune pattern and are slightly different in word counts and line divisions. What's more, Liu Yong invented some tune patterns and adventurously tried a lot of obscure tune patterns, which demonstrated his flexibility in creation.\nThemes\nRomantic themes\nThe first most popular theme among early scholar-poets was \"boudoir feelings.\" These themes, however, are frequently conveyed in a more ornate and dramatic way, thus separating sensuality from reality. Liu Yong's lyrics are unique in its genuineness and directness.  Liu Yong's works are unique in their genuineness and directness. In the works designed for courtesan performances, he tended to use highly vernacular expressions that truly and straightforwardly expressed a man's frailties. His living experiences in the Qinglous(青楼) and his romantic relationships with courtesans not only helped him understand the lives and feelings of the women from the lower class, but also kept him up to date on the latest romantic Song Ci poetry.\nThe Siku Quanshu (Chinese: 四库全书 Synopsis of the Four Imperial Libraries) thus comments, \"The Ci was originally a kind of seductive music, and Liu Yong's work was charming and intimately emotional, allowing people easy access to it, so though it is quite flawed by its vulgarity, there has been no end of people who have delighted in it.\" The following work \"Feng ch'i wu 凤栖梧\" is one of his representative romantic  Song Ci poetry.\nTo the tune \"Phoenix in the Phoenix Tree\"\nSource:\n(Feng ch'i wu 凤栖梧)\nFor long I stand at the window in the gentle breeze Staring into infinity at spring melancholy Somberly growing on the horizon. In the fading light, mist-shimmer on the grass Who can understand why I lean, wordless, on the balustrade?\n伫倚危楼风细细，望极春愁，黯黯生天际。草色烟光残照里，无言谁会凭阑意。\nI am determined to be reckless, plan a drunk. Here is wine, here is song. But in forced mirth is no flavor. It doesn't matter after all that my girdle grows looser She is worth being haggard for.\n拟把疏狂图一醉⑺，对酒当歌，强乐还无味。衣带渐宽终不悔，为伊消得人憔悴。\nFeelings about his life\nAnother common topic in Liu Yong's work was about his feelings in life, including his self-pity about his career and the agony of his loneliness. The following lyric \"Ho ch'ung t'ien 鹤冲天\" expressed his resentment after failing the imperial examination and the spurning of merit and flame.\nTo the tune \"Crane in the Sky\"\nSource:\n(Ho ch'ung t'ien 鹤冲天)\nOn the golden announcement board, My name failed to head the list. Neglected in an enlightened age Where is a good man to turn? If you fail to get ahead Why not let yourself go and have some fun? No need to weigh loss and gain The songwriter of genius Is an unofficial minister of state.\n黄金榜上，偶失龙头望。明代暂遗贤，如何向。未遂风云便，争不恣游狂荡。何须论得丧？才子词人，自是白衣卿相。\nThe misty flowers in the lanes are, as on a painted screen. Happily someone there I know Worth paying a visit, To embrace red and green; In romantic affairs Finding a lifetime's pleasure. Verdant spring is gone in a moment And I am ready to exchange An ephemeral name for a cup of wine and a soft song.\n烟花巷陌，依约丹青屏障。幸有意中人，堪寻访。且恁偎红倚翠，风流事，平生畅。青春都一饷⒂。忍把浮名，换了浅斟低唱。\nReflect the ordinary people's suffering\nHe cared about the hardships of working people's lives and sympathized with their sufferings. For example, the following poem \"Song of Boiling Seawater (Chinese：煮海歌）,\" is a heptasyllabic poem written during his service as an officier at the \"Hsiao-feng Salt Monopoly （Chinese：晓峰盐场）.\"  This poem criticizes repressive rulers and laments the misery of salt workers.\nSong of Boiling Sea-Water\nSource:\nWhat do they live on, the people who boil sea water,\nThe women with no silk to weave, the men no plows?\nHow fragile the source of their livelihood!\nWhen you finish boiling it in the cauldron, you pay it for taxes.\nSpring and summer, year after year, the tide covers the shore,\nWhen the tide recedes they scrape the sand into islands.\nDried by wind, baked by the sun, it grows more salt,\nWashed with sea water, it makes a stream of brine;\nAs the brine thickens, they continuously sample the taste.\nThey go deep into endless hills to collect firewood\nRegardless of panther tracks, tiger trails.\nThey depart with the sunrise and return at sunset;\nCarried on the back or by boat, with no rest ever,\nThe wood they throw into the great furnace, blazing hot,\nBurning by day, flaming through the night, until heaped up high\nAt last, is the snow they have made from the ocean's waves,\nFrom pools of brine to flying flakes of frost.\nFor food to eat they had no choice but to borrow.\nNow, weighed in at the official station, it brings a paltry price,\nAnd every borrowed string of cash must be repaid with ten.\nAround and around it goes and never stops\nGovernment taxes still unpaid, the private rents now due.\nThey drive their wives, push their sons to work their share;\nTheir form is human, but their complexion is vegetable.\nHow bitter is life for the people who boil the water of the sea!\nHow can they make their parents rich, their sons not poor?\nUnder this dynasty not a creature loses its place;\nI wish the royal kindness might spread to the shores of the sea,\nWash weapons and armor clean, put a stop to taxes in kind\nSo that our ruler may have a surplus and end the tax on salt.\nIn time of peace if the ministers will stick to salt!\nWe will be back to the happy days of Hsia, Shang, and Chou.\nInfluence\nLiuyong had a seminal influence on the development of Ci (Song Ci poetry).  Due to his rich life experiences with disillusionment in his career and living among ordinary people, his ci has diverse contents and themes. So, he successfully expands the connotation context and aesthetic interest of Ci. Since his lyrics contain a lot of colloquial expressions that are easy to understand, his lyrics have extensive circulation among general people, which can be proved by a well-known proverb \"where there is well water [where people reside], there are Liu's songs.\" Liu Yong was not only one of the most popular Ci poet in Song dynasty, but also a significant milestone in Ci genre. He carried forward Slow Ci (Slow Poetry), making them not only more varied in format but also richer in content. His innovative use of vivid colloquialisms in Ci has made Ci more accessible to the public.\nReferences\nExternal links\n*"
    }
  ]
}