{
  "content": [
    {
      "type": "text",
      "text": "# Lloyd J. Schwartz\n\n|birth_place = Los Angeles, California, U.S.\n|death_date  =\n|death_place =\n|occupation  = Television producer, screenwriter\n|yearsactive = 1969–present\n|spouse      =\n|children    = 2\n|parents     =\n|website     =\n}}\nLloyd Jeffry Schwartz (born May 2, 1946) is an American television producer and writer.\nCareer\nSchwartz is the son of TV mogul Sherwood Schwartz and his wife Mildred (née Seidman). Lloyd worked alongside his father since the late 1960s. They teamed up on many Brady Bunch projects, often as writer or producer.\nHe also has written for television series including Alice, The A-Team, and Baywatch. In 1988, he helped create The Munsters Today, a revival of The Munsters.\nIn 1985, Schwartz co-founded The Storybook Theatre of Los Angeles with his wife, Barbara Mallory. Storybook Theatre has been honored by both the United States Senate and the House of Representatives.\nOn June 6, 2008, a stage musical debuted in Los Angeles called A Very Brady Musical. The show was written by Schwartz and his sister Hope Juber. The music was written by his sister and brother-in-law, Hope and Laurence Juber. Schwartz directed the production, which starred his wife, Barbara Mallory and his son Elliot Schwartz as Carol and Greg Brady. A Very Brady Musical swept the Valley Theatre League Awards as best production, best musical, best director for Lloyd, best writing for Lloyd and his sister, Hope Juber, among other awards.\nWorks\nWriter\n*\"BBBRRRRrrrrrr!--That New Abominable Snowman Comedy\" (pilot, 1976)\n*''Gilligan's Island (musical, 1992)\nProducer\n*Big John, Little John (1976) (co-produced with father Sherwood Schwartz)\n*The Invisible Woman (1983) (co-produced with father Sherwood Schwartz)\n*Little Red Riding Hood (1987)\n*A Very Brady Sequel (movie, 1996) (co-produced with father Sherwood Schwartz)\nOther facts\n* Appeared in The Brady Bunch episode \"The Cincinnati Kids\".\n* In 2010, Lloyd and his father wrote a book about The Brady Bunch, entitled Brady, Brady, Brady''.\nReferences\nExternal links\n*\n*"
    }
  ]
}