{
  "content": [
    {
      "type": "text",
      "text": "# LockPickingLawyer__disambig_1\n\n| youtube_handle        = LockPickingLawyer\n| youtube_display_name  =\n| youtube_years_active  =\n| youtube_genre         = Lockpicking\n| youtube_subscribers   = 4.5 million\n| youtube_views         = 1.1 billion\n| stats_update        = October 16, 2024\n}}\nLockPickingLawyer is an American YouTuber known for picking various locks on camera, and reviewing their effectiveness while pointing out security flaws. As of January 2025, the channel has over 4.5 million subscribers.\nHe works with lock manufacturers to improve the security of their devices. He also sells the tools he uses through his own company, Covert Instruments.\nYouTube\nThe LockPickingLawyer YouTube channel was started in 2015. In 2018, the channel attracted attention after posting a video of a bicycle lock being cut open in two seconds. Other videos include picking a car lock, though it is noted that the methods used are not capable of starting the car. The channel also accepts challenges sent in by viewers.\nManufacturers have responded to his videos in the past. In October 2022, LockPickingLawyer released a video reviewing the security effectiveness of the Level Lock+, a smart lock with Apple Home Key support that was exclusively sold through the Apple Store for $329. He was able to break through the lock using \"low-skill attacks\", causing Level to issue a statement defending its \"BHMA AAA rating\" and claiming that \"lock picking accounts for only 4% of home break incidents\".\nIn 2021, fellow YouTuber Stuff Made Here designed two unpickable custom locks, and sent them to LockPickingLawyer as a challenge. In a response video, LockPickingLawyer picked the first lock in exactly 60 seconds, and the second lock in 52 seconds using pliers and a mallet.\nOn October 19, 2021, he was a keynote speaker at the security conference SAINTCON 2021, where he lambasted locksmiths' complacency and reliance on security through obscurity.\nPersonal life\nLockPickingLawyer remains anonymous, though he has revealed that for 15 years he was a business litigator based in the Washington, D.C., metropolitan area. He has since retired from practicing law to focus on his YouTube channel.\nReferences"
    }
  ]
}