{
  "content": [
    {
      "type": "text",
      "text": "# Lokapala (king)\n\nŚrī Mahārāja Rakai Kayuwangi Dyah Lokapāla Śrī Sajjanotsavatuṅga was the seventh monarch of the Mataram kingdom of Central Java period (commonly referred to as Mataram kingdom) who ruled between 855 and 885. His birthname was Lokapāla, as indicated by the title dyah or pu that precedes it. He was also commonly referred to by his appanage title Rakai Kayuwangi, which means 'Lord of Kayuwangi'. King Lokapāla was described as a valiant king who defeated his enemies.\nName and Titles\nHis name at birth was Lokapāla (according several inscriptions, such as Shivagrha, Argapura and Wanua Tengah III). In the Mantyasih inscription dated to 907, he is named as Rakai Kayuwangi, while the Wanua Tengah III inscription gives both his birthname Lokapāla and his title Kayuwangi.\nThe name Lokapāla is probably linked to the Lokapala, the Hindu guardian gods of directions. The appellation Rakai Kayuwangi is a title, not a personal name; during his reign as king of Java, Lokapāla was the Rakai (ancient Javanese title equivalent to a lord or duke) of Kayuwangi district. His regnal title Śrī Sajjanotsavatuṅga (Sanskrit meaning 'glorious, the highest in joy and virtue') appears in only a few inscriptions, such as the Ramwi inscription.\nReign\nThe Wanua Tengah III inscription states that Lokapāla mounted the throne on 8 June 855. According to the Shivagrha inscription issued by King Lokapāla on 12 November 856, he inaugurated a grand Shiva temple which is identified by historians as the Prambanan temple compound. According to this inscription, the temple was built to honor Lord Shiva, and its original name was Shiva-grha (the House of Shiva).\nAccording to the Sejarah Nasional Indonesia interpretation of the Shivagrha inscription, Lokapāla was chosen as the successor of his father, namely Sang Jatiningrat, which was the title Rakai Pikatan had assumed after he abdicated and retreated as a brahmin. Lokapāla was the successor of king Salaḍū Rakai Pikatan, believed by some from his queen consort Pramodawardhani. The eldest child of Pikatan and Pramodhawardhani was Rakai Gurunwangi Dyah Saladu. However, despite being the eldest, Gurunwangi was not selected as Pikatan's successor. It was Lokapala, the youngest son, that was promoted as the royal successor, because of his heroic merits in defeating his father's enemies, who made a stronghold on the hill of Ratu Boko. However, the family relationships between Lokapāla and Salaḍū are not explicitly stated in any inscription, so this interpretation must remain hypothetical.\nKing Lokapāla reigned for about 30 years, during which time he issued many inscriptions on stone and metal. The historian Wisseman Christie has argued that Lokapāla's period one was of initial expansion of the Mataram kingdom into East Java, and increased agrarian productivity coupled with a decline in overseas trade. He was assiduous in granting privileges to a wide range of religious institutions, often in collaboration with other aristocrats. During Lokapāla's reign, there appears to have been some resistance to his centralising power; for example, the Wuatan Tija inscription 'records the attempted kidnap of one of Kayuwangi's wives, rakryan Mānak ('the mother of a child') - along with her son dyah Bhūmijaya – by her younger brother rakryan Laṇḍayan'. He was succeeded by king Tagwas in 17 February 885.\nReferences"
    }
  ]
}