{
  "content": [
    {
      "type": "text",
      "text": "# London Tradition\n\n| founder          = Mamun ChowdhuryRob Huson\n| defunct          =\n| location_city    = HomertonLondon, United Kingdom\n| locations        =\n| area_served      =\n| key_people       =\n| products         = Clothing\n| brands           =\n| production       =\n| services         =\n| revenue          =\n| operating_income =\n| net_income       =\n| aum              =\n| assets           =\n| equity           =\n| owner            = Mamun ChowdhuryRob Huson\n| members          =\n| num_employees    = 100\n| parent           =\n| divisions        =\n| subsid           =\n| website          =\n| footnotes        =\n| bodystyle        =\n}}\nLondon Tradition Ltd is a clothing designer and manufacturer, specialising in traditional British duffle coats, pea coats and trench coats. The company was founded in January 2001 by Mamun Chowdhury and Rob Huson, is based in London, England, and has around 100 employees.\nHistory\nIn January 2001, Mamun Chowdhury and Rob Huson set up London Tradition. The company operates from a factory and design studio in Hackney Wick near the Olympic park, designing and manufacturing luxury duffle coats for export.\nThe company designs clothing that is manufactured in the UK.\nExport\nThe company now exports 30,000 to 35,000 coats a year, 90% of its output is outside of the UK, it exports to 12 markets, including the Asia Pacific region, Europe, Japan, Germany, Italy, France, Austria, Netherlands and Spain. It has seen overseas sales rise by 865% between 2007 and 2013.\nRecognition\nLondon Tradition was twice awarded a Queen's Awards for Enterprise for International Trade in recognition of its business performance: once in July 2014 and again in April 2020. The citation of the 2014 award noted the company's success in having \"taken British outerwear - including the humble duffle coat - and transformed them into a luxury heritage brand for an international market.\"\nSee also\n* Splash About International\n* Business of British Bangladeshis\nReferences\nExternal links\n*\n*[https://www.cnsuit.com/ Men's Wool Suit]\n*[https://plussizeqtpie.com/ Plus Size Clothing]"
    }
  ]
}