{
  "content": [
    {
      "type": "text",
      "text": "# Long Pocket, Queensland\n\n| pop                 = 150\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4850\n| area                = 43.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 24.1\n| dir1                = NW\n| location1           = Ingham\n| dist2               = 135\n| dir2                = NW\n| location2           = Townsville\n| dist3               = 260\n| dir3                = S\n| location3           = Cairns\n| dist4               = 1482\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = Shire of Hinchinbrook\n| stategov            = Hinchinbrook\n| fedgov              = Kennedy\n| near-n              = Abergowrie\n| near-ne             = Abergowrie\n| near-e              = Dalrymple Creek\n| near-se             = Lannercost\n| near-s              = Lannercost\n| near-sw             = Lannercost\n| near-w              = Garrawalt\n| near-nw             = Abergowrie\n}}\nLong Pocket is a rural locality in the Shire of Hinchinbrook, Queensland, Australia. In the , Long Pocket had a population of 150 people.\nHistory\nLong Pocket State School opened on 26 July 1915. A new school building was erected in 1924. It closed on 14 February 1994. It was at 2062 Abergowrie Road (), now in neighbouring Lannercost.\nDemographics\nIn the , Long Pocket had a population of 198 people, 49% female and 51% male. The median age of the population was 38 years, on par with the national median. 88.4% of people living in Long Pocket were born in Australia. The other top responses for country of birth were New Zealand 1.6% and Italy 1.6%. 93.3% of people spoke only English at home; there were no other responses for language spoken at home.\nIn the , Long Pocket had a population of 150 people, 51% female and 49% male. The median age of the population was 47 years, 9 years above the national median of 38. 86% of people living in Long Pocket were born in Australia. The other top responses for country of birth were New Zealand 2.0% and Italy 2.0%. 94.7% of people spoke only English at home; the next most common language was Italian at 2%.\nEducation\nThere are no schools in Long Pocket. The nearest government primary school is Trebonne State School in neighbouring Trebonne to the south-east. The nearest government secondary school is Ingham State High School in Ingham to the south-east.\nCommunity groups\nThe Abergowrie-Long Pocket branch of the Queensland Country Women's Association meets at 2346 Abergowrie Road ().\nReferences"
    }
  ]
}