{
  "content": [
    {
      "type": "text",
      "text": "# Longstocking\n\nLongstocking were an American, Los Angeles–based queercore-punk band.\nFormed in 1995 by songwriter, vocalist and guitarist Tamala Poljak, the group originally began as a guitar and drums duo with Poljak and drummer, Kevin Hair. Tamala had previously been a part of the experimental music scene in Los Angeles playing in the bands Oiler and Fleabag until they began writing pop/punk songs on the side. In 1996 Longstocking became a four-piece band featuring David Gomez (bass), Sherri Solinger (drums) and Woody Stevenson (guitar) and signed to Donna Dresch's Chainsaw Records. The band released several singles, including a split single with Team Dresch on Sub Pop and another on K records before disbanding in 1997, just after the release of their debut album, Once Upon A Time Called Now.\nPoljak relocated to Olympia, Washington in 1996 and played in a number of bands including a short stint as bassist in Team Dresch and as a member of a collaborative project called KaraNEEDoke, which resulted in a set of double 7\" singles released on the Kill Rock Stars label with participants Nomy Lamm, Slim Moon, Audrey Marrs, Donna Dresch, Tracy Sawyer, formerly of Heavens to Betsy, and Tamala, with music by The Need. After moving back to Los Angeles, Poljak formed their next band The Automaticans, who released a split single with Team Dresch on Metal Monkey Records and in 2001 Poljak joined with Jody Bleyle of Team Dresch and Whitney Skillcorn of The Little Deaths Scotty Walsh to form Infinite Xs. The band released one record on Chainsaw Records. Tamala has collaborated with Los Angeles punk-rock legends, Exene Cervenka and Phranc. They currently front a band called Naps, based in Los Angeles, California and collaborate with vocalist Anna Oxygen in their band Day/Moon.\nIn 2021 Portland's Jealous Butcher Records reissued Longstocking's debut album, Once Upon a Time Called Now on vinyl (originally released on Chainsaw records – only on CD), as well as a collection of songs never before released called Singles & Demos: 1994-1998. Jealous Butcher also re-issued Infinite Xs self-titled debut record at the same time.\nMembers\n* Tamala Poljak – vocals, guitar\n* Michelle Stevenson – guitar\n* David Gomez – bass\n* Sherri Solinger – drums\nDiscography\nAlbums\nOnce Upon a Time Called Now\nThis was the band's only album, released on 30 September 1997.\n[] |}}\nTrack listing\n# \"Teenage Angst at 27\" – 2:14\n# \"Jehu on a Rollercoaster\" – 2:17\n# \"Passing the Crown\" – 2:54\n# \"Autobarb\" – 2:54\n# \"Goddess (Pt. 4)\" – 2:56\n# \"Radio Agony\" – 3:57\n# \"Not a Jerk\" – 3:30\n# \"Equator\" – 2:56\n# \"Oscar Nite\" – 2:41\n# \"Bus\" – 3:51\nSingles\n* \"Will You Stay\", K Records, International Pop Underground single IPU088\n* \"Never Nowhere\", split single with Team Dresch on Sub Pop SP#0439, 1998\n* \"Equator\", Chou-Chou Records CCR-003, 1996\n* \"Goddess\", Atomic Gimlet AG001, 1995\nSoundtracks\n* Fuel Soundtrack, Arena Rock Recording Co., 1998\nReferences\nExternal links\n* [ Longstocking at the AMG]"
    }
  ]
}