{
  "content": [
    {
      "type": "text",
      "text": "# Lonnie Warwick\n\n| birth_place = Raleigh, West Virginia, U.S.\n| death_date =\n| death_place =\n| team =\n| number = 59\n| status =\n| position1 = Linebacker\n| height_ft = 6\n| height_in = 3\n| weight_lb = 238\n| highschool = Mount Hope (WV)\n| college = Tennessee (1960)Tennessee Tech (1961–1963)\n| NFLDraftedYear = 1964\n| NFLDraftedRound =\n| NFLDraftedPick =\n| NFLDraftedTeam =\n| playing_years1 = 1965–1972\n| playing_team1 = Minnesota Vikings\n| playing_years2 = 1973–1974\n| playing_team2 = Atlanta Falcons\n| playing_years3 = 1975\n| playing_team3 = San Antonio Wings\n| career_highlights =\n*NFL Champion (1969)\n}}\nLonnie Preston Warwick (February 26, 1942 – October 28, 2024) was an American professional football player who was a linebacker for 10 seasons in the National Football League (NFL), with the Minnesota Vikings and Atlanta Falcons. He started in Super Bowl IV.\nCollege career\nLonnie attended Mount Hope High School in Mount Hope, West Virginia, where he participated in the 1959 state championship game, was named all-state in both football and basketball, and graduated in 1960. In 2013, Warwick was inducted to the West Virginia North-South Football Hall of Fame. He attended at the University of Tennessee for a year. Transferring within a year, Warwick and played college football for Tennessee Tech, where he is a member of the Tennessee Tech Hall of Fame.\nNFL career\nWarwick ended up working for the Southern Pacific Railroad in Arizona for a year, before signing a free agent contract with the Minnesota Vikings in 1964. He became the starting middle linebacker of the legendary Purple People Eaters Vikings defense of the late 1960s and early 1970s. He was named the \"meanest man\" in football by former teammate Joe Kapp.\nWarwick led the Vikings in tackles for four years, and returned a blocked punt (gridiron football) for a touchdown in 1965. He had four interceptions and recovered two fumbles during the 1969 season, and caught three interceptions in 1970. He was the starting linebacker in Super Bowl IV, where the Kansas City Chiefs upset the heavily favored Vikings. Warwick played despite spraining his left ankle during the National Football League Championship Game against the Cleveland Browns the previous week. He was injured with knee problems for most of 1971, where he played four games, and 1972, playing just six games. The 1972 injury led the Vikings to insert rookie Jeff Siemon into the lineup at middle linebacker, and Siemon held the position through 1981. He became a member of the Atlanta Falcons in 1973, after being unable to reach a contract agreement with the Vikings. He played for the Falcons in all fourteen games in both 1973 and 1974 before retiring. In 1975, Warwick came out of retirement to play for the San Antonio Wings of the World Football League, which folded before the end of season.\nAfter football\nWarwick became a coach for the Washington Redskins for several years, where he also occasionally suited up as a player. He coached at Salem University, semi-professional teams in West Virginia, and with the Denver Gold of the United States Football League. He later resided in Mount Hope in Fayette County, West Virginia, where he helped out local high school football teams.\nWarwick died on October 28, 2024, at the age of 82.\nReferences\nExternal links\n*"
    }
  ]
}