{
  "content": [
    {
      "type": "text",
      "text": "# Looking for Clancy__disambig_1\n\nLooking for Clancy was a 1975 television serial broadcast on BBC2.\nBased on Frederic Mullally's 1971 novel Clancy, it was dramatised in five parts by Jack Pulman and starred Robert Powell, Keith Drinkel and T. P. McKenna. Produced by Richard Beynon, the serial was directed by Bill Hays and broadcast on Saturdays, with repeats the following Thursday. The serial was repeated in 1977.\nCast\n* Robert Powell – Frank Clancy\n* Keith Drinkel - Dick Holt\n* T. P. McKenna – Marcus Selby\n* Catherine Schell - Penny Clancy\n* Eileen Helsby - Lucy Caldwell\n* John Blythe - Ted Shatto\n* John Junkin - Jim Clancy\n* James Grout - Dai Owen\n* Rosemary Martin - Aunt Rita\n* Barbara Young- Eileen Clancy\n* Paul Aston - Gordon Clancy\n* Gwen Nelson - Meg Mace\n* Mavis Walker - Madge\n* John Nightingale - Michael Clancy\n* James Bree - Guy Wall\n* Peter Halliday - Sam Cook\nEpisodes\n{| class=\"wikitable\"\n|-\n! scope=\"col\" style=\"width: 15px;\" |Ep.\n! scope=\"col\" style=\"width: 400px;\" |Summary\n! scope=\"col\" style=\"width: 100px;\" |Broadcast\n|-\n| 1\n| Born in London's East End ten years before the General Strike, Frank Clancy and Dick Holt are boyhood friends. As they grow up they are both determined to make their way to the top in Fleet Street.\n| 24 May 1975\n|-\n| 2\n| Dick Holt, childhood friend of Frank Clancy, has committed suicide. Shocked by the news, Frank has withdrawn into himself and looks back over their young lives, searching for a reason.\n| 31 May 1975\n|-\n| 3\n| Now a successful Fleet Street editor, Frank Clancy is still affected by the suicide of his friend. He reflects on their early days together, when times were hard, and success a distant dream.\n| 7 June 1975\n|-\n| 4\n| The suicide of his boyhood friend has caused Frank Clancy to stop and review the events which have shaped his own life ... and question, perhaps, the price he has paid for success.\n| 14 June 1975\n|-\n| 5\n| Dick Holt is dead - a victim of his own ideals. Frank Clancy is alive - his only problem: the future.\n| 21 June 1975\n|}\nTitle song\nThe title song of the same name was written by Brian Wade and Tony Cliff. It was released as a 7” single by Susanne and Me on the Beeb label, (Beeb 006) in 1975, with Like A Picture Show (prod. Mike Harding) on the B-side. The song also appeared on the 1976 album Angels and 15 other Original BBC TV Themes (BBC Records, REB 236).\nReferences\nExternal links\n*"
    }
  ]
}