{
  "content": [
    {
      "type": "text",
      "text": "# Looking (Berlin Version) Solo\n\nLooking (Berlin Version) Solo is a live album featuring a solo performance by Cecil Taylor recorded in Berlin on November 1, 1989, and released on the FMP label.\nReception\n| rev2       = The Penguin Guide to Jazz\n| rev2Score  =\n}}\nThe AllMusic review by Brian Olewnick states: \"This live performance isn't outstandingly different from numerous others, but is nonetheless fascinating, exciting, and beautiful... If he'd mellowed a bit by this time, Taylor was still quite capable of working up a storm that dwarfed the efforts of 99 percent of those who attempted to emulate him, and did so with a balletic grace that his imitators could only dream of... The five brief concluding pieces are simply marvelous -- concise studies that gleam like rubies, concentrated nuggets of power and delicacy that no one but Taylor could ever create... Highly recommended\".\nJohn Corbett wrote: \"A relaxed, slightly reserved Taylor emerges here, full of flame but more than ever investigating a kind of majesty, grandeur, lyricism, and elegance. Sustain helps, and he's never used the pedal so much. This rounds some of the more percussive angles of his music; it lets him savor a bit, emphasizing intervallic as much as rhythmic density. Over the years, Taylor has developed several trademarks strategies: mirror image left and right hands (sort of instant retrograde inversion), stately bass chord figures; identical patterns rapidly shifted from register. On the long piece that forms the bulk of this recording, these are contrasted, mutated, grafted together, and truncated, serving both as genetic material and as thematic guideposts through the underbrush of improvisation.\"\nWriting for Burning Ambulance, Phil Freeman commented:\n}}\nTrack listing\nAll compositions by Cecil Taylor.\n# \"Section 1\" - 30:14\n# \"Section 2\" - 27:57\n# \"Section 3\" - 1:22\n# \"Section 4\" - 3:45\n# \"Section 5\" - 2:34\n# \"Section 6\" - 1:43\n# \"Section 7\" - 2:04\n:*Recorded at the Total Music Meeting, Quartier Latin, in Berlin, Germany on November 1, 1989\nPersonnel\n*Cecil Taylor – piano\nReferences"
    }
  ]
}