{
  "content": [
    {
      "type": "text",
      "text": "# Looking for the Thread\n\n}}\nLooking for the Thread is a collaborative studio album by American singer-songwriter Mary Chapin Carpenter and Scottish musicians Julie Fowlis and Karine Polwart. It was released on January 24, 2025, by Lambent Light Records with distribution by Thirty Tigers.\nThe album was preceded by the release of two singles. The first single, \"Hold Everything\", was released on November 24, 2024. The second single, \"A Heart That Never Closes\", was released on January 10, 2025.\nBackground and recording\nCarpenter first reached out to Fowlis and Polwart in hopes of helping her with an album in 2022 before subsequently meeting together in Northern Scotland for two writing sessions in which eventuated in the recording of what would become Looking for the Thread in early 2024; it was recorded at the Real World Studios in Box, England. Of the recording process, Powlart said in a press release that the musicians who contributed to the album were attentive to the music at the time of recording, adding that the songs were not \"pre-produced to within an inch of their lives\".\nCritical reception\nUpon release, Looking for the Thread received positive acclaim from critics. Lyndon Bolton of Folk Alley wrote: \"Carpenter's rich, empathetic American folk blends beautifully with the Scots, Fowlis and Polwart, who add their own traditional and contemporary styles.\" Mike Davies of KLOF Magazine opined that the album \"offers a captivating meeting of different but kindred musical minds from different genres and cultures coming seamlessly together with shared themes and emotions\".\nTrack listing\n| length1 = 4:26\n| title2 = A Heart That Never Closes\n| writer2 = Mary Chapin Carpenter\n| length2 = 5:02\n| title3 = Rebecca\n| writer3 = Karine Polwart\n| length3 = 3:52\n| title4 = Looking for the Thread\n| writer4 = Carpenter\n| length4 = 5:22\n| title5 = Hold Everything\n| writer5 = Polwart\n| length5 = 5:10\n| title6 = Silver in the Blue\n| writer6 = Fowlis\n| length6 = 4:16\n| title7 = You Know Where You Are\n| writer7 =\n| length7 = 5:08\n| title8 = Satellite\n| writer8 = Carpenter\n| length8 = 4:50\n| title9 = Buidheann Mo Chridhe Clann Ualrig\n| writer9 = Fowlis\n| length9 = 4:04\n| title10 = Send Love\n| writer10 = Carpenter\n| length10 = 5:10\n}}\nPersonnel\nCredits adapted from the album's liner notes.\n* Mary Chapin Carpenter – vocals, acoustic guitar\n* Julie Fowlis – vocals, whistle\n* Karine Polwart – vocals, acoustic guitar, tenor guitar, 12-string guitar\n* Josh Kaufman – baritone guitar, electric guitar, nylon guitar, keyboards, production\n* Rob Burger – piano, organ, accordion\n* Cameron Ralston – acoustic bass, electric bass\n* Chris Vatalaro – drums, percussion\n* Caoimhín Ó Raghallaigh – hardanger d'amore\n* D. James Goodwin – engineering, mixing, mastering\n* Katie May – engineering assistance\n* Gillian O'Mara – cover art\n* Mark Berger – art direction, design\nChart performance\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center;\"\n|+ Chart performance for Looking for the Thread\n! scope=\"col\"| Chart\n! scope=\"col\"| Peakposition\n|-\n|-\n|-\n|}\nReferences"
    }
  ]
}