{
  "content": [
    {
      "type": "text",
      "text": "# Looking for Danger\n\n| runtime        = 62 minutes\n| country        = United States\n| language       = English\n| budget         =\n| gross          =\n}}\nLooking for Danger is a 1957 American comedy film directed by Austen Jewell and starring the comedy team of The Bowery Boys.  The film was released on October 6, 1957 by Allied Artists and is the forty-sixth film in the series.\nPlot\nA military investigator traces a missing government-issued item to Clancy's Cafe. Duke, attempting to explain the circumstances, recounts the wartime exploits of the Bowery Boys. The boys' sergeant,\nfed up with Sach and Duke, volunteers them for a suicide mission. They go under cover as German soldiers to deliver a message to a sultan. The sultan, however, is in league with the German high command and plots to sabotage the advancing American troops.\nCast\nThe Bowery Boys\n* Huntz Hall as Horace Debussy \"Sach\" Jones\n* Stanley Clements as Stanislaus \"Duke\" Coveleskie\n* David Gorcey as Charles \"Chuck\" Anderson\n* Jimmy Murphy as Myron\n* Eddie LeRoy as Blinky\nSupporting cast\n* Dick Elliott as Mike Clancy\n* Lili Kardell as Shareen\n* Richard Avonde as Col. Ahmed Tabari\n* Otto Reichow as Wolff\n* Michael Granger as Sidi-Omar\n* Peter Mamakos as Hassan\n* Joan Bradshaw as Zarida\n* George Khoury as Mustapha\n* Henry Rowland as Wetzel\n* Harry Strang as Watson\n* Paul Bryar as Harper\n* Jane Burgess as Sari\n* John Harmon as Lester Bradfield\n* Michael Vallon as Waiter\nCast notes\n* Dick Elliott now takes over for the role of Mike Clancy.\n* Jimmy Murphy ('Myron')'s last Bowery Boys film.\nProduction\nThe screenplay for Looking for Danger was written by veteran comedy writer Elwood Ullman, from an original story he wrote with his usual collaborator, writer-director Edward Bernds. Bernds and Ullman had sketched out the story a couple of years earlier while Bernds was directing the series; the leading roles were intended for Leo Gorcey and Huntz Hall, and the gags were similar to those in the Bernds-Ullman Three Stooges comedies. In a 1986 interview with Ted Okuda, Bernds noted, \"If something is funny in one situation you can generally modify it to fit someone else. In our pictures, Huntz was the comic and Leo more the straight man, and it was very much a Stooge-like relationship.\"\nLooking for Danger was filmed in June 1957. Producer Ben Schwalb moved on to other projects, and actor Jimmy Murphy was released. The studio was then preparing its backlog of Bowery Boys features for television syndication, and decided to discontinue the theatrical series. Huntz Hall still had two more feature films on his contract; former film editor and now staff producer Richard Heermance was assigned to oversee these last two quickies (Up in Smoke and In the Money). William Beaudine -- who had been the Bowery Boys' most frequent director -- came back to film them in a matter of days. The studio then demolished the long-standing \"Bowery street\" on the studio backlot.\nHome media\nWarner Archives released Looking for Danger on made-to-order DVD in the United States as part of \"The Bowery Boys, Volume Three\" on October 1, 2013.\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}