{
  "content": [
    {
      "type": "text",
      "text": "# Lookingglass Theatre Company\n\n}}\nLookingglass Theatre Company is a non-profit theater company located in Chicago, Illinois.\nHistory\nLookingglass was founded in 1988 by David Schwimmer, David Catlin, Eva Barr, Thom Cox, Lawrence DiStasi, Joy Gregory, David Kersnar, and Andy White. The company's first production, Through the Lookingglass, was directed by David Kersnar and was produced at the Great Room in Jones Residential College on the Northwestern University campus.\nThe company has since produced more than 60 world premiere plays, including Mary Zimmerman's Metamorphoses, as well as her adaptations of The Arabian Nights and The Odyssey. The company also premiered and toured creator David Catlin's circus-driven re-imaginings of Lewis Carroll's Alice in Wonderland in Lookingglass Alice and Herman Melville's Moby Dick. Other productions have included David Schwimmer's adaptations of Upton Sinclair's The Jungle and Studs Terkel's Race: How Blacks and Whites Think and Feel About the American Obsession.\nRecent productions include Jules Verne's 20,000 Leagues Under the Sea, adapted by David Kersnar and Althos Low; Plantation!, a play about reparations, written by Ensemble Member Kevin Douglas and directed by Ensemble Member David Schwimmer; Beyond Caring, created by British author and director Alexander Zeldin.\nLeadership\nLookingglass is led by Artistic Director Heidi Stillman, and Executive Director, Rachel Fink. Fink was preceded by Rachel Kraft, who served as Executive Director for 12 seasons. Kraft's tenure saw the company receive the 2011 Regional Theatre Tony Award, a 2016 $1 million MacArthur Award for Creative and Effecting Institutions, and the 2017 League of Chicago Theaters Artistic Achievement Award.\nNew work\nGlassworks is Lookingglass' New Play Development program. The company has produced 66 World Premieres.\nRecent world premieres\n:Jules Verne's 20,000 Leagues Under the Seas.\n:Plantation!\n:Mr. and Mrs. Pennyworth (Manual Cinema, 2016)\n:Thaddeus and Slocum: A Vaudeville Adventure\n:In the Garden: a Darwinian Love Story\n:Still Alice\n:The North China Lover\nOther premieres\n:Metamorphoses\n:Eastland: A New Musical\n:Lookingglass Alice\n:Around the World in 80 Days\n:Black Diamond\n:Moby Dick\n:The Arabian Nights\n:Hans Christian Andersen's The Steadfast Tin Soldier\n:Act(s) of God\n:Mary Shelley's Frankenstein\nEducational programming\nLookingglass, sponsors in-school residencies and student matinee programs for students in Chicago Public Schools. The company also offers classes and artistic summer camps for youth. In 2006, Lookingglass founded The Young Ensemble, where children devise and produce their own work.\nFacilities\nIn 2003, Lookingglass moved inside the Chicago Water Tower Water Works building in Near North Side, Chicago.\nThe main stage is in the black-box style, meaning the seating can be rearranged for each production. Lookingglass artists can reconfigure the stage and seating arrangements to meet the design needs for specific productions. The theatre has a maximum capacity of 240 persons, including 60 possible seats on the removable balcony level. There is also a multi-purpose studio space, used for education programs, special events, and rehearsals.\nDesigned by Morris Architects Planners, the space is a converted landmark. It houses the Lookingglass performance space, lobbies, dressing rooms, and concession areas, as well as a Chicago Public Library. Additionally, the station continues to pump 125 million gallons of water to Chicago's north side every day.\nThe historic water pumping station building that houses the Lookingglass Theatre Company\nAn itinerant theater company for years, Lookingglass moved into a permanent home on June 14, 2003, with a new theater in the renovated Water Tower Water Works on Chicago's Magnificent Mile.\nIts first production in the new space was an adaptation of Studs Terkel's Race, adapted and directed by David Schwimmer.\nSee also\n*Theatre in Chicago\nReferences\nExternal links\n*"
    }
  ]
}