{
  "content": [
    {
      "type": "text",
      "text": "# Looking for Angeline\n\n| recorded   =\n| studio     =\n| venue      =\n| genre      =\n| length     = 3:53\n| label      = Fontana\n| writer     = James Grant\n| producer   = Love and Money\n| prev_title = My Love Lives in a Dead House\n| prev_year  = 1991\n| next_title = Winter\n| next_year  = 1991\n}}\n\"Looking for Angeline\" is a song by Scottish band Love and Money, released on 2 September 1991 as the second single from their third studio album, Dogs in the Traffic. The 12-inch and CD formats were released as the Wishing Waters E.P., with \"Looking for Angeline\" as the lead track. The song was written by James Grant and produced by Love and Money. It peaked at number 109 in the UK Singles Chart.\nBackground\nSpeaking to Record Mirror in 1989, Grant revealed the following about \"Looking for Angeline\", }}\n\"Looking for Angeline\" first surfaced in January 1989 as the B-side to the band's single \"Strange Kind of Love\", and was included in the set-list of their 1989 UK tour. It was included as the sixth track on the band's third studio album, Dogs in the Traffic, in 1991.\nCritical reception\nUpon its release as a single, Jim Whiteford of the Dundee Evening Telegraph described \"Looking for Angeline\" as a \"classy song on which there is some country-styled guitar playing\". Flo Swann of the Coventry Evening Telegraph wrote, \"Wicked spirited country/bluesy type thing. Great harmonica and guitars, and an infectious chorus. Very highly recommended.\" Fife Free Press called it a \"memorable country blues ditty\". In a review of Wishing Waters, Paul Baldwin of the Northampton Chronicle & Echo stated that the EP contains four tracks of \"ever-so-sophisticated RnB, clinically produced, but somehow naggingly good\". He continued, \"Real candidates for 'the band most likely to' label, Love and Money are honours graduates from the Lloyd Cole college of cool.\"\nTrack listing\n7-inch single (UK and Europe)\n#\"Looking for Angeline\" – 3:53\n#\"True Believer\" – 4:16\nWishing Waters E.P. – 12-inch and CD (UK and Europe)\n#\"Looking for Angeline\" – 3:53\n#\"Who in Their Right Mind\" – 4:53\n#\"True Believer\" – 4:16\n#\"Hubcap to Blue Town\" – 2:25\nPersonnel\nLove and Money\n* James Grant – vocals, guitar\n* Douglas MacIntyre – guitar, backing vocals\n* Paul McGeechan – keyboards\n* Bobby Paterson – bass, backing vocals\n* Gordon Wilson – drums\nAdditional musicians on \"Looking for Angeline\"\n* Fraser Speirs – harmonica\n* Ronnie Goodman – percussion\n* Beatrice Colin – backing vocals\nProduction\n* Love and Money – production (all tracks)\n* Steve Nye – mixing (\"Looking for Angeline\")\n* Tony Phillips – production (\"Who in Their Right Mind\")\nOther\n* Stylorouge – design\n* Simon Fowler – photography\nCharts\n{|class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|-\n!Chart (1991)\n!Peakposition\n|-\n!scope=\"row\"|UK Singles Chart (OCC)\n| 109\n|}\nReferences"
    }
  ]
}