{
  "content": [
    {
      "type": "text",
      "text": "# Lord Steward__disambig_1\n\n(centre left) carrying his wand of office as Lord Steward in the Procession to the Lying-in-state of Elizabeth II (2022).]]\nThe Lord Steward or Lord Steward of the Household is one of the three Great Officers of the Household of the British monarch. He is, by tradition, the first great officer of the Court and he takes precedence over all other officers of the household.\nHistorically the Lord Steward oversaw over the Household 'below stairs'. He also presided at the Board of Green Cloth, which in early centuries had a financial, administrative and judicial role (latterly the Board retained a vestigial legal remit, until it was finally abolished in a 2004 reform of local government licensing). Prior to 1924 the Lord Steward was always a member of the Government, and until 1782 the office had been one of considerable political importance and carried Cabinet rank. In the modern period, Lord Stewards (up to and including Hugh Percy, 10th Duke of Northumberland in 1973) were invariably made Privy Counsellors on appointment.\nOver time the domestic responsibilities of the office came increasingly to be carried out by a subordinate officer: the Master of the Household. In the Royal Household reforms of the 1920s, the Lord Steward's Department was renamed the Master of the Household's Department. At the same time, Lord Steward ceased to be a political appointment and instead became a largely titular office in the gift of the monarch.\nThe Lord Steward continues to be in regular attendance on State and other ceremonial occasions (including State visits, State banquets, the State Opening of Parliament, State Funerals and Coronations). Holders of the office are always peers, usually of or above the degree of an Earl. Each Lord Steward receives his appointment from the Sovereign in person and bears a white staff as the emblem and warrant of his authority. The incumbent Lord Steward (appointed in 2023) is Peter St Clair-Erskine, 7th Earl of Rosslyn (who additionally serves as Personal Secretary to Their Majesties The King and Queen).\nHistory\n, holding his white staff of office (portrait dated AD 1567, the year he was appointed Lord Steward).]]\nWithin the Curia Regis, the office of Steward of the King's Household was indistinguishable from that of Lord (High) Steward of England, which had first been introduced to the realm under William the Conqueror (and which was by the end of the 12th century an hereditary office). As late as 1221 the hereditary stewardship was still being referred to as a 'stewardship of the royal household'.\nUnder King John, however, the holder of the hereditary office (Simon de Montfort, 5th Earl of Leicester) resided in France, and after his death in 1218 the Earldom went into 'virtual abeyance' until Simon de Montfort, 6th Earl of Leicester had his claim to it confirmed in 1239. By that time it had become the norm to appoint separate Stewards of the Household to undertake the practical duties of the office (so de Montfort came to be referred to, by contrast, as 'Steward of all England'). For the rest of the 13th century there were normally two Stewards of the Household appointed, until 1292 when Walter de Beauchamp continued in office alone after his co-steward Peter de Champvent had been made Chamberlain. Since then every Steward of the Household has served singly.\nDuring the minority of King Richard II, the Crown assented to a proposal that the Chancellor and Treasurer of England, the Lord Keeper of the Privy Seal and the Steward and Chamberlain of the Household should be chosen by Parliament 'from the ablest persons in the Realm', and remain in office until the next Parliament (in contrast to the hereditary offices of State).\nDuring the reign of King Edward IV, the duties, privileges and precedence of the Lord Steward were comprehensively enumerated in the Black Book of the Household (compiled in the early 1470s). In it he is described as having, under the King, the 'secondary estate and rule' of the Royal Household, which is 'wholly committed to be ruled and guided by his reason'.\nIn 1540 the Lord Steward was redesignated '''Great Master of the King's Household''' by the King's Household Act 1540 (32 Hen. 8. c. 39), but that office was discontinued and the office of Lord Steward revived by the Lord Steward Act 1554 (which remains on the statute book).\nThe Lord Steward's Department\n\"[The] Steward of Household receiveth his charge of the King's high and proper person, and the staff of Household, by these words following: Seneschall tenez le baton de notre hostiell\" (The Black Book of the Household, 1471–72).\nAs steward, the Lord Steward presided over the Household 'below stairs' (while the Lord Chamberlain presided over the Household 'above stairs'). The sub-departments below stairs were mostly concerned with catering, including the royal kitchens and cellars, and various provisioning departments such as the buttery, spicery, confectionery, bakehouse, scalding house and so forth. Each was managed by its own staff of yeomen and grooms, and headed by a gentleman or sergeant; the Lord Steward exercised rights of patronage over these positions. Over time (particularly in the late 18th and early 19th centuries) the number of sub-departments was significantly reduced as items began to be sourced from outside vendors.\nAt the demise of the monarch the Lord Steward would break his white staff over the coffin, 'and thereby discharge all the Officers under his Jurisdiction'.\nThe Board of Green Cloth\nand Duke of Richmond (Lord Steward 1618-1623).]]\n\"...they sit with him at the Board of Doom within the Household, that is, at the Green Cloth in the Counting-house, as recorders and witnesses to the truth\" (The Black Book of the Household, 1471-72).\nIn the 14th century, the King's Wardrobe, previously an independent and powerful financial office, was absorbed into the King's Household and its officers and responsibilities were placed under the authority of the Lord Steward. Thus the Lord Steward's Department gained increased financial and administrative responsibilities. Its officers met in the counting-house where they sat at a green cloth-covered table, by which they came to be known as the Board of Green Cloth.\nThe officers under the Lord Steward were listed in the 15th century as: the Treasurer of the Household and the Comptroller of the Household (both of whom would deputise for the Lord Steward in his absence), the Cofferer of the Household, two Clerks of the Green Cloth and the Chief Clerk of the Controlment; all of whom had their origins in the Wardrobe. Added to their number in the Tudor period was the Master of the Household (who took precedence after the Cofferer).\nBy the time of the Restoration, the administration of the Lord Steward's Department was for the most part delegated to the Board of Green Cloth, which served as the central accounting and organisational facility. Apart from the Lord Steward, the Board consisted of the Treasurer, the Comptroller and the Master of the Household (all of which were sinecure positions in the 17th and 18th centuries), the Cofferer (who had executive financial and accounting responsibilities), and a number of clerks and clerk comptrollers (who, in consultation with the Lord Steward, managed the day-to-day running of the household below stairs).\nJudicial functions\n\"...by which he is also forthwith Steward of the whole Court of Marshalsea, that is, the Court of Household, in which he is Judge of life and limb\" (The Black Book of the Household, 1471-72).\nBy the early years of the thirteenth century, the Steward of the Household was seen as having 'a special judicial role within the household, of which he was the appointed head'; and by the 1290s a distinct court of law had emerged, with its own personnel, procedures and jurisdiction, described by Fleta as 'the king's court in his hall before his steward'. In the 14th century it was termed the Court of the Steward and Marshal of the King's House, but was more commonly known as the Marshalsea Court.\nOn this basis the Lord Steward acted as principal judge for all offences committed within the Verge of the Royal Court, having both civil and (in earlier years) criminal jurisdiction. He sat as a judge in the Marshalsea Court, and also in the Palace Court (created by Letters Patent of Charles I in 1630), and in this role he was assisted by the Knight Marshal and his men, by the Steward of the Marshalsea (always a qualified lawyer) and by the Coroner of the Verge. In the absence of the Lord Steward the Treasurer and Comptroller of the Household were empowered to sit as judges, along with the Steward of the Marshalsea; by the 19th century the latter had come to be, in practice, the only sitting judge of the court. The Marshalsea and Palace Courts were abolished in 1849.\nThe Board of Green Cloth had its own jurisdiction, with powers to maintain the peace within the Verge and to deal with offenders.\nBy virtue of the Coroners Act 1988, the lord steward continued to appoint the Coroner of the Queen's Household until the office was abolished in 2013 by the Coroners and Justice Act 2009.\nParliamentary functions\n, Lord Steward 1587&ndash;1588, holding the white staff of his office.]]\n\"He hath the office to call the names of Knights, Citizens and Burgesses, at the Parliament door, the first day of commencement, and to amerce such as fail by the certificate\" (The Black Book of the Household, 1471–72).\nUntil 1831, the Lord Steward or his deputies presided over the swearing of oaths by members of the House of Commons. (These oaths were sworn in the lobby of the house, or another convenient room designated for the purpose, and were the same as, but sworn separately from, the oaths taken in the chamber itself.) In the Tudor period he was responsible for taking the roll call of all the Knights and Burgesses who had been elected to represent the Commons in Parliament, prior to each State Opening.\nBy long tradition, the 'Lords with White Staves' are called upon if required to deliver messages between the House of Lords and the Sovereign.\nReforms\nFor some centuries the role of the Lord Steward remained much as it had been in the late Middle Ages. In 1727, the office of Lord Steward was described in the following terms:\"To him is committed the State of the King's House, to be ordered and guided according to his Discretion: He hath Authority over all Officers and Servants of the King's House, except those of the Royal Chapel, Chamber, Stable, &c. He by Vertue of his Office judgeth of all Treasons, Murthers, Felonies and other Enormities committed within the Verge of the King's Court [...]. At the Beginning of Parliaments he attends the King's Person, and administers the Oaths of Allegiance and Supremacy to the several Members of the House of Commons, and at the Ends of Parliaments, he adjudgeth the Parliamentary Expenses &c.\"\nThe Lord Steward's developing role in government, however, led to increased absences from the Court, which (among other things) led to a number of reforms being introduced.\nIn 1782 the financial independence of the Lord Steward's Department was reduced (as the Treasury began to take a greater hand in Civil list expenditure), and the office of Cofferer was replaced by that of Paymaster of the Household (an officer with much reduced status and more limited responsibilities). At the same time the Master of the Household was made responsible for the executive management of the Lord Steward's Department.\nFollowing Queen Victoria's accession to the throne, her husband Prince Albert took a keen interest in reforming the Royal Household of its complexities and inefficiencies. In 1841 Baron Stockmar was commissioned to draw up a memorandum on the matter; he summed up the problem with the observation that even simple tasks were the responsibility of more than one master: 'the Lord Steward found the fuel and laid the fire, while the Lord Chamberlain lighted it'. As a result, towards the end of 1844, authority over the whole internal economy of the palace was conferred upon the Master of the Household, who became a permanent, resident officer. The titular heads (the Lord Steward, Lord Chamberlain and Master of the Horse) were retained, but their duties with regard to the Household were in this way delegated. Thus the office of Lord Steward came to be regarded as 'purely an honorary one'.\nIn 1924, in line with these reforms, the Lord Steward's Department (Board of Green Cloth) was formally renamed the Master of the Household's Department (Board of Green Cloth). A few years earlier, in 1920, some residual executive and ceremonial duties had been transferred from the Lord Steward to the Lord Chamberlain.\nList of Lord Stewards\n12th century\nIn the first year of the reign of King Richard I two individuals are named as his royal stewards (separate from the hereditary stewardship, which was vested jointly at that time in the Earldoms of Leicester and Norfolk):\n*Roger des Prés 1189–1190\n*Stephen of Longchamp 1189–1190\n13th century\nThe following are named as Steward in the 13th century (n.b. for most of the century two individuals served concurrently as Steward, and sometimes there were more; though records prior to the reign of Edward I are incomplete and at times inconclusive):\n*Robert of Turnham 1201\n*Peter of Stokes 1203–1207\n*William of Cantilupe 1204, 1207–1216, 1218, 1222–1231\n*Brian de Lisle 1213\n*Faulkes de Bréauté 1215\n*Ralph Fitznicholas 1225–1236, 1242–1255\n*Geoffrey of Crowcombe 1225–1236\n*Richard of Argentine 1226–1228\n*John Fitzphilip 1232–1235\n*Amaury de St Amand 1233–1240\n*William (II) of Cantilupe 1238–1251\n*Bertram de Crioll 1239–1256\n*Paulin Peyvre 1242-1243, 1244–1251\n*John of Laxton 1242–1255\n*Robert Walerand 1251–1258\n*John Grey 1253–1255\n*William Grey 1255\n*Drew of Barentyn 1255\n*Giles of Argentine 1258–1265\n*Imbert of Poges 1257–1262\n*Eubolo de Montibus 1262–1270\n*Alan la Zouch 1263\n*Roger of Leyburn 1263–1265\n*Adam of Newmarket 1264–1265\n*Sir Walter of Creping 1264–1265\n*William d'Aeth 1267–1270\n*John de la Land 1268\n*Sir William of Wintershill 1269–1270\n*William Charles 1270–1271\n*Stephen of Edworth 1271–1272\n*Roger of Waltham 1272\n*Hugh Fitzotho 1274–1283\n*Robert Fitzjohn 1278–1286\n*Peter Champvent 1286–1292\n*Walter Beauchamp 1289–1303\n14th century\n*Robert de la Warde 1303–1306\n*John Thorp 1307\n*Miles Stapleton 1307\n*Robert Fitzpayn 1308–1310\n*Edmund Mauley 1310–1312\n*Hugh Audley, senior 1312\n*Edmund Mauley 1313–1314\n*John Cromwell 1314–1316\n*William Montague 1316–1318\n*Bartholomew Badlesmere 1318–1321\n*Gilbert Pecché 1322\n*Simon Dryby 1322\n*Richard Amory 1322–1325\n*Thomas Le Blount 1325–1327\n*John Ros 1327–1328\n*John Maltravers 1328\n*John Wysham 1328–1329\n*John Maltravers 1329–1330\n*Hugh Turplington 1330\n*Ralph Neville of Raby 1330–1336\n*Robert Ufford 1336–1337\n*John Darcy 1337–1340\n*Ralph Stafford 1341–1345\n*Richard Talbot 1345–1349\n*John Grey of Rotherfield 1349–1359\n*Guy Brian 1359–1361\n*John Atte Lee 1362–1368\n*William Latimer 1368–1370\n*Henry le Scrope 1371\n*John Neville of Raby 1371–1376\n*John of Ypres 1376–1377\n*Richard le Scrope of Bolton 1377–1378\n*Hugh Segrave 1378–1381\n*John Montague 1381–1387\n*John Beauchamp of Holt 1387–1388\n*John Devereux 1388–1393\n*Thomas Percy 1393–1399\n*Sir Thomas Rempston 1399–1401\n15th century\n*Thomas Percy, 1st Earl of Worcester 1401–1402\n*William Heron, Lord Say 1402–1404\n*Sir Thomas Erpingham 1404\n*Sir John Stanley 1405–1412\n*Sir Thomas Erpingham 1413–1417\n*Sir Walter Hungerford 1413–1421\n*Robert Babthorp 1421–1424\n*Sir Walter Hungerford 1424–1426\n*Sir John Tiptoft 1426–1432\n*Robert Babthorp 1432–1433\n*William de la Pole, 1st Marquess of Suffolk 1433–1446\n*Ralph Boteler, 1st Baron Sudeley 1447–1457\n*John Beauchamp, 1st Baron Beauchamp 1457–1461\n*William Neville, 1st Earl of Kent 1461–1463\n*John Tiptoft, 1st Earl of Worcester 1463–1467\n*Henry Bourchier, 1st Earl of Essex 1467–1471\n*Thomas Stanley, 2nd Baron Stanley 1471–1483\n*Thomas Howard, Earl of Surrey 1483–1485\n*John Radcliffe, 6th Baron Fitzwalter 1486–1496\n*Robert Willoughby, 1st Baron Willoughby de Broke 1496–1502\n16th century\n*George Talbot, 4th Earl of Shrewsbury 1502–1538\n*Robert Radcliffe, 1st Earl of Sussex 1538–1540\nOffice of Lord Steward discontinued and replaced by the Lord Great Master\n*Charles Brandon, 1st Duke of Suffolk 1540–1545\n*William Paulet, Lord St John 1545–1550\n*John Dudley, 1st Earl of Warwick 1550–1553\nOffice of Lord Steward restored\n*Henry Fitzalan, 12th Earl of Arundel 1553–1564\n*Vacant 1564–1567\n*William Herbert, 1st Earl of Pembroke 1567–1570\n*Vacant 1570–1572\n*Edward Clinton, 1st Earl of Lincoln 1572–1584\n*Robert Dudley, 1st Earl of Leicester 1584–1588\n*Henry Stanley, Earl of Derby 1588–1593\n*Vacant 1593–1597\n17th century\n*Charles Howard, 1st Earl of Nottingham 1603–1618\n*Ludovic Stuart, 1st Duke of Richmond 1618–1623\n*James Hamilton, 2nd Marquess of Hamilton 1623–1625\n*William Herbert, 3rd Earl of Pembroke 1625–1630\n*Vacant 1630–1640\n*Thomas Howard, 14th Earl of Arundel 1640–1644\n*James Stuart, 1st Duke of Richmond 1644–1655\n*Vacant 1655–1660\n*James Butler, 1st Duke of Ormonde 1660–1688\n*William Cavendish, 1st Duke of Devonshire 1689–1707\n18th century\n*William Cavendish, 2nd Duke of Devonshire 1707–1710\n*John Sheffield, 1st Duke of Buckingham and Normanby 1710–1711\n*John Poulett, 1st Earl Poulett 1711–1714\n*William Cavendish, 2nd Duke of Devonshire 1714–1716\n*Henry Grey, 1st Duke of Kent 1716–1718\n*John Campbell, 2nd Duke of Argyll 1718–1725\n*Lionel Sackville, 1st Duke of Dorset 1725–1730\n*Philip Stanhope, 4th Earl of Chesterfield 1730–1733\n*William Cavendish, 3rd Duke of Devonshire 1733–1737\n*Lionel Sackville, 1st Duke of Dorset 1737–1744\n*William Cavendish, 3rd Duke of Devonshire 1744–1749\n*Charles Spencer, 3rd Duke of Marlborough 1749–1755\n*John Manners, 3rd Duke of Rutland 1755–1761\n*William Talbot, 1st Earl Talbot 1761–1782\n*Frederick Howard, 5th Earl of Carlisle 1782–1783\n*Charles Manners, 4th Duke of Rutland 1783\n*William Legge, 2nd Earl of Dartmouth 1783\n*James Brydges, 3rd Duke of Chandos 1783–1789\n*John Sackville, 3rd Duke of Dorset 1789–1799\n*George Townshend, 1st Earl of Leicester 1799–1802\n19th century\n*George Legge, 3rd Earl of Dartmouth 1802–1804\n*Heneage Finch, 4th Earl of Aylesford 1804–1812\n*George Cholmondeley, 1st Marquess of Cholmondeley 1812–1821\n*Henry Conyngham, 1st Marquess Conyngham 1821–1830\n*Richard Temple-Nugent-Brydges-Chandos-Grenville, 1st Duke of Buckingham and Chandos 1830\n*Richard Wellesley, 1st Marquess Wellesley 1830–1833\n*George Campbell, 6th Duke of Argyll 1833–1834\n*Thomas Egerton, 2nd Earl of Wilton 1835\n*George Campbell, 6th Duke of Argyll 1835–1839\n*William Hay, 18th Earl of Erroll 1839–1841\n*Charles Jenkinson, 3rd Earl of Liverpool 1841–1846\n*Hugh Fortescue, 2nd Earl Fortescue 1846–1850\n*Richard Grosvenor, 2nd Marquess of Westminster 1850–1852\n*James Graham, 4th Duke of Montrose 1852–1853\n*Henry Howard, 13th Duke of Norfolk 1853–1854\n*Frederick Spencer, 4th Earl Spencer 1854–1857\n*Edward Eliot, 3rd Earl of St Germans 1857–1858\n*Brownlow Cecil, 2nd Marquess of Exeter 1858–1859\n*Edward Eliot, 3rd Earl of St Germans 1859–1866\n*John Ponsonby, 5th Earl of Bessborough 1866\n*John Spencer-Churchill, 7th Duke of Marlborough 1866–1867\n*Charles Bennet, 6th Earl of Tankerville 1867–1868\n*John Ponsonby, 5th Earl of Bessborough 1868–1874\n*Frederick Lygon, 6th Earl Beauchamp 1874–1880\n*John Townshend, 1st Earl Sydney 1880–1885\n*William Edgcumbe, 4th Earl of Mount Edgcumbe 1885–1886\n*John Townshend, 1st Earl Sydney 1886\n*William Edgcumbe, 4th Earl of Mount Edgcumbe 1886–1892\n*Gavin Campbell, 1st Marquess of Breadalbane 1892–1895\n*Sidney Herbert, 14th Earl of Pembroke 1895–1905\n20th century\n*Cecil Foljambe, 1st Earl of Liverpool 1905–1907\n*William Lygon, 7th Earl Beauchamp 1907–1910\n*Edwyn Scudamore-Stanhope, 10th Earl of Chesterfield 1910–1915\n*Horace Farquhar, 1st Viscount Farquhar 1915–1922\n*Anthony Ashley-Cooper, 9th Earl of Shaftesbury 1922–1936\n*George Sutherland-Leveson-Gower, 5th Duke of Sutherland 1936–1937\n*Walter Montagu Douglas Scott, 8th Duke of Buccleuch 1937–1940\n*Douglas Douglas-Hamilton, 14th Duke of Hamilton 1940–1964\n*Gerald Grosvenor, 4th Duke of Westminster 1964–1967\n*Charles Lyttelton, 10th Viscount Cobham 1967–1972\n*Hugh Percy, 10th Duke of Northumberland 1973–1988\n*Matthew White Ridley, 4th Viscount Ridley 1989–2001\n21st century\n*James Hamilton, 5th Duke of Abercorn 2001–2009\n*James Ramsay, 17th Earl of Dalhousie 2009–2023\n*Peter St Clair-Erskine, 7th Earl of Rosslyn 2023–present\nReferences"
    }
  ]
}