{
  "content": [
    {
      "type": "text",
      "text": "# Lord President of Munster__disambig_1\n\nThe post of Lord President of Munster was the most important office in the English government of the Irish province of Munster from its introduction in the Elizabethan era for a century, to 1672, a period including the Desmond Rebellions in Munster, the Nine Years' War, and the Irish Rebellion of 1641. The Lord President was subject to the Lord Deputy of Ireland, but had full authority within the province, extending to civil, criminal, and church legal matters, the imposition of martial law, official appointments, and command of military forces. Some appointments to military governor of Munster were not accompanied by the status of President. The width of his powers led to frequent clashes with the longer established courts, and in 1622 the President, Donogh O'Brien, 4th Earl of Thomond, was warned sharply not to \"intermeddle\" with cases which were properly the business of those courts. He was assisted by a Council whose members included the Chief Justice of Munster, another justice and the Attorney General for the Province. By 1620 his council was permanently based in Limerick.\nThe post was suppressed in 1672.\nEarly history\nThe position of President of Munster was created at the suggestion of Sir Henry Sidney in the late 1560s. Filling it proved troublesome initially, since the nomination in 1566 of Warham St Leger failed to get royal approval. John Pollard turned down Sidney's offer, ultimately, for financial reasons. Later in 1569 Sir Edward Fitton accepted the position of Lord President of Connaught. The first President to be appointed was Sir John Perrot (1568) but it took several years for him to arrive in Munster. There are sources saying that Humphrey Gilbert had the title in 1569.\nFrom the late 16th or early 17th century, Shandon Castle (just outside the Cork's north gate) became an official residence associated with the office. The castle was used by the administration as a residence, for court hearings, and as a place of imprisonment.\nPresidents of Munster\n*1568 John Perrot, not in Ireland until 1571, absent after 1573\n*1576–1578 William Drury\n*1584–1597 John Norreys\n*1597–1599 Thomas Norreys\n*1600–1603 Sir George Carew.\n** Carew asked to resign, and was replaced about the time James I came to the English throne. There are different, confused accounts of the transition and outcome, one from the perspective of officials in London, and another local to Munster and indeed Cork. Brouncker, President in title, over-reached his position quickly;\n** (I) On one account, Carew was recommending as Vice-President Oliver St John; but in fact held the post until the appointment of his successor Henry Brouncker.\n** (II) On another account, Carew put his post in commission with Charles Wilmot and George Thornton. The post was taken over from them (c.1605) by Henry Becher (d. 1610). Here sources conflict.\n** (III) Whatever the nominal position from 1606, Wilmot and Thornton again held the reins of government.\n*1607–1615 Henry Danvers, 1st Earl of Danby\n*1615 Donogh O'Brien, 4th Earl of Thomond by purchase; died 1624.\n*1625 Edward Villiers; died 1626\n*1627–1642 William St Leger. After his death the position is three-cornered and unclear and the territory of Munster was in Irish hands, effectively until Cromwell's campaign of reconquest.\n*March 1643 Jerome Weston, 2nd Earl of Portland is nominated by the king; his title is empty, and the only effect is to offend Murrough O'Brien.\n*c.1645 Viscount Muskerry, though from 1642 with the Confederate Irish, is the royalist nominee.\n*1647 Murrough O'Brien, 1st Earl of Inchiquin, parliamentary appointee. In 1648 he turns royalist.\n*From about 1649 Henry Ireton, died 1651\n*1661 to 31 July 1672 Roger Boyle, 1st Earl of Orrery; office suppressed\nVice-presidents and deputies\n*1579 Warham St Leger is provost-marshal of Munster.\n*1583 William Stanley acts as deputy.\n*1585–1597 Thomas Norreys is vice-president to his brother John.\n*c. 1589 William Herbert, acting vice-president.\n*Edward Legge, vice-president.\n*1607 After Brouncker's death and before Danvers's appointment, Richard Moryson and Donogh O'Brien, 4th Earl of Thomond are acting in the post of president.\n*1609 Richard Moryson, vice-president. In 1613 Moryson tried to purchase the presidency, paying Danvers, but Thomond had the post in the end.\n*1660 Murrough O'Brien, 1st Earl of Inchiquin, vice-president.\n*? Roger Boyle, 2nd Earl of Orrery as vice-president to his father.\nSee also\n*Lord President of Connaught\n*Chief Justice of Munster\n*Provinces of Ireland\nNotes"
    }
  ]
}