{
  "content": [
    {
      "type": "text",
      "text": "# Lore Kingdom\n\n|government_type = Monarchy\n|status = Vassal state\n|title_leader = Raja (Magau)\n| leader1 = Ngkai S. Kabo\n| year_leader1 = 1903–unknown\n}}\nLore Kingdom is a kingdom that once existed in the Poso Regency, Central Sulawesi, Indonesia. Initially, the rulers of this kingdom followed to native religion, but then gradually converted to Christianity in the 19th to 20th centuries, where the arrival of the Dutch East Indies government and European missionaries played an important role in the region.\nHistory\nBefore the founding of the Lore Kingdom in the current Poso Regency, it is believed that the Raba Kingdom had already existed. The name Raba is interpreted as 'land that descends' or literally can be interpreted as 'the area that forms a valley in the Pekurehua region'. According to folklore, the capital of the Raba Kingdom was in Lamba. The first king of the Raba Kingdom was named Raba and his wife was named Waba.\nThe Raba Kingdom changed its name to the Pekurehua Kingdom, and then to the Lore Kingdom. After King Raba was based in Lamba, it is not known what the structure of the kingdom was like at that time. However, according to the Lore peoples, at the end of the 19th century, there were several influential nobles spread across several villages, among them are Nkai Abu (Umana Aso) in Habingka village, Nkai Sumpi in Watutau village, and Nkai Rabeta (Umana Tosende). The story about King Lore begins when Ngkai Abu's son, Pantula, married Ngkai Rabeta's daughter, Poindo, then from the couple gave birth to five children, namely:\n* Tado (Umana Lolo), captured by the Dutch and exiled to Manado (male)\n* Inana Ngela (woman)\n* Inana Do'u (woman)\n* Polite (woman)\n* Makada, died in the Peore War in July 1907 (male)\nWhen Umana Lolo was captured by the Dutch and his whereabouts were unknown at that time, and when Makada, the last son died in the Peore War, so there were only three daughters, one of them was Polite, who was later known as the mother of Ngkai S. Kabo, who was appointed by the Dutch East Indies government as King of Lore.\nThe place where the Lore Kingdom was founded was on land with an altitude of between 700 and 1,700 meters above sea level, the area is divided into Napu Valley, Behoa Valley, and Bada Valley. These three regions are known collectively as \"Land of Lore\" (Tanah Lore). In this area there are many megalithic sites which are ancient relics of historical value. The inhabitants of the region are known as To Lore 'people of Lore', sometimes also referred to as Pekurehua in the northern region (Palu Bay). Of these three regions, there are four linguistically distinct ethnic groups, including Sedoa people in Sedoa Village (North Lore), Napu people in Napu Valley (North Lore), Behoa people (Central Lore), and Bada people (South Lore).\n, which is generally known as Greater Lore.]]\nAfter several centuries, the Land of Lore was under the rule of the Sigi Kingdom which was centered in the Palu Bay area. However, since the arrival of the Dutch East Indies government in 1903, to unite the three valley regions which already had their own monarchical governments, the Dutch East Indies government appointed a king (magau) under Dutch influence. At that time, the three valley regions began to separate from Sigi by forming the Lore Kingdom centered in Wanga, led by its first king, Ngkai S. Kabo, and his wife named Mpolite. Since then, administratively, the territory of the Lore Kingdom was included in Onderafdeling Poso.\nList of rulers\nThe following is a list of rulers of the Lore Kingdom who held the title of raja or magau.\n*Ngkai S. Kabo (1903–unknown; appointed by the Dutch East Indies government as King of Lore)\n*Don Radius Gerald Kabo (unknown)\nSee also\n*Kulawi Kingdom\n*Sigi Kingdom\n*Lore peoples\n*Poso Regency\n*History of Indonesia during the era of Christian kingdoms\nReferences"
    }
  ]
}