{
  "content": [
    {
      "type": "text",
      "text": "# Los Warahuaco\n\n}}\nLos Warahuaco is a Colombian musical group and one of the most recognized in the field of tropical music.\nHistory\nFounded in Cartago (Valle del Cauca) in 1982 by Hernán Rojas, when he returned to Colombia after twenty-seven years of musical career in Argentina with the group Los Wawancó. His first public presentation was made on August 7 of the same year in the city of Pereira. There, they participated in the first Festival of Orchestras as part of the celebration program. A year later, Los Warahuaco won the second Festival of Orchestras and embarked on their first tour to the United States and Canada. They would repeat this tour on several occasions, alternating with performances in Colombia and Ecuador.\nDuring the 1980s, Los Warahuaco achieved great success in markets like Mexico, Peru, Paraguay, Uruguay, the United States, Venezuela, Ecuador, Chile, and of course, Colombia. Their songs, including \"El pescador de Barú\", considered the anthem of tropical music, \"El canoero,\" \"Enamorando,\" \"He nacido para amarte,\" and \"El piragüero,\" among many others, became hits. In later years, Los Warahuaco gained popularity in the European market, receiving a warm reception in countries like Spain and France.\nIn 1996, the song \"La Tuna\" was nominated for Song of the Cali Fair, and a year later, it was chosen as the Official Song of the Cartago Festival.\nIn the year 2000, they embarked on a tour in France, followed by another tour in the United States in the early months of 2001.\nAfter the death of Hernán Rojas on October 7, 2001, his wife, Victoria Eugenia Gómez, took charge of continuing the group's legacy. Los Warahuaco continued their musical activities with frequent performances at major fairs and festivals in Colombia, such as the Cali Fair, the Manizales Fair, the Blacks and Whites' Carnival, and others.\nIn 2004, Los Warahuaco traveled to Europe again, this time to perform in Spain.\nIn 2007, the Town Council of Cartago awarded Los Warahuaco a Special Mention \"For fulfilling their silver wedding, exalting the folk and musical values of our city nationally and internationally.\" Additionally, on the occasion of the orchestra's twenty-fifth anniversary, the Departmental Assembly of Valle del Cauca issued a resolution honoring Los Warahuaco \"in recognition of their career path in service to the cultural development of Valle del Cauca and their contribution to the positive image of Colombia worldwide.\"\nCurrently, Los Warahuaco continues to actively perform under the direction of Alejandro Rojas, son of Hernán Rojas.\nDiscography\n{| class=\"wikitable\"\n!Album\n!Year\n!Discography\n|-\n|El pescador de Barú\n|1982\n|Discos Fuentes\n|-\n|El canoero\n|1983\n|Discos Fuentes\n|-\n|Enamorando\n|1985\n|Discos Fuentes\n|-\n|Lo mejor de Hernán Rojas y Los Warahuaco\n|1986\n|Discos Fuentes\n|-\n|16 cumbias, cumbias..\n|1990\n|Discos Fuentes\n|}\nFilmography\n* Clear and Present Danger (music) (1994)\nReferences\nExternal links\n* [http://www.loswarahuaco.com Los Warahuaco's official website]"
    }
  ]
}