{
  "content": [
    {
      "type": "text",
      "text": "# Lost Battalion (World War I)\n\n| command_structure = 77th Division\n| garrison = Argonne Forest, France\n| garrison_label = Headquarters\n|battles = World War I\n* Meuse-Argonne Offensive\n| commander1 = Maj. Charles W. Whittlesey\n| commander1_label = Commanding Officer\n}}\nThe Lost Battalion is the name given to the nine companies of the US 77th Division, roughly 554 men, isolated by German forces during World War I after an American attack in the Argonne Forest in October 1918. Roughly 197 were killed in action and approximately 150 missing or taken prisoner before the 194 remaining men were rescued. They were led by Major Charles W. Whittlesey.\nOn 2 October, the 77th division launched an attack into the Argonne, under the belief that French forces were supporting their left flank and two American units including the 92nd Infantry Division were supporting their right. Within the 77th sector, some units, including Whittlesey's 308th Infantry, were making significant headway.  Unknown to Whittlesey's unit, the units to their left and right had been stalled. Without this knowledge, the units that would become known as the Lost Battalion moved beyond the rest of the Allied line and found themselves surrounded by German forces.  For the next six days, suffering heavy losses, the men of the Lost Battalion and the American units desperate to relieve them would fight an intense battle in the Argonne Forest.\nThe battalion suffered many hardships. Food was scarce and water was available only by crawling, under fire, to a nearby stream. Ammunition ran low. Communications were also a problem, and at times they would be bombarded by shells from their own artillery.  Attempts to resupply the battalion by airdrop failed, with all the supplies going off target, either getting lost in the woods or falling into German hands. As every runner dispatched by Whittlesey either became lost or ran into German patrols, carrier pigeons became the only method of communicating with headquarters. In an infamous incident on 4 October, inaccurate coordinates were delivered by one of the pigeons and the unit was subjected to friendly fire. The unit was saved by another pigeon, Cher Ami, delivering the following message:\nWe are along the road  276.4. our artillery is dropping a barrage directly on us. For heavens sake stop it.\nDespite this, they held their ground and caused enough of a distraction for other Allied units to break through the German lines, which forced the Germans to retreat.\n77th Division\n.]]\nThe men of the 77th Division, who held the Charlevaux ravine, which became known as the \"pocket\", were mostly from New York City. The 77th Division is known as the \"liberty\" division due to the Statue of Liberty patch they wore, but in WWI they were usually referred to as the \"Metropolitan\" division because of where most of the men hailed from. Most of the enlisted men were recent immigrants or were poor working class from the streets of New York City fighting from a young age for food. These attributes acquired on the streets are seen by some historians as one of the reasons that this group survived in the Argonne.\nThe 77th Division was trained at what became a prestigious camp called Camp Upton, located in Suffolk County on Long Island. Charles Whittlesey, an East Coast lawyer, was assigned as a battalion commander in the 77th upon completion of his officer's training. The camp was located a half mile from the town of Yaphank, New York. \"Yaphank, where the hell is Yaphank?\" was a common expression heard among the new recruits of Camp Upton.\nCompanies involved\nWhile universally known as the \"Lost Battalion\", this force actually consisted of companies from 4 different battalions – A, B, C Companies of the 1st Battalion 308th Infantry Regiment (1-308th Inf); E,G, H companies of the 2nd Battalion 308th Infantry (2-308th Inf); K Company of the 3rd Battalion of the 307th Infantry Regiment (3-307th Inf); and C, D Companies of the 306th Machine Gun Battalion. All of these companies belonged to the 154th Infantry Brigade of the 77th Division and with a strength of approximately 545 men was a battalion-sized force.  Major Whittlesey was the battalion commander of 1-308th Inf, the senior officer present, and he assumed command of the entire force once he realized it was surrounded.\nArgonne Forest before the attack\nThe Argonne Forest was seized by the Germans at the early stages of the war. They had set up defensive positions throughout the forest, using a string of networked trenches. These defences started with a roughly  deep front line which \"served as not much more than an advanced warning system\". Beyond the first line, which consisted of trenches, shell holes, and listening posts, the Allies would have to push through the dense forest to the main battle lines. The next battle line, which was about  in depth, had turned back all other Allied attacks over the last four years. This battle line, which consisted of wired trenches that were firmly held, was referred to by the Germans as \"Hagen Stellung\" (\"Hagen position\"). The next German battle line, referred to as the \"Hagen Stellung-Nord\" (\"Hagen position-North\"), was \"basically a machine-gun-covered, pre-sighted artillery target.\" This was a very well entrenched location utilizing both natural and man-made barriers. Together, these two battle lines formed what was known as \"Etzel Stellungen\" (\"Etzel positions\").\nThe Hagen Stellung-Nord formed the most difficult problem. Over the years, the Germans had pre-sighted every square inch of the area in case of a hostile takeover. Should attackers take the Hagen Stellung-Nord, they came immediately into danger of annihilation by German artillery.  No occupier could remain there for long.\nThe Germans also spread barbed wire for hundreds of miles. At various points, it was higher than a man's head and several, even many, yards deep. The Germans also placed barbed wire at the bottom of rivers and small streams to prevent any troop movement across these areas.\nAction in the Argonne\nOrders\nin October 1918.]]\nThe Meuse-Argonne Offensive began on the morning of 26 September 1918. General Evan Johnson, the commander in charge of the Argonne part of the offensive, had a \"no retreat\" command for his divisions:\nIt is again impressed upon every officer and man of this command that ground once captured must under no circumstances be given up in the absence of direct, positive, and formal orders to do so emanating from these headquarters. Troops occupying ground must be supported against counterattack and all gains held. It is a favorite trick of the Boche to spread confusion...by calling out \"retire\" or \"fall back.\" If, in action, any such command is heard officers and men may be sure that it is given by the enemy. Whoever gives such a command is a traitor and it is the duty of any officer or man who is loyal to his country and who hears such an order given to shoot the offender upon the spot. \"WE ARE NOT GOING BACK BUT FORWARD!\" –General Alexander.\nOn 1 October, Whittlesey was given his orders: first, he was to advance north up the Ravine d’Argonne until it ended, at the Ravin de Charlevaux. Upon reaching it they were to continue across the brook and take the Charlevaux Mill. Behind this mill was the Binarville-La Viergette road. The securing of the mill was imperative to seize control of the road and a rail line that ran parallel to the north of it. This road was crucial because it allowed for the movement of supplies to the Allied soldiers. The railway was crucial because it would cut off one of the Germans’ major supply routes. The plan was to have the first battalion lead the assault, led personally by Whittlesey. They would be supported by the second battalion, led by Captain McMurtry. Just after 5:00 pm on that evening the attack came to a halt and the men dug in for the night.\nOn the morning of 2 October, the final orders came at around 05:00. The main objective was still the Binarville-La Viergette road. The attack was to start at 07:00, to give time for the fog to lift and the men to eat. Whittlesey and McMurtry ordered Companies D and F to remain along the western ridge to become a containing force. The rest of the first and second battalions would continue along a prominence known as \"Hill 198\" to complete a flanking maneuver on the enemy. The problem was that on the hill there was a double trench line of German soldiers. The plan was that once the two battalions took the hill they would then send back companies E and H to create a line to Companies D and F.\nThe attack and encirclement\nBy the night of 2 October, after a long day of fighting, Major Whittlesey received information that the men had found a way up the right of Hill 198. At around this same moment the French experienced a massive counterattack by the Germans and were forced to fall back, exposing the left flank of the 308th. The same occurred on the right flank with the other American Division, causing the 308th to be outflanked on both sides. However, they did not discover this until shortly after they reached the peak of Hill 198. The hill was now in their control; however, it was too quiet for Whittlesey. He realized that he could hear nothing of the 307th that was supposed to be on their flank. \"Either they had broken through the line as well and reached their objective over there, or they had been licked and fallen back. The former would be good news for the 308th ... The latter, however, was unthinkable; orders forbade it...\"\nWhile this was happening, to the rear of the main action George W. Quinn, a runner with the battalion, was killed while attempting to reach Major Whittlesey with a message from Whittlesey's adjutant, Lieutenant Arthur McKeogh. Whittlesey earlier in the day had sent McKeogh back about  with 15 men with light machine guns to silence German machine gunners who had cut communications between Whittlesey's battalion and the American rear during the night. The Germans were taking ground from which they could surround Whittlesey's men. McKeogh's undelivered message asked for a mortar to use against the strong German position. Quinn was found four months later to have killed three German soldiers who had mortally wounded him before he could reach Whittlesey.\nThe men dug in on Hill 198 and created what is known as \"the pocket\" in what was a fairly good defensive position. The two best companies were on the flanks, with support from the weaker companies. A single company took up the front of the pocket. The rear was the least protected from attack and was defended by only a few riflemen and several machine guns. The hill sloped steeply from the front of the pocket, making it difficult for Germans to bomb the battalion from that direction. The biggest flaw in their position was that their holes were dug too close together, and too many men were occupying the holes at the same time. This created easy targets for mortars and snipers. By about 22:30, Whittlesey realized that Hill 205 was still occupied by the Germans on the left, and the ravine to the right was also full of enemy soldiers.\nThe morning of 3 October was spent trying to re-establish contact with the flanks and with the companies that were left behind. Whittlesey sent out runners to the French and American units that were supposed to be on his flanks. None of the runners returned, neither from the flanks nor from trying to connect with the companies that Whittlesey had left behind. All were killed or captured by the enemy. The more time that passed without any messages the more Whittlesey was coming to the conclusion that they were actually surrounded. However, the Germans were not attacking; the German forces within the ravine believed that they were outnumbered by the Americans.\nGerman counter-attack\nThat afternoon, the Germans attacked from all sides. \"A single one up front might not have been so bad, but there were others on the flanks, and sniper fire ringing out as well.\" At this time, Captain Holderman, an officer working with Whittlesey, realized the predicament that the men were in. The German forces had nearly doubled and were closing in on them. Their communication line was cut and so they could not receive supplies of food or ammunition. Holderman tried to lead an assault out through the back of the pocket, but failed to break out, incurring heavy casualties in the process. This infuriated Whittlesey, but seeing that there was nothing he could do he simply sent the survivors back to their defensive positions. Next came a grenade assault followed by mortars raining in on them, but the Americans did not stagger. Another attack came a little after 17:00, and it lasted for about 45 minutes. After this attack was over, the Germans began to settle down for the day. The Americans had suffered many casualties, but inflicted similarly heavy losses on the attacking Germans.\nOn the morning of 4 October, patrols were sent out on their morning routes, and Whittlesey was unsure that any of the carrier pigeons had actually made it through. He was unsure if command actually knew of the desperate situation that was unfolding. Whittlesey believed that his orders to hold this position still applied, because the position was the key to breaking through the German lines. There has been much controversy among different historians regarding how it occurred, but Whittlesey and his men were shelled by their own artillery. Some believe that Whittlesey had relayed the wrong coordinates, while others believe that Whittlesey had gotten the coordinates right and the artillery's aim was off; however it happened, the truth was that they had advanced to the North slope of the Charlevaux Ravine while the artillery thought he was on the South slope. Around 3:00, when the shelling continued, Whittlesey wrote a note reading,\n276.4. Our artillery is dropping a barrage directly on us. For heavens sake stop it.|source=}}\nHe gave the note to Private Omer Richards, who placed it in a capsule and took one of two remaining pigeons from his pigeon basket. A nearby shell surprised the two, and the pigeon escaped. Richards then took the last pigeon, purportedly Cher Ami, tied the message to his right leg, and released it.\nAllegedly, Cher Ami landed a short distance away on a branch. The Americans attempted to shoo the bird on, but he did not continue on until Richards climbed the tree and shook the branch. As Cher Ami tried to fly back home, the Germans saw him rising out of the brush and opened fire.He was shot down but managed to take flight again. He arrived back at his loft at division headquarters 25 miles (40&nbsp;km) to the rear in just 25 minutes, about 5 minutes after the shelling had ceased.\nAs soon as the Allied shelling had stopped, the Germans launched an attack. After many losses and much hand-to-hand combat, the German forces were driven back once again. Although many had been killed or captured, the unit still remained intact, but morale was low and sickness was setting in. Many men only had a few bullets left and no food. Bandages were being taken off of the dead and reused on the wounded. A package was reported to have been dropped in for the men to resupply, but all reports point to it falling into German territory. Water was accessible, but getting to it required exposing oneself to German fire.\nFrom 5–8 October, the Germans continued to attack. They also sent messengers asking for the 308th to surrender. Whittlesey did not respond. There were many controversies at the time as to what he had done, but records indicate that he said and did nothing. At least one surrender demand carried by an 18-year-old soldier, captured by the Germans and then released to carry the message, said \"the suffering of your wounded men can be heard over here in German lines, and we are appealing to your humane sentiments to stop....please treat (the messenger) as an honorable man. He is quite a soldier. We envy you.\" The same memoir states that Whittlesey wrote in his official Operations Report in capital letters, \"No reply to the demand to surrender seemed necessary.\"\nThe attacks to relieve the \"Lost Battalion\"\nWhile Whittlesey and his men tenaciously defended their position, their parent 154th Brigade and the entire 77th Division launched a ferocious series of attacks to get to them.  But with each attack, these efforts grew weaker and weaker as the combat power of the 77th ebbed.  In the first four days of these attacks, the rest of the 308th infantry alone lost 766 men.\nThe news of the Lost Battalion's dilemma reached the highest levels of AEF command.  While the 77th's power ground down, a powerful U.S. force under General Hunter Liggett's I Corps (United States) was being put together. The veteran 28th Infantry Division was oriented to reach Whittlesey and the fresh 82nd Infantry Division was moved to reinforce the 28th's flank.  Meanwhile, Pershing ordered Liggett reinforced by the 1st Infantry Division \"The Big Red One\" which had received some replacements and some rest after St Mihiel.\nObserving the movement of the 1st Division, the Germans ordered a Prussian Guards Division to reinforce their forces in the sector. The Germans also sent an elite battalion of \"stormtroopers\" reinforced with flamethrowers to aid the infantry attacking Whittlesey.\nFor the next few days, the pocket held firm. The powerful American attacks started to push the Germans back and the 77th Division began trying to infiltrate troops into the pocket. Whittlesey, meanwhile, asked for a volunteer to sneak through the lines and lead back help. Private Abraham Krotoshinsky undertook this mission and skillfully left the pocket by a circuitous route to the north which ultimately led to an infiltrating company of the 307th Infantry. Krotoshinsky acted as a guide to lead this group to help rescue the trapped company and establish a route for further fresh troops to come into the pocket. Thus, on 8 October, the 77th relief force had linked up with Whittlesey's men. Immediately upon their relief, Whittlesey was promoted to lieutenant colonel.\nAftermath\non Fifth Avenue, New York City (1919)]]\nOf the over 500 soldiers who entered the Argonne Forest, only 194 walked out unscathed. The rest were killed, missing, captured, or wounded. Major Charles W. Whittlesey, Captain George G. McMurtry, and Captain Nelson M. Holderman received the Medal of Honor for their valiant actions. Whittlesey was also recognized by being a pallbearer at the ceremony interring the remains of the Unknown Soldier.\nFormer Major League Baseball player, and Captain in the 77th Division, Eddie Grant, was killed in one of the subsequent missions in search of the battalion. A large plaque was placed in the center-field wall at the Polo Grounds New York in his honor.\nBrigadier General Billy Mitchell wrote after the rescue that the Germans had managed to prevent supplies being air-dropped to the battalion. He ordered:\n...chocolate and concentrated food and ammunition dropped.... Our pilots thought they had located it from the panel that it showed and dropped off considerable supplies, but later I found out they had received none of the supplies we had dropped off. The Germans had made up a panel like theirs and our men had calmly dropped off the nice food to the Germans who undoubtedly ate it with great thanksgiving....\nA&E made a 2001 film about the event, The Lost Battalion.\nSwedish power metal band Sabaton wrote the song \"The Lost Battalion\" for their 2016 album The Last Stand.\nCitations\nMedal of Honor:\n* Maj. Charles W. Whittlesey (Commander, 1-308th Inf )\n* Capt. George G. McMurtry (Commander, 2-308th Inf)\n* Capt. Nelson M. Holderman (Commander, Company K, 3-307th Inf)\n* 1Lt. Harold E. Goettler (Pilot, 50th Aero Squadron)\n* 2Lt. Erwin R. Bleckley (Observer, 50th Aero Squadron)\n* Sgt. Benjamin Kaufman (Company K, 3-308th Inf)\n* Pvt. Archie A. Peck (Company A, 1-308th Inf)\nDistinguished Service Cross:\n* Pvt. William Begley\n* Sgt. Raymond Blackburn\n* Pvt. George W. Botelle\n* Pvt. James W. Bragg\n* Pvt. Clifford R. Brown\n* Pvt. Philip \"Zip\" Cepaglia\n* 1Lt. William J. Cullen\n* Cpl. James Dolan\n* Cpl. Carmine Felitto\n* Pvt. Joseph Friel\n* Pfc. Jack D. Gehris\n* Sgt. Jeremiah Healey\n* Cpl. Irving Klein\n* Pvt. Stanislaw Kosikowski\n* Pvt. Abraham Krotoshinsky\n* Cpl. Leo J. Lavoie\n* Pvt. Irving Louis Liner\n* Pvt. Henry Miller\n* Cpl. James J. Murphy\n* Cpl. Holger Petersen\n* Pvt. Frank J. Pollinger\n* 2Lt. Harry Rogers\n* Cpl. Haakon A. Rossum\n* Cpl. Joseph C. Sauer\n* 2Lt. Gordon L. Schenck\n* Pfc. Irving Sirota\n* Pvt. Sidney Smith\n* Pvt. Albert E. Summers\n* 1Lt. Charles W. Turner\n* Pfc. Samuel D. Grobtuck\n* First Sgt. Herman J. Bergasse\nSilver Star:\n* 2Lt. Sherman W. Eager\n* Sgt. Bernard Gillece\n* Pvt. Frank G.S. Erickson\nSee also\n* Cher Ami, one of the carrier pigeons used during the battle\n* Meuse-Argonne Offensive\nReferences\nBibliography\n* Frisbee, John. \"[http://www.airforcemag.com/MagazineArchive/Documents/1984/1284valor.pdf Valor: Valley of Shadow]\". Air Force Magazine (December 1984):183.\n* Holman, John. \"[https://books.google.com/books?id=9jEcAQAAMAAJ&q=whittlesey&pg=PA4 Lieut.-Col. Charles W. Whittlesey]\". National Service (January 1919): 21, 62.\n*\n* McCollum, Lee Charles. History and Rhymes of the Lost Battalion.  Columbus, Ohio: 1929.  First person memoir.\n* Slotkin, Richard. Lost Battalions: The Great War and the Crisis of American nationality. New York: Holt, 2005.\nFurther reading\n* Adler, Julius Ochs (ed.). [https://archive.org/details/cu31924027817976  History of the Seventy Seventh Division, August 25th. 1917 – November 11th. 1918]. New York: The 77th Division Association, 1919. Pages 199–207 are devoted to a description of the \"Lost Battalion\".\n*\n* Johnson, Thomas M., and Fletcher Pratt. The Lost Battalion. Lincoln: University of Nebraska Press, 2000.\n* Klausner, Julius Jr. Company B, 307th Infantry: Its History, Honor Roll and Company Roster. New York: Burke-Kelly American Legion Post No. 172, 1920.\n*\n*\n* McKeogh, Arthur. ''[https://archive.org/details/victoriousthdiv00mckegoog  The Victorious 77th Division (New York's Own) in the Argonne Fight]. NY: John H. Eggers, 1919.\n* Miles, L. Wardlaw. History of the 308th Infantry, 1917–1919''. New York: G.P. Putnam's Sons, 1927.\n* Rainsford, Walter Kerr. [https://archive.org/details/fromuptontomeus01raingoog From Upton to the Meuse with the Three Hundred and Seventh Infantry]. New York: Appleton, 1920. Rainsford was commander of Company M, and later of Company L, of the 307th. This book contains a detailed account of the \"Lost Battalion\" in Chapter X (pages 195–224).\n* [https://books.google.com/books?id=0_tEAAAAYAAJ&q=Through+the+War+with+Company+D%2C+307th+Infantry Through the War with Company D, 307th Infantry, 77th Division]. New York: 1919.\n* Whittlesey, Charles W. and George G. McMurtry. \"The Epic of the Lost Battalion\". The New York Times, 30 September 1928.\n* Yockelson, Mitchell. ''Forty-Seven Days: How Pershing's Warriors Came of Age to Defeat at the German Army in World War I''. New York: NAL, Caliber, 2016.\nExternal links\n* [http://www.omaha-beach.org/Travel/LOB/LOB.html Pictures of the area in 2005 by Martin Galle]\n* [https://web.archive.org/web/20071224072847/http://www.longwood.k12.ny.us/history/upton/ray.htm Personal account of private Ralph E. John]\n* [https://www.imdb.com/title/tt0287535/ The IMDB page]\n* [http://www.lettersofnote.com/2010/05/for-heavens-sake-stop-it.html Example letter delivered via carrier pigeon in October 1918]\n* [http://www.militarymuseum.org/LostBn.html California and the Lost Battalion]\n* [http://memory.loc.gov/diglib/vhp/story/loc.natlib.afc2001001.101358/ Diary of Private Irving Greenwald], Irving W. Greenwald Collection (AFC/2001/001/101358), Veterans History Project, American Folklife Center, Library of Congress\n*[http://dlib.nyu.edu/findingaids/html/nyhs/ms3155_lost_battalion/ David Tulchin papers] at the [https://www.nyhistory.org/library New-York Historical Society]\n* [https://www.youtube.com/watch?v=3XUL_K2pVKI Robert Laplander speaking about the Lost Battalion and remembrance events since the battle]"
    }
  ]
}