{
  "content": [
    {
      "type": "text",
      "text": "# Lot 62, Prince Edward Island\n\n|area_total_km2           =  80.39\n|area_land_km2            =\n|area_water_km2           =\n|area_total_sq_mi         =\n|area_land_sq_mi          =\n|area_water_sq_mi         =\n|area_water_percent       =\n|area_urban_km2           =\n|area_urban_sq_mi         =\n|area_metro_km2           =\n|area_metro_sq_mi         =\n|population_as_of               = 2006\n|population_footnotes           =\n|population_note                =\n|population_total               = 540\n|population_density_km2         = 6.7\n|population_density_sq_mi       =\n|population_metro               =\n|population_density_metro_km2   =\n|population_density_metro_sq_mi =\n|population_urban               =\n|population_density_urban_km2   =\n|population_density_urban_sq_mi =\n|population_blank1_title        =\n|population_blank1              =\n|population_density_blank1_km2 =\n|population_density_blank1_sq_mi =\n|timezone               = AST\n|utc_offset             = -4\n|timezone_DST           = ADT\n|utc_offset_DST         = -3\n|coordinates            =\n|elevation_footnotes    =\n|elevation_m            = 0-39\n|elevation_ft           =\n|postal_code_type       =  Canadian Postal code\n|postal_code            = C0A\n|area_code              =  902\n|blank_name            = NTS Map\n|blank_info            = 011E15\n|blank1_name            = GNBC Code\n|blank1_info            = BAESW\n|website                =\n|footnotes              =\n}}\nLot 62 is a township in Queens County, Prince Edward Island, part of St. John's Parish. Lot 62 was awarded to Richard Spry, Esquire in the 1767 Land Lottery, and came to be settled through the efforts of Thomas Douglas, The 5th Earl of Selkirk in 1803. Richard Spry, Esquire, was then Commodore, Commander-in-Chief, Mediterranean Fleet at Gibraltar 1766–1769. Becoming the proprietor, he would be familiar with then the Island of St. John, having first come out to North America in 1754, with the English naval blockade of Ile Royal and the Fortress of Louisbourg in 1756, and then serving off Quebec and in the St. Lawrence into 1759. In 1762, he returned as Commander-in-Chief, North America, quartered in Halifax.\nThe Board of Trade and Plantations and Richard Spry, Esquire\nAt the end of 1763, Sir John Perceval, 2nd Earl of Egmont, and First Lord of the Admiralty, acting for a private syndicate of London elite, suggested, for the new Treaty of Paris (1763) possessions on the Island of St. John, a land settlement scheme encouraging trade and defence, along the lines of a feudal tenancy.  This the 'Egmont Scheme' was soundly rejected, strongly opposed by 'The Lords Commissioner for Trade and Plantations', so an alternative scheme offered by 'The Board of Trade' was taken up, late in 1764, and in revision came to be approved by The King's Privy Council of the United Kingdom.  However, The Board of Trade Scheme was not acted upon until 1767, with the granting by lottery of the lands of the Island of St. John, to individuals having claims upon the government.\nEven with well-defined, and 'strict' conditions of settlement there were more many 'individuals' than just the Egmont syndicate, interested in a grant of proprietorship, than there were lots available, so The Lords Commissioner for Trade and Plantations, devised their 1767 lottery to be organized by ballot, for candidates vetted and approved by The Board of Trade.\nThe Journals of the Board of Trade and Plantations, Volume 12: January 1764 - December 1767.    Journal of July 1767 - Volume 74, Folio No. 256 - Thursday, July 23, 1767, states:\n\"The following distribution of the lots or townships in the Island of St. John, according as they were mentioned upon the map or survey of the island, was this day decided upon in their lordships' presence by ballot, in the form and manner set down in the minutes of the 8th instant, several of the said proponents or their agents attending, vizt.\"   They granted: Richard Spry, Esquire - Lot 62.\nIn addition to being divided into lots, each lot having been commodified as to its potential market value, having their rent set on an economic value.  The financial obligation being: \"That the quit rents, to be reserved on the several lots, be more, as near as may be, proportioned to the value of the lands\".  Specifically, a \"quit rent of 4s per 100 acres was reserved\" on Lot 62.\nSo, what did Richard Spry, Esquire, get in Lot 62, as quantified by Samuel Holland's in notes attached to his survey?  As to the \"Quality. The soil in most cases is bad, the woods in general very bad. Approximately 10 acres of cleared land and two houses.\" With noted \"Remarks.  There are some good Marsh which would do very well for pasture or produce a good deal of hay. It is too far from the Fishing ground to have any advantage in the respect.\"\nSir Richard Spry, His Heirs: Mary Davy and Thomas Davy (Captain RN)\nAfter a full thirty-five years on active service, as then Sir Richard Spry, Rear-admiral of the red, he died unmarried, on 25 Nov 1775, at Place House, in St Anthony in Roseland, Cornwall.  Sir Richard's estate passed to his sister Mary and her son Thomas Davy, Captain RN, they, as coheirs assuming proprietorship of Lot 62. As an heir, honouring his uncle, Captain Davy took on the surname and arms of Spry, becoming Captain Thomas Spry, in April 1779, remaining in active service until 1783. While serving as a county magistrate, and standing as a reserved list Vice-Admiral of the Blue, in 1799, the Spry's Lot 62, amongst many, was noted, in default for the third time, as the subject of no effort to satisfy the 1767 Lottery 'Conditions of Settlement' - and became open to consideration for escheat.\nSharing proprietorship of Lot 62, from 1775, the question may be why would Spry's heirs fail in their obligations of proprietorship for Lot 62.  There are two early possibilities, they being pressed by the Legislative Assembly of Prince Edward Island, stemming from the principal conditions in the lottery.  A first possibility is for failure to settle, the lot reverting to the Crown, for their not arranging for the required number of settlers, within the laid down ten-year deadline; or forfeiting the lot, under conditions of Distraint, for failing in the first four years to settle even one third of the lot.  Arguing for Escheat, a text published by John Stewart, in 1806, recalled that Lot 62 had previously been the subject of no effort to satisfy the conditions of settlement; 1769: Lot 62 – \"Nothing Done\", 1779: Lot 62 – \"Nothing Done\" (Report of Settlement Progress 1769 to 1779), and 1797: Lot 62 – \"Not One Settler Resident There On\" (House of Assembly Resolution Notes).\nA second possibility is that Sir Richard's estate, and heirs may not have had any interest in paying, speculating on an eventual sale, without any actual investment, or not having the means to pay their Quit-rent and it was lost for none payment of arrears.  The annual charge to Lot 62, from 1767, at 4s per 100 acres, being £40, accumulating as debt, up to 1797, would amount to an arrear of £1,200.  The move to have lands forfeited for non-payment of Quit-rent became very much a political issue in PEI, this long after the initial deferral of all Quit-rent in the first five years, of the grant, and their half reduction into the first ten years.\nActually protected from Distraint and Escheat, by London, it is most likely that Lot 62 was 'simply' sold to discharge the accumulating debt, a land speculation inherited from an uncle, an investment gone bad.  The Spry estate would have long heard of actions of the PEI Lieutenant-Governor and House of Assembly, pressing on the Secretary of State for the Colonies and the Home Government, in its efforts to finally act on Quit-rent arrears.  As in 1802, the Home Government classified Lot 62, as a 'township wholly unoccupied', and the proprietors were deemed obligated to pay fifteen years Quit-Rent, in lieu of all arrears, up to 1 May 1801. Noted as a great relief and an encouragement to sell, with a considerable reduction, having to pay £600 on a debt of now £1,340, and getting money in a sale, the Spry heirs were probably most anxious to dispose of their 20 000 acres, as were others, as nearly one third of the unsettled PEI lots were sold and transferred, in 1803.\nThe Scottish Highlanders and The 5th Earl of Selkirk\nThomas Douglas, 5th Earl of Selkirk was born on 20 June 1771, and in Canada, he is most noted as the Scottish patron who sponsored the settlement at the Red River Colony in Manitoba (1811).  This following a settlement scheme first tried in Prince Edward Island (1803), and a second in Upper Canada (1804). The 5th Earl of Selkirk died on 8 April 1820, in Pau, France, where he is buried.\nAlways favouring large-scale emigration, having advanced his views repeatedly and with enthusiasm, in the winter of 1801/02, Selkirk first put forward to the Colonial Office his belief of the need to provide new challenges to the catholic population of an oppressed Ireland.  Soon recognizing that the government would not countenance the resettlement of Irish immigrants in America, Selkirk offered in the alternative the emigration of Protestant Scottish Highlanders.\nAgain unable to interest the British government in approving settlement in Western Canada, he then seen to be acting against the interests of the Hudson's Bay Company, Selkirk turned to Upper Canada. In this second initiative he faced a 'provincial' government, from the outset, that was inherently hostile to the introduction of a major absentee landholder, into their colony. Selkirk quickly saw the elite of Upper Canada were unsympathetic to any of his proposals, and consequently, his second Canadian scheme was not to soon be realized, when the Colonial Office refused to sanction the scheme.  After furious activity on his part, early in 1803, having recruited his Highlanders in 1802–1803, the Home Office allowed they might look favourably on a settlement on Prince Edward Island, where unsettled lands could be had cheaply, without involving the Colonial Office, or the Colony.\nComing to understand the Island, learning of its potential through John Stewart, with arranged purchases from private proprietors, by July 1803, his first expedition had set out.  Despite the lateness of the first season (for clearing of land or planting), with hindrances and disputes over land preferences, by the time he left in late September 1803, his PEI settlers were well on their way to being properly established.\nLot 62 The Early Selkirk Settlements\nThe first documented European visitor to Lot 62 was Thomas Douglas, 5th Earl of Selkirk who observed of his 'visits' in his extensive and detailed diary.  He suggests, of his first visit, of Monday, 8 August 1803, that he had perhaps been over-sold on Lot 62, like many others taking it over sight unseen.\n\"At one place, I went a little into the wood, & saw large stumps – I learnt on arriving at Charlotte Town, that all this coast had been laid waste by a great fire 30 or 40 years ago: – The soil however appears very poor sand.  This is Lot 62, & does not seem to answer the high description J: S: gave of this quarter of the Island – perhaps the inland part might be better:\"\nPreparing to leave the Island, after seeing to the settlement of his summer arrivals, making his way to Nova Scotia, he reflects more positively, of Lot 62, in his entry of 18 September 1803.\n\"Day light found us very near the spot where I first landed on the Island, we continued with the Ebb along shore toward Wood Islands, under a high shore apparently much better land than we landed upon further west.  ... The land is good above the Bank – beech maple & birch with a few very Spruce, as on the North on Point Prim – This high ridge seems to continue all the way from Wood Islands inland to Belfast behind the low swampy ground which forms the coast towards Flat River –\"\nLot 62 had come to be owned by Lord Selkirk, who started its 'settlement' in 1803, as his first three chartered ships: The Polly (7 August 1803), The Dykes (9 August 1803) and The Oughton (27 August 1803) brought Scottish Highlanders, to the Island, some of whom found their way to Lot 62, and started two small communities that stand today.\nLot 62 - Belle Creek. Angus Bell, of Isle Colonsay, with wife, settled Belle River, PEI. Donald McDougall, a native of the Isle of Skye, with wife, settled Belle River, PEI.  Alex Martin, of Isle of Skye, settled in Belle River, he a petitioner for Dr. Macaulay in 1811. Alexander Stewart settled in Belle River, PEI. Alexander Nicholson, of the Isle of Skye, settling at Belle Creek. Charles Stewart, of Skye, with wife Mary McMillan, and children, settled in Belle River, PEI. Donald Stewart, of Skye, with wife Catherine Morrison, settled in Belle River, PEI.\nLot 62 - Wood Islands. Of the first arrivals and earnest settlers, Donald Gillis, a petitioner later for Dr. Macaulay in 1811, settled on Wood Islands Road.  Malcolm McIsaac, from Uist, Isle of Skye, located at Wood Islands, and Mrs Mackenzie (Elizabeth) settled on Wood Islands Road.\nThe Spencer: The Hebrideans of Colonsay 1806\nFollowing these first Selkirk arrivals to the Island, while facing new challenges in Upper Canada, he continued to arrange the recruiting and transit of settlers, to his growing Island estate, from Stornoway, Kintyre and Lockaber.  His agent in Scotland – James Robertson (The Recruiter), after The NORTHERN FRIENDS in 1805, was able to organize, sufficient emigrants for four ships into 1806.\nThe 'NORTHERN FRIENDS' of Clyde, coming from Stornoway arrived on 3 October 1805, a Brigantine of 245 tons, captained by Archibald McPherson, she brought 91 settlers from the Outer Hebrides and Wester Ross.  Listed as arriving at Flat River, many took up land on Lots 31 and 60, which Selkirk had only recently acquired, and others on Lot 62 at Belle Creek, Samuel Nicholson and John Cameron, and at Wood Islands, five families settled on 100-acre farms, there paying 2s per acre.\nThe 'RAMBLER' of Leith, coming from Mull, arrived on June 20, 1806, a Brigantine of 296 (294) tons, built in 1800, with Master: Captain James Norris.  It left the West Highlands and the Isle of Mull with 129 (130) passengers, seeing some settle on Lots 62 and 65, Donald Stewart, settled in Lot 62 and some onto Lot 58.  The 'HUMPHREYS' of London of 250 tons, built 1785 in Stockton with Master: Captain John Young of Tobermory, Mull carried passengers from the West Highlands and Islands of Mull and Colonsay. Arriving on 14 July 1806, with 96/97 passengers, some are noted as going to Lots 62 and 65. The 'ISLE OF SKYE' of Aberdeen, of 182 tons, newly built in 1806, with Captain John Thorn, of Liverpool, as Master, also arrived at Charlottetown in July 1806.  Coming from the West Highlands and Islands of Mull and Colonsay it carried 37 passengers, some settling on Lots 62 and 65.\nOn 22 September 1806, The \"SPENCER\" of Newcastle upon Tyne, a brigantine of 330 tons, built in 1778 in Shields, with Forster H. Brown as Master, reached Pinette Harbour where the Collector of Customs, William Townsend, enumerated 115 passengers.  Coming from Oban, Argyllshire, arriving late in the season, her passengers spent the winter at Pinette, with provisions and in quarters provided by Selkirk, and in the spring, they moved onto the Wood Islands and Lot 62. Most like Malcolm, Neil, James and Angus Munn negotiated contiguous lots of 100 acres along the road to Wood Islands. Although Neil Munn never developed his land and James operated a shipyard, the brother's acreage appear side by side on an early \"Plan of Township 62.\" As Selkirk wished, more emigrants followed the McNeills, McMillans and Munns, they a critical mass that exceeded sixty individuals, young and old, and more than half the emigrants from The 'SPENCER'. The McMillan's (of Clan MacMillan) coming originally from Colonsay in Argyle, on The 'SPENCER' had thought to settle in Little Sands, however, after setting their fishing nets at Wood Islands and rewarded with a bountiful catch, they decided to make their homes there.\nThe 1860 Sale: Through Estate Managers and Island Politicians\nSelkirk's separation from Prince Edward Island, with his focus on The Red River Colony, meant his agents on the Island were constantly improvising, dealing with misconceptions and criticisms, usually acting without direction.  Criticism of Thomas Douglas first came from his settlers, unhappy that he was not keeping promises, they dealing through his estate managers.  Of his son, Dunbar Douglas, 6th Earl of Selkirk, criticism came from the many factions in political engagement, with continuing questions of quit-rents, their fairness to tenants and of obligations of lot proprietorship.  From their first to their last estate manager, the Douglas's expected much of them, accustomed as they were to loyal Scottish subordinates, their managers instead acting independently, ignoring their interests and the estate's accounts, almost inevitably acquiring their own priorities, pretensions, and political ambitions.\nThe 5th Earl's first estate manager, James Williams, though arriving late on The 'OUGHTON', living in Charlottetown, was quick to take to his own interests.  Williams from the outset, continual drawing upon Selkirk's account, failed to report of his work, and by July 1806, offered Selkirk no return on his lands, in land sales, in rents or from commerce.  Worried about the finances, and the progress of his settlement, even late into 1809, with large arrears of advances to settlers, as well as returns from sales of land and timber, for paying of his quit-rents, Selkirk had received no reports. It is suggested Selkirk had thought to give up on the Island, though not immediately prepared to replace Williams, as he had to yet receive a report of his Island accounts, considering if possible to sell his holdings. It was not until May 1815, that an Island court ordered an 'attachment' on Williams, that was not to be followed up, Selkirk winning in Court but never recovering assets, and monies lost to his estate manager.\nThe focus of their Island managers, over seventeen years, for Thomas Douglas, up to 1820, and then forty years for Dunbar Douglas, up to 1860, it seems, to a man they did not place their charge, and the Selkirk interests, at the top on their priority list.  From the first, James Williams: 1803 to 1811, shortly by Charles Stewart: 1811 to 1813, and eventually William Douse: 1833 to 1860, there was always something more interesting politically and financially beneficial in which to engage.  An 1841 PEI census document reveals one valuable perspective on Dunbar Douglas, of his interest in continuing to settle Lot 62, that is not positive and infers progressive actions of the estate manager (William Douse) are all but missing.\n\"There are no persons in the township whose passage has been paid by the proprietor and the same may be said the other three townships [in this District] with the exception of five or six indentured servants brought out from Scotland in 1803 by the Earl of Selkirk, and who afterwards received small allotments of land for their services. A few of the young men employed in the shipyards belong to other parts of the country though they have been resident in the district for the last 8 or 9 months.  In this township there are several poor families who only arrived on the Island last fall and who have not yet taken up any land, some of whom will most probably settle in some other parts of the country in consequence of the little encouragement held forth to them by the proprietor's agent. In the rear of this township there are several new settlers who raised no crops. On the whole of the lot there is but one half-finished church, one grist mill frequently out of repair and one very indifferent school house. There are no brewing or distilling establishments.\"\nIf it were not for financial gain, and political advantage, William Douse, the last estate agent, holding a power of attorney from the 6th Earl, would show little interest in the good of the estate.  Douse found the time and benefit, from 1834, in representing the Third Electoral District, of Queens County, where in the House, he was noted as an uninspired member, who spoke only on routine business affecting his District.  In addition to numerous business engagements, Douse found the resources to become a landowner, in 1855, purchasing 14,000 acres from the 6th Earl, having negotiated his own price.  A self-serving endeavour, Douse acted seeing the rush to sell in the 1854 'private sale' of the Worrell Estate, perhaps to pre-empt later agitations to the Earl, and the 'attempting' of forced purchases by the government.\nWith a lack of financial return, on considerable outlays, with indifferent tenants, some refusing to pay their rents, a 'distracted' estate manager, knowing of the Worrell sale, it was perhaps finally the tensions falling out of 'Land Purchase Act', that would cause the 6th Earl to consider selling his PEI holdings.  In 1853, the Island's 'Land Purchase Act' sought to empower it to 'force' the purchase of estates from absentee proprietors, who had not met the financial responsibilities of their land grant, a first effort was unsuccessful as it could not be legally enforced, the proprietors could not be forced to sell, and the government lacked the funds for their purchase.\nPolitically astute, or prompted by Douse, perhaps intending to pre-empt the findings in the report of the 1860 Land Commissioners' Court, Dunbar Douglas, offered his holdings to the Island, embracing parts of Lots 53, 57, 58, 59, 60 and Lot 62, containing 62,059 acres, at a very reasonable rate, though much less than in the 'public sale' of the Worrell Estate.  Sold 'out and out' Dunbar got clear of it all, the bad land as well as the good, selling the 'unproductive land' on which he could not collect rent, but must pay quit-rents. With the sale he was done with keeping on an agent, to collect small sums to be paid in a period extending for 10 to 20 more years, while perhaps continuing to not see profit from other commercial engagements. Not knowing if his arrears of quit-rent of £12,000 to £14,000, were remitted or to be remitted, and forgiven, the offer was eagerly embraced and a large and valuable tract of 'province' became public property at the moderate cost of 6,586 17s 8d sterling or £9,880 6s 6d currency.  The purchase described as \"This fortunate purchase has been of immense service to that section of the country; brightening the hopes, and strengthening the energies of all; and pointing the way to the best solution of the Land Question in sections similarly situated.\"\nLot 62 Today's Demographics\nAccording to the Canada 2011 Census:\n*Population in 2011: 470\n*Population In 2006: 540\n*2006 To 2011 Population Change (%): -13.0\n*Total Private Dwellings: 308\n*Land Area (Square Km): 80.42\n*Population Density Per Square Kilometre: 5.8\n*Median Age Of The Population (Years): 48.1\n*% Of The Population Aged 15 And Over: 85.7\nLot 62 The Communities\nBelle River.  Formally known as 'Belle Creek' as a settlement of Lot 62, c. 1803. Surveyed by Holland, 1765 / Depicted on Jeffreys, 1775. Taking its name from the French name Belle rivière, meaning \"beautiful river\".  Canada's Department of the Interior map, 1914, misspells it as 'Bell river'. The Micmac name is: Mooinawa-seboo, meaning \"Bear river\". The Belle Creek PO opened in 1874 (with James Cook as the Post Master) and continues as the Belle River Post Office (C0A 1B0) today. Today, Belle River hosts two established businesses: 'Belle River Enterprises (1982) Limited' - serving fishers working the Northumberland Strait, and now export based Atlantic Soy Corp (2008).\nIris. Formally known as 'Pleasant Valley' from c1863, as a settlement of Lot 62 (and into Lot 63). The name Iris was given by Post Office department when service was opened, c1885 with Angus Beaton as the PM, the Iris PO closed in 1918.  Iris was adopted in Place Names of PEI, 1925, and confirmed on 25 April 1946.\nLittle Sands. A settlement of Lot 62 (and Lot 64), on Plan 1829.  The name was adopted in 1925, confirmed on 25 April 1946. Named for the sandy shore between Wood Island and High Bank, its Little Sands Creek flows south into the Northumberland Strait (also Dixon's Creek) and was served by the Little Sands Post Office from c1859 to 1915. Since 2012, Little Sands has hosted 'annually' 150 monastics, at a Buddhist monastery, which additionally welcomes over 200 lay practitioners.  In their interests, they have purchased numerous older farms in southern Kings and eastern Queens, to support a growing demand for vegetable organics.\nMount Vernon. Initially known as Rona as an early settlement of Lot 62 (and into Lot 60), named for a small island in the Scottish Highland island Hebrides. The Rona Post Office opened c1874 with N. McKenzie as the Post Master and saw the Rona School beginning in c1850.  Renamed, Mount Vernon by Canada Post Office Department, operating the Post Office until 1918, this new name was adopted on 25 April 1946. Since 1998, Mount Vernon has welcomed two large landowners: 'Wyman's (1998)' and \"Braggs: Oxford Frozen Foods' – growing and processing wild low-bush blueberries, for export off Island.\nWood Islands.  Wood Islands is community located on the Northumberland Strait, on the southernmost point of Prince Edward Island. Its historical 'status' designation as 'Wood Islands, Settlement' was changed to 'Wood Islands, Locality' - in 1972, when it became part of  Belfast District. While the islands are located on maps by Jacques-Nicolas Bellin: Karte Bellin, 1744: 'I a Bova';  Louis Franquet: Cartes Franquet, 1751: 'Isle a Bois'; as surveyed by Samuel Johannes Holland (1764–65), and as depicted by Thomas Jeffreys, 1775, they are corrected situated in the basin.  Today, Wood Islands maintains its farming and fishing pursuits, with perhaps more land rented out than Lord Selkirk had intended, now being strongly committed to the tourism pillar of the Island economic strategy.  The community, in addition to benefiting from the 'PEI Gateway East - Welcome Centre', and the Northumberland Ferries Limited berths and terminal, hosts: The Wood Islands Lighthouse; a Confederation Trail Entryway at the ‘Welcome Centre; Northumberland Provincial Park for overnight camping; and Wood Islands Provincial Park, a day use playground.\nReferences"
    }
  ]
}