{
  "content": [
    {
      "type": "text",
      "text": "# Lotnicze Warsztaty Doświadczalne__disambig_1\n\n| founder =\n| defunct =\n| fate =\n| successor = WSK No. 4 Warszawa-Okęcie\n| hq_location_city = Łódź\n| hq_location_country = Poland\n| area_served =\n| key_people =\n| products =\n| owner =\n| num_employees =\n| num_employees_year =\n| parent = Ministry of Communication\n| website =\n}}\nLotnicze Warsztaty Doświadczalne (LWD) was the Polish aerospace manufacturer and construction bureau, located in Łódź, active between 1945 and 1950. The name meant Aircraft Experimental Workshops. It was the first Polish post-war aerospace construction bureau.\nHistory\nLWD Szpak-4T – the first Polish post-war series plane\nJunak-3 in the Polish Aviation Museum\nWorld War II and German occupation destroyed the whole Polish aviation industry. After eastern Poland was liberated, in October 1944 a group of designers gathered in Lublin as a Design Bureau in the Ministry of Communication. It was directed by Aleksander Sułkowski, but Tadeusz Sołtyk became the main designer. In primitive conditions, the bureau started work on a utility aircraft, the Szpak-1. In early 1945 the construction bureau moved to liberated Łódź. On April 1, 1945, the bureau established the Aircraft Experimental Workshops (LWD), subordinated to the Ministry of Communication.\nThe Szpak-1 was not built, but LWD designed and built its development variant, the LWD Szpak-2 utility plane. It first flew on October 28, 1945, as the first Polish post-war plane. Only single prototypes of the Szpak-2 and Szpak-3 were built, but in 1947, PZL-Mielec built 10 Szpak-4 - the first Polish post-war plane to go into production.\nThe next design (also in 1947) was the LWD Żak, a two-seater touring and trainer plane. A series of 10 Żak-3 was built in LWD in 1948, plus prototypes of the Żak-1, Żak-2, and Żak-4.\nLWD's most successful design was a military and civilian trainer, the LWD Junak of 1948. Its improved variants, Junak-2 and Junak-3, were produced from 1951 in the WSK-4 Okęcie in Warsaw (a total of 252), although its further development was carried out outside of LWD. The LWD Zuch of 1948 was a civilian aerobatics and trainer variant of the Junak. It was a successful design, but only 7 were built in LWD because of lack of proper engines.\nLWD also designed the two-engine light transport plane LWD Miś of 1949, but it was not successful and was not produced. The last LWD design was the LWD Żuraw, a two-seater military liaison and utility high-wing plane prototype completed in 1951. It was not produced either.\nIn 1950 LWD was converted from a construction bureau and experimental works to a production factory and renamed WSK-6 (Wytwórnia Sprzętu Komunikacyjnego 6 - Communication Equipment Factory 6). This put an end to its activity. Soon it was disbanded because of too small production capabilities. Chief designer Tadeusz Sołtyk organized a new construction bureau in the Aviation Institute in Warsaw.\nAircraft\n{| class=\"wikitable sortable\"\n|-\n! Model name\n! First flight\n! Number built\n! Type\n|-\n|align=left| LWD Szpak\n|align=center| 1945\n|align=center| 3\n|align=left| Single engine monoplane utility airplane\n|-\n|align=left| LWD Żak\n|align=center| 1947\n|align=center| 13\n|align=left| Single engine monoplane touring airplane\n|-\n|align=left| LWD Junak\n|align=center| 1948\n|align=center| 1\n|align=left| Single engine monoplane trainer\n|-\n|align=left| LWD Zuch\n|align=center| 1948 or 1949\n|align=center| 7\n|align=left| Single engine monoplane aerobatic airplane\n|-\n|align=left|\n|align=center| 1949\n|align=center| 1\n|align=left| Twin engine monoplane transport\n|-\n|align=left| LWD Żuraw\n|align=center| 1951\n|align=center| 1\n|align=left| Single engine monoplane liaison airplane\n|-\n|}\nReferences\nFootnotes\nNotes\nBibliography\n*\nExternal links\n* [http://www.samolotypolskie.pl/samoloty/1714/126/Lotnicze-Warsztaty-Doswiadczalne Lotnicze Warsztaty Doświadczalne – Samoloty w Lotinctwie Polskim]\n* [http://polishpropellers.com/manufacturer/lotnicze-warsztaty-doswiadczalne-lwd-poland Lotnicze Warsztaty Doświadczalne LWD, Poland – Polish Propellers]\n* [http://www.polot.net/en/polish_aviation_industry_part_12 Polish Aviation Industry - Part 12 – Polot]"
    }
  ]
}