{
  "content": [
    {
      "type": "text",
      "text": "# Louisiana–Monroe Warhawks football\n\n| Image            = Louisiana-Monroe Warhawks wordmark.svg\n| ImageSize        = 250\n| AthleticDirector  = Bryant Vincent (interim)\n| HeadCoach = Bryant Vincent\n| HeadCoachYear    = 2nd\n| HCWins           = 6\n| HCLosses         = 7\n| Stadium          = Malone Stadium\n| StadiumBuilt     = 1978\n| StadCapacity     = 30,427\n| StadSurface      = FieldTurf\n| Location         = Monroe, Louisiana\n| NCAAdivision     = I FBS\n| Conference       = Sun Belt Conference\n| ConfDivision     = West\n| PastAffiliations = NJCAA (1931–1950)Independent (1951–1952)Gulf States (1953–1971)Independent (1972–1981)Southland (1982–1993)Independent (1994–2000)\n| ATWins           = 331\n| ATLosses         = 471\n| ATTies           = 8\n| BowlWins         = 0\n| BowlLosses       = 1\n| NatlTitles       = 1 (Div. I FCS): 1987\n| ConfTitles       = Southland: 4Sun Belt: 1\n| DivTitles        =\n| Heismans         =\n| AllAmericans     =\n| uniform          =\n| FightSong        = Cheer for Northeast\n| MascotDisplay    = Ace the Warhawk\n| MascotLink       =\n| MarchingBand     = Sound of Today\n| Rivalries = Louisiana (rivalry)Louisiana Tech (rivalry)\n| PagFreeLabel2    = Outfitter\n| PagFreeValue2    = Adidas\n| WebsiteName      = ULMWarHawks.com\n| WebsiteURL       = https://ulmwarhawks.com/sports/football\n}}\nThe Louisiana–Monroe Warhawks football (also known as ULM Warhawks, formerly competing as the Northeast Louisiana Indians) program is a college football team that represents the University of Louisiana at Monroe (ULM).\nWith a history dating back to 1931, ULM competes in the NCAA Football Bowl Subdivision (FBS), as a member of the Sun Belt Conference, and play their home games on campus at Malone Stadium in Monroe, Louisiana. Formerly known as the Indians, the Warhawks nickname was adopted in 2006.\nThey moved up to Division I-A (now FBS) in 1994. The Warhawks played in their first and only FBS bowl game in 2012, in the Independence Bowl in Shreveport, losing 45–14 to the Ohio Bobcats. Their thirteen-year drought is currently the longest among all NCAA Division I FBS teams.\nHistory\nEarly history (1931–1980)\nWhat is now Louisiana–Monroe originally competed as a junior college from 1931 through 1950. During the junior college era, the Indians were coached by J. Paul Kemerer from 1931 to 1933 and James L. Malone from 1934 onward. In 1951, the Indians completed their first season in the National Association of Intercollegiate Athletics (NAIA) as Northeast Louisiana State College. With Malone remaining at the helm, the team compiled a record of 12–15 in their first three seasons of senior college football. Malone resigned after the 1953 season, and Malone Stadium where the team plays its home games was named in his honor. Succeeding Malone was Devone Payne, who coached Northeast Louisiana for three seasons, from 1954 to 1957. His record was 15–22–1.  The program's third head coach was Jack Rowan, who led the team to a 20–37 record in six seasons. LSU offensive line coach Dixie White took over as the school's fourth head coach in 1963. White also served as the school's athletics director during this time. Northeast Louisiana compiled a record of 31–45–1 during White's tenure. Memphis assistant coach Ollie Keller was selected to succeed White as Northeast Louisiana's head coach, and under his tutelage, the Indians compiled a record of 14–24–3. Keller resigned after four seasons.\nFormer Heisman Trophy winning quarterback John David Crow led the Northeast Louisiana Indians football program for five seasons, including a winning 6–4–1 mark in 1978 and another winning mark in 1980, a 7–4 campaign.\nPat Collins era (1981–1988)\nLongtime Louisiana Tech assistant coach Pat Collins was hired to take over the Indians football team in 1981. Led by first team All-America Stan Humphries, the 1987 Indians squad completed the regular season with an overall record of 9–2. The losses came against Lamar and Southwestern Louisiana of Division I-A. The Indians also finished 6–0 to capture their first outright Southland Conference championship. En route to the championship game in Pocatello, Idaho, NLU defeated North Texas, Eastern Kentucky, and Northern Iowa. Played at the ISU MiniDome in Pocatello, the Indians faced off against the Marshall Thundering Herd for the I-AA National Championship. In the championship game, Marshall took a 42–28 lead into the fourth quarter only to have Humphries lead the Indians to a pair of late touchdowns and capture the championship with a 43–42 victory. Collins departed the Indians football program following the 1988 season with a record of 57–35.\nDave Roberts era (1989–1993)\nDuring the tenure of head coach Dave Roberts, the Indians continued to experience success and prominence, reaching the NCAA Division IAA Quarterfinals and a 10–3 campaign in 1992 that was followed by a 9–3 mark in 1993. Roberts' overall record at ULM was 37–20–2. Roberts left Monroe following the 1993 season to join Lou Holtz's staff at Notre Dame as an assistant coach.\nEd Zaunbrecher era (1994–1999)\nEd Zaunbrecher replaced Roberts and in five seasons compiled a record of 20–36. Zaunbrecher was unable to continue the successes of his predecessors and was fired following the 1999 season. The highlight of the Zaunbrecher era came in 1994, when the Indians upset Kentucky in Lexington in the season finale. It was the Indians' first win over an SEC team in program history. The Indians also defeated Mississippi State in Starkville in 1995 for the program's second win over an SEC team.\nBobby Keasler era (1999–2002)\nMcNeese State head coach Bobby Keasler took over the Indians football team in 1999 and struggled, compiling a record of 8–28 in three full seasons and a partial fourth as the Indians' head coach. Keasler resigned three games into the 2002 season. Louisiana–Monroe joined the Sun Belt Conference for the 2001 season after competing as an independent for the past several seasons.\nCharlie Weatherbie era (2003–2009)\nFormer Navy and Utah State head coach Charlie Weatherbie was hired to replace Keasler in 2003. In Weatherbie's seven seasons, ULM compiled a 31–51 record. The highlight of the Weatherbie era came in 2007, when ULM, who were 25-point underdogs heading into the game, beat Alabama, coached by Nick Saban, in Tuscaloosa 21-14 on November 16. The win marked Louisiana–Monroe's first win over a SEC team in a dozen years (their third overall), and was Nick Saban's only regular season loss to a non-Power 5 team during his tenure at Alabama. In January 2006, it was announced that ULM would replace its Indian mascot due to concerns the name was offensive to Native Americans. In April of that year, it was announced that the university would adopt the Warhawk as its new mascot. Under Weatherbie, the Warhawks got to 6-6 in 2007 and 2009, however, the Warhawks did not get invited to a bowl game. ULM declined to renew Weatherbie's contract after the 2009 season and thus the two sides parted ways.\nTodd Berry era (2010–2015)\nUNLV offensive coordinator and associate head coach Todd Berry, formerly head coach at Army, was named the Warhawks head coach in December 2009. During Berry's six seasons, ULM compiled a record of 28–43.\nThe 2012 Warhawks team was led by quarterback Kolton Browning. The Warhawks began their season by defeating eighth-ranked Arkansas 34–31 in overtime, ULM's fourth win over an SEC team in program history. The next week, ULM went to Auburn, but lost in overtime 31–28. If they would have won, they would have been the 2nd non-SEC team in NCAA history to beat SEC teams back-to-back. The week after, Baylor came to Malone Stadium in the first meeting between the two teams. On a nationally broadcast game Friday night ESPN game in a sold out Malone Stadium before a record crowd, ULM lost a close contest to Baylor 47–42. ULM went on to win their next 5 games, but then lost back to back contests to Arkansas State and Louisiana before defeating North Texas. ULM then defeated FIU in overtime to finish the regular season 8–4. This was the first season that Louisiana–Monroe had a winning record in FBS since joining. Later in December, the 2012 AdvoCare V100 Independence Bowl versus Ohio was the first and only bowl appearance for the Warhawks in school history. The Warhawks lost to Ohio 45–14 in Shreveport to finish off the 2012 season 8–5. The 2012 season proved to be the only winning season during Berry's tenure and one of only two seasons in which the Warhawks attained bowl eligibility. Berry was fired after the conclusion of the 2015 season.\nMatt Viator era (2016–2020)\nMcNeese State head coach Matt Viator was hired as the Warhawks' 14th senior college head coach in December 2015. In Viator's first season at the helm, the Warhawks improved to a 4–8 record, up two games from the season before. Viator led the Warhawks to bowl eligibility in 2018, but was fired in December 2020 after losing the first 10 games of the season.\nTerry Bowden era (2021–2023)\nTerry Bowden was named head coach on December 23, 2020. During the prior season, Bowden had assisted Clemson as an unpaid intern while pursuing a graduate degree. Bowden, a son of College Football Hall of Fame coach Bobby Bowden and former head coach at Auburn, signed a four-year contract with ULM worth $1.4 million. Bowden was fired one day after the Warhawks finished the 2023 season with a 2-10 overall record without a single Sun Belt Conference win.\nBryant Vincent era (2023–present)\nBryant Vincent was introduced as head football coach on December 6, 2023. ULM went 5-7, an improvement over last season, but failed to make a bowl game after losing 5 straight to end the year. teams in 2022]]\nConference affiliations\n* National Junior College Athletic Association (1931–1950)\n* NAIA Independent (1951–1952)\n* Gulf States Conference (1953–1971)\n* Division I Independent (1972–1977)\n* Division I-A Independent (1978–1981, 1994–2000)\n* Southland Conference (1982–1993)\n* Sun Belt Conference (2001–present)\nChampionships\nNational championships\nThe Warhawks have one national championship, captured in the 1987 NCAA Division I-AA Football Championship Game. Led by first team All-America Stan Humphries, the 1987 Indians squad completed the regular season with an overall record of 9–2. The losses came against Lamar and Southwestern Louisiana of Division I-A. The Indians also finished 6–0 to capture their first outright Southland Conference championship. En route to the championship game in Pocatello, Idaho, NLU defeated North Texas, Eastern Kentucky, and Northern Iowa. Played at the MiniDome in Pocatello, the Indians faced off against the Marshall Thundering Herd for the I-AA National Championship. In the championship game, Marshall took a 42–28 lead into the fourth quarter only to have Humphries lead the Indians to a pair of late touchdowns and capture the championship with a 43–42 victory.\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n|-\n| 1987 || NCAA Division I-AA || Pat Collins || 13–2|| W 43–42 || Marshall\n|}\nConference championships\nThe Warhawks have won five conference titles, three outright and two shared, and four of them while known as the Northeast Louisiana Indians.\n{| class=\"wikitable\"\n|-\n|-\n| 1983† || Southland Conference || Pat Collins || 8–3 || 5–1\n|-\n| 1987 || Southland Conference || Pat Collins || 13–2 || 6–0\n|-\n| 1990 || Southland Conference || Dave Roberts || 7–5 || 5–1\n|-\n| 1992 || Southland Conference || Dave Roberts  || 10–3 || 7–0\n|-\n| 2005† || Sun Belt Conference || Charlie Weatherbie || 5–6 || 5–2\n|}\n† Co-champions\nRivalries\nLouisiana–Lafayette\nThe Battle on the Bayou is the annual rivalry game between Louisiana–Monroe and the Louisiana Ragin' Cajuns. A wooden boot-shaped rivalry trophy was created in 2002 to be awarded to the victors. Both schools are members of the Sun Belt Conference. The Battle on the Bayou is a rivalry not just in football, but in all sports when the Cajuns and Warhawks meet. Louisiana–Lafayette holds a 29–25 edge in the series through the 2019 season.\n{| class=\"wikitable\" style=\"margin:1em auto;\"\n|-\n|+ Louisiana–Monroe/Louisiana–Lafayette: All-Time Record\n!Games played\n!First meeting\n!Last meeting\n!ULM wins\n!ULM losses\n!Ties\n!Win %\n|- style=\"text-align:center;\"\n|60\n|September 15, 1951 (lost 7–13)\n|November 30, 2024 (lost 37–23)\n|26\n|33\n|0\n|.433\n|}\nLouisiana Tech\nULM and Louisiana Tech are located 35 miles apart from each other on I-20 in North Louisiana. The matchup began in 1953 as a conference game, following Northeast Louisiana State's move to the Gulf States Conference. After the Gulf States Conference dissolved at the end of the 1970 football season, Louisiana Tech joined the Southland Conference, while Northeast Louisiana remained a football independent school, and the yearly game continued as a non-conference matchup. The game once again became a conference matchup in 1982, when Northeast Louisiana joined the Southland Conference, before once again moving to a non-conference game following Louisiana Tech's departure from the Southland following the 1986 season.\nThe early history of the series was dominated by Louisiana Tech, as the Bulldogs won 20 of the first 25 meetings between the two schools. Following the end of the 1978 season, long-time Louisiana Tech head coach Maxie Lambright resigned, and Tech decided to hire Arkansas assistant coach Larry Beightol as their new head coach, instead of promoting long-time Lambright assistant coach (and Louisiana Tech alum), Pat Collins. Collins was subsequently hired as an assistant coach at Northeast Louisiana, before being promoted to head coach following John David Crow's resignation at the end of the 1980 season. Prior to Collins' first game against Tech as a head coach, he drew the ire of Tech fans by using insider information gleaned during his time as a Tech assistant to complain to Southland Conference officials and have the Bulldogs' star linebacker, Ed Jackson, declared ineligible to play. The game, dubbed the \"Ed Jackson Bowl,\" quickly turned into a rout, as Northeast Louisiana dominated the Bulldogs en route to a 35–0 victory in front of 23,500 fans at Tech's Joe Aillet Stadium. Collins spent eight seasons as coach at Northeast Louisiana, and went 6–2 all time against his alma mater. Following Collins' tenure, however, Louisiana Tech once again began to dominate the matchup, winning 7 of the last 8 meetings, with a 1989 game that the Bulldogs initially won on the field, but later forfeited the victory, as the only blemish.\nIn 2000, the matchup came to an end, with a 42–19 Tech victory in Monroe. Following the 2000 season, Louisiana Tech became a member of the Western Athletic Conference, while Louisiana–Monroe became a member of the Sun Belt Conference in 2001. Since then, the two teams have played in different conferences, and the game has not been scheduled. In 2012, Louisiana Tech left the WAC and joined Conference USA.\n{| class=\"wikitable\" style=\"margin:1em auto;\"\n|-\n|+ Louisiana–Monroe/Louisiana Tech: All-Time Record\n!Games played\n!First meeting\n!Last meeting\n!ULM wins\n!ULM losses\n!Ties\n!Win %\n|- style=\"text-align:center;\"\n|43\n|September 26, 1953 (lost 6–61)\n|November 11, 2000 (lost 19–42)\n|14\n|29\n|0\n|.326\n|}\nNorthwestern State\nIn the 1992 edition of the rivalry game, the teams' mascots Vic the Demon and Chief Brave Spirit got involved in a fight that distracted television cameras to the point that the entire altercation is caught on video. In the scuffle, Vic the Demon's head was ripped off as the two crashed to the ground behind one of the end zones, which according to the video clip, breaks a \"cardinal rule\", i.e. a tradition, of being a mascot. The melee was broken up by college police without further incident.\n{| class=\"wikitable\" style=\"margin:1em auto;\"\n|-\n|+ Louisiana–Monroe/Northwestern State: All-Time Record\n!Games played\n!First meeting\n!Last meeting\n!ULM wins\n!ULM losses\n!Ties\n!Win %\n|- style=\"text-align:center;\"\n|48\n|November 8, 1952 (won 20–14)\n|September 1, 2005 (lost 23–27)\n|19\n|28\n|1\n|.406\n|}\nFootball classifications\n* 1931–1950: National Junior College Athletic Association\n* 1951–1974: NAIA\n* 1975–1977: NCAA Division I\n* 1978–1981: NCAA Division I-A\n* 1982–1993: NCAA Division I-AA (known as the Football Championship Subdivision (FCS) since 2006)\n* 1994–present: NCAA Division I-A (known as the Football Bowl Subdivision (FBS) since 2006)\nMajor accomplishments\nWins against the SEC\nIn 1994, during their first year as a Division I-A team, the-then Northeast Louisiana Indians defeated the Kentucky Wildcats 21-14 at Commonwealth Stadium.\nIn 1995, the school followed up their victory against Kentucky the previous year, with another win against an SEC team, this time defeating Mississippi State 34-32 in Starkville.\nIn 2007, the Warhawks upset the Alabama Crimson Tide in Bryant–Denny Stadium 21–14, despite being 25-point underdogs and expected to lose by as much as 38. It has since been called \"one of the most important wins in school history.\"\nIn another thrilling and important win for the Warhawks, on September 8, 2012, ULM beat eighth-ranked Arkansas 34–31 in overtime, Louisiana–Monroe's first win over a ranked opponent in 16 tries.\n2012 – \"The Magical Season\"\nThe 2012 ULM football team was led by head coach Todd Berry and quarterback Kolton Browning.\nThe Warhawks began their season by defeating eighth-ranked Arkansas 34–31 in overtime.\nThe next week, ULM went to Auburn, but lost in overtime 31–28. If they would have won, they would have been the 2nd non-SEC team in NCAA history to beat SEC teams back-to-back.\nThe week after, Baylor came to Malone Stadium in the first meeting between the two teams. On a nationally broadcast game Friday night ESPN game in a sold out Malone Stadium before a record crowd, ULM lost a close contest to Baylor 47–42.\nULM went on to win their next 5 games, but then lost back to back contests to Arkansas State and Louisiana-Lafayette (ULL) before defeating North Texas. ULM then defeated FIU in overtime to finish the regular season 8–4.\nThis was the first season that Louisiana–Monroe had a winning record since joining the FBS. Later in December, the 2012 AdvoCare V100 Independence Bowl versus the Ohio Bobcats was the first bowl appearance for the Warhawks in school history. The Warhawks lost to Ohio 45–14 in Shreveport to finish off the 2012 season 8–5.\nBowl games\nThe Warhawks have a bowl record of 0–1.\n{| class=\"wikitable\"\n|-\n|-\n| 2012 || Todd Berry || Independence Bowl || Ohio || L 14–45\n|}\nDivision I-AA Playoff appearances\nLouisiana–Monroe appeared in eight Division I-AA playoff games, going 5–3 in these games.\n{| class=\"wikitable\" style=\"text-align:center;\"\n|- style=\"; text-align:center\"\n| Season || Round || Date || Location || W/L || Opponent || PF || PA|| Coach\n|-  style=\"background:#dfd;\"\n| rowspan=4|1987 || First Round || November 28, 1987 || Malone Stadium || W || North Texas || 30 || 9 || rowspan=4 | Pat Collins\n|-  style=\"background:#dfd;\"\n| Quarterfinals || December 5, 1987 || Malone Stadium || W || Eastern Kentucky || 33 || 32\n|-  style=\"background:#dfd;\"\n| Semifinals || December 12, 1987 || Malone Stadium || W || Northern Iowa || 44 || 41\n|-  style=\"background:#dfd;\"\n| National Championship || December 19, 1987 || Minidome (Pocatello, ID) || W || Marshall || 43 || 42\n|-  style=\"background:#fdd;\"\n| 1990 || First Round || November 24, 1990 ||Mackay Stadium (Reno, NV)||L || Nevada || 14 || 27 || Dave Roberts\n|-  style=\"background:#dfd;\"\n| rowspan=2|1992 || First Round|| November 28, 1992 || Malone Stadium || W || Alcorn State || 78 || 27 || rowspan=2|Dave Roberts\n|-  style=\"background:#fdd;\"\n| Quarterfinals || December 5, 1992 || Malone Stadium || L || Delaware || 18 || 41\n|-  style=\"background:#fdd;\"\n| 1993 || First Round || November 27, 1993 || Malone Stadium || L || Idaho || 31 || 34 || Dave Roberts\n|-  style=\"background:#660000; color:white;\"\n|| Total || &nbsp; || &nbsp; ||  8 playoff games || 5–3 || || 291 || 253 ||\n|}\nVenues\nMalone Stadium\nBrown Stadium\nProfessional players\nled the Indians in passing from 1988 to 1990.]]\nThe program has sent several players into the professional ranks, including Joe Profit, Ronnie Washington [Linebacker and was the 2nd first round pick by the Arizona Outlaws of the USFL], Stan Humphries, Roosevelt Potts, Bubby Brister, Chris Harris, Doug Pederson, Marty Booker, and Smokey Stover into the National Football League, David Dumars and Steven Jyles into the Canadian Football League, and Raymond Philyaw and Pete Thomas into the Arena Football League, and Kolton Browning into Champions Indoor Football. For every player drafted, see List of Louisiana–Monroe Warhawks in the NFL draft\nPoll history\n{| style=\"margin: 1em auto 1em auto\" class=\"wikitable sortable\"\n|+ Division I-AA Associated Press Poll History\n|- style=\"text-align:center;\"\n! style=\"\" | Year\n! style=\"\" | NCAA Division I-AA Ranking\n! style=\"\" | Sports Network Division I-AA Ranking\n|- style=\"text-align:left;\"\n| 1983\n|\n|\n|- style=\"text-align:center;\"\n| 1987\n|\n|\n|- style=\"text-align:center;\"\n| 1990\n|\n|\n|- style=\"text-align:center;\"\n| 1991\n|\n|\n|- style=\"text-align:center;\"\n| 1992\n|\n|\n|- style=\"text-align:center;\"\n| 1993\n|\n|\n|}\nFuture non-conference opponents\nAnnounced schedules as of April 30, 2025.\n{| class=\"wikitable\"\n|-\n|-\n| Saint Francis\n| at Mississippi State\n| Sam Houston\n| at Sam Houston\n| at Texas\n| at Louisiana Tech\n| Louisiana Tech\n|-\n| at Alabama\n| at UAB\n| at Florida Atlantic\n|\n|\n|\n|-\n| at UTEP\n| Southeastern Louisiana\n|\n|\n|\n|\n|\n|-\n| at Northwestern\n| Florida Atlantic\n|\n|\n|\n|\n|\n|}\nSee also\n* List of NCAA Division I FBS football programs\nReferences\nExternal links\n*"
    }
  ]
}