{
  "content": [
    {
      "type": "text",
      "text": "# Louise Brown (historian)\n\n}}\n-->\n| other_names       =\n| nationality       = American\n| education         =\n| alma_mater        =Cornell University (B.A., Ph.D)\n| occupation        =Historian\n| awards            = Herbert Baxter Adams Prize\n| spouse            =\n| partner           =\n| children          =\n| signature         =\n| signature_alt     =\n}}\nLouise Brown (1878 – 1 May 1955) was an American historian of Britain.\nEarly life\nLouise Fargo Brown was born in 1878 in Buffalo, New York and received her B.A. from Cornell University in 1903. She was a member of Alpha Phi Women's Fraternity.\nCareer\nShe was awarded her Ph.D. in 1909 and got a job as an instructor at Wellesley College in 1909. Two years later, Brown published The Political Activities of the Baptists and Fifth Monarchy Men in England During the Interregnum, for which she was awarded the Herbert Baxter Adams Prize from the American Historical Association for the best monograph in modern European history. In 1915, Brown became dean of women and professor of history at the University of Nevada. When the United States entered World War I, she enlisted into the United States Marine Corps, where she was a sergeant. After the war, she became a professor at Vassar College where she remained until her retirement in 1944 and co-founded the Berkshire Conference of Women Historians in 1930. Brown published The First Earl of Shaftesbury in 1933 and wrote Apostle of Democracy: The Life of Lucy Maynard Salmon a decade later. Together with George B. Carson, she published Men and Centuries of European Civilization in 1948. Brown was a Fellow of the Royal Historical Society.\nDeath\nShe died on 1 May 1955 at Norfolk, Virginia.\nSelected publications\n* The First Earl of Shaftesbury (1933)\n* Apostle of Democracy: The Life of Lucy Maynard Salmon\n*The Political Activities of the Baptists and Fifth Monarchy Men In England During the Interregnum, American Historical Axssociation (1913)\n* Men and Centuries of European Civilization (with George B. Carson (1948)\nNotes\nReferences\n*"
    }
  ]
}