{
  "content": [
    {
      "type": "text",
      "text": "# Louis Sicking\n\n| name = Louis Sicking\n| image = Louis Sicking VU.jpg\n| discipline = Historian\n| sub_discipline = Medieval and Early Modern History\n| workplaces = Vrije Universiteit Amsterdam\nUniversiteit Leiden\n| doctoral_advisor = Wim Blockmans and J.R. Bruijn\n| thesis_title = Zeemacht en onmacht: Maritieme politiek in de Nederlanden, 1488-1558\n| thesis_year = 1996\n| birth_name =\n| awards = Descartes-Huygens Prize (2016)\n}}\nLouis H. J. Sicking (March 11, 1966) is a Dutch historian. Sicking is Aemilius Papinianus professor of History of Public International Law at Vrije Universiteit Amsterdam. In 2016 he was awarded the Descartes-Huygens Prize.\nEducation\nSicking holds a Master´s degree in overseas history from the University of Aix-en-Provence and a doctorate in history from Leiden University.\nWorks\nHis research mainly concerns maritime history, and the history of diplomacy and international law in the late Middle Ages and the Early modern period. Recurring elements in Sicking‘s work are the French and Dutch language areas, as well as the lasting influence of the Middle Ages that extends into subsequent periods.\nHis thesis was published in English as Neptune and the Netherlands: State, Economy, and War at Sea in the Renaissance (2004). In this work, Sicking departs from a strictly Belgian or Dutch perspective, focusing instead on the origins of the Burgundian-Habsburg maritime organization in the broader context of the Netherlands.\nServing as a lecturer of Medieval and Early Modern History at Leiden University since 2001, Sicking also holds an endowed chair in the history of international law at Vrije Universiteit Amsterdam since 2013. In recognition of his scholarly achievements, Sicking was honored with the Descartes-Huygens Prize in 2016.\nSelected publications\nBooks\n* Sicking, L. (2004). Neptune and the Netherlands: state, economy, and war at sea in the Renaissance. Leiden: Brill.\n* Sicking, L. (2008). Colonial Borderlands. France and the Netherlands in the Atlantic in the Nineteenth Century. Leiden: Martinus Nijhoff.\n* Sicking, L. (2015). ''La naissance d'une thalassocratie. Les Pays-Bas et la mer à l’aube du Siècle d’or. Paris: PUPS.\n* Sicking, L. (2021). De bijl van Sint-Olav. Op zoek naar Noorse schatten in de Nederlanden. Zutphen: Walburgpers.\nCollective volumes\n* Sicking, L. and Abreu-Ferreira, D. (eds.). (2009). Beyond the Catch. Fisheries of the North Atlantic, the North Sea and the Baltic, 900-1850. Leiden/Boston: Brill.\n* Sicking, L. and Wijffels, A. (eds.). (2020). Conflict Management in the Mediterranean and the Atlantic, 1200-1800. Actors, Institutions and Strategies of Dispute Settlement. Leiden/Boston: Brill.\n* Ebben, M.A. and Sicking, L. (eds.). (2021). Beyond Ambassadors: Consuls, Missionaries and Spies in Pre-Modern Diplomacy (Research group Institute for History: Europe 1000-1800). Leiden/Boston: Brill.\nMain articles\n* Sicking, L. (2013). Selling and buying protection: Dutch war fleets at the service of Venice, 1617-1667. Studia Venetia, LXVII, 89-106.\n* Sicking, L. (2015). European Naval Warfare. In H. Scott (ed.), Oxford Handbook of early modern European History 1350-1750. Volume II: Cultures and Power. Oxford: OUP.\n* Sicking, L. (2018). The Pirate and the Admiral. Europeanisation and Globalisation of Maritime Conflict Regulation. Journal of the History of International Law, 20(4), 429-470.\n* Sicking, L. and van Rhee, R. (2019). The English Search for a Northeast Passage to Asia Reconsidered: How ‘Flemish’ fishermen put the Edward Bonaventure in jeopardy on its return journey in 1554. The Mariners Mirror, 105(4), 388-406.\n* Sicking, L. (2020). The Medieval Origin of the Factory or the Institutional Foundations of Overseas Trade. Toward a Model for Global Comparison. Journal of World History, 31''(2), 295-326.\nReferences"
    }
  ]
}