{
  "content": [
    {
      "type": "text",
      "text": "# Love & War (Daniel Merriweather album)\n\n| recorded   =\n| studio     =\n| genre      = Soul\n| length     = 41:53\n| label      =\n* Columbia (UK)\n* Marlin (AUS)\n| producer   =\n* Dejion Madison\n* Mark Ronson\n* Eg White\n| prev_title =\n| prev_year  =\n| next_title =\n| next_year  =\n| misc       =\n}}\nLove & War is the debut and only studio album by Australian singer Daniel Merriweather, first released on 1 June 2009. Largely co-written and produced by  British-American producer Mark Ronson, with additional contribution from Eg White, it features string arrangements by David Campbell. Musically, the album combines elements of soul, Motown, and 1970s pop, arranged to complement Merriweather's vocal style within a cohesive retro-influenced production.\nThe album received generally positive reviews, with critics praising Merriweather's soulful vocals and Ronson's strong retro-soul production, though some compared it unfavorably to Ronson's production on Amy Winehouse's Back to Black (2006). Commercially, Love & War debuted at number two in Switzerland and the United Kingdom, with the latter eventually awarding it a platinum certification. The album's first two singles \"Change\" and \"Red\" both cracked the UK top ten.\nBackground\nMerriweather began his recording career in 2002 with a guest appearance on Disco Montego's \"All I Want,\" shortly before signing to local label Marlin Records. His collaboration with producer Mark Ronson soon followed, contributing vocals to Ronson's 2003 debut album Here Comes the Fuzz. Soon later, Merriweather joined Ronson's Allido Records and released his debut solo single \"City Rules\" in early 2004, earning an ARIA Award nomination and later winning APRA and ARIA awards alongside his follow-up single \"She’s Got Me.\" Through the mid-2000s he expanded his profile by co-writing and producing for other artists, while early plans for a debut album titled The Fifth Season never materialized as an official release. Merriweather's breakthrough came in 2007 when he provided lead vocals for Ronson's re-imagined \"Stop Me,\" which became a major hit throughout Europe.\nPromotion\n* \"Change\" was released in February 2009. It featured rapper Wale and reached number eight on the UK Singles Chart, marking his second top ten single placing.\n* \"Red\" was released in May 2009. \"Red\" entered the UK singles chart at number five, making it his second UK top ten single and first entry into the top five as a lead performer.\n* \"Impossible\" was released on 17 August 2009, and peaked at a low #67 on the UK Singles Chart.\n* \"Water and a Flame\" was the fourth and final single released on 2 November 2009, and peaked at #180 on the UK Singles Chart.\nCrititcal reception\n| rev2 = Consequence of Sound\n| rev2score = D\n| rev3 = Daily Mirror\n| rev3score = 4/5\n| rev4 = The Daily Telegraph\n| rev4score =\n| rev5 = Digital Spy\n| rev5score =\n| rev6 = MusicOMH\n| rev6score =\n| rev7 = The Observer\n| rev7score =\n| rev8 = Rolling Stone\n| rev8score =\n| rev9 = The Times\n| rev9score =\n| rev10 = Yahoo! Music UK\n| rev10score =\n}}\nLove & War has generally received positive reviews. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the album has received a score of 66, based on five reviews. Daily Mirror critic Gavin Martin called the album \"one of the debuts of the, well, century.\" He remarked that Love & War \"has the potential to become a genre-crossing monster. And this is pop music that is clearly positive, and spiritually and politically engaged. Merriweather is soul saturated and Stevie Wonder is his guiding light.\" Gary Graff from Billboard found that while  \"the set boasts backing band the Dap-Kings and duets with Adele and Wale [...] Merriweather delivers just fine in his own right, with a soulful voice of the Otis Redding/Al Green/Marvin Gaye variety and lushly arranged songs that channel an array of influences from early Elton John to vintage Holland-Dozier-Holland.\" Rolling Stones Jody Rosen stated that the album \"overflows with good taste — and better intentions. Produced by Mark Ronson, Love & War is sharp and bright, full of limpid melodies, punchy brass arrangements and, in songs like \"Change,\" beats that gesture to 1974 but feel thoroughly 2010.\"\nBBC Music critic Elle J. Small noted that \"while Love & War may not become quite as massive as Amy Winehouse's Mark Ronson-produced Back to Black, Merriweather’s debut is most certainly up there with the best in new school soul. A satisfying listen.\" Similarly, AllMusic editor David Jeffries wrote that \"if you're looking for a non-confessional alternative to Back to Black that won't take over the room, Love & War will serve that soulful purpose.\" Neil McCormick from The Daily Telegraph also compared Merriweather with Winehouse, writing: \"Although lacking Amy Winehouse's desperate class, a vigorous muscularity to Merriweather's smoky vocals and philosophical lyrical kick lifts it out of the boy-band zone.\" He described the set as \"artfully updated soul pop, spanning overblown melodrama to scruffy intimacy.\" Mikael Wood from Spin felt that while the singer and Ronson surround \"Merriweather's passionate vocals with tasty retro-soul trimmings, the material only intermittently makes a lasting impression.\" Nick Levine, writing for Digital Spy, found that \"Merriweather's lack of passion or, more accurately, his inability at times to sound truly passionate doesn't sink Love & War, but it does relegate it to mere pleasantness. The many break-up songs aren't as affecting as they could be, while the defiant \"Not Giving Up\" just isn't stirring in spite of its swelling strings and taut Motown beats. Even at its best [...] Love & War is hard to fall for entirely.\" Alex Young from Consequence of Sound wrote that the album \"displays both the downsides and benefits of making retro-soul for the masses.\"\nCommercial performance\nLove & War debuted at number two on the UK Albums Chart, selling 43,000 copies in its first week. It was the third highest first week sales for a debut album in 2009 at the time. In the United Kingdom, the album reached Silver status on 14 August 2009 and, in February 2010, was certified Platinum by the British Phonographic Industry (BPI) after selling 300,000 copies.\nTrack listing\n| extra1 = Mark Ronson\n| length1 = 4:53\n| title2 = Impossible\n| writer2 =\n| extra2 =\n| length2 = 4:07\n| title3 = Change\n| note3 = featuring Wale\n| writer3 =\n| extra3 = }}\n| length3 = 3:21\n| title4 = Chainsaw\n| writer4 =\n| extra4 = Ronson\n| length4 = 4:05\n| title5 = Cigarettes\n| writer5 =\n| extra5 = Ronson\n| length5 = 3:24\n| title6 = Red\n| writer6 =\n| extra6 = Ronson\n| length6 = 3:53\n| title7 = Could You\n| writer7 =\n| extra7 = Ronson\n| length7 = 3:36\n| title8 = Not Giving Up\n| writer8 =\n| extra8 = Ronson\n| length8 = 3:14\n| title9 = Getting Out\n| writer9 =\n| extra9 = Ronson\n| length9 = 3:17\n| title10 = Water and a Flame\n| note10 = featuring Adele\n| writer10 =\n| extra10 = White\n| length10 = 3:40\n| title11 = Live by Night\n| writer11 =\n| extra11 = Ronson\n| length11 = 2:53\n| title12 = Giving Everything Away for Free\n| writer12 =\n| extra12 = White\n| length12 = 3:30\n}}\n| extra13 = Ronson\n| length13 = 3:29\n| title14 = You Don't Know What Love Is (You Just Do as You're Told)\n| writer14 = Jack White\n| extra14 = Ronson\n| length14 = 4:13\n}}\n| extra15 = Ronson\n| length15 = 4:23\n}}\nNotes\n* signifies co-producer(s)\nSample credits\n*\"Chainsaw\" contains a portion of the composition \"Beat Me 'Til I'm Blue\" as written by Alan Hawkshaw.\n*\"Could You\" adpats from \"California Dreamin'\" as written by John Phillips and Michelle Phillips.\n*\"The Children\" contains a sample from \"Like a Seed\" as performed by Kenny Rankin.\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center;\"\n|+ Weekly chart performance for Love & War\n|-\n!Chart (2009)\n!Peakposition\n|-\n|-\n|-\n|-\n|-\n|-\n!scope=\"row\"|Irish Albums (IRMA)\n| style=\"text-align:center;\"|15\n|-\n|-\n|-\n|}\nCertifications\nRelease history\n{| class=\"wikitable plainrowheaders\"\n|+ Love & War release history\n|-\n! scope=\"col\"| Region\n! scope=\"col\"| Date\n! scope=\"col\"| Format\n! scope=\"col\"| Label\n|-\n! scope=\"row\"| Australia\n| rowspan=\"2\"| 1 June 2009\n| rowspan=\"3\"|\n|\n|-\n! scope=\"row\"|United Kingdom\n|\n|-\n! scope=\"row\"|United States\n|  23 February 2010\n|\n|}\nReferences"
    }
  ]
}