{
  "content": [
    {
      "type": "text",
      "text": "# Love and War (Banks & Steelz song)\n\n| recorded   = 2013–15 in New York, New York\n| studio     =\n| venue      =\n| genre      =\n| length     =\n| label      = Warner Bros.\n| writer     =\n| producer   =\n| chronology = Banks & Steelz\n| prev_title =\n| prev_year  =\n| next_title = Giant\n| next_year  = 2016\n}}\n\"Love and War\" (stylized as \"Love + War\") is the debut single by Banks & Steelz, a collaborative project created by Interpol frontman Paul Banks and Wu-Tang Clan member RZA. Featuring a rap verse from fellow Wu-Tang Clan member Ghostface Killah, it was premiered on the Apple Music radio station Beats 1 on May 19, 2016. It was subsequently released as a digital download, acting as the lead single from their debut studio album, Anything But Words (2016). A music video for the song, which pays tribute to the film Reservoir Dogs, was also released on May 20.\nComposition\n\"Love and War\" is a rock-influenced hip hop song. It features rap verses from RZA and Ghostface Killah as well as a sung chorus done by Paul Banks, where he repeats \"All is fair in love and war / What you keeping score for\" throughout. April Clare Welsh of Fact stated that the song is built around \"shuffling grooves, driving guitar and Mariachi-style trumpet.\"\nMusic video\nThe music video for the \"Love and War\" was released on the duo's YouTube channel on May 20, 2016. Directed by director group Arms Race, the video is a tribute to an iconic torture scene from the 1992 Quentin Tarantino-directed film Reservoir Dogs. The video has been described as \"grisly\" by Sarah Murphy of Exclaim!. Tom Breihan of Stereogum described the video, saying that it \"starts out as a yakuza torture scene, and it takes some unexpected turns.\" Banks and RZA also appear in the video as hired guns; RZA shares \"Tarantino-esque\" dialogue with Banks, who remains mute during the video. RZA had worked with Tarantino in the past; he worked on the soundtrack for his Kill Bill series.\nTrack listing\nPersonnel\nPersonnel adapted from AllMusic.\n;Banks & Steelz\n*Paul Banks – composing, production, vocals\n*RZA – composing, production, vocals\n;Additional personnel\n*Beatriz Artola – engineer\n*Matthew Barrick – drums\n*Brandon Bost – assistant engineer\n*Vira Byramji – engineer\n*Greg Calbi – mastering\n*Mike Crossey – mixing, programming\n*Steve Fallone – mastering\n*Ghostface Killah – composing, vocals\n*Jonathan Gilmore – engineer, mixing engineer\n*Billy Hickey – engineer\n*John Horne – assistant engineer\n*Phil Joly – engineer\n*Rob Moose – piano\n*Clinton Patterson – trumpet\n*Brandon H. Smith – assistant engineer\n*Gosha Usov – assistant engineer\n*Steve Vealey – engineer\n*Joe Visciano – engineer\nRelease history\n{| class=\"wikitable plainrowheaders\"\n! scope=\"col\"| Region\n! scope=\"col\"| Date\n! scope=\"col\"| Label\n! scope=\"col\"| Format\n|-\n! scope=\"row\"| Worldwide\n| May 19, 2016\n| Warner Bros.\n| Digital download\n|-\n|}\nReferences"
    }
  ]
}