{
  "content": [
    {
      "type": "text",
      "text": "# Love and War (Tamar Braxton song)\n\n| recorded   =\n| studio     =\n| venue      =\n| genre      = R&B, soul\n| length     =\n| label      = Epic Records\n| writer     = Tamar Braxton, LaShawn Daniels, Makeba Riddick, Darhyl Camper, Jr.\n| producer   = DJ Camper\n| prev_title = If You Don't Wanna Love Me\n| prev_year  = 2000\n| next_title = The One\n| next_year  = 2013\n| misc       =\n}}\n\"Love and War\" is the lead single by American singer Tamar Braxton from her second album of the same name. The song received two Grammy Award nominations at the 56th Grammy Awards for Best R&B Song and Best R&B Performance.\nBackground\nBraxton revealed to Essence that she originally intended the song \"Hot Sugar\" to be released as the lead single from her second album, saying \"given everything that happened to Vince and I [sic] this year, and everything we went through in our marriage, this song was fitting to me and Vince\", explaining \"I've been in love before, and I've gotten my feelings hurt before but I've never experienced passion until I met Vince\". She added \"I've never argued this much with a person, and I've never loved this hard. That's what this song is about.\"\nSinger-songwriter Lady Gaga, who was signed by Braxton's best friend and Streamline Records founder Leshelle Driver in 2007, promoted the single via social networking site Twitter, to over 31 million followers. VH1 writer Bené Viera commented that \"Gaga is like family to Vince & Tamar\" and that it was \"sweet of her to use her super fame to show Tamar love\".\nComposition\nEssence writer Derrick Bryson Taylor wrote \"the meaning of the song goes way beyond a minor tiff between lovers. It is really about her marriage\".\nMusic video\nThe music video for the song was filmed in the Hollywood Hills and Malibu. It was directed by Walid Azami and premiered on BET's 106 & Park on January 17, 2013.\nCritical response\n}}\n\"Love and War\" received general acclaim from critics. Rick Florino of Artistdirect described the song as \"a powerful and passionate slice of soul pop\" which \"showcases the singer's impressive and inimitable range.\" Florino lent further praise to Braxton's vocal performance, writing that she \"belts out each note poignantly\" on the \"instantly unforgettable chorus,\" carrying the song \"into the pantheon of great music ruminating on the thin line between 'Love and War'\". VH1 writer Bené Viera also praised Braxton's vocal ability, describing the song as a \"soul stirring ballad\" and writing \"her vocal prowess covers the deep gutting sound Toni mastered and rises to a perfect alto/soprano perfection\".\nCommercial reception\nWithin 24 hours of its release, \"Love and War\" shot to the top of the US iTunes chart. Selling 84,000 downloads in its first week of release, it debuted at number 3 on the R&B/Hip-Hop Digital Songs chart, also claiming the \"Hot Shot Debut\" honor when it debuted at number 57 on the Billboard Hot 100, making it her second appearance on the chart. Her debut single \"If You Don't Wanna Love Me\" peaked at number 89 on the chart in 2000. \"Love and War\" also became her first top 20 on the R&B/Hip-Hop Songs chart, at number 13 and first number 1 on the Heatseekers Songs chart. In its second week, the song fell to number 97 on the Hot 100 chart but climbed back up to number 71. \"Love and War\" charted at number 6 on the UK R&B iTunes chart on December 7, 2012. The song also reached number 1 on the Urban Adult Contemporary Radio Chart and stayed number 1 for 9 weeks.\nAccolades\n\"Love and War\" received three nominations at the 2013 Soul Train Awards for The Ashford and Simpson Songwriter's Award, Video of the Year and Song of the Year, winning both Song of the Year and The Ashford and Simpson Songwriter's Award. At the 56th Annual Grammy Awards, \"Love and War\" was nominated for Best R&B Song and Best R&B Performance.\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n!Chart (2012–2013)\n!Peakposition\n|-\n! scope=\"row\"| US Billboard Hot 100\n| 57\n|-\n! scope=\"row\"| US Billboard Hot R&B/Hip-Hop Songs\n| 13\n|-\n! scope=\"row\"| US Billboard Adult R&B Songs\n| 1\n|-\n! scope=\"row\"| US Heatseekers Songs\n| 1\n|-\n! scope=\"row\"| US Billboard Hot R&B/Hip-Hop Airplay\n| 2\n|-\n|}\nCertifications\nReferences"
    }
  ]
}