{
  "content": [
    {
      "type": "text",
      "text": "# Low-temperature cooking\n\nLow-temperature cooking is a cooking technique that uses temperatures in the range of about  for a prolonged time to cook food. Low-temperature cooking methods include sous vide cooking, slow cooking using a slow cooker, cooking in a normal oven which has a minimal setting of about , and using a combi steamer providing exact temperature control. The traditional cooking pit also cooks food at low temperature.\nCooking food by a low-temperature method does not necessarily imply that the internal temperature of the food is lower than by traditional cooking.\nIn the American South, this style of cooking is sometimes referred to as \"low and slow\".\nHistory\nLow-temperature cooking has been used for a long time; evidence of its use can be found in indigenous cultures. Samoans and Tongans slow-cook meat in large pits for celebrations and ceremonies. However, the technique was not scientifically examined until the 18th century, when Benjamin Thompson \"described how he had left a joint of meat in a drying oven overnight and was amazed when, the next morning, he found that the meat was tender and fully cooked.\" Professor Nicholas Kurti from the University of Oxford repeated these experiments in 1969, and showed that the temperature of Thompson's trial never exceeded 70 degrees Celsius (158&nbsp;°F).\nTheory\nMeat is cooked for four reasons: to tenderise it, to provide additional flavours, to kill harmful bacteria, and to kill parasites such as Trichinella spiralis and Diphyllobothrium. All four can be achieved by cooking meat at high temperature for a short time, and by cooking at low temperature for a long time. Each goal is achieved at a different temperature, and takes a different time to achieve. The lower the temperature used, the longer the cooking time. An example of slow, long cooking is Southern pulled pork BBQ.\nTenderisation\nToughness in meat is derived from several proteins, such as actin, myosin and collagen, that combined form the structure of the muscle tissue. Heating these proteins causes them to denature, or break down into other substances, which in turn changes the structure and texture of meat, usually reducing its toughness and making it more tender. This typically takes place between  over an extended period of time.\nFlavour\nFlavours may be enhanced by the Maillard reaction, which combines sugars and amino acids at temperatures above . Meat roasted traditionally in a hot oven has a brown crust which is generally considered desirable, caused by the Maillard reaction. Meat can be cooked at a high temperature for a short time to brown just the surface, before or after being cooked at low temperature, thus obtaining the benefits of both methods.\nBacteria\nBacteria are typically killed at temperatures of around . Most harmful bacteria live on the surface of pieces of meat which have not been ground or shredded before cooking. As a result, for unprocessed steaks or chops of red meat it is usually safe merely to bring the surface temperature of the meat to this temperature and hold it there for a few minutes. Meat which has been ground needs to be cooked at a temperature and time sufficient to kill bacteria. Poultry such as chicken has a porous texture not visible to the eye, and can harbour pathogens in its interior even if the exterior is heated sufficiently.\nGravy\nLow-temperature cooking reduces the amount of fat and juices, normally used to make gravy, rendered out of the meat. However, when using a plastic bag, little to no evaporation occurs while the meat is cooking, which results in plentiful bag juices.\nPractice\nSous-vide low-temperature cooking is carried out by vacuum-sealing food in a plastic bag placed in a water bath or combi steamer with precisely controlled temperature for a long time. The food may then be browned by heating the surfaces to a much higher temperature of perhaps , using a roasting pan or a blow torch prior to serving. A dishwasher has been used to cook salmon.\nTemperature Table\nBelow is the table of minimum core temperature for different food.\nBeef, Pork, Veal, and Lamb:  with a 3-minute rest time\nGround Meat:\nHam, uncooked:  with a 3-minute rest time\nHam, fully cooked:  to reheat (caveat:)\nPoultry:\nEggs:\n* egg whites begin to coagulate at 140&nbsp;°F\n:* Ovotransferrin begins to coagulate at 140°F\n:* Ovalbumin begins to coagulate at 180°F\n* egg yolks begin to coagulate at 149&nbsp;°F\n:* Egg yolk lipoproteins begin to coagulate at 158°F\nEgg Dishes:\nFin Fish:  or flesh is opaque & separates easily with fork\nShrimp, Lobster, and Crabs: Flesh pearly & opaque\nClams, Oysters, and Mussels: Shells open during cooking\nScallops: Flesh is milky white or opaque and firm\nLeftovers and Casseroles:\nSee also\n* Black garlic\n* Doneness\n* Molecular gastronomy\n* Food safety\n* Critical control point\nReferences\nExternal links\n* [https://www.bbc.co.uk/dna/h2g2/A36869494 Slow-cooked roast wing rib of beef (by Heston Blumenthal)]\n* [https://web.archive.org/web/20120221054436/http://sousvideaustralia.com/cookingsousvide/red-meat-dishes/slow-cooked-beef/ Slow Cooked beef cheeks (by Sous Vide Australia)]\n*\n*"
    }
  ]
}