{
  "content": [
    {
      "type": "text",
      "text": "# Lower Broadway, Newark\n\nLower Broadway is a neighborhood located on the northern edge of the central business district in Newark, New Jersey, USA.\n]]\nHistory\nLower Broadway is marked by the immigrant populations who have passed through the community throughout Newark's history. As the Italian community moved to the suburbs in the 1960s, the neighborhood became home to Puerto Rican arrivals. In the late 1960s, the African-American community assumed leadership positions and members of Newark's Hispanic community began to organize as well. They came together to address their challenges and formed Familias Unidas, which created New Jersey's first bi-lingual daycare center. This organization later laid the groundwork for what is now one of Lower Broadway's anchoring institutions, La Casa de Don Pedro. St.Michael's RC Church is located in the area on Broadway.\nLocation\nLower Broadway is a  neighborhood located on the northern fringe of Newark's central business district. Boundaries of the neighborhood are Interstate 280 to the south, the Passaic River to the east, 4th and Bloomfield Avenues to the north and Branch Brook Park and the Newark Light Rail to the west.\nDemographics\nWith over 14,000 residents, Lower Broadway is one of the most diverse neighborhoods in the city. It remains a largely Hispanic community (51% vs 32% in Newark), although it now has a wide mix of residents from Puerto Rico, Ecuador, the Dominican Republic and Mexico. The Black population has also increased steadily and includes African Americans as well as a growing West African population.\nOne quarter of the residents are under the age of 18, and one out of every five households is headed by a female with children under the age of 18.\nResidential district\nLower Broadway is primarily a residential neighborhood that is characterized in the north by smaller lots with single, and two-family homes (many of which have been converted into two- and three-family units) and in the south by higher density residential development, particularly in the vicinity of 7th Avenue.\nResidential uses are clustered in the heart of the neighborhood, although nearly one third of the population lives in the two Mies van der Rohe designed towers on the southern edge of the neighborhood, The Colonnade and Pavilion apartment complexes. The rest of the community is primarily three story homes and small-scale apartment buildings. The average home in Lower Broadway is over 80 years old. There are many well maintained homes and streets.\nThe southern portion of Branch Brook Park provides some recreational amenities to Lower Broadway, but its location opposite a busy thoroughfare inhibits regular use by residents. Four local schools serve the community: McKinley Elementary School, Barringer High School, Franklin Elementary School and St. Michael's School (parochial).\nCommercial district\nThe commercial district has a diverse mix of more than 100 businesses, situated primarily on Broadway and Bloomfield Avenues. These corridors are characterized by mixed-use buildings with apartments above ground-floor retail and service establishments, as well as one-story stand-alone commercial establishments. Over 70,000 cars and over 43,000 bus riders pass through the corridor every week, making the Lower Broadway Commercial District the busiest traffic artery leading into downtown Newark.\nWorks were carried out to upgrade the commercial corridor with improved sidewalks, benches, plantings and façade improvements. With the volume of daily street car traffic, these improvement efforts were a top priority.\nIndustrial land uses prevail along the community's eastern boundaries - McCarter Highway and the Passaic River. Strip malls, gas stations, auto body shops and other highway commercial uses have been replacing formerly industrial and vacant land along McCarter Highway.\nTransportation\nLower Broadway has excellent transportation links by bus, rail, light rail and car. Its proximity to downtown Newark, multiple public transit modes and easy access to major transportation lines, such as Route 21 and Interstate 280, make it an attractive location for businesses, residents and workers. Newark's Broad Street Station is a quick walk away, allowing for a convenient 20-minute commute to New York City, access to Newark's Light Rail and easy connections to Amtrak trains that access the country's northeast railways.\nAttitudes, observations and opportunities\nThere has been extensive activity in the community in the last several years thanks to the planning efforts led by La Casa de Don Pedro. Lower Broadway recently concluded a two-year community planning process and the City of Newark has revised a sorely outdated Master Plan. These efforts have resulted in a great deal of community data, feedback and insights to support this marketing plan. These documents were supplemented with one-on-one interviews with a wide variety of stakeholders in the community.\nBetween 1998 and 2011, La Casa spearheaded three comprehensive community plans in Lower Broadway. The first two plans served as guiding documents for La Casa's work in the community and mainly influenced the physical direction of the neighborhood including its housing stock, recreational amenities and commercial corridor. In 2010, Lower Broadway embarked on a community plan that focused more on quality of life issues and even greater civic engagement.\nTransforming Lower Broadway: A Quality of Life Roadmap now serves as the guiding document for the entire community including the newly formed stakeholder group – Lower Broadway Neighborhood Association (LBNA). The LBNA was formed in 2012 and includes representatives from all local block clubs, tenant associations, faith-based institutions, merchants and other institutions including La Casa de Don Pedro.\nReferences\nExternal links\n* [http://www.lacasanwk.org La Casa de Don Pedro]\n* [http://www.BroadwayNewark.com Neighborhood website]\n* [http://www.broadwaynewark.com/#!about Quality of Life Plan]\n* [http://www.lisc.org/greaternewark/building_sustainable_communities/lower_broadway/index.php LISC Lower Broadway]"
    }
  ]
}