{
  "content": [
    {
      "type": "text",
      "text": "# Loyalty (monument)\n\n|location      = Tolyatti, Samara Region\n|designer      = Oleg Klyuyev\n|material      = Bronze\n|height        = about\n|open          = June 1, 2003\n|dedicated_to  = Kostya\n}}\nLoyalty () is a monument to a faithful dog in the Russian city of Tolyatti.\nBackground\nIn 1995, residents of  Tolyatti began noticing a German Shepherd dog at the edge of South Highway, a bypass road in the Auto Factory District of the town which leads to the AvtoVAZ car factory. He was always in the same place, and he rushed at passing cars. Word of the dog spread around the city and the people of the city informally adopted him.\nFurther research showed that in the summer of 1995 the dog had been riding in a car with a man and a girl. The car had crashed, the girl was killed on the spot, and the man was taken to a hospital where he died a few hours later; the dog survived. His name was not known, so people began calling him \"Faithful\" or \"Kostya\" (a hypocorism (affectionate diminutive) of Constantine which itself devolves from \"constant, steadfast\").\nPeople built doghouses for him and some tried to adopt him into their homes, but no such attempt succeeded: the dog always came back, looking for his master, nor would he stay in the shelters; all he would take from the people was food. In the snow and rain, in any weather and time of year, he was always in his spot. The dog always waited and ran up to all passing vehicles. Everyone who traveled that road from the old city to the new always saw Kostya running along the roadside or resting quietly on the grass. The citizens became very fond of Kostya and turned his story into a living legend. Stories about the dog were published throughout Russia.\nFor seven years Kostya kept his post, but in 2002, he was found dead in the woods. A rumor spread that he had been hit by a truck driver who, fearing the wrath of the people, hid his body in the woods to conceal the evidence, thereby walking away from responsibility. However, there were no signs of injury to his body. So it is thought that he died of natural causes.\nThe loss of the popular dog was sad news for many residents. In his memory a homemade billboard was erected with the legend \"Dog, teach us love and devotion\", but it was often blown away by the wind and hooligans threw stones at it, so the city of Tolyatti initiated a campaign to construct a bronze statue of Kostya.\nDescription\nThe sculpture was made by Ulyanovsk sculptor Oleg Klyuyev, son of sculptors Anatoly Klyuyev and Lyubov Turskaya. The bronze sculpture, about  tall and set on a granite pedestal of about the same height, cost about 250,000 rubles It stands in District 21 at the intersection of South Highway and Lev Yashin Street. Klyuyev made the sculpture so that it seems to drivers that he is turning his head for each passing car, hoping to see once more his dead master.\nThe memorial was dedicated on June 1, 2003, the 266th anniversary of the founding of Tolyatti, which is celebrated on the first Sunday of summer. The dedication was attended by about 100 to 150 people, half being members of the Tolyatti Rotary Club which had financed the monument and the others being journalists and private citizens. Mayor Nikolai Utkin spoke at the dedication, as did deputy mayor and Rotary Club president Nikolai Renz, who said:\nAfter the official unveiling, Mayor Utkin, mindful of the vandalism of The Little Mermaid, put the memorial under guard until such time as an alarm system could be installed.\nThe monument was the first in Tolyatti not erected for political reasons.\n}}"
    }
  ]
}