{
  "content": [
    {
      "type": "text",
      "text": "# Lucifer (Peaking Lights album)\n\n| genre      =\n| length     = 43:37\n| label      = *Mexican Summer\n*Weird World\n| producer   =\n| prev_title = 936\n| prev_year  = 2011\n| next_title = Cosmic Logic\n| next_year  = 2014\n| misc       =\n}}\nLucifer is the third studio album by Peaking Lights, released on June 19, 2012, via Mexican Summer and Weird World.\nRecorded at Gary's Electric Studios in Greenpoint, Brooklyn, the album incorporates elements of pop, lo-fi, dub and psychedelic music. In April 18, 2012, \"Lo Hi\" was released as the lead single of the album. It was followed by the second single \"Beautiful Son\" on July 8, 2012. An alternative version of the album was released as an EP titled Lucifer in Dub on December 10, 2012.\nReception\n|rev2=Beats Per Minute |rev2score=78%\n|rev3=DIY |rev3score=\n|rev4=The Guardian |rev4score=\n|rev5=The Line of Best Fit |rev5score=7.5/10\n|rev6=NME |rev6score=\n|rev7=Pitchfork |rev7score=7.9/10\n|rev8=PopMatters |rev8score=5/10\n|rev9=Spectrum Culture |rev9score=\n|rev10=Spin |rev10score=\n}}\nLucifer was described by AllMusic as \"an album of gloriously controlled exploration and feelings of organic beauty.\"\nThe album received a four-star rating from the Guardian reviewer Maddy Costa, who called it \"the best album Peaking Lights have yet recorded.\" Justin Farrar of Spin assigned it a rating of six, noting \"Along with its fairly regimented beats, club music craves clarity in its production; and to achieve this, Peaking Lights have opted to drain a lot of the wonderfully soupy multi-dimensionality from their sound.\" Consequence Summer Dunsmore described the beats on the album as \"balanced, precise, and lucid, just as the transitions are seamless and well orchestrated.\" In a four-star review for DIY, Aurora Mitchell remarked, \"whilst the lyrics on 'Lucifer' may not be the most poetic or insightful, the delivery transforms them.\"\nRating the album 7.9, Pitchfork stated, \"Lucifer nudges their sound forward, but even if it were just a repeat, another great loop, so to speak, Peaking Lights are still a long way from the bottom of their self-made musical well.\" Colin Joyce of Beats Per Minute opined, \"Though the tracks are largely similar in their narcoleptic, bass heavy construction, Dunis' melodies tend to be a lot stickier,\" giving it a rating of 78%. Writing for the Line of Best Fit, Janne Oinonen observed, \"More substantial and diverse than past outings, Lucifer builds on this impression by adding nods towards pop-savvy songwriting to the band's bubbling cauldron of mega-hip points of reference.\" Kyle Fowle of Spectrum Culture assigned it a rating score of 3.5, stating \"While ''Lucifer's lethargic pace certainly tests the patience of the listener, the bevy of hooks, earworm melodies and hidden sonic treasures make this record another solid addition into the Peaking Lights discography.\"\nLucifer was given a rating of 3.5 stars from NME'' Noel Gardner noted, \"Peaking Lights' generous application of dub techniques is arguably their strongest weapon, and they've wisely retained it throughout the bulk of Lucifer.\" PopMatters Colin Small gave the album a rating of five, observing \"Unfortunately, the album's incomplete sound is due to a disparity within the band. The instrumental portions of all songs are highly effective, even at their most restrained.\"\nTrack listing\nPersonnel\nCredits adapted from AllMusic.\n* Al Carlson – engineer, flute, mixing, production assistant\n* Davey Jewell – assistant engineer\n* David Black – photography\n* Howie Weinberg – mastering\n* Leif Podhajsky – poster design\n* Mikko Lorenzo Dunis Coyes – vocals\n* Peaking Lights – composer, mixing, primary artist, producer\n* Robert Beatty – cover art\n* Zac Meyer – mixing assistant\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+ Chart performance for Lucifer\n! scope=\"col\"| Chart (2012)\n! scope=\"col\"| Peakposition\n|-\n|}\nReferences"
    }
  ]
}