{
  "content": [
    {
      "type": "text",
      "text": "# Ludgershall, Buckinghamshire\n\n|os_grid_reference= SP661174\n|population= 409\n|population_ref= (2011 Census)\n|official_name= Ludgershall\n|civil_parish= Ludgershall\n|unitary_england     = Buckinghamshire\n|lieutenancy_england = Buckinghamshire\n|region= South East England\n|constituency_westminster= Mid Buckinghamshire\n|post_town= Aylesbury\n|postcode_district= HP18\n|postcode_area= HP\n|dial_code= 01844\n|website= [http://ludgershall.wordpress.com/ Ludgershall Village Buckinghamshire]\n}}\nLudgershall is a village and civil parish in the unitary authority area of Buckinghamshire, England. It is near the boundary with Oxfordshire, about  south-east of Bicester and  west of Waddesdon.\nToponym\nThe toponym is said to be derived from the Old English for \"nook with a trapping spear\" but this is disputed. It occurs in more than one place in England (see Ludgershall (disambiguation)). The Domesday Book of 1086 records the village as Litlegarsele. The place spelt at Lotegarshale, seen in 1381, may refer to the Buckinghamshire village, or the one in Wiltshire.\nHistory\nHenry II granted land in the parish to the priory of Santingfeld in Picardy, France. It is possible that a hospital was founded on this land, although it is uncertain. In the reign of Henry VI, when all alien church possessions were seized by the Crown, this land was given to King's College, Cambridge.\nThe theologian John Wyclif was vicar of Ludgershall 1368–74.\nSt Mary the Virgin Church\nThe parish church of St Mary the Virgin on Church Lane is a Grade I listed church, dating from the 14th century with 19th century additions. The Bible scholar John Wycliffe is reported to have been an early vicar.\nLudgershall Bike Night\nThe village plays host to an annual charity motorbike night, typically on the first Monday in July. The free to attend meet sees riders of vintage, classic and contemporary motorcycles gather on the village green. The event is attended by multiple motorcycle clubs and enthusiasts alike.\nReferences\nSources & further reading\n*\n*\n*\nExternal links"
    }
  ]
}