{
  "content": [
    {
      "type": "text",
      "text": "# Ludwik Waryński__disambig_1\n\n| birth_place = Martynówka, Kanev uezd, Kiev Governorate, Russian Empire\n| death_date  =\n| death_place = Schlüsselburg Fortress, Saint Petersburg Governorate, Russian Empire\n| restingplace        =\n| nationality         = Polish\n| party               = Proletariat\n| otherparty          =\n| relations           =\n| residence           =\n| alma_mater          =\n| occupation          = Politician, activist\n| cabinet             =\n| committees          =\n| religion            =\n| signature           =\n| footnotes           =\n| blank1              =\n| data1               =\n| blank2              =\n| data2               =\n}}\nLudwik Tadeusz Waryński (24 September 1856 at Martynówka – 2 March 1889 in Shlisselburg) was an activist and theoretician of the socialist movement in Poland.\nBiography\nWaryński was born at Martynówka, Kiev Governorate (Мартинівка in present-day Kaniv Raion, Cherkasy Oblast, Ukraine), the son of a January Uprising insurrectionist. In 1865, he began his education at the gymnasium in Bila Tserkva. Beginning in 1874 he studied in Saint Petersburg at the Technological Institute, where he met other socialists, and joined the Polish Socialist Youth. Student disturbances at the Institute in 1875 led to Waryński being forced to leave. He returned to his father's residence under police surveillance, and spent the next year educating himself.\nEarly in 1877, he arrived in Warsaw and dedicated himself to furthering socialism in Polish. He founded the first socialist magazine in the lands of the Russian-occupied Poland. He then joined the Agronomical School in Puławy while still a leader of Warsaw's workers movement. In 1879 Tsarist police found him in Warsaw and forced him to leave Russia.\nHe moved to Lvov, and, one year later, to Kraków, where he continued his socialist work. He was arrested by Austro-Hungarian police in February 1879 and jailed until his trial in February 1880, at which he was acquitted (after making a long speech defending the socialist ideas). Nevertheless, he was forced to leave for Switzerland, where his socialist ideas and international contacts developed further. Waryński was the author of the Brussels Program, an ideological declaration of Polish socialists. During his stay in Switzerland, he also met his future wife Anna Sieroszewska (sister of Wacław Sieroszewski), with whom he had a son, Tadeusz.\nIn 1882, Waryński returned to Warsaw, where he created the first Polish workers' party, called The Proletariat. In 1883 he was arrested by the Tsarist secret police and, after a trial with 29 co-defendants in 1885, sentenced to 16 years in prison in Shlisselburg. He died there of tuberculosis 4 years later.\nLegacy\nDuring the times of the People's Republic of Poland, the socialist movement pioneered by Waryński was conventionally presented as the starting point of the Polish socialist tradition. Countless Polish schoolchildren memorized Elegia o śmierci Ludwika Waryńskiego, the powerful poem of Waryński's death by Władysław Broniewski.\nHe was commemorated on the Polish 100 zloty banknote between 1975 and 1996.\nIn 1952 a Warsaw factory was named after Waryński and became a large producer of excavators, bulldozers, cranes and other building equipment (pl: Warszawskie Zakłady Budowy Urządzeń Przemysłowych, en: Warsaw Industrial Machinery Construction Works). Today, after privatisation and transformation, it is the core of the Waryński Holding Group.\nA 1979 Polish movie Biały mazur is a biography of Waryński.\nThere are several monuments to Waryński in Poland and Ukraine.\nFootnotes\nBibliography\n*\n*\n*"
    }
  ]
}