{
  "content": [
    {
      "type": "text",
      "text": "# Lurking Fear (film)__disambig_1\n\n}}\n| runtime        = 76 minutes\n| country        =\n| language       = English\n| budget         =\n}}\nLurking Fear is a 1994 horror film, loosely based on the H. P. Lovecraft short story \"The Lurking Fear\".  It was produced by Charles Band's Full Moon Entertainment and written and directed by C. Courtney Joyner. It’s an international co-production between the United States and Romania.\nPlot\nEx-con John Martense (Blake Adams) returns to his childhood home of Leffert's Corners after serving time for a crime he didn't commit.  Martense visits family friend Knaggs (Vincent Schiavelli), a mortician who has been holding half of a map for him.  The map leads to a graveyard where Martense's father hid the money from his last heist.  Arriving at an abandoned church, Martense is confronted by Cathryn (Ashley Laurence), a young woman seeking revenge for the murder of her sister, and town doctor Dr. Haggis (Jeffrey Combs).  This group is quickly joined by a trio of criminals who are looking to find the money John's father stole from them.  What everyone is not aware of are the humanoid creatures lurking underneath the holy grounds.\nProduction\nLurking Fear was shot in Romania.\nRelease\nLurking Fear was released in July 1994. Director C. Courtney Joyner reflected on the release later, stating that \"I was very hard on myself and upset after the film was completed and released.\" and that he was \"surprised by how extraordinarily generous the reviews were. We ended up getting a very lucrative cable sale out of the Full Moon catalogue after the film was primarily out.\"\nLurking Fear was released on DVD by Wizard on Oct 23, 2012.\nCritical reaction\nThe film received mostly negative reviews from critics. TV Guide awarded the film a negative 1 out of 4 stars, criticizing the film's execution, and the one-note performances by the film's actors.\nFilm critic Leonard Maltin awarded the film 1 1/2 out of 4 stars calling the film \"seedy\", and \"more derived from Key Largo than H.P. Lovecraft's story\".\nIn their book Lurker in the Lobby: A Guide to the Cinema of H. P. Lovecraft, Andrew Migliore and John Strysik write: \"As with many Full Moon films, Lurking Fear trailer is better than the feature it promotes. That's unfortunate because Joyner had a wonderful professional cast who, with a cleaned-up script and a hands-on producer, could have made the film a standout among [Lovecraft] adaptations.\"\nReferences\nSources\n*\n*\nExternal links\n*\n*"
    }
  ]
}