{
  "content": [
    {
      "type": "text",
      "text": "# Luzerne County Historical Society\n\n}}\nThe Luzerne County Historical Society is one of the oldest continually operating local historical societies in America.  It was founded on February 11, 1858, in recognition of the 50th anniversary of the first successful burning of anthracite coal by Jesse Fell, and was originally named the Wyoming Historical and Geological Society.  The organization operates the historic Swetland Homestead in Wyoming, Pennsylvania and the Luzerne County Museum which also features a separate research library in Wilkes-Barre, Pennsylvania. It also administers the Nathan Denison house.\nHistory and development\nOn February 11, 1858 a group met at the Old Fell Tavern in Wilkes-Barre to celebrate the fiftieth anniversary of the first known successful burning of anthracite coal in an open grate by Judge Jesse Fell. During the ceremony, General Edmund L. Dana suggested the founding of a historical society. A resolution was passed unanimously, and the Wyoming Historical and Geological Society was incorporated in May 1858.\nBy 1877, the Society had acquired rooms in the Odd Fellows Hall and was able to open its collection to the public on Friday evenings. It later added a meeting room and library, and memberships and donations increased.\nIn 1882, Isaac Osterhout directed that space for the Society be included in the free library that was to be established under his will. The Osterhout Free Library trustees voted to erect a separate building behind the library to house the collections of the Society. The money was appropriated, and building opened in 1893.\nWith the acquisition of the Swetland Homestead in 1958 and the Bishop Library in 1971, the Wyoming Historical and Geological Society reached its present stature.\nSociety's mission\nThe Society strives to promote and preserve Luzerne County's collective history.  In 2000, the Society adopted a new name to better reflect its mission:  the Luzerne County Historical Society.\nThe Society maintains the storehouse for the collective memory of Luzerne County and its environs.  It records and interprets the history, traditions, events, people and cultures that have directed and molded life within the region.\nMuseum admission\nThroughout most of its existence, admission to the museum has been free at all times to anyone. , the Luzerne County Historical Society charges an admission fee of $3.00 for children & $5.00 for adults to its downtown museum and research library. Members are still admitted for free.\nSee also\n* List of historical societies in Pennsylvania\nReferences\n*\nExternal links\n*"
    }
  ]
}