{
  "content": [
    {
      "type": "text",
      "text": "# LX(R)-class amphibious warfare ship\n\n{|\n(projected)\n| Class before             =\n| Class after              =\n| Subclasses               =\n| Cost                     =\n| Built range              =\n| In commission range      =\n| Total ships building     =\n| Total ships planned      = 13\n| Total ships completed    =\n| Total ships cancelled    =\n| Total ships active       =\n| Total ships laid up      =\n| Total ships lost         =\n| Total ships retired      =\n| Total ships scrapped     =\n| Total ships preserved    =\n}}\n| Ship beam =\n| Ship draft = , full load\n| Ship propulsion =\n| Ship speed = In excess of\n| Ship range =\n| Ship complement = 396\n| Ship capacity = 506\n| Ship sensors = AN/SPY-6(V)2 Enterprise Air Surveillance Radar (EASR)\n| Ship EW =\n| Ship boats =\n| Ship armament =*Two 25&nbsp;mm Mk&nbsp;38 autocannon\n*Two Rolling Airframe Missile launchers\n*Four .50 BMG machine guns\n| Ship aircraft = Two MV-22 tilt rotor aircraft\n| Ship notes =\n}}\n|}\nThe LX(R) class (formerly LSD(X) class) is a class of amphibious warfare ships under development for the United States Navy, to be contracted from 2020, as a replacement for the current  and  dock landing ships.\nThe LX(R) is expected to enter service by 2025 or 2026. It will complement existing Whidbey Island-class and Harpers Ferry-class ships in U.S. service, eventually replacing these ships by 2039.\nDevelopment\nThe LX(R) was previously referred to as the LSD(X). The designation was changed to LX(R) in 2012 to signal that the replacement for the existing  and  ships (LSD-41/49 class) would be an amphibious warfare ship that would meet the needs of the U.S. Navy and Marine Corps, regardless of whether that turned out to be a ship that might be designated as a dock landing ship (LSD).\nIn 2013 and 2014 the Navy conducted a review of various design alternatives for the LX(R), including: adopting the existing  design as-is, adopting a modified  version of the San Antonio-class design with reduced capability and reduced cost, creating a brand new \"clean-sheet\" design, or adopting an existing foreign design. In early 2014, Huntington Ingalls Industries suggested a modified version of the San Antonio-class hull for the Navy's LX(R) amphibious warfare ship, which they designated as \"LPD Flight IIA\". This design  modified the San Antonio class by removing some of its higher-end capabilities, resulting in a design that had improved command and control features compared to the existing LSDs, half the medical spaces of the San Antonio class, a smaller hangar for stowing two MV-22 tilt rotor aircraft, no composite masts, two main propulsion diesel engines instead of four, two spots for Landing Craft Air Cushion hovercraft or one Landing Craft Utility boat, and a reduced troop capacity.\nIn October 2014, Secretary of the Navy Ray Mabus signed an internal memo recommending that the LX(R) amphibious warfare ship be based on the existing San Antonio-class design. This modified San Antonio-class design was selected over a foreign variant and an entirely new design in order to meet required capability, capacity, and cost parameters. On 25 June 2015, the Navy solicited the design of LX(R) based on a modified San Antonio-class design.  Huntington Ingalls was awarded the majority of the contract for the design of the LX(R). On 15 September 2016 Huntington Ingalls was awarded a $19.1 million contract for design acceleration of the LX(R).\nSince the LX(R) is based on the San Antonio-class design, some of the design innovations and cost-reduction strategies developed for the LX(R) will be applied to , allowing it to be built at reduced cost. This will make Fort Lauderdale a \"transitional ship\" between the current San Antonio-class design and future LX(R) ships. In April 2018 the U.S. Navy announced that the forthcoming LX(R) amphibious warfare ship will be designated as San Antonio-class Flight II, that LPD-29 will be an additional transitional ship between the end of the San Antonio program and the beginning of LX(R), and that the first San Antonio-class Flight II ship will be LPD-30.\nOn 6 April 2018 the U.S. Navy announced that they had selected Huntington Ingalls Industries subsidiary Ingalls Shipbuilding to build the first LX(R), a San Antonio-class Flight II with LPD-30 as the lead ship. On 26 March 2019, Huntington Ingalls announced the award of a US$1.47 billion, fixed-price incentive contract for LPD 30 (the 14th ship, and first of Flight II). On 10 October 2019, its name was announced as  after Harrisburg, Pennsylvania, the state's capital. The U.S. Navy intends to award the contract for the second in 2022, followed by one each year after that, for a  total of a 13-ship class.\nDesign\nThe LX(R) design is a less expensive and, in some ways, a less capable derivative of the design of San Antonio class. It is considerably larger than the two LSD classes it replaces. Some of the higher-end capabilities of the San Antonio class have been removed, resulting in a design that has improved command and control features compared to the existing LSDs, half the medical spaces of the San Antonio class, a smaller hangar for stowing two MV-22s, conventional steel masts instead of composite masts, two main propulsion diesel engines instead of four, two spots for LCACs or one LCU, and a reduced troop capacity. LX(R) will use the AN/SPY-6 Enterprise Air Surveillance Radar (EASR) volume air search radar. The s starting with  and the s starting with  will also have this radar. LX(R) will incorporate a high temperature superconductor-based ship mine protection degaussing system built by American Superconductor to reduce the magnetic signature of the ships.\nSee also\n* FFG(X)\nReferences\nExternal links\n* [https://www.navsea.navy.mil/Home/Team-Ships/PEO-Ships/LPD-17/LX-R/ NAVSEA LX(R) Program Summary]\n* [http://www.huntingtoningalls.com/lpd-flight-ii-future-amphibious-warships/ LPD Flight II: The Future of Amphibious Warships]"
    }
  ]
}