{
  "content": [
    {
      "type": "text",
      "text": "# Lyceum (software)\n\n}}\nLyceum is a synchronous computer-mediated communication (CMC) software which allows groups of people to speak to one another in real time over the Internet using Voice over IP conferencing.\nLyceum was developed at the Open University in the UK and was introduced into language tutorials in 2002. It also offers an interactive whiteboard (for writing, drawing and importing images, e.g. from the Web), a concept mapping device (for taking notes or writing short texts), a word processor (for jointly writing and editing longer documents) and a written text chat facility.\nThe software was written in Java, with some C code to integrate a third party native library used for the Voice over IP conferencing functionality.\nThe use of the software for language learning has been reported at different stages, from the pilot projects since 1997 (Hauck & Haezewindt, 1999, Shield 2000, Kötter 2001, Hewer and Shield 2001), to reports of the mainstream use (Hampel 2003, Hampel & Hauck 2004). Recent articles include task design (Rosell-Aguilar, 2005), tutor roles (Hampel & Stickler, 2005, Rosell-Aguilar, 2007), tutor impressions (Rosell-Aguilar, 2006a), and student impressions (Rosell-Aguilar, 2006b)\nReferences\n* Hampel, R. (2003) Theoretical Perspectives and New Practices in Audio-Graphic Conferencing for Language Learning. ReCALL, 15 (1), p 21–36.\n* Hampel, R. and Hauck, M. (2004) Towards and Effective Use of Audio Conferencing in Distance Learning Courses. Language Learning and Technology, 8 (1), p 66–82.\n* Hampel, R. & Stickler, U. (2005). New Skills for new classrooms. Training tutors to teach languages online. In CALL (Computer Assisted Language Learning). 18 (4). pp.&nbsp;311 – 326.\n*\n* Hampel, R. (2007). New literacies and the affordances of the new media: Using audiographic computer conferencing for language learning. In: Schneider, Würffel (eds.): Kooperation & Steuerung. Fremdsprachenlernen und Lehrerbildung mit digitalen Medien. Gießener Beiträge zur Fremdsprachendidaktik. Tübingen: Narr, 33–53.\n* Hauck, M. and Haezewindt, B. (1999) Adding a new perspective to distance (language) learning and teaching – the tutor's perspective. ReCALL, 11 (2), p 46–54.\n* Hewer, S. & Shield, L. (2001) 'Online Communities: Interactive Oral Work at a Distance', in Atkinson, T. (ed.) Reflections on computers and language learning, UK, CILT Reflections Series, 53–62.\n* Kötter, M. (2001) Developing Distance Language Learners’ Interactive Competence – Can Synchronous Audio do the trick? International Journal of Educational Telecommunications, 7 (4), 327–353.\n* Rosell-Aguilar, F. (2005) Task design for audiographic conferencing: Promoting beginner oral interaction in distance language learning. Computer Assisted Language Learning 18 (5), 417–442.\n* Rosell-Aguilar, F. (2006a) Online tutorial support in Open Distance Learning through audio-graphic SCMC: tutor impressions. JALT-CALL Journal, 2 (2).[https://jaltcall.org/journal/]\n* Rosell-Aguilar, F. (2006b) The face-to-face and the online learner: a comparative study of tutorial support for Open and Distance Language Learning and the learner experience with audio-graphic SCMC. In Liontas, J. (ed) The Reading Matrix 5th Anniversary Special Issue - CALL Technologies and the Digital Learner, 6 (3), 248–268.[https://www.readingmatrix.com/articles/rosell-aguilar/article.pdf]\n* Rosell-Aguilar, F. (2007) Changing tutor roles in online tutorial support for Open Distance Learning through audio-graphic SCMC. JALT-CALL Journal, 3 (1-2).[https://jaltcall.org/journal/]\n* Shield, L. (2000) Overcoming Isolation: the loneliness of the long distance language learner.  Keynote address at the EADTU Paris Millennium Conference: Wiring the Ivory Tower. Paris, France."
    }
  ]
}