{
  "content": [
    {
      "type": "text",
      "text": "# Lymphovascular invasion\n\nMicrograph showing lymphovascular invasion (top of image) in a case of [[laryngeal cancer. H&E stain.]]\nLymphovascular invasion (LVI or lymphovascular space invasion) is the invasion of a cancer to the blood vessels and/or lymphatics.\nTerminology\nLymph: A clear or white fluid that travels through vessels, moves within tissues and work to keep all the parts of the body clean.\nVascular: The body's network of blood vessels.\nWhen cancer spreads to lymph and vascular system, it is thus termed as Lymphovascular Invasion.\nPathology\nLymphovascular invasion, especially in carcinomas, usually precedes spread to the lymph nodes that drain the tissue in which the tumour arose.  Conversely, cancers with lymph node spread (known as a lymph node metastases), usually have lymphovascular invasion.  Lymph node metastases usually precede secondary tumours, i.e. distant metastases.\nThe absence of LVI in the context of proven lymph node metastasis is usually thought to be due to sampling error.\nPrognostic significance\nThe predictive value and prevalence of lymphovascular invasion is strongly dependent on the type of cancer.  In other words, LVI in one type of cancer may be much less important than LVI in another type of cancer.\nGenerally speaking, it is associated with lymph node metastases which themselves are predictive of a poorer prognosis. In the context of (histologically) proven lymph node metastases, LVI may have less prognostic significance or no prognostic significance.\nBreast cancer\nof the breast.]]\nWhether LVI is a significant prognostic factor in breast cancer is widely debated, and there is no clear consensus.\nUrothelial carcinoma\nIn urothelial carcinoma, LVI is an independent predictor of a poorer prognosis that has more predictive power than tumour stage.\nColorectal cancer\nIn sporadic colorectal carcinoma, LVI of a poorer prognosis.\nSee also\n* Perineural invasion\n* Malignancy\nReferences"
    }
  ]
}