{
  "content": [
    {
      "type": "text",
      "text": "# M. Warley Platzek\n\nMax Warley Platzek (August 27, 1854 – July 21, 1932), was a Jewish-American lawyer and judge.\nLife\nPlatzek was born on August 27, 1854, in Lumberton, North Carolina, the son of German immigrants Isaac Platzek and Sarah Wilson.\nPlatzek attended the district school in Fayetteville and the high school in Richmond, Virginia, and later received a private tuition from Professor Withero of South Carolina. Before his twenty-first birthday, he became Clerk of the Common Council of the Common Council Court of Marion Court House in Marion, South Carolina. When he attained his majority, he was immediately appointed County Assessor and Treasurer. At one point, he worked in the South Carolina firm Warley & McKerall. Wanting to study law, he moved to New York City, New York, and entered New York University School of Law. He graduated from there as class orator with a Bachelor of Laws degree in 1876. He spent a year working in the offices of Judge Joseph P. Joachimson. He was admitted to the New York bar in 1876, after which he made a specialty of commercial and insolvency laws as well as the trial of jury cases. Shortly after graduating, he was appointed a member of the New York University School of Law's Examining Committee, and he served in that committee for ten years. He was also admitted to the South Carolina bar in 1875, and in 1899 he received an honorary Doctor of Laws degree from Rutherford College in North Carolina.\nPlatzek was a delegate to the 1894 New York State Constitutional Convention and the 1904 Democratic National Convention. In 1901, he was a member of a committee Tammany Hall appointed to investigate social vice in New York. In 1902, he was a member of the Citizens' Committee for the persecution of the Beef Trust. He served as trustee of the College of the City of New York from 1904 to 1907. He was elected Justice of the New York Supreme Court in 1907. He was re-elected Justice in 1920. He retired from the Court upon reaching the age limit, after which he became official referee.\nPlatzek became president of both Kesher Shel Barzel and the Young Men's Hebrew Association in 1883. He was also president of the Progress Club for two years, a founder of the Educational Alliance, a governor of the Democratic Club of New York, an executive committee member of the New York State Bar Association, and a director of the Montefiore Home. He was a member of the Hebrew Orphan Asylum, Mount Sinai Hospital, St. John's Guild, the Home for Aged and Infirm Hebrews, the Society for the Prevention of Cruelty to Children, the Hebrew Free Schools, the Society for the Prevention of Cruelty to Animals, the Hebrew Sheltering and Guardian Society, the Jewish Publication Society, the American Jewish Historical Society, the Metropolitan Museum of Art, and the Jewish Theological Seminary.\nPlatzek died at home of a stomach ailment on July 21, 1932. He was never married Rabbi Morris Goldstein of Congregation B'nai Jeshurun officiated his funeral service at a funeral parlor at 52nd Street and Lexington Avenue. The funeral was attended by his former political associates, including former United States Senator James A. O'Gorman, former Municipal Court Justice David L. Weil, the Jewish Federation of Philanthropic Organizations head Sol M. Stroock, and New York Supreme Court Justice Alfred Frankenthaler. He was buried in Oakdale Cemetery in Wilmington, North Carolina, with Rabbi Frederick I. Pypins officiated a funeral service conducted there.\nReferences\nExternal links\n* [https://politicalgraveyard.com/bio/pittsford-platzek.html#874.21.12 The Political Graveyard]"
    }
  ]
}