{
  "content": [
    {
      "type": "text",
      "text": "# Ma'n dynasty\n\n(Banū Maʿn)\n|coat_of_arms=Maanid Emirate Flag.svg\n|coat_of_arms_caption=Flag of the Ma'nid dynasty\n|founded=\n*1120 (as cited by local tradition)\n*Late 15th century (as attested historically)\n|founder=\n*Ma'n (as cited by local tradition)\n*Fakhr al-Din ibn al-Hajj Yunus (; first historically attested)\n|dissolution=1697\n|final_ruler=Ahmed ibn Mulhim ibn Yunus\n|members=\n*Fakhr al-Din (II) ibn Qurqumaz ()\n*Mulhim ibn Yunus (\n|country=The Chouf in Mount Lebanon, part of the:\n*Burid Emirate/Kingdom of Jerusalem (1120–1154)\n*Zengid Emirate/Kingdom of Jerusalem (1154–1187)\n*Ayyubid Sultanate (1187–1260)\n*Mamluk Sultanate (1260–1517)\n*Ottoman Empire (1517–1697)\n}}\nThe '''Ma'n dynasty' (, alternatively spelled Ma'an), also known as the 'Ma'nids'''; (), were a family of Druze chiefs of Arab stock based in the rugged Chouf area of southern Mount Lebanon who were politically prominent in the 15th–17th centuries. Traditional Lebanese histories date the family's arrival in the Chouf to the 12th century, when they were held to have struggled against the Crusader lords of Beirut and of Sidon alongside their Druze allies, the Tanukh Buhturids. They may have been part of a wider movement by the Muslim rulers of Damascus to settle militarized Arab tribesmen in Mount Lebanon as a buffer against the Crusader strongholds along the Levantine coast. Fakhr al-Din I (), the first member of the family whose historicity is certain, was the \"emir of the Chouf\", according to contemporary sources and, despite the non-use of mosques by the Druze, founded the Fakhreddine Mosque in the family's stronghold of Deir al-Qamar.\nTwo years following the advent of Ottoman rule in the Syrian region in 1516, three chiefs of the Ma'n dynasty were imprisoned for rebellion by the Damascus Eyalet governor Janbirdi al-Ghazali, but released by Sultan Selim I. The Ma'ns and their Druze coreligionists in the Chouf were continually targeted in punitive campaigns by the Ottomans related to their evasion and defiance of government tax collectors and their stockpiling of illegal firearms, which were often superior to those of the government troops. The particularly destructive 1585 Ottoman expedition against the Druze prompted the Ma'nid emir Qurqumaz ibn Yunis to go into hiding in the neighboring Kisrawan, where he died the following year.\nHis son, Fakhr al-Din II, emerged  as the local chief and tax farmer of the Chouf and, in contrast to his Ma'nid predecessors, cultivated close ties with the authorities in Damascus and the imperial capital, Constantinople. In 1593, he was appointed the governor of the Sidon-Beirut Sanjak, spanning southern Mount Lebanon and the coastal towns of Beirut and Sidon, and in 1602 was additionally appointed to the Safed Sanjak, spanning the Jabal Amil, Galilee, and port of Acre. By 1613, he had amassed considerable power but lost his imperial patron, while his illicit takeover of strategic forts, hiring of outlawed musketeers, and government knowledge of his alliance with their Tuscan enemies prompted a major campaign against the Ma'ns. The dynasty lost its territories and forts and Fakhr al-Din escaped to Italy. Within two years, his brother Yunus and son Ali restored Ma'nid power in Sidon-Beirut and Safed, which was consolidated when Fakhr al-Din returned to lead the dynasty in 1618. After a few years, he defeated his major rival Yusuf Sayfa of Tripoli and extended Ma'nid dominion and tax farming rights to predominantly Maronite, northern Mount Lebanon. By 1630 he controlled much of Tripoli Eyalet and was poised against Damascus. The imperial government destroyed Ma'nid power in a second expedition in 1633, killing most of the dynasty's members and capturing and executing Fakhr al-Din in 1635.\nA surviving son of Yunus, Mulhim Ma'n defeated the family's government-backed Druze\nrival, Ali Alam al-Din, in 1636 and regained the iltizam of the Druze Mountain in 1642. His sons Ahmad and Qurqumaz succeeded him as paramount emirs of the Druze in 1658, but were challenged by the Alam al-Dins and other Ottoman-backed Druze from the start. Qurqumaz was killed by the Ottomans in 1662. Ahmad defeated the Alam al-Dins in 1667 and assumed the iltizam of the Druze Mountain and neighboring, Maronite-populated Kisrawan. He maintained control of the region despite government dismissals and campaigns against him throughout the 1690s for backing Shia rebels. Ma'nid rule came to an end when Ahmad died without male progeny in 1697. The Druze chiefs selected Bashir Shihab, whose mother was Mulhim's daughter, to succeed Ahmad. He held the iltizam of Druze Mountain and Kisrawan until his death in 1706, after which Haydar Shihab, whose mother was a daughter of Ahmad, took his place. His descendants from the Shihab dynasty continued to hold the iltizam until the expulsion of Bashir II in 1841. The emirate and iltizam of the Ma'ns and Shihabs over much of Mount Lebanon is viewed by historians as an early precursor to present-day Lebanon.\nHistory\nOrigins\nwhere, according to traditional accounts, the Ma'nids established themselves as a bulwark against the Crusaders of Beirut in 1120]]\nAccording to the historian Kamal Salibi, the \"origins of the house of Ma'n remains unclear, what is related about it by the traditional Lebanese historians being without foundation\". The traditional account holds that the eponymous progenitor of the Banu Ma'n belonged to a clan of the Rabi'a, a large Arab tribal confederation with branches in the upper Euphrates River valley. Ma'n fought alongside the Artuqid leader Ilghazi against the Crusaders in northern Syria. He later moved to the Beqaa Valley until being transferred to the area of the Chouf (also transliterated as Shuf) in southern Mount Lebanon in 1120 by Ilghazi's ally, Toghtekin of Damascus, to reinforce the Tanukhid Druze emirs of the neighboring Gharb district around modern Aley against the Crusader lords of Beirut. According to Salibi's analysis of the 19th-century history of Tannus al-Shidyaq, the deployment of the Ma'n was part of the wider deployment of Arab military settlers to parts of Mount Lebanon and its environs by the Muslim rulers of Damascus to counter the Crusaders. The emirs of the Banu Shihab, an Arab family established in nearby Wadi al-Taym, collaborated with the Ma'nids against the Crusaders and from early on the two families established marital ties.\nThe Crusaders had captured Beirut in 1110 and during their subsequent raids against the Gharb the Tanukhid emir Adud al-Dawla and most of his kinsmen were slain. Ma'n had found the Chouf abandoned, though there is no evidence of its desolation at the time, according to the historian Robert Brendon Betts. The Tanukhid emir Buhtur, who was appointed commander of the Gharb by Damascus in 1147, supported the Ma'nid emir in constructing permanents dwellings for his clan in the Chouf. The Ma'n were joined in the settlement of the Chouf by their north Syrian associates, the Abu Nakad and Talhuq clans. Refugees from nearby areas taken over by the Crusaders migrated to the Chouf and numerous villages were founded, including the Ma'n's headquarter village of Baaqlin. Baaqlin became a major center of the Druze faith, and in the present day is the largest Druze locality in Lebanon. Betts deems it improbable that the Banu Ma'n had been followers of \"the Druze religion before coming into its sphere\" in Mount Lebanon. Ma'n died in 1148 and was succeeded as head of his clan by his son Mundhir. According to the historian William Harris, the Banu Ma'n retained their lordship of the Chouf, as well as their ties to the descendants of Buhtur and the Banu Shihab, from their establishment in 1120 through the Mamluk era (1260–1516).\n, which contained an inscription crediting the Ma'nid emir Fakhr al-Din Uthman for its construction in 1493]]\nThe first Ma'nid \"whose historicity is beyond question\" was Fakhr al-Din Uthman, in the words of Salibi. He is also referred to as Fakhr al-Din I to distinguish him from his better known descendant. The Gharb-based Druze chronicler Ibn Sibat () refers to Fakhr al-Din Uthman as the \"emir of the Ashwaf [plural of Chouf] in the region of Sidon\" who died in August/September 1506. The Damascene historian Shams al-Din ibn Tulun () notes that a certain \"Ibn Ma'n\" was in the custody of the Mamluk governor of Damascus in 1498–99. An inscription in a mosque in Deir al-Qamar, a major village in the Chouf, credits \"al-Maqarr al-Fakhri [the Fakhrid Seat] Emir Fakhr al-Din Uthman ibn al-Hajj Yunus ibn Ma'n\" as the builder of the mosque in 1493. Fakhr al-Din's construction of a mosque, which were not used by the Druze, and the  honorific of al-Hajj attached to the name of his father Yunus indicates they were influenced by the major Druze religious reformer, their contemporary al-Sayyid al-Tanukhi (), who advocated for Druze adoption of traditional Muslim rituals. They may also have represented attempts to gain favor with the Sunni Muslim Mamluk rulers. The usage of the terms \"emir\" (commander) and al-Maqarr (an honorific for leading Mamluk officers or officials) suggest the Ma'nid chiefs held military commissions in the Mamluk army. Fakhr al-Din's son Yunus was also called by Ibn Sibat the \"emir of the Ashwaf\" at the time of his death in 1511–12. The accounts of Ibn Sibat indicate the Ma'n controlled all or parts of the Chouf before the Ottoman conquest of the Levant in 1516.\nEarly interactions with the Ottomans\nFollowing the Ottoman conquest, the Chouf was administratively divided into three nahiyas (subdistricts) of the Sidon-Beirut Sanjak, which was a district of the Damascus Eyalet. The Chouf subdistricts, along with the subdistricts of Gharb, Jurd and Matn were predominantly populated by Druze at the time and collectively referred to as the Druze Mountain. The Ottoman sultan Selim I, after entering Damascus and receiving the defection of its Mamluk governor Janbirdi al-Ghazali, who was kept in his post, showed preference to the Turkmen Assaf clan, the Keserwan-based enemies of the Ma'nids' Buhturid allies. He entrusted the Assafs with political authority or tax-farming rights in the subdistricts between Beirut and Tripoli, north of the Druze Mountain. The Buhturid emir Jamal al-Din Hajji did not give allegiance to Selim in Damascus and after discarding an Ottoman call to arms in 1518, he was imprisoned. The son of the Ma'nid emir Yunus, Qurqumaz, was summoned and confirmed by Selim in Damascus as the chief of the Chouf in 1517, according to the 17th-century historian and Maronite patriarch Istifan al-Duwayhi. Ibn Sibat does not mention any Ma'nid being received by the sultan in Damascus, but noted that the Ma'nid emirs Qurqumaz, Alam al-Din Sulayman and Zayn al-Din were all arrested by Janbirdi al-Ghazali in 1518 and transferred to the custody of Selim, who released them after a heavy fine for supporting the rebellion of the Bedouin Banu al-Hansh emirs in Sidon and the Beqaa Valley.\n(pictured in 2005) was the headquarters of Qurqumaz, the grandson of Fakhr al-Din I and ancestor of Fakhr al-Din II ]]\nThe three Ma'nids likely shared the chieftainship of the Chouf, though the length and nature of the arrangement is not known. Zayn al-Din is assumed by the modern historian Abdul-Rahim Abu-Husayn to be the \"Zayn Ibn Ma'n\" mentioned in an Ottoman register as the owner of a dilapidated watermill with two millstones in 1543, while Ibn Tulun's reference to a part of the Chouf as \"Shuf Sulayman Ibn Ma'n\" in 1523 likely refers to Alam al-Din Sulayman. Neither Zayn nor Sulayman are mentioned by later chroniclers of the Ma'nids, likely for political reasons related to the chroniclers' association to the Ma'nid line of Qurqumaz. The latter was based in the Chouf village of Baruk, where he gave refuge to members of the Sayfa family after their flight from Akkar in 1528. Qurqumaz's establishment in Baruk instead of his predecessors' apparent seat in Deir al-Qamar may have been related to a conflict with Alam al-Din Sulayman, who may have controlled Deir al-Qamar at the time, or a division of the Chouf between the Ma'nid chieftains.\nIn 1523, forty-three villages in Shuf Sulayman Ibn Ma'n, including Baruk, were burned by the forces of the Damascus governor Khurram Pasha for tax arrears and Ma'nid disobedience, and the governor's forces sent back to Damascus four cartloads of Druze heads and religious texts in the aftermath of the campaign. According to Harris, \"such brutality entrenched [Druze] resistance\", and in the following year Druze fighters killed subashis (provincial officials) appointed by Khurram Pasha to administer Mount Lebanon's subdistricts, prompting another government expedition against the Chouf, which returned three cartloads of Druze heads and three hundred women and children as captives. The death of Jamal al-Din Hajji in prison in 1521 and the Ottoman expeditions led the Buhturids to accept Ma'nid precedence over the Druze of southern Mount Lebanon. In 1545 the leading emir of the Druze, Yunus Ma'n, was lured to Damascus and executed by the authorities under unclear circumstances, but suggesting continued insubordination by the Druze under Ma'nid leadership.\nFollowing the death of Yunus, the Druze moved to import from the Venetians long-range muskets superior to those employed by the Ottomans.  In 1565 the new arms were put to use by the Druze in an ambush on Ottoman sipahi (fief-holding cavalries) in Ain Dara in the Jurd sent to collect taxes from southern Mount Lebanon. For the next twenty years, the Druze successfully beat back government attempts to collect taxes and confiscate weapons, while increasing their rifle arsenals. In 1585 the imperial authorities organized a much larger campaign against the Chouf and the Sidon-Beirut Sanjak in general led by the beylerbey (provincial governor) of Egypt, Ibrahim Pasha. It ended in a decisive government victory, the confiscation of thousands of rifles and the collection of tax arrears, which had been accruing for decades, in the form of currency or property. The most important leader in the Chouf at the time was a Ma'nid emir named Qurqumaz, possibly the son of Yunus,), Qurqumaz's father, who Minadoi does not name, had been executed by a governor of Damascus named Mustafa Pasha. According to modern historian Abdul-Rahim Abu-Husayn, Qurqumaz's father may have been the \"Yunus Ibn Ma'n\" mentioned in an Ottoman tax register as the owner of three farms in 1530. }} The modern historian Muhammad Adnan Bakhit holds this Yunus was likely the head of the Ma'nids at the time. A Ma'nid chief named Yunus was recorded by the contemporary poet Muhammad ibn Mami al-Rumi () to have been captured and hanged by the Ottomans at an undefined date as a result of unspecified complaints by the qadi (head judge) of Sidon to the Sublime Porte. and possibly the grandson of the above-mentioned Qurqumaz. He had likely been the chieftain of the specific area of the Chouf referred to as \"Shuf Ibn Ma'n\", a subdistrict mentioned in Ottoman government documents from 1523, 1530, 1543 and 1576. His preeminence among the Ma'nids was possibly the result of the natural deaths or eliminations of the other Ma'nid chiefs. Like his father, Qurqumaz was a multazim (tax farmer) in the Chouf, though he resided in Ain Dara, and was recognized as a muqaddam of the Druze, his title of \"emir\" being used by local historians as a traditional honor rather than an official rank. Qurqumaz had refused to submit to Ibrahim Pasha and escaped the Chouf and died soon after in hiding.), Qurqumaz was killed during a government expedition against the Chouf in 1585, precipitated by Qurqumaz's alleged orchestration of an attack the preceding year on a government convoy in Akkar that had been transporting the annual Egyptian tribute destined for the sultan in Constantinople The aftermath of the campaign and the death of Qurqumaz left the Druze Mountain in an anarchic state marked by internal fighting among the Druze.\nEra of Fakhr al-Din II\nControl of Sidon-Beirut and Safed sanjaks\n.}}]]\nAround 1590 Qurqumaz was succeeded by his eldest son Fakhr al-Din II as the muqaddam of all or part of the Chouf. Unlike his Ma'nid predecessors, Fakhr al-Din cooperated with the Ottomans, who, though able to suppress Mount Lebanon's local chiefs with massive force, were unable to pacify the region in the long term without local support. When the veteran general Murad Pasha was appointed beylerbey of Damascus, Fakhr al-Din hosted and gave him expensive gifts upon his arrival to Sidon in September 1593. Murad Pasha reciprocated by appointing him the sanjak-bey (district governor, called amir liwa in Arabic sources) of Sidon-Beirut in December. The Ottomans' preoccupation with the wars against Safavid Iran (1578–1590; 1603–1618) and the war with Hapsburg Austria afforded Fakhr al-Din the space to consolidate and expand his semi-autonomous power.\n'' in Deir al-Qamar, seat of the Ma'n under Fakhr al-Din]]\nIn July 1602, after his political patron Murad Pasha became a vizier in Constantinople, Fakhr al-Din was appointed the sanjak-bey of Safed. With the Druze of Sidon-Beirut and Safed under his authority, he effectively became their paramount chief. Fakhr al-Din may have been appointed to the post to leverage his Druze power base against the Shia.\nIn 1606, Fakhr al-Din made common cause with the Kurdish rebel Ali Janbulad of Aleppo against his local rival Yusuf Sayfa of Tripoli; the latter had been invested as commander-in-chief of the Ottoman armies in the Levant to suppress Janbulad. Fakhr al-Din may have been motivated by his ambitions of regional autonomy, defense of his territory from Sayfa, or expanding his control to Beirut and Keserwan, both held by Sayfa. The rebel allies besieged Sayfa in Damascus, eventually forcing his flight. In the course of the fighting, Fakhr al-Din took over the Keserwan. When Janbulad was defeated by the Ottomans, Fakhr al-Din appeased Murad Pasha, who had since become grand vizier, with substantial sums of cash and goods. The high amount is an indicator of the Ma'ns' wealth. Fakhr al-Din was kept as sanjak-bey of Safed, his son Ali was appointed as sanjak-bey of Sidon-Beirut and the Ma'ns' control of Keserwan was recognized by the Porte.\nwas a stronghold of Fakhr al-Din, guarding his domains from the south.]]\nInterregnum of Yunus and Ali\nFakhr al-Din lost imperial favor with the death of Murad Pasha in July 1611 and the succession of Nasuh Pasha. By then the Porte, freed up from the wars with Austria and Iran and the Jelali revolts in Anatolia, had turned its attention to affairs in the Levant. The authorities had become wary of Fakhr al-Din's expanding territory, his alliance with Grand Duchy of Tuscany, his unsanctioned strengthening and garrisoning of fortresses and his employment of outlawed sekbans. Nasuh Pasha appointed Ahmed Pasha, the governor of Damascus, at the head of a large army to suppress Fakhr al-Din. The latter boarded a European ship and escaped to Livorno, Tuscany.\nIn Fakhr al-Din's absence his younger brother Yunus acted as head of the family in the Chouf. The Ma'ns' sekbans stationed in their headquarter village of Deir al-Qamar collaborated with Ahmed Pasha, prompting Yunus to abandon the village for Baakline. Ali Ma'n, meanwhile, was deserted by his bodyguard of sekbans in Mafraq in the Syrian Desert where he evaded Ahmed Pasha. The Ma'nid fortresses of Shaqif Arnun and Subayba, which the Ottomans sought to dismantle, were controlled by the family's sekbans led by Husayn Yaziji and Husayn Tawil, respectively; with the help of the rival Harfush dynasty of Baalbek, the sekban commanders arranged the two fortresses' demolition and were rewarded by the authorities. The Ma'ns were stripped of their governorships of Sidon-Beirut, Safed, and Keserwan, but Yunus retained the tax farm of the Chouf from the governor of the newly created Sidon Eyalet in 1614. Their Druze and Shia rivals re-emerged as the tax farmers and governors of their home districts in Mount Lebanon and Jabal Amil.\nAlthough the Ma'ns' position was severely weakened, in 1615 political circumstances changed in their favor with Nasuh Pasha being executed, Ahmed Pasha being replaced by a friendly governor, the Sidon Eyalet being dissolved, and troops being withdrawn from Syria to fight on the Iranian front. Yunus and Ali were appointed to Safed and Sidon-Beirut, respectively, and shortly after both governorships were given to Ali. The Ma'ns then confronted their Druze rivals, namely Muzaffar al-Andari of the Jurd, the Arslan chief Muhammad ibn Jamal al-Din of Choueifat in the Gharb, and the Sawwafs of Chbaniyeh in the Matn. Ali and Yunus defeated them in four engagements in the Druze Mountain, at Ighmid, Ain Dara, Abeih and the spring of Naimeh on the coast south of Beirut. In the course of the fighting, they retook control of Beirut and the Keserwan. Afterward Ali awarded the Ma'ns' Tanukhid allies and relatives the tax farms of Beirut, the Gharb and the Jurd, and the Abu'l-Lama family the tax farm of the Matn.\nGrowing opposition to the Ma'ns by the Shias of Safed Sanjak culminated with their backing of Yaziji's efforts to replace Ali as sanjak-bey there and their alliance with the Harfushes in 1617–1618. Yaziji was killed almost immediately after taking up office in Safed in June 1618, and Ali was restored to the post. Meanwhile, tensions rose between the Ma'ns and their Tanukhid and Abillama allies relating to property disputes in Beirut.\nPeak of power\nThe Ottomans pardoned Fakhr al-Din and he returned to Mount Lebanon, arriving in Acre on 29 September 1618. Upon hearing of his return, the Ma'ns' Druze allies immediately reconciled with Ali and from that point there was no further active Druze opposition to Fakhr al-Din. Uneasy about the growing ties between the Harfushes and the Shia chiefs of Safed, he arrested the preeminent chief of the Shia in Jabal Amil, Ali Munkir, and released him after a ransom paid by Yunus al-Harfush. He moved to supervise the collection of taxes in Bilad Bishara in December, prompting the Shia notable families of Ali Saghir, Munkir, Shukr and Daghir to take refuge with Yunus al-Harfush and evade payment. Fakhr al-Din responded by destroying their homes. He then reconciled with the Jabal Amil chiefs and Shia levies thereafter joined his army in his later military campaigns.\nFakhr al-Din moved against the Sayfas in 1619, capturing and looted their stronghold of Hisn Akkar and four days later besieging Yusuf and the latter's Druze allies in the Krak des Chevaliers. He then sent a detachment to burn the Sayfas' home village of Akkar and gained the defection of the Sayfa forts of Byblos and Smar Jbeil. Fakhr al-Din was compelled by Ottoman pressure to lift the siege, but during the hostilities had gained control of the Byblos and Batroun nahiyas. Yusuf was dismissed in 1622 after failing to remit taxes to the Porte, but refused to hand over power to his replacement Umar Kittanji, who in turn requested Fakhr al-Din's military support. Fakhr al-Din complied in return for the iltizam of the Tripoli nahiyas of Dinniyeh, Bsharri and Akkar. Once Fakhr al-Din set out from Ghazir, Yusuf abandoned Tripoli for Akkar. The Emir thereafter sent his Maronite ally Abu Safi Khazen, the brother of his mudabbir (fiscal and political adviser, scribe) Abu Nadir Khazen, to occupy Maronite-populated Bsharri, thereby ending the rule of the local Maronite muqaddams established since the late 14th century. In 1623 Fakhr al-Din mobilized his forces in Bsharri in support of Yusuf's rebellious nephew Sulayman, who controlled Safita. Fakhr al-Din's intervention confirmed the Ma'ns as the practical overlords of Safita.\nfrom 1677 depicting Fakhr al-Din's capture of Mustafa Pasha, beylerbey of Damascus, at the Battle of Anjar in 1623. Fakhr al-Din is shown as the standing, turbaned figure pointing toward Mustafa Pasha, who is being held to the ground.]]\nIn August/September 1623 Fakhr al-Din evicted the Harfushes from the southern Beqaa village of Qabb Ilyas for their prohibition on the Chouf Druze from cultivating their fields there. Meanwhile, in June/July the Porte had replaced Ali Ma'n as sanjak-bey of Safed with a certain Bustanji Bashi and replaced his brother Husayn and the Ma'n loyalist Mustafa Kethuda as the sanjak-beys of Ajlun and Nablus with local opponents of the Ma'ns. The Porte soon after restored the Ma'ns to Ajlun and Nablus, but not to Safed. The Ma'ns thereupon moved to assume control of Ajlun and Nablus. Fakhr al-Din launched a campaign against the Turabays and Farrukhs in northern Palestine, but was defeated in a battle at the Awja River near Ramla. On his way back to Mount Lebanon from the abortive Palestine campaign, Fakhr al-Din was notified that the Porte reappointed his sons and allies to Safed, Ajlun and Nablus. The governor of Damascus, Mustafa Pasha, backed by the Harfushes and Sayfas, nonetheless proceeded to launch an expedition against the Ma'ns. Fakhr al-Din routed the Damascene force at Anjar and captured Mustafa Pasha. Fakhr al-Din extracted from the beylerbey confirmation of the Ma'ns' gpvernorships and the additional appointments of himself over Gaza Sanjak, his son Mansur over Lajjun Sanjak, and Ali over the southern Beqaa nahiya. The appointments to Gaza, Nablus and Lajjun were not implemented due to the opposition of local powerholders. Fakhr al-Din plundered Baalbek soon after Anjar and captured and destroyed its citadel on 28 March. Yunus al-Harfush was executed in 1625, the same year that Fakhr al-Din gained the governorship of the Baalbek nahiya.\nBy 1624, Fakhr al-Din and his allies among the Sayfas who defected from Yusuf was in control of most of the Tripoli Eyalet, except for Tripoli city, the Krak des Chevaliers, the Koura nahiya, and the Jableh sanjak. A few months after Yusuf's death in July 1625, Fakhr al-Din launched an assault against Tripoli. He forced out his old ally Sulayman Sayfa from the Safita fortress and was later ceded the fortresses of Krak des Chevaliers and Marqab by Yusuf's sons. In September 1626 he captured the fortress of Salamiyah, followed by Hama and Homs, appointing his deputies to govern them. Fakhr al-Din was appointed beylerbey of Tripoli in 1627, according solely to Duwayhi. By the early 1630s Fakhr al-Din captured many places around Damascus, controlled thirty fortresses, commanded a large army of sekbans, and, according to a contemporary Ottoman historian, the \"only thing left for him to do was to claim the Sultanate\".\nDemise\nThe imperial government appointed Kuchuk Ahmed Pasha as governor of Damascus and fitted him with a large army to destroy Ma'nid power. Kuchuk first defeated and killed Ali near Khan Hasbaya in Wadi al-Taym. Fakhr al-Din and his men subsequently took refuge in a cave in Niha in the southern Chouf or further south in Jezzine. To smoke them out of their hiding places, Kuckuk started fires around the mountains. Fakhr al-Din consequently surrendered. His sons Mansur and Husayn, the latter of whom was stationed in Marqab, had already been captured by Kuchuk. His sons Hasan, Haydar, and Bulak, his brother Yunus and nephew Hamdan ibn Yunus were all executed by Kuckuk during the expedition. Fakhr al-Din was imprisoned in Constantinople and he and his son Mansur were executed in 1635 on the orders of Murad IV.\nLater emirs\nThe Druze enemy of the Ma'ns, Ali Alam al-Din, was given authority over the Chouf by the Ottomans. A surviving member of the dynasty, Mulhim Ma'n, the son of Yunus and nephew of Fakhr al-Din, had evaded capture and led the Druze opposition to Alam al-Din, defeating him in a battle and forcing his flight to Damascus in 1635. Alam al-Din soon after defeated Mulhim in the Beqaa Valley, but Mulhim finally drove him out of the Chouf in 1636. The people of the Druze Mountain mostly backed him. In 1642 he was appointed by the Ottomans the multazim of the Chouf, Jurd, Gharb, and Matn, a position he largely held until 1657.\nFollowing Mulhim's death, his sons Ahmad and Qurqumaz entered into a power struggle with Ottoman-backed Druze leaders. In 1660, the Ottoman Empire moved to reorganize the region, placing the sanjaks (districts) of Sidon-Beirut and Safed in a newly formed province of Sidon, a move seen by local Druze as an attempt to assert control. Contemporary historian Istifan al-Duwayhi reports that Korkmaz was killed in act of treachery by the Beylerbey of Damascus in 1662. Ahmad however escaped and eventually emerged victorious in the power struggle among the Druze in 1667, but the Maʿnīs lost control of Safad and retreated to controlling the iltizam of the Shuf mountains and Kisrawan. Ahmad continued as local ruler through his death from natural causes, without heir, in 1697. During the Ottoman–Habsburg War (1683–1699), Ahmad Ma'n collaborated in a rebellion against the Ottomans which extended beyond his death. Iltizam rights in Chouf and Kisrawan passed to the rising Shihab family through female-line inheritance.\nArchitectural works and legacy\nTyre\nFakhr al-Din and his brother owned properties in Tyre, all confiscated by Kuchuk, including a mulberry and fig orchard, a large residence, three mills, and a mulberry nursery. The residence belonged to Yunus. Its foundations were evidently built upon ruins from the Crusader period. The ruins are in the center of the present-day souk marketplace and are known as Khan Abdo al-Ashqar, Khan al-Askar, or Khan Sour. After a French diplomatic mission sent by King Louis XIII and Cardinal Richelieu the Ma'nid palace in Tyre came under the ownership of the Franciscans.\nIn the late 18th century, under the rule of the Metwali governor Ali al-Saghir, the palace was turned into a garrison. At the beginning of the 19th century, it was transformed into a khan. The ownership of the place was transferred at an unspecified point from the Franciscans to the Melkite Greek Catholic Archeparchy of Tyre. After the joint British and French Occupied Enemy Territory Administration (OETA) was declared on 23 October 1918 and Jabal Amil came under French control, the French Army used the palace as a base until the joint British-Free French Syria–Lebanon campaign captured the city from Vichy troops in mid-1941.\nWhen Israel launched its invasion of southern Lebanon in June 1982, the Israeli Air Force (IAF) heavily bombed the market area and partly destroyed the palace. In 2003, Randa Berri, president of the National Association for the Preservation of South Lebanon’s Archaeology and Heritage and wife of Nabih Berri, veteran leader of the Amal Movement and Speaker of the Parliament of Lebanon, patronized a plan to renovate the Ma'nid palace and convert it into a museum. As of 2019, nothing was done in that regard and the ruins have kept on crumbling.\nFamily tree\nThe date of Ma'ns death is sourced by this tradition.}}}}\n}}|ALH='Al-Hajj Yunus  The date of his death is from the 19th-century historian from Mount Lebanon, Tannus al-Shidyaq, who erroneously calls him \"Yusuf\".}}\n|boxstyle_IZZ= border-color: red;\n}}\n}}}}\n}}|YUN=Yunus\n|boxstyle_SAY=border-color: red;\n}}\n|NAS=Nasir al-Din Muhammad |QUR=Qurqumaz\n|boxstyle_SHA=border-color: red;\n|boxstyle_NAS=border-color: red;\n}}\n), who was the father of Fakhr al-Din II. The Damascene poet Muhammad ibn Mami () indicates that a Druze chief named Yunus was executed by the Ottoman governor of Damascus, though no date is provided. The Italian historian Giovanni Minadoi () holds that the father of the Qurqumaz who died in 1586 was executed by the Ottomans, but neither provides a date nor the name of the father. The modern researcher Alexander Hourani, citing Ottoman government archives, claims the execution occurred in .}}\n|boxstyle_ALA=border-color: red;\n}}\nsoutheast of Beirut. Hourani argues that he was the grandson of Nasir al-Din Muhammad ibn Sayf al-Din Abu Bakr.}}|SA2=Sayf al-Din }}|SIT=Sitt Nasab|QU2=Qurqumaz |QAS=Qasim\n|boxstyle_MUN=border-color: red;\n|boxstyle_SA2=border-color: red;\n|boxstyle_SIT=border-color: red;\n|boxstyle_QAS=border-color: #AF7AC5;\n}}\n|YU3=Yunus |ALI=Ali |AHM=Ahmad fl.1592–1633\n|boxstyle_FA2 =background-color: #F9E79F;\n|boxstyle_ALI=border-color: #AF7AC5;\n|boxstyle_AHM=border-color: #AF7AC5;\n}}\n|MAN=Mansur |HAS=Hasan |HUS=Husayn |BUL=Buluk |HAY=Haydar |MUL=Mulhim |HAM=Hamdan' |DAU=daughter|QA2=Qasim |HU2=Husayn\n|boxstyle_MUL =background-color: #F9E79F;\n|boxstyle_QA2=border-color: #AF7AC5;\n|boxstyle_HU2=border-color: #AF7AC5;\n}}\n|AH2=Ahmad |FAI='Fa'iza|MA2=Mansur |BAS=Bashir I'\n|boxstyle_QU3 =background-color: #F9E79F;\n|boxstyle_AH2 =background-color: #F9E79F;\n|boxstyle_MA2=border-color: #AF7AC5;\n|boxstyle_BAS=border-color: #AF7AC5; background-color: #F9E79F;\n}}\n|DA2=daughter|MUS=Musa fl.1693\n|boxstyle_MUS=border-color: #AF7AC5;\n}}\n|boxstyle_HA2 =background-color: #F9E79F;\n}}\nSee also\n*Mount Lebanon Emirate\n*Vanguard of the Maani Army (Movement of the Druze Jihad)\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*"
    }
  ]
}