{
  "content": [
    {
      "type": "text",
      "text": "# Mabel King\n\n| birth_place   = Charleston, South Carolina, U.S.\n| death_date    =\n| death_place   = Los Angeles, California, U.S.\n| occupation    =\n| years_active  = 1964&ndash;1990\n| known_for     = Mabel \"Mama\" Thomas –''What's Happening!!Evillene – The Wiz\n| spouse        =\n| children      = 1\n}}\nMabel King (née Donnie Mabel Elizabeth Washington; December 25, 1932 – November 9, 1999) was an American actress and singer. She was known for her role as Mabel \"Mama\" Thomas on the ABC sitcom What's Happening!! from its premiere in 1976 until the end of its second season in 1978. King was also known for portraying Evillene the Witch, a role she originated in the stage musical The Wiz'' and reprised in Sidney Lumet's 1978 film adaptation. She recorded on the Rama Records and Amy Records labels.\nEarly life\nKing was born Donnie Mabel Elizabeth Washington in Charleston, South Carolina, the daughter of Rosalie Washington and Joseph Washington on Christmas Day 1932. She was raised in Harlem, New York where she eventually became a gospel and nightclub singer.\nCareer\nStage work\nShe did not start acting until her mid-thirties, in 1966, when she played the role of Maria in the national touring play of Porgy and Bess. The following year she played the role of Ernestina in the Broadway musical/comedy Hello, Dolly! Then in 1972, she acted in the musical film ''Don't Play Us Cheap, which went unreleased until the following year, after it had been performed on Broadway as a stage play. That same year, she played the Queen of Myrthia in the horror film Ganja & Hess. In January 1975, she played the role of Evillene, the Wicked Witch of the West in the all-African-American cast of the Broadway musical The Wiz. The role earned her a Drama Desk Award nomination for outstanding featured actress in a musical. Her performance in The Wiz brought her much attention and soon after she received roles in the films The Bingo Long Traveling All-Stars & Motor Kings, with Billy Dee Williams and James Earl Jones, and Scott Joplin, with Billy Dee Williams and Clifton Davis. In June 1980, King returned to stage work, starring in the Broadway musical It's So Nice to Be Civilized. However, the show did poorly and closed after eight performances.\nTelevision and film\nIn 1976, she was offered the role of Mabel Thomas on the sitcom What's Happening!!. Her character often used the catch phrase \"This is true\", which she said to her children when she tried to prove a point to them. King played the role from 1976 to 1978, but due to disagreements with the direction the creators wanted to take the series, she left What's Happening!! in 1978 after two seasons. That same year, she reprised the role of Evillene for the 1978 film version of The Wiz. It was the second time in her career that she appeared in a movie after being in the stage version, the first being Don't Play Us Cheap. The following year, she appeared in the film The Jerk'' as the mother to Steve Martin's character. King received mostly guest spots on television series including Fantasy Island, The Jeffersons, Amazing Stories and Tales from the Darkside. In between, she signed on with then Hollywood agent Ruben Malaret, who negotiated her reprised role of Mama Johnson in the made-for-TV movie The Jerk, Too (1984). Her last two movie roles were Scrooged (1988) starring Bill Murray and ''Dead Men Don't Die'' (1990) starring Elliott Gould.\nPersonal life\nKing was married to Melvin King from June 1967 until September 1989. She and Larry Banks had one child, a son named Larry Jr., who died in 1996.\nLater years and death\nKing was diabetic and in 1986 one of her toes was amputated as a result of the disease. In 1990, King suffered a stroke and entered the Motion Picture & Television Country House and Hospital in Woodland Hills, California, effectively ending her professional career. In 1991, King's diabetes resulted in the amputation of her left leg. In 1994, her right leg was also amputated. King would also lose one of her arms to diabetes. On November 9, 1999, King died at the age of 66.\nFilmography\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Title\n! Role\n! class=\"unsortable\" | Notes\n|-\n| 1973\n| ''Don't Play Us Cheap\n| Sister Bowser\n|\n|-\n| 1973\n| Ganja & Hess\n| Queen of Myrthia\n|\n|-\n| 1976\n| The Bingo Long Traveling All-Stars & Motor Kings\n| Bertha Dewitt\n|\n|-\n| 1976–1978\n| What's Happening!!\n| Mabel \"Mama\" Thomas\n| 37 episodes\n|-\n| 1977\n| Scott Joplin\n| Madam Amy\n|\n|-\n| 1978\n| The Wiz\n| Evillene\n|Nominated—Saturn Award for Best Supporting Actress\n|-\n| 1978–1981\n| Fantasy Island\n| Various roles\n| 3 episodes\n|-\n| 1979\n| Barney Miller\n| Mother Zilla\n| Episode: \"Computer Crime\"\n|-\n| 1979\n| The Jerk\n| Mother\n|\n|-\n| 1980\n| The Gong Show Movie\n| Mabel\n|\n|-\n| 1981\n| Palmerstown, U.S.A.\n| Aunt Toog\n| Episode: \"Future City\"\n|-\n| 1981\n| Getting Over\n| Mabel Queen\n|\n|-\n| 1983\n| ABC Weekend Special\n| Mrs. Trussker\n| Episode: \"All the Money in the World\"\n|-\n| 1983\n| Lottery!\n| Mabel\n| Episode: \"Los Angeles: Bigger Volume\"\n|-\n| 1983\n| Whiz Kids\n|\n| Episode: \"Fatal Error\"\n|-\n| 1984\n| The Jerk, Too\n| Mama Johnson\n| Television movie\n|-\n| 1984\n| The Master\n| Willie\n| Episode: \"Fat Tuesday\"\n|-\n| 1984\n| The Jeffersons\n| Mother Tobin\n| Episode: \"Some Enchanted Evening\"\n|-\n| 1986\n| Amazing Stories\n| Jennifer Mowbray\n| Episode: \"The Sitter\"\n|-\n| 1986\n| The Colbys\n| Fortune Teller\n| Episode: \"The Honeymoon\"\n|-\n| 1986\n| Tales from the Darkside''\n| Ruby Cuzzins\n| Episode: \"Baker's Dozen\"\n|-\n| 1988\n| Black Vampire\n|\n|\n|-\n| 1988\n| Wiseguy\n| Mae Nina\n| Episode: \"Blood Dance\"\n|-\n| 1988\n| Scrooged\n| Gramma\n|\n|-\n| 1990\n| ''Dead Men Don't Die''\n| Chafuka\n|\n|-\n|}\nRecordings\n*\"Alabama Rock'n'Roll\" (RAMA Records, 1956)\n*\"Mabel King With The Royal Sita Chorus – Symbol Of Love / Second Hand Love\" (RAMA Records, 1956)\n*\"Go Back Home Young Fella/Lefty\" (Amy Records, 1962)\n*\"When We Get The Word / Love\" (Amy Records, 1962)\nReferences\nExternal links\n*\n*"
    }
  ]
}