{
  "content": [
    {
      "type": "text",
      "text": "# Mabel May Woodward\n\n| birth_place        = Providence, Rhode Island\n| death_date         =\n| death_place        = Providence, Rhode Island\n| resting_place      = Swan Point Cemetery\n| resting_place_coordinates =\n| nationality        = American\n| education          = Art Students League of New York,Ogunquit Art Colony\n| alma_mater         = Rhode Island School of Design\n| years_active       = 1896–1943\n| known_for          = Landscape and portrait painting\n| notable_works      =\n| style              = American Impressionism\n| movement           = Ashcan School\n| spouse             =\n| awards             =\n| website            =\n| module             =\n}}\nMabel May Woodward (September 28, 1877 – August 14, 1945) was  a prominent Rhode Island impressionist painter during the late 19th and early 20th century. She was active from 1896 until 1943, primarily in Rhode Island and in Maine.\nEarly life and education\nWoodward was born on September 28, 1877, to a stable, affluent family in Providence, Rhode Island, where she spent most of her life, except for a brief period in San Francisco and many summers in Ogunquit, Maine. Her family gave her the \"finest domestic art education then available.\"\nShe studied at the Rhode Island School of Design (RISD) in 1896, and graduated with highest honors. Later, in 1898, she attended the Art Students League of New York, studying under William Merritt Chase, Kenyon Cox and Frank Duveneck. She also studied for a time at the Ogunquit Art Colony in Maine, with Arthur Wesley Dow and Charles Woodbury.\nCareer\nShe was faculty at the Rhode Island School of Design for over twenty years. There, she originated a class known as the \"action class,\" in which students studied the human figure as a machine rather than as a stationary object. She painted during her summer vacations.\nShe was a longtime member and the first woman president of the Providence Art Club.\nWork\nShe was greatly influenced by the impressionists, particularly William Merritt Chase and Frank DuMond. Woodward preferred colorful canvases and used bold, unlabored brushstrokes heavy with impasto.\nHer earlier work includes a series of \"old-fashioned girls in gardens.\" These were portraits of women and girls, set in outdoor gardens. Woodward's emphasis was less on the psychology of the human subject and more on the effects of light and color in the scene.\nLater, she became known for her summer beach scenes along the New England shore. She painted many beach scenes and airy landscapes focusing on the play of light and shadow. These scenes often depicted families and children enjoying fine weather at the beach.\nGallery\nFile:'Young Girl with Fish Bowl' by Mabel May Woodward.jpg|Young Girl with Fish Bowl\nFile:Ogunquit Bathers by Mabel May Woodward.jpg|Ogunquit Bathers\nFile:Mabel May Woodward - New England Summer.jpg|New England Summer\nFile:Mabel May Woodward - A Quiet River on a Grey Day.jpg|A Quiet River on a Grey Day\nFile:Mabel May Woodward - Afternoon respite.jpg|Afternoon respite\nLegacy\nWoodward was one of Rhode Island's best-known artists in the 1920s and 1930s. But upon her death in 1945, she was almost totally unknown, as the art world favored French Impressionists over American Impressionists generally. By the early 1950s, interest in her work had dwindled to the point where her family sometimes gave her paintings away.\nBy the later part of the 20th century, interest in American Impressionists slowly returned.  Woodward's work began to be rediscovered, and some of her larger portraits and beach studies have sold in the six-figure range.\nHer work was included in an exhibition of \"neglected American impressionists\" in Boston in 1972, and a small retrospective exhibition at the Providence Art Club in 1992.\n}}\nExternal links\n*"
    }
  ]
}