{
  "content": [
    {
      "type": "text",
      "text": "# Mac King\n\n| birth_place = Hopkinsville, Kentucky, U.S.\n| nationality = American\n| other_names =\n| known_for   = Magic in a Minute videos, magic kits, and syndicated comic strip\n| education   =\n| employer    = Excalibur Hotel and Casino\n| occupation  = Magician, Illusionist, writer, actor\n| height      =\n| term        =\n| predecessor =\n| successor   =\n| party       =\n| boards      =\n| spouse      = Jennifer Sils\n| partner     =\n| children    =\n| parents     =\n| relatives   =\n| signature   =\n| website     = [http://www.mackingshow.com/ Mac King Show]\n| footnotes   =\n}}\nMac King (born December 2, 1959) is an American magician who has performed on television specials, often as a co-host. He has his own family-friendly show, \"The Mac King Comedy Magic Show\", at the Excalibur Hotel and Casino in the Thunderland Showroom, in Las Vegas, Nevada. King's show is currently the longest running one-man show in the history of Las Vegas.\nCareer\nAfter college graduation King began touring the comedy clubs with his one-man comedy magic act. Over the next nineteen years his career took off, to such an extent that for years he did over 200 shows a year.\nIn the nineties he began to do television specials, and to appear at Las Vegas casinos.\nIn January 2000, King became a permanent act at Harrah's, performing 10 shows a week.\nIn addition to the TV specials and Harrah's performances, King performs at more than 60 private corporate events each year. Some of his better-known effects involve goldfish, Fig Newtons, and a yellow raincoat he claims is a magic cloak of invisibility.\nIn 2021 Mac King moved to the Excalibur after 20 years at Harrah's Las Vegas.\nTelevision shows and specials\nOn the NBC ''The World's Greatest Magic'' specials, King taught the audience a minor effect before and after each commercial in segments referred to as the Mac King School of Magic. He is the only magician to be in all five of the network's specials.\n* An Evening at the Improv\n* Comic Strip Live\n* ''The World's Greatest Magic\n* The World's Greatest Magic II\n* The World's Greatest Magic III\n* The World's Greatest Magic IV\n* The World's Greatest Magic V\n* Houdini: Unlocking His Secrets\n* The World's Wildest Magic\n* Penn and Teller's Sin City Spectacular\n* Donny and Marie\n* The Other Half\n* Penn & Teller: Fool Us''\nKing's home was also featured on HGTV.\nPersonal life\nKing was born December 2, 1959, in Hopkinsville, Kentucky. He became interested in magic as a kid because both of his grandfathers (Elwood Huffman and Pax King) were keen amateur magicians. King was a graduate from the J. Graham Brown School in Louisville, Kentucky in 1977, and attended Macalester College in Saint Paul, Minnesota, on a National Merit Scholarship. He graduated in 1981 with a double major (Anthropology and Magic).\nKing performed, with fellow Kentuckian Lance Burton, over the summers he had off during college.\nThey did three shows a day, every day, at a western-themed park in Cumberland Falls, Kentucky.\nKing married Jennifer Sils in 1985, having met her when she was chosen from the audience by King to help with a trick. They have one child named Eli King who was born in Nevada.\nHe is also friends with Penn & Teller, who wrote the preface to King's book Tricks With Your Head.\nIn March 2022, King eulogized The Amazing Johnathan, who had died a couple of weeks prior.\nBooks\nKing has co-authored 3 books.\n* Tricks With Your Head, a humorously written series of tricks mostly requiring few, if any props (other than the performer's anatomy), co-authored with Mark Levy.\n* Campfire Magic subtitled \"Over 50 Amazing and Easy-to-Learn Tricks and Mind-Blowing Stunts\" co-authored with Bill King.\n* ''Great Big Ol' Book-o-Magic.''\nKing also collaborated with cartoonist Jeff Knurek to create and market the \"Magic in a Minute\" line of children's promotions, toys, magic tricks, videos, books, and events.\nReferences\nExternal links\n*[http://www.mackingshow.com/ King's official Page]\n*[http://www.lvol.com/bios/mac_king.html Las Vegas Online: Review of his show]\n*[https://web.archive.org/web/20070927224744/http://www.mackingshow.com/html/corporate/ Press Kit and Bio Information]"
    }
  ]
}