{
  "content": [
    {
      "type": "text",
      "text": "# Mackenzie River (Queensland)\n\n;\n| length             =\n| width_min          =\n| width_avg          =\n| width_max          =\n| depth_min          =\n| depth_avg          =\n| depth_max          =\n| discharge1_location=\n| discharge1_min     =\n| discharge1_avg     =\n| discharge1_max     =\n| source1            = Expedition Range\n| source1_location   =\n| source1_coordinates=\n| source1_elevation  =\n| source_confluence            = Comet River and Nogoa River\n| source_confluence_location   = north of\n| source_confluence_coordinates=\n| source_confluence_elevation  =\n| mouth              = confluence with the Dawson River to form the Fitzroy River\n| mouth_location     = east of\n| mouth_coordinates  =\n| mouth_elevation    =\n| progression        =\n| river_system       = Fitzroy River\n| basin_size         =\n| tributaries_left   = Isaac River, Connors River, Funnel Creek\n| tributaries_right  =\n| custom_label       = National park\n| custom_data        = Goodedulla National Park\n| extra              =\n}}\nThe Mackenzie River is a river in Central Queensland, Australia. The Mackenzie River is a major tributary of the Fitzroy River, part of the largest river catchment flowing to the eastern coast of Australia.\nCourse and features\nFormed by the confluence of the Comet and Nogoa rivers flowing from the Expedition Range, the river rises north of  and flows generally north by east towards the Broadsound Range. North of the settlement of , the river flows south by east and west of the Goodedulla National Park towards  and splits as an anabranch on multiple occasions. The river is joined by twenty-four tributaries including the Isaac and Connors rivers and Funnel Creek. Northeast of Duaringa, the Mackenzie is joined by the Dawson River and together they form the Fitzroy River. From source to mouth, the Mackenzie River descends  over its  course.\nThe Bingegang Weir near Middlemount contains barramundi, southern saratoga and golden perch. The Bedford Weir and Tartrus Weir are also stocked with barramundi. Bedford Weir is popular with water-skiers and camping is permitted adjacent to the reservoir.\nHistory\nYetimarala (also known as Jetimarala, Yetimaralla, and Bayali) is an Australian Aboriginal language of Central Queensland. Its traditional language region is within the local government areas of Central Highlands Region, on the Boomer Range and Broadsound Range and the Fitzroy River, Killarney Station, Mackenzie River and Isaac River. Garingbal, a language of Central Queensland was also spoken in this region, primarily around the Bowen Basin. The Garingbal language region includes the landscape within the local government boundaries of Central Highlands Regional Council.\nThe first European to discover the river was Ludwig Leichhardt in 1844; he was a German explorer who explored many parts of Queensland and the Northern Territory.\nSee also\n}}\n*\nReferences\nExternal links\n*\n*"
    }
  ]
}