{
  "content": [
    {
      "type": "text",
      "text": "# Madagascar (software)\n\n| programming language   = C, C++, Python\n| operating system       = Posix\n| genre                  = Geophysical software\n| license                = GNU General Public License\n| website                = [https://ahay.org/ ahay.org]\n| latest_preview_version = Through [https://github.com/ahay/src Github]\n}}\nMadagascar is a software package for multidimensional data analysis and reproducible computational experiments.\nTechnology developed using the Madagascar project management system is transferred in the form of recorded processing histories, which become \"computational recipes\" to be verified, exchanged, and modified by users of the system.\nFeatures\nThe Madagascar environment consists of:\n# Standalone programs for out-of-core data analysis;\n# Standalone programs for geophysical data processing and imaging;\n# A development kit for C, C++, Java, Fortran-77, Fortran-90, Python, Matlab, and Octave;\n# A framework for reproducible numerical experiments, based on SCons;\n# A framework for scientific publications, based on SCons and LaTeX;\n# A collection of reproducible scientific articles also used as usage examples and regression tests for the standalone programs;\n# A collection of datasets used as input to reproducible numerical experiments.\nExample script\nAn example  file is shown below\nfrom rsf.proj import *\nFetch(\"wz.35.H\", \"wz\")\nFlow(\"wind\", \"wz.35.H\", \"dd form=native | window n1=400 j1=2 | smooth rect1=3\")\nPlot(\"wind\", \"pow pow1=2 | grey\")\nFlow(\"mute\", \"wind\", \"mutter v0=0.31 half=n\")\nPlot(\"mute\", \"pow pow1=2 | grey\")\nResult(\"denmark\", \"wind mute\", \"SideBySideAniso\")\nEnd()\nNote that  by itself does not do any job other than setting rules for building different targets. The targets get built when one executes  on the command line. Running  produces\nbash$ scons\nscons: Reading SConscript files ...\nscons: done reading SConscript files.\nscons: Building targets ...\nretrieve([\"wz.35.H\"], [])\nwind.rsf\nwind.vpl\nmute.rsf\nmute.vpl\n/RSF/bin/vppen yscale=2 vpstyle=n gridnum=2,1 wind.vpl mute.vpl > Fig/denmark.vpl\nscons: done building targets.\nLicense\nMadagascar is free software and is licensed under the GPL.\nHistory\nMadagascar was first publicly presented at the EAGE Workshop in Vienna in June 2006. The work on the package (previously named RSF) was started by Sergey Fomel in 2003. Since then, many people have contributed to it.\nWhile being written mostly from scratch, Madagascar borrows ideas from the design of SEPlib, an open-source package maintained by Bob Clapp at the Stanford Exploration Project (SEP). Generations of SEP students and researchers contributed to SEPlib. Most important contributions came from Rob Clayton, Jon Claerbout, Dave Hale, Stew Levin, Rick Ottolini, Joe Dellinger, Steve Cole, Dave Nichols, Martin Karrenbach, Biondo Biondi, and Bob Clapp.\nMadagascar also borrows ideas from Seismic Unix (SU), a package maintained by John Stockwell at the Center for Wave Phenomenon (CWP) at the Colorado School of Mines (Stockwell, 1997; Stockwell, 1999). Main contributors to SU included Einar Kjartansson, Shuki Ronen, Jack Cohen, Chris Liner, Dave Hale, and John Stockwell. SU adopted an open-source BSD-style license starting with release 40 (April 10, 2007).\nSee also\n* Reproducibility\nReferences\nExternal links\n* [https://ahay.org/wiki/Conferences#Conference_presentations Scientific conference presentations about Madagascar]\n* [https://sourceforge.net/blog/for-reproducible-research-go-to-madagascar/ For reproducible research, go to Madagascar]\n* Sergey Fomel and Jon Claerbout, [http://csdl2.computer.org/comp/mags/cs/2009/01/mcs2009010005.pdf Guest Editors' Introduction: Reproducible Research]: Computing in Science and Engineering, vol. 11, no. 1, pp.&nbsp;5–7, Jan./Feb. 2009,\n* Sergey Fomel, Paul Sava, Ioan Vlad, Yang Liu, and Vladimir Bashkardin, 2013, [http://openresearchsoftware.metajnl.com/article/view/jors.ag/20 Madagascar: open-source software project for multidimensional data analysis and reproducible computational experiments]: Journal of Open Research Software, 1(1):e8,\n* Sergey Fomel, [https://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=6880240 Reproducible Research as a Community Effort: Lessons from the Madagascar Project]: Computing in Science and Engineering, vol. 17, no. 1, pp.&nbsp;20–26, Jan./Feb. 2015,\n* John Holden, [http://library.seg.org/doi/abs/10.1190/tle34111386.1 The genesis of Madagascar]: The Leading Edge, vol. 34, no. 11, Nov. 2015,"
    }
  ]
}