{
  "content": [
    {
      "type": "text",
      "text": "# Mafeking Mooch\n\nThe Mafeking Mooch was an affected style of walking performed by some British men during the first decade of the 20th&nbsp;century to give the impression that they had been injured during the celebrated siege and/or relief of Mafeking.\nBackground\nThe town of Mafeking was home to one of the major British garrisons besieged at the start of the Second Boer War in October 1899. The 1,200 men of the garrison withstood assault for 217 days. The siege was finally lifted on 17&nbsp;May 1900, when British forces commanded by Colonel B. T. Mahon of the army of Lord Roberts relieved the town after fighting their way in. There were immense celebrations in Britain at the news (briefly creating the verb maffick, meaning to celebrate both extravagantly and publicly). Notably, Colonel Robert Baden-Powell, who had headed the defence of the town, was treated as a hero upon his return to Britain in 1903.\nAffected disabilities\nDuring the years immediately following the end of the Second Boer War, men of all classes in Britain wanted to associate themselves with the heroism of those who had served at Mafeking. It was a common sight at the time to see men affecting minor disabilities in order to convey the impression that they had fought at Mafeking. The most popular of these simulated handicaps became known as the Mafeking Mooch, so called because the \"veteran\" performing the assumed affliction would walk with an exaggerated limp.\nPublic reaction\nThe appellation \"Mafeking Mooch\" was first coined by the journalist Arthur P. Montague in a scathing article about degeneracy and fecklessness published in the Pall Mall Gazette in June 1905. Montague documented a notable distinction between men of different classes as to how the Mafeking Mooch was performed. He noted that working-class men affected a limp with the toes of the right foot pointing inward, whereas middle and upper-class men pointed their toes outward. Montague was outraged at the notion that perfectly healthy men would have the audacity to pretend that they had served His Majesty and pretend that they had been injured to win respect, sympathy and the possible affections of a young woman. The phenomenon of the Mafeking Mooch added to the already considerable national anguish caused by the Boer War. Although Britain ultimately triumphed over the Boer republics, the country's perceived military might had been shown to be wanting in the face of the nimble and determined Boer fighters. Britain's war effort had been hampered because up to 40&nbsp;percent of British recruits were unfit for military service, suffering from medical problems such as rickets and other poverty-related illnesses.\nNotes\n;Notes\n;Bibliography\n*"
    }
  ]
}