{
  "content": [
    {
      "type": "text",
      "text": "# Magic-kyun! Renaissance\n\n| creator         = Hajime Yatate\n}}\n}}\n| network         = Tokyo MX, KBS, Sun TV, TV Aichi, AT-X, BS11\n| network_en      =\n| first           = October 2, 2016\n| last            = December 25, 2016\n| episodes        = 13\n}}\nis a Japanese media mix franchise by Sunrise, Pony Canyon, and Broccoli. A PlayStation Vita game was released on September 21, 2016, a manga series began serialization in the November 2016 issue of Sylph, which began serialization on September 22, 2016, and an anime television series produced by Sunrise began airing on October 2, 2016 and ended on December 25, 2016.\nCharacters\nMain characters\n;\n: (anime)\n:The protagonist of the series. A second year student who wanted to transfer to Hoshigei High to be like her mother, Sakura Aigasaki. She is kind, friendly, and an amateur in making ikebana flower arrangements, but is working hard.\n;\n: (child)\n:A result-oriented, stoic singer who is a second year student. He is known as the \"King\" with the top singing skills in the school. He acts cool, but underneath his façade, he carries a passionate heart. He is under pressure from his father and his two older brothers to live up to the noble Ichijoji family name. He is childhood friends with Aoi, but at Hoshigei High, they are rivals fighting for the top spot. In episode 1, he declares Kohana as his rival due to their families' history, but as the story progresses, his feelings change.\n;\n:\n:An aloof calligrapher who goes his own way. He is a second year student who slouches, rarely talks, and is a genius in his own world. He is usually indifferent towards other people and the finer details, but once he becomes interested in something, he will become completely absorbed in it. He is childhood friends with Teika, but they are rivals fighting for the top spot at school.\n;\n: (child)\n:A handsome sculptor who makes everyone around him happy. He is a third year student who is cheerful, energetic and attentive, and popular with his classmates. Despite his small size frame, he is able to make giant sculptures with a chainsaw or chisel. His hobby is cooking. He respects and looks up to his grandfather, a master sculptor. He looks after Monet, his younger cousin whom he bakes sweets for.\n;\n: (child)\n:A sexy dancer who loves to flirt. He is a third year student who is indiscriminately kind to everyone and puts those around him in a good mood. He is always making jokes, but he hides his anguished feelings. He hardly ever takes things seriously and has dancing abilities that captivate anyone that watches.\n;\n:\n:An up-and-coming painter full of wisdom. A confident and slightly cheeky first year student, he is shy and sensitive to the words of others, but once he's opened his heart to someone, he gets needy. He is known as the \"Monochrome Prince\" for his monochrome paintings. Although he is still a student, his paintings are highly regarded. He has an older twin brother who is also a painter. He is Rintaro's cousin and has a pet hedgehog named Rin.\n;\n:\n:A kind-hearted cellist who is accepting of everyone. He is friendly and can't leave those in need alone. He is a first year student, an athlete, and he loves basketball. He is the oldest among the five of his siblings. His music has a warm tone to it.\nSupporting characters\n;\n:\n:A second year student who is Kohana's roommate and friend. She is an actress and also writes plays.\n;\n:\n: A teacher at Hoshigei High. He is the teacher of Kohana, Juri, Teika, and Aoi's class. When he was a student at Hoshigei, he participated in the Art Session with Sakura Aigasaki and Masana Ichijoji.\n;\n: (game)\n: Monet's twin brother who is also a painter.\n;\n: (game)\n;\n:\n: Teika's older brother. When he was a student at Hoshigei, he participated in the Art Session with Sakura Aigasaki and Chieri Todo. He is a trustee of the school.\n;\n: (anime)\n: Teika's older brother. He is a trustee of the school.\n;\n: (anime)\n: Kohana's mother who specialized in ikebana flower arranging and died in an accident when Kohana was a child.\n;Academy Principal\n: (anime)\n: Although a name has never been given or mentioned, he is the principal of the Hoshigei Academy. He is solely responsible for picking the members of the Hoshigei Festival Committee. He also is responsible for choosing who comes into, stays, and/or leaves the Hoshigel Academy.\nMedia\nVideo game\nA Cero C PlayStation Vita game was released on September 21, 2016. The game was developed by HuneX and produced by Broccoli. In the game, the player takes the role of Kohana Aigasaki, whose name can be changed. The game features full voiced characters except for Kohana. The opening theme for the game is titled \"Magical Flower\" and is sung by Yūichirō Umehara, KENN, Yūki Ono, Wataru Hatano, Shouta Aoi, and Takuya Eguchi under the name ArtiSTARs.\nAnime\nA 13-episode anime television series produced by Sunrise began airing on October 2, 2016 on Tokyo MX, Sun TV, KBS Kyoto, TV Aichi, and BS11. The anime is directed by Mitsue Yamazaki with an original concept by Sunrise's Hajime Yatate. Kairi Yura serves as the original character design with Kumi Ishii adapting the designs for the anime. The opening theme is titled  and the ending song is titled \"Please kiss my heart\". Both songs are sung by ArtiSTARs. Crunchyroll holds the rights to stream the anime.\nEpisode list\n{|class=\"wikitable\" style=\"width:100%; margin:auto; background:#FFF;\"\n|- style=\"border-bottom: 3px solid #CCF;\"\n! style=\"width:3em;\"  | No.\n!  Official English titleOriginal Japanese title\n! Insert song(s)\n! style=\"width:12em;\" | Original air date\n|-\n)\n| Aux1            = \"Art Session!!!!!!!\" by ArtiSTARs\"Walk in the lonely night\" by Teika Ichijōji (Yūichirō Umehara)\n| OriginalAirDate =\n| ShortSummary    = Kohana Aigasaki transfers to Hoshinomori Magical Arts High School. On her first day, she walks around the school and observes different students with their specialties. She comes across Teika Ichijoji, who shows her to the dorm rooms. Kohana then meets her roommate, Juri Chikamatsu. Later, she encounters Teika again. To thank him for earlier, she gives him a small bouquet of flowers she arranged, before telling him that she has yet to make any sparkles. After giving the flowers to Teika, Kohana witnesses the production of her first sparkles. The next day in class, Kohana is placed in a committee to prepare for the Hoshinomori Summer Festival, Hoshi Fest for short. Upon learning her full name, Teika declares her to be his rival.\n}}\n)\n| Aux1            = \"My world, Your world\" by Aoi Suminomiya (KENN)\n| OriginalAirDate =\n| ShortSummary    = After class, Kohana learns from Juri that the Aigasaki and Ichijoji families are enemies. She then goes to the Hoshi Festival House to attend the Hoshi Fest Committee meeting. On the wall inside the building, Kohana sees a framed picture of her mother from when she used to be a student at the school. Entering the conference room, she finds that only she and Teika are showing while the other members are not there. Teika, losing patience, asks to choose new members, better candidates for the festival. However, Kohana suggests talking to the members and convincing them to attend. Teika agrees, on the condition that Kohana does it. He tells her to start with Aoi Suminomiya, knowing that Aoi will be uninterested. Meeting with Aoi, Kohana is greeted with a slash of paint to her face as she opens the door. Aoi tells her he is trying to write something, but he does not know what it is yet. He also reveals that his ability to see sparkles has been lost. Over the course of a few days, Kohana helps Aoi with his sparkles and tidies his workplace. She decides to make a flower arrangement to help support him. On finishing the arrangement, he is able to see the sparkles. He writes \"Bright Light\" and hangs the paper on the wall next to Kohana's flowers. Though Aoi has yet to write what he wants, he says that he is closer to finding what it is. The next day, Teika is surprised to see Aoi attending the meeting with Kohana.\n}}\n)\n| Aux1            = \"Walk in the lonely night\" by Teika Ichijoji (Yūichirō Umehara)\n| OriginalAirDate =\n| ShortSummary    = Kohana is selected to do an arrangement of her specialty to everyone. She looks for inspiration in her mother's flower arrangement album and decides to do one of her mother's arrangements. When she does her demonstration, there are no sparkles. She is given a second chance, but she feels discouraged and confused. Afterwards, Teika confronts her, saying that her arrangement was unimpressive and that her position in the Hoshi Fest Committee is in danger. Kohana refutes him and says that someone like him would not be able to understand her struggles. Todo, her teacher, gives Kohana a key to the room her mother used to do her flower arrangements. She attempts arrangements again, finding success in putting what she wants to say in her arrangement: that she is happy to be at Hoshigei, gets to see her friends' sparkles every day, and looks forward to the future. She finishes the arrangement, and it produces sparkles that turn into a huge cherry blossom tree, which shoots to the sky and makes a hole in the roof. The petals falling from the tree inspire Louis Anjo and Kanato Hibiki to join the Hoshi Fest meetings.\n}}\n)\n| Aux1            = \"Step of Happiness!\" by Louis Anjo (Wataru Hatano)\n| OriginalAirDate =\n| ShortSummary    = Kohana is at a Hoshi Fest meeting when Teika brings up a dance that is held every year after the festival. Upon learning that the committee members lead the dance, Kohana admits that she does not know how to dance. Kanato suggests that Louis teach her, as Louis is a dance major, but Louis evades the proposal. Kohana gets a book from the library about dancing and goes out into the courtyard to practice. Louis notices her and helps her practice, and she assumes that he loves dancing. Teika appears and explains that Louis no longer dances anymore and he failed to graduate the year before. After that, Louis coolly walks away. He gets a nightmare about his past, haunting him about his complicated relationship with dancing. Later, Louis sees Kohana dancing again and he gracefully teaches another lesson. Kohana tells Louis that she will enjoy dancing and that he always looks like he is dancing no matter what he is doing, from playing basketball to walking. Her simile and excitement reminds Louis of his own excitement he felt when he began dancing, and he reaffirms his love for dancing.\n}}\n)\n| Aux1            = \"Rainbow Star\" by Kanato Hibiki (Takuya Eguchi)\n| OriginalAirDate =\n| ShortSummary    = Kohana is made responsible for responding to the concerns and complaints in the opinion box set up at school. Though the surprising number of opinions initially makes her uneasy, Kanato agrees to help her sort through them. Kohana learns that Kanato has a cello recital approaching and offers to let him practice, but Kanato assures her that he will be fine. They address the various concerns one after another with vitality and success. Later, Kohana spots Kanato staying up late to practice the cello. Trying to be considerate of his upcoming recital, Kohana offers to handle the rest of concerns alone, but Kanato says he will accompany her on the last issue: investigating a mysterious ghost reported to be seen throughout one of the school buildings. The investigation is a success, and the committee gains a good reputation from Kohana and Kanato's work. To thank Kanato, Kohana listens to him play his cello.\n}}\n)\n| Aux1            = \"Shiny Color\" by Monet Tsukushi (Shouta Aoi)\n| OriginalAirDate =\n| ShortSummary    = Kohana and the rest of the committee begin practicing for the collaborative Art Session. Todo instructs them on the secret of the Art Session: to make their hearts one. With no clear understanding of what they are meant to do, they search for a solution using a variety of methods. Monet Tsukushi studies them with confusion and curiosity from afar. With persuasion, he agrees to draw the Hoshi Fest pamphlet cover art, as none of the members can draw well. In Monet's art studio, Rintaro Tatewaki asks Monet if he actually wants to draw with color and not only monochrome drawings. Monet brushes Rintaro off and confirms that he wants to continue painting monochromatic paintings and study abroad. He meets Kohana in a garden, when she reveals that she kept one of his colorful drawings he lost. Kohana tells Monet that she likes the drawing and can sense how happy he was when he drew it. The next day, the Hoshi Fest is playing volleyball and Monet joins them to keep their streak going. Monet realizes that he truly wants to use colors and express himself. He thanks Kohana for her support. At the next meeting, Monet attends and brings Rintaro with him.\n}}\n)\n| Aux1            = \"Sweets à la mode\" by Rintarō Tatewaki (Yūki Ono)\n| OriginalAirDate =\n| ShortSummary    = The Hoshi Fest Committee has finally gathered all of its members and is making steady progress. Rintaro must take an exam for third year students that will determine his future at the school and as an artist. While the other members continue to work, Rintaro learns that he failed the exam and must take a retest. At the next meeting, Rintaro informs the members that he failed the exam and has to take it again. If he fails the exam again, he may drop out from the school. He then requests that he wishes to focus on sculpting and asks to take time off from the committee. Kohana visits Rintaro while he works on a new sculpture assignment in studio and Rintaro tells her about his grandfather, a master sculptor and that his reason for sculpting is to make people smile. A few days later, Rintaro is still working on his assignment which is an owl sculpture based on the owl sculpture at the school his grandfather made. He goes to the owl to take a break from his work. Kohana finds Rintaro looking at the owl and they talk about Rintaro's gratefulness to being accepted by the committee. To thank Kohana for visiting him and bringing him food, Rintaro carves her a small owl out of wood. Kohana's smile reminds Rintaro of his reasons for sculpting, and his motivation leads him to finish his sculpture. However, Rintaro fails the makeup exam. He goes to the committee to both apologize and thank them for their support before he drops out by making macaroons. The members, feeling sad, are reluctant to eat the macaroons, but Louis encourages everyone to eat. When they eat the macaroons, sparkles appear. Realizing that Rintaro's magical art is baking, Rintaro and the members present macaroons to the principal. The principal declares that Rintaro has passed the exam and thus does not need to drop out. The committee celebrates Rintaro's return with a party and look forward with enthusiasm to the future together.\n}}\n)\n| Aux1            =  by Teika Ichijōji (Yūichirō Umehara)\n| OriginalAirDate =\n| ShortSummary    = Summer has arrived. The Art Session has changed due to Rintaro's switch in majors from sculpting to baking, so the committee goes to the venue to practice. Back at the Hoshi Fest house, Kohana has one last lesson in dancing from Louis. After the lesson, Louis asks Kohana to be his partner for the last dance. Rintaro appears and requests Kohana to be his partner for the last dance. Following Rintaro, Kanato enters the room and approaches Kohana, also asking to be her partner. Monet then makes his request too. Louis, Rintaro, Kanato, and Monet argue about the last dance. Aoi overhears the argument and asks what is going on. Kohana says that they are discussing the last dance, and Aoi asks Kohana if she would like to be his partner. The boys, unsure on how the settle the matter, agree to put the discussion on hold to lessen the burden for an even more confused and overwhelmed Kohana. While walking with Juri, Kohana and Juri notice Teika running and how he looks more exhausted than usual. The next day is the day before the Hoshi Festival. Masana Ichijoji and Shinra Ichijoji visit the school. They meet with Teika and question him about the Art Session and Kohana. After the meeting, Teika and Aoi meet and Aoi expresses his concerns for Teika's well-being. Teika dismisses Aoi's concerns, saying that he is neither in pain nor that he finds the pressure of the Ichijoji name overwhelming. Continuing to walk, Teika notices Kohana in a building practicing her flower arrangements. He comments that her light is bright and clear and that he could never be able to make light like hers. To celebrate the finishing of the preparations, the committee members have a party. Kohana shares her excitement for the Art Session and the others comment on her sensitivity to their Light of Arte. They also recognize Teika and Kohana's leadership. Teika is taken aback at their praise and reminds everyone to be prepared for the Art Session. Teika leaves, but Kohana follows him after noticing his pained expression. Kohana finds Teika singing in the courtyard and calls out to him. They talk, and Teika shares that he is expected to be a prodigy, so he does not let people see him practice. He affirms that he is fine, but Kohana is skeptical. As Teika walks away, Kohana calls out to him again, this time telling him that she loves his singing.\n}}\n)\n| Aux1            = \"Art Session!!!!!!!\" by ArtiSTARs\n| OriginalAirDate =\n| ShortSummary    = It is finally the day of the Hoshi Festival. Kohana and the committee do final checks on the festival locations and make any last-minute arrangements. Kohana and Aoi talk about Teika and Aoi assures her that Teika has changed a bit thanks to meeting her. Kohana visits the theater cafe Juri is working at and then has to help a lost child. At the Hoshi Fest house, the members are getting ready to go to the venue and notice that Kohana is late. En route to the venue, Kohana meets Masana and Shinra. Masana and Shinra confront Kohana about the feud between the Aigasaki and Ichijoji families, but Teika steps in before they can talk further. Teika ends the discussion by telling his brothers that the families' feud does not involve Kohana and that the Art Session is not his alone. Kohana and Teika arrive in time, and the Art Session is a success. After the session, Masana and Shinra talk to Teika and acknowledge his work and encourage him to follow his own path. Kohana dances with each of the members at the dance party. When it comes to decide whom to dance with for the last dance, Kohana is still undecided. Before she can choose, Teika takes her hand and leads her to dance. The others, while disappointed, let Teika dance with Kohana. Meanwhile, the principal is admiring the statuary created at the Art Session, but notices that it slightly breaks. The night ends with the Hoshi Fest Committee taking a group photo together.\n}}\n)\n| Aux1            =   by ArtiSTARs\n| OriginalAirDate =\n| ShortSummary    = Kohana and the rest of the committee arrive at a villa on the beach to celebrate the end of the Hoshi Festival. With sidelong glances, their languid advisor Todo watches them excitedly frolic about as they spend the day playing and eating on the beach. After getting ready to view fireworks, Kohana finds a greenhouse, the place where memorial trees are planted after each Hoshi Festival by the committee members. She finds Todo in the greenhouse and he tells her stories of her mother Sakura from when they were students. He tells her that Sakura helped their committee keep going with her attitude and belief, how he met Sakura, and how she helped him find inspiration for his pottery. Kohana and Todo exit the greenhouse and find the committee waiting for them. On the beach, the committee views and creates their own fireworks. When the fireworks end, they reflect on their time together. With the Hoshi Festival over, the committee is to disband, but they admit that they would like to remain together. The next day, the committee plants their memorial tree. They then propose that they would like to create a Hoshigei event committee with them as the members and Todo as the advisor. Their proposal is accepted for consideration.\n}}\n)\n| Aux1            = -\n| OriginalAirDate =\n| ShortSummary    = The Hoshigei event committee proposal has been accepted, and the members' first assignment is a Halloween party. The committee must put on a play for the Halloween event, so Juri, whose major is acting, is called in to assist. Juri presents an original play written by her based on the Sleeping Beauty tale. Juri casts Kohana as the princess and the boys as princes, but still needs to decide on the prince of destiny, the prince who breaks the princess's curse by kissing her. To choose the right person, Juri holds auditions based on competitions and earning points. Teika, Aoi, Louis, Kanato, Monet, and Rintaro all want the role of the prince of destiny. The audition consists of a running race, a penalty shoot-out, an archery contest, a table tennis match, an intelligence quiz, balancing, rock climbing, horseback riding, chopping wood, sewing, caring for animals, and improvising the kissing scene with stuffed animals as the princess. Finally, Juri declares that any one of them would be a good  fit for the role and lets a game of Old Maid decide the actor. Teika wins the game, thus getting the role. The next day while practicing, Kohana feels faint. When she creates a flower arrangement, her sparkles freeze and she faints. She awakes immediately, but the principal and Todo arrive. The principal informs Kohana that she has to leave Hoshigei.\n}}\n)\n| Aux1            = -\n| OriginalAirDate =\n| ShortSummary    = The principal explains his reasoning for asking Kohana to voluntarily leave Hoshigei: Kohana's sparkles have become snowflakes, and students with snowflake shaped sparkles have extraordinary talent and sensitivity to the Light of Arte. With these qualities, these types of students are more likely to intensively devote themselves to their art, putting themselves at risk in the process. The principal instructs Kohana to avoid using her magic for her safety. Kohana disbelieves the claims, saying that she is not special, has no talent, and would not destroy herself. Kohana heads back to the dormitory by herself to rest and her friends agree to do what they can to restore her Light of Arte. They research using numerous sources to find information. Alone, Kohana's fears of not being good enough claw at her mind. She goes to the tower and attempts to create a flower arrangement to get her sparkles back so she can stay. However, her efforts are in vain. Her irregular magic causes large, thorny vines to cause the stairs in the tower to break and collapse. Kohana's friends notice that she is missing and search around the school to find her. The collapse of the stairs in the tower cause Juri and Teika to go there. They find Kohana lying unconscious under vines. Kohana is taken to the nurse's office. She has no injuries, but she will not wake up. In her mind, her doubts and suspicions continue to convince her that she is not valid by her mother or friends without magical arts and that she is replaceable and not needed. Her friends wait by her side and declare that they will not give up on her.\n}}\n)\n| Aux1            = \"Walk in the lonely night\" by Teika Ichijōji (Yūichirō Umehara)  \"Dear my special\" by ArtiSTARs\n| OriginalAirDate =\n| ShortSummary    = Not wanting to leave Kohana alone, Kohana's friends agree to take turns watching over her for the night. While they watch for her, they each share their private feelings for her: Rintaro confesses that he learned that there is more than one way from her and he wants her to smile for herself. Kanato confides that he was always expected to look after others and his younger siblings and it made him happy to be the one taken care of. Louis concedes that he loves dancing thanks to her and that she is irreplaceable. Monet admits that he became more open to people because of her. Aoi reveals that he had been lonely since parting with Teika as a child, but now he is no longer alone and neither is she. Teika accepts that he has changed and she gave him recognition. After confessing his feelings Teika sings to her and notices her reacting to his light of arte. He tells the others what happened and they put on another art session, she awakens and her powers return to normal. The group enjoys the halloween party and performs their play successfully. It ends with everyone realizing the present time they spend together is precious and they promise to stay together forever.\n}}\n|}\nManga\nA manga written by Hajime Yatate and drawn by Junta Mio began serialization in the November 2016 issue of Sylph. A gag, 4-koma manga version of series, titled  is serialized online for free at Ponimaga official website and is drawn by ImoUto.\nNotes\nReferences\nExternal links\n*\n*[http://www.magic-kyun-game.jp/ Official game website]\n*\n*"
    }
  ]
}