{
  "content": [
    {
      "type": "text",
      "text": "# Magical Thinking (American Horror Story)\n\n| production = 4ATS11\n| guests =\n*Neil Patrick Harris as Chester Creb\n*Angela Sarafyan as Alice\n*Jamie Brewer as Marjorie\n*Chrissy Metz as Barbara\n| writer = Jennifer Salt\n| director = Michael Goi\n| music =\n| runtime = 46 minutes\n| season_article = American Horror Story: Freak Show\n| episode_list = List of American Horror Story episodes\n| prev = Orphans\n| next = Show Stoppers\n}}\n\"Magical Thinking\" is the eleventh episode of the fourth season of the anthology television series American Horror Story, which premiered on January 7, 2015, on the cable network FX. It was written by Jennifer Salt and directed by Michael Goi.\nPlot\nStanley convinces an imprisoned Jimmy that the only way to pay for a lawyer is to sever one of his hands and sell it. He concocts a plan to smuggle Jimmy out of the prison using his Viking prostitute, who poses as an EMT. After Stanley puts him under, Jimmy awakens to find that both of his hands have been removed.\nDell visits him at the hospital and realizes Stanley double crossed Jimmy. The two make plans to buy the Freak Show from Elsa once she leaves for Hollywood. Bette and Dot set out to find someone to deflower them, when they come across traveling Salesman, Chester.\nChester dreams of performing his magic act in front of an audience, along with his Dummy named Marjorie. Chester also reveals that after fighting in Normandy, he had a metal plate implanted in his skull; which causes him to hallucinate that Marjorie is alive. Elsa agrees to let him perform, but only if he balances the books in return. After Chester asks for them to assist him in his magic act, Bette and Dot seduce Chester and sleep with him.\nDell reveals to Elsa what happened to Jimmy and Elsa pleads with him to get Jimmy out. Eve suggests teaming up to save Jimmy. As the cops are transporting Jimmy back to prison, Eve throws a brick through the windshield and she and Dell kill both officers, rescuing Jimmy in the process.\nDandy hires a private investigator to follow the Twins and soon learns of their transgression with Chester. He confronts Chester after Marjorie goes missing, revealing that he knows about Chester's past. A flashback reveals that Chester's wife, Lucy, had an affair with a woman named Alice, and he murdered them both in a jealous rage, but he believes that Marjorie committed the murders. Dandy tells Chester where Marjorie is, and once he finds her, she tells Chester that he needs to kill the Twins.\nMaggie tells Elsa she needs to show her something, revealing Ma Petite's true fate. Desiree pulls a gun on Dell in his caravan, demanding to know who he has killed. Once Dell confesses his crime of killing Ma Petite, Elsa shoots him in the head from behind.\nReception\nOn review aggregator website Rotten Tomatoes, the episode has an approval rating of 85% based on 13 reviews. The critical consensus reads: \"Neil Patrick Harris is a great guest star, but his turn in 'Magical Thinking' adds too hefty a storyline this late in the game.\"\nReferences\nExternal links\n*"
    }
  ]
}