{
  "content": [
    {
      "type": "text",
      "text": "# Mahalwari\n\nThe Mahalwari system was used in India to protect village-level-autonomy. It was introduced by Holt Mackenzie  in 1822. The word \"Mahalwari\" is derived from the Hindi word Mahal, which means a community made from one or more villages.. Mahalwari consisted of landlords or Lambardars (also called as Nambardars) assigned to represent villages or groups of villages. Along with the village communities, the landlords were jointly responsible for the payment of revenue . Revenue was determined on basis of the produce of Mahal. Individual responsibility was not assigned. The land included under this system consisted of all land in the villages, including forestland, pastures etc. This system was prevalent in parts of the Gangetic Valley, Uttar Pradesh, the North Western province, parts of Central India and Punjab.\nThe other two systems were the Permanent Settlement in Bengal in 1793 and the Ryotwari system in 1820. It covered the states of Punjab, Awadh and Agra, parts of Orissa, and Madhya Pradesh.\nHistory\nDuring the 1800s, the British established control over the administrative machinery of India. The System of Land Revenue acted as a chief source of income for the British. Thus, they used land to control the entire Revenue system, strengthening their economic condition in India.\nThe North-Western Provinces and Oudh (Awadh) were two important territories acquired by the East India Company in modern Uttar Pradesh. In 1801, the Nawab of Awadh surrendered the districts of Allahabad to the Company. The [Jamuna] and the Ganges valleys were acquired by the British after the Second Anglo-Maratha War. Governor-General of Bengal, Francis Rawdon-Hastings, 1st Marquess of Hastings conquered more territories of North India after the Third Anglo-Maratha War in 1820.\nThe village headman or lambardar was responsible for all recommendations, land survey, maintaining records of land rights, settlement of the land revenues, demand in the Mahals, and collection of land revenue. Regulation VII of 1822 accredited the legal sanction to these recommendations. In cases where estates were not held by landlords, but by the cultivators in common tenancy, the state demand was fixed at 95% of the rental. However, this system broke down as the state demand was large and rigid. The amount payable by the cultivators was more than what they could afford.\nBentinck, Bird, Thompson, and Broun-Ramsay\nWilliam Bentinck, the Governor-General of Bengal and afterwards Governor-General of India (1828-1835), revised the Regulation of 1822, introducing the Mahalwari System. They realized that the result of the Regulation of 1822 was widespread misery.\nAfter a prolonged consultation, Bentick's Government passed a new regulation in 1833. The mahalwari system of land revenue was introduced by Holt Mackenzie and Robert Merttins Bird, which made the system more flexible. The process of preparing estimates of produce and rents was simplified. It introduced the fixation of the average rents for different classes of soil. This scheme functioned under Mettins Bird. The processes of measuring land, examining soil quality was improved further. The State demand was fixed at 66% of the rental value and the Settlement was made for 30 years.\nThe Mahalwari system of land revenue under the scheme of 1833 was completed under the administration of James Thompson. The 66% rental demanded proved onerous. In the Saharanpur Rules of 1855, it was revised to 50% by Governor-General James Broun-Ramsay, 1st Marquess of Dalhousie. However, British officers paid little attention to these rules. This created widespread discontent among the Indians.\nSee also\n* Ryotwari\n* Permanent Settlement\nReferences\nFurther reading\n* The History of India, vol.2, T.G.Percival Spear, Penguin (1990)\n* India: A History, John Keay, Grove/Atlantic (2001)\n* A rule of property for Bengal: an essay on the idea of permanent settlement, Ranajit Guha, Durham, Duke U Press (1996)"
    }
  ]
}