{
  "content": [
    {
      "type": "text",
      "text": "# Mahakali treaty\n\nMahakali Treaty or महाकाली सन्धि (Mahakali Sandhi) is an agreement between the Government of Nepal (former ''His    Majesty's Government of Nepal'') and the Government of India regarding the development of watershed of Mahakali River. The treaty was signed in 1996. The treaty has 12 articles agreements for an integrated development of barrage, dams and hydropower for mutual cooperation of the two countries by managing the water resources. The treaty recognizes the Mahakali River as a boundary river between the two countries.\nHistoric development\nIn 1920, the Indo Nepal water treaty was signed by the British Raj to build the Sarda barrage to irrigate the United Province. This treaty is referred to as the Sarada Treaty. In the treaty, Nepal government agreed to give 4093.88 acres of land on the eastern banks of Mahakali river for the construction. In exchange, Nepal received an equal are of forest land from the British Indian government. In addition, the British Indian government also agreed to give NPR 50,000, a supply of 4.25&nbsp;m/s out of annual flow of 650 m3/s during the dry season and 13&nbsp;m/s of water in the wet season which could be further increased to 28.34&nbsp;m/s if water was available.\nIn 1971, Nepal started Mahakali Irrigation Project based on the 1920s Sarada agreement with the help from the World Bank in the Panchayat period. In 1977, India and Nepal jointly agreed to investigate the Mahakali river resource.\nIn 1981, India started to construct Tanakpur barrage unilaterally on the land which was transferred to British India under the Sarda agreement. Due to technical glitches, the afflux in the eastern side of the Mahakali river in Nepal was not contained thus requiring a bund on the left bank in Nepal. An agreement was reached to provide India with the needed land, about 2.9 hectares, in the Nepal side. Indian agreed to provide 25,000 cusecs of water as well as supply 25 MW of electricity. Nepal, however, demanded 50 and 59 percent share in water and electricity respectively, but not agreed upon.\nIn 1991, during the visit of Nepalese Prime Minister to India, Nepal government agreed to allow construction of the 577 meters long bund. In return, India agreed to provide  28.34&nbsp;m/s cusecs of water annually with 10 million units of electricity. However, the issue led to political turmoil in Nepal. Due to political turmoil, in October 1992, a new Memorandum of Understanding (MoU) was signed in which India agreed to provide 20 million units of electricity in exchange for the 2.9 ha land India was getting.\nAs required by Article 126 of the Constitution of Nepal, the Mahakali treaty was approved by a two-third majority of the joint upper and lower houses of Parliament.\nOn 12 February 1996, the Mahakali treaty was signed by the Nepalese Prime Minister Sher Bahadur Deuba and the Indian Prime Minister P. V. Narasimha Rao in Delhi and ratified by the parliament with 2/3rd majority on 20 September 1996 in Nepal. The  Treaty  was  concluded  in four  months  of  official  negotiations.\nThe Mahakali treaty replaced the previous agreement regarding the  Mahakali  River from the  Sarada  Barrage and the Tanakpur Barrage.\nAgreements\nFollowing are the summary of the agreement:\nAgreement for Sarada Barrage\n* Nepal shall receive 28.35  m3/s  (1000  cusecs)  of water from the  Sarada Barrage in the wet season (i.e. from 15 May to 15 October) and 4.25 m3/s (150 cusecs) in the dry season (i.e. from 16 October to 14 May).\n* Environmental flow shall be maintained at 10  m3/s  (350  cusecs) or higher.\n*In case the barrage becomes non-functional Nepal shall have the right to a supply of water in addition from the Tanakpur Barrage.\nAgreement for Tanakpur Barrage\n* Nepal should give land (about  2.9  hectares) at the  Jimuwa  Village in  Mahendranagar  Municipal area and a  portion of the  No-Man's  Land on either side of the border for the construction of   Tanakpur  Barrage. This land will remain under the continued sovereignty and control of  Nepal and  Nepal is free to exercise all attendant rights thereto.\n* Nepal shall have the right to a supply of 28.35 m3/s (1000 cusecs) of water in the wet season (i.e. from 15 May to 15 October) and 8.50.m3/s (300 cusecs) in the dry seasons (i.e. from  16 October to 14 May)\n* India shall construct the head regulator at the left bank of Tanakpur  Barrage and the waterways up to the Nepal-India border. The head regulator shall be operated jointly.\n* India shall construct a power station  (120,000 KW) and supply Nepal  70 million kilowatt-hours (unit)  of energy on a  continuous basis annually,  free of cost.\n* India shall  construct a 132kV transmission  line  up to  the  Nepal-India  border  from  the Tanakpur Power Station\n* If any storage project is developed in Tanakpur, India shall construct the additional regulator and waterways to meet the flow.\n*Any additional energy generated shall be shared half. However, the cost of generation of extra energy shall be shared half by Nepal and India.\nAgreement for Pancheshowr  Multipurpose  Project\n* Pancheshwar  Multipurpose  Project  shall be constructed in the Mahakali  River  based on the joint  Detailed  Project  Report\n* The Project shall serve for power generation, irrigation, flood control etc., shall be assessed.\n* The total energy generated shall be shared equally\n* The cost of the project shall be borne by the  Parties in proportion to the benefits accruing to them.  Both the  Parties shall jointly endeavour to mobilize the finance required for the implementation of the Project.\n* A portion of Nepal's share of energy shall be sold to India based on mutually agreed rate.\n* India shall supply 10m3/s (350 cusecs) of water for the irrigation of Dodhara –Chandani area of Nepalese Territory.\n* For local communities 5% of the average Annual flow will be maintained at Pancheshwar.\nOthers\n* A   Mahakali   River   Commission composed of an equal number of representatives from both countries will work to implement the provisions of the treaty and to coordinate and monitor plans and settle any conflict that arises.\nSee also\n*Mahakali River also known as Sarada River\n*Pancheshwar\n*Tanakpur\nExternal links\n*[http://jalshakti-dowr.gov.in/sites/default/files/MAHAKALI_TREATY_19961.pdf English version of the treaty] [https://web.archive.org/web/20220819114816/https://www.jalshakti-dowr.gov.in/sites/default/files/MAHAKALI_TREATY_19961.pdf Web archive]\n*[http://www.pmp.gov.np/ Official website of Pancheshwar  Multipurpose  Project]\nReferences"
    }
  ]
}