{
  "content": [
    {
      "type": "text",
      "text": "# Mai Bakhtawar\n\n| birth_date  = 1880\n| birth_place = Tando Bago, Badin District, Sindh, British India (now Pakistan)\n| death_date  =\n| death_place = Dodo Khan Sargani, British India (now Pakistan)\n| movement    = Hari Movement\n| organization=\n| other_names =\n| known_for   = Courage against injustice\n| spouse       = Wali Mohammad Lashari\n| partner      =\n| children     = 4\n| occupation  = Peasant\n}}\nMai Bakhtawar Lashari Baloch, }}}} (1880 - 22 June 1947) was a peasant from the village Dodo Khan Sargani, near Roshanabad in Umerkot, Tando Bago Tehsil, Badin District in Sindh.}} Growing up in rural Sindh under British rule, she faced the challenges of poverty in a deeply patriarchal society. Despite these obstacles, she courageously stood up against the injustices inflicted by local landlords. Her resistance ultimately led to her murder at the hands of a landlord and his men, marking her as a symbol of defiance against oppression.\nLife\nShe was the only child of Murad Khan Lashari, who named her Mai Bakhtawar, meaning 'fortunate woman' or 'lucky woman'. In 1898, Mai Bakhtawar married Wali Mohammad Lashari, who worked as a peasant in the lands of a landed aristocrat. The couple had four children: Dost Mohammad Khan, Lal Bakhsh, Mohammad Siddique and daughter Rasti. She is remembered as a courageous woman who consistently stood up against injustice throughout her life. Some political agitators have posthumously invoked her legacy, portraying her as a \"daughter of the soil\" and a heroic figure for the Sindhi cause, using her story to further their own agendas. near Islamkot]]\nSindh Hari Committee\nThe Sindh Hari Committee, founded in 1930, became one of the leading organisations for peasant rights in Sindh. Its main aim was to challenge the power of large landlords and secure fair land rights for haris (tenant farmers). After World War II, when rural poverty in Sindh deepened, Hyder Bux Jatoi resigned from the Indian Civil Service and devoted himself fully to the movement. Known as Baba-e-Sindh (Father of Sindh), he transformed the Hari Committee from a small group into a mass platform, giving thousands of peasants a political voice.\nIn the 1940s, over 80% of cultivated land in Sindh was controlled by powerful Zamindars, while haris survived on unequal sharecropping arrangements. Landlords often seized most of the harvest, leaving peasants with barely enough to survive. To fight this injustice, Jatoi revived the Adh batayi Movement in 1946, demanding that peasants receive half of the crop they cultivated. On 20–22 June 1947, the Hari Committee held a major gathering in Judho, close to the village of Mai Bakhtawar. During this period, Bakhtawar was murdered while resisting a landlord’s men who tried to take away the crop, and her death became a rallying cry for peasants across Sindh.\nJatoi responded by visiting her village, standing with her family, and using her sacrifice to highlight the everyday violence peasants faced. He organised rallies and protests in her name, turning her story into a symbol of resistance. This wave of activism helped build momentum for tenancy reforms, and after years of mobilisation, the Sindh Government passed the Sindh Tenancy Act, 1950, which for the first time legally recognised peasants’ rights in their crops and provided some security of tenure.\nMurder\nThe movement gained momentum, leading to regular clashes between peasants and landlords in Sindh. On 22 June 1949, while most of Mai Bakhtawar's village men and many women attended a nearby Hari conference in Jhudo, the landlord, Choudhry Saeedullah, attempted to exploit their absence. Accompanied by armed men, he entered the village to seize the entire crop yield. It was then that Mai Bakhtawar courageously confronted them, refusing to allow their theft. Defying the landlord and his men, she physically stood her ground, a bold act in an era and region where even men were often too fearful to challenge the landlords for their rights.\nFollowing Mai Bakhtawar’s murder on 22 June 1947, Hyder Bux Jatoi and the Sindh Hari Committee mobilised peasants and organised protests to ensure the case was not silenced. Jatoi’s campaign pressured the authorities to prosecute the landlord responsible, leading to the conviction and imprisonment of several men. This rare act of accountability against zamindars became a symbol of justice for peasants and strengthened the demand for tenancy reform. leading to regular clashes between peasants and landlords in Sindh. On 22 June 1949, while most of Mai Bakhtawar's village men and many women attended a nearby Hari conference in Jhudo, the landlord, Choudhry Saeedullah, attempted to exploit their absence.\nIt is unclear whether Mai Bakhtawar used the famous Sindhi slogan of Sufi Shah Inayat, 'Jeko Khede So Khaey' (He who tills has the right to eat), or something else. What is clear, however, is that her bold resistance deeply angered the armed men accompanying the landlord. In a tragic turn, their fury culminated in them fatally shooting her.\nHer body was taken to Samaro for postmortem rites and was buried there.\nImpact\nThe struggle of the Hari movement captured the public's imagination, particularly after the death of Mai Bakhtawar, who bravely fought against the powerful landed elite for her rights as a sharecropper. Her killers, Saeedullah  and his men, were sentenced to 20 years in prison for her murder. Mai Bakhtawar became the first woman to die in the history of peasant uprisings in Sindh. Her death had a profound impact, inspiring the eventual passage of the Sind Tenancy Act.\nThe murder, occurring amidst the broader movement, drew significant attention to the plight of Sindh's peasants, particularly from urban areas like Karachi, raising awareness of the injustices faced by rural communities.\nPlaces named in honour of Mai Bakhtawar\n*Mai Bakhtawar International Airport in Islamkot was named after Mai Bakhtawar\n*First cadet college for girls in Shaheed Benazirabad was also named after Mai Bakhtawar.\n*Government of Sindh has named Bakhtawar on concerned Union Council of Kunri Taluka\n*Two schools are also named after her.\n*Government and non government organizations are awarding their best performance awards on the name of Mai Bakhatawar Lashari Shaheed''.\nReferences and notes\nExplanatory notes\nReferences\n}}"
    }
  ]
}