{
  "content": [
    {
      "type": "text",
      "text": "# Maisie Ward\n\n| birth_place      = Shanklin, Isle of Wight, England\n| death_date       =\n| death_place      = Jersey City, NJ\n| resting_place    =\n| occupation       = Publisher\n| language         = English\n| nationality      =\n| ethnicity        =\n| citizenship      =\n| education        =\n| alma_mater       =\n| period           =\n| genre            = Biography, Apologetics\n| subject          =\n| movement         =\n| notableworks     = Gilbert Keith Chesterton\n| spouse           = Frank Sheed\n| partner          =\n| children         = Rosemary Sheed, Wilfrid Sheed\n| relatives        =\n| influences       =\n| influenced       =\n| awards           =\n| signature        =\n| signature_alt    =\n| website          =\n| portaldisp       =\n}}\nMary Josephine \"Maisie\" Ward Sheed (4 January 1889 – 28 January 1975), was a British writer, speaker, and publisher. In 1926 Maisie's brother Leo Ward was invited to be co-founder of the publishing house Sheed and Ward, but he proved ill-suited to the work. Maisie took his place when Leo left to become a priest.\nEarly life\nShe was born in Shanklin on the Isle of Wight on 4 January 1889, the eldest of the five children of Wilfrid Philip Ward and the novelist Josephine Mary Hope-Scott Ward. On her mother's side she was descended from Henry Fitzalan-Howard, 14th Duke of Norfolk and on her father's side from William George Ward, a prominent member of the Oxford Movement. All four of her grandparents were converts to Roman Catholicism.\nShe spent her childhood at first on the Isle of Wight, then Eastbourne, and finally in Dorking, before being sent off to board at St Mary's School, Cambridge. Here she was influenced by the preaching of Robert Hugh Benson and inspired by Mary Ward who had founded the order of nuns who ran the school. She remembered preparing for confirmation in 1905, when she was 16, with Mother Mary Loyola's book The Soldier of Christ, or, Talks Before Confirmation (1900), and she then boarded for a time at the Bar Convent to study with her personally.\nCareer\nOn leaving school, Maisie returned home to work for her father when he served as editor of the Dublin Review. She worked for the Red Cross as a nursing aide during the First World War, alongside the Daughters of Charity and Sisters of Charity nurses. After her father's death in 1916 she co-edited with her mother a posthumous collection of his last lectures.\nIn 1919, Ward became a charter member of the Catholic Evidence Guild. Ward was a forceful public lecturer. It was through the Guild that she met Frank Sheed. The couple have sometimes been cited as a modern Catholic example of street preaching. They were married in 1926; that same year, they moved to London and founded Sheed and Ward publishing.\nWard gained fame for her authorized biography of friend G. K. Chesterton, written at the request of Chesterton's widow. Ward also wrote biographies of John Henry Newman, her own father, and Robert Browning; and on other areas, including New Testament scholarship, spirituality, and stories of saints and lesser notables, among them her good friend, the writer and mystic Caryll Houselander.\nMaisie Ward died 28 January 1975 in Jersey City, New Jersey. Sheed wrote a posthumous tribute to his wife under the title The Instructed Heart.\nFamily\nWard was the great-great-grandniece of Robert Plumer Ward, father of Sir Henry George Ward and grandfather of Dudley Ward; the great-granddaughter of William Ward, and of Henry Fitzalan-Howard, 14th Duke of Norfolk and Augusta Mary Minna Catherine Lyons; the granddaughter of William George Ward, and of James Hope-Scott and Lady Victoria Alexandrina Fitzalan-Howard; the niece of James Hope, 1st Baron Rankeillour; and the daughter of Wilfrid Philip Ward and the novelist Josephine Mary Hope-Scott Ward.\nMaisie and Frank's son, Wilfrid Sheed was also a writer.\nWorks\n*Catholic Evidence Training Outlines, ed., Benziger Bros., 1925.\n*The Wilfrid Wards and the Transition, Sheed & Ward, 1934.\n*Insurrection vs. Resurrection, Sheed & Ward, 1937.\n*The Oxford Group, Sheed & Ward, 1937.\n*Gilbert Keith Chesterton, Sheed & Ward, 1943.\n*The Splendor of the Rosary, Sheed & Ward, 1945.\n*Young Mr. Newman, Sheed & Ward, 1948.\n*Return to Chesterton, Sheed & Ward, 1952.\n*They Saw His Glory, Sheed & Ward, 1956.\n*Early Church Portrait Gallery, Sheed & Ward, 1959.\n*Saints Who Made History: The First Five Centuries, Sheed & Ward, 1960.\n*Carryll Houselander: That Divine Eccentric, Sheed & Ward, 1962.\n*Unfinished Business [autobiography], Sheed & Ward, 1963.\n*The Letters Of Caryll Houselander: Her Spiritual Legacy, ed., Sheed & Ward, 1965.\n*Robert Browning and His World: His Private Face, Holt, 1967.\n*The Tragi-Comedy of Pen Browning, Sheed & Ward, 1972.\n*To and Fro on the Earth: A Sequel to an Autobiography, Sheed & Ward, 1973.\nSee also\n* Catholic Evidence Guild\nReferences\nFurther reading\n*Frank Sheed, The Church and I, Garden City, NY: Doubleday, 1974.\n*Wilfrid Sheed, Frank and Maisie: A Memoir with Parents, New York: Simon & Schuster, 1985.\n*Dana Greene, The Living of Maisie Ward. University of Notre Dame Press, 1997.\n*Frank Sheed, The Instructed Heart: Soundings at Four Depths, Our Sunday Visitor, 1979.\n*\"Concealed With a Kiss,\" in Joseph Pearce, Literary Giants, Literary Catholics, Ignatius Press, 2005.\nExternal links\n*\n*\n*\n* [https://www.nytimes.com/1975/01/29/archives/maisie-ward-86-publisher-dies-writer-and-husband-set-up-speed-ward.html Obit, New York Times]"
    }
  ]
}