{
  "content": [
    {
      "type": "text",
      "text": "# Make love, not war__disambig_1\n\nMake Love, Not War}}\n, 2008]]\n\"Make love, not war\" is an anti-war slogan commonly associated with the American counterculture of the 1960s. It was used primarily by those who were opposed to the Vietnam War, but has been invoked in other anti-war contexts since, around the world.  The \"Make love\" part of the slogan often referred to the practice of free love that was growing among the American youth who denounced marriage as a tool for those who supported war and favored the traditional capitalist culture.\nOrigin\nSeveral people claimed to be the inventor of the phrase, including Gershon Legman, Rod McKuen, radical activists Penelope and Franklin Rosemont and Tor Faegre, and Diane Newell Meyer, a senior at the University of Oregon in 1965, but the earliest uses in print appear to have been in anti-war protests in Berkeley, California earlier in 1965 than the April and May uses cited by Penelope Rosemont and Diane Newell Meyer. Articles mentioning signs and bumper stickers with the phrase were reported in the Daily Californian in February and the Oakland Tribune in March. Barbara Smoker claimed to have financed the manufacture of the first \"Make Love, Not War\" badges. This quote is also attributed to Herbert Marcuse, a German philosopher who emigrated to the United States in the thirties and was an outspoken war critic (cit. quote.org).\nIn popular culture\n*The slogan was featured in two 1973 songs: John Lennon's \"Mind Games\" and Bob Marley's \"No More Trouble\" (first released on the album Catch a Fire).\n*The character of 'Pop', in the 2002 futuristic Queen musical play We Will Rock You, shouts \"Make love, not war!\" as he is brainwashed at the start of the show, which leads into the stage performance of \"Radio Ga Ga\".\n*In the 2019 film Avengers: Endgame, Stan Lee appears in his cameo driving past Camp Lehigh, shouting \"Make love, not war!\" to the army soldiers before driving away.\nSee also\n*Abrazos, no balazos\n*Appeasement\n*Breasts Not Bombs\n*Counterculture\n*Mike Love Not War\n*Peace movement\n*Vietnam War\nReferences"
    }
  ]
}