{
  "content": [
    {
      "type": "text",
      "text": "# Making Plans for Nigel__disambig_2\n\n| released      = 14 September 1979\n| format        =\n| recorded      = June 1979\n| studio        = The Town House, London\n| venue         =\n| genre         =  |post-punk|art rock|art pop}}\n| length        = * 4:14 (album version)\n* 3:54 (single version)\n* 4:15 (demo version)\n| label         = Virgin\n| writer        = Colin Moulding\n| producer      = Steve Lillywhite\n| prev_title    = Life Begins at the Hop\n| prev_year     = 1979\n| next_title    = Ten Feet Tall\n| next_year     = 1980\n| misc          = }}\n}}\n\"Making Plans for Nigel\" is a song by English rock band XTC, released by Virgin Records as the lead single from their 1979 album Drums and Wires. It was written by Colin Moulding, the band's bassist. The lyrics are told from the point of view of overbearing parents who are certain that their son Nigel is \"happy in his world\", affirming that his future, to be spent working for British Steel, \"is as good as sealed\", and that he \"likes to speak and loves to be spoken to\".\nThe single marked XTC's commercial breakthrough. It spent 11 weeks on the UK Singles Chart and peaked at No. 17. In 2016, the song was ranked number 143 on the Pitchfork website's list of the 200 best songs of the 1970s. It was also ranked number 73 in NME list of the 100 best songs of the 1970s.\nInspiration\nBassist Colin Moulding said of the song:\n}}\nDuring this time, XTC typically rehearsed about two or three times a week, at which juncture Moulding would introduce his bandmates to whatever new songs he had been working on. He remembered that \"Making Plans for Nigel\" appeared to receive \"a favourable response. But at that time, I didn't really have enough confidence in myself to know where I was going with the arrangement. The other guys helped me on that, I suppose.\"\nRecording\nIn the XTC biography Chalkhills and Children, it is stated that the song's drum pattern was discovered by accident after a miscommunication between guitarist Andy Partridge and drummer Terry Chambers. Partridge said that the drum pattern was actually a deliberate attempt to invert drum tones and accents in the style of Devo's cover of the Rolling Stones' \"Satisfaction\". He explained that Moulding introduced the song to the rest of the band on a nylon-string guitar at a slow tempo and did not have an idea of how the arrangement should be fleshed out, \"so we said [to Colin], 'Do you fancy trying something like [Devo] for this?\" And Colin said, 'Yeah, give it a go.'\"\nIn Chambers' recollection: \"Because of the subject matter, I wanted to make the beat a bit more industrial. So instead of keeping the rhythm on the hi-hat, I played it on the floor tom and used the hi-hat for the accents. It was the opposite to what drummers usually do but it gave it a juddering, production-line feel. We used a keyboard to make a smashing sound, like an anvil in a foundry. Partridge said that once the drum pattern was established, the band decided that Moulding should duplicate the tom rhythm on his bass guitar. He continued:\nAmong the idiosyncrasies of the song's arrangement is Partridge's high backing vocals. He commented:\nVirgin Records immediately earmarked \"Making Plans for Nigel\" as the lead single off XTC's Drums and Wires, although the band did not expect that the single would be successful. Partridge later complained about the amount of time spent recording the song, remarking that \"[w]e spent a week doing Nigel and three weeks doing the rest of the album.\"\nPackaging\nThe first 20,000 copies of the single had a fold-out cover that created a gameboard of \"Snakes and Ladders\". This was adapted to feature key points in Nigel’s \"miserable life\", including buying a moped, going for job interviews, vacationing in Spain and getting engaged to \"a very nice girl\". There were two versions of the gameboard; one for Nigel, and one for his parents. As credited on the back cover, the illustrator was Steve Shotter and sleeve design was by Cooke Key.\nMusic video\nThe video, directed by Russell Mulcahy, was shot in London on 10 July 1979, together with another put together very quickly for \"Life Begins at the Hop\".}}\nThe single spent 11 weeks on the UK Singles Chart and marked the band's first hit record. Biographer Chris Twomey wrote that although the single is reported to have reached number 17, it was \"later learned that a computer error by the chart compilers had forced the record downwards when it had in fact gone up.\" The song also reached number 12 on the Canadian chart and remained on the charts there for 22 weeks.\nLegacy\nAfter the song's release, 100,000 steel workers went on strike and contacted Moulding for a statement on their issues, but he offered no comment. British Steel also gathered four Sheffield employees named Nigel to talk about job satisfaction for the trade publication Steel News. In a 2020 Guardian article about the song, Moulding said: \"I've had countless Nigels come up to me over the years and say: 'That song is my life.\nThe song has also become associated with British politician Nigel Farage, with several publications using the song's title in articles about Farage or the Reform UK party.\nPersonnel\nAs provided on the record sleeve:\nXTC\n*Andy Partridge – lead guitar, backing vocals\n*Colin Moulding – lead vocals, bass guitar\n*Dave Gregory – rhythm guitar, backing vocals\n*Terry Chambers – drums, percussion\nTechnical\n*Steve Lillywhite – production\n*Hugh Padgham – engineering\nCover versions\n* 1992 – Primus, Miscellaneous Debris\n* 1993 – Burning Heads, Burning Heads\n* 1995 – The Rembrandts, A Testimonial Dinner: The Songs of XTC\n* 1997 - Robbie Williams, B-side to Old Before I Die\n* 1998 – Pitchshifter, Genius (JS Clayden slightly alters the lyrics, singing \"He has no future in a British steel [...] Nigel's no future is as good as sealed\")\n* 2001 – Al Kooper, Rare & Well Done\n* 2004 – Nouvelle Vague, Nouvelle Vague\n* 2010 – The Bad Shepherds, By Hook or By Crook\n* 2025 – Spleen, Making Plans for Nigel\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (1979)\n! scope=\"col\"| Peak position\n|-\n!scope=\"row\" |Australia (Kent Music Report)\n|align=\"center\"|94\n|-\n!scope=\"row\" |Canada RPM Top Singles\n| style=\"text-align:center;\"|12\n|-\n!scope=\"row\" |New Zealand\n|29\n|-\n|}\nReferences\nExternal links\n* [http://chalkhills.org/reelbyreal/s_MakingPlansForNigel.html \"Making Plans for Nigel\" on Chalkhills]"
    }
  ]
}