{
  "content": [
    {
      "type": "text",
      "text": "# Making Auntie Welcome\n\n| runtime        = 6–7 minutes (c. 600 feet)\n| country        = United States\n| language       = Silent filmEnglish intertitles\n| budget         =\n}}\nMaking Auntie Welcome is a 1914 American silent comedy film produced by the Lubin Manufacturing Company and featuring Vincent DePascale, Virginia Capen, Eva Bell, and Oliver Hardy.\nPlot\nJack is not pleased to hear that his aunt is coming for a long visit. In order to encourage her to leave quickly, he pretends to be crazy, and is so convincing that the maid believes he is planning to kill his wife, Grace. The maid and the grocery boy call the police, while Jack chases his aunt down the street. Meanwhile, Grace leaves to help a neighbor, and when the police arrive and find her missing, Jack is arrested for murder. They haul him off to the police station, where his aunt berates him, until Grace comes to his rescue.\nCast\n* Vincente DePascale as Jack\n* Virginia Capen as Grace\n* Eva Bell as Auntie\n* Oliver Hardy as Grocery Boy (as Babe Hardy)\n* Raymond McKee as Police Chief\nProduction and reception\nMaking Auntie Welcome was filmed in Jacksonville, Florida, at the Jacksonville unit of the Lubin Manufacturing Company of Philadelphia, under the general supervision of Arthur Hotaling. The film was a short split-reel comedy, lasting approximately 7 minutes, and sharing a single reel of film with a second, unrelated comedy, Sometimes It Works, starring Raymond McKee and Frances Ne Moyer. The two comedies were both written by Epes W. Sargent, and were released by the General Film Company on August 22, 1914. Making Auntie Welcome is one of a group of short comedies made by the Lubin company in the spring and summer of 1914 that include the earliest screen appearances of Oliver \"Babe\" Hardy. Although the film itself is apparently lost, Hardy can be seen in a surviving publicity still.\nThe film received positive reviews in the trade papers. Moving Picture World wrote \"E. W. Sargent is responsible for this also and Will Louis was brave enough to direct it. The plot is a good one for a comedy of this nature.... A very funny comedy.\" The New York Dramatic Mirror described it as \"burlesque pure, but not simple\". The reviewer for The Bioscope wrote \"Where the audience demands unrestrained eccentricity, this will be found a useful comic\", and went on to observe that \"the Lubin fat man [Hardy] has a sorry time when the 'force' and auntie discover his duplicity\", which may suggest that Hardy's role as the grocery boy was larger than the surviving plot summaries indicate.\nReferences\nSee also\n* Oliver Hardy filmography"
    }
  ]
}