{
  "content": [
    {
      "type": "text",
      "text": "# Making Work Pay tax credit__disambig_1\n\nThe Making Work Pay tax credit was a personal credit provided in tax years 2009 and 2010 to U.S. federal income taxpayers. It was authorized in the American Recovery and Reinvestment Act of 2009.\nThe credit was given at a rate of 6.2 percent of earned income up to a maximum of $400 for individuals or $800 for married taxpayers. Making Work Pay could be claimed by single filers making between $8,100 per year and $95,000 per year. Joint filers in the range of $8,100 and $190,000 could claim it annually. Withholding formulas directed employers to increase take-home pay immediately without action from employees. Taxpayers with multiple jobs or self-employed had to adjust withholding to avoid inadvertently receiving multiple credits. Workers with multiple jobs, or unemployed, had the option to delay receiving the credit and receive instead a lump sum (all $400 to $800 at once) calculated on the tax return filed in the following year.  Reconciling the credit required filing Schedule M with the Form 1040 personal income tax return.\nThe policy concept behind the Making Work Pay tax credit was to stimulate consumer spending, implemented as part of President Barack Obama's stimulus package in 2009. Because Making Work Pay contributed to higher take home pay by reducing withholding, it was assumed that the recipients would spend the majority, if not all, of the credit.\nThe credit was not extended to tax year 2011, and has not been considered since then; instead, Congress passed a payroll tax holiday for two years.\nSee also\n* Earned Income Tax Credit\nReferences\nExternal links\n*[https://www.irs.gov/newsroom/article/0,,id=204447,00.html Making Work Pay Tax Credit information at IRS.gov]\n*[https://www.irs.gov/newsroom/article/0,,id=205922,00.html Making Work Pay Questions and Answers at IRS.gov]\n*[http://tpcprod.urban.org/taxtopics/2011_work.cfm Tax Policy Center Tax Topics: 2011 Budget Tax Proposals]\n*[https://www.everycrsreport.com/reports/R40969.html Withholding of Income Taxes and the Making Work Pay Tax Credit] Congressional Research Service\n*[https://www.congress.gov/bill/111th-congress/house-bill/1/text/pl Sec. 1001] of the American Recovery and Reinvestment Act of 2009"
    }
  ]
}