{
  "content": [
    {
      "type": "text",
      "text": "# Making Men: Sophists and Self-Presentation in Ancient Rome\n\nMaking Men: Sophists and Self-Presentation in Ancient Rome is a 1995 book by classicist Maud W. Gleason. Gleason studies the construction of masculinity among the Greek-speaking elite of the Roman Empire during the second century CE through the careers and writings of two rhetoricians: Favorinus of Arles, a eunuch who achieved success as a Greek orator and philosopher, and Marcus Antonius Polemo of Laodicea, a celebrated sophist and author of a physiognomical treatise. Gleason argues that masculinity in this period was not determined by anatomical sex alone but was an achieved status constructed through sustained training in rhetoric, deliberate management of physical deportment, and mastery of vocal techniques. Based on Pierre Bourdieu's concepts of habitus and symbolic capital, the book treats rhetorical performance as a process of self-fashioning that served both to establish individual masculine identity and to maintain class distinctions within elite society.\nBackground\nThe book emerged from Gleason's broader interest in the cultural practices of self-fashioning in the Roman Empire, especially during the period known as the Second Sophistic. Her research drew on interdisciplinary approaches, incorporating methods from classical studies, social history, and gender theory to study how elite males in the Roman world constructed and performed their identities. The work built upon her earlier publications, including \"The Semiotics of Gender: Physiognomy and Self-Fashioning,\" which appeared in the 1990 collection \"Before Sexuality\" published by Princeton University Press.\nGleason explicitly stated in her preface that she wrote the book \"under influence,\" acknowledging the significant impact of contemporary anthropological and sociological theory on her analysis. She drew on the work of sociologist Erving Goffman, whose research on the importance of gesture and comportment in social interaction provided a framework for understanding ancient self-presentation practices. The book also engaged substantially with Michel Foucault's historical analysis of sexuality, which demonstrated how sexual identities became central to modern Western societies beginning in the nineteenth century. This Foucauldian perspective allowed Gleason to illuminate how ancient Roman understandings of gender differed fundamentally from modern categories, hence showing that masculinity was not an ontological essence tied to biological sex but rather a culturally produced achievement that individuals had to continuously perform and maintain.\nThe concept of self-fashioning that informs Gleason's analysis derives from Stephen Greenblatt's influential work Renaissance Self-Fashioning: From More to Shakespeare (1980). Greenblatt demonstrated how sixteenth-century English writers consciously constructed their identities through deliberate acts of self-presentation, a process he termed \"self-fashioning.\" This Renaissance literary concept provided Gleason with a theoretical framework for understanding how ancient Roman elites also engaged in the conscious construction of masculine identity through rhetorical performance and bodily discipline.\nThe book's approach to ancient texts represented a methodological departure from traditional philological analysis. Rather than treating rhetorical texts merely as literary compositions, Gleason analyzed them as records of embodied practices that were spoken and performed before audiences. This performance-centered methodology, informed by contemporary ethnographic approaches and concepts of participant observation, enabled her to reconstruct how oratorical training functioned as what she termed a \"gymnastics of masculinity\"—a systematic process through which elite males acquired not only mastery of public speaking but also control over their bodies, voices, and physical deportment. The acquisition of paideia thus involved a comprehensive bodily discipline that shaped the orator's entire physical presence, from vocal timbre to posture to gestural vocabulary.\nGleason's theoretical framework also drew on Pierre Bourdieu's concepts of habitus and symbolic capital to analyze how the Roman Empire's civic elite continuously converted economic resources into social prestige through public benefactions and rhetorical performances. This sociological perspective allowed her to demonstrate that gender in the ancient world operated as a continuum rather than a strict binary, with individuals positioned along a spectrum of masculine and feminine characteristics. The investigation of physiognomic texts, in the book, revealed how ancient writers classified individuals not according to fixed biological categories but through a flexible semiotics of gender that evaluated comportment, voice, and appearance as signs of character. The contrast between Polemo's grave, hypermasculine eloquence and Favorinus's cultivated androgyny and melodious voice exemplified how different individuals could successfully navigate this gendered terrain through divergent strategies of self-fashioning.\nThe interdisciplinary nature of the work reflected a broader scholarly development that translator Sandra Boehringer characterized as a productive encounter between classicists and contemporary theorists. This bidirectional relationship meant that while modern anthropological and sociological theory provided tools for better understanding antiquity, the study of ancient societies simultaneously revealed how categories that seem natural in contemporary culture are in fact products of specific historical and social constructions. By demonstrating that ancient understandings of masculinity, sexuality, and gender differed radically from modern assumptions, the book contributed to broader critical discussions about the cultural contingency of identity categories.\nSummary\nGleason analyzes the construction of masculinity in the Roman Empire during the Second Sophistic period of the second century CE, concentrating on the Greek-speaking eastern provinces. Elite men in this era established and defended their masculine identity through public oratory, with rhetoric functioning as self-presentation in what the author calls a face-to-face society where physical deportment, vocal quality, and rhetorical performance faced continuous scrutiny and evaluation. The work uses the careers and writings of two prominent Greek rhetoricians as central case studies for broader questions about gender identity, social distinction, and the relationship between nature and culture in the construction of manhood.\nThe first chapter presents Favorinus of Arles, a eunuch from Roman Gaul who achieved success as a Greek orator and philosopher despite his physical anomaly. The analysis opens with Favorinus's Corinthian Oration, his response to the Corinthians' removal of a statue they had erected in his honor. Favorinus navigates the constraints of sophistic performance culture by adopting various personae—including that of his statue's advocate and the statue itself—to engage in self-praise without appearing to do so directly, a technique recommended by Plutarch in his essay on inoffensive self-praise. This rhetorical approach transforms what might have been a humiliating defeat into a demonstration of his mastery over language and cultural conventions, with Favorinus ultimately claiming to resurrect his statue through the power of words alone and presenting himself as a living demonstration of the civilizing effects of Hellenic culture.\nThe second chapter introduces Marcus Antonius Polemo of Laodicea, Favorinus's archenemy and a celebrated sophist known for his imperious self-presentation and adherence to conventional standards of masculinity. Polemo excelled as a public performer and wrote a treatise on physiognomy, positioning himself as an inscrutable master capable of decoding others' self-presentation. His physiognomical work survives through an Arabic translation, a Greek epitome, and a Latin treatise that drew heavily from the Greek original. Polemo used physiognomy both as a theoretical system and as a weapon against Favorinus, inferring moral depravity from his rival's physical characteristics while presenting himself as the embodiment of proper masculine deportment. Polemo's career exemplified the successful sophist: he traveled in style with an exotic chariot and elaborate retinue, maintained the most splendid house in Smyrna, secured imperial privileges and benefactions for his adopted city, and commanded such authority that he once evicted a Roman proconsul who had taken lodging in his house.\nThe third chapter articulates the book's central theoretical framework through Polemo's physiognomical treatise and related texts from the period, treating deportment as a complex language that the body had to learn to speak. Gender categories in this period did not constitute a simple binary taxonomy but rather functioned as organizing principles for sorting human differences into hierarchies and oppositions through polarized distinctions—smooth versus hirsute, high-pitched versus low-voiced, pantherlike versus leonine—that purported to distinguish men from women but actually divided males into legitimate and illegitimate members of society. The physiognomists, astrologers, and popular moralists of antiquity thought in terms of degrees of gender-conformity and gender-deviance, creating a system in which masculinity was understood as grounded in nature yet remained fluid and incomplete until firmly anchored through disciplined acculturation. This area of slippage between anatomical sex and constructed gender provided space for the crypto-cinaedus to design his disguise and for the physiognomist to decode it through careful observation of minute signs of gender deviance in gait, gesture, facial expression, and voice. Men scrutinized one another intently for these telltale signs, and rhetoricians trained deliberately to develop these traits in what was considered a masculine fashion.\nThe fourth chapter positions the voice as a boundary marker for gender identity and a central concern in the discipline of self-fashioning. Vocal exercise functioned within the broader second-century culture of self-care and physical cultivation, with medical and rhetorical theories connecting voice training to the maintenance of masculine identity. While a low, resonant voice was considered the mark of a truly masculine nature and a sign of noble character, the practical demands of public speaking required vocal flexibility and a range that could project effectively in large spaces without mechanical amplification. This created an inherent tension between the ideal of masculine vocal deportment and the aesthetic and practical requirements of effective oratory. The medical writers discussed understood voice training as a form of physical exercise that could literally reshape the flesh, opening the pores and aerating the body in ways that reinforced masculine development in men while potentially causing loss of fertility and femininity in women who attempted similar practices. The boundary between men's and women's voices was thus understood as both biological and cultural, maintained through specific regimens of training and discipline.\nThe fifth chapter surveys Roman rhetorical writers from the Auctor ad Herennium through Cicero, Seneca the Elder, Seneca the Younger, and Quintilian, showing their ongoing concern with vocal deportment and its relationship to masculine identity, social status, and political authority. These authors navigate complex terrain where the requirements of effective public speaking sometimes conflicted with rigid standards of masculine vocal presentation, showing concern for decorum and the status of Roman politicians and leaders. A persistent ambiguity in Roman rhetorical theory existed between the desire for a voice that projected authority and masculinity and the recognition that persuasive oratory often required a more flexible and aesthetically pleasing vocal style that critics might characterize as effeminate. This tension created space for accusations of effeminacy to be deployed as weapons in the competitive world of rhetorical culture, even as practitioners who adopted what their rivals characterized as effeminate or Asian styles could achieve substantial popular success with audiences.\nThe sixth chapter returns to Favorinus, tracing how he fashioned himself as both philosopher and sophist and navigated the paradoxes of his position through strategic self-presentation. Working from sources including Lucian's satirical portrait in The Eunuch, the more sympathetic account of him as a dignified sage in Aulus Gellius's Attic Nights, and Favorinus's own discourse On Exile, the chapter shows how Favorinus constructed his identity. Favorinus's success lay precisely in his unique position outside conventional gender categories. Because he was born with what ancient sources identified as three paradoxes—he was a Gaul who spoke Greek, a eunuch accused of adultery, and someone who had quarreled with the emperor Hadrian and survived—Favorinus had to construct his identity entirely through cultural achievement rather than relying on biological inheritance or conventional markers of masculine authority. This made him more conventional in one sense than rivals like Polemo who could rely partly on their natural masculine attributes, since Favorinus demonstrated through his very existence that paideia (elite Greco-Roman education and culture) truly possessed the transformative power that had long been claimed for it. His high-pitched voice and florid presentation style, which contrasted sharply with Polemo's traditionalist approach, proved effective with audiences, indicating that ideal masculine behavior in rhetorical performance was not a monolithic abstraction.\nThe conclusion addresses why the more androgynous or so-called effeminate style of oratory proved effective with audiences despite exposing its practitioners to accusations of imperfect masculinity, offering two complementary explanations: adopting such a risky style could itself be seen as demonstrating courage, the ultimate manly virtue, and it represented an attempt to gain power from outside the traditionally acceptable sources by transcending the narrow boundaries of conventional oratorical competition. The intense preoccupation with proper masculine deportment among members of the social elite may have been possible only within the immense security of the Pax Romana, a period when local aristocrats could afford to challenge each other's masculinity in the arena of rhetorical performance while remaining collectively secure in their social and political dominance.\nThe final section considers the late fourth-century observations of Libanius of Antioch, whose complaints about the decline of rhetorical culture show how the system of converting economic capital into symbolic capital through displays of eloquence had begun to deteriorate as young aristocrats increasingly pursued legal careers and imperial appointments rather than traditional civic roles, offering a perspective on the historical contingency of the sophistic system.\nReception\nSimon Swain described the book as an engaging, intelligent, and original attempt to answer questions about the unparalleled influence of rhetorical schools and sophists in the High Roman Empire. Swain noted that the book was built around Polemon's physiognomical tract and used his rivalry with Favorinus to explore issues that made speech making and training so important to the Greek and Roman elites. While praising the methodologies of cultural anthropology and semiotics, he raised two objections: first, that the notion of rhetoric as the only outlet for politically impotent cultural constructs was ultimately misleading since rhetoric remained a vital form of communication and patterns of competition and power remained largely unchanged for most of the elite; and second, that treating the Empire as a Greco-Roman civilization without variation obscured important differences, particularly in the purpose and function of rhetoric in the Greek world versus Roman contexts. Despite these reservations, he thought that it was a welcome new view on a vast and appealing topic and praised the concluding observation that Favorinus's prose adumbrated the spiritual configuration of an age experiencing deep shifts in its models of personal identity.\nHelen Parkins characterized the work as a book that breaks new ground in its discipline and one that would provide material for further thought and research in the coming years. Parkins praised Gleason for addressing the neglected subject of masculinity in antiquity and for starting to redress the imbalance in scholarship that had focused primarily on women and sexuality. She found the author's arguments intricate and careful, and considered that the book effectively placed masculinity on the agenda of ancient social history, though she acknowledged that the complex arguments could not be fully summarized in a brief review.\nH. J. Mason praised the work for using the competition between Polemo and Favorinus to explore important issues of self-definition and for considerably extending gender studies into new areas, and expressed hope that scholars studying gender and sexuality in other periods would find value in the material despite its focus on second-century Mediterranean intellectual culture. While acknowledging that each section contained insightful and valuable analysis, Mason wished for more detailed accounts and fuller discussion of several subjects, including ancient attitudes toward sexual deformity and eunuchs, the relationship between effeminate stereotypes and portrayal of Syrian priests, and a more comprehensive treatment of self-presentation strategies drawn from rhetorical handbooks.\nIn his review, Simon Goldhill praised Gleason's book as a real contribution to Second Sophistic studies that would benefit many classicists. Goldhill found the work constantly enjoyable to read and elegantly written, with a host of interesting examples throughout. Goldhill singled out the chapters on voice training and virility as the finest and most novel sections, noting that Gleason uncovered ancient prescriptions that had been scarcely treated and set them persuasively in context through brilliant use of anthropological concerns. He credited the book with fascinatingly revealing the overlapping concerns of body, training, and intellectual activity, and with taking rhetoric seriously as a cultural process that policed gender definition, paideia, and status. The central claim that rhetoric functioned as self-fashioning marked a considerable development over traditional writing on rhetoric, and the anthropological perspective on rhetoric as social process offered a profitable view from which classicists would learn.\nJonathan Walters praised the deployment of a very wide range of learning encompassing not only technical treatises on rhetoric but also texts on physiognomy and astrology. Walters noted that the author demonstrated the intricate interaction of notions of gender-appropriate behavior with issues of morality, linguistic style, and social status, observing that her style was vivid and engaging and made her discussion of a complicated subject easy to read. Walters believed that the work made a major contribution to the study of gender, with particular reference to masculinity in the Greek world, casting new light on the institution of oratory and bringing to light its connections with ancient sciences such as physiognomy, astrology, and medicine.\nJaap-Jan Flinterman found the work convincing as a demonstration of the function of sophistic oratory in male socialization and of the extent to which battles about correct male behavior were waged in the field of oratory, adding that it made delightful reading. Flinterman appreciated the utilization of Pierre Bourdieu's conceptual apparatus and the comparison of sophistic oratory with euergetism, noting that these approaches enabled the work to overcome deadlock in debates about the historical significance of the Second Sophistic by stressing the sociopolitical function of an oratorical and literary culture seemingly devoid of social relevance. While noting that he would sometimes have wished for further substantiation of attractive suggestions and objecting that the subtitle was a misnomer since the Second Sophistic was primarily a phenomenon among Greek-speaking elites, he thought by observing that the work gave a striking demonstration of the Second Sophistic's importance as evidence for the history of mentalities in the Early Empire.\nIn his review, Egon Flaig focused on the theoretical framework and its use of Bourdieu's concepts to analyze how the Roman Empire's civic elite continuously had to convert economic capital into symbolic capital through public benefactions and oratory. Flaig detailed how the work traced the social production of masculinity from systematic physical manipulations performed by nurses on infants to create the properly masculine body through to voice training as the medium for achieving full manhood, noting that the high investment of time and effort required to acquire and maintain oratorical competence made evident that masculinity was a cultural product. Flaig observed that the work demonstrated how gender could be separated from anatomical sex, quoting the formulation that masculinity in the ancient world was an achieved state radically underdetermined by anatomical sex, and explaining how the book confronted two outstanding representatives of the Second Sophistic whose contrasting styles and backgrounds illuminated different strategies for constructing masculine identity.\nM. Billerbeck noted that behind the book's playful title lies a passionately argued study that tracks Second Sophistic masculine ideals through the framework of American gender studies. Billerbeck singled out Gleason's penetrating character portraits of the two antagonists—the hermaphroditic Favorinus and the ostentatiously virile Polemo—as effective anchors for discussions of ancient physiognomy, voice theory, and rhetorical self-fashioning. Billerbeck credited the work with solid source knowledge, especially in medical-ascetic literature, and for opening up—though in a fashionably contemporary idiom—significant perspectives on imperial-era personality cultivation and the unscrupulous struggle among sophists for social recognition. The reviewer found rhetoric's function as the framework of persona treated adequately throughout, with the final chapter on the eunuch-philosopher's self-fashioning proving most convincing. Building on J. Moles's analysis of Dio of Prusa, Billerbeck judged Gleason's case that Favorinus's \"On Exile\" was merely posturing fiction rather than genuine reflection to be credible.\nD. M. Schenkeveld praised the study as full of new insights and written in a crisp style, though he wished for lengthier discussions and more chapters given the many subjects treated. Schenkeveld noted that the chapters on voice training were much more instructive and stimulating than previous dull studies on rhetorical delivery, observing that the gender approach made him aware of advantages he had not previously considered. He found the final chapter's discussion of how Favorinus turned his disadvantages into displays of his acumen and rhetorical abilities particularly effective, and he appreciated how the work showed that Favorinus's identity resulted from a paideia that was conventional and that Favorinus mastered totally.\nIn his review, Andrew Wallace-Hadrill noted a striking methodological observation: direct statements about the dangers of effeminization for the young orator appear prominently in Latin rhetorical handbooks but are absent from the Greek rhetorical handbooks that form Gleason's primary sources. This absence likely reflects the different political circumstances and career trajectories faced by these two groups—the main Latin rhetorical treatises predate the second-century CE Greek sophists and addressed Roman speakers pursuing political careers in Rome, while Greek sophistic teachers of the second century taught the sons of Greek-speaking cities in the eastern Empire, who faced different gender expectations and political realities. Wallace-Hadrill observed that while Favorinus and Polemo serve as illuminating case studies of the instability between natural and cultural aspects of gender, Gleason's focus on these Greek sophists—with their concerns about soft flesh, limp posture, high voices, and excessive attention to personal appearance—provides a particular window into ancient anxieties about gender, ethnicity, and cultural identity within the Greek-speaking world of the Second Sophistic.\nOther scholarly reviews appeared in Mediterranean Historical Review, Les Études Classiques, and Athenaeum.\nOnno van Nijf used epigraphic evidence from cities in southwest Asia Minor to demonstrate that athletic performance in local festivals provided an equally important pathway to elite masculine identity formation as the rhetorical training emphasized in Gleason's study. The article reveals that for many young men in the Roman East, athletic victory and its public commemoration through inscriptions and statues served as crucial markers of Greek cultural identity, social status, and manhood alongside—and sometimes instead of—the literary and rhetorical accomplishments that dominated elite self-fashioning.\nTranslations\nFrench\nThe book was translated into French in 2013 under the title 'Mascarades masculines: Genre, corps et voix dans l'Antiquité gréco-romaine' and published by EPEL, the publishing arm of ''l'École lacanienne de psychanalyse'', a Lacanian psychoanalytic school based in Paris, as part of the series \"Les grands classiques de l'érotologie moderne\" (The Great Classics of Modern Erotology). The series aimed to make \"pioneering work in gay and lesbian studies and Queer theory\" available to French readers. The impetus for the translation appears to have been interest from Lacanian psychotherapists in Gleason's analysis of gender construction and self-fashioning.\nThe French edition includes a six-page postface by the distinguished classicist Florence Dupont, which revisits some of the book's assumptions, while translators Sandra Boehringer and Nadine Picard added clarifying footnotes and incorporated the most recent source editions to improve upon Gleason's translations. Jean-Noël Allard, reviewing the French translation in Clio. Femmes, Genres, Histoire, described how the work examines the articulation of gender identity and oratorical praxis in the Second Sophistic, where eloquence served as the primary sign of masculinity and social superiority. Allard noted that Gleason focused on Favorinus and Polemo as embodying opposing gender poles—Favorinus adopting an effeminate style while Polemo exhibited almost caricatured masculinity—to demonstrate how rhetoric, despite subscribing to masculine ideals, permitted the construction of identity freed from normative constraints. Allard observed that the book traced how elite males navigated complex semiological codes involving posture, voice, and physical appearance, showing that some men successfully triumphed with feminine eloquence over proponents of hypermasculine discourse. The review concluded with Gleason's paradoxical argument that adopting despised effeminate manners could itself manifest a certain virility, and that the feminine might function as an effective means of distinction and domination within this competitive framework. Allard praised the work as offering a remarkable analysis of Second Sophistic eloquence, punctuated by detailed examinations of speeches and rhetorical strategies in the first two chapters, with impressive diversity and multiplicity of sources, presented in a lively style with consistently clear prose that could reach an audience beyond specialists.\nScholars Sandra Boehringer and Violaine Sébillotte Cuchet have connected the French translation to broader theoretical developments in gender studies, particularly linking Gleason's analysis to Judith Butler's concept of gender as performance. They note that the book examines how paideia shaped the bodies of orators and rhetoricians during the Second Sophistic period through analysis of rhetorical treatises and exercises prescribed for future orators. In their discussion, they highlight Gleason's chapter on \"posture as language\" which analyzes how ancient physiognomic texts used gender categories to classify individuals, presenting gender not as a strict binary opposition but as a continuum along which individuals moved, exemplified by the contrasting figures of Polemo with his grave, hypermasculine eloquence and Favorinus of Arles with his cultivated androgyny and melodious voice.\nReferences"
    }
  ]
}