{
  "content": [
    {
      "type": "text",
      "text": "# Making Waves (The Nolans album)\n\n| prev_title = Nolan Sisters\n| prev_year  = 1979\n| next_title = Portrait\n| next_year  = 1982\n}}\nMaking Waves is the fifth studio album released by the pop group The Nolans released on 17 October 1980. In the UK, the album went gold and featured four top 20 singles.\nWorldwide, it became their biggest-selling album selling over 5 million copies. It was certified double platinum in Australia and reached No.2 in Sweden and Ireland and No.1 in New Zealand and Japan.\nProduced by Ben Findon and Nicky Graham, the album contained the top 10 hits \"Gotta Pull Myself Together\" and \"Attention to Me\".\nBackground\nThe Nolans began working on Making Waves shortly after their name change (from The Nolan Sisters) in early 1980. The single \"Don't Make Waves\", taken from the album and released in April 1980, reached number 12 on the UK charts. In mid-1980, Anne left the group and Coleen became an official member of the group, and recorded the remainder of the songs with them for Making Waves, including \"Gotta Pull Myself Together,\" which would later take the No.9 spot on the UK charts.\nThe album was released in October 1980, and tracks \"Who's Gonna Rock You\" and \"Attention to Me\" went on to be released from the album, both of them becoming UK top 20 hits. The album was a similar success, peaking at No.11 and spending 33 weeks in the charts, their longest run in the UK. It was certified gold by the BPI for sales of over 100,000. The album reached No.1 in Japan – their biggest market, where it was released as 恋のハッピー・デート (Happy Dating Love). It became the ninth biggest-selling album of 1981 there. In Australia, the album was released with an earlier single \"I'm in the Mood for Dancing\" included, which also featured on the Japanese version, replacing \"Sexy Music\", which instead was the title track to their next album (a compilation). In Australia the album was a success, being awarded double platinum.\nThe songs were produced separately by two producers, Ben Findon, who was responsible for the pop-orientated tracks like \"Gotta Pull Myself Together\" and \"Attention to Me\", while Nicky Graham produced the more disco-themed songs such as \"Who's Gonna Rock You\" and \"Lead Me On\". Significant other songs included \"Touch Me in the Morning\", a cover of the Diana Ross hit, \"Get Ready\", a cover of The Temptations hit and \"Sexy Music\", which was released as a single in Japan after winning the 1981 Tokyo Music Festival.\nThe album was re-released on Compact disc in June 2009 by Cherry Red Records in a double-pack with their previous album.\nTrack listing\n| extra3       = Nicky Graham\n| length3      = 4:16\n| title4       = Don't Stoke the Fire\n| extra4       = Findon\n| length4      = 2:46\n| title5       = Better Late Than Never\n| extra5       = Findon\n| length5      = 3:46\n| title6       = Sexy Music\n| extra6       = Findon\n| length6      = 3:37\n}}\n| extra1       = Graham\n| length1      = 2:43\n| title2       = Attention to Me\n| extra2       = Findon\n| length2      = 3:07\n| title3       = Old Feelings Again\n| extra3       = Findon\n| length3      = 2:35\n| title4       = Lead Me On\n| writer4      =\n| extra4       = Graham\n| length4      = 2:35\n| title5       = Directions of Love\n| extra5       = Findon\n| length5      = 2:54\n| title6       = Get Ready\n| writer6      = Smokey Robinson\n| extra6       = Graham\n| length6      = 2:35\n}}\nChart performance\n{| class=\"wikitable\"\n|-\n! Release date\n! colspan=\"135\"| Single title\n! UK Chart position\n|-\n| April 1980\n| colspan=\"135\"| \"Don't Make Waves\"\n| align=\"center\"|12\n|-\n| September 1980\n| colspan=\"135\"| \"Gotta Pull Myself Together\"\n| align=\"center\"|9\n|-\n| December 1980\n| colspan=\"135\"| \"Who's Gonna Rock You\"\n| align=\"center\"|12\n|-\n| April 1981\n| colspan=\"135\"| \"Attention to Me\"\n| align=\"center\"|9\n|-\n! Release date\n! colspan=\"135\"| Album title\n! UK Chart position\n|-\n| October 1980\n| colspan=\"135\"| Making Waves\n| align=\"center\"|11\n|-\n! Release date\n! colspan=\"135\"| Album title\n! Australian Chart position\n|-\n| June 1981\n| colspan=\"135\"| Making Waves\n| align=\"center\"|10\n|}\nReferences\nExternal links\n*\n*"
    }
  ]
}