{
  "content": [
    {
      "type": "text",
      "text": "# Male Mahadeshwara Hills\n\n}}\n| subdivision_type1               = State\n| subdivision_name1               = Karnataka\n| subdivision_type2               = District\n| subdivision_name2               = Chamarajanagara\n| established_title               =\n| established_date                =\n| named_for                       = Mahadeshwara\n| government_type                 = Muzarai\n| governing_body                  = Karnataka State Government\n| unit_pref                       = Metric\n| area_footnotes                  =\n| area_rank                       =\n| area_total_km2                  =\n| elevation_footnotes             =\n| elevation_m                     = 910\n| population_total                =\n| population_as_of                =\n| population_rank                 =\n| population_density_km2          = auto\n| population_demonym              =\n| population_footnotes            =\n| demographics_type1              = Languages\n| demographics1_title1            = Official\n| demographics1_info1             = Kannada\n| timezone1                       = IST\n| utc_offset1                     = +5:30\n| postal_code_type                =\n| postal_code                     = 571490\n| registration_plate              =\n| blank1_name_sec1                = Nearest city\n| blank1_info_sec1                = Hanur\n| website                         =\n| footnotes                       =\n| name                            =\n| official_name                   =\n| elevation_max_m = 1514\n}}\nMale Mahadeshwara Betta (Hill), is a pilgrim town located in the Hanur taluk of Chamarajanagar district of southern Karnataka. It is situated at about 150&nbsp;km from Mysuru and about 210&nbsp;km from Bengaluru. The ancient and sacred temple of Sri Male Mahadeshwara is a pilgrim centre where Mahadeshwara lived, practiced medicine as Sidda, taught ahimsa to people in and around the seven hills. It draws lakhs of pilgrims from the states of Karnataka and Tamil Nadu. The area of the present temple surroundings is . In addition, the temple has lands at Talabetta, Haleyuru and Indiganatha villages. Amidst dense forest, the temple attracts not only the pilgrims but also nature lovers. The height of the hill is about 3000 feet above sea level.\nJunje Gowda is the legendary builder of the Male Mahadeshwara temple in hanur taluk of Chamarajanagara District. He was a local landlord belonging to the Kuruba community and a devotee of Shri Mahadeshwara Swamy.\nThe Lord Sri Mahadeshwara is believed to be the incarnation of Lord Shiva. Historical evidences suggest that the Saint Mahadeshwara must have lived during the 15th century. About 600 years ago, he came here to perform penance and it is believed that he is still performing penance in the temple's Garbha Gudi in the form of a Linga. The Linga, worshipped now in the Garbha Gudi, is a self-manifested (swayambhu) one. Sri Male Mahadeshwara Swamy was moving on a tiger known as Huli Vahana (Tiger as a vehicle) and performed a number of miracles around the Betta to save the people and saints living there. The Lord Sri Mahadeshwara's miracles are sometimes sung by the village folk in Janapada Style.\nThe story of Mahadeshwara\nAccording to legend, Male Mahadeshwara was born in to Chandrashekara Murthy and Uththarajamma, in Madiga community. Lord Mahadeshwara visited the house of Junje Gowda, a wealthy landlord of the Kuruba Gowda caste and a devotee of the god Beredevara. There he performed miracles to convince Junje Gowda of his power and in the end won Junje Gowda to his following. Junje Gowda is said to be responsible for all the temples built in the mountainous region of eastern Karnataka called the Mahadeshwara Hills. But the Junje Gowda family is still living the village called Kadamboor, in Hanur taluk. Chamarajangar district.\nAccording to tradition there are seven peaks identified in the legend - Anumale, Jenumale, Kanumale, Kadumale, Pachchemale, Pavalamale, Ponnachimale. These seven peaks together form the Male Mahadeshwara Betta. It is said that the saint Lord Mahadeshwara established a Mutt here for looking after the religious and cultural affairs of the people of this area. It is also said that, through his miracles, he enlightened and uplifted the hill tribes and made them his disciples. The people coming from these families have become hereditary 'Archakas' of the Mahadeshwara temple. The temple was under the control & management of Sri Salur Mutt established by the Lord Mahadeshwara himself until it was handed over to the Madras Government in the year 1953. After the formation of the state of Karnataka, the administration of the Temples is done by the trust committee, appointed by the Karnataka Government under the Muzrai Department.\nTourism\nMale Mahadeshwara Hills have become a tourist destination of Chamarajanagar district. Every thousands of folks come to the hills from various districts of Mysore,Mandya, Ramanagara and several other. The hilltop is well-developed with paved roads and tiled footpaths.  There are villas that visitors can rent out during their stay.  There are many shops selling curios and pooja items.\nAbout 50 years ago there were no roads to this place. People used to reach the place by walking. At present, there are road connections from Karnataka and Tamil Nadu. More than 100 buses ply this route every day.\nThere are several places of historical interest in this area to which the devotees often pay their visits. A pilgrimage to Male Mahadeshwara temple also includes a holy dip in the Antaragange (literally \"a stream flowing from a perennial source\").\nKamsale\nThe song and dance routine is called Kamsale (Kannada: ಕಂಸಾಳೆ ನೃತ್ಯ). Kamsale is closely connected with a tradition of Shiva worship.  Only those who have vowed to live a life of devotion to Mahadeshwara are supposed to perform kamsale. The dance is a part of a 'deeksha' or oath and is taught by a teacher or spiritual leader. Kamsale artists are illiterates and have no printed literature. They learn those songs orally. They participate in fairs, which are held in Mahadeshwara Betta during 'Deepavali', 'Shivaratri' and 'Ugadi' festivals. Hence, Mahadeshwara is also known as Badawara devaru Madappa\n\"Chellidaru Malligeya\" is a famous folk song that describes the devotion and worship of lord Mahadeshwara.\nEpic\nThe epic story of Mahadeshwara describes the life and miracles of the saint. The outer structure of the epic resembles the pan-Indian Ramayana : Shiva incarnates himself on earth as Mahadeshwara to destroy an evil king called Shravanasura ('The Hero as Saviour' motif). The epic has seven parts; and normally, only certain parts are sung as dictated by the taste of the audience or patron. However, the entire epic is sung by some pilgrims on their way to the annual fair on the Mahadeshwara Betta; and it may last for seven consecutive nights.\nThe epic (single-narrator version) has seven parts. After traditional invocation, the first part narrates the immaculate birth, childhood, and spiritual quest of Mahadeshwara. The second part narrates the ways through which Mahadeshwara gets a wealthy kuruba Gowda Junje Gowda as his devotee to build him a temple on the Seven Betta. The next part is devoted to the destruction of the evil king, Shravanasura. Next we have the longest and most moving episode called 'Sankamma kathe'. This episode dramatises the suffering of a proud woman called 'Sankamma,' and the ordeals that she successfully undergoes in order to retain her dignity as a virtuous wife. The fifth episode, slightly comic in tone, depicts the rise and fall of a vainglorious and miserly woman, called 'Bevinatti Kalamma.' The last but one episode narrates how Mahadeshwara gets two simple and god-fearing people, Moogayya and his wife, as his devotee religion family. Mugayya family the grandson mahadeshwara. The concluding part, besides traditional ending with benediction, gives a brief summary of the entire epic.\nGeography\nMale Mahadeshwara Hills are located at the northeastern section of a disjoint projection of the Western Ghats in a northeastern direction at the southern edge of the Deccan Plateau. Together with the Biligiriranga Hills, the hill range forms a geological bridge between the Eastern and the Western Ghats. The region is separated from the Nilgiris by the Moyar River.\nThe Male Mahadeshwara Hills region is bound by the Kaveri river to the north and east, and by the Palar river, a tributary of Kaveri, to the south. The confluence of these two rivers is located at the southeast corner of the Male Mahadeshwara forest, with the Stanley Reservoir further downstream.\nThe average elevation of the Male Mahadeshwara Hills is around . The highest point is Ponnachi Betta, rising  above sea level.\n{| class=\"wikitable sortable\"\n|+ Prominent peaks of Male Mahadeshwara Hills\n|-\n! colspan=\"2\" |Name!! Coordinates !! Elevation !! Nearest Village\n|-\n| rowspan=\"4\" |Ponnachi Range\n| Ponnachi Betta ||  ||  || Ponnachi\n|-\n| Barai Hanai ||  ||  || Ponnachi\n|-\n| Santekan Boli ||  ||  || Ponnachi\n|-\n| Gandana Parai ||  ||  || Ponnachi\n|-\n| colspan=\"2\" |Kambattakal Betta||  ||  || Kokkubarai\n|-\n| colspan=\"2\" |Ediru Boli||  ||  || Male Mahadeshwara Hills\n|-\n| colspan=\"2\" |Sankana Malai||  ||  || Doddane\n|-\n| colspan=\"2\" |Budubarai Betta||  ||  || Doddane\n|-\n| colspan=\"2\" |Kutirai Kallu||  ||  || Tokere\n|-\n| colspan=\"2\" |Galathavarai Betta||  ||  || Changadi\n|-\n| colspan=\"2\" |Doddamayil Betta||  ||  || Gopinatham\n|-\n| colspan=\"2\" |Jogamaran Betta||  ||  || Ponnachi\n|}\nFlora and fauna\nApart from being a pilgrimage centre, the Male Mahadeshwara Hills possess large tracts of forest area rich in sandalwood and bamboo. The landscapes of Betta and the valleys are covered with forests varying from evergreen forests in Ponnachi to dry deciduous forests in most other parts.\nThe forests of Male Mahadeshwara are inhabited by a variety of animals, birds and reptiles. They are found in large numbers too. Elephants are the most prominent species. The latest estimate puts the population of elephants are more than 2500 in the district, which includes Bandipur National Park too. Frequent sightings of guars (Indian bison), sambars, spotted deer, jackals, sloth bears, porcupine, etc., apart from rare sightings of tigers, leopards and wild dogs are possible in and around this area. The Male Mahadeshwara Reserve Forests, has an approximate area of 39361.45 hectares and has a few small villages like Ponnachi, Kombadikki, Kokkebore, Doddane, Tokere, Tulsikere, Puduru village, Thambadi street or Thambadigere, Palar, Gopinatham, Indiganatha, etc., as enclosures within the reserve forests.\nAccording to media reports a decision to declare  (90,618.75 hectares) of  of the Kollegalaa Range forest as Male Mahadeshwara Wildlife Sanctuary was taken during the fifth meeting of the Karnataka Wildlife Board held on 15 December 2012. The then chief minister Jagadish Shettar, who presided over the meeting, approved this under Section 26A (I) (B) of the Wildlife Conservation Act, 1972, (Amendment 2006) on 7 May 2013. But the same information is yet to reflect on the website of the Karnataka Forest Department.\nReferences\nExternal links\n*"
    }
  ]
}