{
  "content": [
    {
      "type": "text",
      "text": "# Malleshwaram inscriptions and hero stones\n\nMalleshwaram is a northwestern locality in Bengaluru, recognized as one of the city's oldest planned areas. While Malleshwaram was developed on modern lines as a new residential locality in 1898 following a plague epidemic, historical evidence, including inscriptions and a hero stone, points to a much older history for the area and its surroundings. These artifacts contribute significantly to Bengaluru's rich epigraphic heritage, a city with over 175 documented inscription stones.\nThe area yields two significant Kannada inscriptions and is linked to a notable hero stone (Veeragallu). A key inscription from 1669 CE records the donation of the village of Medaraninganahalli to the Mallapura Mallikarjuna temple by the Maratha king Ekoji I. Another fragmentary inscription was found at Jakkarayanakere.\nAdditionally, a 10th-century hero stone, commemorating a tiger hunt, was discovered on the grounds of the Indian Institute of Science (IISc), which now occupies the land formerly belonging to Medaraninganahalli.\nThe name \"Mallapura,\" the historical precursor to Malleshwaram, likely originates from the Kannada words [https://alar.ink/dictionary/kannada/english/%E0%B2%AE%E0%B2%B2%E0%B3%86 Male] or Malai (hill) and [https://alar.ink/dictionary/kannada/english/%E0%B2%AA%E0%B3%81%E0%B2%B0 Pura] (town), meaning \"town on the hill\". Over time, this evolved into Malleshwaram. In early official correspondence, the area is spelled variously by officials and residents as Malleswaram, Mallesvarum, Malleswara, Mallesvaram, and Malleshwarim. This article uses the commonly used spelling today, Malleshwaram.\nMalleshwaram 1669 CE Ekoji's Mallapura Mallikarjuna temple donation inscription\n| location =\n| writing = Kannada script of the time\n| image_size = 350\n| width =\n| created =\n| discovered_date = 1928\n| discovered_by = R Narasimhachar and team of the Mysore State Archaeology Department\n| website = https://mythicsociety.github.io/AksharaBhandara/#/learn/Shasanagalu?id=115035\n| language = Kannada\n}}This inscription provides crucial evidence for the Maratha administration in Bengaluru during the 17th century and confirms the existence of Mallapura (Malleshwaram) at that time.\nHistorical context: Maratha Rule in Bengaluru\nThe Maratha presence in Bengaluru predates Ekoji I. His father, Shahaji, a prominent Maratha general serving the Bijapur Sultanate, was granted Bengaluru as a jagir (land grant). Shahaji used Bengaluru as his base for many years, and even Chhatrapati Shivaji, the founder of the Maratha Empire, spent some of his early years in the city with his mother, Jijabai. After Shahaji's death in 1664, his jagir was divided between his sons.  Shivaji inherited the western portion and consolidated the Maratha territories there, while Ekoji I, also known as Venkoji, inherited the southern jagir, including Bengaluru and Thanjavur. Although they were half-brothers, Ekoji and Shivaji had different mothers and grew up largely in separate spheres of influence. While Shivaji focused on building an independent Maratha kingdom in the western Deccan, Ekoji consolidated his power in the south.  Despite their geographical distance and differing political ambitions, they maintained contact and even exchanged letters.  However, their relationship was complex and at times marked by rivalry, particularly concerning the division of their father's territories and resources. Although Ekoji eventually established his capital in Thanjavur, Bengaluru remained under Maratha control. This inscription from 1669 CE provides evidence of the Maratha administration and their engagement in the region.\nThe Donation Grant of 1669 CE\nThe Kannada inscription records the donation of Medaraninganahalli village to the Mallapura Mallikarjuna Temple by Ekoji I. This grant was made at the request of the bĕṃgulura mahanāḍu (assembly or people of Bengaluru), providing an early reference to the name \"Bengaluru\". The inscription effectively functioned as a royal edict, directing tax revenue from Medaraninganahalli to the temple instead of the king's treasury.\nThe mention of Mallapura Mallikarjuna Temple suggests that the earlier name of Malleshwaram was Mallapura.\nThe Shapashaya (Imprecatory Verse)\nFollowing common practice for grants, the inscription includes a Shapashaya, an imprecatory verse warning against violating the donation's terms. It states that violators, regardless of social class (Brahmanas, Kshatriyas, Vaishyas, Shudras), will face severe consequences, likened to the sin of killing a cow in Kashi (Varanasi), or rebirth as a donkey, crow, or Chandala (a historically marginalized social group). It also warns Muslims against interference, stating they would incur a sin equivalent to consuming pork in Mecca. This is noted as the earliest inscription in the Bengaluru region to explicitly mention Islam and its followers.\nPhysical characteristics of the inscription\nThe inscription is engraved on a boulder, with the inscribed area measuring approximately 115&nbsp;cm in height and 392&nbsp;cm in width. The Kannada characters are approximately 8.3&nbsp;cm tall, 6.5&nbsp;cm wide, and 0.45&nbsp;cm deep. It features symbolic engravings of the sun, moon, and a linga (an aniconic symbol of the Hindu deity Shiva). The sun and moon typically signify the grant's intended permanence (\"as long as the sun and moon endure\"), while the linga indicates Shaivite religious context or authority.\nDiscovery and dating\nThe inscription was first documented by B. L. Rice in the Epigraphia Carnatica Vol. 9, Supplement, published in 1928. The inscription provides its date as \"saumya saṃvatsarada mārgaśira śuddha lū,\" which corresponds to Monday, 25 November 1669 CE.\nTransliteration and translation\nThe inscription consists of seven lines. The  transliteration of the text in Kannada and IAST, along with an English translation, is as follows.\n{| class=\"wikitable\"\n! Line\n! Kannada\n! IAST\n! English Translation\n|-\n| 1\n| ಸೌಮ್ಯ ಸಂವತ್ಸರದ ಮಾರ್ಗಶಿರ ಶುದ್ಧಲೂ\n| saumya saṃvatsarada mārgaśira śuddha lū\n| In the Saumya year, on the auspicious day of Margashira\n|-\n| 2\n| ಶ್ರೀಮತು ಮಲ್ಲಪುರದ ಮಲ್ಲಿಕಾರ್ಜುನ ದೇವರ ದೇವಮಾನ್ಯಕ್ಕೆ ಯೆಕೋಜಿರಾಯನ ಬೆಂಗಳೂರ\n| śrīmatu mallapurada mallikārjuna devara devamānyakkĕ yĕkojirāyana bĕṃgaḷūra\n|  The honorable Ekojiraya of Bengaluru, for the divine service of the revered Mallikarjuna of Mallapura,\n|-\n| 3\n| ಮಹನಾಡು ಕೇಳಲಿಕಾಗಿ ಮೆದರನಿಂಗನಹಳಿಯ ಧರ್ಮಕ್ಕೆ ಕೊಟ್ಟನು ಕೋಟಿ ಚಂದ್ರಸೂರ್ಯರು\n| mahanāḍu keḷalikāgi mĕdaraninganahaḷiya dharmakkĕ koṭṭanu koṭi candrasūryaru\n|  at the request of the people of Bengaluru, grants the village of Medaraninganahalli as a charitable offering, for as long as the sun and moon exist.\n|-\n| 4\n| ಉಳಕಾಲಉ ಧರ್ಮಕ್ಕೆ ಕೊಟನು ಯೀ ಧರ್ಮಕ್ಕೆ  ವಕ್ರ ಮಾಡಿದವರು ಕತ್ತಿಯ ಕಾಗಿಯ ಚಂಡಾಲರ ಜಲ್ಮ\n| ulakālaü dharmakkĕ koṭanu yī dharmakkĕ vakra māḍidavaru kattiya kāgiya caṃḍālara jalma\n| This charitable grant is made for perpetuity. Those who obstruct this charity will be reborn as donkeys, crows, or Chandalas.\n|-\n| 5\n| ದಲಿ ಹುಟ್ಟುವರು\n| dali huṭṭuvaru\n| (They will be born into these low forms).\n|-\n| 6\n| ಮುಸಾಲಮಾನರಾದವರು ಮಕೆಯಲಿ ಹಂದಿ ತಿಂದ ಬ್ರಾಹ್ಮಣ ಚೆತ್ರಿ ವೈಶ್ಯ ಸೂದ್ರ ಕಾಸಿಯಲಿ ಗೋವ\n| musālamānarādavaru makĕyali handi tinda brāhmaṇa cĕtri vaiśya sūdra kāsiyali gova\n| Muslims who dishonor this (grant) will bear the same sin as one who consumes pork in Mecca. Brahmanas, Kshatriyas, Vaishyas, and Shudras, in Kashi, who kill a cow\n|-\n| 7\n| ಕೊಂದ ಪಾಪಕ್ಕೆ ಹೋಗುವ\n| konda pāpakke hoguva\n| will incur the same sin.\n|}\nConservation\nPhysical conservation\nThe inscription stone, located at the Kadu Mallikarjuna temple in Malleshwaram, suffered damage from cement and paint splatters during construction work. In March 2021, conservation architect Yashaswini Sharma and Nilesh M Thakkar of Jeernodhar Conservators, in collaboration with Inscription Stones of Bengaluru, undertook pro bono cleaning and restoration.\nDigital conservation\nFollowing physical restoration, the Mythic Society's Bengaluru Inscriptions 3D Digital Conservation Project created a 3D scan of the inscription in 2021, ensuring its digital preservation and accessibility.\nThe lost village of Medaraninganahalli\nThe inscription records the donation of the village of Medaraninganahalli. However, this village no longer exists, as its lands were acquired for the construction of the Indian Institute of Science (IISc) campus. An 1854 map of Bengaluru indicates that Medaraninganahalli would have spanned the eastern part of the IISc campus, the staff colony of CPRI, and the area beyond New BEL Road into CPRI.\nThe name \"Medaraninganahalli\" is derived from three Kannada words:\n*  \"Medara\":  The name of a caste of bamboo weavers.\n*  \"Ninga\":  Likely a personal name.\n*  \"Halli\": Meaning \"village.\"\nThe Medara community is found in various parts of Karnataka, Telangana, and Tamil Nadu, particularly in the Shivamogga and Mysuru districts. They are skilled artisans who traditionally craft mats, baskets, ladders, and storage containers from bamboo.  They would have gathered bamboo from nearby forests to create these essential items.\nThe disappearance of Medaraninganahalli serves as a reminder of the constant evolution of landscapes and the impact of urbanization on traditional communities and settlements.\nThe Jakkarayanakere inscription\nMalleshwaram is also home to another inscription, known as the Jakkarayanakere inscription. This undated Kannada inscription is unfortunately incomplete, making it difficult to deduce its full meaning and context. However, the surviving text suggests it may record a donation or grant.\nThe inscription mentions \"Yalahanka Naad,\" a historical administrative division corresponding to present-day Yelahanka in North Bengaluru. This provides valuable geographical context for the inscription.\nIt was first documented in Epigraphia Carnatica Volume 9, where it is noted that the inscription was found in Jakkarayanakere, an area around the Krishna Flour Mill in Sampige Road, Malleshwaram. Unfortunately, the current location and physical condition of the inscription are unknown.\nTransliteration of the Jakkarayanakere inscription\nThe following is a transliteration of the surviving text, as published in Epigraphia Carnatica.\n{| class=\"wikitable\"\n! Line Number\n! Kannada\n! IAST\n|-\n| 1\n| ಶ್ರೀಮತುವಿಕಾರಿಸ\n| śrīmatuvikārisa\n|-\n| 2\n| Oವತ್ಸರದಜೇಷ್ಟಬ ೧\n| O vatsarada jēṣṭha ba 1\n|-\n| 3\n| ಸೋಯಾಲಹಂಕನಾಡ\n| sōyālahankanāḍa\n|-\n| 4\n| ಪ್ರಜಾ . . . . . .\n| prajā . . . . . .\n|-\n| 5\n| ಗೌಡುತನದಮುಂ\n| gauḍutanadamuṃ\n|-\n| 6\n| ವೀರ . . .ಬಮ\n| vīra . . .bama\n|-\n| 7\n| ಚಾಕಲಕನಲುಸಂಗ\n| cākalakanalusaṅga\n|-\n| 8\n| ನಕೊಡಗಿಮಾನ್ಯಂಮ\n| nakoḍagimānyamma\n|-\n| 9\n| ಡಿಯಿ. . .ಲುಸು\n| ḍiyi . . .lusu\n|-\n| 10\n| ಡು ಬೆಂಡ್ಯರ\n| ḍu beṇḍyara\n|-\n| 11\n| ಯಾವ . ತಮ್ಮನಾ\n| yāva . tammanā\n|-\n| 12\n| ಆಚಾರಿಕಾಮುಂಜಕ।\n| ācārikāmuṃjaka\n|-\n| 13\n| ಚನಪಾಂಡ . . .\n| canapāṇḍa . . .\n|}\nDespite its incomplete nature, the Jakkarayanakere inscription provides a glimpse into the historical landscape of Malleshwaram and raises intriguing questions about the activities and individuals mentioned in the text. Further research and potentially the rediscovery of the complete inscription could shed more light on this piece of Bengaluru's history.\nMedaraninganahalli Hero Stone (IISc Campus)\nA significant hero stone (Viragal) dating to the 10th century CE was discovered on the campus of the Indian Institute of Science (IISc) in the late 1970s. This location corresponds to the area of the former village of Medaraninganahalli, mentioned in the 1669 CE Ekoji I inscription.\nThe stone is a hulibete veeragallu, commemorating a hero who died fighting a tiger. Though partially damaged and lacking an inscription, the sculpture depicts the martyr holding a bow, about to shoot an arrow at an attacking tiger. Experts date it to the 10th century, likely during the rule of the Western Ganga dynasty over the Bengaluru region.\nThis hero stone is one of only three known hulibete (tiger hunt) stones found in Bengaluru, providing valuable evidence of the region's historical fauna and the societal practice of honouring acts of valor, particularly against dangerous wildlife. The presence of such stones highlights the dangers faced by inhabitants and the courage esteemed by the community.\nSignificance of Malleshwaram's Historical Artifacts\nThe Malleshwaram inscriptions, particularly the 1669 CE inscription of Ekoji I, hold significant historical and cultural value for understanding the development of Malleshwaram and the broader context of Bengaluru's past. These inscriptions provide valuable insights into:\n* Early History of Malleshwaram: The inscriptions confirm the existence of Malleshwaram, then known as Mallapura, as early as the 17th century. They offer a glimpse into the social, religious, and administrative practices of the time.\n* Maratha Presence in Bengaluru: The Ekoji I inscription provides concrete evidence of the Maratha administration and their influence in Bengaluru during the 17th century. It highlights their engagement in local governance, religious patronage, and land grants.\n* Religious and Cultural Practices: The inscriptions shed light on the religious landscape of the period, showcasing the coexistence of different faiths and the importance of temple donations and land grants in supporting religious institutions. The symbolic engravings of the sun, moon, and linga offer insights into cultural and religious beliefs.\n* Linguistic Evolution: The inscription's use of the Kannada language and script provides valuable data for understanding the evolution of the language and its use in official records.\n* Urban Development: The disappearance of Medaraninganahalli, the village mentioned in the Ekoji I inscription, highlights the impact of urbanization and the changing landscape of Bengaluru over time.\nThe Malleshwaram inscriptions, along with other inscription stones found in Bengaluru, serve as crucial historical records that contribute to a deeper understanding of the city's rich and complex past. They offer a tangible link to previousd eras, allowing us to trace the evolution of the region and appreciate the continuity of cultural and social practices across centuries.\nExternal links\nDigital images of the inscription and its individual characters, along with a summary and other information, are available through the [https://mythicsociety.github.io/AksharaBhandara/#/learn/Shasanagalu?id=115035 Akshara Bhandara software].\nSee also\n* This article provides an overview of the inscriptions found in Malleshwaram. For a comprehensive listing and interactive map of Bengaluru's inscription stones, please visit the Inscription Stones of Bengaluru Google Map website.\n* Inscription stones of Bengaluru\n* Dravidian style architecture\n* Maratha Empire\n* Ekoji/Vyankoji\nReferences"
    }
  ]
}