{
  "content": [
    {
      "type": "text",
      "text": "# Malleswara Shiva Temple\n\n| location = ChandrakonaPaschim Medinipur district\n| state = West Bengal\n| country   =\n| elevation_m =\n| year_completed = 18th century\n| architecture_type = Pancharatna\n| festivals =\n| deity =\n}}\nMalleswara Shiva Temple is a pancha-ratna temple, built in the 18th century at Chandrakona in Ghatal subdivision of Paschim Medinipur district in West Bengal, India.\nHistory\nThe Chandrakona area was once thickly forested. The earliest rulers of the area were the Ketu dynasty, who possibly ruled up to the 16th century, when they were overthrown by the Chouhan dynasty, also known as Bhan kings. They built several temples in and around Chandrakona. The last Bhan king, Mitrasen, died childless and Raghunath Singh of Bishnupur took over the kingdom. Subsequently, Kirtichandra of Burdwan defeated him and annexed the area. He built many temples in Chandrakona. It came under the rule of British East India Company in 1760.\nGeography\nThe Malleswara Shiva temple is located at .\nThe temple\nDavid J. McCutchion says that the pancha-ratna, along with the at-chala, is the most popular type of Bengal temple, “especially in 19th century Midnapore where it outnumbers all others,” The roof of a ratna temple “is surmounted by one or more towers or pinnacles called ratna (jewel). The simplest form has a single central tower (eka-ratna), to which may be added four more at the corners (pancha-ratna)”. The number of towers or pinnacles can be increased up to a maximum of twentyfive. The ratna style came up in the 15th-16th century. McCutchion classifies the Malleswara Shiva temple as a pancha-ratna with ridged rekha turrets and porch on triple archway. Built of laterite possibly in the 18th century, it has stucco figures and measures 26’ square.\nThere is another view point worth noting. The Malleswar Shiva temple is one of the oldest temples in Chandrakona. It was in all probability built in the 14th century and was renovated by Maharaja Tejchandra in 1831. The temple originally stood in a fortified compound. There was a double storied gateway and a plate detailed the renovation work done by Maharaja Tejchandra. The gate is in a dilapidated condition and the plate is missing. There was a natmandir till 2017, when it was pulled down by locals with the excuse of being in a bad shape and unsafe. The Jorbangla temple is just 500 m away.\nIt has a height of 60’.\nSee also - Other temples at Chandrakona: Chandrakona Jorbangla Temple, Shantinatha Shiva Temple, Parvatinatha Temple\nMalleswara Shiva temple picture gallery\nFile:Malleshwar Shiva Temple at Malleswarpur area of Chandrakona at Paschim Medinipur district 03.jpg\nFile:Malleshwar Shiva Temple at Malleswarpur area of Chandrakona at Paschim Medinipur district 09.jpg\nFile:Stucco work on Malleshwar Shiva Temple at Malleswarpur area of Chandrakona at Paschim Medinipur district 20.jpg\nFile:Stucco work on Malleshwar Shiva Temple at Malleswarpur area of Chandrakona at Paschim Medinipur district 03.jpg\nReferences\nExternal links"
    }
  ]
}