{
  "content": [
    {
      "type": "text",
      "text": "# Mamadou Diouf (historian)\n\n}}\n-->\n| birth_place        =\n| death_date         =\n| death_place        =\n| death_cause        =\n| nationality        =\n| citizenship        =\n| other_names        =\n| occupation         =\n| period             =\n| known_for          =\n| title              =\n| boards             =\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| relatives          =\n| awards             =\n| website            =\n| education          =\n| alma_mater         =\n| thesis_title       =\n| thesis_url         =\n| thesis_year        =\n| school_tradition   =\n| doctoral_advisor   =\n| academic_advisors  =\n| influences         =\n| era                =\n| discipline         =\n| sub_discipline     =\n| workplaces         = Columbia University\n| doctoral_students  =\n| notable_students   =\n| main_interests     =\n| notable_works      =\n| notable_ideas      =\n| influenced         =\n| signature          =\n| signature_alt      =\n| signature_size     =\n| footnotes          =\n}}\n2019, McEwan Hall, University of Edinburgh. On stage from the left Mamadou Diouf (Columbia University), Thomas Molony (University of Edinburgh), and Amanda Hammar (AEGIS president, Centre of African Studies, Copenhagen).]]\nMamadou Diouf is the Leitner Family Professor of African Studies, the Director of Institute for African Studies, and a professor of Western African history at Columbia University.\nHe also serves as director of the Institute of African Studies at the School of International and Public Affairs, Columbia University (SIPA) and has been instrumental in its recent reorganization. Diouf holds a Ph.D. in history from the University of Paris-Sorbonne. Before teaching at Columbia, he taught at the University of Michigan and at Cheikh Anta Diop University in Dakar, Senegal. Diouf also serves on the editorial board of several academic journals, including the Journal of African History, Psychopathologie Africaine, and Public Culture. His research interests include the urban, political, social, and intellectual history of colonial and postcolonial Africa. His most recent books are La Construction de l’Etat au Sénégal, written with M. C. Diop & D. Cruise O’Brien and published in 2002 and Histoire du Sénégal: Le modèle islamo-wolof et ses périphéries, published in 2001. He is currently editing Rhythms of the Atlantic World with Ifeoma Nwanko and New Perspectives on Islam in Senegal:  Conversion, Migration, Wealth, Power and Femininity with Mara Leichtman.\nPublications\n* Tolerance, Democracy, and Sufis in Senegal, ed. 2013\n* with Mara A. Leichtman: New Perspectives on Islam in Senegal. Conversion, Migration, Wealth, and Power, 2009\n* with M. C. Diop & D. Cruise O’Brien: La Construction de l’Etat au Sénégal, 2002\n* Histoire du Sénégal: Le Modèle Islamo-Wolof et ses Périphéries, 2001\n* with Ulbe Bosma:Histoires et Identités dans la Caraïbe. Trajectoires Plurielles, 2004\n* with R. Collignon: Les Jeunes, Hantise de l’espace public dans les sociétés du sud?, 2001\n* with M. C. Diop: Les figures du politique : Des pouvoirs hérités aux pouvoirs élus, 1999\n* ''L'Historiographie indienne en débat. Sur le nationalisme, le colonialisme et les sociétés postcoloniales, ed. 1999\n* with Mahmood Mamdani: Academic Freedom and Social Responsibility of the Intellectuals in Africa, 1994\n* with M.C. Diop: Le Sénégal sous Abdou Diouf, 1990\n* La Kajoor au XIXe siècle : Pouvoir Ceddo et Conquête Coloniale'', 1990\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}