{
  "content": [
    {
      "type": "text",
      "text": "# Manly-Warringah Radio Society\n\nThe Manly-Warringah Radio Society (MWRS) is an Amateur Radio enthusiast group serving the Northern Beaches and North Shore areas of Sydney, Australia. Operating under the call sign VK2MB the society boasts members from a wide range of backgrounds, with members ranging from retirees to school children.\nHistory\nThe Manly-Warringah Radio Society can trace its roots back to 1923, when it was formed as the Manly Radio Club, callsign 2YE and then VK2MR.\nInitially the society held meetings at the home of a club member in Fairlight until the club outgrew the premises and was forced to move to the garage of a club member in Condamine St Balgowlah. In 1935 a large house became available in Darley Rd Manly, which was used as the club house until it was partially destroyed in 1936. Following the destruction of the clubhouse in Manly the club had use of a Navy owned room near Manly Baths, and were able to string antennas between the roof of the building and nearby trees. This building was used until 1939 when the Navy required the space for training. Manly Radio Club was disbanded with the assets of the radio club being disbursed amongst the current members at the time.\nThe Society reformed in 1976, where it moved to various buildings around the Northern Beaches of Sydney as space became available; Hinkler Park North Manly, Harbord Diggers (meetings only), Warringah Mall, and the Society eventually settled in 1984 at the Volunteer Services Centre site in Terrey Hills where it remained until 2009 where once again it was forced to move, by SES expansion, to the Girl Guides Hall in Terrey Hills.\nClub meetings\nSociety meetings are held every Wednesday evening from 7.30 p.m. at the Terrey Hills Guides Hall, Beltana Avenue, Terrey Hills.\nVolunteer work\nThe society will often provide communications for sporting events and during times of natural disasters.  Notably, members of the Society helped operate the ground control station for Dick Smith's record-breaking hot-air balloon flight across Australia in 1993. The club hosts the annual Scouting JOTA jamboree radio activities and has regular Cub Scout evenings (by appointment); One of the many skills taught is using the NATO Phonetic Alphabet when making contacts on HF Radio.\nTraining and licensing\nThe Manly-Warringah Radio Society provides training and examination services to the amateur radio community on behalf of the Wireless Institute of Australia. One of the society's goals is to enable people to become licensed amateur radio operators by holding regular training and examination days at the clubhouse.\nInternational Lighthouse and Lightship Weekend\nEach year the Manly-Warringah Radio Society celebrate International Lighthouse and Lightship Weekend by activating an amateur radio station at the Barrenjoey lighthouse. The goal of the weekend is \"to promote public awareness of lighthouses and lightships and their need for preservation and restoration, to promote amateur radio and to foster International goodwill\". Over the course of the weekend some of the over 400 radio-active lighthouses around the world will be contacted from headland, usually on HF frequencies.\nRepeaters\nThe club owns and operates amateur radio repeaters on numerous frequencies and modes. On the 2 meter band the repeater can be operated on 146.875&nbsp;MHz FM output / 146.275&nbsp;MHz input while on 70&nbsp;cm the repeater can be operated on 438.175&nbsp;MHz FM output / 433.175&nbsp;MHz input using a 91.5&nbsp;Hz CTCSS tone, or in APCO P25 mode using the standard NAC of 0x293. For Digital mode D-STAR the society operates one of two Sydney repeaters, VK2RWN, is operational on 2m and 70&nbsp;cm.\nReferences\nExternal links\n* [http://www.mwrs.org.au Manly-Warringah Radio Society home page]"
    }
  ]
}