{
  "content": [
    {
      "type": "text",
      "text": "# Manning Award\n\n}}\nThe Manning Award has been presented annually since the 2004 football season to the collegiate American football quarterback as judged by the Sugar Bowl Committee to be the best in the United States. It is the only quarterback award that includes each candidate's postseason-bowl performance in its balloting.\nThe award is named in honor of former University of Mississippi (Ole Miss) quarterback Archie Manning and his quarterback sons Peyton and Eli. Archie was also the quarterback for the New Orleans Saints, Houston Oilers, and Minnesota Vikings of the National Football League (NFL). Peyton was a star quarterback at the University of Tennessee as well as with the Indianapolis Colts and Denver Broncos of the NFL. Eli was also a star quarterback at Ole Miss and was the quarterback of the NFL's New York Giants. Both Peyton and Eli were All-America selections during their college careers and both led their respective professional teams to 2 Super Bowl championships (Peyton with the Indianapolis Colts in Super Bowl XLI and with the Broncos in Super Bowl 50, and Eli with the New York Giants in Super Bowls XLII and XLVI). Both won the Super Bowl MVP award, Eli twice. Archie was inducted into the College Football Hall of Fame in 1989.\nEach of the award winners has gone on to be selected in the first round of the NFL draft, except Colt McCoy, who won the award following the 2009 season and was a third-round selection, and Stetson Bennett, who went in the 4th round. Deshaun Watson is the only player to win the award twice, for the 2015 and 2016 seasons.\nWinners\n{| class=\"wikitable\"\n!bgcolor=\"#e5e5e5\"| Season !! ! bgcolor=\"#e5e5e5\"| Player !! bgcolor=\"#e5e5e5\"| Team !! Ref.\n|-\n| 2004 || Matt Leinart || USC ||\n|-\n| 2005 || Vince Young || Texas ||\n|-\n| 2006 || JaMarcus Russell || LSU ||\n|-\n| 2007 || Matt Ryan || Boston College ||\n|-\n| 2008 || Tim Tebow || Florida ||\n|-\n| 2009 || Colt McCoy ||  Texas (2) ||\n|-\n| 2010 || Cam Newton || Auburn ||\n|-\n| 2011 || Robert Griffin III || Baylor ||\n|-\n| 2012 || Johnny Manziel || Texas A&M ||\n|-\n| 2013 || Jameis Winston || Florida State ||\n|-\n| 2014 || Marcus Mariota || Oregon ||\n|-\n| 2015 || Deshaun Watson || Clemson ||\n|-\n| 2016 || Deshaun Watson (2) || Clemson (2) ||\n|-\n| 2017 || Baker Mayfield || Oklahoma ||\n|-\n| 2018 || Kyler Murray || Oklahoma (2) ||\n|-\n| 2019 || Joe Burrow || LSU (2) ||\n|-\n| 2020 || Mac Jones || Alabama ||\n|-\n| 2021 || Bryce Young || Alabama (2) ||\n|-\n| 2022 || Stetson Bennett || Georgia ||\n|-\n| 2023 || Jayden Daniels || LSU (3) ||\n|-\n| 2024 || Cam Ward || Miami ||\n|}\nFootnotes\nExternal links\n*"
    }
  ]
}