{
  "content": [
    {
      "type": "text",
      "text": "# Māori Wardens\n\n| website           = [https://maoriwardens.nz/ maoriwardens.nz]\n}}\nThere are approximately 900 Māori Wardens (Ngā Wātene Māori o Aotearoa) in New Zealand. They are volunteers who provide community support through services such as security, traffic and crowd control, and first aid. Māori Wardens operate under the authority of the Māori Community Development Act 1962.\nFunctions and structure\nMāori Wardens have specific powers under the Māori Community Development Act 1962. These powers primarily relate to the management of alcohol-related behaviour. Under the Act, Māori Wardens are authorised to:\n* Warn a licensee to stop serving liquor to a Māori person,\n* Order any Māori person to leave a hotel,\n* Seize liquor at a Māori gathering or function,\n* Retain the car keys of an intoxicated person, where necessary to prevent danger.\nThe national body for Māori Wardens is a charitable trust, Ngā Wātene Māori o Aotearoa | Māori Wardens of New Zealand. The organisation is governed by a board of trustees made up of regional representatives. Its mission is to \"support and service our regional entities to provide support to our communities at all levels\". As of 2025, the chairperson is Linda Ngata.\nEach rohe (region) is represented by a regional entity. The six regional entities and their corresponding rohe are:\n* Ngā Purapura – Te Tai Tokerau, Tāmaki, Tāmaki ki te Tonga\n* Te Rohe Pōtae – Waikato, Hauraki, Maniapoto\n* Volcanic Interior Plateau/Central – Waiariki, Tauranga Moana, Mataatua, Aotea, Taranaki\n* Te Tairāwhiti\n* Te Piringa Manatopū – Tākitimu, Raukawa, Te Whanganui-a-Tara\n* Te Waipounamu – Te Tauihu, Te Waipounamu, Wharekauri/Rekohu\nEach regional entity works in collaboration with local agencies and community groups to promote and deliver Māori Warden services.\nMāori Wardens also operate internationally, particularly in Australia. In states such as Victoria, Queensland, New South Wales, and Western Australia, they provide support to Māori and Pacific Islander youth.\nHistory\nOrigins\nThe government formally recognised rūnanga in 1861 to provide for local Māori self-government. Māori Wardens (referred to as Kaitiaki) were subsequently appointed on the recommendation of these rūnanga.\nHowever, government involvement declined after the Invasion of the Waikato, and it was not until the passage of the Māori Social and Economic Advancement Act 1945 that tribal executives gained the authority to nominate and oversee Māori Wardens in their contemporary form. The establishment of the Māori Wardens system after 1945 was largely a response to both government and community concerns that Māori were perceived as unable to manage alcohol consumption responsibly.\nThe 1945 Act granted Māori Wardens \"powers of preventing drunkenness and of otherwise controlling the consumption of alcoholic liquor among Maoris\".\nWith the enactment of the Māori Community Development Act 1962, Section 7 of the Act formally placed the responsibility for appointing and overseeing Māori Wardens with District Māori Councils.\n21st century\nIn 2013, Te Puni Kōkiri held consultations on the future of Māori Wardens, presenting options for the organisation’s future administration and role. In July 2019, representatives at a national conference of Māori Wardens discussed ways to modernise the organisation, leading to the formation of a working group to consult with the government. Further discussions took place at the 2021 conference.\nDuring the COVID-19 pandemic in 2021, Māori Wardens worked alongside health authorities to encourage vaccination within local communities and provided support in welfare and border control efforts.\nResponses\nCriticism that Māori Wardens constitute a form of racial discrimination dates back as far as the 1960s. In 1997, the then chairman of the Māori Council, Sir Graham Latimer, expressed support for the 1962 Act, stating: \"Even though it is discriminatory, it is needed for our people.\" He argued that Māori Wardens had better relationships with Māori communities than the police did.\nIn 2011, New Zealand Police considered involving Māori Wardens in patrolling busy areas during the Rugby World Cup. Then Prime Minister John Key described the law as \"antiquated and outdated\" and said it appeared racist. He stated: \"At the end of the day, if someone's removed from a bar, it should be because they're underage or they're intoxicated. Ethnicity's got nothing to do with it.\" Māori Wardens responded by stating that they applied Māori values to support and protect people of all ethnicities.\nIn 2016, lawyer Graeme Edgeler described the Māori Community Development Act 1962 as New Zealand’s \"most racist law,\" and several politicians supported his call to repeal the legislation.\nReferences\nFurther reading\nFleras, A. (1981). [http://www.jstor.org/stable/20705600 Maori Wardens and the control of liquor among the Maori of New Zealand.] The Journal of the Polynesian Society, 90(4), 495–513.\nWaitangi Tribunal (2014). Aroha ki te Tangata / Service to the People. In [https://www.waitangitribunal.govt.nz/assets/Documents/Publications/WT-Report-on-the-Maori-Community-Development-act-Claim.pdf Whaia te Mana Motuhake In Pursuit of Mana Motuhake.] 253–299."
    }
  ]
}