{
  "content": [
    {
      "type": "text",
      "text": "# Mapoon, Queensland\n\n| pop                 = 469\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4874\n| area                = 6578.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 88.2\n| dir1                = N\n| location1           = Weipa\n| dist2               = 733\n| dir2                = NW\n| location2           = Cooktown\n| dist3               = 902\n| dir3                = NW\n| location3           = Cairns\n| dist4               = 2556\n| dir4                = NW\n| location4           = Brisbane\n| lga                 = Aboriginal Shire of Mapoon\n| lga2                = Shire of Cook\n| stategov            = Cook\n| fedgov              = Leichhardt\n| maxtemp             =\n| mintemp             =\n| rainfall            =\n| est                 =\n| near-n              = Injinoo\n| near-ne             = Jardine River\n| near-e              = Shelburne\n| near-se             = Wenlock\n| near-s              = Mission River\n| near-sw             = Mission River\n| near-w              = Gulf of Carpentaria\n| near-nw             = Gulf of Carpentaria\n}}\nMapoon is a coastal town in the Aboriginal Shire of Mapoon and a locality split between the Aboriginal Shire of Mapoon and the Shire of Cook in Queensland, Australia. In the , the locality of Mapoon had a population of 469 people.\nHistory\nPre-European settlement\nTeppathiggi (also known Tepithiki and Teyepathiggi) is an Australian Aboriginal language of the Western Cape York Peninsula, Middle Dulcie River, Lower Batavia River, Ducie River, and Mapoon. The language region includes areas within the local government boundaries of Cook Shire Council.\nUradhi (also known as Anggamudi, Ankamuti, Atampaya, Bawtjathi, and Lotiga) is an Australian Aboriginal language of the Western Cape York Peninsula. The traditional language region includes north of Mapoon and Duyfken Point and east of the coast strip to the north of Port Musgrave (Angkamuthi country) incorporating the mouth of the Ducie River, the lower reaches of the Dulhunty River and the upper reaches of the Skardon River in the north. Following the displacement of Indigenous people by British settlement, it was also spoken in the Northern Peninsula Area Region including the communities of New Mapoon, Injinoo and Cowal Creek.\n1891: Mission\nIn 1891 the Moravian Church established a mission at Mapoon with the aim of providing education and health services to the Aboriginal people. It was their first mission in Cape York Peninsula and they established it at the request of the Presbyterian Church.\n1950–2000\nIn the 1950s when bauxite was discovered on the Western Cape area, the Queensland Government  passed legislation to help the interested companies Comalco and Alcan  with the 'Comalco Act' (Commonwealth Aluminium Corporation Pty Ltd Agreement Act 1957 (Qld)). As a consequence some  were excised from the mission reserve. The government, together with Comalco determined to evict the residents off the mission, and they were moved forcibly by the Queensland police from Old Mapoon to New Mapoon on 15 November 1963. The closing of the Mission was explained publicly as a measure to 'rationalise services' for the Cape indigenous people by centralising them in the Bamaga area. In November 1963, people were forced from their homes by armed police.  They were then transported  by ship.  The police raid was ordered and overseen by Patrick Killoran, the then-director of Aboriginal Affairs in Queensland. Aboriginal residents' houses were burnt to the ground in 1963 by Queensland Police.\nMany residents were unhappy at Bamaga, at one of the nearby communities now known as New Mapoon. Over the following years, many moved back to (Old) Mapoon and eventually the government provided new housing. Mapoon became known as one of the places involved in the fight for Indigenous land rights in the 1970s, and seven families had moved back by 1975. The Black Resource Centre in Melbourne, led by Cheryl Buchanan, was involved, and she also took Lionel Fogarty to meet the displaced residents.\nMapoon State School opened on 30 January 1995.  On 1 January 2002, it became the Mapoon campus of Western Cape College.\n21st century\nIn 2000, the Mapoon Aboriginal community was formally recognised under Deed of Grant in Trust arrangements. The Mapoon Aboriginal Council administers the community affairs with government support.\nDemographics\nIn the , the locality of Mapoon had a population of 239.\nIn the , the town of Mapoon recorded a population of 263 and 90% of the town's population was of Aboriginal or Torres Strait Islander descent.\nIn the , the locality of Mapoon had a population of 317 people.\nIn the , the locality of Mapoon had a population of 469 people and 75.3% was of Aboriginal and/or Torres Strait Islander background.\nGeography\nMapoon is on the western side of Cape York Peninsula in Far North Queensland, Australia.\nThe town of Mapoon is on a peninsula that extends into the Gulf of Carpentaria with Cullen Point (also known as Tullanaringa Point) at its tip (), creating a side bay of the Gulf called Port Musgrave (), which is probably named after Sir Anthony Musgrave, the Queensland Governor from 1883 to 1888. Ducie River () and Wenlock River () flow though the locality into Port Musgrave.\nRed Beach is a sandy strip facing Port Musgrave adjacent to the south side of the town (). The government-built housing is spread out in bushland along Red Beach Road towards Cullen Point.\nFlying Fox Island is a  marine island () in the west of Port Musgrave close to the coastline north of the town.\nDuring the wet season from December to April the town is largely inaccessible except by air and sea.\nThere is an airstrip  south of the town ().\nThe Alcan Weipa mining lease covers  of the locality of Mapoon. It is a bauxite mine. It includes the Myerfield Strip, an aircraft landing strip (). The name Myerfield was proposed by Alcan Pty Ltd, which had built the airstrip.\nClimate\nMapoon experiences a tropical savanna climate (Köppen: Aw, Trewartha: Awha), with hot conditions year-round. There is a shorter wet season from mid-November to April, and a longer dry season from May to mid-November.\n}}\nEducation\nWestern Cape College is a primary (Early Childhood-6) school headquartered at Rocky Point, Weipa. Its campus in Mapoon is at 44 Clermont Street ().\nFacilities\nPresently the town has a primary school, nursing station, council office and small shop providing fuel and food.  Local people are employed on the Council which as well as providing services for the local community in 2006 won the contract to provide road maintenance for the all-weather  dirt road from the town of Weipa.\nIn cooperation between the council and the State Library of Queensland, the new Mapoon Indigenous Knowledge Centre (IKC) was opened on Thursday, 18 August 2022, within the new Mapoon Cultural Centre.  The IKC includes computers and a library connection.\nThe Port of Skardon River was declared in February 2002. It has a barge ramp and is used for the export of bauxite. It is managed the Queensland Government-owned corporation Ports North. The port is approximately  upstream from the mouth of the Skardon River into the Gulf of Carpentaria ().\nAttractions\nCamping facilities near the town are found at Cullen Point and Janie Creek.\nAlcohol management plan\nAn alcohol management plan (AMP) exists in the community, with restrictions on the amount and type of liquor that may be carried on persons or vehicles in the area.\nReferences\nSources\n*\nExternal links\n*\n*\n*\n*[https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/dls06p/alma99294483402061 Mapoon oral histories 1992-2014], State Library of Queensland\n*[https://www.slq.qld.gov.au/blog/mapoon-ideas-box-ikc Mapoon: from Ideas Box to IKC], State Library of Queensland blog\n*[https://www.slq.qld.gov.au/blog/new-mapoon-ikc-making-history New Mapoon IKC: Making history], State Library of Queensland blog"
    }
  ]
}