{
  "content": [
    {
      "type": "text",
      "text": "# Mar's Wark\n\n|map_size=\n|built= 1572\n|built_for= John Erskine, Earl of Mar\n|architect=\n| designation2 = scheduled monument\n| designation2_date = 31 December 1921\n| designation2_number =\n}}\n'''Mar's Wark' is a ruined building in Stirling built 1570–1572 by John Erskine, Regent of Scotland and Earl of Mar, and now in the care of Historic Scotland. Mar intended the building for the principal residence of the Erskine family in Stirling, whose chief had become hereditary keeper of the nearby royal Stirling Castle where the princes of Scotland were schooled. Wark is a Scots language word for work, and here it means building''. The house is also called \"Mar's Lodging.\"\nDescription\nThe building fronts the kirk yard of the Holy Rude Church and sits at the head of the processional route to Stirling Castle above the town's tollbooth. The windowless front façade survives lacking its upper storey, access is possible to the first floor. The basement vaults have doors and windows to the street and may have been intended for shops.\nThe façade is nearly symmetrical around a gatehouse frontispiece with two polygonal towers. Liberal carved stone decoration is based on European print-sources or decorative arts with royal and Erskine heraldry, and wry inscriptions. A motif of the letter \"A\" with the earl's coronet points to a variant version of the family name, as \"Areskine,\" or possibly the initial of Mar's countess, Annabella Murray. Traditionally it has been alleged that the carvings include stones re-cycled from Cambuskenneth Abbey.\nThe general articulation and architectural mouldings closely reflect royal buildings, especially the palace at Stirling Castle. The Earl of Mar may well have called upon the skills of the royal Master of Work to the Crown of Scotland of the time, William MacDowall.\nThe Wark is now protected by the Scottish Government as a scheduled monument.\nInscriptions\nThe middle Scots inscriptions carved on the gatehouse centrepiece refer to the onlooker's appreciation of the architecture and the eminence of the Regent himself in the building's own voice:\nSouth tower I PRAY AL LVIKARIS ON THIS LVGINGVITH GENTILE E TO GIF THAIR IVGINGI pray all lookers on this lodging,With gentle eye to give their judging.North towerTHE MOIR I STAND ON OPPIN HITHTMY FAVLTIS MOIR SVBIECT AR TO SITHTThe more I stand on open height,My faults more subject are to sight.Internal (exit) archESSPY SPEIK FVRTH AND SPAIR NOTHTCONSIDDIR VEIL I CAIR NOTHTSee, speak forth and spare not,Consider well, I care not.\nHistory\nIt is often said that the building was never finished, but there is little evidence for this, although it was probably unfinished at the death of Regent Mar in October 1572. Datestones give the years 1570 and 1572.\nThe records of Stirling burgh suggest that his widow Countess Annabella continued to use the building. In April 1584 supporters of the Earl of Angus were ordered to surrender the castle and the town gates of Stirling with the \"lodging of Annabell, Countess of Mar, and other places of fortification.\" The captive Earl of Gowrie was brought to the \"Lady Marrs House\" for his trial in May 1584.\nIn December 1593 Anne of Denmark, pregnant with Prince Henry, came to Stirling and was first lodged in the Earl of Argyll's house, then Lady Mar's lodging until her rooms in castle were ready. In May 1595 a banquet for the marriage of the king's mistress Anne Murray and Lord Glamis was to be held at the Countess of Mar's new house in Stirling. In 1602 a French ambassador, the Baron de Tour came to Stirling and had a talk with the Countess in \"Lady Mar's House\".\nAs the lodging commands Broad Street and the town it was later used to mount artillery during civil unrest. The building seems to be mentioned in this context in May 1578, when there was a discussion about holding a parliament in the tolbooth, and copies of documents refer to \"Lady Maries House\", possibly meaning \"Lady Mar's House\".\nReferences\nFurther reading\n* Chris Tabraham, ''Argyll's Lodging & Mar's Wark'' Historic Scotland (2002). .\n* [http://ads.ahds.ac.uk/catalogue/adsdata/arch-352-1/dissemination/pdf/vol_039/39_153_171.pdf Fleming, J. S., 'Regent Mar's Ludging,' in PSAS, (January 1905), pp.153-172] line drawings of sculpture and details of inscriptions.\nExternal links\n*\n* Historic Environment Scotland: [https://www.historicenvironment.scot/visit-a-place/places/mars-wark/ Visitor guide]\n* [http://www.scotlandsplaces.gov.uk/search_item/index.php?service=RCAHMS&id=46198 Mar's Wark], Scotland's Places"
    }
  ]
}