{
  "content": [
    {
      "type": "text",
      "text": "# Marcia Howard (musician)\n\n| birth_place     = Warrnambool, Victoria, Australia\n| origin          = Dennington, Victoria, Australia\n| death_date      =\n| death_place     =\n| genre           =\n| occupation      =\n| instrument      =\n| years_active    = 1980–present\n| label           = MGM Distribution\n| associated_acts = * Goanna\n* Shane Howard Band\n* Mary Black\n| website         =\n}}\nMarcia Louise Howard (born 5 January 1961) is an Australian multi-instrumentalist, singer-songwriter, academic, and music educator. She was a long-term member of folk-rock group, Goanna (1980–85, 1986, 1998) on vocals and keyboards. Howard has released five solo albums to date and was a contestant on The Voice (Australia season 5) in 2016.\nBiography\n1961-1979: Early years\nMarcia Louise Howard, was born in 1961 and raised in the rural town of Dennington ( north west of Warrnambool) to Leo Francis Howard (April 1916–February 2010) and Honora \"Teresa\" nee Madden (c. 1924–2014), with five brothers, Eric, Stephen, Shane, Brendan and Damian, and her sister, Adele. Leo worked at the Nestle's factory, which manufactured coffee and powdered milk; Teresa was a radio announcer, secretary, actress, pianist and singer. Howard later recalled, \"We were known as 'The Von Trapp Family of the Western District', because we played and sang at everyone's weddings, parties, kitchen teas, celebrations. Mum on piano and all of us singing, you know, Mary Poppins songs, Sound of Music.\" She was educated at St John's  Dennington Primary School, St Anne's (later incorporated into Emmanuel College), Warrnambool; she relocated first to Melbourne to Australian Catholic University, to complete a Diploma of Education (Music) in 1981.\n1980-1999: Goanna and backing vocals\nHoward, on backing vocals and keyboards, joined her older brother, Shane's folk-rock band, Goanna, in Melbourne in 1980. Goanna broke up in 1986 and Howard continued with her brother's projects, Shane Howard and Friends (1986) and then Shane Howard Band (1987–88, 1991). She worked on Shane's early solo albums and toured in his backing bands. Howard was a session musician on Wayne Gillespie's album [https://www.discogs.com/release/3149421-Wayne-Gillespie-New-Locations New Locations] (1986), Joe Geia's (ex-Shane Howard and Friends, Shane Howard Band) debut album, Yil Lull (1988), which includes the title track. She later worked on Kavisha Mazzella's album, ''Fisherman's Daughter'' (1998) and Dave Steel's The Edge of the World (May 1999) before working on former Goanna band-mate, Rose Bygrave's debut solo album, White Bird (mid-1999).\nMarcia traveled to Asia and Europe and sang and worked overseas for a year in 1990. When she returned in 1991 she took up her first music teaching position at John Pujajankgka Pirin school in Mulan, Western Australia in the Great Sandy Desert. She married in 1992 and moved to Port Fairy. She worked with her brother Damian Howard in the 1990s, performing live and recording with him on his solo albums while raising her two children and running a Bed and Breakfast, Hanley House with her (now ex-husband) James Gubbins in Port Fairy.\n2000-present: solo career\nHoward's debut solo album, Butterfly, was released in 2000. For the recording she played Maton guitars, keyboards and provided lead vocals. In the studio she was joined by Patricia Clarke and Shane Howard on backing vocals and Archie Cuthbertson on drums and percussion for the first recording of the Gunditjmara lullaby, \"Vulla Vunnah Nah\". She followed with her second album, Burning in the Rain, in March 2004. It was recorded over two years, during four trips to her family's ancestral home of Ireland. Produced by Steve Cooney the album featured Tim O'Brien, Mary Black, Maria Doyle Kennedy, Kevin Bourke and Laiose Kelly. Marcia had opened for Mary Black at the Olympia Theatre in Dublin for over five nights in 2002. While in that country she had recorded, \"Poison Tree\", as a duet with Irish folk singer, Mary Black. Howard wrote it based on a poem, \"A Poison Tree, by William Blake; it appeared on a various artists compilation album, ''A Woman's Heart – A Decade On (2002). Mary Black Orchestrated (2020). In 2008 Marcia toured with her brother Damian Howard and his band the Ploughboys performing their co-written show, From Ireland to Island at theatres and venues in Denmark, Ireland, and the UK.\nIn 2009, Marcia was invited to complete her Master of Education Thesis at Monash University Gippsland as a part of the Koori Cohort. She completed her thesis, Holy Wells to Waterholes: belonging through song in 2014. During her study as a member of the cohort, she performed with Canadian Indian elders, Kutcha Edwards, Robbie Bundle, Monica Weightman and Dr. Herb Patten at the WICPE Conference at Rod Laver Arena in 2009 and recorded the album Gulpa Ngawal'', engineered by Anthony Norris at RMIT studios in Melbourne, produced by Dr. Laura Brearley, Monash University and RMIT.\nHoward's third album, Pearl was released in 2011 with Bygrave. The recording began in late 2009: each wrote five tracks. By that time Howard had moved from Barwon Heads to Warrnambool, to look after her elderly parents. Dave Dawson of Nu Country reviewed the album and observed, \"[they] recorded [it] at home studios in Queenscliff and Warrnambool with [Jon] Emry's drums added by Lost in Suburbia bassist Peter Bird at his Yelp studio in Howard's hometown. Bassist Isaac Barter and previous producer Steve Cooney plays guitar on the disc... It's an organic reflection of the journey of two sisters in song from their rural roots to national fame and back to where it all started – country-folk music stripped down to bare essentials. Pure vocals, perfect enunciation, and impeccable harmonies ensure these homespun homilies and modern messages are massaged as they meet on high at the pass.\"\nDuring 2015 she travelled to Nashville and recorded four tracks for an extended play, Nashville Sessions which was released in June 2016.\nIn 2016, She was a contestant for Season 5 of The Voice (Australia). According to Howard, \"My nephew William encouraged me to go on the show when I came back from a year overseas in 2015 after recording my EP in Nashville. I was hesitant at first but it turned out to be a worthwhile musical experience. A fabulous band, musical and production team to work with. It was an interesting experience for me as a musician and songwriter being able to just focus on my singing and singing other peoples' songs in an interesting way was a professional challenge for me. It was lovely to meet the other singers on the show and sing with them backstage.\"\nIn October 2017 she released the album, Everything Reminds Me, and was joined in the studio by Issac Barter, Lee Morgan on guitar, Justin Olsson on drums, Matiss Schubert on mandolin and fiddle, and Richard Tankard on keyboards. When not touring or recording, Howard is an academic and works as a music and performing arts teacher/lecturer; she has taught in primary, secondary and tertiary institutions. In 2018 Marcia wrote the show, House of Song with Sherri McIver and Ian Roberts and toured Australia performing the theatre show at festivals and theatres with her musicians, Liam Gubbins (her son) and Matiss Schubert. Marcia is currently completing her Ph.D. in Creative Arts and Communication at Deakin University about her life as a musician in the Australian music industry over the past four decades. Her new album will be released later this year produced by Liam Gubbins (Gubmusic).\nDiscography\nAlbums\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|-\n! Title\n! Details\n|-\n! scope=\"row\"| Butterfly\n|\n* Release date: 2000\n* Label: Marcia Howard Music (MH 001)\n* Formats: CD\n|-\n! scope=\"row\"| Burning in the Rain\n|\n* Release date: 2004\n* Label: Marcia Howard Music (MH002)\n* Formats: CD\n|-\n! scope=\"row\"| Pearl (with Rose Bygrave)\n|\n* Release date: February 2011\n* Label: Pearl (P001)\n* Formats: CD, DD\n|-\n! scope=\"row\"| Everything Reminds Me\n|\n* Release date: 6 October 2017\n* Label: Marcia Howard Music (MH 004)\n* Formats: CD, DD\n|}\nExtended plays\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|-\n! Title\n! Details\n|-\n! scope=\"row\"| Nashville Sessions\n|\n* Release date: June 2016\n* Label: Marcia Howard Music (MH 003)\n* Formats: CD\n|}\nReferences\nNote: For additional work user may have to select 'Search again' and then 'Enter a title:' &/or 'Performer:'\nHoly Wells to Waterholes: belonging through song. Marcia Howard MEd thesis. Monash University.\nhttps://bridges.monash.edu/articles/Holy_wells_to_waterholes_belonging_through_song/4679674\nhttps://www.marciahoward.com.au\nhttps://www.banffcentre.ca/sites/default/files/Lougheed%20Leadership/Research/Indigenous/4_Chapter_3.pdf\nhttps://trove.nla.gov.au/work/38535465?q&versionId=51081819+172607428\n}}\nExternal links\n*  archived from [http://www.marciahoward.com.au/ the original] on 3 September 2018, retrieved on 20 January 2019."
    }
  ]
}