{
  "content": [
    {
      "type": "text",
      "text": "# Mardigian Museum of Armenian Art and Culture\n\n| established     =\n| location        = Armenian Quarter, Old City of Jerusalem, East Jerusalem\n| image           =  Jerusalem-Armenian-Museum-343.jpg\n| image_upright   = 0.7\n| type            = History museum, Art museum\n| website         =\n}}\nThe Helen and Edward Mardigian Armenian Museum of Jerusalem, known before its 2023 reopening as the Mardigian Museum of Armenian Art and Culture (), is a museum in the Armenian Quarter of the Old City of Jerusalem. Dedicated to preserving and showcasing Armenian heritage, the museum highlights the historical, artistic, and cultural contributions of Armenians, with a particular focus on their centuries-long presence in the Holy Land.\nHistory\nThe museum is housed within the complex of the Armenian Patriarchate of Jerusalem, one of the oldest Armenian Christian institutions in the world. The museum was officially established in 1969, funded by a generous donation from the Edward and Helen Mardigian family, a prominent Armenian-American philanthropic family known for supporting cultural and educational initiatives. It is located in a 200-year-old building that once housed the Armenian Patriarchate's Theological Seminary. Closed over many years, it reopened in 2022.\nArmenians have had a presence in Jerusalem since at least the 4th century A.D., when Armenia became the first nation to adopt Christianity as a state religion. The museum aims to celebrate this enduring legacy and strengthen ties between the Armenian community in Jerusalem and the global Armenian diaspora.\nCollections\nThe Mardigian Museum’s collections feature a diverse array of artifacts and artworks, including:\n*Printing press: replica of Gutenberg’s original printing press, believed to be the first such machine used in Jerusalem\n*Mosaic floor: an Armenian mosaic discovered in 1894 in the Musrara neighborhood of Jerusalem\n*Ceramics: Armenian ceramics in Jerusalem, such as tiles and pottery, which reflect the traditions of Armenian artisans in Jerusalem, particularly during the Ottoman era.\n*Manuscripts: Illuminated manuscripts from the Middle Ages, such as from Toros Roslin.\n*Religious artifacts: Crosses, chalices, and other liturgical items used in Armenian Christian worship from the treasury of the Armenian Patriarchate of Jerusalem and from other sources.\n*Historical documents: Records illustrating the Armenian community's role in the history of Jerusalem and the broader region, such as from Salah al-Din al-Ayyubi.\n*Armenian Genocide: A special section is devoted to the 1915 Armenian Genocide.\n*Photography and modern art: 19th- and 20th-century photographs documenting the Armenian presence in Jerusalem, as well as modern works by Armenian artists.\nKey people\nAmong the first curators of the museum where three renowned French Armenians, who curated the exhibitions of the new museum in 2022:\n*Claude Mutafian, mathematician and medieval Armenian historian;\n*Harout Bezdjian, producer and former head of the audiovisual division at the Centre Pompidou in Paris; and\n*Raymond Kevorkian, historian and leading scholar of the Armenian Genocide.\nArchitecture\nThe museum is housed in a historic building within the Armenian Patriarchate compound. The architecture combines traditional Armenian and local Levantine styles, characterized by thick stone walls, vaulted ceilings, and intricate geometric carvings. The layout of the museum is designed to harmonize with the monastic atmosphere of the surrounding St. James Monastery. A new roofing of the inner courtyard was added by French team specialized in museum design, since this opening is often prone to flooding in rainy weather.\nLocation and accessibility\nThe museum is located within the Armenian Quarter of the Old City of Jerusalem, near the St. James Cathedral. It offers informational materials in multiple languages, including English, Hebrew, French, Arabic or Armenian. Since the November 2022 reopening, visitors enter through a gate from Armenian Patriarchate Road across from the parking lot. Guided tours are available upon request. It is open on Tuesday through Saturday between 9-16 o'clock.\nSee also\n*Armenian Quarter\n*Cathedral of Saint James\n*Armenian Genocide Museum-Institute\nReferences\nExternal links\n* [http://armenian-jerusalem.org/museum.htm Museum's official website]\n* [http://www.armeniapedia.org/wiki/Mardigian_Museum_of_Armenian_Art_and_History armeniapedia.org: \"Mardigian Museum of Armenian Art and History\"]"
    }
  ]
}