{
  "content": [
    {
      "type": "text",
      "text": "# Marek Szwarc\n\n| birth_place = Zgierz, near Łódź, Poland\n| death_date =\n| death_place = Paris\n| nationality = Polish, later French\n| movement = School of Paris, Yung-yidish\n| website = http://marekszwarc.com/\n}}\nMarek Szwarc (9 May 1892 – 28 December 1958) was a painter and sculptor associated with the School of Paris (École de Paris), as well as with the Yiddish cultural avant-garde movement in Poland Yung-yidish.\nEarly years\nMarek Szwarc was born in Zgierz, Poland, on 9 May 1892, the youngest of ten sons. His eldest brother was Polish-Portuguese mining engineer and historian Samuel Schwarz. Their father Isucher Moshe Szwarc (1859–1939) was an Orthodox Jew heavily involved in Zgierz's Jewish community and the late Haskalah movement. Isucher was a fervent Zionist, participating in the First Zionist Congress and subsequent congresses.\nFrom 1910 to 1914, Marek lived and studied art at the École des Beaux Arts in Paris. He boarded at la Ruche together with Soutine, Marc Chagall, Modigliani and Kremegne, and together with Tchaikov and Lichtenstein inaugurated the first Jewish art journal Makhmadim (Precious Ones). In 1913 he exhibited his first sculpture, Eve, in the Salon d'Automne.\nBetween 1914 and 1917, Szwarc traveled through the Russian Empire, spending time in Odessa and Kiev, and working in the Jewish literary circle of Mendele Mocher Sforim, Ahad Ha'am, and Hayim Nahman Bialik. In 1918 he founded – together with Moishe Broderzon and a group of visual artists centered around Yitskhok Broyner and Yankl Adler – the Yung-yidish, the first Yiddish artistic avant-garde group in Poland.\nDuring the First World War Szwarc returned to Poland. In 1919 he met and married his wife, Guina, a writer, and together they returned to Paris after the war. Until the Second World War, Szwarc lived in Paris and his paintings and sculptures were bought by collectors in Germany, Poland, the United States, and by several museums. It was during this period between the wars that he produced some of his most outstanding and original work in hammered copper, exhibited in the Salon des Tuileries and the subject of a monograph by the celebrated art critic Louis Vauxcelles. Vauxcelles writes of Szwarc:\n\"By virtue of its poetic concepts, by its firm and generous execution, by the sense of its cadenced dispositions, by the sharp graphics written in view of the material and which commands this very material, it is apparent that Marek Szwarc is in harmony with the most audacious innovators of our times, who seek him out and see him as a maître\".In 1922 to 1923 Szwarc contributed to the Berlin and Warsaw based avant-garde Yiddish Journal Albatros (אלבאַטראָס), edited by poet and publicist Uri Zvi Greenberg.\nSzwarc participated in the important 1922 Düsseldorf Congress of the International Union of Progressive Artists, where signed its founding proclamation alongside Jankel Adler, and Stanislaw Kubicki, as representatives of the Polish Avant-Garde.\nSzwarc exhibited in numerous leading galleries, including Israel Ber Neumann's New Art Circle Gallery in New York, in 1926, Fritz Gurlitt in Berlin, Lilla Gallery, Stockholm, and Ludwig Schames in Frankfurt.\nIn 1929, the distinguished critic and novelist Ludwig Lewinsohn described Szwarc as an \"interesting phenomenon in the history of civilization\" writing that his \"profound and instinctive Jewishness will in the long run broaden and not narrow the appeal of his arresting and vital work\".\nLater years\nWhen Poland fell in 1939, Szwarc volunteered for the Polish army in exile and after the occupation of France he escaped with the Polish army to Scotland, while his family fled via Lisbon to England. It was during this period (1940–1943) that he drew a series of pen and ink drawings depicting the daily life of his fellow soldiers.\nAfter the war he returned to Paris with his wife and daughter, Tereska Torrès who had served in the Free French Forces of General Charles de Gaulle in London. She published two books dealing in large part with the life of her father. After the war Marek Szwarc devoted most of his time to sculpting in stone and wood and casting in bronze. Some of these works have been donated to the Musée d'Art et d'Histoire du Judaïsme in Paris.\nDeath\nMarek Szwarc died suddenly at the age of 66, in Paris. His wife, Guina died in Paris in 1973. In 2010 the French publishing house ressouvenances.fr brought out an edition of Szwarc's memoirs, which he dictated to his wife Eugenia (Guina) Markowa in 1954 titled Marek Szwarc: Memoires entre deux mondes.\nWorks and exhibitions\nSzwarc's work, broadly identified in style with the École de Paris, was frequently but not exclusively concerned with biblical themes from the Old and New Testament. The latter motifs coming into play after his conversion to Catholicism in 1919. His identity as a Jew, however, never wavered, as is evidenced in his article, The National Element in Jewish Art, published in a Yiddish literary journal in Warsaw in 1925.\nHe exhibited in Sweden, Austria, France, Canada, Belgium, Poland, and several sculptures were bought by the French government.\nThe artist's works are on display in museums, public halls, places of worship, and private collections in Poland, Israel, Montreal, Caracas, the United States, and England.\nSee also\n*Tereska Torrès\n*Gabriel Levin\nReferences\nExternal links\n*\n*[https://web.archive.org/web/20100121062446/http://www.ecoledeparis.org/artists/view/marek_szwarc Nadine Nieszawer, Ecole de Paris]\n*[https://archive.org/stream/ottoschneid10_15#page/n0/mode/2up Otto Schneid papers, correspondence with Marek Szwarc and essays by Schneid and Ludwig Lewisohn.]\n*[http://art.rmngp.fr/fr/library/artworks?authors=Marek%20Szwarc Works by Marek Szwarc in the collection of the Musee d'art et d'Histoire du Judaisme in Paris.]"
    }
  ]
}