{
  "content": [
    {
      "type": "text",
      "text": "# Margaret of Burgundy, Queen of France\n\n|issue=Joan II of Navarre\n|house=Burgundy\n|father=Robert II, Duke of Burgundy\n|mother=Agnes of France\n|birth_date= 1290\n|birth_place=\n|death_date= 30 April\n|death_place= Château Gaillard, Normandy\n|burial_place=\n|}}\nMargaret of Burgundy (; 1290 – 30 April 1315) was Queen of France and Navarre as the first wife of King Louis X; however, she was locked in prison during her whole French queenship.\nLife\nMargaret was born in 1290. She was the second daughter of Robert II, Duke of Burgundy (1248–1306) and Agnes of France (1260–1327), the youngest daughter of Louis IX of France and Margaret of Provence. As such, she was a member of House of Burgundy, a branch of the Capetian dynasty.\nIn 1305, Margaret married her first cousin once removed, Louis, who had inherited the crown of Navarre from his deceased mother, Queen Joan I. They had one daughter, Joan (born 1312, died 1349).\nEarly in 1314, Margaret was caught in an alleged act of adultery in the Tour de Nesle affair. Her sister-in-law Isabella of France was a witness against her, and Margaret was imprisoned at Château Gaillard along with her sister-in-law Blanche of Burgundy.\nIn November of the same year, Louis I of Navarre ascended the French throne as Louis X of France, thus Margaret became Queen of France. However, she remained confined, as Louis would not revoke her punishment for adultery, nor have her crowned as a queen consort. Without an incumbent pope, Louis had no means of annulling his marriage. After poor treatment in prison, Queen Margaret caught a cold and died in 1315, although another source states that she was strangled to death.\nLegacy\nMargaret's daughter, Joan, later became queen regnant of Navarre as Joan II (1311–1349). Her paternity was under doubt because of her mother's alleged adultery. On his deathbed, Louis formally recognized Joan as his daughter.\nIn 1361, Margaret's succession rights became important in the premature death of Philip I, Duke of Burgundy (her grandnephew), since the closest Burgundian heirs were descendants of Margaret and of her sister, Joan the Lame. Margaret's grandson and heir Charles II of Navarre claimed the duchy on the basis of primogeniture, but Joan the Lame's son John II of France on the basis of proximity, being one generation closer to the Burgundian dukes. As king, John ruled in his own favor and became Duke of Burgundy, later bestowing the Duchy upon his son, Philip the Bold.\nIn fiction\nMargaret is portrayed in Le Roi de Fer and La Reine Étranglée, two 1955 novels in Maurice Druon's Les Rois Maudits (The Accursed Kings) series of historical novels. She was played by  in the 1972 French miniseries adaptation of the series, and by Hélène Fillières in the 2005 adaptation.\nMargaret appears as a pivotal character in the second season of the American historical drama series Knightfall where she is portrayed by Clementine Nicholson.\nReferences\nSources\n*\n*\n*\n|-\n|-"
    }
  ]
}