{
  "content": [
    {
      "type": "text",
      "text": "# Margate Sands (Boardwalk Empire)\n\n| length         = 60 minutes\n| guests         = * James Cromwell as Andrew Mellon\n* Stephen Root as Gaston Means\n* Julianne Nicholson as Esther Randolph\n* Anatol Yusef as Meyer Lansky\n* Erik LaRay Harvey as Dunn Purnsley\n* Ivo Nandi as Joe Masseria\n* Kevin O'Rourke as Edward L. Bader\n* Victor Verhaeghe as Damien Fleming\n| prev           = Two Imposters\n| next           = New York Sour\n| season_article = Boardwalk Empire (season 3)\n| episode_list   = List of Boardwalk Empire episodes\n}}\n\"Margate Sands\" is the twelfth episode and season finale of the third season of the American period crime drama television series Boardwalk Empire. It is the 36th overall episode of the series and was written by series creator Terence Winter and executive producer Howard Korder, and directed by executive producer Tim Van Patten. It was released on HBO on December 2, 2012.\nThe series is set in Atlantic City, New Jersey, during the Prohibition era of the 1920s. The series follows Enoch \"Nucky\" Thompson, a political figure who rises to prominence and interacts with mobsters, politicians, government agents, and the common folk who look up to him. In the episode, the gang war between Nucky and Gyp escalates in Atlantic City.\nAccording to Nielsen Media Research, the episode was seen by an estimated 2.73 million household viewers and gained a 0.9 ratings share among adults aged 18–49. The episode received critical acclaim, with critics praising the directing, performances, themes and closure to the storyline. At the 65th Primetime Emmy Awards, Tim Van Patten received a nomination for Outstanding Directing for a Drama Series.\nPlot\nThe gang war between Nucky and Gyp has resulted in many deaths in Atlantic City, alarming the townspeople. Despite Gyp acquiring new territories, Masseria is upset with the deaths of many of his henchmen, especially as Gyp still hasn't killed Nucky and Rothstein. Nucky also faces trouble among his own support, as Capone and Chalky do not get along.\nIn New York City, Luciano is interrogated by the police officers. He is forced to disclose the location of more heroin in exchange for his release. However, he and Lansky discover that Rothstein paid the officers, and he is now planning on getting involved in a heroin business deal with Masseria. Rothstein contacts Nucky to inform him that he will strike a deal with Masseria. If Nucky gives him full ownership of Old Overholt, Rothstein will convince Masseria to withdraw his henchmen who have been supporting Gyp, which he accepts. Also in New York City, Margaret contacts a doctor to help her abort her baby.\nGillian starts fearing for Tommy's safety as Gyp does not let her leave the Artemis Club. When Gyp claims that he will make her a \"queen\" when he takes over Atlantic City, Gillian decides to manipulate him. She seduces him, performing erotic asphyxiation on him. She tries to inject him with heroin, but he stops her and injects her instead. Suddenly, Gyp discovers that Masseria has withdrawn his men, leaving him vulnerable. Richard then enters the Artemis Club, killing most of Gyp's men, forcing him to flee. Richard finds a man holding Tommy hostage, but he manages to kill him. He takes Tommy to Julia's house, but Paul warns him about coming home bloody, causing Richard to leave. Elsewhere, Capone and Chalky's gangs ambush and gun down all of Masseria's men as they leave Atlantic City.\nGyp flees to Tabor Heights with his three remaining henchmen. He continues explaining his next move, but his right-hand man, Tonino, is not convinced. As Gyp urinates on the beach, Tonino fatally stabs him multiple times until he drops dead. Tonino then walks up the beach to meet with Nucky and Eli, revealing that he was ordered to do the hit. He is told to send the body to Masseria and to never return to Atlantic City. Andrew Mellon informs Esther Randolph about Overholt's new leadership. He does not want it to be associated with a criminal organization, so he asks her to arrest those involved. To her surprise, he refers to Rothstein. It is revealed that Means provided this to Mellon with Nucky's help.\nNucky meets with Margaret at her apartment in New York City. He wants to reconcile, telling her he forgives her for her affair with Owen. When she doesn't say anything, he offers her money to take care of the children. She declines and then closes the door, ending their relationship. A depressed Nucky then returns to Atlantic City and goes to the boardwalk. When a person asks, \"Are you Nucky Thompson?\", he does not answer. Nucky then removes the carnation from his lapel, tosses it aside, and continues walking until he gets lost amidst the crowd.\nProduction\nDevelopment\nThe episode was written by series creator Terence Winter and executive producer Howard Korder, and directed by executive producer Tim Van Patten. This was Winter's ninth writing credit, Korder's eleventh writing credit, and Van Patten's 12th directing credit.\nWriting\nOn Gyp's death, Terence Winter explained, \"the most satisfying resolution to looking at the season as its own book was that Gyp's gotta go, and in a way that's unexpected and powerful. He's just like a mad dog and just needs to be put down. If he didn't go in 12, you'd think he's gotta go in episode 1 of season 4, so what are we waiting for. The guy's gotta die.\"\nReception\nViewers\nIn its original American broadcast, \"Margate Sands\" was seen by an estimated 2.73 million household viewers with a 0.9 in the 18–49 demographics. This means that 0.9 percent of all households with televisions watched the episode. This was a 18% increase in viewership from the previous episode, which was watched by 2.30 million household viewers with a 0.8 in the 18–49 demographics.\nCritical reviews\n\"Margate Sands\" received critical acclaim. Matt Fowler of IGN gave the episode an \"amazing\" 9.3 out of 10 and wrote, \"'Margate Sands' definitely didn't disappoint the part of me looking for, and craving, a high body count. Especially Harrow's unforgettable, Taxi Driver-esque whorehouse run-through. By the end though, there wasn't much set up for next year other than every gangster in New York probably being pissed off and Nucky wanting a new life of anonymity. Hopefully there'll be more Chalky seeing as how he'll have a club on the boardwalk. This season spent a lot of time filling up some of the show's main characters' lives with love and hope, only to leave them all as empty shells in the end.\"\nNoel Murray of The A.V. Club gave the episode an \"A–\" grade and wrote, \"'Two Imposters' mostly narrowed its focus to just a few characters, and because it threatened those few with ruination and/or death, the episode was incredibly suspenseful. By contrast, 'Margate Sands' is littered with corpses, which makes it exciting, but less tantalizing; and the episode expands its scope to include almost all of the cast, which dulls some of the scene-to-scene momentum. But this is still a very good Boardwalk Empire, and one that's fairly bold in how it expresses the themes and overall direction of a season that on the whole has been far more subtle than the show used to be back in its 'Nucky's muddy footprints' days.\"\nAlan Sepinwall of HitFix wrote, \"And that's Boardwalk Empire. It may not have the mystery or emotional depth of The Sopranos, but it lays out its story and makes sure all the pieces fit together very, very well at the end. And when you get to the end, that can feel awfully satisfying.\" Seth Colter Walls of Vulture gave the episode a 4 star rating out of 5 and wrote, \"Atlantic City is drenched in a bloodbath. And the following montage makes clear how, opening cruelties aside, not all the losses are on one side.\"\nRodrigo Perez of IndieWire gave the episode an \"A–\" grade and wrote, \"As we've repeated almost like a maxim: The creators and writers of HBO's Boardwalk Empire like to play the long tail game. And while it can be slow going in the moment at times, that planning, patience and vision usually pays off. Such is the case in 'Margate Sands', the finale of season 3 and the conclusion to the three-episode arc where creators rewarded audiences by blowing the doors off, causing the body count to rise.\" Chris O'Hara of TV Fanatic gave the episode a perfect 5 star rating out of 5 and wrote, \"The finale finished much like the premiere started, as Gyp met his demise not far from where we first saw him spill blood. Indeed, 'Margate Sands' brought closure to many of the storylines to which we were treated over the past few months, thanks to an array of twists and turns that made for a thrilling conclusion.\"\nMichael Noble of Den of Geek wrote, \"The show may have been trailed with Nucky's doubts on being half a gangster, but this is not merely Nucky’s show any more, and the question of who a person really is has been explored through so many more avenues. If there has been an overarching theme to this multi-stranded season, it was the collision between public and personal lives.\" Michelle Rafferty of Paste gave the episode a 9 out of 10 rating and wrote, \"the optimism of last week's pretty badass conclusion was quickly tampered by the opening of 'Margate Sands.' War in Atlantic City is ugly and Nucky, we quickly learn, is singing a different tune from last week.\"\nAccolades\nFor the episode, Tim Van Patten was nominated for Outstanding Directing for a Drama Series at the 65th Primetime Emmy Awards. He would lose to House of Cards for the episode \"Chapter 1\".\nReferences\nExternal links\n* [https://www.hbo.com/boardwalk-empire/season-3/12-margate-sands \"Margate Sands\"] at HBO\n*"
    }
  ]
}