{
  "content": [
    {
      "type": "text",
      "text": "# Margaritas in the Spanish Civil War\n\nMargaritas in the Spanish Civil War played an important role for Nationalist forces. Created in 1919 as a Carlist social aid organization for the poor, they went into decline during the Dictatorship of Primo de Rivera as there was less of a perceived need for promotion of their ideals.\nThe Second Republic saw conservative women join and form women's groups in response to what they saw as an attack on their traditions and culture. Women went into homes, organizing musical evenings, religious actions and proselytizing. Organized by regions, the Narvarre group would become one of the biggest. María Rosa Urraca Pastor's prominence grew during this period, becoming the national face of the Margaritas. Despite men traditionally opposing political empowerment of women, Communión Tradicionalista supported the Margaritas to further their own political goals and so long as the Margaritas did not challenge male leadership.\nDespite a National policy that women should stay well away from the front and Carlists supporting traditional gender roles, Margaritas were very active on the front. They delivered mail, collected Nationalist corpses, laundered clothes, and taught men how to read. In more rural areas, they also took over agricultural activities.\nThe end of the Civil War and the start of the Francoist period saw Carlism become illegal and the Margaritas disbanded, with official restrictions not being lifted until the mid-1940s. The important contributions of the women of the Margaritas would largely be forgotten and ignored even as the Carlist militia, the Requetés, enjoyed new popularity in the 1950s.\nPrelude to the Second Republic (1800–1922)\nThe Margaritas were founded in 1919 as a social aid organization for the poor. They came from a Carlist tradition, and were part of the Communión Tradicionalista party as women's auxiliary service organizations.  Their youth movement counterparts were the Pelayos, and the Carlist militia was the Requetés. The Margaritas were named after Princess Margherita of Bourbon-Parma, wife of Carlos VII. Princess Margarita had served as a nurse during the Second Carlist War. The ordinance of the Margarita was to be \"an example of Spanish woman, intrepid defender of the Christian family, vigilant guardian of the traditions of the patria.\"\nCarlism supported Don Carlos of the Borbón monarchy, and supported a form of traditionalist Catholicism alongside a strong, traditional Catholic monarch. They opposed King Alfonso XII during the nineteenth-century as they believed he led Spain into a much more liberal and secular direction. Leadership in the movement tended to come from the Spanish monarchy's court. Margarita had been called on before as a name to represent a group of Carlists. A faction of Carlist in Álava ran a slate of candidates under the name Los Margaritos in the 1910s provincial elections. Identifying with the Carlist princess, they wanted to offer a more authentic and simpler version of self-sacrificing Carlism.\nCarlism had become less important in Spanish politics following the end of the Second Carlist War. The movement would continue to lose influence going forward until the start of the Second Republic.\nDictatorship of Primo de Rivera (1923-1930)\nHistorically, there had been few organizations for Carlist women. During the Dictatorship, the Margaritas were relatively quiet compared to earlier periods as there was less of a perceived need for them to serve in defense of the Spanish family. At the end of the Dictatorship in Navarre, Carlist women had only three options. One was Juntas de Damas Católico-Monárquicas, but it lack popular support nationally among Carlists. In Catalonia, the Margaritas ran a few work centers and neighborhood centers.\nThere was a breakdown between Carlists and Sindicatos Libres starting around 1924. In Catalonia, this split meant the Carlism in the region no longer had to concern itself with trying to accommodate both Spanish nationalists and Catalan nationalists. In 1927, this allowed for the closure of the La Margarite Carlist work center in Barcelona. It was subsequently taken over by Sindicatos Libres's Severiano Martínez Anido and Civil Governor Milans del Bosch in 1931, which really upset Carlists. It also had the impact of making Sindicatos Libres completely isolated from other potential right wing partners in Barcelona.\nSecond Spanish Republic (1931–1937)\nThe Second Republic saw an increase in the number of traditionalist women's organizations, and in Carlist women's groups, as this group felt a need to defend their Catholic beliefs and traditions. Their numbers were helped by women such as Dolores de Gortázar calling women to defend their views and become involved in that process. Carlists more broadly began using a mix of their traditional rallies and more modern political strategies to increase their political effectiveness and to avoid alienating people and minimize government scrutiny who feared another Carlist war. The group transformed into a propaganda tool for the Communión Tradicionalista party. Members arranged musical evenings, organized religious acts and proselytized in people's homes.\nspeaking, 1934]]\nSome women in the Margaritas came from the women's section of Catholic Action. For many Margaritas, it was important to defend their religion and traditions. Their traditions revolved around creating an earthly version of the Holy Family. Fathers were in charge, and mothers were pious while their children were obedient.\nOne of the key organizational aspects among Margaritas in this period was local, with Margaritas asking that territorial boundaries be respected when it came to their work but also discussing the need for new organizational structures to be discussed. The largest group of Margaritas developed in Navarre, where they enjoyed political legitimacy that their male counterparts lacked. Women from the area included Dolores Baleztena, Carmen Villanueva, Clinia Cabañas, Josefa Alegría, Isabel Baleztena, Ascensión Cano, and Rosa Erice. Rosa Urraca was the most active Margarita from the Basque Country.\nAfter months of a Second Republic government dismantling institutions supporting and while challenging traditional values of Spain's right, Carlists began to become more politically relevant on the right. The Centro Tradicionalista Montañés held a conference in December 1931 where María Rosa Urraca Pastor spoke about the need to for women move from the church and to become actively engaged in the political struggle. The movement would soon see a number of female leaders emerge.\nMaría Rosa Urraca Pastor's prominence grew during this period, as she traveled around the country advocating her Catholic ideals and calling others to become more involved. In the 1933 elections she had run for the Cortes from Gipuzkoa as Carlist representative in Unión Regionalista Gipuzcoana, but had narrowly lost and emerged bitter about the political process. Still, she would become the most high-profile women in the Carlist movement since Princess Margherita of Bourbon-Parma. Urraca Paster was unique in this period in being one of the few Carlists concerned about the class struggle, with the topic coming up in many of her speeches and in her decision to directly speak to workers groups.\nDuring the Second Republic, Margaritas were involved in organizing Catholic schools as an alternative to government run public schools. Many more traditional Catholics removed their children from public schools and then enrolled them in Margaritas run ones. Socorro Blanco was created in 1933 by Margarias to support Carlist political prisoners. They sent postcards to prisoners and their families. They visited prisoners and their families, and organized for families to visit members in prison. They made public allegations of abuse inside prison.\nCarlist men had traditionally been opposed to women's political empowerment. They believed women should occupy a spot on the political margins. Changes in the Second Republic that allowed women to vote made male leaders start to slowly change their position starting around 1932, sensing a potential to gain political capital by having women as their more visible face. They wanted this to only happen though if Carlist women maintained their traditional values and put forth messages that also supported this. While being more visible, they did not want women to challenge their leadership.\nSpanish Civil War (1936–1939)\nDuring the Civil War, many Catholic women were less willing to join Sección Femenina because it was less aristocratic. They also viewed them as more plebeian. This made them more hesitant to join them. As a result, these more middle-class women joined the Margaritas, where they had strong organizational skills, loyalty and a willingness to take on dangerous tasks in support of their beliefs and their hometowns.\nWhile Nationalists believed in traditional Spanish gender roles where women should be at home despite official National government policy saying this, their war efforts required many women to leave their houses and serve in a variety of roles such as nurses, social care workers and teachers. During the war, the Alfonso Carlos veterans' hospital published a one-page dedication to Margaritas, apologizing to them for requiring their services in masculine roles, saying in part, the \"restless bees extract the richest honey of their labour ... accepting with resignation their roles as instructors, pharmacists, office workers and radiologists.\" María Rosa Urraca Pastor went on the radio during the Civil War, encouraging women away from the front because a woman's real glory was in the role of mother and queen of her household. While requetés served bravely on the front, Margaritas were supposed to serve just as bravely in their homes and, through their hard work, shame men who had not gone to fight into heading to the front.\nDuring the early stages of the Spanish Civil War, many Margaritas were volunteers near the front, working as nurses, or in hospitals, workshops and canteens in support roles. They were highly trusted by military leadership. One of the most important contributions during the Civil War Margaritas was with Asistencia a Frentes y Hospitales organized by María Rosa Urraca Pastor. During the last winter of the Spanish Civil War, Margaritas were involved with distributing food to the troops. For the Navarre Margaritas of the Asistencia a Frentes y Hospitales, food took up the vast chunk of their budget in 1938 and 1939. The Navarre Margaritas provided 200,000 cans milk and jam to troops, along with hundreds of thousands of dulces and chocolates. They also provided alcohol and tobacco, occupying their third and fourth biggest food related expenses. This included 40,000 bottles of cognac, 4,600,000 cigarettes and 60,000 cigars. The Margaritas got a lot of financial support from the townpeople of Pamplona.\nDuring the Civil War, Margaritas operated their own postal service, providing daily mail to troops on the front lines near Somosierra and Guipúzcoa. Their postal service expanded as the front expanded during the war. They would sometimes use their postal service vehicles to follow requetés to the front, often returning with bodies of their fellow Carlists after delivering the mail. Before the end of the war, they would deliver 216,000 parcels to the front. Beyond mail, their postal service also provided militiamen with rosaries, crucifixes and Catholic medallions. Their final budget for the latter was 21,600 pesetas.\nMargaritas also supported the war efforts by working as seamstresses and launderers. They would often sew their slogan, Detente bala (\"bullet, stop!\") and burgundy crosses into uniforms they made for requetés. They would retrieve dirty clothes and uniforms from the front, mend them, launder them, disinfect them, and then return them within a week. They would return 116,000 bags of laundry to troops on the front by the end of the war.\nMargaritas served an important communications role for requetés, their families and towns they were from. They would provide updates on conditions of injured requetés to their family members and mayors of their towns. They would collect personal items from dead requetés on the front, deliver them to their family, and stay to provide comfort to the family of the dead.\nWhile incidents of Nationalist women being armed on the front were rare, Margarita Agustina Simón Sanz is one example of a woman who did. Caught up in the Republican assault on Belchite on 3 August 1937, she fought the Republican soldiers surrounding her, returning fire with a pistol she acquired. She was captured by government forces, and subsequently executed alongside the requetés she was with. Her story would subsequently be immortalized in a play based on her life performed in Pamplona on 8 November 1938 as part of Margarita fundraising efforts.\nTeaching was another task some Margaritas took up during the war, working alongside priests to teach illiterate soldiers on front how to read. Literacy classes were more beneficial in rural areas than urban, because literacy rates were much lower there. Many soldiers from these areas did not know how to write, and could not read or sign loan documents without using a thumbprint as a signature replacement. This was particularly the case in Ciudad Real. Margaritas often enjoyed these experiences. The impact of their teaching had the added goal of bringing Catholicism to parts of the country where it was much less practiced, including Asturias, Andalusia and the Canary Islands.\nIn more rural areas depleted of men who left to fight for the Nationalists in the war, Margaritas often took over agricultural at home.\nFrancoist Spain (1938–1973)\nFactionalism following the end of the Civil War largely saw officially recognized Carlism political organizations fall to the wayside, and a period of limited official oppression started. The Franco regime began to relax these restrictions by the mid-1940s. In February 1947, forty-two members of the Junta of Regional and Provincial Chiefs met to talk about the future of Carlism and its structures. Among other decisions made at this meeting was the decision to restore the Margaritas.\nDuring the 1950s, the role of the Margaritas and their importance in providing support to those on the front was largely forgotten and erased, even as the Requetés enjoyed new popularity, with their male stories being told in newspapers like El Pensamiento Navarro. In ceremonies in Navarre commemorating Carlists in the Spanish Civil War, women were never on stage and were ignored by media except in background shots of those attending the festivities.\nReferences"
    }
  ]
}