{
  "content": [
    {
      "type": "text",
      "text": "# Marine Biological Association of the United Kingdom\n\n|budget         =\n|research_field = Marine science\n|head           = Professor Willie Wilson (Director)\n|affiliations   =\n|staff          =\n|students       =\n|city           = Plymouth\n|address        = The Laboratory, Citadel Hill, PL1 2PB\n|website        =\n|logo           =\n}}\nThe Marine Biological Association of the United Kingdom (MBA) is a learned society with a scientific laboratory that undertakes research in marine biology. The organisation was founded in 1884 and has been based in Plymouth since the Citadel Hill Laboratory was opened on 30 June 1888.\nThe MBA is also home to the National Marine Biological Library, whose collections cover the marine biological sciences, and curates the Historical Collections.\nThroughout its history, the MBA has had a royal patron. In 2013, the MBA was granted a royal charter in recognition of the MBA's scientific preeminence in its field.\nOrigins and foundation\non Plymouth Hoe.]]\nIn 1866 the Royal Commission on the Sea Fisheries, which included among its officers Professor Thomas Henry Huxley, had reported that fears of over-exploitation of the sea fisheries were unfounded. They recommended removing existing laws regulating fishing grounds and closed seasons. However, the increase in the size and number of fishing vessels was causing widespread concern, and there were reports from all around the UK coasts about the scarcity of particular fish. This concern was expressed at the International Fisheries Exhibition in London in 1883, a conference called to discuss the commercial and scientific aspects of the fishing industry, and which was attended by many leading scientists of the day. Nevertheless, in his opening address, Huxley discounted reports of fish scarcities and repeated the views of the Royal Commission of 1866. He stated that with existing methods of fishing, it was inconceivable that the great sea fisheries, such as those for cod (Gadus morhua), herring (Clupea harengus) and mackerel (Scomber scombrus), could ever be exhausted.\nMany of the representatives of science and commerce present had different views to Huxley. Their views were put forward by E. Ray Lankester, who summed up the scientific contributions in an essay on what we would now call ecology. He pointed out that \"it is a mistake to suppose that the place of fish removed from a particular fishing ground is immediately taken by some of the grand total of fish, which are so numerous in comparison with man's depredations as to make his operations in this respect insignificant...there is on the contrary evidence that shoal fish, like herrings, mackerel and pilchard (Sardina pilchardus), and ground-fish, such as soles and other flat-fishes, are really localised. If man removes a large proportion of these fish from the areas which they inhabit, the natural balance is upset and chiefly in so far as the production of young fish is concerned.\" During this masterly address he went on to develop this theme and concluded with an appeal for the formation of a society to foster the study of marine life, both for its scientific interest and because of the need to know more about the life histories and habitats of food fishes. Professor Lankester envisaged that such a society would construct a laboratory close to the coast, with the building containing aquaria and apparatus for the circulation of seawater and, most importantly, laboratory accommodation for scientists. The appeal was answered by a group of eminent scientists, who resolved to form a society and build a laboratory on the British coast.\nFounders\nThe committee formed at the International Fisheries Exhibition 1883 resolved to take action to establish a British Marine Laboratory, an initiative that ultimately led to the formation of the Marine Biological Association and building of the Laboratory in Plymouth. They were:\n* Sir John Lubbock, MP (later Lord Avebury)\n* P. L. Sclater FRS, Secretary of the Zoological Society\n* F. Jeffrey Bell, Professor of Zoology at King's College London\n* Michael Foster FRS, Professor of Physiology at University of Cambridge\n* J. Burdon-Sanderson FRS, Professor of Physiology at University of Oxford\n* W. H. Flower FRS, Hunterian Professor, Royal College of Surgeons\n* G. J. Romanes FRS, Secretary of the Linnean Society\n* A. Sedgwick, Trinity College, Cambridge\n* H. N. Moseley, Linacre Professor of Anatomy at University of Oxford\n* A. Milnes Marshall, Professor of Zoology at Owens College, Manchester (1879–93)\n* W. T. Thiselton-Dyer FRS, Assistant Director, Royal Botanic Gardens, Kew\n* W. B. Carpenter FRS\n* G. J. Allman FRS, Emeritus Professor of Natural History at University of Edinburgh\n* John Murray, Director of the Challenger Expedition Reports\nThe Marine Biological Association of the United Kingdom was formed at a meeting held in the rooms of the Royal Society in London on 31 March 1884. All but two of the signatories of the resolution of 1883 were present, together with some other scientists. By this time Professor Huxley had been persuaded to give his support and was elected as the first president of the association, with Ray Lankester as honorary secretary.\nPresidents and directors\nThe MBA is governed by a council which is headed by a president. The MBA's director is responsible for the day-to-day running of the association.\nPresidents\nSince 1884, the MBA has had fifteen presidents.:\n* T. H. Huxley FRS (1884–1890)\n* Sir E. Ray Lankester FRS (1890–1929)\n* Lord Moyne (1930–1939)\n* George Parker Bidder (1939–1945)\n* Sir James Gray FRS (1945–1955)\n* A. V. Hill FRS (1955–1960)\n* C. F. A. Pantin FRS (1960–1966)\n* Sir Alan L. Hodgkin FRS (1966–1976)\n* J. Z. Young FRS (1976–1986)\n* James Lovelock FRS (1986–1990)\n* Sir Crispin Tickell (1990–2001)\n* Sir Neil Chalmers (2002–2007)\n* Sir Howard Dalton FRS (2007–2008)\n* Sir Geoffrey Holland (2008–2014)\n* Sir John Beddington FRS (2014–2019)\n* Dr Gill Rider CB (2019–present)\nDirectors\nThere have been fourteen directors of the Marine Biological Association since its foundation:\n* 1884–1888: Walter Heape FRS\n* 1888–1890: Gilbert C. Bourne FRS\n* 1890–1892: William L. Calderwood\n* 1892–1894: Edward J. Bles FRSE\n* 1894–1936: Edgar Johnson Allen FRS\n* 1936–1945: Stanley W. Kemp FRS\n* 1945–1965: Sir Frederick S. Russell FRS\n* 1965–1974: Sir J. Eric Smith FRS\n* 1974–1987: Sir Eric J. Denton FRS\n* 1987–1999: Michael Whitfield\n* 1999–2007: Stephen J. Hawkins\n* 2007–2017: Colin Brownlee\n* 2017–2018: Matthew T Frost\n* 2018--  : [https://www.mba.ac.uk/staff/professor-willie-wilson/ William H. Wilson]\nPast and current research\nThe MBA has a world-leading reputation for marine biological research, with some twelve Nobel laureates having been or being associated with it over the course of their career. Among them, A. V. Hill received the Nobel Prize in Physiology or Medicine in 1922 \"for his discovery relating to the production of heat in the muscle\". The discovery of the mechanism of nerve impulses (action potentials) in animals was made at the Laboratory in Plymouth by Sir Alan Lloyd Hodgkin and Sir Andrew Huxley, work for which they were awarded the Nobel Prize for Physiology or Medicine in 1963. The MBA publishes the Journal of the Marine Biological Association of the United Kingdom.\nA public aquarium operated by the association was transferred to the new National Marine Aquarium at Sutton Harbour in 1998.\nThe current MBA Research Programme includes work on  molecular and cell biology, physiology and ecology. A wide range of marine organisms are studied from microscopic organisms such as marine plankton and viruses and much larger species such as sharks and giant kelp. The objective of this research is to increase understanding of the structure and function of marine ecosystems.\nThe association's research is led by a number of Research Fellows who each run an interdisciplinary group which collaborates with other organisations as well as obtaining funding for their work. The groundbreaking work of MBA research scientists has been recognised by many national and international awards over the years, including the Royal Society's Royal Medal, Darwin Medal and Croonian Lecture, the Zoological Society of London's Frink Medal, and the Japan Society for the Promotion of Science's International Prize for Biology.\nLong-term science observations of physical and biological parameters in the ocean have been collected by the MBA for over 100 years providing a foundation of data supporting studies aimed at understanding biological responses to marine environmental changes including effects of climate change.\nNational Marine Biological Library\nThe National Marine Biological Library (NMBL) began in 1887 as the research support library for the MBA. Today, it provides research support for the MBA,  the Sir Alister Hardy Foundation for Ocean Science and Plymouth Marine Laboratory. The  NMBL's holdings include periodicals, serials, journals, reports and grey literature, a large collection of historical and modern books, an extensive reprint collection, and expedition reports. These cover the vast majority of the world. The NMBL's Special Collections include the research libraries of several eminent MBA scientists; these are George Parker Bidder, Edward Thomas Browne, Sidney Frederic Harmer, E. Ray Lankester, Marie Victoire Lebour and John Zachary Young. Additionally, the NMBL curates the MBA Archive Collection which details the MBA's institutional history as well the history of marine biology in Britain since the late-nineteenth century, especially through the collection's personal papers. These include scientific papers and material from Walter Garstang, Sidney Harmer, Hildebrand Wolfe Harvey, Thomas Hincks, Thomas V. Hodgson, Stanley W. Kemp, Charles A. Kofoid, Mary Parke, John Richardson, Frederick S. Russell, Thomas A. Stephenson, Walter Frank Raphael Weldon, Edward A. Wilson and William Yarrell.\nJournal of the Marine Biological Association\nSince 1887, the MBA has published the Journal of the Marine Biological Association (JMBA), a scientific journal \"publishing original research on all aspects of marine biology\".\nRoyal Patrons\nThroughout its history the Marine Biological Association of the United Kingdom has had a member of the royal family as its royal patron.\n* HRH Duke of Edinburgh October 1953April 2021.\nReferences\nExternal links\n*[http://www.mba.ac.uk Website of the Marine Biological Association of the United Kingdom]\n*[http://www.mba.ac.uk/nmbl Website of the National Marine Biological Library]"
    }
  ]
}