{
  "content": [
    {
      "type": "text",
      "text": "# Marilyn Ware\n\n| death_place         = Denver, Colorado, U.S.\n| birthname           =\n| nationality         =\n| party               = Republican\n| spouse              =\n| relations           =\n| children            =\n| residence           =\n| alma_mater          = American UniversityUniversity of Pennsylvania\n}}\nMarilyn Ware (November 4, 1943 &ndash; December 14, 2017) was the United States Ambassador to Finland from March 2006 to March 2008.\nEarly life and business career\nWare was born in Philadelphia, Pennsylvania. Her father was John H. Ware III who served in the United States House of Representatives. Ware graduated from the University of Pennsylvania, and was a freelance journalist and newspaper owner.\nFrom 1988-2003, Ware served as chief executive officer (CEO) of American Water Works Company, the largest water-utility holding company in the United States. During her tenure, the company grew from a market capitalization of $1.4 billion in 1988 to $8.3 billion when it was sold to RWE in January 2003.\nWare served on the Economic Advisory Board of RWE and as a member of the International Advisory Council of Thames Water, Plc., RWE's global water subsidiary, the third largest water company in the world.\nIn 2002, President Bush appointed Ware to serve on the National Critical Infrastructure Advisory Council, a position that she held until her appointment as U.S. Ambassador to Finland.\nWare spent the majority of her adult life closely involved in the U.S. water sector.  She was the Honorary President of WaterAid America, an international charity dedicated to the provision of safe domestic water, sanitation systems and hygiene education in 15 countries.  She also served on the Boards of Directors of The Vice President's Residence Foundation, and of the International Republican Institute (IRI). She served on the Board of Trustees of The American Enterprise Institute for Public Policy Research in Washington, DC, and was Vice-Chairman of the Board of the Eisenhower Fellowships Program headquartered in Philadelphia. Ware was the Chairman for the Ware Family Office in Lancaster County, Pennsylvania.\nAmbassador to Finland\nWare was nominated by President George W. Bush in October 2005. After Senate confirmation in December 2005, Ambassador Ware served at the U.S. Embassy in Helsinki from March 2006 to March 2008.\nLater activities\nWare was a lifetime advocate of farmland and open space preservation, assistance for abused families and early childhood education and care. She was one of the founders of the Janus School, a private day school for children with learning disabilities, and a co-founder of the Lancaster Farmland Trust.\nWare maintained interest in foreign policy and diplomatic relations. For the 2008 Presidential Convention, she sponsored and hosted a group of over 140 international visitors to the Republican National Convention in Minneapolis/St. Paul, Minnesota as part of the International Democrat Union, a working organization of center and center-right parties throughout the world. She was listed by the Union as the party's contact.\nWare died of complications of Alzheimer's disease on December 14, 2017, at a hospital in Denver, Colorado. She was 74.\nAwards and recognition\nWare was awarded an honorary Doctor of Public Services from Thaddeus Stevens College of Technology in 1988 and awarded an Honorary Doctor of Letters degree from Franklin & Marshall College in Lancaster, PA in 2004.\nIn 2002 and 2003, she was named to \"Sy Snyder's Power 50,\" the PoliticsPA list of politically influential individuals in Pennsylvania. She was also named to the PoliticsPA list of \"Pennsylvania's Most Politically Powerful Women\"\nReferences\n:This article incorporates text in the public domain from the United States Department of State.\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}