{
  "content": [
    {
      "type": "text",
      "text": "# Mariah Stewart\n\nMariah Stewart is an American author of romantic fiction whose titles have appeared on the New York Times and\nUSA Today bestsellers lists.  Stewart's books have won, or been nominated for, various major awards, including three-time recipient of the New Jersey Romance Writers' (NJRW) Golden Leaf Awards for ''The President's Daughter (Best Single Title Romance 2002), Voices Carry (Best Single Title Romance 2001), and for her very first novel, Moments in Time (Best Contemporary Novel 1998).  NJRW also awarded Stewart a Lifetime Achievement Award'' and inducted her into their Hall of Fame.\nOther awards include the Reviewers International Organization Award of Excellence for Priceless (Favorite Contemporary Romance 1999), the Reviewers Choice Awards from Romantic Times for Moon Dance (Best Contemporary Romance 1999), and the Colorado Romance Writers' Award of Excellence for A Different Light (Best Single Title 1995).\nStewart is a New Jersey native.  She and her husband now reside in Chester County, Philadelphia \"in a century old Victorian country home\" with their daughters and Golden Retrievers.\nBibliography\nFrom Stewart's official website:\nSeries\nIn reading order:\nDead series\n* Dead Wrong (June 1, 2004)\n* Dead Certain (June 29, 2004)\n* Dead Even (3 Aug 2004)\n* Dead End (9 Aug 2005)\nTruth series\n* Cold Truth (30 Aug 2005)\n* Hard Truth (27 Sept 2005)\n* Dark Truth (25 Oct 2005)\n* Final Truth (May 30, 2006)\nLast series\n* Last Look (May 29, 2007)\n* Last Words (June 26, 2007)\n* Last Breath (July 31, 2007)\nContinued FBI series\n* Forgotten (September 2008)\nMercy series\n* Mercy Street (March 2009)\n* Cry Mercy (May 2009)\n* Acts of Mercy (August 2009)\nAnthologies\n* Wait Until Dark (2001), with Linda Anderson, Andrea Kane, and Karen Robards\n* Under the Boardwalk (1999), with Geralyn Dawson, Linda Howard, Jillian Hunter, and Miranda Jarrett\n* Upon a Midnight Clear (1997) with Margaret Allison, Jude Deveraux, Stef Ann Holm, and Linda Howard\nOther books\n* Until Dark (2003)\n* The President's Daughter (2002)\n* Voices Carry (2001)\n* Brown-Eyed Girl (2000)\n* Priceless (1999)\n* Moon Dance (1999)\n* Wonderful You (1998)\n* Devlin's Light (1997)\n* Carolina Mist (1996)\n* A Different Light (1995)\n* Moments in Time (1995)\nReferences\nExternal links\n* [http://www.writerswrite.com/journal/jun04/stewart.htm \"A Conversation With Mariah Stewart\" by Claire E. White of Writer's Write]"
    }
  ]
}