{
  "content": [
    {
      "type": "text",
      "text": "# Maritime Monument, Copenhagen\n\nThe Maritime Monument (Danish Søfartsmonumentet), located at Langelinie, close to Langelinie Marina, is a maritime memorial in Copenhagen, Denmark, commemorating civilian Danish sailors who lost their lives during the First World War. The monument consists of a bronze sculpture of a winged female figure, representing Memory, placed on a rhombus-shaped podium with a series of narrative reliefs on its side.\nHistory\nOn a board meeting in the Danish Steamship Owners' Association on 10 November 1921, it was decided to terminate a war accident insurance policy. On a later meeting, on 15 March 1923, Johan Hansen proposed to use unused funds (circa DKK 435,000) for the creation of a memorial to seamen of the Danish merchant fleet who had lost their lives at sea during the war years. The proposal was unanimously approved on a meeting on 17 May 1923.  A committee consisting of Christian Sass, Johan Hansen, A.N. Petersen and Eilert Maegaard was put in charge of the project and DKK 50,000 was allocated to its realization.\nEinar Utzon-Frank, Ludvig Brandstrup, Henning Hansen and city architect Hans Beck Wright were initially engaged as artistic consultants, They were later supplemented with Rasmus Harboe, Svend Rathsack, Anton Rosen, Edvard Thomsen and Emanuel Monberg in an invited competition.\nAn invited competition was initially held but none of the entires were found suitable and it was therefore followed by a second round. 59 proposals were submitted and Svend Rathsack's and Ivar Bentson's project was selected as the final winner.\nThe monument was officially inaugurated on 9 May 1928. Representatives of the Danish royal family, Government ministers, civil servants and representatives from commercial and cultural circles as well as surviving relatives of deceased sailors attended the ceremony. Speeches were held by King Christian X, the Chairman of the Danish Steamship Owners’ Association and the lord mayor of Copenhagen. A cantata specially written for the occasion by Hans Hartvig Seedorff and Johan Hye-Knudsen was also sung at the event.\nOver the years the limestone reliefs fell into an advanced state of decay. The base was originally carved in limestone but Italian marble was now opted for as a more weather resistant alternative. Restoration work was commenced in 2009 and the monument was reinaugurated Head of the Danish Shipowners’ Association, Mr. Peter Bjerregaard on 15 September 2011.\nDescription\nThe winged female figure, representing Remembrance (Mindet), was modelled over the classical Hellenistic sculpture of Nike of Samothrace. The names of the 101 Danish merchant ships that sunk during the First World War as well as the names of the 648 sailors who drowned.\nThe reliefs on the sides of the podium were inspired by Borobudur on Java. The front of the podium shows a dramatic scene with a ship that is sinking after colliding with a naval mine. Sailors are jumping overboard and being evacuated to another ship. The relief on the left rear side of the podium shows Mars pointing with his sword towards an eagle that is attacking a gull as a symbol of the Great Powers' assault on the small, peaceful nation. On the right rear side is a representation of Mercury with his winged helmet, God of trade and seafaring, pointing towards three doves.  The fourth relief depicts a fatherless family.\nModels and sketches\n* Model submitted for the competition on 26 September 1924. 1924. Depicted in Architecten, XXVI, 1924, p.&nbsp;223.\n* Sketch sent to the Magistrate on 21 October 1924. Stadsarkitektens Arkiv.\n* Ivar Bentsen: Rendering of the monument and the surrounding terrain. 1924.\n* Ivar Bentsen: Three renderings sent to the Magistrate on 18 maj 1925. . Stadsarkitektens Arkiv?\n* Model. Plaster. Dansk Dampskibsrederiforening.\n* Model of head of first sketch. Bronze. H. 14&nbsp;cm. Rathsack's Memorial Exhibition, Den Frie Udstilling, 1942, Car.no. 60.\n* Preliminary version of Victoria holding a stylus in her right hand, in 1/15 scale. Rathsack's Memorial Exhibition, Den Frie Udstilling, 1942, Cat.no. 64.\n* First version of the angle. Plastelina. H. 23, 5&nbsp;cm. (1924–25). Rathsack's Memorial Exhibition, Den Frie Udstilling, 1942, Car.no. 65\n* Draft model of the angle. Plaster. H. 57,5&nbsp;cm (Ca. 1925). Rathsack's Memorial Exhibition, Den Frie Udstilling, 1942, Cat.nn. 66. Formerly Christiansborg Palace, reg.no. 444.\n* 1/7 scale model of Victoria, holding a wreath. Rathsack's Memorial Exhibition, Den Frie Udstilling, 1942, Cat.no. 67.\n* Original plaster odel of head (Victoria). Plaster. (the rest destroyed). 75 x 45 x 77&nbsp;cm. Formerly the sculpture collection at Christiansborg Palace, reg.no. 413 (now Grønbæks Samling). Gift to KØS, Museum for kunst i det offentlige rum, Køge, 1998. Inv.no. 189–002. Rathsack's Memorial Exhibition, Den Frie Udstilling, 1942, Cat.no. 68. Udst. Oslo\n* Victoria with wreath and wings. Plaster. H. 105 x 68 x 108,5. Formerly the sculpture collection at  Christiansborg, reg.no. 414 (now Grønbæks Samling). Gift to KØS, Museum for kunst i det offentlige rum, 1998. Inv.no. 189–001.\nSee also\n* Memorial Anchor, Copenhagen\nReferences\nExternal links"
    }
  ]
}