{
  "content": [
    {
      "type": "text",
      "text": "# Marie Sophie Schwartz\n\n|birth_place = Borås, Sweden\n|death_date =\n|image_size = 200px|nationality = }}\nMarie Sophie Schwartz née Birath (4 July 1819 – 7 May 1894), was a Swedish writer. She has since been referred to as the most successful female writers of the late 19th-century in Sweden.\nLife\nMarie Sophie Schwartz was born in Borås and was the illegitimate daughter of the maidservant Carolina Birath and, probably, of her employer, the married merchant Johan Daniel Broms. She was adopted by the customs official Johan Trozig (d. 1830) and his wife Gustafva Björk in Stockholm: she also had an adoptive sister, Albertina Birath. In her official biography, she stated that her mother was Albertina Björk and that her father died before she was born leaving them in poverty, thereby explaining her adoption. Her adoptive family was wealthy, though it went bankrupt after the death of her adoptive father.\nWealthy relatives provided her with an education in a pension for girls from 1833 to 1834. The following years, she was given private tuition by benefactors and proved a talented painter, but she discontinued her painting after an illness in 1837. From 1840 to 1858, she lived with Gustaf Magnus Schwartz (1783-1858), professor of physic and technique, who was still formally (though separated) married to a Catholic and therefore could not marry her. They nonetheless lived together openly as married and she was commonly referred to as Mrs. Schwartz, despite this never being her legal name, and she was officially accepted as his wife. She became the mother of two sons, Gustaf Albert Schwartz and Eugène Schwartz, and through the former the great grandmother of Sven Stolpe.\nMarie Sophie Schwartz wrote from an early age, but was not allowed to publish. She finally debuted under the pseudonym Fru M.S.S. (\"Mrs. M.S.S\") in 1851. She has a place as a female pioneer, as she was the second woman after Wendela Hebbe to be given a permanent position at a Swedish newspaper: she was employed in the serials department of the paper Svenska Tidningen Dagligt Allehanda from 1851 to 1859.\nAfter the death of Schwartz, she lived with her former ladies companion Emelie Krook (1828-1889) in Stockholm, were Krook and her adoptive sister Albertina Birath managed a private school for girls in their home. Schwartz financed the education of her sons, and when her son Albert married and created his own home in 1876, she discontinued her literary career and moved in with him with Krook. She died in Stockholm.\nLiterary career\nMarie Sophie Schwartz was a very productive writer, especially after the death of her partner in 1858, when she was forced to support herself. She published numerous novels in book form as well as in serials. In her work she participated in contemporary public debate, particularly in regard to the social injustice and women's emancipation, and she criticized social snobbery and privileges of the nobility and supported women's rights and liberation. Her novels often portrayed conflicts between class and sex in the environment of the family novel. She was popular and successful, and her work were translated to Danish, German, French, English, Dutch, Czech, Hungarian and Polish. Among her work was Mannen av börd och qvinnan af folket (A Man of Birth and a Woman of the People) from 1858, in which she criticized the snobbery and privilege of the nobility, and reprinted in German around 1923, edited by Clara Hepner; Emancipationsvurmen (Enthusiasm of Emancipation) from 1860, in which she supported the independence and liberation of women; and what has been pointed out as her masterpiece: Positivspelarens son (The Son of the Barrel organ player) from 1863, in which she describes how someone born to a bad reputation only because of his birth can redeem himself by his personal acts.\nBibliography\n* Alma (1860)\n* [http://litteraturbanken.se/#!forfattare/SchwartzMS/titlar/AmandaNagraStrodda/info/etext Amanda] (1893)\n* [https://runeberg.org/mssaam/index.htm Arbetet adlar mannen] (1859)\n* Arbetets barn (1864)\n* [http://litteraturbanken.se/#!forfattare/SchwartzMS/titlar/BellmansSkor/info/etext Bellmans skor] (1865)\n* Berthas anteckninga (1881)\n* Blad för vinden (1879)\n* Blad ur kvinnans liv (1859)\n* Brukspatronens myndlingar (se Huru jag fick mig hustru)\n* Bärplockerskan och andra noveller (kompilation 1916)\n* [https://runeberg.org/mssbob/ Börd och bildning] (1861)\n* David Valdner (1866)\n* [http://litteraturbanken.se/#!forfattare/SchwartzMS/titlar/Davidsharpan/info/etext Davidsharpan i Norden] (1894)\n* De gifta (1871)\n* De värnlösa (1852)\n* Den rätta (1864)\n* Drömmerskan på Kellgrens grav (1866)\n* Egennyttan (1854)\n* Ellen (1860)\n* Elna och andra berättelser (kompilation 1916)\n* Emancipationswurmen (1860)\n* Ett hämndens offer (1859)\n* Ett klöverblad (1860)\n* Ett tidens barn (1873)\n* Flickan från Corsica (1862)\n* En fåfäng mans hustru (1857)\n* Fåfängans barn och andra noveller (kompilation 1915)\n* För stunden (1869)\n* Författarinnan och hennes man (1864)\n* Förtalet (1851)\n* Gertruds framtidsdrömmar (1877)\n* Guld och namn (1863)\n* Han skall gifta sig (1860)\n* Hur jag fick mig hustru (1880)\n* Kvinnans triumf: livets skola (se Livets skola)\n* Livets skola (1878)\n* Den lilla gatsångerskan (1866)\n* Liten Karin (1875)\n* Mannen av börd och kvinnan av folket (1858)\n* Mathilda eller En behagsjuk kvinna (1860)\n* Mina levnadsöden (1865)\n* Mor och dotter (Följetong i DN 1870)\n* Novelletter (1861)\n* Passionerna (1853)\n* Positivspelarens son (1863)\n* Skildringar ur familjelivet (1854)\n* Skuld och oskuld (1861)\n* Sonsonen (1872)\n* Till sist (1876)\n* Tre nya berättelser (1862)\n* Tvenne familjemödrar (1859)\n* Tvenne levnadsmål (Följetong i Svenska tidningen 1855)\n* Ungdomskärlek (se Änkan och hennes barn)\n* Ungdomsminnen (1864)\n* Verklighetsbilder (1867)\n* Vilja är kunna (1860)\n* Vänd bladet (1863)\n* Växlande öden (1871)\n* [https://runeberg.org/mssadling/ Ädlingens dotter] (1860)\n* Änkan och hennes barn (1859)\n* Är mannens karaktär hans öde? (1860-1861)\n* Ögonblicksbilder (1874)\nReferences\n* Österberg, Carin; Lewenhaupt, Inga; Wahlberg, Anna Greta (1990). Svenska kvinnor: föregångare nyskapare. Lund: Signum. Libris 7767574.\n* Kolbe, Gunlög: [https://gupea.ub.gu.se/bitstream/2077/35794/2/gupea_2077_35794_2.pdf Strategier för framgång. Marie Sophie Schwartz som föregångskvinna] 2014\n* Schwartz, 2. Marie Sofie i Nordisk familjebok (andra upplagan, 1916)\nFurther reading\n*\nExternal links\n*\n*"
    }
  ]
}