{
  "content": [
    {
      "type": "text",
      "text": "# Mario Edwards\n\n| birth_place  = Clayton County, Georgia, U.S.\n| death_date   =\n| height_ft    = 6\n| height_in    = 0\n| weight_lbs   = 199\n| draftyear    = 2000\n| draftround   = 6\n| draftpick    = 180\n| high_school  = Pascagoula\n| college      = Florida State\n| teams        =\n* Dallas Cowboys (–)\n* Tampa Bay Buccaneers ()\n* Miami Dolphins ()*\n| pastcoaching =\n* W.W. Samuell High School (2009) Assistant coach\n* Billy Ryan High School (2010-2011)  Assistant coach\n* Florida State (2012–2019)Director of player development\n* Rockwall-Heath High School (2020-2025)  Head of recruiting & secondary coach\n* Mississippi Valley State University (2025-present)  Defensive passing game coordinator\n| highlights   =\n* BCS national champion (1999)\n* First-team All-ACC (1999)\n* Second-team All-ACC (1998)\n| statlabel1   = Total tackles\n| statvalue1   = 185\n| statlabel2   = Fumble recoveries\n| statvalue2   = 3\n| statlabel3   = Pass deflections\n| statvalue3   = 20\n| statlabel4   = Interceptions\n| statvalue4   = 4\n| statlabel5   = Defensive touchdowns\n| statvalue5   = 2\n| pfr          = EdwaMa20\n}}\nMario Lashun Edwards Sr. (born December 1, 1975) is an American former professional football player who was a cornerback in the National Football League (NFL) for the Dallas Cowboys, Tampa Bay Buccaneers, and Miami Dolphins. He played college football for the Florida State Seminoles and was selected in the sixth round of the 2000 NFL draft by the Cowboys.\nEarly life\nEdwards attended Pascagoula High School, where he played at cornerback. As a senior, he had 61 tackles, 4 interceptions and 14 passes defensed. He received All-American and All-state honors.\nHe accepted a football scholarship from Florida State University. As a true freshman, he totaled 6 tackles. He blocked a punt that he returned for a 24-yard touchdown against the University of North Carolina.\nAs a sophomore, he was a backup at right cornerback, tallying 14 tackles, 3 passes defensed and one fumble recovery. He missed the 1997 season as a redshirt.\nAs a junior, he started the final 10 games at left cornerback, registering 20 tackles, 6 interceptions (ranked eighth in the nation), 11 passes defensed (led the team) and helping the team earn a No. 1 national ranking in pass defense. He had 5 tackles and 3 passes defensed against the University of Southern California. He set a school and tied a conference record, by making 4 interceptions in a single-game against Wake Forest University. He played in the National Championship game, where the Seminoles lost to the University of Tennessee.\nAs a senior, he posted 19 tackles, 9 passes defensed (led the team) and one forced fumble, while being a part of the 1999 national championship team. He had 4 passes defensed against the University of Virginia. He compiled 3 passes defended in the 2000 Sugar Bowl 46–29 win against Virginia Tech.\nProfessional career\n}}\nDallas Cowboys\nEdwards was selected by the Dallas Cowboys in the sixth round with the 180th overall of the 2000 NFL draft, after he dropped because of a poor performance in the 1998 Fiesta Bowl, combined with injuries and inconsistent play in his senior season.\nAs a rookie, he played mainly on special teams, making 11 tackles (tied for fourth on the team). He suffered a strained left hamstring in the third preseason game against the Oakland Raiders, that forced him to miss the rest of the preseason and the first 4 regular season contests. In the season finale he started at left cornerback against the Tennessee Titans, making 3 tackles and one pass defensed.\nIn 2001, Edwards became the team's regular starter at left cornerback, helping the team rank third in pass defense in the NFL. He had 58 tackles (eighth on the team) and 11 passes defensed (led the team), contributing to the defense statistically ranking number four overall in the NFL. He returned his first career interception 71 yards for a touchdown in the seventh game against the New York Giants.\nIn 2002, he registered 72 tackles (eighth on the team), 2 interceptions (third on the team) and 8 passes defensed (tied for fourth on the team). In 2003, he started all 16 games at right cornerback, contributing to the defense statistically ranking number one overall in the NFL. He missed one game with a quad contusion. He had 6 tackles and one pass defensed against the Tennessee Titans. He made 6 tackles and one pass defensed against the Arizona Cardinals. He had 10 tackles and one fumble recovery against the Jacksonville Jaguars. He made 2 interceptions and 3 passes defensed in the twelfth game against the Washington Redskins.\nIn 2003, he started all 16 games, recording 45 tackles (ninth on the team), one quarterback pressure, one interception and 8 passes defensed. While with the Cowboys, he started 47 games, posting 178 tackles, 4 interceptions (2 returned for touchdowns) and 28 passes defensed.\nTampa Bay Buccaneers\nOn April 9, 2004, Edwards signed with the Tampa Bay Buccaneers as a free agent. He played in 15 games with 3 starts when the team opened in a nickel defense, while collecting 22 tackles and no interceptions. On March 1, 2005, he was released for salary cap reasons.\nMiami Dolphins\nOn April 4, 2005, he signed with the Miami Dolphins, to provide depth after Patrick Surtain was traded to the Kansas City Chiefs. He was waived prior to the start of the season on September 4.\nNFL career statistics\n{| class=\"wikitable mw-collapsible mw-collapsed\"\n! colspan=\"2\"| Legend\n|-\n| Bold\n| Career high\n|}\nRegular season\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n!rowspan=\"2\"| Year\n!rowspan=\"2\"| Team\n!colspan=\"2\"| Games\n!colspan=\"5\"| Tackles\n!colspan=\"5\"| Interceptions\n!colspan=\"4\"| Fumbles\n|-\n! GP !! GS !! Cmb !! Solo !! Ast !! Sck !! TFL !! Int !! Yds !! TD !! Lng !! PD !! FF !! FR !! Yds !! TD\n|-\n! 2000 !! DAL\n| 11 || 1 || 10 || 10 || 0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 2 || 0 || 0 || 0 || 0\n|-\n! 2001 !! DAL\n| 16 || 15 || 49 || 42 || 7 || 0.0 || 2 || 1 || 71 || 1 || 71 || 7 || 0 || 1 || 2 || 0\n|-\n! 2002 !! DAL\n| 15 || 15 || 57 || 53 || 4 || 0.0 || 2 || 2 || 29 || 0 || 29 || 9 || 0 || 1 || 0 || 0\n|-\n! 2003 !! DAL\n| 16 || 16 || 42 || 37 || 5 || 0.0 || 0 || 1 || 27 || 1 || 27 || 9 || 0 || 0 || 0 || 0\n|-\n! 2004 !! TAM\n| 15 || 3 || 27 || 22 || 5 || 0.0 || 0 || 0 || 0 || 0 || 0 || 4 || 0 || 1 || 0 || 0\n|-\n! colspan=\"2\"| !! 73 !! 50 !! 185 !! 164 !! 21 !! 0.0 !! 4 !! 4 !! 127 !! 2 !! 71 !! 31 !! 0 !! 3 !! 2 !! 0\n|}\nPlayoffs\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n!rowspan=\"2\"| Year\n!rowspan=\"2\"| Team\n!colspan=\"2\"| Games\n!colspan=\"5\"| Tackles\n!colspan=\"5\"| Interceptions\n!colspan=\"4\"| Fumbles\n|-\n! GP !! GS !! Cmb !! Solo !! Ast !! Sck !! TFL !! Int !! Yds !! TD !! Lng !! PD !! FF !! FR !! Yds !! TD\n|-\n! 2003 !! DAL\n| 1 || 1 || 5 || 4 || 1 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0\n|-\n! colspan=\"2\"| !! 1 !! 1 !! 5 !! 4 !! 1 !! 0.0 !! 0 !! 0 !! 0 !! 0 !! 0 !! 0 !! 0 !! 0 !! 0 !! 0\n|}\nCoaching career\nIn 2009, he was an assistant football coach at W. W. Samuell High School in Dallas, Texas. From 2010 to 2012, he was an assistant football coach at Billy Ryan High School in Denton, Texas. From 2012 to 2019, he was the director of player development for the Florida State football program. In 2020, he was hired to be a secondary coach at North Forney High School in Forney, Texas.\nPersonal life\nEdwards's son, Mario Jr., also played for Florida State University and like his father, won a national championship with the Seminoles. He currently plays defensive end for the Houston Texans of the NFL. He is also the father of Dalen, Angel, and Gianni Edwards.\nReferences\n[https://gofalconathletics.com/nf-boys-coaching-staff/ External] links\n* [https://seminoles.com/staff/mario-edwards/ Florida State profile]\n* [https://news.google.com/newspapers?nid=1310&dat=20000723&id=OldWAAAAIBAJ&sjid=8-sDAAAAIBAJ&pg=6749,6653043 Flashy Rookie Makes Sure Cowboys Don't Forget Deion]"
    }
  ]
}