{
  "content": [
    {
      "type": "text",
      "text": "# Marie of Luxembourg, Queen of France\n\n| reign           = 21 September 1322 – 26 March 1324\n| coronation      = 15 May 1323\n| spouse          = Charles IV of France\n| issue           =\n| house           = Luxembourg\n| father          = Henry VII, Holy Roman Emperor\n| mother          = Margaret of Brabant\n| birth_date   = 1304\n| birth_place  =\n| death_date   = 26 March\n| death_place  =\n| burial_place =Montargis\n}}\nMarie of Luxembourg (1304 &ndash; 26 March 1324) was Queen of France and Navarre as the second wife of King Charles IV and I.\nShe was the daughter of Henry VII, Holy Roman Emperor and Margaret of Brabant. Her two siblings were John of Luxembourg and Beatrice of Luxembourg, Queen of Hungary.\nLife\nMarie was betrothed in 1308 to Louis of Bavaria, son and heir to Rudolf I, Duke of Bavaria. The engagement was agreed on soon after Marie's father Henry became King of the Romans; Rudolf had been a supporter of her father during the struggle for power. It ended due to the death of Louis around 1311. During the same year, Marie's mother Queen Margaret died whilst travelling with Henry in Genoa.\nOn 21 September 1322 in either Paris or Provins Marie married to Charles IV of France following the annulment of his first marriage to the adulterous Blanche of Burgundy. Blanche had given birth to two children, Philip and Joan, but both of them died young and Charles needed a son and heir to carry on the House of Capet.\nOn 15 May 1323 Marie was consecrated Queen of France at Sainte-Chapelle by Guillaume de Melum, Archbishop of Sens. In the same year she became pregnant, but she later miscarried a girl. Whilst pregnant again in March 1324, Marie was travelling to Avignon with King Charles to visit the pope when she fell out of the bottom of the coach. As a result, she went into labour and her child, a boy (Louis), was born prematurely, and died several hours later; Queen Marie died on 26 March 1324 and was buried at Montargis in the Dominican church. Following her death Charles married Jeanne d'Évreux, but failed to father a son, so the direct House of Capet was succeeded by its branch, the House of Valois.\nReferences\nSources\n*\n|-"
    }
  ]
}