{
  "content": [
    {
      "type": "text",
      "text": "# Marjorie McIntosh (historian)\n\n| birth_place       = Ann Arbor, Michigan\n| death_date        =\n| death_place       =\n| death_cause       =\n| resting_place     =\n| resting_place_coordinates =\n| other_names       =\n| nationality       = American\n| education         =\n| alma_mater        =Radcliffe College (B.A.)Harvard University (M.A., Ph.D)\n| occupation        =Historian\n| awards            =\n| spouse            =\n| partner           =\n| children          =\n| signature         =\n| signature_alt     =\n}}\nMarjorie Keniston McIntosh (born 15 November 1940) is an American historian of Great Britain.\nLife and work\nMcIntosh was born in Ann Arbor, Michigan, on 15 November 1940. She graduated from Radcliffe College in 1962 with a B.A. degree magna cum laude in European history. The following year she received a M.A. in English history from Harvard University. McIntosh studied at the Institute of Historical Research in London, England, in 1965–66 and was awarded her Ph.D. in Tudor/Stuart history by Harvard in 1967.\nMcIntosh was appointed assistant professor of history at the University of Colorado in 1979, promoted to associate professor seven years later, and to full professor in 1992. McIntosh received a Guggenheim Fellowship in 1995. Prior to retiring from the university in 2006, McIntosh was named a distinguished professor in history.\nShe founded the Center for British and Irish Studies at the University of Colorado at Boulder and served as its first executive director.\nMcIntosh is the organizer and principal coordinator of the Boulder County Latino History Project, a community-based study of a century of Latino participation, based largely on oral history interviews and with much of the research done by Latino teen/youth interns in Boulder, Colorado between January, 2013 and the present. In addition to helping to create the Boulder County Latino History Project and preparing material for its website, she is now engaged with the Project’s work with K-12 teachers.\nAdditionally, McIntosh spent several working summer sabbaticals in Uganda, where she served as Visiting Lecturer in the Department of Women and Gender Studies at Makerere University, Kampala, Uganda, East Africa in 2002–03. She later taught, organized, and trained students at another local university to conduct a historical study based on interviews and photo documentation of Muslims living in villages on the slopes of Mt. Elgon, Uganda. That study was conducted beginning in 2008 by students at the Islamic University in Uganda and continued over the following few years.\nMcIntosh has published numerous books:\n* A Community Transformed: The Manor and Liberty of Havering, 1500–1620, Cambridge University Press, 1991\n* Controlling Misbehavior in England, 1370–1600, Cambridge University Press, 1998\n* Autonomy and Community: The Royal Manor of Havering, 1200–1500, Cambridge University Press, 2002.\n* Order, Control, and Regulation of Behavior in English Communities, 1350–1600\n* Working Women in English Society, 1300–1620, Cambridge University Press, 2005\n* Poor Relief in England, 1350–1600, Cambridge University Press, 2011\n* Poor Relief and Community in Hadleigh, Suffolk 1547-1600, University Of Hertfordshire Press, 2013\n* Women, Work & Domestic Virtue in Uganda, 1900–2003, with Grace Bantebya-Kyomuhendo, Ohio University Press, 2007\n* Yoruba Women, Work, and Social Change, Indiana University Press, 2009\n* Latinos of Boulder County, Colorado, 1900-1980, Volume I: History and Contributions, Old John Publishing, 2016\n* Latinos of Boulder County, Colorado, 1900-1980, Volume II: Lives and Legacies, Old John Publishing, 2016\nShe has also contributed chapters to several anthologies:\n* The Law and Social Change, edited by J. A. Guy, Royal Historical Society (London, England), 1984\n* Bodies and Disciplines: Intersections of History and Literature in Fifteenth-Century England, edited by Barbara Hanawalt and David Wallace, University of Minnesota Press (Minneapolis, MN), 1996\n* The Locus of Care: Families, Communities, Institutions and the Provision of Welfare since Antiquity, edited by Peregrine Horden and Richard M. Smith, Routledge (London, England), 1998.\nScholarly articles written by McIntosh have been published in such scholarly and academic journals as\n* Speculum\n* Proceedings of the American Philosophical Society\n* Essex Archaeology and History\n* Economic History Review\n* Journal of Family History\n* Albion\n* Journal of British Studies\n* Huntington Library Quarterly.\nHonors and awards\n* Harvard Graduate fellow, 1962–64\n* Frank Knox Memorial Traveling Fellow, 1965–66\n* Howard Foundation Fellow, Brown University, 1976–77\n* National Endowment for the Humanities Research Fellow, 1983–84\n* Dean's Writing Prize, University of Colorado at Boulder, 1985, 1988\n* Arts and Humanities Writing Award, University of Colorado at Boulder, 1989\n* President's Award for Outstanding Service, University of Colorado, 1990\n* Essex Book Award, 1991, for A Community Transformed: The Manor and Liberty of Havering, 1500–1620\n* Robert L. Stearns Award for Extraordinary Achievement, University of Colorado at Boulder, 1995\n* Excellence in Teaching Award, Boulder Faculty Assembly, University of Colorado, 1995\n* John Simon Guggenheim Memorial Foundation Fellow, 1995–96\n* University of Colorado grants, 1998–99, 2002–03, 2004.\nMcIntosh was elected a Fellow of the Royal Historical Society.\nFamily\nMcIntosh is married to J. Richard McIntosh, distinguished professor emeritus in molecular, cellular, and developmental biology at the University of Colorado at Boulder. They have two sons and one daughter.\nReferences\n*"
    }
  ]
}