{
  "content": [
    {
      "type": "text",
      "text": "# Marmor, Queensland\n\n| pop                 = 208\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4702\n| area                = 138.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 43.9\n| dir1                = SW\n| location1           = Rockhampton\n| dist2               = 63.9\n| dir2                = NW\n| location2           = Gladstone\n| dist3               = 588\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Rockhampton Region\n| stategov            = Mirani\n| fedgov              = Flynn\n| maxtemp             =\n| maxtemp_footnotes   =\n| mintemp             =\n| mintemp_footnotes   =\n| rainfall            =\n| rainfall_footnotes  =\n| near-n              = Port Alma\n| near-ne             = The Narrows\n| near-e              = Raglan\n| near-se             = Raglan\n| near-s              = Raglan\n| near-sw             = Bajool\n| near-w              = Bajool\n| near-nw             = Bajool\n}}\nMarmor is a rural town and locality in the Rockhampton Region, Queensland, Australia. In the , the locality of Marmor had a population of 208 people.\nGeography\nMarmor is approximately  south of the city of Rockhampton. It is bounded to the north by the salt lakes of Port Alma and to the east and south-east by Raglan Creek and its tributary Horrigan Creek. The town is in the north-west of the locality.\nThe Bruce Highway enters the locality from the east (Raglan), bypasses immediately south-west of the town and exits to the north-west (Bajool). The North Coast railway line enters the locality from the east (Raglan) immediately north of the highway, passes through the centre of the town, and then exists to the north-west (Bajool) immediately north of the highway, with the locality being served by the following stations:\n* Toonda railway station (now abandoned) ()\n* Marmor railway station ()\n* Sisalana railway station (now abandoned) ()\nToonda is a neighbourhood with the locality ().\nHistory\nThe town/locality takes its name from the Marmor railway station, which was called Marmor being the Latin word for marble, which is found in the district.\nThe Marmor Provisional School opened on 6 November 1906. It became a State School on 1 January 1909. It is located on Rogers Road ().\nMarmor Post Office opened by October 1906 (a receiving office in the area had been open from 1883, earlier known as San Jose, then Toonda) and closed in 1982.\nThe Marmor School of Arts opened circa December 1908.\nOn Sunday 6 November 1910, Bishop James Duhig officially opened and dedicated St Ita's Catholic Church. The church is in the Gothic style and was built by Messrs Neumann and Coker from the design of architect E.M. Hockings of Rockhampton. The church has a single nave , a transept  which has two vestries each , and a spacious vestibule.\nOn Thursday 16 November 1911, a United church was opened in Marmor, provided by the Mount Morgan Gold Mining Company. The church which was next door to the School of Arts could seat 100 people and was available for any Protestant denomination to hold their services, which were currently being held in private homes.\nIn August 2004, the town received funding of $1772.50 from the Australian Government's Saluting Their Service program to construct a war memorial in the Marmor Memorial Park as a focal point for annual Anzac Day commemorations.\nThere are a number of former churches in Marmor, including\n* St Faith the Virgin Mary Anglican Church, 20 Rogers Street () It closed circa 2013 and was sold into private ownership in December 2018 for $110,000.\n*St Ita's Catholic Church, 17 Tynan Street ()\n*Marmor Uniting Church, Rogers Street\nDemographics\nIn the , the locality of Marmor had a population of 205 people.\nIn the , the locality of Marmor had a population of 212 people.\nIn the , the locality of Marmor had a population of 208 people.\nEconomy\nThe Marmor Limestone Mine has its own limestone kiln and processing plant. It is at 435 Sisalana Road (). In the early 1900s, the mine's purpose was to supply lime to Mount Morgan, which was transported on the North Coast railway line. However, now the lime is mainly used in agricultural application, such as correcting soil acidification.\nEducation\nMarmor State School is a government primary (Prep-6) school for boys and girls at Rogers Street (). In 2018, the school had an enrolment of 13 students with 3 teachers (2 full-time equivalent) and 4 non-teaching staff (2 full-time equivalent).\nThere is no secondary school in Marmor. The nearest government secondary school is Mount Larcom State School (to Year 10) in Mount Larcom to the south-east. The nearest government secondary school to Year 12 is Rockhampton State High School in Wandal, Rockhampton to the north-west.\nAmenities\nMarmor Police Station is at 27 Rogers Street ().\nThe Marmor branch of the Queensland Country Women's Association meets at 46 Westacott Street ().\nMarmor Memorial Park is at 29 Tynan Street (). It has picnic facilities and a playground.\nReferences\nFurther reading\n*\n*\nExternal links\n*\n*"
    }
  ]
}