{
  "content": [
    {
      "type": "text",
      "text": "# Maroon War Memorial\n\n| location = Boonah–Rathdowney Road, Maroon, Scenic Rim Region, Queensland, Australia\n| beginning_label = Design period\n| beginning_date = 1919–1930s (interwar period)\n| built = 1920\n| built_for =\n| demolished =\n| architect = Frank Williams and Co\n| architecture =\n| owner =\n| designation1 = Queensland Heritage Register\n| designation1_offname = War Memorial & Memorial Enclosure\n| designation1_type = state heritage (built)\n| designation1_date = 21 October 1992\n| delisted1_date =\n| designation1_partof =\n| designation1_number = 600036\n| designation1_free1name = Significant period\n| designation1_free1value = 1920– (social significance)1920–1940s (historical)1920–1940s (fabric)\n| designation1_free2name = Significant components\n| designation1_free2value = memorial – soldier statue, memorial – honour board/ roll of honour, time capsule, tree groups – avenue of, flagpole/flagstaff\n| designation1_free3name = Builders\n| designation1_free3value = Frank Williams and Co\n}}\nMaroon War Memorial & Memorial Enclosure is a heritage-listed memorial at Boonah–Rathdowney Road, Maroon, Scenic Rim Region, Queensland, Australia. It was designed and built in 1920 by Frank Williams and Co. It was added to the Queensland Heritage Register on 21 October 1992.\nHistory\nThe Maroon War Memorial was constructed and unveiled in the grounds of the Maroon State School in 1920, to honour and memorialise the men from the Maroon district who had served in the armed forces during World War I (1914–1918).\nMaroon in 1920 was a farming district in the Burnett Creek catchment, extending from approximately  south of Boonah southwest to the Queensland-New South Wales border. The district was taken up for pastoral settlement in the early 1840s, when the  Melcombe run was established in 1843 by WO Haly. The lease on this run changed hands a number of times in the ensuing decade, until acquired by James Carden Collins in 1853. Collins' wife changed the name of the run to Marroon (now spelt Maroon), which is derived from the indigenous name for Mt Maroon, \"Murrun\", which means \"sand goanna\". In 1864 Marroon was purchased by Thomas Lodge Murray-Prior and a substantial proportion of this land was retained by the Murray-Prior family for nearly half a century.\nIn the late 1880s, following the opening in 1887 of the extension of the branch railway south from Ipswich to Dugandan,  south of what later became the town of Boonah, part of Maroon run was resumed and surveyed for closer agricultural settlement. As a consequence of the subsequent influx of farming families into the district, the Maroon Provisional School was established on the Maroon flats in 1891. In a farming community without a town centre, the Maroon school soon became a district focus.\nIn 1914 the remaining  of Maroon Station was subdivided into 27 dairy farms, which then were sold at public auction.\nAt the outbreak of war in Europe in August 1914 Maroon was a small, isolated agricultural community without an urban focus, engaged principally in dairying. Forty-two men from the 35 families resident in the district enlisted and of these, 17 made the supreme sacrifice. This represented a mortality rate for the Maroon community of approximately 40%, compared with the average nationally of 20%.\nMaroon was not alone in experiencing the devastating impact of this war. Australia-wide, over 300,000 volunteers from a national population of 4 million served overseas and one fifth, approximately 60,000, made the supreme sacrifice. Virtually every community in every state was affected in some fashion by the \"war of attrition\" in Europe and Asia Minor.\nIn the aftermath of the war, and in some instances prior to the cessation of hostilities, memorials honouring those who served in the war were erected in nearly every city, town and community in Australia. They were the expression of a grateful and grieving nation. Maroon was no exception. In 1919 a local committee (composed principally of the local Maroon school committee members) was formed to raise funds by public subscription for a memorial and honour stone to express the community's gratitude to the men from the district who had served during the Great War. In September 1919 the committee requested permission from the Department of Public Instruction to erect a memorial, flagpole and honour avenue of trees within the Maroon State School grounds.\nThe memorial committee commissioned the Ipswich firm of F Williams & Co., sculptors and stonemasons, to design, sculpt and construct the memorial. This firm was established at Ipswich in 1901. Its founder, Frank Williams, promoted the use of local marble and became noted for his ecclesiastical marblework in the Ipswich and Darling Downs areas. In the wake of the Great War, Williams designed a significant number of war memorials in southeast Queensland, including \"digger\" statues at Ipswich's Western Suburbs (1917), Mount Alford (1918), Booval (1919), Bundamba (1919), Boonah (1920), Maroon (1920), Oxley (1920) and Toombul Shire (1921). Williams also designed the mausoleum and Weeping Mother Memorial at Gatton (), obelisks at Toogoolawah (1917) and West Ipswich (1917) and a stone honour board at Colinton (1918).\nThe design for the Maroon War Memorial consisted of a \"digger\" statue atop a tall column, which in turn rested on a substantial pedestal and plinth. The whole was executed in sandstone, with Queensland marble inscription panels, and stood  in height. The cost of the monument () plus foundations and extras, totalled . A surrounding timber fence was constructed by voluntary labour.\nAfter the war General Sir William Birdwood, who had commanded the Australian Imperial Force during the war, toured many Australian and New Zealand communities, honouring both those who had made the supreme sacrifice and returned soldiers. During his tour General Birdwood unveiled the Maroon War Memorial on 21 May 1920 and presented Maroon Patriotic Committee medals to 14 of the district's returned servicemen.\nAt a later date an honour board was added to the memorial to honour the 42 men and women of the district who served during World War II.\nThe Maroon War Memorial remains the focus for annual Anzac Day commemorations and maintenance of the memorial and enclosure is undertaken by local volunteers. Repairs are funded by an Anzac Day collection.\nOn 21 September 1991 a time capsule was placed at the base of the memorial to celebrate the centenary of the Maroon State School, 1891–1991.\nDescription\nThe Maroon War Memorial is located within a small enclosure just inside the grounds of Maroon State School on the Maroon flats, along the Boonah-Rathdowney Road in southeast Queensland. The memorial is a tall structure composed of a sandstone pedestal, column and \"digger\" statue, resting on a stepped concrete plinth.\nThe sandstone pedestal is substantial. It has a two-tiered base on which rests a narrower 4-sided shaft with decorative flanking scrolls. Tall marble plaques are attached to the front (north) and back (south) faces of the shaft. The front plaque contains an honour roll bearing the names of the 42 local men who served in World War I. Beneath this, on the lowest tier of the pedestal, is another plaque bearing the names of the 42 local men and women who served in World War II. The plaque on the back face of the shaft bears the inscription: 'This memorial was erected by the residents of Maroon as a tribute of gratitude and respect to the local volunteers in the Great War 1914–19.'\nAttached to the lowest tier of the pedestal, on separate faces, are two small oblong marble plaques with the inscriptions: \"Unveiled by General Sir William Birdwood, May 21, 1920\" and \"Time capsule placed 21-9-91 commemorating the Maroon State School centenary 1891–1991\". With the exception of the latter, the other commemorative inscriptions are leaded.\nAbove the pedestal a small plinth with the carved lettering \"King & Empire\" on the front face supports a tall, plain column which in turn supports the statue of an Australian infantry soldier or \"digger\", standing at ease in a pose favoured by sculptor Frank Williams in his war memorial \"digger\" statues. A carved tree stump immediately behind the left leg, often seen in soldier figure memorials, appears to be a structural device to give stability to the standing figure. The statue is lifelike but slightly smaller than life-size.\nWithin the enclosure there is a concrete path leading toward the memorial and some tree plantings. Two small but mature trees, possibly Cupressus sp., flank the path and frame the approach to the memorial. Pines or Cypresses traditionally are associated with first world war memorials, symbolising the August 1915 battle of Lone Pine Ridge, one of the most savage in the Gallipoli campaign.\nA tall metal flagstaff is located directly behind the memorial, within the enclosure. A perimeter fence of extruded galvanised iron pipe has replaced an earlier timber fence and is not of cultural heritage significance. Mount Maroon towers in the distance to the southeast and forms a dramatic visual background to the memorial.\nHeritage listing\nThe Maroon War Memorial & Memorial Enclosure was listed on the Queensland Heritage Register on 21 October 1992 having satisfied the following criteria.\n'''The place is important in demonstrating the evolution or pattern of Queensland's history.'''\nMaroon War Memorial is important in demonstrating part of the pattern of Queensland's history, being associated with the national outpouring of grief at the loss of 60,000 Australians during the Great War of 1914–1918. During an era of strong and widespread Australian patriotism and nationalism most Queensland communities erected a public memorial to honour local participation in the war. Each monument is a unique historical documentary record and as a group, first world war memorials, especially those with \"digger\" statues, are demonstrative of popular taste in the period. The Maroon War Memorial is of particular interest for its dominating scale and presence in the landscape, a reflection of the magnitude of the loss suffered in the Maroon district. It is also exemplifies the work of Ipswich stonemason and sculptor, Frank Williams, who designed and constructed a significant number of southeast Queensland World War I memorials.\nThe place is important in demonstrating the principal characteristics of a particular class of cultural places.\nThe Maroon War Memorial is important in demonstrating the principal characteristics of its class of cultural places, being a substantial and highly intact commemorative structure erected as an enduring record of a major historical event. This is achieved through the use of appropriate materials and design elements.\nThe place is important because of its aesthetic significance.\nThe setting of the memorial enclosure within the grounds of the local school and fronting the Boonah-Rathdowney Road emphasises the social and landmark (aesthetic) significance of the place.\nThe place has a strong or special association with a particular community or cultural group for social, cultural or spiritual reasons.\nThe Maroon War Memorial and Enclosure is of social and spiritual significance for the local community, having a strong and continuing association with that community as evidence of the impact of a major historical event and as the focus for annual remembrance of that event in local Anzac Day commemorative ceremonies.\nSee also\n*Maroon State School and Maroon War Memorial\nReferences\nAttribution\nExternal links"
    }
  ]
}