{
  "content": [
    {
      "type": "text",
      "text": "# Marszałkowska Street, Warsaw\n\nMarszałkowska Street (Polish: ulica Marszałkowska), also known by its English name Marshal Street, is one of the main thoroughfares of Warsaw, Poland, located in the district of Śródmieście. It runs along the north–south axis, from Bank Square in the north to the Union of Lublin Square in the south.\nHistory\nContrary to a common urban legend that attributes the name to Marshal of Poland Józef Piłsudski, the street's name actually relates to 18th-century Grand Marshal of the Crown Franciszek Bieliński.\nMarszałkowska street was established by Franciszek Bieliński and opened in 1757. It was much shorter then, running only from Królewska Street to Widok Street.\nThe street was almost entirely destroyed during the Warsaw Uprising of 1944. Rebuilding of Warsaw after World War II coincided with emergence of socialist realism, which greatly influenced the surrounding urban architecture.\nGallery\nHistorical images\nFile:Warszawa - Marszałkowska1867.jpg|Marszałkowska Street in 1867\nFile:Warszawa. Ul. Marszalkowska. 191- (67220595) (cropped).jpg|General view in about 1912\nFile:Bundesarchiv Bild 183-2008-0415-508, Warschau, Luftaufnahme, Zerstörungen.jpg|Warsaw during World War II: destroyed townhouses between Zielna (top) and Marszałkowska streets (bottom). In bottom right corner building Marszałkowska 156 on the corner with Królewskia street, also visible Bloch Palace at Marszałkowska 154. September 1939\nFile:Warsaw during WWII - Rondo Dmowskiego.jpg|Intersection of Marszałkowska Street and Aleje Jerozolimskie (Jerusalem Avenue) in Warsaw during German occupation. Visible tramway #3 with a billboard \"Kamea woda kwiatowa\". Behind it ruins of destroyed in 1939 townhouse at Marszałkowska 98/al. Jerozolimskie 33 streets.\nFile:Polish Army Parade waf-2012-1502-29 (1945).jpg|Shortly after the war, January 19, 1945. 1st Polish Army of the East Marszałkowska Street Warsaw\nFile:Zamboni Brothers Tenement.png|Zamboni Brothers Tenement built in 1894.\nFile:2 Marszałkowska Street in Warsaw, 2021.jpg|Juda Wielburski Tenement (aka Potempski Tenement) at the intersection of 2 Marszałkowska and 1 Szucha. Survived the War.\nFeatures (before the war)\nImage:OldWarsaw4.jpg|Insurance Company \"Rosja\" in 1901\nImage:Warszawa - Marszałkowska 1904.jpg|Herse Tenement in 1904\nImage:Warszawa-Marszałkowska-1914.jpg|Rothberg Tenement in 1914\nImage:Warszawa-Marszałkowska1914.jpg|Marszałkowska in 1914\nSee also\n* Henryk Poddębski\nReferences\nExternal links\n* [https://web.archive.org/web/20080918094658/http://www.starawarszawa.pl/old/ Marszałkowska in 19th century]"
    }
  ]
}