{
  "content": [
    {
      "type": "text",
      "text": "# Martin Edwards (author)\n\n| birth_place   = Knutsford, Cheshire, England\n| death_date    =\n| death_place   =\n| resting_place =\n| occupation    = Solicitor\n| education     =\n| alma_mater    = Balliol College, Oxford University\n| period        =\n| genre         = Crime novels\n| subject       =\n| movement      =\n| notableworks  =\n| spouse        = Helena Shanks\n| partner       =\n| children      =\n| relatives     =\n| influences    =\n| influenced    =\n| awards        =\n| signature     =\n| signature_alt =\n| website       =\n| portaldisp    =\n}}\nKenneth Martin Edwards (born 7 July 1955) is a British crime novelist, whose work has won multiple awards including lifetime achievement awards for his fiction, non-fiction, short fiction, and scholarship in the UK and the United States. In addition to translations into various European languages, his books have been translated into Japanese, Chinese, Korean, and Taiwanese. As a crime fiction critic and historian, and also in his career as a solicitor, he has written non-fiction books and many articles. He is the current President of the Detection Club  and in 2020 was awarded the Crime Writers' Association's Diamond Dagger, the highest honour in British crime writing, in recognition of the \"sustained excellence\" of his work in the genre.\nBiography\nMartin Edwards was born in Knutsford and educated in Cheshire (at Sir John Deane's Grammar School, where one of his teachers was Robert Westall, who later became a successful children's author) and at Balliol College, where he took a first-class honours degree in jurisprudence in 1977. He qualified as a solicitor in 1980 and joined the firm of Mace & Jones, where he became a partner in 1984, and head of employment law in 1990, becoming chair of the employment law practice in 2011, when the firm merged with Weightmans LLP. After spending three years with Weightmans as a partner, he is now a consultant. In 1988, he married Helena Shanks and they have two children, Jonathan and Catherine. He is well-known for his expertise on crime fiction and in other fields. He has taken part in Criminal Mastermind at two Bouchercon conventions, in 1990 and 1995, and at two CrimeFest conventions, in 2009 and 2010, winning on three occasions and finishing as runner-up once. In 2022, he captained the Balliol College team which became series champions in Christmas University Challenge 2022, the final series hosted by Jeremy Paxman.\nCrime fiction\n“Martin Edwards has earned distinction in every area of the crime-fiction field\", said ''Ellery Queen's Mystery Magazine in July 2016. Four years later, the Crime Writers’ Association named him as the recipient of the Diamond Dagger in recognition of the sustained excellence of his work coupled with his significant contribution to crime writing published in the English language, and Ian Rankin said ‘His novels feature an acute sense of place as well as deep psychological insights.’ His latest novel is Sepulchre Street. Like Gallows Court, Mortmain Hall and Blackstone Fell, the story features Rachel Savernake and is set in the early 1930s. Lee Child described Gallows Court as ‘Superb... the book Edwards was born to write’, and in 2019 the novel was longlisted for the CWA Historical Dagger and shortlisted for the eDunnit award for best hardback and ebook novel of the year. In December 2023, Martin Edwards was voted Best Newcomer for the Japanese translation of Gallows Court by a panel of 51 experts for Hayakawa Mystery Magazine. Blackstone Fell was longlisted for the CWA Historical Dagger in 2023.\nHis first novel, All the Lonely People, introduced Liverpool lawyer Harry Devlin and was published in 1991, earning a nomination for the John Creasey Memorial Dagger for best first crime novel of the year. In 2012 the book was republished by Arcturus in its series of Crime Classics, while Yesterday's Papers was reissued as an Arcturus Crime Classic in 2013. To date, Edwards has written eight novels about Devlin; the most recent is Waterloo Sunset. The Coffin Trail was the first of eight books set in the Lake District (The Lake District Mysteries) featuring Detective Chief Inspector Hannah Scarlett and historian Daniel Kind; it was short-listed for the Theakston's Old Peculier Award for best crime novel of 2006. The Arsenic Labyrinth was short-listed for the Lakeland Book of the Year Award in 2008. Edwards has also written a stand-alone novel of psychological suspense, Take My Breath Away, and completed The Lazarus Widow by the late Bill Knox. 2008 also saw the publication of his first historical novel, Dancing for the Hangman, a fictional account of the life and misadventures of Hawley Harvey Crippen. Writing in Historical Noir, Barry Forshaw said it was “a book to make readers wish that the versatile Edwards might tackle the historical crime genre more often.”\nEdwards has written over 80 short stories, which have appeared in a wide range of magazines and anthologies, and he has edited the Crime Writers' Association's annual crime anthology since 1996. His early stories were collected in Where Do You Find Your Ideas? and other stories, which had an introduction by Reginald Hill. Edwards won the CWA Short Story Dagger in 2008 with 'The Bookbinder's Apprentice' and has also been shortlisted three times for the same Dagger with 'Test Drive', 'Murder and its Motives' and 'Strangers in a Pub' in 2005, 2017, and 2019 respectively. In 2014, he was the inaugural winner of the CWA Margery Allingham Prize for his story 'Acknowledgments.' In 2021 he was commissioned by Mysterious Bookshop of New York City to contribute to a series of limited edition Bibliomysteries; the result was The Traitor. In 2023, he received a further commission to write a Christmas story, ‘End Game’, for customers of the Mysterious Bookshop. In the same year, he became the second British writer, after Ruth Rendell, to be awarded the Edward D. Hoch Memorial Golden Derringer Award by the Short Mystery Fiction Society, in recognition of his lifetime achievement in the field of the short story.\nIn 2018, Edwards won the CWA Dagger in the Library, which recognises “a body of work by a crime writer that users of libraries particularly admire”. He was a founder member of the Northern Chapter of the Crime Writers' Association and of the Murder Squad collective of crime writers. He became Vice Chair of the CWA in 2015 and became Chair of the CWA in 2017. In 2007, Edwards was appointed Archivist of the Crime Writers' Association, and in 2011 the CWA gave him a Red Herring Award in recognition of his services to the Association. In 2008, he was elected to membership of The Detection Club and in 2011 he was appointed its first archivist. Four years later in 2015, he became the eighth president of the club, succeeding Simon Brett. He is the only person to have held the offices of President of the Detection Club and Chair of the CWA at the same time. He served as Chair of the CWA from January 2017 to April 2019, making him the longest-serving Chair since the CWA's founder, John Creasey.\nThere has been increasing critical interest in and appreciation of Edwards' work, and his skill in marrying people and places with plot. In 2012, new ebook and print editions of the early Harry Devlin novels were published, including introductions by writers such as Val McDermid, Peter Lovesey, Andrew Taylor and Frances Fyfield. In her foreword to All the Lonely People, Fyfield said: \"What distinguishes this book and those that follow and what makes them classics of a kind is this marvellous quality of compassion and the celebration of all that is heroic in the corrupted ordinary.\" In The Mammoth Encyclopaedia of Modern Crime Fiction, Mike Ashley noted that the author's legal knowledge 'provides a solid reliability to the Devlin books, but their strength lies in the evocation of Liverpool both past and present'. Similarly, Russell James noted in Great British Fictional Detectives that the Devlin books 'are all solid and well-informed'. In Scene of the Crime, Julian Earwaker and Kathleen Becker described the Devlin series as 'a blend of classic detection and urban noir', pointing out that 'The bleaker tones of the early books...are superseded by the lighter tone and more complex plotting of the later novels.' In Whodunit?, Rosemary Herbert said that 'Edwards rapidly made a name for himself as a writer whose law expertise informs fiction set in a well-drawn Liverpool...Edwards' work as an anthologist is highly regarded.' In Crime Scene: Britain and Ireland, John Martin said that Edwards has \"written two superbly crafted series of crime novels...intricately plotted with subtle twists and turns.\" Professor Douglas G. Greene, a leading expert on the genre writing in the magazine CADS, described Edwards as “a major detective novelist who has combined Golden Age trickiness in plotting with modern darkness in the telling.”\nIn Brit Noir, Barry Forshaw said: “He is one of the UK’s premier crime fiction anthologists, as well as being a noted expert on the Golden Age...Edwards’ own two crime fiction series...have proved to be both critically and commercially successful...such books as Yesterday’s Papers offer both the diversions of crime fiction and scene-setting of a high order... The Dungeon House, the most recent in the Lake District series at the time of writing, sports Edwards' usual expertise.\" In Crime Fiction: a Reader’s Guide, Forshaw said that Gallows Court ‘pays homage to the legacy of vintage thrillers but introduces an urgency and sense of dark menace that are notably contemporary…Evocative period detail, twist-packed plotting and a fascinatingly enigmatic anti-heroine’.\nIn British Crime Writing: an encyclopaedia, Michael Jecks described him as 'a writer of imagination and flair' and as possessing 'a rare skill for acute description'. In the same volume, Philip Scowcroft praised Edwards' books set in the Lakes 'which he describes idiomatically and evocatively in a series of well-plotted mysteries'. Jecks summed him up as 'a crime writer's crime writer. His plotting is as subtle as any; his writing deft and fluid; his characterisation precise, and his descriptions of the locations give the reader the impression that they could almost walk along the land blindfolded. He brings them all to life.' Writing in The New York Times in December 2022, Sarah Weinman said: ‘Crime fiction is blessed to have Martin Edwards.\nWriting about crime fiction\nMartin Edwards is widely recognised as a leading authority on the crime fiction genre and his history of the genre, The Life of Crime: Detecting the History of Mysteries and their Creators, has been acclaimed in Britain and the United States. Reviewing the book in The Times, Christina Hardyment said; 'Martin Edwards is the closest thing there has been to a philosopher of crime writing.' The book received an Edgar award from the Mystery Writers of America, an Anthony award from Bouchercon 2024, a Macavity award from Mystery Readers International, and the CrimeFest H.R.F. Keating award; it was also shortlisted for a CWA Gold Dagger and an Agatha award. He is also the author of The Golden Age of Murder, a widely acclaimed study of the genre between the two world wars. The book won an Edgar award from the Mystery Writers of America, an Agatha award at Malice Domestic 28, and the Macavity Award from Mystery Readers International; in the UK, it won an H.R.F. Keating award at Crimefest. The book was also shortlisted for an Anthony award by Bouchercon 2016, and the CWA Gold Dagger for Non-Fiction. Marcel Berlins said in The Times: ‘Few, if any books about crime fiction have provided so much information and insight so enthusiastically and, for the reader, so enjoyably. No other work mixes genre history, literary analysis and fascinating author biographies with such relish’.  For The Guardian, Mark Lawson said it was ‘a book of impressive cultural omniscience...superbly compendious and entertaining’.  Michael Dirda said in The Washington Post that ‘Anyone who loves classic English mysteries from the 1920s through the ’40s will revel in the highly anecdotal The Golden Age of Murder.’ A significantly expanded second edition was published in 2025 to celebrate the tenth anniversary of the book's original publication.\nHe has reviewed crime novels for various publications and websites since 1987 and has written columns for print and online magazines such as Sherlock and Bookdagger. In 2017, he wrote a lengthy commentary, acclaimed as “superb” to the detective fiction reviews of Dorothy L. Sayers, which he collected in Taking Detective Stories Seriously on behalf of the Dorothy L. Sayers Society. He has contributed essays to a wide range of reference books about the genre, including The Oxford Companion to Crime and Mystery Writing. He has written introductions to new editions of a wide range of books, including The Red Right Hand by Joel Townsley Rogers, Death in the Dark by Stacey Bishop, several books in Harper Collins’ Detective Story Club series of reissues, three anthologies published by Flame Tree Press, Folio Society reprints, and novels in the Chivers Black Dagger Series such as ''The Man Who Didn't Fly'' by Margot Bennett and Cornell Woolrich's The Bride Wore Black. In 2013, he became Series Consultant to the British Library's highly successful Crime Classics series.\nHe has written introductions to most of the books published in the series, as well as for several of the books published in the British Library's Classic Thrillers series. He has been commissioned to edit and introduce more than 20 anthologies of classic crime short stories for the series. In 2016, he was commissioned to write a new solution to Anthony Berkeley's classic whodunit The Poisoned Chocolates Case and in 2017, the British Library published his The Story of Classic Crime in 100 Books, which in a starred review, Publishers Weekly described as 'an exemplary reference book sure to lead readers to gems of mystery and detective fiction'. The book was shortlisted for the Agatha, Anthony, and H. R. F. Keating awards and longlisted for the CWA Gold Dagger for Non-Fiction. Mystery Readers International gave the book the Macavity award  for best non-fiction book of the year.\nHowdunit, published in 2020, was a book he conceived and edited on behalf of the Detection Club, to celebrate its 90th birthday. The book discusses the art and craft of crime writing and the nature of the crime writer's life. Contributors range from Agatha Christie and Dorothy L. Sayers to almost every living member of the club, including John Le Carré, Ian Rankin, Val McDermid, and Alexander McCall Smith. The book won the 2021 CrimeFest H.R.F. Keating award for best biography or critical book related to crime fiction; in addition, it was nominated for five other major awards: the CWA Gold Dagger for Non-Fiction, the Edgar, the Agatha, the Macavity, and the Anthony.\nIn 2017, he received the Poirot Award at Malice Domestic 29, in recognition of his contribution to the traditional mystery genre. Writing in the Malice Domestic programme, Professor Douglas G. Greene surveyed his career and concluded: \"Martin Edwards’ contributions to detective fiction, and to writing about detective fiction, have indeed been outstanding\".\nIn 2023, he received the George N. Dove Award from the Popular Culture Association, in recognition of his outstanding contribution to the serious study of the crime genre; previous British winners have included P. D. James.\nWriting about real life crime\nEdwards has also written extensively on the subject of true crime. In addition to his study of real-life crime investigation and famous cases, Urge to Kill, he edited Truly Criminal, a CWA anthology of essays published by The Mystery Press in 2015. Edwards’ essay in the book discusses the ‘Blazing Car’ murder for which Alfred Rouse was hanged in 1931. In 2019 he contributed an essay examining the crimes of Dr Harold Shipman to The Best New True Crime Stories: Serial Killers, edited by Mitzi Szereto.\nLegal writing and career\nEdwards has written many articles and been a legal columnist for a wide range of publications including The Expatriate, Social Services Insight, and ''The Law Society's Gazette, as well as leader writer for The Solicitors' Journal for 18 months in the 1990s. He has published seven books on equal opportunities, employment law and other legal subjects. In addition to his work for employers, he has throughout his career acted for many employees, and also for organisations such as the Equal Opportunities Commission, acting as the advocate for victims of pregnancy discrimination in two major cases: Lavery v Plessey Telecommunications Ltd [1982] ICR 373 and Fewster v Ferry Casinos Ltd (1999) UKEAT 408. Originally, he established distinct reputations in the fields of employment law and commercial law; his first published book concerned legal aspects of business computer acquisition, and in 1985 he acted as legal adviser to the makers of the feature film Letter to Brezhnev''.\nSince 1990, he has specialised solely in employment law. He was a founder member of the Law Society's Standing Committee on Employment Law and he was also a member of the Law Society's Working Party on Alternative Dispute Resolution.\nEdwards regularly receives high rankings in independent legal directories such as The Legal 500 and Chambers Directory UK. He was described in 2007, for instance, in the former as 'one of the leading employment lawyers in the country', and in the latter as 'Mr. Employment'. In 2011, Chambers and Partners stated that he is \"admired for his legendary technical ability\", and added in 2012 that he has been \"roundly praised\" for his \"undoubted expertise, wealth of experience, interpersonal skills and calm approach at difficult times.\" The 2013 editions of the directories rated him as \"highly recommended\" and a \"top drawer\" employment lawyer respectively. In 2014, Chambers noted that he \"is renowned for his expertise in the field and technical proficiency\" and ranked him as Liverpool's only Band I specialist employment lawyer, a ranking he retained in 2015, when he was again recommended by Chambers In 2016, The Legal 500 described him as “first-class”. He was again recognised as one of the leading lawyers in his field in the 2017 and 2018 directories of Chambers; the former described him as \"a fantastic employment lawyer\".\nHe has acted for many high-profile clients, including the Football Association, Wembley Stadium, Alder Hey Hospital, Health and Safety Executive, Liverpool Football Club, Shell UK Ltd, North West Development Agency, North West Regional Assembly, Littlewoods Pools Ltd, Littlewoods PLC, the Forum of Private Business, Mersey Docks and Harbour Company, Merseyside Police Authority and National Museums Liverpool. In 2008, he was included in EN Magazine's list of the top 50 professional advisers in the North West and was also short-listed for the Insider Professional Liverpool Lawyer of the Year award, while in 2011 he was shortlisted by thebusinessdesk.com for an award for the leading North West professional adviser. In 2007 and 2011 his team won the bi-annual Liverpool Law Society Employment Team of the Year Award, and the team has also twice been shortlisted for the national Employment Law Team of the Year award by \"The Lawyer\" magazine. He has regularly been selected for inclusion in Best Lawyers in the United Kingdom, most recently for 2025.\nBibliography\nHarry Devlin novels\n*All the Lonely People (1991)\n*Suspicious Minds (1992)\n*I Remember You (1993)\n*Yesterday’s Papers (1994)\n*Eve of Destruction (1996)\n*The Devil in Disguise (1998)\n*First Cut is the Deepest (1999)\n*Waterloo Sunset (2008)\nLake District novels\n*The Coffin Trail (2004)\n*The Cipher Garden (2006)\n*The Arsenic Labyrinth (2007)\n*The Serpent Pool (2010)\n*The Hanging Wood (2011)\n*The Frozen Shroud (2013)\n*The Dungeon House (2015)\n*The Crooked Shore (2021) aka The Girl They All Forgot (US, 2022)\nRachel Savernake novels\n*Gallows Court (2018)\n*Mortmain Hall (2020)\n*Blackstone Fell (2022) aka The Puzzle of Blackstone Lodge (US, 2023)\n*Sepulchre Street (2023) aka The House on Graveyard Lane (US, 2024)\n*Hemlock Bay (2025)\nStand-alone novels\n*Take My Breath Away (2002)\n*Dancing for the Hangman (2008)\n*Miss Winter in the Library with a Knife (2025)\nCollaborations on novels\n*The Lazarus Widow (with Bill Knox) (1999)\n*The Sinking Admiral (with other members of the Detection Club) (2016)\n*The Poisoned Chocolates Case – epilogue (by Anthony Berkeley) (2016)\nShort story collections\n*Where Do You Find Your Ideas? and Other Stories (2001)\n*The New Mysteries of Sherlock Holmes (2014)\n*Acknowledgments and Other Stories (2014)\nNovella\n*The Traitor (2021)\nAnthologies edited\n*Northern Blood (1992)\n*Northern Blood 2 (1995)\n*Anglian Blood (with Robert Church) (1995)\n*Perfectly Criminal (1996)\n*Whydunit? (1997)\n*Past Crimes (1998)\n*Northern Blood 3 (1998)\n*Missing Persons (1999)\n*Scenes of Crime (2000)\n*Murder Squad (2001)\n*Green for Danger (2003)\n*Mysterious Pleasures (2003)\n*Crime in the City (2004)\n*Crime on the Move (2005)\n*I.D.: crimes of identity (2006)\n*The Trinity Cat and other mysteries (with Sue Feder) (2006)\n*M.O.: crimes of practice (2008)\n*Original Sins (2010)\n*Guilty Consciences (2011)\n*Best Eaten Cold (2011)\n*Deadly Pleasures (2013)\n*Guilty Parties (2014)\n*Capital Crimes (2015)\n*Truly Criminal (2015)\n*Resorting to Murder (2015)\n*Silent Nights (2015)\n*Murder at the Manor (2016)\n*Serpents in Eden (2016)\n*Crimson Snow (2016)\n*Motives for Murder (2016)\n*Miraculous Mysteries (2017)\n*Continental Crimes (2017)\n*The Long Arm of the Law (2017)\n*Foreign Bodies (2017)\n*Mystery Tour (2017)\n*Blood on the Tracks (2018)\n*Ten Year Stretch (with Adrian Muller)(2018)\n*The Christmas Card Crime (2018)\n*Deep Waters (2019)\n*The Measure of Malice (2019)\n*Settling Scores (2020)\n*Vintage Crime (2020)\n*A Surprise for Christmas (2020)\n*Guilty Creatures (2021)\n*Many Deadly Returns (2021)\n*Murder by the Book (2021)\n*Music of the Night  (2022)\n*The Edinburgh Mystery and Other Tales of Scottish Crime  (2022)\n*Final Acts  (2022)\n*Crimes of Cymru (2023)\n*Who Killed Father Christmas? and other seasonal mysteries (2023)\n*Lessons in Crime: Academic Mysteries (2024)\n*Midsummer Mysteries (2024)\n*Metropolitan Mysteries (2024)\n*Playing Dead (2025)\n*Cyanide in the Sun (2025)\n*And Then There Were More (2025)\nNon-fiction – about crime fiction\n*The Golden Age of Murder (2015)(revised and expanded second edition, 2025)\n*Taking Detective Fiction Seriously (introduction and commentary to reviews of Dorothy L. Sayers) (2017)\n*The Story of Classic Crime in 100 Books (2017)\n*Howdunit (2020)\n*This Deadly Isle: A Golden Age Mystery Map  (2022)\n*The Life of Crime: Detecting the History of Mysteries and Their Creators  (2022)(revised and expanded edition, 2024)\nNon-fiction – true crime\n*Urge to Kill (2002) (US edition; UK edition is Catching Killers; Australian edition is Motive to Murder)\nNon-fiction – other\n*Understanding Computer Contracts (1983)\n*Understanding Dismissal Law (two editions, the second as How to Get the Best Deal from Your Employer)\n*Managing Redundancies (1986)\n*Executive Survival (two editions)\n*Careers in the Law (six editions)\n*Know-How for Employment Lawyers (with others) (1995)\n*''Tolley's Equal Opportunities Handbook'' (four editions)\nReferences\nSources\n*'Martin Edwards' in The Mammoth Encyclopaedia of Modern Crime Fiction ed. Mike Ashley (2002) (Robinson)\n*Scene of the Crime by Julian Earwaker and Kathleen Becker (2002) (Aurum)\n*'Martin Edwards' in ''Whodunit?: a who's who in crime & mystery writing'' ed. Rosemary Herbert (2003) (Oxford University Press)\n*'Employment – North West' in The Legal 500 (2007 and 2013) (Legalease)\n*'Employment' in Chambers Directory UK (2007, 2011, 2012 and 2013) (Chambers)\n*'Harry Devlin' in Great British Fictional Detectives by Russell James(2008) (Remember When)\n*'The Shires: Rural England and Regional Crime Fiction'  by Philip Scowcroft in British Crime Writing: An Encyclopaedia ed. Barry Forshaw (2009) (Greenwood)\n*'Martin Edwards' by Michael Jecks, in British Crime Writing: An Encyclopaedia ed. Barry Forshaw (2009) (Greenwood)\n*[http://www.chambersandpartners.com/uk/person/7163/martin-edwards]\n*[http://www.legal500.com/firms/3496/offices/1644/lawyers/50033 Weightmans LLP > Liverpool > England | The Legal 500 law firm profiles]\nExternal links\n* [http://www.martinedwardsbooks.com Martin Edwards Books.com] – Official website\n* [http://www.murdersquad.co.uk Murder Squad]\n* [http://www.doyouwriteunderyourownname.blogspot.com Do You Write Under Your Own Name?] – Official blog, includes comment on crime novels, true crime and the craft of crime fiction."
    }
  ]
}