{
  "content": [
    {
      "type": "text",
      "text": "# Martinican Independence Movement\n\nBlack, White, Red and Yellow\n|website         = [http://www.mimmartinique.org/ Official site of the Martinican Independence Movement]\n|country=Martinique}}\nThe Martinican Independence Movement or MIM (; Martinican Creole: Mouvman endépandantis matinitjé or Mouvman endépandantis matiniké) is a left-wing political party in the overseas department of Martinique, founded July 1, 1978 by Alfred Marie-Jeanne with the aim of securing \"the decolonization and independence of Martinique\". Its secretary is the deputy and president of the Regional Council of Martinique. It has one seat in the French National Assembly.\nIn 1973, Alfred Marie-Jeanne, along with , Lucien Veilleur, and Marc Pulvar (father of Audrey Pulvar), founded an organization called \"La Parole au Peuple\" (Word to the People), which in 1978 became the Martinican Independence Movement.\nParty history\nUp until the 1990s, MIM had only limited success at the polls. Marie-Jeanne was elected to the General Council but was not re-elected. In 1983, when the first direct election for the newly established Regional Council was held, the party received only three percent of the votes, and in 1989 lost one of their two mayors.\nThe MIM is, following the French regional elections of 2004, the majority party in the regional council. Its elected representatives are Alfred Marie-Jeanne, Daniel Marie-Sainte, Lucien Veilleur, Vincent Duville, Lucien Adenet, Jean-Philippe Nilor, Sylvain Bolinois, Francine Carius, Jean-Claude Soumbo, Raymonde Téreau, Georges Buisson, Marianne Malsa, Marcel Thelcide, Michel Michalon, Lise N'Guéla, Mady Ericher, Marie-Claude Cléry, Gisèle Aribo, Alain Rapon, Laurence Gracienne, Sandrine Saint-Aimé, Yolande Philémont-Montout, Marie-Line Lesdéma, and Aurélie Dalmat.\nThe party also counts among its members two general councillors, Lucien Adenet and Jean-Philippe Nilor, and the mayor of Rivière-Pilote, Lucien Veilleur.\nIn the municipal and cantonal elections in March 2008, the MIM presented 17 at-large candidates. For the first time in its history its candidates received significant support and four were elected mayors:\n*In Rivière-Salée, Vincent Duville received 2829 votes, 46.05%\n*In Sainte-Luce, Jean-Philippe Nilor received 2374 votes, 46.63%\n*In Saint Esprit, Georges Buisson received 1619 votes, 34.87%\n*In Trois-Ilets, Lise N'Guéla received 1295 votes, 42.73%\nIn the election held on 13 December 2015, Gran Sanblé pou ba peyi an chans, a coalition of the Martinican Independence Movement and right-wing parties, defeated  , a coalition of left-wing parties,  led by Serge Letchimy, winning 33 seats out of 51 seats of the new Territorial Collectivity's assembly.\nThe MIM publishes a journal, La Parole au Peuple, and operates a radio station, R.D.L.M. (Radio Lévé Doubout Matinik).\nReferences\nExternal links"
    }
  ]
}