{
  "content": [
    {
      "type": "text",
      "text": "# Martin Goodman (historian)\n\n| birth_place        =\n| death_date         =\n| death_place        =\n| death_cause        =\n| region             =\n| nationality        = British\n| other_names        =\n| occupation         =\n| period             =\n| known_for          =\n| title              =\n| boards             =\n| spouse             =\n| children           =\n| family             =\n| awards             =\n| website            =\n| education          = B.A., Trinity College, OxfordPhD (1980) University of Oxford\n| alma_mater         =\n| thesis_title       = State and society in Roman Galilee, AD 132-212\n| thesis_url         =\n| thesis_year        = 1980\n| school_tradition   =\n| doctoral_advisor   =\n| influences         =\n| era                =\n| discipline         = History\n| sub_discipline     =\n| workplaces         =\n| doctoral_students  =\n| notable_students   =\n| main_interests     =\n| notable_works      =\n| notable_ideas      =\n| influenced         =\n| signature          =\n| signature_alt      =\n| signature_size     =\n| footnotes          =\n}}\nMartin David Goodman, FBA (born 1 August 1953) is a British historian and academic, specialising in Roman history and the history and literature of the Jews in the Roman period.\nEarly life and education\nGoodman was born into an English Jewish family. Goodman noted that \"[t]he family practised little beyond a Sabbath-eve dinner each Friday, an annual family Seder and occasional attendance at services in Bevis Marks Synagogue.\" Goodman's paternal grandfather was the secretary of the London congregation of the Iberian Jews for many years.\nGoodman was educated at Trinity College, Oxford, (B.A.) where he studied classical language and literature, ancient history and philosophy (Literae Humaniores). He completed his Doctor of Philosophy (DPhil) degree in 1980: his doctoral thesis was titled State and society in Roman Galilee, AD 132-212. In 2010 he was awarded the degree of DLitt.\nAcademic career\nGoodman began his academic career as a research fellow, holding the Kaye Junior Research Fellowship at the Oxford Centre for Postgraduate Hebrew Studies from 1976 to 1977. He was then a lecturer in ancient history at the University of Birmingham from 1977 to 1986.\nIn 1986, Goodman was elected a Fellow of Wolfson College, Oxford. He was awarded the Title of Distinction of Professor of Jewish Studies by the University of Oxford in 1996. From 2014 to 2018, he was the President of the Oxford Centre for Hebrew and Jewish Studies.\nHe has edited the Journal of Roman Studies and the Journal of Jewish Studies. He is past President of the British Association for Jewish Studies, past secretary of the European Association of Jewish Studies, and he is a fellow and governor of the Oxford Centre for Hebrew and Jewish Studies.\nResearch and teaching\nGoodman teaches Roman history and Jewish history. He has written extensively on Jewish history in the Graeco-Roman period, including the religious and political conditions of the Jews, and their interactions with other peoples of the Roman Empire.\nHonours and awards\nIn 1996, Goodman was elected Fellow of the British Academy (FBA). In 2010, he was made an honorary fellow of Trinity College, Oxford.\nHis book, Oxford Handbook of Jewish Studies, won the National Jewish Book Award in Scholarship for 2002–2003.\nSelected works\n*The Ruling Class of Judaea: The Origins of the Jewish Revolt Against Rome, A.D. 66-70 , Cambridge, 1987\n*Mission and Conversion: Proselytizing in the Religious History of the Roman Empire, Oxford, 1994\n*The Roman World, 44 BC-AD 180, London, 1997 .\n*(ed.) Jews in a Graeco-Roman World, Oxford, 1998\n*(joint ed.) Apologetics in the Roman Empire: Pagans, Jews and Christians, Oxford, 1999\n*State and Society in Roman Galilee AD 132-212, 2nd edition, London 2000\n*(ed.) Oxford Handbook of Jewish Studies, Oxford, 2002\n*Judaism in the Roman World, Collected essays, Leiden, 2007\n*Rome and Jerusalem: The Clash of Ancient Civilizations, New York, 2007\n*(joint ed.) Rabbinic Texts and the History of Late Roman Palestine, Oxford, 2010\n*A History of Judaism, Penguin Books Ltd, London, 2017. Princeton University Press, 2018 .\nRome and Jerusalem: The Clash of Ancient Civilizations''\nB. Weinstein, professor emeritus at Howard University describes the work as a \"page turner\" because of its clarity and style. Weinstein also notes that Goodman has provided a huge number of primary sources. Rose Mary Sheldon offers a more critical review. Recognising his expertise in both Roman and Jewish history, Sheldon comments that while the text is clear and logical it uses minimal footnotes and is aimed towards a general audience. Sheldon also claims that Goodman's arguments in favour of a lack of conflict between Romans and Jews between 6-60 CE \"do not hold water\". Sheldon does conclude that Goodman has written an accurate historical survey of Roman-Jewish relations. Publishers Weekly observes that Goodman has backed his account with archaeological evidence and ancient commentary with the result of producing a \"scholarly tour de force\". Jay Freeman in Booklist holds Goodman's work to be a \"definitive account\" for historians of both the Roman and Jewish worlds. Freeman also states that Goodman has convincingly illuminated the role of the Jewish-Roman conflict in shaping relations between Jews and Christians. David Noy of the University of Wales, Lampeter describes in The Journal of Roman Studies that the picture portrayed in the book is a \"compelling one\". However, Noy criticizes Goodman's over reliance on Josephus. Erich S. Gruen gives a highly positive review and recommends this book for it \"demands attention\" because it is a \"sweeping survey\" that aims to reach an audience beyond academia. Describing Goodman as \"too good a historian\" he observes that Goodman has approached the subject in a \"masterly fashion\". Gruen's conclusion is that Goodman is committed to \"thorough and scrupulous\" scholarship.\nReferences\nExternal links\n* [https://web.archive.org/web/20080919225500/http://www.orinst.ox.ac.uk/html/staff/hjs/mgoodman.html Homepage] at Oriental Institute, Oxford.\n* [https://web.archive.org/web/20140715034639/http://www.theology.ox.ac.uk/people/staff-list/prof.-martin-goodman.html Homepage] at Faculty of Theology, Oxford."
    }
  ]
}