{
  "content": [
    {
      "type": "text",
      "text": "# Martin Luther King (film)\n\n| writer         =\n| screenplay     = Venkatesh Maha\n| story          = Madonne Ashwin\n| based_on       = Mandela (2021)\n| starring       =\n| narrator       =\n| music          = Smaran\n| cinematography = Deepak Yaragera\n| editing        = Puja Kolluru\n| studio         =\n| distributor    =\n| released       =\n| runtime        =\n| country        = India\n| language       = Telugu\n| budget         =\n| gross          =\n}}\nMartin Luther King is a 2023 Indian Telugu-language political satire film directed by Puja Kolluru in her directorial debut. It was jointly produced by YNOT Studios, Reliance Entertainment, and Mahayana Motion Pictures. This film's story is a remake of the Tamil movie Mandela, in which Yogi Babu played the lead role. Titled after the prominent American civil rights leader Martin Luther King Jr, the film stars Sampoornesh Babu in the titular role, with Naresh, Sharanya Pradeep, and Venkatesh Maha playing supporting roles.\nThe music for the film was composed by Smaran, and the cinematography was handled by Deepak Yaragera. In addition to directing, Puja Kolluru also took on the role of editor for the film.\nPlot\nA man without a name or identity is suddenly courted by two warring groups when he receives a voter ID. Will he reap the benefits of his newfound privilege, or will he use it as a tool for social change?\nCast\n* Sampoornesh Babu as Smile aka Martin Luther King\n* Naresh as Jogi\n* Sharanya Pradeep as Vasantha\n* Venkatesh Maha as Loki\n* Goparaju Ramana\n* HMT Hanmantu\nProduction\nYNOT Studios came up with the idea of adapting the Tamil film Mandela into Telugu, and as Baradwaj Rangan suggested, they approached Venkatesh Maha. However, Venkatesh Maha declined to do another remake, as he had already remade the Malayalam film Maheshinte Prathikaaram in Telugu as Uma Maheswara Ugra Roopasya. Subsequently, they chose Venkatesh's associate director, Puja Kolluru, to direct the film. Venkatesh wrote the screenplay and dialogue for the film, which is set in the town of Markapur. Sampoornesh Babu was later selected for the lead role. To prepare for the role of Smile, Sampoornesh underwent a forty-day workshop.\nMusic\nThe film's music was composed by Smaran.\nRelease\nTheatrical\nThe film was released on 27 October 2023.\nHome media\nThe film premiered on SonyLIV on 28 November 2023, in Telugu, as well as dubbed versions in Tamil, Kannada, Malayalam, and Hindi.\nReception\nA critic from Sakshi gave the film 2.5 out of 5 stars and wrote a mixed review. Srivathsan Nadadhur of OTTPlay gave it 3.5 out of 5 stars and wrote, \"Director Puja Kolluru’s Martin Luther King is a sharp social commentary with a good dose of drama and humour.\"\nReferences\nExternal links\n*"
    }
  ]
}