{
  "content": [
    {
      "type": "text",
      "text": "# Martin Meehan (Irish republican)\n\n| birth_place         = Ardoyne, Belfast, Northern Ireland\n| death_date          = 3 November 2007 (aged 61–62)\n| death_place         = Ardoyne, Belfast, Northern Ireland\n| party               = Sinn Féin\n| occupation          =\n| office              = Antrim Borough Councillor\n| term_start          = 7 June 2001\n| constituency        = Antrim North West\n| term_end            = 5 May 2005\n| resting_place       = Milltown Cemetery\n| branch              = |Provisional IRA }}\n| branch_label        = Paramilitaries\n| serviceyears        = 1966–1994\n| rank                = Commanding Officer\n| unit                = Third Battalion Ardoyne, Belfast Brigade\n| battles             = The Troubles\n| battles_label       = Conflicts\n}}\nMartin Meehan (1945 – 3 November 2007) was a Sinn Féin politician and volunteer in the Provisional Irish Republican Army (IRA). Meehan was the first person to be convicted of membership of the Provisional IRA, and he spent eighteen years in prison during the Troubles.\nBackground and early IRA activity\nMeehan was born in 1945 in the Ardoyne area of Belfast in Northern Ireland. His father had been imprisoned for republican activities in the 1940s, but one of his grandfathers was killed fighting for the British Army in the Battle of the Somme in World War I. Meehan left school aged 15 and began working at Belfast's docks, and in 1966 he became a member of the Irish Republican Army.\nHe was sworn in by Billy McMillen, and described joining as \"a big occasion, like joining the priesthood\". In 1968 he was arrested for the first time, after he assaulted a member of the Royal Ulster Constabulary (RUC) during a civil rights march in Derry. During the August 1969 riots in Belfast he was one of a handful of IRA members who tried to defend Catholic areas from attacks by Ulster loyalists, and resigned as a result of the organisation's failure to adequately protect Catholic areas. Meehan was arrested on 22 August 1969 for riotous behaviour, and was badly beaten before being imprisoned. The beating was so severe Meehan was given the last rites, the first of four occasions on which he received last rites. He was released after spending two months in prison. After his release Billy McKee convinced Meehan to rejoin the IRA. Meehan sided with the Provisional IRA following its split with the Official IRA in January 1970, and by mid-1970 was a senior IRA leader in the Ardoyne area. On 27 June 1970 rioting broke out across Belfast following a parade by the Orange Order, and a gun battle started in the Ardoyne area. Meehan stated:\nin Belfast, 1971]]\nMeehan was questioned in relation to the 1971 Scottish soldiers' killings but never charged. In the six weeks following the beginning of Operation Demetrius in August 1971, six soldiers from the Green Howards regiment were killed by the IRA in north Belfast. Meehan became one of the most wanted IRA members in the area, and when arrested he was badly beaten by soldiers and needed 47 stitches to the back of his head. Meehan was imprisoned without charge under the Special Powers Act in Crumlin Road Jail. Meehan and two other IRA members including Joe B. O'Hagan escaped from prison on 2 December 1971. The men covered themselves in butter to keep warm, then hid inside a manhole for six-and-a-half hours before scaling the prison walls using ropes made from knotted blankets and sheets.\nMeehan escaped across the border to Dundalk in the Republic of Ireland, and on 27 January 1972 he was arrested by the Garda along with seven other IRA members following a four-hour cross-border gun battle between the IRA and soldiers from the Royal Scots Dragoon Guards. Meehan claimed to reporters at the time, \"We pasted them. You could have heard them squealing for miles\". Despite over 4,500 rounds of ammunition being fired the only casualty was a farmer's prize-winning pig. The IRA members were arrested in possession of an anti-tank gun, a carbine and seven rifles, but were acquitted at their trial the following month due to lack of evidence.\nMeehan returned to Northern Ireland, where he was arrested on 9 August 1972. He was charged with escaping from lawful custody, and at his trial successfully argued that under the Special Powers Act a British soldier had no power of arrest and as such he had the legal right to escape. He was awarded £800 in compensation for being illegally detained for twenty-three days, and the government were forced to amend the Special Powers Act to legalise the detention of others held under the Act. He was charged with membership of the Provisional IRA, and received a three-year sentence when he became the first person to be convicted of the offence. He was imprisoned in Long Kesh, and was released on 4 October 1974. After his release he was immediately interned without trial, and on 5 December 1975 he was the last internee to be released after internment had been abolished.\nThe Long War\nOn 11 July 1979 the IRA kidnapped a seventeen-year-old youth suspected of being an informer from a club in the New Lodge area of Belfast. Over a four-day period he was moved between a number of safe houses where he was beaten and interrogated, and he confessed to working as an informer for the British Army. The youth was rescued by a British Army patrol which raided the house where he was being held, and one kidnapper was arrested. Meehan and four other men were arrested soon after. In March 1980 Meehan was sentenced to twelve years' imprisonment after he was found guilty of conspiracy to kidnap and false imprisonment. Meehan was convicted based largely on the evidence of the informer, whose evidence was described by the judge as of \"poor quality\". Meehan protested his innocence, and began a hunger strike which lasted sixty-six days culminating in a \"thirst strike\" where he also refused water. His protest ended following the intervention of Cardinal Ó Fiaich, who persuaded Meehan to end his strike. In September 1985 Meehan was released from prison.\nIn March 1988 Meehan was sentenced to a further fifteen years imprisonment after being convicted of the kidnapping and false imprisonment of a member of the Territorial Army. The soldier had been kidnapped on 12 July 1986 and imprisoned in a house in the Ardoyne area, before being freed in a rescue operation by the British Army. The court heard that the soldier had suffered a broken jaw and had been bound and blindfolded in preparation for being shot dead, although Meehan claimed he was arrested while attempting to arrange to hand the soldier over to a priest. While in prison Meehan was assaulted by prison officers, for which he later received £14,000 in compensation. He was released from prison on 20 January 1994.\nPolitical career\nFollowing his release from prison Meehan became a leading member of Sinn Féin, serving on the party's national executive, or Ard Chomhairle. He was also chairman of Saoirse, an organisation which campaigned for the release of paramilitary prisoners. In 1996 he was an unsuccessful candidate in the Northern Ireland Forum election in East Antrim. Meehan stood in the 1998 elections to the Northern Ireland Assembly in South Antrim, receiving 3,226 votes. He also stood as a candidate for election to the British House of Commons in the South Antrim constituency in the by election of 2000 and the 2001 UK General election, being unsuccessful each time.\nOn 7 June 2001 he was elected a councillor for the Antrim North West constituency on Antrim Borough Council. In the 2003 elections to the Northern Ireland Assembly in South Antrim, Meehan lost by 181 votes to Alliance Party of Northern Ireland leader David Ford on the final count. Meehan did not stand in the 2007 Assembly election, being replaced in South Antrim by Mitchel McLaughlin, who won a seat.\nElections contested\n{| class=\"wikitable\"\n! Date of election !! Constituency !! Party !! Votes !! %\n|-\n| Northern Ireland Forum election, 1996 || East Antrim|| Sinn Féin || 619 || 1.9\n|-\n| Northern Ireland Assembly election, 1998|| South Antrim|| Sinn Féin || 3,226 ||\n|-\n| 2000 South Antrim by-election || South Antrim || Sinn Féin || 2,611 || 8.55\n|-\n| 2001 United Kingdom general election || South Antrim|| Sinn Féin || 4,160 || 9.42\n|-\n| Northern Ireland council election, 2001|| Antrim North West|| Sinn Féin || 1,007 ||\n|-\n| Northern Ireland Assembly election, 2003|| South Antrim || Sinn Féin || 4,295 || 11.5\n|-\n| Northern Ireland council election, 2005|| Antrim Line|| Sinn Féin || 670 ||\n|-\n|}\nDeath\nMeehan died on 3 November 2007, after suffering a heart attack at his home. Sinn Féin member Gerry Kelly said he was \"shocked and saddened\", and that Meehan \"gave his whole life to serve both his ideals in republicanism and also the people\".\nHe was buried in Milltown Cemetery on 6 November 2007; pallbearers included Gerry Adams, Martin McGuinness and Sean Kelly.\nReferences\nExternal links\n*[https://archive.today/20110524052237/http://www.timesonline.co.uk/tol/comment/obituaries/article2812805.ece Obituary in The Times, 5 November 2007]"
    }
  ]
}