{
  "content": [
    {
      "type": "text",
      "text": "# Marvin Stewart\n\n| birth_place     =\n| death_date      =\n| death_place     = Pebble Beach, California, U.S.\n| height_ft       =\n| height_in       =\n| weight_lb       =\n| highlights      =\n* Second-team All-SEC (1936)\n* LSU Athletic Hall of Fame\n| module =\n}}\nMarvin Christopher \"Moose\" Stewart (September 25, 1912 – August 30, 2009) was an American collegiate football player and United States Marine Corps officer. He attended Louisiana State University, where he was a lineman for the LSU Tigers football team. He was a third-team All-Southeastern Conference (SEC) selection in 1935 and a second-team All-SEC selection in 1936. Stewart was inducted into the LSU Athletic Hall of Fame as a charter member in 1937.\nBiography\nStewart was born on September 25, 1912, to Thomas Jefferson Stewart and Mary Frances Stockstill.\nStewart began his career for the LSU Tigers as a center in 1934. He was a starter for the 1935 team, and played alongside future College Football Hall of Famers Abe Mickal and Gaynell Tinsley. LSU went 9–1 in the regular season and were invited to the 1936 Sugar Bowl, where they were defeated, 3–2, by quarterback Sammy Baugh and Texas Christian University. The Tigers were named Southeastern Conference champions after going undefeated in conference play. The Helms Foundation named Stewart to its All-America team after the season.\nIn 1936, his senior season, he led the team to an undefeated regular season and another Sugar Bowl appearance. They were defeated by Santa Clara, 21–14. LSU won its second SEC championship in a row, and for the second year in a row Stewart was named an All-American by the Helms Foundation. He was also named to the All-SEC team by the Associated Press. Stewart was selected in the second round of the 1937 NFL draft by the Chicago Bears, but did not play professionally. In 1937, he was one of a group of fourteen players to be the first elected to the LSU Athletic Hall of Fame, along with his former teammates Mikal and Tinsley.\nStewart joined the U.S. Marine Corps in 1941 and attained the rank of lieutenant colonel. He was head coach of the Quantico Marines Devil Dogs football team in 1947; the team was 12–1 while playing mostly against other military teams, losing only to Washington and Lee in the first game of the season.\nStewart lived in Baton Rouge, Louisiana, for most of his life, but moved to California in the 1990s. He died in Pebble Beach, California, on August 30, 2009, at the age of 96.\nReferences"
    }
  ]
}