{
  "content": [
    {
      "type": "text",
      "text": "# Maryon Stewart\n\nMaryon Stewart is a British author and broadcaster known for her work in the field of non-drug medicine. Specialising in educating and coaching women in how to control menopause symptoms without hormone replacement therapy (HRT), she is sometimes referred to as a pioneer of the \"Natural Menopause Movement\".\nIn 2018, Stewart was awarded the British Empire Medal for services to drug education, having successfully campaigned to restrict the production, sale and supply of 'legal highs' in the UK. Her 28 self-help books have sold millions of copies worldwide (some reaching the bestsellers lists in Australia) and she has co-authored six published medical papers.\nIn 2019, she launched Healthy, Wise & Well in the UK and, in 2021, Femmar Health Corp in the USA, both providing menopause support and guidance in and outside the workplace.\nStewart frequently lectures both to the public and medical profession. In 2020, she gave a presentation on the economic case for managing menopause naturally in the workplace at Longevity Leaders World Congress.\nEarly life\nStewart was born in Clapton, London and grew up in Clayhall. Her father was of Russian and Polish descent, her mother of English and Romanian descent.  She took an interest in charity and fundraising work from a young age. In a 2012 interview in The Jewish Chronicle, she told Lynne Franks, \"I always wanted to help people. That was my thing – change things for people, make it better somehow.\"\nEarly career\nStewart studied preventive dentistry and nutrition at the Royal Dental Hospital in London and worked as a counsellor with nutritional doctors in England for four years.\nIn 1984, she set up the PMT Advisory Service – the first non-drug advisory for premenstrual tension in the world. In 1987, she launched the Women's Nutritional Advisory Service and in 2003, the Natural Health Advisory Service. Research by the service claimed to have identified a link between low levels of important nutrients and female brain chemistry and hormone function. Using this data, Stewart and her team of medical professionals devised a non-drug method that they believed redressed nutritional and hormonal imbalances in women and helped them overcome PMT and restore wellbeing.\nHer first book Beat PMT Through Diet (later known as No More PMS!) was first published in 1987.\nPioneer of the natural menopause\nIn 1990, Stewart adopted the same non-drug method she'd used in her PMT work to focus on perimenopause, menopause and postmenopause.\nStewart has partnered with a host of companies to support the delivery of menopause services in the workplace, including Virgin Care, Lovell, Cisco and Womble Bond Dickinson.\nIn 2021, Stewart's book The Natural Menopause Plan was named by the Evening Standard as one of the best 10 books on menopause. Her 28th book (her first in the US), entitled Manage Your Menopause Naturally, was published in November 2020 by New World Library.\nMedia appearances\nSince the 1990s, Stewart has been a regular contributor to the mainstream UK media. She has been featured in The Guardian and Forbes and appeared on BBC Radio 4's Woman's Hour.\nIn 2001, she became the resident nutritionist on Channel 4's Model Behaviour and launched her own series, The Really Useful Health Show, on the Body in Balance channel on Sky TV.\nIn October 2022, Maryon’s Menopause Moments featured on the PBS television network in the USA to celebrate World Menopause Month.\nThis was followed, in October 2023, by the launch of ''Maryon Stewart's Menopause Solutions (also on PBS), the first television series in the USA to be completely dedicated to the topic of menopause. This four-part series follows the stories of real-life women and will be launched on public television across the USA in 2024.\nBooks\nStewart has written a series of self-help books, including:The Vitality Diet, Maryon Stewart's Zest for Life Plan, Beat Sugar Craving:The Revolutionary 4-Week Diet, The Model Plan: Eating Well, Looking Good, Feeling Great, Healthy Parents, Healthy Baby, The Real Life Diet, No More IBS!, No More PMS!, Beat PMT Through Diet, Cruising Through The Menopause: Managing Your Menopause Successfully Without HRT, The Natural Menopause Plan, The Natural Menopause Kit, Beat Menopause Naturally,The Phyto Factor and Manage Your Menopause Naturally.\nShe has also co-authored the following publications: Every Woman's Health Guide: The Woman's Nutritional Advisory Service Handbook for Drug-free Health, The Natural Health Bible: An A-Z guide to drug-free health with Alan Stewart and Beat PMS Cookbook'' with Sarah Tooley.\nCharity work and campaigning\nIn 2009, Stewart's daughter Hester – a medical student at the University of Sussex – died after taking the 'legal high' gamma butyrolactone (GBL). She was 21 years old.\nStewart placed her women's health work on hold to focus on fighting for a ban on the production, sale and supply of legal highs in the UK. In memory of her daughter, she established the Angelus Foundation. In 2012, the Angelus Foundation partnered with the Amy Winehouse Foundation to front a national campaign to make drug and alcohol education compulsory as part of the national curriculum. In 2016, the Angelus Foundation merged with Mentor UK.\nIn 2018, Stewart was awarded the British Empire Medal for services to drug education.\nHonours and awards\nIn November 1999, Stewart was voted by Good Housekeeping Magazine as the 51st most influential woman in Great Britain.\nIn December 2009, she was voted one of the five most inspirational women in the UK by The Sun's Fabulous Magazine. In 2010, she won the Addidi Inspirational Award. and in 2018, Stewart was voted as one of the UK's 50 most inspirational women by the Daily Mail's Femail.\nIn 2022, Maryon was named by Forbes as one of \"11 female scientists, innovators and entrepreneurs changing the narrative on menopause\".\nReferences\nExternal links\n* [https://web.archive.org/web/20140223124303/http://www.angelusfoundation.com/ Angelusfoundation.com]\n* [http://www.whynotfindout.org/ Whynotfindout.org]\n* [https://www.theguardian.com/society/2012/nov/11/film-competition-legal-highs New film prize to curb use of 'club drugs' | Society | The Guardian]\n* [https://www.theguardian.com/society/2012/mar/03/learn-daughters-death-ketamine One year on, why I want young people to learn from my daughter's death | Society | The Observer]"
    }
  ]
}