{
  "content": [
    {
      "type": "text",
      "text": "# Maryborough West, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 568\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4650\n| area                = 8.0\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 5.3\n| dir1                = NW\n| location1           = Maryborough\n| dist2               = 34.3\n| dir2                = SSW\n| location2           = Hervey Bay\n| dist3               = 253\n| dir3                = N\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Fraser Coast Region\n| stategov            = Maryborough\n| fedgov              = Wide Bay\n| near-n              = Aldershot\n| near-ne             = Maryborough\n| near-e              = Maryborough\n| near-se             = Maryborough\n| near-s              = Maryborough\n| near-sw             = Tinana\n| near-w              = Oakhurst\n| near-nw             = Oakhurst\n}}\nMaryborough West is a mixed-use locality in the Fraser Coast Region, Queensland, Australia. In the , Maryborough West had a population of 568 people.\nGeography\nThe Mary River forms the south-western boundary of the locality.\nThere is residential housing near the river, but the locality is predominantly used for other purposes, including industrial estates, the Maryborough Showgrounds (), and the heritage-listed Maryborough Cemetery ().\nThe Bruce Highway passes through the locality from the south-west (Tinana) to the north (Aldershot).\nHistory\nMaryborough Christian Academy opened as a primary school on 1 February 1983 at the Maryborough Christian Outreach Centre and expanded over time, being renamed Riverside Christian College in 2002.\nDemographics\nIn the , Maryborough West had a population of 531 people.\nIn the , Maryborough West had a population of 568 people.\nEducation\nRiverside Christian College is a private primary and secondary (Prep–12) school at 23 Royle Street ().\nThere are no government schools in Maryborough West. The nearest government primary school is Sunbury State School in neighbouring Maryborough to the south-east. The nearest government secondary school is Aldridge State High School in Maryborough to the east.\nAmenities\nThe Maryborough Showgrounds and Equestrian Park is located on the Bruce Highway at Maryborough West.\nLifeChurch Maryborough is at 68 Gayndah Road (). It is part of the Wesleyan Methodist Church of Australia.\nReferences"
    }
  ]
}