{
  "content": [
    {
      "type": "text",
      "text": "# Mary Queen of Scots House\n\n| location = Jedburgh\n| area =\n| built = 16th century\n| architect =\n| architecture =\n| governing_body =\n| owner =\n| designation1 =\n| designation1_offname =\n| designation1_date =\n| designation1_number =\n| designation2 =\n| designation2_offname =\n| designation2_date =\n| designation2_number =\n}}\n'''Queen Mary's House''' is a listed sixteenth century building in Jedburgh which is where Mary, Queen of Scots, stayed for a few weeks in 1566. The building has been open to the public since 1930 as a museum. There is some doubt whether the Queen stayed in this particular building. The museum has concentrated on telling Queen Mary's story for the last thirty years.\nHistory\nThe house was built in the sixteenth century in the town of Jedburgh near the Jed Water. The original entrance to the house is thought to be from Canongate Bridge through what is not the garden.\nThe house was recorded in a watercolour by the astronomer and artist Nathaniel Everett Green.\nIn 1777 the house was the home of Dr Lindsay and his wife Jean. Ten years later their daughters were guides for Robert Burns when he visited Jedburgh. Dr Lindsay's grandson, Lieutenant General Robert Armstrong inherited the house in about 1819. He had entered the Russian army and became in time the head of the Saint Petersburg Mint. Robert allowed his aunts to occupy the house until 1869 when Elizabeth Armstrong died.\nThe house was painted by Arthur Perigal the younger in 1879. This fanciful painting places the building in a rural setting, rather than the town setting within which it has always stood.\nThe building was given to the town by the Debenhams director F. S. Oliver who was then living in nearby Edgerston in 1928. It was restored under the supervision of the architect John Wilson Paterson of Edinburgh. It was opened to the public in 1930 by Mrs Oliver. In 1971 it became a Category A listed building.\nDescription\nIt is a three-storey stone-built building with a four-storey tower. The roof was originally thatched and it was later covered with tiles. Today the roofs are finished with grey slate.\nThe building is open to the public and there is no charge. Visitors can tour the inside via a stone spiral staircase. In each of the rooms are artefacts and boards explaining the history of the building and the background to Queen Mary's life and eventual execution.  The extensive grounds include pear trees that were planted in the 21st century. The trees are of the variety that were grown in the area when the farming of pears was a major occupation in the town.\nQueen Mary at Jedburgh\nMary, Queen of the Scots, announced her plans to travel to Jedburgh to hold a justice court on 28 July 1566 at Alloa. She came with her entourage to Jedburgh in October 1566 to hold the court, known as a justice ayre. It lasted from 9 October to 8 November. The presiding \"Lords Compositors\" rented a house from Lady Ferniehirst.\nMary paid £40 to hire a house in Jedburgh. A meeting was held with the town's authorities to regulate the prices of food and drink, and a pint of good ale would cost no more than ten pence. Whilst she was in Jedburgh Mary heard that James Hepburn, 4th Earl of Bothwell, lay injured at Hermitage Castle after fighting with John Elliot of Park. She took a hazardous journey to see him and returned ill from the experience. Her illness may have been recurring, she frequently complained of a pain in the side. Fruits considered as medicine, including pomegranates and lemons or limes were sent from Edinburgh for the queen, recorded in the treasurer's accounts as 20 \"apile garnattis\" and 6 \"sidronis\".\nDarnley was away hunting with his father, the Earl of Lennox. On hearing the news, it was said he came to Jedburgh, but was not welcomed. The \"Book of Articles\", a schedule of accusations against Mary, relates that Mary heard her half-brother James Stewart, 1st Earl of Moray, would host Darnley in Jedburgh. Mary asked his wife, Annas or Agnes Keith to pretend he was also ill so Darnley would not come. Darnley was said to have lodged a night in Jedburgh with a gentleman of the Home family, before Mary commanded him to go to Stirling.\nPhilibert du Croc, the French ambassador came to Jedburgh on 15 October, instructed by Mary to follow her there after five or six days at Holyrood. A letter from John Lesley, Bishop of Ross, names several courtiers at Jedburgh, and Philibert du Croc. Lesley and du Croc both say that Darnley was at Glasgow. According to George Buchanan, in his Dectection and the \"Book of Articles\", Darnley lodged nearby in a cottage or in the Bishop of Orkney's lodging, but when Bothwell came to Jedburgh he was lodged in the same house on a lower floor. Buchanan manipulated his narrative to dent Mary's reputation.\nOn 25 October 1566, the Privy Council convened at Jedburgh and issued a \"proclamation to keep good rule at Jedburgh\" during the time of Mary's illness. No one should pursue their private quarrel, and arm themselves, on pain of death for treason. Huntly, Moray, Bothwell, Atholl, and Rothes attended the council meeting.\nAn English border warden John Forster heard there had been a fire in Mary's lodging and she had to move. Red silk fabric was sent from Edinburgh for new clothes. Mary ordered meal and cheese to be sent to Hermitage Castle. When Mary was recovered from her illness, she rode to Kelso, and visited Wark Castle and Berwick-upon-Tweed on the English border. Mary was said to have later noted that she should have died in Jedburgh, as after that her life became worse. She didn't die but she was forced to abdicate. She tried to escape to England, but she was imprisoned and, much later, executed. For the last thirty years Queen Mary's House has told this story.\nReferences"
    }
  ]
}