{
  "content": [
    {
      "type": "text",
      "text": "# Mary Bateson (historian)\n\nMary Bateson (12 September 1865, Robin Hood's Bay – 30 November 1906, Cambridge) was a British historian and suffrage activist.\nLife\nBateson was the daughter of William Henry Bateson, Master of St John's College, Cambridge, and Anna Aikin. The geneticist William Bateson was her older brother; Anna Bateson and Margaret Heitland were her sisters. She was educated at the Perse School for Girls and Newnham College, Cambridge. She spent her entire professional life at Newnham, teaching there from 1888 and becoming a Fellow in 1903. Known for her writings in medieval history, she was supported professionally by historians Mandell Creighton and F. W. Maitland. She died of a brain haemorrhage and is buried in Histon Road Cemetery, Cambridge.\nActivism\nAs part of her suffrage activities, Bateson became the Cambridge organiser for the Central Society for Women's Suffrage in 1888. The following year she was elected to the executive committee Cambridge Women's Suffrage Association. In 1906 she participated in a deputation to Parliament where she presented Prime Minister Henry Campbell-Bannerman with a petition on behalf of ‘women who are doctors of letters, science and law in the universities of the United Kingdom and of the British colonies, in the universities also of Europe and the United States’. The petition declared that the signatories ‘believe the disenfranchisement of one sex to be injurious to both, and a national wrong in a country which pretends to be governed on a representative system’.\nWorks\n*Register of Crabhouse Nunnery, 1889\n*[https://www.jstor.org/stable/pdf/3678130.pdf?ab_segments=0%252Fbasic_SYC-5144%252Fcontrol&refreqid=excelsior%3Aa7a92ac26332dead483d79fd428126a3 Origin and History of Double Monasteries], 1899\n*Records of the borough of Leicester; being a series of extracts from the archives of the Corporation of Leicester, 3 vols, 1899–1901\n*[http://catalog.hathitrust.org/Record/003793719 Mediaeval England, 1066–1350], 1903\n*'The French in America (1608—1744)', chapter 3 of Cambridge Modern History, vol. 7 (1903)\nReferences\nExternal links\n*[https://archiveshub.jisc.ac.uk/manchesteruniversity/data/gb133-mbp Mary Bateson Papers] at the University of Manchester Library."
    }
  ]
}