{
  "content": [
    {
      "type": "text",
      "text": "# Mary Howard, of the Holy Cross\n\nVen. Mary Howard, of the Holy Cross (28 December 1653 &ndash; 21 March 1735) was an English nun  abbess of the Poor Clares convent at Rouen. She was a member of the prominent Howard family, but hid her aristocratic origins, wishing to live and die in obscurity.\nEarly life\nAbbess Mary took considerable steps to hide details of her true identity, including burning letters she received from England. The Catholic hagiographer Alban Butler (1710–1773) confirmed details about her life from Mary Plowden (née Stafford-Howard; died 1765), sister to William Stafford-Howard, 2nd Earl of Stafford (died 1733). After the Glorious Revolution in 1688, she and her husband, the Jacobite politician Francis Plowden, were exiled in France at the court of the deposed James II at Château de Saint-Germain-en-Laye.\nHoward was born in England on Holy Innocents' Day 1653, a daughter of Sir Robert Howard (1626–1698), by his first wife, Anne Kingsmill, second daughter of Sir Richard Kingsmill of Malshanger, whom he married in 1645. Politician Sir Thomas Howard, her father's only surviving son, was her elder brother.\nHer father was the fifth son of Thomas Howard, 1st Earl of Berkshire, second son of Thomas Howard, 4th Duke of Norfolk, the premiere Duke in the Peerage of England.\nMary was born during the tumultuous Interregnum. The Howards were Royalists during the English Civil War, and her father was knighted in 1644, at age 18, following the Battle of Cropredy Bridge. His royalist sympathies led to his imprisonment at Windsor Castle in 1658.\nAfter the Restoration of Charles II to the throne in 1660, her family prominence grew. Her grandfather served in the King's Privy Council and her father was elected to Parliament.\nMary's early youth was spent in her grandfather's home, Charlton Park, following her mother's death in 1655. She was in company of her cousin Lady Anne Howard (daughter of Charles Howard, Viscount Andover), with whom she was sent to a boarding school for young ladies.\nDuring her life at the convent, she frequently made references to Lady Anne, Mr. Philip, and William Howard, but did not refer to them as relatives.\nEscape to France\nAt the age of eighteen, to escape the attentions of Charles II of England, she went to Paris, under the assumed name of Talbot, and was placed in the Benedictine convent of Val de Grace to learn French.\nHere she was received into the Catholic Church, a step which brought her into disfavour with Lady Osborne, her guardian in Paris. Remaining staunch, she was finally permitted to retire to the convent of the Canonesses of St. Augustine at Chaillot, near Paris, where she remained several years, until her admission into the English convent of Poor Clares at Rouen, under the name of Parnel, to safeguard further the secret of her identity.\nHere she was made successively mistress of the choir, second and first portress, the latter a position involving the management of the temporal affairs of the convent, and in 1702, on the resignation of Mother Winefrid Clare Giffard, abbess since 1670, she became abbess of the community.\nWorks\nHer Chief Points of our Holy Ceremonies was published in 1726. Her other works, all in manuscript, are chiefly books of spiritual exercises, litanies, and other devotions.\nSee also\nReferences\n;Attribution\n*"
    }
  ]
}