{
  "content": [
    {
      "type": "text",
      "text": "# Mary Black (historian)\n\n| birth_place       = Pittsfield, Massachusetts\n| death_date        = 1992 (aged 69)\n| death_place       = Germantown, New York\n| death_cause       =\n| resting_place     =\n| resting_place_coordinates =\n| other_names       =\n| nationality       = American\n| education         =\n| alma_mater        =University of North Carolina (B.A.)George Washington University (M.A.)\n| occupation        =Art historian\n| awards            =\n| spouse            = Richard Black\n| partner           =\n| children          =\n| signature         =\n| signature_alt     =\n}}\nMary Black, née Childs (7 April 1922 – 1992), was an American art historian.\nLife\nMary Black was born on April 17, 1922, in Pittsfield, Massachusetts. She was awarded her B.A. from the University of North Carolina in 1943 and joined the United States Navy's WAVES that same year. Promoted to lieutenant, junior grade, she remained in the Navy until 1946. She married Richard Winthrop Black on April 7, 1947, and received a M.A. degree from George Washington University four years later. She was employed as a research assistant at Colonial Williamsburg at Williamsburg, Virginia in 1956–57 and then became registrar for the Abby Aldrich Rockefeller Folk Art Collection at Williamsburg in 1957–58, curator from 1958 to 1960, and then director and curator in 1960–63. Black was the director of the American Folk Art Museum from 1964 to 1969 and then became curator of painting, sculpture, and decorative arts for the New-York Historical Society in New York City. She was divorced in 1970 and remained with the Historical Society until her dismissal a dozen years later. Black filed complaints with state and federal agencies alleging sex and age discrimination and the society settled. She was awarded back pay, including vacation time, and a full pension. She died of cancer in Germantown, New York, in 1992 at age 69.\nActivities\nMary Black published five books in her career and contributed to \"a number of publications for the New-York Historical Society on various topics, including Edward Hicks, Erastus Salisbury Field, aspects of Jewish life in New York, Dutch paintings, advertising posters, Federal furniture and decorative arts, and Belmont Park.\" Her research led to the identification of bodies of work for the painters Nehemiah Partridge and Jacob Maentel.\nNotes\nReferences\n*"
    }
  ]
}