{
  "content": [
    {
      "type": "text",
      "text": "# Mary Alsop King Waddington\n\n| birth_place = New York City, New York\n| death_date  =\n| death_place = Paris, France\n| alma_mater  =\n| parents     = Charles KingHenrietta Liston Low\n| spouse      =\n| children    = 1\n| relatives   = Rufus King (half-brother)Richard Waddington (brother-in-law)James Green Martin (brother-in-law)Rufus King (grandfather)Nicholas Low (grandfather)\n}}\nMary Alsop King Waddington (April 28, 1833 &ndash; June 30, 1923) was an American author. She particularly wrote about her life as the wife of a French diplomat.\nEarly life\nMary was born in New York City, New York on April 28, 1833, the daughter of Charles King (1789–1867), an American academic, politician, newspaper editor and the ninth president of Columbia College (now Columbia University) and his second wife, Henrietta Liston Low (1799–1882).\nHer paternal grandfather was U.S. Senator Rufus King (1755–1827), the Federalist candidate for both Vice President (1804 and 1808) and President of the United States (1816).  Her maternal grandfather was Nicholas Low (1739–1826), a New York merchant and developer.\nCareer\nMary moved to France with her family in 1871, where she met her eventual husband.  During World War I, she helped raise funds for soldiers and refugees.\nMary was the author of ''Letter of a Diplomat's wife (1902), Italian letters of a Diplomat's wife (1904), Chateau and Country Life in France (1909), and  My First Years as a Frenchwoman (1914).\nShe also wrote magazine articles, including a paper on International Marriages in Scribner's Magazine'' in October 1907.\nPersonal life\nIn 1874, she married William Henry Waddington (1826–1894) in Paris.  Waddington was a French statesman who became the Prime Minister of France in 1879, and later French Ambassador to the United Kingdom from 1883 to 1893.  He was born at Saint-Rémy-sur-Avre in Normandy and was the son of Thomas Waddington, a wealthy cotton manufacturer, and Janet Mackintosh Colin Chisholm.  His parents were both naturalized citizens of France, born in England.  He was the brother of Richard Waddington, a French legislator and historian, and cousin of Charles Waddington, a French philosopher.  They were the parents of one son, Francis Richard Waddington, who married Charlotte Sallandrouze de Lamornaix (b. 1882), the daughter of Admiral Jean-Charles-Alexandre Sallandrouze de Lamornaix and granddaughter of Charles Sallandrouze de Lamornaix, on January 18, 1903, in Paris.\nShe died on June 30, 1923, in Paris, France.\nReferences\n;Notes\n;Sources\n* [https://www.questia.com/PM.qst?a=o&d=5273645 Biography of her, from the Introduction to a collection of her letters]\n*\nExternal links\n*\n* [http://www.gildedage.org/events-play.php A play based on her letters]\n* [http://www.normandythenandnow.com/guest-post-cures-for-princesses-in-bagnoles-de-lorne/ Excerpt from Mary's visit to Bagnoles de l'Orne, Normandy, with photos and images]\n*\n*\n*"
    }
  ]
}