{
  "content": [
    {
      "type": "text",
      "text": "# Mary King (political scientist)\n\nProf. King\nMary Elizabeth King (born July 30, 1940) is a professor of Peace and Conflict Studies at the United Nations affiliated University for Peace, a political scientist, and author of several publications. She is a graduate of Ohio Wesleyan University and received a doctorate in international politics  from Aberystwyth University in 1999. She is also a Fellow of the Rothermere American Institute and a distinguished Scholar at the American University Center for Global Peace in Washington D.C.\nShe received the Jamnalal Bajaj International Award in 2003. In 2009 she was awarded the El-Hibri Peace Education Prize. In May 2011, her alma mater Ohio Wesleyan University awarded her a doctor of laws (honorary) degree.\nBiography\nAfter graduating college, King became a staff member for the Student Nonviolent Coordinating Committee (SNCC). She wrote a book on that four-year experience, Freedom Song: A Personal Story of the 1960s Civil Rights Movement and won a Robert F. Kennedy Memorial Book Award for it.\nKing's participation in the Civil Rights Movement prompted her to co-write essays on women's issues with fellow activist Casey Hayden, most notably [http://www.crmvet.org/docs/sexcaste.pdf Sex and Caste: A Kind of Memo] (1965), which criticized sexism within the civil rights movement. Sara Evans attributes King and Hayden as founding activists for the women's liberation movement in her book \"Personal Politics.\" Evans claims that King and Hayden used their knowledge of participatory democracy, learned through SNCC membership, to critique women's position in a system of patriarchy. She says their essays stirred the beginning of women's liberation.\nBetween 1968 and 1972 King worked for the federal government during the Johnson and Nixon administrations under the U.S. office of economic opportunity helping to set up neighborhood health services for America's rural and urban poor. And in 1974 King, with five other women, established the National Association of Women Business Owners. She was president of the Organization in 1976.\nKing was appointed deputy director of the independent subcabinet federal agency that housed the Peace Corps, VISTA, and various programs of the ACTION agency under president Jimmy Carter.\nMary resides with her husband, Dr. Peter G. Bourne, in Virginia in the United States and in Oxford in the United Kingdom.\nCivil rights activism and feminism\nMary King joined the civil rights movement at the age of 22. She got her start in activism in college when she participated in a study tour across the south. On this tour in 1962 King and other students, both white and black, stayed at black colleges such as Fisk University, Clark College, and Tuskegee Institute. This group of students also visited white schools, such as Vanderbilt University, Agnes Scott College, and Georgia Tech. On the Study tour King was introduced to SNCC when she met John Lewis and Bernard Lafayette. Both of the men King met had been Freedom Riders and were affiliated with SNCC. Also on this study tour King met another student activist, Casey Hayden. Hayden would also become a staff member of SNCC and close friend to King.\nKing marked this study tour as \"a turning point in [her] life.\" When King returned to Ohio Wesleyan University after her study tour she set up her own student organization. The organization she created was called The Student Committee on Race Relations (SCORR). With this organization, King linked together sixty students to change University policies; such as, Ohio Wesleyan's policy of rooming black freshman in single dorms or only with each other, along with the University's policies of limiting black enrollment.\nKing graduated from Ohio Wesleyan University in June 1962 and following in the same path as Casey Hayden was introduced to civil rights activist, Ella Baker, through the Young Women's Christian Association in the southern region. Through this organization, Baker and professor Howard Zinn of Spelman College asked King to participate in their human-relations project. This project would involve King travelling with a recent black graduate to different colleges to assess the extent of academic freedom in the south. King agreed to participate. For this job King moved to Atlanta, Georgia and was partnered with a young black woman, Roberta \"Bobbi\" Yanci. As part of the project, King and Bobbi wrote and distributed a six-page newsletter, \"Notes from the South.\" The newsletter chronicled litigation, student direct action, token integration occurring on college campuses and on what SNCC was doing. The goal of the human-relations project was to help southern whites meet and know educated black counterparts from the same area, so that they could develop relationships with them as human beings.\nSNCC's office headquarters were also in Atlanta, so during the year that King worked for the human-relations project she also volunteered at SNCC, mostly doing office clerical work. Volunteering helped King establish connections with SNCC staff members, leading to her obtaining a staff position with the organization. In June 1963 when her job ended with the human-relations project, King began working for SNCC. She was to assist the organization's press secretary, Julian Bond.\nAfter being hired by SNCC, King was sent to Danville, Virginia to run SNCC's communications operation there. She was to manage everything related to the information SNCC gave to the news media representatives in Danville. This role also made her the direct telephone link between SNCC's Danville office and its headquarters in Atlanta. In Danville King participated in protests against Danville mills. Protesters wanted fair employment policies at the mills and also led a boycott of Dan River Mills products. In July 1963, Leonard W. Holt, a black attorney, told King that she was about to be indicted for acts of violence and war by Danville courts; therefore, she needed to leave Danville. King fled to a Roman Catholic convent in North Carolina and eventually returned to SNCC headquarters in Atlanta only to be sent to Mississippi.\nKing was sent to Mississippi to prepare a brochure and while there she encountered many leading activists for the Mississippi movement; such as Fannie Lou Hamer and Bob Moses. By December 1963 King was back at SNCC headquarters in Atlanta, occasionally running its communications program under Julian Bond. While in Atlanta, King was arrested and jailed for participating in a lunch counter sit-in.\nKing did communications work for SNCC in Atlanta between 1963 and 1964. Then between 1964 and 1965 her work was stationed in Jackson, Mississippi. The goals of communication were to create public and national awareness of the movement. King's job entailed calling jails when activists were arrested, calling news media to give them stories about the movement, connecting SNCC offices to transfer news, and also help publish SNCC's newspaper, \"The Student Voice.\"\nKing had been in Mississippi during the Freedom Summer project of 1964. After the summer project had ended a SNCC staff meeting was called to discuss the future of the organization. For this meeting King wrote two papers. One paper she wrote reflected on SNCC's need for a better communication system and how that need interfered with SNCC's lack of bureaucracy. The second paper King co-wrote with Casey Hayden, also in Mississippi with the SNCC. This paper addressed what it meant to be a woman SNCC staff member and the unequal treatment that resulted because of the patriarchal system. In King's words, it addressed the issue \"of how my growing perception of myself as a woman might affect the structure and program of SNCC.\"\nIn 1965 King and Hayden expanded on this paper, elaborating on its central thesis that not only in society at large, but also within the civil rights movement itself, women are \"caught\" in a \"common-law caste system\" that limits their opportunity and voice. King and Hayden sent \"[http://www.crmvet.org/docs/sexcaste.pdf Sex and Caste - A Kind of Memo]\" to forty women activists across the U.S. These women were involved in organizations such as Students for a Democratic Society, the National Student Association, the Northern Student Movement, the Student Peace Union, and SNCC. The document was subsequently published under the title \"Sex and Caste\" in the pacifist periodical Liberation, and entreated women to \"start to talk with each other more openly.\"\nIn the summer of 1965 King began planning and conducting workshops to help movement volunteers remain active in civil rights issues once they went home. The workshops were \"to discuss ways of using new skills, experiences, and lessons learned from community organizing in other parts of the country and in other phases of the movement.\" In her autobiography, King describes feeling estranged from SNCC for various reasons. This estrangement led to her resignation from SNCC at the end of 1965.\nSee also\n* University for Peace\n* Feminism\nReferences\nExternal links\n* [https://snccdigital.org/people/mary-king/ SNCC Digital Gateway: Mary King], Documentary website created by the SNCC Legacy Project and Duke University, telling the story of the Student Nonviolent Coordinating Committee & grassroots organizing from the inside-out\n* [http://www.upeace.org United Nations Mandated University for Peace]\n* [http://www.upeace.org/faculty/mking.cfm Mary King's faculty page]\n* [http://www.maryking.info Mary King's website]\n* [http://wagingnonviolence.org/author/maryelizabethking/ Mary King's articles at Waging Nonviolence]\n* [http://www.crmvet.org/vet/kingmary.htm Veterans of the Civil Rights Movement]\n*"
    }
  ]
}