{
  "content": [
    {
      "type": "text",
      "text": "# Mary Augusta Ward\n\n| birth_place      = Hobart, Tasmania, Australia\n| death_date       =\n| death_place      = London, England\n| nationality      = British\n| pseudonym        = Mrs. Humphry Ward\n| spouse           = Thomas Humphry Ward\n| children         = Arnold Ward  Janet Trevelyan\n| parents            = Thomas ArnoldJulia Sorell\n| relatives          = William Thomas Arnold (brother)Julia Huxley (sister)Ethel Arnold (sister)\n| signature        = Mary Augusta Ward Signature.jpg\n}}\nMary Augusta Ward   (née Arnold; 11 June 1851 – 24 March 1920) was a British novelist who wrote under her married name as Mrs Humphry Ward. She worked to improve education for the poor, setting up a Settlement in London. She was a staunch opponent of giving women the right to vote, and in 1908 she became the founding President of the Women's National Anti-Suffrage League.\nEarly life\nMary Augusta Arnold was born in Hobart, Tasmania, Australia, into a prominent intellectual family of writers and educationalists. Mary was the daughter of Tom Arnold, a professor of literature, and Julia Sorell. Her siblings included writer and journalist William Thomas Arnold, suffrage campaigner Ethel Arnold, and Julia Huxley who founded Prior's Field School for girls in 1902 and married Leonard Huxley and their sons were Julian and Aldous Huxley. The Arnolds and the Huxleys were an important influence on British intellectual life. An uncle was the poet Matthew Arnold and her grandfather Thomas Arnold, the famous headmaster of Rugby School.\nHuxley and Arnold family tree\nMary's father Tom Arnold was appointed inspector of schools in Van Diemen's Land (now Tasmania) and commenced his role on 15 January 1850. Tom Arnold was received into the Roman Catholic Church on 12 January 1856, which made him so unpopular in his job (and with his wife) that he resigned and left for England with his family in July 1856. Mary Arnold had her fifth birthday the month before they left, and had no further connection with Tasmania. On arriving in England Tom Arnold was offered the chair of English literature at the contemplated Catholic university, Dublin, but this was only ratified after some delay.\nMary spent much of her time with her grandmother. She was educated at various boarding schools (from ages 11 to 15, in Shifnal, Shropshire) and at 16 returned to live with her parents at Oxford, where her father had a lecturership in history. Her schooldays formed the basis for one of her later novels, Marcella (1894).\nOn 6 April 1872, not yet 21 years old, Mary married Humphry Ward, a fellow and tutor of Brasenose College, and also a writer and editor. For the next nine years she continued to live at Oxford, at 17 Bradmore Road, where she is commemorated by a blue plaque. She had by now made herself familiar with French, German, Italian, Latin and Greek. She was developing an interest in social and educational service and making tentative efforts at literature. She added Spanish to her languages, and in 1877 undertook the writing of a large number of the lives of early Spanish ecclesiastics for the Dictionary of Christian Biography edited by Dr William Smith and Dr. Henry Wace. Her translation of Amiel's Journal appeared in 1885.\nWard supported the opening of Oxford University to female students. She was a member of the Lectures for Women Committee, which met from 1873 and organised courses of lectures with an optional final examination for women. With other members of the committee she formed the Association for the Education of Women, which supported the opening of halls for women students in Oxford.\nWard became very involved in the negotiations surrounding the foundation of Somerville College in Oxford in 1879. She suggested that the new institution should be named after Mary Somerville. Ward was appointed as the first secretary of the Somerville Council and prepared for the arrival of new students despite being eight months pregnant when Somerville opened in October 1879.\nCareer\n, 1889]]\nWard began her career writing articles for ''Macmillan's Magazine while working on a book for children that was published in 1881 under the title Milly and Olly. This was followed in 1884 by a more ambitious, though slight, study of modern life, Miss Bretherton'', the story of an actress. Ward's novels contained strong religious subject matter relevant to Victorian values she herself practised. Her popularity spread beyond Great Britain to the United States.  Her book ''Lady Rose's Daughter was the best-selling novel in the United States in 1903, as was The Marriage of William Ashe'' in 1905. Ward's most popular novel by far was the religious \"novel with a purpose\" Robert Elsmere, which portrayed the emotional conflict between the young pastor Elsmere and his wife, whose over-narrow orthodoxy brings her religious faith and their mutual love to a terrible impasse; but it was the detailed discussion of the \"higher criticism\" of the day, and its influence on Christian belief, rather than its power as a piece of dramatic fiction, that gave the book its exceptional vogue. It started, as no academic work could have done, a popular discussion on historic and essential Christianity.\nWard helped establish an organisation for working and teaching among the poor. She also worked as an educator in the residential settlement movements she founded. Mary Ward's declared aim was \"equalisation\" in society, and she established educational settlements first at Marchmont Hall and later at what is now called Mary Ward House on Tavistock Place in Bloomsbury. This was originally called the Passmore Edwards Settlement, after its benefactor John Passmore Edwards, but after Ward's death it became the Mary Ward Settlement. It is now known as the Mary Ward Centre and continues as an adult education college; affiliated with it is the Mary Ward Legal Centre.\nShe was also a significant campaigner against women getting the vote. In the summer of 1908 she was approached by George Nathaniel Curzon and William Cremer, who asked her to be the founding president of the Women's National Anti-Suffrage League. Ward took on the job, creating and editing the Anti-Suffrage Review. She published a large number of articles on the subject, while two of her novels, The Testing of Diana Mallory and Delia Blanchflower, were used as platforms to criticise the suffragettes. In a 1909 article in The Times, Ward wrote that constitutional, legal, financial, military, and international problems were problems only men could solve. However, she came to promote the idea of women having a voice in local government and other rights that the men's anti-suffrage movement would not tolerate. Julia Stephen who was Virginia Woolf's mother recommended Florence Nightingale, Octavia Hill and Ward as good role models for her daughters.\n]]\nDuring World War I, Ward was asked by former United States President Theodore Roosevelt to write a series of articles to explain to Americans what was happening in Britain.  Her work involved visiting the trenches on the Western Front, and resulted in three books, ''England's Effort - Six Letters to an American Friend (1916), Towards the Goal (1917), and Fields of Victory (1919).\nWard was appointed a Commander of the Order of the British Empire in the 1919 New Year Honours.\nDiarist (anonymous)\nThroughout the 1880s Mary kept a personal diary of social and literary stories of the people she knew and met. She preferred to conduct her observations anonymously, and the diary was never published in her lifetime. Her reminiscences were heavily drawn upon by her friend Lucy B. Walford in a 1912 memoir in which she is referred to simply as \"Mary\". Shortly after Mary's death in 1921 the diary was published, still anonymously, as ''Echoes of the 'Eighties: Leaves from the Diary of a Victorian Lady. The identification of Mary Ward as the author of the diary was unknown until 2018 when an online article, about the diary's description of Oscar Wilde wearing a coat in the shape of a cello, cross-referenced her stories with corresponding information in the Walford memoir.\nDeath\nMary Augusta Ward died on 24 March 1920, at 4 Connaught Square, London, and was interred at Aldbury in Hertfordshire, near her beloved country home Stocks three days later.\nFoundations, organisations and settlements\n* Evening Play Centre Committee\n* Mary Ward Centre, formerly the Passmore Edwards Settlement\n* Women's National Anti-Suffrage League\nAssociated activists in social change\n* Dame Grace Kimmins\nSelected works\nCover of Milly and Olly, illustrated by Ruth M. Hallock (1914)\n;Fiction\n* (1881). Milly and Olly.\n* (1884). Miss Bretherton.\n* (1888). Robert Elsmere.\n* (1892). The History of David Grieve (3 vols.)\n* (1894). Marcella (3 vols.)\n* (1895). The Story of Bessie Costrell.\n* (1896). Sir George Tressady.\n* (1898). Helbeck of Bannisdale.\n* (1900). Eleanor.\n* (1903). ''Lady Rose's Daughter (dramatised as Agatha in 1905).\n* (1905). The Marriage of William Ashe.\n* (1906). Fenwick's Career.\n* (1908). Diana Mallory (published in America as The Testing of Diana Malory).\n* (1909). Daphne, or 'Marriage à la Mode' (published in America as Marriage à la Mode).\n* (1910). Canadian Born (published in America as Lady Merton, Colonist).\n* (1911). The Case of Richard Meynell.\n* (1913). The Mating of Lydia.\n* (1913). The Coryston Family.\n* (1914). Delia Blanchflower.\n* (1915). Eltham House.\n* (1915). A Great Success.\n* (1916). Lady Connie.\n* (1917). Missing.\n* (1918). The War and Elizabeth (published in America as Elizabeth's Campaign).\n* (1919). Cousin Philip (published in America as Helena).\n* (1920). Harvest.\n;Non-fiction\n* (1891). Address to Mark the Opening of University Hall.\n* (1894). Unitarians and the Future: Essex Hall Lecture.\n* (1898). New Forms of Christian Education: An Address to the University Hall Guild.\n* (1906). The Play-time of the Poor.\n* (1907). William Thomas Arnold, Journalist and Historian (with C. E. Montague).\n* (1910). Letters to my Neighbor on the Present Election.\n* (1916). England's Effort, Six Letters to an American Friend.\n* (1917). Towards the Goal (with an introduction by Theodore Roosevelt.)\n* (1918). A Writer's Recollections.\n* (1919). Fields of Victory.\n;Selected articles\n* (1883). [https://archive.org/stream/macmillansmagaz37grovgoog#page/n150/mode/2up \"French Souvenirs,\"] Macmillan's Magazine'' 48, pp.&nbsp;141–153.\n* (1883). [https://archive.org/stream/macmillansmagaz37grovgoog#page/n222/mode/2up \"M. Renan's Autobiography,\"] ''Macmillan's Magazine 48, pp.&nbsp;213–223.\n* (1883). [https://archive.org/stream/macmillansmagaz37grovgoog#page/n318/mode/2up \"Francis Garnier,\"] Macmillan's Magazine 48, pp.&nbsp;309–320.\n* (1883). [https://archive.org/stream/macmillansmagaz37grovgoog#page/n462/mode/2up \"A Swiss Peasant Novelist,\"] Macmillan's Magazine 48, pp.&nbsp;453–464.\n* (1884). [https://archive.org/stream/macmillansmagaz13grovgoog#page/n206/mode/2up \"The Literature of Introspection,\"] [https://archive.org/stream/macmillansmagaz13grovgoog#page/n284/mode/2up Part II], Macmillan's Magazine 49, pp.&nbsp;190–201, 268–278.\n* (1884). [https://archive.org/stream/macmillansmagaz13grovgoog#page/n346/mode/2up \"A New Edition of Keats,\"] Macmillan's Magazine'' 49, pp.&nbsp;330–340.\n* (1884). [https://archive.org/stream/macmillansmagaz00grovgoog#page/n174/mode/2up \"M. Renan's New Volume,\"] ''Macmillan's Magazine 50, pp.&nbsp;161–170.\n* (1884). [https://archive.org/stream/macmillansmagaz00grovgoog#page/n264/mode/2up \"Recent Fiction in England and France,\"] Macmillan's Magazine 50, pp.&nbsp;250–260.\n* (1885). [https://archive.org/stream/macmillansmagaz12grovgoog#page/n95/mode/2up \"Style and Miss Austen,\"] Macmillan's Magazine 51, pp.&nbsp;84–91.\n* (1885). [https://archive.org/stream/macmillansmagaz62grovgoog#page/n29/mode/2up \"French Views on English Writers,\"] Macmillan's Magazine 52, pp.&nbsp;16–25.\n* (1885). [https://archive.org/stream/macmillansmagaz62grovgoog#page/n145/mode/2up \"Marius the Epicurean,\"] Macmillan's Magazine 52, pp.&nbsp;132–139.\n* (1889). [https://archive.org/stream/twentiethcentury25londuoft#page/454/mode/2up \"The New Reformation: A Dialogue,\"] The Nineteenth Century 25, pp.&nbsp;454–480.\n* (1899). \"The New Reformation II: A Conscience Clause for the Laity,\" The Nineteenth Century 46, pp.&nbsp;654–672.\n* (1908). [https://archive.org/stream/educationalrevie36newyuoft#page/398/mode/2up \"Some Suffragist Arguments,\"] Educational Review 36, pp.&nbsp;398–404.\n* (1908). \"Why I Do Not Believe in Woman Suffrage,\" Ladies' Home Journal'' 25, p.&nbsp;15.\n* (1908). [https://archive.org/stream/twentiethcentury64londuoft#page/342/mode/2up \"Women's Anti-Suffrage Movement,\"] Nineteenth Century and After 64, pp.&nbsp;343–352.\n* (1917). [https://archive.org/stream/bronte00chesuoft#page/12/mode/2up \"Some Thoughts on Charlotte Brontë,\"] In: Charlotte Brontë, 1816–1916: A Centenary Memorial. London: T. Fisher Unwin, pp.&nbsp;11–38.\n* (1918). \"Let Women Say! An Appeal to the House of Lords,\" The Nineteenth Century and After 83, pp.&nbsp;47–59.\n;Miscellany\n* (1879–1889). Personal diary. Published (1921) as ''Echoes of the 'eighties : leaves from the diary of a Victorian lady. London: Eveleigh Nash Co. Ltd.\n* (1899). Joubert: A Selection from His Thoughts; with a Preface by Mrs. Humphry Ward.\n* (1899–1900). The Life and Work of the Sisters Brontë. 7 vols.; with an Introduction by Mrs. Humphry Ward.\n* (1901). The Case for the Factory Acts, Ed. by Beatrice Webb; with a Preface by Mrs. Humphry Ward.\n* (1908). The Forewarners: A Novel, by Giovanni Cena; with a Preface by Mrs. Humphry Ward.\n* (1911).\n* (1917). Six Women and the Invasion, by Gabrielle & Marguerite Yerta; with a Preface by Mrs. Humphry Ward.\n* (1920). Evening Play Centres for Children, by Janet Penrose Trevelyan; with a Preface by Mrs. Humphry Ward.\n;Translations* (1885).\nAmiel's Journal: The Journal Intime (2 vols.)\n;Collected works\n* (1909–12). The Writings of Mrs Humphry Ward. Houghton Mifflin (16 vols.)\n* (1911–12). The Writings of Mrs Humphry Ward. Westmoreland Edition (16 vols.)\nFilmography\n*The Marriage of William Ashe, directed by Cecil Hepworth (UK, 1916, based on the novel The Marriage of William Ashe)\n*Missing, directed by James Young (1918, based on the novel Missing)\n*Lady Rose's Daughter, directed by Hugh Ford (1920, based on the novel Lady Rose's Daughter)\n*The Marriage of William Ashe, directed by Edward Sloman (1921, based on the novel The Marriage of William Ashe)\nReferences\nBibliography\n*Sutherland, John. Mrs Humphry Ward: Eminent Victorian, Pre-eminent Edwardian'' (Oxford University Press, 1990)  [https://archive.org/details/mrshumphryward00john_0 online]\n*\n*\nFurther reading\n*\n*\n*\n* Bennett, Arnold (1917). [https://archive.org/stream/bookspersonsbein00benniala#page/46/mode/2up \"Mrs Humphry Ward's Heroines.\"] In: Books and Persons. New York: George H. Doran, pp.&nbsp;47–52.\n* Bensick, Carol M. (1999). \"'Partly Sympathy and Partly Rebellion': Mary Ward, the Scarlet Letter, and Hawthorne.\" In: Hawthorne and Women: Engendering and Expanding the Hawthorne Tradition. Ed. John L. Ido, Jr. and Melinda M. Ponder. Amherst, MA: University of Massachusetts Press, pp.&nbsp;159–167.\n* Bergonzi, Bernard (2001). \"Aldous Huxley and Aunt Mary.\" In: Aldous Huxley: Between East and West. Ed. C. C. Barfoot. Amsterdam, Netherlands: Rodopi, pp.&nbsp;9–17.\n* Bindslev, Anne M. (1985). Mrs. Humphry Ward: A Study in Late-Victorian Feminine Consciousness and Creative Expression. Stockholm: Almqvist & Wiksell International.\n* Boughton, Gillian E. (2005). \"Dr. Arnold's Granddaughter: Mary Augusta Ward\". In: The Child Writer from Austen to Woolf.  Ed. Christine Alexander and Juliet McMaster. Cambridge: Cambridge University Press, pp.&nbsp;237–53.\n*\n* Collister, Peter (1980). \"Mrs Humphry Ward, Vernon Lee, and Henry James,\" The Review of English Studies, New Series, Vol. 31, No. 123, pp.&nbsp;315–321.\n* Courtney, W.L. (1904). [https://archive.org/stream/femininenoteinfi00courrich#page/n43/mode/2up \"Mrs Humphry Ward.\"] In: The Feminine Note in Fiction. London: Chapman & Hall, pp.&nbsp;3–41.\n* Cross, Wilbur L. (1899). [https://archive.org/stream/developmentofeng00crosuoft#page/268/mode/2up \"Philosophical Realism: Mrs. Humphry Ward and Thomas Hardy.\"] In: The Development of the English Novel. New York: The Macmillan Company, pp.&nbsp;268–280.\n* Fawkes, Alfred (1913). [https://archive.org/stream/cu31924029380486#page/n461/mode/2up \"The Ideas of Mrs. Humphry Ward.\"] In: Studies in Modernism. London: Smith, Elder & Co., pp.&nbsp;447–468.\n* Gardiner, A.G. (1914). [https://archive.org/stream/pillarsofsociety00gardiala#page/124/mode/2up \"Mrs. Humphry Ward.\"] In: Pillars of Society. London: James Nisbett & Co., Limited.\n* Hamel, F. (1903). \"The Scenes of Mrs. Humphry Ward's Novels,\" The Bookman, pp.&nbsp;144–152.\n* James, Henry (1893). [https://archive.org/stream/essaysinlondonel00jame#page/252/mode/2up \"Mrs. Humphry Ward.\"] In: Essays in London and Elsewhere. New York: Harper & Brothers Publishers.\n*\n*\n*\n*\n*\n*\n* Olcott, Charles S. (1914). [https://archive.org/stream/lureofcamera00olco#page/94/mode/2up \"The Country of Mrs. Humphry Ward.\"] In: The Lure of the Camera. Boston: Houghton Mifflin Company.\n*\n* Smith, Esther Marian Greenwell (1980). Mrs. Humphry Ward. Boston: Twayne Publishers.\n* Sutherland, John (1988). \"A Girl in the Bodleian: Mary Ward's Room of Her Own,\" Browning Institute Studies, Vol. 16, Victorian Learning, pp.&nbsp;169–179.\n*\n* Trevelyan, Janet Penrose (1923). [http://babel.hathitrust.org/cgi/pt?id=mdp.39015011037481;view=1up;seq=7 The Life of Mrs. Humphry Ward]. New York: Dodd, Mead and Company.\n* Walters, J. Stuart (1912). [https://archive.org/stream/mrshumphrywardhe00walt#page/n9/mode/2up Mrs. Humphry Ward: Her Work and Influence]. London: K. Paul, Trench, Trübner & Co., Ltd.\nExternal links\n*\n*\n*\n* [http://catalog.hathitrust.org/Search/Home?lookfor=%22Ward,%20Humphry,%20Mrs.,%201851-1920.%22&type=author&inst= Works by Mary Augusta Ward], at Hathi Trust\n* [http://www.oxforddnb.com/view/printable/36736 Ward [née Arnold, Mary Augusta]\n* [http://www.victoriansecrets.co.uk/victorian-fiction-research-guides/mrs-humphry-ward/ Mrs Humphry Ward – Victorian Fiction Research Guide]\n* [http://www.uua.org/uuhs/duub/articles/maryaugustaward.html Ward at the Dictionary of Unitarian & Universalist Biography]\n* [http://www.victorianweb.org/books/suicide/08.html#ward Mary Augusta Ward at The Victorian Web]\n* [http://www.indiana.edu/~letrs/vwwp/vwwplib.pl?#ward Works by Ward at The Victorian Women Writers Project]\n* [http://www.marywardcentre.ac.uk/ Mary Ward Centre]\n* [https://web.archive.org/web/20010224021722/http://humanities.uwe.ac.uk/corehistorians/suffrage/document/speeward.htm Women's National Anti-Suffrage League]\n*\n*[https://findingaids.library.columbia.edu/ead/nnc-rb/ldpd_4079447 Finding aid to Mary A. (Mrs. Humphry) Ward papers at Columbia University. Rare Book & Manuscript Library.]\n*Mrs. Humphry Ward Collection. General Collection, Beinecke Rare Book and Manuscript Library, Yale University.\n*[https://oac.cdlib.org/findaid/ark:/13030/c80z794b/ Mrs. Humphry Ward Papers], Special Collections, The Claremont Colleges Library, Claremont, California."
    }
  ]
}