{
  "content": [
    {
      "type": "text",
      "text": "# Mary Jane Warfield Clay\n\n| birth_name  = Mary Jane Warfield\n| birth_date  =\n| birth_place =\n| death_date  =\n| death_place = Lexington, Kentucky, U.S.\n| resting_place = Lexington Cemetery\n| occupation  =\n| spouse      =\n| children    = 10, including Mary, Brutus, and Laura\n| father      = Elisha Warfield\n}}\nMary Jane Warfield Clay (January 20, 1815 – April 29, 1900) was an American socialite, suffragist, abolitionist, and political activist. An early leader in the suffrage movement in Kentucky, she began by forming a suffrage club at her home in 1879. Her experience and success as a farm manager included her acute business sense in the middle of the American Civil War. She sold supplies from her farm to both Union and Confederate forces when they each occupied the Commonwealth.\nHer most active work in the suffrage movement was to encourage and support her daughters, who would become the most well-known Kentucky suffragists of the nineteenth and early twentieth centuries.\nEarly life and family\nMary Jane Warfield was the daughter of  Dr. Elisha Warfield and his wife,\nMaria ( Barr). She grew up on a thoroughbred horse farm, The Meadows, on the northeast side of Lexington, Kentucky and was part of an elite social class based on slavery and the thoroughbred industry. Her family was socially and politically prominent in Kentucky and in Maryland.\nOn February 26, 1833, she married the  politician Cassius Marcellus Clay (1810–1903), who had become known as an abolitionist. According to her daughter, Mary Barr Clay, after her marriage M.J. Warfield Clay also became a strong advocate for the emancipation of slaves and supported her husband's political career. She continued such support even as he made many enemies and fell victim to pro-slavery mobs.\nThey lived in Lexington from 1838 to 1850 in one of the most elegant residences in the state: the William \"Lord\" Morton house. In the course of her 45-year marriage, she had ten children, six of whom lived to adulthood:\n*Elisha Warfield Clay (1835–1851)\n*Green Clay (1837–1883)\n*Mary Barr Clay (aka Mrs. J. Frank Herrick) (1839–1924)\n*Sarah \"Sallie\" Lewis Clay Bennett (1841–1935)\n*Cassius Marcellus Clay Jr. (1843–1843)\n*Cassius Marcellus Clay Jr. (1845–1857)\n*Brutus Junius Clay (1847–1932)\n*Laura Clay (1849–1941)\n*Flora Clay (1851–1851)\n*Anne Clay Crenshaw (1859–1945)\nBusiness career\nHer husband was captured and taken prisoner during the Mexican War, and Mary Jane Warfield Clay moved her family from Lexington to live in Madison County at Clermont, Cassius Clay's family home and estate. She began managing the plantation in his absence. When President Abraham Lincoln appointed Clay as ambassador to Russia in 1861, she accompanied him there for a short while.\nShe returned to Kentucky in early 1862, against her husband's wishes, living with her four daughters and family slaves at Clermont. She was a Unionist while the rest of her family were pro-Confederacy.\nClay managed the plantation and slaves while her husband was in Russia. With the profits she gained, she enlarged the mansion Clermont. It was originally built in the late 1700s by General Green Clay.  Warfield Clay had an Italianate addition built, with central heating and indoor plumbing. She renamed the house as White Hall., 2009]]\nMary Jane Warfield Clay left the plantation in 1868, soon after her husband returned from his ambassadorship in Russia (and a year-long stay in New York).   At first she lived with a sister, before getting her own house.\nThe Clays ended their marriage of 45 years with a divorce granted on February 7, 1878, on the grounds of abandonment and with a stipulation that she could not remarry as long as Cassius Clay lived.\nCassius Clay continued to live at the farm with a son adopted after an affair in Russia. After his wife and their children left, the politician entertained lavishly. M.J. Warfield Clay and her daughters would return to White Hall to host parties or other social engagements. The proceeds from the farm that she had earned over the years paid for Cassius Clay's many debts incurred overseas.\nAfter the Civil War, Mary Jane's sister, Anne Elizabeth Ryland, had offered her shelter at her house in Lexington. She and her younger daughters, including Laura Clay who was attending school in Michigan, lived there until she purchased her own home on North Broadway in 1873.\nLeadership in woman suffrage movement\nLocal petition for National Woman Suffrage Association campaign\nA year after her divorce from Cassius M. Clay, Mary Jane Warfield Clay with her elder daughters—Mary Barr Clay (also divorced) and Sallie Clay Bennett—gathered signatures in Lexington and Richmond for a suffrage petition to be sent to Washington, D.C. This petition was likely in support of the work being done by the National Woman Suffrage Association (NWSA). Clay described in a letter to her daughters of her admiration of the work led by Matilda Joslyn Gage, editor of the suffrage journal The National Citizen and Ballot Box and former president of the NWSA.\nSusan B. Anthony visit, 1879\nIn October 1879 Susan B. Anthony toured three cities in Kentucky upon the invitation of Mary Barr Clay. During her stay in Madison County, she visited White Hall. Anthony wrote a letter to Mary Barr Clay in 1900 about her memories of that visit\n:\"...to see your previous mother in her farm home – and then to the proud old mansion where I saw your father in the garden – and he said 'Mary, take Miss Anthony through the house and show it all to her' – which you did. I learned the wonderful heroism of your beautiful mother and also the heroic actions of her daughter Mary ... ever since that visit my love & respect for your dear mother and all of her girls have grown with the years.\nFirst suffrage club in Lexington, Kentucky\nOn March 7, 1880, Warfield Clay and her youngest daughter Annie began regular suffrage club meetings in the parlor of their home on North Broadway in Lexington. Many of those who came to her first organizing meeting on March 7 later founded the Fayette County Equal Rights Association on January 6, 1888. This also served as a launch for Annie, who struck out on her own, writing a regular column on women's rights in the Kentucky Gazette. Annie married a wealthy Virginian, Spottswood Dabney Crenshaw. In  November 1909, she hosted the first meeting of the Equal Suffrage League of Virginia at her home in Richmond, Virginia.\nLucy Stone visit, 1888\nIn October 1888 Lucy Stone stayed with Mary Jane Warfield Clay in Lexington just before the AWSA convention that took place that year in Cincinnati. Stone invited Laura Clay to give a speech at the convention, and they worked on how the state suffrage association could be revitalized. Soon thereafter a group of activists formed the new Kentucky Equal Rights Association (KERA) on November 21, 1888. M.J. Warfield Clay was a founding member and financial supporter.\nLater life and death\nThroughout her years as a divorced woman, Clay successfully managed her own 350-acre farm in Richmond, while living in Lexington. In 1886, Cassius M. Clay published his memoirs which contained malicious descriptions of his former wife.\nShe died April 29, 1900, at her home in Lexington.  She is buried in Section J, Lot 6 of the Lexington Cemetery in Lexington, Kentucky.\nReferences\nFurther reading\n*\n*\n*\n*\n*\"The Meadows\" p 105–109, Elizabeth Murphey Simpson, Blue Grass Houses and Their Traditions. Lexington, Ky.: Transylvania Press, 1932.\n*\n*\n*"
    }
  ]
}