{
  "content": [
    {
      "type": "text",
      "text": "# Massacres during the Cultural Revolution\n\n| isbn              = 9627934097\n| pages             = 298\n| caption           = Book cover for Massacres during the Cultural Revolution in the French language edition, Les Massacres De La Revolution Culturelle (2008)\n}}\nMassacres during the Cultural Revolution (; French: Les Massacres De La Revolution Culturelle) is a book by Chinese historian Song Yongyi. The book presents historical details together with author's analysis on a number of massacres which took place in mainland China during the Chinese Cultural Revolution (1966–1976). Originally published in Hong Kong in 2002, the book was later translated into French and was published in France in 2008.\nBackground and summary\nOnce a Red Guard himself during the Cultural Revolution, Song Yongyi, the author of the book, travelled to study in the United States in 1989. In August 1999, Song went back to mainland China to collect and research on materials regarding the Cultural Revolution, but was arrested and detained by the Chinese authorities and was accused of \"stealing state secrets\". After spending more than 100 days in jail, Song was freed thanks to international pressure and returned to the US in early 2000, subsequently publishing the book (Massacres during the Cultural Revolution) in 2002, which includes texts written by eight specialists in Cultural Revolution.\nThe book documents a number of massacres which took place across mainland China during the Cultural Revolution, including the Daxing Massacre during the \"Red August\" of Beijing, Guangxi Massacre, Inner Mongolia incident, Dao County Massacre, Shadian incident, and Qinghai 223 Incident. In particular, Song challenged the idea which blames the Cultural Revolution on the \"mob rule\" of Red Guards; instead, he argues in the book that most Cultural Revolution massacres were the action of \"state apparatuses\" and dictatorship, or the direct slaughter by the regime towards its citizens.\nIn 2008, the texts were translated into French by Marc Raimbourg, and the version published by Buchet-Chastel has 284 pages in length, while the version published by Gallimard in 2009 has 432 pages in length with a preface by sinologist Marie Holzman.\nReception\nIn the preface of the book (Chinese edition), Hu Jiwei, former president and editor-in-chief of the ''People's Daily,'' praises Song's effort of exposing the historical facts and details of the atrocities during the Cultural Revolution to the public, and endorsed Song's argument that the massacres and violence were mainly the action of \"state apparatuses\" under Mao Zedong towards the citizens. Xu Youyu, a Chinese scholar, also mentioned in the preface that the book made a contribution to the study of Chinese history and historiography by exposing to the public some of the most violent and brutal aspects in the modern history of China.\nHu Ping (胡平), a Chinese writer, commented that many young people including some western scholars always thought that the main victims of the Cultural Revolution were government officials and intellectuals, but the book shows that it was those who had low social status and were classified as \"class enemies\" bore the brunt; Hu called the book \"very important\" in terms of \"refuting some arbitrary distortion of the Cultural Revolution by the New Left\". Zhang Weiguo (张伟国), a Chinese journalist, said the book provided many examples which proved that the \"Chinese Communist dictatorship is the real culprit\" of the Cultural Revolution, and he hoped that \"the book sounds the alarm for China's rebirth, rather than becoming a memorial to China's destruction\".\nFrench sinologist Claude Hudelot called this book \"indispensable\" and \"shows the true face of the Cultural Revolution\"; he also mentioned that book contains \"confusing accuracy of information\", but he thought \"the number of victims mentioned is anything but 'abstract' or 'arbitrary'\".\nSee also\n* Five Black Categories\n* Victims of the Cultural Revolution\n* Collective Killings in Rural China during the Cultural Revolution\n* Scarlet Memorial\nReferences"
    }
  ]
}