{
  "content": [
    {
      "type": "text",
      "text": "# Massie, Queensland\n\n| pop                 = 113\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4370\n| area                = 53.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 14.6\n| dir1                = NW\n| location1           = Warwick\n| dist2               = 16.7\n| dir2                = SSW\n| location2           = Toowoomba\n| dist3               = 161\n| dir3                = SW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Southern Downs Region\n| stategov            = Southern Downs\n| fedgov              = Maranoa\n| near-n              = Deuchar\n| near-ne             = Deuchar\n| near-e              = Willowvale\n| near-se             = RosehillToolburra\n| near-s              = Toolburra\n| near-sw             = LeslieWheatvale\n| near-w              = Upper Wheatvale\n| near-nw             = Bony Mountain\n}}\nMassie is a rural locality in the Southern Downs Region, Queensland, Australia. In the , Massie had a population of 113 people.\nGeography\nThe locality is bounded to the south by the Condamine River.\nThe Warwick Allora Road enters to the locality from the south-east (Toolburra) and exits to the north (Deuchar).\nThe South Western railway line enters the locality from the north (Deuchar) and runs immediately parallel and east of the Warwick Allora Road until it exits to the south-east (Toolburra). The locality was served by the Massie railway station ().\nThe land use is crop growing and grazing on native vegetation.\nHistory\nThe locality was named after the Massie railway station which was named by the Queensland Railways Department after Robert George Massie, a pastoralist of South Toolburra, who was formerly a Commissioner of Crown Lands for MacLeay River District and later a Member of the Queensland Legislative Council and a Member of the New South Wales Legislative Council for the Pastoral districts of New England and MacLeay.\nDeuchar Provisional School opened on 14 March 1904. On 1 January 1909 it became Deuchar State School. It was closed in 1921 due to low student numbers, but reopened in 1924. It closed permanently on 11 August 1967. It was at 98 Millar Lane, on the south-east corner of Deuchar Bony Mountain Road, now within Massie ().\nDemographics\nIn the , Massie had a population of 91 people.\nIn the , Massie had a population of 113 people.\nEducation\nThere are no schools in Massie. The nearest government primary schools are Wheatvale State School in neighbouring Wheatvale to the south-west, Glennie Heights State School in Warwick to the south-east, and Allora State School in Allora to the north. The nearest government secondary schools are Warwick State High School (to Year 12) in Warwick, Allora State School (to Year 10) in Allora, and Clifton State High School (to Year 12) in Clifton to the north.\nAmenities\nWarwick Aerodrome is at 111 Massie Bony Mountain Road (). It is operated by the Southern Downs Regional Council.\nDeuchar-Massie Hall is a public hall at 12 Massie Bony Mountain Road (corner of Massie Hall Road, ).\nReferences"
    }
  ]
}