{
  "content": [
    {
      "type": "text",
      "text": "# Massie Township, Warren County, Ohio\n\n|population_density_km2   = 24.2\n|population_density_sq_mi = 62.7\n|timezone                 = Eastern (EST)\n|utc_offset               = -5\n|timezone_DST             = EDT\n|utc_offset_DST           = -4\n|elevation_footnotes      =\n|elevation_m              = 271\n|elevation_ft             = 889\n|coordinates              =\n|postal_code_type         = ZIP code\n|postal_code              = 45032\n|area_code                = 513\n|blank_name               = FIPS code\n|blank_info               = 39-48216\n|blank1_name              = GNIS feature ID\n|blank1_info              = 1087118\n|website                  =\n|footnotes                =\n}}\nMassie Township, one of the eleven townships of Warren County, Ohio, United States, is located in the northeast part of the county and is the least populous of Warren County's townships.  The population was 1,195 as of the 2020 census. It is the home of the Ohio Renaissance Festival and Caesar Creek State Park.\nGeography\n200px\nLocated in the northeastern part of the county, it borders the following townships:\n*Chester Township, Clinton County - northeast\n*Washington Township - south\n*Adams Township, Clinton County - southeast\n*Wayne Township - northwest\nThe village of Harveysburg is the only municipality within the township.\nHistory\nMassie Township was organized in 1850, and named for General Nathaniel Massie.\nA large part of the township was submerged in the 1960s and 1970s with the damming of Caesars Creek by the U.S. Army Corps of Engineers.\nGovernment\nThe township is governed by a three-member board of trustees, who are elected in November of odd-numbered years to a four-year term beginning on the following January 1.  Two are elected in the year after the presidential election and one is elected in the year before it.  There is also an elected township fiscal officer, who serves a four-year term beginning on April 1 of the year after the election, which is held in November of the year before the presidential election.  Vacancies in the fiscal officership or on the board of trustees are filled by the remaining trustees.\nPublic services\nThe township is mostly in the Clinton-Massie Local School District but a part is in the Wayne Local School District.\nMassie Township is in the Waynesville and Clarksville telephone exchanges.\nMassie Township Fire Department, a volunteer fire department, serves Massie Township. It is composed of sixteen firefighters based at a single station.\nReferences\nExternal links\n*[https://web.archive.org/web/19971010224639/http://www.co.warren.oh.us/ County website]"
    }
  ]
}