{
  "content": [
    {
      "type": "text",
      "text": "# Mass media in the Republic of the Congo\n\nMass media in the Republic of the Congo are severely restricted by many factors, including widespread illiteracy and economic underdevelopment.\nThe Congolese depend primarily on radio for information. This is mainly due to high illiteracy rates. Access to other forms of media outside the capital is poor. Even Pointe-Noire, the second largest city and the country's economic capital, does not have its own local newspaper.  Internet access is very limited, and most citizens have no access to computers in any case.\nThe public radio and television broadcaster in the Republic of the Congo is Radiodiffusion Television Congolaise. Private radio and television stations are allowed. The country has one press agency, Agence Congolaise d'Information, which is a public agency.\nFreedom of speech\nFreedom of speech is severely curtailed in the Republic of the Congo. During the 2009 national elections, a number of reporters from major international press organizations, including France 24, BBC and Radio France International, were harassed, physically attacked by police and soldiers, and had their equipment seized.\nPrint\nThere are a handful of print and online newspapers in the Republic of the Congo. All newspapers are based in Brazzaville, and publish in French:\n* ACI Actualité, issued by Agence Congolaise d'Information (defunct?)\n* ''Aujourd'hui (est. 1991) (defunct?)\n* Brazza News\n* Le Choc\n* Les Dépêches de Brazzaville\n* Les Echos du Congo\n* La Griffe\n* L'Humanitaire\n* Journal de Brazza(fr)\n* Mweti  (defunct?)\n* Le Nouveau Regard\n* L'Observateur\n* La Semaine Africaine (est. 1952), a religious publication of the Roman Catholic Church\n* Talassa\n* Le Tam Tam\n* La Vérité''\nTelevision\n* TV Congo (est. 1962), operated by governmental Radiodiffusion Télévision Congolaise\nRadio\nIn addition to Congolese radio stations, stations from nearby Kinshasa, in the Democratic Republic of the Congo, can be received in the Brazzaville. Rebroadcasts of the BBC World Service, Radio France Internationale, and the Voice of America are available.\n* Canal FM (est. 1977), Brazzaville community station; before 2002 called Radio Rurales du Congo\n* Radio Brazzaville (est. 1999), government operated local station for the capitol\n* Radio Congo, government operated national station\n* Radio Liberté (est. 1997), privately owned\nTelecommunications\nFixed line telephone infrastructure in the Republic of the Congo is very limited; fewer than 1 in 100 citizens have a fixed telephone line. Mobile phone communication has grown rapidly, and by 2011 more than 50 in 100 citizens had a mobile phone.  245,000 citizens are estimated to be Internet users, out of a total population of more than 3,800,000.\nSee also\n*\nReferences\nBibliography\n*  |volume=7 |issue= 2 |pages= 188–200 |doi= 10.2307/3319018  |language=fr |via= Persee.fr |year= 1966\n|jstor= 3319018 }}\n*\n}}\n*\n*\n*\n*\n}}\nExternal links\n*"
    }
  ]
}