{
  "content": [
    {
      "type": "text",
      "text": "# Massacre on Queens Boulevard__disambig_1\n\nMassacre on Queens Boulevard (sometimes written as Massacre on Queens Blvd) was a professional wrestling live event produced by Extreme Championship Wrestling (ECW) on April 13, 1996. The event was held in the Lost Battalion Hall in the Rego Park section of the New York City borough of Queens in the United States. The event took its name from the street where the venue is located.\nExcerpts from Massacre on Queens Boulevard aired on episode #156 of the syndicated television show ECW Hardcore TV on April 16, 1996, while the event was released on VHS in 1996 and on DVD in 2002. Brian Lee and the Harris Brothers versus Tommy Dreamer and the Pitbulls; Mikey Whipwreck versus Sabu; and the Gangstas versus Headhunters versus 2 Cold Scorpio and the Sandman appeared on the 2012 compilation DVD ECW Loves New York, while the bout between Chris Jericho and Taz was included on the compilation DVD ECW: Unreleased Vol. 2 released by WWE in 2013. The full event was made available for streaming on the WWE Network in 2020.\nEvent\nD-Von Dudley debuted in Extreme Championship Wrestling at Massacre on Queens Boulevard.\nThe announcer for Massacre on Queens Boulevard was Joey Styles, while the referees were Jim Molineaux, John Finnegan, and John Moore, with Tom Delevano as guest referee for the bout between Chris Jericho and Taz. The event was attended by approximately 1,100 people.\nThe event began with a tag team match pitting J. T. Smith and Damien Stone against the Dudley Brothers. Before the match began, Smith - whose gimmick was that, after sustaining a concussion, he believed himself to be an Old World Italian - announced that he had been researching his family tree and had discovered that Stone was his Sicilian cousin, dubbing him \"Little Guido\". This marked the beginning of Smith and Guido's alliance as the Full Blooded Italians. At the outset of the match, the debuting D-Von Dudley entered the ring and introduced himself, then announced the \"three rules\": \"Thou shall not steal! Thou shall not kill! And Thou shall not fuck with the Dudleys!\" D-Von Dudley then joined with Big Dick Dudley and Buh Buh Ray Dudley in viciously beating down Smith and Little Guido before attacking referee John Moore, drawing a disqualification. After the Dudley Brothers left the ring, Smith and Little Guido taunted them, prompting the Dudley Brothers to return to the ring and beat them down again. The introduction of D-Von Dudley eventually led to the formation of the highly successful Dudley Boyz tag team.\nThe second bout was a singles match in which Hack Meyers defeated Billy Black by pinfall following a modified diving facebuster.\nThe third bout saw ECW World Tag Team Champions the Eliminators defend their titles against El Puerto Rique침o and Joel Hartgood. The Eliminators won a short squash after delivering their Total Elimination finishing move to both men and then pinning them simultaneously. After the match, The Eliminators challenged the Gangstas, resulting in a brawl that ended with the Gangstas being arrested after New Jack struck a police officer.\nDami치n 666 challenged for the [[ECW World Heavyweight Championship at Massacre on Queens Boulevard.]]\nThe fourth bout saw ECW World Heavyweight Champion Raven defend his title against the luchadore Dami치n 666. Before the match, a woman dubbed the \"Meanie Doll\" by announcer Joey Styles (Miss Patricia) entered the ring and flirted with Raven's henchman the Blue Meanie. After Raven dragged her away by her hair, Raven's valet Kimona Wanalaya remonstrated with him, prompting Raven to slap her to the ground. Raven's henchman Stevie Richards initially appeared shocked, but then stomped Wanalaya before giving an impromptu promo in which he defended Raven and insulted Dami치n 666. Raven went on to win the bout by pinfall following an Evenflow DDT. Raven's attack on Wanalaya marked her departure from Raven's Nest, with Wanalaya vowing to get revenge on Raven and threatening to reveal a shocking secret at Hostile City Showdown.\nThe fifth bout saw Chris Jericho face Taz in a rematch from Big Ass Extreme Bash in which the only way to win was via knockout or submission, with judoka Tom Delevano as the guest referee. Taz's manager Bill Alfonso was handcuffed to ECW commissioner Tod Gordon at ringside to prevent him from interfering. The match ended when a member of \"Team Taz\" unhandcuffed Alfonso, enabling him to give Jericho a chair shot. Taz then applied the Tazmission to the unconscious Jericho and was awarded the win by technical knockout by Delevano. Following the match, Delevano revealed himself to have been in cahoots with Taz, applying the Tazmission to Gordon after he remonstrated with him.\nThe sixth bout was scheduled to be a singles match between Shane Douglas and Rob Van Dam, but Van Dam was unable to compete due to a broken wrist. Douglas came to the ring and gave a promo in which he insulted World Wrestling Federation Champion Shawn Michaels before issuing an open challenge. The Blue Meanie (parodying Shawn Michaels) initially came to the ring to accept Douglas' challenge, only for Axl Rotten to attack him and accept the challenge instead. Douglas went on to win the match by pinfall following a belly-to-belly suplex.\nThe seventh bout was a six-man tag team match pitting Brian Lee and the Bruise Brothers (representing Raven's Nest) against the Pitbulls and Tommy Dreamer. The match was a wild brawl that at one point spilled out of the Lost Battalion Hall onto Queens Boulevard, with Raven interfering to assist his henchmen. The match ended when Lee held a chair on either side of Dreamer's head and the Bruise Brothers delivered a big boot to each chair, enabling Lee to pin Dreamer. Following the match, Lee and the Bruise Brothers attempted to attack Dreamer's valet Beulah McGillicutty (who had announced at House Party that she was pregnant), but the Pitbulls' valet Francine pushed her out of the way and was attacked herself. Dreamer and the Pitbulls then rallied and drove away Lee and the Bruise Brothers, then the Pitbulls put an unconscious Raven on a table in the middle of the ring and superbombed Dreamer onto him.\nThe penultimate bout was a singles match between Mikey Whipwreck and Sabu. Sabu won the bout by pinfall following a Frankensteiner. Following the match, Sabu shook Whipwreck's hand in a sign of respect.\nThe main event was a three-way tag team elimination match between the Gangstas, the Headhunters, and 2 Cold Scorpio and the Sandman in another rematch from Bad Ass Extreme Bash, with the winners to be named the number one contenders to the Eliminators' ECW World Tag Team Championship. The Gangstas were initially missing from the match due to having been arrested earlier, eventually joining the match while still wearing handcuffs. The Headhunters were the first team eliminated after abandoning the match. Despite interference from the Eliminators, the Gangstas went on to win the match, with New Jack pinning 2 Cold Scorpio following a running powerslam from Mustafa and a 187 from New Jack.\n}}"
    }
  ]
}