{
  "content": [
    {
      "type": "text",
      "text": "# Master's degree in the United Kingdom\n\nA '''master's degree in the United Kingdom''' (from Latin ) is an academic degree awarded by universities or colleges in most cases upon completion of a course of study demonstrating mastery or a high-order overview of a specific field of study or area of professional practice.\nA master's degree normally requires previous study at the bachelor's level, either as a separate degree or as part of an integrated course. Within the area studied, master's graduates are expected to possess advanced knowledge of a specialized body of theoretical and applied topics; high order skills in analysis, critical evaluation, or professional application; and the ability to solve complex problems and think rigorously and independently.\nThe Quality Assurance Agency for UK Higher Education (QAA)'s Characteristics Statement for master's degree qualifications provides an official description of the context and purposes of master's degrees and the expected attainment of a successful master's degree candidate.\nStandardisation\nUK master's degrees, including integrated master's degrees, are second cycle degrees in the Bologna process of the European Higher Education Area.\nIntegrated Master's degrees\nIn the UK, many universities now have four-year integrated master's programmes (five years in Scotland) mainly in STEM subjects, often with a research project or dissertation in the final year. An integrated master's degree typically includes a year of study at master's level, along with three years (four in Scotland) at bachelor's level. The awards for these may be named after the subject, so a course in mathematics would earn a Master in Mathematics degree, (abbreviated to MMath), or have a general title such as MSci (Master in Science at most universities but Master of Natural Sciences at Cambridge) or MLibArts (Master of Liberal Arts). Examples include MChem, MPharm, MEng, MMath, MPhys. Integrated master's degrees are considered qualifications at master's level and are second-cycle qualification on the qualifications framework for the European higher education area established under the Bologna Process.\nPostgraduate master's degrees\nPostgraduate master's degrees in the United Kingdom can either be taught degrees involving lectures, examination and a short dissertation, or research degrees (normally MPhil, MLitt or MRes programmes). Taught master's programmes involve 1 or 2 years of full-time study. The programmes are often very intensive and demanding, and concentrate on one very specialised area of knowledge. Some universities also offer a ''Master's by Learning Contract'' scheme, where a candidate can specify his or her own learning objectives; these are submitted to supervising academics for approval, and are assessed by means of written reports, practical demonstrations and presentations.\nTaught postgraduate master's degrees\n(MSc, MA, MSt, LL.M., MLitt, MSSc, MEnt etc.)\nThe most common types of postgraduate taught master's degrees are the Master of Arts (MA) awarded in Arts, Humanities, Theology and Social Sciences and the Master of Science (MSc) awarded in pure and applied Science. A number of taught programs in Social Sciences also receive the Master of Science (MSc) degree (e.g. MSc Development Studies at the London School of Economics and University of Bath).\nHowever, some universities - particularly those in Scotland - award the Master of Letters (MLitt) to students in the Arts, Humanities, Divinity and Social Sciences, often with the suffix (T) to indicate it is a taught degree, to avoid confusion with the MLitt offered as a research degree. In the University of Oxford, on the other hand, the MPhil (which is elsewhere reserved for research degrees) is a taught master's degree (normally also including a short research component) and the MSc can be either taught or by research.; the MLitt is also offered as a research degree in the humanities. Some other universities, such as the University of Glasgow, previously used the designation MPhil for both taught and research master's degrees, but have recently changed the taught appellation to MLitt. In the University of Cambridge, the main taught master's degree is the MSt (Master of Studies).\nIn Business Schools a specialist Masters of Business Administration MBA  degree is available to those who have business practice experience. For example, Salford Business School in Greater Manchester offers a degree which is only available to those who can show professional experience.\nIn Law the standard taught degree is the Master of Laws, but certain courses may lead to the award of MA or MLitt.\nUntil recently, both the undergraduate and postgraduate master's degrees were awarded without grade or class (like the class of an honours degree). Nowadays however, master's degrees may be classified into a maximum of four categories (Distinction, Merit, Pass or Fail), while others can have a more simplified form of assessment by only distinguishing between a Pass or a Fail.\nResearch postgraduate master's degrees\nThe Master of Philosophy (MPhil) is a research degree awarded for the completion of a thesis, with the title being reserved for \"extended master's courses that typically involve a substantial element of research or equivalent enquiry\". It is a shorter version of the PhD and some universities routinely enter potential PhD students into the MPhil programme and allow them to upgrade to the full PhD programme a year or two into the course. Advanced candidates for a taught postgraduate master's sometimes undertake the MPhil as it is considered a more prestigious degree, but it may also mean that the student could not afford or could not complete the full PhD. A student who fails to reach the standard required for a PhD may only be awarded an MPhil if they have successfully reached the standard for a master's degree.\nThe Master of Research (MRes) degree is a more structured and organised version of the MPhil, usually designed to prepare a student for a career in research. For example, an MRes may combine individual research with periods of work placement in research establishments.\nThe Master of Letters (MLitt) degree is a two-year research degree at many universities, including Cambridge and the ancient Scottish universities, and is generally awarded when a student cannot or will not complete the final year(s) of their PhD and so writes their research up for the MLitt. Because MLitt is also used for a taught degree, the suffix (T) or (R) for taught or research is often added, so the more prestigious two-year research degree is called MLitt (R).\nLike the PhD, the MPhil and MRes degrees are generally awarded without class or grade as a pass (the standard grade) or can, rarely, be awarded with a distinction.\nNon-master's level qualifications\nMAs in Oxford and Cambridge\nThe universities of Oxford and Cambridge (along with the Trinity College Dublin in Ireland) award master's degrees to BAs without further examination, where seven years after matriculation have passed, and (in some but not all cases) upon payment of a nominal fee. It is commonplace for recipients of the degree to have graduated several years previously and to have had little official contact with the university or academic life since then. The only real significance of these degrees is that they historically conferred voting rights in university elections, it was seen as the point at which one became eligible to teach at the university and certain other privileges e.g. the right to dine at the holder's college's high table. They still do confer some restricted and rarely used voting rights. The MAs awarded by Oxford and Cambridge are colloquially known as the Oxbridge MA, and that from Dublin as the Trinity MA, and would be usually distinguished respectively: MA (Oxon), MA (Cantab) and MA (Dubl), \"Oxon\" here being an abbreviation for Oxoniensis (of Oxford), \"Cantab\" for Cantabrigiensis (of Cambridge) and, \"Dubl\" for Dubliniensis (of Dublin). The Universities of Cambridge and Dublin also offer an MA to certain senior staff - both academic and non-academic - after a number of years' employment with the university. The MAs awarded by Oxford and Cambridge are not considered academic qualifications.\nUntil the advent of the modern research university in the mid 19th century, several other British and American universities also gave such degrees \"in course\".\nScottish MA\nIn Scotland the first degree in Arts, Fine Art, Humanities and Social Sciences awarded by the ancient universities of Scotland is the Master of Arts. The Science and Law faculties of Scottish universities award the BSc and LLB degrees respectively and the New Universities generally award the BA. Scottish undergraduate honours courses (including the MA as well as the BA, BSc and LLB) are four years in length rather than the three years that is usual in the rest of the UK; three-year undergraduate degrees are available in Scotland but lead to non-honours degrees. The Scottish MA with honours is a qualification at the level of a bachelor's degree with honours, and the Scottish MA without honours is a qualification at the level of a non-honours bachelor's degree.\nSee also\n*Master's degree\n*British undergraduate degree classification\n*British degree abbreviations#Master's level qualifications\n*Master's degree in Europe\n*National qualifications frameworks in the United Kingdom\n*Qualification types in the United Kingdom\nReferences"
    }
  ]
}