{
  "content": [
    {
      "type": "text",
      "text": "# Match of the Century (rugby union)__disambig_1\n\n|       team1score = 3\n|            team2 = New Zealand\n| team2association =\n|       team2score = 0\n|          details = Wales won by a try to nothing.\n|             date = 16 December 1905\n|          stadium = Cardiff Arms Park\n|             city = Cardiff\n|          referee = John Dallas (Scotland)\n|       attendance = 47,000\n}}\nThe Match of the Century () is the unofficial name of a rugby union Test match played between Wales and New Zealand at Cardiff Arms Park on 16 December 1905 in front of a crowd of 47,000. The game was billed as the \"Match of the Century\" or \"The World Championship\" as it was a first meeting of the top two international teams.\nThe match was part of New Zealand's \"Originals\" tour and was their only loss in 35 matches. The result provoked much debate, with later writers noting its impact on the sporting culture of both countries. The Welsh crowd's singing of Hen Wlad Fy Nhadau as a response to the All Blacks' Haka is often cited as the first national anthem to be sung before an international sports event.\nBackground\nBy the time the tour arrived in Wales, the All Blacks had not conceded a single point in their last 600 minutes of rugby. They had played 27 matches on the tour so far, scoring 801 points and conceding just 22. They had also won all three of the preceding international matches, two without conceding any points (12–7 against Scotland, 15–0 against Ireland and 15–0 against England).\nWales were also unbeaten that year (defeating England 25–0, Scotland 6–3 and Ireland 10–3 in winning the Home Nations Championship) and had not lost a home international since 1899. As such, many commentators in New Zealand and the UK saw the match as the best chance of stopping an All Blacks clean sweep, and billed the game as the \"Match of the Century\" or \"The World Championship Match\" long before the tour had begun.\nThe All Blacks played Yorkshire, at Headingley Rugby Stadium on 13 December, winning the game convincingly 40–0. The team travelled to Wales by train on 15 December, arriving at Cardiff station in the evening. Despite the late hour, the visitors received a raucous welcome, a large crowd (contemporary estimates put the crowd at 20,000) had gathered to greet the All Blacks both inside the station and along the neighbouring streets, preventing the players from getting to their hotel, and police had to force a path through the crowd for the tourists.\nWelsh preparations\n, published in the New Zealand Observer in 1905. \"Aha,\" Gallaher is depicted as saying, \"I'll have to give the tail of the British Lion another twist to stir him up. And they said England was the home of Rugby Football.\"|alt=A New Zealand rugby player kicking a football while twisting the tail of a lion.]]\nAs early as October, the Welsh Match Committee had been observing the All Blacks tour. On 19 October, the committee travelled to Gloucester and witness the tourists defeating one of the best club sides in England 44–0. It is thought that the scale and manner of this All Blacks victory encouraged the Welsh observers to develop new tactics that could match the tourists' unorthodox style.\nOn 20 November, the first of two trials was held. The \"Probables\" attempted to play the same formation (with seven packed forwards rather than eight) that the New Zealanders had been using throughout the tour. However, the team were beaten 18–9 by a \"Possibles\" team using the traditional Welsh formation. Despite this setback, the selectors persisted with the new formation and won a second trial match 33–11.\nOn 7 December, Dicky Owen took change of another training session where he devised and practiced the move that would result in the match's only try. The final training session was held on 12 December, dedicated to drop kicking and more pertinently, perfecting their new scrum technique.\nAway from the pitch, there were also discussions on a possible response to the Haka. The selector Tom Williams suggested that an appropriately Welsh response to the cultural challenge would be with singing, and that they should sing the Welsh anthem, Hen Wlad Fy Nhadau. Williams' proposal became a matter of national discourse, with the Western Mail publishing numerous articles encouraging Welsh supporters to join the players once the Haka had been completed. Despite the popularity of the suggestion, there was no official plan for a response, and it remained unclear if the crowd would respond at all.\nMatch Day\n|align=right|width=40%}}\nAlthough Wales had long been considered the toughest test for the All Blacks, many in the London press did not see how Wales could win. This view gained momentum as the All Blacks toured England, beating the best English sides by a growing margin. By the day of the match, many commentators had written off Wales' chances completely.\nFor the All Blacks, the test match was their 28th game in three months. Changes were made to the starting XV, with conflicting post-tour reports suggesting players were rested, injured or ill. Billy Stead was reportedly unable to play due an illness, and was asked to run the line for the match instead. Terry McLean later stated his belief that Stead's illness had a crucial impact on the result, with Stead unable to perform his duties (McLean states he left the side line to find a toilet), he left George Nicholson to run the line in his place. McLean and others felt that had Stead been running the line, he would have been able to get to the Deans incident earlier and confirm his score. G. W. Smith would not play, any part in the match despite being one of the tourists' most celebrated athletes, and seen by many as the All Blacks' most attacking three-quarter of the whole tour.\nIt was known that the match would be a major event and additional trains were laid on for the travelling spectators. Large queues formed before the Arms Park gates were opened at 11am and the large turnout meant that the gates had to be shut again by 1.30pm as the ground was already full. Many of those locked outside of the ground climbed trees or found other vantage points in order to glimpse the match. Taxi drivers parked outside the ground and charged people for the privilege of standing on their cabs to get a view over the stand.\nHaka\nNew Zealand had performed the Haka before all tour matches but were often met with indifference or hostility. The Haka was better received by Welsh players and the Welsh public; local journalists had sought information from the New Zealand players themselves, with the South Wales Echo publishing a full transcript and translation of what it called the Te Rauparaha Haka (Ka Mate).\nAt around 2.20pm, as the Welsh regiment's 2nd Battalion Band played Men of Harlech the All Blacks emerged onto the pitch, with the Welsh following shortly after. However, the band, crowd and the Welsh team were all respectfully silent to accept the challenge of the Haka.\nThe national anthem\n|align=right|width=40%}}\nAs the Haka concluded, Teddy Morgan led an immediate response by singing Hen Wlad Fy Nhadau in the direction of the New Zealanders. Morgan encouraged his teammates to join him and the crowd soon followed, unaccompanied by the regimental band.\nThe singing of Hen Wlad Fy Nhadau is the first recorded instance of a national anthem being sung before an international sporting fixture. At this time national anthems were not associated with sport, especially in Europe. Throughout the British Empire, anthems were associated with the royalty and reserved for formal state occasions.\nWitnesses to this event (including the New Zealand players and London press) all note the impact of the anthem on the players, crowd and themselves. Match reports, player interviews and memoirs all cited the anthem as a factor in the Welsh victory, for decades to come. In Wales, the crowds who had already been singing the anthem at cultural events such as Eisteddfods, would now sing the anthem at rugby matches and other sporting occasions as well. Soon, the singing of national anthems would become a formal part of proceedings in a variety of sports and eventually, a standard practice across the world.\nFirst half\nHodges kicked off for Wales and the early play was very tough. There were few opportunities until Seeling made a break for New Zealand, this was brought down by the Welsh defence and the first scrum was called.\nThe All Blacks adopted their usual formation of seven packed forwards and would have expected the Welsh to use the British system of eight. However, Wales not only formed their scrum with seven men but they packed with four men in the front row. This meant whichever side New Zealand tried to gain the loose-head advantage, Wales had a man outside. As the front rows engaged, and the attacking side of the scrum became obvious, the surplus Welsh player on the other side would then retreat into the back row.\nWales were the only team with any real scoring chances early on. Percy Bush made a failed attempt at a drop goal, but the best chance ended when an awkward pass from Jack Williams was dropped by Willie Llewellyn yards from the try line.\nAccounts of the match are unanimous in reporting how unusually poor New Zealand were in the first half, and that they conceded an abundance of penalties in the opening fifteen minutes. One reporter stated that the normally free-scoring All Blacks did not get any play inside the Welsh 25 yard line until the very moment before half-time.\nThe Try\nled the Welsh singing of Hen Wlad Fy Nhadau and would go on to score the only points of the match.]]\nA scrum was called and Dicky Owen saw a chance to call the move he devised in training. As Wales won the ball, Owen ran it down the blindside, with the backline of Bush, Nicholls & Llewellyn following him in support. This initial move drew Gallaher, Hunter and most of the New Zealand backs in that direction. Owen then switched the play, throwing a long pass back to the openside, with Cliff Pritchard having to take the ball at his feet. The long pass gave Pritchard time to draw the covering tackle of Deans before passing to Gabe who similarly drew Duncan McGregor. Finally Gabe passed to Morgan who sprinted more than twenty metres past the covering full-back Gillett to touch down in the left corner on 23 minutes. Wales failed to kick the conversion and this was the only score of the match and the first time that the All Blacks had conceded without first scoring themselves.\nSecond half\nreceiving treatment at half-time.]]\nThere is general agreement that New Zealand gave a much better account of themselves in the second half, although the Welsh scrum would remain in the ascendancy and poor kicking continued to be an issue for the All blacks. Both teams had scoring opportunities, but the All Blacks had most of the attacking play. Billy Wallace did cross the try line, but was called back having run into touch and a forward pass from Deans prevented an inevitable try for McGregor. The All Blacks also had a series of scrums on the Welsh goal line, but were kept from scoring by a strong Welsh defence. However, the closest opportunity came for the All Blacks when three-quarter Bob Deans was brought down inches from the line.\nDeans incident\n|align=right|width=40%}}\nBilly Wallace gathered the ball from a Welsh kick and ran forward with Bob Deans following him in support. Willie Llewellyn tackled Wallace, but not before he passed the ball inside to Deans who then sprinted thirty yards for the line. All the contemporary reports agreed that both Teddy Morgan and Rhys Gabe brought Deans down at or near the try line (with Morgan later saying that the \"honour\" of making the tackle was Gabe's) but the heavy mist made it unclear to spectators if the tackle had stopped the try.\nThere are conflicting reports on whether the referee, John Dallas was late to the incident. Dallas would always refuted this, stating that he arrived in time to clearly see the incident and estimated that Deans had been 6 to 12 inches short of scoring. Gabe would continually state that Deans was \"inches short\", despite struggling forward after the tackle, Percy Bush also stated that he saw Deans was short and made a double movement (illegal in the game at that time) to try and score the try.\nDeans however, believed a try should have been awarded. Following the match, Deans would send a telegraph to the Daily Mail newspaper in London stating that he had in fact grounded the ball before being pulled back and that the referee had indeed arrived late. Deans would always maintain that he had scored the try, reasserting his belief from his death-bed in 1908. A number of Welsh players, including Teddy Morgan also felt his claim was credible.\nMatch details\n|score = 3–0\n|away =\n|try1 = Morgan 23'\n|stadium = Cardiff Arms Park, Cardiff\n|attendance = 47,000\n|referee = J. D. Dallas (Scotland)\n}}\n{| style=\"width:100%\" class=\"wikitable\"\n|-\n!Team details\n|-\n|\n{| width=92%\n|-\n|\n|\n|}\nWales: Bert Winfield (Cardiff), Teddy Morgan (London Welsh), Gwyn Nicholls (Cardiff) capt., Rhys Gabe (Llanelli), Willie Llewellyn (Newport), Percy Bush (Cardiff), Dicky Owen (Swansea), Cliff Pritchard (Newport), Dai \"Tarw\" Jones (Treherbert), Arthur Harding (London Welsh), Jehoida Hodges (Newport), Will Joseph (Swansea), Jack Williams (London Welsh), George Travers (Pill Harriers), Charlie Pritchard (Newport)\nNew Zealand: George Gillett (Canterbury), Duncan McGregor (Wellington), Bob Deans (Canterbury), Billy Wallace (Wellington), Harry Simon Mynott (Taranaki), Jimmy Hunter (Taranaki), Dave Gallaher (Auckland) capt., Fred Roberts (Wellington), Charlie Seeling (Auckland), Alex McDonald (Otago), Jimmie O'Sullivan (Taranaki), Fred Newton (Canterbury, West Coast), Frank Glasgow (Taranaki), Steve Casey (Otago), George Tyler (Auckland)\n|}\nAfter the match\nAt the final whistle the crowd rushed the field and carried some of the Welsh players on their shoulders. Gallaher would later bring his team into the Welsh changing room to congratulate the winners and the players exchanged jerseys. Despite the controversies that would emerge from the result, Gallaher maintained that \"the best team won\".\nLater discussions and interviews would focus on what was so different about the Wales game. The Welsh anthem, scrummaging tactics, the Deans incident and the fitness of the All Black players have all been named as factors. Both Gallaher & Dixon would later write that the Welsh match was \"one match too far\" and the All Blacks, despite what the score lines prior to the match had suggested, were tired.\nCultural impact\nOutside of the two competing nations the large crowd, cultural challenges and press coverage would see both nations stereotyped as being \"addicted\" to rugby. In Wales, the victory cemented the sport's place as a central part of modern Welsh culture. However, other authors saw it as a British victory, with Wales' sole win against the All Blacks upholding the honor of both the mother country and the empire as a whole.\nThe Gallaher shirt\n)]]\nGallaher exchanged shirts with the opposition captain, Gwyn Nicholls. Nicholls subsequently gifted the shirt to Thomas Mahoney, a van boy at his laundry business, and the shirt remained in Mahoney's family until 2015.\nIn 2015, the shirt was auctioned at Rogers Jones & Co in Cardiff. It had been expected to sell for £20,000 to £40,000, but was secured by a UK-based telephone bid for a record £180,000, more than eight times the previous world record for a rugby shirt. It was later revealed that the winner was Nigel Wray, the financial backer and chairman of Saracens F.C., who outbid five separate attempts to secure the item for New Zealand. The shirt has since been on public display at Twickenham Stadium.\nCentenary celebrations\nThe centenary of the match was celebrated during the 2005 All Blacks tour of Britain and Ireland. As in 1905, New Zealand were regarded as the best team in the world, and were now officially ranked as such. Wales had also replicated their 1905 position, winning that year's Grand Slam and remaining undefeated throughout the year. The pre-match Haka and anthems were arranged to replicate their order in 1905. God Defend New Zealand was led by Hayley Westenra before the All Blacks performed the Ka Mate Haka. The Welsh crowd then directly responded with Hen Wlad Fy Nhadau led by Katherine Jenkins, and Cwm Rhondda, led by Wynne Evans.\nThis time, it was the Welsh who were suffering injuries, missing six of their tourists from that summer's British and Irish Lions tour of New Zealand. The match itself was a one-sided affair, with the All Blacks winning 41–3 on their way to claiming a Grand Slam tour.\nSee also\n* History of rugby union matches between New Zealand and Wales\n* History of rugby union in New Zealand\n* History of rugby union in Wales\nBibliography\n*\n*\n*\n*\n*\nReferences"
    }
  ]
}