{
  "content": [
    {
      "type": "text",
      "text": "# Mattewara\n\n| status = Protected forest-range\n| country = India\n| area = Over\n}}\nMattewara is an ancient forest located in Punjab, India near Ludhiana and the Sutlej river. The forest protects Ludhiana from floods, absorbs air-borne pollution emitted by industries in the area, and cleans the local air. It is currently designated as a protected forest-range.\nDescription\nMattewara forest is spread over an area of over 2,300 acres. Many animal species can be found inhabiting it, such as birds, monkeys, deer, sambar, antelopes, wild boar, nilgai, and peacocks. The Botanical and Butterfly Garden, maintained by the Forest Division of Ludhiana, is located within it. As per senior wildlife officer Khushwinder Singh Gill, the forest acts as a wildlife corridor for big cats, such as leopards travelling through the jungles of the Anandpur and Ropar areas.\nProtection status\nThe forest is currently designated under the protected forest category. However, it is not designated as a reserved forest or wildlife sanctuary category, which would confer more protection to it.\nHistory\nThe forest has reverence amongst the Sikhs, as they believe that Guru Nanak drew attention to its importance in protecting Ludhiana from floods. Furthermore, the Mattewara forest is connected by some to the historical Machhiwara jungle that Guru Gobind Singh escaped to in the aftermath of the Battle of Chamkaur in the early 1700s.\nIn 2019, 55 acres of land at Mand-Uddowal village near Mattewara-Rahon Sutlej bridge in the Mattewara jungle were cleared from encroachment in-order to plant saplings.\nProposed industrial park\nIn 2020 the Congress-ruled Punjab government authorized the construction of a 955.67 acre-sized industrial park in the Koom Kalan area near the Mattewara forest and Sutlej river. The Punjab government claims the project will boost the local area's economy and environment. The proposed industrial park was one of thirteen similar projects across India set-up under the PM Mitra Scheme for mega textile parks.\nMattewara Morcha\nAn environmentalist movement, mainly composed of Sikh groups and local inhabitants, opposed the proposed industrial park. Environmentalists and social activists protested the decision of developing the area into an industrial park at the Greater Ludhiana Area Development Authority office. In response, the Punjab Government clarified that the industrial park would not be set up in the designated area of the forest but on land acquired in Sekhowal, Mattewar, Salempur, Garhiyan, Cell Kalan, and Kalewal villages, in addition to the land of the animal husbandry and rehabilitation departments. However, this did not calm concerns as there were worries that the sulphur dioxide and nitrogen oxide emitted from the industrial units would cause air-borne dry and wet acidic substances, damaging the forest's vegetation and polluting the local area. Furthermore, the proposed industrial park would further pollute the already dirtied Sutlej river, similar to the fate of the Buddha Nullah. The government's efforts to clean the Sutlej thus far have failed. Many mass-dying incidents involving fish have been recorded in recent times in the area. Punjab state already has one of the lowest amounts of land under forest cover in India. Every day, around 147 trees are cut down in Punjab and 530,000 trees have been cut down over a period of a decade. The Mattewara forest is located in the Ludhiana district, where the forest cover is only 1.65%.\nThe panchayats of Sekhowal village later protested the move to develop its land, refusing to hand it over (around 416 acres) to the government. Ranjodh Singh, a nature enthusiast from nearby Ludhiana, criticized the government claiming the industrial park would boost the local environment, as the industrial park would be located on the other side of the road where the boundary of the Mattewara forest begins. On the other side of the proposed industrial park is another protected forest, Haidar Nagar. Sikh environmentalist Balbir Singh Seechewal raised concerns over noise pollution, air pollution, and heavy human activity disturbing the flora and fauna of the forest.\nOn 18 July, Amarinder Singh, then chief minister of Punjab, clarified that the proposed industrial park will have proper common effluent treatment plant (CETPs) to handle any industrial waste.\nOn 20 July, a group of seventy nature-lovers and NGOs (including EcoSikh) sent a legal notice to the state government requesting them to cancel the project in-order to safeguard the environment. Jaskirat Singh of EcoSikh opined that economic concerns overpower environmental concerns within the state and that reassurances made by the local government was \"eyewash\".\nOn 22 July 2020, a resolution was passed by the gram sabha of Sekhowal village led by the sarpanch Amrik Kaur against the project.\nThe director of the Department of Industries and Commerce of Punjab, Sibin C., reassured the public that the government would adhere to proper environmental clearance for any work associated with the project. Also, the proposed project would shift industries currently located within the city of Ludhiana outside of the city limits. Gurmeet Singh Kular said that the government should first focus on industrial projects it announced before in the past yet did not complete, such as the Dhanansu Industrial Focal Point that it proposed in 2013 on Chandigarh-Ludhiana road, before trying to initiate new industrial parks.\nA public action committee, called the Public Action Committee (PAC) for Sutlej and Mattewara, composed of twelve members led by Kuldeep Singh Khaira, was formed to oppose the project. Khaira was concerned that if the industrial park was given the go-ahead, a large amount of red-category industries would establish themselves in Mattewara, causing the destruction of the forest. He also criticized the government failing to designate an eco-sensitive zone around Sukhna Wildlife Sanctuary.\nThe AAP-ruled Punjab government under Bhagwant Mann has since cancelled the project in July 2022 for the proposed industrial park at Mattewara due to the opposition it faced. The Public Action Committee (PAC) had fought between July 2020 to July 2022 to prevent the project from becoming reality due to the potential risks it posed to the forest, Sutlej, and the flood-plain.\nReferences"
    }
  ]
}