{
  "content": [
    {
      "type": "text",
      "text": "# Maud O'Farrell Swartz__disambig_1\n\n|birth_place = County Kildare, Ireland\n|death_date  =\n|death_place = New York City, U.S.\n|resting_place= St. John's Cemetery, Brooklyn, New York\n|other_names =\n|known_for   = Labor organizer\n|occupation  =\n|nationality =\n|spouse      = Lee Swartz\n|partner = Rose Schneiderman\n|children    =\n|alma_mater  =\n}}\n'''Maud O'Farrell Swartz''' (1879-1937) was an Irish-American labor organizer who worked to improve the lives of women and children. She served as president of the Women's Trade Union League from 1922 to 1926. In 1931 she was appointed secretary of the New York State Department of Labor under Industrial Commissioner Frances Perkins. She was the first woman and the first trade unionist to hold that position.\nEarly life and education\nMaud O'Farrell was born in County Kildare, Ireland, on May 3, 1879. She was one of fourteen children of William J. Farrell, a flour miller, and Sara Matilda Grace. Her mother was related to William Russell Grace, who became New York City's first Irish Catholic mayor in 1880, and to the owners of the Grace shipping line. Maud O'Farrell was educated at home, and then at convent schools in Germany and France. Afterwards she worked for a time as a governess in Italy. While living in Europe she became fluent in Italian, German, and French.\nCareer\nShe moved to the United States in 1901, settling in New York City. She worked briefly as a governess, quitting after receiving unwanted attention from her employer. The following year she began working as a proofreader for a foreign language printing company, and in 1903 she joined the Women's Trade Union League (WTUL).\nIn 1912 she joined the Woman Suffrage Party. A fluent Italian speaker, she canvassed Italian neighborhoods promoting women's suffrage to the women there.\nShe joined International Typographical Union Local 6, known as \"Big Six,\" in 1913. She served as secretary of the New York WTUL from 1917 to 1921. She was a WTUL delegate to the American Federation of Labor convention in 1919 and the First International Congress of Working Women (ICWW) the same year. At the ICWW, she and other delegates drew up resolutions demanding an age minimum for working children, a 44-hour work week, and regulations for dangerous jobs. In 1921 she traveled to Geneva, Switzerland, as a delegate to the Second International Congress of Working Women. There she was named vice president of the newly founded International Federation of Working Women. Over the next two years she helped organize a global network of working women's groups.\nAfter a year-long hiatus in Europe, she returned to New York in 1922 and began working for the WTUL as an advisor for women seeking workers' compensation. She was elected president of the national WTUL that same year, and re-elected in 1924. She was the first working woman to serve as WTUL president. At the same time, she worked as an adviser to the league's Compensation Service, handling some 4,000 cases between 1922 and 1929. Serving as president while working full time became burdensome, and she resigned the presidency in 1926.\nIn December 1931, Franklin D. Roosevelt appointed her secretary of the New York State Department of Labor, a position she held until her death in 1937. The first woman and the first labor representative to hold that office, she served under Commissioners Frances Perkins and Elmer F. Andrews.\nSwartz was known as a gifted speaker and a champion of better working conditions for women.\nPersonal life\nShe married a printer named Lee Swartz in 1905. It was a brief, unhappy marriage, and the couple soon separated, declining to divorce for religious reasons. In 1912 she met Rose Schneiderman, with whom she had a close friendship until her death. In the 1920s, she and Schneiderman befriended Eleanor Roosevelt, who had joined the WTUL They often visited the Roosevelts and discussed labor problems.\nShe died of a heart attack on February 22, 1937, at the New York Hospital in Manhattan, and was buried in St. John's Cemetery in Brooklyn. Frances Perkins and Eleanor Roosevelt were among those who attended her funeral.\nReferences\nFurther reading\n*\n*"
    }
  ]
}