{
  "content": [
    {
      "type": "text",
      "text": "# Maureen Warner-Lewis\n\n| birth_place   = Tobago, British West Indies\n| death_date    =\n| death_place   =\n| nationality   = Trinidadian and Tobagonian\n| other_names   =\n| spouse        =\n| children      = 2\n| occupation    = Academic\n| education     =\n| alma_mater    = University of the West Indies\n| years_active  = 1968–2015\n| known_for     =\n| notable_works = ''Guinea's Other Suns: The African Dynamic in Trinidad Culture'' (1991)\n}}\nMaureen Warner-Lewis (born 1943) is a Trinidadian and Tobagonian academic whose career focused on the linguistic heritage and unique cultural traditions of the African diaspora of the Caribbean. Her area of focus has been to recover the links between African cultures and Caribbean cultures. She has been awarded multiple prizes for her works, including two Gordon K. and Sybil Lewis Awards, the Gold Musgrave Medal of the Institute of Jamaica, and she was inducted into the Literary Hall of Fame of Tobago.\nEarly life and education\nMaureen Warner was born in 1943  on Tobago in the British West Indies to Eleene (née Sampson) and Carlton Whitborne Warner. When she was three, the family moved to Tunapuna, on Trinidad, where she was raised along with three siblings. Her father was a pharmacist. Warner graduated from St. Joseph's Convent, Port of Spain, an all-girls high school, and in 1962 entered the University of the West Indies (UWI) in Mona, Jamaica, on a scholarship programme. As was typical for British education in the Caribbean at the time, Africa was rarely mentioned. \"Privilege and correctness were associated with things European\", while African traditions were \"either ignored, or considered contemptible, or ridiculous\". Completing a degree in English literature in 1965, she continued her education with graduate studies at the University of York, where she studied linguistics. She focused on Creole languages and graduated in 1967 with her master's degree.\nCareer\nUpon completion of her degree, Warner taught briefly in Trinidad, but in 1968, she moved to the Ekiti region of western Nigeria. She taught English and literature at a boarding school, and learned the Yoruba language, while learning about the culture. She also traveled to other African nations, like Benin, Ghana, and the Ivory Coast. She returned to the Caribbean in 1970 and was hired as lecturer and English tutor at the University of the West Indies.  Along with scholars including Edward Kamau Brathwaite, Jacob Delworth Elder, and Walter Rodney, she focused on recovering and documenting Afro-Caribbean history. She served as editor of the journal Bulletin, African Studies Association of the West Indies.\nIn 1973, Warner married Rupert Lewis, also an academic at UWI, and subsequently the couple had a daughter, Yewande, and a son Jide. Warner-Lewis progressed through the ranks at UWI, becoming a Senior Lecturer, Reader and full professor. She completed her PhD in 1984 and the following year was made head of the English Department at UWI.\nWarner-Lewis' areas of focus were Afro-Caribbean languages and oral literature. Using linguistic analysis and ethnographic techniques, Warner evaluated cultural traditions, linking them to their ethnic roots. Her Pan-Caribbean approach based in meticulous research uncovered many linguistic links between Africa and the Caribbean in all aspects of  culture. Included in her major publications are ''Guinea's Other Suns: The African Dynamic in Trinidad Culture (1991), Yoruba Songs of Trinidad (1994), Trinidad Yoruba: From Mother Tongue to Memory (1996), and African Continuities in the Linguistic Heritage of Jamaica (1996). Her book Central Africa in the Caribbean: Transcending Time, Transforming Culture'' (2003) evaluated the influence from the Congo throughout the region. It was selected as the \"Best Academic Publication of 2003\" by the Book Industry Association in Jamaica; the \"Best Publication\" of UWI's Faculty of Humanities and Education in 2004; and was honoured by the Caribbean Studies Association Conference in 2004 with the Gordon K. and Sybil Lewis Award, after having won over 53 other international entries.\nThe following year, Warner-Lewis became a professor emeritus, though she continued to publish and give lectures on Afro-Caribbean traditions. Her book Archibald Monteath: Igbo, Jamaican, Moravian (2007) told the story of a slave who bought his freedom. Her research on his story took her from Eastern Nigeria to Australia, Scotland, and Jamaica to piece together the history which had been left out of the slave narrative published in 1864. The book garnered Warner-Lewis a second Gordon K. and Sybil Lewis Award beating out 33 other submissions for the prize. In 2009, she was awarded the Gold Musgrave Medal of the Institute of Jamaica for her contributions and scholarship on the heritage and literary traditions of the Caribbean. In 2012, Warner-Lewis was inducted into Tobago's Literary Hall of Fame and in 2015, a second edition of her book ''Guinea's Other Suns was released by UWI Press.\nWorks\n* Guinea's Other Suns: The African Dynamic in Trinidad Culture (1991; 2015)\n* Yoruba Songs of Trinidad (1994)\n* Trinidad Yoruba: From Mother Tongue to Memory (1996)\n* African Continuities in the Linguistic Heritage of Jamaica (1996)\n* Central Africa in the Caribbean: Transcending Time, Transforming Culture (2003)\n* Archibald Monteath: Igbo, Jamaican, Moravian'' (2007)\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n* and\n*|author= |title=Educator Extraordinaire |url=http://www.nlj.gov.jm/lecture-series/indexlecture%20pg6.htm |website=National Library of Jamaica |access-date=14 July 2020 |archiveurl=https://web.archive.org/web/20140326090501/http://www.nlj.gov.jm/lecture-series/indexlecture%20pg6.htm |archivedate=26 March 2014 |location=Kingston, Jamaica |date=2014}}\n*|author= |title=Maureen Warner-Lewis Is Three Score & Ten |url=https://newspaperarchive.com/celebrity-clipping-mar-22-2013-1862062/ |access-date=15 July 2020 |date=22 March 2013 |newspaper=The Gleaner |location=Kingston, Jamaica |page=81 |via=Newspaperarchive.com}}\n*|author= |title=Maureen Warner-Lewis: Winner of Prestigious Book Award |url=https://newspaperarchive.com/celebrity-clipping-jul-18-2004-1862064/ |access-date=15 July 2020 |date=18 July 2004 |newspaper=The Gleaner |location=Kingston, Jamaica |page=73 |via=Newspaperarchive.com}}\n*|author= |title=Professor Maureen Warner-Lewis Wins Carib Studies Prize |url=https://newspaperarchive.com/celebrity-clipping-sep-08-2008-1862918/ |access-date=16 July 2020 |date=8 September 2008 |newspaper=The Gleaner |location=Kingston, Jamaica |page=52 |via=Newspaperarchive.com}}\n*|author= |title=Three Tobagonians Inducted into Literary Hall of Fame |url=https://archives.newsday.co.tt/2012/10/01/three-tobagonians-inducted-into-literary-hall-of-fame/ |access-date=16 July 2020 |date=1 October 2012 |newspaper=Trinidad and Tobago Newsday |archiveurl=https://web.archive.org/web/20200714211313/https://archives.newsday.co.tt/2012/10/01/three-tobagonians-inducted-into-literary-hall-of-fame/ |archivedate=14 July 2020 |location=Port of Spain, Trinidad}}"
    }
  ]
}