{
  "content": [
    {
      "type": "text",
      "text": "# Maureen Wartski\n\n| birth_place = Ashiya, Hyōgo, Japan\n| death_date =\n| death_place =\n| religion =\n| occupation = Author of novels and short stories\n| education = University of RedlandsSophia University (BA)\n| genre = Children's books, Young adult, novels\n| party =\n| movement =\n| notableworks = A Boat to Nowhere\n| website =\n}}\nMaureen Crane Wartski (born Maureen Ann Crane, January 25, 1940 – January 14, 2014) was a naturalized American author. She wrote many novels for children and young adults. Wartski's Eurasian heritage and her deep connection to the natural world inspired many of her novels which address such issues as racism (The Face in My Mirror, Candle in the Wind, A Boat to Nowhere), identity (My Brother Is Special, The Lake Is on Fire, The Promise) and bullying (''Yuri's Brush with Magic'').\nBackground\nMaureen Crane Wartski was born in Ashiya, Hyōgo, Japan, to Albert Edwin Crane, a businessman, and Josephine Wagen Crane, a teacher from Geneva, Switzerland.\nLong before she told her first story at 14, Wartski was in love with writing. As a child, she listened to stories and folktales told by her aunts. Inspired by these folktales, and by an uncle who gave her an early introduction to classical literature, Wartski realized that words are magical things. Her Eurasian heritage and a deep connection with the natural world influenced many of Wartski's young adult and middle-grade novels. A former high school English teacher, Wartski conducted writing workshops and authored many books.\nWartski attended the University of Redlands and received a B.A. in 1962 from Sophia University. That same year she became a naturalized U.S. citizen. She married Maximilian Wartski; they had two sons.\nCareer\nMaureen Ann Crane Wartski worked as a history teacher, a reporter and a lecturer on creative writing. Her first juvenile book, My Brother Is Special, was published in 1979. She also contributed plays and short stories to children's magazines such as Highlights, ''Boys' Life and Scholastic under the pseudonym of M. A. Crane.\nIn 1980, Wartski won the Josette Frank Award from the Bank Street College of Education for her young adult novel A Boat to Nowhere''. In 2010, Wartski wrote her 13th children's book, ''Yuri's Brush with Magic, an adventure story about a young Japanese-American girl who must spend the summer on the North Carolina coast with her mysterious and magical \"Aunt Yuri\" from Japan. In Yuri's Brush with Magic,'' a Next Generation Indie Book Awards Finalist in Children's/Juvenile Fiction, Wartski integrates Japanese folk tales, such as Urashima Tarō, and the Ginger Seller, into a contemporary adventure story for a middle school audience. Wartski was also an accomplished artist.\nWartski believed that race and ancestry are important parts of identity and used these themes in her writing. Yet it is the similarities, the shared memories that allow her characters—and, she hoped, her readers as well–to move past difference and into friendship and trust.\nBibliography\n*Candle in the Wind, 1999, Turtleback Books,\n*A Boat to Nowhere, 1980, Signet Books,\n*My Brother Is Special, 1979, Westminster John Knox Press,\n*The Promise, 2003, Perfection Learning,\n*A Long Way from Home, 1980, Westminster Press,\n*The Face in My Mirror, 1994, Random House,\n*The Lake Is on Fire,1981, Westminster John Knox Press,\n*''Yuri's Brush with Magic, 2010, Sleepy Hollow Books,\nReferences\nSources\n* \"The Importance of Multicultural Themes in Writing and Teaching\". JSTOR: The English Journal'' - Vol. 94, No. 3, Jan. 2005, pp.&nbsp;49–51, by Maureen Crane Wartski\n* \"Refugees and Immigrants: The Southeast Asian Experience as Depicted in Recent American Children's Books\". The Lion and the Unicorn - Volume 23, Number 2, April 1999, pp.&nbsp;219–237, by Michael M. Levy\nExternal links\n*[https://web.archive.org/web/20100516063732/http://maureenwartski.com/ Official homepage]\n*[http://www.sleepyhollowbooks.com]\n*Michael M. Levy, [http://muse.jhu.edu/login?uri=/journals/lion_and_the_unicorn/v023/23.2levy.html], \"Refugees and Immigrants: The Southeast Asian Experience as Depicted in Recent American Children's Books\", The Lion and the Unicorn - Volume 23, Number 2, April 1999, pp.&nbsp;219–237\n*[https://www.jstor.org/pss/30046418 \"The Importance of Multicultural Themes in Writing and Teaching\"] from the JSTOR\n* The Maureen Crane Wartski Papers, de Grummond Collection, McCain Library and Archives, University Libraries, University of Southern Mississippi [https://web.archive.org/web/20100606005753/http://www.lib.usm.edu/~degrum/html/research/findaids/wartski.htm]"
    }
  ]
}