{
  "content": [
    {
      "type": "text",
      "text": "# Max und Moritz Award\n\nThe Max und Moritz Award  (German:Max und Moritz-Preis), also known as the Max & Moritz Prize , is a prize for comic books, comic strips, and other similar materials. It  has been awarded at each of the biennial International Comics Shows of Erlangen since 1984, and is  awarded in several categories, including an audience award and lifetime achievement award. It is open to all material published in Germany.\n1984\n* Best German-language Comic Artist:\n* Best Comic Strip: Hägar the Horrible, by Dik Browne\n* Best German-language Comic/Comic-related Publication: Edition Comic Art (series) (Carlsen Verlag)\n1986\n* Best German-language Comic Artist: Matthias Schultheiss\n* Best Comic Strip: Animal Crackers by Rog Bollen\n* Best German-language Comic/Comic-related Publication:\n** Macao - Internationale Comics (Macao Books, Wuppertal)\n**  Comic Art Magazine (Zürich, Munich)\n** Coeurs de sable, by Jacques de Loustal &  ()\n** Peter and the Wolf, by Jörg Müller & Loriot ()\n1988\n* Best German-language Comic Artist: Franziska Becker\n* Best Comic Strip: Mafalda, by Quino\n* Best German-language Comic/Comic-related Publication: A la recherche de Peter Pan, by Cosey (Carlsen Verlag)\n1990\n* Best German-language Comic Artist: Gerhard Seyfried\n* Best Comic Strip: Calvin and Hobbes, by Bill Watterson\n* Best German-language Comic/Comic-related Publication:\n** , by Miguelanxo Prado (Egmont Ehapa)\n** Watchmen, by Alan Moore & Dave Gibbons (Carlsen Verlag)\n** Volumes of Tardi's work ()\n** Boxer Comic Art Magazine (Edition Kunst der Comics)\n* Special Prize: Art Spiegelman, for Maus\n1992\n* Best German-language Comic Artist: Ralf König\n* Best Comic Strip: B.C., by Johnny Hart\n* Best German-language Comic/Comic-related Publication:\n** Peter Pan, by Régis Loisel (Egmont Ehapa)\n** Théodore Poussin, by Frank Le Gall (Carlsen Verlag)\n** '' Les pionniers de l'aventure humaine, by François Boucq ()\n** Die Bibliothek der großen Comic-Klassiker (series) (Carlsen Verlag)\n** Fires, by Lorenzo Mattotti (Edition Kunst der Comics)\n* Special Prize for outstanding lifetime achievement: Alberto Breccia\n1993 (in Hamburg)\n* Best German-language Comic Artist: Walter Moers\n* Best Comic Strip or Cartoon Series: The Far Side, by Gary Larson\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Es ist ein Arschloch, Maria!, by Walter Moers ()\n** Import: L'Uomo alla Finestra, by Lorenzo Mattotti & Lilia Ambrosi (Edition Kunst der Comics)\n** Humor: , by  (Feest Comics)\n** For Children and Young People: Jimmy Boy, by Dominique David (Carlsen Verlag)\n** Publication About Comics: Entretiens avec Moebius, by Numa Sadoul (Carlsen Verlag)\n** Self-published Comic: Artige Zeiten, by\n* Special Prize for outstanding lifetime achievement: Carl Barks\n1994\n* Best German-language Comic Artist:\n* Best Comic Strip or Cartoon Series: Captain Star, by Steven Appleby\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Der unschuldige Passagier, by  (Arbeitskreis Stadtzeichner Alsfeld)\n** Import: Foligatto, by Nicolas de Crécy & Alexios Tjoyas (Egmont Ehapa)\n** Import: Jeux pour mourir, by Jacques Tardi ()\n** Import: Red Road, by Derib (Carlsen Verlag)\n** For Children and Young People: Full Moon Soup, by Alastair Graham (Bertelsmann Verlag)\n* Best International Writer: Jean van Hamme\n* Special Prize of the Jury: Mecki - Einer für alle, by  ()\n* Special Prize for outstanding lifetime achievement: Will Eisner\n1996\n* Best German-language Comic Artist: Thomas Ott\n* Best Comic Strip or Cartoon Series: Mutts, by Patrick McDonnell\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Lovecraft, by Reinhard Kleist &  (Egmont Ehapa)\n** Import: Saint-Exupéry - le dernier vol, by Hugo Pratt (Egmont Ehapa)\n** Import: Zoo, by Frank Pé &  ()\n** for Children and Young People: John Chatterton détective, by  (Moritz Verlag)\n** Publication About Comics: 100 Jahre Comic Strips, by Bill Blackbeard, et al. (Carlsen Verlag)\n* Best International Writer: Pierre Christin\n* Special Prize of the Jury: Dietmar Hahlweg, prior mayor of the city of Erlangen\n* Special Prize for outstanding lifetime achievement: André Franquin\n1998\n* Best German-language Comic Artist:\n* Best Comic Strip or Cartoon Series: Dilbert, by Scott Adams\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Wüttner, by  ()\n** Import: City of Glass, by David Mazzucchelli & Paul Karasik (Rowohlt Verlag)\n** for Children and Young People: Illustrierte Kinderklassiker (series) (Egmont Ehapa)\n* Best International Writer: Neil Gaiman\n* Special Prize of the Jury: Le Guide des cités, by François Schuiten & Benoît Peeters (Egmont Ehapa)\n* Special Prize for outstanding lifetime achievement: Robert Crumb\n2000\n* Best German-language Comic Artist:\n* Best Comic Strip or Cartoon Series:\n** International: Zits, by Jerry Scott and Jim Borgman\n** Domestic: Touché, by ©TOM\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Geteilter Traum, by Daniel Bosshart ()\n** Import: Approximate Continuum Comics, by Lewis Trondheim (Reprodukt)\n** for Children and Young People: The Wind in the Willows, by  (Carlsen Verlag)\n** Publication About Comics: Die deutschsprachige Comic-Fachpresse, by  ()\n* Best International Writer: Alan Moore\n* Special Prize of the Jury: The Long and Unlearned Life of Roland Gethers, by [http://www.eyestrainproductions.com/ Shane Simmons] ()\n* Special Prize for outstanding lifetime achievement: Moebius/Jean Giraud\n2002\n* Best German-language Comic Artist:\n* Best Comic Strip or Cartoon Series:\n** International: Liberty Meadows, by Frank Cho\n** Domestic: Perscheids Abgründe, by Martin Perscheid\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Moga Mobo - 100 Meisterwerke der Weltliteratur\n** Import: Lost Girl, by Nabiel Kanan (Lost Comix)\n** For Children: Doktor Dodo schreibt ein Buch, by  (Carlsen Verlag)\n** For Young People: Come la vita - Cuori imbranati, by Carlos Trillo &  (Edition Schwarzer Klecks)\n** Publication About Comics: Lexikon der Comics, by Marcus Czerwionka (ed.) (Corian-Verlag)\n* Best International Writer: Frank Giroud\n* Special Prize of the Jury: Karl Manfred Fischer, creator & director of the Erlangen Comics Show\n* Special Prize for outstanding lifetime achievement: José Muñoz\n2004\n* Best German-language Comic Artist:\n* Best Comic Strip: , by\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Held, by Flix (Carlsen Verlag)\n** Domestic: Leviathan, by  ()\n** Import: Persepolis, by Marjane Satrapi ()\n** For Children and Young People: W.I.T.C.H., by Elisabetta Gnone, , , et al. (Egmont Ehapa)\n* Best International Writer: Joann Sfar\n* Special Prize of the Jury: 36 vues de la Tour Eiffel, by André Juillard ()\n* Special Prize for outstanding lifetime achievement: Albert Uderzo\n2006\n* Best German-language Comic Artist:\n* Best Comic Strip: Doonesbury, by Garry Trudeau\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Das Unbehagen, by Nicolas Mahler ()\n** Import: Gli Innocenti, by Gipi (avant-verlag)\n** Manga: Barefoot Gen, by Keiji Nakazawa (Carlsen Verlag)\n** For Children and Young People: Jónas Blondal, by Jens F. Ehrenreich (Epsilon Verlag)\n* Best International Writer: Max Goldt\n* Special Prize of the Jury: Ralf König, for his cartoons and commitment to the conflict revolving around the Danish Mohammed cartoons.\n* Special Prize for outstanding lifetime achievement: Jacques Tardi\n2008\n* Best German-language Comic Artist: Anke Feuchtenberger\n* Best Comic Strip: Flaschko – Der Mann in der Heizdecke, by Nicolas Mahler\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Cash – I see a darkness, by Reinhard Kleist (Carlsen Verlag)\n** Import: Epileptic, by David B. ()\n** Manga: A Distant Neighborhood, by Jiro Taniguchi (Carlsen Verlag)\n** For Children and Young People: Der 35. Mai, by Isabel Kreitz ()\n** Art school project: Plusplus\n* Best International Writer:\n* Special Prizes of the Jury:\n** Hannes Hegen\n** Hansrudi Wäscher\n* Special Prize for outstanding lifetime achievement: Alan Moore\n2010\n* Best German-language Comic Artist: Nicolas Mahler\n* Best Comic Strip: Prototyp and Archetyp, by Ralf König\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Alpha. Directions, by  (Carlsen Verlag)\n** Import: Pinocchio, by Winshluss (avant-verlag)\n** For Children and Young People: Such dir was aus, aber beeil dich, by  (S. Fischer Verlag)\n** Art school project: Strichnin\n** Prize Awarded by the Audience: Today is the Last Day of the Rest of Your Life'', by Ulli Lust (avant-verlag)\n* Special Prize of the Jury: German Edition of Will Eisner's A Contract with God (Carlsen Verlag) and The Spirit ()\n* Special Prize for outstanding lifetime achievement: Pierre Christin\n2012\n* Best German-language Comic Artist: Isabel Kreitz\n* Best Comic Strip: Schöne Töchter, by Flix\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Packeis, by Simon Schwartz (avant-verlag)\n** Import: Footnotes in Gaza, by Joe Sacco ()\n** For Children and Young People: ''Boucle d'or et les Sept Ours nains, by Émile Bravo (Carlsen Verlag)\n** Art school project: Ampel Magazin\n** Prize Awarded by the Audience: Grablicht, by Daniela Winkler (Droemer Knaur)\n* Special Prize of the Jury: Rossi Schreiber ()\n* Special Prize for outstanding lifetime achievement: Lorenzo Mattotti\n2014\n* Best German-language Comic Artist: Ulli Lust\n* Best Comic Strip: Totes Meer, by 18 Metzger\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Kinderland, by  (Reprodukt)\n** Import: Billy Bat, by Naoki Urasawa & Takashi Nagasaki (Carlsen Verlag)\n** For Children and Young People: Hilda and the Midnight Giant, by Luke Pearson (Reprodukt)\n** Art school project: Triebwerk\n** Prize Awarded by the Audience: Schisslaweng, by Marvin Clifford\n* Special Prize of the Jury: Tina Hohl and Heinrich Anders, for the German translation of Jimmy Corrigan, the Smartest Kid on Earth (Reprodukt)\n* Special Prize for outstanding lifetime achievement: Ralf König\n2016\n* Best German-language Comic Artist: Barbara Yelin\n* Best Comic Strip: Das Hochhaus, by\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Madgermanes, by Birgit Weyhe (avant-verlag)\n** Import: This One Summer, by Jillian Tamaki & Mariko Tamaki (Reprodukt)\n** For Children and Young People: Kiste, by  &  (Reprodukt)\n** Art school project: Wunderfitz\n** Prize Awarded by the Audience: Crash 'n' Burn, by Mikiko Ponczeck (Tokyopop)\n* Special Prize of the Jury: avant-verlag\n* Special Prize of the Jury: Luz, for Catharsis (S. Fischer Verlag)\n* Special Prize for outstanding lifetime achievement: Claire Bretécher\n2018\n* Best German-language Comic Artist: Reinhard Kleist\n* Best Comic Strip: Das Leben ist kein Ponyhof by Sarah Burrini\n* Best German-language Comic/Comic-related Publication:\n** Domestic: Wie ich versuchte, ein guter Mensch zu sein by Ulli Lust, Suhrkamp Verlag\n** Import: Esthers Tagebücher'' (Esther's notebooks) by Riad Sattouf, Reprodukt\n** For Children and Young People: Die drei ??? – Das Dorf der Teufel (comic book adaptation of the Three Investigators) by Ivar Leon Menger, John Beckmann and Christopher Tauber, Kosmos publishers\n** Art school project: Paradies curated by Jonathan Kunz (Hochschule der Bildenden Künste Saar)\n** Prize Awarded by the Audience: NiGuNeGu by Oliver Mielke and Hannes Radke, Pyramond\n* Special Prize of the Jury: Paul Derouet\n* Special Prize for outstanding lifetime achievement: Jean-Claude Mézières\n2022\n* Best German-language Comic Artist: Birgit Weyhe\n* Lifetime Achievement Award: Naoki Urasawa\nReferences\nExternal links\n*[https://www.comic-salon.de/en/max-und-moritz-award Max und Moritz Award, Erlangen International Comic Salon]"
    }
  ]
}