{
  "content": [
    {
      "type": "text",
      "text": "# Maxim Suraykin 2018 presidential campaign\n\nThe 2018 presidential campaign of Maxim Suraykin, Chairman of the Central Committee of the Communists of Russia, was announced on 28 May 2017. During the campaign Suraykin said that he expects to win, or take at least second place.\nFollowing the election, Maxim Suraykin scored 499,342 votes (0.68%), taking seventh (penultimate) place.\nBackground\nIn December 2016, it became known that the party of Communists of Russia nominated Maxim Suraykin as presidential candidate.\nOn 28 May 2017, the Plenum of the Central Committee of the Communists of Russia took the decision on nomination of Maxim Suraykin as presidential candidate.\nIn November 2017, Maxim Suraykin was one of the candidates proposed by the Left Front as a single candidate from the left opposition. The results of the voting on the website of the Left Front Suraikin won 59 votes.\nOn 24 December Maxim Suraykin were officially nominated at the Communists Russia National Convention. On the same day he submitted to the Central Election Commission.\nOn 8 February Maxim Suraykin was officially registered as a presidential candidate.\nProgramme\nMaxim Suraykin's programme consists of a few main points:\n*To help the working class win in the class war.\n*Get a redistribution of wealth.\n*Mobilize communist parties in former Soviet lands.\n*Rebuild the USSR and the Socialist system.\n*10 Stalinist hits on Capitalism.\nHis programme consists of two main points. What he would do in the first hundred days and the transitional period between capitalism and a socialist system.\nCampaign\nCollection of signatures\nSignatures in support Suraykin began to gather before New Year holidays. On 22 January Suraykin reported that it was collected 170,000 signatures in the required 100,000.\nOn 31 January Maxim Suraykin handed over the signatures to the CEC. The audit revealed only 3.72% of defective signatures with a maximum permissible 5%.\nCampaign\nOn 27 January 2018, Maxim Suraykin visited Saint Petersburg, thus starting his presidential campaign journey across the country. Suraykin visited the events dedicated to the 74th anniversary of the lifting of the siege of Leningrad, where he honored the memory of the victims during the siege and laid flowers at Piskaryovskoye Memorial Cemetery. Later, he visited the exhibition of automotive technology during the war, and met with residents of the Kalininsky district of St. Petersburg.\nOn 9 February Maxim Suraykin visited Ryazan. During his visit he put flowers to the statue of Lenin. He continued to visit the local markets and factories.\nControversies\nOn February 28, the TV channel \"Red Line\", which belongs to the Communist party, released a story in which Maxim Suraykin was accused of copying the election video of Pavel Grudinin. The report notes that the movie Suraykina almost completely copies the idea, the main points and the video clip of Grudinin. In Suraykin's video clip, as well in Grudinin's video clip begins with the image of the rotating Earth, they are identical graphics, font and label layout. In addition, rollers of identical symbols, at the end of the Suraykin's video, logo appears, exactly the same logo of Grudinin, and the final splash screen and the inscription is identical to the splash screen and the inscription roller Grudinin, with the exception of photos. Suraykin was accused of spoiling and that copying the video made to confuse voters.\nAftermath\nAfter losing the election, Maxim Suraykin criticized the election, saying: \"we know how our electoral system works.\"\nSuraykin said that his \"real result\" should be from 15% to 20%, but did not rule out that \"the unique electoral system will eventually give less than a percent.\" He noted that such an indicator would not suit him at all. Then declared: \"I warn all members of the (Electoral) Commission, all heads of the commissions where you have zero, guys, we to you will come. We will study these results and achieve criminal liability for counterfeiters. We are quite a strong party.\"\nIn addition, Suraykin said that he will participate in the next presidential election, and win.\nReferences"
    }
  ]
}