{
  "content": [
    {
      "type": "text",
      "text": "# May Alden Ward\n\nMay Alden Ward (March 1, 1853 - January 14, 1918) was an American author known for her biographies of such writers as Petrarch and Dante.\nBiography\nShe was born May Alden in Mechanicsburg, Ohio, one of three children of Prince William Alden (a merchant and banker) and Rebecca (Neal) Alden. She was a descendant of Captain John Alden, who came to America on the Mayflower. She early developed an interest in literature and languages and by the age of 16 was contributing articles to a Cincinnati periodical.\nShe graduated from Ohio Wesleyan University in 1872 at the age of 19 and a year later married William G. Ward, who held various academic positions over his career including history professor at Baldwin University near Cleveland and later English literature professor at Syracuse University in New York and at Emerson College in Boston.\nWard traveled for two years in Europe to continue her study of Italian, French, and German literature. In 1887, she published a life of Dante, followed four years later by a life of Petrarch. Reviewers praised these books for their skillful synthesis of the existing scholarship, and the New York Times singled out Ward's lively, clear prose style and historian's instinct. Author William Dean Howells commented that her work removed \"the stain and whitewash of centuries\" to reveal the underlying historical truth. Her subsequent book on John Ruskin, Leo Tolstoy, and Thomas Carlyle, Prophets of the Nineteenth Century, was hailed as   masterly.\nWard also lectured on French and German literature and became a popular speaker on the women's club circuit.\nIn the late 1890s, Ward and her family moved to Massachusetts, where she served as president of various organizations including the New England Women's Club (succeeding the poet Julia Ward Howe in that role), the New England Woman's Press Association, and the Cantabrigia women's club. She was also a charter member of the Authors' Club of Boston and one of the Massachusetts state commissioners for the St. Louis World's Fair of 1904.\nShe was killed in an accident when the car she was riding in on her way home from an evening lecture collided with an electric streetcar in Boston.\nBooks\n* Dante: A Sketch of His Life and Works (1887)\n* Petrarch: A Sketch of His Life and Works (1891)\n* Old Colony Days (1897)\n* Prophets of the Nineteenth Century: Carlyle, Ruskin, Tolstoi (1900)\nReferences\nExternal links\n*\n*"
    }
  ]
}