{
  "content": [
    {
      "type": "text",
      "text": "# Maya Schenwar\n\nMaya Schenwar (born November 10, 1982) is the editor-at-large and former editor-in-chief of Truthout and a writer focused on prison-related topics. She is the co-author of Prison by Any Other Name: The Harmful Consequences of Popular Reforms, author of ''Locked Down, Locked Out: Why Prison Doesn't Work and How We Can Do Better, and a co-editor of the anthology Who Do You Serve, Who Do You Protect? Police Violence and Resistance in the United States. She has written about prison issues for Truthout, The New York Times, The Guardian, The Nation, Ms. Magazine, and other publications.\nCareer\nSchenwar is the editor-in-chief of the independent journalism organization [https://truthout.org/about/ Truthout.] In addition to Truthout, she has written for The New York Times, The Guardian, The Nation, The Star-Ledger, and many other publications. Coverage of Schenwar’s work and interviews with Schenwar have appeared in C-SPAN, Democracy Now, MSNBC, Al Jazeera, Library Journal, The Thom Hartmann Program, Talking Points Memo, Wisconsin Public Radio, Minnesota Public Radio, The Majority Report, The Utne Reader, In These Times, The Sun magazine, YES! Magazine, The Real News Network, TakePart Live, Marfa Public Radio, AlterNet, ColorLines, Bitch Magazine, Feministing, Citizen Radio, Solitary Watch, WBAI, KPFK, The Toast, KPFA, WHMP, WMPR, High Times, KPFT, and others. She has done a wide range of public speaking, both in the United States and internationally, at universities, community centers, conferences, prisons, bookstores, and other venues.\nIn February 2016, Schenwar presented a TEDx talk in Baltimore on prison abolition. Schenwar is also a board member of Love & Protect, an organization that supports those who identify as women and gender non-conforming persons of color who are criminalized or harmed by state and interpersonal violence, and of the Chicago Community Bond Fund, a revolving fund and advocacy organization that pays bond for people charged with crimes in Cook County, Illinois. Previous to her work at Truthout, Schenwar was a contributing editor at Punk Planet magazine and served as media coordinator for Voices for Creative Nonviolence. She served as chair of the coordinating committee for The Media Consortium, and is a member of the advisory board for Waging Nonviolence.\nBooks\nSchenwar is the co-author, with Victoria Law, of Prison by Any Other Name: The Harmful Consequences of Popular Reforms (The New Press, 2020).'' The book, which contains a foreword by Michelle Alexander, details the dangerous ramifications of prison and policing reforms such as electronic monitoring, community policing, coercive drug treatment, and psychiatric hospitals. It also examines the racism and oppressive foundations of extensions of the prison-industrial complex such as the child protective services system and school policing. Schenwar's book, Locked Down, Locked Out, examines how prison breaks apart families and communities, and how severing those bonds between people actually hinders the prospect of real collective safety for all. The book is told through the story of Schenwar's own family’s experience, alongside those of many other incarcerated people and their families. The book also profiles a number of decarceration campaigns, as well as restorative and transformative justice efforts, happening around the country. It focuses on intersectional projects that emphasize connection, community-building, and racial justice. Schenwar also co-edited Truthout's anthology, Who Do You Serve, Who Do You Protect?: Police Violence and Resistance in the United States. This book's essays chronicle the roots and manifestations of police violence, as well as the contemporary efforts to resist racist and oppressive policing.\nSelected articles\n* A Virtual Visit to a Relative in Jail. The New York Times, September 2016.\n* To  Make Health Care for All a Reality, Stop Killing People Truthout, February 2016.\n* Too Many People in Jail? Abolish Bail. New York Times, May 2015.\n* Mandatory Rehab Is Just the Newest Front in the Flawed War on Drugs. The Guardian, October 2014.\n* Reduce Gun Penalties. The New York Times, March 2014.\n* The Prison System Welcomes My Newborn Niece to This World. Truthout, September 2013.\n* Your Home Is Your Prison: How to Lock Down Your Neighborhood, Your Country, and You. TomDispatch, January 2015.\nAwards\nSchenwar has won a Society of Professional Journalists Sigma Delta Chi Award, an Independent Publisher Book Award, the Women's Prison Association's Sarah Powell Huntington Leadership Award, and a Lannan Foundation Residency Fellowship.\nPersonal life\nMaya Schenwar had a sister named Keeley Schenwar. Keeley like Maya was also a prison activist, and had written about her own experience as an incarcerated mother in prison. Keeley Schenwar died from a heroin overdose on February 4, 2020. Truthout, the online publication of which Maya Schenwar is the Editor-in-Chief, holds an annual memorial essay prize, entitled the Keeley Schenwar Memorial Essay Prize. The prize seeks to honor the writing of those who are either formerly or currently incarcerated, as well as \"to continue drawing attention to the cruel realities of the oppressive systems she struggled against and wrote about.\"\nSchenwar was interviewed about her life and the life and death of her sister by [http://www.nicholasdegenova.com Nicholas De Genova] for Episode 1 of the [https://metropolisrisingpodcast.buzzsprout.com/1565270/8026556-the-show-goes-on-remembering-keeley-with-prison-abolitionist-maya-schenwar?play=true Metropolis Rising podcast].\nSee also\n*Prison abolition movement\nReferences\nExternal links\n*[http://www.truth-out.org Truthout]\n*[http://www.mayaschenwar.com Maya Schenwar's website]\n*[https://www.bkconnection.com/ Berrett-Koehler Publishers]\n*[http://www.haymarketbooks.org Haymarket Books]"
    }
  ]
}