{
  "content": [
    {
      "type": "text",
      "text": "# Mbata Kingdom\n\nThe Mbata Kingdom is the traditional name of a Bantu kingdom north of Mpemba Kasi, until it merged with that state to form the Kongo Kingdom around 1375 AD. Its main ancestor is the Sovereign Nsaku Ne Vunda.\nThe founding myth of the Kongo Kingdom begins with the marriage of Nimi a Nzinga to Lukeni Lua Sange, daughter of Nsaku-Lau, chief of the Mbata people.\nTheir marriage would solidify the alliance between the Mpemba Kasi and the neighboring Mbata people, an alliance that would become the basis of the Kongo Kingdom. Nimi a Nzinga and Luqueni Lua Sange had a son named Lukeni lua Nimi, who would become the first person to receive the title of Mutinù (King), which gave rise to the Simbulukeni people (existing to this day).\nHistory\nMbata is a precursor kingdom of the Kingdom of Kongo, as it originated from the marriage between Nima a Nzima, leader of the Mpemba Kasi people, and Princess Luqueni Luansanze, daughter of Nsa-Cu-Clau, king of Mbata. Their marriage solidified the alliance between these two peoples. Nimi a Nzima and Lukeni Luansanze had a son named Lukemi Lua Nimi, born between 1367 and 1402, who would become the first leader to assume the title of Mutinu (King). Mbata's powerful army was essential in the conquest of the kingdom of Mwene Kabunga, located on a mountainous plateau to the south, consolidating the territory that would give rise to the Kingdom of Kongo, and King Lukemi Lua Nimi would assume the title of Mwene Kongo (literally the king of all the kingdoms of Kongo). Thanks to its precedence in the origin of the Kingdom of Kongo, Mbata has always had a privileged position, being a kingdom within the kingdom. Its king was not appointed by Manicongo (Mwene Kongo), but inherited by the descendants of Lukeni Luansanze through the matrilineal line. Strongly inclined towards trade and diplomacy, its princes were traditionally responsible for the diplomacy of the Kingdom of Kongo.\nAfter the adoption of Catholicism and Western customs, the Kingdom of Mbata came to be known as the \"Duchy of Bambata\" (Ba Mbata), a designation under which it remained until the abolition of the Kingdom of Kongo by the republican government of Portugal in 1914, when all the kingdoms of Kongo were officially converted into colonies.\nAfter the abolition of the Kingdom of Kongo, the lineages of the rulers of some of its suffragan kingdoms continued to be transmitted clandestinely. Angola gained its independence in 1975 and among its soldiers was a prince from Mbata, Lieutenant Colonel Nzola Messo Antônio who, commanding the 19th Brigade of the Tactical Group, stopped the invasion of the province of Cunene by the Apartheid forces in 1982.\nIn 2008, the Angolan constitution began to recognize the authority of traditional monarchs in its articles 223 and 224. The now king of Mbata, Nzola Meso Antônio, reorganized the kingdom's court and began to establish diplomatic relations with the other kingdoms originally part of the Greater Congo and, on January 7, 2017, signed the Act of Unification, being crowned on May 3, 2018 as the King of Congo. King Nsola Meso Antônio died on October 9, 2021, and was succeeded by the young prince Makitu, who was enthroned as King Makitu III on July 29, 2023, after a long and traditional succession process. The ceremony took place at the old São Miguel Fortress, known as Forte Velho de Luanda, and was attended by ambassadors from several countries, such as the United States, Italy, Israel, Mozambique, Norway, and other traditional kingdoms such as Bailundo and Cuanhama.\nUnder the reign of Makitu III, the Kingdom of Mbata gained international notoriety, and the new king has been received by leaders and authorities from several countries, such as the United States of America, Italy, and the United Arab Emirates.\nCurrently, the Kingdom of Mbata subsists within the Republic of Angola as a Traditional Political-Community Organization, as established by article 224 of the Angolan constitution.\nGeography\nAccording to historians, Mbata was located to the east, next to the Kwango River, it was not really a province, it was rather a kingdom that had voluntarily been subject to the king of Congo. Mani Mbata was not chosen or appointed by the king. This responsibility belonged to Kanda Nsaku, and within this family he was elected by the people of Mbata. Later, the Mpassi clan (ki) appears, disputing this privilege with the Nsaku clan (ki). Mbata had a large army to defend himself against the Jagas, who were fierce neighboring peoples.\nThe capital of Mbata - Zombo - Bambata was the town of Makela Ma Zombo, located in Kibokolo Commune, Uige Province, in northern Angola.\nMaquela do Zombo is an Angolan city and municipality located in the province of Uíge, consisting of the headquarters commune, corresponding to the city of Maquela do Zombo, and the communes of Beu, Cuilo Futa, Quibocolo and Sacandica.\nBetween the 16th century and 1914, its territory corresponded to the Duchy of Bambata, one of the richest and most important entities in the Congo Empire. Maquela do Zombo, its capital, is a town, with a population of 42,000 (2014 census), and a municipality, with a population of 127,351 (2014 census), in Uíge Province in Angola\nSocial structure\nThe social organization of the Mbata kingdom generally reflects the culture of the Greater Congo. The basis of social organization is the clan, a nucleus of individuals united by ties of kinship. The leader of a village and of a group of people, whether or not related by blood, but who recognize his authority, formerly the owner of some slaves and women, was called \"soba\". Most Mbata clans follow matrilineal succession (Kanda), although the Zombo people also admit patrilineal clans (Lumbu). Chiefs with political power in the kingdom and descended from a mythical ancestor receive the title of \"mfumu\".\nThe clan performed a political function, defined by an economy and a territory with the right to administer justice and security, and its members helped each other, although this association was expressed in terms of mystical kinship or exogamy. The clan was, and still is, an intermediate structure between the extended family and the nation.\nDue to its mythical origin and links to the ancestry of the Zombo people and the Kingdom of Congo, spiritual power plays a central role in Mbata society. The chief priest of the kingdom was originally known as Mani Vunda, and was also known as “Taata” (synonymous with father, in the sense of patriarch of uterine power). The Mani Vunda, or Taata, in addition to being the chief religious authority of the kingdom, played a fundamental role in the coronation of the kings of Mbata and Congo.\nPolitics\nThe basis of political authority in the kingdom of Mbata is the headship of families, exercised by those who hold the power of Kanda (matriarchal ancestry). A group of families constitutes a clan, led by a \"soba\".\nLeaders invested with political power in the kingdom and heirs of a mythical ancestor receive the title of \"Mfumu\", a title that also applies to princes.\nNobles invested with political authority, such as provincial governors, judges and priests receive the title of \"mani\".\nThe king of Mbata is also given the title of \"mani\", in this case the Mani Mbata, one of the 12 electors of the king of all the Congos, the Manicongo, which gave the Mbata royalty great prestige within the Kingdom of Congo. However, other names also designated royal authority, such as \"Ntim\" and \"Ntotiia\".\nThe other most important authority in the Kingdom of Mbata resides in the chief priest of the kingdom, originally known as Mani Vunda and also as “Taata”, who, representing the spiritual link with the ancestors of the kingdom, crowned the Manicongo.\nAlso worthy of note is the privilege granted to the Kingdom of Mbata by the King of Kongo in controlling the zimbu currency. It was the responsibility of a close relative of the monarch, the Mani Kabunga, who was responsible for commanding the women who collected and distributed the zimbu, a cowrie shell known scientifically as “cauris cipraea moneta”, used as currency in the Kingdom of Kongo and other neighboring kingdoms, to which great value is attributed to this day.\nReferences\nBibliography\n* Ilídio do Amaral, O Reino do Congo, os Mbundu (ou Ambundos) o Reino dos \"Ngola\" (ou de Angola) e a presença portuguesa de finais do século XV a meados do século XVI (Lisboa, 1996)\n* David Birmingham, [https://archive.org/details/tradeconflictina0000birm Trade and Conflict in Angola: The Mbundu and Their Neighbours Under the Influence of the Portuguese, 1483–1790] (Oxford, 1966)\n* Beatrix Heintze, Studien zur Geschichte Angolas im 16. und 17. Jahrhundert:  Ein Lesebuch (Cologne, 1996)\n* Meyer Fortes and E. E. Evans-Pritchard, African Political Systems (London, 1940)\n* António Barroso, [https://aqualibri.cimcavado.pt/bitstream/20.500.12940/19319/1/O%20Congo%20seu%20passado%2c%20presente%20e%20futuro.pdf O Congo – seu passado, presente e futuro] (Lisboa, 1889)"
    }
  ]
}