{
  "content": [
    {
      "type": "text",
      "text": "# McClelland & Stewart\n\n| founder      = John McClelland and Frederick Goodchild\n| successor    =\n| country      = Canada\n| headquarters = Toronto, Ontario\n| distribution =\n| keypeople    =\n| publications = Books\n| topics       =\n| genre        =\n| imprints     = Douglas Gibson, Emblem, Tundra, New Canadian Library\n| revenue      =\n| numemployees =\n| nasdaq       =\n| url          =\n}}\nMcClelland & Stewart Limited is a Canadian publishing company. It is owned by Penguin Random House of Canada, a branch of Penguin Random House, the international book publishing division of German media giant Bertelsmann.\nHistory\nIt was founded in 1906 as McClelland and Goodchild by John McClelland and Frederick Goodchild, both originally employed with the \"Methodist Book Room\" which was in 1919 to become the Ryerson Press. In December 1913 George Stewart, who had also worked at the Methodist Book Room, joined the company, and the name of the firm was changed to McClelland, Goodchild and Stewart Limited. When Goodchild left to form his own company in 1918, the company's name was changed to McClelland and Stewart Limited, now sometimes shortened to M&S.\nThe first known imprint of the press is  John D. Rockefeller's Random Reminiscences of Men and Events. In the earliest years, M&S concentrated primarily on exclusive distribution and printing agreements with foreign-owned publishing houses. But the company did feature home-grown authors alongside their foreign offerings - the second catalogue issued by the company was titled Canadiana: A list of Books on Canada and Canadian Questions, Books by Canadian Writers.\nPublications and authors\nIn 1910 Kilmeny of the Orchard by L. M. Montgomery was issued by the press, the first by a Canadian author. The company slowly expanded its list of Canadian authors to include writers such as Bliss Carman, Duncan Campbell Scott and Stephen Leacock. When McClelland's son, Jack joined the company in 1946, the company started moving away from the distribution of books published outside the country. With the establishment of a Canadian subsidiary of Doubleday and Co., a firm which McClelland and Stewart had previously held Canadian distribution deals with, Jack started the move to a more Canadian-based catalogue: \"I decided that I didn't want to be dependent on foreign agencies. I saw that a logical decision in London or New York could cut our volume in half. A Canadian nationalist was born overnight.\" By 1962, most of the company's activities were associated with Canadian publishing. This included writers Margaret Atwood, Pierre Berton, Leonard Cohen, Peter Gzowski, Donald Jack, Margaret Laurence, Farley Mowat, Michael Ondaatje and Mordecai Richler.\nJack McClelland acted as the head of the company since the early 1950s, though he was officially in the position of general manager. John McClelland acted as chairman of the board of directors until his death in 1968.\nImprints and others\nQuality paperbacks were produced in Canada with their New Canadian Library series, launched with four titles. They were aimed at a college or university market, for course texts. The term \"quality\" was intended to suggest a divide between the mass market paperback and this higher production valued, often scholastic, publication. These paperbacks were the same size as mass market paperbacks, but had more sober covers, sometimes better quality binding, and were produced in smaller print runs. This was at a time when Canadian literary identity was beginning to be valued on a large scale level in Canada (it was after the war, and influenced by that as well). The 1950s had seen rare inclusions of Canadian content in English literature classes, and in the 1960s and 1970s, Canadian literature was being included more frequently in Canadian education. The New Canadian Library was said to have been an important factor in the establishment of the Canadian Literary identity. Macmillan of Canada was a major competitor of the New Canadian Library.\nIn 1986, M&S hired editor and publisher Douglas Gibson from Macmillan, giving him his own Douglas Gibson Books imprint. Many of the authors Gibson had worked with at Macmillan — including Alice Munro, Mavis Gallant, Robertson Davies, Jack Hodgins, Guy Vanderhaeghe, Hugh Maclennan and W. O. Mitchell — followed him to the new imprint. The first book published under the Douglas Gibson Books imprint was Munro's The Progress of Love. Gibson became the publisher of McClelland and Stewart in 1988, and the company's president in 2000.\nAt times, the company's financial future has been uncertain. In 1971, the Ontario Development Corporation made a $961,645 loan to stave off imminent collapse due to an unsustainable burden of debt. In 1986, the company was purchased from McClelland by Avie Bennett. In 2000, Random House of Canada bought a 25% share in the company. The other 75% was donated to the University of Toronto. In 2011, Random House bought the remaining 75% of the company to become sole owner.\nLegacy\nCanada Post has issued a single commemorative stamp celebrating McClelland & Stewart's centennial. The stamp, designed by James Roberts of Overdrive (Design Limited), was issued nationwide on April 26, 2006, with the first day of issue ceremonies at the University of Toronto.\nParent company\nPenguin Random House\nIn 2011, University of Toronto sold its shares of McClelland & Stewart to Random House for $1. In 2013, Random House's parent company, Bertelsmann, entered into a joint venture with Pearson PLC (the parent company of the Penguin Group) to form a new trade publishing company called Penguin Random House. As part of this venture Random House of Canada and Penguin Canada were amalgamated as Penguin Random House Canada.\nReferences\nFurther reading\n* James King, Jack: The Story of Jack McClelland, Toronto: Knopf Canada, 1999.\n* Roy Macskimming, The Perilous Trade: Book Publishing in Canada, 1946 - 2006. Toronto: Random House Canada, 2003.\n* Jack McClelland (edited by Sam Solecki), Imagining Canadian Literature: The Selected Letters of Jack McClelland, Toronto: Key Porter, 1998.\nExternal links\n* [http://www.mcclelland.com/ McClelland and Stewart website]\n* [http://library.mcmaster.ca/archives/findaids/fonds/m/mcstew.htm McClelland & Stewart Archive] at McMaster University"
    }
  ]
}