{
  "content": [
    {
      "type": "text",
      "text": "# McClure Arctic expedition__disambig_1\n\nThe McClure Arctic expedition, one of many attempts to find the missing Franklin expedition, was significant for being the first to successfully discover and transit the Northwest Passage, which it accomplished by both boat and sledging.\nRobert McClure and his crew spent three years locked in the pack ice aboard  before abandoning the ship and making their escape across the ice. Rescued by , which was itself later lost to the ice, McClure returned to England in 1854, where he was knighted and rewarded for completing the passage.\nThe expedition discovered the first known Northwest Passage, in the geographical sense, which was the Prince of Wales Strait. It also made the first passage, or journey, across the Canadian Arctic from the Pacific to the Atlantic Ocean. It did not, however, traverse the Prince of Wales Strait. Instead, the expedition did a portage across Banks Island, crossed the Banks Strait, Melville Sound, Barrow Strait, and then entered the Atlantic Ocean via the Parry Channel. As the expedition had been beset by numerous troubles, this second route was \"discovered\" haphazardly as the crew of the expedition attempted to find their way to civilization.\nToday, shipping across the Northwest Passage is a rare occurrence and is not commercially viable due to the unreliability of predicting the state of sea ice in the region. The , the first commercial ship to cross the Northwest Passage, used the first route that McClure discovered, the Prince of Wales Strait in 1969.\nPreparation\nLady Jane Franklin pressed the search for the Franklin Expedition, missing since 1847, into a national priority. McClure had gained experience searching for the lost Franklin expedition in 1848 as the first lieutenant on  under the command of James Clark Ross, but they had found no trace of the lost expedition. Faced with a continuing lack of progress, the British Admiralty, on 15 January 1850, ordered a new expedition to \"obtain intelligence, and to render assistance to Sir John Franklin and his companions, and not for the purposes of geographical or scientific research,\" although a completion of the proposed Northwest Passage from the opposite direction would not be without merit.\nTwo ships were assigned to this task. Enterprise was returned to the search under Captain Richard Collinson, and  under Commander Robert J. McClure in his first Arctic command. Extensive repairs were required for both ships, which had already weathered Arctic service, including the installation of a modern Sylvester's Heating Apparatus. Investigator, her figurehead representing a walrus, had been fitted with a 10-horsepower locomotive engine and strengthened extensively in 1848.\nPreserved meat was secured from Gamble of Cork, Ireland, and although some spoilage was experienced, it had no major impact on the voyage (subsequently discovered to be the case with Franklin).\nDouble rations of preserved limes were provisioned to offset scurvy. A seven-month voyage across the Atlantic, through the Straits of Magellan, to Hawaii and through the Aleutian Islands to the Bering Strait was planned to reach the pack ice during the most ice-free Arctic season. The ships were provisioned for a three-year voyage.\nThe initial voyage\nOn 10 January 1850, the ships set out from Woolwich after a rapid preparation period, completing their loading of supplies in Plymouth on 20 January. The crew numbered 66, including German clergyman John Miertsching, who served as an interpreter to the Inuit.  By 5 March, they had crossed the equator southward and slave ships were observed in the latitude of Rio de Janeiro, described by the expedition surgeon Alexander Armstrong as 'suspicious.' Their southernmost extent, the Strait of Magellan, was obtained on 15 March, Enterprise always well ahead of the slower Investigator. The two ships lost direct contact after the strait was completed, although McClure reported (by bottle-message) that he considered their company formally parted on 1 February 1850.\nContinuing north through several storms, nearly  of stored biscuit was ruined by water leakage, but was later offset by fresh supplies from the Sandwich Islands. On 15 June, Investigator re-crossed the equator amid clear skies and tropical birds, already having journeyed nearly 15,000 miles. Spirits ran high, with McClure noting of the crew in his journal, \"I have much confidence in them. With such a spirit what may not be expected, even if difficulties should arise?\" On 1 July, they made port at Honolulu, taking on fresh provisions, and having missed Enterprise by only one day. Five days later, McClure's ship, aided by favorable winds, set out towards the Arctic Circle and passed by his consort ship and . By 28 July, they had reached the Arctic Circle. The crew busied themselves by readying the arctic gear as they prepared to explore the Arctic alone.\nThe Arctic reached\nRather than waiting to rendezvous with Enterprise, the unusual decision was made to take Investigator alone into the ice near Cape Lisburne, Alaska.  On 20 July, McClure had sent a letter (via Herald) notifying the Secretary of the Admiralty of this intent, stating that since Enterprise had already detached from the expedition, proceeding on alone was the best contingency plan available to ensure the success of their mission. The ice fields were sighted on 2 August at 72°1' north.  Unable to find open leads, they rounded Point Barrow, the northernmost point of Alaska, and entered unexplored waters and the first ice floes.\nWhile Enterprise arrived at Point Barrow about two weeks after Investigator, it was unable to pass through the ice and had to turn back, wintering in Hong Kong and wasting a whole season. The two ships never made contact for the remainder of their journeys, and Enterprise carried out its own separate Arctic explorations.\nOn 8 August, McClure and Investigator made contact with local Inuit, who offered no news of Franklin, and were unaccustomed to seeing sailing ships. As the crew made their way along the coast east of Point Barrow, they left message cairns at each landing site and occasionally traded with local Inuit. However, they did not obtain any news about Franklin.\nContact was made with several groups of Inuit near Point Warren near the Mackenzie River, one of which reported the death of a European.  It was soon determined not to be a member of Franklin's party, but that of an overland expedition of Sir John Richardson two years earlier. The ice to the north remained impenetrable, but they made Franklin Bay to the west by 3 September amid much wildlife in air and sea. After sighting an extent of Banks Island, claiming it as \"Baring Land\", a brief land exploration was made, presumably the first.  A rock formation at a prominent cape was named Nelson Head on 7 September after its imagined resemblance to Lord Nelson. The coast was followed in hopes of access to the north.\nPeriods of good progress were made, until a wind change caused the ice to close in around Investigator on 10 September just as they had discovered a route of some promise, the Prince of Wales Strait. Their progress through the ice was deliberate and slow, aided at times by the use of ice anchors and saws.  Daily temperatures were now around .  By 16 September, they had reached 73°10'N, 117°10'W, logged as her most advanced position.  Just short of Barrow's Strait, the rudder was unshipped and winter preparations began. A year's worth of provisions were brought on deck in anticipation of the ship being crushed by the pack ice. The dangerously drifting pack finally ground to a halt on 23 September.\nAt times violently shifted by the grinding pack ice, Investigator endured just south of Princess Royal Island, the pack becoming less violent by 27 September 1850.  On the last day of September, the temperature fell below  for the first time, as the top-gallant masts were taken down for the winter and the last birds were observed. Periods of calm were often punctuated by violent ice movement. McClure noted, \"The crushing, creaking, and straining are beyond description, and the officer of the watch, when speaking to me, is obliged to put his mouth close to my ear, on account of the deafening noise.\" The ship was lifted several feet, and black powder was used to blast any nearby hummocks that threatened to reach the deck.\nSeveral explorations across the ice to land were made, and observations left McClure with no doubt as to the existence of a Northwest Passage.  In mid-October, formal possession of Prince Albert's Land and several nearby islands was taken. The crew began the routines that would characterise their Winter Quarters, which included lessons in reading, writing, and arithmetic. Hunting opportunities were sparse, although five musk oxen were taken around this time, extending rations (some lost to spoilage) with fresh meat.\nThe Northwest Passage\nOn 21 October 1850, Captain McClure embarked on a seven-man sledge trip north-east to confirm his observations of a Northwest Passage. McClure provided that confirmation upon his return on 31 October, having seen an unblocked strait to the distant Melville Island from a  on Banks Island. The entry placed in the ship's log read:\n\"October 31st, the Captain returned at 8.30. A.M., and at 11.30. A.M., the remainder of the parting, having, upon the 26th instant, ascertained that the waters we are now in communicate with those of Barrow Strait, the north-eastern limit being in latitude 73°31′, N. longitude 114°39′, W. thus establishing the existence of a NORTH-WEST PASSAGE between the Atlantic and Pacific Oceans.\"\nFirst winter and summer\nThe sun departed on 11 November, with temperatures averaging  with the below-deck temperature of , the crew in good health. Below deck air quality was maintained by increased ventilation and regular airing out of the quarters. The new year was welcomed in as the crew amused themselves, occasionally catching foxes or spotting seals. Winter temperatures averaged , and on 3&nbsp;February, the sun returned after 83&nbsp;days of darkness. An emergency depot of provisions and a whaleboat were made on the nearby island. Reindeer, Arctic fox, hare, raven, wolf and a polar bear were observed as local expeditions resumed.\nAs spring returned, the decks of Investigator were cleared of snow and repairs begun. Additional local expeditions were mounted, but none with the object of attempting to meet with concurrent regional rescue expeditions; Resolute under Captain Horatio Austin, believed to be near Melville Island, Assistance under Captain Erasmus Ommanney, the Pioneer under Lieutenant John B. Cator, and Intrepid under Sherard Osborn as well as more distant ships under Captain William Penney, Admiral Sir John Ross, the First Grinnell expedition under Lieutenant Edwin De Haven and the overland Rae–Richardson Arctic expedition.\nAs the weather warmed in mid-May, additional hunting and exploration parties were sent out to supplement the dwindling provisions. Some of these parties returned with frostbitten crew members, and one had met a small group of Inuit seal hunters who lived in isolation. One party went around Banks Island and showed that it was an island. Another party was on the south shore of Victoria Island at about the same time that John Rae (explorer) passed  to the south. No traces of Franklin were found.\nPreparations were made for the ship's anticipated release from the ice. \"By late June, the temperature had reached 53 °F (12 °C), but the ice still held Investigator in its grip. The ship was finally freed on 4&nbsp;July sailing amidst the grinding ice near the Princess Royal Islands. Progress northward was made, the ship often attached to larger floes, and there was even some anticipation of completing the passage in that direction. However, in August, progress slowed as the ice became increasingly solid and difficult to navigate. On 14&nbsp;August, they attained their northernmost position at 73°14′19″N, 115°32′30″W in the Prince of Wales Strait. It was later suggested that, if Investigator had been equipped with a screw propeller, she could have pressed the  to Melville Island, completed the Northwest Passage, and returned home that same year.\nThe decision to abandon the strait and proceed around the south coast of Baring Island (his name for Banks Island) led them to open water and a wider area of search. Rounding to the north east, they continued through the loose ice until conditions compelled them to secure the ship to an iceberg for protection. Explorations of the nearby coast were made, revealing abandoned Inuit camps and the unusual discovery of petrified wood from an extensive forest at 74°27′N. As winter approached, the crew faced several close calls as they were threatened by the ice while still attached to their iceberg.\nSecond winter and summer in Mercy Bay\nThese subsequent efforts to move the ship further eastward made slow progress, but occasional stretches of open water contributed to their progress towards Melville Island. Rather than following the pack ice east, McClure chose to take refuge in an open bay. On 23&nbsp;September, the ship's progress was halted by the ice, and the crew prepared for a second winter. Some of them believed that entering the bay had been a fatal mistake. Expedition surgeon Armstrong went so far as to state that \"entering this bay was the fatal error of our voyage.\" The pack ice would have taken them within  of Melville Island, and improved their chance of an early break-up in the spring. The location of their wintering was 74°6′N, 118°55′W, and was subsequently named Mercy Bay.\nDiminishing provisions, as well as the subsequent caching of food at the Princess Royal Islands left them with less than ideal stores. By October, heating was briefly curtailed until the more severe periods of winter, with temperatures below deck holding near . Hunting parties were generally successful, although their exploration frustratingly revealed extents of open water that would have provided escape, only  outside of Mercy Bay. As winter pressed on, the weakening hunting parties frequently required rescue. On 10&nbsp;November, the final 'housing in' of the ship commenced, largely sealing it for the winter. The crew busied themselves in the manufacture of needed items, and adopted patches of gun wadding as their currency. Tedium was severe, with two crewmen briefly going mad with boredom. In December, storms rose up as temperatures continued to fall.\nThe new year began with the crew generally healthy, maintained largely by the reindeer venison provided by the hunters, temperatures reaching . Frequent hunting of nearby reindeer continued to supplement the provisions, although the hunters suffered from the cold and occasionally required rescue. Despite the occasional fresh meat, the crew continued to gradually weaken. Of all the ships searching for Franklin the previous year, now only Enterprise and Investigator, separated, remained in the arctic.\nOn 11 April, McClure led seven men out by sledge with 28&nbsp;days of provisions to reach Melville Island across the ice, and hopefully to make contact with other British explorers in the area. In late April, the first case of scurvy was observed, with several others soon to follow. McClure's party returned on 7&nbsp;May, relating that poor visibility and soft snow had hampered their progress. They did not reach Melville Island, but obtained enough of a view of the strait and large harbor to determine that Captain Austin's forces were not present. They did find the cairn left by Sir Edward Parry during his 1819–1820 expedition, which also contained a June 1851 communication from Captain Austin. This did not include the information that traces of Franklin's expedition had been found the previous year at Beechey Island.\nJune found the crews preparing for their expected liberation from the ice of Mercy Bay, and although temperatures rose, it was cooler than the previous year. Cases of scurvy continued to increase, although hunting and gathering of the emerging sorrel provided improvement. By mid-month, the ice outside the bay was beginning to break up, while the bay ice remained frozen and stationary. By September, all hopes of freeing the ship had evaporated, and McClure planned for the possibility of abandoning the ship in the spring, writing that \"nothing but the most urgent necessity will induce me to take such a step.\"\nThe third winter\nOn 8 September, McClure announced his plan for springtime escape, in which 26 of the crew would make for Cape Spencer (550 miles away), where Austin had left a cache and a boat, and from there, to seek rescue on Baffin Bay. A smaller party of 8 men would proceed back along the shore of Banks Land, to the cache and boat set by McClure in 1851, then making for the Hudson's Bay Company's post on the Mackenzie River for rescue. This would stretch the provisions for the crews remaining on board Investigator. To this end, food rations were immediately reduced, and hunting success became ever more critical, which now included mice.\nAs October progressed, the crew's health continued to deteriorate as they braced themselves for the coldest winter yet. The crew readied the ship for winter as freezing temperatures extended below deck. Full darkness returned on 7 November. Morale and physical activity, including hunting, waned. The officers continued hunting, often requiring rescue as temperatures reached . 1852 ended with the crew weaker and more afflicted than ever before, although not a single member of the crew had been lost.\n1853 brought the coldest conditions yet, once reaching . The crew passed the days with minimal activity, working on small projects of necessity and hunting when possible, since McClure had prepared no diversions for his crew. Rations were scarce, and the sick bay was crowded with ill crew members, even minor ailments causing serious disabilities due to the crew's weakened condition. McClure continued preparing for his spring escape parties, planning to send the weaker able men to improve the long-term chances of those left behind.  On 3 March, the crew selections were announced, and those who were to remain behind were disappointed by the news. Full rations were restored to those men preparing to set out in mid-April, and their health improved. Still, on 5 April, the first crew member, John Boyle, succumbed to illness, which impacted morale and underscored the dire nature of their situation.\nRelief and the fourth winter\nPreparations for the escape parties continued, despite their slim chances for success. On 6 April, a detail of men digging Boyle's grave observed a figure approaching from seaward.  It was Lieutenant Bedford Pim of , which was wintering off Melville Island under Captain Henry Kellett 28 days away by sledge. Resolute was accompanied by Intrepid, laying supply depots off Melville Island for the continued search of Franklin and now McClure (having located one of McClure's stashed messages from 1852). Afterwards, Pim described meeting McClure:\n\"Who are you, and where (did) you come from?\"\n\"Lieutenant Pim, Herald, Capt. Kellett.\"  This was more inexplicable to M'Clure, as I was the last person he shook hands with in Behring's Straits.\nTwo days later, Pim left for Resolute, about 80 miles east, followed soon by McClure and six men, who would journey for 16 days.\nDespite the encouraging news of relief, conditions aboard Investigator were still deteriorating. Scurvy advanced with the reduced rations, and on 11 April, another crewman died, and another on the following day. Some exercise was possible for the crew, breathing aided by the modern Jeffreys respirator.\nOn 15 April, the 28-man traveling party, now concentrated on Melville Island alone, set out on three sledges. Four days later, McClure reached the ships and met with Captain Kellett and Commander McClintock. McClure returned on 19 May, with the expedition surgeon of Resolute, Dr. W. T. Domville. A medical survey was made to determine whether Investigator could be adequately manned if freed from the ice. The assessment fell short of the requirements, \"utterly unfit to undergo the rigour of another winter in this climate,\" making the abandonment of Investigator inevitable, ordered by Captain Kellett of Resolute. The official announcement was made, and all men were put back on full rations for the first time in 20 months. A beach supply depot was established by the end of May, accompanied by a cairn and a monument to the fallen crew members.\nOn 3 June, final flags were raised and the remaining crew abandoned Investigator, travelling by sledge to Resolute, with 18 days of provisions and McClure leading the way on foot.  Progress across the thawing pack ice was slow, as the four sledges weighed between . The weakened crew made Melville Island on 12 June and reached the ships on 17 June. Hunting supplemented the provisions while Resolute and Intrepid waited for their own release from the ice. The breakup came on 18 August and the ships followed the edge of the pack ice before becoming fixed in the ice in early November at 70°41' N, 101°22' W.  The combined crews prepared for another winter in the ice, while another crewman died on 16 October. Far from shore, no effective hunting could be resumed.\nIn October 1853, a group of sick crew members were evacuated from Resolute and North Star and returned to England, bringing the first news of Investigator and the Northwest Passage to the public. 1854 marked the beginning of the fifth year in the Arctic for the crew of Investigator.\nEscape and return\nPlans were made to detach the crew of Investigator to North Star at Beechey Island in the spring of 1854. These three sledge parties set out on 10–12 April. The journey was severe, but the crews were in improved condition. Socks routinely froze to feet and had to be cut off to fight frostbite. Despite these unfavourable circumstances, North Star was reached on 23–27 April by the parties. Even with this relief, another man succumbed at Beechey Island. They occupied themselves searching the surrounding area for additional traces of Franklin, as Beechey Island was now known to be his first winter quarters. Meanwhile, Resolute and Intrepid were themselves abandoned, with their crews joining the Beechey Island camp on 28 May.\nAn exploration party by Resolute had earlier made contact with Captain Collinson and Enterprise and learned of their own path of search. A report on the condition of Investigator, now abandoned some 12 months, was also obtained and indicated that she was tattered, leaking but otherwise intact and held by the ice – Mercy Bay was still solid. By mid-August, North Star was herself released from the ice, although two other nearby ships (Assistance and her tender Pioneer) were abandoned on 25 August.  They proceeded along Greenland and reached the English port of Ramsgate on 6 October 1854, having been gone four years and ten months and losing five men.\nAftermath and controversy\nUpon return to England, McClure was immediately court martialled and pardoned for the loss of the Investigator, according to custom.  He was awarded a share of the £10,000 prize for completing a Northwest Passage, knighted and decorated.  He never made another Arctic voyage.\nDespite this overall success, several points of controversy were raised:\n* When the ambitious McClure severed contact with their consort ship Enterprise before reaching Arctic waters, he essentially initiated a solo voyage.  Described alternately as a combination of faulty communications or outright deception, this decision increased the risk to the expedition by eliminating the benefits of cooperation.\n* The voyage's September 1851 progress was stalled by McClure's decision not to push more aggressively towards open water. Much effort was made with little advancement after that, which was considered by expedition surgeon Armstrong to be a critical failure contributing to their subsequent problems.\n* Armstrong also considered the entry into Mercy Bay (which became their second winter quarters and final position) rather than following the coastal ice floes to be a major mistake. It eliminated any possible future opportunities to press towards Melville Island through the pack ice.  Failing to attempt a meeting with Captain Austin on Melville Island in April 1851 may also have contributed to the hardships endured.\n* McClure's two-party escape plan for spring 1853 was viewed by the expedition surgeon as recklessly dangerous, considering the weakened state of the crews and the extents of their proposed journeys. It has also been suggested that the plan was simply a ploy to eliminate the weakest two-thirds of the crew to extend the rations for McClure and his chosen few aboard the Investigator.\nShip located\nIn July 2010, Parks Canada archeologists looking for  found it fifteen minutes after they started a sonar scan of Banks Island, Mercy Bay, Northwest Territories. The archaeology crew reported no plans to raise the ship, but planned a thorough sonar scan of the area and dispatch of a remotely operated vehicle. Parks Canada archeologists scheduled dives on the Investigator site for 15 days beginning on 10 July 2011 to gather detailed photographic documentation of the wreck. Led by Marc-Andre Bernier, the team of six divers were the first to visit the wreck, which lies partially buried in silt just  off the north shore of Banks Island.\nLegacy\nMcClure is credited as being the first to complete the Northwest Passage (by boat and sledge). Despite some questionable behavior, he was granted a share of the £10,000 prize for completing the passage.\nThe subsequent salvage of metals and materials from the abandoned Investigator is considered a turning point in the material use of the Copper Inuit.\nThe McClure Strait is named after Captain McClure.\nOn 29 October 2009, a special service of thanksgiving was held in the chapel at the Old Royal Naval College in Greenwich, to accompany the rededication of the national monument to Sir John Franklin there. The service also included the solemn re-interment of the remains of Lieutenant Henry Thomas Dundas Le Vesconte, the only remains ever repatriated to England, entombed within the monument in 1873. The event brought together members of the international polar community and invited guests included polar travellers, photographers and authors and many descendants of Sir John Franklin and his men and the families of those who went to search for him, including Admiral Sir Francis Leopold McClintock, Rear Admiral Sir John Ross and Vice Admiral Sir Robert McClure among many others. This gala event, directed by the Rev Jeremy Frost and polar historian Dr Huw Lewis-Jones, celebrated the contributions made by the United Kingdom in the charting of the Canadian North and honoured the loss of life in the pursuit of geographical discovery. The Navy was represented by Admiral Nick Wilkinson, prayers were led by the Bishop of Woolwich and among the readings were eloquent tributes from Duncan Wilson, chief executive of the Greenwich Foundation and H.E. James Wright, the Canadian High Commissioner. At a private drinks reception in the Painted Hall which followed this Arctic service, Chief Marine Archaeologist for Parks Canada Robert Grenier spoke of his ongoing search for the missing expedition ships. The following day a group of polar authors went to London's Kensal Green Cemetery to pay their respects to the Arctic explorers buried there. After some difficulty, McClure's gravestone was located. It is hoped that his memorial may be conserved in the future.\nContrast with Franklin's expedition\n* As with the Second Grinnell expedition, McClure employed an Inuit interpreter. Franklin's expedition included no interpreters or Inuit, whose regional expertise might have enhanced their chances of survival.\n* Banks Island provided enough game to offset the severest onset of scurvy and wasting. Franklin appears to have fared much worse, as the game near Beechey Island was more seasonal and sparse. This lack of fresh food, combined with the extensive spoilage of the cheaply canned provisions, were a contributing liability to Franklin's expedition.\n* McClure benefited from the regular construction of message cairns along his route&nbsp;– one of which was indeed discovered by the Resolute, leading directly to their rescue. Only two message cairns are known to have been left by Franklin, despite an ample supply of message canisters. Additional messages by Franklin would have corrected many of the search efforts, which incorrectly guessed at his ultimate route.\nReferences\nFurther reading\n*"
    }
  ]
}