{
  "content": [
    {
      "type": "text",
      "text": "# McKinley Monument\n\nThe McKinley Monument is a  tall obelisk in Niagara Square, Buffalo, New York. Its location in front of Buffalo City Hall defines the center of Buffalo that all of the main roads converge on.\nThe monument was commissioned by the State of New York and dedicated September 6, 1907 to the memory of William McKinley, 25th President of the United States, who was fatally shot while attending the Pan-American Exposition in Buffalo on September 6, 1901. Daniel H. Burnham influenced the process of designing the monument by advising that an obelisk should be built in order to call to the importance and significance of the monument. A full restoration had occurred in 2017 as the result of environmental conditions compromising the integrity of the monument.\nDescription\nThe McKinley Monument consists of an obelisk of Vermont and Italian marble with marble lions surrounding the base. It was designed by architects Carrère and Hastings, who had led the design of the Pan-American Exposition, with animal sculptures by Alexander Phimister Proctor that include both sleeping lions (symbols of strength) and turtles (emblems of eternal life).\nThe circular plot of land donated by the government of Buffalo, New York was 9 feet (2.7m) in diameter and was entirely filled with the base of the monument. Along with the donation of land, the sum appropriated for the project was approximately $100,000. An addition of $40,000 was expended on repairs of the surrounding neighborhoods. Corporations have spent over $30,000 to conform to the monument site. The commission to oversee the entire project was composed of Edward Hubert Butler Sr., John G. Milburn, Enoch A. Curtis and George E. Matthews. When the monument was fully constructed the base was 7 feet square with the height of 24 feet, while the obelisk extends 69 feet above the base.\nLion Sculpture\nIn 1905, a model of the four lions that would surround the base of the McKinley Monument was completed by Alexander Phimister Proctor, who was a very popular American sculptor at the time. Each one of the lions would be sculpted four times larger than an actual lion and made entirely out of white marble. These lions were modeled after Sultan, a veteran lion from the Bronx Zoological Park and weigh approximately 12 tons and are 12 feet long (3.7m).\nThe combination of traditional architecture (obelisk) and wild animals was relatively new to American art, but was expressed within this monument.\nInscriptions\nAt the base of the column, the following inscriptions are found:\"This shaft was erected by the State of New York to honor the memory of William McKinley, twenty-fifth President of the United states of America.\"\n\"William McKinley was born at Niles, Ohio, January 29, 1843.\"\n\"Was enlisted in Twenty-third Ohio Volunteers June 11, 1865, as Major by brevet for gallantry under fire.\"\n\"William McKinley was elected to Congress as a Representative of Ohio in 1876, 1878, 1880, 1882, 1884, 1886.\"\n\"Was elected Governor of Ohio in 1891 and 1893, and President of the United States in 1896 and 1900.\"\n\"William McKinley died in Buffalo September 14, 1901.\"\n\"Victim of a treacherous assassin who shot the President as he was extending to him the hand of courtesy.\"\n\"The monument was built under the direction of a commission composed of E. H. Butler and George E. Matthews of Buffalo; John G. Milburn of New York, formerly of Buffalo, and at whose home President McKinley died, and E. A. Curtis of Fredonia.\"\nInfluence of Daniel H. Burnham\nArchitect Daniel H. Burnham had a major impact on the obelisk form of the McKinley Monument. He expressed his opinion on the type of monument to be built after being called in by Buffalo government officials. The location in Niagara Square in an already existing park posed some constrains to the monument. The tall buildings around the park along with the unknown expansion would call for a monument that commands attention but would still allow for the use of the park. This lead Burnham to the conclusion of an obelisk monument along with a pedestal base.\nAccording to Burnham, a fountain feature would be necessary in the monument but would be difficult to maintain in New York's harsh winters. He determined that the pedestal should have artistic value whether or not water was added to the architecture.\nDedication\nThe McKinley Monument was dedicated on September 6, 1907, the 6th anniversary of the shooting, to commemorate the assassination of William McKinley during the Pan-American Exposition in 1901 during the Old Home Week Celebration. The day of the dedication a heavy downpour occurred but an estimation of 100,000 observers came to remember a beloved president despite the rain. The ceremony began at 3:00PM with a parade of American and Canadian troops expressing international goodwill. Specifically the troops of two battalions of the Twelfth United States Infantry, the Sixty Fifth Regiment, the National Guard of New York, and Thirteenth Royal Canadian Regiment participated in the dedication.\nGovernor Charles Evans Hughes spoke at the dedication of The McKinley Monument. He celebrated the people of democracy who dedicate themselves to public service, encouraging visitors to conserve the ideals that others had set and died for.\nPoet Carl Sandburg wrote a poem about the monument called Slants at Buffalo, New York, beginning: \"A forefinger of stone, dreamed by a sculptor, points to the sky. / It says: This way! this way!\"\nRestoration Project\nThe McKinley Monument has been significantly affected by exposure to the elements for over a century, so a complete restoration occurred June 2017 to September 2017. The Flynn Battaglia Company was selected to restore the monument. They started by removing damaged marble blocks and replacing them with new blocks from the same quarry in Vermont. The paving stones and stairs were removed and reset in ground, stone poles were cleaned while two were replaced, and the fountains were relined to prevent leaking.\nSee also\n* William McKinley Monument, Columbus, Ohio\n*McKinley National Memorial, Canton, Ohio\nReferences\nExternal links\n*"
    }
  ]
}