{
  "content": [
    {
      "type": "text",
      "text": "# McQueen Street\n\n}}\nMcQueen Street is an American hard rock/glam metal band from Montgomery, Alabama. The current touring lineup consists of Derek Welsh on vocals, Loud on guitar, Kevin Delburn on bass, and Dean Domizio on drums. The original lineup was Derek Welsh on vocals, Michael Powers on guitar, Richard Hatcher on bass, and Chris Welsh on drums.\nHistory\nFormed in 1987, McQueen Street was successful on the southeast rock music club circuit. The idea for the name \"McQueen Street\" came from the street where Derek's recording studio was located. In 1990, after the name was changed to McQueen Street, the band signed a record deal with SBK Records.\nThe band's debut album, titled McQueen Street, was produced by Tom Werman with additional production from Steve Stevens of Billy Idol. Steve and Derek wrote and performed on \"Two Worlds.\" Two songs \"Money\" and \"My Religion\" had music videos that were played on MTV's Headbangers Ball. \"In Heaven\" reached #32 on Billboard's Mainstream Rock Chart in early 1992.\nMcQueen Street played live shows in cities across the US and performed as a support act with bands such as Soundgarden, Alice in Chains, Bang Tango, and Mr. Big. The band was one of the featured live acts at Cabo Wabo Cantina in Cabo San Lucas, Mexico, owned by Sammy Hagar. This show was a joint effort between KNAC out of Los Angeles and MTV.\nWith the grunge movement of the early 1990s, most bands whose music was based on 1980s-style rock were no longer popular. Radio stations and MTV ceased to play most mainstream rock, causing the second album not to be released. The group disbanded shortly thereafter. Chris Welsh died in 1994 due to a viral illness.\nDerek Welsh and Richard Hatcher formed the band The Rat Race, a group edging towards psychedelic rock. The band released 2 studio albums Alice (1993) and ''Uncle Jim's Secret Garden (1995). In 1997, The Rat Race released Live Unelectrified, a live recording from Columbus, Georgia. The band toured the US as a support act for headliners including The Dave Matthews Band, Blues Traveller & Widespread Panic.\nThe second McQueen Street album, McQueen Street 2, was recorded in 1993 and was released in 2003 by Ring of Four Records.\nAs of 2020, McQueen Street released two new songs, \"Outside In\" and \"One Way Ticket\". They were recorded in 1993 and the latter reached #1 on the underground rock charts.\nBand members\nCurrent members\n* Derek Welsh – lead vocals, guitars, tambourine (1987–1993, 2002–2004, 2018–present), keyboard, piano (2018–present)\n* Loud – lead guitar, backing vocals\n* Kevin Delburn – bass, backing vocals\n* Dean Domizio – drums, percussion\nPast members\n* Michael Powers – guitar, backing vocals (1987–1993)\n* Richard Hatcher – bass guitar, backing vocals (1987–1993)\n* Chris Welsh – drums (1986–1993: died 1994)\nDiscography\nStudio albums\n* McQueen Street (1991)\n* McQueen Street 2 (2003)\n* Unreleased'' (2021)\nSingles\n* \"Time\" (1991)\n* \"In Heaven\" (1991)\n* \"My Religion\" (1991)\n* \"McQueen Street Sampler\" (1991)\n* \"Outside In\" (2020)\n* \"One Way Ticket\" (2020)\nVideography\nMusic videos\n* \"Time\" (1991)\n* \"Money\" (1991)\n* \"My Religion\" (1991)\nReferences\nExternal links\n*\n*"
    }
  ]
}