{
  "content": [
    {
      "type": "text",
      "text": "# Md Muksodur Rahman Patwary\n\nMd Muksodur Rahman Patwary is a retired civil servant and member of the Bangladesh Public Service Commission. He is the former senior secretary of the Ministry of Land and served under Saifuzzaman Chowdhury. He was an Additional Secretary of the Cabinet Division.\nEarly life\nPatwary was born on 1 January 1962 in Faridganj Upazila, Chandpur District, East Pakistan, Pakistan. He completed SSC and HSC from Chandra Imam Ali High School and College and Chandpur Government College. He completed his bachelor's degree and masters in history from the University of Dhaka.\nCareer\nPatwary is a cadre of the 1985 Bangladesh Civil Service administrative branch. He joined the service in 1988. He served as the Assistant Commissioner of Munshiganj District, Narayanganj District, and Shariatpur District. He was the magistrate of Barhatta Upazila, Ghazaria Upazila, Munshiganj Sadar Upazila, Netrokona Sadar Upazila, and Tongibari Upazila.\nFrom 1 January 1998 to April 2003, Patwary served as the Dhaka Metropolitan Magistrate. He was Bajitpur Upazila Executive Officer from 1 May 2003 to 4 December 2003. He was the Additional District Commissioner of Rajbari District from 14 December 2003 to 18 November 2006. He was the deputy secretary of the Ministry of Public Administration from 22 April 2007 to 28 August 2008.\nPatwary served as the deputy commissioner of Tangail District from 31 August 2008 to 15 September 2009.\nPatwary was the joint Secretary of the Cabinet Division in 2014.\nPatwary was an Additional Secretary of the Cabinet Division in 2016. He served as the Additional Secretary of the Ministry of Cultural Affairs. He was the director general of the Bangladesh National Museum.\nOn 30 October 2018, Patwary was appointed acting secretary of the Ministry of Land and made permanent in May 2019. He was promoted to senior secretary. He worked on digitalizing the record system and land tax collection at the Ministry of Land. He established the National Committee on Monitoring and Reviewing the Land Services Digitization. He created Hotline 16122  and hotline.land.gov.bd for the Ministry of Land as part of the Digital Bangladesh policy of Prime Minister Sheikh Hasina. He chaired a committee to protect rivers and prevent illegal sand extraction.\nIn December 2022, Justices M Enayetur Rahim and Md Mostafizur Rahman of the High Court Division questioned why Patwary was still the secretary of Ministry of Land despite admitting to use three official cars illegally for his family. He defended himself saying \"90 percent\" government secretaries do it. Md Mustafizur Rahman replaced Patwary as the secretary of the Ministry of Land on 31 December 2020. He retired from the admin service.\nIn May 2023, Patwary was appointed a member of the Bangladesh Public Service Commission along with Helal Uddin Ahmed, Musammat Nazmanara Khanum, and Shafiqul Islam.\nReferences"
    }
  ]
}