{
  "content": [
    {
      "type": "text",
      "text": "# Meadowbrook, Queensland\n\n| pop                 = 3069\n| pop_year            =\n| pop_footnotes       =\n| established         = 1991\n| postcode            = 4131\n| elevation           = 13\n| area                = 5.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 6.0\n| dir1                = SE\n| location1           = Logan Central\n| dist2               = 27.6\n| dir2                = SSE\n| location2           = Brisbane CBD\n| dist3               = 54\n| dir3                = NNW\n| location3           = Surfers Paradise\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Logan City\n| stategov            = Waterford\n| fedgov              = Rankin\n| fedgov2             = Forde\n| near-n              = Slacks Creek\n| near-ne             = Slacks Creek\n| near-e              = Tanah Merah\n| near-se             = Bethania\n| near-s              = Loganlea\n| near-sw             = Loganlea\n| near-w              = Kingston\n| near-nw             = Kingston\n}}\nMeadowbrook is a mixed-use suburb in the City of Logan, Queensland, Australia. The Logan Hospital and a TAFE college are located in the suburb. In the , Meadowbrook had a population of 3,069 people.\nGeography\nThe northern and eastern border of the suburb follow Logan River and part of its tributary Slacks Creek.The Gold Coast railway line marks the southern boundary.\nThe Loganlea Golf Course and Logan campus of Griffith University are located in Meadowbrook.  Most of the golf course is within a defined flood zone as is Lake Elleslie at the entrance to the university. Logan Hospital is located in Armstrong Road (). There is also an industrial area in the west of Meadowbrook and a large section of housing surround the hospital and adjacent TAFE college.  Meadowbrook is home to Riverdale Park, a former grazing property. Waterways of Slacks Creek dominate the northern sections of Meadowbrook with suburban arterial Loganlea Road heading towards the Pacific Motorway and Slacks Creek being the only road in the area. Power lines and an electrical substation have been built in the industrial area.\nRiverdale Park\nA long section of the Logan River stretching past Meadowbrook was once grazing lands. Farms provided milk for the nearby Kingston Butter Factory. Today the flood prone area has been converted into a well-catered 10-hectare parklands. The park's entrance is in Armstrong Street. Cemented walking paths extend up Slacks Creek towards the Logan Motorway and Tanah Merah. There are two dog-off-leash sections, facilities for large groups, playground and exercise equipment.\nHistory\nThe Logan Hospital was opened in 1990.  Due to growth in the area the hospital has undergone several upgrades.\nThe suburb was formed in 1991 as a subdivision of Loganlea.\nThe Logan campus for Griffith University and TAFE college opened in 1998.\nA master plan for the suburb was being prepared by the Logan City Council in 2013. The master plan was finalised in 2016. It focused on health, education and wellbeing.  Meadowbrook was designated as a Specialist Centre in the South East Queensland Regional Plan 2009–2031, dedicated to health, research and education.\nDemographics\nIn the , Meadowbrook recorded a population of 3,138 people, 51.1% female and 48.9% male. The median age of the Meadowbrook population was 31 years, 6 years below the national median of 37.  61% of people living in Meadowbrook were born in Australia. The other top responses for country of birth were New Zealand 10.1%, England 4.8%, Philippines 1.8%, Fiji 1.1%, Malaysia 1%.  76.3% of people spoke only English at home; the next most common languages were 1.5% Hindi, 1.3% Mandarin, 1.2% Cantonese, 1.2% Vietnamese, 1.1% Tagalog.\nIn the , Meadowbrook had a population of 3,113 people.\nIn the , Meadowbrook had a population of 3,069 people.\nTransport\nThe suburb is crossed by a number of major transport routes. These include the Logan Motorway, Loganlea railway station for both the Beenleigh railway line and Gold Coast railway line and Loganlea Road.  The suburb is serviced by the 560 and 562 Translink bus services linking the suburb to Logan Central, Springwood, Browns Plains and the Logan Hyperdome. A number of bus routes services Meadowbrook and there are two established bikeways.\nProblems with illegal car parking in the streets around the hospital, TAFE and train station were addressed with increased restriction of two-hour limited parking.\nEducation\nThere are no schools in Meadowbrook. The nearest government primary schools are Daisy Hill State School to the north in Daisy Hill and Waterford West State School to the south-west in Waterford West. The nearest government secondary school is Loganlea State High School to the south in neighbouring Loganlea.\nThe Loganlea campus of TAFE College is at Armstrong Road ().\nThe Logan campus of Griffith University is at University Drive ().\nReferences\nExternal links\n*"
    }
  ]
}