{
  "content": [
    {
      "type": "text",
      "text": "# Mecha Samurai Empire series\n\n| author           = Peter Tieryas\n| editors          =\n| title_orig       =\n| translator       =\n| illustrator      =\n| cover_artist     = John Liberto\n| country          =\n| language         =\n| genre            =\n| publisher        =\n| pub_date         =\n| english_pub_date =\n| media_type       =\n| number_of_books  =\n| list_books       =\n| oclc             =\n| preceded by      =\n| followed by      =\n| website          =\n}}\nThe Mecha Samurai Empire series is a trilogy of alternate-history science fiction novels written by American author Peter Tieryas. The series centers around an alternate America, known as the United States of Japan, after the Nazis and Japanese Empire have emerged victorious in World War II. The stories focus primarily on Asian communities since the war, depicting the struggles of survivors in a new totalitarian fascist regime. The novels explore themes such as government propaganda and the blurring of fact and fiction. Each book in the series is a standalone novel in the same shared universe, featuring different protagonists, antagonists, and conflicts. The series has been the recipient of several awards, twice receiving the Seiun Award for Best Foreign Novel. The first title in the series was published by Angry Robot in 2016; the latter two were published by Ace Books, with the last title being released in 2020. In Japan, all three books are published by Hayakawa Publishing under the New Hayakawa Science Fiction Series imprint.\nGenesis\nThe series began as \"a story revolving around the tragic events on the Asian side of WWII.\" Tieryas, who spent several years in Asia, experienced a different perspective on the war versus what he studied in schools in America. The book is strongly inspired by books like The Man in the High Castle, Nineteen Eighty-Four, Moby-Dick, as well as the works of Hideo Kojima like Metal Gear Solid II. In particular, the contrast between the way histories often \"censor\" the horrific elements, presenting a glorified account of them, alarmed him. He originally intended it to be one book, United States of Japan, which focused on the conflict with the terrorist organization, the George Washingtons. But he felt there were areas of the universe he wanted to explore more thoroughly. The success of the first book opened the door for the duology of Mecha Samurai Empire and Cyber Shogun Revolution, which revolved around the battle with the Nazis. His agent, Misa Morikawa, came up with the title for the series. Tieryas credits his Ace Roc editor, Anne Sowards, for helping come up with the title for Cyber Shogun Revolution (titles included Sons of Wars and The Revolution of the Bloody Mechas).\nBooks\nThe Mecha Samurai Empire series comprises three novels and several short stories. While the books can be read in any order, the author has described his intended sequence to be Mecha Samurai Empire, Cyber Shogun Revolution, and lastly United States of Japan.\nArt\nMost of the covers and mecha designs are done by illustrator John Liberto. Hokkaido graphic designer Gen Igarashi often creates new art and was featured in the special edition of the Japanese version of Mecha Samurai Empire. Director Guillermo del Toro, upon seeing the art from the series, reacted with a \"Wow!\"\nAn art gallery featuring art from the entire series was showcased in Akihabara, Japan.\nReception\nPopular Mechanics included United States of Japan as one of 16 Sci-Fi Things to Look Forward to in 2016, stating: \"It's more the cyberpunk dystopia William Gibson promised us than the actual 1980s we know, with giant mechs enforcing the law and police trying to squash an underground gaming success that lets players imagine what might've happened if the allied powers won World War II. It sounds like a perfect patchwork of multiple sci-fi and anime subgenres rolled into one novel.\" Publishers Weekly named USJ as one of the top 10 anticipated Science Fiction, Fantasy, and Horror books. Kirkus Reviews listed it as one of \"The Speculative Fiction Books You Can't Miss in March.\" The Verge named the novel as one of the Best Books Science Fiction and Fantasy Novels of 2016.\nFinancial Times stated, \"The novel deftly portrays the horrors of oppression but also, with its giant military robots, sumo wrestlers and body-transforming technology, is a gleeful love letter to Japanese pop culture.\" Barnes & Noble Science Fiction and Fantasy Blog said, \"United States of Japan mixes alt-history with pulp-history, the plausible with the fantastical, in a vision of the 1980s with the glossy sheen and rain-slick neon of vintage cyberpunk.\" Anthony Jones of SF Book Reviews stated: \"United States of Japan is a tremendous book; it's got a wonderfully dark and rich atmosphere, great action, intelligent and twisted story and above all, not only does it pay homage to one of the finest authors of the 20th century but also continues one of his most celebrated and yet most difficult works — simply wonderful.\" io9 reviewer Andrew Liptak wrote, \"Tieryas has created a unique alternate world and populated it with fantastic characters and fixtures.\" In a mixed review, N. Ho Sang of SF Signal writes: \"United States of Japan is a smart, gut-wrenching alternative reality that blurs lines between hope with a focus on emotional truths of human nature\", but \"there are small moments where transitions in environment, scenes and character developments may present themselves as sudden shifts, and feel slightly jarring.\"\nUnited States of Japan has been translated and published in Japan, Spain, Chile, China, Colombia, Czech Republic, and Mexico. It became a Nikkei Best Seller  and the Japanese edition went to its 7th printing in the first month, receiving acclaim from Asahi Shimbun, Yomiuri Shimbun, and Gizmodo Japan. S-F Magazine Yearly Poll of Japan's Top Science Fiction selected United States of Japan as #2 of the best Best International Science Fiction. It won the 2017 Seiun Award  and won 2nd Place for the ''Japan Booksellers' Award.\nFor Mecha Samurai Empire, Amazon Book Reviews listed it as one of the top Science Fiction and Fantasy Books of September 2018, stating, \"Readers of alternate history will enjoy the details of the Japanese culture enfolded into the US and the ongoing tensions with the Nazis, while the plot itself packs a punch.\" Financial Times included Mecha Samurai Empire as one of the best science fiction books of 2018, describing it as \"action-packed and rousing.\" Syfy Wire'' said the book was \"an adrenalized fusion of Philip K. Dick's The Man in the High Castle and Guillermo del Toro's Pacific Rim as rampaging robots prowl a very different America.\"\nHideo Kojima praised the book, stating it intermixes \"the experience of cinema, literature, anime, comics, and gaming\" and \"is the new generation of Science Fiction we've been waiting for!\"\nIt won the 2019 Seiun Award and was the first consecutive book in a series to win in over twenty years.\nReferences"
    }
  ]
}