{
  "content": [
    {
      "type": "text",
      "text": "# MechWarrior Tactics\n\nMechWarrior Tactics was a free-to-play turn-based tactics video game set in the BattleTech universe. It was originally under development by Roadhouse Interactive and A.C.R.O.N.Y.M. Games, but was taken over by Blue Lizard Games and published by Infinite Game Publishing for the Unity Web Player platform. The game remained in closed beta for two years, with Founder Packs allowing players to purchase instant access, but development has been on hold since of end of 2013 and the game's website has been unavailable since the end of August 2014.\nGameplay\nThe game pitted two players against each other in an online turn-based match. The turn-based combat was presented via an isometric 3D perspective, with the play area divided into a hexagonal grid. Each player had control of four individual BattleMechs, to which they issue separate movement and combat commands which are not seen by their opponent. Moving the 'Mechs into certain tiles that represent forests, hills, or bodies of water grants combat advantages and disadvantages, making the skillful maneuvering of units a major aspect of the game. Likewise, the combat itself offered several tactical options, including the targeting of specific sub-sections of an enemy unit, and balancing overheating of weapons with their cool-down period. Once both players finished inputting their movement and combat orders, the action played out on both players' screens simultaneously, showing the results of their actions for that turn. The turns continued in this fashion until one player loses all their 'Mechs.\nA major inspiration for the game was the BattleTech Collectible Card Game. Most items available to the player were represented in the form of virtual cards, including the 'Mechs themselves, their individual weapons, upgrades, and pilots. These cards could be purchased with real money or acquired through gameplay progression by using in-game currency. Customization performed on a particular 'Mech was intended to carry over into future games, giving players an incentive to invest in their card collections for the long haul rather than building up an arsenal for one specific match.\nThe entire game was played inside a web browser window and did not require any additional downloads whilst still available to play.\nControversy and publisher bankruptcy\nIn late August 2014, Blue Lizard Games (cited on the game's website as its present developer) stated the company had no involvement with MechWarrior Tactics' development since December 2013: \"unfortunately our development contract on MWT was cancelled in December last year. Please contact IGP for updates.\"\nSince August 28, 2014 the official website's main page was with no prior warning replaced with a customized Cloudflare HTTP 500 error page stating the website is unavailable due to a 72-hour \"extended maintenance\" window due to a hardware upgrade.\nThis led players to attempt contact with IGP in order to demand status updates on the game or request refunds on their Founder Program payments.\nThroughout 2013 and 2014 IGP has continued selling Founder Program packages and marketing the game as under development and scheduled for Open Beta \"later this year\".\nDue to these practices continuing in absence of development progress, accusations of scam have been directed at IGP. The discovery that a major portion of the company employees have left their employ has also prompted theories that Infinite Games Publishing may be shutting down.\nAs of September 18, members of the game's fanbase have managed to obtain a response from Infinite Games Publishing through the company's former CEO Kelly Zmak, stating the game \"will be offline for a while longer\" but it is not cancelled and \"IGP is seeking a new partner/developer and a new hosting location for the game\", although with no definite timeline. As of September 20, the message on the game's website has been updated to reflect that statement.\nAs of early December 2014, the rights to the game were placed on sale as part of bankruptcy proceedings initiated on October 1 and were sold to an unknown buyer.\nReferences\nExternal links\n* [https://web.archive.org/web/20130812083443/http://mwtactics.com/ Official website] via Internet Archive"
    }
  ]
}