{
  "content": [
    {
      "type": "text",
      "text": "# Mechanized Assault & Exploration\n\n}}\n| designer = Ali N. AtabekPaul KellnerGus Smedstad\n| programmer = Dave Boulanger\n| artist = Anthony PostmaArlene Caberto Somers\n| writer = Steve Perrin\n| composer = Brian LuziettiAlbert Lloyd Olson\n| genre = Real-time strategy, turn-based strategy\n| modes = Single-player, multiplayer\n| platforms = DOS, Windows\n}}\nM.A.X.: Mechanized Assault & Exploration is a 1996 hybrid real-time/turn-based strategy video game for PC (MS-DOS, Windows) developed and published by Interplay Productions. The goal is to colonize newly-discovered planets, controlling the resources found there, and defend the colony against other rival factions.\nReception\n| CGW =\n| GSpot = 8.6/10\n| rev2 = Computer Games Strategy Plus\n| rev2Score =\n| NGen =\n}}\nAccording to Interplay, global sales of M.A.X. surpassed 150,000 copies by June 1998.\nM.A.X. was met with overwhelmingly positive reviews. Writing for Computer Gaming World, Patrick C. Miller called it \"an uncommonly high quality game with excellent gameplay; challenging artificial intelligence; and considerable depth, variety, and replay value.\" Next Generation similarly described it as \"a sophisticated, challenging, and enjoyable strategy game with a great deal of replayability\", while Kevin Mical of GameSpot deemed it superior to the critically acclaimed Command & Conquer.\nCritics widely praised the game's large number of gameplay modes and options to play with, huge variety of military units, and sound effects. Most were also pleased with the choice of real-time or turn-based play, though Miller added that he found the single-player campaign frustratingly difficult in real-time mode, since the AI can make decisions and perform actions faster than humanly possible. A more common subject of criticism was the instruction manual, which some reviewers stated is disorganized and omits key gameplay concepts. However, reviews generally commented that the training missions are well-designed and do a great deal to overcome the difficulty of learning the game.\nM.A.X. was a runner-up for Computer Game Entertainments 1996 \"Best Strategy Game\" prize, which ultimately went to Civilization II. The editors called M.A.X. \"a fantastic science fiction exploration and conquest game that demonstrated anew how completely satisfying a turn-based strategy game could be in a decided shift towards real-time strategy gaming.\" It was also nominated as Computer Games Strategy Pluss 1996 real-time strategy game of the year, although it lost to Command & Conquer: Red Alert.\nBug\nMany players complained over the years of the game crashing at around 120 turns, due to a Memory Stack Overflow bug. This problem was never patched.  However, downloading 32 Bit DOS32A, removing the old DOS4GW.EXE from your main MAX directory, and renaming the new DOS32A file DOS4GW.EXE, seems to solve the problem.\nLegacy\nA sequel, Mechanized Assault & Exploration 2, was released in 1998. M.A.X. was re-released into digital distribution after years of non-availability on GOG.com in September 2008.\nReferences\nExternal links\n* [https://www.maxr.org M.A.X.R. (Mechanized Assault and eXploration Reloaded)] - an open-source cross-platform clone of M.A.X.\n* [https://macsgame.com/ MACs (Mechanized Assault Commanders)]  - a cross-platform clone of M.A.X.\n*"
    }
  ]
}