{
  "content": [
    {
      "type": "text",
      "text": "# Medal of Honor: Warfighter (soundtrack)\n\n| label      = E.A.R.S\n| producer   =\n| chronology = Medal of Honor music\n| prev_title = Medal of Honor\n| prev_year  = 2010\n| next_title =\n| next_year  =\n| misc       =\n}}\nMedal of Honour: Warfighter is the soundtrack composed by Ramin Djawadi and featuring Linkin Park's co-vocalist Mike Shinoda to the 2012 first-person shooter video game of the same name.\nThe first official single from the soundtrack was \"Castle of Glass\", which was used for the promotion of the game.\nBackground\nThe music for Warfighter was composed by Ramin Djawadi, who also composed the music for Medal of Honor (2010). The official soundtrack was released on September 25, 2012, on iTunes and Amazon, nearly one month before the release of the game. The soundtrack consists of 21 tracks, 2 of which were composed by Mike Shinoda, the co-vocalist and rapper of Linkin Park. Linkin Park's song \"Castle of Glass\" from their album Living Things serves as the theme song for Warfighter, and variations of the song appear on the soundtrack. Themes from the previous game reappear as well, albeit in slightly differed forms. The song was also released as a promotional single for the soundtrack just like the band's previous contribution of The Catalyst. The song was nominated for the \"Best Song in a Game\" award at the 2012 Spike Video Game Awards. The official video was released on October 10, 2012.\nComposition\nThe soundtrack uses \"Castle of Glass\" as the theme song which as  Loudwire noted in their Living Things review that the song features \"very different electronic elements and unique sounding samples that the band have added to their musical palette.\" Yet is one of the most direct that the band has done, with a traditional song structure and a melody reminiscent of country music.\nTrack listing\n| length3 = 4:07\n| title4 = Lena's Theme\n| length4 = 3:26\n| title5 = Kit Up\n| length5 = 3:28\n| title6 = Restless Natives\n| length6 = 3:21\n| title7 = Blackbird on a Wire\n| length7 = 3:20\n| title8 = Bridge the Gap\n| length8 = 2:11\n| title9 = Saa'iq\n| writer9 =\n| length9 = 4:33\n| title10 = The Raid\n| length10 = 2:17\n| title11 = Force Multiplier\n| length11 = 2:54\n| title12 = Old Friend, New Foe\n| length12 = 3:03\n| title13 = Victory at Sea\n| length13 = 3:06\n| title14 = Resolve\n| writer14 =\n| length14 = 2:44\n| title15 = Green Light\n| length15 = 4:35\n| title16 = H.A.H.O.\n| length16 = 2:45\n| title17 = Medal Run\n| length17 = 2:16\n| title18 = For Mother\n| length18 = 3:05\n| title19 = Buzz in the Air\n| length19 = 2:10\n| title20 = Lena's Dream\n| length20 = 2:26\n| title21 = With Honors\n| length21 = 4:26\n}}\nReferences\nExternal links\n*"
    }
  ]
}