{
  "content": [
    {
      "type": "text",
      "text": "# Medieval French literature\n\nMedieval French literature is, for the purpose of this article, Medieval literature written in Oïl languages (particularly Old French and early Middle French) during the period from the eleventh century to the end of the fifteenth century.\nThe material and cultural conditions in France and associated territories around the year 1100 unleashed what the scholar Charles Homer Haskins termed the \"Renaissance of the 12th century\" and, for over the next hundred years, writers, \"jongleurs\", \"clercs\" and poets produced a profusion of remarkable creative works in all genres.  Although the dynastic struggles of the Hundred Years' War and the Black Death pandemic of the fourteenth century in many ways curtailed this creative production, the fifteenth century laid the groundwork for the French Renaissance.\nLanguage\nUp to roughly 1340, the Romance languages spoken in the Middle Ages in the northern half of what is today France are collectively known as \"ancien français\" (\"Old French\") or \"langues d'oïl\" (languages where one says \"oïl\" to mean \"yes\"); following the Germanic invasions of France in the fifth century, these Northern dialects had developed distinctly different phonetic and syntactical structures from the languages spoken in southern France. The language in southern France is known as \"langue d'oc\" or the Occitan language family (a language where one says \"oc\" to mean \"yes\"), also known under the name of one of its dialects, the Provençal language.  The Western peninsula of Brittany spoke Breton, a Celtic language. Catalan was spoken in the South, and Germanic languages and Franco-Provençal were spoken in the East.\nThe various dialects of Old French developed into what are recognised as regional languages today.  Languages which developed from dialects of Old French include Bourguignon, Champenois, Franc-Comtois, Francien (theoretical), Gallo, Lorrain, Norman, Anglo-Norman (spoken in England after the Norman Conquest of 1066), Picard, Poitevin, Saintongeais and Walloon.\nFrom 1340 to the beginning of the seventeenth century, a generalized French language became clearly distinguished from the other competing Oïl languages.  This is referred to as Middle French (\"moyen français\").\nThe vast majority of literary production in Old French is in verse; the development of prose as a literary form was a late phenomenon (in the late Middle Ages, many of the romances and epics were converted into prose versions).  The French language does not have a significant stress accent (like English) or long and short syllables (like Latin).  This means that the French metric line is not determined by the number of beats, but by the number of syllables. The most common metric lengths are the ten-syllable line (decasyllable), the eight-syllable line (octosyllable) and the twelve-syllable line (the \"alexandrine\").  Verses could be combined in a variety of ways: blocks (of varying lengths) of assonanced (occasionally rhymed) lines are called \"laisses\"; another frequent form is the rhymed couplet.  The choice of verse form was generally dictated by the genre.  The Old French epics (\"chansons de geste\") are generally written in ten-syllable assonanced \"laisses\",  while the chivalric romance (\"roman\") was usually written in octosyllabic rhymed couplets.\nEarly texts\nThe earliest extant French literary texts date from the ninth century, but very few texts before the eleventh century have survived. The first literary works written in Old French were saints' lives.  The Canticle of Saint Eulalie, written in the second half of the ninth century, is generally accepted as the first such text.  It is a short poem that recounts the martyrdom of a young girl.\nThe best known of the early Old French saints' lives is the Vie de saint Alexis, the life of Saint Alexis, a translation/rewriting of a Latin legend.  Saint Alexis fled from his family's home in Rome on his wedding night and dwelled as a hermit in Syria until a mystical voice began telling people of his holiness.  In order to avoid the earthly honor that came with such fame, he left Syria and was driven back to Rome, where he lived as a beggar at his family's house, unrecognized by all until his death.  He was only identified later when the pope read his name in a letter held in the dead saint's hand.  Although the saint left his family in order to devote his life more fully to God, the poem makes clear that his father, mother, and wife are saved by the Alexis' intercession and join him in Paradise. The earliest and best surviving text is in St. Albans Psalter, written probably at St Albans, England, in the second or third decade of the twelfth century. This provenance is indicative of the fact that many of the most important early texts were composed in Anglo-Norman dialect.\nThe Chanson de Geste\nAt the beginning of the 13th century, Jean Bodel, in his Chanson de Saisnes, divided medieval French narrative literature into three subject areas:\n* the Matter of France or Matter of Charlemagne\n* the Matter of Rome – romances in an ancient setting (see roman below)\n* the Matter of Britain – Arthurian romances, Breton lais (see roman below)\nThe first of these is the subject area of the chansons de geste (\"songs of exploits\" or \"songs of (heroic) deeds\"), epic poems typically composed in ten-syllable assonanced (occasionally rhymed) laisses.  More than one hundred chansons de geste have survived in around three hundred manuscripts.  The chief theme of the earliest French epics was the court of Charlemagne, Charles Martel and Charles the Bald and their wars against the Moors and Saracens, or disputes between kings and their rebellious vassals.\nThe oldest and most celebrated of the chansons de geste is The Song of Roland (earliest version composed ), seen by some as the national epic of France (comparable with Beowulf in England, the Song of the Nibelungs in Germany and the Lay of el Cid in Spain). It is perhaps no coincidence that the Song of Roland was first written down at a date very close to that of Pope Urban's call (1095) for the First Crusade; its plot may be seen as a glorification of the crusader ethos.\nThe earliest chansons de geste are (more or less) anonymous. They are popular literature (aimed at a warrior class, some say, though the evidence for this is inconclusive). They use an assortment of stock characters: the valiant hero, the brave traitor, the shifty or cowardly traitor, the Saracen, the giant, and so forth.  But they also reveal much of the fears and conflicts that were part of the audience's experience.  Kings are vain, foolish, old or wily.  Insults that threaten honour or cause shame are seen to provoke bloody conflict, which may arise simply from competitiveness among knights or noble families. For discussion of the much debated origins of this epic genre, see Chanson de geste.\nApproximately one hundred chansons survive, in manuscripts that date from the 12th to the 15th  century. Not long after Jean Bodel (above), Bertrand de Bar-sur-Aube in his Girart de Vienne set out a grouping of the chansons de geste into three cycles, each named after a chief character or ancestral figure, and each with a central theme, such as loyalty to a feudal chief, or the defence of Christianity.  This is a list of the cycles with a few of the chansons that belong to each:\n* The Geste du roi. In these the chief character was Charlemagne or his heirs, and a pervasive theme was his role as the divine champion of Christianity.  This cycle contains the earliest and best known of the epics –\n** The Song of Roland ( for the Oxford text, the earliest version: several others exist, including an Occitan version)\n** Fierabras ()\n** Aspremont (–1200)\n** Huon de Bordeaux (–1268)\n** Chanson de Saisnes by Jean Bodel (1200)\n* The Geste de Garin de Monglane, whose central character was William of Orange.  These dealt with knights who were typically younger sons without an inheritance who sought land and glory through combat with the Saracens.\n** Chanson de Guillaume ()\n** Couronnement de Louis (1130)\n** Charroi de Nîmes (1140)\n** ''Prise d'Orange (1150?)\n** Aliscans (1165)\n** Aymeri de Narbonne and Girart de Vienne by Bertrand de Bar-sur-Aube (1190–1217)\n* The Geste de Doon de Mayence (or the \"rebel vassal cycle\"); this cycle was concerned with rebels against (often unjust) royal authority and its most famous characters were Renaud de Montauban and Girart de Roussillon.\n** Gormond et Isembart\n** Girart de Roussillon (1160–1170)\n** Renaud de Montauban or Les quatre fils Aymon (end of the 12th century)\n** Raoul de Cambrai (end of the 12th century)\n** Doön de Mayence (mid 13th century)\n* A fourth grouping, not listed by Bertrand, is the Crusade cycle, dealing with the First Crusade and its immediate aftermath, and including:\n** Chanson d'Antioche\n** Les Chétifs\n** Chanson de Jérusalem\nNew chansons'' tended to be produced and incorporated into the existing literature in two ways:\n* A separate period or adventure in the life of an established hero was told (for example, his childhood).\n* The adventures of one of the ancestors or descendants of an established hero was told.\nThis method of epic expansion, with its obsession with blood line, was to be an important compositional technique throughout the Middle Ages.  It also underscores the symbolic weight placed within this culture on family honor, paternal fidelity and on the idea of proving one's filial worth.\nAs the genre matured, it began to borrow elements from the French roman and the role of love became increasingly important.  In some chansons de geste an element of self-parody appears, as in the Pèlerinage de Charlemagne.\nThe Roman\n, MS. Douce 195), folio 1r, portrait of Guillaume de Lorris.]]\nJean Bodel's other two categories—the \"Matter of Rome\" and the \"Matter of Britain\"—concern the French romance or \"roman\".  The term \"roman\" signifies, roughly, \"vernacular\" (i.e. not Latin), but it is used to designate narrative poetry (\"romance\") usually written in octosyllabic rhymed couplets and telling stories of chivalry and love.\nThe most famous \"romans\" are those of the \"Matter of Britain\" dealing with Arthurian romance, the stories of Tristan and Iseult, the heroic legend of the doomed utopia of Camelot and the Holy Grail.  Much of this material derives from Breton (Celtic) legends.  The most important of these writers was Chrétien de Troyes (twelfth century).\nThe \"Matter of Rome\" concerns romances that take place in the ancient world, such as romances dealing with Alexander the Great, Troy, the Aeneid and Oedipus.  Yet Bodel's category leaves little place for another important group of romances: those adventurous romances which are often set in Byzantium.\nSometimes linked with the \"roman\" are the Breton lais, narrative ballads of Britain by Marie de France, many of which have Celtic themes and origins.\nAround a hundred verse romances survive from the period 1150–1220. From around 1200 on, the tendency was increasingly to write the romances in prose (many of the earlier verse romances were adapted into prose versions), although new verse romances continued to be written to the end of the 14th century., and it was chiefly in their prose form that many romances were read from the 14th to the 16th century.\nThe success of the early Arthurian romances also led, from around 1200 on, to a restructuring and compiling of the material into vast prose cycles.\nImportant \"Matter of Rome\" romances of the 12th century\n* Roman de Thèbes\n* ''Roman d'Enéas (1160)\n* Roman de Troie (1154–1173) – Benoît de Sainte-Maure\n* Roman d'Alexandre (1177) – this romance uses a twelve-syllable verse and is the reason why this verse length is termed alexandrine\nImportant Byzantine and adventure romances of the 12th century\n* Flore and Blanchefleur\n* Florimont – Aimon de Varenne (1188)\n* Guillaume d'Angleterre – sometimes ascribed to Chrétien de Troyes\n* Robert le Diable\nImportant romances of Britain of the 12th and 13th centuries\n* Brut – Wace\n* Erec and Enide – Chrétien de Troyes\n* Cligès – Chrétien de Troyes (1162)\n* Lancelot\" or \"Lancelot, the Knight of the Cart – Chrétien de Troyes (1164)\n* Yvain, the Knight of the Lion – Chrétien de Troyes (1180)\n* Perceval or the Story of the Grail – Chrétien de Troyes (1185)\n* Romance of the Grail – Robert de Boron (1191–1201)\n* Tristan – Thomas of Britain (1155–1178)\n* Tristan – Béroul ()\n* Roman de Fergus – William the Clerk (late 12th century/early 13th century)\nImportant romances of the 13th and 14th centuries:\n* Chastelaine de Vergy\n* The \"Lancelot-Grail\" or \"Vulgate Cycle\" and its sections – a prose reworking of the Lancelot and Grail stories (1205)\n* The \"Post-Vulgate Cycle\" – another prose reworking of the Lancelot and Grail stories\n* Perceforest\n* Gui de Warewic (1232–1242)\n* Roman de la Rose (\"Romance of the Rose\") – Guillaume de Lorris (around 1225–1237) and Jean de Meun (1266–1277)\nThe most important romance of the 13th century is the Romance of the Rose which breaks considerably from the conventions of the chivalric adventure story: in a dream a lover comes upon a garden and meets various allegorical figures.  The second part of the work (written by Jean de Meun) expands on the initial material with scientific and mythological discussions.  The novel would have an enormous impact on French literature up to the Renaissance.\nRelated to the previous romance is the medieval narrative poem called \"dit\" (literally \"spoken\", i.e. a poem not meant to be sung) which follows the poetic form of the \"roman\" (octosyllabic rhymed couplets). These first-person narrative works (which sometimes include inserted lyric poems) often use allegorical dreams (songes''), allegorical characters, and the situation of the narrator-lover attempting to return toward or satisfy his lady. The 14th-century poet Guillaume de Machaut is the most famous writers of \"dits\"; another notable author of \"dits\" is Gautier le Leu. King René I of Naples's allegorical romance ''Cœur d'amour épris'' (celebrated for its illustrations) is also a work in the same tradition.\nLyric poetry\nMedieval French lyric poetry was indebted to the poetic and cultural traditions in Southern France and Provence—including Toulouse, Poitiers, and the Aquitaine region—where \"langue d'oc\" was spoken (Occitan language); in their turn, the Provençal poets were greatly influenced by poetic traditions from the Hispano-Arab world.  The Occitan or Provençal poets were called troubadours, from the word \"trobar\" (to find, to invent). Lyric poets in Old French are called \"trouvères\", using the Old French version of the word (for more information on the \"trouvères\", their poetic forms, extant works and their social status, see the article of that name).\nThe occitan troubadours were amazingly creative in the development of verse forms and poetic genres, but their greatest impact on medieval literature was perhaps in their elaboration of complex code of love and service called \"fin amors\" or, more generally, courtly love.  The \"fin amors\" tradition appears at roughly the same time in Europe as the Cult of the Virgin Mary, and the two have obvious similarities. In the \"fin amors\" tradition, the poet pledges his service to his lady (\"dame\", usually a married woman), in much the same way a knight or vassal pledges service to his lord. In the poems of the troubadours, the lady is frequently cold, distant, or upset with the poet and demands that he prove his service to her; the poet, for his part, is generally tormented by his passion, and his poems are often desperate pleas to his lady so that she might grant him some favor. In some troubadour poetry, the \"favor\" sought for is decidedly sexual, but in others there is a rarefied notion of love as spiritual and moral force. For more information on the troubadour tradition, see Provençal literature.\nSelected trouvère poets of the 12th and 13th centuries:\n* Conon de Béthune ()\n* Le Châtelain de Couci (d.1203)\n* Blondel de Nesle (second half of the 12th century)\n* Richard the Lionheart (Richard Coeur de Lion) (1157–1199)\n* Gace Brulé (active 1180–1213)\n* Colin Muset (around 1230)\n* Theobald IV of Champagne (1201–1253)\n* Adam de la Halle ()\n* Guiot de Provins (d. after 1208)\nBy the late 13th century, the poetic tradition in France had begun to develop in ways that differed significantly from the troubadour poets, both in content and in the use of certain fixed forms. The new poetic (as well as musical: some of the earliest medieval music has lyrics composed in Old French by the earliest composers known by name) tendencies are apparent in the Roman de Fauvel in 1310 and 1314, a satire on abuses in the medieval church filled with medieval motets, lais, rondeaux and other new secular forms of poetry and music (mostly anonymous, but with several pieces by Philippe de Vitry who would coin the expression Ars nova [new art, or new technique] to distinguish the new musical practice from the music of the immediately preceding age).  The best-known poet and composer of ars nova secular music and chansons was Guillaume de Machaut. (For more on music, see medieval music; for more on music in the period after Machaut, see Renaissance music).\nSelected French poets from the late 13th to the 15th centuries:\n* Rutebeuf (d.1285)\n* Guillaume de Machaut (1300–1377)\n* Eustache Deschamps (1346-)\n* Alain Chartier ()\n*Christine de Pizan (1364–1430)\n* Charles, duc d'Orléans (1394–1465)\n* François Villon (1431–1465?)\nThe last three poets on this list deserve further comment.\nCharles, duc d'Orléans was a noble and head of one of the most powerful families in France during the Hundred Years' War. Captured in the Battle of Agincourt, he was a prisoner of the English from 1415 to 1441 and his ballades often speak of loss and isolation. His son became King Louis XII of France.\nChristine de Pizan was one of the most prolific writers of her age. Her most famous work is The Book of the City of Ladies, which is considered a foundational feminist text, along with Le Livre de la mutation de fortune, where she depicts in an autobiographical allegorical poem an early account of gender transitioning to enable her to become a male writer to sustain her family after the death of her father. She is often acknowledged to be the first female professional writer. Over the course of her lifetime, she produced 41 pieces of prose or poetry. She ran her own manuscript workshop and employed women as well as men to be scribes and illuminators.\nFrançois Villon was a student and vagabond whose two poetic \"testaments\" or \"wills\" are celebrated for their portrayal of the urban and university environment of Paris and their scabrous wit, satire and verbal puns. The image of Villon as vagabond poet seems to have gained almost mythic status in the 16th century, and this figure would be championed by poetic rebels of the 19th century and 20th centuries (see Poète maudit).\nPoetic forms used by medieval French poets include:\n* Ballade\n* Rondeau (or Rondel)\n* Ditié\n* Dits moraux\n* Lai\n* Virelai\n* Pastourelle\n* Complainte\n* Chanson\n** Chanson de toile (\"weaving song\")\n** Chanson de croisade\n** Chanson courtoise\n** Rotrouenge\n* Chant royal\n* Aube (\"dawn poem\")\n* Jeu parti\nTheater\nDiscussions about the origins of non-religious theater (théâtre profane)—both drama and farce—in the Middle Ages remain controversial, but the idea of a continuous popular tradition stemming from Latin comedy and tragedy to the 9th century seems unlikely.\nMost historians place the origin of medieval drama in the church's liturgical dialogues and \"tropes\". At first simply dramatizations of the ritual, particularly in those rituals connected with Christmas and Easter (see Mystery play), plays were eventually transferred from the monastery church to the chapter house or refectory hall and finally to the open air, and the vernacular was substituted for Latin. In the 12th century one finds the earliest extant passages in French appearing as refrains inserted into liturgical dramas in Latin, such as a Saint Nicholas (patron saint of the student clercs) play and a Saint Stephen play.\nDramatic plays in French from the 12th and 13th centuries:\n* Le Jeu d'Adam (1150–1160) – written in octosyllabic rhymed couplets with Latin stage directions (implying that it was written by Latin-speaking clerics for a lay public)\n* Le Jeu de Saint Nicolas – Jean Bodel – written in octosyllabic rhymed couplets\n* Le Miracle de Théophile – Rutebeuf (c.1265)\nThe origins of farce and comic theater remain equally controversial; some literary historians believe in a non-liturgical origin (among \"jongleurs\" or in pagan and folk festivals), others see the influence of liturgical drama (some of the dramas listed above include farcical sequences) and monastic readings of Plautus and Latin comic theater.\nNon-dramatic plays from the 12th and 13th centuries:\n* Le Dit de l'herberie – Rutebeuf\n* Courtois d'Arras (c.1228)\n* Le Jeu de la feuillé (1275) – Adam de la Halle\n* Le Jeu de Robin et de Marion (a pastourelle) (1288) –  Adam de la Halle\n* Le Jeu du Pèlerin (1288)\n* Le Garçon et l'aveugle (1266–1282)\n* Aucassin et Nicolette (a chantefable) – a mixture of prose and lyrical passages\nSelect list of plays from the 14th and 15th centuries:\n* La Farce de maître Trubert et d'Antrongnard – Eustache Deschamps\n* Le Dit des quatre offices de l'ostel du roy – Eustache Deschamps\n* Miracles de Notre Dame\n* Bien Avisé et mal avisé (morality) (1439)\n* La Farce de maître Pierre Pathelin (1464–1469) – this play had a great influence on Rabelais in the 16th century\n* Le Franc archer de Bagnolet (1468–1473)\n* Moralité (1486) – Henri Baude\n* L'Homme pécheur (morality) (1494)\n* La Farce du cuvier\n* La Farce nouvelle du pâté et de la tarte\nIn the 15th century, the public representation of plays was organized and controlled by a number of professional and semi-professional guilds:\n* Clercs de la Basoche (Paris) – Morality plays and farces\n* Enfants sans Souci (Paris) – Farces and Sotties\n* Conards (Rouen)\n* Confrérie de la Passion (Paris) – Mystery plays\nGenres of theater practiced in the Middle Ages in France:\n* Farce – a realistic, humorous, and even coarse satire of human failings\n* Sottie – generally a conversation among idiots (\"sots\"), full of puns and quidproquos\n* Pastourelle – a play with a pastoral setting\n* Chantefable – a mixed verse and prose form only found in \"Aucassin et Nicolette\"\n* Mystery play – a depiction of the Christian mysteries or Saint's lives\n* Morality play\n* Miracle play\n* Passion play\n* Sermon Joyeux – a burlesque sermon\nThe Sources of Farce\nOver two hundred farces from medieval France have survived: more extant than in any other European vernacular. The vast majority are preserved in four principal collections or “pseudocollections” (recueils factices); this term refers to a group of plays that were initially copied or printed separately but which were later bound together in accordance with the idiosyncratic vision of their sixteenth-century compilers.\n* The Recueil du British Museum: The sixty-four plays of the Recueil du British Museum were printed between 1540 and 1550, mostly by Barnabé Chaussard of Lyon. The vast majority are farces; they were first edited by Anatole de Montaiglon for Viollet le Duc’s ten-volume Ancien Théâtre françois (Paris: P. Jannet, 1854–57)\n* The Recueil La Vallière: The Norman-inflected Recueil La Vallière, a compilation of manuscripts, is now owned by the Bibliothèque Nationale (BNF, Ms. 24341), where a digitized version is available through Gallica. Copied around 1575, it houses seventy-four plays, forty-eight of them farces, some staged by the Conards of Rouen. The Recueil La Vallière was first edited by Antoine Le Roux de Lincy and Francisque Michel in their four-volume Recueil de farces, moralités et sermons joyeux (Paris: Téchener, 1837)\n* The Recueil Cohen or the Recueil de Florence: With fifty-three plays all designated as farces, the Recueil Cohen was first edited by Gustave Cohen in 1949 as the Recueil de Farces françaises inédites du XVe siècle (Cambridge, Mass.: Mediaeval Academy of America, 1949). It then disappeared for many years until the Dutch scholar, Jelle Koopmans, relocated and reedited the original as the Recueil de Florence: 53 farces imprimées à Paris vers 1515 (Orléans: Paradigme, 2011). Koopmans posits that the plays were printed in Paris in two installments during the first quarter of the sixteenth century between ca. 1504-21 and 1512-21\n* The Recueil Trepperel: the Recueil Trepperel dates from approximately 1504-25, and consists of thirty-five plays, five of which are farces. Editions of its pieces were not issued until the mid-twentieth century, when Eugénie Droz, produced a first volume in 1935 as Le Recueil Trepperel: Les Sotties (Geneva: Droz, 1935), followed by a second volume in 1961, in collaboration with Halina Lewicka: Le Recueil Trepperel: Les Farces. Travaux d’Humanisme et Renaissance, 45. (Geneva: Droz, 1961)\nFable and satire\nA large body of fables survive in Old French; these include (mostly anonymous) literature dealing with the recurring trickster character of Reynard the Fox.  Marie de France was also active in this genre, producing the Ysopet (Little Aesop) series of fables in verse.\nRelated to the fable was the more bawdy \"fabliau\", which covered topics such as cuckolding and corrupt clergy.  These \"fabliaux\" would be an important source for Chaucer and for the Renaissance short story (\"conte\" or \"nouvelle\").\nSatire was also written during this period, including the Roman de Fauvel, which mocks the sins of humanity by making the Seven Deadly Sins appear in the personification of a horse.\nThe prose satire Les XV [Quinze] joies de mariage (The Fifteen Joys of Marriage, first published 1480–90, written perhaps in the early 15th century, and attributed variously to Antoine de la Sale, Gilles Bellemère the bishop of Avignon, and many others) is a riotous critique of wives, but it also provides important insight into the economic and social life of a married household in the 15th century.\nHistory and chronicles\nProse compositions in the Middle Ages—other than the prose versions of romances and \"chansons de geste\"—include a number of histories and chronicles, of which the most famous are those of Robert de Clari and Geoffroy de Villehardouin (both on the Fourth Crusade of 1204 and the capture of Constantinople), Jean de Joinville (on Saint Louis IX of France), Jean Froissart (on the wars of the 14th century) and Philippe de Commines and Enguerrand de Monstrelet (on the troubles of the 15th century).\nA program for a vernacular history of France organized by the reigns of its kings was first conceived in the 13th century at the Abbey of Saint-Denis. The result was the Grandes Chroniques de France, the earliest version of which was Primat of Saint-Denis's Roman des rois, presented to King Philip III in about 1274.\nWilliam of Santo Stefano wrote a history of the Knights Hospitaller in Old French.\nOther\nPhilippe de Mézières wrote \"Songe du Vieil Pelerin\" (1389), an elaborate allegorical voyage in which he described the customs of Europe and the near East.\nSee also\n*Allegory in the Middle Ages\n*Medieval theatre\nNotes\nReferences\nGeneral:\n* Zink, Michel. 1995. Medieval French Literature: An Introduction.  Trans. Jeff Rider. Binghamton: Medieval & Renaissance Texts and Studies. .\n* Hasenohr, Geneviève and Michel Zink, eds.  Dictionnaire des lettres françaises: Le Moyen Age.  Collection: La Pochothèque.  Paris: Fayard, 1992.\n* Cole, William.  First and Otherwise Notable Editions of Medieval French Texts Printed from 1742 to 1874:  A Bibliographical Catalogue of My Collection.  Sitges:  Cole & Contreras, 2005.\n* Holmes Jr., Urban Tigner [U.T.].  A History of Old French Literature from the Origins to 1300.  New York: F.S. Crofts, 1938. (Although from 1938, this text is still considered a thorough overview of the literature.)\nChanson de geste:\n* Crosland, Jesse.  The Old French Epic. New York: Haskell House, 1951.\nRoman:\n* Kelly, Douglas.  Medieval French Romance.  Twayne's World Author Series.  New York: Twayne, 1993.\nPoetry:\n* Akehurst, F.R.P. and Judith M. Davis, eds.  A Handbook of the Troubadours.  Berkeley: U of Calif., 1995.\n* Goldin, Frederick.  Lyrics of the Troubadours and Trouvères: An Anthology and History.  Gloucester, Mass.: Peter Smith, 1983.\n* Poésie lyrique au Moyen Age.  Collection: Classiques Larousse.  Paris: Larousse, 1975.\n*  Wilhelm,  James J., (editor), [https://books.google.com/books?id=rIOUgtk_DJgC Lyrics of the Middle Ages : an anthology], New York : Garland Pub., 1990.\nExternal links\n*\n*"
    }
  ]
}