{
  "content": [
    {
      "type": "text",
      "text": "# Medieval Serbian literature\n\n}}\n, a notable example of Old Serbian Cyrillic illuminated manuscript West-East art Gospel Book on parchment with very rich decorations, masterpiece of illustration and calligraphy. (Serbia's UNESCO's Memory of the World Register)]]\nMedieval Serbian literature or Old Serbian literature () refers to the literature written in medieval forms of Serbian language, up to the end of the 15th century, with its traditions extending into the early modern period.\nDuring the Middle Ages itinerant scribe monks from the Balkans travelled to Kievan Rus and beyond and their Church Slavonic writings became a common literary language for centuries among all Slavs.\nBackground\nMedieval Serbia is an heir of Constantine the Great's Byzantium, the eastern part of the Roman Empire. Serbian Old Church Slavonic literature was created on Byzantine model, and at first church services and biblical texts were translated into Slavic, and soon afterward other works for Christian life values from which they attained necessary knowledge in various fields (including Latin works). Although this Christian literature educated the Slavs, it did not have an overwhelming influence on original works. Instead, a more narrow aspect, the genres, and poetics with which the cult of saints could be celebrated were used, owing to the Slavic celebration of Cyril and Methodius and their Slav disciples as saints and those responsible for Slavic literacy.\nThe ritual genres were hagiographies, homiletics and hymnography, known in Slavic as žitije (vita), pohvala (eulogy), službe (church services), effectively meaning prose, rhetoric, and poetry. The fact that the first Slavic works were in the canonical form of ritual literature, and that the literary language was the ritual Slavic language, defined the further development. Codex Marianus represents the oldest found manuscript dating back to the 11th century, if not older, written in medieval Serbian recension of Old Slavonic. Medieval Slavic literature, especially Serbian, was modelled on this classical Slavic literature. The new themes in Serbian literature were all created within the classic ritual genres.\nThe oldest known work to date of Serbian secular literature is the legend of Vladimir and Kosara recorded in writing in the Serbian state of Duklja in the 11th century. Surviving only in excerpts and in translation, it is both a love story and a heroic song about the righteous Prince Vladimir, executed unjustly in 1016 in consequence of a struggle for the throne.\nOrigin\n, founder of the medieval Serbian literature.]]\nUnlike the countries of Western Europe, Serbia traces its history, literature, artistic, religious and cultural heritage when Christianity became a state religion during the time of Constantine the Great and New Rome. Between the 10th and 13th century, however, the foundations of independent Serbian literature was formed through its Old Serbian Vita. In this period, the direction and character of literature were built with an elementary system of genres in its main guidelines, with a selected and modified literary language.\nOnly with the works of Saint Sava and the development of the autocephalous Serbian church did the Serbian literature receive the content that would make it an equal and active participant in the literary life of the Orthodox Slavic world. Also, we must not ignore the role that the Serbian Chancellery in Dubrovnik (Ragusa) played in the history of Serbian Cyrillic. Hence, the 13th century was not only the new but main stage in the constitution of Serbian medieval literature. This stage ended sometime prior to the end of the century, with the ultimate standardization of the Serbian orthography in literacy and completing the creation of the main genres of the period: the Hagiography (žitije) and Divine Service (služba). The main literary centers of the early Nemanjić state were finally established by the end of the 13th century: Hilandar, Studenica, Žiča, Mileševa, Peć; in which the supply of Old Slavic general literature was filled with works of Serbian, domestic literary workshops.\nIn the course of the 13th century, Serbian literature sought to reach the height of Byzantine-Slavic literature. The motive of these activities, its main driver, is in the creation of Serbian Orthodox cults, cults of the holy dynasty (the Nemanjić) and the autocephalous church. In order to enter the world of Byzantine and European civilization of the Middle Ages, it was necessary for Serbia not only to have its independent state and independent Church but also to have its role in the general Christian culture of that time, especially participation in holiness, in a higher spiritual community, where the Serbian people was represented through \"their [own] people\". Its own literature was thus a necessary expression of social and national independence but at the same time integration in the spiritual ecumene of the Christian civilization through which it showed maturity and justified the political existence of the state itself on the world scale. On this basis, all of the specificnesses of the old Serbian literature developed, as well as its universal, global identity: specificities are expressed in the creation of general genres, mostly in the hagiographical literature, i.e. the so-called \"ruler historiography\"; far less pronounced in hymnography, in poetry, where the canons of Byzantine poetics are quite obvious. The role of founding the father of the independent Serbian literature is held by Saint Sava, the youngest son of Grand Prince Stefan Nemanja, founder and first Archbishop of the independent Serbian Church.\nWith Saint Sava and others (namely Monk Simeon) there came works in the next century by prominent writers of the period, such as Domentijan and Atanasije, Grigorije II of Ras,  Teodosije, Elder Grigorije, Antonije Bagaš, Lazar the Hilandarian, Pachomius the Serb, Gabriel the Hilandarian, Constantine of Kostenets, Cyprian, Metropolitan of Kiev, Gregory Tsamblak, Isaija the Monk, Grigorije of Gornjak, Rajčin Sudić, Jakov of Serres, Romylos of Vidin, Jovan the Serb of Kratovo, Gabriel of Lesnovo, Nicodemus of Tismana, Dimitar of Kratovo, Anonymous Athonite, Marko Pećki, and Demetrius Kantakouzenos, alongside important texts by women poets and writers, including Jefimija, Maria Angelina Doukaina Palaiologina, Princess Milica of Serbia, Saint Angelina of Serbia, Mara Branković, Olivera Despina, Jelena Balšić, Helen of Anjou, Simonida, Katarina Branković and others. One of the most prominent writers of medieval Serbia was archbishop Danilo II (d. 1337).\nThe 1370s mark the beginning of the separation between Serbian Cyrillic and Latin alphabets as far as the two chancelleries in Ragusa are concerned. With the establishment of Manasija Monastery by Stefan Lazarević (d. 1427), many educated monks have gathered there. They fostered copying and literary work that by its excellence and production changed the history of the South Slavic literature and languages spreading its influence all over the Orthodox Balkans and Imperial Russia. One of the most famous scholars of the School of Rešava was Constantine the Philosopher, an influential writer and biographer of the founder of the school, Stefan Lazarević. Lazarević was by far one of the most erudite people of his time and considering his views, interests, and achievements, he was a true representative of the Serbian Renaissance.\nFrom 1459, with the fall of the Smederevo up until the First Serbian Uprising in 1804, the Orthodox Christian monasteries were important centers that kept the Serbian culture alive and well during difficult and turbulent three and half-century occupation. The scriptorium of each monastery was a bastion of learning where illuminated manuscripts were being produced as well as great theological and scholastic works such as the Old Serbian Vita (hagiographies of Serbian kings and archbishops) also found in both Russian and Bulgarian literature. Throughout this time Serbs living under the Habsburgs, the Venetians and the lands of their Vlach co-religionists (Wallachia and Moldavia) were printing books, building monasteries, schools, hospitals, churches and kept the earliest of the Arts and Crafts movements busy painting icons and iconostases during the Renaissance—the transition from the Middle Ages to modernity. The testaments to this are the many Serbian Orthodox monasteries, churches and libraries (institutions) found today in Hungary (Ráckeve and Serbian Kovin Monastery), Romania (Hodoș-Bodrog, Bazjaš, Sveti Đurađ, Bezdin, Zlatica, Cusici (Kušić), Sveti Simeon, Šemljug, and others), Greece (Hilandar, Mount Athos and Meteora), Italy (Saint Spyridon), Croatia, Bosnia and Herzegovina, Northern Macedonia, Kosovo and Albania that speak of their rich art and literature.\nSeveral philosophical works, mainly Greek (Byzantine) have also been translated into Serbian language, or adapted during the medieval period.\nThe growth of the Renaissance Period occurred with the arrival of Serbian and Bulgarian hagiographers, literati, and artists who had escaped from their native lands when these were either threatened or occupied by the Ottomans. Their creative activities in science and literature are personified in the extraordinary individuals such as Lazar the Serb, among the early Hilandarians to arrive in Moscow from Mount Athos; the Bulgarian-born Gregory Tsamblak who arrived from Serbia and eventually became the Metropolitan of Kiev; Pachomius the Serb, one of the representatives of a new ornamental style known as pletenie slova (word-braiding), and others.\nFrom the 1630s onward Kiev emerged as the leading center of East Slavic cultural life. Of great significance was the Kyiv-Mohyla Academy at the time. Later, Theophan Prokopovich would put his imprint on Russian Baroque literature that spread far and wide, particularly in Serbia. It was in the famed Kievan Academy in the latter part of the 17th and the beginning of the 18th century that young Serbian artists and teachers received their western education.\nNumerous authors of the Serbian Orthodox Church books who worked in the Rača monastery from the 15th- to 18th-century are named in Serbian literature – \"The Račans\"... Among these anonymous, monk-scribes identified by their first names, the most renown are the illuminator Hieromonk Hristifor Račanin, Teodor Račanin, Kiprijan Račanin, Grigorije Račanin,  Prohor Račanin, Ćirjak Račanin, Jerotej Račanin, Simeon Račanin, Jefrem Janković Tetovac, and Gavril Stefanović Venclović. These are well-known Serbian writers that are the link between literary men and women of the late medieval (Late Middle Ages) and Baroque periods in art, architecture, and literature in particular.\nPoetry\nWorks\n*Life of Stefan Nemanja (1208), hagiography on St. Simeon, by Archbishop Sava\n*Life of St. Sava (1254), hagiography on St. Sava, by Domentijan\n*Life of St. Sava (1292–1300), hagiography on St. Sava, by Teodosije\n*Studenica Chronicle (1350–1400), chronicle\n*Karlovac Chronicle (1418–27), chronicle\n*Life of Despot Stefan Lazarević (ca. 1431), biography on Stefan Lazarević, by Constantine of Kostenets\n*Koporin Chronicle (1453), chronicle, by deacon Damjan\n*Dečani Chronicle (1450–1500), chronicle\nSee also\n* List of Glagolitic manuscripts\n* Medieval Serbian law\n* Medieval Serbian charters\n* Serbian chronicles\n* Serbian manuscripts\n* Serbian printing\n* Serbian literature\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}