{
  "content": [
    {
      "type": "text",
      "text": "# Medieval Warm Period__disambig_2\n\nThe Medieval Warm Period (MWP), also known as the Medieval Climate Optimum or the Medieval Climatic Anomaly, was a time of warm climate in the North Atlantic region that lasted from about  to about . Climate proxy records show peak warmth occurred at different times for different regions, which indicate that the MWP was not a globally uniform event. Some refer to the MWP as the Medieval Climatic Anomaly to emphasize that climatic effects other than temperature were also important.\nThe MWP was followed by a regionally cooler period in the North Atlantic and elsewhere, which is sometimes called the Little Ice Age (LIA).\nPossible causes of the MWP include increased solar activity, decreased volcanic activity, and changes in ocean circulation. Modelling evidence has shown that natural variability is insufficient on its own to explain the MWP and that an external forcing had to be one of the causes.\nResearch\nThe MWP is generally thought to have occurred from about  to about , during the European Middle Ages. Some researchers divide the MWP into two phases: MWP-I, which began around  and ended around , and MWP-II, which lasted from about  to about ; MWP-I is called the early Medieval Warm Period while MWP-II is called the conventional Medieval Warm Period. In 1965, Hubert Lamb, one of the first paleoclimatologists, published research based on data from botany, historical document research, and meteorology, combined with records indicating prevailing temperature and rainfall in England around  and around . He proposed,\n, and was followed by a decline of temperature levels till between around  the coldest phase since the last ice age occurred.}}\nThe era of warmer temperatures became known as the Medieval Warm Period and the subsequent cold period the Little Ice Age (LIA). However, the view that the MWP was a global event was challenged by other researchers. The IPCC First Assessment Report of 1990 discussed the:\n(which may not have been global) and the Little Ice Age which ended only in the middle to late nineteenth century.}}\nIt stated that temperatures in the:\n) appear to have been exceptionally warm in western Europe, Iceland and Greenland.}}\nThe IPCC Third Assessment Report from 2001 summarized newer research:\nGlobal temperature records taken from ice cores, tree rings, and lake deposits have shown that the Earth may have been slightly cooler globally (by ) than in the early and the mid-20th century.\nPalaeoclimatologists developing region-specific climate reconstructions of past centuries conventionally label their coldest interval as \"LIA\" and their warmest interval as the \"MWP\". Others follow the convention, and when a significant climate event is found in the \"LIA\" or \"MWP\" timeframes, they associate their events to the period. Some \"MWP\" events are thus wet events or cold events, rather than strictly warm events, particularly in central Antarctica, where climate patterns that are opposite to those of the North Atlantic have been noticed.\nUsing methods of historical climatology, Christian Pfister and Heinz Wanner reconstructed the seasonal temperature conditions for Western and Central Europe in 2021 on the basis of indices from CE 1000 to 1999 (the autumns only from 1500 onwards).\nGlobal climate during the Medieval Warm Period\nThe nature and extent of the MWP has been marked by long-standing controversy over whether it was a global or regional event. In 2019, by using an extended proxy data set, the Pages-2k consortium confirmed that the Medieval Climate Anomaly was not a globally synchronous event. The warmest 51-year period within the MWP did not occur at the same time in different regions. They argue for a regional instead of global framing of climate variability in the preindustrial Common Era to aid in understanding.\nNorth Atlantic\nLloyd D. Keigwin's 1996 study of radiocarbon-dated box core data from marine sediments in the Sargasso Sea found that its sea surface temperature was approximately  cooler approximately 400 years ago, during the LIA, and 1700 years ago, and was approximately  warmer 1000 years ago, during the MWP.\nUsing sediment samples from Puerto Rico, the Gulf Coast, and the Atlantic Coast from Florida to New England, Mann et al. found consistent evidence of a peak in North Atlantic tropical cyclone activity during the MWP, which was followed by a subsequent lull in activity.\nIceland\nIceland was first settled between about 865 and 930, during a time believed to be warm enough for sailing and farming. By retrieval and isotope analysis of marine cores and from examination of mollusc growth patterns from Iceland, Patterson et al. reconstructed a stable oxygen (δ18 O) and carbon (δ13 C) isotope record at a decadal resolution from the Roman Warm Period to the MWP and the LIA. Patterson et al. conclude that the summer temperature stayed high but winter temperature decreased after the initial settlement of Iceland.\nGreenland\nare from an Icelandic marriage in 1408 but were recorded later in Iceland, at Hvalsey Church, which is now the best-preserved of the Norse ruins.]]\nThe Mann et al. study found warmth exceeding 1961–1990 levels in southern Greenland and parts of North America during the MWP, which the study defines as from 950 to 1250, with warmth in some regions exceeding temperatures of the 1990–2010 period. Much of the Northern Hemisphere showed a significant cooling during the LIA, which the study defines as from 1400 to 1700, but Labrador and isolated parts of the United States appeared to be approximately as warm as during the 1961–1990 period. Greenlandic winter oxygen isotope data from the MWP display a strong correlation with the North Atlantic Oscillation (NAO). map, based on documentary information about earlier Norse sites in America.]]\nThe Norse colonization of the Americas has been associated with warmer periods. The common theory is that Norsemen took advantage of ice-free seas to colonize areas in Greenland and other outlying lands of the far north. However, a study from Columbia University suggests that Greenland was not colonized in warmer weather, but the warming effect in fact lasted for only very briefly. Around  the climate was sufficiently warm for the Vikings to journey to Newfoundland and to establish a short-lived outpost there.\n, Newfoundland, today, with a reconstruction of a Viking settlement.]]Around 985, Vikings founded the Eastern and Western Settlements, both near the southern tip of Greenland. In the colony's early stages, they kept cattle, sheep, and goats, with around a quarter of their diet from seafood. After the climate became colder and stormier around 1250, their diet steadily shifted towards ocean sources. By around 1300, seal hunting provided over three quarters of their food.\nBy 1350, there was reduced demand for their exports, and trade with Europe fell away. The last document from the settlements dates from 1412, and over the following decades, the remaining Europeans left in what seems to have been a gradual withdrawal, which was caused mainly by economic factors such as increased availability of farms in Scandinavian countries.\nEurope\nSubstantial glacial retreat in southern Europe was experienced during the MWP. While several smaller glaciers experienced complete deglaciation, larger glaciers in the region survived and now provide insight into the region's climate history. In addition to warming induced glacial melt, sedimentary records reveal a period of increased flooding, coinciding with the MWP, in eastern Europe that is attributed to enhanced precipitation from a positive phase NAO. Other impacts of climate change can be less apparent such as a changing landscape. Preceding the MWP, a coastal region in western Sardinia was abandoned by the Romans. The coastal area was able to substantially expand into the lagoon without the influence of human populations and a high stand during the MWP. When human populations returned to the region, they encountered a land altered by climate change and had to reestablish ports. In the Iberian Central Range, there was elevated lake productivity and soil erosion, along with frequent intense runoff events.\nOther regions\nNorth America\nIn Chesapeake Bay (now in Maryland and Virginia, United States), researchers found large temperature excursions (changes from the mean temperature of that time) during the MWP (about 950–1250) and the Little Ice Age (about 1400–1700, with cold periods persisting into the early 20th century), which are possibly related to changes in the strength of North Atlantic thermohaline circulation. Sediments in Piermont Marsh of the lower Hudson Valley show a dry MWP from 800 to 1300. In the Hammock River marsh in Connecticut, salt marshes extended  farther westward than they do in the present due to higher sea levels.\nProlonged droughts affected many parts of what is now the Western United States, especially eastern California and the west of Great Basin. Alaska experienced three intervals of comparable warmth: 1–300, 850–1200, and since 1800. Knowledge of the MWP in North America has been useful in dating occupancy periods of certain Native American habitation sites, especially in arid parts of the Western United States. Aridity was more prevalent in the southeastern United States during the MWP than the following LIA, but only slightly; this difference may be statistically insignificant. Droughts in the MWP may have impacted Native American settlements also in the Eastern United States, such as at Cahokia. Review of more recent archaeological research shows that as the search for signs of unusual cultural changes has broadened, some of the early patterns (such as violence and health problems) have been found to be more complicated and regionally varied than had been previously thought. Other patterns, such as settlement disruption, deterioration of long-distance trade, and population movements, have been further corroborated.\nAfrica\nThe climate in equatorial eastern Africa has alternated between being drier than today and relatively wet. The climate was drier during the MWP (1000–1270). Off the coast of Africa, Isotopic analysis of bones from the Canary Islands' inhabitants during the MWP to LIA transition reveal the region experienced a  decrease in air temperature. Over this period, the diet of inhabitants did not appreciably change, which suggests they were remarkably resilient to climate change.\nAntarctica\nThe onset of the MWP in the Southern Ocean lagged the MWP's onset in the North Atlantic by approximately 150 years. A sediment core from the eastern Bransfield Basin, in the Antarctic Peninsula, preserves climatic events from both the LIA and the MWP. The authors noted, \"The late Holocene records clearly identify Neoglacial events of the LIA and Medieval Warm Period (MWP).\" Some Antarctic regions were atypically cold, but others were atypically warm between 1000 and 1200.\nPacific Ocean\nCorals in the tropical Pacific Ocean suggest that relatively cool and dry conditions may have persisted early in the millennium, which is consistent with a La Niña-like configuration of the El Niño-Southern Oscillation patterns.\nIn 2013, a study from three US universities was published in Science magazine and showed that the water temperature in the Pacific Ocean was  warmer during the MWP than during the LIA and  warmer than the decades before the study. In the northeastern Pacific, however, sea surface temperatures (SSTs) were actually cooler during the MWP than the LIA.\nSouth America\nThe MWP has been noted in Chile in a 1500-year lake bed sediment core, as well as in the Eastern Cordillera of Ecuador.\nA reconstruction, based on ice cores, found that the MWP could be distinguished in tropical South America from about 1050 to 1300 and was followed in the 15th century by the LIA. Peak temperatures did not rise as to the level of the late 20th century, which were unprecedented in the area during the study period of 1600 years.\nEast Asia\nGe et al. studied temperatures in China for the past 2000 years and found high uncertainty prior to the 16th century but good consistency over the last 500 years highlighted by the two cold periods, 1620s–1710s and 1800s–1860s, and the 20th-century warming. They also found that the warming from the 10th to the 14th centuries in some regions might be comparable in magnitude to the warming of the last few decades of the 20th century, which was unprecedented within the past 500 years. Generally, a warming period was identified in China, coinciding with the MWP, using multi-proxy data for temperature. However, the warming was inconsistent across China. Significant temperature change, from the MWP to LIA, was found for northeast and central-east China but not for northwest China and the Tibetan Plateau. During the MWP, the East Asian Summer Monsoon (EASM) was the strongest it has been in the past millennium and was highly sensitive to the El Niño Southern Oscillation (ENSO). The Mu Us Desert witness increased moisture in the MWP. Peat cores from peatland in southeast China suggest changes in the EASM and ENSO are responsible for increased precipitation in the region during the MWP. However, other sites in southern China show aridification and not humidification during the MWP, showing that the MWP's influence was highly spatially heterogeneous. Modelling evidence suggests that EASM strength during the MWP was low in early summer but very high during late summer.\nIn far eastern Russia, continental regions experienced severe floods during the MWP while nearby islands experienced less precipitation leading to a decrease in peatland. Pollen data from this region indicates an expansion of warm climate vegetation with an increasing number of broadleaf and decreasing number of coniferous forests.\nAdhikari and Kumon (2001), investigating sediments in Lake Nakatsuna, in central Japan, found a warm period from 900 to 1200 that corresponded to the MWP and three cool phases, two of which could be related to the LIA. Other research in northeastern Japan showed that there was one warm and humid interval, from 750 to 1200, and two cold and dry intervals, from 1 to 750 and from 1200 to now.\nSouth Asia\nThe Indian Summer Monsoon (ISM) was also enhanced during the MWP with a temperature driven change to the Atlantic Multi-decadal Oscillation (AMO), bringing more precipitation to India. Vegetation records in Lahaul in Himachal Pradesh confirm a warm and humid MWP from 1,158 to 647 BP. Pollen from Madhya Pradesh dated to the MWP provides further direct evidence for increased monsoonal precipitation. Multi-proxy records from Pookode Lake in Kerala also reflect the warmth of the MWP.\nMiddle East\nSea surface temperatures in the Arabian Sea increased during the MWP, owing to a strong monsoon. During the MWP, the Arabian Sea exhibited heightened biological productivity. The Arabian Peninsula, already extremely arid in the present day, was even drier during the MWP. Prolonged drought was a mainstay of the Arabian climate until around 660 BP, when this hyperarid interval was terminated.\nOceania\nThere is an extreme scarcity of data from Australia for both the MWP and the LIA. However, evidence from wave-built shingle terraces for a permanently-full Lake Eyre during the 9th and the 10th centuries is consistent with a La Niña-like configuration, but the data are insufficient to show how lake levels varied from year to year or what climatic conditions elsewhere in Australia were like.\nA 1979 study from the University of Waikato found,\n) suggested the Medieval Warm Period to have occurred between [... about ] and to have been  warmer than the Current Warm Period.}}\nMore evidence in New Zealand is from an 1100-year tree-ring record.\nSee also\n* Classic Maya collapse – Concurrent with the Medieval Warm Period and marked by decades-long droughts\n*\n*\n*\n*\n*\n*\n*\nReferences\n}}\nFurther reading\n*\n*\n*\n*\n*\nExternal links\n* [http://www.historicalclimatology.com HistoricalClimatology.com], further links, resources, and relevant news, updated 2016\n* [http://www.climatehistory.net Climate History Network]\n* [https://web.archive.org/web/20090318081017/http://agu.org/revgeophys/mayews01/node5.html The Little Ice Age and Medieval Warm Period] at the American Geophysical Union"
    }
  ]
}