{
  "content": [
    {
      "type": "text",
      "text": "# Medieval European magic\n\nin a 15th-century manuscript]]\nThe term \"magic\" in the Middle Ages encompassed a variety of concepts and practices, ranging from mystical rituals calling upon supernatural forces to herbal medicine and other mundane applications of what are today considered the natural sciences. Magic could have both positive and negative connotations, and could be practiced across European society by monks, priests, physicians, surgeons, midwives, folk healers, and diviners. People had strongly differing opinions as to what magic was, and because of this, it is important to understand all aspects of magic at this time.\nHistory\nMagic practices such as divination, interpretation of omens, sorcery, and use of charms had been specifically forbidden in Mosaic Law and condemned in Biblical histories of the kings. Many of these practices were spoken against in the New Testament as well. The model of the magician in Christian thought was provided by Simon Magus, (Simon the Magician), a figure who opposed Saint Peter in both the Acts of the Apostles and the apocryphal yet influential Acts of Peter.\nThe historian Michael D. Bailey stated that in medieval Europe, magic was a \"relatively broad and encompassing category\". Christian theologians believed that there were multiple different forms of magic, the majority of which were types of divination, for instance, Isidore of Seville produced a catalogue of things he regarded as magic in which he listed divination by the four elements i.e. geomancy, hydromancy, aeromancy, and pyromancy, as well as by observation of natural phenomena e.g. the flight of birds and astrology. He also mentioned enchantment and ligatures (the medical use of magical objects bound to the patient) as being magical. Medieval Europe also saw magic come to be associated with the Old Testament figure of Solomon; various grimoires, or books outlining magical practices, were written that claimed to have been written by Solomon, most notably the Key of Solomon.\nIn early medieval Europe, magia was a term of condemnation. In medieval Europe, Christians often suspected Muslims and Jews of engaging in magical practices; in certain cases, these perceived magical rites—including the alleged Jewish sacrifice of Christian children—resulted in Christians massacring these religious minorities. Christian groups often also accused other, rival Christian groups such as the Hussites—which they regarded as heretical—of engaging in magical activities. Medieval Europe also saw the term maleficium applied to forms of magic that were conducted with the intention of causing harm. The later Middle Ages saw words for these practitioners of harmful magical acts appear in various European languages: sorcière in French, Hexe in German, strega in Italian, and bruja in Spanish. The English term for malevolent practitioners of magic, witch, derived from the earlier Old English term wicce.\nMagic is a major component and supporting contribution to the belief and practice of spiritual, and in many cases, physical healing throughout the Middle Ages. Emanating from many modern interpretations lies a trail of misconceptions about magic, one of the largest revolving around wickedness or the existence of nefarious beings who practice it. These misinterpretations stem from numerous acts or rituals that have been performed throughout antiquity, and due to their exoticism from the commoner's perspective, the rituals invoked uneasiness and an even stronger sense of dismissal.\n, featuring various magical sigils (סגולות segulot in Hebrew)]]\nIn the Medieval Jewish view, the separation of the mystical and magical elements of Kabbalah, dividing it into speculative theological Kabbalah (Kabbalah Iyyunit) with its meditative traditions, and theurgic practical Kabbalah (''Kabbalah Ma'asit), had occurred by the beginning of the 14th century.\nDespite the many negative connotations which surround the term magic, there exist many elements that are seen in a divine or holy light. The divine right of kings in England was thought to be able to give them \"sacred magic\" power to heal thousands of their subjects from sicknesses.\nGeorgius Gemistus Pletho (/1360 – 1452/1454), a Greek scholar, was one of the most renowned philosophers of the late Byzantine era. He was a chief pioneer of the revival of Greek scholarship in Western Europe. As revealed in his last literary work, the Nomoi or Book of Laws, which he only circulated among close friends, he rejected Christianity in favour of a return to the worship of the classical Hellenic Gods, mixed with ancient wisdom based on Zoroaster and the Magi''. Pletho may also have been the source for Marsilio Ficino's Orphic system of natural magic.\nDiversified instruments or rituals used in medieval magic include, but are not limited to: various amulets, talismans, potions, as well as specific chants, dances, and prayers. Along with these rituals are the adversely imbued notions of demonic participation which influence of them. The idea that magic was devised, taught, and worked by demons would have seemed reasonable to anyone who read the Greek magical papyri or the Sefer-ha-Razim and found that healing magic appeared alongside rituals for killing people, gaining wealth, or personal advantage, and coercing women into sexual submission. Archaeology is contributing to a fuller understanding of ritual practices performed in the home, on the body and in monastic and church settings.\nin 1456, the seven artes prohibitae or artes magicae, arts prohibited by canon law, were expounded by Johannes Hartlieb, their sevenfold partition reflecting that of the artes liberales and artes mechanicae, were: nigromancy (black or demonic magic), geomancy, hydromancy, aeromancy, pyromancy, chiromancy, and scapulimancy.\nForms\nModern scholarship continues to debate on how to classify the various forms of medieval European magic, although several terms have emerged.  Common or cunning folk magic is thought to be practiced by healers and diviners.  Learned magic or ritual magic is thought to be practiced by literate and clerical practitioners who rely upon magic books (later called grimoires) for their knowledge and practice.  Learned magic also encompasses demonic magic and angelic magic based on the belief of heavenly angels and fallen angels (or demons).\nAstrology\nAstrology in its rudimentary form was categorized under spirituality. However, many of the subsections under medieval magic relied on the contextual information within astrology in order to be effective. People who practiced magic often relied on the influence of astrological power for their practices. The presence of astrology in the Middle Ages is recorded on the walls of the San Miniato al Monte basilica in Florence, Italy. The art on the walls of the basilica depict all of the zodiac symbols. Each of the zodiac during this era were connected with a specific part of the human body. People who practice magic during this period could take the zodiac into consideration of the practices more precisely if it were directly related to body parts.\nDivination\nDivination in the Middle Ages can be used as a broad term to define practices used to understand or foresee one's fate and to connect with the entities that brought about said fate. There were multiple ways by which people could attempt divination. Tarot cards were present during the Middle Ages, but it is not clear how the cards were used and interpreted during this period. However, the general placement of the cards would have affected the interpretation of the message.\nCharms\nPrayers, blessings, and adjurations were all common forms of verbal formulas whose intentions were hard to distinguish between the magical and the religious. In the Christian context, prayers were typically requests directed to a holy figure such as God, a saint, Christ, or Mary. Blessings more often were addressed to patients, and came in the form of wishes for good fortune. Adjurations, which is defined as the process of making an oath, are also used as exorcisms were more directed to either a sickness, or the agent responsible such as a worm, ghost, demon, or fairy of a mischievous or malevolent nature.  While these three verbal formulas may have had religious intentions, they often played a role in magical practices. Blessings were more often than not strictly religious as well, unless they were used alongside magic or in a magical context. However, adjurations required closer scrutiny, as their formulas were generally derived from folklore. Though people at this age were less concerned with whether or not these verbal formulas involved magic or not, but rather with the reality of if they were or were not successful, because they were used to heal.\nIn addition to the Christian base of charms, tangible items were incorporated into the magical practice. Such items included amulets, talismans, gemstones, as well as smaller items that were used to create the amulets. These items were convenient because they could be kept on one's person at all times, and they served many purposes. They could protect the user from multiple forms of danger, bring the user good fortune, or they could combine multiple blessings and protections depending on how the charm user interacted with them.\nMedical magic\nMedical care in the Middle Ages was extremely broad and took many different forms. Practices like therapy revolved around plants, animals, and minerals at this time. Medicinal practices in the Middle Ages were often regarded as herbalism. One example of a book that gave recipes and descriptions of plants, animals, and minerals was referred to as a “leechbook”, or a doctor-book that included Masses to be said to bless the healing herbs. There were over 400 herbs and plants recorded in different medical books produced during this time. For example, a procedure for curing skin disease first involves an ordinary herbal medicine followed by strict instructions to draw blood from the neck of the ill, pour it into running water, spit three times and recite a sort of spell to complete the cure. In addition to the leechbook, the Lacnunga included many prescriptions derived from the European folk culture. The Lacnunga prescribed a set of Christian prayers to be said over the ingredients used to make the medicine, and such ingredients were to be mixed by straws with the names “Matthew, Mark, Luke, and John” inscribed on them. In order for the cure to work, several charms had to be sung in Latin over the medicine. Books like the \"leechbook\" and the Lacnunga were essentially recipe books that contained details on what each recipe could be used for and it gave detailed descriptions of the plants that were used for healing. Each book contained different content, because popular belief was always changing.\nSorcery\nNot only was it difficult to make the distinction between the magical and religious, but what was even more challenging was to distinguish between helpful (white) magic from harmful (black) magic. Medical magic and protective magic were regarded as helpful, and called ‘white’, while sorcery was considered evil and ‘black’. Distinguishing between black magic and white magic often relied on perspective, for example, if a healer attempted to cure a patient and failed, some would accuse the healer of intentionally harming the patient. In this era, magic was only punished if it was deemed to be ‘black’, meaning it was the practice of a sorcerer with harmful intention.\nAngel or Spirit Magic\nA cleric or priest who sought knowledge or influence would learn and practice from a book of magic in order to call upon the aid of angels.  The best-known medieval books on angelic magic include the Notory Art (Latin: Ars Notoria), the Sworn Book of Honorius (Latin: Liber Iuratus Honorius), and The Circle (Arabic: Almadel or Almandal, listed as Ars Almadel in the seventeenth century Lemegeton), and the Book of Raziel (Latin: Liber Razielis, not to be confused with another work called Sefer Raziel HaMalakh).\nThe thirteenth century Notory Art claims to enhance its practitioner's mental and spiritual faculties, improve one's ability to communicate with angels through dreams, and grant earthly and heavenly knowledge.  The thirteenth century Latin translation known as the Book of Raziel drew upon an older Hebrew compilation which offers a mythical account in which the angel Raziel delivered to Adam a book of magic revealing the mysteries of creation after his exile from the Garden of Eden.  The fourteenth century Sworn Book of Honorius presents a magical system for attaining the divine vision of God and communicating with angels and other spirits for practical advantages and power. Lastly, the fifteenth century Almandal has a special altar made of either metal or wax designed for the purpose of summoning angels or spirits of \"the altitudes\" which correspond to the signs of the zodiac.\nOpposition\nEarly opposition\nViews on magic changed throughout the years and as time went on more controls were placed on magic, these controls varied from place to place and also depended on social status. The adoption of Christianity saw pre-Christian mythological creatures reinterpreted as devils, who are also referenced in the surviving charms. In late Anglo-Saxon England, nigromancy ('black magic', sometimes confused with necromancy) was among the practices condemned by Ælfric of Eynsham  (c. 955–c. 1010):\nWitches still go to cross-roads and to heathen burials with their delusive magic and call to the devil; and he comes to them in the likeness of the man that is buried there, as if he arises from death.\nGregory of Nyssa (c. 335 – c. 395) had said that demons had children with women called cambions, which added to the children they had between them, contributed to increase the number of demons. However, the first popular account of such a union and offspring does not occur in Western literature until around 1136, when Geoffrey of Monmouth wrote the story of Merlin in his pseudohistorical account of British history, Historia Regum Britanniae (History of the Kings of Britain), in which he reported that Merlin's father was an incubus.\nAnne Lawrence-Mathers writes that at that time \"... views on demons and spirits were still relatively flexible. There was still a possibility that the daemons of classical tradition were different from the demons of the Bible.\" Accounts of sexual relations with demons in literature continues with The Life of Saint Bernard by Geoffrey of Auxerre ( 1160) and the Life and Miracles of St. William of Norwich by Thomas of Monmouth ( 1173). The theme of sexual relations with demons became a matter of increasing interest for late 12th-century writers.\nProphetiae Merlini (The Prophecies of Merlin), a Latin work of Geoffrey of Monmouth in circulation by 1135, perhaps as a libellus or short work, was the first work about the prophet Myrddin in a language other than Welsh. The Prophetiae was widely read—and believed—much as the prophecies of Nostradamus would be centuries later; John Jay Parry and Robert Caldwell note that the Prophetiae Merlini \"were taken most seriously, even by the learned and worldly wise, in many nations\", and list examples of this credulity as late as 1445.\nIt was only beginning in the 1150s that the Church turned its attention to defining the possible roles of spirits and demons, especially with respect to their sexuality and in connection with the various forms of magic which were then believed to exist.  Christian demonologists eventually came to agree that sexual relationships between demons and humans happen, but they disagreed on why and how. A common point of view is that demons induce men and women to the sin of lust, and adultery is often considered as an associated sin.\nLegal prohibitions\nLegislation against magic could be one of two types, either by secular authorities or by the Church. The penalties assigned by secular law typically included execution, but were more severe based on the impact of the magic, as people were less concerned with the means of magic, and more concerned with its effects on others. The penalties by the Church often required penance for, what they viewed as the sin of magic, or in harsher cases could excommunicate the accused under the circumstances that the work of magic was a direct offense against God. The distinction between these punishments, secular versus the Church, were not absolute as many of the laws enacted by both parties were derived from the other.\nThe persecution of magic can be seen in law codes dating back to the 6th century, where the Germanic code of Visigoths condemned sorcerers who cursed the crops and animals of peasant's enemies. In terms of secular legislation, Charles the Great (Charlemagne) was arguably the strongest opposing force to magic. He declared that all who practiced sorcery or divination would become slaves to the Church, and all those who sacrificed to the Devil or Germanic gods would be executed.\nCharlemagne's objection to magic carried over into later years, as many rulers built on his early prohibitions. King Roger II of Sicily punished the use of poisons by death, whether natural or magical. Additionally, he proclaimed that ‘love magic’ be punished regardless of if anyone was hurt or not. However, secular rulers were still more concerned with the actual damage of the magic rather than the means of its infliction.\nInstructions issued in 800 at a synod in Freising provide general outlines for ecclesiastical hearings. The document states that those accused of some type of sorcery were to be examined by the archpriest of the diocese in hopes of prompting a confession. Torture was used if necessary, and the accused were often sentenced to prison until they resolved to do penance for their sins.\nProsecution in the Early Middle Ages\nImportant political figures were the most frequently known characters in trials against magic, whether defendants, accusers, or victims. This was because high-society trials were more likely to be recorded as opposed to trials involving ordinary townspeople or villagers. For example, Gregory of Tours recorded the accusations of magic at the royal court of 6th century Gaul. Prosecution of magic was infrequent during this era because Christians were willing to adapt magic practices within the context of religion. For example, astrology was created by the Greeks, who were considered to be pagans by Medieval Christians. Astrology was condemned if it were used to control destiny because the Christian God is supposed to be the one who controls destiny. Early Christians were accommodating of astrology as long as it was connected to the physical realm as opposed to the spiritual.\nRise of witch trials\nThe rise of witch trials is brought about by changes in religion as well as changes to the political world in Europe showing once again how different topics had an influence on witchcraft.The fourteenth century already brought about an increase of sorcery trials, however the second and third quarters of the fifteenth century were known for the most dramatic uprising of trials involving witchcraft. The trials developed into catch-all prosecution, in which townspeople were encouraged to seek out as many suspects as possible. The goal was no longer to secure justice against a single offender but rather to purge the community of all transgressors.\nMagic and Christianity\nWitchcraft and magic has connections to many other topics in the Middle Ages, making it a very important and influential topic. It has a large connection to religion due to the fact that Christianity had a major impact on those who practiced magic. When Christianity became more strict it viewed witches as atheists, in turn prosecuting them for it. Christianity and Catholicism grew with movements like the Spanish Reconquista, which ended in 1492 when Spain conquered Granada. This movement was a crusade and those involved forced others to convert to Christianity.\nSee also\n*\n*\n*\nReferences\nWorks cited\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*"
    }
  ]
}