{
  "content": [
    {
      "type": "text",
      "text": "# Media coverage in conjunction with the news media phone hacking scandal\n\nnewspaper was at the forefront of reporting from the beginning of the phone hacking scandal, keeping developments in the public eye.]]\nalso published key articles that prompted further inquiries by the national oversight bodies and law enforcement organizations.]]\nThis is a chronological list of key newspaper articles that made significant new public disclosures about the illegal acquisition of confidential information by news media companies.\n:# 20 September 2002;  The Guardian  published a lengthy expose by Graeme McLagan regarding Jonathan Rees involvement with corrupt police officers and the illegal acquisition of confidential information for News of the World and other newspapers.\n:# 8 & 9 July 2009; The Guardian published three articles authored by Nick Davies and Vikram Dodd titled 1) \"Murdoch papers paid £1m to gag phone-hacking victims,\" 2) \"Trail of hacking and deceit under nose of Tory PR chief,\" and 3) \"Ex-Murdoch editor Andrew Neil: News of the World revelations one of most significant media stories of our time.\" These articles alleged that '''Rupert Murdoch's' News Group Newspapers (NGN) entered into large settlement agreements with hacking victims that included gagging provisions, which prevented the public from learning the Metropolitan Police Service held evidence that NGN journalists repeatedly used criminal methods to get stories. The articles also alleged that many people at News of the World'', including then editor Andy Coulson were aware of widespread phone hacking and that the public and Parliament had been misled about its scope. As a result of these articles, assistant police commissioner John Yates was asked to take a fresh look at the Met's previous investigations into phone hacking. Days after this became public, Max Clifford announced his intentions to sue and ultimately settled for £1,000,000.\n:# 1 September 2010; The New York Times published an article authored by Don Van Natta Jr., Jo Becker, and Grahm Bowley titled \"Tabloid Hack Attack on Royals, and Beyond.\" The article claimed the Metropolitan Police Service \"failed to follow-up on clear leads\" and \"declined to pursue other evidence of criminality by others.\" The article also contridicted testimony by former News of the World editor Andy Coulson to Parliament that he was unaware of phone hacking.\n:# 15 December 2010- The Guardian published an article authored by Nick Davies titled \"Phone hacking approved by top News of the World executive – new files.\" The article disclosed that documents seized from the home of private investigator Glenn Mulcaire by Metropolitan Police Service in 2006 and only recently made available to the public by court action imply that News of the World editor Ian Edmondson specifically instructed Mulcaire to intercept voice messages of Sienna Miller, Jude Law, and several others. The documents also imply Mulcaire was engaged by others at News of the World, including chief reporter Neville Thurlbeck and assistant editor Greg Miskiw, who then worked directly for Andy Coulson. This contradicted testimony to the Commons Culture, Media, and Sport Committee by newspaper executives and senior Met officials that Mulcaire acted on his own and that there was no evidence of hacking by other than him and a single \"rogue reporter,\" namely Clive Goodman. Five weeks after the Guardian article appeared, the Met renewed its investigation into phone hacking, something it had declined to do since 2007.\n:# 4 July 2011; The Guardian published an article authored by Nick Davies and Amelia Hill titled \"Missing Milly Dowler's voicemail was hacked by News of the World.\" This article disclosed that voicemail messages from Milly Dowler's phone had been hacked back in 2002 by an agent of News of the World looking for a story.  This disclosure inflamed public opinion and led to the closure of News of the World and resignations of senior newspaper executives and police officials. The Metropolitan Police Service later attempted to use the Official Secrets Act to find the ''Guardian's sources for this story.\n:# 22 September 2011; The Independent published an article authored by James Cusick and Cahal Milmo reporting that, within weeks of the arrests of Clive Goodman and Glenn Mulcaire in August 2006, \"a senior police officer\" advised Rebekah Brooks there was substantial \"circumstantial evidence\" in the documents seized from Mulcaire that News of the World'' journalists in addition to Goodman were implicated in phone hacking. It also reported that in early autumn 2006, Tom Crone, legal manager for News International, contacted several other executives, including then News of the World editor Andy Coulson, informing them of what the Met told Brooks. News International executives, including Crone, maintained they were not aware of such evidence until almost two years later, in May 2008, when they received a copy of the \"Transcript for Neville\" in conjunction with Gordon Taylor's law suit.\nPress releases\n, headquartered on Avenue of the Americas in New York City, issued several press releases.]]\nThis is a chronological list of press releases issued by various organizations regarding the illegal acquisition of confidential information by news media employees and their agents in conjunction with the phone hacking scandal. Dates indicate when each release first appeared.\n# Daily Mail: (2006) [rejects the accusations in the ICO report, What Price Privacy?].\n# Press Complaints Commission: (23 August 2006) \"Phone message tapping, the PCC and the Editors' Code of Practice\".\n# Press Complaints Commission: (1 February 2007) \"PCC action following Clive Goodman case\".\n# Press Complaints Commission: (18 May 2007) \"PCC publishes new guidelines on subterfuge and newsgathering\".\n# Press Complaints Commission: (9 July 2009) \"PCC statement on phone message tapping claims\".\n# Press Complaints Commission: (9 November 2009) \"PCC report on phone message tapping allegations published\".\n# Press Complaints Commission: (15 November 2009) \"Statement by Baroness Buscombe on new evidence in the phone message hacking episode- Statement by Baroness Buscombe, Chairman of the Press Complaints Commission\".\n# Press Complaints Commission: (21 September 2010) \"PCC letter to Alan Rusbridger\" [\"allegedly criminal behavior involving News of the World\"]\n# Press Complaints Commission: (31 January 2011) \"PCC statement on phone hacking\".\n# Press Complaints Commission: (8 April 2011) \"Statement from the PCC's Phone Hacking Review Committee \".\n# News Corp: (8 April 2011) \"News International Statement with Regard to Voicemail Interception at the News of the World During 2004-2006\".\n# Press Complaints Commission: (14 April 2011) \"Text of PCC letter to Mark Lewis \".\n# News Corp: (16 June 2011) \"Sir Charles Gray Agrees to Act as the Independent Adjudicator for Compensation Scheme\" [liability in a number of civil cases involving the newspaper]\n# Press Complaints Commission: (5 July 2011) \"PCC statement on latest phone hacking allegations\".\n# News Corp: (6 July 2011) \"News International Statement\" [Metropolitan Police Service opening a new investigation into police payments]\n# News Corp: (6 July 2011) \"Statement from Rupert Murdoch, Chairman and Chief Executive Officer, News Corporation\" [recent allegations of phone hacking and making payments to police]\n# Metropolitan Police: (6 July 2011) \"On 20 June 2011 the MPS was handed a number of documents by News International, through their barrister, Lord Macdonald QC. Our initial assessment shows that these documents include information relating to alleged inappropriate payments to a small number of MPS officers.\"\n# Press Complaints Commission: (6 July 2011) \"Statement from the PCC on phone hacking following meeting today\".\n# News Corp: (7 July 2011) \"James Murdoch, Deputy Chief Operating Officer, News Corporation, and Chairman, News International Statement on News of the World\"\n# Press Complaints Commission: (8 July 2011) \"The Press Complaints Commission responds to today's speech by Ed Miliband.\"\n# Press Complaints Commission: (8 July 2011) \"PCC response to the Prime Minister.\"\n# Press Complaints Commission: (8 July 2011) \"PCC public members: our work goes on.\"\n# News Corp: (10 July 2011) \"News International Statement on Guardian Article - 7/10/2009.\"\n# Metropolitan Police: (11 July 2011) \"Three bailed following Operation Weeting and Elveden arrests\"\n# Strathclyde Police: (July 2011) \"Operation Rubicon: Phone Hacking and Perjury Enquiry:\n# Press Complaints Commission: (13 July 2011) \"The PCC today welcomes the announcement of the terms of the inquiry into media ethics (13 July 2011) .\"\n# News Corp: (15 July 2011) \"News Corporation names Tom Mockridge Chief Executive Officer of News International\" [replaces Rebekah Brooks]\n# News Corp: (15 July 2011) \"A Message from James Murdoch on Issues at News International\" [relating to News of the World]\n# News Corp: (18 July 2011) \"Grabiner Named as New Independent Chairman of Management and Standards Committee\"\n# News Corp: (19 July 2011) \"Statement Prepared by Rupert Murdoch for the Culture, Media and Sport Select Committee.\"\n# News Corp: (20 July 2011) \"Statement from Viet Dinh on Behalf of the Independent Directors of News Corporation\" [committed to doing the right thing]\n# News Corp: (20 July 2011) \"Statement from the Management and Standards Committee\" [authorized Harbottle & Lewis to answer questions]\n# News Corp: (21 July 2011) \"Statement from the Management and Standards Committee\" [dismissed Nixson]\n# News Corp: (21 July 2011) \"Statement from the Management and Standards Committee\" [discontinued financial arrangements with Glenn Mulcaire]\n# News Corp: (21 July 2011) \"Statement from James Murdoch, Deputy Chief Operating Officer and Chairman and CEO, International News Corporation\" [stands behind testimony]\n# Press Complaints Commission: (29 July 2011) \"Baroness Buscombe announces end of term as Chairman of the PCC\n# News Corp: (16 August 2011) \"Statement from the Management and Standards Committee\" [evidence from the Culture Media and Sport Select Committee]\".\n# News Corp: (6 September 2011) \"News International Statement regarding testimony before Culture, Media and Sport Select Committee\" [response by James Murdoch to testimony by Colin Myler and Tom Crone]\n# Metropolitan Police: (12 September 2011) \"New Commissioner named.\"\n# Leveson Inquiry: (14 September 2011) \"Ruling on Core Participants\" [issued by The Rt. Hon. Lord Justice Leveson] [http://www.webcitation.org/636oQdSGI?url=http://www.levesoninquiry.org.uk/wp%2Dcontent/uploads/2011/09/Core%2DParticipants%2Dfinal%2D14.09.11.pdf]\n# Metropolitan Police: (19 September 2011) \"MPS applies for production order\"\n# Metropolitan Police: (19 September 2011) \"MPS responds to production order reporting\".\n# Metropolitan Police: (20 September 2011) \"Update on DPS investigation into leaks from Operation Weeting\"\n# Metropolitan Police: (20 September 2011) \"Former MPS contractor charged\"\n# Crown Prosecution Service: (24 July 2012) \"Alison Levitt QC's announcement on charges arising from Operation Weeting\"\nMedia coverage\nThese are a chronological lists of news articles, editorials, and other statements by news media organizations reflecting varying levels of aggressiveness and defensiveness in reporting the phone hacking scandal.\nThe scandal generated broad interest worldwide shortly after The Guardian reported on 4 July 2011 that murdered teenager Milly Dower's phone had been hacked into by agents of News of the World and after Rupert Murdoch announced that the 168-year-old newspaper would be closed as a consequence.  Many contemporary commentators noted that the amount, aggressiveness, and focus of early media coverage of the scandal by news organizations varied widely, ostensibly reflecting the tension between journalistic integrity and the vested interests of the ultimate owners of those organizations.\nIncluded below are samples of media coverage immediately after The Guardian reported the hacking of Milly Dowlers phone.  The samples are grouped by whether the reporting was by independent news organizations or organizations owned by News Corporation, the ultimate parent of News of the World.  Also included are media coverage analyses completed at the time.\nReporting by independent news organizations\nThe Guardian; (4 July 2012)  Journalists at The Guardian began pursuing the illegal acquisition of confidential information in 2002.  In July 2009, it published three articles  alleging that Rupert Murdoch's News Group Newspapers (NGN) entered into large settlement agreements with hacking victims that included gagging provisions that prevented the public from learning the Metropolitan Police Service held evidence that NGN journalists repeatedly used criminal methods to get stories. The articles also alleged that many people at News of the World, including then editor Andy Coulson, were aware of widespread phone hacking and that the public and Parliament had been misled about its scope. Days after this became public, Max Clifford announced his intentions to sue and ultimately settled for £1,000,000.  On 4 July 2011, The Guardian published an article disclosing that voicemail messages from Milly Dowler's phone had been hacked back in 2002 by an agent of News of the World looking for a story.  This disclosure inflamed public opinion and led to the closure of News of the World and resignations of senior newspaper executives and police officials.\nThe New York Times; (4 July 2011 )  The New York Times began investigative reporting on phone hacking in 2010 with an article titled \"Tabloid Hack Attack on Royals, and Beyond.\" The article claimed the Metropolitan Police Service \"failed to follow-up on clear leads\" and \"declined to pursue other evidence of criminality by others.\" The article also contradicted testimony by former News of the World editor Andy Coulson to Parliament that he was unaware of phone hacking.  The newspaper was encouraged earlier that year by The Guardian to investigate and report on phone hacking.  The NY Times reported the disclosures made by The Guardian regarding Milly Dowler's hacked phone on the same day The Guardian article appeared.\nThe Independent;  (5 July 2011) The Independent covered ''The Guardian's story about Milly Dowler the same day.  The newspaper also followed up with investigative reporting and published an article 22 September 2011 reporting that, within weeks of the arrests of Clive Goodman and Glenn Mulcaire in August 2006, \"a senior police officer\" advised Rebekah Brooks there was substantial \"circumstantial evidence\" in the documents seized from Mulcaire that News of the World'' journalists in addition to Goodman were implicated in phone hacking. It also reported that in early autumn 2006, Tom Crone, legal manager for News International, contacted several other executives, including then News of the World editor Andy Coulson, informing them of what the Met told Brooks. News International executives, including Crone, maintained they were not aware of such evidence until almost two years later, in May 2008, when they received a copy of the \"Transcript for Neville\" in conjunction with Gordon Taylor's lawsuit.\nThe Telegraph; (5 July 2011) The Telegraph covered ''The Guardian's'' story about Milly Dowler the next day.  The article quoted the Dowler's solicitor, Mark Lewis, who asked, \"Who at the News of the World was thinking it was appropriate to try to hack into the phone of a missing young girl?\"\nThe Los Angeles Times; (5 July 2011)  This newspaper also covered''The Guardian's'' story about Milly Dowler the next day, reporting that \"Revulsion swept the nation Tuesday amid allegations that a sensationalist tabloid owned by media baron Rupert Murdoch also intercepted and tampered with voicemails left for a kidnapped 13-year-old girl whose body was later found dumped in the woods.\"\nReporting by News Corporation subsidiaries\nFox News; (6 July 2012)   Fox first reported on the hacking of Milly Dowler's phone two days after it had been reported by The Guardian. The news anchor did not minimize the seriousness of the story.  There was some hesitancy to address the issue on 10 July on Fox News Watch, a show which is intended to cover the media.  Fox is totally owned by News Corporation, the ultimate parent company of News of the World.\n::Cal Thomas (Fox News contributor): Anybody want to bring up the subject we’re not talking about today for the — for the [online] streamers?\n::James Pinkerton (Fox News panelist): Sure. Go ahead, Cal!\n::Thomas: No, go ahead, Jim.\n::[laughter]\n::Thomas: I'm not going to touch it.\n::Judy Miller (Fox News contributor): With a 10-foot [unintelligible].\nWall Street Journal (14 July 2011) Rupert Murdoch used the Wall Street Journal', which he owned, to make his first public statements since the revelations that agents of News of the World, which he also owned, hacked the phone of Milly Dowler looking for a story.  Murdoch defended his company's actions, saying \"News Corp. has handled the crisis extremely well in every way possible, making just minor mistakes...He rejected criticism that James Murdoch had acted too slowly in dealing with the tabloid scandal.\"  On 18 July, the Journal's \"Review and Outlook\" article about the phone hacking scandal defended Dow Jones CEO Les Hinton and News International but strongly criticized politicians, police, and rival newspapers.  Rather than applaud rival newspapers for effective investigative reporting, the WSJ stated \"We also trust that readers can see through the commercial and ideological motives of our competitor-critics.\"  Two weeks later, on 2 August, the Journal published an article calling attention to an eleven-year-old case in which a reporter for a rival newspaper, The Sunday Mirror, was involved in bribing a police officer, noting that \"as police investigate the News of the World tabloid for allegedly bribing police officers for information, a libel case involving another London tabloid suggests that the practice may not have been unusual.\"\nThe Australian;  When Met police announced in December 2011 that there was no evidence phone hacking of Milly Dowler's phone by agents of News of the World had caused messages to be deleted or give her parents false hope of her being alive, the Australian, which is owned by News International carried the article published by The Times, also a News International newspaper, strongly critical of The Guardian and their investigative reporter, Nick Davies who broke the story.  The article raised the question, \"whether the paper would still exist if The Guardian had not erroneously blamed it for the Dowlers' false hope.\"  The article contained no criticism of News of the World for the phone hacking itself.\nMedia Coverage Analyses\nCNN; (13 July 2011) County Fair, a media blog with links to media criticism, included on its NewsCorpWatch webpage that Cable News Network (CNN) reported Fox News Watch had admitted avoiding reporting on the phone hacking at its parent company.  CNN found that Fox News Watch had not mentioned the scandal since August 2006 and that the L.A.Times reported that \"Fox News stays mainly silent on the scandal during prime time when Rupert Murdoch shut down News of the World.  Other major news networks reportedly had fairly extensive coverage, as did Sky News in the UK, whose controlling interest was owned by News Corp.  On the day after Murdoch closed News of the World, his New York Post mentioned the scandal on page 29.  In comparison, The New York Times and The Washington Post had front-page stories, as did Murdoch's Wall Street Journal and his Times of London.\nThe Atlantic Wire; (14 July 2011)\nABC News (Australia); (29 July 2011) The Australian Centre for Independent Journalism at the University of Technology Sydney conducted a study of coverage of the phone hacking scandal from 8 to 15 July by the Sydney Morning Herald, The Age, The Australian, the Adelaide Advertiser, the Sun Herald, the Sunday Telegraph, the Daily Telegraph and the Herald Sun to \"test of the independence of the 70 per cent of Australian newspaper journalists employed in the Murdoch stable.\"  For the broadsheets, the Sydney Morning Herald (Fairfax) carried 50 stories, more than any other paper, The Australian ran 44 stories, and The Age ran 33.  The Murdoch-owned Australian carried much commentary critical of responses to the scandal.  For the tabloids, none of the Murdoch-owned News Limited tabloids carried the phone-hacking story on the first two pages, with most stories not on the first 10 pages of the paper. Sydney tabloid The Daily Telegraph carried nine stories, the least of any paper. The Adelaide Advertiser and the Herald Sun each ran 16 stories.  During the week, all papers carried at least one editorial regarding phone hacking.  The Sydney Morning Herald and the Herald Sun carried two.\n}}\nReferences"
    }
  ]
}