{
  "content": [
    {
      "type": "text",
      "text": "# Medieval (film)\n\n| image                = Medieval-1.jpg\n| caption              = English poster\n| director             = Petr Jákl\n| producer             = Cassian Elwes\n| story                = Petr Jákl Sr.\n| screenplay           =  Petr Jákl\n| starring             =\n| music                = Philip Klein\n| cinematography       = Jesper Tøffner\n| editing              = Steven Rosenblum\n| distributor          = Bioscop\n| production_companies = WOG FILM s.r.o.\n| released             = }}\n| runtime              = 125 minutes\n| country              = Czech Republic\n| language             = English\n| budget               = KČ500 million($20.3 million)\n| gross                = $4.4 millionCzech Republic:KČ 50.6 millionUnited States:$1.4 million\n}}\nMedieval (Jan Žižka or Warrior of God) is a 2022 English-language Czech historical drama film directed by Petr Jákl. It is about the life of Jan Žižka, a Bohemian military commander who never lost a battle. The film is set prior to the Hussite Wars (1419–1434), when Žižka was young. It tells the story of how Žižka became a famous military commander. With a budget of KČ500 million ($20.3 million), it is the most expensive Czech film ever made.\nPlot\nIn the 14th century, Wenceslaus IV from the House of Luxembourg is the king of Bohemia, King of Germany and Roman emperor at the same time. Wenceslaus has received the throne after his father Charles IV, but his reign is not as successful, and he has built up a debt and the kingdom seems to fall apart under his weak rule.\nThe country is actually ruled by Henry III of Rosenberg, the most powerful nobleman in the country. The film follows Jan Žižka, a knight, mercenary, and future leader of the Hussite army who leads a mercenary group. In his outfit consists of ex-nobles, knights, cutthroats, and former thugs now fighting for Groschen.\nAfter saving Lord Boresh from brigands at the cost of losing one soldier, Žižka recruits the only surviving brigand, Mick and escorted Boresh to Prague where there was a debate on getting Wenceslaus to Rome for his coronation. Žižka's mercenary outfit consists of German veteran knight Ulrich, greedy soldier Conrad, archer Freddy, Norse berserker Lars, spearman Cyril, and his most senior member, Italian knight Giovanni, with Mick added to his group. After failing to gain Rosenberg's support, while aware it was him that hired Boresh's attackers, Jan is tasked to kidnap Rosenberg's fiancée Katherine which would force Rosenberg to keep his word and help Wenceslas IV to be crowned the emperor of the Holy Roman Empire.\nJan then returns to his childhood home to see his brother, Jaroslav and his nephew where he learned that they're aiding the rebels while providing them coin from his mercenary work. This gets Žižka involved with high politics as he and his men set their plan in motion by capturing Katherine at the Cathedral and smuggling her out on a cart full of cadavers. Žižka is now not only facing conflict with Rosenberg, but also with Wenceslaus' half-brother King Sigismund, who learn that Wenceslaus and Boresh orchestrated the abduction. They then send soldiers, Cumans led by Žižka's mentor Torak, and Rosenberg's personal guard, lead by Captain Martin, to recapture Katherine.\nTorak and his Cumans pillage Žižka's home village of Trocnov, torched his home, tortured his nephew and put him through a wooden spike, and kidnapped his brother Jaroslav to swap him for Katherine. Žižka killed his nephew to spare him further torment. One of the rebels, Barbara, was spared during the attack to warn Žižka, and later agrees to accompany Žižka and his mercenary outfit to the rebel camp where they train the rebels in combat. Katherine attempts to escape only for Jan and his men to catch her again. Torak and Martin engage in a hostage swap with Žižka, and Jaroslav blamed Jan for his son's death. Torak then sets up a trap in the mountain pass, but Žižka, aware of Torak's strategies, used the help of the rebels and great tactics to defeat Torak's men and recapture Katherine despite being outnumbered.\nŽižka and his men manage to escape with Jaroslav and Katherine, however, Giovanni was mortally wounded during the fight and died. They hid in a nearby cave but are ambushed by Torak and Martin and Žižka barely escapes losing his eye in a fight. The group splits up and Cyril was wounded by Torak while covering Žižka's escape and dies of his wounds. Katherine nurses Jan from his injury while Jan has fervent memories of his late friend, Anna. Katherine is then retaken by Torak's lieutenant, Ajdar, who is then killed and decapitated by Žižka. Torak is searching for Žižka while terrorizing local peasants and finds Ajdar's head impaled on a tree. Rosenberg and his personal guard soon close in on Žižka and Katherine. Jan is willing to free Katherine, but after witnessing Rosenberg's cruelty first-hand, Katherine decides against returning to him. They discovered Captain Martin and his men preparing to hang David, a young rebel in front of the peasants, and when Katherine attempted to intervene, Jan attacked the soldiers, but was beaten down due to the overwhelming numbers. Katherine kills Martin and the village peasants trample his men. Tovak appears at the village along with his men and Conrad, who betrayed Žižka's outfit and made a deal with Tovak, to discover the massacre. Conrad is shot and killed for his betrayal by Freddy.\nŽižka reunites with his men and the rebels agree to help escort Katherine to Wenceslaus's hunting castle, but Jan decided against it and chose to return Katherine to her father in France, however, his men refused to make the trek as they incapacitated and tied up Žižka and kidnapped Katherine who meanwhile had fallen in love with Žižka. Jan is freed by David and brought to a mortally wounded Boresh, who revealed that Sigismund kidnapped King Wenceslas and taken the castle. As he dies he notes that the world can't be changed for the better if kings can do such things.\nAware that his men are walking into a trap, Žižka decides to rally the peasants to save Katherine and reaches the castle. Katherine is taken to Wenceslaus's hunting castle and Žižka's men are immediately ambushed by Tovak's soldiers. Žižka's men are killed and Jan utilized Wenceslaus's pet lion to cover their flight.\nŽižka soon faces off against Torak, while the peasants and his men clash. During the fight, Jaroslav is knocked over the castle wall and rolls into the river but survives. Torak gains the upper and gives Žižka an ultimatum to join him or die hand but Katherine throws herself off the castle wall to the river to save Žižka. Jan jumps after her while pulling Torak with him. He bashes Torak's head to death with a rock while underwater and brings Katherine to the riverbank. She gives him her ring after they kiss and she dies. Žižka brings her body to the rebels.\nAn epilogue states that Sigismund became king of Bohemia after his brother's death but the people revolted against him. Sigismund, declaring them heretics, orchestrated crusades to Bohemia while Žižka led outnumbered peasants. The film ends during the Hussite Wars with Žižka leading a Hussite army in wagon fort facing a large army. It is shown that he is still keeping Katherine's ring. Žižka was described as one of the greatest military tacticians of all time and never lost a fight. The film was dedicated to those who fight for freedom.\nCast\n*Roland Møller as Torak, Žižka's ruthless mentor who commands Sigismund's Cumans\n*Werner Daehn as Ulrich, a veteran German knight in Žižka's outfit\n*Vinzenz Kiefer as Conrad, a greedy soldier in Žižka's outfit\n*Alistair Brammer as Freddy, an archer in Žižka's outfit\n*Magnus Samuelsson as Lars, a Norse berserker in Žižka outfit\n*Christopher Rygh as Mick, a brigand leader who attempted to kill Boresh but was ultimately recruited into Žižka's outfit\n*Guy Roberts as Cyril, a spear-wielding warrior in Žižka's outfit\n*David Bowles as Giovanni, an Italian knight and the oldest mercenary in Žižka's outfit\n*Jennifer Armour as Barbara, a Bohemian Rebel and Jaroslav's lover\n*Kevin Bernhardt as Captain Martin, Rosenberg's bodyguard who commands his personal guard\n*Jan Budař as Matthew, a Bohemian Rebel leader\n*Ondřej Vetchý as Ondřej\n*Romana Jákl Vítová as Theresa\n*Ben Cristovao as Adjar, a Cuman lieutenant under Torak's command\n*Sean Connor Renwick as David, a young Bohemian rebel\n*William Lizr as Nephew\n*Václav Jiráček as Zdenĕk\n*Marek Vašut as Wenceslas' chamberlain\n*Viktor Krištof as Jan Hus\n*James Beaumont as Voice of Jan Hus\n*Daniel Vávra as villager\n}}\nProduction\nIn 2013, Petr Jákl announced that he was preparing to make a film about Jan Žižka. He estimated a possible budget of 85 million Czech koruna. During 2014, it was scheduled for a 2016 release. Work on the film started after Jákl finished Ghoul in 2015. American agency William Morris Endeavor has assisted with recruitment of actors for the film. Jákl stated that Žižka would most likely be played by a foreign actor.\nIn August 2016, the process of recruiting extras for battles was started. The first round of recruitment concluded in January 2017, with thousands of volunteers.\nIn July 2017, Jákl announced that shooting would start in Spring 2018, and that it would take place in South Bohemia and Central Bohemia. He also stated that Žižka would definitely not be played by a Czech actor, saying that his USA contacts were talking with the agents of some American actors. Cassian Elwes became the film's producer on 6 March 2018.\nBen Foster was announced to be cast as Jan Žižka on 24 August 2018. Shooting was scheduled to start on 17 September 2018. Michael Caine was announced on 7 September 2018 to be cast as the fictional character of Lord Boreš. Matthew Goode was cast in November as King Sigismund.\nThe film was officially announced on 13 September 2018. The main cast included Til Schweiger, Marek Vašut, and Sophie Lowe, among others. The final budget was announced as 500,000,000 CZK (23,000,000 USD). Shooting started on 17 September 2018, continuing near Prague until October 2018. Shooting then moved to various Czech castles such as Křivoklát Castle before concluding in December 2018. Shooting took place primarily in Central Bohemia and South Bohemia.\nThemes and inspirations\nThe film is based on the youth of the famous Hussite commander Jan Žižka, one of the most successful military leaders of his time, who had never lost a battle. Director Petr Jákl (who had been known to film audience especially thanks to the popular thriller Kajínek about a well-known Czech prison escapee) said he wanted to promote Czech Republic in the world and so this time he chose one of the biggest Czech national heroes as the main character for his film. Unlike other auteurs, he chose the early period of Žižka's life because he wanted the audience to see how his character was formed. At the same time it allowed him to make the film different from his predecessors (for example a well-known 1955 film Jan Žižka by Otakar Vávra) which focused on his glorious Hussite period. Jákl admitted that although he tried to be faithful to the facts, cooperating with the Czech historian Jaroslav Čechura, he did not consider them as important as the overall impression, especially as many facts of Žižka's early life are not known at all or are a matter of dispute among historians. Thus also a love story was added.\nRelease\nThe film had its premiere on 5 September 2022 in Slovanský dům. It was attended by members of film cast and production such as Til Schweiger, Sophie Lowe and Petr Jákl. Michael Caine sent a video greeting. The film was released into cinemas on 8 September 2022.\nHome media and streaming\nThe film was released for digital and streaming release on 31 October 2022. On 9 November 2022 the film was released on Netflix.\nParamount Home Entertainment acquired the home video distribution rights to the film, set for release on Blu-ray around December 6, 2022.\nReception\nOn the review aggregator website Rotten Tomatoes, the film holds an approval rating of 38% based on 34 reviews, with average rating 5/10. The website's consensus reads, \"Some solid set pieces aren't enough to compensate for Medievals thin and often incomprehensible plot.\" Metacritic assigned the film a weighted average score of 46 out of 100, based on 13 critics, indicating \"mixed or average reviews\". The film has a score of 58% based on 12 reviews on Czech website Kinobox.cz.\nBox office\nThe film opened in the Czech Republic with 114,244 spectators during previews and 104,921 spectators during first weekend. It grossed 18,825,068 Kč as a result. It is the fourth best opening of the year.\nIn the United States the film grossed $821,991 from 1,311 cinemas, finishing 14th.\nVideo games\nDirector of the film Petr Jákl mentioned on 21 April 2022 that the film will be accompanied by two video game adaptations. One would be released for PC and video game consoles while the other one for mobile phones. Medieval is an action-adventure game in development by Cypronia while mobile game Medieval AR is in development by More.is.More.\nSee also\n* Jan Žižka (1955 film)\n* List of most expensive Czech films\nReferences\nExternal links\n*\n*\n*\n*\n* Richard Utz, \"Medieval: The Movie, The Brand.\" [https://www.medievalists.net/2022/09/medieval-movie-brand/ medievalists.net], September 7, 2022."
    }
  ]
}