{
  "content": [
    {
      "type": "text",
      "text": "# Medieval literacy of Bosnia and Herzegovina\n\n]]\nMedieval literary heritage of Bosnia and Herzegovina, as part of a Bosnia and Herzegovina literature, is based on local language traditions and literacy and can be assessed starting with the High Middle Ages. The oldest preserved Bosnian inscriptions is considered to be the Humac tablet (), inscribed into stone tablet between the 10th and 12th century, which means that probably predates Charter of Ban Kulin written on 29 August 1189.\nGoing back to medieval period in history of Bosnia and Herzegovina, literature was predominantly ecclesiastical, with literacy revolving around the Bosnian Church production, and other religious, diplomatic and trade texts, based on an old form of Shtokavian dialect,  Ijekavian dialect, Old Slavic, and usage of Bosnian Cyrillic and in lesser extent Glagolitic scripts. One specific peculiarity of this period in Bosnia and Herzegovina history are written monuments in form of stećaks.\nBackground\nSuch medieval writings, found in Bosnia and Herzegovina, produced during medieval period in Bosnian history, which included parts of Dalmatia and Old Herzegovina, revolve around liturgical literature production, such as Divoševo jevanđelje (), Grškovićev odlomak Apostola (), the Hrvoje's Missal, ''Hval's Codex (Hvalov zbornik, or Hvalov rukopis / Хвалов рукопис; ), Mletačka apokalipsa (), Čajniče Gospel (Čajničko jevanđelje), belong to the Bosnian literature, and are considered the written heritage, but not a literature in a strict modern sense of the word.\nThe manuscripts belonging to the Bosnian Church, are important part of the literary production during this period. Some of these manuscripts have some iconographic elements which are not in concordance with the supposed theological doctrine of the Christians, like the Annunciation, the Crucifixion and the Ascension. All of the important Bosnian Church books, such as Nikoljsko jevanđelje (), Srećkovićevo jevanđelje (), Hvalov zbornik (), Radosavljeva bosanska knjiga (or Rukopis krstjanina Radosava, or Zbornik krstjanina Radosava''; ), are based on Glagolitic Church books.\nBody of work\nFile:Humacka ploca.jpg|Humac tablet\nFile:Povelja Kulina bana.jpg|Ban Kulin's Charter, kept in Russia\nFile:Hrvoje's missal 1.jpg|Hrvoje's Missal, kept in Topkapı Palace Manuscript Library\nFile:Hvalov_zbornik1.jpg|A miniature from the Hval Manuscript, kept in the Bologna's University Library\nFile:Batalovof2.jpg|List of Bosnian Church Djed from Batalo's Gospel, kept National Library of Russia\nFile:Divoševo Jevanđelje.png|Divoš's Gospel\nFile:Kočerinska ploča.jpg|Kočerin tablet\nInscriptions\nThe Humac tablet is an Old Slavic epigraph in the form of a stone tablet, written in Bosnian Cyrillic script, and carved into a stone slab, very similar to stele. It is thought to have originated between the 10th and 12th centuries, making it the oldest surviving Bosnian text, older even than Charter of Ban Kulin. It is the oldest Cyrillic epigraph found in Bosnia and Herzegovina, and it was found in the village of Humac in Bosnia and Herzegovina.\nThe tablet was never precisely dated, but some attempts included Yugoslav and Bosnian epigrapher and medievalist, Marko Vego, who dated it to the end of the 10th or the beginning of the 11th century. The same dating suggested linguist Jovan Deretić, while historian Dimitrije Bogdanović dated it to the beginning of the 12th century.\nThe text of the tablet tells the story about the act of building a church by Krsmir (also rendered Uskrsimir or Krešimir) and his wife Pavica, which was dedicated to the Archangel Michael. The tablet is quadrangle in shape, 68x60x15 centimeters, and the inscription is carved in form of a quadrangle in Bosnian Cyrillic script among which five Glagolitic letters can be identified, four E-like letters resembling letter Ⰵ and a Ⱅ letter alongside a conventional Cyrillic Т.\nIt was first noted by a French diplomat at the Bosnia Vilayet. Today, tablet is kept at the local museum of the Humac Franciscan friary in the same village where it was found, namely Humac near Ljubuški.\nGrd of Trebinje Tablet from Trebinje is another inscribed stone tablet. It was cut around 1180 as a gravestone tablet for a župan Grd, during the rule of Prince Mihailo III of Duklja. The tablet is kept in the church in Police near Trebinje.\nPloča Kulina bana (), from around 1185, is the inscription on the church built by Ban Kulin. It was found near Visoko, and it is kept today in the National Museum of Bosnia and Herzegovina.\nThe inscription of Mastan Bubanjić is found in the rock in Donja Drežnica, in the locality called Toplo, is dated between 1356 and 1366. It was declared a National Monument of Bosnia and Herzegovina by KONS. The national monument forms a cultural landscape with an inscription in the rock. The inscription is carved in Bosnian Cyrillic on an almost vertical surface of the rock, raised about 2 m from the ground, and it occupies an area of 110 x 75&nbsp;cm.\nKočerinska ploča (or Natpis Vignja Miloševića; ), is a medieval stone tablet with an inscription cut in 1404 or 1405. The stone tablet was then placed on the stećak tombstone of Viganj Milošević. Inscription is in Bosnian Cyrillic, in an archaic West Stokavian dialect of Serbo-Croatian, using ikavian subdialect. It was discovered in 1983 in the Lipovac Necropolis, in village Kočerin, near Široki Brijeg, Bosnia and Herzegovina, where it is now exhibited in the parochial premises.\nThe tablet contains 25 rows of text, with 9-15 characters on each line. There are 300 characters in total and represents the largest known text in Bosnian Cyrillic, and displays a large number of ligatures. It is written in a Shtokavian Ikavian dialect, without nasal vowels, in a single-yer script, with some apparent Glagolitic influence. The form svetago shows influence from Church Slavonic, but the rest of the inscription is free of Church Slavonicisms in its morphology.\nThe text says how Viganj Milošević served five Bosnian rulers, Ban Stjepan, Ban then King Tvrtko I, King Dabiša, Queen Gruba, and King Ostoja, and ends with a message:\n.\nStećak inscriptions\nEarliest stećak inscriptions could be traced back to 12th century medieval Bosnia.\nDocuments\nThe Charter of Ban Kulin () is the earliest found diplomatic document written in the old Bosnian language and represents the oldest found work written in the Bosnian Cyrillic script (Bosančica). It is one of the oldest written state documents in the region. It was written on 29 August 1189 as a trade agreement between the Banate of Bosnia and the Republic of Ragusa. According to the charter, Bosnian Ban Kulin pledges to a knez named Krvaš and to all of the people of Ragusa (Dubrovnik) full freedom of movement and trading across his country. The charter is written in two languages: Latin and an old form of Shtokavian dialect, with the Shtokavian part being a loose translation of the Latin original. The scribe was named as Radoje, and the script is Bosnian Cyrillic (Bosančica).\nAs such, it is of particular interest to both linguists and historians. Apart from the trinitarian invocation (U ime oca i sina i svetago duha), which characterizes all charters of the period, the language of the charter is completely free of Church Slavonic influence. The language of the charter reflects several important phonological changes that have occurred in Bosnian until the 12th century:\nThe Saint Petersburg copy is in the literature usually called \"the original\" (or copy A), and copies stored in the Dubrovnik Archive as \"younger copy\" (or copy B) and \"older copy\" (or copy C). At first it was thought that the Saint Petersburg copy, which was the first one to be published and studied, was the original and others were much younger copies (for example, Milan Rešetar dated the copies B and C into the latter half of the 13th century) but that was called into question by later analyses. According to a study by Josip Vrana, evidence that copy A represents the original remains inconclusive at best, and according to a comparative analysis that copy represents only a conceptual draft of the charter according to which the real original was written. Copies B and C are independent copies of the real original, which was different from the copy A.\nPalaeographic analysis indicates that all three copies of the charter were written in approximately the same period at the turn of the 12th century, and that their scribes originate from the same milieu, representing the same scribal tradition. Their handwriting on the one hand relates to the contemporary Cyrillic monuments, and on the other hand it reflects an influence of the Western, Latin culture. Such cultural and literary opportunities have existed in the area which encompassed the Dubrovnik region at the period. Copy A probably, and copies B and C with certainty, originate from the scribe who lived and was educated in Dubrovnik and its surroundings.\nLinguistic analysis however does not point to any specific characteristics of the Dubrovnikan speech, but it does show that the language of the charter has common traits with Ragusan documents from the first half of the 13th century, or those in which Ragusan scribal offices participated. Given that Ragusan delegates participated in the drafting of their copy, everything points that a scribe from Dubrovnik area must have participated in the formulation of the text of the copy A. However, that the final text was written at the court of Ban Kulin is proved by how the date was written: using odь rožьstva xristova, and not the typical first-half-of-the-13th-century Dubrovnikan lěto uplьšteniě.\nBatalovo jevanđelje () is dated to 1393. The gospel was written by the scribe (in medieval Bosnia called dijak) Stanko Kromirijanin. The tepčija Batalo Šantić was the scribe's patron. Four pages of the gospel are preserved, and are held in National Library of Russia in Saint Petersburg. On the third preserved page the scribe Stanko states that he was writing an ornate gospel for Batalo, dating its completion to 1393, during the reign of Dabiša. On page two, there is a list of djed of the Bosnian Church. Researchers call this list „Red gospodina Rastudija“ (Order of Bishop Rastudije), and is understood as a list of names of all Bosnian Church bishops before and after him.\nLiturgical books\nHrvojev misal () is liturgical book, written in Split by the resident calligrapher and glagolitic scribe Butko in 1404 for Hrvoje Vukčić Hrvatinić sometime around 1403-1404. Missal found its way to Istanbul and is currently kept at the Topkapı Palace Museum Manuscript Library. The knowledge of its existence was lost, until it was mentioned by linguists Vatroslav Jagic, L. Thallóczy and F. Wickhoff in the 19th Century. The book's location in the Topkapi Palace was determined by the art historian Mara Harisijadis in 1963. Once bound in precious covers, from 19th century Hrvoje's Missal is in leather binding, is considered as one of the most beautiful Glagolitic books. It contains 247 folios, which includes 96 miniatures and 380 initials and many more small initials. Some details are made of golden leaves. It is written in two columns on 488 pp (22.5x31 cm), and contains also some music notation. Some initials contain architectural elements of the Dalmatian city of Split. The peculiarity and particular value of the Hrvoje's Missal lies in its combination of eastern and western principles in terms of composition and contents, thus making it a truly invaluable work with a place in the regional and transregional history of art.\nČajniče Gospel is the oldest gospel written in medieval Bosnia at the end or the beginning of the 15th century, which probably belonged to the Bosnian noble family, the Pavlovićs, and is the only medieval Bosnian gospel that has been preserved in country to this day. Analyzing the language characteristics and its Ijekavian dialect, it is certain that it originate from ijekavijan eastern Bosnia. The codex was written in shorthand, with a semi-constitution of the Bosnian type, also known as Bosnian Cyrillic. It is estimated that five main scribes took turns, continuously writing the text. The Čajniče Gospel is a four-gospel, and only parts of the Gospel of Matthew, the Gospel of Mark, and most of the Gospel of Luke have been preserved, while the Gospel of John, the beginning and end of the manuscript, and a certain number of pages in the middle, are lost, so that in present condition the manuscript has 167 pages. The codex is declared a National monument of Bosnia and Herzegovina by KONS. The museum of the Church of the Assumption of the Blessed Mother of God, of the Čajniče Monastery, in Čajniče, Bosnia and Herzegovina, keeps the book\n''Divoš's Gospel ()\nThree Bosnian apocalypses\nHvalov zbornik (Hvalov zbornik, or Hvalov rukopis / Хвалов рукопис; ) is a Bosnian Cyrillic manuscript of 353 pages, written in Split in 1404,, for Duke Hrvoje Vukčić Hrvatinić. It was illuminated by Gothic artists from the Dalmatian littoral.\nIt was written by krstjanin Hval in Bosnian Cyrillic in the Ikavian accent, with a Glagolitic alphabet introduction, and is decorated with miniatures and other artistic elements. The codex contains parts of the Bible, hymns and short theological texts, and it was copied from an original Glagolitic text, also evident from Glagolitic letters found in two places in the book. The codex is one of the most famous manuscripts belonging to the Bosnian Church, in which there are some iconographic elements which are not in concordance with the supposed theological doctrine of Christians (Annunciation, Crucifixion and Ascension). New analyses of style and painting techniques show that they were inscribed by at least two miniaturists. One painter was painting on the blue background, and the other was painting on the gold background in which the miniatures are situated in a rich architectonic frame. The codex is kept in the University Library in Bologna, Italy.\nRadosavljeva bosanska knjiga (or Rukopis krstjanina Radosava, or Zbornik krstjanina Radosava''; ) is the youngest, different in content and scarce in relation to the other two anthologies of medieval Bosnian literature - the Hval's from 1404 and the Venetian's from the beginning of the 15th. It consists of 60 sheets of paper, size 14, 3x11 cm. It was named after the scribe Radosav the Christian, who wrote it for Gojsav the Christian, during the reign of the Bosnian king Tomaš (1443-1461). The main content is the Apocalypse of John the Apostle. It's written in Bosnian Cyrillic, with the Glagolitic alphabet used in two places. It is decorated with two flags and a series of decorative initials. It is kept in the Vatican Library.\nMletačka Apokalipsa () was written at the end of the 14th or the beginning of the 15th century. The exact dating has never been determined because interruptions and gaps the manuscript, with a missing the colophon, which probably existed, which means that both the writer or the patron remain unknown. Approximate dating is based on palaeographic and linguistic analysis of the manuscript. It very closely resembles to Hval's Codex in terms of language, but even more so in terms of individual chapters and their layout. The manuscript was first mentioned in 1719, and in 1794 it was already studied by Josef Dobrowsky, who described its contents. The manuscript is written more beautifully and legibly than Hval's, and the letters are slightly larger. It is kept in Venice in the Library of St. Mark.\nSecular literature\nAlexnder romance\nIt is believed that the beginnings of the novel originated in medieval Greece, but it took its more or less definitive form in medieval Serbia, from where it spread east and west, and thus became a common South Slavic novel.\nElsewhere, medieval literature is relatively rich in works of various genres of secular literature, while the Bosnian Middle Ages, at least based on the preserved works, cannot be said to have developed this type of literary creation. Whether there were at least some works of secular literature that were lost or destroyed is impossible to answer with complete certainty, so it is only possible to conclude that there are no remains of books of this type from the time before the last decades of the 15th century, i.e. from the time when the Bosnian state was still functioning. The only exception in this regard is the so-called Berlinska Aleksandrida (Alexander of Berlin), which, based on more or less exact data, can be determined to have been written in Bosnia, but probably after the collapse of the Bosnian state, i.e. after 1463. However, there are many reasons to believe that this codex could have had an earlier template, which could have been written on Bosnian soil during the medieval Bosnian state.\nThe manuscript of the Alexander of Berlin, was published by Ch. A. van den Berk in Munich in 1970. together with the Utrecht Alexandride (which was printed in the edition in parallel with the Berlin one), and in more or less original spelling and orthography. Van den Berk copied the original very faithfully, even to a large extent the form of the letters line by line, without changing anything in the text, without correcting or completing, so that it is possible to carry out all relevant analyses of the text on the basis of the edition. Van den Berk also provided detailed information about the Berlin Alexandride (pp.&nbsp;33–40) with a facsimile of two pages, but significantly reduced.\nThe text that served as a template came from Ijekavian and was copied in the štokavian Ikavian environment. The codex is written on paper, and the leaves are arranged in booklets of five folded leaves each, in eighths, and watermarks are visible on the leaves of the codex, which date it to the last decades of the 15th century. The text is written in a single column, like the vast majority of Bosnian codices, with 15 lines per page. The codex has not been preserved in its entirety, approximately 35 pages are missing at the beginning, some leaves are missing in the middle, or left blank, and the end is also missing.\nOf great importance for the history of this book are the later notes on the blank pages, for example on one place there is a text written in a cryptic script, which Van den Berk assumes could be a cryptic script of the South Slavic type, although he does not provide further explanations, except that based on the number 1535, which could indicate the year this note was written, Van den Berk concludes that this could mean that in 1535 the manuscript was still in the possession of a Bosnian family.\nSee also\n*List of archives in Bosnia and Herzegovina\n*Gazi Husrev-beg Library\n*Vijećnica\n*Oriental Institute in Sarajevo\n*National and University Library of the Republika Srpska\n*National and University Library of Bosnia and Herzegovina\n*List of Glagolitic books\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*Fejzić, Fahira. \"Povelja Kulina bana–međunarodna zakletva, diplomatsko-trgovinski ugovor i svjedok vremena.\" Godišnjak Bošnjačke zajednice kulture» Preporod « 1 (2009): 143-148.\n*Sivrić, Ivan. \"Povelja Kulina bana Dubrovniku.\" Suvremena pitanja 6 (2008): 174-177.\n*Jalimam, Salih. \"O latinskom tekstu u Povelji bana Kulina.\" Istrazivanja: Casopis Fakulteta Humanistickih Nauka 11 (2016).\n*Peco, Asim. \"Povelja Kulina bana u svjetlosti štokavskih govora XII i XIII vijeka–u.\" Osamsto godina Povelje bosanskog bana Kulina, 1189-1989 (1989).\n*Vukomanović, S. \"Leksika i gramatička značenja u Povelji Kulina bana, u: Osamsto godina Povelje bosanskog bana Kulina 1189–1989.\" Posebna izdanja ANUBiH, knj 23 (1989): 77-97.\n*Karavdić, Zenaida. \"O Povelji Kulina bana–“Bez’v’sega z’loga primysla”.\"\nExternal links"
    }
  ]
}