{
  "content": [
    {
      "type": "text",
      "text": "# Media coverage of the 2016 United States presidential election\n\nMedia coverage of the 2016 United States presidential election was a source of controversy during and after the election, with various candidates, campaigns and supporters alleging bias against candidates and causes.\nStudies have shown that all 2016 candidates received vastly less media coverage than Donald Trump. Trump received more extensive media coverage than Ted Cruz, John Kasich, Hillary Clinton, and Bernie Sanders combined during a time when those were the only primary candidates left in the race. The Democratic primary received substantially less coverage than the Republican primary. Sanders received the most positive coverage of any candidate overall, whereas his opponent in the Democratic primary, Hillary Clinton, received the most negative coverage. Among the general election candidates, Trump received inordinate amounts of coverage on his policies and issues, as well as on his personal character and life, whereas Hillary Clinton's emails controversy was a dominant feature of her coverage, earning more media coverage than all of her policy positions combined.\nDonald Trump\nDonald Trump benefited from free media more than any other candidate, and the coverage was according to a study reviewing three sources of data, \"not particularly negative, either overall or relative to other candidates.\" From the beginning of his campaign through February 2016, Trump received almost $2 billion in free media attention, twice the amount that Clinton received. According to data from the Tyndall Report, which tracks nightly news content, through February 2016, Trump alone accounted for more than a quarter of all 2016 election coverage on the evening newscasts of NBC, CBS and ABC, more than all the Democratic campaigns combined. Observers noted Trump's ability to garner constant mainstream media coverage \"almost at will\". However, Trump frequently criticized the media for writing what he alleged to be false stories about him and he has called upon his supporters to be \"the silent majority\". Trump also said the media \"put false meaning into the words I say\", and says he does not mind being criticized by the media as long as they are honest about it. During and after his presidential campaign and election, he popularized the term \"fake news\", which he frequently accused mainstream media outlets of.\nA 2018 study found that media coverage of Trump led to increased public support for him during the primaries. The study showed that Trump received nearly $2 billion in free media, more than double any other candidate. Political scientist John M. Sides argued that Trump's polling surge was \"almost certainly\" due to frequent media coverage of his campaign. Sides concluded \"Trump is surging in the polls because the news media has consistently focused on him since he announced his candidacy on June 16\". Prior to clinching the Republican nomination, Trump received little support from establishment Republicans.\nIn the early stages of the election, The New York Observer reported that Wikipedia's article on Trump was the busiest of the 2016 U.S. presidential candidates. The New York Times noted that the article usually attracted more views than his Republican rivals. In September 2016, Business Insider reported that the article subject was one of the 29 most controversial people on Wikipedia, and the following month The New York Observer reported that the article entry was bulkier than either the articles on George W. Bush and Barack Obama, while The Washington Post reported that the article had more than three times the number of edits compared to Hillary Clinton since January 2015.\nHillary Clinton\nIn her 2017 memoir What Happened, Clinton argued that the media was one of several contributing factors to her loss.\nAnalyses by Columbia Journalism Review, the Berkman Klein Center for Internet and Society at Harvard University, and the Shorenstein Center at the Harvard Kennedy School show that the Clinton email controversy received more coverage in mainstream media outlets than any other topic during the 2016 presidential election. The New York Times' coverage of the email controversy was notoriously extensive; according to a Columbia Journalism Review analysis, \"in just six days, The New York Times ''ran as many cover stories about Hillary Clinton's emails as they did about all policy issues combined in the 69 days leading up to the election (and that does not include the three additional articles on October 18, and November 6 and 7, or the two articles on the emails taken from John Podesta).\" In attempting to explain the lopsided coverage, the Columbia Journalism Review'' speculates, \"In retrospect, it seems clear that the press in general made the mistake of assuming a Clinton victory was inevitable, and were setting themselves as credible critics of the next administration.\"\nMedia commentators drew comparisons of Clinton's email usage to past political controversies. Pacific Standard magazine published an article in May 2015, comparing the email controversy and her response to it with the Whitewater investigation 20 years earlier.\nHillary Clinton also received significant negative attention over the 'basket of deplorables' incident where Hillary labelled half of Trump's supporters as deplorable. Furthermore, her past scandals such as Benghazi and the persistent email scandal led to Hillary being dogged throughout the campaign with 'Crooked Hillary'.\nAmong the DNC material published by WikiLeaks in 2016 were emails showing that CNN contributor Donna Brazile shared questions with the Clinton campaign prior to debates during the DNC primaries. Brazile resigned from CNN in October 2016 due to the revelations.\nGender bias in media\nThe issue of gender played a major role in the outcome of the 2016 presidential election. Hillary Clinton became subject to enormous media interest specifically regarding her gender and it affected her campaign and electability in a negative way. The women's card is a term that was used significantly in the 2016 presidential election by the media. It started when the Republican presidential candidate Donald Trump accused Hillary Clinton of “playing the women's card” and stated that \"if Hillary Clinton were a man, she wouldn’t get 5 percent of the vote.\"\nTrump's statement was interpreted by the media as saying Clinton somehow has an unfair advantage because she was a woman. In the 2016 election, Clinton leaned into her gender as an asset and highlighted that her being in office would break the glass ceiling for future female candidates. The media accused Clinton of attempting to appeal to voters by invoking her gender to distinguish herself. There was a study conducted that looked into the characteristics of the ideal president. The study found that the characteristics associated with the role tend to be more masculine rather than feminine traits. The candidate had to display masculine traits to be in such a leadership position and they also had to fit into their own gender role to be liked. Politics is still a heavily gendered arena, dominated by male political actors and masculine behaviours. From the first time she announced her intentions to run for president, Clinton highlighted her commitment to inclusion and nurturing values, which are more typically feminine characteristics. As often stated in analysis of this topic, “women are taken most seriously when they put themselves into traditionally masculine roles such as politics but only on behalf of traditionally feminine values.” This was a constant barrier that Clinton faced throughout her campaign, as the media and her opponents criticized her for not portraying enough feminine characteristics. In the case of Trump, he embraced his masculine characteristics and was praised for them because it was congruent with presidential characteristics.  According to this study, the ideal feminine characteristics for women and the masculine characteristics of a president are incompatible. Clinton leaned more into the masculine characters and did not represent her femininity to the same degree that Trump embraced masculinity. Research suggests that women have to be just enough masculine to be strong leaders but also feminine enough to be liked. A majority of her masculine traits were showcased by the media in a negative light.\nClinton was frequently portrayed as a candidate with a corrupt political history who has engaged in corrupt behaviour to further her own goals.  A majority of the news followed her personal life and tended to focus on her appearance as well. One journalist even called on her to smile more and then went on to criticize the shape of her mouth. Both Trump and Clinton had scandals that emerged during the election that questioned their candidacy.  The general public holds women to a higher moral standard than men and perceives them to be more honest and trustworthy. When covering women in politics, journalists frequently use terminology that emphasizes women's traditional roles and physical appearance. They contribute to the stereotype of female politicians as indecisive, emotional, and weak. Women politicians are even held accountable for the actions of their children or husbands, whereas men politicians are rarely held to the same standard. When they are in the wrong, they are also more likely to face harsher punishment from the public. For example, when it came to light that Trump had made derogatory comments about women, many people dismissed it as \"locker room talk\", arguing that it was not a big deal, something that would have played out differently had the genders been reversed. A majority of the news that surrounded Clinton was negative and had little to do with her policies. Only around  4 percent of Clinton-related stories during the summer of 2016 encompassed policy. The bad news outpaced her good news, usually by a wide margin, contributing to the increase in her unfavorable poll ratings. Research suggests that female candidates tend to get more negative coverage and very little coverage of their qualities than their male counterparts qualifications.  Hillary Clinton possessed the skills and experience usually suited for a presidential candidate than her opposition, however, she was scrutinized for it rather than preached due to her gender.\nMarco Rubio\nDuring the Republican primary, Marco Rubio criticized the media for giving his Republican primary opponent, Donald Trump, disproportionate coverage. He criticized the media's tendency for horserace coverage, rather than focusing on substance. He also blamed the media for negative coverage of his campaign. He said there was \"kind of a weird bias here in the media rooting for Donald Trump because they know he's the easiest Republican to beat.\"\nTed Cruz\nTed Cruz criticized the disproportionate coverage of Trump during the Republican primary. Cruz suggested that the media was deliberately boosting Trump's candidacy, and that they were holding back damaging stories about him until he won the nomination. After the conspiracy tabloid the National Enquirer ran a story alleging without evidence that Cruz might be having extramarital affairs, he said that Trump and his \"henchmen\" had planted the story.\nBernie Sanders\nBernie Sanders, the Sanders campaign, supporters and alternative media sources have argued that the media was biased against Bernie Sanders, saying he did not receive adequate media coverage, that mainstream media outlets covered him in a negative light, and that there was insufficient focus on policy in media coverage. Data shows that Sanders received two-thirds of Clinton's media coverage during the Democratic primary as a whole, and that he received the most positive coverage of any candidate.\nReferences"
    }
  ]
}