{
  "content": [
    {
      "type": "text",
      "text": "# Medieval Engineers\n\nMedieval Engineers is a voxel-based sandbox computer game set on an unnamed Earth-like planetoid without water that can be explored, mined, manipulated, and deformed. It was developed and published by Czech developer Keen Software House. On February 19, 2015, Medieval Engineers was released as an early access game on the Steam platform, and the full version was released on March 17, 2020.\nGameplay\nThe player controls a single character, the engineer, and builds structures, from small shacks to entire castles and even towns, using pre-defined building blocks. Blocks may be structural, functional, interactive, or aesthetic, and are grouped into two basic types: large and small. Large blocks such as walls, roofing and palisades determine structural integrity and may collapse under their own weight if not built carefully or if damaged in an attack. Small blocks such as timber, wheels for carts and siege equipment, furniture and crafting workstations serve aesthetic, interactive, and/or functional roles.\nThe small block items, and particularly the torsion bar, rope drum, axle (called a catch block), hand crank, projectiles, and rope ends are key features of Medieval Engineers, as they enable siege warfare. The player may combine these along with other small-block items to create battering rams, catapults, trebuchets, and siege towers, which use realistic physics based on mass, density, tension, and inertia. In a multi-player world, individual players may each claim territory, or share claimed territory, create \"houses,\" build castles and defenses, then create siege engines to attack other player's or house's castles. As a sandbox game, win conditions are not defined but can be arranged separately by the players involved.\nPlayers can also use hand-tools to construct large blocks, fell and process trees, and reshape the landscape, leveling for building purposes or digging to mine resources and form defensive trenches and mounds. Weapons such as a club, studded club, and sword can defend from hostile NPCs (barbarians) as well as other human players, and attack structures directly. Crossbows may be used to assault enemies or hunt deer (for food and hides) from a distance.\nTerrain and landscape\nThe Medieval Engineers landscape is a spheroid voxel-based planet, approximately 10 game-kilometers in radius, which is fully explorable by the player. It contains high mountain ranges with limited passable areas, deep rocky valleys, varied woodlands, grasslands and fields, desert, and a network of dirt roads, which a player may use to navigate or fast travel if they choose. Resources that can be collected vary depending on the nature of the terrain. Wild wheat, cabbages, and flax may be found in fields, for example, whereas mushrooms and berries exist only in wooded areas. Many aspects of the world are adjustable at the start of the game, including the day-night cycle, number of possible non-player characters (NPCs include deer and hostile barbarian attackers) and the length of time that damaged or loose objects remain in the world.\nGame modes\nIn survival mode, players are vulnerable and maintain three personal stats: Stamina, Health, and Food. Stamina determines a player's ability to sprint. It is expended through the use of some tools and weapons, and recovered by resting. Health drops when a player is attacked or injured, often by falling. At zero health, they die and respawn, either randomly or at their bed if they have one, with no inventory. Their former inventory is left in a \"loot bag\" by their body and can be reclaimed within a limited time. Health restores slowly, which may be sped by applying a craftable bandage. At zero food, a player is weakened easily with reduced mobility.\nFood such as berries, roots, mushrooms, and others may be collected in the wild and made more nourishing using a crafted campfire or oven and various recipes. The game supports farming of basic seeded plants to harvest additional ingredients which may be combined again for greater player-character benefit. Some benefits (called vigor) include boosts to stamina and health, such as from consuming tea or sweetbread.\nPlayers will occasionally encounter barbarians who attempt to kill their character and/or destroy their structures and vehicles with melee combat. Barbarians may be heard by the player as they approach or seen from a distance by their torches at night.\nA player begins knowing how to create only a very small variety of items. New items can be unlocked through the research of new skills, which generally involves collecting a certain amount of various items. Creating items in survival mode also requires various component resources, such as timbers for wooden walls, crushed or small stones for stone walls, or flax straws to create thread (which is then used to create bandages, rope, or decorative banners). The collection, transport, and maintenance of resources is a key aspect of survival mode.\nIn creative mode, players are invulnerable and are able to spawn unlimited resources, instantly build tools and blocks, and fly. Players can manipulate the planet surface and interior in a nearly unlimited manner with a tool known as \"Voxel Hands.\"\nA Research Table can be used to define and use blueprints which in turn can be used to construct designed structures or vehicles.  These designs can be exchanged on the Steam Workshop.\nDevelopment\nMedieval Engineers was developed and published by the indie video game developer Keen Software House based in the Czech Republic. It is a sandbox game built on Keen's own voxel-based game engine, VRAGE 2. The volumetric approach is what allows for realistic physical behavior.\nThe game is a follow-up to Keen's Software House's earlier Space Engineers, which is also a sandbox game based on the VRAGE 2 engine. The core difference in gameplay is that Space Engineers is set in a zero-gravity environment, whereas Medieval Engineers, taking place on an earth-like planet, uses gravity extensively.  Space Engineers continued development in tandem with Medieval Engineers which offered technological feasibility and evaluation of capability to aid in the development of Space Engineers, for example compound blocks, spheroidal landscape, mechanical blocks, \"Voxel hands,\" structural integrity, and procedural terrain generation.  Medieval Engineers also benefited from some advancements introduced into Space Engineers, such as multi-player, physics, Steam Workshop integration, and a modding SDK.\nMedieval Engineers enjoyed active development under the guidance of Tim \"Deepflame\" Toxopeus, with weekly updates including an updated video posted to YouTube generally on Tuesdays. This active effort continued until February 2019. After the official release of Space Engineers and the Medieval Engineers release of 0.7.1 both occurring in February 2019, the Medieval Engineers development team was folded into the Space Engineers team with no future planned updates. However, the game received a small update bringing it to 0.7.2 upon its official release out of Early Access in March 2020.\nPost release\nAfter negotiations, Keen Software House agreed to share ongoing maintenance exclusively with two prominent developers in the Medieval Engineers modding community, Equinox and Gwindalmir. On April 7, 2022, the Community Edition was released as 0.7.3, an alternate, \"opt-in\" branch release from the final official release, created from 0.7.2 and aggregating many bug fixes. The Community Edition continues to see ongoing maintenance with its own [https://communityedition.medievalengineers.com/ website], Discord channel, and future [https://communityedition.medievalengineers.com/mantis/my_view_page.php planning/bug tracker] site for the community to monitor and engage in progress. The Community Edition also benefits from occasional support from one or more Keen Software House developer(s), and has been well received by the community as being superior to the final official release.\nVersions\nVersion 0.1, released on February 19, 2015, introduced the creative-only version of the game, which was limited to a surface landmass of, at most, 2 game-kilometers squared.\nVersion 0.2, released periodically throughout May and June 2015, introduced survival construction mode, including the need to gather resources and to maintain the player's various stats.\nVersion 0.3, released on October 18, 2016, introduced the full planet-sized version of the game (10&nbsp;km radius), with a full multi-layer map and a fast-travel system.\nVersion 0.4, released on December 13, 2016, introduced farming (using both a hand tool and mechanical blocks), with the ability to plant items such as wheat, herbs, flax, cabbage, and pumpkins, and later harvest the ripened products.\nVersion 0.5, released on May 9, 2017, introduced the use of the shovel and thus the ability to deform and reform voxel terrain in survival mode.\nVersion 0.6, released on November 21, 2017, introduced a new (replacement) Earth-like planet with new biomes, new resources, tools and mechanical blocks, and research quests.\nVersion 0.7.1 released on February 14, 2019, delivered a major overhaul of audio, visual, and block smoothing. The world gained regional chunking to reduce active memory usage, new trees and existing trees updated, block visuals gained parallax shading, added blueprints akin to Space Engineers with a Medieval Engineers style, and many improvements to the UI and quality-of-life features.\nVersion 0.7.2 released on March 17, 2020, and met the community with a few bug fixes to resolve some crashes as well as a fix for disappearing grids. This release coincided with the announcement of the official and final release of the game, leaving Early Access.\nCE Version 0.7.3 hit the community on April 7, 2022, with 75 improvements and the simultaneous announcement of the concept of the Community Edition. The vast majority of the improvements were bug fixes. A follow-up patch was released on July 13 the same year with an additional 39 improvements.\nCultural references\nThe game was featured in the family comedy film War with Grandpa  and was used as an instrument of attack in a \"friendly\" competition between two family members. In the film, the game received more exposure than just a simple background stage prop.\nAwards\nMedieval Engineers won the Czech Game of the Year Technical Contribution Award in 2014.\nControversies\nMedieval Engineers release from Early Access and abandonment\nIn a blog post on March 17, 2020, Keen Software House's CEO announced the company had been restructured consolidating all their developers to focus exclusively on Space Engineers, Medieval Engineers had reached end of life, and the game would leave Early Access. Along with the official release from Early Access, Medieval Engineers would be updated to 0.7.2 incorporating a few bug fixes and stability improvements. This caused an uproar in the Medieval Engineers community, evoking players to review bomb the game on Steam. The game has never seen a worse month than March 2020, with 85 percent of the reviews being negative, only to see a slight improvement in April (76 percent negative reviews). As of January 15, 2021, 43 percent of Steam reviews are negative.\nReferences\nExternal links\n*"
    }
  ]
}