{
  "content": [
    {
      "type": "text",
      "text": "# Medusa (Six Flags Discovery Kingdom)\n\n|ridersperrow=4|carspertrain=8|rowspercar=1|trains=3}}\nMedusa is a steel roller coaster located at Six Flags Discovery Kingdom in Vallejo, California. Built by Bolliger & Mabillard, Medusa opened in 2000 as the first floorless roller coaster on the West Coast. The roller coaster features seven inversions, a -tall lift hill with a  drop, and the first sea serpent roll element ever built on a B&M roller coaster. The ride is the longest coaster in Northern California at  long and is notable as having one of the largest vertical loops in the world at . It also shares the height record in Northern California with another two rides in the same park, The Flash: Vertical Velocity, and Superman: Ultimate Flight at  high.\nHistory\nOn November 10, 1999, Six Flags Discovery Kingdom (then Six Flags Marine World) announced that Medusa would be added to the park. It would be a custom floorless coaster built by Bolliger & Mabillard. The ride officially opened on March 18, 2000. It was built over the park's original parking lot, directly in front of the park.\nRide experience\nAfter the floor drops and the front gate opens, the train is dispatched from the station into a large left-hand turnaround before ascending the  lift hill. At the top, the train traverses a pre-drop to alleviate tension to the chain, followed by the drop, which decends into a below-ground trench. The train then enters a  vertical loop, followed by a dive loop to the left, and a zero-g roll. Afterwards, the ride then enters a two-inversion sea serpent roll. After a mid-course brake run, the train descends into a left-hand drop under the brake run, followed by a corkscrews, after which the on-ride photo is taken. The train then travels through an inclined helix to the left before entering the second corkscrew, a right-hand helix, and an S-turn and into the final brake run before returning to the station.\nSee also\n* Medusa (Six Flags Great Adventure), a floorless roller coaster at Six Flags Great Adventure formerly known as Bizarro\nReferences"
    }
  ]
}