{
  "content": [
    {
      "type": "text",
      "text": "# Mega Man Battle Network__disambig_2\n\nis a tactical role-playing video game series created by Masahiro Yasuma and developed and published by Capcom as a spin-off of the Mega Man series. Released in 2001 for the Game Boy Advance, it takes place in an alternate continuity of Mega Man where computers and networking technology was the main focus on scientific advancement, rather than robotics. There are a total of six mainline games, alongside several spin-offs.\nCreated amidst the success of Nintendo's and Game Freak's Pokémon series, alongside the rise of collectable card games, Mega Man Battle Network has players control MegaMan.EXE, a NetNavi operated by Lan Hikari as they attempt to stop the schemes of a net-crime organization called WWW (called \"World Three\"), headed by the universe's interpretation of Dr. Wily. Players battle enemies on a 6x3 grid, selecting \"Battle Chips\" which allow for more powerful attacks.\nThe series has been met with positive reviews from critics, although later games, particularly 5 and 6, have been criticized for a perceived lack of innovation; the series was followed-up by a sequel series titled Mega Man Star Force, which is set 200 years after Battle Network and focuses on radio waves. A compilation of all six mainline entries, Mega Man Battle Network Legacy Collection, was released in April 2023 for PlayStation 4, Nintendo Switch and PC.\nPlot\nMega Man Battle Network is set in an ambiguous year in the 21st century (\"20XX AD\") in an alternate reality to the original Mega Man series. Within the world of Battle Network, the Net has become humanity's primary means of communication, commerce, and even crime. Users are able to \"jack in\" to the Net and other computerized devices, and explore their various aspects using Digital people called \"NetNavis (Network Navigators)\" as if they were physical locations. The Net and the inner workings of computers are displayed as a virtual world with which computer programs of all varieties, as personified in a humanoid form, can interact. Users often do so by accessing their NetNavis via a \"PET (PErsonal information Terminal)\" device.\nThe plot of Mega Man Battle Network follows one such pair, Lan Hikari and his NetNavi MegaMan.EXE. Lan is a 11-year-old fifth grader in the town of ACDC. His father, Dr. Yuichiro Hikari, is one of the world's top scientists and NetNavi researchers. Most of the series (barring spin-offs) involve Lan Hikari and MegaMan.EXE stopping an evil crime syndicate from taking over the world and the Net; \"WWW\" (said out loud as \"World Three\") in the first, third, and sixth games, Gospel in the second game, and Nebula in the fourth and fifth games.\nCharacters\nLan Hikari and MegaMan.EXE\n, is the main human protagonist of the series. He is a fifth-grade student who has a strong bond with his NetNavi, fellow protagonist . Lan is the son of Yuichiro Hikari and Haruka Hikari and the grandson of Tadashi Hikari. He is voiced by multiple people, including Alex Doduk and Brad Swaile, while MegaMan.EXE is voiced by Andrew Francis.\nLan is a carefree boy who seeks adventure and fun and can be rash at times, but is also quick to notice small details and think calmly during situations. He frequently NetBattles, and is known to be dense about things unrelated to the Net. Despite his seemingly carefree attitude, Lan is always quick to do the right thing. He is talented on inline skates and commonly decorates his room with soccer-related things.\nMayl Sakurai and Roll.EXE\n, known as Maylu Sakurai in the English anime and manga, Lan's classmate and close friend and the operator of . They are next-door neighbors and often seen as a couple, though Lan is clueless towards her affections. Mega Man Battle Network 6's post-credits scene reveals that Lan and Mayl eventually married and had a child they named \"Patch\" (\"Raito\"). Mayl, being the more mature and intelligent of the two, often beats some sense into Lan when he gets himself into trouble. In Mega Man Battle Network 5, it is revealed in a Visionburst 11 years in the past that Mayl's father is Netopian, making her at least half Netopian.\nShe is voiced by Brittney Wilson in the English anime and by Kaori Mizuhashi in the Japanese anime. Roll.EXE is voiced by Lenore Zann and Sharon Alexander in the English anime and by Masako Jō in the Japanese anime.\nDex Oyama and GutsMan.EXE\n, known as Dex Ogreon in the English anime and manga, is Lan's classmate and friend and the operator of , who is often portrayed as a bully with a soft spot. He has a younger brother named Chisao, who is seen infrequently in Battle Network, and a recurring character in the anime. In the anime, Dex later gives up NetBattling to focus on his new career as a curry chef.\nYai Ayanokoji and Glide.EXE\n. known as Yai Ayano in the English anime and manga, is Lan's classmate and friend and the operator of . She is younger than the other main characters, as she skipped grades due to her intelligence, and, in the anime, operates out of her father's company, AyanoTech (Gabcom). In the anime, and sometimes the games, she secretly adores Chaud after he helped guide her out of a stuck elevator.\nEugene Chaud and ProtoMan.EXE\n, known as Chaud Blaze in the English anime and manga, is the son of IPC's (BlazeQuest in English) president, and the operator and creator of ProtoMan.EXE. Aside from the introduction he gives in the first game, he is exclusively referred to by his surname, Chaud. His mother died when he was young, and he was forced into becoming the vice-president of his father's corporation, a position which contributed to his initial cold attitude towards Lan. Over time, he gains more respect for Lan and begins to open up to others, but maintains his serious outlook during battle. In the games, he is an Official NetBattler who meets Lan while investigating a water shortage that WWW caused. He is introduced as a ruthless operator who takes his job seriously and will delete any Navis who get in the way, and despite originally seeing Lan as a pest, they slowly became friends.\nWWW\nAn organization formed by the main antagonist of the game, Lord Wily, formed to take over the real world and cyberworld out of jealousy that Tadashi Hikari caused his robotics research to be pushed aside in favor of network technology. Initially trying to conquer the internet through the Life Virus (Dream Virus), Wily is forced to disband WWW's members and go into hiding after Lan and MegaMan.EXE foil his plans. Throughout the series, he recruits multiple human members to operate various NetNavis.\nBass.EXE\nBass, known as  in Japan, was intended to be the first fully autonomous NetNavi, completely independent of an operator. Bass was falsely blamed for causing problems in the original internet, and the SciLab Elite Corps nearly killed him. Dr. Cossack, his creator and the only human he trusted, was arrested before he could get Bass to safety, leading Bass to believe he had betrayed him and causing him to harbor hatred toward humanity.. In Battle Network 2, Sean Obihiro of Gospel attempts to make an army of Bass copies, eventually leading to the accidental creation of the Gospel Megavirus. In the game's ending, Bass is shown deleting a clone while swearing revenge upon humanity. Bass returns to fulfill this promise in Battle Network 3, where he assists Wily in using Alpha to destroy network society; however, he and Wily are later swallowed by Alpha. However, the remains of the Gospel Megavirus save him and fuse with him. He is later confronted by MegaMan in the secret area and defeated. It is revealed that he has amnesia, but MegaMan reminds him of his creator, Cossack, and he leaves in confusion. In Battle Network 4, Bass is found deep in the Undernet hibernating as a statue, and reawakens upon meeting Megaman. After being defeated, he retreats and vows to become stronger. In Battle Network 5, a post-game boss created through dark power takes on his likeness, but he can also be fought. When defeated, he leaves of his own volition; this trend continues until Battle Network 6. There, Bass is confronted in his gravestone in the Undernet and several times afterwards. The final confrontation with Bass is him at his most powerful, having absorbed the power of a Cybeast into his body. After being defeated, he drifts away into the net and is available as a random encounter in the Graveyard area.\nGameplay\nMega Man Battle Network is a real-time tactical RPG series. To progress through the games, the player must alternately navigate the outside world as Lan Hikari and the Net as MegaMan.EXE, each containing certain tasks that must be completed to allow advancement in the other. Controlling Lan, the player may travel around the world map, interact with non-player characters, check email, purchase items, initiate Net missions, or speak with MegaMan.EXE through his PET. In contrast with traditional Mega Man entries in which battle and movement through the levels happen in the same setting, Battle Network's combat occurs only through by battling computer viruses within the Net. This cyber world is represented by a series of branching pathways and nodes, where MegaMan.EXE can travel to both new and previously visited locations, find and purchase items, and fight viruses. Battles do not generally appear on the field screen of the Net but are usually set as random encounters.\nThe battlefield itself is made up of 18 tiles divided into two groups of nine, one group being space in which MegaMan.EXE may freely move and the other group being space inhabited by enemies. Akin to other Mega Man games, MegaMan.EXE possesses an arm cannon called the \"Mega Buster\". The player can transition among the nine provided tiles and fire the Mega Buster at enemies from across the screen. The objective of each battle is to delete all the viruses by reducing their hit points (HP) to zero. If MegaMan.EXE's own health depletes, a game over occurs. In order to attack without the Mega Buster, the player must utilize Battle Chips, which are placed into a \"folder\" before the battle starts, and are drawn at random. Starting with the third game, Battle Chips are organized into three primary categories which limits how many of the same chip can be used in the same folder: Standard (4 of the same, 30 in the folder), Mega (1 of the same, 5 in the folder), and Giga (only 1 per folder). Excluding the asterisk code, which was introduced in 2, the player can only use Battle Chips that have either the same name, or share the letter. Selecting a specific combination of Battle Chips results in Program Advances, which give the player either a strong attack, or continual use of the Battle Chip used for several seconds. Each Battle Chip also has an element assigned to it, and hitting an enemy with its weakness will result in them taking double damage.\nThe series also has multiplayer functionality where two players can either fight, or trade chips with each other using the Game Link Cable; trading the opposite version's Mega Chips in 4–6 will result in them appearing as \"Secret Chips\" in the Chip Library, however Giga Chips cannot be traded .\nDevelopment\n.]]\nResulting from a cancelled horror game, the original Mega Man Battle Network was developed by Capcom Production Studio 2 for the Game Boy Advance handheld video game console.\nBattle Network 3 was intended as the finale of the series, however development on the fourth game started a short while after its release. Writer Masakazu Eguchi wrote that for the last three mainline entries, the developers primarily focused on evolving the battle system from the third game. Later entries in the series also suffered from space limitations, as they still used the same ROM sizes as earlier entries, which lead to the overworld sprites being redrawn to be smaller and more cartoonish. The final game in the series, Battle Network 6, redid several of the sprites again and changed the environment due to wanting to make the game feel fresh.\nStarting with Battle Network 4, the series began including content from Hideo Kojima's series Boktai, which was developed and published by Konami; the crossover content mainly included battle chips, bosses, and entire areas themed around Boktai and vampires. However, content related to the third Boktai game would be removed in international versions of 5: Double Team DS and 6 since it was not released outside of Japan, as would Lunar Knights content in Star Force.\nMusic\nThe music of Mega Man Battle Network was primarily composed by Akari Kaida, Yoshino Aoki, and Toshihiko Horiyama. The soundtracks for 1 through 6, alongside Battle Chip Challenge and the Japanese-only 4.5: Real Operation was released in 2021 on Spotify to celebrate the series' 20th anniversary.\nGames\nMainline games\nMega Man Battle Network\nMega Man Battle Network}}\nA terrorist organization called WWW (World Three) attempted to destroy the world with the use of a super virus known as the Life Virus. Despite interference by Lan and MegaMan, the members stole the four element programs they needed in order to make it and succeeded in its creation. The virus was as strong as predicted, but was destroyed by MegaMan. Its defeat forced WWW to retreat. This game received an averaged score of 80% score on GameRankings and 79% on Metacritic.\nMega Man Battle Network was later re-released for the Nintendo DS as Rockman.EXE: Operate Shooting Star, which serves both as an enhanced port of the original, as well as a crossover with the Star Force series. The NetNavi exclusive to Operate Shooting Star, ClockMan.EXE, was a winner from a CoroCoro Comics contest. Despite initial strong sales, it would only sell 60000 copies by the end of 2009, which contributed to the cancellation of Star Force 4. Capcom's then Vice President of Strategic Planning & Business Development, Christian Svennson, stated the company had no plans to release the game for Western territories, however an English fan translation released in 2018.\nMega Man Battle Network 2\nThe following summer after WWW's defeat, a new terrorist group called Gospel emerges. Their tactics differed considerably compared to WWW, as they appeared to have no set goal. Gospel's plan had seemingly consisted of only causing random destruction with their navis. Lan and MegaMan battled every member and prevented the worst possible situations. However, Gospel's hidden plan was to re-create the ultimate net navi, Bass. Using bug fragments, they planned to make a large army of Bass navis to take over the world. Unknown to Gospel, their method of creating Bass was imperfect, and his abilities were vastly below predictions. In an attempt to make copies of Bass to create an army, the leader of Gospel overloaded energy to the bug fragments; but something went wrong and the concoction transformed into a giant wolf-like multi-bug organism. Although the bug beast was stronger than before, Lan and MegaMan managed to eliminate it. This game received an averaged score of 82% score on GameRankings and 81% on MetaCritic.\nMega Man Battle Network 3\nMega Man Battle Network 3 was released in late-2002 in Japan, and mid-2003 internationally; the game follows a revived WWW seeking to release Alpha, the original prototype of the internet. New to the game is the ability to customize Mega Man by placing blocks in a grid, however placing blocks incorrectly will cause a bug to occur. Battle Network 3 was the first game to get two distinct versions, although this wasn't the case in Japan initially, which didn't get Blue until a few months after White's release.\nLike with the previous two games, reception to Battle Network 3 was positive, although some thought the game had innovated too little. The game also topped sales charts, with both versions selling a total of 768,000 units in Japan at the end of 2003.\nMega Man Battle Network 4\nReleased in December 2003 in Japan, and June 2004 in North America, Mega Man Battle Network 4 involves a meteor on trajectory towards Earth, and a new crime syndicate \"Nebula\" corrupting Navis with Dark Chips. Style Changes are removed in this installment, instead being replaced with Double Souls (Soul Unisons), which can be activated by sacrificing a certain chip. During the game, players will have several scenarios they encounter which are different depending on the version.\nReception to Battle Network 4 was mixed-to-positive, although it too received lower review scores than the first three, which much criticism going to the lack of any real story outside of tournament scenarios. In addition, Blue Moon received criticism due to a bug on the Nintendo DS that would cause the game to slow down significantly when exiting from battle during the WoodMan scenario, which was acknowledged by Nintendo and fixed in time for the DS Lite. Despite this, Battle Network 4 is the best-selling entry in the series, selling 1.35 million copies worldwide as of 2009.\nMega Man Battle Network 5\nNebula attacks again, this time with an all-out invasion. They kidnap Lan's father and use SciLab's computers to take over the internet. In response, either Chaud or Baryl (depending on the version) create a team of elite net navis and operators. Lan and MegaMan are the first members. As the story progresses, more team members are gained, and more areas of the net are liberated. When all of the net is won back, the team locates Nebula's headquarters and attempt to defeat the organization. The GBA versions received an average score of 68% on GameRankings and 67% on MetaCritic, whereas the NDS version received 70% on GameRankings and 68% on MetaCritic.\nMega Man Battle Network 6\nMega Man Battle Network 6 is the final game in the series, in which Lan's father gets a new job and the family moves to Cyber City, leaving behind Netto Hikari's classmates and friends from ACDC Town. WWW destroy once again, aiming to revive the legendary Cybeasts, Gregar and Falzar. The Double Soul system is replaced with the similar Cross System, this time allowing the player to activate at any time, although it will be disabled if hit by its elemental weakness; players are also able to \"Beast Out\" MegaMan for a limited time, allowing him to tap into the power of the Cybeasts. Like the previous games, the Crosses and Beast Out differs depending on the version.\nThe developers have stated the decision to end the series with the sixth game was only made part-way through due to wanting a new Mega Man series for the Nintendo DS; the English version also removed a significant amount of content, mainly the removal of the Boktai crossover. Reviewers generally showed little enthusiasm for Battle Network 6, with it being near-universally highlighted for its lack of changes from previous installments in terms of graphics and gameplay, although some praised its story.\nSpin-offs\nMega Man Network Transmission\nReleased as part of Mega Man's fifteenth anniversary, Mega Man Network Transmission is a platform game developed by Arika and released for the GameCube in mid-2003. The game was first announced in September 2002 at the Tokyo Game Show. The game acts is set between 1 and 2, and involves a new \"Zero Virus\" that makes Navis go berserk. The game mixes the gameplay of the Classic series 2D platforming and Battle Network series tactical RPG elements, with Keiji Inafune stating the decision was made by Arika to \"preserve the core of Rockman\".\nReception to Network Transmission was divisive; a major point of contempt was the game's high difficulty, while the overall presentation drew mixed reactions. On Metacritic, the game averaged a 65/100 indicating \"mixed or average\" reviews.\nRockman.EXE WS\nLan Hikari and MegaMan.EXE face off against the WWW. The story adapts aspects of both the first Mega Man Battle Network game as well as the anime series, MegaMan NT Warrior. The gameplay is similar to that of Mega Man Network Transmission.\nMega Man Battle Chip Challenge\nDeveloped with help from Inti Creates, who also developed the Mega Man Zero and ZX series, Mega Man Battle Chip Challenge utilizes a different battle system where players setup 12 Battle Chips on a grid called a \"Program Deck\", three of which are randomly selected. Aside from the Game Boy Advance version, the game also saw a release on the WonderSwan Color under the title Rockman.EXE: N1 Battle, being among the last games released for the console.\nUnlike other games, contemporary reception to Battle Chip Challenge was mostly negative, with many critics disliking the lack of audience participation and aging presentation, although the audio was praised. The game currently has a 54/100 on Metacritic.\nRockman.EXE 4.5: Real Operation\nRockman.EXE 4.5: Real Operation was released in Japan-only on August 6, 2004. The \"Real Operation\" part of the title refers to how the Game Boy Advance functions as its own PET; during battles, players don't control the Navi directly, instead giving it instructions to follow. Reportedly, the game's development was \"hell\" due to it being completed in less than a year, in-between Battle Network 4 and 5. The game was re-released for the Wii U Virtual Console in 2016.\nOther games\nRockman.EXE: The Medal Operation, and Rockman.EXE: Battle Chip Stadium are a pair of arcade games released in 2005 and 2006; The Medal Operation is a medal game based on Battle Network 5 where players could win chocolate, and Battle Chip Stadium uses the familiar battle system and is based upon Battle Network 6. Service for Battle Chip Stadium ended in April 2014.\nTwo mobile games were released in Japan, Rockman.EXE: Phantom of Network in 2004, and Rockman.EXE: Legend of Network in 2006; both games feature the same gameplay as the mainline entries and include exclusive characters. As of January 1, 2018, both games are no longer available for purchase. Despite their obscurity, many people have wished for them to see a re-release of them onto modern platforms. Both mobile games were eventually preserved in 2023, and received a fan translation in 2024, allowing the games to be played in English.\nA compilation, Mega Man Battle Network Legacy Collection, was released in April 2023, bringing the series to Nintendo Switch, PlayStation 4, and Windows. The compilation includes all six of the numbered games, including both versions of Battle Network 3–6. Physical versions of the collection are sold as one game, while digital versions split the games between two volumes.\nOther media\nAnime\nThe games were adapted into an anime series titled MegaMan NT Warrior, which premiered in Japan on March 4, 2002, and concluded on September 30, 2006, lasting 209 episodes; the English dub of the series was handled by Viz Media, who outsourced the voice acting to the Ocean Group. It lasted for five series, subtitled EXE, Axess, Stream, Beast and Beast+, although only EXE and Axess would be dubbed into English. An alternate English dub by Voiceovers Unlimited would air in South-East Asian countries, which followed the Japanese script more closely, and lacked the censorship NT Warrior had.\nA film set during the events of Stream, Rockman.EXE the Movie: Program of Light and Darkness, premiered in Japanese theatres on March 12, 2005, as a double-billing with the Duel Masters film Duel Masters: Curse of the Deathphoenix. The film grossed a total of US$6,178,840 within three weeks of its release.\nManga\nTwo separate manga series were created by Shogakukan and published in their monthly magazine CoroCoro Comics; MegaMan NT Warrior by Ryo Takamisaki which lasted for 13 volumes, and Battle Story MegaMan NT Warrior by Keijima Jun and Miho Asada which consisted of 4 volumes. Viz Media would release MegaMan NT Warrior in North America between 2004 and 2008, while Battle Story only saw a release in Japan, Indonesia and certain European countries.\nBoard game\nIn 2004, Capcom released Rockman.EXE: Catan, a licensed version of The Settlers of Catan with the Battle Network motif. The game came in standard and portable types, with the portable version being magnetic.\nNotes\nReferences\nExternal links\n*[https://web.archive.org/web/20100522212931/http://www.capcom.co.jp/rockmanexe/ Rockman EXE series] - official Capcom site for the Rockman EXE series (Japanese).\n*[https://web.archive.org/web/20060703082655/http://www.takaratomy.co.jp/products/rockman/top.html Rockman.EXE Link Pet EX]"
    }
  ]
}