{
  "content": [
    {
      "type": "text",
      "text": "# Megan Edwards\n\nMegan Frances Edwards (born December 17, 1952) is an American writer and editor.\nBiography\nEdwards was born in Great Lakes, Illinois, near North Chicago, December 17, 1952. She graduated with a BA from Scripps College in classics and an MA in education from Claremont Graduate University, after which she worked in Germany, Greece, California, Texas, and Nevada, as a teacher and also a school principal. She was also a columnist (1993–1998) for the Pasadena Weekly and a contributing writer (2000–2001) for the Las Vegas Weekly.\nOn October 27, 1993, the house where she and her husband lived in California burned down in a wildfire, destroying nearly all their possessions. Instead of rebuilding, they bought a custom motorhome, named it \"Phoenix One\" and began a road trip that lasted six years. During this time, the couple pioneered the (then difficult) art of connecting to the internet while traveling. One result was \"RoadTrip America\", a web resource started in 1996 for touring in North America.\nThe first four years of her adventures in Phoenix One are recorded in the book Roads from the Ashes. In general, the book was well received.\nIn 2008, a collection titled Caution: Funny Signs Ahead was published. The book contains pictures of actual signs that are humorous due to juxtapositions, misspellings, double entendres, etc., and which were originally published online at RoadTripAmerica.com.\nIn 2010, Edwards contributed a short story to The Perpetual Engine of Hope, an anthology featuring stories written by seven Las Vegas writers. She became a contributing writer for Nevada Public Radio's Desert Companion magazine in 2012.\nIn 2014, Edwards contributed a short essay to Nevada: 150 Years in the Silver State from Geoff Schumacher (editor) with Stephens Press.\nIn 2017, Edwards debut novel, titled Getting off on Frank Sinatra: A Copper Black Mystery, was published by Imbrifex Books in March 2017. In general, the book was well received.\nIn 2018 Edwards's novel Getting off on Frank Sinatra was the Gold winner of the Benjamin Franklin Award for Best First Novel. It was also a Bronze winner for the 2017 Foreword INDIES and a finalist in the Next Generation Indie Book Awards. Her novel Strings was a Gold winner for the Benjamin Franklin Award for Romance, and it also received Honorable Mentions in the 2017 Foreword INDIES, as well as the Reviewers Choice Award for Romance, Music & Arts. Full Service Blonde was the 2017 INDIES Honorable Mention winner for Mystery. Edwards's novel Full Service Blonde was the Gold winner for the Benjamin Franklin Award for Mystery.\nEdwards is a 2023 Silver Pen Awardee.\nPublications\nMegan Edwards has had several books published and has contributed to anthologies.\nBooks\n* Roads from the Ashes: An Odyssey in Real Life on the Virtual Frontier, Trilogy Publications (May 1999)\n* Strings: A Love Story, Imbrifex Books (September 2010)\n* The Perpetual Engine of Hope: Short Stories Inspired by Iconic Las Vegas Photographs, CityLife Books (September 2012)\n* Getting Off on Frank Sinatra, Imbrifex Books (August 2016)\n* Full service Blonde, Imbrifex Books (November 2017)\n*Live Through This: An Anthology of Unnatural Disasters, Huntington Press (September 2018)\nNotes\nExternal links\n* [https://meganedwards.com/ Author Website]"
    }
  ]
}