{
  "content": [
    {
      "type": "text",
      "text": "# Mehrauli Archaeological Park\n\n.]]\ncomplex built  in 1528–1529 CE, in the Archaeological Park.]]\nThe Mehrauli Archaeological Park is an archaeological area spread over  in the Mehrauli neighbourhood of the South Delhi district of Delhi, India. The park is located adjacent to the World Heritage-listed Qutub Minar and the Qutb complex.\nThe park consists of over 100 historically significant monuments. It is the only area in Delhi known for 1,000 years of continuous occupation, and includes the ruins of Lal Kot built by Tomar Rajputs in 1060 CE, making it the oldest extant fort of Delhi, and architectural relics of subsequent period, rule of Khalji dynasty, Tughlaq dynasty, Lodhi dynasty of Delhi Sultanate, Mughal Empire, and the British Raj.\nOverview\nThe park contains significant sites including:\n* Tomb of Balban,  CE, wherein a true arch and the true dome were built for the first time in India\n* Jamali Kamali Mosque and Tomb of Maulana Jamali Kamali (Jamali Kamboh), built 1526 - 1535 CE\n* Quli Khan's Tomb\n* Gandhak ki Baoli\n* Rajon Ki Baoli, a stepwell, and\n* Madhi Masjid.\nOther nearby monuments include the Jahaz Mahal, Zafar Mahal of Bahadur Shah II alias Lal Mahal, Hauz-i-Shamsi and Tomb of Adham Khan. Pillars and remains of several monuments, Jharna which is like a pleasure garden of late Mughals are also lay scattered in the park.\nRedevelopment and conservation\nThe redevelopment of the area as an archaeological park and conservation of important structures started in 1997, in collaboration between Delhi Tourism and Transportation Development Corporation (DTTDC), the State Department of Archaeology, the Delhi Development Authority (DDA) and the Indian National Trust for Art and Cultural Heritage (INTACH), which first started  systematic documentation of structures in the area and also started conducting heritage walks since 2000.\nOver the years, INTACH has restored some 40 monuments in the park and added signages, heritage trails, and sandstone trail-markers.\nNotable monuments and structures\nFile:The bastion of Lal Kot fort, Mehrauli, Delhi.jpg|The bastion of Lal Kot fort, Mehrauli.\nFile:Balban's tomb, Mehrauli.jpg|Balban's tomb, Mehrauli,  ca 1287 CE\nFile:Tomb of Khan Shahid, Balban's son, Mehrauli.jpg|Tomb of Khan Shahid, Balban's son, Mehrauli.\nFile:Entrance to Tomb of Khan Shahid, Mehrauli.jpg|Entrance to Tomb of Khan Shahid, son of Balban\nFile:Rajon ki Bain.jpg|Steps of Rajon Ki Baoli\nFile:Wall Mosque 007.jpg|Walled mosque adjacent to the Baoli\nFile:Gandhak ki Baoli, Mehrauli.jpg|Gandhak ki Baoli, another stepwell beyond  Rajon Ki Baoli.\nFile:Tomb of Sufi saint, Qutbuddin Bakhtiyar Kaki in Mehrauli, Delhi.jpg|Dargah of Sufi saint, Qutbuddin Bakhtiar Kaki, beyond  Rajon Ki Baoli.\nFile:Tomb and wall mosque in Mehrauli Archaeological Park.jpg|Tomb and wall mosque in Mehrauli Archaeological Park.\nFile:Bagichi Ki Masjid, Mehrauli.jpg|Bagichi Ki Masjid, Mehrauli.\nFile:Ruins of Sir Thomas Metcalfe's Guest House at Dilkusha.jpg|British Agent, Sir Thomas Metcalfe's Guest House at Dilkusha close to Quli Khan's tomb.\nFile:Pavilion tomb and grave platform, Mehrauli Archaeological Park.jpg|Pavilion tomb and grave platform, Mehrauli Archaeological Park.\nFile:Tomb in Mehrauli Archaeological Park.jpg|Tomb in Mehrauli Archaeological Park.\nFile:Ruins Balban Khan Tomb 004.jpg|Ruined homes near Balban's tomb\nFile:Ahinsa Sthal.jpg|Ahinsa sthal is a place for Mahavir\nFile:Tomb of Muhammad Quli Khan.jpg|alt=https://gowithharry.com/mehrauli-archaeological-park-heritage-walk/|Quli Khan's Tomb is located near Boat House\nSee also\n* Qutb complex\n* History of Delhi\n* Baolis of Mehrauli\n* List of Monuments of National Importance in Delhi\nReferences\n* [https://web.archive.org/web/20121112223428/http://intachdelhichapter.org/conservation_of_mapark.html Mehrauli Archaeological Park Conservation]  INTACH\nExternal links\n* [https://web.archive.org/web/20121230071245/http://www.intachdelhichapter.org/heritage_walks_mehrauli_archaeological.html Heritage Walks: Mehrauli Archaeological Park] at INTACH\n*\n* [http://www.monumentsofdelhi.com/cities#LalKot Monuments of Delhi]\n* Mehrauli Archaeological Park. World History Encyclopedia. Retrieved from https://www.worldhistory.org/article/1736/mehrauli-archaeological-park/"
    }
  ]
}