{
  "content": [
    {
      "type": "text",
      "text": "# Mekton Wars 1: Invasion Terra\n\n]]\nMekton Wars 1: Invasion Terra is a series of scenarios published by R. Talsorian Games in 1996 for the mecha combat role-playing game Mekton Zeta.\nContents\nMekton Wars 1: Invasion Terra is an adventure and campaign book set in the future where Earth is in conflict against humanoid aliens. The book describes the invasion of Earth by the Kaldaran Empire, as well as the notable pre-generated player characters involved. The heart of the book is 31 tactical scenarios. Each one includes background material, a terrain map, descriptions of the forces involved, their starting deployments and the scenario's victory conditions.\nPublication history\nIn 1985, R. Talsorian Games published Mekton, an anime and mecha-inspired role-playing and combat game system designed by Mike Jones and Mike Pondsmith. The game ultimately spawned several editions, the third being Mekton Zeta in 1995. The following year, R. Talsorian Games released Mekton Wars 1: Invasion Terra, a 96-page softcover book designed by Michael MacDonald, Craig Sheeley, and Benjamin Wright, with cover art by Junichi Inoue, and interior art by Inoue and Mark Schumann.\nReception\nIn Issue 6 of the British magazine Arcane, Jim Swallow was not impressed, commenting, \"\"Invasion Terra seems half-baked. The writing has a good true-to-genre atmosphere and contains a few in-jokes, but what could have been a great roleplaying scenario pack instead comes across as poorly put together and half-finished. Definitely the weakest in an otherwise excellent line.\"\" Swallow concluded by giving this game a poor rating of 5 out of 10.\nIn Issue 30 of Australian Realms, Paul Mitting thought the overall concept of overwhelmed but plucky humans fighting against ruthless and technologically superior alien invaders was cliche and compared it to the movie Independence Day. Mitting noted that gamemasters playing the Mekton: Invasion Terra campaign setting would find this \"a must have,\" but \"If you've developed your own setting then its usefulness is debatable.\" Mitting concluded, \"The package is very well produced, with fine artwork, and well worth a look if you are a Mekton player.\"\nOther reviews and commentary\n*Valkyrie #13 (1997)\nReferences"
    }
  ]
}