{
  "content": [
    {
      "type": "text",
      "text": "# Melanie Ward\n\n-->\n| birth_place         = Helensburgh, Dunbartonshire, Scotland\n| party               = Labour\n| spouse              =\n| relations           =\n| children            =\n| parents             =\n| relatives           =\n| education           =\n| alma_mater          = University of Stirling (BA)SOAS University of London (MA)\n| occupation          =\n| profession          =\n| committees          =\n| awards              =\n| website             =\n| footnotes           =\n}}\nMelanie Claire Ward (born February 1981) is a British Labour Party politician who has served as Member of Parliament for Cowdenbeath and Kirkcaldy since 2024.\nUntil her election in 2024, Ward was a humanitarian aid worker, working for several prominent international charities in succession. She was chief executive officer of Medical Aid for Palestinians from 2023 to 2024.\nEarly life and education\nWard was born in Helensburgh on the Firth of Clyde. She attended the local Hermitage Academy. She received a Bachelor of Arts in Human Resource Management from the University of Stirling, and served as President of the National Union of Students Scotland. Ward received a Master of Arts in International Studies and Diplomacy from SOAS University of London in 2009.\nCharity career\nWard has worked for several charities, including Christian Aid, and ActionAid UK. For a time she chaired The Circle, which is a charity that Annie Lennox founded to empower women. By December 2015, Ward was the associate director of policy and advocacy for the International Rescue Committee UK. She was still working for IRC in September 2021.\nIn September 2022, MAP announced that it had appointed Ward to become its new CEO. She took up her position in January 2023. In May 2024, Time included her in its \"Time100 Health\" list of influential workers in the health sector. In May 2024, MAP granted her leave of absence for the duration of that year's general election campaign. On 4 July she was won her election, and the next day she resigned as CEO of MAP.\nPolitics\nWard was the Labour candidate for Glenrothes in the 2015 General Election. Labour had held Glenrothes since the seat was created in 2005, but in 2015 Peter Grant of the SNP won the seat from Labour with a majority of 13,987, and Ward came second.\nWard opposed Jeremy Corbyn throughout his leadership of the Labour party. In August 2015, when Corbyn was campaigning to be elected leader, she tweeted a link to an article by Leo McKinstry in The Daily Telegraph that accused Corbyn of being an \"unreconstructed Trotskyite\", and in her tweet she urged party members to \"think again\". In June 2016 she called for Corbyn to resign as Leader of the Labour Party, and encouraged other members and supporters of the party to petition him to do so.\nWard opposed Brexit, and supported the People's Vote campaign for another referendum on UK membership of the European Union. In 2018 and 2019 she criticised Corbyn for not calling for another referendum.\nThe day after Labour lost the 2019 General Election, Ward tweeted \"Corbyn and his hard left band of supporters control every part of the Labour Party. This is their failure. They need to own it, take responsibility and get out of the way. Our country and our most vulnerable people will pay the price for what they have done. Gutted.\" When Corbyn stepped down as leader in April 2020, Ward tweeted \"Farewell to Jeremy Corbyn, who really was a truly terrible Labour Party Leader. He will be missed not one little bit by those of us who want to see Labour in government again\".\nIn November 2023, Ward applied to be the Labour candidate for Beckenham and Penge. She was not selected.\nIn May 2024 the National Executive Committee of the Labour Party appointed her as the Labour candidate for Cowdenbeath and Kirkcaldy, which the party had lost to Neale Hanvey in the 2019 General Election. On 4 July 2024 she was elected with a majority of 7,248, winning the seat back for Labour. She was appointed as Parliamentary Private Secretary for Secretary of State for Scotland Ian Murray on 21 July. Her name was included in the Time 2024 list of influential people in health.\nIn February 2025, MP Melanie Ward spoke in Parliament in support of nurse Sandie Peggie, stating: “Women’s sex-based rights are hard fought, and we give them up at our peril.” Peggie had been suspended after objecting to Dr Beth Upton, a transgender woman, herself for using the female changing rooms at her workplace. She later brought a tribunal case against NHS Fife, alleging sexual harassment and discrimination under the Equality Act 2010.\nReferences\nExternal links\n*\n* [https://uk.linkedin.com/in/melanie-ward-mp-8097bbb Profile] at LinkedIn"
    }
  ]
}