{
  "content": [
    {
      "type": "text",
      "text": "# Memorial tablets to the British Empire dead of the First World War\n\nto the British Empire dead of the First World War]]\nBetween 1923 and 1936, the Imperial War Graves Commission erected a series of memorial tablets in French and Belgian cathedrals to commemorate the British Empire dead of the First World War. The tablets were erected in towns in which British Army or Empire troops had been quartered.\nThe prototype Commission memorial tablet, placed in Amiens Cathedral in 1923 alongside tablets previously erected to other Empire troops, was dedicated to the 600,000 dead of Britain and Ireland. The subsequent design of the Commission's tablet brought together the British Royal Coat of Arms with those of India and the imperial dominions: South Africa, Australia, Canada, New Zealand, and Newfoundland. The tablet's inscription, written by Rudyard Kipling, referred to the \"million dead\" of the Empire. Produced by Reginald Hallward to a design by architect H. P. Cart de Lafontaine, the tablets were erected in twenty-eight cathedrals and churches, twenty-three in France and five in Belgium, with the bilingual inscriptions in each country in English and French, and English and Latin respectively. They were unveiled by a range of dignitaries, including members of the royal family, diplomats, politicians, and British Army generals who had commanded troops on the Western Front.\nA tablet of the same design, but with an inscription referring to the dead buried in the \"lands of our Allies\", was unveiled in Westminster Abbey in 1926 and later installed in what became St George's Chapel. Replicas or copies of the Westminster Abbey tablet were distributed to churches or cathedrals in Hamilton and Vancouver in Canada, and in Baghdad in Iraq. Copies or reproductions are located at the museum at Delville Wood in France, in Fremantle, Australia, and in Liverpool, UK. Versions of the prototype Amiens tablet and the standard tablet used in France are held at the headquarters of the Commonwealth War Graves Commission in Maidenhead, UK.\nOrigin and design\nThe Imperial War Graves Commission had been established by Royal Charter in 1917. Following the cessation of hostilities in 1918 at the end of the First World War, the Commission continued developing its plans to commemorate the war dead of both the British Army and troops from the Empire and its Dominions. The Commission had responsibility for war graves, but it was less clear who had responsibility for memorials. The Commission drew a distinction between individual commemoration of the dead and more general monuments such as battle exploits and regimental memorials. These latter were to be dealt with by a Battle Exploits Memorial Committee established in 1918 by the British Army's Adjutant-General. By 1919, a Cabinet-level desire for memorials to the army as a whole led to the establishment of the National Battlefield Memorials Committee, chaired by the Earl of Midleton.\nAs plans progressed, it became apparent that the proposals for national battlefield memorials would overlap with those made by the Commission for memorials to the missing. In 1921, rather than fund two separate schemes, the responsibility for general war memorials was transferred from the National Battlefield Memorials Committee to the Imperial War Graves Commission. One of the proposals taken up from the Committee and acted upon by the Commission was the recommendation that commemorative tablets be \"erected in French cathedrals which had particular associations with British troops during the war\". The Commission's committee to co-ordinate this consisted of Lieutenant General Sir George Macdonogh, Sir Herbert Creedy (Secretary to the War Office), the Commission's literary advisor Rudyard Kipling, and the Commission's founder and vice-chairman Fabian Ware. The design was by Commission architect H. P. Cart de Lafontaine, with the tablets produced by sculptor Reginald Hallward.\nCart de Lafontaine spoke fluent French, and in addition to designing the tablets he negotiated with the cathedral authorities. The scheme was expanded to include cathedrals in Belgium as well. In some cases, the cathedrals had been badly damaged, and the placement of tablets was delayed until reconstruction had been completed. Other considerations included the placement of the tablet in the available space within the cathedrals, with some using a horizontal design instead of a vertical one. The prototype tablet, produced for Amiens Cathedral, featured the Royal Coat of Arms and an inscription that referred to the armies of Great Britain and Ireland.\nAll the later Commission tablets used a design that differed from the prototype tablet in that it brought together elements from all the dominions and India. This standard design, following consultations with the College of Arms, had the Royal Coat of Arms surrounded by the shields of the coats of arms of the five Dominions: the Union of South Africa, the Commonwealth of Australia, the Dominion of New Zealand, Canada and the Dominion of Newfoundland. The Indian Empire was represented by the insignia of the Order of the Star of India and its motto 'Heaven's light our guide'. Some designs of the tablet referred to 'The United Kingdom', while others referred to 'The United Kingdom of Great Britain and Ireland'. The text within the main design includes the mottoes used in the Royal Coat of Arms: Honi soit qui mal y pense and Dieu et mon droit. The material used was gilded and coloured gesso set in a stone surround. Other design elements included a banded laurel-like border with carved roses in each corner and one at bottom centre. Some designs differed in the placement of the names of the dominions, and some varied in the colours used. The Westminster tablet is 5 feet 10 inches by 2 feet 10 inches (177.8&nbsp;cm by 86.36&nbsp;cm). The Ypres tablet is 266&nbsp;cm by 127&nbsp;cm.\nFile:Arms of Canada (1921–1957) (shield).svg|Arms of Canada\nFile:Arms of South Africa (1910–1928).svg|Arms of South Africa\nFile:Arms of New Zealand.svg|Arms of New Zealand\nFile:Simple arms of Newfoundland and Labrador.svg|Arms of Newfoundland\nFile:Shield of arms of Australia.svg|Arms of Australia\nLocations and unveilings\nThe following table lists the known locations, unveiling dates and other details for the Commission's cathedral and church tablets in France, Belgium and other countries between 1923 and 1936.\n{| class=\"wikitable sortable\" style=\"text-align: center; margin: auto auto\"\n|+ Memorial tablets to the British Empire dead of the First World War\n!Cathedral or church!!Town or city!!Country!!Date unveiled!!class=\"unsortable\"|Unveiled by!!class=\"unsortable\"|References\n|-\n| Amiens Cathedral || Amiens || France ||  || Duke of Connaught ||\n|-\n| Notre Dame || Paris || France ||  || Prince of Wales ||\n|-\n| Le Mans Cathedral || Le Mans || France ||  || Horace Smith-Dorrien ||\n|-\n| Rouen Cathedral || Rouen || France ||  || Nevil Macready ||\n|-\n| Orléans Cathedral || Orléans || France ||  || William Birdwood ||\n|-\n| Marseille Cathedral || Marseille || France ||  || William Birdwood ||\n|-\n| Nancy Cathedral || Nancy || France ||  || Thomas Dodds ||\n|-\n| Beauvais Cathedral || Beauvais || France ||  || Victor Gordon||\n|-\n| Nantes Cathedral || Nantes || France ||  || Victor Gordon||\n|-\n| Meaux Cathedral || Meaux || France ||  || Sidney Clive ||\n|-\n| Bayeux Cathedral || Bayeux || France ||  || Horace Smith-Dorrien ||\n|-\n| Westminster Abbey || London || United Kingdom ||  || Prince of Wales ||\n|-\n| St Waudru Collegiate Church || Mons || Belgium ||  || Nevil Macready ||\n|-\n| St Rumbold's Cathedral  || Mechelen || Belgium ||  || George Macdonogh ||\n|-\n| Notre-Dame de Boulogne || Boulogne || France ||  || Nevil Macready ||\n|-\n| Senlis Cathedral || Senlis || France ||  || Nevil Macready ||\n|-\n| Laon Cathedral || Laon || France ||  || William Pulteney ||\n|-\n| St Michael and St Gudula || Brussels || Belgium ||  || Douglas Haig ||\n|-\n| Church of the Ascension || Hamilton || Canada ||  || John Morison Gibson ||\n|-\n| Église Saint-Maurice || Lille || France ||  || Richard Haking ||\n|-\n| Reims Cathedral || Reims || France ||  – – –  || Alexander Godley ||\n|-\n| Soissons Cathedral || Soissons || France ||  – – –  || William Pulteney ||\n|-\n| Saint-Vaast Church || Béthune || France ||  – – –  || Edward Bulfin ||\n|-\n| Cambrai Cathedral || Cambrai || France ||  – – –  ||  – – –  ||\n|-\n| Saint-Quentin Basilica || Saint-Quentin || France ||  – – –  ||  – – –  ||\n|-\n| St George's Church || Baghdad || Iraq ||  – – –  ||  – – –  ||\n|-\n| Cathedral of Our Lady || Antwerp || Belgium ||  || George Dixon Grahame ||\n|-\n| Saint-Omer Cathedral || Saint-Omer || France ||  || Nevil Macready ||\n|-\n| Christ Church Cathedral || Vancouver || Canada ||  || Robert Randolph Bruce ||\n|-\n| Noyon Cathedral || Noyon || France ||  || George Macdonogh ||\n|-\n| St Martin's Cathedral || Ypres || Belgium ||  || Charles Harington ||\n|-\n| Arras Cathedral || Arras || France ||  || Duff Cooper ||\n|-\n|}\nAmiens Cathedral tablets\nWhen the Commission took up the memorial tablet proposal from the National Battlefield Memorials Committee, several tablets had already been unveiled in Amiens Cathedral to the memory of Dominion forces that had participated in the Somme Offensive or in later battles in the area. Amiens is the capital of the département of the Somme, and the 13th-century Amiens Cathedral is the largest in Europe. This led to many requests after the war for permission to erect memorials there. Eleven such memorials are listed in The Middlebrook Guide to the Somme Battlefields, all located near the cathedral's south door. Six of them commemorate British or Dominion troops, including the prototype Commission tablet.\nThe first of these six memorials was erected for the Royal Canadian Dragoons and was dedicated on 12 April 1919 by the Archbishop of Amiens. This was followed by a tablet to the Australian Imperial Force, unveiled on 7 November 1920 by Marshal Ferdinand Foch in the presence of the Australian High Commissioner Andrew Fisher. The erection of a tablet to South African forces, reported in December 1920, had been suggested by the late Prime Minister of the Union of South Africa Louis Botha. A tablet to the forces of Newfoundland was unveiled on 27 August 1922 by Sir Richard Squires the Prime Minister of Newfoundland. The aforementioned prototype Commission tablet was unveiled on 9 July 1923 by Prince Arthur, the Duke of Connaught and wartime Governor-General of Canada. The final tablet, to the soldiers of the New Zealand Division, was unveiled on 16 July 1923 by Lord Liverpool, wartime Governor (later Governor-General) of New Zealand, in the presence of the High Commissioner for New Zealand, Sir James Allen.\n{| class=\"wikitable\" style=\"text-align: center; margin: auto auto\"\n|+ Amiens prototype tablet inscriptions\n!Tablet in Amiens!!English!!French\n|-\n|||A.M.D.G.IN SACRED MEMORY OF SIX HUNDRED THOUSAND MEN OF THE ARMIES OF GREAT BRITAIN & IRELAND WHO FELL IN FRANCE & BELGIUM DURING THE GREAT WAR 1914 – 1918 IN THIS DIOCESE LIE THEIR DEAD OF THE BATTLES OF THE SOMME 1916 THE DEFENCE OF AMIENS 1918 & THE MARCH TO VICTORY 1918||A LA MEMOIRE DES 600,000 SOLDATS DES ARMEES DE LA GND BRETAGNE & DE L'IRLANDE TOMBEES AU CHAMP D'HONNEUR EN FRANCE ET EN BELGIQUE 1914 – 1918 DANS CE DIOCESE REPOSENT LEURS MORTS DES BATAILLES DE LA SOMME 1916 DE LA DEFENSE D'AMIENS 1918 ET DE LA VICTOIRE 1918\n|-\n|}\nThe inscription uses the abbreviation A.M.D.G. for the Latin phrase Ad Majorem Dei Gloriam, and in addition to the Somme battles of 1916 refers to the defence of Amiens during the German spring offensive, and the Battle of Amiens and the Hundred Days Offensive that led to the Armistice in 1918. A version of the Amiens tablet is displayed at the headquarters of the Commonwealth War Graves Commission in Maidenhead, UK.\nThe form of the wording to be used on the tablets was the subject of correspondence between Commission officials and advisers. One such letter, between Kipling and Ware was written on 8 May 1923, with Kipling giving his thoughts on the wording proposed for the Notre Dame tablet (unveiled the following year) in light of the wording being used for the Amiens tablet (unveiled two months after this letter was written): Of course, \"diocese\", in this connection, is absurd. It will have to be \"France\". Otherwise I don't see much wrong with the wording, except that, it seems to me, \"dead\", in place of \"men\", is the clou. The difficulty is the supplementary clause, and the word \"especially\", which, I fear, can't be avoided. I prefer \"honoured\" or \"enduring\" to \"sacred\", but there may be good reason for keeping to the last. I think that the word \"here\" after \"rest\", gives a touch of intimacy between the two lands. Kipling went on to suggest a draft form of the inscription that was eventually used (with further changes) on the Notre Dame tablet.\nFile:WWI memorial tablet to Canadian forces in Amiens Cathedral.JPG|Canada\nFile:WWI memorial tablet to South African forces in Amiens Cathedral.JPG|South Africa\nFile:WWI memorial tablet to New Zealand forces in Amiens Cathedral.JPG|New Zealand\nFile:WWI memorial tablet to Newfoundland forces in Amiens Cathedral.JPG|NewfoundlandNewfoundland tablet:  Joshua 24–27 Josué 24–27\nFile:WWI memorial tablet to Australian forces in Amiens Cathedral.JPG|Australia\nTablets in France\nThe first standard tablet to be unveiled in France was that erected in Notre Dame de Paris. It was unveiled on 7 July 1924 by the Prince of Wales (the future Edward VIII) in his role as President of the Imperial War Graves Commission. French dignitaries present included the French President Gaston Doumergue, French Minister for War Charles Nollet, Military Governor of Paris Henri Gouraud, and generals Castelnau and Mangin. The tablet was shrouded in a Union flag, and following the unveiling the Prince handed a message to the President of France from King George V.\n{| class=\"wikitable\" style=\"text-align: center; margin: auto auto\"\n|+ Standard tablet inscriptions in France\n!Tablet in Paris!!English!!French\n|-\n|||TO THE GLORY OF GOD AND TO THE MEMORY OF ONE MILLION DEAD OF THE BRITISH EMPIRE WHO FELL IN THE GREAT WAR 1914 – 1918 AND OF WHOM THE GREATER PART REST IN FRANCE||A LA GLOIRE DE DIEU ET A LA MEMOIRE DU MILLION DE MORTS DE L'EMPIRE BRITANNIQUE TOMBES DANS LA GRANDE GUERRE 1914 – 1918 ET QUI POUR LA PLUPART REPOSENT EN FRANCE\n|-\n|}\nA succession of tablets of the same or similar design to the one erected in Paris were unveiled in French cathedrals, the majority in 1925, 1926 and 1927. One of those reported on at greater length in The Times was the service and ceremony for the tablet placed in Rouen Cathedral on the north wall of the chapel to Joan of Arc. This tablet, shrouded by a Union flag but framed in bronze rather than marble, was unveiled on 25 February 1925 by General Nevil Macready representing the Imperial War Graves Commission. The address by the Archbishop of Rouen spoke of the historical connections between Normandy and England, and Macready's unveiling speech in French concluded: \"Glory to Joan of Arc! Glory to our dead!\" Wreaths were laid under the Empire tablet and also at the memorial elsewhere in the cathedral to those of Rouen who fell in the war.\nThe tablet at Arras Cathedral, the latest to be erected, was unveiled on 10 May 1936 by the Secretary of State for War Duff Cooper, present in his role as Chairman of the Imperial War Graves Commission. The erection of this tablet had been delayed by the restoration of the cathedral, which had been completed a few months earlier. Those present at this unveiling included representatives of Australia, New Zealand, Canada, Australia and India, together with the British ambassador to France George Clerk, Admiral Sir Morgan Singer, Lieutenant-General Sir George Macdonogh, and Commission architect Sir Reginald Blomfield. The French government was represented by Minister of Pensions René Besse, with General Schweissgut representing the French Minister of War. The Vicar-General represented the Bishop of Arras. Addresses were made by Duff Cooper, the Vicar-General and Fabian Ware. Duff Cooper, as Macready had at Rouen 11 years earlier, made reference to Joan of Arc, going on to state that the Commission had laid wreaths in the chapel of Notre Dame de Lorette at the stained glass memorials of St Joan of Arc and St George, erected there by the Commission.\nA version of the standard French tablet is displayed at the headquarters of the Commonwealth War Graves Commission in Maidenhead, UK.\nFile:Le Mans-Cathédrale-Plaque commémorative.jpg|Le Mans\nFile:Cathédrale Saint-Etienne - Meaux - Seine-et-Marne - France - Mérimée PA00087087 (17).jpg|Meaux\nFile:Nancy cathedral WWI plaque.JPG|Nancy\nFile:Nantes Cathedral United Kingdom WWI memorial.jpg|Nantes\nFile:Plaque britannique mg 6796.jpg|Senlis\nFile:Plaque Memorial à l'Empire Anglais.jpg|Beauvais\nFile:Béthune -Église Saint-Vaast (6).JPG|Béthune\nFile:Cathédrale Sainte-Croix Orléans WWI Memorial.JPG|Orléans\nTablets in Belgium\nThe first tablets to be unveiled by the Commission in Belgium were at Mons and Mechelen, on Armistice Day in November 1926 and in March 1927. These were followed by the unveiling of the tablet in Brussels at the Cathedral of St Michael and St Gudula on 22 July 1927. This was two days before the unveiling of the Menin Gate in Ypres, one of the Commission's main memorials to the missing. The Menin Gate was unveiled by Lord Plumer, while Earl Haig was asked to unveil the Brussels tablet to the Empire's dead. Those present at the Brussels ceremony included the Belgian Prime Minister Henri Jaspar, the Belgian Minister of Justice Paul Hymans, the Minister of National Defence Charles de Broqueville (Belgian Prime Minister during the war), and the heir to the Belgian throne and future Leopold III, the Prince of Brabant. The British dignitaries accompanying Earl Haig included the British ambassador to Belgium George Dixon Grahame, British generals Hubert Gough and George Macdonogh, and the Commission's vice-chairman Fabian Ware. At the reception at the town hall following the unveiling, Haig delivered a speech in French, reported in The Times, paying tribute to the Empire's dead and to the resistance by the Belgian forces at the Battle of Liège to the invading German armies. A further two tablets were unveiled in Belgium, at Antwerp in 1928 and at Ypres in 1931, the latter delayed by the rebuilding of St Martin's Cathedral.\n{| class=\"wikitable\" style=\"text-align: center; margin: auto auto\"\n|+ Standard tablet inscriptions in Belgium\n!Tablet in Brussels!!English !!Latin\n|-\n|||TO THE GLORY OF GOD AND TO THE MEMORY OF ONE MILLION DEAD OF THE BRITISH EMPIRE WHO FELL IN THE GREAT WAR 1914 – 1918 MANY OF WHOM REST IN BELGIUM||AD MAIOREM DEI GLORIAM ET IN MEMORIAM MILLIENS MILLIUM NOSTRORUM QUI EX IMPERIO BRITANNICO UNDIQUE COORTI ANNO DOMINI MCMXIV – MCMXVIII IN BELLO PRÆTER OMNIA MEMORANDO VITAM PRO PATRIA PROFUDERUNT QUORUM PARS MAGNA IN TERRA BELGICA DORMIUNT HOC MONUMENTUM EXSTRUXERE TOTIUS IMPERII GENTES ATQUE COMMUNITATES\n|-\n|}\nThe inscriptions on the tablets in Belgium are in English and Latin, a decision that was taken in consultation with the Belgian ecclesiastical authorities, with Latin used as an alternative to the two official languages of the country. The Latin text is not a direct translation of the English text, with the Latin wording discussed in correspondence in 1925 between Fabian Ware and Sir M. Sadler.\nWestminster Abbey tablet\nThe tablet produced for Westminster Abbey was similar in design to those erected in Belgium and France, but with a different inscription. The unveiling on 19 October 1926 was attended by the Prime Ministers of the Dominions, who were present in London for the Imperial Conference of 1926. The tablet, shrouded in a Union flag, was displayed in the nave of the Abbey, on a platform on the west side of the choir arch. The report in The Times stated that it was placed on a \"specially designed screen covered with a fine brocade of blue, gold, and silver.\" A large number of dignitaries were present, while the public was limited to the available space remaining in the nave. Present were members of the British Cabinet, members of the Imperial War Graves Commission, Army, Navy and Air Force officers and commanders, representatives of associations such as the British Legion, the Red Cross and St Dunstan's, along with many Dominion representatives. In the front row were veterans who had been blinded during the war.\nFollowing protocol, the Prince of Wales arrived last and was received at the West Door of the Abbey by the Dean of Westminster William Foxley Norris, the Prime Minister Stanley Baldwin, the Secretary of State for India Lord Birkenhead, the Secretary of State for the Colonies and for Dominion Affairs Leo Amery, the Secretary of State for War and Chairman of the Imperial War Graves Commission Sir Laming Worthington-Evans, Prime Minister of Newfoundland Walter Stanley Monroe, Prime Minister of New Zealand Gordon Coates, Prime Minister of Australia Stanley Bruce, Prime Minister of the Union of South Africa J. B. M. Hertzog, and Prime Minister of Canada William Lyon Mackenzie King. The Prince, in addition to representing the King, was present as President of the Imperial War Graves Commission. Like other members of the military, he wore morning dress rather than uniform.\nFollowing a short service by the Dean, the Prince of Wales, who himself had served in the war, declared:I unveil this tablet in honour of our comrades, from every land under the Crown, who fell in the Great War. Time cannot dim our remembrance of them, nor lessen our gratitude to our Allies, who have given us the land in which many of them lie buried, so that we can care for their graves for ever. This was followed by the laying of a wreath, the dedication by the Dean, the hymn O Valiant Hearts (a war poem set to music to remember the fallen of the Great War), prayers, the first verse of the National Anthem, and the closing blessing. After the Prince and the Prime Ministers had left, the Abbey was opened to allow those waiting outside to join the rest of the congregation in viewing the memorial.\n{| class=\"wikitable\" style=\"text-align: center; margin: auto auto\"\n|+ Westminster tablet inscriptions\n!Replica of Westminster tablet!!Original!!Post-Second World War\n|-\n|||TO THE GLORY OF GOD AND TO THE MEMORY OF ONE MILLION DEAD OF THE BRITISH EMPIRE WHO FELL IN THE GREAT WAR 1914 – 1918 THEY DIED IN EVERY QUARTER OF THE EARTH AND ON ALL ITS SEAS AND THEIR GRAVES ARE MADE SURE TO THEM BY THEIR KIN THE MAIN HOST LIE BURIED IN THE LANDS OF OUR ALLIES OF THE WAR WHO HAVE SET ASIDE THEIR RESTING PLACES IN HONOUR FOR EVER||TO THE GLORY OF GOD AND TO THE MEMORY OF THE DEAD OF THE BRITISH EMPIRE WHO FELL IN THE TWO WARS 1914 AND 1939 THEY DIED IN EVERY QUARTER OF THE EARTH AND ON ALL ITS SEAS AND THEIR GRAVES ARE MADE SURE TO THEM BY THEIR KIN THE MAIN HOST LIE BURIED IN THE LANDS OF OUR ALLIES WHO HAVE SET ASIDE THEIR RESTING PLACES IN HONOUR FOR EVER\n|-\n|}\nThe Westminster tablet, originally unveiled in the nave, was later placed on the west wall of the Chapel of the Holy Cross. Located to the south of the West Door, this chapel was intended to be dedicated to those that fell in the war. Sometimes referred to as the Warrior's Chapel, and located close to the Tomb of the Unknown Warrior, it was dedicated in 1932 as St George's Chapel. An inscription below the Empire memorial tablet states that the chapel was completed as a memorial to Field Marshal Lord Plumer. The following year, on Friday 10 November 1933, an annual tradition was started whereby a wreath of flowers from Commission cemeteries in Belgium and France was laid at the base of the tablet by Commission gardeners.\nWriting in 1937 in his report on the 20-year anniversary of the founding of the Commission, Ware stated that the tablets were erected \"that the total losses of the British Empire might thus be visibly recorded\". Similar sentiments had been expressed in a lecture given in 1930 by H. C. Osborne, the Commission's representative in Canada, stating that the memorial tablets \"will serve as perpetual and significant reminders, to all who read, of the part taken by our Empire in the greatest war in history.\" Central to this, and to Ware's life's work establishing and building up the Commission, were the ideals of Empire and the imperial basis for the commemorations. In his 1937 report, also published in book form, Ware declared:These cathedral tablets are the first and only memorials to express in sculptured form the union of the partner nations in the British Commonwealth under one Crown. They have been called the coping-stone of the Commission's work.\nThe wording on the Westminster tablet was changed following the Second World War to include those who fell in that war (the wordings on the Commission's tablets erected in Belgium and France were left unchanged). A further inscription below the tablet in St George's Chapel in the Abbey commemorates Ware himself, who died in 1949. A print of the original tablet is held at the Abbey.\nReplicas and later history\nFollowing the unveiling of the tablet in Westminster Abbey in 1926, requests were made to the Commission for permission to install replicas of the tablet in various locations. In some cases, full-scale copies were produced and installed in churches. In other cases, colour prints of the tablets were distributed to British Legion branches and other ex-servicemen organisations in the UK and abroad. An example of the latter is the framed colour print recorded in the UK National Inventory of War Memorials as being held at a Royal British Legion branch in Liverpool, UK. A similar print was presented by the Imperial War Graves Commission in 1935 to the Legacy Club in Fremantle, Australia, later presented to the city council for safekeeping. A replica of the standard French tablet is installed at the museum (inaugurated in 1986) at the Delville Wood Memorial.\nTwo replicas of the Westminster tablet are maintained by the Canadian Agency of the Commonwealth War Graves Commission. These replicas are located in the Church of the Ascension, Hamilton, Ontario, and in Christ Church Cathedral, Vancouver, British Columbia. The Hamilton tablet, erected by the Royal Hamilton Light Infantry, was unveiled on 2 October 1927 by the former Lieutenant Governor of Ontario, Major General Sir John Morison Gibson. As at the Westminster Abbey service the previous year, the hymn O Valiant Hearts was included in the service. Major General Sydney Chilton Mewburn addressed the congregation before the unveiling, and the memorial tablet was dedicated by the Lord Bishop of Niagara Derwyn Owen. The tablet at Christ Church in Vancouver was agreed after lengthy correspondence between the Commission and the rector, the Reverend Dr Robert John Renison. It was unveiled on the tenth anniversary of the Armistice (11 November 1928) by the Lieutenant Governor of British Columbia Robert Randolph Bruce. A replica of the Westminster tablet was also installed in the Anglican Church of St George in Baghdad, Iraq, in the 1930s.\nAs with the original tablets, those maintaining the replicas had to make a decision after the Second World War whether to leave the wording of the inscription unchanged, or to update the wording. The tablet in Vancouver was updated to include the Second World War period from 1939 to 1945, and then again to include the Korean War period from 1950 to 1953.\n{| class=\"wikitable\" style=\"text-align: center; margin: auto auto\"\n|+ Vancouver tablet and inscription\n!Tablet!!Inscription\n|-\n|||TO THE GLORY OF GOD AND TO THE MEMORY OF COMMONWEALTH MEMBERS OF THE SERVICES WHO GAVE THEIR LIVES 1914 – 1918 1939 – 1945 1950 – 1953 THEY DIED IN EVERY QUARTER OF THE EARTH IN THE AIR AND ON THE SEA \"THEIR BODIES ARE BURIED IN PEACE BUT THEIR NAME LIVETH FOR EVERMORE\"\n|-\n|}\nOver the years since their installation, a number of the Commission's tablets in France and Belgium have required maintenance, restoration or replacement. Some were affected by damp (at Orléans and Laon), and some were damaged during the Second World War (at Rouen, Boulogne and Nantes). The replacement tablets were produced by Reginald Hallward's daughter Patricia Hallward. Another tablet to suffer war damage is the one that was installed in St George's Anglican Church in Baghdad, Iraq. The current church building was erected by the British in 1936 during the period when they controlled the area after the First World War. Worship resumed at the church in 1998 following a 14-year period of neglect. The stained glass windows, and the building itself, were memorials to the British regiments that fought Ottoman forces here in what was then Mesopotamia. Prior to the war in Iraq in 2003, the memorial tablet was faded but undamaged. During the war, the tablet, mounted on the wall of the nave, was damaged by shrapnel. As reported by journalist Robert Fisk in December 2003 and April 2012, parts of the inscription were damaged, with the initial lines and final lines still legible: \"... in honour for ever\".\nNotes and references\n;Transcriptions\n;Notes\n;References\n* Section 9. Memorials Erected by the Commission; Section 10. Memorials Erected By Other Groups Or Individuals.\n**  |title=Archive Catalogue Part 1 Sections 09-10| chapter=Section 9F: Tablets in Cathedrals |pages=215–230}}\n**  |title=Archive Catalogue Part 1 Sections 09-10|chapter=Section 10E: National And Local Memorials in the Dominions And Colonies |pages=267–269}}\n**  |title=Archive Catalogue Part 1 Sections 09-10|chapter=Section 10F: Other British and Dominion Memorials in Theatres of War |pages=271–274}}\n*\n*\n*\n*\n*\n*\n*\nExternal links\n;Photographs of memorial tablets\n* [http://www.ww1westernfront.gov.au/villers-bretonneux/amiens-cathedral/images/amiens-18.jpg Amiens] (Australians on the Western Front 1914–1918); [http://nantescathedrale.free.fr/morts_britanniques.htm Nantes] (La Cathédrale de Nantes); [http://memoiresdepierre.pagesperso-orange.fr/alphabetnew/b/bethuneplaqueeglise.html Béthune], [http://memoiresdepierre.pagesperso-orange.fr/alphabetnew/a/arrasplaquecommonwealth.html Arras] (Mémoires de pierre en Pas-de-Calais – Monuments aux morts du Pas-de-Calais); [http://www.memorialgenweb.org/memorial3/html/fr/resultcommune.php?idsource=133325 Amiens], [http://www.memorialgenweb.org/mobile/fr/resultcommune.php?idsource=132639 Bayeux], [http://www.memorialgenweb.org/mobile/fr/resultcommune.php?idsource=133087 Beauvais], [http://www.memorialgenweb.org/mobile/fr/resultcommune.php?idsource=201388 Boulogne], [http://www.memorialgenweb.org/mobile/fr/resultcommune.php?idsource=201382 Laon], [http://www.memorialgenweb.org/mobile/fr/resultcommune.php?idsource=201381 Meaux], [http://www.memorialgenweb.org/mobile/fr/resultcommune.php?idsource=201383 Nancy], [http://www.memorialgenweb.org/memorial3/html/fr/resultcommune.php?idsource=136007 Nantes], [http://www.memorialgenweb.org/mobile/fr/resultcommune.php?idsource=201621 Notre Dame de Paris], [http://www.memorialgenweb.org/mobile/fr/resultcommune.php?idsource=201385 Noyon], [http://www.memorialgenweb.org/mobile/fr/resultcommune.php?idsource=201386 Orléans], [http://www.memorialgenweb.org/memorial3/html/fr/resultcommune.php?idsource=136585 Saint-Omer], [http://www.memorialgenweb.org/mobile/fr/resultcommune.php?idsource=201384 Soissons], [http://www.memorialgenweb.org/mobile/fr/resultcommune.php?idsource=201387 Reims] (MémorialGenWeb); [https://www.flickr.com/photos/11115747@N03/7150550207 Church of the Ascension, Hamilton], [https://www.flickr.com/photos/24623852@N02/8199827784 Ypres], [https://www.flickr.com/photos/19787482@N04/8175077085 Marseille], [https://www.flickr.com/photos/71547898@N00/443555532 Le Mans] (Flickr); [http://www.awm.gov.au/collection/H13584/ Westminster Abbey] (Australian War Memorial collections)\n;Further reading\n* The Builder, Volume 125, 1923, p.&nbsp;170: \"British War Memorial Tablet, Amiens Cathedral\"\n* Tijdschrift van de West-Vlaamse Gidsenkring Ieper-Poperinge-Westland, Wilfried Beele, Westland Gidsenkroniek, jaargang 2010, nr. 3\n* De gedenkplaat voor de Britse oorlogsdoden in de Sint-Maartenskerk in Ieper, Roger Verbeke, Gidsenkroniek Westland, 1998, nr. 6, pp.&nbsp;191–198.\n* Zij, die vielen als helden, Mariette Jacobs (2 volumes, Brugge, 1996, Uitgave Provincie West-Vlaanderen)\n* [https://web.archive.org/web/20131203001426/http://wo1.webserver.dmenp.be/ned/geschiedenis/gastbijdragen/2010/Sint-Maartenskerk/body.html Nog eens de gedenkplaat voor de Britse oorlogsdoden in de Sint-Maartenskerk in Ieper] (The Great War in Flanders Field)\n* [https://inventaris.onroerenderfgoed.be/woi/relict/1459 Gedenkplaat Commonwealth-doden Sint-Maartenskerk (Ieper – WOI)] (Inventaris Onroerend Erfgoed)\n* [http://memoiresdepierre.pagesperso-orange.fr/alphabetnew/s/saintomer.html St Omer Cathedral], including details of the tablet unveiling (Mémoires de pierre en Pas-de-Calais – Monuments aux morts du Pas-de-Calais)\n* [http://www.ww1westernfront.gov.au/villers-bretonneux/amiens-cathedral/notre-dame-damiens.php Amiens Cathedral], includes details of memorial tablet (Australians on the Western Front 1914–1918)"
    }
  ]
}