{
  "content": [
    {
      "type": "text",
      "text": "# Memorials and monuments to victims of the Titanic\n\nMemorials and monuments to victims of the sinking of the RMS Titanic exist in a number of places around the world associated with Titanic, notably in Belfast, Liverpool and Southampton in the United Kingdom; Halifax, Nova Scotia in Canada; and New York City and Washington, D.C. in the United States. The largest single contingent of victims came from Southampton, the home of most of the crew, which consequently has the greatest number of memorials. Titanic was built in Belfast, Northern Ireland, and had a \"guarantee party\" of engineers from shipbuilders Harland and Wolff aboard all of whom were lost in the disaster and are commemorated by a prominent memorial in the city. Other contingents of engineers aboard the ship came from the maritime cities of Liverpool in England and Glasgow in Scotland, which erected their own memorials. Several prominent victims, such as Titanics captain, were commemorated individually. Elsewhere, in the United States, Australia and Bulgaria, public memorials were erected to commemorate all the victims.\nGreat Britain\nColne\n, Colne]]\nWallace Hartley, the bandleader aboard Titanic, was buried in his home town Colne in Lancashire under a fine headstone engraved with the opening bars of the hymn Nearer, My God, to Thee. The townspeople also erected a monument to him on Albert Road. It was originally intended to be a commemorative drinking fountain until the memorial committee realised that might be inappropriate given that Hartley had drowned. It was therefore decided to erect a bronze bust of Hartley mounted on a plinth. Below the bust, sitting on cornices, are two caped female figures holding lyres in their hands. The original figures were stolen and have been replaced by plastic replicas.\nGlasgow\nA memorial to thirty-six engineers aboard Titanic is located in the offices of the Scottish Opera at 39 Elmbank Crescent, Glasgow – formerly the headquarters of the Institution of Engineers and Shipbuilders in Scotland, whose members funded the memorial. The memorial, designed by Kellock Brown, was unveiled on 15 April 1914. It consists of a marble plaque surmounted by two female nudes bearing a wreath. The dedication states that the memorial's purpose is:\n}}\nThe Glasgow Titanic Engineers' memorial does not include the names of William Duffy (Chief Engineer's Clerk), or of Thomas Andrews (Managing Director of Harland and Wolff, principal designer of the Titanic and leader of the commissioning team on board), both of whom are named on the Titanic Engineers' Memorial, Southampton.\nGodalming\nThe body of Titanics Senior Wireless Operator, Jack Phillips, was never recovered but he is commemorated by a headstone in the shape of an iceberg in the Old Cemetery of Godalming in Surrey. A cloister and garden was built in his memory adjoining the town's Church of St Peter and St Paul. It was dedicated on 15 April 1914 and provided with a fountain donated by the Postal Telegraph Clerks' Association. The inscription reads:\nThis Cloister is Built in Memory of\nJohn George Phillips\nA Native of This Town\nChief Wireless Telegraphist of\nThe Ill-Fated SS Titanic\nHe Died at His Post\nWhen the Vessel Foundered\nin Mid-Atlantic\nOn the 15th Day of\nApril 1912\nThe cloister has been altered over the years in response to vandalism and neglect but was renovated in 1993. Phillips is also commemorated in nearby Farncombe, his home village, where a brass tablet was erected in the Church of St. John the Evangelist.\nLichfield\nTitanics captain Edward Smith is commemorated by a statue in Beacon Park, Lichfield – a town with which he had absolutely no connection, as he had been born in Hanley, Staffordshire and lived in Southampton. Officially the decision was taken because Lichfield was \"about half-way between Liverpool and London [and] would be convenient alike to British and American subscribers [to the memorial's costs]\", and also because it was the cathedral city of the diocese in which the captain had been born. Unofficially it may also have been due to reticence on the part of Hanley's authorities to further commemorate someone who bore a major burden of responsibility for the disaster. Smith had, in any case, already been commemorated in Hanley's Town Hall with a plaque reading:\nEdward John Smith RD, RNR. Born in Hanley, 27th Jany 1850, died at sea, 15th April 1912. Be British.\nWhilst in command of the White Star SS Titanic that great ship struck an iceberg in the Atlantic Ocean during the night and speedily sank with nearly all who were on board. Captain Smith having done all man could do for the safety of passengers and crew remained at his post on the sinking ship until the end. His last message to the crew was \"Be British.\"}}\nThe plaque was removed in 1961, given to a local school and then returned to the Town Hall but remounted in the interior of the building in 1978, illustrating Hanley's continued ambivalence over its most famous local son.\nThe statue of Smith in Lichfield was sculpted by Kathleen Scott, the widow of the Antarctic explorer Robert Falcon Scott. It was unveiled by his daughter, Helen Melville Smith, on 29 July 1914. It attracted some controversy as Smith had been heavily criticised by the British inquiry into the disaster. Several prominent citizens signed a petition opposing the statue but it was rejected, and the unveiling went ahead as planned. However, the placement of the statue suggests that the city council was not entirely comfortable with it; it is not in a particularly visible place, nor is it readily accessible. Most notably, the dedication does not even mention Titanic, instead commemorating Smith for:\nBequeathing to his countrymen the\nMemory and Example of\nA Great Heart,\nA Brave Life, and\nA Heroic Death.\nAfter the wreck of the Titanic was found in 1985 the former ambivalence of both Lichfield and Hanley disappeared as the statue suddenly became a tourist attraction. The words \"Captain Smith was Captain of the Titanic\" were added to its plinth and both Hanley and Stoke-on-Trent made requests for the statue to be moved to their towns. Lichfield refused, telling Stoke that Lichfield \"had been responsible for cleaning the pigeon droppings off the statue for the past seventy years.\"\nLiverpool\nAlthough Titanic never visited her home port of Liverpool, a significant percentage of Titanic's crew members were from Liverpool. The Memorial to the Engine Room Heroes of the Titanic was completed in May 1916 but was not formally dedicated due to the ongoing World War I. It is situated at Pier Head in Liverpool City Centre close to the former White Star Line headquarters. A plaque dedicated to the ship's musicians is located in the city's Philharmonic Hall on Hope Street.\nLondon\nA small Titanic Memorial Garden is located in the grounds of the National Maritime Museum, Greenwich. It was opened in April 1995 by Edith Haisman, at the time one of the oldest living survivors of the disaster. Another memorial plaque hangs in the Institute of Marine Engineers headquarters at 80 Coleman Street, listing thirty-eight names. The memorial is topped by a figure of Triton driving a team of four polar bears. On either side are sculpted figures similar to those on the Engineers' Memorial in Southampton.\nSouthampton\n, Southampton]]\nMost of the victims of the disaster came from the United Kingdom. No town was harder hit than Southampton; of the crew's 918 members, only 213 survived and 539 of those who perished came from Southampton. Many local churches and graveyards have plaques and small memorials to those who died. A year after the disaster, in April 1913, a memorial to the ship's musicians was unveiled but was destroyed by German bombing in World War II. It has since been replaced by a replica situated on the corner of Cumberland Place and London Road.\nThe following April, the Titanic Engineers' Memorial was dedicated in front of 100,000 people. On 27 July 1915, a small memorial fountain made of Portland stone commemorating all of the lost crew members was unveiled on Southampton Common. It became the target of vandalism and was moved into the ruined Holyrood Church in 1972. A memorial to the British postal staff aboard Titanic was located in the Southampton Docks Post Office, then moved to the High Street Post Office, and is now on display outside the Council Chambers at the City's Guildhall.\nThe ship's mainly Italian and French restaurant workers and their boss, Luigi Gatti, all perished in the disaster. They are commemorated by the Gatti Memorial in St Joseph's Church.\nIreland\nIreland, which was part of the United Kingdom at the time of the sinking, had four principal connections with Titanic; she had been built in Belfast, a number of her engineers, designers and crewmen were from northern Ireland, many of her passengers (especially in Third Class) were from southern Ireland and her last port of call was Queenstown (now Cobh) on the south coast of Ireland.\nThe Titanic Memorial in Belfast was unveiled on 26 June 1920 to commemorate twenty-two men from the city who had died in the disaster. Designed by Sir Thomas Brock RA, it was carved from Carrara marble and depicts a personification of Death holding a laurel wreath over the head of a drowned sailor.\nThe Irish Free State (now the Republic of Ireland) had little interest in commemorating the disaster and it was not until 1998 that a Titanic memorial was erected in Cobh. It consists of a bas-relief depicting third-class passenger Margaret Rice and her five sons, all of whom died in the sinking, and bears the dedication: \"Commemorating RMS Titanic and her last port of call on her maiden and final voyage, April 12, 1912\". The town installed a memorial garden to mark the centenary of the ship's sinking.\nWaterford: There is a memorial in the seaside Village of Bunmahon to local man Frank Dewan Who was lost while traveling as a Third class passenger to visit his son in Montana. The memorial is located on the main coast road between Dungarvan and Tramore.\nUnited States\n, Washington D.C.]]\n* The first monument ever erected in memory of the Titanic in America, and possibly the world, was built in the small town of Libertytown, Maryland at St. Peter the Apostle Catholic Church. The Church at the time was beautifying their church cemetery by building a calvary crucifixion scene. When news of the disaster reached Libertytown, the monument was dedicated to the victims of the Titanic on April 19, 1912, just one day after the first reports that the ship had sunk.\n* An inscribed plaque in the Boston Symphony Hall commemorates Titanics musicians with the dedication: \"In memory of the devoted musicians who were drowned still playing as the Titanic went down, 15 April 1912\".\n* Two Titanic memorials stand in New York. On 13 April 1913, the  Titanic Memorial Lighthouse was constructed on the roof of the Seamen's Church Institute headquarters at 25 South Street in downtown Manhattan. It was later moved to a new location in the South Street Seaport area.\n*  Straus Park in Morningside Heights commemorates Isidor Straus and his wife Ida, who both died in the disaster. The centrepiece of the park is the Isidor and Ida Straus Memorial, erected in 1915 to commemorate the couple. Its dedication reads: \"Erected by voluntary contributions from many fellow citizens and accepted for the City of New York by Mayor John Purroy Mitchel and Cabot Ward, Commissioner of Parks. AD MCMXV.\"\n* The Straus cenotaph in Woodlawn Cemetery was designed by James Gamble Rogers and created by Lee Lawrie as an art deco version of an Egyptian funeral barge in 1928.\n* The Titanic Memorial in Washington, D.C. stands next to the Washington Channel near Fort Lesley J. McNair. It stands  high and depicts a male figure with arms outstretched. The memorial was unveiled on 26 May 1931 by Helen Herron Taft, the widow of President William Howard Taft, who held office at the time of the disaster and whose military aide Major Archibald Butt died in the sinking. It originally stood in Rock Creek Park before being moved to its current site on P Street SW in 1968.\n* The Butt-Millet Memorial Fountain is a memorial fountain located in the President's Park in Washington, D.C. Dedicated in October 1913, it commemorates the deaths of Archibald Butt (the military aide to President William Howard Taft) and Francis Davis Millet (a journalist and painter, and Butt's close friend and housemate), both of whom died during the sinking.\n* The 106 passengers on the Titanic who were heading to Pennsylvania are memorialized on a park bench near Audubon, Pennsylvania. This bench is located along the Schuylkill River Trail where it is met by the Pawlings Road Trailhead.\nAustralia\nTwo memorials to Titanics musicians were erected in Australia. The local bandsmen of the outback mining town of Broken Hill, New South Wales erected the Titanic Musicians' Memorial, dedicated on 21 December 1913 and funded by the Amalgamated Miners Association Band. Its dedication declares that it was \"Erected by the Citizens of Broken Hill as a memorial to the heroic bandsmen of the steamship Titanic who, playing to the end, calmly faced certain death whilst women, children and their fellow-men were being rescued from the wreck of that ill-fated vessel off the coast of Newfoundland on the 15th April 1912\".\nAnother memorial dedicated to their memory was The SS Titanic Memorial Bandstand erected in 1915 in Ballarat, Victoria. Designed by George Clegg and funded by the Victorian Band Association at a cost of £150, it stands in the Sturt Street Gardens in front of the Mechanics Institute. The structure is an unusual example of Edwardian bandstand design with multiple oriental-style roofs.\nCanada\nMost of the bodies recovered after the disaster were buried in Halifax, Nova Scotia. 150 are buried in three cemeteries: Fairview, with 121, Mount Olivet, with nineteen, and Baron de Hirsch, with ten. A simple headstone of black granite marks most graves, recording only the victim's name (if known) or the number of the body if the name was not known, and the date 15 April 1912. Exception were made if friends or relatives wanted to erect a more elaborate headstone at their own expense; one such example is that of the grave of the Titanics chief steward, Ernest Freeman, whose headstone was donated by the White Star Line's chairman J. Bruce Ismay. The graves are still maintained under a trust established by the White Star Line.\nBulgaria\nThere is a monument in the churchyard of the small Bulgarian village of Gumoshtnik, the birthplace of 8 of the 38 Bulgarian victims.\nNotes\nBibliography\n;Books\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n; Other sources\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}"
    }
  ]
}