{
  "content": [
    {
      "type": "text",
      "text": "# Memorial Hall (Delaware State)\n\n| location = Dover, Delaware\n| coordinates =\n| broke_ground =\n| opened =\n| closed =\n| owner = Delaware State University\n| operator = [http://www.dsuhornets.com Delaware State University Department of Athletics]\n| surface =\n| construction_cost =\n| architect =\n| tenants = Delaware State Hornets (NCAA)Men's BasketballWomen's BasketballWomen's Volleyball\n| seating_capacity = 1,800\n| publictransit =  DART First State bus: 109, 112, 301\n}}\nMemorial Hall is a 1,800-seat multi-purpose arena in Dover, Delaware. It is home to the Delaware State University Hornets men's and women's basketball teams and women's volleyball team.\nHistory\nMemorial Hall was constructed in the mid-1950s as a multipurpose gymnasium on the main campus of Delaware State University (then Delaware State College). The arena was built with state funding during a post-war campus expansion led by DSU President Jerome H. Holland. Originally a pre-engineered “Butler” building, it had a seating capacity of about 1,800 from the outset. An addition to Memorial Hall was completed in the early 1980s to expand the gymnasium’s facilities. Since 1982, the Hall has served as the full-time home court for DSU’s NCAA Division I basketball teams. The building’s name, “Memorial Hall,” reflects its status as a war memorial facility (honoring Delaware State students’ service), a common naming tradition for mid-20th-century campus buildings.\nFacilities & Design\nMemorial Hall is a relatively small and simple venue by Division I standards. It features bleacher-style seating on all four sides of the court, with an official capacity of 1,800 spectators. The design is often likened to a large high school gymnasium – there is no true concourse, and upon entry one steps directly into a corner of the arena.\nKey Features and Amenities\nA standard NCAA hardwood floor (named Bayhealth Court under a corporate partnership) is used for basketball and volleyball games. Seating consists of tiered bench bleachers without individual chair-back seats, creating an intimate but utilitarian environment.\nThe arena houses home and visiting locker rooms and doubles as a training hub for DSU athletics. In fact, the university’s main strength & conditioning center for athletes is located inside Memorial Hall. However, many facilities are dated or small; an architectural study in 2016 noted the need for enlarged locker rooms and VIP spaces to modernize the arena.\nPermanent concessions are minimal. A review in 2022 noted no fixed concession stands – only a simple table offering basic items (hot dogs, snacks, drinks) – and advised fans to eat before or after games. Restroom and lobby areas are limited, consistent with the building’s age and original design. There is a scoreboard and PA system, but otherwise few frills.\nOverall, Memorial Hall’s layout and amenities are quite basic, which contributes to a loud, close-quarters atmosphere but also some discomfort for spectators. The crowd is essentially “on top of” the court, which can energize games but leaves little space for concourses or circulation. The small capacity means the gym can fill up quickly; on some occasions students have been turned away once the venue reached capacity.\nTenants\nMemorial Hall is the home court for the Delaware State Hornets men’s and women’s basketball teams, as well as the DSU women’s volleyball team. All three teams compete at the NCAA Division I level (MEAC conference). The venue also hosts other campus and community events, such as high school tournaments, recreational sports, and university ceremonies. For example, DSU traditionally holds its annual freshman convocation in Memorial Hall, with around 1,600 new students attending the ceremony in the gym.\nAtmosphere and Crowds\nDespite its small size, Memorial Hall has developed a reputation for an energetic game atmosphere. The combination of pep band, cheerleaders, and loyal fans in a tight space creates high noise levels. Rivalry games – such as contests against nearby University of Maryland Eastern Shore – are often sellouts where the intensity is especially high. During the Hornets men’s basketball program’s peak years in the mid-2000s (when DSU won the MEAC title and made its first NCAA Tournament appearance in 2005), Memorial Hall saw standing-room-only crowds. Its capacity of 1,800 is one of the smallest for any Division I basketball arena in the nation, which means big games can overflow the building. (By comparison, most MEAC peer schools’ arenas hold 3,000–5,000, and major-conference programs often play in 10,000+ seat venues.) The intimacy can be a double-edged sword: it yields a loud home-court advantage, but it also limits ticket revenue and comfort. Local media have described Memorial Hall as “old, cramped and out of date,” underscoring that it falls short of modern Division I arena standards.\nNotable Games & Events\nA number of memorable moments have occurred in Memorial Hall over the years:\nConference Championships\nIn November 2024, Delaware State hosted the MEAC Volleyball Championship in Memorial Hall, where the No.3-seeded Lady Hornets upset No.1 Howard in a dramatic five-set final to claim the conference title. The home crowd’s energy was noted as a factor (“as electric as the crowd in Memorial Hall Gymnasium”) during the championship match. This marked DSU volleyball’s second MEAC championship in three seasons and took place on the Hornets’ home floor.\nPostseason Appearances\nThe Hornet men’s basketball team has earned NIT and CBI postseason bids that resulted in games at Memorial Hall. Notably, DSU’s first-ever postseason victory – a 58–53 win over Northern Arizona in the 2006 NIT Opening Round – was celebrated by fans in Memorial Hall (though the game itself was played on the road). (Note: DSU’s home NIT games were limited by seeding; Memorial Hall has not hosted an NCAA Tournament game.) Still, the arena was the site of victory celebrations when DSU clinched the 2005 MEAC Tournamentchampionship and NCAA bid (via a viewing party and pep rally).\nOther Uses\nBeyond athletics, Memorial Hall is used for various DSU events. The university’s marching band and spirit squads often use the facility for indoor practice. The gym has hosted career fairs, student assemblies, and community gatherings. During the COVID-19 pandemic, it even served as a site for socially-distanced academic functions. In partnership with Bayhealth (a regional health system), the arena has been the venue for annual “Ballin’ for Blood” community blood drives, leveraging the Bayhealth Court naming sponsorship. These examples highlight that Memorial Hall, while primarily a sports venue, also functions as a community and campus multipurpose hall.\nPlanned Upgrades and Replacement\nDelaware State University has recognized that Memorial Hall’s small size and age are limiting factors as the athletics program and student population grow. University leadership has articulated ambitious plans to build a modern convocation center to eventually replace Memorial Hall. In 2024, DSU launched an “Athletics Transformation” initiative, and by mid-2025 the Delaware state legislature approved $20 million in initial funding toward a new indoor field house facility on campus. Along with that, lawmakers included language supporting the development of a future convocation center/arena for DSU. This proposed convocation center would host the basketball and volleyball teams, plus add capacity for wrestling matches, commencement ceremonies, concerts, and other large events. Essentially, it aims to provide DSU with a first-class, higher-capacity arena that Memorial Hall cannot offer.\nPreliminary estimates peg the new arena project at roughly $90 million cost. As of 2025 there is no construction timeline set, but the university has been exploring options for at least a decade to make it a reality. DSU President Tony Allen and Athletic Director Tony Tucker have been making the case that upgraded facilities are critical as the university expands. (DSU’s enrollment hit a record 6,451 in Fall 2023 and is “on track to reach 10,000 students by the end of the decade,” a goal that will require expanded infrastructure.) A larger convocation center would allow the entire student body to gather for events like orientation or graduation – something not possible in 1,800-seat Memorial Hall.\nUniversity officials also emphasize the broader impact of a new arena. AD Tony Tucker noted that Dover’s central location in Delaware means a modern venue could become a hub for state high school tournaments and regional events, sparing local families long drives to the northern part of the state. In 2024, DSU demonstrated this potential by hosting the Delaware high school football championship in its Alumni Stadium, and a convocation center could similarly attract basketball championships or other neutral-site games. The envisioned arena would offer amenities on par with peer institutions – modern seating, ample locker/training facilities, premium seating or lounges, and improved concessions and bathrooms – addressing the shortcomings of Memorial Hall.\nPublic and Media Commentary\nThe plan to replace Memorial Hall has been driven in part by long-standing criticism of the current gym’s adequacy. Alumni and observers have called Memorial Hall “old, cramped and out of date,” arguing that it hampers DSU’s competitiveness and fan experience. One alumnus journalist recounted the “struggle to get to and from the bathroom” in the packed arena as a student reporter, expressing that “anything to replace the Memorial Hall gym would be great”. Such sentiments reflect a common view that DSU has outgrown the facility. Even neutral reviewers note that Memorial Hall, while quaint and spirited, is essentially a throwback with limited comfort and capacity. In short, the university sees a new convocation center as a crucial step in its growth – both to better serve its students and teams, and to present a more modern image for DSU Athletics.\nUntil a new arena is built, Memorial Hall remains in use as one of Division I’s smallest home courts. DSU has made minor upgrades over time (such as new flooring, lighting, and the Bayhealth partnership for athletic training services), but the core structure is the same as in the mid-20th century. Plans are being developed carefully to secure funding without diverting from academic priorities, a balance DSU officials insist upon. As of the 2025–26 season, fans and players continue to pack Memorial Hall for Hornet games, even as they look forward to the possibilities a new convocation center will bring in the future.\nSee also\n* List of NCAA Division I basketball arenas\n* Delaware State Hornets Men's Basketball Team\n* Delaware State Hornets Women's Basketball Team\nReferences"
    }
  ]
}