{
  "content": [
    {
      "type": "text",
      "text": "# Men of War (comics)\n\n| artists =\n| pencillers =\n| inkers =\n| colorists =\n| editors =\n| creative_team_month =\n| creative_team_year =\n| creators =\n}}\nMen of War is the name of several American comic book series published by DC Comics. For the most part, the series was a war comics anthology featuring fictional stories about the American military during World War II.\nThe original series, All-American Men of War, published 118 issues from 1956 to 1966. Contributors to All-American Men of War included writers Robert Kanigher, Hank Chapman, and France Herron; and artists Alex Toth, Gene Colan, Mort Drucker, Mike Esposito, Jerry Grandenetti, Sheldon Moldoff, Russ Heath, Bernard Krigstein, Joe Kubert, and Irv Novick. Pop artist Roy Lichtenstein's famous 1963 work Whaam! is based on a panel by Grandenetti from the cover of All-American Men of War #89 (January–February 1962).\nA second series, simply titled Men of War, published 26 issues from 1977-1980. Regular contributors included writers Kanigher, Roger McKenzie, Cary Burkett, Jack C. Harris, and Paul Kupperberg; and artists Grandenetti, Dick Ayers, and Howard Chaykin. Joe Kubert provided the cover art for the full series run except issue #1.\nA third series, also titled Men of War starred Sgt. Rock and was published from November 2011 - June 2012.\nPublication history\nAll-American Men of War\nAll-American Men of War did not start with issue #1; it was a renaming of the 1948 series All-American Western, which itself was a renaming of the 1939 series All-American Comics. The title became All-American Men of War with issue #127, published in August–September 1952. All-American Men of War published two issues before rebooting the numbering with issue #2 in December 1952–January 1953. All-American Men of War #35 (July 1956) featured the first painted cover on a DC comic book.\nOne of the earliest known examples of pop art, Roy Lichtenstein's Whaam! adapted a panel from a story titled \"Star Jockey\", from All-American Men of War #89 (January–February 1962), drawn by Irv Novick. The painting depicts a fighter aircraft, the North American P-51 Mustang, firing a rocket into an enemy plane, with a red-and-yellow explosion (in the source comic the aircraft is a North American F-86 Sabre). The cartoon style is heightened by the use of the onomatopoeic lettering \"Whaam!\" and the yellow-boxed caption with black lettering. Lichtenstein used other artwork from this series for other works, including Brattata and Bratatat!.\nThe All-American Men of War letters page was titled \"Combat Corner\".\nMen of War\nAfter eleven years, the series returned with the shortened title Men of War. It was published for 26 issues from August 1977–March 1980.\nMen of War vol. 2\nMen of War vol. 2 was launched in 2011 as part of The New 52 initiative; the series was written by Ivan Brandon. In 2012, DC canceled Men of War following its eighth issue, along with other six titles, to be replaced by a \"second wave\" of six new titles.\nRecurring characters and features\nAll-American Men of War\n* Khaki-Yaks — Humorous one-pagers by Irwin Hasen were a regular feature of early issues, beginning in #10 (April - May 1954).\n* Gunner and Sarge — Introduced by writer Robert Kanigher and artist Ross Andru in issue #67 (March 1959), this was one of the first recurring features in war comics, although most of their adventures took place in Our Fighting Forces (issues #45–94, May 1959 - August 1965).\n* Tank Killer — This feature appeared in issue #69, 71–72, and 76.\n* Johnny Cloud — A Native American World War II P-51 Mustang pilot, Johnny's adventures were told by Robert Kanigher and Irv Novick. The \"Navajo Ace\" appeared in every issue from #82 to the end of the series (Nov./Dec. 1960 – Sept./Oct. 1966). Johnny Cloud, with Gunner and Sarge, later became part of The Losers, a team which in the late 1960s and early 1970s was the main feature of Our Fighting Forces.\n* Lt. Savage, the Balloon Buster — A World War I aviation strip written by Robert Kanigher and drawn by Russ Heath, which was conceived as a counterpoint to the German Enemy Ace. Steve Savage appeared in issues #112-114, and 116. Later continuity established that Lt. Savage was the son of Brian Savage, a.k.a. Scalphunter, as well as the grandson of Matt Savage, Trail Boss, a recurring character from the 1948–1961 series Western Comics.\nMen of War\n* Gravedigger — The codename of Captain Ulysses Hazard, the character debuted in Men of War #1 (Aug. 1977), and was created by David Michelinie and Ed Davis. Gravedigger was featured in every issue of Men of War.\n* Enemy Ace — A regular feature of Men of War, Hans von Hammer appeared in about half of the 26 issues.\n* Dateline: Frontline — Cary Burkett's feature about a war correspondent appeared in issues #4-6, 9-11, and 21-23, before moving over to Unknown Soldier.\n* Rosa Master-Spy — Paul Kupperberg's feature appeared in issues #17-18 and 24-25.\nMen of War vol. 2\n* Sgt. Rock — Stories of military action following the devastation of Earth by super-powered beings.\nCollected editions\n{| class=\"wikitable sortable\"\n|-\n!width=455|Title\n!width=225|Material collected\n!width=115|Year\n!width=115|ISBN\n|-\n| Showcase Presents: Men of War\n| align=\"center\"|Men of War #1&ndash;26\n| align=\"center\"|January 2014\n| align=\"center\"|\n|-\n| Men of War Vol. 1: Uneasy Company\n| align=\"center\"|Men of War vol. 2 #1&ndash;8\n| align=\"center\"|July 2012\n| align=\"center\"|\n|-\n| Frankenstein Agent of S.H.A.D.E. Volume 2: Secrets of the Dead\n| align=\"center\"|Men of War vol. 2 #8, Frankenstein, Agent of S.H.A.D.E. #0, #8-16\n| align=\"center\"|April 2013\n| align=\"center\"|\n|}\nReferences\nExternal links\n*\n*\n*\n* [http://www.coverbrowser.com/covers/all-american-men-of-war All-American Men of War] at Cover Browser\n* [https://www.mikesamazingworld.com/main/features/series.php?seriesid=52 All-American Men of War], [https://www.mikesamazingworld.com/main/features/series.php?seriesid=1419 Men of War] and [https://www.mikesamazingworld.com/main/features/series.php?seriesid=7864 Men of War vol. 2] at Mike's Amazing World of Comics\n* [https://www.flickr.com/photos/deconstructing-roy-lichtenstein/page6/ Flickr.com Deconstructing Lichtenstein]\n* [https://web.archive.org/web/20071015051127/http://www.lichtensteinfoundation.org/3163.htm The Roy Lichtenstein Foundation: Jet Pilot]"
    }
  ]
}