{
  "content": [
    {
      "type": "text",
      "text": "# Meonwara\n\nThe Meonwara were one of the tribes of Anglo-Saxon Britain. Their territory was a folkland located in the valley of the River Meon in Hampshire that was subsumed by the Kingdom of Wessex in the late seventh century.\nEtymology\nIn the 8th century the Venerable Bede referred to the Saxon and Jutish settlers that were living in the valley of the River Meon as  (Meon People) and described the area as Provincia Meanwarorum (Province of the ). The origin of the name   and its  meaning is not known for sure, but possibly thought to be Celtic or Pre-Celtic for 'swift one'.\nBackground\nDuring the period after the Roman occupation and before the Norman conquest, people of Germanic descent arrived in England. Bede recorded the event in his Ecclesiastical History of the English People. He said that:\n}}\nIt is likely that the Jutes initially inhabited Kent () and from there they occupied the Isle of Wight () and also possibly the area around Hastings in East Sussex (Haestingas). They also settled in what was to become . As well as Bede's description, there is other evidence of Jutish occupation. Droxford, in the Meon valley, was the site of a large Jutish cemetery. Also one of the local manors had the medieval custom of gavelkind, similar to that in Kent. Further there is placename evidence, linking Kent and Southern Hampshire. In 686, Bede tells us, Jutish Hampshire extended to the western edge of the New Forest; however that seems to include another Jutish people, the Ytene, and it is not certain that these two territories formed a continuous coastal block.\nAccount in the Anglo-Saxon Chronicle\nThe Anglo-Saxon Chronicle records a series of landings by Anglo-Saxon settlers, during the years 449–514, in the area that became Meonwara.}} According to the Anglo-Saxon Chronicle the founders of  were a man named Port and his two sons Bieda and Maegla. Most academics regard this as legend rather than fact.}} Also the listed names may not be of Germanic origin, and Maegla appears to be a Brythonic word meaning \"chief\" or \"prince\" (i.e. cognate with Old British maglos, Welsh mael and the Breton given name Maël).\nThe West Saxons\nThe origins of the Kingdom of Wessex are unclear. The Chronicle has a foundation story, regarded by most as legend, that describes how Cerdic and his son Cynric landed in southern Hampshire in 495, and settled the area that became occupied by the West Saxons. Historians however are sceptical of this version.\nMost academics believe that initially the West Saxon royal house ruled over the Gewisse and their power base was in the upper Thames Valley. The missionary bishop Birinus established the episcopal see at Dorchester-on-Thames in the 630s. The history of the Gewisse is quite obscure before the arrival of Birinus, but there were probably several West Saxon groups in the upper Thames Valley and Wiltshire.\nThe Mercians\nThe West Saxons' neighbours to the north were the Mercians. In the 7th century Mercian power was in the ascendent, so the West Saxons could not expand northwards. This led them to concentrate on the lands beyond their southern borders. Wulfhere of Mercia advanced into southern Hampshire and the Isle of Wight in about 681. Shortly afterwards he gave the Isle of Wight and Meonwara to  Æthelwealh of Sussex, possibly as a present after Æthelwealh was baptised and married Eafe the daughter of Eanfrith, a ruler of the Christian Hwicce people. The alliance between the South Saxons and the Mercians and their control of southern England put the West Saxons under pressure.\nWest Saxon takeover\nAfter Wulfhere's death Mercian power eventually declined, and there followed a time of relative peace. However the united Gewisse, now known as the Kingdom of Wessex, became resurgent under their king Caedwalla. Caedwalla, probably concerned at Mercian and South Saxon influence in Southern England, conquered the land of the South Saxons and took over the Jutish areas in Hampshire and the Isle of Wight, in the late 680s. Bede describes how brutally Caedwalla suppressed the South Saxons and slaughtered the people of the Isle of Wight and replaced them with people from \"his own province\". }} Although quite young, Caedwalla abdicated shortly after this campaign and in 689 went on pilgrimage to Rome to be baptised, but died}} about a week after his baptism. Bede says that he had received wounds during the fighting on the Isle of Wight, which may have led to his untimely death.\nThe subsequent establishment of the very large trading settlement of Hamwic suggests that control over the Solent was a further factor motivating the conquest of the Jutish areas.\nWith the takeover of Jutish lands by the West Saxons in Hampshire, the church of SS Peter and Paul, Winchester, built by Cenwalh of Wessex in 648, became the new episcopal see in the 660s.\nOther settlers\nThe settlement of Exton, on the west bank of the Meon, is named after the East Saxons, indicating some sort of settlement or other form of influence from that people. The first surviving record of the name is from 940}} as East Seaxnatune.}}}}\nSee also\n* Haestingas\nNotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.saxonsinthemeonvalley.org.uk Saxons in the Meon Valley]"
    }
  ]
}