{
  "content": [
    {
      "type": "text",
      "text": "# Mer Island, Queensland\n\n| pop                 = 406\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4875\n| area                = 4.1\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 212\n| dir1                = ENE\n| location1           = Thursday Island (direct)\n| dist2               = 797\n| dir2                = NNW\n| location2           = Cairns (direct)\n| dist3               = 2160\n| dir3                = NNW\n| location3           = Brisbane (direct)\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Torres Strait Island Region\n| stategov            = Cook\n| fedgov              = Leichhardt\n| near-n              = Coral Sea\n| near-ne             = Coral Sea\n| near-e              = Coral Sea\n| near-se             = Coral Sea\n| near-s              = Waua Islet\n| near-sw             = Dowar Islet\n| near-w              = Coral Sea\n| near-nw             = Coral Sea\n}}\nMer Island (also known as Murray Island or Maer Island) is a locality and island in Murray Island Group of the Torres Strait Island Region, Queensland, Australia. In the , Mer Island had a population of 406 people.\nThe town is on the island's northwest coast. The island is of volcanic origin, the most easterly inhabited island of the Torres Strait Islands archipelago, just north of the Great Barrier Reef. The name Meer/Mer/Maer comes from the native Meriam language. The island is populated by the Melanesian Meriam people. There are eight tribes on Mer: Komet, Zagareb, Meuram, Magaram, Geuram, Peibri, Meriam-Samsep, Piadram/Dauer. The island's organisation is based on traditional laws of boundary and ownership.\nGeography\nMurray Island, in the eastern section of Torres Strait, is a basaltic island formed from an extinct volcano, last active over a million years ago. It formed when the Indo-Australian Plate slid over the East Australia hotspot. The island rises to a plateau  above mean sea level.\nThe island's highest point is the  Gelam Paser, the western end of the volcano crater. The island has red fertile soil and is covered in dense vegetation. It has a tropical climate with a wet and dry season.\nMurray Island is one of the three islands in the Murray Islands, the others being Daua Island (Dowar) and Waier Island (Waier).\nThe town of Murray Island is on the island's northwest coast ().\nHistory\nPre-European settlement\nMurray Island has been inhabited for around 2,800 years, the first settlers being Papuo-Austronesians who brought agriculture and pot-making with them. Regular contact between the inhabitants of Torres Strait, Europeans, Asians and other outsiders began once the Torres Strait became a means of passage between the Indian Ocean and the Pacific Ocean in the 19th century.The inhabitants of the Torres Strait, including the Meriam people, gained a reputation as fierce warriors and skilled mariners. Warfare (both intertribal and against European ships in transit through the Coral Sea) and head hunting were part of Torres Strait Islanders' culture. The account of Jack Ireland, a surviving cabin boy from the Charles Eaton, a barque that was wrecked in 1834 at Detached Reef, near the entrance to Torres Strait, is of interest in this respect. Ireland and another young survivor, William D'Oyley, spent much of their time on Mer before being rescued.\nIn 1836 a large ceremonial mask was recovered from neighbouring Aureed (Skull) Island after Ireland and D'Oyley were rescued returned to Sydney. The mask was made of turtle shells surrounded by numerous skulls, 17 of which were determined to have belonged to the crew and passengers of the Charles Eaton, who were massacred when they came ashore after the shipwreck. The mask was entered into the collection of the Australian Museum after the skulls were buried on 17 November 1836 in a mass grave in the Devonshire Street Cemetery in Sydney. A monument was erected in the form of a huge altar stone to record the manner in which they died. When the Devonshire Street Cemetery was resumed for the site of the Central Railway Station in 1904 the skulls and the monument were removed to Bunnerong Cemetery at Botany Bay in Sydney.\nPost-European settlement (1872)\nMissionaries (mainly Polynesian) and some other Polynesians began to settle the island in 1872 when the London Missionary Society founded a missionary school there. The Queensland Government annexed the islands in 1879. The Australian painter Tom Roberts visited the island in 1892. He witnessed a nighttime dance and depicted it in a painting.\nFrom 1896 to 1903, it was under the control of the Department for Public Instruction and was known as Murray Island Provisional School. From 1904, it became the responsibility of various other government departments. It returned to the control of the Department of Education on 29 January 1985 as Murray Island State School. It was renamed in October 1990 as Mer State School, becoming the Mer Campus of the Tagai State College on 1 January 2007.\nIn 1936, a maritime strike fuelled by Islander dissatisfaction with the management of their wages and boats by the Protector of Aborigines allowed Islanders to assert control and reject government controls. In 1937, the inaugural meeting of Island Councillors on Yorke Island resulted in the Torres Strait Islander Act 1939, giving Islanders more authority in their own affairs and establishing local governments on each island.\nAfter the Pacific War broke out in 1941, over 700 Islanders volunteered to defend the Torres Strait. This group was organised into the Torres Strait Light Infantry Battalion. The migration of Islanders to mainland Australia increased as jobs disappeared in the pearling industry. A call for independence from Australia in the 1980s arose as the government failed to provide basic infrastructure on the island.\nMurray Island's most famous resident was trade unionist Eddie Mabo, whose decision to sue the Queensland Government to secure ownership of his land, which had been removed from his ancestors by the British colonial powers using the terra nullius legal concept, ultimately led the High Court of Australia, on appeal from the Supreme Court of the State of Queensland, to issue the \"Mabo decision\"  on 3 June 1992, finally recognising Mabo's native title rights on his land. The decision continues to have ramifications for Australia. Mabo himself died a few months before the decision. After vandalism to his grave site, he was reburied on Murray Island, where Islanders performed a traditional ceremony for the burial of a king.\nDemographics\nIn the , Mer Island had a population of 450 people.\nIn the , Mer Island had a population of 406 people.\nEducation\nMer Campus is a primary (Early Childhood-6) campus of Tagai State College  on an unnamed road at .\nThere are no secondary schools on Mer Island. The secondary campus of Tagai State College is on Thursday Island over  away. Boarding facilities are available on Thursday Island.\nCulture\nThe people of Mer maintain their traditional culture. Modern influences such as consumer goods, television, travel and radio are having an impact on traditional practices and culture. Despite this, song and dance remains an integral part of island life and is demonstrated through celebrations such as Mabo Day, Coming of the Light, Tombstone openings and other cultural events. In 2007, after two years of negotiations, the skulls of five Islander tribesmen were returned to Australia from a Glasgow museum where they had been archived for more than 100 years.\nThe artist Ricardo Idagi was born on Murray Island. Idagi won the main prize at the Western Australian Indigenous Art Awards in 2009.\nLanguage\nThe people of Murray Island speak Torres Strait Creole and Meriam, a member of the Eastern Trans-Fly languages of Trans–New Guinea; its sister languages being Bini, Wipi and Gizrra. Though it is unrelated to Kalaw Lagaw Ya of the Central and Western Islands of Torres Strait, the two languages share around 40% of their vocabulary. Torres Strait English is a second language.\nGovernance\nMurray Island is governed by the Community Council, which is responsible for roads, water, housing and community events. The Community Council is an integral part of community life. The elders of the community hold a position of respect and also have a major influence on island life.\nQueensland's control was moved from just 3 miles, to a large 60 miles offshore. This brought all of Torres Strait that were within a couple hundred metres of New guineas coast, into Queensland.\nThe laws rose from requests from the public, who were asking for the lease of islands Queensland's coast. As before this, all islands that were within three miles of the coast, were under Queensland's control. Murray island waited unclaimed until 1879. In 1879, Britain annexed the island to Queensland. The reason for annexation was to protect the British and their property, control the Torres Strait and sea lane to India, dominate fishing and pearling industries and to extend authority to some non-British areas.\nBritain also gave all control of Torres Strait islands to Queensland, with no negotiating treaties, in order to avert enemy colonial powers claiming the region.\nNotable people\n* Eddie Mabo, Indigenous Australian campaigner for Indigenous land rights\n* Gail Mabo, artist, daughter of Eddie\n* Albert Proud, Australian rules footballer with the Brisbane Lions, born on Mer Island.\nSee also\n* List of Torres Strait Islands\n* List of volcanoes in Australia\n* Murray Island Airport\nReferences\nFurther reading\n*  — full text online\nExternal links\n*[https://web.archive.org/web/20090625111909/http://www.humanrights.gov.au/social_justice/index.html Aboriginal and Torres Strait Islander Social Justice Commissioner], [http://www.humanrights.gov.au/social_justice/sj_report/index.html Social Justice Reports 1994–2009] and [http://www.humanrights.gov.au/social_justice/nt_report/index.html Native Title Reports 1994–2009] for more information about Aboriginal and Torres Strait Islander affairs"
    }
  ]
}