{
  "content": [
    {
      "type": "text",
      "text": "# Meredith Howard Harless\n\nMeredith Howard Harless (born Florence Meredith Howard; September 6, 1909 – June 19, 1996) was a performer, Miss America contestant, writer, and broadcaster.\nEarly years\nThe daughter of Samuel J. and Florence Howard, Harless was born in Bartlesville, Oklahoma. She had three siblings: William, Mary, and her twin sister, Virginia. She and Virginia tied for first place at the 1927 Miss Tulsa beauty pageant. Meredith was chosen by a coin toss to advance to the 1928 Miss America pageant, where she was a runner-up. Harless spent the next five years as a performer with the Ziegfeld Follies.\nCareer\nIn 1935, Harless joined Metro-Goldwyn-Mayer in Hollywood, California, working both as a model and in the public relations department. From 1937 to 1941, Harless took a job with Crowell-Collier publishing in Washington, D.C. in their advertising department. In addition to her work in advertising, Harless wrote the syndicated columns Selective Tuning (under the name pen name Jean Abbey) and At Random on the Washington, D.C. social scene and women's fashion.\nHarless joined the Hecht Broadcasting Company at the start of World War II, and broadcast the third inauguration of Franklin D. Roosevelt in 1940. She also had a radio program called News and Personalities in the News. She married Arizona Congressman Richard F. Harless on November 28, 1948, and moved to Arizona, where she helped with his campaign for governor and worded at KTAR radio.\nIn 1949 she was the producer and a commentator on the show A Look Behind the News for CBS Radio in Phoenix. She also appeared on various local radio and television programs, including Arizona Close-Ups for NBC and Arizona Caravan for ABC.\nIn 1950, she resigned from her position as public relations director for KPHO-TV in Phoenix to help her husband with his campaign to be the Democratic nominee for governor.\nIn 1949, Harless and Ellsworth M. Statler bought a 504-acre thoroughbred horse ranch from Louis B. Mayer for $1 million.\nCharitable work\nDuring World War II, Harless helped sell war bonds and worked with the Civilian Defense Home Hospitality Committee, Russian War Relief Committee, and the Stage-Door Canteen. In addition to her wartime charitable work, she was a co-founder of the United Nations Club in December 1941. She later served as national vice president of the Salvation Army and worked with several other charitable organizations and local community efforts until her death on June 19, 1996, at the age of 86.\nAwards\n* 1951: '''Arizona's Outstanding Woman'''\nPersonal life\nIn 1928, she married Albert Spurlock, a coach, in a union that was later annulled. A 1933 newspaper item reported that the marriage \"lasted only a half hour.\"\nIn 1934, she married Albert Russell Erskine Jr. (son of the former Studebaker president). She divorced him in 1937.\nShe married Rep. Richard Harless November 28, 1948, in Alexandria, Virginia.\nReferences\nExternal links\n*"
    }
  ]
}