{
  "content": [
    {
      "type": "text",
      "text": "# Merrimack Warriors women's ice hockey\n\n]]\n|image = Merrimack Warriors.svg\n|image_size = 200px\n|university = Merrimack College\n|sex                   = women's\n|conference = Hockey East\n|conference_short = Hockey East\n|location = North Andover, Massachusetts\n|coach = Erin Whitten Hamlen\n|coach_year = 7th\n|coach_wins = 57\n|coach_losses = 145\n|coach_ties = 22\n|arena = J. Thom Lawler Rink\n|NCAAchampion =\n|NCAAfrozenfour =\n|NCAAtourneys =\n|conference_tournament =\n|conference_season =\n|uniform_image =\n}}\nThe '''Merrimack Warriors women's ice hockey''' team is a National Collegiate Athletic Association (NCAA) Division I women's college ice hockey program. The Warriors are a new member of Hockey East. They play at the 2,549-seat J. Thom Lawler Arena in North Andover, Massachusetts.\nHistory\nThe women's ice hockey program began play in the 2013–14 academic year. The team initially played an American Collegiate Hockey Association club schedule before transitioning to the NCAA in 2015–16 and joining Hockey East. The college added scholarship-supported women's ice hockey, swimming and water polo programs as part of its six-sport expansion following a settlement with U.S. Department of Education of a Title IX gender-discrimination complaint.\nErin Whitten Hamlen has been the head coach of the Warriors since the team's inception. As a player at the University of New Hampshire (UNH), she was a goaltender and won the ECAC Goaltender of the Year award in 1992. She returned to her alma-mater as a coach, working as an assistant and then associate head coach from 2000 to 2010. In 2010, she became the first head coach for the Boston Blades in the Canadian Women's Hockey League.\nIn the Warriors' inaugural NCAA 2015–16 season, Hamlen's bench staff included assistant coach Kacey Bellamy, a member of the U.S. Women's National Team and two-time Olympic silver medalist. Hamlen previously coached Bellamy at UNH, Team USA, and the Boston Blades. While coaching at Merrimack, Ballamy played for the Boston Pride in the National Women's Hockey League (NWHL), which won the league's inaugural Isobel Cup championship during the 2015–16 season. At season's end, Bellamy rejoined the national team to train for the IIHF World Women's Championship.\nThe Warriors were ranked eighth of nine in the 2017–18 Hockey East preseason poll, then started the season with two upset victories. The first came against Boston University, which had been ranked third in the conference. The second was a 4–3 road win against No. 3 Minnesota. Goaltender Léa-Kristine Demers was credited with 54 saves in the Sept. 29 upset, which also marked the first time the Warriors beat a nationally ranked opponent in the team’s history. Minnesota won the second of game of the series, 4–1.\nThe Warriors finished the 2017–18 season with a 11–20–3 record. Their 6–16–2 conference record put them in ninth place, and thus out of the conference tournament.\nIn 2018–19, the Warriors posted the team’s first-ever winning record, at 16–13–7 overall. On Dec. 8 of that season, the Warriors beat No. 9-ranked Boston College, 1–0, on a second-period goal by senior Paige Sorensen and a 51-save shutout by goaltender Samantha Ridgewell. It was the Warriors’ first win against the Eagles and the second win against a ranked opponent in team history. The team qualified for its second-ever trip to the Hockey East tournament. The Warriors lost two games against Providence in the opening round.\nFollowing the 2018–19 season, Merrimack graduated 11 of its original players. The senior class included Katelyn Rae, who was the first player in program history to reach 100 career points. At the time of her graduation, Rae was the team’s all-time points leader with 113. She earned a first-team 2018-19 Hockey East All-Star selection, while senior goaltender Samantha Ridgewell was named a second-team Hockey East All-Star, and senior Dominique Kremer was named to the third team. Rae was also the first Merrimack Warrior selected for the New England Hockey Writers’ All-Star Team.\nThree members of the Warriors were selected in the 2018 NWHL draft. Rae was drafted by the Connecticut Whale as the 12th pick overall, in the 3rd round, officially becoming the first woman in program history to be drafted for professional hockey. Warriors' forward Paige Voight was selected 16th overall pick in the fourth round, by the Metropolitan Riveters. Voight played on the U.S. U-18 national women's ice hockey team that won gold. She joined the NWHL's competitor Professional Women's Hockey Players Association (PWHPA) in the New England region for the 2019–20 season. Defender Dominique Kremer was also selected by the Connecticut Whale as the 17th pick overall in the 4th round.\nIn the 2019–20 season, the Warriors finished with a 5–24–5 record with nine losses against ranked opponents. In January 2020, the Warriors traveled to Belfast, Northern Ireland, for a two-game series against Quinnipiac as part of the Friendship Series sponsored by the Odyssey Trust. The tournament was organized in conjunction with a sister cities agreement between Belfast and Boston. It was the second time a women's tournament was played. Games were played in the SSE Arena, with a capacity of more than 11,000. Quinnipiac won both games, 4–2 and 3–1.\nThe 2019–20 season also marked the senior years of forward Mikyla Grant-Mentis and goaltender Léa-Kristine Demers. Mikyla Grant-Mentis was nominated for the 2020 NCAA Woman of the Year award. She set a new program record for points, with 117 points on 56 goals and 61 assists. She ranked second in goals scored. She earned Hockey East Player of the Month honors in November 2019. The same season, she was a Hockey East Second Team All-Star, and the New England Hockey Writers Association named her as a Division I All-Star.\nAt the end of the season, Grant-Mentis and Demers were signed to contracts with the Buffalo Beauts for the remainder of the NWHL season. In their first two games, against the Metropolitan Riveters, Grant-Mentis scored two goals and an assist, while Demers had 36 games in each of two games, on 41 and 37 shots. The Beauts won one game and finished the season fourth in the league, losing in the first game of the playoffs.\nThe Warriors had a single win — against Holy Cross — during the pandemic-shortened 2020–21 season. Of the 16 games played, four were against ranked opponents. As in previous seasons, the Warriors were well-represented in the Hockey East All-Academic Team, with 21 of 24 Merrimack players recognized. Merrimack was surpassed in the number of All-Academics only by the University of Connecticut's 22. The Warriors also claimed three of nine spots in the league's All-Academic All Star Team.\nThe Warriors finished the 2021–22 regular season with a 7–24–1 record. They faced top-10 ranked teams three times in the season, including two losses at home against No. 1 Wisconsin at the beginning of October. The Warriors won the last two games of the regular season, sweeping a two-game series against Holy Cross. The final victory came on an overtime goal by senior Julia MacLean, the first goal of her Merrimack career. Junior Teghan Inglis led the team in scoring during the regular season with 12 goals and 18 points.\nIn the Beijing Winter Olympics in February 2022, graduate student Dominika Lásková and former Warrior Katerina Bukolska skated for the Czech national team. They were the first Merrimack women's hockey players to compete in the Olympics. The Czech Republic team, appearing in the country's first Olympic women's ice hockey tournament, lost to the U.S. in the quarterfinal round 4–1 despite holding the Americans scoreless in the first period and briefly taking the lead in the second.\nIn their 2022-2023 season the Warriors finished with a 9-25-2 record. They made it to the opening round of the Hockey East Playoffs where they played Boston University and won 5-4 after going into overtime. They were then scheduled to play Northeastern in the first round of the Hockey East playoffs where they lost 5-1. In the 2022-23 season the Warriors had 23 of their players make the Hockey East All-Academic Team, which tied them for the most in the conference.\nTo start the 2023-2024 Head Coach Erin Hamlen hired two new assistant coaches, adding Stephanie Wood and Danielle Blanchard along with 8 new incoming players.\nCurrent roster\nAs of September 6, 2023.\nSeason–by–season results\n{| class=\"wikitable\"\n|bgcolor=\"#ffeeaa\"|Won Championship\n|bgcolor=\"#ddffdd\"|Lost Championship\n|bgcolor=\"#d0e7ff\"|Conference Champions\n|bgcolor=\"#ffbbbb\"|League Leader\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center;\"\n|- style=\"text-align:center; background:#003768; color:gold;\"\n| Year || Coach || W  || L || T||  Conference  || Conf.  W || Conf.  L || Conf.  T || Finish || Conference Tournament ||  NCAA Tournament\n|-\n|2024–25\n|Erin Hamlen\n|9\n|23\n|4\n|Hockey East\n|5\n|18\n|4\n|10th HE\n|Won First Round vs. New Hampshire Lost Quarterfinals vs. Connecticut\n|Did not qualify\n|-\n|2023–24\n|Erin Hamlen\n|11\n|22\n|3\n|Hockey East\n|7\n|17\n|3\n|9th HE\n|Won First Round vs. Maine Lost Quarterfinals vs. Northeastern\n|Did not qualify\n|-\n|2022–23\n|Erin Hamlen\n|9\n|25\n|2\n|Hockey East\n|5\n|20\n|2\n|10th HE\n|Won First Round vs. Boston University Lost Quarterfinals vs. Northeastern\n|Did not qualify\n|-\n|2021–22||Erin Hamlen||8||25||1||Hockey East||6||20||1||9th HE||Won First Round vs. New Hampshire Lost Quarterfinals vs. Northeastern\n|Did not qualify\n|-\n|2020–21||Erin Hamlen||1||15||0||Hockey East||1||15||0||10th HE||Did not qualify||Did not qualify\n|-\n| 2019–20||Erin Hamlen|| 5 || 24 || 5 || Hockey East || 2 || 20 || 5 || 10th HE || Did not qualify || Did not qualify\n|-\n| 2018–19||Erin Hamlen|| 16 || 13 || 7 || Hockey East || 12 || 10 || 5 || 5th HE || Lost Quarterfinals vs. Providence  || Did not qualify\n|-\n| 2017–18 ||Erin Hamlen|| 11 || 20 || 3 || Hockey East || 6 || 16 || 2 || 9th HE || Did not qualify || Did not qualify\n|-\n| 2016–17 ||Erin Hamlen|| 11 || 22 || 3 || Hockey East || 7 || 17 || 0 || 8th HE || Lost Quarterfinal vs. Boston College  || Did not qualify\n|-\n| 2015–16 ||Erin Hamlen|| 5 || 26 || 3 || Hockey East || 3 || 18 || 3 || 9th HE || Did not qualify || Did not qualify\n|}\nNotable players\n{| class=\"wikitable sortable\"\n! style=\";\" | Player\n! style=\";\" | Position\n! style=\";\" | League(s)\n! style=\";\" | Team(s)\n! style=\";\" | Seasons\n|-\n| Mikyla Grant-Mentis || Forward || NWHL/PHF || Toronto SixBuffalo Beauts || 2020–20222022–2023\n|-\n| rowspan=2|Dominique Kremer ||rowspan=2|Defense || SDHL || Djurgårdens IF || 2019–2020\n|-\n| NHWL/PHF || Buffalo Beauts || 2020–2023\n|-\n|Courtney Maud\n|Forward\n|PHF\n|Buffalo Beauts\n|2022-2023\n|-\n|rowspan=2|Samantha Ridgewell || rowspan=2|Goaltender || SDHL || Djurgårdens IFHV71 Dam || 2019–20202021–2022\n|-\n| NWHL/PHF || Toronto SixBuffalo Beauts || 2020–20222022–2023\n|-\n|rowspan=2|Paige Voight || rowspan=2|Forward || PWHPA || Team Stecklein || 2019–2020\n|-\n| NWHL || Metropolitan Riveters || 2020–2021\n|-\n|Dominika Lásková\n|Forward\n|PHF\n|Toronto Six\n|2022-2023\n|}\nAwards and honors\nNew England Hockey Writers All-Stars\n* Katelyn Rae (F), senior, 2018-19 season\n* Mikyla Grant-Mentis (F), senior, 2019-20 season\nHockey East All-Stars\n* Katelyn Rae (F), junior, Honorable Mention, 2017-18 season\n* Katelyn Rae (F), senior, First-Team, 2018-19 season\n* Samantha Ridgewell (G), senior, Second-Team, 2018-19 season\n* Dominique Kremer (D), senior, Third-Team, 2018-19 season\n* Mikyla Grant-Mentis (F), junior, Honorable Mention, 2018-19 season\n* Mikyla Grant-Mentis (F), senior, Second-Team, 2019-20 season\nHockey East Players of the Month\n* Mikyla Grant-Mentis (F), freshman, HEA Pro Ambitions Rookie of the Month (awarded February 3, 2017)\n* Samantha Ridgewell (G), senior, HEA Goaltender of the Month (awarded November 1, 2018)\n* Mikyla Grant-Mentis (F), senior, HEA Co-Player of the Month (awarded December 5, 2019)\nHockey East Weekly awards\n* Katelyn Rae (F), soph., HEA Player of the Week (awarded October 3, 2016)\n* Mikyla Grant-Mentis (F), freshman, HEA Pro Ambitions Rookie of the Week (awarded October 24, 2016)\n* Lea-Kristine Demers (G), freshman, HEA Pro Ambitions Rookie of the Week (awarded October 31, 2016)\n* Samantha Ridgewell (G), soph., HEA Defensive Player of the Week (awarded November 28, 2016)\n* Mikyla Grant-Mentis (F), freshman, HEA Pro Ambitions Rookie of the Week (awarded January 30, 2017)\n* Samantha Ridgewell (G), soph., HEA Defensive Player of the Week (awarded January 30, 2017)\n* Lea-Kristine Demers (G), freshman, HEA Defensive Player of the Week (awarded February 20, 2017)\n* Lea-Kristine Demers (G), soph., HEA Player of the Week (awarded October 2, 2017)\n* Samantha Ridgewell (G), junior, HEA Defensive Player of the Week (awarded October 16, 2017)\n* Samantha Ridgewell (G), junior, HEA Defensive Player of the Week (awarded November 27, 2017)\n* Katelyn Rae (F), junior, HEA Player of the Week (awarded January 22, 2018)\n* Samantha Ridgewell (G), junior, HEA Defensive Player of the Week (awarded February 5, 2018)\n* Mikyla Grant-Mentis (F), junior, HEA Player of the Week (awarded October 1, 2018)\n* Samantha Ridgewell (G), senior, HEA Defensive Player of the Week (awarded October 1, 2018)\n* Samantha Ridgewell (G), senior, HEA Defensive Player of the Week (awarded October 22, 2018)\n* Samantha Ridgewell (G), senior, HEA Defensive Player of the Week (awarded December 10, 2018)\n* Gabby Jones (F), freshman, HEA Pro Ambitions Rookie of the Week (awarded January 1, 2019)\n* Mikyla Grant-Mentis (F), junior, HEA Player of the Week (awarded January 14, 2019)\n* Katelyn Rae (F), senior, HEA Player of the Week (awarded February 18, 2019)\n* Emma Gorski (G), soph., HEA Defensive Player of the Week (awarded December 14, 2020)\n* Alexa Pongo (F), freshman, HEA Pro Ambitions Rookie of the Week (awarded September 28, 2021)\n* Teghan Inglis (D), junior, HEA Defender of the Week (awarded October 19, 2021)\n* Katie Kaufman (F), junior, HEA Player of the Week (awarded November 2, 2021)\n* Alexa Pongo (F), freshman, HEA Pro Ambitions Rookie of the Week (awarded November 9, 2021)\n* Teghan Inglis (D), junior, HEA Defender of the Week (awarded February 22, 2022)\n* Emma Gorski (G), junior, HEA Goaltender of the Week (awarded February 22, 2022)\n* Katie Kaufman (F), senior, HEA Player of the Week (awarded November 1, 2022)\n* Emma Gorski (G), senior, HEA Goaltender of the Week (awarded November 8, 2022)\n* Hayley Chang (D), sophomore, HEA Defender of the Week (awarded November 15, 2022)\nHockey East Academic All-Stars and Top Scholar-Athletes\n* Lea-Kristine Demers, (G), freshman, HEA Top Scholar-Athlete, 2016-17 season (awarded June 28, 2017)\n* Paige Sorensen, (D), soph., HEA Top Scholar-Athlete, 2016-17 season (awarded June 28, 2017)\n* Annie Boeckers, (F), soph., HEA Top Scholar-Athlete, 2016-17 season (awarded June 28, 2017)\n* Marie Delabre, (F), senior (redshirt), HEA Top Scholar-Athlete, 2016-17 season (awarded June 28, 2017)\n* Madison Morey, (F), soph., HEA Top Scholar-Athlete, 2016-17 season (awarded June 28, 2017)\n* Lea-Kristine Demers, (G), freshman, HEA All-Academic All-Star Team, 2016-17 season (awarded June 28, 2017)\n* Meghan Martin, (D), soph., HEA All-Academic All-Star Team, 2016-17 season (awarded June 28, 2017)\n* Paige Sorensen, (D), soph., HEA All-Academic All-Star Team, 2016-17 season (awarded June 28, 2017)\n* Annie Boeckers, (F), soph., HEA All-Academic All-Star Team, 2016-17 season (awarded June 28, 2017)\n* Marie Delabre, (F), senior (redshirt), HEA All-Academic All-Star Team, 2016-17 season (awarded June 28, 2017)\n* Madison Morey, (F), soph., HEA All-Academic All-Star Team, 2016-17 season (awarded June 28, 2017)\n* Lea-Kristine Demers, (G), soph., HEA Top Scholar-Athlete, 2017-18 season (awarded July 12, 2018)\n* Paige Sorensen, (D), junior, HEA Top Scholar-Athlete, 2017-18 season (awarded July 12, 2018)\n* Annie Boeckers, (F), junior, HEA Top Scholar-Athlete, 2017-18 season (awarded July 12, 2018)\n* Madison Morey, (F), junior, HEA Top Scholar-Athlete, 2017-18 season (awarded July 12, 2018)\n* Lea-Kristine Demers, (G), soph., HEA Academic All-Star Team, 2017-18 season (awarded July 12, 2018)\n* Paige Sorensen (D), junior, HEA Academic All-Star Team, 2017-18 season (awarded July 12, 2018)\n* Annie Boeckers (D), junior, HEA Academic All-Star Team, 2017-18 season (awarded July 12, 2018)\n* Madison Morey (D), junior, HEA Academic All-Star Team, 2017-18 season (awarded July 12, 2018)\n* Lea-Kristine Demers (G), junior, HEA Academic All-Star Team, 2018-19 season (awarded July 11, 2019)\n* Paige Sorensen (D), senior, HEA Academic All-Star Team, 2018-19 season (awarded July 11, 2019)\n* Dominique Kremer, (D), senior, HEA Academic All-Star Team, 2018-19 season (awarded July 11, 2019)\n* Annie Boeckers, (F), senior, HEA Academic All-Star Team, 2018-19 season (awarded July 11, 2019)\n* Lea-Kristine Demers, (G), junior, HEA Top Scholar-Athlete, 2018-19 season (awarded July 11, 2019)\n* Paige Sorensen, (D), senior, HEA Top Scholar-Athlete, 2018-19 season (awarded July 11, 2019)\n* Annie Boeckers, (F), senior, HEA Top Scholar-Athlete, 2018-19 season (awarded July 11, 2019)\n* Lea-Kristine Demers (G), senior, HEA Academic All-Star Team, 2019-20 season (awarded June 30, 2020)\n* Lea-Kristine Demers (G), senior, HEA Top Scholar-Athlete, 2019-20 season (awarded June 30, 2020)\n* Bree Bergeron, (D), freshman, 2020-21 Hockey East All-Academic All-Star Team (awarded June 25, 2021)\n* Katie Kaufman, (F), sophomore, 2020-21 Hockey East All-Academic All-Star Team (awarded June 25, 2021)\n* Allison Reeb, (F), sophomore, 2020-21 Hockey East All-Academic All-Star Team (awarded June 25, 2021)\n* Bree Bergeron, (D), freshman, 2020-21 Hockey East Top Scholar Athlete (highest GPA in conference) (awarded June 25, 2021)\n* Katie Kaufman, (F), sophomore, 2020-21 Hockey East Top Scholar Athlete (highest GPA in conference) (awarded June 25, 2021)\n* Allison Reeb, (F), sophomore, 2020-21 Hockey East Top Scholar Athlete (highest GPA in conference) (awarded June 25, 2021)\n* Teghan Inglis, (D), junior, 2021-22 Hockey East All-Academic All-Star Team (awarded July 18, 2022)\n* Katie Kaufman, (F), junior, 2021-22 Hockey East All-Academic All-Star Team (awarded July 18, 2022)\n* Allison Reeb, (F), junior, 2021-22 Hockey East All-Academic All-Star Team (awarded July 18, 2022)\n* Allyson Qualley, (F), sophomore, 2021-22 Hockey East All-Academic All-Star Team (awarded July 18, 2022)\n* Teghan Inglis, (D), junior, 2021-22 Hockey East Top Scholar Athlete (highest GPA in conference) (awarded July 18, 2022)\n* Katie Kaufman, (F), junior, 2021-22 Hockey East Top Scholar Athlete (highest GPA in conference) (awarded July 18, 2022)\n* Allyson Qualley, (F), sophomore, 2021-22 Hockey East Top Scholar Athlete (highest GPA in conference) (awarded July 18, 2022)\n* Allison Reeb, (F), junior, 2021-22 Hockey East Top Scholar Athlete (highest GPA in conference) (awarded July 18, 2022)\nOther Hockey East awards\n* Julia MacLean (D), junior, runner-up, HEA Sportsmanship Award, 2020-21 season\nReferences\nExternal links\n*"
    }
  ]
}