{
  "content": [
    {
      "type": "text",
      "text": "# Mexico–Sahrawi Arab Democratic Republic relations__disambig_1\n\nMexico recognized and established diplomatic relations with the Sahrawi Arab Democratic Republic (SADR) in 1979.\nHistory\nBrief history of Western Sahara\nBoth Mexico and Western Sahara were once part of the Spanish Empire. Since 1884, Spain claimed the land of Western Sahara (also known as Spanish Sahara) and administered it until 1975.  In November 1975, Spain agreed to partition part of the territory to Morocco and to Mauritania after it was agreed at the Madrid Accords. That same month, 350,000 Moroccans and 20,000 Moroccan troops held the “Green March” into Spanish Sahara to force Spain to hand over the disputed territory. Spain soon withdrew from the territory. In February 1976 the Polisario Front (a political movement of the Saharawi people) established and declared a government in exile in Algeria and named their country the \"Sahrawi Arab Democratic Republic\" (SADR).\nDiplomatic relations\nattending the inauguration ceremony of President Enrique Peña Nieto; 2012.]]\nIn 1975, representatives of the SADR visited Mexico to obtain support for independence. In 1978, Saharai Foreign Minister, Bachir Mustafá Sayed, paid a visit to Mexico. On 8 September 1979, during VI Conference of nations of the Non-Aligned Movement; Mexican Foreign Minister Jorge Castañeda y Álvarez de la Rosa declared that Mexico recognized the SADR as a state within the international community. On 24 October 1979, diplomatic relations were established between both nations. In 1988, SADR opened a diplomatic office in Mexico City. In 1979, Mexico appointed its ambassador based in Algeria (Oscar González) as ambassador concurrent to the SADR.\nMexico, as a non-permanent member of the United Nations Security Council voted in favor of the United Nations Security Council Resolution 1463 in January 2003 and for United Nations Security Council Resolution 1495 in July 2003 to extend the mandate of the United Nations Mission for the Referendum in Western Sahara. Each year since the 1980s, the SADR embassy in Mexico organizes cultural trips for Mexicans to visit the Sahrawi refugee camps in Tindouf Province, Algeria.\nIn 2012, Mexico was the guest country for the Sahara International Film Festival. In 2024, both nations celebrated 45 years of diplomatic relations.\nVisits\nIn March 2010, a Saharawi delegation arrived to Mexico and met with Mexican Senators, including Senator Yeidckol Polevnsky Gurwitz (vice-president of the Mexican Senate Commission on Foreign Relations with Africa) to discuss the situation in SADR. That same month, President of the Mexican Senate, Carlos Navarrete Ruiz, paid a visit to Algeria and met with SADR President Mohamed Abdelaziz and traveled to Tindouf Province to visit the Sahrawi refugee camps and access their needs. In September 2010, SADR President Mohamed Abdelaziz paid a visit to Mexico to partake in the Bicentennial celebration of Mexico's independence. In December 2012, President Abdelaziz returned to Mexico to attend the inauguration of President Enrique Peña Nieto.\nIn March 2013, Sahrawi Foreign Minister Mohamed Salem Ould Salek visited Mexico and met with his counterpart José Antonio Meade at the headquarters of the Mexican Ministry of Foreign Affairs. In 2014, a Mexican delegation made up of Deputies, paid a visit to the Sahrawi refugee camps in Tindouf Province, Algeria. A second Mexican delegation paid a visit to the Sahrawi refugee camps in Tindouf Province, Algeria in January 2017.\nIn December 2018, Sahrawi President Brahim Ghali paid a visit to Mexico to attend the inauguration of President Andrés Manuel López Obrador. In October 2024, Prime Minister Bucharaya Hamudi Sidina visited Mexico to attend the inauguration of President Claudia Sheinbaum Pardo.\nHigh-level visits\nHigh-level visits from the SADR to Mexico\n* Foreign Minister Bachir Mustafa Sayed (1978)\n* President Mohamed Abdelaziz (2010, 2012)\n* Foreign Minister Mohamed Salem Ould Salek (2013)\n* President Brahim Ghali (2018)\n* Prime Minister Bucharaya Hamudi Sidina (2024)\nDiplomatic missions\n* Mexico is accredited to the SADR from its Permanent Mission to the United Nations based in New York City, United States.\n* SADR has an embassy in Mexico City.\nSee also\n* Foreign relations of Mexico\n* Foreign relations of the Sahrawi Arab Democratic Republic\n* List of ambassadors of the Sahrawi Arab Democratic Republic to Mexico\nReferences"
    }
  ]
}