{
  "content": [
    {
      "type": "text",
      "text": "# Mexican tea culture\n\nMexican tea culture is known for its traditional herbal teas which are reputed to have medicinal properties.\nHistory\nMexico has numerous indigenous herbs that native cultures used to make infusions for centuries before Spanish colonization. Teas from Europe and Asia were not introduced to Mexican agriculture, however, and have yet to reach the level of popularity that they have in many other countries. The climate of Mexico is diverse, ranging from deserts to mountain plateaus and tropical rainforests in the southeast. The southeastern region may be suitable for cultivating imported teas.\nA small number of prominent establishments in Mexico City have formal tea rooms, where British-style tea is served, including the Hotel Marquis Reforma and the Presidente Inter-Continental Mexico City hotel.\nHerbal teas\nin Mexico City.]]\nHerbal teas are common in Mexico. Many herb varieties, both indigenous and imported, are sold at Mexican markets. Traditional medicinal infusions are common in some Mexican immigrant communities in the United States.\nPoleo is a tea made from the Hedeoma drummondii plant. Aside from being used to make a beverage in Mexico, this plant has also been used as a culinary spice by native cultures north of Mexico. Poleo has been found to be rich in antioxidants.\nHierba buena (Good herb) is a name given to a variety of mint teas sold loose in many markets. This is similar to yerba mate, used throughout many Latin American countries as mate, and widely regarded to have health benefits. Mild stomach upset is often remedied with a drink made from lemongrass, or Limón.\nDamiana tea made from damiana leaves is typically drunk in Mexico and Brazil for impotency. Damiana was used by the Aztecs centuries ago.\nChamomile is popular in Mexico.\nModern teas\n) plant, used to make agua de Jamaica, or Jamaica iced tea]]\nJamaica iced tea is a popular herbal tea made of the flowers and leaves of the Jamaican hibiscus plant (Hibiscus sabdariffa), known as flor de Jamaica in Mexico. It is served cold and quite sweet with a lot of ice. The ruby-red beverage called hibiscus tea in English-speaking countries is called agua de Jamaica (water of Jamaica) in Mexico, where it is widely available in restaurants and from street vendors.\nChampurrado\nChampurrado is a Mexican chocolate drink, sometimes incorrectly called \"Mexican chocolate tea\". It is a popular recipe exported to the United States. This drink is made with chocolate and spice with cinnamon. Champurrado is related to xocoatl, which is a traditional Aztec cocoa-bean drink.\nSee also\n* Mexican cuisine\n* Tea\n* Herbal tea\n* Agua fresca\n* Tepache\n* Tejate\n* Tejuino\n* Traditional medicine\n* Health effects of tea\nReferences"
    }
  ]
}