{
  "content": [
    {
      "type": "text",
      "text": "# Mia Mia, Queensland\n\n| pop                 = 118\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4754\n| area                = 25.8\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 8.6\n| dir1                = SSE\n| location1           = Mirani\n| dist2               = 45.6\n| dir2                = WSW\n| location2           = Mackay CBD\n| dist3               = 989\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Mackay Region\n| stategov            = Mirani\n| fedgov              = Capricornia\n| near-n              = Mirani\n| near-ne             = Mirani\n| near-e              = Kinchant Dam\n| near-se             = Brightly\n| near-s              = Pinevale\n| near-sw             = Pinevale\n| near-w              = Septimus\n| near-nw             = Septimus\n}}\nMia Mia is a rural locality in the Mackay Region, Queensland, Australia. In the , Mia Mia had a population of 118 people.\nHistory\nA provisional school for Mia Mia was approved on 17 April 1899. Tenders were called to erect the school building in May 1899. Mia Mia Provisional School opened on 22 January 1900 under head teacher Emma Milligan. On 1 January 1909, it became Mia Mia State School. The school building was relocated to a new site circa 1913. It closed on 7 July 1967, being replaced by a school transport service to take the children to Mirani State School. At that time, the school was on the north of the bend in the Mia Mia Connection Road (). The school building was sold in 1969 and the land was sold in 1970.\nDemographics\nIn the , Mia Mia had a population of 122 people.\nIn the , Mia Mia had a population of 118 people.\nEducation\nThere are no schools in Mia Mia. The nearest government primary schools are Mirani State School in neighbouring Mirani to the north and Gargett State School in Gargett to the north-west. The nearest government secondary school is Mirani State High School, also in Mirani.\nReferences\nFurther reading\n*  — via State Library of Queensland. Also covers Mount Martin State School and Mia Mia State School."
    }
  ]
}