{
  "content": [
    {
      "type": "text",
      "text": "# Micanopy Historical Society Museum\n\n|established   =\n|dissolved     =\n|location      = 607 Northeast 1st AvenueMicanopy, Florida\n|type          = History museum\n|visitors      =\n|director      =\n|curator       =\n|publictransit =\n|website       = [http://www.afn.org/~micanopy Micanopy Historical Society Museum]\n}}\nThe Micanopy Historical Society Museum is located at 607 Northeast 1st Avenue, Micanopy, Florida, United States. It contains materials relating to the history of the town. It is part of the Micanopy Historic District, which is listed on the National Register of Historic Places.\nHistory\nThe Micanopy Historical Society came together in 1983, after the committee finished the work of nominating the Micanopy Historic District to the National Register of Historic Places. The first president of the historical society was John E. Thrasher III. Under the second president Dr. Robert N. Pierce the museum got its start. The original museum was in a storefront in what had been known as \"Antique Alley.\" Historical society members prepared the space, designed displays, and collected and documented local history materials. This location opened in April 1985, with its second display focusing on William Bartram's time in the area. The museum also displays traveling exhibits from both the Museum of Florida History and the Florida State Museum. This location also houses the archives and gift shop, and the lack of space led to the town commission allowing for a storage room at the town hall for overflow items. Under the work of the third president, Dr. Ron Cohen, the search for a larger location began and the Thrasher Warehouse was placed under consideration.\nIn 1986, the historical society was awarded a matching grant from the Southern Office of the National Trust for Historic Preservation. The $500 grant was used to fund a feasibility study for the potential restoration of the Thrasher Warehouse. The completed feasibility study, along with architect's drawings, were presented to the town commission which approved the renovation project. The development plan was created by the museum's chairman, Tom Brady, with the original plans being restoration of the warehouse, the addition of shops in the storage building behind the warehouse, and the creation of a small restaurant. The proposed development was broken down into three phases, with an estimates cost of $250,000. Phase I would be cleaning the warehouse, attaining rights to the property, creating a not-for-profit organization for the development of the location, and the work of renovating the warehouse for use as a museum. Phase II would focus on renovating the other buildings at the location and the grounds. Phase III would be focused on museum work to finish the project.\nA state grant of $69,000 allowed for the completion of the museum renovation. The warehouse was restored to its 1890 condition, with modern additions to meet building codes. The front half of the building was dedicated to exhibits on the history of Micanopy and the North Central Florida area. A request for an additional $85,000 state grant was planned to finish the renovations on the rest of the property.\nThe museum opened to the public in 1991. A procession of color guard members in period military uniforms marched down Cholokka Boulevard, leading the way to the museum. Historical society president Alyce Tincher made the dedication, and museum chairman Tom Brady discussed the renovation on the building. After the ribbon at the gate was cut the community members entered the new museum.\nLocation\nThe Thrasher Warehouse serves as the location for the museum, housing its various collections. The wooden warehouse was built approximately in 1890, being served by a branch of the Atlantic Coast Line Railroad until the 1950s. The building was originally used by J.E. Thrasher, Sr. to house materials for the general merchandise business he opened in 1896. As part of a three-building quadrangle, the warehouse held farm equipment, hardware, lumber, and other supplies. After his store burned in 1911 J.E. Thrasher, Sr. moved its merchandise to the warehouse, operating his business from this location until the completion of a new brick building for the store.\nThe Thrasher Warehouse was added to the National Register of Historic Places in 1983.\nArchives\nThe Micanopy Historical Society Archives can be found on the same property as the museum, housed in a separate building. The archives house materials relating to the history of the Micanopy area. The materials in the archive do not circulate and must be used in-house, but copies of materials are available at a cost. Researchers are required to register prior to using the archives.\nThe archives are open during limited hours once a week, or by scheduling an appointment. Donations are accepted if they are documents or photos relating to the history of Micanopy.\nFootnotes\nExternal links\n* [http://micanopyhistoricalsociety.com/ Micanopy Historical Society Museum]"
    }
  ]
}