{
  "content": [
    {
      "type": "text",
      "text": "# Michigan State University Horticulture Gardens\n\n|area          =\n|plants        =\n|species       = 5000\n|collections   =\n|opened        = See history\n|owner         =\n|operator      =\n|budget        =\n|visitation_num=\n|status        =\n|website       =\n}}\nThe Michigan State University Horticulture Gardens are horticultural gardens, with a landscape arboretum, located on Bogue Street on the Michigan State University campus in East Lansing, Michigan. The gardens are open to the public daily without charge.\nThe gardens are a popular visitor destination on campus, and have been throughout their history. There have been gardens on campus almost since the founding of the Michigan Agricultural College, which would become Michigan State University. After being moved around because of new buildings being built, the current gardens are located adjacent to the Plant and Soil Science Building, which houses the Department of Horticulture, and its teaching greenhouses.\nThe main features of the gardens are as follows:\n* Amien and Florence M. Carter Annual Garden - more than 1,000 varieties of annuals and helpful student workers!\n* Clarence E. Lewis Landscape Arboretum, founded in 1982 - a working arboretum for landscape students.\n* Frank's Nursery Rose Garden - over 700 rose cultivars.\n* Michigan 4-H Children's Garden - 55 theme areas plus the Goon Squad.\n* Perennial Garden - 400 species suited for Michigan.\nHistory\nThe very first gardens on campus were the botanical gardens, which were started in 1877 (Beal 252). Before the botanical gardens gained large popularity there was also the Horticultural greenhouse. It was popular for visitors and was said at the time to be the most interesting place on campus (Lyon 204). Before there were designated horticultural gardens, all of the grounds were described as the way Milton pictured Eden:\n\"A happy rural seat of various views.\" (Lyon 203).\nThe first designated horticulture gardens were actually test plots for horticultural crops. For example, trees there were used for experiments with fungicides in 1889 (Davidson 76). The first display gardens had a dual purpose of being a display for students and visitors and providing plants for class use. Plants included roses, annuals, perennials, and bulbs. They were designed in the early 1930s by T. Glenn Philips, who was the college landscape architect at the time (76). They were located in the center of what is now East Circle and extended to where the Student Services Building now stands. The gardens were very popular with visitors and there were an estimated 40,000 in the summer of 1935.\nThe Horticulture gardens were clearly distinguished from the botanical gardens in the late 1940s after a dispute about who had responsibility of them. President Hannah assigned responsibility of the botanical gardens to the botany department and the horticulture gardens to the horticulture department. The Horticulture department was also to serve all the buildings on campus with floral arrangements (76).\nChanges had to be made to the gardens due to the building of the Natural Science Building and the Student Services Building. The newly designed garden included a grassy area with a fountain that was surrounded by ‘Red Jade’ crab apples in the middle. Jack and Perkins released its ‘Spartan’ rose in 1955 in honor of Michigan State University's centennial. By 1971 the gardens had become a popular place for special events, including weddings, twelve of which took place in that year (77).\nIn 1978 Michigan State University was asked by All-America Selections and professional seed producers to begin participating in the network of trial gardens scattered across the United States. Lowell Ewart took responsibility for the Michigan State University Trial Gardens. Trial gardens allow plant companies to see what varieties do well in different climates. Flower seed companies decide what plants would be tested and submit thousands of varieties for testing in Michigan. Bedding plants would be started in the Horticulture Teaching Greenhouse around March and April and then would be transplanted in May. Each variety was assigned a number and evaluated by a judge three times a summer, and information about those evaluations was published at the end of every growing season. Bedding plant producers met at the site in early August to evaluate the trials and decide what to grow in the trials what next season. The trial garden consisted of about half an acre containing 30,000 plants. The trial gardens were moved to the current site in the late 1980s and the current manager is Katie Carver.\nFundraising for the newest and final gardens began in 1987, and despite doubts by faculty, three million was raised by the time the gardens were dedicated in 1993. Work on the new gardens began in 1989 after the Plant and Soil Science Building was completed. The gardens were moved adjacent to the Plant and Soil Science Building because the horticulture department was moved to this building, so it was fitting that the gardens be moved as well. All of the perennials from the old garden were moved to the new site, plus more were added (78). The square footage of perennials went from 1500 to 18,000. The Michigan 4-H Children's Garden was started in 1991 and finished in 1993. The gardens now offer 7.5 acres to visit and are enjoyed by 300,000 visitors each year.\nAfter moving the new gardens to the current location, the department was unable to maintain the old gardens next to the Old Horticulture Building and the area was converted to a green space, but at the dismay of many students who enjoyed the area.\nExplanation of people and companies mentioned (in order of appearance)\nPresident Hannah was the twelfth president of Michigan State University. He is particularly known for the improvements and expansions he made to the university, i.e. taking enrollment from 6,000 to 40,000. Jack and Perkins is a plant company that specializes in rose breeding. All America Selections has a purpose of testing new cultivars and making gardeners aware of the cultivars that do well and earn their approval. Lowell Ewart works in the horticulture department and develops new varieties of plants.\nCurrent garden exhibits\nOne of the largest parts of the gardens is the Annual Trial Garden. As stated on the annual trial garden website, Plants for the trial garden are submitted private breeding companies and All America Selections. The plants are grown in the trial gardens at Michigan State University to test performance of the plants in a Michigan climate. Plants are evaluated bi-weekly on vigor, uniformity, ornamental value, susceptibility to disease and illness, and tolerance to extremes in climate (like a really hot summer day in Michigan, or a really cold, rainy summer night in Michigan). A summary of this evaluation is published in a booklet at the end of every season. The booklet is available online (Cameron).\nRecently more than just annuals were trialed on the Michigan State University site. Typically only annuals are trialed because they are easy to breed- they only have a life cycle of one growing season so results of crosses are quickly seen. While most trials take place in the annual garden right next to the Plant and Soil Science Building, vegetables, herbaceous perennials, and native plants were trialed in other parts of the gardens. The vegetables are in the Vegetable Demonstration Garden and the native plant trials are to the east of the Food Safety and Toxicology Building (Cameron).\nA large display of perennials is presented in the Judith A. Delapa Perennial Garden. This garden has ten island beds that total 6,500 square feet. Because perennials bloom all year long there is something to look at most of the year—from March until late November, sometimes later. This garden, like all the others, is an educational resource for both students and visitors to campus. Plants are labeled with scientific names and common names so that visitors can learn about plants they enjoy. The entrance pavilion serves as the entrance to the perennial garden. There is also a pond located in the northeast section of the garden. The pond is a nice spot to enjoy water lilies and other aquatic plants.\nA popular attraction for young visitors to the gardens is the Michigan 4-H Children's Garden. The 4-H Children's garden in located in-between the demonstration gardens and the Lewis Arboretum. All of the 4-H gardens are made up of small theme gardens. The outdoor gardens have the ABC Kinder Garden, the Teddy Bear and Animals Garden, and the Storybook Garden. The indoor garden has food themed areas: My favorite Foods, Rainforest in My Kitchen, and Around The World Herb.\nGallery\nMSU Perennial Garden.jpg|The Perennial section.\nMSU Rose Garden.jpg|The Rose Garden section.\nMSU Water Fountain Behind Plant Biology Lab.jpg|Water fountain between the Gardens and the Plant Biology Lab.\nMSU Horticulture Gardens 40.jpg|Fish in a pond.\nClarence E. Lewis Landscape Arboretum - IMG 8951.JPG|Clarence E. Lewis Landscape Arboretum\nSee also\n* List of botanical gardens in the United States\nReferences\n*Beal, William James. History of the Michigan Agricultural College and Biographical Sketches of Trustees and Professors. East Lansing, Agricultural College, 1915. Print.\n*Cameron, Art. General Trial Information. N.P. n.d. Web. 26 Oct. 2011\n*Davidson, H., F.G. Dennis Jr., G.M. Kessler. From Seed To Fruit: 150 Years of  Horticulture At Michigan State 1855–2005. East Lansing, University  Publishing, 2007. Print.\n*Lyon, T.T. History of Michigan Horticulture. Lansing, Thorp & Godfrey State Printers And Binders, 1887. Print.\n*\nExternal links\n*"
    }
  ]
}