{
  "content": [
    {
      "type": "text",
      "text": "# Michael Warren II\n\n| birth_place   = Toledo, Ohio, U.S.\n| height_ft     = 5\n| height_in     = 11\n| weight_lb     = 222\n| high_school   = Central Catholic (Toledo)\n| college       = Cincinnati\n| undraftedyear = 2020\n| pastteams     =\n* Philadelphia Eagles ()*\n* Carolina Panthers ()*\n* Washington Football Team ()\n* Detroit Lions ()*\n* BC Lions ()\n| status        =\n| highlights    =\n* 2× second-team All-AAC (2018, 2019)\n| pfr           = WarrMi01\n}}\nMichael Warren II (born November 12, 1998) is an American former football running back. In high school, he won Ohio's Mr. Football Award while playing for Central Catholic in Toledo. He attended the University of Cincinnati and played for the Bearcats, where he holds their single-season rushing touchdowns record. He signed with the Philadelphia Eagles as an undrafted free agent in 2020 and has also been a member of the Carolina Panthers and Washington Football Team.\nEarly life\nHe went to high school at Central Catholic High School in Toledo, Ohio. He was honored as Mr. Football Award (Ohio) in 2016. He averaged 8.95 yards per carry that season and holds the school’s single-game rushing record with 385 yards against Lima Senior High School in 2016.\nCollege career\nAt University of Cincinnati, he played running back and kick returner in his freshman year. On November 10, 2018, in a game against the University of Central Florida, he rushed for three touchdowns and caught a touchdown pass. He set a school record of 19 touchdowns in a single season, and became the school's 12th 1,000-yard rusher. The most recent was George Winn in 2012.\nIn 2019 he passed Robert Cooper to become the 6th ranked all-time rusher for the Bearcats, with a career total of 2,918 yards.  Following this season, Warren declared for the 2020 NFL draft, forgoing his senior year.\nCollege statistics\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\"| Season\n! rowspan=\"2\"| Team\n! rowspan=\"2\"| Games\n! colspan=\"4\"| Rushing\n! colspan=\"4\"| Receiving\n|-\n! Att !! Yards !! Avg !! TD !! Rec !! Yards !! Avg !! TD\n|-\n! 2017\n! Cincinnati\n| 12 || 54 || 324 || 6.0 || 1 || 5 || 57 || 11.4 || 0\n|-\n! 2018\n! Cincinnati\n| 12 || 244 || 1,329 || 5.4 || 19 || 25 || 232 || 9.3 || 1\n|-\n! 2019\n! Cincinnati\n| 14 || 261 || 1,265 || 4.8 || 14 || 21 || 153 || 7.3 || 2\n|-\n! colspan=\"2\"| Career !! 38 !! 559 !! 2,918 !! 5.2 !! 34 !! 51 !! 442 !! 8.7 !! 3\n|}\nProfessional career\n}}\nPhiladelphia Eagles\nWarren was signed by the Philadelphia Eagles as an undrafted free agent following the 2020 NFL draft on April 26, 2020. He was waived on September 3, 2020 and re-signed to the practice squad. He was released on September 29, 2020.\nCarolina Panthers\nOn October 20, 2020, Warren was signed to the Carolina Panthers' practice squad, but was released two days later.\nWashington Football Team\nWarren signed with the Washington Football Team's practice squad on December 9, 2020. He was elevated to the active roster on December 19 for the team's week 15 game against the Seattle Seahawks, and reverted to the practice squad after the game. He was released on December 29, 2020, and rejoined them on a reserve/futures contract on January 15, 2021, before being waived again on April 9, 2021.\nDetroit Lions\nWarren signed with the Detroit Lions on June 4, 2021. He was waived/injured on August 11, 2021 and placed on injured reserve. He was released on August 16.\nSee also\n*Cincinnati Bearcats football statistical leaders\nReferences\n}}"
    }
  ]
}