{
  "content": [
    {
      "type": "text",
      "text": "# Michael L. Howard\n\nMichael L. Howard is a retired United States Army lieutenant general who last served as the deputy commander of the United States European Command. Prior to that, he was the command's operations director.\nHoward earned a B.S. degree in biology from Mercer University in 1986. He later received an M.S. degree in national security strategic studies from the National War College.\nPrior to his current European assignment, Howard served for two years as the commanding officer of the Military District of Washington (MDW). During that time, he also served as the official escort for former president George W. Bush and his family during the state funeral for his father, former President George H. W. Bush, in late 2018.\nAwards and decorations\n{|\n| Combat Infantryman Badge with Star (2nd award)\n|-\n| Ranger tab\n|-\n| Master Parachutist Badge\n|-\n| 10th Mountain Division Combat Service Identification Badge\n|-\n| 75th Ranger Regiment Distinctive Unit Insignia\n|-\n| 11 Overseas Service Bars\n|}\n{|\n| Defense Superior Service Medal with one bronze oak leaf cluster\n|-\n| Legion of Merit\n|-\n| Bronze Star Medal with four oak leaf clusters\n|-\n| Defense Meritorious Service Medal\n|-\n| Meritorious Service Medal with three oak leaf clusters\n|-\n| Joint Service Commendation Medal\n|-\n| Army Commendation Medal with four oak leaf clusters\n|-\n| Army Achievement Medal with three oak leaf clusters\n|-\n| Joint Meritorious Unit Award with oak leaf cluster\n|-\n| Valorous Unit Award\n|-\n| Meritorious Unit Commendation with oak leaf cluster\n|-\n| National Defense Service Medal with one bronze service star\n|-\n| Southwest Asia Service Medal with two service stars\n|-\n| Afghanistan Campaign Medal with four service stars\n|-\n| Global War on Terrorism Expeditionary Medal\n|-\n| Global War on Terrorism Service Medal\n|-\n| Humanitarian Service Medal\n|-\n| Army Service Ribbon\n|-\n| Army Overseas Service Ribbon with bronze award numeral 3\n|-\n| NATO Meritorious Service Medal\n|-\n| Kuwait Liberation Medal (Saudi Arabia)\n|-\n| Kuwait Liberation Medal (Kuwait)\n|}\nReferences"
    }
  ]
}