{
  "content": [
    {
      "type": "text",
      "text": "# Michael Wardian__disambig_1\n\n| coach          =\n| birth_place    = Morgantown, West Virginia, U.S.\n| collegeteam    =\n| height         =\n| weight         =\n| website        =\n| turnedpro      =\n| retired        =\n| pb             = Mile: 4:34.6  5K run: 15:09  10K run: 30:23  Half Marathon: 1:06:30  Marathon: 2:17:49\n| olympics       =\n| worlds         =\n| highestranking =\n| coaching       =\n}}\nMichael Wardian (born April 12, 1974) is an American marathoner and ultra-marathoner. He won the 2008, 2009 and 2010 US 50&nbsp;km championships and the 2011 US 50 mile championship. In 2008, he won the U.S. National 100&nbsp;km championship. Wardian also is the 2007 JFK 50 Mile champion, and 6-time winner of the National Marathon in Washington, D.C., winning 2006–2008 and 2010-2012.\nWardian has set 25 Fastest Known Time running records in five countries. In 2019, he set the speed record for the 631-mile Israel National Trail. Wardian is known for the vast number of marathons he participates in. During a 45-day span in 2006, Wardian won four out of five marathons he raced.  In 2007, he ran 13 marathons (not including ultra-marathons), and seven marathons in a span of nine weeks (winning three). Wardian frequently participates in local races in the Washington, D.C., area.\nEarly life and education\nWardian was born on April 12, 1973, in Morgantown, West Virginia. He attended Oakton High School in Vienna, Virginia. He attended Michigan State University in Lansing, Michigan.\nRunning career\nin Saint-Pierre, Réunion, France]]\nWardian set the world record for fastest marathon while pushing a jogging stroller from May 2007 to November 2009. He set the record at the 2007 Frederick Marathon with a time of 2:42:21.  The record was broken at a duel at the 2009 Route 66 marathon by Zac Freudenburg, whose 2:32:10 time beat Wardian's 2:34:37 time.\nWardian also was a former record holder of the fastest Marathon on a treadmill.  He qualified and participated in the 2004, 2008 and 2012 Men's Olympic Marathon trials.  Some of the notable ultra-marathons Wardian has completed include the Marathon des Sables, the Western States Endurance Run, the Himalayan 100 Mile Stage Race, and the Vermont 100 Mile Endurance Run.  The United States Track and Field Association named Wardian the 2008 and 2009 Ultra Runner of the year.\nIn March 2008, won the National Marathon in Washington D.C., on a Saturday, and then finish third at a marathon in Knoxville, Tennessee the next day.   In 2008, Wardian ran a total of 53 races. In November 2009, Wardian finished third in the IAU World 50K championships held in Gibraltar.   In 2010, Wardian finished third at the Marathon des Sables in 23 hours 1 minute 3 seconds, which was the best time ever by an American.  In February 2011, the International Association of Ultrarunners named Wardian its inaugural Athlete of the Year.\nOn July 1, 2010, Wardian set the record for fastest indoor 200-meter track marathon record, with a time of 2:27:21. He qualified for the 2012 U.S. Olympic Marathon trials by running a 2:17:49 at the 2011 Grandma's Marathon.   In September 2011, he won the silver medal at the World 100K Championships.\nIn January 2012, Wardian ran 2:21 at the US Olympic Trials in Houston, and 2:31 at the Houston Marathon the next morning.  He finished 62nd at the Trials and 16th at the Marathon.\nIn May 2014 he won the Wings for Life World Run in Sunrise running 57.75&nbsp;km and finished 27th globally. In 2015 he chose to compete in Melbourne winning the race with 70.66&nbsp;km to be the 10th of the world.\nIn January 2017, Wardian ran seven marathons in seven days on seven continents in a record average speed of 2:45.\nOn September 15, 2017, Wardian won the Fenway Park Marathon in a time of 2:53.52. The race had 51 participants who ran 116 laps on the warning track of the ball park. He ran in Maldives Addu marathon on June 29, 2018, and got first place and MVR12000.\nOn October 27, 2019, Wardian won the inaugural Marine Corps Marathon 50K with a time of 3:11:52.\nIn 2020, Wardian won the Quarantine Backyard Ultra, running nearly 263 miles over the course of 63 hours without sleeping in a repetitive neighborhood loop in Arlington, VA to follow social distancing guidelines during the coronavirus pandemic.\nWhen asked in April 2009 why he competes in so many races, Wardian said:\nA lot of people say, \"Oh, you could be a 2:12 guy or a 2:14 guy if you just focused on one race a year, or two races a year and really built up.\" And I think the counter argument is that you could get hurt and you wouldn't have any races a year. There are so many opportunities out there and, I love to toe the line. I love to see what I can do and just push the limits and try and experiment with myself.\nI like that people can look at me, and say, \"Wow, if that guy can do 13 marathons a year and do pretty well maybe I can do one.\" I think a lot of people can relate to that. Like, that guy works a real job. He's not a professional runner.\n49th Annual Marine Corps Marathon\nIn October 2024, Wardian and his 18-year-old son Pierce ran the 49th annual Marine Corps Marathon, the 4th largest marathon in the United States. The race marked Pierce's first ever marathon. “To be able to share a marathon with Pierce is just a dream come true and something I've wanted to do for a long time,” Wardian told ABC affiliate WJLA-TV. Pierce took 2,543rd place out of 16,556 with a time of 3:44:31. He sobbed in his mother's arms after crossing the finish line.\nPersonal life\nWardian is a graduate of Oakton High School and Michigan State University, where he played for the lacrosse team.  Wardian did not run competitively until after college.  He lives in Arlington, Virginia, is a vegetarian, and works as an International Shipbroker. Wardian chartered the cargo that was on the Maersk Alabama when it was hijacked in April 2009. He is married with two children, and owns two Vizslas, Bash, 4, and Rosie, 11.\nNotes\n* This result is a road running 5K, for track race see 5000 metres.\nReferences\nExternal links\n*[http://www.legacy.usatf.org/athletes/bios/MountainUltraTrail/Wardian_Michael.asp USATF profile]"
    }
  ]
}