{
  "content": [
    {
      "type": "text",
      "text": "# Michael Edwards (actor)\n\n| birth_date =\n| birth_place  = Hialeah, Florida, U.S.\n|occupation=\n|yearsactive=1972&ndash;present\n| spouse=\n| children= 1\n}}\nJohn Chalmers Edwards Jr. (born September 16, 1944), known professionally as Michael Edwards, is an American actor and model.\nEarly life\nEdwards is the son of John Chalmers Edwards Sr. and Charlotte Caroline Anderson, a high school teacher. He has an older sister named Jeannie. Shortly after his birth, the family moved to Pensacola, Florida. When he was six months old, his father left the family for a \"buxom blonde Texas heiress\".\nCareer\nIn 1962, Edwards enlisted in the U.S. Marine Corps and received his training at Parris Island. After his discharge from the service, he began his career as a model, appearing in TV commercials and magazine layouts. While modeling, he had a dialogue-free cameo in Play It as It Lays (1972) opposite Tuesday Weld. Edwards is pictured and interviewed in the book Male Model: The World Behind the Camera, published in 1979.\nEdwards' most prominent acting role was as Joan Crawford's lover Ted Gelber in the 1981 film Mommie Dearest with Faye Dunaway and Mara Hobel. He appeared briefly as \"General John Connor\" in Terminator 2: Judgment Day (1991).\nPersonal life\nOn June 4, 1966, Edwards married flight attendant Grace Ward, of Boston. They had a daughter, Caroline (born 1967). Edwards and Ward divorced in October 1968.\nSex abuse allegations\nEdwards dated Priscilla Presley on and off between 1978 and 1984. After they broke up, he wrote a book titled Priscilla, Elvis, and Me (1988), in which he admitted being attracted to Presley's teenage daughter Lisa Marie. Lisa Marie reported in a 2003 interview with Playboy that Edwards would make drunken attempts to enter her room and be \"inappropriate\" with her. In 2024, these claims were restated in more graphic detail in Presley's posthumous memoir, From Here to the Great Unknown, with Lisa Marie claiming that he molested her.\nFilmography\n{| class=\"wikitable sortable\"\n|-\n! Year !! Title !! Role !! Notes\n|-\n| 1972\n| Play It as It Lays\n| Rick Lacy\n| Uncredited\n|-\n| 1981\n| Mommie Dearest\n| Ted Gelber\n|\n|-\n| 1991\n| Terminator 2: Judgment Day\n| General John Connor\n|\n|-\n| 2021\n| Skynet\n| General John Connor\n| Fan film\n|}\nBibliography\n*\nReferences\nExternal links\n*"
    }
  ]
}