{
  "content": [
    {
      "type": "text",
      "text": "# Michigan Heritage Park\n\n| locmapin = Michigan\n| area =\n| governing_body = [http://www.lakeshoremuseum.org/ Lakeshore Museum Center]\n}}\nThe  Michigan Heritage Park was an open-air museum that spanned 10,000 years of Michigan history. It consisted of a half-mile trail loop that started with a pre-historic mastodon exhibit and ended at a Civilian Conservation Corps camp exhibit. The historical exhibits are recreations.  The park was operated by Muskegon's Lakeshore Museum Center.}}\nHistory\nGeorge Edward Hilt (1916–2012) had a plan before he died for his property called Hilt's Landing in Whitehall Township, Michigan. In his estate planning, Hilt made provisions that his vision of using his  family property should be for telling the story of Michigan's history to future generations. His trust fund appointed over $2 million for developing Michigan Heritage Trail at Hilt's Landing—a portion going to build the historic park by the Lakeshore Museum Center and another portion for maintenance and operation of the facility.  The effort to establish the park had gone on for nearly a decade.\nThe  open-air museum park opened on June 6, 2015, and has a visitor center.}} It was a seasonal attraction, open from June through October.\nLocal donors put millions of dollars into the park. The Consumers Energy Foundation was a large donor. It was part of a larger development at Heritage Landing, which was said to be Muskegon's new \"recreational gem.\"  It was funded in part by a special ballot proposal passed in 2011.  Building the authentic recreations of furniture required staff to \"turn back the clock\" and use antiquated methods.\nIn November 2018, the park closed. The museum's executive director stated that the park cost more to operate than the revenues it brought in.\nThe trail\nThe trail had site areas showing 10,000 years of Michigan history. Exhibits included the Mastodon Site; the Archeology Site; Native American Village; French Fur Trader Cabin; Colonial Cabin; Civil War Camp; Civilian Conservation Corps camp and a Michigan farmhouse.  Visitors were encouraged to participate in activities so that they were interacting with the artifacts and culture, not just passively listening to a docent.\nMastodon Site\nThe half-mile tour started with the Mastodon Site. Mastodons were elephant-like creatures that existed about 10,000 years ago. They once roamed Michigan. Their fossils are discovered in different parts of the state. Some Mastodon fossils were found in 1904 by a farmer in nearby Moorland Township, Michigan.\nArcheology site\nThis was a designated area of archaeological excavation where park staff and volunteers could dig into the soil for artifacts. Here they were looking for fossils, American Indian handmade objects such a tool or a shard of pottery, and remains of abandoned farm implements.\nNative American Village\nThe Native American Village (\"Wigwam Village\") represented the Anishinabe Native Americans during their first contact with Europeans in the mid-1600s and how they lived. They spoke the Algonquin language. These Native American people assembled the Council of Three Fires and are today the Michigan tribes of the Odawa, Potawatomi, and Ojibwe Chippewa. Attendees were asked to participate in learning how they prepared food, made clothing for their families, and built shelter for protection.\nWigwams were the main shelter in Michigan of the Native American families up to six when the early Europeans made first contact with them. Building wigwams required animal skins and a variety of timber such as birch, pine, red maple, aspen, oak, cedar, chesnut, poplar and ash. Construction timing was critical. The bark had to be stripped and used in a two-day period for flexibility, otherwise it dried out and broke when bent for the shape of the wigwam.\nWhen the park reconstructed their two reproductions it was learned that there was much more labor and technology involved that had not been originally anticipated. The wigwams built by the park did not have the center smoke hole as the Native Americans would have constructed. They would have had an internal fire for warmth and cooking, and the smoke needed a path to escape the inside of their dwelling.  The park used jute and metal rebar to build their two wigwams for durability since they are display model reproductions and not residences. The two wigwams that the park built were about  at the base.\nFur Trader Cabin: 1760\nEarly European explorers looking for gold and a shortcut to the Orient realized that the fur-bearing animals that Native Americans trapped had value. Europeans desired beaver felt hats which led them to trade European trade goods for these pelts. One of the most desired trade item was the Hudson's Bay point blanket wool blankets. They were one of the main European items sought by native peoples in exchange for beaver pelts, buffalo robes, pemmican and moccasins. Attendees are asked to participate in trading to learn how the Europeans negotiated with the Native Americans in the eighteenth century.\nThe French Fur Trader Cabin depicting the later seventeen hundreds of the New World is a common French style that used poles set into the ground. The end walls were logs set on top of one another and locked in place by outer poles. This was called poteau en terre construction. The cabin built by the park was based on an archaeological excavation done on a similar period site in Wisconsin of a North West Trading Company building.\nThe park's reproduction had  tongue and groove boards to support the large snow falls of Michigan. The roof was covered with modern 20th century roofing waterproofing material. It was then covered with hand-split maple shingles to give it an authentic historical look. The cabin then had a stockade wall around it to show what it might look like in that time period which most attendees don't expect.\nSettler's Cabin: 1830\nMichigan had around 32,000 people in 1830. These early settlers often built log cabins on account of the abundant Michigan forests. This Settlers Cabin is typical of a simple 1- or -story structure that was built in the mid-19th century. They were usually constructed with round rather than hewn, or hand-worked, logs, and were constructed quickly for frontier shelter.\nThe reproduction of the 1830 Settlers Cabin was the fifth stop on the half-mile trail loop. Interpreters showed what life was like in this time period. One example is the spinning of wool that is sometimes demonstrated by an interpreter on the front porch of the cabin. Other work involved was churning butter, making candles, and grinding coffee grounds.\nCivil War Camp: 1861–65\nThe battle at Fort Sumter in April 1861 started the American Civil War. Michigan sent 90,000 men to the war effort. About 15,000 died with over 9,000 due to disease. These men fought in many other states and spent a significant amount of time in camps like the one portrayed here. The camps were often dirty with poor hygiene. The recreated private's quarters is typical of a winter camp that enlisted Michigan soldiers lived in.\nSome of the wooden structure reproductions were in fact no larger than a dog house. Two grown men shared the small space. Other aspects of military life shown at this stop include the soldiers' food rations, their uniforms, and examples of their off-duty activities.\nLogging Shanty: 1880\nFrom 1841 to 1900 was the golden era of lumbering in Michigan. Virtually all the virgin timber was logged off. This exhibit shows a logging shanty that housed the lumberjacks. When a nearby tract of forest was cleared, this building was torn down and rebuilt in a new location.\nThis exhibit showed the work camp conditions of Michigan in the early 1880s. They showed what the lumberjacks ate, how they were dressed, and their work they had to do. Some attendees even participate at a two-man saw demonstration. The young children are encouraged to climb into one of the bunk beds and also to play checkers as the lumberjacks would have done in the evening.\nMichigan farmhouse\nNear the end of the tour was a Michigan Farm House representing circa 1900. This showed attendees the history start of agricultural development in Michigan. Here there is an orchard of apple trees. In the future, they planned a garden and some farm animals to show what early farm life in Michigan was like. Visitors were to be asked to perform household chores to get the idea. Some of those chores were baking food on an open hearth and weeding a garden.\nIn the 1900s, 60% of the population in this country lived in rural areas. Michigan's agriculture started to change from feeding a family to feeding others. This was the beginning of growing the large scale crops that remain to this day. This building shows what living in a typical farmhouse from this era was like. There was no electricity, running water and outside is an outhouse.\nCivilian Conservation Corps: 1933\nThe stock market crashed on October 29, 1929, which was a precursor and causation of the Great Depression. The nation's unemployment was 25% at the beginning. Franklin D. Roosevelt became president in 1933. One of the first things he did was form the Federal Emergency Relief Administration and the Civilian Conservation Corps (CCC) was part of that to create employment. The work provided improved deforestation erosion and soil quality. The work for the young men opened up and made available public lands that otherwise was inaccessible.\nThe Civilian Conservation Corps camp representation of a 1933 CCC tent was near the Michigan farmhouse at the end of the half-mile park tour. Groups of young people that wanted to work as park volunteers would work with the park staff from here. Some attendees that didn't especially want to be volunteers may be recruited also.\nGallery\nFile:Sargeant's quarters.jpg|Sergeant's quarters\nFile:Trading Items.jpg|Trading items\nFile:16-Person Bunkhouse.jpg|16-person logging camp bunkhouse\nFile:Sargeant and Staff.jpg|Privates' Huts and Sergeants' Cabin\nNotes\nReferences\nExternal links\n*\n*\n*\n*"
    }
  ]
}