{
  "content": [
    {
      "type": "text",
      "text": "# Mickey Dewar\n\n| image             =\n| image_size        =\n| image_upright     =\n| alt               =\n| caption           =\n| birth_name        = Michelle Sue Dewar\n| birth_date        =\n| birth_place       = Melbourne, Victoria, Australia\n| death_date        =\n| death_place       = Melbourne, Victoria, Australia\n| other_names       =\n| residence         =\n| citizenship       =\n| nationality       = Australian\n| fields            =\n| workplaces        = Museum and Art Gallery of the Northern TerritoryNorthern Territory Library\n| patrons           =\n| education         =\n| alma_mater        = University of MelbourneNorthern Territory UniversityUniversity of South Australia\n| thesis_title      = In search of the Never-Never: the Northern Territory metaphor in Australian writing\n| thesis_url        =\n| thesis_year       = 1993\n| doctoral_advisor  =\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         =\n| influences        =\n| influenced        =\n| awards            =\n| spouse            = David Ritchie\n| partner           =\n| children          =\n| signature         =\n| signature_alt     =\n| website           =\n| footnotes         =\n}}\nMichelle Sue \"Mickey\" Dewar  (1 January 1956 – 23 April 2017) was an Australian historian who specialised in the history of the Northern Territory.\nCareer\nDewar was originally from Melbourne where she studied at the University of Melbourne. She moved to the Northern Territory in 1980 to study teaching at Northern Territory University, and then worked as a teacher in the remote Milingimbi community in Arnhem Land. She completed a PhD at NTU in 1993.\nIn 1994, she joined the Museum and Art Gallery of the Northern Territory as the museum's curator of Territory history. She developed the popular Cyclone Tracy exhibition and was also in charge of heritage management of the Fannie Bay Gaol and Lyons Cottage historic sites.\nIn 2007, Dewar was awarded the Frederick Watson Fellow research grant. Her topic was: An examination of the characteristics and attributes of post-war Darwin, through a detailed and multidisciplinary study of Commonwealth public housing policy. The paper was presented at National Archives in Canberra on 28 October 2008 titled Darwin – No Place Like Home : A history of Australia’s northern capital in the 1950s through a study of housing.\nIn 2011, she won the Northern Territory History Book Award for the book Darwin – No Place Like Home.\nPersonal life\nDewar married David Ritchie. She has two children.\nDewar died on 23 April 2017 aged 61 from an aggressive form of motor neurone disease.\nShe was posthumously awarded the Medal of the Order of Australia for service to the community of the Northern Territory in the 2018 Australia Day Honours.\nPublications\n* Darwin - no place like home (2010)\n* Inside-out : a social history of Fannie Bay Gaol (1998)\n* In search of the Never-Never : looking for Australia in Northern Territory writing (1997)\n* The \"Black War\" in Arnhem Land : missionaries and the Yolngu 1908-1940 (1992)\n* '''Snorters, fools and little 'uns' : sexual politics and Territory writing in the South Australian period'' (1992)\nReferences"
    }
  ]
}