{
  "content": [
    {
      "type": "text",
      "text": "# Mick Price (Irish republican)\n\nin |native_name= instead.-->\n| honorific_suffix   =\n| birth_date      =\n| birth_place     = Phibsboro, Dublin, Ireland\n| death_date      =\n| death_place     =\n| death_cause     =\n| resting_place   = Glasnevin Cemetery\n| image              =\n| image_size         =\n| image_upright      =\n| smallimage         =\n| smallimage_alt     =\n| alt                =\n| caption            =\n| order              =\n| office             =\n| status             =\n| term_start         =\n| term_end           =\n| party               = Labour Party\n|allegiance        =\n|branch            =\n|branch_label      =\n|serviceyears      =\n|serviceyears_label =\n|rank              =\n|rank_label        =\n|servicenumber     =\n|unit              = 1st Eastern Division (Anti-Treaty IRA)\n|commands          =\n|known_for         =\n|battles           =\n* World War I\n** Sinai and Palestine campaign\n* Irish War of Independence\n* Irish Civil War\n|battles_label     =\n|awards            =\n|memorials         =\n}}\nMichael (\"Mick\") Price (29 June 1896 – 17 January 1944) was an Irish republican, revolutionary and political activist born in Phibsboro, Dublin. Although he served in the British Army during World War I, Price became involved with the Irish Volunteers  1918 and their successors the Irish Republican Army thereafter. Price was imprisoned multiple times for his activities, including his participation in IRA operations during the Irish War of Independence and Irish Civil War. He held significant roles in the Anti-Treaty IRA during the Civil War, such as quartermaster and OC of the 1st Eastern Division.\nPolitically a hardline left-winger, Price was involved in the establishment of Saor Éire and later co-founded the Republican Congress, where he advocated for it to become a vanguard party seeking a \"Worker's Republic\". After being expelled from the IRA, he would align with the Labour Party, where he played a crucial role in promoting socialist ideas. In 1943, Price was nominated to run for election but withdrew in favour of James Larkin Jnr. He died in 1944.\nPrice was notable for being one of the few republican figures to engage with the Labour Party after the establishment of Fianna Fáil in 1926.\nIrish revolutionary period\nMichael Price was born in Phibsboro, Dublin to the blacksmith Michael Price and his wife Mary Price (née Hamilton). Michael was one of four sons and two daughters in the family.\nDuring World War I Price served in the British Army and was deployed to Egypt. However, while there he was involved in an army mutiny and was returned to Ireland. Upon Price's return he became involved in the Irish Volunteers, a militant group secretly controlled by the nationalist Irish Republican Brotherhood organisation. In 1918 Price spent six months imprisoned under the false name \"James Murphy\" in Belfast, and he served a second term after he was arrested while in the offices of leading nationalist Constance Markievicz.\nPrice and his brothers Charles, Eamon, and Jack were all members of the Irish Republican Army during the Irish War of Independence, and their sister Leslie was a member of Cumann na mBan who would later marry leading revolutionary Tom Barry. Following the signing of the Anglo-Irish Treaty in December 1921 and subsequent split that occurred amongst the revolutionaries, Price sided with the Anti-Treaty IRA in the ensuing Irish Civil War. During this time, Price was captured by the National Army and imprisoned in Mountjoy. In October 1923 Seán Lemass, aware of Price's far-left political leanings, had Price transferred away from other republican prisoners to prevent Price from \"infecting them with Larkinism\". Jim Larkin was a radical labour and union organiser.     Price was later able to escape Mountjoy alongside Seán MacBride when the two were transferred by ambulance to Kilmainham Gaol in October 1923.\nContinued republican activism\nFollowing the end of the Civil war in 1923, Price continued to associate with the remnants of the Anti-Treaty IRA and by 1925 he had been named OC of the IRA's Dublin Brigade.\nIn 1926 Price was arrested alongside republicans Fiona Plunkett and Domhall O'Donohue for their involvement in IRA raids on moneylenders in Dublin City. A large portion of these raids were directed at members of Dublin's nascent Jewish community but contemporary statements from republicans organisations denied any anti-Semitism.\nIn 1929 Price was secretary of the Comhairle na Poblachta organisation, a failed attempt to unify all Anti-Treaty Republicans who remained outside the sway of the newly-formed Fianna Fáil political party. Following a riot in Dublin that same year during a public address by British Communist Willie Gallacher, Price was involved in the creation of the Labour Defence League, a Comintern-front body allying communists, trade unionists, and IRA leftists.\nIn 1931 tensions in Ireland had swelled again as the public became divided between the governing Cumann na nGaedhael government and the increasingly popular Fianna Fáil. Amidst this, Price was arrested during tense scenes in June 1931 the night before the annual Bodenstown cemetery commemoration, where Irish republicans would gather to salute the founder of the movement Wolfe Tone. The government attempted to prevent the gathering, but the rally continued nonetheless.\nIn mid-1931 Price was sent by the IRA to the United States, but in September 1931 he was present in Ireland for the founding of Saor Éire, a left-wing political party formed by IRA members. Saor Éire was quickly banned by the Cumann na nGaedhael government, in one of their last remaining acts before they were defeated by Fianna Fáil at the 1932 Irish general election.\nIn late 1932 Price attempted to become involved in the James Gralton affair in County Leitrim. Gralton was a left-wing political activist attempting to organise in one of the most conservative counties of a conservative country. Gralton 's actions drew a swift backlash locally that came to the brink of violence, and Price wanted to travel to Leitrim with Frank Ryan to speak publicly in  Gralton 's defence. The IRA army council vetoed this action, however.\nDuring a general convention of the IRA in March 1934, Price put forward a motion calling on the IRA to remain a force in Ireland until the creation of a 32-county \"Worker's Republic\". The measure secured the majority of the vote by delegates but was vetoed by the IRA's executive council. Believing they could force the IRA to follow their political direction, Price aligned with other left-wing Irish republicans such as Peadar O'Donnell, George Gilmore and Frank Ryan to form the Republican Congress. The idea of the Republican Congress was to unify all left-wing political groups in Ireland against the newly formed Fine Gael political party. The IRA quickly moved to \"court marshal\" anyone involved in the Congress. The lifespan of the Congress itself was brief; it ran aground almost instantaneously during a general meeting in Rathmines in September 1934. There, two factions argued bitterly over the direction of the organisation. One side, comprising figures such as Price, Nora Connolly O'Brien and Roddy Connolly, argued the Congress should become a militant Communist vanguard party, while figures such as O'Donnell, Ryan and Gilmore argued the Congress should be a \"United Front\" of Irish republicans of all varieties. The two factions could not resolve their differences on the night and the Congress was effectively dissolved by the end of the meeting. Afterwards, an embittered Price told a member of the United Front faction \"You have put the revolution back 100 years\".\nThereafter Price focused his activity on the Irish Citizen Army (ICA). The ICA had been active during the Easter Rising in 1916 under James Connolly, but during the following wars had been inactive, leading it to wither. The Republican Congress had attempted to re-activate the ICA as their own paramilitary wing. The in-fighting in the Congress was mirrored in the ICA; while Price was able to take control of the ICA in the wake of many departures, it was not a notable organisation after 1934.\nWith the Labour Party\nIn March 1935 Price took part in the 1935 Dublin Tram and Bus Strike, which resulted in him being jailed. Released again later the same year, he urged his supporters to follow him in joining the Labour Party. Although the Irish Labour Party in the 1920s and 1930s had carefully crafted an image that they were not a radical political party, the hardliner Price was able to become a member of Labour's administrative council in 1937. He would also eventually become secretary of Labour's constituencies council, where he was able to use his growing influence to push Labour to declare it was seeking to create a \"Worker's Republic\" in Ireland.\nIn 1943 Price was nominated by the Labour Party to stand for the 1943 Irish general election, however, Price withdrew in favour of James Larkin Jnr standing instead.\nPersonal life\nPrice died on 17 January 1944 after a short illness and was subsequently buried in Glasnevin cemetery. He was survived by a wife and four children.\nReferences"
    }
  ]
}