{
  "content": [
    {
      "type": "text",
      "text": "# Mick Murray (Irish republican)\n\nMichael Joseph Murray, also known as Squire Murray, was a Provisional Irish Republican Army volunteer, later named as an organiser of the Birmingham pub bombings, which killed 21 people on 21 November 1974.\nPersonal life\nMurray was born in Donnycarney, County Dublin and was educated at Scoil Mhuire, Marino. He ran a pub in Kilbeggan and he joined the IRA in the early 1950s. He was a father of six.\nRepublican activities\nPrior to coming to work in England, Murray had a short spell in prison in Dublin for selling Easter lilies when he was a teenager. This was illegal at the time in the Republic of Ireland as proceeds went to the IRA.Chris, Mullin, Error of Judgement 3rd Edition, Poolbeg Press, pp. 153-54.\nMurray worked in Birmingham as a labourer at a forgings and press factory, while living in Watt Road, Erdington. He was generally known in the community as \"Big Mick\".\nMurray's involvement in the  21 November 1974 bombing of the Mulberry Bush and the Tavern in the Town included choosing the targets and making the bombs. He transported the bombs to Birmingham city centre before handing them to the planters. He made the telephone warning using the codename Double X.\nThe two bombings resulted in the deaths of 21 people - mostly young people. A total of 182 were injured, many seriously. Murray later reportedly told Paddy Hill and Johnny Walker that the phone boxes to be used had been vandalised, requiring the finding of another, some distance away.Chris, Mullin, Error of Judgement 3rd Edition, Poolbeg Press, pp. 153-54.\nHe was charged with explosives offenses jointly with Michael Sheehan and James Kelly (aka Woods). All three were tried as part of the same trial that convicted the Birmingham Six. The Lord Bridge of Harwich was the presiding judge at the trial of the Birmingham Six, who were accused of bombings in Birmingham in November 1974.\nIn prison he was active in the blanket protest campaign. On release he was excluded from England and worked as a driver for An Phoblacht while resuming IRA activities. He stayed loyal to the Provisionals following the Real IRA secession, but remained a hardliner within the organisation, strongly opposing decommissioning. Many years later Murray placed a notice in An Phoblacht in memoriam to James McDade, who killed himself accidentally whilst planting a bomb in the Coventry telephone exchange just prior to the Birmingham pub bombings. He signed off as Mick from West Midlands Command of the IRA. Following his death in 1999, he was buried in Clonmellon, County Westmeath.\nReferences"
    }
  ]
}