{
  "content": [
    {
      "type": "text",
      "text": "# Middlemount, Queensland\n\n| pop                 = 1899\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4746\n| area                = 503.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 142\n| dir1                = NE\n| location1           = Emerald\n| dist2               = 149\n| dir2                = SE\n| location2           = Moranbah\n| dist3               = 246\n| dir3                = SSW\n| location3           = Mackay\n| dist4               = 902\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = Isaac Region\n| stategov            = Burdekin\n| fedgov              = Capricornia\n| elevation           =\n| maxtemp             =\n| mintemp             =\n| rainfall            =\n| near-n              = May Downs\n| near-ne             = May Downs\n| near-e              = Mackenzie River\n| near-se             = Mackenzie River\n| near-s              = Mackenzie River\n| near-sw             = Bundoora\n| near-w              = Dysart\n| near-nw             = Dysart\n}}\nMiddlemount is a rural town and locality in the Isaac Region, Queensland, Australia. In the , the locality of Middlemount had a population of 1,899 people.\nIt is nicknamed the \"Giant Peanut\" by some locals due to its peanut-shaped road layout.\nGeography\nMiddlemount is located  inland (by road) from Mackay and Rockhampton in Central Queensland. The township is an accommodation hub to both permanent residents and transient workers. Middlemount is surrounded by the following coal mines: Foxleigh, Lake Lindsay, Middlemount Mine, Aquila Mine, German Creek and world record holding underground coal mine Grasstree.\nHistory\nMiddlemount, like many other mining towns in Queensland developed quickly in the early 1980s. Middlemount Post Office opened on 2 June 1980.\nMiddlemount State School opened in 1980 with a secondary department added in 1983. In 1988 the secondary department was separated from the primary school to create Middlemount State High School. However, on 1 January 2001, the schools were amalgamated to form Middlemount Community School.\nThe Middlemount Library opened in 1984.\nMost of the housing is owned by Anglo Coal. The company operates and maintains some of the town's infrastructure. Most of the houses are almost identical, in this instance there are three types of houses; lowset L-shaped, lowset square and highset.\nApproximately 40,000 workers have been employed at Middlemount's coal mining over its 39 year history. This town has contributed to the economic development of Queensland and Australia more generally..\nDemographics\nIn the , the locality of Middlemount had a population of 1,914 people.\nIn the , the locality of Middlemount had a population of 1,841 people.\nIn the , the locality of Middlemount had a population of 1,899 people.\nMining\nThe German Creek coal mine (or Capcoal), operated by Anglo Coal, is notable as having the deepest longwall coal mine in Queensland, and also for operating Australia's only 'thin-seam' underground coal mine, using technology from the United States. It has five producing underground mines (Central, Southern, Bundoora, Grasstree and Aquila) and two open cut (open pit) mines (Oak Park and Lake Lindsay, both in neighbouring Mackenzie River). Central and Southern mines are no longer operating, Southern has become Grasstree West in 2006 and Central Closed in 2004. Aquila mine is currently in \"Care & Maintenance\" mode, pending changes to the coal market prices.\nThe Foxleigh coal mine (also in Mackenzie River) was a joint venture between Anglo American, POSCO and Nippon Steel It is currently producing around three&nbsp;million tonnes of coal for the export market. Anglo American announced that it had completed the sale of its 70% interest in the Foxleigh metallurgical coal mine in Queensland, Australia to a consortium led by Taurus Fund Management, following the announcement of the sale and purchase agreement on 4 April 2016.\nAmenities\nMiddlemount has a small shopping complex which contains a grocery store, a butchery, an Australia Post Office, a jewellery and gift store, clothing store, a medical centre, a chemist, a bakery, takeaway store and cafe, a hairdressers, and a news agency. The 'Leisure Centre' located across the parking lot from the shopping centre contains a pizza and takeaway store and cafe, a gym, and a hairdressers. Middlemount also has a pub, a local hall, hotel, a restaurant and motel, a skatepark, a local pool, and a country club.\nIsaac Regional Council operate a public library in Middlemount in the shopping centre.\nEducation\nMiddlemount Community School is a government primary and secondary (Prep–12) school for boys and girls at James Randell Drive (). In 2015, the school had an enrolment of 373 students with 32 teachers (29 full-time equivalent). In 2018, the school had an enrolment of 247 students with 27 teachers (25 full-time equivalent) and 29 non-teaching staff (17 full-time equivalent). It includes a special education program. Secondary subjects not taught at the school can be accessed via distance education.\nNotable people\nSome of Middlemount's notable former residents are Olympic cyclists Anna Meares and Kerrie Meares.\nReferences\nExternal links\n*"
    }
  ]
}