{
  "content": [
    {
      "type": "text",
      "text": "# Midlands Music Awards\n\nThe Midlands Music Awards (MMAs) are an annual award ceremony, run by the Midlands Music Organization, where accolades are presented to members of Zimbabwe's music industry who come from the Midlands Province of Zimbabwe. Winners receive a statuette.  The event was established in June 2014. The ceremony is held in June every year and contenders are judged on performances made in the previous year. The show is held at the Midlands Hotel in the capital  of the province Gweru and broadcast on Zimbabwe Broadcasting Corporation  - Zbc TV. The ceremony features  live performances by some of the nominees.\nAwards\nMMAs grouped into a number of categories which are representative of Zimbabwe's varying popular musical genres. The award is made up of 60% from the panel of judges (adjudicators) and the other 40% comes from the public through voting platforms such as sms among others.\nList of Midlands Music Awards Categories\n* Best Male Artist\n* Best Female Artist\n* Newcomer of the Year\n* Best Hip hop\n* Best Rnb and Soul music\n* Best Gospel music\n* Best Sungura music\n* Best Music Video of the Year\n* Best Jazz music\n* Best Afropop music\n* Radio Dj/Personality of the Year\n* Best Club Dj\n* Best Traditional Group\n* Best Dance Group\n* Best House music\n* Best Collaboration of the Year\n* Best Reggae/Chigiyo music\n* Best Producer of the Year\n* Best Music Album of the Year\n* Lifetime Achievement Award\nInaugural Midlands Music Awards (2014)\nThe Inaugural MMAs were held on 28 June 2014 in the capital of the province Gweru with the following awards issued:\n* Best Dancehall - Legion\n* Newcomer of the Year - Slykiezle\n* Best Hip hop - L kat\n* Best Rnb and Soul music Male - Goodchild\n* Best Rnb and Soul music Female - Marcyjay\n* Best Gospel music - Trymo Mutodza\n* Best Sungura music - Peter Moyo\n* Best Music Video of the Year - Goodchild for Arikundinyepera\n* Best Jazz music (Male) - Jazzy Jazz\n* Best Jazz music (Female) - Shingi Mangoma\n* Radio Dj/Personality of the Year - Dj Chilli (Zimbabwe Broadcasting Corporation's - Power FM)\n* Best Club Dj - Dj Stavo\n* Best House music - Mr Khoax\n* Best Collaboration of the Year - Tisanyadzise by L kat featuring Goodchild\n* Best Reggae/Chigiyo music - Bantuman I\n* Best Producer of the Year - Prince Oskid Tapfuma\n* Best Music Album of the Year - L kat for Goodlife\n* Lifetime Achievement Award - Tongai Moyo and Bob Nyabinde\n* Best Promoter of the Year - Mavis Koslek Image Modelling Agency\n2nd Annual Midlands Music Awards (2015)\nThe 2nd Annual MMAs were held on 29 June 2015 in the capital of the province Gweru with the following awards issued:\n* Best Dancehall - Lewaz Skattah for Quarter 2 Twelve\n* Newcomer of the Year - Nybal for True Gospel\n* Best Hip hop - L kat for The Golden Episode - EP\n* Best Rnb and Soul music - Valentyne for ''I'm Not Afraid\n* Best Gospel music - Mathias Mhere for Glory to Glory\n* Best Music Video of the Year - Ur Highness for Incompatible\n* Best Jazz music - Tasarina for Zvakarongeka\n* Best Afropop music - Soul Afrika for Singles Collection\n* Best Club Dj - Dj Brian and Dj Masty\n* Best House music - Shingi Mangoma for Handikusiye\n* Best Collaboration of the Year - Goodchild and Dj Neo for Nakuyewa\n* Best Reggae/Chigiyo music - Joe Wailer for Beautiful Zimbabwe\n* Best Producer of the Year - Prince Oskid Tapfuma\n* Best Music Album of the Year - Mathias Mhere for Glory to Glory''\n* Lifetime Achievement Award - Ismael Petker of Mahogany Sounds\nReferences"
    }
  ]
}