{
  "content": [
    {
      "type": "text",
      "text": "# Mierzanowice culture\n\nThe Mierzanowice culture appeared in the area of the upper and middle basin of the Vistula, during the Early Bronze Age. It evolved from the so-called Proto-Mierzanowice cultural unit. The name of the culture comes from an eponymous site in Mierzanowice, where the cemetery was located. This entity was part of the pre-carpathian sphere of epicorded cultures and it has been divided into three local groups: Samborzecka, Iwanowicka and Pleszowska. The initial phases of the culture are characterized by a small number of burials, seasonal settlements and single artifacts. The area of the Mierzanowice culture spread over from western Slovakia, through south - eastern Poland, reaching in the east the areas of the Volhynian Upland. It was followed by the Trzciniec culture.\nChronology\nBased on relative dating, the Mierzanowice culture appeared in the Early Bronze Age. According to the archaeologist Jan Machnik, we can distinguish an older and a younger phase of this cultural unit. The discovery in Szarbia Zwierzyniecka allowed for a certain \"rejuvenation\" of the Mierzanowice culture as a result of the distinction of its late phase called szarbiańska. The younger phase of the Mierzanowice culture ended at the end of \"Bronze A1\" and the beginning of \"Bronze A2\" according to Paul Reinecke's chronology.\nBurial\nCemeteries of the Mierzanowice cultural population were established near the settlements. The largest cemeteries were from 150 to 300 burials. Burials occurred mainly in skeletal form. Human remains were put into oval or rectangular burial pits or in coffins made of wooden logs. There were two systems for arranging human corpses: in the shrunken position and in straight position. The bodies of men were buried on the right side while corpses of women on the left side. The results of investigations conducted at the cemeteries of the Mierzanowice culture, showed a small advantage of men's graves over women's graves, which had a slightly poorer grave inventory.\nSettlement\nProto-Mierzanowice appears with the arrival of Bell Beakers in the west part of Lesser Poland, around 2400–2300 BC, possibly representing an infiltration of groups rather than a massive migration. These groups were very mobile, with traces found from Moravia to Volhynia. Settlements of the Mierzanowice culture in most cases are represented by small and seasonal camps. Settlements with a larger area were founded on the hills with a naturally defensive character, near water reservoirs. A relatively large part of the archaeological sites of this culture are found on loess uplands. The best-known settlement of the Mierzanowice culture is the archaeological site called Iwanowice. In the classical phase of the Mierzanowice culture, the settlements were mostly accompanied by cemeteries.\nArtefacts\nOne of the most common objects discovered in archaeological sites in the Mierzanowice culture are axes and sickles. Another type of artifacts are necklaces made of faience and bones. The Mierzanowice culture is well known for its earrings in the shape of a willow leaf, often produced in local workshops. Military objects discovered in the settlements are primarily leaf-shaped arrowheads. The faience beads are an extremely common element of the funeral inventory. The next category is pottery. In vascular ceramics, the influences of the Corded Ware culture are visible. Pottery of the late phase of the Mierzanowice culture is characterized by a huge variety of forms and ornamentation. Musical Panpipes made from bone have been found in Mierzanowice sites. Shell beads, bone pendants, ceramic vessels and other artifacts found in the graves indicate a rich and complex culture.\nGallery\nFile:Flint weapons and sickles, Mierzanowice culture.png|Flint weapons and sickles\nFile:020210817 Bronze Age cultures area in the San river basin, Mierzanowice culture artifacts, 2300-1600 BC, Przemyśl.jpg|Pottery and bronze axe fragment\nFile:Mierzanowice culture faience bead necklace from Jawczyce, Lesser Poland.png|Faience bead necklace from Jawczyce, Poland\nFile:Reconstruction of a Mierzanowice culture barrow in Jawczyce, Lesser Poland.png|Reconstruction of a barrow from Jawczyce, Poland\nFile:Yamnaya wagon illustration.jpg|Illustration of a Mierzanowice culture wagon\nFile:Horses1.png|The Mierzanowice culture had domesticated horses.\nGenetics\nJuras et al. (2020) examined the mtDNA of 39 individuals ascribed to the Mierzanowice culture. The individuals appeared to be closely related to peoples of the Corded Ware culture, Bell Beaker culture, Unetice culture, and the Trzciniec culture but were notably genetically different from peoples of the neighboring Strzyżów culture, which displayed closer genetic relations to cultures further east.\nBibliography\n* }}\n* Górski J., Kadrow S., Kultura mierzanowicka i kultura trzciniecka w zachodniej Małopolsce – problem zmiany kulturowej, [w:] Sprawozdania archeologiczne, T. XLVIII, 1996, Kraków.\n* Kadrow S., Machnik J., Kultura mierzanowicka: chronologia, taksonomia i rozwój przestrzenny, wyd. oddziału PAN, 1997, Kraków.\n* Kmieciński J., Pradzieje Ziem Polskich, T.I, cz.2 Epoka Brązu i początki Epoki Żelaza, wyd. PWN, 1989, Warszawa-Łódź.\nReferences\nWorks cited\n*"
    }
  ]
}