{
  "content": [
    {
      "type": "text",
      "text": "# Mighty Morphin Power Rangers: Mega Battle\n\nMighty Morphin Power Rangers: Mega Battle is a beat 'em up video game based on the Mighty Morphin Power Rangers television series, developed by Peruvian studio Bamtang Games. It was first announced in October 2016. It was released on January 17, 2017. The game never received a physical release and was only available via digital download.\nGameplay\nThe game takes players through the first two seasons of Mighty Morphin Power Rangers. Up to four players can play as any of the original Mighty Morphin Power Rangers (Jason, Zack, Kimberly, Billy, Trini or Tommy) and features Rita Repulsa's army of monsters.\nExperience orbs can be collected to purchase health upgrades power ups for attacks and a level select is unlocked after clearing the game. MMPR 2 Tommy appears as DLC as does Rocky, Adam, Aisha and Katherine (replacing Jason, Zack, Trini and Kimberly) for the team. MMPR 2 Billy is also a DLC character.\nStory\nThe story begins with all five teenagers arriving in Angel Grove Park beginning training until they approach a crystal. They also encounter with Bulk and Skull until the Putty Patrol continue to show one by one. Soon as the alarming numbers of Putties surround the teenagers, they're teleported to the command center. Alpha 5 and Zordon introduce themselves to the teens and a re-imagination of the first episodes coronation of making the teens rangers tends to happen. The team is sent out to fight off the Putty Patrol again; they now have the ability to morph to their ranger forms. Along the way they encounter the Mighty Minotaur, the Knasty Knight, Madame Woe, and Twin Man as a sub-bosses, the Tenga Warriors who replace the Putty Patrol when Lord Zedd replaces Rita later for failing to defeat the Power Rangers.\nAs towers appear in the city, the rangers and their megazord destroy the towers and fight off the mega monster forms of Sepenterra, King Sphinx and Goldar no less. Tommy (brainwashed as the Evil Green Ranger) fights the rangers but eventually joins the team. Lord Zedd is defeated and the power rangers celebrate their victory.\nKing Sphinx, a monster from the 4th episode of Mighty Morphin Power Rangers, is a boss in the game.\nReception\nXONE: 46/100\n| Destruct = 3.5/10\n| HCG = 2/5\n| SN = 5/10\n}}\nThe game received \"generally unfavorable reviews\" according to Metacritic.\nReferences\nExternal links\n* [https://www.bandainamcoent.com/games/prmb Bandai Namco Entertainment website]\n* [https://www.imdb.com/title/tt6432760/mediaindex?ref_=tt_mv_close Mighty Morphin Power Rangers: Mega Battle] on IMDb."
    }
  ]
}