{
  "content": [
    {
      "type": "text",
      "text": "# Migration period of ancient Burma\n\n]]\nHumans lived in the region that is now Burma as early as 11,000 years ago, but archeological evidence dates the first settlements at about 2500 BCE with cattle rearing and the production of bronze. By about 1500 BCE, ironworks were in existence in the Irrawaddy Valley but cities, and the emergence of city-states, probably did not occur until the early years of the Common era when advances in irrigation systems and the building of canals allowed for year-long agriculture and the consolidation of settlements, although local mythology dates back to c. 1000-600 BC with the immigration of some people from janapadas, ancient countries in modern-day India.\nThe first identifiable civilisation which inhabited modern-day Burma is that of the Mon. They settled in the Ayeyarwady River delta area and along the Taninthayi coast. The proto-Burmans, the Pyu, settled in and around Pyay, and in the northwestern Ayeyarwady valley. Traces of their presence can be found in Sri Ksetra near Pyay, and in Beikthano in central Burma. The Mon are believed to have begun migrating into the area in about 3000 BC, and their first kingdom Suvarṇabhūmi (pronounced Thu-wenna-bhu-mi by Myanmar people) was centred on the port city of Thaton, which itself was established around 300 BC.\nArtifacts from the excavated site of Nyaung-gan help to reconstruct Bronze Age life in Burma and the more recent archaeological evidence at Samon Valley south of Mandalay suggests rice growing settlements between about 500 BC and 200 AD which traded with Qin and Han dynasty China.\nTimeline\n*750,000–275,000 years B.P. Lower Palaeolithic men (early Anyathian) live alone; the bank of the Ayeyawaddy river.\n*275,000–25,000 years B.P. Lower Palaeolithic men (late Anyathian) live along the bank of the Ayeyarwady river and central Burma\n*11,000 years B.P. Upper Palaeolithic men live in Badahlin caves which situated in Ywagan township in southern Shan States.\n*7000–2000 BCE. Neolithic men live in central Burma Kachin State, Shan States, Mon State, Taninthayi Division, and along the bank of the Chindwin and Ayeyarwady rivers.\n*1000–800 BCE. Bronze Age Culture\n*600–500 BCE. Iron Age Culture\nOut of Africa\nBetween 60,000 and 100,000 years ago, Homo sapiens came to Southeast Asia by migrating from Africa, known as the \"Out of Africa\" model. Homo sapiens are believed to have migrated through the Middle East on their way out of Africa about 100,000 years ago.\nHomo sapiens migration map, based upon DNA markers\nFile:Human spreading over history.png|Homo sapiens migration map, based upon DNA markers\nHistorical migration of human populations begins with the movement of Homo erectus out of Africa across Eurasia about a million years ago. Homo sapiens appear to have occupied all of Africa about 150,000 years ago, moved out of Africa 70,000 years ago, and had spread across Australia, Asia and Europe by 40,000 years. Early members of the genus Homo, i.e. Homo ergaster, Homo erectus and Homo heidelbergensis, migrated from Africa during the Early Pleistocene, possibly as a result of the operation of the Saharan pump, around 1.9 million years ago, and dispersed throughout most of the Old World, reaching as far as Southeast Asia. Modern humans, Homo sapiens, evolved in Africa up to 200,000 years ago and reached the Near East around 70 millennia ago. From the Near East, these populations spread east to South Asia by 50 millennia ago.\nThe Indo-European migration had variously been dated to the end of the Neolithic (Marija Gimbutas: Corded ware, Yamna, Kurgan), the early Neolithic (Colin Renfrew: Starčevo-Körös, Linearbandkeramic) and the late Palaeolithic (Marcel Otte, Paleolithic continuity theory).\nThe speakers of the Proto-Indo-European language are usually believed to have originated to the north of the Black Sea (today Eastern Ukraine and Southern Russia), and from there they gradually migrated into, and spread their language by cultural diffusion to, Anatolia, Europe, and Central Asia, Iran and South Asia starting from around the end of the Neolithic period (see Kurgan hypothesis).\nThrough China\nSoutheast Asia Map\nTaiwan is the urheimat of the Austronesian languages. Archaeological evidence suggests that speakers of pre-Proto-Austronesian spread from the South Chinese mainland to Taiwan at some time around 8,000 years ago. Evidence from historical linguistics suggests that it is from this island that seafaring peoples migrated, perhaps in distinct waves separated by millennia, to the entire region encompassed by the Austronesian languages. It is believed that this migration began around 6,000 years ago.\nThe prehistory of Taiwan includes the late Paleolithic era. During that time, roughly 50,000 BC to 10,000 BC, people were already living in Taiwan. The Pacific islands of Polynesia began to be colonized around 1300 BC, and completely colonized by around 900 AD. The descendants of Polynesians left Taiwan around 5200 years ago. Salones and Pashu (Malays of Burma) arrived southern Burma through this sea route.\nThe flow of rivers from Tibet's Tibetan Plateau, into Burma form the natural highways for migration.\nWhen Han Chinese invaded Taiwan, the ethnic minorities (including Tibeto-Burmans, Shans and Mons of future Burma) shifted to the mainland. Some historians believe that those ethnic minorities first came to settle north of the Yellow river (Huang He) round about 2515 BC. The Chinese annals also mentioned about their presence in the middle basin of the Yellow River in 850 BC. But new emigrants coming from Central Asia later impelled those ethnic groups to move southwards to new fertile areas between the Yellow and Yangtze (Chang Jiang) rivers and then migrated down through the present day Yunnan and descended further down into Burma.\nSixteen kingdoms were a plethora of short-lived non-Chinese dynasties that came to rule the whole or parts of northern China in the 4th and 5th centuries. Many ethnic groups were involved, including ancestors of the Turks, Mongolians, and Tibetans.\nChinese history is that of a dynasty alternating between periods of political unity and disunity and occasionally becoming dominated by foreign Asian peoples, most of whom were assimilated into the Han Chinese population. Cultural and political influences from many parts of Asia, carried by successive waves of immigration, expansion, and assimilation, merged to create modern Chinese culture.\nThe History of Yunnan is related to Burma, can date back to Yuanmou Man, a Homo erectus fossil, the oldest known hominid fossil in China. By the Neolithic period, there were human settlements in the area of Lake Dian. These people used stone tools and constructed simple wooden structures. Yunnan's location in the southwesternmost corner of China and its peoples have the strong ethnic identities are due to cultural and political influences from Burma. In 109 BC, Emperor Wu sent General Guo Chang (郭昌) south to Yunnan, establishing Yizhou commandery and 24 subordinate counties. The commandery seat was at Dianchi county (present day Jinning 晋宁). Another county was called \"Yunnan\", probably the first use of the name. To expand the burgeoning trade with Burma and India. Anthropologists have determined that these people were related to the people now known as the Tai. They lived in tribal congregations, sometimes led by exile Chinese. In the Records of the Grand Historian, Zhang Qian (died 113 BC) and Sima Qian (145–90 BC) make references to \"Shendu\", which may have been referring to the Indus Valley (the Sindh province in modern Pakistan), originally known as \"Sindhu\" in Sanskrit. When Yunnan was annexed by the Han Dynasty, Chinese authorities also reported a Shendu\" (Indian) community living in the area. The Mongols established regular and tight administrative control over Yunnan. In 1253 Möngke Khan of the Mongol Empire dispatched the prince Kublai to take Yunnan. The Mongols swept away numerous native regimes, including the leading Dali kingdom. Later Yunnan became one of the ten provinces set up by Kubilai Khan. Kublai Khan appointed Turkmen Sayyid Ajjal Shams al-Din Omar governor in Yunnan in 1273.\nHistory of Tibet is also related to prehistoric Burma. It is situated between the two ancient civilizations of China and India, separated from the former by the mountain ranges to the east of the Tibetan Plateau and from the latter by the towering Himalayas. Tibet is nicknamed \"the roof of the world\" or \"the land of snows\". The Tibetan language and its dialects are classified as members of the Tibeto-Burman language family. Humans inhabited the Tibetan Plateau at least twenty one thousand years ago. This population was largely replaced around 3,000 BP by Neolithic immigrants from northern China. However, there is a \"partial genetic continuity between the Paleolithic inhabitants and the contemporary Tibetan populations\". Some archaeological data suggests humans may have passed through Tibet at the time India was first inhabited, half a million years ago. The first documented contact between the Tibetans and the Mongols occurred when Genghis Khan met Tsangpa Dunkhurwa (Gtsang pa Dung khur ba) and six of his disciples, probably in the Tangut empire, in 1215.\nThrough India\nPaleolithic sites have been discovered in Pothohar near Pakistan's capital Islamabad, with the stone tools of the Soan Culture. In ancient Gandhara, near Islamabad, evidence of cave dwellers dated 15,000 years ago has been discovered at Mardan.\nThe major cities of the Indus Valley civilization, such as Harappa and Mohenjo-daro, date back to around 3300 BC, and represent some of the largest human habitations of the ancient world.\nIt is believed that the migration in and out of India began around 6,000 years ago. Indo-Aryan migration to and within Northern India is consequently presumed to have taken place in the Middle to Late Bronze Age, contemporary to the Late Harappan phase in India (c. 1700 to 1300 BC). From 180&nbsp;BC, a series of invasions from Central Asia followed, including those led by the Indo-Greeks, Indo-Scythians, Indo-Parthians and Kushans in the north-western Indian subcontinent. The word \"India\" is derived from the Indus River.  In ancient times, \"India\" initially referred to the region of modern-day Pakistan along the Indus river, but by 300 BC, Greek writers like Megasthenes applied the term to the entire subcontinent.:)\nHistory of South India especially Chola Empire is related to prehistoric Burma. One of the most powerful rulers of the Chola kingdom was Raja Raja Chola.  He ruled from 985&ndash;1014 CE.  His army conquered the Navy of the Cheras at Thiruvananthapuram, and annexed Anuradhapura and the northern province of Ceylon. Rajendra Chola I completed the conquest of Sri Lanka, invaded Bengal, and undertook a great naval campaign that occupied parts of Malaya, Burma, and Sumatra.\nSince 500 BC Buddhist Orrisa colonists had migrated towards Southeast and settled in future Burma's Irrawaddy Delta and built pagodas.\nIn 180 BC migrants from the Hindu colonists, of Telugu Dynasty, from middle India settled in lower part of future Burma and established Hanthawaddy (Mon town) and Syriam (Ta Nyin or Than Lyin) in Burma.\nIndian Dravidian tribe in Panthwa In Chinese Chronicles Chen Yi-Sein instead gives an Indian derivation for Panthwa village, as the name of a Dravidian tribe settled in Mon's areas around the Gulf of Martaban. This group was later one of the pioneers in a 'Monized' occupation of Beikthano village, which also led to the village/city being called Ramanna-pura, linked to Mon areas of southern Burma (1999:77).\nAccording to Burmese mythology, Abhiraja, who had been a king from a janapada and lost in war, left India and migrated to Ayarwaddy river, founding the Tagaung dynasty. The events from the myths refer to the time around 1000–600 BC. The Tagaung dynasty is explicitly incorporated into the story of Duttabaung's mother and father; the lineage of the Queen of Beikthano is less consistent, but always intertwined with that of the Sri Kestra village rulers. In all of these, links are made between territorial control, royal patronage of Hindu or Buddhist sects and supernatural events.\nLittle is known about life in early Burma but there is evidence that land and sea traders from China and India passed by and left their mark on the region and the local people traded ivory, precious stones, gold and silver, rhinoceros horns, and horses with these traders. Roman envoys from Alexandria also passed through the Irrawaddy valley in 79 CE en route to China. 2nd century Burmese sea-farers, trading with Southern India across the Bay of Bengal, are thought to have brought Buddhism to Burma in the 2nd century CE. and by the 4th century, much of the Irrawaddy Valley was Buddhist including the then dominant city-state, Prome (modern Pyay).\nMizos were part of a great wave of migration from China and later moved out to India to their present habitat. It is possible that the Mizos came from Sinlung or Chhinlungsan located on the banks of the Yalung River in China, first settled in the Shan State and moved on to the Kabaw Valley.\nThe Naga were originally referred to as Naka in Burmese languages, which means 'people with pierced ears'. The Naga tribes had socio-economic and political links with tribes in Assam and Burma (Myanmar); even today a large population of Naga inhabits Assam. Following an invasion in 1816, the area, along with Assam, came under direct rule of Burma up to the time British East India Company took control of Assam in 1826 following the Treaty of Yandaboo of 1826. The history of Assam is the history of a confluence of peoples from the east, west and the north; the confluence of the Indo-Aryan, Austro-Asiatic and Tibeto-Burman cultures. The Late neolithic cultures have affinities with the spread of the Mon Khmer speaking people from Malaysia and the Ayeyarwady valley and late neolithic developments in South China.  Since these cultures have been dated to 4500–4000 BCE, the Assam sites are dated to approximately that period.\nEarliest migrants amongst Burmese\nTrans-Asian trade routes, 1st century CEMons or Talaings, an Ethnic Minority Group of Burma, migrated from the Talingana State, Telangana region of Southern India. They mixed with the new migrants of Mongol from China and driven out the above Andhra and Orissa colonists. The Mon probably began migrating down from China into the area in about 3000 BC.\nThose Mon (Talaings) brought with them the culture, arts, literature, religion and all the skills of civilisation of present Burma. They founded the Thaton and Bago (Pegu) Kingdoms.  King Anawrahta (whose Sanskrit name was Aniruddha) of Bagan (Pagan) conquered that Mon Kingdom of King Manuha, named Suvannabumi (The Land of Golden Hues).\nThe conquest of Thaton in 1057 was a decisive event in Burmese history. It brought the Burman into direct contact with the Indian civilizing influences in the south and opened the way for intercourse with Buddhist centres overseas, especially Sri Lanka. Those Bagan Burmese people of central Burma had Theravada Buddhism spreading from Mons. In the next decade, Burmese or Myanmar language was gradually derived from Sanskrit, Pali, Pyu and Mon languages.\nThe evidence of the inscriptions, Luce warns us, shows that the Buddhism of Pagan 'was mixed up with Hindu Brahmanic cults, Vaisnavism in particular.\nWhile little is known about the early people of Burma, the Mon were the first of the modern ethnic groups to migrate into the region, starting around 1500 BCE. Oral tradition suggests that they had contact with Buddhism via seafaring as early as the 3rd century BCE, though definitely by the 2nd century BCE when they received an envoy of monks from Ashoka.  Much of the Mon's written records have been destroyed through wars. The Mons blended Indian and Mon cultures together in a hybrid of the two civilisations. By the mid-9th century, they had come to dominate all of southern Burma.\nForefathers of Bamars\n]]\nThe Burmese language is a Tibeto-Burman language and closely related to the Yi language or Nuosu, which is today spoken mainly in Yunnan but also in parts of Sichuan and Guizhou provinces in China.  Until a thousand years ago, Tibeto-Burman and more specifically Burmese-Yi speaking peoples were much more widespread, across Yunnan and Guizhou and southern Sichuan as well as northern Burma.  During the Han dynasty in China, Yunnan was ruled primarily by the Burmese-Yi speaking Dian and Yelang kingdoms.  During the Tang dynasty in China, Yunnan as well as northern Burma was ruled by the Burmese-Yi speaking Nanzhao kingdom (until the 1960s mistakenly thought to be Tai-speaking).  It was during this Burmese-Yi Nanzhao domination of northern Burma that the first Burmese-Yi speakers probably entered the Irrawaddy valley in large numbers, and established the outpost of Pagan or Bagan.  The naming system of the earliest Bagan kings is identical to the naming system of the Nanzhao kings.  Sculptures found in Halin to the north are almost identical to Nanzhao sculptures.  The Tanguts of Xixia (to the north of Yunnan around this time) spoke a Tibeto-Burman language that may also have been close to Burmese-Yi.  Going further back in time, the people of the ancient kingdom of Sanxingdui in Sichuan (in the 12th–11th centuries BCE) were probably ancestral to the later Tibet-Burmans and perhaps even more narrowly to the ancestors of the Burmese-Yi speakers at Dian and Yelang.\nGeography that facilitated the migration of Tibeto-Burman, Shans and Mons\nTopographical map covering southwestern China\nNumerous ethnic Burmese peoples had migrated from Yunnan, which is situated in southwest China, bounded on the north by Sichuan and Sizang (Sikang), on the east by Guizhou and Guangxi, on the south by Vietnam and Burma, and on the west by Burma and Assam. It is extremely mountainous with only a limited area of level plains.\nIt is furrowed by the Taiping, Shweli, Salween, Mekong, Black and Red rivers.\nThe Salween and the Mekong are rivers of great length, having their sources in the interior part of Tibet, and flowing through Yunnan and the neighboring lands of Burma, Laos, Thailand, Cambodia and Vietnam.\nThe basins of these rivers and their tributaries form deep, narrow valleys which, with the high parallel mountain ranges running generally north and south, constitute a favourable home for numerous ethnic minorities.\nYunnan shares a long common border with Burma and many ethnic groups that live in Yunnan can also be found in Burma.\nIndian and Burmese settlement in Arakan\nThe Arakanese chronicles claim that the Kingdom was founded in 2666 BC.\nWesali or Vaisali was founded by the Chandra Dynasty. \"The area known as North Arakan had been for many years before the 8th century the seat of Hindu dynasties. In 788 AD a new dynasty, known as the Chandras, founded the city of Wesali. This city became a noted trade port to which as many as a thousand ships came annually; the Chandra kings were upholders of Buddhism, ... their territory extended as far north as Chittagong;---- Wesali was an easterly Hindu kingdom of Bengal --- Both government and people were Indian. So far as Arakan is concerned, the inscriptions show traces of two early dynasties holding sway in the north. The earlier one, a Candra dynasty, seems to have been founded in the middle of the 4th century AD. Its capital was known by the Indian name of Vaisali and it maintained close connections with India. Thirteen kings of this dynasty are said to have reigned for a total period of 230 years. The second dynasty was founded in the 8th century by a ruler referred to as Sri Dharmavijaya, who was of pure Kshatriya descent. His grandson married a daughter of the Pyu king of Sri Ksetra.\nHindu statues and inscriptions were found in Wesali. The ruins of old capital of Arakan – Wesali show Hindu statues and inscriptions of the 8th century. Although the Chandras usually held Buddhistic doctrines, there is reason to believe that Brahmanism and Buddhism flourished side by side in the capital.\n\"The Burmese do not seem to have settled in Arakan until possibly as late as the tenth century AD. Hence earlier dynasties are thought to have been Indian, ruling over a population similar to that of Bengal.  All the capitals known to history have been in the north near modern Akyab\".\nSalones (Moken) and Pashus (Malays)\nIn the southernmost part of Burma, the Salones (Moken) and Pashus (Malays) migrated into Burma from the south and sea since prehistoric time.\nThe Burmese call the Moken Selung, Salone, or Chalome. In Thailand they are called Chao Ley (people of the sea) or Chao nam (people of the water), although these terms are also used loosely to include the Urak Lawoi and even the Orang Laut. In Thailand, acculturated Moken are called Thai Mai (new Thais).\nThe Moken are also called Sea Gypsies, a generic term that applies to a number of peoples in southeast Asia.  The Urak Lawoi are sometimes classified with the Moken, but they are linguistically and ethnologically distinct, being much more closely related to the Malay people.\nThey refer to themselves as Moken. The name is used for all of the proto-Malayan speaking tribes who inhabit the coast and islands in the Andaman Sea on the west coast of Thailand, the provinces of Satun, Trang, Krabi, Phuket, Phang Nga, and Ranong, up through the Mergui Archipelago of Burma. The group includes the Moken proper, the Moklen (Moklem), the Orang Sireh (Betel-leaf people) and the Orang Lanta.  The last, the Orang Lanta are a hybridized group formed when the Malay people settled the Lanta islands where the proto-Malay Orang Sireh had been living.\nSee also\n* Prehistoric Asia\n* Pre-modern human migration\nNotes\nReferences\nFurther reading\n*Myint-U, Thant (2006), The River of Lost Footsteps: Histories of Burma, New York: Farrar, Straus and Giroux, p.&nbsp;45, >\n*Dr Than Tun (History Professor, Mandalay University) The Story of Myanmar told in pictures.\n*Professor U Than Tun M.A., B.L., D. Lit., PhD Bagan Culture\n*Professor U Than Tun M.A., B.L., D. Lit., PhD Ancient Pyu\n*The Muslims of Burma: A study of a minority Group, by Moshe Yegar, 1972, Otto Harrassowitz. Wiesbaden.\n*D. G . E. HALL, M.A., D.LIT., F.R.HIST.S.Professor Emeritus of the University of London and formerly professor of history in the University of Rangoon, Burma. Third edition\n*Luce, G. H., \"Burma's Debt to Pagan\", Journal of the Burma Research Society, Vol. XXII,\n*H G E Hall, History of Southeast Asia\n*Elliot, Sir H. M., Edited by Dowson, John. The History of India, as Told by Its Own Historians. The Muhammadan Period; published by London Trubner Company 1867–1877. (Online Copy: [https://web.archive.org/web/20070929125948/http://persian.packhum.org/persian/index.jsp?serv=pf&file=80201010&ct=0 The History of India, as Told by Its Own Historians. The Muhammadan Period; by Sir H. M. Elliot; Edited by John Dowson; London Trubner Company 1867–1877] – This online copy has been posted by: [https://web.archive.org/web/20070929132016/http://persian.packhum.org/persian/index.jsp The Packard Humanities Institute; Persian Texts in Translation; Also find other historical books: Author List and Title List])\n*A.P. Phayre, History of Burma, London, 1883\n*M.S. Collis, \"Arakan's place in the civilization of the Bay\", Journal of the Burma Research Society, 50th Anniversary publications No.2, Rangoon, 1960\n*Anderson, John (1890) The Selungs of the Mergui Archipelago, Trübner & Co., London"
    }
  ]
}