{
  "content": [
    {
      "type": "text",
      "text": "# Mike Edwards (basketball)\n\nMike Edwards (born early 1950s) is an American former basketball player best known for his high school and collegiate careers in the United States rather than his professional career in Mexico. He played for the University of Tennessee between 1970–71 and 1972–73 and was named the 1972 co-Southeastern Conference Men's Basketball Player of the Year. He has been enshrined in the Indiana Basketball Hall of Fame as part of its Class of 2003, and in February 2009 was chosen to the Tennessee All-Century Team, commemorating the greatest 20 players in program history.\nHigh school\nA native of Greenfield, Indiana, Edwards starred at Greenfield High School from 1965–66 to 1968–69. During his four-year career, the 6'2\", 180-pound shooting guard scored 2,343 points and averaged 34.4 points per game between his junior and senior years. His 36.4 points per game average in 1968–69 led the state and he was named a high school All-American. Edwards earned the nickname the \"Greenfield Gunner\" for his shooting and scoring abilities. When it came to his decision to play for the Volunteers, Tennessee's head coach Ray Mears offered Edwards a scholarship without even having seen him play competitively in person. Mears was attending a coaching clinic at Ball State University and told Edwards to take some jump shots from the perimeter. Edwards impressed Mears, and the next fall he was enrolled at the school.\nCollege and later life\nDue to NCAA eligibility rules at the time, college freshmen were not allowed to play varsity sports. Edwards played for Tennessee's freshman team in 1969–70 and averaged 30.1 points per game on the team. He was able to play varsity from his sophomore through senior years, and in just three seasons he scored 1,343 points in 77 career games. He scored 572 field goals on 1,265 attempts during an era when no three-point field goal line existed. As a pure jumpshooter, Edwards later claimed that it \"would have been interesting\" to see how many more points he would have scored if a three-point line had existed.\nIn his first varsity season the Volunteers earned a berth into the 1971 National Invitation Tournament, reaching the quarterfinals before bowing out to Duke, 74–68. They finished in second place in the SEC with a 13–5 conference record. The following year, Edwards helped lead Tennessee to an SEC regular season co-championship with Kentucky behind a 14–4 conference record. They did not qualify for any postseason tournament, although Edwards was named the co-SEC Player of the Year. In addition, he was named an Academic All-American. In 1972–73, Edwards final season, the Volunteers tied for second place with two other schools and once again failed to earn any postseason berths. Edwards concluded his collegiate career with a second consecutive All-SEC First Team selection as well as a third consecutive Academic All-SEC selection.\nAfter college he played professionally in Mexico before officially retiring from basketball. He then got into coaching, first at various high schools and then at Emory and Henry College, Maryville College and finally Carson–Newman University. Eventually he switched careers and now is a high school teacher at William Blount High School in Maryville, Tennessee, having formerly taught at Farragut High School in Knoxville, Tennessee.\nOn June 9, 1973, he married Debra J. McCulley from Maryville, TN.\nReferences"
    }
  ]
}