{
  "content": [
    {
      "type": "text",
      "text": "# Mike Huckabee 2016 presidential campaign\n\n}}\n| fec_date     = 2015-12-31\n| slogan       =\n| themesong    =\n| chant        =\n| website      = [https://web.archive.org/web/20160131035534/https://www.mikehuckabee.com/home www.mikehuckabee.com](archived - January 31, 2016)\n}}\nin January 2016]]\nThe 2016 presidential campaign of Mike Huckabee, the 44th Governor of Arkansas, began on May 5, 2015, at an event in his hometown of Hope, Arkansas. Huckabee's candidacy for the Republican nomination in the 2016 presidential election was his second, after having previously run in 2008.  Following a disappointing showing in the Iowa caucuses, Huckabee ended his run on February 1, 2016.\nBackground\n2008 presidential election\nHuckabee was a candidate for the Republican nomination for the presidency in 2008. In the number of states won and popular vote, Huckabee came in third behind former Massachusetts governor (and future 2012 nominee) Mitt Romney and eventual nominee Arizona senator John McCain. In terms of total delegate count, he came in second behind McCain.\nPost-2008 election\n(CPAC) in National Harbor, Maryland]]\nFollowing his defeat in the 2008 election, Huckabee became the host of the eponymous show Huckabee on Fox News Channel (FNC). In a November 19, 2008, article by the Associated Press, Huckabee addressed the possibility of running for president in 2012. He said, \"I'm not ruling anything out for the future, but I'm not making any specific plans\". A June 2009 CNN/Opinion Research Corporation national poll showed Huckabee as the 2012 presidential co-favorite of the Republican electorate along with Palin and Romney. An October 2009 poll of Republicans by Rasmussen Reports put Huckabee in the lead with 29%, followed by Romney on 24% and Palin on 18%. On May 14, 2011, Huckabee announced on his FNC show that he would not be a candidate for the GOP presidential nomination in 2012. Despite his high national poll numbers and being seen by many as the front runner, Huckabee declined to run, saying, \"All the factors say 'go', but my heart says 'no'.\"\nSeveral political commentators speculated that Huckabee might be ready for another presidential run in 2016. He had been hindered by a lack of money in 2008 but with changes to federal election law allowing SuperPACs to pour large sums of money into a race he might be better positioned to stay in the race.  Huckabee has in addition earned personal wealth since 2008 on the lecture circuit and his TV and radio shows. He ended his daily radio show in December 2013 which strengthened speculations about a presidential bid. Huckabee indicated in September 2014 that he would make the decision on whether to run early in 2015. In January 2015, Huckabee ended his show on FNC to prepare for his possible run in the 2016 presidential election.\nCampaign\nOn May 5, 2015, Huckabee officially declared his candidacy at a rally in his hometown of Hope, Arkansas.\nIn September Ted Cruz visited Kentucky in support of the release of Kim Davis, but reportedly was blocked by an aide to Huckabee from appearing alongside her.\nOn November 8, 2015, Huckabee participated at the National Religious Liberties Conference alongside Bobby Jindal and Ted Cruz, and said that \"our religious liberties are under assault\". Conservative radio host Kevin Swanson, who hosted the conference, advocated for the execution of homosexuals in his speech. Two other speakers at the conference, Reverend Phillip Kayser and Joel McDurmon, have also spoken of the death penalty for homosexual acts.\nIn the 2016 Iowa Republican caucuses, Huckabee finished in ninth place with 3,345 votes, or 1.8% of the votes cast. He subsequently withdrew from the campaign.\nEndorsements\nU.S. governors (current and former)\n* Sonny Perdue, 81st Governor of Georgia (2003–2011)\n}}\nU.S. senators (current)\n}}\nU.S. representatives\n* Arkansas: Rick Crawford, French Hill, Bruce Westerman\n* California: Duncan D. Hunter\n* Georgia: John Linder (former)\n* North Carolina: Charles H. Taylor (former)\n* Tennessee: Chuck Fleischmann\n}}\nStatewide officials\n* Arkansas: Tim Griffin (Lieutenant Governor), Leslie Rutledge (Attorney General), Mark Martin (Secretary of State), Dennis Milligan (Treasurer), John Thurston (Land Commissioner)\n* South Carolina:  André Bauer (former Lieutenant Governor)\n}}\nState legislators\nCharlene Fite, Mickey Gates, Justin Harris, Prissy Hickerson, Jack Ladyman, Julie Mayberry, Laurie Rushing, Matthew Shepherd, Nelda Speaks, James Sturch, Dwight Tosh, Dave Wallace, Richard Womack\n* Georgia State Representatives: Sam Teasley, Tom Kirby\n* Iowa State Representative: Tedd Gassman\n* North Carolina State Senator: Woody White (former; current New Hanover County Commissioner)\n* Two South Carolina State Representatives: Greg Delleney, Dennis Moss\n* Tennessee State Senator: Ed Jackson\n* Tennessee State Representatives: Barry Doss, Cameron Sexton\n* Texas State Representative: Jim Keffer\n}}\nRepublican National Committee members\n* Arkansas: Jonathan Barnett\nCelebrities, commentators, and activists\n* Chuck Norris, actor\n* Tony Orlando, singer\n* Josh Turner, singer\n* Aaron Tippin, singer and songwriter\n}}\nSee also\n* Political positions of Mike Huckabee\n* Republican Party presidential primaries, 2016\n* Republican Party presidential candidates, 2016\nReferences\nExternal links\n*"
    }
  ]
}