{
  "content": [
    {
      "type": "text",
      "text": "# Mikumo Iwara\n\n| map_dot_label  =\n| location       = Itoshima, Fukuoka, Japan\n| region         = Kyushu\n| type           = graves\n| part_of        =\n| length         =\n| width          =\n| area           =\n| volume         =\n| diameter       =\n| circumference  =\n| height         =\n| built          = 3rd century AD\n| abandoned      =\n| epochs         = Yayoi period\n| cultures       =\n| discovered     =\n| excavations    =\n| archaeologists =\n| condition      =\n| ownership      =\n| management     =\n| public_access  = Yes (archaeological park)\n| other_designation =\n| website        =\n| architectural_styles =\n| architectural_details =\n| notes          = }}\n}}\nThe  is an archaeological site with a Yayoi period burial mound located in the city of Itoshima, Fukuoka Prefecture on the island of Kyushu, Japan. The site was designated a National Historic Site in 2017.\nOverview\nThe site is located on a low terrace between the Kawahara River to the east and the Zuibaiji River to the west. It covers an area of 1,500 meters north-to-south and 750 meters east-to-west, with a total area of about 60 hectares including the residential and burial areas.\nThe  was discovered during the Edo period. The book \"Ryuen Koki Ryakko\" (written in 1822 by Aoyagi Tanenobu, a samurai of Fukuoka Domain), records the discovery of a jar burial in which two huge pottery vessels with a diameter of more than 60-centimeters and height of more than 90-centimeters, joined at their mouths. One medium-thin bronze sword with a handle, one medium-thin bronze spear, and one small jar with red inlay were excavated from outside the coffin, and one thin bronze spear, one medium-thin bronze spear, more than 35 bronze mirrors, eight glass bi, three glass magatama, and 60 glass tubular beads were excavated from inside the coffin.. The location of these grave goods is now unknown, but one bronze mirror and one bronze sword have been located at the temple of Shōfuku-ji Temple in Hakata, and are now collectively designated as a National Important Cultural Properties.  The bronze mirror dates from the Western Han dynasty and is of the heavy circle or Flower mirror style. The diameter of this mirror is 16.4 centimeters.\nIn 1975, some 150 years after the first discovery, an archaeological excavation was conducted by the Fukuoka Prefectural Board of Education at the Mikumo Minamikōji, and a second jar coffin was discovered. This was also an unprecedentedly large coffin,  120-centimeters high and 90-centimeters in diameter, buried with its mouths together. Although it appeared to have been robbed, remaining grave goods included  more than 22 bronze mirrors, one jasper magatama, two glass magatama, two glass tube beads, and one glass pendant. In addition, fragments of the first jar coffin, many fragments of bronze mirrors from grave goods, and glass shards were also excavated, as well as a gilded copper four-leaf zaguar (a copper wooden coffin ornament, presented by a Han emperor upon the death of a person who was a \"king\") was excavated. All of the bronze mirrors were made in Western Han dynasty, and the earthenware of the coffins was dated to the 3rd century AD.\nDuring this excavation, part of a circumferential ditch that is thought to have surrounded the two jar coffins was also discovered, and it is believed that the jar coffins were buried in a single square -style burial mound measuring 32 meters east-to-west and 31 meters north-to-south. Due to the luxurious grave goods, size of the burial mound, and location, it is believed that this site is the grave of a king of Itokoku,  one of the countries in Wa-koku, which appears in Chinese historical books such as Wajinden.\nIn terms of the residential area, pit dwellings from the first half of the Early Yayoi period were discovered in the , which continued into the Kofun period. Three large ditches were excavated in the southeastern part of the site in the middle Yayoi period, and are thought to have served to separate the settlement from the burial area, but they were all buried between the end of the Yayoi period and the beginning of the Kofun period. The  in the center of the site is considered to be one of the central areas of the Mikumo-Ibara site, as pit dwellings were continuously built from the early to late Yayoi period. A large amount of pottery pieces were excavated in this area; along with Yayoi pottery earthenware from the continent was found, indicating trade with the Asian continent.\nThe ruins have now been backfilled but an explanatory board has been installed and some of the excavated items are on display at the nearby Itokoku History Museum.\nSee also\n*List of Historic Sites of Japan (Fukuoka)\nReferences\nExternal links\n*[https://www.fukuoka-bunkazai.jp/frmDetail.aspx?db=4&id=2 Cultural Properties in Fukuoka Prefecture]\n*[https://www.city.itoshima.lg.jp/s033/010/020/010/170/20171129102855.html Itoshima City home page]"
    }
  ]
}