{
  "content": [
    {
      "type": "text",
      "text": "# Military operations during the Turkish invasion of Cyprus\n\n| territory         = Turkish occupation of northern Cyprus (36.2% of the island's area)\n| combatant1        =  Turkey\n* TAF\n* Turkish Cypriot fighters\n| combatant2        =  Cyprus\n* Cypriot National Guard\n* EOKA-B Greek Cypriot paramilitary\nGreece\n| commander1        =  Lt. Gen Nurettin Ersin Maj. Gen. Bedrettin Demirel Maj. Gen. Osman Fazıl Polat Brig. Gen. Süleyman Tuncer Brig. Gen. Hakkı Borataş Brig. Gen. Sabri Demirbağ Brig. Gen. Sabri Evren Col. M. Katırcıoğlu (KTKA regiment)\n| commander2        =   Brig. Gen Mihail Georgitsis (until 30 July)  Lt. Gen Efthymios Karayannis (Chiefs of Staff of the National Guard)  Col. Konstantinos Kombokis Col. Nikolaos Nikolaidis\n| strength1         = Turkish Cypriot enclaves: 11,000–13,500 men, up to 20,000 under full mobilization (Greek claim)   Turkey:40,000 men 160–180 M47 and M48 tanks\n| strength2         =  Cyprus:12,000 men standing strength–40,000 fully mobilised (theoretical)32 T-34/85 tanksincluded in above strength: Greece:2,000+ men\n| casualties1       = Turkish Cypriot fighters: 70 killed 1,000 wounded (including civilians) TAF: 498 killed 1,200 wounded Total: 2,768\n| casualties2       =  Greek-Cypriot military personnel: 309 killed 909 missing937 captured1,141 wounded  Mainland Greek military personnel: 88 killed 83 missing 148 woundedTotal: 397 killed 992 missing 1,269 wounded 937 capturedTotal: 3,595\n| casualties3       =  UNFICYP: 9 killed  65 woundedTotal: 74\n| notes             = Only military casualties are included in this table.\n| conflict          = Military operations during the Turkish invasion of Cyprus\n}}\nsatellite image of Cyprus.]]\nIn 1974, Turkey invaded the northern portion of the Republic of Cyprus in response to a military coup taking place on the island, in attempt to annex the island to Greece. Turkey claimed that this was an intervention in accordance to Treaty of Guarantee. The invasion consisted of two major Turkish offensives, and involved air, land and sea combat operations. The war resulted in a ceasefire which persists until the present day.\nEvents leading up to the 1974 invasion of Cyprus\nThe junta in Greece and political unrest\nThe rule by the military in Greece started in the morning of 21 April 1967 with a coup d'état led by a group of colonels of the military of Greece, with the government-in-exile and ended in July 1974.\nThe Makarios era\nThe period of 1964 to 1974 was a turbulent era for the island, with the apparent breakdown of relations between the Greek Cypriot and Turkish Cypriot sides right across the spectrum of social and political ties. In 1963, the Turkish Cypriots had abandoned, both voluntarily and by external pressure, their constitutional presence in the Cyprus Government. Violence in Nicosia followed soon after. In 1964, the Cyprus National Guard intervened militarily against a Turkish Cypriot militant threat in the north-west of the island, in and near to the Kokkina enclave, leading to direct confrontation with Turkey, who responded militarily but stopped short of invasion. During the unrest, the island began to incubate fanaticism on both Greek and Turkish Cypriot sides of enosis and taksim respectively, these being polar opposite ideologies. Enosis was an effort to unify the island with Greece, while Taksim simultaneously called for the partition of the island between Greeks and Turks.\nMilitary coup against Makarios III\nOn 15 July 1974, the Cyprus National Guard, under the command of the Greek junta in Athens, launched a coup against the democratically elected president, Archbishop Makarios III. A large force of troops and tanks descended on the Archbishopric in Nicosia and laid siege to it, though Archbishop Makarios himself was able to escape. Troops defending the Presidential Palace resisted, and fighting in the area between pro-Makarios supporters and junta supporters continued for much of that day. A former EOKA member, Nikos Sampson, was promptly placed in power as de facto President of the Republic, though he later resigned on 23 July after support for his regime collapsed. The coup represented both a provocation against Turkey and an opportunity for Turkey to invade, citing concerns for the safety of the Turkish Cypriot community as its main goal.\nOperational situation and balance of forces on the eve of the war\nTurkish-Cypriot forces\nFollowing the 1963–1964 intercommunal violence, a relatively stable situation had ensued on the island. The Turkish-Cypriot population had retreated into enclaves, each comprising several villages, and having its own armed force.\nThe biggest Turkish-Cypriot enclave was the Nicosia – St.Hilarion enclave, also called Günyeli enclave, with a 25,000-strong population, out of a total of 117,000 Turkish-Cypriots on the island, and included the northern district of Nicosia  and spanned north to the Pentadaktylos mountain range, but had no access to the sea. In 1964 Turkish-Cypriot fighters from Agirdag had occupied the Bogaz pass without a fight. Greek-Cypriot efforts to dislodge them by force were unsuccessful. As a result, the Turkish-Cypriot forces had control of the Nicosia – Kyrenia highway, and access to the coastal area north of the Pentadaktylos. With the Bogaz pass in Turkish hands, the Greek forces had to use longer routes to access the north coast, namely the Panagra pass, on western Pentadaktylos.\nOther significant Turkish-Cypriot enclaves were that of Famagusta, of Lefka, of Tziaos (Serdarli), of Limasol, of Larnaka, of Pafos, of Limnitis, of Kokkina and of Louroutzina.\nThe total of the Turkish-Cypriot forces were 27 infantry battalions, grouped into 8 regiments, and a strength of potentially up to 20,000 men. The Turkish-Cypriot battalions were lightly armed and understrength, and they were generally limited to defensive capabilities. They also trained for unconventional operations, such as sabotage, ambushes etc. The Turkish forces included the Turkish Regiment in Cyprus (KTKA), of 1,000 men (nominal 650), organized in two groups, one in Günyeli and one in Ortakoy.\nGreek-Cypriot forces\nThe main force of the Greek Cypriots was the National Guard, created in the aftermath of the 1963–1964 intercommunal violence. The National Guard was equipped with surplus equipment from Greece, mainly of British origin, reinforced by a purchase of Soviet weapons in 1965. The National Guard comprised 15 active and 19 reserve infantry battalions, 3 active and 1 reserve commando battalions, 1 tank, 1 mechanized and 1 reconnaissance battalions, 6 field artillery battalions, 1 engineer battalion and other smaller units (such as AT artillery and AAA). They were grouped into 5 military areas called High Tactical Commands (ATD), one Commando command, one artillery command etc. Its nominal total wartime strength was 40,000 men, of whom about 30,000 were to be mobilised reservists, with 32 tanks and 80 field artillery pieces, as well as about 100 armoured vehicles\nThe National Guard, controlled by officers sent from Greece (as Cyprus lacked trained officers), was seen as an instrument of Athens in the political tension between Athens and Nicosia. As a result, the Cypriot government neglected the reinforcement of the National Guard, with the single exception of the 1965 purchase, resulting in the mechanical equipment suffering badly of maintenance issues, and ammunition stocks being low and old. The Makarios government founded in 1972 the \"Efedrikon Soma\" (which translates as \"Reserve Corps\"), with police personnel. Officially, the Efedrikon was a heavy police force to reinforce the National Guard in wartime, in fact however it was Makarios’ trusted counterweight against the Athens-controlled National Guard. The Efedrikon was lightly equipped with modern Czechoslovakian-supplied  weapons and well trained in military style. It comprised 3 battalions. Another paramilitary force was EOKA B, which in 1974 had about 5,000 members with 1,000 firearms. Smaller paramilitaries also existed, under political leaders and their lieutenants.\nThe Greek regiment in Cyprus (ELDYK) was not under the National Guard’s direct control. It was two infantry battalions, with 1,200 men (nominal 950). It was well trained and organized but equipped with light and old weapons. Together with the Commando regiment it was considered the best unit on the Greek-Cypriot side.\nOpposing plans\nThe prospect of an invasion of Cyprus had already been considered in 1964. Definitive plans were created in 1967, which were subsequently renewed to accommodate any changes in the operational situation.\nAccording to the Turkish plan, the ultimate goal was the \"Sahin\" and \"Attila\" lines, namely the capturing of a large part of north Cyprus. The operation would be divided in two phases. The first objective, was the creation of a beachhead that would give access to the sea the Turkish-Cypriot enclave of Gönyeli. In order to give it a safe depth, it was planned that a triangle with a base of 18&nbsp;km along the coast and 22&nbsp;km depth should be secured. Following that, the Turkish planned to stop operations and seek a diplomatic solution. If diplomacy failed, they would forcefully pursue their second main objective, the \"Attila\" line. The first phase was expected to take 3 days, and the second 3–4 days, for a total of 6–7 days.\nAlthough the operation was considered hard, it was also considered simple, because the Turkish General Staff expected total supremacy in the Mediterranean. The biggest worry for the Turkish side was the Aegean, and the possibility of a Greek attack there. The Greek-Turkish border in Thrace was considered secure as it was heavily fortified and garrisoned.\nThe operation would include air, naval and ground forces. A naval armada of 5 destroyers and 31 landing ships would carry the amphibious forces, while the Air Force would drop paratroopers and supplies and provide air support to the entire operation.\nThe ground forces detailed for the operation were put under the command of the 6th Corps/Second Army. They included the \"Cakmak Special Strike Force\", a brigade level unit which would conduct the amphibious landing, the Commando brigade, the Parachute brigade, the 39th infantry division, the 28th motorised infantry division and elements of the 5th armoured brigade and the Jandarma. About 6,000 Turkish-Cypriot fighters were stationed inside the Gönyeli enclave.\nAttila 1 landing and offensive, Aphrodite Two defence plan and counter-offensive\nThe Cyprus National Guard High Command had planned a massive island-wide assault on the Turkish-Cypriot enclaves of Cyprus, in the event of a Turkish invasion, so as to quickly eliminate these enclaves as potential footholds for a bridgehead. The initial plan (drawn up by Georgios Grivas in 1964) was given the codename \"Aphrodite One\" and relied upon the presence of a full Greek division of 10,000 troops with heavy weapons. This division however, had been withdrawn from the island in 1967, and so a new plan was drawn up prior to 1974, named Aphrodite Two, and was to take the form of a major ground offensive against the enclaves, instigated at the initiative of the Greek Cypriots rather than the Greeks. This offensive should not be confused with the so-called \"Aphrodite Three / Hephaestus Plan\", which was drawn up in March 1974 by the EOKA-B coup-conspirators as a follow-up to Aphrodite Two, but never put into action.\n20 July 1974\nKyrenia and Pentemilli beachhead\nIn the early hours of the 20 July 1974, the Turkish armed forces launched an amphibious invasion of Pentemilli (Five Mile Beach) located on the northern coastline, approximately 8&nbsp;km west of the main harbour town of Kyrenia. The Turkish naval force involved in transporting the  amphibious forces originated from Mersin port and had first attempted to land at the beach of Glykiotissa, but this site proved inappropriate for a beachhead. Turkish frogmen transported by a gunboat searched Pentemilli for mines before the landing took place there.\nThe Turkish landing forces, under the command of Brig. Gen Tuncer, consisted of the \"Cakmak\" Special Strike Force Landing Brigade, one battalion of the 6th Amphibious Infantry Regiment under Lt. Cdr Ikiz, the 50th Infantry Regiment under Col. Karaoglanoglu (39th Infantry Division) and one company of the 39th Divisional Tank Battalion (39th Infantry Division). This force consisted of around 3,000 troops, 12 M47 tanks and 20 M113 armoured personnel carriers, as well as 12 105mm howitzers. The landing was not contested until the first wave of Turkish forces were already ashore.\nAt around 01:30, SEP/A radar set at Cape Apostolos Andreas, on the Karpass Peninsula, detected eleven Turkish ships approaching Kyrenia at a distance of . At around 05:00, two Greek Cypriot motor torpedo boats, the T-1 and T-3, were dispatched from Kyrenia harbour to engage the Turkish naval flotilla which had now been detected approaching the coastline. The T-1 was hit by 40&nbsp;mm anti-aircraft fire and sank, while a few minutes later, the T-3 was destroyed by combined fire from ships and aircraft, and sank with the loss of all but one of its crew.\nThe first Greek Cypriot units to reach the area were two companies of the 251st Infantry battalion, supported by a platoon of five T-34 tanks seconded from 2nd Company, 23ΕΜΑ Medium Tank battalion. This force engaged the Turkish landing force at around 10:00 am, with sporadic artillery support from nearby artillery battalions. The attack initially resulted in the destruction of two Turkish recoilless rifle positions and some other casualties, but was unsuccessful in dislodging the beachhead force. An attempted Turkish counter-attack, supported by M113 APCs, resulted in the destruction of two of these vehicles by the T-34s. Once the 251st battalion retreated to the east (towards Kyrenia), the Turkish force advanced 1&nbsp;km to the west, and then proceeded to advance further east. Of the T-34s, four were lost in combat, and the fifth was abandoned at the camp of the 251st battalion.\nAir-attacks proceeded against Greek Cypriot targets in and around Kyrenia, with the army base at Kokkinotrimithia strafed, knocking out two Marmon-Herrington Mk-IVF armoured vehicles and a Daimler Dingo fighting vehicle. The main football stadium at Kyrenia was also attacked, destroying two BTR-152 armoured personnel carriers which were spotted there.\nGreek Cypriot artillery units involved in the suppression of the Turkish beachhead included: the 182MPP battalion, which was from the Maki Giorgalla camp in the Bosporous area of Kyrenia district – this unit was deployed with twelve 25-pounder guns and six anti-aircraft guns of 12.5&nbsp;mm and 14.5&nbsp;mm. The unit abandoned two guns at its camp due to lack of tractors, and then lost two guns and a tractor in a road accident on the Lapithou-Kyrenia road. From its firing positions at Saint Pavlos, the battalion fired shots at the Turkish beachhead and in turn, took casualties from naval and air attack during the day; the 190 MA/TP battalion, which was from Iakovos Patatsos camp in the region of Karavas, Kyrenia. This battalion had eighteen anti-tank guns of 57&nbsp;mm, but only twelve tractors to move them. The force abandoned its camp at 05:15 and was attacked by Turkish aircraft, without losses. Divided into two formations of six guns, the battalion attacked Turkish forces at Panagron, and also shot at the Turkish beachhead at Pentemilli, forcing Turkish naval vessels to briefly retreat back out to sea; the 191POP artillery company (under the control of 181MPP) from Nikos Georgiou camp at Saint Savvas region of Kyrenia, engaged the Turkish Army from its firing positions at Bellapais, and executed shots at Turkish forces in Aspri Moutti and Kotzia Kagia; the 198POP artillery company, equipped with four guns of 75&nbsp;mm and six anti-aircraft guns, based in the western Kyrenia mountains. This unit had sustained the loss of vehicles, radios and ammunition in a forest fire on 16 July, and was in poor shape when it engaged Turkish paratroopers at Saint Hilarion castle on 20 July, in support of mountain commando forces in the area.\nThe Greek Cypriot 326th and 306th Infantry battalions, located in the area, failed to play an immediate role in the resistance against the Turkish landing. Two battalions, the 281st infantry battalion and the 286th Mechanised Infantry battalion (+3 tanks) were sent from Nicosia to reinforce the defences at Kyrenia, but both were attacked by Turkish aircraft at the village of Kontemnos, resulting in the destruction of soft-skin vehicles, six BTR-152 armoured vehicles, and the killing of the commander of the 286th battalion, Lt Col. Georgios Boutos. The 316th infantry battalion was sent from Morphou along the road to Kyrenia, only to be ambushed and forced into defensive positions at a Turkish roadblock. The 316th battalion then regrouped and joined forces with elements of the 286th battalion (equipped with 3 T-34 tanks) which had now arrived.\nIn response to the invasion, a National Guard staff officer, Lt. Colonel Konstantinos Boufas, was sent in an armed motorcade to the western area of Kyrenia in an effort to coordinate a counter-attack. His plan was to engage the Turks at night on the western front, using the available elements of the 281st, 316th and the 286th battalions, along with a unit of anti-tank rifles and three T-34 tanks. The attack was successful in forcing a temporary retreat from the Turks, but this resulted in a counter-attack, and Boufas' force dug-in. One of the three Greek Cypriot T-34 tanks attached to the 286MTP was hit by Turkish anti-tank fire and knocked out. The 306th Infantry battalion arrived late and attacked the Turkish forces from the east, but failed to gain any ground. Meanwhile, the \"Pantazis\" irregular battalion arrived and attack from the south, but also failed to achieve anything decisive. At some point during the night action, the Turkish commander of the 50th Infantry Regiment, Col. Karaoglanoglu, was killed by a M20 Super Bazooka friendly shot fired at the villa he was based in.\nVicinity of Nicosia\nAt around 06:00, a company of Turkish paratroopers was dropped over Mia Millia, just north of Nicosia, right on top of Greek Cypriot forces approaching Geunyeli.\nAt around 07:30, a battalion of 550 troops of the ELDYK contingent, supported by 19 tanks of the 23 ΕΜΑ Medium Tank battalion, as well as one Cypriot National Guard company, commenced an attack on the Turkish enclave of Geunyeli, just north-west of Nicosia. Geunyeli was a strategic target due to its position controlling the Nicosia-Kyrenia main road, and had to be captured by the Greeks in order to ensure reinforcements to Kyrenia. This enclave was heavily fortified by the Turkish forces, in preparation for just such a siege, and was protected by bunkers, machine gun nests and anti-tank trenches. Positioned within the enclave was the Geunyeli Group of the TOURDYK contingent of the Turkish Army, comprising the 2PB 2nd Infantry Company, 3PB 3rd Infantry Company and the ASB Heavy Weapons Company.\nThe attack began with the shelling of Geunyeli by tanks and artillery, which resulted in a Turkish reply via air attacks, but because of the prevailing smoke from bombardment and smoke mortars, these proved to be largely inaccurate. An attempt by the Greek Cypriots to make a direct coordinated attack with their tanks resulted in disaster, with two T-34s destroyed by artillery, and two T-34s becoming trapped in an anti-tank ditch. As the battle progressed, Turkish parachutists continued to drop in and around the enclave, leading to some unavoidable casualties.\nThe 185MPP artillery battalion, based at Camp \"Andreas Karvou\" at Athalassa, Nicosia, equipped with twelve 25-pounder guns and six anti-aircraft guns (four .50cal and two 14.5mm) moved to its firing positions outside the camp.  Before it could commence attack of Geunyeli, however, it was attacked by the Turkish Air Force, resulting in the loss of five 25-pounder guns and six soldiers. Its remaining guns shelled Geunyeli and then moved at midday to the vicinity of the Abbey Makedonitisas.\nThe 184MGP artillery company, also based at Camp \"Andreas Karvou\", managed to rescue its armament of six 25-pounder guns and two .50cal anti-aircraft guns from the burning base following the air attack, though it lost three personnel killed.  It initially fired shots from the camp at Geunyeli, before moving with the 185MPP to Abbey Makedonitisas, where it continued to fire on Geunyeli, and received a Turkish air attack without loss.\nThe Greeks withdrew to the south-west and then called for reinforcements for a second coordinated attack using their remaining 15 tanks, and the 361st and 399th infantry battalions, these new forces tasked to circling in from the north and east to encircle and destroy the enclave. However the coordinated attack, planned for 18:00, failed to take place as the 399 battalion was delayed by fighting with Turkish Cypriot militia. When the 399th battalion arrived, it attempted to attack the enclave on its own, but achieved little success and so withdrew.\nIn other areas\nAt around 10:00, 450 EOKA-B fighters of the 203rd reserve infantry battalion attacked the Turkish Cypriot enclave at Limassol, where approximately 1,000 lightly armed inhabitants were situated. Simultaneously, 100 EOKA-B fighters engaged the Turkish Cypriot enclave of Avdimou, west of Limassol, rounding up Turkish Cypriots as POWs to be taken to the main stadium at Limassol.\nAt around 17:00, the Greek landing ship tank (LST) Lesvos (L-172) commanded by Lt Cdr E. Handrinos arrived at Paphos and began to shell Turkish-Cypriot positions at the enclave close to the harbour with her 40&nbsp;mm anti-aircraft guns. The vessel then unloaded some 450 troops of the ELDYK replacement force at Paphos, and immediately headed back out to sea to evade the enemy. Lesvos was interpreted by the Turks as part of a larger task force, ultimately leading to the arrival of the three Turkish destroyers which the Turkish Air Force mistakenly attacked.\nAt 18:00, Security Council Resolution 353 was adopted unanimously. A cease-fire was to take effect on 22 July at 16:00.\nAt around 22:00, the Turkish Cypriot militia in Paphos issued a general surrender. At the same time, Turkish Cypriot militia and civilians in Famagusta took cover behind the walls of the old city and prepared for a siege.\nAt 23:00, the Greek Cypriot mountain commando forces launched a coordinated night attack just north of the Agyrta-Nicosia enclave, attempting to secure and blockade the Agyrta-Nicosia pass through the Pentedaktylos mountains. The 31MK and 33MK Commando attacked from the west, while the 32MK and 34MK Commando attacked from the east.\n21 July 1974\nThere was little or no armed contact at the beachhead on 21 July 1974, and during this time the second wave of Turkish forces departed from Mersin port.\nFollowing the dispatch of the Hellenic Navy landing ship tank (LST) Lesvos (L-172) to Paphos and the shelling of the local Turkish Cypriot enclave, the Turkish Air Force received reports of a Greek task force of ships off the coast of Paphos. In response, it assembled a force of around 28 strike aircraft from two squadrons to attack the flotilla with  bombs and guns. This however, was a signals deception performed by the Greek Cypriot Naval Command, which transmitted false radio signals indicating that the destroyers sailing off Paphos were Greek. In fact, these were actually the Turkish Navy destroyers Kocatepe, Adatepe, and Mareşal Fevzi Çakmak that had been sent to search for Lesvos. In the early afternoon, all three vessels were struck by friendly aerial fire. Kocatepe sustained a fatal hit and sank with the loss of 54 crew members.\nHaving intercepted intelligence that the Greek Cypriot Commander of the Navy, Commander Papayiannis, was heading to Karavas to assess the size and dimensions of the Turkish landing force, a team of 12 Turkish parachutists were dropped on the Mirtou-Asomatou road in order to ambush his convoy. The Turkish troops managed to wound Papayiannis before they were wiped out by his personal guard force, forcing the Greek Cypriot plan to be abandoned.\nIn the evening, the ruling Junta in Athens agreed upon an arrangement to dispatch clandestine reinforcements to assist the Greek Cypriots, in the form of an infantry battalion, a commando battalion and a battalion of medium tanks. An initial effort was made to dispatch these forces using the large vehicle ferry Rethymnon, which took on board the 537th Infantry battalion, a battalion of tanks and 500 Cypriot volunteers (primarily EOKA-B supporters). This vessel set sail from Piraeus that evening.\nKyrenia and Nicosia areas\nOn the same evening, the Hellenic Air Force commenced a clandestine air-lift operation (Operation Niki) using 15 Noratlas aircraft (354 Squadron \"Pegasus\") in an effort to transport a battalion of commandos from Souda, Crete to Cyprus. However, the aircraft were erroneously engaged by Greek Cypriot anti-aircraft guns of the 195 MEA/AP battalion at Nicosia International Airport, and the third Noratlas was shot down with the loss of four crew and 29 commandos. A further two Noratlas planes were also badly shot up, and forced to make hard landings, at which point the mistake was realised. Some of the remaining planes were able to make safe landings and offload their troops and equipment, resulting in a Greek contingent available to defend the airport. This unit was the A Commando, later given the Greek Cypriot designation 35MK Commando.\nAt Kyrenia, the 251st battalion had now moved to the village of Trimithi to mount its defence of the town, while the 241st and Engineer battalion moved east of Kyrenia, with the latter tasked to mining the coastline. At the Agyrta-Nicosia pass, the Greek Cypriot mountain commando forces achieved their objectives, with the 31MK and 33MK arriving from the west to capture the Kotsakagia mountain top, while the 32MK arrive from the east to force a Turkish retreat from the pass. In a disastrous strategic move, the four Greek Cypriot mountain commando battalions were ordered to move from the Pentedaktylos mountains (where they had created a virtual blockade across the line of a Turkish bridgehead) and sent in the direction of Agios Pavlos. The 187MPP artillery battalion, which was badly damaged by Turkish air attack at its camp the previous morning, went into battle with just four surviving 100&nbsp;mm guns out of its original twelve. The previous day, it had fired a number of shots at the Turkish Cypriot enclave in northern Nicosia, as well as at Saint Hilarion. On the 21st, it moved to a new position at Gerolakkos under cover of night, and shelled Saint Hilarion in support of National Guard and ELDYK forces.\nSome National Guard troops reportedly retreated to Bellapais in UN rovers and flags, reportedly captured from Finnish UNFICYP troops. However, the National Guard garrison in Bellapais was subjected to an air attack, in which napalm was reportedly used.\nAt 06:30, a truce took effect around the Ledra Palace Hotel in Nicosia, with 386 tourists being trapped inside. However, the truce was broken at 11:00, when fighting took place in Nicosia. The hotel was targeted by heavy mortar fire.\nOther Turkish Cypriot enclaves\nAt around 06:00, all Turkish-Cypriot resistance at Limassol collapsed under the weight of a Greek Cypriot assault, and approximately 1,000 POWs were taken. Meanwhile, the Turkish-Cypriot held village of Pileri was captured by the 231st Infantry battalion.\nIn Larnaca, talks for a ceasefire broke down at 03:35 and heavy fighting erupted, with the National Guard using artillery and mortar fire. By 10:30, Turkish Cypriots reportedly began their surrender.\nAt 04:45, Greek Cypriot forces attacked Lefka with mortars and heavy machine guns. At 08:45, high-level bombing, shelling and rockets followed. Limnitis was surrounded by the National Guard and sporadic fighting took place in Denizli.\n22 July 1974\nKyrenia area\nA second wave of Turkish amphibious forces arrived at the Pentemilli beachhead. Codenamed \"Bora Task Force,\" it included a tank company and a mechanised infantry company, under the command of Brig. Gen Haki Boratas. Turkish forces under the command of Maj. Gen Bedrettin Demirel, comprising the Bora Task Force, and the 50th Regiment, proceeded to launch at attack against the primary objective of Kyrenia, the main harbour town on the northern coast.\nFor the Greek Cypriots, command of the counter-invasion force was changed to the leadership of Col. Kobokis, a commander of the Raiders commando force, situated in the Pentedaktylos (Kyrenia) mountain range. The Greek Cypriot High Command also sent reinforcements in the form of a mechanised company of the 346th infantry battalion, as well as an anti-tank platoon of the 120th artillery company. Meanwhile, on the eastern flank, the 306th infantry battalion had retreated to Kyrenia, leaving behind the 251st infantry battalion, as well as a half-strength battalion of the 33MK Commando, located at Agios Georgios village.\nThe Turkish attack on Kyrenia commenced around 11:00 am, resulting in an onslaught against the 33MK Commando. 306th and 251st battalions, with limited anti-tank capability, were forced into full retreat towards Kyrenia. An intervention by the nearby 241st infantry battalion, attempting to build a defensive line to the west of Kyrenia, failed, and the force was overrun.\nConsequently, the Turkish advance towards Kyrenia along the northern coastal road was resisted by two mobile lines of defence bisecting their path. In the first instance, the defence of the 33MK was only able to achieve the destruction of two Turkish M47 tanks which were defeated by 106&nbsp;mm recoilless rifles. The failure to hold the Turkish force back meant that the second line was swiftly impacted, with the 241st battalion managing to immobilise a third M47 with an anti-tank rocket. The fast and aggressive nature of the Turkish assault meant that two further M47 tanks were lost in the vicinity of the Kyrenia Castle to infantry attack, bringing total tank losses on that day to 5 tanks along with 23 casualties.\nTurkish forces entered Kyrenia and then divided into two separate forces – one seeking to establish a new beachhead in the Kyrenia harbour while the second force headed to Boghazi-Argypta pass to unite with paratrooper forces landed there. By the end of the afternoon, a solid bridgehead had been formed between Kyrenia and the centrally located village of Geunyeli, the latter strategically positioned on the Kyrenia-Nicosia road. The Turkish-Cypriot fortified base at Geunyeli was now under the control of Lt. Gen Nuretin Ersin (6th Corps).\nFamagusta\nThe 199MGP artillery company, equipped with four guns of  and two .50cal anti-aircraft guns, completed its artillery assault against the Turkish Cypriot enclaves at Sakarya, Karaoglu the old city of Famagusta, after two days of shelling in support of the 201st and 386th battalions. During 20 and 21 July, this unit had been firing from Klapsidon, though on 22 July, it moved to the vicinity of the Abbey of Apostlos Barnabas.\nNicosia - Saint Hilarion enclave and surrounding areas\nAt 15:00, the Turkish air force launched a heavy air attack on the Nicosia airport. A ceasefire took place at 16:00, only to be broken by further bombing at 17:15. Ground fighting took place near the Greek Cypriot village of Dikomo at 18:15. Heavy fighting took place in the Trakhonas area, and a battalion of Turkish paratroopers was dropped in Bogaz at 13:30. UNFICYP troops had to abandon Camp Tjiklos in the Kyrenia district with the refugees under their supervision at 14:20 due to heavy fighting and forest fires.\nThe 189MPP artillery battalion, equipped with eight guns of 100&nbsp;mm and six anti-aircraft guns (4 x .50cal, 2 x 14.5mm), operated from Camp \"Christ Samaritan\" at Athalassas in Nicosia, close to the airport with an observation post at the ELDYK camp, completes its heavy artillery assault against the targets of Geunyeli and shots against Turkish helicopters in the area. This battalion was repeatedly bombed by the Turkish Air Force, with no losses up to 22 July.\nThe 185MPP artillery battalion commenced an attack against the Turkish enclave of Geunyeli – Saint Hilarion, which continued until the adoption of the ceasefire.\n23 July 1974\nwas the site of significant fighting during the invasion.]]\nThe Greek A Commando (35MK Commando) Force based at the Archbishop School in Nicosia was given its orders – the battalion force of three commando LOK companies (41, 42, 43 LOK) was to be transported immediately to Nicosia International Airport to defend it from an anticipated attack by Turkish forces moving through the Kyrenia-Nicosia bridgehead. The airport was already defended by a company of Greek Cypriot commandos, a company of ELDYK infantry and a company of Airport paramilitary police, the latter equipped with anti-tank weapons and five M8 Greyhound armoured vehicles.\nThe forces of A Commando arrived at Nicosia Airport just in time to mount a defence, via old city buses. They assumed fighting positions in and around the main terminal building, as a convoy of Turkish vehicles arrived at the north end of the airport, about 500 metres from the defenders. The main plan was to cooperate with the Greek Cypriot LOK in deploying a number of machine guns and anti-tank weapons (the Greeks had three 90mm EM69s), and allow the Turkish force to advance into the path of overlapping fire. However, the Turkish advance units spotted some of the enemy positions and commenced a general attack from the north.\nThe initial wave of around a company of Turkish infantry attack was blunted by heavy weapons and small arms fire from the 42 LOK and 43 LOK to the south, while the 41 LOK opened fire from the terminal on the flank. Conceding defeat, the Turks fell back to their original positions with significant casualties. The latter then regrouped and advanced again in battalion strength towards the positions of the 42 and 43 LOKs, braving a withering hail of bullets. In turn, the Turks commenced fire from their rear-line with a  mortar from the direction of an adjacent UN encampment. The Greek Cypriots now launched a counter-attack against the Turkish infantry within the airport perimeter by assaulting the ground troops with their five M8 Greyhound armoured vehicles.\nThe Turkish forces based near the UN camp were targeted by the Greek 41 LOK, which fired M79 phosphorus grenades at them in order to cause a bush fire and smoke. A 90&nbsp;mm anti-tank rocket was also fired in the direction of a suspected observation post in a house on the northern edge of the airport, forcing it to be abandoned. Before the Canadian UN forces arrived, two Turkish M47 tanks attempted a diversionary attack to the eastern terminal. Defenders subsequently destroyed both with an M20 Super Bazooka.\nThe 187MPP artillery battalion, located at Gerolakkos, received artillery attacks from Turkish forces at Arkadi, sustaining the loss of six personnel.\nNicosia Airport\nOn the morning of 23 July, the ground attack against the airport began, but this time, with the active engagement of the 41st Strike Company of the Greek A' Commando.\nThe Greek A Commando (35MK Commando) Force, which had arrived a couple of days earlier with a battalion force of three commando LOK companies (41, 42, 43 LOK) was transported immediately to Nicosia International Airport to defend it from the attack by Turkish forces moving through the Kyrenia–Nicosia bridgehead. The airport was also defended by a company of ELDYK infantry and a company of Airport paramilitary police, the latter equipped with anti-tank weapons and five M8 Greyhound armoured vehicles.\nThe forces of A Commando arrived at Nicosia Airport to mount a defence. They assumed fighting positions in and around the main terminal building, as a convoy of Turkish vehicles arrived at the north end of the airport, about 500 meters from the defenders. The main plan was to cooperate with the Greek Cypriot LOK in deploying several machine guns and anti-tank weapons (the Greeks had three 90mm EM69s), and allow the Turkish force to advance into the path of overlapping fire. However, the Turkish advance units spotted some of the enemy positions and commenced a general attack from the north.\nAt 11:00. a land battle began with Turkish M47 Patton Tanks and 81&nbsp;mm mortars. started hitting Greek positions. As the 3rd Strike Company was reinforcing the battle, they came under heavy fire from the Turks, and Brigadier Generals Avradmidis and Kyriakos were injured and fell into a ditch. However, under heavy Turkish gunfire, they managed to escape from the area with the help of the Greek commandos. During their evacuation, Turkish tanks started moving westward, trying to cover the Turkish infantrymen coming from the north, trying to outflank them with a reverse \"L\" manoeuvre. The car of Major Papameletiou was also hit and immobilized a few meters near the gates of the airport with Papameletiou taking fire from Turkish and UNFICYP positions, but he was eventually relieved with the help of a National Guard BTR vehicle but in the end, a commando was gravely wounded.\nBy the afternoon, the attacks were repelled by the defending forces with the Turkish forces making a hasty retreat, citing heavy casualties.\nAttila 1 aftermath\nAfter Attila 1, the Turkish forces controlled 7% of the island's area. They had successfully connected their beachhead in the north with the big Turkish Cypriot enclave north of Nicosia. They controlled the harbour of Kyrenia, which enabled them to increase the rate of reinforcements arriving from to Turkey, something essential for the second offensive. According to an announcement made by Turkish Prime Minister Bülent Ecevit on 25 July, the Turkish military had lost 57 killed, 184 wounded and 242 missing. Turkish-Cypriot losses are unknown. Between 20 and 22 July the Greek forces had suffered 215 killed and 223 missing, and an unknown number of wounded.\nClashes from 24 July to 13 August\nOn  1 August 1974, elements of the Turkish 28th Division expelled the Greek Cypriot 316th infantry battalion from Hill 1024 (Kiparrisavouno) in the western Pentedaktylos mountains, and pushed them southwards into the Lapithou-Karavas corridor. During the night, B Company of 31MK Commando assaulted Hill 1024 and retook it from the Turks. At the village of Karavas, a Turkish M47 tank was hit and destroyed by a 3M6 Shmel anti-tank missile.\nOn  2 August 1974, B Company of the 31MK Commando sustained an attack by Turkish commando forces, but repelled the assault. In the afternoon, a second major attack on the peak was mounted by larger elements of the 28th Division, forcing the Greek Cypriot commandos to give up Hill 1024 and retreat. The 316th infantry battalion, which was now south of Hill 1024 at Kornos Hill, mounted an ambush of a large force of the 28th Division, which was equipped with M47 tanks and M113 armoured personnel carriers. In the ambush, the 316th destroyed an M47 and M113, and captured an M47 and an M113. The latter two vehicles were given immediately to the 286MTP mechanised infantry battalion, which sent a recovery team to the area on the morning of 3 August.\nOn 3 August 1974, a main defensive line on the western front was established at Karavas to blockade the Karavas-Lapithos corridor from the Turkish 28th Division. This defensive line was manned by the 1st Company ELDYK, and the Greek Cypriot 316th, 321st and 256th infantry battalions, as well as a company of irregulars.\nOn 6 August 1974, the Turkish 28th Division launched an offensive against the Karavas defensive lines of the Greek Cypriots and Greeks. This commenced at dawn, with heavy artillery and mortar fire supported by naval artillery (the latter firing at the 256th infantry battalion on the rear line). With combined artillery cover, tanks, and marine forces, the Turkish 28th Division extended west into Karavas, while a Turkish commando brigade and the Turkish 61st infantry regiment moved over the Pentedaktylos mountains to flank the Greek Cypriots from the north-east. The Turkish Air Force extensively bombed the areas of Laipthos-Karavas to Vavila-Vassilia during this offensive. At Kefalovriso, just outside Lapithos, the 1st company ELDYK attacked elements of the Turkish 61st regiment, with the aid of mortars. In the afternoon, all Greek Cypriot forces in the area retreated to the Vasilia-Vavila defensive line. During the battle, two Turkish M47 tanks were engaged with recoilless rifles near Lapithos and destroyed.\nOn 7 August, the Turkish 28th Division assaulted the Vasilia-Vavila defensive line with supportive artillery fire, but no infantry attack was made.\nAttila 2 offensive\nOn 14 August 1974, Turkish forces, reinforced to the strength of two infantry divisions and supporting elements, commenced a second major offensive, codenamed Attila-2. This offensive lasted three days and caused the defences of the Cypriot National Guard and ELDYK to collapse, leading to the capture of the towns of Famagusta, Morphou, and the northern quarter of Nicosia. The Greek Cypriots attempted to mount their main eastern defensive line between Mia Millia and Nea Chorio villages, northeast of Nicosia.\nGreek forces\nThe Greek forces were divided in three sectors: \"Western\", \"Central\" and \"Eastern\". The Greek plan was to delay the Turkish forces on the West and East, while retreating to the main defence line, and hold positions on the Centre. The main defence line, also called Troodos line, was the defence line where the Greek units would stand and fight. Until then, the Greek units were ordered to fight flexibly, retreating when needed. The Troodos line left about 40% of the island, including Famagusta, accessible to the Turkish forces.\nThe western sector was defended by the 11th Tactical Group. Its left flank (north) was at the sea, near Vasileia, and its right (south) at the UN positions around the International Airport of Nicosia. The 11th TG consisted of the following battalions: 256th (centered around ELDYK's 1st company as it had suffered heavy casualties on 6 August at Lapithos-Karavas battle) at Vasileia, 316th (reinforced with part of the 366th reserve battalion) at Kornos, 281st (reinforced with one company of the 286th) at Kontemenos, 231st (with the rest of the 286th) at Skylloura, the 216th at Gerolakkos and the 33MK Commando at Hill 350, near Kalo Chorio, on the Agia Marina pass. Nicosia International Airport was held by a Canadian force of the United Nations, directly adjacent to the battle lines of a large combined force of ELDYK reinforcements (A /35MK Commando) as well as a company of the 286th battalion, and a company of Greek Cypriot paramilitary police.\nThe central sector spread from Nicosia International Airport and ended at the suburb on Nicosia of Mia Milia. It consisted of: the 212th reserve battalion, ELDYK's camp detachment (3 companies), the 336th reserve battalion (reinforced with various companies, and with a total strength of 1,300 men), the 211th battalion and the 187th artillery battalion.\nThe eastern flank was the strongest sector, where the weight of the Turkish attack was expected to fall. It was defended by the DAT (Eastern Sector Command), which consisted of the 12th Tactical Group and the 9th Tactical Group. Further to the east were positioned the 1st High Tactical Command and the 15th Tactical Group. The 9th TG lay north, from the sea and including the Pentedaktylos mountains; and the 12th south of the mountains until and including Mia Milia village. From north to south the units were: The 9th TG: 361st battalion, 32 MK Commando and 346th battalion on reserve. The 12th TG: 251st battalion (reinforced with one reserve company), the 305th reserve battalion (aka \"Markou's group\" with 150 men), the 399th battalion, and the 241st battalion on reserve. Independent units included the 398th battalion facing the Turkish-Cypriot enclave of Tziaos, and the 226th battalion in general reserve.\nThe total size of the Greek forces numbered at around twenty thousand men (18,000 Greek Cypriot - 2000 Greek), with 21 T-34 tanks, some tens of APCs and armoured cars and some 70 artillery pieces.\nTurkish forces\nTurkish forces consisted mainly of the two infantry divisions (28th  and 39th), one armoured regiment (one tank battalion and one mechanized infantry battalion from the 5th armoured brigade), the Turkish Regiment on Cyprus (reinforced with one parachute battalion, and one battalion from the 50th regiment), one Commando brigade and one Paratrooper brigade, plus additional elements of various units with an estimated total of 160–200 tanks, 200 APCs, 120 field guns and 40,000 men. Added to them were the remaining 5 Turkish-Cypriot regiments (with 19 battalions). The Turkish-Cypriot forces had lost 3 regiments (8 battalions) during Attila 1.\nThe Turkish plan was divided in two phases: The first phase meant that the 39th Division and the armoured regiment would attack towards the Mesaoria plains in the east and unite with the Turkish-Cypriot enclave of Famagusta. The 28th Division would advance southward towards Tymbou airfield and contact the east of the Troodos line. The first phase was planned to last 2 days.\nThe second phase would start at the evening of the second day. During this phase, the Commando brigade would advance from its positions at Agios Ermolaos to the south towards Morphou, and on the third day would advance west to unite with the Turkish-Cypriot enclave of Limnitis. However, they were either unwilling or unable to unite with the coastal enclave of Kokkina (Erenköy) farther west, so it remains an enclave of Northern Cyprus to this day.\nDuring both phases, the Turkish forces would try to advance inside Nicosia and to the west of the city, towards Nicosia International Airport and the Nicosia-Morphou road.\n14 August 1974\nOn the Eastern sector, the Turkish Navy, Airforce and artillery began firing at the Greek coalition positions at 6:30 am for about 30 minutes. The Greek counter-artillery fire was not enough to silence the Turkish fire.\nTurkish units of the 39th division attacked the Mia Milia defensive line of the Greek coalition forces. The line was held by the Greek-Cypriot 399th infantry battalion reinforced with two 3M6 Shmel missile launchers, 4 106&nbsp;mm recoilless rifles and 12 6-pounder gun anti-tank guns. The 399th battalion had used a small dried-out river bed as an anti-tank ditch, and laid anti-tank mines in front of the ditch. However, the UN were informed where the clear roads through the minefields were, and from many sources the Turkish 39th Division knew of them as well.\nThe initial Turkish attacks with infantry against Koutsoventis and Mia Milia locations were repelled. They were swiftly followed by armoured attacks. The Turkish tanks circumnavigated the Greek minefields at Mia Milia. At 10:00 am they contacted the Greek Cypriot lines of 399th battalion and at 10:30 am they had broken through, cutting the 399th battalion in two. At 10:55 am the GEEF (High Command of the Cypriot National Guard) ordered the Eastern Sector Command to withdraw to Troodos line. The 241st battalion acting as the reserve of the 12th Tactical Group delayed the Turkish forces until 11:00 am, but lacking anti-tank weapons it started withdrawing immediately towards Famagusta.\nFollowing the collapse of the Greek Cypriot defensive line, the GEEF ordered the 226th battalion to mount a defensive line together with the 341st reserve battalion in order to delay the Turkish forces. The 226th battalion retreated at 21:00 to the south, while the 341st stayed put. The Turkish Air Force started hitting the retreating Greek forces and the Greek-Cypriot artillery battalions started retreating to the east as well. The 9th Tactical Group, even though it had been not attacked, faced the danger of encirclement from the south, and so started its retreat by 12:00. At 14:30 it had reached Famagusta.\nOn the central sector, the ELDYK camp was hit by artillery fire and the Turkish Air Force. ELDYK forces were supported by Greek-Cypriot artillery fire, provide by the 187th artillery battalion equipped with Soviet 100&nbsp;mm guns. At 10:00 the camp was attacked by infantry, and at 11:00 by tanks, but the attacks were repelled. At 15:00 a new infantry attack was repelled. ELDYK lost 1 killed and 7 wounded in this engagement. Turkish casualties were comparatively heavy, but allowed for the capture of the adjacent hilltop at Elissaios.\nIn the western sector there was no major action. The hilltop Aspros, which had been used as an observation post, was abandoned by Greek-Cypriot forces after a Turkish attack. No effort for recapturing it was made.\n15 August 1974\nOn the eastern sector, the retreating units of the Greek-Cypriot 12th Tactical Group crossed the defence line of the 341st battalion at 10:30. The 341st reserve battalion reinforced with three T-34 tanks and six 6-pounder guns was isolated and holding the defence line west of Famagusta on its own. The rest of the Greek forces continued their retreat to Larnaca and the Troodos main defence line.\nAt 14:00 the Greek-Cypriot 341st noticed the Turkish tanks and the Turkish 14th infantry regiment approaching. Realizing it was abandoned and isolated, the command of the 341st ordered retreat at 17:00, covered by the T-34 tanks. The T-34 tanks (immobilized due to mechanical failures) and the six 6-pounder guns were left behind at their positions.\nThe first Turkish units, including 4 M47 tanks and 11 M113 APCs, entered Famagusta at 17:30. They united with the Turkish-Cypriot units, but did not enter the undefended Greek-Cypriot district.\nThe central sector saw a heavy exchange of fire, but no major engagements.\nIn the western sector, the armoured units of the Turkish 28th Division made contact with the Greek units at about 14:30. The 28th Division's attack was augmented by the Turkish Commando Brigade's advance to the east. In total the Turkish units advanced up to 6&nbsp;km to the west. On the night of 15 to 16 August, the Greek-Cypriot 11th Tactical Group (responsible for the western sector) was ordered to withdraw to the new Troodos defence line.\n16 August 1974\nIn the eastern sector, Turkish forces consolidated their gains but made no major actions. Greek forces reorganized for defence on the Troodos line.\nIn the central sector, the Turkish Air Force began pounding the Greek positions around the ELDYK camp at 8:30 am. Two Turkish formations, each one tank company and one infantry battalion strong, began approaching the camp under the cover of artillery fire. At noon both Turkish formations had reached 800m from the camp, where one stopped to provide support fire for the other as it assaulted the camp. Elements of the first Turkish formation started encircling the Greek camp from the east. At 13:00 Greek-Cypriot artillery stopped supporting the Greek forces inside ELDYK camp. The Greek forces, facing defeat were ordered to withdraw through the Turkish lines. At 13:30 the camp was in Turkish hands. Casualties were very heavy for both sides. ELDYK's official count was 80 killed, 22 wounded, 5 missing. The Turkish Army losses were less significant, with four M48 tanks knocked out by recoilless rifles and a fifth by a direct artillery hit\nThe Turkish force continued southwards and pushed back the Greek-Cypriot 212th battalion. It stopped however after receiving Greek anti-tank fire. They also attacked the 336th battalion inside Nicosia, advancing some 100 metres, but with some 50 casualties. During this engagement a tank-on-tank battle occurred in the northern quarter of Nicosia, with three Greek Cypriot T-34 tanks in the hull-down position engaging and destroying a single M47 tank of the Turkish Army.\nOn the western sector, the entire Greek-Cypriot 11th Tactical Group had retreated to the Troodos line. Two platoons were left to keep contact with the advancing Turkish forces.\nThe Turkish forces advanced slowly to the east. Morfou was captured at 12:30 and Limnitis at 18:00. By 18:00, when the UN instituted a cease-fire, the Turkish forces had not yet contacted the Troodos line. As a result, on 17 August both the Greek and the Turkish High Commands ordered units to advance even though the ceasefire had taken place.\nSeveral Greek-Cypriot units in the western sector suffered badly from desertions, as poorly disciplined reservists abandoned their units. The Troodos line was thus poorly manned.\nAttila 2 aftermath\nImmediately after the Attila-2 offensive ground to a halt, the two sides consolidated their positions and fortified their respective front lines with trenches, anti-tank ditches, minefields and lines of barbed wire. The Greek Cypriots made strong efforts to reinstate the units that had suffered severe desertions, and engaged in a major mobilization effort throughout 1975 to 1977. Deprived of military equipment through attrition and war usage, the Greek Cypriot forces relied heavily on re-supply by the Hellenic Navy to meet basic ammunition needs. On the other side, Turkish forces reinforced their new hold on northern Cyprus by building major bases, and converting an airfield at Lefkoniko into a functioning military air field with a modest runway. No further actions occurred after 18 August 1974.\nSee also\n* Battle of Pentemili beachhead (1974)\n* Turkish invasion of Cyprus\n* Turkish war crimes\n* Reported Military Losses during the Invasion of Cyprus (1974)\n* Cyprus National Guard\n* Cyprus Air Forces\n* Cyprus Navy\n* List of equipment of the Cypriot National Guard\n* Cyprus dispute\n* List of massacres in Cyprus\nNotes\nReferences"
    }
  ]
}