{
  "content": [
    {
      "type": "text",
      "text": "# Military Museum of the Chinese People's Revolution\n\n| established     =\n| dissolved       =\n| location        = Beijing, China\n| type            =\n| collection      =\n| visitors        =\n| director        =\n| president       =\n| curator         =\n| publictransit   =\n| car_park        =\n| network         =\n| website         =\n}}\nThe '''Military Museum of the Chinese People's Revolution''' is the national military museum of China, located in Haidian, Beijing. The collection mainly focuses on military equipments and cultural relics reflecting the military history of the People's Liberation Army, ancient and modern Chinese military history, and world military history.\nHistory\n(SS-2) missile in the center]]\nThe museum was one of the Ten Great Buildings erected in celebration of the tenth anniversary of the founding of the People's Republic of China, construction of the museum began in October 1958 and ended in August 1960, when it was inaugurated. On March 12, 1959, approved by the Chinese Communist Party's Central Military Commission, it was officially named the Military Museum of the Chinese People's Revolution (hereinafter referred to as the Military Museum). Chairman Mao Zedong inscribed the name of the museum, and on August 1, 1960, officially opened to the public on the Armed Forces Day.\nThe museum was comprehensively reconstructed in 2012–2017 and reopened with a larger central hall that hosts a display of aircraft and missiles. The reconstruction allowed for a considerable expansion of the exhibition surface, from 60,000 to 159,000 square meters.\nCollections\nThe museum's four floors include ten halls, the largest of which is the Hall of Weapons. The Hall's extensive holdings of antiquated weaponry showcase domestic and foreign weapons, including blades, small arms, artillery, tanks, armored personnel carriers, anti-air weaponry, jet fighters, rockets and rocket launchers, and cruise missiles. Foreign weapons include Soviet tanks purchased or donated during the 1950s and 1960s, Japanese weaponry captured during the Second Sino-Japanese War, American weaponry captured from the Kuomintang during the Chinese Civil War and from UN forces during the Korean War. In addition, the Hall of Weapons displays equipment from China's space program, such as satellites and a two-seat orbital capsule.\nWith two exceptions, the other halls are largely historical exhibits, combining plaster sculptures, maps, paintings, artifacts, movies, and plaques (in Chinese, with select ones translated into English). The other nine halls include:\n*The Hall of the Agrarian Revolutionary War: Confrontations between 1927 and 1937 of the Chinese Communist Party and the ruling Kuomintang\n*The Hall of the War to Resist Japanese Aggression: The 1937–1947 Second Sino-Japanese War\n*The Hall of the War of Liberation of China: The 1945–1949 period of the Chinese Civil War\n*The Hall of Ancient Wars: Internal and external wars during the 4,000 years before the Qing dynasty\n*The Hall of Modern Wars: Internal and external wars between 1940 and 1949\n*The Hall of National Defense and Army Building: Modern military achievements and developments since 1949\n*The Hall of the War to Resist US Aggression and Aid Korea: Chinese involvement in the Korean War\n*The Hall of Presents: Gifts to the Chinese military or state by foreign militaries or states\n*The Hall of Cheng Yunxian's Sculptural Arts: Plaster reproductions of sculptures of world leaders, historical figures, Chinese Communist Party leaders and scientists by Cheng Yunxian\nEquipment, Planes, Tanks, Artillery and various small arms on display\nPlanes\n* Soviet Mig-15 Bis\n* Nanchang Q-5\n* Mig-15UTI\n* AN-2\n* Xi'an H6\n* Tu-2\n* Captured P-51 Mustang\n* Shenyang J-8\n* Shenyang J-6\n* Mig-15 Repainted with North Korean Airforce roundels\n* Chengdu J-7\n* F-86 Sabre from a defected pilot in 1963\n* P-80 shooting star\n* Tachikawa Ki-55\n* De Havilland Canada U-6A Beaver\n* Shot down U-2 Spyplane\n* Shenyang JJ-6/FT-6\nTanks And Armoured vehicles\n* M46 Patton Captured during the Hoengsong fighting\n* T-62 545 Captured during the Sino-Soviet conflict\n* T 34–85\n* M42 Duster\n* Type 95 So-ki\n* M5 Stuart\n* CV-33\n* LVT(A)-4\n* M24 Chaffee\n* Type 97 Chi-Ha (Gongchen tank)\n* M44 Self-propelled howitzer\n* M4 Sherman with the gun barrel missing, possibly Sherman number 012403\n* M4A3E8 Sherman\n* LVT\n* M36 Tank Destroyer \"Jackson\"\n* Type 62\n* M29 Weasel\n* [https://tank-afv.com/coldwar/UK/oxford-carrier.php Oxford Mk1]\n* Universal carrier\n* Type 59D\n* Type 63\n* Type 63 AFV\n* M-8 Greyhound\nMissiles\n* Hy-1 Anti-ship Missile\n* Dongfeng 1 (SS-2)\n* Dongfeng 2 (CSS-1)\n* Sa-2 SAM\nGallery\nFile:Flag & Insignia Captured During Korean War (9885666323).jpg|Flag of the US 31st Infantry Regiment and UN insignia, captured during the Korean War.\nFile:Eastwind EQ2050 - 2.jpg|Chinese Dongfeng EQ2050 vehicle\nFile:Machineguns, Museum of the Chinese People's Revolution.jpg|Second Sino-Japanese War Machine guns\nFile:The two cars.JPG|Cars of Zhu De and Mao Zedong\nFile:Chinese nuclear bomb - atom missile A2923.jpg|Chinese first atomic bomb\nFile:Chinese PF98 120 mm rocket launcher.jpg|Chinese PF-98 120&nbsp;mm rocket launcher\nFile:DF2 in Museum.JPG|A Dongfeng 2 (CSS-1) medium-range balltistic missile\nFile:Type 72 metallic anti-tank mine 1.jpg|A Type 72 metallic anti-tank mine on display at the museum\nFile:ZBD-04 - front right view.jpg|A ZBD-97 IFV vehicle\nFile:Dongfeng 1 at Beijing Military Museum.jpg|A Dongfeng 1 (SS-2) missile seen from the balcony\nFile:Type 95 SPAAG - Beijing Museum 1.jpg|A Type 95 self-propelled anti-aircraft (SPAAG) vehicle\nFile:M-79 Grenade Launcher, Military Museum of the Chinese People's Revolution.jpg|An American M79 grenade launcher\nFile:PLZ 05 self propelled gun.jpg|A PLZ-05 155&nbsp;mm self-propelled howitzer\nFile:Chinese_KS-1_SAM_mobile_launcher.jpg|A KS-1A mobile surface-to-air missile (SAM) launcher vehicle\nSee also\n* List of museums in China\nNotes"
    }
  ]
}