{
  "content": [
    {
      "type": "text",
      "text": "# Military of the Nguyễn dynasty__disambig_1\n\n* 1558–1777\n* 1778–1802\n* 1802–1891\n* 1885–1945\n* 1945\n| country            =  Nguyễn lords Nguyễn dynasty French protectorates of Annam and Tonkin Empire of Vietnam\n| allegiance         = Emperor of the Nguyễn dynasty, (1884–1945) (1945)\n| branch             = Imperial Guards  Provincial armies and militias  Siege  Elephant  Cavalry  Infantry\n| type               = Army, Navy\n| role               = Military force Police and ceremonial force\n| size               =\n* 1558: 3,000\n* 1627: 100,000\n* 1803: 150,000\n* 1840: 50.000\n* 1847: 128.000\n* 1885: 70.000\n* 1886: 7,500\n| command_structure  =\n| garrison           =\n| commander1 = Lord / King (1558–1802)Emperor (1802–1945)\n| commander1_label = Supreme Commander\n| commander2 =\n| commander2_label =\n| commander3 =\n| commander3_label =\n| notable_commanders = Hoàng Kế Viêm, Lê Văn Duyệt, Lê Văn Khôi, Nguyễn Cư Trinh, Nguyễn Huỳnh Đức, Nguyễn Văn Thành, Nguyễn Văn Tồn, Nguyễn Văn Nhơn, Nguyễn Tri Phương, Phan Văn Thúy, and Trương Minh Giảng\n| nickname           =\n| patron             =\n| motto              = 忠勇 才畧 (Trung dũng Tài lược) - Valeur et discipline\n| colours            =\n| march              = Đăng đàn cung\n| mascot             =\n| battles            =\n; Nguyễn lords\n* Lê–Mạc War\n* Cham-Nguyễn wars\n* Trịnh–Nguyễn War\n* Siamese–Vietnamese wars\n; Nguyễn dynasty\n* Tây Sơn wars\n** French assistance to Nguyễn Ánh\n* Vietnamese invasions of Cambodia\n* Cambodian rebellion (1811–1812)\n* Cambodian rebellion (1820)\n* Phan Bá Vành's Rebellion\n* Anouvong's Rebellion against Siam\n* Siamese–Vietnamese War (1831–1834)\n* Nông Văn Vân's Rebellion\n* Katip Sumat's Jihad\n* Ja Thak Wa uprising\n* Lê Văn Khôi revolt\n* Đoàn Hữu Trưng's Rebellion\n* Cao Bá Quát's Rebellion\n* Lê Duy Lương's Rebellion\n* Tạ Văn Phụng's Rebellion\n* Thạch Bích uprising\n* Lâm Sâm uprising\n* Ba Nhàn - Tiền Bột uprising\n* Ba Xuyên uprising\n* Thất Sơn uprising\n* Hà Tiên uprising\n* Cambodian rebellion (1840)\n* Siamese–Vietnamese War (1841–1845)\n* 405 rebellions from 1802 to 1862\n* Bombardment of Tourane (1847)\n* Cochinchina campaign\n* Tonkin campaign\n** Sino-French War\n* Ba Dinh uprising / Cần Vương\n* Yên Thế Insurrection\n* Pacification of Tonkin\n* Thái Nguyên uprising\n* Vue Pa Chay's revolt\n* Yên Bái mutiny\n* Uprising of the Nghệ-Tĩnh soviets\n* World War II\n* August Revolution\n| anniversaries      =\n| decorations        =\n* Cash coin of Honour\n** Ngân Tiền (銀錢)\n** Kim Tiền (金錢)\n* Military Medal of Annam (1890–1891)\n* Médaille de la Garde Indigène (from 1929)\n| battle_honours     =\n| disbanded = 23 August 1945\n| identification_symbol =\n| identification_symbol_label = Flag\n| identification_symbol_2 =\n| identification_symbol_2_label = Badge of the Imperial Guards during the Bảo Đại period.\n}}\nThe Military of the Nguyễn dynasty (; chữ Hán: 軍次) were the main military forces of the Nguyễn dynasty from 1802 to August 1945 when it was dismantled by the August Revolution. The Nguyễn military force was initially formed by Nguyễn Hoàng as a division of the military of the Revival Lê dynasty in 1558 starting out with 3000 soldiers. During this period it was the military forces of the domain of the Nguyễn lords and commonly fought the Trịnh lords who controlled northern Vietnam. During the Tây Sơn Rebellion it was expelled out most of the county by the Tây Sơn dynasty. After the exiled Nguyễn Phúc Ánh returned and defeated the Tây Sơn rebels he crowned himself as the Gia Long Emperor and the Nguyễn military became the national military of Vietnam.\nDuring the French domination period it became two of the five indigenous guards of French Indochina and was turned into a collection police and ceremonial forces. While the Emperor was still nominally the supreme commander actual power fell in the hands of the French administration relegating the Emperor to a rubber stamp office. Following the abolition of the Nguyễn dynasty its military was also disbanded making the Vietnamese People's Army the new national military of Vietnam, which would be administered by the newly established Democratic Republic of Vietnam.\nHistory\nOrigins (1558–1777)\nInitially the Nguyễn military was established when Nguyễn Hoàng brought a force of 3,000 to the Thuận Hóa province. Since 1600 the army would be instrumental for the administration of the state. The armed forces of the Nguyễn lords included infantry (步兵; bộ binh), marines (水兵;thủy binh), artillery (砲兵; pháo binh), and  elephant corp (tượng binh). While the Nguyễn lords were nominally a part of the Revival Lê dynasty they increasingly became more independent leading to them having military clashes with the north.\nThe infantry and marine forces were armed with a fleet of about 200 warships and many transport boats carrying troops, supplied, and food, the main fighting force of the Nguyễn lords period was the infantry.\nThe standing army numbered about 40,000 people, when the Trịnh–Nguyễn War broke out, the Nguyễn army amounted to 100,000 people. During this period the Nguyễn army was supplied with firearms by the Kingdom of Portugal.\nNguyễn Phúc Ánh's struggle with the Tây Sơn dynasty (1778–1802)\nFollowing the Tây Sơn insurgency only a small part of the Nguyễn military remained, these were under the command of Nguyễn Phúc Ánh.\nNguyễn Phúc Ánh's forces, headed by the former Nguyễn lord in the Citadel of Saigon, equipped his military forces with the help and training of several French advisors. Though the treaty between Nguyễn Phúc Ánh and Louis XVI in 1787 was never ratified.\nThe Nguyễn loyalists overcame the Tay Sons in Binh Thuan (1794), Qui Nhon (1799 and 1801), Huế (June 1802), Hanoi (July 1802) to become the first force that able to unify the Vietnamese nation that stretched from Guangxi, China to the Gulf of Thailand, after three centuries of disintegration period.\nIndependent period (1802–1883)\nThe military of the Nguyễn dynasty maintained the old organisational structures of the imperial dynasties that went before it. The army of the Nguyễn dynasty was divided into two regular parts, a standing army and a division stationed in the capital called the Imperial Guards, whose main task was to protect the Citadel of Phú Xuân (Huế).\nThe imperial army numbered 13,000 men invaded Cambodia in 1809 and 1813 to protect the faction of the king Ang Chan II of Cambodia, established the Viceroy of Cambodia, with Trương Tấn Bửu held the title Viceroy. In 1827 they were mobilised to intervene in the Vientiane Kingdom in Laos. In 1833 when the Chakri Siamese army invaded Cambodia, much of the Nguyen army stationing in Cambodia had to withdraw back to suppress the Lê Văn Khôi revolt and Nông Văn Vân's Rebellion.\nAs the military of the Nguyễn dynasty held substantial influence in its government, the Minh Mạng Emperor reformed the government to become a civil meritocracy decreasing the dominant role of the military in Nguyễn society.\nIn 1834, the Minh Mạng Emperor launched a military campaign resulting in the annexation of Cambodia after the Siamese army had been forced to retreat. Minh Mạng died in early 1841. Siam launched the second invasion of Cambodia. Although the Nguyễn army successfully retook Phnom Penh in 1845, the emperor of Vietnam Thieu Tri sought to make peace with Siam. A peace treaty between Siam and Vietnam was signed in March 1847, which resulted in the independence of Cambodia in 1848. Between 1802 and 1862, the Nguyễn army also had faced 405 internal rebellions and revolts from small to large scales, mostly were the Lê Loyalists, ethnic minorities, and princely. The imperial army gradually lost to France and Spain during the Cochinchina campaign (1858–1862).\nFrom the Minh Mạng to the Tự Đức period, the standing army of the Nguyễn dynasty numbered around 120,000 people. However, due to outdated fighting equipment, poor training, and little attention from the imperial court the Nguyễn army became increasingly backwards in comparison with contemporary military forces, allowing the country to be conquered by the French in 1883.\nFrench domination period (1884–1945)\nWhen the French Republic consolidated its rule over eastern Indochina in 4–5 July 1885, the imperial army was organised under the Garde indigène (Indigenous Guard), leaving only 8,000–10,000. The functions of the ''Garde indigène de l'Annam was limited to simple police duties and ceremonial functions, serving under French officers.\nDuring the French domination period the military of the Nguyễn dynasty was divided into two components, namely the Vệ binh (衛兵, Imperial Guards) and the Cơ binh (Soldiers). The Vệ binh consisted only of the Thân binh force with about 2,000 soldiers in four guards (vệ) and one army of musicians serving the ceremonies of the Nguyễn court (which employed about 50 musicians). The Cơ binh consisted mainly of infantry and remained to serve in the provinces of the French protectorate of Tonkin, where these forces directly controlled by the provincial heads of the Nguyễn dynasty in Tonkin, but under the supervision of the French resident (公使法, Công sứ Pháp). The Cơ binh had about 27,000 troops, divided into four divisions (đạo), stationed in the provinces around Hanoi and the Red River Delta.\nIn 1891, the governor-general of French Indochina issued a decree to establish a military force directly organised, equipped, and commanded by the French, this force initially consisted of about 4,000 troops. These French commanded troops were stationed in all provinces and districts of Vietnam. With this decree of the governor-general of French Indochina effectively put an end to the Nguyễn military as the armed forces of the independent imperial state.\nIn 1933 the Bảo Đại Emperor abolished the Ministry of War (兵部, Binh Bộ'') while reforming the structure of the Nguyễn dynasty's imperial court. The Nguyễn dynasty's last minister of war was Phạm Liệu. The functions and services of the Ministry of War were transferred to the Ministry of Personnel, making it responsible for the management of the military.\nThe Ministry of Personnel of the government of the Nguyễn dynasty issued an ordonnance dated 13-11-Bảo Đại 12 (15 December 1937) which stated that any member of the Nguyễn military who is either demoted or dishonourably discharged will lose all their titles, ranks, privileges, and honorary degrees within the mandarinate.\nEmpire of Vietnam (1945)\nFollowing the August Revolution launched by the Indochinese Communist Party the Nguyễn dynasty was abolished, which also meant that its military was disbanded.\nOrganisation\nThe smallest organizational unit is the ngũ (5 people), followed by the thập (10 people), the đội (50–60 people). Larger units include the provincial soldiers (lính cơ) or royal guards (lính vệ) (about 500–600 people), and the largest is the doanh, which consists of around 2,500–4,800 people. The organization of provincial soldiers and royal guards is identical, differing only in their place of service — the provinces and the royal court, respectively.\nThe Vietnamese army in 1802 had around 150,000 men served as provincial soldiers plus 12,000 royal guards, total numbered 162,000 men. During the reign of Minh Mạng (r. 1820–1841), the provincial army was decreased down to 50,000 to 60,000 men. During the reign of Tự Đức (r. 1848–1883), the army reduced itself further to a 44,000 man army (32,000 provincial soldiers and 12,000 royal guards), with only ten percent of the provincial soldiers were fully armed and well-disciplined at that time.\nCentre army (lính vệ)\nThe emperor had about 12,000 centre army soldiers (lính vệ, permanent soldiers, royal guards), obligated to protect the imperial capital of Huế and its adjacent areas, armed with European muskets, rifles, and bayonets. Royal guards wore black gauze tunics with flower decorations, red insignia in front and back with characters on them; small hats made of lacquered redwood; sometimes white boots, but most soldiers wore slippers or barefoot.\nProvincial army (lính cơ)\nThe provincial army had five armies called trung quân (centre army), tả quân (left army), hữu quân (right army), tiền quân (front army), and hậu quân (rear army). Each division was commanded by a Ngũ quân Đô Thống (French: maréchal, rank 1A). The maréchal of the trung quân was the commander-in-chief held responsible for the defensive of the royal city of Hue and surrounding areas, while other four armies Below a maréchal were Thống chế and Đề đốc (general, rank 2A), each commanded a doanh (2,500 men). Under a general, there were Lãnh binh (French: colonel, rank 3A/B), commanded vệ (each had 500 soldiers, French: bataillon) and Quản cơ (French: chef de régiment provincial, rank 4A/B), commanded cơ (each also had 500 soldiers, French: régiment) Each vệ and cơ had ten đội (50 soldiers) headed by a Cai đội (French: capitaine, rank 5A/B), assisted by a trưởng suất đội (French: lieutenant) and a thợ lại (company clerk). The smallest army unit were squads thập (9 soldiers, French: escouade), commanded by a Chánh đội trưởng suất thập/đội trưởng officer (French: sergent, rank 7A/B) and had a bếp soldier (French: caporal). A normal soldier (lính cơ) during the reign of Minh Mạng received the minimum monthly salary of one quan or a string of cash coins (about 500 coins), which would purchase about 48.9 pounds (22 kilograms) of husked rice, which was only half of what a tenant peasant earned per month.\nThe soldiers wore red tunics, while officers dressed like common gentlemen with a black ao dai, even during wartime. Each officer often carried a sword or a pistol. During ceremonies, the officers had to wear green silk robes, specific animal decorations based upon ranks, and black silk turbans. The army structure is listed below:\n{| class=\"wikitable\" align=\"center\" style=\"margin: 1em; margin-top: 0;\"\n|-\n! colspan=\"4\" | Army structure in 1830\n|- bgcolor = lightgrey\n! Rank\n! Symbol\n! Title\n! Unit\n|-\n| Nhất phẩm ||Qilin||Ngũ quân Đô Thống chưởng phủ sự, Ngũ quân Đô Thống (Marshals, maréchal)|| đạo (army, 10,000 soldiers)\n|-\n| Nhị phẩm ||Bai Ze||Thống chế, Đề đốc, Chưởng vệ (generals) || doanh (2,500–4,800 soldiers)\n|-\n| Tam phẩm ||Lion||Lãnh binh, Vệ úy, phó Vệ úy, Đốc binh (imperial colonels) || vệ (500 soldiers) bataillon\n|-\n| Tứ phẩm ||Tiger||Quản cơ, phó Quản cơ, Hiệp quản (provincial colonels) || cơ (500 soldiers) régiment\n|-\n| Ngũ phẩm ||Black panther||Cai đội (captains) || đội (50 soldiers) compagnie\n|-\n| Lục phẩm ||Bear||Chánh đội trưởng suất đội (lieutenants) ||\n|-\n| Thất phẩm ||Leopard and Seahorse||Chánh đội trưởng suất thập (Leopard for senior sergǣnts) (Seahorse for sergǣnts)|| thập (10 soldiers) escouade\n|-\n| Bát phẩm ||Rhinoceros||Đội trưởng suất thập (corporals)|| ngũ (5 soldiers) section''\n|-\n| Cửu phẩm ||None||Thơ lại || individual clerk\n|}\nThe size of the provincial army depended on each period. During the reign of Gia Long, the provincial army numbered up to 150,000 to 200,000 men. During the reign of Minh Mang, it was 36,000 to 60,000. During a later period under Thieu Tri and Tu Duc (1841–1883), the army was practically undisciplined 32,000 peasant-soldiers, with only 10% of them armed with muskets or rifles. The rest had to use spears or knives. The training was minimal. When the French attacked Saigon, there were about 7,000 Vietnamese combatants instead of the reported 12,000, and there weren't reserves and mobilization to deal with the casualties rather than local recruits. The artillery organ had only 200 cannons, which almost were exceedingly heavy, outdated, and no match to European guns.\nWar elephants\nWar elephants were recruited in the military like the previous Vietnamese military. Established by Gia Long in 1803, the Royal Elephant Corp Elephants of the Guard (Tượng Quân) served the emperor's escort when he needed it. Commanded by a Chưởng tượng quân, the corp was divided into five regiments (515 men per regiment), each regiment had five companies, each company had four squads. The Elephants of the Guard later was renamed to Elephants of the Inner Guard (Thị Nội Tượng) in 1815, and then in 1829 it became known as the Elephants of the Capital (Kinh Tượng). The local army also had its elephant corps. In the 1840s, the Vietnamese employed about 280 elephants with 2,340 men of 55 elephant companies in military service.\nVietnamese war elephants were relatively small, ranging from 1.8&nbsp;m (5.9&nbsp;ft) to 2.8&nbsp;m (9.2&nbsp;ft) in height. Each elephant carries a red hemp bridle, a howdah, a chain crupper, belly-strap, a silk flag, two leather belts, 30 arrows, 30 javelins, an iron hook. The howdah usually depicted a lion or a dragon.\nThe last war elephant battle was raged on 5 July 1885, when French troops of 11th battalion chasseurs a Pied were charged by Vietnamese war elephants from within the Hue citadel, which forced the French to retreat to an embankment where they fire back in cover and eventually drove the elephants back.\nTirailleurs\nDuring the French conquest, thousands of Vietnamese and Muong volunteers, including many Christians, formed auxiliaries and professional military groups known as tirailleurs that helped the French suppress and subjugate rebellions campaigns in Tonkin, Cambodia, and Laos. The majority of these tirailleur units were commanded by French officers. Each tirailleur soldier was armed with a musket, and later a chassepot rifle and bayonet.\nNavy\nThe navy was part of the Vietnamese military and its bureaus. J. H. Moor in his 1837 account reported that in 1823, the Nguyen navy consisted of 50 schooners with 14 guns, 80 gunboats (sloop-of-war), 100 vessels, 300 galleys with 80 to 100 rowing oars, and 500 galleys with 40 to 80 oars. Another two hundred galleys owned by the emperor in Hue \"were built based on European and European-Vietnamese mixed styles, with fourteen guns on each.\" John White, an American lieutenant and naval captain that visited Saigon in 1819, had once commented: \"Cochinchina [Southern Vietnam] is perhaps, of all the powers in Asia, the best adapted to maritime adventure.\"\nLater during the reign of Thieu Tri and Tu Duc, Vietnamese naval superiority was no longer. Lacking a view interested in the military and financial support, the court quickly abandoned the great navy. Gunships gradually were transformed into trading ships to serve the failing economy. Technology drastically falling behind Europe. In the 1880s, the Vietnamese royal navy had seven corvettes, 300 junks, two steamers purchased at Hong Kong, and five French vessels, all were later absorbed by the French Indochinese navy.\nCitadels\nGallery\nFile:TranhtrieuNguyen-22.jpg|Dragon boat guardians.\nFile:TranhtrieuNguyen-21.jpg|\nFile:Voi binh.jpg|War elephants.\nFile:Fêtes du Nam-giao en 1942 (10). Etendard figurant des constellations astrologiques.jpg|Soldiers of the Nguyễn military partaking in the 1942 Nam Giao (南郊) ceremonies, Huế.\nFile:Cavalier soldier of Hue.jpg|Cavalier soldier of Huế.\nFile:Hue chef de la garde royale.jpg|Royal guard of Palace.\nFile:Royal guard of Hue.jpg|Royal guard of Huế.\nFile:Ve-binh-hue.jpg|Royal guard of Palace.\nFile:Imperial guards of the Nguyễn Dynasty with poleaxes and shields.jpg|Imperial Guards with poleaxes and shields.\nFile:Coat of arms of Annam - Hymnes et pavillons d'Indochine (Hanoï - 1941) Bảo Đại (保大).svg|Badge of the Imperial Guard during the Bảo Đại period.\nFile:Nguyendynastysoldiers.jpg|Picture depicts two Nguyễn dynasty soldiers with rattan shields and two-handed Vietnamese sabres.\nFile:Tả quân (hình 4-5), Chưởng vệ (hình 6), Quản cơ (hình 7), Phó xuất đội (hình 8).jpg|Officers and military mandarins of the Nguyễn dynasty military.\nNotes\nFootnotes\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}