{
  "content": [
    {
      "type": "text",
      "text": "# Mina Walking\n\n|runtime        = 110 minutes\n|country        = CanadaAfghanistan\n|language       = Dari\n}}\nMina Walking is a 2015 Canadian-Afghani Dari-language drama film written and directed by Yosef Baraki. It was screened in the Generation 14+ section of the 65th Berlin International Film Festival where it competed for the Crystal Bear.\nThe film follows a 12-year-old Afghan street seller named Mina as she tries to balance her education with her responsibility as the main breadwinner of the family.\nCast\n*Farzana Nawabi as Mina\n*Qadir Aryae as Omar\n*Marina Golbahari as Teacher\n*Safi Fanaie as Samir\n*Massoud Fanaie as Bashir\n*Hashmatullah Fanaie as Grandfather\nProduction\nYosef Baraki has stated that he was inspired to write the film after meeting with a group of child street sellers in Kabul. \"What I noticed and [what] eventually led to writing this movie was the dynamic between them. In a country like Afghanistan it was interesting to see that the girls were making more money than the boys and were able to outsmart them. These children spent such a long time on the streets every day and didn't go to school, either because they were orphaned or because war has affected their parents in a way that the children had to support the family\".\nThe film was shot on location in Kabul, Afghanistan in 19 days with a crew of 5-6 people. Only a few professional actors appear in the film. Baraki developed the character of Mina by placing Farzana Nawabi in real-life situations and only feeding her parts of the script every day. To capture real-life Kabul, the crew needed to shoot unnoticed. \"Sometimes I would climb onto the roofs of buildings and shoot down with a long lens to capture Mina at the market without being seen. If there were too many people on the street, we would reduce the number of our crew if we were too noticeable. We were trying to blend in because we had to move forward, due to our tight budget and our short schedule. We could not afford to being told we can't film somewhere, so we had to improvise\".\nAwards and nominations\n4th Canadian Screen Awards (2016)\n*Winner, Discovery Award\nBerlin International Film Festival (2015)\n*Nominated \"Crystal Bear\"\n*Nominated \"Best First Feature\" Award\n*Nominated \"Amnesty Film Prize\"\nAsia Pacific Screen Awards (2015)\n*Nominated \"Best Youth Feature\"\nInternational Film Festival of India (2015)\n*Nominated \"UNESCO Fellini Medal\"\nHot Docs Canadian International Documentary Festival (2015)\n*Winner of the Lindalee Tracey Award\nZlín Film Festival (2015)\n*Winner \"Prize of the Ecumenical Jury Special Mention\"\n*Winner \"The Milos Macourek Award\"\n*Nominated \"Golden Slipper\"\nSAARC Film Festival (2015)\n*Winner \"Best Actress Award\"\nDer Neue Heimatfilm Festival (2015)\n*Winner \"Best Film Award\"\nInternational Film Festival TOFIFEST (2015)\n*Winner \"Audience Award\"\nMumbai Film Festival (2015)\n*Winner \"Best Actress Award\"\nToronto Reel Asian International Film Festival (2015)\n*Winner \"Best Feature Film Award\"\n*Winner \"Audience Award\"\nAll Lights India International Film Festival (2015)\n*Winner \"NETPAC Award For The Best Asian Cinema\"\nFestival Cinema Africano, Asia and Latin America (2016)\n*Winner \"SIGNIS Jury Prize\"\nReferences\nExternal links\n*"
    }
  ]
}