{
  "content": [
    {
      "type": "text",
      "text": "# Mindwarp (film)\n\n| runtime     = 96 minutes\n| country     = United States\n| language    = English\n| budget      =\n}}\nMindwarp (released as Brain Slasher outside the United States) is a 1992 post-apocalyptic science fiction horror film, starring Bruce Campbell, Angus Scrimm, Marta Martin (credited as \"Marta Alicia\"), Elizabeth Kent, and Wendy Sandow.  The film is notable as one of three produced by Fangorias short-lived Fangoria Films label.\nPlot\nThe story takes place in the year 2037, after the loss of the ozone layer has left most of the planet a desolate wasteland scattered with highly radioactive \"Death Zones\", except for several areas that still flourish.\nMuch of the human population has been reduced to Crawlers, mutated cannibalistic underground dwellers who have lost their intelligence, speaking only in grunts and mining garbage dumps. Outworlders are un-mutated humans who live in the Death Zones. A few humans are Dreamers, who live in Inworld, a sealed biosphere maintained by the central Infinisynth  computer. They spend all their time plugged in via implants in their necks, living through virtual reality fantasies.\nThe heroine, Judy, a dreamer, lives with her mother. She has gradually become less satisfied with the life they have. After an unsuccessful attempt to talk directly to her mother, Judy manages to penetrate her virtual reality to wake herself up. Judy interrupts the dream, but she causes her mother to die in the real world.\nFor interfering with dreams of other users, Judy is exiled from Inworld by the mysterious System Operator who controls Infinisynth. She is saved from the Crawlers by Stover, an Outworlder who believes he is the last \"normal\" human being still living on the surface, protecting himself from the deadly ultraviolet rays, radioactivity, caustic ground water, and Crawlers, while subsisting on a diet of small animals. The two are captured by the Crawlers, however, and brought to their underground village, where Stover is set to work mining the garbage dump. Judy is saved by the Crawlers' leader, the masked Seer (who is intelligent and can speak), from being butchered. The Seer's consort, Cornelia, also an Outworlder, is jealous of the Seer's intentions towards Judy. Her attempt to infect Judy with a mutant leech-like parasite fails, however, and the Seer has Cornelia's slave/foster daughter Claude's eye gouged out and then she is crushed by an elaborate meat grinder constructed from salvaged parts. It is a quasi-religious ritual attended by the Crawler population, who all drink Claude's blood. The Seer reveals himself to be an Inworlder.\nIn the meantime, Stover uses a food processor blade he finds in the dump to escape and free Judy, only to be recaptured. He is thrown into a half-submerged cage where he is attacked by many of the mutant leeches. The Seer, meanwhile, reveals to Judy he is her father, rationalizing his actions by claiming he did what was necessary to survive. He wants Judy to follow in his footsteps. Initially, she is ambivalent, but becomes fully resistant when he reveals the second part of his plan: the two of them will breed a race of healthy children to continue leading the Crawlers. She escapes and liberates Stover, scraping off the parasites with a sharp blade. The two are captured yet again, and the Seer convenes another ceremony to put them into the grinder. Judy overcomes him and feeds her father into the machine, causing the Crawlers to proclaim her as the new Seer. By that time, Stover, who seems to go insane from the leech infection, tries to convince her to stay and accept the leadership as well.\nJudy escapes to the surface with Stover chasing after her. When they stop and talk, Stover (infected by the leeches) suddenly vomits leech larvae onto her. Then she wakes up back in Inworld and realizes it was all an Infinisynth simulation. She is then confronted by her father, who is in actuality the Infinisynth System Operator and wants to hand the position down to her. Judy wakes up again back in her old room, living with her mother. The ending leaves the question whether the handing of the System Operator position over to her actually happened or was only a simulation created by her subconscious mind.\nCast\n* Bruce Campbell as Stover\n* Angus Scrimm as the Seer/Theodore Apple\n* Marta Martin as Judy\n* Elizabeth Kent as Cornelia\n* Wendy Sandow as Claude\nHome media\nTwilight Time released Mindwarp on Blu-ray on October 8, 2013.  The extras include an isolated score and TV spot.\nThe film was released on Blu-ray in the UK from Eureka Entertainment on February 22, 2021. Extras include an audio interview with Fangoria Magazine editor Tony Timpone, and footage from ''Fangoria's Weekend of Horrors convention 1990.\nProduction\nThe budget was under $1 million. Mindwarp'' was filmed on location on the stamp sand and copper mining ruins in Gay, Michigan. It was also part of Windsor Lake Studios of Eagle River, WI\nReception\nPatrick Naugle of DVD Verdict called it \"almost the epitome of early '90s straight-to-VHS fare.\"  Adam Tyner of DVD Talk rated it 2/5 stars and wrote, \"Mindwarp starts off promisingly but quickly peters out, limping along in a miasma of standard issue sci-fi tropes until reaching a final reel that's littered with one unsatisfying twist after another.\"  Mark R. Hasan of Rue Morgue wrote that it is \"a genuine curio\" for its cyberpunk themes and connection to Fangoria.  Nigel Floyd of Time Out London wrote that the gore makes up for the writing.\nSee also\n*List of science fiction horror films\n*Video nasty\n*1992 in film\nReferences\nExternal links\n*\n*\n* [https://vimeo.com/950579123 Second Deaths: Metaphors for Tolerance, a video essay by Stephen Broomer on Vimeo]"
    }
  ]
}