{
  "content": [
    {
      "type": "text",
      "text": "# Mines in the Battle of Messines (1917)\n\nSeveral underground explosive charges were fired during the First World War at the start of the Battle of Messines . The battle was fought by the British Second Army (General Sir Herbert Plumer) and the German 4th Army (General Friedrich Sixt von Armin) near Mesen (Messines in French, also used in English and  German) in Belgian West Flanders. The mines, secretly planted and maintained by tunnelling companies of the Royal Engineers beneath the German front position, killed many German soldiers and created  craters.\nThe explosions rank among the largest non-nuclear explosions. Before the attack, General Sir Charles Harington, Chief of Staff of the Second Army, told the press, \"Gentlemen, I don't know whether we are going to make history tomorrow, but at any rate we shall change geography\". The Battle of Messines marked the zenith of mine warfare. Just over two months later, on 10 August 1917, the Royal Engineers fired the last British deep mine of the war, at Givenchy-en-Gohelle near Arras. the 251st Tunnelling Company on the 5th Infantry Brigade front of the 2nd Division, exploded a mine at the northern end of the brigade sector, near Surrey Crater, which became known as Warlingham Crater.}}\nBackground\nBritish mining, 1915–1916\nAs part of Allied operations in the Ypres Salient, British mining against the German-held salient at Wijtschate (Wytschaete or Whitesheet to the British) near Messines had begun in early 1915, with diggings  below the surface. The concept of a deep mining offensive was devised in September 1915 by the Engineer-in-Chief of the British Expeditionary Force (BEF), Brigadier George Fowke, who proposed to drive galleries  underground. Fowke had been inspired by the thinking of Major John Norton-Griffiths, a civil engineer, who had helped form the first tunnelling companies and introduced the quiet cut-and-cover technique.\nIn September, Fowke proposed to dig under the Ploegsteert–Messines (Mesen), Kemmel–Wytschaete (Wijtschate) and Vierstraat–Wytschaete roads and to dig two tunnels between the Douve river and the south-east end of Plugstreet (Ploegsteert) Wood, the objectives to be reached in three to six months. Fowke had wanted galleries about  long, as far as Grand Bois and Bon Fermier Cabaret on the fringe of Messines but the longest tunnel was a  gallery to Kruisstraat. The scheme devised by Fowke was formally approved on 6 January 1916, although Fowke and his deputy, Colonel R. N. Harvey, had already begun the preliminaries. By January, several deep mine shafts, marked as \"deep wells\" and six tunnels had been started. Sub-surface conditions were especially complex and  ground water tables made mining difficult. To overcome the technical difficulties, two military geologists assisted the miners from March, including Edgeworth David, who planned the system of mines.\nCo-ordinated by the Royal Engineers, the mine galleries were dug by the British 171st, 175th and 250th Tunnelling companies and the 1st Canadian, 3rd Canadian and 1st Australian Tunnelling companies, while the British 183rd, 2nd Canadian and 2nd Australian Tunnelling companies built dugouts (underground shelters) in the Second Army area. Sappers dug the tunnels into a layer of blue clay  below the surface, then drifted galleries (horizontal passages) for  to points beneath the position of the German , despite German counter-mining. was based on the XIX Corps headquarters (General Maximilian von Laffert) and controlled the 204th Division, 35th Division, 2nd Division and the 40th Division.}} German tunnellers came within metres of several British mine chambers and, well before the Battle of Messines, found La Petite Douve Farm mine. On 27 August, the Germans set a camouflet, which killed four men and wrecked the gallery for ; the mine had been charged and the explosives were left in the chamber. A gallery of the Kruisstraat mine, begun on 2 January, had been dug for  and was flooded by a camouflet explosion in February 1917, after which a new chamber was dug and charged next to the flooded mine. The British diverted the attention of German miners from their deepest galleries by making many minor attacks in the upper levels.\nPrelude\nBritish mining, 1917\nThe BEF miners eventually completed a line of deep mines under Messines Ridge that were charged with  of ammonal and gun cotton. Two mines were laid at  on the northern flank, one at St Eloi, three at Hollandscheschur Farm, two at Petit Bois, single mines at Maedelstede Farm, Peckham House and Spanbroekmolen, four at Kruisstraat, one at Ontario Farm and two each at Trenches  on the southern flank. A group of four mines was placed under the German strongpoint Birdcage at Le Pelerin, just outside Ploegsteert Wood. The large mines were at St Eloi, charged with  of ammonal, at Maedelstede Farm, which was charged with , and Spanbroekmolen on one of the highest points of the Messines Ridge, which was filled with  of ammonal. The mine at Spanbroekmolen was set  below ground, at the end of a gallery  long.\nWhen detonated on 7 June 1917, the blast of the mine at Spanbroekmolen formed the \"Lone Tree Crater\" with a diameter of  and a depth of .) The mine at Ontario Farm did not produce a crater but left a shallow indentation in the soft clay, after wet sand flowed back into the crater. Birdcage 1–4 on the extreme southern flank in the II Anzac Corps area, were not required because the Germans made a local retirement before 7 June. Peckham 2 was abandoned due to a tunnel collapse and the mine at La Petite Douve Farm was abandoned after the German camouflet blast of 27/28 August 1916. The evening before the attack, Harington, the Second Army Chief of Staff, remarked to the press, \"Gentlemen, we may not make history tomorrow, but we shall certainly change the geography\".\nGerman mining, 1916–1917\nIn December 1916,  Füßlein (also Füsslein), commander of German mining operations in the salient, had recorded that British deep mining was intended to support an offensive above ground and received three more mining companies, to fight in the British lower as well as the upper mine systems and had gained some success. In April 1917, the 4th Army (General Friedrich Sixt von Armin) received information from air reconnaissance that a British offensive was being prepared in the Messines Ridge sector, and a spy reported to OHL that if the offensive at Arras was frustrated, the British would transfer their effort to Flanders. Hermann von Kuhl, the Chief of Staff of  (Army Group Crown Prince Rupprecht), suggested that the salient around Messines Ridge be abandoned, since it could be attacked from three sides and most of the defences were on forward slopes, vulnerable to concentric, observed artillery-fire. A voluntary retirement would avoid the calamity experienced by the defenders at the Battle of Vimy Ridge on 9 April.\nKuhl proposed a retirement to the  Line (Oosttaverne Line to the British), halfway back from the Second Line along the ridge or all the way back to the Third Line (Warneton Line). At a conference with 4th Army commanders to discuss the defence of Messines Ridge on 30 April, most of them rejected the suggestion, because they considered that the defences had been modernised, were favourable for a mobile defence and convenient for counter-attacks. The artillery commander of  said that the German guns were well-organised and could overcome British artillery. The divisional commanders were encouraged by a report by Füßlein on 28 April, that the counter-mining had been such a success, particularly recently that\n)|Füßlein}}\nFor this and other reasons the withdrawal proposal was dropped as impractical. Soon after the conference, Füßlein changed his mind and on 10 May, reported to the 4th Army his suspicions that the British had prepared several deep mines, including ones at Hill 60, Caterpillar, St Eloi, Spanbroekmolen and Kruisstraat and predicted that if an above-ground offensive began, there would be big mine explosions in the vicinity of the German front line.\nOn 19 May, the 4th Army concluded that the greater volume of British artillery fire was retaliation for the increase in German bombardments and although defensive preparations were to continue, no attack was considered imminent. On 24 May, Füßlein was more optimistic about German defensive measures and Laffert wrote later, that the possibility of mine explosions was thought remote and if encountered they would have only local effect, as the front trench system was lightly held. From 12 May, weekly reports by the 4th Army made no mention of mining and Rupprecht made no reference to it after the end of the month. Other officers like  (Lieutenant-Colonel) Wetzell and  (Colonel) Fritz von Lossberg, wrote to OHL warning of the mine danger and the importance of forestalling it by a retirement; they were told that it was a matter for the commanders on the spot.\nBattle: 7 June 1917\nThe British artillery fire lifted half an hour before dawn and as they waited in the silence for the offensive to begin, some of the troops reportedly heard a nightingale singing. Starting from  on 7 June, the mines at Messines were fired within the space of 20 seconds. The joint explosion ranks among the largest non-nuclear explosions, surpassing the mines on the first day of the Somme fired 11 months before. The sound of the blast was considered the loudest man-made noise in history. Reports suggested that the sound was heard in London and Dublin; at the Lille University geology department, the shock wave was mistaken for an earthquake. Some witnesses described \"pillars of fire\", although many also conceded that the scene was indescribable.\n}}\nThat the detonations were not simultaneous enhanced their effect on the German troops. Strange acoustic effects also added to the panic – German troops on Hill 60 thought that the Kruisstraat and Spanbroekmolen mines were under Messines village, which was well behind the front line, while some British troops thought that they were German counter-mines going off under the British support trenches. The combined explosion is considered to have killed more people than any other non-nuclear, man-made explosion in history. Although 10,000 casualties were reported on 10 June, 21 days after the explosion, the historian, Simon Jones, challenged the death toll of the mines using primary sources and suggested that the mine explosions killed no more than 500 German troops and that 7,344 were taken prisoner. The report of 10,000 casualties originates from Der Weltkrieg, the German official history, mistakenly taken by British writers to be the result of the mine explosions.\nAftermath\n]]\nTwo days after the battle, the  commander, General Maximilian von Laffert, was sacked and died of a heart attack eleven days later. The German official history,  (volume XII, 1939) placed the mines, which were unprecedented in size and number, second in a list of five reasons for the German defeat. In an after-action report, Laffert wrote that had the extent of the mine danger been suspected, a withdrawal from the front trench system to the  Line (half-way between the first and second positions) would have been ordered before the attack, since the cost inflicted on the British by having to fight for the ridge justified its retention. In 1929, Hermann von Kuhl lamented the failure to overrule the 4th Army commanders on 30 April and prevent \"one of the worst tragedies of the war\". mine code-named Peckham, was abandoned before the attack due to a tunnel collapse. The sixth, one of the biggest, was planted under a ruined farm called La Petite Douve. It was lost when the Germans mounted a counter-mining attack and never used. After the war, La Petite Douve was rebuilt by its owners, the Mahieu family, and later renamed La Basse Cour. The mine is beneath a barn, next to the farmhouse.|Neil Tweedie}}\nList of the mines\n{| class=\"wikitable sortable\"\n|-\n|+British mines, Messines Ridge, June 1917\n|-\n! No.\n! Name /  Location\n! Position\n! Explosive charge\n! Tunnellength\n! Depth\n! Constructed\n! Result\n! style=\"width:30%; align=left\"| Notes and images(May be under first row of each group of mines)\n|-\n| 1\n| Hill 60 (or Hill 60 A)\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 22 August 19151 August 1916\n| align=\"left\"| Fired\n| align=\"left\"| Shared gallery with Caterpillar, started in mid-1915 as one of the first allied mines at Ypres and known as Berlin Tunnel. By June 1917, the mine consisted of a main gallery leading to two mine chambers (Hill 60 A and Hill 60 B). See note: behind the British front line and passed  beneath the German positions. The British underground works consisted of an access gallery (nicknamed Berlin Tunnel) leading to two mine chambers called Hill 60 A (beneath Hill 60) and Hill 60 B (beneath The Caterpillar). 3rd Canadian Tunnelling Company took over in April 1916 and completed the galleries, Hill 60 A being charged with explosives in July 1916 and the Hill 60 B branch gallery in October. By October 1916, Hill 60 A had been charged with  of explosives and Hill 60 B with  of high explosive, despite waterlogging and the demolition by a camouflet of  of German gallery above the British diggings, which endangered the British deep mines. 1st Australian Tunnelling Company took over in November 1916 and maintained the completed mines beneath Hill 60 and The Caterpillar over the winter and months of underground fighting until June 1917, when they were fired at the beginning of the Battle of Messines. When the mines were fired, the detonations demolished a large part of Hill 60 and killed several hundred German soldiers between Ypres and Ploegsteert. Fifteen miles away in Lille, German troops ran around \"panic-stricken\". Odd acoustic effects also increased the shock and Germans on Hill 60 thought that the Kruisstraat and Spanbroekmolen mines were under Messines village, well behind their front line; some British troops thought that they were German counter-mines, going off under British support trenches.}}\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_Hill_60.jpg];\n|-\n| 2\n| Caterpillar (or Hill 60 B)\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 22 August 191518 October 1916\n| align=\"left\"|  Fired\n| align=\"left\"| Views: [https://web.archive.org/web/20150418170913/http://ypres1917.fr.yuku.com/attach/ma/post-5-1197130368.jpg photo]\n|-\n| 3\n| St Eloi\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 16 August 1915 11 June 1916\n| align=\"left\"|  Fired\n| align=\"left\"| Largest detonation during the Battle of Messines. The deep mine crater is located next to double crater from 1916.\nSee note: below ground, at the end of a gallery  long and charged with  of ammonal, the largest single charge of explosive used during the whole war. (According to Holt and Holt, the Queen Victoria shaft was begun in the area of Bus House Cemetery, behind a farm-house called Bus House by the British troops .) From there, the gallery was extended to the area of the mine chamber. When the St Eloi deep mine exploded, it destroyed several of the craters created by the six British mines fired below German lines on 27 March 1916.}}\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_St_Eloi.jpg];\nViews:\n|-\n| 4\n|  Hollandscheschur Farm 1\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 18 December 1915 20 June 1916\n| align=\"left\"|  Fired\n| align=\"left\"| The mine consisted of three chambers (Hollandscheschur Farm 1–3) with a shared gallery. It was placed around the German strongpoint Günther between Wijtschate and Voormezele, not far from the Bayernwald trenches in Croonaert Wood. See note: and then drove a tunnel over  extending well behind the German lines. Despite counter-mining by German units, three charges were eventually placed and fired. The logic behind the exact placing of the charges at Hollandscheschur Farm was to take out a small German salient (strongpoint Günther) that protruded into the British lines.}}\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_Hollandscheschur_Farm.jpg];\nViews: , [http://1.bp.blogspot.com/-9O8LQ9xUSCM/UNdzjY3sP9I/AAAAAAAAAHo/g2g3mptZ20w/s1600/screen+-+goog+earth+hollandsches.jpg aerial view 2]\n|-\n| 5\n|  Hollandscheschur Farm 2\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 18 December 191511 July 1916\n| align=\"left\"|  Fired\n| align=\"left\"|\n|-\n| 6\n|  Hollandscheschur Farm 3\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 18 December 191520 August 1916\n| align=\"left\"|  Fired\n|-\n| 7\n|  Petit Bois 1\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 16 December 1915 30 July 1916\n| align=\"left\"|  Fired\n| align=\"left\"| The mine consisted of two chambers (Petit Bois 1 and 2) with a shared gallery. It was placed west of Wijtschate. See note:. As with many deep mines, compressed air and electricity were supplied from the surface. The tunnellers experimented with a mechanical excavator operated by hydraulic rams, similar to those used for the London Underground. The device weighed more than half a ton and promised to cut a tunnel about  in diameter. In March 1916 it was used to dig  but developed difficulties and was abandoned in situ. The main gallery of the Petit Bois mine was taken out by clay kicking over  and reached beyond the German lines when it was breached by enemy counter-mining. When the enemy blew a camouflet, 12 men were trapped by a collapsed tunnel over  below the surface. After six days, the British tunnellers managed to rescue Sapper William Bedson, a veteran of the Ypres Salient and of Gallipoli. When completed, the main gallery leading to the two mine chambers was more than  long.}}\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_Petit_Bois.jpg];\n|-\n| 8\n| Petit Bois 2\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 16 December 191515 August 1916\n| align=\"left\"|  Fired\n| align=\"left\"|\n|-\n| 9\n| Maedelstede Farm\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 3 September 1916 2 June 1917\n| align=\"left\"|  Fired\n| align=\"left\"| Two chambers (Wytschaete Wood and Maedelstede Farm) were planned, but lack of time prevented the former from being finished and all effort was concentrated the latter. It was placed west of Wijtschate. See note: at the end of 1916 and forward workings started at a depth of about . One tunnel headed towards Wytschaete Wood and the other towards Maedelstede Farm over  away. In order to remove the spoil from the workings, a covered tramway was built running back behind the British lines where the spoil was camouflaged to prevent detection of the mining activities by the Germans. When it was realised that Wytschaete Wood could not be reached in time, all efforts were concentrated upon the branch tunnel heading for Maedelstede Farm. The explosive was put in place, tested and ready to fire just 24 hours before the start of the Battle of Messines.}}\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_Maedelstede_Farm.jpg];\nViews: [https://c1.staticflickr.com/9/8359/8393858895_95bc4e531c_b.jpg aerial view]\n|-\n| 10\n|  Peckham 1\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 20 December 1915 19 June 1916\n| align=\"left\"|  Fired\n| align=\"left\"| The mine consisted of two chambers (Peckham 1 and 2) with a shared gallery. Peckham 1 was detonated during the battle. Peckham 2 was placed under a farm building but abandoned after the tunnel flooded. See note:, the heavy clay requiring much timber as the tunnel was driven forward to the German lines. Despite strenuous efforts to work as silently as possible, including the use of the 'clay kicking' method, German trench mortar activity caused many delays and flooding swamped much of the work, causing several earlier tunnels to be abandoned. The main charge was eventually placed below Peckham Farm as planned and in time, some  from where the digging had started.}}\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_Peckham.JPG];\nViews: [http://www.ww1battlefields.co.uk/flanders/images/mess/peckham_farm.jpg photo]\n|-\n| 11\n|  Peckham 2\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 20 December 1915 December 1916\n| align=\"left\"|  Abandoned\n| align=\"left\"|\n|-\n| 12\n|  Spanbroekmolen (or Lone Tree Crater, Pool of Peace)\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 1 January 191626 June 1916\n| align=\"left\"|  Fired\n| align=\"left\"| Discovered by German troops in February 1917, later reclaimed and fired in the Battle of Messines. The crater was acquired in 1929 by the Toc H foundation in Poperinge, today recognised as a peace memorial. See note: to the south-west. In December 1915, 250th Tunnelling Company dug a  shaft and then handed over the work to 3rd Canadian Tunnelling Company in January 1916. Other operating changes occurred until 171st Tunnelling Company took over and extended the work to the German lines at Spanbroekmolen, having driven the tunnel forward by  in seven months. In February 1917 German counter mining activities damaged the main tunnel so the British dug a recovery gallery which after  cut into the original tunnel and allowed the Royal Engineers to rescue the mine. A long, branch gallery for another mine at Spanbroekmoelen was also started, but had to be abandoned in order to rescue the main tunnel. Mining was greatly hampered by the influx of gas, several miners being overcome by the fumes, but eventually – and only a few hours before the appointed time of detonation at 03:10 a.m. on 7 June 1917 – the ammonal charge was in place and secured by  of tamping with sandbags and a primer charge of  of dynamite. The Spanbroekmolen mine exploded 15 seconds late, killing a number of British soldiers from the 36th (Ulster) Division, some of whom are buried at Lone Tree Cemetery nearby. The Spanbroekmolen British Cemetery is also close to the crater.}}\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_Spanbroekmoelen.JPG];\nViews: [http://www.ww1battlefields.co.uk/flanders/images/mess/spanbroekmolen2.jpg photo]\n|-\n| 13\n|  Kruisstraat 1\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 2 January 1916 5 July 1916\n| align=\"left\"|  Fired\n| align=\"left\"| Building preparations for a two-chamber mine started in December 1915. Kruisstraat 1 was placed at the end of a  long gallery, Kruisstraat 2 some  to its right. Kruisstraat 3 was added two months later and Kruisstraat 4 in 1917. Two craters remain, which seem to have been caused by the first and second charges. Kruisstraat 1 and 4 shared a gallery and were fired together. See note: it was handed over to 171st Tunnelling Company who were also responsible for Spanbroekmolen. At  a charge of  of ammonal was laid and at the end of a small branch of  to the right a second charge of  was placed under the German front line. This completed the original plan, but it was decided to extend the mining to a position under the German third line. Despite meeting clay and being inundated with water underground which necessitated the digging of a sump, they managed to complete a gallery stretching almost half a mile from the shaft in just two months, and a further charge of  of ammonal was placed. This tunnel was the longest of any of the Messines mines. In February 1917, German countermeasures necessitated some repair to one of the chambers and the opportunity was taken to place a further charge of  marking a total of four mines, all of which were ready by 9 May 1917.}}\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_Kruisstraat.jpg];\nViews of the double crater: [https://farm5.staticflickr.com/4012/4419103681_20b01e049c.jpg photo 1] , [http://1.bp.blogspot.com/-bX2SlDWPL7c/UOCKxVs0EKI/AAAAAAAAAI0/h2eakOwmVj4/s1600/screen+-+goog+earth+span+to+kruiss.jpg photo 2], [http://www.ww1battlefields.co.uk/flanders/images/mess/kruisstraat_crater.jpg photo 3]\n|-\n| 14\n|  Kruisstraat 2\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 2 January 1916 23 August 1916\n| align=\"left\"|  Fired\n| align=\"left\"|\n|-\n| 15\n| Kruisstraat 3\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 2 January 1916 23 August 1916\n| align=\"left\"|  Fired\n| align=\"left\"| Kruisstraat 3 had the longest gallery of the mines at Messines.\n|-\n| 16\n|  Kruisstraat 4\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| February 19179 May 1917\n| align=\"left\"|  Fired\n| align=\"left\"|\n|-\n| 17\n| Ontario Farm\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 28 January 1917 6 June 1917\n| align=\"left\"|  Fired\n| align=\"left\"| The mine did not produce a crater but left a shallow indentation in the soft clay; the shock wave did great damage to the German position. It was placed west of Mesen (Messines). See note: and pumps were installed to bring air down and water out of the mine. After tunnelling forward, the miners broke into blue clay, extending the depth to some . After driving the gallery almost  forward, the flooding was so bad that a dam had to be constructed and a new gallery started. Despite these obstacles, the tunnellers arrived under Ontario Farm at the end of May 1917 and installed the  ammonal charge with a day to spare.}}\nPlans: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_Ontario_Farm.JPG] [https://commons.wikimedia.org/wiki/File:Mining_1.png];\n|-\n| 18\n| La Petite Douve Farm\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 28 January 1916 n/a\n| align=\"left\"|  Abandoned\n| align=\"left\"| The mine was placed under the barn of the farm La Basse Cour. It was discovered by the Germans on 24 August 1916, then flooded and abandoned. See note: of ammonal had been put in place beneath the farm, the gallery was discovered by a German counter-mining operation on 24 August 1916. The mine flooded and was abandoned. After the war, La Petite Douve Farm was renamed La Basse Cour.}}\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_La_Petite_Douve_Farm.jpg];\n|-\n| 19\n| Trench 127 Left (or Trench 127 North)\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 28 December 191520 April 1916\n| align=\"left\"|  Fired\n| align=\"left\"| The mine consisted of two chambers (Trench 127 Left and Right) with a shared gallery. It was placed east of St. Yvon (St. Yves). The crater was in a field near the Khaki Chums Cross memorial and filled in during the latter part of the 20th century. See note: within four weeks, however after driving a  gallery the Royal Engineers faced a sudden inrush of quicksand and a concrete dam had to be constructed. A new attempt was made, and by April 1916 the Trench 127 mine was ready, with the ammonal charges over  away from the initial shaft.}}\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_Trench_127.JPG];\n|-\n| 20\n| Trench 127 Right (or Trench 127 South, Ash Crater)\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| 28 December 1915 9 May 1916\n| align=\"left\"|  Fired\n| align=\"left\"|\n|-\n| 21\n| Trench 122 Left (or Factory Farm 1, Ultimo Crater)\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| February 1916 14 April 1916\n| align=\"left\"|  Fired\n| align=\"left\"| The mine consisted of two chambers (Trench 122 Left and Right) with a shared gallery. It was placed east of St. Yvon (St. Yves). Preparations for a two-chamber mine extending from Trench 122 started in December 1915. A charge of  was laid in May 1916 and a second of  was placed at the end of a  long gallery, beneath the derelict Factory Farm. See note: of ammonal was in place at Trench 122 Left. Another shaft (Trench 122 Right) was started part way along the original tunnel and after another , a charge of 40,000 lbs of ammonal was placed by the Royal Engineers beneath the ruins of Factory Farm which sat on the German front line.}}\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_Trench_122.JPG];\nViews: [https://crashmacduff.files.wordpress.com/2015/01/93.jpg?w=584&h=438 photo]\n|-\n| 22\n| Trench 122 Right (or Factory Farm 2, Factory Farm Crater)\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"| February 191611 June 1916\n| align=\"left\"|  Fired\n| align=\"left\"| Views: [http://www.plugstreet-archaeology.com/factoryfarmcrater.jpg photo 1], [http://thebignote.com/wp-content/uploads/2011/11/IMG_8166.jpg photo 2]\n|-\n| 23\n| Birdcage 1 (or Trench 121)\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"|  December 1915 7 March 1916\n| align=\"left\"| Not fired\n| align=\"left\"| The mine was placed east of Ploegsteert, around the German strongpoint Birdcage at Le Pelerin, near the southern end of Messines Ridge. Five mines were planned here, of which four (Birdcage 1–4) were constructed. None of them was fired, as they were too far behind British lines by the time the Battle of Messines commenced.\nPlan: [https://commons.wikimedia.org/wiki/File:Battle_of_Messines_1917_mine_plan_-_Birdcage_group.jpg]\n|-\n| 24\n| Birdcage 2 (or Trench 121)\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"|  December 1915n/a\n| align=\"left\"| Not fired\n| align=\"left\"|\n|-\n| 25\n|  Birdcage 3 (or Trench 121)\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"|  December 191530 April 1916\n| align=\"left\"| Explodedin 1955\n| align=\"left\"| Detonated by lightning on 17 June 1955, after an electric-power pylon had been built over the site.\n|-\n| 26\n|  Birdcage 4 (or Trench 121)\n| align=\"left\"|\n|\n| align=\"left\"|  m\n| align=\"left\"|  m\n| align=\"left\"|  December 1915n/a\n| align=\"left\"| Not fired\n| align=\"left\"|\n|}\nGallery\nHill 60 Ypres Belgium - 1917 deep mine crater Caterpillar1.JPG|\nHill 60 Ypres Belgium 14 - 1917 deep mine crater Hill 60.JPG|\nHill 60 Ypres Belgium access to mine gallery Berlin Tunnel.jpg|\nSpanbroekmolen 3.jpg|\nView from Spanbroekmolen crater towards Kruisstraat with crater farm.JPG|\nView from Kruisstraat craters towards Spanbroekmolen crater - pic 2.JPG|\nSee also\n* Beneath Hill 60\n* Mines on the first day of the Somme\n* Mines on the Italian Front (World War I)\n* Mining (military)\n* The War Below\nNotes\nCitations\nReferences\nBooks\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nJournals\n*\nNewspapers\n*\nWebsites\n*\nFurther reading\n*\n* Goodbody, A. (13 September 2016). [http://www.miningmagazine.com/top-articles/tunnelling-in-the-deep/ \"Tunnelling in the deep: Battle of Messines\"] () Mining Magazine. London: Aspermont Media.\n*\n*\nExternal links\n* [https://web.archive.org/web/20150510184955/http://www.1914-1918.net/tunnelcoyre.htm Tunnelling companies RE]\n* [http://pierreswesternfront.punt.nl/content/2008/03/messines-ridge Messines Ridge photo essay]\n* [https://web.archive.org/web/20131226093649/http://static.awm.gov.au/images/collection/pdf/RCDIG1069640--1-.PDF AOH Appendix 1 The Mines at Hill 60]\n* [https://web.archive.org/web/20160115202611/http://www.durandgroup.org.uk/Photos/Messines.GIF Map of the mines]\n* [http://www.ww1battlefields.co.uk/flanders/messines.html Messines with images of the craters]\n* [http://thebignote.com/2012/01/23/a-tour-of-ploegsteert-wood-part-eleven/ With the British Army in Flanders]\n*\n* [http://1914-1918.invisionzone.com/forums/index.php?showtopic=58613&page=2 Discussions of mines that were not fired] ()\n* [http://www.firstworldwar.com/battles/messines.htm The Western Front Today, Messines]"
    }
  ]
}