{
  "content": [
    {
      "type": "text",
      "text": "# Mineral Exploration Research Centre\n\nThe Mineral Exploration Research Centre (MERC) is a semi-autonomous research centre associated with the Harquail School of Earth Sciences at Laurentian University in Sudbury Ontario, Canada, and one of the largest mineral exploration research-teaching clusters in the world. MERC is housed in the Willett Green Miller Mineral and Mining Research Centre on the Laurentian University campus, together with the Ontario Geological Survey, Ontario Geoscience Laboratories (Geo Labs), the John B. Gammon Mines Library, and the administrative offices of the Minerals and Mining Division of the Ontario Ministry of Northern Development and Mines.\nThe mission of MERC is to conduct and promote cutting-edge, field-based, collaborative research on mineral deposits and their environments, and to educate and train highly qualified personnel (HQP) for careers in the minerals industry, academia or government. The objectives of MERC are to: 1) promote collaborative university-government-industry research on mineral deposits and Precambrian geology, 2) pursue a fundamental understanding of mineral deposits and their geological settings, 3) aid the mining industry in the discovery of ore deposits, and 4) train geologists in mineral exploration research techniques.\nMERC has research expertise in the geology, mineralogy, geochemistry, and genesis of magmatic nickel-copper-PGE deposits, volcanology, geochemistry, and alteration associated with hydrothermal copper-zine-(gold) volcanogenic massive sulfide ore deposits, structure, geochemistry, and alteration associated with hydrothermal orogenic lode gold deposits, mineralogy, geochemistry, and genesis of rare-element and rare-metal pegmatites, and the sedimentology of Mississippi Valley-type (MVT) Pb-Zn deposits and placer Au and U deposits.\nMERC and the Harquail School of Earth Sciences are a world-leaders in mineral deposits education, offering a Co-Op BSc in Mineral Exploration program, hosting the annual PDAC-sponsored Student-Industry Mineral Exploration Workshop, offering a fully modular (\"block\") Applied MSc degree in Mineral Exploration, and offering a PhD in Mineral Exploration and Precambrian geology.\nMERC has managed a wide range of applied research projects, including numerous NSERC Natural Science and Engineering Research Council Collaborative Research and Development program projects and CAMIRO Canada Mining Industry Research Organization projects; managed the $8m Ontario Mineral Exploration Technology (OMET) program for the Ministry of Northern Development of Mines; led a major component of the $14m Discover Abitibi program for the [[Timmins Economic Development Corporation], Kirkland Lake Department of Economic Development and Tourism, Northern Ontario Heritage Fund Corporation, and FedNor;  is presently leading the $13m Mineral Exploration Footprints project funded by the [Natural Sciences and Engineering Research Council of Canada]] and the Canada Mining Innovation Council; and is presently conducting the $104m Metal Earth project funded by the Canada First Research Excellence Fund, FedNor, Northern Ontario Heritage Fund Corporation, and several industry sponsors.\nReferences\n*[http://www.miningexcellence.ca/projects/p0710/links/CEMI_Release_Graduate_Curriculum.pdf Centre for Excellence in Mining Innovation re MERC Graduate Curriculum]\n*[https://web.archive.org/web/20110725181508/http://www.cmic-ccim.org/pdf/InnovationResearchDevNeedsMineralExploration.pdf Canadian Mining Innovation Council re MERC]\n*[https://web.archive.org/web/20110710140107/http://www.discoverabitibi.com/geology-release-english.pdf Discover Abitibi re MERC]\n*[http://www.republicofmining.com/2010/05/18/fnx-mining-donates-one-million-dollars-to-laurentian%E2%80%99s-mining-programs Republic of Mining re MERC]\nExternal links\n*[http://merc.laurentian.ca MERC website]\n*[http://hes.laurentian.ca HES website]"
    }
  ]
}