{
  "content": [
    {
      "type": "text",
      "text": "# Minerva, Queensland\n\n| pop                 = 55\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4722\n| area                = 935.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 36.0\n| dir1                = NNW\n| location1           = Springsure\n| dist2               = 71.3\n| dir2                = SSW\n| location2           = Emerald\n| dist3               = 338\n| dir3                = WSW\n| location3           = Rockhampton\n| dist4               = 799\n| dir4                = NW\n| location4           = Brisbane\n| lga                 = Central Highlands Region\n| stategov            = Gregory\n| fedgov              = Flynn\n| near-n              = Gindie\n| near-ne             = Gindie\n| near-e              = Arcturus\n| near-se             = Springsure\n| near-s              = Cona Creek\n| near-sw             = Lochington\n| near-w              = Lochington\n| near-nw             = Lochington\n}}\nMinerva is a rural locality in the Central Highlands Region, Queensland, Australia. In the , Minerva had a population of 55 people.\nGeography\nThe Nogoa River forms the western boundary of the locality. The terrain is mountainous with many named peaks, including:\n* Bimbenang Peak ()\n* Birdcage ()\n* Crystal Hill ()\n* Funnel Mountain ()\n* Little St Peter ()\n* Mount Alexander ()\n* Mount Cullender ()\n* Mount Ebenezer ()\n* Mount Elizabeth ()\n* Mount Helmet ()\n* Mount Horatio ()\n* Mount Minerva ()\n* Mount Promenade ()\n* Mount Spencer ()\n* Mount Wallaroo ()\n* Mount Wandoo ()\n* Mount Wills ()\n* Red Hill ()\n* Spring Hill ()\n* St Peter ()\n* Summer Hill ()\n* Sunrise Hill ()\nHistory\nMinerva Provisional School opened on 8 November 1904 with Miss Elsie Hyde the first teacher. By June 1905, there were 31 students enrolled. On 1 January 1909, it became Minerva State School. It closed on 31 December 1928 due to low student numbers and no suitable accommodation for the teacher. In 1933, the school building was rented out and then in 1938 sold by auction for £39 and then relocated to Emerald. It was on a  site that was formerly part of the Minerva Creek company reserve.\nThe Springsure branch railway line opened on 15 August 1887, with the locality being served by two railway stations:\n* Wurba Junction railway station ()\n* Minerva railway station ()\nThe section beyond Wurba Junction railway station to Springsure railway station was closed on 26 June 2013.\nOn 17 April 2020, the Queensland Government re-drew the boundaries of localities within the Central Highlands Region by replacing the locality of The Gemfields with three new localities of Rubyvale, Sapphire Central and Anakie Siding (around the towns of Rubyvale, Sapphire, and Anakie respectively). This included adjusting the boundaries of other existing localities in the Region to accommodate these changes; Minerva gained a small area from the north-eastern edge of Lochington, reducing the area of the locality from . As a consequence of these changes, the boundary between Lochington and Minerva/Gindie more closely follows the course of the Nogoa River.\nDemographics\nIn the , Minerva had a population of 48 people.\nIn the , Minerva had a population of 55 people.\nEducation\nThere are no schools in Minerva. The nearest government primary schools are Springsure State School in neighbouring Springsure to the south-east, Gindie State School in neighbouring Gindie to the north-east, and Lochington State School in neighbouring Lochington to the west. The nearest government secondary schools are Springsure State School (to Year 10) and Emerald State High School (to Year 12) in Emerald to the north-east. However, students from some parts of Minerva will be too distant from these secondary schools for a daily commute; the alternatives are distance education and boarding school.\nReferences"
    }
  ]
}