{
  "content": [
    {
      "type": "text",
      "text": "# Mingo, Queensland\n\n| pop                 = 12\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4625\n| area                = 264.9\n| dist1               = 29.2\n| dir1                = SSE\n| location1           = Mount Perry\n| dist2               = 38.5\n| dir2                = NW\n| location2           = Gayndah\n| dist3               = 131\n| dir3                = SW\n| location3           = Bundaberg\n| dist4               = 346\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = North Burnett Region\n| stategov            = Callide\n| fedgov              = Flynn\n| near-n              = Mount Perry\n| near-ne             = Good Night\n| near-e              = Wateranga\n| near-se             = Mount Steadman\n| near-s              = Wetheron\n| near-sw             = Yenda\n| near-w              = Yenda\n| near-nw             = Mount Perry\n}}\nMingo is a rural locality in the North Burnett Region, Queensland, Australia. In the , Mingo had a population of 12 people.\nGeography\nThe Burnett River enters the locality from the south-west (Yenda / Wetheron) and forms the south-western boundary of the locality, before flowing eastward across the locality as part of Lake Paradise (the impoundment of the river by the Paradise Dam). The river/lake then flows north-east (forming the eastern boundary of the locality, before the river/lake exits the locality to the east (Good Night / Wateranga). The dam wall is not within the locality but lies further east between Good Night and Coringa.\nThe Gayndah Mount Perry Road enters the locality from the south (Wetheron), then forms the south-eastern boundary of the locality, before crossing the river/lake via a bridge at Mingo Crossing (the historic ford over the river, ).  The road then passes through the locality in a north-westerly direction and exits to the north-west (Mount Perry).\nMingo has the following mountains, both in the south of the locality:\n* Mount Yeatman (), just north of the river/lake rising to   above sea level\n* Mount Blandy (), just south of the river/lake,\nThe Mount Rawdon open-cut gold mine is in the north of the locality, extending into neighbouring Mount Perry to the north. Apart from the mine, the land use is predominantly grazing on native vegetation.\nHistory\nThe Mingo Provisional School opened in 1898 and closed in 1903.\nMingo Falls was a waterfall on Mingo Creek near its confluence with the Burnett River (). However,  the falls were inundated by the creation of Lake Paradise arising from the construction of the Paradise Dam further downstream on the Burnett River. The dam was completed in 2005.\nBymingo State School (also written as By-Mingo State School) opened in February 1917 and closed on 18 July 1954. It had a short closure in 1926 due to low student numbers. It was on the western side of the Gayndah Mount Perry Road ().\nDemographics\nIn the , Mingo had a population of 8 people.\nIn the , Mingo had a population of 12 people.\nEducation\nThere are no schools in Mingo. The nearest government primary schools are Mount Perry State School in neighbouring Mount Perry to the north-west, Booyal Central State School in Booyal to the north-east, and Coalstoun Lakes State School in Coalstoun Lakes to south-east. The nearest government secondary schools are Burnett State College (to Year 12) in Gayndah to the south-west, Biggenden State School (to Year 10) in Biggeden to the south-east, and Gin Gin State High School (to Year 12) in Gin Gin to the north-east.\nAmenities\nThere is a caravan and camping ground at Mingo Crossing on the north-east bank of Burnett River off the Gayndah Mount Perry Road. Popular activities at Mingo Crossing include fishing and boating. There is a boat ramp into the river/lake (); it is managed by the North Burnett Regional Council.\nReferences"
    }
  ]
}