{
  "content": [
    {
      "type": "text",
      "text": "# Ministry of Education (Dominican Republic)\n\n| logo            = Minerd.png\n| logo_size       = 250px\n| formed          =\n| jurisdiction    =\n| headquarters    = Av. Máximo Gómez, Santo Domingo\n| budget          = RD$ 186,774,494,864.96 (2021)\n| minister1_name  = Luis Miguel de Camps García-Mella\n| website         = https://www.ministeriodeeducacion.gob.do/\n}}\nThe Ministry of Education (Spanish: Ministerio de Educación or MINERD) of the Dominican Republic is a government institution in charge of planning, managing and making the country's education system, as well as administering public schools and supervising private centers. By law, this Ministry receives 4% of the Dominican gross domestic product.\nIt appeared as its own entity on 1934 as the Secretary of State of Education and Fine Arts (Secretaría de Estado de Educación y Bellas Artes), although it wouldn't be until 2000 when it focused exclusively on education. Its headquarters are located at Santo Domingo. Its Minister is Ángel Hernández Castillo, since August 8, 2022.\nHistory\nSince 1844, Dominican education was in charge of the Secretary of State of Justice and Public Instruction (Spanish: Secretaría de Estado de Justicia e Instrucción Pública), which is nowadays the Office of the Attorney General of the Republic. On 1931, this institution was suppressed; its functions in the matter of justice were transferred to the Office of the Attorney General by Law no. 79, and its roles on education and Fine Arts were transferred to the General Superintendency of Education (Superintendencia General de Enseñanza).\nYears later, on November 30, 1934, by Law no. 786, the Secretary of State of Education and Fine Arts (Secretaría de Estado de Educación y Bellas Artes) was created, thus replacing the term \"public instruction\" for education. On 1965, it will become the Secretary of State of Education, Fine Arts and Worship (Secretaría de Estado de Educación, Bellas Artes y Cultos) by receiving functions of the Secretary of State of External Relations. Later on, the office would be renamed as Secretary of State of Education and Culture (Secretaría de Estado de Educación y Cultura) by Law no. 66–97, which redefined the education system of the Dominican Republic.\nIt would adopt its current attributions on 2000 with the creation of the Secretary of State of Culture, by Law no. 41–00, thus becoming the Secretary of State of Education (Secretaría de Estado de Educación).\nIt adopted its current name, Ministry of Education (Ministerio de Educación), after the 2010 Constitutional reform and the subsequent Decree no. 56-10 which changed the names of all government agencies.\nInternal structure\nSimilar to other Ministries of the Dominican Republic, the Ministry of Education is subdivided into vice-ministries. These are:\n* Vice-ministry of Teaching Accreditation and Certification\n* Vice-ministry of Supervision, Evaluation and Control of Education Quality\nInside the Ministry, other offices are:\n* General Office of Early Education\n* General Office of Primary Education\n* General Office of Middle and High School Education\n* General Office of Education for Young Adults and Adults\n* General Office of Special Education\n* General Office of Counseling and Psychology\n* General Office of Culture\n* General Office of Evaluation\n* General Office of Syllabus\nOther departments and agencies are:\n* National Office for Education Planning and Development\n* International Cooperation Office\n* Ministry of Education's United Nations Model\n* Office for the Free Access to Information\n* Purchase and Contracting Department\n* Educational Radio-Television\nAffiliated institutions\nThe Ministry of Education has several institutions affiliated to it, dedicated to the well-being of students and teachers. These are:\n* National Institute of Comprehensive Attention for Early Infancy (INAIPI)\n* Dominican Institute of Evaluation and Investigation of Education Quality (IDEICE)\n* Salomé Ureña Higher Institute of Teacher Training (ISFODOSU), named after Dominican educator and poet Salomé Ureña\n* National Institute for Teacher Training (INAFOCAM)\n* National Institute for Teachers' Well-being (INABIMA)\n* National Institute for Students' Well-being (INABIE)\n* Dominican Teachers' Health Risks Administration (ARS SEMMA)\n* National Institute for Physical Education (INEFI)\nStatistics and publications\nThe Ministry of Education has a comprehensive list of data and statistics on its [https://siie.minerd.gob.do/ website]. There you can find a [https://siie.minerd.gob.do/mapa-escolar map] of all education centers in the country.\nAccording to this website, the number of students by academic year was as follows:\n{| class=\"wikitable\"\n|+Number of students per sector (2016-2021)\n!Academic year\n!Number of students\n!Public sector\n!Private sector\n!Semiofficial\n|-\n|2016-2017\n|2,749,144\n|2,069,929\n|672,758\n|51,557\n|-\n|2017-2018\n|2,736,697\n|2,051,250\n|637,940\n|47,507\n|-\n|2018-2019\n|2,807,279\n|2,090,436\n|669,287\n|47,556\n|-\n|2019-2020\n|2,761,118\n|2,058,675\n|655,371\n|47,072\n|-\n|2020-2021\n|2,388,553\n|1,969,632\n|384,302\n|34,619\n|}\nReferences\nExternal links\n* Ministry of Education - [https://www.ministeriodeeducacion.gob.do/ official website]"
    }
  ]
}