{
  "content": [
    {
      "type": "text",
      "text": "# Ministry of Agriculture (Azerbaijan)\n\nThe Ministry of Agriculture of Azerbaijan () is an Azerbaijani governmental agency within the Cabinet of Azerbaijan in charge of regulation of the economic activity in the agricultural sector of the country with a purpose of increasing the sector's production capacity. Agriculture is Azerbaijan's second most important natural resource playing a significant role in the country's economy. Between 2018 and 2023, the ministry was headed by Inam Karimov, who was then replaced by Majnun Mammadov.\nHistory\nThe ministry overseeing agricultural activity was first established on May 28, 1918 with declaration of independence of Azerbaijan Democratic Republic as the Ministry of Cultivation and Labor. On October 15, 1918 the name was changed to the Ministry of the State Property and Cultivation and after the establishment of Soviet rule in Azerbaijan in 1920, it was renamed to the State Land Commissariat. In 1986 the ministry was transformed into the State Committee on Agrarian Economy.\nIn 1992, after restoration of independence of Azerbaijan Republic, the ministry was re-established as the Ministry of Agriculture and Food. Finally, in 1993, the name was changed to its current.\nThe Ministry of Agriculture pursues public policy in the following areas:\n* development of production and processing of agricultural products;\n* providing the necessary services and information support to producers of agricultural products;\n* land reclamation and water management, veterinary medicine, plant quarantine and effective land use;\n* implementing a unified scientific and technical policy in the agricultural sector, organizing the development and implementation of priority research programs in crop production and livestock production;\n* ensuring the country's food security;\n* economic and social development of villages and rural areas.\nOrganization\n]]\nPresidential Decree No. 467 dated October 23, 2004 determined that the ministry, with the purpose of increasing the agricultural capacity of the country, focuses on development of production and processing of the agricultural products; provision of information to agricultural producers; melioration and water meconomy, veterinary, plant quarantine and favorable use of the soil; implementation of unique scientific-technical policy, organization of first priority programs on plant growing and animal breeding; ensuring food supply security in the country; economic and social development of the villages. The ministry holds trade and investment conferences in order to attract foreign investment into the sector and promote Azerbaijani foods in the world markets. In 2007, it held an Azerbaijan Food and Agriculture Trade Mission in the United States organized by the U.S.-Azerbaijan Chamber of Commerce.\nReforms\nAs a result of the first Nagorno-Karabakh War, Azerbaijan's agricultural sector went into a recession which led the leadership to pass three laws: About the agrarian reforms and About reforms in state farms and collective farms on February 18, 1995 and About land reform on July 16, 1995. Presidential Decree No. 467 from October 23, 2004, which also included establishment of the \"Agroleasing\" Open Joint Stock Company for leasing and financing of agricultural equipment, allocated AZN 100 billion and AZN 150 billion in 2005 and 2006 to the sector. As a result, between 1995 and 2004, grain production increased by 2.3 times, potatoes by 5.9 times, water melons by 8.5, vegetables by 2.5, fruits and berries by 1.3, meat by 1.9, milk by 1.4, eggs by 1.5, the cattle head count increased by 1.3, and the number of sheep and goats by 1.6 times.\nSee also\n*Cabinet of Azerbaijan\n*Agriculture in Azerbaijan\nReferences"
    }
  ]
}