{
  "content": [
    {
      "type": "text",
      "text": "# Ministry of the Republic of Italy\n\nA Ministry of the Republic of Italy is an administrative organ of the Republic of Italy, placed at the top of Italian public administration and is characterised by one or more specific competencies, with an organised structure, often varying over time.\nTypical structure\nThe  (ministro, from Latin minister, 'assistant') is the head of the ministry and is a member of the political class. The minister proposes the appointment of directors with general functions to the Council of Ministers, directs administrative action, and takes decisions on important matters. There are also ministers without portfolio for competencies that do not come with budgetary autonomy (e.g. the Minister for relations with Parliament).\nThe Under-secretary (sottosegretario) is also appointed from the political class. The title derives from the fact that the minister is a Secretary of State. However, the Under-secretary is only an assistant to the minister - they aid the minister but cannot act in their stead. A ministry may have multiple Under-secretaries. Under-secretaries do not have any powers of their own, but only those delegated to them by the minister. If the powers conferred on an Under-secretary comprise a whole department of the ministry, they may be given the title of Deputy Minister.\nThe Cabinet of the Minister (gabinetto del ministro) consists of the Head of the cabinet, the legislative office, and the specific secretariat, each with its own head. When the government changes, the members of the cabinet also change. The cabinet is empowered to assist the minister and co-ordinate activities of the ministry.\nThe board of administration (consiglio di amministrazione) is chaired by the minister and composed of general directors and elected representatives of the personnel. It has an established structure and powers related to the organisation of labour in the ministry.\nThe General Secretary (segretario generale) is only present in some ministries (e.g. the Ministry of Foreign Affairs) and has powers relating to co-ordination.\nSubdivisions of the ministry include departments, general directorates, divisions, etc. They are different in every ministry. Usually, the  (dipartimento or reparto) is the highest level sub-division of the ministry, and the general directorate (direzione generale) is a second-order sub-division. In some ministries, however, there are no departments and the general directorates are the highest level sub-division. The basic units of the ministry are the divisions (divisioni), which may be divided into sections (sezioni).\nMinistries of the Republic of Italy\nThere are fifteen ministries in the current Italian government:\n*Ministry of Foreign Affairs and International Cooperation (Ministero degli Affari Esteri e della Cooperazione Internazionale)\n*Ministry of the Interior (''Ministero dell'Interno)\n*Ministry of Justice (Ministero della Giustizia)\n*Ministry of Defence (Ministero della Difesa)\n*Ministry of Economy and Finance (Ministero dell'Economia e delle Finanze)\n*Ministry of Economic Development (Ministero dello Sviluppo Economico)\n*Ministry of Agricultural, Food and Forestry Policies (Ministero delle Politiche Agricole Alimentari Forestali e del Turismo)\n*Minister for the Ecological Transition (Ministero della transizione ecologica)\n*Ministry of Infrastructure and Transport (Ministero delle Infrastrutture e dei Trasporti)\n*Ministry of Labour and Social Policies (Ministero del Lavoro e delle Politiche Sociali)\n*Minister of Public Education (Ministero dell'istruzione)\n*Minister of University and Research (Ministero dell'università e della ricerca)\n*Ministry of Cultural Heritage and Activities (Ministero per i Beni e le Attività Culturali)\n*Ministry of Health (Ministero della Salute)\n*Minister of Tourism (Ministero del turismo)\nThe following departments of the Presidency of the Council of Ministers are headed by Ministers without Portfolio.\n* (Dipartimento per i rapporti con il Parlamento)\n* (Dipartimento per la Pubblica Amministrazione)\n* (Dipartimento per gli affari regionali e le autonomie)\n* (Dipartimento per le politiche di coesione), usually called the Department for the South and Territorial Cohesion (Dipartimento per il Sud e la Coesione Territoriale)\n* (Dipartimento per le Pari Opportunità)\n* (Dipartimento per le politiche della famiglia)\n* (Dipartimento per le politiche giovanili)\n* (Dipartimento per la trasformazione digitale), also called the Department for Technological Innovation and Digital Transition (Dipartimento per l'innovazione tecnologica e la transizione digitale'')\nHistory\n\"Bassanini reforms\" of 1999\nThe number of the ministries has varied over time from 20 to 25, including the ministers without portfolio.\nThe first attempt at structural reform of the Presidency of the Council, the structure of the Council of Ministers, and the arrangement of the ministers was put forward by Franco Bassanini, Minister of Public Administration in the Prodi I Cabinet, with legislative decree n. 300 of 30 July 1999. This measure outlined a new form of ministerial organisation, moving in three different directions.\nFirst of all, it reduced the size of the ministerial apparatus: the ministries were reduced to twelve, the civil service was transformed into a single body, to order to ensure its mobility. The principle of organisational flexibility was strongly asserted, through broad deregulation of the ministries' organisation, except for the functions of the ministers and the number of their subdivisions. Secondly, in order to ensure polycentrism, twelve independent agencies were established with technical operational functions, which require particular expertise, specialist knowledge, or specific forms of labour organisation. Thirdly, local offices of the state administration were all placed in the newly created Territorial Offices of the Government (UTG), which absorbed the .\nThe reform was meant to come into force in the 14th legislature, but it did not completely do so, since the Berlusconi II Cabinet modified the reforms on taking power. The ministries were expanded. Only a few of the proposed agencies were actually created: the Protezione Civile, Agency of Revenue, , the  (abolished in 2012), the  (merged into the Ministry of Finance in 2003), and the  (abolished in 2008).\nThe 'unpacking' of 2001\nUnder decree law n.217/2001 (converted into law n.317/2001), the Berlusconi II cabinet increased the number of ministries to fourteen.\n*The Ministry of Labour, Health and Social Policy was split into the Ministry of Health and the Ministry of Labour and Social Policy.\n*The Ministry of Communications was separated out of the Ministry of Productive Activities.\nThe 'unpacking' of 2006\nUnder decree law n.181/2006 (converted into law 233/2006), the Prodi II Cabinet increased the number of ministries to eighteen:\n*The Ministry of Productive Activities became the Ministry of Economic Development and the .\n*The Ministry of Education, Universities, and Research was split into the Ministry of Public Education and the\n*The Ministry of Infrastructure and Transport was split into separate Ministries of Infrastructure and of Transport.\n*The Ministry of Labour and Social Policy was split into the Ministry of Labour and Social Welfare and the\nThe return of the \"Bassanini reforms\", 2007\nIn the 2008 budget, in response to criticism of the record number of government ministers and the cost of politicians, the 16th legislature returned to the spirit of the Bassanini reforms of 1999 with some amendments, returning to twelve ministries.\n# Ministry of Foreign Affairs\n# Ministry of the Interior\n# Ministry of Justice\n# Ministry of Defence\n# Ministry of Economy and Finance\n# Ministry of Economic Development\n# Ministry of Agricultural, Food, and Forestry Policy\n# Ministry of the Environment and Protection of Land and Sea\n# Ministry of Infrastructure and Transport\n# Ministry of Labour, Health, and Social Policy\n# Ministry of Education, Universities, and Research\n# Ministry for Cultural Heritage and Activities\nThe maximum number of ministers, ministers without portfolio, deputy ministers, and under-secretaries in the government was fixed at sixty. The reformed system came into effect with the beginning of the Berlusconi IV Cabinet.\nModifications of 2009\nUnder law n. 172/2009 of 13 November, the Ministry of Labour, Health, and Social Policies was split into the Ministry of Labour and Social Policies and the Ministry of Health, bringing the number of ministries to thirteen and the total number of members of government to sixty-three. This latter number was increased to 65 under article 15.3 bis of decree law n. 159/2009 of 30 December (converted into law n.26/2010).\nModifications under the Renzi government\nIn 2013, the Ministry for Cultural Heritage and Activities absorbed competencies relating to tourism and its name was altered to reflect this. In 2014, the name of the Ministry of Foreign Affairs was changed to the Ministry of Foreign Affairs and International Co-operation.\nSee also\n* Constitution of Italy\n* 1993 Italian referendum\nBibliography\n*\nExternal links\n*\n*\n* [https://web.archive.org/web/20110511154605/http://www.normattiva.it/static/index.html Normattiva-il portale della legge vigente] is the website of the Republic of Italy, where all laws currently in force can be consulted, both those published in the Gazzetta Ufficiale, those that are part of the regional legislation, and laws that are awaiting formal publication."
    }
  ]
}