{
  "content": [
    {
      "type": "text",
      "text": "# Minimal Traditional__disambig_1\n\nMinimal Traditional is a style of architecture that emerged in mid 20th century America as a vernacular form that incorporates influences from earlier styles such as American Colonial, Colonial Revival, Spanish Revival, Tudor Revival, and American Craftsman while adhering to modern architecture's avoidance of ornament.\nThe Minimal Traditional style evolved during the 1930s and was a dominant style in domestic architecture until the Ranch-style house emerged in the early 1950s. Descending in part from the bungalows, cottages, and foursquare houses of the early 20th century, Minimal Traditional houses represent a \"stripped-down version of the historic-eclectic styles popular in the 1920s\". They are usually detached single-family houses that are on the smaller side and retain simplified versions of the built-in cabinets that were popular features of the Craftsman era. Typical features include hipped or gabled roofs without much in the way of eaves; cladding in locally popular materials such as wood, brick or stone; small porches; and an asymmetrical design with the front door set off center.\nThe Minimal Traditional house \"fulfilled aesthetic and social needs for affordable single-family housing\" and was used by the Federal Housing Administration as a prototype for a \"minimum house that the majority of American wage earners could afford\".\nMinimal Traditional houses have been tagged with some other names: FHA house, Depression-era cottage, Victory cottage, and American small house.\nFile:Dodds Street West 708, McDoel Gardens.jpg|Bloomington, Indiana, house built in 1931 in the Minimal Traditional style.\nFile:1722-n-hills-knoxville-tn1.jpg|Knoxville, Tennessee, house built in 1932 in the Minimal Traditional style.\nFile:1629-n-hills-knoxville-tn1.jpg|Knoxville, Tennessee, house built in 1939 in the Minimal Traditional style.\nFile:Fourth Street, 701, Steele Dunning.jpg|Bloomington, Indiana, house built in 1940 in the Minimal Traditional style.\nFile:4230 Shamley Green Drive, exterior views, 2020 - DPLA - be49456d8e39adba3866eace24b33d29 (page 2).jpg|Toledo, Ohio, house built in 1961 in the Minimal Traditional style.\nSee also\n*Traditionalist School (architecture)\nReferences\n. Georgia Department of Natural Resources, Historic Preservation Division. (Slideshow/PDF.)\n}}"
    }
  ]
}