{
  "content": [
    {
      "type": "text",
      "text": "# Ministry of Foreign Affairs of the Republic of Tajikistan\n\n| preceding1 =\n| preceding2 =\n| dissolved =\n| superseding =\n| jurisdiction = Government of Tajikistan\n| headquarters = Dushanbe\n| coordinates =\n| motto =\n| employees =\n| budget =\n| minister1_name = Sirojiddin Muhriddin\n| minister1_pfo = Minister of Foreign Affairs\n| minister2_name =\n| minister2_pfo =\n| deputyminister1_name =\n| deputyminister1_pfo =\n| deputyminister2_name =\n| deputyminister2_pfo =\n| chief1_name =\n| chief1_position =\n| chief2_name =\n| chief2_position =\n| chief3_name =\n| chief3_position =\n| chief4_name =\n| chief4_position =\n| chief5_name =\n| chief5_position =\n| chief6_name =\n| agency_type =\n| chief6_position =\n| chief7_name =\n| chief7_position =\n| chief8_name =\n| chief8_position =\n| chief9_name =\n| chief9_position =\n| parent_department = Government of Tajikistan\n| parent_agency =\n| child1_agency =\n| child2_agency =\n| keydocument1 =\n| website = [http://mfa.tj/?l=en Official Website]\n| footnotes =\n| map =\n| map_width =\n| map_caption =\n}}\nThe Ministry of Foreign Affairs of Tajikistan is a government ministry of Tajikistan. It is the central executive authority exercising state administration in the sphere of relations of the Republic of Tajikistan with foreign countries and international organizations. It carries out its activities in cooperation with other central executive bodies, local government bodies, legal entities. The Ministry of Foreign Affairs of the Republic of Tajikistan has the status of a legal entity, its own seal, stamps, and bank accounts. The current Minister is Sirojiddin Muhriddin.\nLineage\nOver 65 years, the name of the foreign ministry of Tajikistan has changed 5 times:\n* People's Commissariat of Foreign Affairs of the Tajik SSR (1944-1946)\n* Ministry of Foreign Affairs of the Tajik SSR (1946-1991)\n* Ministry of Foreign Affairs of the Republic of Tajikistan (1991-1992)\n* Ministry of External Relations of the Republic of Tajikistan (1992)\n* Ministry of Foreign Affairs of the Republic of Tajikistan (since 1992)\nHistory\nOn February 1, 1944, the Supreme Soviet of the USSR adopted a law granting the union republics powers in the field of foreign relations, which provided for the right of each union republic to enter into direct relations with foreign states. On May 12, 1944, the VII session of the Supreme Soviet of the Tajik SSR adopted the Law \"On the formation of the Union-Republican People's Commissariat of Foreign Affairs of the Tajik SSR.\" By July, Ali Akhmedov was appointed People's Commissar for Foreign Affairs of the Tajik SSR, who worked in this post until 1946. On March 15, 1946, the People's Commissariat of Foreign Affairs of the USSR was transformed into the Ministry of Foreign Affairs of the USSR. On March 27 of the same year, by the Decree of the Presidium of the Supreme Soviet of the Tajik SSR, the people's commissariats of the republic were transformed into the corresponding ministries and, accordingly, the People's Commissariat of Foreign Affairs of the Tajik SSR into the Ministry of Foreign Affairs of the Tajik SSR. On January 10, 1992, at the session of the Supreme Council of the Republic of Tajikistan, a new structure of the Government of the Republic was approved. Instead of the former Ministry of Foreign Affairs, the Ministry of External Relations was created, which was also given the functions of the Ministry of Foreign Economic Relations. On July 20, 1992, President Rahmon Nabiyev issued a decree “On improving the structure of the bodies for managing foreign relations of the Republic of Tajikistan”, and on August 27, of that year, pursuant to the decree, the Cabinet of Ministers of adopted a resolution on the issues of the Ministry of Foreign Affairs, approving the structure of the central office of the ministry.\nStructure\nSource:\n* Leadership\n** Minister - Sirojiddin Muhriddin\n** First Deputy Minister - Khusrav Nоziri\n** Deputy Minister - Muzaffar Huseynzoda\n*Group of Ambassadors-at-large\n*Main Consular Department\n*Personnel Department\n*Department of European and American Countries\n*Department of Middle East and African Countries\n*Department of Asia-Pacific Countries\n*CIS Department\n*Department of Strategic Studies\n*Department of International Organization\n*Department of External Economic Cooperation\n*Legal Department\n*State Protocol Department\n*Department of Information and Press\n*Department of General Information and Diplomatic Communication\n*Finance Department\n*Administrative Department\n*National Commission for UNESCO\n*Border and Territorial Unit\n*Shanghai Cooperation Organisation Unit\n*Information Technologies Unit\n*Translation Unit\n*Construction Unit\n*Tojikdipservice\n*Representative Office of the Ministry of Foreign Affairs in the Sughd Region\nList of ministers\nTajik SSR\n* Ali Akhmedov (1944 – 1946)\n* Jabbor Rasulov (1946 – 1955)\n* Tursun Uljabayev (1955 – 1956)\n* Nazarsho Dodkhudoyev (1956 – 1961)\n* Abdulakhad Kakharov (1961 – 1973)\n* Rakhman Nabiyev (1973 – 1981)\n* Rustambek Yusufbekov (1981 – 1984)\n* Usman Usmanov (1984 – 1989  )\nRepublic of Tajikistan\n* Lakim Kayumov (1989 – 1992)\n* Khudoberdy Kholiknazarov (1992)\n* Rashid Alimov (1992 – 1994)\n* Talbak Nazarov (1994 – 2006)\n*Khamrokhon Zarifi (2006 – 2013)\n* Sirojiddin Muhriddin (2013 – present)\nSee also\n* Politics of Tajikistan\n* Ministry of Foreign Affairs\n*Foreign relations of Tajikistan\nReferences"
    }
  ]
}