{
  "content": [
    {
      "type": "text",
      "text": "# Ministry for Post-War Assistance\n\n| dissolved            =\n| preceding1           = Ministry of Occupied Italy\n| jurisdiction         = Government of Italy\n| headquarters         =\n| coordinates          =\n| minister1_name       =\n| deputyminister1_name =\n| deputyminister2_name =\n| website              =\n}}\nThe Ministry for Post-War Assistance () was a government body of the Kingdom of Italy and later the Italian Republic responsible for providing assistance to Italian military personnel and civilians in the aftermath of World War II. The ministry existed from 1945 to 1947.\nHistory\nThe Ministry for Post-War Assistance was established by Lieutenancy Decree Number 380 of 21&nbsp;June&nbsp;1945 to provide moral and material assistance to Italian civilians and soldiers who were repatriated after being interned or taken prisoner during World War II; civilians displaced by bombing attacks during the war; civilians coming to Italy from former Italian colonies; refugees; partisans of the Italian resistance movement demobilized following the dissolution of their formations, and the families of partisans who either had died during the war or demobilized after it. The new ministry brought together what had been the responsibilities of the high commissioner for prisoners&nbsp;of&nbsp;war, the high commissioner for moral and material assistance to war refugees, the high commissioner for veterans, and the Ministry of Occupied Italy. After the creation of the Ministry for Post-War Assistance, the Ministry of Occupied Italy was abolished by Lieutenancy Decree Number&nbsp;391 of 5&nbsp;July &nbsp;1945.\nThe Ministry for Post-War Assistance was abolished by Legislative Decree of the Provisional Head of State Number&nbsp;27 of 14&nbsp;February&nbsp;1947. Its responsibilities were split between the Ministry of the Interior’s General Directorate of Post-War Assistance, the Ministry of Defence, and the Undersecretariat of State of the Presidency of the Council of Ministers.\nActivities\nThe ministry coordinated the search for missing persons and the repatriation of Italians from abroad, refugees, internees, and Italian prisoners. It managed 109 refugee collection centres, built accommodations for assisted compatriots, provided basic necessities, and dealt with the reintegration of war veterans into the Italian economy, including offering them jobs in public administration. It also provided social and health assistance. In 1947 the ministry drew up a report that calculated the number of Italians still held in prison camps around the world at 1.45 million.\nThe ministry included the Commission for the Recognition of Partisan Qualifications, which was responsible for the recognition of the status of \"patriots,\" “fighting partisans”, and those killed, disabled, or wounded during the War of Liberation, the Italian name for the Kingdom of Italy's participation during World War II on the Allied side between 1943 and 1945, including operations by the Italian Co-belligerent Forces and the Italian resistance movement against the Axis powers during both the Italian campaign and the simultaneous Italian Civil War between the Kingdom of Italy and the Italian Social Republic.\nThe ministry had strong roots across Italy, with offices present in every provincial capital. Until 1946, a separate branch of the ministry in Milan coordinated its activities in northern Italy. Although the ministry itself was abolished in 1947, the provincial offices remained open until 1954, when they were abolished and merged into the Assistance Division of the offices of the prefectures.\nList of ministers\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! rowspan=2 colspan=\"3\" | Minister\n! rowspan=2 | Party\n! rowspan=2 | Government\n! colspan=3 | Term of office\n! rowspan=2 | Legislativeassembly\n|-\n! Took office\n! Left office\n! Time in office\n|-\n| bgcolor=gainsboro colspan=\"9\" | Minister for Post-War Assistance of the Kingdom of Italy\n|-\n| rowspan=1 bgcolor=\"#008000\"|\n| rowspan=1|\n| rowspan=1| Emilio Lussu(1890-1975)\n| rowspan=1| Action Party\n| Parri\n| 21 June 1945\n| 10 December 1945\n|\n| rowspan=\"2\" bgcolor=#EFEFEF|National Council\n|-\n| rowspan=1 bgcolor=\"#FFC0CB\"|\n| rowspan=1|\n| rowspan=1| Luigi Gasparotto(1873-1954)\n| rowspan=1| Labour Democratic Party\n| De Gasperi I\n| 10 December 1945\n| 14 July 1946\n|\n|-\n| bgcolor=gainsboro colspan=\"9\" | Minister for Post-War Assistance of the Italian Republic\n|-\n| rowspan=1 bgcolor=\"#CE2029\"|\n| rowspan=1|\n| rowspan=1| Emilio Sereni(1907-1977)\n| rowspan=1| Italian Communist Party\n| De Gasperi II\n| 14 July 1946\n| 2 February 1947\n|\n| bgcolor=#EFEFEF|Constituent Assembly of Italy\n|}\nSee also\n* Government of Italy\n* Italian campaign (World War II)\n* Italian Civil War\n* Italian resistance\nSources\n*\n*\n*[http://dialnet.unirioja.es/descarga/articulo/3654131.pdf dialnet.unirioja.es] (in Spanish)\n*[http://www.liceosansepolcro.it/agg-storia/Bernacchi/Bernacchi.htm liceosansepolcro.it] (in Italian)\n*\n*[http://intranet.istoreto.it/esodo/parola.asp?id_parola=19 istoreto.it] (in Italian)\nExternal links\n*[http://www.lombardiabeniculturali.it/archivi/soggetti-produttori/ente/MIDB000E8D/ Ufficio distaccato dell'Alta Italia del Ministero dell'assistenza postbellica (1945 - 1947)] LombardiaBeniCulturali (in Italian)"
    }
  ]
}