{
  "content": [
    {
      "type": "text",
      "text": "# Ministry of Agriculture, Food and Forestry (Bulgaria)\n\nThe name of the ministry was changed in 2022 by the Ministry of Agriculture, Food and Forestry to the Ministry of Agriculture.\nThe Ministry of Agriculture, (, Ministerstvo na zemedelieto) of Bulgaria is the ministry charged with regulating agriculture and forestry in the country. It was founded as the Ministry of Agriculture and State Property on 24 July 1911, when it was separated from the Ministry of Commerce and Agriculture.\nIt was created by the Tarnovo Constitution.\nHistory of the Ministry\nThe history of today's Ministry of Agriculture and Foods starts back in 1879, when in pursuance of Article 161 of the Constitution, as adopted by the Founding National Assembly in Veliko Tarnovo provided for the establishment of seven ministries, including the ministry of common buildings, agriculture and trade. After vehement discussions the first National Assembly voted that the number of the ministries will be six, whereas the ministry of common buildings, agriculture and trade, in the words of Petko Karavelov, \"will integrate as it may be proper\". Thus, in pursuance of Decree No.23 of 9 August 1879, the administration of the agricultural affairs in the Principality of Bulgaria was put under the helm of the Ministry of Finance, which forms an internal unit for state property along with raw materials. Its sub-governor was appointed to be Ivan Dimov Goshev.\nIn pursuance of Decree No.463 of 1882, there is a second attempt to found the ministry of common buildings, agriculture and trade, but two and a half years later its functions are terminated on the grounds of being incompliant with the superimposing provisions of the Tarnovo Constitution.\nThe Fourth Great National Assembly suggested an amendment to the Tarnovo Constitution with regard also to Article 161 defining the number of the Bulgarian ministries. Hence, issue 107 of the State Gazette dated 25 May 1893 promulgates Proclamation of Tsar Ferdinand to the Bulgarian People for the establishment of the first legal Ministry of Trade and Agriculture. In pursuance of Decree No.5 dated 19 November 1893, Panayot Slavkov was appointed its first minister. Immediately after stepping into office, Minister Slavkov submitted for consideration at the National Assembly 2 bills – the first planning the funds required for the structural organization of the Ministry of Trade and Agriculture, and the second bill that provided for the allotment of interest-free to poor farmers and farms suffering from hailstorm. The competences of the newly established the Ministry of Trade and Agriculture cover the majority of national economic sectors, such as agriculture, cattle breeding, forests, waters, mines, crafts, industry, domestic and international trade, professional agricultural and crafts schools.\nIn 1895 the ministry indulged also with social policy, by forming agricultural funds whose administration and management is in the hands of the ministry itself. After the establishment of the Bulgarian Agricultural Bank in 1904, the ministry takes on the control and supervision on the bank's activities as well.\nWith the amendment of the Tarnovo Constitution in 1911, the Ministry of Trade and Agriculture is closed and replaced with the Ministry of Agriculture and State Property. It was headed by Dimitar Hristov, the last minister of the previous Ministry of Trade and Agriculture. The organizational structure of the new ministry includes 6 directorates – agriculture, veterinary, forests, hunting and fishing, waters and state property.\nBuilding\nRemains of a three-nave church from the 5th century with dimensions of 35 × 20 meters and a small necropolis around it have been discovered on the site of today's building of the Ministry of Agriculture.\nThe Ministry of Agriculture is housed in a building with Baroque architecture on 55 Hristo Botev Blvd. from 1944, designed by the Bulgarian architect Nikola Lazarov. The competition for the building of the District Palace dates back to 1912, but due to the wars the building was completed only in 1927. Today it is a cultural asset.\nUntil 1944, the District Chamber of the Kingdom of Bulgaria was located there and all district services were gathered in one place: the District Audit Office, the District Administration, the District Medical and Veterinary Physicians, the District Engineers and Architects, the District School Inspectors, the District Control Bureau and weights. In addition to them, the building houses the Standing Committee with its offices: Technical-School, Water Supply and Planning, the Directorate of Statistics, Forestry and the Regional Forestry Inspector.\nIn 1971 - 1975 a new one was built behind the old building, glued to the old one by means of an adapter-corridor.\nList of formers Ministers of agriculture 1969–2009\n*industry – Valkan Shopov –  December 1969 – October 1973\n*industry – Gancho Krastev – October 1973 – April 1978\n*industry – Grigor Stoichkov – April 1978 – April 1979\n*Minister president of Nacional agrarianidustri union (NAIU) – Vasil Canov – April 1979 – May 1981\n*Minister president of NAIU – Aleksander Petkov – May 1981 – March 1986\n*Minister of agriculture and forestry – Alexi Ivanov – March 1986 – December 1988\n*Minister of agriculture and forestry – Georgi Menov – December 1988 – February 1990\n*industry – Todor Pandov – February – December 1990\n*Minister of agriculture – Boris Spirov – December 1990 – November 1991\n*Minister of agriculture – Stanislav Dimitrov – November 1991 – May 1992\n*Minister of agricultural development – Georgi Stoianov – May – December 1992\n*Minister of agriculture – Georgi Tanev – December 1992 – October 1994\n*Minister of agriculture – Rumen Hristov – October 1994 – January 1995\n*industry – Vasil Chichibaba – January 1995 – January 1996\n*industry – Svetoslav Shivarov – January – June 1996\n*industry – Krastio Trendafilov – June 1996 – February 1997\n*– Rumen Hristov – February – May 1997\n*Minister of agriculture and forestry – Vencislav Varbanov – May 1997 – July 2001\n*Minister of agriculture and forestry – Mehmet Dikme – July 2001 – February 2005\n*Minister of agriculture and forestry and food supply – Nihat Kabil – February 2005 – April 2008\n*– Valeri Cvetanov – April 2008 – July 2009\n*- Miroslav Naydenov - July 2009 - March 2013\n*- Ivan Stankov - March 2013 - May 2013\n*- Dimitar Grekov - May 2013- August 2014\n*- Vasil Grudev - August 2014 -  November 2014\n*Minister of agriculture and forestry and food - Desislava Taneva - November 2014 - January 2017\n*Minister of agriculture and forestry and food - Hristo  Bozukov - January 2017 - May 2017\n*Minister of agriculture and forestry and food - Rumen Porozhanov - May 2017 - May 2019\n*Minister of agriculture and forestry and food - Desislava Taneva - May 2019 - May 2021\n*Minister of agriculture and forestry and food - Hristo  Bozukov - May 2021 - September 2021\n*Minister of agriculture and forestry and food - Hristo  Bozukov - September 2021 - December 2021\n*Minister of agriculture - Ivan Ivanov - December 2021 -\nStructure\n* Inspectorate\n* Financial controllers\n* Internal Audit Directorate\n* Monitoring, Coordination and Control Directorate of the Paying Agency\n* General administration\n* Human Resources Directorate\n* Legal Affairs and Legislation Directorate of the European Union\n* Finance and Property Management Directorate\n* Economic Activities, Investments and Hydromelioration Directorate\n* Information and Communication Services Directorate\n* Administrative Services Directorate\n* Public Relations and Protocol Directorate\n* Security Directorate\n* Public Procurement Directorate\n* Specialized administration\n* Directorate General for Agriculture and Regional Policy\n* Land Relations and Consolidation Directorate\n* Trade Companies and State Enterprises Directorate\n* Market Measures and Producers Organization Directorate\n* Direct Payments Directorate\n* Directorate for Identification of Agricultural Parcels\n* Analysis and Strategic Planning Directorate\n* State Aid and Regulations Directorate\n* European Coordination and International Relations Directorate\n* Rural Development Directorate\n* Maritime Affairs and Fisheries Directorate\n* Common Fisheries Policy Directorate\n* Agri-Food Chain Policies Directorate\n* Plant Breeding Directorate\n* Organic Production Directorate\n* Livestock Directorate\nAgencies at the Ministry of Agriculture\n* Bulgarian Food Safety Agency\n* Executive Forest Agency and relevant Regional Forest Directorates\nReferences\nExternal links\n* [https://www.mzh.government.bg/bg/ Official website]"
    }
  ]
}