{
  "content": [
    {
      "type": "text",
      "text": "# Ministry of Heritage and Tourism\n\n| coordinates     =\n| chief1_name     = Salem bin Mohammed Al Mahrouqi\n| chief1_position = Minister\n| chief2_name     =\n| chief2_position =\n| chief3_name     =\n| chief3_position =\n| parent_agency   =\n| child1_agency   = The Cultural Club\n| child2_agency   =\n| website         =\n}}\nThe Ministry of Heritage and Tourism  (MOHT) is the governmental body in the Sultanate of Oman responsible for promoting and preserving Omani heritage and tourism.\nThe current Minister of Heritage and Tourism is Salem bin Mohammed Al Mahrouqi.\nHistory\nThe first governmental body to be officially concerned with heritage and culture was the Ministry of Information and Culture (its name at the time) in accordance with the responsibilities assigned to it in 1975 by Royal Decree No 26/75. Some of these responsibilities were moved out of the Ministry of Information and Culture to the Ministry of Royal Court Affairs (its name at the time) by Royal Decree No 12/76 by transferring the Directorate of Heritage Collection to the Ministry of Royal Court Affairs. In 1976, Faisal bin Ali Al Said was appointed as the Minister of Omani Heritage who took over all heritage and cultural responsibilities.\nThe name of the Ministry of Omani Heritage was changed in the same year of its establishment to the Ministry of National Heritage and Culture, which in turn was renamed to the Ministry of Heritage and Culture in 2002. It was renamed to the Ministry of Heritage and Tourism in 2020.\nFunction\nThe competences of MOHC are as follows:\n#Discovering and maintaining cultural monuments and supervising the works of archeological missions.\n#Surveying, restoring and maintaining historical forts and buildings.\n#Establishing historical museums.\n#Discovering historical manuscripts and creating libraries for public access.\n#Preserving Omani heritage articles and facilitating their exploitation.\n#Supporting the participation of the private sector in the process of preserving and exploiting heritage.\n#Supporting traditional arts.\n#Supporting the establishment of national cultural institutions.\n#Developing the production of Omani artistic, literature, and intellectual works.\n#Drawing strategies and programs to support the creative community.\n#Supporting programs and projects concerned with authors.\n#Issuing publications relating to the promotion of the awareness of heritage and culture.\n#Auditing artistic works.\n#Contributing to the process of enforcing intellectual property laws.\n#Setting local, regional, and international cultural exhibitions and festivals.\n#Carrying out specialized researches and studies in the field of history, heritage, and culture.\n#Coordinating with Arab, regional, and international authorities and organizations related to the competences of the ministry.\n#Representing the Sultanate at local, regional, and international conferences, symposiums, and meetings related to the competences of the ministry.\n#Training the employees of the ministry.\nStructure\nMOHC has six Directorates-General:\n#The Directorate General for Monuments and Museums\n#The Directorate General for Records and Manuscripts\n#The Directorate General for Literature and Arts\n#The Directorate General for Cultural Organizations and Relations\n#The Directorate General for Culture and Heritage in Dhofar\n#The Directorate General for Administrative and Financial Affairs\nFormer senior officers\n*Faisal bin Ali Al Said – appointed as Minister of National Heritage and Culture in 1976.\n*Mal Allah bin Ali bin Habib – appointed as Undersecretary for the Ministry of National Heritage and Culture in 1982.\n*Salim bin Ismail bin Ali Al Suwaid – appointed as Undersecretary for the Ministry of National Heritage and Culture in 1986, then as the Undersecretary for the Ministry of National Heritage and Culture for Cultural Affairs in 1991.\n*Mohammed bin Ahmed Al Harthy – appointed as Undersecretary for the Ministry of National Heritage and Culture for Heritage Affairs in 1991.\n*Fatik bin Fahar bin Taimur Al Said – appointed as Secretary-General for Traditional Arts in 1994.\nReferences\nExternal links\n* [https://web.archive.org/web/20051001044411/http://www.mhc.gov.om/ Ministry of Heritage and Culture]"
    }
  ]
}