{
  "content": [
    {
      "type": "text",
      "text": "# Ministry of Culture (Syria)\n\nThe Ministry of Culture () is a government ministry office responsible for cultural affairs in Syria.\nHistory\nThe ministry was created during the union with Egypt in the name of the Ministry of Culture and National Guidance, and it was officially renamed the Ministry of Culture in 2014 according to Law 31.\nNames of the Ministry\n*Ministry of National Guidance (1958)\n*Ministry of Culture and National Guidance (1958–1961)\n*Ministry of National Guidance (1961)\n*Ministry of Culture and National Guidance (1961–1966)\n*Ministry of Culture, National Guidance and Tourism (1966–1972)\n*Ministry of Culture and National Guidance (1972–1980)\n*Ministry of Culture (1980–)\nOrganisation\nOrganisation scheme:\n* Directorate of the Minister's Office\n* Office of the Assistant Minister\n* Counsellor's office\n* Press office\n* Complaints office\n* Financial management\n* Informatics department\n* Readiness Department\n* Administrative Development Directorate\n* Legal Affairs Directorate\n* Directorate of Adult Education\n* Engineering Department\n* Directorate of Arab Cultural Centers and Libraries\n* Directorate of Revival of Folklore\n* Directorate of Theaters and Music\n* Festivals Directorate\n* Directorate of Conservatories and Ballet\n* Directorate of Fine Arts\n* Department of Internal Control\n* Technical Supervision Directorate\n* Directorate of Copyright Protection\n* Directorate of Planning, Studies and Statistics\n* Directorate of Child Culture\n* Directorate of Cultural Relations\n* Directorate of Administrative Affairs\nEntities affiliated with the Ministry\n* The National Library of Syria\n* General Cinema Corporation\n* Damascus Opera House\n* Directorate-General of Antiquities and Museums\n* Higher Institute of Dramatic Arts\n* Higher Institute of Music in Damascus\n* Syrian General Organization of Books\nResponsibilities\nObjectives\nThe Ministry of Culture works to achieve the following objectives:\n*Preserving the civilizational and cultural identity, and protecting the archaeological and historical heritage (tangible and intangible).\n* Spreading culture locally, Arab and international, and interacting with global cultures.\n* Taking care of the creative process, developing it and expanding its horizons.\n* Taking care of the educated, and protecting the cultural output.\n* Develop legislation, regulations and laws in line with the general visions and objectives of the Ministry.\n* Adopting the principle of transparency and ease of access to information to be available for use within the framework of the ministry's objectives, its work plan, and the service of citizens.\n* Achieving integration, a unified vision of workflow, eliminating the concept of duplication (in procedures and tasks), reducing wastage of time and effort, and raising the percentage of job performance.\n* Achieving integration with the information infrastructure and the comprehensive automation system in the country, and adopting the principle of feedback in order to achieve flexibility and permanent renewal in planning and decision-making.\n* Adopting clear standards of performance and description of tasks for all administrative structures at various levels.\n* Reducing the centralization of decisions, adopting the principle of planning according to objectives, raising the level of qualification and training of employees in the Ministry, and attracting, developing and training talents.\nTasks\nThe Ministry performs the following tasks:\n* Disseminating knowledge and culture among the masses, introducing the Arab civilization, spreading its message, and providing all capabilities to interact with major global civilizations.\n* Guiding the people in a correct national direction, working on developing their awareness and guiding them to what raises their social level, strengthens their moral spirit, and their sense of responsibility, and motivates them to cooperate, sacrifice and redouble efforts in the service of the nation and humanity.\n* Facilitating the means of popular culture, diversifying its methods and expanding its scope, enriching it with modern innovations and benefiting the largest possible number of them.\n* Contacting foreign cultural and artistic institutions and benefiting from their activities, and inviting senior men of culture, thought and art in the world to visit the Syrian Arab Republic and give lectures and talks in its various cities.\n* Implementation of the provisions of cultural treaties concluded with foreign and Arab governments, within the jurisdiction of the Ministry.\n* Organizing exhibitions, festivals, cultural and artistic parties, holding conferences, organizing competitions, setting prizes, encouraging the establishment of various cultural associations, tracking their activities, and helping them to carry out their tasks.\n* Reviving the ancient Arab heritage in science, literature, and research in Arabic language sciences, ensuring its safety and making it accommodate modern sciences, arts and inventions.\n* Discovering the archaeological and historical heritage of the Syrian Arab Republic, collecting its elements, preserving them and preserving them intact for future generations.\n* Creation of archaeological, historical, artistic and folk museums, and assistance in organizing other museums affiliated to the state's ministries, departments and public institutions.\n* Encouraging the arts and literature and directing them to what is required in the interest of the state, reviving its activities, securing its future, providing the means of life, work and welfare for its professionals, reviving literature and folk arts, developing and developing them, and collecting information about them.\nMinisters\n*Fathi Radwan (6 March 1958 – 7 October 1958)\n*Salah al-Din al-Bitar (Central Ministry) (7 October 1958 – 30 December 1959)\n*Thabet Al-Arees (Central Ministry) (20 September 1960 – 16 August 1961)\n*Riyad Al-Malki (Northern Territory) (7 October 1958 – 17 March 1960)\n*Thabet Al-Aris (Northern Territory) (17 March 1960 – 16 August 1961)\n*Tharwat Okasha (16 August 1961 – 29 September 1961)\n*Izzat al- Nass (29 September 1961 – 20 November 1961)\n*Ahmed Al-Samman (20 November 1961 – 22 December 1961)\n*Fouad Al-Adel (22 December 1961 – 16 April 1962)\n*Abdul-Salam Ojeili (16 April 1962 – 20 June 1962)\n*Omar Shakhashiro (20 June 1962 – 17 September 1962)\n*Rafik Gabriel Bashour (17 September 1962 – 9 March 1963)\n*Sami al-Jundi (9 March 1963 – 12 November 1963)\n*Shibli al-Aysami (12 November 1963 – 14 May 1964)\n*Asead Muhafil (14 May 1964 – 3 October 1964 )\n*Suleiman Al-Khash (3 October 1964 – 1 January 1966)\n*Asad Dargawi (1 January 1966 – 1 March 1966)\n*Jamil Shya (1 March 1966 – 19 January 1967)\n*Zuhair Akkad (19 January 1967 – 29 October 1968)\n*Suhail al-Ghazi (29 October 1968 – 21 November 1970)\n*Fawzi Kayali (21 November 1970 – 7 August 1976)\n*Dr. Najah al-Attar (7 August 1976 – 13 March 2000)\n*Maha Qanout (13 March 2000 – 13 December 2001)\n*Najwa Qassab Hassan (13 December 2001 – 10 September 2003)\n*Mahmoud al-Sayyed (10 September 2003 – 21 February 2006)\n* Riyad Naasan Agha (21 February 2006 – 3 October 2010)\n*Riad Ismat (3 October 2010 – 23 June 2012)\n* Dr. Lubanah Mshaweh (23 June 2012 – 27 August 2014)\n* Issam Khalil (27 August 2014 – 27 July 2016)\n* Muhammad al-Ahmad (27 July 2016 – 30 August 2020)\n* Dr. Lubanah Mshaweh (30 August 2020 – 23 September 2024)\n* Dr. Diala Barakat (23 September 2024 – 10 December 2024)\n* Vacant (10 December 2024 – 29 March 2025)\n* Mohammed Yassin Saleh (29 March 2025 – present)\nReferences\nExternal links\n*\n*"
    }
  ]
}