{
  "content": [
    {
      "type": "text",
      "text": "# Minnesota Book Awards\n\nThe Minnesota Book Awards are presented annually for books created by writers, illustrators or book artists who are Minnesotans. The award, originally established in 1988, is organized by The Friends of the Saint Paul Public Library.\nHistory\nThe Minnesota Book Awards were created in 1988 as part of the Minnesota Festival of the Book, an event which ran for two years. No awards were presented in 1990. Following this, the Awards were run by the Minnesota Center for the Book. In 2000, that organization (including the awards) was moved to the Minnesota Humanities Commission, which in turn announced in 2006 that the Friends of the Saint Paul Library would return to the lead organizational role for the Awards.\nCategories and special awards\nMinnesota Book Awards are presented for Children's Literature, General Nonfiction, Genre Fiction, Memoir & Creative Nonfiction, Minnesota, Novel & Short Story, Poetry, and Young People's Literature. Prior to 2007, these categories varied each year. Some examples of past categories are Architecture, Book Cover Design, Children's Picture Book, Fantasy and Science Fiction, Photography, and Science and Nature.\nIn addition to the awards in these categories, the Kay Sexton Award has been presented to recognize overall contributions to the state's literary community. Kay Sexton was the first recipient of the award, in 1988.\nThe annual Minnesota Book Artist Award, recognizing the recipient's excellence and contributions to the Minnesota book arts community, is administered and co-presented by the Minnesota Center for Book Arts.\nBeginning in 2007, the Readers' Choice Award is voted on by the general public, from a pool of works nominated in all Minnesota Book Award categories.\nIn 2012 the biennial Hognander Minnesota History Award was introduced, recognizing a scholarly work related to Minnesota history.\nOther Minnesota literary awards\nSince 1988, the Minnesota Fantasy Award has been presented annually to a person or persons with ties to Minnesota in recognition of their contributions to the fields of fantasy, science fiction and horror.\nAlso, since 1988, the Northeastern Minnesota Book Awards (NEMBA) has honored books that \"substantially represent northeastern Minnesota in the areas of history, culture, heritage, or lifestyle.\"\nReferences\nExternal links\n*[https://thefriends.org/minnesota-book-awards/ Official website]\n*[https://web.archive.org/web/20111228100236/http://twincities.upickem.net/engine/Welcome.aspx?contestid=27674 \"Minnesota Book Awards Readers' Choice Poll\"]\n*Author Readings from the Minnesota Book Awards:  [https://collection.mndigital.org/catalog/p16022coll38:195#?c=&m=&s=&cv=&rid= 1996], [https://collection.mndigital.org/catalog/p16022coll38:206#?c=&m=&s=&cv= 1997], [https://collection.mndigital.org/catalog/p16022coll38:205#?c=&m=&s=&cv= 1998], [https://collection.mndigital.org/catalog/p16022coll38:208#?c=&m=&s=&cv= 1999], NORTHERN LIGHTS Minnesota Author Interview TV Series"
    }
  ]
}