{
  "content": [
    {
      "type": "text",
      "text": "# Minnesota Independence College and Community\n\n}}\nMinnesota Independence College and Community (MICC) is a three-year postsecondary, life-skills and vocational training program for neurodivergent adults located in Richfield, Minnesota, United States.\nHistory\nMinnesota Independence College and Community, previously known as Minnesota Life College, is a non-profit organization that was founded in 1996 by Bev and Roe Hatlen, co-founders of Old Country Buffet. One of the Hatlen's children had a developmental disability, and upon graduation of high school had only a handful of schools like MLC (Now known as MICC) to choose from, all scattered across the United States. It was at that time that the Hatlen's decided to start a post-secondary school for young adults with learning disabilities, since one did not already exist in Minnesota, and it was at this time that Minnesota Life College was opened. Minnesota Life College changed their name on August 1, 2018 to Minnesota Independence College and Community.\nProgram\nMinnesota Independence College and Community is an apartment living innovative life skills instructional program for young adults whose learning disabilities pose serious challenges to their independence. Minnesota Independence College and Community is not like a traditional University or College. The education the students at MICC receive has more to do with teaching life skills instead of contemporary educational subject matter. MICC stresses skill acquisition in independent living, social development, vocational readiness, decision-making, and fitness and wellness. All of this can be summed up in the mission statement:\nThe Mission of Minnesota Independence College and Community is to prepare young adults with learning disabilities to achieve personal and financial self-sufficiency.\nThe program at Minnesota Independence College and Community is split into three phases. The Core Phase, which is for first and second year students, the Transition Phase, which is for third year students, and the third phase, the Community Living Program.\nCore Phase (MICC College - Core 1)\nThe core phase is the beginning of the program for all new students. During the core phase, students set individual goals based on an evaluation of their strengths, abilities and interests. Over the course of two years, the students begin to learn and practice self-management and social skills they may be lacking or having trouble in. Also during the core phase, students practice employment skills, fitness and nutrition, personal financial management, self-esteem building, and leadership opportunities. During the core phase, students live in a two-bedroom apartment that is shared with three other roommates.\nTransition phase (MICC College - Core 2 and 3)\nUpon completion of the core phase, students move into the transition phase. During the transition phase, students continue to practice the skills needed for healthy, independent living. Despite holding jobs, participating in internships, and/or attending a traditional postsecondary educational institution, transition students continue to live with MICC roommates on campus and maintain their involvement in MICC activities. After completion of the transition phase, students are considered to have graduated from Minnesota Independence College and Community.\nCommunity Program (CP) (MICC Community)\nUpon completion of the transition phase, Minnesota Independence College and Community graduates have gained the skills needed to live on their own. However, the community program (CP) is an additional program for graduates who need extra, more specific help and support. Graduates and their parents are able to select services such as job placement and job coaching, recreation and alumni activities, and case management. While participating in the community living program (CP), graduates live independently typically on campus in apartments separate from the core and transition students. People can be members of the community living program (CP) as long as they live within a 5 mile radius of the campus and have graduated from the Minnesota Independence College and Community undergraduate program.\nAnnual scholarship and programs benefit\nIn 2004, the school held its first benefit to raise money for the students and program.  Since then, once a year, usually at the end of April, it holds a benefit to raise money for the program.  The Gala, as it is commonly referred, raises money to help with scholarships for families in need of assistance, as well as support program costs.  It consists of both a silent and live auction, accompanied by a formal sit down meal and various speakers, including students in the program.  In the past, the event has been emceed by a local celebrity in the community (such as KARE/11 news anchor Julie Nelson in 2004 and 2005).\nSee also\n*Intellectual disability and higher education in the United States\nReferences"
    }
  ]
}