{
  "content": [
    {
      "type": "text",
      "text": "# Mirage (OneRepublic song)\n\n}}\n}}\n\"'Mirage (for Assassin's Creed Mirage)\", or simply \"Mirage'\" is a song by American pop rock band OneRepublic featuring Saudi Arabian singer Mishaal Tamer released in promotion of the Ubisoft video game ''Assassin's Creed Mirage. It was released through Mosley and Interscope Records on September 22, 2023. The song is the fifth single from OneRepublic’s sixth studio album Artificial Paradise'' (2024).\nBackground and composition\n\"Mirage\" was written by Ryan Tedder, Mishaal Tamer, Brendan Angelides, and Grant Boutin. It was produced by Tedder and Boutin and mixed by Serban Ghenea. The song was written and produced in Bangkok and Tokyo within four days, immediately after receiving the request for the song. Tamer was added as a vocalist after the band wanted to have a Middle Eastern artist in the song and was the best choice as he was touring with the band on the Artificial Paradise Tour. In a statement, Tedder described the desire for the song:\nThe song's lyrics describe the similar story of the Assassins of ''Assassin's Creed'', with a self-determined theme carried through the verses. Tamer's bridge is in Arabic and, according to the official video's translation, describes persevering when others falter.\nMusic video\nA music video for \"Mirage\" premiered on September 22, 2023 and was directed by Tomás Whitmore. The video features Tedder as an Assassin with other band members and Tamer performing in a dark tunnel with moving and atmospheric lighting intermittent with cinematic footage of ''Assassin's Creed Mirage''. The video was shot in Malta, close in time to the band's set at Isle of MTV, inside a tunnel where soldiers would march before going to battle.\nCharts\n{|class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+ Chart performance for \"Mirage\"\n! scope=\"col\"| Chart (2023)\n! scope=\"col\"| Peakposition\n|-\n! scope=\"row\"| New Zealand Hot Singles (RMNZ)\n| 31\n|-\n! scope=\"row\"| San Marino (SMRRTV Top 50)\n| 35\n|-\n|}\nReferences"
    }
  ]
}