{
  "content": [
    {
      "type": "text",
      "text": "# Mithridatic dynasty\n\nThe Mithridatic dynasty, also known as the Pontic dynasty, was a hereditary dynasty of Persian origin, founded by Mithridates I Ktistes (Mithridates III of Cius) in 281 BC. The origins of the dynasty were located in the highest circles of the ruling Persian nobility in Cius. Mithridates III of Cius fled to Paphlagonia after the murder of his father and his predecessor Mithridates II of Cius, eventually proclaiming the Kingdom of Pontus, and adopting the epithet of \"Ktistes\" (literally, Builder). The dynasty reached its greatest extent under the rule of Mithridates VI, who is considered the greatest ruler of the Kingdom of Pontus.\nThey were prominent enemies of the Roman Republic during the Mithridatic Wars during the reign of Mithridates VI until the late 60s BC. In 48 BC, the Roman client king of the Crimea, Pharnaces II, attempted to press his claim on Pontus, but was decisively defeated by Julius Caesar at the Battle of Zela.\nHistory\nThe Mithridatids reached their greatest extent under the rule of Mithridates VI, who conquered the neighboring territories of Colchis and Trapezos, as well as succeeding in becoming ruler of the Bosporan Kingdom after the death of Paerisades V.\nThis however, did not last long. His son and successor was ousted from rule of the Pontic Kingdom after his defeat at Zela, leaving only the Bosporan Kingdom under direct Mithridatid control, who nonetheless also was ousted from power by the general Asander.\nThe dynasty, through Dynamis, the daughter of Mithridates VI, and her offspring, would continue to rule the Bosporan Kingdom until 342 AD. The Bosporan Kingdom would remain the longest lasting client-state of the Roman Empire. Their descendants include:\n*Mithridates III, who opposed Roman rule during the Roman-Bosporan War.\n*Cotys I, who supported the Romans against his brother Mithridates.\n*Sauromates II, who expanded the kingdom and inflicted serious injuries to the Scythian and Siracian tribes.\n*Rhescuporis VI, the final ruler of the Bosporan Kingdom who died in 342 AD.\nKings of Pontus\n{| class=\"wikitable\" align=\"center\" | style=\"margin: 1em auto 1em auto; width: 75%\"\n|+Kings of Pontus\n!width=\"220px\"|King !! align=\"center\"  width=\"120px\"|Reign (BC) !! width=\"180px\"|Consort(s) !! |Comments\n|-\n|Mithridates I Ctistes||281–266 BC |||| Ctistes meaning Builder\n|-\n|Ariobarzanes || 266–250 BC|||| son of Mithridates I\n|-\n|Mithridates II || c.250 – c.210 BC||Laodice|| Son of Ariobarzanes\n|-\n|Mithridates III|| c.210 – c.190 BC||Laodice|| Laodice may have been the daughter of Antiochus IV\n|-\n|Pharnaces I|| c.190 – c. 155 BC||Nysa|| Eldest son of Mithridates III\n|-\n|Mithridates IV Philopator Philadelphus||155–150 BC||Laodice|| Laodice was his sister-wife.\n|-\n|Mithridates V Euergetes|| 150-120 BC|| Laodice VI ||\n|-\n|Mithridates Chrestus|| 120-116 BC|| None || Jointly Succeeded  with brother Mithridates VI, who was forced into hiding. When brother came out Chrestus lost throne.\n|-\n|Mithridates VI Eupator || 120–63 BC||Multiple|| Led Mithridatic Wars against Rome.\n|-\n|Pharnaces II|| 63–47 BC |||| Last direct ruler of the Kingdom of Pontus\n|-\n|}\nFamily tree of Mithridatids, kings of Pontus\nSources\n*\nReferences"
    }
  ]
}