{
  "content": [
    {
      "type": "text",
      "text": "# Moa Island (Queensland)\n\n}}\n| archipelago        = Torres Strait Islands\n| waterbody          = Torres Strait\n| total_islands      = 1\n| major_islands      =\n| area_km2           =\n| area_footnotes     =\n| rank               =\n| length_km          =\n| length_footnotes   =\n| width_km           =\n| width_footnotes    =\n| coastline_km       =\n| coastline_footnotes =\n| elevation_m        =\n| elevation_footnotes =\n| highest_mount      =\n| country            = Australia\n| country_admin_divisions_title = State\n| country_admin_divisions = Queensland\n| country_admin_divisions_title_1 = Local government area\n| country_admin_divisions_1 = Torres Strait Island Region\n| demonym            =\n| population         =\n| population_as_of   =\n| density_km2        =\n| density_footnotes  =\n| ethnic_groups      = Torres Strait Islanders\n| website            =\n| additional_info    =\n}}\n| pop_footnotes       =\n| established         =\n| postcode            = 4875\n| area                = 170.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               =\n| dir1                =\n| location1           =\n| dist2               =\n| dir2                =\n| location2           =\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Torres Strait Island Region\n| stategov            = Cook\n| fedgov              = Leichhardt\n| near-n              = Mabuiag Island\n| near-ne             = Torres Strait\n| near-e              = Torres Strait\n| near-se             = Torres Strait\n| near-s              = Torres Strait\n| near-sw             = Torres Strait\n| near-w              = Torres Strait\n| near-nw             = Badu Island\n}}\nMoa Island, also called Banks Island, is an island of the Torres Strait Islands archipelago that is located  north of Thursday Island in the Banks Channel of Torres Strait, Queensland, Australia. It is also a locality within the Torres Strait Island Region local government area. This island is the largest within the \"Near Western\" group. It has two towns, Kubin on the south-west coast and St Pauls on the east coast, which are connected by bitumen and a gravel road. In the , Moa Island had a population of 432 people.\nGeography\nMoa Island is a part of the Torres Strait's western island group and is the second largest island in the Torres Strait. There are two communities on Moa: Kubin community, located on the southern side of the island, and St Paul's community, located to the north, known as Wag. The communities are connected by a road.\nHistory\nThe Mualgal /muwal̪gal̪/ people traditionally formed two groups, the southern Italgal /ital̪gal̪/ and the northern Mualgal, and are the traditional owners of the island and refer to the island as 'Mua' or Moa.Mualgal People v Queensland [1999] FCA 157.\nCaptain William Bligh, in charge of the British Navy ships Providence and Assistant, visited Torres Strait in 1792 and mapped the main reefs and channels. The island was named Banks Island by Captain Bligh in honour of his patron and friend, the botanist Sir Joseph Banks. In the 1860s, beche-de-mer (sea cucumber) and pearling boats began working the reefs of Torres Strait but few Europeans visited Moa before the 1870s. The European beche-de-mer and pearling boats extensively worked the sea beds between Moa and Badu Islands in the 1870s and recruited local Islander men to work on their boats. A small pearling station was established on Moa Island by John Gay between 1872 and 1875.\nIn 1872, the Queensland Government sought to extend its jurisdiction and requested the support of the British Government. Letters Patent were issued by the British Government in 1872 creating a new boundary for the colony, which encompassed all islands within a 60 nautical mile radius of the coast of Queensland. This boundary was further extended by the Queensland Coast Islands Act 1879 (Qld) and included the islands of Boigu, Erub, Mer and Saibai, which lay beyond the previous 60 nautical mile limit. The new legislation enabled the Queensland Government to control and regulate bases for the beche-de-mer and pearling industries, which previously had operated outside its jurisdiction.\nTorres Strait Islanders refer to the arrival of London Missionary Society (LMS) missionaries in July 1871 as \"the Coming of the Light\". Reverend A W Murray and William Wyatt Gill were the first LMS missionaries to visit Moa Island in October 1872. South Sea Islander lay preachers were appointed as teachers to work on the island the following month. While the South Sea Islander teachers established a mission settlement at Totalai on the northern side of the island, by 1901 the settlement had been completely abandoned.\nA new settlement named Adam was established on the western side of the island during the 1900s. People from the villages of Totalai and Dabu moved to Adam under the leadership of Elder Abu Namai. The village of Adam had better access to the facilities of Badu Island, including its school and the stores and trading stations operated by Papuan Industries Limited (PIL). PIL was a philanthropic business scheme designed by the LMS missionary Reverend Walker to promote \"independent native enterprise\" by encouraging them to co-operatively rent or purchase their own pearl luggers or \"company boats\". The company boats were used to harvest pearl shells and beche-de-mer, which were sold and distributed by PIL. The Queensland Government supported the scheme and worked in partnership with PIL. Company boats provided Islanders with income and a sense of community pride and also improved transport and communication between the islands. The community at Adam operated a number of company boats including the Moa and the Adam. Men from Moa Island also regularly worked with pearling crews from Badu.\nIn 1904, the Australian Government introduced a restrictive immigration policy, which resulted in the forced repatriation of many Pacific Islander labourers, following the federal government's introduction of a restrictive immigration policy in 1904, the Queensland Government set aside an Aboriginal reserve on Moa's eastern shore for those who had married Torres Strait Islander and Aboriginal people. In 1908 the Anglican Church began developing St. Paul's Mission. They also established the St. Paul's Native Training College. A community council was established under the Torres Strait Islander Act 1939, and in 1985, the St. Paul's community gained ownership of their land through a Deed of Grant in Trust.\nOn 20 May 1908, the Queensland government formally gazetted 500 acres as a reserve for the benefit of South Sea Islander people on the eastern side of Moa Island. In 1908, with the encouragement of Hugh Milman (the government resident at Thursday Island), the Anglican Church founded a mission specifically for South Sea Islander families on the reserve land. Milman suggested that the new mission should be named St Pauls, after the famous St Paul's Cathedral in London. The mission was operated by Deaconess Florence Griffiths Buchanan who was a missionary teacher. Her work was described as \"the labor of patient untiring love and energy\" and she was much loved by the children, who she called \"Moabites\" and who called her \"Teashher\" (teacher) in return).\nApart from its religious purpose, St Paul's Mission was intended to be a self-supporting settlement through a mixture of agriculture, fishing and the weaving of mats and baskets. The mission was at the foot of a mountain known as the Great Peak to the south-west of the island. The village was built on flat ground between the beach and the scrub lands at the foot of the mountain. The houses were built on piles and made of grass and saplings. In 1912 there were 70 people at the settlement with expectations it would increase. Until June 1910, the settlement received no outside help but from that date the Queensland Government provided a grant of £120 per annum to \"educate the natives\". At that time, the government also doubled the size of the mission lands in recognition of the progress in establishing gardens and coconut plantations. The mission owed a cutter Bengal, which operated between Thursday Island and Moa as well as visiting neighbouring islands. By 1912 £40 had already been raised to build a church, as the services were being held in the schoolroom which also served as a hospital and Buchanan's residence.\nFrom 1911, Ethel Zahel visited Adam (later Poid) village to assist the councillors and, after 1915, to supervise the mission-trained native teacher.  In 1928 a European teacher was appointed.\nIn November 1912, 36,000 acres of land on Moa Island were officially gazetted as an Aboriginal reserve by the Queensland Government, exclusive of the land already gazetted for the South Sea Islanders. Many other Torres Strait Islands were gazetted as Aboriginal reserves at the same time. In 1922, the name of the settlement at Adam was changed to Poid.\nBy 1918, a Protector of Aboriginals had been appointed to Thursday Island and, during the 1920s and 1930s, racial legislation was strictly applied to Torres Strait Islanders, enabling the government to remove Islanders to reserves and missions across Queensland.\nIn the early 1920s, the Queensland Government made the decision to remove the Kaurareg people from Hammond Island, publicly stating that their close proximity to Thursday Island encouraged drunkenness and immorality in the community. Preparations for the removal began in 1921 with the construction of new quarters at Poid on Moa Island. In March 1922, the Kaurareg community were forcibly removed by government authorities from Hammond Island and transported to Moa Island on a Papuan Industries vessel named Goodwill. Three members of the Hammond Island community who protested against the removal were arrested without charge by police armed with revolvers.\nIn 1936, around 70% of the Torres Strait Islander workforce went on strike in the first organised challenge against government authority made by Torres Strait Islanders. The nine-month strike was an expression of Islanders' anger and resentment at increasing government control of their livelihoods. The strike was a protest against government interference in wages, trade and commerce and also called for the lifting of evening curfews, the removal of the permit system for inter-island travel, and the recognition of Islanders' right to recruit their own boat crews.\nThe strike produced a number of significant reforms and innovations. Unpopular local Protector J.D McLean was removed and replaced by Cornelius O'Leary. O'Leary established a system of regular consultations with elected Islander council representatives. The new island councils were given a degree of autonomy including control over local police and courts.\nOn 23 August 1937, O'Leary convened the first Inter Islander Councillors' Conference at Yorke Island. Representatives from 14 Torres Strait communities attended the conference. Wees Nawie and Sailor represented Poid at the conference. After lengthy discussions, unpopular bylaws, including the evening curfews, were cancelled and a new code of local representation was agreed upon. In 1939, the Queensland Government passed the Torres Strait Islanders Act 1939, which incorporated many of the recommendations discussed at the conference. A key section of the new Act officially recognised Torres Strait Islanders as a separate people from Aboriginal Australians.\nDuring the 1920s and 1930s, the settlement at Poid experienced regular epidemics of malaria and dengue fever, as well as shortages of fresh water. In 1943, the community at Poid made the decision to move to a new location named Kubin, situated on the south-west coast of Moa Island. The country near Kubin had fresh water springs and was believed to be a far healthier environment than Poid. By 1945, a church and school had been constructed at Kubin and the entire population of Poid had moved to the new settlement.\nDuring World War Two, the Australian Government recruited Torres Strait Islander men to serve in the armed forces. Enlisted men from Moa and other island communities formed the Torres Strait Light Infantry. While the Torres Strait Light Infantry were respected as soldiers, they only received one third the pay given to white Australian servicemen. On 31 December 1943, members of the Torres Strait Light Infantry went on strike calling for equal pay and equal rights. The Australian Government agreed to increase their pay to two thirds the level received by white servicemen. Full back pay was offered in compensation to the Torres Strait servicemen by the government in the 1980s.\nThe mineral wolfram was discovered on Moa Island in the 1930s and members of the Kubin and St Pauls communities began mining wolfram in 1938. During the 1950s and 1960s, the Rev Alf Clint established a Christian co-operative which ran mining operations on the island. All mining activity ceased on the island in 1973, when the price of the mineral dropped on world markets.\nIn 1946, a group of 10 Kaurareg men from Kubin community, led by Elekiam Tom, made the decision to move to Horn Island. They built houses and a church for their families in an area inland from the main wharf, which came to be known as Wasaga village. Other Islanders from Kubin community left the Torres Strait region to work on the Australian mainland.\nSt Pauls State School opened on 29 January 1985.\nAfter gaining its independence from Australia in 1975, Papua New Guinea asserted its right to the islands and waters of the Torres Straits. In December 1978, a treaty was signed by the Australian and Papua New Guinea governments that described the boundaries between the two countries and the use of the sea area by both parties. The Torres Strait Treaty, which has operated since February 1985, contains special provision for free movement (without passports or visas) between both countries. Free movement between communities applies to traditional activities such as fishing, trading and family gatherings which occur in a specifically created Protected Zone and nearby areas. The Protected Zone also assists in the preservation and protection of the land, sea, air and native plant and animal life of the Torres Strait.\nOn 1 January 2017, St Pauls State School became the St Pauls Campus of the Tagai State College, which has 17 campuses throughout the Torres Strait.\nDemographics\nIn the , Moa Island had a population of 448 people.\nIn the , Moa Island had a population of 432 people.\nCultural groups\nKubin is a community largely made up of the original Italgal, the Mualgal from north Moa, some of the Kulkalgal of Nagi, and the Kaiwalgal (Kaurareg) people, who were moved to Poid, on the southwestern corner of Moa Island in 1921. Poid was abandoned after World War II; one group moving back to their Narupai (Horn Island) homeland and the remainder moved southeast to Kubin to be able to see their homeland under the leadership of Wees Nawia.\nLocal government\nOn 30 March 1985, the Kubin community elected 3 councillors to constitute an autonomous Kubin Island Council. On 21 October 1985, the council area, previously an Aboriginal reserve held by the Queensland Government, was transferred to the trusteeship of the council under a Deed of Grant in Trust.\nIn 2007, the Local Government Reform Commission recommended that the 15 Torres Strait Island councils be abolished and the Torres Strait Island Regional Council be established in their place. The first Torres Strait Islands Regional Council (TSIRC) was elected on 15 March 2008 in elections conducted under the Local Government Act 1993.\nLanguages\nThe language of Kubin is Kala Lagaw Ya (Muwalgau/Italgau and Kaiwalgau sub-dialects), while that of St. Pauls is Brokan (Torres Strait Creole), though many people are bilingual in Kala Lagaw Ya.\nEducation\nSt Pauls Campus is a primary (Early Childhood-6) campus of Tagai State College at 10 Anu Namai Road ().\nKubin Campus is a primary (Early Childhood-6) campus of Tagai State College at Kanaian Yabu ().\nThere are no secondary schools on the island. The secondary (7–12) campus of Tagai State College is on Thursday Island.\nSee also\n}}\n*List of Torres Strait Islands\nReferences\nAttribution\nThis Wikipedia article contains material from [https://www.qld.gov.au/atsi/cultural-awareness-heritage-arts/community-histories-kubin/index.html Aboriginal and Torres Strait Islander community histories: Kubin (Moa) Island]. Published by [https://en.wikipedia.org/w/State_of_Queensland The State of Queensland] under [https://en.wikipedia.org/w/CC_BY_4.0 CC-BY-4.0], accessed on 3 July 2017.\nFurther reading\n*  — full text online\n*  — full text online\n*  — with full text for all 22 chapters\nExternal links\n*[https://web.archive.org/web/20060819052241/http://tsieducation.eq.edu.au/modules/page/?artid=7 Kubin State School]\n*[https://web.archive.org/web/20060507061035/http://www.atns.net.au/biogs/A000181b.htm Mualgal People v State of Queensland (1999) FCA 157 (12 February 1999)]\n*[https://www.qld.gov.au/atsi/cultural-awareness-heritage-arts/community-histories-st-pauls/ Community Profile for St Pauls (Moa)]\n*[https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/tqqf2h/alma99183893213402061 Culture Love 2009], State Library of Queensland- contains images and videos of culture in Kubin, Moa Island"
    }
  ]
}