{
  "content": [
    {
      "type": "text",
      "text": "# Mobile phone tracking\n\nMobile phone tracking is a process for identifying the location of a mobile phone, whether stationary or moving. Localization may be effected by a number of technologies, such as the multilateration of radio signals between (several) cell towers of the network and the phone or by simply using GPS tracking. To locate a mobile phone using multilateration of mobile radio signals, the phone must emit at least the idle signal to contact nearby antenna towers and does not require an active call. The Global System for Mobile Communications (GSM) is based on the phone's signal strength to nearby antenna masts.\nMobile positioning may be used for location-based services that disclose the actual coordinates of a mobile phone. Telecommunication companies use this to approximate the location of a mobile phone, and thereby also its user.\nTechnology\nThe location of a mobile phone can be determined using several complementary technologies. Modern phones typically use a Hybrid positioning system that combines these methods to provide the fastest and most accurate location possible.\nHandset-based positioning\nThis is the most common method, where the device itself calculates its own position.\n* GNSS / GPS: The phone uses a built-in receiver to calculate its precise location from signals broadcast by satellite navigation constellations (like GPS, GLONASS, or Galileo). This is the most accurate method when outdoors.\n* Wi-Fi Positioning: In areas with poor satellite reception, such as indoors or in dense \"urban canyons,\" the phone can scan for nearby Wi-Fi networks. It then calculates its position by cross-referencing the unique identifiers (BSSIDs) of these networks against a global, crowdsourced database of their locations.\n* Fingerprinting: This technique records the \"signature\" of home and neighboring cell signal strengths at different points in an area. The device can then match its current signal signature to this database to determine its location.\nNetwork-based positioning\nThis method relies on the cellular network infrastructure to determine the phone's location. The advantage is that it can be implemented non-intrusively by the service provider without any special software on the handset.\n* Cell ID: The least accurate method, which uses the known location of the single cell tower the phone is communicating with. Its precision is low, especially in rural areas where cell towers are far apart.\n* Multilateration: More advanced systems use the signal strength and timing from multiple adjacent cell towers to triangulate the phone's position. This is more accurate in urban areas where cell tower density is high.\nData transmission in modern applications\nFor any location-based service to function, the position data calculated by the phone (whether from GPS, Wi-Fi, or the network) must be transmitted to a server. The phone's built-in cellular modem sends this telemetry data over the mobile network (e.g., 4G/5G).\nThis \"phone-as-a-sensor\" model is the foundation for many modern on-demand services and is a key part of fleet digitalization. Applications for food delivery, courier services, and ride-hailing (like Uber or Lyft) rely on the phone's transmitted location data to function. The phone itself acts as the GPS tracking unit for the service's fleet management platform, allowing it to dispatch the nearest driver, provide customers with a real-time track and trace map, and calculate billing. The reliability of these services depends on this constant data connection; for example, the shutdown of older 3G networks required many commercial services to ensure their devices were 4G or 5G capable to maintain connectivity.\nOperational purpose\nIn order to route calls to a phone, cell towers listen for a signal sent from the phone and negotiate which tower is best able to communicate with the phone. As the phone changes location, the antenna towers monitor the signal, and the phone is \"roamed\" to an adjacent tower as appropriate. By comparing the relative signal strength from multiple antenna towers, a general location of a phone can be roughly determined. Other means make use of the antenna pattern, which supports angular determination and phase discrimination.\nNewer phones may also allow the tracking of the phone even when turned on but not active in a telephone call. This results from the roaming procedures that perform hand-over of the phone from one base station to another.\nConsumer applications\nA phone's location can be shared with friends and family, posted to a public website, recorded locally, or shared with other users of a smartphone app. The inclusion of GPS receivers on smartphones has made geographical apps nearly ubiquitous on these devices. Specific applications include:\n* Geo-fence specific locations of interest such as No Fly Zones\n* GPS navigation and maps\n* Locator apps like Find My Friends\n* Dating apps like Grindr\n* Recording a journey, for example to show a hiking accomplishment\n* For quantified self purposes such as fitness tracking\n* GPS drawing\nIn January 2019, the location of her iPhone as determined by her sister helped Boston police find kidnapping victim Olivia Ambrose.\nPrivacy\nLocating or positioning touches upon delicate privacy issues, since it enables someone to check where a person is without the person's consent. Strict ethics and security measures are strongly recommended for services that employ positioning.\nIn 2012 Malte Spitz held a TED talk on the issue of mobile phone privacy in which he showcased his own stored data that he received from Deutsche Telekom after suing the company. He described the data, which consists of 35,830 lines of data collected during the span of Germany's data retention at the time, saying, \"This is six months of my life [...] You can see where I am, when I sleep at night, what I'm doing.\" He partnered up with ZEIT Online and made his information publicly available in an [http://www.zeit.de/datenschutz/malte-spitz-vorratsdaten interactive map] which allows users to watch his entire movements during that time in fast-forward. Spitz concluded that technology consumers are the key to challenging privacy norms in today's society who \"have to fight for self determination in the digital age.\"\nChina\nThe Chinese government has proposed using this technology to track commuting patterns of Beijing city residents. Aggregate presence of mobile phone users could be tracked in a privacy-preserving fashion. This location data was used to locate protesters during protests in Beijing in 2022.\nEurope\nIn Europe most countries have a constitutional guarantee on the secrecy of correspondence, and location data obtained from mobile phone networks is usually given the same protection as the communication itself.\"Chapter X, Fundamental Rights and Duties of Citizens, Article 128\". [http://www.departments.bucknell.edu/russian/const/36cons04.html#chap10 1936 Constitution of the USSR.] The inviolability of the homes of citizens and privacy of correspondence are protected by law.\nUnited States\nIn the United States, there is a limited constitutional guarantee on the privacy of telecommunications through the Fourth Amendment. The use of location data is further limited by statutory, administrative, and case law. Police access of seven days of a citizen's location data is unquestionably enough to be a fourth amendment search requiring both probable cause and a warrant.\nIn November 2017, the United States Supreme Court ruled in Carpenter v. United States that the government violates the Fourth Amendment by accessing historical records containing the physical locations of cellphones without a search warrant.\nSee also\n* Carpenter v. United States\n* Cellphone surveillance\n* Geofence warrant\n* Geolocation\n* GLONASS Russian \"Global Navigation Satellite System\"\n* Google Latitude\n* GPS phone\n* Indoor positioning\n* Information privacy\n* IMEI number\n* Local positioning system\n* Mass surveillance\n* Mobile dating\n* Mobile device forensics\n* Mobile identification number\n* Mobile security\n* Positioning technology\n* Phone surveillance\n* Radio resource location services protocol\n* Real-time locating system\n* Riley v. California\n* Satellite navigation\n* Secure telephone\n* Triggerfish (surveillance)\n* United States v. Jones (2012)\n* United States v. Karo\n* Vehicle tracking system\nReferences\nExternal links\n*\n*"
    }
  ]
}