{
  "content": [
    {
      "type": "text",
      "text": "# Mobile Ops: The One Year War\n\n| engine =\n| released =\n| genre = Mecha simulationThird-person shooterFirst-person shooter\n| modes = Single-player, multiplayer\n| platforms = Xbox 360\n}}\nis a third/first-person shooter (different from the PlayStation 3 title Mobile Suit Gundam: Crossfire) for the Xbox 360 that is based on the anime series Gundam. The game features combat in mobile suits, on foot and in vehicles (much like Battlefield series of games.), as well as online play. As the title suggests, the game is set during the One Year War and would feature many of the iconic mecha from that era. Mobile Ops was also planned to be released in North America, but as the game was never released, and there has been no official word from Namco Bandai Games on the subject since the initial announcement, it is assumed that these plans were quietly cancelled.\nMobile Ops: The One Year War is the first game in the series to receive a \"C (ages 15 and up)\" rating by the CERO.\nPlot\nThe game is set during the One Year War, a global conflict fought between the Earth Federation and the Principality of Zeon. In the single-player campaign, which serves as a tutorial for the multiplayer mode, the player controls a nameless soldier of either the Earth Federation Forces or the Principality of Zeon military over the course of five missions. The game's story is entirely told through text-based mission briefings.\nIn the Federation campaign, the player character defends a Southeast Asian city during Zeon's Third Earth Landing Operation, captures a Zeon mining base in the Taklamakan Desert, participates in Operation Odessa and the defense of Jaburo, and finally participates in the recapture of California Base.\nIn the Zeon campaign, the player character mops up California Base's infantry defenders during the Second Earth Landing Operation, attacks California Base's survivors at Great Canyon, destroys an Earth Federation mobile suit testing facility in South East Asia, retreats from Odessa, and participates in the attack on Jaburo.\nNotes\nExternal links\n*[http://www.operation-troy.com/ Namco Bandai website]\n*[https://web.archive.org/web/20090126094946/http://dreamexe.co.kr/Games/TROY/Troy.aspx Dream Execution Technology site]\n*[https://web.archive.org/web/20081216113338/http://www.dimps.co.jp/pro/go_troy.html Dimps site]\n*[https://archive.today/20130218133355/http://watch.impress.co.jp/game/docs/20080328/troy.htm Website with Screenshots and Game information.]"
    }
  ]
}