{
  "content": [
    {
      "type": "text",
      "text": "# Mobile social software\n\nMobile social software is a class of mobile applications which scope is to support social interaction among interconnected mobile users. Its basic idea is to overlay a location and time element to the idea of digital networking. It enables users to find one another, in a particular vicinity and time, for social or business networking.\nSocial software and groupware: CSCL and CSCW\nThe term itself has its roots in social software and Groupware, computer applications designed for the desktop environment and aiming at facilitating various forms of social interaction, with the former being oriented to Internet-based informal exchanges, daily tasks and entertainment and the latter focusing on collaborative work (CSCW) or learning (CSCL) within a well defined group. Two typical groups that would benefit from these applications are  or school classmates. While the term social software, introduced by Clay Shirky in recent years, has gained much popularity, Groupware is not anymore a trendy word, even if it has a strong tradition that goes back to the Eighties. Scientific research on Computer Supported Cooperative Work and Computer Supported Collaborative Learning (CSCL) provides results which are still valid in the mobile environment. However, three important differences between desktop and mobile environments should be taken into account when conducting research on mobile social software: firstly, the physical context of use moves from static desktop setting, where the user is typically sitting in front of his computer, to the more dynamic mobile context, which presents higher constraints to human attention, but also provides an opportunity for information or communication at any time and anywhere. Secondly, the social context becomes wider, shifting from the group to the network concept. Rather than relying on static and known membership criteria, where group members usually know each other, social network ties change often and are not as dense as in traditional groups. Therefore, network boundaries cannot be easily identified. A mobile social network is the social space determined by an MSS application. Finally, an important distinction concerns the ultimate goal of MSS applications, designed for usage in everyday life situations, including not only tools for communication, but also for coordination and knowledge sharing. From this perspective, mobile social software is more similar to social software than Groupware applications, which aimed at increasing productivity and teamwork at work or at school.\nTechnical perspective\nFrom a technical point of view, MSS applications are very connected to the concept of Mobile Internet and the emphasis is more on data sharing than mere communication. Thus, only mobile phones with computational power, or Smartphones, can host this kind of applications. However, as there is not a universal definition of mobile social software yet, many people consider phone calls and text messages to be mobile social software, as they support social interaction on the move. In any case, the former perspective encounters wider consensus than the latter. The development of MSS applications is rapid and already evolved from mobile extensions of Internet social networking sites to powerful software, providing novel opportunities for social interaction, especially when used for proximity interactions based on Bluetooth scanning and connectivity. The availability of GPS systems and the integration of maps in mobile devices offer great opportunities not only in the context of individual activities, such as \"search\", but especially in the social context.\nAs empowering social platform\nIn one of the few critical studies on mobile social software, Thom-Santelli (2007) argued that the real potential of MSS was constrained by its limited conceptualization, and consequently implementation, as an urban entertainment gadget. Building on her argument, Lugano (2010) re-conceptualized mobile social software as a general-purpose social platform for grassroots social change and proposed a holistic design model for empowering self-organizing digital communities to co-create, share and use community-generated services (CGS). By complementing public and commercial services, digital communities through CGS contribute to build resilience in people's lives and global information societies.\nIssues\nBeing highly personalized and contextualized, privacy issues represent one of bigger obstacles to the wide adoption of mobile social software.\nSee also\n* Geolocation\n* Groupware\n* Social networking\n* Social Software\n* Toothing\nReferences\n*\n*\n*\n* Lugano, G. (2010) [https://jyx.jyu.fi/dspace/bitstream/handle/123456789/24577/9789513939281.pdf?sequence=1 Digital community design: exploring the role of mobile social software in the process of digital convergence]. Doctoral thesis. Jyv채skyl채 Studies in Computing 114. University of Jyv채skyl채.\n* Lugano, G.(2007) [http://www.echallenges.org/e2007/default.asp?page=schedule-print&schedule.id=113&schedule.expanded=yes Mobile Social Software: Definition, Scope and Applications], EU/IST eChallenges Conference, The Hague (The Netherlands)\n*\n*\n*"
    }
  ]
}