{
  "content": [
    {
      "type": "text",
      "text": "# Moca, Dominican Republic\n\n| subdivision_type                = Country\n| subdivision_name                =\n| subdivision_type1               = Province\n| subdivision_name1               = Espaillat\n| established_title               = Founded\n| established_date                =\n| established_title2              = Municipality since\n| established_date2               = 1822\n| area_total_km2                  = 251\n| area_footnotes                  =\n| elevation_m                     = 183\n| elevation_footnotes             =\n| population_total                = 164,022\n| population_as_of                = 2022 census\n| total_type                      = Total\n| population_density_km2          = auto\n| population_blank1_title         = Demonym\n| population_blank1               = Mocano(a)\n| population_footnotes            =\n| blank_name                      = Distance to&nbsp;– Santo Domingo\n| blank_info                      = 145 km\n| blank1_name                     = Municipalities\n| blank1_info                     = 8\n| blank2_name                     = Climate\n| blank2_info                     = Af\n| website                         = http://am.gob.do/\n| official_name                   =\n}}\nMoca is the capital of Espaillat province in the Cibao region of the Dominican Republic, and is the tenth-largest city of the country with a population of 164,022 inhabitants. Moca is located 11 miles/18 kilometers east from the country’s second-largest city, Santiago. It is divided into eight municipal districts: San Víctor, Las Lagunas, José Contreras, Juan López, El Higuerito, La Ortega, Monte de la Jagua and Canca La Reina.\nThe city is known as \"La Villa Heroica\" (Village of Heroes) due to the number of men and women from Moca who have played a major role in the Dominican Republic's history in bringing down two dictators, Ulises Heureaux and Rafael Trujillo, and bringing democracy back to the country.\nMoca is home to the Corazon Sagrado de Jesus (\"Sacred Heart of Jesus\") Cathedral. All its pane glass windows were originally brought from Italy depicting the apostles and Jesus' path to the crucifixion. Agriculture forms the primary livelihood of the inhabitants.  Plantain and yucca are main crops. Most crops are harvested by hand.\nHistory\nAt the time of its colonization by the Spanish, what is now Moca was part of the chiefdom of Maguá. Moca was founded in 1780. In 1845, Moca is designated common of the department of La Vega, then in its political division it becomes the head municipality of the Espaillat province.\nEconomy\nMoca has a very important banking sector, the city is home to branches of all commercial banks of the country. A strong business in shops, furniture, supermarkets, warehouses, factories of footwear, food, construction, and hardware.\nThe city has the largest coffee manufacturing industry, Industries Banilejas. The city is also known for its agricultural production, with the plantain, banana and cassava as major crops. Other fruits produced include: bananas, pigeon pea, taro, yams, squash, beans, coffee, oranges, lemons, grapefruit, papaya (papaya), etc. A variety of vegetables such as lettuce, tomatoes, eggplants, peppers, cabbage are cultivated, among others. It also has a great development in poultry products, with a production of 70% in this sector.\nChurch of Moca\nFile:Church_of_Moca,_Dominican_Republic.jpg\nFile:Moca,_Dominican_Republic_church.jpg\nFile:Moca_Dominican_Republic_church.jpg\nFile:Protestas dominicanas en Moca 2020.jpg\nGeography\nMoca has a total area of 339.21 km². The municipality sits on a volcanic coral reef with hills to the west and low mountains to the north; these mountains are part of the Cordillera Septentrional. The highest mountain in the municipality, and in the province, is El Mogote at  (971 m). Moca is at an elevation of 183 m with an average temperature in the city of 27,5&nbsp;°C in 2023 and an average rainfall of 189,1&nbsp;mm in 2023.\nSubdivisions\n{| class=\"wikitable sortable\"\n!Division\n!Status\n!Population (2022)\n}}\nNotable people\n*Trina de Moya (1863–1943) – poet and First Lady of the Dominican Republic (1899, 1902–1903, 1924–1930)\n*Freddy Peralta, Milwaukee Brewers starting pitcher\nSports\n*Estadio Bragaña Garcia, baseball stadium\nReferences\nExternal links\n*[http://ayuntamientomoca.gob.do/ ayuntamientomoca.gob.do]"
    }
  ]
}