{
  "content": [
    {
      "type": "text",
      "text": "# Mockingbird Lane\n\n| based_on           =\n| developer          =\n| writer             = Bryan Fuller\n| director           = Bryan Singer\n| starring           =\n| composer           = Jim Dooley\n| country            = United States\n| language           = English\n| num_seasons        =\n| num_episodes       =\n| list_episodes      =\n| executive_producer =\n| producer           = Jason Taylor\n| editor             = Stuart Bass\n| location           =\n| cinematography     = Guillermo Navarro\n| camera             = Single-camera\n| runtime            = 39 minutes\n| company            =\n| channel            = NBC\n| released           =\n| related            =\n}}\nMockingbird Lane is a 2012 American horror comedy television special that served as a re-imagining of the 1964–66 television series The Munsters. It was developed for NBC by Bryan Fuller. The pilot episode aired on October 26, 2012, as a Halloween special, and lead into a Halloween-themed episode of the television series Grimm, with the option for a series order. The special was viewed by 5.47 million American viewers and gained a 1.5/5 ratings share for adults aged 18–49, and the concept was not picked up by NBC as a series.\nPlot\nThe Munsters are a family of monster-like beings. Herman resembles Frankenstein's Monster, with visible scars and a heart that is the only remaining part of his original body; his wife Lily is a vampire, as is her father who is known as Grandpa; their son Eddie is unaware that he is a transitioning werewolf; and finally there is Lily's niece Marilyn, the only normal member of the family, whose mother tried to eat her when she was a baby.\nThe Munsters move to 1313 Mockingbird Lane after Eddie attacks his \"Wildlife Explorers\" scout troop in werewolf form. Eddie thinks that the event was a bear attack. Grandpa and Marilyn both want to tell him of his true nature, but Herman and Lily want to wait. Eddie thinks there is something wrong with himself and fears being a carnivorous monster like his grandfather and mother.\nMeanwhile, Herman's heart is dying because he loves too hard and needs a replacement. Grandpa plans to kill someone to provide a heart for Herman and a feast of blood for Grandpa. He first plans to kill their new neighbor, but Herman talks him out of it. Then the perfect candidate shows up, Scoutmaster Steve, a widower and Eddie's new boy scout troop leader; Steve has fallen for Lily and loves her just as Herman does.\nGrandpa invites Steve over to dinner to kill him. Despite the efforts of Herman, Lily, and Marilyn to prevent the killing, Steve dies when Grandpa causes him to fall down the stairs. Herman and Lily finally tell Eddie about his condition, which he nervously accepts. They acquire a pet dragon, Spot, to watch over Eddie during his transformations.\nCast\nMain cast\n* Jerry O'Connell as Herman Munster, a man made from parts of other people. Unlike Herman in the original series, Herman looks human except for some very obvious scars. He is very intelligent but has a sensitive heart. He loves his family, and to a lesser extent his father-in-law. His heart, the last remaining part from his original body, is dying because he \"loves too hard\".\n* Portia de Rossi as Lily Munster (née Dracula) the elegant matriarch of the Munster family and a vampire. Unlike her father, Lily tries not to attack or manipulate humans. She loves her family very much and only wants them safe.\n* Charity Wakefield as Marilyn Munster, Lily's niece, is a normal human and has no monster-like attributes. She is considered the oddball of the family because she looks and acts normal. Her mother tried to eat her, but Grandpa talked her out of it.\n* Mason Cook as Eddie Munster, an apparently normal adolescent boy who does not initially know that he is a werewolf. When Herman and Lily are forced to break this news to him, they obtain for him a pet dragon to watch over him during his transformations.\n* Eddie Izzard as Grandpa, Lily's father, also a vampire.  He likes to act like he is the head of the family. He enjoys making wisecracks at Herman's expense. This version of Grandpa is much darker than the character in the original series, exhibiting predatory behavior and a fondness for murder and mind control.\nGuest cast\n* Cheyenne Jackson as Scoutmaster Steve, a widower and leader of Eddie's scout troop who becomes smitten with Lily. Grandpa plots to kill him so he can feed off his blood and replace Herman's heart; despite Herman's clear protests. Grandpa gets his way when Steve dies in an accident.\n* Beth Grant as Marianne Marie Beetle, the paraplegic busybody neighbor who takes a very keen interest in the strange new family next door. This character previously appeared in episodes of Wonderfalls and Pushing Daisies.\n* Guy Perry as Werewolf\n* John Kassir as Tim, Marie's husband\nProduction\nDevelopment\nNBC confirmed ordering the pilot episode in November 2011 and announced in January 2012 that it would be called Mockingbird Lane, a reference to the Munster family address at 1313 Mockingbird Lane. The costumes and make-up for the characters were heavily toned down to have them more closely resemble humans.\nCasting\nOn March 20, 2012, former The Riches star Eddie Izzard was announced by NBC as \"Grandpa\", the first of the prospective series' main roles to be cast. British actress Charity Wakefield joined the cast, playing Marilyn Munster, Lily's niece, and Spy Kids: All the Time in the World actor Mason Cook joined as Eddie Munster. On June 4, 2012, it was announced that Jerry O'Connell had been cast as family patriarch Herman Munster who series writer-producer Bryan Fuller describes as \"essentially a zombie in a constant state of decay.\" On June 5, it was announced that Mariana Klaveno had been cast to play his wife Lily, contingent on her being released from her contract on Devious Maids. However, on June 12, 2012, it was announced that Portia de Rossi would play the role.\nBroadcast and reception\nOn October 11, 2012, it was announced that the Mockingbird Lane pilot would air on October 26 as a special lead-in to a Halloween-themed episode of Grimm, with the option of a series order should it do well in the ratings. Two months after the premiere, NBC officially passed on the series.\nNBC chief Robert Greenblatt said of their decision to pass on the series: \"We just decided that it didn't hold together well enough to yield a series. It looked beautiful and original and creative, but it just all ultimately didn't come together... it just didn't ultimately creatively all work. We felt great about that cast, but we tried to make it not just a sitcom. We tried to make it an hour, which ultimately has more dramatic weight than a half-hour. It's hard to calibrate how much weirdness vs. supernatural vs. family story. I just think we didn’t get the mix right\".\nSee also\n* Here Come the Munsters, a 1995 television film based on the characters from the original The Munsters\nReferences\nExternal links\n*\n*"
    }
  ]
}