{
  "content": [
    {
      "type": "text",
      "text": "# Mockingbird (Inez & Charlie Foxx song)\n\n\"Mockingbird\" is a 1963 song written and recorded by Inez and Charlie Foxx, based on the lullaby \"Hush, Little Baby\".\nBackground\nThe original single was credited to Inez Foxx with vocal accompaniment by her brother Charlie, as they alternated the lyric on a syllabic basis. Considered something of a novelty song, it was a great success for them upon its release by Sue Records (Symbol Records), reaching number 2 on the U.S. Top Black Singles / Rhythm & Blues chart and number 7 on the U.S. popular music singles chart in late summer 1963. Chris Blackwell of Island Records company heard \"Mockingbird\" playing in a record store in Kingston, Jamaica and flew to New York City to negotiate the track's U.K. release; resultantly Island Records leased the Sue brand for UK distribution to vend the American company's output in the U.K., beginning with \"Mockingbird\" in December 1963. However \"Mockingbird\" would not become a U.K. success until its 1969 re-issue when it scored No. 33.\nThe song was covered by Dusty Springfield for her album A Girl Called Dusty (1964); Springfield sang both parts of the track. \"Mockingbird\" was also recorded by Aretha Franklin for her album ''Runnin' Out of Fools (1965); Franklin performed the song (with Ray Johnson providing the counter-vocal) on the March 10, 1965, episode of the TV program Shindig!''. Franklin's version of \"Mockingbird\" was one of several tracks to which Columbia Records company gave a single release after the singer's commercial success with Atlantic Records in 1967; released at the same time as Franklin's Atlantic single album \"Chain of Fools\"—which would reach #2—Franklin's version of \"Mockingbird\" scored two weeks at No. 94 on the  Billboard Hot 100 in December 1967.\nCarly Simon and James Taylor version\n}}\nAmerican singer-songwriters and then husband-and-wife duo Carly Simon and James Taylor recorded a remake of \"Mockingbird\" in the autumn of 1973, and the track was released as the lead single from Simon's fourth studio album Hotcakes (1974). It was Taylor's idea to remake \"Mockingbird\", which he knew from a live performance by Inez and Charlie Foxx at the Apollo Theater in 1965, and which song Taylor and his sister Kate Taylor had often sung for fun as teenagers. The song features a considerable lyrical adjustment by Taylor and keyboard work from Dr. John, Robbie Robertson's rhythm guitar and a tenor saxophone solo by Michael Brecker.\nSimon overcame her fear of live performing to come onstage to sing \"Mockingbird\" with Taylor during his 1975 tour; the duo also performed \"Mockingbird\" live at the No Nukes Concert at Madison Square Garden in September 1979, the performance being recorded for the double LP album No Nukes: The Muse Concerts for a Non-Nuclear Future (1979) and the film version No Nukes (1980). In recent years Taylor has performed \"Mockingbird\" live with his daughter (by Simon) Sally Taylor and Simon has performed the song live with her and Taylor's son Ben Taylor. On November 25, 2015, Simon sang a live duet of \"Mockingbird\" with Stephen Colbert on \"The Late Show with Stephen Colbert\".\nReception\n\"Mockingbird\" became an instant hit, peaking at No. 5 on the Billboard Pop singles chart and No. 10 on the Billboard Adult Contemporary chart, and was certified Gold by the RIAA, signifying sales of one million copies in the US. The single also charted in Canada (No. 3), New Zealand (No. 7), Australia (No. 8), South Africa (No. 13), and the UK (No. 34).\nCash Box called it a \"great re-working of this big 60’s hit,\" saying that \"the fresh approach is keyed by a beautiful vocal interchange between the couple and a great dixieland horn arrangement.\" Record World said that \"They just don't make tunes as funky as this anymore!\"\nTrack listing\n;7\" single\n* \"Mockingbird\" – 3:45\n* \"Grownup\" – 3:44\nChart history\nWeekly charts\n{|class=\"wikitable sortable\"\n|-\n! Chart (1974)\n! Peakposition\n|-\n| Australia KMR\n| style=\"text-align:center;\"| 8\n|-\n| Canadian RPM Top Singles\n| style=\"text-align:center;\"| 3\n|-\n| New Zealand (Listener)\n| style=\"text-align:center;\"| 6\n|-\n|Quebec (ADISQ)\n|align=\"center\"|12\n|-\n| South Africa (Springbok Radio)\n| align=\"center\"| 13\n|-\n| UK Singles Chart\n| style=\"text-align:center;\"| 34\n|-\n| US Billboard Pop Singles (Hot 100)\n| style=\"text-align:center;\"| 5\n|-\n| US Billboard Adult Contemporary Tracks\n| style=\"text-align:center;\"| 10\n|-\n| US Cash Box Top 100\n| style=\"text-align:center;\"| 3\n|}\nYear-end charts\n{| class=\"wikitable sortable\"\n|-\n! align=\"left\"| Chart (1974)\n! style=\"text-align:center;\"| Rank\n|-\n| Australia\n| style=\"text-align:center;\"| 89\n|-\n| Canada\n| style=\"text-align:center;\"|49\n|-\n| US Billboard Hot 100\n| style=\"text-align:center;\"|52\n|-\n| US Cash Box Top 100\n| style=\"text-align:center;\"|39\n|}\nCertifications\nAustralia:  Johnny O'Keefe\nIn Australia, the Simon/Taylor version of \"Mockingbird\" charted simultaneously with another version – this one featuring the original lyrics – by Johnny O'Keefe sung with his resident background vocalist Margaret McLaren; the two versions were ranked in tandem on the charts, peaking at No. 8 for four weeks beginning in May 1974. O'Keefe, who had performed \"Mockingbird\" in 1964 as compere of the Sing Sing Sing musical show, had recorded the track with McLaren in October 1972, the track having a single release in 1973 and appearing on the local \"hit parade\" in Adelaide that November around the time the Simon/Taylor version was recorded; O'Keefe, who believed that the Simon/Taylor version was effectively a cover version resulting from Festival Records company selling the O'Keefe version to American record companies, lobbied the Minister for Media and the Broadcasting Control Board to have his version of \"Mockingbird\" receive at least equal broadcasting time with the Simon/Taylor version on Australian radio.\nIn the Australian stage musical Shout! based on Johnny O'Keefe's life, the characters of O'Keefe and of his mother Thelma perform \"Mockingbird\" as part of a sequence dramatizing O'Keefe's 1975 This is Your Life appearance. The musical opened January 4, 2001, with David Campbell and Trisha Noble as respectively Johnny and Thelma; Campbell and Noble recorded their version of \"Mockingbird\" for the Shout! soundtrack album released that March.\nOther versions\n| recorded   = 1982\n| studio     =\n| genre      = Synth-pop\n| length     = 3:23\n| label      = Stiff\n| writer     = Inez and Charlie Foxx\n| producer   = Peter Collins\n| chronology = The Belle Stars\n| prev_title = The Clapping Song\n| prev_year  = 1982\n| next_title = Sign of the Times\n| next_year  = 1983\n}}\nThe Belle Stars did a cover version of the song \"Mockingbird\" in 1982. It was released as their third and final cover. It peaked at No. 51 in the charts, although the single after it, \"Sign of the Times\", peaked at No. 3. It was the third single from the band's album The Belle Stars.\n| chronology = Toby Keith\n| prev_title = Stays in Mexico\n| prev_year  = 2004\n| next_title = Honkytonk U\n| next_year  = 2005\n| misc       =\n}}\nJanette Anne Dimech, known professionally as Jeanette, is a British-born Spanish singer. She began her musical career as a teenager as the lead singer of Pic-Nic, a Californian-style folk-pop band that topped the Spanish charts for several weeks in 1967 with their debut single \"Cállate niña\". This is a song very similar to 'Hush Little Baby'\nTaj Mahal's soulful version on his album Dancing the Blues (1993) features a duet with Etta James.\nLloyd and Harry sing an a cappella version in the 1994 film Dumb And Dumber.\nToby Keith reached No. 27 on Hot Country Songs in 2004 with a cover featuring his daughter, Krystal Keith. It appears on Keith's album Greatest Hits 2.\nIn 2007, Eddie Money remade \"Mockingbird\" for his album of classic Soul covers Wanna Go Back; he was partnered by his daughter Jesse Money.\nOn the television series Blossom, Melissa Manchester and Joey Lawrence — playing mother and son – duet on \"Mockingbird\" after a solo by Manchester on \"Hush Little Baby\".\n\"Mockingbird\" is also performed by characters in the television series Will & Grace and in the comedy films ''National Lampoon's Vacation (1983).\nAmerican rapper Eminem also used the lullaby \"Hush Little Baby\" in the lyrics of his single \"Mockingbird\" from his album Encore (2004).\nIn The Simpsons'' episode \"Three Gays of the Condo\" (2003), Marge and Homer sing the opening from the Taylor/Simon version of the song after Marge finds a puzzle piece that has Taylor's face that is part of a jigsaw puzzle that the Simpsons put together. The same version is again parodied in the 2013 episode \"Treehouse of Horror XXIV\" by Selma who now has a duet partner in Bart's disembodied head being sewn to her body.\nBritish singer Dusty Springfield performed the song as a duet with Jimi Hendrix on a 1968 episode of her ITV variety show, It Must Be Dusty. No high quality versions appear to have survived to present day, but a viewer's film of the performance has surfaced online.\nIn the Close Enough episode \"The Canine Guy\", Josh sings the Taylor/Simon opening of the song with Dogboy.\nReferences\nExternal links\n*, official audio (no music video)\n*, official audio (no music video)"
    }
  ]
}