{
  "content": [
    {
      "type": "text",
      "text": "# Mocking of Jesus\n\nby Matthias Grünewald, c. 1505]]\nThe mocking of Jesus occurred several times, after his trial and before his crucifixion according to the canonical gospels of the New Testament. It is considered part of the passion of Jesus.\nAccording to the gospel narratives, Jesus had predicted that he would be mocked (Matthew 20:19, Mark 10:34, and Luke 18:32). The mocking of Christ took place in three stages: immediately following his trial, immediately following his condemnation by Pontius Pilate, and when he was being crucified.\nThe New Testament narratives of Jesus being mocked are filled with irony, while the mockery focuses on the prophetic and kingly roles of Jesus.\nFirst stage\n, Mocking of Christ'', c. 1617]]\nAfter the condemnation of Jesus by the Sanhedrin, some spat on him (Mark 14:65). He was blindfolded and beaten, and then mocked: \"Prophesy! Who hit you?\" (Luke 22:63). This was done by those men who \"held Jesus\" (Luke 22:63, King James Version). The New International Version translates this as \"the men who were guarding Jesus\", but Joel B. Green takes the phrase to refer to the \"Chief priests, the officers of the temple police, and the elders\" mentioned in verse 52.\nGreen suggests that Jesus suffers the mockery that is typical of prophets, and that his suffering suggests his \"solidarity with God's agents who speak on God's behalf and are rejected.\" Susan R. Garrett sees Mark's inclusion of the mockery as an example of irony, since Jesus is indeed a prophet, at the very moment his prophecy that Peter would deny him was being fulfilled. The prophetic assignment is not always portrayed as positive in the Bible, and prophets were often the target of persecution and opposition.\nSecond stage\n, Jesus Mocked by the Soldiers, c. 1865]]\nAfter his condemnation by Pontius Pilate, Jesus was flogged and mocked by Roman soldiers. They clothed him with a \"purple\" () or \"scarlet\" () robe symbolizing a royal gown since purple was a royal color, put a crown of thorns on his head symbolizing a royal crown, and put a staff in his hand symbolizing a scepter. They knelt before him and said, \"Hail, king of the Jews!\" (). This was done as a mockery of Jesus's kingship. After this, they spat on him, and struck him on the head with the staff repeatedly.\nPeter Leithart notes that at the end of the scene, the soldiers \"reverse the whole coronation with an anti-coronation.  They spit in contempt instead of kneeling in reverence, pull the scepter from Jesus's hand and beat His crowned head with it, strip off the scarlet robe and replace it with Jesus's own robe.\" Leithart goes on to suggest that, at this point, the Romans \"remove the veil of irony and reveal what they really think\" about the Jews and their God.\nRobert J. Miller suggests that the gospel account is deeply ironic since Jesus is exercising his kingship through submission and suffering: \"the Roman legionnaires have unwittingly furthered God's secret purposes by dressing Jesus up as a king.\" In fact, the irony operates on two levels. James L. Resseguie points out that there is verbal irony in the way the soldiers \"mock Jesus as a dismal failure and a pretend king\" (that is, the soldiers are themselves being ironic) as well as dramatic irony in that the readers \"know that the acclamation rings true in ways that the soldiers could not possibly understand.\"\nLuke 23:11 also mentions that \"Herod and his soldiers ridiculed and mocked him\" (New Revised Standard Version).\nThird stage\n, The Mocking of Christ, c. 1629]]\nJesus was also mocked while he was on the cross. According to Mark 15:29–30, this was done by those who passed by and hurled insults at him and told him to come down from the cross.  Mark 15:31–32 points out that \"the chief priests and the teachers of the law\" also mocked him among themselves, saying: \"He saved others, but he can’t save himself! Let this Messiah, this king of Israel, come down now from the cross, that we may see and believe.\" Finally, those crucified with Jesus also heaped insults at him (Mark 15:32).\nLuke 23:36–37 mentions mocking by Roman soldiers: \"The soldiers also mocked him, coming up and offering him sour wine, and saying, 'If you are the King of the Jews, save yourself!'\" (New Revised Standard Version). In Matthew 27:42 people, priest and the elders mock Jesus, and shout at him while he is hanging on the cross: \"He saved others; let Him save Himself if He is the Christ, the chosen of God.\"\nAccording to Luke 23:39, one criminal on his left who hung there together with Jesus on the cross, hurled insults at Jesus: \"Aren't you the Messiah? Save yourself and us!\"\nThus, whereas the first stage involves mockery by Jews, and the second stage mockery by gentiles, the third stage has both together. Leithart notes that at this point \"Jews and Gentiles, governors and criminals, scribes and commoners, all humanity joins in a single chorus of blasphemy.\"\nTimothy C. Gray notes that in the Gospel of Mark, the mocking of Jesus on the cross \"takes up the two charges leveled against Jesus at his trial\": firstly, that Jesus \"threatened the temple with destruction\" (14:58 and 15:29); secondly, that Jesus \"claimed to be the Messiah\" (14:61–62 and 15:31–32).\nTheological significance\n, Ecce Homo, 1650|thumb|180px]]\nPeter Leithart argues that in the person of Jesus, God himself was mocked. He suggests that \"for Matthew, the cross is mainly about man’s mockery of God,\" and notes that while Paul says in Galatians 6:7 that \"God is not mocked\", this is precisely because God has been mocked.\nMany Christians see the suffering of Jesus as being redemptive. Francis Foulkes argues that the emphasis in the New Testament is on Jesus's suffering and death being \"for us\". In this way, some Christians see the mockery that Jesus endured as being borne on their behalf. For example, Philip Bliss wrote in his hymn, \"Hallelujah! What a Savior\":\nBearing shame and scoffing rude,\nIn my place condemned He stood;\nSealed my pardon with His blood.\nHallelujah! What a Savior!\nThe mockery of Jesus is also seen by many Christians in the servant songs,  such as in Isaiah 50:6  where\nI gave my back to those who strike,\nand my cheeks to those who pull out the beard;\nI hid not my face  from disgrace and spitting.\nWhich is in remarkable contrast with the forward looking following verse, Isaiah 50:7\nBecause the Sovereign Lord helps me,\nI will not be disgraced.\nTherefore have I set my face like flint,\nand I know I will not be put to shame.\nThe scene when Jesus was mocked while he was on the cross, is also a manifestation of the mercy of God through Jesus, who himself is mocked, humiliated and in pain. Two men were crucified at the same time as Jesus, one on his right hand and one on his left (, , , ), which Mark interprets as fulfillment of the prophecy of Isaiah . According to Matthew and Mark, respectively, both of the \"thieves\" mocked Jesus (, ); Luke however, mentions that:\n39 Now one of the criminals hanging there reviled Jesus, saying, \"Are you not the Messiah? Save yourself and us.\"\n40 The other, however, rebuking him, said in reply, \"Have you no fear of God, for you are subject to the same condemnation?\n41 And indeed, we have been condemned justly, for the sentence we received corresponds to our crimes, but this man has done nothing criminal.\"\n42 Then he said, \"Jesus, remember me when you come into your kingdom.\"\n43 He replied to him, \"Amen I say to you today you will be with me in Paradise.\"\nJesus promised to this thief that he will be with him in the Paradise, right in front of those who were mocking him. God saves through Jesus, because God is full of mercy, a mercy revealed through Jesus Christ, who says to a thief: \"Today you will be with me in Paradise.\"\nSee also\n*Flagellation of Christ\n*Crown of thorns\n*Ecce homo\nReferences\nBibliography\n*\n*\nExternal links\n*"
    }
  ]
}