{
  "content": [
    {
      "type": "text",
      "text": "# Modi'in (ancient city)\n\n, one of several proposed sites for the ancient city of Modi'in]]\nModi’in (, Mōdīʿīn; also transliterated as Modein), also Modi’im (, Mōdīʿīm), and later, Moditha (), was an ancient Jewish city located in Judea, near the modern city of Modi'in, Israel. First mentioned in the Books of Maccabees, it was the hometown of the priestly Hasmonean family, who assumed leadership over Judea following the victorious Maccabean uprising.\nModi’in was known in ancient times for housing the mausoleum of the Hasmonean family, commonly referred to as the Tomb of the Maccabees. This monumental structure, erected in the 2nd century BC by Simon Thassi, is described in both the Book of Maccabees and the writings of Josephus. During the Byzantine period, Eusebius noted its continued existence. However, its remains were lost over time.\nThe precise geographical location of Modi’in remains a subject of scholarly dispute, with various proposed sites including Tell er-Ras near al-Midya, Givat HaTitora, Umm el-Umdan, and Khirbet Midya, all located in the vicinity of the modern city of Modi'in-Maccabim-Re'ut, which takes its name from the ancient city. The remnants of the Hasmonean mausoleum, once linked to several sites now attributed to the Byzantine era, remain undiscovered, and its precise location still unknown.\nAncient sources\nBooks of Maccabees (2nd century BC)\nrefuses to sacrifice to the idols, Gustave Popelin (1882)]]\nThe first reference to Modi'in is found in the text of 1 Maccabees, a book likely written by a court historian during the reign of the Hasmonean ruler John Hyrcanus (134&ndash;104 BC).  It records the relocation of Mattathias the Hasmonean, along with his family, from Jerusalem to Modi'in around ~168–167 BC:\n}}\nLater in the book's narrative detail the construction by Simon, Matthatias's son, of an elaborate monument built atop an existing family burial site in Modi'in:\n}}\nAccording to 1 Maccabees, Simon designated the monument for the interment of his father, mother and four brothers. The monument's description mentioned elaborate architectural features, including pyramids (or nefashot, signifying sepulchral monuments typically situated near or above underground tombs), sculptured armaments or panoplies representing military weaponry, and maritime representations, all adhering to Hellenistic aesthetic norms. The book states that the monument still stood in its day.\nMaximillian Kon's reconstruction suggests that the tomb was a rectangular structure built with ashlars, serving as a base for a second story consisting of seven towers surrounded by pilasters and crowned with pyramidal or conical tops. Similar architectural features are found in other monumental tombs across the Levant, such as the Tomb of Hamrath in As-Suwayda, Syria, and tombs in Hermel and Qalaat Faqra, Lebanon.\nA later passage describes Hasmonean forces late in Simon's reign gathering in Modi'in before descending to the coastal plain for a battle against a Seleucid army:\n}}\nThe town is briefly mentioned in 2 Maccabees 13, but the reference is not considered very reliable. 2 Maccabees, an independent work separate from 1 Maccabees, was probably written by an Egyptian Jew who does not appear to be very familiar with the geography of Judea due to a number of geographic blunders and implausibilities. According to it, during a campaign by regent Lysias, the army of Judas Maccabeus camped near Modein, then attacked and defeated a Seleucid detachment. However, scholars such as Jonathan A. Goldstein suggest that the writer simply picked a town known for its role in the revolt. The chapter seems to be loosely describing a second campaign from Lysias where 1 Maccabees reports Lysias approached Jerusalem from the southern route, yet Modein was to the north of Jerusalem; hence seeing the mention of Modein in this passage as unreliable or garbled.\nJosephus (1st century AD)\nThe historian Josephus's work Jewish Antiquities uses 1 Maccabees as a major source and often paraphrases it, but sometimes includes new information, presumably from lost sources such as Nicolaus of Damascus. Antiquities Book 13 provides an account of the Hasmonean royal monument that was apparently still extant during his time, although with some alterations and exclusions to the parallel passage in 1 Maccabees:}}\nRabbinic literature (early centuries AD)\nRabbinical literature describes Modiʽin (also Modiʽim or Modiʽith) as situated on the border between Lydda and western Judea.\n\"From Modiʽith and inwards men may be deemed trustworthy in what concerns earth-enware vessels; from Modi'ith and outwards they may not be deemed trustworthy. Thus, if the potter himself sold the pot and came in hither from Modi'ith, in what concerns himself the potter, the selfsame pots, and the selfsame buyers, he may be deemed trustworthy. If he went out [beyond Modi'ith] he may not be deemed trustworthy.\"\n\"What counts as a journey afar off Beyond Modi'ith, or a like distance in any direction. So R. Akiva.\"\n\"Ulla said, \"From Modiʽim to Jerusalem is fifteen [[Roman mile|[Roman] miles]].\"\nModiʽin may be the birthplace of the priest Rabbi Eleazar ha-Modaʽi, who appears to have been a prominent figure during the Bar-Kochba War. His leadership role is attested to in various sources such as the Mishnah, the Jerusalemite Talmud, and Lamentations Rabbah.\nPatristic literature (3rd to 5th centuries AD)\nDuring the Byzantine period, there are scarce texts mentioning Modiʽin. 4th century bishop and scholar Eusebius wrote:\"Modeeim (1 Maccabees 13:25): A village near Diospolis where the Maccabees were, and where their tombs are still now shown\".Jerome corroborates Eusebius's account and expresses surprise at claims that the Maccabees' tombstone is in Antioch. In the Vulgate (Latin translation of the Bible), Jerome added a geographical detail to the mention of Modiʽin: \"in monte Modin\" (\"on the mountain of Modiʽin\").\nMadaba Map (6th century)\nOn the Madaba map, commonly dated to the mid-6th century, Modiʽin appears situated on the border between the coastal plain and the Judaean Lowlands, along the route from Lod to Jerusalem, and between the towns of \"Adiathim, now [H]aditha\" and \"Capher-uta (Ke[f]ar Ruta)\". The town, labeled with the inscription \"Modiʽim (, Mōdeeim), now Moditha (), whence came the Maccabees\", is indicated with the customary symbol for a village on the map. The site is marked by two towers having a single entranceway.\nThere are no literary references to Modiʽin or Moditha after the Byzantine period.\nProposals to identify Modi'in\nAncient texts indicate that Modi'in was strategically located near a major road, positioned at a juncture between the predominantly Jewish-inhabited area and the coastal plain, then predominantly populated with non-Jews. The Hasmonean mausoleum built near Modi'in stood in a high spot, atop a hill. During the Second Temple Period, several Jewish villages were located in this area.\nScholars propose that the ancient name Modi'in is preserved on both sides of Wadi Malakeh, situated north of modern Modi'in-Maccabim-Re'ut, with the Arab village of al-Midya to the east and Khirbet Midieh to the west. Several archaeological sites in the area have been suggested as potential identifications for the ancient city.\nEarly suggestions\nThe Crusaders associated Hasmonean Modiʽin with different locations, including Tzoba/Belmont, near Latrun and near Hebron.\nIn the 14th century, the Jewish traveller and geographer Ishtori Haparchi wrote that Modi'in was situated in a village near Jerusalem called Midʽa, probably the modern al-Midya.\nIn the early 19th century, Rabbi Joseph Schwarz proposed that Modiʽin was situated at Mount Midan near Tzoba, drawing connections from the similarity of names and the fifteen-mile distance from Jerusalem mentioned in the Babylonian Talmud.\nIn 1866, Franciscan monk Emmanuel Forner wrote in Le Monde that Modiʽin was located in the Arab village of al-Midya. Forner theorized that this site housed the burial grounds of the Hasmonean family, citing phonetic resemblances in place names and the village's close proximity to Lod, reachable within a two-hour walk. In the summer of 1909, Yitzhak Ben-Zvi visited al-Midya, which he referred to as Modiʽim, as well as Qubur el-Yahud.\nTell er-Ras, Al-Midya\nEarly scholars, including Gustaf Dalman, Père Félix-Marie Abel, and Michael Avi-Yonah, along with subsequent experts, initially associated the name el-Midieh solely with the Arab village of the same name. This led them to identify the location of Modi'in either at Tel er-Ras, an archaeological tell located to the east of the village, or within the village itself.\nA survey conducted by Israel Finkelstein and his team at Tell er-Ras uncovered pottery dating back to the Iron Age and later periods. Zissu and Perry, describing Tell er-Ras as a \"large biblical site\", doubted the identification of the site with Modi'in, pointing to the absence of evidence for a significant settlement during the Hellenistic, Roman, and Byzantine periods, as well as the absence of a nearby Roman road mentioned in rabbinic texts.\nKhirbet el-Hammam (Khirbet Midiyeh)\n(1871–77)]]\nTo the west of al-Midya and Nahal Modi'in lies another archaeological site often linked to ancient Modi'in, commonly referred to as Khirbet el-Hammam but also mapped as Khirbet Midiyeh (distinct from Tell er-Ras, which is also occasionally referred to by the same name). In the 19th century, this area has drawn the attention of researchers like Victor Guérin and Charles Simon Clermont-Ganneau, who explored sites such as Sheikh el-Gharbawi and Qubur al-Yahud (\"Tombs of the Jews\"), uncovering quarries, winepresses, and numerous tombs. During his visit in 1870, Guérin engaged in conversations with village elders, who shared a local Arab tradition indicating that all remnants southwest of the stream—including Khirbet el-Hammam, Qubur al-Yahud, and Horbat HaGardi—were once part of a city known as El-Midya. Guérin identified ashlar-built structures, tesserae, cisterns, and what locals considered a bathhouse at el-Hammam, hence the name \"Khirbet el-Hammam\", Arabic for \"house of the bathhouse\". Through recent studies a realization emerged that these sites of Sheikh el-Gharbawi and Qubur al-Yahud were adjacent to the remains of an ancient settlement encompassing an area of 8 hectares.\nOn the slopes of Khirbet el Hammam, now dissected by the \"Patrol Road\" which follows an ancient road, there are layered remnants of ancient architecture concealed beneath debris, comprising hewn stones, architectural remnants, and cisterns. Adjacent to this, pottery from the Hellenistic, Roman, and Byzantine periods, along with tesserae, are scattered. In the forested northern section, remnants of hewn-stone structures are surrounded by Byzantine-era pottery shards, while the southern part, now a cultivated field, yields predominantly Iron Age II pottery sherds, with fewer from the Roman and Byzantine periods.\nIn 1995, a salvage excavation unveiled a Jewish rock-cut burial complex containing kokhim tombs and ossuaries inscribed with names in the square Hebrew and Greek scripts, dating from the late Second Temple Period to the Bar-Kochba war era. Another survey in 2000 revealed pottery sherds spanning various periods. In 2005, a survey uncovered rock-cut tombs, including kokhim-type tombs, shaft tombs, and tomb chambers, dating from the 2nd century BC to the early centuries CE.A salvage excavation led by Dalit Weinblatt and conducted in 1996-1997 at the center of the site, revealed signs of settlement activity tracing back to the Iron Age, with evidence of successive layers of occupation spanning the Hellenistic, Roman, Byzantine, and early Arab periods. On top of stratified remains and potsherds from the Iron Age, a stratum dating to the Hellenistic and early Roman periods was found, featuring structures constructed from hewn stones, stone floors, a ritual bath, and pottery items. This settlement appears to have been destroyed during the Bar-Kochba war. The site saw renewed occupation in the late Roman and early Byzantine periods, persisting until the 9th century during the early Muslim period.\nBoaz Zissu and Lior Perry proposed identifying the site of Khirbet el-Hummam/Khirbet Midieh as the location of both the Second Temple Period Modi'in and its successor, the Byzantine-era site of Moditha. They noted that this site meets geographical criteria, preserves the ancient name, and revealed significant findings indicating village existence during both periods. They suggest the Byzantine-period settlement was built upon the remains of Second Temple Period Modi'in.\nUmm el-Umdan\nThe archaeological site of Khirbet Umm el-Umdan, situated in the southern outskirts of modern Modi'in, has also been proposed as a possible location for the ancient town. The site was unearthed in the 2000s during salvage excavations conducted by the Israel Antiquities Authority amid the development of the Buchman neighborhood. The excavations unveiled a rural settlement featuring homes, burial sites, a synagogue and a ritual bath, dating from second century BC to the Bar Kochba war in 132 AD.\nExcavators Shlomit Wexler-Bdolah, Alexander Onn, and Yehuda Rapuano proposed this site as a possible ancient Modi'in, suggesting that its Arabic name, \"Umm el-Umdan\", preserves the city's ancient name. However, the name, Arabic for \"the mother of columns\", is also present in other places within Israel, such as another site situated in the Jerusalem hills and one in the Judean Lowlands.\nGiv'at Tittora\nAnother site proposed as ancient Modi'in is Giv'at haTittora, also known as al-Burj, situated approximately 7 kilometers southeast of Khirbet el-Hammam, in the northern part of modern Modi'in. Surveys and excavations conducted there in the 2000s uncovered several settlement layers, with a Crusader fortress atop the hill. The excavators, Shimon Gibson and Egon Lass, suggested to identify the site with ancient Modi'in. While the hill has a commanding view of the surroundings, excavations have not yielded substantial evidence of a Second Temple Period settlement, and Hellenistic remains are uncommon. Scholars like Zissu and Perry expressed reluctance in accepting this identification due to the lack of clear archaeological evidence and the absence of the ancient name's preservation.\nSites considered for the Hasmonean burial complex\nHistorically, Qubur al-Yahud and Horvat HaGardi were associated with the Tombs of the Maccabees. However, scholars now dispute this connection, arguing that these sites date to later periods. The original site might have been destroyed during the Bar Kochba revolt and subsequently lost; the tombs remain undiscovered.\nThe two sites historically connected with the tombs, include the \"Tombs of the Maccabees\" (Qubur al-Yahud) and Horvat HaGardi/Sheikh al-Garbawi.\n\"Tombs of the Maccabees\", Qubur al-Yahud\nperiod, thus ruling out their association with the earlier, Hellenistic-period Hasmonean mausoleum]]\nOne location historically linked to the Tombs of the Maccabees is a site known in Arabic as \"Qubur al-Yahud\", meaning  \"Tombs of the Jews\" (31° 55′ 46″ N, 34° 59′ 40″ E).\nIn December 1908, during the Hanukkah holiday, students and teachers from Herzliya Gymnasium journeyed to the area seeking the tombs of the Maccabees. Guided by a shepherd, they arrived at the Qubur el-Yahud tombs, where they lit Hanukkah candles, marking the start of a tradition of pilgrimage and candle-lighting at the site. Over the following decades, the tombs became a pilgrimage destination, associated with Zionist ideals, and inspired literary works. In 1937, members of the Maccabi movement organized a race from the tombs to Tel Aviv, carrying a torch lit above the site, a tradition continued after the Six-Day War, establishing Qubur el-Yahud as the official \"Tombs of the Maccabees\" site marked on maps alongside the name \"Modi'im\".\nScholars have highlighted that the tombs are actually shaft tombs characteristic of the Byzantine period, indicating that they cannot be the original burial complex of the Hasmonean family built centuries earlier, in the 2nd century BC.\nHorvat HaGardi/Sheikh al-Garbawi\nHorvat HaGardi, located north of Qubur al-Yahud, was also identified with the Maccabees' Tombs. This site is alternatively known as Sheikh al-Gharbawi (\"the western sheikh\"), an Islamic tomb-shrine located there. Adjacent to the shrine are the remains of a monumental rectangular structure made of ashlars, referred to in Arabic as \"al-Qal'a\" (\"the fortress\").\nIn 1870, Guérin excavated al-Qal'a, claiming it matched descriptions of the Tomb of the Maccabees in ancient texts. He reported his findings to the French consul and consulted with architect Moss, who affirmed the identification of the site based on its resemblance to historical accounts. This view was also supported by PEF explorer Charles F. Tyrwhitt-Drake. However, Clermont-Ganneau's extensive excavations in 1871, which uncovered a mosaic depicting a crux immissa and an arcosolium-type burial cave, suggest that the structure likely originated as a Christian structure in the Byzantine period, dating back to the fifth century AD. He proposed that it could have served as a Christian mausoleum commemorating the Maccabees' burial place, a theory supported by Eusebius' mention of the tombs of the Maccabees still being shown in his time.\nThe theory that the al-Qal'a structure originated as a Christian structure may have been regarded as the burial site of the Hasmoneans during the Byzantine period gained support from recent scholarship, including trial excavations led by Amit Re'em of the Israel Antiquities Authority in 2011. This theory was also accepted by Zissu and Perry.\nPlaces named after ancient Modi'in\nSeveral modern-day Israeli localities, including the city of Modi'in-Maccabim-Reut, are named after ancient Modi'in, and are situated in the area where it is believed to have once stood.\nReferences"
    }
  ]
}