{
  "content": [
    {
      "type": "text",
      "text": "# Moewardi\n\nMoewardi (Perfected Spelling: Muwardi; 1907–1948) is a National Hero of Indonesia from Central Java.\nBiography\nMoewardi was born in Pati, Central Java, in 1907. After studying at STOVIA (a school for native doctors) in Batavia (now Jakarta), he began studying as a specialist in throat, nose, and ear infections. He also chaired the city's branch of Jong Java. He practised medicine extensively during the Japanese occupation (1942–45).\nAfter the Japanese defeat in the Pacific, Indonesian politicians began preparing to proclaim the country's independence from Dutch colonial control. Moewardi, by this time living in Surakarta, established the Barisan Pelopor. This group which organised security at Ikada Square (now Merdeka Square) in Jakarta, to help secure the proclamation. Moewardi was one of the speakers at the event. Afterwards, Moewardi tasked his men with organising security for new president Sukarno and vice-president Mohammad Hatta, as well as other government figures. Moewardi was offered the position of Minister of Defence but refused it; the position went, in absentia, to Supriyadi.\nDuring the Indonesian National Revolution there was extensive military contact between Dutch and Indonesian forces. By early 1946 the capital was under Dutch control, and the nascent government abandoned Jakarta for Yogyakarta. Moewardi moved Barisan Pelopor to Surakarta and renamed it Barisan Banteng; the group was eventually merged into the Indonesian Army. Moewardi would accompany them in battles, helping the injured.\nAfterwards, Moewardi established a hospital and medical school in Surakarta. In 1948 he, together with a faction of other groups opposed to the Renville Agreement, established the  (People's Revolution Movement).\nOn 13 September 1948, while en route to his practice, Moewardi was kidnapped by the Communist Party of Indonesia and later murdered. He had previously attempted to organise a team to confront the communists following the Madiun Affair, and the city itself had little semblance of government.\nMoewardi was deemed a National Hero of Indonesia on 9 August 1964. A hospital in Surakarta and street in Jakarta are both named after him.\nReferences\nWorks cited\n*\n*\n*"
    }
  ]
}