{
  "content": [
    {
      "type": "text",
      "text": "# Moffatdale, Queensland\n\n| pop                 = 257\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4605\n| area                = 52.6\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 11.0\n| dir1                = SE\n| location1           = Murgon\n| dist2               = 54.7\n| dir2                = NNE\n| location2           = Kingaroy\n| dist3               = 98.4\n| dir3                = W\n| location3           = Gympie\n| dist4               = 237\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = South Burnett Region\n| stategov            = Nanango\n| fedgov              = Wide Bay\n| fedgov2             = Flynn\n| near-n              = Redgate\n| near-ne             = Redgate\n| near-e              = Redgate\n| near-se             = Barambah\n| near-s              = Charlestown\n| near-sw             = Charlestown\n| near-w              = Cherbourg\n| near-nw             = Murgon\n}}\nMoffatdale is a rural locality in the South Burnett Region, Queensland, Australia. In the , Moffatdale had a population of 257 people.\nGeography\nThe Bjelke-Petersen Dam is in the west of the locality () with the reservoir Lake Barambah () extending through the south-west of the locality.\nAlthough Moffatdale is not officially a town, there is a residential subdivision near the school. Apart from this, the land use is a mixture of grazing on native vegetation and crop growing.\nThere are a number of homesteads in the locality, including:\n* Barambah-Dale ()\n* Bridgeman Downs ()\n* Brigalow Park ()\n* Dal Dowie Retreat ()\n* Lakeview ()\n* Moffatdale ()\n* Parrishs Paddock ()\n* Peppercorn ()\n* Sunny Brae ()\nHistory\nCaulfield Provisional School opened on 1 November 1915 with 11 students under teacher Miss Elise Ellen Bow. In 1916, it was renamed Barambah West Provisional School and again in 1918 as Moffatdale Provisional School. On 1 June 1926, it became Moffatdale State School. The school celebrated its 50th anniversary in October 1965 with 5 of its first-day students in attendance. The school celebrated its 75th anniversary on 27 October 1990 with nearly 500 former students and teachers in attendance. The school celebrated its centenary in 2015 with the publication of a school centenary history book. At that time, the school had an enrolment of 53 students and the original school building was still on site, but was being used as an office.\nDemographics\nIn the , Moffatdale had a population of 179 people.\nIn the , Moffatdale had a population of 257 people.\nEducation\nMoffatdale State School is a government primary (Prep-6) school for boys and girls at 892 Barambah Road (). In 2018, the school had an enrolment of 42 students with 5 teachers (4 full-time equivalent) and 6 non-teaching staff (4 full-time equivalent).\nThere is no secondary school in Moffatdale. The nearest government secondary school is Murgon State High School in neighbouring Murgon to the north-west.\nAmenities\nThere are two boat ramps into Lake Barambah known as:\n* Bjelke-Petersen Dam (West) ()\n* Bjelke-Petersen Dam (East) ()\nBoth are on Haager Drive and are managed by the South Burnett Regional Council.\nReferences\nFurther reading\n*  — [https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/1dejkfd/alma997135624702061 via State Library of Queensland]"
    }
  ]
}