{
  "content": [
    {
      "type": "text",
      "text": "# Mohammad Delwar Hossain\n\n(Before 1971)\n| branch        =\n| serviceyears  = 1967–1981\n| unit          = Ordnance Corps\n| rank          =  Lieutenant Colonel\n| commands      = *Sub-Commander of Sector – VI\n*Commandant of COD, Dhaka\n*ADOS of 24th Infantry Division\n| battles       = Bangladesh Liberation War\n| known_for     = Assassination of Ziaur Rahman\n| awards        =  Bir Protik\n}}\nMohammad Delwar Hossain (1 April 1945 – 23 September 1981) was a lieutenant colonel in the Bangladesh Army who had served as a sub-sector commander in sector 6 during the Bangladesh Liberation War. He was subsequently executed for his alleged involvement in the assassination of president Ziaur Rahman in 1981.\nCareer\nMohammad Delwar Hossain was born on 1 April 1945 in Rajapur village of Barisal district. On 12 November 1967 he joined the Pakistan Army and was commissioned on 19 October 1969 in the Ordnance Corps.\nBangladesh Liberation War\nWhen the Bangladesh Liberation War began, Captain Delwar was stationed in Rawalpindi, Pakistan. After a number of failed attempts, he escaped to Bangladesh on 13 August 1971 and was made the commander of the Moghulhat sub-sector, in sector 6.\nHe was awarded Bir Protik for his actions during the war. In 1980, Delwar completed his M.A. in history at Dhaka University.\nAssassination of Ziaur Rahman\nIn his book Bangladesh: A Legacy of Blood, Anthony Mascarenhas claims that in September 1979, Delwar was visited by Lt. Colonel Matiur Rahman, who complained about the 'wrongdoings of the government and the BNP - high prices, social injustices and corruption'.\nOn 29 May 1981, the conspirators gathered at Delwar's house to plan the assassination of Zia. At the time, Delwar was deputy director of the 24th Infantry Division's Ordnance Services. Furthermore, he was the ADOS of the 24th Infantry Division.\nAfter Zia was killed, and Major General Abul Manzoor's coup attempt failed, most of the conspirators went on the run. As Delwar's wife was close friends with Begum Manzoor (the wife of Abul Manzoor), she and her three daughters escaped alongside Begum Manzoor. In total, eleven officers, two women and seven children escaped using three jeeps and a pick-up truck. However, Delwar did not escape with this group, for unknown reasons.\nDeath\nOn 23 September 1981, Delwar was hanged in Jessore Prison. He was buried at his family graveyard at Rupatali, Barisal.\nReferences"
    }
  ]
}