{
  "content": [
    {
      "type": "text",
      "text": "# Monarchy in Ontario\n\nin Right\n| realm              = Ontario\n| coatofarms         = Coat of arms of Ontario.svg\n| coatofarms_article = Coat of arms of Ontario\n| image              = His Majesty The King of Canada Charles III.png\n| incumbent          =  of Canada\n| incumbentsince     =\n| his/her            = }}\n| first_monarch      = Victoria\n| date               = 1 July 1867\n}}\nBy the arrangements of the Canadian federation, Canada's monarchy operates in Ontario as the core of the province's Westminster-style parliamentary democracy. As such, the Crown within Ontario's jurisdiction may be referred to as the Crown in Right of Ontario, His Majesty in Right of Ontario, the King in Right of Ontario, or His Majesty the King in Right of Ontario.  The Constitution Act, 1867, leaves many functions in Ontario specifically assigned to the sovereign's viceroy, the lieutenant governor of Ontario, whose direct participation in governance is limited by the constitutional conventions of constitutional monarchy.\nConstitutional role\nThe role of the Crown is both legal and practical; it functions in Ontario in the same way it does in all of Canada's other provinces, being the centre of a constitutional construct in which the institutions of government acting under the sovereign's authority share the power of the whole. It is thus the foundation of the executive, legislative, and judicial branches of the province's government. The —is represented and his duties carried out by the lieutenant governor of Ontario, whose direct participation in governance is limited by the conventional stipulations of constitutional monarchy, with most related powers entrusted for exercise by the elected parliamentarians, the ministers of the Crown generally drawn from among them, and the judges and justices of the peace. The Crown today primarily functions as a guarantor of continuous and stable governance and a nonpartisan safeguard against the abuse of power.\nin the Ontario Legislative Building]]\nThis arrangement began with the 1867 British North America Act and continued an unbroken line of monarchical government extending back to the early 17th century. Though it has its own government headed by the King, as a province, Ontario is not itself a kingdom.\nThere is currently no government house in Ontario. A viceregal suite in the Ontario Legislative Building in Toronto is used both as an office and official event location by the lieutenant governor, the sovereign, and other members of the royal family. The lieutenant governor resides in their own private residence, though may be provided accommodations by the provincial government if they are not from Toronto. The King and his relations reside at a hotel, usually the Fairmont Royal York, when in Toronto.\nRoyal associations\nThose in the royal family perform ceremonial duties when on a tour of the province; the royal persons do not receive any personal income for their service, only the costs associated with the exercise of these obligations are funded by both the Canadian and Ontario Crowns in their respective councils. Monuments around Ontario mark some of those visits, while others honour a royal personage or event. Further, Ontario's monarchical status is illustrated by royal names applied to regions, communities, schools, and buildings, many of which may also have a specific history with a member or members of the royal family; for example, Ontario has at least 47 distinct features named for Queen Victoria: one county, one township, 14 populated places, and 31 physical features. Associations also exist between the Crown and many private organizations within the province; these may have been founded by a royal charter, received a royal prefix, and/or be honoured with the patronage of a member of the royal family. Examples include the Royal Hamilton Yacht Club, which is under the patronage of Charles III and received its royal designation from Queen Victoria in 1891, and the Royal Conservatory of Music in Toronto, which, though founded in 1886, was constituted through royal charter by King George VI in 1947.\nThe main symbol of the monarchy is the sovereign himself, his image (in portrait or effigy) thus being used to signify government authority. A royal cypher or crown may also illustrate the monarchy as the locus of authority, without referring to any specific monarch. Further, though the monarch does not form a part of the constitutions of Ontario's honours, they do stem from the Crown as the fount of honour and, so, bear on the insignia symbols of the sovereign.\nHistory\nOrigins\nThe modern Crown's place in Ontario results, in part, from the French monarchy's history in New France (mostly in the ''Pays d'en Haut region; today southern Ontario), from the 16th century to the transfer of the territory to the British Crown in 1763, and, in part, from the establishment of Ruperts Land by royal proclamation of King Charles II of England in 1670, which included what is now northern Ontario.\nAmerican refugees and American invaders\nDuring and following the American Revolutionary War, which took place between 1775 and 1783, some 46,000 American settlers loyal to the Crown, known as the United Empire Loyalists, fled north to the Province of Quebec (formerly a part of New France, until the British were given control in 1763) and other colonies in the Canadas. The King-in-Council granted each family  of land. From then, Ontario residents descended from these original refugees may use the post-nominals UE, standing for United Empire, and the Canadian Heraldic Authority can grant them distinctive coronets in their coats of arms.\nAdditionally, thousands of Iroquois and other Aboriginals were expelled from New York and other states, resettling under the protection of the Crown in what is now Ontario. In particular,  Governor of the Province of Quebec Frederick Haldimand issued a royal proclamation (known as the Haldimand Proclamation'') granting land to the Mohawk people who had served the British Crown through the revolution. The proclamation stated:\nWhereas His Majesty, having been pleased to direct that, in consideration of the early attachment to his cause manifested by the Mohawk Indians, and of the loss of their settlement which they thereby sustained, that a convenient tract of land under his protection should be chosen as a safe and comfortable retreat for them and others of the Five Nations, who have either lost their settlements within the Territory of the American States, or wish to retire from them to the British, I have at the earnest desire of many of these, His Majesty's faithful allies, purchased a tract of land from the Indians situated between the Lakes Ontario, Erie, and Huron, and I do hereby, in His Majesty's name, authorize and permit the said Mohawk Nation and such others of the Five Nation Indians as wish to settle in that quarter to take possession of and settle upon the banks of the river commonly called Ours [Ouse], or Grand River.\nOn this land, the Crown in 1785 erected the Mohawk Chapel, in Brantford, as a gift to the Mohawk people and their then-leader, Joseph Brant. At the same time, the King provided lands near Belleville to the displaced Tyendinaga Mohawks. There, too, a chapel was built, today known as the Christ Church Royal Chapel. The Mohawks brought there the silver communion set given to them by Queen Anne in 1711, as a symbol of the alliance between the Crown and the Mohawks. Further gifts from monarchs included a triptych in the Mohawk language and a bell from King George III, a royal coat of arms of the United Kingdom from King George V, a bible from Queen Victoria, and a communion chalice from Queen Elizabeth II (given in 1984 to mark the bicentennial of the Mohawks arrival in Ontario), in addition to a set of eight silver handbells. The churches are now two of the three chapels royal in Canada.\nA few dozen Black Loyalists also settled in the western region of the Province of Quebec; although, not nearly as many as those who located themselves in Nova Scotia. The majority of black inhabitants of ''Pays d'en Haut'' were slaves brought into the colony by the Loyalists, including Brant.\nIt was the attempted forced return to the United States of one of those slaves—Chloe Cooley—in 1793 that prompted the abolitionist John Graves Simcoe, then serving as King George III's representative in Upper Canada (a territory formed out of the western portion of the Province of Quebec in 1791, because of the influx of Loyalists), to push for legislation abolishing slavery in the colony. Though he faced resistance from the Legislative Assembly, Simcoe, later that year, gave royal assent to the Act Against Slavery, making Upper Canada \"the first jurisdiction in the British Empire to pass a law freeing slaves.\"\nPrince Edward, a son of King George III, visited Upper Canada eight months after its establishment, becoming the first member of the royal family to tour the area, seeing Cornwall, Kingston, Prince Edward County, Niagara-on-the-Lake, going so far as Fort Erie. Along the way, he met with Loyalists and various First Nations delegations, helping to foster a British identity for Upper Canada. Along with Simcoe, Prince Edward made a point of visiting Forts Niagara and Scholsser, getting himself involved in a boundary dispute with the United States in the process.\nThe United States endeavoured to conquer the Canadas in the War of 1812;}} all the American parties involved assumed their troops would be greeted as liberators. When the US Army first invaded, crossing the Detroit River and landing at Sandwich (today Windsor) on 12 July, the commander, William Hull ordered all subjects of the King to surrender, telling them he desired to free them from the \"tyranny\" of Britain and give them liberty, security, and wealth, unless they preferred \"war, slavery, and destruction.\" The loyal among the Upper Canadians chose the King and war to defend him, whereas American immigrants who'd settled in Upper Canada merely for the free land chose neutrality, stating they would neither obey British orders to march against Hull, nor  \"a man would join Hull to fight against the King.\" Hull retreated across the river on 7 August, but, the US made repeated incursions into Upper Canada through to 1814 and the British regulars, warriors of the Six Nations and Seven Nations, and free-African- and European-Canadians (the volunteers who were colloquially said to be \"taking the King's shilling\") reisited them at every try. By the time the Treaty of Ghent was signed on 24 December 1814, ending the war, the United States made no gains into the Canadas.\nRebellion\nThe republican agitations of Louis-Joseph Papineau in Lower Canada in the late 1830s spread quickly to Upper Canada. These met with agreeable circumstances in western colony, including a politically active lieutenant governor, Francis Bond Head, who had, since 1834, thwarted the efforts of the Reform party-dominated Legislative Assembly, to the point the Executive Council resigned and Head actively campaigned for the Tories in the subsequent election, equating voting for that party with showing loyalty to the Crown. The Reformers' leader, William Lyon Mackenzie, attempted to petition the King to have the election declared invalid, but, was dismissed by the Colonial Office in London. Meanwhile, the now Tory majority in the Upper Canada parliament passed laws that were self-serving to Tory parliamentarians and burdensome on farmers, increased the colony's debt, and continued the legislative session even after the death of William IV in 1837.\nOn 9 October of that year, Mackenzie received a message from Papineau's Patriotes in Lower Canada, informing him that the rebellion there was about to begin. A month later, Mackenzie published a satirical piece in his magazine, the Constitution, that included a draft republican constitution for the \"State of Upper Canada\" and he printed handbills declaring independence, which were distributed to citizens north of Toronto. Actual armed rebellion broke out in Upper Canada on 5 December. Of it, the new Queen, Victoria, wrote in her diary, \"the news are, I grieve to say, very bad from Canada; that is to say, rumours and reports by the papers; though, we have no official reports. But [Prime Minister] Lord Melbourne hopes it may not be so bad as it is rumoured. There certainly is open rebellion.\"\nThe Queen need not have worried about Upper Canada, however, as the uprising was put down within a matter of days. Mackenzie and 200 supporters fled to Navy Island in the Niagara River and declared it the Republic of Canada on 13 December. That sustained until 13 January 1838, when, under attack by British armaments, the rebels fled, with Mackenzie running to the United States mainland, where he was arrested for violating the Neutrality Act. In the wake of the disturbances, the Queen called on her people in Upper Canada to eschew vengeance on the perpetrators in favour of justice and, as a mark of goodwill with which to begin her reign and to commemorate her coronation, the Victoria used her royal prerogative to pardon many of the rebels, continuing to do so through the 1840s.\nResponsible government\nThe Queen's representative in British North America, the Earl of Durham, penned a report containing recommendations for change following the Lower and Upper Canada Rebellions. Based on that document, the Act of Union 1840 was passed by the parliament at Westminster and proclaimed in effect by Queen Victoria on 10 February 1841, thus renaming Upper and Lower Canada as Canada West (today Ontario) and Canada East (today Quebec), respectively, and merging them to form the Province of Canada, with a governor general to represent the monarch and housed at Monklands, in Montreal. Five years later, the Legislative Assembly of the Province of Canada made Victoria's birthday, 24 May, a public holiday called Victoria Day.\n's portrait of Queen Victoria that was saved from the burning of the parliament of the Province of Canada]]\nWhen, in 1848, Robert Baldwin and Louis-Hippolyte Lafontaine were reappointed as Joint Premiers, responsible government was implemented in the colony, with the backing of Queen Victoria. This meant the governor general was to act on the advice of his co-prime ministers, who were responsible to the elected parliament. The first test of this came in the same year, when the Rebellion Losses Act was put to Governor General the Earl of Elgin for royal assent. Elgin had strong misgivings about the bill, and was pressured by the Tories to refuse assent, but he gave it approval, regardless, on 28 April 1849. As a result, the Anglophone population of Montreal (where the legislature was located) became incensed, the Governor General was assaulted, the parliament building was burned, and the Montreal Annexation Manifesto was issued, calling for the absorbption of the Province of Canada into the United States.\nStill, all was not lost: The portrait of Queen Victoria that hung in the parliament, painted by John Partridge, was saved from the fire by Sandford Fleming (and hangs in the federal Parliament of Canada today), the colony did not join the US, and responsible government remained a part of the Province of Canada's constitutional order.\nThe Queen's eldest son and heir, Prince Albert Edward (later King Edward VII) for four months toured the Maritimes and Province of Canada in 1860, setting the cornerstone of the parliament building in Bytown (today Ottawa) and officially opening Queen's Park in Toronto. At Dundurn Castle, in Hamilton, Albert Edward met with Allan MacNab, a former joint premier of the Province of Canada. In a twist of fate, the Prince's great-great-grandson, King Charles III, married Camilla Shand (now Queen Camilla), the great-great-great-granddaughter of MacNab. The Prince also crossed the border to pay a visit to President of the United States James Buchanan at the White House.\nSectarian tensions were high in Canada at the time and Prince Albert Edward was cautioned not to do or say anything that might exacerbate the situation. The Duke of Newcastle, who accompanied the Prince, instructed the Mayor of Toronto to ensure Albert Edward's procession would not pass under any Orange Order arches. At Kingston, the Duke ordered the royal yacht not to dock, as the Orangemen had erected a welcoming arch on the pier, with an image of William of Orange on one side and a depiction of the Albert Edward with the anti-Catholic revolutionary Giuseppe Garibaldi on the other. Orangemen thereafter protested the Prince's steamer along part of its route.\nConfederation\nThe province of Ontario was created from the boundaries of Canada West following Canadian Confederation in 1867. The next year, on 26 May, Queen Victoria issued a royal warrant granting the province its coat of arms. Several areas were incorporated into Ontario in the mid 19th and early 20th century, with Ontario reaching its final size in 1912.\nPrince Albert (later King George VI), toured Ontario in 1913, while serving as a midshipman aboard the Royal Navy cruiser , visiting Toronto and Niagara Falls.\nSee also\n* List of royal tours to Hamilton, Ontario\n* List of royal tours to London, Ontario\n* Monarchy in the Canadian provinces\n* Symbols of Ontario\nReferences\nExternal links\n* [https://web.archive.org/web/20110611191859/http://www.archives.gov.on.ca/english/on-line-exhibits/jubilee/institution.aspx The Monarchy in Ontario], from the Archives of Ontario\n*"
    }
  ]
}