{
  "content": [
    {
      "type": "text",
      "text": "# Monarchy of Nigeria (1960–1963)\n\nFrom 1960 to 1963, Nigeria was a sovereign state and an independent constitutional monarchy. Nigeria shared the monarch with Australia, Canada, United Kingdom, and certain other sovereign states. The monarch's constitutional roles were mostly delegated to the governor-general of Nigeria.\nElizabeth II was the only monarch to reign during this period. As such, she was officially titled Queen of Nigeria.\nThe monarchy was abolished on 1 October 1963, when Nigeria adopted a president as its head of state.\nHistory\nThe Federation of Nigeria had superseded the Colony and Protectorate of Nigeria within the British Empire on 1 October 1954. The Federation was initially a quasi-federal British colony. It became independent as a dominion within the Commonwealth of Nations on 1 October 1960 under the Parliament of the United Kingdom's Nigeria Independence Act 1960.\n| salign=right| source=Prime Minister Sir Abubakar Tafawa Balewa on Independence Day 1960}}\nPrincess Alexandra of Kent represented the Queen at the independence celebrations. She flew to Lagos on 26 September 1960, and was welcomed in Nigeria by a crowd of tens of thousands of people. On 1 October, the Princess presented Nigeria's instrument of independence, also known as the Freedom Charter, to Sir Abubakar Tafawa Balewa who became the Prime Minister. On 3 October, the Princess formally opened the first federal parliament of independent Nigeria, on behalf of the Queen, before an assembly of people and diplomats. Dr Nnamdi Azikiwe, President of the Nigerian senate and Governor-General-designate, addressed the Princess, asking her to open Parliament by reading the Speech from the Throne. The Princess later took a state drive through Lagos, saying an official farewell to Nigerians.\nThe Queen sent a message to Nigerians, which said:\nConstitutional role\n{| class=\"wikitable \" style=\"text-align:left;  font-size:88%; float:right\";\n! colspan=\"2\" |Nigerian state leaders (1960–1963)\n|--\n! scope=col | Monarch\n| Elizabeth II\n|--\n! scope=col rowspan=\"2\" | Governor-General\n| Sir James Wilson Robertson (1960)\n|-\n| Nnamdi Azikiwe (1960–1963)\n|-\n! scope=col | Prime Minister\n| Sir Abubakar Tafawa Balewa\n|-\n| colspan=\"2\" |\n|}\nNigeria was one of the realms of the Commonwealth of Nations that shared the same person as Sovereign and head of state.\nEffective with the Nigeria Independence Act 1960, no British government minister could advise the Sovereign on any matters pertaining to Nigeria, meaning that on all matters of Nigeria, the monarch was advised solely by Nigerian ministers. All Nigerian bills required Royal Assent. The monarch was represented in the Federation by the Governor-General of Nigeria, who was appointed by the monarch on the advice of the Nigerian Prime Minister. After independence, the monarch held her sovereignty in virtue of her \"Nigerian Crown\", and acted on the advice of the Nigerian Government.\nExecutive and legislature\nThe Government of Nigeria was officially known as ''Her Majesty's Government''.\nThe monarch, the Senate, and the House of Representatives constituted the Parliament of Nigeria. All executive powers of Nigeria rested with the sovereign. All laws in Nigeria were enacted only with the granting of Royal Assent, done by the Governor-General on behalf of the Sovereign. The Governor-General could reserve a bill \"for the Queen's pleasure\"; that is withhold his consent to the bill and present it to the sovereign for her personal decision; or he could veto it completely by withholding his assent therefrom. The Governor-General was also responsible for summoning, proroguing, and dissolving Parliament. The Governor-General had the power to choose and appoint the Council of Ministers and could dismiss them under his discretion. All Nigerian ministers held office at the pleasure of the Governor-General.\nForeign affairs\nThe Royal Prerogative also extended to foreign affairs: the sovereign or the governor-general conducted treaties, alliances and international agreements on the advice of the Nigerian Cabinet. Nigerian representatives abroad were accredited to foreign countries by the monarch in her capacity as Queen of Nigeria. The governor-general, on behalf of the Queen, also appointed Nigerian high commissioners, ambassadors, and similar principal representatives, and received similar diplomats from foreign states. The letters of credence were formally issued by the monarch.\nCourts\nWithin the Commonwealth realms, the sovereign is responsible for rendering justice for all her subjects, and is thus traditionally deemed the fount of justice. In Nigeria, criminal offences were legally deemed to be offences against the sovereign and proceedings for indictable offences were brought in the sovereign's name in the form of The Queen versus [Name]. Hence, the common law held that the sovereign \"can do no wrong\"; the monarch cannot be prosecuted in her own courts for criminal offences. The highest court of appeal for Nigeria was the Judicial Committee of the Privy Council, and criminal prosecution was instituted in the monarch's name. The monarch, and by extension the governor-general, could also grant immunity from prosecution, exercise the royal prerogative of mercy, and pardon offences against the Crown, either before, during, or after a trial.\nFederal and provincial aspects\nNigeria's monarchy was federal, with four legal jurisdictions—one federal and three provincial—with the monarch taking on a distinct legal persona in each.\nThe Queen of Nigeria was represented by the Governor-General at the federal level, and by governors in the three regions: Northern, Western, and Eastern. The governors and the Governor-General were appointed by the monarch on the recommendation of the Nigerian Premiers and the Nigerian Prime Minister respectively.\nRoyal style and titles\nThe Royal Style and Titles Act, 1961 of the Nigerian Parliament granted the monarch separate style and titles in her role as Queen of Nigeria.\nElizabeth II had the following style and titles in her role as the monarch of Nigeria:\n*1 October 19601 June 1961: Elizabeth the Second, by the Grace of God, of the United Kingdom of Great Britain and Northern Ireland and of Her other Realms and Territories Queen, Head of the Commonwealth, Defender of the Faith\n*1 June 19611 October 1963: Elizabeth the Second, Queen of Nigeria and of Her other Realms and Territories, Head of the Commonwealth\n**Colloquially, the Queen was referred to as Oba Obirin (Yoruba: King Lady) by the people of Yorubaland during her reign.\nOath of allegiance\nIn Nigeria, the oath of allegiance required a person to swear or affirm that he would be \"faithful and bear true allegiance to Her Majesty Queen Elizabeth the Second, Her Heirs and Successors, according to law\", while for the oath of office he had to swear that he would \"well and truly serve Her Majesty Queen Elizabeth the Second in the Office of _______\".\nCultural role\n, featuring St Edward's Crown]]\nThe Crown and Honours\nWithin the Commonwealth realms, the monarch is deemed the fount of honour. Similarly, the monarch, as Sovereign of Nigeria, conferred awards and honours in Nigeria in her name. Most of them were awarded on the advice of \"Her Majesty's Nigerian Ministers\".\nThe Crown and the Defence Force\nThe monarch was the commander-in-chief of the Nigerian Armed Forces.\nThe Crown sat at the pinnacle of the Nigerian Defence Force. It was reflected in Nigeria's naval vessels, which bore the prefix HMNS, i.e., ''Her Majesty's Nigerian Ship''. The Nigerian Army and the Nigerian Navy were known as the \"Royal Nigerian Army\", and the \"Royal Nigerian Navy\" respectively. The prefix \"Royal\" was dropped when the monarchy was abolished.\nAbolition\n(left) with Saidu Samaila Sambawa in Nigeria, 2003]]\nThe monarchy was unpopular with Nigerians and all political parties in Nigeria agreed that the country should be a republic; as the British High Commissioner to the Federation, Lord Head, noted:\nNigeria adopted the president of Nigeria as head of state, on 1 October 1963,}}\nQueen Elizabeth II visited Nigeria twice: 28 January–16 February 1956 and 3–6 December 2003, the latter time to attend the Commonwealth Heads of Government Meeting 2003.\nSee also\n*Statue of Queen Elizabeth II, Lagos\nReferences"
    }
  ]
}