{
  "content": [
    {
      "type": "text",
      "text": "# Monarchy of Australia\n\n|realm = Australia\n|coatofarms = Royal_Standard_of_Australia.svg\n|coatofarms_article =King's Flag for Australia\n|type = commonwealth\n|his/her = His\n|incumbent =\n|incumbentsince =\n|heir_apparent =\n|image = }}\nThe monarchy of Australia is a central component of Australia's system of government, by which a hereditary monarch serves as the country's sovereign and head of state. It is a constitutional monarchy, modelled on the Westminster system of parliamentary democracy and responsible government, while incorporating features unique to the Constitution of Australia.\nThe present monarch is , who has reigned since . The Australian Government acknowledges King Charles III's accession day as the day he became king in the United Kingdom, 8 September.|group=n|name=accession}} The monarch is represented at the federal level by the governor-general (currently Samantha Mostyn), in accordance with the Australian Constitution and letters patent from his mother and predecessor, Queen Elizabeth II. Similarly, in each of the Australian states the monarch is represented by a governor (assisted by a lieutenant-governor; generally the chief justice of the state's supreme court), according to the Australia Act and respective letters patent and state constitutions. In the Northern Territory (which is legally subordinate to the federal government), the monarch is represented by an administrator appointed by the governor-general. The monarch appoints the governor-general on the advice of the prime minister, and appoints the state governors on the advice of the respective premiers. These are the only mandatory constitutional functions of the monarch of Australia.\nAustralian constitutional law provides that the person who is monarch of the United Kingdom will also be the monarch of Australia. Since the 1940s at the latest, the Australian monarchy has been a distinct office and in that capacity, they act exclusively upon the advice of Australian state and federal ministers. Australia is one of the Commonwealth realms, 15 independent countries that share the same person as monarch and head of state.\nInternational and domestic aspects\nand Camilla, 2024]]\nThe monarch of Australia is the same person as the monarch of the 14 other Commonwealth realms within the 56-member Commonwealth of Nations. However, each realm is independent of the others, the monarchy in each being distinct from the rest. Effective with the Australia Act 1986, the British government cannot advise the monarch on any matters pertinent to Australia; on all matters of the Australian Commonwealth, the monarch is advised solely by Australian federal ministers of state. Likewise, on all matters relating to any Australian state, the monarch is advised by the ministers of that state, tendered via the premier.\nEmergence of a separate Crown\n, 2024]]\nCourts and academics have proposed several dates on which the Crown of Australia separated from the Crown of the United Kingdom. These include 1926, when at an Imperial Conference it was announced that governors-general would no longer represent the government of the United Kingdom or 1930, when at another Imperial Conference it was clarified that the monarch would be advised directly by dominion ministers. Anne Twomey argues for this later date at the latest. Others have suggested the Crowns separated once Australia became fully independent, with dates suggested including 1931 (when the UK Statute of Westminster was passed), 1939 or 1942 (due to the Statute of Westminster Adoption Act (Cth), passed in 1942 with effect retrospectively to 1939) or 1986 (when the Australia Acts severed the last possibilities of UK institutions changing Australian laws). However, members of the High Court have indicated that the separation of the Crowns was complete by at least 1948, as seen by the creation of Australian citizenship laws.\nIt has been suggested that for each state there might also be a distinct Crown, separate from the Crown of Australia.  However, this was not an issue in the 1999 Australian republic referendum.\nTitle\nThe formal title of the current monarch is King }} Charles the Third, by the Grace of God King of Australia and His other Realms and Territories, Head of the Commonwealth. Victoria declared the monarch's title to be His Majesty King Charles the Third, by the Grace of God King of Australia and His other Realms and Territories, Head of the Commonwealth. However, subsequent Victorian government documents have used the title Charles the Third, by the Grace of God King of Australia and His other Realms and Territories, Head of the Commonwealth.\n}}\nPrior to 1953, the title of the Australian monarch had simply been the same as that in the United Kingdom. A change in the title resulted from occasional discussion among Commonwealth prime ministers and an eventual meeting in London in December 1952, at which Australia's officials stated their preference for a format for Queen Elizabeth II's title that would name all the realms. However, they stated they would also accept Elizabeth II (by the Grace of God) of the United Kingdom of Great Britain and Northern Ireland, [name of realm], and all of her other Realms and Territories Queen, Head of the Commonwealth (Defender of the Faith). The latter composition was adopted, despite some objections from the South African and Canadian governments. The sovereign's title in all her realms thus kept mention of the United Kingdom, but, for the first time, also separately mentioned Australia and the other Commonwealth realms. The passage of the Royal Style and Titles Act 1953 by the Parliament of Australia put these recommendations into law.\nIn 1973 the Whitlam government replaced the 1953 royal styles Act, with Whitlam arguing that the inclusion and position of Elizabeth's title in the UK made the title not \"sufficiently distinctively Australian\" and that the phrase \"Defender of the Faith\" had \"no historical or constitutional relevance in Australia\". A new Royal Titles and Styles Bill that removed these references was passed by the federal Parliament.}} The governor-general, Sir Paul Hasluck, reserved royal assent for the monarch, as governor-general Sir William McKell had done with the 1953 Royal Titles and Styles Bill to allow Elizabeth to give her assent in person, which she did at Government House in Canberra on 19 October 1973.\nAt the state level, Western Australia and South Australia have independently legislated the monarch's title to be the same as the Commonwealth title. There is limited reference to the monarch's title in the other states, however parliamentarians have used expressions such as \"Queen of [state]\" and \"Queen in right of [state]\" during parliamentary debates. In 1973, Queensland sought to pass legislation to include Queensland specifically in the monarch's title. The Queensland parliament passed legislation seeking an advisory opinion from the Privy Council as to whether they had the legislative power to do, however this legislation was declared unconstitutional by the High Court. In seeking this title, the Queensland government's motivation was to dissuade the British from accepting the Whitlam government's advice that all of the British government's then authority over the states should be transferred to the federal government. The dismissal of the Whitlam government in 1975 removed the impetus for the title change and no further steps were taken in the matter.\nSuccession\nto the Australian throne being read at Queensland's Government House by Governor Sir John Lavarack, 1952]]\nRoyal succession is determined by a mix of common law, British law that continues to apply in Australia, and more recent Australian federal and state statutes. These entail that succession follows the eldest non-adopted child of the current monarch (primogeniture), with the restriction that an heir must be in communion with the Church of England and not a Roman Catholic to ascend the throne.\nHistory\nThese rules have evolved over centuries. The British statutes, the Bill of Rights 1689 and the Act of Settlement 1701 first limited succession to legitimate descendants of Sophia, Electress of Hanover and imposed religious requirements in the context of the Glorious Revolution. These laws were received alongside all other British laws to Australia when Australia was settled. Considering the colonial status of the individual colonies and later the federated Australia, it was accepted at the time that these laws could only be changed by the UK Parliament.\nLater, Australia and the other dominions gained greater legislative independence with the passage of the Statute of Westminster 1931 (adopted by Australia in 1942). While this allowed the dominions to pass laws that conflicted with UK laws, to ensure that succession laws remained consistent, the preamble noted that it would be in keeping with each Commonwealth realm's constitutional practice that any succession changes would require the consent of the parliaments of each realm.\nAs Australia had not yet adopted the Statute of Westminster by the time of the abdication of Edward VIII in 1936, the UK Declaration of Abdication Act 1936 applied automatically without the need for Australia's consent. However, the Australian federal Parliament did pass a resolution of assent to the changes as a matter of courtesy.\nThe most recent reforms to the succession occurred following the Perth Agreement in 2011, in which all the Commonwealth realms agreed to changes including the removal of a preference towards male heirs and the repeal of the Royal Marriages Act 1772 (which amongst other things prevented the monarch from marrying a Roman Catholic). As the Australian federal Parliament does not have a head of power over succession, it required a referral legislation from each of the states. The Northern Territory also added its request and concurrence, although this was not constitutionally required. The federal legislation finally become law on 24 March 2015 and as Australia was the last realm to the make the required changes, the act took effect on 26 March 2015 (BST), parallel to other realms' laws.\nDemise of the Crown\n, 2022]]\nUpon a demise of the Crown (the death or abdication of a sovereign), it is customary for the accession of the new monarch to be publicly proclaimed by the governor-general on behalf of the Federal Executive Council, which meets at Government House after the accession. Parallel proclamations are made by the governors in each state. Regardless of any proclamations, the late sovereign's heir immediately and automatically succeeds, without any need for confirmation or further ceremony. Following an appropriate period of mourning, the monarch is also crowned at a coronation ceremony in the United Kingdom; though, this is not necessary for a sovereign to reign, being primarily a symbolic event. For example, Edward VIII was never crowned, yet was undoubtedly king during his short time on the throne. After an individual ascends the throne, he or she typically continues to reign until death.\nThe monarch legally cannot unilaterally abdicate; the only Australian monarch to do so, Edward VIII, did so following the passage of British legislation. While the UK has passed regency acts from 1936 onwards to prepare for a situation when the monarch is incapacitated, the dominions did not agree for these acts to be extended into domestic law as it was felt that governors-general could exercise all the powers a regent would need to exercise. Issues could arise if the monarch was incapacitated for a particularly long period, as there is no other legal method for the governor-general to be replaced.\nFinances\nAustralia does not fund the King or wider royal family for any activities taken outside of Australia, either towards personal income or to support royal residences outside of Australia. When monarch visits Australia, their expenses are paid for by the Australian Government. However, the Australian Government does pay a salary to the governor-general and for the upkeep of the official vice-regal residences in the country.\nIn 2018, a day-long visit to Vanuatu by Charles (then the Prince of Wales), escorted by Australian Minister for Foreign Affairs, Julie Bishop, in between a tour of Queensland and the Northern Territory, was paid for by the Australian government. Charles III's 2024 Australian royal tour cost $640,000, Elizabeth II's 2011 royal tour $2,690,000, her 2006 tour $1,450,000, her 1964 tour £179,000 and her first tour in 1954 cost £510,000.\nResidences\nat Admiralty House, Sydney, 2014]]\nThe governor-general has two official residences: Government House in Canberra (commonly known as Yarralumla) and Admiralty House in Sydney.\nWhen HMY Britannia was in Australian waters and in use by the monarch of Australia, it was not available to British officials for meetings or promotions.\nPersonification of the state\nThe monarch is the locus of many oaths of allegiance. Various employees of the Crown are required by law to recite this oath before taking their posts, such as all members of the Commonwealth Parliament and of the state and territory parliaments, as well as most magistrates, judges, police officers, and justices of the peace. This is in reciprocation to the sovereign's coronation oath, taken most recently by Charles III who promised \"to govern the Peoples of the United Kingdom of Great Britain and Northern Ireland [and] your other Realms ... according to their respective laws and customs\".\ntaking the Oath of Allegiance as the governor of Queensland after Elizabeth II's accession to the throne, 1952]]\nThe prime minister, ministers and parliamentary secretaries also make an oath or affirmation of office on their appointment to a particular ministry, which traditionally included a promise of allegiance to the monarch. However, the wording of this oath or affirmation is not written into law and beginning with swearing in of Paul Keating, all Labor prime ministers have dropped the reference to the sovereign.\nThe oath of citizenship similarly contained a statement of allegiance to the reigning monarch until 1994, when a pledge of allegiance to Australia and its values was introduced. However the concept of allegiance to the monarch remains important constitutionally, especially in the context of determining whether a person is an \"alien\" for the purposes of section 51(xix).\nHead of state\nat Buckingham Palace]]\nKey features of Australia's system of government include its basis on a combination of written and unwritten rules, comprising the sovereign, governors, and governor-general. The Constitution does not mention the term head of state. sections 2 to 4 and further sections refer to \"the Queen\" (at the time, Queen Victoria) and covering clause 2 requires that to be interpreted as referring to her \"heirs and successors in the sovereignty of the United Kingdom\".}} According to the Parliament of Australia website, Australia's head of state is the monarch and its head of government is the prime minister, with powers limited by both law and convention for government to be carried on democratically. However, the governor-general's website states that the office holder is in practice Australia's head of state. A leading textbook on Australian constitutional law formulates the position thus: \"The Queen, as represented in Australia by the governor-general, is Australia's head of state.\"\nAdditionally, Queensland and South Australia describe the monarch as the head of state for their particular state. New South Wales and Western Australia on the other hand describe their governors as their respective heads of state, whilst Tasmania and Victoria state that the governor \"exercises the constitutional power\" of the head of state.\nWhile current official sources use the description head of state for the monarch, in the lead up to the referendum on Australia becoming a republic in 1999, Sir David Smith proposed an alternative explanation that the governor-general is head of state. This view has some support within the group Australians for Constitutional Monarchy.\nConstitutional role\nAustralia has a written constitution based on the Westminster model of government, implementing a federal system and a distinct separation of powers. It gives Australia a parliamentary system of government, wherein the role of the sovereign and governor-general is both legal and practical. The sovereign of Australia is represented in the federal sphere by the governor-general—appointed by the monarch on the advice of the prime minister of Australia—and in each state by a governor—appointed by the monarch upon the advice of the relevant state premier.\nExecutive\nbeing sworn in as Prime Minister of Australia by Governor-General Quentin Bryce on 27 June 2013]]Section 61 of the Constitution vests the executive power of the Commonwealth in the King, to be exercisable by the governor-general. The governor-general is appointed by the King on the advice of the prime minister—the only role the monarch must perform personally. The governor-general in turn (usually following elections) appoints the individual with or most likely to obtain the confidence of the House of Representatives to be prime minister. Other ministers are appointed by the governor-general on the advice of the prime minister, a subset of which form the cabinet. These ministers then advise the governor-general on the exercise of executive power, either directly or through the Federal Executive Council. Executive power includes powers belonging to the royal prerogative, which includes the power to declare war and enter into treaties.\nAs the King and governor-general must in general act on advice, their roles are primarily symbolic and cultural, acting as a symbol of the legal authority under which all governments and agencies operate. As an example, members of various executive agencies and judges are formally appointed by the governor-general, not the government of the day. However, the governor-general does also has certain reserve powers, which are powers that they may exercise in the absence of or contrary to advice. Their most prominent use was during the 1975 constitutional crisis when governor-general Sir John Kerr dismissed the government of Gough Whitlam on the basis that his government had failed to secure the passage of supply.\nApart from the appointment of the governor-general, the monarch has also been personally involved in issuing letters-patent for the creation of Australian honours. The monarch also has the power to dismiss the governor-general. This power was highlighted during the 1975 constitutional crises. During the crisis there was a concern about a \"race to the palace\" where the governor-general may have tried to dismiss the prime minister before the prime minister sought to advise the monarch to dismiss the governor-general or vice-versa. Following the dismissal, Whitlam and the speaker of the house each separately contacted the palace to reverse the governor-general's actions, but the palace advised that only the governor-general, not the Queen, had the power to appoint the prime minister.\nParliament\nilluminated in purple to mark Elizabeth II's Platinum Jubilee, 2022. The meeting place for the Parliament of Australia was opened by the Queen in 1988.]]\nParliament consists of the sovereign, the Senate and the House of Representatives. Their authority in the House of Representatives is represented by the Mace of the House (which also represents the authority of the house itself and its Speaker). However, neither the sovereign nor the governor-general participate in the legislative process save for the granting of royal assent. Further, the constitution outlines that the governor-general alone is responsible for summoning, proroguing, and dissolving the federal parliament.\nAll federal, state and territory legislation, except those in the Australian Capital Territory (ACT), are enacted only with the granting of royal assent, done by the monarch, governor-general, relevant state governor, or administrator in the case of the Northern Territory (NT). This is done in the federal context by the governor-general signing two copies of the bill. If the law is one in which takes effect on proclamation, the governor-general will also make this proclamation to which the Great Seal of Australia is then affixed in authentication of the corresponding letters patent. The governor-general may reserve a bill ''for the King's (or Queen's) pleasure; that is, withhold their consent to the bill and present it to the sovereign for their personal decision. Under the constitution, the sovereign also has the power to disallow a bill within one year of the governor-general having granted royal assent. The purpose of this section was originally to allow the UK government to supervise the workings of the Commonwealth parliament, as this power would only be exercised by the monarch as advised by their British ministers. The power was never actually used and it is very unlikely that it will be used in the future. However, the monarch did on occasion refuse (or indicated they would refuse) assent to bills passed by state parliaments, the last time being in 1980 when British officials indicated they would advise the Queen to refuse assent for a New South Wales bill that attempted to unilaterally remove the involvement of British ministers in the appointment of the governor.\nCourts\npositioned above]]\nIn British constitutional law, the monarch is traditionally known as the fount of justice''. However, federal judicial power is vested by the Australian Constitution directly to the High Court and other federal courts; with the Crown not involved with the exercise of this power. However, the Crown does participate in the judicial system, with criminal offences in most jurisdictions deemed to be offences against the sovereign. Proceedings for indictable offences are brought in the sovereign's name in the form of The King [or Queen] against [Name] (typically shortened to R v [Name] standing for  for King or  for Queen). However, offences in Western Australia and Tasmania are brought in the name of the particular state. Civil lawsuits against the Crown in its public capacity (that is, lawsuits against the government) are permitted due to statute. In international cases, as a sovereign and under established principles of international law, the monarch of Australia is not subject to suit in foreign courts without his express consent. The prerogative of mercy lies with the monarch, and is exercised in the state jurisdictions by the governors.\nStates and territories\n, 1954]]\nIn accordance with the Australia Act 1986, the sovereign has the power to appoint, on advice tendered by the relevant state premier, a governor in each of the Australian states, who themselves appoint executive bodies, as well as people to fill casual Senate vacancies, if the relevant state parliament is not in session. The state governors continue to serve as the direct representatives of the monarch, in no way subordinate to the governor-general, and they carry out on his behalf all of the monarch's constitutional and ceremonial duties in respect of their respective state. The Northern Territory and the Australian Capital Territory are constitutionally subordinate to the federal government, with an administrator appointed by the governor-general on the advice of the federal minister for Territories taking the place of a state governor in the Northern Territory. Like their governor counterparts, they largely are required to act on the advice of the Northern Territory government. The Australian Capital Territory has no equivalent position, with legislative and executive power devolved directly from the federal government to the ACT Legislative Assembly and the ACT Executive.\nThe monarch or the governor also forms part of state parliaments as per respective state constitutions. However, in case of South Australia, neither the monarch nor the governor forms part of parliament, which only consists of two elected houses. However, bills passed by the Parliament of South Australia and all other state parliaments must be assented to by the governor in the name and on the behalf of the monarch.\nAll the powers and functions of the monarch in relation to the making of an act by a state parliament are exercisable only by the governor of that state. However, if the monarch is present in a state in person, he or she can exercise any of those powers and functions.\nCultural role\nRoyal presence and duties\nThe sovereign and their family have participated in events such as various centennials and bicentennials; Australia Day; the openings of Olympic and other games; award ceremonies; D-Day commemorations; anniversaries of the monarch's accession; and the like.\nOther royals have participated in ceremonies organised by or involving Australia and other Commonwealth nations abroad, such as Charles III, then Prince Charles, at the 2015 Anzac Day ceremonies at Gallipoli, the Duke of Edinburgh at the Anzac Day service in Hyde Park, London in 2024, or the Duke of Sussex's attendance at an Australia House reception for Australian athletes in the 2014 Invictus Games.\nMembers of the royal family have also made private donations to Australian charities or causes, such as when Elizabeth II made a private donation to the Australian Red Cross Appeal after the Blue Mountains bushfires in 2009 and Prince William to the Australian Red Cross during floods in 2023.\nThe Crown and the Australian Defence Force\nsigns a declaration of war against Japan as John Curtin looks on, 1941.]]\nSection 68 of the Australian Constitution says: \"The command in chief of the naval and military forces of the Commonwealth is vested in the governor-general as the Queen's [monarch's] representative.\" In practice, however, the governor-general does not play any part in the Australian Defence Force's command structure other than following the advice of the Minister for Defence in the normal form of executive government. All personnel of the Australian Defence Force swear an Oath of Allegiance (or affirmation) to the Australian Monarch where they pledge to \"resist his (or her) enemies.\"\nAustralian naval vessels bear the prefix ''His Majesty's Australian Ship'' (HMAS) and many organisational groupings of the defence force (such as the Royal Australian Infantry Corps, Royal Australian Air Force and the Royal Australian Engineers) carry the \"royal\" prefix.\nMembers of the royal family have presided over military ceremonies, including Trooping the Colour ceremonies, inspections of the troops, and anniversaries of key battles. When Elizabeth II was in Canberra, she laid wreaths at the Australian War Memorial. In 2003, Elizabeth acted in her capacity as Australian monarch when she dedicated the Australian War Memorial in Hyde Park, London. In 2024, Charles III as part of his tour of Sydney and Canberra, laid wreaths at the Australian War Memorial, as well as presiding over a Royal Fleet Review of the Royal Australian Navy, in Sydney.\ninspects the Royal Australian Corps of Signals as the unit's colonel-in-chief, 2000]]\nMonarchs of Australia (or their spouse in the case of Elizabeth II) are appointed to the highest ranks in each of the branches of the Defence Force. In 2024, Charles III was appointed to the Honorary Ranks of admiral of the fleet of the Royal Australian Navy, field marshal of the Australian Army, and marshal of the Royal Australian Air Force, by the governor-general of Australia. These ranks have always been held by members of the royal family, with the exceptions of field marshals Sir William Birdwood and Sir Thomas Blamey.\nAdditionally, some members of the royal family are Colonels-in-Chief of Australian regiments, including: the Royal Regiment of Australian Artillery; Royal Australian Army Medical Corps; the Royal Australian Armoured Corps and the Royal Australian Corps of Signals, amongst many others.\nAustralian royal symbols\n, adopted in 2024]]\nRoyal symbols are the visual and auditory identifiers of the Australian monarchy. The main symbol of the monarchy is the sovereign. The monarch's portrait has appeared on all Australian coins, with King Charles III's portrait in use for newly minted coins since 2024. The monarch's image also previously appeared on most Australian definitive stamps until 1973. Due to complaints by royalists about this change, the annual Queen's Birthday stamp was introduced in 1980. The monarch has also appeared on the lowest denomination of all Australian banknotes created to-date, with Queen Elizabeth II's portrait currently appearing on the five-dollar banknote. However the Reserve Bank has announced that a new design that depicts Indigenous Australian culture and history instead of the new monarch will replace the existing design.\n. The one-dollar coin replaced this note in 1984.]]\nA crown is depicted on the Queensland and Victorian state badges (which are included on the Australian coat of arms,) and on various medals and awards. For example, the crown's presence on the insignia of the Order of Australia represents the monarch's role as Head of the Order. The sovereign is further both mentioned in and the subject of songs and loyal toasts. Australia inherited the royal anthem \"God Save the King\" (alternatively, \"God Save the Queen\" in the reign of a female monarch) from the United Kingdom. It was the national anthem of Australia until 1984, and has since been retained as the country's royal anthem, its use generally restricted to official occasions where the monarch or a member of the royal family is present.\nHis Majesty The King's Flag for Australia, approved on 30 August 2024 by Charles III, signifies his presence and is displayed when Charles is in Australia. The flag was first used during the 2024 royal visit. The flag is used in the same way as the Royal Standard of the United Kingdom. Where practical, when it is flown on or outside a building, no other flag should be flown with it and is flown when the King is visiting Australia from all buildings, cars, boats or aircraft that he occupies. The flag features the six quarters of the Commonwealth Coat of Arms, surrounded by an ermine border which represents the federation.\nAs in other Commonwealth realms, the King's Official Birthday is a public holiday and, in Australia, is observed on the second Monday in June in all states and territories, except Queensland and Western Australia. In Queensland, it is celebrated on the first Monday in October, and in Western Australia it is usually the last Monday of September or the first Monday of October. Celebrations are mainly official, including the Australian Birthday Honours list and military ceremonies.\nPopular royal symbolism emerged during the reign of Queen Victoria, as a means of encouraging loyalty to the wider British Empire. The Crown symbolised the \"imagined community of a global British people\" with prime minister Joseph Lyons calling it \"the great unifying element in the British Empire\". Queen Elizabeth II stated in 1954 during her Australian tour that \"the Crown is the human link between all the people who owe allegiance to me, an allegiance of mutual love and respect and never of compulsion\". To Australia's Indigenous peoples, the Crown has symbolised the dispossession of their land and the violation of their sovereignty, with the claiming of the east coat of Australia by James Cook done in the name of King George III. However, the Crown has also symbolised protection of Indigenous rights, with several petitions made to the monarch by Indigenous leaders protesting rights violations. The continued presence of royal symbols has been argued to act as a \"social construction of reality\", which reinforces their perception as a \"positive role in national life\". Such symbolism has been criticised as akin to propaganda, that acts to counter arguments against the royals' social and political power.\nReligious role\nUntil its new constitution went into force in 1962, the Anglican Church of Australia was part of the Church of England. Its titular head was consequently the monarch, in his or her capacity as Supreme Governor of the Church of England. However, unlike in England, Anglicanism was never established as a state religion in Australia.\nHistory\nin Sydney]]\nThe development of the Australian monarchy into the independent entity it is today began in 1770, when Captain James Cook, in the name of, and under instruction from, King George III, claimed the east coast of Australia. Colonies were eventually founded across the continent, all of them ruled by the monarch of the United Kingdom, upon the advice of his or her British ministers, the Secretary of State for the Colonies, in particular. In 1901 the six colonies united to form the Commonwealth of Australia, following the assent of Queen Victoria to the Commonwealth of Australia Constitution Act. However, this did not change the relationship of the monarch to the new nation, with her powers (such as the appoint of governors, governors-general and others set out in the Constitution) exercised in accordance with the advice of British ministers.\nThis situation continued until after the First World War, where in response to calls from some Dominions for a re-evaluation of their status under the Crown after their sacrifice and performance in the conflict, the Balfour Declaration of 1926 was issued following a series of Imperial conferences. The statement provided that the United Kingdom and the Dominions were to be \"autonomous communities within the British Empire, equal in status, in no way subordinate to one another in any aspect of their domestic or external affairs, though united by a common allegiance to the Crown\". The Royal and Parliamentary Titles Act 1927, an Act of the Westminster Parliament, was the first indication of a shift in the law,  which ensured the independence of the office. Another move to independence occurred in 1930, when the British government agreed that the Australian Cabinet would advise the sovereign directly on the choice of governor-general. The Crown was further separated by the Statute of Westminster 1931, adopted by Australia in 1942 (retroactive to 3 September 1939).\ninspects the Australian Women's Army Service as the governor-general, 1945]]\nThe Curtin Labor government appointed Prince Henry, Duke of Gloucester, as governor-general during the Second World War. Curtin hoped the appointment might influence the British to despatch men and equipment to the Pacific War, and the selection of the brother of King George VI reaffirmed the important role of the Crown to the Australian nation at that time. Queen Elizabeth II became the first reigning monarch to visit Australia in 1954, greeted by huge crowds across the nation. In 1967, Elizabeth's son, Charles III (then Prince Charles), attended school in Geelong Grammar School in Corio, Victoria. Her grandson Prince Harry undertook a portion of his gap-year living and working in Australia in 2003.\nwith students of his Australian alma mater, Geelong Grammar School, in 2006]]\nThe sovereign did not possess a title unique to Australia until the Australian Parliament enacted the Royal Styles and Titles Act in 1953, after the accession of Elizabeth to the throne, and giving her the title of Queen of the United Kingdom, Australia and Her other Realms and Territories. However, Elizabeth only acted as Queen of Australia at the federal level. At the state level, Elizabeth acted as Queen of the United Kingdom with state laws still subject to the Colonial Laws Validity Act, which meant that UK laws overrode them when inconsistent. While the federal government adopted the Statute of Westminster in 1942, which removed the legislative restrictions of the Colonial Laws Validity Act, the states specifically asked to be excluded from the agreement. This was because they felt their interests were better protected whilst they were under the authority of the UK, which provided a buffer against the increasing power of the federal government.\nThus, the British government could stillat least in theory, if not with some difficulty in practicelegislate for the Australian states, and the governors in the states were appointed by and represented the sovereign of the United Kingdom, not that of Australia. As late as 1976, the British ministry advised the monarch to refuse Colin Hannah another term as Queensland's governor, after seriously considering unilaterally dismissing him due his breach of political impartiality, despite the recommendation of the then state Bjelke-Petersen government for his nomination. Additionally, court cases from state supreme courts could be appealed directly to the Judicial Committee of the Privy Council in London, thereby bypassing the Australian High Court which otherwise could not be appealed in the privy council for federal matters since 1968 and for state matters since 1975. In 1973 reference to the United Kingdom was removed by the Royal Style and Titles Act. Henceforth, the monarch would be styled uniquely as Queen of Australia. Elizabeth signed her assent to the Act at Government House, Canberra that year, leading Senior Vice President of the Labor Party, Jack Egerton, to remark to her, \"They tell me, love, you've been naturalised.\" It was with the passage of the Australia Act 1986, which repealed the Colonial Laws Validity Act and abolished appeals of state cases to London, that the final vestiges of the British monarchy in Australia were removed, leaving a distinct Australian monarchy for the nation. The view in the Republic Advisory Committee's report in 1993 was that if, in 1901, Victoria, as Queen-Empress, symbolised the British Empire of which all Australians were subjects, all of the powers vested in the monarch under Australia's Constitution were now exercised on the advice of the Australian government.\nThe 1999 Australian republic referendum was defeated by 54.4 per cent of the populace, despite polls showing that the majority supported becoming a republic. Many commentators have argued that disagreement between republicans as to the preferred model for a republic (most notably over whether the president should be appointed or directly elected) was a key factor in the \"no\" result. The referendum followed the recommendation of a 1998 Constitutional Convention called to discuss the issue of Australia becoming a republic. The Queen visited Australia a year after the referendum and stated that \"I respect and accept the outcome of the referendum. In the light of the result last November, I shall continue faithfully to serve as Queen of Australia under the Constitution to the very best of my ability\".\nElizabeth II, the longest-serving monarch, died on 8 September 2022, and was succeeded by her son, Charles III. The coronation of Charles III and Camilla took place on 6 May 2023. In October 2024, Charles III became the first reigning King of Australia to visit the country.\nDebate\nPublic polling\nVarious polls have been conducted on public support for the monarchy since at least 1953. These have produced a variety of responses, depending on the specific framing of the question. A peer review analysis of survey data published in the Australian Journal of Political Science in 1993 found that republican sentiment had slowly and stably increased from the 1950s and rose rapidly in the late 1980s and early 1990s such that certain polls indicated a majority or plurality republican support. A follow up analysis published in 2016 found that support for the monarchy reached a low of 34 per cent in 1998 following the 1992 annus horribilis, before rising significantly to around 50% by 2016.\nFollowing the accession of King Charles in September 2022, the number of polls on the republic issue increased, producing a range of responses.\nPolitical debate\nWhereas prime minister Julia Gillard stated that she would like to see Australia become a republic, she, on 21 October 2011, at a reception in the presence of the Queen at Parliament House, asserted that the monarch is \"a vital constitutional part of Australian democracy and would only ever be welcomed as a beloved and respected friend\".  After Kevin Rudd was appointed as prime minister, he affirmed that a republic was still a part of his party's platform and stated his belief that the debate on constitutional change should continue.\nGillard had, during her time as prime minister, propounded that an appropriate time for Australia to become a republic would be after the end of the reign of Queen Elizabeth II. Following Elizabeth's death, the Prime Minister, Anthony Albanese, said in an interview he wanted Australia to have an appointed head of state, but he did not have a timetable for a referendum, did not commit to advising one take place during his time as prime minister, and postulated that no vote should happen until demand rose from the grassroots. Albanese had earlier stated he would, out of respect for Elizabeth, merely refrain from having the governor-general call a referendum before the next election for the House of Representatives.\nRepublicans have dismissed the large public turnouts during royal tours as \"the cult of celebrity\". However, following Prince William's and Catherine's visit to the Blue Mountains after devastating bush fires in 2014, historian Jane Connors opined that \"there is still a sense that having the royal family come to see you is more healing and significant than just having anyone come to see you\", citing comments made by some who had come to the area while the royal couple were present. Academic Holly Randell-Moon has criticised royal visits as reinforcing the legitimacy of white settler possession against Indigenous sovereignty, with celebrity responses to the royals \"obscuring the racial and religious power\" of monarchy.\nFormer governor-general Michael Jeffery argued that the constitutional monarchy has been key to Australia's political stability and lack of civil wars.\nThe idea of a uniquely Australian monarch, resident in Australia, has been voiced occasionally. The proposition was first published in 1867. It was later reiterated by Alan Atkinson in his 1993 book The Muddle Headed Republic, by Harry Meklonian in 2009, and by Richard Hughes in 2017. In a similar vein, Waleed Aly suggested in 2022 replacing the monarch with a life appointed Indigenous \"First Elder\". Another possibility, offered in 2009 by an American constitutional lawyer, would be to crown someone in the line of succession to the Australian throne (such as Prince Andrew and Prince Harry), but who is not expected to become monarch by the present rules of succession.\nList of monarchs of Australia\n{| class=\"wikitable\" style=\"width:100%;\"\n! rowspan=\"3\" style=\"width:8%;\" |Portrait\n! rowspan=\"3\" style=\"width:15%;\" | (Birth–Death) Royal dynasty\n! style=\"width:30%;\" colspan=2 |Reign over Australia\n! rowspan=\"2\" style=\"width:20%;\" |Full name\n! rowspan=\"2\" style=\"width:20%;\" |Consort\n|-\n!Start\n!End\n|-\n! colspan=\"2\" |Royal Style\n! colspan=\"2\" |Major Events\n|- style=\"background:#eee;\"\n| rowspan=\"3\" align=\"center\" |\n| rowspan=\"3\" align=\"center\" |George III(1738–1820)House of Hanover\n|20 January 1788\n|29 January 1820\n|George William Frederick\n| Charlotte of Mecklenburg-Strelitz\n|-\n| colspan=\"2\" |1788-1801: George the Third, by the Grace of God, King of Great Britain, France, and Ireland, Defender of the Faith, &c.\n| colspan=\"2\" rowspan=\"2\" |1788: Beginning of the British colonisation of Australia\n1808-1810: Rum Rebellion\n1811-1820: The Regency\n|-\n| colspan=\"2\" |1801-1820: George the Third, by the Grace of God, of the United Kingdom of Great Britain and Ireland, King, Defender of the Faith\n|- style=\"background:#eee;\"\n| rowspan=\"2\" align=\"center\" |\n| rowspan=\"2\" align=\"center\" |George IV(1762–1830)House of Hanover\n|29 January 1820\n|26 June 1830\n|George Augustus Frederick\n| Caroline of Brunswick\n|-\n| colspan=\"2\" |George the Fourth, by the Grace of God, of the United Kingdom of Great Britain and Ireland, King, Defender of the Faith\n| colspan=\"2\" |1824: Foundation of the NSW Legislative Council\n1825: Establishment of Van Diemen's Land (later Tasmania)\n1829: Establishment of the Swan River Colony (later Western Australia)\n|- style=\"background:#eee;\"\n| rowspan=\"2\" align=\"center\" |\n| rowspan=\"2\" align=\"center\" |William IV(1765–1837)House of Hanover\n|26 June 1830\n|20 June 1837\n|William Henry\n| Adelaide of Saxe-Meiningen\n|-\n| colspan=\"2\" |William the Fourth, by the Grace of God, of the United Kingdom of Great Britain and Ireland, King, Defender of the Faith\n| colspan=\"2\" |1835: Batman's treaty with Wurundjeri elders declared void\n1836: Establishment of South Australia\n|- style=\"background:#eee;\"\n| rowspan=\"3\" align=\"center\" |\n| rowspan=\"3\" align=\"center\" |Victoria(1819–1901)House of Hanover\n|20 June 1837\n|22 January 1901\n|Alexandrina Victoria\n| Albert of Saxe-Coburg and Gotha\n|-\n| colspan=\"2\" |1837-1876: Victoria, by the Grace of God, of the United Kingdom of Great Britain and Ireland, Queen, Defender of the Faith\n| colspan=\"2\" rowspan=\"2\" |1843: First parliamentary election\n1851: Establishment of Victoria\n1854: Eureka Stockade\n1855: Responsible government in New South Wales, Victoria, and Tasmania\n1856: Responsible government in South Australia\n1859: Establishment of Queensland\n1868: End of penal transportation\n1867-1868: First royal visit to Australia (Prince Alfred)\n1881: First visit by a future Sovereign (George V)\n1890: Responsible government in Western Australia\n1901: Federation of Australia\n|-\n| colspan=\"2\" |1876-1901: Victoria, by the Grace of God, of the United Kingdom of Great Britain and Ireland Queen, Defender of the Faith, Empress of India\n|- style=\"background:#eee;\"\n| rowspan=\"3\" align=\"center\" |\n| rowspan=\"3\" align=\"center\" |Edward VII(1841–1910)House of Saxe-Coburg and Gotha\n|22 January 1901\n|6 May 1910\n|Albert Edward\n|Alexandra of Denmark\n|-\n| colspan=\"2\" |1901: Edward the Seventh, by the Grace of God, of the United Kingdom of Great Britain and Ireland King, Defender of the Faith, Emperor of India\n| colspan=\"2\" rowspan=\"2\" |1907: Australia referred to as a dominion for the first time\n|-\n| colspan=\"2\" |1901-1910: Edward the Seventh, by the Grace of God, of the United Kingdom of Great Britain and Ireland and of the British Dominions beyond the Seas King, Defender of the Faith, Emperor of India\n|- style=\"background:#eee;\"\n| rowspan=\"3\" align=\"center\" |\n| rowspan=\"3\" align=\"center\" |George V(1865–1936)House of Saxe-Coburg and Gotha (until 1917)House of Windsor (after 1917)\n|6 May 1910\n|20 January 1936\n|George Frederick Ernest Albert\n|Mary of Teck\n|-\n| colspan=\"2\" |1910-1927: George the Fifth, by the Grace of God, of the United Kingdom of Great Britain and Ireland and of the British Dominions beyond the Seas King, Defender of the Faith, Emperor of India\n| colspan=\"2\" rowspan=\"2\" |1919: Australia signs the Treaty of Versailles\n1920: Visit by future Edward VIII\n1926: Visit by future George VI\n1926: Balfour Declaration\n1931: Statute of Westminster\n1931: First Australian-born governor-general (Issac Issacs)\n1932: Dismissal of premier Lang\n|-\n| colspan=\"2\" |1927-1936: George the Fifth, by the Grace of God, of Great Britain, Ireland, and the British Dominions beyond the Seas King, Defender of the Faith, Emperor of India\n|- style=\"background:#eee;\"\n| rowspan=\"2\" align=\"center\" |\n| rowspan=\"2\" align=\"center\" |Edward VIII(1894–1972)House of Windsor\n|20 January 1936\n|11 December 1936\n|Edward Albert Christian George Andrew Patrick David\n|None\n|-\n| colspan=\"2\" |Edward the Eighth, by the Grace of God, of Great Britain, Ireland, and the British Dominions beyond the Seas King, Defender of the Faith, Emperor of India\n| colspan=\"2\" |1936: Edward VIII abdication crisis\n|- style=\"background:#eee;\"\n| rowspan=\"3\" align=\"center\" |\n| rowspan=\"3\" align=\"center\" |George VI(1895–1952)House of Windsor\n|11 December 1936\n|6 February 1952\n|Albert Frederick Arthur George\n|Elizabeth Bowes-Lyon\n|-\n| colspan=\"2\" |1936-1948: George the Sixth, by the Grace of God, of Great Britain, Ireland, and the British Dominions beyond the Seas King, Defender of the Faith, Emperor of India\n| colspan=\"2\" rowspan=\"2\" |c.1930s-1940s: Emergence of a separate Crown\n1942: Statute of Westminster Adoption Act passed\n1945-1947: Governor-generalship of Prince Henry\n1946: First Australian-born state governor (Sir John Northcott)\n|-\n| colspan=\"2\" |1948-1952: George the Sixth, by the Grace of God, of Great Britain, Ireland, and the British Dominions beyond the Seas King, Defender of the Faith\n|- style=\"background:#eee;\"\n| rowspan=\"5\" align=\"center\" |\n| rowspan=\"5\" align=\"center\" |Elizabeth II(1926–2022)House of Windsor\n|6 February 1952\n|8 September 2022\n|Elizabeth Alexandra Mary\n|Philip Mountbatten\n|-\n| colspan=\"2\" |1952-1953: Elizabeth the Second, by the Grace of God, of Great Britain, Ireland, and the British Dominions beyond the Seas Queen, Defender of the Faith\n| colspan=\"2\" rowspan=\"4\" |1953: Royal Style and Titles Act 1953 passed\n1954: First visit by a reigning Sovereign\n1965: Last British governor-general leaves office (William Sidney)\n1966: Future Charles III attends the Geelong Grammar School in Victoria for one term\n1973: Royal Style and Titles Act 1973 passed\n1975: Dismissal of Prime Minister Whitlam\n1983: Last British state governor leaves office (Richard Trowbridge)\n1986: Australia Acts passed\n1992: Pre-colonial Indigenous land rights recognised in the Mabo case\n1999: United Kingdom legally found to be a \"foreign power\"\n1999: Republic referendum defeated\n|-\n|1953-1973 (Commonwealth): Elizabeth the Second, by the Grace of God, of the United Kingdom, Australia, and her other Realms and Territories Queen, Head of the Commonwealth, Defender of the Faith\n| rowspan=\"2\" |1953-1986 (State): Elizabeth the Second, by the Grace of God, of the United Kingdom of Great Britain and Northern Ireland and of her other Realms and Territories Queen, Head of the Commonwealth, Defender of the Faith\n|-\n|1973-2022 (Commonwealth): Elizabeth the Second, by the Grace of God, Queen of Australia and her other Realms and Territories, Head of the Commonwealth\n|-\n| colspan=\"2\" |1986-2022: Elizabeth the Second, by the Grace of God, Queen of Australia and her other Realms and Territories, Head of the Commonwealth\n|- style=\"background:#eee;\"\n| rowspan=\"2\" align=\"center\" |\n| rowspan=\"2\" align=\"center\" |Charles III(born 1948)House of Windsor\n|8 September 2022\n|Present\n|Charles Philip Arthur George\n|Camilla Shand\n|-\n| colspan=\"2\" |King Charles the Third, by the Grace of God, King of Australia and his other Realms and Territories, Head of the Commonwealth\n| colspan=\"2\" |2024: First visit by a reigning King\n|}\nTimeline\nThis is a graphical lifespan timeline of the monarchs of Australia. They are listed in order of first assuming office.\nThe following chart lists monarchs by lifespan (living monarchs on the green line), with the years outside of their reign in beige.\nImageSize = width:$width height:$height\nPlotArea  = right:10 left:1 bottom:80 top:60\nPeriod    = from:$start till:$end\nTimeAxis  = orientation:horizontal\nLegend    = orientation:vertical columns:1 left:0 top:50 columnwidth:500\nColors =\nid:bg              value:white\nid:lightline       value:rgb(0.8, 0.8, 0.8)\nid:lighttext       value:rgb(0.5, 0.5, 0.5)\nid:LIFESPAN        value:rgb(0.88, 0.90, 0.70) Legend: Lifespan\nid:MONARCH        value:rgb(0.67, 0.67, 0.67)    Legend: Monarch\nid:NAME            value:rgb(0.15, 0.13, 0.05)\nid:TODAY           value:green\nBackgroundColors = canvas:bg\nScaleMinor = gridcolor:lightline unit:year increment:2 start:1730\nScaleMajor = gridcolor:lighttext unit:year increment:10 start:1730\nLineData=\nat:$now color:TODAY width:0.1\nPlotData=\nbar:1 width:18\ncolor:LIFESPAN align:center fontsize:L\nfrom:1738.42 till:1788.05 shift:(-0,$dy) textcolor:NAME text:George III\ncolor:MONARCH\nfrom:1788.05 till:1820.08\nbar:2 width:18\ncolor:LIFESPAN align:center fontsize:L\nfrom:1762.61 till:1820.08 shift:(-0,$dy) textcolor:NAME text:George IV\ncolor:MONARCH\nfrom:1820.08 till:1830.48\nbar:3 width:18\ncolor:LIFESPAN align:center fontsize:L\nfrom:1765.64 till:1830.48 shift:(-0,$dy) textcolor:NAME text:William IV\ncolor:MONARCH\nfrom:1830.48 till:1837.47\nbar:4 width:18\ncolor:LIFESPAN align:center fontsize:L\nfrom:1819.39 till:1837.47 shift:(-0,$dy) textcolor:NAME text:Victoria\ncolor:MONARCH\nfrom:1837.47 till:1901.06\nbar:5 width:18\ncolor:LIFESPAN align:center fontsize:L\nfrom:1841.86 till:1901.06 shift:(-0,$dy) textcolor:NAME text:Edward VII\ncolor:MONARCH\nfrom:1901.06 till:1910.35\nbar:6 width:18\ncolor:LIFESPAN align:center fontsize:L\nfrom:1865.42 till:1910.35 shift:(-0,$dy) textcolor:NAME text:George V\ncolor:MONARCH\nfrom:1910.35 till:1936.05\nbar:7 width:18\ncolor:LIFESPAN align:center fontsize:L\nfrom:1894.48 till:1936.05 shift:(-0,$dy) textcolor:NAME text:Edward VIII\ncolor:MONARCH\nfrom:1936.05 till:1936.95\ncolor:LIFESPAN\nfrom:1936.95 till:1972.41\nbar:8 width:18\ncolor:LIFESPAN align:center fontsize:L\nfrom:1895.95 till:1936.95 shift:(-0,$dy) textcolor:NAME text:George VI\ncolor:MONARCH\nfrom:1936.95 till:1952.1\nbar:9 width:18\ncolor:LIFESPAN align:center fontsize:L\nfrom:1926.3 till:1952.1 shift:(-0,$dy) textcolor:NAME text:Elizabeth II\ncolor:MONARCH\nfrom:1952.1 till:2022.69\nbar:10 width:18\ncolor:LIFESPAN align:center fontsize:L\nfrom:1948.87 till:2022.69 shift:(-0,$dy) textcolor:NAME text:Charles III\ncolor:MONARCH\nfrom:2022.69 till:$now\nTextData =\nfontsize:M\ntextcolor:green\npos:($warning,30)\ntext:Updated /\nTextData =\npos:(340,$height)\nfontsize:L\ntextcolor:black\ntext:\"Lifespan of each Australian monarch\"\n}}\nThe following chart shows monarchs by their age (living monarchs in green), with the years of their reign in blue.\nIII color:pre from:0  till:49.63\nbar:GeorgeIII color:mona from:49.63  till:81.65\nbar:GeorgeIV color:pre from:0  till:57.46\nbar:GeorgeIV color:mona from:57.46  till:67.87\nbar:WilliamIV color:pre from:0  till:64.85\nbar:WilliamIV color:mona from:64.85  till:71.83\nbar:Victoria color:pre from:0  till:18.07\nbar:Victoria color:mona from:18.07  till:81.67\nbar:EdwardVII color:pre from:0  till:59.2\nbar:EdwardVII color:mona from:59.2  till:68.49\nbar:GeorgeV color:pre from:0  till:44.92\nbar:GeorgeV color:mona from:44.92  till:70.63\nbar:EdwardVIII color:pre from:0  till:41.58\nbar:EdwardVIII color:mona from:41.58  till:42.47\nbar:EdwardVIII color:post from:42.47  till:77.93\nbar:GeorgeVI color:pre from:0  till:40.99\nbar:GeorgeVI color:mona from:40.99  till:56.15\nbar:ElizabethII color:pre from:0  till:25.8\nbar:ElizabethII color:mona from:25.8  till:96.38\nbar:CharlesIII color:alive from:0  till:73.82\nbar:CharlesIII color:mona from:73.82  till:\n}}\nSee also\n* Australian State Coach\n* List of Australian organisations with royal patronage\n* Royal tours of Australia\n* List of Commonwealth visits made by Elizabeth II\n* List of prime ministers of Elizabeth II\n* List of sovereign states headed by Elizabeth II\n* Australian peers and baronets\n* Wattle Queen\n* King-in-Parliament\nNotes\nReferences\nSpecific references\nGeneral references\n*\n*\n*\n*\nExternal links\n* [http://www.gg.gov.au Governor-General of Australia (Official website)]\n* [http://www.norepublic.com.au Australians for Constitutional Monarchy (Official website)]\n* [http://www.republic.org.au Australian Republican Movement (Official website)]\n* [http://www.monarchist.org.au Australian Monarchist League (Official website)]\n* [https://www.pmc.gov.au/government/official-australian-portraits-king-and-queen Official Australian portraits of The King and Queen]\n}}"
    }
  ]
}