{
  "content": [
    {
      "type": "text",
      "text": "# Mongol invasion of India (1306)\n\nChagatai Khanate\n| combatant2        =  Delhi Sultanate\n| commander1        =  Kopek\n|  Iqbalmand\n|  Tai-Bu }}\n| commander2        =  Malik Kafur\n|  Malik Tughluq\n|  Shahnah-i-Bargah\n|  Malik Alam }}\n| strength1         =  100,000 (according to Isami)\n| strength2         =  Unknown\n| casualties1       =  60,000 Mongols killed (according to Wassaf)\n| casualties2       =  Comparatively very less\n| notes             =\n}}\nIn 1306, the Chagatai Khanate ruler Duwa sent an expedition to India, to avenge the Mongol defeat in 1305. The invading army included three contingents led by Kopek, Iqbalmand, and Tai-Bu. To check the invaders' advance, the Delhi Sultanate ruler Alauddin Khalji dispatched an army led by Malik Kafur, and supported by other generals such as Malik Tughluq. The Delhi army achieved a decisive victory, killing tens of thousands of the invaders. The Mongol captives were brought to Delhi, where they were either killed or sold into slavery.\nAfter this defeat, the Mongols did not invade the Delhi Sultanate during Alauddin's reign. The victory greatly emboldened Alauddin's general Tughluq, who launched several punitive raids in the Mongol territories of present-day Afghanistan.\nBackground\nDuwa, the ruler of the Mongol Chagatai Khan in Central Asia, had dispatched multiple expeditions to India before 1306. Alauddin Khalji, the ruler of Delhi Sultanate of India, had taken several measures against these invasions. In 1305, Alauddin's forces inflicted a crushing defeat on the Mongols, killing about 20,000 of them. To avenge this defeat, Duwa sent an army led by Kopek to India.\nVarious transcriptions of the name of Duwa Khan's general appear in Indian records. Amir Khusrau calls him \"Kabak\" and \"Kapak\"; Ziauddin Barani calls him \"Kunk\" and \"Gung\"; and Isami calls him \"Kubak\". According to René Grousset, this general was Duwa Khan's son Kebek. However, Kishori Saran Lal believes that this Kopek must have been a different person, because the Indian chronicles state that he was captured and killed in India.\nKopek invaded the Delhi Sultanate with a large army, and advanced up to the Ravi River, ransacking the territories along the way. According to Isami, the Mongol army included 100,000 soldiers, but this figure is considered an exaggeration.\nKopek's defeat\nAlauddin dispatched a force led by his general Malik Kafur to fight the invaders. He promised his soldiers one year's salary as bonus if they were able to defeat the Mongols. Malik Kafur's subordinate commanders included Malik Tughluq (who led the vanguard), Shahnah-i-Bargah (the fief holder of Dipalpur), and Malik Alam.\nThe Delhi army reached the threatened region after a rapid march, and Tughluq's vanguard spotted the Mongol scouts. Soon after Tughluq informed Malik Kafur about the location of the Mongol army, the Delhi army proceeded to the battleground. Khusrau states that the battle was fought on the banks of the Ravi river, but does not provide the exact location. Barani names the place as \"Khekar\" (identified by Peter Jackson as Ghaggar); Abdul Malik Isami calls it \"Hind-i-Ali\"; and Firishta calls it \"Nilab\".\nThe two armies stood face to face for a long time, with neither willing to initiate the attack. At last, Kopek launched an attack, and scattered Malik Kafur's soldiers. However, Malik Kafur soon rallied his men, and completely routed the Mongol army. Kopek was taken captive, when he was about to be killed by the Delhi soldiers.\nOther Mongol contingents\nSome of Kopek's soldiers escaped to the other Mongol contingent led by Iqbalmand and Tai-Bu, and were pursued by the Delhi army. Iqbalmand and Tai-Bu had marched southwards to Nagaur in present-day Rajasthan. The Delhi army, led by Malik Kafur and Malik Tughluq, launched a sudden attack on them. Iqbalmand and Tai-Bu fled across the Indus River, having heard about Kopek's defeat. The Delhi army killed and captured a large number of Mongols in their pursuit.\nAmir Khsurau's writings suggest that Kopek, Iqbalmand and Tai-Bu were commanders of three contingents in the same campaign. However, the later chronicler Ziauddin Barani states that three generals invaded India on three occasions, in different years: Kunk or Gung (Kopek) was defeated at Khekar. Later, another Mongol army led by an unnamed general ransacked the Shivalik region, and was defeated while returning, on the banks of an unnamed river. A third Mongol army, led by Iqbalmand, was defeated at a place called Amir Ali. The later chroniclers such as Nizamuddin and Firishta have adapted Barani's account. Firishta, for example, mentions Kopek's invasion and Iqbalmand's invasion as two campaigns, and states that Iqbalmand was defeated by Ghazi Malik Tughluq.\nHistorian Kishori Saran Lal believes that Khusrau's account is accurate, because he wrote during Alauddin's lifetime. Lal dismisses Barani's account as inaccurate, because it was written much later, and because Barani does not provide specific details about these supposedly three campaigns (such as the year, and the names of the Delhi generals). Moreover, historical evidence indicates that Kopek's invasion was the last Mongol invasion during Alauddin's reign. Barani's contemporary Isami does not mention any other Mongol invasion after Kopek's invasion. Duwa Khan died in 1306-1307, and the Chagatai Khanate was too weak to launch an invasion of India over the next few years. In fact, Alauddin's governor of Dipalpur plundered Kabul, a part of the Chagatai territory, during these years. All these evidences cast doubt on Barani's claim that the Mongols invaded India twice during Alauddin's reign after Kopek's defeat.\nHistorian Peter Jackson also believes that Barani and other later chroniclers misinterpreted Khusrau's account.\nAftermath\nThe Mongols intended to settle down in the Indian territory after capturing it, and therefore, had brought their women and children with them. The Delhi Sultanate army imprisoned these women and children along with the defeated Mongol soldiers, and took them to Delhi.\nTens of thousands of Mongols were killed, including their commander Kopek. According to the contemporary Persian historian Wassaf, the dead Mongols numbered 60,000. Wassaf adds that Alauddin ordered the construction of a tower made of their skulls in front of the Badaun Gate, to serve as a warning to the future generations. Ziauddin Barani, in his Tarikh-i-Firuz Shahi (1357), states that this tower could still be seen in his day.\nThe 16th century chronicler Firishta claims that the Mongol camp originally included 50,000-60,000 people: out of these, less than 3,000-4,000 had survived. Alauddin ordered the male survivors to be trampled under the feet of elephants. The women and children were sold in Delhi and other parts of India.\nAccording to Amir Khusrau, this defeat scared the Mongols so much that they retreated to the mountains of Ghazni. They did not launch any further expeditions into India during Alauddin's reign. On the other hand, Tughluq, Alauddin's governor of Dipalpur, adopted an aggressive policy against the Mongols. Over the next few years, he annually raided Kabul, Ghazni, Kandahar, and Garmsir, which were located on the Mongol frontier. He plundered these territories, and levied tribute on the residents, without any resistance from the Chagatai Khanate. Amir Khusrau, in his Tughluq-Nama, alludes to Tughluq's 20 victories, most of which were against the Mongols. Barani states that Tughluq, who also received the iqta' of Lahore at some point, defeated the Mongols 20 times. The Moroccan traveler Ibn Battuta states that a mosque in Multan had an inscription, in which Tughluq claimed to have defeated the Mongols 29 times. It is uncertain if these victories refer to the above-mentioned raids.\nAn undated letter addressed by the Delhi general Haji Badr to Alauddin's son Khizr Khan suggests that Alauddin's rule extended to Ghazni. When Haji Badr's army arrived in Ghazni one winter, the Mongols of the city and its environs accepted Alauddin's suzerainty. The Friday khutbah at the local Jama Mosque was read in Alauddin's name.\nReferences\nBibliography\n*\n*\n*\n*\n*"
    }
  ]
}