{
  "content": [
    {
      "type": "text",
      "text": "# Mongol invasions of Azerbaijan\n\nThe Mongol invasions and conquests of the territory that now comprises the Republic of Azerbaijan took place during the 13th and 14th centuries and involved large-scale raids. The Mongol invasions of Azerbaijan resulted in the incorporation of the territories of what now comprises Azerbaijan into the newly established Hulagu state.\nFirst invasion\nDuring the first invasion of Azerbaijan by the Mongols in 1220–1223, cities such as Zanjan, Qazvin, Maragha, Ardebil, Bailagan, Barda, Ganja, which were the territory of the Atabegs of Azerbaijan, were destroyed. At that time, there was a political disintegration in the state of Atabegs of Azerbaijan. After the defeat of the Empire of Khorezmshahs, the 20,000 Mongolian expeditionary corps led by the military commanders Jebe and Subutay in the persecution of the last Khorezmshah conquered Iran and attacked the territories of Azerbaijan and other Southern Caucasus countries in 1220. The Mongols invaded from Nakhichevan, driving Atabeg Uzbek from Ganja in Azerbaijan to Tabriz. The Mongols, who entered the territory of Azerbaijan, spent the winter in the Mughan steppe.\nAfter Mongolians defeated some 10,000 Georgians commanded by King George IV \"Lasha\" of Georgia in the fall of 1220, they returned to Arran. They spent the winter in the Mughan steppe and kept their captured treasures in the swampy area between Barda and Beylagan. Thinking that the Mongols would stay in Arran until the Spring, the Georgians began gathering an army, asking for help from Malik Ashraf of Akhlat and Uzbek, the Atabag of Azerbaijan. Subotai and Jebe received reinforcements from Genghis Khan and recruited local Turkish and Kurdish forces under the command of Akush, a disloyal underling of Atabag Uzbek. Subutai and Jebe then marched towards Tbilisi. Close to Tbilisi the Mongols attacked a Georgian force. The Georgians managed to defeat Akush's Turkmen but were slaughtered by the Mongol rearguard.\nThe Mongol forces approached Tabriz and got a ransom from the city in 1221. After destroying the city of Maragha, they attacked Diyarbakir and Ardabil and then again returned to Azerbaijan. Thus, the Mongols marched to the north, plundering Shirvanen route. In addition, Beylagan was plundered in the spring of 1221. This took them through the Caucasus into Alania and the South Russian steppes where the Mongols routed the Rus’-Kipchak armies at the Battle of the Kalka River (1223). Ibn al-Athir described the Mongol invasions of Azerbaijan as follows:\nMongols “rushed to the cities of Azerbaijan and Arran, destroyed them and killed most of their inhabitants. Only a few of them survived, remaining homeless. And all this in less than a year! This has never been known. Having finished with Azerbaijan and Arran, they went to Derbend of Shirvan and captured its (Shirvan’s) cities. Only one fortress survived, where the king of Shirvan was. From there they crossed into the country of the Alans and Lakzes and various other peoples who lived in this area, fiercely exposing them to slaughter, robbery and destruction. Then they rushed to the country of the Kifchaks, and this is among the most numerous Turkic tribes. They killed everyone who came to them, and the rest fled to the thicket and to the tops of the mountains, leaving their country. Tatars seized it as soon as possible\".\nSecond invasion\nThe second invasion of the Mongolians to Azerbaijan is connected with the name of Chormagan Noyon- a military commander of Genghis Khan in the 1230s. This march was organized by the order of the great Khan Ögedei against Jalâl ad-Dîn Khwârazmshâh, who was ruling these areas after putting an end to Atabek's power in Azerbaijanin 1225. Ögedei Khan sent 30,000 men under the command of Chormagan and the Khwarazmians were swept away by the new Mongol army. In the winter of 1231, in the ensuing confusion the Mongols arrived into Azerbaijan from the direction of Khorasan and Rayy. The 30,000 strong Mongol army led by Chormagan easily defeated Jalal ad-Din and occupied northern Iran. Khwarazmshah retreated to Ganja. The Mongols followed him and captured Arran. Jalal ad-Din took refuge in the Mayyafarikin mountains and there in August of that year he was killed.\nAccording to Henry Hoyle Howorth, after the Mongols captured the cities of Maragha and Ardabil, they reached Tabriz. The people of Tabriz saved the city from destruction by paying annual tribute, silver, wine and jewelry. Mongolians entered the Mugan plain in 1233. In 1234, they moved forward to the Araxes River toward Ganja, and in 1235, they captured Ganja and burnt down the city.\nDuring 1244–1255, Arghun Agha was nominated as a civil governor and head of finances in the Mongol-controlled area of Khorasan, Irak-Ajem, Azerbaijan, Shirvan, Kerman, Georgia, and that part of Hindistan.\nIn 1254, the Mongols registered all men over the age of ten and insisted on paying all taxes. All artisans were forced to pay a license tax, and lakes and ponds where they fished, iron mines, and blacksmiths were taxed. They also obtained gold, silver, and precious stones from the merchants.\nThird invasion\nThe third invasion of territories of Azerbaijan by Mongolians is associated with the name of Hulagu Khan. After his brother Möngke's accession as Great Khan in 1251, Hulagu was appointed as administrator of North China, however in the following year, North China was assigned to Kublai and Hulagu tasked with conquering the Abbasid Caliphate. He was given a fifth of the entire Mongol army for the campaign, who were accompanied by families and herds. According to Rašid- al-Din, it was not just a military campaign but also the mass migration of a large portion of the Mongolian people to Persia and the neighboring countries.\nHe destroyed the Nizari Ismaili state and the Abbasid Caliphate in 1256 and 1258 respectively. In 1258, Hulagu proclaimed himself Ilkhan (subordinate khan). The state established in the areas of modern Iran, Azerbaijan, Turkey, and parts of modern Iraq, Syria, Armenia, Georgia, Afghanistan, Turkmenistan, Pakistan, was an attempt to repair of the damage of the previous Mongol invasions.\nThus, the territories of Azerbaijan became a battleground between the Golden Horde and the Hulagu states.\nAfter the death of Keykhatu khan, Ghazan Khan (1295–1304) began to fight with Baydu khan and captured him near Nakhchivan, and then in 1295 Baydu khan was executed in Tabriz. In the same year, Ghazan khan declared himself the ruler of Tabriz and converted to Sunni Islam. He made religious intolerance punishable and attempted to restore relations with non-Muslims. Nawruz (was a son of governor Arghun Aqa) loyalists persecuted Buddhists and Christians to such an extent that Iranian Buddhism never recovered, the Nestorian cathedral in the Mongol capital of Maragha was looted, and churches in Tabriz and Hamadan were destroyed.\nGhazan settled on the Ilkhanid throne in Karabagh in November 1295. According to Rashid ad-Din, \"all the court ladies (khavatin), princes, warlords (umara), pillars of power and court magnates gathered in Karabagh of Arran and without pretense and hypocrisy they agreed to the reign of the sovereign of Islam and gave that commitment\".\nIn March/April, he nominated his brother Öljaitü as his successor, as he had no son his own. Eventually, he died on 17 May 1304 near Qazvin. Öljaitü was the eighth Ilkhanid dynasty ruler from 1304 to 1316 in Tabriz.\nGolden Horde khan Özbeg invaded Azerbaijan in 1319 in coordination with Chagatayid prince Yasa'ur who pledged loyalty to Öljaitü earlier but revolted in 1319. A decisive battle was fought on 20 June 1319 with Ilkhanate victory.\nAbu Sa'id had to face another invasion by Özbeg in 1335 and left to face him, but died on his way in Karabakh, on night of 30 November to 1 December 1335.\nIn consequence of which, Abu Sa'id died without an heir or an appointed successor, thus leaving the Ilkhanate vulnerable, leading to clashes of the major families, such as the Chupanids, the Jalayirids.\nAfter the death of Abu Sa’id, the Chobanids dynasty ruled over Azerbaijan, Arrān, and parts of Asia Minor, Mesopotamia, and west central Persia from 1335 to 1357, until the death of Malek Ashraf.\nIn 1356 Jani Beg conducted a military campaign and conquered the city of Tabriz, installing his own governor there. Soon after this, Jani Beg faced an uprising in Tabriz resulting in the rise to power of the Jalayirid Dynasty, an offshoot of Ilkhanate and, ultimately, in the death of Malik Ashraf in 1357.\nSocio-economic and cultural situation\nDuring the initial Mongol invasions, most cities in Azerbaijan were devastated and only tax-paying ones could escape destruction. The development of science and culture is observed in Azerbaijan during the Hulagu period.\nDuring the first Mongol rule in Azerbaijan, Christianity was tolerated, and several churches were built in Tabriz and Nakhchivan. Even Argun Agha baptized his son in a church in Maragha. After Qazan khan adopted Islam as the official religion of the state in 1295, Christianity in Azerbaijan, with the exception of some Christian communities, reached the point of extinction.\nIn the time of the Mongols, the lands belonging to the khan and his family were called inju, and the lands belonging to the state were called divan. The pasture tax levied on nomadic herdsmen was called gopchur. Tamgha (\"Tamga,\" or \"tamag,\" literally means a stamp or seal in Mongolian tax was levied on craftsmen and merchants.\nThe city of Ganja, which was destroyed in 1239 during the second invasion started to be restored after the third invasion.\nArchitecture\nCircular and square  towers- Mardakan, Ramana, Nardaran – were built in Absheron. Gulustan Mausoleum in the Nakhchevan Jugha village, Karabakhs mausoleum (a complex of Bashtagh ) in Karabakhlar village, Barda Mausoleum (1322) were built.\nRound Tower is a castle located in Mardakan, Baku, Azerbaijan. The castle is also called Shikh fortress by local residents. The height of the Round Mardakan Tower is 16 meters. It is built of limestone and lime solution. The fortress surrounding the tower consists of a square-shaped yard (25x25 m), surrounded by stone walls, seven meters high on each side.\nNardaran Fortress was built in 1301 by architect Mahmud ibn Sa'ad in the northern part of Absheron Peninsula. On 24 October 2001, Nardaran fortress was included on the UNESCO World Heritage Tentative List in Need of Urgent Safeguarding.\nMausoleum in Qarabaghlar village (Azerbaijani: Qarabağlar türbəsi) – is a mausoleum located in Qarabaghlar village of Kangarli Rayon of Azerbaijan, about 30 kilometers far from the north-western part of Nakhchivan. The Qarabaghlar Mausoleum is part of a complex including a tomb and two minarets. The minarets date approximately to the late 12th and early 13th centuries. The portal connecting the two minarets date back to the 14th century. There is a name of Qutui Khatun on this little portal. It is considered that this Qutui Khatun was Hulagu Khan’s (c. 1215 – 8 February 1265) wife. It can make a conclusion that an architect, who set before himself a goal of building in honor of Qutui Khatun within the new complexes built in the 12th–13th centuries, built this monument then. If it's true then it's possible that this building was built in honor of Qutui Khatun.\nBarda Mausoleum was built of burnt and green-blue colored glazed bricks, which makes the word \"Allah\" for more than 200 times. Like in Garabaghlar Mausoleum, unglazed red facing bricks of this mausoleum are laid horizontally, but green-blue glazed bricks – vertically.\nSee also\n* High Middle Ages in Azerbaijan\n* Early Middle Ages in Azerbaijan\n* History of Azerbaijan\n* Bronze and Iron Age in Azerbaijan\n* Stone Age in Azerbaijan\nReferences"
    }
  ]
}