{
  "content": [
    {
      "type": "text",
      "text": "# Mongol invasion of the Khwarazmian Empire\n\n| image_size        =\n| caption           = , five years before the Mongol invasion}}\n| date              = 1219–1221\n| place             = Central Asia, Greater Iran\n| territory         = Khwarezmia annexed to the Mongol Empire\n| result            = Mongol victory\n| combatant1        =  Mongol Empire\n| combatant2        =  Khwarazmian Empire\n| commander1        =\n}}\n| commander2        =\n* Jalal al-Din Mangburni\n* Inalchuq\n* Timur Malik\n* Qaracha}}\n| units1            =\n| units2            = Predominantly city garrisons\n| strength1         = Disputed (see below). Estimates include:\n* 75,000\n* 100,000\n* 120,000\n* 150,000\n* 700,000\n* 800,000\n| strength2         = Disputed (see below). Estimates include:\n* 40,000\n* 200,000\n* 400,000\n| casualties1       = Low\n| notes             =\n| casualties2       = Possibly as high as 10&ndash;15 million people\n}}\nBetween 1219 and 1221, the Mongol forces under Genghis Khan invaded the lands of the Khwarazmian Empire in Central Asia. The campaign, which followed the annexation of the Qara Khitai Khanate, saw widespread devastation and atrocities. The invasion marked the completion of the Mongol conquest of Central Asia, and began the Mongol conquest of Persia.\nBoth belligerents, although large, had been formed recently: the Khwarazmian dynasty had expanded from their homeland to replace the Seljuk Empire in the late 1100s and early 1200s; nearly simultaneously, Genghis Khan had unified the Mongolic peoples and conquered the Western Xia dynasty. Although relations were initially cordial, Genghis was angered by a series of diplomatic provocations. When a senior Mongol diplomat was executed by Khwarazmshah Muhammed II, the Khan mobilized his forces, estimated to be between 90,000 and 200,000 men, and invaded. The Shah's forces were widely dispersed and probably outnumbered—realizing his disadvantage, he decided to garrison his cities individually to bog the Mongols down. However, through excellent organization and planning, the Mongols were able to isolate and conquer the Transoxianan cities of Bukhara, Samarkand, and Gurganj. Genghis and his youngest son Tolui then laid waste to Khorasan, destroying Herat, Nishapur, and Merv, three of the largest cities in the world. Meanwhile, Muhammed II was forced into flight by the forces of Mongol generals Subutai and Jebe; unable to reach any bastions of support, he died destitute on an island in the Caspian Sea. His son and heir Jalal-al Din managed to mobilize substantial forces, defeating a Mongol general at the Battle of Parwan, but these were crushed by Genghis at the Battle of the Indus a few months later.\nAfter clearing up any remaining resistance, Genghis returned to his war against the Jin dynasty in 1223. The war was one of the bloodiest in human history, with total casualties estimated to be between two and fifteen million people. The subjugation of the Khwarazmian lands provided a base for the Mongols' later assaults on Georgia and the rest of Persia; when the empire later divided into separate khanates, the Persian lands formerly ruled by the Khwarazmids would be governed by the Ilkhanate, while the northern cities would be ruled by the Chagatai Khanate. The campaign, which saw the Mongols engage and defeat a non-sinicized state for the first time, was a pivotal moment in the growth of the Mongol Empire.\nBackground\nThe dominant power in late twelfth-century Central Asia was the Qara Khitai, which had been founded by Yelü Dashi in the 1130s. Khwarazm and the Qarakhanids were nominally vassals of the Qara-Khitai, but in practice, due to their large population and extent, they were allowed to operate almost autonomously.Of these two major vassals, the Qarakhanids were by far the more prestigious; they had ruled in the area for two centuries, and controlled many of the richest cities in the region, such as Bukhara, Samarkand, Tashkent and Fergana. By comparison, Khwarazm had only one major city in Urgench, and had only come to prominence after 1150 under Il-Arslan.\nHowever, as the Seljuk Empire slowly fractured after the death of Ahmad Sanjar in 1154, the Khwarazmids were able to take advantage of the chaos due to their geographical proximity; Il-Arslan's son Tekish captured large cities such as Nishapur and Merv in the nearby region of Khorasan, gaining enough power to declare himself a fully-fledged sovereign in 1189. Allying with the Abbasid caliph Al-Nasir, he overthrew the last Seljuk emperor, Toghrul III, in 1194, and usurped the sultanate of Hamadan. Tekish now ruled a great swathe of territory stretching from Hamadan in the west to Nishapur in the east; drawing on his newfound strength, he threatened war with the caliph, who reluctantly accepted him as Sultan of Iran and Khorasan in 1198. The rapid expansion of what was now the Khwarazmian Empire greatly destabilized the Qara-Khitai, which was nominally the overlord. In the early thirteenth century, the khanate would be destabilized further by refugees fleeing the conquests of Genghis Khan, who had begun to establish hegemony over the Mongol tribes.\nMuhammad II became Khwarazmshah after his father Tekish died in 1200. Despite a troubled early start to his reign, which saw conflict with the Ghurids of Afghanistan, he followed his predecessor's expansionist policies by subjugating the Qarakhanids and taking their cities, including Bukhara. In 1211, Kuchlug, a prince of the Naimans, managed to usurp the Qara-Khitai Empire from his father-in-law Yelü Zhilugu with Muhammad's help, but alienated both his subjects and the Khwarazmshah with anti-Muslim measures. As a Mongol detachment led by Jebe hunted him down, Kuchlug fled; meanwhile, Muhammad was able to vassalize the territories of Balochistan and Makran, and to gain the allegiance of the Eldiguzids.\nFollowing the defeat of Kuchlug, their shared enemy, relations between the Mongols and the Khwarazmids were initially strong; however, the Shah soon grew apprehensive regarding his new eastern enemy. The chronicler Al-Nasawi attributes this change in attitude to the memory of an unintended earlier encounter with Mongol troops, whose speed and mobility frightened the Shah. It is also likely that the Shah had grown in pride — like his father, he was now embroiled in a dispute with the Abbasid caliph Al-Nasir, and even went so far as to march on Baghdad with an army, but was repulsed by a blizzard in the Zagros Mountains. Some historians have speculated that the caliph tried to ally with Genghis Khan, especially after Mongol-Khwarazmid relations deteriorated. Mongol historians are adamant that Genghis at that time had no intention of invading the Khwarazmian Empire, and was only interested in trade and even a potential alliance. They cite the fact he was already bogged down in his war against the Jin in China, and that he had to deal with the Hoi-yin Irgen (Tumed) rebellion in Siberia in 1216.\nIn 1218, the Khan sent a large caravan of Mongol merchants to Khwarazmia; it seems probable that a large proportion of the Mongol elite had invested in the expedition, and thus had a personal interest in its success. However, Inalchuq, the governor of the Khwarazmian city of Otrar, seized the caravan's goods and executed its members on charges of espionage. The validity of the accusations has been debated, as has the Shah's involvement; it is certain, though, that he rejected the Khan's subsequent demands that Inalchuq be punished, going so far as to kill one Mongol envoy and humiliate the other two. This was seen as a grave affront to the Khan himself, who considered ambassadors \"as sacred and inviolable\" as the Great Khan himself. He abandoned his war against the Jin, leaving only a small army to pursue it, and gathered as many men as possible to invade Khwarazmia.\nOpposing forces\n.]]\nThe precise sizes of each force have been heavily disputed; the one certainty is that the Mongol army numbered more than the Shah's. The medieval chronicler Rashid al-Din Hamadani attested that the Mongol army numbered over 600,000 strong, and that they were opposed by 400,000 total Khwarazmians; his contemporary Juzjani gives an even greater estimate of 800,000 for the Khan. These numbers are regarded as greatly inflated by modern historians; the only contemporary source regarded as near-reliable is The Secret History of the Mongols, which gives totals of between 100,000 and 135,000 for the Mongol army, although these totals may have been deflated by a pro-Mongol chronicler.\nWhile Stubbs and Rossabi indicate that the total Mongol invasion force cannot have been more than 200,000, Sverdrup, who hypothesizes that a tumen had often been overestimated in size, gives a minimum figure of 75,000. Most historians have given figures between these two extremes: McLynn estimates the Mongol force at around 120,000; while Smith follows the Secret History with a figure of 130,000. The uncertainty is made worse by the high flexibility and efficiency of the Mongol force's operational structure, allowing it to separate and coalesce at will. As for the Khwarazmians, there is no similarly reliable contemporary source; Sverdrup, taking the proportional exaggeration of the Muslim forces as equal to that of the Mongols, has estimated a total of around 40,000 soldiers, excluding certain town militias. Mclynn however provides a much greater figure of 200,000.\nDispositions\nThe Khwarazmshah faced many problems. His empire was vast and newly formed, with a still-developing administration. It is known that in 1218 he had overhauled the Seljuk-era administration, replacing it with a streamlined, loyal bureaucracy; the ongoing change may have contributed to disorder during the Mongol invasion. In addition, his mother Terken Khatun still wielded substantial power in the realm; one historian termed the relationship between the Shah and his mother as 'an uneasy diarchy', which often acted to Muhammad's disadvantage.\nAdditionally, many of the areas that Muhammad charged his troops to defend had been devastated recently by Khwarazmian forces; when later passing through Nishapur, he urged the citizens to repair the fortifications his father had broken down, while Bukhara had been sacked by Muhammad only eight years earlier, in 1212. The Shah also distrusted most of his commanders, with the only exception being his eldest son and heir Jalal al-Din, whose military acumen had been critical on the Irghiz River the previous year. If he had sought open battle, as many of his commanders wished, he would certainly have been greatly outmatched in quantity of troops, let alone quality. The Shah thus made the decision to distribute his forces as garrison troops inside his most important towns, such as Samarkand, Merv and Nishapur.\nGenghis' army was commanded by his most able generals, with the exception of Muqali, who was left behind to continue the war against the Jin. Genghis also brought a large body of Chinese siege and construction experts, including several Chinese who were familiar with gunpowder. Historians have suggested that the Mongol invasion had brought Chinese gunpowder weapons, such as the huochong, to Central Asia.\nCampaign\nEarly movements\n's invasion of Central Asia from 1216 to 1224]]\nThe Khwarazmshah and his advisers assumed that the Mongols would invade through the Dzungarian Gate, the natural mountain pass in between their (now conquered) Qara-Khitai and Khwarazmian empires. One option for the Khwarazmian defence was to advance beyond the towns of the Syr Darya and block the Dzungarian Gate with an army, since it would take Genghis Khan many months to gather his army in Mongolia and advance through the pass after winter had passed.  A Mongol force under Chagatai and Ögedei soon descended onto Otrar from either the Altai Mountains to the north or the Dzungarian Gate and immediately started laying siege to it. Rashid Al-Din stated that Otrar had a garrison of 20,000 while Juvayni claimed 60,000 (horsemen and militia), though like the army figures given in most medieval chronicles, these numbers should be treated with caution and are probably exaggerated by an order of magnitude considering the size of the city.\nof Kyzyl-Kala participated in the resistance against the Mongol invasion.]]\nUnlike most of the other cities, Otrar did not surrender after little fighting, nor did its governor march its army out into the field to be destroyed by the numerically superior Mongols. Instead the garrison remained on the walls and resisted stubbornly, holding out against many attacks. The siege proceeded for five months without results, until a traitor within the walls (Qaracha) who felt no loyalty to the Shah or Inalchuq opened the gates to the Mongols; the princes' forces managed to storm the now unsecured gate and slaughter the majority of the garrison. The citadel, holding the remaining one-tenth of the garrison, held out for another month and was only taken after heavy Mongol casualties. Inalchuq held out until the end, even climbing to the top of the citadel in the last moments of the siege to throw down tiles at the oncoming Mongols and slay many of them in close quarters combat. Genghis killed many of the inhabitants, enslaved the rest, and executed Inalchuq.\npalace in Urgench.]]\nBukhara\nAt this point, the Mongol army was divided into five widely separated groups on opposite ends of the enemy empire. After the Shah did not mount an active defence of the cities on the Syr Darya, Genghis and Tolui, at the head of an army of roughly 50,000 men, skirted the natural defence barrier of the Syr Darya and its fortified cities, and went westwards to lay siege to the city of Bukhara first. To do this, they traversed 300 miles of the seemingly impassable Kyzyl Kum desert by hopping through the various oases, guided most of the way by captured nomads. The Mongols arrived at the gates of Bukhara virtually unnoticed. Many military tacticians regard this surprise entrance to Bukhara as one of the most successful manoeuvres in warfare.\nBukhara was not heavily fortified, with a moat and a single wall, and the citadel typical of Khwarazmian cities. The Bukharan garrison was made up of Turkic soldiers and led by Turkic generals, who attempted to break out on the third day of the siege. Rashid al-Din and Ibn al-Athir state that the city had 20,000 defenders, though Carl Sverdrup contends that it only had a tenth of this number.  A break-out force was annihilated in open battle. The city's leaders opened the gates to the Mongols, though a unit of Turkic defenders held the city's citadel for another twelve days. The Mongols valued artisans' skills highly and artisans were exempted from massacre during the conquests and instead entered into lifelong service as slaves. Thus, when the citadel was taken survivors were executed with the exception of artisans and craftsmen, who were sent back to Mongolia. Young men who had not fought were drafted into the Mongolian army and the rest of the population was sent into slavery in the Mongol Empire. As the Mongol soldiers looted the city, a fire broke out, razing most of the city to the ground.\nSamarkand\nAfter the fall of Bukhara, Genghis headed to the Khwarazmian capital of Samarkand and arrived in March 1220. During this period, the Mongols also waged effective psychological warfare and caused divisions within their foe. The Khan's spies told them of the bitter fighting between the Shah and his mother Terken Khatun, who commanded the allegiance of some of his most senior commanders and his elite Turkic cavalry divisions. Since Mongols and Turks were both steppe peoples, Genghis argued that Terken Khatun and her army should join the Mongols against her treacherous son. Meanwhile, he arranged for deserters to bring letters that said Terken Khatun and some of her generals had allied with the Mongols. This further inflamed the existing divisions in the Khwarazmian Empire, and probably prevented the senior commanders from unifying their forces. Genghis then compounded the damage by repeatedly issuing bogus decrees in the name of either Terken Khatun or Shah Muhammad, further tangling up the already divided Khwarazmian command structure. As a result of the Mongol strategic initiative, speedy manoeuvres, and psychological strategies, all the Khwarazmian generals, including the Queen Mother, kept their forces as a garrison and were defeated in turn.\nSamarkand possessed significantly better fortifications and a larger garrison compared to Bukhara. Juvayni and Rashid al-Din (both writing under Mongol auspices) credit the defenders of the city with 100,000–110,000 men, while Ibn al-Athir states 50,000. A more likely number is perhaps 10,000, considering the city itself had less than 100,000 people total at the time. As Genghis began his siege, his sons Chaghatai and Ögedei joined him after finishing the reduction of Otrar, and the joint Mongol forces launched an assault on the city. The Mongols attacked using prisoners as body shields. On the third day of fighting, the Samarkand garrison launched a counterattack. Feigning retreat, Genghis drew approximately half of the garrison outside the fortifications of Samarkand and slaughtered them in open combat. Shah Muhammad attempted to relieve the city twice, but was driven back. On the fifth day, all but a handful of soldiers surrendered. The remaining soldiers, diehard supporters of the Shah, held out in the citadel. After the fortress fell, Genghis reneged on his surrender terms and executed every soldier who had taken arms against him at Samarkand. The people of Samarkand were ordered to evacuate and assemble in a plain outside the city, where many were killed.\nAbout the time of the fall of Samarkand, Genghis Khan charged Subutai and Jebe, two of the Khan's top generals, with hunting down the Shah. The Shah had fled west with some of his most loyal soldiers and his son, Jalal al-Din, to a small island in the Caspian Sea. It was there, in December 1220, that the Shah died. Most scholars attribute his death to pneumonia, but others cite the sudden shock of the loss of his empire.\nGurganj\nMeanwhile, the wealthy trading city of Gurganj was still in the hands of Khwarazmian forces. Previously, the Shah's mother had ruled Gurganj, but she fled when she learned her son had absconded to the Caspian Sea. She was captured and sent to Mongolia. Khumar Tegin, one of Muhammad's generals, declared himself Sultan of Gurganj. Jochi, who had been on campaign in the north since the invasion, approached the city from that direction, while Genghis, Ögedei, and Chagatai attacked from the south.\n, Empress of the Khwarazmian Empire, known as \"the Queen of the Turks\", held captive by Mongol army. ''Jami' al-tawarikh'', 1430–1434.]]\nThe assault on Gurganj proved to be the most difficult battle of the Mongol invasion. The city was built along the river Amu Darya in a marshy delta area. The soft ground did not lend itself to siege warfare, and there was a lack of large stones for the catapults. The Mongols attacked regardless, and the city fell only after the defenders put up a stout defence, fighting block for block. Mongolian casualties were higher than normal, due to the unaccustomed difficulty of adapting Mongolian tactics to city fighting.\nThe taking of Gurganj was further complicated by continuing tensions between Genghis Khan and his eldest son, Jochi, who had been promised the city as his prize. Jochi's mother was the same person as his three brothers': Genghis Khan's teen bride, and apparent lifelong love, Börte. Only her sons were counted as Genghis's \"official\" sons and successors, rather than those conceived by the Khan’s 500 or so other \"wives and consorts\". But Jochi had been conceived in controversy; in the early days of the Khan's rise to power, Börte was captured and raped while she was held prisoner. Jochi was born nine months later. While Genghis Khan chose to acknowledge him as his oldest son (primarily due to his love for Börte, whom he would have had to reject had he rejected her child), questions had always existed over Jochi's true parentage.\nSuch tensions were present as Jochi engaged in negotiations with the defenders, trying to get them to surrender so that as much of the city as possible was undamaged. This angered Chagatai, and Genghis headed off this fight between siblings by appointing Ögedei the commander of the besieging forces as Gurganj fell. But the removal of Jochi from command, and the sack of a city he considered promised to him, enraged him and estranged him from his father and brothers, and is credited with being a decisive impetus for the later actions of a man who saw his younger brothers promoted over him, despite his own considerable military skills.\nAs usual, the artisans were sent back to Mongolia, young women and children were given to the Mongol soldiers as slaves, and the rest of the population was massacred. The Persian scholar Juvayni states that 50,000 Mongol soldiers were given the task of executing twenty-four Gurganj citizens each, which would mean that 1.2 million people were killed. While this is almost certainly an exaggeration, the sacking of Gurganj is considered one of the bloodiest massacres in human history.\nThen came the complete destruction of the city of Gurganj, south of the Aral Sea. Upon its surrender the Mongols broke the dams and flooded the city, then proceeded to execute the survivors.\nKhorasan\nAfter capturing Balkh in early 1221 and while continuing to besiege Taliqan, Genghis dispatched his youngest son Tolui to Khorasan to make sure that no opposition remained in the extensive and wealthy region. His task was to pacify and subjugate the region and its cities by any means possible, and he carried out the task \"with a thoroughness from which that region has never recovered\", in the words of the historian J.A. Boyle.\n}}\nTolui's army was composed of a tenth of the Mongol invasion force augmented by Khwarazmian conscripts; the historian Carl Sverdrup estimates its size at around 7,000 men. He marched westwards from Balkh to Murichaq, on the present-day Afghanistan–Turkmenistan border, and then crossed the Marghab river and its tributary the Kushk to approach the city of Merv from the south. He ambushed a force of Turkmen raiders during the night of 24 February; the surprise attack caught the raiders off guard, and those who were not killed by the Mongols or did not drown in the river were scattered. The Mongols arrived at Merv the following day. After assessing the city for six days, Tolui came to the conclusion that the city fortifications would withstand a lengthy siege. Having been subjected to a general assault on the seventh day, the townspeople, who twice attempted a sortie to no effect, lost the will to resist and surrendered to the Mongols, who promised to treat them fairly. Tolui, however, reneged on this guarantee, and ordered that the entire population be driven out on the plain and put to the sword, excluding a small number of artisans and children. It was reported that each Mongol soldier was allotted between three and four hundred people to kill; the contemporary chronicler Ibn al-Athir estimated the number of deaths at 700,000, while the chronicler Ata-Malik Juvayni, writing a few decades later, recorded that a cleric spent thirteen days counting the dead and arrived at a figure of 1,300,000.\nTolui had meanwhile marched on south-westerly towards Nishapur, which had already seen a number of events during the war. Muhammad II, the ruler of the Khwarazmian Empire, had arrived nearly a year earlier on 18 April 1220, fleeing the Mongol advance in Transoxiana. He departed in mid-May that year, just in time to escape the armies of Jebe and Subutai, who arrived the following day. The city submitted to the generals, who requested them to reduce their walls and aid any Mongols who passed by. However, the city did not heed these instructions and instead began causing trouble for the Mongols, killing Taghachar when he attempted to enforce control. Jalal al-Din, the eldest son and heir of the now-deceased Muhammad II, arrived at the city on 10 February 1221, attempting to escape the ongoing Mongol siege at Gurganj, the capital of the empire; he remained at the city for only a couple of days before departing in the direction of Zozan.\nTolui arrived at the city on 7 April and the inhabitants, awed by the size of his force, immediately sought to agree surrender terms. Because the killing of the khan's son-in-law had been a grave insult to the Mongols, all proposals were rejected; the assault had begun before the end of the day, with the walls being breached on 9 April and the city captured the next day. According to Juvayni, the city was razed in revenge; Taghachar's widow supervised the massacre of the entire population of the city, with the exception of 400 craftsmen. Unlike in Merv, all children were killed, and the corpses of the alleged 1,747,000 victims, including all the cats and dogs in the city, were piled in great heaps. The ground was subsequently ploughed over. While marching through the region, Tolui was also sending detachments against surrounding towns such as Abiward, Nasa, Tus, and Jajarm.\nThere has been some confusion about the fate of Herat, the last of the great cities of Khorasan. The early 20th-century historian Vasily Bartold, citing a local history from the 1400s, stated that none of the inhabitants were killed with the exception of the garrison; meanwhile, the chronicler Minhaj-i Siraj Juzjani, who fought the Mongols nearby, recorded that after an eight-month siege, the city was taken and its population slaughtered. It is now known, thanks to a chronicle rediscovered in 1944, that there were two sieges of Herat. The first started with the execution of a Mongol diplomat in the town; an incensed Tolui launched an eight-day assault, which culminated in the death of the town's  (governor). From the edge of the city moat, Tolui proclaimed that the inhabitants would be spared if they surrendered. Unlike at Merv, the Mongols honoured their word, only killing the 12,000 men in the city garrison. Having appointed a Mongol overseer to govern the town, Tolui left the region to rejoin  his father at Taliqan in mid-1221. The population subsequently rebelled and were besieged for months by the Mongol general Eljigidei, who was said to have killed between 1,600,000 and 2,400,000 people during his sack of the town, in a massacre lasting seven days in June 1222.\nThe death tolls traditionally attributed to Tolui's campaign in Khorasan are considered exaggerated by modern historians. The cities of Merv, Nishapur, and Herat could have only supported fractions of their reported populations, and populations were reported to return almost miraculously to destroyed cities—Genghis Khan's adopted son Shigi Qutuqu was said to have ordered the deaths of a further 100,000 at Merv in November 1221, after yet another rebellion. The figures do however clearly represent a demographic catastrophe so extreme the native populations found it difficult to quantify the destruction. The historian Michal Biran has suggested that the speed with which the Mongols brought the pragmatically brutal warfare of East Asia into the less ruthless Muslim world was a factor in this cultural shock.\nJalal al-Din\n(spring of 1221). ''Jami' al-tawarikh'', 1430–1434.]]\nAfter the Mongol campaign in Khorasan, the Shah's army was broken. Jalal al-Din, who took power after his father's death, began assembling the remnants of the Khwarazmian army in the south, in the area of Afghanistan. Genghis had dispatched forces to hunt down the gathering army under Jalal al-Din, and the two sides met in September 1221 at the town of Parwan. The engagement was a humiliating defeat for the Mongol forces. Enraged, Genghis headed south himself, and defeated Jalal al-Din on the Indus River. Jalal al-Din, defeated, fled to India. Genghis spent some time on the southern shore of the Indus searching for the new Shah, but failed to find him.\nGenghis sent general Dorbei Doqshin with two tumens to pursue Jalal al-Din, whom he still regarded as a threat, in early 1222; one account has Doqshin failing to secure Jalal al-Din, and returning to the Khan in Samarkand, who was so infuriated Doqshin was sent out at once on the same task. Meanwhile, Jalal al-Din was quarrelling with local princes, but was mostly victorious when it came to battle. Under Doqshin's leadership, the Mongol army took Nandana from one of the lieutenants of Jalal al-Din, sacked it, then proceeded to besiege the larger Multan. The Mongol army managed to breach the wall but the city was defended successfully by the Khwarazmians; due to the hot weather, the Mongols were forced to retreat after 42 days. Peter Jackson suggests that Doqshin, having been instructed not to return unsuccessfully, eventually converted to Islam and joined Jalal al-Din.\nEncouraged by Jalal al-Din's success against the Mongols, the Khwarazmians started an insurgency. Kush Tegin Pahlawan led a revolt in Merv and seized it successfully. After recapturing Merv, Kush Tegin Pahlawan made a successful attack on Bukhara. People in Herat also rebelled and disposed the Mongol vassal leadership. An insurgency leader named Muhammad al-Marghani twice attacked the camp Genghis Khan accommodated at Baghlan and returned with some loot. As a response, Genghis Khan sent a large army under Ögedei back to Ghazni.Saunders, J. J. (2001). [https://books.google.com/books?id=nFx3OlrBMpQC&q=parwan+revolts+mongols&pg=PA61 The History of the Mongol Conquests]. University of Pennsylvania Press. . He actually succeeded in routing a Mongol detachment at Parwan near Kabul in Afghanistan, an event which raised many false hopes and led to fatal uprisings against Mongol rule in Mery, Herat and elsewhere in the autumn of 1221. Genghis Khan appointed Yelü Ahai to restore Mongol sovereignty order in Samarkand and Bukhara. Yelü Ahai managed to restore the order in the cities in 1223. Shigi Qutuqu dealt with the revolt that dethroned the pro-Mongol governance of Merv.\nAftermath\nAfter the defeat of the Khwarazmian Empire, Genghis Khan gathered his forces in Persia and Armenia to return to the Mongolian steppes. Under the suggestion of Subutai, the Mongol army was split into two forces. Genghis Khan led the main army on a raid through Afghanistan and northern India towards Mongolia, while another 20,000 (two tumen) contingent marched through the Caucasus and into Rus', Armenia and Azerbaijan under generals Jebe and Subutai.\nIn the following years Jalal al-Din tried to reestablish the Khwarazmian kingdom, but never fully consolidated his power. He retook control of areas of western Iran, in Kerman, Tabriz, Isfahan and Fars, but was eventually defeated by the Rum Seljuk Sultan Kayqubad I at the Battle of Yassıçemen in 1230. The Mongols came back to conquer the western areas of the former Khwarazmian Empire in 1230–1231, at the time of Genghis Khan's successor Ögedei, who sent an expedition of three tumens led by general Chormaghun. After attempting a defensive strategy, Jalal al-Din finally died in Diyarbakir in 1231. The Mongols under Chormaghun established themselves in northwestern Iran, from where they were able to raid the neighbouring territories of Armenia, Azerbaijan and Mosul during the next ten years, culminating with the invasion of Georgia in 1236.\nThe destruction and absorption of the Khwarazmian Empire would prove to be a sign of things to come, for the Islamic world as well as for Eastern Europe. The new territory proved to be an important stepping stone for the Mongol armies when they invaded Kievan Rus' and Poland during the reign of Genghis' son Ögedei, and future campaigns brought Mongol armies to Hungary and the Baltic Sea. For the Islamic world, the destruction of Khwarazmia left Iraq, Anatolia and Syria wide open. All three regions were eventually subjugated by future khans.\nThe war with Khwarazmia also brought up the important question of succession. Genghis Khan was not young when the war began, and he had four sons, all of whom were fierce warriors and each of them had his own loyal group of followers. Their sibling rivalry almost came to a head during the Siege of Gurganj and Genghis was forced to rely on his third son, Ögedei, who ended the battle. Following the destruction of Gurganj, Genghis officially selected Ögedei to be his successor, and he also ruled that future khans would be the direct descendants of previous rulers. Despite Genghis's establishment of this practice, the four sons would eventually come to blows, and those blows revealed the instability of the khanate that Genghis had created.\nJochi never forgave his father, and he essentially withdrew from future Mongol wars, he moved to the north, and he refused to come to his father when he was ordered to. Indeed, at the time of his death, Genghis Khan was contemplating a march on his rebellious son. The bitterness that resulted from this event was transmitted to Jochi's sons, especially Batu and Berke (of the Golden Horde), who would conquer Kievan Rus'. When the Mamluks of Egypt managed to inflict one of history's most significant defeats on the Mongols at the Battle of Ain Jalut in 1260, Hulagu Khan, one of Genghis Khan's grandsons by his son Tolui, who had sacked Baghdad in 1258, was unable to avenge that defeat when Berke Khan, his cousin (who had converted to Islam), attacked him in the Transcaucasus in order to aid the cause of Islam, and Mongol battled Mongol for the first time. The seeds of that battle began in the conflict with Khwarazmia when their fathers struggled for supremacy.\nSee also\n* Feigned retreat (battle of Samarkand, 1250)\nReferences\nCitations\nSources\n*\n*\n*\n* Chambers, James. ''The Devil's Horsemen: The Mongol Invasion of Europe, Atheneum, 1979. ()\n*\n*\n*\n*\n*\n* Nicolle, David. The Mongol Warlords: Genghis Khan, Kublai Khan, Hulegu, Tamerlane, Brockhampton Press, 1998. ()\n*\n* Saunders, J.J. The History of the Mongol Conquests'', Routledge & Kegan Paul Ltd, 1971. ()\n*\n*\nExternal links\n* A [https://web.archive.org/web/20080420055945/http://www.timespacemap.com/search/eventsearch.htm?_what=%22Mongolian%20Invasion%20of%20Central%20Asia%22&_maptype=2 Map of Events] mentioned in this article."
    }
  ]
}