{
  "content": [
    {
      "type": "text",
      "text": "# Mong Kok culture__disambig_1\n\nMong Kok culture () is a local terminology used in Hong Kong denoting a specific culture in the area of Mong Kok, a culture which has grown rather prevalent amongst local youth and teenagers. The area of Mong Kok is especially known for its plethora of stores and vendors who sell assorted knickknacks, playthings, clothing, tools, electronics, and food, along with all other sorts of novelties. Mong Kok also provides a variety of entertainment, among which includes the cinema, for young adults and teenagers. The multipurpose nature of the area thus draws in teenagers and young adults who avidly pursue the latest popular trends. The area is also a popular meet-up and dating location amongst local youth. Teenagers who have a high affinity for the Mong Kok culture and hang around the area but do not necessarily live there are known as MK people (), and depending on their gender, an MK boy () or MK girl (). Their age typically ranges between 14-25 and often dress in particular styles of clothing, including hip hop or punk, without fully acknowledging the implications of what they wear.\nEssentially, the term MK person, which carries a rather negative undertone, is often used to describe a person who blindly follows trends without thought with the implication that they have a poor taste or behaves in a bad way. It could also mean that he or she has nothing productive to do so as to idly squander their time wandering around the streets of Mong Kok.\nImage of the MK people\nAppearance\nThe origin of their dressing style is believed to be the movie series Young and Dangerous produced in the 1990s, which describes the lives of Hong Kong gangsters and their triad activities. However, some other people believe that it is because this group of people purchase their hip hop clothing in Mong Kok only.\nThe characteristics include their hairstyles, which are preferably dyed into brighter colours such as gold and silver. Another tendency is to have longer bangs that cover their foreheads or even their eyes. Typical Mong Kok culture attire includes: sleeveless shirts, black garments, bell-bottom trousers, and a number of accessories such as chains around trousers, earrings, and necklaces. Advocates and followers of this particular culture also tend to sport tattoos. These tattoos are often situated on their upper arms, which remain visible to those around them because of the prevalence of sleeveless shirts amongst the culture.\nBehaviour\nThose who participle in MK culture are considered to be active on the social-networking sites and online forums, where they can actively share their own lives. This gives them a sense of community for their shared values, and has given a rise to terminology and abbreviations unique to the culture's community.\nFeatures of their spoken language and written language\nPeople who are perceived as a representative of Mong Kok culture always have similar characteristics on their verbal expression and written language. There are several types of features on their use of language, especially the choice of words:\nUnique Terms\nMong Kok culture has a select, unique vocabulary of words that those foreign to the culture may not necessarily understand.\nExample: the labelling of men who always ingratiate women as \"gourmet\".\nUsage of abbreviations\nNotable examples of abbreviations common in their \"language\" include calling Fa Yuen Street as \"Fa Street\", and Argyle Centre as \"M Centre\".\nInterweaving of Profanity in everyday speech\nIt is quite common for advocates of Mong Kok culture to extensively weave in profanities in everyday interactions.\nThe aforementioned idiosyncrasy also appears in their written language. In addition to profanities, they also like to use Martian language, which is formed by using words that have similar or exact pronunciation in Cantonese to replace the original words, or the extensive use of symbols to illustrate their facial expressions when they chat online. Thus, it is often difficult for those foreign to the culture to correctly understand and interpret phrases that are common amongst the users.\nMedia portrayal\nBeing a prominent underground subculture in Hong Kong, Mong Kok culture is often discussed in many forms of media. However, whether it be exaggerated comedy or serious discussion, most media coverage regarding the subculture is held with negative undertones.\nFilms\nYoung and Dangerous (1996)\nThis famous Hong Kong movie series is about a gangster Chan Ho-nam. His clothing, behaviours, and hairstyle in the films became a trend that teenagers in 1996-1997 liked to imitate. The looks of those characters in the films was the beginning of the MK style.\nLan Kwai Fong (2011)\nLan Kwai Fong is a movie series that talks about the lives of people who go to Lan Kwai Fong at night frequently. Although the films are more about going to bars and having sex, the lifestyles of characters are also regarded as MK style nowadays. The series fully shows what MK culture is.\nStars\nMK-pop\nIn 2014, a multitude of singers and pop groups emerged (e.g. FAITH) that tried to replicate the style of K-pop. Their imitations of the style was received negatively by netizens online. Criticisms from netizens often consist of labelling the music as \"MK-pop\". This label comes from the Mong Kok culture being stereotyped as a culture that blindly follows trends in conjunction with groups like FAITH drawing heavy inspiration from K-pop.\nNews\nMong Kok culture frequently appears as a topic in the Apple Daily tabloid. Articles regarding the culture are often blatantly mocking towards the culture.\nReferences"
    }
  ]
}