{
  "content": [
    {
      "type": "text",
      "text": "# Monowar Khan Afridi\n\n}}\nMonovar Khan Afridi  (12 February 1900, Kohat – 16 October 1968) was a Pakistani general and malariologist who made significant contributions to medicine in the early years of the World Health Organization. Apart from his contributions to medicine, Afridi also had a military career and was a Brigadier during World War II. Afridi was one of the founders of the health and medical education system in Pakistan. He was a leading authority in the field of malariology for many years.\nLife and career\nEarly life and education\nMonowar Khan Afridi was born in Kohat, British Raj on 12 February 1900. His father was Khan Bahadur Sharbat Khan  who served in the Indian political service, and his mother was Begum Durrani, the daughter of a landowner named Hamzullah Khan Afridi. Afridi received his education from the Government School in Kohat and pursued medicine at University of the Punjab before completing his Bachelor of Medicine, Bachelor of Surgery (MB ChB) degree at University of St Andrews in 1923. During his time at the university, he developed a Scots accent, which became more pronounced in moments of stress. He then completed a Diploma in Tropical Medicine and Hygiene (DTM&H) in 1924 from the London School of Hygiene and Tropical Medicine.\nMedical career\nFollowing his completion of DTM&H, he joined the Indian Medical Service in 1924. After serving in the military, he specialised in bacteriology and serology, and became a well-known expert in malariology. During his study leave in the United Kingdom, he obtained his Doctor of Medicine from the University of St Andrews in 1931.\nStarting in 1936, Afridi worked as the assistant director of the Malaria Institute in India. Over the course of the next four years, he conducted extensive surveys on malaria in various areas including Delhi, Bahrein, Uttar Pradesh, and Terai. He also implemented measures to combat larva in urban regions.\nWorld War II\nIn 1940 and during World War II, Afridi was called back to military service and worked as a malariologist for the armies operating in Sudan, Iraq, India, and Southeast Asia. He was promoted to the rank of brigadier on 5 August 1944, and he was credited with building up the organisation that helped to solve the problem of malaria among Allied Forces in Southeast Asia. In recognition of his outstanding work, he was appointed Commander of the Order of British Empire.\nAfter WWII\nAfter the Second World War, Afridi returned to his position at the Malaria Institute in India, where he was promoted to director. In 1947, after the partition of the subcontinent, he moved to Pakistan where he established the Malaria Institute of Pakistan and Bureau of Laboratories in Karachi, and served as its first director. He later joined the World Health Organization as deputy regional director to Aly Tewfik Shousha for the Eastern Mediterranean, and subsequently served as the Surgeon General of East Pakistan and then as the director of health services for his home province of the North-West Frontier in West Pakistan.\nAfridi also played a central role in the establishment of Khyber Medical College in Peshawar and is considered as the god-father of the institute.\nFrom 1958 to 1962, he was Vice-Chancellor of the University of Peshawar. In 16 June 1962, Afridi was elected a Chairman of the Executive Board of  in succession to Abu Shama. He served as the president of the 17th World Health Assembly in Geneva in 1964.\nPersonal life and death\nAfridi married Begum Mohtarem in 1927, who was the daughter of Sardar Abdul Ghafoor Khan Tokhi. Together they had five sons and two daughters. Afridi died on 16 October 1968.\nAwards and honours\nAfridi received several awards for his contributions to malariology and world health. He was awarded the Darling Foundation Prize and the Shousha Prize by the  for his contributions to malariology in 1964, and 1969, respectively. He also received the Bose Bequest prize from the Royal College of Physicians of Edinburgh for his outstanding contribution to medicine.\nIn addition to these awards, he was elected as a Fellow of the Royal College of Physicians of London (FRCP) in 1964, a Fellow of the Pakistan Academy of Sciences, and a Fellow of the American Public Health Association. In recognition of his outstanding work, he was appointed Commander of the Order of British Empire.\nMunawar house of Cadet College Kohat is named after him in his honor.\nReferences"
    }
  ]
}