{
  "content": [
    {
      "type": "text",
      "text": "# Monsignor Edward Pace High School\n\n| other_name              =\n| former_name             =\n| type                    = Private, Coeducational\n| religious_affiliation   = Roman Catholic, Marist Brothers\n| established             =\n| opened                  =\n| closed                  =\n| district                = Archdiocese of Miami Department of Schools\n| grades                  = 9–12\n| superintendent          =\n| president               =\n| dean                    = Melanie Otero, Dr. Ramon Rodriguez, Valerie Lloyd, Anthony Walker\n| principal               = Lillian Dubon\n| teaching_staff          = 52 (69% hold Masters/Doctorate degrees)\n| gender                  =\n| age_range               =\n| students                = 900\n| alumni                  = 11,000\n| hours_in_day            = 6\n| campus_size             =\n| campus_type             =\n| team_name               = Spartans\n| rival                   =\n| accreditation           = Southern Association of Colleges and Schools\n| newspaper               =\n| colors                  = Scarlet and Gold\n| slogan                  = \"We Are PACE: Partners, Academics, Catholic, Empowerment\n| song                    = Gratia Et Veritas\n| athletics               = Track and Field, Football, Basketball, Soccer, Flag Football, Swimming, Wrestling, Baseball, Cross Country, Tennis, Volleyball\n| mascot                  = Eddy the Spartan\n| yearbook                = Torch\n| tuition                 = 13,000\n| communities             =\n| feeders                 =\n| website                 =\n| footnotes               =\n}}\nMonsignor Edward Pace High School is a Catholic secondary school in the Opa-locka North neighborhood of Miami Gardens, Florida. It was named a Blue Ribbon School in 2002 and one of the top 50 Catholic high schools in the country in 2004 and 2005 by the Catholic High School Honor Roll. Pace is a member of the National Catholic Educational Association (NCEA). This school is part of the Roman Catholic Archdiocese of Miami.\nHistory\nNamed for Edward A. Pace, the first native-born Floridian to become a diocesan priest, the first all-male, freshmen and sophomore classes commenced in September 1961 in the old parish hall of Our Lady of Perpetual Help on NW 28th Avenue in Opa-Locka. The school was under the direction of Marist Brothers from Cuba and New York. Classes moved to buildings at the school's present site in October 1961. All-female classes were added the next year under the direction of the women of the Teresian Association. The original mascot was the Lion, and the colors were green and white, but students voted in the third year to change the mascot to the Spartan, and the colors to scarlet and gold. The first class of 32 graduated in 1964 at the present day Jackie Gleason Auditorium. Pace's first graduating class created the first newspaper, called the Kerygma (\"The Proclamation\") as well as the first Torch yearbook, which acquired its name from president John F. Kennedy's inauguration speech, in which he referred to passing the \"torch\" to the next generation. Pace's school seal was also designed that year to be engraved on the class rings, and the school's motto was chosen.\nIt was in the 1964–1965 school year that the tradition of \"Freshmen Orientation,\" began in which seniors welcome freshmen, in a tradition that continues. The first co-institutional class graduated in 1966, the same year in which the school's Gratia et Veritas, was composed. Just one year later, the first football team was formed and the school celebrated its first football Homecoming Week, after having had several Spirit Weeks for the basketball team. By 1969, the school had seven buildings, including five academic buildings, a field house, and an on-campus residence for the Teresian Association, which switched homes with the Marist brothers just three years later for a home they felt better suited their lifestyle. The first state championship was won in 1971 by the Cross Country team, in time for a banner to be hung in the new gymnasium, constructed in that school year, along with the adjoining cafeteria. By the 1974-1975 year, after several years of gender-mixing in classes such as math and science, the school became officially co-educational. The first senior trip to Canada took place four years later in February 1979, becoming a tradition for every senior class after it. In Homecoming of 1979, the first King was chosen by the student body, and the Powderpuff game in which boys cheered and girls played flag football, was introduced five years later.\nPace celebrated its 25th anniversary in the 1985–86 school year, and the 25th senior class graduated in 1988. Tons of Love, an annual fall food drive, began in 1987, the first year of the L.I.F.E. (Living In Faith Experience) youth group, a key component of the Campus Ministry Program. In the early 1990s, Pace underwent facility improvements, such as outdoor lockers, school-wide air conditioning, and renovated science labs. The gym was renovated in 1997 and renamed for Brother Felix Anthony, a Marist brother who served as a teacher and basketball coach from 1965-88. Pace's cafetorium, the Spartan Center, was completed in that same year after three years of construction, and the newest classroom building (500) was finished in 1999. In 2002, the school was named a Blue Ribbon School of Excellence at the end of its 40th year, and the 40th class graduated in 2003. The school was named one of the Top 50 Catholic High Schools in this period and received an award for Catholic Identity in 2004. After outgrowing the \"old chapel\" in the school's first building, a new building, the Dantee Navarro Religious Education Center, was completed in 2008 and holds 500 people, although masses are still held in the gymnasium. It was in that same year that Pace was named the first official \"green school\" in South Florida by instituting a recycling program and initiating changes across campus, from lighting to landscaping. Pace celebrated its 50th anniversary in the 2011–2012 school year, and its 50th class graduated in 2013. Archbishop Curley-Notre Dame High School merged into Edward Pace at the start of the 2017–2018 academic year.\nArea\nIt was in the Opa-locka North census-designated place before Miami Gardens incorporated as a city.\nExtracurricular activities\nAthletics\nMonsignor Pace belongs to the Florida High School Athletic Association and fields teams in baseball, basketball, cross country, flag football, football, golf, soccer, softball, swimming, tennis, track and field, volleyball,  wrestling, and cheerleading. Recent state championships include the 2006 class 4A baseball and 2007, and 2008 class 4A boys' basketball titles. Pace has a long-standing athletic rivalry with Belen Jesuit and Key West High School.\nFHSAA State Championships\nBaseball:\n1978, 1980, 1981, 1985, 1988, 2006, 2018\nBoys Basketball:\n1996, 1999, 2003, 2007, 2008\nGirls Basketball:\n2002, 2003, 2005\nWrestling:\n2000, 2016\nFootball:\n2003\nGirls Volleyball:\n1974\nBoys Cross Country:\n1971\nBoys Track and Field:\n2009\nNotable alumni\n*Rakeem Buckles (born 1990), professional basketball player in the Israeli Basketball Premier League\n*Adrian Cardenas, former major league baseball player\n*Alex Fernandez, former major league baseball pitcher\n*Gio González, major league baseball pitcher\n*Catherine Keener, Oscar nominated actress\n*DeMarcus Van Dyke, cornerback for the Pittsburgh Steelers\n*Christian Marrero, hitting coach for the Pittsburgh Pirates, former NPB player for the Orix Buffaloes\n*Stephen Morris, former NFL quarterback\n*Don Newhauser, former major league pitcher for Boston Red Sox (1972–74)\n*Brad Perez, race car driver\n*Dereck Rodriguez, major league baseball player for the San Francisco Giants\n*Jorge Sedano, co-host of 'Sedano & Stink' on ESPN Radio\n*Shemar Stewart, defensive end for the Cincinnati Bengals\n*Steve Tello, Emmy Award winning television producer\n*Anthony Walker Jr., linebacker for the Indianapolis Colts\n*Kayvon Webster, cornerback for the Los Angeles Rams\nNotable faculty\n*Bill O'Reilly, broadcaster and political commentator, former History teacher at MEPHS\nReferences\nExternal links\n* [http://www.pacehs.com Monsignor Edward Pace High School] official website\n* [http://www.privateschoolreview.com/school_ov/school_id/6646 Monsignor Edward Pace High School] on Private School Review"
    }
  ]
}