{
  "content": [
    {
      "type": "text",
      "text": "# Monte Cristi, Dominican Republic\n\n|subdivision_type        =Country\n|subdivision_name        =\n|subdivision_type1       =Province\n|subdivision_name1       =Monte Cristi\n|established_title       =Founded\n|established_date        =1506\n|established_title2      =Municipality since\n|established_date2       =1822\n|area_total_km2          =455.5\n|area_footnotes          =\n|elevation_m             =16\n|elevation_footnotes     =\n|population_total        =42657\n|population_as_of        =2012\n|total_type              =Total\n|population_density_km2  =auto\n|population_blank1_title =Demonym\n|population_blank1       =Montecristeño(a)\n|population_footnotes    =\n|blank_name              =Distance to&nbsp;– Santo Domingo\n|blank_info              =270 km\n|blank1_name             =Municipal Districts\n|blank1_info             =0\n|blank2_name             =Climate\n|blank2_info             =BSh\n}}\nSan Fernando de Monte Cristi, also known as Montecristi, is the capital town of Monte Cristi Province in the Dominican Republic. It is located in the northwest region of the country in a coastal area above the border with Haiti.\nThe town was at the forefront in many of the advances including the first aqueduct, first railroad and telephone in the island. In 1895, it was the site of the signing of the Manifesto of Montecristi by Máximo Gómez and José Martí, at the Gómez home on Mella St. They sailed from \"La Granja\" beach, also in Montecristi, to Cuba to fight for its independence.\nHistory\nMonte Cristi was officially founded by Nicolás de Ovando in 1506 and populated in 1533 by Juan de Bolaños and 63 families from the Canary Islands. The existence of mineral wealth was the incentive to the increase of the Spanish settlement. Years later, in 1545, another family contingent joined and expanded the town. Agriculture and cattle raising were the two main activities of these first settlers of Montecristi. Despite the fact that that town was located in the middle of two sugarcane-producing villages, such as Puerto Plata and Puerto Real, that activity had no significance in Montecristi.\nDuring the 17th century Montecristi was a hotbed of pirate activity in the Caribbean. In 1756 the city became a prosperous trading center, until the early 20th century.\nTowards 1740 the island of Santo Domingo had undergone a substantial change. In the western part of the island, the French had established a separate colony. This signaled the beginnings of a development process for the Spanish colony, which had remained outside the commercial currents for little more than a century.\nIn this vein, the Spanish authorities had begun around 1684 a settlement program with families of Canarian origin, with which they gradually repopulated certain places considered strategic to contain the French advance on the island. One of those was Montecristi, and its new foundation began in 1751. On this occasion, they thought not only about the convenience of establishing a living border, but also about taking advantage of the facilities offered by its port for the development of international trade.\nIn 1756 the ports of Montecristi and Puerto Plata were declared free for ten years, which had a positive impact on community development. By 1785 the population of the town had expanded considerably, if data noted by Antonio Sánchez Valverde in his book Idea about the value of the Spanish island are taken into account, which establishes some 5,550 inhabitants distributed between Puerto Plata and Montecristi.\nIn 1895, it was the site of the signing of the Manifesto of Montecristi by Máximo Gómez and José Martí, at the Gómez home on Mella St. They sailed from \"La Granja\" beach, also in Monte Cristi, to Cuba to fight for its independence.\nSantiago-born educator and feminist Rosa Smester Marrero moved to Monte Cristi in 1913, becoming a teacher of the Higher Normal School of Montecristi and directing the Higher School of Ladies of Montecristi.\nClimate\nMonte Cristi has a hot semi-arid climate (Köppen: BShs, previously As) with a pronounced dry season in the summer, and a wet season in the winter. It has an average temperature of  and an average annual rainfall of . The average evaporation is . Precipitation is highest in the eastern part of the park where the winds collide with the Northern Range and discharge their waters. The same applies to the area of Manzanillo. The same winds hit the Central Cordillera and its extension, the Massif du Nord in Haiti. The effect is felt mainly in the foothills near Loma de Cabrera and Dajabón, and to a lesser extent in Manzanillo.\nHurricanes and tropical storms have little effect on the area of Monte Cristi; however, they can cause increased rains and flooding in the Yaque del Norte River, which brings sediment that affects reefs in the area. During the winter, some cold fronts come from North America, with low temperatures and strong northerly winds. It is also common that cold currents coming down from the Arctic seabed emerge when they hit the island shelf.\n}}\n}}\n|date=\n}}\nAirport\nOsvaldo Virgil Airport is an airport in the Dominican Republic. It serves the city and province of Monte Cristi, in the north of the country. It was out of service for a long time and was put into operation in 2007 after being remodeled by the DA (Airport Department). He was named Osvaldo Virgil, the first Dominican baseball player in the Major Leagues, born in Monte Cristi. Its track and facilities were built under the direction of Montecristeño engineer Manuel Isidor.\nCulture\nWithin the traditions of the province, the patron saint festivities of San Fernando stand out, which are celebrated every May 30 with religious acts, as well as sporting events, dances, bag runs, a fishing tournament, etc.\nAlso the celebration of the day of San Juan Bautista, on June 24 and the Carnival of the Bulls, events that are very crowded. One of its main cultural heritages is the first pyramid of territorial division between the Dominican Republic and Haiti.\nSee also\n*Osvaldo Virgil Airport\n*Monte Cristi Pipe Wreck\n*Monte Cristi National Park\nReferences\nExternal links\n*[https://www.openstreetmap.org/#map=14/19.8486/-71.6438 OpenStreetMap - Monte Cristi]\n*[https://www.google.com/maps/@19.8502708,-71.6404678,6863m/data=!3m1!1e3 Google Maps - Monte Cristi]"
    }
  ]
}