{
  "content": [
    {
      "type": "text",
      "text": "# Monument to Peter I (Azov)\n\n|image         = Азов. Памятник Петру I.jpg\n|caption       =\n|location      = Petrovsky boulevard in Azov, Rostov Oblast, Russia\n|designer      = Oleg Komov, Andrei Kovalchuk\n|type          = Monument\n|material      = Bronze, granite\n|length        =\n|width         =\n|height        =\n|begin         =\n|complete      =\n|open          =\n|dedicated_to  =\n|coordinates   =\n|extra         =\n}}\nMonument to Peter I () is a bronze monument of Peter the Great in the center of Azov, Rostov oblast, Russia. It was designed by sculptors Oleg Komov and Andrey Kovalchuk. The opening ceremony took place on 19 July 1996 and was held in conjunction with the 300-year anniversary of the Russian Navy. The statue is 3 meters tall, not including its 2-metre pedestal. The monument depicts Peter I, a determined, purposeful Russian ruler, as a young (about 22 years old) military figure, with one hand on a mortar.  Peter the Great commanded his army during the Azov campaigns of 1695–96 at that age. He is gazing towards the Azov Fortress.\nHistory\nThe idea of building the monument was being proposed by Azov architects in 1947. At that time they was developing a general plan of Azov under which the monument should have been erected on Rynochnaya square currently known as Petrovskaya square (former square of the 3rd International). This project was embodied 49 years later on Petrovsky boulevard.\nHonored Artist of Russia, academician Oleg Komov created the project of the monument in 1995. His wife Nina Komova, the chief architect V. Fomenko, Andrei Kovalchuk worked together on this sculpture composition also. The statue  was produced at Mytishchi plant of artistic casting. For the pedestal granite monolith boulder was found in Ukraine. The iron mortar was cast at \"Donpressmash\" plant  according to sketches of the chief architect. The monument cost 700 million non denominated Russian rubles. The monument was built  partially with funds from local businessmen.\nSee also\n*List of monuments and memorials in Azov\nReferences\nLiterature\n* Колесник, В. История творит нас, мы творим историю: об истории создания памятника Петру I //В. Колесник //Азовская неделя. – 2001. – 2 августа. – С. 3."
    }
  ]
}