{
  "content": [
    {
      "type": "text",
      "text": "# Monument to Peter I (St. Michael's Castle)\n\nThe Monument to Peter I () is a bronze equestrian monument of Peter the Great in front of the St. Michael's Castle in Saint Petersburg, Russia.\nIn 1716, Emperor Peter the Great commissioned the Italian sculptor Carlo Bartolomeo Rastrelli to design an equestrian statue in commemoration of the Russian victories over Sweden in the Great Northern War. Rastrelli worked for eight years with a model of the monument before it was approved by the emperor in 1724. But as the emperor died the following year, work halted and the sculpture's casting was only completed after the sculptor's death, by 1747, only to remain in a local warehouse, and not to be erected until  53 years later. In the meantime, Catherine the Great had ordered another monument in memory of her predecessor Peter the Great - the Bronze Horseman, the most famous statue of Peter the Great in St Petersburg. At the base of the Bronze Horseman, Catherine even linked her name with Peter the Great, an expression of Catherine's attitude toward her predecessor and her view of her own place in the line of great Russian rulers. Catherine, who, having gained her position through a palace coup, had no legal claim to the throne, was anxious to appear as Peter's rightful heir.\nOnly in 1800, during the reign of Emperor Paul I, was the Monument to Peter I finally erected. It was placed on a pedestal faced with green, red and white-shaded Finnish marble that is decorated with bas-reliefs depicting scenes of two Russian victories over Sweden during the Great Northern War, the Battle of Poltava and the Battle of Hangö, and also an allegorical composition with trophies. The Russian victories at Poltava and near Hangö, Finland helped Russia become the dominant power in the north of the continent. Peter the Great led his troops to both victories.\nBy order of Emperor Paul I, the inscription \"To Great Grandfather from Great Grandson\" (Прадеду - правнук) was made on the pedestal, a subtle but obvious allusion to the Latin \"Petro Primo Catherina Secunda\", the dedication by Catherine the Great on the Bronze Horseman.\nDuring World War II, the equestrian statue of Peter I was removed from its pedestal and sheltered from the 900-day German siege of the city. In 1945, the statue was restored and returned to its pedestal.\nReferences\n*Leningrad : Monumentalnaya i dekorativnaya skulptura 18-19 vekov, ed. E.N. Petrovoy. Chudozestvennye sokravisca SSSR : Moscow, 1951.\n*Pamyatniki architektury Leningrada : Architectural monuments of Leningrad : Glavnoe architekturno-planirovocnoe upravlenye ispolnitelnogo komiteta Leningradskogo gorodskogo Soveta deputatov trudyaschisha, Gosudarstvennaja inspekciya po ochrane pamyatnikov, ed. A.N. Petrov, 4th ed., Leningrad : Stroyizdat, 1976."
    }
  ]
}