{
  "content": [
    {
      "type": "text",
      "text": "# Monument to the Carta Magna and Four Regions of Argentina\n\nMonument to the Carta Magna and Four Regions of Argentina\nThe Monument to the Carta Magna and Four Regions of Argentina is located in the intersection of Del Libertador and Sarmiento Avenues, a landmark site in the Palermo, a neighbourhood of Buenos Aires, Argentina. It is commonly referred to as the\nMonument of the Spanish.\nThe monument was a donation by the Spanish community in celebration of the centenary of the Revolución de Mayo of 1810 (which marked the formal beginning of Argentina's independence from Spain). It is made of  Carrara marble and bronze. The foundation stone was laid in 1910 but it was not completed and inaugurated until 1927.\nHistory\nThe monument in International Eucharistic Congress.\nThe monument is one of the most renowned in the city. Designed by the Catalan sculptor Agustí Querol Subirats, there were several setbacks in the construction of the monument. After Querol’s death, Cipriano Folgueras was assigned the project but he also died in the meantime and so the monument’s rising was further delayed. (The work was later completed by Antonio Moliné.) Another delay was due to a strike by Italian workers in the quarries of Carrara. And another was due to a storm, September 20, 1914, when part of the work was already positioned in Buenos Aires. Due to the storm, the left arm of the marble statue was broken off, and had to be reattached.\nAnother unfortunate event occurred in 1916 when the ocean liner (the Príncipe de Asturias Ship) that was carrying the materials for the monument sank midway.\nIn 1917 Spain requested replacements for lost materials. These were sent two years later, and once arrivals were retained by Customs, causing a bureaucratic mess.\nFinally, the stunning  marble and brass monument was finished and inaugurated in 1927. The monument was inaugurated on March 13, 1927, with a speech by the Argentina president Marcelo T. de Alvear.\nIn 1934 took place in its surroundings closing of the International Eucharistic Congress. For this he covered the monument with a cross of 35 m in height. After Mass, and to the more than one million people attended the event, was heard over the loudspeakers and thanks to a radio broadcast with the Vatican Pope Pius XI bless the present.\nThe event was presided by Cardinal Eugenio Pacelli, the future pope Pius XII.\nCharacteristics\nAt its top is a symbolic statue of the republic with allegoric marble representations of labor and work at its base, and bronze figures that represent the Andes, Pampa, Chaco and de la Plata regions. Its inscriptions include a fragment of the Argentine constitution that proclaims freedom for the country and for any person in the world who wishes the make Argentina their home and also four statements that proclaim the brotherhood of Argentina and Spain, their people, their language and their destiny.\nFile:Allegory of the Andes - 1.jpeg| The Andes\nFile:Allegory of the River Plate.jpeg| River Plate\nFile:Allegory of the Pampa.jpeg| The Pampas\nFile:Allegory of the Chaco.jpeg| The Chaco\nLocation\nLocated in the intersection of Del Libertador and Sarmiento Avenues, in the Palermo Gardens and front to Buenos Aires Zoo.\nGallery\nFile:Monumento de los Españoles3.jpg|\nFile:Monumento de los Españoles2.jpg|\nFile:WLM 2013 - Monumento de los Españoles 2.jpg|\nFile:WLM 2013 - Monumento de los Españoles.jpg|\nFile:La Carta Magna y las 4 regiones argentinas 1060394.JPG|\nFile:La Carta Magna y las 4 regiones argentinas 1060367.JPG|\nFile:La Carta Magna y las 4 regiones argentinas 1060379.JPG|\nFile:La Carta Magna y las 4 regiones argentinas 1060364.JPG|\nReferences\nExternal links\n*http://insidebuenosaires.com/2013/05/07/buenos-aires-monuments-monumento-de-los-espanoles/"
    }
  ]
}