{
  "content": [
    {
      "type": "text",
      "text": "# Monument to innocent murdered\n\n|image         = Monument to innocent murdered.jpg\n|caption       = Monument to innocent murdered from up close\n|location      = Stroiteley Park in Rostov-on-Don, Russia\n|designer      = E. Yemelyanov, P. Ibalakov, L. Kuznetsov\n|type          = Monument\n|material      = Concrete, metal (alloy), marble\n|length        =\n|width         =\n|height        =\n|begin         =\n|complete      =\n|open          =\n|dedicated_to  =\n|coordinates   =\n|extra =\n}}\nMonument to innocent murdered () is a memorial  in the center of Rostov-on-Don, which was erected in memory of people from Rostov Oblast repressed between 1921 and 1961. The opening ceremony of the monument took place on October 30, 1994, during the commemoration of the Day of Remembrance of the Victims of Political Repressions. Rostov Oblast  Association of Victims of Political Repression \"Memorial\" and its chairman, E. Yemelyanova initiated the monument's construction. A rally in memory of victims of political repression and floral tribute are held annually. Between 1921 and 1961, 90,000 people were repressed, 16,300 of which were killed. Burial sites remain unknown.\nDescription\nThree concrete stelae and a mournful wall are main elements of the memorial. The dedication is written on the both sides of the cross: \"To innocent murdered\" (). In front of the sculpture composition there are  marble slabs with List of 192 Gulag camps and  people's names who contributed to erection of the memorial. Symbols of different faiths and a symbol of the communist movement (Hammer, sickle and five-pointed star) are depicted in the back of the central stele. Map of the USSR showing the Gulag work camps locations is depicted on it. Also, the wall provides information on victims of political repression for the country as a whole and for Rostov Oblast in particular.\nThe sculpture composition was vandalized  more than twenty times. The memorial was restored  with funding from the city administration in 2006. Marble facing plates  have been replaced by metal. New information board  was manufactured.\nReferences"
    }
  ]
}