{
  "content": [
    {
      "type": "text",
      "text": "# Monument to the founders of Odesa\n\nMonument to the founders of Odesa (), also known as the monument to Empress Catherine II of Russia and her companions (José de Ribas, François Sainte de Wollant, Platon Zubov and Grigory Potemkin), was a monument located in Odesa, Ukraine, on then Katerynska Square (now European Square).\nThe original monument was built in 1900 by the project of Odesa architect , Sculptor M. Popov, with the participation of sculptors B.V. Eduards and M.D. Mentsione, engineer A. Sikorski. This monument was toppled by the Bolsheviks in 1920. The monument was restored in 2007 with the private funds of Ruslan Tarpan, an Odesa businessman and member of the Odesa City Council.\nAs part of derussification in Ukraine, it was dismantled on 28 December 2022.\nHistory of the monument\nConstruction\nCatherine II of Russia by her rescript in 1794, initiated the beginning of the construction of the city of Odesa and its port on the exact location of the Ottoman settlement Khadjibey. A port located at the location of modern Odesa was first mentioned in 1415 when it was known as Khadjibey.Vermenych, Ya. [http://resource.history.org.ua/cgi-bin/eiu/history.exe?&I21DBN=EIU&P21DBN=EIU&S21STN=1&S21REF=10&S21FMT=eiu_all&C21COM=S&S21CNR=20&S21P01=0&S21P02=0&S21P03=TRN=&S21COLORTERMS=0&S21STR=Odesa_mst Odesa (ОДЕСА)]. Encyclopedia of History of Ukraine. 2010.\nIn 1900, a monument to Catherine and her companions was erected in the city. The opening of the monument took place on 6 May 1900 in the eponymous square in the city center.\nThe prospect of building a Monument to the Founders of the city was offered as early as 1890 at a meeting of the Odesa City Council to discuss the celebration of the 100th anniversary of Odesa.\nOn 23 September 1891 the city council decided to establish a contest for monument projects with two awards (two and one thousand rubles) for the best work.\nBy 1 May 1892 the first prize was awarded to the project with the slogan \"Odesa port\" by Odesa architect Y.&nbsp;M. Dmitrenko the second - under the slogan \"Esperance\" by foreign architect Donato Barkalaja. On 14 January 1893, after a report by the Minister of Internal Affairs to the Emperor, Imperial permission followed to erect a monument to the Founders of the city to commemorate the 100th anniversary of Odesa. The project is estimated to have cost 57 thousand rubles. Models of monument sculpture were manufactured by the professor, Imperial Academy of Arts (St. Petersburg) academician M.P.Popov, and works on building the foundations of a pedestal and casting of bronze figures themselves were commissioned to the sculptor B.V.Eduards  and to the foreman of overall craft council of marble shop in Odesa Leopold Mentsione.\nOpening of the Monument to the Founders was accompanied by solemn ceremonies and citywide celebration, culminating in a fireworks display.\nDestruction\nThree years after the October Revolution, in 1920, the monument was dismantled, as a symbol of the old regime as part of Leninist monumental propaganda efforts. Statues of the Empress's companions have been stored in the Odesa Museum of Regional History, and the figure of the Empress herself was partially destroyed.\nIn 1965, on the 60th anniversary of the uprising at the battleship \"Potemkin\" a monument to its sailors was built in its place.\nReconstruction\nThe first time the idea to restore the Catherine Monument appeared in the late 1980s-early 1990s. Some fund-raising were organized. However, these efforts were unsuccessful. A serious interest in his recovery took shape again in 1995 when the Odesa City Council decided to restore the monument to the Founders of the city using the preserved bronze fragments and adding the missing elements of the granite pedestal. However, these plans were stopped by the President of Ukraine Leonid Kuchma.\nOn 2 July 2007, for consideration of the Odesa City Council, a draft decision named \"On the complex restoration and improvement of Ekaterininskaya Square of Odesa city with reproduction of its historical type\" was submitted. According to this decision, the monument to the sailors of the battleship \"Potemkin\" should be moved to Customs Square, while the original monument should be reconstructed on Ekateriniskaya Square. This decision of the City Council (#1401-V of 4 July 2007) established a special commission to monitor the compliance of the restored monument with the lost original. The project sponsor and the customer of restoration works was City Council deputy Ruslan S. Tarpan.\nRuslan Tarpan: ''\"The desire to restore Ekaterininskaya Square in all its beauty, visible on old postcards, appeared in my youth, that's why I acted as a customer and sponsor of the restoration of this monument. It was thorny, but exciting way for me. It was a matter of honor for me to restore it in that form in which it was at the beginning of the twentieth century, when in 1901 at the World exhibition in Paris, this Square was named as the best in Europe! \"\nHonored architect of Ukraine Professor Vladimir Glazyrin was named as inspector general for all planned works. Many preserved historical documents and photographs of those times were widely used during the reconstruction. Such as a watercolor sketch of the architect Yuri Dmitrenko \"Odesa-port\" project which won in 1892 competition. It was decided to reproduce everything like it was when the monument was opened a century ago, therefore the monument differs from the conceptual design of Dmitrenko. The only external difference from the original monument became four bronze plaques with the names of the Companions of Catherine.\nThe bronze figure of the Empress was made completely newly because it seemed impossible to blend the color of the head preserved in the museum with the rest of the created figure. According to the decision of Ruslan Tarpan, the customer of the reconstruction, a tender was announced for the casting of the Catherine bronze statue. It was won by the \"Artist\" plant from Kyiv, which was already known in Odesa when it cast monuments to other famous Odesa people like singer Leonid Utyosov, aviator Sergei Utochkin, actress Vera Kholodnaya, and others.\nSculpting figures and decoration were carried out by Oleg Chernoivanov and Honored artist of Ukraine Nikolay Oleynik, both also from Kyiv. Work on the production of a 3-meter sculpture was performed in a few months. The figures of the four companions of Catherine, - Potemkin, Zubov, de Ribas and de Wollant, were used after the necessary restoration in their original. these figures have been saved thanks to such significant artists as Maxim Gorky and Benois\nThe approach was especially careful in search of granite samples needed to make the pedestal. The column was made of red granite, mined in the Yemelyanovsky career (also known as \"Zhytomyr granite\"), for the pedestal – from the Yantsevskoye deposit, for staircases - from Novokonstantinovskoye granite deposit in Ukraine. On 19 July 2007 a grand laying of the symbolic stone at the site of the restored monument was held.\nRuslan Tarpan: - \"As in the old Odesa and the same today: in the basis for building foundation was laid a capsule or a granite plate. Similarly, today, in the presence of priests, we made a solemn bookmark of this monument.\"''\nRestoration of the monument required putting in order the entire area around the monument. Within six months the project documentation was created, and archive materials were studied to restore the original appearance and colors of buildings. \"Incor Group\" company conducted a full restoration of  6000 elements of the stucco decorations on the buildings were recreated as well as cast-iron elements like lattice balconies, and gates, which face the square.\nOrthodox priests also objected to the monument since they claimed that at the site of the monument, the construction of a Cossack Church was envisaged according to the city plan of François Sainte de Wollant in 1794 and was then consecrated by Orthodox priests. Protesting against the establishment of the monument, they put a cross in its place at the end of July 2007, this cross was removed on 31 July 2007.\nThe opening ceremony\nOn 27 October 2007 citizens gathered at the opening of the monument.\nThe solemn ceremony was made looking back to the similar of 1900: girls, uniformed as soldiers of Preobrazhensky Life Guards Regiment encircled the monument, and the ladies and gentlemen dressed in costumes of the era of the “golden age” of Catherine were walking around.\nThe monument was covered with a gold cloth. The opening was accompanied by fireworks and salute. After the ceremony the Odesa Philharmonic orchestra played under Hobart Earle (USA).\nThere were numerous attempts to counteract the installation of the monument in Odesa - from the highest authorities - then-President Viktor Yushchenko spoke out against the monument. Representatives of Ukrainian nationalist parties and movements arrived to the city especially to disrupt the opening of the monument. For security reasons Ekaterininskaya Square was surrounded by the police cordon that separated supporters and opponents of the ceremony.\nПригласительный на открытие памятника Основателям Одессы.jpg|Invitation ticket for the opening of the monument to the Founder of Odesa\nПамятник основателям Одессы перед открытием.jpg|The monument to the Founders of Odesa before its opening\nDismantling and move\nProtesters unsuccessfully petitioned for the removal of the monument following the 2014 Revolution of Dignity.\nIn July 2022, amidst the Russian invasion of Ukraine, a petition to the President of Ukraine Volodymyr Zelenskyy regarding the replacement of the monument with a monument to American actor Billy Herrington received more than 25,000 votes. Responding to the petition, President Zelensky asked the Odesa City Council to discuss the removal of the monument.\nThe monument became the object of vandalism, it was repeatedly doused with red paint, an executioner's cap was put over the empress's head, and a hangman's noose was attached to the hand of the empress's sculpture. The monument became surrounded by a seven-meter-high fence.\nOn 28 September 2022 Odesa City Council was unable to decide on the dismantling and relocation of the monument. In November 2022, a petition was created on the website of the Office of the President of Ukraine proposing to exchange the Raccoon of Kherson - a raccoon stolen by Russian forces from Kherson during Russia's withdrawal from the city - for the monument. It received more than 6,500 signatures by 22 November 2022.\nOn 30 November 2022 Odesa City Council supported the decision to dismantle and move the monument. The decision was supported by 43 votes. The same day the city's website announced that the monuments would be temporarily moved to the Odesa Fine Arts Museum. According to a survey most Odesans supported the dismantling of the monument. Mayor of Odesa Gennadiy Trukhanov had been initially against the removal of the monument, but voted in favor in November 2022, referring to the polls that indicated the support for removal.\nAs part of derussification in Ukraine, it was dismantled on 28 December 2022.\nReferences"
    }
  ]
}