{
  "content": [
    {
      "type": "text",
      "text": "# Monument Lab\n\nMonument Lab is a public art project based in Philadelphia, Pennsylvania. Created by curators Paul Farber and Ken Lum and Director of Research Laurie Allen, the project is notable for producing a number of works of public art around the city of Philadelphia, often in collaboration with other organizations. In 2020, Mellon Foundation awarded Monument lab a three-year, $4 million grant to aid the Lab's mission.\nProjects\n2015\nIn May, 2015, in the courtyard of Philadelphia's city hall, Monument lab temporarily installed a shipping container turned voting booth in order to solicit real ideas from passersby about what kinds of monuments they would like to see in Philadelphia. In conjunction,\nParticipating artists:\n* Terry Adkins designed a temporary outdoor meeting place resembling a classroom with benches in order to encourage conversations between people about the matters that bring people together and those that divide them.\n2017\nFrom September 14 to November 10, 2017, Monument Lab began a citywide public art exhibition throughout ten Philadelphia squares and parks in collaboration with the Mural Arts Program, continuing the work of their 2015 Ideas Festival in the Philadelphia City Hall Courtyard. The 2017 program was supported by other notable organizations based in Philadelphia, such as the Pew Center for the Arts, with support for the exhibition provided by the City of Philadelphia Department of Parks, and funding by grants from the William Penn Foundation.\nParticipating artists:\n* Tania Bruguera,\n* Mel Chin,\n* Kara Crombie,\n* Tyree Guyton,\n* Hanks Haacke,\n* David Hartt,\n* Sharon Hayes, created a public installation in Rittenhouse square called \"If They Should Ask\". It consisted of empty monument pedestals with the names of influential women from Philadelphia carved on the bases. The work aimed to speak out about the lack of monuments of women in Philadelphia.\n* King Britt and Joshua Mays,\n* Klip Collective,\n* Duane Linklater,\n* Emeka Ogboh featuring Ursula Rucker,\n* Karyn Olivier,\n* Michelle Angela Ortiz,\n* Kaitlin Pomerantz,\n* RAIR–Recycled Artist in Residency, Alexander Rosenberg,\n* Jamel Shabazz,\n* Hank Willis Thomas, installed a sculpture entitled, “All Power to all people” which consisted of an afro pick standing eight feet tall near Philadelphia city hall.\n* Shira Walinsky,\n* Marisa Williamson.\n2018\nIn 2018 the organization partnered with the University of Pennsylvania and startup company Venturi Labs to produce an app which would allow for patrons to better learn about monuments via their phones. “Over Time” as the app is called, offers self-guided tours around the Philadelphia Art Museum area and allows users to reflect on questions about the monuments and to submit their thoughts through the app.\n2019\nIn 2019, Monument Lab director Paul Farber and Salamishah Tillet, a professor in African American Studies at Rutgers University, developed an installation project in Newark, New Jersey's Military Park. The project was initiated in response to public discourse around a statue in the park designed by Gutzon Borglum in 1926. Critics of the statue have called attention to Borglum's association with the Ku Klux Klan, and the fact that the granite base of his statue in Military Park was recycled from rock used in a confederate monument in Stone Mountain, Georgia. Tillet and Farber commissioned artists Jamel Shabazz, Chakaia Booker, and Manuel Acevedo to propose public art installations in Military Park.\nParticipating artists:\n* Jamel Shabazz installed his piece \"Veterans Peace Project\" in October 2019—a large printed image of a Black U.S. military veteran.\n* Chakaia Booker designed a monument from wood, tires, and iron, titled \"Serendipity.\"\n* Manuel Acevedo. In his piece \"Cam-Up,\"  placed textile veils on Borgulm's statue.\n2021\nOn May 1, 2021, a show entitled, “Staying Power” was installed in conjunction with residents of Northeast Philadelphia's Fairhill-Hartranft and the Village of Arts and Humanities. Public art installations were inspired by a local residents such as Ms. Nandi. The Village of Arts and Humanities received a grant for \"Staying Power\" in 2019.\nParticipating artists:\n* Deborah Willis,\n* Sadie Barnette,\n* Ebony G. Patterson,\n* Courtney Bowles and\n* Mark Strandquist\n*Black Quantum Futurism.\nPodcast Program\nMonument lab has a series of podcasts in which Paul Farber interviews artists and activists about constructed monuments. These podcasts are available on Spotify, Pulitzer Arts Foundation, The Modern Art Notes Podcast, Listen Notes and Stitcher.\nReferences"
    }
  ]
}