{
  "content": [
    {
      "type": "text",
      "text": "# Monument to the Conquerors of Space\n\n| image         = RIAN_archive_557655_Second_Moscow_Watch_Factory_locksmith%27s_family.jpg\n| image_size    =\n| caption       = The monument seen from Cosmonauts Alley in 1967\n| location      = Moscow, Russia\n| mapframe      =\n| designer      =\n| type          =\n| material      =\n| length        =\n| width         =\n| height        =\n| weight        =\n| visitors_num  =\n| visitors_year =\n| begin         =\n| complete      =\n| dedicated     =\n| open          = 1964\n| restore       =\n| dismantled    =\n| dedicated_to  =\n| map_name      =\n| map_text      =\n| map_width     =\n| map_relief    =\n| coordinates   =\n| website       =\n| extra_label   =\n| extra         =\n}}\nThe Monument to the Conquerors of Space (, ) is a giant obelisk in Moscow built in 1964 to celebrate achievements of the Soviet people in space exploration. It depicts a starting rocket that rises on its exhaust plume.\nThe monument is 107 metres (351 feet) tall, has 77° incline, and is made of titanium. The Memorial Museum of Cosmonautics is located inside the base of the monument.\nLocation and surroundings\nThe monument is located outside the main entry to today's Exhibition of Achievements of the National Economy (VDNKh), in the northeastern part of Moscow, near Prospekt Mira (\"Peace Avenue\"). The easiest access is from the VDNKh subway station.\nSince the 1960s, this part of Moscow in general has had a high concentration of space-themed sights and names: besides the monument and the museum under it, the grand \"Cosmos\" pavilion in the Exhibition Centre displayed many artifacts of the Soviet space program. Many streets in the area have been named after the precursors of the space program (Nikolai Kibalchich, Friedrich Zander, Yuri Kondratyuk) and its participants (Sergey Korolyov).\nThe Cosmonauts Alley south of the monument features busts of Soviet cosmonauts.\nThe choice of this part of Moscow for space-related names and monuments may have been inspired by the fact that Prospekt Mira runs toward the north-eastern suburbs of Moscow, where, in Podlipki\n(today's Korolyov City) much of the space program was based. Korolyov himself lived in a house within a few blocks from the monument, which is now preserved as the Korolyov Memorial Museum ().\nHistory\nIn March 1958, a few months after the launch of Sputnik 1, a competition was announced for the best design of an obelisk celebrating the dawn of the Space Age. Out of some 350 proposals, the design by sculptor A.P. Faidysh-Krandievsky and architects A.N. Kolchin and M.O. Barshch was chosen. The grand opening of the monument took place on October 4, 1964, on the day of the 7th anniversary of the Sputnik 1 launch.\nThe monument was designed to accommodate a museum in its base. However, it took until April 10, 1981 (two days before the 20th anniversary of Yuri Gagarin's flight) to complete the\npreparatory work and open the Memorial Museum of Cosmonautics. The museum reopened on April 12, 2009, after three years of renovations.\nDesign and sculpture\nThe main part of the monument is a giant obelisk topped by a rocket and resembling in shape the exhaust plume of the rocket. It is 107 meters (350&nbsp;feet) tall and, on Korolyov's suggestion, covered with titanium cladding. A statue of Konstantin Tsiolkovsky, the precursor of astronautics, is located in front of the obelisk.\nBoth sides of the monument base, in their front parts, are decorated with haut- and bas-reliefs depicting men and women of the space program:\nscientists, engineers, workers, their occupations indicated by appropriate accoutrements of the professions. Notable figures include a computer programmer (or perhaps some other computing or telecommunications professional) holding a punched tape, a cosmonaut wearing a space suit, and Laika the space dog, first living creature to orbit Earth.\nNo contemporary Soviet politicians are depicted in the monument (that would violate the convention existing in the post-Joseph Stalin Soviet Union against commemorating living persons in this fashion), but the crowd on the right side of the monument are moving forward under the banner of Vladimir Lenin.\nThe monument reflected in other media\nThe Monument to the Conquerors of Space is featured on the 1967 10&nbsp;kopeck piece, one of the series of the commemorative coins issued to celebrate the 50th anniversary of the October Revolution. This coin has the distinction of being the smallest-denomination commemorative coin ever minted in the Soviet Union. (It was the smallest coin in the 1967 series—the only time commemorative fractional currency coins were ever produced in the USSR. All later commemorative coins were either 1&nbsp;rouble, or a higher denomination).\nImage:RR3005-0001 Soviet Union-1967-Coin-0.10. 50 Years of Soviet Power.jpg|10 kopeck anniversary coin celebrating 50 years of the October Revolution.\nThe Monument is featured in the 1993 music video \"Go West\" by Pet Shop Boys.\nAlso monument featured in the music video \"Sweet Lullaby\" by Deep Forest.\nThe monument was depicted on the home kit for the Russia national football team for the 2014 FIFA World Cup on the front of the shirts in different shades of maroon.\nThe monument also featured on the back page of the 1964, no. 11, Soviet Woman.\nReplicas\nThe monument to Konstantin Tsiolkovsky in downtown Borovsk, designed by Sergey Bychkov, contains a nearly exact scale replica of the Conquerors of Space \"rocket needle\" and a whimsical statue of Tsiolkovsky gazing into the skies (and wearing valenki boots). It was unveiled in 2007. A copy of this statue (but not the \"rocket needle\") is installed at the Sir Thomas Brisbane Planetarium. A copy is also exhibited in the park of the United Nations Office in Geneva, a gift donated by the USSR and designed by the architect Alexander Koltchin and sculptor Yuri Neroda.\nSee also\n* Memorial Museum of Cosmonautics\n* Cosmonauts Alley\nReferences\nExternal links\n*[http://www.cosmomuseum.ru/ Official Site of the Memorial Museum of Cosmonautics]\n*[http://www.museum.ru/M329 Memorial Museum of Cosmonautics]\n*[https://web.archive.org/web/20070122173115/http://svao.mos.ru/about/places/cosmos/  Monuments to the Conquerors of Space] (Official site of Moscow's North-Eastern Administrative Okrug)\n*[https://web.archive.org/web/20070929091323/http://www.kultura-portal.ru/tree_new/cultpaper/article.jsp?number=635&rubric_id=218 Anna Martovitskaya, \"The Launch Vehicle: Cosmonautics Museum is preparing for a renovation\"] (Kultura, No.14 (7524) 13–16 April 2006)\n*[http://www.rg.ru/2006/08/02/museo-kosm.html Kristina Polishchuk, \"Cosmonautics Museum will soon surprise its visitors with new exhibits\"] (Rossiyskaya Gazeta, 2 August 2006)\n*[http://russianuniverse.org/2013/04/03/monument-to-the-conquerors-of-space/ The Monument to the Conquerors of Space]"
    }
  ]
}