{
  "content": [
    {
      "type": "text",
      "text": "# Monument to Elena Pavlovna \"On the Island\"__disambig_1\n\nMonument to Elena Pavlovna “On the Island” () is a lost monument in Pavlovsk, Saint Petersburg, Russia.\nIt was a marble prism standing on a pedestal (made of Olonets marble); on one of its sides, there was a filleted recess holding a marble slab and an inscription with gilded copper letters \"September 12, 1803\". Above the prism, there stood a dark-red porphyry vase, on which bronze birds were perched. On the opposite side was a bas-relief by Ivan Martos: the genius of death with a wreath of roses (a symbol of marital happiness) in his right hand and an overturned torch (a symbol of death) in his left. The lowered hand, the bowed head, and the outline of the wings of the genius were repeated in the rounded outline of the upper part of the recess. The inscription on the bas-relief read \"Иван Петрович Мартос из Ични делал 1806 год\" (Ivan Petrovich Martos from Ichnia made it in 1806). The master considered this monument one of his best works.\nThe monument was erected by the order of the widowed Empress Maria Feodorovna in 1806 on the \"island under the flag\" – a small island on the Slavyanka River below the Mariental dam, where a flagpole with a flag was erected, which was raised when the owners of Pavlovsk visited the estate. Elena Pavlovna, to whom the monument is dedicated, was the daughter of Paul I, who died at the age of 18 on September 12 (24), 1803, four years after her marriage.\nAfter 1917, the bronze birds disappeared from the vase.\nDuring Hitler's occupation, the dam system was destroyed, the flow of the Slavyanka changed, the island under the flag was eroded, and in 1948 the monument was dismantled. In 1944, the bas-relief was removed for restoration and placed in the museum collection; it is exhibited in the Orchestral Room together with the monument to Alexandra Pavlovna, the second daughter of Paul, who also died early after marriage abroad.\nReferences\nLiterature\n* }}"
    }
  ]
}