{
  "content": [
    {
      "type": "text",
      "text": "# Monuments of Champaner-Pavagadh Archaeological Park\n\nThere are eleven different types of buildings at the UNESCO-protected Champaner-Pavagadh Archaeological Park in Gujarat, India, including mosques, temples, granaries, tombs, wells, walls, and terraces. The monuments are situated at the foot of and around the Pavagadh Hill. The Baroda Heritage Trust lists 114 monuments in the area, of which only 39 are maintained by the Archaeological Survey of India, due to limited funding. The Forest Department owns 94% of the land here, while the temple trusts and other sectarian establishments provide facilities for boarding and lodging to pilgrims and tourists. On the southern side near the foot of the hill some dilapidated houses and the foundations of Jain temples can also be seen.\nSome of the major monuments are as follows:\nReligious buildings\nMosques\nAmong the five mosques which are in very good condition, the Jama Masjid (also spelled \"Jami Masjid\") near the east gate, built by Sultan Begada,  is one of the most notable of the 114 monuments listed by the Baroda Heritage Trust. It has a blend of Hindu and Muslim architecture preserving the Islamic ethos and is considered one of the finest mosques in Western India with its elegant interiors. The masjid is built over a high plinth, has a central dome, two minarets, each  high, 172 pillars, seven mihrabs and ornately carved entry gates fitted with stone jalis. The Mughal architecture is said to have drawn from the architecture of the Sultanates, which is a blend of Hindu religious connotations and workmanship with Muslim ethos; the large domes are indicative of such a mix. In the Jami Masjid, the ornamentation of the surface areas of the mosque and tomb consist of symbols of motifs of the Sun, diamonds, pots and vines, and lotus insignia which were used in the earlier temples; the artists of the region who worked on these monuments had imbibed their craftsmanship from their forefathers and they were not sectarian in character as they worked as per assignments given by Hindus, Muslims or Jains. Tombs have been built adjacent to mosques, invariably to a square plan with columns and domes erected over them, and also embellished with decorations.\nOther notable mosques in the heritage area are: the Kevada Masjid, the Ek Minarka Masjid (single dome mosque); the Panch Mahuda ka masjid (five domed mosque) in a forested area; the Shehrka Masjid (city mosque), an elegant structure located inside the citadel; and the Nagina Masjid (jewel mosque), about  to the south of the citadel, built with pure white stone; a stepwell decorated with arches is close to this mosque.\nJami Masjid\nJami Masjid is located about  east of the city walls (Jahdnpandh). It dates to 1513; construction was carried out over 125 years. The mosque is a place of pilgrimage for those who seek blessings from the pir who is buried in one corner of the mosque gardens. The two impressive towers at the entrance of the masjid and the fine blend of Hindu and Islamic architecture are stated to constitute a fine model of \"symmetrical composition, perfection of details and decorative beauty particularly intricately carved ceiling of prayer hall.\"\nThe building is double-storied, with both Islamic and Hindu styles of decoration. Its plan is similar to that of the Sidi Saiyyed Mosque in Ahmedabad. It is rectangular with the entrance on the east side. There is a portico which has a large dome built over a podium. There are steps to the mosque from northern and southern directions. Towering minarets,  in height, are situated on both sides of the main carved entrance. There are two floors of open arcade with decorative carvings and jaali over the courtyard with pillars. The two minarets at the entrance are octagonal in shape. The prayer hall has eleven domes with the central dome, a double-storied structure, built on pillars in an arcade form. A typical Gujarat style of architecture is seen in the form of oriel windows with distinctive carvings on the outer surface. An ablution tank of octagonal kund appearance was used for rainwater harvesting and washing before prayer. The carved roof contains several domes, and the courtyard is large. There are seven mihrabs, and the entrance gates are carved and fitted with fine stone jalis. This mosque had three oblong mural plaques, one at the top of the pulpit and the other two on the sides, with engravings of hymns from the Koran. Of the two minarets, one was damaged by an intentional gun firing in 1812 by Patankar, a Scindia Governor considered a “tyrant.”\nKevda Masjid and cenotaph\nThe mosque at Kevda Masjid and cenotaph has minarets, globe-like domes, and narrow stairs. According to Ruggles (2008), nature was integrated into the Kevada mosque's architecture in a way that was unusual for the Islamic world. The masjid has many mihrabs.\nThis mosque was built in Champaner during the time of Mahmud Begada, as were several other masjids, such as the Bawaman, Ek Minar, Jama, Khajuri, Nagina, and Shahar Ki. After James Burgess and Henry Cousens wrote descriptions of the Kevada, Jama, and Nagina Masjid, roads were built to reach them. The Kevada is notable because of its mausoleum. Kathra Masjid is west of the Kevada.\nNagina Masjid and cenotaph\nNagina Masjid and cenotaph is about  to the south of the citadel and is built with pure white stone. It is a large monument built on a high-rise plinth with a large open yard in the front. At the main entrance, the masjid is marked by minarets with intricate and elegant carvings; as in other masjids like Kevada Masjid, it has floral designs in its niches. Three large domes are seen over the main prayer hall (a two-storied structure with balcony), which are built over decorative columns and windows. There is stone pulverization on the building's pillars.\nWithin the precincts of the masjid there are a few brick structures, and step wells. Northeast of the masjid is the cenotaph, which has openings on all four sides and whose frontage, columns and niches are artistically carved with floral and geometrical designs. A series of beautifully designed projecting corbels and the projecting cornice are also notable; geometric motifs at regular intervals give a beautifying effect. Similar motifs are seen both inside and outside, at the platform level. The cenotaph's central dome has disappeared.\nLila Gumbaj Ki Masjid\nLila Gumbaj Ki Masjid stands on a high plinth and has a frontage with arched entrance at the center flanked by two lateral arches. The central arch is a structure of well spaced minarets fashioned with horizontal cornices and mouldings; the niches have decorations. There are three mehrabs in the prayer hall and these are decorated with a central suspended kalash carved with floral motifs. Of the three domes, the one at the center has a fluted design and is colourful. Initially three entrances existed on the east, south, and north sides. On the north-east corner there is a rectangular ablution tank with a deep drain in front. The building is situated northeast of Jami Masjid. Stone pulverization has been observed on the masjid's pillars.\nSahar Ki Masjid\nThis masjid near the royal palace, very large and imposing, was for the exclusive use of the Sultans. It has five mehrabs. At the front, the entrance has an arched doorway with a large dome, with smaller domes at the four sides and minarets on either side embellished with a projection which is inclined chhajja. The other two openings flanking the central doorway are embellished with jharokhas. A rectangular ablution tank is seen on the platform.\nBawaman Mosque\nThis mosque, located on the western side of the fort gate, is named after Bawaman, a follower of Sadan Shah revered as a saint. Built on a raised platform on a high plinth, the mosque has a minaret, three large domes, three mehrabs on the rear wall and three arched entrances. There are also ablution tanks close to the mosque. Many of its structural elements are damaged.\nKamani Masjid\nKamani Masjid is so named since it has architectural features of pillars and arches in the hall. The central hall also has a marble-roofed dome fixed with glazed tiles. It is situated near the distant signal of Pavagadh's railroad station in the northbound direction, towards Sivarajpur.\nEk-Minar Ki Masjid\nThis masjid built by Bahadur Shah (1526–36 AD) on a high plinth has a single minaret (Ek-Minar), while all other architectural features have disappeared.\nPanch-Mahuda-Ki Masjid, Halol\nThis masjid, also built on a high platform, is severely damaged and only the corner minarets can be seen.\nTemples\nLakulisa temple\nThe earliest temple on the Pavagadh hill in the Mauliya plateau is dated to the 10th–11th centuries and is dedicated to Lakulisa. However, the temple is in ruins, with only the gudha mandapa (sanctum sanctorum) and Ardha mandapa part of the antarala now present. Lakulisha, Dakshinmurthi, Brahma, Vishnu, Gajendra Moksha, various forms of Shiva, Indra, seated Ambika and Sura Sundaris are the images seen in this temple. The temple was built in the Nagara style of architecture with garbhagriha, mandapa and an entrance porch. It had ornate decorations, mostly stone carvings.\nMahaKali Mata Temple\nThe most visited temple on the hill (summit ) is the MahaKali Mata Temple, the oldest in the area (10th-11th centuries). It has three images of goddesses: the central image is of MahaKali Mata, flanked by Kali on the right and Bahucharamata on the left. The spire of this temple carries a shrine of Sadanandsha Pir, a Muslim ‘pir’ or “saint”  held in great reverence in the region. It is the third of the major Shakti Peethas of Gujarat and is known for tantric worship. The temple has large fortifications and an open chowk in front, with two altars for sacrifices and an array of lights for special occasions. The idol of MahaKali Mata in the inner sanctum is only the head, the mukhwato, painted in red. Also present are full idols of Mahakali and the yantras of Bahuchara. The temple is open from very early to quite late every day, to accommodate pilgrims arriving at all hours. The Machi Haveli is a rest house available to pilgrims. To reach the temple at the summit is about a  walk along a jungle footpath to the top of the hill. However, it is also accessible by a mono-cable ropeway  in length which can carry 1,200 people per hour and is stated to be the country's highest ropeway. On Chaitra sud 8, during navaratri (nine-day festival), a fair is held at the MahaKali Mata temple which is attended by thousands of devotees. Hindu pilgrims were coming to visit this temple long before the development of Champaner as a major city and have continued to do so for hundreds of years after its decline, right up to the present day. Another building with columns is also located on the Pavagadh Hill, above the roof of the Mahakali temple. The ruins of Patai Raval's palace can be seen on the way to the temple.\nJain temples\nThe temples of Jainism at Pavagadh are also noteworthy. They fall into three different groups: The first consists of the Bhavanaderi temples near the Naqqarkhana gate called the Navalakka temples, the second group is in honor of the tirthankaras Suparshvanatha and Chandraprabhu and the third group, situated on the south east of Pavagarh Hill (''Mataji's cliff), is near the Pārśva temple next to the Dudhia tank. On the basis of their \"stylistic and architectural features\", the date of construction of these temples is deduced to be the 14th&ndash;15th centuries. The temple is made up of pure white stone with elaborately carved seated and standing images of the Jain pantheon are seen on the outer walls of the temples. The Garbabrihas are enshrined with beautiful stone images of tirthankaras in these temples. All the temples have been renovated over time. The temple also has a 30&nbsp;ft. tall statue of God Bahubali stands tall in its vicinity.\nThe Greek geographer Ptolemy, who journeyed to India in the year 140 A.D. regarded this temple as an ancient and holy place. In the year 1483(V.S. 1540), Mohammed Begdo, the Muslim sultan, heavily impaired this temple. In 1880(V.S. 1937) this temple was repaired. This temple is considered very holy. The entire complex houses a Dharmshala or Guest house, a Jain restaurant and gardens.\nTombs and mausoleums\nSakar Khan’s Dargah, Halol, is a dargah or mausoleum of Sakar Khan. It is the largest in the old part of Champaner. It has a low plinth and a large dome, with windows in the frontage.\nSikandar Shah’s Tomb, the tomb of the last ruler of Champaner, who was assassinated by Imad-ul-Mulk, Khusqadam in 1526 A.D., is seen near Halol. It is a single-storey building in Muslim architectural style. It consists of a central chamber and entrance porches with fluted domes. The brick dome of the central chamber and the side chamber have collapsed. Sikandar Shah’s brothers, Latifkhan and Nasirkhan, were also buried here. The structure is very simple but the brackets, plinth base and finial of the dome are elaborately carved with floral and geometrical patterns.\nThe shrine of Khon pir, a saint, a colourful tomb, was a place of worship of the weaver community (Muslims known as Tais) of Champaner.\nThe tomb near Panch Mahuda-Ki Masjid has a rectangular layout. There are four arched entrances with two small ones on the flanks built facing in the cardinal directions and the tomb has two corner minarets built over a high plinth.\nThe tomb with a brick dome in the centre and small corner domes was built with bricks. It was one of the first such tombs to be built of bricks in Gujarat. It has arched openings on all four sides. The domed chamber built over an ashlar masonry plinth is square in shape. The central dome is flanked by four corner domes which are plastered with lime masonry brick. While the central dome is nearly plain, in the interior the four corners are provided with a series of squinches. The outer plinth shows decorated mouldings.\nFortresses and walls\nThe fortress built by the Chaulukya kings of Gujarat was further fortified by Khichi Chauhans. In 1484, Sultan Mahmud Begadah captured the fort and renamed it Muhammadabad Champaner. The fortifications start on the Mauliya plateau, which is situated on the hill and ends on the plains. They are very large and are built of sandstone connected with bastions at intervals and have elegant balconies. There are several gates in the fortifications and the enclosed area within contains barracks and jails. The west gate has fortifications running from the ridge to the north built of brick and cement which is followed by a freely laid stone wall for about a mile, then by a second line of old wall ( in height) which extends  and rises to join the first line (known as atak) of fortifications on the hill. The huge wall of free stone is known as Bigada’s wall, and encloses the Jahapanah (the world shelter) and the Bhadar or the citadel of Mahmudabad Champaner; the area enclosed by this fortification is  long and  wide. A rectangular building at the approach to the citadel is a guard room x1 in size with double gates and with stone window openings embellished with intricate carvings. Shikari Kot'' or Hunters' Fort is located to the east of the Citadel. The Bada Talao or the Great Lake is next to the ruins of the palace.\nFort of Pavagadh and the ruined Hindu and Jain Temples on the top of the Pavagadh Hill\nThis famous Hindu fort built by the Solanki kings of Gujarat and improved by Khichi Chauhans is part of the Pavagadh hill landscape. Within the fort wall, there are many religious structures. Of these, the earliest temple, dated to the 10th-11th century and dedicated to Lakulisa, is in the Mauliya plateau. What is left of the temple are the gudhamandapa (sanctum sanctorum) and a portion of the antarala. The other temples, built by Hindus and by Jains, are dated to approximately the 13th-15th centuries; all the temples are built in the Nagara style of architecture with a garbhagriha, a mandapa and a porch at the entrance.\nThree cells\nThe building with three cells located within the fort walls is conjectured to have been constructed during the rule of Mahmud begada.\nWalls\nSeveral enclosure walls remain, such as those built at the time of the citadel and the fort.  The \"Citadel Walls\" refers to the walls of the fort, which is laid out in the north–south direction and is fortified with many bastions. It has four gates in good condition, which originally were double-storied, with rooms for housing the watch and guard staff. The \"City Walls at the Southeast Corner of the Citadel going up the hills\" refers to the fort wall, built in ashlar stone masonry; four of its bastions are in good shape. The \"Walls of fort on top\" refers to the walls of the fort, dated to approximately the 13th century, built in ashlar masonry.\nGates\nThe City Gate, initially two-storied, is in good condition. It has a projecting arch in the fort wall, which is laid out in the north–south direction. The very large East and South Bhadra gates of the fort built by Mahmud Begada are laid out on a rectangular plan and are named after the towns which they face towards, namely the Halol gate to the east and the Godhra gate to the south.\nGate No. 1, the Atak gate (with two gateways) was built in the 13th century and is to the west end of the fort on the Pavagadh Hill. It ends near the Khaprakodia watch tower and continues further in an east–west direction; the main gate is hemmed with the Budhiya gate. Gate No. 2, the Budhiya gate (with three gateways), was also built in the 13th century and covers the western end of the fort on the Pavagadh Hill and ends near the Khaprakodia watch tower and continues thereafter in east–west direction with its main gate hemmed with the Atak gate. Gate No. 3, the Moti gate or Sadanshah gate, refers to the gate on the Machi plateau which has four gates, each built on a successively lower level and joined by massive bastions. These are double gates. The Moti gate represents the second line of defence, which is most formidable. Sadan Shah Gate is cut through solid rock above which there are tall walls and bastions dating to approximately the 13th century. Gate No. 4 has big bastions and cells in the interior. This gate is part of the third line of defence of the fortification. It has a circuitous passage and was built in-situ of solid rock. The walls are towering and provided with bastions which also date to approximately the 13th century. Gate No. 5, the Gulan-Bulan gate, was built in the 13th century and was integral to the ridge fortification behind the Sat Manzil. Gate No. 6, Buland Darwaja, is of 13th-century vintage, built on the hill near Makai Kothar, and has strong fortifications on its flanks. Gate No. 7, the Makai gate, was also built in the 13th century. It is between gates 6 and 8. It is similar in architectural style to the other gates but has a true arch, with secure fortifications and bastions flanking it. Gate No. 8, the Tara pore gate, is the last gate of the lower citadel. It has an arched opening and was initially double-storied when built in the 13th century.\nPalaces and pavilions\nThe palaces in the heritage site were built by different rulers over the period of the city's active existence as a capital and are nearly ruined. Gardens, fortifications and pavilions were integral to the palace environment. The pavilions of Champanar were known as \"pleasure pavilions\". Other structures seen in the site include a single arch near the West Gate of Champaner; a square pond called Kasbi talao with descending steps which was built by Sakar Khan, a Pathan, and used by the courtesans; the Julan Badan gate and wall starting from the Pavagadh spur and extending into a ravine; the palace of a brother-in-law of Patai Ravals on the ridge of a hill; and the custom house or Mandvi located in the centre of the citadel.\nPatai Rawal’s Palace with Tank was built by Jai Singh, last in the Patai Rawal family line of succession, in the 13th century. The ruins of his palace are situated to the south-east of the Machi plateau. Excavations have shown that the rooms of the palace were built of rubble plastered with lime,  and some covered water cisterns were also unearthed.\nKabutarkhana Pavilion is situated on the north bank of Bada Talao near Khajuri Masjid. Basically a sarai, a small structure made of bricks and lime plaster, it was built next to the Vada Talav or pond.\nOther structures\n;Helical Stepped Well\nThis step well dated to approximately the 16th century, is helical in shape and was built with bricks and stone paved steps. From the entrance of the well, a stairway built into the wall of the shaft descends in the form of a snake coil. The steps are  wide and protected by a parapet wall  high. The architectural development of this type of wells in the 16th century was distinctive for its three typologies of the spiral, the linear and the composite.\n;Mint above gate No. 4\nThis small structure was built during the 15th century near Gate no. 4, to serve as a mint.\n;Sat Manzil with steps right up to bastion on top\nThe seven-storied watchtower was built during the 15th century. Only four storeys survive, while traces of the rest can be seen close to the cliff, with a stone staircase.\n;Mandvi or Custom House\nThe well laid out square structure in the center of Champaner's fort was an exclusive and separate enclosure for royalty visiting as guests of the kings. When Marathas ruled here, the building was an octroi or custom house. It is built with dressed stone and is well planned with six bays in length and five bays in width, with five rows of arches and five equal colonnaded aisles. The custom house was probably used as a guard room. From the Custom House to the east gate, the view of present-day Champaner consists of shabby houses on a lone street.\n;Granaries\nMakai Kothar is a three-domed structure which was part of the military establishment and used as a store house (\"kothar\") for maize (\"makai\"). Navlakha Kothar is a large brick structure overlooking a steep cliff. It was used to store grains.\nIt is a beautiful place to visit during July to September.\nSee also\n* Jain temples, Pavagadh\n* Palitana temples\n* Pavagadh\nReferences\nBibliography\n* }}"
    }
  ]
}