{
  "content": [
    {
      "type": "text",
      "text": "# Monument to the Victims of the Holocaust (Madrid)\n\n| website       =\n| extra_label   =\n| extra         =\n}}\nThe Monument to the Victims of the Holocaust () is a monument in Madrid, Spain, in memory of the victims of the Holocaust during World War II. It is located in the Three Cultures Garden () in Juan Carlos I Park. Inaugurated in 2007, the monument was the first Holocaust memorial in Spain.\nContext and history\nThe establishment of a permanent Holocaust memorial coincided with increased attention to Holocaust remembrance in Spain, between late 2004 and May 2005, ahead of the 60th anniversary of the liberation of Mauthausen concentration camp, where more than 16,000 Spaniards were killed. Mauthausen held thousands of Spanish political prisoners who opposed the Franco regime. On 15 December 2004, Spain established 27 January as the Day for the Remembrance of the Holocaust and the Prevention of Crimes () after a United Nations resolution instituted International Holocaust Remembrance Day.\nOn 28 April 2005, the week of the anniversary of the liberation, the Madrid City Council unanimously approved the establishment of a Holocaust memorial. In an agreement between the Madrid City Council and the Jewish Community of Madrid () (CJM), the Jewish community bore the 53,600-euro construction cost as a donation to the city.\nUpon completion, the memorial was dedicated by Mayor of Madrid Alberto Ruiz-Gallardón on 12 March 2007. The monument was the first Holocaust memorial in Spain. In 2017, the northwest town of Oviedo became the second city in Spain with a Holocaust memorial.\nDescription\nThe monument was created by sculptor Samuel Nahon Bengio, an Israeli of Sephardic Jewish descent. It stands in the Three Cultures Garden in Madrid's Juan Carlos I Park. The garden symbolises the coexistence of Christians, Muslims, and Jews.\nForty-four columns of steel and wooden railroad ties form a Star of David, surrounding a raised platform with 10-meter high center column. The railroad ties are nailed upright, directly into the ground, to simulate tombstones in a cemetery.\nOn one side of the platform is a sculpture made of wooden railroad ties of a father holding his son in his arms. On a pathway leading to the platform is a commemorative bronze plaque with the following inscription:\n{| class=\"wikitable\"\n!Spanish\n!English\n|- style=\"vertical-align:top; white-space:nowrap;\"\n| Monumento en recuerdo a las\nvictimas del Holocausto\nen memoria de los seis millones de judíos asesinados\ndurante la shoá por la barbarie Nazi, así como de las\nvictimas españolas, gitanas y otros colectivos\nigualmente asesinados en los campos de exterminio\n15 de abril de 2007 – 27 de Nisán de 5767\n|Monument in remembrance to the\nvictims of the Holocaust\nin memory of the six million Jews murdered\nduring the Shoah by Nazi barbarism, as well as the\nSpanish, Gypsy, and other victimized groups\nlikewise murdered in the extermination camps\nApril 15, 2007 – 27 Nisan 5767\n|}\nSee also\n* List of Holocaust memorials and museums\nReferences"
    }
  ]
}