{
  "content": [
    {
      "type": "text",
      "text": "# Monument to Sir Alexander Ball\n\n| namesake            = Sir Alexander Ball\n| completion_date     = 1810\n| renovation_date     = 1884 (restoration)\n| material            = Limestone\n| architect           = Giorgio Pullicino (attributed)\n| ren_architect       = Andrea Vassallo and Emanuele Luigi Galizia\n}}\nThe Monument to Sir Alexander Ball () is a neoclassical monument in the Lower Barrakka Gardens in Valletta, Malta. It was built in 1810 as a memorial to Sir Alexander Ball, a British admiral who was the first Civil Commissioner of Malta. Attributed to the architect Giorgio Pullicino, the monument is in the form of an ancient Greek temple.\nHistory\n]]\nSir Alexander Ball was a British naval officer who was sent to Malta in 1798 to help the Maltese rebels in the blockade against the French. Ball became the first Civil Commissioner of Malta, a post he held from 1799 to 1801 and again from 1802 until his death on 25 October 1809. Ball was widely loved and respected by the Maltese people.\nIn December 1809, the Maltese set up a committee of \"Deputies of the Nation\" and petitioned the Acting Commissioner Francis Chapman to build a monument dedicated to Ball. The Lower Barrakka Gardens was chosen as the site to build the monument, since its location on the fortifications overlooking the Grand Harbour was appropriate to honour a naval officer, and it was an area popular with the local population. The strategic location of the monument made it a powerful symbol of British rule in Malta.\nThe monument was constructed in 1810, and its design is attributed to the Maltese architect Giorgio Pullicino. The monument was built using funds collected by the local population.\nThe monument deteriorated quickly after its construction since it is exposed to the elements. In 1883, Captain E. H. Seymour formed a committee to restore it, and it was restored the following year by Andrea Vassallo under the supervision of Emanuele Luigi Galizia. The restored monument was inaugurated by Governor Sir Lintorn Simmons on 18 December 1884.\nThe monument was restored once again in 2001, as part of an overall restoration and rehabilitation of the Lower Barrakka.\nArchitecture\nThe monument was designed in the Greek Revival style of Neoclassical architecture. It is built in the form of an ancient Greek temple with a solid naos and a Doric tetrastyle portico. The design was inspired by the Temple of Hephaestus in Athens, but the proportions are completely different since the monument is much smaller than the temple. It is set on a high stylobate in order to make the structure more imposing. Each of the four walls of the naos contains a niche containing allegorical statues representing War, Prudence, Justice and Immortality. These statues are the work of the sculptor Vincenzo Dimech.\nThe frieze contains the following inscription:\n}}\nTwo identical inscriptions, one in Latin and another in English, were installed at the base of the monument during the 1884 restoration. The Latin inscription reads:\n}}\nSee also\n*Maitland Monument, Corfu\nReferences\nExternal links"
    }
  ]
}