{
  "content": [
    {
      "type": "text",
      "text": "# Monument to the Glory of Émile Levassor\n\n|type          = Monument\n|material      =\n|length        =\n|width         =\n|height        =\n|begin         =\n|complete      =\n|open          = 26 November 1907\n|dedicated_to  = Émile Levassor\n|map_image     =\n|map_caption   =\n|map_width     =\n|coordinates   =\n}}\nThe Monument to the Glory of Émile Levassor (French: ''Monument à la gloire d'Émile Levassor), also known as The Triumph of Levassor (French: Le Triomphe de Levassor), is a sculpture in Paris, France, placed in the Alexandre and René Parodi Square, near Admiral Bruix Boulevard, within the 16th arrondissement of Paris. It is dedicated to Émile Levassor, an engineer and a pioneer of the automobile industry and car racing in France, and commemorates him crossing the finish line first in the 1895 Paris–Bordeaux–Paris Trail, which is sometimes considered the first automotive race in history. It was designed by Jules Dalou and Camille Lefèvre, and unveiled on 26 November 1907, at the entrance to Boulogne Woodland park. In 1972 it was moved to its current location.\nHistory\nand Louise Sarazin-Levassor at the start of the 1895 Paris–Bordeaux–Paris Trail]]\nThe monument was dedicated to Émile Levassor, an engineer and a pioneer of the automobile industry and car racing in France, and commemorated him crossing the finish line first in the 1895 Paris–Bordeaux–Paris Trail, which is sometimes considered the first automotive race in history. It was commissioned by Automobile Club of France in 1898, a year after his death. Work on the monument was begun by sculptor Jules Dalou, and following his death in 1902, it was continued by one of his students, Camille Lefèvre, who based it on his drawings. The monument was unveiled on 26 November 1907, at the entrance to Boulogne Woodland park.\nIn 1972, due to the construction of the Peripheral Boulevard, the monument was moved to Alexandre and René Parodi Square, near Admiral Bruix Boulevard, in the 16th arrondissement of Paris.\nCharacteristics\nThe monument is placed in the Alexandre and René Parodi Square, near Admiral Bruix Boulevard, within the 16th arrondissement of Paris.\nIt has a form of a large tall stone cuboid that is stylized to resemble a triumphal arch with two columns placed in front of it. In the centre is featured a relief titled The Triumph of Levassor (French: Le Triomphe de Levassor). It depicts Émile Levassor driving a 1895 Panhard et Levassor automobile, featuring racing number 5 written on its front, and decorated with laurel branches. Behind and to his right is depicted a cheering crowd of people, with men to waving their hats in the air. Above them are branches of a tree. On top of the arch, above the relief, is a sculpture of a car wheel with wings.\nGallery\nFile:Monument à Émile Levassor, Paris 16e 1.jpg|Monument as seen from the side\nFile:Monument à Émile Levassor, Paris 16e 3.jpg|The details on the top of the monument\nFile:Monument à Levassor 1907 droite.jpg|The relief\nFile:Monument à Levassor 1907 gauche.jpg|The relief\nReferences"
    }
  ]
}