{
  "content": [
    {
      "type": "text",
      "text": "# Monument to the Millennium of the Polish Cavalry\n\n|location      = Rondo Jazdy Polskiej\n|designer      = Mieczysław Naruszewicz, Marek Moderau\n|type          =\n|material      =\n|length        =\n|width         =\n|height        = 16 meters\n|begin         = 1983\n|complete      =\n|open          = 3 May 1994\n|dedicated_to  =\n|map_image     =\n|map_text      =\n|map_width     =\n|relief        =\n|extra         =\n}}\nThe Monument to the Millennium of the Polish Cavalry is a statue located at the Polish Cavalry Roundabout (Rondo Jazdy Polskiej) in Warsaw.\nHistory\nThe initiative to build the monument commemorating the Polish cavalry started in 1978, and in 1981 a committee was formed to organize the construction of the monument. The monument had to stand on a slope of the Łazienkowska Thoroughfare (Trasa Łazienkowska) at the entrance to Jazdów Street, where the cornerstone was laid in 1983.\nIn 1984, there was a design competition for the monument and from 13 entries, the design by sculptor and designer Mieczysław Naruszewicz was chosen. The statue was cast in 1987 at the Warsaw cooperative, Brąz Dekoracyjny.\nDue to unstable geological conditions, it was decided to change the monument's location. As a consequence it is now set too high on its column with its back to pedestrians and traffic.\nThe monument was unveiled on 3 May 1994. The sculpture shows two distinct riders galloping on horseback: a Piast knight armed with a lance in his hand ready to strike, along with a sword and shield, and a Uhlan soldier armed with a saber in his outstretched hand, which symbolizes the beginning and the end of the Polish horse cavalry. To create the sculptures, Colonel Zbigniew Starak, a participant in the charge at the Battle of Schoenfeld (the last cavalry charge and mounted battle fought by the Polish cavalry), posed for the sculptor.\nThe lower part of the column is surrounded by four cast brass plaques with a list of 43 of the most important battles in the history of the Polish cavalry. Metal from army artillery shells was used in the creation of the plaques. These were designed by sculptor Mark Moderau. After 11 years, errors in the inscriptions were noted and corrected for the dates of the Obertyn, Orsza and Beresteczko battles.\nIn 2016, an initiative was taken to rotate the monument to turn it towards the roundabout and the Politechnika metro station (from the south to the north-east, a turn of 135 degrees). The rotation of the sculpture was scheduled for the fourth quarter of 2018 and was successfully completed on November 20 - 21.\nBattles noted on the monument plaques\n* Cedynia 972\n* Psie Pole 1109\n* Legnica 1241\n* Płowce 1331\n* Grunwald 1410\n* Obertyn 1531\n* Orsza 1564\n* Byczyna 1588\n* Kircholm 1605\n* Kłuszyn 1610\n* Trzciana 1629\n* Beresteczko 1651\n* Warka 1656\n* Alsen 1658\n* Podhajce 1667\n* Chocim 1673\n* Wiedeń 1683\n* Parkany 1683\n* Zieleńce 1792\n* Samosierra 1808\n* Lipsk 1813\n* Stoczek 1831\n* Grochów 1831\n* Walewice 1863\n* Rokitna 1915\n* Krechowce 1917\n* Jazłowiec 1919\n* Koziatyn 1920\n* Komarów 1920\n* Korosteń 1920\n* Krojanty 1939\n* Mokra 1939\n* Bzura 1939\n* Wólka Węglowa 1939\n* Kock 1939\n* Montbard 1940\n* Tobruk 1941\n* Monte Cassino 1944\n* Falaise 1944\n* Moerdijk 1944\n* Ancona 1944\n* Bolonia 1945\n* Borujsko 1945\n* 1000 years of the Polish Cavalry\nGallery\nImage:Pomnik Jazdy Polskiej w Warszawie 05.JPG|\nImage:Jazdy Polskiej Monument - east.jpg|\nImage:Jazdy Polskiej Monument.jpg|\nImage:Jazdy Polskiej Monument - east inscription.jpg|\nBibliography\n* Irena Grzesiuk-Olszewska: Warszawska rzeźba pomnikowa. Wydawnictwo Neriton, Warszawa 2003, s. 183-184. ."
    }
  ]
}