{
  "content": [
    {
      "type": "text",
      "text": "# Monumento al perro callejero\n\n| other_language_1    =\n| other_title_1       =\n| image               = Monumento al perro abandonado.jpg\n| caption             = The sculpture in 2008\n| alt                 = Picture of a monument featuring a dog-shaped sculpture. The dog is depicted a depressed stray dog, with his tail between his legs and one injured hind leg.\n| artist              = Girasol Botello (sculptor)\n| year                = 2008\n| medium              = Bronze\n| movement            =\n| subject             = Free-ranging dog\n| height_metric       = 1.3\n| length_metric       =\n| width_metric        =\n| diameter_metric     =\n| metric_unit         = m\n| imperial_unit       = ft\n| weight              = Around\n| designation         =\n| condition           =\n| city                = Mexico City, Mexico\n| coordinates         =\n| mapframe            = yes\n| mapframe-zoom       = 13\n| owner               =\n| accession           =\n| module              =\n}}\nThe  (), also known as Peluso, is an outdoor bronze sculpture installed along Insurgentes Sur Avenue, in the southern borough of Tlalpan, in Mexico City. The statue was unveiled in July 2008 and was dedicated to the free-ranging dogs of the city.\nIt was sculpted by Girasol Botello and its model was Peluso, a former stray dog that was adopted by Patricia España, founder of Milagros Caninos, a non-governmental dog shelter. The shelter collected money and paid for the sculpture in order to raise awareness about the large population of free-ranging dogs in the city. Since its establishment, the monument has been neglected, vandalized and defaced.\nDescription\nThe Monumento al perro callejero depicts Peluso, a sad-looking and severely underweight stray dog, thin to the bones, with his tail between his legs and one injured hind leg. The statue is made of bronze, it is  high and weighs around . The sculpture was created by Patricia España (née Ruiz), founder of Milagros Caninos, a non-governmental dog shelter. It was sculpted by Girasol Botello and it was cast by Germán Michel. It cost Mex$130,000 and Milagros Caninos paid it with the contributions of private donations in order to raise awareness about the high population of free-ranging dogs in the city.\nWhen it was inaugurated, the monument featured a plaque that said:\n{| cellpadding=\"10\"\n|-\n| style=\"width:35%;\"|\nMi único delito fue nacer y vivir en las calles o ser abandonado. Yo no pedí nacer y a pesar de tu indiferencia y de tus golpes, lo único que te pido es lo que sobra de tu amor. ¡Ya no quiero sufrir, sobrevivir al mundo es solo una cuestión de horror! ¡Ayúdame, ayúdame por favor!—Peluso.}}\n|-\n| style=\"width:35%;\"|\nMy only crime was to be born and live in the streets or to be abandoned, I did not ask to be born and despite your indifference and your blows, all I ask for is what is left of your love. I no longer want to suffer, surviving the world is only a matter of horror! Help me, help me please!—Peluso.}}\n|}\nJorge Castro said for Local.mx that the plaque symbolizes what stray dogs would say if they could talk.\nPeluso, the dog\nPeluso was the name given to a 15-year-old stray dog that España adopted. He had suffered abuse that left him with renal insufficiency, canine distemper, and deafness. Peluso died five days before the inauguration of the monument.\nInstallation and status\nThe Monumento al perro callejero was unveiled on 20 July 2008. It lies in the corner of Insurgentes Sur Avenue and Moneda Street, near the National Institute of Neurology and Neurosurgery, and between Ayuntamiento and Fuentes Brotantes Metrobús stations, in the center of Tlalpan, the southern borough of Mexico City.\nSince it was inaugurated, the monument has been neglected: it has been graffitied and its plaque was stolen. A well-preserved replica is kept at the Milagros Caninos dog shelter. Castro criticized the status of the monument, adding that it is ironic as its main purpose was to denounce the abandonment of stray dogs.\nReception\nCastro said the statue is one of the most needed because it does not glorify a historical figure as most do, but instead \"belittles the human who doesn't do anything to help\". A writer of Chilango said that it celebrates a dying dog and only generates morbid fascination for the millions of stray animals that exist and ironized that as a consequence a monument to the homeless might eventually exist.\nNotes\nReferences\nExternal links\n*[https://www.milagroscaninos.org/quienes-somos/attachment/peluso-monumento-al-perro-callejero/ Peluso, monumento al perro callejero] (in Spanish) at Milagros Caninos Official Website."
    }
  ]
}