{
  "content": [
    {
      "type": "text",
      "text": "# Monument to Simion Murafa, Alexei Mateevici and Andrei Hodorogea\n\n|lat           =\n|long          =\n|extra         =\n}}\nThe Monument to Simion Murafa, Alexei Mateevici and Andrei Hodorogea () was a monument in Central Chişinău, Moldova. It existed between 1933 and 1940.\nOverview\nThe monument was opened in 1933, in the park of the Nativity Cathedral in Central Chişinău. The monument was dedicated to Simeon G. Murafa, Alexei Mateevici, and Andrei Hodorogea. All of them died in August 1917.\nIn the evening of August 20, 1917 some 200 Russian soldiers, with Bolshevist leaders, seized and murdered two of the most conspicuous Moldavian leaders, Andrei Hodorogea and Simeon G. Murafa, in Chişinău.\nOn July 17, 1917 Alexei Mateevici wrote the poem Limba noastră (), today the national anthem of the Republic of Moldova. A month later, on August 24, 1917, he died of epidemic typhus.\nAfter the Soviet occupation of Bessarabia and Northern Bukovina, the monument was destroyed in 1940.\nRebuilding the Monument\nIn 1994, Limba noastră became the anthem of the Republic of Moldova.\nIn 2007, the youth organisation of the Liberal Party asked the municipal council of Chisinau to re-erect the monument.  In 2013, historian and investigator Iurie Colesnic headed an initiative for the reconstruction of the monument. An exact copy of the monument was created by architect Eugen Bâzgu and folk artist Veaceslav Lozan and place in the same spot where the original monument had stood. On 29 September 2016, it was inaugurated by Vladimir Cantarean, metropolitan and primate of Moldova, in the presence of the secretary for culture Monica Babuc, the president of the constitutional court Alexandru_Tănase and other guests of honour.\nReferences\nBibliography\n* Eremia, Anatol (2001). Unitatea patrimoniului onomastic românesc. Toponimie. Antroponimie (ed. ediție jubiliară). Chișinău: Centrul Național de Terminologie, ed. „Iulian”. p.&nbsp;62. .\n* http://oldchisinau.com/kishinyov-starye-fotografii/pamyatniki-starye-fotografii/pamyatniki-kishinyova-do-1944-goda/?pid=1239 pic.21-26\nExternal links\n*  [http://www.e-democracy.md/parties/docs/pl/200703261/ Declaraţie privind restabilirea monumentului înălţat în grădina Catedralei în memoria eroilor naţionali: Simion Murafa, Alexei Mateevici şi Andrei Hodorogea]"
    }
  ]
}