{
  "content": [
    {
      "type": "text",
      "text": "# Monument to the Heroes – Schoolchildren\n\nThe Monument to the Heroes – Schoolchildren () is a memorial, established in Moscow in 1971 near the school building № 110 (Stolovy Lane, 10/2). Dedicated to schoolchildren who died in the Eastern Front of World War II. The designers of the monument are the sculptor D. Yu. Mitlyansky and the architects E. A. Rozenblum and P. I. Skokan. The monument has the status of an object of cultural heritage of regional significance.\nHistory\nIn 1968, at the All-Union Art Exhibition \"50th Anniversary of the Komsomol\" in the Central Exhibition Hall, a graduate of the school No. 110, D. Yu. Mitslyansky, presented his sculpture with the \"Requiem of the Year 41\", which he devoted to the memory of comrades who died at the front. The pupils of the school offered to install this monument in the schoolyard.\nThe grand opening of the monument took place on June 22, 1971. It was made as a project of graduates of this school - sculptor D. Yu. Mitlyansky, architects E. A. Rozenblum and P. I. Skokan. The monument consisted of five bronze figures of dead volunteers-tenth-graders standing on a pedestal (Yury Divilkovsky, Igor Kuptsov, Igor Bogushevsky, Grigory Rodin and Gabor Raab). The schoolchildren are dressed in greatcoats, with rifles on their shoulders. The inscription \"Be worthy of the memory of the fallen. 1941-1945\" is written on the pedestral. At the foot of the pedestal is a marble plaque with the names of 100 pupils and teachers of the school who were killed in the war.\nIn 1993, the monument was vandalized, after which the figures had to be moved to the school museum. To protect the monument from further acts of vandalism, Mitlyansky and Marcus developed a project for its reconstruction. An updated monument was installed on the school wall from the side of Nozhovy Lane. The new monument is a small copy of the old one, and a more accurate quote from Robert Rozhdestvensky's \"Requiem\" is put on its pedestal: \"In memory of the fallen, be worthy.\"\nReferences"
    }
  ]
}