{
  "content": [
    {
      "type": "text",
      "text": "# Monument Park Historic District\n\n| locmapin     = Massachusetts#USA\n| area         =\n| built        = 1844\n| architect    = Richard Upjohn and others\n| architecture = Classical Revival, Gothic, Romanesque\n| added        = May 16, 1978\n| refnum       = 78000478\n}}\nThe Monument Park Historic District is a historic district centered on Monument Park in downtown Fitchburg, Massachusetts.  The district has one of the city's finest assemblages of high-quality architecture, including a number of civic, religious, and commercial buildings near the park.  The district was listed on the National Register of Historic Places in 1978.\nDescription and history\nFitchburg's Monument Park is located near the center of its downtown Main Street commercial area, flanked by Wallace Avenue (west), Elm Street (north), Hartwell Street (east), and Main Street (south).   It is 2/3 acre in size, and is a basically flat and rectangular parcel, with grass and mature maple trees encircled by shrubs and a low iron fence.  At its center is a statue of a winged figure depicting Victory, which was created by sculptor Martin Milmore and is dedicated to the city's American Civil War military.  The park was established by the city in 1874.\nThe west side of the park is flanked by two buildings.  The southern building is a modern construction whose facade faces Main Street; when the district was created, a heavily altered Greek Revival church building stood here.  The northern building is Fitchburg's state armory, designed by Wait & Cutter and completed in 1891, with an addition by noted Fitchburg architects Henry M. Francis & Sons in 1914.  It is a brick building with Gothic towers and parapets.  At the northwest corner of the park stands the old post office, a large Classical Revival building completed in 1903 and enlarged in the 1930s.\nThe north side of the square is faced by the High Victorian Gothic district courthouse, designed by Worcester architect Elbridge Boyden, and completed in 1871.  To its right stands the district's only (formerly) residential property, a fashionable Queen Anne Victorian designed by Henry M. Francis.  The east side of the square is completely taken up by the Gothic Christ Church, designed by Richard Upjohn and built in 1868 with numerous later sympathetic additions.  To its east, facing Main Street one block away from the square, is the former 1894 YMCA building, another H. M. Francis design.\nThe original submission for the district included several buildings on the south side of Main Street, including the Modernist library designed by Carl Koch and several non-contributing commercial buildings; these elements were rejected by the National Park Service because they were out of character with the rest of the district.\n}}"
    }
  ]
}