{
  "content": [
    {
      "type": "text",
      "text": "# Monument to Cuba (Madrid)\n\n| material      = Limestone, granite, bronze\n| length        =\n| width         =\n| height        =\n| weight        =\n| begin         = 1929\n| complete      = 1930\n| dedicated     =\n| open          = 27 October 1952\n| restore       =\n| dismantled    =\n| dedicated_to  = Cuba\n| map_name      =\n| map_text      =\n| map_width     =\n| map_relief    =\n| coordinates   =\n}}\nThe Monument to Cuba is an instance of public art in Madrid, Spain, consisting of a fountain over which an sculptural group topped by an allegory of Cuba emerges from. It is located at El Retiro Park.\nHistory and description\nThe idea dates back at least to 1928, and it was endorsed by Miguel Primo de Rivera. The Ayuntamiento de Madrid approved the erection of a monument in homage to Cuba in 1929. The director of the works was Mariano Benlliure, who counted with help from Miquel Blay, Francisco Asorey and  for the sculptural elements. Works chiefly took place between 1929 and 1930, only missing the monumental fountain by 1930. The original project included a bronze sculpture of Cuban president Gerardo Machado, yet, following the delay in the inauguration of the monument, it was never added to the ensemble.\nThe leading element on top of the monument is a female allegory of Cuba, wearing a thinly draped tunic and a Phrygian cap, designed by Blay. The pedestal displays the supporting figures of Christopher Columbus (by Asorey), Isabella I of Castile (by Juan Cristóbal), as well as the coat of arms of Cuba. A bronze fore and an aft of a galleon, a work by Benlliure, also emerge from the sides of the pedestal. The ensemble is also ornamented by iguanas, tortoises and tropicals fruits made of bronze, also by Benlliure. The animals serve as water source of the surrounding fountain.\nFollowing a long delay related to the political vicissitudes in both countries—including the renunciation of Primo de Rivera (1930), the proclamation of the Second Republic in Spain (1931) and the overthrow of Machado in Cuba (1933)—the monument was eventually unveiled more than two decades after its completion, on 27 October 1952, on the occasion for the 460th anniversary of the discovery of the island of Cuba during the first voyage of Columbus. The ceremony was attended by José Finat y Escrivá de Romaní (Mayor of Madrid), Alberto Martín Artajo (Minister of Foreign Affairs), Mariano Vidal Tolosana (responsible for American affairs within the Foreign Ministry), the ambassadors of Cuba in Spain (Antonio Iraizoz) and Spain in Cuba (), and  (President of the Provincial Deputation of Madrid), among others.\nFile:Madrid - Parque del Retiro - Monumento a Cuba 01.JPG|Tortoise\nFile:Madrid 2015 10 25 2964 (26495349976) (cropped).jpg|Cuba\nFile:(Escudo de Cuba) Parque Del Buen Retiro (cropped).jpg|Coat of arms of Cuba\nFile:(Isabella) Madrid 2015 10 25 2964 (26495349976) (cropped).jpg|Isabella\nFile:(Colón) Buen Retiro Monumento a Cuba02 (cropped).jpg|Columbus\nFile:Madrid - Parque del Retiro - Monumento a Cuba 02.JPG|Iguana\nBibliography\n;References\n;Bibliography\n*\n*\n*\n*\n*"
    }
  ]
}