{
  "content": [
    {
      "type": "text",
      "text": "# Monument to Manco Cápac\n\n}}\nThe Monument to Manco Cápac () is a statue located in the homonymous square in La Victoria District, Lima, the work of the Peruvian sculptor David Lozano, inaugurated in 1926.\nDescription\nThe monument is a bronze sculpture of the Sapa Inca Manco Cápac and founder of the Inca civilization, upright and with a staff, and pointing to the horizon with his right hand. It is placed on a lintel stone pedestal and in the form of a stepped pyramid, with motifs and ornamentation of clear Inca sign, as well as small sculptures of symbolic animals of the Andean world and reliefs that tell the story of the mythical character.\nHistory\nIn 1921, during the second government of Augusto B. Leguía, the Centennial of the Independence of Peru was celebrated and many colonies of foreign residents decided to grant gifts in the form of monuments to the Peruvian State. The Japanese colony, represented by the Japanese Central Society, decided to commission a statue of the mythical founder of the civilization of the children of the Sun}} from a Peruvian sculptor, for which reason David Lozano was selected, whose collaborators were the artists Benjamín Mendizábal and Daniel Casafranca.\nThe first place that the Japanese colony thought of for the placement of the work was the Parque de la Exposición, but when the location was rejected, it was estimated that it would be located in Plaza Bolívar, next to the equestrian statue of the Liberator, or also the main square of Lima, but the proposals were dismissed. Finally, the statue was placed in a roundabout at the intersection of  and Santa Teresa avenues.\nIn August 1922, the start-up ceremony for the work was held with the presence of the Peruvian President Augusto B. Leguía, the mayor of Lima Pedro Rada y Gamio and the ambassador Keichi Yamasaki, representing the Japanese government. The work was inaugurated on April 5, 1926, after a series of setbacks that delayed delivery. The monument took three years, nine months and 21 days to complete and cost approximately S/.113,500.\nIn 1933 the work was moved to its final location in the Plaza Leguía, later renamed Plaza Manco Cápac.\nNotes\nReferences"
    }
  ]
}