{
  "content": [
    {
      "type": "text",
      "text": "# Monument Nunataks\n\n}}\nThe Monument Nunataks () are a group of nunataks in Antarctica that have numerous pinnacles and odd-shaped projections resembling monuments, situated north of Sculpture Mountain in the upper part of Rennick Glacier.\nThe group was named by the Northern Party of the New Zealand Geological Survey Antarctic Expedition (NZGSAE) of 1962–63.\nLocation\nThe Monument Nunataks are on the east side of the upper Rennick Glacier. The Freyberg Mountains are to the east, and the Mesa Range to the south.\nthe Outback Nunataks are to the west.\nFeatures\nFeatures, from north to south, include:\nMount Lorius\n.\nA mountain,  high, standing  north of Mount Allison.\nMapped by the United States Antarctic Research Program (USARP) Victoria Land Traverse Party, 1959-60.\nNamed by the United States Advisory Committee on Antarctic Names (US-ACAN) for Claude Lorius, French glaciologist, a member of the traverse party.\nMount Allison\n.\nA mountain  northeast  of Mount Stuart.\nMapped by the United States Geological Survey (USGS) from surveys and United States Navy air photos, 1960-64.\nNamed by the US-ACAN for Richard G. Allison, biologist at McMurdo Station, summers 1965-66 and 1967-68.\nMount Stuart\n.\nA mountain,  high, standing  north of Mount VX-6.\nNamed by the US-ACAN for A.W. Stuart, glaciologist and member of the United States ArmyRP Victoria Land Traverse Party which surveyed this area in 1959-60.\nMount VX-6\n.\nA distinctive, sharp mountain,  high, standing  north of Minaret Nunatak.\nSurveyed by the USARP Victoria Land Traverse Party, 1959-60.\nThey named it for United States Navy Air Development Squadron Six (VX-6) which supported the traverse party in the field.\nOn January 1, 1969, the squadron was redesignated Antarctic Development Squadron Six (VXE-6) but its mission remained the same.\nMinaret Nunatak\n.\nA minaret-like nunatak,  high, standing  west of Burkett Nunatak.\nNamed by the Northern Party of NZGSAE, 1962-63.\nBurkett Nunatak\n.\nA nunatak,  high, standing  east  of Minaret Nunatak.\nMapped by USGS from surveys and United States Navy air photos, 1960-64.\nNamed by US-ACAN for Willis A. Burkett, aviation electronics technician of United States Navy Squadron VX-6. Burkett made six deployments with Deep Freeze expeditions and participated in over 100 flights to McMurdo Sound.\nR4D Nunatak\n.\nA nunatak lying  southeast  of Burkett Nunatak, at the southeast  end of Monument Nunataks.\nNamed by the Northern Party of NZGSAE, 1962-63, after the R4D \"Dakota\" aircraft used by the United States Navy to transport the Northern Party to this area, and to resupply and return the party to Scott Base.\nNearby features\nSculpture Mountain\n.\nA large dissected mountain between the Monument Nunataks and Sheehan Mesa.\nNamed by the Northern Party of NZGSAE, 1962-63, due to the cuspate embayment which has been sculptured into the feature.\nTooth Peak\n.\nA small sharp peak on the north end of Sculpture Mountain in the upper Rennick Glacier.\nNamed for its tooth-like shape by the Northern Party of NZGSAE, 1962-63.\nMount Short\n.\nA mountain,  high, standing  east  of Sculpture Mountain.\nMapped by USGS from surveys and United States Navy air photos, 1960-64.\nNamed by US-ACAN for Lieutenant Commander John S. Short, United States Navy, LC-130F aircraft commander in Operation Deep Freeze 1967 and 1968.\nCherry Spur\n.\nA prominent rock spur that forms the southwest portion of Sculpture Mountain at the south end of Monument Nunataks.\nThe feature was geologically studied by Ohio State University field parties in the 1981-82 and 1982-83 seasons.\nNamed by the US-ACAN after Eric M. Cherry, geologist with those parties who worked on the spur.\nReferences\nSources\n*\n* }}\n* }}"
    }
  ]
}