{
  "content": [
    {
      "type": "text",
      "text": "# Monuments of Kosovo\n\nMonuments of Kosovo comprise all the monuments that are located in Kosovo.\nKosovo has an abundance of multicultural and rich heritage dating back to the Bronze Age, later followed by Illyrians, Roman, Byzantine/Serbian Orthodox and Ottoman periods.\nMost of the monuments in Kosovo were built by local craftsmen's with local materials under conditions that were influenced by the empires that invaded Kosovo. Monuments that still stand are those of the Byzantine/Serbian Orthodox and Ottoman periods, which have historical, cultural, architectural and artistic values for our priceless legacy. Among the antique cities, Byzantine and Orthodox churches and monasteries, Ottoman Mosques, Hamams and Bazaars thrived the building culture of the common people – the residential dwelling.\nKosovo's monuments are unique common property for which the society is responsible to maintain them in order to transmit their authenticity to future generations. The field of popular architecture has value upon indigenous features that are considered to have one of the most original constructive structures in the whole Balkan. Kosovo has a strategic geographical position, since through Kosovo's territory natural traffic lines and roads passed which had an importance for cultural movements, heritage, historical, and art developments. During the last war in 1998-1999, more than 500 monuments were systematically targeted by the state forces, where more than 80% of them were destroyed, burnt or damaged. In many of them, only the construction walls have remained.\nUNESCO has classified Kosovo's monuments as Serbo-Byzantine monuments, Islamic monuments of the Ottoman Period and Vernacular architecture.\nMediaeval monuments\nIn the sixth century Justinian I reasserted Byzantine control over Kosovo after the Hunnish invasions and engaged in an extensive building/rebuilding programme in the region. From 839 to the early thirteenth century the region fell under Bulgarian control, with intermittent periods when the Byzantines were able to reassert their rule. From the early thirteenth century, until 1355, Kosovo was part of the Serbian Empire under the Nemanjić dynasty; and it was in this period that most existing medieval Christian buildings were built.\n, UNESCO World Heritage Site]]\nMonasteries\nGračanica monastery is a Serbian Orthodox monastery.  It was founded by the Serbian king Stefan Milutin in 1321. It is located in Gračanica and belongs to Serbo-Byzantine style. The monastery is known for its iconostasis, icons and manuscripts which express the wealthy and artistic values. It is declared a Monument of Culture of Exceptional Importance in 1947 by Republic of Serbia, under status number \"СК 1367\", while it is a protected monument by Republic of Kosovo also with the status number 427/1947. On 13 July 2006 it was placed on UNESCO's World Heritage List under the name of Medieval Monuments in Kosovo as an extension of the Visoki Dečani site which was overall placed on the List of World Heritage in Danger.\nAccording to the archaeological excavations in 1957, 1963 and 1964, this monastery was constructed on the ruins of 13th-century church, which was also built on the foundations of a 6th- to 11th-century Christian three-naved basilica. The Christian basilica, which was the center of the Dardanian Ulpiana Eparchy in the 13th century, was rebuilt as a new church above the middle nave foundations. It was dedicated to Blessed Lady/Theotokos of Gračanica. This church was also mentioned in Benedict the 11th Pope, in 1303, as a catholic parson church. Only the church remains from the original monastery complex, which was intended as the seat of the bishops of Lipljan.\nSaint Archangels Monastery is a Serbian Orthodox monastery, founded by the Serbian Emperor Stefan Dušan between 1343 and 1352 on the site of an earlier church, and it is located near the Lumbardhi i Prizrenit river in Prizren. At the time when it was constructed, the building contained a monastery and two small churches. A really important feature to be mentioned is that Stephen Uroš IV Dušan of Serbia and Balša I were buried in this monastery. It is declared a Monument of Culture of Exceptional Importance in 1948 by Republic of Serbia, under status number \"СК 1366\". Today it is a protected monument of Republic of Kosovo, under the status number \"464/48\". It presents a very important archaeological site and photography is forbidden.\nMonastery of Banjska is a Serbian Orthodox monastery, founded by the Serbian king Stefan Uroš II Milutin between 1313 and 1317. It is located in the Banjska village in municipality of Mitrovica. The medieval monastery was built on the foundations of an earlier sacral Paleo-Christian church, used by Albanian Christians. The western influences are evident on the remains of architecture and sculpture. The church design was influenced by Adriatic coast Romanesque architecture. In 1948, while Kosovo was in Yugoslavia, the monastery was declared a Monument of Culture of Exceptional Importance under status number \"СК 1371\". It is also a protected monument with the status number \"0301-551/90\" by the Republic of Kosovo.\n, the seat of the Serbian Orthodox Church from the 14th century when its status was upgraded into a patriarchate]]\nPatriarchate of Peć is a Serbian Orthodox monastery located in the municipality of Peja with some buildings thought to originate in the 13th century, near Rugova valley and is one of the most outstanding complexes from Medieval period. It consists of Saint Apostles Church (13th century), Saint Demetry and Saint Nicolas Church (14th century) which all have the same narthex and monumental narrative style. In the 13th century, the Serbian Orthodox Church adapted, reconstructed, and transformed the church of Saint Apostles in Peja for their needs. This church had a stone-masonry roman style (processed and dressed stones) with opening massive walls and small windows that represent the core of the complex of the Patriarchate of Peć.\nIn 1990, the Patriarchate of Peć was added to Serbia's \"Monument of Culture of Exceptional Importance\" list, and on 13 July 2006 it was placed on UNESCO's World Heritage List as an extension of the Visoki Dečani site which was overall placed on the List of World Heritage in Danger.\nVisoki Dečani is a Serbian Orthodox monastery located near Dečani. It was founded in 14th century by Stefan Dečanski, King of Serbia. The monastery's main architect was Fra Vita, a Franciscan friar from the Montenegrin coastal town of Kotor. It is managed by the Serbian Orthodox Eparchy of Raška and Prizren. The monastery has been under the legal protection of Serbia since 1947 with a designation of Cultural Monument of Exceptional Importance. The monastery is part of the World Heritage site named \"Medieval Monuments in Kosovo\".\nChurches\n, Prizren]]\nOur Lady of Ljeviš is a 14th-century Serbian Orthodox Church in the town of Prizren, and its one of the oldest standing structures in Prizren. The construction of the church was commissioned in 1306-9 by Milutin of Serbia. It was built on the site of an earlier Byzantine church, whose original name Metera Eleousa was preserved in Slavic as Bogorodica Ljeviška. During the Ottoman Empire, the church was converted to a mosque. Since 2006, the church is part of the UNESCO World Heritage Site named Medieval Monuments in Kosovo.\nChurch of Saint George is a small one aisled church with barrel vault which is located at the center of Prizren.  It was constructed in the 14th to 16th centuries. It belongs to the late Byzantine style and has rich wall paintings. It has very important historic and artistic values. It is protected by the law.\nChurch of St. Nicholas was constructed at the beginning of the 1340s in Prizren. The building has small dimensions, yet very coordinated proportions and belongs to a local style of building. There are evident transformations of the building among the past few years and it has important historic and artistic values.\n'''St. Peter's Basilica Church is located in the mining colony of Stari Trg near the Trepča Mines, 9&nbsp;km from Mitrovica. During the 14th century Stari Trg was a settlement of the Turkish colony, therefore it is referred as the ‘Turkish Trepča’. The church was built during the 13th century and was used till the 16th century. It was built for the Saxon miners and Catholic merchant traders in the city of Trepča. Therefore, it is known as the Latin, Catholic and Saxon Church. The church was a three nave basilica built in Gothic architectural style and construction techniques. Today only its foundations and a single wall of the eastern apse have remained on which can be seen the interior Byzantine murals. It is a public property and has been protected since 1958 with the status number 8/58.\n155 Serbian Orthodox churches and monasteries were destroyed by Kosovo Albanians according to the International Center for Transitional Justice,between June 1999 and March 2004. The Medieval Monuments in Kosovo, founded by the Nemanjić dynasty, is a combined World Heritage Site consisting of four Serbian Orthodox Christian churches and monasteries. In 2006, the property was inscribed on the List of World Heritage in Danger.\nMosques\nPirinaz Mosque''' was constructed in the second half of the 16th century. It was founded by the Ottoman Vizier, Piri Nazir. According to the legend, it is believed that “Stone of Lazar”, which is in the mosque's garden, was used to behead Prince Lazar during the Battle of Kosovo in 1389, who was buried in the same mosque with the Sultan's permission before being moved to Ravanica Monastery in Serbia.\nImperial Mosque (Also known as The Big Mosque) is located in the oldest part of Pristina, next to Sahat kulla (The clock tower). It was built in 1461 by Mehmet II Fatih as witnessed by the Arabic engraving above the main door. It has a triangle shaped yard and painted floral decorations and arabesques grace the walls and ceiling on the inside.\nin Pristina]]\nSinan Pasha Mosque is located in Nenkalaja, on the right side of Lumbardhi i Prizrenit river. It was constructed in the beginning of the 17th century. Its enormous dome is fitted harmoniously into the square mass of the building whereas its interior is painted in strong light colors, decorated with geometrical designs. It is considered to be one of the most important mosques in Kosovo., Prizren]]\nHadumi Mosque was constructed by Hadum Sylejman Efendi, in the second part of the 16th century. It belongs to classical Ottoman era, but yet it has many traditional features involved in its structure. This mosque has only one dome and its interior contains many floral paintings. It is one of the best examples of the arabesques/baroque style buildings. This mosque offers warmth to the city and it is considered to be the most important mosque in Gjakova. One special thing about this mosque is that the dome stands above the constructive elements trompe, a particular example for Islamic architecture.\nGazi Ali Beg Mosque was built in 1444. During the last war in 1999, its [minaret] was destroyed by a Yugoslav grenade. In 2002 the mosque was restored and the minaret was rebuilt, unfortunately not corresponding to the original one. Besides this, authenticity of the mosque and its surrounding was damaged by removal of the carrel near the entrance and some grave-stones from the yard. It is a protected monument by law with a status number 02-985/66.\nMosque of Çarshia was built in 1761 during the Ottoman invasion. Based on the old pictures, it used to be a quadrilateral building covered with a four-sided roof. The upper floor was reached by the one-sided stairs placed on the left and on the right of the entrance. The gallery used for females. The mosque was burnt down by the Yugoslav military in 1999. It was reconstructed after the war.\nBajrakli Mosque is located in the oldest part of Peja, at the old market area more specifically. It was built during the Ottoman period. The mosque's paintings and decorations are mainly realized by using stone. Bajrakli Mosque has important historic and artistic values.\nLlapi Mosque is positioned near the Pristina's city centre. It dates from the 15th century. Its prayer room is six meters high and it also consists of a hall. In 1999 it was destroyed by Yugoslav forces after the war. A unique example in Kosovo architecture and wider.\nKurshumli Mosque is a sacral building constructed in the 16th century in Peja. Its original construction was covered with dome, but during the time it had some changed to the covering. The hajat also is not in original shape. Before being destroyed by fire, the mosque had four watery roof. Nowadays it has only its remains. Very important graves and traces are found in its yard.\nRed Mosque is a sacral building constructed in the 17th century in Kapeshnica of Peja. It consists of a praying space, portico and minaret. The mosque is special because Mihrab appears from the wall, but of course very modest in feature. It has historic and artistic values.\nHamams\nGrand Hamam dates in the 15th century. It used to be a part of Fatih's Mosque and was used as a Turkish bath for both men and women. According to the legend, Sulltan Mehmet Fatih ordered every servant to take a bath at least once per day. Now it is protected by the state. After a fire in 1994, the bath was deeply damaged and nowadays it has only its remains.\nHamam of Mehmet Pasha is one of the most distinguished from other baths of time due to the clock tower. It was built on a stone structure in 1498. It is inoperative so it turned into an Archaeological Museum of Prizren. Circa 1972-75 hamam was restored and then returned to the museum. With its transformation into a museum, opened the wall which divided the males and females.\nThe old city Hamam was built by the Turkish donator Gazi Ali Bey, who also built the hamam in Vushtrri, at 17th century. Hamam is located in the core of the old city center of Mitrovica, among other important monuments as the Old Mosque, Madrasah, Old Bazar, Han and the Clock Tower. It was used for its original function as a public bath for men only till 1953. It is protected monument by law since 1958 with the status number 685/57. Since 1959, hamam has been used as the “Archeological and Ethnographic Museum” of Mitrovica where local clothes, metallic vessels and other tools are exhibited. The hamam is composed by the interconnected three characteristic sections of the hot, warm and cold water. The cold section has a rectangular shape in the middle of which is placed a hexagonal marble fountain, while is paved with white marble square slabs. After the entrance hall is the warm section, used for undressing and preparing for the cleansing ritual in the hot section. This space contains 4 bathing cubicles (halvet) and 4 side alcoves. Walls of the hot section are built by stone and are 85&nbsp;cm thick. Its nine domes (eight small and the big central one) are covered with tiles and lead iron sheets.\nHammam of Gazi Ali Bey is a protected monument with its status number 02-628/68. It was built by Gazi Ali Bey during the 15th and 17th centuries for the cleansing rituals of men. It is one of the oldest public baths in Balkans. It still has its original constructed frame. Its facades have been built by cut stones, while the other parts by the rustic stones. The main brick dome was covered with by a hexagonal wooden roof, which today has been replaced with red tiles. It has circle-shaped small holes that were used for insolation. They used to resemble stars in the sky. The other three domes are smaller. Hamam is composed of the three common sections as the entrance central hall, the undressing section and the cleansing section with two bathing cubicles (halvet) in front of each other. Nowadays, the hamam has been neglected and therefore damaged.\nHammam of Haxhi Beu was built over the years 1462 - 1485 as part of a complex of Hasan Bey, who was the leader of the Sanjak of İpek. Its original function stands still. It was originally built in the style of alternating stone and brick as hammam of men, but later it was decided to be added to section on women. Nowadays it is used as workshops of carpenters. It is a very important millenarian building for Kosova and wider.\nMausoleums\nThe Tomb of Sultan Murat is a mausoleum that presents the elements of Islam-kosovar baroque. It is located in Mazgit, the exact place where Sulltan Murati was murdered. The shape that the building has today was completed in the end of the 19th century.\n'''Gazi Mehmet Pasha's Mausoleum''' is founded in Prizren. It is in Bajrakli mosque's front yard.\n'''Haxhi Baba's Masouleum''' is a mausoleum that dates from the 17th century. It is located next to the city's tekke and Sejdi Bej's mosque, next to the city's fountain. The name of the mausoleum comes because Haxhi Baba was buried in that place.\n'''Sheh Besim's Masouleum''' is located in Lukinaj, Prizren. It was founded by Sheh Beqa in order to save the cemeteries of important personalities of the time. The mausoleum's holiday is 04-5 May. On those days, many people gather for tradition and religious reasons.\nTekkes\nTekke of Sheh Emini is located next to the Gjakova city museum. This Tekke belongs to the sect of Dervish Rafai. During psychological trance moments, they perform a body piercing ritual, focusing on their faces. This ritual is painless and no bleeding occurs. This sect celebrates its own holiday on 21 March, which is open to everyone. The tekke stands out as very important for the architectural values as it presents rare samples of sacral architecture, useful for the analyse of this type of monuments.\nVernacular architecture\nVernacular architecture is part of the wealthy material culture and is unrepeatable historical and cultural evidence, on its highest grade of genuineness. It includes profane public buildings and traditional residential houses built by locals during different periods. The public buildings consist the castles, bridges, clock towers, fountains, old Bazaars etc. while the residential buildings consist the urban and rural houses. Unfortunately, much of this outstanding cultural heritage of Kosovo was destroyed during the war in 1999.\nTraditional houses are exclusively built by Albanians for Albanians, by the local workmen according to traditional techniques. These houses resemble characteristics of the Albanians, their way of life, the function of the family and their hospitality. Inspired by the Ottomans, local ‘citizen’ dwellings were adapted to the local needs and elaborated into traditional styles, thus finally achieving their uniqueness in the whole Balkans.\nAmong the residential houses, the most distinctive were Kullas. The word Kulla from Albanian, Kule from Turkish, and kуле from Serbian, in English means Tower. They were built in the whole territory of Kosovo, but the most distinct ones were built in villages and towns of Dukagjini/Metohija region. These fortified stone houses were built by at the end of 17th and continued to the 18th, 19th and even in the early 20th century. Kullas purpose was for protection, considering the constant fighting. Therefore, they were placed in strategic position within the yard, thus offering a full sight of the surrounding environment. Kullas are special because of their form, construction, yard entrance, stone gallery, shoot holes, men room, window openings and ceiling. They were constructed from prehistoric antiquity that is characterized with special architectural structure not only in the Balkan cultural area, but also in Europe.\nPublic buildings\nCastles and forts\nPrizren Fortress is located in the ancient town of Prizren. It is a castle which dates in the ancient times and continuously was used during the Illyrian era, Roman, Byzantine, Serbian Empire and Ottoman Empire. Prizren Castle is an important part of the ancient history of the city. The fortress was expanded by Emperor Stefan Dušan, who used Prizren as capital of the Serbian Empire. Its topographic position, dominating the city, the natural landscape and well thought architectural configuration are the main reasons that this castle is considered to be one of the most important, interesting and visited historical monuments in Kosovo. Today this fortress keeps all the embrasures and many other buildings inside.\nNenkalaja of Prizren is located on a hilly area by the city's river. It is constructed in a unique urban structure, narrow winding lands has a perfect glance of the town.  It represents two different features of the town: one of strongest pains and one of the richest potentials.\nVushtrri Castle is located in the historic old core of Vushtrri. It was the seat of despot Đurađ Branković (1427–1456). Later chroniclers (Ami Boué, Aleksandar Giljferding) are noted that the fort itself is derived from the times of Dušan, and that it is an old fortress with a tower in the middle of the town. Its exact time of built is not known. However, according to Albanian historians the castle derives from the early Illyrian-Dardanian period, long before the Roman Empire. This is supported by two pyramid-shaped twin stones on the southern wall, which according to the legend represent the two-headed eagle and the union of Illyrian-Arber princes. Other historians suggested that the castle was built by the Byzantine emperor Justinian the 1st in the 7th century.  The old Byzantine foundations, above which the castle was rebuilt, were discovered in 1981 during the castle restoration. The castle was also destroyed and rebuilt during the Middle Ages. During the 14th century it belonged to the Serbian landlords Vojinović, and later to the Branković family. In 1389 during the Ottoman invasion it was destroyed and rebuilt by Sultan Murad the 1st. Even though rebuilt several times, the castle has survived until today and its structure has mainly remained unchanged. During its existence, the castle has been used mostly for military purposes as a prison, court and arms depot. From the 16th to 18th century it was an important trading administrative center. During 1935 to 1962 it had different functions as a corn deposit, volleyball field, summer cinema, restaurant and ball. Since 1962 it has not been used. The Old Castle is unique about its location in the city center of Vushtrri, comparing to other fortified castles in the hills and mountains. It has important historic, architectural and archaeological values while surviving different historic periods. In its structure can be noted different layers of building materials, construction and techniques. This archaeological site has a statutory protection and is declared a protected cultural heritage property. Its status number is 858/49.\n]]\nPogragja Castle is located in, Pogragjë, a village in the south-east of Gjilan. The fortress nowadays has only the remains of the main tower and three other smaller ones. The towers date from the medieval period, but it based on some fragments found, it they are known to be from the ancient time. It is considered to be a very important archaeological site.\nNovo Brdo Fortress is a medieval Serbian fortress. Its ruins are located near the town of Novo Brdo, about  from Pristina. The fortress was built in the early 14th century by Stefan Milutin, King of Serbia to protect gold, silver, iron and lead mines which were abundant throughout the area. For its fortress and production of silver and gold, Novo Brdo has been referred to as the \"Mother of all Serbian cities\", a \"mountain of gold and silver\", and the \"strongest fortification of Serbia\".\nPrilepac was a medieval fortress near Novo Brdo. It is most famous as the birthplace of Lazar of Serbia and his family.\nZvečan/Zveçan medieval fortress is an enormous castle and one of the oldest fortresses in South Eastern Europe. It was built on the top of the extinct volcano vent, overlooking the Ibar river. The underlying construction dates from the period of classical antiquity, and it is not unlikely that the location was fortified in prehistoric times. As a border fort of the Raška state, the site gained importance in 1093, when the Serbian ruler Vukan Vukanović, launched his conquest of Kosovo (then part of the Byzantine Empire) from there.\nOld bazaars\nGrand Bazaar of Çarshia (Gjakova) was the source of social, cultural, economic development. It helped the development of all types of craftsmanship.  Since 1955, it represents one of the largest urban monumental ensembles not only in Kosovo, but also abroad. This center was burnt therefore extremely damaged by the Yugoslav forces during the 1999 war, but it got later reconstructed. Nowadays it has many stores where you can buy different types of ancient handicrafts, such as souvenirs, traditional clothes and even contemporary items.\nBridges\n]]\nOld Stone Bridge of Prizren was constructed in the beginning of 16th century above the Lumbardhi i Prizrenit river. This is the most well-known bridge not just in Prizren, but also in the whole region. Lumbardhi i Prizrenit divides the city in two parts and is an important attraction point for tourists. It consists of three arches. In the beginning of its construction it used to be 30 m, but today it is only 17 m long. In 1979, because of a flood in the city, the bridge fell apart completely, but it was reconstructed in 1982.\nTerzijski Bridge is one of the most important utilitarian monuments in Kosovo. It is constructed during the 15th century in Gjakova. This bridge is 190 meters long and has 11 arches standing above Erenik river. Once the longest bridge in Kosovo, the structure is closed for road traffic, but it is clearly visible from the modern bridge constructed just alongside. It was later dramatically remodeled in the 18th century, funded by the tailor's guild, for which the bridge is named According to the decision on the protection of the bridge by the law of 1962, it is said that this bridge has historical, sociological, artistic, urban and cultural values.\n, Vushtrri]]\nThe Saint Bridge is 19&nbsp;km away from the Gjakova city center. It is constructed over Drini River which has a canyon. The most interesting fact about this bridge is its bizarre story. According to a legend, there were three brothers asked to build the bridge, but during the night felt apart everything that brothers constructed during the day. It was later decided that in order to build the bridge, one of their wives should be sacrificed. The woman that accepted to be sacrificed asked to make available for her baby that was still being breastfed. Special about this bridge are the competitions that are held every year on March–April in swimming, diving and jumping.\nStone Bridge is the oldest bridge in Kosovo. It is located in the north-west side of Vushtrri along the Pristina-Mitrovica route. This route used to be an old track that connected Skopje and Raguza, thus connecting Kosovo to the Adriatic Sea. While being directly connected to the city center of Vushtrri, it played an important role of the city development during the 14th and 15th century. It was built over the Sitnica River, but since the 20th century it has remained on the dry ground because of river flow change. Since then it was used as an informal meeting point of the citizens, while today it is isolated and claimed as a specially protected area by the Ahtisari plan and has a status number 859/49. The Bridge is unique of its alternative red and white voussoirs. Its exact date of built is not known. Mr. Izet Miftari claims that the bridge was built during the Roman period or antiquity in the 2nd century. While according to professor Hilmi Saraçi, it was built during the economic growth of the Dardanian state of Illyria in the 5th century (article “Ancientness, designation, cultural, historical and archaeological heritage of the city of Vushtrri”). Serbian historians claim that the bridge was built at the end of the 14th century. The  and  bridge is asymmetrical and is composed of nine arches. The five pointed middle arches were built during the early medieval, Byzantine era, while the four semi-circular others during the Ottoman period.\nFountains\n'''Pristina's fountain''' is the sole public fountain in Pristina which is protected by the state. It is located between the “Bazaar’s mosque” (Xhamia e Çarshisë) and Kosovo's Museum. Years ago there used to be many fountains in the city, but this one is the only public fountain that was able to survive during the years.\n'''Prizren's fountain''' is Prizren's pride, it is the most important location for city trip all season, every day and every night. It always had an important role as the essential market of all important actions. In these days with his Fountain-heas serves all the people and guests to the site itself where they can stay, drink the cold water of the Fountain, talk with their friends and order the delicious coffee in restaurants in that area too.\nClock towers\n]]\nSahat Kulla (The clock tower) is the city's clock, built in the 19th century by Jashar Pashe Gjinolli. It is 26 meters high and in hexagon's shape. The original object was damaged by the fire, but was reconstructed later. It's protected by the state since 1867. In 2001 its original bell, which was brought from Moldavia, was stolen. KFOR changed its old mechanism with a new electric one. Considering Kosovo's problems with electricity supply, the clock tower barely tells the right time.\nResidential buildings\nUrban traditional houses\nEmin Gjiku is a traditional, preserved house which is protected by the state. Nowadays, it serves as an Ethnological Museum, but back in the 18th century it used to be just an ordinary house that belonged to Emin Gjinolli. “Emincik” (“Emin Küçük” meaning “little man” in Turkish) is referred to the owner's nickname, which is also the name of the museum. The museum includes ancient weapons, tools, traditional clothing, handicrafts and other elements which are all aged during the Ottoman Empire. Despite that, the museum also sells traditional gifts including white eggshell plies hats.\n, Prizren]]\nComplex of Albanian Prizren League is the complex honors Albanian Prizren League held in June 1878. League of Prizren was not just a meeting of prominent political leaders, military and culture or just an idealistic meeting. It represented the will of the all Albanian nation. In 1999 the front part of the building was burnt down. It has been reconstructed and transformed into a museum. It is the most important monument of Prizren and it is visited by many tourists, especially during the events that are held in Prizren on holidays every year.\nThe Köroĝlu House is a traditional house of the 19th century built by the Köroĝlu family.  The house is located in the “Kaçamak Mahalla”, in the old city center of Mitrovica. It is a typical Ottoman house built 200 years ago, therefore it is protected under the status number 02-354/78. Even though a property of Ergin Köroĝlu, former Deputy Minister of Culture, Youth and Sports, the house is not being used anymore.\nThe House of Blagoje Đorđević is located in the North Mitrovica, since 1980 used to be a shelter for the national liberation activists in 1941. There was established the Council of the Regional National Liberation Fund headed by Blagoje Ðorđević. This institute collected financial and material means for the National Liberation Movement of Yugoslavia. After the Second World War it became a museum.\nCitizen Urban Houses Bajmak are two houses located in the Marash Complex, on the left stream of Lumbardhi i Prizrenit river in Prizren. They were built in the 18th century by local skillful craftsmen. They were constructed with different materials as stone, clay, combinations of timber frames and mud bricks. Their floors, stairs and roof construction are made by timber. Roofs are covered with clay tiles, while the facades are plastered with mud. The buildings comprise a ground floor and a first floor, and a garden. In their interior it can be noted characteristic timber-lined ceilings and wooden cupboards.\nHouse of the Kirajtani Family is the house of Shemsedin Kirajtani, a protected building by the Institute for Protection of Monuments in Prizren. It is located in the city center, accurately in Sub-Zone 1 of the Protected Historic Zone of Prizren. It was built in the 19th century, while in 1970 a new annex on the north-west side was added. In the house's lovely yard is also found the stable. This civic building with local attributes lays in a basement, ground floor and an unfinished first floor. Its foundations are made of stone and mortar, while the walls of clay with mud joints. Roof has a wooden construction and is covered by concave clay tiles. The interior elements as the windows, ceilings, stairs, and cupboards are also made of wood. Ceilings of the house are highly decorated. Its front façade is symmetrical with traditional features. Rooms on the first floor look like a large dormer in the roof, which makes the house unique.\nHouse of Qyse Family is located in the eastern part of the city center, in the Protected Zone 1 of Prizren. It was built in 1830 and renovated in 1996 to fulfill the family needs.  Traditional architecture and documentation methodologies. Nearby the Marash Park and Lumbardhi i Prizrenit river are found. The house is oriented towards the river, and lies just under a cliff above which dominates the Fortress of Prizren. The street in front of the house was paved with cobble stones (kalldërm) till 2003, when they were replaced with concrete slabs. Qyse House lies in two stories. The ground floor at the beginning had only one a room and a small corridor. Later were added two rooms and a bathroom. The first floor had an irregularly shaped hall, a living room with bathroom (hamamxhik), stove, toilet and changing space. After the renovation, it has the hall, two bedrooms, storage, and two bathrooms. Its main construction material of the basement and walls is stone. Walls are filled with a mixture of clay and wood (qerpiq) for its isolation properties. The floor and upper gallery are made of wood. Roof is constructed with wooden truss and covered with clay tiles. Just above the facades, two layers of the roof are made of stone tiles, used for their self-weight. The front façade is composed by the gallery, roof eaves and large symmetrical windows of the first floor.\nHouse of Musa Shehzade was built at the end of 18th and beginning of the 19th century in Prizren. It was used as a residential house till 1980. It has not been in use till 2012 when it was restored and turned into Ethnological Museum. It is a monument under permanent protection.\nThis building is an example of houses with central garret (čardak). Its asymmetry is due to the narrow location. The house lies in two floors. Its ground floor is composed of the main entering hall, living room with small bath (hamamxhik), one room, porch (hajat) with carrel (qyshk), and the toilet. Wooden L-shaped stairs lead to the first floor which is made of the hall, the main living room with hamamxhik, two rooms, garret (cardak), storage and toilet. House used to have wooden roof till 1999 when the owner changed it. Since then it has been causing damages to the whole structure of the house. Its interior is rich on ethnographic elements, mostly noted in the fireplaces (stacks). Ceilings and closets and cupboards and doors are also well graved on the wood. The main living room is the most important are in the house therefore has the most sophisticated decorations.\nThe Pantić House is located in the center of Velika Hoča village of the Rahovec municipality. This 150 years old house was restored and adapted into Bed & Breakfast accommodation, which offers comfortable and cozy atmosphere. It is composed of a dining room, kitchen, bathroom and storage on the ground floor, and three comfortably furnished rooms, a bathroom and a gallery on the first floor. The garden has many flowers. Besides this, the house offers views of the surrounding landscape.\nThe Spasić House is the most characteristic traditional house in the Velika Hoča village. It was built during the first half of the 19th century by a family ancestor, who was a pilgrim to Jerusalem. What makes this building unique are its pronounced facades, its cantilevered elements on the upper floor, the large gates with separated entrances for pedestrians and vehicles, old-fashioned locks and hinges, and the decorative stone slate canopies. It is also a Bed and Breakfast house that offers two double bedrooms, a bathroom and a ‘Jerusalem Chamber’ in the first floor. The ‘Jerusalem Chamber’ is the most representative part of the house, which has a family iconostasis and relicts brought by the pilgrimage. On the ground floor are found the living room, kitchen, bedroom and a bathroom.\nBelediya building was built by the end of the 18th century as the municipality for Ottoman authorities in Prizren. It is located in the historical zone of the city. It is a unique building incorporated perfectly in the surrounding area and built in a human scale. In 1911 Sultan Rashady was settled in Belediye. He called for fair judge in the name of God, and restated that “all citizens living under his dynasty should be happy”. The building was restored and adapted to the first Regional Centre of Cultural Heritage in Balkans, used as a training center for professionals and interns of the Cultural Heritage.\n]]\nRural fortified houses - Kullas\nTower of Junik was built in the 18th century and is located in Junik. It is known for large architectural value and historical importance.\nTower of Dullshaban is also known as the monumental towers of Loshajve, was built in the 18th century, in Carrabreg village of lower Deçan. It was burned by Yzugoslav forces and in the absence of institutional and private care, it was leveled with the ground. Although it is burnt, this tower's architectural features walls look monumental to the same, and it has been preserved and maintained as such.\nTower of Haxhi Zeka was built by Albanian ethnicity craftsmen and is the most developed example of this type of tower in cities of Kosovo of the 19th century. It was used for the meetings of Albanian patriots led by Haxhi Zeka, who was an eminent Albanian fighting for independence of Albania and all Albanian territories. Due to its historical and architectural values, this building became a protected monument. It was built near the Haxhi Zeka square in Peja and has a direct access by the street. Adjacent to tower is the family house, which was built during the 18th and 19th century. It has a prismatic volume, upraised in a nearly square base and its massive construction is made of stones. The tower has the ground floor and two other floors, where on the top floor is noted the stylish ‘dyshekllëk’. The balanced front façade made by hewn stones together with the entering arched gate and ‘dyshekllëk’ make the tower quite civilized and sophisticated. It is also known for its fine-treated windows and embrasures. Symbols of the lion and Star of David can be seen on the walls. Its decorative parts in the interior are the ceilings and metallic handles of the doors and windows. Even though it had several interventions, it still has its main attributes and originality.\nThe Kostić tower is also located in the center of Velika Hoča village, near to the complex of Visoki Dečani monastery. It is a fortified stone tower built during the 18th and 19th centuries. It is constructed by local materials as stone, adobe mud brick and timber. Thus it makes a good example of traditional vernacular architecture. Since 2010 it has been adapted to Bed & Breakfast. It offers two furnished rooms and a bathroom in the first ground, while in the ground floor are the living room, dining room, kitchen, bathroom and storage. There are served traditional food and drinks.\nTower of Mazrekaj Family was built in the 19th century in the historical core of the Dranoc village. It has a square plan with approximately 10x10 meters dimensions. Its walls and foundations are made of stones jointed by lime mortar, while the floor construction is made of timber. The dividing walls and the interior elements as floor, doors, window frames, stairs, and fences are also made of wood. The ground floor was used as a stable for cattle. The first floor, accessed by the outside stairs was used as private quarters of the family. The second floor was used as a gathering room only for men, also called ODA.\nIn 2004 tower got restored. Since 2005, it was used for social and cultural activities for three years in row. After that it was turned into a modest Bed and Breakfast. Nowadays the ground floor is used as a conference hall and gallery, and the first floor offers modern equipped bedrooms, a kitchen and a bathroom. It is reached directly by the ground floor. The top floor, or Oda, is used for meetings or as a sleeping room for guests. Its interior has remained entirely original. tower has historical, functional, social, authenticity, economical and landscape values.\n'''Koshi's tower''' was constructed in the 19th century, near the city's bazaar in Gjakova. It is under protection by law on cultural heritage since 1980. It is a three floors house made of stones. People used to call it “Batusha’s Tower” because it belonged to Batusha's family many of whose members were active in wars during the Albanian renaissance. It is one of the rarest examples of a pure stone tower preserved in the city.\nOld Complex of Towers is a complex is positioned in Deçan. It is constructed in 18th-19th century. Presents the integrity, rural agglomeration. The complex consist of many quarters. It has architectural and artistic values.\nTower of Zymer Mushkolaj is positioned in Deçan and it dates from the 18th century. It has three floors with wooden gallery. It was seriously damaged and nowadays it has only the remains of the walls.\nTower of Osdautaj is located in the Isniq village. It has been the property of Dautaj's family throughout its existence. It is made of stones and represents a monument of Albanian architecture.\nTower Shehu is a three floor building constructed in the end of the 18th century. It is based on the compositional layout consist of wooden and stone gallery. Nowadays it has only its remains.\nTower Sylaj is a stone tower, constructed in the end of the 19th century. It has three floors, where each floor has a particular function. The first floor was used as stable, the second one was used for living whereas the third floor was the men room/Oda e burrave. Nowadays it has only the remains of its constructive walls.\nTower Habib Avdyli was constructed in the end of the 19th century. It had only two floors but nowadays it has only the remains of the walls.\nModernism Period\nHotels\nHotel Union is a hotel located in Pristina, constructed in 1927 by an Austrian architect. It has been under protection since 1996.\n, Pristina]]\nMuseums\n'''Kosovo's Museum''' was constructed in 1949 in an Austro-Hungarian architecture construction style, which dates from 1898. It consists of a collection of more than 50.000 different profiles such as archeology, technology, history, nature, folklore, heritage etc., which date about 6000 years BC. A numerous exhibitions were organized, such as “Nena dashuri e madherishem”, exhibitions for the missing persons, “Amerika for Kosovo”, the one for NATO’s interventions during the Kosovo's war and many others.\nLibraries\nHivzi Sylejmani Library was founded by the Municipal Assembly in 1963 in Pristina. At the beginning it had approximately 1,300 books in Albanian and Serbian as well as many brochures, leaflets and local newspapers, which mainly were about the wartime. Its original name changed during the years. During Kosovo’s war in 1999, the library was deeply damaged, but after that it opened many other branches all over Kosovo.\nOther important buildings\n, Pristina]]\nThe Newborn monument is a  monument made of steel letters spelling the word Newborn, which weighs about nine tones. It is located in the center of Pristina in front of the Palace of Youth and Sports. It is painted yellow and has citizen's signatures all over it in order that every person who lives in Kosovo, can leave their footprint on the monument. The monument was unveiled on the day of the declaration of independence of the Republic of Kosovo. It has been awarded with several prizes worldwide and is under protection of the government of Kosovo.\nSee also\n*Islamic monuments in Kosovo\n*Timeline of Kosovo history\n*Tower houses in the Balkans\n*Destruction of Albanian heritage in Kosovo\n*Destroyed Serbian heritage in Kosovo\nReferences"
    }
  ]
}