{
  "content": [
    {
      "type": "text",
      "text": "# Monument to the Heroes of 1896\n\n| catalogue          =\n| medium             =\n| movement           =\n| subject            = Katipunero\n| height_metric      =\n| width_metric       =\n| length_metric      =\n| diameter_metric    =\n| height_imperial    =\n| width_imperial     =\n| length_imperial    =\n| diameter_imperial  =\n| dimensions         =\n| dimensions_ref     =\n| metric_unit        = cm\n| imperial_unit      = in\n| weight             =\n| designation        =\n| condition          =\n| museum             =\n| city               = University of the Philippines Diliman, Quezon City\n| coordinates        =\n| owner              =\n| accession          =\n| preceded_by        =\n| followed_by        =\n| module             =\n| website            =\n}}\nThe Monument to the Heroes of 1896 (, ) is a sculpture created in 1911 dedicated to the Philippine Revolution.\nHistory\nThe Monument to the Heroes of 1896 was a privately funded venture and was inaugurated on September 3, 1911. It initially was installed at the site where the Balintawak Cloverleaf currently stands. Every August 26 until 1961, the Cry of Balintawak, which is widely regarded as the start of the Philippine Revolution, was commemorated at the site. In 1962, the observance's name was officially changed to \"Cry of Pugad Lawin\" and its date moved to August 23.\nThe monument was dismantled in 1968 by the Bureau of Public Highways (BPH; now the Department of Public Works and Highways), to give way for the extension of the Manila North Diversion Road (MNDR; now the North Luzon Expressway) and the construction of the Balintawak Cloverleaf. The sculpture was stored along with garbage at a field office of the BPH. As a response various student groups campaigned to preserve the monument.\nThe National Historical Commission (NHC) under its Chairman Carmen Guerrero Nakpil coordinated with University of the Philippines President Carlos P. Romulo for the relocation of the statue to the university's Diliman campus. The monument was inaugurated again on November 29, 1968, in front of the UP Vinzons Hall.\nSculpture\nThe Monument to the Heroes of 1896 was created by Ramón Martínez y Lázaro. The sculpture depicts a generic Katipunan member – although it is widely believed to depict Andrés Bonifacio. The sculpture portrays a yelling male figure raising his hands; his left holding a Katipunan flag and the other a bolo knife.\nHistorians believe that the monument was the first memorial dedicated to Andrés Bonifacio and his revolutionaries preceding the 1933 Bonifacio Monument. The monument is dedicated to the Philippine Revolution, particularly the Cry of Pugadlawin.\nReferences\nExternal links\n*"
    }
  ]
}