{
  "content": [
    {
      "type": "text",
      "text": "# Monument to John Cockerill, Brussels\n\n|}}\n| image         = Belgique - Bruxelles - Monument à John Cockerill - 04.jpg\n| image_size    =\n| caption       =\n| location      = Place du Luxembourg / Luxemburgplein1050 Ixelles, Brussels-Capital Region, Belgium\n| mapframe      =\n| designer      =\n| type          =\n| material      =\n| length        =\n| width         =\n| height        =\n| weight        =\n| visitors_num  =\n| visitors_year =\n| begin         =\n| complete      =\n| dedicated     =\n| open          =\n| restore       =\n| dismantled    =\n| dedicated_to  = John Cockerill\n| coordinates   =\n| website       =\n| extra_label   =\n| extra         =\n}}\nThe Monument to John Cockerill (; ) is a group of statues erected in Brussels, Belgium, in memory of the Belgian-British industrialist John Cockerill, a pioneer of the steel industry and the railways in Belgium in the 19th century, as well as the industrial workers of Belgium.\nThe monumental group was designed in 1872 by the sculptor  in eclectic style. It stands in the centre of Place du Luxembourg/Luxemburgplein in Ixelles, with its back to the former Brussels-Luxembourg railway station's entrance and to the postmodern buildings of the Espace Léopold, seat of the European Parliament in Brussels.\nHistory\nInaugurated in 1872, the monument is a near copy of the monument erected in 1871 by the sculptor  outside Seraing's Town Hall in Liège Province (Wallonia), where the heart of John Cockerill's industrial empire was located. The creation of the monument, authorised by the sculptor, was financed by Willem Rau, a collaborator of Cockerill. The monument was probably erected in front of Brussels-Luxembourg railway station because it was one of the first stations in Brussels, and Cockerill's workshops supplied Belgium's first rails, wagons and locomotives.\nOn 1 February 2024, the monument was vandalised during a farmers' protest that took place in front of the European Parliament. Specifically, the statue of the mechanic Beaufort, one of the four figures surrounding the industrialist, was torn from the pedestal and left on the ground, in the middle of burning wooden pallets. According to Yves Rouyet, Ixelles' Heritage Councillor: \"It has a crack in its arm, leg and lower back; the worker's tool melted and the extreme heat removed the patina\". It was sent to Ghent for restoration. The statue was restored over the course of 2024 and replaced on 13 December 2024, including the full restoration of the worker's compass, which had been damaged long before the vandalism.\n]]\nDescription\nThe monument consists of a bronze summit statue of Cockerill leaning on an anvil and standing on a rectangular blue stone pedestal. The monument pays tribute not only to Cockerill but also to the industrial workers of Belgium, represented by four bronze statues installed around the industrialist.\nThe pedestal, topped with a laurel wreath, is decorated on each side with medallions that once contained the bronze effigies of some of Cockerill's main collaborators: Rau, Pastor, Poncelet, Memminger, Alexander, Wéry and Brialmont, as can seen on old postcards. Their names remain engraved.\nThe corners of the pedestal are flanked by four workers: the glass-blower or blacksmith Lognoul, the mechanic Beaufort, the puddler Lejeune and the coal miner Jacquemin. However here, unlike in Seraing, the workers are represented seated and their statues, made by the Compagnie des Bronzes de Bruxelles, are in bronze rather than cast iron.\nOn the front of the pedestal there is an inscription with the words \"To John Cockerill, the father of workers\". The sides of the base of the pedestal read \"Intelligence\" on the right and \"Work\" on the left, as well as \"1790-1840\", Cockerill's dates of birth and death, on the back.\nFile:Belgique - Bruxelles - Monument à John Cockerill - 02.jpg|John Cockerill\nFile:Belgique - Bruxelles - Monument à John Cockerill - 05.jpg|The mechanic Beaufort\nFile:Belgique - Bruxelles - Monument à John Cockerill - 08.jpg|The glass-blower or blacksmith Lognoul\nFile:Belgique - Bruxelles - Monument à John Cockerill - 11.jpg|The coal miner Jacquemin\nFile:Belgique - Bruxelles - Monument à John Cockerill - 06.jpg|The puddler Lejeune\nSee also\n* Sculpture in Brussels\n* History of Brussels\n* Culture of Belgium\n* Belgium in the long nineteenth century\nReferences\nCitations\nBibliography\n*\n*\nExternal links\n*"
    }
  ]
}