{
  "content": [
    {
      "type": "text",
      "text": "# Monumental Cemetery of Crotone\n\n| location     = Viale Antonio Gramsci, 288900 Crotone, Calabria\n| country      = Italy\n| coordinates  =\n| type         = Multireligious\n| style        = Monumental Eclecticism\n| owner        = City of Crotone\n| size         =\n}}\nThe Monumental Cemetery of Crotone () is the monumental cemetery of the city of Crotone, located in Calabria, Italy.\nIt is situated near the southern part of the city, opposite the seafront along Viale Antonio Gramsci, covering an area of 4.55 hectares.\nHistory\nThe cemetery was inaugurated on 2 February 1843, marking a significant change in burial practices as interments moved from church interiors to designated spaces outside urban centers, in accordance with hygienic reforms introduced in the 19th century. These reforms were shaped by the 1804 Edict of Saint-Cloud, issued during Napoleon's rule and later reinforced by the Medical Police Edict of 5 September 1806. Before this transition, burials took place in locations such as the Cathedral of Crotone, the Convent of the Observance, and the Church of the Carmine. Despite its establishment, the cemetery remained neglected for decades under the management of various municipal administrations.\nIt was only in the late 19th century that improvements transformed it into a more dignified and structured burial site. In 1893, the cemetery expanded to include private chapels commissioned by Crotone’s wealthiest families, elevating its character from a simple communal burial ground to a monumental site adorned with funerary structures. These chapels, often inspired by classical temple forms, featured wrought iron gates and allegorical symbols such as skulls, winged hourglasses, inverted torches, and floral wreaths, representing the cycle of life and death and the soul's passage to eternity. The chapel of Baron Luigi Berlingieri (1816–1900), constructed between 1895 and 1896, exemplifies the funerary architecture of the era, combining elegance with simplicity. Other notable chapels include those of the Giglio, Asturi, and Lucente families, each contributing to the cemetery's monumental and aesthetic significance. The cemetery's artistic and cultural importance grew further in 1897 with the addition of a central stone cross, initiated by Fr. Luigi Covelli and placed at the intersection of the main avenues. This cross became a focal point for visitors and a testament to the community's Christian faith. Earlier, in 1890, the Municipal Council had classified the road connecting the cemetery to the city as a municipal road to ensure better access, with construction beginning in 1893.\nThe cemetery's administration faced numerous challenges in the 20th century, including maintaining hygienic standards as required by the 1864 sanitary regulations, which imposed strict rules on transportation and burial practices. Funerals were mandated to take place during daylight hours, and processions were prohibited after sunset to ensure public health and decorum. Fr. Armando Camposano (1879–1953), chaplain of the cemetery from 1903, provided a detailed report in 1910 documenting its condition and emphasizing the need for its preservation as a place of memory and respect. Camposano, later archdeacon of the Cathedral of Crotone, also documented efforts to formalize regulations, including Ordinance No. 251 issued by Mayor Carlo Turano, which outlined rules for access and use of the cemetery. In January 1944, facing significant financial challenges during the war, the municipality of Crotone, under Commissioner Orazio Laino (1888–1944), introduced measures to increase revenue. One notable change was the doubling of fees for land use in the municipal cemetery, particularly for the construction of cappelle gentilizie (English: family chapels), raising the cost from 100 to 200 lire per square meter. This adjustment was part of a broader strategy to revise local taxation and address the financial strain caused by wartime conditions and the ongoing economic crisis.\nMemorials\nThe cemetery includes the graves of:\n* Anselmo Berlingeri (1852–1911), politician, former mayor of Crotone\n* Luigi Berlingeri (1816–1900), politician, former mayor of Crotone\n* Rocco Gaetani (1957–2020), politician\n* Domenico Lucente (1943–2022), politician, former mayor of Crotone\n* Raffaele Lucente (1831–1890), politician, former mayor of Crotone\n* Falcone Lucifero (1898–1997), former Minister to the Royal Household of the Kingdom of Italy\n* Giulio Marino (1842–1901), gardener and superintendent of Crotone's public gardens, vividly depicted by George Gissing in By the Ionian Sea\n* Tina Nicoletta (1961–2023), songwriter, musician and writer\n* Giuseppe Pugliese (1947–2020), politician\n* Giovanni Scalise (1883–1968), painter\n* Ezio Scida (1915–1946), footballer, for whom the eponymous stadium is named\n* Nicola Sculco (1846–1913), historian\n* Riccardo Sculco (1858–1931), physician and politician\n* Pasquale Senatore (1940–2015), politician, former mayor of Crotone\n* Giancarlo Sitra (1949–2020), politician\n* Carlo Turano (1864–1926), politician, former mayor of Crotone\n* Luigi Vrenna (1909–1992), a mafia member of the 'Ndrangheta\nCultural references\nThe cemetery has attracted the attention of international figures, including English writer George Gissing, who visited Crotone between 1897 and 1898. In his travelogue By the Ionian Sea: Notes of a Ramble in Southern Italy, Gissing described the cemetery as a unique and evocative place, noting how the chapels reflected respect for the deceased and symbolized Crotone's collective memory. This literary account brought the cemetery to a broader audience, highlighting its cultural and spiritual significance.\nGissing's journey was inspired by the earlier travels of French archaeologist François Lenormant, who explored Southern Italy in the late 19th century. Lenormant's work La Grande Grèce detailed his explorations of Magna Graecia's ancient sites, including those in Calabria. His writings influenced subsequent travelers, such as Scottish writer Norman Douglas, who retraced these routes in his 1915 book Old Calabria. Both authors, like Gissing, were captivated by the region's rich history and cultural heritage, contributing to a broader appreciation of Southern Italy's archaeological and historical significance.\nReferences\nWorks cited\n*\nSee also\n* Crotone\n* List of cemeteries in Italy"
    }
  ]
}