{
  "content": [
    {
      "type": "text",
      "text": "# Monument to Moret (Cádiz)\n\n}}\nThe Monument to Moret is an instance of public art in Cádiz, Spain. Designed by Agustín Querol, it consists of a bronze statue of Liberal politician Segismundo Moret (who enjoyed the honorary recognition as \"favourite son\" of the City of Cádiz) put on top of a pedestal displaying elaborated allegorical reliefs.\nHistory and description\nA noted 19th century politician (later prime minister in the early 20th century), Moret played a key role as Overseas Minister in the abolition of slavery in Puerto Rico in 1870. Funded via popular subscription, the design was awarded to Agustín Querol. The foundation stone was laid in February 1908.\nThe monument was unveiled on 28 November 1909. It was a relatively rare case of monument inauguration when the honoured was still alive. Moret reportedly commented that he disliked such kind of tributes in life, adding that had \"a feeling that it will cost him some displeasure, for fortune is very fickle for politicians\". Yet, in fact, the sculptor, Querol, died before Moret, dying just a few days after the inauguration.\nFollowing the description by , the bronze statue of Moret can be described as follows: The figure of the speaker stands with affected arrogance in front of his parliamentary seat: his forehead high, his expression serene and expectant, sporting his venerable beard and his characteristic mustache, crossing his arms with great naturalness, clutching with his right hand the notes he gathered to reply to his opponent's speech.\nThe four sides of the monument display inscriptions respectively reading  (\"Patriotism\"),  (\"Freedom\"),  (\"Loyalty\"),  (\"Eloquence\"). A marble cartouche put on the front side reads  (\"Cádiz to Moret\").\nThe back side inscription in the pedestal reads  (\"this monument was erected by popular subscription initiated by the Most Excellent Ayuntamiento following a proposal by its Mayor–President, Most Excellent and Most Illustrious Don Cayetano del Toro y Cuartellers. Year 1906\").\nIn 1953, the monument was relocated from its original placement at the plaza de San Juan de Dios (then known as \"plaza de Isabel II\") to the plaza de Sevilla. In 1960, it was relocated again, this time to the plaza de la Aduana. The monument was returned to its original location in 2012.\nReferences\n;Citations\n;Bivbliography\n*\n*\n*"
    }
  ]
}