{
  "content": [
    {
      "type": "text",
      "text": "# Monument City, Huntington County, Indiana\n\nMonument City is a former settlement in Huntington County, Indiana.\nLocated at the current site of the Salamonie Reservoir in southern Huntington County, the parking area to view the remains of Monument City is located near the coordinates 40°45’49.45″ N 85°35’31.64” W.  Monument City was covered by the damming up of the Salamonie River to create Salamonie Lake in 1965.  When the reservoir is low, remains are visible.  Former residents are now scattered throughout Huntington and the surrounding counties, although many have died since the destruction of the town.\nThe cemetery (Monument City Memorial Cemetery) that existed in the town was relocated to a different area of Polk township and is still in use and open to those who wish to visit it. The cemetery includes the original monument that the city was named for, listing those from Polk Township who lost their lives in the Civil War.\nThe site of the former Monument City came into view again during the severe drought of 2012, as reported in an article by Jill Disis in the Indianapolis Star for Sunday, July 22, 2012. The article reported that, by late July, the Salamonie Reservoir's water level was so low that tourists and other curious visitors were able to walk among the foundations of houses and a school. Later that same day, Indiana's Department of Natural Resources announced that the site would be closed to further visits.\nLiterary connection\nThe town was memorialized in 1981 with the publication of poet Jared Carter’s prizewinning first book, Work, for the Night Is Coming, which contained the 28-line poem \"Monument City\". It is the second in a series of eight poems in Carter's \"reservoir saga\" and is preceded in the same volume by \"The Undertaker\" and followed in Carter's second book by \"Mississinewa Reservoir at Winter Pool\".\nIn such poems, Carter conflates the actual Mississinewa, Salamonie, and Wabash Rivers (and their respective reservoirs) into the imaginary Mississinewa River that flows through his equally imaginary Mississinewa County, in order to create the single reservoir located in that county.\nIn an interview conducted in 1995, he explains the background of the poems and discusses his visits as a journalist to the actual Monument City and other small towns that were displaced by the three dam-building projects in northeastern Indiana in the early 1960s.\nReferences\nExternal links\n* [http://news.cincinnati.com/usatoday/article/56497680 Article in the Cincinnati Enquirer, 26 July 2012] \"Drought Reveals an Ind. City under a Reservoir.\""
    }
  ]
}