{
  "content": [
    {
      "type": "text",
      "text": "# Mooga, Queensland\n\n| pop                 = 49\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4413\n| area                = 169.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 37.4\n| dir1                = NE\n| location1           = Roma\n| dist2               = 43.4\n| dir2                = NW\n| location2           = Wallumbilla\n| dist3               = 355\n| dir3                = WNW\n| location3           = Toowoomba\n| dist4               = 482\n| dir4                = WNW\n| location4           = Brisbane\n| lga                 = Maranoa Region\n| stategov            = Warrego\n| fedgov              = Maranoa\n| near-n              = Durham Downs\n| near-ne             = Durham Downs\n| near-e              = Pickanjinnie\n| near-se             = Pickanjinnie\n| near-s              = Blythdale\n| near-sw             = Euthulla\n| near-w              = Euthulla\n| near-nw             = Eumamurrin\n}}\nMooga is a rural locality in the Maranoa Region, Queensland, Australia. In the , Mooga had a population of 30 people.\nGeography\nThe Roma-Taroom Road forms part of the north-western boundary on the locality.\nOn the surface, the land use is predominantly grazing on native vegetation with small amounts of crop growing. Coal seam gas is extracted from beneath the surface throughout the locality.\nHistory\nThe name Mooga was derived from the pastoral run name, which was an Aboriginal word in the Mandandanji language, meaning kingfisher.\nMooga Provisional School opened on 1 August 1904. It was described in 1905 as having \"practical, intelligent, and resourceful methods of teaching\" making it \"the best taught provisional school in the district\". On 1 January 1909, it became Mooga State School. It closed on 18 April 1937. It was on the northern side of Mountainview Road, within the present-day locality of neighbouring Euthulla ().\nDemographics\nIn the , Mooga had a population of 17 people.\nIn the , Mooga had a population of 30 people.\nEducation\nThere are no schools in Mooga. The nearest government schools are Wallumbilla State School (Prep to Year 10) in Wallumbilla to the south-east and Roma State College (Prep to Year 12) in Roma to the south-west. Students in the north-east of Mooga may be too distant for a daily commute to Roma; the alternatives are distance education and boarding school.\nReferences"
    }
  ]
}