{
  "content": [
    {
      "type": "text",
      "text": "# Morgan Stewart's Coming Home\n\n| music          = Peter Bernstein\n| cinematography = Richard E. Brooks\n| editing        = Robert Lederman\n| studio         = Kings Road Entertainment\n| distributor    = New Century Vista Film Company\n| released       =\n| runtime        = 95 min.\n| country        = United States\n| language       = English\n| budget         = $7 million\n| gross          = $2,136,381\n}}\n'Morgan Stewart's Coming Home' is a 1987 American comedy film starring Jon Cryer, Viveka Davis, Paul Gleason, Nicholas Pryor and Lynn Redgrave. The screenplay was written by Ken Hixon and David N. Titcher. The film was also released as Home Front and Homefront Riviera in some countries. The film was directed by Paul Aaron and Terry Winsor, but upon release the director was listed as \"Alan Smithee\", a name often used when directors ask to remove their names from a picture.\nPlot\nMorgan Stewart is the son of a Republican senator from Virginia who has spent most of his life away at boarding school. While disappointed he cannot spend Thanksgiving with his parents, it does not faze him. He pulls off a major prank with three of his friends only to be busted by the Headmaster. Coincidentally, Morgan is told to he is going home when his mother calls the school and is ready for him to finally return.\nMorgan is brought home to help with his father's campaign for re-election as Senator with family being the notion he sets to bring. However, Morgan's mother expects him to be conservative while his father tends to be more open to the fact that Morgan is growing up. Along the way, Morgan butts heads with both his mother and Jay, the campaign manager. Morgan decides to start doing what it takes for the family to be together, including doing chores like waxing the floors. When Morgan goes to a book signing for his idol George A. Romero, he meets fellow horror film fan Emily and the two soon begin a relationship. When Morgan \"borrows\" the car to go on a date with Emily, he is busted when Emily's little brother calls the police and is grounded.\nMorgan soon learns that his mother has placed cameras in his room. When Morgan learns he and his father have a lot more in common than he imagined, he still faces the wrath of his mother. This comes when Emily learns that Morgan had lied about his parents but when Morgan finally loses it after losing her, he is threatened with military school by Jay. Morgan escapes using a chainsaw signed by The Texas Chain Saw Massacre's Tobe Hooper. He finally comes clean to Emily, who forgives him and the two decide to open Morgan's coin collection that his late aunt left him (after he pickpocketed Jay to get the key). They learn that Jay has been embezzling campaign funds with the safety deposit box with the coin collection also containing evidence of the embezzlement. When Jay learns what has happened, he tries but ultimately fails to stop Morgan.\nThe end result would be Senator Stewart getting re-elected. Morgan's mother finally decides to give up her vegetarian lifestyle and eat meat. Jay serves prison time. The family butler, Ivan, becomes a real estate tycoon and leaves wife Francheska for a younger woman. Francheska returns home to Russia happily single and back on her farm with her keeping in touch with Morgan. Emily is accepted by Morgan's parents and Morgan is finally happy he has a family once again.\nProduction\nThe film was made in 1985 under the title Home Front directed by Terry Winsor. Four weeks after filming started, Winsor was fired. He was replaced by Paul Aaron but neither received credit on the film.\nFilm locations\n* 6th Street and Pennsylvania Avenue, SE\n* Lincoln Memorial—east side\n* Riggs Bank—Lafayette Park\n* Rock Creek Parkway\n* Washington Monument\n* White House—North Side\n* Charlottesville, Virginia—Downtown Mall & Fashion Square Mall\n* Richmond, Virginia—The University of Richmond campus\n* Miller School of Albemarle, Crozet Virginia\nSoundtrack\nThe soundtrack included the opening track 'Painted Moon' by The Silencers and music by Peter Bernstein, Timothy Duckworth, Bernard Herrmann, Chris Isaak, John Manikoff, and The Surfaris.\nCritical reception\nCritics generally felt the film to be poor, although the cast, especially Jon Cryer, was usually praised.  The New York Times noted that \"It's hard to imagine any adult sitting through this movie without dozing off or cracking up, but it's a harmless enough fantasy, and if Jon Cryer's career takes off -- he's due in at least two more films, Dudes and Superman IV -- Morgan Stewart may find a place in the archives as an early little movie in which the star wasn't nearly matched by the material.\"\nRob Lowing of The Sydney Morning Herald wrote of the film \"there are three good reasons to see it.  However, these don't include the direction, storyline or soundtrack.\"  She was particularly critical of the direction:  \"Director Smithee should cop most of the blame...a camera which wanders all over the place, a totally bland soundtrack, and fussy repetition of ideas...\" Conversely, Lowing singled out actors Paul Gleason, Lynn Redgrave and Jon Cryer as the three central attractions of the film, noting that \"there are flashes of brilliance, though, particularly when Cryer and Redgrave are left alone to strut their stuff.\"\nReferences\nExternal links\n*\n*\n*\n* [https://www.nytimes.com/1987/06/04/movies/film-morgan-stewart-a-confused-teen-ager.html New York Times review]"
    }
  ]
}