{
  "content": [
    {
      "type": "text",
      "text": "# Moritz Bergstein Shoddy Mill and Warehouse\n\n| locmapin = Minnesota#USA\n| built = c. 1890\n| architect =\n| architecture =\n| added = March 5, 2008\n| area = less than one acre\n| refnum = 08000133\n}}\nThe Moritz Bergstein Shoddy Mill and Warehouse are two historic industrial buildings in Stillwater, Minnesota, United States, in which Jewish German immigrant Moritz Bergstein conducted a recycling business circa 1890 to 1910 providing materials for mattresses.  They were originally built in Oak Park Heights, Minnesota, around 1890 and were moved to neighboring Stillwater in 2012 to make way for construction of the St. Croix Crossing bridge.  The property was listed on the National Register of Historic Places in 2008 for its local significance in the themes of industry and social history.  It was nominated as a rare surviving embodiment of Minnesota's early Jewish immigrants and their frequent participation in the waste materials trade.\nHistory\nThe owners, Moritz and Bertha Bergstein, settled in Oak Park Heights (then known as Oak Park) in 1890.  They were in the business of recycling waste material.  The shoddy mill, a rubble stone building, was used to recycle waste fabric into material to stuff mattresses.\nMoritz Bergstein was known as the \"junk man\" in Stillwater, and in addition to making mattresses he also operated a salvage business.  He recycled waste paper, rags, scrap metal, and wood shavings, and he built a machine that tore up the rags.  He employed several women to fabricate the mattresses.  Later Bergstein entered into a partnership with his brother, Ignatz, to form a mattress-making firm.  Although Moritz eventually discontinued making mattresses in Oak Park Heights, he continued to buy and sell waste materials, mostly scrap metal.  When he died in 1923 he left behind \"about 500 tons of iron and old junk\", valued at about $3000.  The Stillwater Daily Gazette called him \"one of the best known men in Stillwater\" and noted that he was \"always honest and straight forward in his dealings.\"\nThere were few Jewish settlers in Minnesota in its pioneer days, so the story of the Bergsteins provides insight into early Jewish life in Minnesota.  The Bergsteins emigrated from Europe in 1880, during a time when many Jews were emigrating from eastern Europe, but Moritz was born in Germany and Bertha was born in Bohemia.  While many Jewish immigrants dealt in used goods and recycled materials, the Bergsteins were atypical because they lived in a town distant from other Jews, engaged in light manufacturing, owned property soon after they moved to Minnesota, and hired non-Jewish workers.\nRelocation\n]]\nAt the end of the 20th century the Bergstein Mill complex stood near the intersection of Minnesota State Highway 36 and State Highway 95, a location being eyed for a new bridge across the St. Croix River.  The Minnesota Department of Transportation (Mn/DOT) acquired and removed 66 houses in 1996, but the lone holdout was the owner of the Bergstein property, who operated an auto repair business out of them.  Mn/DOT funded a historical resource study which determined that the mill and warehouse were worth saving if a new location could be found.  A new site at the south end of Stillwater with similar qualities to the old setting was agreed to in 2005.\nThe Bergstein Mill and Warehouse were listed on the National Register of Historic Places in 2008.  By the following year the buildings' owner had reached retirement age and accepted a new offer to vacate.  Across the road the Bergsteins' original house, barn, and two outbuildings were demolished, while the two preserved buildings were moved in November 2012.  The new site is being developed as Bridgeview Park, and an adjacent railroad track is slated to become part of a bicycle trail that will loop between Stillwater and the Wisconsin shore utilizing a pedestrianized Stillwater Lift Bridge.  The city is still studying potential uses for the mill and warehouse, such as a bicycle repair shop, café, kayak outfitter, or visitor center.\nSee also\n* National Register of Historic Places listings in Washington County, Minnesota\nReferences"
    }
  ]
}