{
  "content": [
    {
      "type": "text",
      "text": "# Morning Star rebellion__disambig_1\n\nSweden\n| combatant2        = Närke peasants\n| commander1        =  Queen Christina\n| commander2        = Anders Månsson   Henrik Matsson   Olof Mårtensson   Nils Mårtensson\n}}\nThe Morning Star rebellion (Swedish: Morgonstjärneupproret) was a peasant rebellion which took place in the Swedish province of Närke in 1653. It was called \"Morning Star rebellion\" because of the mace, commonly called \"morning star\" given the shape of the head, which was used by the leader of the rebels as a royal scepter, and through which he was subsequently executed. While the rebellion was limited in support, compared to earlier peasant uprisings, it has survived in mythology and historiography as a vain but emphatic attempt by hundreds of peasants to dethrone Queen Christina, who abdicated the following year.\nPrelude\nThe situation in Sweden had been tense in the countryside in 1650, when the peasantry had protested and boycotted the law that required those living on the land of a noble family to serve in their land, protests which were however successful, as Queen Christina of Sweden had this duty limited by law. Nonetheless, it created tension. Persistent conscriptions among a population which had suffered grievous losses throughout Sweden's seventeen-year participation in the Thirty Years' War, but continued into the 1650s with wars against Poland and Denmark (which saw the apex of Swedish imperial power) was also a reason for malcontent.\nRebellion\nThe rebellion started in Närke in February 1653 as a protest against prescriptions of soldiers and hard taxation during a famine. Messengers calling for rebellion were passed among the peasantry and the rebels armed themselves and elected their leader as king and a maid as queen in the \"Peasant Kingdom\" they aspired to create. The majority of the rebels belonged to the poorest part of the peasantry, such as , destitute subsistence farmers, and Forest Finns rather than regular farmers (feudalism being, on the whole, unknown in Swedish history). Under the leadership of a former soldier, the rebels traveled around requiting more peasant soldiers from adjoining parishes with the plan to eventually engulfing the nation.\nA noblewoman who traveled through the area wrote to her son that a member of the peasantry estate in the Riksdag of the Estates had told some of her staff: \"What the peasants had in mind, that they wished to kill the nobility. Which is why I ask in the name of the death God has suffered, not to show yourself there... I do not know how I will travel up there, because they say they are as crazy in Småland...\"\nHowever, the rebels did not manage to secure support from the majority of the peasantry and find recruits sufficient to stand against the royal army commanded against them by Queen Christina and the government, headed by an aging Chancellor Axel Oxenstierna. The wealthier farmers refused to join, and many of the men who were requited only did so only under duress. The rebel army mainly traveled around in fruitless attempts to secure support and make recruits, and when the royal troops arrived, they initially managed to avoid them. Without support from the population, the rebels could not defeat the army and were soon betrayed and captured by royal troops.\nAftermath\nSome rebels, notably Anders Månsson i Holmen and Henrik Matsson i Gryten, were killed on the spot. The \"king\" and the military commander of the rebels, Olof Mårtensson and Nils Mårtensson, were taken to the capital of Stockholm and executed by breaking wheel in April 1653. The leader posing as a monarch had a crown of heated iron pressed over his head and his arms, legs and spin crushed by the mace he used as a scepter.\nReferences\n* Ambrius Jonny, Att dömas till döden, Strömbergs förlag, 1996\n* Englund, Peter, Ofredsår: om den svenska stormaktstiden och en man i dess mitt, 2. uppl., Atlantis, Stockholm, 1994, p. 517-18"
    }
  ]
}