{
  "content": [
    {
      "type": "text",
      "text": "# MOSAiC Expedition\n\nThe Multidisciplinary drifting Observatory for the Study of Arctic Climate (MOSAiC, ) expedition was a one-year-long expedition into the Central Arctic (September 2019 - October 2020). For the first time a modern research icebreaker was able to operate in the direct vicinity of the North Pole year round, including the nearly half year long polar night during winter. In terms of the logistical challenges involved, the total number of participants, the number of participating countries, and the available budget, MOSAiC represents the largest Arctic expedition in history.\nDuring its one-year-long journey, the central expedition ship, the research icebreaker Polarstern from Germany's Alfred Wegener Institute, Helmholtz Centre for Polar and Marine Research (AWI), was supported and resupplied by the icebreakers and research vessels Akademik Fedorov and Kapitan Dranitsyn (Russia), Sonne and Maria S. Merian (Germany) and Akademik Tryoshnikov (Russia). In addition, extensive operations involving helicopters and other aircraft were planned. In total, during the various phases of the expedition, more than 600 people were working in the Central Arctic. The international expedition, which involved more than 80 institutions from 20 countries (Austria, Belgium, Canada, China, Denmark, Finland, France, Germany, Italy, Japan, the Netherlands, Norway, Poland, Russia, South Korea, Spain, Sweden, Switzerland, the United Kingdom, and the United States), was conducted by the AWI and was led by the polar and climate researcher Markus Rex and co-led by the atmospheric researcher Matthew Shupe from the University of Colorado Boulder. MOSAiC's main goals were to investigate the complex and still only poorly understood climate processes at work in the Central Arctic, to improve the representation of these processes in global climate models, and to contribute to more reliable climate projections.\nThe expedition cost 140 million euros (approximately 154 million USD); half of the budget was provided by the German Federal Ministry of Education and Research (BMBF). U.S. participation was primarily supported by the National Science Foundation, which contributed roughly $24 million to the project, among the largest Arctic research initiatives the agency has ever mounted. The U.S. Department of Energy was also highly invested in the mission, funding nearly $10 million and providing the largest suite of atmospheric instruments.\nThe MOSAiC expedition\nIn the half-year-long Arctic winter, the sea ice is too thick for research icebreakers to penetrate. Consequently, data from the Central Arctic is virtually non-existent, particularly during winter. For reaching the Central Arctic in winter, the MOSAiC expedition followed in the footstep of Fridtjof Nansen's famous expedition with the wooden sailing ship Fram in the years 1893–1896, over 125 years ago. His daring voyage showed that it was possible to let a ship drift across the polar cap, from Siberia to the Atlantic, stuck in the thick sea ice and solely driven by the forces of the natural drift of the ice. Though Nansen has demonstrated the fundamental feasibility of such an endeavour, the scientific measurements possible in his days were still quite rudimentary. During MOSAiC, for the first time the Fram's drift was repeated with a research icebreaker, equipped with a veritable arsenal of cutting-edge instruments for exploring and recording the complex climate processes in the Central Arctic.\nThe heart of MOSAiC was the Polarstern's one-year-long drift through the Central Arctic. On 20 September 2019 the ship departed from the Norwegian port of Tromsø together with the Akademik Fedorov, proceeded east along the Siberian coast, and at roughly 125° East, turned north and began breaking into the sea ice of the Central Arctic, which was still feasible at that time of year. On 4 October 2019, at a position of 85° North and 134° East, the MOSAiC expedition found a suitable ice floe, which measured roughly 2.5 by 3.5 kilometres. Polarstern put her engines in neutral and allowed herself to become trapped in the sea ice. An extensive research camp was then set up all around the ship on the ice. At the same time, Akademik Fedorov deployed a network of research stations on the ice, some as far as 50&nbsp;km from Polarstern's position. The network consisted of both autonomous and remote-controlled instruments, which were checked at regular intervals using helicopter flights from the central Polarstern, which formed the Central Observatory.\nAfter delivering one last load of fuel, at the end of October Akademik Fedorov returned to Tromsø. From this point on, the natural drift carried Polarstern and its network of research stations across the North Pole region. On 24 February 2020, the Polarstern has broken a record: during the drift she reaches 88°36' North, just 156 kilometres from the North Pole. In summer 2020, the ship reached the Fram Strait. On 13 August, after a last big refueling and personnel rotation, Polarstern started steaming towards the Central Arctic to study the onset and early freezing phase of the sea ice. On 19 August, the ship reached the North Pole. The journey from the northern Fram Strait to the Pole only took six days to complete.  After a short search, the MOSAiC team found a new ice floe. The so-called MOSAiC floe 2.0 was discovered eleven nautical miles from the route that the original floe took in January 2020. Polarstern left the MOSAiC floe 2.0 on 20 September 2020, one year after the start of the expedition. On 12 October 2020, the Polarstern returned to her homeport in Bremerhaven.\nDuring the period August/September 2020, the German research aircraft Polar 5 and Polar 6 took off from Spitsbergen to conduct aerial surveys of the sea ice and atmosphere over the Arctic Ocean, supplementing the MOSAiC expedition's research programme.\nFuel depots set up on islands off the coast of Siberia specifically for the expedition supported potential emergency operations by long range helicopters, which were able to reach Polarstern in the event of an emergency at least during the early and late phases of the expedition.\nResearch focus areas\nThe primary goal of the MOSAiC project is to understanding the coupled climate processes in the Central Arctic, so that they can be more accurately integrated into regional and global climate models. The findings will contribute to more reliable climate projections for the Arctic and globally, to improved weather forecasts and better Arctic sea ice forecasts.\nIn addition, the outcomes of the MOSAiC mission will help to understand the regional and global effects of Arctic climate change and the loss of sea ice. They will improve the preparedness of communities in the Arctic and northern mid-latitudes, provide the scientific basis for the development of policies for a sustainable development of the Arctic and support fact based decision-making in the areas of mitigation of and adaptation to global climate change.\nAtmosphere\nThe comprehensive and complex atmospheric measurements carried out during MOSAiC provide a physical basis for understanding local and vertical interactions in the atmosphere and the interactions between the atmosphere, the sea ice, and the ocean. The characterization of processes in clouds, in the atmospheric boundary layer, surface layer, and surface energy flux will lead to a better understanding of the lower troposphere, which interacts with the surface in the Arctic. Performed heat flux measurements allowed for an accurate estimate of the surface skin temperature, which showed a substantial bias of those measurements (of 1–3°C during January–April) in comparison with uncoupled atmospheric reanalyses (ERA5 and JRA-55). One of the greatest challenges was carrying out these measurements consistently throughout the sea ice's entire annual cycle, especially at the beginning of the freezing period, so as to monitor the transition from open water to a very thin ice layer. Readings taken at higher altitudes provided insights into the characteristics of the middle and upper troposphere and the interaction with the stratosphere. To improve our understanding of aerosols and aerosol-cloud interactions over the Central Arctic, especially in winter, measurements were taken on the composition of the particles, their physical properties, their direct and indirect radiation effects, and their interactions with cloud properties. Routine radiosonde observations in combination with tethered balloon measurements provided high-resolution profiles of the atmospheric conditions in the column of air above the MOSAiC site. In addition, radar measurements were used to determine the vertical profile of wind speed and direction as well as key cloud properties, including ice and liquid water content. Key thermodynamic parameters, as well as the kinematic structures of the atmosphere, were investigated with the aid of microwave and infrared radiometers, Raman and Doppler lidar.\nSnow and sea ice\nThe sea-ice observations covered the broad range from the physical and mechanical characteristics of Arctic sea ice, to its morphology, optical properties and mass balance. The emphasis was on characterising snow cover and ice cover, and on arriving at a better understanding of the processes that determine their properties. Snow trenches (pits) and ice cores helped the researchers gather this valuable data. Further aspects of the sea ice observation included determining the mass budget by measuring the depth of snow cover and ice thickness, as well as measuring the diffusion of sunlight in the ice, the ice's spectral albedo, and its transmission. In addition, various types of ice (pressure ridges, first- and second-year level ice) were monitored throughout the entire annual cycle in order to determine the spatial variability and development of ice cover in the Arctic over time.\nRidge observations revealed that the most of first-year ridge consolidation occurred during the spring season before the melt onset, and was initiated by warm air intrusions and transfer of snow into leads, which was also confirmed by 6%–11% snow mass fraction in ridges. It was also shown, that bottom melt rates for pressure ridges were approximately four times larger than for level ice, while ridge shape also influenced its melt, with higher melt for deeper, steeper, and narrower ridges. The observations included measurements of snow density, mechanical resistance, and microstructure (using computed tomography), which allowed to compute snow thermal conductivity. Ice mass balance observations included the installation of buoys measuring sea ice temperature, as well as ablation stakes, measuring the evolution of sea ice surface and bottom interfaces. Additionally, sea ice thickness was measured using ground-based electromagnetic sounding, while snow and sea ice freeboard were measured using helicopter-based laser scanner. Additionally, underwater sea ice topography and other physical parameters were measured using observations from remotely operated vehicle, as well as biophysical characterization of algae habitats. Winter observations were characterized by the presence of platelet ice due to the presence of supercooled water, while summer melt was characterized by meltwater stratification and formation of false bottoms which covered around 20% of sea-ice area. Aerial observations of surface temperature revealed a strong 41% preconditioning of surface melt ponds, which form in the areas of warm surface temperature anomalies in winter, typical for thin ice and snow.\nOcean\nOcean processes influence the energy balance in the Arctic, as well as the growth and melting of sea ice due to additional warmth. They also play an important role in the biological activity that binds and potentially exports CO2. Measurements from the water column will shed new light on key mechanisms occurring in the ocean, e.g.: (1) heat exchange between sea ice and ocean, (2) absorption of sunlight and processing of the resulting heat, (3) interaction with deep sea processes, and (4) primary biological productivity and export of organic matter from the euphotic zone.\nGiven that understanding the evolution of sea ice was one of the primary goals of the MOSAiC expedition, ocean processes affecting the ice, like near-surface mixing, were at the heart of the oceanographic investigations. In addition, the dynamics and thermodynamics of the mixing layer were explored in detail. For this purpose, continuous measurements were taken of turbulent fluxes directly below the ocean-ice boundary, to help understand the speeds of the ice and ocean, vertical thermal and momentum flows, diffusion of mass and other key processes. Moreover, the deep ocean was observed in the broader context by creating profiles of the flow speed, temperature, salinity and dissolved oxygen in the top hundred metres of the Arctic Ocean on a regular basis, so as to better grasp its effects on the upper ocean-ice boundary layer.\nEcosystem and Biogeochemistry\nThe observations on biological and biogeochemical transformation and succession mainly focussed on analysing samples from all three major physical regimes, i.e., the ice, snow and water environments. Additionally flow measurements were conducted at both the ice/water and ice/air boundary layers. These were repeated throughout the entire Arctic year in order to quantify the biology and biogeochemistry of the sea-ice/atmosphere system at every time of year, especially in the under-researched Arctic winter. For example, the annual mass budget for organic and inorganic carbon was monitored, and crystallographic readings were taken on the ikaite in seafloor channels. The latter offered insights into the biogeochemistry of the net air/ice flow of CO2 produced by sea ice, and into the potential for capturing organic carbon and the respiration of CO2. A second goal was to quantify the methane accumulation, the oxidation below the sea ice, and the air/ocean flows with regard to the potential for major oceanic methane flows into the atmosphere. A third key element: observing the cycles of biogenic gases like N2O, O2, DMS (dimethyl sulphide) and bromoform in the snow, sea ice and water, which contributed to our grasp of the underlying biogeochemical paths. An additional important aspect was the creation of an annual mass balance and ice/water cycle for macro- and micronutrients; in this regard, vertical nutrient flows between the ocean, euphotic zone, mixed and deep layers of the ocean were investigated, in part with the aid of molecular tools, to arrive at a better understanding of the recycling chains.\nModel implementation\nA closely interlinked modelling and observation concept was central to the definition and planning of the MOSAiC expedition. In order to understand and explain the changes at work in the Arctic climate system, new models will be developed, and previous models will be refined, on the basis of the observations and readings taken during the expedition. These observations will also play an important part in improving these models and developing new ones for weather and sea-ice forecasting, and for climate projections. In turn, the models will offer insights into phenomena that are not directly observable. The observations made throughout MOSAiC will provide new framework conditions for models at various scales; e.g. high-resolution models will be used for detailed studies, and these studies can provide the basis for improving regional and global climate models.\nIn addition, regional Arctic models will be used to answer important questions concerning the Arctic's role as a global energy sink; how global connection patterns will be shaped by the changing ice volume in the Arctic; and how these changes will affect the circulation and weather in the lower latitudes. The modelling and observations during MOSAiC will be conducted in close cooperation with the international modelling efforts of the World Weather Research Programme and World Climate Research Programme.\nMOSAiC School 2019\nThe first phase of the expedition featured a six-week course for 20 postgraduate students aboard Akademik Fedorov. This was jointly delivered by MOSAiC Partners and the Association of Polar Early Career Scientists.\nSee also\n* Surface Heat Budget of the Arctic Ocean\n* CONTRASTS Expedition\n* Nansen's Fram expedition\n* Polar exploration\n* Arctic exploration\nReferences\nExternal links\n* [https://www.mosaic-expedition.org/ Official Website] of the MOSAiC expedition\n*[https://follow.mosaic-expedition.org/ Follow MOSAiC expedition] (Progressive Web App)\n*[https://www.science.org/content/article/arctic-researchers-will-lock-ship-ice-year-study-changing-polar-region \"Arctic researchers will lock this ship in ice for a year to study the changing polar region\"], Science Magazine, Aug. 20, 2019\n* [https://www.mosaic-expedition.org/about-mosaic/the-expedition/interview.html Interview with project leader Markus Rex] from Alfred Wegener Institute (AWI)"
    }
  ]
}