{
  "content": [
    {
      "type": "text",
      "text": "# Moses Kingsley\n\n| birth_place = Enugu, Nigeria\n| high_school = Huntington Prep(Huntington, West Virginia)\n| college = Arkansas (2013–2017)\n| draft_year = 2017\n| career_start = 2017\n| years1 = 2017–2019\n| team1  = Antwerp Giants\n| years2 = 2019–2020\n| team2  = Peristeri\n| years3 = 2020\n| team3  = Bilbao Basket\n| years4 = 2020–2021\n| team4  = AEK Athens\n| years5 = 2021–2022\n| team5  = Ionikos Nikaias\n| highlights =\n*Belgian Cup winner (2019)\n* 2× Second-team All-SEC (2016, 2017)\n* 2× SEC All-Defensive team (2016, 2017)\n}}\nMoses Kingsley (born November 16, 1994) is a Nigerian professional basketball player who last played for Ionikos Nikaias of the Greek Basket League. He played college basketball for the Arkansas Razorbacks.\nCollege career\nIn his first two years at Arkansas, Kingsley played behind Bobby Portis. He had a breakout junior season, averaging 15.9 points and 9.3 rebounds per game and flirted with the 2016 NBA draft but decided to return. Coming into his senior year, he was named preseason SEC Player of the year. He did not quite live up to the hype, but averaged 12 points, 7.7 rebounds and 2.6 blocks per game and was a Second team All-SEC selection. As a senior, Kingsley led the Razorbacks to a 26-10 record and second round appearance in the NCAA Tournament. In his career, he finished 25th on the all-time Razorback scoring list with 1,200 points. He had 24 double-doubles during his career at Arkansas and his 256 blocks are third-most in school history.\nProfessional career\nKingsley participated with the Minnesota Timberwolves during the NBA Summer League. On August 12, 2017, he signed with the Antwerp Giants of the Basketball League Belgium Division I.\nOn July 11, 2019, Kingsley signed with Peristeri of the Greek Basket League.\nOn July 17, 2020, he signed with RETAbet Bilbao Basket of the Liga ACB. Kingsley averaged 4.4 points and 2.4 rebounds per game. On December 12 of the same year, Kingsley signed with AEK Athens of the Greek Basket League.\nOn August 29, 2021, Kingsley signed with Ionikos Nikaias of the Greek Basket League. His season was marked by injuries and he appeared in only 10 games, averaging 5.3 points and 4.2 rebounds, in under 16 minutes per contest.\nThe Basketball Tournament\nMoses Kingsley played for Team Arkansas in the 2018 edition of The Basketball Tournament. In 2 games, he averaged 5 points, 5 rebounds, and 1.5 steals per game. Team Arkansas reached the second round before falling to the Talladega Knights.\nReferences\nExternal links\n*[http://www.nbadraft.net/players/moses-kingsley NBADraft.net profile]\n*[https://twitter.com/KingMoses_?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor Moses Kingsley] on Twitter"
    }
  ]
}