{
  "content": [
    {
      "type": "text",
      "text": "# Mossman, Queensland\n\nMossman District Hospital\n| photo1b             = Mossman Gorge, Queensland, July 2020, 01.jpgMossman Gorge\n| photo2a             = National Bank of Australasia Building, Mossman, Queensland 2020, 04.jpgNational Bank of Australia\n| photo2b             = Exchange Hotel, Mossman, Queensland, 2020.jpgExchange Hotel\n| spacing             = 2 | border = 0 | color = #F2F2F2 | size = 300}}\n| caption             = From left to right;  Mossman District Hospital, Mossman Gorge  National Bank of Australia, Exchange Hotel\n| coordinates         =\n| pop                 = 1935\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4873\n| elevation           = 12\n| area                = 12.1\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 258.9\n| dir1                = S\n| location1           = Cooktown\n| dist2               = 20.6\n| dir2                = NW\n| location2           = Port Douglas\n| dist3               = 76.0\n| dir3                = NW\n| location3           = Cairns\n| dist4               = 421\n| dir4                = NNW\n| location4           = Townsville\n| dist5               = 1753\n| dir5                = NNw\n| location5           = Brisbane\n| lga                 = Shire of Douglas\n| county              = Solander\n| stategov            = Cook\n| fedgov              = Leichhardt\n| maxtemp             = 27.9\n| mintemp             = 20.6\n| rainfall            = 2013.2\n| near-n              = Miallo\n| near-ne             = Newell\n| near-e              = Bonnie Doon\n| near-se             = Shannonvale\n| near-s              = Shannonvale\n| near-sw             = Mossman Gorge\n| near-w              = Finlayvale\n| near-nw             = Syndicate\n}}\nMossman is a rural town and locality in the Shire of Douglas, Queensland, Australia. It is the administrative centre for the Douglas Shire Council In the , the locality of Mossman had a population of 1,935 people.\nGeography\nMossman in Far North Queensland on the Mossman River.\nMossman is located on the Captain Cook Highway  north of the regional city of Cairns, and  east of the Mount Carbine Tableland. The Mossman River flows through the locality from west (Finlayvale / Mossman Gorge) to east (Newell / Bonnie Doon).\nMossman Gorge, a popular attraction within Daintree National Park and the broader Wet Tropics of Queensland World Heritage area is located west of town.\nSugar cane farming is an important aspect of the local economy, with Mossman Central Mill, the only sugar mill in the district (), processing the cane before sending it to Cairns for shipping domestically and internationally. There is a network of cane tramways through Mossman and nearby sugarcane growing areas to deliver the harvested sugarcane to the mill.\nHistory\nThe traditional language area of Kuka-Dyangan (also known as Djangun, Gugu Djangun and Kuka Djangun) includes landscape within the local government boundaries of the Douglas Shire and Cook Shire.\nKuku Yalanji  (also known as Gugu Yalanji, Kuku Yalaja, and Kuku Yelandji) is an Australian Aboriginal language of the Mossman and Daintree areas of  North Queensland. The language region includes areas within the local government area of Shire of Douglas and Shire of Cook, particularly the localities of Mossman, Daintree, Bloomfield River, China Camp, Maytown, Palmer, Cape Tribulation and Wujal Wujal.\nYalanji  (also known as Kuku Yalanji, Kuku Yalaja, Kuku Yelandji, and Gugu Yalanji) is an Australian Aboriginal language of Far North Queensland. The traditional language region is Mossman River in the south to the Annan River in the north, bordered by the Pacific Ocean in the east and extending inland to west of Mount Mulgrave. This includes the local government boundaries of the Shire of Douglas, the Shire of Cook and the Aboriginal Shire of Wujal Wujal and the towns and localities of Cooktown,  Mossman, Daintree, Cape Tribulation and Wujal Wujal. It includes the head of the Palmer River, the Bloomfield River, China Camp, Maytown, and Palmerville.\nThe district was originally known as Mossman River after the river which flows through it. The Mossman River, in turn, was named by the explorer George Dalrymple on 6 December 1873 after Hugh Mosman who discovered gold in Charters Towers. Dalrymple wrote \"I named this river the Mossman River, after Mossman, an explorer and mining man, member of a very prominent mining family\". The town was also known for a brief time as Hartsville after Daniel Hart, an early settler. Later the name was changed to Mossman.\nThe Mossman – Port Douglas parish of the Roman Catholic Vicariate Apostolic of Queensland (now the Roman Catholic Diocese of Cairns) was established in 1877.\nMossman River Post Office opened by 1895 (a receiving office had been open from 1883) and was renamed Mossman in 1899.\nMossman Central Sugar Mill commenced crushing on 23 August 1897.\nMossman River State School opened on 31 January 1898 under head teacher Thomas Garland. It was renamed Mossman State School in 1910. A secondary department was opened on 1 February 1955, which operated until a separate Mossman State High School opened on 30 January 1973.\nThe establishment and subsequent growth of Cairns and the completion of the Cairns Railway up through the Barron Gorge in 1891 gave a more direct gateway to the hinterland but, at this period, it was found that the Mossman district contained suitable land for sugar-growing. The establishment of the sugar mill at Mossman formed the nucleus of the town, which grew at the expense of Port Douglas.\nThe district was served by two separate 2-foot (610&nbsp;mm) gauge tramway systems. Both at one time handled passengers and general goods, as well as sugar cane. Mossman district owes its present prosperity to these tramways which pioneered the first reasonable transport in the neighbourhood, for trafficable roads followed later.\nIn June 1905, tenders were called to erect a Catholic church in Mossman. On Sunday 21 January 1906, St Augustine's Catholic church was consecrated by Bishop James Murray in the presence of several hundred spectators.\nOn Thursday 16 March 1911, a cyclone hit Mossman and Port Douglas doing considerable damage. In Mossman, over 80 people were homeless and the Catholic and Anglican churches were destroyed. On Sunday 11 February 1912, a new St Augustine's Catholic Church was opened by Bishop Murray. It was in Junction Road (approx ), opposite the Mossman Butchery Company (established in 1927 at 3 Junction Road, ).  As the population of Mossman grew, there was a desire to build a Catholic school, but the Junction Road site did not have the space, so a new site was purchased in Grogan Street. On Sunday 29 April 1934, Bishop John Heavey officially opened the new St Augustine's complex at Grogan Street, consisting of a presbytery, a combined church and school building, and a convent. The architect was Vibert McKirdy Brown.  St Augustine's Catholic School opened with 70 students, with the initial teachers being  Sisters Mary Agnes, Gabriel, Cecelia and Pius of the Sisters of Mercy. On 30 January 1977, a new hexagonal-shaped St Augustine's church opened on the Grogan Street site with the former church being converted into school classrooms.\nDuring World War II, Mossman was attacked in a Japanese air raid on 31 July 1942. A single flying boat dropped a bomb that fell near a house and injured a child.\nMossman State High School opened on 30 January 1973.\nMossman Library opened in 1977.\nPrior to 2008, Mossman was the seat of the Shire of Douglas. In 2008, the Shire of Douglas was amalgamated into the Cairns Region, which was administered from both Cairns and Mossman. In 2014, the Shire of Douglas was de-amalgamated from Cairns Region and reinstated as Shire of Douglas.\nDemographics\nIn the , the town of Mossman had a population of 1,740 people.\nIn the , the locality of Mossman had a population of 1,937 people.\nIn the , the locality of Mossman had a population of 1,935 people.\nHeritage listings\nMossman has a number of heritage-listed sites, including:\n* Exchange Hotel (formerly Daintree Inn), 2 Front Street\n* St David's Anglican Church, 3 Foxton Avenue\n* Mossman District Hospital, Johnston Road\n* Mossman Shire Hall and Douglas Shire Council Chambers, 8–14 Mill Street:\n* National Bank of Australasia Building, 11 Mill Street\nMossman Central Mill\nMossman Central Mill Company Limited opened in 1894 as co-operative sugar mill owned by local sugarcane farmers. The first sugarcane was crushed on 23 August 1897, the sugarcane coming from Bonnie Doon. Annie Rose fed the first sugarcane into the mill, with the mill producing its first sugar after crushing  of cane for the initial season.\nIn 1906, Mossman Mill became the first Queensland mill to crush over  of cane. That season lasted just under 8 months, extending from June 1906 to late January 1907.\nInitially, sugar was transported by sea from Port Douglas, but later the sugar was taken by road to the bulk sugar terminal in Cairns.\nLouis John Frederick Prince (General Manager) pioneered the use of computers for cane payment accounting and, in 1971, Mossman purchased the first process control computer used in the world sugar industry.\nThe Tropical North Steiner School opened in January 2022, offering Prep to Year 3 initially. In January 2023, the school surrendered its accreditation, effective October 2022.\nThe mill closed in 2024. Local sugarcane farmers must now send their sugarcane to the Mulgrave Sugar Mill, over  away, costing an extra $30 per tonne in transport, which means the expected 310,000 tonnes of cane will cost more than $9 million extra in transport. Farmers are seeking a subsidy from the Queensland Government to assist with this extra cost.\nEducation\nMossman State School is a government primary (Prep–6) school for boys and girls at 30-34 Front Street (). In 2017, the school had an enrolment of 213 students with 16 teachers (13 full-time equivalent) and 22 non-teaching staff (13 full-time equivalent).\nMossman State High School is a government secondary (7–12) school for boys and girls at 46–62 Front Street (). In 2017, the school had an enrolment of 611 students with 62 teachers (56 full-time equivalent) and 41 non-teaching staff (31 full-time equivalent). It includes a special education program.\nSt Augustine's School is a Catholic primary (Prep–6) school for boys and girls at Grogan Street (). In 2017, the school had an enrolment of 217 students with 16 teachers (14 full-time equivalent) and 13 non-teaching staff (6 full-time equivalent).\nAmenities\nDouglas Shire Council operates Mossman Library at 14 Mill Street ().\nThe Mossman branch of the Queensland Country Women's Association meets at 28 Front Street ().\nThere are a number of churches in Mossman, including:\n* St Augustine's Catholic Church, at 24B Grogan Street (), within the Mossman-Port Douglas Parish of the Roman Catholic Diocese of Cairns\n*St David's Anglican Church, 3 Foxton Avenue (), within the Anglican Diocese of North Queensland\n*Mossman Uniting Church, 36 Front Street ()\n*Mossman Seventh-Day Adventist Church, 60 Captain Cook Highway ()\nFacilities\nMossman Hospital is a public hospital at 9 Hospital Street (). It has an accident and emergency services, clinics, and an in-patient pharmacy.\nSport\nMossman has a number of sporting clubs including the Coral Coast Judo Club.\nSee also\n* List of sugar mills in Queensland\n* List of tramways in Queensland\nReferences\nExternal links\n*\n*[http://www.smh.com.au/news/Queensland/Mossman/2005/02/17/1108500203586.html Town information from the Sydney Morning Herald]\n*[https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/tqqf2h/alma99269613402061 Memories of Mossman Oral History 2006-2008], State Library of Queensland"
    }
  ]
}