{
  "content": [
    {
      "type": "text",
      "text": "# Motor Industry Software Reliability Association\n\nThe Motor Industry Software Reliability Association (MISRA) is an organization that produces guidelines for the software developed for electronic components used in the automotive industry. It is a collaboration between numerous vehicle manufacturers, component suppliers and engineering consultancies.\nAim\nThe aim of this organization is to provide advice in questions of quality assurance mainly to the automotive industry for the creation and application of safe, reliable software within vehicles. The mission statement of MISRA is \"To provide assistance to the automotive industry in the application and creation within vehicle systems of safe and reliable software\". The safety requirements of the software used in control units of Automobiles is specific as compared to that of other industries and devices.\nMISRA creates, reviews and publishes (sells) standards, such as the MISRA C Coding Standard for the C programming language, first published in 1998.\nHistory\nMISRA was formed in the 1990s by a consortium of organizations formed in response to the UK Safety Critical Systems Research Programme. This program was supported by the Department of Trade and Industry and the Engineering and Physical Sciences Research Council.  Another program was \"SafeIT\".\nSubsequently MISRA published its first guide, \"Development guidelines for vehicle based software\", which is considered a foundational element of functional safety by the engineering community. This was roughly ten years before the creation of the ISO 26262 standard.\nOrganization (MISRA Consortium)\nSince 2021, MISRA is managed by the MISRA Consortium Limited, an independent not-for-profit entity.\nThe Steering Committee is as follows (2024).\nSteering Committee\n* Bentley Motors\n* Delphi Diesel Systems\n* Ford Motor Company Ltd\n* HORIBA MIRA Ltd\n* Peter Jesty Consulting Ltd\n* Ricardo plc\n* Visteon Engineering Services Ltd\n* ZF (and former TRW, which was acquired by ZF)\nFormer members are: Protean Electric Ltd\nActivities\nAccording to MISRA, the following activities are pursued:\n* MISRA Autocode\n* MISRA C\n* MISRA C++\n* MISRA Safety Argument\n* Functional Safety\nGuidelines\nMISRA guidelines are a set of development guidelines to ensure safe and reliable development of control software for electronic control units (ECUs). The primary focus of the MISRA guidelines is error prevention, not programming style. Among other things, the guidelines are intended to guide and support the following objectives\n*Ensure safety\n*Ensure security\n*Bring in robustness, reliability to the software\n*Human safety must take precedence when in conflict with security of property\n*Consider both random and systematic faults in system design\n*Demonstrate robustness, not just rely on the absence of failures\n*Application of safety considerations across the design, manufacture, operation, servicing and disposal of products\nAs with many standards (for example, ISO, BSI, RTCA), the MISRA guideline documents are not free to users or implementers.\nCoding guidelines\nMISRA guidelines are primarily focused and derived for the C and C++ programming languages. The main standard is known as \"MISRA C\" and has been updated several times.\n{| class=\"wikitable\"\n|+Table 1: Overview of MISRA guidelines C/C++\n!Language\n!Standard (year)\n!Exact specifier\n!Edition\n!Incremental Updates\n!Features\n|-\n| rowspan=\"5\" |C\n|1998\n|MISRA C:1998\n|1st\n| -\n|Original guidance emerging from the automotive industry.\n|-\n|2004\n|MISRA C:2004\n|2nd\n| -\n|Add user feedback and cross-industry applications\n|-\n|2012\n|MISRA C:2012\n|3rd\n| -\n|Add support for C99 language features, improved strong typing model, analysis keywords\n|-\n|2019\n|MISRA C:2019\n|\n|1st Revision based on MISRA C:2012 (3rd) with amendment 1 (AMD1) and technical corrigendum 1 (TC1)\n|Add additional security guidelines\n|-\n|2023\n|MISRA C:2023\n|\n|2nd Revision based on MISRA C:2012 (3rd) with AMD2, AMD3, and AMD4, plus TC2\n|Add C11 and C18 language features\n|-\n| colspan=\"6\" |\n|-\n|\n|2008\n|\n|\n|\n|Initial launch of standard\n|-\n|C++\n|2023\n|MISRA C++:2023\n|\n|\n|Guidelines for the use C++17 in critical systems\n|}\nSee also\n*Automotive SPICE\n*AUTOSAR\n*CERT C\n*Coding standards\n*High Integrity C++\n*IEC 60730\n*IEC 61508\n*Software quality\n*Static program analysis\nExternal links\nReferences"
    }
  ]
}