{
  "content": [
    {
      "type": "text",
      "text": "# Motorsport in the United Kingdom\n\nWorld Champion Lewis Hamilton driving for McLaren at the 2008 British Grand Prix at Silverstone Circuit.]]\nMotorsport is a popular sport in the United Kingdom (possibly the second in popularity in the country, after the football). The United Kingdom is a key player in the world of motorsport, hosting rounds of Formula One and MotoGP amongst others. It is also the home of many of the current teams in Formula One, such as McLaren, Williams, Aston Martin, Red Bull Racing, Mercedes, Alpine and Haas. There is also a range of popular national series held, such as the British Touring Car Championship and the British GT Championship amongst others. Motorsport UK is the official governing body of motorsport in the United Kingdom.\nFormula One\ndriver Lando Norris winning the 2024 Dutch Grand Prix at Zandvoort for McLaren.]]\nThe United Kingdom has been a major player in the Formula One World Championship since it began in 1950, providing ten different world champions, winning 20 titles between them, more than any other nation. Mike Hawthorn became the first British world champion in , defeating Stirling Moss, labelled by many as \"the greatest driver never to have won the world championship\". The country won four consecutive titles between 1962 and 1965, with Graham Hill, Jim Clark (twice) and John Surtees. Hill won again in 1968, and was succeeded by Jackie Stewart, who won in ,  and . James Hunt was world champion for McLaren in , and was the last British champion until , when Nigel Mansell won for Williams. Damon Hill, son of Graham, was champion in , while Lewis Hamilton and Jenson Button won back-to-back titles for the country in  and , with Hamilton becoming the first Briton to win back-to-back titles in 2014 and 2015. In 2017, Hamilton became the first Briton to win four titles. He won again in 2018 and 2019, and in 2020, he became a seven-time champion, equalling Michael Schumacher's record to become the statistically greatest of all time.\nOther than the Italian Scuderia Ferrari, the most successful teams in Formula One have been based in Britain. McLaren and Williams are the most successful of these, with former teams Team Lotus and Brabham also winning multiple titles. Six of the ten teams currently competing in Formula One are based in England with the other teams such as Racing Bulls having an aerodynamics facility in England, and the Haas F1 Team use England for their European base. From 2026, Audi will use the UK for a technical centre and Cadillac will use it for their European base. This leaves Ferrari as the only team without a facility within the UK.\nThe British Grand Prix was first held at the Brooklands oval in 1926. The first Formula One world Championship race occurred at its current host, Silverstone Circuit in 1950. A one-off race occurred at Silverstone in 2020, titled the 70th Anniversary Grand Prix, commemorating this. Other circuits have held the British Grand Prix, usually in intervals with Silverstone. Aintree Motor Racing Circuit has hosted it five times, in 1955, 1957, 1959, 1961 and 1962, and Brands Hatch held it twelve times from 1964 to 1986. The European Grand Prix was held at Brands Hatch in 1983 and 1985, and at Donington Park in 1993.\nIndyCar\nat the Rockingham 500]]\nSilverstone and Brands Hatch hosted USAC National Championship non-points races in 1978, whereas CART visited Rockingham Motor Speedway in 2001 and 2002 for the Rockingham 500, and Brands Hatch in 2003 for the London Champ Car Trophy.\nFrom the late 1970s, one-third of the cars were British-built, including large manufacturers such as McLaren and Lola. By the 1980s, up until the early 2000s, British-built IndyCar chassis and engines dominated the Indy 500 field. Most of the chassis were built in Bicester, Huntingdon and Poole, with the engines being made in Northamptonshire. As for drivers, Dario Franchitti has won four IndyCar titles, Dan Wheldon has won one, Nigel Mansell won one in CART, and Dario Resta won one in the AAA. Franchitti also won the Indianapolis 500 three times, with Wheldon winning it twice and Jim Clark and Graham Hill once each.\nLouis Foster won the 2024 Indy NXT Series and competes in the 2025 IndyCar Series, with fellow britons Callum Ilott competing and Jack Harvey competing part-time.\nMotorcycle racing\nat the Isle of Man TT]]\n, Álex Rins and Maverick Viñales fighting for the win at the 2019 British Grand Prix.]]\nSilverstone Circuit currently hosts a round of MotoGP while Donington Park hosts the Superbike World Championship. Britain's Leslie Graham won the inaugural Grand Prix Motorcycling World Championship in 1949. Geoff Duke, John Surtees and Mike Hailwood all won multiple world titles during the 1950s and 1960s. Phil Read was world champion in 1973 and 1974, while Barry Sheene won back-to-back titles in 1976 and 1977. Britain has struggled in the top 500cc/MotoGP class since then, with only Cal Crutchlow winning any races.\nBritain has enjoyed greater success in the Superbike World Championship, with Carl Fogarty winning four titles in the 1990s. Neil Hodgson won the title in 2003, while James Toseland won the title in 2004 and 2007. The United Kingdom is currently well represented in the Superbike World Championship.\nThe British Superbike Championship is the leading motorcycle racing series in the United Kingdom. Road racing events are popular, with the Isle of Man hosting the Isle of Man TT and Northern Ireland hosting the North West 200.\nMotocross, motorcycle trials and enduro are also popular forms of motorcycle sports, with notable riders such as Kurt Nicoll, David Thorpe, Jeff Smith, Dave Bickers, David Knight, Sammy Miller, Arthur Lampkin, Martin Lampkin and Dougie Lampkin.\nSpeedway in the United Kingdom is also popular, with events like the Elite League, Speedway Grand Prix of Great Britain and British Speedway Championship racing at dirt oval stadiums including the National Speedway Stadium, Brandon Stadium and Owlerton Stadium. A Briton has won the Individual Speedway World Championship 12 times (10 for England, 2 for Wales). Notable riders include three-time champion Tai Woffinden and two-time champions Freddie Williams and Peter Craven.\nIn rally raiding, Sam Sunderland became the first British winner of the Dakar Rally when he won the motorcycle classification in 2017 and again in 2022.\nDrag Racing\nat Santa Pod Raceway]]\nDrag Racing originated in the USA during the 1920s. During prohibition, the sellers of illegal alcohol, the Moonshine Boys, modified their seemingly ordinary cars with powerful, hidden engines to outrun authorities. These early hot rods allowed them to evade capture while delivering illegal alcohol. After prohibition, the Hot Rodders continued, and all over America, roads were being used to settle the 'mine is faster than yours' argument'. Most towns had a main road running down the middle and junctions controlled by traffic lights, The Hot Rodders would race down the main drag from one set of lights to the other - the beginning of Drag Racing.\nDrag Racing took off in the UK during the 1960s when, like in the USA, many of the old disused airstrips around the country were converted to drag strips. Podington airfield, near the villages of Hinwick and Podington, was formerly a wartime airbase used by the USAAF during the Second World War.  In 1964, the British Drag Racing Association was formed and by 1966, permission was obtained to use the airfield as a drag racing complex, with the ¾ of a mile of the main runway used as the drag strip. The track was named Santa Pod after the Santa Ana strip in the USA, combined with the name of the local village of Podington.\nSince then, the name Santa Pod Raceway has become synonymous with the sport of Drag Racing in Europe. Today, the raceway hosts events throughout the year, including the British Drag Racing Championship, the 'Run What You Brung' (RWYB) events, where anyone with a valid driving licence can have a go and put their own vehicles and skills to the test, and the FIA European Drag Racing Championships. Briton Andy Carter won the championship in 2009 in the Top Fuel Dragster class. There is also a British Drag Racing Hall of Fame which inducts members every year.\nRallying\n]]\n]]\nRallying is a popular form of motorsport in the United Kingdom. The RAC Rally began in 1932, and has since evolved into Wales Rally GB, the country's round of the World Rally Championship. Colin McRae won the World Rally Championship in 1995, and Richard Burns won in 2001, both for the Banbury-based Subaru World Rally Team. Both were recognised as two of the sport's most famous and popular drivers, but Burns and McRae died in 2005 and 2007, respectively. The Ford World Rally Team was also based in England, as is M-Sport.\nThe British Rally Championship is the national rally championship of the United Kingdom, featuring events such as the Circuit of Ireland Rally, Scottish Rally and Rally Isle of Man. Smaller championships running annually in the UK include the Scottish Rally Championship, BTRDA rally championship, MSA English Rally Championship and the Northern Irish Rally Championship.\nThe first rallycross event in history was organised at Lydden Hill Race Circuit in 1967. The circuit has hosted rounds of the European Rallycross Championship and currently the FIA World Rallycross Championship. The British Rallycross Championship also races at Pembrey and Croft.\nTouring cars\nrace at Brands Hatch in 2006.]]\nThe British Touring Car Championship is the country's most popular national racing series. Its popularity was highest during the 1990s and the Supertouring era, when it attracted a range of well-known international manufacturers and drivers. Although spiralling costs meant that the series declined during the early 21st century, the series is now regaining popularity.\nThe United Kingdom also had a presence in the World Touring Car Championship, with Guernsey's Andy Priaulx winning three consecutive world championships between 2005 and 2007 and Robert Huff winning the 2012 championship. Brands Hatch hosted the UK's WTCC round, the FIA WTCC Race of UK, until 2009. This race was then hosted by Donington Park. Other touring car series in the UK include the TCR UK Touring Car Championship.\nBrands Hatch annually hosted a round of the prestigious German touring car series, DTM, from 2006 to 2013. This series has had a strong representation from UK drivers. Gary Paffett has won the championship twice in 2005 and 2018 with the 2010 championship won by Scotsman Paul di Resta.\nSportscars\n]]\n]]\nBritish teams and drivers have enjoyed many successes at the 24 Hours of Le Mans. Britain has had more winning drivers, with 46 wins from 35 drivers. This is more than any other nation, including France. Jaguar and Bentley have taken 15 wins between them. Derek Bell won the race five times during the 1970s and 80s, and Allan McNish three times. Brian Redman and Moss won several World Sportscar Championship races as well.\nVic Elford won the 24 Hours of Daytona, 1000 km Nürburgring and Targa Florio. Andy Wallace won the 24 Hours of Le Mans, 24 Hours of Daytona and 12 Hours of Sebring. Derek Warwick won the FIA World Endurance Championship in 1992 and Anthony Davidson in 2014.\nSilverstone formerly hosted the 1000 km Silverstone of the FIA World Endurance Championship, as well as rounds of the Le Mans Series and the FIA GT1 World Championship.\nThe British GT Championship is the major national sportscars series, with Britcar, GT Cup Championship, British Endurance Championship and many other smaller championships also running.\nNotable British sports car racing teams include Aston Martin Racing, Jaguar Racing, Drayson Racing, Ecurie Ecosse, Richard Lloyd Racing, RML Group, Strakka Racing, Spice Engineering and Tom Walkinshaw Racing.\nJunior formula\nThe British Formula Three Championship was regarded as one of the most important series below Formula One, with former champions including Nelson Piquet, Mika Häkkinen, Ayrton Senna and Emerson Fittipaldi. Due to the emergence of successful junior formulae in mainland Europe, the series does not attract the quality of drivers it once did, but is still the most important of the national Formula Three series.\nIn the late 20th century, the British Formula Renault Championship and British Formula Ford Championship were the two main entry-level formula series. They were replaced by the F4 British Championship, launched in 2015. The Formula Ford Festival is also known for producing talented young drivers. Other series include The GB3 Championship and The GB4 Championship, which are run by Motorsport Vision.\nClub racing\nThe United Kingdom has a large 'club racing' scene, with a wide range of series for amateur drivers, each containing a diverse range of drivers and cars. Clubs include the British Racing and Sports Car Club (BRSCC), British Automobile Racing Club (BARC), Classic Sports Car Club (CSCC), 750 Motor Club (750MC) and Monoposto Racing Club (MRC) amongst others. Each club holds a range of meetings throughout the year, with each meeting consisting of races in several different categories.\nHistoric racing\n, consisting of Le Mans Prototypes.]]\nHistoric racing is popular in the United Kingdom. Major events include the Goodwood Revival, Silverstone Classic, Oulton Park International Gold Cup, Brands Hatch Masters Historic Festival and Donington Historic Festival. Notable historic racing clubs include the Vintage Sports-Car Club, Vintage Motor Cycle Club and Historic Sports Car Club.\nStock car racing\nat Brands Hatch.]]\nThere are various stock car racing series in the UK. Open-wheel stock car racing is popular, and classes of BriSCA Formula 1 Stock Cars, BriSCA Formula 2 Stock Cars and Superstox are raced in short dirt ovals around the UK.\nAmerican stock car racing has been prevalent throughout recent British motorsport history. From 2001, the Rockingham Motor Speedway was the majority home to the ASCAR series until its final season in 2008. Since then, Brands Hatch has hosted a round of the NASCAR Euro Series since 2011 (excluding 2020) and will race there until at least 2028. Other notable classes of Closed-wheel Stock car racing in the UK include Banger racing, Hot Rod racing and Saloon stock car racing.\nFormula E\nThe Formula E World Championship has hosted the London ePrix over six years. From 2015 to 2016, four rounds were held at the Battersea Park Street Circuit. However, the series didn't return to England until the 2020-21 season, which saw the ExCeL London Circuit replace Battersea as the host the ePrix, becoming the series' first indoor/outdoor track. It has since become the final two rounds of the championship, starting with the 2022-23 season and is contracted to remain on the calendar until 2026.\nSeveral drivers and teams are competing under the British flag in Formula E. Notable drivers include Sam Bird, the 2022-23 world champion Jake Dennis, and the 2024-25 world champion Oliver Rowland. Notable teams include McLaren Racing, the 2022-23 Teams' champion Envision Racing and the 2023-24 Teams' and Manufacturers' champion Jaguar Racing.\nCircuits\n, the sole host of the British Grand Prix since 1987.]]\nCurrent venues\n*Aintree Motor Racing Circuit\n*Anglesey Circuit\n*Brands Hatch\n*Bedford Autodrome\n*Cadwell Park\n*Castle Combe Circuit\n*Croft Circuit\n*Donington Park\n*ExCel London Circuit\n*Goodwood Circuit\n*Kirkistown Circuit\n*Knockhill Racing Circuit\n*Lydden Hill Race Circuit\n*Mallory Park\n*Oulton Park\n*Pembrey Circuit\n*Silverstone Circuit\n*Snetterton Motor Racing Circuit\n*Thruxton Circuit\n*Santa Pod Raceway\nFormer venues\n*Birmingham Superprix\n*Brooklands\n*Crystal Palace\n*Longridge Circuit\n*Rockingham Motor Speedway\n*Ibsley Circuit\n*Llandow Circuit\n*Ruffoth Circuit\nSee also\n*Sport in the United Kingdom\nReferences\nExternal links\n*[http://www.msauk.org/ Motor Sports Association (MSA)]"
    }
  ]
}