{
  "content": [
    {
      "type": "text",
      "text": "# Mott Archaeological Preserve\n\n| map_dot_label  =\n| location       = Lamar, Louisiana,&nbsp;Franklin Parish, Louisiana,&nbsp;\n| region         = Franklin Parish, Louisiana\n| built          =\n| abandoned      =\n| epochs         =\n| cultures       = Marksville, Troyville, Coles Creek, Plaquemine\n| event          =\n| excavations    = 1900, 1913, 2005\n| archaeologists = George Beyer, Clarence Bloomfield Moore, Stephen Williams, Timothy Schilling, Tristram R. Kidder\n| architectural_styles =\n| architectural_details =\n| notes          =\nResponsible body: private\n| designation1            =\n| designation1_offname    =\n| designation1_type       =\n| designation1_criteria   =\n| designation1_date       =\n| delisted1_date          =\n| designation1_partof     =\n| designation1_number     =\n| designation1_free1name  =\n| designation1_free1value =\n| designation1_free2name  =\n| designation1_free2value =\n| designation1_free3name  =\n| designation1_free3value =\n| designation2            =\n| designation2_offname    =\n| designation2_type       =\n| designation2_criteria   =\n| designation2_date       =\n| delisted2_date          =\n| designation2_partof     =\n| designation2_number     =\n| designation2_free1name  =\n| designation2_free1value =\n| designation2_free2name  =\n| designation2_free2value =\n| designation2_free3name  =\n| designation2_free3value =\n}}\nThe Mott Archaeological Preserve or Mott Mounds Site (16 FR 11) is an archaeological site in Franklin Parish, Louisiana on the west bank of Bayou Macon. It originally had eleven mounds with components from the Marksville, Troyville, Coles Creek, and Plaquemine periods. It was at one time one of the largest mound centers in the Southeast and has one of the largest mounds in Louisiana with a base which cover more than two acres. It was purchased by the Archaeological Conservancy in 2002. and is now used for research and educational purposes.\nDescription\nThe site formerly had as many as fourteen mounds, depending on the criteria used to describe a mound. Except for one small outlier to the south all are surrounding an exceptionally large central plaza that is aligned on an east-west axis. The large plaza measures close to  east to west and  north to south. These measurements are about three quarters the size of the Grand Plaza at Cahokia, which is the largest Mississippian culture plaza known. Other large sites from the region during the same time period (such as the Raffman, Winterville, or Holly Bluff) could easily fit their entire sites into the confines of Motts plaza. On the western edge of the plaza is Mound A, the largest at the site and one of the largest in the state and possibly the largest in the Tensas Basin region during the time period it was constructed. It is a platform mound about  by  at its base,  by  at its summit and over  in height. This produces a footprint that covers an area of over two acres. The eastern and southern borders of the plaza are bounded by two other large platform mounds, Mounds F and I respectively. The northern edge of the plaza has four small dome shaped mounds, aligned along a meander scar of Bayou Macon.  south of the mound group is a large village site thought to be contemporaneous with the mounds.\nExcavations\nA number of archaeologists have undertaken excavations and investigations at the site. The earliest were George Beyer in 1900 and Clarence Bloomfield Moore in 1913. In the mid 1960s researchers from the Lower Mississippi Survey of Harvard University led by Stephen Williams sampled the site and fixed it into the local chronology. They found markers from the Marksville, Coles Creek, and Plaquemine cultures, but with the most intensive habitation being during the Coles Creek period. Site surveys were also conducted in 1976 and in 1992, all of which confirmed this chronological placement. The site was purchased in two acquisitions in 2002 by the Archaeological Conservancy to preserve and protect the site which had been threatened by looting, land leveling, and timber harvesting. It is now known as the Mott Archaeological Preserve and is over 200 acres, making it one of the Conservancy’s largest acquisitions in the Southeastern United States to date. In 2005 Mott Project was begun by Timothy Schilling of Washington University in St. Louis and Tristram R. Kidder of Tulane University.\nSee also\n*Culture, phase, and chronological table for the Mississippi Valley\nReferences\nExternal links\n* [https://books.google.com/books?id=Ed3aT7jIxQUC&dq=Mott+Mound+Site&pg=PA160 Archaeology of Louisiana By Mark A. Rees, Ian W. (FRW) Brown- Sites and numbers]"
    }
  ]
}