{
  "content": [
    {
      "type": "text",
      "text": "# Mountain Man (Crash Kings song)\n\n| recorded   =\n| studio     =\n| venue      =\n| genre      = Alternative rock, hard rock\n| length     = 3:18\n| label      = Custard/Universal Motown\n| writer     = Crash Kings\n| producer   = Dave Sardy\n| prev_title =\n| prev_year  =\n| next_title = You Got Me\n| next_year  = 2010\n}}\n\"Mountain Man\" is a song by American rock band Crash Kings, from their eponymous debut album. Written by band members Tony Beliveau, Mike Beliveau and Jason Morris, and produced by Dave Sardy, it was inspired by an experience Tony Beliveau had on top of a mountain in Yosemite National Park. The song was released as the album's first single in April 2009, with a music video following in June. The single entered the Billboard Alternative Songs chart in November, and reached number one in April 2010.\nReception\n\"Mountain Man\" was released to radio on October 26, 2009.\nIn November 2009, the single entered the Billboard Alternative Songs chart at number 40, and peaked at number one the following April.\nThe song also peaked at number 54 on the Canadian Hot 100.\nMusic writer Stephen Thomas Erlewine called the song \"a modern-rock makeover of \"My Doorbell\", a 2005 single by The White Stripes. Erlewine also thought that producer Dave Sardy's previous work with Australian hard rock band Wolfmother was stylistically similar to \"Mountain Man\". MTV noted the song's many influences, again comparing the lead vocals to those of The White Stripes, noting a \"theatrical piano-driven back-up\" reminiscent of Ben Folds, as well as an \"epic guitar crunch a la Weezer emulating Queen. The song was also featured in ''Warren Miller's Dynasty'' which also features the band doing a cover of Emerson Lake and Palmer's Karn Evil 9 during the opening credits.\nChart performance\n{| class=\"wikitable sortable\"\n!Chart (2009-2010)\n!Peakposition\n|-\n|US Billboard Alternative Songs\n|align=\"center\"|1\n|-\n|US Billboard Mainstream Rock Tracks\n|align=\"center\"|32\n|-\n|US Billboard Rock Songs\n|align=\"center\"|13\n|-\n|Canadian Hot 100\n|align=\"center\"|54\n|}\nSee also\n*List of number-one alternative rock singles of 2010 (U.S.)\nReferences\nExternal links\n*[https://www.youtube.com/watch?v=-U52TPkKTDs Watch the \"Mountain Man\" video on YouTube]"
    }
  ]
}