{
  "content": [
    {
      "type": "text",
      "text": "# Mountain Creek, Queensland\n\n| pop                 = 11950\n| pop_year            =\n| pop_footnotes       =\n| established         =1986\n| postcode            = 4557\n| area                = 7.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 8.6\n| dir1                = S\n| location1           = Maroochydore\n| dist2               = 16.5\n| dir2                = N\n| location2           = Caloundra\n| dist3               = 95.1\n| dir3                = NNE\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Sunshine Coast Region\n| county              = Canning\n| parish              = Mooloolah\n| stategov            = Buderim\n| fedgov              = Fairfax\n| near-n              = Mooloolaba\n| near-ne             = Mooloolaba\n| near-e              = Minyama\n| near-se             = Parrearra\n| near-s              = Sippy Downs\n| near-sw             = Sippy Downs\n| near-w              = Buderim\n| near-nw             = Buderim\n}}\nMountain Creek is a suburb in the Sunshine Coast Region, Queensland, Australia. In the , Mountain Creek had a population of 11,950 people.\nGeography\nMountain Creek was named after the creek of the same name that drains the southern slopes of Buderim. It is tidal for a short distance and flows into the Mooloolah River above the Cod Hole and the Traffic Bridge on the Nicklin Way.\nHistory\nThe suburb was named and bounded on 25 October 1986.\nMountain Creek State School opened on 1 January 1994.\nMountain Creek State High School on 27 January 1995.\nBrightwater State School opened on 1 January 2012.\nDemographics\nIn the , Mountain Creek had a population of 11,254 people.\nIn the , Mountain Creek had a population of 11,950 people.\nEducation\nMountain Creek State School is a government primary (Prep–6) school for boys and girls at Lady Musgrave Drive (). It includes a special education program. In 2018, the school had an enrolment of 984 students with 68 teachers (59 full-time equivalent) and 48 non-teaching staff (31 full-time equivalent). In 2022, the school had an enrolment of 800 students with 63 teachers (52 full-time equivalent) and 40 non-teaching staff (26 full-time equivalent).\nBrightwater State School is a government primary (Prep–6) school for boys and girls at 20 Dianella Drive (). It includes a special education program. In 2018, the school had an enrolment of 1,055 students with 70 teachers (62 full-time equivalent) and 30 non-teaching staff (22 full-time equivalent). In 2022, the school had an enrolment of 909 students with 68 teachers (59 full-time equivalent) and 27 non-teaching staff (21 full-time equivalent).\nMountain Creek State High School is a government secondary (7–12) school for boys and girls at Lady Musgrave Drive (). It includes a special education program. In 2018, the school had an enrolment of 2,111 students with 168 teachers (151 full-time equivalent) and 57 non-teaching staff (43 full-time equivalent). In 2022, the school had  an enrolment of 2,179 students with 171 teachers (157 full-time equivalent) and 54 non-teaching staff (42 full-time equivalent).\nDespite the name, the Mooloolaba campus of TAFE Queensland is at 34 Lady Musgrave Drive in Mountain Creek ().\nAmenities\nThe Sunshine Coast Regional Council operates a mobile library service which visits Glenfields Boulevard near the park and Karawatha Drive near the shopping centre.\nThere are a number of parks in the area:\n* Brightwater Community & Lake Park ()\n* Brightwater Park ()\n* Coomoo Crescent Park ()\n* Cootamundra Drive Park ()\n* Corkwood Circuit Park ()\n* Dardgee Park ()\n* Elsa Wilson Drive Walkway ()\n* Frogmouth Circuit Park ()\n* Glenfields Neighbourhood Park ()\n* Holbrook Park ()\n* Kawana Island Riparian Reserve ()\n* Lady Musgrave Drive Walkway ()\n* Loang Court Park ()\n* Lurnea Crescent Park ()\n* Mountain Ash Fire Break, Sauger Court ()\n* Mountain Creek Lake 1 Park ()\n* Mountain Creek Lake 2 Park ()\n* Mountain Creek Rodd Corner Park ()\n* Mountain Creek Riparian Reserve ()\n* Mountain Creek Road Natural Amenity Reserve ()\n* Parklea Esplanade Park ()\n* Parragundi Park ()\n* Philosophers Walk Reserve ()\n* Photinia Crescent Park ()\n* Pipi Place Park ()\n* Prelude Drive Park ()\n* Quota Hideaway Park ()\n* Redbud Bushland Park ()\n* Sailfish Drive Park ()\n* Saratoga Drive Park ()\n* Skua Place Park ()\nReferences\nExternal links\n*"
    }
  ]
}