{
  "content": [
    {
      "type": "text",
      "text": "# Mount Warren Park, Queensland\n\n| pop                 = 5736\n| pop_year            =\n| pop_footnotes       =\n| established         = 1975\n| postcode            = 4207\n| area                = 4.2\n| timezone            = AEST\n| utc                 = +10:00\n| fedgov              = Forde\n| stategov            = Macalister\n| lga                 = Logan City\n| dist1               = 17.5\n| dir1                = SE\n| location1           = Logan Central\n| dist2               = 37.2\n| dir2                = SSE\n| location2           = Brisbane CBD\n| near-n              = Beenleigh\n| near-ne             = Beenleigh\n| near-e              = Yatala\n| near-se             = Yatala\n| near-s              = Yatala\n| near-sw             = Windaroo\n| near-w              = Bahrs Scrub\n| near-nw             = Beenleigh\n}}\nMount Warren Park is a residential suburb in the outer eastern area of the City of Logan, Queensland, Australia. The mountain of Mount Warren is within the suburb ().\nIn the , Mount Warren Park had a population of 5,736 people.\nGeography\nThe suburb is immediately south of Beenleigh and bordered on its east and south by the Albert River, and its tributary Windaroo Creek, by Beaudesert–Beenleigh Road to the west and by Milne Street, Main Street and Martens Street to the north.\nThe mountain Mount Warren is the west of the suburb and rises to  above sea level. Mount Warren Park golf course ()  is in the east of the suburb beside the Albert River.\nHistory\nMount Warren was settled on Yugambeh land. The Queensland Daily Guardian newspaper reported that William Stanley Warren had planted a sugar crop in February 1865. Warren's estate was bounded by Milne Street, the Albert River, Windaroo Creek and Beaudesert Beenleigh Road. Warren also had Windaroo sugar plantation, planted cotton, Indian corn and told reporters he had grown wheat in 1865 also.\nThe region remained essentially rural until it was developed in 1974. It was named as a locality by Queensland Place Names Board on 1 May 1975. By 1976 the first residential subdivision around Rochester Drive had occurred.\nOn 4 February 1974, the Beenleigh State School created an Opportunity class for special education. In January 1981 it became a separate school, Beenleigh Special School. Mount Warren Park State School opened on 27 January 1981.\nDuring the early 1980's the estate was the site of several high profile lotteries run by the Brisbane based radio station 4BK (now B105 FM).  Major prize in the \"4BK Free Home\" lottery was a house & land package in the estate.  In one particular lottery, several houses were built along both sides of Schweitzer Street, with the winner given the choice of their preferred house.  These houses were open to the public in the lead up to the draw, bringing a great deal to traffic and attention to the estate.\nWindaroo State School opened on 28 January 1992.\nDemographics\nIn the , Mount Warren Park had a population of 5,665 people, 51.9% female and 48.1% male. The median age of the Mount Warren Park population was 36 years, 1 year below the national median of 37. 70.9% of people living in Mount Warren Park were born in Australia. The other top responses for country of birth were New Zealand 8.5%, England 6.2%, Scotland 0.9%, Philippines 0.7%, South Africa 0.6%. 88.5% of people spoke only English at home; the next most common languages were 0.5% Vietnamese, 0.4% German, 0.4% Khmer, 0.4% Spanish, 0.3% Polish.\nIn the , Mount Warren Park had a population of 5,791 people, 52.6% female and 47.4% male. The median age of the Mount Warren Park population was 38 years, on par with the national median of 38. 69.5% of people living in Mount Warren Park were born in Australia. The other top responses for country of birth were New Zealand 9.0%, England 5.4%, Scotland 0.9%, Philippines 0.8% and the Netherlands 0.4%. 87.7% of people spoke only English at home; the next most common languages were 0.7% Mandarin, 0.5% German, 0.4% Vietnamese, 0.4% Portuguese and 0.3% Polish.\nIn the , Mount Warren Park had a population of 5,736 people, 51.0% female and 49.0% male. The median age of the Mount Warren Park population was 41 years, 3 years above the national median of 38. 71.7% of people living in Mount Warren Park were born in Australia. The other top responses for country of birth were New Zealand 7.3%, England 5.0%, Philippines 1.2%, Scotland 0.8%, and China (excludes SARs and Taiwan) 0.5%. 86.2% of people spoke only English at home; the next most common languages were 0.8% Mandarin, 0.5% Polish, 0.5% Romanian, 0.5% Filipino, and 0.4% Serbian.\nEducation\nMount Warren Park State School is a government primary (Early Childhood to Year 6) school for boys and girls at 125 Mount Warren Boulevard (). In 2017, the school had an enrolment of 679 students with 61 teachers (54 full-time equivalent) and 52 non-teaching staff (33 full-time equivalent). It includes a special education program.\nWindaroo State School is a government primary (Prep–6) school for boys and girls at 300 Mount Warren Boulevard (). In 2017, the school had an enrolment of 936 students with 67 teachers (60 full-time equivalent) and 36 non-teaching staff (24 full-time equivalent). It includes a special education program.\nBeenleigh Special School is a special primary and secondary (Prep–12) school for boys and girls at 52–74 Mount Warren Boulevard (). In 2017, the school had an enrolment of 109 students with 29 teachers (27 full-time equivalent) and 50 non-teaching staff (30 full-time equivalent).\nThere are no secondary schools in the suburb. The nearest government secondary schools are Beenleigh State High School to the north in Beenleigh and Windaroo Valley State High School to the south-west in Bahrs Scrub. Trinity College is also located in Beenleigh.\nAmenities\nBeenleigh Region Uniting Church is at 32-50 Mount Warren Boulevard ().\nMt. Warren Park Shopping Village is located at the intersection of Rochester Drive and Mount Warren Boulevard, while the similarly-named Mt Warren Park Shopping Centre is located at the intersection of Mount Warren Boulevard and Saratoga Street. Both contain a supermarket, bakery and liquor store, and the latter also contains a medical centre, chemist's and dental clinic.\nTransport\nMount Warren Park is served by bus routes 563, 565 and 566, operated by Kinetic Gold Coast on behalf of Translink.\nHighlights\nMt Warren Lanes is a ten-pin bowling alley and café located at 148–156 Mount Warren Boulevard, adjacent to Mt. Warren Park Shopping Village.\nMount Warren Park Ridge is a nature reserve and walking trail along the top of Mount Warren. It is accessible from the end of Ben Lexcen Court via a utility road. The reserve is noted for the presence of locally endangered marsupials, including red-necked wallabies and koalas.\nReferences\nExternal links\n*"
    }
  ]
}