{
  "content": [
    {
      "type": "text",
      "text": "# Mount Cuthbert, Queensland\n\n| pop                 =\n| pop_year            =\n| pop_footnotes       =\n| established         = 1917\n| postcode            = 4824\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 16.7\n| dir1                = NW\n| location1           = Three Rivers\n| dist2               = 118\n| dir2                = NNE\n| location2           = Mount Isa\n| dist3               = 119\n| dir3                = NNW\n| location3           = Cloncurry\n| dist4               = 903\n| dir4                = W\n| location4           = Townsville\n| dist5               = 1823\n| dir5                = NW\n| location5           = Brisbane\n| lga                 = Shire of Cloncurry\n| stategov            = Traeger\n| fedgov              = Kennedy\n}}\nMount Cuthbert is a former copper mining town in the locality of Three Rivers, Shire of Cloncurry, Queensland, Australia. It is now a ghost town.\nHistory\nMount Cuthbert was one of a string of mining towns created in north-west Queensland (other examples being Duchess and Selwyn) by Melbourne investors eager to profit from high copper prices in the early 20th century.  A railway had been opened to the town and copper smelters were operating by 1917, and by 1918 the population was recorded as 750 people.  Some of the workers in Mount Cuthbert at the time were Russian and affiliated with the Industrial Workers of the World.\nMount Cuthbert State School opened in 1917 and closed in 1924.\nA fall in the world price of copper in 1920 badly affected the local economy, and by 1921 only 267 people remained.  By 1927 the settlement was a ghost town, and the railway line was closed in 1949.\nMount Cuthbert Post Office opened by June 1910 (a receiving office had been open from 1908) and closed in 1927.\nHeritage listings\nThe township of Mount Cuthbert and its smelter is listed on the Queensland Heritage Register.\nExternal links\n* [http://www.ga.gov.au/place-names/PlaceDetails.jsp?fctext=BORE&fctext=URBN&submit1=QLD23008&fctext=MT&fctext=MT&fctext=MT&fctext=MT Place Search - Geoscience Australia]\nReferences"
    }
  ]
}