{
  "content": [
    {
      "type": "text",
      "text": "# Mount Garnet, Queensland\n\n| pop                 = 532\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4872\n| area                = 503.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 45.8\n| dir1                = W\n| location1           = Ravenshoe\n| dist2               = 95.8\n| dir2                = SW\n| location2           = Atherton\n| dist3               = 128\n| dir3                = W\n| location3           = Innisfail\n| dist4               = 161\n| dir4                = SW\n| location4           = Cairns\n| dist5               = 1728\n| dir5                = NNW\n| location5           = Brisbane\n| lga                 = Tablelands Region\n| stategov            = Hill\n| fedgov              = Kennedy\n| elevation           = 660\n| maxtemp             =\n| mintemp             =\n| rainfall            =\n| near-n              = Irvinebank\n| near-ne             = Silver Valley\n| near-e              = Innot Hot Springs\n| near-se             = Gunnawarra\n| near-s              = Gunnawarra\n| near-sw             = Munderra\n| near-w              = Munderra\n| near-nw             = Irvinebank\n}}\nMount Garnet is a rural town and locality in the Tablelands Region, Queensland, Australia. In the , the locality of Mount Garnet had a population of 532 people.\nGeography\nVarious small communities populate the area around Mount Garnet. These include Tableland Tin, Innot Hot Springs, Silver Valley and Battle Creek.\nMount Garnet is at the south-western edge of the Atherton Tableland and on the Kennedy Highway.  Mount Garnet is about a three-hour drive from Cairns.\nMount Garnet is  south-west of Cairns via the Bruce Highway, Gillies Range Road, Lake Barrine Road, State Route 25, State Route 24 and the Kennedy Highway. From further west it can be accessed via the Kennedy Highway.\nThe town of Mount Garnet is in the east of the locality. Nymbool is a neighbourhood within the west of locality ().\nAlthough historically part of neighbouring Silver Valley, the now-abandoned township of Coolgarra is just within the boundaries of Mount Garnet in the north-east of the locality ().\nNot far from the base of Garnet Hill on the south east side is Warruma Swamp. This wetland is home to many variety of birds. Originally Warruma was a swamp and boasted a water source that never ran dry. Now it is used for a water supply to the township. Fresh water is continually pumped from the Herbert River into Warruma, then pumped out of there into holding tanks for the town supply.\nMining isn't the only industry at Mount Garnet, some of the best cattle producing properties are in the district. Crops of mangoes, corn and other crops are grown on the nearby Herbert River. Blencoe Falls on the Herbert River can be accessed from many of these cattle properties.\nMountains\nMount Garnet has the following mountains (from north to south):\n* Boulder Peak ()\n* Excelsior Pinnacle ()\n* Mount Veteran ()\n* Mount Fairyland ()\n* Fuzzy Hill ()\n* Round Mountain ()\n* Mount Garnet ()\n* Ironstone Hill ()\n* Seven Mile Hill ()\n* Luceys Knob ()\nHistory\nMount Garnet is situated on the traditional lands of the Mbarbaram peoples.\nWarungu (also known as Warrungu, Warrongo, and Waroongoo) is an Australian Aboriginal language in North Queensland. The language region includes areas from the Upper Herbert River to Mount Garnet.\nMount Garnet was built as a mining community in the 19th century and several minerals can be found in the area, including tin, copper, zinc and garnet. Garnet Hill is situated a few hundred metres from the state school, was a main vein of tin and garnet in the late 19th century. Open mine shafts still litter the hill only covered with sheets of tin.\nIn 1882, Albert Vollenweider discovered copper (and garnet) in the area formerly known as Mullaburra Station.  He mined the copper in a small-scale operation but he later sold his lease to John Moffat in 1898. By 1899 Mt Garnet Freehold Copper and Silver Mining Company was producing high grade copper oxide. The township was surveyed and buildings sprang up making the township the second-largest inland town (Charters Towers being the largest). By 1906 the company was in financial difficulty and closed. People were moving away for work, buildings were being moved to other mining towns until the mining of the rich veins of tin, which was first discovered in 1901, started to take off. The town began to flourish again.\nMount Garnet Post Office opened on 25 July 1899 (a receiving office had been open from 1897).\nMount Garnett Provisional School opened on 22 January 1901.  Around 1901–1902, it became Mount Garnett State School.\nMount Garnet Methodist Church was built in 1902. It was built from timber at a cost of £100. It could seat 90 people. In 1977, it became Mount Garnet Uniting Church. It is now closed. It was at 3 Silver Street ().\nNymbool Provisional School opened in 1905 and closed in 1930.\nTin became the important mineral for the town. In 1928, a coal-fired dredge was built but didn't prove to be so successful losing more ore it retrieved. Eventually it sank in a flood. It was later refloated and adapted but eventually abandoned. In 1938 Tableland Tin Dredging N.L. established a new electrically driven dredge, Nanyeta, later to be replaced by Nanyeta II. By the early 1950s another dredge owned by Ravenshoe Tin Dredging was in operation. Tin carried the town until 1986 when the price dropped forcing many families to move away.\nIn the 1930s, several cattle stations were established within the community as well as farms that grew many crops, including tobacco, potatoes, corn and peanuts. Various mining operations, as well as lime production, are in operation today just outside the town.\nOn Sunday 14 November 1937, Bishop John Feetham laid the corner block of a new Anglican church. St David's Anglican Church was built in 1938 from timber. Bishop Feetham returned in November 1938 to officially open and dedicate the church.\nIn 1938, land was donated to the people of Mount Garnet to use as a sports reserve. A grand racecourse was built. It and rodeo grounds were used by the troops for R & R during training in WW2. Soldiers volunteered their help with any construction needed. In return cattle station owners provided horses and bulls for their entertainment with races and rodeo. Passby parades of the troops were held there when General Blamey came to inspect the troops. This reserve now boasts a first class rodeo ground, racecourse and golf club, the greens being inside the racetrack, and permanent camps. These camps are controlled by trustees (Trustees of the LD Lucy Memorial Park). 2013 is the 75th year that the races have been run.\nIn June 1939, tenders were called to relocate the Catholic church at Mungana to Mount Garnet. It was a timber structure with an exposed stud frame. The church began to be pulled down in July 1939 and was then transported to Mount Garnet by train.  On Sunday 1 October 1939, the Holy Rosary Catholic Church was officially opened and dedicated by Bishop John Heavey as part of a weekend of celebrations. The new church was built in the Gothic style with a high-pitched red gable roof. The walls were painted a rich brown with Gothic windows and fascias picked out in white. There were white crosses on the roof and the high point of the porch. There was a church bell. The builder in Mount Garnet was Moss Collins.\nIn 2000 the original copper mine was reopened with copper, zinc, lead, and silver being processed by Kagara Limited. In 2012 Kagara Limited went into administration and was bought out in 2013 by Snow Peak Mining Pty Ltd, an Australian company with strong Chinese shareholding, with the mine being operated by Consolidated Tin Mines. They will eventually process tin. Another tin mining company, Mount Garnet Tin Resources (MGT), has a tin processing plant, Mount Veteran. This plant was built in 1980 and had been used intermittently until the recent resurgence in the tin price. MGT purchased it and are processing high grade tin.\nDemographics\nIn the , the town of Mount Garnet had a population of 458 people.\nIn the , the locality of Mount Garnet had a population of 433 people.\nIn the , the locality of Mount Garnet had a population of 430 people.\nIn the , the locality of Mount Garnet had a population of 532 people.\nHeritage listings\nThe Mount Garnet area has a number of heritage-listed sites, including:\n* Coolgarra Battery, Coolgarra Station, Silver Valley ()\n* Gunnawarra Homestead, Gunnawarra Road, Gunnawarra ()\n* Nettle Creek Tin Dredge, Nettle Creek, Innot Hot Springs\n* Mount Garnet Mine Assay Office, Zinc Road ()\nEducation\nMount Garnet State School is a government primary (Prep–6) school for boys and girls at Garnet Street (). In 2018, the school had an enrolment of 44 students with 4 teachers and 6 non-teaching staff (4 full-time equivalent).\nThere are no secondary schools in Mount Garnet. The nearest government secondary school is Ravenshoe State School (to Year 12) in Ravenshoe to the east. However, the travel time to Ravenshoe from the north and west of the locality may be unrealistic; other options would be distance education and boarding school.\nTransport\nA railway was authorised to be built from Lappa, on the then Chillagoe Railway and Mines Company's line, to Mount Garnet by the Mount Garnet Freehold Mining Company in 1897. It suffered a rather shaky construction period and it was not until 11 January 1904 that the line was ready as far as a flood-damaged Return Creek bridge, across that creek from the town. It took another eleven years before trains could officially negotiate the bridge to the Mount Garnet station.  The line was taken over by the Government from 23 December 1914.  It closed on 1 July 1961.\nDuring the life of the railway, minerals, timber, cattle and crops were moved to coastal ports and goods, mining machinery were brought in. The railway bridge at Mount Garnet, which ceased being used in 1961, was demolished by the big flood of 1967. The remains can still be seen in Return Creek. The rail track was lifted in 1961 and is now used as a vehicle road to Lappa Lappa Junction. This road is only negotiable by four wheel drives but is a very nice drive. Culverts along the track were remarkably made by stonemasons and still stand with many still serving their purpose by channelling water through to creeks and gullies.\nToday, the transport comes in the form of semi's and trucks. Being the \"Gateway to the Coast\" and \"Gateway to the Gulf\", this section of the Kennedy Highway is quite busy, particularly when the Bruce Highway is closed from flooding.\nAmenities\nThe Mount Garnet branch of the Queensland Country Women's Association meets at QCWA Hall at 16 Garnet Street.\nHoly Rosary Catholic Church is at 3 Opal Street (). It is within the Ravenshoe Parish of the Roman Catholic Diocese of Cairns which is administered from the Malanda Parish.\nSt David's Anglican Church is at 24 Garnet Street ().\nFacilities\nThere are a number of community facilities:\n* Mount Garnet Police Station ()\n* Mount Garnet SES Facility  ()\n* Mount Garnet Primary Health Centre ()\n* Mount Garnet Ambulance Station ()\n* Mt Garnet Cemetery ()\nReferences\nExternal links\n*\n* [https://gisservices.information.qld.gov.au/arcgis/rest/directories/historicalscans/cad_scans/cad-map-town-mount-garnet-1981.jpg Town map of Mount Garnet, 1981]\n*"
    }
  ]
}