{
  "content": [
    {
      "type": "text",
      "text": "# Mount Tyson, Queensland\n\n| pop                 = 280\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4356\n| area                = 76.8\n| timezone            = AEST\n| utc                 = +10:00\n| lga                 = Toowoomba Region\n| stategov            = Condamine\n| fedgov              = Groom\n| dist1               = 20.2\n| dir1                = N\n| location1           = Pittsworth\n| dist2               = 23.7\n| dir2                = SW\n| location2           = Oakey\n| dist3               = 40.6\n| dir3                = W\n| location3           = Toowoomba\n| dist4               = 170\n| dir4                = W\n| location4           = Brisbane\n| near-n              = Mount Irving\n| near-ne             = Purrawunda\n| near-e              = MotleyLinthorpe\n| near-se             = Rossvale\n| near-s              = Irongate\n| near-sw             = Bongeen\n| near-w              = Evanslea\n| near-nw             = Evanslea\n}}\nMount Tyson is a rural town and locality in the Toowoomba Region, Queensland, Australia. In the , the locality of Mount Tyson had a population of 280 people.\nGeography\nMount Tyson is on the Darling Downs. It is located  west of Toowoomba city centre.\nThe Toowoomba–Cecil Plains Road runs along part of the northern boundary.\nMount Tyson has the following mountains:\n* Mount Edgecombe ()\n* Mount Tyson ()\nHistory\nThe town's name derives from the name of its railway station, which in turn was derived from the local mountain, which was believed to be named after James Tyson, a grazier and Member of the Queensland Legislative Council.\nMount Tyson Provisional School opened on 18 April 1904 (Easter) with 35 pupils; Minnie (McIntyre) Fletcher was the first teacher. On 1 January 1909, it became Mount Tyson State School. The school was extended in 1916, 1949, 1963, 1973 (library) and 1996 (Prep year building). The school celebrated its centenary in 2004.\nMount Tyson Post Office opened by 1917 (a receiving office had been open from 1904, briefly known as Mount Russell).\nBetween 1914 and 1994, the town was serviced by the Cecil Plains railway line.\nSt Philip's Anglican Church was dedicated on 13 October 1907 by St Clair Donaldson, the Anglican Archbishop of Brisbane. When St John's Anglican Church in Springside closed circa 1974, its church building was relocated to the site of St Philip's  for use as a Sunday school and later remodelled as a parish hall. Circa 2014, St Philip's church also closed. The land with the two church buildings at 6-8 Main Street () was sold as a single lot on 4 August 2016 and is now privately owned.\nMount Tyson Methodist Church was built in 1907 at a cost of £105. It could seat 100 people. It has since been demolished.\nMary Immaculate Catholic Church was built in 1958. The timber church was designed  by F Cullen.\nIn 1991, Mount Tyson was the national winner of the Australian Tidy Town Awards, run by Keep Australia Beautiful.\nDemographics\nIn the , the locality of Mount Tyson had a population of 285 people.\nIn the , the locality of Mount Tyson had a population of 280 people.\nEducation\nMount Tyson State School is a government primary (Prep-6) school for boys and girls at Main Street ().  In 2017, the school had an enrolment of 58 students with 7 teachers (4 full-time equivalent) and 8 non-teaching staff (4 full-time equivalent). In 2018, the school had an enrolment of 55 students with 6 teachers (4 full-time equivalent) and 7 non-teaching staff (3 full-time equivalent).\nThere are no secondary schools in Mount Tyson. The nearest government secondary schools are Pittsworth State High School in Pittsworth to the south and Oakey State High School in Oakey to the north-east.\nAmenities\nLibrary services in Mount Tyson are provided by the Toowoomba Regional Council's mobile library service. The van visits Mt Tyson on the 2nd and 4th Tuesday of each month.\nMary Immaculate Catholic Church is at 45 Main Street ().\nNotable residents\n* Sir Alan Roy Fletcher, chairman of Pittsworth Shire Council and Member of the Queensland Legislative Assembly for Cunningham\nReferences\nFurther reading\n*\nExternal links\n*\n* [https://gisservices.information.qld.gov.au/arcgis/rest/directories/historicalscans/cad_scans/cad-map-town-mount-tyson-1968.jpg Town map of Mount Tyson, 1968]\n* [http://www.mttysonss.eq.edu.au/ Mount Tyson State School]}"
    }
  ]
}