{
  "content": [
    {
      "type": "text",
      "text": "# Mount Barney (Queensland)\n\n| coordinates_ref =\n| topo =\n| type = Shield volcano\n| age  = 24&nbsp;million years\n| first_ascent = 3 August 1828 by Captain Patrick Logan\n| easiest_route = Peasants Ridge (South Ridge)\n| part_type  = Peaks\n| part = West Peak (1359), East Peak (1354), North Pinnacle (1221), Leaning Peak, Isolated Peak, Toms Tum, Midget Peak, Barrabool Peak\n| normal_route = South (Peasants) Ridge, Mezzanine Ridge, Lions Ridge, South East Ridge, Mid South East Ridge, Logans Ridge, Rocky Creek, North Ridge, Northeast Ridge, Eagles Ridge, Short Leaning Route, Long Leaning Route, Midgets Route, Savages Ridge\n}}\nMount Barney is a mountain within the Scenic Rim Region in south-east Queensland, Australia.  It lies approximately  south-west of Brisbane, not far from the Queensland - New South Wales border, and forms part of the McPherson Range. It is a popular destination for bushwalkers and campers.  Mount Barney is the sixth or seventh highest mountain in Queensland and is often regarded as one of the most impressive parts of the Scenic Rim. The mountain consists of two main peaks, (East Peak and the slightly higher West Peak), and smaller subsidiary peaks. East Peak is probably the most popular destination for bushwalkers.\nThe closest town is Rathdowney. Mount Barney is surrounded by other mountains including Mount Ballow, Mount May, Mount Ernest, Mount Maroon and Mount Lindesay. Logan River has its headwaters on the mountain.\nGeology\nThe dome-shaped mass is composed of granophyre that formed below the surface and subsequently intruded into the overlaying sandstone. Erosion has stripped away the sandstone leaving the mountain's twin peaks.\nMount Barney is the remnants of the central complex of the Focal Peak Volcano which together with the Tweed Volcano covered much of South East Queensland and North East New South Wales with lavas referred to as the Lamington Volcanics\nNatural heritage\nIn 1947, the Mount Barney National Park was established to protect the natural heritage surrounding the peak. Mount Barney was included in the Central Eastern Rainforest Reserves in 1994. The Antarctic beech can be found of the upper slopes of adjacent Mount Nothafagus and in the rainforest of nearby Mount Ballow. Important animal species found on the mountain include platypus, rock wallabies and Coxen's fig parrot. Heath vegetation on the mountain provides habitat for a colony of the endangered eastern bristlebird.\nHistory\nMount Barney has held a special significance for local Aboriginal people for millennia, and it features prominently in a number of their stories. For Aboriginal people the peak has traditionally been regarded as a place to avoid.\nAllan Cunningham originally named the mountain Mount Lindesay. However, the New South Wales Surveyor-General Thomas Mitchell is believed to have renamed it in the 1840s to Mount Barney, after George Barney, a colonial engineer. Mitchell is believed to have assigned the name Mount Lindesay to the current Mount Lindesay (which Cunningham had originally named Mount Hooker).\nThe first recorded ascent of Mount Barney was by Captain Patrick Logan, who reached the West Peak summit around noon on 3rd August 1828 during an exploring expedition. Logan recorded the ascent in his journal, as did his fellow explorers Charles Fraser and Allan Cunningham. Fraser accompanied Logan for part of the ascent but did not summit. At the time it was highest ascent by a European on any mountain in Australia.\nHistorical records suggest that Europeans probably began bushwalking at Mount Barney for recreation in about the 1880s, when the region became more closely settled. During the first decade or so of the 20th century, the peak became popular with a small number of self-styled 'mountaineers', such as Boonah school teachers Harry Johns (1877–1943) and William Gaylard (1880–1930), Ipswich Technical College Principal R.A. Wearne (1870–1932), and some of the selectors who lived close by, such as the Doherty family at Lilydale. However it was probably not until the early 1930s, with the formation of groups such as the National Parks Association, and the appearance of a new breed of outdoor adventurers such as Bert Salmon (1899–1982), who made the first recorded ascent of Leaning Peak in 1932, Cliff Wilson (who was probably the first European to climb all of the Mount Barney peaks and lesser pinnacles) and Arthur Groom (1904–1953), and also botanists such as Cyril White (1890–1950) and Lindsay Smith (1917–1970), that bushwalkers began visiting the peak in numbers, and even then, much of Mount Barney remained unexplored until the late 1940s and early 1950s, when groups such as the University of Queensland Bushwalking Club, and the Brisbane Bushwalkers began making regular bushwalking and camping trips to the peak.\nBushwalking\nThere are a dozen or so established bushwalking routes up Mount Barney, however none of them are easy. All the routes require a reasonable level of fitness, and many require advanced route-finding and rock-scrambling skills. Only South Ridge (\"Peasants Ridge\") can be recommended to less experienced walkers. Whilst the steep route up Logan's Ridge to the East Peak summit is often considered to be the most spectacular, all the routes have their attractions. As a rough guide, a trip to East Peak via one of the more direct routes will generally take 8–9 hours return when carrying a day pack. There is usually a flow of drinkable water in the creek at the saddle between East and West Peak, but elsewhere on the mountain, away from the creeks, water is often difficult to find. In addition to the mountain itself, Mount Barney Creek (to the West) and Cronan's Creek (to the South-East), the two main creek systems which ring Mount Barney, offer plenty of scope for walking and camping, particularly in the warmer months. Note though that the creeks are prone to flash flooding after heavy rainfall, and that they are potentially quite dangerous at times of high flow.\nThere are a few Class 4 hiking trails around the base of the mountain, including the Lower Portals, and Cronan Creek Trails.\nA free iPhone GPS App is available to aid hikers in keeping to hiking trails within Mt Barney National Park.\nRock climbing\nTo date, Mount Barney has attracted only a relatively small number of rock climbers, perhaps due to the long walk-in times and access difficulties. So far, local climbers have generally agreed that the peak should remain \"traditional only\" (no bolts).  The spectacular East Face was first climbed in 1966, and over the years a number of other routes have been put up in the vicinity of Leaning Peak and Isolated Peak. More recently, bouldering (ground-level climbing) has become popular in Mount Barney Creek upstream from the Lower Portals camping area.\nThere is one multipitch sport climb known as “The Governor”. At  long, it is one of Queensland's longest climbs. The longest is the 410 metre North Face of Leaning Peak climbed in 1968.\nSee also\n*List of mountains in Australia\n*List of volcanoes in Australia\nReferences\nExternal links\n*\n* [http://nrgeology.blogspot.com.au/search/label/focal%20peak%20volcano Northern Rivers Geology Blog - Focal Peak Volcano]"
    }
  ]
}