{
  "content": [
    {
      "type": "text",
      "text": "# Mount Mulligan, Queensland\n\n| pop                 = 0\n| pop_year            =\n| pop_footnotes       =\n| established         = 1910\n| postcode            = 4871\n| area                = 1516.0\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 52.7\n| dir1                = NNW\n| location1           = Dimbulah\n| dist2               = 95.9\n| dir2                = NW\n| location2           = Mareeba\n| dist3               = 157\n| dir3                = W\n| location3           = Cairns\n| dist4               = 1797\n| dir4                = NNW\n| location4           = Brisbane\n| lga      = Shire of Mareeba\n| stategov = Cook\n| fedgov   = Leichhardt\n| elevation=\n| maxtemp  =\n| mintemp  =\n| rainfall =\n| near-n              = Mount Carbine\n| near-ne             = Southedge\n| near-e              = Paddys Green\n| near-se             = Glen Russell\n| near-s              = Thornborough\n| near-sw             = Chillagoe\n| near-w              = Nychum\n| near-nw             = Hurricane\n}}\nMount Mulligan is a former mining town and now a rural locality in the Shire of Mareeba, Queensland, Australia. In the , the locality of Mount Mulligan had \"no people or a very low population\".\nIt is the site of the Mount Mulligan mine disaster, Queensland's worst mining disaster.\nGeography\nAlthough still officially gazetted, Mount Mulligan is now a ghost town, with a single cemetery, a single occupied residence, a single chimney stack, and the overgrown remains of the once busy mining operations and electricity generator.\nNearby towns are Julatten, Dimbulah, Mount Carbine and Mount Molloy.\nHistory\nThe conglomerate and sandstone mountain range is known to local Djungan people as Ngarrabullgan. The Djungan people began living on the mountain about 40,000 years ago but ceased to camp on the range about 600 years ago. The range was named Mount Mulligan after prospector James Venture Mulligan by his colleagues in their 1874 exploration expedition searching the Hodgkinson River for gold. The name Mount Mulligan was later given to the town that grew in the shadows of the range's escarpment.\nThe town's coal was mined from shafts dug into a Permian layer within the cliff face or escarpment of a large  x  free-standing conglomerate and sandstone massif (rising up to 400 metres above the township). It was a coal mining town from 1910 until 19 September 1921 when an underground explosion killed 75 miners (all of the miners in the mine including those near the entrance). The mine closed, but reopened in 1922 and continued in production until 1957 when a hydro-electric scheme eliminated the need for the coal.\nMount Mulligan Post Office opened by July 1914 (a receiving office had been open from 1907) and closed in 1959. A Mount Mulligan Rail Post Office was open between 1916 and 1920.\nThe Chillagoe railway connected Mount Mulligan with Dimbulah. It opened on 7 April 1915 and was officially closed in January 1958.\nDemographics\nIn the , the locality of Mount Mulligan and the surrounding area had a population of 55 people.\nIn the , the locality of Mount Mulligan had \"no people or a very low population\".\nIn the , the locality of Mount Mulligan had \"no people or a very low population\".\nEducation\nThere are no schools in Mount Mulligan. The nearest primary and secondary school (P-10) school is Dimbulah State School in Dimbulah to the south, but it would be too distant from many parts of Mount Mulligan. Also, there are no secondary school to Year 12 nearby. Distance education and boarding school are the alternatives.\nSee also\n* Ngarrabullgan\nReferences\nExternal links"
    }
  ]
}