{
  "content": [
    {
      "type": "text",
      "text": "# Mount Coot-tha, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 =\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4066\n| area                = 14.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 10.4\n| dir1                = W\n| location1           = Brisbane CBD\n| dist2               =\n| dir2                =\n| location2           =\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Brisbane(Pullenvale and Walter Taylor Wards)\n| stategov            = Maiwar\n| stategov2           = Moggill\n| fedgov              = Ryan\n| near-n              = The Gap\n| near-ne             = Bardon\n| near-e              = Toowong\n| near-se             = TaringaIndooroopilly\n| near-s              = Chapel Hill\n| near-sw             = Kenmore Hills\n| near-w              = Brookfield\n| near-nw             = Brookfield\n}}\nMount Coot-tha is a mountain and a suburb of the City of Brisbane, Queensland, Australia.  Visible from much of the city, Mount Coot-tha is a popular bushland tourist destination including the Mount Coot-tha Lookout,  Brisbane Botanic Gardens and Sir Thomas Brisbane Planetarium, as well as a mountain drive, bike trails, parks including a waterfall, and television and radio towers. In the , Mount Coot-tha had a population of 0 people.\nGeography\nThe mountain Mount Coot-tha forms the eastern extent of the Taylor Range and is a prominent landmark approximately  to the west of the Brisbane central business district.  Mount Coot-tha is the source of Ithaca Creek.\nThe mountain has a number of named peaks in the suburb:\n* Constitution Hill ()\n* Mount Coot-tha ()\n* The Pinnacle (),\n* The Summit ()\nSir Samuel Griffith Scenic Drive is a loop road around the mountain, passing by (clockwise) Mount Coot-tha, Constitution Hill, and The Summit. It provides access to the Mount Coot-tha Lookout with its cafe and restaurant, the radio and television stations with their transmission towers at The Summit (originally located there to maximise transmission), picnic areas, and walking and cycling tracks. One of the walking tracks provides access to The Pinnacle.\nIt is often claimed that Mount Coot-tha is the \"highest point in Brisbane\", but, as the elevations above show, the peak known as Mount Coot-tha is not even the highest peak of the mountain as a whole with both Constitution Hill and The Summit being higher. However, Mount Coot-tha has a lookout with unobscured views over much of Brisbane, while Constitution Hill and The Summit do not. Further to the west, there are even higher peaks within the City of Brisbane, such as:\n* Boombana Knob ()\n* Mermaid Mountain ()\nwhich are within the locality of Lake Manchester in the D'Aguilar National Park, but these are not accessible by road. For recreation and tourism purposes, Mount Coot-tha is the highest point in Brisbane which is easily accessed and has excellent views.\nThe Brisbane Botanic Gardens are at the base of the mountain at 152 Mount Coot-tha Road (). A number of other facilities are on that site including the Sir Thomas Brisbane Planetarium (), the Mount Coot-tha branch of the Brisbane City Council Library (), and Queensland Herbarium ().\nBetween the botanic gardens and the mountain is the  Mount Coot-tha Quarry at 200 Mount Coot-tha Road (). It is operated by the Brisbane City Council. The quarry extracts metamorphic rock for both stonework and aggregate. Due to the hardness of the rock, blasting can be required for extraction, but the hardness is beneficial as the building materials it creates are very durable. The quarry has provided the aggregates for over 96% of Brisbane's roads, producing approx  of aggregate for asphalt each year.\nHistory\nBefore the Moreton Bay penal settlement, Mount Coot-tha was the home of the Yugara Aboriginal people. The Aboriginal people came to the area to collect ku-ta, the Yugarabul word for honey that was produced by the native stingless bee.\nIn 1839, surveyor James Warner and his team cleared the top of the mountain of all trees except one large eucalypt tree. Because this single tree could be seen from many other locations, it was used as a trigonometric station to take surveying measurements. This led to the mountain being called One Tree Hill.\nIn 1873, the forests on the mountain were declared a timber reserve to supply timber for Queensland's growing railway network.\nThe name Coot-tha replaced the name One Tree Hill when the area was declared a park in August 1883. The name was suggested by Henry Wyatt Radford, the Clerk of the Queensland Legislative Council, on the advice of local Aboriginal foreman Kerwalli. Coot-tha has been suggested as an Aboriginal word for honey. Archibald Meston (Protector of Aborigines, 1898–1903) wrote in 1923 that Gootcha is a more accurate transcription, and that Coot-tha is a separate word translating to an obscenity; supposedly a joke played on Radford by Kerwalli.\nIn the mid 1890s, the Shire of Toowong (then the local government for the area) established a quarry on the side of the mountain. Following the 1925 amalgamation of local government areas that created the City of Brisbane, the ownership and operation of the quarry was acquired by the Brisbane City Council.\nDuring World War II, the mountain was used as a military base by the RAAF and the US Navy. It was converted to a vast explosives depot and at one stage held more than 120,000 tonnes of explosive weapons. When darkness fell, the lookout bristled with search lights in an amazing display as soldiers kept an eye out for enemy planes. Anti-aircraft guns and searchlights were located on the lookout. Mount Coot-tha was also the site of US Naval Ammunition Depot (Navy 134) supplying submarines at the Capricorn Wharf at New Farm (Teneriffe) in Brisbane.\nIn 1970, Brisbane City Council established new botanic gardens at the base of the mountain with the intention of replacing the then Brisbane Botanic Gardens at Gardens Point in the Brisbane CBD, which was prone to flooding and lacked space for expansion. The new gardens were originally called the Mount Coot-tha Botanic Gardens and were officially opened in 1976, becoming the Brisbane Botanic Gardens with the gardens in the CBD being renamed the City Botanic Gardens) .The new gardens cover .\nThe Mount Coot-tha Library opened in 1975 at the Brisbane Botanic Gardens. Unlike most branches of the Brisbane City Libraries, this library specialises in botany, horticulture, gardening and landscape design.\nOn 24 May 1978, Sir Thomas Brisbane Planetarium officially opened in the grounds of the Brisbane Botanic Gardens.\nBrisbane community television channel 31 Digital broadcast from the mountain from 1994 to 2017, after which it shifted to internet streaming under the new name of Hitchhike TV.\nOn 20 November 2005, one of the Mount Coot-tha more difficult trails, the Currawong trail, was renamed the Kokoda trail in honour of the Australian soldiers who marched the Kokoda Track in Papua New Guinea during World War II.\nIn 2017, it was proposed to build Australia's longest flying fox from the summit of Mount Coot-tha down to the Brisbane Botanic Gardens. Despite initially being approved by the Brisbane City Council, in April 2019 the new Mayor of Brisbane Adrian Schrinner decided to cancel the project due to public protests.\nDemographics\nIn the , Mount Coot-tha had a population of 0 people.\nIn the , Mount Coot-tha had a population of 0 people.\nHeritage listings\nMount Coot-tha has a number of heritage-listed sites, including:\n* Sir Samuel Griffith Drive: Mount Coot-tha Forest\n* Sir Samuel Griffith Drive: Mount Coot-tha Lookout\nThe Lookout\nMount Coot-tha is one of Brisbane's most popular tourist destinations and is a popular stop with bus tours. Of particular note is the Lookout, which includes the Kuta Cafe, Summit Restaurant, and Gift Shop.\nBrisbane at night from the Lookout\nThe lookout, restaurant and cafe allow for panoramic views of the City. A function centre adjoins the restaurant. Well-known British astronomer Sir Patrick Moore gave a night-time public lecture about the stars of the southern hemisphere at the lookout in 1988, in conjunction with Patrick Moore being a guest speaker at a dinner of the Southern Astronomical Society at Toowong in Queensland.\nThe Mount Coot-tha Reserve\nThe Mount Coot-tha Reserve contains more than 1,500 hectares of natural bushland, including J C Slaughter Falls along Ithaca Creek, as well as native wildlife. Mount Coot-tha Reserve also shares a border with Brisbane Forest Park, which adds a further 25,000 hectares.\nTelevision and radio towers\nOn a ridge near the summit on the other side of Mount Coot-tha, are the television transmission towers for the Brisbane television stations and their respective studios; Ten (TVQ-10), Nine (QTQ-9), Seven (BTQ-7). The transmission tower for (ABC Brisbane) is located on the mountain, which also broadcasts television for multicultural station SBS and previously the community television station Briz 31. Most of the FM Brisbane radio stations also transmit from Mount Coot-tha.\nPart of the Brisbane suburb of The Gap is located on the foothills beneath the television towers.\nMount Coot-tha Botanic Gardens\nJapanese Gardens at Mount Coot-tha Botanic Gardens\nThe Brisbane Botanic Gardens has a range of attractions featuring plants from different landscapes, including a tropical hothouse, a Japanese garden, an arid zone (plants from Central America and Africa), and a Pacific Island zone. The major exhibit is the  display of native Australian plants (with emphasis on Queensland plants), featuring an artificial lagoon.\nLibrary\nMount Coot-tha has a public library on Mt Coot-tha Road in the Brisbane Botanic Gardens operated by the Brisbane City Council. Unlike most public libraries in Brisbane which have general collections, this library holds a specialist collection about botany and astronomy and related topics reflecting its locations within the botanic garden and the Brisbane Planetarium also on the site.\nWalking tracks\nThere are several popular walking tracks around Mount Coot-tha, one of which includes an art display comprising works produced by local Aboriginal artists. The tracks vary in difficulty, with most involving some uphill sections or steps. Tracks around Mount Coot-tha are often used by hikers training to walk the Kokoda Track in Papua New Guinea as the terrain and climate are considered similar.\nMountain bike trails\nThe Western side of Mount Coot-tha Forest or Gap Creek Reserve as it is known to the locals is a haven for Brisbane mountain bike riders.  The establishment of a world class mountain bike trail network by the Brisbane City Council has created a diverse range of recreational experiences for off-road cyclists.\nThe mountain bike trails at Mount Coot-tha have been assigned a grading under the International Mountain Bicycling Association, Trail Difficulty Rating System.  The multi-use trails in Mount Coot-tha provide the least degree of technical challenge to mountain bike riders, however many of them are steep and loose.  Riders are advised to pay special attention when riding over the erosion control banks (water bars) which have been the downfall of many a novice rider.  The trail ratings provide a guide to the relative difficulty of each trail.\nThe multi-use tracks are used by horses, pedestrians and mountain bikers.  Each year orienteering events are held in the area.\nTransport\nMount Coot-tha can be reached by Brisbane Transport Bus 471 (Translink). Between 2014 and 2016 the Brisbane City Council ran a CitySights Bus that included Mount Coot-tha. A short taxi ride from Toowong is also possible as well as Uber and such. Parking is limited at the lookout.\nControversies\nThe Mount Coot-tha Quarry is the subject of ongoing complaints by nearby residents claiming that it is a \"massive scar on the landscape\" and that they have been adversely affected by dust, noise, vibration, and damage arising from the blasting, claiming that blasts last up to 30 seconds. The Brisbane City Council counters the complaints by pointing out that the quarry has been in place for so long that any residents should have been aware of the quarry prior to moving to the area, that blasting is conducted at most twice a month with each blast lasting for less than 0.6 seconds, that blasts are conducted using blast minimisation techniques, and that blasts are within the guidelines established by the Queensland Government (which the government has confirmed). Residents can be advised of upcoming blasts by subscribing to an email list. Residents assert that the conditions under which the quarry operates would not be approved if it was being proposed today, but the principle of \"existing industrial use\" allows industrial activities to continue if they were acceptable at the time of their original establishment/approval.\nSee also\n* Flora of Brisbane\n* List of mountains in Australia\nReferences\nExternal links\n* *\n* [https://web.archive.org/web/20051227115008/http://www.ourbrisbane.com/living/suburbs/mt_coot-tha/home/ Mount Coot-tha]\n* [https://web.archive.org/web/20100823033916/http://www.mtbdirt.com.au/trails-information Mountain Bike Trails Info]\n* [https://archive.today/20070929223305/http://www.brisbanelookout.com/pages/general_info.html Mount Coot-tha Lookout]\n* [http://www.brisbane.qld.gov.au/environment-waste/natural-environment/bushland-parklands-wetlands/natural-areas/reserves-wetlands-parklands-forests/mt-coot-tha-forest Mt. Coot-tha] (Government website)"
    }
  ]
}