{
  "content": [
    {
      "type": "text",
      "text": "# Mount Fernow (King County, Washington)\n\n| prominence_ft = 1550.\n| prominence_ref =\n| isolation_mi = 7.18\n| isolation_ref =\n| parent_peak = K9 (6,242 ft)\n| country = United States\n| state = Washington\n| region = King\n| region_type = County\n| part_type = Protected&nbsp;area | part = Wild Sky Wilderness\n| range = Cascade Range\n| map = Washington#USA\n| map_caption = Location in Washington\n| coordinates =\n| coordinates_ref =\n| topo = USGS Captain Point\n| age = Late Cretaceous\n| rock = Tonalite\n| first_ascent =\n| easiest_route =  scrambling\n}}\nMount Fernow is a  mountain summit located  northeast of Skykomish, in eastern King County of Washington state.\nDescription\nMount Fernow is part of the Cascade Range, and is situated  west of Stevens Pass in the Wild Sky Wilderness, on land managed by Mount Baker-Snoqualmie National Forest. The nearest higher neighbor is \"K9\",  to the southeast. The Mount Fernow Potholes are a series of lakes approximately one mile north of this peak. This mountain's name was officially adopted in 1967 by the U.S. Board on Geographic Names. The name honors Bernhard Fernow (1851–1923), who was the third chief of the Division of Forestry of the United States. This mountain is one of two peaks in Washington state named for Bernhard Fernow, the other being Mount Fernow  to the northeast in the Entiat Mountains.\nClimate\nMount Fernow is located in the marine west coast climate zone of western North America. Weather fronts coming off the Pacific Ocean travel northeast toward the Cascade Mountains. As fronts approach, they are forced upward by the peaks of the Cascade Range, causing them to drop their moisture in the form of rain or snow onto the Cascades (Orographic lift). As a result, the west side of the Cascades experiences high precipitation, especially during the winter months in the form of snowfall. Because of maritime influence, snow tends to be wet and heavy, resulting in avalanche danger. During winter months, weather is usually cloudy, but, due to high pressure systems over the Pacific Ocean that intensify during summer months, there is often little or no cloud cover during the summer. Precipitation runoff from the mountain drains into tributaries of the Skykomish River.\nGeology\nMt. Fernow is composed of tonalite of the Mount Stuart batholith. The history of the formation of the Cascade Mountains dates back millions of years ago to the late Eocene Epoch. With the North American Plate overriding the Pacific Plate, episodes of volcanic igneous activity persisted.  Glacier Peak, a stratovolcano that is  north of Mt. Fernow, began forming in the mid-Pleistocene. In addition, small fragments of the oceanic and continental lithosphere called terranes created the North Cascades about 50 million years ago.\nDuring the Pleistocene period dating back over two million years ago, glaciation advancing and retreating repeatedly scoured and shaped the landscape. The U-shaped cross section of the river valleys is a result of that recent glaciation. Uplift and faulting in combination with glaciation have been the dominant processes which have created the tall peaks and deep valleys of the Cascades.\nSee also\n*\n* Geology of the Pacific Northwest\nGallery\nFile:View of Mt. Fernow from trail to Surprise Lake.jpg|Mt. Fernow in winter\nFile:Fernow and Glacier Pk from Otter Point.jpg|Mt. Fernow and Glacier Peak from Otter Point\nFile:Fernow from Beckler.jpg|Fernow seen from Beckler Peak area\nReferences\nExternal links\n* Weather forecast: [https://www.yr.no/en/forecast/daily-table/2-5794280/United%20States/Washington/King/Mount%20Fernow Mt. Fernow]\n*[http://www.fs.usda.gov/r06/mbs/recreation Wild Sky Wilderness (Mt. Baker-Snoqualmie National Forest)] U.S. Forest Service"
    }
  ]
}