{
  "content": [
    {
      "type": "text",
      "text": "# Mount Warlow\n\n| prominence_ft     = 526\n| prominence_ref    =\n| isolation_mi      = 0.68\n| isolation_ref     =\n| parent_peak       = Mount Fiske (13,503 ft)\n| etymology         = Chester H. Warlow\n| map               = California#USA\n| map_caption       = Location in California\n| map_size          = 250\n| label_position    = left\n| location          = Kings Canyon National ParkFresno CountyCalifornia, U.S.\n| range             = Sierra Nevada\n| coordinates       =\n| coordinates_ref   =\n| topo              = USGS Mount Darwin\n| rock              = granite\n| age               =\n| first_ascent      = 1926\n| easiest_route     =  South Ridge\n}}\nMount Warlow is a  mountain summit located  west of the crest of the Sierra Nevada mountain range, in Fresno County of northern California, United States. It is situated on the Goddard Divide in northern Kings Canyon National Park,  north of Muir Pass,  southeast of Mount Huxley, and  southwest of Mount Fiske, which is the nearest higher neighbor. Mount Warlow ranks as the 108th highest summit in California. The approach to this remote peak is made via the John Muir Trail.\nHistory\nThe mountain is named after Chester H. Warlow (1889–1963), attorney, Fresno civic leader, and conservationist, who was instrumental in the creation of Kings Canyon National Park. Each year from 1913 through 1930 he used his 30-day vacations to visit the High Sierras between Yosemite and Mount Whitney. He was California Highway Commissioner from 1943 through 1961, and also has a highway rest area near Kingsburg named after him. The mountain's name was officially adopted in 1969 by the United States Board on Geographic Names. The first ascent of the summit was made in 1926 by Nathaniel Goodrich and Marjory Hurd.\nClimate\nAccording to the Köppen climate classification system, Mount Warlow is located in an alpine climate zone. Most weather fronts originate in the Pacific Ocean, and travel east toward the Sierra Nevada mountains. As fronts approach, they are forced upward by the peaks, causing them to drop their moisture in the form of rain or snowfall onto the range (orographic lift). This climate until recently supported the Mount Warlow Glacier in the northwest cirque. Precipitation runoff from this mountain drains southeast into headwaters of the Middle Fork Kings River, or northwest into Evolution Creek which is a San Joaquin River tributary.\nGallery\nFile:Mt. Warlow from Helen Lake.jpg|Mt. Warlow from Helen Lake\nFile:Warlow Fiske Helen Lake.jpg|Mt. Warlow (left) and Mt. Fiske (right) seen from Helen Lake\nSee also\n* List of the major 4000-meter summits of California\nReferences\nExternal links\n* Weather forecast: [https://www.yr.no/en/forecast/daily-table/2-5407154/United%20States/California/Fresno/Mount%20Warlow Mount Warlow]\n* Aerial photo of east aspect: [https://www.flickr.com/photos/timlawnicki/26581246134/in/photolist-GuTQp9-UCQGvN-e1gFxc-mZV7A-5e4PBS-ei5v5p-eica9f-eic2nw-b6wTRg-2cU4HVZ-2jBVAJ3-fBNWYc-NiiS5u-u6V5Cr-b7LE26-bG5R5H-Tgyidk-D7vFnu-2jX8r1B-FsokhX-oTXm6m-2jKncJr-zXceYY-bFLCpD-cRHAU9-P1oje5-qt7Wzb-pT7bDw-NjxdWr-cYbAsW-daUfm-NihYYw-cMTd3J-9MnbvF-tiQctN-2iiZ99R-A7kFM7-7WZTKY-A7kBxW-w9QyDN-AH1C4m-zNh9dq-ei73Wn-ymf4Ni-S61yEy-fQmSo5-2gEP3s-8yHKj5-L5NJqp-k5ZVCz Flickr]"
    }
  ]
}