{
  "content": [
    {
      "type": "text",
      "text": "# Movement for the Republic – Patriotic Camp\n\n| native_name      =\n| abbreviation     = RdR–OP\n| colorcode        = #BD0934\n| split            = Movement for the Republic\n| successor        = Social Movement AWS\n| logo             =\n| founder          = Romuald Szeremietiew\n| ideology         = ConservatismEconomic liberalismPro-EuropeanismAtlanticism}}\n| foundation       = December 1993\n| dissolved        = December 1997\n| country          = Poland\n| colours          =  White Red\n| national         = Patriotic Camp (1996)Solidarity Electoral Action (1996–1997)\n}}\nThe Movement for the Republic – Patriotic Camp (, RdR–OP) was a political party in Poland. It was a party that split from the Movement for the Republic (RdR), with the split being caused by differences of opinion in regards to the party's position and possible cooperation with the President Lech Wałęsa. The RdR–OP was led by Romuald Szeremietiew who supported cooperation with the President, and was narrowly elected the leader of RdR in 1993. However, the party leadership annulled the results of the election, and elected Olszewski in the name of Szeremietiew, prompting the split. The party was a right-leaning movement and was strongly supportive of not only the President Lech Wałęsa, but also the efforts to form a united centre-right front against the post-communist left in Poland.\nThe party participated in numerous coalitions and alliances with centrist and centre-right groupings. In 1994, it became a co-founder of a centre-right coalition Covenant for Poland (). Initially named \"Szeremietew's RdR\", the party also joined a federation of parties known as the Patriotic Camp () in 1996, and renamed itself Movement for the Republic – Patriotic Camp. In 1997, the party intensively participated in talks regarding a formation of a new coalition that would unite the Polish anti-communist and centre-right organisations. The project proved successful and became known as Solidarity Electoral Action (AWS). In December 1997, the RdR–OP dissolved to join the Social Movement, which became a political party uniting independents and minor parties that participated in AWS.\nHistory\nIn December 1992, the Movement for the Republic (RdR) was founded by former prime minister Jan Olszewski and his supporters, protesting the downfall of Olszewski's cabinet and his abandonment by their erstwhile party, the centrist Centre Agreement. A year after the formation of Movement for the Republic, a national congress of the RdR was held on 12 December 1993, where Romuald Szeremietiew spoke against Olszewski and postulated closer ties with centrist and centre-right, to which Olszewski was sceptical.\nIn the elections for party chairman, Szeremietiew defeated Olszewski by a ratio of 106 votes to 100. Dissatisfied supporters of the former prime minister called a congress of the RDC in March 1994, at which they annulled the decisions of the previous one and elected Stanisław Węgłowski as the new chairman. Olszewski, who aspired to the role of leader of the entire right, preferred to remain non-partisan, was entrusted with the position of honorary chairman of the Movement. These decisions we not recognised by Szeremietiew, which sparked months of compromising disputes over the right to use the name RdR.\nSzeremietiew then split from the Movement for the Republic (RdR), and founded Movement for the Republic – Patriotic Camp together with RdR members who sought to cooperate with the incumbent President, Lech Wałęsa. Until 3 February 1996, the party operated under the name \"Movement for the Republic\" (), the same name as the party they split from, though in that period, it was commonly known as \"Szeremietiew's RdR\" ().\nIn January 1994, it took part in many attempts at coalescing the \"center-right\" in Poland, mainly with the Centre Agreement (PC), Christian National Union (ZChN), Peasants' Agreement (PSL-PL) and  (KK), which resulted in the founding of the  (PdP). The party supported Lech Wałęsa in the 1995 Polish presidential election. In 1996, the party became part of the  - a political party with a \"federative\" structure.\nHowever, the Covenant for Poland, co-founded by the RdR–OP, began to disintegrate in autumn 1994. This was influenced both by the conflict between Kaczyński and Szeremietiew (among other things, over the direction of the PdP's expansion), and by the battles within ZChN between the President's opponents and a strong pro-President faction. Disputes within the coalition intensified when, in October 1994, the ZChN Wiesław Chrzanowski resigned from the post of party president, justifying it with his age. The chairman's duties were taken over by 31-year-old Ryszard Czarnecki, whose mandate was formally confirmed at the Fourth ZChN Congress in March 1995. However, the election of the moderate Czarnecki further accelerated the dissolution of the PdP.\nBefore the collapse of the Covenant of Poland, it managed to conclude a cooperation agreement with the 11 November Agreement () in January 1995, under which the joint programme principles were developed. While the Covenant of Poland became a dysfunctional coalition that was unable to cooperate, the 11 November Agreement gave way to further alliances between various centre-right parties.\nIn 1996, the approaching prospect of parliamentary elections and the lack of real chances for individual groupings to gain power in the next election spurred cooperation between centre-right parties, and the Solidarity trade union became involved in coordinating and forming a united centre-right front. Starting on 8 June 1996, Szeremietiew took part in the creation of the Solidarity Electoral Action. By 1997, RdR–OP dissolved as it became part of the Social Movement AWS.\nElectoral results\nPresidential\n{| class=wikitable\n|-\n! rowspan=2|Election year\n! rowspan=2|Candidate\n! colspan=2|1st round\n! colspan=2|2nd round\n|-\n! # of overall votes\n! % of overall vote\n! # of overall votes\n! % of overall vote\n|-\n! 1995\n| Supported Lech Wałęsa\n| 5,917,328\n| 33.11 (#2)\n| 9,058,176\n| 48.28 (#2)\n|-\n|}\nIdeology\nThe Movement for the Republic – Patriotic Camp was considered a centre-right and a right-wing grouping. The party claimed to base its ideology on Catholic social teaching as well as the preceding RdR and PPN.), a minor communist-era opposition group.}} It believed in restructuring the separation of powers, to include foreign policy and management of local governments within the reach of the Senate, while removing its legislative powers.\nEconomically, it supported free market economics, private ownership, privatization, reprivatization and integration with the European Union. The party considered it necessary for a development of a \"proper free market economy\" to carry out reprivatization, as well as deepening economic and military cooperation with Western organisations. The party also spoke out in favour of Poland's membership in NATO, along with maintaining friendly relations with Lithuania, Ukraine and Belarus.\nIt called for granting adults the right to own firearms and allowing for their use for self-defence on one's property. The party also postulated the introduction of compulsory 'general territorial defense' training, which would include all male citizens aged 18 to 55. The party's leader, Romuald Szeremietiew, was known for its hawkish rhetoric, advocating for compulsory military service and the territorial defence training, which became his trademark proposal. According to Szeremietiew and his party, the Polish military was to be composed of 100,000 soldiers, and the territorial defence of at least 120,000 active cadets.\nAs its main political objective, the RdR–OP aimed to unite conservative forces, which manifested itself in participation in many unsuccessful merger attempts and internal disputes, including with Akcja Polska represented by Antoni Macierewicz. In June 1994, the party signed the Memorandum for the Covenant for Poland, together with numerous centre-right and centrist parties. In 1996, it then co-founded the Solidarity Electoral Action, being one of the most active participants in the unification talks with other right-leaning parties.\nSee also\n*Movement for the Republic\n*Christian National Union\n*Coalition for the Republic\n*Confederation of Independent Poland\n*Movement for Reconstruction of Poland\nReferences\nNotes"
    }
  ]
}