{
  "content": [
    {
      "type": "text",
      "text": "# Movement for the Restoration of the Kingdom of Serbia\n\n| logo             = Movement for the Restoration of the Kingdom of Serbia logo.svg\n| logo_size        = 140px\n| president        = Vojislav Mihailović\n| founder          = Žika Gojković\n| split            = Serbian Renewal Movement\n| founded          =\n| headquarters     = Savski trg 9, Belgrade\n| ideology         =\n| position         = Right-wing\n| colours          =  Blue\n| affiliation1_title = Parliamentary group\n| affiliation1     = National Democratic Alternative\n| seats1_title     = National Assembly\n| seats1           = }}\n| seats2_title     = Assembly of Vojvodina\n| seats2           = }}\n| seats3_title     = City Assembly of Belgrade\n| seats3           = }}\n| website          =\n| country          = Serbia\n}}\nThe Movement for the Restoration of the Kingdom of Serbia (,  POKS) is a monarchist and national-conservative political party in Serbia. It was founded in 2017 after a split within the Serbian Renewal Movement (SPO).\nIn December 2021, the POKS split into two rival groups, respectively led by party founder Žika Gojković and former Belgrade mayor Vojislav Mihailović. Each group claimed to be the legitimate representative of the party. The Ministry of State Administration and Local Self-Government concluded in July 2022 that Mihailović represents the legitimate president of the party.\nHistory\nThe Movement for the Restoration of the Kingdom of Serbia was formed on 3 June 2017, shortly after Gojković and others were expelled from the SPO after recommending that party leader Vuk Drašković step down from his position to become an honorary president. The new party was registered on 17 July 2017, and Gojković was chosen as its leader on 15 October 2017.\nPrior to the split, Gojković was one of three SPO members serving in the national assembly. All three had been elected in the 2016 Serbian parliamentary election on an electoral list led by the Serbian Progressive Party (Srpska napredna stranka, SNS), and all served in caucus with the Progressives. Gojković remained a member of the Progressive caucus after leaving the SPO and, on becoming POKS leader, noted the party's good relations with the SNS and with Serbian president Aleksandar Vučić.\nOn 12 October 2017, the Christian Democratic Party of Serbia (Demohrišćanska stranka Srbije; DHSS) merged into the POKS. President of the DHSS Olgica Batić stated full support for the Movement's primary goals - traditional values, preserving the family, the fight for Serbian farmers and the full membership of Serbia in the European Union.\nThe POKS briefly gained a second assembly member in May 2018, when independent delegate Nada Kostić, who had been elected on the Enough Is Enough list, joined the party. Shortly thereafter, she left the POKS to once again sit as an independent member.\nThe POKS contested the 2020 Serbian parliamentary election in an alliance called For the Kingdom of Serbia with smaller groups including the Monarchist Front and the Movement of Serbian Monarchists. Gojković was the list bearer, although he agreed to have Ljubinko Đurković appear ahead of him in the first position. The list narrowly missed the electoral threshold to win representation in the assembly.\nWhen the POKS was established in 2017, all three SPO members in the Assembly of Vojvodina joined the new party. The POKS subsequently won five seats in the 2020 Vojvodina provincial election. Its leader in the provincial assembly is Goran Ivančević.\nOn 26 January 2021, POKS and the Democratic Party of Serbia (DSS) signed an agreement on joint action and agreed on a joint political-program platform called the National Democratic Alternative. In early May, the National Democratic Alternative was formalised as a pre-electoral coalition.\nDecember 2021 split\nOn 23 December 2021, it was reported that the POKS presidency had met to remove Gojković from the office of president, on the grounds that his four-year term had expired in October. It was further reported that the presidency had dissolved the Belgrade board of the party for \"inactivity\" and instead appointed Vojislav Mihailović as commissioner.\nSubsequently, POKS official Miloš Parandilović stated that the aforementioned meeting of the presidency had been illegitimately convened by a group of party officials seeking to carry out a coup. Parandilović said that, according to the party's constitution, meetings of the presidency can only be convened by the president or vice-president, rather than what he described as \"a private group that deceives the public and makes decisions that are legally and morally invalid.\"\nOn 28 December, the group centred around Mihailović announced that Gojković and his leading ally Mirko Čikiriz had been expelled from the party. Gojković's allies rejected this. Gojković's group also stated that Serbia's ministry of public administration and local self-government had issued a certificate on 27 December identifying Gojković as the only legitimate representative of the party.\nBoth groups called election assemblies for early January 2022. The group centred around Gojković convened a meeting in Topola on 2 January, at which time Gojković was confirmed as party leader. The rival group convened a meeting in Belgrade the following day and elected Mihailović as leader. Both groups contended that the other was illegitimate.\nOn 15 January 2022, Gojković's branch of the POKS announced that its alliance with the DSS had ended on the grounds of the latter party siding with Mihailović's group. Mihailović's branch of the party affirmed its alliance with the DSS later in the same day.\nGojković announced in February 2022 that his POKS group would contest the upcoming presidential, parliamentary, and Belgrade elections with Dveri.\nPolitical positions\nPOKS is a right-wing party, and advocates monarchism. It has been also described as national-conservative, and conservative. Regarding the European Union, it is eurosceptic.\nIt is generally further to the right than the SPO on issues of cultural identity. When the POKS was formed, founding member and former parliamentarian Mirko Čikiriz accused SPO leader Vuk Drašković of singling out crimes by Serb forces during the Yugoslav Wars of the 1990s and ignoring the crimes of other sides. In the 2020 provincial election, Goran Ivančević described migrant refugees in Serbia as a \"security threat\" and said that the country should close its borders to refugees, including those whom he described as \"jihadists.\"\nList of presidents of POKS\n{| class=\"wikitable\" style=\"text-align:center\"\n!#\n! colspan=\"2\" |President\n!Born–died\n!Term start\n!Term end\n|-\n! style=\"background:; color:white;\" |1\n|Žika Gojković\n|\n|1972–\n|15 October 2017\n|3 January 2022\n|-\n! style=\"background:; color:white;\" |2\n|Vojislav Mihailović\n|\n|1951–\n|3 January 2022\n|Present\n|}\nElectoral performance\nParliamentary elections\n{| class=\"wikitable\" style=\"text-align:center\"\n|+ National Assembly of Serbia\n! Year\n! Leader\n! Popular vote\n! % of popular vote\n!\n! # of seats\n! Seat change\n! Coalition\n! Status\n|-\n! 2020\n| Žika Gojković\n| 85,888\n| 2.77%\n|  4th\n| }}\n|  1\n| ZKS\n|\n|-\n! 2022\n| rowspan=\"2\"| Vojislav Mihailović\n| 204,444\n| 5.54%\n|  4th\n| }}\n|  7\n| NADA\n|\n|-\n! 2023\n| 191,431\n| 5.16%\n|  4th\n| }}\n|  1\n| NADA\n|\n|}\nImageSize  = width:600 height:70\nPlotArea   = width:500  height:50 left:20 bottom:20\nDateFormat = dd/mm/yyyy\nPeriod     = from:01/01/2017 till:31/12/2024\nTimeAxis   = orientation:horizontal\nScaleMajor = unit:year increment:1 start:01/01/2017\nLegend     = columns:3 left:40 top:75 columnwidth:90\nColors =\nid:Opposition  value:red    legend:Opposition\nid:Support     value:yellow legend:Support\nDefine $dx = 25\nDefine $dy = -1\nPlotData=\nbar:Govern. color:blue width:25 mark:(line,black) align:center\nfrom:03/06/2017  till:14/03/2020 shift:($dx,$dy)    color:Support\nfrom:14/03/2020  till:end        shift:($dx,$dy)    color:Opposition\nPresidential elections\n{| class=\"wikitable\" style=\"text-align:center\"\n|+ President of Serbia\n! Year\n! Candidate\n! colspan=\"2\" | 1st round popular vote\n! % of popular vote\n! colspan=\"2\" | 2nd round popular vote\n! % of popular vote\n! Notes\n|-\n! 2022\n| Miloš Jovanović\n|\n| 226,137\n| 6.10%\n|\n| —\n| —\n| Supported Jovanović\n|}\nProvincial elections\n{| class=\"wikitable\" style=\"text-align:center\"\n|+ Assembly of Vojvodina\n! Year\n! Leader\n! Popular vote\n! % of popular vote\n!\n! # of seats\n! Seat change\n! Coalition\n! Status\n|-\n! 2020\n| Žika Gojković\n| 34,083\n| 4.21%\n|  6th\n| }}\n|  5\n| ZKS\n|\n|-\n! 2023\n| Vojislav Mihailović\n| 50,582\n| 5.30%\n|  4th\n| }}\n|  2\n| NADA\n|\n|}\nImageSize  = width:600 height:70\nPlotArea   = width:500  height:50 left:20 bottom:20\nDateFormat = dd/mm/yyyy\nPeriod     = from:01/01/2017 till:31/12/2024\nTimeAxis   = orientation:horizontal\nScaleMajor = unit:year increment:1 start:01/01/2017\nLegend     = columns:3 left:40 top:75 columnwidth:90\nColors =\nid:Opposition  value:red    legend:Opposition\nid:Support     value:yellow legend:Support\nDefine $dx = 25\nDefine $dy = -1\nPlotData=\nbar:Govern. color:blue width:25 mark:(line,black) align:center\nfrom:03/06/2017  till:21/06/2020 shift:($dx,$dy)    color:Support\nfrom:21/06/2020  till:end        shift:($dx,$dy)    color:Opposition\nBelgrade City Assembly elections\n{| class=\"wikitable\" style=\"text-align:center\"\n|+ City Assembly of Belgrade\n! Year\n! Leader\n! Popular vote\n! % of popular vote\n!\n! # of seats\n! Seat change\n! Coalition\n! Status\n|-\n! 2018\n| Žika Gojković\n| 4,291\n| 0.53%\n|  12th\n| }}\n|  0\n| –\n|\n|-\n! 2022\n| rowspan=\"3\"| Vojislav Mihailović\n| 57,760\n| 6.44%\n|  5th\n| }}\n|  3\n| NADA\n|\n|-\n! 2023\n| 56,415\n| 6.13%\n|  3rd\n| }}\n|  3\n| NADA\n|\n|-\n! 2024\n| colspan=\"3\" style=\"background:#ddd\" | Election boycott\n| }}\n|  3\n| NADA\n|\n|}\nImageSize  = width:600 height:70\nPlotArea   = width:500  height:50 left:20 bottom:20\nDateFormat = dd/mm/yyyy\nPeriod     = from:01/01/2017 till:31/12/2024\nTimeAxis   = orientation:horizontal\nScaleMajor = unit:year increment:1 start:01/01/2017\nLegend     = columns:3 left:40 top:75 columnwidth:90\nColors =\nid:Opposition  value:red    legend:Opposition\nid:Support     value:yellow legend:Support\nDefine $dx = 25\nDefine $dy = -1\nPlotData=\nbar:Govern. color:blue width:25 mark:(line,black) align:center\nfrom:03/06/2017  till:21/06/2020 shift:($dx,$dy)    color:Support\nfrom:21/06/2020  till:end        shift:($dx,$dy)    color:Opposition\nReferences"
    }
  ]
}