{
  "content": [
    {
      "type": "text",
      "text": "# Mr. President (musical)\n\nMr. President is a musical with a book by Howard Lindsay and Russel Crouse and music and lyrics by Irving Berlin.  The story focuses on fictional US President Stephen Decatur Henderson, who runs into political trouble following a disastrous trip to the Soviet Union, and his problems with his children. Bored with life as a civilian after his presidency ends, he decides to return to political life.\nThe original 1962 Broadway production ran for 265 performances and starred Robert Ryan and Nanette Fabray. The show received a generally unenthusiastic response and was Irving Berlin's last musical.\nSynopsis\nPresident Stephen Decatur Henderson is a true patriot and loves his family.  His daughter Leslie has recently had a series of romantic liaisons, some liberal and some conservative.  Her newest romance is with Youssein Davair, the son of a Middle Eastern ruler; the sincerity of his affection is questionable.  Pat Gregory, a Secret Service agent, has watched Leslie grow up and has fallen in love with her but doesn't believe that she could be interested in a simple guy like him. With the Cold War as a backdrop, Henderson, together with Nell, his First Lady, and their children go on a \"good-will tour\" of Europe, including the Soviet Union. Henderson gets in trouble for jokingly comparing the Soviet leader to a \"wild cat\". But the President lands in Moscow anyhow and gives a conciliatory and humanizing speech, assisted by his Russian-speaking son Larry, that earns the respect of the Soviets. Nevertheless, back at home, the gaffe plagues him and hurts his party's popularity. Larry is a bit of a hot-head and punches the party chairman on TV to defend his father. The presidential term of office ends, and the Hendersons leave the White House.\nIn Act II, Henderson finds his post-politics life in Ohio mundane.  The family is invited to a party at the White House, and there Leslie finds that Youssein is now interested in Betty Chandler, the daughter of the new president, and so they break up. Leslie leaves the party with Pat. Meanwhile, one of Ohio's senators dies, and the governor asks Henderson to finish his term of office. Henderson yearns to return to public life, but he questions the governor's motives and declines the job. Soon afterwards, however, another opportunity comes: the new president asks Henderson to attend an international summit meeting on behalf of the US, because of the respect that he commands in the Soviet Union.\nOriginal cast and characters\n{| class=\"wikitable\" style=\"width:50%; text-align:center\"\n!scope=\"col\"|Character\n!Broadway (1962)\n|-\n!President Stephen Decatur Henderson\n| colspan=\"1\" |Robert Ryan\n|-\n!First Lady Nell Henderson\n| colspan=\"1\" |Nanette Fabray\n|-\n!Leslie Henderson  (First Daughter)\n| colspan=\"1\" |Anita Gillette\n|-\n!Harmon Bardahl / Manager; Governor\n| colspan=\"1\" |David Brooks\n|-\n!Youssein Davair (Son of a Middle Eastern ruler)\n| colspan=\"1\" |Jack Washburn\n|-\n!Pat Gregory (of the Secret Service)\n| colspan=\"1\" |Jack Haskell\n|-\n!Charley Wayne (of the Secret Service)\n| colspan=\"1\" |Stanley Grover\n|-\n!Larry Henderson (First Son)\n| colspan=\"1\" |Jerry Stickler\n|-\n!Betty Chandler (new First Daughter)\n| colspan=\"1\" |Carol Lee Jensen\n|-\n!Tippy Taylor (a secretary)\n| colspan=\"1\" |Charlotte Fairchild\n|-\n!Princess Kyra\n| colspan=\"1\" |Wisa D'Orso\n|-\n!Chester Kincaid\n| colspan=\"1\" |John Cecil Holm\n|-\n!Deborah Chakronin (East Indian Marching Team Leader)\n| colspan=\"1\" |Baayork Lee\n|}\nMusical numbers\n;Act I\n* Let's Go Back to the Waltz – Nell and Ensemble\n* In Our Hide-Away – Nell and Steve\n* The First Lady – Nell\n* Meat and Potatoes – Pat and Charley\n* I've Got to Be Around – Pat\n* The Secret Service – Leslie\n* It Gets Lonely in the White House – Steve\n* Is He the Only Man in the World? – Nell and Leslie\n* They Love Me – Nell\n* Pigtails and Freckles – Pat and Leslie\n* Don't Be Afraid of Romance – Youssein\n* Laugh It Up – Nell, Steve, Leslie and Larry\n* Empty Pockets Filled with Love – Pat and Leslie\n* In Our Hide-Away (reprise) – Nell and Steve\n;Act II\n* Glad to Be Home – Nell and Ensemble\n* Laugh It Up (reprise) – Nell and Steve\n* You Need a Hobby – Nell and Steve\n* Don't Be Afraid of Romance (reprise) – Youssein\n* The Washington Twist – Leslie and Dancers\n* Pigtails and Freckles (reprise) – Pat\n* The Only Dance I Know – Princess Kyra\n* Meat and Potatoes (reprise) – Pat\n* Is He the Only Man in the World? (reprise) – Leslie\n* I'm Gonna Get Him – Nell and Leslie\n* This Is a Great Country – Steve\n* Finale – Company\nProductions\nThe musical had its first out-of-town tryout in Boston beginning on August 27, 1962, and was coolly received. After extensive cuts and revisions, it was given another tryout at the National Theatre in Washington, DC, on September 25, 1962, which was attended by President John F. Kennedy and First Lady Jacqueline Kennedy. The first couple congratulated Berlin on a hit. Kennedy later sent his aides, Kenneth P. O'Donnell and David Powers, to apologize to Berlin for his having to leave the performance early. This day of Kennedy's presidency is the one featured in an exhibit at the JFK Museum and Library. The Washington reviews \"were lukewarm and even negative. The word 'corny' stuck, and was repeated again and again.\"\nAfter four previews, the Broadway production, directed by Joshua Logan and choreographed by Peter Gennaro, opened on October 20, 1962, at the St. James Theatre, where it ran for 265 performances. The cast included Robert Ryan, Nanette Fabray, David Brooks, Jack Haskell, Anita Gillette, John Cecil Holm and Baayork Lee. The musical premiered in a Broadway season dominated by hits like Oliver!, A Funny Thing Happened on the Way to the Forum and Stop the World – I Want to Get Off. Mr. President received unenthusiastic reviews. Although Berlin's score was praised, the show \"was just too old-fashioned and out of date.\" Berlin continued to work, revising Annie Get Your Gun and writing songs, such as for the film project Say It With Music (which was never produced), but \"Broadway would never again see a truly Berlin work on the stage\". Mr. President was the final Lindsay and Crouse collaboration.\nIn 1964, former President Harry S. Truman made an opening night cameo appearance in a production of the show at the Starlight Theatre in Kansas City. He left by ambulance at intermission due to an appendicitis attack.\nGerard Alessandrini extensively revised the book and converted the plot into a spoof of the 2000 Presidential election debacle. After thirty previews, it opened on August 2, 2001, at the Off-Broadway Douglas Fairbanks Theater where, hampered by reviews worse than those received by the original, it closed after only ten performances. Ben Brantley, in his review for The New York Times, wrote that the musical \"feels tired\". However, the TheaterMania reviewers noted that, while \"the overall tenor of the satire here is soft,\" it has \"surprisingly buoyant appeal. It remains bubbly and effervescent thanks to the peppy, imaginative direction supplied by the team of John Znidarsic and Alessandrini.\"\nAwards and nominations\nOriginal Broadway production\n{| class=\"wikitable\" width=\"95%\"\n|-\n! width=\"5%\"| Year\n! width=\"20%\"| Award\n! width=\"45%\"| Category\n! width=\"20%\"| Nominee\n! width=\"10%\"| Result\n|-\n| rowspan=\"3\" align=\"center\"| 1963\n| rowspan=\"3\"| Tony Award\n| Best Performance by a Leading Actress in a Musical\n| Nanette Fabray\n|\n|-\n| Best Conductor and Musical Director\n| Jay Blackton\n|\n|-\n| Best Stage Technician\n| Solly Pernick\n|\n|}\nReferences\nExternal links\n*"
    }
  ]
}