{
  "content": [
    {
      "type": "text",
      "text": "# Mr. President (radio series)\n\n-->\n| podcast       =\n}}\nMr. President was a radio series that ran on the ABC Network from June 26, 1947, to September 23, 1953.\nFormat\nEach half-hour episode was based on an incident in the life of one of the people who have held the office of President of the United States, but the dialogs were written in such a way as not to reveal the name of the President until the last line of dialog at the end of the program, when the President would be addressed by name. An advertisement for the program noted, \"Each week the suspense mounts from his first question, 'Which one of our 32 Presidents am I?'\" The audience was thus encouraged to guess, from the plot of the episode, which President it was.\nPersonnel\nThe series was created by Robert G. Jennings and written by a team that included Jean Holloway, Bernard Dougall and Ira Marion. A research staff made certain that the stories were accurate. It was produced and directed by Dick Woolen.\nThe President each week was played by Edward Arnold, with supporting performances by Bea Benaderet, Gil Stratton, Hans Conried, Lurene Tuttle, Nina Bara and Herb Butterfield. The announcer was Owen James.\nAward\nIn 1953, Mr. President received the Award of Merit from the Veterans of Foreign Wars organization.\nReferences\nDescription\n* [http://www.radioarchives.org/sets/PC37.htm Description of the program on Premier Collections site]\nLogs\n* [http://www.digitaldeliftp.com/DigitalDeliToo/dd2jb-Mr-President.html Program log (and more) from The Digital Deli Too]\n* [http://www.otrr.org/FILES/Logs_txt/Mr%20President.txt Program log from Old Time Radio Researchers Group]\n* [https://radiogoldin.library.umkc.edu/Home/RadioGoldin_Records?searchString=Mr.%20President&type=Programs Program log from RadioGOLDINdex]\nStreaming audio\n* [https://archive.org/details/Mister_President Episodes for streaming or download from the Internet Archive]\n* [http://otrrlibrary.org/OTRRLib/Library%20Files/M%20Series/Mr%20President/ Episodes for streaming or download from Old Time Radio Researchers Group Library]"
    }
  ]
}