{
  "content": [
    {
      "type": "text",
      "text": "# Mrauk U invasion of Chittagong\n\n| image_size        =\n| caption           = Mrauk U Kingdom at peak\n| date              = 1530–1666\n| place             = Chittagong and northern Arakan\n| territory         = Mrauk U seizes Chittagong into its territory\n| result            = Arakanese victory\n| combatant1        = Kingdom of Mrauk U Kingdom of Portugal\n| combatant2        = Bengal Sultanate\n| commander1        =  Ba Saw Phyu Min Bin Min Phalaung\n| commander2        = Rukunuddin Barbak ShahGhiyasuddin Mahmud Shah\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n| notes             =\n| casus             =\n| mage2             =\n}}\nChittagong came under Arakanese control during the 16th and 17th centuries. Early Arakanese chronicles suggest claims to the region as far back as the mid-15th century under King Ba Saw Phyu (1459–1482). A 1542 Buddhist inscription, confirms Arakanese control by the 1540s under King Min Bin (1531–1553), who fortified Chittagong as a strategic base for trade and military campaigns. Arakanese dominance fluctuated due to conflicts with Bengal, Tripura, and the Mughals, but alliances with Portuguese mercenaries and naval strength helped sustain to their rule.\nThe Mrauk U kingdom's control peaked between the late 16th and mid-17th centuries. Chittagong became a hub for regional trade, though its governance was marred by piracy, slave raids, and clashes with neighboring powers. From approximately 1580 to 1666 CE, a period spanning nearly a century, Chittagong was under almost uninterrupted Arakanese rule. This era is notable for its significant historical developments. During this time, eight successive sovereigns ruled over Arakan, Chittagong, and the Chittagong Hill Tracts with absolute authority. These monarchs varied widely in character and capability. The Portuguese supported Arakanese naval forces, even the famous Bengali poet Alaol was enslaved during this period who later gained prominence in the Arakanese court. Mughal attempts to seize Chittagong in 1617 and 1621 failed, but tensions escalated after 1660 when Arakan's king betrayed and executed Mughal prince Shah Shuja, who had fled there seeking refuge. This triggered Emperor Aurangzeb’s decisive campaign under general Shaista Khan, culminating in Chittagong's annexation by the Mughal Empire in 1666.\nBackground\nMuch of what is known about the conquest of Chittagong comes from the Bengal History writings, Arakanese chronicles, later Burmese and colonial writings, as well as numismatic (coin) and epigraphic evidence. The struggle for control of Chittagong was part of a larger, nearly century-long contest between the Bengal Sultanate, Mughals and Arakan. Control of the region shifted through raids, temporary occupations, and alliances, with Portuguese mercenaries playing a critical role.\nLocal inhabitants were often enslaved and sold, while piracy and plundering became everyday occurrences.\nConquest\nAccording to the Bengal written History of Chittagong, as well as Arakanese records, the conquest of Chittagong is mainly credited to three Arakanese kings. They are listed below:\nBa Saw Phyu\nTaking advantage of the turmoil at Sultan Rukunuddin Barbak Shah's court, Ba Saw Phyu seized Chittagong. Following this victory, Ba Saw Phyu issued a coin inscribed with the kalima in Persian script as a symbol of his sovereignty over Chittagong.\nMin Bin\nAccording to Arakanese Chronicles, Min Bin seized Chittagong during Sher Shah Suri’s overthrow of Bengal's Sultanate. With Bengal's forces diverted, Min Bin's troops, supported by Portuguese warships reportedly overwhelmed the port's garrison. Historian Suniti Bhushan Qanungo suggests the local governor, likely a Hussain Shahi loyalist, fled or surrendered without significant resistance.\nThe most significant events of Min Bin's (also known as Man Pa) reign occurred several years before the Burmese invasions. Around 1539–1540, Min Bin successfully conquered Chittagong. A Buddhist votive inscription found in Chittagong and dated to 1542 confirms that Arakan controlled the region by that time. In the late 1530s, the Afghan warlord Sher Shah (d. 1545) defeated the last independent Sultan of Bengal, Ghiyath ud-Din Mahmud Shah (1533–1538). The Afghans, once the ruling class of the Lodi Sultanate, had been driven from Upper India to Bihar by the Mughal invasion. Sher Shah succeeded in conquering most of Bengal, but was unable to control its southeastern part. In Chittagong, a conflict arose between two local governors, Amirza Khan and Khuda Bakhsh Khan, who had been appointed by Ghiyath ud-Din Mahmud Shah. Min Bin likely took advantage of this conflict to intervene and seize control of Chittagong.\nThe reign of Minbin in Arakan began in 1531 and lasted for 22 years. It is estimated that from 1541 to 1553, Chittagong remained under Arakanese control. After the death of Min Bin in 1553, the Bengal ruler Shamsuddin Mohammad Shah Gazi launched an expedition towards Arakan in 1554. In this campaign, he captured Chittagong and extended his control as far south as Arakan's capital Mrauk U. However, as it was not possible to hold Mrauk U, he relinquished control of it and retained possession of Chittagong. During this time, Chittagong remained under the Bengal Sultan's rule for about two years until it was captured again by another Arakanese King.\nMin Phalaung\nIn 1581, the Arakanese king Min Phalaung (1571–93) defeated the Pathan ruler of Chittagong, Jamal Khan Panni, and took control of Chittagong. However, in 1585, the king of Tripura, Rajdhar Manikya I, took control of northern Chittagong, and his vassal Isha Khan of the Barbhuiya tribe briefly occupied the region. The area was named Ishapur in his honor. At that time, an Arakanese vassal, Adamsah from Ramu-Chakariya, fell out of favor with the Arakanese king and sought refuge with Manikya. When the Arakanese king demanded the return of Adamsah, Manikya refused. Angered by this, the Arakanese king sent two hundred thousand soldiers in 1586 to take northern Chittagong and looted Tripura’s capital, Udaypur. Humiliated by this defeat, Rajdhar Manikya's father committed suicide.\nThe turmoil from Sher Shah's revolution, the Mughal invasion, Portuguese aggression, and the Bengal revolt enabled the Arakanese to conquer Chittagong. King Sikandar Shah established control over Chittagong and parts of Noakhali and Tripura. His son Salim Shah (1593–1612) and grandson Husain Shah (1612–1622) continued his ambitions. These kings launched campaigns against Bengal, using both open war and secret support for rebels.\nChittagong under Arakanese Rule\nUntil 1666, Chittagong was under the control of the Arakanese kings. However, during this time, Portuguese pirates often harassed the local people. The Arakan king took action against the Portuguese and managed to control them in 1603 and again in 1607. In 1607, a French traveler named De Laval visited Chittagong. Around the same time, a Portuguese pirate named Gonzales took control of Sandwip.\nBetween 1630 and 1634, a Portuguese missionary named Pastor Manrique visited Chittagong.\nThe Arakanese period left a lasting influence in Chittagong. Some practices, such as using the \"Moghi Kani\" system for land measurement, are still found in the region. The \"Moghi Year\" calendar was also commonly used for many years.\nWell-known Bengali poets like Alaol, Daulat Kazi, and Qureshi Magan Thakur received patronage from the Arakanese kings. One of Alaol's most famous works, Padmavati, was written during this period.\nThe Arakanese also maintained business relations with the Dutch, particularly through the Dutch East India Company (VOC). Historians have documented the brutal activities of both the Portuguese pirates and the Arakanese during this period.\nBoth the Arakanese and Portuguese regularly raided the Bengal region, from Dhaka to Chittagong. During these raids, they captured both Hindus and Muslims. The captives were tortured their palms were pierced, thin cane strips were threaded through the holes, and they were tied together and hung below the decks of ships. These captives were often sold to Dutch, English, and French traders at ports in the Deccan. In some cases, they were taken to Tamluk and Balasore, where they were sold at high prices.\nLegacy\nThe term Marma, used by the Maghs of the Chittagong Hill Tracts to identify themselves, is derived from Myamma (or Byamma), the national name of the Burmans, which is a vocal corruption of the written term Myanma.\nSeveral Burman terms also entered the local dialect of Chittagong. These include Phora (Lord Buddha), kyang (temple—referred to as kioum in 18th-century British documents), phungi (priest), and Rauli (clergy).\nThe Arakanese influence extends to dress, cuisine, and social customs. The lungi, a common male garment in Chittagong is thought to have been introduced from Arakan.\nDecline\nThe Mughal conquest ended Arakan's influence in Chittagong, integrating the region into the Bengal Subah of Hindustan.\nThe decline of Arakanese rule in Chittagong was largely triggered by the assassination of Mughal prince Shah Shuja in Arakan, which severely damaged relations between Arakan and the Mughal Empire.\nIn 1666, Subahdar Shaista Khan of Mughal, led a successful campaign to recapture Chittagong, bringing nearly a century of Arakanese rule to an end.\nSee also\n* History of Chittagong\n* Arakan\n* Mughal conquest of Bengal\nReferences"
    }
  ]
}