{
  "content": [
    {
      "type": "text",
      "text": "# Mrs Ratcliffe's Revolution\n\n| distributor    = Warner Bros. Pictures\n| released       =\n| runtime        = 102 minutes\n| language       = English\n| country        = United Kingdom\n| budget         =\n| gross          =\n}}\n'Mrs Ratcliffe's Revolution' is a 2007 British comedy drama film, directed by Bille Eltringham and starring Catherine Tate, Iain Glen and Brittany Ashworth, about a British family who move to East Germany in 1968, during the Cold War. It was filmed in Hungary and the United Kingdom (UK), and was released on 9 July 2007 at the Cambridge Film Festival, and nationwide in the UK on 28 September.\nPlot\nThis is a story about a leftist family in the UK who decide to emigrate to a communist country (East Germany), because they want to live in a country where everyone is equal and there is social and economic justice for all.\nFrank Ratcliff is the father / husband and an English teacher. Dorothy is the mother / wife. She is a housewife. They have 2 daughters. Alex is the older one, decadent, into painting and boys. Mary loves socialism and her father. Uncle Philip is Dorothy's brother. He lives with them, wants to be a photographer but was unemployed in Britain.\nVery soon after emigrating they feel so in love with their socialist new home that they renounce their British citizenship and burn their passports. As time passes they discover life in the GDR (German Democratic Republic) is not very democratic and the country is a republic in name only.\nThere are severe restrictions on anything from the West, whether it be ideas, music, dress, food, books etc. There is severe censorship on everything and people are punished severely for the slightest infringement of the socialist ideals as defined by the government of the GDR in 1968.\nFinally the family has had enough and they illegally escape by crossing the border to West Germany in a hot air balloon.\nCast\nReception\n, ''Mrs Ratcliffe's Revolution holds an 83% approval rating on Rotten Tomatoes, based on six reviews with an average rating of 5.6/10. Because of its limited release, there were few reviews, but Channel 4 Online and The Guardian Films'' cited the film as a vehicle for the blooming film careers of both Catherine Tate and Brittany Ashworth. The film won the Audience Award at the Wurzburg International Film Weekend.\nReferences\nExternal links\n* [https://web.archive.org/web/20071230214545/http://www.mrsratcliffesrevolutionmovie.co.uk/index.htm Official Site]\n*\n* [https://www.theguardian.com/uk/2006/sep/24/film.filmnews Guardian Review]\n*\n* [http://www.channel4.com/film/reviews/film.jsp?id=163008 Channel 4 Film Review]"
    }
  ]
}