{
  "content": [
    {
      "type": "text",
      "text": "# Muhammad Ali dynasty__disambig_1\n\nThe Muhammad Ali dynasty or the Alawiyya dynasty was the ruling dynasty of Egypt and Sudan from the 19th to the mid-20th century. It is named after its progenitor, Muhammad Ali, regarded as the founder of modern Egypt.\nIntroduction\nMuhammad Ali was an Albanian commander in the Ottoman Albanian army that was sent to drive Napoleon's forces out of Egypt. After Napoleon’s withdrawal, he aligned himself with Omar Makram, the leader of Egyptian resistance against the French, rose to power with his Albanian troops, and forced the Ottoman Sultan Selim III to recognise him as Wāli (Governor) of Egypt in 1805. Demonstrating his grander ambitions, he took the far higher title of Khedive, an honorific used by the Sultan himself. His sons and successors as Egypt's ruler, Ibrahim Pasha, Abbas I, and Sa'id Pasha, would all follow his example in using the title, however, this was not sanctioned by the Sublime Porte until the reign of his grandson Isma'il the Magnificent in 1867.\nHe was born in a village in Albania, Ottoman Empire, p. 1:\"the Pasha then embarked upon a monolog that lasted for more than half an hour in which he told his British visitor a story about his childhood in Albania.  and his father was Ibrahim Aga, an Albanian tobacco and shipping merchant who also served as an Ottoman commander of a small unit in the city of Kavala (present-day Greece).\nThrough his reforms, and military campaigns, Muhammad Ali transformed Egypt into a regional power which he saw as the natural successor to the decaying Ottoman Empire. He constructed a military state with around four percent of the populace serving the army to raise Egypt to a powerful positioning in the Ottoman Empire. Muhammad Ali summarised his vision for Egypt in this way:\nMuhammad Ali conquered Sudan in the first half of his reign, establishing the foundations of what would eventually become the modern Sudanese state. Egyptian control in Sudan would be consolidated and expanded under his successors, most notably Ibrahim Pasha's son, Isma'il the Magnificent.\nAt the height of his power, the military strength of Muhammad Ali and Ibrahim Pasha did indeed threaten the very existence of the Ottoman Empire, as he sought to supplant the Osman Dynasty with his own. Ultimately, however, the intervention of the Great Powers in the  Oriental Crisis of 1840 prevented Egyptian forces from marching on Constantinople, and compelled Muhammad Ali to reconcile himself with the Ottoman Sultan. Henceforth, with Egypt's eastern frontier fixed at the boundary between Sinai and Ottoman Palestine, his dynasty's territorial expansion would be restricted to Africa.\nKhedivate and British occupation\nThough Muhammad Ali and his descendants used the title of Khedive (Viceroy) in preference to the lesser Wāli, this was not recognized by the Porte until 1867 when Sultan Abdulaziz officially sanctioned its use by Isma'il Pasha and his successors. In contrast to his grandfather's policy of war against the Porte, Isma'il sought to strengthen the position of Egypt and Sudan and his dynasty using less confrontational means, and through a mixture of flattery and bribery, Isma'il secured official Ottoman recognition of Egypt and Sudan's virtual independence. This freedom was severely undermined in 1879 when the Sultan colluded with the Great Powers to depose Isma'il in favor of his son Tewfik. Three years later, Egypt and Sudan's freedom became little more than symbolic when the United Kingdom invaded and occupied the country, ostensibly to support Khedive Tewfik against his opponents in Ahmed Orabi's nationalist government. While the Khedive would continue to rule over Egypt and Sudan in name, in reality, ultimate power resided with the British High Commissioner.\nIn defiance of the Egyptians, the British proclaimed Sudan to be an Anglo-Egyptian Condominium, a territory under joint British and Egyptian rule rather than an integral part of Egypt. This was continually rejected by Egyptians, both in government and in the public at large, who insisted on the \"unity of the Nile Valley\", and would remain an issue of controversy and enmity between Egypt and Britain until Sudan's independence in 1956.\nSultanate and Kingdom\nKhedive Abbas II sided with the Ottoman Empire which had joined the Central Powers in the World War I, and was promptly deposed by the British in favor of his uncle Hussein Kamel. The legal fiction of Ottoman sovereignty over Egypt and Sudan, which had for all intents and purposes ended in 1805, was officially terminated, Hussein Kamel was declared Sultan of Egypt and Sudan, and the country became a British Protectorate. With nationalist sentiment rising, as evidenced by the revolution of 1919, Britain formally recognized Egyptian independence in 1922, and Hussein Kamel's successor, Sultan Fuad I, substituted the title of King for Sultan. However, British occupation and interference in Egyptian and Sudanese affairs persisted. Of particular concern to Egypt was Britain's continual efforts to divest Egypt of all control in Sudan. To both the King and the nationalist movement, this was intolerable, and the Egyptian Government made a point of stressing that Fuad and his son King Farouk I were \"King of Egypt and Sudan\".\nDissolution\nThe reign of Farouk was characterised by ever increasing nationalist discontent over the continuing British occupation, royal corruption and incompetence, and the disastrous Palestine War of 1948–1949. All these factors served to terminally undermine Farouk's position, and paved the way for the Egyptian Revolution of 1952. Farouk was forced to abdicate in favor of his infant son Ahmed Fuad, who became King Fuad II, while administration of the country passed to the Free Officers Movement under Mohamed Naguib and Gamal Abdel Nasser. The infant king's reign lasted less than a year, and on 18 June 1953, the revolutionaries abolished the monarchy, and declared Egypt a republic, ending a century and a half of the Muhammad Ali dynasty's rule.\nReigning members (1805–1952)\n;Wālis, self-declared as Khedives (1805–1867)\n* Muhammad Ali (17 May 1805 – 20 July 1848)\n* Ibrahim (20 July 1848 – 10 November 1849)\n* Abbas I (10 November 1849 – 13 July 1854)\n* Sa‘id (13 July 1854 – 17 January 1863)\n* Isma'il (19 January 1863 – 8 June 1867)\n;Khedives (1867–1914)\n* Isma'il (8 June 1867 – 26 June 1879)\n* Tewfik (26 June 1879 – 7 January 1892)\n* Abbas II (8 January 1892 – 19 December 1914)\n;Sultans (1914–1922)\n* Hussein Kamel (19 December 1914 – 9 October 1917)\n* Fuad I (9 October 1917 – 16 March 1922)\n;Kings (1922–1952)\n* Fuad I (16 March 1922 – 28 April 1936)\n* Farouk (28 April 1936 – 26 July 1952)\n** ''Prince Mohammed Ali Tewfik (Chairman Council of Regency during Farouk I's minority) (28 April 1936 – 29 July 1937)\n* Fuad II (26 July 1952 – 18 June 1953)\n** Prince Muhammad Abdel Moneim (Chairman Council of Regency during Fuad II's minority) (26 July 1952 – 18 June 1953)''\nNon-ruling members\nThere are too many members to list. The following people listed are few of many\n* Prince Mustafa Fazıl Pasha\n* Prince Mohammed Ali Tewfik\n* Prince Muhammad Abdel Moneim\n* Prince Hassan Ismail Pasha\n* Princess Nazli Fazil\n* Princess Fawzia Fuad, Empress of Iran\n* Muhammad Ali, Prince of the Sa'id\n* Narriman Sadek\n* Nazli Sabri\n* Prince Abbas Halim\n* Prince Ismail Daoud\n* Princess Tewhida Ismail\n* Prince Soliman Daoud\n* Prince Abbas Hilmi\n* The Yeghen family\n* Prince Omar Toussoun\n* Toussoun Pasha\nFamily tree\n;Crowns\nKing\nKhedive & Sultan\n|stílus MA=background-color: #FFFF00;}}\n|IP=Ibrahim|SP=Said}}\n|IM=Ismail}}\n|HK=Hussein Kamil|F1=Fuad I}}\n|MA=Muhammad Ali Tawfik|FA=Farouk}}\n|F2=Fuad II}}\nSee also\n* Albanians in Egypt\n* Muhammad Ali dynasty family tree\n* List of monarchs of the Muhammad Ali dynasty\n* History of Egypt under the Muhammad Ali dynasty\n* History of Sudan under Muhammad Ali and his successors\n* List of Sunni dynasties\nBibliography\n*\nReferences\nExternal links\n* [https://web.archive.org/web/20170716065848/http://members.iinet.net.au/~royalty/states/islamic/egypt.html The Genealogy of the Egyptian Royal family] at Genealogical Gleanings\n*\n*\n*"
    }
  ]
}