{
  "content": [
    {
      "type": "text",
      "text": "# Muhammad ibn Ahmad al-Khwarizmi\n\nMuḥammad ibn al-ʿAbbās Abū Bakr al-Khwārazmī, better simply known as Abu Bakr al-Khwarazmi was a 10th century Persian poet born in Khwarazm (region in Central Asia conquered by Achaemenids in the 6th century BC), who throughout his long career served in the court of the Hamdanids, Samanids, Saffarids and Buyids. He is best known as the author of the early encyclopedia Mafātīḥ al-ʿulūm (“Key to the Sciences”) in the Arabic language.\nLife\nAl-Khwarazmi is a somewhat obscure figure. He was born in 935 in Khwarazm, the birthplace of his father. His mother was a native of Amol in Tabaristan. He periodically refers to himself as al-Khwarazmi or al-Tabari, while other sources refer to him as al-Tabarkhazmi or al-Tabarkhazi. Al-Khwarizmi may have been a nephew of al-Tabari, the prominent Persian historian. For a time, al-Khwarizmi worked as a clerk in the Samanid court at Bukhara in Transoxania, where he acquired his nickname, “al-Katib’’ which literally means “the secretary” or “the scribe”.\nWhile at the Samanid court, he compiled his best-known work, Mafātīḥ al-ʿulūm [The Keys of the Sciences], an early Islamic encyclopedia of the sciences, intended as a reference work for court officials. It was produced at the request of Abū l-Ḥasan al-ʿUtbī a vizier in the court of Amir, Nuh II. and the work is dedicated to al-Utbi which establishes a date for its completion of around 977.\nIn Nishapur, Al-Khwarizmi wrote a number of rihla (short, humorous accounts of a journey; partly written in verse and partly in literary prose), of which only fragments survive. Locally, he achieved great fame as a leading scholar and writer. However, his reputation was eclipsed following the arrival of an aspiring young scholar and writer, Badi' al-Zaman al-Hamadani in 383/992. Hamadani composed a new form of prose that gained enormous popularity firstly in Nishapur and later across the Arabic speaking world; this innovative genre became known as maqama. Al-Khwārizmī and Hamadani fell into competition with each other, exchanged insults and they eventually fell out.\nWork\nAl-Khwārizmī authored a work on Arabic grammar, Kitāb kifāyat al-Mutaḥaffiẓ [A Classified Vocabulary of Rare of Difficult Arabic words]. However, he is best known as the author of Mafātīḥ al-ʿulūm (The Keys to the Sciences), an early Islamic Encyclopedia of the Sciences. A monumental work, Mafātīḥ al-ʿulūm is part lexicography and part encyclopedia. Scholars regard it as the first attempt to document the Islamic sciences. The work includes sections on mathematics, alchemy, medicine and meteorology.\nEditions and Translations\nOnly limited selections of Mafātīḥ al-ʻulūm have been translated into English. Notable editions and translations include:\n* Gerlog van Volten (ed), Kitāb Liber Mafātīḥ al-ʻulūm, Leiden, Brill, 1895 (in Arabic, with an introduction in Latin)- many reprints.\n* Al-Khashshāb, Y. and al-ʻArīnī, B., ‏ضبط وتحقيق الالفاظ الإستلهية التنخية الواردة فى كتاب مفاتبح العلوم للخورزم / /ليحيى الخشاب، الباز العريني. [Ḍabṭ wa-taḥqīq al-alfāẓ al-istilahiyah al-tankhiyah al-wāridah fī kitāb Mafātīḥ al-ʻulūm lil-Khuwarizmi] Controlling and realizing the developmental vocabulary contained in the book of Mufatih, Cairo, 1958 (Arabic)\n* Khadivjam, H., Tarjumah-ʼi Mafātīḥ al-ʻulūm, Tehran, Markaz-i Intishārāt-i ʻIlmī va Farhangī, 1983 (in Persian and Arabic).\n* Al-Ibyari, I., Mafātīḥ al-ʻulūm, Beirut, 1984\n* Bosworth, C.E.,“Abū ʿAbdallāh al-Khwārizmīon the Technical Terms of the Secretary’s Art”, Journal of the Social and Economic History of the Orient, vol. 12, pp 112–164 (reprinted in Medieval Arabic Culture, no. 15, London, 1983. - annotated translation of the 4th chapter of Mafātīḥ al-ʻulūm (English)\n*\n* Hajudan, H., A Persian Translation of Mafātīḥ al-ʻulūm, Tehran, 1928 (in Persian)\n* Farmer, H.G.,”The Science of Music in the Mafatih Alulum” in: Transactions of the Glasgow University Oriental Society, vol. 17, 1957/8, pp 1–9 translation of Section 7, Part 2 (English)\n* Unvala, J.M., \"The Translation of an Extract from Mafatih aI-Ulum of al-Khwarazmi,\" The Journal of the K.R. Cama Institute, vol. XI, 1928 (English)\n* Seidel, E., \"Die Medizin im Mafātīḥ al-ʻulūm\", SBPMSE, vol. XLVII, 1915, pp 1–79 (in German, with extensive commentary)\n* Weidemann, B., “Über die Geometrie und Arithematik nach den Mafātīḥ al-ʻulūm, ”SBPMSE, vol, 40, 1908, pp 1-64 (German)\nReferences\nSources\n*\n*\n*\nFurther reading\n* J. Vernet, \"[http://www.encyclopedia.com/doc/1G2-2830902299.html Al-Khuwārizmī, Abū ‘Abd Allāh Muḥammad Ibn Aḥmad Ibn Yūsuf]\", Dictionary of Scientific Biography.\n* Hossein Khadiv Jam, ''The Translation of Mafatih al-'Ulum (), Bonyad-e Farhang-e Iran, 1347 AP (1968), reprinted by Sherkat-e Entesharat-e Elmi-o Farhangi, 1383 AP (c. 2004 CE).\n*\n* Gerlof van Vloten, the editor of Mafātīḥ al-ʿulūm 1895 publication in Leiden, mentions in a preface to Mafātīḥ al-ʿulūm that nothing is known about al-Khwārizmī except his name and that he is also known as al-Balkhi, but Hossein Khadiv Jam, the Persian translator of Mafātīḥ al-ʿulūm mentions that after a lot of searches he has found that al-Khwārizmī \"was born in Balkh, lived in Nishapur, worked as a clerk in the Samanid court for a while, and has authored the book Mafātīḥ al-ʿulūm'', one of the oldest Islamic encyclopedias, at the request of Abu'l-Husain Utbi, a vizier of Nuh II, in the Arabic language.\"\n*"
    }
  ]
}