{
  "content": [
    {
      "type": "text",
      "text": "# Mule (software)\n\n| latest preview version =\n| latest preview date =\n| operating system = Cross-platform (JVM)\n| programming language = Java\n| genre = Enterprise Service Bus\n| license = CPAL license for Community Edition, Proprietary for Enterprise  Edition\n| website =\n}}\nMule is a lightweight enterprise service bus (ESB) and integration framework provided by MuleSoft. It has a Java-based platform and can also act as broker for interactions between other platforms such as .NET using web services or sockets.\nIt has a scalable and distributable object broker architecture that can manage interactions across legacy systems, in-house applications, and modern transports and protocols.\nSupporting tools\nDesign and development tools\n#Anypoint Studio: An Eclipse-based graphical development environment for designing, testing, and running Mule flows. It consists of two types of editors for development: a visual editor and an XML editor.\n#Anypoint Enterprise Security: A suite of security-related features for secure access and transactions to Mule applications.\n#Mule Healthcare Toolkit: Provided to process HL7 standard messages used in healthcare organizations.\n#Mule IDE (now deprecated): A set of Eclipse plug-ins for developing, deploying, and managing Mule projects.\nManagement tools\n#Mule Management Console: A user interface that provides a run-time management facility for deployment to the Mule Repository and clusters.\nMule has an integration engine, but the community edition lacks support for Advanced Management interfaces. MuleSoft offers an Enterprise Edition of Mule that provides a management console, a Service registry, and higher availability.\nCloudhub\nCloudhub is Mulesoft's Cloud-based integration platform as a service (iPaaS) designed to connect apps, data, and devices with integration connectors (like one to Twitter, etc.).\nMule ESB and messaging\nAMQP support\nAMQP (Advanced Message Queuing Protocol) support is based on the RabbitMQ Java Client and supports AMQP up to 0.9.1.\nJMS support\nJakarta Messaging is a Message-oriented middleware API provided by Oracle for communication between different components of an application. This provides reliable, loosely coupled, and asynchronous message-based communication, supporting two models: point-to-point (queues) and publish-subscribe (topics). Mule supports all functionality of JMS specification versions 1.0.2b and 1.1, and provides an endpoint for the same.\nWMQ support\nWMQ or Websphere MQ is an IBM Message Oriented Middleware product for communication for distributed systems. Mule also provides support for WMQ called Mule WMQ Transport which works with 7.0, 7.1, and 7.5 versions and provides an endpoint for the same.\nUniversal Message Object\nThe Universal Message Object Application Programming Interface is part of high-level design methodologies used to describe and define aspects of a data object used in conjunction with the Mule ESB. The idea is to, by staged events, wrap the work into sensible bundles and process it in stages that can conform to models of transaction-based processing that are useful in time or mission-critical applications such as financial transactions, where subsequent successful outcomes are required to permit the desired outcome. But if the user fails to supply needed data or a run-time error occurs, then the model will allow for state-full back-off, meaning \"no harm done\", the user may then complete a transaction without losing too much work or cancelling an entire transaction.\nUniversal Message Object defines the parameters that the program will use for internal messaging communications and its components to set and get variables based upon the user's needs and the program's functionality.\nReferences\nFurther reading\n* Tijs Rademakers and Jos Dirksen, \"Open-Source ESBs in Action\" (Manning Publications: Oct 2008, ; )\n* Peter Delia and Antoine Borg, \"Mule 2: A Developer’s Guide\" (Apress: Nov 2008, ; ),\n* David Dossot and John D'Emic, \"Mule in Action\" (Manning Publications: Apr 2009, ; )\n* Getting Started with Mule Cloud Connect (O'Reilly Media: Dec 2012, Print ; ; Ebook ; )\n* David Dossot, John D'Emic and Victor Romero, \"Mule in Action, Second Edition\" (Manning Publications, Early Access Program)\n*\nExternal links\n*"
    }
  ]
}