{
  "content": [
    {
      "type": "text",
      "text": "# Multi-party period of the Republic of Turkey\n\n}}\nThe multi-party period of the Republic of Turkey () started in 1945.\nPrelude\nAfter President Mustafa Kemal Atatürk asked Ali Fethi Okyar to establish the opposition Liberal Republican Party (Serbest Cumhuriyet Fırkası) in 1930 as part of an attempted transition to multi-party democracy in Turkey, the party was soon dissolved by the Republican People's Party (CHP) government when Atatürk found it to be too influenced by Islamist-rooted elements.\n1950–1960: DP in power\nThe National Development Party (Milli Kalkınma Partisi) was founded by Nuri Demirağ. The next year, the Democrat Party was established, and was elected in 1950.\nVery popular at first, the government, led by Prime Minister Adnan Menderes, relaxed the restrictions on public Islam and presided over a booming economy thanks to the Marshall Plan. In the later half of the decade, however, the government introduced censorship laws limiting dissent, while it became plagued by high inflation and a massive debt. The government also attempted to use the army to suppress its political rivals. The army revolted in the 1960 coup, ending the Menderes government, and soon thereafter returning rule to civilian administration.\n1960 coup\nThe army balked at the government's instrumentalization of it, and on May 27, 1960, General Cemal Gürsel led a military ''coup d'état'' removing President Celal Bayar and Prime Minister Menderes. Menderes was executed with two ministers. In October 1961, the military junta returned the power to civilians. The political system that emerged in the wake of the 1960 coup was a fractured one, producing a series of unstable government coalitions in parliament.\n1961–1980\nIn 1965, the Justice Party of Süleyman Demirel won an absolute majority, which it increased in 1969. But there was increasing polarization between the Justice Party on the right and the CHP of İsmet İnönü and Bülent Ecevit on the left. In 1969, the right-wing Nationalist Movement Party (MHP) was founded by Alparslan Türkeş, a member of the Counter-Guerrilla, the Turkish branch of NATO's stay-behind army. MHP's youth organizations became known as the Grey Wolves.\nA memorandum from the military on March 12, 1971 threatened intervention, forcing the Demirel government to resign. After a period of interim government, Bülent Ecevit became Prime Minister and governed in a coalition with the religious National Salvation Party. In 1974, the Greek military junta supported a coup in Cyprus led by extremist Greek Cypriots who were hostile to President of Cyprus, Archbishop Makarios. Prime Minister Ecevit invaded Cyprus on July 20, 1974 to counter the potential Greek coup.\nThe fractured political scene and poor economy led to mounting violence between ultranationalists and communists in the streets of Turkey's cities. The NATO stay-behind army Counter-Guerrilla, related to the National Intelligence Organization (, MIT) engaged itself in domestic terror and killed hundreds. As in Italy, it engaged itself in a strategy of tension The overall death-toll of the terror of the 1970s in estimated at 5,000, with right-wing and terrorism responsible for the most part. According to statistics published by the British Searchlight magazine, in 1978 there were 3,319 fascist attacks, in which 831 were killed and 3,121 wounded.\n1980 coup\n1980–2002\nOut of the rubble of the previous political system came a single-party governance under Turgut Özal's Motherland Party (ANAP), which combined a globally oriented economic program with conservative social values. Under Özal, the economy boomed, converting towns like Gaziantep from small provincial capitals into mid-sized economic boomtowns.\nUpon the retirement of President Kenan Evren, the leader of the 1980 coup, Özal was elected President, leaving parliament in the hands of Yıldırım Akbulut, and, in 1991, Mesut Yılmaz. Yılmaz redoubled Turkey's economic profile and renewed its orientation toward Europe. However, political instability followed, as the host of politicians banned from politics during the 1980 coup reentered politics, fracturing the vote, and the Motherland Party became increasingly corrupt. Özal died of a heart attack in 1993, and Süleyman Demirel was elected president.\nThe 1995 elections brought a short-lived coalition between Yılmaz's Motherland Party and the True Path Party (DYP), now with Tansu Çiller at the helm. Çiller then turned to the Welfare Party (RP), headed by Necmettin Erbakan, the former leader of the National Salvation Party, allowing Erbakan to enter the Prime Ministry. In 1997, the military, citing his government's support for religious policies deemed dangerous to Turkey's secular nature, sent a memorandum to Erbakan requesting that he resign, which he did. Shortly thereafter, the RP was banned and reborn as the Virtue Party (FP). A new government was formed by ANAP and Ecevit's Democratic Left Party (DSP) supported from the outside by the center-left CHP, led by Deniz Baykal. Under this government, Abdullah Öcalan, the leader of the PKK, was captured in 1999 in Kenya. Imprisoned in the prison-island of İmralı in the Marmara Sea, Öcalan was tried for treason and sentenced to death, later commuted to life imprisonment.\nThe DSP won big in the 1999 elections on the strength of the Öcalan abduction. Second place went, surprisingly, to the MHP. These two parties, alongside Yılmaz's ANAP formed a government. The popular perception was that it would fail; these were, after all, the inheritors of the two groups that were fighting so violently in the streets during the 1970s. However, the government was somewhat effective, if not harmonious, bringing about much-needed economic reform, instituting human rights legislation, and bringing Turkey ever closer to the European Union (EU).\n2002–present: AKP government\non the Islamisation of Turkey during the AKP government.]]A series of economic shocks led to new elections in 2002, bringing into power the religiously conservative Justice and Development Party (AKP) of former mayor of Istanbul, Recep Tayyip Erdoğan.  The Erdoğan government started negotiations with the EU on October 3, 2005.\nThe AKP again won the 2007 elections, which followed the controversial August 2007 presidential election, during which AKP member Abdullah Gül was elected President at the third round. Recent developments in Iraq (explained under positions on terrorism and security), secular and religious concerns, the intervention of the military in political issues, relations with the EU, the United States, and the Muslim world were the main issues. The outcome of this election, which brought the Turkish and Kurdish ethnic/nationalist parties (MHP and DTP) into the parliament, will affect Turkey's bid for European Union membership, as Turkish perceptions of the current process (or lack thereof) affected the results and will continue to affect policy making in coming years.\nErgenekon and Sledgehammer\nAlleged members of a clandestine group called Ergenekon were detained in 2008 as part of a long and complex trial.  Members are accused of terrorism and plotting to overthrow the civilian government.\nOn 22 February 2010 more than 40 officers arrested and then were formally charged with attempting to overthrow the government with respect to so-called \"Sledgehammer\" plot. They include four admirals, a general and two colonels, some of them retired, including former commanders of the Turkish navy and air force (three days later, the former commanders of the navy and air force were released).\n2013–2017\nAlthough the 2013 protests in Turkey started as a response against the removal of Taksim Gezi Park in Istanbul, they have sparked riots across the country in cities such as Izmir and Ankara as well. Three and a half million people are estimated to have taken an active part in almost 5,000 demonstrations across Turkey connected with the original Gezi Park protest. Twenty-two people were killed and more than 8,000 were injured, many critically.\nIn August 2014, Turkish Prime Minister Recep Tayyip Erdoğan won Turkey's first direct presidential election.\nIn the Turkish parliamentary elections of 1 November 2015, the AKP won back the absolute majority in parliament: 317 of the 550 seats. CHP won 134 seats, HDP 59 seats, MHP 40 seats.\nSince 2013, in the conflict between Islamic State of Iraq and the Levant (ISIL) and Turkish government, 304 civilians were killed by ISIL attacks across Turkey, excluding the 2015 Ankara bombings allegedly perpetrated by ISIL in which 109 civilians died; the bombings were the deadliest terror attack in modern Turkish history.\nOn 15 July 2016, factions within the Turkish military attempted to overthrow President Recep Tayyip Erdoğan, citing growing non-secularism and censorship as motivation for the attempted coup. The coup was blamed by the government on the influence of the vast network led by U.S.-based Muslim cleric Fethullah Gülen. In the aftermath of the failed coup, major purges have occurred, including that of military officials, police officers, judges, governors and civil servants, as well as factions within the media. There have been allegations of torture in connection with these purges.\nOn 16 April 2017, a constitutional referendum was voted in, although narrowly and divided. The referendum created a presidential republic. Many observers and European states viewed the referendum as an \"enabling act\" and see it as \"democratically backsliding\".\n2018–present\nPresident Erdoğan was re-elected on 24 June 2018. Erdoğan's party, the AKP, won a majority in the parliament with its ally, the MHP, in the parliamentary election. The opposition CHP considered the election unfair.\nIn October 2018, Saudi journalist Jamal Khashoggi was assassinated at the Saudi consulate in Istanbul.\nBetween 9 October and 25 November 2019, Turkey conducted a military offensive into north-eastern Syria.\nIn May 2023, Erdoğan won a third presidential term, with AK Party and its allies holding a parliamentary majority in a divisive general election.\nReferences"
    }
  ]
}