{
  "content": [
    {
      "type": "text",
      "text": "# Mumia Abu-Jamal in popular culture\n\nA polarizing figure, Mumia Abu-Jamal has attracted widespread attention in popular culture.  Since at least 1995, there are examples of references to him in notable popular music recordings and musical performances.  He and his case have been the subject of three documentary films and a shorter 20/20 television special which aired shortly after the 27th anniversary of his apprehension.\nThe references and treatment evoke him either as a representative of death row prisoners in the United States, as a revolutionary, as a man either deservingly or undeservingly subject to punishment, or as a convicted murderer capable of enlisting others to the cause of maintaining his life and opposing the imposition of capital punishment.\nMusic\nSeveral notable musicians, including KRS-One, Chumbawamba, Rage Against the Machine, Unbound Allstars, Saul Williams, Anti-flag, Man Is the Bastard, Immortal Technique and Tupac Shakur have made references to Abu-Jamal in their work.\n*In 1995 rapper KRS-One released an eponymous album featuring the song, \"Free Mumia\".\n*In 1996, The Black Crowes played some live shows with a portrait of Mumia Abu-Jamal on the drumhead and the writing \"Free Mumia\".\n*In 1997, the powerviolence band Man Is the Bastard released a split album featuring one side of music and one side of spoken word performed by Abu-Jamal.\n*In 1997, Chumbawamba played \"Tubthumping\" on the Late Show with David Letterman during their US tour. In this performance, the band added a rap bridge, which had the lyrics \"Free - Mumia - Abu - Jamal\".\n*In 1999 the band Rage Against the Machine released a song called \"Voice of the Voiceless\" on their album The Battle of Los Angeles.  They also mention Mumia by name in the song \"Guerrilla Radio\" on the same album.\n*In 1999 the one-off collaboration of various hip-hop and rock artists Unbound Allstars released the LP Mumia 911.\n*In 2000 Looptroop Rockers released their album Modern Day City Symphony containing the song \"Long Arm of The Law\", in which they call out for the release of Mumia.\n*In 2001 Saul Williams released \"Penny for a Thought\" on his album Amethyst Rock Star.  The song contains the line \"How much will it cost to free Mumia? Who do I make checks payable to?\"\n*In 2002, Jonathan Richman released \"Abu Jamal\" on his album Not So Much to Be Loved as to Love, espousing the innocence of Abu Jamal. He tells listeners to \"protest with a letter, or maybe a phone call\".\n*In 2002 the band Anti-Flag released a song called 'Mumia's Song' on their Mobilize album. The song \"Vices\" on their 2008 Album Bright Lights of America features a recording of Abu-Jamal speaking about the US Prison System.\n*In 2002 the hip-hop group Jurassic 5 released a song on their Power In Numbers album entitled \"Freedom\", which includes the line \"Got people screamin' 'free Mumia Jamal' / But two out of three of y'all will probably be at the mall.\"\n*In 2003, rapper Immortal Technique released the album Revolutionary Vol. 2 which was endorsed by Mumia Abu-Jamal, who introduces the album (\"Revolutionary Intro\" track 1) and also provides a speech about hip hop's relationship to Homeland security in the track \"Homeland and Hip Hop\".\n*Jedi Mind Tricks' 2004 album Legacy of Blood contains the song \"Age of Sacred Terror\" with the lyric \"If you come into our shows then you go bananas/And holding banners/In support of Mumia Jamal\".\n*In 2005 (recorded 2004) rapper Immortal Technique released a 12\" vinyl called Bin Laden Remix (Bin Laden Pt. 2)' which was produced by DJ Green Lantern, featuring Chuck D and KRS-One, Mos Def, and Eminem. Track 7 on the record was called \"The War vs. Us All by Mumia Abu-Jamal.\" He also mentions Abu-Jamal in the song, \"One (Remix).\"\n*In 2007, Flobots released a tracked entitled \"Same Thing\" which mentions Abu-Jamal saying \"Free Mumia and Leonard Peltier\"\n*In 2008 Snoop Dogg recorded a track with Massive Attack called \"Calling Mumia.\" It was recorded under the alias 100 Suns and features on the soundtrack of the 2007 documentary In Prison My Whole Life which revolves around the life of Mumia Abu-Jamal.\n*In 2009, Rise Against released a track entitled \"Death Blossoms\" in reference to one of Abu-Jamal's publications.\nFilm\n;Anti-Mumia\n*1998 December 9, - ABC 20/20 special with Sam Donaldson\n;Pro-Mumia\n*1997 Documentary - Mumia Abu-Jamal: A Case For Reasonable Doubt?\n*2001 Documentary - Framing an Execution: The Media & Mumia Abu-Jamal (a response to ABC's December 9, 1998 20/20 special with Sam Donaldson)\n*2008 23 October, - Documentary - In Prison My Whole Life - by William Francome with  Colin Firth as executive producer\n*2013 June 11, Documentary - Mumia: Long Distance Revolutionary  - directed by Stephen Vittoria and starring Cornel West, Alice Walker, Dick Gregory, Angela Davis, Rubin Hurricane Carter, and Amy Goodman.\nSources and further reading\nby Abu-Jamal, Mumia\n*Live from Death Row. HarperTrade, 1996.\n*Ich Schreibe um zu Leben. Zeugnisse eines zum Tode Verurteilten (I Write to live. Testimonies of a Person Sentenced to Death). Atlantik (Bremen), 1997.\n*All Things Censored. Seven Stories Press, 2000.\n*Das Imperium kennt kein Gesetz (The Empire Knows No Law). Atlantik (Bremen), 2002.\n*Death Blossoms: Reflections from a Prisoner of Conscience. South End Press, 2003.\n*Faith of Our Fathers: An Examination of the Spiritual Life of African and African-American People. Africa World Press, 2003.\n*We Want Freedom: A Life in the Black Panther Party. South End Press, 2004.\nPro-Mumia\n*1995 - ''Race for Justice: Mumia Abu-Jamal's Fight Against the Death Penalty by Weinglass, Leonard.  Common Courage Press, 1995.\n*1996 - In Defense of Mumia: An Anthology of Prose, Poetry and Art by S. E. Anderson and Tony Medina. New York : Writers & Readers Publishing, Inc.\n*2000 - On a Move: The Story of Mumia Abu-Jamal by Bisson, Terry. Litmus Books, 2000.\n*2001 - The Case of Mumia Abu-Jamal: A Life in the Balance by Amnesty International. (Open Media Pamphlet Series). Open Media, 2001.\n*2002 - Executing Justice: An Inside Account of the Case of Mumia Abu-Jamal'' by Williams, Daniel R. St. Martin's Press, 2002.\n*2002 - Killing Time:: An Investigation into the Death Row Case of Mumia Abu-Jamal. by Lindorff, David. Common Courage Press, 2002.\n*2006 - Race Against Death. Mumia Abu-Jamal: a Black Revolutionary in White America by Schiffmann, Michael (Wettlauf gegen den Tod: Mumia Abu-Jamal - Ein schwarzer Revolutionär im weissen Amerika), Promedia Verlag, Vienna;\n*2008 - The Framing of Mumia Abu-Jamal by O'Connor, J. Patrick Lawrence Hill Books\nAnti-Mumia\n*2007 - Murdered by Mumia: A Life Sentence of Loss, Pain, and Injustice by Faulkner, Maureen, Smerconish, Michael A. The Lyons Press, 2007.\nOther\n* In 2010, episode 12 in season 3 of the show The Boondocks features Robert Freeman  declaring \"Look, Mumia; he's free\" to distract Huey.\n* The 2010 Off-Broadway play After the Revolution references his case.\nReferences"
    }
  ]
}