{
  "content": [
    {
      "type": "text",
      "text": "# Munawar Shakeel\n\n| image            =\n| image_size       =\n| image_upright    =\n| alt              =\n| caption          =\n| native_name      =\n| native_name_lang =\n| pseudonym        =\n| birth_name       =\n| birth_date       =\n| birth_place      = Village near Rurala Road, Jaranwala Tehsil, Faisalabad District, Punjab, Pakistan\n| death_date       =\n| death_place      =\n| resting_place    =\n| occupation       = Cobbler, poet\n| language         = Punjabi\n| residence        =\n| nationality      =\n| citizenship      = Pakistani\n| education        =\n| alma_mater       =\n| home_town        =\n| period           =\n| genre            =\n| subject          = Social\n| movement         =\n| notable_works    = Five Punjabi-language poetry books\n| spouse           =\n| partner          =\n| children         =\n| relatives        =\n| awards           =\n| signature        =\n| signature_alt    =\n| years_active     = Since 1990\n| module           =\n| website          =\n| portaldisp       =\n}}\nMunawar Shakeel (Punjabi and }}) (born 1969) is a Pakistani poet, writing in the Punjabi language.\nEarly life; career\nSkakeel was born in 1969 in a village near the town of Rurala Road – 25&nbsp;km from Jaranwala (city) in the Faisalabad District, Punjab, Pakistan.\nBy profession, he is a roadside cobbler. A writer of five Punjabi-language award-winning books, he used to write poetry while repairing shoes. Bashir Hamid, the headmaster of 282 GB, was his mentor.\nBooks\n* first book – Soch Samandar (Punjabi سوچ سمندر ) was published in 2004\n* second book – Pardes Di Sangat (Punjabi سنگت پردیس دی   ) was published in 2005\n* third book – Saddiyan De Bhait ( صدیاں دے بھیت) was published in 2009\n* fourth book – Jhora Dhap Gawachi Da (چھورا دھپ گوچی دا) was published in 2011\n* fifth book – Akhaan Mitti Ho Gaiyaan Ankhaian (مٹی ہو گئیاں اکھیاں) was published in 2013\nAwards and memberships\nShakeel has received awards from organisations, including the Ashna-e-Saandal Bar, the Pakistan Writers Guild, and Punjabi Sevak.\nHe is a member of literary groups, including the Royal Adabi Academy, Jaranwala and the Naqeebi Karvan-e-Adab.\nReferences"
    }
  ]
}