{
  "content": [
    {
      "type": "text",
      "text": "# Murder of Jordan Edwards\n\n| venue                    =\n| location                 = Balch Springs, Texas, U.S.\n| coordinates              =\n| also known as            =\n| type                     = Child murder by shooting, police killing\n| victim          = Jordan Edwards, aged 15\n| perp                = Roy Oliver\n| verdict                  = Guilty\n| convictions = Murder years)\n}}\n}}\nOn April 29, 2017, Jordan Edwards, a 15-year-old African-American boy, was murdered by police officer Roy Oliver in Balch Springs, Texas, within the Dallas-Fort Worth metroplex. Edwards was shot in the back of the head while riding in the front passenger's seat of a vehicle driving away from officers that attempted to stop it. He was unarmed during the encounter.\nOliver was fired from the department and arrested on May 5, 2017. On August 28, 2018, he was found guilty of murder. On August 29, 2018, he was sentenced to 15 years in prison.\nMurder\nAccording to initial reports, the officers were responding around 11:00 pm to a 911 call \"reporting several underage kids drunk walking around\" at a party of around 100 people. Upon arrival, the officers allegedly heard gunshots, which created panic and caused partygoers to flee. Officer Roy Oliver fired three rifle rounds into a vehicle, striking Edwards in the head and killing him. Oliver was reportedly armed with a Modern Carbine MC5 rifle. Along with Edwards, the car contained two of Edwards's brothers and two friends. Edwards's 16-year-old brother was driving the car. Lee Merritt, a lawyer for Edwards's family, said Oliver shot through the front passenger side window. Edwards was pronounced dead at a local hospital. According to police, Edwards's brother was held in police custody overnight for the purpose of questioning him as a witness.\nPolice originally said an \"unknown altercation [occurred] with a vehicle backing down the street towards the officers in an aggressive manner\". After reviewing body-worn camera footage, Police Chief Jonathan Haber later admitted that the vehicle was not moving toward the officers, but rather away from them. Haber said he \"misspoke\", saying, \"I was unintentionally incorrect yesterday when I said that the victim's vehicle was backing down the road.\" A later statement by the police department said, \"The vehicle then pulled forward as the officer continued to approach the vehicle giving verbal commands. The vehicle continued [on] the main roadway driving away from the officer as an officer shot into the vehicle, striking the passenger.\"\nOliver was fired from the police department as a result of the shooting. He had been a member of the Balch Springs Police Department for six years.\nVictim\nJordan Edwards was a 15-year-old boy who lived in Mesquite, Texas. He was a first-year student (freshman) at Mesquite High School, where he played football.\nAftermath\nOliver, the officer who killed Edwards, was placed on administrative leave following the shooting, and fired on May 2, 2017. Chief Haber said Oliver's behavior \"did not meet our core values\". The Dallas County Sheriff's Department and the Dallas County District Attorney's Office conducted an investigation into the shooting. On May 5, 2017, Oliver was charged with murder and a warrant was issued for his arrest. He turned himself into police later that day and was released after posting $300,000 in bail.\nOn May 3, 2018, Oliver's murder trial was postponed for a second time and was rescheduled to begin August 20. On August 28, 2018, Oliver was found guilty of Edwards's murder. On August 29, 2018, Oliver was sentenced to 15 years in prison. His attorneys stated they intend to appeal both the sentence and guilty verdicts.  On August 10, 2020, Texas' Fifth Court of Appeals rejected Oliver's appeal, upholding Oliver's murder conviction and sentence in an opinion that rejected all issues raised by Oliver's lawyers.\nResponses\nA vigil was held at Edwards's school on the evening of May 1, 2017. A lawyer for Edwards's family demanded the arrest of Oliver.\nPublic and media reaction compared Edwards's death to the killings of other young black children by police officers. Reactions also noted the discrepancy between the original police account of the incident stating that the vehicle carrying Edwards had backed up aggressively toward the officers, and the body cam video showing the vehicle pulling away from the officers. Thousands of people began using the hashtag #jordanedwards on social media in response to the shooting. The American Civil Liberties Union's division in Texas tweeted, \"We need answers. @BalchSpringsPD should immediately release footage of #JordanEdwards shooting. #BlackLivesMatter\". Shaun King published an article in the New York Daily News calling for the arrest of Oliver. A local protest rally was postponed at the request of Edwards's family.\nPopular culture\nIn the 2020 short film Two Distant Strangers in which a Black American is repeatedly killed by a police officer whilst stuck in a time loop, a list of Black Americans killed during police interactions is included at the conclusion of the film. Edwards' name is included in the list, alongside others including Botham Jean and Tamir Rice.\nSee also\n* List of unarmed African Americans killed by law enforcement officers in the United States\n* List of killings by law enforcement officers in the United States\nReferences"
    }
  ]
}