{
  "content": [
    {
      "type": "text",
      "text": "# Murrumba, Queensland\n\n| pop                 = 0\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4312\n| area                = 8.0\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 7.8\n| dir1                = NE\n| location1           = Esk\n| dist2               = 18.3\n| dir2                = SSE\n| location2           = Toogoolawah\n| dist3               = 71.8\n| dir3                = NNW\n| location3           = Ipswich CBD\n| dist4               = 109\n| dir4                = NW\n| location4           = Brisbane CBD\n| lga                 = Somerset Region\n| stategov            = Nanango\n| fedgov              = Blair\n| near-n              = Lake Wivenhoe\n| near-ne             = Lake Wivenhoe\n| near-e              = Lake Wivenhoe\n| near-se             = Glen Esk\n| near-s              = Glen Esk\n| near-sw             = Esk\n| near-w              = Coal Creek\n| near-nw             = Coal Creek\n}}\nMurrumba is a rural locality in the Somerset Region, Queensland, Australia. In the , Murrumba had \"no people or a very low population\".\nHistory\nThe name Murrumba is an Aboriginal word combination, in the Kabi language, meaning good spirit or good place.\nMurrumba State School opened on 6 September 1910. It closed on 8 March 1964. It was located approximately  on Murrumba Road. That section of Murrumba Road no longer exists as it was realigned due to the construction of Lake Wivenhoe, but originally the road continued east to the Murrumba Bridge over the Brisbane River. The school's location is now in the foreshore area of the lake and hence part of the locality of Lake Wivenhoe.\nDemographics\nIn the , Murrumba had a population of 16 people.\nIn the , Murrumba had \"no people or a very low population\".\nEducation\nThere are no schools in Murrumba. The nearest government primary school is Esk State School in neighbouring Esk to the south-east. The nearest government secondary school is Toogoolawah State High School in Toogoolawah to the north-west.\nTransport\nNo public transport serves the area.\nReferences\nFurther reading\n*  — also includes Mount Beppo State School, Ivorys Creek Provisional School, Cross Roads Provisional School, Ottaba Provisional School, Murrumba State School, Mount Esk Pocket School, Kipper Provisional School, Lower Cressbrook School, Fulham School, Sandy Gully State School, Cooeeimbardi State School, Scrub Creek State School"
    }
  ]
}