{
  "content": [
    {
      "type": "text",
      "text": "# Musa Juwara\n\n| birth_place = Tujereng, The Gambia\n| height = 1.70m\n| currentclub = Pogoń Szczecin\n| clubnumber = 7\n| position = Forward\n| youthyears1 = 2016–2017\n| youthclubs1 = Virtus Avigliano\n| youthyears2 = 2017–2019\n| youthclubs2 = Chievo\n| youthyears3 = 2019\n| youthclubs3 = → Torino (loan)\n| years1 = 2019\n| clubs1 = Chievo\n| caps1 = 1\n| goals1 = 0\n| years2 = 2019–2023\n| clubs2 = Bologna\n| caps2 = 12\n| goals2 = 1\n| years3 = 2020–2021\n| clubs3 = → Boavista (loan)\n| caps3 = 3\n| goals3 = 0\n| years4 = 2021–2022\n| clubs4 = → Crotone (loan)\n| caps4 = 3\n| goals4 = 0\n| years5 = 2023\n| clubs5 = → OB (loan)\n| caps5 = 0\n| goals5 = 0\n| years6 = 2023–2025\n| clubs6 = Vejle\n| caps6 = 60\n| goals6 = 7\n| years7 = 2025–\n| clubs7 = Pogoń Szczecin\n| caps7 = 13\n| goals7 = 1\n| nationalyears1 = 2020–\n| nationalteam1 = Gambia\n| nationalcaps1 = 6\n| nationalgoals1 = 0\n| pcupdate = 21:46, 18 November 2025 (UTC)\n| ntupdate = 21:46, 18 November 2025 (UTC)\n}}\nMusa Juwara (born 26 December 2001) is a Gambian professional footballer who plays as a forward for Ekstraklasa club Pogoń Szczecin and the Gambia national team.\nClub career\nEarly career\nJuwara was born in the Gambia and embarked as a migrant to Italy in 2016. There, he started playing football with Virtus Avigliano and after a successful season was scouted by Chievo. He was banned from transferring to Chievo by the FIGC, but he challenged the hearing and eventually joined them.\nJuwara briefly joined Torino F.C. on loan for the 2019 Torneo di Viareggio, where he scored 3 goals in 3 matches, before returning to Verona for the end of the season.\nHe made his professional debut for Chievo in a 0–0 Serie A tie with Frosinone Calcio on 25 May 2019, coming on as a 79th-minute substitute for Manuel Pucciarelli.\nBologna\nOn 8 July 2019, Juwara signed a deal with Bologna. Although he was assigned to their Under-19 squad for the 2019–20 season, he quickly began falling into Siniša Mihajlović's first-team plans, making his debut on December 4 by playing the full 90 minutes in a 4-0 Coppa Italia defeat at the hands of Udinese.\nHis Serie A debut for the club came on February 4, coming on as an 86th-minute substitute for fellow-countryman Musa Barrow in a 3–2 victory at Roma. This would be followed by appearances off the bench against Genoa and Udinese, before the competition was halted on March 9 as a result of the COVID-19 pandemic.\nAfter the competition resumed he would be given a lot more first-team opportunities as a result of the heavy playing schedule and new 5-substitute rule, impressing in the first game back in a 2–0 loss at Juventus on June 22, where he replaced Riccardo Orsolini in the 82nd minute.\nHis first Serie A goal came on July 5, in a convincing performance at San Siro, where he would score the equaliser and secure the sending-off of Alessandro Bastoni in a 2–1 win over Inter Milan.\nLoan to Boavista\nOn 6 October 2020, he joined Portuguese club Boavista on loan with an option to purchase.\nLoan to Crotone\nOn 13 July 2021, he moved on loan to Crotone. On 31 January 2022, the loan was terminated early.\nLoan to OB\nOn 19 January 2023, Juwara joined OB in Denmark on loan until 31 December 2023, with an option to buy. After a six-month stay, Juwara had yet to make his debut. For this reason, on 8 June 2023, the club decided to terminate the rental agreement six months early.\nVejle\nOn 3 July 2023, Juwara joined newly promoted Danish Superliga club Vejle Boldklub on a deal until June 2026.\nPogoń Szczecin\nOn 3 July 2025, Juwara joined Polish club Pogoń Szczecin on a three-year contract, with a one-year extension option.\nInternational career\nJuwara debuted with Gambia in a friendly 1–0 win over Congo on 9 October 2020.\nCareer statistics\nInternational\n{| class=\"wikitable\" style=\"text-align:center\"\n|+ Appearances and goals by national team and year\n|-\n!National team!!Year!!Apps!!Goals\n|-\n|rowspan=\"4\"|Gambia\n|2020||1||0\n|-\n|2021||3||0\n|-\n|2024||1||0\n|-\n|2025||1||0\n|-\n!colspan=\"2\"|Total!!6!!0\n|}\nReferences\nExternal links\n*\n* [https://web.archive.org/web/20180821112250/http://www.legaseriea.it/en/players/musa-juwara/JUWARA Lega Serie A Profile]"
    }
  ]
}