{
  "content": [
    {
      "type": "text",
      "text": "# Museum of Scottish Fire Heritage\n\n| established     = 1968\n| dissolved       =\n| type            = Heritage centre\n| location        = Leith, Edinburgh, Scotland\n| owner           = Scottish Fire and Rescue Service\n| visitors        =\n| director        =\n| ceo             =\n| curator         =\n| publictransit   = Lothian Buses, Edinburgh Trams\n| parking         = Dryden Terrace (On-street parking)\n| website         = [https://museumofscottishfireheritage.org/ museumofscottishfireheritage.org]\n}}\nThe Museum of Scottish Fire Heritage is a museum of firefighting located at the McDonald Road Community Fire Station in Leith, Edinburgh. It covers the history of firefighting in Scotland and houses old fire appliances and other equipment.\nHistory\nThe museum first opened as the Braidwood and Rushbrook Museum in 1968. It was housed in the former engine room of the Auxiliary Fire Service at the McDonald Road Fire Station.\nIn 1985, the museum was relocated to the former engine room of the Lauriston Place Fire Station. It was renamed to the Edinburgh Museum of Fire and it remained there until 2016, when the building was purchased by the University of Edinburgh.\nThe collection was then moved into storage, whilst a new location was under development. It was decided that the museum would return to its original home at McDonald Road. In April 2022, 5 appliances were moved to the new exhibition gallery. The museum opened in 2023 as the Museum of Scottish Fire Heritage.\nExhibits\nThe museum is split across five themes, showing the evolution of firefighting throughout Scotland.\nScotland's Challenges\nScotland's firefighters have faced many challenges, shaped by our history, our industry and our landscape. This section includes:\n*Speaking our language\nHeritage\nScotland became the home of modern firefighting after Edinburgh set up the first municipal fire service in 1824. This section includes:\n* Early Days\n* Duns Fire Appliance\n* James Braidwood\n* Manual Pump Appliance\nOn the Run\nFirefighters share a common goal - to get to a fire quickly with the best equipment to help them fight a fire and stay as safe as possible. This section includes:\n* Fire Service Horses\n* Greenwich Gem Appliance\n* Halley Appliance\n* Communications\n* Uniforms\n* Equipment\n* Dennis Limo Appliance\nBeing a Firefighter\nFirefighting is a demanding, exciting and varied job - whether firefighters are full-time, retained or volunteers. This section includes:\n* Viewing Gallery\n* Training\n* Canine Crews\n* Firefighting Family\n* A Dangerous Job\nYour Safety\nAdvice about tackling and preventing fires at home has changed as technology and our lives have changed. This section includes:\n* Safety\n* Temporary Exhibition\nCollection\nA complete list of the appliances present in the museum gallery is below:\n{| class=\"wikitable sortable\"\n|-\n! Date !! Description !! Notes\n|-\n| 1806 || Duns Fire Appliance ||Manufactured by Bristow & Sons, London\n|-\n| 1824 || Manual Pump Appliance || Manufactured by Tilley & Co, London\n|-\n| 1901 || Greenwich Gem Appliance || Manufactured by Merryweather, London\n|-\n| 1910 || Halley Appliance || Manufactured by Halley, Yoker\n|-\n| 1939 || Dennis Limo Appliance || Manufactured by Dennis, Surrey\n|}\nSee also\n*Fire museum\n*Scottish Fire and Rescue Service\nReferences\ncategory:Firefighting museums in the United Kingdom\ncategory:Emergency services museums in Scotland\ncategory:1968 establishments in Scotland\ncategory:Museums in Edinburgh"
    }
  ]
}