{
  "content": [
    {
      "type": "text",
      "text": "# Museum of Santal Culture\n\n| location        = Bishnubati, Birbhum, West Bengal\n| coordinates     =\n| type            = Community museum\n| collection_size = 150\n| founder         = Boro Baski\n| curator         = Bimal Baski\n| owner           = Bishnubati Adibasi Marshal Sangha (BAMS)\n}}\nThe Museum of Santal Culture () is a private community museum located in the village of Bishnubati, West Bengal. The community-led museum documents the history of the Santal community largely prevalent in the region, which includes their past, their memories, and traditional ways of being. The museum was co-founded by educator Dr. Boro Baski alongside other members of the village of Bishnubati, a Santali village of \"less than 700 hundred people\" in the Birbhum district of West Bengal.\nBackground\nFounded in 2007 with help from the Indian Museum, the Museum of Santal Culture is a museum that is completely run by the members of the Santal community for its people. According to one of the co-founders of the museum, Dr. Boro Baski, \"the Santali name of the museum is Santal Arichalidoho-jogao Bakhol, which translates as the house for taking care of Santal culture and heritage.\" The architecture of the one-level house is similar to a traditional Santali residence with traditional murals on the walls. It is dedicated solely to exhibit the diverse materials which depict the Santali past. Most of the collections were donated by the local residents, some rare items bought, and others sourced from other Santali regions in the Bankura district and parts of Santal Pargana in Jharkhand.\nOther museums which document the Santali history, heritage, and culture include, the Jhargram Tribal Museum in Jhargram, Bidisa Anthropology Museum in Western Medinipur, the Museum of Sidho Kanho Birsha University in Purulia and Johar Human Resources Development Centre in Jharkhand. The Museum of Santal Culture differs from these museums in its approach towards the process of preserving and presenting the Santali worldview. The museum was a result of the contributions of various individuals and families of the Bishnubati village, but it was also born out of an organic need to voice the Santali past for the younger generation to know who they are and where they come from. Initially, many members of the community were sceptical about the initiative and questioned the need to highlight their culture. However, the museum is now completely run on the generosity of the local individuals of the community. Raising awareness regarding the museum was a task that took some time and effort.\nHistorical and socio-cultural context\nAlongside the Rolf Schoembs Vidyashram (RSV), a school run by individuals of the Santali community for their children in the neighbouring Ghoshaldanga village under the initiative of the Ghosaldanga Adibasi Seva Sangha (GASS), the museum acts as a space for the students of the school and their parents to learn about their cultural legacy. According to Baski, historically, there has been no history written by the Santalis for themselves and most of the memories of the past are passed orally because there has been no written script of the Santali language. Therefore, he asserts that the \"written history of tribal people tends to be the work of the dominant groups in society.\" Very little awareness about the Santals exists amongst the diverse other communities which live in the larger Birbhum district. Furthermore, the Christian missionaries in the nineteenth century did not appreciate the Santali culture and traditions and ever since there have been negative conceptions about the Santals and their past, even within the community itself.\nCollections\nThe museum houses 150 materials pertaining to the Santal culture presented in six distinct categorieshunting materials, musical instruments, dresses and ornaments, household materials, old photographs of Santals, and Santal sculptures made of stone. Some of the rare materials include a banam (a lute), one of the ancient musical instruments of the Santals.\nSee also\n* Santal people\nReferences\nFurther reading\n# Hembrom, Ruby. (n.d.). \"Bodding and the Santal people: entwined in timelessness.\" Published: Museum of Cultural History, University of Oslo. Accessed [https://www.khm.uio.no/english/collections/santal/about/documents/bodding-and-the-santal-people-entwined-in-timelessness.pdf here].\n# Hembrom, Ruby. (n.d.). \"My Life. My telling. In my voice.\" Accessed [https://www.khm.uio.no/english/collections/santal/about/documents/ruby-hembrom-my-life-my-telling.pdf here].\n# Kämpchen, Martin. (2006). \"Santals reach out to the World.\" India International Centre Quarterly, 32(4), 100–109.\nExternal links\n* [https://advaya.co/people/boro-baski Dr Boro Baski]\n* [https://www.midnapore.in/museum/bidisa_museum1.html Bidisa Anthropology Museum, Paschim Medinipur]\n* [https://dumka.jcsaweb.org/social-apostolate/johar/ Johar Human Resources Development Centre, Dumka, Jharkhand]"
    }
  ]
}