{
  "content": [
    {
      "type": "text",
      "text": "# Mushroom Wars\n\niOSAndroidMicrosoft Windows\n| genre = Real-time strategy\n| modes =\n| platforms = PlayStation 3, iOS, Android, Microsoft Windows\n}}\nMushroom Wars is a real-time strategy video game developed by Creat Studios, originally available for the PlayStation 3 on the PlayStation Network (PSN). This version was released on October 15, 2009. On January 24, 2013 it has been released for the iPad on the iTunes Store. An Android version was released on Google Play on September 24, 2013. A sequel, Mushroom Wars 2, was released on iOS and Apple TV on October 13, 2016. It was released on several other platforms since.\nThe objective of the game is centered on capturing villages (bases) by overwhelming the enemy in numbers. The most basic strategy to use in the game is to fill villages that surround a target village with soldiers in preparation for the next capture.\nGameplay\nMushroom Wars gameplay is inspired by the game Galcon and centers on capturing villages and other buildings by armies overwhelming the defending forces.\nGameplay is divided into three categories, Campaign, Skirmish, and Local Multiplayer.  Three difficulty levels exist, allowing the player to increase the challenge after getting the hang of the game. In Campaign mode, there are various mission scenarios where the player can play against up to three computer-controlled opponents.  Campaign battles often have goals, such as capturing all enemy points before a time expires, capturing key villages or simply capturing all enemy villages with no time restrictions. Skirmish mode provides a wide variety of maps for single player action against up to three computer-controlled opponents. Local multiplayer mode allows up to four players to play against each other. Users may also unlock online multiplayer via a PSN add-on purchase.\nVillages produce soldiers until they reach a given population limit, after which the player needs to move soldiers to a different base or upgrade the village before it can produce more troops. Upgrading a village increases the number of soldiers it can support. The player \"spends\" soldiers like money in order to upgrade a village. Even though the villages stop producing soldiers after reaching their growth limit the player can move more soldiers to such villages. This can be useful in an attempt to accumulate a large army before mounting an attack or to reduce the population in other villages and allow them to keep producing soldiers. Towers are defensive buildings which hurl stones at the attacking army if they come within a certain radius of the tower. In addition to this attack towers can host soldiers for defense but they do not produce additional soldiers for the player as villages do. Like villages, towers can be upgraded to provide defensive bonuses for the player. Forges can contain soldiers for defense like villages and towers, but like towers do not produce additional soldiers for the player or support them.  Forges increase the attack ability and defense ability of all soldiers of the player who controls them.\nThe game has an inviting and light-hearted tone. The controls are relatively simple compared to other RTS games. The artwork is bright, cartoon like, and colorful.\nReferences"
    }
  ]
}