{
  "content": [
    {
      "type": "text",
      "text": "# Music torture in the war on terror\n\nMusic was used to torture detainees held by the United States during the war on terror. Usually, interrogates opted to use heavy metal, country, and rap music, although music from children's TV shows was also used. The practice was widespread and officially approved, being used in Guantanamo Bay detention camp, Camp Cropper, and several other American detainee camps.\nMusic as an instrument of torture originated in psychological research from the 1950s, and the tactic was officially approved by several prominent US Army officials. Music was used to make detainees feel hopeless and make them cooperate with interrogators, and it was sometimes combined with other abusive practices like stress positions and temperature manipulation. Music has been used against several notable detainees, including Mohammed al-Qahtani, Mohamedou Ould Slahi, Shaker Aamer, Ruhal Ahmed, Shafiq Rasul, Binyam Mohamed, Donald Vance, Abu Zubaydah, and Moazzam Begg.\nThe ACLU, along with several journalists and musicology organizations, denounced the use of music to torture. According to Moustafa Bayoumi, the reaction among the American public was often one of amusement. Several artists, such as Tom Morello and Skinny Puppy, also denounced music torture, with some joining the National Security Archive in filing a Freedom of Information Act request regarding the music used at Guantanamo Bay. The recording industry has stayed relatively silent on the issue, and several artists, such as Steve Asheim and James Hetfield, have come out in support of the practice.\nBackground\nBased on psychological research from the 1950s, the Central Intelligence Agency (CIA) developed an interrogation manual, KUBARK, which included the use of silence and continuous noise. The techniques in the manual were banned after the Vietnam War, but they continued to be taught to American personnel. Trainees of the interrogation preparation program, Survival, Evasion, Resistance and Escape (SERE), were subjected to looping, cacophonous sounds such as babies crying and a Yoko Ono album. Guantanamo Bay prison personnel modeled standard operating procedure for interrogations after SERE techniques and interrogators were trained by SERE instructors. Secretary of Defense Donald Rumsfeld and Lieutenant General Ricardo Sanchez officially approved of the use of auditory stimuli or music during interrogations in April and September 2003, respectively.\nMusic torture was already subject to legal challenges prior to the war on terror. In 1978, the European Court of Human Rights found that the use of the \"five techniques\", which included exposure to noise, against IRA prisoners constituted inhuman and degrading treatment but stopped short of calling it torture. In 1997, the United Nations Committee Against Torture found that the use of, among other techniques, exposure to loud music for extended periods and prolonged sleep deprivation by Israeli interrogators constituted torture.\nUse\nMost interrogators chose to use heavy metal, country, and rap music, as the lyrics were often culturally offensive to detainees. These songs were also often used by American soldiers to prepare themselves for dangerous missions. Other music used included songs from AC/DC, Marilyn Manson, Rage Against the Machine, Britney Spears, the Bee Gees, Barney & Friends, and Sesame Street. Music was used to make detainees believe that resistance was futile and to further cooperation with interrogators. CIA spokesperson George Little said music was played at levels far below that of a live concert and was never used as punishment, only for security. Pentagon spokesman John Kirby said that music was used \"both in a positive way and as a disincentive\" but denied that it had been used to torture.\nIn Camp Nama in Baghdad, interrogators used a \"black room\" outfitted with four speakers, and detainees were forced into stress positions while the speakers made noise. When several interrogators raised concerns that the detainees were being abused, representatives from the Judge Advocate General Corps reassured them that their interrogations techniques were entirely legal. At Forward Operating Base Tiger near al-Qaim, new detainees, following a period of intense sleep deprivation, were interrogated, and when interrogators received an undesirable answer, the lights in the room were replaced with a strobe light, and heavy metal (and in one instance, music from Barney & Friends) was played for two hours while interrogators shouted questions at detainees. The music was loud enough that soldiers thirty feet away had to shout at each other. Tony Lagouranis wrote in his memoir Fear Up Harsh about \"the disco\", an interrogation room in Mosul where heavy metal was frequently played.\nNotable detainees\nMusic torture was used against several detainees at Guantanamo Bay. Mohammed al-Qahtani, who was alleged to have attempted to participate in the September 11 attacks, was subjected to music, including songs in Arabic, during late night interrogations and medical treatment as a form of sleep deprivation. Al-Qahtani claimed that listening to Arabic music was forbidden by Islam, which was then exploited by interrogators to humiliate him. Mohamedou Ould Slahi, detained at Guantanamo Bay for his alleged ties to the millennium plot and the September 11 attacks, was shackled in a room lit entirely by strobe lights with the song \"Bodies\" by Drowning Pool blaring for hours during an interrogation. He was also subjected to the loud sounds of cats meowing and babies crying. In an interview with ITV News, detainee Shaker Aamer said that rock music, including Bruce Springsteen's \"Born in the USA\", was played into cells during prayer time. Ruhal Ahmed was forced to squat in a dark, cold cell in Camp Delta while heavy metal and Eminem music was played extremely loudly for hours and sometimes days at a time. Interrogators occasionally entered the cell to shout questions into his ear, but he was often alone in the room. Ahmed told Reprieve, a human rights organization, in a 2008 interview \"You lose the plot, and it's very scary to think that you might go crazy because of all the music, because of the loud noise and because after a while you don't hear the lyrics at all, all you hear is heavy banging.\" Shafiq Rasul was left alone in a small booth with Eminem's \"Kim\" playing from a nearby stereo on repeat for several hours, though he was relatively unaffected, as he had previously listened to Eminem's music. Interrogators later placed him inside a small room lit only by a strobe light, tied him up in a stress position, and played heavy metal for several hours per day for three weeks straight. Afterwards, Rasul falsely confessed to meeting with Osama bin Laden. Major Diana Haynie, a spokeswoman for Joint Task Force Guantanamo, said that the use of loud music on detainees ceased after the fall of 2003. A 2005 Army report found instances of loud music being used in interrogations between July 2002 and October 2004.\nDetainee Binyam Mohamed, while being held in Morocco, was forced to listen to songs from Meat Loaf, Aerosmith, and 2Pac continuously, even while sleeping and praying. He also heard others screaming and banging their heads against walls and doors. At Camp Cropper, whistleblower and detainee Donald Vance said that heavy metal and country music was played most of the time throughout the hallways. Vance was locked in a small, cold cell with a speaker playing hard rock, Nine Inch Nails, or Queen's \"We Will Rock You\" nearly constantly. He said of the experience \"You can no longer formulate your own thoughts when you're in an environment like that.\" Abu Zubaydah was bombarded by extremely loud music in a small wooden box to induce learned helplessness at a CIA black site in Thailand by two psychologists associated with SERE training. Unidentified American agents seized Algerian aid worker Laid Saidi and brought him to a dark prison where he, along with several other detainees, were kept in total darkness while loud rap or heavy metal music was played for weeks at a time. Moazzam Begg, while being held at Bagram Airfield, recalled several other detainees being held in small isolation cells while music loud enough to be heard throughout the building was played.\nReactions\nMother Jones dubbed the collection of music used the \"torture playlist\", although no official playlist is known to exist. The collection of music used at Guantanamo Bay was called the \"Gitmo playlist\", \"Guantanamo playlist\" and \"GTMO playlist\". Several bloggers and the Chicago Tribune asked their readers to create their own playlists for interrogations.\nThe ACLU, along with journalists Andy Worthington and Kelsey McKinney, characterized the use of loud music as torture. Musicologist Suzanne Cusick argued that, while the use of loud music itself did not fall under the definition of torture from the United Nations Convention Against Torture, the intense psychological pain caused by its use warrants its classification as torture. Several commentators noted that music as torture was a rebuttal to the romantic idealization of music.\nIn the blogosphere, conversations about music torture sometimes immediately accepted that music was used to torture and moved on from the topic of music. Communities that only accepted that it could be used as torture often referred to their own experiences of being forced to listen to music which they found distasteful (Cusick noted that music cited was often associated with homosexuality and effeminacy). Art historian Branden W. Joseph argued that the ridicule of the use of music from singer Christina Aguilera and the show Barney & Friends allowed the American public to implicitly accept a form of torture, and he further argued that familiarity and even annoyance with the music used could lead some to believe that they could withstand music torture. Melissa Kagen, writing in The Appendix argued that the relatively light-hearted reactions of those first learning about music to torture in Guantanamo Bay originated in American exceptionalism.\nMusicology\nIn 2007, the Society for Ethnomusicology issued a position statement condemning the use of music for torture, and the Society for American Music, the American branch of the International Association for the Study of Popular Music, and the American Musicology Society (AMS) issued similar statements in 2008. However, the Royal Music Association and the British Forum for Ethnomusicology, both based in the UK, another country tied to the war on terror, declined to issue similar statements. The response to the AMS's statement was mixed, and Richard Taruskin criticized the statement as \"breeding complacency\". Philip V. Bohlman, the then-president of the Society for Ethnomusicology, received hate mail blaming him for deaths in the Iraq War.\nResearch about music torture was generally met with skepticism from others, who argued that it lay outside of musicology. However, that skepticism dissipated in the wake of Cusick's research on music torture in the war on terror, prompting further research into music torture.\nArtists\nSeveral artists were outraged by the use of their music. Tom Morello, member of Rage Against the Machine, said in response \"The fact that music I helped create was used in crimes against humanity sickens me\" and called for the closure of the Guantanamo Bay prison. David Gray, whose song \"Babylon\" was used during interrogations, was shocked by the lack of public outcry and said \"We are thinking below the level of the people we're supposed to oppose, and it goes against our entire history and everything we claim to represent. It's disgusting, really.\" Skinny Puppy, after being told by Guantanamo prison guard Terry Holdbrooks that their music was blasted during interrogations, wrote the album Weapon and sent an invoice to the American government for $666,000 upon its release. Trent Reznor, member of Nine Inch Nails, called the use of his music to torture \"insulting, demeaning and enraging\" and threatened legal action, although he never followed up on this threat. The National Security Archive, endorsed by artists including Morello, Reznor, R.E.M., Pearl Jam, and Jackson Browne, filed a Freedom of Information Act request, seeking the declassification of information related to the use of music in interrogations.\nThe recording industry was reluctant to confront the issue, and when The Guardian reached out to several artists whose music was reportedly used in American detainment camps, most who did respond gave a \"no comment\". Steve Asheim, drummer of the death metal band Deicide, argued that the use of loud music did not constitute torture. Bob Singleton, the music director of Barney & Friends, laughed when learning of the theme song \"I Love You\" being used by interrogators and argued that it was ludicrous to believe it could psychologically alter detainees.\nStevie Benton, Drowning Pool's bassist, said of the use of their song \"Bodies\" \"I take it as an honor to think that perhaps our song could be used to quell another 9/11 attack or something like that.\" Benton later apologized for the comment, saying that he had been taken out of context. On the Fourth of July of 2017, Drowning Pool played \"Bodies\" during a concert at Guantanamo Bay, which Slahi called \"quite a coincidence.\" Navy officials claimed that they did not know the details of the song's use in torture at the base, but emails among Navy staff showed that they had full knowledge of this when booking the band, with one staff member saying that it \"might garner media interest\".\nIn a 2008 interview on 3sat, James Hetfield, co-founder of Metallica, said that he felt honored that Metallica's music was used in Guantanamo Bay, but he worried that the band would become associated with a political message. In a 2009 interview with Rachel Maddow, drummer Lars Ulrich said that such use of their music was \"certainly not something that we, in any way, advocate or condone.\" Metallica clarified in 2013 that they had not spoken to the military on the use of their music.\nSee also\n*Bagram torture and prisoner abuse\n*Behavioral Science Consultation Team\n*Bush Six\n*Command responsibility\n*Criticism of the War on Terror\n*Doublespeak\n*Extraordinary rendition\n*High-Value Interrogation Group\n*Iraq prison abuse scandals\n*Kuala Lumpur War Crimes Commission\n*Law of war\n*Panetta Review\n*Senate Intelligence Committee report on CIA torture\n*Torture and the United States\n*War crime\nReferences"
    }
  ]
}