{
  "content": [
    {
      "type": "text",
      "text": "# Musical Heritage Society\n\n| founder     = Michael NaidaT. C. Fry Jr.\n| fate        =\n| status      = Active catalog record label and magazine\n| distributor = The Orchard\n| genre       = Classical, jazz\n| country     = U.S.\n| location    = Asbury Park, NJ\n| website     = [http://www.themusicalheritagesociety.com www.themusicalheritagesociety.com]\n}}\nMusical Heritage Society was an American mail-order record label founded in New York City in 1962 by Michael \"Mischa\" Naida (1900–1991), co-founder of Westminster Records, and T. C. Fry Jr. (1926–1996).\nBackground\nAfter a small initial group of pseudonymous issues—licensed from the Telemann Society and Philips—MHS issued many recordings licensed from Erato. Eventually the label issued most of the Erato catalogue, including discs previously issued on several US retail labels. MHS also drew on such catalogues as Amadeo, Angelicum, Arcophon, Boston, Christophorus Records, Da Camera, Expériences Anonymes, Hispavox, Iramac, Library of Recorded Masterpieces, Lyrichord Discs, Muza, Pelca, Somerset, Supraphon, Unicorn-Kanchana, Valois, and Harmonia Mundi.\nThe company operated on a subscription basis similar to book clubs, offering monthly selections and the opportunity to order further from catalogues regularly issued to subscribers.  MHS also offered albums of jazz music through their Jazz Heritage Society subsidiary, also as a club-style subscription service, licensing and re-releasing under their Jazz Heritage label older titles from other labels such as Verve, RCA, Blue Note, and others.\nCompany changeovers and catalogue\nIn 1976, Naida sold the firm to Albert Nissim (1923–2010), who moved the offices to Oakhurst, New Jersey. Albert Nissim's two sons, Jeffrey R. (born 1954) and Robert, assumed most of the duties for the family business.\nBy 1980, the label had a catalog of over 3,000 discs, most of which were licensed from small European companies. From May 1981 until 1999, MHS produced and sold retail its own recordings using the label MusicMasters. After that, MHS licensed standard repertory from EMI and PolyGram.\nIn July 2011, Passionato LLC, based in Montclair, New Jersey, purchased Musical Heritage Society, which at the time, had over 100,000 CD, DVD, and SACD titles in its database. Passionato is a commercial provider of DRM-free classical music downloads. James G. Glicker (born 1954) is CEO and founder of Passionato.\nIn 2022, they reactivated their website, hosting archival information about past releases and links to external sites where digital versions of some of those releases could be streamed or purchased.\nReferences"
    }
  ]
}