{
  "content": [
    {
      "type": "text",
      "text": "# Muskingum Watershed Conservancy District\n\n|preceding1      =\n|preceding2      =\n|dissolved       =\n|superseding     =\n|jurisdiction    = 18 counties in Ohio encompassing the Muskingum River watershed\n|headquarters    = 1319 Third Street NW, New Philadelphia, Ohio\n|employees       =\n|budget          =\n|chief1_name     = John M. Hoopingarner\n|chief1_position = Executive director/secretary\n|parent_agency   =\n|child1_agency   =\n|child2_agency   =\n|website         =\n|footnotes       =\n}}\nThe Muskingum Watershed Conservancy District (MWCD) is a political subdivision of the State of Ohio organized in 1933 to develop and implement a plan for flood reduction and water conservation in the Muskingum River watershed, the state's largest wholly contained watershed, covering more than . Since the original construction of fourteen reservoirs and dams in the 1930s (two more were built later), more than $7&nbsp;billion worth of property damage has been saved from flooding.\nProjects\nAfter its formation, the MWCD began planning an extensive system of flood-reduction reservoirs and dams in the Muskingum River watershed, which covers all or portion of 27 counties (about 20 percent of the state). By 1938, a network of fourteen reservoirs and dams was constructed. The ten permanent reservoirs attract more than five&nbsp; million visitors annually.\n*Atwood Lake\n*Beach City Lake\n*Bolivar Dam\n*Charles Mill Lake\n*Clendening Lake\n*Dover Dam\n*Leesville Lake\n*Mohawk Dam\n*Mohicanville Dam\n*Piedmont Lake\n*Pleasant Hill Lake\n*Seneca Lake\n*Tappan Lake\n*Wills Creek Lake\nTwo additional dams and lakes were added at a later date: Dillon Lake (1960) and North Branch Kokosing.\nThe operation of the lakes and dams, along with the property immediately surrounding the dam sites, was transferred to the U.S. Army Corps of Engineers, Huntington District, after the approval of the Flood Control Act of 1939 by Congress. The MWCD continues to be responsible for the management of much of the reservoir areas behind the dams, serving as a partner to the U.S. Army Corps of Engineers for flood reduction. The reservoirs also serve as sources of public water supply and the MWCD manages about  of water and property, most of which is open for public access. In addition to operating a number of recreation facilities, the MWCD cooperates with the Ohio Division of Wildlife for fishing and hunting management.\nReferences\nExternal links\n*\n*[http://www.lrh.usace.army.mil U.S. Army Corps of Engineers, Huntington District]"
    }
  ]
}