{
  "content": [
    {
      "type": "text",
      "text": "# Muslim conquest of the Iberian Peninsula__disambig_1\n\nTheodemirAchila IIOppasArdoPelagius of AsturiasPeter of Cantabria\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n| casualties3       =\n| notes             =\n| map_type          =\n| campaignbox       =\n}}\nThe Muslim conquest of the Iberian Peninsula (; 711–720s), also known as the Arab conquest of Spain, was the Umayyad conquest of the Visigothic Kingdom of Hispania in the early 8th century. The conquest resulted in the end of Christian rule in most of Iberia and the establishment of Muslim Arab-Moorish rule in that territory, which came to be known as al-Andalus, under the Umayyad dynasty.\nDuring the caliphate of the sixth Umayyad caliph al-Walid I (), military commander Tariq ibn Ziyad departed from North Africa under the command of Musa bin Nusayr in early 711 to cross the Straits of Gibraltar, with a force of about 1,700 men, to launch a military expedition against the Visigoth-controlled Kingdom of Toledo, which encompassed the former territory of Roman Hispania. After defeating king Roderic at the Battle of Guadalete in July the same year, Tariq was reinforced by an Arab force led by his superior wali Musa ibn Nusayr and continued northward.\nIn 713, Theodemir, the Visigothic count of Murcia conditionally surrendered, and in 715, Abd al-Aziz ibn Musa was named the first governor of Al-Andalus, naming Seville as his capital. By 717, the Umayyads had invaded Gaul to launch their first raids into Septimania. By 719, Barcelona and Narbonne had also been captured. From 740 to 742, the invasion was then disrupted by the Berber Revolt, and in 755 when an Abbasid force led by Yusuf ibn Abd al-Rahman al-Fihri landed to claim the territory from the Umayyads. However, an Umayyad army was decisively defeated by Pelagius of Asturias at the Battle of Covadonga in the mountains of Asturias, securing a Christian stronghold in Northern Spain.\nBy 781, Abd al-Rahman I had quashed all rebellions and rivals and consolidated Umayyad rule over an almost wholly reunified Iberia, a presence that would remain until the Reconquista, which was aimed at reclaiming the entire Iberian Peninsula for Christianity.\nBackground\nThe historian al-Tabari transmits a tradition attributed to Caliph Uthman, who stated that the road to Constantinople was through Hispania, \"Only through Spain can Constantinople be conquered. If you conquer [Spain] you will share the reward of those who conquer [Constantinople]\". The conquest of Hispania followed the conquest of the Maghreb. Walter Kaegi says Tabari's tradition is dubious and argued that conquest of the far western reaches of the Mediterranean Sea was motivated by military, political and religious opportunities. He considers that it was not a shift in direction due to the Muslims failing to conquer Constantinople in 678.\nPrecisely what happened in Iberia in the early 8th century is uncertain. There is one contemporary Christian source, the Chronicle of 754, which ends that year and is regarded as reliable but often vague. There are no contemporary Muslim accounts, and later Muslim compilations, such as that of Al-Maqqari from the 17th century, reflect later ideological influence. Roger Collins writes that the paucity of early sources means that detailed specific claims need to be regarded with caution.\nThe Umayyads took control of Hispania from the Visigoths, who had ruled for roughly 300 years. At the time of the conquest, the Visigothic upper class was beginning to fracture and had many problems with succession and maintaining power. That was partially because the Visigoths were only 1 to 2% of the population, which made it difficult to maintain control over a rebellious population.\nThe ruler at the time was King Roderic but the manner of his ascent to the throne is unclear. There are accounts of a dispute with Achila II, son of his predecessor Wittiza. Later regnal lists, which cite Achila and omit Roderic, are consistent with the contemporary account of civil war. Numismatic evidence suggests a division of royal authority, with several coinages being struck, and that Achila II remained king of the Tarraconsense (the Ebro basin) and Septimania until circa 713. The nearly-contemporary Chronicle of 754 describes Roderic as a usurper who earned the allegiance of other Goths by deception, and the less reliable late-9th-century Chronicle of Alfonso III shows a clear hostility towards Oppa, bishop of Seville (or Toledo) and probably a brother of Wittiza, who appears in an unlikely heroic dialogue with Pelagius.\nThere is also a story of Julian, count of Ceuta, whose wife or daughter was raped by Roderic and who sought help from Tangier. However, these stories are not included in the earliest accounts of the conquest.\nMusa ibn Nusayr's first reconnaissance missions to Hispania returned with reports of \"great splendor and beauty\", which increased Muslim desires to invade Hispania. During one of the multiple raids in 710, the Muslims \"made several inroads into the mainland, which produced a rich spoil and several captives, who were so handsome that Musa and his companions had never seen the like of them\".\nAccording to Ahmad al-Maqqari’s chronicle, written 900 years later, the natives of Hispania viewed the Berbers in a similar way as the Byzantines viewed the Arabs, as barbarians, and feared an invasion by them.\nEstablishment of the Umayyad Polity of Al-Andalus\nConquest and Treaty\nAccording to the later chronicler Ibn Abd al-Hakam, the Tangier governor Tariq ibn Ziyad led a force of approximately 7,000 men from North Africa to southern Spain in 711. Ibn Abd al-Hakam reports, one and a half centuries later, that \"the people of Andalus did not observe them, thinking that the vessels crossing and recrossing were similar to the trading vessels which for their benefit plied backwards and forwards\". They defeated the Visigothic army, led by King Roderic, in a decisive battle at Guadalete in July that year. In 712, Tariq's forces were then reinforced by those of his superior, the wali Musa ibn Nusayr, who planned a second invasion, and within a few years both took control of more than two-thirds of the Iberian Peninsula. The second invasion comprised 18,000 mostly Arab troops, who rapidly captured Seville and then defeated Roderick's supporters at Mérida and met up with Tariq's troops at Talavera. The following year the combined forces continued into Galicia and the northeast, capturing Léon, Astorga and Zaragoza.\nAccording to the Muslim historian Al-Tabari, Iberia was first invaded some sixty years earlier during the caliphate of Uthman (Rashidun era). Another prominent Muslim historian of the 13th century, Ibn Kathir, quoted the same narration, pointing to a campaign led by Abd Allah bin Nafi al Husayn and Abd Allah bin Nafi al Abd al Qays in 32 AH (654 CE), but there is no solid evidence about this campaign.The Chronicle of 754 stated that \"the entire army of the Goths, which had come with him [Roderic] fraudulently and in rivalry out of hopes of the Kingship, fled\". This is the only contemporary account of the battle and the paucity of detail led many later historians to invent their own. The location of the battle, though not clear, was probably the Guadalete River.\nRoderic was believed to have been killed, and a crushing defeat would have left the Visigoths largely leaderless and disorganized, partly because the ruling Visigoth population is estimated to have been a mere 1 to 2% of the total population. While this isolation is said to have been \"a reasonably strong and effective instrument of government\"; it was highly \"centralised to the extent that the defeat of the royal army left the entire land open to the invaders\". The resulting power vacuum, which may have indeed caught Tariq completely by surprise, would have aided the Muslim conquest. It may have been equally welcome to the Hispano-Roman peasants who were probably – as D.W. Lomax claims – disillusioned by the prominent legal, linguistic and social divide between them and the \"barbaric\" and \"decadent\" Visigoth royal family. \" in an Umayyad fresco in Qasr Amra, modern-day Jordan (710–750)]]\nIn 714, Musa ibn Nusayr headed north-west up the Ebro river to overrun the western Basque regions and the Cantabrian mountains all the way to Gallaecia, with no relevant or attested opposition. During the period of the second (or first, depending on the sources) Arab governor Abd al-Aziz ibn Musa (714–716), the principal urban centres of Catalonia surrendered. In 714, his father, Musa ibn Nusayr, advanced and overran Soria, the western Basque regions, Palencia, and as far west as Gijón or León, where a Berber governor was appointed with no recorded opposition. The northern areas of Iberia drew little attention from the conquerors and were hard to defend when taken. The high western and central sub-Pyrenean valleys remained unconquered.\nAt this time, Umayyad troops reached Pamplona, and the Basque town submitted after a compromise was brokered with Arab commanders to respect the town and its inhabitants, a practice that was common in many towns of the Iberian Peninsula. The Umayyad troops met little resistance. Considering that era's communication capabilities, three years was a reasonable time spent almost reaching the Pyrenees, after making the necessary arrangements for the towns' submissions and their future governance.\nScholars have emphasized that animosity against the Visigothic rule in some regions of the Visigothic Kingdom, including to a greater extent the deep disagreements and resentment involving the local Jewish communities and the ruling authorities, weakened the kingdom and played a pivotal role in the ultimate success of the Umayyad Conquest of Iberia.\nNew territorial and civil administration\nPreference for treaties\nIn 713, Abd al-Aziz ibn Musa subdued the forces of the Visigothic count Theodemir (or Tudmir), who had taken over southeastern Iberia from his base in Murcia after the power vacuum after King Roderic's defeat. Theudimer then signed a conditional capitulation by which his lands were made into an autonomous client state under Umayyad rule.\nThe Treaty of Theodemir in 713 represents a form of indirect rule that Abd al-Aziz, son of Musa the Umayyad governor of Ifriqiya, installed over \"a Visigothic potentate named Theodemir (Tudmir, in Arabic)\". The treaty entailed that the local ruler, Theodemir, would remain in power as long as he recognized Muslim suzerainty, constituted in Abd al-Aziz, and paid monetary tribute. Furthermore, Abd al-Aziz agreed that his forces would not plunder or \"harass\" Theodemir's town or people, an agreement that extended to seven more towns as well.\nHis government and the Christian beliefs of his subjects were respected; in exchange, he pledged to pay a tax (jizya) and to hand over any rebels plotting against Umayyad rule or the Islamic religion. In that way, the life of many inhabitants remained much the same as before Tariq's and Musa's campaigns. The treaty signed with Theudimer set a precedent for the whole of Iberia, and towns surrendering to Umayyad troops experienced a similar fate, including probably the muwallad Banu Qasi based in the Ebro Valley and other counts and landowners.\nSome towns (Cordova, Toledo, etc.) were stormed and captured unconditionally by the Umayyads to be governed by direct Arab rule. In the area thought to be part of King Roderic's territory, Mérida also staged a prolonged resistance to the Umayyad advance but was ultimately conquered in mid-summer 712. As of 713 (or 714), the last Visigothic king, Ardo, took over from Achila II, with effective control over only Septimania and probably the eastern Pyrenean threshold and coastal areas of the Tarraconense.\nIslamic laws did not apply to all the subjects of the new rulers. Christians continued to be ruled by their own Visigothic law code (Forum Iudicum) as before. In most of the towns, ethnic communities remained segregated, and newly arriving ethnic groups (Syrians, Yemenites, Berbers and others) would erect new boroughs outside existing urban areas. However, that would not apply to towns under direct Umayyad rule. In Cordova, the cathedral was partitioned and shared to provide for the religious needs of Christians and Muslims. The situation lasted some 40 years until Abd ar-Rahman's conquest of southern Spain (756).\nTaxation\nAn early governor (wali) of al-Andalus, al-Hurr ibn Abd al-Rahman al-Thaqafi, spread the rule of the Umayyad Caliphate up to the Ebro Valley and the northeastern borders of Iberia, pacifying most of the territory and initiating in 717 the first forays across the Pyrenees into Septimania. In addition, he laid out the foundations of Umayyad civil administration in Iberia, by sending civil administration officials (judges) to conquered towns and lands guarded by garrisons established usually next to the population nuclei.\nMoreover, al-Hurr restored lands to their previous Christian landowners, which may have added greatly to the revenue of the Umayyad governors and the caliph of Damascus, by increasingly imposing the vectigalia on the former, a tax that was applied on a specific region or estate, not per capitation (jizya). Only non-Muslims were subject to taxation, apart from a Muslim subject's compulsory alms-giving. The task of establishing a civil administration in conquered al-Andalus was essentially completed by Governor Yahya ibn Salama al-Kalbi 10 years later.\nThe period following al-Hurr's office saw the establishment of the Arabs in southern Septimania during Al-Samh ibn Malik al-Khawlani's tenure as wali. Narbonne fell (720), and no sooner had he garrisoned it than the Arab commander led an offensive against Toulouse. During this Umayyad thrust or its aftermath, King Ardo died (721).\nEthnic groups and rise of conflicting internal tensions\n, and Septimania just after its conquest by Pepin (760)]]\nIn the first stage of the invasion, the armies were made up of Berbers from northern regions of North Africa, together with different groups of Arabs from Western Asia. The Berbers were usually in charge of the rugged terrains, similar to the ones found in their North African homeland, while the Arabs occupied the gentler plains of southern Iberia. Following the conquest land and rule distribution had taken place on tribal basis. Notable military leaders came to include Berbers in their ranks, such as Tariq Ziyad who is credited with much of the strategy of conquering Al-Andalus.\nConsequently, the Berbers went on to stations in Galicia (possibly including Asturias) and the Upper Marches (Ebro basin), but these lands remained unpleasant, humid and cold. The grievances resented by the Berbers under Arab rulers (attempts to impose a tax on Muslim Berbers, etc.) sparked rebellions in north Africa that expanded into Iberia. An early uprising took place in 730 when Uthman ibn Naissa (Munuza), master of the eastern Pyrenees (Cerretanya), allied with the duke Odo of Aquitaine and detached from Cordova.\nThe internal frictions continually threatened (or sometimes may have spurred) the ever-expanding Umayyad military effort in al-Andalus during the conquest period. Around 739, on learning the news of Charles Martel's second intervention in Provence, Uqba ibn al-Hajjaj had to call off an expedition to the Lower Rhone to deal with the Berber revolt in the south instead. The following year, the Berber garrisons stationed in León, Astorga and other north-western outposts gave up their positions, and some of them even embraced the Christian religion. The Muslim settlement was thereafter established permanently south of the Douro's banks.\nThe Berber rebellions swept the whole of al-Andalus during Abd al-Malik ibn Katan al-Fihri's term as governor. Reinforcements were then called from the other end of the Mediterranean in a military capacity: the Syrian  . The Berber rebellions were quelled in blood, and the Arab commanders came up reinforced after 742. Different Arab factions reached an agreement to alternate in office, but this did not last long, since Yusuf ibn 'Abd al-Rahman al-Fihri (opposed to the Umayyads) remained in power up to his defeat by Abd al-Rahman I in 756, and the establishment of the independent Umayyad Emirate of Cordova. It was in this period of unrest that the Frankish king Pepin finally captured Narbonne from the Andalusians (759).\nIn Yusuf's and Abd-ar-Rahman's fight for power in al-Andalus, the Syrian troops, a mainstay of the Umayyad Caliphate, split. For the most part, Arabs from the Mudhar and Qais tribes sided with Yusuf, as did the indigenous (second- or third-generation) Arabs from northern Africa, but Yemeni units and some Berbers sided with Abd-ar-Rahman, who was probably born to a North African Berber mother himself. By 756, south and central al-Andalus (Cordova, Sevilla) were in the hands of Abd-ar-Rahman, but it took another 25 years for him to hold sway over the Upper Marches (Pamplona, Zaragoza and all of the northeast).\nAftermath and consequences\nThe Iberian Peninsula was the westernmost tip of the Umayyad Caliphate of Damascus and was under the rule of the governor of Ifriqiya. In 720, the caliph even considered abandoning the territory. The conquest was followed by a period of several hundred years during which most of the Iberian peninsula was known as al-Andalus, dominated by Muslim rulers. Only a handful of new small Christian realms managed to reassert their authority across the distant mountainous north of the peninsula.\nIn 756, Abd al-Rahman I, a survivor of the recently overthrown Umayyad dynasty, landed in al-Andalus and seized power in Cordova and Seville, and proclaimed himself emir or malik, removing any mentions of the Abbasid Caliphs from the Friday prayers. In the wake of those events, southern Iberia became de jure and de facto independent from the Abbasid Caliphate. Although this was not accepted outside al-Andalus and those North African territories with which it was affiliated, Abd al-Rahman, and especially his successors, considered that they were the legitimate continuation of the Umayyad caliphate, i.e. that their rule was more legitimate than that of the Abbasids. It seems that Abd ar-Rahman never considered establishing a separate principality. (See Caliphate of Córdoba.)\nDuring the unification of al-Andalus in the reign of Abd ar-Rahman before his death in 788, al-Andalus underwent centralization and slow but steady homogenization. The autonomous status of many towns and regions negotiated in the first years of the conquest was reversed by 778, in some cases much earlier (Pamplona by 742, for example). The Hispanic Church based in Toledo, whose status remained largely undiminished under the new rulers, fell out with the Roman Church during the Adoptionist controversy (late 8th century). Rome relied on an alliance with Charlemagne (in war with the Cordovan emirs) to defend its political authority and possessions and went on to recognize the northern Asturian principality (Gallaecia) as a kingdom apart from Cordova and Alfonso II as king.\nsoldiers, taken from The Cantigas de Santa Maria]]\nThe population of al-Andalus, especially local nobles who aspired to a share in power, began to embrace Islam and the Arabic language. However, the majority of the population remained Christians using the Mozarabic Rite, and Latin (Mozarabic) remained the principal language until the 11th century. The historian Jessica Coope of the University of Nebraska–Lincoln argues that the pre-modern Islamic conquest was unlike Christianization because the latter was \"imposed on everyone as part of a negotiated surrender, and thus lacked the element of personal conviction that modern ideas about religious faith would require\", but the conquest of Dar al-Harb was motivated not by a goal of converting the population to Islam but by the belief that everyone was better off under Islamic rule.\nAbd ar-Rahman I founded an independent dynasty that survived until the 11th century. That line was succeeded by a variety of short and small emirates (taifas) unable to stop the push of the expanding northern Christian kingdoms. The Almoravids (1086–1094) and the Almohads (1146–1173) occupied al-Andalus, followed by the Marinids in 1269, but that could not prevent the fragmentation of Muslim-ruled territory. The last Muslim emirate, Granada, was defeated by the armies of Castile (successor to Asturias) and Aragon under Isabella and Ferdinand in 1492. The last wave of expulsions of Spaniards of Muslim descent took place in 1614.\nChronology\nAs discussed above, much of the traditional narrative of the Umayyad Conquest of the Iberian Peninsula is more legend than reliable history. Some of the key events and the stories around them are outlined below.\n* 710 – Tariq ibn Ziyad, a Berber mawla of Musa ibn Nusayr, lands with 400 men and 100 horses on the tiny peninsula now called Gibraltar (Jebel al Tarik : Mountain of Tariq), after his name.\n* 711 – Musa ibn Nusayr, Governor of Ifriqiya in North Africa, dispatches Tariq into the Iberian Peninsula.\n* 711 (19 July) – King Roderic's army utterly routed in the Battle of Guadalete somewhere in the Guadalquivir valley, and Roderic was killed in battle.\n* 712 – Musa ibn Nusayr joins Tariq after the Battle of Guadalete and both go on to attack towns and strongholds previously avoided. Abu Zora Tarif lands in Algeciras.\n* 713 – Theudimer's conditional surrender, allowing him to remain lord of his south-eastern region around Murcia (Tudmir).\n* 715 – Abd al-Aziz ibn Musa announces first wali of Andalus and marries the widow of King Roderick, Egilona. Seville becomes the capital.\n* 717–18 – Al-Hurr ibn Abd al-Rahman al-Thaqafi starts the first military campaigns into Gothic Septimania.\n* 719 – Al-Samh ibn Malik al-Khawlani, 4th wali, transfers the seat of Governor from Seville to Cordova. Barcelona and Narbonne captured.\n* 721 – An Umayyad army led by Al-Samh crushed by duke Odo's Aquitanian army at the Battle of Toulouse (\"Balat Al Shuhada\" of Toulouse).\n* 722 – An Umayyad patrol defeated by Pelagius at the Battle of Covadonga in the mountains of Asturias.\n* 725 – Anbasa ibn Suhaym Al-Kalbi subdues all Septimania, raids the Lower Rhone.\n* 731 – Munuza defeated in Cerdanya by Abdul Rahman Al Ghafiqi.\n* Spring 732 – An expedition led by the wali Al Ghafiqi vanquishes duke Odo at the Battle of the River Garonne.\n* October 732 – Al Ghafiqi totally routed by Charles Martel (Mayor of the Palace at the Merovingian court) at the Battle of Tours (\"Balat Al Shuhada\" of Poitiers).\n* 734 – Count Maurontus calls Umayyad forces on a military capacity into Arles, Avignon, and probably Marseille.\n* 740–42 – Berbers in northern Iberia (Galicia, Leon, Astorga, upper Ebro) give up their positions to join the Berber Revolts.\n* 743–757 – Alfonso I of Asturias raids the territory between the rivers Duero and Ebro but doesn't retain it.\n* 743 – Mudarites and Yemenites agree on choosing alternately one of their numbers each year to rule Al–Andalus.\n* 747 – Governor Yusuf ibn 'Abd al-Rahman al-Fihri, a Mudarite and descendant of Uqbah ibn Nafia, refuses to give turn to the Yemenite candidate and rules autonomously.\n* 755 – Rebellion in Zaragoza quashed, and Yusuf's detachment annihilated by the Basques near Pamplona.\n* 755 – Abd Al-Rahman Al Dakhel (\"Saqr Quraysh\") lands on the southern coast, taking in a quick succession Granada, Seville and Cordova.\n* 756 – After refusing to compromise with Yusuf, Abd ar-Rahman I independent Umayyad emir of Córdova. Yusuf defeated.\n* 759 – Narbonne captured by the Frankish king Pepin the Short.\n* 763 – Pro-Abbasid army defeated by Abd ar-Rahman I in Carmona.\n* 778 – Charlemagne repelled in Zaragoza by Muslim local lords.\n* 779 – Abd ar-Rahman I campaigns to the Upper Marches and subdues its main city, Zaragoza.\n* 781 – Pamplona and the Basque lords south of the Pyrenean fringes subdued. All of Al Andalus unified.\nSee also\n* Timeline of the Muslim presence in the Iberian peninsula\n* Muslim conquests in the Indian subcontinent\nReferences\nSources\n*"
    }
  ]
}