{
  "content": [
    {
      "type": "text",
      "text": "# MV Empire Cheer\n\n{|\nSunderland\n| Ship route =\n| Ship ordered =\n| Ship builder = William Doxford & Sons Ltd\n| Ship original cost =\n| Ship yard number = 702\n| Ship way number =\n| Ship laid down =\n| Ship launched = 9 March 1943\n| Ship completed = July 1943\n| Ship commissioned =\n| Ship decommissioned =\n| Ship christened =\n| Ship acquired =\n| Ship maiden voyage =\n| Ship in service =\n| Ship out of service = 8 December 1962\n| Ship identification = *Code Letters BFJJ\n*\n*United Kingdom Official Number 169115\n| Ship fate = Scrapped\n| Ship notes =\n}}\n*\n*10,073 DWT\n| Ship displacement =\n| Ship length =\n| Ship beam =\n| Ship height =\n| Ship draught =\n| Ship depth =\n| Ship decks =\n| Ship deck clearance =\n| Ship ramps =\n| Ship ice class =\n| Ship sail plan =\n| Ship power = 2SCSA engine\n| Ship propulsion = Screw propeller\n| Ship speed =\n| Ship capacity =\n| Ship crew =\n| Ship notes =\n| Ship armament =\n}}\n|}\nEmpire Cheer was a  cargo ship which was built in 1943 by William Doxford & Sons Ltd, Sunderland. She was built for the Ministry of War Transport (MoWT) and completed in July 1943. After the Second World War she was sold to her managers, Sir William Reardon Smith & Sons Ltd, who renamed her Cornish City. On 8 December 1962 she suffered an engine room fire, after which she was scrapped in March 1963.\nConstruction\nThe ship was built by William Doxford & Sons Ltd, Sunderland, as yard number 702. She was launched on 9 March 1943 and completed in July 1943.\nDimensions\nThe ship was  long, with a beam of  and a depth of . She had a gross register tonnage (GRT) of 7,297 and a net register tonnage (NRT) of 4,936. Her deadweight tonnage (DWT) was 10,073.\nEngine\nThe ship was propelled by a 2-stroke Single Cycle Single Action diesel engine, which had three cylinders of  bore by  stroke.\nHistory\nEmpire Cheer was built for the MoWT. She was placed under the management of Sir W Reardon Smith & Sons Ltd. The United Kingdom Official Number 169115 and the Code Letters BFJJ were allocated. Her port of registry was Sunderland.\nEmpire Cheer was a member of a number of convoys during the Second World War.\n;HX 305\nConvoy HX 305 departed New York on 25 August 1944 and arrived at Liverpool on 10 September. Empire Cheer was carrying general cargo bound for Methil and London.\n;MKS 97G\nConvoy MKS 97G departed Gibraltar on 25 April 1945 bound for the United Kingdom. Empire Cheer was carrying a cargo of wheat. She was fitted with an anti-torpedo net device.\nIn 1946, Empire Cheer was sold to Sir W Reardon Smith & Sons Ltd who renamed her Cornish City, the fourth Reardon Smith Line ship to carry that name. She served until 1962. On 8 December, the ship was in port at Aden when a fire broke out in her engine room, killing two of her crew.  Cornish City arrived at Hong Kong for scrapping on 7 March 1963.\nReferences"
    }
  ]
}