{
  "content": [
    {
      "type": "text",
      "text": "# MV Empire Cross\n\n{|\n|Ship name= Empire Cross\n|Ship namesake=\n|Ship owner= Ministry of War Transport\n|Ship operator= *1945: Hadley Shipping Co Ltd\n*1946: Anglo-Saxon Petroleum Co Ltd\n|Ship registry= *1945: Sunderland\n*1946: London\n|Ship route=\n|Ship ordered=\n|Ship builder= Sir James Laing & Sons Ltd, Sunderland\n|Ship original cost=\n|Ship yard number= 765\n|Ship laid down=\n|Ship launched= 28 June 1945\n|Ship sponsor=\n|Ship completed= November 1945\n|Ship maiden voyage=\n|Ship acquired=\n|Ship in service=\n|Ship out of service=\n|Ship identification= *UK official number 181112\n|Ship fate= *Exploded and sank 1946\n*Raised and scrapped 1952\n|Ship notes=\n}}\n*\n*\n|Ship displacement=\n|Ship length=\n|Ship beam=\n|Ship draught=\n|Ship depth=\n|Ship decks=\n|Ship power= 2,500 bhp\n|Ship propulsion= two-stroke diesel engine\n|Ship speed=\n|Ship capacity=\n|Ship crew=\n|Ship armament=\n|Ship sensors= *direction finding equipment\n*echo sounding equipment\n|Ship notes=\n}}\n|}\n'MV Empire Cross' was a motor tanker that was built in England in 1945. She was launched as an Empire ship for the Ministry of War Transport (MoWT). In 1946 she exploded and sank in Haifa in Palestine, killing 25 of her crew.\nBuilding and specifications\nSir James Laing & Sons Ltd built Empire Cross in its Deptford shipyard in Sunderland on the River Wear in County Durham. She was yard number 765. She was launched on 28 June 1945 and completed that November.\nEmpire Cross was an \"intermediate tanker\" for the MoWT. Her registered length was , her beam was  and her depth was . Her tonnages were ,  and .\nWilliam Doxford & Sons built her engine. It was a three-cylinder single-acting two-stroke diesel rated at 2,500 bhp.\nEmpire Cross had the UK official number 181112. Sources disagree as to whether her call sign was GDYW or GKLF.\nCareer\nThe MoWT appointed Hadley Shipping Co Ltd to manage Empire Cross. Hadley's registered her in Sunderland. In 1946 the MoWT transferred her management to Anglo-Saxon Petroleum, who transferred her registration to London.\nAnglo-Saxon is part of Royal Dutch Shell. In accordance with standard Shell practice, Anglo-Saxon planned to rename the ship after a genus of mollusc: in this case Balea. However, the ship was lost before she could be renamed.\nLoss\nOn 1 August 1946 Empire Cross arrived off Haifa in Palestine with a cargo of aviation spirit from Port Said in Egypt. On 2 August the ship was discharging her cargo in Haifa Roads. At the same time two Royal Navy destroyers,  and , were operating nearby. Empire Crosss Master, John Banks, heard the explosion of depth charges dropped by the destroyers to deter Haganah frogmen from trying to attach limpet mines to ships.\nEmpire Cross exploded and caught fire. Captain Banks gave the order to abandon ship. He dived overboard, swam under the flames until he lost consciousness, and was rescued by members of Haganah. Venus and Virago rescued other survivors. Between 30 and 40 people were rescued. The burning tanker capsized and sank.\nFour people were found dead and 21 were listed as missing. The dead were reported to be nine of Empire Crosss British officers, 12 of her Lascar crew and four local Palestinian Arab labourers. Those dead whose bodies were found were buried at Haifa.\nSuspected causes\nA depth charge dropped by Virago was suspected of having caused the explosion. An inquest was held, at which the page in Viragos logbook for that day was found to be missing. However, the Admiralty dismissed the idea that a depth charge could have caused the explosion.\nThe news correspondent Clare Hollingworth, who at the time was in Palestine reporting for the News of the World, claimed that Haganah had blown up Empire Cross. A few days later a Haganah spokesman 'phoned the newspaper, denied the allegation, and accused Hollingworth of being \"biased and motivated by hatred\".\nSalvage\nIn 1952 Empire Crosss wreck was raised and scrapped.\nReferences\nBibliography\n*\n*"
    }
  ]
}