{
  "content": [
    {
      "type": "text",
      "text": "# MV Queen of Alberni\n\n{|\n| Ship name = Queen of Alberni\n| Ship namesake =\n| Ship owner = British Columbia Ferry Services Inc.\n| Ship operator = British Columbia Ferry Services Inc.\n| Ship registry =\n| Ship route = Tsawwassen  - Duke Point\n| Ship ordered =\n| Ship awarded =\n| Ship builder = Vancouver Shipyards, North Vancouver\n| Ship original cost =\n| Ship yard number =\n| Ship way number =\n| Ship laid down =\n| Ship launched =\n| Ship sponsor =\n| Ship christened =\n| Ship completed = 1976\n| Ship acquired =\n| Ship commissioned =\n| Ship recommissioned =\n| Ship decommissioned =\n| Ship maiden voyage = 1976\n| Ship in service =\n| Ship out of service =\n| Ship renamed =\n| Ship reclassified =\n| Ship refit =\n| Ship struck =\n| Ship reinstated =\n| Ship homeport =\n| Ship identification = *\n*\n*Callsign: CZ8100\n| Ship motto =\n| Ship nickname =\n| Ship honours =\n| Ship honors =\n| Ship captured =\n| Ship fate =\n| Ship status = ship in active service\n| Ship notes =\n| Ship badge =\n}}\nRORO ferry\n| Ship tonnage = 6,422\n| Ship displacement =\n| Ship length =\n| Ship beam =\n| Ship height =\n| Ship draught =\n| Ship draft =\n| Ship depth =\n| Ship hold depth =\n| Ship decks =\n| Ship deck clearance =\n| Ship ramps =\n| Ship ice class =\n| Ship power =\n| Ship propulsion = Two MaK 12M551AK\n| Ship speed =\n| Ship range =\n| Ship endurance =\n| Ship boats =\n| Ship capacity = *1,200 passengers &amp; crew\n*280 cars\n| Ship complement =\n| Ship crew =\n| Ship time to activate =\n| Ship sensors =\n| Ship notes = Amenities: Coastal Café cafeteria (featuring White Spot burgers and Bread Garden sandwiches), Passages Gift Shop, Video Zone video arcade, elevator, telephones, showers, washroom for people with disabilities, tourist information (brochures)\n}}\n|}\n'MV Queen of Alberni' is a  that operates between Tsawwassen and Duke Point in British Columbia as part of the BC Ferries fleet.\nConstruction and operation\nQueen of Alberni was built by Vancouver Shipyards Co. Ltd in North Vancouver, British Columbia, in 1976. She joined two other  ferries built in that year, Queen of Coquitlam and Queen of Cowichan. Two additional C-class ferries, Queen of Surrey and Queen of Oak Bay, were built in 1981.\nQueen of Alberni differed in design from other Cowichan class vessels, as it only had one vehicle deck designed to carry semi-truck traffic between Vancouver and Victoria. The lack of an upper car deck limited its capacity at 145 vehicles. In 1984, the ship was stretched and lifted, gaining an upper car deck for non-overheight vehicles, leading to a new vehicle capacity of 280. Eventually the ferry's high semi-truck capacity made it a natural fit for the service's Mid-Island Express route between Tsawwassen and Departure Bay (later changing from Tsawwassen to Duke Point), which was intended as a high volume route of overheight vehicles. The Queen of Alberni services the Horseshoe Bay to Departure Bay route, also served by the Queen of Cowichan and the Queen of Oak Bay, as well as the Tsawwassen to Duke Point. In 1999, the ship underwent a further refit in Victoria.\nThe ship has a different system of ship evacuation since it carries fewer passengers. All of the lifejackets are stored in large containers scattered throughout the two passenger decks. The ship has two evacuation stations on each side of the passenger deck. The combined capacity of these four stations is 1,200.\nIn 2007, Queen of Alberni completed a 40 million dollar mid-life upgrade which will prepare the 31-year-old vessel for another 20 years of service.\nAccidents\n1979 grounding\nOn August 9, 1979, the Queen of Alberni was operating on Route 1 between Tsawwassen and Swartz Bay. Shortly after 7a.m., as she negotiated the busy waters of the Active Pass at high speed, she ran aground on Galiano Island. All 93 passengers and 21 crew were evacuated and transferred by local pleasure craft and water taxi boats to the Queen of Tsawwassen. At around noon that day, at low tide, the vessel tipped as much as thirty degrees to port, which caused vehicles onboard to slide and pile onto each over.\nFourteen hours after the ordeal, at 9pm, the Alberni was towed away by five tugs at the stern and two at the bow. She was drydocked for repairs. All persons survived; however, Gun Music, a horse who had won a race the previous night in Vancouver and who was being transported onboard, died. As a result of this accident, all C-Class ferries were suspended from travelling on Route 1 or any of the Southern Gulf Islands routes due to their difficulty to be maneuvered when moving at high speeds.\nIn June 1989, the vessel slammed into the loading dock at Departure Bay at about eight knots. Six people sustained slight injuries, including one who fell down a stairway. The ship received a scrape and some onboard vehicles were damaged.\nAnother accident would come on March 12, 1992. At around 8:00am, Queen of Alberni left the Tsawwassen terminal with heavy fog and almost zero visibility. The Japanese bulk carrier Shinwa Maru left the Westshore Terminal No. 1 at nearby Roberts Bank, British Columbia at 7:40am. At 8:06am, the two ships made radio contact after seeing each other on radar to arrange a safe passage. At 8:08am, the two vessels collided. Queen of Alberni hit Shinwa Maru about  aft of the bow,  above the waterline, and at a 70-degree angle. Two people aboard Queen of Alberni were seriously injured, while none aboard Shinwa Maru were injured. Queen of Alberni had minor damage to the hull and some of the cafeteria equipment was displaced. Shinwa Maru, however, was damaged when the ferry penetrated the #1 cargo hold and ballast tanks.\nOn December 15, 2001, Queen of Alberni got caught in a heavy wind storm which turned a regular 2-hour crossing into a -hour ordeal.\nReferences"
    }
  ]
}