{
  "content": [
    {
      "type": "text",
      "text": "# MV Queen of the Islands\n\n{|\nVictoria, Canada\n|Ship route=*Tsawwassen–Southern Gulf Islands\n*Comox–Powell River\n*Earls Cove–Saltery Bay\n*Horseshoe Bay–Langdale\n|Ship ordered=\n|Ship builder=Burrard Drydock Co. Ltd.\n|Ship original cost=\n|Ship yard number=\n|Ship way number=\n|Ship laid down=Dec. 28, 1962\n|Ship launched=May 9, 1963\n|Ship completed=\n|Ship christened=\n|Ship acquired=\n|Ship maiden voyage=Jul. 4, 1963\n|Ship in service=\n|Ship out of service=1987\n|Ship identification=*\n*Callsign: VCGX\n|Ship fate=Sold, Oct. 1991\n|Ship status=Laid up\n|Ship notes=\n}}\n|Ship beam=\n|Ship height=\n|Ship draft=\n|Ship depth=\n|Ship decks=\n|Ship deck clearance=\n|Ship ramps=\n|Ship ice class=\n|Ship sail plan=\n|Ship power=\n|Ship propulsion=\n|Ship speed=\n|Ship capacity=*483 passengers\n*40 vehicles\n|Ship crew=\n|Ship notes=\n}}\n|}\n'M/V Queen of the Islands' was a RORO ferry operated by BC Ferries between 1963 and 1991. Although the passenger areas provided for an enjoyable travel experience for the general public, she was much maligned by the crews that worked on her, and the Queen of the Islands quickly garnered a reputation as being one of the most unloved ships ever to have operated with BC Ferries.\nHistory\nThe Queen of the Islands was built by the Burrard Drydock Co. Ltd. in North Vancouver in 1963.\nQueen of the Islands entered service in 1963 on the then new Route 9, which operates between Tsawwassen, Galiano Island, Mayne Island, Pender Island and Salt Spring Island. Her career got off to an inauspicious start when she suffered a mechanical failure en route to her inaugural celebrations at Ganges, Salt Spring Island, and had to be towed into port, far behind schedule. Given the nature of Route 9, with cars getting off and on at multiple ports, and always at opposite ends of the ship, loading the vehicle deck often became a nightmarish jigsaw puzzle for the crew. If vehicles were not loaded in a very precise manner, then a severe list would quickly develop.  The list was severe enough that the vessel was not allowed to sail if waves were greater than five feet.  The Queen of the Islands was taken off of Route 9 in 1969, as expansion of the fleet had freed up vessels that were much better suited for the demands of the route.\nFollowing her removal from Route 9, she found temporary work with the Ministry of Highways ferry system, providing additional sailings between Comox and Powell River during the summer months.  This arrangement would stay in place until 1976, when the Sechelt Queen was transferred on a permanent basis from BC Ferries to the Ministry of Highways fleet.  While she was on loan she had her funnel repainted in the buff colour of the Ministry of Highways.\nAfter her services were no longer required between Comox and Powell River, the Queen of the Islands once again found a summer home providing additional service between Earls Cove and Saltery Bay.  During the latter part of her career with BC Ferries, the Queen of the Islands was used as a relief vessel, filling in for other ships while they were in refit.  Between 1979 and 1982, she could also be found providing additional service on Route 3 between Horseshoe Bay and Langdale during the busy summer months, or when the regular vessels went in for refit.  However, by the early 1980s, more and more of her time was spent laid up, and by 1987 she was no longer seeing any sort of service with BC Ferries.\nShe was sold in October 1991 for $375,000 to St. John's Fishing Lodge Ltd., and was converted into a floating fishing camp.  During this conversion process her engines were removed, thus making her reliant on tugs to be moved around.  St. John's Fishing Lodge Ltd. fell into bankruptcy in November 2008, and the Queen of the Islands was subsequently put up for sale.\nToday\nIn June 2009, the Queen of the Islands was sold to a private businessman from North Vancouver and renamed the \"Spirit of the Nation\" in honour of the Squamish Nation, in whose waters she sits. She is permanently moored in Mosquito Creek Marina near the SeaBus terminal on the North Shore and has undergone extensive renovation converting it into a wedding and event venue allowing people to have a \"supernatural\" BC event or wedding without having to leave the conveniences of the city.\nReferences\nExternal links\n*[http://www.evergreenfleet.com/beferriesretired2.html The Retired Vessels of B.C. Ferries]"
    }
  ]
}