{
  "content": [
    {
      "type": "text",
      "text": "# MV Sechelt Queen\n\n{|\n|+Chinook\n| Ship launched = 22 April 1947\n| Ship sponsor =\n| Ship christened =1947\n| Ship completed =1947\n| Ship acquired =\n| Ship commissioned =\n| Ship recommissioned =\n| Ship decommissioned =\n| Ship maiden voyage =\n| Ship in service =\n| Ship out of service =\n| Ship renamed =\n| Ship reclassified =\n| Ship refit =\n| Ship struck =\n| Ship reinstated =\n| Ship homeport =\n| Ship identification =\n| Ship motto =\n| Ship nickname =\n| Ship honors =\n| Ship captured =\n| Ship fate = Officially scrapped in 1997, hull split up in 2001\n| Ship notes =\n| Ship badge =\n}}\n|}\n'MV Chinook' was a luxury automobile ferry designed by William Francis Gibbs, that operated between Seattle, Port Angeles and Victoria under the ownership of Puget Sound Navigation Company.\nMV Chinook was built in 1947 by Todd Shipyard, in Seattle, and entered service with Puget Sound Navigation Company. Upon entering service the vessel proved to be quite successful. But by the time the vessel had entered service, Black Ball Line was undergoing fare cuts, worker strikes, and other problems. In 1950 Washington State purchased Puget Sound Navigation Company. The State of Washington took over its operations in 1951, the Chinook was still occasionally seen departing Coleman Ferry Dock for trips to Port Angeles and Victoria.\nThe vessel was removed from the route in 1954 and transferred to Black Ball Ferry Line. In 1955 the vessel was moved into Esquimalt Greaving Dock for annual refit. The refit however was much more extensive and included modifications to the Chinook's bow to allow bow loading. The vessel's state rooms were also removed during the refit. Later that year the vessel was moved to the Black Ball Lines the Horseshoe Bay - Nanaimo run alongside the MV Kahloke. Shortly after obtaining a Canadian Registry, it was discovered that another vessel with a Canadian registry was named Chinook, Black Ball finally decided to change the MV Chinook name by adding the Roman numeral II to the end.\nBy 1960 Black Ball line was facing a massive labor crisis, and there was little that could be done. A year later in 1961, Black Ball Line is purchased by the newly founded British Columbia Ferries Corporation. The vessel remained on the Horseshoe Bay - Nanaimo run until 1963, when the vessel was briefly moved to the Tsawwassen-Swartz Bay (Vancouver-Victoria) route. In September of that year the vessel was moved back to the Horseshoe Bay - Nanaimo route, before being moved to the Horseshoe Bay-Langdale route. That same year the vessel was remained to MV Sechelt Queen.\nIn 1968 Sechelt Queen was moved to the Tsawwassen-Southern Gulf Islands route to replace the poorly designed MV Queen of the Islands. That same year an extensive overhaul occurred and the remaining staterooms were converted into passenger lounges. The promenade deck was also converted in the refit. The vessel would continue to service this route until BC Ferries finally sold the vessel in 1976. The vessel quickly proved to be useful in other parts of British Columbia. The Ministry of Transportation and Highways began operating her on the Powell River-Comox run for the next six years. In 1982 the vessel had become too\nsmall to operate the run and the vessel was sold to Seaworld Processors, Inc. The vessel sat on the Fraser River and Burrard inlet for the next ten years.\nIn the early 80s the vessel was returned to an American registry, the vessel was once again renamed to Muskegon Clipper. Initially the vessel was going to service a route in Milwaukee, but the vessel was once again moved, this time the vessel was moved to Eagle Harbor, Washington. At the Washington State Ferries shipyard the ship was inspected and it was discovered that the vessel could return to operating on the international run to Sidney, BC. The vessel was still quite sea worthy and its bow doors, were perfect for crossing the potentially stormy Haro Strait. However the vessel was almost 50 years old, the engines were outdated, and there was a large Asbestos problem onboard. Washington State Ferries decided not to refit the aging vessel.\nIn 1994 the vessel was sold to Monarch Casinos, the company had the idea of converting the vessel into a gambling river boat outside of Gary, Indiana. The vessel was towed from Seattle to San Diego, California. The vessel briefly stayed in San Diego before being towed to a shipyard in Mobile, Alabama. While en route to Alabama the vessel's captain ordered a unique asbestos abatement method – onboard crews loaded asbestos into plastic bags before dumping them into the Gulf of Mexico. The captain was sentenced to 2 years in federal prison for violating international pollution laws.\nAfter arriving in Alabama the vessel was unofficially renamed Monarch. The rebuilding of the vessel began, the ferry was stripped down to the hull. Monarch Casinos failed to get a gambling licence in Alabama, meanwhile the vessel was a financial disaster. The vessel was auctioned in 1996, and was listed as \"Disposed of\". In 2001 the vessel was officially listed as \"disposed of\" and that the vessel's hull had been broken up at that time.\nReferences\nExternal links\n* [https://digitalcollections.lib.washington.edu/digital/collection/transportation/id/2117/ Images of the MV Chinook from University of Washington Libraries]"
    }
  ]
}