{
  "content": [
    {
      "type": "text",
      "text": "# My Brother's War\n\n| narrator       =\n| music          =\n| cinematography =\n| editing        =\n| studio         = Concorde Anois\n| distributor    = New Horizons\n| released       =\n| runtime        = 94 minutes\n| country        = United States\n| language       = English\n| budget         = $1.1 million\n| gross          =\n}}\n'My Brother's War (also known as Flashpoint') is a 1997 American film directed by and starring James Brolin.\nIt was filmed in Ireland for Concorde Anois.\nPlot\nIn Northern Ireland, brothers Gerry and Liam are members of the Provisional Irish Republican Army. In the wake of the peace process, Gerry wants to follow ethical principles, while Liam knows no limits; this leads them to a divide and Liam forms a splinter group. A CIA agent and the support of Mary will force Gerry to stop his brother.\nCast\n*Jennie Garth as Mary Fagan Bailey\n*James Brolin as John Hall\n*Patrick Foy as Gerry Fallon\n*Salvator Xuereb as Liam Fallon\n*Gary Cooke as  Brian Fagan\n*Tony Boston as Aidan\n*Seamus Fox as Bobby\n*Lesley Conroy as Frances O'Brien\n*Emma O'Neill as Sinead\n*Josh Brolin as Pete\n*Mike Regan as Michael Fallon\n*Conal O'Fatharta as 12-year-old Gerry\n*Michael McNally as 8-year-old Liam\n*Cristi Conaway as Kelly Hall (as Kristi Conaway)\n*Craig Warnock as Conal Byrne\n*John Slattery as Devlin\n*Bill Murphy as Paddy\nProduction\nThe film was shot in Ireland.\nBrolin was visited during filming by his then girlfriend Barbra Streisand. \"I really wanted to support Jim, because I knew how difficult it was to direct a movie that you're in,\" Streisand said. \"I had been with men who were not so supportive when I was doing a movie. So I really wanted to give him what I felt I didn't get. I would get up at 5 and give him breakfast and help him through that ordeal. It was just a very loving intimate experience to live in a house with a thatched roof.\"\nReception\nIn his book The IRA on Film and Television: A History, Mark Connelly cites the film as one of the films featuring the IRA that presents its acts as belonging to a \"splinter\" group at odds with the \"official\" IRA in an attempt to avoid political commentary, which Connelly argues \"grant[s] a cloak of legitimacy to the IRA by blaming violence and extremism on lone malcontents.\"\nAwards\nThe film was named Best Feature Film with a budget over $1 million at the 1997 Hollywood Film Festival.\nSee also\n* Patriot Games\nReferences\nExternal links\n*\n*"
    }
  ]
}