{
  "content": [
    {
      "type": "text",
      "text": "# My Girlfriend Is the President__disambig_1\n\n|designer  =\n|series    =\n|engine    = KiriKiri\n|released  =\n|genre     = Eroge, Visual novel\n|modes     = Single Player\n|platforms = Microsoft Windows\n}}\nOsananajimi wa Daitouryou: My Girlfriend Is the President (幼なじみは大統領: MY GIRLFRIEND IS THE PRESIDENT Osananajimi wa Daitōryō: Mai Gārufurendo Izu za Purejidento) is a visual novel developed by Alcot and later released in English by JAST USA. The game centers on protagonist Junichiro Hondo who awakes one morning to discover his next-door-neighbor and lifelong friend Yukino Ohama has suddenly become president of the fictitious United States of Nippon (Japan).\nGameplay\nThe player assumes the role of Junichiro Hondo, alike a typical visual novel, the amount of game play is minimal. Occasionally interactions in the game are required to progress to the proceeding scene, by selecting one of the options/choices that appear in the center of the screen. Usually they are choices about what action to elect, depending on the players decision there are multiple endings. There are four main plot lines, each one resolving around the relationship of Junichiro and the heroine. The various routes resolve around the relationship between Junichiro and the heroine of choice. Most of the gameplay is spent reading the text along the bottom, with a character sprite or event CG supporting it.\nPlot\nStory\nAn alien spacecraft controlled by Ku Little Little launches into Earth, destroying the headquarters of the government of Nippon. To avoid chaos, the extraterrestrials brainwash the populace into the belief that Junichiro's childhood friend Yukino Ohama is leader of the country of Nippon. For some reason, the brainwashing does not affect Junichiro himself.\nSettings and Locations\nThe majority of the game's events and scenarios occur in the United States of Nippon, which is being controlled by Yukino, who was brainwashed to believe she is the president. The Snow House is ostensibly Yukino's home, however it is actually the camouflaged body of Starship Ezekiel. The Flare House is similar to the Snow House except it is sustained and kept by Irina Vladimirovna Putina, the president of Rusia. Lez Star is considered to be the largest and most powerful ship in the game, and it is the headquarters of Guardian and its members. Guardian is a fictional affiliation maintained by the extraterrestrials, the main antagonist, Joseph Soma Mirange, leads Guardian and opposes the protagonists along with Starship Jeremiah and occasionally Kuon.\nCharacters\n;\nJunichiro Hondo is the story's protagonist. His actions tend to revolve around supporting Yukino, when not sexually harassing females. An incident earlier in his life resulted in his body's reconstruction, providing him with more power, having a memory that exceeds an ordinary person's, and an excessively tough body. For some reason, he remembers the original world before his childhood friend became president. His personality is that of a sociable, bright, and unabashed pervert with an honest heart. He likes girls and often gets beat up for his sexual harassment. Contrary to his usual playful attitude, he has a strong sense of justice and responsibility, acting with the belief of \"I can do it!\" and \"This happens all the time in Hollywood.\" He is a parody of Junichiro Koizumi.\n;\n:\nYukino Ohama, arguably the most iconic character, is Junichirō's neighbor and childhood friend who was selected to be president of Nippon after the accidental destruction of the previous administration. She has a brainwashing device embedded in her body, turning the world into one where the left becomes right if she says it is. Her approval ratings climb rapidly due to her looks, personality and the brainwashing effects. She even has a fan club among the government officials. She is also known to love anime and manga making her supporters to call her ‘Your Excellency’. She is a daughter of doctors, good at sports, and has excellent grades. Even with that, she isn't boastful about it, and has a modest and gentle personality. Although she wears the mask of a prim and proper high-class lady, but is clumsy and spoiled in her private life. She is also an extremely shy person, fretting over messing up her lines and blushing during speeches. Since she set forth the \"Jun-kun Supremacy Doctrine\" and has a troublesome side of passing crazy laws for the sake of love, disputes between Junichiro and the bureaucrats never die out. Junichiro embarrasses her often with perverted comments, that causes her to blush more than mildly. Sometimes she pretends to be a dog and plays around with Junichiro which leads to Irina lecturing them. She is a parody of Barack Obama.\n;\n:\nIrina Vladimirovna Putina is an active duty president who reigns over \"Rusia\" (Russia) with super charisma. She obtains information that a UFO crashed into Nippon, and visits to talk about laws dealing with import restrictions. On the day of her visit, Irina is seen assaulting a strange man and when she strikes back, Junichiro rescues her, which causes her to become dumbstruck. As it turns out, the man placed a bomb in the building because he suspected something similar to this may happen, so Junichiro escapes with Irina heroically and afterwards she exposes her gratitude. She later visits the Snow House as a guest of Yukino and is able to recognize James Hondo (Junichiro gave her a fake name when they first met), she hugs him to everyone's shock and tells him to become her husband. Yukino makes matters worse by stating that Jin is to be her First Gentleman; a huge scandal erupts as the two women argue over Jin. She becomes interested in him ever since, making an appearance at his school as a transfer student while handling government affairs. However, she becomes disillusioned by the protagonist, the great king of sexual harassment. She disciplines him with her slapping fan to make him into a gentleman even to this day. As a disciplinarian in school, correcting the behavior of the students is her daily routine. She fosters a rivalry against the childhood friend president who's also the head of the student council, and seems to have plans to correct the entire school as a disciplinarian. Yukino and her friends nicknamed her Puchin, but she gets mad when they call her that. She is a parody of Vladimir Putin.\n;\n: (aka Oma Ichimura)\nStarship Ezekiel (called \"Ell\") is a state-of-the-art UFO designed to take the appearance and actions of a young girl whilst upholding the task of protecting the other characters. Ell has a very obedient and earnest personality, she does whatever is necessary to fulfill the task that she is given and does whatever she can to protect the other members of the cast. However, being such an honest girl causes her to become very depressed when she fails at a task and she usually resorts to placing herself in a box while emitting a depressed aura. It is noted that after crashing on Earth she developed a fear of heights. Her identity is made top secret, and she protects the president and her cabinet as an SP agent in government. She has a tendency to be quiet and shy of strangers and a girl that leaves a fleeting impression in some respects. She can be a natural airhead that takes jokes seriously and does hysterical things. She chooses to get close to Junichiro and take care of him in order to understand the love that's awakening inside of her. Due to having limited knowledge pertaining to sex, she obediently receives Junichiro's sexual harassment. Ell is the younger sister of Starship Jeremiah, better known as Remi, the two share a rivalry because Remi is jealous that her creator Ku Little Little seems more prideful of her newer creation Ell than herself. Her design and personality (as well as artificial nature) are very similar to Hatsune Miku.\n;\n:\nRan Miyoshi is chief of staff of Nippon as well as an older mentor-like character to Junichirō. She is also a childhood friend of the Junichirō who lives near his house, and is one year older. Whenever she has time off, she often comes over to look after the Junichirō or Yukino, whose parents are seldom at home. As a mysterious woman with an obscure private life, she also works part-time at a Chinese restaurant while serving as Yukino's Chief of Staff. She is the former student council president, currently undertaking the role of student council advisor. She constantly provides various intelligence by making use of her wide connections. She is the person that recommended Yukino to become student council president. She mostly takes care of domestic affairs, and the president and internal staff depend on her. She gives instructions to the staff while serving them her delicious Chinese cuisine. Out of the main female cast, Ran has the largest bust size.\n}}\nExternal links\n*[https://web.archive.org/web/20130812131655/http://www.jastusa.com/president/index.html Official website at jastusa.com]\n*"
    }
  ]
}