{
  "content": [
    {
      "type": "text",
      "text": "# My Kind of Blues (B. B. King album)\n\n| recorded   = 1958 or 1960\n| genre      = Blues\n| length     =\n| label      = Crown\n| producer   =\n| prev_title = King of the Blues\n| prev_year  = 1960\n| next_title = More B.B. King\n| next_year  = 1961\n}}\nMy Kind of Blues is the seventh studio album by American bluesman B.B. King. According to biographer David McGee, the songs were recorded in 1958 at the Chess Records studios in Chicago.  However, researcher Colin Escott identifies the recordings as being from a March 3, 1960, session, when King was under contract to the Bihari brothers and recorded in the Los Angeles area.\nThe Bihari's budget Crown Records issued the album in 1960. The liner notes contained a blurb about King's \"particular form of jazz... blues-belter extraordinary\" and little else. McGee notes that King is backed by a small combo composed of pianist Lloyd Glenn, bassist Ralph Hamilton, and drummer Jessie Sailes (most of King's recordings at the time included a horn section).\nThree singles from the album were released by the Bihari's Kent Records; \"Walkin' Mr. Bill\" reached number 23 on Billboard's Hot R&B Sides chart in October 1960. In 2003, My Kind of Blues was reissued on CD by Ace Records with eight bonus tracks.\nCritical reception\n|rev2 = The Penguin Guide to Blues Recordings\n|rev2score  =\n}}\nIn a review for AllMusic, critic George Bedard called it \"a masterpiece: a sparse, uncluttered sound with nothing to mask King's beautiful guitar and voice.\" The Penguin Guide to Blues Recordings deemed it \"one of the great B.B. King albums.\"\nTrack listing\nThe original Crown LP and many reissues do not list the songwriters, producers, nor running times. Details are taken from the AllMusic review and may differ from other sources.\nJoe Bihari\n| length1   = 5:15\n| title2    = Mr. Pawnbroker\n| writer2   = King, Jules Taub a.k.a. Jules Bihari\n| length2   = 3:16\n| title3    = Understand\n| writer3   = Cecil Gant\n| length3   = 2:39\n| title4    = Someday Baby\n| writer4   = Lightnin' Hopkins\n| length4   = 2:54\n| title5    = Driving Wheel\n| writer5   = Roosevelt Sykes\n| length5   = 2:52\n}}\nReferences\nSources\n*\n*\n*\n*"
    }
  ]
}