{
  "content": [
    {
      "type": "text",
      "text": "# My Sad Republic\n\nMy Sad Republic is a 2000 Philippine English-language novel written by Filipino novelist Eric Gamalinda.  The novel won for Gamalinda a Philippine Centennial Literary Prize in 1998. The 392-page novel was published by the Philippine Centennial Commission, the University of the Philippines Press, and the UP Creative Writing Center.  My Sad Republic is the fourth novel written by Gamalinda. The theme of the novel is \"love, obsession, and loss\" occurring during the Philippine Revolution against the Spanish colonial regime of the Philippines, and during the Philippine–American War.\nOrigin of the title\nThe title of My Sad Republic was derived from a verse in Florante at Laura, a classic narrative poem written by Filipino poet Francisco Baltazar (1789–1862) that intertwines romance and nationalism. The verse from which the title was adapted from mentions the Tagalog words ''\"Sa loob at labas ng bayan cong saui,/ caliluha,i, siya'ng nangyayaring hari/\", meaning \"Inside and outside of my sad country'',/ it is desolation that reigns supreme/\" in the English translation.\nCharacters\nThe main characters in the novel include Dionisio Magbuela (also known as Isio, Papa Isio – meaning \"Pope Isio\", or Seguela, the \"Pope of Negros\"), Asuncion de Urquiza (also known as Asuncion Madrigal), Tomas Agustin, Felipe, Captain James Smith, and Martinez.  Dionisio Magbuela is a peasant, healer, mystic, and religious leader, who later becomes a Filipino revolutionary, hero, and founder of a cult of babaylans (shaman-priests) based on folk Catholicism.\nAsuncion de Urquiza is a young woman under the care of a wealthy lady known as Doña Madrigal (De Urquiza's mother); Asuncion is an orphan and is the illegitimate daughter of a Spanish matador and a young woman belonging to the Madrigal's household.  De Urquiza was described by Stuart-Santiago as a \"rich girl of One Hundred and Seventeen Names\" because the paranoid Doña Madrigal christened her with all the names of the Mary the Holy Virgin as a form of protection from evil.\nTomas Agustin is a mestizo landowner and soldier serving in the Spanish army who believes that his \"kind\" is the \"future of the Philippines\", a social class that will improve the political and socio-economic situation in the archipelago after three centuries of Spanish rule and mismanagement. Agustin wanted to marry Asuncion de Urquiza for the latter's wealth.\nFelipe is the son of Asuncion de Urquiza and Tomas Agustin. Felipe was born after Tomas Agustin raped De Urquiza.\nCaptain James Smith is an American soldier, leader of the American contingent. He is the American nemesis of Magbuela.\nMartinez is the right-hand man of Magbuela.  According to book reviewer Vicente G. Groyon III,  Martinez is the least remarkable yet the most memorable character in Gamalinda's My Sad Republic.\nDescription\nAs historical novel\nMy Sad Republic is a novel that blends fact and fiction based on events in Philippine history that occurred in Negros approximately from 1880 through 1911.  It is a novel that features the failed romantic aspirations and nationalistic yearnings of Dionisio Magbuela.  Magbuela aspires to bring the Philippines back to its pre-colonial status, a country that was never colonized by foreigners. Magbuela, as the Pope of Negros who is the \"Supreme Power of God's Republic\", wanted to give Negros back to the Negrenses (also known as Negrosanons), the native inhabitants and land-tillers of Negros.\nAs romance novel\nAs a romance novel, My Sad Republic, narrates the love triangle that occurred between Dionisio Magbuela, Asunción de Urquiza, and Tomas Agustin. Because of Magbuela's reputation as a healer and mystic, Magbuela is hired by Doña Madrigal as a resident plantation worker—a sugar cane cutter—who was given access to the mansion by Doña Madrigal. Magbuela meets Asuncion and courts her. Asuncion is falling for Magbuela's affection but Tomas Agustin—the landowning mestizo—rapes Asuncion, resulting to her pregnancy.  Asuncion marries Agustin because of the pregnancy. Asuncion gives birth to a son, a boy named Felipe. After the defeat of the Spaniards during the Philippine Revolution, Magbuela and his followers' triumph was short-lived because of the arrival of the Americans, the new colonizers of the Philippines. Magbuela and his fellow revolutionaries are now confronted with two enemies—the Americans and the Filipino landowners (locally known as the hacenderos, meaning \"hacienda owners\"), who are willing to collaborate with the Americans for their interests and benefit.  Tomas Agustin becomes a General, who—together with other landowners—wanted the island of Negros to be separated from the rest of the Philippine archipelago to become a territory of the United States and be known as the Cantonal Republic of Negros.\nAs political novel\nAccording to literary critic Vicente G. Groyon III, one of the most salient scenes in My Sad Republic is when Magbuela finds a copy of the Declaration of Independence of the United States through a Spanish friar, making Magbuela believe that the American occupiers will comprehend the reasons why he is fighting for the Negros Island's and the Philippines' own independence.\nAs erotic novel\nIn My Sad Republic, Gamalinda incorporated the genre of erotica such as what Angela Stuart-Santiago described as a \"dash of friar erotica\" (also known as \"priest erotica\") witnessed during the diminishing decades of the rule of the Spanish friars in the Philippines. Gamalinda described the love scene between a Spanish parish priest nicknamed Padre Batchoy and a native lass as if the friar was inserting a sacred host into the lips of a native girl's sex organ. There was another love scene—during a secret rendezvous between the novel's hero Magbuela and his beloved De Urquiza—wherein (according to Stuart-Santiago) De Urquiza did a \"strange thing\", lifting her a head a little to give Magbuela a prolonged bite on the hard and firm muscle located above Magbuela's collarbone, as if De Urquiza wanted to remain forever connected to Magbuela's body.\nAnalysis\nBook critic Angela Stuart-Santiago compared the reading of My Sad Republic to reading Colombian novelist Gabriel García Márquez's One Hundred Years of Solitude and Chilean novelist Isabel Allende's The House of Spirits because of Gamalinda's style of combining fact and fiction. Stuart-Santiago described My Sad Republic as a rare Philippine novel that tackles the events during the Philippine–American War viewed through the eyes of the defeated, subdued, subjugated, and colonized Filipino people, and not through the point of view of triumphant foreigners and colonizers. Stuart-Santiago further reiterated that the author of My Sad Republic wrote the novel in \"marvelous Philippine English\", a language of \"misery and sorrow\" which has similarities to the characteristics of other native languages of the Philippines, which are languages and dialects that \"a hundred years ago\" had been \"exorcised\"—suppressed or almost brought into extinction - —by the English language rooted from the United States and the United Kingdom.\nReferences"
    }
  ]
}