{
  "content": [
    {
      "type": "text",
      "text": "# Mygdon (king of Phrygia)\n\nIn Thracian mythology, King Mygdon (Ancient Thracian: Μύγδων in Greek; gen.: Μύγδονος) of Phrygia, was a son of Acmon and father of Coroebus by his wife Anaximene.\nMythology\nMygdon led a force of Phrygians against the Amazons alongside his aides Otreus (another Phrygian leader) and King Priam of Troy, one generation before the Trojan War. Priam mentions this to Helen of Troy in Book 3 of the Iliad. A part of the Phrygians are said to have been called after him Mygdonians.Ere now have I journeyed to the land of Phrygia, rich in vines, and there I saw in multitudes the Phrygian warriors, masters of glancing steeds, even the people of Otreus and godlike Mygdon, that were then encamped along the banks of Sangarius. For I, too, being their ally, was numbered among them on the day when the Amazons came, the peers of men. —Homer. Iliad, Book 3, lines 186I do not know how it is plausible that, after Priam had fought against them [i.e. Amazons] on the side of the Phrygians during the reign of Mygdon, the Amazons later would have come to Ilion as allies —Philostratus the Elder. Heroica, lines 749\nNotes\nReferences\n* Euripides, The Rhesus of Euripides translated into English rhyming verse with explanatory notes by Gilbert Murray, LL.D., D.Litt, F.B.A., Regius Professor of Greek in the University of Oxford. Euripides. Gilbert Murray. New York. Oxford University Press. 1913. [http://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0238 Online version at the Perseus Digital Library.]\n*Euripides, Euripidis Fabulae. vol. 3. Gilbert Murray. Oxford. Clarendon Press, Oxford. 1913. [http://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0119 Greek text available at the Perseus Digital Library].\n*Homer, The Iliad with an English Translation by A.T. Murray, Ph.D. in two volumes. Cambridge, MA., Harvard University Press; London, William Heinemann, Ltd. 1924. . [http://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0134 Online version at the Perseus Digital Library.]\n*Homer, Homeri Opera in five volumes. Oxford, Oxford University Press. 1920. . [http://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0133 Greek text available at the Perseus Digital Library].\n*Pausanias, Description of Greece with an English Translation by W.H.S. Jones, Litt.D., and H.A. Ormerod, M.A., in 4 Volumes. Cambridge, MA, Harvard University Press; London, William Heinemann Ltd. 1918. . [http://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0160 Online version at the Perseus Digital Library]\n*Pausanias, Graeciae Descriptio. 3 vols. Leipzig, Teubner. 1903.  [http://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0159 Greek text available at the Perseus Digital Library].\n*Publius Vergilius Maro, Aeneid. Theodore C. Williams. trans. Boston. Houghton Mifflin Co. 1910. [http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.02.0054%3Abook%3D1%3Acard%3D1 Online version at the Perseus Digital Library.]\n*Publius Vergilius Maro, Bucolics, Aeneid, and Georgics. J. B. Greenough. Boston. Ginn & Co. 1900. [http://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.02.0055 Latin text available at the Perseus Digital Library].\n*William Smith. A Dictionary of Greek and Roman biography and mythology. s.v. [https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0104%3Aalphabetic+letter%3DM%3Aentry+group%3D32%3Aentry%3Dmygdon-bio-2 Mygdon].'' London (1848)."
    }
  ]
}