{
  "content": [
    {
      "type": "text",
      "text": "# Myking Church\n\n|location               = Alver Municipality,Vestland\n|country                = Norway\n|churchmanship          = Evangelical Lutheran\n|denomination           = Church of Norway\n|previous denomination  = Catholic Church\n|diocese                = Bjørgvin bispedømme\n|deanery                = Nordhordland prosti\n|parish                 = Lindås\n|status                 = Parish church\n|functional status      = Active\n|founded date           = 13th century\n|consecrated date       = 17 November 1861\n|completed date         =\n|closed date            =\n|events                 =\n|architect              = Christian Heinrich Grosch\n|architectural type     = Long church\n|style                  =\n|materials              = Stone\n|capacity               = 250\n|embedded =  }}\nMyking Church () is a parish church of the Church of Norway in Alver Municipality in Vestland county, Norway. It is located in the village of Myking, along the inner Austfjorden. It is one of the three churches for the Lindås parish which is part of the Nordhordland prosti (deanery) in the Diocese of Bjørgvin. The white, stone church was built in a long church design in 1861 using plans drawn up by the architect Christian Heinrich Grosch. The church seats about 250 people.\nHistory\nThe earliest existing historical records of the church parish date back to the year 1360, but the church was likely built before that time. The first church was a wooden stave church that was possibly built during the 13th century. The church was originally located about  northwest of the present location. In 1606, the church was torn down and replaced by a new timber-framed building on a site that was very close to the old one. In the mid-1800s, it was decided to build a new church. It was the request of the villagers that the new church be built of stone from the surrounding area rather than a wood church, and it was also decided to move the location of the church. The new stone church was built about  southeast of the old church site, so that it was closer to the main village area. The new church was consecrated on 17 November 1861 by the local provost Hveding. For the 100th anniversary in 1961, the church underwent a major restoration, according to plans by architect Stensaker. The church received a small addition of a sacristy, a new floor, and new pews. The pulpit was restored, and insulation was added over the ceiling, in addition to new pieces of furniture.\nSee also\n*List of churches in Bjørgvin\nReferences"
    }
  ]
}