{
  "content": [
    {
      "type": "text",
      "text": "# Mysore invasion of Calicut\n\nKingdom of Mysore\n*Kingdom of Palakkad\n| combatant2        = Calicut\n| commander1        =  Hyder Ali Makhdoom Ali\n| commander2        = Zamorin Raja\n| casualties1       =\n| casualties2       =\n| strength1         = Total: 7,000\n*5,000 Infantry\n*2,000 Cavalry\n*5 Cannons\n| strength2         = Unknown\n}}\nThe Mysore invasion of Calicut was the result of the Calicut's attack on Palghat in 1756–1757. This comprised the attacks of the Zamorin of Calicut on the Kingdom of Palakkad, situated east to Calicut. It  was a continuation of the attacks on the Kingdom of Valluvanad, the traditional rival of Calicut. In the one sided Valluvanad attacks the Zamorin had captured much of the land from Eranad to Nedunganad. So, this time Zamorin marched against Palakkad and easily occupied Nadvattom which tore the Kingdom of Palakkad right through the middle.\nKomi Achan, the King of Palakkad, requested the faujdar of Dindigul, Hyder Ali to help him. Zamorin was fighting a war against Raja of Cochin at that time. Hyder Ali sent a massive force under his brother-in-law Makhdoom Ali and soon the allied forces swept through the Zamorin's territory and reached the sea coast. By these attacks, Hyder Ali also planned to capture the vast treasuries of Malabar kings which were obtained by the spice trade.\nZamorin came to a treaty with Haider Ali, in which he was demanded to pay twelve lack rupees as the war reparations. However, the Zamorin technically deceived Hyder Ali after the return of the Mysore Army from Malabar. But, for his role in these activities, Hyder Ali was rewarded by Devaraja, the Prime Minister of Mysore, with the jaghir (regional governorship) of Bangalore.\nBackground\nThe Zamorins of Calicut were one among the eleven successors of the Chera empire, and it's ruler called Nediyiruppu Swaroopam, commonly referred to as the Zamorin due to their hereditary title. The port-town of Calicut had already gained renown as an international trade hub for spices and textiles. The rulers of this kingdom flourished through their maritime trade connections, amassing significant prosperity and consolidating considerable political influence and authority throughout the Middle Ages in Kerala's history.\nThe Zamorins of Calicut were sovereign rulers who fiercely preserved their independence for over eight centuries, never bowing to the authority of even the mighty Mughal Empire in Delhi. Renowned for their hospitality, religious tolerance, and patronage, they welcomed trading communities from various nations, including Arabs, Abyssinians, and Egyptians. These foreign traders, along with their families and agents, were provided with facilities to establish settlements across the coastline of the Zamorin's domains. The Zamorin maintained a formidable defensive force commanded by Mappila Muslims and Nairs. The naval fleet of the Zamorin, led by Kunjali Marakkars, gained renown for repelling Portuguese campaigns in the Arabian Sea.\nIn 1755, Hyder Ali, the commander of the Kingdom of Mysore, assumed the role of Faujdar of the Mysore stronghold Dindigul, commanding a force comprising 3,000 infantry and 1,500 cavalry. During this period, Hyder Ali initiated independent campaigns, deviating from actions solely for the Kingdom of Mysore.\nFrom 1751 onwards, Hyder embarked on an aggressive campaign of conquest and annexation. He successfully annexed Sira and its dependencies, as well as forts previously occupied by the Marathas. The Poligars of Raidurg and the chief of Harpunhalli surrendered without resistance, while the Chittaldurg Poligar's evasion of Hyder's summons led to the forcible annexation of their country.\nHyder's notable achievement during this period was the conquest of Bednur. Despite the Rani of Bednur offering a ransom of 15 lakhs of pagodas, Hyder marched against the city, finding it almost undefended as the Rani had fled to Bellalraydurg. Seizing Basavarajdurg, Honave, Mangalore, and Bellalraydurg, Hyder strengthened the fortifications of Bednur, renaming it Hydernagar. It is noteworthy that Hyder proclaimed himself as the true master of these dominions, unlike in other parts of the kingdom where he administered in the name of the Mysore king. This marked the first instance where Hyder asserted his right to strike coinage in his own name, considering Bednur as his 'Swarajya' (self-rule).\nThe influence of the Kolathiri dynasty was limited to the town of Chirakkal. The Muslim leader, Ali Raja, held authority over Kannur. The Kadathonad chief governed the region between the Mahe and Kotta rivers. A branch of the Kilattanad family extended north of the Kavvyi river. The Kottayam Taluk was divided between the Iruvalinad Nambiars and the Puranad or Kottayam Rajas. Hyder had ambitious designs on Malabar from the very beginning. The intricate political landscape in Malabar provided him with a significant opportunity.\nWar at Palakkad\nThe initial opportunity for Hyder to invade Malabar arose when the ruler of Palakkad sought assistance. In 1756, the Zamorin of Calicut expanded his kingdom by defeating weaker adversaries, including the Raja of Palakkad, capturing a portion of his territory, and named it as Naduvattam. Consequently, the Raja of Palakkad turned to Hyder Ali for support.\nSuddenly, Hyder dispatched his brother-in-law, Makhthoom Ali Khan, to Palakkad with an army comprising 2,000 cavalry, 5,000 infantry, and five cannons to aid the Raja of Palakkad. The Mysorean forces received support from the Nairs of Palakkad, and together they repelled the troops of the Zamorin from the Palakkad territories. Realizing the inability of his troops to withstand the Mysorean assault, the Zamorin surrendered and consented to pay a war indemnity of twelve lakh rupees.\nReferences"
    }
  ]
}