{
  "content": [
    {
      "type": "text",
      "text": "# Myth: History in the Making\n\nMyth: History in the Making is a 2D platform game developed and published by British publishing house System 3 for the Commodore 64, Amiga, Amiga CD32, Amstrad CPC and ZX Spectrum. It was also released on the NES as Conan: The Mysteries of Time. It was officially announced for Atari ST and a preview version was available, but the full version was never released.\nPlot\nIn the version of the game released on the Commodore 64, ZX Spectrum and Amstrad CPC, the player controls a teenage boy from the 20th century, who one day falls through a tear in the space-time continuum and is transported to the \"Time of Legends\". There he is rescued by a high priestess, who informs him that their world is under attack from Dameron, the Dark Angel of Time, who must be destroyed if he is to have any hope of ever getting home. Armed with an enchanted sword, he takes on Dameron and the legions of demons and monsters under his command, eventually succeeding in his mission and being returned to his own time.\nThe later version released on the Amiga has a broadly similar scenario, but changes the player character to Ankalagan, a mystical warrior based in the year 63AD, who uses the powers of Stonehenge to travel in time and combat evil throughout the ages. At the conclusion of this game, Ankalagan defeats Dameron and returns to Stonehenge, whereupon a (ultimately unmade) sequel named Dawn of Steel is announced.\nGameplay\nEach level is centred on a certain location, such as in Hades, an Egyptian pyramid and ancient Greece, where the player must collect a magic orb in each to finish. Each level is based around related myths and legends. The gameplay consists of running and jumping through each level, collecting objects and weapons, fighting enemies and solving puzzles. Enemies include skeletons, demons, wraiths, mummies and vikings. Weapons include a sword, gun and fireballs. Each level contains a mythical boss enemy, such as Medusa, Thor and a Hydra. Puzzles involve using the right object in the right location to progress, such as throwing skulls into a pit of fire to summon a monster, and using the right weapon against enemies, such as attacking a specific monster with tridents. The user manual gave some background information about the various myths referred to in the game and gave hints to the puzzles.\nReception\nThe ZX Spectrum version was voted number 12 in the ''Your Sinclair Readers' Top 100 Games of All Time.\nReferences\nExternal links\n*\n*\n* Zzap! 64 review of Myth'': [http://www.zzap64.co.uk/cgi-bin/displaypage.pl?issue=056&page=14&magazine=zzap Page 1] [http://www.zzap64.co.uk/cgi-bin/displaypage.pl?issue=056&page=015&magazine=zzap Page 2]\n*"
    }
  ]
}