{
  "content": [
    {
      "type": "text",
      "text": "# N-Peace Awards\n\n}}\nN-Peace, or ‘Engage for Equality, Access, Community and Empowerment’ is a UNDP flagship initiative founded in 2010 to commemorate a decade of UNSCR 1325 implementation via the Women, Peace and Security (WPS) agenda.\nCurrently unique to the Asia-Pacific region, N-Peace operates in Afghanistan, Pakistan, Myanmar, Sri Lanka, Indonesia, the Philippines, and Nepal with the goal of increasing the role of women in conflict resolution and peace-building. N-Peace is built on the premise that if targeted men, women, and civil society organisations are supported with increased investments in capacity, skills, and resources, they will be able to create institutional and social shifts that prioritise the inclusion and empowerment of women and girls, and ultimately change the discourse on the roles of women in peace-building.\nMany interventions aimed at facilitating WPS have approached women's inclusion through top-down tactics: influencing policy and lawmakers, empowering women to realize their economic potential, and introducing quotas for women's participation in peace agreements and political institutions. However, these approaches arguably do not always address the underlying structural causes of gender inequality. Furthermore, considering peace a top-level political or military process falls short of addressing the broader, nuanced issues faced by ordinary people affected by conflict in society. The annual N-Peace Awards, therefore, serve to shine a much-needed spotlight on grassroots women advocates in the region.\nN-Peace ultimately serves four primary goals: first, to conduct dialogues among communities, governments and other groups related to WPS; second, to build the capacity of women peace activists working on the ground; third, to expand and strengthen the network of peace-building activists to best implement UNSCR 1325; and finally, to support women's participation in peace and security through sharing their stories.\nList of award winners\n{| class='wikitable sortable' style=\"width:100%\"\n|Winner\n|Year\n|Achievements\n|Title of Award\n|Country of citizenship\n|-\n|Rubina Feroze Bhatti\n|2011\n|Founder of Taangh Wasaib, Rubina is devoting her life to creating a more peaceful Pakistan. She protects the rights of religious minorities and women who are targets of gender-based violence.\n|Untold Stories\n|Pakistan\n|-\n|Electronita Duan\n|2011\n|Founder of  Politenik Perdamaian Halamahera, an institute for those whose education was interrupted by armed conflict, she was awarded for her commitment to peacebuilding and the pursuit of peace through education and creative means.\n|Role Models  for Peace\n|Indonesia\n|-\n|Shreen Abdul Saroor\n|2011\n|Founder of both the Mannar Women's Development Federation and the Women's Action Network for the empowerment and promotion of women's rights, she was awarded for her efforts in campaigning for peace and creating stability between the different ethnic groups in Sri Lanka.\n|Role Models  for Peace\n|Sri Lanka\n|-\n|Filomena Barros Dos Reis\n|2011\n|Human rights and justice activist, she was awarded for her commitment to campaigning for political change on behalf of Timorese women.\n|Role Models  for Peace\n|Timor-Leste\n|-\n|Purna Shova Chitrakar\n|2011\n|Founder of the \"Ban Landmines Campaign Nepal\", she was awarded for her effort in empowering landmines victims and providing them with access to the opportunities they need to fulfil their goals.\n|Role Models  for Peace\n|Nepal\n|-\n|Amina Azimi\n|2012\n|Founder of Empowering Women with Disability and Landmine survivors, Amina was awarded for her advocacy for the protection and the promotion of the rights of women and girls with disabilities.\n|Emerging  Peace Champions\n|Afghanistan\n|-\n|Sadhu Ram Sapkota\n|2012\n|Former Joint  Secretary at the Ministry of Peace and Reconstruction of Nepal, he was awarded for his efforts in applying the UN Security Resolutions 1325 and 1820 on recognizing and empowering women's rights and experiences, making Nepal the first country in South Asia to nationalize and operationalize these provisions.\n|Men who  advocate for equality\n|Nepal\n|-\n|Sister Lourdes (Mana Lou)\n|2012\n|Founder of ISMAIK, a solidarity network across Timor-Leste dealing with urgent humanitarian assistance and poverty, she was awarded for her dedication in promoting and defending human rights in Timor-Leste.\n|Role Models for  Peace\n|Timor-Leste\n|-\n|Teresita Quintos Deles\n|2012\n|Social activist, civil servant and former Presidential  Advisor to the Peace Process in the Philippines, she was awarded for her efforts in implementing UNSCR 1325 on Women, Peace, and Security at national level in the Philippines.\n|Role Models for  Peace\n|Philippines\n|-\n|Radha Paudel\n|2012\n|Author and activist, she was awarded for her commitment to advocating for equal citizenship, the stop of child marriage and the empowerment of Mahesh women in Nepal.\n|Role Models for  Peace\n|Nepal\n|-\n|Rupika De Silva\n|2012\n|Founder of  Saviya, an NGO focused on supporting the rights of women and children in local communities, she was awarded for promoting a peace based approach of development for southern provinces and other conflict-affected areas of Sri Lanka and empowerment of women's entrepreneurship skills.\n|Role Models for  Peace\n|Sri Lanka\n|-\n|Suraiya Kamaruzzaman\n|2012\n|Founder of Flower Aceh and advocate for the rights of Acehnese women, Suraiya was awarded for work to empower women by ensuring their safety and advising them on issues of economic and reproductive rights.\n|Role Models for  Peace\n|Indonesia\n|-\n|Quhramaana Kakar\n|2012\n|Gender  Advisor for the Afghanistan Peace and Reconciliation Program, she has been instrumental in developing gender-responsive policies and organising women's groups to function as a pressure group to the government. Quhramaana was awarded for her commitment to engaging women and youth in the most insecure parts of the country towards creating peace and rebuilding Afghanistan\n|Role Models for  Peace\n|Afghanistan\n|-\n|Farkhunda Zahra Naderi\n|2012\n|Former Afghan  Parliamentarian and Senior Advisor to the President on UN Affairs, she was awarded for her commitment to representing women's voice in institutional settings and fighting for their political participation.\n|Role Models for  Peace\n|Afghanistan\n|-\n|Rohaniza Usman\n|2013\n|Former Philippine Country Director and Coordinator for the Asia America Initiative, Rohaniza was awarded for promoting peace and development through education, inter-generational engagement and socio-economic development in Mindanao and Bangsamoro.\n|Emerging  Peace Champions\n|Philippines\n|-\n|Suprayoga Hadi\n|2013\n|Civil servant and champion of women's rights, Suprayoga was awarded for his efforts in the inclusion of women in peace and security issues in Indonesia.\n|Men who  Advocate for Equality\n|Indonesia\n|-\n|Masuada Karokhi\n|2013\n|Afghan member of Parliament and MP and activist, Masuada was awarded for raising awareness about the promotion and protection of women's rights in Afghanistan.\n|Role Models  for Peace\n|Afghanistan\n|-\n|Shashi Kumary Adhikary\n|2013\n|Lawyer and advocate for gender equality, she was awarded for her commitment to campaigning for gender equity within Nepal's laws and women's access to equitable justice, promoting women's rights from education and property rights to the basic right of identity.\n|Role Models  for Peace\n|Nepal\n|-\n|Valentina Sagala\n|2013\n|Founder of Yayasan Institut Perempuan, an NGO advocating for laws to promote the protection of women and children, monitoring policy formulation and law enforcement, providing direct services to women and children survivors of violence, Valentina was awarded for her efforts in promoting and shaping laws against gender-based violence.\n|Role Models  for Peace\n|Indonesia\n|-\n|Irene M. Santiago\n|2013\n|Pioneering women's rights advocate and peacemaker, she is the co-founder of the Mindanao Commission on Women, an NGO composed of Moro, Christian, and indigenous women leaders. she was awarded for her commitment to advancing the significant role of women in the Women, Peace, and Security agenda.\n|Role Models  for Peace\n|Philippines\n|-\n|Thavachsri Charles Vijayaratnam\n|2013\n|Co-founder of the Kilinochchi District Women's Development Federation, an NGO providing psychosocial support and social integration programmes for service users, Thavachsri was awarded for promoting the improvement of the lives of marginalised peoples in rural communities in Sri Lanka.\n|Role Models  for Peace\n|Sri Lanka\n|-\n|Magdalena Bidau Soares\n|2013\n|Peace activist and former guerilla fighter, she is the founder of Feto Haluk Hadomi Timor, an NGO providing training and support for the widows of ex-combatants. She was awarded for her dedication to the ongoing struggle for peace, unity and women's rights in Timor-Leste.\n|Role Models  for Peace\n|Timor  Leste\n|-\n|Wai Wai Nu\n|2014\n|Former political prisoner, Wai Wai Nu is a peacebuilder and human rights advocate. Founder of the Women's Peace Network, a platform that promotes peace and mutual understanding between Myanmar's different ethnicities, she was awarded for her commitment to advocating marginalised women's rights.\n|The Peace  Generation\n|Myanmar\n|-\n|Shah Zaman\n|2014\n|Chairman of the Milky Way Foundation, lecturer and human rights activist, Shah was awarded for his dedication to ensuring high quality, free education to over 200 students in Pakistan.\n|The Peace  Generation\n|Pakistan\n|-\n|Miriam Coronel Ferrer\n|2014\n|First woman to have signed a major peace agreement as Chief Negotiator of one of the parties, activist and Political Science Professor, Miriam was awarded for her dedication in bringing more women to the peace table and implementing UNSCR 1325 at the national level in the Philippines.\n|Campaigning  for Action\n|Philippines\n|-\n|Hajji Khalil\n|2014\n|Former jihadist commander, who then became a prosecutor, district governor, and the head of the Badghis Provincial Peace Council in Afghanistan, Hajji was awarded for his contribution to conflict management, reconciliation, and inclusive peace in Afghanistan.\n|Campaigning  for Action\n|Afghanistan\n|-\n|Rabiah Jamil Beg\n|2014\n|Leading television journalist and champion of gender equality, she was awarded for her commitment to cover the social issues that hamper the progress of women in conservative societies, and she has been instrumental in bringing to the debate women's perspective.\n|Breaking  Stereotypes\n|Pakistan\n|-\n|Democracy and  Peace Women Network\n|2014\n|Yangon-based local civil society organisation that strives to connect with individuals and communities whose rights and freedoms have been marginalised. they are awarded for their committed to contributing to both democracy and peace for an inclusive Myanmar.\n|Thinking  Outside the Box\n|Myanmar\n|-\n|Mona Parkash\n|2014\n|Vice President of the Future Youth Group Hyderabad, which promotes peace and tolerance in Pakistani society, she was awarded for her efforts in promoting and providing education to marginalised Pakistani children.\n|Untold  Stories\n|Pakistan\n|-\n|Bimala Kadayat\n|2014\n| Youth mobilizer and community role model for building sustainable peace, she was awarded for her efforts in educating her community on issues of bonded labour, violence against women, discrimination, and child marriage.\n|Untold  Stories\n|Nepal\n|-\n|Mi Kun Chan Non\n|2014\n|Director and Vice-Chair of the Mon Women's Organisation and women's rights champion, she was awarded for advocating women's participation in the peace processes and political life in Myanmar.\n|Untold  Stories\n|Myanmar\n|-\n|Syarifah Aliyyah Shihab\n|2014\n|Founder of the Sharifah Aliyyah Shibab Foundation, which fosters opportunities for marginalized youth discouraging them from being influenced by fundamentalist and extremist opportunities, she was recognized for contributing to the creation of an anti-terrorism mentality among youth in Indonesia.\n|Untold Stories\n|Indonesia\n|-\n|Hasina Jalal\n|2014\n|Advocate  for women's rights, journalist and lecturer in rural Afghanistan, she was awarded for pushing the agenda of women's rights in Afghanistan through capacity building with numerous national NGOs.\n|Afghanistan\n|-\n|Rahmatullah Noorzai\n|2015\n|Youth leader and founder of an educational institute offering free classes and training to internally displaced people, Rahmatullah was recognized for his work with internally displaced women and children in Afghanistan.\n|Peace  Generation\n|Afghanistan\n|-\n|Kaushila Chaudhary\n|2015\n|Former bonded laborer and human rights activist, Kaushila was awarded for her work in ending discrimination and gender-based violence against ex-Kamaiyas in Nepal.\n|Peace Generation\n|Nepal\n|-\n|Rahmat Ullah Rahimi\n|2015\n|Founder of Modern  Schools for Girls, an educational facility which has provided free education to more 600 girls in six refugee communities, he was recognized for championing women and girls' rights and efforts to end child marriages.\n|Peace  Generation\n|Afghanistan\n|-\n|Maryam Durani\n|2015\n|Former Kandahar  Provincial Council Member and advocate for women's rights, Maryam was awarded for her many initiatives championing women's inclusion in political and social life in Kandahar, Afghanistan.\n|Peace  Generation\n|Afghanistan\n|-\n|Jo Genna Martin Jover\n|2015\n|Grassroot activist for discriminated indigenous tribes in the Philippines, she was awarded for her dedication to promoting social and cultural equality of indigenous people, specifically the Moro women, and for encouraging peacebuilding between the government and the Moro communities.\n|Untold  Stories\n|Philippines\n|-\n|Rubina Feroze Bhatti\n|2015\n|Executive Director of Taangh Wasaib Organisation, a rights-based organisation tackling violence against women, religious intolerance, and discriminatory laws in Pakistan, Rubina was recognised for her role in fighting against gender-based violence and introduced human rights education programming in over 200 schools.\n|Untold  Stories\n|Pakistan\n|-\n|Sharmila Thapa\n|2015\n|Founder of the Samida Women's Development Forum, an NGO empowering and supporting single mothers in Nepal, she was awarded for advocating for legislative changes against gender-based violence and providing a support system to women victims of violence.\n|Untold Stories\n|Nepal\n|-\n|Ja Nan Lahtaw\n|2015\n|Peace advocate and Executive Director of the Nyein Foundation, Ja Nan was recognised for her work in facilitating political dialogues between the Myanmar government and cease-fired ethnic armed organizations and advocating for their inclusion in Myanmar's political life.\n|Untold  Stories\n|Myanmar\n|-\n|Hasina  Neekzad\n|2015\n|Political and human rights activist for women and children's rights in Afghanistan, she was awarded for building a culture of peace through the positive engagement of young men and villages elders in the Herat province.\n|Untold  Stories\n|Afghanistan\n|-\n|Aliya Harir\n|2016\n|Co-founder of Aaghaz-e-Dozi, an Indo-Pak friendship initiative which calls for change and new narratives in India-Pakistan relations and Youth Ambassador of Change for the Global Youth Peace Festival, aliya was recognised for her role in advocating for a world where young people are empowered, regardless of their background, ethnicity, or gender.\n|Peace  Generation\n|Pakistan\n|-\n|Rizky Ashar  Murdiono\n|2016\n|Youth leader and co-founder of the 2030 Youth Force Indonesia initiative, Rizky was awarded for his role in empowering and engaging young people in the implementation of SDGs and the promotion of peace and rights awareness, LGBT rights, and disability acceptance.\n|Peace Generation\n|Indonesia\n|-\n|Mossarat  Qadeem\n|2016\n|Peace activist and founder of  PAIMAN Trust, an NGO raising awareness and educating communities on the effects of violent extremism, TOLANAS, and the Women's Alliance for Security Leadership, Mossarat was recognised for her role in educating women to develop critical negotiation skills to aid wider peace-building.\n|Campaigning  for Action\n|Pakistan\n|-\n|Mariam  Barandia\n|2016\n|Executive Director of Kapamagogopa Inc., an NGO which provides skills training for young Muslims and former women combatants to expand their economic opportunities and exercise their role in building peace, she was awarded for her efforts in dispelling negative perceptions and prejudices between communities in the Philippines.\n|Untold  Stories\n|Philippines\n|-\n|Rizwana Shah\n|2016\n|Women's rights advocate, Rizwana was awarded for her role in empowering women to gain financial independence in conservative and patriarchal parts of society and advocating for peace as a source of inclusion.\n|Untold Stories\n|Pakistan\n|-\n|Sumika  Perera\n|2016\n|Social activist and founder of the Women's Resource Centre, Sumika was recognised for her role in empowering and supporting women to embrace their rights and face the subjugation entrenched in the society they live in.\n|Untold  Stories\n|Sri Lanka\n|-\n|Habiba Sarabi\n|2016\n|First woman Governor within Afghanistan and Deputy Chair of Afghanistan's High Peace Council, Habiba was awarded for her role in bringing peace to Afghanistan and to enhance and enrich civil and political rights for women and girls following the Taliban rule.\n|Untold  Stories\n|Afghanistan\n|-\n|Basanti  Chaudary\n|2016\n|Former bonded-laborer and Chair of the Kamaiya Pratha Unmulan Samaj (KAPUS), she was recognised for her role in helping violence-affected women to improve their economic and social circumstances, raising awareness of their rights, and providing them with the tools for empowerment.\n|Untold  Stories\n|Nepal\n|-\n|Dwi Rubiyanti Kholifah\n|2016\n|Campaigner for improved rights of minority groups and marginalized women, she was awarded for her role in spreading peace education throughout Indonesia and work in developing leadership skills for women.\n|Untold  Stories\n|Indonesia\n|-\n|Farhat Asif\n|2017\n|Founder of the Institute of Peace and Diplomatic Studies, she was awarded for facilitating cooperation between government officials, civil societies, think-tanks, and educational institutions to raise the subject of women's inclusion in peace negotiations in Pakistan.\n|Campaigning  for Peace\n|Pakistan\n|-\n|Gunawan\n|2017\n|Co-founder of the Sikola Mombine programme, an independent educational institution for women in central Sulawesi that provides training and leadership skills, he was recognised for his role in empowering women in Poso to take more prominent roles in both village decision-making and the correlating peace-building process.\n|Campaigning  for Peace\n|Indonesia\n|-\n|Sharif Shah Safi\n|2017\n|University lecturer and Debate Program Director of the Afghanistan Youths Civic Engagement and Educational Organization, Sharif was recognised for his role in preventing extremism, violence, and inequalities by promoting education and respectful conversations among youths.\n|Peace Generation\n|Afghanistan\n|-\n|Suraya Yosufi\n|2017\n|Founder of the Afghan Girls Debating Project, a project for high school and university students offering specialised training in critical thinking, rational reasoning, research skills, time management, and teamwork, Suraya was awarded for empowering young girls and providing a platform for Afghan women to speak their minds freely.\n|Peace Generation\n|Afghanistan\n|-\n|Hadja Giobay Diocolano\n|2017\n|Founder of the Kadtabanga Foundation for Peace and Development Advocates, which helps conflict-affected and conflict-vulnerable communities in central Mindanao become Peace and Development Communities, she was awarded for promoting a culture of peace among communities affected by conflict, especially targeting youth and women.\n|Untold Stories\n|Philippines\n|-\n|Bernadine Anderson\n|2017\n|Founder of Bridge2Peace (B2P) and La Petite Fleur School in Sri Lanka, she was recognised for her work in supporting rehabilitation efforts by engaging with young former Tamil Tigers, achieving peace through education.\n|Untold Stories\n|Sri Lanka\n|-\n|Farhat Sajaad\n|2017\n|Co-founder of the Shining Light Community Development Organisation, a social welfare organisation that equips communities with innovative education, training, and development programmes, she was awarded for encourages Muslim-Christian dialogue through providing training for both communities in economic empowerment activities.\n|Untold Stories\n|Pakistan\n|-\n|Rahmatan\n|2017\n|Humanitarian aid worker, counselor, and campaigner for women's judicial rights in Aceh, Rahmatan was awarded for her work in empowering Acehnese women and providing them with the support to emerge as leaders from the grassroots level.\n|Untold  Stories\n|Indonesia\n|-\n|Srijana Karki\n|2017\n|Leading social activist calling for the end of gender-based violence, Srijana was awarded for her role in ensuring that the voices of those belonging to marginalised groups or communities are adequately represented and heard at the government level.\n|Untold  Stories\n|Nepal\n|-\n|Cheery Zahau\n|2017\n|Co-founder of the Women's League of Chinland and member of the Chin Progressive Party, she was awarded for her efforts in empowering Chin women refugees with leadership training, education programmes, and health and nursing programmes.\n|Untold  Stories\n|Myanmar\n|-\n|Sayeeda Muradi\n|2017\n|Women's rights activist, Sayeeda was recognised for her role in managing inclusive'peace shuras' and supporting conflict resolutions for women's issues at community and district level.\n|Untold  Stories\n|Afghanistan\n|-\n|Muqadasa Ahmadzai\n|2018\n|Peace and women's rights activist, she was awarded for her grassroots community efforts against conflict and supporting survivors of domestic violence.\n|Peace Generation\n|Afghanistan\n|-\n|Mary Akrami\n|2018\n|Activist, founder of the Afghan Women Skills Development Center and member of Afghanistan High Peace Council, she was awarded for having established peace \"shuras\" for women seeking conflict resolution.\n|Campaigning for Action\n|Afghanistan\n|-\n|Hira Singh Thapa\n|2018\n|Social activist and champion of women's rights, he was awarded for his continuous efforts in encouraging men to help end the practice of \"chauupadi\", child marriage, domestic violence, and menstruation taboos in Nepal.\n|Campaigning for Action\n|Nepal\n|-\n|Samira Gutoc-Tomawis\n|2018\n|Social activist and government official, she was awarded for her commitment to advocating the rights of women and marginalised groups in post-conflict Philippines.\n|Untold Stories\n|Philippines\n|-\n|Mira Kusumarini\n|2018\n|Preventing violent extremism expert and founder of C-Save (the Civil Society Action Against Violent Extremism), she was awarded for her work in rehabilitating and reintegrating ISIS-affiliated children and women deportees back safely into society.\n|Untold Stories\n|Indonesia\n|-\n|Logshari Kunwar\n|2018\n|Journalist and activist, she was awarded for her work in investigating gender-based violence and human rights violations in Nepal.\n|Untold Stories\n|Nepal\n|-\n|Visaka Dharmadasa\n|2018\n|Peace activist and founder of the Association of War Affected Women, she was awarded for encouraging important dialogues between women of different ethnicities in Sri Lanka, advocating for the empowerment and inclusion of women in peacebuilding process.\n|Untold Stories\n|Sri Lanka\n|-\n|Cynthia Maung\n|2018\n|Social activist and medical doctor, founder of the Mae Tao Clinic, she was awarded for her efforts in providing emergency maternal healthcare in conflict areas to refugee women at the Thai-Myanmar border.\n|Untold Stories\n|Myanmar\n|-\n|Mahira Miyanji\n|2018\n|Social activist and founder of Woman is Nation Welfare Organisation, she was awarded for her commitment to women's empowerment and girls' education in Lyari, Karachi.\n|Untold Stories\n|Pakistan\n|-\n|Khojasta Sameyee\n|2018\n|Afghan journalist, she was awarded for her work in using radio to inform remote communities of women's rights, politics, and peacebuilding.\n|Untold Stories\n|Afghanistan\n|-\n|Maisam Iltaf-Kazemi\n|2019\n|\n|Peace Generation\n|Afghanistan\n|-\n|Sohaila Rezaee\n|2019\n|\n|Peace Generation\n|Afghanistan\n|-\n|Ram Bahadur Sunar\n|2019\n|\n|Campaigning for Action\n|Nepal\n|-\n|Amina Rasul-Bernardo\n|2019\n|\n|Campaigning for Action\n|Philippines\n|-\n|Froilyn Tenorio Mendoza\n|2019\n|\n|Untold Stories\n|Philippines\n|-\n|Meena Baber\n|2019\n|\n|Untold Stories\n|Pakistan\n|-\n|Sarita Saru B.K.\n|2019\n|\n|Untold Stories\n|Nepal\n|-\n|May Sabe Phyu\n|2019\n|\n|Untold Stories\n|Myanmar\n|-\n|Dewi Rana Amir\n|2019\n|\n|Untold Stories\n|Indonesia\n|-\n|Dayani Panagoda\n|2019\n|\n|Untold Stories\n|Sri Lanka\n|-\n|Zarqa Yaftali\n|2019\n|\n|Untold Stories\n|Afghanistan\n|-\n|}\nReferences"
    }
  ]
}